{
  "content": [
    {
      "type": "text",
      "text": "# N. P. Smith Pioneer Hardware Store\n\n| built        = 1909\n| architect    = Nichols P. Smith\n| architecture = Western false front\n| added        = 1984\n| refnum       = 84002980\n}}\nThe N. P. Smith Pioneer Hardware Store is a historic commercial building in Bend, Oregon, United States.  The structure was built in 1909 by Nichols P. Smith, a Bend businessman.  The two-story building originally housed a hardware business on the ground floor with family quarters on the second floor.  The building is located on the Northwest Wall Street in downtown Bend.  It has been in continuous use as a commercial building since it first opened.  Today, the Smith Hardware Store is the only wood-frame structure that remains in downtown Bend.  Because of its importance to the history of Bend, the Smith Pioneer Hardware Store is listed on the National Register of Historic Places.\nNichols Smith\nAt the age of 34, Nichols Paul Smith came to Central Oregon to help survey the Bend town site for Alexander M. Drake, owner of the Pilot Butte Development Company.  Smith worked as a surveyor and carpenter, helping to establish the Bend community.  He built a house near the Deschutes River in the area that is now the Drake Park Neighborhood Historic District.  In 1903, Smith and his wife, Cora Bell, opened a hardware store on the east side of Wall Street near the center of downtown Bend.\nIn 1909, Smith built a new store across the street from his original location with an apartment upstairs so he could be close to his business.  Smith's new store sold a wide range of household goods including stoves and butter churns.  He also sold building materials, farm equipment, and hunting and fishing supplies.  When automobiles began to appear in Bend, Smith was the first businessman to sell gasoline to motorists.  When the Great Northern and Union Pacific railroads opened routes into central Oregon in 1911, a building boom began in Bend, and Smith's business prospered.  Smith retired from the hardware business around 1930.\nIn addition to being a successful businessman, Smith was also active in civic affairs and politics.  He was a member of Bend's volunteer fire department.  He also supervised the construction of the city's downtown sidewalks.  Smith was the local chairman of the Democratic Party and served on the election board for many years as well a bailiff for the Deschutes County Court.\nBuilding history\nThe N. P. Smith Pioneer Hardware Store and adjoining warehouse were built by Nichols P. Smith in June 1909, just four years after the city of Bend was founded.  The building originally housed a hardware store on the ground floor with second floor apartment where Smith and his family lived.  The structure was typical of the commercial building being constructed in Bend in the early 20th century, simple and functional.  The hardware store remained in business until 1930.  Since then several other businesses have occupied the building.  Smith's daughter, Marjorie Smith, was still living in the upstairs apartment in the 1980s.\nIn 1983, the building's street front exterior was renovated and restored.  The aluminum and plywood siding that had been installed over the years was removed, revealing the original façade still in excellent condition.  Window sills, corner boards, and the cornice molding were replaced.  Then the original horizontal lap siding and restored board trim were repainted in their original colors.\nThe N. P. Smith Pioneer Hardware Store is an excellent example of a commercial building from Bend's earliest period of development.  It was among the city's first retail stores.  Today, it is the oldest wood-frame structure that still exists in downtown Bend.  Because of its importance to Bend history, the N. P. Smith Pioneer Hardware Store was listed on the National Register of Historic Places on 5 April 1984.\nStructure\nThe Smith Pioneer Hardware Store is located on the west side of Wall Street between Oregon Avenue and Minnesota Avenue in downtown Bend.  It is a two-story wood-frame building with a footprint of 20 feet by 75 feet with an adjoining 20 foot by 70 foot warehouse in the back.  The combined structure occupies a 25 by 150 foot city lot.  There is a newer brick structure abutting the store's external wall on the north side.  On the south side of the building, there is a narrow walkway between the store and the neighboring brick structure.  It provides access to an open stairway that leads to the second floor apartment.  The back of the warehouse opens on to an alleyway called Brooks Street.\nThe Smith store is a good example of the western false front type commercial structure.  These simple commercial buildings were typically two stories with a vertical facade and square top.  A gabled-roof structure was often hidden behind the false front.  Like Smith, many owners ran a store or other business on the ground floor and live upstairs.  There were many false front buildings constructed in the Bend area between 1900 and 1910.  However, the Smith hardware store is the only surviving example in downtown Bend.\nOriginally, the store front was faced with six inch horizontal lap siding, trimmed at the corners with 1-by-6 vertical wooden molding.  The entrance to the store is through recessed double doors in the center of the building.  However, the double doors have been replaced by a single glass door with full-length windows on either side.  The entrance is flanked by two large display windows, each with four window panes.  On the second floor, there are two separate double-hung casement windows overlooking the street.  The façade was originally capped with a wooden cornice that extends 20&nbsp;inches out from the building's face, but it was eventually replaced by a molded stucco cornice.  The building has a flat roof that slope gently toward the rear of the structure.\nInterior\nIn the Smith building, the ground floor is commercial space, originally housing a hardware store.  Inside, the walls are finished with two-inch tongue-and-groove paneling.  The flooring is 1-by-4 tongue-and-groove planking.  Originally, there were built-in shelves along the full length of one wall.  The original light fixtures had glass shades and were suspended from the ceiling by drop-cords.  The door knobs, locks, and other hardware were brass.  Over the years, the original tongue-and-groove ceiling was covered by a suspended acoustic tile ceiling and fluorescent lights have been installed using the original drop-cords.  The original shelves have been replaced by new shelving that now runs along both sidewalls, and the floor is now carpeted.\nThe owner's apartment upstairs includes a living room, dining room, kitchen, and two bedrooms.  The walls and floor were finished with the same tongue-and-groove paneling and planking as downstairs.  However, the walls have been covered by wallpaper in the bedrooms and plasterboard in the other rooms and the floors have been carpeted.  The woodwork includes eight-inch baseboard molding and four-inch framing around the doors and windows.  The kitchen has built-in cabinets. There are ventilation transoms above some interior doors.  Like the ground floor, the light fixtures have glass shades and are suspended from the ceiling by drop-cords and the door hardware is brass.\nThere was originally a large open porch on the second floor adjacent to the living area.  Around 1915, the porch was enclosed and turned into additional living space.  That alteration added a third bedroom, a family room, a bathroom, and some interior storage space to the apartment.\nReferences"
    }
  ]
}