{
  "content": [
    {
      "type": "text",
      "text": "# NAACP Image Award for Outstanding News, Talk or Information – Special\n\nThe NAACP Image Award for Outstanding News, Talk, Or Information - Special was an award formed out of the award Outstanding News, Talk or Information (which started in 1989) and lasted until 1996 when the award was split into two categories; one for Series and one for Special. This thus gives the page its name. In 1997 the awards for series and special where merged into Outstanding News, Talk or Information Series/Special. Then Special was split into its separate award again in 1998 where it remained as a category until 2003 when it was remerged into one category Outstanding News, Talk or Information - Series or Special. These are the winners for Outstanding News, Talk, or Information - Special.\nWinners and nominees\n{| class=\"wikitable\"\n! Year\n! Special\n! Nominees\n|-\n| 1996\n| CNN Special Coverage: The Million Man March\n| \"Biography\" for episode \"Colin Powell\"\"Conversation with Ed Gordon: Johnnie Cochran\"Hoop Dreams\"Mandela's Fight for Freedom\"\n|-\n| 1998\n| Dinner with Oprah: A Lifetime Exclusive - Toni Morrison\n| \"Are You Black, White or What?\"Biography for episode \"Cinque--Freedom Fighter\"\"\"Ships of Slaves: The Middle Passage\"When We Were Kings\n|-\n| 1999\n| 4 Little Girls\n| \"Africans in America: America's Journey Through Slavery\"Biography for episode \"Nat King Cole - Loved in Return\"Intimate Portrait for episode \"Patti LaBelle\"\"Motown 40: The Music Is Forever\"\n|-\n| 2000\n| True Life For episode \"I Am Driving While Black\"\n| ABC News Nightline for episode \"Found Voices - Slave Narratives\"\"I'll Make Me a World\"\"The Black Press: Soldiers Without Swords\"\"Wonders of the African World with Henry Louis Gates Jr.\"\n|-\n| 2001\n| BET Tonight with Ed Gordon for special \"Black & Blue: A Town Hall Meeting In New York City\"\n| 60 Minutes Wednesday for special \"Death by Denial (Aids In Africa)\"Biography for special \"Sally Hemings: Redefining History\"\"The Greatest Boxer: Muhammad Ali\"\"Half Past Autumn: The Life and Works of Gordon Parks\"\n|-\n| 2002\n| BET Tonight Special: Aaliyah\n| \"America's I.O.U.: Slave Reparations\"\"2001 U.S. Open Final: Williams Vs. Williams\"\"ABC News Nightline for special \"Cincinnati: A City Searching for Justice & Peace\"\"Dateline NBC for special \"Lisa Jefferson & United Flight 93's Todd Beamer\"\n|}\nMultiple wins and nominations\nThey were no multiple winners, however Biography, ABC News Nightline, and BET Tonight were nominated four times, two times, and two times, respectively.\nSee also\n* List of American television awards\nReferences"
    }
  ]
}