{
  "content": [
    {
      "type": "text",
      "text": "# Nabhani dynasty\n\nBahlaMaqniyat\n| s1                     = Ya'rubids\n| p1                     = Seljuk Empire\n| flag_width             =\n| title_leader           = Malik (king)\n| government_type        = Monarchy\n| religion               = Islam\n| official_languages     = Arabic\n| year_start             = 1154\n| area_km2               =\n| year_end               = 1624\n| image_map              = Nabhanids Map.svg\n| native_name            =\n| conventional_long_name = Nabhanids\n| today                  =\n| HDI_year               =\n| HDI                    =\n| GDP_PPP_year           =\n| GDP_PPP                =\n| area_rank              =\n}}\nThe Nabhani dynasty (or Nabhanids;  ʾusrat banī nabhān), members of the Bani Nabhan family, also referred to as the Sultans of Sohar, were rulers of Oman from 1154 until 1624, when the Yaruba dynasty took power.; and Al-Siyabi \"Al-Is'af\", p. 116.}}\nOne of their most visible legacies is the Bahla Fort, a large complex of mud brick buildings on stone foundations built from the 12th to the 15th century.  It was registered in 1987 as a UNESCO World Heritage Site.\nBackground\nAfter the early days of Islam, the tribes in the interior of Oman were led by Imams, who held both spiritual and temporal power.\nThe Yahmad branch of Azd tribes gained power in the 9th century.\nThey established a system where the ulama of the Banu Sama, the largest of the Nizari tribes of the interior, would select the Imam.\nThe authority of the Imams declined due to power struggles.\nDuring the 11th and 12th centuries Oman was controlled by the Seljuk Empire. They were expelled in 1154, when the Nabhani dynasty came to power.\nRule\nBani Nabhan were one of the Arab tribes of the interior with an ascribed Azdi origin. After the collapse of the Makramid dynasty, the Buyids appointed the Bani Nabhan as the governors of Sohar. The Nabhanids retained their power under the transition to Seljuk rule, and emerged as sovereign rulers after the waning of the Seljuk state. They eventually came to control cities in the interior such as Nizwa and Rustaq, but these were won back by the Ibadi Imamate. in 2013 after major restoral work in the 1990s]]\nThe best quality frankincense, a valuable product in the Middle Ages, comes from Dhofar in the interior of southern Oman.\nThe Banu Nabhan controlled the trade in frankincense on the overland route via Sohar to the Yabrin oasis, and then north to Bahrain, Baghdad and Damascus.\nMuhammed al-Fallah of the Banu Nabhan emerged as a powerful leader in 1151 and had taken control by 1154.\nHe lived until 1176.\nThe Nabhans ruled as muluk, or kings, while the Imams were reduced to largely symbolic significance.\nThe Imams lost moral authority since the title came to be treated as the property of the dominant tribe at any time.\nAccording to the historian Sirhan bin Said there were no records of Imams from 1153, when Imam Musa bin Abu Ja'afar died, until 1406, when Imam Hubaise bin Muhammad died.\nThe Nabhan came to make their capital at Bahla.\nThe Bahla Fort is called Hisn Tammah, and is said to take its name from an Iranian ruler of the town before the Islamic period. The fort testifies to the power of the Nabhani in their heyday.\nThe period is poorly documented. It seems that at times the Nabhani only controlled part of the interior of the country, and at other times also ruled over the coastal lands. The Oman suffered from Persian invasions, and at one point the coast was controlled by the Kingdom of Hormuz. The Nabhan coordinated themselves politically with the Kingdom of Hormuz while they managed matters of the Omani interior. The Banu Nabhan were dominant over the other tribes until the end of the 15th century.\nThere are records of personal visits by Nabhani rulers to Ethiopia, Zanzibar, the Lamu Archipelago of what is now Kenya, and Persia.\nThe al-Nabhani dynasty of Pate Island in the Lamu Archipelago claimed descent from the Omani dynasty.\nDecline and fall\nOman had an elected Imam and a hereditary Nabhani sultan from the 15th century into the 17th century, with the Imams gaining the ascendancy.\nThe Nabhani ruler Suleiman bin Mudhafar was removed by the Imam Muhammad ibn Ismail (1500–29).\nHowever, the Nabhanis clung to power in the Bahla region.\nIn 1507 the Portuguese captured the coastal city of Muscat, and gradually extended their control along the coast up to Sohar in the north and down to Sur in the southeast.\nOmani histories record that the Bahla fort was destroyed in the early 17th century shortly before the Ya'Aruba dynasty took control of Oman, although it is possible that parts of the old structure remained and were used as the basis for later construction.\nIn 1624 Nasir bin Murshid of the Ya'Aruba took over control of Oman.\nLater years\nThe Nabahina retained power at the beginning of the Ya'rubi state and they treated Jabal al-akhdar (The Green Mountains located in the interior of Oman) as an emirate.\nThus, the Nabahinah transferred their loyalties from the Banu Rawahah to the Banu Riyam at the beginning of the seventeenth century.\nThey became the tamimah of the Banu Riyam and princes of the Jabal al-Akhdar, and survived as such until they were defeated in the war of Jabal Akhdar in 1956.\nAt the time the Sheikh of the Bani Riyam was Suleiman bin Himyar Al-Nabhani, Lord of the Jebel Akhdar-and descendant of the ancient Nabahina dynasty.\nAfter the war Suleiman bin Himyar fled to Saudi Arabia where he remained in exile until he returned to Oman on Thursday, 28 November 1996, where he lived his remaining days in Muscat until he died on Thursday, 7 May 1998 – most of his kin remain to this day living in Muscat the capital of Oman.\nAlthough the Ya'Aruba ruled under the title of Imam, since they originated from the Nabahina kings dynasty they actually continued to rule as kings inheriting the title of Imam through vertical succession, thereby contradicting the Imamate tradition which provides that the Imam must be chosen from among the ahl al-hal wal ‘aqd  transliterated as \"those who loosen and bind\". (This concept evolved during the period of the Khulafa ar-Rashidoon as a mechanism to choose the leader of the Muslims. The ahl al-hal wal ‘aqd are the leading personalities of society who are knowledgeable and have a proven track record of sincerity and sacrifice. They have no personal or class interests. The person who is appointed leader also does not covet such a position but is seen as most suitable for the job.)\nList of sultans\n{| class=\"wikitable\"\n! Name\n! Portrait\n! Reign start\n! Reign end\n! Notes\n|-\n|Muhammed al-Fallah ||  || 1406 || 1435 ||\n|-\n|Abul Hassan of Oman ||  || 1435 || 1451 ||\n|-\n|Omar bin al Khattab ||  || 1451 || 1490 ||\n|-\n|Omar al Sharif ||  || 1490 || 1500 ||\n|-\n|Muhammad bin Ismail ||  || 1500 || 1529 || Portuguese protectorate imposed on 15 April 1515.\n|-\n|Barakat bin Muhammad ||  || 1529 || 1560 ||\n|-\n|Abdulla bin Muhammad ||  || 1560 || 1624 ||\n|}\nNotes and references\nNotes\nCitations\nSources\n*\n*|url=https://whc.unesco.org/en/list/433|publisher=Unesco\n|title=Bahla Fort|access-date=2013-11-13}}\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*"
    }
  ]
}