{
  "content": [
    {
      "type": "text",
      "text": "# Nadaswaram\n\nNadhaswaram (TV series)}}\nThe nadaswaram is a double reed wind instrument from South India. It is used as a traditional classical instrument in Tamil Nadu, Andhra Pradesh, Telangana, Karnataka and Kerala and in the northern and eastern parts of Sri Lanka.\nThis instrument is \"among the world's loudest non-brass acoustic instruments\". It is a wind instrument partially similar to the North Indian shehnai, but much longer, with a hardwood body, and a large flaring bell made of wood or metal.\nIn South Indian culture, the nadasvaram is considered to be very auspicious, and it is a key musical instrument played in almost all Hindu weddings and temples of the South Indian tradition. It is part of the family of instruments known as mangala vadyam (lit. mangala \"auspicious\", vadya \"instrument\"). The instrument is usually played in pairs, and accompanied by a pair of drums called thavil; it can also be accompanied with a drone from a similar oboe, called the ottu.\nHistory\nA typical ensemble of two nadaswaram and two thavil\nThe nadasvaram is referred to in many ancient Tamil texts. The Cilappatikaram refers to an instrument called the \"vangiyam\". The structure of this instrument matches that of a nadasvaram. Since there are seven holes played with seven fingers, this was also called as the \"eḻil\". This instrument, too, is played in Tamil Nadu, and is popular among the Tamil diaspora.\nConstruction\nThe nadasvaram contains three parts namely, , , and .\nIt is a double reed instrument with a conical bore which gradually enlarges toward the lower end. The top portion has a metal staple () into which is inserted a small metallic cylinder () which carries the mouthpiece made of reed. Besides spare reeds, a small ivory or horn needle is attached to the instrument, and used to clear the reed of saliva and other debris and allows free passage of air. A metallic bell () forms the bottom end of the instrument.\nThe seevali, or reed, is made from a dried grass.\nTraditionally the body of the nadasvaram is made out of a tree called  (Tamil ஆச்சா; Hindi अंजन), although nowadays bamboo, sandalwood, copper, brass, ebony, and ivory are also used. For wooden instruments, old wood is considered the best, and sometimes wood salvaged from demolished old houses is used.\nThe nadasvaram has seven finger-holes, and five additional holes drilled at the bottom which can be stopped with wax to modify the tone. The nadasvaram has a range of two and a half octaves, similar to the Indian bansuri flute, which also has a similar fingering. Unlike the flute where semi and quarter tones are produced by the partial opening and closing of the finger holes, in the nadasvaram they are produced by adjusting the pressure and strength of the air-flow into the pipe. Due to its intense volume and strength, it is largely an outdoor instrument, and much more suited for open spaces than for indoor concerts.\nPlayers\nSome of the greatest early nadasvaram players include:\n● Tiruvidaimarudur P. S. Veerusamy Pillai\n* Thirumarukal Nadesa Pillai\n* T.N. Rajarathnam Pillai (1898–1956)\n* Thiruvengadu Subramania Pillai,\n* Vedaranyam Vedamoorthy\n* Karukurichi Arunachalam (1921–1964)\n* Kulikkarai P Rajendran Pillai(1970–2019)\n* Thirucherai Sivasubramanian Pillai\n* Thiruvarur S Latchappa Pillai\n* Acharyapuram Chinnathambillai (b. 1928)\n* Kulikkarai Pichaiyappa\n* M.S. Ponnuthayi (1928–2012)\n* Kizhvelur N.G. Ganesan\n* Andankoil A V Selvarathnam Pillai\n* Thiruvizha Jayashankar (b. 1940)\n* Brother teams of Keeranur and Thiruveezhimizhalai,\n* Semponnarkoil Brothers S R G Sambandam and Rajanna.\n* Dharumapuram S. Abiramisundaram Pillai and his son Dharumapuram A Govindarajan\n* Sheik Chinna Moulana (1924 - 1999)\n* Gosaveedu shaik Hassan sahieb  (1928–2021)\n* Sheik Mahaboob Subhani\n* Kaleeshabi Mahaboob\n* Namagiripettai Krishnan (1924–2001)\n* Madurai M.P.N. Sethuraman (1928–2000)\n* M.P.N. Ponnuswamy (1932–2023)\n* Ponnusamy brothers\n* Alaveddy N.K. Pathmanathan\n* Mambalan M.K.S. Shiva\n* S. R. D. Vaidyanathan (1929–2013)\n* Seshampatti T Sivalingam\n* Domada Chittabbayi (1930–2002)\n* Injikudi E.M. Subramaniam\n* Umapathy Kandasamy (1950–2017)\n* U.E.Palanivel, Chennai\n* Kundala Kambar, Nagercoil (1965)\n* Sankarapandia Kambar, Tirunelveli\n* Tiruvalaputtur T K Venupilla\n* Kulikkarai Brothers K.M Daksaha Moorthi Pillai & K.M Ganeshan Pillai\n* Pattamangalam, Selvaraj\n* Kudanthai Brothers Dr Srinivasan Kaliyamoorthy, Mr Shanmuganathan Kaliyamoorthy\nAmerican composers such as Lewis Spratlan   have expressed admiration for the nadasvaram, and a few jazz musicians have taken up the instrument: Charlie Mariano (1923–2009) was one of the few non-Indians able to play the instrument, having studied it while living in India. Vinny Golia, J. D. Parran, and William Parker have performed and recorded with the instrument. The German saxophonist Roland Schaeffer also plays it, having studied from 1981 to 1985 with Karupaia Pillai.\nIn popular culture\nAmong the Tamil movies, two released in the 1960s, namely Konjum Salangai(1962) starring Gemini Ganesan and Thillana Mohanambal(1968) starring Sivaji Ganesan, featured nadasvaram playing characters. For the Konjum Salankai movie, Karukurichi Arunasalam Pillai provided the nadasvaram music. Madurai Sethuraman and Ponnusamy brothers were employed for the nadasvaram playing duo characters Sivaji Ganesan and A.V.M. Rajan for the Thillana Mohanambal movie director AP Nagarajan dedicated this movie to legend Karukurichi Arunachalam.\nSee also\n* Tavil\n* Stone nadasvaram\nReferences\nExternal links\n* [http://orgs.usd.edu/nmm/India/1191Nagaswaram/OttuNagaswaram.html Images from The Beede Gallery Shawms (Ottu and Nagaswaram), Southern India, ca. 1900-1940] . National Music Museum, University of South Dakota."
    }
  ]
}