{
  "content": [
    {
      "type": "text",
      "text": "# Nadja Swarovski\n\n| birth_place = Germany\n| nationality = Austrian, American\n| occupation  = Chair Emeritus of Swarovski Foundation\n| website     =\n| spouse      = Rupert Adams\n| children    = 3\n}}\nNadja Lyn Swarovski (born 5 May 1970) is an Austrian-American businesswoman. She joined the Swarovski family company in 1995, 100 years after it was founded by her great-great-grandfather Daniel Swarovski in 1895 in Wattens, Austria. She was the first female member of the executive board, and led the global brand strategy and communications of the business, which turned over approximately €3.5 billion in 2017. She served as the Chair of the Swarovski Foundation and headed the global Swarovski Waterschool program. She stepped down from the company at the end of December 2021.\nEarly life and education\nSwarovski was born in Germany and grew up in Austria, the fifth generation of her family to be involved in the Swarovski Crystal Business. Her great-great-grandfather Daniel supplied Swarovski crystals to embellish dresses for Queen Victoria; and her grandfather Manfred Swarovski worked with Christian Dior to create the iconic 'Aurora Borealis' stones. Her father Helmut Swarovski ensured that Swarovski remained at the forefront of technological advances and new market opportunities.\nShe received a BA in Art History and Foreign Languages with a minor in Latin American Studies at Southern Methodist University in Texas, and studied at Sotheby's Institute of Art and the Gemological Institute of America in New York City.\nCareer\nSwarovski's career began at the Gagosian Gallery, before she went on to work for New York fashion PR Eleanor Lambert. She first worked for the Swarovski Crystal Business in Hong Kong before developing its branding and creative services functions in New York, followed by Paris, London and Singapore.\nOn joining the family business in the mid-1990s she initiated a program of collaborations between the Swarovski brand and leading figures in fashion and jewelry, design and architecture, and stage and screen. Through these collaborations she sought to position the company at the vanguard of creative and lifestyle trends and established herself as a leading patron of creativity.\nIn fashion, Swarovski initiated and oversaw Swarovski's collaborations with more than 200 designers, including Alexander McQueen, Philip Treacy, Jason Wu, Hussein Chalayan, Erdem and Mary Katrantzou, as well as supporting emerging and established design talent through the Swarovski Collective initiative. In addition, Swarovski supported the Council of Fashion Designers of America (CFDA) Awards since 2002; and partnered with the British Fashion Council as official partner sponsor of the Fashion Awards, held annually in London.\nIn 2002, Swarovski launched Swarovski Crystal Palace, a program of commissions that reimagined the traditional chandelier through collaborations with designers in the medium of Swarovski crystal. Featured designers included Zaha Hadid, John Pawson, Tom Dixon, Ross Lovegrove, Arik Levy and Yves Behar.\nSwarovski also furthered the company's long relationship with the film industry through collaborations with costume and set designers. Swarovski crystals have appeared in silver screen classics since the 1930s, including Blonde Venus, Gentlemen Prefer Blondes and Breakfast at Tiffany’s. In recent years, Swarovski crystals have featured in movies including Moulin Rouge!, Black Swan, Skyfall and Disney's live-action Cinderella.  In the music industry Swarovski oversaw collaborations with costume designers for performers such as Beyoncé, Taylor Swift, Jennifer Lopez and Madonna.\nIn 2007, Swarovski set up Atelier Swarovski, a luxury fashion jewelry and accessories line which offered cutting-edge pieces created in collaboration with designers, highlighting creativity, innovation and craftsmanship with crystal. Collaborators included Christopher Kane, Viktor & Rolf, Jean Paul Gaultier and Karl Lagerfeld. In 2016, Atelier Swarovski launched its home décor range, partnering with designers such as Daniel Libeskind, Ron Arad, Tord Boontje, and Fredrikson Stallard. In 2017, Swarovski oversaw the launch of Atelier Swarovski Fine Jewelry made with Swarovski Created Diamonds. This launch saw the brand further its commitment to ‘conscious luxury’, a concept it defined as creating beautiful products with the best available materials in a responsible way.\nIn 2018, Swarovski collaborated with two-time Oscar-nominated filmmaker Eric Valli and fashion designer Jean-Paul Gaultier on The Soul of Swarovski, a documentary short which captures the creative process behind a Swarovski crystal collaboration.\nFrom 2012 to 2020, Swarovski led the company's Sustainability strategy and oversaw its Corporate Social Responsibility initiatives. Building on Daniel Swarovski's founding principles of doing business in a way that respects the wellbeing of people and the planet, she steered the company in the direction of designing and manufacturing luxury goods that prioritize sustainable and ethical practices, while aligning Swarovski's efforts with the United Nations Sustainable Development Goals.\nSwarovski champions gender equality on international platforms and promotes women's empowerment through the Swarovski Foundation. Swarovski is a signatory of the United Nations’ Women's Empowerment Principles (WEPs), and part of the UN Women UK National Committee Corporate Advisory Group. In 2018, the company supported a research program with BSR (Business for Social Responsibility) to explore and improve the lives of women in the jewelry supply chain.\nSwarovski set up and chairs the philanthropic Swarovski Foundation, which was established in 2013 to support charitable initiatives and organizations working in three areas: culture and creativity, promoting human empowerment and preserving the environment. Key Swarovski Foundation partners include Women for Women International, Barefoot College, Nest, and The Nature Conservancy, while major capital projects have included the creation of the Swarovski Foundation Centre for Learning at the Design Museum in London.\nSwarovski leads the efforts of Swarovski Waterschool, the company's flagship community investment program, which educates students in six continents across the globe about safe and sustainable water use. In 2018, Swarovski collaborated with the UCLA School of Theater, Film and Television to create Waterschool, a feature-length documentary which premiered at the Sundance Film Festival and was released globally on Netflix.\nIn 2015, she was appointed UK ambassador for the non-profit Women for Women International, which empowers women survivors of war. In 2018 she was also made its German ambassador.\nSwarovski holds Board level positions at UCLA School of Theater, Film and Television, FIT Foundation and the German Fashion Council and is a member of The Nature Conservancy's European Council for Global Conservation.\nIn December 2021, she announced resignation from her family firm after 26 years to start a new chapter in her career, and that she would remain involved with the Swarovski Foundation as Chair Emeritus.\nRecognition\nIn 2020, Swarovski was named to the Business of Fashion’s BoF 500 professional index of the people shaping the fashion industry.\nIn 2020, she received the Business Leader of the Year Award from Positive Luxury for her sustainability initiatives.\nIn 2019, she received the Fashion Institute of Technology Social Impact in Sustainability Award.\nIn 2019, she received an honorary doctorate from University of the Arts London.\nIn 2018, she received the Fellowship Award at the Society of British and International Design awards.\nIn 2018, she was awarded the Luxury Briefing Award for Outstanding Individual.\nIn 2018, the Canadian Arts & Fashion Awards named Swarovski as the recipient of the Global Fashion Business Leader Award.\nIn 2018, she received the Visionary Award from the Women's Jewelry Association.\nIn 2017, she received a Stephan Weiss Apple Award from Donna Karan's Urban Zen Foundation.\nIn 2016, she was made a Chevalier de l’Ordre des Arts et des Lettres, in recognition of Swarovski's support for the Palace of Versailles in France.\nIn 2013, she received the NatWest UK Fashion & Textile Award for Outstanding Achievement.\nIn 2012, she received the Making a Difference Award 2012 from Women for Women International.\nIn 2011, the Council of Fashion Designers of America honored Nadja for the company's continued support of the American fashion industry.\nIn 2007, Swarovski received a Visionaries Award from New York's Museum of Arts and Design.\nIn 2022, Swarovski received the Women's Entrepreneurship Day Organization’s Accessories Pioneer Award at the United Nations, celebrating her as a trailblazer and innovator in her field. The prestigious award, also recognized by the US Congress, highlights women entrepreneurs and the meaningful impact they are having on the world.\nReferences"
    }
  ]
}