{
  "content": [
    {
      "type": "text",
      "text": "# Nagamori Awards\n\nJapan\n| presenter =\n| reward =\n| year =\n| holder =\n| website =  https://www.nidec.com/en/nagamori-f/\n}}\nThe Nagamori Award is an international award given by Nagamori Foundation of Kyoto, Japan. The award is to recognize outstanding researchers and engineers working on electrical and electronics engineering, especially related to motors, power generation, actuators, and energy related topics.\nHistory\nThe award was founded by Shigenobu Nagamori in 2014, with the purpose of recognizing global researchers and engineers who have made outstanding and innovative technological advances in the area of electrical motors and power generation.\nAwards details\nThe award is made annually to outstanding early to mid-career researchers and engineers. There will be six awards given annually, with one of the awards named as the Grand Nagamori award. The prize money of two million yen is awarded to each regular Nagamori award while the grand award comes with a cash prize of five million yen. An award ceremony is held in Kyoto, Japan around September each year, where winners will be present to receive their prizes.\nRecent winners\nThe following are some of the recent winners.\n{| class=\"wikitable\"\n|+ Grand Nagamori Award Winners\n|-\n! Year !! Name !! Contributions\n|-\n| 2022 || Gianmario Pellegrino || For synchronous and PM-synchronous reluctance motor drives - theory, design, and control methods\n|-\n| 2021 || Tom Oomen || For advanced motion control for precision mechatronics: identification, learning, and control\n|-\n| 2020 || Chris Gerada || For contributions to advancements in high performance electrical machines and their industrial application and uptake\n|-\n| 2019 || Takashi Kato || For improving efficiency of vehicle traction motors\n|-\n| 2018 || Bulent Sarlioglu\n|| For pioneering high efficiency and high density classical electric motors\n|-\n| 2017 || Yoshitaka Iwaji  || For contributions to control of synchronous permanent magnet motors\n|-\n| 2016 || Hiroshi Fujimoto || For contributions to improved safety and efficiency of electric vehicle motors\n|-\n| 2015 || Kan Akatsu || For contributions to high performance and low cost SR motors\n|}\n{| class=\"wikitable\"\n|+ Nagamori Award Winners\n|-\n! Year !! Name !! Contributions\n|-\n| rowspan=\"5\" | 2022 || Huijun Gao || For contributions to the advanced control for mechatronic systems\n|-\n| Yunwei Ryan Li || For contribution to the PWM, control and converter topology of medium voltage high power industrial drives\n|-\n| Burak Ozpineci || For low cost, high efficiency, compact electric motor drives for more electrified transportation systems\n|-\n| Maryam Saeedifard || For contributions to highly-efficient, power-dense and fault-tolerant multilevel converter-based medium-voltage drives\n|-\n| Akio Yamamoto || For pioneering research and development on theoretical models and applied systems for electrostatic film actuators\n|-\n| rowspan=\"5\" | 2021 || Tobias Geyer || For research in and industrial productization of predictive control methods maximizing the power and efficiency of electrical drives\n|-\n| Leila Parsa || For multi-phase permanent magnet motors, design, analysis, and control\n|-\n| Ronghai Qu || For flux modulation machines – theory, topologies, and applications\n|-\n| Akshay Kumar Rathore || For optimal extremely low switching frequency control of medium voltage high power industrial motor drives\n|-\n| Jun Ueda || For cellular actuators inspired by biological muscles and their human assistive applications\n|-\n| rowspan=\"5\" | 2020 || Yasuhisa Hirata || For development of motion control technology for passive robot using servo brake actuators for high safety and low power consumption\n|-\n| Alireza Khaligh || For pioneering research and development on design and control of high-efficiency and high-power-density electric-motor-integrated wide bandgap power electronics\n|-\n| Shihua Li || For contributions to the nonlinear modeling, analysis and multi-disturbance rejection control solution for precise motion control systems\n|-\n| Annette Muetze || For increasing the reliability, efficiency, and utilization of variable speed drive systems\n|-\n| Jin Wang || For leading-edge research and development of wide bandgap power device based electric machine drives\n|-\n| rowspan=\"5\" | 2019 || Radu Bojoi || For contributions to electrical drives control\n|-\n| Ayman M. EL-Refaie || For contributions to high speed permanent magnet machines\n|-\n| Mohammad S. Islam || For contributions to electric motors and electromagnetic actuators\n|-\n| Jianxin Shen || For contributions to permanent magnet electrical machines\n|-\n| Bram Vanderborght || For contributions to self-healing actuators with applications in health and manufacturing\n|-\n| rowspan=\"5\" | 2018 || Jose Alfonso Antonino Daviu || For contributions to advanced fault diagnostic techniques for reliable conditioning of electric motors\n|-\n| Jun-ichi Itoh || For contributions to the development of technology for adjustable speed drive system\n|-\n| Seiichiro Katsura || For contributions to integrated design and application of motion control\n|-\n| Hiroshi Toshiyoshi || For contributions to industrial applications of MEMS actuators\n|-\n| Bin Yao  || For contributions to adaptive robust control of high performance mechatronic systems\n|-\n| rowspan=\"7\" | 2017 || Takashi Abe || For contributions to the development of a variable field flux motor\n|-\n| Satomi Hattori || For contributions to the development of high efficiency low vibration motors\n|-\n| Makoto Iwasaki || For contributions to the development of high precision and position techniques for mechatronic systems\n|-\n| Masaharu Komori || For contributions to rotation transmission mechanism\n|-\n| Minh C. Ta || For contributions to control techniques for improved performance and efficiency of electric motor drives\n|-\n| Masatsugu Takemoto || For contributions to high performance and high functionality motors\n|-\n| Kanokvate Tungpimolrut || For contributions to motor drive system development\n|-\n| rowspan=\"5\" | 2016 || Jumpei Arata || For contributions to embedded elasticity mechanism and applications to medicine and industry\n|-\n| Elena Andreevna Lomonova || For contributions to advanced multi-degrees permanent magnet actuation and vibration isolation\n|-\n| Tomoaki Mashimo || For contributions to micro ultrasonic motors\n|-\n| Taketsune Nakamura || For contributions to high-temperature superconducting induction synchronous motors\n|-\n| Atsushi Nishikawa || For contributions to the design of medical actuator and endoscopic robot for minimally invasive surgery\n|-\n| rowspan=\"5\" | 2015 || Wolfgang Gruber || For contributions to design, optimization and manufacturing of bearingless slice motor topologies\n|-\n| Yasuhisa Hasegawa || For contributions to clinical applications of upper limb support for disabled patients\n|-\n| Chun-Yu Hsiao || For contributions to design of high performance permanent magnet synchronous motors\n|-\n| Takeshi Morita || For contributions to basic driving principles of piezoelectric actuators\n|-\n| Omar Scaglione || For contributions to iron hysteresis and enhanced Kalman filter for synchronous motors\n|}\nReferences"
    }
  ]
}