{
  "content": [
    {
      "type": "text",
      "text": "# Nambikwara\n\n()\n|rels=Christian, Animist\n|langs=Nambikwara, Portuguese\n|related=none\n}}\nThe Nambikwara (also called Nambikuára) are an indigenous people of Brazil, living in the Amazon. Currently about 1,200 Nambikwara live in indigenous territories in the Brazilian state of Mato Grosso along the Guaporé and Juruena rivers. Their villages are accessible from the Pan-American highway.\nName\nThe Nambikwara are also known as the Alaketesu, Anunsu, Nambikuára, or Nambiquara people. The term Nambikwara is an exonym originating from the Tupi language family. Its literal meaning is 'pierced ear,' from the words nambi, \"ear,\" and kûara, \"hole.\"\nLanguage\nThe Nambikwara speak the Southern Nambikuára language, which is a Nambiquaran language. A dictionary and grammar have been written for the language, which is written in the Latin script.\nHistory\nThe Nambikwara were first contacted in  but did not experience prolonged contact with Europeans until the early 20th century, when Brazilian army official Marechal Cândido Rondon passed through Nambikwara territory to extend the telegraph lines. He estimated that there were around 10,000 Nambikwara. Shortly after contact with European Brazilians epidemics of measles and smallpox decimated the population to only 500 around 1930.\nThe culture of the Nambikwara was the subject of studies by French anthropologist Claude Lévi-Strauss, which were later analyzed by French philosopher Jacques Derrida in his work Of Grammatology.\nBands and subgroups\nThe Nambikuara Nation is composed of many smaller bands which each have their own name.\n* Nambikwara do Sararé\n** Kabixi do Mato Grosso\n* Nambikwara do Campo of Mato Grosso — Rondônia\n** Halotesu\n** Hithaulu\n** Sawentesu\n** Wakalitesu\n* Nambikwara do Norte of Rondônia — Mato Grosso\n** Lakondê\n** Latundê, A.I. Tubarão-Latunde.\n** Mamaindê, A.I. Pirineus de Souza, and A.I. Vale do Guaporé\n** Nambikwara\n** Manduka, A.I. Pirineus de Souza\n** Negarotê, A.I. Vale do Guaporé\n** Tagnani\n** Tamaindé\n** Tawandê\n** Tawitê or Tauite.\n* Nambikwara do Sul of Mato Grosso\n** Alaketesu\n** Alantesu\n** Galera\n** Hahaintesu, A.I. Vale do Guaporé\n** Kabixi\n** Munduka\n** Waikisu, A.I. Vale do Guaporé\n** Wasusu, A.I. Vale do Guaporé\n*Sabanê\n** Sabanê, A.I. Pirineus de Souza\nNotes\nReferences\n*\n*\n*\nExternal links\n*[http://www.nmai.si.edu/searchcollections/results.aspx?regid=343 Nambikuára artwork], National Museum of the American Indian"
    }
  ]
}