{
  "content": [
    {
      "type": "text",
      "text": "# Nankin, Queensland\n\n| pop                 = 176\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4701\n| area                = 194.6\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 15.0\n| dir1                = E\n| location1           = Rockhampton CBD\n| dist2               = 35.6\n| dir2                = SW\n| location2           = Yeppoon\n| dist3               = 656\n| dir3                = NNW\n| location3           = Brisbane\n| dist4               =\n| dir4                =\n| location4           =\n| lga                 = Livingstone Shire\n| stategov            = Keppel\n| fedgov              = Capricornia\n| near-n              = Mount Chalmers\n| near-ne             = Tungamull\n| near-e              = Joskeleigh\n| near-se             = Thompson Point\n| near-s              = Port Alma\n| near-sw             = Midgee\n| near-w              = Nerimbera\n| near-nw             = Mount ArcherLakes Creek\n}}\nNankin is a rural locality in the Livingstone Shire, Queensland, Australia. In the , Nankin had a population of 176 people.\nGeography\nThe now-closed Emu Park railway line entered the locality from the west (Nerimbera) and exits to the north. Four now-abandoned stations served the locality:\n* Nankin Junction railway station ()\n*Leaholme railway station ()\n*Coolcorra railway station ()\n* Sleipner Junction railway station ()\nThe now-closed branch line to Broadmount separated from the Emu Park railway line at Nankin Junction and travelled to the south-west (now Thompson Point) through the following abandoned railway stations within the locality (from west to east):\n* Crescent View railway station (approx )\n* Meadows railway station (approx )\n* Balnagowan railway station (approx )\nThe Rockhampton–Emu Park Road runs through from south-west to north-west.\nHistory\nNankin Junction Provisional School opened in 1899. On 1 January 1909, it became Nankin Junction State School. It closed circa 1940. The school was on the north-eastern corner of the railway line and Thompsons Point Road, approx 71 Thompson Point Road ().\nDemographics\nIn the , Nankin had a population of 170 people.\nIn the , Nankin had a population of 176 people.\nEducation\nThere are no schools in Nankin. The nearest government primary schools are Lakes Creek State School in neighbouring Lakes Creek, Rockhampton, to the north-west, Coowonga State School in Coowonga to the north, and Keppel Sands State School in Keppell Sands to the north-east. The nearest government secondary schools are North Rockhampton State High School in Frenchville, Rockhampton, to the north-west and Yeppoon State High School in Yeppoon to the north.\nReferences"
    }
  ]
}