{
  "content": [
    {
      "type": "text",
      "text": "# Nanking (1938 film)\n\n|runtime          = 56 minutes\n|country          = Japan\n|language         = Japanese\n}}\nis a Japanese documentary film released in the year 1938. It was composed of footage shot inside and outside the walls of the city of Nanjing (Nanking) just after the end of the Battle of Nanking during the Second Sino-Japanese War.\nThe movie was planned out in conjunction with the documentary Shanghai on the Battle of Shanghai in anticipation that the advance on Nanjing would follow. After the shooting of Shanghai wrapped up the equipment used for that movie was passed on to Nanking's camera crew who departed for Nanjing before dawn on December 12, 1937. They arrived on December 14 the day after the city's fall, spent New Year's there, and continued shooting until January 4.\nConsidered for a long time as a lost film, it was discovered in Beijing, China, in the year 1995, though about ten minutes of footage is missing. A DVD copy has been released by Nippon Eiga Shinsha.\nContents\nNanking includes commentary on the locations of each military confrontation during the battle interspersed with footage of Japanese soldiers giving cigarettes to Chinese POWs, the Japanese Army's victory parade through the city, a joint service for the war dead, the refugee area set up by the International Committee known as the Nanking Safety Zone, rebuilding by the Japanese Army and residents of Nanjing of battle damage to the city, civilians returning to their homes, the work of nurses from the Red Cross, the Japanese Army's issuing of identification papers to the Chinese they deemed to be law-abiding citizens, preparations for the new year and New Year's Day in the Japanese Army, Chinese children playing with firecrackers on New Year's Day, and the inaugural ceremony of the Nanking Self-Government Committee.\nA message in the film's subtitles reads \"Even within our glorious history full of battles fought as one nation, our entry into Nanking with remain as a brilliant chapter in world history. We gift this film to future generations in memory of that day. This film was completed with the support and guidance of the Army Ministry, Navy Ministry, and officers and men in the field.\"\nFile:Nanking Entry Ceremony.jpg|Victory parade of December 17\nFile:Message of condolence of Matsui.jpg|Service for the war dead on December 18\nFile:Nanking nurse 2.jpg|A nurse cuts the hair of an injured soldier\nFile:Address of Tao Hsi-shan.jpg|Inaugural ceremony of the Nanking Self-Government Committee on January 1, 1938\nBehind the scenes of the filming\nNanjing fell on December 13, for the camera crew the day before they would enter Nanjing, and according to the journal of production clerk Akiyoshi Yonezawa they had heard stories about attacks by Chinese stragglers and feared that their equipment would get robbed. His journal then notes that they entered Nanjing on the 14th as mopping-up operations were being undertaken in the northern half of the city and that they heard bursts of gunfire which they assumed to be the Japanese Army battling remnants of the Chinese Army. Filming inside Nanjing started on the 15th and even then mopping-up operations were still taking place in the vicinity of Yijiang Gate which they visited that day. On the 16th they shot footage of the foothills of Purple Mountain, the suburban recreational garden containing Sun Yat-sen Mausoleum, and a nearby concert hall where dogs were wanderingly freely. On the 17th they filmed the Japanese Army's victory parade through Nanjing, the footage of which was immediately airlifted to Japan for presentation before Emperor Hirohito. According to Yonezawa's journal, the film crew witnessed the plight of Nanjing's refugees to preserve the story in images, but also noted the kindness with which the refugees were treated by the Japanese Army. The journal also notes that the camera crew filmed the construction of water supply facilities and the provision of medical treatment to Chinese POWs.\nYonezawa wrote in his journal that, while about 120 Japanese newspaper journalists and cameramen had entered Nanjing at the start of the occupation and were doing reporting work there, among them it was Nanking's camera crew which was permitted unfettered access even in places where the press teams of newspapers were not allowed to take pictures because his camera crew was connected with the Military Special Affairs Department.\nOn the other hand, cinematographer Shigeru Shirai stated in his memoirs that it was not the case that they filmed everything they saw and even some of what they shot was cut out. After Shirai arrived in Nanjing on December 14 he saw long lines of Chinese who were being taken to the banks of the Yangtze River to be shot, but he was not allowed to start his movie camera. Shirai was stunned by what he saw and said that he suffered nightmares for many nights after.\nStaff\n* Producer – Keiji Matsuzaki\n* Guidance – Military Special Affairs Department\n* Cinematographer – Shigeru Shirai\n* On-site sound recorder – Shinichi Fujii\n* Production clerk – Akiyoshi Yonezawa\n* Editor – Ken Akimoto\n* Sound recorder – Kinjiro Kanayama\n* Music supervisor – Jiang Wen-Ye\n* Commentator – Musei Tokugawa\nReviews\nKinema-Junpo Co.'s database introduces it as a highly discussed work relevant to the debate on the Nanjing Massacre which records real-life images of the devastated city and of Japan's occupying army.\nDocumentary film director Shinkichi Noda has pointed out that, though they had filmed the situation in Nanjing immediately after the fall of the city in a variety of ways, because the taping of the massacres was completely forbidden the movie does not go beyond being a standard propaganda newsreel. He received the impression that the movie was reporting on slivers of light in the darkness of Nanjing with the Japanese soldiers all being filmed in cheerful settings behind the front lines and with no trace of the nervousness of the Chinese people who were forced to remain silent.\nThe historian Tokushi Kasahara has said that there was almost no chance that Japanese cameramen could have captured the massacres on film given the Japanese Army's censorship guidelines, but though footage of scenes portraying the Japanese Army unfavorably were naturally avoided, some unavoidable traces of the backdrop of the Nanjing Massacre were caught on camera, such as the devastation of a city that had been damaged, looted, and put to flame following the occupation as well as the exhausted and spiritless expressions on the faces of the Chinese refugees. He believes that these are, upon closer inspection, pieces of photographic evidence of the Nanjing Massacre.\nFilm critic Jinshi Fujii has indicated that the movie's most distinctive characteristic lies in its unbalanced nature full of contradiction, which he calls \"a stylized chaos\". Throughout the movie the images of Nanjing as a city lack clarity and daily life of the city is completely missing. The Japanese soldiers just conduct one function after another and the Chinese are rarely seen with the exception of the scene of Chinese people lining up to get identification papers, but if the camera crew had gone a short distance from the whereabouts of the Japanese Army then what they would have portrayed would have been just desolate ruins. Fujii states that because this was a reality that the camera crew saw but was not able to film, Nanking is a documentary telling the story of a hard-fought battle without showing the reality behind it.\nSee also\n* The Battle of China\n* The Truth about Nanjing – A movie that uses footage from the film Nanking to deny the existence of the Nanjing Massacre.\nReferences\nExternal links\n*"
    }
  ]
}