{
  "content": [
    {
      "type": "text",
      "text": "# Napoleon Receiving the Queen of Prussia at Tilsit\n\nNapoleon Receiving the Queen of Prussia at Tilsit (French: Napoléon Ier reçoit la reine de Prusse à Tilsitt, 6 juillet 1807) is an 1837 history painting by the French artist Nicolas Gosse. It depicts a scene on 6 July 1807 during the negotiations of the Treaty of Tilsit during the Napoleonic Wars. Having defeated combined Prussian-Russian forces on the battlefield, Napoleon had met Alexander I of Russia and Frederick William III of Prussia in the town of Tilsit in East Prussia.\nWhile Napoleon courted the friendship of the Tsar, he was dismissive towards Frederick William having occupied his capital Berlin and much of his territory. Having been isolated and largely ignored during the discussions at Tilsit, Frederick William sent for his wife Queen Louise from Memel. She is shown in this painting along with the Tsar and her husband being greeted by Napoleon. In a private meeting she urged him not to abolish or dismember her husband's kingdom. Her courageous patriotism made her a popular icon of German nationalism. Ultimately although Prussia was forced to cede swathes of territory, it continued to exist, largely through the intervention of Alexander. Amongst others depicted are Marshals Louis-Alexandre Berthier, Jean-Baptiste Bessières, Louis-Nicolas Davout and Joachim Murat, general Géraud Duroc, the diplomat Armand-Augustin-Louis de Caulaincourt, the Foreign Minister Talleyrand, Grand Duke Konstantin, Sophie Marie von Voß and Count von Kalckreuth.\nThe painting was exhibited at the Salon of 1839. The work was produced during the July Monarchy which had a more favourable attitude towards Napoleon than during the previous Restorian Era. It was commissioned for six thousand francs to hang in Les Galeries Historiques at Versailles Palace.\nThe artist Jean-Charles Tardieu earlier painted a version of the same incident which he exhibited at the Salon of 1808 and which is now also in the collection of Versailles.\nReferences\nBibliography\n* Hagen, William M. German History in Modern Times: Four Lives of the Nation. Cambridge University Press, 2012.\n* Palmer, Alan. Alexander I: Tsar of War and Peace. Weidenfeld & Nicolson, 1974.\n* Sieburg, Friedrich. La France de la royauté à nation, 1789-1848. Arthaud, 1963."
    }
  ]
}