{
  "content": [
    {
      "type": "text",
      "text": "# Napoleonic weaponry and warfare__disambig_1\n\nNapoleon I, Emperor of the French, is recognized as the greatest early modern warfare commander in military history. His main strategy was focusing on one part of the enemy, quickly defeating them, and continuing onward. His success was made possible not only by his ambition, but also through the dynamic composition of his army. Napoleon would see his equipment being gained through provisional control of the armories of France, thus allowing the weapons direct control by government.\nMovement\nOne of Napoleon's greatest advantages was the speed of his troop movements. Napoleon insisted on extreme speed when conducting the marches, movements, and attacks of his army. He claimed that \"loss of time is irreparable in war... I may lose a battle but I should never lose a minute.\" Many factors contributed to Napoleon's ability to perform these flexible movements, from the division of his army into an independent corps system, to the avoidance of slow-moving, lengthy supply lines. Instead, Napoleon's army looked to live off the land, acquiring the motto, \"The war must feed the war.\" Napoleon sought to acquire food from the surrounding environment, whether that meant paying friendly countries or simply foraging. These factors, combined with Napoleon's innate persuasive ability to inspire his troops, resulted in successive victories in dominating fashion. His opponents were often confused and unsettled as Napoleon intricately coordinated strategic attacks on profound scales.\nStrategy\nHistory\nThe French Revolution and subsequent Napoleonic Wars revolutionised military strategy. The impact of this period was still to be felt in the American Civil War and the early phases of World War I. With the advent of cheap small arms and the rise of the drafted citizen soldier, army sizes increased rapidly to become mass forces. This necessitated dividing the army first into divisions and later into corps. Along with divisions came divisional artillery, light weight, mobile cannons with greater range and firepower.\nDuring the Italian campaign, Napoleon conversed much about the warriors of antiquity, especially Alexander the Great, Julius Caesar, Scipio Africanus, and Hannibal. He studied their strategies and combined them with his own. To a question from Bourrienne, asking whether he preferred Alexander or Caesar, Napoleon said that he placed Alexander in the first rank, the main reason being his campaigns in Asia.\nHis application of conventional military ideas to real-world situations enabled his military triumphs, such as creative use of artillery as a mobile force to support his infantry. He is credited as saying: \"I have fought sixty battles and I have learned nothing which I did not know at the beginning.\"\nNapoleon could win battles by concealing troop deployments and concentrating his forces on the \"hinge\" of an enemy's weakened front. If he could not use his favourite envelopment strategy, he would take up the central position and attack two cooperating forces at their hinge, swing round to fight one until it fled, then turn to face the other.\nNapoleon invariably sought to achieve decisiveness in battle, with the sole aim of utterly destroying his opponent, usually achieving success through superior manoeuvre. As ruler and general he dealt with the grand strategy as well as the operational strategy, making use of political and economic measures.\nWhile not the originator of the methods he used, Napoleon effectively combined the relatively superior manoeuvre and battle stages into one event. Before this, generals had considered this approach to battle as separate events. However, Napoleon used manoeuvre in battle to dictate how and where the battle would progress. The Battle of Austerlitz was a perfect example of this manoeuvre; Napoleon withdrew from a strong position to draw his opponent forward and tempt him into a flank attack, weakening his center. This allowed the French Army to split the allied army and gain victory.\nby Charles Meynier. After defeating Prussian forces at Jena, the French Army entered Berlin on 27 October 1806.]]\nNapoleon used two primary strategies for the approach to battle. His \"Manoeuvre De Derrière''\" (move onto the rear) was intended to place the French Army across the enemy's lines of communications. Using a \"pinning\" force to keep the opponent stationary, he would swing around onto his opponents rear with the bulk of his army, forcing the adversary to either accept a battle on Napoleon's terms or push further into the pinning force and hostile territory. By placing his army into the rear, his opponent's supplies and communications would be cut. This had a negative effect on enemy morale. Once joined, the battle would be one in which his opponent could not afford defeat. This also allowed Napoleon to select multiple march routes into a battle site. Initially, the lack of force concentration helped with foraging for food and sought to confuse the enemy as to his real location and intentions. This strategy, along with the use of forced marches created a morale bonus that played heavily in his favour.\nThe \"indirect\" approach into battle also allowed Napoleon to disrupt the linear formations used by the allied armies. As the battle progressed, the enemy committed their reserves to stabilise the situation, Napoleon would suddenly release the flanking formation to attack the enemy. His opponents, being suddenly confronted with a new threat and with little reserves, had no choice but to weaken the area closest to the flanking formation and draw up a battleline at a right angle in an attempt to stop this new threat. Once this had occurred, Napoleon would mass his reserves at the hinge of that right angle and launch a heavy attack to break the lines. The rupture in the enemy lines allowed Napoleon's cavalry to flank both lines and roll them up leaving his opponent no choice but to surrender or flee.\nThe second strategy used by Napoleon when confronted with two or more enemy armies was the use of the central position. This allowed Napoleon to drive a wedge to separate the enemy armies. He would then use part of his force to mask one army while the larger portion overwhelmed and defeated the second army quickly. He would then march on the second army leaving a portion to pursue the first army and repeat the operations. This was designed to achieve the highest concentration of men into the primary battle while limiting the enemy's ability to reinforce the critical battle. The central position had a weakness in that the full power of the pursuit of the enemy could not be achieved because the second army needed attention. So overall the preferred method of attack was the flank march to cut the enemy's logistics. Napoleon used the central position strategy during the Battle of Waterloo.\nWaterloo campaign\nNapoleon masked the Duke of Wellington's army and massed against the Prussian Army, and then after the Battle of Ligny was won, Napoleon attempted to do the same to the British-Allied force (British, Dutch, and Hanoverian) located just to the south of Waterloo. His subordinate was unable to mask the defeated Prussian Army, who reinforced the Waterloo battle in time to defeat Napoleon. It can be said that the Prussian Army under Field Marshal Gebhard Leberecht von Blücher used the \"Manoeuvre De Derrière\" against Napoleon who was suddenly placed in a position of reacting to a new enemy threat.\nNapoleon's practical strategic triumphs, repeatedly leading smaller forces to defeat larger ones, inspired a whole new field of study into military strategy. In particular, his opponents were keen to develop a body of knowledge in this area to allow them to counteract a masterful individual with a highly competent group of officers, or general staff. The two most significant students of his work were Carl von Clausewitz, a Prussian with a background in philosophy, and Antoine-Henri Jomini, who had been one of Napoleon's staff officers.\nPeninsular War\nOne notable exception to Napoleon's \"strategy of annihilation\" and a precursor to trench warfare were the Lines of Torres Vedras during the Peninsular War. French troops lived off the land and when they were confronted by a line of fortifications which they could not out flank, they were unable to continue the advance and were forced to retreat once they had consumed all the provisions of the region in front of the lines.\nThe Peninsular campaign was notable for the development of another method of warfare which went largely unnoticed at the time, but would become far more common in the 20th century. That was the aid and encouragement the British gave to the Spanish to harass the French behind their lines which led them to squander most of the assets of their Iberian army in protecting the army's line of communications. This was a very cost effective move for the British, because it cost far less to aid Spanish insurgents than it did to equip and pay regular British Army units to engage the same number of French troops. As the British Army could be correspondingly smaller it was able to supply its troops by sea and land without having to live off the land as was the norm at the time. Further, because they did not have to forage they did not antagonise the locals and so did not have to garrison their lines of communications to the same extent as the French did. So the strategy of aiding their Spanish civilian allies in their guerrilla or \"little war\" benefited the British in many ways, not all of which were immediately obvious.\nFirearms\nof the Charleville musket, the primary French firearm]]\nAs for the infantry soldier himself, Napoleon primarily equipped his army with the Charleville M1777 Revolutionnaire musket, a product from older designs and models. Used during the French Revolution and Napoleonic Wars, the Charleville musket was a .69 calibre, (sometimes .70 or .71) , muzzle-loading, smoothbore musket. Properly trained French infantry were expected to be able to fire three volleys a minute. A trained soldier could hit a man sized target at 100 yards but anything further required an increasing amount of luck, the musket was wildly inaccurate at long range. French officers were usually armed with a .69 pistol as a secondary weapon to their sword. This still had to be muzzle loaded and fired with a flintlock after reloading. Besides guns, soldiers used a variety of pikes, swords, and bayonets for close range or melee combat. Officers, sergeants, other higher-ranked officials, and cavalry mainly used swords, while the majority of infantry soldiers were equipped with bayonets.\nThe cavalry and engineers of the army essentially carried the same musket as the infantry. At 10 inches shorter, the carbine and the musketoon were less cumbersome, making them more suitable for the mobility that horseback riders required but at the expense of accuracy. Besides the usage of the firearms, heavy cavalry typically wielded straight sabres with a  while light cavalry wielded curved sabres with a .\nThroughout the Napoleonic Wars, rifles were also introduced into the battlefield. Rifles were substantially more accurate at a maximum range of 200 paces because the barrel put spin on the bullet. Despite this advantage, rifles were more expensive and took longer to load, something Napoleon was not fond of and a reason why he did not incorporate them into his army. Instead, he settled for the speed of the musket, as it allowed for his rapid manoeuvres. The British did utilise the rifle such as the Baker Pattern 1800 Infantry rifle equipping some units, most notably with the creation of an entire elite rifle regiment, the 95th Regiment (Rifles). One success of the British 95th Rifles was picking off French general Auguste François-Marie de Colbert-Chabanais in 1809 during the Peninsular War. The British themselves were to lose General Robert Ross, himself a veteran of the Peninsular War, to American long range rifle fire in 1814. Rifles were also utilised in smaller numbers by Jäger companies in several German states.\nThe Austrian Army introduced the Girardoni M1780 repeating air rifle as a specialist weapon and used them in the Napoleonic Wars. A multi-shot breech loader, it only had an effective full charge range to about . It was nearly silent and made no smoke or noise, but was complex and needed a significant infrastructure to support it. The air rifle fell out of use after 1815 as more conventional types of weapons proved superior overall, in only a few more decades, all soldiers would be gunpowder rifle equipped.\nMost weaponry provided would be gained due to the French hosting absolute control over all armories even if this control came from district and provinces command.\nArtillery\n12 pound gun on display at the ''Musée de l'Armée'']]\nin 1798, painting by George Arnald]]\nOne of the major components in Napoleon's arsenal of weaponry was his artillery. With the development and improvement of combat weapons throughout the Seven Years' War prior to Napoleon, artillery had expanded to almost every European country, including France with 12-lb and 8-lb cannons. \"The Gribeauval guns developed between 1765 and 1774 were 12-pounders, 8-pounders, 6-pounders and 4-pounders with 6-inch and 8-inch howitzers.\"\nThis style of gun was the artillery of choice for Napoleon, considering they were lighter by one third than the cannons of any other country. For example, the barrel of the British 12-pounder weighed 3,150 pounds, and the gun with carriage and limber about . The Gribeauval 12-lb barrels weighed 2,174 pounds and the gun with carriage and limber 4,367 pounds. Since Napoleon insisted on speed and mobility in conducting his manoeuvres, this lighter cannon provided the flexibility he desired. Along with the artillery, the army had vast quantities of mortars, furnace bombs, grape and canister shots, all of which provided substantial support fire.\nArtillery also played a role in naval warfare, with most ships containing anywhere from 50 to 100 cannons. In 1798, Napoleon's flagship L’Orient, with 120 guns, was the most heavily armed vessel in the world; until it was sunk that year at the Battle of the Nile. Napoleon's quick, destructive artillery force contributed to a majority of his victories.\nTactics\nA French tactic during the war was assembling a large amount of available guns into a 'Grand Battery' that would concentrate its fire on a single body of enemies or position to devastating effect. The tactic was used during the battle of Waterloo though to poor effect.\nSpecial weapons\nCongreve rockets based on the Mysorean technology were systematically used by the British during the Napoleonic Wars.\nSee also\n* Military history of France\n* Napoleonic tactics\nReferences\nSources\n*"
    }
  ]
}