{
  "content": [
    {
      "type": "text",
      "text": "# Narangba, Queensland\n\n| local_map           = yes\n| zoom                = 11\n| pop                 = 20910\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4504\n| area                = 43.3\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 12.3\n| dir1                = S\n| location1           = Caboolture\n| dist2               = 39.3\n| dir2                = N\n| location2           = Brisbane CBD\n| dist3               =\n| dir3                =\n| location3           =\n| dist4               =\n| dir4                =\n| location4           =\n| lga                 = City of Moreton Bay\n| stategov            = Kurwongbah\n| stategov2           = Bancroft\n| fedgov              = Longman\n| fedgov2             = Dickson\n| fedgov3             = Petrie\n| near-n              = Morayfield\n| near-ne             = Burpengary\n| near-e              = Deception Bay\n| near-se             = North LakesDakabin\n| near-s              = Kurwongbah\n| near-sw             = Rush Creek\n| near-w              = King Scrub\n| near-nw             = Ocean ViewMoorina\n}}\nNarangba is a town and suburb of the City of Moreton Bay, Queensland, Australia. It is located  north of Brisbane CBD. This suburb has rural origins, but is being redeveloped as a residential suburb on the outskirts of the greater Brisbane metropolitan area. In the , Narangba had a population of 20,910 people.\nGeography\nThe Bruce Highway enters the suburb from the south-east (Dakabin / North Lakes) and exits to the north-east (Burpengary / Deception Bay).\nThe North Coast railway line enters the suburb from the south (Kurwongbah / Dakabin) and exits to the north (Burpengary) with the suburb served by Narangba railway station ().\nHistory\nNarangba is situated in the Yugarabul traditional Indigenous Australian country. The name Narangba possibly originated from an Aboriginal word meaning \"small place\" or \"small ridge\". Earlier, it was part of an area referred to as Stoney Creek. The railway station was originally called Sideling Creek Station, but later renamed as Narangba. The suburb lies within the Burpengary Creek catchment area.\nNarangba State School opened on 27 January 1910.\nJinibara State School opened on 29 January 1996.\nNarangba Valley State High School opened on 1 January 2000.\nNarangba Valley State School opened on 1 January 2005.\nDemographics\n{| class=\"wikitable\"\n|-\n! width=50 | Year !! Population !! Notes\n|-\n| 1911 || align=right| 58 ||\n|-\n| 1961 || align=right| 457 ||\n|-\n| 1991 || align=right| 992 ||\n|-\n| 2006 || align=right| 12,997 ||\n|-\n| 2011 || align=right| 16,223 ||\n|-\n| 2016 || align=right| 18,573 ||\n|-\n| 2021 || align=right| 20,910 ||\n|}\nIn the , the suburb of Narangba had a population of 18,573 people, 50.8% of whom are females and 49.2% of whom are males. The median age of the Narangba population was 32 years, 6 years below the national median of 38.  78.2% of people living in Narangba were born in Australia. The other top responses for country of birth were England 5.7%, New Zealand 5.1%, South Africa 1.1%, Philippines 0.5%, Scotland 0.5%.  91.7% of people spoke only English at home; the next most common languages were 0.5% Afrikaans, 0.3% Hindi, 0.3%, Filipino 0.2%, German 0.2%, Italian 0.2%.\nIn the , the suburb of Narangba had a population of 20,910 people.\nEducation\nNarangba State School is a government primary (Prep-6) school for boys and girls at 2-20 School Street (). In 2018, the school had an enrolment of 712 students with 53 teachers (48 full-time equivalent) and 34 non-teaching staff (21 full-time equivalent). It includes a special education program.\nJinibara State School is a government primary (Prep-6) school for boys and girls at 50 Cottontree Drive (). In 2018, the school had an enrolment of 784 students with 57 teachers (53 full-time equivalent) and 41 non-teaching staff (27 full-time equivalent). It includes a special education program.\nNarangba Valley State School is a government primary (Prep-6) school for boys and girls at Creekside Drive (). In 2018, the school had an enrolment of 1,157 students with 74 teachers (69 full-time equivalent) and 35 non-teaching staff (24 full-time equivalent). It includes a special education program.\nNarangba Valley State High School is a government secondary (7-12) school for boys and girls at Harris Avenue (). In 2018, the school had an enrolment of 2,027 students with 146 teachers (141 full-time equivalent) and 51 non-teaching staff (39 full-time equivalent). It includes a special education program.\nA new Catholic primary and secondary school is expected to open in 2025 initially offering Prep to Year 3 and Year 7 schooling.\nAmenities\nLifebuilders Church  holds English-language services at Narangba Valley State School on Creekside Drive () and Afrikaans-language services at North Lakes Hotel at North Lakes. It is part of the Wesleyan Methodist Church.\nNarangba has many sporting facilities, notably there are two baseball/softball pitches and three soccer fields off Harris Avenue - home of Narangba Eagles FC, as well as two rugby fields as a part of Duncombe Park. Additionally, there is a basketball half court, a dog park, and a small skate park off Harris Avenue.\nParks\nThere are a number of parks in the area:\n* Gekko Gully Park ()\n* Narangba Sporting Complex ()\n* Narangba Sports Reserve ()\nTransport\nNarangba railway station provides regular Queensland Rail City network services to Brisbane and Ipswich, as well as Caboolture and the Sunshine Coast.\nThe 663 local loop bus service provides transport throughout the suburb connecting it to train services. The 668 service runs from Narangba railway station to the nearby suburb of North Lakes.\nBeing near the Bruce Highway, Narangba is accessible to both the Sunshine Coast and Brisbane.\nIn 2014 Queensland Rail Translink completed works on the recently refurbished Narangba train station creating a state of the art facility consisting of multiple platforms and secure car parks. Narangba train station now forms a staging point for inbound and outbound express trains.\nReferences\nFurther reading\n*\n*\n*\n*\nExternal links\n*"
    }
  ]
}