{
  "content": [
    {
      "type": "text",
      "text": "# NASA Docking System\n\nNASA Docking System (active androgynous variant on top, permanently passive variant on the bottom). Mechanical latches (visible on the guide petals) in the active ring clamp onto the passive section for contact and capture\nIDAs shown connected to PMA-2 and PMA-3 on the Harmony node.\nThe NASA Docking System is NASA's implementation of the International Docking System Standard (IDSS), an international spacecraft docking standard promulgated by the International Space Station Multilateral Coordination Board. NDS is a spacecraft docking and berthing mechanism used on the International Space Station (ISS) and the Boeing Starliner and planned to be used on the Orion spacecraft.  The international Low Impact Docking System (iLIDS) was the precursor to the NDS. NDS Block 1 was designed, built, and tested by The Boeing Company in Huntsville Alabama. Design qualification testing took place through January 2017.\nUsing NDS, NASA developed the International Docking Adapter (IDA) to provide two IDSS-compliant docking ports on the ISS. The IDAs were delivered to the ISS starting in 2016. Each of two existing Pressurized Mating Adapters has an IDA permanently attached, so the former PMA function is no longer available for visiting spacecraft. Since 2019, visiting spacecraft that implement IDSS dock to the NDS ports on the IDAs. These include Crew Dragon, Cargo Dragon 2, and Boeing Starliner.\nDesign\nNDS supports both autonomous and piloted dockings and includes pyrotechnics for contingency undocking. Once mated the NDS interface can transfer power, data, and air; future implementations will be able to transfer water, fuel, oxidizer and pressurant as well. The passage for crew and cargo transfer has a diameter of .\nIn form and function NDS resembles the Shuttle/Soyuz APAS-95 mechanism already in use for the docking ports and pressurized mating adapters on the International Space Station. There is no compatibility with the larger common berthing mechanism used on the US segment of the ISS, the Japanese H-II Transfer Vehicle, the original SpaceX Dragon, and Orbital Sciences' Cygnus spacecraft. NDS is compatible with the IDSS implementation on SpaceX Dragon 2, both Crew Dragon and Cargo Dragon.\nHistory\nIn 1996, Johnson Space Center (JSC) began development of the Advanced Docking Berthing System, which would later be called the X-38 Low-Impact Docking System. After the X-38 was canceled in 2002, development of the mating system continued, but its future was unknown. In 2004, President George W. Bush announced his Vision for Space Exploration and NASA's 2005 Exploration Systems Architecture Study was created in response, recommended the use of the Low Impact Docking System (LIDS) for the Crew Exploration Vehicle (which was later named Orion) and all applicable future exploration elements.\nThe Hubble Space Telescope received the Soft-Capture Mechanism (SCM) on STS-125. The SCM is meant for unpressurized docking, but uses the LIDS interface to reserve the possibility of an Orion docked mission. The docking ring is mounted on Hubble's aft bulkhead. It may be used for safely de-orbiting Hubble at the end of its service lifetime.\nImage showing the design changes from IDSS revision b to c\nIn February 2010, the LIDS program became modified to be compliant with the IDSS and became known as the international Low Impact Docking System (iLIDS) or simply the NASA Docking System (NDS). In May 2011, the NDS critical design review was completed and qualification was expected to be completed by late 2013.\nIn April 2012, NASA funded a study to determine if a less complex docking system could be used as the NASA Docking System that both met the international community's desire for a narrower soft capture system ring width, as well as providing the ISS a simpler active docking system compared to the then-planned design. Boeing's proposal was the Soft Impact Mating and Attenuation Concept (SIMAC), a design originally conceived in 2003 for the Orbital Space Plane (OSP) Program.\nA leaked NASA internal memo from November 2012, stated that SIMAC had been chosen to replace the previous design and that the majority of the work on the NASA Docking System would be shifted from NASA JSC to Boeing. In August 2014, Boeing announced that the critical design review for the redesigned NDS had been completed. Following this change the IDSS was modified (to rev D), so the new design of the NASA Docking System is still compatible with the standard.\nIDA-1 was part of the payload on SpaceX CRS-7 in June 2015, but was destroyed when the Falcon 9 rocket exploded during ascent.\nIDA-2 was delivered successfully on SpaceX's CRS-9 mission in July 2016, and then installed on PMA-2 in August of that year during a spacewalk by Jeffrey Williams and Kathleen Rubins as part of Expedition 48. Crew Dragon Demo-1 was the first spacecraft to dock at this port on 2 March 2019.\nIDA-3 was launched on the SpaceX CRS-18 mission in July 2019. IDA-3 is constructed mostly from spare parts to speed construction. It was attached and connected to PMA-3 during a spacewalk on 21 August 2019.\nReferences\n* James L. Lewis, [https://web.archive.org/web/20090226230340/http://universityaffairs.jsc.nasa.gov/PDF/Eng-3.pdf Advanced Docking Berthing System]. NASA technical publication. Johnson Space Center.\n* James L. Lewis, Monty B. Carroll. [http://www.islandone.org/ISDC/ISDC1999_Houston/ConferenceMisc-DaleAmonPapers/ISDC99-Abstracts_CD/AIAA%20Abstracts/Prototype%20Low%20Impact%20Docking%20System.pdf Prototype Low Impact Docking System]. NASA technical publication. Johnson Space Center.\nExternal links\n* [http://www.internationaldockingstandard.com/download/IDSS_IDD_Revision_D_043015.pdf International Docking System Standard (IDSS) Interface Definitions Document (IDD)]  Revision D April 2015\n* [https://ntrs.nasa.gov/api/citations/20170001546/downloads/20170001546.pdf International Docking System Standard (IDSS) Interface Definitions Document (IDD)]  Revision E October 2016\n* [https://ntrs.nasa.gov/api/citations/20220011643/downloads/IDSS%20IDD%20Rev%20F%20Final_07262022.pdf International Docking System Standard (IDSS) Interface Definitions Document (IDD)]  Revision F July 2022\n* https://www.internationaldockingstandard.com/"
    }
  ]
}