{
  "content": [
    {
      "type": "text",
      "text": "# Naswar\n\nNaswār (Dari and ; ; also called nās (), nāsor () or nasvāy (), is a moist, powdered tobacco dip consumed mostly in Afghanistan and Pakistan, as well as in surrounding countries including Tajikistan, and Uzbekistan. Naswar is stuffed in the floor of the mouth under the lower lip, or inside the cheek, known as butt style stuffing, for extended periods of time, usually for 15 to 30 minutes. It is similar to dipping tobacco and snus. Swabi, Bannu, Dera Ismail Khan, Charsadda, Mohmand and Herat are renowned for their production of some of the highest quality Naswar.\nUsing naswar can cause a various harmful effects such as dental disease, oral cancer, oesophagus cancer, and pancreas cancer, coronary heart disease, as well as negative reproductive effects including stillbirth, premature birth, and low birth weight. Naswar poses a lower health risk than traditional combusted products. However it is not a healthy alternative to cigarette smoking. The level of risk varies between different types of products and producing regions. There is no safe level of naswar use. Globally smokeless tobacco products contribute to 650,000 deaths each year.\nTypes\nThere are two forms of naswar; powder, and a paste cake style mixed with lime. It has a very pungent and powerful smell, resembling that of a fresh bale of coastal hay, and has a subtle flavor as it mixes with the saliva. The nicotine effect can occur within 5 minutes after intake, producing a slight burning sensation on the inner lip and tongue.\nNas: tobacco, ash, cotton or sesame oil, water, and sometimes gum.\nNaswar: tobacco, slaked lime, indigo, cardamom, oil, menthol, water.\nNaswār is made from sun and heat-dried tobacco leaves. These are added to slaked lime, ash from tree bark, and flavoring and coloring agents are mixed together. Water is added and the mixture is rolled into balls.\nUsage\nSouth and Central Asia\nThe green powder form is used most frequently. It is made by pouring water into a cement-lined cavity, to which slaked lime (calcium hydroxide) and air-cured, sun-dried, powdered tobacco is added. Indigo is added to the mixture to impart colour, and juniper ash may be added as flavoring.\nCurrently, in countries of the region naswar is sold in markets, usually on trays with cigarettes and sunflower seeds. The only exception is Turkmenistan, where in 2008 President Gurbanguly Berdimuhamedow signed a decree banning the production, sale, use and import of naswar.\nIn 2011, naswar was included in the list of narcotic and psychoactive substances to be controlled in Kazakhstan.\nIn November 2006, an editorial in the newspaper Daily Times in Pakistan caused some controversy over its allegedly biased representations of Pashtun predilection for naswar.\nEastern Europe and Russia\nIn Russia, naswar is not a traditional product, but it has gained popularity especially among teenagers. It was sold in the markets of Moscow and in other cities of the Urals, Volga, and other regions of the country. Its trade was usually conducted on trays with spices. According to the association of tobacco distributors \"Grandtabak\", in the first half of 2004, Russia's import of naswar or \"chewing tobacco\" amounted to almost 67 tons (valued around 2 million US dollars), primarily from Kazakhstan, Kyrgyzstan and Tajikistan. On 23 February 2013, the Russian State Duma signed a federal law (N 15-ФЗ) which banned both wholesale and retail naswar from 1 June 2013.\nBelarusian physicians have reported patients' medical information regarding naswar use to law enforcement agencies. In Estonia, naswar is distributed to nightclubs.\nHealth effects\nEven though it is less dangerous than smoking, naswar is addictive, represents a major health risk, has no safe level use and is not a safe substitute for smoking. Globally it contributes to 650,000 deaths each year with a significant proportion of them in Southeast Asia.\nUsing naswar can cause a number of adverse health effects such as dental disease, oral cancer, oesophagus cancer and pancreatic cancer, cardiovascular disease, asthma, and deformities in the female reproductive system. It also raises the risk of fatal coronary artery disease, fatal stroke and non-fatal ischaemic heart disease\nQuitting naswar use is as challenging as smoking cessation. There is no scientific evidence that using naswar can help a person quit smoking.\nCancer\nNaswar is a cause of oral cancer, oesophagus cancer and pancreas cancer. Increased risk of oral cancer caused by naswar is present in countries such as the United States but particularly prevalent in Southeast Asian countries where the use of smokeless tobacco is common.\nAll tobacco products, including naswar, contain cancer-causing chemicals. These carcinogenic compounds occurring in naswar vary widely, and depend upon the kind of product and how it was manufactured. There are 28 known cancer-causing substances in smokeless tobacco products.\nCardiovascular disease\nUsing naswar increases the risk of fatal coronary heart disease and stroke. In 2010 more than 200,000 people died from coronary heart disease due to smokeless tobacco use. Use of naswar also seems to greatly raise the risk of non-fatal ischaemic heart disease among users in Asia, although not in Europe.\nEffects during pregnancy\nNaswar can cause adverse reproductive effects including stillbirth, premature birth and low birth weight. Nicotine in naswar products that are used during pregnancy can affect how a baby's brain develops before birth.\nHistory\nNaswar was introduced into Western Europe by a Spanish monk named Ramon Pane after Columbus' second voyage to the Americas during 1493-1496. In 1561, Jean Nicot, the French ambassador in Lisbon, Portugal, sent naswar to Catherine de' Medici to treat her son's persistent migraine.\nSee also\n*Dipping tobacco\n*Smokeless tobacco\n*Snus\n*Khat\nReferences\nExternal links\n*[http://gulfnews.com/news/gulf/uae/crime/supermarket-in-ras-al-khaimah-shut-down-for-selling-niswar-1.583173 Supermarket in Ras al Khaimah Shut Down for Selling Naswar].  GulfNews.com"
    }
  ]
}