{
  "content": [
    {
      "type": "text",
      "text": "# Nat King Cole\n\n| birth_place       = Montgomery, Alabama, U.S.\n| death_date        =\n| death_place       = Santa Monica, California, U.S.\n| occupation        =\n| years_active      = 1934–1965\n| spouse            = |}}\n| children          = 5, including Natalie and Carole\n| module            =\n| occupation        =\n| instrument        =\n| discography       = Nat King Cole discography\n| label             =\n}}\n| signature        = Nat King Cole signature.svg\n}}\nNathaniel Adams Coles (March 17, 1919&nbsp;– February 15, 1965), known professionally as Nat King Cole, was an American singer, jazz pianist, and actor. Cole's career as a jazz and pop vocalist started in the late 1930s and spanned almost three decades where he found success and recorded over 100 songs that became hits on the pop charts.\nCole began his career as a jazz pianist in the late 1930s, when he formed the King Cole Trio, which became the top-selling group (and the only black act) on Capitol Records in the 1940s. Cole's trio was the model for small jazz ensembles that followed. Starting in 1950, he transitioned to become a solo singer billed as Nat King Cole. Despite achieving mainstream success, Cole faced intense racial discrimination during his career. While not a major vocal public figure in the civil rights movement, Cole was a member of his local NAACP branch and participated in the 1963 March on Washington. He regularly performed for civil rights organizations. From 1956 to 1957, Cole hosted the NBC variety series The Nat King Cole Show, which became the first nationally broadcast television show hosted by a Black American.\nSome of Cole's most notable singles include \"Unforgettable\", \"Smile\", \"A Blossom Fell\", \"Nature Boy\", \"When I Fall in Love\", \"Let There Be Love\", \"Mona Lisa\", \"Autumn Leaves\", \"Stardust\", \"Straighten Up and Fly Right\", \"The Very Thought of You\", \"For Sentimental Reasons\", \"Embraceable You\" and \"Almost Like Being in Love\". His 1960 Christmas album The Magic of Christmas (also known as The Christmas Song), was the best-selling Christmas album released in the 1960s; and was ranked as one of the 40 essential Christmas albums (2019) by Rolling Stone. In 2022, Cole's recording of \"The Christmas Song\", broke the record for the longest journey to the top ten on the Billboard Hot 100, when it peaked at number nine, 62 years after it debuted on the chart; and was selected by the Library of Congress for preservation in the United States National Recording Registry.\nCole received numerous accolades including a star on the Hollywood Walk of Fame (1960) and a Special Achievement Golden Globe Award. Posthumously, Cole has received the Grammy Lifetime Achievement Award (1990), along with the Sammy Cahn Lifetime Achievement Award (1992) and has been inducted into the DownBeat Jazz Hall of Fame  (1997), Rock and Roll Hall of Fame (2000), and the National Rhythm & Blues Hall of Fame (2020). NPR named him one of the 50 Great Voices. Cole was the father of singer Natalie Cole (1950–2015), who covered her father's songs in the 1991 album Unforgettable... with Love.\nEarly life\nNathaniel Adams Coles was born in Montgomery, Alabama, on March 17, 1919. He had three brothers: Eddie (1910–1970), Ike (1927–2001), and Freddy (1931–2020), and a half-sister, Joyce. Each of the Coles brothers pursued careers in music. When Cole was four years old, the family moved to Chicago, Illinois, where his father, Edward, became a Baptist minister. Cole learned to play the organ from his mother, Perlina (Adams) Coles, the church organist. His first performance was \"Yes! We Have No Bananas\" at the age of four. Cole began formal piano lessons at 12, learning jazz, gospel, and classical music \"from Johann Sebastian Bach to Sergei Rachmaninoff\". As a youth, Cole joined the news delivery boys' \"Bud Billiken Club\" band for The Chicago Defender.\nCole and his family moved to the Bronzeville neighborhood of Chicago, where Cole attended Wendell Phillips Academy High School, the school Sam Cooke attended a few years later. Cole participated in Walter Dyett's music program at DuSable High School. He would sneak out of the house to visit clubs, sitting outside to hear Louis Armstrong, Earl Hines, and Jimmie Noone.\nCareer\nEarly career\nWhen he was 15, Cole dropped out of high school to pursue a music career. After his brother Eddie, a bassist, came home from touring with Noble Sissle, they formed a sextet and recorded two singles for Decca in 1936 as Eddie Cole's Swingsters. They performed in a revival of the musical Shuffle Along. Nat Cole went on tour with the musical. In 1937, he married Nadine Robinson, who was a member of the cast. After the show ended in Los Angeles, Cole and Nadine settled there while he looked for work.\nOne day in 1938, as he was relaxing in his hotel room, Bing Crosby heard the Nat Cole Trio for the first time from Jim Otto’s Steak House, and then took Johnny Mercer to hear them. Crosby soon had the trio on his Kraft Music Hall radio program, and Mercer would later sign them upon founding Capitol Records. In 1944, “Straighten Up and Fly Right” soared to the top of the charts.\nWith Crosby continually bringing them back on his program, the Trio even substituted for him in the summer of 1946.\nCole led a big band and found work playing piano in nightclubs. When a club owner asked him to form a band, Cole hired bassist Wesley Prince and guitarist Oscar Moore. They called themselves the King Cole Swingsters after the nursery rhyme in which \"Old King Cole was a merry old soul\". They changed their name to the King Cole Trio before making radio transcriptions and recording for small labels.\n1940s\nCole recorded \"Sweet Lorraine\" in 1940, and it became his first hit. According to legend, his career as a vocalist started when a drunken bar patron demanded that Cole sing the song. Cole’s version was that one night a customer demanded that he sing, but because it was a song he did not know, he sang \"Sweet Lorraine\" instead. As people heard Cole's vocal talent, they requested more vocal songs, and he obliged.\nIn 1941, the trio recorded \"That Ain't Right\" for Decca, followed the next year by \"All for You\" for Excelsior. They recorded \"I'm Lost\", a song written by Otis René, the owner of Excelsior.\n.}}\nCole was the original house pianist for Jazz at the Philharmonic and performed at the first recorded concert in 1944. He was credited on Mercury as \"Shorty Nadine\", a derivative of his wife's name, because Cole had an exclusive contract with Capitol since signing with the label the year before. He used a variety of other pseudonyms for the same reason, including Eddie Laguna, Sam Schmaltz, Nature Boy and A Guy, \"or whatever name for himself he could think of, but only as an instrumentalist, never as a vocalist.\" Cole recorded with Illinois Jacquet and Lester Young.\nIn 1946, the trio broadcast King Cole Trio Time, a 15-minute radio program. This was the first radio program to be hosted by a black musician. From 1946 to 1948, the trio recorded radio transcriptions for Capitol Records Transcription Service. They performed on the radio programs Swing Soiree, Old Gold, The Chesterfield Supper Club, Kraft Music Hall, and The Orson Welles Almanac.\nCole began recording and performing pop-oriented material in which he was often accompanied by a string orchestra. Cole's stature as a popular star was cemented by hits such as \"All for You\" (1943), \"The Christmas Song\" (1947), \"(Get Your Kicks on) Route 66\", \"(I Love You) For Sentimental Reasons\" (1946), \"There! I've Said It Again\" (1947), \"Nature Boy\" (1948),\n1950s\nCole continued his popular success without a break in the 1950s, recording \"Frosty the Snowman\" (No. 8 in 1950), \"Mona Lisa\" (No. 1 song of 1950), \"Orange Colored Sky\" (1950), \"Too Young\" (the No. 1 song of 1951).\n1951’s \"Unforgettable\" (No. 9) was made famous again in 1991 by Cole's daughter Natalie when modern recording technology was used to reunite father and daughter in a duet. The duet version rose to the top of the pop charts, almost forty years after its original popularity.\nOn June 7, 1953, Cole performed for the ninth Cavalcade of Jazz concert held at Wrigley Field in Chicago, which was produced annually by Leon Hefflin, Sr. Featured that day were Roy Brown and his Orchestra, Shorty Rogers, Earl Bostic, Don Tosti and His Mexican Jazzmen, and Louis Armstrong and his All Stars with Velma Middleton.\nOn November 5, 1956, ''The Nat 'King' Cole Show debuted on NBC. The variety program was one of the first hosted by an African American. The fifteen minute show was increased to a half-hour in July 1957. Rheingold Beer was a regional sponsor, but a national sponsor was never found. The show was in trouble financially despite efforts by NBC, Harry Belafonte, Tony Bennett, Ella Fitzgerald, Eartha Kitt, Frankie Laine, Peggy Lee, and Mel Tormé. Cole decided to end the program, and the last episode aired on December 17, 1957. Commenting on the lack of sponsorship, Cole said shortly after its demise: \"Madison Avenue is afraid of the dark.\"\nThroughout the 1950s, Cole continued to record hits that sold millions throughout the world, such as \"Smile\", \"Pretend\", \"A Blossom Fell\", and \"If I May\". His pop hits were collaborations with Nelson Riddle, Gordon Jenkins, and Ralph Carmichael. Riddle arranged several of Cole's 1950s albums, including Nat King Cole Sings for Two in Love (1953), his first 10-inch LP. In 1955, \"Darling, Je Vous Aime Beaucoup\" reached number 7 on the Billboard chart. Love Is the Thing went to number one in April 1957 and remained his only number one album.\n, known as \"The House That Nat Built\" on Vine St.]]\nAs the taste in popular music continued to change in the 1950s, Cole's ballads appealed little to young listeners, despite a successful 1957 attempt at rock and roll with \"Send for Me\", which peaked at number 6 on the pop chart. Like Dean Martin, Frank Sinatra, and Tony Bennett, Cole found that the pop chart had been taken over by youth-oriented acts.\nIn 1958, Cole went to Havana, Cuba, to record Cole Español, an album sung entirely in Spanish. It was so popular in Latin America and the U.S. that it was followed by two more Spanish-language albums: A Mis Amigos (1959) and More Cole Español (1962).\nIn 1959, Cole received a Grammy Award for Best Performance By a \"Top 40\" Artist for \"Midnight Flyer\".\nCole performed in many short films (such as The Nat King Cole Musical Story (1955)), sitcoms, and television shows, and appeared in big screen productions that included  The Blue Gardenia (1953), China Gate (1957), and St. Louis Blues (1958), where he played W. C. Handy.\n1960s\nIn 1960, Cole's longtime collaborator Nelson Riddle left Capitol to join Reprise Records, which was established by Frank Sinatra. Riddle and Cole recorded one final hit album, Wild Is Love, with lyrics by Ray Rasch and Dotty Wayne. Cole later retooled the concept album into an Off-Broadway show, ''I'm with You''.\nNevertheless, Cole recorded several hit singles during the 1960s, including \"Let There Be Love\" with George Shearing in 1961, the country-flavored hit \"Ramblin' Rose\" in August 1962 (reaching No.  2 on the Pop chart), \"Dear Lonely Hearts\" (No. 13), \"That Sunday, That Summer\" (No. 12) and \"Those Lazy-Hazy-Crazy Days of Summer\" (his final top-ten hit, reaching number 6 on the Pop chart).\nIn January 1964, Cole made one of his final television appearances, on The Jack Benny Program. He was introduced as \"the best friend a song ever had\" and sang \"When I Fall in Love\". Cat Ballou (1965), Cole's final film, was released several months after his death.\nCole's final studio album was titled L-O-V-E. The album peaked at No. 4 on the Billboard Albums chart in the spring of 1965.\nEarlier on, Cole's shift to traditional pop led some jazz critics and fans to accuse him of selling out, but he never abandoned his jazz roots; as late as 1956, Cole recorded an all-jazz album, After Midnight, and many of his albums after this are fundamentally jazz-based, being scored for big band without strings, although the arrangements focus primarily on the vocal rather than instrumental leads.\nPersonal life\nAround the time Cole launched his singing career, he entered into Freemasonry. Cole was raised in January 1944 in the Thomas Waller Lodge No. 49 in California. The lodge was named after fellow Prince Hall mason and jazz musician Fats Waller. Cole joined the Scottish Rite Freemasonry, becoming a 32nd Degree Mason.\nCole was \"an avid baseball fan\", particularly of Hank Aaron. In 1968, Nelson Riddle related an incident from some years earlier of music studio engineers searching for a source of noise and finding Cole listening to a game on a transistor radio.\nMarriages and children\nCole met his first wife, Nadine Robinson, while they were on tour for the all-black Broadway musical Shuffle Along. Cole was 18 when they married in 1937, and was the reason why he moved to Los Angeles and formed the Nat King Cole trio. Their marriage ended in divorce in 1948.\nOn March 28, 1948 (Easter Sunday), six days after his divorce became final, Cole married singer Maria Hawkins. The Coles were married in Harlem's Abyssinian Baptist Church by Adam Clayton Powell Jr. They had five children: Natalie (1950–2015), who had a successful career as a singer before dying of congestive heart failure at age 65; an adopted daughter, Carole (1944–2009, the daughter of Maria's sister), who died of lung cancer at the age of 64; an adopted son, Nat Kelly Cole (1959–1995), who died of AIDS at the age of 36; and twin daughters, Casey and Timolin, born September 26, 1961. Maria supported Cole during his final illness and stayed with him until his death. In an interview, she emphasized his musical legacy and the class he exhibited despite his imperfections.\n]]\nExperiences with racism\nIn August 1948, Cole purchased a house from Col. Harry Gantz, the ex-husband of silent film actress Lois Weber, in the all-white Hancock Park neighborhood of Los Angeles. Shortly thereafter, a burning cross was placed on his front lawn and the property-owners association told Cole they did not want any \"undesirables\" moving into the neighborhood. Cole responded, \"Neither do I. And if I see anybody undesirable coming in here, I'll be the first to complain.\" His dog died after eating poisoned meat, something likely to be connected to his moving to the neighborhood.\nIn 1956, Cole was contracted to perform in Cuba. He wanted to stay at the Hotel Nacional de Cuba in Havana but was refused because it operated a color bar. Cole honored his contract, and the concert at the Tropicana Club was a huge success. The following year, Cole returned to Cuba for another concert, singing many songs in Spanish.\n1956 Birmingham assault\nOn April 10, 1956, Cole was assaulted during a concert in Birmingham, Alabama, while singing the song \"Little Girl\" on stage with the Ted Heath Band. After photographs of Cole with white female fans were circulated bearing such incendiary, boldface captions as \"Cole and His White Women\" and \"Cole and Your Daughter\", three men belonging to the North Alabama Citizens Council attacked Cole in an apparent attempt to kidnap him.\nThe three assailants ran down the aisles of the auditorium towards Cole. Local law enforcement quickly ended their invasion of the stage, but not until Cole was toppled from his piano bench and received a slight injury to his back. He did not finish the concert. Police later found rifles, a blackjack, and brass knuckles in a car outside the venue.\nSix men were formally charged with assault with intent to murder Cole, albeit the charges against four of them were later reduced. The original plan to attack Cole included 150 men from Birmingham and nearby towns. On April 18, 1956, Jesse Mabry, E.L. Vinson, Mike Fox, and Orliss Clevenger, all of whom were members of the Alabama chapter of the Citizens' Councils, were convicted of conspiracy to commit assault and battery and disturbing the peace in a bench trial held by Judge Ralph E. Parker. Two days later, Parker sentenced each of the men to six months in jail plus a $100 fine (nearly $1,200 in 2025). He imposed an additional $25 fine of Clevenger for carrying concealed brass knuckles. In December 1956, Kenneth Adams and Willis Richard Vinson both pleaded guilty to assault. Vinson, who was accused of assaulting his arresting officer, was fined $100 and ordered to pay court costs. Adams  was fined $50 and ordered to pay court costs.\n\"I can't understand it,\" Cole said afterwards. \"I have not taken part in any protests. Nor have I joined an organization fighting segregation. Why should they attack me?\" Cole wanted to forget the incident and continued to play for segregated audiences in the American South. He said he could not change the situation in a day. He contributed money to the Montgomery bus boycott and previously sued Northern hotels that had hired him but refused to serve him.\nCriticism and involvement in the Civil Rights Movement\nThurgood Marshall, then-the chief legal counsel of the NAACP, said \"All Cole needs to complete his role as an Uncle Tom is a banjo.\" Roy Wilkins, executive secretary of the NAACP, wrote him a telegram that said:\n}}\nThe Chicago Defender said that Cole's performances for all-white audiences were an insult to his race. The New York Amsterdam News said that \"thousands of Harlem blacks who have worshiped at the shrine of singer Nat King Cole turned their backs on him this week as the noted crooner turned his back on the NAACP and said that he will continue to play to Jim Crow audiences\". To play \"Uncle Nat's\" discs, wrote a commentator in The American Negro, \"would be supporting his 'traitor' ideas and narrow way of thinking\".\nDeeply hurt by the criticism in the black press, Cole was chastened. Emphasizing his opposition to racial segregation \"in any form\", he agreed to join other entertainers in boycotting segregated venues. He paid $500 to become a lifetime member of the Detroit branch of the NAACP. Until his death in 1965, Cole was an active and visible participant in the civil rights movement, playing an important role in planning the March on Washington in 1963.\nPolitics\nCole performed in 1956 for President Dwight D. Eisenhower's televised birthday celebration. At the 1956 Republican National Convention, he sang \"That's All There Is to That\" and was \"greeted with applause\".\nCole was also present at the Democratic National Convention in 1960 to support Senator John F. Kennedy. Cole was among the dozens of entertainers recruited by Frank Sinatra to perform at the Kennedy Inaugural gala in 1961. Cole consulted with Kennedy and his successor, Lyndon B. Johnson, on civil rights.\nIllness and death\nIn September 1964, Cole began to lose weight and experienced back problems. He collapsed with pain after performing at the Sands Hotel in Las Vegas. In December, Cole was working in San Francisco when he was finally persuaded by friends to seek medical help. A malignant tumor in an advanced state of growth on Cole's left lung was observed on a chest X-ray. Cole, who was a heavy cigarette smoker, had lung cancer and was expected to have only months to live. Against his doctors' advice Cole carried on his work and made his final recordings between December 1 and 3 in San Francisco, with an orchestra conducted by Ralph Carmichael. The music was released on the album L-O-V-E shortly before Cole died. His daughter noted later that he did this to ensure the welfare of his family.\nCole entered Saint John's Health Center in Santa Monica on December 7, 1964, and cobalt therapy was started on December 10. Frank Sinatra performed in Cole's place at the grand opening of the new Dorothy Chandler Pavilion of the Los Angeles Music Center on December 12. Cole's condition gradually worsened, but he was released from the hospital over the New Year's period. At home, Cole was able to see the hundreds of thousands of cards and letters that had been sent after news of his illness was made public. Cole returned to the hospital in early January 1965. He also sent $5,000 (US$}} in  dollars) to actress and singer Gunilla Hutton, with whom Cole had been romantically involved since early 1964.\nHutton later telephoned Maria and implored her to divorce him. Maria confronted her husband, and Cole finally broke off the relationship with Hutton. Cole's illness reconciled him with his wife, and Cole vowed that if he recovered, he would go on television to urge people to stop smoking. On January 25, Cole's entire left lung was surgically removed. His father died of heart problems on February 1. Throughout Cole's illness, his publicists promoted the idea that he would soon be well and working, despite the private knowledge of his terminal condition. Billboard magazine reported that \"Nat King Cole has successfully come through a serious operation and... the future looks bright for 'the master' to resume his career again\". On Valentine's Day, Cole and his wife briefly left St. John's to drive by the sea. Cole died at the hospital early in the morning hours of Monday, February 15, 1965, at the age of 45.\nCole's funeral was held on February 18 at St. James' Episcopal Church on Wilshire Boulevard in Los Angeles; 400 people were present inside the church, and thousands gathered outside. Hundreds of members of the public had filed past the coffin the day before. Honorary pallbearers included Robert F. Kennedy, Count Basie, Frank Sinatra, Sammy Davis Jr., Johnny Mathis, George Burns, Danny Thomas, Jimmy Durante, Alan Livingston, Frankie Laine, Steve Allen, and Pat Brown, the governor of California.\nThe eulogy was delivered by Jack Benny, who said that \"Nat Cole was a man who gave so much and still had so much to give. He gave it in song, in friendship to his fellow man, devotion to his family. He was a star, a tremendous success as an entertainer, an institution. But he was an even greater success as a man, as a husband, as a father, as a friend.\" Cole's remains were interred in Freedom Mausoleum at Forest Lawn Memorial Park, in Glendale, California.\nPosthumous releases\nCole's last album, L-O-V-E, was recorded in early December 1964—just a few days before he entered the hospital for cancer treatment—and was released just before his death. It peaked at number 4 on the Billboard Albums chart in the spring of 1965. A Best Of album was certified a gold record in 1968. His 1957 recording of \"When I Fall in Love\" reached number 4 in the UK charts in 1987, released in reaction to a version by Rick Astley challenging for the coveted Christmas number 1 spot.\nIn 1983, an archivist for EMI Electrola Records, a subsidiary of EMI (Capitol's parent company until 2013) in Germany, discovered some unreleased recordings by Cole, including one in Japanese and another in Spanish (\"Tu Eres Tan Amable\"). Capitol released them later that year as the LP Unreleased.\nIn 1991, Mosaic Records released The Complete Capitol Records Recordings of the Nat King Cole Trio, a compilation of 349 songs available as an 18-CD or a 27-LP set. In 2008, it was re-released in digital-download format through services like iTunes and Amazon Music.\nAlso in 1991, Natalie Cole recorded a new vocal track that was mixed with her father's 1961 stereo re-recording of his 1951 hit \"Unforgettable\" for a tribute album of the same title on Elektra Records. The song and album won seven Grammy awards in 1992 for Best Album and Best Song.\nThere have been many tribute albums, including one by his brother, Freddy. Randy Napoleon, Freddy Cole's guitarist and arranger for 13 years, has performed and recorded tributes to the Cole family.\nIn 2009, the year of the inauguration of Barack Obama as America's first black president, Capitol released an album Voices of Change, Then and Now. On this album is the song \"We Are Americans Too\" that Capitol did not release in 1956, the year that Nat King Cole wrote it.\nDiscography\n* The King Cole Trio (1944)\n* The King Cole Trio, Volume 2 (1946)\n* The King Cole Trio, Volume 3 (1947)\n* The King Cole Trio, Volume 4 (1949)\n* Nat King Cole at the Piano (1950)\n* Harvest of Hits (1950)\n* King Cole for Kids (1951)\n* Penthouse Serenade (1952)\n* Top Pops (1952)\n* Nat King Cole Sings for Two in Love (1953)\n* Unforgettable (1954)\n* Penthouse Serenade (1955)\n* Nat King Cole Sings for Two in Love (1955) (12-inch re-release)\n* The Piano Style of Nat King Cole (1955)\n* After Midnight (1957)\n* Just One of Those Things (1957)\n* Love Is the Thing (1957)\n* Cole Español (1958)\n* St. Louis Blues (1958)\n* The Very Thought of You (1958)\n* To Whom It May Concern (1958)\n* Welcome to the Club (1958)\n* A Mis Amigos (1959)\n* Tell Me All About Yourself (1960)\n* Every Time I Feel the Spirit (1960)\n* Wild Is Love (1960)\n* The Magic of Christmas (1960)\n* The Nat King Cole Story (1961)\n* The Touch of Your Lips (1961)\n* Nat King Cole Sings/George Shearing Plays (1962)\n* ''Ramblin' Rose (1962)\n* Dear Lonely Hearts (1962)\n* More Cole Español (1962)\n* The Christmas Song (Album) (1962)\n* Those Lazy-Hazy-Crazy Days of Summer (1963)\n* Where Did Everyone Go? (1963)\n* Nat King Cole Sings My Fair Lady (1964)\n* Let's Face the Music! (1964, recorded 1961)\n* I Don't Want to Be Hurt Anymore (1964)\n* L-O-V-E (1965)\n* Nat King Cole Sings His Songs From 'Cat Ballou' and Other Motion Pictures (1965)\n* Live at the Sands'' (1966, recorded 1960)\nHis hit singles include \"Straighten Up and Fly Right\" 1944 No. 8, \"The Christmas Song\" 1946/1962/2018 No. ?/No. 65/No. 11, \"Nature Boy\" 1948 No. 1, \"Mona Lisa 1950 No. 1, \"Frosty, The Snowman\" 1950 No. 9, \"Too Young\" 1951 No. 1, \"Unforgettable\" 1951 No. 12, \"Somewhere Along the Way\" 1952 No. 8, \"Answer Me, My Love\" 1954 No. 6, \"A Blossom Fell\" 1955 No. 2, \"If I May\" 1955 No. 8, \"Send for Me\" 1957 No. 6, \"Looking Back\" 1958 No. 5, \"Ramblin' Rose\" 1962 No. 2, \"Those Lazy, Hazy, Crazy Days of Summer\" 1963 No. 6, and \"Unforgettable\" 1991 (with daughter Natalie).\nFilmography\nFilm\n{| class=\"wikitable unsortable\"\n|-\n! Year\n! Title\n! Role\n! class=\"unsortable\" | Notes\n|-\n| 1943\n| Here Comes Elmer\n| Himself\n|\n|-\n| 1943\n| ''Pistol Packin' Mama\n| As part of the King Cole Trio\n| Uncredited\n|-\n| 1944\n| Pin Up Girl\n| Canteen pianist\n| Uncredited\n|-\n| 1944\n| Stars on Parade\n| As part of the King Cole Trio\n|\n|-\n| 1944\n| Swing in the Saddle\n| As part of the King Cole Trio\n| Uncredited\n|-\n| 1944\n| See My Lawyer\n| Specialty act\n| As part of the King Cole Trio\n|-\n| 1944\n| Is You Is, or Is You Ain't My Baby?\n| Himself\n| Short subject\n|-\n| 1945\n| Frim Fram Sauce\n| Himself\n| Short subject\n|-\n| 1946\n| Breakfast in Hollywood\n| As part of the King Cole Trio\n|\n|-\n| 1946\n| Errand Boy for Rhythm\n| Himself\n| Short subject\n|-\n| 1946\n| Come to Baby Do\n| Himself\n| Short subject\n|-\n| 1948\n| Killer Diller\n| Himself\n| As part of the King Cole Trio\n|-\n| 1949\n| Make Believe Ballroom\n| Himself\n| As part of the King Cole Trio\n|-\n| 1950\n| King Cole Trio & Benny Carter Orchestra\n| Himself\n| Short subject\n|-\n| 1951\n| You Call It Madness\n| Himself\n| Short subject\n|-\n| 1951\n| When I Fall in Love\n| Himself\n| Short subject\n|-\n| 1951\n| The Trouble with Me Is You\n| Himself\n| Short subject\n|-\n| 1951\n| Sweet Lorraine\n| Himself\n| Short subject\n|-\n| 1951\n| Route 66\n| Himself\n| Short subject\n|-\n| 1951\n| Nature Boy\n| Himself\n| Short subject\n|-\n| 1951\n| Mona Lisa\n| Himself\n| Short subject\n|-\n| 1951\n| Home\n| Himself\n| Short subject\n|-\n| 1951\n| For Sentimental Reasons\n| Himself\n| Short subject\n|-\n| 1951\n| Calypso Blues\n| Himself\n| Short subject\n|-\n| 1952\n| Nat \"King\" Cole and Joe Adams Orchestra\n| Himself\n| Short subject\n|-\n| 1953\n| The Blue Gardenia\n| Himself\n|\n|-\n| 1953\n| Small Town Girl\n| Himself\n|\n|-\n| 1953\n| Nat \"King\" Cole and Russ Morgan and His Orchestra\n| Himself\n| Short subject\n|-\n| 1955\n| Kiss Me Deadly\n| Singer\n| Voice\n|-\n| 1955\n| Rhythm and Blues Revue\n| Himself\n| Documentary\n|-\n| 1955\n| Rock 'n' Roll Revue\n| Himself\n| Short subject\n|-\n| 1955\n| The Nat 'King' Cole Musical Story\n| Himself\n| Short subject\n|-\n| 1955\n| Rhythm and Blues Revue\n| Himself\n| Documentary\n|-\n| 1956\n| The Scarlet Hour\n| Nightclub vocalist\n|\n|-\n| 1956\n| Basin Street Revue\n| Himself\n|\n|-\n| 1957\n| Istanbul\n| Danny Rice\n|\n|-\n| 1957\n| China Gate\n| Goldie\n|\n|-\n| 1958\n| St. Louis Blues\n| W. C. Handy\n|\n|-\n| 1959\n| Night of the Quarter Moon\n| Cy Robbin\n| A.k.a. The Color of Her Skin\n|-\n| 1959\n| Premier Khrushchev in the USA\n| Himself\n| Documentary\n|-\n| 1960\n| Schlager-Raketen\n| Sänger, Himself\n|\n|-\n| 1965\n| Cat Ballou\n| Shouter\n| Released posthumously, (final film role)\n|-\n| 1989\n| Benny Carter: Symphony in Riffs\n| Himself\n| Documentary\n|}\nTelevision\n{| class=\"wikitable unsortable\"\n|-\n! Year\n! Title\n! Role\n! class=\"unsortable\" | Notes\n|-\n| 1950\n| The Ed Sullivan Show\n| Himself\n| 14 episodes\n|-\n| 1951–1952\n| Texaco Star Theatre\n| Himself\n| 3 episodes\n|-\n| 1952–1955\n| The Jackie Gleason Show\n| Himself\n| 2 episodes\n|-\n| 1953\n| The Red Skelton Show\n| Himself\n| Episode #2.20\n|-\n| 1953–1961\n| What's My Line?\n| \"Mystery guest\"\n| 2 episodes\n|-\n| 1954–1955\n| The Colgate Comedy Hour\n| Himself\n| 4 episodes\n|-\n| 1955\n| Ford Star Jubilee\n| Himself\n| 2 episodes\n|-\n| 1956–1957\n| The Nat King Cole Show\n| Host\n| 42 episodes\n|-\n| 1957–1960\n| The Dinah Shore Chevy Show\n| Himself\n| 2 episodes\n|-\n| 1958\n| The Patti Page Show\n| Himself\n| Episode #1.5\n|-\n| 1959\n| The Perry Como Show\n| Himself\n| Episode: January 17, 1959\n|-\n| 1959\n| The George Gobel Show\n| Himself\n| Episode #5.10\n|-\n| 1960\n| The Steve Allen Show\n| Himself\n| Episode #5.21\n|-\n| 1960\n| This Is Your Life\n| Himself\n| Episode: \"Nat King Cole\"\n|-\n| 1960\n| Academy Award Songs\n| Himself\n| TV movie\n|-\n| 1960\n| Special Gala to Support Kennedy Campaign\n| Himself\n| TV movie\n|-\n| 1961\n| Main Event\n| Himself\n| TV movie\n|-\n| 1961–1964\n| The Garry Moore Show\n| Himself\n| 4 episodes\n|-\n| 1962–1964\n| The Jack Paar Program\n| Himself\n| 4 episodes\n|-\n| 1963\n| An Evening with Nat King Cole\n| Himself\n| TV movie\n|-\n| 1963\n| An Evening with Nat King Cole\n| Himself\n| BBC Television special\n|-\n| 1963\n| The Danny Kaye Show\n| Himself\n| Episode #1.14\n|-\n| 1964\n| Freedom Spectacular\n| Himself\n| TV movie\n|-\n| 1964\n| The Jack Benny Program\n| Nat\n| Episode: \"Nat King Cole, Guest\"\n|}\nAwards and honors\nin Montgomery]]\nCole was inducted into the Alabama Music Hall of Fame and the Alabama Jazz Hall of Fame. He was awarded the Grammy Lifetime Achievement Award in 1990. In 1992, Cole received the Sammy Cahn Lifetime Achievement Award from the Songwriters Hall of Fame. He was also inducted into the DownBeat'' Jazz Hall of Fame in 1997 and the Hit Parade Hall of Fame in 2007. A United States postage stamp with Cole's likeness was issued in 1994. Cole was inducted into the Rock and Roll Hall of Fame in 2000, and the Latin Songwriters Hall of Fame in 2013. NPR named him one of the 50 Great Voices.\nCole's success at Capitol Records, for which he recorded more than 150 singles that reached the Billboard Pop, R&B, and Country charts, has yet to be matched by any Capitol artist. Cole's records sold 50 million copies during his career. His recording of \"The Christmas Song\" still receives airplay every holiday season, even hitting the Billboard Top 40 in December 2017. In 2020, Cole was inducted into the National Rhythm & Blues Hall of Fame.\nBibliography\n*\n*\nSee also\n* List of African-American firsts\n* List of Freemasons\n* The Ethel Waters Show\nReferences\nFurther reading\n* Will Friedwald, Straighten Up and Fly Right: The Life and Music of Nat King Cole, Oxford University Press, 2020. .\n*\n* Bill Dobbins and Richard Wang. \"Cole, Nat 'King'.\" Grove Music Online. Oxford Music Online. Oxford University Press. Web. September 28, 2016.\n* Pelote, Vincent. \"Book Reviews: \"Unforgettable: The Life and Mystique of Nat King Cole,\" by Leslie Gourse.\" Notes: Quarterly Journal of the Music Library Association, vol. 49, no. 3, 1993., pp.&nbsp;1073–1074,\nExternal links\n*\n*\n*\n* [https://www.npr.org/artists/15392890/nat-king-cole Nat King Cole] at NPR.org\n* [http://www.encyclopediaofalabama.org/face/Article.jsp?id=h-1552 Nat \"King\" Cole article in the Encyclopedia of Alabama]\n*\n}}"
    }
  ]
}