{
  "content": [
    {
      "type": "text",
      "text": "# Nat Turner's Rebellion__disambig_2\n\n| caption =\n| duration = 3 days\n| place = Southampton County, Virginia, United States\n| coordinates =\n| also known as =\n| type = Slave rebellion\n| map = VAMap-doton-Courtland.PNG\n| map_size =\n| map_caption = Location of the rebellion in Southampton County, Virginia\n| organizers = Nat Turner\n| result = Rebellion suppressedParticipants tried and executed or sold\n| casualties1 = 56 to 85 White men, women, and children\n| casualties2 = 10 to 120 Black men, women, and children\n| partof = events leading to the American Civil War and North American slave revolts\n| image_size = 220\n}}\n'''Nat Turner's Rebellion, historically known as the Southampton Insurrection''', was a slave rebellion that took place in Southampton County, Virginia, in August 1831. Led by Nat Turner, the rebels, made up of enslaved African Americans, killed between 55 and 65 White people, making it the deadliest slave revolt for the latter racial group in U.S. history. The rebellion was effectively suppressed within a few days, at Belmont Plantation on the morning of August 23, but Turner survived in hiding for approximately ten weeks afterward: six weeks only leaving his hiding place \"in the dead of night\" for water; two weeks eavesdropping on the neighborhood at night, for the purpose of gathering intelligence, and returning to his hiding place before dawn; and two weeks being \"pursued almost incessantly\", having been discovered by a dog.\nThere was widespread fear among the White population in the rebellion's aftermath. Militias and mobs killed as many as 120 enslaved people and free African Americans in retaliation. After trials, the Commonwealth of Virginia executed eighteen enslaved people accused of participating in the rebellion, including Turner himself; many Black people who had not participated were also persecuted in the frenzy. Because Turner was educated and a preacher, Southern state legislatures passed new laws prohibiting the education of enslaved people and free Blacks, restricting rights of assembly and other civil liberties for free Blacks, and requiring White ministers to be present at all worship services.\nLonnie Bunch said that the \"Nat Turner rebellion is probably the most significant uprising in American history\".\nPreparations\nNat Turner was enslaved in Southampton County, Virginia in the early 19th century. Turner said he wanted to spread \"terror and alarm\" among Whites. And the group decided that \"until [they] had armed and equipped [themselves], and gathered sufficient force, neither age nor sex was to be spared.\" According to a letter sent to Richmond Enquirer by an initial interviewer of Turner after his capture, \"women and children would afterwards have been spared, and men too who ceased to resist.\"\nTurner began communicating his plans to a small circle of trusted fellow slaves. \"All his initial recruits were other slaves from his neighborhood\". These scattered men had to find ways to communicate their intentions without revealing the plot. Songs may have tipped the neighborhood members to movements: \"It is believed that one of the ways Turner summoned fellow conspirators to the woods was through the use of particular songs.\" According to author Terry Bisson, Turner entrusted his wife, Cherry, with \"his most secret plans and papers\". According to a report by James Trezvant immediately following the uprising, Cherry said that Nat had been \"digesting\" a plan for the revolt \"for years\".\nTurner eagerly anticipated God's signal to \"slay my enemies with their own weapons\". He began preparations for an uprising against the slaveholders in Southampton County. Turner said, \"I communicated the great work laid out to do, to four in whom I had the greatest confidence\": fellow slaves Henry, Hark, Nelson, and Sam.\nRebellion\nBeginning in February 1831, Turner interpreted atmospheric conditions as signs to prepare for the revolt. An annular solar eclipse on February 12, 1831, was visible in Virginia and much of the southeastern United States; Turner envisioned this as a Black man's hand reaching over the sun. Illness prevented Turner from starting the rebellion as planned on Independence Day, July 4, 1831. The conspirators used the delay to extend planning. On August 13, an atmospheric disturbance made the Virginia sun appear bluish-green, possibly the result of a volcanic plume produced by the eruption of Ferdinandea Island off the coast of Sicily. Turner took this as a divine signal and started the rebellion a week later, on August 21.\nThe rebellion expanded from several trusted slaves to over 70 enslaved and free Blacks, some of whom were on horseback. They were armed with knives, hatchets, and blunt instruments; firearms were too difficult to collect and would have drawn unwanted attention. Additional weapons were collected as the rebels moved from house to house; they also added to their numbers, growing from fifteen to fifty or sixty.\nThe rebels killed White people without discriminating by age or sex. Turner's slaveowner and his family were the first to be killed. Over the course of 48 hours, the rebels then traveled from house to house, freeing slaves and killing Whites. Historian Stephen B. Oates writes that Turner called on his group to \"kill all the white people\".\nAccording to the Richmond Enquirer, \"Turner declared that 'indiscriminate slaughter was not their intention after they attained a foothold, and was resorted to in the first instance to strike terror and alarm. A few homes were spared \"because Turner believed the poor White inhabitants 'thought no better of themselves than they did of negroes. The rebels also avoided the Giles Reese plantation, even though it was en route, likely because Turner wanted to keep his wife and children safe. Turner confessed to killing only one person, Margaret Whitehead, whom he killed with a blow from a fence post. The last house to be attacked was the Rebecca Vaughan House.  plantation, where the rebellion was suppressed]]The state militia suppressed the rebellion at Belmont Plantation on the morning of August 23. The rebels killed between 55 and 65 White people, of which 20-30 were children, before being defeated by the militia, making it the deadliest slave revolt in U.S. history. The militia had twice the manpower of the rebels and three companies of artillery. Turner was not immediately captured; he survived in hiding for approximately 10 weeks afterward.\nRetaliation\nWithin a day of suppressing the rebellion, the local militia was joined by detachments from the  and  in Norfolk and militias from neighboring counties in Virginia and North Carolina. Brigadier General William Henry Brodnax commanded the Virginia militia.\nIn Southampton County, Blacks suspected of participating in the rebellion were beheaded by the militia, and \"their severed heads were mounted on poles at crossroads as a grisly form of intimidation\". A local road (now Virginia State Route 658) was called \"Blackhead Signpost Road\" after it became the site of one such display.\nRumors quickly spread that the slave revolt had spread as far south as Alabama. Fears led to reports in North Carolina of slave \"armies\" on highways, burning and massacring the White inhabitants of Wilmington, North Carolina, and marching on the state capital. The fear and alarm resulted in White violence against Blacks on flimsy pretenses. The editor of the Richmond Whig described the scene as \"the slaughter of many blacks without trial and under circumstances of great barbarity\". The violence continued for two weeks after the rebellion. General Eppes ordered a halt to the killing:\nHe will not specify all the instances that he is bound to believe have occurred but pass in silence what has happened, with the expression of his deepest sorrow, that any necessity should be supposed to have existed, to justify a single act of atrocity. But he feels himself bound to declare, and hereby announces to the troops and citizens, that no excuse will be allowed for any similar acts of violence, after the promulgation of this order.\nIn a letter to the New York Evening Post, Reverend G. W. Powell wrote that \"many negroes are killed every day. The exact number will never be known.\" A company of militia from Hertford County, North Carolina, reportedly killed forty Blacks in one day and took $23 and a gold watch from the dead. Captain Solon Borland, leading a contingent from Murfreesboro, North Carolina, condemned the acts \"because it was tantamount to theft from the White owners of the slaves\".\nModern historians concur that the militias and mobs killed as many as 120 Blacks, most of whom were not involved with the rebellion.\nCapture\n.]]\nTurner eluded capture for approximately ten weeks but remained in Southampton County. According to Terry Bisson, Turner's wife Cherry was \"beaten and tortured in an attempt to get her to reveal his plans and whereabouts.\" After a raid on the Reese plantation, the Richmond Constitutional Whig reported on September 26 that \"some papers [were] given up by his wife, under the lash.\" According to The Authentic and Impartial Narrative, also published in 1831, journal entries by Turner were \"in her possession after Nat's escape.\"\nOn October 30, Benjamin Phipps, a farmer, discovered Turner hiding in Southampton County in a depression in the earth created by a large, fallen tree covered with fence rails. Around 1 p.m. on October 31, Turner arrived at the prison in Jerusalem. While awaiting trial, he confessed knowledge of the rebellion to attorney and slavery apologist Thomas R. Gray.\nTrials and executions\nDozens of suspected rebels were tried by courts specially convened for the rebellion. Turner was tried on November 5, 1831, for \"conspiring to rebel and making insurrection\", and was convicted and sentenced to death. His attorney was James Strange French. James Trezvant served on the jury. Turner was hanged on November 11, 1831, in the county seat of Jerusalem, Virginia (now Courtland). According to some sources, he was beheaded to deter further rebellion. The body was dissected and flayed, and the skin used to make souvenir purses. In October 1897, Virginia newspapers reported that Dr. H. U. Stephenson of Toano, Virginia, was using the skeleton as a medical specimen.\nMost of Turner's alleged conspirators were tried in Southampton County, with some trials in neighboring Sussex County or other nearby counties. French represented many of the defendants, along with William Henry Brodnax and Meriwether Brodnax. Thirty slaves were convicted, of whom eighteen were hanged and twelve were sold out of state; fifteen were acquitted. Four of the five free Blacks tried were acquitted; one was hanged.\nLegislative response\nDuring the rebellion, the Virginia General Assembly targeted free Blacks with an African relocation bill, and a police bill denying them trials by jury and criminal punishment by slavery and relocation. The General Assembly received petitions from at least seven slave owners asking to be compensated for slaves lost without trial because of the insurrection; they were all rejected.\nThe General Assembly debated the future of slavery the following spring. Some urged gradual emancipation, but the pro-slavery side prevailed after Virginia's leading intellectual, Thomas Roderick Dew, president of the College of William and Mary, published \"a pamphlet defending the wisdom and benevolence of slavery, and the folly of its abolition\". Laws were passed in all slave states except Maryland, Kentucky, and Tennessee criminalizing teaching Blacks to read and write, and restricting Blacks from holding religious meetings without a licensed White minister.\nOther Southern slave-holding states also enacted legal restrictions on Black activities. Possession of abolitionist publications was criminalized in Virginia and other Southern states.\nAftermath\nOn September 3, 1831, William Lloyd Garrison published an article, \"The Insurrection\", in the abolitionist newspaper The Liberator. On September 10, 1831, The Liberator published excerpts from a letter to the editor saying that many people in the South believed the newspaper had a link to the revolt and that if Garrison were to go to the South, he \"would not be permitted to live long... he would be taken away, and no one is the wiser for it... if Mr. Garrison were to go to the South, he would be dispatched immediately... [an] opinion expressed by persons at the South, repeatedly.\"\nIn November 1831, Thomas R. Gray published The Confessions of Nat Turner, based on research he conducted while Turner was in hiding and from conversations with Turner before the trial. The pamphlet sold 40,000 to 50,000 copies, making it a noted source about the rebellion at the time. But a November 25, 1831, review of the publication by The Richmond Enquirer said:\nThe pamphlet has one defect—we mean its style. The confession of the culprit is given, as it were, from his lips—(and when read to him, he admitted its statements to be correct)—but the language is far superior to what Nat Turner could have employed—Portions of it are even eloquently and classically expressed.—This is calculated to cast some shade of doubt over the authenticity of the narrative, and to give the Bandit a character for intelligence which he does not deserve, and ought not to have received.—In all other respects, the confession appears to be faithful and true.\nGray's work is the primary historical document about Turner but some modern historians, specifically David F. Allmendinger Jr., have also questioned the validity of his portrayal of Turner.\nIn the aftermath of the revolt, Whites did not try to interpret Turner's motives and ideas. Antebellum enslavers were shocked by the rebellion and feared further slave violence; to them, Turner became \"a symbol of terrorism and violent retribution.\" Images were published depicting armed Black men attacking White men, women, and children; these \" haunted White southerners and showed slave owners how vulnerable they were.\" Northern and Southern states shared many of the same fears; a proposal to create a college for African Americans in New Haven, Connecticut was overwhelmingly rejected in the New Haven Excitement.\nThe fear Turner's rebellion caused and the concerns raised in the emancipation debates that followed resulted in politicians and writers defining \"slavery as a positive good\"; Thomas Dew was among those writers. Other Southern writers began to promote a paternalistic ideal of improved Christian treatment of slaves, in part to avoid such rebellions. Dew and others believed they were civilizing Blacks, who were then still mostly American-born through slavery. The writings were collected in The Pro-Slavery Argument, As Maintained by the Most Distinguished Writers of the Southern States (1853).\nSome Virginians wanted to remove all Blacks from the state Tidewater and Piedmont regions or deport all from the state. In 1852, the Virginia branch of the American Colonization Society sent 243 Black Virginians to Liberia.\nOther perspectives\nAfrican Americans have generally regarded Turner as a resistance hero for avenging the suffering of Africans and African Americans. James H. Harris, who has written extensively about the history of the Black church, says that the revolt \"marked the turning point in the black struggle for liberation.\" According to Harris, Turner believed that \"only a cataclysmic act could convince the architects of a violent social order that violence begets violence.\"\nIn an 1843 speech at the National Negro Convention, Henry Highland Garnet, a former slave and active abolitionist, described Nat Turner as \"patriotic\", saying that \"future generations will remember him among the noble and brave.\" In 1861, Thomas Wentworth Higginson, a White Northern writer, praised Turner in a seminal article published in the Atlantic Monthly. He described Turner as a man \"who knew no book but the Bible, and that by heart who devoted himself soul and body to the cause of his race.\"\nIn 1988, Turner was included in the Black Americans of Achievement biography series for children, with the book Nat Turner: Slave Revolt Leader by Terry Bisson. The book's introduction was written by Coretta Scott King.\nIn 2012, Lonnie Bunch, the then-director of the National Museum of African American History and Culture, later to become the 14th Secretary of the Smithsonian, said that the \"Nat Turner rebellion is probably the most significant uprising in American history.\"\nLegacy\nThe sword Turner is believed to have used in the rebellion is displayed at the Southampton County Courthouse. In 1991, the Virginia Department of Historic Resources dedicated the \"Nat Turner Insurrection\" historic marker on Virginia State Route 30, near Courtland, Virginia. In 2021, the Virginia Department of Cultural Resources dedicated the \"Blackhead Signpost Road\" historic marker at the intersection of Virginia State Route 35 and Meherrin Road.\nIn 2004, the Southampton County Historical Society purchased the Rebecca Vaughan House for restoration and inclusion in their museum; this was the last surviving house where Whites were killed by participants in the rebellion. The Vaughan House was added to the National Register of Historic Places in 2006. The society has also created a driving tour of the sites and locations associated with the rebellion.\nNat Turner's Rebellion is celebrated as part of Black August.\nIn popular culture\nFilm\n* The Birth of a Nation, the 2016 film starring, produced, and directed by Nate Parker is about Turner's 1831 rebellion.\nLiterature\n* The Confessions of Nat Turner (1967), a novel by William Styron, won the Pulitzer Prize for Fiction in 1968. It prompted much controversy, with some criticizing a White author writing about such an important Black figure and calling him racist for portraying Turner as lusting for a White woman.\n* In response to Styron's novel, ten African-American writers published a collection of essays, ''William Styron's The Confessions of Nat Turner: Ten Black Writers Respond'' (1968).\nMusic\n* The 1960s funk-soul band Nat Turner Rebellion was named after the slave revolt.\n* Chance The Rapper's song \"How Great\" refers to Turner's rebellion, along with the 1805 slave revolt at Chatham Manor, in the line, \"Hosanna Santa invoked and woke up enslaved people from Southampton to Chatham Manor.\"\n* In the early 1990s, hip hop artist Tupac Shakur spoke in interviews about Nat Turner and his admiration for his spirit against oppression. Shakur also honored Turner with a cross tattoo on his back \"EXODUS 1831\", referring to the year Turner led the rebellion.\nSee also\n* African-American history\n* Back-to-Africa movement\n* History of slavery in the United States\n* List of incidents of civil unrest in the United States\n* Slave rebellion and resistance in the United States\n* Slavery in the United States\n* 1831 in the United States\nFurther reading\n* Aptheker, Herbert. ''Nat Turner's Slave Rebellion. New York: Humanities Press, 1966.\n* Brodhead, Richard H. \"Millennium, Prophecy and the Energies of Social Transformation: The Case of Nat Turner.\" in Imagining the End: Visions of Apocalypse from the Ancient Middle East to Modern America. A. Amanat and M. Bernhardsson, editors. London: I. B. Tauris, 2002. pp.&nbsp;212–33.\n* Oates, Stephen B. The Fires of Jubilee: Nat Turner's Fierce Rebellion''. New York: HarperPerennial, 1975. .\nReferences\nExternal links\n* [https://famous-trials.com/turner/2675-nat-turner-s-slave-result-map-of-turner-s-path Nat Turner's Slave Revolt: Map of Turner's Path]\n* Breen, Patrick H. \"[https://getd.libs.uga.edu/pdfs/breen_patrick_h_200505_phd.pdf Nat Turner's Revolt: Rebellion and Response in Southampton County, Virginia] Ph.D. dissertation, University of Georgia, 2005.\n* The Confessions of Nat Turner and Related Documents. Kenneth S. Greenberg, ed. Bedford Books, 1996\n* Harraway, Josh. [https://natturner.libsyn.com/ Nat Turner Podcast] March 1, 2018. (audio drama)\n* [http://www.natturnerproject.org The Nat Turner Project.]\n* \"[https://www.pbs.org/wgbh/aia/part3/3p1518.html Nat Turner's Rebellion\"]. Africans in America, PBS.org\n*\n*"
    }
  ]
}