{
  "content": [
    {
      "type": "text",
      "text": "# Nathaniel Bagshaw Ward\n\nfor living people supply only the year with  unless the exact date is already widely published, as per WP:DOB. For people who have died, use . -->\n| birth_place   =\n| death_date    = 4 June 1868\n| death_place   = St Leonard's, Sussex\n| nationality   =\n| other_names   =\n| occupation    = Doctor\n| years_active  =\n| known_for     = Inventor of the glass plant-cases, however, Scottish botanist named A. A. Maconochie had created a similar terrarium almost a decade earlier, but his failure to publish meant that Ward received credit as the sole inventor.\n| notable_works =\n}}\nNathaniel Bagshaw Ward (1791 &ndash; 4 June 1868 in St Leonard's, Sussex) was an English doctor who popularised a case for growing and transporting plants which was called the Wardian case.\nBiography\nWard was born in London, the son of Stephen Smith Ward, a medical doctor. Little is known of his early years and family life, but he is believed to have been sent to Jamaica at the age of thirteen where he may have taken an interest in plants. He practised medicine in a poor area of the East End of London and took an interest in botany and entomology in spare time or when on vacation in Cobham, Kent. Tyler-Whittle in his book, The Plant Hunters, describes the area where he lived:\n|title=The Plant Hunters: Being an Examination of Collecting with an Account of the Careers & the Methods of a Number of Those who Have Searched the World for Wild Plants |publisher=Lyons & Burford |date=1997 |isbn=978-1-55821-592-4 |language=en |orig-date=1970}}}}\nWard qualified as a member of the Royal College of Surgeons in London in 1814, then later became a fellow of the Linnean Society in 1852.\nHis four sons, Stephen (born 1819), Nathaniel (born 1821), John (born 1824) and Richard (born 1831) all went on to qualify as doctors and surgeons. Stephen and Nathaniel after qualifying both worked as assistants with their father at the family East End practice. John joined the Royal Navy in 1846 as an assistant surgeon, serving with distinction on HMS Vengeance during the Crimean War, with the youngest son Richard having his own practice in Central London.\nWard and the Wardian case\nWard first noticed the effects of a hermetically sealed glass container in 1829. He had placed a chrysalis of a sphinx moth in damp soil at the bottom of a bottle and covered it with a lid. A week later he noticed that a fern and grass seedling had sprouted from the soil. His interest piqued, he saw that evaporated moisture condensed on the walls of the bottle during the day, and ran back down into the soil towards evening, maintaining a constant humidity.\nThe glass case that he used to rear butterflies and grow plants was used widely during the time for introducing plants into the British colonies. His first experiments with plants inside glass cases started in 1830. In 1833 George Loddiges used Wardian cases for shipping plants from Australia and said that \"whereas I used formerly to lose nineteen out of the twenty of the plants I imported during the voyage, nineteen out of the twenty is now the average of those that survive\". Loddiges was the vice-president of the Horticultural Society and Wardian cases became popular.\nHe attempted to make a greenhouse at the Clapham garden on the principle of the Wardian case. This was however critiqued by John Lindley in the ''Gardeners' Chronicle, who wrote that \"when it is opened and shut from day to day, it has no more right to the name [of Wardian case] than a common greenhouse\". Lindley also wrote saying that Ward had an inordinate vanity and a desire to be \"recognised [as] a second Newton\".\nDr Ward delivered a lecture on his discovery of a way to preserve plants in 1854 to the Royal Society at the Chelsea Physic Garden. He also worked on microscopy and helped in the development of the Chelsea Physic Garden as a member of the board. He was elected a fellow of the Royal Society in 1852.\nNathaniel Bagshaw Ward died at St Leonards in Sussex and is buried in an unmarked grave in West Norwood Cemetery.\nHe was honoured in 1837, when botanists William Henry Harvey and William Jackson Hooker named a species of moss from South Africa after him, Wardia''.\nReferences\nOther sources\n*\n*\n*\n*\n*\nExternal links\n* [http://www.plantexplorers.com/explorers/biographies/ward/nathaniel-bagshaw-ward.htm Biography]\n* [https://web.archive.org/web/20071206115804/http://www.fownc.org/newsletters/no53.shtml Norwood cemetery]\n* [https://books.google.com/books?id=sz9E4w7M-sIC&q=on+the+growth+of+plants+in+closely+glazed Scan of Ward's publication]"
    }
  ]
}