{
  "content": [
    {
      "type": "text",
      "text": "# National Archaeological Museum of Nuoro\n\n}}\n| location        = Nuoro, Sardinia, Italy\n| coordinates     =\n| type            = national museum\n| director        = Stefano Giuliani\n| website         = https://musei.sardegna.beniculturali.it/musei/museo-archeologico-nazionale-g-asproni-di-nuoro/\n}}\nThe Giorgio Asproni National Archaeological Museum is an archaeological museum in the historic centre of Nuoro, in Sardinia, near the Cathedral of Our Lady of the Snows. Established in 2002, it is located in a nineteenth-century building that belonged to Giorgio Asproni, a Sardinian politician and intellectual of that era.\nThe exhibition\nThe exhibition, recently renovated, includes objects from the territory of the province of Nuoro, the earliest dating from the Paleolithic and the latest from the Middle Ages. The most consistent material is related to the Nuragic age. The museum has a strongly educational setting, with reproductions of some monuments (for example ''Sa Sedda 'e sos Carros'' of Oliena), from which the excavated objects come, and is currently on the ground floor of the building, while the upper floors are still being set up.\nPalaeontology\nThe first room of the museum exhibits palaeontological findings related to some of the animals that populated Sardinia in the Pleistocene. Among these, the remains of animals no longer present in Europe stand out, such as some species of monkeys or hyenas. Most of the findings come from the excavations of Mount Tuttavista in Orosei and from caves in the territory of Oliena.\nPre-Nuragic age\nThe oldest materials consist of chipped stones from the Paleolithic. There is also a selection of materials, mostly pottery, related to the various phases of Sardinia's prehistory. From the Early Bronze Age came the skeleton of Sisaia, a woman that was buried individually with a different ritual compared to the usual collective one of her times, and whose skull shows the signs of a trepanation which probably occurred for magical-religious reasons. The woman survived it, as shown by the perfect welding of the bone washer that was removed and later repositioned in its place.\nNuragic age\nThe nuragic phase is the one to which the archaeological museum of Nuoro dedicates the most space, exhibiting some of the most important findings from the area around it. On a thematic level, the exhibition favours materials from places of worship characterized by the ritual presence of water (well temples and sacred water sources). Among other things, the strong points of the exhibition include a vast collection of Nuragic bronzes, the reconstruction of part of the complex of Sa Sedda 'e Sos Carros in Oliena, and some of the decorated ashlars of the Nuraghe Nurdole in Orani.\nHellenistic age\nA small space is dedicated to the Hellenistic age, but there are still valuable element s there, such as fragments of decorated pottery from Greece and Apulia.\nRoman age\nThe Romanization of the territory is represented by a sample of the most widespread forms and productions of pottery and amphorae of the Roman age, but there are also a few epigraphs and a military diploma, a certificate of discharge of a soldier who had served in the Roman army at the time of emperor Trajan.\nMiddle ages\nA last display case presents some fragments of medieval and post-medieval pottery, coming from the area of the castle of Posada.\nReferences\nBibliography\n*\n*\nExternal links\n*"
    }
  ]
}