{
  "content": [
    {
      "type": "text",
      "text": "# National Book Awards (Philippines)\n\nThe Philippine National Book Awards, or simply the National Book Awards, is a Philippine literary award sponsored by and the Manila Critics' Circle (MCC) and the National Book Development Board (NBDB).\nEvery year since 1982, the Manila Critics Circle has been giving the National Book Awards to the best books written, designed, and published in the Philippines. Early in 2008, the Manila Critics Circle entered into an agreement with the National Book Development Board (Philippines) to institutionalize and co-administer the National Book Awards to better honor Philippine publishers, authors, and book designers.\nThe NBDB’s participation in the conduct of the National Book Awards is in line with its mandate to support local authorship and promote the development of quality books, in accordance with RA 8047 or the Book Publishing Industry Development Act. Both the NBDB and the MCC envision to give a yearly tribute and will continue to recognize the creative works of talented authors and publishers to produce quality books for many years to come.\nHistory\nThe Manila Critics Circle was founded in 1981 when Ophelia Alcantara Dimalanta, Alfredo Navarro Salanga, Alfred A. Yuson, and Isagani R. Cruz realized that Philippine books were not getting the attention they deserved. What to Cruz “seemed like a quixotic venture at that time” was featured in the Asiaweek Literary Review.\nThat magazine article carried this lede: “Considering the Philippines’ relatively high literacy rate, it is ironic that reading is not a favourite pastime among Filipinos. A quartet of dedicated Manila littérateurs believes it’s high time something was done to dispel this literary lassitude.”\nOver the last four decades, this intrepid group of critics grew to include Leonides V. Benesa, Arlene Babst-Vokey, National Artist for Literature Virgilio S. Almario, Alice Guillermo, Doreen G. Fernandez, National Artist for Literature Resil B. Mojares, Roger Bresnahan, Miguel A. Bernad, SJ, Juaniyo Arcellana, National Artist for Literature Cirilo F. Bautista, Soledad S. Reyes, Joel Pablo Salud, Danton Remoto, and Ruel de Vera.\nThe present set of MCC members are Shirley O. Lua, Dean Francis Alfar, Alma Anonas-Carpio, Michael Coroza, and Tony La Viña. Jenny Ortuoste, who passed on last July 21, 2024, continued to participate in the 42nd cycle of nominee selection for the National Book Awards until her health no longer allowed her to join the meetings and deliberations.\nThe National Book Awards has had several sponsors who helped defray the huge expenses holding such awards has entailed: several corporations, agencies, and schools such as Artlab, the Ateneo de Manila University, Ayala Museum, Benguet Corp., Betty’s Sans-Rival & Catering Service, Coca-Cola Bottlers Phils., the Cultural Center of the Philippines, De La Salle University, Equitable Philippine Commercial International Bank, Far Eastern University, Filipinas Foundation, Filipino Bookstore, Fortune Tobacco Corporation, Ganesh Art Center, Heritage Art Gallery, Jollibee Foods Corporation, La Tondeña, Land Bank of the Philippines, Magnolia Corporation, Manila Electric Company, Mobil Philippines, Nestlé Philippines, Paper Industries Corporation of the Philippines, Philippine Amusement and Gaming Corporation, Philippine Long Distance Telephone Company, Philippine Studies Association, Primetrade Asia, San Miguel Corporation, SGV & Company, University of Santo Tomas, and the University of the Philippines Creative Writing Center, now known as the UP Likhaan center.\nGovernment agencies have also provided support by letting us utilize their facilities. The National Museum of the Philippines (NMP, the National Commission for Culture and the Arts (NCCA), the administrator of the Manila Metropolitan Theater, and the Hyundai Hall in Areté, Ateneo de Manila University have served as venues for the awarding ceremonies of the National Book Awards.\nToday, the NBDB covers the costs of mounting the National Book Awards. The NBDB also adds to the MCC’s expertise by inviting other critics, organizations, and schools to participate in the process of judging which books are the best of the year.\nThe winners receive cash awards from various donors, as well as the NBDB, and these awards are given in those donors’ names. For the 42nd cycle of the National Book Awards, we have the Gerardo P. Cabochan Prize (short fiction in Filipino), the National Artist Cirilo F. Bautista Prize (short fiction in English), the Pablo A. Tan Prize (nonfiction prose in English), the Philippine Literary Arts Council Prize (poetry in English) the Victorio C. Valledor Prize (poetry in Filipino), the Alfonso T. Ongpin Prize (art), the Elfren S. Cruz Prize (social sciences), the John C. Kaw Prize (history), and the Hilarion and Esther Vibal Prize (journalism).\nThe 42nd National Book Awards honored the best books written, designed, and published in the Philippines, and this cycle of the awards highlighted titles published in 2023. A total of 326 titles submitted across 31 categories consisting of four languages: English, Filipino, Bikol, and Ilokano. Following the awarding of winners during the 41st cycle last February 2024, the 42nd cycle of the awards is in November 2024 in the historic Intramuros in Manila.\nWhen the National Book Awards set out on its maiden voyage in 1981, there were very few quality books being published in the Philippines. Four decades later, hundreds of Philippine books are marvelously written, beautifully designed, professionally published, and widely read. These are the treasures yielded by our patrimony of letters.\nAward Categories\nLiterary Division\n*Novel in English\n*Novel in Filipino\n*Short Fiction in English\n*Short Fiction in Filipino\n*Nonfiction Prose in English\n*Nonfiction Prose in Filipino\n*Anthology in English\n*Anthology in Filipino\n*Literary Criticism/Cultural Studies\n*Media Studies\n*Poetry in English\n*Poetry in Filipino\n*Graphic Novel and Comics in English\n*Graphic Novel and Comics in Filipino\n*Translated Book in English\n*Translated Book in Filipino\n*Drama and Film\nNon-Literary Division\n*Art\n*Social Sciences\n*Philosophy\n*History\n*Humor, Sports, Lifestyle, and Business\n*Food\n*Science\n*Spirituality and Theology\n*Professions\n*Journalism\nDesign\nSpecial Prizes\n*The Gerardo P. Cabochan Prize (short fiction in Filipino)\n*The National Artist Cirilo F. Bautista Prize (short fiction in English)\n*The Pablo A. Tan Prize (nonfiction prose in English)\n*The Philippine Literary Arts Council Prize (poetry in English)\n*The Victorio C. Valledor Prize (poetry in Filipino)\n*The Alfonso T. Ongpin Prize (art)\n*The Elfren S. Cruz Prize (social sciences)\n*The John C. Kaw Prize (history)\n*The Hilarion and Esther Vibal Prize (journalism)\nThe National Book Awards Trophy\nSource:\nIn the early years, several sculptors donated trophies and, later, when the NBDB took over the management of the awards, those trophies and their design were finally funded. The National Book Awards now has a standardized trophy, much like the Academy Awards has its recognizable Oscar trophy. Our sculptors were Eduardo Castrillo, Agnes Arellano, Manuel Baldemor, Cesare and Jean Marie Syjuco, Edgar Doctor, Gino Gonzalez, National Artist for Sculpture Napoleon Abueva, Tito Sanchez, Glenn Cagandahan, Michael Allen R. Cacnio, Salvador Joel Alonday, Pete Jimenez, Lawin Abueva, and Raul Funilas.\nThe current National Book Awards Perpetual Trophy was designed by artist Apolinario L. Aquino Jr. and was first used in the 37th National Book Awards in 2018. It symbolizes the Filipino's love of reading books. The half-person-half-pen figure represents all the writers, editors, translators, book designers, creatives, publishers, and book lovers across the country. The book, as its pedestal, signifies the importance of reading—a valuable foundation of education. The black and gold colors embody the significance of books’ entertainment value, flair to ignite creativity, and even power to spark a conversation. The design also integrates the logos of the two collaborating partners, the Manila Critics Circle and the National Book Development Board. The trophy is a testament of our pride of the Philippine publication industry.\nAwarding Ceremonies\n{| class=\"wikitable\"\n|Cycle\n|Year\n|Trophy Design\n|Awards Venue\n|-\n|1st\n|1982\n|Eduardo Castrillo\n|\n|-\n|2nd\n|1983\n|Eduardo Castrillo\n|\n|-\n|3rd\n|1984\n|Agnes Arellano\n|\n|-\n|4th\n|1985\n|Agnes Arellano\n|\n|-\n|5th\n|1986\n|Agnes Arellano\n|\n|-\n|6th\n|1987\n|Agnes Arellano\n|\n|-\n|7th\n|1988\n|\n|\n|-\n|8th\n|1989\n|Cesare and Jean Marie Syjuco\n|\n|-\n|9th\n|1990\n|Cesare and Jean Marie Syjuco\n|\n|-\n|10th\n|1991\n|Cesare and Jean Marie Syjuco\n|\n|-\n|11th\n|1992\n|Edgar Doctor\n|\n|-\n|12th\n|1993\n|Gino Gonzalez\n|\n|-\n|13th\n|1994\n|Gino Gonzalez\n|\n|-\n|14th\n|1995\n|Gino Gonzalez\n|\n|-\n|15th\n|1996\n|Napoleon Abueva (National Artist)\n|\n|-\n|16th\n|1997\n|Napoleon Abueva (National Artist)\n|\n|-\n|17th\n|1998\n|Napoleon Abueva (National Artist)\n|\n|-\n|18th\n|1999\n|Napoleon Abueva (National Artist)\n|\n|-\n|19th\n|2000\n|\n|SM  Megamall, Megatarde Hall\n|-\n|20th\n|2001\n|\n|SM  Megamall, Megatarde Hall\n|-\n|21st\n|2002\n|\n|\n|-\n|22nd\n|2003\n|Glenn Cagandahan\n|SM  Megamall, Megatarde Hall\n|-\n|23rd\n|2004\n|\n|\n|-\n|24th\n|2005\n|\n|World  Trade Center\n|-\n|25th\n|2006\n|Tito Sanchez\n|World  Trade Center\n|-\n|26th\n|2007\n|\n|\n|-\n|27th\n|2008\n|Glenn Cagandahan\n|Yuchengco  Museum, Makati City\n|-\n|28th\n|2009\n|Michael Cacnio\n|Ayala  Museum, Makati City\n|-\n|29th\n|2010\n|Michael Cacnio\n|Metropolitan  Museum, Bangko Sentral ng Pilipinas Complex\n|-\n|30th\n|2011\n|Salvador Joey Alanday\n|National  Museum of the Philippines Anthropolog Marble Hall\n|-\n|31st\n|2012\n|Michael Cacnio\n|National  Museum of the Philippines Anthropology Old Senate Session Hall\n|-\n|32nd\n|2013\n|Michael Cacnio\n|EDSA  Shangri-La, Manila, Garden Ballroom\n|-\n|33rd\n|2014\n|Pete Jimenez\n|National  Museum of the Philippines Anthropolog Marble Hall\n|-\n|34th\n|2015\n|Mulawin Abueva\n|National  Museum of the Philippines Anthropology Old Senate Session Hall\n|-\n|35th\n|2016\n|Raul G. Furnilas\n|National  Museum of the Philippines Fine Arts Auditorium\n|-\n|36th\n|2017\n|Raul G. Furnilas\n|National  Museum of the Philippines Fine Arts Auditorium\n|-\n|37th\n|2018\n|Apolinario Aquino, Jr.\n|National Museum of  the Philippines Fine Arts Auditorium\n|-\n|38th\n|2019\n|Apolinario Aquino, Jr.\n|National  Museum of the Philippines Fine Arts Auditorium\n|-\n|39th\n|2022\n|Apolinario Aquino, Jr.\n|Online,  NBDB Facebook and Youtube accounts\n|-\n|40th\n|2023\n|Apolinario Aquino, Jr.\n|Metropolitan  Theater, Manila\n|-\n|41st\n|2024\n|Apolinario Aquino, Jr.\n|Areté,  Hyundai Hall and Ubuntu Space, Ateneo de Manila University\n|-\n|42nd\n|2024\n|Apolinario Aquino, Jr.\n|Centro de  Turismo Intramuros and Museo de Intramuros\n|}\nThe 42nd Philippine National Book Awards\nThe 42nd Philippine National Book Awards took place on November 23, 2024 at the Centro de Turismo Intramuros. The Manila Critics Circle and the National Book Development Board co-hosted the event.\nAwards Catalogs (36th cycle, 2017 to 42nd cycle, 2024)\nIn 2017, the National Book Awards catalog was redesigned under the art direction of [https://www.linkedin.com/in/anthony-john-balisi-905b8a230/ Anthony John Balisi], adopting a striking black and gold theme. Each year, the catalog showcases a distinct design school of thought, featuring styles such as Art Nouveau, Art Deco, and Brutalism. It has also highlighted traditional design patterns, including the intricate motifs of the Maguindanaon Inaul.\n*[https://books.gov.ph/wp-content/uploads/2024/04/NBA-36th-souvenir.pdf 36th National Book Awards]\n*[https://books.gov.ph/wp-content/uploads/2024/04/NBA-37th-souvenir-cropped_1.pdf 37th National Book Awards]\n*[https://books.gov.ph/wp-content/uploads/2024/04/NBA-38th-souvenir_1.pdf 38th National Book Awards]\n*[https://books.gov.ph/wp-content/uploads/2024/04/NBA-39th-souvenir.pdf 39th National Book Awards]\n*[https://books.gov.ph/wp-content/uploads/2024/04/40th-NBA-Catalog.pdf 40th National Book Awards]\n*[https://books.gov.ph/wp-content/uploads/2024/04/41st-NBA-Catalog_1.pdf 41st National Book Awards]\n*[https://books.gov.ph/wp-content/uploads/2024/12/42nd-NBA-Catalog-2024.pdf 42nd National Book Awards]\nAward Administrators\nSource:\nThe Manila Critics Circle (MCC)\nFounded in 1981, the Manila Critics Circle, Inc. is a non-profit, non-stock organization of professional literary critics and newspaper columnist who believe that Philippine books deserve much more attention than they usually get from business, media and the general public. Aside from giving the Annual Book Awards, the Circle has held an ASEAN-wide literary contest (in cooperation with Filipinas Foundation), participated in the nomination process for National Artist awards, joined National Book exhibits, prepared various position papers on literary publishing, and sat in the National Book Development Board. Members have done reviews for national and international periodicals, such as ASEAN Theater Journal, Asiaweek, Diyaryo Filipino, Filipinas, Filipino Magazin (Filmag), Independent, Journal of Asian Studies, Kinaadman, Manila Chronicle, Manila Times, National Book Review, Philippine Daily Globe, Philippine Daily Inquirer, Philippine Graphic, Philippine Journal of Education, Philippine Panorama, Philippine Star, Philippine Studies, Sun-Star Weekend, Unitas, and World Literature Today, and for television shows such as Mabuhay: This is Your Wake-Up Call.\nRebranding - MCC chair Dean Francis Alfar made an announcement on November 2024 with regards to how to better nurture the Philippine literary ecosystem: “As of next year, we are officially rebranding the MCC to Filipino Critics Circle.” The National Book Development Board (NBDB)\nThe National Book Development Board is the book agency of the Philippines mandated to create a robust environment for publishing that stands on a strong culture of reading. It provides technical and developmental assistance to creatives, publishers, booksellers, enterprises, and individuals involved in the production of books and the business of publishing.\nIt has a multisector representation which harnesses the creativity of content creators, publishers, book distributors, and readers toward a vibrant book publishing ecosystem.\nReferences\nExternal links\n*[http://books.gov.ph/nba/ National Book Awards (Philippines)] official website\n*[https://books.gov.ph/catalogs/ Books Philippines Catalogs]\n*[http://nbdb.gov.ph/nbdb-awb/index.php List of award winning books]"
    }
  ]
}