{
  "content": [
    {
      "type": "text",
      "text": "# National Picture Theatre, Kingston upon Hull\n\n| architectural_style =\n| building_type       = Cinema\n| address             = Beverley RoadKingston upon HullHU3 1UX\n| years_built         =\n| groundbreaking_date =\n| start_date          =\n| stop_date           =\n| topped_out_date     =\n| completion_date     =\n| opened_date         = 23 December 1914\n| inauguration_date   =\n| relocated_date      =\n| renovation_date     =\n| closing_date        =\n| destruction_date    = 18 March 1941\n| cost                =\n| owner               =\n| height              =\n| material            =\n| size                =\n| floor_count         =\n| floor_area          =\n| architect           =\n| architecture_firm   =\n| parking             =\n| public_transit      =\n| website             =\n| references          =\n| footnotes           =\n}}\nThe National Picture Theatre on Beverley Road in Kingston upon Hull, England, was a cinema which was built in 1914. During the Second World War, the cinema was bombed and mostly destroyed when an air raid took place on the night of 18 March 1941. A film had been showing at the time of the bombing, which was Charlie Chaplin's The Great Dictator. All 150 people in the cinema at the time escaped and there were no casualties. The interior of the building was completely destroyed but the facade somehow escaped the blast. It still remains to this day alongside fragments of the foyer and vestibule behind it. The cinema is the last remaining civilian bomb ruin still in existence and was Grade II listed in January 2007.\nReconstruction\nTill July 2018 the building was owned by Saleem Hakim, who had plans to turn the front of the Theatre into an alfresco dining area. The Hull City Council first considered these proposals in 2009, when the owner had plans to convert the site into flats and a restaurant. As a result of the recession in 2010, work had stalled. In November 2013, the owner intended to use part of back of the site as a car park. A decision to issue a compulsory purchase order (CPO) on the site was made by the Hull City Council in October 2014, when the plans failed to materialise. This was issued in January 2015 after the owner had failed to sell the site at an auction. Further attempts at auctioning the site off by the owner were made in June 2015, where it again failed to sell. The auction, which only included the building's frontage, were listed with a guide price of £40,000.\nIn March 2016, Hull City Council refused an application by the owner to create an outdoor dining area in what used to be the building's main auditorium. The owner had wanted to use the land in conjunction with a new Indian restaurant, due to open next door at a neighbouring pub. The scheme was refused during the planning process after it was found that such a development would have a detrimental impact on the theatre itself. The application was the ninth submitted in five years. In May 2016, the Hull City Council issued a compulsory purchase order on the building, allowing them to buy the land with or without the owner’s permission. But it was not until July 2018 that the building was in the hands of Hull City Council.\nIn March 2020, work got underway to stabilise the foundations of the structure. Funds for the building's full restoration, awarded by Hull City Council (£178,300) and the National Lottery Heritage Fund (£277,600), will commence in 2024.\nThe Trust\nThe National Civilian WW2 Memorial Trust (NCWW2MT) is a registered charity with the aim of preserving and restoring the National Picture Theatre in Kingston upon Hull, England.\nAs a result of the cinema being derelict since the Second World War, The National Civilian WW2 Memorial Trust were formed to '''establish the National Picture Theatre ruins and site as a National Home Front tribute, to be a place of education, history and remembrance, to honour the civilians who lived and worked through the Blitz not only in Kingston upon Hull but across the whole nation.''' The Trust was officially registered with The Charity Commission on 4 October 2012 with the current chairman being Tom Robinson. That month, the Trust were given planning permission to turn the theatre into a memorial site with an education centre.\nReferences"
    }
  ]
}