{
  "content": [
    {
      "type": "text",
      "text": "# National Revolutionary Martyrs' Shrine\n\n| location = Zhongshan, Taipei, Taiwan\n|nearest_town =\n|designer =\n|inscription =\n|established = 1969\n|unveiled =\n|total =\n|unknowns =\n|commemorated =\n|by_country =\n|by_war =\n|source =\n}}\nThe '''National Revolutionary Martyrs' Shrine''' () is a Martyrs Shrine in Zhongshan District, Taipei, Taiwan, dedicated to the war dead of the Republic of China.\nBuilt on Chingshan Mountain and overseeing the Keelung River in Taipei's Zhongshan District in 1969, the Martyrs' Shrine recalls the architecture of the Hall of Supreme Harmony in Beijing's Forbidden City. The structure houses the spirit tablets of about 390,000 persons killed, among other engagements, during the Xinhai Revolution, Northern Expedition, Second Sino-Japanese War, Chinese Civil War, and the First and Second Taiwan Strait Crises. A changing of the honor guard from the various branches of the Republic of China Military, similar to the rituals at the Sun Yat-sen Memorial Hall and Chiang Kai-shek Memorial Hall, take place at the shrine.\nThe Martyrs' Shrine was the site of the funeral of Chiang Ching-kuo in 1988. On March 29 (Youth Day, commemorating the Huanghuagang Uprising) and September 3 (Armed Forces Day) of every year the President of the Republic of China leads the heads of the five Yuans (branches of government) to pay their respects to the martyrs by bowing and offering incense. Similar shrines are located in each locality in Taiwan, and similar ceremonies are led by county magistrates and city mayors.\nAlthough the Martyrs' Shrine is located in Taiwan, most of the soldiers were born in mainland China. Taiwan was ruled by Japan throughout World War II, and about 200,000 Taiwanese who lived under Japanese rule served in the Japanese Imperial Army or Navy.\nFollowing a 1998 legal amendment, people who were not affiliated with the military could be inducted into the shrine. Lin Ching-chuan, a teacher who died trying to save children in the 1992 Taoyuan County tour bus fire, was the first civilian to be inducted into the shrine. Several police officers and firefighters who have died in the line of duty have also been commemorated at the shrine, including Yang Chi-chang, who died in the Taiwan McDonald's bombings. Healthcare workers on duty during the Hoping Hospital lockdown of the 2003 SARS outbreak have also been inducted. Wen Yung-nan, who died in 1973 while delivering mail in the aftermath of Typhoon Nora, was the first postal worker to be inducted.\nImage:Zhonglieci.jpg|Paifang\nImage:ROCA Honor Guard at National Revolutionary Martyr's Shrine 20070806.jpg|Changing of the Guard\nImage:Honor Guard of ROCA standing at National Revolutionary Martyr's Shrine 20050804.jpg\nImage:National Revolutionary Martyr's Shrine 01.jpg|Entrance building\nImage:National Revolutionary Martyr's Shrine 02.jpg|Main shrine\nImage:National Revolutionary Martyr's Shrine 04.jpg|A jiatu on the main shrine\nImage:Drum Tower, National Revolutionary Martyr's Shrine 20110314.jpg|Drum Tower, on the site\nHistory\nTaiwan Gokoku Shrine was a Shinto shrine located in Taiwan.  It was a Gokoku Shrine, or a shrine dedicated to war dead. Such shrines were made to serve to enshrine the war dead, and they were all considered \"branches\" of Yasukuni Shrine. They were renamed from Shokonsha in 1939. It was made into the National Revolutionary Martyrs' Shrine after the end of the Pacific War.\nTransport\nThe shrine is accessible within walking distance West from Dazhi Station of the Taipei Metro.\nSee also\n* Controversies surrounding Yasukuni Shrine\n* Hero shrine\n* Martial temple and Wen Wu temple\n* Eternal Spring Shrine\n* Chinese Cultural Renaissance\n* Ancestral shrine\n* Gallant Garden\n* Gokoku Shrines\n* Tomb of the Unknown Soldier\n* Arlington National Cemetery\n* Kalibata Heroes Cemetery\n* Valhalla (home to the souls of fallen warriors in Scandinavian mythology)\n* Walhalla Shrine (a hall of fame in Germany honoring \"commendable and honorable Germans\")\n* Eternal Spring Shrine\n* The common end of myriad good deeds\n* Greek hero cult\n* Kaohsiung Martyrs' Shrine\n* Taichung Martyrs' Shrine\n* Yasukuni Shrine, one of the most notable soldier shrines in Japan\n* List of tourist attractions in Taiwan\nReferences\nExternal links\n* [https://youtube.com/shorts/QtXVYksnqrA?si=kpOV5CE-FqG1oIPK Looking Around Taipei Revolutionary Martyrs’ Shrine in a 360-degree View (YouTube)]\n*[https://youtube.com/shorts/3wENLZf4dWU?si=ggSNybSepGeG1yQE Guards Marching at the Entrance of Taipei Revolutionary Martyrs’ Shrine (YouTube)]\n*\nja:和歌山県護国神社"
    }
  ]
}