{
  "content": [
    {
      "type": "text",
      "text": "# National Library of the Kyrgyz Republic\n\n| native_name_lang    =\n| logo                =\n| logo_size           =\n| logo_alt            =\n| image               = Nationallibrary.jpg\n| image_size          =\n| image_upright       =\n| alt                 =\n| caption             = Main building in Bishkek\n| country             =\n| type                = National library\n| scope               =\n| established         =\n| architect           =\n| dissolved           =\n| ref_legal_mandate   =\n| location            =\n| service_area        =\n| coordinates         =\n| location_map        =\n| branch_of           =\n| num_branches        =\n| items_collected     = Books, journals, newspapers, magazines, official publications, sheet music, sound and music recordings, databases, maps, postage stamps, prints, drawings, manuscripts and media.\n| collection_size     =\n| criteria            =\n| legal_deposit       = Yes\n| req_to_access       =\n| annual_circulation  =\n| pop_served          =\n| members             =\n| budget              =\n| director            =\n| num_employees       =\n| parent_organization =\n| affiliation         =\n| publictransit       =\n| website             =\n| references          =\n| embed               =\n| module              =\n}}\nThe National Library of the Kyrgyz Republic is the legal deposit and copyright agency for Kyrgyzstan. It was founded in 1934. It has a collection of 6 million documents in 89 languages from around the world. Since 2005 the head of the Kyrgyz National Library is Dr. Jyldyz Bakashova. According to the website, some of the primary functions of the National Library in Kyrgyzstan are “preserving the cultural wealth and traditions of the peoples of our country, collecting and accumulating human knowledge.”\nHistory\nThe Library was established in 1934 under Soviet Rule in the capital city of Frunze (modern day Bishkek). Formed from the joining of the Central City library and the Scientific Library it was then renamed the N.G. Chernyshevsky State Library of the Kyrgyz SSR. Nikolay Chernyshevsky was a radical Russian journalist in the mid 1800’s who is thought to be a forerunner to Lenin, so the library being named after him pays homage to the ideologies funding the project. In 1939, the Chernyshevsky Library started to function as a book depository, receiving mandatory copies of items published in the USSR, and then in 1940, also mandatory copies of domestic publications. Bibliographic work soon got underway, and in 1950, the Department of Local Studies and Kyrgyz Books was created. This division was established to identify, record, and promote the press of the Kyrgyz SSR and local history literature. The National Bibliography Department was formed in 1961, which supported the Soviet Centralized Bibliography. Lev Vladmirov, in his article published in the College & Research Libraries Journal, noted the vast scope and value of the “supranational” bibliography of the USSR. The National Bibliography supported the documentation of works being published in Kyrgyzstan, making those records accessible to citizens and the centralized authorities in Moscow. In 1984, the library moved into a large, 7 story building designed for the storage of 3 million storage units and named after Vladimir Lenin. This building is the current location. After the break from the Soviet Union, the library was renamed the National Library of the Kyrgyz Republic, and “classified as a particularly valuable object of national heritage, representing the historical and cultural heritage of Kyrgyzstan”. Today, the National Library is named after a Kyrgyz poet, Alykul Osmonov. The library has continued with displaying the collections, and uses social media to showcase these holdings in a broader way. On the Instagram page, the National Library of the Kyrgyz Republic posts photos of displays and collection holdings, complete with detailed descriptions of the post. This current trend shows the modernization of the library system, and its commitment to preserving the cultural history. In 2013, the library marked the 75th birthday of Kyrgyz poet Gulsaira Momunova with an exhibition of her works.\nReferences\nExternal links\n* [http://www.nationallibraryofkyrgyzstan.org Official site]\n* [http://www.nlkr.gov.kg Official site (Russian)]"
    }
  ]
}