{
  "content": [
    {
      "type": "text",
      "text": "# National Intelligence Law of the People's Republic of China\n\n(applicable extraterritorially)\n| enacted_by     = 28th meeting of the Standing Committee of the 12th National People's Congress\n| date_enacted   = June 27, 2017\n| date_assented  =\n| date_commenced = June 28, 2017\n| bill           =\n| bill_citation  =\n| bill_date      =\n| introduced_by  =\n| 1st_reading    =\n| 2nd_reading    =\n| 3rd_reading    =\n| amended_by     = [https://en.pkulaw.cn/display.aspx?cgid=313975&lib=law 2018]\n| related_legislation =  National Security Law (China),  Cybersecurity Law,  Data Security Law\n| summary        = A law enacted in accordance with the Constitution, in order to strengthen and safeguard national intelligence work and safeguard national security and interests.\n| keywords       = National Security, Intelligence\n| status         = In force\n}}\nThe '''National Intelligence Law of the People's Republic of China''' () is a national law of the People's Republic of China, passed in June 2017.\nThe law is the first one made public in China which is related to China's national intelligence agencies. The law does not explicitly name any organizations that it empowers. According to the law, \"everyone is responsible for state security\" which is in line with China's state security legal structure as a whole. The final draft of the law on 16 May 2017 was toned down as compared to previous versions. The 12th Standing Committee of the National People's Congress passed the law on 27 June 2017. The law was updated on 27 April 2018.\nThe passage of the National Intelligence Law was part of a larger effort by the Chinese central government to strengthen its security legislation. In 2014, China passed a law on counterespionage, in 2015 a law on national security and another on counter-terrorism, in 2016 a law on cybersecurity and foreign NGO management, among others.\nProvisions\nThe most controversial sections of the law is Article 7. Gu Bin of the Beijing Foreign Studies University wrote his opinion in the Financial Times that Article 7 \"does not authorize pre-emptive spying\" and \"national intelligence work must be defensive\". Murray Scot Tanner, currently an American defense policy analyst, made a counterargument in Lawfare that the National Intelligence Law changes Chinese citizen's legal obligations from intelligence 'defense' to 'offense'.\nReaction and analysis\nExperts argue that the law forces Chinese telecommunications companies with operations overseas such as Huawei to hand over data to Chinese government regardless of which country that data came from. To counteract perceived concerns, Huawei, in May 2018, submitted legal opinion by Chinese law firm Zhong Lun, which among other things stated that \"Huawei’s subsidiaries and employees outside of China are not subject to the territorial jurisdiction of the National Intelligence Law\".\nA 2019 report by Sweden-based law firm Mannheimer Swartling concluded that \"NIL applies to all Chinese citizens\", and even overseas subsidiaries of global Chinese companies \"could be subject to NIL\".  However, the report also stated that it was \"based on an objective reading of an English version of NIL\" and \"not construed to interpret NIL under the Chinese domestic legal system\" but rather its \"applicability to multinational companies based on a literal reading of certain provisions of NIL and interpreting those provisions based on principles of public international law\".\nWriting for China Law Translate in 2024, Jeremy Daum stated that \"it is far from clear that it [Article 7 of the NIL] was ever intended to require active participation in information gathering or sharing\".  He stated that the provision lacked an enforcement mechanism and that penalties could only be applied when intelligence work was “obstructed” and that such work had to be conducted “in accordance with law” - which might include other legislation such as the PIPL.  He further stated that “intelligence” was left undefined in the text, and that the \"strongest indication of the focus of “intelligence work” is probably Article 11, which describes the “intelligence information” that should be collected by the authorities. It describes the information as (1) about conduct endangering national security or interests (2) that is carried out by, at the direction of, or in collusion with foreign groups, and (3) collected for the purpose of stopping, preventing, or punishing that conduct.\". Nevertheless, he stated that none of this precluded or hindered the ability of the Government of China to conduct espionage efforts and that direct requests from law enforcement or security would still be difficult to resist meaningfully.\nThe CLOUD Act, enacted the following year, has been viewed as a US parallel to this law.\nSee also\n* Cybersecurity Law of the People's Republic of China\nNotes\nReferences\nExternal links\n* [http://www.npc.gov.cn/npc/c30834/201806/483221713dac4f31bda7f9d951108912.shtml 中华人民共和国国家情报法 (National Intelligence Law of the People's Republic of China)]"
    }
  ]
}