{
  "content": [
    {
      "type": "text",
      "text": "# National Society Colonial Dames XVII Century\n\n| leader_title = President general\n| leader_name = Rebecca Eisenman\n| founded_date = July 15, 1915\n| founding_location = San Francisco, California\n| type = Non-profit, lineage society, heraldry society\n| founder = Mary Florence Taney\n| focus = Historic preservation, education, patriotism\n| headquarters = Brigadier General George P. Scriven House 1300 New Hampshire Avenue, Washington, D.C., U.S.\n| publication =\n| affiliations =\n| homepage =\n}}\nThe National Society Colonial Dames XVII Century, also referenced as National Society Colonial Dames 17th Century, is an American lineage-based heraldry society and non-profit service organization for women who are directly descended from American colonists who lived in the Thirteen Colonies prior to 1701.\nEstablished in 1915, the organization holds one of the largest collections of coats of arms in the United States. The National Society Colonial Dames XVII Century has 45 active state societies in the United States and one active international society in Canada.\nHistory\n, at current College Landing Archeological Site, placed by the organization along with the Virginia Historical Society and the City of Williamsburg]]\nin Stuart, Florida]]\nThe National Society Colonial Dames XVII Century was founded by Mary Florence Taney of Kentucky during the meeting of the International Genealogical Congress at the Panama–Pacific International Exposition in San Francisco, California. It was established on July 15, 1915, as a non-profit organization in Washington, D.C.\nTaney, along with Alice Hardeman Dulaney of New York, Anna Taylor Hodge of Kentucky, Georgena Hodge Bailey of Kentucky, Florence May Washington of Kentucky, and Grace Marie Cheever of Ohio, formed the organization as a lineage society.\nThe headquarters was established in the 1884 Victorian home of Brigadier General George P. Scriven, the Brigadier General George P. Scriven House, in Dupont Circle located at 1300 New Hampshire Avenue, which is listed on the National Register of Historic Places. The National Society Colonial Dames XVII Century purchased the home from the Veterans of Foreign Wars on May 15, 1957, for their headquarters, meeting place, library, and repository.\nThe organization was founded for women, at least 18 years of age, who are lineal descendants of an ancestor who lived and served prior to 1701 in one of the Thirteen American Colonies: the Province of Massachusetts Bay, the Province of Georgia, the Province of New Hampshire, the Connecticut Colony, the Colony of Rhode Island and Providence Plantations, the Province of Pennsylvania, the Province of New Jersey, the Province of New York, the Delaware Colony, the Colony of Virginia, the Province of Maryland, the Province of North Carolina, and the Province of South Carolina.\nThe National Society Colonial Dames XVII Century states on their official website that their members are \"devoted to preserving the memory of those that settled in the United States of America prior to 1701.\" The organization preserves historic sites and records, promotes heraldry and coats of arms of colonial families and organizations, and supports education at local, state, and the national level.\nThe organization sponsors and places historical markers throughout the United States.\nOrganization and structure\nThe National Society Colonial Dames XVII Century has over 11,000 members throughout forty-five state societies in the United States and one international society based in Canada. Each of the societies are made up of individual chapters.\nThe organization is led by the president general, who is elected for a two-year long term by members in attendance of the organization's annual conference. The national executive board, which is headed by the president general, is composed of thirteen elected members.\nNotable members\n* Ann Turner Dillon, clubwoman and lineage society leader\n* Marion Moncure Duncan, businesswoman and lineage society leader\n* Edith Scott Magna, lineage society leader\n* Mary Florence Taney, lineage society leader\n* Almyra Maynard Watson, military nurse\n* Lynn Forney Young, civic leader and lineage society leader\nReferences\nSee also\n* Colonial Dames of America\n* National Society of Colonial Dames of America\n* Southern Dames of America"
    }
  ]
}