{
  "content": [
    {
      "type": "text",
      "text": "# National Archaeological Museum of Orvieto\n\n| former_name         =\n| established         =\n| dissolved           =\n| location            = Orvieto, Italy\n| type                = museum\n| accreditation       =\n| key_holdings        =\n| collections         =\n| collection_size     =\n| visitors            =\n| founder             =\n| director            =\n| president           =\n| chairperson         =\n| curator             =\n| architect           =\n| historian           =\n| owner               =\n| publictransit       =\n| car_park            =\n| parking             =\n| network             =\n| website             =\n| embedded            =\n}}\nThe National Archaeological Museum of Orvieto is a museum in Orvieto, region of Umbria, Italy. It is located adjacent to the Duomo in the Gothic-style 13th-century Papal Palace (the section called Palazzo Martino IV) in Piazza Duomo.\nDescription\nThe archaeological museum is housed on the ground floor of this palace, attached near the crossing to the South of the Cathedral building. This museum and the nearby, but separate, Museo Claudio Faina, located on the opposite side of Piazza Duomo, display findings from and around Orvieto.\nInaugurated in 1982, the National Museum exhibition displays materials found in the territory up to the 19th century and previously held in the archaeological section pertaining to the Museo dell'Opera del Duomo. To this collection of thousands of items have been added, including the detached frescoes from the Etruscan tombs of Golini in Porano, which had been held till 1982 in the National Archaeological Museum of Florence.\nGallery\nAnfora a figure nere da poggio ginestra, orvieto, loc. ginestra 0.JPG | An amphora\nBusto di età severiana occultato in campo della fiera a Orvieto, forse di Geta 02.JPG | A bust\nOrvieto, vaso da tomba del fondo di teodora ricci, loc. canonica, IV-III sec ac. 01.JPG | A vase\nMANO - Orvieto Belvederetempel 2.jpg | Terracotta item\nSources"
    }
  ]
}