{
  "content": [
    {
      "type": "text",
      "text": "# National Culture Week of Burkina Faso__disambig_1\n\nThe National Culture Week of Burkina Faso, better known by its French name La Semaine Nationale de la culture (SNC), is one of the most important cultural activities of Burkina Faso. It is a biennial event which takes place every two years in Bobo Dioulasso, the second-largest city in the country.\nNational Culture Week was established to promote Burkinabé culture in Burkina Faso. It was created in 1983 to alternate with FESPACO which is a biennial African film festival organized in Burkina Faso.  The thirteenth edition took place in May 2006.\nObjective\nThe Ministry of Culture, Art and tourism handles the organization of the manifestation. Initially plans for an each year manifestation, the National Culture Week settled in Bobo-Dioulasso, the second town of the country since 1990.\nIt takes place every two years. The manifestation has three main objectives. Firstly, it allows the meeting of all Burkinabe ethnic groups and promotes Burkinabe cultural and artistic activities. Secondly, it develops a best social integration for others nationalities living in the country by creating meeting surroundings. Thirdly, it reinforces the inter-African and international cooperation.\nHistoric\nSince 1983, there have been thirteen editions of the National Culture Week.\nFirst edition: Ouaga 83\nThe first edition named Ouaga 83 took place in Ouagadougou, the first town of Burkina Faso from the 20–30 December 1983. The entrants were about 2000. All of them participated at the same time to the festival and the competition.\nSecond edition: Gaoua 84\nThe second edition called Gaoua 84 took place the 13–20 December 1984 in the south of the country. At the end of this Edition, some economic problems related to the periodicity of the event arisen. As a result, the organizers decided that the manifestation will take place every two years from now on in Bobo. So the following edition took place in 1986 at Bobo-Dioulasso.\nThird edition: Bobo 86\nThe National Culture Week Bobo 86 went from the 20–28 March. A big carnival with more than 500 masks participate took place. Some famous groups like the Theater Daniel SORANO of Senegal participate to the manifestation.\nFourth edition: Koudougou – Reo 88\nThe fourth edition named Koudougou – Reo 88 went from the 19–26 March 1988. This edition was special. Indeed, it took place in two towns of the country : Koudougou and Reo. In addition to Burkinabe participants, 11 foreign troupes participated to the manifestation. Moreover, Burkinabe diaspora participate to the spectacle art competition.\nFifth edition: Bobo 90\nThe fifth edition: Bobo 90 took place during the week 24–31 March 1990 in Bobo Dioulasso. The theme of this edition was Culture, factor of integration. At the end of this edition, organizers decided that future editions will take place only in Bobo-Dioulasso. So, until now, The National Culture Weeks take place in Bobo-Dioulasso.\nSixth edition: Bobo 90\nAs a result, the Sixth edition named Bobo 90 took place the 5–12 April 1990 under the theme Culture and Democracy. This edition paid attention especially to Children well-being and traditional sports.\nSeventh edition: Bobo 92\nThe Seventh edition: Bobo 92, it took place the 23–30 April 1996 under the theme Support artistic and literary creation.\nEighth edition: Bobo 96\nAlso, the Eighth edition called Bobo 96 took place the 23–30 March 1996 under the theme broad cultural life participation.\nNinth edition: Bobo 96\nSo, the Ninth edition: Bobo 98 took place the  8–25 April 1998 under theme Favors and developed artistic meeting.\nTenth edition: Bobo 98\nThe Tenth edition: Bobo 98 took place the 24 March-2 April 2000 under the theme investment in Culture for the future. Ivory Coast, Benin and Mali participate to the manifestation.\nEleventh edition: Bobo 2000\nThe Eleventh edition: Bobo 2000 took place the 23–30 March under the theme Culture and Development. Participation of celebrities like Magic System from Ivory Coast and le Point d’Alençon from France marked this edition.\nTwelfth edition: Bobo 2002\nThe Twelfth edition: Bobo 2002 took place the 27 March–3 April. The entrants were about 1200 Burkinabe and some foreign artists.\nThirteenth edition: Bobo 2006\nAs for the thirteenth edition: Bobo 2006 happened from the 25 March-1 April with about 1499 entrants.\nActivity of the National Culture Week\nA festival part and a competition part called the National Award of Arts and literature made the National culture Week.\nFestival\nThe Festival part consists mainly on the free spectacles, popular animation, trade fair and touristic excursions. Indeed, during the National Culture Week, free spectacles and animation are giving on public place by all musicians artists entrant. There we can meet traditional and modern music plus dance. In addition, a great trade fair is organized during each edition. The displayers are society of the country who represent international firms, artists and local commercial people. There we can find different kind of useful things like decoration objects, crafts, clothes, Arts objects, traditional medicines ... Moreover, cultural and artistic animations such as music, traditional dance and sports occur during the fair. This make the fair more attractive.\nNational Prize of Arts and Literature\nBesides the festival the second part of the manifestation is called the National Award of Arts and Literature. This part of the manifestation consists on a competition between artists in different domains. This competition had allowed to discover new talents and to promote them. Literature, cookery, visual arts, spectacle arts and traditional sports represent the different competitive domains.\nSpectacle art\nSpectacles art competition are the most privileged in the National Culture Week. In fact, the majority of the entrants compete in this domain and it comport many parts. Indeed, Spectacles Arts regroup choreographic creation, traditional dance, traditional music,  best traditional singer, best modern singer. Here, the National Culture Week aims are the valorization of artistic patrimonies and traditional music of all Burkinabe ethnic groups. Each competitor must use traditional instruments such as Louanga, kora, Djembe.\nVisual art\nVisuals art is not so developed in Burkina Faso. The National Culture Week aims are the development and the rising of a real market on those kinds of art. The categories considered are sculpture, Batik,  and painting.\nLiterature\nLiterature competitions is about the realization of comic trip, the writing of novels, plays and the writing of traditional stories. Authors have the right to create their own themes. This initiative leads to more innovations.\nCookery\nThe cookery competition was started to recognise the variety and potential of Burkinabè food. The jury is made up of three people. Entrants compete in three menu categories: fatly dishes, resistant dishes, desserts and drinking. The jury holds three main criteria of judgement. Firstly, the time of the preparation; Secondly, the origin of the food which have to be local and thirdly the hygienic conditions of cooking.\nTraditional sport\nAs for sports, two traditional sports are part of the competition; in one hand traditional wrestling and, in the other hand archery. The wrestlers compete according to their weight. Athasane Raoul Moussiane named the Bull of Nayala has been five times winner of the 85 weight and over categories. As for the archery, competitors are divided into two categories which are adults for the distance of 30 meters and young for the distance of 20 meters.\nRewards\nPrizes\nRewards are essentially in cash. However, the amount of money given rise each years. At the end of the competition, three prize-winners in each domain receive a reward. Indeed, in the main time, each prize-winners receives a fix amount of money depending on their distinctions. Moreover, special prices are given by some communities or the government. These prices can be monetary or materials.\nPrize winners of Bobo 2006\nThe spectacles art winners get between 500000CFA to 100000 CFA. As for visual art prize-winners, they get between 400000CFA and 20000 CFA. The literature prize-winners receive between 500,000CFA to 300,000CFA. Cookery winners receive between 150000CFA to 80000CFA. Finally, traditional sports winners receive between 75000CFA to 10000CFA.\nThe following name are some of the prize winners of Bobo 2006\nSpectacle arts prize-winners\nBest traditional singers\n* 1st Abzeta Ouédraogo\n* 2nd Natama Youmali\n* 3rd Sawadogo Habib\nBest modern singers\n* 1st Thiombiano Arouna\n* 2nd Netchy Lee\n* 3rd Dembele Bintou\nVisual art\nSculpture\n* 1st Ouattara Brahima\n* 2nd Gandema Adama\n* 3rd Kaboré Eric\nBatik\n* 1st Zoundi Idrissa\n* 2nd Bissyende Emmanuel\n* 3rd Kaboré Achille\nPainting\n* 1st Conseimbo Lassina\n* 2nd Salo Joël\nLiterature prize winners\nComic strip\n* 1st \"La charge victorieuse de Naba Kango\" of Kafando Mady\n* 2nd \"Tinga demande pardon\" of Zoungrana W. Hermann\n* 3rd \"SOS trafiquant d’enfants\" of Ouattara Brama\nNovels\n* 1st \"Madame la ministre et moi\" of Ilboudo Pierre Claver\n* 2nd \"Le temps de l’absent\" of Lyel Bi Oyom\n* 3rd \"Le bout du tunnel\" of Ky/Katkyono Angelina Marie\nPlays\n* 1st \"Du pognon pour une parcelle\" of Kam Heidi Sophie\n* 2nd \"Ganeya\" of Bazié Denis\n* 3rd \"Beau roi\" of Bazyé Bruno\nTraditional stories\n* 1st \"Kiba, l’orphelin au coeur d’or\" of Nadembéga Laurent\n* 2nd \"La soirée de contes pour enfants\"of Sanon Hermann Philippe\n* 3rd \"La femme gazelle\" of Kafando Lamoussa Théodore\nCookery prize winners\nAppetizers\n* 1st Kabore Adeline\n* 2nd Bande/Zomba Fanta\n* 3rd Kouraogo Fati\nMeal\n* 1st Ouedraogo Pauline\n* 2nd Ouedraogo Kouguimatou\n* 3rd Nouffe Affiroua\nDesserts\n* 1st Poda/Kabore Brigitte\n* 2nd Zoungrana Catherine\n* 3rd Bande/Zomba Fanta\nDrinking\n* 1st Nebie/Yogo Assita\n* 2nd Konate Alizeta\n* 3rd Ouedraogo Kouguimatou\nReferences\nExternal links\n* [http://www.culture.gov.bf/Site_Ministere/textes/evenements/evenements_snc.htm MCAT]\n* [http://www.aib.bf/siteaib/culture.htm AIB]"
    }
  ]
}