{
  "content": [
    {
      "type": "text",
      "text": "# National Coalition of Syrian Revolutionary and Opposition Forces\n\n| logo                     = SyrianNationalCoalitionOfficialLogo.svg\n| logo_caption             = Official logo of the SNC\n| image                    = Flag of the Syrian revolution.svg\n| caption                  = Syrian independence flag\n| nickname                 = Syrian National Coalition\n| merged                   = Syrian caretaker government\n| formation                =\n| founding_location        = Doha, Qatar\n| dissolved                =\n| purpose                  = Opposition to and replacement of the Ba'athist&nbsp;regime\n| headquarters             =Istanbul, Turkey (2012–2024)Damascus, Syria (2024–2025)\n| region_served            = Syria\n| membership               = 114 members\n| language                 = Arabic\n| general                  =  Haytham Rahmeh\n| leader_title             = President\n| leader_name              = Hadi al-Bahra\n| leader_title2            = Vice Presidents\n| leader_name2             =\n| affiliations             =\n| website                  =\n}}\nThe National Coalition of Syrian Revolution and Opposition Forces,}} commonly named the Syrian National Coalition (SNC),}} or the Syrian National Revolutionary Coalition (SNRC) was a pro-democracy political organization founded in Doha, Qatar, in November 2012 during the Syrian Civil War in an attempt to coalesce the various opposition movements to Bashar al-Assad's Ba'athist regime.\nThe coalition was recognized by several United Nations member states, by the European Union and by the Arab League as the legitimate representative of the Syrian people. It included for a time the Syrian National Council, another coalition group which had been previously received diplomatic recognition.\nThe SNC was based outside Syria until late 2024. Though it established contact with the Free Syrian Army and tried for a time to monitor it through the Supreme Military Council, the SNC initially suffered from a lack of presence on the ground, from internal infighting and from rivalry between foreign powers for influence over it. Originally divided between factions aligned with either Qatar or Saudi Arabia, the SNC came to operate mostly under Turkish influence.\nOn 18 March 2013, the National Coalition of Syrian Revolution and Opposition Forces established the Syrian Interim Government (SIG) which later exercised authority in Turkish-occupied zones of Syria.\nThe SNC attempted to negotiate with the regime as part of the Syrian peace process. In 2014, the Syrian National Council, which had been the biggest block in the coalition so far, left it in protest at the decision of the coalition to attend the Geneva II Conference on Syria. The Coalition later took part to the Syrian Negotiation Commission and had representatives in the Syrian Constitutional Committee. However, as the civil war was in deadlock and the peace negotiations failed to produce results, the SNC lost clout and came to be considered mostly as Turkey's relay of influence. It lost support from the United States in 2019, and the Arab League withdrew its recognition in 2023. The Syrian National Coalition did not include Hay'at Tahrir al-Sham which eventually played a leading role in toppling Assad's government in 2024.\nIn late 2024, after the fall of the Assad regime, the SNC relocated from Istanbul to Damascus. In February 2025, the SNC declared its allegiance to the new authorities under Ahmed al-Sharaa and announced that it would dissolve and merge into the Syrian administration.\nFormation\nThe National Coalition was formed as an effort to provide a leadership for the various grassroots movements that had started in 2011 the uprising against the Assad regime. The Syrian National Council had so far failed to provide such a leadership and lacked a connection with the activists within Syria, and resisted Turkey and France's pressure to establish a transitional government for Syria. The countries that supported the Syrian opposition, Qatar and the United States in particular, pushed for a new structure that would provide a greater representation to the opposition forces from the liberated areas of Syria.\nRiad Seif, a member of the Syrian National Council's executive committee and former Damascus Spring figure, started in August 2012 to discuss his plans for a new structure - then called the \"Syrian National Initiative\" - with close associates and American officials. On 31 October, American Secretary of State Hillary Clinton publicly stated that the Syrian National Council could \"no longer be viewed as the visible leader of the opposition.\" This caused new dissent within the Syrian National Council, as spokespeople for that organization decried what they called \"direct tutelage\" by the United States. Seif presented his proposal to the Syrian National Council in September, but his colleagues were deeply divided and delayed making a decision. Eventually, a proposal was published on 1 November which would lead to the formation of the National Coalition ten days later.\nStructure and aims\nAt its creation in November 2012 the National Coalition elected former imam of the Umayyad Mosque in Damascus, Moaz al-Khatib, considered a moderate as its president, Riad Seif and Suheir Atassi, both prominent democracy activists and the latter a secular human rights advocate, as vice-presidents and Mustafa Sabbagh as secretary-general. The post of a third vice president remained vacant for a Kurdish figure to be elected. The coalition initially had a council of about 63 members, including 22 members from the Syrian National Council. Original members included Riad Seif for the Forum for National Dialogue, Suheir Atassi for the Syrian Revolution General Commission, political figures such as Mouaffaq Nyrabia, Haitham al-Maleh, Ali Sadreddine Al-Bayanouni, Monzer Makhous and Kamal al-Labwani, as well as members of various local councils, of the Local Coordination Committees, of the Kurdish National Council, of other movements like the Syrian Human Rights Committee, the Revolutionary Council of Syrian Clans, the Syrian National Democratic bloc, the Syrian Scholars Association and the Unions of Syrian Authors, as well as Turkmen representatives. Members of the Syrian National Council included George Sabra, Burhan Ghalioun, Abdulbaset Sieda, Louay M. Safi and Randa Kassis (later chairwoman of the Russian-supported peace talks platform in Astana). In 2014, the Coalition was expanded to include the Syrian Turkmen Assembly and several other entities. The Syrian National Council and its backbone faction, the Muslim Brotherhood, initially played a leading role in the affairs of the National Coalition. When the coalition's general assembly met in Cairo on 29 November to activate its operational structures and approve its statutes, National Council members and associates accounted for 60 percent of those present.\nIn 2012, the National Coalition stated that its aims were replacing the Bashar al-Assad government and \"its symbols and pillars of support\", \"dismantling the security services\", unifying and supporting the Free Syrian Army, refusing dialogue and negotiation with the al-Assad government, and \"holding accountable those responsible for killing Syrians, destroying [Syria], and displacing [Syrians]\".\nOn 24 March 2013 Moaz al-Khatib made a surprise announcement that he was stepping down as president of the coalition.  Although he gave no reason at the time, he later talked of interference by international and regional actors; the interviewer named these as Qatar and Saudi Arabia. The coalition refused al-Khatib's resignation. Khatib was still considered the \"primary voice\" of the Syrian opposition, and the following day the Arab League granted Khatib the position to head the coalition's delegation to the Arab League. He continued in office for almost another month before confirming his resignation on 21 April 2013.\nAt a conference held in Istanbul on 19 March 2013, members of the National Coalition elected Ghassan Hitto as prime minister of an interim government for Syria. Hitto has announced that a technical government would be formed which will be led by between 10 and 12 ministers. The minister of defence would be chosen by the Free Syrian Army.\nOn 31 May 2013, the coalition gave membership to 15 representatives of the Free Syrian Army, allowing for the first Time direct representation of rebels operating in Syria. On 6 July, the coalition elected a new leadership. Ahmad Asi Al-Jarba was elected president and Anas Al-Abdah was elected as secretary general. On 14 September 2013, the National Coalition selected Ahmad Tu'mah as prime minister of an interim government for Syria. On 25 September 2013, some Islamist factions rejected the Syrian National Coalition stating that \"All groups formed abroad without having returned to the country do not represent us.\"\nThe Syrian National Council withdrew from the coalition on 20 January 2014 in protest at the decision of the coalition to attend the Geneva talks. The Coalition effectively replaced the Syrian National Council as the main representative body of the Syrian opposition.\nThe Syrian Interim Government (SIG) functioned first as a government-in-exile. From 2015, it began to exercise some authority in rebel-held zones of Syria. Later on, it expanded its control in Turkish-occupied zones of Syria. Several Turkish-supported rebel groups unified under the name Syrian National Army (SNA) to function as the SIG's armed forces.\nRiad Seif, one of the major figures of the Damascus Spring, became president of the SNC in 2017. He resigned 10 months later, due to health issues and conflicts with his Turkish-backed vice-president Abdurrahman Mustafa, president of the Syrian Turkmen Assembly. Mustafa became president to finish Seif's term until the next election, and was later reelected. According to a Syria Direct investigation, Mustafa helped strengthen Turkey's influence over the SNC. In 2019, he left the presidency of the SNC to become president of the Syrian Interim Government. Mustafa redefined the SIG's relationship with the Coalition by rejecting the SIG's subordination to the SNC: he also refused to relinquish his membership in the SNC after becoming president of the SIG as his predecessor had done. Mustafa deepened the SIG's relationship with Turkish services and governors and replaced the SIG's representatives in the SNC. While the SNC remained officially a higher authority than the Syrian Interim Government, it was the Turkish-backed SIG that came to wield power over it.\nIn September 2023, Hadi al-Bahra, who had already led the Coalition between 2014 and 2015 and been a chief negotiator during the peace talks, was elected again as president of the SNC. Syria Direct reported that al-Bahra's return as president had been imposed by members of the SNC close to the Turkish government, notably Abdurrahman Mustafa. At that point, the Syrian National Coalition had lost much credibility at an international level, as it had become largely seen as a platform for Turkish interests. Notably, the United States cut off in 2019 all financial and diplomatic aid and political cover from the SNC after Turkey launched its offensive into north-eastern Syria.\nDomestic recognition\nThe Local Coordination Committees of Syria (LCCSyria) stated that they \"[reaffirm their] participation in the National Coalition. The [LCCSyria have] worked hard, and will continue to spare no effort, to ensure the success of the National Coalition in its service to the revolution.\" The National Coalition was supported by the Free Syrian Army from October 2013 or earlier.\nOn 16 November 2012, there were 497 street demonstrations in Syria according to the LCCSyria, including 121 demonstrations in Hama that \"expressed support for the National Coalition\" and 104 demonstrations in Idlib who called for the National Coalition to \"support the revolutionaries\".\nFollowing the election of the Coalition's president, several pro-Islamist media outlets have signalled their approvals for the formation of the new revolution bloc under the leadership of Sheikh Moaz Al-Khatib.  Answering questions on his students' portal [http://www.esinislam.com/ EsinIslam] of The Awqaf London the London-based Damascene graduate African Muslim cleric, Sheikh Dr. Abu-Abdullah Abdul-Fattah Adelabu called upon the Islamists and their affiliates to support the coalition's leadership.\n, Italy]]\nMembers of the al-Nusra Front and 13 other armed groups stated in a YouTube video on 19 November 2012 that they \"unanimously reject[ed] the conspiratorial project called the National Coalition and announce[ed] [its] consensus to establish an Islamic state [in Syria]\". A day later, commanders of one of those groups, the al-Tawhid Brigade appeared in a video with members of the Aleppo Military Council and Transitional Military Council. They stated that they supported the National Coalition and that the previous day's statement was by \"revolutionary forces on the ground\" who were not sufficiently represented in the National Coalition. The head of the Free Syrian Army in Aleppo, Abdel Jabbar al-Okaidi, responded to the 19 November statement, saying, \"These groups represent a number of military factions on the ground and reflect their position, but not all military forces in Aleppo agree with this. The military council has announced its support for the National Coalition and is collaborating with [it].\" Members of the groups listed in the 19 November statement were contacted by Thomson Reuters and stated that \"they had nothing to do with the announcement\" and that some members of their groups appeared in the video.\nOn 21 November 2012, the Kurdish Democratic Union Party (PYD), which controls territory in the north of Syria, rejected the new coalition and criticised it for \"obedience to Turkey and Qatar\". The Kurdish National Council agreed to join the Syrian National Coalition; the PYD criticized the KNC for doing so.\nAccording to The Economist, as of late September 2013, \"In the month since America backed away from missile strikes to punish Syria's regime for using chemical weapons, the Syrian Opposition Coalition has become increasingly irrelevant.\"\nIn October 2013, the Supreme Military Council of the Free Syrian Army, led by Salim Idris, met with Ahmad Jarba, then the president of the SNC. The SMC recognized the National Coalition as the \"civil authority\" of the Syrian opposition.\nIn the course of 2015, a rival for representing Syrian opposition emerged in the form of the Syrian Democratic Forces and their political arm, the Syrian Democratic Council, which grew in the context of the Federation of Northern Syria – Rojava.\nOn 25 April 2018, the al-Mu'tasim Brigade, a FSA group based in the town of Mare', withdrew its recognition of the National Coalition of Syrian Revolutionary and Opposition Forces due to the National Coalition's inability to make national decisions. The group's decision came hours after George Sabra, Suheir Atassi, and Khaled Khoja resigned from the National Coalition.\nInternational recognition\n. In the center, former president al-Khatib, along with former VPs Seif and Atassi, as well as all SNC chairmen Ghalioun, Sieda and Sabra]]\n, Monzer Makhous was recognised by France as a representative of the National Coalition and as the future Syrian Ambassador \"once a provisional government is established and recognised internationally.\"\nOn 20 November, the UK invited the coalition to appoint a political representative. On 26 November, the National Coalition appointed Walid Safur to be its ambassador to the UK.\nOn 23 November, Qatar asked the coalition to appoint an ambassador, becoming the first Arab country to publicly announce it will accept an envoy from the new opposition body. The SNCs embassy in Qatar was opened on 27 March 2013.\nOn 12 December 2012, the Friends of Syria Group - which includes most members of the Arab League, the United States, the European Union, and Turkey - transferred its recognition from the Syrian National Council to the Syrian National Coalition. The SNC was declared the \"sole legitimate representative\" of the Syrian people, as status that had been previously denied to the National Council.\nOn 6 March 2013, the Syrian National Coalition was granted Syria's seat in the Arab League. However, on 9 March 2014, the Arab League announced that Syria's seat would remain vacant until the opposition completed the formation of its institutions. SNC representatives were allowed to participate in the Arab League's ministerial meetings on an \"exceptional basis\".\nOn 5 May 2014, the Coalition was officially granted diplomatic status with the Washington office formerly recognized as a Foreign Mission in the US. Prior to giving foreign mission status to the Washington Office, the State Department shut down the current Washington Embassy along with several regional consulates.\nIn May 2023, as part of the normalization of diplomatic relations with the Syrian Ba'athist government, the Assad regime was reinstated in Syria's seat in the Arab League.\n{| class=\"wikitable\"\n|+Diplomatic recognition of the National Coalition as the legitimate representative of Syria\n|-\n! scope=\"col\" |\n! scope=\"col\" | Entity\n! scope=\"col\" | Date of recognition\n! scope=\"col\" | Direct terminology\n|-\n| 1&ndash;18 ||  ||  || Sole legitimate representative of Syria\n|-\n| 19 ||  ||  || Sole representative of the Syrian people and future interim government of democratic Syria\n|-\n| 20 ||  ||  || Sole legitimate representative of the Syrian people\n|-\n| 21 ||  ||  || Legitimate representatives of the aspirations of the Syrian people (verbal declaration by the Italian Prime Minister during a TV network interview).\n|-\n| 22 ||  ||  || Sole legitimate representative of the Syrian people\n|-\n| 23 ||  ||  || Sole legitimate representative of the Syrian people\n|-\n| 24&ndash;25 ||  ||  || The legitimate representative of the Syrian people\n|-\n| 24&ndash;25 ||  ||  || The legitimate representative of the Syrian people\n|-\n| 26&ndash;29 ||  ||  || The legitimate representative of the Syrian people\n|-\n| 26&ndash;29 ||  ||  || The legitimate representative of the Syrian people\n|-\n| 26&ndash;29 ||  ||  || The legitimate representative of the Syrian people\n|-\n| 26&ndash;29 ||  ||  || The legitimate representative of the Syrian people\n|-\n| 30 ||  ||  || \"A\" or \"The\" legitimate representative of the Syrian people\n|-\n| 31 ||  ||  || The legitimate representative of the Syrian people\n|-\n| 32 ||  ||  || Sole legal representative of the Syrian people\n|-\n| – ||  ||  || \"Legitimate representatives of the aspirations of the Syrian people\"\n|-\n|}\nPresidents\n{| class=\"wikitable plainrowheaders\"\n|-\n! scope=\"col\" | No.\n! scope=\"col\" | Portrait\n! scope=\"col\" | Name(Birth–Death)\n! scope=\"col\" | Took office\n! scope=\"col\" | Left office\n! width=14% | Political party\n! scope=\"col\" | Note(s)\n|-\n! align=center | 1\n| align=center |\n| align=\"left\" | Moaz al-Khatib\n| align=center | 11 November 2012\n| align=center | 22 April 2013\n| align=center | Independent\n| align=center | Resigned\n|-\n! align=center | —\n| align=center |\n| align=\"left\" | George Sabra\n| align=center | 22 April 2013\n| align=center | 6 July 2013\n| align=center | Syrian Democratic People's Party - Syrian National Council\n| align=center | —\n|-\n! align=center | 2\n| align=center |\n| align=\"left\" | Ahmad Jarba\n| align=center | 6 July 2013\n| align=center | 9 July 2014\n| align=center | Syrian National Council\n| align=center | Re-elected 5 January 2014\n|-\n! align=center | 3\n| align=center |\n| align=\"left\" | Hadi al-Bahra\n| align=center | 9 July 2014\n| align=center | 4 January 2015\n| align=center | Independent\n| align=center | —\n|-\n! align=center | 4\n| align=center |\n| align=\"left\" | Khaled Khoja\n| align=center | 4 January 2015\n| align=center | 5 March 2016\n| align=center | Independent\n| align=center | Re-elected 3 August 2015\n|-\n! align=center | 5\n| align=center |\n| align=\"left\" | Anas al-Abdah\n| align=center | 5 March 2016\n| align=center | 6 May 2017\n| align=center | Movement for Justice and Development\n| align=center | —\n|-\n! align=center | 6\n| align=center |\n| align=\"left\" | Riad Seif\n| align=center | 6 May 2017\n| align=center | 28 February 2018\n| align=center | Independent\n| align=center | Resigned\n|-\n! align=center | 7\n| align=center |\n| align=\"left\" | Abdurrahman Mustafa\n| align=center | 28 February 2018\n| align=center | 29 June 2019\n| align=center | Syrian Turkmen Assembly\n| align=center | Completed Seif's term. Later re-elected. Became prime minister of the Syrian Interim Government after completing his last term\n|-\n! align=center | 8\n| align=center |\n| align=\"left\" | Anas al-Abdah\n| align=center | 29 June 2019\n| align=center | 12 July 2020\n| align=center | Movement for Justice and Development\n| align=center | —\n|-\n! align=center | 9\n| align=center |\n| align=\"left\" | Naser al-Hariri\n| align=center | 12 July 2020\n| align=center | 12 July 2021\n| align=center | Independent Revolutionary Movement\n| align=center | —\n|-\n! align=center | 10\n| align=center |\n| align=\"left\" | Salem al-Meslet\n| align=center | 12 July 2021\n| align=center | 12 September 2023\n| align=center | Syrian Council of Tribes and Clans\n| align=center | —\n|-\n! align=center | 11\n| align=center |\n| align=\"left\" | Hadi al-Bahra\n| align=center | 12 September 2023\n| align=center | 12 February 2025\n| align=center | Independent\n| align=center | Second term\n|-\n|}\nPost-Assad period\nIn December 2024, after the fall of the Assad regime, coalition president Hadi al-Bahra called for an 18-month transitional period to rebuild Syria's institutions and economy, in line with UN Security Council Resolution 2554. He said that the SNC should be expanded to include \"new elements of the opposition\". The coalition expressed its support for the Syrian caretaker government headed by Mohammed al-Bashir and called for a national conference and for the formation of a government that would be \"inclusive of all groups\". Al-Bahra also announced that the coalition would be dissolved should a credible a national constitutional conference be held.\nOn 30 December 2024, al-Bahra announced that he had relocated to Damascus and would now work from there. In January 2025, Samir Sattouf, coordinator of the planned dialogue conference, announced that the Syrian National Coalition and the Syrian Negotiation Commission would not be invited, as these organizations' mandates had expired with the fall of the Assad regime. This was later confirmed by Syria's new leader Ahmed al-Sharaa, though he added their members would be welcome to participate to the conference in a personal capacity. On 8 January 2025, al-Sharaa held a meeting with a delegation from the Syrian National Coalition, headed by al-Bahra. On 30 January, the Syrian Interim Government placed itself \"at the disposal\" of the transitional government.\nOn 7 February, the Kurdish National Council withdrew from the Coalition.\nOn 11 February, it was reported that the SNC was preparing to dissolve and was instructing its employees to apply for positions within the new administration. The next day, al-Bahra, together with Syrian Negotiation Commission president Bader Jamous, held another meeting with al-Sharaa. It was announced that the National Coalition and the Negotiation Commission had agreed to dissolve and to integrate their cadres into the state apparatus. The Syrian National Coalition also declared its allegiance to the new Syrian authorities.\nSee also\n* Politics of Syria\nNotes\nReferences\nFurther reading\n*[https://www.bbc.co.uk/news/world-middle-east-15798218 BBC News: Guide to the Syrian opposition]\nExternal links\n*[http://en.etilaf.org En.etilaf.org]\n*\n*[https://www.facebook.com/pages/Syrian-Interim-Government/245022262309018 Syrian Interim Government]"
    }
  ]
}