{
  "content": [
    {
      "type": "text",
      "text": "# National Academy of Government Managerial Staff of Culture and Arts\n\n}}\nNational Academy of Culture and Arts Management is a Ukrainian state institution of higher education. Its courses include postgraduate education.\nThe National Academy of Culture and Arts Management was established on 3 January 1970. The first name of The Academy was «The Institute for further training of culture specialists».\nSince 1985 the Academy is headed by Chernec Vasyl Gnatovich, Ph.D. (UNESCO, 1993), Professor (1992), Honoured Educator of Ukraine (2001), Member of Collegium of the Ministry of Culture of Ukraine, Laureate of the State Award in Science and Technology (2005), Academician of the Academy of Sciences and Higher education, Member of Union of Journalists in Ukraine, Honoured Member of the Academy of Arts.\nThe educational process is provided by 265 scientific and pedagogical staff:\n* 46 professors;\n* 82 assistant professors;\n* 35 Ph.D.;\n* 102 PhD candidates.\nThe Academy has its own professional studios of the audio-recording and cable television, editorial-and-publishing office, publishing department, modern dancing classes, educational, scientific and productive laboratory of modern technologies for planning and building of landscape objects, management laboratory, multimedia centre, mass-media center.\nAbout 3000 students study at the Academy. In the Centre for Further Training there are 3000 leading specialists in culture and arts, as well as 1200 civil servants are educated and trained annually.\nRegional structures:\n* affiliated branch of NACAM in Chernihiv;\n* The Centre of Excellence and Further Training for Culture Specialists in Rivne.\nEnglish, German, French, and Spanish are taught at the Academy and there is a free special preparation for international examinations (TOEIC, TOEFL, FCE, CAE, CPE, IELTS).\nThe Academy collaborates towards development and implementation of innovative services in Ukrainian libraries for further integration of Ukraine  into the global information space within the program «Bibliomist» (the Bill and Melinda Gates Foundation together with the International Research and Exchanges Board (IREX))).\nThe National Academy of Cultural and Arts Management maintains connections with the EU Office in Ukraine.\nSpecialists of the Academy are members of international organizations, in particular:\n* The International Federation of Landscape Architects (IFLA);\n* The Association of Landscape Architects of Ukraine;\n* The European Federation for Landscape Architecture (EFLA);\n* ICOMOS;\n* Ukrainian National Committee of the International Committee for the Conservation of Industrial Heritage - TICCIH - Ukraine;\n* The International Association of Music Libraries, Archives and Documentation Centers (IAML);\n* The International Federation for Choral Music: ACA, EUROPA CANTAT;\n* The project «Arts environment manager» (USA - Ukraine);\n* The International Centre «European Initiative» of the Lviv Stauropigion University (Germany).\nExternal links\n* [http://dakkkim.edu.ua/ Official site]"
    }
  ]
}