{
  "content": [
    {
      "type": "text",
      "text": "# National Democracy (Ukraine)\n\nNational Democracy}}\nNational Democracy (), also abbreviated as Natsdems () and sometimes referred to as Orangeism (), is a political ideology in Ukraine. Since 1989, it has been one of the country's main political ideologies, along with Russophilia. National Democracy is generally Atlanticist and pro-European in foreign policy, while being sceptical of closer relations with Russia. Domestically, it is socially and economically liberal, as well as anti-communist.\nNational Democracy was preceded by the Ukrainian dissident movement during the Brezhnev era. Traditionally, National Democracy has been particularly popular in Western Ukraine, as well as, to a lesser extent, Central Ukraine. Two Presidents of Ukraine have been associated with National Democracy, Viktor Yushchenko and Petro Poroshenko.\nHistory\nCreation, Ukrainian People's Republic, and interwar\nNational Democracy has its origins in the late 19th century, when Ivan Franko and Yulian Bachynsky, two left-wing Ukrainian politicians and cultural figures in Austria-Hungary, developed the ideology. It subsequently spread in Dnieper Ukraine, then under the Russian Empire, and quickly became the leading revolutionary ideology among Ukrainians living in the empire. , a leading ideologist of National Democracy during this period, expressed the view that states established on the basis of ethnicity possessed unique cultures of statehood. According to Dnistrianskyi, Ukrainian state culture was based primarily on defence of the local population from foreign rule, which he claimed was in contrast to Western European states of the time. National Democrats established the Ukrainian People's Republic in 1917.\nDuring the interwar period, National Democrats shifted from the left to the political centre of Ukrainian politics under the Second Polish Republic. The Ukrainian National Democratic Alliance, the largest party of such an orientation, participated in Polish elections. At this time, the ideology came under threat from both increased interest in national communism on the left and Ukrainian nationalism on the right. The latter ideology took inspiration more from the  and integral nationalism, seeking to establish a conservative mass movement.\nRevival and Chornovil\n, responsible for the revival of National Democracy]]\nNational Democracy began to be reformulated around the time of the Revolutions of 1989, with the formation of the People's Movement of Ukraine (or Rukh), taking inspiration from the Lithuanian Sąjūdis and Polish Solidarity. Leading the 1989–1991 Ukrainian revolution, National Democrats found their first major victory with the 1991 Declaration of Independence of Ukraine, which was confirmed by the 1991 Ukrainian independence referendum. Following these events, the former dissidents and human rights activists that made up the National Democratic movement began organising under the slogan of \"building the state\".\nThe early successes of the renewed National Democracy were followed by a fragmentation and weakening of the National Democratic movement. The reasons for this have been attributed by National Democratic politician  to Ukrainian independence reducing the appeal of the National Democratic movement, while journalist  has argued that the National Democratic movement faced decline in the face of its focus on idealism and a lack of clear positions, as well as the general decline of ideological politics in Europe as a whole. Doroshenko has also pointed to the fragmentation of National Democracy in electoral politics as self-damaging, pointing to the fact that the presence of three separate National Democratic candidates (Viacheslav Chornovil, Levko Lukianenko, and Ihor Yukhnovskyi) in the 1991 Ukrainian presidential election assisted in bringing about the victory of Leonid Kravchuk.\nKravchuk initially sought out the support of National Democrats in governance, but these attempts were rejected by many of the movement's more radical voices, such as Chornovil, who had no intention of working with an ex-communist politician. Pragmatists such as Ivan Drach, Mykhailo Horyn, and Volodymyr Yavorivsky (among others) formed the  in an effort to further support for Kravchuk. Following the victory of \"red director\" Leonid Kuchma in the 1994 Ukrainian presidential election, however, Chornovil originally fought to maintain relevance by working alongside Kuchma as \"constructive opposition\". Despite this, Kuchma actively worked against the National Democrats, exploiting divisions between Rukh and other nationalist parties such as the Congress of Ukrainian Nationalists and Ukrainian Republican Party to the benefit of the Communist Party of Ukraine during the 1998 Ukrainian parliamentary election.\nOn 25 March 1999, Chornovil was killed in a car crash. Following his death, Rukh gradually lost much of its influence. The 1999 Ukrainian presidential election, in which Chornovil was considered a serious competitor, instead resulted in a contest between Kuchma and Communist leader Petro Symonenko.\n1999–present\nand Yulia Tymoshenko, respectively leaders of the moderate and radical wings of the National Democrats during the 2000s]]\nViktor Yushchenko became one of two leaders of the National Democratic movement after Chornovil's death, alongside Yulia Tymoshenko. However, much of the movement since 2000 has been spent infighting and halfhearted cooperation. Yushchenko, who served as prime minister under Kuchma from 1999 to 2001, led the movement's pragmatist wing, which sought to compromise with Kuchma's government and members of the oligarchy in order to maintain political stability. Many pragmatists were also businessmen who preferred to avoid opposing the government, as business and politics were closely intertwined. On the other hand, Tymoshenko led the movement's more radical, ideologically-driven wing, which more was willing to work with populist parties against the oligarchy.\nDuring Kuchmagate, Yushchenko and the movement's pragmatist described the anti-Kuchma opposition as \"politically destructive\" and \"extremist\", and refused to oppose the president outright even as he was removed as prime minister in April 2001 through Kuchma's machinations. In November 2001, Yushchenko stated that his new Our Ukraine, an electoral alliance of pragmatic National Democratic parties, would offer Kuchma \"constructive criticism from a bloc with a patriotic stand\".\nOur Ukraine emerged as the largest faction in the Verkhovna Rada (Ukrainian parliament) with 113 seats in the 2002 Ukrainian parliamentary election, followed by the Yulia Tymoshenko Bloc with 22 seats. Both before and after the election, a number of pro-government politicians, including Petro Poroshenko and Ivan Plyushch, defected to Our Ukraine. In the period immediately following the election, Yushchenko and Our Ukraine sought to form a pro-presidential coalition with centrists parties before joining the anti-Kuchma Rise up, Ukraine! protests, which saw both wings of the movement unite against Kuchma.\nYushchenko was chosen as the candidate of the People's Power coalition between Our Ukraine and Yulia Tymoshenko Bloc for the 2004 Ukrainian presidential election, which he won after the Orange Revolution forced a re-run of the second round of voting after allegations of electoral fraud. Tymoshenko was appointed prime minister by Yushchenko and led an \"orange\" government of Our Ukraine, the Yulia Tymoshenko Bloc, and the Socialist Party. However, renewed conflict between the pragmatist and ideological wings of the movement meant Tymoshenko was dismissed as prime minister in September 2005, and the Yulia Tymoshenko Bloc entered into opposition. Yuriy Yekhanurov was appointed as her replacement with the support of the Party of Regions, a party formerly aligned with Kuchma during his presidency.\nIn the 2006 Ukrainian parliamentary election, the Yulia Tymoshenko Bloc became the largest National Democratic political force with 107 seats, followed by Our Ukraine with 81 seats. Negotiations for the reformation of the \"orange coalition\" fell apart owing to conflict between the three parties. Instead, a unity government was formed between the Party of Regions, Socialists, Communists, and Our Ukraine with the signing of the Universal of National Unity, and Viktor Yanukovych was appointed prime minister. Escalating tensions between Yanukovych and Yushchenko in 2007 resulted in a political crisis and snap election, where the Yulia Tymoshenko Bloc won 156 seats to Our Ukraine's 72 seats. In its aftermath, the two wings of the National Democratic movement came together to form a new government with Tymoshenko as prime minister. However, the Tymoshenko government was consistently undermined by the presidential administration during its time in power; the presidential veto was used to stop over a hundred government resolutions, five times more than Kuchma had done during his ten years as president. In 2008, the presidential administration released a dossier reportedly documenting Tymoshenko's \"treason\", and both Yushchenko and Yekhanurov would testify in future criminal trials against Tymoshenko, eventually leading to her conviction in 2011, when she was sentenced seven years in prison.\nYushchenko's popularity declined to the single digits by the time of the 2010 Ukrainian presidential election, in which he received 5.5% of the vote. In the second round of voting, he urged voters not to vote for Tymoshenko or Yanukovych. Tymoshenko lost to Yanukovych in the second round of voting, garnering 46.03% to his 49.55%.\nIn the 2014 snap presidential elections. Petro Poroshenko presented himself as a political descendant of the National Democratic movement of the 1990s and 2000s was elected president. He lost his bid for re-election in the 2019 Ukrainian presidential election.\nNational Democratic parties and alliances\n* Batkivshchyna\n* European Solidarity\n* People's Movement of Ukraine\n* Democratic Party of Ukraine\n* Our Ukraine\n* Our Ukraine–People's Self-Defense Bloc\n* Yulia Tymoshenko Bloc\nReferences"
    }
  ]
}