{
  "content": [
    {
      "type": "text",
      "text": "# National Socialist Working Association\n\nThe National Socialist Working Association, sometimes translated as the National Socialist Working Community (German: Nationalsozialistische Arbeitsgemeinschaft) was a short-lived group of about a dozen Nazi Party Gauleiter brought together under the leadership of Gregor Strasser in September 1925. Its full name was the Arbeitsgemeinschaft der nord- und westdeutschen Gaue der NSDAP (Working Association of the North and West German Gaue of the NSDAP). Aligned with the Strasserist wing of the Party, it unsuccessfully sought to steer the Party leadership in that direction by updating the Party program of 1920. Party Chairman Adolf Hitler perceived the Association as a threat to his leadership, so its activities were curtailed shortly after the Bamberg Conference of 14 February 1926 presided over by him, and it was formally dissolved on 1 October of that year.\nBackground\nAfter the failed Beer Hall Putsch of November 1923, the Nazi Party was outlawed and Adolf Hitler, being found guilty of treason, was jailed in Landsberg prison. After his release in December 1924, Hitler re-founded the Party on 27 February 1925 in Munich. At that time, it largely was centered in the state of Bavaria in southern Germany. Hitler realized that if his movement were to become the national force that he envisioned, it would have to expand into the rest of the country, in particular, into both Prussia and Berlin, the national capital. Banned from public speaking in most of Germany, on 11 March 1925 Hitler charged Gregor Strasser, then the Gauleiter of Niederbayern (Lower Bavaria), with setting up Party organizations throughout northern Germany. As a Reichstag Deputy, Strasser possessed two advantages: first, he had a parliamentary rail pass and could travel throughout the country while incurring no cost to the Party and, secondly, he enjoyed parliamentary immunity and could not be banned from speaking or sued for slander during his speechmaking. An effective public speaker and a skilled organizer, he traveled widely throughout Germany delivering speeches and establishing local Party organizations. He often personally selected the local (Ortsgruppenleiter) and regional (Gauleiter) Party administrators, subject to Hitler’s approval. The rapid development of the party structure in northern Germany in the following months was mainly the work of Strasser. Many of the local organizations in the north had to be created from scratch, and by the end of 1925 they numbered 262, as opposed to only 71 at the time of the 1923 putsch.\nFormation\nThe Working Association was Strasser's attempt to consolidate the then still young and divergent Party organizations in northern and western Germany. The Gauleiter in these regions were more interested in appealing to the working class masses in the large industrial cities of northern Germany through a greater emphasis on social aims, than were the members of the Party leadership based in the more rural area of Bavaria. Consequently, their ideological approach was more attuned to the \"socialist\" or \"anti-capitalist\" element of National Socialism.\nIn addition, there were longstanding personal animosities between the northerners and many of the leaders of the Party in Bavaria. These dated from the time of the Party's dissolution when the two groups belonged to different Nazi front organizations. Strasser and northerners who had been in the National Socialist Freedom Movement had an intense hostility towards some Party leaders at the Munich headquarters who had belonged to the rival Greater German People's Community, in particular, Hermann Esser, Julius Streicher and Philipp Bouhler. The Working Association organizers sought to curb what they perceived as the growing power and influence of these Munich leaders whom they felt to be too bureaucratic and controlling.\nDiscussions about forming a consortium of sorts, at first referred to as a \"Westblock,\" to counterbalance the Munich leadership began in Elberfeld on 20 August 1925 between Strasser, Joseph Goebbels, then the Business Manager (Geschäftsführer) of Gau Rhineland-North, and other northern Party leaders. Strasser then took the initiative to call a meeting at Hagen in Westphalia for 10 September 1925. Though Strasser himself was absent due to his mother's serious illness, the meeting took place as scheduled with around 25 northern leaders present. The attendees formally established the \"Working Association of the North and West German Gaue of the NSDAP.\"  Strasser was elected Director of the Working Association and Goebbels became the Business Manager. Elberfeld, the seat of Gau Rhineland-North, served as the organization's headquarters. A journalistic organ named the National Socialist Letters (Nationalsozialistischen Briefe, or NS-Briefe) was established, which appeared twice a month from 1 October 1925, and was published by Strasser and edited by Goebbels. Organizational statutes were adopted which were careful to state that the Working Association existed \"with the express approval of Adolf Hitler.\"\nMost of the actions taken at this first meeting were purely organizational in nature, such as arranging for the sharing of political and organizational resources, including propaganda materials and speakers, and working on coordinated joint political statements. The only policy decision taken was related to the question of electoral participation, and the representatives at Hagen unanimously agreed to reject participation in all elections, sending a letter to this effect to Hitler. This was aimed at pushing the Party toward obtaining power not by parliamentary means, but by mobilizing the urban masses into paralyzing the nation's economic and social systems through strikes, street terror and other activist tactics.\nMembers\nThe Working Association was composed of eleven Gaue, nearly all representing sections of Prussia (with the exception of the Free City of Hamburg).\n{| class=\"wikitable float-right\"\n|-\n! colspan=\"2\"| Working Association of the North and West German Gaue of the NSDAP\n|-\n! Gau\n! Gauleiter\n|-\n| Groß-Berlin (later, Berlin)\n| Ernst Schlange\n|-\n| Hamburg\n| Josef Klant\n|-\n| Hanover (later, Southern Hanover-Brunswick)\n| Bernhard Rust\n|-\n| Hanover-South (later, Southern Hanover-Brunswick)\n| Ludolf Haase\n|-\n| Hesse-Nassau\n| Walter Schultz\n|-\n| Lüneburg-Stade (later, Gau Eastern Hanover\n| Otto Telschow\n|-\n| Pomerania\n| Theodor Vahlen\n|-\n| Rhineland-North (later, Düsseldorf; Essen)\n| Karl Kaufmann\n|-\n| Rhineland-South (later, Köln-Aachen; Moselland)\n| Robert Ley\n|-\n| Schleswig-Holstein\n| Hinrich Lohse\n|-\n| Westphalia (later, Westphalia-North; Westphalia-South)\n| Franz Pfeffer von Salomon\n|}\nOther prominent Nazis who were part of the Working Association included Helmuth Brückner, Friedrich Hildebrandt, Heinrich Haake, Hanns Kerrl, Erich Koch, and Wilhelm Stich.\nAims and actions\nPolicy proposals\nFollowing the Hagen meeting, the Working Association advocated consolidation of the Gaue in the Rhineland and Ruhr areas into one large Gau encompassing all of Germany's industrial heartland. In October, it issued a call for the dismissal of Esser, then the Party's Propaganda Leader.\nThe Working Association also urged support for a proposed referendum on the expropriation without compensation of the former royal and princely ruling houses of Germany. This was the same position taken by the two leading left-wing parties, the German Communist Party and the Social Democratic Party of Germany. This stance angered Hitler who feared that it would imperil the substantial financial support that he was deriving from many of the former nobles and from conservative business donors who favored his opposition to Communists, Socialists and trade unionists.\nIn foreign policy, many Working Association members, including Strasser, Goebbels, Kaufmann and Rust held National Bolshevik ideas then common to many young right-wing German intellectuals. They saw in the Soviet Union a successful socialist national state and some, including Rust, even advocated an alliance between Germany and the Soviet Union. They also admired the activism of the German Communist Party in attracting and mobilizing working class support. Of course, these views were incompatible with the anti-Communist and Lebensraum policies advocated by Hitler in Mein Kampf.\nThe National Socialist Program consisting of 25 points had been proclaimed by Hitler in February 1920. Strasser felt that it was due for an update and began working on revisions to it in November 1925. His draft program called for the nationalization of all land, which would then be leased out. All estates over 1,000 acres would be broken into smaller peasant holdings. Fifty-one percent of \"vital\" and forty-nine percent of \"non-vital\" industrial production would be publicly owned but management would remain in private hands. Politically, it called for strengthening the office of the Reich President while the Reichstag would be replaced by a corporatist \"Chamber of Estates,\" representing occupational sectors and public institutions such as churches and universities. Germany's federal structure would be abolished and the President, elected to a seven-year term by the legislature, would appoint national and provincial executives and administrators. While proposing new ideas in the areas of the economy and government structure, it retained many of the nationalist, völkisch and anti-semitic underpinnings of the original program. It called for the restoration of Germany's 1914 borders and the return of its former colonies. In addition, it advocated the expulsion of those Jews who had entered Germany since 1 August 1914 and the revocation of citizenship from all others.\nSubsequent meetings\nThe second meeting of the Working Association took place in Hanover on 22 November 1925, where Strasser presented his draft document for consideration. The meeting did not result in the uniformly favorable response to the proposals that Strasser had hoped for, however. The Gauleiter, all being equals, jealously guarded their right to independent action, and there were genuine differences of opinion among them with regard to ideological issues. The members recommended that additional comments be submitted in writing and the draft would be reviewed at the next meeting in late January. Critiques which survive show that some attacked it as too radical from a socialist viewpoint and not radical enough in its völkisch aspects.\nStrasser's failure to keep Hitler informed of developments was a tactical error, for the Munich leadership was becoming increasingly suspicious of the activities of the Working Association. Around Christmas, Gottfried Feder, a leading Party theoretician and a co-author of the 1920 Party program was given a copy of the draft program by a local Party official and he subsequently informed Hitler. When Strasser learned of this, he belatedly sent Hitler a copy on 8 January 1926 with the explanation that he was merely gathering views from colleagues for a possible revision.\nThe third meeting of the Working Association took place on 24 January 1926 at the Hanover home of Gauleiter Rust. It became contentious when Feder arrived as Hitler's representative. Goebbels demanded that he be ejected, shouting: \"We don't want any stool pigeons!\" However, a vote was taken and Feder was allowed to participate. On the issue of expropriation, the proposal was weakened to say only that, if the expropriation of the nobles were to pass, then the property of all Jews who had entered Germany since August 1914 should likewise be confiscated. The draft program was again vigorously debated and there was even less agreement than previously, with not only Feder but Haase, Ley and Pfeffer voicing concerns on various points. In the end, the Strasser draft was not approved and further work on a new proposal was delegated to a small group.\nThe Bamberg Conference\nThough not intended as a direct threat to Hitler's leadership, the circulation and discussion of a revised Party program would clearly set the precedent that regional leaders could participate in the formulation of major Party policy. Hitler felt this would embroil the Party in endless doctrinal disputes that would detract from the main goal of attaining power. Rather than the party line being defined by him as Führer, he instead would be bound by a program subject to interpretation and change by the Party membership. The issue at stake was whether the Party was to be guided by the Führerprinzip or whether authority was to be ultimately decided by the membership. Hitler perceived that if allowed to become an effective policy-setting organization, the Working Association might be able to mount a challenge to his supreme authority. In addition, Strasser's draft program also exposed the internal policy rifts in the Party. Hitler's response was swift, direct and forceful.\nHitler first met with Strasser in early February and secured his promise that the draft program would be withdrawn. He then called for a meeting of the Party leadership to be held in Bamberg in Upper Franconia on Sunday, 14 February 1925. Some sixty officials were invited, but the northern representatives were outnumbered by the southern attendees. Many of the prominent Working Association members did not attend: Kaufmann was not invited (ostensibly because Munich did not know he was a Gauleiter), Pfeffer chose to absent himself, Haase did not attend due to illness and his Deputy Gauleiter, Hermann Fobke, also elected not to attend.\nThere was no agenda and no debate. Hitler spoke for two hours and forcefully opposed the positions advocated by the Working Association. He denied that any change in the Party program was needed, and that to tamper with it would dishonor the memory of those \"martyrs\" who had fallen in the 1923 putsch. In particular, he denounced the position favoring expropriation of the royal and princely houses, famously declaring: \"For us there are today no princes, only Germans.\" He also firmly ruled out any thought of alliance with Soviet Russia and reaffirmed his view that the future of Germany depended on obtaining additional Lebensraum in the east. Stunned by the forcefulness of Hitler's oration, Strasser spoke briefly and offered no defense or rebuttal. He was made to promise to retrieve all copies of the draft program that had been distributed, and he subsequently wrote to his membership on 5 March requesting that all copies be returned. Hitler had reasserted his authority as supreme Party leader and stamped out any potential threat from the Working Association, which was left an empty shell that soon faded into irrelevance.\nGoebbels did not speak at all. He confided in his diary:\nShort discussion. Strasser speaks. Hesitant, trembling, clumsy ... I cannot say a word! I am stunned! ... My heart aches! ... I want to cry! ... A horrible night! Probably one of my greatest disappointments. I can no longer wholly believe in Hitler. This is terrible. I have lost my inner support. I am only half myself.\nAftermath and dissolution\nPersonnel shifts\nHitler, however, was shrewd enough to appear generous in his victory, and moved to co-opt any further latent opposition. In order to divide the dissidents, he sought to tie them more closely to his Munich leadership. In April 1926, Hitler removed Esser as Propaganda Leader and Strasser was named Chairman for Organization and Propaganda, being formally created Party Reichspropagandaleiter on 16 September.\nIn addition, Hitler approved the proposed merger of Gau Rhineland-North and Gau Westphalia into Großgau Ruhr, which took place on 7 March 1926. The new entity was entrusted to a tripartite leadership of Goebbels, Kaufmann and Pfeffer. After a few months of this unwieldy arrangement, Kaufmann was made sole Gauleiter on 20 June, while Pfeffer was given responsibility for the Sturmabteilung (SA) in July, taking over as Supreme SA Leader on 1 November and serving until August 1930 when he resigned in a dispute with Hitler. Recognizing Goebbels' talents, Hitler began a campaign of lavishing attention on him. In the months following the Bamberg Conference, Hitler met with him several times and invited him to speak at important Party meetings, praising his performances and appearing jointly with him. He put his personal Mercedes at his disposal and even presented him with a bouquet of red roses on one occasion. At the end of August, Goebbels was offered the prestigious post of Gauleiter of the now expanded Gau Berlin-Brandenburg, which he accepted in late October 1926. The \"charm offensive\" worked, and Goebbels would remain one of Hitler's most loyal lieutenants until the end of the regime.\nReinforcing centralized control\nIn addition to essentially decapitating the Working Association, Hitler set about tightening and centralizing his control over the Gaue. On 16 April 1926, a memorandum was issued to all Gauleiter insisting on pre-approval by Munich of all pamphlets issued by local Party organizations. Next, on 22 May 1926, Hitler convened a national membership meeting in Munich to consolidate his organizational hold over the Party. The meeting approved sweeping changes to the Party bylaws. These confirmed Hitler's leadership of the Party and declared the 25 points of the program of 1920 to be \"immutable.\" Hitler, reelected as Chairman of the Party, was made superior to the executive committee and answerable only to the general meeting. He was given final discretion over the expulsion of Party members, and even local branches. To maintain Party discipline, he instituted the Uschla, an internal Investigation and Settlement Committee, whose chairman was named by him, along with the chairmen of other major Party committees. On 1 July 1926, new directives for Gaue and local branches were issued by Hitler which stated that \"since the NSDAP represents a large study group, smaller study groups in the form of combinations of individual Gaue have no justification.\"\nNext, a Party Congress was held in Weimar on 3-4 July 1926, its first since the putsch, where Führerprinzip was on full display. Hitler discouraged initiative from the membership and reserved to himself all final decisions on resolutions and proposals. He was adamant that no issues associated with the Working Association be advanced, rejecting outright a proposal to favor blue-collar workers for positions as Gauleiter, whenever possible. All final programmatic, administrative and organizational decision-making power resided solely in the person of Hitler. The Weimar Congress reinforced the Party's image as a unified and disciplined political organization.\nThe formal dissolution of the Working Association was announced by Strasser in the NS-Briefe of 1 October 1926. Finally, on 26 April 1927, the Völkischer Beobachter, the Party newspaper, declared that the NS-Briefe was not an official publication of the Nazi Party. Hitler would never again face a threat to his supreme leadership of the Party from the membership.\nFate of individual members\nSeveral members of the Working Association, including Haase, Klant, Schlange, Schultz and Vahlen, were removed from their Gauleiter positions within about a year of the organization's dissolution. Yet several other members, such as Hildebrandt, Kaufmann, Kerrl, Koch, Ley, Lohse, Rust and Telschow went on to have long careers in the Party and the government of Nazi Germany until the fall of the regime in May 1945. Most successful of all was Goebbels, who became Party Reichspropagandaleiter in April 1930 and Reichsminister of Propaganda in March 1933, following the Nazi seizure of power. He would retain these posts, as well as that of Gauleiter of Berlin, until his suicide on 1 May 1945, and even was named by Hitler in his final political Testament as his successor as Reich Chancellor. As for Strasser, after serving as Party Reichspropagandaleiter, he became the Party Reichsorganisationsleiter in January 1930, responsible for all Party organization and personnel matters. After Hitler, he was widely considered to be the most powerful and influential member of the Party hierarchy during those years. However, he had a falling out with Hitler over policy and tactical differences, which led to his resignation in December 1932; thereafter, he played no important role in the Party. Hitler had him murdered by the SS in Gestapo headquarters in Berlin during the Night of the Long Knives on 30 June 1934.\nSee also\n* Bamberg Conference\n* Expropriation of the Princes in the Weimar Republic\nReferences\nSources\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\nExternal links\n* [https://arplan.org/2019/01/17/strasser-program/ The Strasser Draft Program]"
    }
  ]
}