{
  "content": [
    {
      "type": "text",
      "text": "# National Library of the Kingdom of Morocco\n\nⵜⴰⵙⴷⵍⵉⵙⵜ ⵜⴰⵏⴰⵎⵓⵔⵜ ⵏ ⵜⴳⵍⴷⵉⵜ ⵜⴰⵎⵔⵔⵓⴽⵉⵜ\n| native_name_lang  = fr\n| name              = National Library of the Kingdom of Morocco\n| logo              = Bibliothèque nationale du Royaume du Maroc Logo.png\n| logo_size         =\n| logo_alt          =\n| image             = Bibliothèque Nationale du Royaume du Maroc.jpg\n| image_size        =\n| alt               =\n| caption           =\n| country           = Morocco\n| scope             =\n| established       = 1924\n| ref_legal_mandate = Dahir (King's decree), 1926, established the library as a public institution; dahir, 11 November 2003, changed the name to the National Library of the Kingdom of Morocco\n| location          = Rabat\n| coordinates       =\n| num_branches      = 1 (Tétouan)\n| director          = Mohamed El Ferrane\n}}\nThe National Library of the Kingdom of Morocco (; ; , previously  and ) is located in Rabat, Morocco, with a branch in Tetouan. The former Bibliothèque Générale (General Library) was created in 1924. In 2003, it was renamed the \"Bibliothèque nationale du Royaume du Maroc.\"\nHistory\nThe first national library of Morocco was founded in 1924 by the French Protectorate in Morocco. After a dahir (royal decrée) in 1926, it became a public establishment. Tétouan native Muhammad Abu Khubza authored a library catalog for the branch in that city in 1984.\nThe present building in Rabat-Agdal was designed by architects Rachid Andaloussi and Abdelouahed Mountassir of Casablanca and inaugurated by King Mohammed VI on 15 October 2008. Inspired by the square minarets of traditional Moroccan architecture, the building houses a main building with an adjacent tower, topped with a glass roof and decorated with modern Arabic calligraphy. There are also a spacious courtyard and other outdoor spaces for cultural performances and events.\nSee also\n* Archives du Maroc, in Rabat\n* List of national libraries\nReferences\nBibliography\n*  . (Includes discussion of items held in the library)\n*\n* |number=5184|year=2004|pages=150–152|issn=0851-1217|url=http://www.sgg.gov.ma/Portals/0/Bo/bulletin/Fr/2004/BO_5184_Fr.pdf|language=fr|access-date=2017-08-14|archive-url=https://web.archive.org/web/20140202182706/http://www.sgg.gov.ma/Portals/0/Bo/bulletin/Fr/2004/BO_5184_Fr.pdf|archive-date=2014-02-02|url-status=dead}}\n*\n*  (Includes information about the national library)\nExternal links\n* [http://bnrm.ma/bnrm/ Official site] of Bibliothèque Nationale du Royaume du Maroc\n* VIAF. Bibliothèque générale et archives du Maroc"
    }
  ]
}