{
  "content": [
    {
      "type": "text",
      "text": "# National Assembly of the Republic of Vietnam\n\n國會越南共和\n| native_name_lang   =\n| transcription_name =\n| legislature        =\n| coa_pic            = Coat of arms of the Republic of Vietnam (1967–1975).svg\n| coa_caption        = Coat of arms of the Republic of Vietnam (1967–1975)\n| foundation         = 26 October 1956\n| house_type         =\n| body               =\n| houses             =\n| leader1_type       =  1st President of the National Assembly (1957–1959)\n| leader1            = Trần Văn Lắm\n| party1             = Cần Lao\n| election1          =\n| leader2_type       = 2nd President of the National Assembly (1959–1963)\n| leader2            = Trương Vĩnh Lễ\n| party2             = Cần Lao\n| election2          =\n| leader3_type       = 1st President of the Senate (1967–1973)\n| leader3            = Nguyễn Văn Huyền\n| party3             = Independent\n| election3          =\n| leader4_type       = 2nd President of the Senate (1973–1975)\n| leader4            = Trần Văn Lắm\n| party4             = NSDF\n| election4          =\n| leader5_type       = 1st Speaker of the House of Representatives (1967–1971)\n| leader5            = Nguyễn Bá Lương\n| party5             = NSDF\n| election5          =\n| leader6_type       = 2nd Speaker of the House of Representatives (1971–1975)\n| leader6            = Nguyễn Bá Cẩn\n| party6             = NSDF\n| election6          =\n| leader7_type       = 3rd Speaker of the House of Representatives (1975)\n| leader7            = Phạm Văn Út\n| party7             = NSDF\n| election7          =\n| disbanded          = 30 April 1975\n| succeeded_by       = National Assembly (Vietnam)\n| members            =\n| house1             =\n| house2             =\n| structure1         =Upper house of the Republic of Vietnam (1974).svg\n| structure1_res     =220px\n| structure1_alt     =The number of seats, and political alliances of the Republic of Vietnam in 1974\n| structure2         =Lower house of the Republic of Vietnam (1971-1975).svg\n| structure2_res     =220px\n| structure2_alt     =The number of seats, and the political alliance block of the House of Representatives of the Republic of Vietnam from 1971 to 1975\n| political_groups1  =Senate (1974)\n*  Democratic (22)}}\n*  United (17)}}\n*  Bong Hue (8)}}\n*  Hoa Sen (7)}}\n*  Unaffiliated (6)}}\n| political_groups2  =House of Representative (1971–1975)\n*  Republicans (50)}}\n*  Independence (39)}}\n*  Ethnic and Social (27)}}\n*  National (9)}}\n*  Civil Rights (16)}}\n*  Unaffiliated (18)}}\n| committees1        = Senate: 11\n| committees2        = House of Representative: 18\n| joint_committees   =\n| voting_system1     =\n| voting_system2     =\n| last_election1     =\n| last_election2     =\n| previous_election1 =\n| previous_election2 =\n| session_room       = National Assembly, Saigon 1967.jpg\n| session_room2      = Diên-Hồng Palace, Saigon.jpg\n| session_res        = 250px\n| session_alt        =\n| meeting_place      = Saigon Opera House, Saigon\n| meeting_place2     = Diên Hồng Hall, Saigon\n| website            =\n| footnotes          =\n| motto              = Fatherland – People\n|background_color=yellow|preceded_by=National Assembly of the First Republic of Vietnam (1956–1963)}}\nThe National Assembly of the Republic of Vietnam (; Chữ Hán: 國會越南共和) was the national legislature of the Republic of Vietnam, south of the 17th parallel of Vietnam.\nHistory\nVietnam was divided in 1954. The National Assembly of the Republic of Vietnam had two distinct periods under the two Republics 1955–1963 and 1967–1975. Between the two Republics was a period of military administration under the command of generals, mainly the Revolutionary Military Council, the Armed Forces Council, and the National Leadership Committee. During that period Congress was inactive.\nFirst Republic (1955–1963)\nAfter a Constitutional Assembly election in March 1956, the National Assembly of the Republic of Vietnam and the Republic of Vietnam Constitution were created on October 26. It according to the 1956 Constitution had 123 delegates, operating in a single chamber. It replaced the National Advisory Council of the State of Vietnam (1949–55), the predecessor state of the Republic of Vietnam. Before that, the State of Vietnam did not have time to implement its plans for parliamentary elections and promulgation of a constitution, but it held municipal elections in January 1953. The 1956 Constitution would be disabled after a successful military coup in 1963 and replaced by the 1967 one, forming the Second Republic.\nMilitary Rule (1963–1967)\nFrom 1963 until 1967, the Republic of Vietnam did not have a parliament. The generals who came to power had established some mechanism to recruit civilian contributions, but there was no general election at the national level.\nSecond Republic (1967–1975)\nThe first National Assembly after the end of the First Republic was the Constituent Assembly, which convened to draft a new constitution for the civil polity, absorbing administrative power from the generals. A total of 532 candidates ran for 117 seats in the September 11, 1966 election. A total of 4,274,872 turned out to vote, representing 80.8% of the registered electorate. About six months later, the basic law was finalized to issue a proclamation on March 18, 1967, the 1967 Constitution. On April 1, 1967, a new Constitution was promulgated.\n1967 Elections\nThe 1967 elections elected the regular parliament and the 1966 constitutional assembly was dissolved. Then the National Assembly of the Second Republic of Vietnam operated within the framework of Chapter III of that constitution. Unlike the First Republic, this National Assembly is divided into two houses: the Senate and the House of Representatives.\nSenate\nThe Senate had 60 members, called \"senators\", who were elected by the people in a partnership for six-year terms. The electoral system was a variant of party block voting; the six lists of candidates with the most votes each obtained 10 seats. Unlike a member of the House of Representatives, which depends on a locality, the senators represented the whole country. The headquarters of the Senate was Dien Hong Hall. This building in 2000 was used as the Ho Chi Minh City Stock Exchange.\nThe last Senate session before the fall of South Vietnam consisted of two groups. One group belonged to the elected term in 1970. The other half belonged to the term elected to 1973, that is, every three years, 30 of the 60 seats in the Senate were contested. The Senate had 11 standing committees.\nAs of 1974 the Senate had five blocks:\n#Democratic Bloc, 22 MPs, pro-government\n#United Bloc, 17 MPs\n#Bong Hue Bloc, 8 MPs, opposition\n#Hoa Sen Bloc, 7 MPs, opposition\n#Unaffiliated, 6 MPs\nHouse of Representatives\nThe first House of Representatives (1967–1971) had 137 delegates, called \"deputies\" who were directly elected by the people based on each locality. By the 2nd term (1971–1975), it was increased to 159 deputies. As of 1974, there was one congressman for every 50,000 voters. The term of parliament was four years. MPs were allocated to work on 18 standing committees. The headquarters of the House of Representatives was the House of the National Assembly in Lam Son Square, after 1975 it was turned into the Ho Chi Minh City Theater.\nThe last House of Representatives before the fall of the Republic of Vietnam, was elected in August 1971, the 2nd term. The next election was supposed to take place in 1975, however the Republic of Vietnam was overthrown by communist North Vietnamese forces in April that year.\nIn the 1970s the House of Representatives had six blocks:\n#Republican Bloc, 50 congressmen, pro-government\n#Independence Bloc, 39 MPs\n#Ethnic and Social Bloc, 27 MPs, opposition\n#National Bloc, 9 MPs\n#Civil Rights Bloc, 16 MPs\n#Unaffiliated, 18 MPs\nGallery\nFile:Insignia of the National Assembly of the Republic of Vietnam (Quốc hội Việt Nam Cộng hòa) in 1963.jpg|Coat of Arms of the National Assembly during the First Republic (1955-1963)\nFile:Emblem of the National Assembly of the Republic of Vietnam.png|Coat of Arms of the National Assembly during the Second Republic (1965-1975)\nFile:Emblem of the Upper House of the Republic of Vietnam (Thượng-Nghị-Viện Việt-Nam Cộng-Hòa).jpg|Coat of Arms of the Senate (1967-1975)\nFile:Seal of the Cabinet of the Upper House of the Republic of Vietnam.svg|Official Seal of the Senate (1967-1975)\nFile:Emblem of the Lower House of the Republic of Vietnam (Hạ-Nghị-Viện Việt-Nam Cộng-Hòa).jpg|Coat of Arms of the House of Representatives (1967-1975)\nFile:South Vietnamese President Nguyễn Văn Thiệu taking oath of office, 67-0480-A.jpg|President Nguyễn Văn Thiệu assuming the office of the presidency on 31 October 1967 in front of Saigon Opera House, where the House of Representatives meet.\nNotable members\n*Hà Thúc Ký\n*Huỳnh Văn Cao\n*Kiều Mộng Thu\n*Nguyễn Bá Cẩn\n*Nguyễn Bá Lương\n*Nguyễn Hữu Có\n*Nguyễn Văn Huyền\n*Phạm Văn Út\n*Phan Khắc Sửu\n*Phan Quang Đán\n*Tôn Thất Đính\n*Trần Chánh Thành\n*Trần Lệ Xuân\n*Trần Ngọc Châu\n*Trần Thị Hoa\n*Trần Văn Đôn\n*Trần Văn Lắm\n*Trần Văn Tuyên\n*Trương Vĩnh Lễ\n*Vũ Văn Mẫu\nReferences"
    }
  ]
}