{
  "content": [
    {
      "type": "text",
      "text": "# National Cultural Heritage Administration\n\n| headquarters    = Beijing\n| coordinates     =\n| employees       =\n| budget          =\n| chief1_name     = Shan Jixiang\n| chief1_position = Director\n| chief2_name     =\n| chief2_position =\n| parent_agency   = Ministry of Culture and Tourism\n| child1_agency   =\n| child2_agency   =\n| website         =\n| footnotes       =\n| embed           =\n|t =\n|p = Guójiā Wénwù Jú\n|w =\n}}\n}}\nThe National Cultural Heritage Administration (NCHA; ) is a national bureau managed by the Ministry of Culture and Tourism of China. It is responsible for the national protection of cultural relics and the regulation of museums.\nHistory\nAfter the Chinese Civil War, the State Bureau of Cultural Relics was established to protect relics and archaeological sites as well as help develop museums (though the agency languished during the political turmoil of the Cultural Revolution). Its cause was revitalized with the establishment of the State Cultural Relics Enterprises Management Bureau in 1973 to oversee the protection of cultural heritage and the State Bureau of Cultural Relics (SBCR) in 1988, under the jurisdiction of the Ministry of Culture, as the encompassing agency for conservation of Chinese culture and heritage.\nThe agency is responsible for over 500,000 registered sites of immovable cultural relics on mainland China. This includes 2,352 sites under national protection, 9,396 sites under the protection of provincial governments, and 58,300 sites under the protection of county or municipal authorities. In addition, 103 cities are designated as a \"Historically and Culturally Famous City.\"\nThere are approximately one million ancient Chinese relics on display in more than 200 overseas museums.  The agency is pursuing the repatriation of these items via political, diplomatic, and international conventions.  The Chinese government asserts that not only were these items taken immorally but illegally as well.  A UNESCO document in 1995 states that cultural relics taken during wartime should be returned to their original countries.  Egypt has supported China's efforts to repatriate its historical artifacts since they share a similar history.\nPursuits\nIn 2001, the National Gallery of Canada returned an arhat sculpture that was dated about 1300 years ago.  This was the first time a museum voluntarily returned an item to the state agency.\nA guardian statue that had been looted from a Chinese tomb in 1994 was seized by U.S. customs agents.  The U.S. Attorney for the Southern District of New York (Mary Jo White) filed a civil forfeiture suit under the Convention on Cultural Property Implementation Act, which led to the statue's seizure.  It was returned in May 2001.\nIn 2001, the Miho Museum in Kyoto, Japan, returned a rare Buddhist statue that was stolen from a public garden in the Shandong province.\nA rare bronze horse was purchased for 8.9 million US by Macau billionaire Stanley Ho who donated it to China.\nIn 2009, an auction in France took place despite protests from the Chinese Government. Two bronze sculptures that were looted from the Old Summer Palace during the Second Opium War were being auctioned.  The purchaser, François Pinault, bought them and donated them back to China in 2013.\nAn imperial Chinese gilt metal box appeared at an auction in Salisbury in 2011. It was sold for £400,000. In that same year, another relic (a yellow jade pendant carved as a dragon) sold for £478,000 at another auction in Dorchester.\nIn April 2018, the Tiger Ying (a bronze water vessel) sold at an auction in the United Kingdom. The National Cultural Heritage Administration condemned the auction arguing it was illegally looted from China and demanded its return.  The auctioneers did not comment on Chinese requests and the auction went ahead.  However, after some private negotiations, the Tiger Ying was returned and became part of the National Museum of China's collection in November of that year.\nThe FBI Art Crime Team returned 361 cultural artifacts to China on February 28, 2019.\nA court in Milan Italy ruled 796 artifacts to be returned to China. They arrived in Beijing on April 10, 2019.  Some of these relics include porcelain items from the Song and Ming dynasties.\nList of directors\n{| class=\"wikitable\"\n|-\n! English title !! Chinese title !! Term start\n!Term end!! Notes\n|-\n|  Zheng Zhenduo ||  ||  December 1949\n|October 1958||\n|-\n|  Wang Yeqiu ||  || October 1958\n|May 1970||\n|-\n|  Wang Yeqiu ||  || October 1973\n|November 1979||\n|-\n|  Ren Zibin ||  || January 1980\n|May 1982||\n|-\n| Sun Yiqing  ||  ||  May 1982\n|March 1984||\n|-\n| Lü Jimin  ||  ||  March 1984\n|April 1988||\n|-\n| Zhang Deqin  ||  ||  April 1988\n|September 1996||\n|-\n| Zhang Wenbin ||  || September 1996\n|August 2002||\n|-\n|  Shan Jixiang ||  ||  August 2002\n|February 2012||\n|-\n| Li Xiaojie  ||  || February 2012\n|October 2015||\n|-\n|  Liu Yuzhu ||  || October 2015\n|March 2021||\n|-\n|Li Qun\n|\n|March 2021\n|Incumbent\n|\n|}\nSee also\n*2009 Auction of Old Summer Palace bronze heads\n*Repatriation (cultural heritage)#International conventions\nReferences\nExternal links\n*"
    }
  ]
}