{
  "content": [
    {
      "type": "text",
      "text": "# National Register of Historic Monuments in Romania\n\nThe National Register of Historic Monuments () is the official English name of the Romania government's list of national heritage sites known as Monumente istorice. In Romania, these include sites, buildings, structures, and objects considered worthy of preservation due to the importance of their Romanian cultural heritage. The list, created in 2004, contains places that have been designated by the Ministry of Culture and National Patrimony of Romania and are maintained by the Romanian National Institute of Historical Monuments, as being of national historic significance.\nCriteria\nA Monument istoric (\"Historic monument\") is defined as:\n* An architectural or sculptural work, or archaeological site.\n* Having significant cultural heritage value, and of immovable scale.\n* Perpetuating the memory of an event, place, or historical personality.\nMonumente istorice cultural properties include listed Romanian historical monuments from the National Register of Historic Monuments in Romania. They may also include places that are not specifically listed in whole, but which contain listed entities, such as memorial statues and fountains in parks and cemeteries.\nHistorical monuments in Romania per county\nAs of 2015, there are 30,148 designated monumente istorice (historical monuments) entries listed individually in Romania. This number increased from the previous 29,540 listings in 2010.\nOf these, 2,651 are in Bucharest; 1,791 in Cluj County; 1,634 in Iași County; 1,237 in Dâmbovița County; 1,073 in Prahova County; 1,053 in Sibiu County; 1,022 in Argeș County; 1,018 in Mureș County; 986 in Brașov County; 869 in Buzău County; 832 in Caraș-Severin County; 791 in Vâlcea County; 768 in Bistrița-Năsăud County; 758 in Olt County; 742 in Harghita County; 730 in Ilfov County; 700 in Dolj County; 694 in Constanța County; 686 in Alba County; 610 in Maramureș County; 594 in Covasna County; 574 in Tulcea County; 570 in Mehedinți County; 546 in Sălaj County; 540 in Giurgiu County; 537 in Neamț County; 518 in Hunedoara County; 518 in Suceava County; 510 in Botoșani County; 503 in Gorj County; 455 in Bihor County; 438 in Vaslui County; 427 in Vrancea County; 417 in Arad County; 393 in Teleorman County; 366 in Bacău County; 340 in Timiș County; 310 in Satu Mare County; 285 in Călărași County; 263 in Galați County; 227 in Ialomița County; and 172 in Brăila County.\nLMI Code\nThe LMI code (List of the Historical Monuments code) identifies uniquely an historical monument or archaeological site, and includes, in this order:\n* Romanian county code, using ISO 3166-2:RO\n* A Roman numeral indicating the type of monument:\n** I: archaeological\n** II: architectural\n** III: public monuments (e.g. statues)\n** IV: memorials and gravestones\n* A lowercase letter: m for an individual monument, a for an ensemble and s for an archaeological site\n* A capital letter: A for monuments of national interest, B for local interest\n* A five-digit serial number. If the site is part of an ensemble, this is indicated by a decimal point followed by 01, 02, and so forth.\nFor example, IS-II-a-A-03806 is the LMI code for Cetățuia Monastery. IS indicates the site is in Iași County. II indicates it is an architectural monument, a that it is an ensemble, A that it is of national interest, and 03806 is its unique code. The ensemble has six individual sites, so for instance the monastery's bell tower, the fifth site listed, has code IS-II-m-A-03806.05.\nSites may also have a RAN Code, indicating they are part of the National Archaeological Record (Repertoriul Arheologic Național), a register including sites with archaeological potential, sites where archaeological excavations have taken place or ruined archaeological sites.\nSee also\n* List of historical monuments in Romania, the list of monumente istorice by LMI code\n*Ministry of Culture and National Patrimony (Romania)\n*List of museums in Romania\n*List of castles in Romania\n*List of religious buildings in Romania\n*UNESCO World Heritage Sites in Romania\n*List of ancient cities in Thrace and Dacia\n*Romanian archaeology\n*Archaeological cultures in Romania\n*Archaeological sites in Romania\n*Culture of Romania\n*List of heritage registers\nReferences\nExternal links\n* [https://web.archive.org/web/20090401182237/http://www.cultura.ro/Files/GenericFiles/SituriUNESCO%5Bv3%5D.kmz Monuments listed by UNESCO in Romania] at Romanian Ministry of Culture and National Patrimony (in Romanian)\n* [https://web.archive.org/web/20100630170959/http://www.egispat.inmi.ro/ eGISpat geographic information system] by Romanian National Institute of Historical Monuments (includes LMI lookup)\n* [http://www.cimec.ro/scripts/ARH/RAn/sel.asp?Lang=EN National Archaeological Record of Romania (RAN)]  by Romanian Ministry of Culture and National Patrimony\n* [https://web.archive.org/web/20110820143544/http://map.cimec.ro/indexEn.htm Mapserver for Romanian National Cultural Heritage] by Romanian Institute for Cultural Memory\n* [https://web.archive.org/web/20091008220225/http://www.cultura.ro/Documents.aspx?ID=282  \tMonuments and sites in Romania viewable on Google Earth] at Romanian Ministry of Culture and National Patrimony (in Romanian)\n* Dacian fortresses, settlements and Roman castra from Romania: [https://maps.google.com/maps?q=http://bbs.keyhole.com/ubb/download.php?Number=1274893 Google Maps] / [http://bbs.keyhole.com/ubb/download.php?Number=1274893 Google Earth]\n* [http://www.monumenteromania.ro/ Monumente istorice in Romania]\n* [https://web.archive.org/web/20081026031153/http://www.turism.sibiu.ro/mapro.html Map with historical monuments] in Sibiu\n* [https://web.archive.org/web/20111007004152/http://www.inmi.ro/ Website] of the Romanian National Institute of Historical Monuments"
    }
  ]
}