{
  "content": [
    {
      "type": "text",
      "text": "# National War Memorial (India)\n\n| caption          = Clockwise from top: The Stambh (obelisk) houses the immortal flame, A section of the Tyag Chakra, View of a bust at the Param Vir Chakra section\n| alt              = National War Memorial\n| former_name      =\n| established      =\n| location         = C Hexagon, India Gate Circle, New Delhi, India\n| coordinates      =\n| designer         = Yogesh Chandrahasan\n| unveiled         = 25 February 2019\n| source           =[https://www.nwmm.php-staging.com/Default.php Official government website]|country=|body=|commemorates=Indian military dead of all wars|inscription=Inscription\nAmara JavānaŚahīdōṁ kī citāōṁ para juṛēṁgē hara barasa mēlēVatana para miṭanē vālōṁ kā yahī bākī niśām̐ hōgā.The Immortal soldier\n}}\nThe National War Memorial (ISO: Rāṣhṭrīya Samara Smāraka ; ) is a war memorial in New Delhi, Delhi, India, located at India Gate Circle. It has been built to honour and remember soldiers of the Indian Armed Forces who fought in armed conflicts of independent India. The names of armed forces personnel killed during the armed conflicts with Pakistan and China as well as the 1961 War in Goa, Operation Pawan, and other operations such as Operation Rakshak are inscribed on the memorial walls in golden letters.\nThis monument is spread over 40 acres of land and was built by the Government of India around the existing chhatri (canopy), near India Gate, New Delhi. The memorial wall is flushed with the ground and in harmony with existing aesthetics. It was completed in January 2019 and unveiled on 25 February 2019 in an inauguration ceremony held at the monument where Prime Minister of India Narendra Modi in the presence of Chief of Defence Staff (CDS) of India, and the three Chiefs of Staff of the Indian Armed Forces, ignited the eternal flame of the Amar Jawan Jyoti (Flames of Eternal Soldiers) at the Amar Chakra under the main obelisk of the monument.\nThe old Amar Jawan Jyoti, located at India Gate, previously served as the national war memorial. It was constructed in a short time frame following the Indo-Pakistani War of 1971 as per Prime Minister Indira Gandhi's wishes, so that it could be inaugurated on 26 January 1972 as a mark of respect to the martyrs of the war. The flame from here was merged with the flame at the new National War Memorial on 21 January 2022 by Integrated Defence Staff chief Air Marshal Balabhadhra Radha Krishna.\nArchitecture and design\nNational War Memorial\nA global design competition was conducted and the result was announced in early April 2017. A Chennai-based architectural firm WeBe Design Lab's proposal was declared the winner and was accordingly chosen for the conceptualization of the architectural design and for coordinating the construction of the project. The chief architect, Yogesh Chandrahasan, of WeBe Design Lab, was inspired by the thought of creating a memorial to celebrate and honour sacrifices as compared to a place to mourn them.\nThe National War Memorial and Museum was designated as a Special Project, and the task of its \"timely execution\" was allocated to a Special Projects Division under the Chief Administrative Officer (Ministry of Defence), and the Military Engineer Services.\nDesign\nThe Memorial has four concentric circles and a central obelisk, at the bottom of which burns an 'eternal flame' representing the immortal soldier (amar jawan). The concentric circles are designed as a Chakravyuh, an ancient Indian war formation. are called as follows (from innermost to outermost) :\n* Amar Chakra (Circle of Immortality): This structure of the memorial derives its name from the Eternal Flame (Amar Jawan Jyoti), continuously burning under the main obelisk at the center of the monument. The flame symbolises the immortality of the spirit of fallen soldiers and the promise that the Nation will never forget their sacrifices.\n* Veerta Chakra (Circle of Bravery): The second circle depicts the Bravery of Indian forces in the form of a covered gallery that exhibits six murals crafted in bronze depicting valiant battle actions of Indian Armed Forces. The battles showcased here are Battle of Gangasagar, Longewala, Tithwal, Rizangla, Operation Meghdoot and Operation Trident.\n* Tyag Chakra (Circle of Sacrifice):  The circular concentric walls of honour, which symbolise the ancient war formation 'Chakravyuh'. The walls are clad with granite tablets where an independent granite tablet is dedicated to each soldier who has made the supreme sacrifice in the battlefield, where his name is etched in golden letters along with the details of Rank.\n* Rakshak Chakra (Circle of Protection): The outermost circle made of rows of trees in the Rakshak Chakra is a reassurance to the citizens of the country about their safety against any threat, with each tree representing the soldiers who ensure the territorial integrity of the Nation, round the clock.\nThe Param Yodha Sthal houses the busts of all the 21 recipients of the Param Vir Chakra, India's highest military honour.\nNational War Museum\nA National War Museum will be constructed in the adjoining Princess Park area and will be connected to the memorial through an underground tunnel. The Princess Park is a 14-acres large area north of India Gate, with barrack-like accommodations built during World War II. Since 1947, it has served as family accommodation for mid-level armed forces officers posted in the Service Headquarters in New Delhi. The proposed National War Museum will be connected by metro. The construction of the War Memorial and Museum is expected to cost ₹500 crore (US$70 million).\nIn July 2020, the Central Public Works Department opened the tender for the selection of a consultant for the National War Museum in an area of around 10 acre. Two firms have been shortlisted, CP Kukreja Architects and Suresh Goel & Associates.\nSignificance and remembrance\nStarting of a new custom\nSince 1972, every-year on 26 January, Republic Day, it had been customary for the Prime Minister, Chief of the Air Staff, Chief of the Naval Staff, Chief of the Army Staff and dignitaries to place wreath at Amar Jawan Jyoti under India Gate. Other occasions were also marked such as Vijay Divas on 16 December, Independence Day on 15 August, service days such as Navy Day, and related anniversaries such as that of the National Cadet Corps.\nOn the occasion of 73rd Independence Day, the President of India, Ram Nath Kovind placed a wreath and observed 2 minutes silence to pay tribute to the soldiers for the first time at newly inaugurated National War Memorial instead of the old Amar Jawan Jyoti under India Gate. And this way started a new custom to honour the soldiers fallen for the country after Independence.\nFollowing the custom set by the President, the Prime Minister of India, Narendra Modi, for the first time placed a wreath at National War Memorial instead of India Gate on the occasion of Republic Day. Starting a new custom taking place at new Amar Jawan Jyoti under National War Memorial accompanied by the Chief of Defence Staff (CDS), along with the three Chiefs of Staff.\nRemembrances and observations\n* Republic Day (26 January) and  Independence Day (15 August)  the Prime Minister on Republic Day visits the memorial just before the commencement of the parade on Kartavya Path, while the President pays a visit to this memorial on Independence Day, after the speech of Prime Minister from Red Fort. On both occasions they are accompanied by the CDS and the three Chiefs of Staff.\n* Armed Forces Service Days, (Army Day (15 January), Air Force Day (8 October) and Navy Day (4 December )) on the respective days of the establishment of the tri-services, the CDS accompanied by the Army Chief, Navy Chief, and Air Force Chief collectively visit.\n* Armed Forces Flag Day (7 December) the CDS accompanied by the three Chiefs of Staff collectively visit.\n*Kargil Vijay Divas (26 July) celebration of success of Mission Vijay during Kargil war in 1999.\n*Vijay Divas (16 December) celebration of victory of Indian troops over Pakistan in the 1971 Bangladesh War of Independence.\nTimeline\nPre Construction\n*1960 - The Indian Armed Forces first propose a national war memorial.\n* 2006 - In the face of persistent demand from the armed forces and veterans for a war memorial, the United Progressive Alliance (UPA) government constitutes a Group of Ministers' (headed by Pranab Mukherjee) to examine the demand.  In 2006, the Ministry of Defence decides that the war memorial should be set up in the vicinity of India Gate, but panels under the Ministry of Urban Development say that it is a heritage area and should not be built upon.\n* 20 October 2012 - After 50 years, the government marks the anniversary of the offensive by the Chinese People's Liberation Army against Indian border defences on 20 October 1962, by a solemn ceremony at the Amar Jawan Jyoti, to honour Indian soldiers killed in the 1962 war. At the ceremony, A. K. Antony (the Minister of Defence) announces that the government has conceded the long-standing demand of the Indian Armed Forces for a national war memorial, and that it will be built near India Gate. He adds that the group of ministers has cleared all outstanding issues. The Chief Minister of Delhi, Sheila Dikshit, opposes this plan.\n* February 2014 - In the build-up to the 2014 Lok Sabha elections, Narendra Modi speaks about how the previous government had failed to construct the war memorial.\n* 7 October 2015 - The Union Cabinet passes the proposal to build the war memorial. It also clears ₹500 crore for the memorial and museum, sanctioning ₹176 crore for the memorial alone.\n* May 2016 - The Union Cabinet is apprised of the decision taken by the Empowered Apex Steering Committee (EASC) that the Princess Park Complex would be the suitable site for construction of the National War Museum. The memorial would be constructed at ‘C’ Hexagon of India Gate as approved by the Cabinet in its meeting held in October 2015.\n* 30 August 2016 - A global design competition for the National War Memorial and Museum is launched on the MyGov.in web portal.\n* April 2017 - The result of the global design competition is announced. Mumbai-based sP+a Studio's proposal wins for the design of the National War Museum. Chennai-based WeBe Design Lab's proposal is declared the winner for the design of the memorial. A total of 427 submissions are received for the \"Global Design Competition for National War Memorial\" while 268 submissions are received for the \"Global Architectural Competition for Indian National War Museum\". The jury was led by architect and planner Christopher Benninger.\n* 15 August 2018 - The National War Memorial misses the first deadline for its inauguration.\n* 1 January 2019 - The National War Memorial's construction is complete (not of the museum).\nPost Construction\n*25 February 2019 - The National War Memorial is inaugurated.\n*30 May 2019 - Narendra Modi visited National War Memorial and paid tribute to India's martyrs before taking oath as the Prime Minister of India for the second time.\n*15 August 2019 - The President of India placed a wreath and observed 2 minutes silence to pay tribute to the soldiers on the occasion of 73rd Independence Day for the first time instead of India Gate.\n*26 January 2020 - The Prime Minister placed a wreath and observed 2 minutes silence to pay tribute to the soldiers before the start of the 71st Republic Day Parade for the first time on Republic Day.\n*23 July 2020 - Central Public Works Department opened the bid for selection of a consultant for the National War Museum.\n*26 July 2020 - The 21st anniversary of Kargil Vijay Diwas, Defence Minister of India accompanied by MoS (Defence), the CDS and the tri-service chiefs paid tribute at NWM.\n*16 December 2020 -  The Prime Minister paid tributes and started the celebration of Golden Jubilee Year of Indian victory over Pakistan by lighting a Swarnim Vijay Mashaal (Golden Victory Torch) with the fire from Amar Jawan Jyoti at NWM.\n*21 January 2022 - Amar Jawan Jyoti of India Gate merged with National War Memorial.\nSee also\n* National War Memorial, Southern Command in Pune\n* National Military Memorial in Bengaluru\n* Kargil War Memorial in Dras\n* War Heroes' Memorial & Museum in Amritsar\n* National Police Memorial in Delhi.\nReferences\nBibliography\n* |author-link=Rana Chhina|archive-url=https://web.archive.org/web/20220120044036/https://mea.gov.in/Uploads/PublicationDocs/23460_IWM_Book__11-06-2014_.pdf|archive-date=20 January 2022|url-status=live}}"
    }
  ]
}