{
  "content": [
    {
      "type": "text",
      "text": "# National Agency for the Prohibition of Trafficking in Persons\n\n|preceding1      =\n|preceding2      =\n|dissolved       =\n|superseding     =\n|jurisdiction    = Federal Government of Nigeria\n|headquarters    = Abuja, FCT, Nigeria\n|coordinates     =\n|motto           =  Ensuring a Human Trafficking free Nation\n|employees       =\n|budget          =\n|minister1_name  =\n|minister1_pfo   =\n|minister2_name  =\n|minister2_pfo   =\n|deputyminister1_name  =\n|deputyminister1_pfo   =\n|deputyminister2_name  =\n|deputyminister2_pfo   =\n|chief1_name  =Dr. Fatima Waziri-Azi, Director General;\n|chief3_name  = Arinze Orakwue, Director Public Enlightenment;\n|chief2_name =  Hassan Hamis Tahir, Director Legal and Prosecution;\n|chief4_name =  Godwin Morka, Director Research and Programme Development;\n|chief5_name = Olubiyi Olusayo, Director Training and Manpower Development;\n|chief6_name = Josiah Emerole, Director, Investigation and Monitoring;\n|chief7_name = Effeh Ekrika, Director Administration;\n|chief8_name = Ebele Ulasi, Director Counseling and Rehabilitation;\n|chief9_name = Sambo Abubakar, Director Finance and Accounts.\n|agency_type     = Law enforcement\n|parent_department =\n|parent_agency   = Federal Ministry of Justice\n|child1_agency   =\n|child2_agency   =\n|keydocument1    =\n|website         =\n|footnotes       =\n|map             =\n|map_width       =\n|map_caption     =\n}}\nThe National Agency for the Prohibition of Trafficking in Persons (NAPTIP) is a law enforcement agency of the federal government of Nigeria. It was established in July 2003 to combat human trafficking and other similar human rights violations.\nNAPTIP is a national compliance to the international obligation under the Trafficking in Persons Protocol and responds to the need to prevent, suppress, and punish trafficking in persons, especially women, and children, complementing the United Nations Transnational Organized Crime Convention (UNTOC). It is one of the agencies under the supervision of the Federal Ministry of Justice.\nSince its inception, the Agency has investigated over ten thousand cases of human trafficking and prosecuted about five hundred offenders. Between 2003 and 2017, they convicted over 600 human traffickers and rescued about 21000 victims from Libya and other places.\nProfessor Fatima Waziri-Azi, assumed office as the Director General of NAPTIP on September 21, 2021.\nOrigin\nNAPTIP was established under a federal bill on July 14, 2003 by the Trafficking in Persons (Prohibition) Enforcement and Administration Act (2003) through the advocacy of Women Trafficking and Child Labour Eradication Foundation (WOTCLEF).\nObjectives\nNAPTIP is mandated to enforce the Trafficking in Persons(Prohibition) Enforcement and Administration Act (TIPPEA) in Nigeria. In 2015, the Agency was also given the responsibility of implementing the Violence Against Persons Prohibition  (VAAP) Act which was then passed into law by the National Assembly.\nDepartments\nTo discharge its duty  smoothly in combating human trafficking, the agency has the following departments and units:\n* Investigation and Monitoring\n* Legal and Prosecution.\n* Counselling & Rehabilitation\n* Public Enlightenment\n* Research and Programmes Development\n* Training and Manpower Development.\n* Administration.\n* Finance and Accounts.\n* Information and Communication Technology  (ICT) Department\n* Violence Against Persons Department (VAP)\n* Special Duties Department\nUnits\n* Procurement\n* Press and Public Relations\n* Intelligence and International Cooperation.\n* Audit.\n* Reforms.\n* Rapid Response Squad (RRS)\n* Language\nZonal Commands\nCurrently, the agency has 9 zonal commands located in Lagos, Benin, Enugu, Uyo, Sokoto, Maiduguri, Oshogbo, Makurdi and Kano Command.\nWorking With CSOs\nThe agency partners with non-government organizations to carry out its tasks in different states. In 2013, NAPTIP started partnering with Devatop Centre for Africa Development, a youth-led anti-human trafficking organization,  to train and empower youth in combating human trafficking in Nigeria, as well as investigating cases and rescuing victims. NAPTIP also partners with the Network of CSOs Against Child Trafficking, Abuse and Labour, Women Trafficking and Child Labour Eradication Foundation, and many others.\nWorking With EFCC\nNAPTIP requested for more support from the Economic and Financial Crimes Commission, EFCC, in their quest to rid the country of human trafficking and its attendant consequences on the image of Nigeria. This request was made by the Director General of the agency, Imaan Sulaiman-Ibrahim.\nAchievements\nSince its inception, the agency has had over 600 convictions on human traffickers, as of September 2017.\nBetween 2003 and 2017, over 3000 victims have been rescued by NAPTIP. The agency has been at the forefront of rescuing and rehabilitating Nigerians from Libya, with the help of the Federal Government, the International Office for Migration, and other international organizations, which has gotten a commendation from the United States.\nReferences\nExternal links\n* [http://www.naptip.org.ng Official website]\n* [https://www.youtube.com/channel/UCthOi5Mgiy7_E03EJsq3_2A Watch Videos]"
    }
  ]
}