{
  "content": [
    {
      "type": "text",
      "text": "# National Submarine War Memorial\n\n|location      = Victoria Embankment, London, United Kingdom\n|designer      = Arthur Ryan Heron Tenison\n|type          = Sculpture\n|material      = Bronze\n|length        =\n|width         =\n|height        =\n|begin         =\n|complete      =\n|open          =\n|dedicated_to  = Royal Navy submariners who died in the First and Second World Wars\n|map_image     =\n|map_text      =\n|map_width     =\n|relief        =\n|extra         =\n}}\nThe '''National Submariners' War Memorial is a war memorial on the Victoria Embankment in London, England, between Waterloo Bridge and Blackfriars Bridge.  The memorial is also  referred to as the National Submarine War Memorial, the National Submarine Memorial, the Submarine War Memorial and the Submariner Memorial'''.  It commemorates the Royal Navy submariners who died in the First and Second World Wars.  The Royal Navy Submarine Service had 57 operational vessels at the start of the First World War in 1914, but expanded to 137 vessels by the time the war ended in 1918, with another 78 under construction.  During the war, 54 of its submarines were sunk, and over 1,300 Royal Navy submariners were killed.  The memorial is a Grade II* listed building, and it is the focal point of a special memorial walk and laying of wreaths held each year by submariners on the Sunday preceding Remembrance Sunday.\nThe memorial was funded by public subscription.  It was designed by the architect Arthur Heron Ryan Tenison, and bears a bronze sculpture by Frederick Brook Hitch which was cast by the Parlanti Foundry.  Tenison and Hitch also collaborated on the memorial to the 8th and 9th Submarine Flotillas at St Mary's Church, Shotley.  The memorial was built into a granite pier that former part of the entrance to Temple Pier, a boat landing stage on the Victoria Embankment.\nThe memorial stands on granite steps, supporting a large bronze bas relief within an architectural frame.  The bas relief shows the interior of a submarine and another with nereids swimming on either side.  To the right and left are allegorical figures representing Truth and Justice.  On either side of the central bronze plaques are 40 bronze wreath hooks in the form of anchors.  At the top of the memorial is the inscription \"Erected to the memory of the officers and men of the British Navy /who lost their lives serving in submarines 1914–1918 and 1939–1945\".  On the left hand side is a list of 50 submarines lost during the First World War, and on the right a list of 82 submarines lost during the Second World War.  It was unveiled on 15 December 1922 by the Chief of the Submarine Service, Rear Admiral Sir Hugh Sinclair, and dedicated by the Chaplain of the Fleet, Archdeacon Charles Ingles.\nFurther panels commemorating the Second World War were unveiled on 15 November 1959 by Rear-Admiral Bertram Taylor.  An additional plaque was added in 1992 to commemorate the 70th anniversary of the unveiling of the original memorial. The 70th anniversary plaque reads: \"National Submarine War Memorial (1922) This plaque commemorates the memorial’s seventieth anniversary and the contribution by the members of the submariners old comrades, London, in their devotion to the upkeep of this memorial, unveiled by Peter P. Rigby C.B.E.J.P.\".\nIt became a Grade II listed building in 1972, and was upgraded to Grade II* in January 2017.\nGallery\nFile:National Submariner's War Memorial, Victoria Embankment.jpg|Wider view showing bronze prows\nFile:Submarine Memorial Relief.jpg|Detail of the central relief\nFile:Submarine Memorial Relief 2.jpg|Detail of the central relief: swimming nereids\nSee also\n* List of public art on the Victoria Embankment\n*Grade II* listed war memorials in England\nReferences"
    }
  ]
}