{
  "content": [
    {
      "type": "text",
      "text": "# National and ethnic cultures of Utah__disambig_1\n\n}}\nUtah (/ˈjuːtɑː/ YOO-tah, /ˈjuːtɔː/ (listen) YOO-taw) is a state in the Mountain state  subregion of the Western United States with a population of 3 million people. Originally populated by the Ancestral Puebloans, Ute, Navajo, and Fremont people, Utah has experienced several waves of immigration over its history, leading to a diversity of ethnic and national backgrounds. Historians characterize the post-Indigenous settlement of Utah as having occurred in three major waves, the first between 1850 and 1880, the second between 1880 and 1920. and the third post World War II to the present.\nBackground\nBingham Canyon Mine, April 2005.\nImmigrants came to Utah in three major “waves”. The first wave took place between 1850 and 1880, when the Church of Jesus Christ of Latter-day Saints (LDS Church) invited all the new converts, who were mostly from Northern Europe, to “gather in Zion.” The second one occurred between 1880 and 1920 and involved people from all over the world. This happened in connection with the booming railroad and mining industries. The third one, after World War II, was slower and it is still happening to this day. Most of the participants are from Mexico and Latin America.\nDemographic data\nAccording to 2000 official estimates, the population of the state of Utah was 2,470,000.\n* The percentages of non-White ethnic groups are as follows: Asian 2.4%, Native American 1.7%, Black 1.3%, Native Hawaiian or Pacific Islander 0.9%. This is a total of 6.3%.\n* The percentages of the major national groups are as follows: German: 11.5%, Hispanic (mostly Mexicans) 10.4%, Danish: 6.5%, Irish 5.9%, British 4.4%, Swedish 4.3% Italian 2.1%. This is a total of 45.1.\n* Other national groups, such as people from Bosnia, France, Russia, Sudan, Venezuela, etc. total 12.8%.\n* The percentage of the British and American (mostly of English/British ancestry) population is respectively 29% and 6.8%, for a total of 35.8%\nEthnic groups\nAfrican Americans\nUtah was admitted to the Union as a slave state under the Compromise of 1850, at which time approximately 50 Black people, or 0.4% of the population according to the 1850 US Census, lived in the territory.\nThere were about sixty Black residents of Utah in 1850,the majority of them working on farms. In 1900, the Black population increased to 677 because of the railroad construction companies. By the 1890s, two churches were already established in Salt Lake City, the Trinity African Methodist and the Calvary Baptist. Discrimination against Black citizens was endemic, with limited access to public positions many professions considered off-limits to all but White people. Many young Black emigrants would relocate to other states to seek opportunities unavailable to them in Utah.\nThroughout the 20th century, Black Utahns faced further systemic issues, such as the prohibition of interracial marriage, and lethal violence, including a lynching in Price, Utah, in 1925.\nA chapter of the NAACP was established in Salt Lake in 1919, taking an active part of the Civil Rights Movement.\nIn 1976, the Reverend Robert Harris, a Democrat from Ogden, became the first African American elected to the Utah Legislature. In 1978, the LDS Church allowed blacks to be ordained to the priesthood.\nAccording to the 2000 US Census, there were approximately 30,000 Black residents of Utah, or 1.3% of the total population.\n* Organizations. NAACP Salt Lake Branch. Black Affairs, Ethnic Office, Utah Government.\nNative Americans\nThe most important Utah tribes today, the Ute, the Shoshone, the Goshute and the Paiutes are the descendants of the so-called Numic population who settled in Utah and bordering states around 1200 a. D. They displaced populations like the Fremont and the Anasazi who had lived in that territory for several centuries, starting from about 400 a. D. When the Mormon pioneers arrived in Utah in 1847, these tribes numbered about 20,000 people. Notwithstanding several programs aimed to maintain their survival, for several years they lost control of their ancestral territory. In 1960, the tribes' population was down to around 7,000 people. Following the implementation of more favorable federal and state programs, in 1970 their population increased to 11,000 and in 1980 returned toward the same figure of 1847, about 19,000. Today (2007), many of Utah's American Indians are experiencing a better balance between tribal life and coexistence with the dominant society.\nChinese\nChinese workers started to arrive in Utah around 1860 in connection with the railroad construction companies. They were very appreciated as skillful and dependable workers. After the railroads were built, at the beginning of 1900 some found occupations in the new mining industry and others dedicated themselves to independent businesses such as laundries, restaurants and mini markets. They lived in their humble but colorful Chinatowns, mostly singles without families, because they had the intention to return one day to China. Many of them had periods of hard times and experienced discrimination. For example, in 1902 the mining unions decided to boycott their businesses. The major Chinese communities before World War II were in Ogden, Salt Lake City and Park City. In 1890 there were about 500 Chinese people in Utah. This number grew a little at the beginning of 1900, but then, as a result of the Depression, in 1940 declined to about 500. After World War II it started to steadily grow. In 1970 Chinese numbered about 1.200, and in 1990 their population increased to over 5,000 people.\n* Organizations. UOCA, Utah Organization of Chinese Americans.\nJapanese\nSimilar to the Chinese, the Japanese started to arrive in Utah in the 1860s as laborers in the railroad companies. By 1900, according to the census, over 400 Japanese people were living in Utah. Their number grew in the next twenty years as a result of the booming mining industry. In 1910 their number was 2,100 and in 1920 they reached almost 3,000 people. The most important areas where they were located were Ogden, Salt Lake City and Carbon County. Due to this significant population a newspaper was started, a Buddhist Temple, and a Christian church were built near Japan Town in Salt Lake City. All three are still in existence today (2007). Instead, Japan Town was razed to build the Salt Palace. A similar destiny had China Town in Plum Alley. This short period of prosperity was followed by the anti-immigration laws of 1924. Discrimination worsened when Japanese children were denied access to activities in the public schools. The really big blow came with World War II, when almost all Japanese were segregated in Camps in remote areas of Utah, such as Topaz. Their cemetery was vandalized by paranoid people. Many Japanese from California were also sent to the Camps in Utah. Some of them remained after the end of the war. Because of this, according to the 1950 Census, Utah's Japanese population almost doubled.\nSince the 1950s, the Government has acknowledged the bad treatment suffered by the Japanese Americans and has offered some form of reparation. Today the Japanese in Utah continue to keep their national traditions while actively contributing to the local community.\n* Organizations. Salt Lake Buddhist Church, Japanese Church of Christ, Utah Nippo newspaper, Japanese-American Citizen's League.\nRomani\nMost of the Romani people who came to Utah were of Balkan, Eastern, and Central European origin. The Roma settled in Deseret, Elsinore, Oak City, Kanab, and other rural communities in Utah since the early 1900s.\nNational groups from Africa\nSudanese\nAs of 2005, there were about 2,000 Sudanese in Utah. Most of these were recent immigrants. They included young families with children and young singles. They started to arrive in 1999 as refugees, and many are still coming, because of the war going on in Sudan between the Muslims of the North and the Christians of the South. For them life in Utah is better and they especially enjoy the security, far from the dangers of the war. They live mostly in Salt Lake County, with concentration in Salt Lake City and West Valley. They plan to remain in the USA. Most of them are working and many are also studying at college. They have found jobs at convenience stores like 7-Eleven or in warehouses. Several of the Sudanese women are attending school at Horizonte High School to obtain the skills necessary to start their own businesses. Almost all of them are renting their homes and apartments.\nThe official language in Sudan is Arabic, but most of them know English, also because of the proximity with Kenya. Some of those not from the cities speak their dialects instead of Arabic, but they also know some English. Since they are mostly from South Sudan, they are in great majority Christians (95%), and the rest are Muslims. They are very religious and meet every Sunday at church.\n* Organizations. Sudanese Association of Utah, a 501c3 non-profit organization.\nNational groups from Latin America\nHispanics\nHispanic Utahns, or Utahns who trace their heritage to any number of Spanish colonial subjects and often speak Spanish as a first or second language, represent one of the largest growing demographics in contemporary Utah. Many of these people have mixed European, African, and Indigenous American ancestry. Also generally included in this demographic are Latino Utahns, who trace their ancestry to Latin America, but may not speak Spanish.\nMexicans\nAbout 80% of the Hispanics in Utah come from Mexico, and the rest from other countries of Central America and South America. After World War II, they have become the fastest growing group of immigrants, and they are the largest of the recent wave of immigrants. According to 2005 data, they represent 8.3 percent (eighty percent of 10.4 percent) of the state's population. This is a big jump from the 3.9 percent (eighty percent of 4.9 percent) of the 1990 census. The first European to explore Utah was Spanish friar Father Escalante and Francisco Dominguez in 1778. Until 1848 Utah was part of Mexico. No permanent Mexican settlements were ever established, but the Spanish Trail was built in the state's southern boundaries, and several geographic names remain. The first Hispanics to settle in Utah were ranchers coming from New Mexico and Colorado who found jobs in the southwestern part of the state, near Monticello in the 1880s. By 1900 a good number of families lived in that area, some of them on their own homesteads. At the same time a good number of Mexicans immigrated to the Salt Lake and Ogden area to work in the railroad and mining companies. They associated with the organizations of the Roman Catholic Church. In the 1920s a congregation called La Rama Mexicana was established by the LDS Church, to cater to the Hispanics of Central and South America converted by the Mormon missionaries. Social organizations of mutual aid were founded also by the immigrants. These included the Cruz Azul (Blue Cross) similar to the Red Cross, and Union y Patria (union and fatherland). After World War II the Centro Civico Mexicano was started in Salt Lake City, and still exists (2007). Today, a good number of Mexicans are well integrated in Utah, but many social problems remain. High rates of school dropouts, of unemployment, and of poverty are still too common among Mexican immigrants.\n* Organizations. Centro Civico Mexicano, Salt Lake City\nNational groups from Europe\nBasque\nMost Basques immigrated to Utah at the end of the 1800s. Their major occupation was at first shepherding on big ranches. They were considered the most reliable ranchers in the West. In fact, shepherding had been for centuries their profession in their rugged land of origin, between France and Spain. Many of them went to work in the mines when they were opened at the beginning of 1900. Today the Basques number just a few hundred in Utah, but they are still very dedicated to their ancestral culture.\n* Organizations. Utah Basque Club, member of the North American Basque Organization. Utah'ko Triskalariak Basque Dancers, a traditional folk dance troupe.\nSpaniards\nSpaniards were the first Europeans to visit Utah. After visiting, steady waves of migrants from Spain and New Spain continued throughout the next century. Many Spaniards in the 18th century immigrated to the northern region of Utah. Many lived in ranches and in small villages.\nDanes\nThe pattern of immigration of Danes in Utah mirrors closely the British immigration: both came in big numbers the early years, and both were converts to Mormonism. The difference was that the Danes were not native English speakers. By 1869 about 17,000 Danes had come to Utah. This number was inferior only to the British. In the 1890 census 10 percent of the Utah population had Danish connections. This trend remained unchanged for many years until 1970. In the 2000 census the percentage had dropped to 6.5. Most of the Danes were farmers from Northern Jutland and settled in the agricultural counties of Box Elder and Cache in the north of Utah, and Sevier and Sanpete in the south. Although LDS Church leaders encouraged assimilation, and participation in English speaking wards, a number of language based organizations flourished. In 1876 a periodical in Danish, Norwegian and sometimes Swedish, appeared, and lasted until 1935. Several Danes soon became prominent in all sectors of civil and ecclesiastical activities, but for most of those of the first generation the language barriers were difficult to overcome.\n* Organizations. Danish consulate\nFinns\nFinnish immigrants (also called Finns or Finlanders) came to America in big numbers in search of better opportunities, also because their Country was engaged in a bloody war of independence against Russia. It is calculated that about 375,000 emigrated to the United States in the years around 1900. Most of them settled in the Midwest and a few came to Utah. A couple hundred, according to the 1900 census, were living in Utah in the mining districts, especially in Carbon County. They were happy when they could recreate a Little Finland in their communities, with a Finn hall, a boarding house, and especially a sauna. Their community received a big blow when sixty of them died in 1900 in the Scofield mine disaster at the Winter Quarters mine near Scofield, Utah. Many of the surviving Finns left Utah, but a few remained. Some of them, like John Westerdahl became successful entrepreneurs. Today the Finnish group is small, but is still very active in keeping their ancestral culture alive.\n* Organizations. Finlandia Society, Salt Lake City.\nGreeks\nThe Greeks, along with the Italians, are the largest Mediterranean community in Utah. They immigrated to Utah at the beginning of the 1900s in connection with the development of the railroad and of the mining industries. These industries were not attractive to local Mormons. According to the 1910 census, the Greeks numbered about 4,000, but probably much more. Greeks showed high appreciation of their religious heritage by building their first Greek Orthodox Church near downtown. At that time they were mostly single men. Their work was dangerous and they wanted to be buried according to their religious traditions. Over one hundred funerals were performed in the period between 1910 and 1924 for men killed by work related accidents. At the beginning these men hoped to return to their homeland, but then they decided to remain and started to marry \"picture wives.\" With the large increase of immigrants, businesses related to their national culture were started, such as coffeehouses, bakeries, and grocery stores with Greek products. They also opened a school dedicated to teaching Greek language and culture to their children. When war was declared by Greece against Turkey in 1912, about 200 men went to fight for their country. All these elements were considered by the Americans as a clear sign that the Greeks had no intention of assimilating. Anti Greek sentiment was well spread in the 1920s. A severe episode of lynching happened when a Greek gave a ride to an American girl. World War II brought prosperity to the community because of many government related jobs. Almost 600 men served in the Army, 22 died in combat. After the war two more churches were opened, and today the Greek community is thriving. The Greek festival organized by the Holy Trinity Church in Salt Lake City attracts over 100,000 people every September.\n* Organizations. Hellenic Cultural Center of Salt Lake City.\nGermans\nOf the 143 Mormon pioneers who first entered the Salt Lake Valley in 1847, one of them was German. German immigration in Utah was closely connected with the Mormon ”Gathering in Zion,” but a small percentage had connection with the mining and railroad industries, and a few with the Jewish community. The most famous of this early immigration was Karl G. Maeser, founder of Brigham Young University. By 1910 the number of Germans reached over 5,000. They had to solve a dilemma when the United States declared war on Germany in World War I, but the great majority sustained their new country. During World War II about 7,000 German soldiers were kept as prisoners of war in Utah, mostly in Ogden. Some of them remained after the war ended. Also, about 3,000 German Mormons immigrated to Utah in the aftermath of the war. Famous Germans in Utah include a long list of musicians, architects, painters, scholars, and Church leaders. German language and traditions have always been kept alive with various organizations and a newspaper, the Salt Lake Beobachter, that ended publication in the 1930s after forty years of activity. Today similar organizations continue to prosper. There is a radio program and a choir Harmonie. A German American Society of Utah was organized in 1983. Around 100,000 tourists from Germany visit Utah every year.\nBritish\nThe immigrants in Utah from the British Isles were different from most of the others for several reasons. They came early, they came in big numbers, they were mostly Mormons. Particularly, they were English speaking, and they soon became part of the leadership both in the LDS Church and in the civil society. Many arrived as part of the initial Mormon migration to Utah, and a big influx continued for the next twenty years. The 1870 census shows that about 24 percent of Utah population were born in Great Britain. If their American born children are included in this count, their percentage could almost reach fifty percent. An even higher proportion of British is reflected in their participation in the leadership of the LDS Church. For example, the successor of Brigham Young as President of the Church was John Taylor, a Briton. The same situation happened in the government and in the business sectors. Being of the same language, culture and religion of the Mormon leadership greatly helped them to completely integrate to early Utah culture. On the other side, British immigrants greatly helped American Mormons to start the development of the new land, in the critical first years before the arrival of the railroad. Their immigration continues today, even though at much lower rates. According to the 1980 census, 3.2 percent of Utahns were born in the British Isles.\n* Organizations. Cambrian Society, Caledonia Society, Scottish social club.\nItalians\nPrice is the governmental seat of Carbon County and the economic center for the county and East-Central Utah\nA small group of about 60 Waldensians came to Utah in the 1860s from Piedmont, Italy, following Mormon missionary efforts by Lorenzo Snow. They were followed by the big \"wave\" of the 1880–1920. They came by the thousands, and soon in the west side of Salt Lake City a Little Italy was formed, with a cluster of stores where Italian cuisine and merchandise were sold. Italian presence was mainly in Salt Lake County, in Carbon County, and in Ogden. Several local Italian newspapers, such as Il Minatore (the miner) and La Scintilla (the sparkle) were keeping the new immigrants informed. The Italians who came to Utah were mostly Catholic, and were taken care of by a parish priest, Monsignor Giovannoni, sent from Italy to ease the language barriers they encountered. The Italian Vice Consul Fortunato Anselmo, from Calabria, helped them with government documents and bureaucracy. During World War II about 4,000 Italian soldiers were kept as prisoners in Utah camps. Some of them remained after the war. The first generation of immigrants, as usually happens, had to accept mostly menial jobs, but the next generations have shown that the Italians have adjusted very well to the new country. Italian Americans can be found in all professions and businesses, in percentages similar to those of any national group. The first Italian to become state legislator was Frank Bonacci, in the 1930s. Today Italian immigration in Utah has practically come to an end. An exception is represented by a few converts to the LDS Church.\nSwedes\nMost Swedes came to Utah as a result of their conversion to the LDS Church, similar to the Danes and the British. They were in smaller numbers. According to the 1910 census about 17,000 Swedes and their children were living in Utah. This is a 4.6 percent of the state's population. They must have been fairly successful, because the 2000 census confirmed a similar 4.3 percentage. The counties with the highest rate of Swedes were Tooele, Salt Lake and Cache. Grantsville and a neighborhood in Salt Lake City had a Swedish majority. As usually happens when foreign immigrants transplant to a foreign country, they had the desire to keep their language and culture. The LDS Church encouraged them to participate in the English-speaking wards. A group of them asked instead for Swedish-speaking wards. The refusal of the church caused what was called the “Swedish rebellion,” from 1901 to 1903, and a few people left the Church as a result of that situation. One of these “rebels” was Johan Ahmanson, who became a state legislator in Nebraska and wrote a book against the Mormons. On the whole, the Swedish integrated very well in the new society. They prospered in the various fields of business, industry, and in the political and in the ecclesiastical institutions. The former President of the LDS Church, Thomas S. Monson, has Swedish ancestry. The most famous Swedish remains Joe Hill (Hagglund), who was a Union leader of the mining period.\nA Swedish speaking branch of the LDS church was later created and ran for many years before closing in the late 1980s.\n* Organizations. Swedish Honorary Consulate of Salt Lake City. Swedish Heritage Society of Utah.\nSwiss\nSwiss immigrants started to come to Utah in the 1850s as a result of the proselytizing efforts of Mormon missionaries in Switzerland. The 1860 census showed the presence of 78 Swiss in Utah, and by 1910 that number reached 1,700, a considerable figure for a small country. A group of them were sent by Brigham Young to start the town of Santa Clara, near St George, and they accomplished the task in an excellent way. Another city with Swiss majority is Midway, near Heber. Swiss presence is also notable in Providence, near Logan and in other communities of Cache Valley. Typical Swiss industries like cheesemaking and watchmaking have been transplanted to Utah. Several notable Utahns are descendants of Swiss pioneers, professors, artists, musicians, businessmen and politicians. The Swiss influence in Utah is still alive today, and it becomes very visible during the Swiss Days in Midway, that attracts over 60,000 visitors every year.\n* Organizations. Swiss Festival of Midway. Swiss Honorary Consulate of Salt Lake City.\nNational groups from the Middle East\nJews\nThe Jews who first settled in Salt Lake City in the 1850s were merchants and businessmen of German and Hungarian origin coming from the Eastern United States. They started successful stores and enterprises. Their number increased with the opening of the railroad. In 1876 there were some forty families, and by 1891 that number was already doubled. Several of them became prominent businessmen and citizens, occupying top positions in the city council, in the legislature, and in the chamber of commerce. Simon Bamberger became the first non-Mormon Governor in 1916, and Louis Marcus became mayor of Salt Lake in 1932. On the religious side, the Jewish community built their first synagogue in 1883, in the downtown area. They had problems because of the antagonism between the orthodox minded East Europeans and the liberal Germans. At the end they decided for separation and the building was sold. Another synagogue was built by the liberal group in 1891. For their social events the Jewish community purchased a large and elegant building near downtown, that remained active for many years. In 2003 a new Jewish Community Center was purchased near the campus of the University of Utah. Also the synagogue has been moved from downtown, closer to a residential area. In 2005 the Jewish community counted about 5,000 members.\n* Organizations. Synagogue Kol Ami, Salt Lake City; Jewish Community Center; Chabad and The Rohr Jewish Learning Institute\nSee also\n* Cultural diversity\n* Melting pot\nNotes\nFurther reading\n* (1994) [https://web.archive.org/web/20240120042314/https://www.uen.org/utah_history_encyclopedia/i/IMMIGRATION.shtml \"Immigration to Utah\"] article in the [https://www.uen.org/utah_history_encyclopedia/ Utah History Encyclopedia.] The article was written by Richard L. Jensen and the Encyclopedia was published by the University of Utah Press. ISBN 9780874804256. Archived from [https://www.uen.org/utah_history_encyclopedia/i/IMMIGRATION.shtml the original] on January 20, 2024 and retrieved on May 14, 2024.\nExternal links\n* [http://www.slcgov.com/mayor/divHR/default.htm Salt Lake City Government Office of Diversity]\n* [http://www.mayor.slco.org/ Salt Lake County Mayor's Office - Diversity]\n* [http://ethnicoffice.utah.gov/index.html Utah Government Office of Ethnic Affairs]\n* [http://www.uen.org/utah_history_encyclopedia/ Utah History Encyclopedia]\n* [http://historytogo.utah.gov/ Utah History to go, Utah Historical Society]"
    }
  ]
}