{
  "content": [
    {
      "type": "text",
      "text": "# National Film Awards UK\n\n| website = [http://www.nationalfilmawards.co.uk National Film Awards UK]\n}}\nThe National Film Awards UK are presented in an annual award show hosted by the National Film Academy (NFA). As of 2015, it has taken place in Central London at the Porchester Hall. The most recent 11th National Film Awards UK was held on 2 July 2025.\nHistory\nThe National Film Academy (NFA) was founded in 1999 and went on to launch the National Film Awards UK in 2015 as an annual awards ceremony celebrating the achievements of established and independent filmmakers, actors, actresses, casting directors, production companies, and crew who make up the motion picture industry. The National Film Awards is scheduled to produce four award ceremonies annually in the United Kingdom, United States, South America, Africa, and Australia. All nominations and voting for the NFA are submitted and voted for by movie fans, which is similar to the now-defunct award ceremony, the Daily Mail National Film Awards, that was held between 1946–1951.\nNational Film Academy has as its core mission to support, develop, promote and celebrate the achievements of the motion picture industry worldwide. The Academy has over 275,000 members worldwide and runs a year-round programme of premieres, festivals, seminars, conferences, educational events including film screenings and tribute evenings.\nAnnual ceremony\nThe ceremony takes place annually in March. The awards are mostly open to all nationalities but all nominees or films must be based in the country of origin except the Best Foreign Film category.\nSponsorship\nIn 2016, the mobile network O2 sponsored the awards.\nWinners\n2025\nSource:\n* Best Actress: Megan Placito (''Peter Pan's Neverland Nightmare)\n* Best Actor: Martin Portlock (Peter Pan's Neverland Nightmare)\n* Best Newcomer: Nykiya Adams (Bird)\n* Best Actress in a TV Series: Nielle Springer (Crongton)\n* Best Actor in a TV Series: Staz Nair (Virdee)\n* Best Supporting Actress: Emma Thompson (Bridget Jones: Mad About the Boy)\n* Best Supporting Actor: Ray Fearon (My Fault: London)\n* Best Supporting Actress in a TV Series: Alexandra Burke (Curfew)\n* Best Supporting Actor in a TV Series: Bobby Brazier (Curfew)\n* Best Drama: Grey Matter\n* Best TV Drama Series: Curfew\n* Best Thriller: Rumpelstiltskin\n* Best Action in a Film/Series: Supacell\n* Best Independent Film: A Brother’s Bond\n* Best Screenplay: \tChris Reading, Anna-Elizabeth Shakespeare, and Hillary Shakespeare (Time Travel is Dangerous)\n* Best Documentary/Docu-Series: We Are Home\n* Best British Film: William Tell\n* Best Comedy: Time Travel is Dangerous\n* Outstanding Performance: Danny Dyer (Marching Powder)\n* Best Feature Film: Grey Matter\n* Best Director: Rich Peppiatt (Kneecap)\n* Best Producer: Andy Edwards and Becca Hirani (Rumpelstiltskin)\n* Best Film Production Company: Sky Studios\n* Best Foreign Language Film: The Girl with the Needle (Danish)\n* Best Short Film: Milk\n* Best International Film: Bridget Jones: Mad About the Boy\n* Lifetime Achivement Awards: Stephanie Beacham\n2024\nSource:\n* Best Actress: Patricia Hodge (Arthur's Whisky)\n* Best Actor: Adam Deacon (Sumotherhood)\n* Best Newcomer: Gus Turner (Ted Lasso)\n* Best Actress in a TV Series: Michelle Collins (EastEnders)\n* Best Actor in a TV Series: Jamie Lomas (Hollyoaks)\n* Best Supporting Actress: Lulu (Arthur's Whisky)\n* Best Supporting Actor: Nick Moran (Firecracker)\n* Best Supporting Actress in a TV Series: Amy Walsh (Emmerdale)\n* Best Supporting Actor in a TV Series: Brendan Quinn (One Day)\n* Best Drama: Back to Black\n* Best TV Drama Series: The Full Monty\n* Best Thriller: Damsel\n* Best Action in a Film/Series: Fool me Once\n* Best Independent Film: Rise of the Footsoldier: Vengeance\n* Best Screenplay: Brook Driver (Swede Caroline)\n* Best Documentary/Docu-Series: Copa 71\n* Best British Film: Back to Black\n* Best Comedy: Arthur's Whisky\n* Outstanding Performance: Anthony Hopkins (One Life)\n* Best Feature Film: Bolan's Shoes\n* Best Director: Emma Westenberg (Bleeding Love)\n* Best Producer: Daniel Emmerson, Daniel Kaluuya (The Kitchen)\n* Best Streaming Platform: Netflix\n* Best Film Production Company: Film4 Productions\n* Best Foreign Language Film: Captain Miller (Tamil)\n* Best Short Film: Good Intentions\n* Best International Film: The Book of Clarence\n* Global Contribution to Motion Picture: Johnny Depp (Jeanne du Barry)\n2023\nSource:\n* Best Actress: Olivia Colman (Empire of Light)\n* Best Actor: Taron Egerton (Tetris)\n* Best Newcomer: Noah Caplan (Stepping Stone)\n* Best Actress in a TV Series: Jennifer Metcalfe (Hollyoaks)\n* Best Actor in a TV Series: Richard Blackwood (Hollyoaks)\n* Best Supporting Actress: Lourdes Faberes (Operation Fortune: Ruse de Guerre)\n* Best Supporting Actor: Asim Chaudhry (What's Love Got to Do with It?)\n* Best Drama: Tetris\n* Best Supporting Actress in a TV Series: Arsema Thomas (Queen Charlotte: A Bridgerton Story)\n* Best Supporting Actor in a TV Series: Dizzee Rascal (Jungle)\n* Best TV Drama Series: You\n* Best Thriller: The Stranger in Our Bed\n* Best Action in a Film/Series: Queen Charlotte: A Bridgerton Story\n* Best Independent Film: Love Without Walls\n* Best Screenplay: Jemima Khan (What's Love Got to Do with It?)\n* Best Documentary: The Real Mo Farah\n* Best British Film: What's Love Got to Do with It?\n* Best Comedy: Rye Lane\n* Outstanding Performance: Adele James (Queen Cleopatra)\n* Best Feature Film: Bank of Dave\n* Best Director: Shekhar Kapur (What's Love Got to Do with It?)\n* Best Producer: Kayleigh-Paige Rees (Keep Calm & Carry On)\n* Best Streaming Platform: Prime Video UK\n* Best Film Production Company: Film4 Productions\n* Best Foreign Language Film: Saint Omer\n* Best International Film: Luther: The Fallen Sun\n* Global Contribution to Motion Picture: Hugh Grant\n2022\nSource:\n* Best Actress: Kate Beckinsale (Jolt)\n* Best Actor: Jude Law (Fantastic Beasts: The Secrets of Dumbledore)\n* Best Newcomer: Olive Tennant (Belfast)\n* Best Actress in a TV Series: Lily Collins (Emily in Paris)\n* Best Actor in a TV Series: Ben Miller (Professor T.)\n* Best Supporting Actress: Helen Mirren (The Duke)\n* Best Supporting Actor: Mathew Horne (The Nan Movie)\n* Best Drama: Save the Cinema\n* Best Supporting Actress in a TV Series: Emma Naomi (Professor T.)\n* Best Supporting Actor in a TV Series: Lucien Laviscount (Emily in Paris)\n* Best TV Drama Series: Emily in Paris\n* Best Thriller: Last Night in Soho\n* Best Action in a Film/Series: Top Boy\n* Best Independent Film: A Violent Man\n* Best Screenplay: Stephen Brown, Marcelo Grion, Stephan Karandy (The Prototype)\n* Best Documentary: The Tinder Swindler\n* Best British Film: Belfast\n* Best Comedy: People Just Do Nothing: Big in Japan\n* Outstanding Performance: Craig Fairbrass (A Violent Man)\n* Best Feature Film: Belfast\n* Best Director: Martin Owen (Twist)\n* Best Producer: Claire Jones, Tim Sealey (People Just Do Nothing: Big in Japan)\n* Best Film Distribution Company: Vertigo Films\n* Best Film Production Company: Darren Star Productions\n* Best Foreign Language Film: Martín Barrenechea, Nicolás Branca (9)\n* Best International Film: Citation\n* Global Contribution to Motion Picture: Anthony Hopkins (The Father)\n* Lifetime Achievement Award: Anita Dobson\n2021\n* Best Animation Film: A Shaun the Sheep Movie: Farmageddon\n* Best International Film: The Boy Who Harnessed the Wind\n* Best Director: Shelagh McLeod (Astronaut)\n* Best Actor: Adewale Akinnuoye-Agbaje (Farming)\n* Best Actress: Kate Beckinsale (Farming)\n* Best Newcomer: Mhairi Calvey\n* Best Supporting Actress: Gemma Jones (Rocketman)\n* Best Supporting Actor: Khali Best (Blue Story'')\n* Best Actress in a TV Series: T'Nia Miller (Years & Years)\n* Best Actor in a TV Series: Mathew Horne (Gavin & Stacey)\n* Best Drama: Farming\n* Best TV Drama Series: Beecham House\n* Best Thriller: The Haunting of Borley Rectory\n* Best Action: Acceptable Damage\n* Best Screenplay in a TV Series: Ricky Gervais (AfterLife)\n* Best Independent Film:  Rise of the Footsoldier: Marbella\n* Best Screenplay: Blue Story\n* Best Documentary: Liam Gallagher: As It Was (Liam Gallagher, Gavin Fitzgerald, Charlie Lightening)\n* Best British Film: Lynn + Lucy\n* Best Comedy: Eaten by Lions\n* Outstanding Performance: Louis Ashbourne Serkis (The Kid Who Would Be King)\n* Best Feature Film: Lucas & Albert\n* Best Producer: Ged Doherty, Elizabeth Fowler, Melissa Shiyu Zuo (Official Secrets)\n* Best Film Distribution Company: Evolutionary films\n* Best Film Production Company: Fable Pictures\n* Best Foreign Language Film: Jessica Forever (France)\n* Outstanding Achievement Award: Vanessa Redgrave\n* Lifetime Achievement Award: Rowan Atkinson\n* Global Contribution to Motion Picture: Rowan Atkinson\n2019\n* Best Animation Film: Sherlock Gnomes\n* Best International Film: Black Panther\n* Global Contribution to Motion Picture: Michael Caine\n* Best Director: Idris Elba (Yardie)\n* Best Actor: Rupert Everett (The Happy Prince)\n* Best Actress: Sophie Kennedy Clark (Obey)\n* Best Newcomer: Justin Clarke (The Intent 2: The Come Up)\n* Best Supporting Actress: Charlotte Milchard (Scott and Sid)\n* Best Supporting Actor: Ricky Tomlinson (Gloves Off)\n* Outstanding Contribution Award: Sylvia Young\n* Best Drama: Yardie\n* Best TV Drama Series: Collateral\n* Best Thriller: Redcon-1\n* Best Action: The Intent 2: The Come Up\n* Best Independent Film: Dead Ringer\n* Best Screenplay: 16/03\n* Best Documentary: Bros: After the Screaming Stops\n* Best British Film: Scott and Sid (Scott Elliott and Sid Sadowskyj)\n* Best Comedy: The More You Ignore Me\n* Best Breakthrough Performance: Justin Clarke (The Intent 2: The Come Up)\n* Best Feature Film: Gloves Off\n* Best Producer: Kristian Brodie (Beast)\n* Best Film Distribution Company: Evolutionary Films\n* Best Film Production Company: Carnaby International\n2018\n* Best Actress: Alice Lowe (Prevenge)\n* Best Newcomer: Daniel Kaluuya (Get Out)\n* Best Supporting Actress: Jane Asher (Brian Pern: A Tribute)\n* Best Supporting Actor: Robert Webb (Back)\n* Best Drama: A Caribbean Dream\n* Best TV Drama Series: ''The Cuckoo's Calling\n* Best Thriller: Redwood\n* Best Foreign Language Film: Mersal\n* Best Action: Jawbone\n* Best Independent Film: Rise of the Footsoldier 3\n* Best Screenplay: Oliver Veysey (Access All Areas)\n* Best Documentary: The Moving Theatre\n* Best British Film: Kingsman: The Golden Circle\n* Best Actor: Craig Fairbrass (Rise of the Footsoldier 3)\n* Best Comedy: Brian Pern: A Tribute\n* Best Breakthrough Performance: Johnny Harris ( Jawbone)\n* Best Director: Matthew Vaughn (Kingsman: The Golden Circle)\n* Best International Film: Get Out\n* Global Contribution to Motion Picture: Tom Cruise\n* Lifetime Achievement Award: Anna Sher\n2017\n* Best International Film: American Honey\n* Best Actor: Steven Brandon (My Feral Heart)\n* Best Actress: Kate Dickie (Couple in a Hole)\n* Best Breakthrough Performance in a Film: Jonathan Readwin (Stoner Express)\n* Best Newcomer: Avin Manshadi\n* Best Supporting Actress: Terry Pheto (A United Kingdom)\n* Best Supporting Actor: Arnold Oceng (Brotherhood)\n* Best Comedy: David Brent: Life on the Road\n* Best Action: Brotherhood\n* Best Drama: I, Daniel Blake\n* Best Independent Feature: The Fall of the Krays\n* Best Documentary: Britain's Billionaire Immigrants\n* Best Thriller: Plan Z\n* Best Screenplay: Andrea Arnold (American Honey)\n* Best Short Film: Beverley\n* Best British Film: A Street Cat Named Bob\n* Best Director: Dexter Fletcher (Eddie the Eagle)\n* Best Foreign Language Film: Neruda\n* Global Contribution to Motion Picture: Simon Pegg\n* Lifetime Achievement Award: Sir David Jason and Nicholas Lyndhurst\n2016\n* Best International Film: Kingsman: The Secret Service\n* Best Comedy: Man Up\n* Best Action: Chasing Robert Barker\n* Best Drama: A Reason to Leave\n* Best Independent Feature: Never Let Go\n* Best Documentary: The Hard Stop\n* Best Thriller: Dartmoor Killing\n* Best British Film: Rise of the Footsoldier II\n* Best Actor: Tom Hiddleston (High-Rise)\n* Best Actress: Nathalie Emmanuel (Furious 7)\n* Best Director: Stephen Fingleton (The Survivalist)\n* Best Screenplay: London Road\n* Best Breakthrough Performance in a Film: John Boyega (Star Wars: The Force Awakens)\n* Best Newcomer: Taron Egerton (Kingsman: The Secret Service)\n* Best Foreign Language Film: Son of Saul\n* Best Supporting Actress: Alexandra Evans (Redistributors)\n* Best Supporting Actor: Samuel L. Jackson (Kingsman: The Secret Service)\n* Best Short Film: Above\n* Global Contribution to Motion Picture: Samuel L. Jackson\n2015\n* Best Comedy: What We Did on Our Holiday\n* Best Action: The Guvnors\n* Best Drama: Belle\n* Best Independent Feature: Abducted\n* Best Documentary: Now: In The Wings On a World Stage\n* Best Thriller: Black Sea\n* Outstanding Achievement Award: Idris Elba\n* Best Actress: Sameena Jabeen Ahmed\n* Best Director: Amma Asante\n* Best Screenplay: Electricity\n* Best Newcomer: Harley Sylvester (The Guvnors)\n* Best Short Film: Echo\n* Best International Film: The Theory of Everything\n* Best Actor: Benedict Cumberbatch (The Imitation Game)\n* Best Breakthrough Performance: Gugu Mbatha-Raw (Belle'')\n* NFA Icon Award: Gemma Jones\nIn memoriam section\nDuring the ceremony, National Film Awards UK pauses to pay tribute to those in the industry who died over the previous twelve months, with a montage of images accompanied by music. In 2016 the legendary late actor Alan Rickman was honored.\nNational Film Academy Honorary Awards\nIn 2015, Dame Judi Dench was voted by Academy members to receive the Lifetime Achievement Award, whilst the 2016 recipient of the Lifetime Achievement Award was Dame Helen Mirren. David Jason and Nicholas Lyndhurst were awarded the 2017 Lifetime Achievement Award, Anna Sher the 2018 award, and Rowan Atkinson the 2021 award.\nCeremonies\n{| class=\"wikitable\"\n|-\n! Event\n! Date\n!\n|-\n| 1st\n|align=\"center\"| 31 March 2015\n|align=\"center\"|\n|-\n| 2nd\n|align=\"center\"| 31 March 2016\n|align=\"center\"|\n|-\n| 3rd\n|align=\"center\"| 29 March 2017\n|align=\"center\"|\n|-\n| 4th\n|align=\"center\"| 28 March 2018\n|align=\"center\"|\n|-\n| 5th\n|align=\"center\"| 27 March 2019\n|align=\"center\"|\n|-\n| 6th\n|align=\"center\"| 1 July 2021\n|align=\"center\"|\n|-\n| 8th\n|align=\"center\"| 4 July 2022\n|align=\"center\"|\n|-\n| 9th\n|align=\"center\"| 4 July 2023\n|align=\"center\"|\n|-\n| 10th\n|align=\"center\"| 3 July 2024\n|align=\"center\"|\n|-\n| 11th\n|align=\"center\"| 2 July 2025\n|align=\"center\"|\n|}\nSee also\n* National Film Academy\n* National Reality Television Awards\n* Daily Mail National Film Awards\n* British Academy Film Awards\nReferences\nExternal links\n* [http://www.nationalfilmawards.co.uk/ National Film Awards UK official website]"
    }
  ]
}