{
  "content": [
    {
      "type": "text",
      "text": "# National University of Agriculture\n\n| coordinates            =\n| campus                 = Sakété\n| language               = French\n| founder                =\n| president              =\n| director               =\n| chancellor             =\n| vice_chancellor        =\n| rector                 = Pr Gauthier Biaou\n| academic_staff         = 54\n| administrative_staff   = 82\n| students               = 750\n| undergrad              =\n| postgrad               =\n| doctoral               =\n| other_students         =\n| colors                 =\n| athletics              =\n| affiliations           =\n| website                = [https://www.una.bj/ www.una.bj]\n}}\nThe National University of Agriculture (UNA) is a public university in Benin. It was established in 2016 following decree no. 2016-638 of October 13, 2016, which created four national universities in the Republic of Benin.\nHistory\nIn 2016, the Government of Benin decided to create four national universities to alleviate existing ones and launch professional programs. Decree no. 2016-638 of October 13, 2016, was issued to establish four national universities in the Republic of Benin, including UNA. It currently features in the list of public universities in Benin.\nAcademic structure\nUNA comprises 9 schools offering professional training. It provides programs based on the license, master, and doctorate system, also known as the LMD system. These programs lead to degrees in professional license, master's, and doctoral studies. UNA also offers a research pathway through its doctoral school, the School of Agronomic Sciences and Water (EDSAE).\nSchools\nThe schools within UNA are distributed across different fields and locations:\n* School of Horticulture and Green Space Development (EHAEV) in Idigny\n* School of Management and Plant Production (EGPVS) in Idigny\n* School of Agricultural Machinery and Mechanical Construction (EMACoM) in Kétou\n* School of Agricultural Product Conservation and Transformation Techniques (ESTCTPA) in Sakété\n* School of Aquaculture in Adjohoun\n* School of Livestock Management and Operation Systems (EGESE) in Kétou\n* School of Forestry and Wood Engineering (EFIB) in Idigny\n* School of Agribusiness and Agricultural Policies (EAPA) in Porto-Novo\n* School of Rural Sociology and Agricultural Extension (ESRVA) in Porto-Novo\nAdmission\nOrganization\nSee also\n* National School of Biosciences and Applied Biotechnologies\nReferences"
    }
  ]
}