{
  "content": [
    {
      "type": "text",
      "text": "# National Olympic Committee of the German Democratic Republic\n\nThe National Olympic Committee of the German Democratic Republic () was the non-profit organization representing athletes from East Germany as well as the Soviet occupation sector of Berlin, i.e. East Berlin in the International Olympic Committee. The NOC GDR organized East Germany's and East Berlin's representatives at the Summer and Winter Olympic Games.\nHistory\nOn 22 April 1951, the National Olympic Committee for East Germany () was founded in Berlin's Red City Hall, but not recognized by the IOC, as the National Olympic Committee for Germany, founded in Bonn in September 1949, already existed. Kurt Edel was the founding president of the East German NOC. According to the statutes of the IOC and the West German claim to sole representation required by the Adenauer government, athletes from the GDR should only be allowed to participate in a German team under the leadership of the NOC for Germany, which the GDR authorities were still reluctant to oppose in 1952. After the resignation of Kurt Edel and new negotiations with Heinz Schöbel, the GDR's NOC was provisionally recognized by the IOC as an East German NOC at the 50th session on the condition that both German NOCs were a United Team of Germany for the 1956 Summer Olympics in Melbourne have to set up. For the formation of a joint team in Melbourne and at the Winter Games in Cortina d’Ampezzo in the same year, the NOC of the GDR together with the West German NOC for Germany received the Alberto Bonacossa trophy awarded by the IOC in 1958.\nThe East German NOC of the GDR was recognized by the IOC in 1965 at the session in Madrid as a representative for the GDR and East Berlin, but under the name Ostdeutsches NOK. It was not until the IOC session during the 1968 Summer Games, effective 1 November 1968, that it was decided that in future it would be called the GDR's NOC and would be allowed to compete under the GDR's anthem and flag.\nThe first general secretary of the NOC of the GDR was the worker sportsman Heinz Dose. The NOC was significantly shaped by its long-time President Manfred Ewald.\nIn view of the looming German reunification, a steering committee was formed, which met for the first time in Berlin on 9 July 1990. In the Schöneberg town hall there, the general assembly of the NOC of the FRG decided on 17 November 1990 the amendment to the statutes proposed by the steering committee to unite the two German NOCs. At the same time, the general assembly of the NOC of the GDR in the Rotes Rathaus in Berlin decided that its statute should lose its validity on 31 December 1990 and that no legal succession should take place. This was followed by a joint meeting of both German NOCs in the Reichstag in Berlin and the unification of the organizations in the NOC for Germany. Joachim Weiskopf was the last President of the National Olympic Committee of the GDR to receive the post of Vice President of the National Olympic Committee for Germany, which initially (until the end of 1993) had an office in Berlin-Wannsee.\nSee also\n* East Germany at the Olympics\nReferences"
    }
  ]
}