{
  "content": [
    {
      "type": "text",
      "text": "# National Revolutionary Police Force\n\n| logo              = Policía Nacional Revolucionaria.png\n| logocaption       =\n| badge             =\n| badgecaption      =\n| flag              = Patrulla 558 de Habana.jpg\n| flagcaption       = PNR car, a Peugeot 106, being cleaned.\n| commonname        =\n| abbreviation      = PNR\n| mottotranslated   =\n| formed            = 1959\n| employees         =\n| volunteers        =\n| budget            =\n| country           = Cuba\n| federal           =\n| map               =\n| legaljuris        =\n| governingbody     = Constitution of Cuba\n| governingbodyscnd =\n| police            = Yes\n| local             = footnote\n| overviewtype      =\n| overviewbody      =\n| headquarters      = Havana\n| hqlocmap          =\n| hqlocmappoptitle  =\n| unsworntype       =\n| unsworn           =\n| electeetype       =\n| minister1name     =\n| minister1pfo      =\n| parentagency      = Ministry of the InteriorCommittees for the Defense of the Revolution\n| child1agency      =\n| unittype          =\n| unitname          =\n| officetype        = Command\n| officename        =\n| footnotes         =\n| imagesize         =\n| hqlocleft         =\n| hqloctop          =\n}}\nThe National Revolutionary Police Force (, PNR) is law enforcement in Cuba, under the administration of the Cuban Ministry of the Interior. Article 65 of the Cuban Constitution states that \"defense of the socialist motherland is every Cuban's greatest honor and highest duty\". Conscription into either the armed forces or the national police force is compulsory for those over the age of 16. Conscripts have no choice to which service they are assigned.\nCrime rates in Cuba remain significantly lower than many other major nations worldwide, with Cuban police acting strongly against any crime, particularly in Havana. Fidel Castro commented in 1998 that \"the war against crime is also a war against the imperialist enemy\". Information on murder and rape crime statistics for the country have never been released by the government, but theft was estimated to be 6,531 cases in 1988, or 62 per 100,000 population.\nPrisons\nThe Cuban penal system contained 19,000 inmates in 1990, approximately 190 per 100,000. A major problem found within all of the different sources found about the Cuban jails is the sanitary part of the jails. It is difficult for the jails to keep things sanitary because running water in Cuba is limited. This makes the number of toilets and showers further restricted. The prisoners are given a towel, two bars of soap, and a tube of toothpaste that they must make last until the month is over in which they will then get a new set of everything to use.\nList of known prisons in Cuba:\n* Combinado del Este Men's Prison\n* Western Prison for Women\n* Canaleta prison\n* Villa Marista\nAdministration of the PNR\nAs with many countries, the PNR is under the control of the Ministry of the Interior, which in turn reports to the Council of State. The Ministry of the Interior is divided into three divisions: Security, Technical Operations, and Internal Order and Crime Prevention. The latter is further divided into corrections, fire protection, and policing. The PNR reports to this subdirectorate, and is responsible for uniform policing, criminal investigation, crime prevention, juvenile delinquency, and traffic control. The PNR conducts these activities across the 14 provinces of Cuba, each of which has its own police chief who reports to a central PNR command in Havana.\nWhile the Internal Order and Crime Prevention controls the PNR, which is responsible for day-to-day policing, the Security division of the Ministry of the Interior is responsible for crimes such as espionage, sabotage and offenses against state security. All these divisions of the Ministry of the Interior and the PNR have been closely associated with the Cuban Revolutionary Armed Forces since 1959, thus the police uses the model those used by the Police of Russia with military ranks.\nIn addition, the PNR is supported by the Committees for the Defense of the Revolution (CDR), a police intelligence auxiliary police organization using la guardia, a nightly neighborhood watch. The CDR also handle issues relating to water and energy conservation, pet inoculation, and public health.\nEquipment\nThe PNR have a wide range of police cars, the most common being the Soviet-made Lada 2107 and the Chinese-made Geely CK, the latter of which was introduced in 2009 to replace the older Soviet cars. Hyundai and new Lada Vestas were put into service in recent years. There are also a number of French-made Peugeot and Citroen cruisers, introduced in the late 1990s and early 2000s, but these are still vastly outnumbered by the Lada 2107s, which are ubiquitous throughout Cuba. They have utilised radio communications as well as a computer dispatching system since the 1990s, made possible by the increased investment in the PNR to cope with rising crime during the economic crisis after the fall of the Soviet Union. PNR officers are armed with a semi-automatic handgun (usually a Makarov PM or CZ-75) and a baton, and they \"may use necessary force to apprehend suspects and to defend their person or that of any other citizen\". They are not issued any other type of weapon.\nU.S. sanctions\nOn 30 July 2021, the PNR (as an entity), its director, Oscar Callejas Valcarce, and its Deputy Director, Eddy Sierra Arias, were added by the U.S. Department of the Treasury to its Specially Designated Nationals (SDN) list for the \"violent repression of protestors in Cuba\" during the July protests.\nNotes\n}}"
    }
  ]
}