{
  "content": [
    {
      "type": "text",
      "text": "# Natural Monument of Carenque\n\n| coords_ref =\n| area =\n| established = 1997\n| visitation_num =\n| visitation_year =\n| governing_body =\n| url =\n| child =\n| embedded =\n}}\nThe Natural Monument of Carenque is a natural monument in Belas, Sintra, Portugal. It contains more than one hundred dinosaur footprints and has one of the longest dinosaur tracks in Europe. The original footprints have been covered with soil after being molded onto latex, so the Monument has no pedagogical or tourist use.\nThe Pego Longo (Carenque) dinosaur footprint deposit was discovered in 1986 by two Geology students from the Faculty of Sciences of the University of Lisbon, Carlos Coke and Paulo Branquinho, in a deactivated quarry located southwest of Belas. However, it was named after the neighboring town of Carenque. This monument consists of a set of subcircular and tridactyl footprints containing one of the largest tracks in Europe, with an extension of approximately . It is possible to observe a fossil record with hundreds of dinosaur footprints from the beginning of the Upper Cretaceous on a track over , of 2 herbivorous four-legged dinosaurs and tridactyl ichnites, possibly of bipedal carnivores.\nIn this protected area, there is also the existence of the Necropolis of Carenque, which dates back to the Paleolithic period and the beginning of the Neolithic period.\nThis monument, namely most of the main trail, was in danger of being destroyed by the Lisbon Regional Circular Road (CREL). The solution was to open tunnels so as not to destroy the track.\nCriticism\nIn August 2020, António Galopim de Carvalho, a geologist and former director of the National Museum of Natural History and Science, Lisbon says he felt like “crying” the last time he was there because “it's turned into a dump. The native vegetation, wild, has been advancing and is destroying the slab, which is only 15 centimeters thick”. In 2000, the creation of a museum and interpretive center was approved by the Municipality of Sintra, but never got off the ground. Regarding the museum, Galopim de Carvalho says that “There was never any interest on the part of the last two mayors of Sintra to build the museum. They always received me with the greatest sympathy and consideration, but, concretely, they did nothing, even when I proposed that the work could be phased in successive years, and that partnerships be found”.\nBasílio Horta, Mayor of Sintra, says the City Hall doesn't have anything to do with it and proceeds telling that the land is private and that the monument depends on the state. Even so, the Mayor of Sintra says he is available to collaborate in the recovery, if requested by the State or by the landowner.\nThe Institute for Nature Conservation and Forests says that cleaning will be done by its technicians and coordinated by geology technicians “by the end of October.” In response to Público, ICNF stated the area was cleared “between the last half of December 2018 and the first half of January 2019”.\nReferences"
    }
  ]
}