{
  "content": [
    {
      "type": "text",
      "text": "# Natural Brown Prom Queen\n\n| prev_title = Athena\n| prev_year  = 2019\n| next_title = The BPM\n| next_year  = 2025\n| misc       =\n}}\nNatural Brown Prom Queen is the second album from Cincinnati-born singer-songwriter and violinist Brittney Parks under her stage name Sudan Archives. The album, released on September 9, 2022, by Stones Throw Records, received widespread acclaim from music critics, with many publications ranking it as one of the best albums of 2022.\nBackground\nShe had originally planned to call the album Homesick after her feelings of missing Cincinnati and her mom during the COVID-19 pandemic. The title of closing track \"#513\" is a reference to area code 513 which includes Cincinnati and that song also features writing and production work from Cincinnati rapper-producer Hi-Tek. Per Parks, the album's title references the project's allowing her to relive moments of her youth which she missed out on, saying she \"didn't go to my prom in high school, so the idea behind calling this album Natural Brown Prom Queen is to make it my homecoming\" where she \"can be my natural self and it feels like I've come full circle to embrace my roots.\"\nWriting and recording\nParks wrote and recorded the album in a home studio she built in her basement with her partner, the rapper Nocando. Parks was more heavily involved in the production process of the album. Due to most of her collaborators having to work remotely, they all had to send stems to her, enabling her to be \"the person overseeing all of the ideas. So I'd pick and choose what I like, and I get to manipulate it in any way that I want without anybody being there, being confused.\" During the process of creating \"Freakalizer\", Parks almost deleted the song out of frustration, but Nocando convinced her to save it after changing the arrangement.\nOpening track \"Home Maker\" has been described as a \"domestic reverie\" and takes sonic influence from neo soul, funk, and house. The title track, \"NBPQ (Topless)\", is an autobiographical track that addresses themes of race and colorism. \"ChevyS10\" was singled out for discussion by several critics, who variously described it as a \"psychedelic road trip anthem\", a \"six-minute electronica epic\", or a \"woozy escapist fantasy\". The track's sonic elements have been compared to G-funk and jazz, before culminating in a \"house-meets-afrobeat breakdown\"; its lyrics interpolate Tracy Chapman's \"Fast Car\".\nRelease\nNatural Brown Prom Queen was first announced July 6. In the announcement, the album was described as following Parks as she assumed the character of Britt, \"the girl next door from Cincinnati who drives around the city with the top down and shows up to high-school prom in a pink furry bikini with her thong hanging out her denim skirt.\" The album, \"fittingly\" named after a homecoming event, is all about home, both Cincinnati where Parks was born and raised as well as her adopted hometown of Los Angeles, and also features \"themes of race, womanhood, and the fiercely loyal, loving relationships at the heart of Sudan's life with her family, friends, and partner.\"\nPrior to the album's release, Parks released four singles: \"Home Maker\" released March 15, \"Selfish Soul\" released May 18, \"NBPQ (Topless)\" released June 29, and \"OMG Britt\" released September 7. All four singles also came with music videos: \"Home Maker\" was directed by Jocelyn Anquetil and sees Parks starting a pillow fight in a furniture store. \"Selfish Soul\" was directed by Trey Lyons and features Parks playing her violin while hanging upside down from a pole as well as standing on a roof and dancing in mud with her girlfriends. \"NBPQ (Topless)\", directed by Augusta YR, features Parks going through a series of outfit changes and surreal, colorful scenarios, and \"trippy\" visuals said to be \"reminiscent of David Lynch's take on Alice in Wonderland\". \"OMG Britt\", directed by Zach Sulak, finds the singer performing the song in a series of futuristic rooms where she also smashes her violin.\nLive\nParks made her television debut on the September 20 episode of The Late Show with Stephen Colbert, performing \"Selfish Soul\" with a backing band including bassist Growth Eternal and three backup singers, including Keiyaa.\nReception\n| MC = 89/100\n| rev1 =AllMusic\n| rev1score =\n| rev2 =Beats Per Minute\n| rev2score =85%\n| rev3 =Clash\n| rev3score =8/10\n| rev4 =DIY\n| rev4score =\n| rev5 =Exclaim!\n| rev5score =8/10\n| rev6 =The Guardian\n| rev6score =\n| rev7 =The Line of Best Fit\n| rev7score =8/10\n| rev8 =Paste\n| rev8score =7.6/10\n| rev9 =Pitchfork\n| rev9score =9.0/10\n| rev10 =The Daily Telegraph\n| rev10score =\n}}\nPitchfork called the album the best new music of the week.\nCritics acclaimed Parks for the versatility she displayed on Natural Brown Prom Queen. James Mellen of Clash described the album as a \"shapeshifting sonic endeavor\" that \"opens up dozens of auditory avenues\" for Parks, and lauded her for maintaining a cohesive and engaging experience across an album with such range. Kitty Empire of The Guardian concurred, describing Parks as \"keen to emphasize her range and primacy\". Exclaim!s Dave MacIntyre gave a more mixed review to the album's wide-ranging sound, opining that it was \"somewhat overstuffed with both tracks and ideas\", but nevertheless found the project to be a \"captivating glimpse into Sudan Archives' artistic palette\". Natural Brown Prom Queen was characterized as drawing from numerous musical genres, most prominently hip hop and R&B, but also electronic genres and African rhythmic traditions. Recurring themes identified on the album include self-preservation, love, and reflections on societal views of beauty.\nParks received praise for her vocal performances throughout the album, which ranged from soft and sensual singing to self-confident rapping. Andy Kellman of AllMusic also observed that she experimented more with her violin playing than she had on 2019's Athena, describing how some of Natural Brown Prom Queens tracks featured Parks using effects pedals to lend a bass- or guitar-like sound to her violin.\nAccolades\nAwards and nominations\n{| class=\"wikitable plainrowheaders\"\n|+ Natural Brown Prom Queen awards and nominations\n! scope=\"col\" | Year\n! scope=\"col\" | Organization\n! scope=\"col\" | Award\n! scope=\"col\" | Work\n! scope=\"col\" | Status\n! scope=\"col\" |\n|-\n! scope=\"row\" rowspan=\"4\" | 2023\n| rowspan=3 | Libera Awards\n| Best Breakthrough Artist/Release\n| Herself\n|\n|\n|-\n| Best R&B Record\n| Natural Brown Prom Queen\n|\n|\n|-\n| Marketing Genius\n| Herself\n|\n|\n|-\n| AIM Independent Music Awards\n| Best Independent Track\n| \"Selfish Soul\"\n|\n|\n|-\n! scope=\"row\" | 2024\n| AIM Independent Music Awards\n| Best Independent Remix\n| \"Freakalizer (The Egyptian Lover Remix)\"\n|\n|\n|}\nYear-end lists\n{| class=\"wikitable plainrowheaders sortable\"\n|+ Natural Brown Prom Queen on year-end lists\n! scope=\"col\" | Publication\n! scope=\"col\" |\n! scope=\"col\" |\n|-\n! scope=\"row\" | Complex\n| 19\n|\n|-\n! scope=\"row\" | Consequence\n| 8\n|\n|-\n! scope=\"row\" | Crack\n| 24\n|\n|-\n! scope=\"row\" | Exclaim!\n| 10\n|\n|-\n! scope=\"row\" | The New York Times(Jon Pareles)\n| 4\n|\n|-\n! scope=\"row\" | The New York Times(Lindsay Zoladz)\n| 8\n|\n|-\n! scope=\"row\" | Paste\n| 13\n|\n|-\n! scope=\"row\" | Pitchfork\n| 2\n|\n|-\n! scope=\"row\" | Robert Christgau\n| 66\n|\n|-\n! scope=\"row\" | Uncut\n| 33\n|\n|}\nTrack listing\nSudan Archives has writing credits on all tracks but 3 and 10, and producing credits on all tracks but 8. Ben Dickey has writing credits on all tracks but 3, 4, 10, and 13, and producing credits on all tracks but 10. Other writers and producers named below.\n| extra1       = Elias\n| length1      = 5:02\n| title2       = NBPQ (Topless)\n| writer2      =\n| extra2       =\n| length2      = 3:48\n| title3       = Is This Real? (Can You Hear Yourself?)\n| writer3      =\n| length3      = 0:42\n| title4       = Ciara\n| writer4      =\n| length4      = 3:35\n| title5       = Selfish Soul\n| writer5      = Dexter Story\n| length5      = 2:22\n| title6       = Loyal (EDD)\n| writer6      = Joel Robert Ford\n| extra6       = Ford\n| length6      = 2:27\n| title7       = OMG Britt\n| writer7      =\n| extra7       =\n| length7      = 2:52\n| title8       = ChevyS10\n| writer8      = Elias\n| extra8       = Elias\n| length8      = 6:10\n| title9       = Copycat (Broken Notions)\n| writer9      =\n| extra9       = Simon on the Moon\n| length9      = 2:26\n| title10      = It's Already Done\n| writer10     = Dwyane Eric Thomas Jr.\n| extra10      = MonoNeon\n| length10     = 1:08\n| title11      = Flue\n| writer11     = Hessman\n| extra11      = Simon on the Moon\n| length11     = 3:09\n| title12      = TDLY (Homegrown Land)\n| writer12     =\n| extra12      =\n| length12     = 2:57\n| title13      = Do Your Thing (Refreshing Springs)\n| writer13     = Richard Lawrence\n| length13     = 0:52\n| title14      = Freakalizer\n| writer14     =\n| extra14      = Hassan\n| length14     = 3:50\n| title15      = Homesick (Gorgeous & Arrogant)\n| length15     = 4:00\n| title16      = Milk Me\n| writer16     = James Harmon Stack\n| extra16      = Jim-E Stack\n| length16     = 2:57\n| title17      = Yellow Brick Road\n| writer17     = Steven Francell\n| length17     = 2:37\n| title18      = #513\n| writer18     =\n| extra18      = Hi-Tek\n| length18     = 2:44\n}}\nPersonnel\nMusicians\n* Sudan Archives – vocals, violin, drums, synthesizer, bass, keyboards, percussion\n* Ben Dickey – bass, drums, sound effects, synthesizer, keyboards, percussion\n* Simon on the Moon – bass, drums, bouzouki, keyboards, sound effects, synthesizer, zither, guitar\n* Andre Elias – bass, drums, guitar, synthesizer\n* Orlando Higginbottom – bass, drums, guitar, keyboards\n* Chris James – guitar, keyboards, bass\n* Nosaj Thing – synthesizer\n* Ahya Simone – harp\n* Brandon Woody – trumpet\n* Kafari – keyboards\n* Kesswa – backing vocals\n* Qur'an Shaheed – keyboards\n* Queens D. Light – vocals\n* Lafemmebear – drums, drum machine\n* Ciara Parks – spoken word\n* Dexter Story – bass\n* Cary Allison – synthesizer\n* Joel Ford – bass, drums, synthesizer\n* King Oliver – trumpet\n* JD Reid – drums, synthesizer\n* MonoNeon – bass, drums, keyboards\n* Reginald Parks – vocals\n* Silas Short – drum machine, guitar, percussion\n* Jackson Shepard – percussion, strings, synthesizer\n* Cheryl Ladd – spoken word\n* Richard Lawrence – synthesizer\n* Egyptian Lover – drum machine\n* Jim-E Stack – bass, drums, synthesizer\n* Steve Francell – guitar, keyboards, synthesizer\n* Hi-Tek – bass, drums, keyboards\nTechnical\n* Mike Bozzi – mastering engineer\n* Blue May – mixing engineer\n* Sudan Archives, Ben Dickey, Andre Elias, Matt Emonson, JD Reid, Dexter Story, Lafemmebear, Simon on the Moon, Joel Ford, Silas Short, Egyptian Lover, Jim-E Stack, Steve Francell, Hi-Tek – recording engineers\n* Ben Dickey, Andre Elias, Lafemmebear – programming\n* Wei Prior – artwork\nReferences"
    }
  ]
}