{
  "content": [
    {
      "type": "text",
      "text": "# Natwar Thakkar\n\n| birth_place        = Dahanu, Bombay Presidency, British India\n| death_date         =\n| death_place        = Guwahati, Assam\n| body_discovered    =\n| resting_place      =\n| resting_place_coordinates =\n| monuments          =\n| nationality        = Indian\n| other_names        =\n| citizenship        = Indian\n| education          =\n| alma_mater         =\n| occupation         = Philanthropist, social activist\n| years_active       =\n| era                =\n| employer           =\n| organization       = Nagaland Gandhi Ashram\n| known_for          = Social work in Nagaland\n| notable_works      =\n| style              =\n| movement           = Gandhian movement\n| opponents          =\n| boards             =\n| spouse             = Lentina Ao Thakkar\n| partner            =\n| children           =\n| parents            =\n| relatives          =\n| callsign           =\n| awards             = *Padma Shri (1999)\n*Indira Gandhi Award for National Integration (1994)\n*Jamnalal Bajaj Award (1987)\n*Karmayogi Award (2015)\n| website            =\n| signature          =\n| signature_alt      =\n| signature_size     =\n| footnotes          =\n}}\nNatwar Thakkar (1932 – 7 October 2018), popularly known as Natwar Bhai, was an Indian social worker who worked in  Nagaland. He came from Maharashtra but migrated to Nagaland for social work at the age of 23. He founded the Nagaland Gandhi Ashram at Chuchuyimlang village in the Mokokchung district of Nagaland. Because of his efforts to spread Gandhian philosophy in Nagaland and his social work, he was known as \"Nagaland's Gandhi\".\nEarly life\nThakkar was born in 1932 to a Gujarati-speaking family in the coastal Dahanu town of the then Bombay Presidency of British India (today part of the Palghar district of Maharashtra state). Inspired by Gandhian social reformer Kaka Kalelkar early in his life, Thakkar went to Nagaland, the North-Eastern state of India, at the age of 23 in 1955, desiring to foster \"goodwill and emotional integration through voluntary social service\" among the people of Nagaland, using Gandhian principles.\nWork\nThakkar established the \"Nagaland Gandhi Ashram\" in the Chuchuyimlang village in Nagaland in 1955. At that time, the Naga rebels and the Indian army were constantly at \"war\" and hence the militants considered any \"Indian\" as a \"spy\" and they warned villagers not to shelter or aid Thakkar. Thakkar assisted residents in \"various development and income generating activities\", including beekeeping, gur production, oil ghanis, a biogas plant, a mechanised carpentry workshop, and Khadi sales outlets. Apart from popularising Khadi, he has also started a vocational training centre for school drop-outs and physically disabled children.\nDuring his stay in Nagaland, he was attacked and threatened by insurgents several times and warned to leave the state. Jawaharlal Nehru, the then Prime Minister of India, had encouraged Thakkar to stay in the village and to continue his work; Nehru also allotted funds to promote his initiatives. Thakkar acted as an intermediary between the army and villagers and tried to strengthen bonds by personal talks and discussions. Villagers also appealed to militants not to harm Thakkar.\nDue to Thakkar's efforts, an extension centre of National Institute of Electronics and Information Technology was started in Chuchuyimlang village in 2006. It is a government-funded institute equipped with the latest technology. Acknowledging the efforts of Thakkar, villagers donated  of land to the \"Nagaland Gandhi Ashram\" for construction of the \"Mahatma Gandhi centre of Social Work (MGCSW)\". The Tata Institute of Social Sciences has shown interest in becoming associated with this institute.\nPersonal life\nThakkar married Naga Christian Lentina Ao in 1956. They had two daughters and one son.  Thakkar was rushed into a private hospital on 19 September 2018 due to complications in recovering from a fever.  He was admitted to an intensive care unit but his health later declined and he developed kidney failure and low blood pressure.  Thakkar died at the hospital in Guwahati, Assam at 7:10 am on 7 October 2018.   He was survived by his wife and children, who were at his bedside when he died.\nAwards\nThakkar was honoured with numerous awards, including:\n*Padma Shri Award (1999): India's 4th highest civilian award, awarded by the President of India.\n*Diwaliben Mehta Award (2001)\n*Jamnalal Bajaj Award (1987)\n*Indira Gandhi Award for National Integration (1994): It is an award accorded by Indian National Congress.\n*Meghalaya State Mahatma Gandhi Award (1996)\n*Karmayogi Award (2015): It is awarded by NGO My Home India. It was awarded to Thakkar by Bhartiya Janata Party President Amit Shah.\n*\"Lifetime Service to Naga People\" award (2009): A special award given by Chuchuyimlang village to Thakkar to honour his contribution for welfare of Naga people. Thakkar donated 100,000 Indian rupees of Award money to set up a senior citizens' retreat in the village.\n*Bhagwan Mahaveer Award for Community & Social Service in 2022.\nReferences\nSources\n*"
    }
  ]
}