{
  "content": [
    {
      "type": "text",
      "text": "# Naval warfare in the Winter War\n\nThe Winter War between Finland and the Soviet Union, from 30 November 1939 to 13 March 1940, included a small amount of naval warfare. Finland had coastal artillery batteries which took part in battles along its coast.\nThe navies\nNaval activity during the Winter War was low. The Baltic Sea began to freeze over by the end of December, which made the movement of warships very difficult; by mid-winter, only ice-breakers and submarines could still move. The other reason for low naval activity was the nature of Soviet Navy forces in the area. The Baltic Fleet was a provincial coastal defence force which did not have the training, logistical structure, or landing craft to undertake large-scale operations. Furthermore, the Soviet Navy was technologically inferior to the British Royal Navy and the German Kriegsmarine. Still, the Baltic Fleet was strong; it had two battleships, one heavy cruiser, almost 20 destroyers, 50 motor torpedo boats, 52 submarines and other vessels. The Soviets used naval bases in Paldiski, Tallinn and Liepāja in Estonia and Latvia for their attacks.\nThe Finnish Navy was a coast defense force with two coastal defence ships, five submarines, four gunboats, seven motor torpedo boats, one minelayer and six minesweepers. The two coastal defence ships,  and , were moved to the harbour in Turku where they were used to stiffen the air-defences. Their anti-aircraft guns knocked down one or two planes over the city, and the ships remained there for the rest of the war. Beside the coastal defense, the Finnish Navy also protected Åland islands and merchant vessels in the Baltic sea — only a minor part of the fleet could engage in offensive military action.\nFurthermore, the Soviet aircraft bombed Finnish vessels and harbours and dropped mines to seaways. Still, the Finnish merchant ship losses were low as only 5 ships were lost to Soviet action. However, the Second World War proved more costly for the Finnish merchant vessels as altogether 26 were lost due to hostile action in 1939 and 1940 — in addition to the Soviet actions the main causes for the losses were naval mines in the North Sea and the German U-boat attacks.\nCoastal artillery\nIn addition to its navy, Finland had coastal artillery batteries defending important harbours and naval bases along its coast. Most batteries were leftovers from the Russian period, the  gun being the most numerous, but Finland had modernized its old guns and installed a number of new batteries, the largest a  gun battery originally intended to block the Gulf of Finland to Soviet ships with the help of batteries on the Estonian side.\nThe first naval battle took place near the island of Russarö, five kilometers south of Hanko. On 1 December 1939, there were fair weather conditions and visibility was excellent. The Finns spotted the  and two destroyers. When the convoy was at a range of , the Finns opened fire with 234&nbsp;mm coastal guns. After five minutes firing by four coastal guns, the cruiser was damaged by near misses and retreated. The destroyers remained undamaged and Kirov was repaired in the naval base, but it lost 17 men and about 30 wounded. The Soviets had known the locations of the Finnish coastal batteries, but had been surprised as their effective range was much longer than expected. The coastal artillery was old-fashioned, but the Finns had managed to modernize and improve it.\nThe Soviet destroyers  and  attacked the Finnish lighthouse and fort at Utö on 14 December 1939. Finnish coastal artillery opened fire and after a short fight the destroyers withdrew with the help of a smoke screen. Poor visibility and the thick smoke initially convinced the Finns that one of the destroyers had been sunk by the coastal artillery fire.\nFinnish coastal forts near the Karelian Isthmus saw the most action. In addition to the support of the land troops, Soviet naval forces made repeated attacks against the forts during December 1939. Finnish forts were repeatedly shelled by the battleships (Marat and Oktyabrskaya Revoluciya) as well as by Soviet destroyers.\nThe coastal artillery had its greatest effect upon the land war. Naval batteries near the front were in well-protected fixed positions, and with a higher rate of fire and greater accuracy than the army's field artillery, and helped steady the defence of the Karelian Isthmus in conjunction with army artillery. In March 1940, as the Soviets had broken through the front, all reserves were thrown into the fighting near Viipuri. The Soviets tried to cross the ice of the Gulf of Viipuri and come up behind the city, but the Finnish coastal artillery fired their heaviest guns, breaking the ice under the Soviets and preventing a clean breakthrough.\nSoviet blockade\nThe Soviet Union declared blockade on the Finnish coast and guarded this blockade with naval aviation and submarines. Initially, Soviet submarines followed prize rules, but as this type of operation did not yield any results, the Soviet Union declared a 20 mile exclusion zone near the Finnish coast and warned neutral ships to stay away from it. However, the submarine campaign was not particularly successful and was cut short by the harsh winter. During the Winter War, the Soviet submarines sank a total of five merchant ships: one Estonian (Kassari), two German (Reinbeck and Bolheim), one Swedish (Fenris), and one Finnish (Wilpas).\nFour other Finnish freighters were lost when Soviet Air Force bombed the Finnish ports. One Finnish auxiliary anti-submarine ship, , sank on 13 January 1940, while escorting a convoy in the Sea of Åland, near Märket Island, in action against the Soviet submarine ShCh-324. The Soviet unit had fired two torpedoes at the convoy, missing its target; during  the counterattack, a depth charge thrower misfired and the depth charge exploded while still onboard, sinking the Finnish escort. The Aura II was the only Finnish warship lost in the war. The Soviet Baltic Fleet lost submarine  during the blockade. After ice formation prevented submarine operations, the Soviet blockade was based solely on aircraft patrols and the mines dropped from the aircraft.\nSee also\n* Gulf of Finland campaign, 1944 to 1945\n* Baltic Sea Campaigns (1939–1945)\nReferences\nCitations\nBibliography\n*"
    }
  ]
}