{
  "content": [
    {
      "type": "text",
      "text": "# Nazca culture\n\ntooth, shell and hair]]\nThe Nazca culture (also Nasca) was the archaeological culture that flourished from  beside the arid, southern coast of Peru in the river valleys of the Rio Grande de Nazca drainage and the Ica Valley. Strongly influenced by the preceding Paracas culture, which was known for extremely complex textiles, the Nazca produced an array of crafts and technologies such as ceramics, textiles, and geoglyphs.\nThey are known for two extensive construction projects that would have required the coordination of large groups of laborers: the Nazca Lines, immense designs in the desert whose purpose is unknown, and puquios, underground aqueducts for providing water for irrigation and domestic purposes in the arid environment, several dozen of which still function today. The Nazca Province in the Ica Region was named for this people.\nHistory\nTime frame\nNazca society developed during the Early Intermediate Period and is generally divided into the Proto Nazca (phase 1, 100 BC &nbsp;– 1 AD), the Early Nazca (phases 2–4, 1–450 AD), Middle Nazca (phase 5, 450–550 AD) and Late Nazca (phases 6–7, 550–750 AD) cultures.\nDecline and fall of the civilization\nFrom 500 AD, the civilization started to decline and by 750 AD the civilization had fallen completely. This is thought to have occurred when an El Niño triggered widespread and destructive flooding. Evidence also suggests that the Nazca people may have exacerbated the effects of these floods by gradually cutting down  Prosopis pallida trees to make room for maize and cotton agriculture. These trees play an extremely important role as the ecological keystone of this landscape: in particular preventing river and wind erosion. Gradual removal of trees would have exposed the landscape to the effects of climate perturbations such as  El Niño, leading to erosion and leaving irrigation systems high and dry.\nSociety\nSocial structure\nEarly Nazca society was made up of local chiefdoms and regional centers of power that developed around Cahuachi, a non-urban ceremonial site of earthwork mounds and plazas. Scholars have developed theories resulting from various excavations at Cahuachi. They suggest that this site was the center for rituals and feasting relating to agriculture, water, and fertility.\nCahuachi lies in the lower portion of the Nazca Valley and was initially occupied during the late Paracas phase. It is unique among all other Nazca sites in the region, and it is the most important site for the study of ancient Nazca culture. The people modified the natural huacas (hills) into pyramid mounds for ceremonial and religious purposes.\n)]]\nExcavations at Cahuachi have given archaeologists key insights into the culture. The material remains found at the site included large amounts of polychrome pottery, plain and fancy textiles, trace amounts of gold and spondylus shells, and an array of ritual paraphernalia. The remains of pottery found at Cahuachi led archaeologists to believe that the site was specifically non-urban and ceremonial in nature. The ratio of plain, utilitarian pottery to fine, polychrome pottery was 30% to 70%. If it was an urban center, the proportion of utilitarian ceramics would have probably been higher. Among the foodstuffs found were the Three Sisters: maize, squash, and beans; as well as peanuts, and some fish.\nConstruction at Cahuachi ceased.  It appears that Cahuachi was abandoned at the very end of Nazca 3/early Nazca 4. Although there are many possible reasons for the collapse of Cahuachi, most scholars believe that the cessation of ceremonial use of the site is associated with the pan-Andean drought. Later (post-Cahuachi) Nazca society was structured in a similar fashion as before, but there was less emphasis on constructing large architectural complexes such as those at Cahuachi.\nReligion\nLikely related to the arid and extreme nature of the environment, Nazca religious beliefs were based upon agriculture and fertility. Much of Nazca art depicts powerful nature gods, such as the killer whale, the harvesters, the mythical spotted cat, the serpentine creature and, the most prevalent of worshiped figures, the anthropomorphic mythical being. Much as in the contemporary Moche culture based in northwest Peru. Shamans apparently used hallucinogenic drugs, such as extractions from the 'San Pedro cactus' (Echinopsis pachanoi), to induce visions. The use of such substances is also depicted in art found on pottery related to the Nazca. Religious events and ceremonies took place in Cahuachi. The people worshiped the nature gods to aid in the growth of agriculture.\n]]\nDuring this time, all members of the society in surrounding villages would migrate to the center and participate in feasting as well. Non-elites could obtain highly valued goods, such as fancy polychrome pottery, through feasting. In exchange, the elites could enhance their political power and status while co-opting the commoners into labor and construction of the site.\nTrophy heads\nThe Nazca used severed heads, known as trophy heads, in various religious rituals and appear as a motif in ceramic iconography. Visual depictions of decapitations often associate the decapitators with weapons and military-like dress, but such garments could have been worn in purely ceremonial circumstances as well.\nThe term 'trophy head' was coined by archaeologist Max Uhle, who considered the depiction of severed heads in ancient Peruvian art to correspond to trophies of warfare. Researchers noted that all the heads had one modification in common: a hole in the forehead through which a rope could be affixed, presumably so that the severed head can be displayed or carried. This detail contributed to the consensus that these were trophy heads. Other common modifications were the base of the skull being broken and thorns closing the mouth. Over 100 of the heads that have been discovered were mummified, which is unique to the Nazca and the preceding Paracas Culture.\nMany burials of Nazca individuals are what is known as 'partial burials'. Partial burials typically include bundles of limbs, caches of severed heads, or bodies that are missing several parts. Several burials have been discovered in which the head of the skeleton is missing and is replaced with what is most commonly referred to as a 'head jar'. The head jar is a ceramic vessel with a human head painted on it, along with trees and plants sprouting from the head which is known as the Sprouting Head motif. The actual appearance of the head jars can vary majorly with some having the appearance of trophy heads and others potentially be a portrait of the person buried there.\nEarly Nazca period ceramics indicate that the initial purpose of trophy heads may have been related to agriculture, with iconography, such as the Sprouting Head, showing trophy heads and plants growing and some of the plants were in the shape of the trophy heads. The burial of the heads suggests that the trophy heads may have been from Nazca people and not from other people. During the Middle Nazca period, the number of severed heads appeared to have increased, this may be due to the pan-Andean drought. In the late Nazca period, the number of trophy heads reaches its peak with the skulls having an increase in damage to the skull when compared to previous periods. During the Middle Nazca period, the number of severed heads appeared to have increased dramatically, judging from the remains. In the late Nazca period, the number tapered off, although the practice of decapitation remained popular in this period. Late Nazca iconography suggests that the prestige of the leaders of Late Nazca society was enhanced by successful headhunting.\nEconomy\n(Lima, Peru)]]\nNazca subsistence was based largely on agriculture. Iconography on ceramics and excavated remains indicate that the Nazca people had a varied diet, composed of maize, squash, sweet potato, manioc and achira, and a small trace of various fish. They also used several non-food crops, such as cotton for textiles, coca, San Pedro cactus, and gourds.  The latter were decorated to illustrate activities in daily life.\nThe evidence of coca in society can be seen through remains but also in designs on ceramics. Similarly, the hallucinogenic San Pedro cactus has been illustrated in ceremonies on several polychrome pots and bowls. In terms of animal resources, the Nazca made sacrifices of llamas and guinea pigs at Cahuachi. Llamas were also commonly exploited as pack animals, shorn for their wool, and consumed as a source of meat.\nBased on archaeological evidence, sometime during the Middle Nazca period, the Nazca people created an aqueduct system to sustain life in the exceedingly arid environment. The exact date of construction of the puquios has been debated for some time. Dating of the puquios is quite difficult because of the materials involved in their construction. Attempts at dating the trenches have also been difficult as the puquios were found by excavation. This destroyed the early context by which their dates might have been interpreted.\nThe most promising techniques used to date them thus far has been the AMS (accelerator mass spectrometry) analysis of varnish that has collected on the rocks inside the puquios, as well as the study of settlement patterns in the area. These techniques have placed the original construction of the puquios at the Middle Nazca period, as indicated above.\nThe irrigation system was made up of underground channels, known as puquios, which tapped into the subsurface water. The channels were dug into the mountainside until they reached the aquifers under the surface. The channels were lined with river rocks. They did not use any mortar so that the water would pass into the channels. The water was transported to irrigation canals (acequias) in order to directly supply water for agricultural purposes, or the water was deposited into small reservoirs (kochas) for later domestic use. Numerous access holes or ojos (eyes) were placed along the surface of the underground channels and operated much in the same way that modern manholes do. People would descend into the puquios in order to clear obstructions or make repairs.\nIt is difficult to tell how long these underground channels are because extant puquios have been altered. Many of the puquios are too dangerous to explore underground. The length of the puquios are estimated by measuring the distances covered between the related ojos.\nMany of the channels remain in use to this day. This also testifies to their importance to generations of ancient people in the arid environment. With modern use, people have altered the puquios to be used more efficiently, including installing motorized pumps.  In some cases, the kochas have been lined with concrete in order to hold the water better. Some of the best-preserved channels are those located in Cantalloc.\nArts and technology\nPottery\n]]\nThe Nazca culture is characterized by its polychrome pottery, painted with at least 12 distinct colors. The shift from post-fire resin painting to pre-fire slip painting marked the end of Paracas-style pottery and the beginning of Nazca-style pottery. The amount of pottery produced by the Nazca people is greater when compared to the preceding Paracas culture. A potential reason for this is due to the relatively lesser amount of time required to produce pottery when compared to textiles, which the Paracas favored.\nThe use of pre-fire slip painting meant that artisans experimented to learn which slips produced certain colors. Major pottery shapes include double-spout bottles, bowls, cups, vases, effigy forms, and mythical creatures. Archaeologists have excavated highly valued polychrome pottery among all classes of Nazca society, illustrating that it was not just the elite that had access to them. Commoners were able to obtain these goods through feasting and pilgrimages to Cahuachi. This distribution of pottery was useful in spreading the ruling class's culture. In addition, clays matching the chemical signature of polychrome pottery found all over the Southern Nazca Region have been found near Cahuachi. However, there is no substantial evidence of pottery production at Cahuachi. The site was most likely a redistribution center for ceramics.\nThe Nazca pottery sequence has been divided into nine phases. Visual depictions found on pottery from Phase 1 (also called Proto-Nazca) incorporated realistic subject matter such as fruits, plants, people, and animals. An indicator of the phase is the pottery having motifs cut into the pottery, much like the preceding Paracas-style pottery, but using slip painting instead of resin painting. Realism increased in importance in the following three phases (2, 3, 4) referred to as the Monumental phases. The pottery from these phases include renditions of their main subject matter against a bold red, black, or white background.\nIn the next phase, Nazca 5, considerable experimentation occurred, including the addition of rays, volutes, and other \"proliferous\" attachments to the supernatural motifs on the vessels. Phase 5 is called Transitional, since it bridges the change in style between the naturalism of Phases 2-4 and the proliferous elements added to the motifs in Phases 6 and 7. Nazca 5 also sees militaristic motifs becoming more common due to a drought causing conflict.\n]]\nNazca 6, and 7 include some of the earlier motifs but also emphasizes militaristic ones, suggesting a shift in social organization. The motifs in these phases include abstract elements as part of the design. Large numbers of rays and tassels are appended to many of the designs, particularly those depicting mythical subjects, producing a visual impression of almost infinitely multiplied elements, an impression which accounts for the use of the term 'proliferous'. Pottery art of Nazca phases 6 and 7 also displays influence from the Moche culture of north coastal Peru.\nFinally, during Nazca 8 disjointed figures and a geometric iconography was introduced that has been difficult to decipher. Phases 8 and 9 are now believed to date to the Middle Horizon. This period was one of a shift in power from the coast to the highlands with the advent of the Wari culture about 650 CE.\nThe Nazca, like all other Pre-Columbian societies in South America including the Inca, had no writing system, in contrast to the contemporary Maya of Mesoamerica. The iconography or symbols on their ceramics served as a means of communication. The motifs depicted on Nazca pottery fall into two major categories: sacred and profane. The Nazca believed in powerful nature spirits who were thought to control most aspects of life. The Nazca visualized these nature spirits in the form of mythical beings, creatures having a combination of human and animal/bird/fish characteristics, and painted them onto their pottery. These Mythical Beings include such varieties as the Anthropomorphic Mythical Being, Horrible Bird, Mythical Killer Whale, Spotted Cat, Feline Man and Rayed Face.\nScenes of warfare, decapitation, and the ritual use of human trophy heads by shamans were common motifs in Nazca pottery.\nTextiles\nNecropolis, 0-100 CE This is a \"double fish\" (probably sharks) design. Brooklyn Museum collections.]]\nThe Nazca are also known for their technically complex textiles. The textiles were most likely woven by women at habitation sites from spun cotton and wool. The textiles would have been made using a backstrap loom. This is similar to the way textiles are woven in the region today. Textiles were woven with the common motifs earlier than they appeared painted on pottery. The dry desert has preserved the textiles of both the Nazca and Paracas cultures, which comprise most of what is known about early textiles in the region.\nShawls, dresses, tunics, belts, and bags have been found through excavations at Cahuachi and elsewhere. Many textiles associated with the Nazca culture are garments that were included with grave goods found at burial sites. Almost every body found is wrapped (sometimes partially) in a textile as a part of burial ritual. These textiles are found with partial burials as well. Often piles of bones are found wrapped in a textile garment. The deposits of dresses and shawls contained both high-status garments (with feathers, painting, embroidery) and plain garments, suggesting different social roles or responsibilities.\nThe \"Paracas Textile\"  a beautifully preserved textile from the Early Intermediate period (300BC-100AD) is one of the finest textiles known. This textile, also known as BMT (Brooklyn Museum Textile), is in the collection of the Brooklyn Museum. The mantle measures 62x148 cm and it is worked in cotton and camelid fibers with several different techniques. The middle part is a very fine  gauze weave, most probably woven on a back-strap loom in a typical four-selvage web with both warp and weft made of cotton. This central web is patterned with 32 repeating rayed heads in six different colors. The coloring was achieved by the painstaking warp wrapping method, where the warp is covered in sections with dyed camelid fleece. The plain weave over the wrapped areas  create a double faced cloth, which are perfectly mirroring each other. The absolute symmetry of the design is broken on the long edges, where one side has extra spiral motifs and the other finished with stepped triangles. Folding the semitransparent cloth lengthwise would bring these edges together forming the stepped fret design, widely used element in both Andean and Meso-American designs. The three-dimensional edging is a colorful procession of 90 highly detailed colorful characters. The edging is worked in camelid yarn using the cross-knit looping method. Warriors or lords with war paraphernalia, women and shamans with the addition of two llamas are walking around the edge on a red band, which is attached to the central woven web with rhythmically repeated colored flowers. The backs and the fronts of the figures are mirror images, except for three figures. Besides the figures there is an abundance of vegetation represented, which is characteristic in Nasca textile works. The three-dimensional edging attached to the light weight midsection suggests that this mantel was never hang and most likely used laid out on the ground serving as a field for divination. Lois Martin who studied the mantel extensively suggests that perhaps it was used as a calendar to track the timing of rituals.\nMary Frame's extensive analysis of textiles from Cahuachi has revealed more about Nazca women. She noted that although the women are rarely recognized in the archaeological record, they had ready access to high-status materials and the right to wear sacred or potent imagery on their garments. This gave an indication of their status. A large portion of dresses were found portraying birds with speckled bodies, double-headed serpentine figures, and anthropomorphic figures.\nNazca Lines\nThe geoglyphs of Nazca or \"Nazca Lines\" are a series of geometric shapes, miles of lines, and large drawings of animal figures (some as large as a football field) constructed on the desert floor in the Nazca region. Many theories have arisen about the great geoglyphs. They are believed to have been constructed by large, coordinated work groups of numerous people over an extended period of time, indicating a complex culture that could organize such projects. Researchers have demonstrated techniques to explore how this was done.\nBy extending a rope between two posts and removing the red pebbles on the desert surface along the rope, the lines could be constructed. The contrast of the red desert pebbles and the lighter earth beneath would make the lines visible from a high altitude. Due to the simplistic construction of the geoglyphs, regular amounts of rainfall would have easily eroded the drawings, but the dry desert environment has preserved the lines for hundreds of years.\nThe purpose of the lines continues to be debated. Some researchers theorize they were created for the gods to look upon them from above, while others suggest they were some sort of calendar with astronomical alignments that would aid in planting and harvesting of crops. Others have thought the lines were the pathways for important ceremonial processions. The lines have been studied by experts from several disciplines. Anthropologists, archaeologists, and astronomers have all studied the lines, but have not found conclusive evidence for any of the theories as to purpose.\nTrephination and cranial manipulation\nTrephination was a primitive skull surgery used by the Nazca that relieved pressure on the brain from battle wounds or for ritual purposes. It entails the removal of one or more sections of bone from the skull (while the person is still alive). Evidence of trephination has been seen through the analysis of excavated skulls. Some of the skulls show signs of healing, evidence that the person had survived the operation.\nElongated skulls, as a result of skull manipulation, were also seen in the excavations from Cahuachi. This effect was achieved by binding a cushion to an infant's forehead and a board to the back of the head. Archaeologists can only speculate as to why this was done to some of the skulls. Several theories suggest skull manipulation created an ethnic identity, formed the individual into a social being, or may have illustrated social status.\nSome historic Native American cultures in North America also practiced such shaping of skulls, such as the Snake, Cowlitz and Chinook peoples, most of whom lived west of the Columbia River in the Pacific Northwest. They were informally known as the Flathead peoples.\nTropähenkopf Nazca Slg Ebnöther.jpg|Head trophy of the Nazca culture.\nKrieger mit Trophäenkopf Peru Nazca Slg Ebnöther.jpg|Representation of a warrior holding a trophy head.\nSee also\n*Wari Empire\n*Chincha civilization\nReferences\nBibliography\n*Local Differences and Time Differences in Nasca Pottery by Donald A. Proulx (1968) University of California Press\n*The Incas and their Ancestors: The Archaeology of Peru by Michael E. Moseley. 1992.\n*Cahuachi in the Ancient Nasca World Silverman, Helaine. University of Iowa Press. Iowa City. 1993.\n*\"The Archaeological Identification of an Ancient Peruvian Pilgrimage Center\" by Helaine Silverman, World Archaeology 26, no. 1 (June 1994): 1–18\n*\"Paracas in Nazca: New data on the Early Horizon Occupation of the Rio Grande de drainage, Peru\" Silverman, Helaine. (1994) Latin American Antiquity, Vol. 5, No. 4, pp.&nbsp;359–382.\n*Early Nasca Needlework by Alan R. (1996) Sawyer Laurence King.\n*Der Nasca-Ikonenkomplex: Seine mythischen Gestalten und ihre Entwicklung, erschlossen aus den Darstellungen gegenständlicher Bildwerke/Nasca Iconography. Its mythical Figures and their Evolution, established on the Basis of Pictorial Works, by Christiane Clados, Dissertation, Free University Berlin\n*The Nasca by Helaine Silverman and Donald A. Proulx. Blackwell Publishers. Malden. 2002.\n*Ancient Nazca Settlement and Society by Helaine Silverman (2002) University of Iowa Press\n*Irrigation and Society in the Peruvian Desert: The Puquios of Nasca by Katherine H. Schreiber, Josue Lancho Rojas, Lexington Books, Lanham, Maryland, 2003,\n*\"What the Women Were Wearing\" by Mary Frame, Textile Museum Journal (2003/04), Volume 42-43:13–53\n*\"Households, Crafts and Feasting in the Ancient Andes: The Village Context of Early Nasca Craft Consumption\" by Kevin J. Vaughn, Latin American Antiquity (2004), Volume 15, No. 1:61–88\n*\"Burial Patterns and Sociopolitical Organization in Nasca 5 Society\" by William Harris and Helaine Silverman, Andean Archaeology III (2006), Volume 3:374–400\n*\"A Compositional Perspective on the Origins of the Nasca Cult at Cahuachi\" by Kevin J. Vaughn, Journal of Archaeological Science (2007), Volume 34, Issue 5:814–822\n*The Ancient Nasca World New Insights from Science and Archaeology'' by Rosa Lasaponara, Nicola Masini, Giuseppe Orefici, Springer International Publishing, 2016,\nExternal links\n*[https://people.umass.edu/proulx/online_pubs/Nasca_Ceramic_Iconography_Overview.pdf \"Nasca Ceramic Iconography: An Overview\"] by Donald A. Proulx, University of Massachusetts, 2007. Color photos included.\n*[http://libmma.contentdm.oclc.org/cdm/compoundobject/collection/p15324coll10/id/35107 Ancient Peruvian ceramics: the Nathan Cummings collection by Alan R. Sawyer], an exhibition catalog from The Metropolitan Museum of Art (fully available online as PDF), which contains material on Nazca culture (see index)\n*[http://www.famsi.org/research/nasca/ Nasca drawings collection, introduction], professional drawings of Nazca artifacts, by Christiane Clados\n*[http://research.famsi.org/nazca/nazca_list.php?rowstart=0&_allSearch=&num_pages=&title=Nasca%20Drawing%20Collection&tab=nazca&num_pages=27 FAMSI Nasca drawings collection] 402 images"
    }
  ]
}