{
  "content": [
    {
      "type": "text",
      "text": "# NCI Froward Point\n\nNCI Froward Point is a National Coastwatch Institution (NCI) lookout station at Inner Froward Point, at the easterly side of the mouth of the River Dart, two miles by coastal path from Kingswear in Devon, England. Its twin duties are to maintain a daylight watch over the local coastal area and the South West Coast Path on whose route it lies. With some significant blind spots because of the coastline, NCI Froward Point covers the coastline from Start Point in the West towards Brixham in the East.\nOperational details\nThe area of operation has a mixed boating population of a fishing fleet, recreational yachtsmen, yacht racing fleets, small commercial passenger vessels, kayaks, canoes, military vessels, dinghy racing fleets, racing gigs, small boats and inflatables. Additionally, there are regular visits to the River Dart by passenger cruise liners. The high number of boating movements makes the mouth of the Dart and the surrounding headlands places of high risk.\nAlthough it is not involved in traffic management, NCI Froward Point can alert Falmouth Coastguard both to potential incidents and incidents in progress. NCI Froward Point works closely with HM Coastguard at Brixham, and the Dart Lifeboat, and is accredited with Declared Facility Status, which allows full participation on UK Search and Rescue incidents.\nThe Froward Point lookout became operational in July 2005, with planning from 2002. Two buildings of the Brownstone Battery complex, a World War II battery, are rented from the National Trust. As a part of the NCI UK registered charity, NCI Froward point is entirely supported by charitable donations.\nNCI Froward Point was featured in the ITV Southwest Regional Evening News programme on 14 February 2007 as a recognisable point on a featured walk.\nFacilities\nThe station maintains a listening watch using fixed and handheld Marine VHF radios on channels 0, 16 and 67, unless authorised to transmit by the Coastguard on a per-incident basis (pre 1 October 2014), and channel 65 for regular two-way traffic (post 1 October 2014). A pair of mounted telescopes, binoculars, a radar set and a weather station are present. The weather station updates the lookout's website with weather data regularly via a microwave link to a broadband connection as a real-time service to seafarers. A webcam, updating images at intervals, provides a visual check on sea state and weather.  With no mains electricity to the site, solar panels are used, and a diesel generator is run when necessary.\nThe lookout station maintains a visitor centre with information about both its operations and the Brownstone Battery itself.\nWildlife\nWhen not monitoring the surrounding area for people at risk, watch keepers record sightings of seals, cetaceans and other wildlife for relevant wildlife organisations.\nIncidents\nNCI Froward Point has been involved in the following incidents:\n*13 Sep 2007 - Asked to assist Brixham Coastguard in locating disabled motor cruiser Jelly Bean. Located successfully.\n*27 Sep 2007 - Assisted Brixham Coastguard with locating MFV Jose Jacqueline, reported to be in danger.\n*10 Feb 2007 - Initiated rescue of 5 metre RIB\n*20 Feb 2007 - Located 10 metre motor cruiser with mechanical failure and conned Dart Harbour and Navigation Authority vessel to the casualty\n*21 August 2007 - Assisted Brixham Coastguard with yacht Stay Free taking in water.\n*24 Nov 2007 - Initiated rescue of small high speed inflatable. Sole occupant was hypothermic when rescued by the Dart Lifeboat\n*14 July 2008 - Initiated rescue of small open boat with engine failure near the Mewstone\n*20 June 2009 - Asked to assist Brixham Coastguard with a 19&nbsp;ft Dory with 5 on board, that had run out of fuel at the Homestone and had let off flares.\n*29 August 2009 - Initiated rescue of replica of Nelson's cutter.\n*4 May 2010 - Initiated alert for apparently unmanned drifting motor cruiser south of Mewstone.\n*27 April 2011 - Initiated ambulance assistance for walker in difficulties on the coast path.\n*3 August 2011 – Initiated assistance for dinghy on lee shore in Newfoundland Cove.\n*20 July 2013 - worked with Brixham Coastguard and NCI Prawle point to identify missing vessel suspected of being in difficulties off Start Point.\nReferences\nExternal links\n*[http://www.nci.org.uk/ National Coastwatch Institution official site]\n*[http://www.nci-frowardpoint.org.uk/ NCI Froward Point official site]"
    }
  ]
}