{
  "content": [
    {
      "type": "text",
      "text": "# Nebraska State Historical Society Building\n\n| locmapin = Nebraska#USA\n| built =\n| architect = Ellery L. Davis\n| builder = Olsson Construction\n| architecture = Moderne\n| added = August 21, 2003\n| area = Less than one acre\n| refnum = 03000797\n}}\nThe Nebraska State Historical Society Building is a two-story building on the campus of the University of Nebraska–Lincoln in Lincoln, Nebraska. Constructed in 1953, it houses the Nebraska State Historical Society and was added to the National Register of Historic Places in 2003.\nHistory\nThe Nebraska State Historical Society was founded in 1878 to \"encourage historical research and inquiry, spread historical information, and embrace alike aboriginal and modern history.\" After seventy-five years with its archives and offices spread across basements at the University of Nebraska and State Capitol, a permanent home for the organization was built in 1953 and named simply the \"Nebraska State Historical Society Building.\" The Nebraska Legislature approved a new tax levy to fund the building, which was built by Omaha-based Olsson Construction.\nThe building was designed in the Moderne style by Ellery L. Davis, who served as the lead architect for many university buildings of the early twentieth century and assisted in the design of Memorial Stadium. Its main entrance features a smooth, rounded limestone façade with horizontal window sections overlooking R Street.\nIt was added to the National Register of Historic Places on August 21, 2003. According to its NRHP listing, the building's \"almost harsh horizontal, rectangular configuration coupled with its stark coloring and lack of ornamentation may be seen to shadow elements of the Bauhaus and International styles, which in turn had borrowed from the Prairie style.\"\nIn the mid-2010s, the Nebraska State Historical Society Building was renovated to update its heating, ventilation, and air conditioning systems and ensure ADA compliance.\nLayout\nThe main rotunda is used as a display space (maintaining some elements from its use as a museum) with office, research, and archive space branching off throughout the rest of the first floor. The second floor of the building primarily serves as a viewing space, with some bookshelves used for library storage. The basement houses mechanical systems and office space.\nThe Historical Society's main archives are stored in a nearby, structurally separate building.\nReferences"
    }
  ]
}