{
  "content": [
    {
      "type": "text",
      "text": "# Nebraska State Historical Society\n\n| preceding1      = Nebraska State Historical Society\n| preceding2      = History Nebraska\n| preceding3      =\n| jurisdiction    = State of Nebraska\n| headquarters    = 1500 R Street, Lincoln, Nebraska\n| employees       =\n| budget          =\n| chief1_name     = Daryl Bohac\n| chief1_position = Director\n| parent_agency   =\n| website         = [https://history.nebraska.gov/ Nebraska State Historical Society (Official Site)]\n}}\nNebraska State Historical Society, formerly History Nebraska, is a Nebraska state agency, founded in 1878 to \"encourage historical research and inquiry, spread historical information ... and to embrace alike aboriginal and modern history.\"  It was designated a state institution in 1883, and upgraded to a state agency in 1994. The agency rebranded and announced their name change to History Nebraska on April 30, 2018. The agency returned to its original name of the Nebraska State Historical Society on September 3, 2024.\nThe agency's mission statement is \"[to] collect, preserve, and open to all, the histories we share.\" The agency developed a process for the return of human remains, burial objects and cultural items of 1,400 individuals in accordance with the Native American Graves Protection and Repatriation Act of 1990.\nState Historic Sites\nFacilities and operations of the society include:\n{|class=\"wikitable sortable\" style=\"width:100%\"\n! width=\"*\" |Site name\n! width=\"*\" class=\"unsortable\"|Image\n! width=\"*\" |Nearest city\n! width=\"*\" |County\n! width=\"*\" class=\"unsortable\"|Remarks\n|--\n|| Chimney Rock ||  || Bayard || Morrill || The formation served as a landmark along the Oregon Trail, the California Trail, and the Mormon Trail during the mid-19th century. The trails ran along the north side of the rock, which remains a visible landmark for modern travelers along U.S. Route 26 and Nebraska Highway 92.\n|--\n|| Fort Robinson ||  || Crawford || Dawes and Sioux || Former U.S. Army fort in the Pine Ridge region of northwest Nebraska. Fort Robinson played a major role in the Sioux Wars from 1876 to 1890. The Battle of Warbonnet Creek took place nearby in July 1876. Crazy Horse surrendered here with his band on May 6, 1877.\n|--\n|| John G. Neihardt State Historic Site ||  || Bancroft || Cuming || Features museum exhibits about Nebraska Poet Laureate John Neihardt. The one-room study that Neihardt used from 1911 through 1920 as the place where he wrote many of his works is preserved at the site, and also features the Sacred Hoop Prayer Garden, designed by Neihardt, and a library with materials about Neihardt's life and legacy.\n|--\n|| Museum of Nebraska History ||  || Lincoln || Lancaster|| The Society's headquarters features a library and archives, and administration and the research and publications operations of the Society. Located on the campus of University of Nebraska–Lincoln.\n|--\n|| Neligh Mill State Historic Site ||  || Neligh || Antelope|| Museum commemorating the importance of flour mills to Nebraska and the West as a whole. Exhibits relating to the operation of the mill and its history are located in the original warehouse from 1866, as well as the 1915 addition where the power plant was once housed. The Society has restored the mill's office building, which has original furnishings. It reconstructed the 1919 flume to the south. The remnants of the dam that collected water for the mill are still visible on the Elkhorn River nearby.\n|--\n|| Senator George Norris State Historic Site ||  || McCook || Red Willow|| Home of U.S. Senator George W. Norris (1862–1944), a Nebraska politician who championed the New Deal of the 1930s and the Rural Electrification Act.\n|--\n|| Thomas P. Kennard House ||  || Lincoln || Lancaster || Built in 1869, the Italianate house belonged to Thomas P. Kennard, the first Secretary of State for Nebraska, and one of three men who picked the Lincoln site for the new state's capital in 1867.\n|--\n|}\nNebraska State Historical Society also operates the Gerald R. Ford Conservation Center in Omaha.\nSee also\n* National Register of Historic Places listings in Nebraska\n* List of National Historic Landmarks in Nebraska\n* Nebraska Game and Parks Commission, manages several Nebraska State Historical Sites and Parks\nReferences\nExternal links\n* [http://history.nebraska.gov Official website]"
    }
  ]
}