{
  "content": [
    {
      "type": "text",
      "text": "# Nebula Awards Showcase 2009\n\nNebula Awards Showcase 2009 is an anthology of award winning science fiction short works edited by Ellen Datlow. It was first published in trade paperback by Roc/New American Library in April 2009.\nSummary\nThe book collects pieces that won or were nominated for the 2008 Nebula Award for novel, novella, novelette, short story and script, a profiles of 2008 Grand Master winner Michael Moorcock and Author Emeritus Ardath Mayhar, and a representative early story by the former, and the three Rhysling and Dwarf Stars Award-winning poems for 2007, together with various other nonfiction pieces and bibliographical material related to the awards and an introduction by the editor. The Best Novel winner is represented by an excerpt. Not all nominees for the various awards are included.\nContents\n*\"Introduction\" (Ellen Datlow)\n*\"About The Science Fiction and Fantasy Writers of America\" [essay]\n*\"About the Nebula Awards\" [essay]\n*\"The 2008 Nebula Awards Final Ballot\" [essay]\n*\"The Merchant and the Alchemist's Gate\" [Best Novelette winner, 2008] (Ted Chiang)\n*\"Always\" [Best Short Story winner, 2008] (Karen Joy Fowler)\n*\"Where the Sidewalk Ends\" [essay] (Barry N. Malzberg)\n*\"Why I Write Science Fiction\" [essay] (Kathleen Ann Goonan)\n*\"Titanium Mike Saves the Day\" [Best Short Story nominee, 2008] (David D. Levine)\n*\"Pol Pot's Beautiful Daughter (Fantasy)\" [Best Novelette Nominee, 2008] (Geoff Ryman)\n*''The Yiddish Policeman's Union'' (excerpt) [Best Novel Winner, 2008] (Michael Chabon)\n*\"About the Rhysling Award\" [essay]\n*\"Last Unicorn\" [Dwarf Stars Award winner, 2007] (Jane Yolen)\n*\"The Graven Idol's Godheart\" [Rhysling Award for Best Short Poem, 2007] (Rich Ristow)\n*\"The Journey to Kailash\" [Rhysling Award for Best Long Poem, 2007] (Mike Allen)\n*\"Stars Seen Through Stone\" [Best Novella nominee, 2008] (Lucius Shepard)\n*\"What You Saw Was What you Got: The Year in Films\" [essay] (Howard Waldrop)\n*\"Pan's Labyrinth: Dreaming with Eyes Wide Open\" [essay] (Tim Lucas)\n*\"The Evolution of Trickster Stories Among the Dogs of North Park After the Change\" [Best Novelette nominee, 2008] (Kij Johnson)\n*\"About the Damon Knight Grand Master Award\" [essay]\n*\"An Appreciation of Michael Moorcock\" [essay] (Kim Newman)\n*\"The Pleasure Garden of Felipe Sagittarius\" [short story] (Michael Moorcock)\n*\"The Andre Norton Award\" [essay]\n*\"The New Golden Age: The Rise of Young Adult Science Fiction and Fantasy\" [essay] (Gwenda Bond)\n*\"Clubbing\" [essay] (Ellen Asher)\n*\"Captive Girl\" [Best Short Story nominee, 2008] (Jennifer Pelland)\n*\"Unique Chicken Goes in Reverse\" [Best Short Story nominee, 2008] (Andy Duncan)\n*\"Fountain of Age\" [Best Novella winner, 2008] (Nancy Kress)\n*\"Past Nebula Award Winners\" [essay]\n*\"The Authors Emeriti\" [essay]\n*\"Ardath Mayhar, Talent from the Pines\" [essay] (Joe R. Lansdale)\n*\"About the Editor\" [essay]\nReception\nPaul Kincaid, writing for the SF Site, finds \"an uneasy awareness\" in the anthology of the Nebula Awards' \"shift in focus\" since the Science Fiction Writers of America became the Science Fiction and Fantasy Writers of America. After exploring how the various pieces in it straddle or stretch the genres of science fiction and fantasy, he concludes \"maybe this eliding of genre boundaries is no bad thing. ... Maybe all we are seeing here is a necessary breaking down of artificial divisions in fiction, writers more freely exploring what the fantastic in its broadest terms allows them to. Whatever, this latest volume in a very long-running series, continues to mark not just the best of the genre at one particular moment, but also, perhaps, the direction in which the genre is moving.\" The contributions by Chiang, Fowler, Duncan, Johnson, Shepard, Kress, Pelland and Levine are all discussed in some depth.\nThe anthology was also reviewed by Norman L. Rubenstein in Cemetery Dance no. 63, 2010.\nNotes"
    }
  ]
}