{
  "content": [
    {
      "type": "text",
      "text": "# Nebula Awards Showcase 2008\n\nNebula Awards Showcase 2008 is an anthology of award winning science fiction short works edited by Ben Bova. It was first published in trade paperback by Roc/New American Library in April 2008.\nSummary\nThe book collects pieces that won or were nominated for the 2007 Nebula Award for novel, novella, novelette and short story, a profile of 2007 Grand Master winner James Gunn and a representative early story by him, and the three Rhysling and Dwarf Stars Award-winning poems for 2006, together with various other nonfiction pieces and bibliographical material related to the awards and an introduction by the editor. The Best Novel winner is represented by an excerpt. Not all nominees for the various awards are included.\nContents\n*\"Introduction\" (Ben Bova)\n*\"Echo\" [Best Short Story winner, 2007] (Elizabeth Hand)\n*\"Burn\" [Best Novella winner, 2007] (James Patrick Kelly)\n*\"The Books That Saved SFWA\" [essay] (Bud Webster)\n*\"Two Hearts\" [Best Novelette winner, 2007] (Peter S. Beagle)\n*\"Science Fiction Poetry\" [essay] (Joe Haldeman)\n*\"The Strip Search\" [Rhysling Award for Short Poem winner, 2006] (Mike Allen)\n*\"The Tin Men\" [Rhysling Award for Long Poem winner, 2006] (Kendall Evans and David C. Kopaska-Merkel)\n*\"Knowledge Of\" [Dwarf Stars Award winner, 2006] (Ruth Berman)\n*\"The State of Amazing, Astounding, Fantastic Fiction in the Twenty-First Century\" [essay] (Orson Scott Card)\n*\"The Woman in Schrödinger's Wave Equations\" [Best Short Story nominee, 2007] (Eugene Mirabelli)\n*\"James Gunn, Grand Master\" [essay] (John Kessel)\n*\"The Listeners\" [novelette] (James Gunn)\n*\"Howl's Moving Castle: Book to Film\" [essay] (Diana Wynne Jones)\n*Seeker (excerpt) [Best Novel winner, 2007] (Jack McDevitt)\n*\"I Have Seen the Future and It Ain't Got a Lot of Dead Trees In It\" [essay] (Mike Resnick)\n*\"The Andre Norton Award: Magic or Madness\" [essay] (Justine Larbalestier)\nReception\nAuthor John Walters, comparing the 2008 Showcase to that from 2011, was \"immediately struck by the differences,\" with the former skimping on the stories that were nominated but did not win and devoting almost half the book to \"other material,\" while the latter is \"full of stories ... all the short story and novelette award nominees, and the winning novella.\" He prefers the latter approach, concluding that \"[t]he Nebula Awards volumes should be for new nominated stories and a minimum of other essays and filler,\" and is \"very thankful that the new publishers have gone back to concentrating on the nominated fiction.\" He discusses each of the newer, nominated and winning stories in turn. He finds Hand's story \"pretty, poetic, but undistinguished ... a fine read, but lone survivor stories have been done many times before and I wasn't sure why this one stood out as the best story of the year.\" Kelly's story he deems a disparaging response to Henry David Thoreau's Walden that demonstrates the author \"didn’t understand what Thoreau was trying to do,\" though he calls it \"[a] fine story, well told as far as it goes, and if Kelly hadn't made the remarks he did at the beginning none of it would have bothered me.\" Beagle's story he calls \"a classic fantasy tale, well told,\" noting that it is a sequel to the author's now-classic novel 'The Last Unicorn'. He finds Mirabelli's piece, \"[t]he only nominated non-winner presented in the volume ... a well-told story; in fact, I liked it better than [Hand's] story that won the award, but it’s not science fiction.  It’s a character study of a man studying physics and of his girlfriends.\" Walters then turns briefly to this \"other material,\" declining to \"comment on the essays other than to say that they were interesting but the space should have been filled with stories instead.\" He feels the winning novel excerpt \"a waste of space too; this is where a short essay could have served a useful purpose, if the author could have briefly written about how he came to write the novel.\" James Gunn's grand master story he recalls \"fondly from reading it years before\" but notes it is \"available in plenty of anthologies and didn’t need to be reprinted here.\"\nThe anthology was also reviewed by Gary K. Wolfe in Locus no. 569, June 2008.\nNotes"
    }
  ]
}