{
  "content": [
    {
      "type": "text",
      "text": "# Nebula Awards Showcase 2004\n\nNebula Awards Showcase 2004 is an anthology of award-winning science fiction short works edited by Vonda N. McIntyre. It was first published in trade paperback by Roc/New American Library in March 2004.\nSummary\nThe book collects pieces that won or were nominated for the Nebula Awards for best novel, novella, novelette and short story for the year 2003, tributes to recently deceased author and SWFA founder Damon Knight, profiles of 2003 grand master winner Ursula K. Le Guin and 2003 Author Emeritus Katherine MacLean, with representative pieces by both, and various other nonfiction pieces related to the awards, together with an introduction by the editor. Not all nominees for the various awards are included, and the best novel is represented by an excerpt. Each story is prefaced with a short introduction by its author.\nContents\n*\"Introduction: The Heart of the Nebula\" (Vonda N. McIntyre)\n*\"Bronte's Egg\" [Best Novella winner, 2003] (Richard Chwedyk)\n*\"Hell Is the Absence of God\" [Best Novelette winner, 2003] (Ted Chiang)\n*\"Remembering Damon Knight\"\n**\"Damon Knight\" [essay] (Frederik Pohl)\n**\"Damon\" [essay] (Carol Emshwiller)\n**\"I Remember Damon\" [essay] (James Gunn)\n**\"Damon Knight the Teacher\" [essay] (Robin Wilson)\n**\"Oh You Kid! A Personal View of Damon Knight\" [essay] (Edward Bryant)\n**\"Curious Damon Knight\" [essay] (Eileen Gunn)\n**\"Sensei Wonder\" [essay] (Leslie What)\n*American Gods (excerpt) [Best Novel winner, 2003] (Neil Gaiman)\n*\"Sunday Night Yams at Minnie and Earl's\" [Best Novella nominee, 2003] (Adam-Troy Castro)\n*\"A Few Things I Know about Ursula\" [essay] (Molly Gloss)\n*Changing Planes (excerpt from the collection) [short fiction] (Ursula K. Le Guin)\n*\"Nothing Ever Happens in Rock City\" [Best Short Story nominee, 2003] (Jack McDevitt)\n*\"Cut\" [Best Short Story nominee] (Megan Lindholm)\n*\"The Dog Said Bow-Wow\" [Best Short Story nominee, 2003] (Michael Swanwick)\n*\"Appreciating Katherine MacLean\" [essay] (Sharon Lee)\n*\"Games\" [short story] (Katherine MacLean)\n*\"Lobsters\" [Best Novelette nominee, 2003] (Charles Stross)\n*\"Creature\" [Best Short Story winner, 2003] (Carol Emshwiller)\n*\"2003 Final Nebula Ballot\"\n*\"Past Nebula Awards Winners\"\nReception\nMichael M. Jones, writing in Chronicle, calls the anthology \"a perfect book to pick up\" if \"you really want to see what the SF field itself thinks best represents its efforts in a year.\" After noting the story contents briefly, he calls attention to \"the various introductions written for each story by the authors, and the assorted essays touching upon relevant topics\" as \"[a]dding to the qualities of this book,\" highlighting those honoring LeGuin, Knight and MacLean.\nThe book was also reviewed by Edward Carmien in SFRA Review no. 270, 2004.\nNotes"
    }
  ]
}