{
  "content": [
    {
      "type": "text",
      "text": "# Nebula Awards Showcase 2014\n\nNebula Awards Showcase 2014 is an anthology of science fiction short works edited by Kij Johnson. It was first published in trade paperback by Pyr in May 2014.\nSummary\nThe book collects pieces that won or were nominated for the Nebula Awards for best novel, novella, novelette and short story for the year 2012 (presented in 2013), as well as the novel that won the Andre Norton Award for that year, tributes to 2012 Damon Knight Memorial Grand Master Award winner Gene Wolfe, and an early story by him, nonfiction pieces related to the awards, and the three Rhysling and Dwarf Stars Award-winning poems for 2012, together with an introduction by the editor. The pieces winning the Best Novel and Andre Norton awards are represented by excerpts. Not all nominees for the various awards are included.\nContents\n*\"Introduction\" (Kij Johnson)\n*\"About the Science Fiction and Fantasy Writers of America\"\n*\"About the Nebula Awards\"\n*\"2012 Nebula Awards Final Ballot\"\n*\"Immersion\" [Best Short Story winner, 2012] (Aliette de Bodard)\n*\"Close Encounters\" [Best Novelette winner, 2012] (Andy Duncan)\n*\"After the Fall, Before the Fall, During the Fall\" [Best Novella winner, 2012] (Nancy Kress)\n*\"Excerpt from 2312\" [Best Novel winner, 2012] (Kim Stanley Robinson)\n*\"The Bookmaking Habits of Select Species\" [Best Short Story nominee, 2012] (Ken Liu)\n*\"Excerpt from Fair Coin [Andre Norton Award winner, 2012] (E. C. Myers)\n*\"Five Ways to Fall in Love on Planet Porcelain\" [Best Short Story nominee, 2012] (Cat Rambo)\n*\"About the Damon Knight Memorial Grand Master Award\"\n*\"Gene Wolfe\" [essay] (Michael Dirda)\n*\"How to Read Gene Wolfe\" [essay] (Neil Gaiman)\n*\"Damon Knight Memorial Grand Master: Gene Wolfe\"\n*\"Christmas Inn\" [novelette] (Gene Wolfe)\n*\"About the Rhysling Awards\"\n*\"The Library, After\" [Rhysling Award for Best Short Poem, 2012] (Shira Lipkin)\n*\"The Curator Speaks in the Department of Dead Languages\" [Rhysling Award for Best Long Poem, 2012] (Megan Arkenberg)\n*\"Blue Rose Buddha\" [Dwarf Stars Award, 2012] (Marge Simon)\n*\"Past Nebula Award Winners\"\n*\"About the Editor\"\nReception\nPublishers Weekly calls the book a \"delectable anthology fittingly honor[ing] the most recent Nebula Award recipients.\" While noting that some of the pieces \"are a bit derivative, readers will still find a large measure of enjoyment in them,\"Fans, honorees, and readers new to speculative fiction will greatly appreciate these works.\" Individual works commented on include those of Kim Stanley Robinson, Nancy Kress, Andy Duncan, Grand Master recipient Gene Wolfe, E.C. Myers, and the Rhysling Award–winning poems.\nReviewed on: 03/17/2014\nRelease date: 05/13/2014\nGlenn Dallas in the San Francisco Book Review'' praises the anthology's \"impressively weird, thought-provoking, and challenging reads, as well as some singularly engaging poetry and a marvelous tribute to Gene Wolfe,\" as well as de Bodard's \"wonderful story 'Immersion,'\" which he counts among \"a few unexpected surprises.\" Overall, however, the book \"left me a little cold\" and that while \"[t]he Nebula Awards exemplify the finest traditions of speculative fiction ... this particular showcase underwhelms.\" In particular he criticizes how Nancy Kress's novella \"dominates nearly a third of the book,\" and deems \"that space would've been better served by offering glimpses of a few more nominees in order to give a greater sense of the year’s accomplishments, trends, and aspirations.\"\nRyder Miller in the Portland Book Review, in contrast, characterizes the book as a \"wonderful collection of stories ... about the future, adventures in space, and alien invasions [showing] that it is still possible to evoke awe and wonder, even for those who have read many of these stories before.\" He feels it \"requires a slow and thoughtful read, as it covers a lot of territory. It was nice to see so much galactic science fiction this year, since in recent years the collections have been more satisfying for the fantasy reader.\" Individual works commented on include those of Kress and Robinson.\nNotes"
    }
  ]
}