{
  "content": [
    {
      "type": "text",
      "text": "# Nebula Awards 22\n\nNebula Awards 22 is an anthology of award winning science fiction short works edited by George Zebrowski, the third of three successive volumes under his editorship. It was first published in hardcover and trade paperback by Harcourt Brace Jovanovich in April 1988.\nSummary\nThe book collects pieces that won or were nominated for the Nebula Awards for novella, novelette and short story for the year 1987 and various nonfiction pieces related to the awards, together with an essay by 1987 Grand Master award winner Isaac Asimov, the two Rhysling Award-winning poems for 1986, a couple other pieces, and an introduction by the editor. Not all nominees for the various awards are included.\nContents\n*\"Introduction\" (George Zebrowski)\n*\"1986, Reduced from 2000\" [essay] (Algis Budrys)\n*\"Robot Dreams\" [Best Short Story nominee, 1987] (Isaac Asimov)\n*\"Seven Steps to Grand Master\" [essay] (Isaac Asimov)\n*\"Tangents\" [Best Short Story winner, 1987] (Greg Bear)\n*\"Surviving\" [Best Novelette nominee, 1987] (Judith Moffett)\n*\"The Girl Who Fell into the Sky\" [Best Novelette winner, 1987] (Kate Wilhelm)\n*\"Listening to Brahms\" [Best Novelette nominee, 1987] (Suzy McKee Charnas)\n*\"R & R\" [Best Novella winner, 1987] (Lucius Shepard)\n*\"Salvage\" [novelette] (Orson Scott Card)\n*\"Newton Sleep\" [Best Novella nominee, 1987] (Gregory Benford)\n*\"Rhysling Poetry Award Winners\" [essay] (George Zebrowski)\n*\"The Neighbor's Wife\" [Rhysling Award Short Poem winner, 1986] (Susan Palwick)\n*\"Shipwrecked on Destiny Five\" [Rhysling Award Long Poem winner, 1986] (Andrew Joron)\n*\"Science Fiction Movies of 1986\" [essay] (Bill Warren)\nReception\nJim Creighton of the St. Louis Post-Dispatch, reviewing the book along with another Zebrowsky-edited anthology, Paper Synergy no. 2, wrote \"The annual collections of Nebula Award winners ... are always great, and this year's edition is made even more notable by the presence of Lucius Shepard's brilliant novella 'R & R.'\" He also cited the Bear and Wilhelm pieces as \"highly deserving prize winners.\" The pieces by current Grand Master Asimov (described as \"wry\") and Card were singled out for particular mention as well, though Creighton laments the omission of \"[m]y own favorite novelette [of Card's], \"Hatrack River.\" He noted that \"[t]he only problem is that anyone who's really interested in science fiction has probably encountered most of the stories two or three times before ... some first appeared more than two years ago and have already been reprinted several times. If you haven't read them before, though, you have a treat in store.\" Paper Synergy was found \"not as outstanding as the Nebula collection (naturally enough), [though] an all-new and extremely interesting package.\" His conclusion: \"[d]ouble applause for Zebrowski.\"\nThe anthology was also reviewed by Tom Easton in Analog Science Fiction/Science Fact v. 108, no. 13, Mid-December, 1988.\nAwards\nThe book placed twenty-sixth in the 1989 Locus Poll Award for Best Anthology.\nNotes"
    }
  ]
}