{
  "content": [
    {
      "type": "text",
      "text": "# Negasonic Teenage Warhead\n\n| supports       =\n| aliases        = Warhead, Megasonic Endless Godhead\n| powers         = * Superhuman strength, speed, durability, agility, balance and reflexes\n* Telekinesis\n** Flight\n* Telepathy\n** Precognition\n* Reality Selection\n** Future life power acquisition\nCurrent:\n* Portal manipulation\n** Pocket dimension\nPrevious:\n* Reality manipulation\n** Matter and energy manipulation\n*** Transmutation\n* Power blasts\n* Cosmic hunger\n** Time manipulation\n** Size alteration\n** Power cosmic\n| cat            =\n| subcat         =\n| hero           =\n| villain        =\n| sortkey        = Negasonic Teenage Warhead\n}}\nNegasonic Teenage Warhead (Eloise Olivia \"Ellie\" Phimister) is a superheroine appearing in American comic books published by Marvel Comics. Created by Grant Morrison and Frank Quitely, the character first appeared in New X-Men'' #115 (2001). She is named after the song \"Negasonic Teenage Warhead\" by Monster Magnet. She belongs to a subspecies of humans called mutants, who are born with superhuman abilities. Negasonic Teenage Warhead's appearance and powers were eventually altered in the comics to match her appearance in the Deadpool films with the third one set in the Marvel Cinematic Universe, in which she was portrayed by Brianna Hildebrand.\nPublication history\nNegasonic Teenage Warhead first appeared in New X-Men #115 (2001), and was created by writer Grant Morrison and artist Frank Quitely.\nNegasonic Teenage Warhead's Infinity Series comics #44 - #49, originally released in 2022, were collected and re-printed as a solo comic in November 2024.\nFictional character biography\n'' #13 (April 2006). Art by John Cassaday.]]\nEllie Phimister was a Genoshan teenager and a student of Emma Frost's telepathy class. She experiences a vision of a massacre on Genosha shortly before Cassandra Nova's Wild Sentinels appear and kill her and 16 million people. Frost survives due to her secondary mutation activating and transforming her into diamond, and retrieves Ellie's corpse.\nIllusion\nAn illusionary version of Negasonic Teenage Warhead created by Frost later appears as a member of the Hellfire Club.\nNecrosha\nIn Necrosha, Selene and Eli Bard temporarily resurrect Negasonic Teenage Warhead and other mutants using the Transmode Virus. Unlike other resurrected mutants, Ellie does not fall under Selene's control. She was presumed killed along with the other dead mutants when the Black Queen absorbed their souls or died again after Selene was slain.\nMarvel Now!\nIn Marvel Now!, Ellie resurfaced sometime later, alive and well, having begun a mundane life in Albuquerque. Deadpool and the Mercs for Money capture her at the behest of an organization called Umbral Dynamics, unaware that the group intends to siphon her power into the Presence. After her rescue and the defeat of Presence, Negasonic Teenage Warhead adopts a new punk-inspired look and joins Domino's incarnation of the Mercs for Money alongside Hit-Monkey.\nNegasonic Teenage Warhead later inadvertently creates an alternate timeline where the conflict between the Inhumans and X-Men never ended. After Deadpool is mortally wounded, Negasonic travels back in time to avert the timeline.\nNegasonic is the only one of the Mercs to remain in Deadpool's employ after his defection to Hydra during Secret Empire and subsequent memory wipe after The Despicable Deadpool, helping him run a new business called \"Deadpool, Gun/Swords for Hire\".\nAfter the Krakoan Age ended and Ellie left the island community long before its dissolution. She went back to partnering up with the now amnesiac Wade Wilson with his merc service while contemplating the harrowing nature of relationships due to her future sight powers. Until she receives a vision regarding an improbable pan-dimensional infraction of calamitous proportions revolving around her people skills and mingling issues that'll result in the destruction of all reality. She is soon confronted by the Time Variance Authority in regards to said matter, due to her dating life evidently being a grave danger to the entire space-time continuum, as they are slating her for erasure and existential replacement to avert said same devastation. The cross-reality Armageddon is derailed thanks to associates Eloise could rely on; that being Emma Frost, Jean Grey, Wanda Maximoff, Tabitha Smith, Susan Storm, and Deadpool himself, all of whom acted to delay the time police to avert Ellie's becoming a Galactus-lite entity whose presence threatens to destroy existence if she passes over meeting a potential love interest and fellow mutant by the name of Yuki Ohara to avert such a crisis.\nPowers and abilities\nEllie possesses superhuman strength, speed, durability and reflexes. She is able to overpower a host of skilled, military, or uniquely trained mercenaries in hand-to-hand combat, as well as showcasing superhuman physical prowess beyond the norm, battling the likes of Scorpia and Titania. She can read the thoughts of others and project her own with her telepathic abilities. She possesses precognitive abilities. She is the only person aware that Proteus has possessed Destiny and she shows her precognitive abilities, announcing to Selene the imminent return of her victorious inner circle. Ellie showcased a host of new abilities, creating a house and home for herself out of thin air with her thoughts. She has the ability to harness, generate, and absorb radioactive energy into herself, allowing her to achieve feats such as fabricating objects out of thin air like clothes or shelter and levitating people or objects with her mind.\nIt is later revealed that Ellie's newfound power stems from an ability to manipulate reality at a quantum level. In an alternate dystopian future, Negasonic used her powers to alter the Terrigen Mist to make it harmless to mutants. Further exhibitions of her power include rearranging matter and energy into different shapes and forms at will, such as morphing Jack Chain's Darkforce binds into butterflies, changing Inferno's fire into flaming monkeys, mentally disassembling Domino's and Gorilla-Man's guns, and creating energy duplicates of herself at will. More on how this nuanced ability works is further elaborated upon after the end of Krakoa. Wherein it is shown that Eloise's real power enables the acquisition and integration of predestined variant's of her future selves powers and abilities. This is tied to her precognitive capabilities, and as the futures change, so too do the nature of various powers she can acquire. Essentially, she changes out skills picked up by swapping one possible future iteration for another with each shift.\nReception\nAccolades\n* In 2017, Comic Book Resources (CBR) ranked Negasonic Teenage Warhead 15th in their \"15 Most Important Women in Deadpool’s Life\" list.\n* In 2020, Scary Mommy included Negasonic Teenage Warhead in their \"Looking For A Role Model? These 195+ Marvel Female Characters Are Truly Heroic\" list.\n* In 2022, The A.V. Club ranked Negasonic Teenage Warhead 99th in their \"100 best Marvel characters\" list.\n* In 2022, CBR ranked Negasonic Teenage Warhead 8th in their \"Gorr The God-Butcher And 9 Other Over-The-Top Names Comics Fans Love\" list.\nIn other media\nas Negasonic Teenage Warhead in Deadpool.]]\nFilm\n* Negasonic Teenage Warhead appears in Deadpool (2016), portrayed by Brianna Hildebrand. This version is an X-Men trainee who possesses Cannonball's ability to create high-impact kinetic charges. This change was made after 20th Century Fox and Marvel Studios struck a deal to allow the latter to use Ego the Living Planet in the film Guardians of the Galaxy Vol. 2.\n* Negasonic Teenage Warhead appears in Deadpool 2, portrayed again by Brianna Hildebrand. She has become a full member of the X-Men and entered a relationship with Yukio.\n* Negasonic Teenage Warhead appears in Deadpool & Wolverine, portrayed again by Brianna Hildebrand.\nVideo games\n* Negasonic Teenage Warhead appears as a playable character in Marvel: Future Fight.\n* Negasonic Teenage Warhead appears as a playable character in Marvel Strike Force.\n* Negasonic Teenage Warhead appears in Marvel Puzzle Quest.\n* Negasonic Teenage Warhead appears in Marvel Snap.\n* Negasonic Teenage Warhead appears as a playable character in Marvel Contest of Champions.\nReferences\nExternal links\n*"
    }
  ]
}