{
  "content": [
    {
      "type": "text",
      "text": "# Nelia, Queensland\n\n| pop                 =\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4823\n| timezone            = AEST\n| utc                 = +10:00\n| lga                 = Shire of McKinlay\n| stategov            = Traeger\n| fedgov              = Kennedy\n| elevation           =\n| maxtemp             =\n| mintemp             =\n| rainfall            =\n| dist1               = 51\n| dir1                = E\n| location1           = Julia Creek\n| dist2               = 308\n| dir2                = E\n| location2           = Mount Isa\n| dist3               = 1648\n| dir3                = NW\n| location3           = Brisbane\n}}\nNelia is an outback town in the locality of Julia Creek in the Shire of Mckinlay, Queensland, Australia.\nGeography\nThe town is just north off the Flinders Highway,  north west of the state capital, Brisbane.\nThe Inlander rail service from Townsville to Mount Isa on the Great Northern railway passes through Nelia, which is served by Nelia railway siding ().\nHistory\nThe area was named by explorer William Landsborough after a friend of his wife. European settlement began in the 1870s with the establishment of the Willibah and Benannee runs.\nNelia Post Office opened on 23 June 1909 (a receiving office had been open from 1908).\nA townsite was surveyed in 1912 and the first land sales took place in 1913.\nNelia State School opened on 4 May 1926 and closed in 1932. It reopened in 1953 and closed permanently in 1960.\nAn artesian bore was constructed in 1928 to provide water to the town. Due to not following government advice, the bore flowed suddenly and dramatically sending water in all directions.\nThe post office celebrated its centenary in 2009.\nIn February 2019 flooding damaged the railway line, resulting in the derailment of a Pacific National freight train with 81 wagons at Nelia. A  rail deviation was constructed around the derailment.\nAmenities\nThe Nelia branch of the Queensland Country Women's Association has its rooms at the QCWA Hall at 4 Main Street.\nEducation\nThere are no schools in Nelia. The nearest government primary school is in the town of Julia Creek. The nearest government secondary school is in Richmond ( to the east, but it only offers education to Year 10. The nearest government secondary schools offering education to Year 12 are in Cloncurry ( to the west) and in Hughenden ( to the east). Distance eductation and boarding schools are other secondary schooling options.\nReferences\nExternal links\n*"
    }
  ]
}