{
  "content": [
    {
      "type": "text",
      "text": "# Nelson Memorial, Swarland\n\n]]\nThe Nelson Memorial, Swarland is a white freestone obelisk at Swarland in north Northumberland, England. Erected in 1807, two years after the death of Horatio Nelson, 1st Viscount Nelson, victor of the Battle of Trafalgar, it was placed by his friend and sometime agent, Alexander Davison, who owned an estate centred on the now demolished Swarland Hall. It is a Grade II listed monument.\nThis relatively obscure memorial stands by the old A1 (the great road between Morpeth and Alnwick, according to an 1868 gazetteer).\nDavison made his fortune in the late 18th century after travelling to Quebec, where he met and became a friend of the 24-year-old Nelson, who was commanding HMS Albemarle, which was docked at Quebec City during the War of American Independence. Later in life, Nelson engaged Davison as an agent to represent him at naval tribunals dealing with the distribution of the spoils of battle.\nThe obelisk is not the only Nelson memorial at Swarland. A line of trees on the estate represents the Nile delta, whilst other groups of trees represent the positions of French and British ships engaged in the Battle of the Nile.\nThere are three inscriptions on the monument; from top to bottom:\n*England expects every man to do his duty\n*Victory 21 October 1805 (the date referring to the Battle of Trafalgar)\n*Not to Commemorate the Public Virtues and Heroic Achievements of Nelson, which is the duty of England; But to the Memory of Private Friendship, this erection is dedicated by Alexander Davison, Swarland Hall\nThe erection of the memorial arguably represented the zenith of Davison's social standing; he was imprisoned for a year for fraud in 1808, and never recovered his position.\nIn contemporary times, the memorial has become obscure since the course of the road changed when the A1 passing Swarland was converted to a dual carriageway. Davison's obelisk lies on the old A1, used only by local traffic, hidden from the main road by a stand of trees.\nCarved onto the face of the obelisk are two Ordnance Survey bench marks, and on the south side is Ordnance Survey flush bracket number 1973.  Maps indicate the height of the flush bracket as 117 metres above sea level. The stonemason's name is carved on the top of the plinth on the north side.\nThe monument and site was restored by the local authorities, and a plaque erected, in about 2003.\nReferences\nExternal links\n*[https://web.archive.org/web/20040521060514/http://www.smithsonianmag.com/smithsonian/issues04/feb04/pdf/nelson.pdf Lord Nelson: Hero and...Cad!] Article in the Smithsonian Magazine, by Michael Ryan, touching on the Nelson - Davison relationship, in the context of Nelson's adulterous affair with Emma Hamilton (PDF)\n*[http://www.nmm.ac.uk/memorials/Memorial.cfm?Banner=3&MemorialPage=3&MemorialID=M4322 Maritime Monument listing] for M4322, the Obelisk at Swarland."
    }
  ]
}