{
  "content": [
    {
      "type": "text",
      "text": "# Nelson W. Ward\n\n|death_date=\n|birth_place= Columbiana County, Ohio, US\n|death_place= Long Beach, California, US\n|image=ArmyMoH 1862-95X.jpg\n|caption=Medal of Honor, 1862–1895 Army version\n|nickname=\n|allegiance= United StatesUnion\n|branch= United States ArmyUnion Army\n|serviceyears= 1861 – 1865\n|rank= Quartermaster Sergeant\n|commands=\n|unit= Company M, 11th Pennsylvania Cavalry\n|battles= American Civil WarBattle of Staunton River Bridge\n|awards= Medal of Honor\n|laterwork=\n}}\nNelson W. Ward (November 20, 1837 – February 5, 1929) was a United States Army Medal of Honor recipient, honored for his actions while a private in the 11th Pennsylvania Cavalry during the Battle of Staunton River Bridge of the American Civil War.  He also was the author of one book.\nBiography\nWard was born in Columbiana County, Ohio, on November 20, 1837. He was married to Emily \"Emma\" Jane Hall on September 14, 1865. The couple moved to Greene County, Missouri shortly after their marriage. Nelson and Emma had two children: Joseph Edgar, born September 22, 1866; and Virginia, born 1869.\nIn the late 1890s, he bought the Grundie Hotel in Springfield, Missouri, which he operated until about 1904. In the early 1900s, his family moved to Long Beach, California, where he lived for the rest of his life.\nWard published the book, '' 'The Master Key' to the Problems of Passion Week and the Resurrection According to the Scriptures'' in 1915.\nHis first wife, Emma, died on September 9, 1916, in Long Beach. He married Minnie Zurada Souder between Emma's death and 1920.\nMilitary service\nWard enlisted in the 11th Pennsylvania Cavalry on August 5, 1861, and eventually attained the rank of Quartermaster Sergeant in that regiment. He received the Medal of Honor for his actions at the Battle of Staunton River Bridge on June 25, 1864.  Ward led a charge from land without meaningful cover onto a railroad bridge that was secured on both sides by Confederate troops.  Although his commanding officer had been killed, he led a successful assault of the bridge despite the Union forces suffering heavy casualties.\nMedal of Honor citation\nCitation:\nVoluntarily took part in a charge; went alone in front of his regiment under a heavy fire to secure the body of his captain, who had been killed in the action.\nSee also\n*List of Medal of Honor recipients\nReferences\n:"
    }
  ]
}