{
  "content": [
    {
      "type": "text",
      "text": "# Neo-medieval music__disambig_1\n\nNeo-medieval music is a modern popular music characterized by elements of medieval music and early music in general. Music styles within neo-medieval music vary from authentic performance interpretations of medieval music (understood as classical music) to crossover genres that blend medieval instruments, such as bagpipe, shawm and hurdy-gurdy with electronic music and rock. In many cases, it is more or less overlapping with styles such as folk rock, British folk rock and neofolk.\nBands specializing in neo-medieval music are particularly plentiful in Germany, although the genre also enjoys some popularity in North America, the Czech Republic, the Netherlands, France, the United Kingdom, Italy, and Scandinavia.\nHistory\n16th–19th centuries\nThough there is some scholarly disagreement about the extent to which a revival and study of medieval music existed in the 16th and 17th centuries, studies from the late 18th and early 19th century show comprehensive efforts to come to terms with various forms of medieval music. German scholar Martin Gerbert wrote a study De cantu et musica sacra on medieval ecclesiastical music in 1774, followed shortly by the volume of histories General History of Music written by Charles Burney between 1776-1789 and the Essai sur la musique ancienne et moderne by composer Jean-Benjamin de La Borde in 1780. Activity increased in the 19th century with the beginning of the academic discipline of musicology, while in 1814 French musician and music historian Francois-Louis Perne “attempted a complete transcription of a polyphonic mass for the first time”. Edmond de Couseemaker would publish a monograph of medieval music in 1852, and Richard Wagner’s music would further increase interest in musical medievalism.\n20th–21st centuries\n16th-19th century studies of medieval music were largely academic and historicist, in that they attempted to understand medieval music as it would have been played rather than to reinterpret it. In the 20th century, medieval music would find expression in both authentic performance and crossover interpretations. Discussing the increased interest in medieval music in the 20th century, German musicologist Annette Kreutziger-Herr suggests many contributing factors: Post-romanticism, the music of Wagner, a rise in folk music, Neoclassicism, and a response to the Twelve-tone technique.\nEarly music and the pursuit of authenticity\nA scholarly approach to the study of medieval music continued in the 20th century, and began to find expression in public performance. Kruetziger-Herr cites the first public performance as occurring in France in 1900, followed by a concert series in Germany in the early 1920s; musicologist John Haines cites a 1928 public performance in Quebec as one of the earliest instances of a popular polyphonic music performance drawing on medieval tradition. During this time, the description of this music also changed, from labels such as “Gothic” in the early 20th century to “medieval music” by the mid-century.\nAfter the second World War and with the newly available LP record, studios in Europe and the United States specializing in medieval or medievalist music appeared. Musician and academic John Potter cites the German Studio der frühen music as an early influence emerging in the 1950s, leading to an instrumentalist view of medieval music; the German Sequentia group followed with a stronger vocal influence while in the UK the Early Music Consort published a number of CDs. Despite the interest in authentic sound pursued by scholars and early practitioners, Potter notes many issues with the attempts to recreate medieval music, largely arising from a lack of detailed descriptions of singing and instrumental techniques. Thus, these recreations are argued to be speculative and driven by “a number of factors which have very little to do with the past”.\nOther examples of early neo-medievalism in music would also include a number of Romantic composers such as Niels W. Gade, Edvard Grieg, and Felix Mendelssohn (who often used medieval- and folk-style tunes in their music), as well as parts of the Carmina Burana by Carl Orff.\nPopular forms\nIn the mid-to-late 20th century, popular bands across multiple genres began to incorporate “medieval” sounds from a less historical perspective, and often through indirection: medieval sounds or themes were drawn from medievalist fantasy works, or from classical music which became associated with medieval nostalgia.\nMusic scholar Elizabeth Upton argues that 18th-century Baroque music “became associated with an emotional sense of nostalgia… [first] by the Beatles” in the 1960s, then continuing with baroque and early music influences on folk and progressive rock music in the 1970s. She further cites medieval influences on the lyrics of songs such as Stairway to Heaven, and on the fantasy aesthetics of progressive rock album art. Other bands cited from the period include “Fairport Convention, Shirley Collins, Pentangle, Jethro Tull, and Steeleye Span”.\nMusic scholar James Cook further explores medievalism in progressive rock, folk, and metal, noting the influence of Arthurian legend and J. R. R. Tolkien on progressive rock, as well as “sword and sorcery imagery… [such as] hypermasculinized male warrior figures… [and] sexualized female warriors” in the aesthetics of metal. Folk, he argues, mutually was influenced by and influenced medievalism, drawing on medieval themes and then being used in medievalist media such as film or games.\nIn Germany, medievalist David Matthews cites the band Ougenweide as an early pioneer of the blending of medieval and modern elements, as well as the German band Corvus Corax and the music project The Soil Bleeds Black. In the 1990s, Corvus Corax would go on to have a profound effect on neo-medieval music. Corvus Corax, along with other bands, started the now popular strategy of combining medieval music with electronic music. Their side-project Tanzwut has given a start to a whole new genre Mittelalter Rock|Metal now presented by such famous Bands as In Extremo, Subway to Sally, Saltatio Mortis, Schandmaul, Feuerschwanz etc.\nThe Australian outfit Dead Can Dance, who released most of their most famous works in the latter half of the 1980s, were another early influence on the scene. Dead Can Dance had a more symphonic sound than previous acts, and, although never considering themselves to be a goth band, were popular among goths. This formed the precedent of neo-medieval music being particularly popular in the Goth scene.\nNeo-medieval and neo-Renaissance qualities have been used by contemporary composers like Mamoru Fujieda and Michael Waller, with their use of modal cells and subtle counterpoint.\nCultural studies and media\nWith an increasing focus of medieval and medievalist studies on popular reimagination of the Middle Ages in media, questions have been raised about the effects of representations of the medieval through music in games, film, and television. Musicologist Karen Cook describes this as an effort to “identify and unpack the musical signs that have developed over the last six centuries as aural shorthand for any and all types of Middle Ages”, and as part of the unpacking raises questions about what stereotypes about the Middle Ages might be transmitted through medievalist music. Studies have examined the music of games such as The Elder Scrolls V: Skyrim and The Witcher 3: Wild Hunt to analyze the ways in which a fantasy-medieval atmosphere is created through instrumentation and orchestration, as well as the historical traditions that these musical elements are drawn from.\nSee also\n*Video game music\n*Music in Medieval England\nReferences\nFurther reading\n* Everist, Mark, and Kelly, Thomas (eds.) (2018). The Cambridge History of Medieval Music. Cambridge University Press. ISBN 978-0-5119-7986-6\n* Meyer, Stephen, and Yri, Kirsten (eds.) (2020). The Oxford Handbook of Music and Medievalism. Oxford University Press. ISBN 978-0-1906-5847-2"
    }
  ]
}