{
  "content": [
    {
      "type": "text",
      "text": "# Neo Geo Battle Coliseum\n\n| director = Osamu Kamada\n| producer = Eikichi KawasakiChikara Yamasaki\n| designer = Chikara Yamasaki\n| released = Arcade (Atomiswave)}}PlayStation 2\nXbox Live ArcadePlayStation Network\n|platforms = Arcade, PlayStation 2, Xbox Live Arcade, PlayStation Network\n| genre = Fighting\n| modes = Single-player, multiplayer\n| arcade system = Atomiswave\n}}\n(usually abbreviated as 'NGBC or NGB') is a fighting game designed for the Atomiswave arcade board developed and released by SNK in 2005. The game features characters from several SNK and ADK titles. Subsequently, a PlayStation 2 version of the game was released in Japan, North America, and Europe. The Xbox Live Arcade version was released worldwide on June 9, 2010. In 2020, a homebrew conversion was released for the Dreamcast.\nGameplay\nThe game system of the arcade NGBC, is a 2-on-2 tag battle, regardless of how many players are playing. While the two-player game system is similar to most tag-team systems of other games, the single player system is unusual. When the controlled character hits the opponent with a double assault, the reserve character will enter a hyper-charged state. When the player switches to a character in this state, they get two effects: \"attack power increase\" and \"addition to damage value.\" Characters that already have high attack power will become even stronger with \"attack power increase.\" Characters with multi-stage techniques can put pressure on opponents who are simply waiting. The duration of hyper charge is only 10 seconds initially. However, the longer it takes to switch after activation, the longer it will last. Regarding the system, we have improved the system to make the game more enjoyable, and have changed the specifications to \"death match until two people are down when playing against the opponent\" and \"tag match that ends when one person is down when playing against the CPU.\"\nThe game's single play is more like a survival battle, where the player must beat enemy after enemy as long as possible. However, the game gives the player 300 seconds, and when time-out occurs, instead of win or lose, the player will face the boss (depending on how well they perform). Only at this point will time-out determine the victor.\nDuring a single-play, the rule is to defeat either member of the team, not both team members. That is, unlike most tag-team systems (but similar to Kizuna Encounter or Tekken Tag Tournament), where all opposition must be beaten in order to win, in NGBC the player only needs to beat one member of the opposite team to win, without the need to fight the other member if the first is defeated.\nPlot\nThe official plot, as given by SNK, is as follows: \"In February, 2017 of the new Japanese era there is a man trying to rule the Neo Geo World. \"I will topple Neo Geo's most powerful warriors and put myself on the throne!\". We knew that if he managed to obtain Neo Geo world's awesome power, world domination would not be far from his reach. This man, who sat at the heart of the \"WAREZ Conglomerate\" with overwhelming financial power behind him, had already set out on his ambitious path to gain Neo Geo World's power. Those who knew the truth of his intentions were already trembling with fear... As Neo Geo World drew closer to the verge of disaster, a WAREZ sponsored fighting competition was announced. This event is called \"Neo Geo Battle Coliseum\". The federal government is worried about the situation, and has secretly dispatched its two best secret agents, Yuki and Ai. A world on the verge of eternal darkness... The future of Neo Geo World is now in the hands of the warriors.\" (The name of the organization that hosts the tournament, WAREZ, is an obvious play on the word warez, as SNK Playmore blames software piracy as one of the contributing factors to its 2001 bankruptcy.)\nCharacters\nThe game features 40 playable characters and one non-playable boss. Four characters are original to Battle Coliseum, while the remainder are drawn from 11 different SNK series.\n(Athena)\n* Cyber Woo (King of the Monsters)\n* Fuuma Kotaro (World Heroes)\n* Geese Howard (Fatal Fury)\n* Genjuro Kibagami (Samurai Shodown)\n* Goodman (original)\n* Hanzo Hattori (World Heroes)\n* Haohmaru (Samurai Shodown)\n* Hotaru Futaba (Fatal Fury)\n* Iori Yagami (The King of Fighters)\n* Jin Chonrei (Fatal Fury)\n* Jin Chonshu (Fatal Fury)\n* K' (The King of Fighters)\n* Kaede (The Last Blade)\n* Keiichiro Washizuka (The Last Blade)\n* Kim Kaphwan (Fatal Fury)\n* King Leo (Savage Reign)\n* King Lion (Savage Reign)\n* Kisarah Westfield (Aggressors of Dark Kombat)\n* Kyo Kusanagi (The King of Fighters)\n* Lee Pai Long (Art of Fighting)\n* Mai Shiranui (Fatal Fury)\n* Marco Rossi (Metal Slug)\n* Mars People (Metal Slug)\n* Mizuchi (original)\n* Moriya Minakata (The Last Blade)\n* Mr. Big (Art of Fighting)\n* Mr. Karate II (Buriki One)\n* Mudman (World Heroes)\n* Nakoruru (Samurai Shodown)\n* Neo Dio (World Heroes)\n* Rock Howard (Fatal Fury)\n* Robert Garcia (Art of Fighting)\n* Shermie (The King of Fighters)\n* Shiki (Samurai Shodown)\n* Terry Bogard (Fatal Fury)\n* Tung Fu Rue (Fatal Fury)\n* Yuki (original)\n}}\nProduction\nEvery time the team do a location test, people say that KOF characters are stronger. Many people had problems with Kyo Kusanagi and Iori Yagami. The main premise is that SBJ want to provide everyone with a new type of fighting game, but more than that, the basis of a tag match is that the team fights as one. Developers believe that by making the victory or defeat the team's responsibility, they can create a tense battle that places more importance on \"partner combinations,\" \"individual member strategies,\" and \"teamwork,\" so they decided on this style. They were careful when making the game so that no money was wasted and don't make the gameplay volume too thin. The former New World Music Acrobatic Troupe to do the sound. It is a SNK fighting game festival, so the team wanted to include flagship characters like Haohmaru, Nakoruru, and Hanzo. On the other hand, they were faced with the dilemma of only including main characters. Almost the entire development staff had many discussions to select the characters, so it took a long time to decide on them all. They had to consider not only the character's personality, but also the game's overall performance, including the character's abilities. There are strategies to attack aggressively and strategies to recover frequently. The player's personality was meant reflected in their strategy.\nEisuke Ogura is behind the artwork of the game. There was demand for multiple KOF characters like Kula Diamond but the team could not put that many characters to balance the crossover. Ryo appears by the name of Mr. Karate like his father based on his father Takuma but the team was still open to older characters like Lee Pai Lung and Tang Fu Lu are both nearly 70 years old. Ryo was chosen based on his Buriki One persona but with his father's nickname to evoke his power. Yuuki's is \"New Japan Machine Fighting Technique (abbreviated as New Japan Machine Fighting Technique)\" and Ai's is \"New Japan Fighting Technique\". The abbreviation for each is SNK. Yuuki's in particular is a direct copy of SNK's predecessor, \"Shin-Nihon Kikaku\", in sound. New Japan Machine Fighting Technique and New Japan Fighting Technique are practical fighting styles using machines. The staff took liberties with characters from Metal Slug since they use guns in a fighting game.\nAs there are no long dialogues like in the company's previous game SVC Chaos, the biggest appeal of this game is that characters from different worlds can fight on the same field. The teams would like to be able to do some special performances with as many combinations as possible that everyone would like to see dialogues. Robert Garcia was given a new design similar to Art of Fighting 3 but he was made older. The new Robert has a new look and voice, but he can still use the Phantom Kick. Meanwhile, Cyber Wu is considered a hard character to use. Haohmaru was designed to be one of the best characters to use. The story was made to fit multiple eras. In contrast to The King of Fighters, SNK positions Neo Geo Battle Coliseum as a game that goes one step further into the realm of \"anything goes\". They also took care to differentiate it from KOF as much as possible. For example, with regard to the front characters, they have made various modifications to the existing characters, and they are taking a different approach from KOF. If players compare what is actually displayed on the screen, the developers think you will feel that it feels different from before. New Robert has a new look and voice, but he can still use the Phantom Kick. Meanwhile, Cyber Wu is considered a hard character to use. Haohmaru was designed to be one of the best characters to use. The story was made to fit multiple eras.\nReception\nIGN gave the game 7.3/10. HonestGamers gave a 4/5 review stating \"A fun and challenging fighter with bits of SNK nostalgia makes this a great game.\"\nReferences\nExternal links\n*[http://game.snkplaymore.co.jp/official/nbc/ Neo Geo Battle Coliseum] at the official Japanese website of SNK Playmore\n*[https://web.archive.org/web/20100724194807/http://www.snkplaymoreusa.com/neogeo-battle-coliseum Neo Geo Battle Coliseum] at the official website of SNK Playmore USA\n*[https://web.archive.org/web/20061104041918/http://www.ignitionent.com/ngbc/main.htm Neo Geo Battle Coliseum] at the official European website of Ignition Entertainment\n*"
    }
  ]
}