{
  "content": [
    {
      "type": "text",
      "text": "# Nepal–Tibet War (1855–1856)\n\nThe Nepal–Tibet War (; ) of 1855–1856 was fought in Tibet between the forces of the Tibetan government (then a protectorate of the Qing dynasty) and the invading Nepalese army, resulting in huge loss of money and manpower for Nepal. In 1856 the war ended with the Treaty of Thapathali.\nBackground\nSince the Sino-Nepalese War of 1792, the Nepalese government had renounced all claims of influence in Tibet and maintained a policy of non-intervention in its affairs. With their victory in the war, the Nepal used to pay tribute to Qing Empire, but the wave of rebellions that afflicted China in the 1850s such as the Taiping Rebellion had crippled her capacity to enforce Imperial authority so far from Beijing and the Nepalese Prime Minister, Jang Bahadur Rana, saw an excellent opportunity to press for Nepalese objectives in Tibet without the threat of Chinese interference.\nJang Bahadur used the alleged ill-treatment to the 1852 embassy, abuses to Nepalese Newar traders in Lhasa, a boundary dispute in the Kuti area, among other grievances to justify the Nepalese demands to the Tibetan government, which included territorial concessions and the payment of an indemnity. He declared war in March 1855 and gave 17 April 1855 as the date limit for his conditions to be met.\nWar\nSummer campaign\n/Digarcha]]\nIn early April 1855 Nepalese troops attacked across the major passes between Tibet and Nepal, from Walungchung to Jara, with the center of their advance in the Kuti and Kerong districts and were joined shortly later by reinforcements completing a total of 27000 men, with thirty-six guns and eight mortars.\nThe Kerung Axis was commanded by General Bam Bahadur Kunwar, with 25,728 troops. The Kuti Axis was commanded by General Dhir Shumsher Rana with 4,678 troops. Humla and Mustang was commanded by General Krishna Dhoj Kunwar with 2,500 troops. And Olangchunggola Axis was commanded by Colonel Prithvi Dhoj Kunwar with a force of 2,000 men. Sethya Kaji was the main Tibetan commander with about 50,000 troops under his command. There were 8000 Tibetan troops stationed on Digarcha front, whereas  40,000 troops were concentrated in the Tingri area.\nOn April 3 general Dhir Shamsher defeated a small Tibetan detachment at Chusan and captured Kuti and advanced to Suna Gompa. Kerong was occupied by Bam Bahadur without opposition and a Tibetan force at Kukurghat, north of Kerong, after which the Nepalese pushed on to Dzongka, the Tibetan main point of resistance in the area. The battle for Dzongka lasted 9 days after which the Tibetans retreated to Tingri. The capture of Dzongka was the last action of the campaign after which negotiations for a cease-fire began. The campaign had proven more costly for Jang Bahadur than what he expected.\nWinter campaign\nNegotiations carried on from May to September without a settlement. Nepal was unable to press its demands with another campaign since its treasury had been exhausted by the costs of the invasion and occupation of the Tibetan country, while in Nepal opposition to the war escalated. In Lhasa the failure of negotiations led to a renewal of hostilities, and this time it was Tibetan troops who took the offensive. General Kalon Shatra commanding the Tibetan army, launched two simultaneous attacks in November 5 on the Nepalese camps at Kuti and Dzongka. Surprised, the Nepalese lost 700 men in Kuti and the survivors fled to the border. The attack on Dzongka was less successful so the garrison there was besieged. The attacks were timed to coincide with the snowing season in the passes. Jang Bahadur sent reinforcements and in December Dhir Shamsher recaptured Kuti which he burned before retreating to Listi, back in Nepal. Meanwhile, colonel Sanak Singh Khattri relieved Dzongka. At the end of the fifth year of Emperor Xianfeng's reign (1855), the Qing government ordered Manqing, the assistant minister in Tibet, to mobilize 2,000 officers and soldiers from the mainland to reinforce Tibet. Nepal then took the opportunity to propose peace talks.\nConclusion\nNegotiation resumed after military operations stalled. The Tibetans feared a rebellion in Kham while Nepalese finances were stretched to their limits. The Nepalese demand for ten million rupees was dropped to a nominal annual payment and Nepalese territorial ambitions were dropped. In the Treaty signed at Thapathali, the Tibetans agreed to pay an annual subsidy of ten thousand rupees to the Nepal Durbar and to allow a Nepalese trading station and agency to be established at Lhasa. Tibet paid lump sum of Rs. 50,001 as first installment.\nSee also\n*Sino-Nepalese War\n*China–Nepal relations\n*Treaty of Thapathali\n*Tibet under Qing rule\nReferences\nCitations\nSources\n*[https://books.google.com/books?id=SZD9--xYamkC&dq=sikkim+1888&pg=PA212 p212]\n*\n*\n*\n*\nExternal links\n* [https://web.archive.org/web/20161220102904/http://nepalarmy.mil.np/history.php?page=three History of Nepalese Army: Nepal-Tibet Wars]"
    }
  ]
}