{
  "content": [
    {
      "type": "text",
      "text": "# Netherdale, Queensland\n\n| pop                 = 121\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4756\n| area                = 47.5\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 7.3\n| dir1                = ESE\n| location1           = Eungella\n| dist2               = 36.8\n| dir2                = W\n| location2           = Mirani\n| dist3               = 73.9\n| dir3                = W\n| location3           = Mackay CBD\n| dist4               = 1040\n| dir4                = NNW\n| location4           = Brisbane\n| lga                 = Mackay Region\n| stategov            = Mirani\n| fedgov              = Capricornia\n| near-n              = Dalrymple Heights\n| near-ne             = Finch Hatton\n| near-e              = Finch Hatton\n| near-se             = Crediton\n| near-s              = Crediton\n| near-sw             = Broken River\n| near-w              = Eungella\n| near-nw             = Dalrymple Heights\n}}\nNetherdale is a rural locality in the Mackay Region, Queensland, Australia. In the , Netherdale had a population of 121 people.\nGeography\nNetherdale is the most western locality of the Pioneer Valley. The river does not pass through Netherdale but Netherdale is within its drainage basin. The Mackay–Eungella Road passes from the east to the west through the locality after which it climbs the Clarke Range to Eungella.\nThe north and south of the locality are mountainous (part of the Clarke Range) and rise to 890 metres and 670 metres respectively. Between them lie the \"valley\" through which the road runs at an elevation of 140 metres (in the east) to 180 metres (in the west). The land use in the valley is a mixture of sugar cane and grazing like most of the Pioneer Valley. There is no development of the mountainous north and south of the locality.\nHistory\nThe Mackay Railway was extended from Finch Hatton (to the west) to Netherdale in 1911. The locality was served by two stations:\n* Okuloo railway station ()\n* Netherdale railway station (), also known as Eungella Range railway station\nThe line and the stations were closed in 1977 as part of the overall closure of the Mackay Railway.\nThe Netherdale State School opened on 24 January 1914, having been originally proposed to be called the Eungella Range State School. It closed on 31 December 1963.\nOn 21 April 1928, there was a stump capping ceremony for the Netherton Methodist Church. On Saturday 6 June 1928 the church was officially opened.\nNetherdale was within the Shire of Mirani until the shire was amalgamated into the Mackay Region in 2008.\nDemographics\nIn the , Netherdale had a population of 111 people.\nIn the , Netherdale had a population of 121 people.\nEducation\nThere are no schools in Netherdale. The nearest government primary schools are Eungella State School in neighbouring Eungella to the west and Finch Hatton State School in neighbouring Finch Hatton to the east. The nearest government secondary school is Mirani State High School in Mirani to the east.\nAttractions\nPeases Lookout offers panoramic views of the Pioneer River Valley. Although within the boundaries of the locality, the lookout can only be accessed from Dalrymple Road in neighbouring Eungella (). It was named after Percy Pease, a Member of the Queensland Legislative Assembly.\nNotable residents\n* Gwyn Hanssen Pigott, ceramic artist\nReferences\nSources\n*\nFurther reading\n*  — includes the history of Netherdale State School\nExternal links"
    }
  ]
}