{
  "content": [
    {
      "type": "text",
      "text": "# Netstalking\n\n}}\nNetstalking is a searching activity carried out within the limits of Internet, aimed at finding little-known, inaccessible, forbidden, shocking and rarely-visited objects, including their analysis, systematisation and storage. The objects found are either aesthetically pleasing or informationally fulfilling to a seeker.\nThis mostly includes the deep web and the darknet, partially IoT devices, deprecated or developing web protocols. Although irrational, the activity develops web searching skills and mindful work with information.\nThe term of \"netstalking\" was most likely created in 2009 in Russian part of the Net, and refers to S.T.A.L.K.E.R.\nMethods of netstalking\nIn netstalking, there are two general methods for finding unusual information: a deli-search and a net-random. Deli-search, or \"deliberated search\", is a targeted search for objects of interest whose characteristics are already known. This method usually uses the language of search queries and web archives, with which one can view old or deleted versions of these pages. Net-random searches for hidden and unknown information through the process of trial and error. For netstalkers, the second method is considered to be the most popular way to search for information, as it allows network researchers to find undefined hidden resources. Net-randoming is done by either scanning IP address ranges or by using content randomizers, such as PetitTube. Special programs are used for scanning include Advanced IP scanner, Nmap / Zenmap, NESCA, and RouterScan by Stas’m.\nSearch areas\nNetstalkers analyze the entire Internet, which is traditionally divided into several conditional segments.\nSurface web\nThe surface web is the public Internet. In this part, one can find everything that is used by the average user of the network: social networks, blogs, encyclopaedias, news sites and others. In other words, the surface web is all that can be found using ordinary search engines (Google, Yahoo&nbsp;and others). The surface web accounts for about 15-20% of all information on the Internet.\nDeep web\nThe deep web is made of non-indexable resources that cannot be found with the help of search engines. This happens for several reasons. The main one is that only the owner knows about the site or server, and he has never published a link to his page anywhere. Deep web is of greatest interest to network researchers because of its vastness and non-knowledge. Netstalkers use programs to scan ranges of IP addresses to study this segment.\nDarknet or Dark web\nThe darknet is closed Internet space which cannot be accessed using network programs. These are government, corporate or military networks. The most famous and popular representative of Darknet is Tor. Its popularity is due to the possibility of distributing prohibited materials under conditions of some anonymity.&nbsp;To view it, special software is needed, namely Tor, I2P, Freenet, or other services that allow the user to bypass the blocking of many sites. This gives access to restricted resources that are inaccessible to ordinary Internet users. Such resources cannot be accessed from standard browsers even if there is a standard internet connection. Darknet can be dangerous for inexperienced users, children, and ordinary users. Yet there are also informative or leisure web pages.\nMajor findings of netstalkers\nUsually in the hidden segments of the Internet, netstalkers find non-indexed web pages. Occasionally those are the objects of net-art. Jon Rafman's “Nine Eyes of Google Street View” project is one of the largest highlights of net-art. A distinctive feature of net-art is the fact that it is the surface Internet that can be its primary environment for its creation and distribution.&nbsp;By a similar method, one can discover \"unexisting\" streets on Google Maps, which are unknown to common people. Also, netstalkers find recordings from surveillance cameras and view them in search of strange or interesting events. Another direction is network archeology—that is, the search for once popular, but now forgotten resources, including outdated protocols.&nbsp;An interesting fact is that netstalkers have found unprotected servers of NPPs and state structures, however, such findings usually do not pick much interest, as they are seen as a more generic finding.\nCriticism\nBecause of the aura of mystery around the activities of the netstalkers and their legends, they first attracted the attention of the administrators of the “”, and then law enforcement agencies became interested in their activities. Net-art, images and legends were actively used by administrators of the forbidden \"death groups\" for their own promotion. For example, the legend of the “Silent House”, recognised by the creators as fiction, has acquired a cult and suicidal meaning. This led to a temporary crisis of netstalking as a cultural phenomenon because an unusual amount of new participants came into it, not to research the web but to experience some kind of mystery.\nAlthough netstalking is occasionally accused of propagating the violent or neurotic content and faux information, such as deep web legends, yet in reality their activities are of revealing and deconstructing those.\nAlso\n* World Wide Web\n* Internet\n* Surface web\n* Deep web\n* Darknet\n* Tor\nReferences\nExternal links\n*\n*"
    }
  ]
}