{
  "content": [
    {
      "type": "text",
      "text": "# New Democratic Republican Party\n\n| leader           = Kim Jong-pil\n| foundation       = 30 November 1987\n| ideology         =\n}}\n| founder          = Kim Jong-pil\n| dissolved        = 14 February 1990\n| colours          = }} Green\n| split            = Korean National Party\n| merged           = Democratic Liberal\n| position         = Right-wing\n| country          = South Korea\n}}\nThe New Democratic Republican Party () was a South Korean conservative political party which formed in 1987 and dissolved in 1990. It was particularly strong in Hoseo, the home region of party leader Kim Jong-pil. However, it merged with two other parties in 1990 to form the Democratic Liberal Party.\nHistory\nAfter the 1979 South Korean coup d'état, the Democratic Republican Party of former dictator Park Chung Hee was banned by the new government under Chun Doo-hwan. In its stead, former members of the DRP and organisations such as the Yushin Jeongu Association (유신정우회) formed a new group named the Korean National Party and attempted to become an alternative party against the mainstream one and sought to secure the greatest number of seats. Their goal failed, however, due to accusations of financial corruption and subsequent punishment by the ruling regime. The KNP withered away after the 1985 legislative elections, and the bulk of its adherents moved into the nascent New Democratic Republican Party (NDRP) under Kim Jong-pil, who had been prime minister under Park Chung Hee from 1971 to 1975. The NDRP inherited the old KNP's local strength in South Chungcheong region, and also proudly proclaimed itself the descendent of the old DRP and KNP, whose policies the NDRP party believed would usher in a \"new modernisation.\"\nKim Jong-pil and the NDRP launched an active nationwide political campaign during the 1987 presidential election, which was the first in South Korea following democratisation that same year. The party attempted to garner support by reminding voters of the economic growth under Park Chung-hee's regime, but only came in fourth place with 1,823,067 votes, or 8.1% of the national popular vote. Unsurprisingly, the party's strongest results were in South Chungcheong region. Despite this, the party did better in the 1988 legislative elections, almost doubling their share of the popular vote since 1987 and capturing enough seats along with other opposition parties to block virtually any legislation the ruling Democratic Justice Party tried to pass. As a result, the DJP was forced to form a conservative coalition. In 1990, Jong-pil agreed to a proposed merger with the DJP and Kim Young-sam's Reunification Democratic Party.\nA few members of the NDRP protested because the DJP was affiliated with Chun Doo-hwan, who persecuted the Chung-hee loyalists in the old DRP/KNP, and because the RDP was affiliated with Kim Young-sam, a democratic reformer who had aggressively opposed both Park Chung Hee and Chun Doo-hwan. Nonetheless, the three parties all merged into the Democratic Liberal Party. In 1995, Jong-pil and others who opposed the policies of Kim Young-sam, who became president in 1992, defected and formed a new party called the United Liberal Democrats.\nElection results\nPresident\n{| class=\"wikitable\" style=\"text-align:center\"\n! Election\n! Candidate\n! Votes\n! %\n! Result\n|-\n| 1987\n| Kim Jong-pil\n| 1,823,067\n| 8.07\n|\n|}\nLegislature\n{| class=\"wikitable\" style=\"text-align:center\"\n! rowspan=\"2\" | Election\n! rowspan=\"2\" | Leader\n! rowspan=\"2\" | Votes\n! rowspan=\"2\" | %\n! colspan=\"3\" | Seats\n! rowspan=\"2\" | Position\n! rowspan=\"2\" | Status\n|-\n! Constituency\n! Party list\n! Total\n|-\n| 1988\n| Kim Jong-pil\n| 3,062,506\n| 15.59\n| }}\n| }}\n| }}\n| 4th\n|\n|}\nReferences"
    }
  ]
}