{
  "content": [
    {
      "type": "text",
      "text": "# New Haven Museum and Historical Society__disambig_1\n\n| established     = 1862\n| location        = 114 Whitney AvenueNew Haven, Connecticut\n| type            = Historical\n| visitors        =\n| director        =\n| curator         =\n| website         = [http://www.newhavenmuseum.org www.newhavenmuseum.org]\n}}\nThe New Haven Museum and Historical Society (originally known as the New Haven Colony Historical Society) was founded in 1862 in New Haven, Connecticut for the purposes of preserving and presenting the region's history. The museum has a collection containing art, photography, furniture and other artifacts from throughout New Haven's history and regularly presents programs and special exhibits.\nThe Museum features exhibitions on New Haven, La Amistad, local art and decorative arts, with collections associated with Eli Whitney, Winchester, Yale, East Rock, Noah Webster, Benedict Arnold as well as changing exhibitions.  Educational programs provide interactive inquiry-based learning on local history.\nThe Whitney Research Library at the museum contains manuscript and archival holdings relevant to the New Haven area from the time of the first settlement to the present. The collection includes rare books, more than 300 manuscript collections, including personal papers, business and institutional records, court and municipal documents, maps, 4,000 architectural drawings and resources, account books and a collection of approximately 75,000 photographs. It also contains approximately 30,000 printed titles including monographs and pamphlets.  The library also includes genealogical materials, vital statistics and colonial and town records, passenger arrival lists to American ports, Federal census schedules for New Haven County on microfilm and a complete set of New Haven city directories from 1840.\nThe Colonial revival style current building was built in 1929 and was designed by J. Frederick Kelly.  The building includes a number of artifacts from demolished New Haven houses including a mantelpiece and urns from the Nathan Smith house and a mantelpiece from the Benedict Arnold house. The Ingersoll Room in the museum is decorated with furniture and portraits from the eighteenth and nineteenth centuries documenting the home and life of New Haven's Ingersoll family.\nPronounced Ah-Beetz\nIn 2025, filmmaker Gorman Bechard, along with Jason Bischoff-Wurstle, Dean Falcone, and Colin M. Caplan, co-curated an exhibit at the museum called Pronounced Ah-Beetz  which celebrates the history of New Haven apizza.  The exhibit, which opened on October 9, 2025, and will be on display until October 2027, features the history of New Haven's three iconic Pizza restaurants: Frank Pepe Pizzeria Napoletana, Sally's Apizza, and Modern Apizza, as well as other beloved pizza restaurants throughout the New Haven area.\nBechard began speaking with Director of Photo Archives Bischoff-Wurstle in February 2020 about bringing a pizza exhibit to New Haven. The idea grew out of Bechard's documentary Pizza: A Love Story and his visiting the now-shuttered Pizza Museum in Chicago.  He felt a pizza museum belonged in New Haven.  It was made possible by the connections the filmmaker and his producing team of Falcone and Caplan had made with the families of local pizza restaurants during the making of the documentary. Numerous holy grails of pizza history are on display, including the oldest known pizza box from 1936, Frank Pepe's original baking hat, and pizza boxes signed by Yogi Berra and Gwyneth Paltrow.\nSee also\n* List of historical societies in Connecticut\nReferences"
    }
  ]
}