{
  "content": [
    {
      "type": "text",
      "text": "# New Zealand–United Kingdom relations__disambig_1\n\nmeets with United Kingdom Prime Minister Keir Starmer at the 2024 Commonwealth Heads of Government Meeting, 24 October 2024]]\nNew Zealand–United Kingdom relations are the bilateral relations between New Zealand and the United Kingdom. New Zealand has historically maintained a close relationship with Great Britain.\nNew Zealand was a British colony from 1841, and it supported Britain during major conflicts, including both World Wars. The relationship evolved as New Zealand moved toward independence, adopting the Statute of Westminster in 1947, and diversifying its foreign and economic policies.\nThe two countries remain related through mutual migration, through shared military history, system of government, and head of state, and through language and membership of the Commonwealth (formerly British Empire).\nHistory\nPre-independence relations\nDuring his first voyage, British navigator James Cook reached New Zealand on 6 October 1769. Secret directives had been supplied to Cook for this portion of his expedition, instructing him to search firstly for the fabled Terra Australis and, if unsuccessful, to make instead as extensive an exploration of the New Zealand coast as resources allowed. The document that Cook was given declared that these missions were intended to further demonstrate Great Britain's maritime prowess, to bring honour to the Crown and to explore new opportunities for trade and navigation.\nFor almost sixty years the country remained under no sovereign rule however the British made claims to areas of the country where significant trade between New Zealand and Australia existed to be part of The Colony of New South Wales. Formal British representation in New Zealand began with the posting of James Busby from Australia to the islands in 1833 as the British Resident, who was sent in response to the concerns of a number of northern Māori leaders over the lawlessness of local foreign settlers.\nSince 1816, a number of Māori chiefs had travelled to England and the colonies to explore options for the establishing of a Māori government and, in 1834, Busby drafted the Declaration of the Independence of New Zealand, ratified by a number of northern chiefs in 1835. As part of this process, King William IV recognised and agreed to act as protector for the newly formed state.\nThe Treaty of Waitangi was formed, which was signed by a number of Māori chiefs and representatives of the British Crown on 6 February 1840. The British also knew of French intent to colonize New Zealand and British sovereignty was hurriedly declared later in May of that year, just before the first French colony ships arrived in Akaroa.\nNew Zealand became a British Colony in 1841 and, eleven years later, the British Parliament passed the first fully implemented Act to grant self-governance to the new colony. Formal British influence gradually diminished, as the power of successive Governors waned with respect to that of the nascent New Zealand Parliament. Dominion status followed in 1907, providing almost complete independence from the government of Britain and New Zealand separately joined the League of Nations in 1926. The Balfour declaration of 1926 emphasised the equal status of members of the British Empire and their free association in the British Commonwealth, (since 1949 the Commonwealth of Nations).\nWith the 1931 Statute of Westminster, the complete independence of the Dominions was confirmed by the British Parliament, though this was not adopted in New Zealand until some time later, through the Statute of Westminster Adoption Act 1947.\nSettlers\nMuch of the migration to New Zealand took place from the constituent countries of the British Isles. This was facilitated from 1839 by the New Zealand Company founded for the purpose of colonization. The work of the Otago Association and Canterbury Association in establishing the primarily Scottish settlement in Dunedin and the primarily English settlement in Christchurch, respectively, encouraged further New Zealand-bound emigration from Britain.\nAround 80% of New Zealanders are of at least partially British ancestry, and an estimated 17% are entitled to British passports.\nToponymy\nFrom the anglicisation of the Dutch appellation Nieuw Zeeland onward, historical ties with the United Kingdom have contributed substantially to New Zealand's toponymy. James Cook's early map combined local Māori place-names with a number of his own coinages. Subsequent settlers added references to places in United Kingdom, aristocratic sponsors, early British explorers, the Royal Family, battles in which the United Kingdom was involved and notable institutions such as Christ Church, Oxford.\nMany of these contributions have been retained in common usage, often alongside pre-existing Māori placenames.\nLaw\nThrough the first Act of the First New Zealand Parliament (in 1854), those applicable English laws that were enacted prior to the appointment of William Hobson, were adopted in New Zealand. As such, New Zealand inherited an uncodified constitution but, unlike the other former dominions, it has not been codified through an overarching document or documents.\nEnactments by the UK Parliament specifically and substantially relating to New Zealand include:\n* Canterbury Settlement Lands Act 1850\n* Canterbury Association Act 1851\n* New Zealand Constitution Act 1846 (repealed 1852)\n* New Zealand Constitution Act 1852 (repealed by the Constitution Act 1986)\n* New Zealand Boundaries Act 1863\n* Colonial Laws Validity Act 1865 (repealed 1947)\n* Statute of Westminster 1931 (leading to the New Zealand adoption Act - Statute of Westminster Adoption Act 1947)\n* New Zealand Constitution Amendment Act 1947 (as a result of the New Zealand Constitution (Request and Consent) Act 1947)\n* Taxation\n** The Double Taxation Relief (Taxes on Income) (New Zealand) Order 2004\n** The Double Taxation Relief and International Tax Enforcement (Taxes on Income and Capital) (New Zealand) Order 2008\nA number of these acts were repealed through the Statute Law (Repeals) Act 1989.\nCitizenship and nationality\nThe British Nationality and New Zealand Citizenship Act 1948 established the legal concept of New Zealand citizenship; prior to this, all people born or naturalised in New Zealand had the status of \"British subject\", just as those born or naturalised in the United Kingdom, or any of the other dominions. At a similar time, those in the dominions were omitted from a new status, defined in the British Nationality Act 1948, of \"Citizen of the United Kingdom and Colonies\", a forerunner to the modern concept of British citizenship. New Zealand passports carried the wording \"British Subject\" until the Citizenship Act 1977.\nEconomic relations\nBritain tied itself somewhat to European trade in recent years though its membership of the European Union between 1973 when it first joined what was then known as the European Communities (the Common Market) and 2020 when it left the bloc, forcing New Zealand and Australia to seek new markets and trade with the Asia-Pacific region. New Zealand has a large influence over former British colonies in the Pacific and the British territory of Pitcairn.\nUp to about the 1960s, New Zealand also had extremely close economic relations with the United Kingdom, especially considering the distance at which trade took place. As an example, in 1955, Britain took 65.3 percent of New Zealand's exports, and only during the following decades did this dominant position begin to decline when the United Kingdom joined the European Economic Community (now the European Union) in 1973, with the share of exports going to Britain having fallen to only 6.2 percent in 2000. Historically, some industries, such as dairying, a major economic factor in the former colony, had even more dominant trade links, with 80–100% of all cheese and butter exports going to Britain from around 1890 to 1940.\nAccording to the New Zealand Ministry of Foreign Affairs and Trade, recent annual New Zealand exports to the United Kingdom have accounted for at least NZ$1.76 billion worth of trade, and over NZ$1 billion in the opposite direction. Meat products make up almost half of exports and the largest imports are machinery and vehicles.\nA bilateral business association, British New Zealand Business Association Inc., was established in 1917 and aims to promote reciprocal trade and the interests of association members undertaking trade between the two nations.\nTrade Agreements\nOn 21 October 2021, New Zealand and United Kingdom signed a free trade agreement eliminating tariffs on 97% of New Zealand exports to the UK including honey, wine, kiwifruit, onions, and most industrial products. In addition, a range of dairy and beef exports will be tariff free after a period of 15 years. On 1 March 2022, the two countries ratified the terms of the free trade agreement signed  in October. This agreement removes tariffs on 99.5% of New Zealand exports including meat, butter and cheese.  New Zealand Prime Minister Jacinda Ardern described the free trade agreement as a \"gold-standard free trade agreement\" that would help accelerate the country's economic recovery. This free trade agreement came into force on 31 May 2023.\nThe United Kingdom has completed negotiations to accede to Comprehensive and Progressive Agreement for Trans-Pacific Partnership on 31 March 2023, of which New Zealand is a founding member.\nIn early 2022, the two governments agreed that their customs agencies would recognise each other's \"Secure Export Schemes,\" allowing firms to export goods with limited inspections.\nTravel\nAccording to the New Zealand High Commission in London, the United Kingdom is the third largest source of tourists to New Zealand.\nLondon has the highest density of people born in New Zealand of all British regions, 47% of them choosing to live there according to the 2001 census.\nIn early July 2022, New Zealand Prime Minister Jacinda Ardern and British Prime Minister Boris Johnson agreed to extend the Youth Mobility Scheme to allow New Zealanders to spend three years in the country and to raise the age limit to 35 years. Since the United Kingdom has limited the number of New Zealand working holiday visa holders to 13,000 places, New Zealand had also placed a 15,000 cap on British working holiday visa holders.\nSport\nSeveral popular sports in New Zealand find their origins in English sporting history such as rugby union, rugby league and cricket. The first interclub rugby union match in New Zealand, in Nelson, took place in 1870 and was inspired by a teacher returning from England with a knowledge of the new game.\nThe London New Zealand Cricket Club is a popular cricket team which plays in the United Kingdom.\nScientific and technical cooperation\nIn early July 2022, New Zealand Prime Minister Ardern and British Prime Minister Johnson signed  a new arrangement intended to strengthen\nbilateral cooperation on research, science and innovation related policies. The arrangement will be managed by the New Zealand Ministry of Business, Innovation and Employment and the British Department for Business, Energy and Industrial Strategy.\nCo-involvement in international organizations and multilateral treaties\nNew Zealand and the United Kingdom are both members of a number of international bodies, including the United Nations, the Commonwealth of Nations and the OECD. Defence arrangements involving both Britain and New Zealand include the Five Power Defence Arrangements, and the UK-USA Security Agreement for intelligence sharing. Since 2006, New Zealand has been a party to the ABCA interoperability arrangement of national defence forces, which has always included Britain. ANZUK was a tripartite force formed by Australia, New Zealand and the United Kingdom to defend the Asian Pacific region after the United Kingdom withdrew forces from the east of Suez in the early seventies. The ANZUK force was formed in 1971 and disbanded in 1974. The SEATO anti-communist defence organisation also extended membership to both countries for the duration of its existence from 1955 to 1977.\nBilateral representation\nNew Zealand has maintained a resident Head of Mission in the United Kingdom since 1871. The current High Commissioner from New Zealand to the United Kingdom is Hamish Cooper. The current High Commissioner from the United Kingdom to New Zealand is Iona Thomas. The governor-general of New Zealand fulfilled the role of the High Commissioner from the United Kingdom to New Zealand from its inception until 1939. Subsequently, separate appointments were made; this distinguished the representation of the British Government in New Zealand from that of the shared monarch, in sympathy with the principles set out under the Balfour declaration thirteen years earlier.\nSeveral New Zealand public bodies have official representatives in Britain and Honorary Consuls are based in the UK constituent countries of Scotland and Northern Ireland.\nOfficial visits\nRegular ministerial and VIP visits from New Zealand to the United Kingdom, and vice versa, take place each year. During 2009, at least 10 such official visits took place from New Zealand to the United Kingdom and at least 8 from the United Kingdom to New Zealand.\nSee also\n*Accession of the United Kingdom to CPTPP\n*Free trade agreements of New Zealand\n*Free trade agreements of the United Kingdom\n*Foreign relations of New Zealand\n*Foreign relations of the United Kingdom\n*Independence of New Zealand, stages independence of New Zealand from Britain\nReferences\nExternal links"
    }
  ]
}