{
  "content": [
    {
      "type": "text",
      "text": "# New World Street, Warsaw\n\nNowy Świat (), known in English as New World Street, is one of the main historic thoroughfares of Warsaw, Poland. It comprises part of the Royal Route (Trakt królewski) that extends from Warsaw's Royal Castle and Old Town, south to King John III Sobieski's 17th-century royal residence at Wilanów.\nGeography\nRoundabout]]\nNowy Świat runs from Three Crosses Square northwards, intersecting Jerusalem Avenue and Świętokrzyska Street (Holy Cross Street). Near the Warsaw University campus and the Nicolaus Copernicus monument it changes into Krakowskie Przedmieście (Cracow Suburb Street), which then runs all the way to the Royal Castle at Castle Square.\nAt its southern end, at Three Crosses Square, Nowy Świat changes into Ujazdów Avenue, which changes into Belweder Street, which becomes Sobieski Street as it continues coursing south, ultimately to arrive at Wilanów.\nHistory\n, 1892, National Museum, Warsaw]]\nUntil the 16th century, Nowy Świat was a main road leading to numerous aristocratic palaces and villages south of Warsaw. The street's present name was coined in the 17th century, after the city had begun growing substantially (c.1640). By the turn of the 18th century, the fields along Nowy Świat had become densely urbanized, mostly with wooden palaces and manors. Gutters had been constructed, and the street itself was paved with cobblestones.\nIn the Napoleonic period, Warsaw grew substantially and Nowy Świat was almost completely rebuilt. Wooden manors gave way to stone and brick, mostly three-story, neoclassical buildings. By the end of the 19th century, the buildings had been expanded and Nowy Świat had become one of the principal business streets of Warsaw. It was also one of the more heavily trafficked streets, with numerous shops and restaurants that attracted Varsovians as well as tourists. Larger new buildings replaced the earlier ones, and the character of the street changed. In the early 20th century, almost all trace of neoclassical architecture was lost as new buildings were erected mostly in Art Nouveau style.\nDuring the Warsaw Uprising (August–October 1944), Nowy Świat was almost completely destroyed. The Germans reduced most of its fine building as it was one of the most important streets in the center of Warsaw. At war's end, it was decided to rebuild Nowy Świat. As restoring its prewar art nouveau state would have been prohibitive, it was reverted to its early-19th-century appearance. Post-war reconstruction of the street was directed by the architect Zygmunt Stępiński.\nToday, Nowy Świat boasts many shops, restaurants, and cafes. It is considered to be a prime location for luxury retailers.\nSee also\n* Foksal Street – adjoining street with bars and clubs.\nNotes\n::In-line:\nExternal links\n* [http://www.starawarszawa.pl/ Nowy Świat in 19th century]\n* [https://maps.google.com/maps?f=q&source=s_q&hl=tr&geocode=&q=Nowy+%C5%9Awiat,+Warszawa,+Polska&sll=50.288572,18.657489&sspn=0.006841,0.021973&g=Nowy+%C5%9Awiat,+44-100+Gliwice,+%C5%9Al%C4%85skie,+Polonya&ie=UTF8&hq=&hnear=Nowy+%C5%9Awiat,+Warszawa,+Mazowieckie,+Polonya&ll=52.234423,21.014786&spn=0.013115,0.043945&z=15 Nowy Świat in Google Map]"
    }
  ]
}