{
  "content": [
    {
      "type": "text",
      "text": "# New York Renaissance Faire\n\n|free_label = Stages\n|free_text = 20\n|website =\n}}\nThe New York Renaissance Faire is a Renaissance faire located in Tuxedo, New York off New York State Route 17A that was first held in 1978. The  faire comprises permanent structures and has twenty stages and more than 100 shops.\nAs of 2024, the fair runs on Saturdays and Sundays beginning in mid-August, plus Labor Day Monday.\nHistory\nThe New York Renaissance Faire was originally called the New York Renaissance Festival created in 1978 by Barbara Hope and Donald Gaiti. In 1996, Hope and Gaiti, merged with Renaissance Entertainment Corp. which acquired Creative Faires Ltd., the company that owned and operated the faire. The faire became the fifth to be owned by Renaissance Entertainment Corporation.\nAttractions\nLike many other faires, the faire has a different storyline that changes with each year. Some weekends are themed, such as one aimed towards pirates.\nThe faire is a training ground for stage and screen actors who use the opportunity to grow in their careers. The actors spend two months preparing for the faire. The faire is also known for its charity work in reading programs and blood donations.\nSeveral weeks after the faire ends, Hope & Gaiti introduced a Halloween-themed event called the Forest of Fear in 1993. It runs every Friday, Saturday and Sunday night in October. In 2018, the primary building for this event sustained damage from heavy rains. The Forest of Fear Facebook page announced to fans that they would not operate that year. The attraction has not run since. The website appears to be down for maintenance.\nAllegations of hostile workplace environment\nIn Fall 2019, News 12 ran a segment on Turn To Tara covering the allegedly hostile work environment. News 12 obtained a leaked copy of the directors' daily discrepancy reports from the summer 2018 season. The segment describes allegations from previous and present works that \"sexual misconduct, performer in-fighting and substance abuse are rampant.\" Management did not comment.\nIn January 2020, News 12 again covered this issue, airing an interview with a former performer and manager who was responsible for a 30-person cast the summer of 2019. She alleges a hostile and unsafe working environment, saying \"a lot of the women would often, when we got together, would share things that were said to us, inappropriate things.\" A striking example: \"there was a 17-year-old cast member who came to me because one of the directors there said something that was sexually suggestive. She was humiliated by it and didn't know how to ask for help. I feel like it was behavior tolerated for so long it just became accepted.\"\nThe leadership team did not comment directly. Their lawyer, in a letter to News 12, describes this as a non-story. They wrote, \"The culture at NYRF is anything but sexually hostile. The NYRF has a strong anti-sexual harassment policy, and provides comprehensive sexual harassment training.\"\nSee also\n* List of Renaissance fairs\n* Historical reenactment\n* Jousting\n* Society for Creative Anachronism\nReferences\nExternal links\n*"
    }
  ]
}