{
  "content": [
    {
      "type": "text",
      "text": "# New Empire (band)\n\n| years_active        = 2005–2015\n| label =\n| website             = https://www.facebook.com/newempireband\n| current_members     = Jeremy FowlerKale KnealeKyle LaneNate Cairns\n| past_members        = Sam WalkerPeter Gillies\n}}\nNew Empire was an Australian rock band formed in Sydney in 2005. The band members were Jeremy Fowler, Kale Kneale, Kyle Lane, Nate Cairns, Sam Walker and Peter Gillies.\nHistory\nCome with Me Tonight (2008-2011)\nNew Empire released their debut album, Come with Me Tonight, in August 2008. The band played at Black Stump Music and Arts Festival between 2005 and 2009; they also appeared at Big Exo Day for a number of years. In 2009, they opened for Relient K. In 2010, they opened for Stan Walker and Hillsong United as part of the Youth Alive tour.\nOn 27 December 2010, New Empire announced on their Myspace and Facebook pages that bassist Sam Walker had left the band. Throughout April 2011, they toured Australia as a supporting act for Good Charlotte. They also supported Switchfoot at their Sydney show. They played as the supporting act for Owl City during its \"All Things Bright And Beautiful\" tour in Australia.\nOn Monday, 14 March 2011, New Empire released the song \"Here in Your Eyes\" on YouTube and iTunes; it belonged to their upcoming album Give Me the World. On Wednesday, 29 June 2011, their second single from the upcoming album was released on YouTube and iTunes. New Empire announced that Kyle Lane would be their new bass player on Thursday, 7 July 2011.\nSymmetry (2011-2013)\nOn Saturday, 9 July 2011, Jeremy Fowler unofficially announced the name of their upcoming second album at their Brisbane concert. On 14 July, they officially announced the new album would be titled Symmetry. It was released on 16 September. In October and November 2011, they toured Australia to promote the album. They were accompanied by supporting acts For Our Hero and A Sleepless Melody.\nThom William left as their touring guitarist and keyboardist in late 2011 to work on his career as a producer and writer.\nIn January 2012, New Empire performed in New Zealand at the annual Parachute Music Festival along with The Almost, The Rocket Summer, Relient K and Casting Crowns. On 7 April 2012, while at Easterfest, Jeremy announced that their song \"One Heart/Million Voices\" had been selected as the official theme song for the 2012 Summer Olympics on Australian TV. The band made a surprise appearance at the Black Stump Music and Arts Festival in 2012.\nOn Tuesday, 6 November 2012, New Empire officially released a statement regarding the departure of Peter Gillies from the band. Kyle Lane, originally their bassist, became the new lead guitarist, as guitar was his preferred instrument. Kyle Lane and Jeremy Fowler played a secret acoustic show for Easterfest 2013 at Bon Amici Cafe.\nIn a breath (2014)\nIn February 2014, New Empire officially signed with the record label Tooth and Nail Records. In April 2014, New Empire released their third full album, titled In A Breath. As part of the promotion, New Empire held the \"In A Breath Australian Tour\" from June to July 2014. The band also joined the \"Hope Revolution Tour\" in North America as front act.\nOn 11 August 2015, New Empire announced on Facebook that it was \"time to call it a day for New Empire. The past ten years have been by far the best, most rewarding (and the most challenging) times of our lives.\" Their final tour was announced for October 2015.\nFinal tour (2015)\nNew Empire's final tour, \"Give Me the World,\" concluded at the Factory Theatre in Sydney on 24 October, where they played to a sold-out crowd. Their supporting acts were Gus & Iggy and I am Apollo. The set list included songs from each of the band's three albums, some of which were performed in their original, pre-recording formats. Inaburra Media filmed their final concert and made it into a live DVD.\nThe show also had a special guest performance: Peter Gillies, their manager and former guitarist, played with New Empire for their song \"Across the Oceans.\" The show finished with \"One Heart/Million Voices\", their most famous piece. There was an official signing outside by the band members, past and present, with dedicated fans queuing for hours.\n\"From the day New Empire began as 19-year-old kids in Kale's Cronulla garage, we have seen the band totally as a gift from God to create music we love, inspire others to do likewise, and hopefully love everyone we encounter along the way. I can't begin to describe our love and respect for our fans and friends - you who have shared in this journey with us around the world - from road tripping in an RV around North America rotating night driving shifts and trying not to die, to touring with many artists we admire, to unforgettable weekends camping at Parachute and Easterfest festival communities back home. It's been a privilege to rock out with you in your car, through headphones during the morning run, or at a venue late into the night. We love you.\nSo now you are invited to join us for one last time, 'The Final Tour' as a final celebration together in Australia and New Zealand. We're determined to make this tour the best we've ever done, and we'll be playing many songs from all three albums this October. We're also really excited to be partnering with Love Mercy Foundation who are an incredible charity organisation doing phenomenal work changing lives in Uganda, Africa.\nOur final music video and single 'In a Breath' will be released today. It is dedicated to you, and especially anyone who has lost a loved one far too early in this life. To our parents - Robyn, Karen, Janice and Ross - we love and miss you. Thank you for your love and support. It's been wild. Jeremy, Kale, Kyle and Nate.\"\nNew Empire's songs \"Across The Oceans\" and \"A Little Braver\" were both featured as original soundtracks in the Korean drama Uncontrollably Fond, which aired in 2016.\nBand members\nFormer members\n*Jeremy Fowler – lead vocals, guitar, piano (2005–2015)\n*Kale Kneale – drums/percussion, backing vocals (2005–2015)\n*Kyle Lane – lead guitar, backing vocals (2012–2015), bass guitar, backing vocals (2005–2012)\n*Nate Cairns – bass, backing vocals (??–2015)\n*Sam Walker – bass guitar (2005)\n*Pete Gillies – lead guitar (2005–2012)\nTouring musicians\n*Thom William – guitar, keyboard (2005–2011)\n* Pete Gilles – special appearance as lead guitar (2015 Give Me The World Tour, Final Show)\nDiscography\nAlbums\n* Come with Me Tonight (21 August 2008)\n* Symmetry (16 September 2011) No.&nbsp;39 AUS, No.&nbsp;23 NZ\n* In A Breath (18 April 2014) No.&nbsp;28 AUS\nCome With Me Tonight (2008)\n# \"Take Me Back\"\n# \"Come With Me Tonight\"\n# \"Follow\"\n# \"The Voice\"\n# \"So Far Away\"\n# \"Colours From Black and White\"\n# \"If He Hurts You\"\n# \"Lucentia Uno\"\n# \"Hero\"\n# \"The Secret\"\nCome With Me Tonight (deluxe version) (2010)\n#\"Take Me Back\"\n# \"Come With Me Tonight\"\n# \"The Summer Sky\"\n# \"Hero\"\n# \"Follow\"\n# \"So Far Away\"\n# \"If He Hurts You\"\n# \"Lucentia Uno\"\n# \"The Voice\"\n# \"Colours From Black And White\"\n# \"The Secret\"\nSymmetry (2011)\n# \"Across The Oceans\"\n# \"Train on Time\"\n# \"Give Me The World\"\n# \"Ghosts\"\n# \"Tightrope\"\n# \"Worth The Wait\"\n# \"Staircase\"\n# \"Long Way Home\"\n# \"Here in Your Eyes\"\n# \"Imagination\"\n# \"One Heart/Million Voices\"\n# \"Give Me The World\" (acoustic) (bonus track)\n# \"Staircase\" (acoustic) (bonus track)\nIn A Breath (2014)\n# \"Tale of Jonah\"\n# \"Relight the Fire\"\n# \"The Sun Won't Sleep\"\n# \"Say It Like You Mean It\"\n# \"In A Breath\"\n# \"Wise Fox\"\n# \"Fallen Soldiers\"\n# \"Left Behind\"\n# \"A Little Braver\"\n# \"Outshine The Brightest\"\n# \"Relight The Fire\" (acoustic)\nSingles\n* \"The Summer Sky\" (24 February 2010)\n* \"Hero\" (9 March 2011)\n* \"Here in Your Eyes\" (14 March 2011)\n* \"Give Me the World\" (30 June 2011)\n* \"Ghosts\" (12 September 2011)\n* \"O Holy Night\" (12 December 2011)\n* \"One Heart / Million Voices\" (30 April 2012)\n* \"Relight the Fire\" (1 December 2012)\n* \"Relight the Fire (Northie Remix)\" (12 April 2013)\n* \"Say It Like You Mean It\" (Pre-release Streamed 6 September 2013)\nReferences\nExternal links\n*[http://www.facebook.com/pages/New-Empire/15266621662#!/pages/New-Empire/15266621662?v=info New Empire] on Facebook\n*[https://twitter.com/newempireband New Empire] on Twitter"
    }
  ]
}