{
  "content": [
    {
      "type": "text",
      "text": "# New History Warfare Vol. 2: Judges\n\n| rev2 = cokemachineglow\n| rev2Score = (87%)\n| rev3 = InYourSpeakers\n| rev3Score = (79/100)\n| rev4 = konkret\n| rev4Score = (June 2011) \"best album of the year so far\"\n| rev5 = LA Times\n| rev5Score =\n| rev6 = Pitchfork Media\n| rev6Score = (8.2/10)\n| rev7 = Tom Hull\n| rev7Score = A−\n}}\nNew History Warfare Vol. 2: Judges is a studio album by musician/multi-reedist Colin Stetson. The album was released by Constellation Records in 2011.\nThe music on New History Warfare Vol. 2: Judges was captured entirely live in single takes at Montreal's Hotel2Tango studio, with no overdubs or looping (except for the French horn section on \"All the days I've missed you\", and guest vocals on various other tracks), using over 20 mics positioned throughout the live room. It features vocals from musician and performance artist Laurie Anderson (\"Judges\", \"A Dream of Water\", \"All the Colors Bleached to White (ILAIJ II)\", and \"Fear of the Unknown and the Blazing Sun\"), and lead-singer of My Brightest Diamond, Shara Worden (\"Lord I Just Can't Keep from Crying Sometimes\" and \"Fear of the Unknown and the Blazing Sun\").\nCritical reception\nTom Hull gave the album an A-minus and said Stetson's \"circular breathing turns the horn vamps into continuous tapestries, patterns repeating with various dissonances, and everything else just adds to the sonic interest.\" On June 16, the album was named as a longlisted nominee (one of 40) for the 2011 Polaris Music Prize. On July 6, the album was named as a shortlisted (one of 10) nominee for the 2011 award. In Review Online ranked the album number four on their list of the Top 15 Albums of 2011. Pitchfork placed the album at number 44 on its list of the \"Top 50 albums of 2011\". In 2013, the opening track \"Awake on Foreign Shores\" was featured in the film 12 Years A Slave, as well as appearing in 2014's The Rover.\nTrack listing\n# \"Awake on Foreign Shores\" &nbsp;–1:30\n# \"Judges\" &nbsp;– 5:13\n# \"The Stars in His Head [Dark Lights Remix]\tBell Orchestre\" &nbsp;– 5:30\n# \"All the Days I've Missed You (ILAIJ I)\" &nbsp;– 1:15\n# \"From No Part of Me Could I Summon a Voice\" &nbsp;– 2:15\n# \"A Dream of Water\" &nbsp;– 3:35\n# \"Home\" &nbsp;– 3:12\n# \"Lord I Just Can't Keep from Crying Sometimes\" &nbsp;– 4:49\n# \"Clothed in the Skin of the Dead\" &nbsp;– 3:40\n# \"All the Colors Bleached to White (ILAIJ II)\" &nbsp;– 0:36\n# \"Red Horse (Judges ll)\" &nbsp;– 2:57\n# \"The Righteous Wrath of an Honorable Man\" &nbsp;– 2:27\n# \"Fear of the Unknown and the Blazing Sun\" &nbsp;– 2:42\n# \"In Love and in Justice\" &nbsp;– 4:53\nReferences"
    }
  ]
}