{
  "content": [
    {
      "type": "text",
      "text": "# New York Historical book prizes\n\nThe New York Historical (formerly the \"New-York Historical Society\") gives three book prizes annually. From 2005 to 2012, there was one award for American history. A second award was added in 2013 for children's history. A third award was added in 2016 for military history.\nBarbara and David Zalaznick Book Prize in American History\nThe Barbara and David Zalaznick Book Prize in American History, prior to 2016 known as The New-York Historical Society American History Book Prize or, simply, the American History Book Prize, is an American literary award given annually by the New-York Historical Society for an adult non-fiction book on American history or biography, copyrighted in the year of the award, \"that is distinguished by its scholarship, its literary style and its appeal to a general as well as an academic audience.\" The winner receives an engraved medal, $50,000 cash and the unofficial title of American Historian Laureate. The inaugural award was presented in 2006 for books published in 2005.\nWinners\nDate is year when books were published; the following year is when the award was given. Thus the inaugural award was given in 2006 for Team of Rivals published in 2005.\n* 2005 Doris Kearns Goodwin, Team of Rivals: The Political Genius of Abraham Lincoln\n* 2006 David Nasaw, Andrew Carnegie (biography of Andrew Carnegie)\n* 2007 Daniel Walker Howe, What Hath God Wrought: The Transformation of America, 1815–1848\n* 2008 Drew Gilpin Faust, This Republic of Suffering: Death and the American Civil War\n* 2009 Gordon S. Wood, Empire of Liberty: A History of the Early Republic, 1789–1815\n* 2010 Ron Chernow, Washington: A Life (biography of George Washington)\n* 2011 John Lewis Gaddis, George F. Kennan: An American Life (biography of George F. Kennan)\n* 2012 Robert Caro, The Passage of Power: The Years of Lyndon Johnson\n* 2013 Andrew O'Shaughnessy, The Men Who Lost America: British Leadership, the American Revolution and the Fate of the Empire\n* 2014 Jill Lepore, The Secret History of Wonder Woman\n* 2015 Eric Foner, Gateway to Freedom: The Hidden History of the Underground Railroad\n* 2016 Jane Kamensky, A Revolution in Color: The World of John Singleton Copley\n* 2017 John A. Farrell, Richard Nixon: The Life\n* 2018 Benn Steil, The Marshall Plan: Dawn of the Cold War\n* 2019 Rick Atkinson, The British Are Coming: The War for America, Lexington to Princeton, 1775–1777\n* 2020 Tracy Campbell, The Year of Peril: America in 1942\n* 2021 Alan Taylor, American Republics: A Continental History of the United States, 1783–1850\n* 2022 Beverly Gage, G-Man: J. Edgar Hoover and the Making of the American Century\n* 2023 Jonathan Eig, King: A Life\n* 2024 Randall K. Wilson, ''A Place Called Yellowstone: The Epic History of the World's First National Park''\nNew-York Historical Society Children's History Book Prize\n'''The New-York Historical Society Children's History Book Prize''' was first awarded in 2013 for the best children's historical literature.\nWinners\n* 2013 Kristin Levine, The Lions of Little Rock\n* 2014 Helen Frost, Salt: A Story of Friendship in a Time of War\n* 2015 Pam Muñoz Ryan, Echo\n* 2016 Ann E. Burg, Unbound: A Novel in Verse\n* 2016 Firoozeh Dumas, ''It Ain't So Awful Falafel\n* 2017 Laura Atkins and Stan Yogi (Authors), Yutaka Houlette (Illustrator), Fred Korematsu Speaks Up\n* 2018 Ellen Klages, Out of Left Field\n* 2019 Erica Armstrong Dunbar and Kathleen Van Cleve, Never Caught: The Story of Ona Judge\n* 2021 Veera Hiranandani, How to Find What You're Not Looking For\n* 2022 Rodman Philbrick, We Own the Sky\n* 2023 Katherine Marsh, The Lost Year\nGilder Lehrman Prize for Military History\nThe Gilder Lehrman Prize for Military History at the New-York Historical Society was first awarded in 2016 for the best book on military history in the English-speaking world. Prior to 2016, the prize was known as the Guggenheim-Lehrman Prize in Military History, established in 2013 by the Harry Frank Guggenheim Foundation, the inaugural prize was awarded in February 2014. The purpose of the prize is to increase public attention to military history for educational purposes.\nWinners\n* 2013 Allen C. Guelzo, Gettysburg: The Last Invasion'' '\n* 2014 Alexander Watson, Ring of Steel: Germany and Austria-Hungary at War, 1914-1918\n* 2015 David L. Preston, ''Braddock's Defeat: The Battle of the Monongahela and the Road to Revolution\n* 2016  Peter Cozzens, The Earth is Weeping: The Epic Story of the Indian Wars for the American West\n* 2017 Cathal Nolan, The Allure of Battle: A History of How Wars Have Been Won and Lost\n* 2018 Andrew Lambert, Seapower States: Maritime Culture, Continental Empires and the Conflict That Made the Modern World\n* 2019 John C. McManus, Fire and Fortitude: The US Army in the Pacific War, 1941–1943\n* 2020 Alexander Mikaberidze, The Napoleonic Wars: A Global History\n* 2021 Kevin J. Weddle, The Compleat Victory: Saratoga and the American Revolution\n* 2022 Bruce Henderson, Bridge to the Sun: The Secret Role of the Japanese Americans Who Fought in the Pacific in World War II\n* 2023 Craig L. Symonds, Nimitz at War: Command Leadership from Pearl Harbor to Tokyo Bay''\nSee also\n* List of history awards\nReferences\nExternal links\n* [https://www.nyhistory.org/about/barbara-and-david-zalaznick-book-prize Barbara and David Zalaznick Book Prize in American History], official website.\n* [https://www.nyhistory.org/about/childrens-history-book-prize New-York Historical Society Children's History Book Prize], official website.\n* [https://www.gilderlehrman.org/programs-and-events/national-book-prizes/gilder-lehrman-prize-military-history Gilder Lehrman Prize for Military History], official website."
    }
  ]
}