{
  "content": [
    {
      "type": "text",
      "text": "# New Ho King\n\nNew Ho King ()  is a Chinese restaurant in Chinatown, Toronto. It first opened in 1976, and rose to popularity after being featured in Kendrick Lamar's 2024 diss track \"Euphoria\" and Drake's rebuttal \"Family Matters\" during the Drake–Kendrick Lamar feud. As of 2024, it is owned by Johnny Lu.\nHistory\nThe restaurant has been open since 1976, and has long been a \"favourite late-night Chinatown dinner spot\" among Toronto residents. Its current owner, Johnny Lu, has worked at New Ho King since he was 14 years old, and bought the restaurant in 2019.\nIn January 2016, a shooting occurred outside the restaurant, which left two dead and four injured.\nOn April 30, 2024, Lamar released \"Euphoria\", a diss track aimed towards Drake. New Ho King was briefly name-dropped, with \"I be at New Ho King eatin' fried rice with a dip sauce and a blammy, crodie.\" There are theories to Lamar's motives. Complex speculated it relates to when Drake was robbed at gunpoint in May 2009 in a Toronto restaurant. A few days later, on May 3, Drake released \"Family Matters\", which featured the restaurant in the music video, wherein Drake is seen with an array of dishes. In an interview, New Ho King's owner said that business had gone up 300% as a result of the mention. In honour of Lamar, the restaurant began offering the 'Kendrick Lamar special', a series of dishes featuring fried rice, deep fried shrimp with chili and crispy garlic, spicy fried chicken wings, and beef and broccoli.\nReception and legacy\nThe Toronto Star food critic Gerry Shikatani praised the restaurant in a 1999 review, writing, \"It is quite simple, not high-end dramatic. But servings are large, and few Cantonese kitchens are cooking with such accomplishment and light touch, while leaving an equally light trace on the wallet.\" Steven Davey of Now in 2011 found the food to be \"a little bit too salty and verging on over-cooked\" but said that was not a significant concern at 3:00am.\nThe reviewer Alexandra Clark in 2003 praised the restaurant's hot and sour soup, General Tso's chicken, and the garlic sauce flavoured eggplant and shrimp. In a 2008 review, Ben Kaplan of the National Post found the restaurant to be a \"Cantonese greasy spoon ... as good as we've tasted any hour of the day\". He praised the crispness of the pork chow mein but criticized the General Tso's chicken, writing, \"a harder fried outer coating might have provided a sharper contrast with the white chicken meat\".\nThe name of the queer Asian collective New Ho Queen was inspired by the restaurant.\nReferences"
    }
  ]
}