{
  "content": [
    {
      "type": "text",
      "text": "# New York Social Revolutionary Club\n\nThe New York Social Revolutionary Club was an anarchist group founded in 1880. Following a schism in the Socialistic Labor Party, the breakaway club reflected its members more revolutionary, anarchistic views. Its key figures included Wilhelm Hasselmann, Moritz Bachmann, and Justus Schwab.\nHistory\nThe American Socialistic Labor Party (SLP) suffered a schism in late 1880, as dissidents were driven from or left the party in opposition to its \"compromise\" of supporting the Greenback Party in the 1880 presidential election. From November to December, radical groups splintered out in urban immigrant communities driven towards what would be known as anarchism. These revolutionary clubs were primarily uncompromising German emigres cast out by Germany's Anti-Socialist Laws. They had lost faith in electoral change and authoritarian committees and instead believed in armed struggle and direct action to transform society. Splinter factions sprouted across the country—Boston, Philadelphia, Chicago, Milwaukee, St. Louis, but most notably, New York—and were the seeds of the American revolutionary anarchist movement.\nOn November 15, 1880, a group of New York socialists left the SLP to found a Social Revolutionary Club that reflected their more anarchistic views. Among the group's key figures were Wilhelm Hasselmann, Moritz Bachmann, and Justus Schwab.\nHasselmann was the club's central figure. A follower of Blanqui and Bakunin and previously a chemist and a socialist politician in Germany, Hasselmann emigrated to the United States earlier in 1880, having been cast out by Germany's Anti-Socialist Laws. He was driven further to anarchism by his August expulsion from the German Social Democratic Party, along with John Most. Bachmann later translated Bakunin's God and the State and wrote about anarchism. Schwab ran a Lower East Side saloon for radicals and was one of those expelled from the SLP after the Greenback compromise. Peter Knauer was another club founder.\nThe New York club was the impetus for the October 1881 Chicago Social Revolutionary Congress, the first national meeting of revolutionary socialists. Schwab represented the club at the congress. The New York club also organized a welcome reception for John Most the day of his arrival in the United States, in December 1882, with speeches from Schwab and Victor S. Drury.\nReferences\nBibliography\n*\nFurther reading\n* https://books.google.com/books?id=RsSlLCxOUkUC&pg=PA61\n* https://books.google.com/books?id=IX1awo2iK6YC&pg=PA61\n* https://books.google.com/books?id=ulnTCh7zbWwC&pg=PA72"
    }
  ]
}