{
  "content": [
    {
      "type": "text",
      "text": "# New Talent Singing Awards Toronto Audition\n\nNew Talent Singing Awards Toronto Audition (Chinese: 新秀歌唱大賽多倫多選拔賽), or NTSA Toronto for short, is an annual singing contest organized by Fairchild Television in Toronto that selects the city's representative in the New Talent Singing Awards International Finals organized by TVB in Hong Kong.\nNew Talent Singing Awards Toronto Audition 2009\nThe finals this year was held on Saturday, June 20, 2009 at Canada's Wonderland in Vaughan, Ontario.  The slogan for this year's contest is \"620 歌樂蜚聲Wonderland\" ( June 20: Music All Around Wonderland ).  The Masters of Ceremonies this year include Fairchild Radio DJs Poon Chun-Ming, Leo Shiu and Miss Chinese Toronto 2005 Elva Ni.  The special performing guest was cantopop group Soler from Hong Kong.  This year also included a band competition called e-Rock Band Competition and had 3 competitors.\nContestant list (Solo)\n{| class=\"wikitable\"\n|-\n! width=\"7%\" | Contestant Number\n! width=\"12%\"| English Name\n! width=\"12%\"| Chinese Name\n! width=\"30%\"| Placement\n|-\n! 1 || Billy Duong || 楊順智\n|\n|-\n! 2 || Carmen Chu || 朱嘉敏\n|\n|-\n! 3 || Yin Teng || 滕　茵\n|\n|-\n! 4 || Steven Xu || 徐常鑫\n|First Runner-up\n|-\n! 5 ||  Kanna Qiu || 邱嘉玲\n|\n|-\n! 6 ||  Megan Li || 李慧明\n| Second Runner-up, Stylish Charm Award, Most Popular Award, Most Fans Award\n|-\n! 7 || BenBen Huang || 黄麗冰\n| Best Stage Performance Award\n|-\n! 8 ||  Daniel Ting || 丁晧峯\n| Winner, Golden Voice Award\n|}\nContestant list (e-Rock band)\n{| class=\"wikitable\"\n|-\n! width=\"7%\" | Contestant Number\n! width=\"12%\"| Band Name\n! width=\"30%\"| Placement\n|-\n! 1 ||[http://www.enchanterband.net Enchanter] || e-Rock Division Winner\n|-\n! 2 || The Greenhouse Effect ||\n|-\n! 3 || Whitebase\n|\n|}\nPast Winners & notable contestants\nWinners chart\n{| class=\"wikitable\"\n|-\n! Year\n! Contestant\n! Contestant number\n! Song Selection\n! Placement\n|-\n| 1994 || Denise Ho 何韻詩 || 4 || 唯獨你是不可取替 || First Runner-up\n|-\n| 1997 || Sunny Shum 岑恩鎏 || 7 || 發現 || Winner\n|-\n| 1999 || Noella Choi 蔡瑋瑜 ||?? || My Heart Will Go On || Winner\n|-\n| 2000 || Lisa Chow 周麗嘉 || 3 || Saving All My Love For You || Winner\n|-\n| 2001 || Jing Lu 盧婧 || 8 || 真情人 || Winner\n|-\n| 2002 ||Philip Wei 韋景堯 ||7 || 熱情的沙漠 || Winner\n|-\n| 2003 ||Yan Fung 馮智賢|| 14 || 輸了你贏了世界又如何  || Winner\n|-\n| 2004 || Winona Xu 俆諾 || 9 || 站在高崗上 || Winner\n|-\n| 2005 || Patrick Lau 劉柏村 || 8 || 愛與誠 || Winner\n|-\n| 2006 || Bosco Lai 黎博灝 || 7 || 頭髮亂了 || Winner\n|-\n| 2007 || Kenneth Wu 武海峰 || 8 || 愛不留 || Winner\n|-\n| 2008 || Steve Li 李　鑫 || 8 || 美人魚 || Winner\n|-\n| 2009 || Daniel Ting 丁晧峯 || 8 || 最後一首歌 || Winner\n|-\n| 2010 || Jerry Lau 劉致理 || 9 || 最後一首歌 || Winner\n|-\n| 2011 || Titus Chu 朱永泉 || 6 || 給愛麗斯 || Winner\n|-\n| 2012 || Emily Hui 許家欣 || 6 || 星星 I'm not a star || Winner\n|}\nContestant careers\n*1997 Winner Sunny Shum 岑恩鎏 became a TV presenter for Fairchild TV hosted What's On from 1997 - 2000, MC in NTSA Toronto final in 2000..\n*1997 First Runner-up & Golden Voice Award winner Sandy Sun 孫小珊 is currently a DJ for Fairchild Radio in Toronto.\n*1998 Winner Noella Choi 蔡瑋瑜 went on to win the 2007 Ontario Independent Music Awards Best Female Award.  She has also written music and provided vocals for songs featured in various TVB series including Steps and Dance of Passion.  She has also released 2 albums.\n*1999 Winner Leo Siu 蕭嘉俊 hosted What's On from 2000 - 2004 and co-host NTSA Toronto in 2003.  He was also a presenter for TVB's entertainment news channel for a while during his time in Hong Kong.\n*2001 Winner Jing Lu 盧婧 Wrote several original songs and organized her own music band.\n*2002 Winner Philip Wei 韋景堯 sang a featured number in the Disney Movie Chicken Little 四眼雞丁.  Philip is now signed to Star Entertainment (HK).  On August 7, 2009 Philip (known to the public as 韋雄 Weixiong) released his debut mini-album \"Romance.\"\n*2003 Winner Yan Fung 馮智賢 held his debut concert, Getting Ready at the Ontario Science Centre in April, 2007.  Yan was signed to BanBan Music (the roster of which includes Kay Tse).\n*2003 First Runner-up June Tang 鄧芷茵 is now signed to Star Entertainment (HK).\n*2004 Second Runner-up Thomas Chong 莊子軒 now hosts What's On for Fairchild TV.\n*2004 Finalist \"Ivan Chan 陳廣偉 a.k.a. Jason Chan (陳柏宇)\" is now signed to Sony BMG Hong Kong\n*2006 Winner Bosco Lai is now working as a senior analyst at Macquarie in Houston, Texas.  He has now begun a career in country music karaoke.\n*2007 First Runner-up Susanna Chan 陳銘莉 now hosts What's On for Fairchild TV.\n*2007 Second Runner-up Alan Ho 何偉圖 now is back at HK\nToronto success in NTSA International\nHere is a Toronto representative who have won awards in the NTSA International Finals.\n* Jing Lu 盧婧: NTSA International 2001 Second Runner-up\n* Emily Hui 許家欣: NTSA International 2012 Second Runner-up\nNTSA Toronto 2007 flashing incident\nYumiko Cheng, special performing guest for the 2007 Finals, had a wardrobe malfunction when her tube dress slid down during her performance of a dance song, therefore exposing her nipples to the audience and cameras.  During the incident, there were several close-ups of her from the waist up captured by television cameras that clearly displayed her unintentional flashing.  Because the program was broadcast live in Toronto, the entire performance was aired without censoring. However, when the program was aired on time delay in Vancouver three hours later, the entire song in which the incident has happened was edited out.\nIt was later explained by her manager, Mani Fok, that the reason for Yumiko's tube dress sliding down was due to the dress not being able to withstand the weight of the headphones receiver that Yumiko was wearing for her performance.  Hence, the tube top started to slide down as Yumiko was dancing. When asked why Yumiko did not do more to secure her tubetop, Fok explained that the tube top was already secured by double-sided tape and that the receiver was also secured with duct tape upon clipping onto the tubetop.  Further protection procedures would make the tube dress too tight for Yumiko to wear.\nTrivia\n*2001 First Runner-up Candy Leung 梁敏菁 was a finalist at the NTSA Hong Kong Regional Finals in 2000.\n*2006 Finalist Danielle Li 李東妮 entered NTSA Vancouver in 2005 and made it to the semi-finals.\n*2007 Finalist Angela Zhang 張嘉妮 entered and won Calgary New Talent Singing Awards in 2005 and represented Calgary in the NTSA International Finals that year.\nSpecial performing guests\nFaichild TV would sometimes hire Asian singers or local artists to be the Special Guest(s) performing in the finals.\n*2000 Gabriel Harrison 海俊傑, Halina Tam 譚小環\n*2001 Fei Fei Ding 丁菲飛, Hei Wong 王喜\n*2002 Anthony Wong 黃耀明\n*2003 Jade Kwan 關心妍\n*2004 Denise Ho 何韻詩\n*2005 Ella Koon 官恩娜\n*2006 Janice Vidal 衛蘭\n*2007 Yumiko Cheng 鄭希怡\n*2008 Vincy Chan 泳兒\n*2009 Soler (band)\n*2010 Pong Nan 藍奕邦\n*2011 敖嘉年, 鄧小巧\n*2012 周柏豪\n*2013 Shine\n*2014 張繼聰\nSee also\n*New Talent Singing Awards\n*New Talent Singing Awards Vancouver Audition\n*Calgary New Talent Singing Awards\nReferences\nExternal links\n*[http://www.newtalenttoronto.com New Talent Singing Awards Toronto Audition Official Website]"
    }
  ]
}