{
  "content": [
    {
      "type": "text",
      "text": "# Newark Castle, Port Glasgow\n\nClyde]]\nThe bypass road gives views over parkland formerly crowded with shipyards\nOriginal gatehouse, tower house and corner tower\nThe barrel vaulted gatehouse entrance leads by a path to the main entrance\nThe mansion's main entrance is in its east wing\n1, 2, 3]]\nThe west wing\nNewark Castle is a well-preserved castle sited on the south shore of the estuary of the River Clyde in Port Glasgow, Inverclyde, Scotland, where the firth gradually narrows from the Firth of Clyde and navigation upriver is made difficult by shifting sandbanks. For centuries this location was used to offload seagoing ships, and led to the growth of Port Glasgow close to the castle on either side and to the south. When dredging techniques made the Clyde navigable as far as Glasgow the port became a shipbuilding centre, and the castle was surrounded by shipyards. Ferguson Shipbuilders, the last shipyard on the lower Clyde, stands close to the west of the castle, but the shipyards to the east were removed around the 1980s and new landscaped areas formed to the east of Newark Castle, opening up scenic views of the castle and across the Clyde from a new bypass road.\nHistory\nThe castle was built in 1478 by George Maxwell when he inherited the Barony of Finlanstone (Finlaystone) in the parish of Kilmacolm. The original castle had a tower house within a walled enclosure or barmkin entered through a large gatehouse. All that remains of the outer defensive wall is from one of the original corner towers. It is thought that there would have been a hall and ancillary buildings such as a bakehouse and brew house inside the walled enclosure.\nRenaissance mansion\nIn the late 16th century the castle was inherited by Sir Patrick Maxwell, a powerful friend of king James VI of Scotland and who was notorious for murdering two members of a rival family and beating his wife who left him after having 16 children. In 1597 Sir Patrick expanded the building, constructing a new north range replacing the earlier hall in the form of a three-storey Renaissance mansion. At this time the barmkin wall was demolished except for the north east tower, which was converted into a doocot. During these years, Maxwell was a feud with a neighbour Robert Montgomerie of Skelmorlie.\nThe central part of the mansion has cellars with tiny windows under a main hall with large windows, and other accommodation above that. An east wing with the main entrance door close to the main block links it to the original tower house which was suitably modified, and a short west wing connects to the gatehouse. The mansion has features of the Scottish baronial style including crow-stepped gables and north corners embellished with corbelled turrets. At the centre of its north wall a stairwell supported out on corbelling gives access to the upper floor.\nIn 1668 the Glasgow authorities purchased 18 acres (7 hectares) of land around Newark Castle from Sir George Maxwell who was then the laird, and developed the harbour into what they called \"Port Glasgow\". The last Maxwell died in 1694 and the castle had a series of non-resident owners. An early tenant was a ropemaker called John Gray who also dealt in wild animals such as big cats and bears which he obtained from ships visiting the Clyde and often housed in the castle cellars. The cellars and gardens were later rented by Charles Williamson who blocked access from the hall to stop the joiner John Gardner who rented the hall from stealing fruit stored in the cellars.\nJohn Smith in 1895 records that the stump of the dule tree were carefully preserved in the castle grounds.\nVisitor access\nNewark Castle came into state care in 1909 and is now a property of Historic Environment Scotland with excellent visitor facilities.\nSee also\n* Doocot (images of Newark Castle doocot)\n* Skelmorlie Castle Robert Montgomerie and Patrick Newall\n* List of Category A listed buildings in Inverclyde\n* List of listed buildings in Port Glasgow, Inverclyde\nReferences\nExternal links\n*\n*"
    }
  ]
}