{
  "content": [
    {
      "type": "text",
      "text": "# Newark Collegiate Academy\n\n| type              = Charter high school\n| established       = 2007\n| authority         = Knowledge Is Power Program (KIPP)\n| principal         = Bridgett HitchingsLindsay SchambachSean Larry Stevens\n| head              =\n| grades            = 9-12\n| enrollment        = 6,096 (as of 2022–23)\n| faculty           = 270.0 FTEs\n| ratio             = 22.6:1\n| us_nces_school_id = 340007000529\n| slogan            = \"Work Hard Be Nice.\"\n| conference        = Super Essex Conference (general)North Jersey Super Football Conference (football)\n| sports            = Football, Soccer, Basketball, Track and Field, Majorette, Cheerleading, and Boys and Girls Volleyball\n| mascot            =\n| image_size        = 250x200px\n| schoolboard       =\n| head_label        =\n| mascot image      =\n| teamname          = Panthers\n| colors            =  Navy Blue Sky Blue white\n| homepage          = [https://kippnj.org/schools/kipp-nca/ School website]\n}}\nNewark Collegiate Academy (NCA) is a four-year charter public high school located in Newark in Essex County, in the U.S. state of New Jersey, operating as part of the TEAM Academy Charter School network of charter schools in Newark run by the Knowledge Is Power Program (KIPP) which serves students in kindergarten through twelfth grade. NCA opened in August 2007 with plans to ultimately serve over 570 students, mostly matriculating from TEAM's middle schools, Rise and TEAM Academies.\nAs of the 2022–23 school year, the school had an enrollment of 6,096 students and 270.0 classroom teachers (on an FTE basis), for a student–teacher ratio of 22.6:1. There were 4,596 students (75.4% of enrollment) eligible for free lunch and 805 (13.2% of students) eligible for reduced-cost lunch.\nAwards, recognition and rankings\nThe school was the 288th-ranked public high school in New Jersey out of 339 schools statewide in New Jersey Monthly magazine's September 2014 cover story on the state's \"Top Public High Schools\".\nAthletics\nThe Newark Collegiate Academy Panthers compete in the Super Essex Conference, which consists of public and private high schools in Essex County and was established following a reorganization of sports leagues in Northern New Jersey under the auspices of the New Jersey State Interscholastic Athletic Association (NJSIAA). With 552 students in grades 10-12, the school was classified by the NJSIAA for the 2019–20 school year as Group II for most athletic competition purposes, which included schools with an enrollment of 486 to 758 students in that grade range. The football team competes in the National White division of the North Jersey Super Football Conference, which includes 112 schools competing in 20 divisions, making it the nation's biggest football-only high school sports league. The school was classified by the NJSIAA as Group II North for football for 2024–2026, which included schools with 484 to 683 students.\nSchool colors are navy blue and white. Sports offered by the school include volleyball (women), basketball (men), basketball (women), cross country (men), cross country (women), football, soccer (women), soccer (men), track and field spring (men), track and field spring (women), track and field winter (men) and track and field winter (women).\nReferences\nExternal links\n*[https://kippnj.org/schools/kipp-nca/ Newark Collegiate Academy website]\n*[https://nces.ed.gov/ccd/schoolsearch/school_detail.asp?Search=1&DistrictID=3400070&ID=340007000529 School data for TEAM Academy Charter School], National Center for Education Statistics\n*"
    }
  ]
}