{
  "content": [
    {
      "type": "text",
      "text": "# Newark, New York\n\n|established_title3       =\n|established_date3        =\n|unit_pref                = Imperial\n|area_footnotes           =\n|area_total_km2           = 14.05\n|area_land_km2            = 14.04\n|area_water_km2           = 0.01\n|area_total_sq_mi         = 5.42\n|area_land_sq_mi          = 5.42\n|area_water_sq_mi         = 0.01\n|area_water_percent       =\n|area_urban_km2           =\n|area_urban_sq_mi         =\n|area_metro_km2           =\n|area_metro_sq_mi         =\n|population_as_of         = 2020\n|population_footnotes     =\n|population_note          =\n|population_total         = 9017\n|population_density_km2   = 642.46\n|population_density_sq_mi = 1663.96\n|population_metro         =\n|population_density_metro_km2     =\n|population_density_metro_sq_mi   =\n|population_urban                 =\n|population_density_urban_km2     =\n|population_density_urban_sq_mi   =\n|population_blank1_title          =\n|population_blank1                =\n|population_density_blank1_km2    =\n|population_density_blank1_sq_mi  =\n|timezone                 = EST\n|utc_offset               = −5\n|timezone_DST             = EDT\n|utc_offset_DST           = −4\n|coordinates              =\n|elevation_footnotes      =\n|elevation_m              = 135\n|elevation_ft             = 457\n|postal_code_type         = ZIP Code(s)\n|postal_code              = 14513\n|area_codes                = 315 and 680\n|blank_name               = FIPS code\n|blank_info               = 36-49891\n|blank1_name              = GNIS feature ID\n|blank1_info              = 0958486\n|website                  = [http://www.villageofnewark.com Official website]\n|pop_est_as_of =\n|pop_est_footnotes =\n|population_est =\n}}\nNewark ( ) is a village in Wayne County, New York, United States,  south east of Rochester and  west of Syracuse. The population was 9,017 at the 2020 census. The Village of Newark is in the south part of the Town of Arcadia and is in the south of Wayne County. It is the most populous community in Wayne County.\nHistory\nThe current village includes the former \"Miller's Basin\" and \"Lockville\" prior to its own incorporation in 1839. The Village of Newark was incorporated in 1853. It was in Newark, New York that Jackson & Perkins Company, famous for its roses, was founded in 1872 by Albert Jackson and his son-in law Charles H. Perkins. The Perkins mansion is now listed on the historic register.\nThe Jackson–Perkins House, 310 High Street, is significant for its association with the growth and development of the Jackson and Perkins Company, one of the largest and best-known horticultural firms in the United States. The company was established in 1872 by Albert E. Jackson and his son-in-law, Charles H. Perkins, fruit growers and amateur gardeners, who had purchased the property in 1864.\nInitially, Perkins, a lawyer, banker and vice-president of Chase Bros. Nursery (Rochester) began experimenting with cultivating grapes and other fruits on the property; however, his growing passion for roses led to a substantial increase in horticultural activity, and in 1884 the company hired E. Alvin Miller, a professional propagator and breeder. This marked a substantial enlargement in the size and professionalism of the company, which began to cultivate roses and other ornamentals on a large scale. Although the growth of the company led to the acquisition of additional farms, the family's High Street estate remained the center of operations, with experiments in propagation taking place on site and the residence's library serving as the company's main office. In 1910, Charles Perkins's son, George C. Perkins, took over as president. Charles H. Perkins began living in Santa Ana, California during the winters where he began a large poultry business with his brother, Wyllys. He also had an orange ranch run by his oldest son Albert J. Perkins. After George C. resigned, his cousin Charles \"Charlie\" Perkins became president until the 1960s.\nIn the first decades of the twentieth century, Jackson and Perkins achieved worldwide fame, particularly for its roses. In 1908, the company received an award from the National Rose Society for Great Britain for the popular \"Dorothy Perkins\" climbing rose. During the 1920s and 30s the company's research directors were prolific in developing hundreds of new varieties and the company sold millions of plants. In addition to roses, Jackson and Perkins also became major distributors of clematis, lilacs, boxwoods, azaleas, and rhododendrons. After specializing in the wholesale trade for more than half a century, Jackson and Perkins's popular exhibit at the 1939 New York World's Fair led to its entrance into the retail market as a mail order business.\nDuring WWII the largest rose grower in the world folded in Germany due to the war. This left the door open for J&P to become the \"Rose Capital of America\" and the world's rose garden. Jackson and Perkins is now located in Hodges, South Carolina, a division of the Park Seed Co. and is a full service nursery that disseminates more than one million catalogues and ships more than three million roses and other plants to customers each year.\nIn 1852, Charles W. Stuart purchased a farm on what is now North Main St, and in need of an income he sold fruit trees door to door to area farms. This was the beginning of a direct selling business and C.W. Stuart Nursery became one of the largest wholesale nurseries in the country.\nIn 1949, the C.H. Stuart Co.(C.W. Stuart's son), with many successes direct selling, formed a small division, Sarah Coventry Inc., named after C.H. Stuart's great-granddaughter, Sarah Coventry Beale, which marketed costume jewelry until 1984.\nIn 1900, 4,578 people lived in Newark, New York; in 1910, 6,227; and in 1940, 9,646. Newark has become the industrial and retail center of the county. The Jackson–Perkins House and United States Post Office are listed on the National Register of Historic Places.\nRemnants of the former Enlarged Erie Canal Lock 59 (also called the Upper Lockville Lock) are located along North Clinton Street across from the current Lock 28B in Newark, just off N.Y. Route 31. It was a double-chamber lock built in 1841, and had a lift of  to the west. The former Enlarged Erie Canal Lock 58 (also called the Middle Lockville Lock) is a few blocks east off Lyons Street, but one of the chambers is being used by a scrap company. Volunteers cleared the other chamber as part of a canal trail project.\nLocated where Military Brook enters the canal on West Union Street is a little known remnant of the original Erie Canal. It is where Military Brook a.k.a. Whipspool Creek was routed UNDER the canal to the north side where it eventually flowed through the Newark Cemetery on its way to the Ganargua Creek.\nIn December 1954, the Hoffman Clock Museum was founded and opened within the Newark Public Library. The collection is named for Augustus Hoffman, Newark resident and Lyons watchmaker and jeweler who amassed much of the collection that now makes up the museum.\nThe village is part of the Erie Canalway National Heritage Corridor. Erie Canal Lock 28B is located below the bridge on North Clinton Street, just off N.Y. Route 31. It was built around 1913, and has a lift of  to the west.\nVillage of Arcadia\nThere was a community of Lockville, first settled circa 1805, approximately  on the east of what used to be known as Miller's Basin in the vicinity of the current East Union and Vienna streets. The name of 'Lockville' came from its location near three locks, numbered 57, 58 and 59, built on the original Erie Canal route. In 1839, Lockville became incorporated as the Village of Arcadia. It merged into Newark when that community was incorporated as a village in 1853.\nGeography\nNewark is located at . Newark is located along the southern edge of Wayne County, bordering Ontario County. According to the United States Census Bureau, the village has a total area of , of which,   is land and 0.19% is water. The center of the village is at Main Street (New York State Route 88) and Union Street (New York State Route 31). Route 31 runs next to the southern bank of the Erie Canal.\nDemographics\n}}\nAs of the census of 2010, there were 9,145 people, 3,842 households, and 2,256 families residing in the village. The population density was . The racial makeup of the village was 89.0% White, 5.0% Black or African American, 0.2% Native American, 0.4% Asian, 0.1% Pacific Islander, 2.9% from other races, and 2.4% from two or more races. Hispanic or Latino of any race were 7.4% of the population.\nThere were 3,857 households, out of which 31.8% had children under the age of 18 living with them, 42.5% were married couples living together, 15.5% had a female householder with no husband present, and 36.9% were non-families. 30.8% of all households were made up of individuals, and 14.7% had someone living alone who was 65 years of age or older. The average household size was 2.39 and the average family size was 2.94.\nIn the village, the population was spread out, with 25.4% under the age of 18, 7.4% from 18 to 24, 27.2% from 25 to 44, 22.2% from 45 to 64, and 17.8% who were 65 years of age or older. The median age was 38 years. For every 100 females, there were 87.8 males. For every 100 females age 18 and over, there were 81.8 males.\nThe median income for a household in the village was $32,542, and the median income for a family was $40,863. Males had a median income of $31,641 versus $23,588 for females. The per capita income for the village was $18,176. About 12.5% of families and 17.4% of the population were below the poverty line, including 28.4% of those under age 18 and 11.6% of those age 65 or over.\nHousing\nThere were 4,098 housing units at an average density of ; a total of 6.2% of housing units were vacant. There were 3,842 occupied housing units in the village, of which 2,082 were owner-occupied units (54.2%), while 1,760 were renter-occupied (45.8%). The homeowner vacancy rate was 1.9% of total units. The rental unit vacancy rate was 5.7%.\nGovernment\n*Mayor: Jonathan Taylor\n*Village Clerk/Treasurer Stephen Murawski\n*Trustee: Emily Howard\n*Trustee: Robert Bendix\n*Trustee: Stuart Blodgett\n*Trustee: Christopher Burgess\nNotable people\n*Esbon Blackmar (June 19, 1805 – November 19, 1857) was an American politician and a Whig Party U.S. Representative from New York.\n* Tom Burgess, Canadian football All-Star Quarterback. 78th Grey Cup MVP on Offense.\n* Admiral Leslie E. Gehres, Captain of the USS Franklin (CV-13).\n* Marvin I. Greenwood (1840–1917), lawyer and politician\n* Peter Hannan, television producer, writer, singer-songwriter, who created the animated series CatDog.\n* Charles R. Jackson, (1903–1968), author of The Lost Weekend\n* Doug Kent, Newark resident; professional ten-pin bowler; PBA and USBC Hall of Famer\n* Marilyn Leavitt-Imblum, noted needlework designer\n* Clarence MacGregor (September 16, 1872 – February 18, 1952), member of the United States House of Representatives (New York-R).\n* Javon McCrea, professional basketball player\n* Frances Miller Mumaugh (1860–1933), still-life painter\n* Lowell \"Bud\" Paxson, founder of Paxson Communications and Pax TV and the Home Shopping Network. Began his career as owner of local radio station WACK in 1957.\n* Helen Cary Russell (1870–1946), clubwoman, social leader, and magazine editor\n* Sybil Shearer (1912–2005), pioneer in modern dance, was raised in Newark, New York.Without Wings the Way is Steep: The Autobiography of Sybil Shearer\n* Paul J. Swain, Roman Catholic bishop\n* Harriet Van Horne (May 17, 1920 – January 15, 1998)\n* William Marvin, local business owner and philanthropist\n* Andrew Wantuck director, producer on Comedy Central, Golf Channel\nReferences\nExternal links\n*[https://www.villageofnewark.com/ Village of Newark (official website)]\n*[http://newarkarcadiamuseum.org/ Newark-Arcadia Historical Society & Museum]\n*[http://wayne.nygenweb.net/townships/arcadia.html Historical links for Newark area]\n*\n*"
    }
  ]
}