{
  "content": [
    {
      "type": "text",
      "text": "# Newark immigration detention center incident\n\n| Location = Delaney Hall, an immigration detention center in Newark, New Jersey\n| arrests = Mayor Ras Baraka (charges dropped)\nRep. LaMonica McIver (charges pending)\n}}\nOn May 9, 2025, a confrontation and subsequent skirmish between law enforcement and four Democratic politicians occurred at Delaney Hall, an immigration detention center in Newark, New Jersey. Ras Baraka, the mayor of Newark, was arrested and charged with trespassing, but the charges were later dropped. LaMonica McIver, one of the three U.S. Representatives from New Jersey involved, was later charged with three counts of assaulting or interfering with a federal officer. McIver rejected the charges as an attempt at political intimidation.\nBackground\nCongressional authority\nMembers of Congress have legal authority to conduct unannounced oversight visits at detention centers run by the Department of Homeland Security (DHS).\nDelaney Hall\nDelaney Hall is a 1,000-bed immigrant detention center in Newark, New Jersey, operated by GEO Group, an institutional facilities company. The facility opened in 2000 and closed in 2017. U.S. Immigration and Customs Enforcement (ICE) awarded GEO Group a  billion contract for fifteen years to reopen Delaney Hall in February 2025. The contract included funds to establish a federal immigration processing center. The detention center began receiving migrants in May. It is the largest detention center on the East Coast of the United States.\nSeveral protests have occurred against Delaney Hall, including daily prayer vigils. Newark sued GEO Group in New Jersey Superior Court in March, alleging that the facility did not have a valid certificate of occupancy. In April, the case was transferred to federal court, where a judge was weighing Newark's request to close the facility \"pending inspection and compliance with local, State, and administrative codes\". The city's mayor, Ras Baraka, told immigrant rights activists in March that he would padlock the building to prevent it from opening.\nIncident\nSometime between 1:00pm and 1:15pm on May 9, 2025, three Democratic representatives from New Jersey—Bonnie Watson Coleman, Rob Menendez, and LaMonica McIver—arrived at Delaney Hall for an unscheduled oversight visit. They went up to the gated fence separating the parking area on the grounds of Delaney Hall from the public property outside the premises, and they spoke to the guards through the fence, explaining who they are and that members of Congress can make unannounced oversight visits to detention facilities. After a few minutes, the gate opened to allow a car to enter, and the three representatives walked onto the grounds before the gate closed. They spoke further with the guards, and soon after, DHS officers approached and took them to a waiting room inside Delaney Hall. Menendez later said that they were then \"told to wait for ICE brass from Newark to arrive.\"\nBaraka arrived around 1:40pm, and he initially remained on the public property outside the premises. A number of protesters were also on the public property. About ten minutes later, as Baraka was speaking to a guard on the other side of the fence, the guard opened the gate and allowed Baraka and his bodyguards to enter the grounds, where they then waited near the gate, which closed after they were let in. The video footage contradicts accusations that he had barged into the facility without permission. Baraka later stated that the guard had invited him in, saying that it might \"calm the crowd\" of protesters.\nAt 2:33pm, several Homeland Security Investigations (HSI) officers came out of Delaney Hall, walked over to where Baraka was waiting, and asked him to leave the property, telling him that he would be arrested otherwise. Watson Coleman later said that she, McIver, and Menendez had been in the waiting room up until that point, waiting for their oversight tour, and that \"all of the ICE officials from the state of New Jersey at the highest levels came to the detention facility, and we thought it was to resolve our issue of taking the tour. So they came, they said hello, and the next thing we saw, they ran outside.\" The three members of Congress followed them out and saw that the mayor was there. The officers were talking to him, and the lawmakers walked over to join the discussion.\nThe officials told Baraka that he would be arrested if he didn't leave. One of the HSI officers displayed handcuffs, which McIver called \"unnecessary\" and \"ugly\". Watson Coleman encouraged everyone to remain calm, and she and Baraka walked together to the gate after one of the officers said \"All right, then. Walk out.\" At 2:39pm, the gate opened, and Baraka and his bodyguards walked through and back onto the public property outside the premises. The gate closed, and through the fence, Watson Coleman told Baraka \"We will be your eyes and your ears and we will report to you, mayor.\"\nThe three members of Congress then walked back across the grounds towards the Delaney Hall entrance. Watson Coleman later said that they thought they would finally be able to have their oversight tour, but \"noticed that ICE and officials were huddling and having a discussion\", so they decided to \"wait and see what was going on.\" She, McIver, and Menendez saw that the officials were on the phone with someone and then heard one of them say that they were going to arrest Baraka, at which point Menendez walked back to the gate to alert him, again talking with him through the fence. Baraka responded that they couldn't arrest him because he was no longer on ICE property.\nSomewhere between 12 and 20 ICE and HSI officers then grouped on the Delaney Hall side of the gate, and at 2:44pm, it opened, and they moved onto the public property to arrest Baraka. The three members of Congress followed them out the gate. An aide to Watson Coleman started yelling \"Circle the mayor, circle the mayor\", and several people—including the members of Congress, aides, and protesters—encircled Baraka, forming a human shield in an attempt to prevent the arrest. The ICE and HSI officers tried to push through to Baraka, and McIver was heard saying \"Don't touch us, don't touch us.\" McIver, Watson Coleman, and Baraka were next to each other at the center of the crowd. It turned into a melee with people pushing and shoving. Some in the crowd were yelling to the officers \"Don't touch her\" and \"Don’t put your hands on her\", apparently referring to the two congresswomen.\nThe chaotic scrum continued for about 90 seconds, with the officers attempting to pry Baraka from the group in order to arrest him. Eventually the officers pulled Baraka away from the people trying to shield him. According to The Washington Post, \"Video captures multiple instances in the scrum when McIver and federal agents made physical contact, beginning with one in which a Homeland Security agent gripped her arm and she pulled her hand up to break away.\" The Jersey Vindicator reported that she also yelled \"'Get your hands off of me' after an agent grabs her shoulders.\" The Associated Press stated that \"At one point her left elbow and then her right elbow push into an officer wearing a dark face covering and an olive green uniform emblazoned with the word 'Police' on it. It isn't clear from bodycam video whether that contact was intentional, incidental or a result of jostling in the chaotic scene.\" During this time, one video showed an officer who \"lifts a weapon with a long black barrel that he holds with both hands and points it at various people in the crowd\" without firing. Menendez said later that all of the officers were armed.\nAfter pulling Baraka away, the federal officers arrested him, handcuffed him, and took him back onto the Delaney Hall grounds. This occurred at about 2:46pm, and 20 minutes later, vehicles exited the grounds, taking Baraka to an ICE field office elsewhere in Newark. Meanwhile, the three members of Congress, still being jostled, worked their way back onto the Delaney Hall grounds, where McIver exchanged words with some of the officers. She was \"heard screaming at officers and saying, 'Ma'am, he just assaulted me.'\" As McIver attempted to get back onto the grounds, The New York Times described her as both \"pushing toward the gates and being pushed from behind\".  Then the three lawmakers went back into Delaney Hall, where they were finally given their oversight tour.\nThe lawmakers left Delaney Hall at 3:48pm, and held a short press conference on the public property outside. McIver said that if the officers could treat a mayor and members of Congress as they did, they would not treat anyone with respect or dignity. Watson Coleman called what happened \"the weaponization of law enforcement\", and it meant that \"none of us are safe.\" When the press conference ended, Watson Coleman and Menendez drove to the ICE field office where Baraka was being held, and waited with a crowd for his release. He was released about five hours after he was arrested.\nAftermath\nBaraka was federally charged for allegedly trespassing. He later briefly returned to Delaney Hall and appeared in court on May 15, in a perfunctory hearing scheduling further action. The previous day, Baraka released video clips showing him being allowed to enter the grounds, leaving the grounds, and later being arrested outside.\nThe day of the arrest, the DHS released a statement alleging that \"a group of protestors, including two members of the U.S. House of Representatives, stormed the gate and broke into the detention facility.\" DHS spokeswoman Tricia McLaughlin indicated that Watson Coleman, Menendez, and McIver might face assault charges, and stated that DHS had video of the three \"assaulting\" the officers, \"including body slamming a female ICE officer.\" DHS secretary Kristi Noem later accused the lawmakers of \"committing felonies... and attacking people who stand up for the rule of law.\"\nMenendez said the melee could have been avoided, and the incident \"should have ended\" when Baraka walked out the gate and back onto the public property. He repeatedly described what occurred as a \"clear act of intimidation\", at one point saying that that \"is what this administration is entirely about\", and that it was \"intended to intimidate not just the mayor, but the three of us and everyone watching today.\" McIver said \"We were met with contempt, disrespect, and aggression from ICE. From roughing up members of congress to arresting the mayor of our state's largest city, there is no version of today that does not show the blatant abuses of power of the Trump administration.\" McIver alleged that the lawmakers had been \"assaulted by multiple ICE agents\". Menendez added \"It's something that I never thought I would see, to see how physical they were with the mayor of the largest city of New Jersey and three members of Congress.\"\nOn May 19, Alina Habba, the acting US attorney for the district of New Jersey, announced that McIver had been charged with assaulting, impeding and interfering with law enforcement, and the charges against Baraka had been dropped. Habba had not yet sought a grand jury indictment against McIver. Federal rules gave her 30 days to do so. The criminal complaint against McIver alleges that she used \"each of her forearms to forcibly strike\" one officer, and \"slammed her forearm\" into another, \"forcibly\" grabbing him as she \"reached out and tried to restrain\" him. Menendez responded that officers had assaulted McIver and put their hands on all three of the lawmakers, and \"the administration should be apologizing to Rep. McIver, not arresting her on unprecedented, politicized charges\". McIver responded that the charges against her \"mischaracterize and distort my actions\" and were filed for political reasons. She also said that she had been offered a plea deal, but rejected it, as she would not admit to something she had not done. It is rare for sitting members of Congress to be charged with crimes other than fraud or corruption.\nA hearing on Baraka's trespassing charges was held on May 21 before federal magistrate judge Andre Espinosa, who formally dismissed the charges and spent several minutes criticizing the actions of the US attorney's office, calling Baraka's arrest \"hasty\" and \"a worrying misstep\". After the hearing, Baraka was heard on a hot mic saying \"Jesus, he tore these people a new asshole.\"\nAlso on May 21, McIver had a hearing before federal magistrate judge Stacey Adams, who released McIver on her own recognizance. One of the lawyers she hired, Paul J. Fishman, previously held the position now held by Habba. McIver has stated that it will be expensive for her to fight the charges, leading some Democrats to send fundraising emails on her behalf.\nOn June 3, 2025 Baraka filed suit against Habba and Ricky Patel, the HSI officer who supervised the arrest, for false arrest and malicious prosecution. It also alleges that Habba defamed him in her public comments about the incident.\nOn June 10, 2025, Habba announced that a federal grand jury had indicted McIver on three counts of assaulting, resisting, impeding, and interfering with federal officials. McIver responded that the case is \"a brazen attempt at political intimidation\". The Associated Press reported that based on law enforcement bodycam video that has been made public, it is difficult to determine whether the allegations stem from \"contact [that] was intentional, incidental or a result of jostling in the chaotic scene.\" At her arraignment hearing, McIver pleaded not guilty, and Judge Jamel Semper set a trial date of November 10.\nIn mid-August, McIver's lawyers filed several motions. They argued for dismissal on the grounds that she's protected by the US Constitution's speech or debate clause, and that she is being selectively prosecuted. In another motion, they asked Semper to order the government to produce certain evidence they alleged it had failed to turn over. They also asked Semper to order the government to stop making prejudicial comments about the case in public. In one of their filings, the lawyers described some of the bodycam recordings that had been turned over. They said the footage included audio of the HSI official who had been on the phone before Baraka's arrest, and that the official told other officers that Todd Blanche, the deputy attorney general, had ordered the arrest. Politico identified that official as Ricky Patel, one of the people against whom Baraka has filed suit.\nOversight\nIn a May 9 interview, Watson Coleman reported that their oversight tour showed that the facility was clean, but the detainees did not have the access that they should to immigration attorneys.\nResponses\nThe incident became a \"partisan flashpoint\", according to Politico. The incident was widely discussed in conservative media, which repeated the claim that Democrats had \"stormed\" the facility. The New York Times reported that \"Republicans have seized on the episode to portray Democrats as more interested in protecting the immigrants with criminal records they said are being held inside the facility than U.S. citizens\", and that the Trump administration had sought to cast the incident as \"a violent mob attack on federal officers\". Both Democrats and Republicans pointed to video footage from body cameras of the incident to accuse each other of instigating the scuffle. The New York Times stated that the federal government's narrative that the lawmakers had \"stormed\" the facility was contradicted by video footage and several witnesses at the scene.\nNew Jersey\nBaraka's arrest was condemned by Democrats, including state governor Phil Murphy, senators Andy Kim and Cory Booker, representatives Frank Pallone, Mikie Sherrill and Josh Gottheimer, Jersey City mayor Steven Fulop, and former New Jersey Senate president Stephen Sweeney. Kim said that he was discussing the incident with ICE officials and DHS secretary Kristi Noem. Bob Hugin, the chair of the New Jersey Republican Party, former radio host Bill Spadea, and former assemblyman Jack Ciattarelli condemned Baraka.\nTwo hundred thirty-one faith leaders in the state signed a letter of support for McIver, saying that the charges are \"a politically motivated campaign designed to tarnish the reputation of a public servant who has tirelessly fought for justice and equity.\"\nNational\nHouse minority leader Hakeem Jeffries and Senate minority leader Chuck Schumer defended Baraka on social media.\nThe House Judiciary Subcommittee on Oversight announced a hearing into the incident. Representative Buddy Carter introduced a measure that would strip Coleman, Menendez, and McIver of their committee assignments. Representative Marjorie Taylor Greene said that McIver should be expelled from the House, and on May 21, Representative Nancy Mace filed a resolution to do so. Representative William Timmons filed a resolution to censure McIver. Yvette Clark, chair of the Congressional Black Caucus, said that Trump had \"weaponized\" the Department of Justice and was using McIver as \"to intimidate Congress into submission\". A group of eleven Republican former members of Congress released a statement condemning the charges. One of them, Claudine Schneider, called it \"outrageous\" and said \"Every member of Congress, both past and present, should be speaking up. If not, we will very soon lose our ability to do so.\" Senators Cory Booker, Raphael Warnock, Angela Alsobrooks, and Lisa Blunt Rochester condemned the charges against McIver, describing them as \"efforts to intimidate her and silence those who seek to hold this administration accountable\", and as taking resources away from actual public safety concerns. She has also received support from Democrats in the House, including Maxwell Frost, Pramila Jayapal, Alexandria Ocasio-Cortez, and Delia Ramirez.\nWhen asked, President Trump said that he had \"no idea\" who McIver was, but \"That woman was out of control\". In a congressional hearing, Noem testified that a \"mob of protesters including three members of Congress stormed the gate and they trespassed into the detention facility.\"\nSee also\n* Deportation in the second presidency of Donald Trump\n* Detention and deportation of American citizens in the second Trump administration\n* 2025 United States protests against mass deportation\nReferences\nExternal links\n* [https://www.courtlistener.com/docket/70514976/united-states-v-mciver/ United States v. McIver], 2:25-cr-00388 (D.N.J.) criminal court docket\n* [https://www.nytimes.com/interactive/2025/05/23/us/mayor-baraka-judge-dismissal.html Transcript of the May 21, 2025 court hearing] where the charge against Baraka was formally dismissed.\n* [https://www.courtlistener.com/docket/70445695/baraka-v-habba/ Baraka v. Habba], 2:25-cv-06846 (D.N.J.) court docket\n* [https://www.courtlistener.com/docket/70317726/united-states-v-mciver/ United States v. McIver], 2:25-mj-15118 (D.N.J.) court docket"
    }
  ]
}