{
  "content": [
    {
      "type": "text",
      "text": "# Newark Days\n\nNewark Days is an annual celebration that takes place in Newark, California every September to celebrate the incorporation of the city of Newark on September 22, 1955. In its current form it is a four-day event, Thursday through Sunday, in mid to late September. It is centered on Newark Community Park & Community Center as well as the adjacent MacGregor School Grounds. In addition to carnival rides, food and game booths, and stage shows, it includes a race and a parade along \"the Newark Mile\" (a stretch of Newark Blvd.) on the Saturday morning. Annual attendance for the celebration is more than 100,000.\nHistory\nWhat is now called Newark Days was originally planned by members of the Newark Chamber of Commerce. They later turned the festivities over to the Jaycees. In the 1960s a group called \"Newark Birthday Celebration\" was formed. However, the event was not put on during the late 1960s.\nIn 1972, Shirley Sisk called a meeting to see if there were enough volunteers to plan an event for that September. Interest was high, and \"Newark Days Celebration\" was formed. The Newark Rotary club brought in a carnival, and the committee put together food booths and games at the Pavilion. The weekend was a huge success, and a nonprofit corporation (Newark Days Celebration, Inc.) was formed to make it a regular annual event. Newark Days Celebration, Inc. has continued to organize the event with a fully volunteer executive board and committee of approximately 30 members that work year-round, with more than 100 additional volunteers that join to assist at the event itself.\nIn 2005, Newark Days celebrated Newark's 50th anniversary with a 1950s theme and the return of Arknew, a kangaroo that was Newark's old town mascot.\nThe festival was held virtually in 2020 due to concerns around COVID-19. The 2021 celebration was cancelled just weeks before the event due to increasing infection numbers from the COVID Delta variant. Newark Days returned in 2022 with a full in-person festival.\nThemes\nThe celebration has a theme that is determined every year, which influences the feel of the event through items such as decorations, t-shirt design, and tailored parade entries. The following have been the Newark Days themes:\n*1988\tEvery Day's a Holiday\n*1989\tPeople, Pride & Progress\n*1990\tThe Magic of Newark\n*1991\tNewark Then & Now\n*1992\tWhere Fairy Tales Come True\n*1993\tRailroad Days\n*1994\tThe Best of the West\n*1995\tRemembering When\n*1996\tThere's No Place Like Home\n*1997\tIt's a Small World\n*1998\tUnder the Big Top\n*1999\tEvery Day's a Holiday\n*2000\tThe Sounds of Music\n*2001\tNewarks of the World\n*2002\tCelebrate America\n*2003\tEvery Day's a Holiday\n*2004\tExploring the West\n*2005\t50 Golden Years\n*2006\tIt's all Here\n*2007\tCirque de Newark\n*2008\tCelebrate America\n*2009\tCelebrating the Arts\n*2010\tColor the World\n*2011\tFantasy Comes Alive\n*2012   Country Jamboree\n* 2013\tAll That Jazz\n* 2014  Be a Kid Again\n* 2015\tSet Sail for Newark\n* 2016\tVoyage to the Stars\n* 2017\tA Jungle Adventure\n* 2018\tIt's a Wizard's World\n* 2019  Heros Are Super\n* 2020  Celebrate Virtually\n* 2021  (Cancelled due to COVID Delta Variant)\n* 2022  Under the Sea\n* 2023  Newark Rocks!\n* 2024  Let the Games Begin\n* 2025  Celebrating the 70s\n* 2026  Adventure is Just a Page Away\nExternal links\n* [http://www.newarkdays.org/ Newark Days Official Website]\n* [http://www.cxc4l.org/newarkmile/index.html Newark Mile Official Website]\nReferences"
    }
  ]
}