{
  "content": [
    {
      "type": "text",
      "text": "# Newark School of Fine and Industrial Art\n\nNewark School of Fine and Industrial Art (NSFIA) was a city-run vocational and art school in Newark, New Jersey. Opened in 1882 as the Evening Drawing School, its name was changed in 1909 to the Fawcett School of Industrial Arts, and changed again in 1928 to the Newark Public School of Fine and Industrial Art. The name was shortened to Newark School of Fine and Industrial Art some time later. It moved into a new building in 1931.\nA number of well-known artists served on the faculty at Newark over the years, including the prolific illustrator and graphic designer Irv Docktor and painter John R. Grabach. Others included Enid Bell, Gustave Cimiotti, Hannes Beckman (design and color), Hillaire Hiler (color), Joseph Konzal (sculpture), Gerson Leiber (print making), Leopold Matzal (portrait), Reuben Nakian (sculpture), Robert Conover, Leo Dee, Jane Burgio, and Grigory Gurevich. Ida Wells Stroud taught there from c.1907 to 1943. The painter Avery Johnson taught at the Newark School from 1947 to 1960. In addition to teaching there, the painter Gustave Cimiotti, Jr. served as director of the school from 1935 to 1943. Henry Gasser, well known for his paintings of Newark, served as director from 1946 to 1954.\nThe school closed its doors in 1997 when, in the midst of a budget crisis for the Newark public school system, it was decided that public schools would only operate K-12 schools. The school was originally housed within the same building as the Newark Arts High School. The college moved from that facility due to lack funding in the early 1990s and was relocated to Lyons Avenue until its 1997 closure.\nNotable alumni\n* J. Clayton \"Clay\" Conroy\n* Leo Dee\n* Irv Docktor\n* Carla Dunlap\n* Helen Frank\n* John D Howard Jr\n* Don Martin\n* Santo Pezzutti\n* Nicholas Reale\n* Eli Reed\n* Bill Sienkiewicz\n* Grif Teller\n* Charles Waterhouse\n* Robert Rahway Zakanitch\nReferences\n*Peter C. Merrill, \"[https://books.google.com/books?id=9jSH20VIOpsC&q=german+Immigrant+artists+in+america German Immigrant Artists in America: A Biographical Dictionary]\", p.&nbsp;174, Scarecrow Press, Jan 1, 1997\nExternal links"
    }
  ]
}