{
  "content": [
    {
      "type": "text",
      "text": "# Newspaper Rock State Historic Monument\n\n| location = 20 Mi. SE of Canyonlands at Newspaper Rock State Park\n| nearest_city = Monticello\n| area = Canyonlands NP\n| built =\n| governing_body =\n| owner = Utah State Parks Commission\n| height =\n| elevation = 6080 ft\n| designation1 = National Register of Historic Places\n| designation1_offname = Newspaper Rock State Historic Monument\n| designation1_date = March 15, 1976\n| designation1_number = 76001833\n| designation2 =\n| designation2_offname =\n| designation2_date =\n| designation2_number =\n}}\nNewspaper Rock State Historic Monument is a Utah state monument featuring a rock panel carved with one of the largest known collections of petroglyphs. It is located in San Juan County, along Utah State Route 211,  northwest of Monticello and  south of Moab.\nIt is along the relatively well-traveled access road into the Needles district of Canyonlands National Park,  from US 191 and  from the park boundary. The  rock is a part of the vertical Wingate sandstone cliffs that enclose the upper end of Indian Creek Canyon, and is covered by hundreds of petroglyphs&mdash;one of the largest, best preserved and easily accessed groups in the Southwest. The petroglyphs feature a mixture of human, animal, material and abstract forms.\nNewspaper Rock was designated a State Historical Monument in 1961, and was added to the National Register of Historic Places listings in San Juan County, Utah as Indian Creek State Park in 1976.\nIn Navajo, the rock is called \"Tse' Hone'\" which translates to \"rock that tells a story\".\nPetroglyphs\nPeople of the Archaic, Basketmaker, Fremont, and Ancestral Puebloan cultures carved petroglyphs on Newspaper Rock from around the beginning of the current era until about 1300. Ute, Navaho, and Anglo people have also left carvings on the rock in historic times. There are over 650 rock art designs. The drawings on the rock are of different animals, human figures, and symbols. These carvings include pictures of deer, buffalo, and pronghorn. Some glyphs depict riders on horses, while other images depict past events. While precisely dating the rock carvings has been difficult, repatination of surface minerals reveals their relative ages. The reason for the large concentration of the petroglyphs is unclear. One suggested explanation is that the rock was used as a place for communication through the petroglyphs between travelers.\nThe pictures at Newspaper Rock were inscribed into the dark coating on the rock, called desert varnish. Desert varnish is mainly made up (~70%) by clay materials, but gets its blackish color from iron and manganese oxide deposits that gradually form on exposed sandstone cliff faces owing to the action of rainfall and bacteria. The ancient artists produced the many types of figures and patterns by carefully chipping the coated rock surfaces with sharpened tools to remove the desert varnish and expose the lighter rock beneath. The older figures are themselves becoming darker in color as new varnish slowly develops.\nDepiction of Polydactyly\nMany of the petroglyphs appear to be depicting polydactyly, the condition of having an extra toe or finger. In other Puebloan sites, burial remains with bifid metatarsals have been found near petroglyphs depicting polydactyly, suggesting that the pictures factually represent a real physical abnormality. One team of anthropologists excavated 96 skeletons from the nearby site of Pueblo Bonito and found that 3.1% of the skeletons had an extra toe on the right foot. This is a significantly higher rate of polydactyly than is seen in current Native American populations. There was evidence towards those with six toes being buried with items associated with higher social status, like an ornate bracelet, and turquoise. Polydactyl is also considered a moderately heritable condition, with 30-35% of those displaying the distinction also having a close relative with polydactyl. This means that it may be possible to use polydactyl to reconstruct ancient Puebloan lineages.\nSee also\n* Painted Rock Petroglyph Site\n* Tutuveni\nReferences\nExternal links\n* [https://web.archive.org/web/20160415230730/http://www.blm.gov/ut/st/en/prog/more/cultural/archaeology/places_to_visit/Newspaper_Rock.html US Department of the Interior Bureau of Land Management page on Newspaper Rock]\n* [http://www.jqjacobs.net/rock_art/newspaper.html Newspaper Rock Petroglyph Panel] 8.5 x 11, 600 dpi, black-on-white rendition of entire panel."
    }
  ]
}