{
  "content": [
    {
      "type": "text",
      "text": "# Next Czech presidential election\n\nPresidential elections will be held in the Czech Republic no later than January 2028. The incumbent president Petr Pavel is eligible to run for another term, and the election will most likely be direct.\nBackground\n2023 election\nAt the previous election in January 2023, Petr Pavel was elected for his first term defeating former Prime Minister Andrej Babiš. His inauguration was held on 9 March 2023.\nSince 2023 election\nFortuna made a list of odds for the 2028 presidential election soon after the 2023 election. Petr Pavel was viewed as front runner. Other potential candidates with a chance to win included Prime Minister Petr Fiala, Minister of Interior Vít Rakušan and President of the Senate Miloš Vystrčil. Petr Pavel said on 6 March 2023 that he might not seek reelection, as he considers it \"reasonable that a person remains in such an office for only one term\". He added that when there are two presidential terms possible, the president could behave during their first term to be reelected, in order to enjoy their second term. 2023 presidential candidate Danuše Nerudová confirmed her intention to run on 20 March 2023 stating \"I hope that optimism to run again won't leave me in 5 years.\"\nOn 8 March 2024 Pavel suggested for the first time that he might seek reelection. He stated that it would depend on the political and social situation and also on whether he had the support of his family.\nCandidates\nSpeculative\n* Pavel Fischer, Senator and candidate in the 2018 and 2023 elections, did not rule out becoming a candidate again when asked, commenting \"you will hear from me again.\"\n* Dominik Hašek, ice hockey player, stated in 2020 that he plans to run for president in 2028.\n* Karel Janeček, mathematician, entrepreneur and 2023 candidate, did not rule out standing.\n* Věra Jourová, former Minister of Regional Development, former Vice President of the European Commission for Values and Transparency and former European Commissioner for Justice, Consumers and Gender Equality from 2014 to 2019, stated on 21 February 2025 that she would closely watch who is running if Pavel decides to not run for a second term, which might \"ignite a Messiah complex in [her]\".\n* Michael Kocáb, composer, singer, political activist and former Minister for Human Rights and Minorities, stated on 5 October 2023 that he intends to run in the next presidential election.\n* Danuše Nerudová, economist, MEP and candidate in the 2023 election, said on 20 March 2023 that she is interested in running.\n* Pavel Novotný, Mayor of Řeporyje, stated that he will seek nomination for the 2028 election.\n* Petr Pavel, the incumbent President, is eligible to run for second term.\n* Tomáš Sedláček, economist expressed interest in running.\n*Miroslav Sládek, former presidential nominee and leader of the Rally for the Republic – Republican Party of Czechoslovakia (SPR–RSČ), co-organised a demonstration held on 9 May 2025 where he started gathering signatures for his presidential nomination. He is supported by Czech Republic in First Place!.\nDeclined\n* Andrej Babiš, MP, former Prime Minister and ANO nominee in the 2023 presidential election, announced on 5 April 2023 that he will not run again.\n* Marek Hilšer, Senator and candidate in the 2018 and 2023 elections, stated after his defeat in 2023 that he doesn't feel like running again, adding that twice is enough.\nOpinion polls\n{| class=\"wikitable\" style=text-align:center;font-size:85%;line-height:14px;\"\n|-\n! rowspan=\"2\"|Date !! rowspan=\"2\"|Agency !! Petr Pavel !! Andrej Babiš !! Marek Eben !! Karel Havlíček !! Tomio Okamura !! Danuše Nerudová !! Alena Schillerová !! Jiří Drahoš !! Pavel Fischer !! Filip Turek !! Václav Klaus !! Miloš Vystrčil !! Petr Fiala !! Vít Rakušan !! Martin Kuba !! Miroslava Němcová\n|-\n! style=\"background:; width:40px;\"|\n! style=\"background:; width:40px;\"|\n! style=\"background:; width:40px;\"|\n! style=\"background:; width:40px;\"|\n! style=\"background:; width:40px;\"|\n! style=\"background:; width:40px;\"|\n! style=\"background:; width:40px;\"|\n! style=\"background:; width:40px;\"|\n! style=\"background:; width:40px;\"|\n! class=\"unsortable\" style=\"color:inherit;background:;\" |\n! style=\"background:; width:40px;\"|\n! style=\"background:; width:40px;\"|\n! style=\"background:; width:40px;\"|\n! style=\"background:; width:40px;\"|\n! style=\"background:; width:40px;\"|\n! style=\"background:; width:40px;\"|\n|-\n| 14 – 27 Oct 2025 || STEM/MARK || |37 || 17 || 12 || 8 || 5 || 6 || 7  || 6 || 6 ||  || 6 || 6 || 5 || 5 || 5 || 5\n|-\n| 14 May – 1 Jun 2025 || STEM/MARK || |31 || 16 || 8 || 7 || 6 || 5 || 5 || 5 || 4 || 4 ||  ||  ||  ||  ||  ||\n|}\nReferences"
    }
  ]
}