{
  "content": [
    {
      "type": "text",
      "text": "# NEXT Woman of the Year awards\n\nThe NEXT Woman of the Year awards were annual awards in New Zealand, conferred by NEXT magazine (published by Are Media), to \"celebrate the outstanding achievements of New Zealand women\". The awards, generally announced in October, were first held in 2010, and had five categories, Health & Science, Arts & Culture, Sports, Business and Community. By 2019, two further categories had been added: Education, and a Lifetime Achievement Award. From these category winners, a supreme winner, the NEXT Woman of the Year, was selected. When Bauer Media exited magazine publishing in New Zealand in 2020, Next magazine ceased publishing, and the Woman of the Year awards have not been made since.\n2019 awards\n2019 winners were announced at an event held at the Cordis Hotel in October 2019.\n* Supreme Winner: Diana Sarfati, public health physician and cancer epidemiologist\n* Health & Science: Diana Sarfati\n* Business & innovation: Helen Robinson, former managing director of Microsoft NZ, and co-founder of feminine hygiene brand Oi (Organic Initiative)\n* Arts & Culture: Samantha Scott, founder of Maidment Youth Theatre, now the Massive Theatre Company\n* Education: Dianne Daniels, founder of company Digital Wings\n* Sport: Neelusha Jennings, founder of charity \"Limitless with Support\", which links able-bodied and disabled people.\n* Community: Zhiyan Basharati, leader of CVOC (Christchurch Victims' Organising Committee)\n* Lifetime Achievement Awards: The Topp Twins, iconic entertainers\n2018 awards\n2018 awards were announced on 11 October. The judges included NEXT editor Rachael Russell.\n* Supreme Winner: Philippa Howden-Chapman, \"for her long-standing crusade for healthy, warm and dry homes in New Zealand\".\n* Health & Science: Philippa Howden-Chapman\n* Lifetime Achievement Award: Diane Foreman, entrepreneur and chief executive of The Emerald Group, \"for her work in paving the way for women in business\"\n* Arts & Culture: Renee Liang, multi-disciplinary artist, community arts activist and part-time paediatrician\n* Education: Rachel Williamson, for establishing the Summer Learning Journey programme to help students at low-decile schools\n* Sport: Sarah Leberman, sports researcher and co-founder of Women in Sports Aotearoa\n* Business & Innovation: Sharndre Kushor, co-founder of university admissions consulting company Crimson Education\n* Community: Merenia Donne, founder of Kotuku Foundation Assistance Animals Aotearoa\n2017 awards\n2017 awards were announced on 11 October.\n* Supreme Winner: Kristine Bartlett, advocate for women in the aged-care sector\n* Arts & Culture: Carla Van Zon, arts director\n* Business & innovation: Ranjna Patel, co-founder and director of Nirvana Health Group and Gandhi Nivas\n* Health & Science: Melanie Cheung, neurobiologist fighting degenerative brain disease\n* Sport: Heather Te Au-Skipworth, creator of the Iron Māori event, the world's only indigenous half IronMan\n* Education: Dame Wendy Pye, creator of a publishing empire\n* Lifetime achievement award: Theresa Gattung\n2016 winners\nThe 2016 winners were announced on 14 October 2016. The judges were Sarah Henry, NEXT Editorial Director, Louise Upston, Minister for Women, CEO of Xero Rod Drury, and television presenter Toni Street.\n* Supreme Winner: Billie Jordan – founder of The Hip Op-eration Crew, which is officially recognised as the world’s oldest dance crew\n* Arts & Culture: Billie Jordan\n* Business & innovation: Victoria Ransom, Wildfire Interactive\n* Health & Science: Merryn Gott, nursing academic\n* Sport: Trina Tamati, Tournament CEO of the Auckland NRL Nines\n* Education: Anne Gaze, founder of tutoring programme Campus Link\n*Community: Dale Nirvani Pfeifer, creator of GoodWorld, a company that enables instant charitable donations via social media\n2015 awards\nThe 2015 awards were announced on 9 October. The judges were Minister for Women Louise Upston, Geoff Ross, Chairman of Trilogy International and CEO of Moa Brewing Company, and NEXT editor Sarah Henry.\n* Supreme Winne: Claudia Batten, entrepreneur\n* Business & Innovation: Claudia Batten\n* Arts & Culture: Fiona Samuel, screenwriter and director\n* Community: Ruth Money, advocate for victims and survivors\n* Health & Science: Catherine Mohr, engineer and vice-president of strategy, Intuitive Surgery\n* Sport: Marcia Petley, Masters athlete\n* Education: Frances Valintine, founder of The Mind Lab by Unitec\n2014 awards\nThe 2014 awards were announced on 10 October. Besides NEXT Magazine editor Sarah Henry, the judging panel was made up of previous winners of the awards, Julie Chapman, Julie Bartlett, Lesley Elliott and Emma Parry.\n* Supreme Winner: Sita Selupe, founder and principal of Rise UP Academy and CEO of Rise UP Trust\n* Education: Sita Selupe\n* Community: Joy Clark, longest serving volunteer of the Grandparents scheme at Starship children’s hospital\n* Health & Science: Sally Merry, child psychology research at the University of Auckland\n* Sport: Lisa Carrington, Olympic gold-medallist in flatwater canoeing\n* Arts & Culture: Miranda Harcourt – actor, playwright and acting coach\n* Business: Cecilia Robinson – founder of My Food Bag and Au Pair Link\n2013 awards\nThe 2013 awards announced on 13 October. They were judged by Martin Snedden, Sarah Henry, Theresa Gattung and Julie Bartlett.\n* Supreme Winner: Julie Chapman, founder and CEO of charity KidsCan\n* Community: Julie Chapman\n* Health and Science: Bronwen Connor, brain researcher\n* Sport: Suzie Bates, cricketer\n* Education: Julie King, national co-ordinator of the Click SpecialED Trust\n* Arts and Culture: Hinewehi Mohi, singer-songwriter, TV producer, and founder of Raukatauri Music Therapy Centre\n* Business: Lindy Nelson – executive director of the Agri-Women’s Development Trust\n2012 awards\nThe 2012 awards were held on 11 October.\n* Supreme Winner: Julie Bartlett, founder of StarJam\n* Education: Chris Brough, lecturer at University of Waikato\n2011 awards\nThe 2011 awards were announced on 6 October. The judging panel was NEXT editor Sarah Henry, Dame Catherine Tizard, and Gareth Morgan.\n* Supreme Winner: Lesley Elliott, founder of the Sophie Elliott Foundation\n* Arts & Culture: Jill Marshall, author and publisher\n* Business: Mai Chen, lawyer\n* Health & Science: Sue Johnson, Christchurch coroner\n* Sport: Jayne Parsons, Paralympian\n* Community: Lesley Elliott\n2010 awards\nThe first awards were announced on 12 August 2010. The Supreme Winner was Emma Parry for her work on access to high risk maternity services.\n* Supreme Winner: Emma Parry\n* Community: Alison Browning, teacher\nReferences"
    }
  ]
}