{
  "content": [
    {
      "type": "text",
      "text": "# NHL Heritage Classic\n\n}}\n| titlestyle       =\n| image            =\n| imagestyle       =\n| caption          = The Canadiens and Flames face off at the 2011 Heritage Classic in Calgary\n| captionstyle     =\n| headerstyle      = background:#ccf;\n| labelstyle       =\n| datastyle        =\n| header1          = National Hockey League\n| label1           =\n| data1            =\n| header2          =\n| label2           = First played\n| data2            = November 22, 2003\n| header3          =\n| label3           = Times Held\n| data3            = 7\n| header4          =\n| label4           = Teams Participated\n| data4            = 8\n| header5          =\n| label5           = Most Appearances\n| data5            = 3: Calgary Flames, Edmonton Oilers\n| header6          =\n| label6           = Most Recent\n| data6            = 2023 Heritage Classic\n| header7          =\n| label7           = Most Recent Winner\n| data7            = Edmonton Oilers\n}}\nThe NHL Heritage Classic () is one of the series of regular season outdoor games played in the National Hockey League (NHL) that is held in football stadiums based in Canada. Unlike the NHL's other two series of outdoor games, the NHL Winter Classic and the NHL Stadium Series, the Heritage Classic has been held infrequently: only seven games have been played in the series so far, and the first five match-ups were exclusively between Canadian teams.\nThe inaugural Heritage Classic, hosted by the Edmonton Oilers at Commonwealth Stadium in 2003, was the first outdoor regular season game in NHL history and its success served as the precursor to outdoor hockey games played around the world. The second Heritage Classic, played at McMahon Stadium in Calgary in 2011, set sponsorship and revenue records.  The third Heritage Classic was hosted in Vancouver's BC Place stadium in 2014. The fourth game was hosted by Winnipeg at Investors Group Field, now known as IG Field, in October 2016. The fifth game was held on October 26, 2019, at Mosaic Stadium in Regina, Saskatchewan.\nThe sixth Heritage Classic for 2022 was played at Tim Hortons Field in Hamilton, Ontario. The Toronto Maple Leafs made their first Heritage Classic appearance (they were the only Canadian team who had yet to play in a Heritage Classic, although they had appeared in a Winter Classic, the Centennial Classic and in one Stadium Series game), and played against the Buffalo Sabres, the first U.S. team appearing in a Heritage Classic.\nThe seventh Heritage Classic was hosted by the Oilers for the second time, with their opponent being the Calgary Flames in the first outdoor hockey Battle of Alberta.\nHistory\nThe first Heritage Classic was played in 2003 and hosted by the Edmonton Oilers. The first regular season outdoor game in NHL history, it was held at Commonwealth Stadium between the Oilers and the Montreal Canadiens. The Oilers had suggested the idea of hosting an outdoor game as early as the mid 1980s, but the genesis of the 2003 event was the \"Cold War\" outdoor game played two years prior between Michigan State University and the University of Michigan.\nDemand for tickets to the game was unprecedented in the history of Edmonton sports events. After sales to Edmonton's season ticket holders and league sponsors, the Oilers held a lottery for the remaining 7,000 seats that awarded 1,750 persons the opportunity to purchase four tickets each.  The team received over 750,000 entries from around the world. The game attracted a crowd of 57,167 that set an NHL single-game attendance record that more than doubled the previous mark. The event featured an alumni game between past greats of the Canadiens and Oilers, including Wayne Gretzky and Guy Lafleur. The game itself was played at a temperature of ; the Canadiens defeated the Oilers by a score of 4–3.\n. The event was revived in 2011 as a Canadian equivalent to the Winter Classic.]]\nThe success of the Heritage Classic led to the 2008 Winter Classic, which was played in Buffalo between the Buffalo Sabres and Pittsburgh Penguins. A new league record crowd of 71,217 watched the Penguins defeat the Sabres in a game that quickly became the NHL's showcase event. The Winter Classic became an annual event but focused on American teams.  Faced with increasing criticism at the lack of Canadian participation in the Winter Classic, the NHL revived the Heritage Classic in 2011 and pitted the Canadiens against the host Calgary Flames. It marked the first time the NHL held two outdoor games in the same season, a decision that some commentators, including ESPN's Scott Burnside, argued would dilute the spectacle of the Winter Classic.\nLike the Edmonton game, the 2011 Heritage Classic was a success, as the Flames defeated Montreal 4–0 in front of 41,022 fans at McMahon Stadium.  The game achieved high television ratings in both Canada and the United States and, due to record sponsorship, grossed the highest revenue for a single event in NHL history.\nThe third Heritage Classic was played at BC Place in Vancouver in 2014 between the Vancouver Canucks and Ottawa Senators.  It was part of a six-game outdoor set during the 2013–14 NHL season that included the 2014 Winter Classic and the four-game Stadium Series.\nThe Winnipeg Jets played host to the Oilers in the fourth Heritage Classic on October 23, 2016, at Investors Group Field, during the 2016–17 NHL season.\nwas hosted in Mosaic Stadium, the first time it has been hosted outside the locale the participating teams are based in]]\nThe fifth Heritage Classic was played on October 26, 2019, during the 2019–20 NHL season, with the Jets and the Flames at Mosaic Stadium in Regina, Saskatchewan, a neutral site roughly between Winnipeg and Calgary.\nOn September 16, 2021, the league announced that a sixth Heritage Classic would be played on March 13, 2022, between the Toronto Maple Leafs and the Buffalo Sabres at Tim Hortons Field in Hamilton, Ontario. The Sabres won 5-2.\nOn January 1, 2023, the NHL announced that Commonwealth Stadium would return as host of the Heritage Classic in 2023, this time showcasing the Battle of Alberta between the Calgary Flames and the Edmonton Oilers. The Oilers would come away with a 5-2 victory over the Flames.\nList of games\n{| class=\"wikitable sortable\"\n|-\n! Year\n! Season\n! Date\n! City\n! Stadium\n! Primary team at venue\n! Away team\n! Score\n! Home team\n! Attendance\n! Ref\n|-\n| 2003\n| 2003–04\n| November 22\n| Edmonton, Alberta\n| Commonwealth Stadium\n| Edmonton Eskimos\n| Montreal Canadiens\n| ALIGN=\"center\" | 4–3\n| Edmonton Oilers\n| 57,167\n|\n|-\n| 2011\n| 2010–11\n| February 20\n| Calgary, Alberta\n| McMahon Stadium\n| Calgary Stampeders\n| Montreal Canadiens\n| ALIGN=\"center\" | 0–4\n| Calgary Flames\n| 41,022\n|\n|-\n| 2014\n| 2013–14\n| March 2\n| Vancouver, British Columbia\n| BC Place\n| BC Lions\n| Ottawa Senators\n| ALIGN=\"center\" | 4–2\n| Vancouver Canucks\n| 54,194\n|\n|-\n| 2016\n| 2016–17\n| October 23\n| Winnipeg, Manitoba\n| Investors Group Field\n| Winnipeg Blue Bombers\n| Edmonton Oilers\n| ALIGN=\"center\" | 3–0\n| Winnipeg Jets\n| 33,240\n|\n|-\n|2019\n|2019–20\n|October 26\n|Regina, Saskatchewan\n|Mosaic Stadium\n|Saskatchewan Roughriders\n|Calgary Flames\n| ALIGN=\"center\" | 1–2\n|Winnipeg Jets\n|33,518\n|\n|-\n|-\n|2022\n|2021–22\n|March 13\n|Hamilton, Ontario\n|Tim Hortons Field\n|Hamilton Tiger-Cats\n|Toronto Maple Leafs\n| ALIGN=\"center\" |  2–5\n|Buffalo Sabres\n|26,119\n|\n|-\n| 2023\n| 2023–24\n| October 29\n| Edmonton, Alberta\n| Commonwealth Stadium\n| Edmonton Elks\n|Calgary Flames\n| ALIGN=\"center\" |  2–5\n|Edmonton Oilers\n|55,411\n|\n|}\nWinning and losing teams\n{| class=\"wikitable sortable\" style=\"text-align:center; font-size:95%\"\n!Teams!!width=\"30\"|Win!!width=\"30\"|Loss!!Total!!width=\"150\"|Year(s) won!!width=\"150\"|Year(s) lost\n|-\n|style=\"text-align:left\"|Edmonton Oilers||2||1||3|| style=\"text-align:left\" |2016, 2023||style=\"text-align:left\"|2003\n|-\n|style=\"text-align:left\"|Montreal Canadiens||1||1||2|| style=\"text-align:left\" |2003||style=\"text-align:left\"|2011\n|-\n|style=\"text-align:left\"|Calgary Flames||1||2||3||style=\"text-align:left\"|2011||style=\"text-align:left\"|2019, 2023\n|-\n|style=\"text-align:left\"|Ottawa Senators||1||0||1||style=\"text-align:left\"|2014||\n|-\n|style=\"text-align:left\"|Vancouver Canucks||0||1||1||||style=\"text-align:left\"|2014\n|-\n|style=\"text-align:left\"|Winnipeg Jets||1||1||2||style=\"text-align:left\"|2019||style=\"text-align:left\"|2016\n|-\n|style=\"text-align:left\"|Buffalo Sabres||1||0||1||style=\"text-align:left\"|2022||\n|-\n|style=\"text-align:left\"|Toronto Maple Leafs||0||1||1||||style=\"text-align:left\"|2022\n|}\nBroadcasters\nCBC's Hockey Night in Canada broadcast the 2003, 2011, 2014 and 2019 games. In the first three editions, CBC Sports solely produced the games, then in 2019, Sportsnet not only took over production, but also simulcast the game on their networks. In 2016, 2022 and 2023, the games were aired only on Sportsnet.\nIn the United States, the first Heritage Classic was not broadcast to then-rightsholders ESPN/ABC due to its prior commitments with college football. Instead, the game was aired to American audiences on NHL Center Ice via the CBC feed. In 2011, 2014 and 2019, Versus/NBCSN would air the Heritage Classic, with the network providing their own broadcast crews for the first two games, and the last game featuring a simulcast from Sportsnet. In 2016, NHL Network simulcast Sportsnet's broadcast of the Heritage Classic. Then in 2022, TNT aired the Heritage Classic with their own broadcast crews, as the game featured an American team for the first time. In 2023, TNT's sister channel TBS aired the Heritage Classic due to TNT's prior commitment to a USWNT friendly match. This marked the first NHL regular season game broadcast by the network under their current deal.\nReferences\nExternal links"
    }
  ]
}