{
  "content": [
    {
      "type": "text",
      "text": "# Niagara Celtic Heritage Festival\n\nThe Niagara Celtic Heritage Festival & Highland Games (also known as Niagara Celtic) is a Celtic cultural festival held at the Niagara County Fairgrounds in Niagara County, New York. It is run by the not-for-profit Niagara Celtic Heritage Society. The festival takes place during the third weekend of September, and attracts about 13,000 visitors in two days to Krull Park. Activities include Celtic music, genealogy, food and drink, dance, cultural exhibits, games, sports, arts and crafts, and children's activities. The main performances play at four stages located throughout the grounds, including The Fireside, The Dragonfly and the Celtic Arts Theatre. The society also hosts a Celtic College, with various lectures and classes during the event.\n]]\nHistory\nNiagara Celtic was conceived in late 2000 in Olcott by Phil and Beth Banks, who had attended a Celtic celebration in Kincardine, Ontario, and Paul Krest, a participant in the local Highland games. In the spring of 2001 they launched their first season of Highland Games, which concluded in September with a small grand finale festival, the first Niagara Celtic Heritage Festival & Highland Games. The Banks family continues managing and growing the festival, while Paul Krest runs the nearly year-round Highland Games through the Niagara Highland Athletics Club. About 500 people attended the first year.\nThe festival grew into an annual event in Olcott. In 2016 it occupied over 11 acres on the lakeside of Krull Park, had representation from about 40 Scottish clans, and included cultural and athletic demonstrations as well as Celtic music.\nBeginning in 2019, the festival relocated to the Niagara County Fairgrounds in order to continue the growth of the popular event.\nThe next year saw a virtual festival, and 2021 saw its return after a pandemic-based hiatus.\nActivities\nPerformance Stages\nThe festival has four stages with musical acts, including bands, dance groups and bagpipe bands.\nEvery year on Saturday evening, the festival hosts a Ceilidh Celebration. The evening usually consists of an opening act, a special guest performance and the headline band. This event allows everyone working during the festival to close down for the evening and join in the celebration. There is a beer tent and small campfires, along with a few food vendors who stay open late.\nCeltic College\nThe college runs lectures and classes from noon to about 5pm each day. Classes vary each year; previous topics have included instrument lessons, dancing, genealogy, publishing, poetry and storytelling.\nClan Village\nThis feature was at  first known as Clan Row.  Only a few clans took part throughout the early years, but the numbers started growing by 2010. In 2016 there were over 40 clans in the village. In 2014 the Village welcomed Clan Henderson for their Annual General Meeting, and in following years various other clans have also held their AGM's during the festival.\nVendors\nFood vendors sell a variety of foods and beverage, and most vendors have one or more “Celtic” foods, including Scotch eggs, seafood, potatoes, and stews. The festival “Gaelic Libation” tents, or beer tents, offer wine, mead, and beer. Craftsmen and artisans can be found who deal in Celtic goods and products including kilts and accessories, Renaissance costumes, swords, jewelry, glassware, candles, chainmail, pottery, henna art, and more.\nAthletics\nNiagara Celtic has had various athletic events since its inception. Soccer and rugby teams have played games at Krull Park South on Saturdays. In 2012 a  dart competition was initiated at a nearby sports bar.\nHighland Games are the feature event during the festival. The games are held in conjunction with The Niagara Highland Athletics Club. Athletes from across the U.S. and Canada compete in 12 different divisions and 7 competitions, to decide the winner of “Athlete of the Day” in each division. Also handed out is “Athlete of the Year\" award for each division, which is decided over the course of the year by earning points for where they have placed in seven games starting in October. Athletes include men, women and youth, with Pro, Amateur, Masters and Super Masters.\nAttractions\nThe Kid's Areas feature free activities, games, entertainment and crafts. There are storytellers, face painting, children's maze, a craft tent and mini-highland games practice area.  The festival includes hands-on displays, craft demonstrations, pony rides, and various animal displays.\nReferences\nExternal links\n*[http://www.niagaraceltic.com Niagara Celtic website]\n*[http://www.celticlifeintl.com/niagara-celtic-festival-highland-games/ Niagara Festival and Highland games] Celtic Life."
    }
  ]
}