{
  "content": [
    {
      "type": "text",
      "text": "# Nick Lloyd (historian)\n\nNick Lloyd FRHS is a professor of modern warfare at King's College London. He has written several books on the First World War.\nThe Amritsar Massacre: The Untold Story of One Fateful Day\nLloyd has written a revisionist history of the Jallianwala Bagh massacre entitled The Amritsar Massacre: The Untold Story of One Fateful Day (2011), in which Lloyd tried to put the events of 1919 in their historical context, and in the publisher's description, \"[dispel common myths and misconceptions surrounding the massacre and offers a new explanation of the decisions taken in 1919.\" Lloyd's book was written as a rebuke to both the Indian nationalist account of the event, as well as more contemporary works like The Butcher of Amritsar.\nLloyd's narrative focusses upon the increasing civil disorder in Punjab after WWI, particularly in the context of the Rowlatt Act. In Lloyd's account, which draws heavily from the Hunter Commission report, previous accounts of the massacre had significantly downplayed the extent of violence by Indian nationalist crowds, stating that British officials \"did not imagine the crowds in Amritsar or think they were worse than they really were. They did not suffer from some kind of mass hysteria or information panic. They encountered violent crowds and had to deal with them as best as they could\" and stating that the nationalist accounts \"confuses victims with aggressors and acts as an apologist for that violence.\"\nIn a brief review for Asian Affairs, Rosie Llewellyn-Jones described the book as  \"thought-provoking, engaging\" and described Lloyd's portrait of Reginald Dyer as \"compelling\" Far more extensive and critical were reviews from Collett and Kim A. Wagner, both of whom had written their own accounts of the massacre. In a review for the University of London, Wagner described the book as \"a complete whitewash\" and \"deeply problematic, never mind poor scholarship\". The book was criticised for relying on British police and official reports to the exclusion of Indian accounts, as well as failing to engage with more contemporary scholarship on post-war Punjab and colonial administration. Wagner's primary criticism, however, was that Lloyd took seriously the idea of Punjab as being in open violent rebellion to the extent of making Dyer's decision at  Jallianwala Bagh a credible act of public security as opposed to a calculated act of punishment. In his response, Lloyd  asserted his position that \"Dyer did not know what he was doing, panicked and then lied about it afterwards.\" He also highlighted the numerous personal attacks in Wagner's review and accused him of acting with \"selectivity, narrow-mindedness, intolerance and hysteria.\"\nCollett's review was more extensive, quoting heavily from The Amritsar Massacre and was noticeably more measured in tone, but accused Lloyd of blatantly politicising the matter. Like Wagner, he accused Lloyd of reaching his conclusions through the selective use of evidence from Dyer and O'Dwyer's own writings and statements that challenged the thesis that Dyer panicked, stating \"As with the rest of his thesis, Lloyd reaches [his] conclusion by ignoring much of the evidence\" Collett also pointed to several inaccuracies in Lloyd's text, such as an erroneous description of the Baloch. Collett's criticism of the thesis that Dyer panicked was based upon four points, namely Dyer's choices prior to the order to fire, accounts by witnesses to whether he panicked, the duration of the shooting, and finally, Dyer's own words to the Hunter Commission, and his writings later in life.\nFirst World War trilogy\nIn 2021, Lloyd published The Western Front, followed by The Eastern Front in 2024. Both books received positive reviews, with The Eastern Front being a New York Times bestseller. Margaret MacMillan described The Eastern Front as \"essential reading for anyone who wants to understand the history of that troubled region up to and including the present\", and said \"Lloyd's compelling narrative shows massive armies moving across a vast theatre of war, from the Baltic across to the eastern end of the Mediterranean, as three great empires - Austria-Hungary, Russia and Germany - and their smaller allies threw themselves against each other.\" In the Sunday Telegraph, Simon Heffer described The Eastern Front as 'exhaustive, highly detailed and meticulously researched'. Ronan McGreevy calls Lloyd \"one of the best military historians around\" and thought The Eastern Front was \"authoritative\". The Economist hailed Lloyd for producing \"the first major history of the Eastern Front in English for nearly 50 years\", which was \"resurrected in compelling detail\". Jonathan Eaton said that it was an \"extraordinary achievement in illuminating a poorly understood theatre of the conflict. Despite the complexity of the topic, Lloyd's narrative provides a comprehensive overview of the dynamic nature of the Eastern Front from the perspectives of all key protagonists. It provides deep insights into the personalities of individual commanders and political leaders, and the political tides which ultimately engulfed those nations fighting on the Eastern Front ... As the second volume in Lloyd's emerging trilogy, it is clear that his work on understanding the diverse geographic contexts and interrelationships of the First World War will shape our thinking on the conflict for decades to come. It should be read by all historians with an interest in the First World War and the deep roots of modern conflicts.\"\nSelected publications\n*Loos 1915. Stroud: Tempus, 2006.\n*The Amritsar Massacre: The Untold Story of One Fateful Day. London: I. B. Tauris, 2011\n*Hundred Days: The End of the Great War. London: Viking Press, 2013.\n*Passchendaele: A New History. London: Viking Press, 2017.\n*The Western Front: A History of the First World War. Penguin, 2021.\n*The Eastern Front: A History of the First World War. Penguin, 2024.\nReferences"
    }
  ]
}