{
  "content": [
    {
      "type": "text",
      "text": "# Nigel Davies (historian)\n\n| death_place =\n| death_cause =\n| resting_place =\n| resting_place_coordinates =\n| residence   =\n| nationality = British\n| other_names =\n| known_for   =\n| education   =\n| employer    =\n| occupation  =  Anthropologist, historian, MP and soldier\n| title       =\n| salary      =\n| networth    =\n| height      =\n| weight      =\n| term        =\n| party       =\n| boards      =\n| religion    =\n| spouse      =\n| partner     =\n| children    =\n| parents     =\n| relatives   =\n| signature   =\n| website     =\n| footnotes   =\n}}\nDr. Claude Nigel Byam Davies (2 September 1920 – 25 September 2004) was a British anthropologist and historian who specialised in the study of the cultures of pre-Columbian America, publishing 12 academic works on the Aztec, Inca and Toltec societies. In addition to his academic work, Davies also served with the Grenadier Guards during the Second World War, briefly sat as an MP for Epping and as the managing director of Windowlite Ltd.\nLife\nBorn in September 1920 to Claude and Nellie Davies, Nigel was educated at Eton College and subsequently at the University of Provence and briefly at the University of Potsdam in Berlin before the outbreak of the Second World War. In 1939 Davies attended the Royal Military College, Sandhurst and graduated the following year, taking a commission as a lieutenant in the Grenadier Guards. During the war, Davies served in the Middle East, Italy and the Balkans, leaving the services after the end of the war in 1946. In the general election of 1950, Davies stood for and won the seat of Epping as a Member of Parliament for the Conservative Party. A year later he gave up the seat, refusing to stand in the general election of 1951 at which the constituency was won by Conservative candidate Graeme Bell Finlay.\nDavies subsequently entered academia, achieving a ph.D. in archaeology and studying at University College London and the Universidad Nacional Autónoma de México.  He made a lifelong study of the ancient civilisations of the Americas, concurrently with his role as the managing director of Windowlite Ltd. Among Davies works are books on the Aztec civilisation, the Incas of South America and in particular the Toltecs, the pre-Aztec people of Central Mexico. His works were well received and are now standard references. Davies never married and later retired to live in Tijuana, dying in September 2004.\nWorks\n*Los Señoríos Independientes del Imperio Azteca, 1968.\n*Los Mexicas: primeros pasos hacia el imperio, 1973.\n*The Aztecs: a history, 1973.\n*The Toltecs: until the fall of Tula, 1976.\n*Before Columbus Came, 1976.\n*Voyagers to the New World, fact and fantasy, 1979\n*The Toltec Heritage: from the fall of Tula to the rise of Tenochtitlan, 1980.\n*Human Sacrifice, in history and today, 1981.\n*The Ancient Kingdoms of Mexico, 1983.\n*The Rampant God: Eros throughout the world, 1984.\n*The Aztec Empire: the Toltec resurgence, 1987.\n*The Incas, 1995.\n*The Ancient Kingdoms of Peru, 1997.\nNotes"
    }
  ]
}