{
  "content": [
    {
      "type": "text",
      "text": "# Nihomatsu Domain Monumental Stele\n\n| location       = Nihonmatsu, Fukushima, Japan\n| region         = Tōhoku region\n| type           = stele\n|part_of             =\n|length              =\n|width               =\n|area                =\n|height              =\n|builder             =\n|material            =\n|built               =\n|abandoned           =\n|epochs              = Edo period\n|cultures            =\n|dependency_of       =\n|occupants           =\n|event               =\n|excavations         =\n|archaeologists      =\n|condition           =\n| ownership      =\n|management          =\n|public_access       = Yes\n|website             =\n|notes               =\n}}\nis an Edo period stele located in the city of Nihonmatsu, Fukushima Prefecture, in the Tōhoku region of northern Japan.  The stele was designated a National Historic Site of Japan in 1935 by the Japanese government.\nOverview\nUnder the Tokugawa shogunate, Nihonmatsu Castle was the administrative center of Nihonmatsu Domain, a 100,700 koku feudal domain ruled by the Niwa clan from 1643. This stele was engraved on a large stone of granite with a length of about 8.5 meters and a maximum width of about 5 meters, which was located on the east side of the castle, next to a gate used by the samurai officials who administered the domain.\nThe monument was ordered by the 5th daimyō of Nihonmatsu Domain, Niwa Takahiro (1708 - 1769), with an inscription by the clan’s Confucius scholar, Iwaida Sakuhi and was completed in March 1749. This was the same year that Niwa Takahiro officially retired, turning the domain over to his son, Niwa Takayasu\nThe inscriptions consists of four lines containing 16 kanji, with a  length of 1.03 meters and width of 1.82 meters. Roughly translated, it is an admonition to the domain’s officials that “Your salary is the people's sweat and blood. The lower people are easily oppressed, but you cannot deceive the heavens” and was intended to express Niwa Takahiro’s political-economic philosophy towards the people of his domain.\nDetail of the stele.\nSee also\n*List of Historic Sites of Japan (Fukushima)\nReferences\nExternal links\n*[http://www.city.nihonmatsu.lg.jp/page/page001312.html Nihonmatsu official site]"
    }
  ]
}