{
  "content": [
    {
      "type": "text",
      "text": "# Nikki Haley 2024 presidential campaign\n\n| receipts     = }}\n| fec_date     = March 31, 2024\n| slogan       = Stand for America\n| themesong    =\n| chant        =\n| website      = [https://web.archive.org/web/20230823104425/https://nikkihaley.com/ nikkihaley.com](archived - August 23, 2023)\n}}\nNikki Haley, a former governor of South Carolina and U.S. ambassador to the United Nations, announced her campaign for the 2024 United States presidential election in a campaign video on February 14, 2023. On March 6, 2024, Haley suspended her campaign following Super Tuesday. Haley is the first woman of color to be a major candidate for the Republican presidential nomination, the first woman to run against a former president as a major party candidate,\nand the first female former governor to run for president.\nIf elected, Haley would have become the first female president and the first Asian American president of the United States.\nOn March 3, 2024, she became the first woman and first Asian-American in U.S. history to win a Republican presidential primary with her victory in the District of Columbia primary; she later won the Vermont primary, making her the first woman to win a state Republican presidential primary and the first woman to win two Republican presidential primaries. She dropped out of the Republican primary race on March 6, 2024, but continued to attract support in Republican primaries.\nBackground\nEarly speculation for national office\nHaley was first elected governor of South Carolina in the 2010 election and reelected in the 2014 election. She gained a national profile during her tenure, which led to speculation that she would be a potential vice presidential candidate in 2012 and 2016.\nIn January 2016, the House Republican Conference announced that Haley would give the English Republican Response to the State of the Union address, furthering the vice-presidential rumors.\nPresident-elect Donald Trump nominated Haley to the position of U.N. Ambassador on November 23, 2016. During her tenure as U.N. ambassador, there was speculation that she was using the position to gain foreign policy experience in preparation for a future presidential candidacy. This speculation was motivated by the open policy disagreements Haley and the Trump administration experienced.\nPre-candidacy developments\nIn 2019, Haley created a new policy group named Stand for America, a group that promotes public policies aimed at strengthening the economy, culture, and national security. Haley hired influential political strategist Tim Chapman as the group's executive director, which some believed indicated she was gearing up for a presidential campaign. Several billionaires and hedge fund managers have made large donations to the group.\nIn February 2021, Haley created a PAC to endorse and support candidates in the 2022 midterm elections. She hired former NRSC political director Betsy Ankney to be executive director. She campaigned for Republican candidates in Georgia, Pennsylvania, New Hampshire, and Wisconsin in the lead up to election day. This move was seen as an effort to lay the stages of a 2024 campaign and boost her national image. endorsement event in 2021]]While speaking at Christians United for Israel's Washington summit in July 2022, Haley hinted at a run for president in the 2024 U.S. presidential election, saying, \"If this president signs any sort of [Iran nuclear] deal, I'll make you a promise: The next president will shred it on her first day in office\", and, \"Just saying, sometimes it takes a woman.\" In November, Haley attended an event at Clemson University, during which she confirmed she would use the holiday season to make a decision on launching a campaign: \"If we decide to get into it, we'll put 1,000 percent in, and we'll finish it.\"\nOn January 31, 2023, it was reported that Haley would announce a bid for the presidency on February 15, making her the first challenger to former president Donald Trump's campaign. Haley became the third Indian-American politician to seek a presidential nomination following Bobby Jindal and Kamala Harris. Haley had previously claimed that she would not run for the candidacy if Trump also sought the nomination.\nCampaign\nAnnouncement and launch\nOn February 14, 2023, Haley released a video announcing her intent to run as a candidate for the Republican nomination for president. Filmed in her hometown of Bamberg, South Carolina, Haley spoke of her Indian heritage, race relations, global human rights violations, her tenure as governor and ambassador, and the threats facing the United States before announcing her run.\nOn February 15, 2023, Haley officially launched her candidacy during a campaign event in Charleston, South Carolina. John Hagee gave the invocation. Other notable speakers were Cindy Warmbier (the mother of Otto Warmbier), Representative Ralph Norman, and Katon Dawson (former South Carolina Republican Party chairman). Norman's early support of Haley was considered significant in light of his history of supporting Trump and Norman's efforts to overturn the 2020 election. At the event, Haley also praised Hagee, saying she still wanted to be him when she grew up. Hagee is known for his history of making controversial statements, which led 2008 Republican nominee John McCain to reject his endorsement during McCain's own presidential campaign.\nHer launch event featured \"Eye of the Tiger\", prompting the song's co-author, Frankie Sullivan, to criticize Haley for the unauthorized use of his song.\nAs South Carolina's former governor, commentators suggested that the early date of the 2024 South Carolina Republican primary would play to Haley's advantage in the primary.\nPost-announcement\nHaley spent the first months of her campaign mostly in Iowa and New Hampshire, which are two states with early primary election dates. By May 19, 2023, she had held 22 events in Iowa.\nHer first post-launch event was held the day after her Charleston event on February 16 in Exeter, New Hampshire. She was introduced by former Republican Senate candidate Don Bolduc. Bolduc endorsed Haley on Twitter the same day.\nIn March 2023, Haley spoke at two major competing conservative conferences: the Conservative Political Action Conference (CPAC) and a private donor event held by the Club for Growth. Haley was one of two Republican active or potential candidates to attend both, while most other candidates (both announced and speculated) chose one event or the other. Trump only appeared at CPAC after not being invited by the club. Ron DeSantis, Florida's governor who would later enter the presidential race, declined to attend CPAC in favor of the club's event. This split in attendance among high-profile Republican officials made Haley's double appearance notable. It was considered a display of Haley's effort to appeal to the two major factions of the Republican party.\nOn April 26, Haley went on Fox News, stating, \"I think we can all be very clear and say with a matter of fact that if you vote for Joe Biden, you really are counting on a President [[Kamala Harris|[Kamala] Harris]] because the idea that he would make until 86 years old is not something that I think is likely.\" White House Deputy Press Secretary Andrew Bates noted the comment: \"As you know, we don't directly respond to campaigns from here. But honestly, I forgot she was running.\"\nOn June 3, Haley spoke at the annual Roast and Ride fundraiser hosted by Senator Joni Ernst, where she called for \"a new generational leader\". The following day, Haley participated in a CNN town hall, where she criticized Trump for his support of the January 6 United States Capitol attack rioters and pledged her support for the eventual winner of the primary. During the town hall, Haley also said, \"How are we supposed to get our girls used to the fact that biological boys are in their locker rooms? And then they wonder why a third of our teenage girls seriously contemplated suicide last year.\" Rex Huppke of USA Today criticized the comment as showing that Haley \"doesn't care enough about high rates of suicide among teenage girls to take the matter seriously, and she's more than willing to stigmatize transgender youth, who face even higher rates of suicide.\" The town hall drew in 562,000 viewers, 83% lower than the one CNN hosted with Trump the previous month, which had 3.3 million viewers.\nHaley's campaign made buys of $10 million in New Hampshire and Iowa beginning in December 2023. On December 8, Haley addressed a convention center conference where she stated her campaign had momentum and needed \"to have a good showing in Iowa. I don't think that means we have to win, necessarily, but I think that we have to have a good showing.\"\nIn the January 15, Iowa caucuses, Haley came in third place with 19 percent of the vote, behind Trump at 51% and DeSantis at 21%. In a Fox & Friends interview, Haley said her campaign was satisfied with its \"strong showing\" in Iowa after initially having over a dozen competitors and 2 percent support in polling. CNN held a town hall with Haley on January 18. Jake Tapper asked Haley if she believed America had ever been \"a racist country\" and Haley responded by noting her background and accomplishments and furthered, \"I want every brown and Black child to see that and say, 'No, I don't live in a country that was formed on racism. I live in a country where they wanted all people to be equal and to make sure that they have life, liberty, and the pursuit of happiness.\" The New Republic called Haley's answer \"unclear\" and wrote that her \"confusing argument is undercut by the fact that she herself acknowledges that not all people were treated equally under the Constitution when it was first written.\" In the January 23, New Hampshire primary, Trump won with 54 percent of the vote to Haley's 44%. In a speech, Haley signaled she would stay in the race to compete in the South Carolina and Super Tuesday primaries.\nOn March 3, 2024, Haley scored her first primary victory in the campaign by winning the District of Columbia Republican primary. In doing so, she became the first woman to win a Republican presidential primary, the first Asian-American to win a Republican presidential primary, and the first Indian-American to win either a Republican or Democratic presidential primary.\nAmerican Civil War and slavery\nAt a town hall in Berlin, New Hampshire, on December&nbsp;27, 2023, Haley responded to a question about the origins of the American Civil War, saying, \"I mean, I think the cause of the Civil War was basically how government was going to run. The freedoms and what people could and couldn't do.\" After being criticized that her original response failed to mention slavery, Haley restated her position a day later, saying that \"of course the Civil War was about slavery\". Haley drew criticism from both Democrats and Republicans, and without evidence she claimed the individual who asked the question was a \"Democrat plant\". The event was a town hall open to the general public. Haley appeared on the February 3, 2024, episode of Saturday Night Live in which she joked about the controversy.\nFundraising\nIn April 2023, Haley's campaign released its first quarterly fundraising report that is mandated by the Federal Elections Committee. In a campaign memo sent to donors, the campaign claimed it raised $11 million since her February 15 launch. After reviewing the public filings, reporters found that the Haley campaign (and its affiliated organizations and PACs) actually raised $8.3 million, which is $2.7 million less than publicly claimed. Reporters argue that the extra $2.7 million was actually just the same money being transferred from one organization to the other that the campaign was counting as a contribution again, thus \"double dipping\". In response, Ken Farnaso, Haley's campaign press secretary, said, \"We reported $11 million, the sum of entities ...\" and mentioned that other candidates \"have multiple fundraising vehicles\".\nA CNBC analysis of the first quarter FEC filings also revealed that the Haley campaign had received donations from notable billionaires and  executives, including Harold Hamm, Aryeh Bourkoff, and Jim Davis.\nOn July 10, 2023, the Haley campaign announced it had raised $7.3 million in the second quarter of the year. It touted donations from 160,000 individuals from all 50 states, exceeding the donation threshold required for Haley to participate in the Republican National Committee (RNC) debate the following month.\nOn November 10, the Haley and DeSantis campaigns announced they had each raised over $1 million in the 24 hours following the third Republican debate.\nOn January 24, in a Truth Social post, Trump warned Haley donors from supporting him: \"Anybody that makes a 'Contribution' to Birdbrain, from this moment forth, will be permanently barred from the MAGA camp. We don't want them, and will not accept them, because we Put America First, and ALWAYS WILL!\" In response, Haley posted a link to a site where donors could give $5 for a t-shirt that read \"Barred. Permanently.\"\nLiberal 'dark money' criticism\nHaley faced scrutiny on the campaign trail from Republicans over her alleged affiliations with left-leaning \"dark money\" organizations, particularly Arabella Advisors, a Washington, D.C.-based consulting firm that manages nonprofit groups and was founded by ex-Clinton administration appointee Eric Kessler. Haley's New Hampshire state director Tyler Clark was a registered lobbyist in New Hampshire in 2020  for Sixteen Thirty Fund under Arabella Advisors, which the Atlantic profiled in 2021 in an article titled \"The Massive Progressive Dark-Money Group You've Never Heard Of.\"\nIn a January 20 speech in New Hampshire before the primary, Trump called Arabella Advisors \"public enemy number one\" and criticized the Haley campaign for hiring Clark. Trump also claimed without evidence that Haley's campaign was funded by Arabella Advisors.\nRelationship with Donald Trump\nIn October 2022, before Trump entered the race, he told Brian Kilmeade that cabinet members would be \"very disloyal\" to run against him if he mounted a bid, his comments coming as Haley, Mike Pence, and Mike Pompeo were reportedly considering entering the 2024 race. Trump told Haley to \"follow your heart\" in regard to a presidential run before she ran.\nOn May 10, 2023, Haley appeared on The Hugh Hewitt Show and declined commenting on Trump's liability for defamation and sexual abuse against E. Jean Carroll, calling it \"something for Trump to respond to\". On June 13, after Trump pled not guilty to the 37 charges during his arraignment, Haley stated that \"President Trump was incredibly reckless with our national security\" if the indictment's charges were accurate. She went on to state that she would be \"inclined\" to give Trump a pardon if he was found guilty. The comments by Haley and Tim Scott were seen by Politico to serve \"as a sign the tide could be turning in the Republican presidential primary field's willingness to go on offense against the former president.\" After the first debate in August, when asked by George Stephanopoulos if she would support Trump as the Republican nominee even if he was convicted of a felony, Haley said, \"I don't even think it's going to get to the point that Donald Trump becomes president. I think that I'm going to be the nominee and I think that we are going to win.\"\nIn September, Haley said Americans would not vote for \"a convicted criminal\" and that she would \"support the Republican nominee always, and I will make sure that that person, we're going to pick someone that's going to beat a President Kamala Harris.\" At a campaign stop in Portsmouth, New Hampshire later that month, Haley admitted that Trump \"was the right president at the right time\" before calling him \"thin-skinned and easily distracted\" and critiquing him for not doing \"anything on fiscal policy\" and getting \"weak in the knees when it comes to Ukraine.\" In December, when asked by Sean Hannity if she would debate DeSantis, Haley answered that \"the person I want to debate is Donald Trump. If you can get him on your show, that's who I want to debate. That's who we're looking at.\" In January, Trump charged Haley's campaign with being funded by Biden donors, calling her a \"globalist\" and furthering that she \"does not have what it takes.\" Haley spokesperson Nachama Soloveichik responded, \"If Trump feels so strongly about his false attacks, he should stop hiding and defend them on the debate stage in Des Moines.\" In a CNN interview after the Iowa caucus, Haley said that while she had not looked into E. Jean Carroll's case against Trump, if the latter was \"found guilty, then he needs to pay the price.\"\nOn February 10, Trump mocked the absence of Haley's husband, Major Michael Haley, who was deployed overseas, on the campaign trail. Haley responded that she was proud of her husband's service and furthered, \"If you mock the service of a combat veteran, you don’t deserve a driver’s license, let alone being president of the United States.\" Michael Haley used X to post a photograph of a wolf overlaid with the words (in capital letters), \"The difference between humans and animals? Animals would never allow the dumbest ones to lead the pack\"\nVice-presidential candidacy speculation\nIt has been suggested by some commentators that Haley's presidential campaign was an effort to bolster her chances of being Trump's running mate in the general election if he became the party's nominee. In December 2023, it was reported that Trump was asking allies about the possibility of picking Haley as his running mate. Trump allies and possible vice-presidential candidates Marjorie Taylor Greene and Kristi Noem publicly protested a Trump-Haley ticket, the latter adding that she \"had a lot of disagreement with Nikki Haley over the years, and I just don't know which Nikki Haley is going to show up every day.\" On January 19, Haley told voters in Amherst, New Hampshire that she did not \"want to be anybody's vice president. That is off the table.\" At a rally, Trump dismissed being on a ticket with Haley: \"She is OK, but she is not presidential timber. And when I say that, that probably means she is not going to be chosen as the vice president.\"\nSuper Tuesday and withdrawal\nAlthough many had expected Governor Ron DeSantis to be the strongest challenger to Donald Trump, it was Nikki Haley who lasted longest in the 2024 Republican primary race. On March 3, 2024, she became the first woman to win a Republican presidential primary, the first Asian-American to win a Republican presidential primary, and the first Indian-American to win either a Republican or Democratic presidential primary, with her victory in the District of Columbia primary; she also won the Vermont primary on March 5, and the latter win made her the first woman to win a state Republican presidential primary and the first woman to win two Republican presidential primaries.\nOn March 6, 2024, following heavy losses in the Super Tuesday primaries, Haley withdrew from the race. She was the first Indian-American presidential candidate not to drop out before Super Tuesday. She received more than 10% of the vote in 15 primary elections since withdrawing. As of May 20, 2024, she earned a total of 4,404,896 votes, and 97 delegates to the Republican National Convention. She was the first female presidential candidate to earn more than one delegate to the Republican National Convention under modern rules (not counting Margaret Chase Smith getting delegate votes in 1964, as the rules then were much different).\nSee also Results of the 2024 Republican Party presidential primaries.\nPolitical positions during presidential campaign\nOverview\nIn her video announcement, Haley summarized the mission of her candidacy as \"fiscal responsibility, secur[ing] our border, and strengthen[ing] our country, our pride, and our purpose\". As the campaign unfolded, Haley honed in on a message of refreshing the Republican party and bringing in \"a new generation of leadership\". and that \"[t]hese are new problems, we need new solutions. It is time for us to leave the baggage and negativity behind.\"\nThe campaign's website maintains a list of Haley's actions while in prior offices, highlighting the policies she would likely pursue if elected. These actions include her time both as South Carolina governor and as the ambassador to the United Nations. The list focuses on economic and foreign policy issues, with abortion, guns, and immigration also receiving coverage.\nIn an article following her announcement, The New York Times described Haley as a \"darling of neoconservatives and a defender of Reagan's continued relevance\".\nOn February 1, Haley stated that \"The last thing I think we need to be worried about is who Taylor Swift is dating and what conspiracy theory is gonna have her endorsing a person for president.\"\nAbortion\nHaley has called for \"consensus\" on national abortion policy, and indicated she would oppose a full ban on abortion. In a February 2023 interview, she pointed to a proposal from Senator Lindsey Graham that would establish a national 15-week abortion ban, with exceptions for rape, incest, health, and life of the mother.\nIn May 2023, Haley clarified her position and said she would not support a federal abortion ban as it is unlikely to pass Congress and would \"not be honest to the American people\". Instead, she said each state must decide the issue for itself, and encouraged a nationwide consensus to eliminate late-term abortions and saying, \"I don't judge anyone for being pro-choice any more than I want them to judge me for being pro-life\", she said. \"Where I think we can start getting consensus is say, 'We don't want abortions allowed up to birth.\nForeign policy\nAfter Haley's announcement, the Council on Foreign Relations called her foreign policy one of a \"traditional, tough-minded Republican approach to foreign policy\".\nHaley has stated that the United States must remain the global superpower. To that end, she pledged to combat the influence of China and Russia on the international stage.\nIndo-Pacific relations\nHaley supports stronger relations with democracies and US allies in the Indo-Pacific region, such as Australia and Japan.\nChina\nHaley has taken a strong stance against alleged Chinese influence in domestic and international affairs, calling China the top threat to the United States.\nShe called the Biden administration's response to the 2023 Chinese balloon incident \"a national embarrassment\".\nForeign aid\nIn an opinion article published in the New York Post on February 24, 2023, Haley vowed to \"cut every cent in foreign aid for countries that hate [the United States]\". She listed Iraq, Pakistan, Zimbabwe, China, and Cuba as such countries, and labeled them enemies of the United States.\nRusso-Ukrainian War\nHaley has pledged her support for the American military aid to Ukraine in its war against Russia. She has said that opposing Russia in Ukraine is a vital interest for the United States. She argues aid is necessary to prevent further invasions by Russia or China into other nations that would spark a world war. In a February 2023 interview and during campaign stops in Iowa and New Hampshire Haley said, \"The war in Ukraine and Russia is not about Ukraine; it's about freedom – and it's a war we have to win.\" She suggested the United States should supply Ukraine military equipment rather than money.\nHaley criticized the Biden administration for \"emboldening\" Putin's desire to invade Ukraine during the American withdrawal from Afghanistan.\nIsrael-Hamas War\nHaley has expressed her full support for Israel saying, \"we have three priorities when we look at Israel: Support Israel with whatever they need whenever they need it. Eliminate Hamas, not weaken them — eliminate Hamas. And do everything we can to bring our hostages home.\"\nHaley supports providing more military aid to Israel and pulling government funding from universities with staff and students who hold protests in support of Palestinians. She said Arab countries should accept Palestinian refugees from the Gaza Strip.\nHaley has been critical of the Biden administration saying that Biden's \"weakness and incompetence\" caused the attack on Israel. Haley has touted her own record on Israel, specifically while serving as Ambassador to the United Nations.\nIn December 2023, Haley rejected calls for a ceasefire, saying that the \"best way to save people in Gaza is to eliminate Hamas\".\nElections and government\nCandidate competency\nOne of her first proposals as a candidate was to call for candidates over the age of 75—which would include both Trump and Biden—to be required to take a competency test. This led CNN personality Don Lemon to say that Haley \"isn't in her prime\" and that a woman is \"considered to be in her prime in her 20s and 30s and maybe 40s\". The comments went viral and received widespread negative reactions, with many, including Haley herself, labeling his comments sexist. Lemon later apologized for the comments.\nJanuary 6 attacks on the Capitol\nAt a campaign event in Iowa on May 18, 2023, Haley said that January 6 was \"a terrible day\" and that anyone who participated in the January 6 United States Capitol attack \"should pay the price\".\nTerm limits\nIn her campaign announcement speech, Haley called for congressional term limits without specifying the details of these limits.\nImmigration and the border\nIn May 2023, Haley spoke out against family separation of migrants that cross the Mexico–United States border. She also said that the immigration officials should not take custody over families that \"we don't have any control over\".\nSocial issues\nKilling of Jordan Neely\nIn the wake of the killing of Jordan Neely, Haley expressed support for Daniel Penny, the man accused of and charged with the manslaughter of Neely. She called for New York governor Kathy Hochul to pardon Penny, saying that \"it is the right thing to do\", and that \"[Penny] was trained to defend and protect\".\nLGBTQ+ issues\nIn February 2023, Haley said that the Florida Parental Rights in Education Act, commonly referred to as the \"Don't Say Gay\" law, does not go far enough. She proposed extending the Act's prohibitions against discussing sex and sexuality before third grade until seventh grade. She also suggested that such discussions should require opt-in parental consent.\nWhile campaigning, Haley has repeatedly attacked transgender influencer Dylan Mulvaney, who she referred to as \"the Bud Light person\" in reference to the Bud Light boycott, and said \"Make no mistake. That is a guy dressed up like a girl, mocking women. Women don't act like that, yet you have companies glorifying him.\"\nSpending\nIn early May 2023 at a campaign event in Iowa, Haley promised to veto any spending bill that raised federal spending above pre-pandemic levels. She also criticized Biden and congressional Republicans and Democrats for excessive government spending and dubious earmarking.\nPresidential debates\nHaley was one of eight candidates who appeared at the first Republican presidential debate on August 23, 2023. Her performance was widely praised, with Christian Paz of Vox writing that Haley \"stands out as the candidate who stood her ground, cracked enough jokes, and confronted Ramaswamy just as it was needed. But none of it is likely to be enough to catapult her to the front of the pack or seriously challenge Trump.\" Rich Lowry of National Review opined that DeSantis, Ramaswamy, and Haley were the three best-performing candidates. Liz Peek of Fox News felt that Ramaswamy was the worst-performing candidate, while Haley was the best. A post-debate poll, conducted by JL Partners, asked registered Republican voters who possessed the best debate performance, and Haley received 7%. FiveThirtyEight also polled Republican voters, with 15% responding that Haley possessed the best performance, the third highest amount, only behind DeSantis and Ramaswamy.\nHaley appeared alongside six competitors at the second Republican presidential debate on September 27, 2023. All competitors from the first debate returned, except Hutchinson who failed to qualify. The Hill noted Haley and Trump as the debate's winners, citing the former as going \"on offense throughout the night, mostly successfully.\" The reporters of Politico gave mixed results, variously citing Scott and Haley as the winners. The Washington Post called Trump, Haley, and the Affordable Care Act the winners, noting that while Haley had \"a bit less impact\" than her performance in the first debate, she still \"gave one of the most substantive answers on health care\" and \"looked less like she was pandering and punting on questions than the other candidates did.\" Opinion writers and contributors of The New York Times gave Haley 4.9 points, the highest score of any candidate. FiveThirtyEight polled Republican voters on who performed the best and worst of the debate, with 33% responding that Ron DeSantis had the best performance, while 18% chose Haley.\nHaley participated with four competitors in the third Republican presidential debate on November 6. All returned from the second debate, except Pence and Burgum. Ramaswamy cited Haley's daughter's use of TikTok after Haley criticized him for using the site, and she responded for him to leave her daughter out of his \"voice\", adding, \"You're just scum.\" The Hill named Haley, DeSantis, Trump, and the debate moderators the winners of the debate. Republican operative Rob Stutzman credited Haley with being \"three for three on very good debate performances\" and countering attacks from Ramaswamy and DeSantis. The Washington Post named Haley, DeSantis, Ramaswamy, and RNC Chairwoman Ronna McDaniel as the debate's losers. Vox opined that all participants were losers, writing that although Haley needed to get her rivals out of the race, \"those rivals don't seem to be in a hurry to wind down their campaigns, and Haley didn't perform well enough Wednesday to force them to do so anytime soon.\"\nHaley appeared with three competitors at the fourth Republican presidential debate on December 6. All returned from the third debate, except Scott, who suspended his campaign. Newsweek called Haley, DeSantis, Trump, and Israel the debate's winners. Vox named the Haley-Christie alliance, far-right conspiracy theorists, and Donald Trump as the debate's winners. Time wrote that Haley left the debate \"rising even more quickly\" and that the attacks she received from her GOP rivals were \"further evidence that Haley may be the most viable non-Trump candidate to beat\". The Hill gave Haley a mixed rating, calling it \"plainly her weakest debate performance so far\" as during the previous debates Haley had been \"the central figure, setting the agenda and turning opponents' attacks to her advantage.\"\nHaley and DeSantis participated in the fifth Republican debate on January 10.  Ramaswamy did not qualify, and Christie suspended his campaign hours earlier. Vox named Haley the debate's winner, reasoning that although she was trailing Trump in national polls, she just \"needed to avoid a damaging gaffe or embarrassing moment, and she did that.\" Politico noted that Haley and DeSantis both attacked Trump unlike previous debates and that the debate \"will be remembered as a grinding slugfest, one filled with policy disagreements, political knife fighting, but also a healthy dose of canned lines and accusations of foot shooting.\" Nielsen reported that the debate was seen by under 2.6 million viewers, a lower number than the 4.3 million viewers of Trump's concurrent town hall.\nAfter the Iowa caucuses, Haley announced she would not attend another presidential debate unless Trump or Biden also attended. This led to ABC News cancelling a debate scheduled for later that week in New Hampshire.\nEndorsements\nDenouncements\nOn January 12, 2024, Rand Paul denounced Haley's campaign, launching the \"Never Nikki\" website.\nPolling\nAt the launch of her campaign, most reputable polls reported Haley receiving approximately 4–7% of the Republican vote. She experienced a boost in support after her campaign launch.\nBy the beginning of summer 2023, Haley was still receiving 4–7% of the Republican vote in primary polls. At an Iowa campaign event, Haley said the low numbers didn't bother her and that she received similar low polls in the early stages of her successful South Carolina gubernatorial race.\nAfter the Republican debates, Haley has seen an uptick in national and early state polls, with a 10.7% average support in national Republican polls by mid-November, behind Trump and Desantis. In both South Carolina and New Hampshire primaries, polls have shown Haley taking second place after Trump.\nOn January 2, 2024, FiveThirtyEight senior editor Nathaniel Rakich announced Haley had risen to second place in the national polling average.\nReferences\nExternal links\n* [https://www.nikkihaley.com/ Campaign website]"
    }
  ]
}