{
  "content": [
    {
      "type": "text",
      "text": "# Nikoli Edwards\n\n| birth_place      = San Fernando, Trinidad and Tobago\n| death_date       =\n| death_place      =\n| party            = Progressive Party (interim leader) (2019–present)\nIndependent (Senate affiliation) (2017–2018)\n| otherparty       =\n| spouse           =\n| partner          =\n| relations        =\n| children         =\n| residence        =\n| education        =\n| alma_mater       = University of the West Indies\n| occupation       = Businessman\n| profession       =\n| known_for        =\n| committees       =\n| portfolio        =\n| awards           = Trinidad and Tobago 2018 National Youth Award: Youth Activism\n| website          = nikoliedwards.com\n}}\nNikoli Edwards (born 16 October 1991) is a politician and political activist from Trinidad and Tobago. On 11 January 2017 he was appointed as a temporary Independent member of the Senate of Trinidad and Tobago by former President Anthony Carmona. He launched a new political party called the Progressive Party on 16 June 2019. On the 11th of August 2020, Trinidad and Tobago held their General Elections where Edwards contested a seat, San Fernando West. His rivals were Attorney General Faris Al-Rawi (PNM, seat holder) and Sean Sobers (UNC). Nikoli Edwards, interim leader of the Progressive party lost the general elections and San Fernando West was retained by current Member of Parliament and Attorney General  Faris Al-Rawi. Nikoli obtained 211 votes for the Progressive Party.\nLife and early career\nEdwards was born and raised in San Fernando, Trinidad and Tobago. He spent the first 12 years of his life living along Independence Avenue, San Fernando, and then moved to Diamond Village. He is the first-born child of Tamara Edwards and Hassan Atwell. Edwards attended San Fernando Boy's R.C. School between 1995 and 2003 and then went on to San Fernando Secondary Comprehensive until 2008. He later pursued a certificate in Communication Studies at the University of the West Indies Open Campus between 2009 and 2012 and then moved on to the University of the West Indies, St. Augustine, where he completed a Bachelor's of Arts degree in Communication Studies and a minor in Theatre Arts with Honours in 2015. Edwards then began his postgraduate studies in the field of Mediation Studies at the University of the West Indies, St. Augustine.\nEdwards was elected to the Commonwealth Youth Council in November 2015 and serves as Vice Chair for Policy, Advocacy and Projects. He is also founder and chair of the Trinidad and Tobago Youth Convention. He served as Faculty of Humanities and Education Representative of the University of the West Indies St. Augustine Guild of Students during the academic year 2014/2015 and then Secretary during the academic year 2015/2016.\nReferences"
    }
  ]
}