{
  "content": [
    {
      "type": "text",
      "text": "# Nilkantheswar Shiva Temple__disambig_1\n\n| country            = India\n| state              = Orissa\n| district           =\n| location           = Bhubaneswar\n| deity      = Lord Shiva\n| festivals=\n| architecture       = Kalingan Style (Kalinga Architecture)\n| temple_quantity  =\n| monument_quantity=\n| inscriptions       =\n| year_completed         = 10th century A.D.\n}}\nNilakanthesvara Shiva Temple is a temple in Orissa, India, located on the western embankment of the Bindusagar tank. It is situated on the left side of the lane branching from the road leading from Kedar Gouri chowk to the Vaitaḷa deuḷa in Bhubaneswar, the capital state of Orissa. The temple faces east. The temple's enshrining deity is a circular yoni pitha with a chlorite Siva lingam. The temple is made out of sandstone. The present temple is a recent construction over the remains of an earlier one. The building material is old but the entire structure now has cement plaster and an enamel point.\nThe temple has multiple public owners.\nHistory\nThe original temple was constructed during the 10th Century, as indicated by the Parsvadevata-like Kartikeya holding a cock in his upper left hand.\nThe local people ascribe the temple to the Kesaris (Somavamsis). Its cultural significance is Sankranti and Sivaratri. Its social significance was for the rituals of Sradha, Rudrabhiseka, mangula, marriage and thread ceremonies.\nDescription\nThe temple is made of sandstone. The interior is dry masonry with cement plaster. The temple is in Kalingan style. It is in fair condition. Its architecture, historic and cultural importance are graded B. Its associational importance is graded C.\nThere is a modern compound wall measuring 9.50 metres in length x 1.48 metres height x 0.40 metres thickness made of laterite with two entrances. On the northern side of the temple there is a circular yoni pitha with Siva lingam. The eastern side of the temple displays four eroded, detached sculptures that are not clearly identifiable.\nSurrounding\nThe temple is surrounded by Bindusagar tank on its east at a distance of 15 metres, private residential buildings in the west. Hadisahi in south at a distance of 12 metres and vaitala temple on its south –western side at a distance of 200 metres.\nArchitectural features (Plan and Elevation)\nOn plan, the temple has a square vimana and a frontal porch measuring 4.90 metres. The vimana is 4.30 square metres and frontal porch 0.60 metres. On elevation, the vimana is a pidha deul having bada, gandi and mastaka. The 311 temple measures 4.55 metres in height from pabhaga to mastaka. The bada has threefold divisions measuring 2.05 metres in height( pabhaga 0.63 metres, jangha 1.18 metres and baranda 0.24 metres). It is plain except the Udyota simha above raha pagas of each wall. The gandi is made of three horizontal tiers measuring 1.50 metres. The mastaka consisting of beki, ghanta, amlaka, khapuri, kalasa and trisula (trident) as ayudha measured 1.00 metres in height. In front of the vimana in the eastern wall there is a concrete structure that serves as the Jagamohana.\nRaha niche & parsva devatas\nThe raha niches measure 1.47 metres x 0.32 metres x 0.12 metres in height, width and depth respectively. The southern raha niche houses the image of a four-armed Ganesha standing in tribhangi pose over a lotus pedestal. The image is holding nagapasa in the upper right hand and the lower right hand is in varadamudra. The other two hands are broken.\nThe western raha niche houses the image of a four-armed Kartikeya holding dambru (cattle\ndrum) in his lower left hand and a cock in his upper left hand with a female attendant upholding\nthe cock. Upper right hand of the deity is resting over the beak of his mount peacock. The lower\nright hand is broken. The image is standing over a lotus pedestal.\nThe northern raha niche enshrines the image of a four-armed Parvati holding a conch in her\nlower left hand, a nagaphasa in the lower right hand and baranda in the upper right hand. The upper left hand holds a mace.\nDecorative features\nThe doorjambs measure 1.70 metres in x 0.90 metres. In the lintel there is a Gajalaxmi seated in lalitasana. The deity is four-armed, holding a lotus in her left arm and making varadamudra with her right arm.\nNotes\nReferences\n*Lesser Known Monuments of Bhubaneswar by Dr. Sadasiba Pradhan ()\n*http://www.iskconbbsr.org/\n*http://www.panoramio.com/photo/52460459\n*http://www.william-voirol.ch/In/24/0/26/P.html?lng=0\n*http://www.oktatabyebye.com/Travel-Ideas/pilgrimage-india/dwarka.aspx\n*http://www.addictedtotravel.com/holidays/tribal-tour-of-orissa\n*http://swastiktravels.in/services"
    }
  ]
}