{
  "content": [
    {
      "type": "text",
      "text": "# Ninja Warrior Germany\n\n| narrated           =\n| editor             =\n| composer           =\n| country            = Germany\n| language           = German\n| num_seasons        = 10\n| num_episodes       = 94\n| list_episodes      =\n| executive_producer =\n| producer           =\n| camera             = Multiple-camera\n| runtime            = 125-130 minutes\n| company            = Norddeich TVEndemol Shine Germany\n| channel            = RTL\n| first_aired        =\n| last_aired         = present\n| related            = SasukeAmerican Ninja WarriorNinja Warrior UK\n}}\nNinja Warrior Germany () is a Ninja Warrior spin-off that first aired in Germany on RTL in the Spring of 2016. Based on the Japanese broadcast television show, Sasuke, and internationally known as Ninja Warrior, contestants in the show are faced with completing various obstacles in the shortest time possible. In 2021, the sixth season of the show, René Kaselowsky and Moritz Hans both cleared Stage 4, the Mount Midoriyama with Kaselowsky having a faster time and being declared the \"1st Ninja Warrior Germany\" and winning the €300.000 prize money.\nFormat\nEach season's competition starts with around 1300 contestants and is divided into three stages - five qualifier rounds, two semi-finals, and the final round. The assault course that is used on the program is contained within a specially made studio, and features a variety of obstacles either taken from or based upon Sasuke, with both the warped wall and the \"quintuple steps\" being used in every episode.\nEach qualifier round consists of fifty contestants, and features six obstacles used in the course, four of which differ between the rounds. For example, the first qualifier might feature a swing rope obstacle, but the second qualifier might switch it for a monkey-bar styled obstacle. To qualify, contestants must be within the top ten, either by getting the furthest on the course, or if they complete it, having the fastest time.\nAfter the qualifiers, the fifty semi-finalists are split evenly between the two semi-finals, and tackle nine obstacles. Unlike the qualifiers, the first six obstacles must be completed within a set time-limit, but contestants then can freely tackle the remaining three obstacles in their own time. Like the qualifiers, the top fifteen contestants in the semi-finals would move on to the finals, based on who got the furthest or achieved the fastest time. Once in the final, the fifteen finalists tackle three separate stages of obstacles - while the first two stages are timed, with the first stage consisting of nine obstacles and the second consisting of five, the final stage is not timed and consists of three obstacles. Whoever manages to go the furthest or completes all three stages, is declared \"The Last Man Standing\" and wins. However, in the event that more than one contestant beats all three stages, they then tackle one more obstacle to determine the winner - climbing (fictional) \"Mount Midoriyama\" with a  rope.\nThe show's format features a similar approach to that of American Ninja Warrior, in that footage in episodes focuses on the highlights of  contestant runs. Commentary of a contestant's run is mainly done by the presenters, Köppen and Buschmann, while Wontorra often interviews contestants before their run, and occasionally those who fail a run. In some instances, the interview is conducted by Köppen and Buschmann if a contestant's run was successful, especially during the qualifiers. In the seventh season of the show contestans with 16 years old are allowed to participate.\nSeason overview\n{| class=\"wikitable\" style=\"text-align:center; width:19%\"\n|-\n! scope=\"col\" | Seasons\n! scope=\"col\" | Start date\n! scope=\"col\" | End date\n! scope=\"col\" | Last Man Standing\n! scope=\"col\" | Result Best Man\n! scope=\"col\" | Last Woman Standing\n! scope=\"col\" | Result Best Woman\n! scope=\"col\" | Last Ninja Standing Prize Men/Woman\n! scope=\"col\" | Total Winners Prize\n|-\n! scope=\"row\" | 1\n|\n|\n| Oliver Edelmann\n| Failed Stage 2/Unstable Bridge\n| rowspan=\"3\"| n.a\n| rowspan=\"3\"| n.a\n| rowspan=\"2\"| none\n| €100,000\n|-\n! scope=\"row\" | 2\n|\n|\n| style: gold | Moritz Hans\n| Failed Stage 3/Ultimate Cliffhanger\n| €200,000\n|-\n! scope=\"row\" | 3\n|\n|\n| rowspan=\"3\"|Alexander Wurm\n| Ran Stage 4/Mt.Midoriyama/Timeout\n| rowspan=\"8\"| €25,000\n| rowspan=\"8\"| €300,000\n|-\n! scope=\"row\" | 4\n|\n|\n| rowspan=\"2\"|Failed Stage 3/Flying Bar\n| Arleen Schüßler\n| Failed Stage 1/Wheel Flip\n|-\n! scope=\"row\" | 5\n|\n|\n| rowspan=\"2\"|Stefanie Noppinger\n|Failed Stage 1/Jump Pole 2.0\n|-\n! scope=\"row\" | 6\n|\n|\n| René Casselly\n| Completed Stage 4\n| Failed Stage 3/Cane Lane\n|-\n! scope=\"row\" | 7\n|\n|\n| Max Görner\n| Ran Stage 4/Mt.Midoriyama/Salmon Ladder\n| Andrea Meßner\n| Cleared Semifinal/wasn't in the Top 35 for Stage 1\n|-\n! scope=\"row\" | 8\n|\n|\n| Philipp Göthert\n| Ran Stage 4/Mt.Midoriyama/Rope Climb\n| Viktoria Krämer\n| Failed Stage 1/Roller Rod\n|-\n! scope=\"row\" | 9\n|\n|\n| René Casselly\n| Ran Stage 4/Mt.Midoriyama/Rope Climb\n| Nicola Wulf\n| Failed Stage 2/Water Walls 2.0\n|-\n! scope=\"row\" | 10\n|\n|\n|\n|\n|\n|\n|}\n4 Nations Special\nOn November 25, 2018, for the first time, a \"4 Nations Special\" took place, in which the best participants from Germany, UK, France and Spain stood against each other competed. The special consisted of three courses, each with three laps, in each of which one athlete of each nation competed. The fastest athlete in the round received three points for his nation, the second best two points, the third best one point and the slowest none. The two nations with the most points then entered the overall victory at Mount Midoriyama. The teams consisted of:\n* Germany: Oliver Edelmann, Benjamin Grams, Moritz Hans, Rene Kaselowsky, Max Sprenger, Alexander Wurm\n* Great Britain: Ruel DaCosta, Christopher De Stefano, Louis Parkinson, Tim Shieff, Dion Trigg, Jonny Urszuly\n* France: Thomas Ballet, Valentin Dubois, Clément Dumais, Mehdi Hadim, Guillaume Moro, Jean Tezenas du Montcel\n* Spain: Carlos Catari Ramones, Jonathan Grande Lindo, Eric Lopez, Jonathan Iris Manuel Matamoros, Facundo Regalini, Sergio Verdasco\nAfter the three courses Germany came with 25 points and Spain with 12 points in the last round, which René Kaselowsky and Eric López contested for their nation. In this Kaselowsky could climb the Mount Midoriyama faster than his competitor López and thus won the overall victory for Germany.\nCelebrity Specials\nNovember 2017\nAs part of the RTL Spendenmarathon broadcast on November 24, 2017, 23 celebrities lined up on a circuit with simplified rules at six obstacles. By Sven Hannawald, Jörn Schlönvoigt, Julius Brink, Paul Janke, Alexander Keen, Philipp Boy, Gil Ofarim, Björn Otto, winner of American Ninja Warrior, Isaac Caldiero, Patrick Bach, Massimo Sinato, Lars Riedel, Mario Basler, Ansgar Brinkmann, Oliver Pocher, Detlef Steves, Thomas Häßler, Mario Kotaska, Jürgen Milski, Beatrice Egli, Eva Habermann, Panagiota Petridou and Liz Baffoe denied the nine first named as \"finishers\", and the next three as the next best, the second obstacle course. Boy, Otto and Caldiero also reached the finish in the second round. The fastest, Isaac Caldiero, denied the third round and defeated the Mount Midoriyama (a 20m high rope climbing).\nIn the first round, the participants earned €1,000 per obstacle overcome (plus €1,000 start-up bonus) and €2,000 in the second round. €20,000 were earned in the third round, a total of €190,000 for children's projects.\nJune 2018\nIn June 2018, three celebrities competed against each other in eight celebrity teams. Each team consisted of two men and one woman:\n* Team Bachelor: Paul Janke, Jessica Paszka, Christian Tews\n* '''Team Let's Dance: Massimo Sinató, Isabel Edvardsson, Gil Ofarim\n* Team Dschungelkönige: Peer Kusmagk, Melanie Müller, Marc Terenzi\n* Team Fußball-Legenden: Thomas Häßler, Yasmina Filali, Mario Basler\n* Team Sporthelden: Björn Otto, Tanja Szewczenko, Philipp Boy\n* Team Große Klappe: Ansgar Brinkmann, Verena Kerth, Jürgen Milski\n* Team Beach Action: Julius Brink, Miriam Höller, Lazy Dee\n* Team Chartstürmer: Beatrice Egli, Jörn Schlönvoigt, Luca Hänni\nThe Team Sporthelden''' prevailed in the final against the team Chartstürmer and won €107,000 for \"Wir helfen Kindern\". As the women had previously injured both teams, Beatrice Egli was replaced by Miriam Höller and Jessica Paszka joined Tanja Szewczenko.\nNovember 2018\nAs part of the RTL Spendenmarathon on November 23, 2018, another celebrity issue took place. A total of 26 celebrities lined up the course. Paul Janke, Florian Ambrosius, Melissa and Sven Hannawald, Lars Riedel, Lars Riedel, Ross Antony, Uschi Disl, Alexander Klaws, Joey Heindle, Philipp Stehler (Bachelorette candidate), Sebastian Fobe (Bachelorette candidate), Jasmin Wagner, Philipp Boy, Sarah Lombardi, Julius Brink, Heike Henkel, Roman and Heiko Lochmann, Miriam Höller, Björn Otto, Jenny Frankhauser, Maximilian Arland, Jörn Schlönvoigt, Luna Schweiger, Fabian Hambüchen and Grant McCartney (American Ninja Warrior).\nThe participants earned per obstacle overcome in the first round €1,000(plus €1,000 start premium) and in the second round corresponding to €2,000. So succeeded in the first round €137,000 to earn, with moderator Jan Köppen defeated the wall in a special insert and he played so €1,000. For 13 participants it went into the second course, which added another €72,000. The third round was won by the three best: Fabian Hambüchen, Philipp Boy and Grant McCartney, who were now able to beat the \"Mount Midoriyama\". Each time the rope was marked, it was worth €1,000 for the good cause, and as the fastest way to tackle the final obstacle, American Ninja Warrior Grant McCartney became the winner of the day.\nA total of €238,000 were earned for children's projects.\nTeam Ninja Warrior\nSeason One\nFrom April 22 to May 27, 2018, the first German Team Ninja Warrior took place. In this version, the candidates do not compete individually, but in teams of three. Each team consists of two men and one woman. Eight teams compete in each show. In the preliminary round, the three members of a team in direct duels against another team, the women always form a duel. There will be one point for the winners of the first two rounds and two points for the winner of the third round. If there is a tie after three runs, there is an additional round of the run. In the KO round, the four winning teams each compete against a losing team. The four winners come one round further, the losers of the knockout round are eliminated. The winning teams will ultimately compete in the final qualifying, which will take place as relay race, with each team member having to overcome three of a total of nine obstacles. The faster team reaches the final show.\nIn the big final the team \"Magic Monkeys\" (René Kaselowsky, Simon Brunner, Denise Pirnbacher) beat the team \"Queen of Kingz\" (Arleen Schüßler, Benedikt Sigmund, Christian Harmat) and won the prize money of €100,000.\nSeason Two\nFrom the 15th of June to the 20th of July the second season of Team Ninja Warrior took place. As in the previous year, three teams from two men and one woman compete in this competition, but now there are five instead of eight teams in each show. In the preliminary round, all teams compete against each other in relay races. The winners of a relay race receive one point and an additional point for the successful completion of the course. The four teams with the most points are drawn into the KO round, where two teams compete against each other in direct duels following the concept of preliminary rounds in the previous year. In addition, the team with the fastest time in their episode in this episode will receive a €3,000 bonus. The two teams, which receive three points first, reach the final qualification, which will be played as a relay race on an extended course. The winning team of this relay race reaches the final show.\nIn the grand finale, the team '\"Magic Monkeys\"' (René Kaselowsky, Simon Brunner, Stefanie Noppinger) could defend the title against the Team \"Fusion\" (Moritz Hans, Christian Harmat, Astrid Sibon) and thus won the prize money of €100,000.\nNinja Warrior Germany Kids\nSeason One\nKids from age 10-11 and 12-13 years participated in this Spin-off. Winner in the age 10-11 category was the 11 years old Luca from Wuppertal. Winner in the age 12-13 category was the 13 years old Frederik Huber from Ostfildern  in Baden-Württemberg.\nProduction\nThe first season with five episodes was recorded from May 19–24, 2016 at the Dm-Arena in Karlsruhe, Germany. there also the second from June 15–21, 2017. In 2016, a special titled Ninja Warrior – Das Phänomen was produced.\nRatings\n{| class=\"wikitable\" style=\"text-align:center;\"\n|-\n! rowspan=\"2\"| Season\n! rowspan=\"2\"| Episodes\n! colspan=2| Premiered\n! colspan=2| Ended\n|-\n! Date\n! span style=\"font-size:smaller; line-height:100%;\"|\n! Date\n! span style=\"font-size:smaller; line-height:100%;\"|\n|-\n| 1\n| 5\n| 9 July 2016\n| 2.18\n| 30 July 2016\n| 2.92\n|-\n| 2\n| 9\n| 12 August 2017\n| 2.92\n| 1 October 2016\n| 3.27\n|-\n| 3\n| 9\n| 22 September 2018\n| 2.47\n| 16 November 2018\n| 3.00\n|-\n| 4\n| 9\n| 13 September 2019\n| 1.94\n| 8 November 2019\n| 2.88\n|-\n| 5\n| 10\n| 2 October 2020\n| 2.68\n| 4 December 2020\n| 3.56\n|-\n| 6\n| 11\n| 15 October 2021\n| 2.10\n| 18 December 2021\n| 2.25\n|-\n| 7\n| 9\n| 30 September 2022\n| 1.82\n| 18 November 2022\n| 2.30\n|-\n| 8\n| 10\n| 13 October 2023\n| 1.93\n| 15 December 2023\n| 2.37\n|-\n| 9\n| 10\n| 18 October 2024\n| 1.65\n| 13 December 2024\n| 2.04\n|-\n| 10\n| 12\n| 19 October 2025\n|\n| 12 December 2025\n|\n|}\nReferences\nExternal links\n* RTL website for Ninja Warrior Germany\n* Team Ninja Warrior Germany"
    }
  ]
}