{
  "content": [
    {
      "type": "text",
      "text": "# Ninja cops of the Philippine drug war\n\nNinja cops, or narco cops, is a term that was popularized at the height of the Philippine drug war, which began during the presidency of Rodrigo Duterte in 2016. It refers to a label used to refer to police personnel who are alleged to be involved in the illegal drug trade themselves by reselling portion of the contraband seized in anti drug operations.\nIn 2019, PNP Chief Oscar Albayalde became subject of controversy over allegedly protecting \"ninja cops\" involved in an operation in Mexico, Pampanga, in 2013, a few years before the start of President Duterte's administration.\nBackground\nThe \"ninja cops\" refers to the police officers who were accused of reselling (\"recycling\") illegal drugs seized during the police operations or of protecting people involved in the illegal drug trade.\nPNP Chief Oscar Albayalde became the center of the controversy when he was accused of protecting the so-called \"ninja cops\" or corrupt officials.\nCases\n2016 transfer of ninja cops to Mindanao\nIn 2016, upon the assumption of office of Ronald dela Rosa as chief of the Philippine National Police he urged a group of police officers tagged as \"Ninja\" to surrender with 48 hours. The deadline lapsed which prompted dela Rosa to threaten them to be reassigned to Mindanao. This followed dela Rosa relieving 32 police personnel in Metro Manila an reassigning them to Caraga, Autonomous Region in Muslim Mindanao and the Zamboanga Peninsula. This was in response to intelligence reports that these officers could be ninja cops but they had no enough evidence to file cases against them at the time.\nTwelve went into absent without official leave (AWOL) status in October 2022.\n2013 Mexico, Pampanga case\nOn November 29, 2013, twelve police officers, led by Major Rodney Baloyo, conduct a raid on Mexico, Pampanga, and seized  of methamphetamine (shabu). Albayalde was the acting police chief of Pampanga at the time of the raid. That operation was supposed to go after Chinese drug lord Johnson Lee, but they evaded the arrest after Lee allegedly paid the police officers a P50 million. Lee currently remains at large and is now wanted by the authorities. Baloyo contradicted the morning police operations, saying that they raided Lee's house at 4:30 p.m. On November 30, 2013, authorities submitted the illegal drugs that they recovered as a evidence. PNP Chief General Oscar Albayalde was accused of covering-up the issue.\nIn a Senate hearing, according to Major Rodney Baloyo, he ordered Police Officer 2 Anthony Lacsamana to conduct a raid on the area; however, Lacsamana denied Baloyo's claim. Senator Richard Gordon had Baloyo detained at the New Bilibid Prison for \"lying\" at the hearing. A Senate investigation found out that P648 million worth of seized shabu from the November 2013 raid was not declared by the Pampanga police. Additionally, it was reported that the police officers have earned P50 million from the drug lord's wealth. Former Deputy Director for Operations of the CIDG Gen. Rudy Lacadin revealed that then-Pampanga provincial director Albayalde had received some money from the operation. A memo written by Albayalde sent to the Regional Director on December 2, 2013, stated that Albayalde himself ordered the buy-bust operation in Pampanga, however during the Senate hearing, Albayalde denied knowledge of the operation.\nThe Makabayan bloc demanded the immediate resignation of Albayalde from his post and other officials implicated in the controversy. On October 14, Albayalde resigned as PNP chief. Duterte expressed his disappointment over the issue.\nOn October 21, 2019, The PNP-Criminal Investigation and Detection Group (CIDG) filed a complaint before the Department of Justice against Albayalde and 13 of his personnel, citing a reinvestigation of the alleged recycling of some 162 kilograms of shabu that they seized, while the Senate suggested life imprisonment for the police officers. The PNP said in a statement that the accused \"remain innocent until proven guilty.\"\nOctober 2022 Manila drug raids\nPhilippine National Police Drug Enforcement Group (PNP-DEG) Special Operations Unit-National Capital Region officer Police Master Sergeant Rodolfo Mayo Jr. was implicated for being involved in the illegal drug trade after the PNP-DEG conducted an anti drug operation on a lending business office in Tondo, Manila. Mayo himself would be arrested.\nIn December 2022, former PNP chief and Senator Ronald dela Rosa, declared ninja cops were \"back\" in Metro Manila citing the October 2022 case. He disclosed that Mayo was among the police officers he reassigned to Mindanao in 2016 for being allegedly a ninja cop. He was perplexed on how Mayo would not only be able to return to Manila but also be assigned as an intelligence officer in the PNP-DEG.\nOther incidents\nOctober 2019 – nine police officers in Central Visayas were dismissed from their duties of Police Regional Office 7 after they underwent surprise drug tests. They were allegedly \"ninja cops\".\nSee also\n* Allegations of CIA drug trafficking\n* Brazilian police militias\n* Cartel of the Suns\n* Police corruption in the Philippines\n* Right-wing paramilitarism in Colombia\nReferences"
    }
  ]
}