{
  "content": [
    {
      "type": "text",
      "text": "# Nisha Warsi\n\n| birth_place          = Sonipat, Haryana, India\n| height               = 1.65 m\n| weight \t           =\n| position             = Defender\n| years1               =\n| clubs1               = Railways\n| caps1                =\n| goals1               =\n| years2               = 2025–\n| clubs2               = Odisha Warriors\n| caps2                =\n| goals2               =\n| nationalyears1       = 2019–\n| nationalteam1        = India\n| nationalcaps1        = 89\n| nationalgoals1       = 1\n| medaltemplates       =\n}}\n}}\nNisha Warsi (born 9 July 1995), known mononymously as Nisha, is an Indian field hockey player from Sonipat Haryana competed in 2020 Summer Olympics (Tokyo Olympic).\nEarly life\nNisha Warsi had modest aspirations as a child. She had always had a strong desire to participate in sports, but she wanted to do it in a way that would not drain her parents’ bank account. Her family couldn't afford much, so any opportunity to earn money via sports was always appreciated. She went with hockey. Her father, Sohrab Ahamad, was a tailor before a stroke in 2015 left him paralyzed and forced him to quit. Her mother, Mahroon, worked in a foam manufacturing factory for a few years before Nisha landed a job with the Railways.\nAt one point, social barriers forced Nisha to quit the game. However, her coach Siwach convinced her parents to allow her to chase her dreams. Thankfully, the break was brief. \"The ground was about 30 minutes away and she had to leave home by 4.30 am. Nisha was scared to travel alone. Nisha's father would drop her on his bicycle and my mother would be up and about at 4 am to start her daily chores which began with waking Nisha up and making breakfast. In time, Nisha became a regular member of the Haryana team and later the Railways unit. The earnings made life at home a lot more comfortable.\"\nCareer\nShe made her international debut in 2019 at the FIH Finals Series in Hiroshima and has since earned nine India caps. Like the rest of the world, the pandemic wasn't easy on Nisha, who spent the better part of the past year-and-a-half at the national camp in SAI, South Centre. Cut to 2021, and Nisha is headed for the Tokyo Olympics. She harbours the dream of standing on the podium, arms interlinked with her India hockey teammates and making the country and her parents proud. On the international scene, Nisha was a late bloomer, having missed out on the junior India team.\nReferences\nExternal links\n*\n*[https://www.hockeyindia.org/players/nisha-profile-3847 Nisha Warsi] at Hockey India"
    }
  ]
}