{
  "content": [
    {
      "type": "text",
      "text": "# NME in Association with War Child Presents 1 Love__disambig_1\n\nNME in Association with War Child Presents 1 Love is a charity album by various artists. New Musical Express (better known as NME) is a popular music magazine in the United Kingdom which has been published weekly since March 1952.\nThe compilation features past number one hits covered by acts from the early 2000s and was released to mark the NME's 50th anniversary, 10 years on from their Ruby Trax compilation that had also followed this format.\nWar Child is a charitable organization that works with children affected by war in Iraq, Afghanistan, Democratic Republic of Congo and Uganda. War Child works with children who have been hit hardest by the joint forces of poverty, conflict, and social exclusion.\nOther War Child albums include The Help Album (1995), Help!: A Day in the Life (2005), and War Child Presents Heroes (2009).\nTrack listing\n#\"All or Nothing\" (originally by the Small Faces) - Starsailor\n#\"The Power of Love\" (originally by Frankie Goes To Hollywood) - Feeder\n#\"Killer\" (originally by Adamski) - Sugababes\n#\"House of the Rising Sun\" (traditional) - Muse\n#\"Nothing Compares 2 U\" (originally by The Family) - Stereophonics\n#\"Dub Be Good to Me\" (originally by Beats International) - Faithless and Dido\n#\"Merry Xmas Everybody\" (originally by Slade) - Oasis\n#\"Something in the Air\" (originally by Thunderclap Newman) - Elbow\n#\"Back to Life (However Do You Want Me)\" (originally by Soul II Soul) - The Reelists featuring Ms. Dynamite\n#\"Out of Time\" (originally by the Rolling Stones) - Manic Street Preachers\n#\"Come On Eileen\" (originally by Dexys Midnight Runners) - Badly Drawn Boy with Jools Holland and his Rhythm & Blues Orchestra\n#\"Ghost Town\" (originally by The Specials)  - The Prodigy\n#\"Firestarter\" (originally by The Prodigy) - Jimmy Eat World\n#\"Pretty Flamingo\" (originally by Manfred Mann) - Darius\n#\"Dreams\" (originally by Gabrielle) - More Fire Crew featuring Gabrielle\n#\"Back for Good\" (originally by Take That) - McAlmont & Butler\nReferences\nExternal links\n*[http://www.warchild.org.uk/ War Child]"
    }
  ]
}