{
  "content": [
    {
      "type": "text",
      "text": "# No-Fi Soul Rebellion\n\nNo-Fi Soul Rebellion is an American musical group formed in Alaska in 2001. The band was started by Mark Heimer, who records all vocals and music himself.  The performing band is made up Mark Heimer and his wife Andrea Heimer. The couple was based in Seattle for a time and now resides in Bellingham, WA.\nNo-Fi Soul Rebellion is most noted for their dynamic, unconventional live shows, which feature the band performing on the venue floor in the middle of the audience. Mark Heimer uses a  microphone cord, giving him enough movement space to dance and sing directly to most members of the audience. Andrea Heimer provides backing vocals and plays backing tracks through an MP3 player housed inside a non-working electric guitar, known as \"The Soul System.\"\nMusical style\nThe band's music consists mostly of upbeat pop songs which are influenced by rock, soul, oldies, and punk. Mark Heimer often employs instruments such as the bass, guitar, drums, and keyboards when recording music. Lyrically, the band's songs cover a wide range of topics, and despite their upbeat sound frequently tend toward serious themes.  Over the course of their career, No-Fi Soul Rebellion's musical aesthetics and performance style have frequently prompted critics to compare them to Prince.[2]\nThe band ends almost every show with the song \"Return to Innocence\" by Enigma.\nDiscography\n*The Chocolate Demos (2001)\n*Like Pushing Rope Up A Hill ep (2002)\n*The Olden Days: Pure Gold (2002)\n*The Veritable Rainbow of Song (2003)\n*Ch*rch/Ladycop split 7-inch with The Volumen (2003)\n*Lambs to the Slaughter EP (2005)\n*Afterglow: N-FSR Live (2006)\n*Alaska Chic (2006)\n*Terrible Muscles (2007)\n*Oh Please Please Please (2009)\nReferences\n*No-Fi Soul Rebellion Bio. [http://www.nofisoulrebellion.com/bio.html]\n*Salvia, Vanessa (February 2004). \"Eugene Weekly: Music: 2.19.04.\" The Eugene Weekly. [http://www.eugeneweekly.com/archive/02_19_04/music.html]\n*Merz, Melanie (May 2009). \"No-Fi Soul Rebellion: Oh Please Please Please.\" What's Up Magazine.  [http://www.whatsup-magazine.com/index.php?navarea=Archives&storyid=1144]"
    }
  ]
}