{
  "content": [
    {
      "type": "text",
      "text": "# No Plan (owarai)__disambig_1\n\n}}\nTokyo\n| genre               = J-pop\n| years_active        = 2003–2006\n| label               = Ki/oon Records\n| associated_acts     =\n| current_members     = Teruyoshi UchimuraMasakazu MimuraKazuki ŌtakeGolgo MatsumotoRed YoshidaRyō Fukawa\n| past_members        =\n| website                 = [http://www.tv-asahi.co.jp/uchimura/contents/noplan/index.html Uchimura Produce]\n}}\nNO PLAN is a Japanese konto style comedy group, and is also occasionally known for their music. The group appeared regularly on the late night owarai show Uchimura Produce (内村プロデュース) until late 2005, when the show was cancelled. The group consists of 6 male members; Kazuki Ōtake and Masakazu Mimura of Summers, Red Yoshida and Golgo Matsumoto of TIM, Ryō Fukawa, and the leader of the group, Japanese comedian Teruyoshi Uchimura.\nHistory\nThe origin of the group's name traces back to one of their first television appearances on the popular music show, Music Station in 2003. Having arrived to sing a song, but not having prepared any lyrics, a fellow guest&mdash;Morning Musume's Mari Yaguchi&mdash;commented on-air, \"No plan, huh?\", and the name stuck. Their first album was then named We are NO PLAN.\nIn 2004, NO PLAN was selected to perform the title song to the new Crayon Shin-chan movie, and they also managed to land their first live appearance. Although they released another single, Oh! Summer, and a new album, SUMMER PLAN, in 2005, their main TV outlet Uchimura Produce was cancelled on September 26, 2005.\nNot long after the show was cancelled, NO PLAN released a third album, LAST PLAN, and though the members continue to appear as NO PLAN on many variety shows, and on the occasional Uchimura Produce special, the comedians generally appear alone or in their own kombi.\nDiscography\nAlbum\n*LAST PLAN (January 25, 2006)  Ki/oon Records KSCL-936/7\n#\"Konya ha NO PLAN!\" ~Konshu no FAX tēma Happyō (「今夜はNO PLAN!｣ ～今週のFAXテーマ発表, \"Tonight is NO PLAN!\" ~FAX theme announcement of to this week)\n#Kimi no Naka no Shōnen (君の中の少年, A heart like a boy in you) offered from Toshihide Baba\n#~Senshū no Kuizu no Kotae (～先週のクイズの答え, ~An answer of a quiz of to last week)\n#Red Yoshida no 5 moji de Kaiketsu Onayami Sōdan Sono 1 (～レッド吉田の5文字で解決お悩み相談 その1, ～Red Yoshida solves your trouble in 5 characters part 1)\n#~CM 1 NO PLAN fainansu (～CM 1「NO PLANファイナンス」,~First commercial \"NO PLAN finance\")\n#Uchimura-san ni Sasageru Barādo (内村さんに捧げるバラード, A ballad to give to Mr.Uchimura)\n#~Yarasii Uchimura-san (～やらしい内村さん, ~Disgusting Mr.Uchimura)\n#Daijōbu (大丈夫, It's all right) offered from Masatoshi Mashima, formerly known as a member of The High-Lows and The Blue Hearts\n#~FAX \"Kimi no naka no Shōnen\" Shokai (～FAX「君の中の少年」紹介, ~FAX \"A heart like a boy in you\" Introduction)\n#NO PLAN NONSTOP DJ Mix\n#Red Yoshida no 5 moji de Kaiketsu Onayami Sōdan Sono 2 (～レッド吉田の5文字で解決お悩み相談 その2, ~Red Yoshida solves your trouble in 5 characters part 2)\n#~CM 2 Last Album \"LAST PLAN\" (～CM 2 ラストアルバム「LAST PLAN」, ~Second commercial the last album \"LAST PLAN\")\n#~Menbā ni Sitsumon (～メンバーに質問, ~Questions from you to a member)\n#Arigatou! (ARIGATOU!, Thank you!)\n#~Happun Tanaka to Poruno Itō (～八分田中とポルノ伊東, ~Eight minutes Tanaka and Pornography Ito)\n#Sayonara NO PLAN (さよならNO PLAN, Good-bye NO PLAN)\n*SUMMER PLAN (August 3, 2005) Ki/oon Records KSCL-832\n#Harikiru Otoko (はりきる男, Vigorous Man)\n#Oh! Samaa (Oh! サマー, Oh! Summer) offered from Nobuteru Maeda (Tube)\n#We are NO PLAN 2 ~Sasayaka na Shiawase~ (We are NO PLAN 2 ～ささやかな幸せ～, Modest Happiness)\n#Tama Shoku-nin (玉職人, Ball-Craftsman)\n#Yome ni Konai ka Sumida-ku e (嫁に来ないか墨田区へ, Won't You Be My Wife? To Sumida Ward)\n#NO PLAN no Jinsei toiu Na no Ressha (NO PLANの人生という名の列車, The train called life by NO PLAN) offered from Toshihide Baba\n#Sono Go no Harikiru Otoko (その後のはりきる男, The Vigorous Man After)\n*NO PLAN (December 17, 2003) Ki/oon Records KSCL-637\n#We are NO PLAN Produced by Ken Yokoyama from Crazy Ken Band\n#Gaku-ya Ō (楽屋王, King of the Dressing Room)\n#Uchi-P \"Coco Japan\" Remix (内P \"COCO JAPAN\" Remix)\n#Sono toki, hontō wa... ichi (その時、本当は・・・。 1, Back then, the truth is... part1)\n#Wake no Wakaranai Spōtsu Jikkyō (訳の分からないスポーツ実況, Uncomprehensibe Athletic Condition)\n#Uchi-P Gun-dan no Teema (内P軍団のテーマ, Uchi-P's Troupe Theme)\n#Shutsugen! Sonzaikan no Nai Kaijū (出現! 存在感のない怪獣, It's here! The Unobtrusive Monster)\n#Ima, omou koto ichi (今、思うコト。 1, What I'm Thinking Now part1)\n#Zenryaku, Rotenburo no Ue Yori ~Geinin-damashii no Uta~ (前略、露天風呂の上より～芸人魂の詩～, Greetings from the Outdoor Bath: Song of the Entertainer's Spirit)\n#Ima, omou koto ni (今、思うコト。 2, What I'm Thinking Now part2)\n#Uchimura Jitaku Jikkyō Chūkei ~Chiisai Terebi wa Sonzai suru ka?!~ (内村自宅実況中継～小さいテレビは存在するか?!～, Check out the state of Uchimura's house: Does he have small TVs?!)\n#Comedians' Life ~one week~\n#Sono toki, hontō wa... ni (その時、本当は・・・。 2, Back then, the truth is... part2)\n#F1 Midorimachi Guranpuri (F1緑町グランプリ, F1 Midorimachi Grand Prix)\n#Hitori Botchi no Jinguru Beru (ひとりぼっちのジングルベル, A Loner's Jingle Bell)\n#Ima, omou koto san (今、思うコト。3, What I'm Thinking Now part3)\n#Sono toki, hontō wa... san (その時、本当は・・・。 3, Back then, the truth is... part3)\n#Nippon Zenkoku Uchi-age Ondo (日本全国打ち上げ音頭, A Working Song to Blast-Off All of Japan)\n#Uchimura Akiyoshi (内村秋好, Akiyoshi Uchimura)\n#Kokorozashi Nakaba (志なかば, Halfway Wish)  offered from Ryudo Uzaki\n#Suketto Yarō no Teema (助っ人野郎のテーマ, Helper Guy's Theme) (Bonus Track)\nSingle\n*Oh! Summer (June 15, 2005) Ki/oon Records KSCL-829/30\n#Oh! Samā (Oh! サマー, Oh! Summer)\n#Uchi-P No Catto Quiz II(内PノーカットクイズII, An Uchimura Produce Non-Cut Quiz for CD PartII)\n#Oh! Samā (original karaoke) (Oh!サマー(オリジナル・カラオケ), Oh! Summer (original karaoke))\n*Honmō de Gozaimasu ~Geinin-damashii no Uta PartII~ (April 14, 2004) Ki/oon Records KSCL-681 and KSCL-966\n#Honmō de Gozaimasu ~Geinin-damashii no Uta PartII~ (本望でございます ～芸人魂の詩 PartII～, We'll be Satisfied: Song of the Entertainer's Spirit PartII)\n#CD-ban Uchi-P No Catto Quiz(CD版内Pノーカットクイズ, An Uchimura Produce no cut quiz for CD)\n#◯(Maru) Ageyō (◯(マル)あげよう, I will give a standard mark) Ending theme of Crayon Shin-chan 2004 film \"The Kasukabe Boys of the Evening Sun\" (クレヨンしんちゃん 嵐を呼ぶ! 夕陽のカスカベボーイズ)\n#Honmō de Gozaimasu ~Geinin-damashii no Uta Part II~ (karaoke) (本望でございます ～芸人魂の詩 PartII ～(カラオケ), We'll be Satisfied: Song of the Entertainer's Spirit PartII (A karaoke))\n#◯(Maru) Ageyō (karaoke) (◯(マル)あげよう(カラオケ), I will give a standard mark (A karaoke))\nReferences\nExternal links\n*[http://www.tv-asahi.co.jp/uchimura/contents/noplan/index.html Official home page of NO PLAN and Uchimura Produce]\n*[http://www.sonymusic.co.jp/Music/Arch/KS/NOPLAN/ Sony Music profile]"
    }
  ]
}