{
  "content": [
    {
      "type": "text",
      "text": "# Noble Warriors\n\nThe Noble Warriors trilogy is a fantasy series, written by British novelist William Nicholson.  The first book, Seeker, was published in 2006, as was the second in the trilogy, Jango. The third book, Noman, was published in September 2007.\nBooks\nThere are three books in the Noble Warriors series.\n*Seeker (UK release 2006)\n*Jango (UK release 2006)\n*Noman (UK release 2007)\nThe Legend of the Noble Warriors\nA man named the Brother once resided on the island of Anacrea, and one night while he was sleeping, a lost child came to him, asking him for help. He let the Lost Child in, and later that night, in a dream, the Lost Child spoke to the Brother, proclaiming himself to be the 'All and Only', the 'Reason and the Goal.' Then the child changed form and became a woman, who called herself the Loving Mother. The figure changed form twice more, naming itself the Wounded Warrior and the Wise Father. The Wise Father spoke of an Assassin who would eventually kill him.\nFollowing the dream, the Brother built a garden for the Lost Child to live in, believing him to be the one true god. Others came to the island and they too pledged to protect the Lost Child.\nOne day, a powerful warlord named Noman came to the island. He forced his way into the garden to see the child. He stayed there for a day and a night and when he came out, he never spoke of what he saw. Soon after, he disbanded his army and formed a community to protect the god, which became known as the Nom, of which he was the leader. Noman learned the secret of true strength and he passed his knowledge to his brothers and sisters and they too became strong. Members of the Nom are called Nomana, or the Noble Warriors. The Noble Warriors do not use weapons or armour; they use only true strength, which is the life force in all beings called Lir\nThe vow of the noble warriors (which Noman wrote) says they cannot fight long wars or conquer land or empires. They cannot love any person above all others, build a lasting home, possess anything but can only use their powers to bring freedom to the enslaved and justice to the oppressed.\nIn Jango, it is mentioned that Noman lived on Anacrea over 200 years ago. Nothing has been said of his death but one of Seeker's teachers said that Noman left them to \"submit himself to his final test. He was never seen again\".\nMain characters\n*Seeker after Truth is the protagonist of the Noble Warriors Trilogy and he turns 16 at the beginning of Seeker. He discovers that he has power without limits which he uses to kill the Savanters. By the end of Noman, he has killed all of the Savanters and he also discovers that himself, Jango and Noman are all the same person, and that he is the Assassin, just as Noman was 200 years ago.\n*Morning Star has a gift which enables her to see other peoples auras or what they are feeling (their colours). She became Seeker's friend after they met on Anacrea after both being rejected by the Nom. They both go after the secret weapon in Radiance with Wildman, though she gets kidnapped on the way by tribute traders. She falls in love with Wildman during Jango, but at the start of Noman, she leaves the spiker army willingly. She joins the Joyous and tries to stop Seeker killing Manlir, the Joy Boy, but obviously fails. She also loses her colours temporarily in Noman but regains them when Seeker gives her some of his lir.\n*The Wildman is a famous spiker who wants to become a Noble Warrior after fighting, and losing to, some of them. He joins up with Seeker in destroying the secret weapon and he is accepted into the Nom. In Jango, he attempts to break into the garden but is stopped by his teacher. He then escapes from the Nom to prevent himself being cleansed. By the end of Jango, he is the head of the spiker army which he uses to fight the Jahan, who he defeats but he his unable to prevent the Nom being destroyed. In Noman, he joins the Joyous with most of his army. He tries to stop Seeker killing Manlir but dies in the process. He is later resurrected by Seeker who gives him his lir.\n*Jango seems at first to be a crazy old man. He lives with his wife in a house by the door in the wall which was built by Noman. He is very wise and in Jango, he gives Seeker cryptic advice on how to defeat the Savanters. He also has much lir, though not as much as Seeker, as he can knock Seeker down just with his mind. In Noman, it is revealed that Jango is actually Seeker grown older.\n*Noman was once a very powerful warlord who went to Anacrea 200 years ago, entered the Garden, founded the Noble Warriors and wrote their Rule. He first appears in Noman and reveals himself to Seeker through a mirror. He also gives Seeker advice and explains more about the experiment. It is later revealed that Noman was once the Assassin and that when went into the Garden 200 years ago, it was he who killed the All and Only in his quest for knowledge. Noman is also Seeker but grown much older.\n*Manlir is one of the Savanters. In Noman, he is leading his followers, the Joyous, to the Great Embrace which is when they believe that they will become gods but it is actually when Manlir will harvest their lives. When he is eventually defeated by Seeker, he goes back into his body and sails off with Noman, his brother.\nImportant establishments\nThe Savanters\nThere are seven Savanters. The Savanters are the enemies and seemingly the main antagonists of the noble warriors in the series as they seek to destroy the Nom. They have similar powers to the noble warriors and they are referred to 'as noble warriors gone bad'. By the end of Noman we know that they were lords of knowledge, and that their leader Manlir (or 'Manny'), was Noman's brother. Noman appointed the Savanters as the necessary evil to oppose the Nomana - faith is the natural enemy of knowledge. It is only by fighting knowledge that faith is kept alive, for when Noman entered the garden he knew that there was no God, so to keep the God alive he made sure everyone else' faith was kept alive. Noman told the Savanters to seek knowledge without limits. However, when the Savanters grew older and saw their deaths approaching, they grew angry at the thought that all their knowledge would die with them. They turned rogue and used their knowledge to pursue eternal youth.\nSoren Simlin is under their command, as is Filka, who used to be a goat boy. They correspond telepathically with their servants, and can reward them with euphoria, or punish them with terrible pain. They are \"preparing for the harvest\", in which they hope to take enough lir from other humans to become eternally young. They are very old and have sustained their lives up to now by feeding on the 'lir', or 'life force', of other humans. Seeker first hears about them from Narrow Path in the Nom.  Narrow Path tells him that is very important to kill all the Savanters, \"leave even one alive and it will all begin again\".\nSeeker kills 5 of the Savanters at the end of Jango. The Sixth to be killed is Manlir, who makes peace with Noman, as they both die. Lastly, a Savanter who used to be called Hope has possessed Echo Kittle, and Seeker persuades this one to let herself die, but only because Echo is destined to start a new generation of Savanters.\nRadiance\nThe City of Radiance is ruled by Radiant Leader, the priest-king. The Royal guard of the city of Radiance is made up of Axers, who are very large, powerful men. In Radiance they worship the Sun, and in order to make the Sun rise the next day, every evening a sacrifice must be made by throwing a person from the cliff. In Seeker, Morning Star is almost sacrificed, as is her mother, but fortunately they are saved by the Nomana, Seeker, and the Wildman. No sacrifice is made on that day, and although the Sun does come up on the next day, Radiant leader and all the other priests are blinded to this because they are true believers. Soren Simlin manipulates the situation, and has them all thrown off the cliff, claiming they have angered the Sun-God and it has only risen again to punish them. By the time Jango begins, Similin has become the new Radiant Leader. Every week or so, he does what he calls 'the Choosing'. His people believe that he has the power to look into their hearts and tell whether they are worthy of eternal life. In reality, he sends them to the Savanters who suck the lir out of them. When Amroth Jahan and his army invades Radiance, Similin persuades him into helping him destroy Anacrea. Their plan is a success but in the end, the Orlans are defeated and Similin meets an amusing end (he drinks some charged water in the belief it will make him all-powerful, it doesn't and when he is forced to relieve himself he explodes). In Noman, the city of Radiance has collapsed: overrun by thieves and bandits. Most of the wealthy citizens have fled from the city. Near the end of Noman, the spiker army and the Orlan army, under Caressa Jahan, take over Radiance and restore order.\nThe Orlans\nThe Orlans are first introduced in the second book Jango. They are a large army (ten thousand men and horses) and their leader is the great Amroth Jahan who is 'mesmerisingly ugly'. He has three sons, Sasha, Alva and Sabin who seem to be just as ugly as he is. The army is divided up into companies each with its own leader. The soldiers of the army are skillful with their whips, which they use as weapons, and horses (which caused much consternation as they were the first horses to be seen in the area). Their goal is to conquer the world and when the noble warriors defy and shame the Jahan, they vow revenge. The Orlans join up with the new leader of Radiance, Soren Similin, and plot to destroy Anacrea. The Jahan and his army would first attack the noble warriors and distract them from the bomb of charged water which Similin would send down a ramp and over the channel to blow up Anacrea. The plan works but Seeker, who arrives just after the bomb is launched, breaks the Jahan's pride but causing him to kneel to and kiss Echo Kittle's hand. The army is dispersed at the end of the second book and many warriors resort to banditry. The Jahan is last seen drinking in an inn with bandits as company.\nIn Noman, the Orlans reform under their new leader-Caressa, the Wildman's childhood friend. They are now 10 times smaller than at the beginning of Jango. Caressa first wants to attack the spiker army and get her revenge on Wildman for leaving her in Spikertown. But by now the spiker army has disbanded and are part of the Joyous, though Caressa does not yet realise this. When she attacks the Joyous, she is stopped by the Joyous singing a lullaby. She and the Orlans also join the Joyous. At the end of the book, she hands over the silver whip of the Jahan to the only surviving son of Amroth, Sabin Jahan.\nReferences\nExternal links\n* [https://web.archive.org/web/20081120022536/http://www.williamnicholson.co.uk/ William Nicholson's homepage]"
    }
  ]
}