{
  "content": [
    {
      "type": "text",
      "text": "# Noosa North Shore, Queensland\n\n| pop                 = 253\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4565\n| area                = 140.1\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 6.7\n| dir1                = SW\n| location1           = Tewantin (via ferry)\n| dist2               = 14.7\n| dir2                = SE\n| location2           = Sunshine Beach (via ferry)\n| dist3               = 149\n| dir3                = N\n| location3           = Brisbane (via ferry)\n| dist4               =\n| dir4                =\n| location4           =\n| lga                 = Shire of Noosa\n| stategov            = Noosa\n| fedgov              = Wide Bay\n| near-n              = Cooloola\n| near-ne             = Coral Sea\n| near-e              = Coral Sea\n| near-se             = Noosa Heads\n| near-s              = Noosaville\n| near-sw             = CooroibahTewantin\n| near-w              = Boreen PointCootharabaRingtail Creek\n| near-nw             =  Como\n}}\nNoosa North Shore is a coastal rural locality in the Shire of Noosa, Queensland, Australia. In the , Noosa North Shore had a population of 253 people.\nGeography\nThe locality is bounded to the east by the Coral Sea and to the south and west by the Noosa River and Lake Cootharaba (a lake on the Noosa River). The locality's name refers to its position on the northern bank of the river.\nThe locality contains many sections of the Great Sandy National Park and the small town of Teewah.\nAccess to the locality is provided by the cable ferry, Noosa River Ferry, which crosses the Noosa River at Tewantin. In order to maintain Noosa North Shore as a wilderness area, there are no plans to provide road or bridge access and there are restrictions on development.\nHistory\nAlthough historically and currently within the Shire of Noosa, between 2008 and 2013 Noosa North Shore was within Sunshine Coast Region following an unpopular amalgamation of the shire into a larger local government area, followed by a subsequent disamalgamation after continual local agitation confirmed by a ballot.\nDemographics\nIn the , Noosa North Shore had a population of 121 people.\nIn the , Noosa North Shore had a population of 179 people.\nIn the , Noosa North Shore had a population of 253 people.\nEducation\nThere are no schools in Noosa North Shore. The nearest government primary schools are Tewantin State School in neighbouring Tewantin to the south-west and Kin Kin State School in Kin Kin to the west. The nearest government secondary schools are Sunshine Beach State High School in Sunshine Beach to the south-east and Noosa District State High School, which has its junior campus in Pomona to the west and its senior campus in Cooroy to the south-west.\nAttractions\nThe locality is the southern end point of the Cooloola Great Walk.\nReferences\nExternal links"
    }
  ]
}