{
  "content": [
    {
      "type": "text",
      "text": "# Noriko Ogiwara\n\n| birth_place  = Japan\n| occupation   = novelist, manga writer\n| period       = 1987 - present\n| genre        = romance, fantasy, Juvenile\n| movement     =\n| notableworks = The Jade Trilogy\n| website      =\n}}\n(born April 22nd, 1959) is a Japanese fantasy writer.\nBiography\nNoriko Ogiwara was born in 1959. Having read C. S. Lewis' Chronicles of Narnia at a very early age, she decided to become a fantasy writer.\nHer first book,  won her several awards for children's literature and was translated into English by Cathy Hirano as Dragon Sword and Wind Child; the English version was out-of-print until it was re-released by Viz Media in October 2007.  The two sequels,  and , have only been published in Japanese.  The re-issuing of Dragon Sword and Wind Child encouraged Viz to publish the next novel in the sequence, Hakuchou Iden, as Mirror Sword and Shadow Prince in May 2011, also translated by Cathy Hirano.  These three books together are called The Jade Trilogy.\nAnother of her works is Nishi no Yoki Majo (西の善き魔女 \"Good Witch of the West Astraea Testament\"), a western-styled high fantasy series featuring a girl on the quest of finding out the mysteries surrounding the legends of her country and her friends.  The series consists of eight books, including three side stories also penned by her.  Nishi no Yoki Majo has been adapted into a manga series by Haruhiko Momokawa in Comic Blade, and licensed for English publication as The Good Witch of the West. The Good Witch of the West was also animated and aired in Japan in 2006.\nHer fantasy novel series  was first published in 2008. It consists of six books, and was adapted into an anime television series.\nReferences\nExternal links\n* [https://web.archive.org/web/20070527055822/http://www.zephy.net/mansion/?p=137 Noriko Ogiwara Information #1]\n* [https://web.archive.org/web/20070823215707/http://www13.ocn.ne.jp/~m-room/ogiwara.html Collection of Noriko Ogiwara's work]\n*\n*\n* [https://archive.today/20130928071658/http://www.booksfromjapan.jp/authors/item/71-noriko-ogiwara J'Lit | Authors : Noriko Ogiwara | Books from Japan]"
    }
  ]
}