{
  "content": [
    {
      "type": "text",
      "text": "# Norman Fucking Rockwell!\n\nNFR|the title track|Norman Fucking Rockwell (song)}}\n| studio      =\n* Conway (Los Angeles)\n* Westlake (Los Angeles)\n* Henson (Los Angeles)\n* Gold Tooth (Los Angeles)\n* Valentine (Los Angeles)\n* Sunset Banana Split (Los Angeles)\n* House of Breaking Glass (Seattle)\n* Electric Lady (New York City)\n* Sarm (London)\n* Hampstead (London)\n* Rough Customer (Brooklyn)\n| recorded    = 2017–2019\n| genre       =\n* Soft rock\n* pop\n* folk rock\n* psychedelia\n| length      = 67:43\n| label       =\n* Interscope\n* Polydor\n| producer    =\n* Lana Del Rey\n* Andrew Watt\n* Dean Reid\n* Happy Perez\n* Jack Antonoff\n* Kieron Menzies\n* Louis Bell\n* Rick Nowels\n* Zachary Dawes\n| prev_title  = Lust for Life\n| prev_year   = 2017\n| year        = 2019\n| next_title  = Violet Bent Backwards Over the Grass\n| next_year   = 2020\n| misc        =\n}}\nNorman Fucking Rockwell! (abbreviated to NFR! in some releases) is the sixth studio album by American singer-songwriter Lana Del Rey, released on August 30, 2019, by Interscope and Polydor Records. The album was primarily produced by Del Rey and Jack Antonoff, with additional contributions from Zach Dawes, Andrew Watt, and longtime Del Rey collaborator Rick Nowels. Musically, Norman Fucking Rockwell! explored a soft rock sound featuring psych-rock elements, piano ballads, and references to various classic rock artists. The title of the album is a reference to painter and illustrator Norman Rockwell.\nFive singles were released to promote the album: \"Mariners Apartment Complex\", \"Venice Bitch\", \"Hope Is a Dangerous Thing for a Woman Like Me to Have – but I Have It\", \"Doin' Time\", and \"The Greatest\". Del Rey embarked on her fifth concert tour, The Norman Fucking Rockwell! Tour, to promote them. It commenced on September 21, 2019, and concluded on November 30, 2019.\nNorman Fucking Rockwell! received widespread acclaim. Music critics praised the album's poetic and refined lyricism, production and Del Rey's musical progression. The album reached number one in seven countries, including the United Kingdom, becoming Del Rey's fourth number one album in the region. In the United States, Norman Fucking Rockwell! peaked at number three, marking Del Rey's fifth consecutive top five album in the country. It was nominated for Album of the Year at the 62nd Annual Grammy Awards. Norman Fucking Rockwell! was frequently listed by numerous publications as the best album of the year, and since its release has been regarded as one of the greatest and most revered albums of the decade and of all time, with Rolling Stone ranking it on their list of \"The 500 Greatest Albums of All Time\".\nBackground\nWhen in attendance at the 60th Annual Grammy Awards, Lana Del Rey confirmed in an interview that she had begun work on her next album. She revealed the title of one song, \"Bartender\", saying that she did not know if it would make the album's tracklist. The album was recorded under the working title Bird World in its earlier stages of development. In September 2018, Del Rey premiered the album's second single, \"Venice Bitch\", in Zane Lowe's Beats 1 show, and joined for an interview where she confirmed that the album's title and its title track would be Norman Fucking Rockwell!. She revealed that the album was nearly complete having recorded eleven tracks for it. It was later reported that the album was scheduled for an early 2019 release. In October 2018, Del Rey performed alongside Jack Antonoff, with whom she had collaborated on the record, at an Apple Music event, where she premiered the song \"How to Disappear\". On December 31, 2018, Del Rey teased the song \"Happiness Is a Butterfly\" on social media. A snippet of the album's title track was shared by Del Rey in June 2019. In July 2019, Del Rey performed at the FIB Benicàssim Festival, where she revealed that the album would be released the following month.\nComposition\nFlood Magazine described the album's sound as \"a mellow soft rock\" and noted Del Rey's improved lyrics tackle larger themes than her previous work. According to critics, Norman Fucking Rockwell! features \"psych-rock jams\" and piano-based ballads. Consequence described the record as featuring \"psych-pop lullabies, tales of complicated, consuming romantic love, and overt odes to the tarnished dream of California.\" It has been characterised as a \"pop classic\", as well as embodying folk rock, and existing somewhere between the desert rock and \"minimalist\" trip hop of Del Rey's previous efforts.\nThe album features a strong influence from 1970s classic rock. Kitty Empire of The Observer noted that \"strings and synth washes soundtrack multiple love songs\", and also noted several classic rock references throughout the album, including Neil Young's \"Cinnamon Girl\", Crosby, Stills, Nash & Young, and Led Zeppelin's Houses of the Holy. Rob Sheffield of Rolling Stone noted the album's \"Laurel Canyon '70s soft-rock fantasies\", including references to Joni Mitchell and the Eagles.\nNo Ripcord described Norman Fucking Rockwell! as \"a remarkably sharp pop record that retains her fascination with pop-culture iconography and the rosey simplicity of a post-war America where classic rock and blue jeans ruled and takes them to much deeper places\".\nRelease and promotion\nThe album's cover art, release date, and track listing were announced by Del Rey on July 31, 2019. The cover art features Del Rey and Duke Nicholson—actor Jack Nicholson's grandson—posing on a sailboat, with the album title and Del Rey's initials written in a comic-inspired style. The photo was taken by Del Rey's sister Chuck Grant. The following day, Del Rey released an album trailer. On August 2, Urban Outfitters announced an exclusive vinyl of the album featuring an alternative album artwork, also photographed by Chuck Grant.\nThroughout 2018, Del Rey shared snippets via social media of several songs intended for the album, including \"Happiness Is a Butterfly\", \"How to Disappear\", and \"Cinnamon Girl\". She performed \"How to Disappear\" on October 29 at the Brooklyn Academy of Music, debuting the full song for the first time.\nSingles\n\"Mariners Apartment Complex\" was released as the album's first single on September 12, 2018. The following week, on September 18, Del Rey released the second single, \"Venice Bitch\" and revealed the album title. \"Hope Is a Dangerous Thing for a Woman Like Me to Have – but I Have It\" followed as the third single on January 9, 2019.\nDel Rey released a cover of Sublime's \"Doin' Time\" on May 17, 2019, for a documentary about the band; its music video was released on August 29, 2019, one day before the release of Norman Fucking Rockwell! A double music video for \"Fuck It I Love You\" and \"The Greatest\" was released on August 22, 2019; \"The Greatest\" was later released as the album's fifth single on September 13, 2019, in Italy.\nTour\nOn August 1, 2019, Del Rey announced two legs of a tour in promotion of Norman Fucking Rockwell!. The first leg took place in North America in the fall of 2019 and the second in Europe in early 2020. The European leg of the tour was subsequently cancelled due to illness.\nFilm\nNorman Fucking Rockwell (film)}}\nOn December 20, 2019, Del Rey released a 14-minute-long short film featuring the songs \"Norman Fucking Rockwell\", \"Bartender\", and \"Happiness Is a Butterfly\". The film was directed by Chuck Grant and premiered on YouTube.\nCritical reception\n| MC         = 87/100\n| rev1       = AllMusic\n| rev1score  =\n| rev2       = The A.V. Club\n| rev2score  = B\n| rev3       = Consequence\n| rev3score  = A−\n| rev4       = Entertainment Weekly\n| rev4score  = B\n| rev5       = The Guardian\n| rev5score  =\n| rev6       = The Independent\n| rev6score  =\n| rev7       = NME\n| rev7score  =\n| rev8       = Pitchfork\n| rev8score  = 9.4/10\n| rev9       = Rolling Stone\n| rev9score  =\n| rev10      = Uncut\n| rev10score = 8/10\n}}\nNorman Fucking Rockwell! was met with widespread critical acclaim. At Metacritic, which assigns a rating out of 100 to reviews from professional publications, the album received a weighted average score of 87, based on 28 reviews, indicating \"universal acclaim\". Aggregator AnyDecentMusic? gave it 8.5 out of 10, based on their assessment of the critical consensus.\nJenn Pelly of Pitchfork wrote that the album \"establishes [Del Rey] as one of America’s greatest living songwriters\". In his review for Rolling Stone, Rob Sheffield wrote \"the long-awaited Norman Fucking Rockwell is even more massive and majestic than everyone hoped it would be. Lana turns her fifth and finest album into a tour of sordid American dreams, going deep cover in all our nation's most twisted fantasies of glamour and danger.\" He concluded that Del Rey \"has finally made her pop classic.\" In a five-star review for NME, Rhian Daly called the album \"nothing short of stunning.\" Kristel Jax of Now wrote \"Del Rey has shifted her kitschy patriotic fixation, dropping her flag-draped persona and making peace with a more complex, dystopian reality\", also giving the album five stars. For Slant Magazine, Sal Cinquemani described the album as \"a heady collection of psych-rock and piano dirges that pour into each other and rarely shift tempo from track to track\" as well as \"frank assessments of the psychic effects of a world spiraling into chaos.\" Also writing positively, Alexandra Pollard of The Independent wrote \"The album is sultry and soporific, sitting somewhere between the minimalist trip hop of Del Rey’s early days, and the scuzzy desert rock she has toyed with over the years,\" and concluded that \"This is Del Rey at her most assertive.\" In his 'premature evaluation' for Stereogum, Tom Breihan wrote that the album is \"a beautiful opus for a new dark age — a fond look back at the world we just wrecked\", calling it \"yoga music for the apocalypse.\" Entertainment Weekly critic Maura Johnston said, \"Del Rey digs deep into the atmospherics; her perpetually wounded drawl hovers above swooning strings and swirling synths, which rise up in extended codas and on power-ballad-worthy guitar solos\".\nIn a more mixed review, Alexis Petridis of The Guardian described the album as \"an alternately beguiling and frustrating experience\", concluding that despite Del Rey's evident talent, \"it's hard not to wish that she would broaden her perspective, adopt a different persona, shake things up a little.\" Channing Freeman of Sputnikmusic said, \"This is her best album yet, and great moments abound amidst the fat\". Neil McCormick of The Daily Telegraph similarly wrote that the album \"reveals Del Rey to be something of a one trick pony, but what a beautiful trick it is.\"\nRankings\nThe album was placed in numerous year-end lists of 2019, topping those by many publications. According to Metacritic, it was the most named album in the year-end rankings of 2019 albums by critics. In 2021, Pitchfork readers voted Norman Fucking Rockwell! the 17th greatest album overall, and the best album by a female artist, of the previous 25 years.\n{| class=\"wikitable sortable plainrowheaders\" style=\"border:none; margin:0;\"\n|+Select rankings of Norman Fucking Rockwell!\n! scope=\"col\"| Publication\n! scope=\"col\" class=\"unsortable\"| List\n! scope=\"col\" data-sort-type=\"number\"| Year\n! scope=\"col\" data-sort-type=\"number\"| Rank\n! scope=\"col\" class=\"unsortable\"|\n|-\n! scope=\"row\"| Billboard\n| The 50 Best Albums of 2019: Staff Picks\n| 2019\n|\n| }}\n|-\n! scope=\"row\"| Entertainment Weekly\n| The Best Albums of 2019\n| 2019\n|\n| }}\n|-\n! scope=\"row\"|\n| The 50 Best Albums of 2019\n| 2019\n|\n| }}\n|-\n! scope=\"row\" rowspan=\"2\"| NME\n| The 50 Best Albums of 2019\n| 2019\n|\n| }}\n|-\n| The Best Albums of the Decade: The 2010s\n| 2019\n|\n| }}\n|-\n! scope=\"row\" rowspan=\"2\"|\n| Jon Caramanica's Best Albums of 2019\n| 2019\n|\n| }}\n|-\n| Jon Pareles' Best Albums of 2019\n| 2019\n|\n|\n|-\n! scope=\"row\" rowspan=\"3\"| Paste\n| The 50 Best Albums of 2019\n| 2019\n|\n| }}\n|-\n| The 30 Best Pop Albums of the 2010s\n| 2019\n|\n| }}\n|-\n| The 300 Greatest Albums of All Time\n| 2024\n|\n| }}\n|-\n! scope=\"row\" rowspan=\"2\"| Pitchfork\n| The 50 Best Albums of 2019\n| 2019\n|\n| }}\n|-\n| The 200 Best Albums of the 2010s\n| 2019\n|\n| }}\n|-\n! scope=\"row\" rowspan=\"4\"| Rolling Stone\n| The 50 Best Albums of 2019\n| 2019\n|\n| }}\n|-\n| The 100 Best Albums of the 2010s\n| 2019\n|\n| }}\n|-\n| The 500 Greatest Albums of All Time\n| 2020\n|\n| }}\n|-\n| The 250 Greatest Albums of the 21st Century So Far\n| 2025\n|\n| }}\n|-\n! scope=\"row\" rowspan=\"2\"| Slant Magazine\n| The 25 Best Albums of 2019\n| 2019\n|\n| }}\n|-\n| The 100 Best Albums of the 2010s\n| 2019\n|\n| }}\n|-\n! scope=\"row\"| Time\n| The 10 Best Albums of 2019\n| 2019\n|\n| }}\n|}\nIndustry awards\n{| class=\"wikitable sortable plainrowheaders\" style=\"border:none; margin:0;\"\n|+Awards and nominations for Norman Fucking Rockwell!\n! scope=\"col\"| Year\n! scope=\"col\"| Ceremony\n! scope=\"col\"| Category\n! scope=\"col\"| Result\n! scope=\"col\" class=\"unsortable\"|\n|-\n! scope=\"row\"| 2019\n| Q Awards\n| Best Album\n|\n| }}\n|-\n! scope=\"row\" rowspan=\"2\"| 2020\n| Grammy Awards\n| Album of the Year\n|\n| }}\n|-\n| NME Awards\n| Best Album in the World\n|\n| }}\n|}\nCommercial performance\nNorman Fucking Rockwell! debuted at number three on the US Billboard 200 chart, earning 104,000 album-equivalent units (including 66,000 copies in pure album sales) in its first week, becoming Del Rey's sixth US top ten album on the chart. In its second week, the album dropped to number nine, earning an additional 35,000 units.\nIn the United Kingdom, Norman Fucking Rockwell! debuted at number one on the UK Albums Chart, selling 31,000 copies, becoming her best sales week in the country since Ultraviolence (her following album, Chemtrails over the Country Club, would open up with higher weekly sales than Norman Fucking Rockwell!). The album became Lana Del Rey's fourth number one album in the UK, tying Taylor Swift as the female artist with the most solo number one albums in the UK during the 2010s. In France, the album sold 8,000 copies in its first week, 800 more than Lust for Lifes first week.\nTrack listing\n| extra1  =\n| length1 = 4:08\n| title2  = Mariners Apartment Complex\n| writer2 =\n| extra2  =\n| length2 = 4:06\n| title3  = Venice Bitch\n| writer3 =\n| extra3  =\n| length3 = 9:38\n| title4  = Fuck It I Love You\n| writer4 = |Louis Bell}}\n| extra4  = |Antonoff|Watt|Bell}}\n| length4 = 3:38\n| title5  = Doin' Time\n| writer5 =\n| extra5  =\n| length5 = 3:22\n| title6  = Love Song\n| writer6 =\n| extra6  =\n| length6 = 3:49\n| title7  = Cinnamon Girl\n| writer7 =\n| extra7  =\n| length7 = 5:00\n| title8  = How to Disappear\n| writer8 =\n| extra8  =\n| length8 = 3:48\n| title9  = California\n| writer9 =\n| extra9  = |Dawes}}\n| length9 = 5:05\n| title10  = The Next Best American Record\n| writer10 =\n| extra10  = }}\n| length10 = 5:49\n| title11  = The Greatest\n| writer11 =\n| extra11  =\n| length11 = 5:00\n| title12  = Bartender\n| writer12 =\n| extra12  = |Nowels}}\n| length12 = 4:23\n| title13  = Happiness Is a Butterfly\n| writer13 =\n| extra13  = }}\n| length13 = 4:32\n| title14  = Hope Is a Dangerous Thing for a Woman Like Me to Have – but I Have It\n| writer14 =\n| extra14  =\n| length14 = 5:24\n}}\nNotes\n* }} signifies someone solely credited on physical releases\n* }} signifies someone solely credited on digital releases\n* }} signifies an additional producer\n* }} physical releases of the album include an outro on \"Hope Is a Dangerous Thing for a Woman Like Me to Have – but I Have It\", making the length 5:58.\nCredits and personnel\nCredits adapted from official liner notes.\nTechnical\n* Laura Sisk – recording engineering (1–4, 6–9, 11, 13, 14), mixing (1–4, 6–9, 11, 13, 14)\n* Jack Antonoff – recording engineering (1–4, 6–9, 11, 13, 14), mixing (1–4, 6–9, 11, 13, 14)\n* Paul LaMalfa – recording engineering (5), mixing (5)\n* John Congleton – recording engineering (9)\n* Dean Reid – recording engineering (9, 10), mixing (10, 12)\n* Kieron Menzies – recording engineering (9, 10, 12), mixing (10, 12)\n* Trevor Yasuda – recording engineering (10, 12)\n* Jon Sher – assistant recording engineering (1–4, 6–9, 11, 13)\n* Derrick Stockwell – assistant recording engineering (3)\n* Greg Eliason – assistant recording engineering (3)\n* Ben Fletcher – assistant recording engineering (4)\n* Billy Cumella – assistant recording engineering (4)\n* John Rooney – assistant recording engineering (4)\n* Tate McDowell – assistant recording engineering (8, 11)\n* John Rooney – assistant recording engineering (9)\n* Nicolas Jodoin – assistant recording engineering (9)\n* Travis Pavur – assistant recording engineering (9)\n* John Christopher Fee – assistant recording engineering (10)\n* Chris Rockwell – assistant recording engineering (10)\n* Ryan Hendrickson - assistant recording engineering (1, 6, 11)\n* Şerban Ghenea – mixing (2)\n* John Hanes – mix engineering (2)\n* Andrew Watt – mixing (5)\n* Chris Gehringer – mastering (1–4, 6–14)\n* Will Quinnell – assistant mastering engineering (1–4, 6–9, 11, 13, 14)\n* Dave Kutch – mastering (5)\nMusicians\n* Lana Del Rey – vocals, horns (9)\n* Jack Antonoff – keyboards (1–4, 6–8, 11, 13), piano (1–4, 6–8, 11, 13, 14), drums (2–4, 8, 11), programming (2–4, 6–8, 11, 13), acoustic guitar (2–4, 8, 11), electric guitar (2–4, 6–8, 11, 13), synthesizers (3), percussion (8), vibraphone (8)\n* Evan Smith – saxophone (1, 11), flute (11)\n* Phillip Peterson – baritone (1), cello (1, 6, 11), flugelhorn (1)\n* Victoria Parker – violin (1, 6, 11)\n* Laura Sisk – additional programming (2)\n* Josh Klinghoffer - guitar (4)\n* Chad Smith - drums (4)\n* Mikey Freedom Hart – keyboards (4), Mellotron (9), piano (9), drums (10), programming (10)\n* Andrew Watt – instrumentation (5), programming (5), guitar (5)\n* Eric Wilson – bass guitar (5)\n* Josh Freese – drums (5)\n* Bud Gaugh – drums (5)\n* Gayle Levant – harp (5)\n* Woozy Biff – harp (9)\n* Zachary Dawes – piano (9)\n* Loren Humphrey – drums (9)\n* Darren Weiss – drums (9)\n* Mike Riddleberger – drums (9)\n* Sean Hutchinson – drums (9)\n* Evan Weiss – guitar (9)\n* Benji Lysaght – guitar (9)\n* Tyler Parkford – Hammond B3 (9)\n* Dean Reid – bass guitar (9), keyboards (10), guitar (10), FX (10), programming (10)\n* Kieron Menzies – Mellotron (9), drums (10), FX (10), programming (10)\n* Rick Nowels – keyboards (10), acoustic guitar (10), piano (12)\n* Grace Wang – keyboards (1)\n* Zac Rae – keyboards (10)\n* David Levita – guitar (10)\nCharts\nWeekly charts\n{| class=\"wikitable sortable plainrowheaders\" style=\"text-align:center\"\n|+2019 chart performance for Norman Fucking Rockwell!\n! scope=\"col\"| Chart (2019)\n! scope=\"col\"| Peakposition\n|-\n! scope=\"row\"| Argentine Albums (CAPIF)\n| 1\n|-\n|-\n|-\n|-\n|-\n|-\n|-\n|-\n|-\n! scope=\"row\"| Estonian Albums (Eesti Ekspress)\n| 1\n|-\n|-\n|-\n|-\n|-\n|-\n|-\n|-\n|-\n! scope=\"row\"| Latvian Albums (LAIPA)\n| 8\n|-\n! scope=\"row\"| Lithuanian Albums (AGATA)\n| 1\n|-\n! scope=\"row\"| Mexican Albums (AMPROFON)\n| 3\n|-\n|-\n|-\n|-\n|-\n|-\n! scope=\"row\"| Slovak Albums (ČNS IFPI)\n| 3\n|-\n! scope=\"row\"| South Korean Albums (Gaon)\n| 83\n|-\n|-\n|-\n|-\n|-\n! scope=\"row\"| US Billboard 200\n| 3\n|-\n|}\n{| class=\"wikitable sortable plainrowheaders\" style=\"text-align:center\"\n|+2023 chart performance for Norman Fucking Rockwell!\n! scope=\"col\"| Chart (2023)\n! scope=\"col\"| Peakposition\n|-\n! scope=\"row\"| Croatian International Albums (HDU)\n| 12\n|-\n! scope=\"row\"| US Top Rock & Alternative Albums (Billboard)\n| 50\n|}\nYear-end charts\n{| class=\"wikitable sortable plainrowheaders\" style=\"text-align:center\"\n|+2019 year-end chart performance for Norman Fucking Rockwell!\n! scope=\"col\"| Chart (2019)\n! scope=\"col\"| Position\n|-\n! scope=\"row\"| Belgian Albums (Ultratop Flanders)\n| 48\n|-\n! scope=\"row\"| Belgian Albums (Ultratop Wallonia)\n| 112\n|-\n! scope=\"row\"| Dutch Albums (Album Top 100)\n| 57\n|-\n! scope=\"row\"| French Albums (SNEP)\n| 126\n|-\n! scope=\"row\"| Mexican Albums (AMPROFON)\n| 37\n|-\n! scope=\"row\"| Swiss Albums (Schweizer Hitparade)\n| 64\n|-\n! scope=\"row\"| UK Albums (OCC)\n| 70\n|-\n! scope=\"row\"| US Billboard 200\n| 182\n|-\n! scope=\"row\"| US Alternative Albums (Billboard)\n| 16\n|}\n{| class=\"wikitable sortable plainrowheaders\" style=\"text-align:center\"\n|+2020 year-end chart performance for Norman Fucking Rockwell!\n! scope=\"col\"| Chart (2020)\n! scope=\"col\"| Position\n|-\n! scope=\"row\"| Belgian Albums (Ultratop Flanders)\n| 54\n|-\n! scope=\"row\"| Belgian Albums (Ultratop Wallonia)\n| 168\n|-\n! scope=\"row\"| US Top Alternative Albums (Billboard)\n| 22\n|-\n! scope=\"row\"| US Top Current Albums (Billboard)\n| 76\n|}\n{| class=\"wikitable plainrowheaders\" style=\"text-align:center\"\n|+2021 year-end chart performance for Norman Fucking Rockwell!\n! scope=\"col\"| Chart (2021)\n! scope=\"col\"| Position\n|-\n! scope=\"row\"| Belgian Albums (Ultratop Flanders)\n| 112\n|}\n{| class=\"wikitable sortable plainrowheaders\" style=\"text-align:center\"\n|+2022 year-end chart performance for Norman Fucking Rockwell!\n! scope=\"col\"| Chart (2022)\n! scope=\"col\"| Position\n|-\n! scope=\"row\"| Belgian Albums (Ultratop Flanders)\n| 101\n|-\n! scope=\"row\"| Lithuanian Albums (AGATA)\n| 77\n|}\n{| class=\"wikitable sortable plainrowheaders\" style=\"text-align:center\"\n|+2023 year-end chart performance for Norman Fucking Rockwell!\n! scope=\"col\"| Chart (2023)\n! scope=\"col\"| Position\n|-\n! scope=\"row\"| Belgian Albums (Ultratop Flanders)\n| 69\n|-\n! scope=\"row\"| Belgian Albums (Ultratop Wallonia)\n| 200\n|}\n{| class=\"wikitable plainrowheaders\" style=\"text-align:center\"\n|+2024 year-end chart performance for Norman Fucking Rockwell!\n! scope=\"col\"| Chart (2024)\n! scope=\"col\"| Position\n|-\n! scope=\"row\"| Belgian Albums (Ultratop Flanders)\n| 120\n|}\nCertifications and sales\n}}\nSee also\n* List of 2019 albums\n* List of number-one albums of 2019 (Portugal)\n* List of number-one albums of 2019 (Scotland)\n* List of UK Albums Chart number ones of the 2010s\nReferences\nExternal links\n*"
    }
  ]
}