{
  "content": [
    {
      "type": "text",
      "text": "# Norman invasion of Wales__disambig_1\n\nThe Norman invasion of Wales began shortly after the Norman conquest of England under William the Conqueror, who believed England to be his birthright. Initially (1067–1081), the invasion of Wales was not undertaken with the fervour and purpose of the invasion of England. However, a much stronger Norman invasion began in 1081 and by 1094 most of Wales was under the control of William's son and heir, the later King William II. The Welsh greatly disliked the \"gratuitously cruel\" Normans, and by 1101, had regained control of the greater part of their country under the long reign of King Gruffudd ap Cynan, who had been imprisoned by the Normans for twelve years before his escape.\nIn one incident, Gruffudd had some indirect help from King Magnus III of Norway (Magnus Barefoot) who attacked the Normans briefly off the Isle of Anglesey in northwest Wales near Ynys Seiriol, killing Hugh of Montgomery, 2nd Earl of Shrewsbury.\nUnder William's fourth son, King Henry I, the Normans, now well established in England, responded by pushing west into Wales. This time, both the Welsh and the Normans were more interested in making peace than fighting bloody battles, and a relatively stable situation developed, although the Normans fared worse in southeast Wales than in the west of the country. The standoff continued from 1135 to 1154 under Stephen, nephew of Henry and a maternal grandson of William, who became locked in a power struggle and civil war with Empress Matilda, Henry's daughter and only surviving legitimate child.\nBy the 1150s, Matilda's son King Henry II of England had set upon fighting back, leading his first expedition into Wales in 1157. He met defeat, particularly in the Battle of Ewloe at Coleshill / Coed Eulo, where Henry was almost killed in the fighting, but managed to return to friendly lines. He moved against his Adversaries again in 1163, and gained homage from the two most powerful princes of Wales, Rhys ap Gruffydd and Owain Gwynedd, along with the king of Scotland.\nThe Norman invasion of Wales, initiated following the conquest of England, was not a unified campaign but a piecemeal process led by individual Marcher Lords. These barons, such as William FitzOsbern and Hugh d'Avranches, were granted extensive liberties and quasi-royal authority by William the Conqueror to subdue the Welsh territories, effectively creating a buffer zone known as the Welsh Marches.\nWelsh attacks in England\nBy the mid-11th century, Wales had been united by the King of Gwynedd, Gruffudd ap Llywelyn. Gruffudd pushed into Saxon England, burning the city of Hereford, overwhelming border patrols, and proving the English defences there entirely inadequate to respond to Welsh invasions. During this time, Harold Godwinson led a campaign of retaliatory raids into Wales as Earl of Wessex. In the wake of this campaign, Gruffudd was turned upon by his own men, who killed him in 1063 and shipped his head off to Edward the Confessor in exchange for the redivision of Wales into its traditional kingdoms.   This left a vacuum of power in Wales in which princes and kings were free to squabble over their lands, without the unifying presence of Gruffudd to ward off Norman attacks.\nEarly battles\nIt took some time for the Normans to concentrate any level of might against the Welsh, as they were more concerned, in the aftermath of Hastings, with England and Normandy. In addition, it was not William's goal to conquer Wales; he had come to inherit what he believed to be his birthright, the English throne, which entailed taking on the responsibilities of Edward and the Anglo-Saxon kings, including their relationships with Wales and Scotland. However, Wales had begun to force the matter, supporting English rebellions against the Normans.\nWilliam's response\nIn response to Welsh advances, William established a series of earldoms in the borderlands, specifically at Chester, under Hugh d'Avranches; Shrewsbury, under Roger de Montgomerie; and Hereford, under William FitzOsbern.  He instilled a great deal of power into each earldom, allowing them control of the surrounding towns and land, rather than retaining it within the kingship. The inspiration for such an action seems to have been the overextended nature of the Norman troops, thus preventing William from exercising his own power in the area. It very well may have been implicit in the power granted the earldoms that they were to attack Wales, and, indeed, they did, beginning with south-east Wales, where many of the previous rebellions against England had begun. By the time of FitzOsbern's death in 1071, a castle had been established at a location known at the time as Striguil, near the mouth of the Wye.   This served as a base from which the Normans continued to expand westward into Wales, establishing a castle at Caerleon by 1086 and extinguishing the Welsh Kingdom of Gwent. However, the attacks in south-east Wales \"faltered badly when the earl of Hereford’s son Roger de Breteuil... forfeited his estates for treason in 1075 and involved some of his vassals on the Welsh frontier in his downfall\". Nonetheless, the Normans pressed on.\nIn 1081 William commenced an armed pilgrimage through Southern Wales to St Davids.\nRelations with Henry I\nThese movements continued well into the 12th century, into the reign of Henry I. There was relative peace in the early 12th century, however, with the Anglo-Normans working diplomatically to gain influence over Wales; leading to relatively little conflict.  However there were moves by Henry from 1108 to settle Flemish emigrants in England into southern Pembrokeshire.\nThe only real expedition into Wales made by Henry was in 1114, when \"he set in motion three separate armies intended to overware the ageing prince of Gwynedd\". The prince, Gruffudd ap Cynan, however, saw fit to make peace with the king rather than engage in open warfare or hostility. Throughout the period, Henry exerted a great deal of control over Wales, establishing a series of new castles and placing new Lords into positions of power.\nFollowing Henry's death in 1135, revolts once again broke out in parts of Wales. These revolts caused Norman retreat in many areas, most surprisingly in Deheubarth, where, according to R.R. Davies, \"the Normans had made their most striking advances in the previous generation\". A notable example was the Battle of Crug Mawr, near Cardigan, in which the Normans suffered a heavy defeat. The period saw a role reversal of sorts, as well, with infighting amongst the Normans, the same sort which had enabled the relative fall of Wales in the previous century.\nHenry II and Wales\nBy the 1150s, Matilda's son King Henry II of England had set upon Wales, leading his first expedition into the country in 1157. He experienced costly ambushes and therefore defeat, particularly in the Battle of Ewloe at Coleshill / Coed Eulo, where Henry was almost killed in the fighting, but managed to return to friendly lines. He moved against his adversaries again in 1163, and, with Welsh resistance exhausted, gained homage from the two most powerful princes of Wales, Rhys ap Gruffydd and Owain Gwynedd, along with the king of Scotland.\nSee also\n*Norman conquest of England\n*Norman invasion of Ireland\n*Welsh uprising of 1211\n*Conquest of Wales by Edward I\nReferences\nBibliography\n*\n*\n*\n*"
    }
  ]
}