{
  "content": [
    {
      "type": "text",
      "text": "# Norman Park, Queensland\n\n| pop                 = 6842\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| local_map           = yes\n| zoom                = 13\n| postcode            = 4170\n| area                = 2.3\n| timezone            = AEST\n| utc                 = +10:00\n| lga                 = City of Brisbane(Morningside Ward)\n| stategov            = Bulimba\n| stategov2           = Greenslopes\n| fedgov              = Griffith\n| dist1               = 6.3\n| dir1                = E\n| location1           = Brisbane CBD\n| near-n              = Hawthorne\n| near-ne             = Morningside\n| near-e              = Seven Hills\n| near-se             = Camp Hill\n| near-s              = Camp Hill\n| near-sw             = Coorparoo\n| near-w              = East Brisbane\n| near-nw             = New Farm\n}}\nNorman Park is a suburb in the City of Brisbane, Queensland, Australia. In the , Norman Park had a population of 6,842 people.\nGeography\nNorman Park is located  by road east of the CBD. It borders East Brisbane, Coorparoo, Camp Hill, Morningside and Hawthorne, and is mostly residential.\nToponymy\nNorman Park is likely named after an early estate in the area. The estate is thought to have derived its name in the 1890s from the nearby Norman Creek, and the contemporary Governor of Queensland Henry Wylie Norman.\nHistory\nor \"dunny\" in the back yard.]]\nNorman Park began taking in the first settlers in 1853. One of the early Deeds of Grant was in 1854 to Louis Hope of land totalling about 40 acres. Hope was a grazier and Ormiston Sugar Mill owner.\nInitially, development in Norman Park was slow and almost ceased after the 1893 Brisbane floods. Industries in Norman Park at the time included dairying, leather and brooms.\nNorman Park State School opened on 9 July 1900 with 52 students with a principal and three teacher.\nBetween 1912 and 1926, the Belmont Tramway connected with the Queensland Government railway at Norman Park railway station. Initially the service was operated by the Belmont Shire Council. The service was suspended in 1924. The service was reinstated by the Brisbane City Council in 1925, but was again suspended in 1926. In 2006 remnants of the tramway's right of way could still be seen close to the railway station.\nA major subdivision of 364 housing lots occurred in 1922 of the land formally owned by Louis Hope, however Norman Park remained a largely rural area until after World War II, when rapid development took place as the result of the construction of public housing.\nIn the 1940s and 1950s, extensive reclamation of land in the low-lying areas created parks and playing fields.\nOn 13 July 1924, Archbishop Gerald Sharp laid the foundation stone for the new brick Anglican Church of the Transfiguration at 40 Agnew Street to replace an earlier timber church. On 26 October 1924 Archbishop Sharp officially opened the church, dedicating it as a World War I memorial. Its final service was held on 25 February 2010. As the church was heritage listed, it could not be demolished so it was sold for $2.4M and redeveloped with an extension as a private home.\nThe Baptist Sunday school and hall in Norman Park were officially opened on Saturday 4 April 1936 by Reverend George Haughan (President of the Queensland Baptist Union). The buildings were built at the rear of the block of land to allow a church to be built at the front at a later time. It was an initiative of the younger members of the Jireh Baptist Church in Fortitude Valley.\nOur Lady of the Assumption Primary School opened on 3 February 1948 and closed on 9 December 1973.\nNorman Park Uniting Christian School opened in 1981 and closed in 1983. It was at the Uniting Church at 177 Bennetts Road (now the Faith Works Uniting Church, ).\nThe Agnew School opened in Agnew Street on 3 February 2003. In 2008, the school relocated to Wakerley and, as at 2020, is known as the Brisbane campus of OneSchool Global. It is associated with the Plymouth Brethren Christian Church.\nDemographics\nIn the , Norman Park had a population of 6,003 people, of whom 50.7% were female and 49.3% were male. The median age of the population was 33; four years younger than the Australian median. 77.2% of people living in Norman Park were born in Australia, compared to the national average of 69.8%. The other most common countries of birth were England (3.8%), New Zealand (3.4%), South Africa (0.8%), Germany (0.7%), and Ireland (0.7%). 87.4% of people only spoke English at home, while the next most commonly spoken languages were Greek (0.8%), German (0.6%), French (0.5%), Italian (0.5%), and Japanese (0.4%).\nIn the , Norman Park had a population of 6,287 people.\nIn the , Norman Park had a population of 6,842 people.\nHeritage listings\nNorman Park has a number of heritage-listed sites, including:\n* Norman Park State School, 68–88 Agnew Street\n* Eulalia, 75 McIllwraith Avenue\n* former Brisbane City Council Tramways Substation No 9, 97 Wynnum Road\nEducation\nNorman Park State School is a government primary (Prep–6) school for boys and girls at 68–88 Agnew Street (). In 2017, the school had an enrolment of 457 students with 36 teachers (29 full-time equivalent) and 16 non-teaching staff (11 full-time equivalent). In 2023, the school had an enrolment of 413 students with 32 teachers (27 full-time equivalent) and 21 non-teaching staff (13 full-time equivalent).\nCoorparoo State School in Coorparoo and Seven Hills State School in Seven Hills also enrol students from the southern part of Norman Park.\nThere are no secondary schools in Norman Park. The nearest government secondary school is Coorparoo Secondary College in Coorparoo.\nPublic transport\nThree radial bus corridors pass through the suburb. The Wynnum Road corridor in the suburb's north is serviced by three bus routes that travel between the Brisbane central business district and eastern suburbs. These routes when combined offer frequent service with a long span, particularly on weekdays. The Stanley Street East-Canara Street-Crown Street-Bennetts Road corridor through the centre of the suburb is serviced by one all-stops bus route that travels between the Brisbane central business district and Carindale Shopping Centre bus station. This route has limited frequency and span. This corridor is also serviced by two alternating express bus routes between the Brisbane central business district and Cannon Hill Shopping Centre bus station and eastern suburbs, observing Norman Park and Norman Park North express stops. These two routes when combined provide frequent service with a relatively long span. The Stanley Street East-Milsom Street-McIlwraith Avenue corridor in the suburb's south is serviced by one all-stops route that travels between the Brisbane central business district and Cannon Hill Shopping Centre bus station. This route has limited frequency and span, but is supplemented during peak periods by a limited stops route that runs express along Stanley Street East.\nThe Cleveland railway line passes through the suburb, with Norman Park station located centrally. Trains operate at a 15-minute off-peak frequency and higher peak period frequency during weekdays, and a lower 30-minute frequency on weekends. This line has a long service span.\nNorman Park Ferry Terminal is located off Wynnum Road in the suburb's north. The cross-river ferry service was ended in 2020 by the Brisbane City Council due to low passenger numbers.\nNotable people\n* Kevin Rudd, former Australian prime minister, owned a property in Norman Crescent, Norman Park while he was in office. He has since sold it.\nSee also\n* List of tramways in Queensland\nReferences\nFurther reading\n*\nExternal links\n*"
    }
  ]
}