{
  "content": [
    {
      "type": "text",
      "text": "# Norton tradition__disambig_1\n\nThe Norton tradition is an archaeological culture that developed in the Western Arctic along the Alaskan shore of the Bering Strait around 1000 BC and lasted through about 800 AD.  The Norton people used flake-stone tools like their predecessors, the Arctic small tool tradition, but they were more marine-oriented and brought new technologies such as oil-burning lamps and clay vessels into use.\nNorton people used both marine and land resources as part of their subsistence strategy.  They hunted caribou and smaller mammals as well as salmon and larger sea mammals.  Their settlements were occupied fairly permanently, as is evidenced by village sites which contain substantial dwellings.  During summer months, small camps may have been used as temporary hunting and fishing locations, but the main dwelling place was maintained and returned to at the end of the hunting season. In about 700 BC, the Norton inhabitants of the St. Lawrence and other Bering Strait Islands developed an even more specialized culture, based entirely on the ocean, called the Thule tradition.\nStages\nThe Norton tradition is divided into three stages of development.\nThe first, the Choris Stage (ca. 1600—500 BC), consists of coastal sites mostly in northwest Alaska containing fiber-tempered pottery with linear stamping decorating the outsides of the vessels.  There is much local variation in this stage, which may indicate relative isolation of communities. The Choris people constructed sizable oval houses, hunted caribou and sea mammals and used Siberian-styled pottery. They may have expanded as far as the Mackenzie River Delta and Banks Island.\nThe second stage, Norton (500 BC—800 AD), is distinguished by caribou (hunting) and fishing.  There developed more refined pottery that included the Choris-style stamps, but also included check stamps applied using ivory paddles.  New technology included stone lamps, stone working, asymmetrical knives, and ground stone projectile points made from slate.\nThe final stage, the Ipiutak Stage (1—800 AD), was a more artistically developed form of the Norton Culture.  Their technology was less advanced (no pottery, oil lamps, or slate artifacts), but they used elegant harpoon heads that were ornately adorned.  Their art tradition consisted of mainly ivory carvings of animal and human figures.  They focused more on marine hunting than the first two stages and their settlements were very permanent.\nReferences\n*Fagan, Brian. Ancient North America. London: Thames & Hudson, 2005: 191-93."
    }
  ]
}