{
  "content": [
    {
      "type": "text",
      "text": "# North Toowoomba, Queensland\n\n| local_map           = yes\n| zoom                = 12\n| pop                 = 3332\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4350\n| area                = 2.0\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 2.1\n| dir1                = N\n| location1           = Toowoomba CBD\n| dist2               = 128\n| dir2                = W\n| location2           = Brisbane\n| dist3               =\n| dir3                =\n| location3           =\n| dist4               =\n| dir4                =\n| location4           =\n| lga                 = Toowoomba Region\n| stategov            = Toowoomba North\n| fedgov              = Groom\n| near-n              = Harlaxton\n| near-ne             = Mount Lofty\n| near-e              = Mount Lofty\n| near-se             = East Toowoomba\n| near-s              = Toowoomba City\n| near-sw             = Newtown\n| near-w              = Newtown\n| near-nw             = Rockville\n}}\nNorth Toowoomba is a suburban locality in Toowoomba in the Toowoomba Region, Queensland, Australia. In the , North Toowoomba had a population of 3,332 people.\nGeography\nNorth Toowoomba is located directly north of the Toowoomba city centre.\nThe New England Highway travels along Ruthven Street, entering the suburb from the north (Harlaxton) and exiting to the south (Toowoomba CBD).\nThe Main Line railway also enters the suburb from the north (Harlaxton) and exits to the south (Toowoomba CBD). The Western railway line enters the suburb from the south (Toowoomba CBD) and exits to the north-west forming the boundary between Rockville and Harlaxton. There are no railway stations in the suburb, although historically there were railway sidings for industrial use, e.g. the dairy factory.\nHistory\nToowoomba North Boys State School and Toowoomba North Girls and Infants State School both opened in 1869. In 1937 the two schools were combined to form Toowoomba North State School. However, despite the name, the school is  officially within Toowoomba City rather than in North Toowoomba.\nSt Thomas' Anglican Church was dedicated on 21 December 1920 by Archdeacon Osborn. The church building had been relocated from Ruthven Street near the railway line where it was no longer needed to 2 Allan Street (corner of Jellicoe Street ,). The church's closure on 3 February 2008 was approved by Assistant Bishop Nolan. It has been converted into a private home.\nDemographics\nIn the , North Toowoomba had a population of 3,062 people.\nIn the , North Toowoomba had a population of 3,049 people.\nIn the , North Toowoomba had a population of 2,953 people.\nIn the , North Toowoomba had a population of 3,332 people.\nHeritage listings\nThere are a number of heritage-listed sites in North Toowoomba, including:\n* 57 Brook Street: The Downs Co-operative Dairy Association Limited Factory\nEducation\nThere are no government schools in North Toowoomba. The nearest government primary schools are Harlaxton State School in neighbouring Harlaxton to the north, Toowoomba East State School in neighbouring East Toowoomba to the south-east, and Toowoomba North State School which, despite its name, is in neighbouring Toowoomba City to the south. The nearest government secondary school in Toowoomba State High School in neighbouring Mount Lofty to the east.\nAmenities\nMartin Klein Park (also known as North Toowoomba Park) is at 130-136 Jellicoe Road (). It has a cricket oval, playground, and picnic facilities.\nReferences\nExternal links\n*"
    }
  ]
}