{
  "content": [
    {
      "type": "text",
      "text": "# North Eastern Railway (United Kingdom)\n\n| old_gauge=\n| predecessor_line  =\n| successor_line    = London and North Eastern Railway\n| length            =  (1919)\n| tracklength       =  (1919)\n| hq_city           = York\n| website           =\n}}\n| type                  = Act\n| parliament            = Parliament of the United Kingdom\n| long_title            = An Act for enabling The North Eastern Railway Company to make new railways; and for other purposes.\n| year                  = 1887\n| citation              = 50 & 51 Vict. c. l\n| introduced_commons    =\n| introduced_lords      =\n| territorial_extent    =\n| royal_assent          = 23 May 1887\n| commencement          =\n| expiry_date           =\n| repeal_date           =\n| amends                =\n| replaces              =\n| amendments            =\n| repealing_legislation =\n| related_legislation   =\n| status                =\n| legislation_history   =\n| theyworkforyou        =\n| millbankhansard       =\n| original_text         = https://books.google.com/books?id=JGU1AQAAMAAJ&pg=RA41-PA1\n| revised_text          =\n| use_new_UK-LEG        =\n| UK-LEG_title          =\n| collapsed             = yes\n}}\nThe North Eastern Railway (NER) was an English railway company. It was incorporated in 1854 by the combination of several existing railway companies. Later, it was amalgamated with other railways to form the London and North Eastern Railway at the Grouping in 1923. Its main line survives to the present day as part of the East Coast Main Line between London and Edinburgh.\nUnlike many other pre-Grouping companies the NER had a relatively compact territory, in which it had a near monopoly. That district extended through Yorkshire, County Durham and Northumberland, with outposts in Westmorland and Cumberland. The only company penetrating its territory was the Hull & Barnsley, which it absorbed shortly before the main grouping. The NER's main line formed the middle link on the Anglo-Scottish \"East Coast Main Line\" between London and Edinburgh, joining the Great Northern Railway near Doncaster and the North British Railway at Berwick-upon-Tweed.\nAlthough primarily a Northern English railway, the NER had a short length of line in Scotland, in Roxburghshire, with stations at Carham and Sprouston on the Tweedmouth-Kelso route (making it the only English railway with sole ownership of any line in Scotland), and was a joint owner of the Forth railway bridge and its approach lines. The NER was the only English railway to run trains regularly into Scotland, over the Berwick-Edinburgh main line as well as on the Tweedmouth-Kelso branch.\nand completed in 1906. Now The Grand hotel]]\nThe total length of line owned was  and the company's share capital was £82 million. The headquarters were at York and the works at Darlington, Gateshead, York and elsewhere.\nBefitting the successor to the Stockton and Darlington Railway, the NER had a reputation for innovation. It was a pioneer in architectural and design matters and in electrification. By 1906 the NER was further ahead than any other British railway in having a set of rules agreed with the trades unions, including arbitration, for resolving disputes. In its final days it also began the collection that became the Railway Museum at York, now the National Railway Museum.\nIn 1913, the company achieved a total revenue of £11,315,130 () with working expenses of £7,220,784. ().\nDuring the First World War, the NER lost a total of 2,236 men who are commemorated on the North Eastern Railway War Memorial in York. An earlier printed Roll of Honour lists 1,908 men. They also raised two 'Pals Battalions', the 17th (N.E.R. Pioneer) Battalion and 32nd (N.E.R. Reserve) Battalion, Northumberland Fusiliers. This was the first time that a battalion had been raised from one Company. The company also sent two tug boats, NER No.3. and Stranton. The latter became HM Tug Char and was lost at sea on 16 January 1915 with the loss of all hands.\nThe NER Heraldic Device (seen above the tile map photo) was a combination of the devices of its three major constituents at formation in 1854: the York and North Midland Railway (top; arms of the City of York); the Leeds Northern Railway (lower left; arms of the City of Leeds along with representations of the expected traffic, wool and corn, and connection to the sea via the West Hartlepool Harbour and Railway); and the York, Newcastle and Berwick Railway (lower right; parts of the arms of the three places in its title).\nConstituent parts of the NER\nThe information for this section is largely drawn from Appendix E (pp 778–779) in Tomlinson.\n1854\n*York, Newcastle and Berwick Railway was York and Newcastle Railway (1846–1847) and Newcastle and Darlington Junction Railway (1842–1846)\n**Durham Junction Railway (1844)\n**Brandling Junction Railway (1845)\n**Durham and Sunderland Railway (1846)\n**Pontop and South Shields Railway (1846)\n***Stanhope and Tyne Railway (1842)\n**Newcastle and Berwick Railway (1847)\n***Newcastle and North Shields Railway (1845)\n**Great North of England Railway (1850)\n*York and North Midland Railway\n**Leeds and Selby Railway (1844)\n**Whitby and Pickering Railway (1845)\n**East and West Yorkshire Junction Railway (1852)\n*Leeds Northern Railway was Leeds and Thirsk Railway (1845–1849)\n*Malton and Driffield Railway\n1857\n*Deerness Valley Railway\n*Hartlepool Dock and Railway\n1858\n* North Yorkshire and Cleveland Railway\n1859\n*Bedale and Leyburn Railway\n1862\n*Hull and Holderness Railway\n*Newcastle and Carlisle Railway\n** Blaydon, Gateshead and Hebburn Railway (1839)\n1863\n*Stockton and Darlington Railway\n** Darlington and Barnard Castle Railway (1858)\n**Middlesbrough and Guisborough Railway (1858)\n** Middlesbrough and Redcar Railway (1858)\n**Wear Valley Railway (1858)\n***Bishop Auckland and Weardale Railway (1847)\n**Eden Valley Railway (1862)\n** Frosterley and Stanhope Railway (1862)\n**South Durham and Lancashire Union Railway (1862)\n1865\n*Cleveland Railway\n*West Hartlepool Harbour and Railway\n**Clarence Railway (1853)\n**Stockton and Hartlepool Railway (1853)\n1866\n*Hull and Hornsea Railway\n1870\n*West Durham Railway\n1872\n*Hull and Selby Railway\n1874\n*Blyth and Tyne Railway\n1876\n*Hexham and Allendale Railway\n* Leeds, Castleford and Pontefract Junction Railway\n1882\n*Tees Valley Railway\n1883\n* Hylton, Southwick and Monkwearmouth Railway\n*Scotswood, Newburn and Wylam Railway\n1889\n*Whitby, Redcar and Middlesbrough Union Railway\n1893\n*Wear Valley Extension Railway\n1898\n*Scarborough & Whitby Railway\n1900\n*Cawood, Wistow and Selby Light Railway\n1914\n* Scarborough, Bridlington and West Riding Junction Railway\n1922\n*Hull and Barnsley Railway\nDock companies\n1853\n*Hartlepool West Harbour and Dock\n1857\n*Hartlepool Dock and Railway\n1893\n*Hull Dock Company\nPrincipal stations\nHaving inherited the country's first great barrel-vault-roofed station, Newcastle Central, from its constituent, the York Newcastle & Berwick railway, over the next half century the NER built a grander set of principal station buildings than any other British railway company, with examples at Alnwick, Tynemouth, Gateshead East, Sunderland, Stockton, Middlesbrough, Darlington Bank Top, York and Hull Paragon. The rebuilding and enlargement of the last-named created the last of the type in the country.\nThe four largest stations, at Newcastle, Darlington, York and Hull, survive in transport use, as does Tynemouth. Alnwick is still extant as a second-hand book warehouse, having lost its transport use in 1991. The others were demolished during the state-owned-railway era of the 1950s and 60s, two of them, Sunderland and Middlesbrough, following bomb damage during the Second World War.\n*York station (York) was the hub of the system and the location of the headquarters of the line. The basis for the present station was opened on 25 June 1877. From June 1909 to May 1951, when it was replaced by an electric system, the 295-lever locomotive yard signal cabin contained the largest mechanical lever frame in Britain.\n*Newcastle station (Newcastle), opened on 29 August 1850, became the largest on the NER.\n*Leeds New Station (later Leeds City, now Leeds) was a joint undertaking with the London and North Western Railway. It opened in 1869.\nArchitects\nThe NER was the first railway company in the world to appoint a full-time salaried architect to work with its chief engineer in constructing railway facilities. Some of the men appointed were based in, or active in, Darlington.\n* George Townsend Andrews was the first architect associated with the North Eastern Railway. He designed the first permanent station at York, along with others on the NER route. He also designed the Assembly Rooms in York.\n* Thomas Prosser held the position from 1854 to 1874. He worked in Newcastle.\n* Benjamin Burleigh, served for two years, dying in office.\n* William Peachey, was based in Darlington, and served for two years. Peachey had been architect to the Stockton and Darlington Railway, and when this merged into the NER in 1863, he was made Darlington section architect. Most of his work was to extend and improve railway buildings. Elsewhere he built the Zetland Hotel at Saltburn (1861–63), and the Royal Station Hotel at York (1877–82). He also practised privately, designing a few nonconformist chapels, including Grange Road Baptist Chapel in Darlington, 1870–1.\n, Westminster (2007)]]\n* William Bell worked for the NER for 50 years; he was chief architect for 37 years, between 1877 and 1914. His major contributions were as NER architect. Bank Top (1884–87) is one of the best examples of his station designs, for which he developed a standard system of roof building. He added various elements to the North Road Engineering works between 1884 and 1910. He also designed the offices of the Mechanical Engineer's Department in Brinkburn Road in 1912, showing that he could adapt his style to the new influences of the Queen Anne revival.\n* Horace Field, with William Bell, designed the Headquarters Offices in York completed in 1906, now The Grand Hotel and Spa. Field also designed the company's London office at 4 Cowley Street, Westminster, completed the same year as the York offices, which was later used by the Liberal Democratic Party as its headquarters and is now a private house.\n*Arthur Pollard and Stephen Wilkinson each briefly filled the position of chief architect. The department remained in York after the merger of the company into the LNER.\nProfessional design was carried through to small fixtures and fittings, such as platform seating, for which the NER adopted distinctive 'coiled snake' bench-ends.  Cast-iron footbridges were also produced to a distinctive design.  The NER's legacy continued to influence the systematic approach to design adopted by the grouped LNER.\nChairmen and directors\nChairmen\n*James Pulleine (1854–55)\n*Harry Stephen Thompson (1855–74)\n*George Leeman (1874–80)\n*John Dent Dent (1880–94)\n*Sir Joseph Whitwell Pease, Bart (1895–1902)\n*Viscount Ridley (1902–04)\n*Sir Edward Grey, Bart (1904–05)\n*John Lloyd Wharton (1906–12)\n*Baron Knaresborough (1912–22)\nDirectors\nThe initial NER board of directors was drawn from the directors of its four constituent companies. A  director of the NER from 1864, and deputy chairman from 1895 until his death in 1904, was ironmaster and industrial chemist Sir Lowthian Bell. His son Sir Hugh Bell was also a director; he had a private platform on the line between Middlesbrough and Redcar at the bottom of the garden of his house Red Barns. Gertrude Bell's biographer, Georgina Howell, recounts a story about the Bells and the NER:\nAmong the other famous directors of the NER were George Leeman (director 1854–82, Chairman 1874–80); Henry Pease (director 1861–1881); Sir Joseph Whitwell Pease, Bart. (director 1863–1902, Chairman 1895–1902); John Dent Dent (director 1879–94, Chairman 1880–94); Matthew White Ridley, 1st Viscount Ridley (director 1881–1904, Chairman 1902–04); Sir Edward Grey, Bart (see below); George Gibb (solicitor 1882–1891, general manager 1891–1906, director 1906–1910); and Henry Tennant (director 1891–1910).\nIn 1898 Sir Edward Grey became a director, later becoming Chairman (1904-5; curtailed by his appointment as Foreign Secretary). In his autobiographical work Twenty-Five Years Grey later wrote that ‘…the year 1905 was one of the happiest of my life; the work of Chairman of the Railway was agreeable and interesting…’. After leaving the Foreign Office Grey resumed his directorship of the NER in 1917, and when the North Eastern Railway became part of the London and North Eastern Railway he became a director of that company, remaining in this position until 1933. At the Railway Centenary celebrations in July 1925, Grey accompanied the Duke and Duchess of York and presented them with silver models of the Stockton and Darlington Railway engine Locomotion and the passenger carriage Experiment.\nSenior officers\nGeneral Managers\n*Thomas Elliot Harrison 1854\n*Capt. William O’Brien 1854 – 1871\n*Henry Tennant 1871 – 1891\n*George Gibb 1891 – 1905 (Resigned)\n*Alexander Kaye Butterworth 1906 – 1921 (Retired)\n*Ralph Lewis Wedgwood 1922 whole year (then appointed Chief General Manager LNER)\nDeputy General Managers\n*Philip Burtt 1905 – 1911\n*Eric Campbell Geddes 1912 – 1915 (To Director General of Munitions Supply)\n*Ralph Lewis Wedgwood –  to 31/12/1921\nSecretaries\n*Capt. William O’Brien 1854 – 1856 (Also General Manager, see above)\n*John Cleghorn 1856 – 1870 (Retired)\n*Christopher Newman Wilkinson 1871 – 1903\n*Ralph Lewis Wedgwood 1904 – 1905\n*Robert Francis Dunnell 1905 – 1922\nGeneral Passenger Superintendents / Superintendents of the Line\n*Alexander William Crow Christison 1856 – 1890\n*William Blackadder Johnson 1890 – 1891 (died in office)\n*John Welburn 1891 – 1892\n(Post renamed Superintendent of the Line):\n*John Welburn 1892 – 1897\n*Philip Burtt 1897 – 1900\n*Henry Angus Watson 1900 – 1902\n(Post then divided between General Superintendent - Henry Angus Watson - & Chief Passenger Agent)\nThe above list only covers the most senior officers of the company and its passenger department. Further lists covering the officers in the Engineering, Locomotive and Docks departments will be summarised here as they appear.\nOperating divisions\nThe Northern and Southern Divisions were established for operating and engineering purposes on the creation of the NER in 1854. When the merger with the Stockton and Darlington Railway took place in 1863 their lines became the ‘Darlington Section’ until 1873, and then the Central Division. In 1888 the boundaries were altered to remove anomalies; for example, the former Clarence Railway routes became part of the Central Division. The engineering and purchasing autonomy of the three divisions brought about diverging styles of infrastructure. In 1899 it was decided to abolish the Central Division and its area was divided between the Northern and Southern Divisions.\nElectrified lines\nintroduced to the Quayside electrification, now at Locomotion museum, Shildon]]\n, a prototype electric express passenger locomotive, built for the proposed York-Newcastle electrification which never happened.]]\nThe NER was one of the first main line rail companies in Britain to adopt electric traction, the Lancashire and Yorkshire Railway having opened its first electrified line between Liverpool and Southport one week earlier.\nTyneside\n]]\nThe Tyneside scheme commenced public operation on 29 March 1904. The scheme was known as Tyneside Electrics and totalled about 30 miles:\n*Newcastle Central via Wallsend, Whitley Bay, Gosforth and New Bridge Street (the Newcastle terminus of the former Blyth & Tyne Railway)\n*Heaton to Benton or Backworth via the East Coast Main Line\n*Riverside Branch from Byker to Percy Main\n*Newcastle Quayside Branch\nThe last-named was electrically operated from June 1905 and was a 3/4 mile freight-only line from Trafalgar Yard, Manors to Newcastle Quayside Yard.\nFurther extensions taking the electrification to South Shields were carried out in March 1938 by the London and North Eastern Railway\nThe lines were originally electrified at 600 V DC using the 3rd rail system, although after 1934 the operating voltage was raised to 630 V DC. On the Newcastle Quayside Branch overhead line of tramway type was used for upper and lower yards (to avoid the danger of shunters and other staff coming into contact with live rails) with 3rd rail in the interconnecting tunnels between the yards.\nNewport-Shildon\nelectric freight locomotive]]\nThe Newport-Shildon line was electrified on the 1,500 V DC overhead system between 1914 and 1916 and the locomotives which later became British Rail Class EF1 were used on this section.\nProposed main line electrification\nAfter the success of the earlier schemes, in 1919 the North Eastern Railway made plans to electrify  of the East Coast Main Line between York and Newcastle with a mixture of third rails and overhead lines at 1,500 DC. The scheme advanced as far as a prototype passenger locomotive, however the scheme was dropped on financial grounds by the time of the 1923 grouping, due in large part to the difficult economic climate of the time.\nTraffic\nThe NER carried a larger tonnage of mineral and coal traffic than any other principal railway.\n{| class=wikitable\n|+ Some selected tonnages and receipts for the years shown\n|-\n! Year || Coal and coke || Lime and limestone || Ironstone || Total || Total receipts £\n|-\n| 1870 || 15,058,598 || 1,177,498 || 3,816,772 || 20,052,868 || 1,733,956\n|-\n| 1880 || 21,689,915 || 1,630,683 || 5,785,724 || 29,106,322 || 2,489,293\n|-\n| 1890 || 26,266,510 || 2,126,611 || 4,728,185 || 33,121,306 || 2,608,270\n|-\n| 1900 || 33,316,191 || 2,213,779 || 5,019,268 || 40,549,238 || 3,057,050\n|-\n| 1910 || 40,390,130 || 2,499,341 || 6,025,431 || 48,914,902 || 3,474,882\n|}\nThe NER was a partner (with the North British and the Great Northern Railway) in the East Coast Joint Stock operation from 1860.\nSignalling\nThe signalling of the NER and its constituent companies in the 1850s and 1860s was, at best, average for the period (with the notable exception of the Stockton and Darlington Railway). Passenger traffic density and train speeds were generally low and, despite the absence of continuous brakes, train crews were usually able to pull up short of an obstruction. The time interval system was in widespread use, and the interlocking of points and signals was very rare. It was only after a spate of accidents (notably at Brockley Whins in 1870, see below), and mounting public pressure, that the NER began to adopt the block system and interlocking. Once this decision had been taken, the company made reasonably speedy progress, aided by the scrutiny of the Railway Inspectorate (Board of Trade) whose officers were supported by increasingly comprehensive legislation. The inception of block signalling in particular brought with it a large increase in manpower to operate and maintain the new equipment, along with the need for staff literacy. This was essential to enable compliance with a large number of new rules and regulations covering block working and the operation of the electric telegraph. In the last years of the Nineteenth Century a combination of changes began to drive modernisation of the signalling systems in the north-east of England. The track layouts installed in the 1870s were no longer adequate to handle the increased traffic and the signalling equipment was worn out or becoming obsolete. Longer and heavier trains were running, often at higher speeds; electricity was playing an increasing role, and finally the managers of Britain’s railways were becoming aware of the radical changes by which the railways in the United States were improving revenues, productivity and safety. The NER made several bold moves towards automatic and power signalling, but these did not always bring the benefits hoped for.\nBy the end of its independent existence the North Eastern Railway had one of the most advanced signal systems of the LNER constituent companies – the Great Central was also well-equipped – and the progressive attitude of the signal engineers continued to make itself felt in the North Eastern Area of the new company. Despite this, features dating back to the mid- Nineteenth Century remained in use, such as slotted-post semaphore signals and rotating board signals. By 1910 about 1,150 block signal cabins controlled the NER network, along with numerous other signalling installations at level crossings and isolated sidings.\nAccidents and incidents\n*On 6 December 1870, a collision between two trains at Brockley Whins, County Durham killed five people. The accident was caused by a lack of interlocking between points and signals, and is generally viewed as having persuaded the NER board to adopt the block system and interlocking.\n*In 1870, a freight train overran signals and collided with a London and North Western Railway passenger train at St. Nicholas Crossing, Carlisle, Cumberland. Five people were killed. The driver of the freight was intoxicated.\n*On 27 July 1875, the boiler of a locomotive exploded at  station, Leeds, Yorkshire.\n:\n*On 25 March 1877, an express passenger train was derailed at , Northumberland due to excessive speed on a curve. Five people were killed and seventeen were injured.\n*In 1877,the boiler of a locomotive exploded at , Yorkshire.\n*On 10 August 1880, an express passenger train hauled by a NER locomotive was derailed on the North British Railway near Berwick upon Tweed, Northumberland due to defective track. Three people were killed.\n*On 25 October 1887, a freight train overran signals at , Northumberland and was in a head-on collision with a locomotive that was shunting. That locomotive and its wagons were pushed into a stationary passenger train.\n*In 1890, a freight train was derailed on the Redheugh Incline, Gateshead, County Durham.\n:\n*On 2 November 1892, an express passenger train was in a rear-end collision with a freight train at , Yorkshire due to errors by the driver of the freight train and a signalman. The latter had fallen asleep on the night shift after spending his rest day searching for medical help for his infant daughter. Ten people were killed and 43 were injured.\n*On 4 November 1894, a sleeping car train overran signals and collided with a freight train that was being shunted at Castle Hills, Yorkshire. One person was killed.\n*On 5 November 1900, a freight train ran away and was derailed by trap points at Lingdale Junction, Yorkshire.\n*On 4 July 1901, a freight train was unable to stop and ran off the end of a siding at , County Durham.\n*On 27 June 1905, a freight train was derailed at Wallsend, Northumberland.\n*On 24 November 1906, a passenger train overran signals and ran into the rear of a freight train at , Yorkshire.\n*On 26 March 1907, a passenger train was derailed by heat buckled track at Felling, County Durham (now Tyne and Wear). Two people were killed and six were seriously injured. The accident could have been prevented as the signalman had been warned of the buckle by a member of the public but refused to heed the warning.\n*On 28 August 1907, a freight train overran signals and was derailed at , Northumberland. Two people were killed and one was seriously injured.\n*On 8 October 1908, an overloaded freight train ran away and crashed into goods wagons at , Yorkshire.\n*On 29 May 1909, a freight train was derailed at Skinningrove, Yorkshire due to subsidence of the trackbed.\n*On 8 August 1909, a freight train was derailed at Hartley, Cumberland due to the track buckling in the heat of the sun.\n*On 15 November 1910, an express freight train overran signals and was in a rear-end collision with a freight train at , County Durham.\n*On 15 December 1911, a freight train was derailed at Lartington, Yorkshire due to the driver braking too sharply. During recovery operations, a rail-mounted crane overturned.\n*On 17 December 1915, a passenger train collided with a light engine at St Bede's Junction, Tyne Dock. The light engine had been overlooked by the signalman. An empty carriage train travelling in the opposite direction then ran into the wreckage. The wooden carriages were gas-lit and caught fire; 17 people died and 81 were injured.\n*On 3 March 1916, an empty stock train was in a rear-end collision with an electric multiple unit at  station, Newcastle upon Tyne, Northumberland. Forty-nine people were injured.\n*On 15 September 1917, a set of carriages ran away from  and was derailed. Three people were killed.\n*On 11 August 1918, the carriage sheds at Heaton, Newcastle were destroyed by fire, as were 34 carriages forming a number of NER electric units.\n*On 14 February 1920, two freight trains were involved in a head-on collision at Skelton, Yorkshire.\n*On 31 March 1920, a passenger train was derailed at  station.\n*On 22 October 1921, Petrol Inspection Saloon No. 3768 was destroyed by fire at York station.\nDocks\nThe company owned the following docks:\n*The Hull Docks Company (Queens dock, Humber Dock, Railway Dock, Victoria dock, Albert dock, William Wright Dock, St Andrews dock): acquired 1893. Dealt with a large variety of cargoes, including coal exports, grain, seed, and imports of timber and fruit\n**King George Dock (opened 1914) – jointly operated with the Hull and Barnsley Railway.The Dock was used by the 17th (NER Pioneer) Battalion, Northumberland Fusiliers as a base during its formation in 1915.\n*Hartlepool Docks: acquired as part of the West Hartlepool Harbour & Railway in 1865. Major imports of Scandinavian timber (including pit props for coal mines): coal exports from the south Durham coalfield\n*Tyne Dock: opened by the NER in 1859. Major coal export terminal; also chemicals and grain exports. Imports including iron ore and esparto grass for paper manufacture.\n*Middlesbrough Dock: Opened in 1842 by the Stockton and Darlington Railway. Iron and steel exports; and a worldwide trade in other goods.\nThe NER also owned coal-shipping staithes at Blyth and Dunston-on-Tyne. The numerous other coal export staiths on the Tyne, the Wear and at Seaham were owned by the colliery companies or the river improvement commissioners. Wilson's & North Eastern Railway Shipping Co. Ltd steamers ran between Hull and Antwerp, Ghent and Dunkirk.\nOne tug, Stranton, used at West Hartlepool Dock was requisitioned by the Admiralty during the First World War but was lost at sea in January 1915.\nLocomotives\nlocomotive]]\nlocomotive]]\nlocomotive]]\nA comprehensive list of NER locomotives: Locomotives of the North Eastern Railway.\nCoaching stock\nThe NER originally operated with short four and six wheeled coaches with a fixed wheelbase.  From these were developed the standard  six-wheeled, low elliptical roofed coaches which were built in their thousands around the 1880s.  One variety alone, the diagram 15, five compartment, full 3rd class, numbered around a thousand.  The NER started building bogie stock for general service use in 1894,  clerestories for general use with a  variation built for use on the tightly curved line from Malton to Whitby.  There were also a series of  low ark roofed bogie coaches (with birdcage brakes) for use on the coast line north of Scarborough.\nCoach manufacture moved to high arched roof vehicles but with substantially the same body design in the early 1900s.\nThe NER had limited need for vestibuled coaches but from 1900 built a series of vestibuled, corridor coaches with British Standard gangways, for their longer distance services. The company introduced clerestory corridor dining trains on services between London and Edinburgh. The initial trial was run between York and Newcastle in 1 hour 30 minutes on 30 July 1900. The new train consisted of eight coaches and was  long (excluding the engine), and had seating for 50 first-class and 211 third-class passengers.  At the same time they built (in conjunction with their partners) similar coaches for the East Coast Joint Stock (GNR/NER/NBR) and the Great Northern and North Eastern Joint Stock.\nAll NER coach building was concentrated at their York Carriage Works, which went on to be the main LNER carriage works after grouping.\nWith the introduction of the standard  6-wheeled coaches NER carriage livery was standardised as 'deep crimson' (a deeper colour with more blue in it than that used by the Midland Railway), lined with cream edged on both sides with a thin vermillion line.  For a time the cream was replaced with gold leaf.  Lettering ('N.E.R.' or when there was sufficient space 'North Eastern Railway' in full, together with 'First', 'Third' and 'Luggage Compt.' on the appropriate door) and numbering; was in strongly serifed characters, blocked and shaded to give a 3D effect.\nThe NER's bogie coach building programme was such that, almost unique amongst pre-grouping railways, they had sufficient bogie coaches to cover normal service trains; six wheel coaches were reserved for strengthening and excursion trains.\nSee also\n*North Eastern Railway War Memorial, memorial to the company's employees killed in the First World War, located outside its former head office in York\nReferences\nSources\n*\n*British Railway Electrics (Ian Allan, 1960 edition)\n*\n*Cook, R. A. & Hoole, K. (1991) North Eastern Railway Historical Maps. Railway & Canal Historical Society.\n*\n*\n*[http://www.lner.info/co/NER/index.shtml North Eastern Railway] at LNER Encyclopedia\n*[https://steamindex.com/locotype/nerloco.htm North Eastern Railway and its constituents] at Steam Index. Notes on locomotive classes with references to appropriate publications.\n*Railway Magazine February & March 1923 editions\n*Railway Year Book for 1912 (Railway Publishing Company)\n* Reprinted as ''Tomlinson's North Eastern Railway. Newton Abbot: David and Charles, 1967.\nFurther reading\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\nExternal links\n*[http://www.ner.org.uk North Eastern Railway Association'']"
    }
  ]
}