{
  "content": [
    {
      "type": "text",
      "text": "# North Queensland Stadium\n\n| publictransit =  Townsville, Queensland Rail Townsville CBD Bus Hub, Translink\n| owner =\n| operator = Stadiums Queensland\n| capacity = 25,455\n| surface = Grass\n| broke_ground =\n| built        = 2017-2020\n| opened       =\n| construction_cost = $250 million\n| architect    = Cox Architecture & Counterpoint Architecture\n| general_contractor = Watpac\n| tenants      = North Queensland Cowboys (NRL) (2020–present)[http://www.insidesport.com.au/league/news/cowboys-new-stadium-design-revealed--445484 Cowboys' new stadium design revealed - League - Inside Sport] Queensland Reds (Super Rugby) (2023)\n}}\nNorth Queensland Stadium, also known as Queensland Country Bank Stadium for sponsorship reasons, is a Rugby League stadium located in Railway Estate, a suburb of Townsville, Queensland, Australia. It is the home ground of the North Queensland Cowboys of the National Rugby League (NRL) competition.\nHistory\nAs part of Australia's 2022 FIFA World Cup bid in 2010, an analysis of Townsville's existing Willows Sports Complex suggested a total redevelopment of the site and outlined key issues including the growth rate of the surrounding suburbs and incompatibility of hosting major events in an expanding residential centre, with limited public transport access. In August 2011, the Bligh Government released a concept design for a new inner-city $185&nbsp;million sporting stadium in South Townsville. The concept plan identified a 17.28&nbsp;hectare parcel of land bounded by Saunders St and owned by QR National, as the ideal site for a new international standard stadium. The 30,000-seat stadium would include 100 open-air corporate boxes and 25 enclosed corporate suites. North Queensland Cowboys chairman Laurence Lancini supported the concept and said relocating the Cowboys' home ground to the inner-city site would not only benefit the club, but the city as a whole. Two months prior to the concept release, then-Queensland Premier Anna Bligh had declared Townsville the capital of north Queensland and had outlined the importance of sporting events and entertainment in the Townsville Futures Plan.[https://web.archive.org/web/20160304113355/http://www.cabinet.qld.gov.au/documents/2011/apr/draft%20townsville%20futures%20plan/Attachments/Townsville%20Futures%20Plan.pdf Wayback Machine] The following year saw Bligh and the Queensland Labor Party lose the 2012 Queensland state election which resulted in the Queensland Liberal National Party not adopting the Townsville Futures Plan.\nThe concept of a new stadium for Townsville was again put on the agenda in the lead up to the 2015 Queensland state election. In December 2014, Queensland Opposition Leader Annastacia Palaszczuk promised the Queensland Labor Party would provide $100&nbsp;million in funding for a new stadium in Townsville's central business district, should they win the election. In January 2015 then-premier Campbell Newman announced $150 million in funding for the same project that would be funded through the sale of state assets.\n}}\nIn April 2015, the Townsville City Council purchased the 17.28ha site in South Townsville with the hope that funding could be secured for the project in the near future. A visit from then-Prime Minister Tony Abbott a month later raised hopes as it was revealed that the federal Liberal National Party was investigating options for Commonwealth funding towards the stadium. Just three days later Treasurer Joe Hockey ruled out Commonwealth funding for the project.\nThe campaign to build a new stadium in Townsville received national exposure in October 2015 when the North Queensland Cowboys secured their first National Rugby League premiership. With millions watching on a national broadcast and Prime Minister Malcolm Turnbull standing on the same stage, Cowboys captain Johnathan Thurston expressed his belief that north Queensland deserved a new stadium. Following Thurston's speech, the campaign received an immense amount of media coverage. Three days after the Cowboys' 2015 NRL Grand Final win, it was revealed that club officials would travel to Canberra later that month to lobby for federal funding. On 3 November 2015, Bill Shorten and the federal Labor party promised $100 million towards funding the project.\nOn 10 June 2016, Premier Annastacia Palaszczuk committed an extra $40 million towards the project which upped the total state contribution to $140 million. Three days later Prime Minister Malcolm Turnbull matched the federal Labor party's pledge of $100 million, essentially ensuring the project becomes a reality regardless of which major party won the 2016 federal election.\nOn 14 June 2019, the [https://web.archive.org/web/20190720232555/https://northqueenslandstadium.com.au/Home.aspx North Queensland Stadium] website was officially launched alongside the announcement that international musician Sir Elton John would bring his final world tour, Farewell Yellow Brick Road, on 29 February 2020 as the first official act for the stadium.\nThe first NRL premiership match to be held at the ground was between Queensland rivals the North Queensland Cowboys and Brisbane Broncos in round one of the 2020 NRL season. Jake Turpin scored the stadium's first try, Jamayne Isaako scored the first goal and Michael Morgan slotted the first field goal as the Broncos won 28–21.\nGame One of the 2021 State of Origin series was played in Townsville on 9 June 2021. The match was originally scheduled to be played at the Melbourne Cricket Ground but was moved to Townsville due to another COVID-19 outbreak in Melbourne. In front of a stadium record crowd 27,533 made possible thanks to temporary stands being erected at the northern end of the ground increasing the stadium's capacity to 28,000 for the game, New South Wales won 50–6 against Queensland, with the game being the first time since 2000 (and second in the game's history) that the New South Wales side scored above the half-century. It is currently the game with the second highest margin of 44.\nOn 11 September 2021, the ground hosted its first NRL finals matches when due to a COVID-19 outbreak in Sydney, two finals matches were moved to the stadium with the Sydney Roosters taking on the Gold Coast Titans in the first match, followed by the Penrith Panthers taking on South Sydney, in front of 18,244 spectators.\nOn 29 May 2021, the stadium hosted its first Rugby Union match, a Super Rugby Trans-Tasman game between the Queensland Reds and the Chiefs. Played in front of 9,238, the Reds defeated the Chiefs 40-34. Later that year on 25 September, it would host its first Rugby Union international test as part of the 2021 Rugby Championship. Played between Australia and Argentina, a crowd of 23,184 saw the Wallabies win 27-8. The stadium hosted 2 Super Rugby Pacific matches for the Queensland Reds in 2023 in a deal between the Queensland Rugby Union and the City of Townsville, with the goal of increasing the sports presence in North Queensland.\nThe stadium hosted its first soccer match on 8 April 2022, a women's international friendly between Australia and New Zealand. A crowd of 10,779 saw Australia win 2-1 with two stoppage time goals.\nConstruction\nConstruction of the stadium, carried out by BESIX Watpac, began on 18 August 2017, and was completed in February 2020.\nBESIX Watpac set out with an Indigenous participation goal of 6.6%. This figure almost doubled to 11.9%, equating to more than 122,065 hours undertaken by the Aboriginal workforce.\nThe project won three awards at the 2020 Master Builders Queensland construction awards for North Queensland: Project of the Year award, Best Sporting Facilities award and Excellence in Workplace Health & Safety.\nName\nIn 2014, a funding proposal was released that suggested the stadium should officially be known as Stadium Northern Australia. Plans released in December 2016 revealed the stadium would be known as North Queensland Stadium.\nIn June 2019, expressions of interest were sought for naming rights to the stadium.\nOn 12 December 2019, Queensland Country Credit Union were announced as official naming rights sponsor of the stadium, with the venue to be commercially known as Queensland Country Bank Stadium.\nTransport\nA new pedestrian bridge over Ross Creek from Blackwood Street is the planned connection between the Townsville CBD and the stadium. A pedestrian bridge over Ross Creek already exists 200 metres south of the project site on Fletcher Street. The Townsville Railway Station is located approximately 300 metres from the Fletcher Street pedestrian bridge and 500 metres from the stadium site.\nThe new Reid Park bridge was constructed over the rail line simultaneously with the construction of the stadium to facilitate pedestrian movement. The project was praised by Member for Townsville Scott Stewart as being \"crucial to ensure the efficient operation of North Queensland Stadium.\"\nSeveral bus stops also surround the stadium site, with a new main city bus terminal located in Ogden Street, Townsville City.\nSports\nRugby League\nNorth Queensland Stadium has been the permanent home ground of the North Queensland Cowboys men's team since 2020 and hosted some home games for the women's team since 2023. Additionally, it hosted the men's and women's 2021 All Stars match, the first game of the 2021 State of Origin series and two finals matches in the 2021 NRL season. In 2023, the stadium hosted the second Women's State of Origin game and matches in the Pacific Championships. In 2024, it will host the 2024 All Stars match and Game 3 of the 2024 Women's State of Origin was played here.\n{| class=\"wikitable\"\n|+ Non-Cowboys rugby league matches\n! Date\n! Home\n! Result\n! Away\n! Attendance\n! Part of\n|-\n| rowspan=\"2\" | 20 February, 2021\n|  Indigenous All Stars\n| 0-24\n|  Māori All Stars\n|\n| rowspan=\"2\" | 2021 All Stars match\n|-\n|  Indigenous All Stars\n| 10-10\n|  Māori All Stars\n| 20,206\n|-\n| 9 June, 2021\n|  Queensland\n| 6-50\n|  New South Wales\n| 27,533\n| 2021 State of Origin series\n|-\n| rowspan=\"2\" | 11 September, 2021\n|  Sydney Roosters\n| 25-4\n|  Gold Coast Titans\n| rowspan=\"2\" | 18,244\n| rowspan=\"2\" | 2021 NRL Finals Series\n|-\n|  Penrith Panthers\n| 10-16\n|  South Sydney Rabbitohs\n|-\n| 22 June, 2023\n|  Queensland\n| 14-18\n|  New South Wales\n| 18,275\n| 2023 Women's State of Origin\n|-\n| rowspan=\"2\" | 14 October, 2023\n|  Australia\n| 16-10\n|  New Zealand\n| 12,067\n| rowspan=\"2\" | 2023 Rugby League Pacific Championships\n|-\n|  Australia\n| 38-12\n|  Samoa\n| 18,144\n|-\n| rowspan=\"2\" | 16 February, 2024\n|  Indigenous Women's All Stars\n| 26-4\n|  Māori Women's All Stars\n|\n| rowspan=\"2\" | 2024 All Stars match\n|-\n|  Indigenous All Stars\n| 22-14\n|  Māori All Stars\n| 15,579\n|-\n| 27 June, 2024\n|  Queensland\n| 22-6\n|  New South Wales\n| 22,819\n| 2024 Women's State of Origin\n|}\n; Notes\n:\nAssociation Football\nOn 4 March 2020, it was announced that A-League side Brisbane Roar would play against Premier League club Crystal Palace on 11 July 2020. This was however indefinitely postponed due to the COVID-19 pandemic. In April 2022, it was announced that Brisbane Roar would play a friendly against Premier League club Aston Villa, which took place on 20 July 2022 with the English club winning 1–0.\nOn 8 April 2022, the stadium hosted a women's international friendly between Australia and New Zealand, with Australia winning 2-1.\n{| class=\"wikitable\"\n! Date\n! Home\n! Result\n! Away\n! Attendance\n! Part of\n|-\n| 8 April, 2022\n|  Australia\n| 2-1\n|  New Zealand\n| 10,779\n| Friendly\n|-\n| 20 July, 2022\n|  Brisbane Roar\n| 0-1\n|  Aston Villa\n| 7,468\n| Queensland Champions Cup\n|}\nRugby Union\nIn August 2021, it was announced that on Saturday 25 September, the Springboks and All Blacks would play their historic 100th test at North Queensland Stadium. The game, won by New Zealand formed part of a double header at the stadium with Australia also playing against Argentina. These games were part of the 2021 Rugby Championship.\nIn 2023, Super Rugby club the Queensland Reds announced they would take two games to the stadium as part of their 140-year anniversary season.\nThe 2023 Super W final was also held at the venue where the Queensland Reds lost 38-30 to the Fijian Drua.\n{| class=\"wikitable\"\n! Date\n! Home\n! Result\n! Away\n! Attendance\n! Part of\n|-\n| 29 May, 2021\n|  Reds\n| 40-34\n|  Chiefs\n| 9,238\n| Super Rugby Trans-Tasman\n|-\n| rowspan=\"2\" | 25 September, 2021\n|  New Zealand\n| 19-17\n|  South Africa\n| rowspan=\"2\" | 23,184\n| rowspan=\"2\" | 2021 Rugby Championship\n|-\n|  Australia\n| 27-8\n|  Argentina\n|-\n| 25 February, 2023\n|  Reds\n| 13-47\n|  Hurricanes\n| 8,433\n| rowspan=\"2\" | 2023 Super Rugby Pacific season\n|-\n| 6 May, 2023\n|  Reds\n| 24-32\n|  Waratahs\n| 5,942\n|-\n| 6 September, 2025\n|  Australia\n| 28-24\n|  Argentina\n| TBA\n| 2025 Rugby Championship\n|}\nBoxing\nThe stadium hosted Tim Tszyu's Super Welterweight bout with Jeff Horn for the IBF Australasian Super Welter & WBO Global Super Welter titles on August 26, 2020.\nTszyu won the fight by TKO after Horn failed to return from his corner to start the 9th round.\nConcerts\n{| class=\"wikitable sortable\"\n!Date!!Performer(s)!!Attendance\n!Notes\n|-\n|style=\"text-align: left;\"|29 February 2020\n|style=\"text-align: left;\"|Elton John\n|style=\"text-align: left;\"|20,000\n|\n|-\n|22 March 2024\n|P!nk\n| -\n|\n|-\n|23 March 2024\n|P!nk\n| 60,100\n|Combined attendance across two nights\n|}\nAccessibility\n{| align=\"center\" class=\"wikitable\"\n|-\n| Walking||Pedestrian access\n:* Queensland Country Bank Stadium is within walking distance of the CBD area of Townsville.\n|-\n| Bus|| Bus access\n:* Queensland Country Bank Stadium is close to bus-stops in the CBD and the Townsville City Bus Hub a short distance across Lowths Bridge in Ogden Street.\n::* Frequent shuttle bus services are provided by Translink on match days and for special events.\n|-\n||Car||There is no public parking at the Stadium except for disability parking available by arrangement. However, paid parking stations are available within 5-minute walking distance in the CBD and park 'n' ride facilities are set up at Townsville Showgrounds/Lou Litster Park and Reid Park.\n|}\nStatues\n{| class=\"wikitable sortable\"\n|-\n!width=175| Statue\n!width=175| Sport\n!width=175| Unveiled\n!width=175| Location\n!width=50| Link\n|-\n| Jonathan Thurston\n| Rugby League\n| 13 March 2020\n| Outside gate A\n| [http://statements.qld.gov.au/Statement/2020/2/21/johnathan-thurston-statue-unveiled-at-new-townsville-stadium]\n|}\nGallery\nFile:Queensland Country Bank Stadium on a non game day.jpg|Southern Entrance June 2020\nFile:Townsville Waterfront and QCB Stadium.jpg|Stadium viewed from the Waterfront\nFile:Queensland Country Bank Stadium at night in June 2020.jpg|6 June 2020 illuminated for Queensland Day\nFile:QCB Stadium illuminated for the Cowboys vs Cronulla Sharks Game in June 2020.jpg|Illuminated for Cowboys vs Cronulla Sharks game\nFile:Queensland Country Bank Stadium at night in June 2020 from the Fletcher Street Bridge.jpg|Viewed from the Fletcher Street Bridge\nFile:Townsville Waterfront Boardwalk.jpg|Stadium viewed from the Waterfront on a Winter's day\nFile:NQ Stadium from Castle Hill.jpg|Stadium viewed from the top of Castle Hill\nReferences"
    }
  ]
}