{
  "content": [
    {
      "type": "text",
      "text": "# North-West Rebellion\n\n| image             =\n| caption           = Top: Battle of BatocheBottom: Battle of Cut Knife\n| causes            =\n| date              = March 26 – June 3, 1885 ()\n| place             = Present-day Saskatchewan and Alberta\n| result            = Federal government victory\n| territory         =\n| combatant1        =\n| combatant2        =  Provisional Government of Saskatchewan (Métis)\n* Cree–Assiniboine}}\n| commander1        =\n| commander2        =\n* Gabriel Dumont\n* Honoré Jackson\n* Big Bear\n* Fine Day\n* Wandering Spirit\n* Poundmaker\n* White Cap}}\n| strength1         = }}\n| strength2         =\n* 250 Cree–Assiniboine}}\n| casualties1       =\n* 141 wounded\n* 11 civilians killed}}\n| casualties2       =\n* 48 Métis wounded\n* 10–17 Cree dead\n* 78–103 Cree wounded\n* 1 Nez Perce death (at Cut Knife Hill)}}\nTotal (military):\n}}\nThe North-West Rebellion (), was an armed rebellion of Métis under Louis Riel and an associated uprising of Cree and Assiniboine mostly in the District of Saskatchewan, against the Canadian government. Important events included the Frog Lake incident, and the capture of Batoche.\nThe North-West Rebellion began in March 1885 after Louis Riel returned from political exile in the U.S. With the assistance of Métis leader Gabriel Dumont, Riel declared a provisional government on March 18, and rebel territory was carved out. As government forces responded, fighting broke out, with the last shooting over by the end of June.\nRebel forces included roughly 250 Métis and 250 First Nations men, largely Cree and Assiniboine, who were led by Big Bear and Poundmaker and other First Nations chiefs. A non-Indigenous man, Honoré Jackson, served as Riel's secretary. Defence of the government of Canada depended on a force of 5,500 men, including North-West Mounted Police, armed loyal residents of the North-West Territories, and Canadian militia units from Ontario and Quebec, brought west by train.\nRiel's rebels seized many small settlements in what is now the provinces of Alberta and Saskatchewan, including Fort Carlton, Fort Pitt, Battleford and Frog Lake. They won victories at Duck Lake and Fish Creek. But overwhelming government forces and a critical shortage of supplies wore down the rebels. Government forces finally quashed the rebellion by winning the Battle of Batoche.\nCree and Assiniboine fighters suffered from the same imbalance and, despite achieving limited victories at Cut Knife, Frenchman's Butte and Loon Lake, surrendered in June and early July. Following the defeat of Indigenous forces, several chiefs were put on trial, found guilty and served prison time. Eight Indigenous men were hanged in Canada's largest mass hanging, for murders committed outside the military conflict. Following the end of the Rebellion, Louis Riel was captured, put on trial, and convicted of treason. Despite pleas for clemency from many across Canada, he was hanged.\nNomenclature\nThe conflict is referred to by several names, including the North-West Rebellion, the North-West Resistance, the 1885 Resistance, the Northwest Uprising, the Saskatchewan Rebellion, and the Second Riel Rebellion. The conflict, grouped with the Red River Rebellion, is collectively referred to as the Riel Rebellions.\nThe terms rebellion and resistance can be used almost synonymously. Academics state the use of one term or the other changes the perspective of how a conflict is understood. Indigenous studies scholars and many historians refer to Indigenous uprisings in reaction to European colonization as resistances—Indigenous nations self-governed the land before the Hudson's Bay Company (HBC) and then the Canadian government exerted its sovereignty over it. Use of the term resistance has spread to several organizations and publications - Canadian Geographic, The Canadian Encyclopedia, and the Provincial Archives of Saskatchewan.\nBackground\nAfter the Red River Rebellion of 1869–1870, many Métis moved from Manitoba to the Fort Carlton region of the North-West Territories, where they founded the Southbranch settlements of Fish Creek, Batoche, St. Laurent, St. Louis, and Duck Lake on or near the South Saskatchewan River. In 1882, surveyors began dividing the land in the newly formed District of Saskatchewan according to the Dominion Land Survey's square township system. The established Métis farms were laid out in the seigneurial system, narrow strips stretching up from a river. The Métis were familiar with this system from their French-Canadian culture. After the experience of the 1869 Red River rebellion, surveyors were allowed to make exceptions to the standard survey practice, to accommodate pre-existing riverlot farms within two kilometres of a river. But that was scant consideration of the old-time communities. Outside accepted riverlot groupings, the survey imposed a standard  grid on the land, allocating particular numbered sections in each township to the HBC and the Canadian Pacific Railway (CPR).\nThe 36 families of the St. Louis settlement found, after the Dominion Land Survey was done, that the Crown had sold their farms and the village site, which included a church and a school (in Township 45, Range 7 west of the 2nd Meridian of the Dominion Land Survey), to the Prince Albert Colonization Company. The families feared the loss of their homes and farms, which, now that the buffalo herds were gone, was their primary source of sustenance.\nIn 1884, the Métis in the Southbranch settlements (including many Anglo-Métis) sent a delegation to ask Louis Riel to return from the United States, where he had fled after the Red River Rebellion, to appeal to the government on their behalf. He came and sent an appeal to the government. The government gave a vague response. The following year, on March 8, 1885, Riel and other prominent Métis at Batoche passed a 10-point \"Revolutionary Bill of Rights\" that asserted Métis rights of possession to their farms and demanded, among other things, that the government establish an office dealing with land issues in the North-West.\nOn March 18, 1885, Riel, Gabriel Dumont, Honoré Jackson (a.k.a. Will Jackson), and others took the seminal step of setting up the Provisional Government of Saskatchewan, believing they could influence the federal government in the same way as they had in 1869.\nspurred Big Bear, a Cree chief, to embark on a diplomatic campaign to renegotiate the terms of the treaties.]]\nBut much had changed since the Red River Rebellion. A railway had been completed across the prairies in 1883, though sections were not yet completed north of Lake Superior in Northern Ontario and in the Rockies. Even in its uncompleted state, the CPR eased the transit of government troops to Qu'Appelle. Qu'Appelle was more than  from Toronto and  in direct line from Batoche.\nThe North-West Mounted Police (NWMP), created in 1874, served as an armed force as well. Its local detachments provided government presence at some trouble spots, at least potentially protected vulnerable settlements, and also provided guidance and local knowledge to the neophyte Ontario and Quebec militia troops.\nAs violence broke out, it became clear that English-speaking settlers on the prairies and the great majority of First Nations did not support Riel. Catholic officials saw as heresy Riel's claim that God had sent him back to Canada as a prophet, and they tried to minimize his support. Catholic priest Albert Lacombe worked to obtain assurances from Crowfoot that his Blackfoot warriors would not participate in a conflict.\nThe First Nations were also frustrated at conditions at the time. By the end of the 1870s, the stage was set for discontent among the Indigenous people of the prairies: fur-animals and bison were scarce (causing enormous economic and food supply difficulties) and, in an attempt to assert control over Indigenous population, federal government officials sometimes held back rations, violating the terms of the treaties it had signed just prior.\nFirst Nations' dissatisfaction with the treaties and rampant poverty spurred Cree chief Big Bear to embark on a diplomatic campaign to renegotiate the terms of the treaties. (The timing of this campaign coincided with widespread frustration among Métis but it seems the Cree and Métis did not act in unison.)\nSome Cree took violent action in the spring of 1885, when the rebellion of Riel and the Métis was happening at same time, but at least one researcher states that they were almost certainly unrelated. In both the Frog Lake Massacre and the Looting of Battleford, small dissident groups of Cree men revolted against white authorities, ignoring the leadership of Big Bear and Poundmaker. Although he quietly signalled to Ottawa that these two incidents were the result of desperate and starving people and were, as such, unrelated to the ongoing Métis rebellion, Edgar Dewdney, the lieutenant governor of the North-West Territories, publicly claimed that the Cree and the Métis had joined forces.\nDemographics\n}}\nThe 1885 census of Assiniboia, Saskatchewan and Alberta reported a total population of 48,362. Of this, 20,170 people (about 40 percent) were Status Indians.\nThe District of Saskatchewan, part of the North-West Territories in 1885, was divided into three sub-districts and had a population of 10,595. To the east, the Carrot River sub-district with 1,770 people remained quiet. The Prince Albert sub-district in the centre of the district had a population of 5,373 which included the Southbranch settlements with about 1,300. The South branch settlement was the centre of Louis Riel's Provisional Government of Saskatchewan during the conflict. To the west, the Battleford sub-district where the Cree uprising of people in bands led by Poundmaker and Big Bear occurred, had 3,603 people.\nThe largest settlement and the capital of the district was Prince Albert with about 800 people followed by Battleford with about 500 people who were \"divided about equally between French, Métis and English\".\nThe Métis population in Saskatchewan in 1885 was about 5,400. A majority tried to stay neutral in the dispute with the national government, as the priests recommended. About 350 armed men supported Riel. A smaller number opposed him, led by Charles Nolin. In addition, he had the support of a small number of members of First Nations. Riel's supporters included the older, less assimilated Métis, often with close associations with the First Nations population. Many moved back and forth into First Nations communities and preferred to speak Indigenous languages more than French. Riel's opponents were younger, better educated Métis; they wanted to be more integrated into Canadian society, not to set up a separate domain as Riel promised.\nThe course of the rebellion and its suppression\nOn March 18, 1885, Riel, Gabriel Dumont, Honoré Jackson (a.k.a. Will Jackson), and others set up the Provisional Government of Saskatchewan. Riel had been invited in to lead the movement but he turned it into a military action with a heavily religious tone, thereby alienating the Catholic clergy, the whites, nearly all of the First Nations, and most of the Métis. He had a force of a couple hundred Métis and a smaller number of First Nations at Batoche in May, confronting isolated groups of armed settlers, HBC trading posts and NWMP detachments, and  two small militia units at Winnipeg.\nReports of the provisional government were discredited at Ottawa and at first thought to be a device of the Liberal party, but on March 23 Prime Minister Macdonald publicly confirmed the news of the rebellion. Immediately the federal government sent Major General Frederick Middleton, the commander of the Canadian Militia, to Winnipeg, where a militia unit, the 90th Winnipeg Rifles, and a militia artillery unit, the Winnipeg Field Battery, already existed. Eventually, over a period of many weeks, Middleton brought 3,000 troops to the West, and incorporated another 2,000, mostly English-Canadian volunteers, and 500 North-West Mounted Police into his force. They were formed into three columns that independently marched north from the line of the CPR.   broke out between the Canadian Militia, the North-West Mounted Police (NWMP), and Métis and aboriginal warriors.]]\nHearing that rebels had seized Duck Lake, a settlement near Batoche, a force of 90 Prince Albert Volunteers and North-West Mounted Police, led by their superintendent Leif Newry Fitzroy Crozier, set off from Fort Carlton on March 26 to confront the rebels. They were stopped and turned back by 150 to 200 Métis and Aboriginal fighters, under the command of Gabriel Dumont, in the Battle of Duck Lake.\nOn March 30, a group of armed Cree, short of food due to declining bison populations, approached Battleford. The inhabitants fled to the nearby North-West Mounted Police post at Fort Battleford. The Cree then took food and supplies from the abandoned stores and houses.\nIn March, Fort Carlton was destroyed by fire accidentally as it was being evacuated.\nGovernment mobilization\nAfter the declaration of a provisional government, lawlessness in the Batoche area and the Battle at Duck Lake, the government immediately commenced the mobilization of some of Canada's ill-equipped part-time militia units (the Non-Permanent Active Militia), as well as the units of cavalry, artillery and infantry regulars that made up the tiny Permanent Active Militia, Canada's almost-nonexistent regular army. on the march towards the conflict, near the Qu'Appelle Valley.]]\nBy March 30, after hasty mobilization in Toronto, two trains containing the 10th Royal Grenadiers and Queen's Own Rifles militia battalions were ready to leave Toronto. Other militia units, the 9th Voltigeurs from Quebec City and the 65th Mount Royal Rifles from Montreal, were also quickly mobilized. Soon every major city in the East was the scene of embarkation for inexperienced young militiamen cheered by immense crowds.\nMany of the soldiers suffered from the winter weather during the transit to the trouble spot. The militia struggling westward had to contend with the many large breaks in the CPR line in northern Ontario. They marched through snow or were carried in exposed sleighs. They rode on rustic railway flatcars over the completed stretches of track, which did not shelter them from the cold. During the campaign the troops dealt with snow, muskeg and black mud.\nEnlistment and popular engagement in the suppression of the rebellion rose after several non-combatants were killed at Frog Lake. On April 2, at Frog Lake, District of Saskatchewan (now in Alberta) a Cree raiding party led by Cree war chief Wandering Spirit, attacked local officials in the small settlement. Wandering Spirit's men were angered by what seemed to be unfair treaties and the withholding of vital provisions by the Canadian government, and also by the dwindling buffalo population, their main source of food. The attack was made against the leadership of Big Bear, following the arrival of news of the Métis victory at Duck Lake. Gathering the white settlers in the area into or near the local church, they killed Thomas Quinn, the town's Indian agent, after a disagreement broke out. The Cree then killed eight more and took three hostages. When the conflict was over, the government hanged Wandering Spirit and several others for what they had done at Frog Lake.\nThe Canadian Militia was commanded by Major General Frederick Middleton, who had had previous experience imposing imperial rule over the Maori and Indian Mutineers. Middleton assembled a force that detrained from CPR trains at Qu'Appelle and then moved north toward Batoche. His column left from Qu'Appelle on April 6 and arrived at Batoche a month later, on the way fighting the Battle of Fish Creek 26&nbsp;km from Batoche.\nMeanwhile, a force commanded by William Otter detrained at Swift Current and proceeded north to restore order at Battleford, fighting the Battle of Cut Knife on the way\nwas a major Métis victory, persuading Major General Frederick Middleton to temporarily halt his advance.]]\nOther forces were formed in the West. The Alberta Field Force led by Thomas Bland Strange, assembled at Calgary, moved north on the Calgary and Edmonton Trail to secure Edmonton from attack, then went down the North Saskatchewan River to secure Victoria Settlement, recapture Fort Pitt, then moved overland in pursuit of Big Bear's band.\nApril–May Métis and First Nations victories\nOn April 15, 200 Cree fighters descended on Fort Pitt. They intercepted an NWMP scouting party, killing Constable Cowan, wounding another, and captured a third. Surrounded and outnumbered, garrison commander Inspector Francis Dickens, son of the famous author, negotiated with the attackers and capitulated. Big Bear allowed the remaining police officers to leave safely. Inspector Dickens and his officers reached safety at Battleford six days later. The Cree fighters kept the townspeople as hostages, taking them to their camp at Frog Lake, and after a second raid in May, destroyed the fort. (A militia patrol at Fort Pitt on May 25 encountered a Native man named Ma-ma-nook, a resident of Saddle Lake who was well known in Edmonton, wearing Cowan's tunic and carrying his rifle. The patrol killed him when he did not stop at their command.)\nCree insurgents looted Hudson's Bay Company posts at Lac la Biche and Green Lake on April 26. The HBC post at Lac La Biche was pillaged. Fort Victoria (Pakan) was attacked but the attack was thwarted.\nBy April 24, Middleton's column had made a gradual but unopposed advance to Fish Creek only 26&nbsp;km from Batoche. That day 200 Métis achieved a remarkable victory over Middleton's column numbering 900 soldiers. The reversal, though not decisive enough to alter the outcome of the war, temporarily halted the advance of Middleton's column toward Batoche. That was where the Métis made their final stand two weeks later.\nOtter's column, working toward Battleford, meanwhile also suffered a setback. The column, led by Lieutenant Colonel William Otter, attacked a sleeping Cree encampment on Cut Knife Hill 45&nbsp;km northwest of Battleford on May 2. Cree fighters under war chief Fine-Day successfully held off the soldiers in the Battle of Cut Knife. Despite its use of a Gatling gun, Otter's flying column of militia was forced to retreat. Big Bear did not fight in the battle and personally prevailed on the Cree fighters not to harass the retreating Canadian troops. Fine-Day was affiliated with the chief Poundmaker, who surrendered to government troops later that same month.\nEnding the Métis uprising\nOn May 12, Middleton's force captured Batoche itself. The greatly outnumbered but well-entrenched Métis fighters ran out of ammunition after three days of battle and siege. The Métis resorted to firing sharp objects and small rocks from their guns. They were finally killed or dispersed when Canadian soldiers advanced on their own and overran the Métis fighters in their rifle pits.\nRiel surrendered on May 15. Gabriel Dumont and other participants in the uprising escaped across the border to the Montana Territory of the United States. The defeat of the Métis and Riel's capture led to the collapse of the Provisional Government.\nEnding the Cree uprising\nwas a decisive victory for the Canadian militia, with the capture of Louis Riel, and the collapse of the Provisional Government of Saskatchewan.]]\nBut the capture of Batoche did not end the separate conflict with the Cree insurgents.\nOtter's column recovered from its defeat at Cut Knife Hill (today's Poundmaker Hill) and pressed on to secure Battleford from additional Cree raids. Poundmaker and several of the chiefs loyal to him marched into Battleford and surrendered on May 26.\nOn May 14 Major General Thomas Bland Strange led the Alberta Field Force, a mixed force of militia and an NWMP detachment from Calgary, eastwards down the North Saskatchewan, toward the scene of unrest. Part of his force was on barges; the rest on foot or horseback on shore. Conditions were unpleasant as it was cold and snowy. By May 25 the force was at Fort Pitt and Frog Lake. On May 28, the force came into contact with Big Bear's band who had been holding a Thirst Dance on a hill north of Fort Pitt, camped with hostages from Frog Lake and Fort Pitt. The soldiers advanced to attack, but fighters in the band won a battle at Frenchman's Butte, 43&nbsp;km northeast of Lloydminster, at the end of May. Big Bear's band pushed off to the north, and NWMP Major Sam Steele's mounted scouts followed the trail. Small battles took place when Strange's scouts journeyed to where Big Bear's soldiers had trenches between Frenchman's Butte and the Red Deer River, and again at Horse Lake, about 30 kilometres from Ft. Pitt.\nAt Loon Lake, about 60&nbsp;km northeast of Frenchman's Butte, on June 3, the scouts and Big Bear's band fought in the last armed engagement of the 1885 rebellion. That day Steele's scouts, numbering 65, caught up to Big Bear's force. Big Bear's fighters were almost out of ammunition. They released their hostages and fled across the lake at Steele Narrows, after a short exchange of fire, having suffered four shot and six drowned while trying to reach an island.\nDemoralized, defenceless, and with no hope of relief after Poundmaker's surrender, most of Big Bear's fighters surrendered over the next few weeks. On July 2 Big Bear voluntarily surrendered to NWMP Sargeant Smart, stationed at an NWMP post near the destroyed Fort Carlton.\nAftermath\n, a trial that sparked national controversy between English and French Canada.]]The conflict was Canada's first independent military action. It cost about $5&nbsp;million. Although it lost the Conservative Party most of its support in Quebec, at least temporarily, it secured anglophone control of the Prairies (following the Rebellion, no First Nations politician became premier until Wab Kinew in 2023). It also demonstrated the Canadian government was capable of decisive action.\nFor reason perhaps outside the context of the rebellion, the Liberal party remained popular on the Prairies at least among Métis and among the wave of immigrants that soon came to the Prairies. However, treaty Indians did not get the vote until much later.\nThe trial of Louis Riel occurred shortly after the rebellion, where he was found guilty of high treason, and hanged. His trial and execution sparked a national controversy between English and French Canada.\nPoundmaker and Big Bear were sentenced to prison.\nEight others were hanged in the largest mass hanging in Canadian history. These men, found guilty of murder outside of the military conflict, were Wandering Spirit, (Kapapamahchakwew) a Plains Cree war chief, Little Bear (Apaschiskoos), Walking the Sky (AKA Round the Sky), Bad Arrow, Miserable Man, Iron Body, Ika (AKA Crooked Leg) and Man Without Blood, for murders committed at Frog Lake and at Battleford (the murders of Farm Instructor Payne and Battleford farmer Barney Tremont).\nSettlers and former Native fighters came in conflict when settlers sought to reclaim looted property after the rebellion was quashed. Several Natives were killed in a confrontation at Battleford in late June.\nThe Canadian Pacific Railway (CPR) played a key role in the government's response to the conflict, as it was able to transport federal troops to the area quickly. While it had taken three months to get troops to the Red River Rebellion, the government was able to move forces in nine days by train in response to events in the North-West Territories. The successful operation increased political support for the floundering and incomplete railway, which had been close to financial collapse. The government authorized enough funds to finish the line. Thus, Prime Minister John A. Macdonald realized his National Dream of linking Canada across the continent.\nThe government addressed the critical food shortage of the Cree and Assiniboine by sending food and other supplies.\nAfter the fighting, new Territorial Council ridings were created, although still only covering specific areas of concentrated settlement. The North-West Territories election of 1885 was held. The Scrip Commission was dispatched to the District of Saskatchewan and to present-day Alberta to address Métis land claims.\nThe Saskatchewan Métis requested land grants; the government granted these to all by the end of 1887. The government resurveyed the official surveys to allow pre-existing Métis riverlots in accordance with their wishes. In 1888 Dominion Land Survey officials resurveyed townships in Range 42, 43, 44, and 45, land along the South Saskatchewan River that was historically Métis land. Portions of these townships were divided into riverlots. This new survey recognized the Métis' long-standing land use and addressed a key grievance of the local Métis.[https://gladue.usask.ca/node/2623] The Métis did not understand the long term value of their new land, however, and sold much of it to speculators who later resold it to farmers.\nThose who served with the Militia and NWMP during the conflict received the North West Canada Medal, established in September 1885.\nThe cause of the rebellion was soon subject of debate. Macdonald's government came in for heavy criticism.\nDuring the 1887 federal election, members of Sir Wilfrid Laurier's Liberal Party told the House of Commons that federal surveyors had \"mishandled western settlement\" and blamed the \"poor administration of Metis land claims\" for the 1885 rebellion. The federal Minister of the Interior investigated and had land surveyor William Pearce submit a report explaining the work of the surveyors.\nInternational reaction\nWhile the conflict was ongoing, the American and British press took note of the actions of both the Métis and the Canadian Government. Some newspapers, such as the Times and Guardian, wrote approvingly of the actions taken by the Canadian government.\nLong-term consequences\nThe French language and Catholic religion faced increasing marginalisation in both Saskatchewan and Manitoba, as exemplified by the emerging controversy surrounding the Manitoba Schools Question. Many Métis were forced to live on undesirable land, or in temporary locations such as road allowances, or in the shadow of Indian reserves (Métis did not have treaty status, like Treaty Indians did, so did not have any official right to land).\nRiel's trial and Macdonald's refusal to commute his sentence caused lasting resentment in Quebec, and led to a fundamental francophone distrust of anglophone politicians. French Canada felt it had been unfairly targeted.\nMemory\nIn the spring of 2008, Tourism, Parks, Culture and Sport Minister Christine Tell proclaimed in Duck Lake, that \"the 125th commemoration, in 2010, of the 1885 Northwest Rebellion is an excellent opportunity to tell the story of the prairie Métis and First Nations peoples' struggle with Government forces and how it has shaped Canada today.\"\n}}\nBatoche, where the Métis Provisional Government had been formed, has been declared a National Historic Site. Batoche marks the site of Gabriel Dumont's grave site, Albert Caron's House, Batoche school, Batoche cemetery, Letendre store, Dumont's river crossing, Gariépy's crossing, Batoche crossing, St. Antoine de Padoue Church, Métis rifle pits, and RNWMP battle camp.\nThe Royal Canadian Mounted Police training depot at Regina was established in 1874, and still survives. The RCMP chapel, a frame building built in 1885, is still standing. It was used to jail prisoners taken when the rebellion collapsed.\nOne of three Territorial Government Buildings still stands on Dewdney Avenue in the city of Regina. It was the site of Riel's trial, and where the drama the Trial of Louis Riel is still performed. Following the May trial, Riel was hanged November 16, 1885, at the North-West Mounted Police barracks in Regina. The RCMP Heritage Centre, in Regina, opened in May 2007. The Métis brought his body to Saint-Vital, his mother's home, now the Riel House National Historic Site, and then interred it at the Saint-Boniface Basilica in Manitoba, his birthplace, for burial. Highway 11, stretching from Regina to just south of Prince Albert, has been named Louis Riel Trail by the province; the roadway passes near locations of the conflict.\nFort Carlton Provincial Historic Site has been rebuilt as it had been ravaged by three separate fires. Big Bear (Mistahimaskwa) used the site in his initial negotiations for Treaty Six in about 1884, and finally, the following year he surrendered here after his engagement at Steele Narrows (Battle of Loon Lake).\nThe Prince Albert blockhouse was employed by the North-West Mounted Police on evacuating from Fort Carlton after the first fire.\nDuck Lake is home to the Duck Lake Historical Museum and the Duck Lake Regional Interpretive Centre, and murals that present the history of the conflict in the area. The Battle of Duck Lake, the Duck Lake Massacre, and a buffalo jump are all located here. The \"First Shots Cairn\" was erected on Saskatchewan Highway 212 as a landmark commemorating the scene of the first shots in the Battle of Duck Lake. Our Lady of Lourdes Shrine at St. Laurent north of Duck Lake is a local pilgrimage site.\nThe Battle of Fish Creek National Historic Site, the name has been changed to Tourond's Coulee / Fish Creek National Historic Site to preserve the battlefield of April 24, 1885, at la coulée des Tourond, Madame Tourond's home, early Red River cart Fish Creek Trail and the site of Middleton's camp and graveyard.\nis in the cemetery with the graves of those killed.]]\nThe Marr Residence is a municipal heritage property of Saskatoon which served as a field hospital for wounded soldiers during the conflict.\nFort Otter was constructed at Battleford's government house at the capital of the North-West Territories. Poundmaker was arrested at Fort Battleford and sentenced to prison. Eight First Nations men were hanged, five for murders in the Frog Lake Massacre, two for murders in the Battleford area, and one for the murder of a Mountie at Fort Pitt on April 15.  Fort Battleford has been declared a national historic site of Canada to commemorate its role as military base of operations for Cut Knife Hill and Fort Pitt, as a refuge for 500 settlers, and as battlefield itself (the Siege of Battleford).\nFort Pitt, the scene of the Battle of Fort Pitt, is a provincial park and national historic site where a National Historic Sites and Monuments plaque designates where Treaty Six was signed.\nFrog Lake Massacre National Historic Site of Canada, at Frog Lake, Alberta, is the location of a Cree uprising that occurred in the District of Saskatchewan, North-West Territories.\nFrenchman Butte, a national historic site of Canada, is the location of the 1885 battle between Cree and Canadian troops of Strange's Alberta Field Force.\n}}\nAt Cutknife are the world's largest tomahawk, the Poundmaker Historical Centre and Big Bear monument/cairn, which was erected by the Historic Sites and Monuments Board of Canada. There is also now, in the correct location, a cairn erected upon Cut Knife Hill, which is the viewing site of the Poundmaker Battle site and Battle River valley.\nThe Narrows between Makwa Lake and Sanderson Bay, in the Makwa Lake Provincial Park, was the site of the last engagement of the conflict, the Battle of Loon Lake. Steele Narrows Provincial Historic Park conserves the lookout point of a Cree burial ground.\nFort Ethier, a two-story log blockhouse built by Strange's Alberta Field Force in its march north to Edmonton, still stands near Wetaskiwin.[https://www.historicplaces.ca/en/rep-reg/place-lieu.aspx?id=5180]\n, Toronto. The monument commemorates militiamen that served in the conflict.]]\nThe members of the Canadian Militia are commemorated through a number of memorials in Canada, including the North-West Rebellion Monument in Queen's Park, in Toronto, Ontario, and The Volunteer Monument in Winnipeg, Manitoba. A statue for Wm. B. Osgoode and John Rogers, who fell in action at Cutknife Hill, also stands at the Cartier Square Drill Hall, in Ottawa, Ontario.\nHistoriography\nArthur Silver Morton, the University of Saskatchewan's first librarian, compiled many of the original manuscripts, transcripts, and photographs related to the 1885 conflict that were made available in 1995 as part of project funded by Industry Canada in 1995.\nCanadian historian George Stanley conducted research on the 1885 conflict and Louis Riel in the 1930s while completing his postgraduate degrees at Oxford University, where he published his 1936 book The Birth of Western Canada: A History of The Riel Rebellion. For more than five decades Stanley's 1936 The Birth of Western Canada was reprinted and used as a textbook. Stanley's 1936 book and the 1972 book published by his student Desmond MortonThe last war drum: the North West campaign of 1885 informed North-West Rebellion encyclopedia entries in the Canadian Encyclopedia and Encyclopedia Britannica. Stanley focused on the racial aspects of the rebellion. He demonstrated empathy with the plight of the Métis and First Nations, although in hindsight his work would now be described by many as both \"racist and close-minded\". Until the early 2000s, Stanley's served as the foundational textbook providing the accepted narrative on the events.\nThe next major academic work to treat the \"rebellion as a whole\" since Stanley's, was the 1984 publication Prairie Fire: The 1885 North-West Rebellion by historian Bob Beal and journalist Rod Macleod. They downplayed the event as local with \"no real legacy of bitterness in the West\". They describe it as an incident during the white settlers' occupation of the North-West Territories and government's imposition of their laws on the indigenous population.\nOn the centenary of the conflict, a conference entitled \"1885 and After: Native Society in Transition\" was held in May at the University of Saskatchewan. During the centenary, a number of articles and books were published on the topic including the five-volume The Collected Writings of Louis Riel by Stanley, Raymond Huel, Gilles Martel, and University of Calgary-based political scientist, Thomas Flanagan, and Flanagan's Riel and the Rebellion: 1885 Reconsidered. Flanagan spent much of his academic career focusing on issues related to the Métis and Louis Riel. Since the 1970s Tom Flanagan published numerous scholarly studies \"debunking the heroism of Métis icon Louis Riel, arguing against native land claims, and calling for an end to aboriginal rights.\"\nIn his 1987 publication Footprints in the Dust, Douglas Light focused on the local history of the region incorporating Métis and First Nation perspectives on events including accounts of everyday life. This was described as a \"valuable and distinctive contribution to rebellion historiography\".\nAt the University of Saskatchewan, Alan Anderson prepared a report on French settlements in Saskatchewan that informed relevant content in the online Encyclopedia of Saskatchewan, published in 2006 by the University of Regina's Canadian Plains Research Center.\nJ.R.Miller's 1989 Skyscrapers Hide the Heavens was described in a 2021 British Journal of Canadian Studies article as the \"first overall survey of Aboriginal–newcomer history in Canada\". Miller \"consistently highlighted the Aboriginal perspective\". By 2018, when the book was reprinted for the fourth time, the relationships between Indigenous peoples and settlers had evolved further driven by priorities, economic opportunities, collective action on the part of Indigenous communities, and changes in governments at the federal, provincial and territorial levels. Miller says that early relations between Indigenous people and Euro-Canadians were characterized by a mutuality and collaboration, with each remaining autonomous, especially in trading relationships and as military allies. Miller says that this mutuality \"held good for far longer than white historiography has tended to see. The mutuality collapsed through competition for resources particularly as agricultural settlers arrived in increasing numbers. In his chapter on the rebellion, Miller says that the way histories about the conflict have been written are based on \"a great deal of misunderstanding and myth-making\" and that there was no Indian rebellion in 1885.\nLawrence J. Barkwell's 2005 book Batoche 1885: The Militia of the Metis Liberation Movement was his first publication of biographies of participants in the Métis resistance. Barkwell is also the author of the 2011 305-page book Veterans and Families of the 1885 Northwest Resistance. He updated his \"1885 Northwest Resistance Movement Biographies\" in 2018 which lists the men and women who participated in the 1885 Northwest Resistance. Barwell's research, which is published by the Gabriel Dumont Institutean affiliate of the University of Saskatchewan and the University of Regina\"provides a more human face\" to the 1885 Resistance.\"\nIn fiction\n* Stewart Sterling's Red Trails (1935) depicted the pulp hero Eric Lewis, a Mountie of the Royal Northwest Mounted Police. He tries to keep \"peace and order\" during the North-West Rebellion, helped by Sergeant Tim Clone.\n* North West Mounted Police, by Cecil B. DeMille (1940). The film is about a Texas Ranger who joins forces with the North-West Mounted Police to put down the rebellion.\n* Buckskin Brigadier: The Story of the Alberta Field Force (1955), by Edward McCourt. A historical novel about the men of the Alberta Field Force and their experiences throughout the rebellion.\n* The Magnificent Failure (1967) by Giles Lutz is a historical novel of the North-West Rebellion.\n* Riel, Canadian made-for-TV film portraying both 1870 and 1885 rebellions, starring Christopher Plummer, William Shatner, Leslie Nielsen\n* The Temptations of Big Bear, by Rudy Wiebe, McClelland & Stewart, 1973\n* Lord of the Plains, by Albert Silver, c 1990, Ballantine Books. Spur Award Finalist. Focuses on Gabriel Dumont and his family.\n* The novel for young adults called Battle Cry at Batoche (1998), by B. J. Bayle, portrays the events of the North-West Resistance from a Métis point of view.\n* Song of Batoche, by Maia Caron (Ronsdale Press: 2017), a historical novel centered on the North-West Rebellion through the perspectives of Métis women, Gabriel Dumont, Louis Riel, and others involved.\nSee also\n* Index of articles related to Aboriginal Canadians\n* Military history of Canada\nReferences\nFurther reading\n*\n*\n* Barrett, Matthew. \"'Hero of the Half-Breed Rebellion': Gabriel Dumont and Late Victorian Military Masculinity.\" ''Journal of Canadian Studies/Revue d'études canadiennes 48#3 (2014): 79–107.\n*\n*\n*\n* , military history\n*\n*\n* Wade, Mason. The French Canadians; 1760–1967: vol 2: 1911–1967 (1968) pp 393–446 [https://www.questia.com/library/1220649/the-french-canadians-1760-1945 online]\n* Waite, Peter B. Canada 1874–1896'' (McClelland & Stewart, 1978), pp.&nbsp;146–174\n*  [https://web.archive.org/web/20160101062400/http://eds.b.ebscohost.com/ehost/detail/detail?vid=22&sid=4864117c-8199-4f9d-a176-4014f2489306%40sessionmgr114&hid=117&bdata=JnNpdGU9ZWhvc3QtbGl2ZQ%3d%3d#AN=15375040&db=ahl online]\n* , short summary of historians' views\n* Lee, David. \"The Metis militant rebels of 1885.\" Canadian Ethnic Studies/ Etudes Ethniques au Canada (1989) 21#3 pp 1+  [https://www.proquest.com/docview/1293192896 online]\n* Miller, J. R. \"From Riel to the Metis.\" Canadian Historical Review 69#1 (1988): 1–20\n* , historiography\n* Morton, Desmond. \"Image of Louis Riel in 1998,\" Canadian Speeches  (May 1998) 12#2 [https://www.questia.com/article/1G1-30185354/image-of-louis-riel-in-1998 online]\n*\n*\n* Stanley, George F.G. Louis Riel: Patriot or Rebel?  Canadian Historical Association Booklet No. 2 (1979) [https://web.archive.org/web/20150506211632/http://www.collectionscanada.gc.ca/obj/008004/f2/H-2_en.pdf online]\nExternal links\n* [http://www.metismuseum.ca/resource.php/11980 (Métis) Heroes of the 1885 Northwest Resistance. Summary of those Killed.]\n*\n* [http://www.canadianletters.ca/collections/all/collection/20470 Diary of Walter F. Stewart, a first hand account of a man who was there]\n* [http://esask.uregina.ca/management/app/assets/img/enc2/PDF/51C276D2-1560-95DA-430F6CC3E32921701.pdf Map of Battle Sites]\n* [http://library.usask.ca/northwest/background/chronol.htm Chronology of Events (The Northwest Resistance)]"
    }
  ]
}