{
  "content": [
    {
      "type": "text",
      "text": "# Northern theater of the American Revolutionary War after Saratoga__disambig_1\n\n| date              = 1778–1782\n| place             = New York, New Jersey, Pennsylvania, and New England\n| result            = American victory\n| combatant2        =  United States Vermont RepublicIroquois\n* Oneida\n| combatant1        = Iroquois\n* Mohawk\n* Seneca\n* Cayuga\n| commander2        = George WashingtonJohn SullivanJames ClintonJacob KlockAbraham Ten BroeckThomas Hartley\n| commander1        = Sir Henry ClintonFrederick HaldimandJohn ButlerWalter ButlerSir George CollierJoseph BrantSayenqueraghtaCornplanter\n| campaignbox       =\n}}\nThe northern theater of the American Revolutionary War after Saratoga consisted of a series of battles between American revolutionaries and British forces, from 1778 to 1782 during the American Revolutionary War. It is characterized by two primary areas of activity.  The first set of activities was based around the British base of operations in New York City, where each side made probes and counterprobes against the other's positions that sometimes resulted in notable actions. The second was essentially a frontier war in Upstate New York and rural northern Pennsylvania that was largely fought by state militia companies and some Indian allies on the American side, and Loyalist companies supported by Indians, British Indian agents, and occasionally British regulars. The notable exception to significant Continental Army participation on the frontier was the 1779 Sullivan Expedition, in which General John Sullivan led an army expedition that drove the Iroquois out of New York. The warfare amongst the splinters of the Iroquois Six Nations were particularly brutal, turning much of the Indian population into refugees.\nThe only other notable actions occurred in New England. A combined American-French attempt was made to drive the British out of Newport, Rhode Island. The Battle of Rhode Island ended badly when the French fleet abandoned the effort; the failure did some damage to American–French relations. In 1779, the British established a base on the Penobscot River in the District of Maine with the intent of establishing a Loyalist presence there.  The state of Massachusetts responded with the amphibious Penobscot Expedition, which ended in complete disaster.\nThe British continued a process of raiding the New England coastal communities. One such raid led to a skirmish at Freetown, Massachusetts, while others descended on Massachusetts and Connecticut coastal communities. In the 1781 Battle of Groton Heights, the British were led by Connecticut native Benedict Arnold, who did substantial damage to the town.\nBritish strategy after Saratoga\nAfter Lieutenant General John Burgoyne surrendered his army following the Saratoga disaster in October 1777, France entered the war in February 1778. Britain's historical rival recognized the United States and entered into a military alliance. The conflict was now transformed from a civil war between Britain and colonial American insurgents into a major international war in which Britain had no allies. France dispatched a fleet and army across the Atlantic to aid the Americans fighting for independence, in addition to pursuing military operations in the Caribbean and the East Indies.  France also applied pressure on its ally Spain to enter the war. Although this did not happen formally until 1779, Spanish actions in other theaters further stretched British military resources.\nThese major developments internally forced the British to take their focus from North America, moving troops, ships and resources to defend its valuable sugar-producing colonies in the Caribbean, India, Gibraltar, and other colonial possessions. It also now had to guard against a French invasion of Great Britain itself. In North America, the British strategically withdrew its troops from Philadelphia in 1778, and made New York City the headquarters for the North American theater of war.  The British then embarked on a strategy for the southern colonies, where they believed that Loyalists, many of whom were slaveholders, would actively support Britain.  The southern colonies of Georgia, North and South Carolina, and Virginia, where they believed Loyalist sentiment to be strong.  This activity formed the bulk of military activity in North America for the remainder of the war, but actions and forays occurred from British strongholds in Quebec, New York, Rhode Island, and Nova Scotia. With no European allies or mercenary soldiers to supplement the depleted British troops, the British began recruiting American Loyalists and Native allies in great numbers to make up for their lack of army troops.  They dispatched these irregular forces on raiding expeditions against Patriot settlements on the frontiers.  The British also launched raids and amphibious actions against the New England coastline.\nAmerican strategy after Saratoga\nAmerican military strategy widened to some extent following entry of France into the war.  The states were still dominated by the larger British army, which kept the Continental Army on the defensive outside Philadelphia and New York.  The British began withdrawing from Philadelphia early in 1778, and the arrival of a French fleet off Philadelphia in July increased prospects for offensive action.  While these large-scale actions occupied the army, militia and settlers on the northern and west frontiers of New York and Pennsylvania had to contend with incursions by Indians and Loyalists organized by the British out of posts in Quebec.\nSkirmishes around New York City\nEach side made probes or diversionary movements designed to keep the other side on edge and uncertain of its intentions.  General Clinton sent troops to \"clean out that nest of Rebel Pirates\" at Little Egg Harbor, New Jersey. In the Battle of Chestnut Neck on October 6, 1778 the British destroyed some American supplies, and on the 15th surprised Pulaski's Legion in the Little Egg Harbor massacre.  Apparently as a diversion to draw attention away from that raid, Clinton also sent troops into northern New Jersey.  During those movements, 12 companies of British light infantry led by Charles Grey surprised and slaughtered a sleeping company of American dragoons in the Baylor Massacre on September 27.\nIn May 1779 Clinton captured the outpost at Stony Point, New York, which guarded one side of a major crossing point on the Hudson River.  When he weakened this force to provide troops for William Tryon's coastal raids, Washington devised an attack to regain the position. In the Battle of Stony Point on July 16, the fort was stormed and captured by Anthony Wayne's light infantry. Clinton later withdrew his forces back to New York as part of the planning for the invasion of the southern states.  Later in 1779, Light Horse Harry Lee led American troops in a surprise raid on Paulus Hook in present-day Jersey City, New Jersey that weakened British control of northern New Jersey.\nIn early 1780, a British attack against an American outpost in Westchester County, New York resulted in about 50 American casualties and 75 captured in the Battle of Young's House.  The last notable action in the New York City area was an attempt by the British to regain control of northern New Jersey in June by attacking the main Continental Army camp at Morristown.  The first British-Hessian thrust by Wilhelm von Knyphausen was blocked at the Battle of Connecticut Farms on June 7. A second offensive by Knyphausen on June 23 was halted in the Battle of Springfield after stiff fighting when Nathanael Greene appeared on the scene with 2,000 troops. This put an end to British ambitions in New Jersey.\nOn 21 July 1780, Wayne with two Pennsylvania brigades and four cannons attacked a loyalist blockhouse at Bulls Ferry, New Jersey. In the Battle of Bull's Ferry, the 70 Tories endured an artillery barrage and repelled all American attacks, inflicting 15 killed and 49 wounded while suffering only 21 casualties.\nCoastal actions\nThe northern coast did not see a great deal of military action after 1777, although the British executed a series of raids against the coastal communities of Connecticut and Massachusetts, and there was occasional skirmishing.\nThe arrival off New York of a French fleet in July 1778 caused a flurry of activity.  Major General John Sullivan had earlier been sent to Rhode Island to organize an attack on British-occupied Newport.  The British raided his supply caches, as well as destroying military defenses and significantly damaging several communities on Mount Hope Bay.  Sullivan's efforts became part of the first major attempt at Franco-American cooperation after the idea of an attack on New York was rejected.  Marred by bad weather and poor communication, French troops arrived but were not used, and the Americans, while in retreat after a brief failed siege effort at Newport, fought an inconclusive battle with British forces in the Battle of Rhode Island.  General Clinton marshalled troops from New York intending to support the New York garrison, but he arrived off Newport after the Americans had been driven off.  Clinton instead ordered these troops on a raid (also led by General Grey) against New Bedford, Massachusetts and Martha's Vineyard in September.  He also ordered a series of raids on the Connecticut coast led by William Tryon in 1779.  The most devastating raid was against New London in 1781, led by turncoat British General Benedict Arnold.\nIn the summer of 1778 British military planners in London began to develop plans for a new Loyalist settlement in Penobscot Bay.  An expedition was organized in early 1779, and on May 30, a fleet carrying troops and supplies left Halifax, Nova Scotia.  Arriving about two weeks later, the British established a series of fortifications on the east side of the bay.  The State of Massachusetts organized an expedition to drive the British out with minimal support from the Continental Congress.  This expedition ended in disaster, with the entire fleet destroyed and nearly half the expedition's men killed, captured, or wounded.  It was the worst defeat of an American naval force until the 20th century.  Failure of the expedition was attributed to a lack of well-defined command between the land and naval components, and Commodore Dudley Saltonstall's unwillingness to engage the British fleet that arrived in relief.\nFrontier war\nExpanded Native American role\nIn the aftermath of the Saratoga campaign, a frontier war emerged.  Before Burgoyne's campaign, Quebec's Governor Guy Carleton had previously restricted their use in Quebec territory (which at that time encompassed the Iroquois lands that are now western New York, Ohio, and northwestern Pennsylvania).  Carleton was, however, ordered by Secretary of State Lord Sackville (who harbored an intense political and personal hatred for Carleton, and had denied him the command given to Burgoyne) to expand recruitment.  This Carleton did, encouraging and funding John Butler at Fort Niagara for the purpose.  Some of these recruits joined Burgoyne, while others joined Barry St. Leger on his equally unsuccessful Siege of Fort Stanwix in August 1777.  The bloody Battle of Oriskany, fought mainly between Native Americans on the British side and Tryon County militia accompanied by some Oneidas, exposed fractures within the Iroquois Confederacy and marked the start of a bloody intra-Iroquois civil war.\nAlthough there were still tribal interests that wanted to remain neutral, vocal advocates of war, including the Mohawk leader Joseph Brant, and the continued persuasion of John Butler (which included many presents and the use of liquor to weakening Native resolve), convinced many of the Iroquois, particularly the Senecas and Cayugas to take up arms for the British.  These forces were principally led by war chiefs leaders Cornplanter and Sayenqueraghta, although Brant led a contingent of Mohawks and a small force of Loyalists known as Brant's Volunteers.  Brant's recruitment of Loyalists sometimes put him at odds with the Butlers, who were also recruiting Loyalists for their ranger companies.\nRaiding in the valleys, 1778\nThese forces engaged in destructive raids on outlying settlements of New York and Pennsylvania in the Mohawk, Susquehanna, Delaware, and upper Hudson River valleys, known as the Burning of the Valleys. These raids aimed to destroy farms and crops and disrupt the flow of supplies to the American forces. These operations were primarily under the leadership of John Butler, his son Walter, or under the direction of one of the war chiefs.  They were supplied by the British in Quebec and sympathetic Loyalist and Indian communities.  These raids sometimes crossed into the territory of present-day Vermont, territory that was formally claimed by New York but had recently proclaimed independence from New York after many years of dispute.  The frontier settlers organized militia to defend themselves, and were supported by a few Continental Army Regiments based at Fort Schuyler, Cherry Valley, and the Wyoming Valley (now part of Pennsylvania but then disputed between that state and Connecticut).  These defenses were largely ineffective at preventing the raiders from acting, but communities were sometimes warned of impending attacks by friendly Oneidas, most of whom sided with the Americans.\nIn 1778, Brant recruited a mixed force of Loyalists and Iroquois, and started his frontier raids with an attack on Cobleskill, New York in May 1778, and the Senecas operated in the Susquehanna River valley, driving settlers out of present-day Lycoming County, Pennsylvania in a series of actions that became known as the Big Runaway.  The Butlers and Senecas joined forces in early July to attack the Wyoming Valley.  Although Brant was not present, atrocities claimed to have been committed there contributed to his reputation as a \"monster\", and the Seneca were outraged at false accusations that they had committed atrocities.\nBrant joined forces with some of Butler's Rangers to attack German Flatts in early September.  New York authorities responded to Brant's activities by destroying the Indian towns of Unadilla and Onaquaga in October; those towns had been used by Brant and the Butlers as bases of operation.  Brant, the Butlers and some Senecas joined forces to take revenge by participating in a major attack on Cherry Valley in early November in which as many as 30 non-combatants were slaughtered in the aftermath.  British forces from the Montreal area led by Major Christopher Carleton raided communities in the upper Hudson River valley in October.\nSullivan expedition, 1779\nThe brutal frontier warfare led to calls in the Continental Congress for the army to take an active role.  In 1779, Washington sent General John Sullivan on a punitive expedition to suppress Indian attacks.  Sullivan and his troops systematically destroyed evacuated Iroquois villages, successfully driving the Iroquois north into Quebec.  In the only major action in that expedition, Sullivan's forces defeated those of the Butlers and Brant in the Battle of Newtown.  Brant led raids that specifically targeted the villages of the Oneida and the Tuscarora, who also supported the American cause.  This destruction of Indian villages on both sides effectively depopulated much of the Iroquois territory as the survivors of the raids became refugees, but Sullivan's expedition failed in its objective of stopping or reducing the frequency of frontier attacks. In April, a few months prior to the Sullivan Expedition, American Colonel Van Schaick led an expedition of over 500 soldiers against the Onondagas, destroying several villages.\nRaiding continues\nThe Butlers continued to attack New York frontier areas while Brant became more active on the western front.  In early April 1782, Anne Hupp defended the fort of Miller's Blockhouse against a Shawnee Indian attack, for over 24 hours in 1782 while eight months pregnant, after her husband was murdered and scalped.\nEven after preliminary peace was agreed in 1782, Brant tried to continue the war, but was forced to abandon the effort when the British stopped supplying him.\nReferences\nExternal links\n* [https://web.archive.org/web/20100608052643/http://www.history.army.mil/reference/revbib/northo.htm Bibliography of Operations in the Northern Theater] compiled by the United States Army Center of Military History"
    }
  ]
}