{
  "content": [
    {
      "type": "text",
      "text": "# North Warnborough\n\n|official_name= North Warnborough\n|population=\n|shire_district= Hart\n|shire_county= Hampshire\n|region= South East England\n|constituency_westminster= North East Hampshire\n|post_town= HOOK\n|postcode_district= RG29\n|postcode_area= RG\n|dial_code= 01256\n|os_grid_reference= SU732515\n|london_distance= 38 miles\n}}\nNorth Warnborough is a village in the Hart district of Hampshire, England. It is in the civil parish of Odiham.   It is located less than  south of the town of Hook, on the opposite side of the M3 motorway, and just north-west of the village of Odiham. The Basingstoke Canal passes through the village, and the River Whitewater flows to the north.\nHistory\nHeld by King Harold before the Norman invasion of 1066, North Warnborough and Odiham had become a royal burgh by 1086. Half-way between Winchester and Windsor, the Saxon kings maintained a palace and lodgings in Odiham. By 1207 work had begun on Odiham Castle (known locally as King John's castle) in  of meadowland between North Warnborough and Greywell, the ruins of which stand by the canal, itself Greywell Fen Site of Special Scientific Interest (SSSI) and a unique conservation area.\nPart of house now known as Cruck cottage has timbers dated 1383/4.\nThe village once had two mills, with eight water mills recorded in the Odiham Hundred, as well as seven pubs.\nDescription\nNorth Warnborough consists of a conservation area, bounded by Mill Corner in the north and The Street in the south, lying to each side of the B3349 Reading to Alton road. The village's 40 listed buildings lie within the conservation area. There are also later housing developments with post-war housing beyond the southern boundary of the conservation area to the Odiham boundary and also in the Old Orchard. A detailed character appraisal was published by Hart District Council in 2009.\nNorth of the canal lies North Warnborough Green, another SSSI, including a ford.\nThe Lord Derby and The Anchor pubs remain. The Swan was destroyed by fire in September 2010 and the Jolly Miller is now pending change of use following a short period as 'The Chilli Pad' Thai restaurant. The Millhouse is a family restaurant.\nReferences\nExternal links"
    }
  ]
}