{
  "content": [
    {
      "type": "text",
      "text": "# Northeast Canyons and Seamounts Marine National Monument\n\n| coords_ref      =\n| map_image       = Northeast Canyons and Seamounts Marine National Monument map NOAA.png\n| map_alt         =\n| map_caption     =\n| location        = Atlantic Ocean\n| area            =\n| created         =\n| visitation_num  =\n| visitation_year =\n| governing_body  = U.S. Department of the Interior and U.S. Department of Commerce\n| website         =\n}}\nThe Northeast Canyons and Seamounts Marine National Monument is a marine national monument of the United States off the coast of New England, on the seaward edge of Georges Bank. It was created by President Barack Obama on September 15, 2016, as the first U.S. marine national monument in the Atlantic Ocean.\nThe area includes four underwater mountains and three deep-sea canyons. It is home to endangered whales and other rare species, some found nowhere else in the world.\nGeography and geology\nThe Northeast Canyons and Seamounts Marine National Monument is located within the New England and mid-Atlantic regions, 130 miles southeast of Cape Cod. It comprises a total area of 4,913 square miles, and protects four underwater seamounts (Bear, Mytilus, Physalia, and Retriever Seamounts) and three submarine canyons in the edge of the continental shelf (Oceanographer, Lydonia, and Gilbert).\nBiology and ecology\nThe area is home to rare and endangered species, including sperm whales, fin whales, sei whales and Kemp’s ridley sea turtles. According to marine scientists who have studied the area, it is an area of high biological diversity, containing many \"hot spots\" of seafloor and epipelagic life, as well as providing ecological connectivity across depths and along the continental margin. As such, it provides a relatively undisturbed reference site for future ecological research and on climate change impacts, promising many scientific discoveries.\nCreation\nPresident Barack Obama designated the Northeast Canyons and Seamounts Marine National Monument (NCSMNM) on September 21, 2016, by signing Proclamation 9496. This action was based on the power to proclaim national monuments granted by the U.S. Congress under the Antiquities Act of 1906 to the president. The Monument, which is located off the coast of New England, was the first fully protected marine reserve in the Atlantic Ocean.\nAccording to a White House press release, the Monument was created in response to half a century of calls to protect the area, due to its importance as a biodiversity hotspot, habitat for numerous rare and endangered species, and a valuable scientific and historical site.\nAccording to the Proclamation, the Northeast Canyons and Seamounts Marine National Monument is the smallest area feasible to provide necessary management; designating a smaller zone would lead to an inaccurate interpretation and protection of biodiversity within the fragile area. The designation of the Marine National Monument occurred after numerous meetings and deliberations with stakeholders including conservationists, community members, fishermen, and local businesses; administrative officials gathered social, economic, and environmental data to inform the creation of the Northeast Canyons and Seamounts Marine National Monument.\nResiding at depths of ~4,000 meters, deep sea corals and other foundational species are highly sensitive to anthropogenic disturbances such as bottom trawling and mining extractions. The objective of the Northeast Canyons and Seamounts Marine National Monument is to maintain biodiversity for research, while encouraging and providing support to fisheries to become more efficient, resilient, and sustainable. Within three years, following the creation of the Northeast Canyons and Seamounts Marine National Monument, NOAA and U.S. Fish and Wildlife Service will administer a management plan for the area, adapting to requests and changes. Under the monument's status, stakeholders would continue to be engaged throughout the process through meetings with administrators.\nThe final designation of the Northeast Canyons and Seamounts Marine National Monument protects 40% of the originally proposed area, after intense deliberation, considering equity to those affected. Areas within the Marine National Monument will remain open to recreational fishing and all military activity. Subsequent to the creation of the Marine National Monument, a 60-day transition period was allowed for all commercial industries, besides the Atlantic Lobster and Deep-Sea Red Crab fisheries, which were permitted to continue fishing in the area for seven years after the creation of the monument. In order to evolve fishing industries into sustainable businesses, the National Oceanic and Atmospheric Administration (NOAA) was tasked to provide commercial fisheries with access to updated vessels and equipment, increasing efficiency and minimizing cost, as well as beneficial services to commercial fisheries, such as stock assessments and marine surveys.\nThe monument area is also withdrawn from leasing for energy development. Two months after the monument's creation, President Obama also withdraw 26 additional canyons along the Outer Continental Shelf to the northeast and southwest of the monument from future mineral leasing.\nControversy over fishing restrictions\nFive commercial fishing industries, Massachusetts Lobstermen's Association, Atlantic Offshore Lobstermen's Association, Long Island Commercial Fishing Association, Garden State Seafood Association, and Rhode Island Fishermen's Alliance, took the creation of the Northeast Canyons and Seamounts Marine National Monument to court in early March 2017. They stated that President Obama did not have the right to designate the Marine National Monument under the Antiquities Act. In the case, ''Massachusetts Lobstermen's Association v. Wilbur Ross, the plaintiffs also argued that the 1906 Antiquities Act did not allow presidents to protect bodies of water, that the government lacked sufficient control of water many miles offshore, and that the nearly 5,000-square-mile monument was too large. Furthermore, in a legal document published on March 29, 2017, the fishermen argued that the restrictions on commercial fishing at the Monument was unlawful and harmful to their businesses.\nThe case, Massachusetts Lobstermen's Association v. Ross'', was decided by United States District Court for the District of Columbia Judge James E. Boasberg, who ruled on October 5, 2018, that the Monument complied with the law, rejecting the plaintiffs' arguments regarding presidential jurisdiction. Boasberg wrote, \"In all, plaintiffs offer no factual allegations explaining why the entire monument, including not just the seamounts and canyons but also their ecosystems, is too large...The Antiquities Act reaches lands both dry and wet\", which the Natural Resources Defense Council (NRDC) pointed out was consistent with Supreme Court's June 6, 2005 ruling in Alaska v. United States that it was \"clear\" that \"the Antiquities Act empowers the President to reserve submerged lands.\"\nIn December 2018 the plaintiffs appealed the ruling to the U.S. Court of Appeals for the D.C. Circuit. The U.S. Department of Justice filed a brief in support of the Monument on May 29, 2019. On December 27, 2019, the D.C. Court of Appeals upheld the lower court ruling on the same grounds, stating that federal law governing monuments did not apply solely to land, that the ocean was indeed within the jurisdiction of the federal government, and that restrictions placed on such areas were not required to be the \"smallest area compatible\" with management goals.\nThe U.S. Supreme Court declined to review the Court of Appeals decision on March 22, 2021.\nMonument modification\nOn June 5, 2020, President Donald Trump signed a proclamation purporting to lift the restrictions on commercial fishing at the Monument but without modifying the boundaries. Environmental organizations that had campaigned for creation of the monument filed suit immediately. The proclamation indicated that the boundaries of the Monument would not be affected. The proclamation also stated that \"appropriately managed commercial fishing would not put the objects of scientific and historic interest that the monument protects at risk,\" citing that many fish species used as justification for the original protections are highly migratory and that the Magnuson-Stevens Act, and other federal and state laws, provide sufficient protections. The proclamation was applauded by fishing industry advocates, such as the National Coalition for Fishing Communities.\nEnvironmental groups such as the NRDC and the Center for Biological Diversity criticized the Proclamation. The NRDC cited a July 23, 2018 Washington Post article that revealed that in 2017, the Trump administration’s staff intentionally concealed the fact that fishing vessels near the monument, in the words of the government, \"generated 5% or less of their annual landings from within the monument\", which undermined the administration's rationale for reversing the restrictions on commercial fishing. The NRDC also pointed out that the government's own data showed that revenues and catch in the relevant fisheries were higher or the same following the monument's designation. Gib Brogan, a fisheries analyst at Oceana, said, \"Today’s proclamation is another nail in the coffin for both productive fisheries and healthy oceans in New England.\" Additionally, a senior attorney for the Center for Biological Diversity, an organization that works to protect endangered species, said, \"Gutting these safeguards attacks the very idea of marine monuments.\"\nOn his first day in office, President Joe Biden signed an executive order, \"Protecting Public Health and the Environment and Restoring Science to Tackle the Climate Crisis.\" The president directed the heads of all federal agencies to review every policy adopted during the Trump administration that affects public health, protection of the environment, conservation of national treasures and monuments, and the promotion of environmental justice and climate change resilience. The Secretary of the Interior was directed to review the boundaries and conditions established for the Bears Ears, Grand Staircase-Escalante, and Northeast Canyons and Seamounts national monuments that had been modified by presidential proclamation in 2017 and 2020 and recommend presidential or other legal actions to restore the monument boundaries and conditions for access.\nOn October 8, 2021, President Biden restored the original protections for the national monument, prohibiting commercial fishing and phasing out crab and lobster fishing by 2023.\nSee also\n*List of national monuments of the United States\n*New England Seamounts\nReferences\nExternal links\n*  – NOAA\n*  – FWS\n*"
    }
  ]
}