{
  "content": [
    {
      "type": "text",
      "text": "# North Warwickshire and Bedworth (UK Parliament constituency)\n\n|frame-height=200|frame-width=250}}\n|caption     = Boundaries since 2010\n|image2      =\n|caption2    = Boundary of North Warwickshire and Bedworth in West Midlands region\n|year        = 1983\n|original_name = North Warwickshire\n|type        = County\n|elects_howmany = One\n|previous    = Meriden Nuneaton\n|year2       = 1832\n|abolished2  = 1885\n|type2       = County\n|elects_howmany2 = Two\n|previous2   = Warwickshire\n|next2       = Nuneaton  Rugby  Tamworth\n|electorate  = 70,245 (2023)\n|region      = England\n|county      = Warwickshire\n|towns = Atherstone, Bedworth, Coleshill and Polesworth\n|mp          = Rachel Taylor\n|party       = Labour Party (UK)\n}}\nNorth Warwickshire and Bedworth is a constituency represented in the House of Commons of the UK Parliament.\nBefore the 2023 Periodic Review of Westminster constituencies, the constituency was known as North Warwickshire with new name taking effect on the 2024 general election, with unchanged boundaries.\nConstituency profile\nWarwickshire North contained wards which are the most \"working-class\" (lowest average income) and industrial of the six constituencies in the county, politically frequently with the best returns locally for Labour candidates. In the 2010 election, all six Warwickshire constituencies were won by the Conservative party, though this constituency was the most marginal, falling on a substantial swing of 8.1% from Labour to the Conservatives (compared to a national swing of 5%).\nLike much of the county, the area includes many rural villages which can today be classified as 'commuter' and 'retirement', south of the National Forest, south east of Tamworth and the small cathedral city of Lichfield and centred less than  east of Birmingham, which provides some work locally in the creative and international export sectors. Many towns and villages have a history of coal mining and heavy industry, linked to a strong Labour vote.\nSettlements include Bedworth, just north of Coventry, and the historic market town of Atherstone.\nBoundaries\n1832–1885: The Hundred of Hemlingford, the County of the City of Coventry, and the Rugby and Kirby Divisions of the Hundred of Knightlow.\n1983–2010: The Borough of North Warwickshire, and the Borough of Nuneaton and Bedworth wards of Exhall, Heath, Mount Pleasant, and Poplar.\n2010–present:\n* The Borough of North Warwickshire wards of: Atherstone Central; Atherstone North; Atherstone South and Mancetter; Baddesley and Grendon; Coleshill North; Coleshill South; Curdworth; Dordon; Fillongley; Hurley and Wood End; Kingsbury; Newton Regis and Warton; Polesworth East; Polesworth West; Water Orton; and\n* The Borough of Nuneaton and Bedworth wards of: Bede; Exhall; Heath; Poplar; and Slough.\nThe 2023 Periodic Review of Westminster constituencies left the boundaries unchanged.\nThe constituency since 2010 has all but two wards of North Warwickshire.\nHistory\n1832–1885\nThe North Warwickshire constituency was created for the 1832 general election, when the Great Reform Act divided the former Warwickshire constituency into two new divisions: North Warwickshire and South Warwickshire.\nUnder the Redistribution of Seats Act 1885, North Warwickshire was abolished for the 1885 general election, when Warwickshire was divided into four new single-member constituencies: Rugby, Stratford-on-Avon, Nuneaton and Tamworth.\n1983–present\nThe second iteration of the North Warwickshire county constituency was created for the 1983 general election, replacing outlying parts of the Meriden and Nuneaton constituencies. The seat was won by Francis Maude of the Conservative Party at the 1983 general election, who held it until 1992, when it was taken by Mike O'Brien of Labour. Labour held the seat comfortably until 2010.\nOn 8 March 2007, former Army Officer and polar explorer Dan Byles was selected at an open primary to contest North Warwickshire for the Conservative Party. At the 2010 general election, Byles won the seat off Mike O'Brien by just 54 votes, making him the Conservative Member of Parliament with the smallest majority in the country. However, a strong Conservative performance during the latter part of the decade saw the seat become safer for the Conservatives – the result in 2019 being akin to a safe Conservative seat. This trend was reversed when the newly named seat was won by Labour's Rachel Taylor at the 2024 general election.\nMembers of Parliament\nMPs 1832–1885\n{| class=\"wikitable\"\n|-\n!Election!!colspan=\"2\"|First member!!First party!!colspan=\"2\"|Second member!!Second party\n|-\n| 1832\n|style=\"color:inherit;background-color: \" |\n|rowspan=\"3\"| William Stratford Dugdale\n| Tory\n|style=\"color:inherit;background-color: \" |\n| rowspan=\"2\" | Sir John Eardley-Wilmot, Bt\n| Tory\n|-\n| 1834\n|rowspan=\"2\" style=\"color:inherit;background-color: \" |\n|rowspan=\"2\"| Conservative\n|style=\"color:inherit;background-color: \" |\n| Conservative\n|-\n| 1843 by-election\n|rowspan=\"4\" style=\"color:inherit;background-color: \" |\n|rowspan=\"4\"| Charles Newdegate\n|rowspan=\"4\"| Conservative\n|-\n| 1847\n|style=\"color:inherit;background-color: \" |\n| Richard Spooner\n| Conservative\n|-\n| 1864 by-election\n|style=\"color:inherit;background-color: \" |\n| William Bromley-Davenport\n| Conservative\n|-\n| 1884 by-election\n|style=\"color:inherit;background-color: \" |\n| Philip Muntz\n| Conservative\n|-\n| 1885\n|colspan=\"6\"|Constituency abolished: see Nuneaton, Rugby, Stratford-on-Avon and Tamworth\n|}\nMPs 1983–2024\nMeriden and Nuneaton prior to 1983\n{| class=\"wikitable\"\n|-\n!colspan=\"2\"|Election!!Member}}\nElections in the 2010s\n}}\n9.0\n}}\n12.1\n}}\n2.3\n}}\n0.8\n}}\n21.1\n}}\n1.8\n}}\n10.5\n}}\n14.6\n}}\n2.9\n|percentage =38.9\n|votes = 18,350\n}}\n0.1\n}}\n0.1\n}}\n11.7\n}}\n3.7\n}}\n5.9\n}}\n}}\n2.1\n}}\n4.1\n}}\n|votes = 8,256\n|percentage = 17.4\n|change =  14.6\n}}\n9.5\n}}\n6.2\n}}\n0.2\n}}\n3.05\n}}\n}}\n8.2\n}}\n8.0\n}}\n1.9\n}}\n0.4\n}}\n0.1\n}}\n5.2\n}}\n8.1\n}}\nElections in the 2000s\n}}\n6.0\n}}\n0.4\n}}\n1.8\n}}\n0.6\n}}\n5.6\n}}\n2.0\n}}\n2.8\n}}\n}}\n4.3\n}}\n1.2\n}}\n4.0\n}}\n1.1\n}}\n5.5\n}}\n14.5\n}}\n2.75\n}}\nElections in the 1990s\n}}\n12.3\n}}\n13.4\n}}\n2.9\n}}\n24.7\n}}\n8.1\n}}\n12.9\n}}\n}}\n6.0\n}}\n1.5\n}}\n4.6\n}}\n2.9\n}}\n3.7\n}}\nElections in the 1980s\n}}\n3.1\n}}\n3.0\n}}\n6.1\n}}\n0.1\n}}\n1.9\n}}\n0.1\n}}\n}}\nElection results 1832–1885\nElections in the 1830s\n|votes = 1,854\n|percentage = 26.6\n|change = &minus;2.1\n}}\n|percentage =\n|change  =\n}}\n}}\nElections in the 1840s\n* Caused by Eardley-Wilmot's resignation after being appointed Governor of Tasmania\n|votes = 2,278\n|percentage = 29.8\n|change = New\n}}\nElections in the 1850s\n}}\n|votes = 2,038\n|percentage = 20.7\n|change =\n}}\nElections in the 1860s\n* Caused by Spooner's death.\nElections in the 1870s\n|votes = 3,189\n|percentage = 26.2\n|change = &minus;16.8\n}}\nElections in the 1880s\n}}\n* Caused by Bromley-Davenport's death.\nSee also\n* List of parliamentary constituencies in Warwickshire\n* List of parliamentary constituencies in West Midlands (region)\nNotes\nReferences\nExternal links\n* [https://mapit.mysociety.org/area/13274.html North Warwickshire UK Parliament constituency] (boundaries April 1997 – April 2010) at MapIt UK\n* [https://mapit.mysociety.org/area/66024.html North Warwickshire UK Parliament constituency] (boundaries April 2010 – May 2024) at MapIt UK\n* [https://mapit.mysociety.org/area/168838.html North Warwickshire and Bedworth UK Parliament constituency] (boundaries from June 2024) at MapIt UK"
    }
  ]
}