{
  "content": [
    {
      "type": "text",
      "text": "# Norton Fitzwarren\n\n|official_name            = Norton Fitzwarren\n|population               = 3,046\n|population_ref           = (2011)\n| unitary_england = Somerset Council\n| lieutenancy_england = Somerset\n|region                   = South West England\n|constituency_westminster = Taunton and Wellington\n|post_town                = TAUNTON\n|postcode_district        = TA2\n|postcode_area            = TA\n|dial_code                = 01823\n|os_grid_reference        = ST195255\n}}\nNorton Fitzwarren is a village, electoral ward, and civil parish in Somerset, England, situated  north west of Taunton. The village has a population of 3,046.\nHistory\nThe village is on the southern slope of Norton Camp, a large hillfort that shows evidence of occupation from neolithic times, through the Bronze Age, to the Roman occupation of Britain.\nThe Church of All Saints dates from the late 13th and early 14th century. It has been designated as a Grade II* listed building.\nThe parish of Norton Fitzwarren was part of the Taunton Deane Hundred.\nOn 23 November 2021 a double murder occurred in the village, involving a local IT teacher and coffee shop worker.\nGovernance\nThe parish council has responsibility for local issues, including setting an annual precept (local rate) to cover the council's operating costs and producing annual accounts for public scrutiny. The parish council evaluates local planning applications and works with the local police, district council officers, and neighbourhood watch groups on matters of crime, security, and traffic. The parish council's role also includes initiating projects for the maintenance and repair of parish facilities, as well as consulting with the district council on the maintenance, repair, and improvement of highways, drainage, footpaths, public transport, and street cleaning. Conservation matters (including trees and listed buildings) and environmental issues are also the responsibility of the council.\nFor local government purposes, since 1 April 2023, the village comes under the unitary authority of Somerset Council. Prior to this, it was part of the non-metropolitan district of Somerset West and Taunton (formed on 1 April 2019) and, before this, the district of Taunton Deane (established under the Local Government Act 1972). From 1894-1974, for local government purposes, Norton Fitzwarren was part of Taunton Rural District.\nIt is also part of the Taunton and Wellington county constituency represented in the House of Commons of the Parliament of the United Kingdom. It elects one Member of Parliament (MP) by the first past the post system of election.\nMilitary connections\n, home of 40 Commando, Royal Marines]]\nPoW camp\nIt was the location of a 300-man prisoner of war camp during World War II, initially housing Italian prisoners from the Western Desert Campaign, and later German prisoners after the Battle of Normandy. POW Camp Number 665 – 'Cross Keys Camp', Norton Fitzwarren.\nRoyal Marines\nJust north of the village is Norton Manor Camp, home of 40 Commando, Royal Marines. For many years it was the base of Junior Leaders Battalion, Royal Army Service Corps (until 1965 when RASC was disbanded) which became Junior Leaders Regiment, Royal Corps of Transport. From the early 1960s to the late 1970s, it took boys from age 15 yrs to age 17½ years and trained them to be army transport drivers.\nIndustry\nNorton Fitzwarren is located on the confluence of many fast flowing local water flows, and from the 1700s onwards became the base for many water-powered weaving mills, and after the riots in London, also many silk mills, which gave part of the area its name.\nFor many years Norton Fitzwarren was the site of the main factory of the Taunton Cider Company producing cider brands such as Blackthorn Cider. Production was moved to Shepton Mallet after Matthew Clark plc, the UK division of Constellation Brands, bought Taunton Cider in 1995.\nTransport\nis propelled (by GWR 4575 Class 5542) to the new  station on the heritage-West Somerset Railway]]\nworks]]\nNorton Fitzwarren was the site of a boat lift on the now disused section of the Grand Western Canal from 1839 to 1867.\nNorton Fitzwarren is on the former Bristol and Exeter Railway mainline, which was operated and then taken over by the  GWR in 1890. The station became an important junction station, with branch lines to  and  diverging at this point. Resultantly, the station had two island platforms creating four platforms. There were also extensive freight handling facilities, as the station was located west of the Fairwater Yard, a large regional freight yard located south of the mainline. During World War II, the United States Army took over Norton Manor Camp located immediately northwest of the station, and equipped it with extensive railway sidings, all connected to the station. The first major railway accident occurred on 10 November 1890, killing 10 people, and the second on 4 November 1940, which killed 27 people, many of them Royal Navy personnel returning from leave to Plymouth. In 2018 a plaque honouring the victims of both crashes was unveiled in the village.\nNorton Fitzwarren station closed in 1966, the same year that the British Army supply depot closed. Taunton Cider took over the former goods yard to the north of the site, but this also closed in the early 1990s, and has been redeveloped as housing. Most of the former Minehead branch is now operated by the West Somerset Railway as a heritage railway.\nSee also\n* Norton Camp Bronze Age hillfort\n* Norton Fitzwarren rail crash (1940)\n* Norton Fitzwarren rail crash (1890)\nReferences\nExternal links\n*[https://www.nortonfitzwarrenparishcouncil.com Norton Fitzwarren Parish Council]"
    }
  ]
}