{
  "content": [
    {
      "type": "text",
      "text": "# Norvell G. Ward\n\n|birth_place=Indian Head, Maryland, U.S.\n|death_date=\n|death_place=Atlantic Beach, Florida, U.S.\n|placeofburial=\n|image=1437784053829 Ward, Novell G.jpg\n|image_size=\n|caption=Ward in 1963\n|nickname=Bub\n|allegiance=\n|branch=\n|serviceyears=1931–1973\n|rank=   Rear admiral\n|commands=\n*\n*Submarine Squadron 14\n*Naval Advisory Group, MACV\n*Naval Forces Vietnam\n*Caribbean Sea Frontier\n*10th Naval District\n}}\n|unit=\n|battles=\n|awards=\n|relations=\n|laterwork=\n|spouse=Elizabeth Kearney Ward\n}}\nNorvell Gardiner Ward (30 December 1912 – 19 July 2005) was an American naval officer and a recipient of the Navy Cross. He was a submariner for most of his naval career, but was also known for his planning and war gaming abilities. As a  rear admiral he played a major role in planning and overseeing many naval operations during the Vietnam War, notably Operation Market Time.\nEarly life and education\nWard was born on 30 December 1912 in Indian Head, Maryland, the son of a civil service supervisor at the Naval Powder Factory. He received an appointment to the United States Naval Academy in 1931. During his senior year at the academy he was recognized as an all-American lacrosse player.\nCareer\nWorld War II\nDuring World War II, Ward was initially assigned to submarine  where he went on five patrols. In September 1942, Lieutenant Ward acted as assistant surgeon to Pharmacist Mate Wheeler Bryson Lipes, as Lipes performed an improvised emergency appendectomy on Seaman Darrell Rector. Ward held the incision open with spoons while Lipes worked. Rector survived the surgery. Ward served as executive officer of submarine  before assuming command of submarine  in May 1943.\nOn his first patrol, one ship of 900 tons was sunk, according to JANAC. On his second patrol in August 1943, one ship of 5,460 tons was sunk. On his third patrol in December 1943, two ships of 11,500 total tons were sunk. While on patrol from 14 June to 31 July 1944, Ward was able to sink eight Japanese ships in six \"well planned and executed\" torpedo attacks totaling more than 38,000 tons, which earned him a Navy Cross. JANAC later ruled that Ward's fourth patrol sank four ships of 20,000 total tons. After reassignment, Ward served as assistant operations officer on the staff of the commander of Pacific submarine forces for the remainder of the war.\nKorean War\nDuring the Korean War he asked for and received assignment as the commanding officer of the destroyer . This assignment lasted from 28 February 1951 to 18 June 1952 and was unusual for a submariner, but he wanted operational experience as a surface ship commanding officer.\nPost-Korean War Assignments\nWard was assigned as the commander of a submarine squadron that had the responsibility of testing the surface-fired Regulus missile. In 1958, he entered the Polaris missile program and later was assigned as the commander of Submarine Squadron 14, the first group of Polaris submarines deployed overseas.\nVietnam War\nOn 31 July 1965 Ward was assigned as head of the Naval Advisory Group, Military Assistance Command, Vietnam (MACV). As head of the Naval Advisory Group he played a key role in the planning and organization of Operation Market Time, the program to stop arms and supplies from being smuggled into South Vietnamese coastal waters by North Vietnam. On 1 April 1966 the Naval Advisory Group was disestablished and Ward became Commander, Naval Forces Vietnam. He was succeeded by Rear Admiral Kenneth Veth on 27 April 1967.\nPost-Vietnam\nWard retired from the Navy in 1973 while serving as Commander, Caribbean Sea Frontier and Commandant, 10th Naval District, based in Puerto Rico. While assigned to the 10th Naval District, he had to mediate confrontations between superiors at The Pentagon and residents of the island of Culebra while it was used as a Navy practice target range.\nPersonal life\nWard was married to Elizabeth Kearney in 1937. He turned down opportunities for promotion to vice admiral in order to be closer to his wife who suffered from bouts with cancer. They had four children; Commander Norvell G. Ward, Jr.,USN (ret), William H. Ward, Elizabeth Ward Schafer, and Captain Alexander K. Ward, USMC. Alexander died of wounds received in Vietnam in 1968. The Wards lived at a retirement community in Atlantic Beach, Florida. Ward died 19 July 2005 at Atlantic Beach, Florida.\nNotes\n;Citations\n;References used\n*\n*\n*\n* |year=2020|title=History for the SS-217 Guardfish|publisher=FleetSubmarine.com|access-date=October 6, 2020|url=https://fleetsubmarine.com/ss-217.html}}\n*\n*\n*"
    }
  ]
}