{
  "content": [
    {
      "type": "text",
      "text": "# Not Fade Away (Fear the Walking Dead)\n\n| director     = Kari Skogland\n| writer       = Meaghan Oppenheimer\n| length       = 46 minutes\n| guests       =\n* Patricia Reyes Spindola as Griselda Salazar\n* Shawn Hatosy as Andrew Adams\n* Sandrine Holt as Bethany Exner\n* Jamie McShane as Moyers\n| prev         = The Dog\n| next         = Cobalt\n| episode_list = List of Fear the Walking Dead episodes\n| season_article = Fear the Walking Dead (season 1)\n}}\n\"Not Fade Away\" is the fourth episode of the first season of the post-apocalyptic horror television series Fear the Walking Dead, which aired on AMC on September 20, 2015 in the United States.\nPlot\nDays after the National Guard quarantines the neighborhood into a Safe Zone, residents try to resume life normally, though tensions build under the military rule. A perimeter fence is erected around the neighborhood, and citizens are subjected to strict curfews and regular health monitoring. Madison grows stressed by extra work in taking care of her overcrowded home, while Travis takes on a new role as civilian liaison. Chris begins to document the ongoing events using a video camera; while filming atop the house roof one afternoon, he notices what appears to be a light flashing repeatedly from a window located in the uninhabitable \"Dead Zone\" outside the fence. Believing it may be a signal from someone alive, he shows the video to Travis, who dismisses it and discourages Chris from investigating any further; undeterred, Chris then shows it to Madison, who seems more receptive but still discourages him from investigating.\nOne of the neighbors, Doug, begins to refuse the mandatory medical inspections; the leader of the troops, Lieutenant Moyers, orders Travis to try to convince Doug to comply. Travis succeeds and Doug agrees to comply, but a few days later, Doug is discovered to be missing from his house, along with his car. His family panics and seeks help from Travis, but Moyers informs him that Doug was found inside his car near the perimeter fence, and was taken into custody. Travis tells Moyers about the flashing light that Chris claims to have seen, but Moyers dismisses it, and assures Travis that all the buildings outside of the Safe Zone were investigated and found empty. Meanwhile, Liza tries to help injured and sick neighbors using her medical experience; Nick begins to steal morphine from one of her patients, Hector, via an IV drip, despite his claims to have kicked his dependency. When Hector is moved to a military hospital for further treatment, Nick begins to succumb to withdrawal symptoms again; Madison discovers him rifling through drawers looking for drugs, infuriating her. Meanwhile, Ofelia begins to flirt with one of the soldiers, Corporal Adams, in the hopes that he can acquire more medication for Griselda, though he has been unsuccessful so far.\nOne evening, Madison climbs onto the roof with a flashlight and exchanges signals with the light in the Dead Zone, leading her to believe that someone might be alive out there. She sneaks outside the fence to investigate and finds evidence that the Guardsmen killed civilians, including many uninfected. She returns to camp and mentions this to Daniel, who describes his experience in El Salvador during an illness outbreak, when the sick were taken by the military under the guise of receiving hospitalization but were instead executed. A new military doctor arrives at the camp, Dr. Exner, who quickly determines that Liza has lied about her experience as a nurse; however, because Liza does seem knowledgeable in medicine, and due to general lack of medical staff, Exner requests that Liza joins medical staff at a nearby military hospital. During a medical inspection, Exner advises that Griselda be taken to the military hospital to have her wounds be properly treated; Griselda agrees to go only if Daniel can join her, which Exner accepts. When soldiers arrive to pick them up, however, they state that Daniel is not permitted to go with her, but that they will be taking Nick; he tries to run away but is unsuccessful, and is forcefully loaded into a truck and taken away, despite protests from his family. Soon after, Liza voluntarily leaves on another truck, revealing that she accepted Exner's earlier offer, though she is reluctant about having to leave Chris behind. Later that night, Travis climbs up to the roof and sees the signal from the Dead Zone. Moments later, however, he sees and hears gunfire coming from the same window, followed by darkness.\nReception\n\"Not Fade Away\" received very positive reviews from critics. On Rotten Tomatoes, it garnered an 86% rating with an average score of 6.59/10 based on 24 reviews. The site consensus reads: \"'Not Fade Away' presents an overall gripping look at a society staring into the abyss, even if it would benefit from characters with greater depth.\"\nMatt Fowler of IGN gave \"Not Fade Away\" a 7.8/10 rating stating: \"Fear the Walking Dead changed things up dramatically during its first season by skipping ahead and time and placing our characters in an army-occupied neighborhood. And while the threat of a crumbling military, who may operating on orders to overreact, is a great hook, the show still gets bogged down in familial bickering. Two of the best moments in 'Not Fade Away' involved characters exploding because they couldn't take the same inane BS. Alicia actually yelled at Travis and Madison for getting caught up in petty nonsense. And then later, Madison smacked up Nick for being the same fool addict he's always been, despite the entire country falling apart. Right then, in these moments, these characters were us.\"\nRatings\n\"Not Fade Away\" was seen by 6.62 million viewers in the United States on its original air date, nearly half a million less than the previous episode.\nReferences"
    }
  ]
}