{
  "content": [
    {
      "type": "text",
      "text": "# Now (The Walking Dead)\n\n|writer       = Corey Reed\n|director     = Avi Youabian\n|length       = 43 minutes\n| photographer   = Michael E. Satrazemis\n| editor         = Dan Liu\n|guests       = *Merritt Wever as Dr. Denise Cloyd\n*Jason Douglas as Tobin\n*Kenric Green as Scott\n*Ann Mahoney as Olivia\n*Austin Abrams as Ron Anderson\n*Major Dodson as Sam Anderson\n*Vanessa Cloke as Anna\n*Ted Huckabee as Bruce\n*Jasmine Kaur as Betsy\n*Mandi Christine Kerr as Barbara\n*Dahlia Legault as Francine\n*Jordan Woods-Robinson as Eric Raleigh\n*David Marshall Silverman as Kent\n|prev         = Here's Not Here\n|next         = Always Accountable\n| season_article = The Walking Dead season 6\n| episode_list = List of The Walking Dead episodes\n}}\n\"Now\" is the fifth episode of the sixth season of the post-apocalyptic horror television series The Walking Dead, which aired on AMC on November 8, 2015. The episode was written by Corey Reed and directed by Avi Youabian.\nThe Alexandria community deals with the aftermath of the Wolves' attack.\nPlot\nAs the Alexandrians clean up following the Wolves' invasion, Rick appears running toward the gate, shouting for it to be opened, as the walkers which escaped from the main herd pursue. He gets inside before the walkers surround the town, and instructs the townspeople to keep noise and light to a minimum until the rest of his team returns. Aaron sadly confesses that the Wolves discovered the Safe-Zone because of him, which shatters what's left of the town's spirits. That night, a drunken Spencer has an angry argument with his mother, Deanna, during which he blames her for the deaths of his father and brother. Elsewhere, Maggie, upon learning that Glenn and Nicholas have disappeared, arms herself and prepares to go out and look for Glenn, while Carl approaches Ron about Enid, who disappeared during the Wolves' attack, and asks him to help him find her. Ron refuses and threatens to tell Rick if Carl goes outside the walls.\nTara visits Denise, who is operating on the injured Scott, and discovers that Denise is struggling with her lack of knowledge as a doctor and wants to quit. With morale at an all-time low in Alexandria, Jessie goes to check on David's widowed wife, Betsy, but discovers that she committed suicide via slitting her wrists open upon learning of her husband's death and is now a walker. The commotion draws the attention of the other townspeople, and in their presence, Jessie kills the zombified Betsy. She tells them she understands not wanting to acknowledge how things are, but that fighting is the new reality they must live with. This empowers the rest of the town to start taking action.\nAaron insists upon accompanying Maggie, and shows her a sewer that takes them under the wall and bypasses the walkers surrounding it. After fending off walkers in the sewer, they reach the exit, only to discover that the back end of the herd is right outside. Despondent, Maggie admits defeat and tearfully reveals to Aaron that she is pregnant.\nRon goes to find Rick and tells him that he is ready to learn how to handle a gun, while Denise reads through the medical journals and comes up with a solution to save Scott. Later, she finds Tara and kisses her.\nThat evening, Maggie and Aaron erase Glenn and Nicholas' names from the memorial wall that has been set up, hoping they might still be alive. Rick and Deanna converse about the recent events. Deanna admits she is not fit to lead the town and appoints Rick the new leader of Alexandria. Later, he visits Jessie in her garage, and they kiss. Deanna, meanwhile, goes to the gate and bangs it defiantly. As she leaves, however, she fails to notice a trickle of blood pouring through a crack in the wall.\nReception\nCritical reception\nThe episode received mostly negative reviews from critics. It currently holds a 44% rating with an average score of 5.8 out of 10 on Rotten Tomatoes, with the critical consensus being that it \"provides deeper portrayals of some of the Alexandria crew -- but at the expense of furthering the stories of the Walking Dead characters we actually care about.\" Brian Moylan of The Guardian, in his review of the episode, commented that the episode fails to explain how Rick escaped from his stalled camper van in \"Thank You\", and described it as \"a spare, quiet episode, fraught with moments of uncertainty and tension.\" Ron Hogan from Den of Geek! praised the performance of Tovah Feldshuh, Youabian's direction and Reed's writing, and described the episode as \"brisk\" and \"speech heavy.\" Alex Straker of The Independent remarked that the episode \"is something of an oddity, an episode that initially suggests another adrenaline-heavy hour of intense action but never really delivers what it promises.\"\nRatings\nThe episode averaged a 6.2 rating in adults 18-49 and 12.44 million viewers overall, a decrease from the previous episode, which averaged a 6.8 rating and 13.34 million.\nReferences\nExternal links\n*[https://www.amc.com/twdu/the-walking-dead/season-6/episode-5 \"Now\"] at AMC\n*"
    }
  ]
}