{
  "content": [
    {
      "type": "text",
      "text": "# Now Software\n\n__NOTOC__\n| founder =\n| defunct =\n| hq_location_city =\n| hq_location_country =\n| area_served =\n| key_people =\n| products =\n| owner =\n| num_employees =\n| num_employees_year =\n| parent =\n| website =\n}}\nNow Software was the producer of Now Up-to-Date & Contact, a calendaring software and contact manager for individuals and groups, for macOS and Windows. The company was incorporated in 1989.\nNow Software, then based in Portland, Oregon, was acquired by Qualcomm in 1997. At the time of acquisition, Qualcomm reported (based on data from the company and from industry research firm Softletter) that Now Software was the \"71st-largest software company in the U.S. with close to two million users\" of its products. Qualcomm also noted that Now Software's products had won high praise, \"including Product of the Year, multiple Editor's and Reader's Choice honors and seven World Class Awards\". In 1999, the intellectual properties of the original company, including the name, were acquired by Power On Software, which relaunched the company and name.\nOn August 27, 2009, the company released Now X, the successor to Now Up-to-Date & Contact. Now X was rated poorly by Macworld, which called it \"a program that doesn't rise anywhere near the level of its predecessor\".\nIn March 2010, the company suspended its day-to-day operations.\nIn 2011, InformationWeek included Now Up-to-Date & Contact in its list of \"Great Lost Software\", sixteen great defunct software applications, along with Adobe FreeHand, Adobe GoLive, Ecco Pro, HyperCard, Lotus Improv, Outlook Express, Palm Desktop, Ventura Publisher, WriteNow, and others.\nTwo of the original programmers of Now Up-to-Date, Dave Riggle and John Chaffee, moved on to found the software company BusyMac, which produces the software applications BusyCal and BusyContacts, filling a similar niche market to the one filled by Now Up-to-Date & Contact.\nNow Utilities\nNow Utilities was a file utility product for Mac System 7. The first version, in 1990, was named one of MacUser \"Top 100 Products for 1990\".\nAs of Version 4 (released in 1993), Now Utilities includes NowSave, an automatic document saving facility (save after a configurable number of keystrokes or mouse-clicks); Super Boomerang (puts most recently used files into a menu); Now Profile (a system information collector); NowMenus (adds subfolders to the Apple menu); WYSIWYG Menus (Font, Size, Style menus render text as they would appear in a document); and Now Scrapbook (a replacement for the Scrapbook desk accessory). Earlier versions contained AlarmsClock, DeskPicture and ScreenLocker utilities, but these were removed in version 4.\nSee also\n* Timeline of computing 1990–99 other developments in computing during the heyday of Now Software\nReferences\nFurther reading\n*\n*\n*  Reviews Now Up-to-Date 2.0.\n*  Reviews Now Up-to-Date 2.0, among other personal information managers (PIMs).\n*\n*\n*\n*  Announces release of Now Contact.\n*\n*  Reviews Now Contact 1.0.\n*  Reviews Now-Up-To-Date 2.1.1 and Now Contact 1.1 and other PIMs.\n*  Reviews Now Contact 3.0.\n*  Reports on upgrades to Now Up-to-Date and Now Contact.\n*  Reviews Now-Up-To-Date and Now Contact 3.0.\n*\n*  Reviews Now-Up-To-Date and Now Contact 3.5.\n*  Cover story reviews Now Up-to-Date and other PIMs.\n*  Reviews Now Up-to-Date for Windows 95 and other PIMs.\n*  Reviews Now Up-to-Date for Windows 95.\n*\n*  Reviews Ascend 5.0 and Now Up-to-Date 1.0 for Windows.\n*  Reviews Now Up-to-Date 1.02 for Windows.\n*  Reviews Now-Up-To-Date Web Publisher and other group scheduling and calendaring software.\n*  Mentions Now-Up-to-Date 3.5.\n*  Reviews Now Up-to-Date Web Publisher and other software.\n*\n*  Reviews Now Up-to-Date and Now Contact 3.6.5.\n*  Mentions Now Software.\n*  Now Up-to-Date 3.6.5.\n*  Mentions using a software program called Consultant to sync data from Now Up-to-Date and Now Contact to a Palm Pilot.\n*\n*\n*\n*  Reviews Now Up-to-Date and Now Contact.\n*\n*  Mentions Now Up-to-Date and Now Contact 5.3.2."
    }
  ]
}