{
  "content": [
    {
      "type": "text",
      "text": "# Nuclear War Survival Skills__disambig_1\n\nNuclear War Survival Skills or NWSS, by Cresson Kearny, is a civil defense manual.  It contains information gleaned from research performed at Oak Ridge National Laboratory during the Cold War, as well as from Kearny's extensive jungle living and international travels.\nNuclear War Survival Skills aims to provide a general audience with advice on how to survive conditions likely to be encountered in the event of a nuclear catastrophe, as well as encouraging optimism in the face of such a catastrophe by asserting the survivability of a nuclear war.\nThe 2022 edition is entitled \"Nuclear War Survival Skills Updated and Expanded 2022 Edition Regarding Ukraine Russia and the World: The Best Book on Any Nuclear Incident Ever ... New Methods and Tools As New Threat Emerge\".\nOverview\nThe main chapters are preceded by forewords from Edward Teller and Eugene Wigner. Following this is an introduction which explains that even the fruition of the Strategic Defense Initiative program would not make \"self-help civil defense\" obsolete. A comparison is made of the civil defense preparations of Switzerland, Russia, and the United States, where it is concluded that: \"Switzerland has the best civil defense system\"; \"The rulers of the Soviet Union... continue to prepare the Russians to fight, survive, and win all types of wars\"; and that \"the United States has advocated... a strategy that purposely leaves its citizens unprotected hostages to its enemies.\" Thus, \"The emphasis in this book is on survival preparations that can be made in the last few days of a worsening crisis.\"\nThe Dangers from Nuclear Weapons: Myths and Facts\nThe first chapter aims to give background information to dispel various demoralizing myths and reaffirm the potential survivability and reality of nuclear weapons. \"An all-out nuclear war between Russia and the United States would... be far from the end of human life on earth.\" Myths listed include: \"Fallout radiation from a nuclear war would poison the air and all parts of the environment. It would kill everyone.\"; \"Fallout radiation penetrates everything; there is no escaping its deadly effects.\"; and \"Unsurvivable \"nuclear winter\" surely will follow a nuclear war.\"\nPsychological Preparations\nThis chapter provides information on the immediate effects of thermonuclear explosions, and peoples' likely reactions to them, in an attempt to lessen the terror and confusion that would be prevalent after an unexpected nuclear attack. \"Some people would think the end of the world was upon them if they happened to be in an area downwind from surface bursts of nuclear weapons that sucked millions of tons of pulverized earth into the air.\"\nWarnings and Communications\nIllustrates the limitations of the National Warning System (NAWAS) and the Attack Warning Signal sirens, concluding that \"In an all-out attack, the early explosions would give sufficient warning for most people to reach nearby shelter in time.\"\nEvacuation\nDue to the replacement of large warheads on inaccurate missiles with smaller warheads on more accurate missiles, \"you may logically conclude that unless your home is closer than 10 miles from the nearest probable target, you need not evacuate to avoid blast and fire dangers.\" Evacuation relevant to fallout radiation risk is thoroughly discussed, where it is noted that most available fallout risk-area maps are inaccurate, outdated, and misleading.\nShelter, the Greatest Need\nProvides information on fallout protection and basic structures; complete designs for \"6 types of earth-covered expedient shelters\" are provided in Appendix A.\nTypes of radiation shielding\nBarrier shielding: 3 feet of earth (91 centimeters) will absorb about 99.99% of all gamma rays. If the shelter is not fully enclosed, a person is at risk of scattering gamma rays. These scattering gamma rays are known as \"skyshine\".\nGeometry Shielding reduces radiation exposure by increasing the distance from a person and the gamma particles. An effective way to create this is implementing turns into a shelter, as this makes it more difficult for gamma particles to scatter and hit a person around the corner.\nVentilation and Cooling of Shelters\n]]\n\"Some shelters will become dangerously hot in a few hours.\" The Kearny air pump (for which a design is included in the appendix) is recommended, with natural ventilation considered typically inadequate, and electric pumps considered unreliable and prone to heating the air. Filters are considered unnecessary, \"the hazards from fallout particles carried into shelters by unfiltered ventilating air are minor compared to the dangers from inadequate ventilation.\"\nProtection Against Fires and Carbon Monoxide\nFire is considered the third most dangerous hazard, after direct blast effects and fallout radiation. It is noted that during the Bombing of Dresden, \"Most casualties were caused by the inhalation of hot gases and carbon monoxide\"\nFire is the third largest worry in a nuclear attack, behind initial blast and fallout radiation. The biggest killer in fires is the increased carbon monoxide. This poses an even greater threat in shelters that rely on ventilation. If a fire occurs in a shelter, occupants should move to a room where ventilation from other rooms could be cut off. When building a shelter, Dr. A. Broido suggests putting the intake vent as far from combustible materials as possible.\nWater\n]]\nThe importance of water to basic survival is discussed, with the recommendation that four to five quarts (3.78 to 4.73 liters) of drinking water per day per person is essential as a minimum. Methods of storing, transporting, and purifying water are also explained, with plastic-lined earthen storage pits recommended for storing large quantities.\nFood\nA basic diet, vegetarian and consisting only of bulk staples, is presented, along with basic nutrition facts and special advice for the very young, very old, and sick. \"And because of the remarkable productivity of American agriculture, there usually would be enough grain and beans in storage to supply surviving Americans with sufficient food for at least a year following a heavy nuclear attack. Take precaution when eating meat. Areas with enough fallout to make animals sick, become a high-risk area for contaminated meat. If it is a crisis situation, meat should be cooked until very well done.\nFallout Radiation Meters\nReviews the best dose-rate meters and dosimeters available in 1987 and details the Kearny fallout meter, a \"Homemakeable dose-rate meter\", which can be built from a correctly scaled copy of the plans, such as those provided in hardcopies of the book; photocopies and printouts of digital copies may not be to scale.\nLight\n\"Under wartime conditions, even a faint light that shows only the shapes of nearby people and things can make the difference between an endurable situation, and a black ordeal.\" Plans for an expedient cooking-oil powered lamp are included.\nShelter Sanitation and Preventive Medicine\nTopics covered include: Clean Water and Food; Control of Insects; Prevention of Skin Diseases; Disposal of Human Wastes; Disposal of Dead Bodies; and Prevention of Respiratory Diseases.\nSurviving Without Doctors\nWhere There Is No Doctor is recommended to supplement to this chapter. Excerpts are provided, along with additional information specific to the health effects of radiation and the use of potassium iodide.\nExpedient Shelter Furnishings\nImprovised furniture is discussed, including a hammock made from bedsheets, and a hanging chair made from the hammock.\nImprovised Clothing and Protective Items\nThe basic principles of thermal insulation are explained; ideas for expedient cold- and wet-weather clothing are provided.\nMinimum Pre-Crisis Preparations\nA list of recommended preparations are given for: shelter, shelter ventilation, water, food, fallout meters, sanitation, medicines, light, communications, etc.\nPermanent Family Fallout Shelters for Dual Use\nConsiderations for permanent fallout shelters are given, with emphasis on maximizing habitability and minimizing cost.\nTrans-Pacific Fallout\nDetails the potential fallout dangers to the United States of a limited nuclear exchange between other countries.\nAppendices\n* Appendix A: Instructions for Six Expedient Fallout Shelters\n* Appendix B: How to Make and Use a Homemade Shelter-Ventilating Pump, the KAP.\n* Appendix C: Instructions for a Homemade Fallout Meter\n:Complete set for constructing a Kearny Fallout Meter, with an extra set of critical patterns and detailed instructions for quick and correct mass reproduction.\n* Appendix D: Expedient Blast Shelters\n* Appendix E: How to Make a Homemade Piston Pump\n* Appendix F: Providing Improved Ventilation and Light\nReception\nIn an article sharply critical of the whole genre, the Bulletin of the Atomic Scientists (Vol 39, 1983) characterizes the volume as being one of the two more \"substantial\" books on surviving nuclear war out of the four reviewed.  The other \"substantial\" book, Life After Doomsday: A Survivalist Guide to Nuclear War and Other Major Disasters by Bruce D. Clayton, itself is stated to praise and borrow from Nuclear War Survival Skills. The BAS article backhandedly compliments NWSS on its inclusion of features such as \"elaborate diagrams for building shelter; testing for radiation with homemade meters; providing for ventilation; filtration of water and sanitation,\" but goes on to say that the basic flaw with NWSS and the other books reviewed is that they deal only with short-term survival, and sidestep putting heavy thought into the long-term ramifications of nuclear conflict for the continued survival of both their assiduous readers and the balance of the human race.\nPublication history\nNuclear War Survival Skills was released into the public domain by the author, and is available in digital format for free from several sources online. In the printed form, a modest charge will generally be incurred.\nOriginally released September 1979, it was updated and published in May 1987 with a significant addition on nuclear winter, consisting largely of detailing the shaky assumptions used by nuclear winter models. In 1999 a one-page addendum on radiation hormesis was added. In 2022 the book was updated by Steven Harris, who was mentored by Cresson Kearny. He did not change the original text but put update pages next to the relevant pages with newer 2022 tools and methods that did not exist in 1987 to give the reader more options especially in pre-crisis preparation.\nSee also\n* Bug-out bag\n* Civil defense by country\n* Duck-and-cover\n* Effects of nuclear explosions on human health\n* Fallout Protection\n* Mutual assured destruction\n* Protect and Survive\n* Survival Under Atomic Attack\n* Survivalism\nReferences\n;Citations\n;Sources\n*\nExternal links\nFull text\n* [https://books.google.com/books?id=VPFTAAAAMAAJ&q=Nuclear+War+Survival+Skills Google Books (Original 1979 ORNL Publication)]\n* [http://www.oism.org/nwss/ Oregon Institute of Science and Medicine Online Edition (1999 Update 2001 Publication)]\n* [http://oism.org/nwss/nwss.pdf Free PDF downloadable version from publisher (1999 Update 2001 Publication)]\n* [https://link.us1.storjshare.io/s/jxoqtjnsv35pbrrndvy3gifrqqoq/nwss/Nuclear_War_Survival_Skills_dot_com_FREE_PDF_file_05-06-2022_ver_01.pdf Free PDF High Speed downloadable (1999 Update 2022 Publication)]\n* [http://www.ki4u.com/free_book/s73p911.htm Another online version of NWSS 1999 Update 2001 Publication]\nSimilar publications\n* [https://www.trueprepper.com/wp-content/uploads/2022/09/Planning-Guidance-for-Response-to-Nuclear-Detonation-May-2022-FEMA.pdf Planning Guidance for Response to a Nuclear Detonation ]\n* [http://www.nukepills.com/docs/fema_nuclear_war_survival.pdf FEMA Nuclear War Survival]\n* [http://www.remm.nlm.gov/NuclearDetonationPreparedness.pdf Nuclear Detonation Preparedness from REMM.gov]"
    }
  ]
}