{
  "content": [
    {
      "type": "text",
      "text": "# Nuke (software)\n\n| latest release version =\n| programming language = C++, Python\n| operating system =\n| genre = Compositing software\n| license = Proprietary\n| website = [https://www.foundry.com/products/nuke-family NUKE]\n}}\nNuke is a node-based digital compositing and visual effects application first developed by Digital Domain and used for television and film post-production. Nuke is available for Windows, macOS (up to Monterey natively), and RHEL/CentOS. Foundry has further developed the software since Nuke was sold in 2007.\nNuke's users include Digital Domain, Walt Disney Animation Studios, Blizzard Entertainment, DreamWorks Animation, Illumination Mac Guff, Sony Pictures Imageworks, Sony Pictures Animation, Light Chaser Animation Studios, Framestore, Weta Digital, Double Negative, and Industrial Light & Magic.\nHistory\nNuke (the name deriving from 'New compositor') was originally developed by software engineer Phil Beffrey and later Bill Spitzak for in-house use at Digital Domain beginning in 1993. In addition to standard compositing, Nuke was used to render higher-resolution versions of composites from Autodesk Flame.\nNuke version 2 introduced a GUI in 1994, built with FLTK – an in-house GUI toolkit developed at Digital Domain.  FLTK was subsequently released under the GNU LGPL in 1998.\nNuke won an Academy Award for Technical Achievement in 2001.\nIn 2002, Nuke was publicly released by D2 Software. In 2005, Nuke 4.5 introduced a new 3D subsystem developed by Jonathan Egstad.\nIn 2007, The Foundry, a London-based plug-in development company, took over development and marketing of Nuke from D2. The Foundry released Nuke 4.7 in June 2007, and Nuke 5 was released in early 2008, which replaced the interface with Qt and added Python scripting, and support for a stereoscopic workflow. In 2015, The Foundry released Nuke Non-commercial with some basic limitations. Nuke supports use of The Foundry plug-ins via its support for the OpenFX standard (several built-in nodes such as Keylight are OpenFX plugins).\nReferences\nExternal links\n*\n* [https://openfx.sourceforge.net/ Sourceforge site for the OpenFX effects plug-in standard]"
    }
  ]
}