{
  "content": [
    {
      "type": "text",
      "text": "# Nursing in the Republic of Ireland\n\nNursing is a regulated profession in the Republic of Ireland. The Nursing and Midwifery Board of Ireland (NMBI) (in Irish: Bord Altranais agus Cnáimhseachais na hÉireann) is the statutory regulator responsible for regulating both nursing and midwifery.\nNursing regulation\nIn order to practice, all nurses must be registered with the Nursing and Midwifery Board. The Board was established by the [https://www.irishstatutebook.ie/eli/2011/act/41/section/4/enacted/en/index.html Nurses and Midwives Act, 2011]. In addition to the formation of the NMBI, the Act also made provision for the separation of nursing and midwifery as separate professions.\nThe NMBI maintains two registers:\n* The Register of Nurses and Midwives, made up of 12 Divisions:\n** General Nurses Division\n** Midwives Division\n** Children's Nurses Division\n** Psychiatric Nurses Division\n** Intellectual Disability Nurses Division\n** Public Health Nurses Division\n** Nurse Tutors Division\n** Midwife Tutors Division\n** Nurse Prescribers Division\n** Midwife Prescribers Division\n** Advanced Nurse Practitioners Division\n** Advanced Midwife Practitioners Division\n* The Candidate Register; for nursing and midwifery students.\nDevelopments\nFollowing Henry VIII’s dissolution of monasteries, nursing became near non-existent in Ireland for almost three hundred years. The easing of the Penal laws allowed the emergence of volunteer associations of women who formed to aid the sick such as the Sisters of Mercy led by Catherine McAuley and Irish Sisters of Charity led by Mary Aikenhead.\nIn parallel, nursing as a public service was also practised by the inmates of workhouses; this is notable as the network of workhouses and infirmaries are the precursor of modern Irish health via key legislation such as the Medical Charities Act 1851 and reviews of the Poor laws such as 1868. However, nursing as a regulated profession in Ireland began when the Irish Workhouse Association, which was formed in 1896, demanded that staff must be formally qualified. Significant changes have occurred in Irish nursing since the publication of [http://www.dohc.ie/publications/pdf/commnrs.pdf?direct=1 Report of The Commission on Nursing, A blueprint for the future].\nNurse education\nIn order to join the Register, applicants must have completed a registration programme in their chosen field of nursing. Pre-registration education courses are provided by universities and colleges at degree-level (NFQ level 8). The NMBI governs such programmes through its [https://www.nmbi.ie/NMBI/media/NMBI/NMBI-Nurse-Registration-Programmes-Standards-and-Requirements-Fifth-Edition_1.pdf?ext=.pdf Nurse Registration Programmes Standards and Requirements].\nEach individual nurse has responsibility for maintaining their own competency, part of which includes being responsible for their own continuing professional development, ensuring their knowledge and skills are up-to-date with changes in practice.\nIt is possible for nurses to undertake additional education, including individual modules that qualify them in specific areas like wound management. Other nurses may decide to take further study in education to join the Nurse Tutor Division of the Register, taking more responsibility for training and supervising students. Otherwise, nurses may opt to take a MSc or PgD in Advanced Practice Nursing, offered by a number of Irish universities and allowing them to join this division of the Register and exercise an extended scope of practice.\nReferences\nExternal links\n*[https://digital.ucd.ie/view/ivrla:35760 The Irish Nursing Journals Collection, a collection of 20th century journals pertaining to the Irish Nurses and Midwives Organisation.] A UCD Digital Library Collection."
    }
  ]
}