{
  "content": [
    {
      "type": "text",
      "text": "# O: A Presidential Novel\n\n| illustrator =\n| cover_artist =\n| country = United States\n| language = English\n| genre = Political novel\n| publisher = Simon & Schuster\n| release_date = January 25, 2011\n| media_type = Hardcover and e-book\n| pages =353\n| isbn =978-1-4516-2596-7\n|}}\nO: A Presidential Novel is a fiction book by an anonymous author (speculated to be John McCain's 2008 senior campaign advisor, Mark Salter) about the 2012 U.S. presidential race. It was released on January 25, 2011. The marketing strategy for the book has been compared to the 1996 roman à clef, Primary Colors: A Novel of Politics, which was also initially ascribed to an anonymous author. Its stated objective is to \"offer some resonant truths about what President Obama is really thinking\".\nAs part of its pre-publication publicity, Simon & Schuster sent an e-mail to numerous writers and journalists asking them to decline to comment if they are asked whether they are the anonymous author.  The publisher has said that the author \"has been in the room with Barack Obama.\" This prompted speculation on whether the author was a political reporter, an administration insider, or a Democratic Party strategist. The New York Times remarked, however, that \"much of what passes for inside knowledge in these pages would be known to anyone who’s read a bunch of campaign accounts\".\nShortly after the book was published, Mark Halperin of Time reported that his sources had confirmed the author is McCain aide Mark Salter.\nPlot summary\nThe story begins a few months after January 2011 as the campaign for the 2012 election for president begins to heat up. The book is tightly focused on the campaign itself, centering on a small cast of about eight characters, the primary ones being Cal Regan the new campaign manager, and the fictional character \"O\" the president of the United States (Barack Obama). According to an early review by The Washington Post, the book \"clearly illustrates, season by season, just how effectively presidential campaigners plan, draft and articulate the political discourse that the press pretends it controls.\"  When the president is attacked by his opponent, for example, his campaign staffers point out that the press can be distracted if the president merely buys a second dog.\n}}\nExternal links\n* [https://www.nytimes.com/2011/01/20/books/excerpt-o-a-presidential-novel.html Book excerpt]\n* [http://pages.simonandschuster.com/o-a-presidential-novel/ Book website]"
    }
  ]
}