{
  "content": [
    {
      "type": "text",
      "text": "# O'Houlihan (dynasty)\n\nThe Houlihan dynasty is a noble house and clan descending from Uí Mháine in modern-day County Galway and County Offaly in Ireland. This is reflected in the patronymic naming system: \"Uallachán, son of Flann, son of Flannchadh, son of Innrachtach, son of Maelduin, son of Donngal, son of Anmchadh, son of Eoghan Buac.\"\nThe source of the name \"hUallacháin\" (Houlihan) is from the progenitor of the family Prince Uallachan Mac Flann: \"A rough-fettering lord of distinguished valour, venomous- weaponed, h-Uallachan.\" An Irish warrior and Prince of Siol Anmchadha. His name means \"Proud\", or \"Arrogant\".\nThere are likely more than 3 different main lines of the Houlihan name, which stem from different places. The name found in this article is the main line whom were \"Chiefs of Siol Anmchadha in Hy-Maine\" (Uí Mháine) as listed in John O'Hart's Pedigree of the Irish Nation.\nAt times, The Ó hUallacháin was the King and or Chief of Siol Anmchadha, as addressed in the \"Annals of Ireland,\" and, \"Tribes and Customs of Hy-Many.\" But The O'Houlihan specifically ruled over Lusmagh, a parish East of the Shannon River, within the Barony of Garrycastle but not ruled by the Delbhna bEthra.\nHistory\nof Longford in east Galway, formerly the O Madden territory of Síl Anmchadha, shown in yellow with the location of the parish of Lusmagh shown in green. The parish of Lusmagh would become part of King’s County (later County Offaly) in the mid-seventeenth century.'']]\nNotable persons of the name\nUallachán Mac Flann, Chief of the Name, Chief of the Munter Cinaith, Prince of Siol Anmchadha.\nKing Giolla Finn Mac Uallacháin, Chief of the Name Ó hUallacháin, Chief of the Munter Cinaith, Chief of Siol Anmchadha, King of Siol Anmchadha (reigned 1096-1101)\nArchbishop of Cashel, Archbishop of Munster, Donal Ua hUallacháin (in office 1171-1182)\nHenry Cuolahan, of Cogran Esq., Last head of the Mac Cuolahan line. (b. 1817- d. 1848). \"Cuolahan died in 1902 and nine years later Rebecca, as head of the house, was the sole Cuolahan resident at Cogran. By the late twentieth century the house was in a ruinous state.\"\nJames Woulahan, an Independent politician who ran in the 1985, and 1989, Braid Valley District elections for the Ballymena Borough Council.\nSee also\n*Irish clans\n*Houlihan (surname)\n*Gaelic nobility of Ireland\nReferences and citations"
    }
  ]
}