{
  "content": [
    {
      "type": "text",
      "text": "# Oak Beach, Queensland\n\n| pop                 = 186\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4877\n| area                = 6.9\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 16.2\n| dir1                = SSE\n| location1           = Port Douglas\n| dist2               = 25.8\n| dir2                = SE\n| location2           = Mossman\n| dist3               = 50.3\n| dir3                = NW\n| location3           = Cairns\n| dist4               = 1727\n| dir4                = NNW\n| location4           = Brisbane\n| lga                 = Shire of Douglas\n| stategov            = Cook\n| fedgov              = Leichhardt\n| maxtemp             =\n| mintemp             =\n| rainfall            =\n| near-n              = Mowbray\n| near-ne             = Coral Sea\n| near-e              = Coral Sea\n| near-se             = Coral Sea\n| near-s              = Mowbray\n| near-sw             = Mowbray\n| near-w              = Mowbray\n| near-nw             = Mowbray\n}}\nOak Beach is a coastal town and locality in the Shire of Douglas, Queensland, Australia. In the , the locality of Oak Beach had a population of 186 people.\nGeography\nOak Beach is bounded by the Coral Sea to east and completely surrounded by the locality of Mowbray on all its land boundaries.\nThe locality has the following beaches:\n*  Pebbly Beach in the northern part of the locality () extending north into neighbouring Mowbray\n*  the eponymous Oak Beach in the southern part of the locality () extending south into neighbouring Mowbray\nThe town of Oak Beach is located in the far south-east of the locality on the coast. The residential areas are along the coast in the town and along the coast on Pebbly Beach. The southern part of the locality is mostly rural residential. The west of the locality is used to grow sugarcane.\nOffshore is Trinity Bay, part of the Coral Sea ().\nThe Captain Cook Highway enters the locality from the south-east (Mowbray) and exits to the north (Mowbray). It does not pass through the town.\nDemographics\nIn the , the locality of Oak Beach had a population of 195 people.\nIn the , the locality of Oak Beach had a population of 186 people.\nEducation\nThere are no schools in Oak Beach. The nearest government primary school is Port Douglas State School in Port Douglas to the north-west. The nearest government secondary school is Mossman State High School in Mossman to the north-west.\nReferences\nExternal links\n*"
    }
  ]
}