{
  "content": [
    {
      "type": "text",
      "text": "# Oberwart\n\n| subdivision_type         = Country\n| subdivision_name         = Austria\n| subdivision_type1        = State\n| subdivision_name1        = Burgenland\n| subdivision_type2        = District\n| subdivision_name2        = Oberwart\n| parts_type               =\n| parts_style              = para\n| p1                       =\n| leader_title             = Mayor\n| leader_name              = Georg Rosner\n| leader_party             =\n| leader_title1            =\n| leader_name1             =\n| area_footnotes           =\n| area_total_km2           =\n| area_metro_km2           =\n| elevation_m              = 315\n| elevation_max_m          =\n| elevation_min_m          =\n| population_as_of         =\n| population_footnotes     =\n| population_total         =\n| population_urban         =\n| population_metro         =\n| population_note          =\n| population_density_km2   = auto\n| established_title        =\n| established_date         =\n| timezone                 = CET\n| timezone_DST             = CEST\n| utc_offset               = +1\n| utc_offset_DST           = +2\n| registration_plate       =\n| postal_code_type         = Postal code\n| postal_code              = 7400\n| area_code_type           = Area code\n| area_code                =\n| website                  = [http://www.oberwart.at www.oberwart.at]\n| footnotes                =\n}}\nOberwart (; ; ) is a town in Burgenland in southeast Austria on the banks of the Pinka River, and the capital of the district of the same name. With almost 8,000 inhabitants it’s the third largest town in Burgenland, after Eisenstadt and Neusiedl am See. Oberwart is the cultural capital of the small ethnic Hungarian minority in Burgenland, living in the Upper Őrség or Wart microregion.\nHistory\nThe settlement was established in the 11th century by the guards of the Hungarian frontier (őrs) together with Unterwart (Alsóőr) and Siget in der Wart (Őrisziget). It was first mentioned in historical documents in 1327 under the name Superior Eör. It was part of the old county of Vas until 1921. Old surnames and the special local dialect shows that the population was related to the Székelys of Transylvania (i.e. the guards of the eastern border of Kingdom of Hungary).\nThe community of the őrs received the privileges of the nobles by King Charles I of Hungary in the 14th century. The privileges were acknowledged by Rudolph I in 1582. The village was partially destroyed by the Ottoman army in 1532.\nReformation appeared in Felsőőr in the 16th century, and it was backed by the mighty counts of Battyhány. Pastor Ferenc Eőri took part in the synod of 1618. In the Age of Counter-Reformation, most of the region had to return to Roman Catholic faith, but the free noble village of Felsőőr remained Calvinist. In 1673 the army occupied the church and the school to give them back to the Catholics. The rectory was destroyed, and the pastor expelled. The villagers erected a new church in 1681 from wood. According to the laws of the Diet of 1681, Felsőőr became an \"articular place\" which means that it was the only legal place to practice Protestant religion for the whole region.\nThe villagers participated in the Hungarian national uprising of István Bocskay in 1605, and of Count Francis II Rákóczi in 1705. In 1706 the Austrian army of General Sigbert Heister sacked Felsőőr. In 1841 the village got the right to hold a market. In the time of the Hungarian Revolution of 1848, the villagers defeated (with the help of a Hussar troop) a smaller Croatian army. Later they had to pay a huge amount of tribute to avoid collective punishment.\nGeographer Elek Fényes described the village in 1851 as an important and historically significant őr settlement:\n: \"The fields are of only average fertility but the meadows are good. Has got sufficient wood and pasture. The inhabitants are the most diligent in the county: they are not only cultivating flax and breeding horses but they produce cloth and lint, make knives and other ironworks, practice crafts and trade.\"\nAt that time, 41 noble families lived in Felső-Őr. Some typical family names were: Ádám, Adorján, Albert, Andorkó, Balás, Bertha, Bertók, Fábián, Fülöp, Gál, Imre, Kázmér, Miklós, Orbán, Pál, Pongrácz, etc.\nAfter the Austro-Hungarian Compromise of 1867, the village began to develop rapidly, and the population reached 3900 people in 1910. According to the Treaty of Trianon in 1920, Felsőőr was annexed by Austria, but the Hungarian population opposed the decision and organised a movement to establish the autonomous province of Lajtabánság. In November 1921, the Austrian army occupied the village.\nAfter the annexation of Austria by Nazi Germany in 1938, the Jewish inhabitants of the village (appr. 140 people) were deported, and the synagogue was transformed into a fire department depot. According to the Nazi policy of Germanisation, the old Hungarian school of the Reformed Church was secularized. In 1939 Oberwart was incorporated as a town. In April 1945 the Red Army occupied Oberwart after a week of fierce fighting and plundered the half-destroyed town. In the 1950s and 1960s, Oberwart was rebuilt and thoroughly modernized. On 2 September 1984, the European number-one hit Live Is Life by Opus was recorded on a concert in Oberwart in a live version with the audience singing along.\nOn 5 February 1995, close to a Romani housing in Oberwart, Franz Fuchs, an Austrian domestic terrorist, killed four young Romani men using a booby trap connected to a sign with the words \"Roma zurück nach Indien\" (\"Roma go back to India\").\nSights\n* Reformed Church - The present imposing Baroque church was built in 1771-73 by Christoph Preising. The tower was built in 1808-09 by Matthias Preising. The furniture, the pulpit and the ecclesiastical equipment are valuable art pieces from the 18-19th centuries.\n* Old Rectory - The Old Rectory was built in 1784, next to the Reformed Church in rural Baroque style, with an arcaded porch. It was enlarged in 1823. Today it is a community center and museum. The old documents of the Calvinist community (for example the parish registers since 1732) are important historical sources.\n* Former School of the Reformed Church - The famous school of the church was founded in the 17th century. The old school building behind the church was built in 1802.\n*Old Parish Church - The old parish church of the Ascension was enlarged and rebuilt in Gothic style in 1463. In the 16-17th centuries it was a Calvinist church. The huge tower was built that time in 1656 under the pastoral service of János Szeremley. The church was rebuilt in Baroque style in 1728 and 1778. The restoration in 1975 revealed the medieval architectural details and murals in the apse from the 14th century (St George and St Michael). The furniture is Baroque from the 18th century.\n*New Parish Church - The modern concrete-and-glass church and religious center was built in 1967-69 by the plans of Günther Domenig and Eilfried Huth.\n* Evangelical Church - It was built between 1812 and 1815 in Neo-Classical style. The evangelical parish has been always the third in numbers behind the other two religion in Oberwart (for example 684 people in 1880 and 1198 in 2001).\n* Flea Market - On the first Saturday of every month, a flea market is held in central Oberwart.\nRoman Catholic Parish Church in Oberwart\nHungarians\nIn the course of the 20th century a language shift occurred in local population, changing the use of Hungarian to German. Magyars lost their historical majority in Felsőőr/Oberwart but the town remained the most important Hungarian educational, religious and cultural centre in Burgenland.\nNowadays there are appr. 1100 ethnic Hungarian inhabitants of the town, mostly members of the Calvinist parish. Felsőőr is the oldest Calvinist congregation in Austria.  The Christian Reading Club of Young Men (founded in 1889) is an important cultural association of the Hungarian minority with a library, folk dance group and theater group. The new cultural center of the Calvinist Church was built in 1956-57. The Hungarian kindergarten was reestablished after World War II in 1951 and a new Bilingual Secondary School was set up in 1992.\nThe old Hungarian district of the town is called Fölszeg (i.e. Upper End). The neighbourhood is the oldest part of the town with narrow lanes and more than one hundred old houses which are typical examples of the rural architecture of the Felső-Őrség. The vaulted porches and the stuccoed gables are characteristic architectural features.\nCoat-of-arms\nThe old coat-of-arms of Felsőőr depicted a medieval Hungarian frontier-guard (Hungarian: őr) with two swords in his hands, one raised as the symbol of attack, the other crossed as the symbol of defence.  The inscription of the arms was Nobiles de Felső-Eőr. The new coat-of-arms of Oberwart was granted in 1972. The main feature of the old arms - the figure of the frontier-guard - was kept but the details changed and the inscription disappeared.\nDemographics\nAccording to geographer Elek Fényes, in 1851 Felső-Őr was a Hungarian village with a population of 2323 people. Calvinists were the largest religious group (60%), followed by Roman Catholics (26%), Lutherans (13%) and only 10 Jews.\nThe population statistics of Oberwart/Felsőőr recorded by official Hungarian and Austrian censuses were:\n{| class=\"wikitable\" style=\"border-collapse:collapse;\"\n!Year||Total||Hungarians||Austrians||Roma||Croatians\n|-\n|1880 ||3,397||2,395||852||13||8\n|-\n|1890||3,410||2,720||613||49||14\n|-\n|1900||3,471||2,680||782||n/a||8\n|-\n|1910||3,912||3,039||842||n/a||17\n|-\n|1920||4,162||3,138||838||157||5\n|-\n|1923||3,846||2,664||1,162||n/a||5\n|-\n|1934||4,603||2,234||2,058||282||13\n|-\n|1951||4,496||1,603||2,854||n/a||2\n|-\n|1961||4,740||1,475||3,170||n/a||7\n|-\n|1971||5,455||204||5,236||n/a||n/a\n|-\n|1981||5,715||1,343||4,294||n/a||44\n|-\n|1991||6,319||1,598||4,430||n/a||104\n|-\n|2001||6,696||1,169||4,889||n/a||233\n|}\nThe population of the town increased continuously during the last 150 years with only two smaller setbacks caused by World War I and World War II. Hungarians were the most populous ethnicity until 1951 when German speaking people were recorded for the first time as the largest group. The number of Hungarians reached its peak in 1920 with 3,138 people (75% of the total population). In the second half of the 20th century they decreased both in numbers and percentage, reaching the lowest point in 1971 with only 204 people. The community was growing again in the last decades of the century. The small Roma minority disappeared after the hardships of Nazi rule. The number of Croatians only began growing in the last two decades of the 20th century.\nNotable people\n, 2019]]\n* Norbert Leser (1933–2014), an Austrian jurist, political scientist and social philosopher\n* Eduard Müller (born 1962), an Austrian politician and author\n* Helmut Hödl (born 1969), an Austrian clarinetist and composer.\nSport\n* Patrick Bürger (born 1987), an Austrian footballer who has played over 330 games\n* Stefan Rakowitz (born 1990), an Austrian footballer who has played over 300 games\n* Michael Huber (born 1990), an Austrian footballer who has played over 350 games\n* Patrick Farkas (born 1992), an Austrian footballer who has played over 340 games\nSports\nOberwart is home to Oberwart Gunners of the Austrian Basketball Bundesliga.\nReferences\nExternal links\n*\n*"
    }
  ]
}