{
  "content": [
    {
      "type": "text",
      "text": "# Ochre Coloured Pottery culture__disambig_1\n\n|title=Ahichchhatra\n|type2=point\n|coord2=\n|title2=Bahadrabad\n|type3=point\n|coord3=\n|title3=Bargaon\n|type4=point\n|coord4=\n|title4=Bisauli\n|type5=point\n|coord5=\n|title5=Fatehgarh\n|type6=point\n|coord6=\n|title6=Hastinapur\n|type7=point\n|coord7=\n|title7=Hulas\n|type8=point\n|coord8=\n|title8=Jhinjhana\n|type9=point\n|coord9=\n|title9=Katpalon\n|type10=point\n|coord10=\n|title10=Kausambi\n|type11=point\n|coord11=\n|title11=Mitathal\n|type12=point\n|coord12=\n|title12=Red fort\n}}\n|extra       = Extensive copper  metallurgyBurials with pots and copper weapons\n|precededby  = Neolithic\n|followedby  = Black and red warePainted Grey Ware culture\n}}\nThe Ochre Coloured Pottery culture (OCP) is a Bronze Age culture of the Indo-Gangetic Plain \"generally dated 2000–1500 BCE,\" extending from eastern Punjab to northeastern Rajasthan and western Uttar Pradesh.\nArtefacts of this culture show similarities with both the Late Harappan culture and the Vedic culture. Archaeologist Akinori Uesugi considers it as an archaeological continuity of the previous Harappan Bara style, while according to Parpola, the find of carts in this culture may reflect an Indo-Iranian migration into the India subcontinent, in contact with Late Harappans. The OCP marked the last stage of the North Indian Bronze Age and was succeeded by the Painted Grey Ware culture and then Northern Black polished ware.\nGeography and dating\nThe 'Ochre Coloured Pottery culture is \"generally dated 2000-1500 BCE,\" Early specimens of the characteristic ceramics found near Jodhpura, Rajasthan, date from the 3rd millennium (this Jodhpura is located in the district of Jaipur and should not be confused with the city of Jodhpur). Several sites of culture flourish along the banks of Sahibi River and its tributaries such as Krishnavati river and Soti river, all originating from the Aravalli range and flowing from south to north-east direction towards Yamuna before disappearing in Mahendragarh district of Haryana. The OCP sites of Atranjikhera, Lal Qila, Jhinjhana and Nasirpur are dated to from 2600 to 1200 BC.\n, c.2000-1750 BCE]]\nThe culture reached the Gangetic plain in the early 2nd millennium. Recently, the Archaeological Survey of India discovered copper axes and some pieces of pottery in its excavation at the Saharanpur district of Uttar Pradesh.\nPottery\nThe pottery had a red slip but gave off an ochre color on the fingers of archaeologists who excavated it, hence the name. It was sometimes decorated with black painted bands and incised patterns. It is often found in association with copper hoards, which are assemblages of copper weapons and other artifacts such as anthropomorphic figures.\nAgriculture\nOCP culture was rural and agricultural, characterized by cultivation of rice, barley, and legumes, and domestication of cattle, sheep, goats, pigs, horses, and dogs. Most sites were small villages in size, but densely distributed. Houses were typically made of wattle-and-daub. Other artifacts include animal and human figurines, and ornaments made of copper and terracotta.\nCopper hoards\nThe term copper hoards refers to different assemblages of copper-based artefacts in the northern areas of the Indian subcontinent that are believed to date from the 2nd millennium BC. Few derive from controlled excavations and several different regional groups are identifiable: southern Haryana/northern Rajasthan, the Ganges-Yamuna plain, Chota Nagpur, and Madhya Pradesh, each with their characteristic artefact types. Initially, the copper hoards were known mostly from the Ganges-Yamuna doab and most characterizations dwell on this material.\nCharacteristic hoard artefacts from southern Haryana/northern Rajasthan include flat axes (celts), harpoons, double axes, and antenna-hilted swords. The doab has a related repertory. Artefacts from the Chota Nagpur area are very different; they seem to resemble ingots and are votive in character.\n(212 km from New Delhi), Badaun district, Uttar Pradesh]]\n]]\nThe raw material may have been derived from a variety of sources in Rajasthan (Khetri), Bihar, West Bengal, Odisha (especially Singhbhum), and Madhya Pradesh (Malanjkhand).\nHarappan Civilization and Indo-Iranians\ns (after EIEC). The Andronovo, BMAC and Yaz cultures have often been associated with Indo-Iranian migrations. The GGC, Cemetery H, Copper Hoard and PGW cultures are candidates for cultures associated with Indo-Aryan movements.]]\nArtefacts of this culture show similarities with both the Late Harappan culture and the Vedic culture, and the OCP may have been infiltrated by an Indo-Iranian migration into the India subcontinent coming into contact with Late Harappans.\nVarious opinions exist on the origins of the OCP. There are relations with the Late Harappan phase, and some consider it as a token of this culture. Others regard it to be an independent cultural style. Archaeologist Akinori Uesugi dates Ochre Coloured Pottery culture to -1300 BCE, considering it as a Late Harappan expansion and  archaeological continuity of the previous Bara style ( and 1900 BCE), which was a regional culture of the Ghaggar valley rooted in the Indus Civilization, calling it the Bara-OCP cultural complex.\n.]]\nWhile the ASI-archaeologists conducting the investigation describe the chariots buried as horse drawn chariots, similarities have been noted by Parpola between the use of carts, as attested in burial practices at Sinauli, and Indo-Iranian culture. Reflecting on these finds, Parpola rejects the identification of these carts as horse-pulled chariots, instead considering them to be ox-pulled carts and part of an early wave of Indo-Iranian settlers, coming into contact with Late Harappan culture:\n}}\nAccording to Kumar, while the eastern OCP did not use Indus script, the whole of OCP had nearly the same material culture and likely spoke the same language throughout its expanse. OCP culture was a contemporary neighbor to Harappan civilization, and between 2500 BC and 2000 BC, the people of Upper Ganga valley were using Indus script.\nSee also\n*Kallur archaeological site\nReferences\nSources\n*\n*\n*\n*\n*\n*\n*\n*\n*"
    }
  ]
}