{
  "content": [
    {
      "type": "text",
      "text": "# Odditorium or Warlords of Mars__disambig_1\n\n| length     = 62:09\n| label      = Capitol\n| producer   =\n* Courtney Taylor-Taylor\n* Gregg Williams\n| prev_title = The Black Album/Come On Feel The Dandy Warhols\n| prev_year  = 2004\n| next_title = ...Earth to the Dandy Warhols...\n| next_year  = 2008\n| misc       =\n}}\nOdditorium or Warlords of Mars is the fifth studio album by American rock band The Dandy Warhols. It was recorded from April 2004 to January 2005 in the band's own Odditorium studio, and was released on September 13, 2005, through Capitol Records; their final album before parting ways with the label.\nThe album is a return to the psychedelic, guitar-based sound of the group's earlier records, following their foray into a new wave style with 2003's Welcome to the Monkey House. The album failed to meet up to the commercial success of its predecessors and received a mixed response from music critics. Two singles were released from the album: \"Smoke It\" and \"All the Money or the Simple Life Honey\".\nBackground and production\nThe album's title references the novel The Warlord of Mars by Edgar Rice Burroughs as well as the band's Portland, Oregon pad The Odditorium, where the album was recorded from between April 2004 and January 2005. It was produced by Courtney Taylor-Taylor and Gregg Williams. Bandmember Zia McCabe worked on the album during a pregnancy with her first child, Matilda Louise, and gave birth only a week after its completion.\nRelease\nThe first single from the album, \"Smoke It\", was released on August 29, 2005. It peaked at No. 59 on the UK Singles Chart. The Guardian praised the song, saying it \"reeks of rock's decadent best\". The song was featured in \"Cheatty Cheatty Bang Bang\", an episode of Veronica Mars.\nOdditorium or Warlords of Mars was released on September 13, 2005. It peaked at No. 89 in the US Billboard chart—their second highest charting album to date—and No. 67 in the UK, staying in both charts for only one week.\nThe album's second and final single, \"All the Money or the Simple Life Honey\", was released on October 29.\nReception\n| rev1 = AllMusic\n| rev1score =\n| rev2 = Robert Christgau\n| rev2score =\n| rev3 = Drowned in Sound\n| rev3score = 8/10\n| rev4 = The Guardian\n| rev4score =\n| rev5 = NME\n| rev5score = 6/10\n| rev6 = Pitchfork\n| rev6score = 1.2/10\n| rev7 = PopMatters\n| rev7score = 5/10\n| rev8 = Rolling Stone\n| rev8score =\n}}\nCritics were divided on their opinion of the album. The Guardian wrote, \"The Dandy Warhols seem to knock out great music as easily as getting out of bed. Their fifth album further expands their palette of effortless cool\", calling it \"their best yet.\" Drowned in Sound called it \"an album full of creative magic and songwriting gems.\" Trouser Press wrote: \"Odditorium is the Dandys' magnum opus, a sprawling, rambling but somehow coherent result of the ambitions developed on previous albums\".\nAllMusic, on the other hand, called it \"half inspired, half-embarrassing and completely self-indulgent.\" Pitchfork gave the album an exceptionally low 1.2/10 rating, writing \"only the truly earless would mistake this assortment of bloated in-jokes and interminable, sub-song drones for some kind of masterpiece.\" Alternative Press wrote, \"Basically, Odditorium sounds like a giant \"fuck you\" to [their] record label.\" The album appeared at number 242 in the Village Voice annual Pazz and Jop critics poll.\nFrontman Courtney Taylor-Taylor once called the album \"definitely the strongest we've ever made\", though would later state it was \"a f**k(sic) you record. Drop us, please, we want off your label.\"\nTrack listing\nPersonnel\nThe Dandy Warhols\n* Courtney Taylor-Taylor – vocals, guitar, keyboards, percussion, production, album cover concept\n* Peter Holmström – guitar, vocals\n* Zia McCabe – keyboards, vocals\n* Brent DeBoer – drums, guitar, vocals\nAdditional personnel\n* Lockett Allbritton – vocals on \"Did You Make a Song with Otis\"\n* Achilleas Anastasopolis –  trumpet\n* Eric Early – banjo\n* John Fell – additional vocals on \"Did You Make a Song with Otis\"\n* Sean Gothman – \"number nine\" on \"Smoke It\"\n* Travis Hendricks – trombone, additional vocals on \"Did You Make a Song with Otis\"\n* Herb Kirshrot – accordion\n* Bill Kurtis – narration on \"Colder Than the Coldest Winter Was Cold\"\n* Michele Loew – additional vocals on \"Holding Me Up\"\n* Caleb Spiegel – additional vocals on \"Holding Me Up\"\n* Gregg Williams – additional percussion, additional vocals on \"Did You Make a Song with Otis\"\n* Steven Birch – album design, layout\n* Tchad Blake – mixing\n* Ted Jensen – mastering\n* Clark Stiles – editing, additional production\n* Gregg Williams – production, recording, editing\n* Scott Young – album front cover artwork\nCharts\n{| class=\"wikitable sortable plainrowheaders\"\n|+ Chart performance for Odditorium or Warlords of Mars\n! scope=\"col\"| Chart (2005)\n! scope=\"col\"| Peakposition\n|-\n|-\n|-\n|-\n|-\n|-\n|-\n|-\n|}\nReferences\nExternal links\n* [http://www.dandywarhols.com/records/odditorium/ Odditorium or Warlords of Mars] at The Dandy Warhols' official website\n*"
    }
  ]
}