{
  "content": [
    {
      "type": "text",
      "text": "# Oekingen\n\n| postal_code\t\t= 4566\n| municipality_code\t= 2529\n| area\t\t\t= 2.4\n| elevation\t\t= 450|elevation_description=\n| population\t\t=  | populationof =  |  popofyear =\n| website\t\t= www.oekingen.ch\n| mayor\t\t= |mayor_asof=|mayor_party=\n| mayor_title\t= |list_of_mayors\t=\n| places\t\t=\n| demonym\t\t=\n| neighboring_municipalities= Derendingen, Halten, Hersiwil, Horriwil, Kriegstetten, Subingen\n| twintowns\t\t=\n|}}\nOekingen is a municipality in the district of Wasseramt in the canton of Solothurn in Switzerland.\nHistory\nOekingen is first mentioned in 1263 as Otechingen.\nGeography\nOekingen has an area, , of .  Of this area,  or 63.8% is used for agricultural purposes, while  or 25.0% is forested.   Of the rest of the land,  or 13.3% is settled (buildings or roads).\nOf the built up area, housing and buildings made up 7.5% and transportation infrastructure made up 5.4%.  Out of the forested land, 23.8% of the total land area is heavily forested and 1.3% is covered with orchards or small clusters of trees.  Of the agricultural land, 48.3% is used for growing crops and 14.2% is pastures, while 1.3% is used for orchards or vine crops.\nThe municipality is located in the Wasseramt district, along the Oesch river.  It consists of the linear village of Oekingen.\nCoat of arms\nThe blazon of the municipal coat of arms is Gules a Horse Argent running above a Base Vert.\nDemographics\nOekingen has a population (|lc=on}}) of .  , 4.1% of the population are resident foreign nationals.  Over the last 10 years (1999–2009 ) the population has changed at a rate of 5.7%.  It has changed at a rate of 2.5% due to migration and at a rate of 3.6% due to births and deaths.\nMost of the population () speaks German (641 or 97.4%), with Portuguese being second most common (8 or 1.2%) and French being third (4 or 0.6%).\n, the gender distribution of the population was 49.6% male and 50.4% female.  The population was made up of 332 Swiss men (45.9% of the population) and 27 (3.7%) non-Swiss men.  There were 342 Swiss women (47.2%) and 23 (3.2%) non-Swiss women.  Of the population in the municipality 246 or about 37.4% were born in Oekingen and lived there in 2000.  There were 231 or 35.1% who were born in the same canton, while 133 or 20.2% were born somewhere else in Switzerland, and 31 or 4.7% were born outside of Switzerland.\nIn  there were 7 live births to Swiss citizens and were 5 deaths of Swiss citizens.  Ignoring immigration and emigration, the population of Swiss citizens increased by 2 while the foreign population remained the same.  There was 1 Swiss woman who immigrated back to Switzerland.  The total Swiss population change in 2008 (from all sources, including moves across municipal borders) was a decrease of 11 and the non-Swiss population increased by 9 people.  This represents a population growth rate of -0.3%.\nThe age distribution, , in Oekingen is; 39 children or 5.9% of the population are between 0 and 6 years old and 137 teenagers or 20.8% are between 7 and 19.  Of the adult population, 32 people or 4.9% of the population are between 20 and 24 years old.  178 people or 27.1% are between 25 and 44, and 184 people or 28.0% are between 45 and 64.  The senior population distribution is 66 people or 10.0% of the population are between 65 and 79 years old and there are 22 people or 3.3% who are over 80.\n, there were 255 people who were single and never married in the municipality.  There were 348 married individuals, 37 widows or widowers and 18 individuals who are divorced.\n, there were 240 private households in the municipality, and an average of 2.7 persons per household.  There were 40 households that consist of only one person and 31 households with five or more people.  Out of a total of 244 households that answered this question, 16.4% were households made up of just one person and there were 1 adults who lived with their parents.  Of the rest of the households, there are 89 married couples without children, 97 married couples with children  There were 10 single parents with a child or children.  There were 3 households that were made up of unrelated people and 4 households that were made up of some sort of institution or another collective housing.\nthere were 168 single family homes (or 82.0% of the total) out of a total of 205 inhabited buildings.  There were 23 multi-family buildings (11.2%), along with 13 multi-purpose buildings that were mostly used for housing (6.3%) and 1 other use buildings (commercial or industrial) that also had some housing (0.5%).  Of the single family homes 7 were built before 1919, while 32 were built between 1990 and 2000.  The greatest number of single family homes (35) were built between 1971 and 1980.\nthere were 243 apartments in the municipality.  The most common apartment size was 5 rooms of which there were 82.  There were 3 single room apartments and 137 apartments with five or more rooms.  Of these apartments, a total of 237 apartments (97.5% of the total) were permanently occupied, while 3 apartments (1.2%) were seasonally occupied and 3 apartments (1.2%) were empty.  , the construction rate of new housing units was 4.2 new units per 1000 residents.  The vacancy rate for the municipality, , was 1.05%.\nThe historical population is given in the following chart:\nColors=\nid:lightgrey value:gray(0.9)\nid:darkgrey  value:gray(0.8)\nImageSize  = width:1020 height:210\nPlotArea   = height:150 left:100 bottom:50 right:100\nAlignBars  = justify\nDateFormat = x.y\nPeriod     = from:0 till:660\nTimeAxis   = orientation:vertical\nAlignBars  = justify\nScaleMajor = gridcolor:darkgrey increment:100 start:0\nScaleMinor = gridcolor:lightgrey increment:20 start:0\nPlotData=\ncolor:yellowgreen width:40   mark:(line,white) align:center\nbar:1798 from:start till:145 text:\"145\"\nbar:1850 from:start till:273 text:\"273\"\nbar:1860 from:start till:258 text:\"258\"\nbar:1870 from:start till:312 text:\"312\"\nbar:1880 from:start till:263 text:\"263\"\nbar:1888 from:start till:271 text:\"271\"\nbar:1900 from:start till:401 text:\"401\"\nbar:1910 from:start till:465 text:\"465\"\nbar:1920 from:start till:481 text:\"481\"\nbar:1930 from:start till:466 text:\"466\"\nbar:1941 from:start till:469 text:\"469\"\nbar:1950 from:start till:506 text:\"506\"\nbar:1960 from:start till:538 text:\"538\"\nbar:1970 from:start till:506 text:\"506\"\nbar:1980 from:start till:530 text:\"530\"\nbar:1990 from:start till:602 text:\"602\"\nbar:2000 from:start till:658 text:\"658\"\nPolitics\nIn the 2007 federal election the most popular party was the SP which received 25.46% of the vote.  The next three most popular parties were the CVP (22.96%), the SVP (22.11%) and the FDP (17.59%).  In the federal election, a total of 293 votes were cast, and the voter turnout was 54.1%.\nEconomy\n, Oekingen had an unemployment rate of 1.7%.  , there were 20 people employed in the primary economic sector and about 8 businesses involved in this sector.  9 people were employed in the secondary sector and there were 2 businesses in this sector.  16 people were employed in the tertiary sector, with 8 businesses in this sector.  There were 352 residents of the municipality who were employed in some capacity, of which females made up 41.5% of the workforce.\nthe total number of full-time equivalent jobs was 35.  The number of jobs in the primary sector was 14, all of which were in agriculture.  The number of jobs in the secondary sector was 8, all of which were in manufacturing.  The number of jobs in the tertiary sector was 13.  In the tertiary sector; 4 or 30.8% were in wholesale or retail sales or the repair of motor vehicles, 3 or 23.1% were in the movement and storage of goods, 3 or 23.1% were in a hotel or restaurant, 2 or 15.4% were technical professionals or scientists, 1 was in education.\n, there were 13 workers who commuted into the municipality and 305 workers who commuted away.  The municipality is a net exporter of workers, with about 23.5 workers leaving the municipality for every one entering.  Of the working population, 13.9% used public transportation to get to work, and 61.1% used a private car.\nReligion\nFrom the , 266 or 40.4% were Roman Catholic, while 267 or 40.6% belonged to the Swiss Reformed Church.  Of the rest of the population, there were 3 members of an Orthodox church (or about 0.46% of the population), there were 6 individuals (or about 0.91% of the population) who belonged to the Christian Catholic Church, and there were 15 individuals (or about 2.28% of the population) who belonged to another Christian church.  There was 1 individual who was Jewish, and   83 (or about 12.61% of the population) belonged to no church, are agnostic or atheist, and 17 individuals (or about 2.58% of the population) did not answer the question.\nEducation\nIn Oekingen about 266 or (40.4%) of the population have completed non-mandatory upper secondary education, and 78 or (11.9%) have completed additional higher education (either university or a Fachhochschule).  Of the 78 who completed tertiary schooling, 71.8% were Swiss men, 21.8% were Swiss women.\n, there was one student in Oekingen who came from another municipality, while 83 residents attended schools outside the municipality.\nReferences\nExternal links\n* [http://www.oekingen.ch Official website]"
    }
  ]
}