{
  "content": [
    {
      "type": "text",
      "text": "# Office of the President of Uganda\n\nThe Office of the President of Uganda is the central executive support institution that assists the President and Vice President to perform constitutional and administrative duties. It provides policy coordination, cabinet support, communications, and oversight of presidential programs. It also supervises Resident District Commissioners (RDCs) and City Commissioners (CCs) across the country.\nConstitutional and legal basis\nThe 1995 Constitution of Uganda vests executive authority in the President and establishes the Office’s core mandate through Articles 98, 99, and 108. These provisions define the offices of the President and Vice President and require the President to execute and maintain the Constitution and the laws of Uganda.\nResident District Commissioners are provided for under Article 203 of the Constitution and related provisions of the Local Government Act, which set out their functions and appointment.\nFunctions\nThe Office supports the Presidency, coordinates cabinet affairs, monitors delivery of government programs, and manages national protocol in line with approved guidelines. State House provides logistical, security, and welfare support to the President, the Vice President, and their families. The Office also hosts or coordinates special units and initiatives that channel citizen complaints, track implementation of the government manifesto, and organize national functions.\nAttached Agencies and Units\n{| class=\"wikitable\"\n!Category\n!Agency / Unit\n!Role\n|-\n|Security & Intelligence\n|Internal Security Organisation (ISO)\n|Internal intelligence and counter-intelligence\n|-\n|\n|External Security Organisation (ESO)\n|Foreign intelligence\n|-\n|\n|Special Forces Command (SFC)*\n|Elite security unit responsible for presidential protection\n|-\n|Governance & Oversight\n|Inspectorate of Government (IGG)*\n|Anti-corruption and leadership code enforcement\n|-\n|\n|State House Anti-Corruption Unit\n|Investigates corruption complaints from citizens\n|-\n|\n|Manifesto Implementation Unit\n|Tracks implementation of NRM Government Manifesto\n|-\n|\n|Directorate for Socio-Economic Monitoring\n|Monitors delivery of government programs\n|-\n|Community & Political Mobilisation\n|Office of the National Chairman (ONC) – NRM\n|Political mobilization under the NRM\n|-\n|\n|National Secretariat for Patriotism Clubs\n|Patriotism promotion among youth\n|-\n|\n|Resident District Commissioners (RDCs) & City Commissioners (RCCs)\n|President’s representatives in districts and cities\n|-\n|Research & Policy Support\n|Presidential Advisory Committees (PACs)\n|Sector-specific advisory units to the President\n|-\n|\n|Presidential CEO Forum\n|Interface with private sector leaders\n|-\n|Economic and Special Programs\n|Presidential Initiative on Skilling the Girl/Boy Child (PISGBC)\n|Vocational skills training\n|-\n|\n|Presidential Industrial Hubs\n|Youth skilling and enterprise creation\n|-\n|\n|Operation Wealth Creation (OWC)*\n|Agricultural production and input distribution\n|-\n|\n|Presidential Initiative on Science and Technology\n|Innovation support and research\n|-\n|\n|Presidential Advisory Committee on Exports and Industrial Development (PACEID)\n|Export promotion\n|-\n|\n|Presidential Zonal Industrial Hubs\n|Regional youth skilling\n|-\n|Protocol, Administration & Services\n|State House Comptroller\n|Manages State House finances and logistics\n|-\n|\n|State House Health Monitoring Unit\n|Oversees health service delivery complaints\n|-\n|\n|Presidential Press Unit (PPU)\n|Media and communication for the President\n|-\n|\n|Presidential Awards Committee (Chancellery of Honours)\n|National medals and awards\n|-\n|\n|Uganda Aids Commission*\n|National HIV/AIDS coordination (reports to President)\n|}\nStructure and leadership\nThe Minister for the Presidency currently Milly Babirye Babalanda serves as executive head of the Presidency and works alongside ministers responsible for portfolios that are administratively under or closely linked to the Office. These include Security, Science, Technology and Innovation, Kampala Capital City and Metropolitan Affairs, Economic Monitoring, Ethics and Integrity, and the Office of the Vice President.\nThe Cabinet Secretariat and other directorates provide policy support and coordination across Ministries, Departments, and Agencies. State House operates as the administrative and logistical arm that directly supports the President and the Vice President.\nResident District and City Commissioners\nThere is a Resident District Commissioner for each district and a Resident City Commissioner for each city. Commissioners represent the President at the local level, monitor delivery of central and local government services, and chair district security committees. Parliament may assign additional functions by law.\nLocation\nHead offices are in Kampala. State House Entebbe is the principal official residence and office of the President.\nSee also\n* Constitution of Uganda\n* Parliament of Uganda\n* Office of the Auditor-General (Uganda)\nReferences\nExternal links\n* [https://www.op.go.ug/ Official Website]"
    }
  ]
}