{
  "content": [
    {
      "type": "text",
      "text": "# Offshore aquaculture\n\ns similar to these inshore cages, except they are submerged and moved offshore into deeper water.]]\nOffshore aquaculture, also known as open water aquaculture or open ocean aquaculture, is an emerging approach to mariculture (seawater aquafarming) where fish farms are positioned in deeper and less sheltered waters some distance away from the coast, where the cultivated fish stocks are exposed to more naturalistic living conditions with stronger ocean currents and more diverse nutrient flow. Existing \"offshore\" developments fall mainly into the category of exposed areas rather than fully offshore. As maritime classification society DNV GL has stated, development and knowledge-building are needed in several fields for the available deeper water opportunities to be realized.\nOne of the concerns with inshore aquaculture, which operate on more sheltered (and thus calmer) shallow waters, is that the discarded nutrients from unconsumed feeds and feces can accumulate on the farm's seafloor and damage the benthic ecosystem, and sometimes contribute to algal blooms. According to proponents of offshore aquaculture, the wastes from aquafarms that have been moved offshore tend to be swept away and diluted into the open ocean. Moving aquaculture offshore also provides more ecological space where production yields can expand to meet the increasing market demands for fish. Offshore facilities also avoid many of the conflicts with other marine resource users in the more crowded inshore waters, though there can still be user conflicts offshore.\nCritics are concerned about issues such as the ongoing consequences of using antibiotics and other drug pollutions, and the possibilities of cultured fish escaping and spreading disease among wild fish.\nBackground\nAquaculture is the most rapidly expanding food industry in the world as a result of declining wild fisheries stocks and profitable business. In 2008, aquaculture provided 45.7% of the fish produced globally for human consumption; increasing at a mean rate of 6.6% a year since 1970.\nIn 1970, a National Oceanic and Atmospheric Administration (NOAA) grant brought together a group of oceanographers, engineers and marine biologists to explore whether offshore aquaculture, which was then considered a futuristic activity, was feasible. In the United States, the future of offshore aquaculture technology within federal waters has become much talked-about. As many commercial operations show, it is now technically possible to culture finfish, shellfish, and seaweeds using offshore aquaculture technology.\nMajor challenges for the offshore aquaculture industry involve designing and deploying cages that can withstand storms, dealing with the logistics of working many kilometers from land, and finding species that are sufficiently profitable to cover the costs of rearing fish in exposed offshore areas.\nTechnology\nTo withstand the high energy offshore environment, farms must be built to be more robust than those inshore. However, the design of the offshore technology is developing rapidly, aimed at reducing cost and maintenance.\nWhile the ranching systems currently used for tuna use open net cages at the surface of the sea (as is done also in salmon farming), the offshore technology usually uses submersible cages. These large rigid cages – each one able to hold many thousands of fish – are anchored on the sea floor, but can move up and down the water column. They are attached to buoys on the surface which frequently contain a mechanism for feeding and storage for equipment. Similar technology is being used in waters near the Bahamas, China, the Philippines, Portugal, Puerto Rico, and Spain. By submerging cages or shellfish culture systems, wave effects are minimized and interference with boating and shipping is reduced. Offshore farms can be made more efficient and safer if remote control is used, and technologies such as an 18-tonne buoy that feeds and monitors fish automatically over long periods are being developed.\nExisting offshore structures\nMulti-functional use of offshore waters can lead to more sustainable aquaculture \"in areas that can be simultaneously used for other activities such as energy production\". Operations for finfish and shellfish are being developed. For example, the Hubb-Sea World Research Institutes’ project to convert a retired oil platform 10&nbsp;nm off the southern California coast to an experimental offshore aquaculture facility. The institute plans to grow mussels and red abalone on the actual platform, as well as white seabass, striped bass, bluefin tuna, California halibut and California yellowtail in floating cages.\nIntegrated multi-trophic aquaculture\nIntegrated multi-trophic aquaculture (IMTA), or polyculture, occurs when species which must be fed, such as finfish, are cultured alongside species which can feed on dissolved nutrients, such as seaweeds, or organic wastes, such as suspension feeders and deposit feeders. This sustainable method could solve several problems with offshore aquaculture.  The method is being pioneered in Spain, Canada, and elsewhere.\nRoaming cages\nRoaming cages have been envisioned as the \"next generation technology\" for offshore aquaculture. These are large mobile cages powered by thrusters and able to take advantage of ocean currents. One idea is that juvenile tuna, starting out in mobile cages in Mexico, could reach Japan after a few months, matured and ready for the market. However, implementing such ideas will have regulatory and legal implications.\nSpace conflicts\nAs oceans industrialise, conflicts are increasing among the users of marine space. This competition for marine space is developing in a context where natural resources can be seen as publicly owned. There can be conflict with the tourism industry, recreational fishers, wild harvest fisheries and the siting of marine renewable energy installations. The problems can be aggravated by the remoteness of many marine areas, and difficulties with monitoring and enforcement. On the other hand, remote sites can be chosen that avoid conflicts with other users, and allow large scale operations with resulting economies of scale. Offshore systems can provide alternatives for countries with few suitable inshore sites, like Spain.\nEcological impacts\nThe ecological impacts of offshore aquaculture are somewhat uncertain because it is still largely in the research stage.\nMany of the concerns over potential offshore aquaculture impacts are paralleled by similar, well established concerns over inshore aquaculture practices.\nPollution\nOne of the concerns with inshore farms is that discarded nutrients and feces can settle on the seafloor and disturb the benthos. The \"dilution of nutrients\" that occurs in deeper water is a strong reason to move coastal aquaculture offshore into the open ocean. How much nutrient pollution and damage to the seafloor occurs depends on the feed conversion efficiency of the species, the flushing rate and the size of the operation.  However, dissolved and particulate nutrients are still released to the environment. Future offshore farms will probably be much larger than inshore farms today, and will therefore generate more waste. The point at which the capacity of offshore ecosystems to assimilate waste from offshore aquaculture operations will be exceeded is yet to be defined.\nWild caught feed\nAs with the inshore aquaculture of carnivorous fish, a large proportion of the feed comes from wild forage fish.  Except for a few countries, offshore aquaculture has focused predominantly on high value carnivorous fish.  If the industry attempts to expand with this focus then the supply of these wild fish will become ecologically unsustainable.\nFish escapes\nThe expense of offshore systems means it is important to avoid fish escapes. However, it is likely there will be escapes as the offshore industry expands. This could have significant consequences for native species, even if the farmed fish are inside their native range. Submersible cages are fully closed and therefore escapes can only occur through damage to the structure. Offshore cages must withstand the high energy of the environment and attacks by predators such as sharks. The outer netting is made of Spectra – a super-strong polyethylene fibre – wrapped tightly around the frame, leaving no slack for predators to grip.  However, the fertilised eggs of cod are able to pass through the cage mesh in ocean enclosures.\nDisease\nCompared to inshore aquaculture, disease problems currently appear to be much reduced when farming offshore. For example, parasitic infections that occur in mussels cultured offshore are much smaller than those cultured inshore. However, new species are now being farmed offshore although little is known about their ecology and epidemiology. The implications of transmitting pathogens between such farmed species and wild species \"remains a large and unanswered question\".\nSpreading of pathogens between fish stocks is a major issue in disease control. Static offshore cages may help minimize direct spreading, as there may be greater distances between aquaculture production areas. However, development of roaming cage technology could bring about new issues with disease transfer and spread. The high level of carnivorous aquaculture production results in an increased demand for live aquatic animals for production and breeding purposes such as bait, broodstock and milt. This can result in spread of disease across species barriers.\nEmployment\nAquaculture is encouraged by many governments as a way to generate jobs and income, particularly when wild fisheries have been run down. However, this may not apply to offshore aquaculture. Offshore aquaculture entails high equipment and supply costs, and therefore will be under severe pressure to lower labor costs through automated production technologies. Employment is likely to expand more at processing facilities than grow-out industries as offshore aquaculture develops.\nProspects\nAs of 2008, Norway and the United States were making the main investments in the design of offshore cages.\nFAO\nIn 2010, the Food and Agriculture Organization (FAO) sub-committee on aquaculture made the following assessments:\n::\"Most Members thought it inevitable that aquaculture will move further offshore if the world is to meet its growing demand for seafood and urged the development of appropriate technologies for its expansion and assistance to developing countries in accessing them [...] Some Members noted that aquaculture may also develop offshore in large inland water bodies and discussion should extend to inland waters as well [...] Some Members suggested caution regarding potential negative impacts when developing offshore aquaculture.\nThe  sub-committee recommended the FAO \"should work towards clarifying the technical and legal terminology related to offshore aquaculture in order to avoid confusion.\"\nEurope\nIn 2002, the European Commission issued the following policy statement on aquaculture:\n::\"Fish cages should be moved further from the coast, and more research and development of offshore cage technology must be promoted to this end. Experience from outside the aquaculture sector, e.g. with oil platforms, may well feed into the aquaculture equipment sector, allowing for savings in the development costs of technologies.\"\nBy 2008, European offshore systems were operating in Norway, Ireland, Italy, Spain, Greece, Cyprus, Malta, Croatia, Portugal and Libya.\nIn Ireland, as part of their National Development Plan, it is envisioned that over the period 2007–2013, technology associated with offshore aquaculture systems will be developed, including: \"sensor systems for feeding, biomass and health monitoring, feed control, telemetry and communications [and] cage design, materials, structural testing and modelling.\"\nUnited States\nMoving aquaculture offshore into the exclusive economic zone (EEZ) can cause complications with regulations. In the United States, regulatory control of the coastal states generally extends to 3 nm, while federal waters (or EEZ) extend to 200&nbsp;nm offshore. Therefore, offshore aquaculture can be sited outside the reach of state law but within federal jurisdiction.  As of 2010, \"all commercial aquaculture facilities have been sited in nearshore waters under state or territorial jurisdiction.\" However, \"unclear regulatory processes\" and \"technical uncertainties related to working in offshore areas\" have hindered progress. The five offshore research projects and commercial operations in the US – in New Hampshire, Puerto Rico, Hawaii and California – are all in federal waters. In June 2011, the National Sustainable Offshore Aquaculture Act of 2011 was introduced to the House of Representatives \"to establish a regulatory system and research program for sustainable offshore aquaculture in the United States exclusive economic zone\".\nCurrent species\nBy 2005, offshore aquaculture was present in 25 countries, both as experimental and commercial farms. Market demand means that the most offshore farming efforts are directed towards raising finfish.  Two commercial operations in the US, and a third in the Bahamas are using submersible cages to raise high-value carnivorous finfish, such as moi, cobia, and mutton snapper. Submersible cages are also being used in experimental systems for halibut, haddock, cod, and summer flounder in New Hampshire waters, and for amberjack, red drum, snapper, pompano, and cobia in the Gulf of Mexico.\nThe offshore aquaculture of shellfish grown in suspended culture systems, like scallops and mussels, is gaining ground. Suspended culture systems include methods where the shellfish are grown on a tethered rope or suspended from a floating raft in net containers. Mussels in particular can survive the high physical stress levels which occur in the volatile environments that occur in offshore waters. Finfish species must be feed regularly, but shellfish do not, which can reduce costs. The University of New Hampshire in the US has conducted research on the farming of blue mussels submerged in an open ocean environment. They have found that when farmed in less polluted waters offshore, the mussels develop more flesh with lighter shells.\nGlobal status\n{| class=\"wikitable\"\n| colspan=4 style=\"text-align:center;\" | Global status of offshore aquaculture Aquaculture Collaborative Research Support Program\n|-\n! Location\n! Species\n! Status\n! Comment\n|-\n| Australia\n| tuna\n| align=center | C\n| 10,000 tonnes/year worth A$250 million\n|-\n| California\n| striped bass, California yellowtail, Pacific halibut, abalone\n| align=center | E/C\n| Attempts to produce from an oil platform\n|-\n| Canada\n| cod, sablefish, mussels, salmon\n|\n| Mussels established in eastern Canada\n|-\n| Canary Islands\n| seabass, seabream\n| align=center |\n| Two cages installed but not now used\n|-\n| China\n| unknown finfish, scallops\n| align=center | E\n| Small scale experiments on finfish\n|-\n| Croatia\n| tuna\n| align=center | C\n| 8 offshore cages (1998)\n|-\n| Cyprus\n| seabass, seabream\n| align=center | C\n| 8 offshore cages (1998)\n|-\n| Faeroe Island\n|\n| align=center |\n| Failed trials\n|-\n| France\n| seabass, seabream\n| align=center | C\n| 13 offshore cages (1998)\n|-\n| Germany\n| seaweed, mussels\n| align=center | E\n| Trials using wind-farms\n|-\n| Greece\n| seabass, seabream\n| align=center | C\n|\n|-\n| Hawaii\n| amberjack, Pacific threadfin\n| align=center | C\n|\n|-\n| Ireland\n| Atlantic salmon\n| align=center | E\n| Various experimental projects\n|-\n| Italy\n| seabass, seabream, tuna\n| align=center | C\n|\n|-\n| Japan\n| tuna, mussels\n| align=center | C\n| Commercial tuna ranching, offshore mussel long-lines.\n|-\n| Korea\n| scallop\n|\n|\n|-\n| Malta\n| seabass, seabream, tuna\n| align=center | C\n| 3 offshore cages (1998)\n|-\n| Mexico\n| tuna\n| align=center | E\n|\n|-\n| Morocco\n| tuna\n| align=center | C\n|\n|-\n| New Hampshire\n| Atlantic halibut, cod, haddock, mussels, sea scallops, summer flounder\n| align=center | E/C\n| Experimental work from the University of New Hampshire, two commercial mussel sites\n|-\n| New Zealand\n| mussels\n|\n| About to become operational\n|-\n| Panama\n| tuna\n| align=center | C\n|\n|-\n| Puerto Rico\n| cobia, snapper\n| align=center | C\n|\n|-\n| Spain\n| seabass, seabream\n| align=center | C\n| Government assisting trials\n|-\n| Turkey\n| seabass, seabream\n| align=center | C\n|\n|-\n|Vietnam\n|barramundi\n|C\n|\n|-\n| Washington\n| sablefish\n| align=center | C\n|\n|-\n| Taiwan\n| cobia\n| align=center | C\n| 3,000 tonnes (2001)\n|}\nSee also\n* Offshore construction\n* Ocean development\nNotes\nFurther references\n* James. M.A. and Slaski, R. (2006) Appraisal of the opportunity for offshore aquaculture in UK waters. Report of Project FC0934, commissioned by Defra and Seafish from FRM Ltd., 119 pp [http://randd.defra.gov.uk/Document.aspx?Document=FC0934_3856_FRP.pdf]\n* Lee C and O’Bryenn PJ (Eds.) (2007) [http://www.was.org/Usas/USChapter_files/Open_Ocean_Pub/OpenOcean.pdf#page=7 Open Ocean Aquaculture—Moving Forward] Oceanic Institute workshop, Hawaii Pacific University.\n* Nolan, Jean T (2009) [https://books.google.com/books?id=X2pVPgAACAAJ Offshore Marine Aquaculture] Nova Science. .\n* [https://web.archive.org/web/20081224152948/http://aquaculture.noaa.gov/us/welcome.html Aquaculture in the United States] NOAA. Updated 18 July 2011.\n* Stickney RR, Costa-Pierce B, Baltz DM, Drawbridge M, Grimes C, Phillips S and Swann DL (2006) [http://aquaculture.noaa.gov/pdf/fisheriesmagarticle.pdf Toward Sustainable Open Ocean Aquaculture in the United States] Fisheries, 31 (12): 607–610.\n* [http://aquaculture.noaa.gov/us/offshore.html Offshore Aquaculture] NOAA. Updated 22 October 2007.\n* [http://aquaculture.noaa.gov/us/2007.html The National Offshore Aquaculture Act of 2007] NOAA. Updated 5 September 2008.\n* [http://aquaculture.noaa.gov/news/gao.html Government Accountability Office Report on Offshore Aquaculture]  NOAA. Updated 18 June 2008.\n* Mittal, Anu K. (2008) [https://books.google.com/books?id=HuWFzDz0XhQC Offshore Marine Aquaculture: Multiple Administrative and Environmental Issues Need to be Addressed in Establishing a U.S. Regulatory Framework] Diane Publishing. .\n* [https://www.nytimes.com/gwire/2009/04/23/23greenwire-obama-admin-hands-offshore-aquaculture-oversig-10648.html Obama admin hands offshore aquaculture oversight to NOAA] New York Times, 23 April 2009.\n* Kapetsky JD and Aguilar-Manjarrez J (2007) [ftp://ftp.fao.org/docrep/fao/009/a0906e/a0906e01.pdf Estimating open ocean aquaculture potential in EEZ with remote sensing and GIS: a reconnaissance] In: Geographic information systems, remote sensing and mapping for the development and management of marine aquaculture, FAO fisheries technical paper 458. .\n* Watson, L and Drumm A (2007) [http://www.fao.org/fishery/gisfish/servlet/CDSServlet?status=ND0xMTM0LjI5MjUmNj1lbiYzMz1hcXVhX2RvYyYzNz1pbmZv Offshore Aquaculture Development in Ireland, next steps] FAO fisheries technical report.\n* James, Mark and  Slaski, Richard (2007) [http://www.thefishsite.com/articles/309/appraisal-of-the-opportunity-for-offshore-aquaculture-in-uk-water Appraisal of the opportunity for offshore aquaculture in UK water] CEFAS Finfish News, Issue 3.\n* [http://www.worldwildlife.org/what/globalmarkets/aquaculture/offshoreaquaculture.html Offshore Aquaculture: The Next Wave for Fish Farming?] World Wildlife Fund. Retrieved 16 October 2011.\n* [https://www.pbs.org/emptyoceans/fts/offshore/ Offshore aquaculture viewpoints] PBS. Retrieved 16 October 2011.\n* [http://www.staradvertiser.com/editorials/20101128_Open_ocean_aquaculture_can_be_destructive.html Open ocean aquaculture can be destructive] Star Advertiser, 28 November 2010.\n* [http://www.grist.org/food/2011-10-12-report-warns-of-the-dangers-of-offshore-fish-farming Ocean of trouble: Report warns of offshore fish farming dangers] Grist, 12 October 2011."
    }
  ]
}