{
  "content": [
    {
      "type": "text",
      "text": "# Ogaden War\n\n| date              = 13 July 1977 – 23 March 1978()\n| place             = Ogaden, Ethiopia\n| result            = Ethiopian victory\n*Somalia breaks all ties with the Soviet Bloc and the Second World (except China and Romania).\n*Beginning of the Somali Rebellion\n| combatant1        =  Ethiopia\n*\n*\n*\n}}\n| combatant2        =  Somalia\n*  WSLF\n}}\n| commander1        =  Mengistu Haile Mariam\n*  Tesfaye Gebre Kidan\n*  Merid Negussie\n*  Fikre Selassie Wogderess\n*  Arnaldo Ochoa\n*  Vasily Petrov\n}}\n| commander2        =  Siad Barre\n*  Mohammad Ali Samatar\n*  Abdullah Mohamed Fadil\n*  Abdullahi Ahmed Irro\n*  Abdullahi Yusuf Ahmed\n*  Mohamed Farrah Aidid\n*  Abdillahi Askar\n*  Abdullahi Hassan Mahmoud\n}}\n| strength1         = Beginning of war:35,000–47,000 soldiers37 aircraft, 62 tanks, 100 armored vehiclesLater:64,500 soldiers1,500 Soviet advisors12,000–18,000 Cuban soldiers2,000 Yemeni soldiers\n| strength2         = Beginning of war:31,000–39,000 soldiers53 aircraft, 250 tanks, 350 armored vehicles, and 600 artillery gunsLater:45,000–63,000 soldiers\n| casualties1       = Ethiopia:6,133 killed8,207 wounded2,523 capturedEquipment losses:23 aircraft139 tanks108 APCs1,399 vehiclesCuba:163 killed 250 wounded6 tanksSouth Yemen:90 killed150 woundedSoviet Union:33 advisors killed\n| casualties2       = Somalia:6,453 killed2,409 wounded275 capturedEquipment losses:34 aircraft154 tanks270 APCs624 vehicles295 artillery guns\n| casualties3       = 25,000 civilians killed500,000 Somali inhabitants of Ethiopia displaced\n| notes             =\n}}\nThe Ogaden War, also known as the Ethio-Somali War (, ), was a military conflict between Somalia and Ethiopia fought from July 1977 to March 1978 over control of the sovereignty of the Ogaden region. Somalia launched an invasion in support of the Western Somali Liberation Front (WSLF) insurgency, triggering a broader inter-state war. The intervention drew the disapproval of the Soviet Union, which subsequently withdrew its support for Somalia and backed Ethiopia instead.\nEthiopia was saved from defeat and permanent loss of territory through a massive airlift of military supplies worth $1 billion, the arrival of more than 12,000 Cuban soldiers and airmen and 1,500 Soviet advisors, led by General Vasily Petrov. On 23 January 1978, Cuban armored brigades inflicted the worst losses the Somali forces had ever taken in a single action since the start of the war.\nThe Ethiopian-Cuban force (equipped with 300 tanks, 156 artillery pieces and 46 combat aircraft) prevailed at Harar and Jijiga, and began to push the Somalis systematically out of the Ogaden. On 23 March 1978, the Ethiopian government declared that the last border post had been regained, thus ending the war. Almost a third of the regular SNA soldiers, three-eighths of the armored units and half of the Somali Air Force had been lost during the war. The war left Somalia with a disorganized and demoralized army as well as a heavy disapproval from its population. These conditions led to a revolt in the army which eventually spiraled into the ongoing Somali Civil War.\nBackground\nThe Ogaden is a vast plateau that is overwhelmingly inhabited by Somali people. It represents the westernmost region inhabited by the Somalis in the Horn of Africa, and is located to the south and southeast of the Ethiopian Highlands. During the pre-colonial era the Ogaden region was neither under Ethiopian rule, nor terra nullius, as it was occupied by organized Somali communities. Independent historical accounts are unanimous that previous to the penetration into the region in the late 1880s, Somali clans were free from the control of Ethiopian Empire.\nMenelik ll's invasions and Anglo-Ethiopian Treaty of 1897\nDuring the late 1880s, as European colonial powers advanced into the Horn of Africa, Ethiopian Emperor Menelik II launched invasions into Somali-inhabited territories as part of his efforts to expand the Ethiopian Empire. These encroachments primarily affected the Ogaden region. The Ethiopian Empire imported a significant amount of firearms from European powers in this period, and the large scale importation of European arms completely upset the balance of power between the Somalis and the Ethiopian Empire, as the colonial powers blocked Somalis from accessing firearms. Control over the Ogaden was expressed through intermittent raids and expeditions that aimed to seize Somali livestock as tribute. In exchange for commercial privileges for British merchants in Ethiopia and the neutrality of Menelik II in the Mahdist War, the British signed the Anglo-Ethiopian treaty of 1897. The agreement ceded large parts of Somali territory to Ethiopia, despite being a legal breach of the legal obligation made by the protectorate.\nAs indiscriminate raiding and attacks by imperial forces against the Somalis grew between 1890 and 1899, those residing in the plains around the settlement of Jigjiga were in particular targeted. The escalating frequency and violence of the raids resulted in Somalis consolidating behind the anti-colonial Dervish Movement under the lead of Sayyid Mohamed Abdullah Hassan. The Ethiopian hold on Ogaden at the start of the 20th century was tenuous, and administration in the region was \"sketchy in the extreme\". Sporadic tax raids into the region often failed and Ethiopian administrators and military personnel only resided in the towns of Harar and Jigjiga. Attempts at taxation in the region were called off following the massacre of 150 Ethiopian troops in January 1915.\nSecond Italo-Ethiopian War and World War II\nDuring the 1920s and 1930s, there were no permanent Ethiopian settlements or administration in the Ogaden or any Somali inhabited land, only military encampments. In the years leading up to the Second Italo-Ethiopian War in 1935, the Ethiopian hold on the Ogaden remained tenuous. Due to native hostility, the region had nearly no Ethiopian presence until the Anglo-Ethiopian boundary commission in 1934 and the Wal Wal incident in 1935. Only during 1934, as the Anglo-Ethiopian boundary commission attempted to demarcate the border, did Somalis who had been transferred to the Ethiopian Empire by the British during the 1897 Anglo-Ethiopian Treaty realize that they had been placed under Abyssinian rule. In decades following the treaty, Somalis remained unaware about the transfer of their region due to the lack of 'any semblance' of effective administration of control being present over the Somalis to indicate that they were being annexed by the Ethiopian Empire.\nFollowing the end of the Second Italo-Ethiopian War in 1937, and the outbreak of World War II, the Ogaden was united under a single administration with the British and Italian Somaliland's. After the defeat of Italy, power transferred to the British military administration. The British Foreign Secretary proposed to keep the Somalis territories unified after the war, but was rejected by the Ethiopians and France (then controlling French Somaliland) who wanted a return to the pre-war status quo. On 31 January 1942, Ethiopia and the United Kingdom signed the second \"Anglo-Ethiopian Agreement\", ending British military occupation in most of Ethiopia except Ogaden.\nThe last remaining British controlled parts of the region were transferred to Ethiopia in 1955. The population of the Ogaden did not perceive themselves to be Ethiopians and were deeply tied to Somalis in neighboring states. Somalis widely considered Ethiopian rule in the Ogaden to be a case of African colonial subjugation. After Italy lost control of Italian Somaliland during the Second World War, these regions came under British military administration. It was during this period that Ethiopian Emperor Haile Selassie expressed a keen interest in the territory, which his government deemed as a lost province of the empire. He laid claim to them openly, asserting that the ancient Somali coastal region of Banaadir (which encompasses Mogadishu) as well as the adjacent Indian Ocean coastline, rightfully belonged to Ethiopia based on 'historical grounds'.\nOgaden and Haud handovers\nFollowing World War II, Somali leaders in the Ogaden region of Ethiopia repeatedly put forward demands for self-determination, only to be ignored by both Ethiopia and the United Nations. After the establishment of the United Nations, Ethiopia submitted a memorandum to the UN, contending that prior to the era of European colonialism, the Ethiopian empire had encompassed the Indian Ocean coastline of Italian Somaliland. Somali nationalists unsuccessfully fought at the UN to prevent the establishment of Ethiopian administration in the Ogaden after WWII.\nIn 1948, the British Military Administration, which had been in control of the Ogaden since the defeat of Italy during WWII, commenced a withdrawal. This transition saw the replacement of British officials with Ethiopian counterparts between May and July of that year in a significant handover process. After the handover, Ethiopian administration resumed in Jigjiga for the first time in 13 years. Then, on 23 September 1948, following the withdrawal of British forces and the appointment of Ethiopian district commissioners, vast areas of the Ogaden east of Jijiga were placed under Ethiopian governance for the first time in their history. Under pressure from their World War II allies and to the dismay of the Somalis, the British gave the Haud and the Ogaden to Ethiopia, based on the Anglo-Ethiopian Treaty of 1897. Frederick Willey and James Johnson, among several British MPs who opposed the handover on legal and moral grounds, contended that the transfer was illegal. According to International Court of Justice Judge Abdulqawi A. Yusuf, the transfer was illegal because Britain did not hold legal title to the territory and, even if the 1897 treaty had originally been valid, Ethiopia’s failure to adhere to key obligations would have rendered it null. Britain included the provision that the Somali residents would retain their autonomy, but Ethiopia immediately claimed sovereignty over the area. In attempt to fulfill the obligations of its original protection treaties it had signed with the Somalis, the British unsuccessfully bid in 1956 to buy back the lands it had unlawfully turned over.\nIn the mid-1950s, Ethiopia for the first time controlled the Ogaden and began incorporating it into the empire. In the 25 years following the commencement of Ethiopian rule in this era, hardly a single paved road, electrical line, school or hospital was built. The Ethiopian presence in the region was always colonial in nature, primarily consisting of soldiers and tax collectors. The Somalis were never treated as equals by the Amhara who had invaded the region during Menelik's expansions and were scarcely integrated into the Ethiopian Empire. During the late 1940s and 1950's, covert Somali organizations in the Ogaden formed with the aim of freeing the region from Ethiopian rule.\n1963 Ogaden uprising and First Ethiopian-Somali War\nDuring the 1960s, the newly independent Somali Republic and the Ethiopian Empire under Haile Selasie came on the verge of full scale war over the Ogaden issue, particularly during 1961 and 1964. In the years following there had been a number of reported and unreported skirmishes between Ethiopian and Somali troops. In 1963, the first major post-war rebellion in the region broke out. Known as 'Nasrallah' or the Ogaden Liberation Front, the organization fought a guerrilla war for self-determination. It began with 300 men and soon swelled to 3,000. The Ethiopian Imperial Army launched a large scale counterinsurgency campaign during the summer and fall of 1963. The imperial governments reprisals during the counterinsurgency campaign, which consisted large scale artillery bombardments of Somali cities in the Ogaden, resulted in rapidly deteriorating relations between the Ethiopian Empire and the Somali Republic, eventually resulting in the first interstate war between Ethiopia and Somalia in 1964 .\nIn a bid to control the population of the region during the 1963 revolt, an Ethiopian Imperial Army division based out of the city of Harar torched Somali villages and carried out mass killings of livestock. Watering holes were machine gunned by aircraft in order to control the nomadic Somalis by denying them access to water. Thousands of residents were driven out from the Ogaden into Somalia as refugees. In the years following, insurgent activity continued but declined over the late 1960s due to pressures from both the Ethiopian and Somali governments. The Nasrallah insurgents formed the foundation of the future Western Somali Liberation Front (WSLF).  Somali insurgents remained active in the Ogaden hinterlands until the first WSLF operations began operations in 1974.\nOctober Coup and Somali Democratic Republic\n, Chairman of the Supreme Revolutionary Council|225x225px]]In October 1969, while paying a visit to the northern town of Las Anod, Somali President Shermarke was shot dead by one of his bodyguards. His assassination was quickly followed by a military ''coup d'état on 21 October (the day after his funeral), in which the Somali Army seized power without encountering armed opposition. The putsch was spearheaded by Major General Mohamed Siad Barre, who at the time commanded the army.\nAlongside Barre, the Supreme Revolutionary Council (SRC) that assumed power after President Sharmarke's assassination was led by Lieutenant Colonel Salaad Gabeyre Kediye and Chief of Police Jama Ali Korshel. Kediye officially held the title of \"Father of the Revolution\", and Barre shortly afterwards became the head of the SRC. The SRC subsequently renamed the country the Somali Democratic Republic, dissolved the parliament and the Supreme Court, and suspended the constitution. In addition to Soviet funding and arms support provided to Somalia, Egypt sent to the country millions of dollars' worth of arms shipments. Though the United States had offered Somalia arms support prior to the 1977 invasion, the offer was withdrawn following the news of Somali troops operating in the Ogaden Region.\nWestern Somali Liberation Front insurgency\nIn the early 1970s, the rebel organization fighting for Ogaden's self-determination, Nasrallah, began to disintegrate. In response, veteran insurgents and young intelligentsia, displaced from the Ogaden in the 1960s and now part of Siad Barre's government, lobbied for renewed armed struggle. After Haile Selassie’s regime was toppled by the Derg, conditions in the Ogaden worsened. A severe drought hit the region, causing mass suffering, while the Derg suppressed news and increased military oppression. By 1974-1975, intense pressure from Ogaden Somalis on Siad Barre's government rapidly grew.\nBy 1975, the Somali government had been convinced to aid the movement. According to professor Haggai Erlich, the war in Ogaden also had a religious dynamic as the Western Somali Liberation Front (WSLF) had established links with the Muslim World League in 1976, later the Somali Abo Liberation Front (SALF) founded by Waqo Gutu involved Oromo Muslim militias cooperating with the WSLF. Another squadron named after sixteenth century Islamic leader Ahmad ibn Ibrahim al-Ghazi formed the Harari, a reminiscent of the medieval Ethiopian–Adal War.\nGuerrilla warfare began in both the northern and southern regions in early 1976 and spread to southeastern Bale and Sidamo by year's end. The terrain, a mix of arid scrubland, mountains, and woods, was familiar to the fighters, with friendly local inhabitants. Infiltrating from the Somali Republic, the guerrillas moved swiftly, dismantling state presence by destroying government offices and targeting police and civilian administration. The WSLF movement had four brigades, known in Somali as 'Afar Gaas.'. At the start of 1977, the WSLF began escalating it attacks against Ethiopian troops. During early 1977, with the exception of towns strategically positioned on vital routes and intersections, the WSLF effectively controlled most of the Ogaden lowlands. The rebels employed hit-and-run tactics, targeting the Ethiopian army at its vulnerable points and then blending into a predominantly supportive local population. On 1 June 1977, the WSLF severed Ethiopia's rail link with Djibouti.Brie, Paul Herman (1979). Law, Development and the Ethiopian Revolution. PhD dissertation, School of Oriental and African Studies, University of London, p. 62. Available at: . These tactics eroded the morale of the Ethiopian troops, compelling them to retreat to strongholds. The Ethiopian army found itself confined to garrison towns, many of which were besieged. While any WSLF attempt to storm these garrison towns invited devastating firepower from the Ethiopian defenders, travel between towns became perilous for the Ethiopian troops. Military and civilian vehicles required armed escorts, often falling into ambushes or encountering land mines.\nSomali strategy\nUnder the leadership of General Mohammad Ali Samatar, Irro and other senior Somali military officials were tasked in 1977 with formulating a national strategy in preparation for the war against Ethiopia to assist the Western Somali Liberation Front. President Barre believed a Somali military intervention would allow the WSLF to press home their advantage and achieve total victory. This was part of a broader effort to unite all of the Somali-inhabited territories in the Horn region into a Greater Somalia (Soomaaliweyn).\nA distinguished graduate of the Soviet Frunze Military Academy, Samatar oversaw Somalia's military strategy. During the Ogaden War, Samatar was the Commander-in-Chief of the Somali Armed Forces. He and his frontline deputies faced off against their mentor and former Frunze alumnus, General Vasily Petrov, assigned by the USSR to advise the Ethiopian Army. A further 15,000 Cuban troops, led by General Arnaldo Ochoa, also supported Ethiopia. General Samatar was assisted in the offensive by several field commanders, most of whom were also Frunze graduates:\n* General Yussuf Salhan commanded the SNA on the Jijiga Front, assisted by Colonel A. Naji, capturing the area on August 30, 1977. (Salhan later became Minister of Tourism but was expelled from the Somali Socialist Party in 1985.)\n* Colonel Abdullahi Yusuf Ahmed commanded the SNA on the Negellie Front. (Ahmed later led the rebel SSDF group based in Ethiopia.)\n* Colonel Abdullahi Ahmed Irro commanded the SNA on the Godey Front.\n* Colonel Ali Hussein commanded the SNA in two fronts, Qabri Dahare and Harar. (Hussein eventually joined the Somali National Movement in late 1988.)\n* Colonel Farah Handulle commanded the SNA on the Warder Front. (He became a civilian administrator and Governor of Sanaag, and in 1987 was killed in Hargheisa one day before he took over governorship of the region.)\n* General Mohamed Nur Galaal, assisted by Colonel Mohamud Sh. Abdullahi Geelqaad, commanded Dirir-Dewa, which the SNA retreated from. (Galaal later became Minister of Public Works and leading member of the ruling Somali Revolutionary Socialist Party.)\n* Colonel Abdulrahman Aare and Colonel Ali Ismail co-commanded the Degeh-Bur Front. (Both officers were later chosen to reinforce the Harar campaign; Aare eventually became a military attaché and retired as a private citizen after the SNA's collapse in 1990.)\n* Colonel Abukar Liban 'Aftooje' initially served as acting logistics coordinator for the Southern Command and later commanded the SNA on the Iimeey Front. (Aftoje became a general and military attaché to France.)\nSomali Air Force\nThe Somali Air Force was primarily organized along Soviet lines, as its officer corps were trained in the USSR.\nSomali Air Force operational aircraft\nFile:Egyptian Il-28 Beagle.JPEG|Il-28, 3 units\nFile:MiG-21PFM-Egypt-1982.jpg|MiG-21, 30 units\nFile:MiG-17 Takes to the Sky (cropped).jpg|MiG-17, 10 units\nDerg\nIn September 1974, Emperor Haile Selassie had been overthrown by the Derg military council, marking a period of turmoil. The Derg quickly fell into internal conflict to determine who would have primacy.}} Meanwhile, various anti-Derg groups as well as separatist movements began emerging throughout the country.\nOne of the separatist groups seeking to take advantage of the chaos was the pro-Somalia Western Somali Liberation Front (WSLF) operating in the Somali-inhabited Ogaden; by late 1975, the group had attacked numerous government outposts. WSLF controlled most of the Ogaden, the first time since World War II that all of Somalia had been united (with the exception of the Northern Frontier District in Kenya). The victory in Ogaden occurred primarily because of support from the Harari populace who had aligned with the WSLF. From 1976 to 1977, Somalia supplied arms and other aid to the WSLF.\nOpposition to the reign of the Derg was the main cause of the Ethiopian Civil War. This conflict began as extralegal violence between 1975 and 1977, known as the Red Terror, when the Derg struggled for authority, first with various opposition groups within the country, then with a variety of groups jockeying for the role of vanguard party. Though human rights violations were committed by all sides, the great majority of abuses against civilians as well as actions leading to devastating famine were committed by the government.\nA sign that order had been restored among Derg factions was the announcement on February 11, 1977, that Mengistu Haile Mariam had become head of state. However, the country remained in chaos as the military attempted to suppress its civilian opponents in a period known as the Red Terror (Qey Shibir in Amharic). Despite the violence, the Soviet Union, which had been closely observing developments, came to believe that Ethiopia was developing into a genuine Marxist–Leninist state and that it was in Soviet interests to aid the new regime. They therefore secretly approached Mengistu with offers of aid, which he accepted. Ethiopia closed the U.S. military mission and its communications center in April 1977.\nIn June 1977, Mengistu accused Somalia of infiltrating SNA soldiers into the Somali area to fight alongside the WSLF. Despite considerable evidence to the contrary, Barre strongly denied this, saying SNA \"volunteers\" were being allowed to help the WSLF.\nEthiopian Air Force\nThe Ethiopian Air Force (ETAP) was formed thanks to British and Swedish aid during the 1940s and 1950s, and started receiving significant US support in the 1960s. Despite its small size, the ETAP was an elite force, consisting of hand-picked officers and running an intensive training program for airmen at home and abroad.\nThe Ethiopian Air Force benefited from a US Air Force aid program. A team of US Air Force officers and NCOs assessed the force and provided recommendations as part of the Military Advisory and Assistance Group. The ETAP was restructured as a US-style organization. Emphasis was given to training institutions. Ethiopian personnel were sent to the US for training, including 25 Ethiopian pilots for jet training, and many more were trained locally by US Defense personnel.\nPrior to 1974, the Ethiopian Air Force mainly consisted of a dozen F-86 Sabres and a dozen F-5A Freedom Fighters. In 1974, Ethiopia requested the delivery of McDonnell Douglas F-4 Phantom fighters, but the US instead offered it 16 Northrop F-5E Tiger IIs, armed with AIM-9 Sidewinder air-to-air missiles, and two Westinghouse AN/TPS-43D mobile radars (one of which was later positioned in Jijiga). Due to human rights violations in the country, only 8 F-5E Tiger IIs had been delivered by 1976.\nEthiopian Air Force operational aircraft\nFile:F86F Sabres - Chino Airshow 2014 (cropped).jpg|F-86 Sabre, 14 units\nFile:IIAF F-5A 3-417.jpg|F-5A/B, 15 units\nFile:IRIAF Northrop F-5E Tiger II Talebzadeh.jpg|F-5E Tiger IIs, 8 units\nFile:Canberra T 4 MOD 45144929 (cropped).jpg|Canberra B.Mk.2 bombers, 2 units\nFile:T-28B VT-2 over NAS Whiting Field c1973.jpeg|T-28 Trojan, 8 units\nFile:SAAB B17-20 - Flickr - Ragnhild & Neil Crawford.jpg|Saab 17, 8 units\nFile:T 33 Shooting Star-IIAF.jpg|T-33A, 8 units\nFile:Douglas c47-a skytrain n1944a cotswoldairshow 2010 arp.jpg|C-47, 12 units\nFile:Sud SA 316B Alouette III A-247 (cropped).jpg|Aérospatiale SA.316 Alouette, 3 units\nCastro's trip to Aden\nIn early 1977, Fidel Castro brought together the leaders of Somalia, Ethiopia and Democratic Yemen during a March meeting in Aden, Democratic Yemen, where he suggested an Ethiopian-Somali-Yemeni Socialist Federation. The Somali delegation were open to a 'loose-knit' federation on the basis that self-determination be extended to the Ogaden and that the Somali people be united. They had come to the conference believing that long awaited negotiations for a solution to the Ogaden problem had finally begun.\n, Salim Rubai Ali during his visit to Aden, 1977]]\nDuring the meeting, President Barre spoke extensively about the Ogaden's occupation and Somalia's struggle for self-determination. Ethiopian President Mengistu spoke briefly, stating he had nothing to suggest since the Ogaden was an 'integral part' of Ethiopia. Mengistu warned Barre to accept the status quo, but Barre stated the issue couldn't be side stepped. A Cuban delegate intervened, suggesting from a 'socialist perspective' that Somalia should accept the status quo, likening the Ogaden issue to Mexico reclaiming Texas. Barre rejected this, stating he sought self-determination for Somalis under Ethiopian occupation, not annexation, and argued that a true socialist view should support self-determination. Mediators proposed making the Ogaden an autonomous zone, which the Ethiopians found excessive and the Somalis saw as insufficient. As talks broke down, Barre requested a private meeting with Mengistu but was rejected, and the discussions soon collapsed. The Somalis left the Aden meeting believing it was organized to pressure them on the Ogaden issue. The conference effectively called for Somalia to drop its support for self-determination, which Barre couldn’t accept, as he couldn't speak for the WSLF. As early as May 1977, Cuban military personnel began arriving in Ethiopia.\nSomalia and Ethiopia each blamed the other for the failure of the Aden meeting, but Castro backed Mengistu, who emphasized his pro-Soviet credentials, while Barre focused on Somali self-determination and ending Ethiopian rule in Ogaden. Another round of talks, arranged by Moscow in July 1977 to prevent war, never occurred, as the Russians saw no room for compromise between the entrenched positions. These July talks were the last chance for a socialist framework settlement, but they too collapsed.\nHistory\nCourse of the war\n]]\nFor some time, the Western Somali Liberation Front, had been conducting guerilla operations in the Ogaden. By June 1977, it had succeeded in forcing the Ethiopian army out of much of the region and into fortified urban centers.\nSomali invasion (July–August 1977)\nThe Somali National Army (SNA) committed to invade the Ogaden on July 12, 1977, according to Ethiopian Ministry of National Defense documents (other sources state July 13 or 23).\nAccording to Gebru Tareke, the invaders had 23 mechanized battalions, 9           armored battalions, 4 airborne battalions and 9 artillery battalions which numbered around 31,000 to 39,000 men, 53 fighter jets, 250 tanks, 350 armored personnel carriers (APCs), and 600 artillery pieces. Arrayed against such a force were Ethiopia's 3 infantry brigades, a mechanized brigade, 2 tank and 2 artillery battalions, and 2 air defense batteries with a total of 35,000 to 47,000 regular troops and militiamen. Despite the clear disadvantage in fighting men, the Somalis held numerical superiority over the Ethiopians in terms of tanks, artillery, and armored personnel carriers (APCs). The Ethiopian army was thinly spread, as the army and militia units were scattered all over the vast plains of the Ogaden, its best units were engaged in the Eritrean War of Independence to the north. The 10th Mechanized Brigade was stationed at Jijiga, the 5th, 9th, and 11th Infantry Brigades were based at Gode, Kebri Dahar, and Degehabur. In addition, an infantry battalion was stationed at each frontier outpost, such as Aware, Warder, Galadin, and Mustahil. All these army units were placed under the 3rd Division, headquartered in Harar.\nThe initial assault began at 3:00, when two SNA armoured and three mechanised brigades under the command of Colonel Abdullah Askar launched their attack in the Ogaden at the direction of the city of Gode. Despite the 5th Ethiopian Brigade's defence of the town coming with success in the coming days they suffered heavily from air raids and Somali artillery. Ethiopian reaction to the invasion was slow and inefficient as the Somalis never officially declared war on the Ethiopians and diplomatic relations had been cut in early 1977. Mobilisation of the Ethiopian Armed Forces began on 15 July but it took several weeks to accept 250,000 new recruits. With only infantry and anti-tank guns, Ethiopian troops found themselves in a precarious situation. Somali tanks swiftly advanced westward, penetrating 700 kilometres into Ethiopia and capturing 350,000 square kilometers. Their advantage stemmed from superior equipment and organisation, particularly in tanks. They employed an offensive strategy centred on speed and quickly exploiting weaknesses. Their attack pattern involved massive infiltrations behind the front lines, intense artillery barrages, and coordinated mechanised bombing raids. Despite the efforts of the 5th Brigade, Gode was captured by the Somalis on July 25. Without artillery or air support to cover their retreat, the Ethiopian defenders were effectively annihilated, with only 489 out of the 2,350 militiamen managing to return to Harar, the rest presumed dead.\nThe 9th brigade at Kebri Dahar fought fiercely before retreating to Harar on July 31. The 11th Infantry Brigade stationed at Degehabur persisted in combat until the end of July when it received orders to withdraw to Jijiga. Soviet General Vasily Petrov had to report back to Moscow the \"sorry state\" of the Ethiopian Army. The 3rd and 4th Ethiopian Infantry Divisions that suffered the brunt of the Somali invasion had practically ceased to exist. Within less than a month of the invasion, 70% of the Ogaden had been taken by the SNA-WSLF force. Somalia easily overpowered Ethiopian military hardware and technology. The Soviet-made T-54 and T-55 main battle tanks had, in Gebru's words, \"bigger guns, better armour, greater range and more maneuverability than Ethiopia's aging M-41 and M-47 [American-made tanks].\" Similarly, Ethiopia's American-made 155mm artillery pieces were outmaneuvered and outranged by Somalia’s Soviet- made 122mm D-30 field howitzer guns. Over the years, the Soviets had been arming Somalia’s military forces with the latest weapons. Somali commanders calculated that their stockpiles of Soviet arsenal would enable them to wage war for six months. They anticipated that once the Soviets learned of the invasion, they might terminate the flow of arms to Somalia. The Somali objective was thus to occupy the whole of the Ogaden and by December 1977, before the suspension of Soviet weapons shipments could have a serious impact on their offensive.\nThe Somali forces did suffer some early setbacks; as on July 16, just four days after the beginning of the invasion, the Somalis launched a surprise attack on Dire Dawa with an infantry brigade, two artillery battalions, a tank battalion, a ballistic missile rocket battery, and three brigades of the Western Somali Liberation Front (WSLF) guerrillas. The Ethiopian defense—the 78th Brigade, the 7th Infantry Battalion, the 216th Battalion, and the 752nd Battalion—were enormously outnumbered and outgunned by the Somalis. The battle raged until 11:00 hours, and the Somalis pushed the defenders to the outskirts of the city; the outcome of the battle for the strategic city would prove critical. Not only was Ethiopia's second largest air base located there, but the city represented both its crossroads into the Ogaden and rail lifeline to the Red Sea. At that critical moment, reinforcements arrived from Harar. With close air support, the troops from Harar helped the defenders drive the Somalis back twenty kilometers from the city. Around the same time, the Ethiopian Air Force (ETAP) also began to establish air superiority using its Northrop F-5s, despite initially being outnumbered by Somali MiG-21s. Even though the Somalis possessed more aircraft (53 to 36) during the initial months of the war, they were outmatched by the Ethiopian Air Force. The Ethiopians not only attained near-absolute control over their own skies but also managed to breach Somali airspace, reaching as far as the city of Berbera and destroying 9 MiG-17s and 18 MiG-21s in the air and another 6 on the ground within Somali territory. Due to a serious shortage spare parts, the Somali Air Force remained grounded throughout most the war and anti-aircraft equipment was in short supply.\nFollowing the relatively easy capture of Delo, Elekere, and Filtu by August 8, the Somalis seemed to be strategically positioned to attain their objective of liberating the Ogaden by December. Dire Dawa, an important industrial city of 70,000 inhabitants, was now in their sights. On August 17, the Somalis launched an assault against Dire Dawa. The Somalis advanced on the city with 2 motorized brigades, 1 tank battalion and 1 BM-13 battery. Facing these were the Ethiopian 2nd Division, the 201st battalion, the 781st battalion, the 4th Mechanized Company, and a tank platoon with two tanks. On August 17 the Somalis advanced from Harewa to the northeastern part of the city at night. Despite losing three tanks to landmines en route, they launched a ground assault the following day. The 781st battalion held out in Shinile for several hours before being forced to retreat to the city. As the Somalis closed in on the city they began shelling it with artillery. A Somali tank battalion managed to push through and temporarily made the country's second major airport non-operational; the air traffic control and as many as 9 aircraft on the ground were destroyed. For the next 20 hours, the Ethiopians and the Somalis engaged in a fierce battle until the Ethiopian air force began to relentlessly pound the enemy, destroying 16 T-55s. The Somalis had exhausted their strength were forced to retreat, leaving behind a trail of abandoned equipment, including tanks, armored cars, artillery pieces, as well as hundreds of assault rifles and machine guns.\nThe Soviet Union, finding itself allied to both sides of the war, attempted to mediate a ceasefire.  While the Ethiopians was fighting hard to stop the Somali advances, Mengistu Haile Mariam kept on pressing the Soviets to deliver arms to Ethiopia. The Soviets responded in the affirmative: they supplied Ethiopia with substantial weapons such artillery and tanks in early September 1977. Two weeks later, the Derg received other good news: the termination of Soviet arms delivery to Somalia. The Soviets were thus committed to helping Ethiopia. Beginning at the final week of September, the Soviets supplied Ethiopia with T-55 tanks, rocket launchers, and MiG-21 fighter planes, a Soviet military airlift with advisors for Ethiopia took place (second in magnitude only to the colossal October 1973 resupplying of Syrian forces during the Yom Kippur War), alongside 15,000 Cuban combat troops in a military role. South Yemen sent in late September two armored battalions to Ethiopia. On November 13 Somalia ordered all Soviet advisers to leave the country within seven days, ended Soviet use of its strategic naval facilities and also broke diplomatic relations with Cuba. Soviet advisors fulfilled a number of roles for the Ethiopians from this point forward. While the majority included training and headquarters operations, some flew combat mission in MiGs and helicopters.\nOther communist countries like South Yemen and North Korea offered Ethiopia military assistance. East Germany offered training, engineering and support troops. Israel reportedly provided cluster bombs, napalm and were also allegedly flying combat aircraft for Ethiopia. Mengistu had sought Israeli support during the war even though the Soviets and Cubans were uncomfortable with their presence in Ethiopia. Not all communist states sided with Ethiopia. Because of the Sino-Soviet rivalry, China supported Somalia diplomatically and with token military aid. Romania under Nicolae Ceauşescu had a habit of breaking with Soviet policies and also maintained good diplomatic relations with Barre.\nSomali victories and siege of Harar (September–January)\nThe greatest single victory of the SNA-WSLF was the assault on Jijiga in mid-September 1977. Undaunted by their setback at Dire Dawa, the reinforced Somalis redirected their efforts towards the third-largest provincial town. On September 2, they launched a forceful attack, employing artillery, mortar, and tanks. A renewed and more resolute offensive took place on September 9, as the Somalis relentlessly bombarded Ethiopian positions with rockets and artillery shells. Adding to the challenges, Somali fire managed to destroy the radar atop Mount Karamara, diminishing the Ethiopian air force's ability to provide essential close air support. This event prompted a large-scale retreat to Adaw. As the Somalis intensified their artillery shelling on Adaw, the army conducted a full retreat to Kore. On September 12, 1977, Jijiga fell into the hands of the Somalis.  Worse still, on September 13, Marda Pass on Mount Karamara, of huge strategic importance, fell into Somali hands, By September, Ethiopia was forced to admit that it controlled only about 10% of the Ogaden and that the Ethiopian defenders had been pushed back into the non-Somali areas of Harerge, Bale, and Sidamo. tank undergoing repairs]]The retreating Ethiopian forces eventually came to a halt at Kore, positioned midway between Jijiga and Harar. Amidst the falling Somali artillery shells, panic once again gripped the soldiers at Kore. The 3rd Division, which had established its headquarters at Kore, responded to the retreat with harsh measures, ordering the air force to strike friendly forces if they retreated. These setbacks were promptly attributed to \"fifth columnists,\" leading to the execution of several officers and NCOs for alleged conspiracy with \"anarchists\"—primarily leftist political organizations, particularly the Ethiopian People's Revolutionary Party (EPRP). Despite this, it did not spare the commander of the 3rd Division from criticism from his superiors. Mengistu Haile Mariam told him to redeem himself for the fall of Karamara by establishing a defensive line at Kore, and by eventually recapturing the Pass. At this point, the government called for a general mobilization. From September 14 to 21, Mengistu issued several directives for mobilization using the slogans \"everything to the warfront\" and \"revolutionary motherland or death\".\nFollowing the capture of Jijiga and Karamara, a one-week pause in fighting ensued. During this period, Mengistu formulated a novel operational strategy named \"Awroa\" to the Eastern Command, which he subsequently reorganized into the Dire Dawa and Harar sectors. Operation Awrora aimed to thwart Somalia's strategic objectives by resolutely defending the cities of Dire Dawa and Harar. In the latter part of September, the Somali offensive experienced a rapid decline, attributed to adverse weather conditions, challenging terrain, and exhaustion among their forces. The initial Somali blitzkrieg concluded, marking the commencement of an attrition phase. Losing their momentum, the Somalis provided an opening for the Ethiopians to regroup their troops, introduce fresh units and additional weaponry, and construct bunkers on the hillsides.\nThe Somalis then launched an offensive, advancing towards the east toward Harar. Their primary aim was on penetrating the eastern front line, pushing forward from Karamara and Fik. Despite the weak position of the Ethiopian defense line, it took the Somalis over seven weeks to breach it. Beginning at the end of September, the Soviets supplied Ethiopia with significant arms, such as aircraft and tanks. Additionally, as the Ethiopian army gained more combat experience, they became more experienced with their new Soviet weaponry. Although the Somalis enjoyed full support in the Ogaden, the highland population, vehemently opposed the Somalis and provided unwavering support to the Ethiopian army in various ways, ranging from scouting to guarding strategic crossroads. As the Somalis advanced further into hostile territories, their stretched lines became increasingly susceptible to disruption.\nfighting, November of 1977.]]\nOver a span of four months, from the last week of September to the middle of December, the Somalis exerted considerable effort to seize Harar. On two occasions, it appeared that the city, with its forty-eight thousand inhabitants and as the home of Ethiopia's foremost military academy, was on the brink of falling. However, Harar did not surrender, primarily due to the relatively slow and indecisive operational maneuvers of the Somalis and the arrival of Soviet weapons in late October. The Ethiopians were bolstered by deployment of 100,000 recently trained troops outfitted in new Soviet gear, around 30,000 of them, referred to as the \"1st Revolutionary Liberation Army\", were subsequently sent to the Somali front. By December, the exhausted Somali forces were forced to withdraw to Fedis, Jaldessa and Harewa, where they had to await the Ethiopian counterattack. At this point came the regular Cuban troops, with only a few hundred in December, they eventually grew to three thousand in January to 16,000 in February. They were armed with full Soviet gear, including T-62 tanks, artillery, and APCs. The Somalis had gambled by cutting off the Russians and Cubans; now they stood virtually alone against a multinational colossus.\nEthiopian-Cuban counterattack (February–March)\nIn January 1978, the Derg established the Supreme Military Strategic Committee (or SMSC), composing of Ethiopian, Soviet, and Cuban officers to plan and direct the counter-offensive. The Committee was led by General Vasily Petrov, the deputy commander of the Soviet Ground Forces. The operation marked was painstakingly planned and well-directed. Its key elements included surprise artillery barrages, which were followed by subsequent mass infantry and mechanized assaults, drawing inspiration from Soviet assault tactics. Petrov was unwilling to trust Ethiopian troops, instead opting to use a Cuban parachute regiment to spreadhead operations. The main force for the counter offensive consisted of three Cuban infantry regiments, their tank regiment, most of their artillery and two divisions of Ethiopian troops. The flanking force was composed of the Cuban paratroop regiment, several battalions of their artillery and one Ethiopian division. Heavy usage of close air support and air strikes were a hallmark of the operation. At their peak, 17,000 Cuban army troops took part in the offensive.\nThe counter-offensive was preceded by an ambitious Somali attempt to capture Harar on January 22. The Somalis initiated their plan by launching mortar and rocket attacks on the town of Babile from Hill 1692, with the apparent intention of diverting Ethiopian attention. At 15:30 hours, multiple Somali infantry brigades, supported by a substantial number of tanks advanced toward Harar from Fedis and Kombolcha. In a coordinated ground and air resistance involving Cuban soldiers for the first time, the Ethiopians engaged the Somalis a few miles from Harar; they launched a series of sharp thrusts against the attackers, pinning them down. While a ground battle with tanks unfolded, jet fighter-bombers attacked the enemy's rear and communication lines. The Somalis suffered a significant defeat, with casualties possibly reaching as high as 3,000—their most significant loss since the war began. Following this success, the Ethiopians shifted from a defensive to an offensive stance. From January 23 to 27, the Ethiopian 11th Division and the Cuban armored units were able to recapture all territory up to Fedis. In the process, they captured 15 tanks, numerous APCs, 48 artillery guns, 7 anti-aircraft guns, numerous infantry weapons, and various munitions.\nThe Ethiopian-Cuban counterattack began on February 1, the Ninth Division headed by Cuban shock troops attacked the Somalis in Harewa, immediately forcing them to retreat, the attackers then moved north and captured Jaldessa on the 4th. By February 9th, the Somalis fled from the towns of Chinaksen, Ejersa Goro, and Gursum, leaving behind 42 tanks, numerous APCs, and over 50 artillery guns. Artillery, notably BM-21 rocket launchers, along with close air support were crucial in winning the battle. As a result the Somalis decided to withdraw to their prepared defensive positions in the Kara Marda Pass. A column of Ethiopian and Cuban troops then crossed northeast into the highlands between Jijiga and the border with Somalia, bypassing the SNA-WSLF force defending the Marda Pass. The responsibility for the task was assigned to the Tenth Division, which relied on a Cuban tank brigade with over 60 T-62 tanks. On February 15, they maneuvered around the impregnable Marda Pass, opting for a detour through Arabi and advancing towards the Shebele Pass, successfully capturing it on the 24th. Despite strong Somali resistance at Grikocher, the town was eventually secured on the 28th.\nSecond battle of Jigjiga (March 1978)\nJigjiga was a pivotal point in the Somali defensive line and had major political significance to Mengistu as it had represented the site of the Ethiopians greatest defeat the previous autumn. 8,000 Somali army troops, composed of one T-55 tank battalion and one 122 mm artillery battalion, were dug in around Jigjiga and the surrounding Kara Marda Pass. Fierce engagements in mid-February near Babile in the mountains resulted in heavy Ethiopian casualties, and as a result Soviet General Vasily Petrov realized that a direct attack on the Somalis holding Jigjiga and the pass would be an highly costly operation. Petrov decided to get around the issue by deploying some of his forces via airlift in the plains behind Jigjiga. To this end, the Cubans formed their paratroopers into a special airmobile units. 20 Mil-8 and 10 Mil-6 helicopters, flown by Soviet pilots, were to be used in the operation to break the back of the Somali army. Conventional aircraft also assisted the airdrop operation as the helicopters prepared to deploy a battalion with armored vehicles.\nFrom this point onward, the advance to Jijiga was led by the 69th Brigade, the forward units reached the western side of the mountains around Jijiga on February 28. The Somalis stationed at Jijiga attacked the Ethiopians on the mountain range, but were pinned down due to unremitting airstrikes. The Cuban air deployment behind the Somali forces at Jigjiga came in three waves of combined helicopter and parachute operations beginning during the last few days of February 1978. Ethiopian 1st Paracommando Brigade also, participated and the operation laid the groundwork for the ultimate attack on the town. The 10th Division and its Cuban shock troops advanced towards Jijiga, while the Ethiopian 75th Infantry Brigade and the 1st Paracommando Brigade took a southerly route through the mountains to seize the Marda Pass.\nOn 2 March, a combine parachute/heliborne attack was made on the Somalis, who were driven back south. Around the same time, the Djibouti-Addis railway was cleared. Another major airmobile operation took place on 5 March 1978, providing the spearhead for the rear attack on Jigjiga. Around 100 Mil-6 helicopter sorties were made in this period to drop heavy equipment. From the landing zone, this task force drove onto Jigjiga and attacked the Somali troops defending Jigjiga from the rear. The rear attack by the Cubans coincided with a frontal assault by the main Ethiopian/Cuban force on Jigjiga. Under the weight of the combined rear and frontal attack the Somali defence collapsed. Six Somali brigades in the garrison valiantly fought for three days against overwhelming odds. Hindered by the absence of air cover, dwindling supplies, and tank strength possibly below 50 percent, they were forced to retreat on March 5, narrowly avoiding an encirclement. The Somalis lost as many as 3,000 men, whereas Ethiopian and Cuban casualties were apparently very light. Ethiopian troops conducted mop up operations, but the effective victors of the 2nd Battle of Jigjiga had been the Cubans. Cuban troops and aircraft had provided the main strength of the rear attack that had ultimately broken Somali resistance.\nSomali army withdrawal\nThe war was effectively concluded with the recapture of Jijiga on March 5. Mengistu Haile Mariam, buoyed by the retaking of Karamara and Jijiga, had been deeply horrified by their capture six months prior. In a statement praising the Eastern Command for their efforts, he expressed, \"This marks not just a victory for the Ethiopian people but also for the struggles of the workers of the world.\" Recognizing that his position was untenable, Siad Barre ordered the SNA to retreat into Somalia on 9 March 1978, although Rene LaFort claims that the Somalis, having foreseen the inevitable, had already withdrawn their heavy weapons. As the Somali army withdrew, the Ethiopians and the Cubans immediately began a general offensive. A column comprising the Ethiopian 3rd Division and the 3rd Cuban Tank Brigade effortlessly captured Degehabur on March 8. Meanwhile, to the west, Somali forces unexpectedly resisted the 8th Division's advance towards Fik. During this engagement, the Ethiopian 94th Brigade suffered severe losses at Abusharif, leading its commander, Major Bekele Kassa, to take his own life rather than face capture. Despite this setback, the Division, reinforced by a Cuban battalion, pressed on and covered a distance of 150 kilometers to reach Fik on March 8. The fall of Jigjiga to the Ethiopian/Cuban forces was the culmination of the war, and it was followed by three weeks of frantic withdrawal by the Somali National Army. In one of the final actions of the war, American military historian Jonathan House observes that the Somalis had \"fought a brilliant delaying battle, mauling the Ethiopian 9th brigade.\"\nPost war\nin Addis Ababa commemorates the victory of the Derg over Somalia in the Ogaden War]]\nExecutions and rape of civilians and refugees by Ethiopian and Cuban troops were prevalent throughout the war. A large Cuban contingent remained in Ethiopia after the war to protect the Ethiopian government.\nThroughout the late 1970s, internal unrest in the Ogaden region continued as the Western Somali Liberation Front (WSLF) waged a guerrilla war against the Ethiopian government. After the war, an estimated 800,000 people crossed the border into Somalia where they would be displaced as refugees for the next 15 years. The defeat of the WSLF and Somali National Army in early 1978 did not result in the pacification of the Ogaden. At the end of 1978 the first major outflow of refugees numbering in the hundreds of thousands headed for Somalia, and were bombed and strafed during the exodus by the Ethiopian military. During 1979, the Western Somali Liberation Front persisted in its resistance, regaining control of rural areas.\nAssisted by the Cuban contingent, the Ethiopian army launched a second offensive in December 1979 directed at the population's means of survival, including the poisoning and destruction of wells and killing of cattle herds. Thousands of Somali civilians in the Ogaden were killed. Combined with the flight of several hundred thousand refugees into Somalia, this represented an attempt to pacify the region with brute force. Around half of the population in the Ogaden were displaced to Somalia, some diplomats referred to the depopulation in the Ogaden as a genocide. Ethiopian forces also attacked Harari and Oromo civilians in the neighboring regions claiming they were collaborators.\nForeign correspondents who visited the Ogaden during the early 1980s noted widespread evidence of a 'dual society', with the Somali inhabitants of the region strongly identified as 'Western Somalis'. Artificial droughts and famine were induced by the Derg regime to break down Somali opposition to Ethiopian rule in the Ogaden. In the early 1980s the Ethiopian government rendered the region a vast military zone, engaging in indiscriminate aerial bombardments and forced resettlement programs. During 1981 there were an estimated 70,000 Ethiopian troops in the Ogaden, supported by 10,000 Cuban army troops who garrisoned the regions towns. By May 1980, the rebels, with the assistance of a small number of SNA soldiers who continued helping their guerrilla war, controlled a large part of the Ogaden region. It took a massive counter-insurgency campaign to clear the region of guerrillas by 1981, although the insurgency continued until the mid-1980s. The WSLF was practically defunct by the mid-1980s, and its splinter group, the Ogaden National Liberation Front (ONLF), operated from headquarters in Kuwait. Even though elements of the ONLF would later manage to slip back into the Ogaden, their actions had little impact.\nFor the Barre regime, the invasion was perhaps the greatest strategic blunder since independence, and it greatly weakened the military. Almost one-third of regular SNA soldiers, three-eighths of its armored units, and half of the Somali Air Force (SAF) were lost. The weakness of the Barre administration led it to effectively abandon the dream of a unified Greater Somalia. The failure of the war aggravated discontent with the Barre regime; the first organized opposition group, the Somali Salvation Democratic Front (SSDF), was formed by army officers in 1979.\nThe United States adopted Somalia as a Cold War ally from the late 1970s to 1988 in exchange for use of Somali bases it used for access to the Middle East, and as a way to exert influence in the Horn of Africa. A second armed clash in 1988 between Somalia and Ethiopia ended when the two countries agreed to withdraw their armed forces from the border.\nRefugee crisis\nSomalia's defeat in the war caused an influx of Ethiopian refugees (mostly ethnic Somalis as well as some Harari and Oromo) across the border to Somalia. By 1979, official figures reported 1.3&nbsp;million refugees in Somalia, more than half of them settled in the lands of the Isaaq clan-family in the north. According to a 1979 report from The New York Times refugees were also held in southern Somalia which consisted of 200,000 Hararis and 100,000 Oromo. As the state became increasingly reliant on international aid, aid resources allocated for the refugees caused further resentment from local Isaaq residents, especially as they felt no effort was made on the government's part to compensate them for bearing the burden of the war.\nFurthermore, Barre heavily favoured the Ogaden refugees, who belonged to the same clan (Darod) as him. Due to these ties, Ogaden refugees enjoyed preferential access to \"social services, business licenses and even government posts.\" As expressed animosity and discontent in the north grew, Barre armed the Ogaden refugees, and in doing so created an irregular army operating inside Isaaq territories. The armed Ogaden refugees, together with members of the Marehan and Dhulbahanta soldiers (who were provoked and encouraged by the Barre regime) started a terror campaign against the local Isaaqs, raping women, murdering unarmed civilians, and preventing families from conducting proper burials.\nBarre ignored Isaaq complaints throughout the 1980s. This, in addition to Barre's suppression of criticism or even discussion of widespread atrocities in the north, had the effect of turning long-standing Isaaq disaffection into open opposition, with many Isaaq forming the Somali National Movement, leading to the ten-year civil war in northwestern Somalia (today the de facto state of Somaliland).\nSee also\n*  Africa–Soviet Union relations\nReferences\nNotes\nBibliography\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\nFurther reading\n*\n*\n*\n*\nExternal links\n* [http://www.onwar.com/aced/data/oscar/ogaden1976.htm Ogaden War 1976–1978 at OnWar.com]\n* [http://www.urrib2000.narod.ru/Etiopia-e.html Cuban Aviation at the Ogaden War]\n* [https://web.archive.org/web/20140203040124/http://info.newcastle.edu.au/Resources/Schools/Economics%20Politics%20and%20Tourism/APSA%202006/INTLREL/Lockyer,%20Adam.pdf Adam Lockyer, Opposing Foreign Intervention’s Impact on the Course of Civil Wars: the Ethiopian-Ogaden Civil War, 1976–1980]"
    }
  ]
}