{
  "content": [
    {
      "type": "text",
      "text": "# Ogasawarana yoshiwarana\n\n| taxon = Ogasawarana yoshiwarana\n| authority = (Pilsbry, 1902)\n| synonyms =\nHelicina yoshiwarana Pilsbry, 1902\n}}\nOgasawarana yoshiwarana is a species of land snail with an operculum, a terrestrial gastropod mollusk in the family Helicinidae, the helicinids.\nDescription\nOgasawarana yoshiwarana was originally described under the name Helicina yoshiwarana by American malacologist Henry Augustus Pilsbry in 1902.\nPilsbry's original text (the type description) appeared in the key and it reads as follows:\nPilsbry also distinguished two variants:\n* H. yoshiwarana var. arata - Upper surface strongly striate spirally.\n* H. yoshiwarana var. mierotheca - Smaller, delicately striate. height of the shell is 2.2&nbsp;mm. The width of the shell is 4.5&nbsp;mm.\nDistribution\nThis species was endemic to Haha-jima in the Ogasawara Islands (Japan).\nHabitat\nOgasawarana yoshiwarana has been recorded living (as recently as 2006)  on Higashizaki peninsula off the eastern coast of Hahajima, the second largest island in the Ogasawara Archipelago/Bonin Islands system. The Bonin Islands have been sometimes referred to as the Galapagos Islands of the Orient, due to their highly diverse fauna and flora. The island is small and only partly covered by forest, which is where this terrestrial gastropod lives.\nEcological role\nThis animal is essentially an herbivore, eating leaves, stems, soft bark, fruit, vegetables, fungi and algae. Its behavior is like that of any other land snail: it thrives in damp and wet weather. This is especially true of the ogasawarana yoshiwarana because it lives in a subtropical/tropical environment. Predators of the species include predatory snails, ground beetles, leeches, and parasites.\nPopulation and Conservation Status\nEstimates of the population of this species haven't been conducted. They are expected to be found exclusively in this archipelago, not far from its endemic origin of Hahajima island. It is currently unknown why its population is sparse or even if it is declining or increasing in size. Habitat loss is not a factor; in fact, its home is one of the few places in the world not affected by anthropogenic forces or introduced non-native species. Perhaps the hand of natural selection plays a role in the specie's threatened status.\nExtinction\nOgasawarana yoshiwarana is listed as critically endangered in the IUCN Red List of Threatened Species.\nLast record of this species is from 1902 by type description by Henry Augustus Pilsbry. The species is considered to be critically endangered.\nReferences\n*This article incorporates public domain text from reference."
    }
  ]
}