{
  "content": [
    {
      "type": "text",
      "text": "# Ogletree, Deakins, Nash, Smoak & Stewart\n\n| dissolved       =\n}}\nOgletree, Deakins, Nash, Smoak & Stewart PC (abbreviated as Ogletree Deakins) is an American multinational law firm specializing in labor and employment law.\nFounded on February 14, 1977, Ogletree Deakins is one of the largest law firms in the world by revenue. Ogletree Deakins is the second-largest labor and employment firm in the United States.\nHistory and practice\nFounded in 1977, the firm began as a regional firm operating in the Southeastern United States before gradually expanding domestically. The firm opened its first international office in Berlin, Germany in 2012.\nTrade unions\nEastern Air Lines\nThe firm advised the now-defunct Eastern Air Lines on negotiations with trade unions during strikes by the International Association of Machinists and Aerospace Workers, Transport Workers Union of America, and the Airline Pilots Association. Eastern Airlines didn't follow the advice, cracking down on the unions and ultimately leading to the bankruptcy and liquidation of Eastern Airlines.\nNissan\nOgletree Deakins advised Nissan during prolonged unionization efforts by United Auto Workers from 1989 to 2001.\nRacial discrimination\nOgletree Deakins represents Hillcrest Country Club in an ongoing  lawsuit alleging racial discrimination. Matthew Winnick, son of deceased billionaire Gary Winnick, alleges he was denied entrance to the club due to his wife's Hispanic heritage. Ogletree attorney Lyne Richardson, representing Hillcrest, denies the allegations, calling them \"entirely without merit.\"\nControversies\nUnion busting\nThe firm has been accused of union busting on behalf of its multinational clients. The American Civil Liberties Union hired Ogletree Deakins in 2020 to advise when its Kansas affiliate attempted to unionize, causing uproar among the advocacy group's supporters. Ogletree denies that the firm busts unions.\nControversial longtime Sheriff of Maricopa County, Arizona, Joe Arpaio has called Ogletree his \"favorite law firm.\"\nReferences"
    }
  ]
}