{
  "content": [
    {
      "type": "text",
      "text": "# Ogmore, Queensland\n\n| pop                 = 72\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4706\n| area                = 1424.0\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 154\n| dir1                = NW\n| location1           = Rockhampton\n| dist2               = 178\n| dir2                = NW\n| location2           = Yeppoon\n| dist3               = 768\n| dir3                = NNW\n| location3           = Brisbane\n| dist4               =\n| dir4                =\n| location4           =\n| lga                 = Shire of Livingstone\n| stategov            = Mirani\n| fedgov              = Capricornia\n| maxtemp             =\n| mintemp             =\n| rainfall            =\n| near-n              = Coral Sea\n| near-ne             = Stanage\n| near-e              = Marlborough\n| near-se             = Marlborough\n| near-s              = Marlborough\n| near-sw             = Mount Gardiner\n| near-w              = Clarke Creek\n| near-nw             = St Lawrence\n}}\nOgmore is a rural town and coastal locality in the Livingstone Shire, Queensland, Australia. In the , the locality of Ogmore had a population of 72 people.\nGeography\nThe north-eastern boundary of the locality is Broad Sound with the Styx River (also known as Tooloombah Creek) flowing through Ogmore into the sound.\nThe Bruce Highway passes from south to north through the locality, but passes to the west of the town.\nThe North Coast railway line also passes from south to north through the locality to the east of the highway and passes through the town. The locality is served by a number of railway stations (from north to south):\n* Styx railway station, now abandoned ()\n* Ogmore railway station, serving the town ()\n* Bowman railway station, now abandoned ()\n* Strathmuir railway station, now abandoned ()\n* Kooltandra railway station ()\nThe town of Ogmore is located on the east bank of Styx River slightly north of the centre of the locality. There are also a number of neighbourhoods in the locality:\n* Bowman ()\n* Strathmuir ()\n* Styx, in a pocket of the Styx River north-west of the town of Ogmore ()\n* Tooloombah, an abandoned town ()\nThe locality has the following mountains and a mountain pass:\n* Bald Hills ()\n* Blacktop ()\n* Cliff Peak ()\n* Fort St John ()\n* Gilnorchie Peak ()\n* Langdale Hill ()\n* Mount Bison ()\n* Mount Brunswick ()\n* Mount Lorne ()\n* Mount Mamelon ()\n* Mount Michael ()\n* Mount Phillip ()\n* Mount Sarsfield ()\n* Mount Wellington ()\n* Rocky Peak ()\n* The Sisters ()\n* Cattle Gap, a mountain pass ()\nHistory\nOgmore was originally known as Harley, taking its name from its railway station. However, to avoid confusion with Hartley in New South Wales, on 20 January 1933 it was renamed Ogmore after the coal-mining town and river in Glamorganshire, Wales.\nThe neighbourhood of Bowman takes its name from the Bowman railway station, which was named by the Queensland Railways Department on 26 October 1923 after politician David Bowman.\nThe name Styx is a reference to the River Styx which separates the living from the dead in Greek mythology.The Styx railway station was named on 4 January 1918 by the Queensland Railways Department, but presumably refers to the river in this locality, which was already named at that time.\nStyx No 3 coal mine opened near Ogmore in 1924.\nStyx Coal Mine Provisional School opened on 3 May 1921. It operated as a part-time school in conjunction with the Styx River Provisional School (meaning they shared a single teacher) until it closed on 11 November 1921. On 22 May 1922, it reopened at a new location but still called Styx Coal Mine Provisional School. On 8 May 1923, it reopened as Bowman State School. It closed in 1926.\nStyx River Provisional School opened on 7 October 1919 and closed on 12 Nov 1920. It reopened on 4 July 1921 and operated as a half-time school with Styx Coal Mine Provisional School until 11 November 1921. On 8 May 1923 it became Styx River State School. It closed in 1942. It was on Styx Road ().\nHartley Provisional School opened on 26 May 1924 and became Hartley State School in 1929. It was renamed Ogmore State School in March 1933. It closed in 1999. It was at 2-4 Wilangi Street ().\nThe Ogmore Emergency Hospital was opened on Sunday 15 May 1949 by the Minister for Lands, Tom Foley. The wooden building cost £4235 and could accommodate 4 patients in normal circumstances and 10 in an emergency. Its role was to provide out-patient services while in-patient services would generally be limited to patients waiting to be transferred to a more major hospital or after discharge from a more major hospital. It could also be used as a clinic by visiting dentists.\nIn April 1954, a goods train derailed near Ogmore. A bulldozer travelling on a flat bed carriage was believed to have shifted on the carriage, overturning the carriage.\nThe Styx mines closed in the 1960s. Queensland Rail disbanded its railway gang based in Ogmore in the 1990s. This caused the town's population to decline to about 30 people.\nDemographics\nIn the , the locality of Ogmore had a population of 105 people.\nIn the , the locality of Ogmore had a population of 72 people.\nProposed coal mine\nIn December 2016, a new coal mine was proposed for the Styx River basin  south of the town. The proposal involves two open-cut pits to be mined by the truck-and-shovel methodology and will require a loading facility onto the North Coast railway line. The project is currently undergoing environmental impact assessment. The workforce of 200-250 people is expected to be recruited from the local area, including Ogmore and its neighbouring towns of Marlborough and St Lawrence. In April 2021, the environmental impact assessment determined that the project had too many environmental risks to proceed based on the current proposal.\nEducation\nThere are no schools in Ogmore. The nearest government primary schools are Marlborough State School in neighbouring Marlborough to the south, St Lawrence State School in neighbouring St Lawrence to the north-west, and Clarke Creek State School in neighbouring Clarke Creek to the west. There are no secondary schools nearby; the alternatives are distance education and boarding school.\nReferences\nFurther reading\n*\nExternal links\n*"
    }
  ]
}