{
  "content": [
    {
      "type": "text",
      "text": "# Oi! Warning\n\n| runtime        = 89 minutes\n| country        = Germany\n| language       = German\n| budget         =\n}}\nOi! Warning is a 2000 German movie about a 17-year-old boy who runs away from home to become an Oi! skinhead.\nThe movie was the directorial debut of twin brothers Benjamin and Dominik Reding. It took them about five years to film, mostly due to financial constraints. It was shot in stark black-and-white, underscoring the film's gritty feel. Among other recognitions, the film has won the German Camera Award, and a L.A. Outfest emerging talent award.\nPlot summary\nJanosch has problems at school and despises the lifestyle of his bourgeois mother. He runs away from home, to his friend Koma, who he had met at a holiday camp. Koma is an Oi! skinhead (also known as a punk-skinhead). He is a particular sort of skinhead who has little political motivations, preferring a lifestyle of partying and binge drinking, and whose musical tastes are a synthesis of skinhead and punk rock music.\nKoma's girlfriend is pregnant, and wants him to change his ways. She blows up his secret hideaway with dynamite, but this only infuriates Koma, who blames this on the punks he had gotten into a fight with previously.\nMeanwhile, Janosch meets Zottel, a punk who earns a living with small circus acts at wealthy people's parties. The two fall in love, but their happiness is cut short when Koma attacks Zottel and kills him. In a fit of fury, Janosch grabs a brick and slays Koma.\nCast list\n* Sascha Backhaus as Janosch. Backhaus portrays the main protagonist Janosch, who escapes his pampered bourgeois lifestyle to become an Oi-skinhead, but later questions the ultra-masculine, testosterone-fueled subculture. Backhaus himself was a real-life squatter.\n* Sascha Goerts as Koma. Goerts plays the tough Koma, a hard drinking, kickboxing and often violent Oi-skinhead, who takes Janosch under his wing. Like Backhaus, Goerts was a squatter, and also an occasional street musician. According to the DVD commentary, he gave such a convincing performance that people were shocked when they found out that Goerts is in fact a soft-spoken, intelligent person.\n* Sandra Borgmann as Sandra. Borgmann portrays Sandra, Komas skin-girl girlfriend. She later becomes the mother of his twins and grows fed up of his Oi-behaviour. In contrast to Backhaus and Goerts, Borgmann was already an established actress.\n* Jens Veith as Zottel. A punk with whom Janosch later has an affair. Veith is a real-life fire-eater and juggler and was one of the last actors cast for the movie.\nDevelopment\nWhen they started the project, the Reding brothers wanted to authentically portray youths from fringe subcultures like \"skinheads (non-political Oi!skins), squatters, modern-primitives and tribes ... who all just do what they like ... Their own way of fun, fights, sorrows and desires. What we didn't want to do was: showing stereotypes of youth-culture, like the drug-abusing \"problemchild\" or the sexually overpowered \"teenager\" we all know so well from television.\" According to them, they then drew a 600-picture storyboard and started choosing actors.\nWhen casting the movie, the Reding brothers looked for people who were \"absolutely, 100% believable on the big screen ... This is the reason why the actresses and actors in OI!WARNING are a good mixture of non-professionals and professionals\": male leads Sascha Backhaus and Simon Goerts were non-professionals, whilst female lead Sandra Borgmann was an established actress when the project started. A problem was money, because the Oi! Warning production was very low budget. It took over five years to complete, because the Reding brothers frequently had to stop filming until they had earned enough money to continue.\nIn the film, there is a concert in which the fictional Oi-group Roimkommando (the real life punk band Smegma) holds a concert, to which Oi-skins led by Koma (Goerts) violently mosh to. On the DVD commentary track, the Redings explain that they could not use the sexually charged word Smegma in a film which was meant to be seen by teenagers, so they had to change the name of the band. In addition, all the Oi skinhead extras were real Oi skinheads, who demanded beer as compensation when they slowly grew weary of filming. In addition, they moshed so hard that Goerts was often knocked out of the middle and the scene had to be reshot.\nAwards\nOi! Warning won following prizes:\n*Out-Filmfest, Los Angeles: Outstanding Emerging Talent-Award of the Directors Guild of America 1999\n*World Filmfestival, Montréal: Air Canada People Award 1999\n*International Filmfestival, Leeds: Audience-Award 1999\n*Max Ophüls Filmfestival, Saarbrücken: Film-Award of the Governour of the Saarland 1999\n*Film Kunst Fest, Schwerin: NDR Young Talent Award 1999\n*International Festival du premiere Film, Annonay (France ): Prix Spécial du Jury 2000\nFootnotes\nExternal links\n*[http://www.oiwarning.de/new/english/udfilm/index.phtml Oi! Warning] English language version of official site\n*\n*[http://movies2.nytimes.com/gst/movies/movie.html?v_id=180650 New York Times] Review of Oi! Warning"
    }
  ]
}