{
  "content": [
    {
      "type": "text",
      "text": "# Okunev culture__disambig_1\n\n||none}}\n| mapcaption   = Location of the Okunev culture (Minusinsk Depression), with other contemporary cultures .\n|altnames=Okuniev, Okunevskaya\n|dates = c. 2700 BC - 1800 BC\n|typesite=Okunev settlement\n|period = Bronze Age\n|majorsites=Tas-Khaaza, Chernovaya VIII, Beltyry, Uibat III, Uibat V\n|extra=unique artistic heritage\n|precededby = Afanasevo culture\n|followedby = Karasuk culture,  Andronovo culture, Seima-Turbino phenomenon, Tagar culture\n|horizon=Indigenous peoples of Siberia\n|region = Minusinsk Basin South Siberia}}\nOkunev culture (),  also known as Okunevo culture, was a south Siberian archaeological culture of pastoralists from the early Bronze Age dated from the end of the 3rd millennium BC to the early 2nd millennium BC in the Minusinsk Basin on the middle and upper Yenisei. It was formed from the local Neolithic Siberian forest cultures, who also showed evidence of admixture from Western Steppe Herders and pre-existing Ancient North Eurasians.\nHistory\nand the  \"Stela of Kopyonsky Chaatas\", found near the village Onakhov. Okunev culture, circa 2000 BCE. Khakassia National Museum.\n}}\nOkunev culture was discovered by Sergei Teploukhov in 1928. It was named after the nearby Okunev settlement in the south of modern day Khakassia. Initially, the burials from Okunev were attributed by Teploukhov to the Andronovo culture. Then, on the basis of vessel finds, Teploukhov considered the population to be a transitional variant between the Afanasievo and Andronovo cultures.\nIn 1947, M. N. Komarova identified an \"early Okunev\" stage of the Andronovo culture, which is associated with the earliest stage of the Andronovo culture.\nIn 1955-1957 A.N. Lipsky found Okunev stone slabs with images as part of stone boxes used for burials. Lipsky, who was an ethnographer, not an archaeologist, assumed that the Okunev sites were pre-Afanasiev and attributed them to the Paleolithic era, since he considered the Okunev people to be the ancestors of the American Paleo-Indians, based on parallels in art and anthropology.\nIn the early 1960s G. A. Maksimenkov identified an Okunev culture based on the excavations of the Chernovaya VIII burial ground, whose burials had not been disturbed by later invasions and did not contain Afanasevo ceramics.\nCharacteristics\nSiberia. First half of the II millennium BC. Hermitage Museum, Saint Petersburg]]\nThe early Uibat stage, later Chernov stage, and the final Razliv stage of Okunev culture need to be differentiated.\nTypical sites include Tas-Khaaz,  Beltyry, Uibat III, Uibat V (in the Uybat river basin), Chernovaya VIII, Chernovaya  XI, Razliv  X, and Strelka.\nThe typological horizon between the development of the Afanas'ev and Okunev steppe cultures in the Minusinsk Basin and the development of the later Andronovo type is very thin.\nFinds from the Okunev culture include works of art, including stone statues with human faces (Tas Khyz, as well as Ulug Khurtuyakh tas) and images of birds and beasts hammered out on stone slabs or engraved on bone plaques.\nThere are no significant indications of property and social stratification.\nLivestock, horse, and agriculture\nThe basis of the population's economic activity was stock-raising and animal husbandry (cattle, sheep, and goats), supplemented by hunting and fishing.\nStone hoes, grain graters and pestles, and a reaping sickle with a copper blade and horn handle all testify to agriculture.\nPottery\nThough the ceramic styles of the Okunev are more comparable to later Incised Coarse Ware (ICW), formally and ambiguously Andronovo ceramics. But as the researchers note, the uniqueness of each of them is an important feature of the Okunev culture. Finds from the Okunev culture include lavishly decorated jug-like and conical vessels.\nOkunev ceramics are typically flat-bottomed, with notable continuous ornamentation of the body, the bottom, edge of the rim and its inner side. Most often these are jar vessels, but there are also incense burners with an internal partition.\nMetallurgy\n-type composite spearheads with bone midrib and bronze blade (drawing).]]\nOkunevtsy had developed metallurgy based on the ores of the Sayano-Altai mining and metallurgy areas.  Okunevtsy and the neighboring Samus culture produced the first bronze in north-eastern Central Asia. Finds include copper and tin and rarely arsenical bronze articles. Simple copper objects were superseded by tin alloys. Bronzes were common in this culture. Tools included embedded-handled knives, leaf-shaped knives, awls, fishhooks, and temporal rings. Along with forging, casting was also used, which indicates a rather high level of metalworking. Ornaments of this culture consist mainly of ring-shaped ornaments with circular cross-sections and flat joints at both ends.\nWarfare\nShort swords are relatively advanced with clear boundaries between the handles and the blades. A bronze spear was found at the late Okunevo cultural site, the socket of which was forged with two loose ends. The first of this kind appeared in the Asian steppe region. Besides copper and bronze weapons, the Okunev culture also had charriots as attested by their petroglyphs.\nBurials\nThe  Okunevo culture is represented mostly by mounds burial structures, which were composed of small, rectangular surface enclosures made of stone slabs or sandstone tiles placed vertically in the ground. Within these enclosures were graves that were also lined with stone slabs. 62 Okunevo kurgans consisting of more than 500 burials and 60 single burials have been studied.\nThe cemeteries of the Okunev culture are located, as a rule, not far from the Afanasiev ones and number from two to ten burial mounds. Sometimes burial complexes measure 40 × 40 meters. The number of graves inside the fence varies - from one to ten and even twenty. In addition to single burials, there are paired and collective burials. In almost every burial ground there are burials of a man with two women. The buried were laid, as in Afanasiev's time, on their backs with legs strongly bent at the knees and arms extended along the body.\nDating\nRadiocarbon AMS dating of 50 Okunevo samples are within 2600 –1800 BCE. According to these studies the Uybat period is dated as 2600 – 2300 BCE, Chernovaya as 2200 – 1900 BCE, and Razliv later than 1800 BC.\nGeographic extent\nThe settlements of the Okunev culture were located in the Minusinsk basin, on the middle and upper Yenisei.\nPetroglyphs of the Okunev period are located in the narrow mountain valleys of Khyzyl Khaya and Khurtuy Khola, on the banks of now-dry streams in the modern Kazanovka Museum-Reserve. They are also represented among the Shalabolino Petroglyphs on the right bank of the Tuba River, a right tributary of the Yenisei, against the village of Tes to the southeast of the village of Ilyinka, between the logs and the Shush River to the southwest of the village of Shalabolino, Kuraginsky District, Krasnoyarsk Krai.\nIn the Idrinsky district, east of the village of Bolshoi Telek.\n, with the Yenisey river.]]\nIn the Krasnoturansky District on the left bank of the Bir River under Mount Kozlikha, on the banks of the Syda River.\nIn the Kuraginsky district in the village of Novopokrovka.\nIn the Minusinsky District, on the banks of the Tuba River, near the village of Kavkazsky, nearby the zaimka of Maidashi.\nOn the shore of the lake near the village of the same name Maly Kyzykul, during excavations in the Okunev layer, archaeologists in 1973 discovered the remains of a burnt log structure and fragments of ceramic dishes.\nFive burials in slab boxes were excavated 1&nbsp;km south of Minusinsk on the northern outskirts of a pine forest.\nRelated cultures\nOkunev culture shares some elements of its material culture, including pottery. with a number of local contemporaneous cultures from adjacent areas such as the Samus', Elunino, Karacol, and Krotovo cultures of western  Siberia and Altai, the Kanay type burials of eastern Kazakhstan, and the Okunevo-like culture of Tuva. Nevertheless, there is currently no sound evidence of their common origin.\nThe connections between the Afanasiev and Okunev cultures are rather difficult to trace. The period of their interaction lasted only about a hundred years, but in some territories coexistence is noted. Archaeologists have identified many complexes containing signs of both Okunev and Afanasevo origins. However, almost no genetic traces of Afanasevtsy have been found in the Okunev genotype, meaning Afanasiev population was displaced by the alien Okunevtsy.\nThe similarity between some of the objects from the Okunev burial grounds and objects in the vicinity of the middle Ob River and the Lake Baikal region indicates that the bearers of the Okunev culture came to southern Siberia from the northern taiga regions. While the preceding Afanasevo culture is considered Indo-European, the Okunev culture is generally regarded as an extension of the local non-Indo-European forest culture into the region.\nThe Okunev people closely interacted with  successor cultures of the Andronovo circle.\nSettlements\n.]]\nThe settlements of this culture have been little studied. Mountain Fortress Sve  mountain settlements with fortifications (about 45 were found on the territory of Khakassia) are mainly considered cult complexes. The fortress of Chebaki is one of the first archeologically studied Sve.\nSettlements are known on the territory of Tuva on upper Yenisei.\nWheeled transport\nThe Okunev people used two- and four-wheeled carts. In the rock art of the Minusinsk Basin, images of early (end of the 3rd millennium BC) two-wheeled carts with a composite drawbar of two poles converging at an angle, which simultaneously form the body frame, are common. The design of the wagons and the profile manner of depiction indicate a connection not with Eastern Europe, but with the western regions of Central Asia and, indirectly, with Asia Minor.\nPhysical anthropology\nThe anthropological type of the population was of mixed Caucasoid-Mongoloid origin, with a predominance of Mongoloid. As A. V. Gromov notes, their morphological heterogeneity was striking - there are both purely Mongoloid skulls and typically Caucasoid skulls that do not reveal any traces of Mongoloid admixture. In his opinion, the appearance of the Okunev people was formed as a result of the mixing of the local Neolithic population with an influx of incoming Afanasievo steppe herders from the territory of Central Asia and Kazakhstan.\nAccording to A. G. Kozintsev, the appearance of the Okunev people varies depending on the region. The Okunev people of the Minusinsk Basin were descendants of the local Neolithic population, which was distinguished by its significant originality against the background of the races of the first order. The Okunev people of Tuva show stronger influence from the Pits culture and early Catacomb culture of Ukraine. He argues that the main ancestry of the Okunev people can be traced back to the local Ancient North Eurasians (ANE) and that the anthropologic type of the Okunev people can be described as \"Americanoid\", noting the specific overlaps in characteristics with the Indigenous peoples of the Americas.\nAccording to A. V. Polyakov, the culture was formed from the local Neolithic Paleo-Siberian forest cultures and later received some admixture from the Caspian Sea by a group of mostly male pastoralists of the Yamnaya culture.\nWhile some authors have suggested that the Okunevo may have descended from more northern tribes that replaced Afanasievo cultures in this region, others believe the Okunevo culture was the result of contact between local Neolithic hunter-gatherers with western pastoralists.\nMaksimentkov suggested that Okunevo culture was developed by the local Neolithic tribes of the Krasnoyarsk - Kansk forest-steppe who lived to the north of the Minusinsk Basin.\nThe second theory that is supported at the present time by most researchers suggests that Okunevo culture resulted from the interaction of local Neolithic hunter-gatherers with Western Steppe Herders.\nFile:Okunev figurine from Itkul II mound 14, northern Minusinsk Basin. Uybat stage of the Okunevo Culture (second half of the 3rd millennium BC) 1.jpg|Okunev figurine from Itkul II mound 14, northern Minusinsk Basin. Uybat stage of the Okunevo Culture (second half of the 3rd millennium BC)\nFile:Okunev figurine from Itkul II mound 14, northern Minusinsk Basin. Uybat stage of the Okunevo Culture (second half of the 3rd millennium BC) 2.jpg|Okunev figurine from Itkul II mound 14, northern Minusinsk Basin.\nFile:Okunev figurine from Itkul II mound 14, northern Minusinsk Basin. Uybat stage of the Okunevo Culture (second half of the 3rd millennium BC) 3.jpg|Okunev figurine from Itkul II mound 14, northern Minusinsk Basin.\nFile:Okunev figurine from Itkul II mound 14, northern Minusinsk Basin. Uybat stage of the Okunevo Culture (second half of the 3rd millennium BC) 4.jpg|Okunev figurine from Itkul II mound 14, northern Minusinsk Basin.\nPaleogenetics\nAutosomal DNA analysis found that the Okunevo people formed predominantly from a lineage originating from the admixture of Ancient Northeast Asians (ANA) with Ancient North Eurasians (ANE), with a date of admixture estimated to have been around 5,000 BCE. In addition, there was around 10-20% genetic admixture from Western Steppe Herders, as represented by the Yamnaya or Afanasievo cultures. The Western Steppe Herder ancestry is absent from the X chromosome of Okunevo specimens, suggesting it was inherited from mostly male ancestors. A genetic study published in Cell in June 2020 identified an early Bronze Age individual (BZK002) from the Bazaikha site in the Yenisei River region as a good proxy for the populations that mixed with groups related to Yamnaya/Afanasievo to form the Okunevo ancestry. The BZK002 genome could be modeled as a two-way admixture between LNBA Baikal and Afontova Gora or Botai populations.\n, Baikal EBA and Tarim_EMBA (essentially ANE) ancestry.]]\nAccording to recent studies, modern Native American Indians are genetically close to representatives of the Okunev culture, which confirms previous craniometric studies. Their shared affinities probably come from the presence of Ancient North Eurasian and Ancient East Asian ancestries in both populations dating back to the formation of Ancient Paleo-Siberians.\nThe Okunevo population showed also genetic affinities with the Botai culture, some of the Tarim mummies, and Altai hunter-gatherers.\nThe results of the analysis of the origin of the ancient steppe populations of nomads of the Eurasian steppe (from the Urals to Altai), including representatives of the Bronze Age Okunev culture from the Sayan-Altai, showed that the samples contained components that were most pronounced in Ancient North Eurasian, Eastern hunter-gatherers, Caucasian hunter-gatherers from Georgia and also occur from the component that is most pronounced among the Nganasans (Samoyedic people) and is widely distributed among various modern people from Siberia and Central Asia.\nPaternal haplogroups\nHollard et al. (2018) reported the paternal haplogroups of Okunevo specimens. The six extracted Y-DNA belonged to the following haplogroups: Haplogroup NO1 (three samples), R-M269, Q-M346 and Q-L54. A 2018 genetic study published in the journal Science examined the remains of ten Okunevo males. They were found to be carrying the paternal haplogroups R-M269, Q-L54, Q-L330 (three samples), Q-L940 (three samples), Q-L56 and Q-L712.\nMaternal haplogroups\n| image = Multidimensional scaling based on matrix of Slatkin population differentiation (FST) based on mtDNA HVRI sequences in the Tagar series and other ancient populations from different regions of Eurasia.jpg\n| annotations =\n}}\nAccording to Holllard (2018), 58% of Okunevo specimens carried the East Eurasian haplogroups A, C or D, while 41% carried the West Eurasian haplogroups T, U, H or J.\nThe mitochondrial haplogroup A-a1b3* was identified in the RISE674 sample (4300–3850 years ago, Okunevo_EMBA).\nIn representatives of the Okunev culture from the burial ground of Syda V (Minusinsk Basin), a variety of mitochondrial DNA variants was determined. The Okunevs belonged to the West Eurasian (U, H, J and T) and East Eurasian (A, C and D) subbranches of haplogroups.\nArt\n, Hall of Stone Sculptures, Abakan]]\nRepresentative art: small amulets, stone steles up to 4 m tall and petroglyphs.\nThe Okunev people left behind monuments of art. Characteristic rock inscriptions and stone statues have become famous since the travels of D. G. Messerschmidt in 1722-1723 and subsequent academic expeditions. Steles with drawings from burial vaults are unique. The stone slabs are dominated by realistic images of animals and masks in headdresses, which apparently had a cult character. Rock art monuments are being studied and new ones are being discovered that were not studied by previous researchers. Menhirs are common in the territory of modern Khakassia and the southern part of the Krasnoyarsk Krai. More than 300 of them have been explored on the territory of the Minusinsk Basin. Only 10 sites are known on the right bank of the Yenisei.\nThe impressive stone steles were originally erected at gravesites and were subsequently reused more than a millennium later in the Scythian-era kurgans of Tagar Culture.\nOkunev stone stela collections are displayed in the Khakassia National Museum in Abakan,  Martyanov Museum in Minusinsk, Historical and architectural open-air museum of Novosibirsk and ceramics collections are displayed in the Hermitage Museum in Saint Petersburg.\nAnthropomorphic images\nThe vivid character of the art of the Okunev culture is created by monumental stone sculptures and steles carved with anthropomorphic images. The stone statues are usually tall, up to six meters in height, carved of sandstone or granite into a saber shape. The front is its narrow edge. More than 300 of them have been studied in the Minusinsk Basin, cur only ten are known on the right bank of the Yenisei river.  Many of them are now in museums.\nA fantastic mask looks at the viewer from it: three eyes, nostrils, a huge mouth, horns, long ears and all kinds of processes. The image moves from the front face to the wide side, and sometimes to the back. In addition to the central mask, there are often additional, smaller ones. Sometimes the statue depicts the mouth of a predator, sometimes bulls, many so-called solar symbols. They come in different styles, but usually it is a circle inscribed in a square, a kind of mandala, a symbol of the cosmos. This sign is now an official symbol, on the state flag and the state emblem of modern Khakassia. It was discussed that vertical steles might be used as the ancient tool of orientation in space - time milestones and gnomons - sundial of solar hours calendars. A graphical drawing of vertical sundial can be seen in the divergent rays on sun-facing stele, where the tooth is a benchmark for the accurate determination of noon.\nFile:Tourist-2 ivory anthropomorphic figure.jpg|Tourist-2 ivory anthropomorphic figure\nFile:Tourist-2 mammoth ivory anthropomorphic figure.jpg|Tourist-2 mammoth ivory anthropomorphic figure\nFile:Tourist-2 burl figurine.jpg|Anthropomorphic figurine. Tourist-2 site, Novossibirsk, Okunev culture.\nMonumental steles\nThe Okunev culture erected monumental stelae at gravesites.  They were either anthropomorphic or zoomorphic with geometric patterns. Steles often incorporated a human head, bent forward slightly. The steles were often re-used by later cultures. For example the Early Turks (Gökturks) often inscribed them with Old-Turkish runic inscriptions, such as the Orkhon inscriptions or Yenisei inscriptions.\nFile:Okunev sculptures.jpg|Okunev stelae\nFile:Abakan - Khakassia - Russia - 16702059777.jpg|Okunev stelae, with the \"Stele of Shira\" in the center\nFile:Okunev culture steles.png|Stelae sketched by Aspelin's expedition, 1887.\nFile:Okunev stones.jpg|Okunev culture steles\nFile:Moon god stele.jpg|\"Stele of Shira\".\nFile:Tschirkowo stela.png|Tschirkowo stela, reinscribed with Old Turkic runic characters, circa 7th-8th century CE\nArtistic features of images\nThe following artistic features are distinguished:\n* free scatter of figures in the pictorial field;\n* the presence of anthropomorphic masks;\n* elongated proportions of stylized figures;\n* a variety of fantastic animals;\n* anthropomorphic creatures with bird and animal heads;\n* the sacred (world) mountain in the form of a triangle, divided into parts;\n* triadic compositions, in which the image of a female deity or its symbol is flanked by two figures of a person or animal;\n* images of deities in pointed hats and with bull horns;\n* images of Janus anthropomorphic deities;\n* images of anthropomorphic figures with two eagle heads;\n* images of birds and ornithomorphic figures with a spiral \"tuft\" on their heads;\n* figures of a man with legs and head turned in profile, and the body in front;\n* images of characters under the arch of the \"firmament\";\n* solar sign.\nSimilarities have been noted between the geometrical anthropomorphic motifs of the Afanasievo culture and Okunev culture of the Minusinsk basin in Siberia, and those on the earlier potteries of Banpo (), of the Yangshao culture in northern China. Pottery style emerging from the Yangshao culture are known to have spread westward to the Majiayao culture, and then further to Xinjiang and Central Asia.\nPossible linguistic affiliation\ncultures (Summed probability distribution for new human bone dates, Afanasievo to Tagar cultures).]]\nThe Okunevo culture, together with the spread of the Seima-Turbino material culture, may be in part be linked to the expansion of Proto-Uralic speakers. Peyrot (2019) argues that \"the Okunevo Culture is not to be identified with early Samoyedic, but with Proto-Uralic. This is consistent with Janhunen's convincing arguments that the Ural-Altaic typological profile of Uralic and the primary split between Samoyedic and Finno-Ugric point to an eastern origin (2001; 2009), and it would be just in time for Finno-Ugric to split off and move west towards the Ural Mountains, where this branch was influenced by Proto-Indo-Iranian (e.g. Kuz'mina 2001).\"\nA. G. Kozintsev (2023) argues that the Okunevo culture is better associated with a Yeniseian-related group, possibly Burushaski or an extinct Yeniseian branch. According to him, a Uralic affiliation is unlikely, as Uralic was spoken by people with different material culture, although contact with early Uralic-speakers is plausible. He also reject a possible Indo-Iranian linguistic affiliation, as although the Okunevo culture displays influence from Indo-Iranian groups, they show continuity with previous Ancient Paleo-Siberians, rather than with the Yamnaya culture.\nSee also\nChebaki Fortress Sve-Takh\nReferences\nSources\n*\n*"
    }
  ]
}