{
  "content": [
    {
      "type": "text",
      "text": "# Old Quaker Meeting House (Queens)\n\n| area                     =\n| built                    = 1694-1719\n| architect                =\n| architecture             = American colonial\n| designated_nrhp_type     = December 24, 1967\n| added                    = December 24, 1967\n| refnum                   = 67000015\n| designated_other1        = New York State Register of Historic Places\n| designated_other1_abbr   = NYSRHP\n| designated_other1_date   = June 23, 1980\n| designated_other1_number = 08101.000001\n| designated_other1_num_position = bottom\n| designated_other2_name   = New York City Landmark\n| designated_other2_date   = August 18, 1970\n| designated_other2_abbr   = NYCL\n| designated_other2_link   = New York City Landmarks Preservation Commission\n| designated_other2_number = 0141\n| designated_other2_color  = #FFE978\n}}\nThe Flushing Friends Quaker Meeting House, also the Old Quaker Meeting House, is a historic Quaker house of worship located at 137-16 Northern Boulevard, in Flushing, Queens, New York.  It was declared a National Historic Landmark in 1967 and a New York City designated landmark in 1970. Today, it still serves as a Quaker Meeting, with meetings for worship taking place every Sunday.\nHistory\nColonial times\nThe Flushing Friends Quaker Meeting House was built in 1694 as a small frame structure on land acquired in 1692 by John Bowne and John Rodman in Flushing, New York.  The first recorded meeting held there was on November 24, 1694. This original structure is now the easterly third of the current structure, which was expanded 1716-1719. According to one source, the original structure was renovated in 1704 and then demolished in 1716. The Flushing meeting house was the second meeting house to be built on Long Island, the first one being built in Oyster Bay in 1672, which no longer stands.\nThe Quakers, coming from the Netherlands, settled in the area in 1657 and meetings were held in people's homes until the Meeting House was built.  Henry Townsend offered his home for meetings, but was fined for harboring “pestilents,” which was how the Quakers were regarded. The Quakers continued to meet in secret in the woods until John Bowne offered his home for meetings. Bowne was banished to Holland for refusing to pay the fine, but returned two years later to combat the persecution that the Quakers faced.  The group drafted the Flushing Remonstrance and in Holland, Bowne pleaded before the Dutch West India Company to honor the cause of religious freedom, and a letter was written in 1663 to Governor Stuyvesant to end the persecution of Quakers.\nThe building contains a partition which can be lowered and raised, and separates the men's from the women's side. Typically business meetings would be conducted by each group independently, then the partition would be raised for the religious meeting.\nOccupation by the British Army\nDuring the American Revolutionary War, the Meeting House was seized by the British Army and in 1776 converted to a barracks, prison, and hospital for soldiers.  After the war, in 1783, the Quakers returned the building to its original use.\nRenovations and repairs\nIn 1976, repairs were recommended to the building that totaled an estimated $70,000.  After two and half centuries, the wooden building suffered from “dry not rot and beetle teeth”.  A volunteer archeological crew from New York University and the New York State Division for Historic Preservation was formed to survey the site for stabilization work funded by the Society of Friends and a grant from the National Park Service.  The crew conducted tests to determine the nature of the surface below the Meeting House floor.  Since no evidence of significant cultural or archaeological artifacts were found, it was determined that excavation for the stabilization work could continue.\nIn 2005, the city allocated $600,000 to complete required repairs to the roof, gutters chimney, window frames, and porch deck, but as of 2006, no repairs were started because the amount of paperwork required.  New architectural designs need to be approved by the Landmark Preservation Committee before any work can be done.  Although the building requires repairs, it is still open for meetings and Sunday School.\nGraveyard\nIn 2012, the Religious Society of Friends said that their graveyard, which contains hundreds of unmarked graves, was dug into by a construction company working on an adjacent lot. The company erected a fence on disputed property and caused an outcry from the Quaker community about graves that may have been disturbed.   After the Landmark Preservation Commission threatened a $5,000 fine, the company retreated, although maintained the claim that they did not disturb the grave site. Because of custom at the time, some graves do not display identifying headstones.  Rosemary Vietor, vice president of the Bowne House Historical Society said the contested area may have contained the remains of John Bowne and his successive wives. Although an archeological survey, completed in 2010 at the recommendation of the Landmarks Preservation Committee, approved the adjacent lot for construction, the Quaker community still feels that the issue is unresolved. Descendants of the Bowne family have been called upon to help raise awareness of the issue.\nLandmark statuses\nThe Friends Meeting House in Flushing was designated a National Historic Landmark in 1967.  The Meeting House was also designated a New York City Landmark in 1970; in its report, the New York City Landmarks Preservation Commission reported among their findings that the Friends Meeting house “has a special character, special historical and aesthetic interest and value as part of the development, heritage and cultural characteristics of New York City.”  Further, the Commission noted that it is the oldest place of worship still standing in the city and is an example of medieval architecture.\nSee also\n*John Bowne House\n*List of the oldest Christian denominations in the United States\n*List of New York City Designated Landmarks in Queens\n*National Register of Historic Places listings in Queens\n*List of National Historic Landmarks in New York City\nReferences\nExternal links\n* [https://web.archive.org/web/20181018105238/http://nyym.org:80/flushing/ Old Quaker Meeting House] (official site, archived link by Wayback Machine)\n* [https://flushingfriends.org/ modern site of the Flushing Meeting Religious Society of Friends]"
    }
  ]
}