{
  "content": [
    {
      "type": "text",
      "text": "# Old Town, Warsaw\n\n| coordinates_footnotes  =\n| subdivision_type       = Country\n| subdivision_name       =\n| subdivision_type1      = Voivodeship\n| subdivision_name1      = Masovian Voivodeship\n| subdivision_type2      = City county\n| subdivision_name2      = Warsaw\n| subdivision_type3      = District\n| subdivision_name3      = Śródmieście\n| subdivision_type4      = Municipal neighbourhood\n| subdivision_name4      = Staromiejskie\n| established_title      =\n| established_date       =\n| parts_type             =\n| parts_style            =\n| p1                     =\n| government_footnotes   =\n| leader_party           =\n| leader_title           =\n| leader_name            =\n| unit_pref              = Metric\n| area_footnotes         =\n| area_total_km2         =\n| area_note              =\n| elevation_footnotes    =\n| elevation_m            =\n| population_footnotes   =\n| population_total       =\n| population_as_of       =\n| population_density_km2 =\n| population_note        =\n| timezone               = CET\n| utc_offset             = +1\n| timezone_DST           = CEST\n| utc_offset_DST         = +2\n| postal_code_type       =\n| postal_code            =\n| area_code              =\n| blank_name             =\n| blank_info             =\n| website                =\n| footnotes = (ii), (vi)\n| designation1_free1name = UNESCO region\n| designation1_free1value = Europe\n| designation1_free2name = Area\n| designation1_free2value =\n| designation1_free3name = Buffer zone\n| designation1_free3value =\n|designation2 = Historic Monument of Poland\n|designation2_date = 8 September 1994\n|designation2_partof = Warsaw – historic city center with the Royal Route and Wilanów\n|designation2_number = [https://isap.sejm.gov.pl/isap.nsf/DocDetails.xsp?id=WMP19940500423 M.P. 1994 nr 50 poz. 423]\n}}\n}}\n| zoom             = 15\n| float            = right\n| nolabels         = 1\n| width            = 316\n| height           = 210\n| title            = Warsaw Old Town\n| map-data         = Q1139084\n| caption          =\n| mark-image1 = Royal_Castle_in_Warsaw,_Poland,_2022,_03.jpg\n| mark-image2 = Castle_Square_(22313p).jpg\n| mark-image3 = Kolumna_Zygmunta_(zbliżenie)_02.JPG\n| mark-image4 = Pałac_Pod_Blachą_-_02.jpg\n| mark-image5 = Warszawa_Ogrody_Zamku_Krolewskiego_(dron).jpg\n| mark-image6 = Dziedziniec_klasztorny_kościół_św._Marcina_Warszawa.JPG\n| mark-image7 = Bazylika_archikatedralna_św._Jana_Chrzciciela_w_Warszawie_2020.jpg\n| mark-image8 = Kościół_Matki_Bożej_Łaskawej_w_Warszawie_2020.jpg\n| mark-image9 = Warsaw_Old_Town_Market_Square_10.JPG\n| mark-image10 = Pomnik_Syreny_i_strona_Dekerta_Rynek_Starego_Miasta_w_Warszawie_2020.jpg\n| mark-image11 = Barbakan_w_Warszawie_-_03.jpg\n| mark-image12 = Rynek_Starego_Miasta_w_Warszawie_Strona_Barssa_2020a.jpg\n| mark-image13 = Warszawa_Most_Slasko-Dabrowski_(dron).jpg\n| shapeD           = n-circle\n| shape-colorD     = dark blue\n| label-colorD     = dark blue\n| shape-outlineD   = white\n| label-sizeD      = 12\n| label-posD       = left\n| mark-sizeD       = 12,11\n| label-offset-xD  = 0\n| label-offset-yD  = 0\n| label1           = Royal Castle\n| mark-coord1      =\n| mark-title1      = Royal Castle, Warsaw\n| label-pos1       = right\n| label2          = Castle Square\n| mark-coord2     =\n| mark-title2     = Castle Square, Warsaw\n| label-pos2      = left\n| label3          = Sigismund's Column\n| mark-coord3     =\n| mark-title3     = Sigismund's Column\n| label4           = Copper-Roof^Palace\n| mark-coord4      =\n| mark-title4      = Copper-Roof Palace\n| label-pos4       = bottom\n| label5           = Royal Garden\n| mark-coord5      =\n| mark-title5      = Royal Gardens\n| label-pos5       = right\n| label6           = St. Martin's Church\n| mark-coord6      =\n| mark-title6      = St. Martin's Church, Warsaw\n| label7           = St. John's Cathedral\n| mark-coord7      =\n| mark-title7      = St. John's Archcathedral, Warsaw\n| label-pos7       = right\n| label8          = Jesuit Church\n| mark-coord8     =\n| mark-title8     = Jesuit Church, Warsaw\n| label-pos8      = left\n| label9           = Market Square\n| mark-coord9      =\n| mark-title9      = Old Town Market Place, Warsaw\n| label-pos9       = right\n| label10           = Museum of Warsaw\n| mark-coord10      =\n| mark-title10      = Museum of Warsaw\n| label-pos10       = left\n| label11           = Barbican\n| mark-coord11      =\n| mark-title11      = Warsaw Barbican\n| label-pos11       = right\n| label12         = Museum of Literature\n| mark-coord12     =\n| mark-title12     = Adam Mickiewicz Museum of Literature\n| label-pos12      = right\n|      label13 = VISTULA\n|  label-pos13 = top\n| mark-coord13 =\n|  mark-size13 = 0| label-size13=9| label-color13=soft blue\n| mark-title13     = Vistula\n}}\nWarsaw Old Town, also known as Old Town, and historically known as Old Warsaw, is a neighbourhood, and an area of the City Information System, in the city of Warsaw, Poland, located within the district of Śródmieście. It is the oldest portion of the city, and contains numerous historic buildings, mostly from 17th and 18th centuries, such as the Royal Castle, city walls, St. John's Cathedral, and the Barbican, the Old Town Market Square and the Warsaw Mermaid Statue. The settlement itself dates back to between the 13th and 14th centuries, and was granted town privileges .\nDuring World War II, the Old Town was nearly totally destroyed, and subsequently reconstructed. The project was the world's first attempt to resurrect an entire historic city core and was included on the UNESCO World Heritage list in 1980. The reconstruction efforts were again recognized in 2011 when all its documents and records were added by UNESCO to its Memory of the World international register.\nHistory\ntenement, built 1466]]\nThe Old Town was established in the 13th century. Initially surrounded by an earthwork rampart, prior to 1339 it was fortified with brick city walls. The town originally grew up around the castle of the Dukes of Mazovia that later became the Royal Castle. The Market Square (Rynek Starego Miasta) was laid out sometime in the late 13th or early 14th century, along the main road linking the castle with the New Town to the north.\ntenement portal depicting a galleon at Świętojańska Street, early 18th century]]\nUntil 1817, the Old Town's most notable feature was the Town Hall which was built before 1429. In 1701 the square was rebuilt by Tylman Gamerski, and in 1817 the Town Hall was demolished. Since the 19th century, the four sides of the Market Square have borne the names of four notable Poles who once lived on the respective sides: Ignacy Zakrzewski (south), Hugo Kołłątaj (west), Jan Dekert (north) and Franciszek Barss (east).\nIn the early 1910s, Warsaw Old Town was the home of the prominent Yiddish writer Alter Kacyzne, who later depicted life there in his 1929 novel \"\" (, \"The Strong and the Weak\"). As depicted in the novel, the Old Town at that time was a slum neighborhood, with poor families—some Jewish, other Christian—living very crowded in subdivided tenements that had once been aristocrats' palaces. Parts of it were bohemian, with painters and artists having their studios, while some streets were a Red-light district housing brothels.\nIn 1918 the Royal Castle once again became the seat of Poland's highest authorities: the President of Poland and his chancellery. In the late 1930s, during the mayoralty of Stefan Starzyński, the municipal authorities began refurbishing the Old Town and restoring it to its former glory. The Barbican and the Old Town Market Place were partly restored. These efforts, however, were brought to an end by the outbreak of World War II.\nDuring the Invasion of Poland (1939), much of the district was badly damaged by the German Luftwaffe, which targeted the city's residential areas and historic landmarks in a campaign of terror bombing. Following the Siege of Warsaw, parts of the Old Town were rebuilt, but immediately after the Warsaw Uprising (August–October 1944) what had been left standing was systematically blown up by the German Army. A statue commemorating the Uprising, \"the Little Insurgent,\" now stands on the Old Town's medieval city wall.\nAfter World War II, the Old Town was meticulously rebuilt. In an effort at anastylosis, as many as possible of the original bricks were reused. However, the reconstruction was not always accurate to prewar Warsaw, sometimes deference being given to an earlier period, an attempt being made to improve on the original, or an authentic-looking facade being made to cover a more modern building. The rubble was sifted for reusable decorative elements, which were reinserted into their original places. Bernardo Bellotto's 18th-century vedute, as well as pre-World War II architecture students' drawings, were used as essential sources in the reconstruction effort; however, Bellotto's drawings had not been entirely immune to artistic licence and embellishment, and in some cases this was transferred to the reconstructed buildings.\nSquares\nThe Old Town Market Place (Rynek Starego Miasta), which dates back to the end of the 13th century, is the true heart of the Old Town, and until the end of the 18th century it was the heart of all of Warsaw. Here the representatives of guilds and merchants met in the Town Hall (built before 1429, pulled down in 1817), and fairs and the occasional execution were held. The houses around it represented the Gothic style until the great fire of 1607, after which they were rebuilt in late-Renaissance style.\nCastle Square (plac Zamkowy) is a visitor's first view of the reconstructed Old Town, when approaching from the more modern center of Warsaw. It is an impressive sight, dominated by Sigismund's Column, which towers above the beautiful Old Town houses. Enclosed between the Old Town and the Royal Castle, Castle Square is steeped in history. Here was the gateway leading into the city called the Kraków Gate (Brama Krakowska). It was developed in the 14th century and continued to be a defensive area for the kings. The square was in its glory in the 17th century when Warsaw became the country's capital and it was here in 1644 that King Władysław IV erected the column to glorify his father Sigismund III Vasa, who is best known for moving the capital of Poland from Kraków to Warsaw. The Museum of Warsaw is also located there.\nCanon Square (plac Kanonia), behind St. John's Cathedral, is a small triangular square. Its name comes from the 17th-century tenement houses which belonged to the canons of the Warsaw chapter. Some of these canons were quite famous, like Stanisław Staszic who was the co-author of the Constitution of 3 May 1791. Formerly, it was a parochial cemetery, of which there remains a Baroque figure of Our Lady from the 18th century. In the middle of the square, is the bronze bell of Warsaw, that Grand Crown Treasurer Jan Mikołaj Daniłowicz, founded in 1646 for the Jesuit Church in Jarosław. The bell was cast in 1646 by Daniel Tym—the designer of Sigismund's Column. Where the Canon Square meets the Royal Square is a covered passage built for Queen Anna Jagiellon in the late 16th century and extended in the 1620s after Michał Piekarski's failed 1620 attempt to assassinate King Sigismund III Vasa as he was entering the cathedral. Also the narrowest house in Warsaw is located there.\nRecognition\nIn 1980, Warsaw's Old Town was placed on the UNESCO's list of World Heritage Sites as \"an outstanding example of a near-total reconstruction of a span of history covering the 13th to the 20th century.\nThe site is also one of Poland's official national Historic Monuments (Pomnik historii), as designated 16 September 1994. Its listing is maintained by the National Heritage Board of Poland.\nIn 2011, the Archive of Warsaw Reconstruction Office was added to UNESCO’s Memory of the World Programme.\nGallery\nFile:Scale model of Warsaw 05.jpg|1:300 model of Warsaw Old Town in 2nd half of 18th century, in Museum of Warsaw\nFile:WiKi_DieCastModelOldTownWarsaw3D.jpg|A bronze die-cast model of the early Old Town on display outdoors\nFile:Castle Square (22291p).jpg|Road to the Old Town\nFile:Royal Castle, Warsaw, western facade, 2024, 02.jpg|Castle Square and the Royal Castle\nFile:Ulica Świętojańska w Warszawie przy placu Zamkowym 2020.jpg|Historical houses around Castle Square\nFile:Stone Stairs.jpg|An alley\nFile:Ul. Dawna, Stare Miasto w Warszawie.jpg|Old Town street\nFile:Kościół Matki Bożej Łaskawej w Warszawie 2020.jpg|Jesuit Church, 1609\nFile:2023 Warszawa Kościół Matki Bożej Łaskawej, wieża, 1.jpg|Tower of the Jesuit Church\nFile:Warszawa, bazylika archikatedralna św. Jana Chrzciciela w Warszawie DZolopa 2022-08-18 141753 1207.jpg|St. John's Cathedral, 14th century\nFile:1642011 DSC0028.JPG|St. Martin's Church, 1353–1752\nFile:Szeroki Dunaj Street and drinking fountain in Warsaw, 2022.jpg|Szeroki Dunaj Street\nFile:VarsaviaViaPiwna.jpg|Piwna Street\nFile:Warszawa, ul. Kanonia 4 20170516 001.jpg|Queen Anna's corridor connecting the Royal Castle with the St. John's Cathedral, 16th century. King Sigismund III was attacked by an assassin in the corridor before attending mass.\nFile:Ulica Kanonia w Warszawie 2020.jpg|Canon Square\nFile:Ulica Świętojańska w Warszawie przy placu Zamkowym 2020.jpg|St. John Street\nFile:Dziekania Street in Warsaw 2009 (4).jpg|Deanery of St. John's Cathedral\nFile:Jan Kiliński Monument in Warsaw, 2022.jpg|Jan Kiliński monument\nCity walls\nFile:Warszawa, ul. Podwale, Baszta Rycerska 20170516 001.jpg|Warsaw Old Town surrounded by the old medieval defensive walls\nFile:Warszawa, ul. Nowomiejska, Barbakan 20170516 001.jpg|Defensive walls and the Barbican\nFile:Warszawa, ul. Nowomiejska, Barbakan 20170516 007.jpg|Barbican, 1548\nFile:Warszawa, ul. Podwale, zespół murów obronnych Starego Miasta 20170516 006.jpg|Gunpowder Tower, after 1379\nFile:Warszawa, ul. Podwale, zespół murów obronnych Starego Miasta 20170516 003.jpg|Defensive walls, detail\nMarket Square\nFile:Warszawa Rynek Starego Miasta (dron3).jpg|Old Town Market Square\nFile:Warsaw Old Town, Warsaw, Poland - panoramio (66).jpg|Market Square\nFile:Rynek Starego Miasta w Warszawie Strona Barssa 2020.jpg|Warsaw old town wide (Rynek Starego Miasta)\nFile:Rynek Starego Miasta w Warszawie Strona Dekerta 2020a.jpg|Reconstructed townhouses\nFile:Old Town Market Square in Warsaw, 2022, 01.jpg|Old Town Market Place with tourists\nFile:Pomnik Syreny w Warszawie 2018.jpg|The Mermaid Monument\nFile:Piwnice staromiejskie Muzeum Historyczne m.st. Warszawy 03.JPG|Medieval basements at the Museum of Warsaw\nSee also\n* New Town, Warsaw\n* Explosion of the tank-trap in Warsaw\n* Warsaw Reconstruction Office\nNotes\nReferences\nExternal links\n* [https://zabytek.pl/en/obiekty/warszawa-historyczne-centrum-warszawy Historic Centre of Warsaw], National Institute of Cultural Heritage ()\n* [https://muzeumwarszawy.pl/en/old-town-new-town-in-warsaw/ Old and New Town in Warsaw] walking tour by Museum of Warsaw ()\n* [https://muzeumwarszawy.pl/en/the-city-of-women/ The City of Women] walking tour by Museum of Warsaw ()\n* [http://www.facesofwarsaw.com/Galleries,Old-Town.html/ Old Town Photos] ()"
    }
  ]
}