{
  "content": [
    {
      "type": "text",
      "text": "# Old Man's War\n\n}}\n'Old Man's War' is a military science fiction novel by American writer John Scalzi,  published in 2005. His debut novel was nominated for the Hugo Award for Best Novel in 2006.\n''Old Man's War'' is the first novel in Scalzi's ''Old Man's War series. A sequel, The Ghost Brigades, was published in 2006, followed by two other books, The Last Colony (2007) and Zoe's Tale (2008). Another book in the series, The Human Division, was published as a serial and then collected in a novel (2013). The next book in the series, The End of All Things, was published in June 2015 as four novellas. The seventh novel The Shattering Peace'' was released in September 2025.\nIt was optioned by Paramount Pictures in 2011.\nPlot\nIntroduction\n''Old Man's War'' is the story of retiree John Perry and his exploits as a soldier in the Colonial Defense Forces (CDF). The first-person narrative follows Perry's military career from CDF recruit to the rank of captain. It is set in a universe heavily populated with life forms, in which various space-going species compete with each other for the scarce planets that are suitable for sustaining life. As a result, Perry must learn to fight a wide variety of aliens. The characters in ''Old Man's War'' have enhanced DNA and nanotechnology, giving them advantages in strength, speed, endurance, and situational awareness.\nSynopsis\nJohn Perry, a 75-year-old retired advertising writer, joins the Colonial Defense Forces who protect human interplanetary colonists. Volunteers sign letters of intent and provide DNA samples at age 65, which John and his now deceased wife Kathy had done ten years prior to the beginning of the story. After visiting his wife's grave to say goodbye (as volunteers can never return to Earth), Perry takes a space elevator to the CDF ship Henry Hudson, where he meets Thomas, Jessie, Harry, Alan, Susan and Maggie, fellow retiree volunteers. They dub themselves the \"Old Farts\".\nFollowing a series of sometimes unusual psychological and physical tests, Perry's mind is transplanted into a clone of himself made from collected genetic material. His new body is not only younger, but genetically engineered with enhanced musculature, green skin, and yellow cat-like eyes. He now possesses enormous strength and dexterity, nanobot-enhanced artificial blood, enhanced eyesight and other senses, and most critically, a BrainPal—a neural interface that, among other capabilities, allows Perry to communicate with other members of the CDF via thought.\nAfter a week of frivolity and libertinism in their new bodies, Perry and the other recruits land on Beta Pyxis III for basic training. During this training, the CDF's heritage in the United States armed forces is made clear when the recruits are taught the Rifleman's Creed. Perry's drill instructor, Master Sergeant Ruiz, adopts a tough and disdainful persona towards recruits, but discovers Perry is the creator of an advertising slogan Ruiz adopted as a personal mantra (\"Sometimes you just gotta hit the road\"). As a dubious gesture of respect, Perry is given the job of platoon leader during the weeks of training before he is shipped out to the CDF ship Modesto.  His first engagement is with the Consu, a fierce, incredibly intelligent and religiously zealous alien species. Perry improvises a tactic which enables the CDF to win this first battle. This is soon followed by a number of battles with, among others, the bear-like Whaidians and the tiny Covandu. By the end of this last engagement Perry begins to suffer psychological distress over killing the Liliputian Covandu and accepts that he has transformed both physically and mentally.\nNow a veteran, Perry participates in the Battle for Coral. The planet contains coral reefs valuable to the attacking Rraey, as well as a human colony (the Rraey also have a taste for human flesh). The CDF plans to rapidly counterattack with a small force before the Rraey establish their coral strip mining operations, but the Rraey are somehow able to predict the appearance of a space ship's skip drive (a feat that should not be possible) and use this knowledge to ambush and destroy CDF ships as they arrive in the Coral system. Perry's quick thinking allows him and his fellow soldiers on a transport shuttle to escape the wreckage of the Modesto and make for the planet's surface, but they are shot down. Everyone but Perry is killed in the crash; Perry is grievously wounded. Perry is left for dead by a Rraey search party (who find CDF soldiers inedible), and he is rescued by members of the mysterious \"Ghost Brigades\", the Special Forces units of the CDF. Perry thinks he has died when he sees a younger green version of his dead wife Kathy, who in reality is Jane Sagan, the leader of the Ghost Brigades rescue team.\nAfter being repaired, Perry encounters Sagan, who turns out to have been grown based on Kathy Perry's DNA sample, as legally allowed by her letter of intent to join the CDF. Unlike John, Jane has no memories of Kathy's life, as she is only six years old, but after learning about Kathy, Jane seeks to learn more from John about being a \"realborn\" person and what kind of life one can have outside the CDF.\nSagan manipulates her chain of command to promote John to an advisory role (as a lieutenant) to gather information from the Consu during a ritualistic meeting to obtain information. Perry discovers that the Rraey had received tachyon-based skip-drive detection technology from the Consu, which was used to set up the ambush at Coral. Perry also manipulates his chain of command to have the last two of his friends from the \"Old Farts\" transferred out of combat duty to military research. Sagan and Perry then participate in a Special Forces operation in an attempt to capture or destroy the borrowed Consu technology in advance of a major attack to recapture Coral from the Rraey. Perry is instrumental in the successful outcome of the battle by capturing the technical manual for the Consu detection system (which was destroyed in the fighting), and saving Sagan's life after she is severely wounded. However, he never sees her again after delivering her to a shuttle which returns her to the secretive Ghost Brigades.\nAt the conclusion of the book, Perry is promoted to captain following his deeds at Coral and, despite the separation, holds hope of reuniting with Sagan when their terms of service conclude.\nFictional technology\nSkip Drive\n''Old Man's War'' introduces a new form of FTL interstellar travel called a Skip Drive. The Skip Drive takes an object like a spaceship, punches a hole in space, and places the object at its destination in a new, essentially identical universe. There are limits on the skip drive due to the characters not knowing all there is to know about how it works. The limitations are as follows:\n* The object skipping must not be near a major gravity well.\n* The object skipping cannot skip out too far.\nThe Colonial Union and other governments use devices called skip drones to communicate. These skip drones are essentially computers equipped with skip drives. A ship or satellite will launch one of these devices away from local gravity wells and skip to its target locale and upload its information to the local people.\nMore advanced races, notably the Consu, have a more complex understanding of skip drives and can even detect ships skipping into a system.\nBrainPal\nThe BrainPal is a neural implant that allows members of the Colonial Defense Forces (CDF) to send and receive data, including speech, battle plans and much more. CDF soldiers use their BrainPals to communicate with each other, translate alien languages, watch classic cartoons, and read old books.\nA BrainPal allows a CDF soldier to operate colonial technology by thought alone. A CDF rifle can only be used by someone with a BrainPal.\nTo the members of the Ghost Brigades the BrainPal does much more: it provides a synthetic consciousness that allows the newborn soldiers to function until their own identities develop. This gives people who meet Special Forces the impression that they know everything. When presented with a situation that is unfamiliar to the newborn soldier, the BrainPal loads the relevant and important information directly into the mind at an amazing rate.\nMP-35\nThe MP-35, also known as \"empee\", is the main infantry weapon used by the Colonial Defense Force (CDF).\nThe weapon features self-assembling and self-repairing capabilities, the ability to interface with BrainPal, and ammunition composed of nano-robotic bullets able to transform immediately into any type of projectile desired, including bullets, incendiaries, explosives, and beams. These features make it superior to conventional weapon types, as it solves the problem of excessive weight associated with carrying multiple weapons, weapon jamming, and enemy use. The weapon proved to be very versatile and adaptable in the battlefield, as shown in Perry's first battle against the Consu where he took full advantage of the weapon's adaptability and used BrainPal to program a sequence of fire that exploited the enemies' weakness to win the battle.\nBeanstalk\nThe Beanstalk is a space elevator, built by the CDF, connecting Earth and the CDF space station. The space elevator, officially built to transport colonists and CDF recruits to space, displayed the CDF's power and technological prowess. To Earth's inhabitants, the space elevator defied physics and was extremely impractical. Henry hypothesized that the entire concept of the Beanstalk was taken from another alien species. In real life, John Scalzi notes that the feasibility and practical application of a space elevator is speculative.\nAlien species\nConsu\nThe Consu are a fierce, technologically advanced, and strongly religious alien race. They believe in helping deserving races reach \"Ungkat\", a state of perfection for a whole race.\nThe Consu are the most advanced alien race presented in the Old Man's War. Their home system is surrounded by a Dyson sphere, which harnesses all the energy output of its local sun's companion star, a dwarf star, to make it impenetrable to the weapons and technology of every other known species. The Consu possess technology so advanced that even the CDF is unable to reverse-engineer or even fully understand it, such as tachyon detectors. Despite being the most technologically advanced out of all the alien races presented in the novel, in any conflict the Consu will scale their weapons' technology to that of their opponent in order to keep the battle fair. Unlike other alien species, the Consu do not fight for territory, but for religious motives, believing that any aliens killed by Consu warriors are thereby guaranteed another place in the cycle of creation. The Consu rarely meet with outsiders and any individual that does is inevitably a criminal or other undesirable. Following the meeting, the meeting dome is imploded and shot into a black hole so that it cannot defile any other Consu.\nCovandu\nThe Covandu are a liliputian species, the tallest only measuring an inch, but otherwise very similar to humans. Their aggression in colonizing planets is similar to humans' as well, sometimes causing conflict. One human colony was taken over by Covandu when it was abandoned due to a virus (which did not affect the Covandu). After developing a vaccine, humans returned to take it back by force.\nThey are gifted in the arts, specifically poetry and drama.\nRraey\nThe Rraey are a species described in Old Man's War as being considerably less advanced than the CDF. They consider humans as a part of a \"balanced breakfast\" and are even known to have celebrity chefs showing how to best butcher a human. They became a serious problem for the CDF after acquiring technology from the Consu to predict the trajectory of a vessel's skip drives, a feat that was previously considered impossible. They are described as having \"muscular bird-like legs,\" with backwards knees (compared to a human knee). They also have optical and auditory \"bands\" which wrap around their head instead of eyes and ears, and skin folds on their heads to radiate heat instead of hair.\nThey developed a craving for humans, going as far as creating many dishes for different parts of the body. They are a few decades behind the CDF in terms of technology and weaponry, but nonetheless, still considered a threat to the CDF. The skip drive detection device given to them by the Consu enabled them to wipe out an entire fleet of CDF ships without any casualties to their own.\nWhaidian\nThe Whaidians are an alien species that have an appearance similar to that of a \"cross between black bear and a large flying squirrel.\" Their home consists of small planets that are linked together. They are artistically gifted and are nearly as technologically advanced as the CDF. For this reason they are targeted by the CDF and their spaceport is completely destroyed by a fleet of CDF ships. The highest form of Whaidian art is a collective chant which is recited by small groups all the way up to entire cities.\nThemes\nOld Man's War sits in the military science fiction genre but themes of the ethics of life extension, friendship, marriage, the significance of mortality, what makes one human, and individual identity are present within the novel. Aging plays its biggest role near the beginning of the novel with the CDF being able to find a way to reverse the effects of aging. The themes of marriage and friendship are explored in the characterization of John Perry through his continued love of his dead wife and his later meetings with Jane. When it comes to identity and humanity John Perry is the focus of attention and his characteristics by the end of the novel determine whether or not the reader believes John Perry is still human.\nScalzi states that he was influenced by Robert Heinlein's Starship Troopers and modeled his book's format after Heinlein's novels. He wanted to make the story as sympathetic as possible to the reader in which one can understand events such as being in a war.\nScalzi took what he learned about Heinlein and produced four lessons on how to create a novel centered on characters. These lessons are that a story should only exist for its characters, make room in the characters for the reader, make the characters talk like people, and make the characters act like people. His novel's themes were based on the four lessons in which to make a character as connectable as possible while still keeping his theme of space military.\nPublication history\nThe printed novel was first officially released as hardcover on January 1, 2005, by Tor Books, which is an unusual date for a book, because it is a national holiday and it was a Saturday that year, whereas nearly all traditionally published books in the United States are published on Tuesdays. However, Scalzi states that the book was available in bookstores and at online distributors by December 2004. The first printing of Old Man’s War was 3,700 copies and was sold out within three weeks. Because of this success, Tor made the uncommon step of reprinting the novel as a trade paperback.\nAlthough it is usually referred to as Scalzi's debut novel, he published his first novel Agent to the Stars as shareware on his website already in 1999, and before Tor contracted the novel, there was a serialised online version of ''Old Man's War'', too, self-published chapter by chapter in 2002.\nSequels\n* The Ghost Brigades, the sequel to ''Old Man's War.\n* The Last Colony, the third book in the series.\n* Zoe's Tale, the fourth book in the series.\n* The Human Division, the fifth book in the series.\n* The End of All Things, the sixth book in the series.\n* The Shattering Peace, the seventh book in the series.\n* [https://web.archive.org/web/20121019115417/http://subterraneanpress.com/magazine/fall_2007/fiction_the_sagan_diary_by_john_scalzi The Sagan Diary], a novella taking place between The Ghost Brigades and The Last Colony''. The [http://whatever.scalzi.com/2007/02/05/the-sagan-diary-the-audio-version/ audio version] available from the author's website.\n* [http://www.tor.com/stories/2008/07/after-the-coup After the Coup], a short story featuring Harry Wilson.\n* Questions for a Soldier, a short story featuring John Perry.\nAdaptations\nNetflix announced plans in 2017 to make a film based in the universe of ''Old Man's War. Previous failed attempts to release adaptations of Old Man's War include a film project by Paramount Pictures and a TV adaptation by Syfy. Recent developments suggest Steven Spielberg will be signing on to direct a feature version of the book in 2026, following the release of his own original sci-fi film The Dish, though the author himself has denied this.\nAppearances in other works\nA character can be seen reading the book in an episode of the science fiction television series Stargate Universe, as a shout-out to Scalzi in his role as creative consultant on the show.\nCritical reception\nOld Man's War was well received both domestically and globally. In 2011, Old Man's War was ranked #1 on a Tor.com reader poll as the best science fiction and fantasy novel of 2000–2010. In 2012 it was voted #1 on the Locus online reader poll for best science fiction novel of the 21st century, and in 2011, Old Man's War'' was listed 74th on the NPR.com reader poll of the Top 100 science fiction and fantasy books/series for 2011.\n{| class=\"wikitable sortable\"\n|+ Awards and honors\n|-\n! Year\n! Award\n! Category\n! Result\n! Ref.\n|-\n! rowspan=3 | 2006\n| Hugo Award\n| Novel\n|\n|\n|-\n| John W. Campbell Award for Best New Writer\n| —\n|\n|\n|-\n| Locus Award\n| First Novel\n|\n|\n|-\n! 2007\n| Geffen Award\n| Translated Science Fiction Novel\n|\n|\n|-\n! 2008\n| Seiun Award\n| Translated Long Form\n|\n|\n|}\nReferences\nExternal links\n*\n* [https://www.amazon.com/gp/product/product-description/0765348276/ref=dp_proddesc_0 Editorial Reviews at Amazon]\n* [http://upcoming4.me/item/10400-cover-art-history-john-scalzi-old-man-s-war \"Old Man's War Cover Art History at Upcoming4.me\"]"
    }
  ]
}