{
  "content": [
    {
      "type": "text",
      "text": "# Old Cooranga, Queensland\n\n| pop                 = 29\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4626\n| area                = 238.8\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 22.7\n| dir1                = S\n| location1           = Mundubbera\n| dist2               = 52.1\n| dir2                = SW\n| location2           = Gayndah\n| dist3               = 201\n| dir3                = W\n| location3           = Maryborough\n| dist4               = 388\n| dir4                = NW\n| location4           = Brisbane\n| lga                 = North Burnett Region\n| stategov            = Callide\n| fedgov              = Flynn\n| near-n              = Glenrae\n| near-ne             = Pile Gully\n| near-e              = Pile Gully\n| near-se             = Wigton\n| near-s              = Toondahra\n| near-sw             = Toondahra\n| near-w              = Beeron\n| near-nw             = Derri Derra\n}}\nOld Cooranga is a rural locality in the North Burnett Region, Queensland, Australia. In the , Old Cooranga had a population of 29 people.\nGeography\nThe locality is bounded to the west by the Boyne River while the eastern boundary roughly follows the flow of Coocher Creek. The land along these watercourses is lower ( at the Boyne River) and is used for farming, while the north–south spine of the locality rises to unnamed peaks of .\nThe east and south-east of the locality is within the Pile Gully State Forest which extends into neighbouring Pile Gully.\nThe predominant land use is grazing on native vegetation with some irrigated horticulture in the west of the locality near the Boyne River.\nHistory\nCooranga Provisional School opened on  14 August 1922 and closed in March 1923.\nDemographics\nIn the , Old Cooranga had a population of 27 people.\nIn the , Old Cooranga had a population of 29 people.\nEducation\nThere are no schools in Old Cooranga. The nearest government primary school is Boynewood State School in Boynewood to the north-west. The nearest government secondary schools are Mundubbera State College (to Year 10) in Mundubbera to the north-west and Burnett State College (to Year 12) in Gayndah to the north-east.\nReferences"
    }
  ]
}