{
  "content": [
    {
      "type": "text",
      "text": "# Old Town Hall, Barking\n\n| location =East Street, Barking\n| area =\n| built =1893\n| architect = Charles James Dawson\n| architecture =Renaissance Revival style\n| governing_body =\n| designation1 =Grade II Listed Building\n| designation1_offname =Barking Magistrates' Court and railings, lampholders and lamps\n| designation1_date =24 August 1981\n| designation1_number =1359304\n}}\nThe Old Town Hall is a former municipal building on East Street in Barking, London. The building, which was converted for use as a magistrates' court in 1960 and more recently for residential use, is a Grade II listed building.\nHistory\nThe building was commissioned by the Barking Local Board, formed in 1882, to serve as public offices. The site the board selected, on the southeast side of East Street, was occupied by a market garden.\nThe new building was designed by a local architect, Charles James Dawson, in the Renaissance Revival style, built in red brick with stone dressings and was completed in 1893. The design involved a near symmetrical main frontage of five bays facing onto East Street. The central bay featured a large stone portico with a round headed opening and elaborate carvings in the spandrels. The end bays, which were slightly projected forward, were fenestrated by mullioned and transomed windows on the ground floor and by oriel windows with ogee-shaped heads on the first floor, all surmounted by gables. The other bays were fenestrated by mullioned and transomed windows in a similar style. At roof level, there a brick parapet and a central cupola with a clock, an ogee-shaped dome and a finial.\nThe building became the offices of Barking Urban District Council in 1894. Following a visit by  Prince George in 1931, when he conferred borough status on the area, it became the headquarters of the new borough council. It ceased to be local seat of government when the council relocated to the new town hall in 1958.\nThe building was subsequently converted for use as the local magistrates' court and re-opened as such in August 1960. In December 1989, the building was the venue for the initial stages of the trial of the former boxer, Terry Marsh, who was accused of having shot the boxing promoter, Frank Warren, outside the Broadway Theatre in Barking. March was sent for trial at the Old Bailey and was later acquitted.\nHM Courts and Tribunals Service ceased using the building as a courthouse in September 2011. The courthouse featured in the television drama Lawless, starring Suranne Jones as a judge, in 2013. It was subsequently sold to a developer and then converted into 13 apartments also in 2013. A new building, connected by a bridge, was erected behind the original building to accommodate a further 24 apartments with retail space on the ground floor.\nReferences"
    }
  ]
}