{
  "content": [
    {
      "type": "text",
      "text": "# Oliver P. Morton (monument)\n\n| type               = Bronze, granite\n| height_metric             = 480\n| width_metric              = 192\n| length_metric             = 192\n| height_imperial    = 120\n| width_imperial     = 48\n| length_imperial    = 48\n| diameter_metric    =\n| diameter_imperial  =\n| city               = Indianapolis\n| museum             = Indiana Statehouse\n| mapframe           = yes\n| mapframe-zoom      = 13\n| coordinates        =\n| owner              = State of Indiana\n}}\nOliver P. Morton and Reliefs is a public artwork by Austrian artist Rudolph Schwarz, located on the east side of the Indiana Statehouse in Indianapolis, Indiana, at the intersection of North Capitol Avenue and West Market Street.\nDescription\nThe Oliver P. Morton memorial is composed of three bronze statues and two bronze reliefs, one plaque on the front, and two plaques on the rear, also of bronze. The pedestals on which the statues stand are made of granite. Oliver Perry Morton stands positioned in the center, raised above the other two figures by a full figure's height. Two Union soldiers flank either side of Morton. The soldiers on the proper left is uniformed and holding a bayonet. The soldier on the proper right is holding a rifle and wearing a sword on his left; this figure is uniformed as well. Below the figures at the base of the pedestals are two flags crossed with olive branches, and there is an oak wreath of leaves and acorns in the center.\nThe reliefs are located on the sides of the soldiers' pedestals. The relief that faces south depicts Oliver P. Morton giving a speech. The relief that  faces north shows him standing in an infirmary tent.\nOn the rear of the memorial are two plaques. The top plaque is located on the pedestal of Morton. It reads:\nOn the plaque below the first on the lower part of the pedestal are the words:\nHistorical information\nAs seen on the memorial label, the memorial was installed in 1907. The work was commissioned by the Indiana General Assembly.\nThe planning of the Morton memorial began in early 1906. On February 9, 1906, the Commission met and designs were presented by Franklin Simmons from Rome, Italy; Hugh A. Price from Chicago, Ill.; and Rudolph Schwarz from Indianapolis, Indiana, for bronze figures 12 feet high and the tablets for $9000. The designs for the pedestals were planned upon contract with John R. Lowe and if accepted, architect fees would be for the same. Plans by Lowe were accepted and after legal notice was given in the newspapers, bids for the pedestals were received on April 10, 1906. The Commission accepted bid of Chas. G. Blake & Co. of Chicago, Illinois of the $7,483 for Barre granite and $10,150 for Westerly granite.\nSoon after, officers of the state designated the space of the memorial as \"Morton Plaza.\" The dimensions of the pedestals were then increased, for which the contractors were allowed an additional $935. On June 4, 1906, a contract in the amount of $7,500 was entered into for Schwarz to create the following components of the memorial: the letters of the name \"Morton\"; the 4.5 x 5 foot tablet that gives a brief history of life and services of Governor Morton; the  Grand Army tablet that is two feet six inches by eight feet; and the two bronze statues of soldiers of the Civil War, each ten feet high.\nTwo balustrades were then placed on the north and south ends of Morton Plaza. The Commission again chose Chas. G. Blake & Co. Rudolph Schwarz received another contract to provide and furnish the materials for two bronze bas-reliefs to be placed on the middle columns of the balustrades for $500 apiece.\nThe bas-relief of the south balustrade dedicates a scene to the women of the war. It states \"... while some were supplying clothing and hospital supplies, others went down to the very border line of danger to help nurse back to health the sick and wounded, when possible.\"  The north bas-relief portrays a familiar war scene of the reception of homecoming veterans.\nThe materials for the foundation upon which the pedestals sit is deeply laid solid masonry of limestone and cement. The pedestal itself weighs 32 tons and required 16 horses to move it from the car to the place where it is now. The bronze of the monument weighs approximately , of which  is attributed to just the Morton figure. The bronze is composed of 90% copper, 8% tin, and 2% zinc; the bronze of the balustrades and reliefs has the same composition.\nOliver Perry Throck Morton, Morton's grandson, unveiled the memorial at the age of 8. After the dedication, the only unfinished work was the paving of the plaza. Crushed granite and granite steps were installed soon thereafter at the cost of $1,139.75. The total amount that was spent on the project was $36,544.40.\nOliver Perry Morton\nOliver Perry Morton was the first Indiana native to be governor of Indiana. He was born in Salisbury, Indiana in Wayne County. The family's name was originally Throckmorton, known by the emigration of Morton's grandfather from England around the beginning of the Revolutionary War who settled in New Jersey. Oliver's father was James T. Morton from New Jersey; his mothers maiden name was Sarah Miller. When he was young Oliver worked as a hatter's apprentice for four years before attending college at Miami University in Ohio. He studied law in Centerville, Indiana and at law school in Cincinnati, Ohio. Morton began his legal career reading law in the office of Judge Newman of Centerville.\nMorton was originally a Democrat and opposed to the extension of slavery, but he became one of the organizers of the Republican Party. In 1856, after he joined the Republicans, he was one of three delegates from Indiana that attended that party's organizational convention in Pittsburgh. In 1856 he was nominated by his new party for the position of governor of Indiana.  In 1860 he was elected lieutenant governor on the ticket with Henry S. Lane. He became governor when Lane was elected to the United States Senate. Morton was re-elected in 1864 and served until 1867, in which time he was elected to the United States Senate.  He was re-elected in 1873 to the Senate. As Senator he worked for the adoption of the Fifteenth Amendment, was involved in the impeachment of Andrew Johnson, and was a trusted advisor of the Republicans in the South. At the national Republican convention in 1876 he received the second-highest number of votes for the presidential nomination. He was considered a leading Radical Republican during his government career. He died on November 1, 1877.\nArtist\nRudolph Schwarz (June 1840 – 14 April 1912), was an Austrian sculptor who emigrated to Indianapolis in December 1897 to help complete the Soldiers' and Sailors' Monument in Indianapolis, Indiana.\nSee also\n* Christopher Columbus (Vittori)\n* Thomas A. Hendricks Monument\n* List of public art at the Indiana Statehouse\nReferences\nExternal links\n*[https://web.archive.org/web/20071029021805/http://www.nps.gov/history/nr/travel/indianapolis/indianastatehouse.htm The National Park Service: Indiana Statehouse]\n*[https://web.archive.org/web/20101208041250/http://www.in.gov/idoa/2371.htm Indiana Statehouse Tour Office]\n*[https://www.flickr.com/groups/indiana_statehouse/ View more photos of this piece and other artwork found at the Indiana Statehouse on Flickr]"
    }
  ]
}