{
  "content": [
    {
      "type": "text",
      "text": "# Oliver Queen (Arrowverse)\n\n| adapted_by =\n| portrayer =\n| voice =\n| full_name = Oliver Jonas Queen\n| aliases =  ()\n* The Hood\n* The Arrow\n*  ()\n* Green Arrow\n* The Spectre\n}}\n| affiliation =\n}}\nOliver Jonas Queen, also known by his alter-ego the Green Arrow, is a character in The CW's Arrowverse franchise, first introduced in the 2012 pilot episode of the television series Arrow. The character is based on the DC Comics character of the same name, created by Mort Weisinger and George Papp, and was adapted for television in 2012 by Greg Berlanti, Marc Guggenheim, and Andrew Kreisberg. Stephen Amell portrayed Oliver Queen, with Jacob Hoppenbrouwer portraying a young Oliver.\nIn the series, Oliver, a billionaire playboy, who claimed to have spent five years shipwrecked on Lian Yu, a mysterious island in the North China Sea, returns home to Starling City (later renamed \"Star City\") to fight crime and corruption as a secret vigilante whose weapon of choice is a bow and arrow. During the first season, Oliver focuses on a list of targets, written by his father, that are taking advantage of the city's citizens. Subsequent seasons have him venturing into all criminal activity, and he shifts from being willing to kill to having a rule against all killing as a means of stopping assailants. In Arrow, Oliver is known during the first season as \"The Hood or The Vigilante\", but drops those personas once he vows to stop killing and starts using a new name: \"The Arrow\". He does not take up the \"Green Arrow\" mantle until season four, after Roy Harper publicly confesses to being \"The Arrow\" to protect Oliver. He is a friend and frequent ally of the Central City-based superhero The Flash, White Canary, who leads the superhero team the Legends, and the Kryptonian superheroine Supergirl.\nAmell appeared as Oliver Queen and his vigilante persona in crossovers on the television series The Flash, Legends of Tomorrow, Supergirl, Batwoman, and the animated web series Vixen, all of which are set in the Arrowverse. The character has also appeared in several tie-in comics and novels, as well as appearing in three video games. Amell received praise from critics for his portrayal of Oliver Queen, and he has been nominated for various awards for his performance, including a People's Choice and Leo Award.\nCharacter biography\nArrow\nSeason 1\nOliver Queen first appears in the pilot episode of Arrow. He is discovered on the deserted island of Lian Yu by fishermen, having been shipwrecked there five years earlier following the destruction of his family yacht the ''Queen's Gambit'', which he was on with his father Robert Queen (Jamey Sheridan) and Sara Lance (Jacqueline MacInnes Wood), who did not survive. Oliver returns to Starling City and is greeted by his mother Moira (Susanna Thompson), his sister Thea (Willa Holland), his best friend Tommy Merlyn (Colin Donnell), and ex-girlfriend Laurel Lance (Katie Cassidy). Unknown to his friends and family, Oliver has returned to Starling City to carry out a plan of redemption for his father, who Oliver believes failed to do everything he could to help the citizens of Starling City. Season one focuses on Oliver readjusting to life during the day and spending his nights dressed as a hooded vigilante. As his vigilante persona, Oliver carries a bow and various types of specialty arrows, and acts as judge, jury, and if necessary executioner to the wealthy that have used their money and power to take advantage and hurt the citizens of Starling City, and in the process embroiled into conflicts with some of the city's criminals including the Triad leader China White (Kelly Hu) and drug lord The Count (Seth Gabel).\nIn the episodes \"Lone Gunmen\" and \"The Odyssey\", Oliver is forced to reveal his identity to his bodyguard John Diggle (David Ramsey) and Queen Consolidated IT specialist Felicity Smoak (Emily Bett Rickards). Afterward, each joins Oliver in his quest to save Starling City from a mysterious group who is determined to destroy the Glades, an area of Starling City filled with crime and the underprivileged. Ultimately, Oliver discovers that the group's leader is Tommy's father Malcolm Merlyn (John Barrowman), who is also responsible for Oliver's family's yacht's sabotage and thus his own father's death, which leads Oliver and the elder Merlyn to become enemies. Season one also features flashbacks to Oliver's time on Lian Yu and the inhabitants that he encounters while there. In season one, Oliver meets Yao Fei (Byron Mann) and Slade Wilson (Manu Bennett), who teach Oliver how to survive on the island, training him to fight and use a bow, while plotting to stop Edward Fyers (Sebastian Dunn) from taking out a Chinese commercial airliner.\nSeason 2\nIn season two, Oliver is initially found back on the island, having returned as penance for what he views a personal responsibility for the successful destruction of the Glades and the loss of his best friend. He eventually returns to save his family's company, and decides that he needs to honor his friend by stopping crime in the city without killing. Oliver spends season two being harassed by Slade Wilson, who survived Lian Yu and arrives in Starling City determined to make Oliver suffer the way he did on the island. By the end of the season, Oliver has lost his company to Slade, and must contend with an army of soldiers with superhuman strength that are determined to destroy Starling City on Slade's orders. Oliver and his friends—which now includes trained assassin Sara Lance (Caity Lotz), an aspiring vigilante named Roy Harper (Colton Haynes), and members of the League of Assassins—are able to stop the army and Slade. Season two flashbacks focused on the deteriorating relationship between Oliver and Slade, the discovery of a formula that can create super strength and near invulnerability called the Mirakuru, and a group of prisoners being experimented upon just off the coast of the island.\nSeason 3\nIn season three, Oliver is brought into a confrontation with Ra's al Ghul (Matt Nable) after Sara's death. To protect his sister, who had been drugged and coerced into killing Sara by Malcolm, Oliver claims responsibility for the murder and engages Ra's in a trial by combat. After surviving the sword of Ra's al Ghul, he is pursued by Ra's to become the new leader of the League. After Ra's mortally wounds Thea, Oliver accepts his offer so that he can use the Lazarus Pit to save Thea. In \"Al Sah-him\", Oliver appears in Starling City to kill Nyssa al Ghul (Katrina Law), who also claims the title of \"Heir to the Demon\", where it is revealed that he has been brainwashed by Ra's into renouncing all things \"Oliver Queen\". In \"This Is Your Sword\", it is shown that Oliver is actually lying to Ra's, and planning to destroy the League from the inside. The season three finale features Oliver killing Ra's, and subsequently giving up being a hero for Starling City and leaving to have a new life with Felicity. Over the course of the season, Laurel and Thea take over Sara and Roy's roles on the team. Season three flashbacks focused on Oliver living in Hong Kong and training under Amanda Waller (Cynthia Addai-Robinson) and her subordinates.\nSeason 4\nIn season four, after retiring from vigilantism, Oliver has live a happy life with Felicity Smoak at Ivy Town, until Thea and Laurel approach him, telling that they need him back at the newly rechristened Star City, which has been taken over by \"Ghosts\". He eventually discovers that the mastermind is H.I.V.E.'s leader Damien Darhk (Neal McDonough), and become enemies with Darhk as both himself and his vigilante alter-ego. As the \"Arrow\" persona has been tarnished, Oliver now goes by the code name \"The Green Arrow\" as he becomes a vigilante once again, but as a symbol of hope for the city, gradually regaining Diggle's trust. Oliver also decides to run for mayor of Star City. During this time, Oliver discovers that he is the biological father to a nine-year child named William (Jack Moore), with Samantha Clayton (Anna Hopkins), a college classmate whom Oliver had a one-night stand during his relationship with Laurel. This discovery complicates his relationship with Felicity and his duty as Green Arrow, as well as threatens to jeopardize his mayoral campaign. After subsequent attacks from Darhk leaving Felicity permanently paraplegic, his son being kidnapped and Laurel is killed, leading Oliver to take his opportunity to kill Darhk when it arises, while his team helps avert Darhk's plans for a nuclear holocaust. Season four flashbacks focus on Oliver returning to Lian Yu on Amanda Waller's orders to infiltrate the mysterious Shadowspire organization.\nSeason 5\nIn season five, Oliver recruits a team of vigilantes to help balance his double life as Green Arrow and Star City's mayor. He is also stalked by a mysterious archer, Prometheus (Josh Segarra), who has some troublesome link to his past as the Arrow. Later Oliver figures out that Prometheus is someone close to him. Oliver is also facing with the possibility that his life might have been inadvertently affected by his friend and ally Barry Allen's (Grant Gustin) time-travelling actions. The season's flashbacks explore Oliver's time in Russia, where he joins the Bratva as part of an assassination ploy against Konstantin Kovar (Dolph Lundgren) and exploring the criminal fraternity in the process. There, he meets and is trained by one of Ra's al Ghul's daughters, Talia al Ghul (Lexa Doig), as a hooded archer, before eventually returning to Lian Yu and subsequently Starling City.\nSeason 6\nIn season six, after a series of battles with Prometheus led to Samantha's death, Oliver struggles to raise William himself and tries to have a relationship with his son. After he and Felicity rekindled their romance, they eventually married at Central City with Barry Allen and Iris West (Candice Patton) marrying alongside them. Oliver also develops a feud with hacktivist Cayden James (Michael Emerson) and his cabal, and also discovers Ricardo Diaz (Kirk Acevedo) is manipulating them to against each other before battling Oliver himself after killing James. By the end of the season, Oliver is forced to turn himself in to the FBI in exchange of their aids against Diaz, reveals to the world that he is Green Arrow in the process.\nSeason 7\nIn season seven, Oliver tries to get his sentence reduced for Good Behavior, in hopes to return to his family, but is complicated by some of his old enemies who are imprisoned with him and in addition some inmates who work for Diaz. He learns that there is another vigilante archer in Star City, whom the media dubs as the new Green Arrow. Through the news reports, Oliver discovers that the vigilante's skills and tactics eerily matched his. Unbeknownst to Oliver, the vigilante is actually his unknown paternal half-sister Emiko (Sea Shimooka), who was conceived from his father's extramarital affair with a woman named Kazumi Adachi. When Ricardo Diaz is captured, Oliver is released from prison and deputized as part of the Star City Police Department and resumes fighting crime as the Green Arrow, now fighting without the mask and hood. Eventually Emiko is revealed as the leader of a criminal organization named the Ninth Circle, who seeks to destroy Oliver's legacy. In the season finale, Team Arrow thwart the Ninth Circle's plan and Oliver makes amends with Emiko before her death. Oliver and Felicity leave Star City to hide from the Ninth Circle. After Felicity gives birth to a girl named Mia (Katherine McNamara), she and Oliver are confronted by the Monitor (LaMonica Garrett), who previously made a deal with Oliver to save Barry and Kara Danvers's (Melissa Benoist) lives in exchange for his help in the impending crisis that threatens the multiverse. Oliver leaves with the Monitor despite knowing that he will not return from the calamity. The season's flashforwards focus on the children of some of the ex members of Team Arrow, like William (Ben Lewis) and Mia (Katherine McNamara), Oliver and Felicity's children, Diggle's adoptive son Connor Hawke, and Rene Ramirez's daughter Zoe, in adulthood as they battle a company called Galaxy One.\nSeason 8\nIn the final season, Oliver works with Mar Novu to prevent an impending crisis following a deal he made with Oliver to save the lives of Barry Allen and Kara Danvers. For his first mission, Novu takes Oliver to Earth-2 to retrieve dwarf star particles from Tommy Merlyn, who is the Dark Archer of that Earth, with the help of Laurel and Earth 2's Green Arrow Adrian Chase. Oliver succeeds in his mission, only to witness Earth-2's destruction with Laurel its only survivor.\nAfter Diggle and Tatsu help him place a scientist named Dr. Robert Wong in A.R.G.U.S. custody, Oliver reunites with Thea and Talia when he travels to Nanda Parbat where he learns Novu might be causing the crisis rather than preventing it. He is then taken back to the bunker where he meets the future versions of his children Mia and William as well as Connor Hawke, John's future adopted son. Oliver decides to bond with future Mia and William as he expects that would he not live past the Crisis, shocked from learning his and his friends' children are at war with each other in the future, and Rene's daughter Zoe is killed by Diggle's son J.J. during the conflict. Oliver and his team are able to gather the resources to try and oppose the Monitor's predicted destruction, but Oliver is eventually killed in the opening hour of the Crisis when he sacrifices himself to help the residents of Earth-38 evacuate by protecting a tower that is holding back the anti-matter destruction. Mia and Sara attempt to revive him with a Lazarus Pit, but are only able to restore his body without retrieving his soul. John Constantine takes John Diggle and Mia to Earth-666 to collect on a favor with Lucifer to try and retrieve Oliver's soul from Purgatory, but before he can be brought back to his body, Oliver is 'recruited' by Jim Corrigan to become the host of the powerful entity known as the Spectre. Having contacted the surviving seven Paragons of the multiverse (Barry, Sara, Kara, J'onn J'onzz, Kate Kane/Batwoman, Ryan Choi, and Lex Luthor), Oliver is able to lead them into a position where they can confront the Anti-Monitor's forces while he faces the villain himself and triggers the reconstruction of the universe at the cost of his own life. The final episode of \"Crisis\" sees the heroes assemble a Crisis team to respond to future threats in a more pre-emptive manner, preceded by a news broadcast where the President asks the world to honour Oliver for his sacrifice. The final episode of \"Arrow\" depicts Oliver's funeral, attended by Barry, Kara, and all of Oliver's key friends and family, including the resurrected Tommy Merlyn, Moira Queen, and Quentin Lance (Thea and Moira speculate that Oliver didn't restore his father to life as Robert living would have affected Oliver's ability to become a hero). At the conclusion of the episode, set in 2040, the Monitor brings Felicity to a pocket dimension where she can be with Oliver forever in a version of the afterlife.\nCrossovers\nAmell appeared as Oliver Queen in six Arrowverse shows, Arrow, Batwoman, The Flash, Legends of Tomorrow, Vixen and Supergirl, having appeared in all seasons of Arrow (eight seasons), The Flash (six seasons) and Vixen (two seasons). He also appeared in three seasons of Legends of Tomorrow, three seasons of Supergirl and the first season of Batwoman. In the 2014–15 television season, he made his first crossover appearance as Oliver's vigilante persona in the pilot episode of The Flash, giving Barry Allen advice on becoming a hero. Following that, he appeared in The Flashs eighth episode, titled \"Flash vs. Arrow\", where he learns about metahumans and is forced to fight Barry after the latter is chemically brainwashed into becoming volatile and physically aggressive. Oliver also appeared in the 22nd episode of The Flash, \"Rogue Air\", helping Barry and Firestorm, Ronnie Raymond (Robbie Amell) and Martin Stein (Victor Garber), defeat the Reverse-Flash (Tom Cavanagh).\nIn the 2015–16 television season, Amell voiced the character in the first season of the web series Vixen, in which Oliver and Barry track down Mari McCabe (Megalyn Echikunwoke), the wielder of the Tantu totem who becomes the mystical vigilante Vixen, and become her allies. Oliver later appeared in a two-part crossover spanning the Flash season two episode \"Legends of Today\" and the Arrow season four episode \"Legends of Yesterday\", with his and Barry's respective teams working together to stop Vandal Savage (Casper Crump). He briefly appears in the pilot episode of Legends of Tomorrow, advising Ray Palmer (Brandon Routh) on joining Rip Hunter's (Arthur Darvill) time-travelling mission. Oliver appears once again in Legends of Tomorrow, in its sixth episode \"Star City 2046\", as a possible 2046 version of the character. This version has a goatee and is missing his left arm with a cybernetic prosthesis, a nod to the portrayal of the character in The Dark Knight Returns and The Dark Knight Strikes Again.\nIn May 2015, Amell revealed he had discussions with DC Entertainment to portray the character on Constantine, a show that was initially not depicted as existing in the shared universe created by The CW series, saying, \"The reason that I was going to guest star on Constantine, at least the idea that we were throwing around was Constantine's] an expert when it comes to the Lazarus Pit, which is now something that is a part of and will continue to be a part of Arrow.\" Amell stated that, even though Constantine was not renewed for a second season on NBC, a crossover \"was and is still on the table\". In August 2015, it was confirmed that Matt Ryan, who portrayed Constantine, would appear on Arrow in the fourth-season episode \"Haunted\", per a \"one-time-only\" deal. This set the stage for Constantine to become part of the Legends of Tomorrow cast in the series' fourth season.\nIn the 2016–17 television season, in the \"Invasion!\" crossover, the Dominators attack Earth and the various heroes must band together to fight them off, forcing Oliver to face his role as the indirect catalyst of the modern age of heroes as he helps Barry Allen coordinate Earth's metahuman defenses. He also voiced the character for the second season of Vixen. Oliver also appears in the second-season premiere of Legends of Tomorrow, in which he assists Nate Heywood (Nick Zano) in tracking down the Waverider, where they discover Mick Rory (Dominic Purcell) in stasis after a showdown with Damien Dahrk in the year 1942, which resulted in Rip Hunter and the Legends being separated, with the exception of Rory, who fills in Oliver and Nate on what happened.\nIn the 2017–18 television season, in the \"Crisis on Earth-X\" crossover, Oliver and Sara lead the heroes of their world, Earth-38, and Earth-X to battle against invaders from the Nazi-ruled Earth-X. Oliver faces his fascistic parallel universe doppelgänger Dark Arrow (also portrayed by Amell when unmasked), whom Oliver is determined to kill, after discovering his counterpart's villainy and status as the Reich's leader. In the 2018–19 television season, he appeared in all three episodes of Arrow, The Flash and Supergirl in the \"Elseworlds\" storyline, in which Oliver and Barry temporarily swap identities and powers due to the manipulation of psychiatrist John Deegan, who received the Book of Destiny from the powerful Monitor as part of a test.\nIn the 2019–20 television season, in the \"Crisis on Infinite Earths\" crossover, Oliver sacrifices himself trying to save Earth-38's people. In the afterlife, his spirit chooses to become the Spectre over being resurrected to gain the power necessary to defeat the Anti-Monitor. During the ensuing battle, Oliver uses his powers to recreate the multiverse, resulting in Earth-1, Earth-38, and the Earth where Black Lightning is set, being merged into Earth-Prime. Though Oliver died a second time as a result, his friends and allies continue to defend Earth-Prime in his memory.\nIn the 2022–23 television season, Amell reprised his role as Oliver in a guest capacity in the ninth and final season of The Flash, in the episode \"It's My Party and I'll Die If I Want To\". In this episode, Oliver returns to assist Barry in defeating Ramsey Rosso / Bloodwork, who plans to spread his dark matter infection throughout the newly recreated multiverse. It is also revealed that Oliver has continued to assume the role of the Spectre since his death, only intervening when the multiverse is endangered. With help from Wally West and John Diggle, Oliver and Barry thwart Bloodwork's plot, with Oliver purging his abilities and HLH.\nAlternate Earths\nIn the season 2 episode of The Flash, \"Enter Zoom\", it is revealed through video footage from Earth-2 that the Oliver Queen of that Earth died when the ''Queen's Gambit'' sunk, and that his father, Robert Queen, survived and went on to become a vigilante known as 'The Hood'. In the first episode of the final season of Arrow, Adrian Chase became Earth-2's version of the Arrow.\nIn the season 1 episode of Legends of Tomorrow, \"Star City 2046\", the Legends arrive in a future version of Star City in the year 2046, which is later revealed to be on Earth-16. They meet an older Oliver Queen who fought Slade's son Grant Wilson who took the mantle of Deathstroke. Wilson defeated Oliver and severed his left arm, and eventually devastated the whole city. Oliver replaced his arm with a cybernetic arm and out of grief, vanished from the public and hid himself in his bunker. During the \"Crisis on Infinite Earths\" crossover, the Oliver of Earth-16 was seen again. Brainiac-5, Lois Lane, and Sara Lance meet him when they are looking for the pod containing Lois' infant son Jonathan, as they find him keeping the baby safe from Grant Wilson's gangs. While noting about how his Sara is dead, Oliver of Earth-16 gives Jonathan back to them as they leave Earth-16.\nDuring the \"Crisis on Earth-X\" crossover, one of its main antagonists is revealed to be Earth-X's Oliver Queen. Known as Dark Arrow, this version is Adolf Hitler's successor as the Führer in a world where the Nazis won World War II and achieved world domination. He is married to Overgirl, the Earth-X version of Kara Zor-El.\nTie-in comics and novels\nThe Arrow version of Oliver Queen first appeared in the 2012 prequel comic \"Arrow #1: Special Edition\". The comic was released before the series aired and it ties in with the TV series' first season. The comic was later developed into an ongoing digital comic series titled Arrow, that lasted 36 chapters between 2012 and 2013 and featured various storylines. The next year, the character appeared in Arrow: Season 2.5, a bi-weekly comic series which bridged the gap between the end of season two and the start of season three.\nIn 2015, Oliver appeared in tie-in novel, Arrow: Vengeance, written by Oscar Balderrama and Lauren Certo. In 2016 he appeared in the crossover novel The Flash: The Haunting of Barry Allen written by Susan and Clay Griffith, and in 2017 in the conclusion of the crossover, Arrow: A Generation of Vipers, by the same authors. In 2018 Oliver appeared in the tie-in novel Arrow: Fatal Legacies, co-authored by Marc Guggenheim and James R. Tuck, published in January 2018, which bridged the gap between the season five finale and the season six premiere.\nIn the canon comic miniseries Earth-Prime, Oliver has returned from the dead in 2040 and is once again operating as Spectre.\nPortrayal\nAmell was cast as Queen in January 2012, and was the first actor to audition for the role, with Kreisberg saying that Amell \"hit the target from the outset\" and \"everyone else just paled in comparison\". Producer Marc Guggenheim expressed that the creative team wanted to \"chart [their] own course, [their] own destiny\", and avoid any direct connections to Smallville, which featured its own Oliver Queen / Green Arrow (Justin Hartley), opting to cast a new actor in the role. It was also the first script that Amell auditioned for during pilot season, having received multiple scripts at the start of the year. For Amell, the appeal of portraying Queen was that he saw multiple roles tied to the same character: \"There's Queen the casual playboy; Queen the wounded hero; Queen the brooding Hamlet; Queen the lover; Queen the man of action, and so on.\" The actor, who was already in shape from Rent-a-Goalie, did physical fitness training at Tempest Freerunning Academy out of Reseda, Los Angeles, California. Amell received archery training as well, which included watching a video on how archery has been displayed inaccurately or poorly in television and film before learning the basics of shooting a bow. Amell describes the up-keep on his fitness as the biggest physical challenge of the series. Amell stated that he has to \"steal time at the gym\", and spends time on set being active.\nCharacter development\nCharacterization\nIn season one, Oliver is not afraid to kill criminals when he deems it necessary. Pilot episode director David Nutter believes that, following the time on the island, Oliver returns to Starling City with post-traumatic stress disorder (PTSD) and this contributes to his willingness to kill. Amell stated, \"Killing people is gonna start to weigh on Oliver. He can't [complete his mission] by himself. He's gonna have to lean on somebody.\" Amell describes Oliver as having to battle himself in season one. Similarly identifying Oliver as having PTSD, Amell sees the character as a \"damaged individual\" who is a \"ticking time bomb\"; Oliver is not only doing good things, but falling along the way. For Amell, the character's damaged nature will weigh on him throughout season one, because he must hide his new self from his family, and masquerade as the \"entitled jerk\" that he once was.\nRelationships\nOriginally framed as a 'billionaire playboy', the character was involved in multiple romantic pairings over the course of the series first two seasons. However, from season three onwards his principal romantic relationship is with the character Felicity Smoak, who was originally slated to appear in one episode of season one, but went on to become a main character. The dynamic was developed between the pair in season two, with Stephen Amell stating \"she's the woman at the moment who knows me better than anybody\". Speaking to TVLine before the season three premiere, when asked whether or not \"there is a place on Arrow for a great love\", Amell stated \"I think that both Laurel and Sara, for Oliver, were loves that were principally from the past, from before the boat. And any other sort of brief relationship that he's had has been flawed. Felicity has clearly, over the course of two-plus seasons, grown into that love for him.\" Talking about the development of the relationship in 2018, he stated that \"in our show, it was Oliver and Felicity, and it was going to be them no matter what\". Actress Emily Bett Rickards, who portrays Felicity, believes she and Oliver and are soul mates, a sentiment echoed by Amell. Showrunner and executive producer Wendy Mericle described the emotional journey Oliver goes through during the 2017 Arrowverse crossover, in which he and Felicity marry, as one where he \"explores the question of true love\". Talking about the relationship in the latter half of season seven, showrunner Beth Schwartz commented \"They're definitely on track. They're back to, in a sense, being normal between each other. There's no friction between the relationship. They have a lot of obstacles in their way, but they'll be a team. It won't separate them. ... They'll be a force to reckon with.\"\nOliver also has connections with the other characters on the show. Amell sees the relationship between Oliver and his mother, upon his return from the island, as almost adversarial. To him, the Queen family has many skeletons in their closets, which helped them to amass their wealth, and his return is a threat to that way of life. Oliver's relationship with his younger sister Thea changes once he returns from the island as well. Amell notes that Thea looks up to Oliver before he went missing, but it was an Oliver that was immature and a jerk. When he returns, Thea has taken over that role and Oliver has to recognize that his behaviors before impeded his ability to get through to Thea in season one.\nCostume\nin the season two episode \"Three Ghosts\". The producers wanted something that felt as though it could have been part of the costume from the beginning.]]\nThe realistic approach to the series included the costume design for Oliver's vigilante persona, created by Colleen Atwood. According to Amell, it was important for the suit to be functional, and the best way that he knew for that was if he could put the costume on by himself: \"If I can put it on by myself, I think that people will buy it. And that was our idea. That's our world.\"\nIn the second half of season two, Oliver replaces his \"painted\" mask with a domino mask gifted to him by Barry, similar to one worn by the character in the comics. The change is addressed on-screen, with Kreisberg saying, \"He doesn't just put on a mask. It's actually a big plot point in an episode, and there really is a story behind, not only the need for the mask but also who provides him with it.\" On adding the mask now, Kreisberg stated that, \"Conceptually, it was something we wanted to do because Oliver himself is evolving as the Arrow—from vigilante to hero, sort of from Arrow to Green Arrow—and we wanted to see that progression in his costume as well. As Oliver is embracing being a hero, being a hero means stepping out of the dark and being more of a symbol, so he has to take steps to conceal his identity more.\" He added that it will \"allow the Arrow to interact with people who don't know his identity in a much more organic way than having him constantly keep his head down.\" Costume designer Maya Mani put together roughly 50 mask options for the producers. Various designs reminded the creative team of something Joel Schumacher would create. Kreisberg said, \"What's so wonderful about the design that Maya came up with is that it really is very simple, and it feels as if it's been part of his costume since the beginning...once we finally had this mask and put it on Stephen [Amell], even Stephen was like, 'This is the right one.\nIn season four, Oliver acquires a new costume. Designed by Mani at the end of season three, the costume originally had full sleeves. After input from producer Greg Berlanti and Amell, Mani redesigned the costume to show off the character's biceps, and be more reflective of the comic book counterpart. According to Mani, \"I wanted it to be tactical, so the shoulders are a little tougher [...] I also wanted him to be able to remove a layer or be in the layer and still be the Arrow, but not have the full fig on.\"\nReception\nCritical response\nAndy Greenwald of Grantland wrote that Amell deserves a \"great deal of the credit\" for Arrows success, as he brings a subtle humor hidden beneath his \"Hollister veneer\". Greenwald goes on to state that Amell's performance as Oliver Queen makes that persona a more interesting character than the Arrow. Entertainment Weeklys Ken Tucker acknowledged Amell's range as an actor for the series premiere: \"Amell is no mere muscle-head as an actor&nbsp;— he let confusion, dismay, disappointment, and resolve play across his face at the right moments, even when the dialogue became stilted or clunky.\" Neil Genzlinger wrote in The New York Times that Amell was \"just inscrutable enough to pull off the transition from the playboy he was before the shipwreck to the avenging, bow-wielding Green Arrow he becomes on his return to civilization\". The San Francisco Chronicles David Wiegand came to a similar conclusion, stating Amell has the \"acting skill that enables him to be convincing both as rescued rich kid Oliver Queen and as his green-hooded alter ego, Arrow\". In contrast, The Guardians Stephen Kelly found Amell more \"uncomfortable and awkward\" in the role, which made it difficult to like his character as a \"traumatised badass\".\nAccolades\n|-\n! scope=\"row\" | 2012\n| IGN Awards\n| Best TV Hero\n| data-sort-value=\"Amell, Stephen\" | Stephen Amell / Arrow\n|\n|\n|-\n! scope=\"row\" rowspan=\"3\" | 2013\n| NewNowNext Awards\n| Cause You're Hot\n| data-sort-value=\"Amell, Stephen\" | Stephen Amell\n|\n|\n|-\n| rowspan=\"2\" | Teen Choice Awards\n| Choice TV Actor: Fantasy/Sci-Fi\n| data-sort-value=\"Amell, Stephen\" | Stephen Amell\n|\n|\n|-\n| Choice TV Breakout Star\n| data-sort-value=\"Amell, Stephen\" | Stephen Amell\n|\n|\n|-\n! scope=\"row\" rowspan=\"5\" | 2014\n| Constellation Awards\n| Best Male Performance in a 2013 Science Fiction Television Episode\n| data-sort-value=\"Amell, Stephen\" | Stephen Amell (\"The Odyssey\")\n|\n|\n|-\n| IGN Awards\n| Best TV Hero\n| data-sort-value=\"Amell, Stephen\" |Stephen Amell / Arrow\n|\n|\n|-\n| Leo Awards\n| Lead Performance&nbsp;– Male\n| data-sort-value=\"Amell, Stephen\" | Stephen Amell (\"Crucible\")\n|\n|\n|-\n| People's Choice Awards\n| Favorite Sci-Fi/Fantasy TV Actor\n| data-sort-value=\"Amell, Stephen\" | Stephen Amell\n|\n|\n|-\n| Young Hollywood Awards\n| Super Superhero\n| data-sort-value=\"Amell, Stephen\" | Stephen Amell\n|\n|\n|-\n! scope=\"row\" rowspan=\"3\" | 2015\n| MTV Fandom Awards\n| Ship of the Year\n| data-sort-value=\"Amell, Stephen & Emily Bett Rickards\" | Stephen Amell & Emily Bett Rickards\n|\n|\n|-\n| rowspan=\"2\" | Teen Choice Awards\n| Choice TV Actor: Fantasy/Sci-Fi\n| data-sort-value=\"Amell, Stephen\" | Stephen Amell\n|\n|\n|-\n| Choice TV Liplock\n| data-sort-value=\"Amell, Stephen & Emily Bett Rickards\" | Stephen Amell & Emily Bett Rickards\n|\n|\n|-\n! scope=\"row\" rowspan=\"2\" | 2016\n| MTV Fandom Awards\n| Ship of the Year\n| data-sort-value=\"Amell, Stephen & Emily Bett Rickards\" |Stephen Amell & Emily Bett Rickards\n|\n|\n|-\n| Teen Choice Awards\n| Choice TV: Liplock\n| data-sort-value=\"Amell, Stephen & Emily Bett Rickards\" | Stephen Amell & Emily Bett Rickards\n|\n|\n|-\n! scope=\"row\" rowspan=\"2\" | 2017\n| MTV Movie & TV Awards\n| Best Hero\n| data-sort-value=\"Amell, Stephen\" | Stephen Amell\n|\n|\n|-\n| Teen Choice Awards\n| Choice TV Actor: Action\n| data-sort-value=\"Amell, Stephen\" | Stephen Amell\n|\n|\n|-\n! scope=\"row\" rowspan=\"2\" | 2018\n| rowspan=\"2\" | Teen Choice Awards\n| Choice TV Actor: Action\n| data-sort-value=\"Amell, Stephen\" | Stephen Amell\n|\n|\n|-\n| Choice TV Ship\n| data-sort-value=\"Amell, Stephen & Emily Bett Rickards\" | Stephen Amell & Emily Bett Rickards\n|\n|\n|-\n! scope=\"row\" | 2019\n| Teen Choice Awards\n| Choice TV Actor: Action\n| data-sort-value=\"Amell, Stephen\" | Stephen Amell\n|\n|\n|}\nIn other media\nA representation of Amell's character has appeared in two video game products. The 2013 game Injustice: Gods Among Us contains downloadable content that features an optional costume for Green Arrow based on Queen's appearance in the first season. Amell provides his voice and likeness to the costume. 2014's Lego Batman 3: Beyond Gotham features an Arrow downloadable content pack that includes Oliver Queen in his Arrow persona, as well as a bonus level set on Lian Yu in which Oliver trains with Slade and raids Fyers' camp to destroy a weapons stockpile. Amell also voiced the traditional Green Arrow in the game. The Arrow would once again appear as a downloadable character in Lego DC Super-Villains as Green Arrow's TV Heroes variant instead of a separate character this time.\nNotes\nReferences\n}}"
    }
  ]
}