{
  "content": [
    {
      "type": "text",
      "text": "# Omar Kingsley\n\n| death_place   =Bombay, India\n| resting_place =\n| other_names   =Miss EllaElla Zoyara\n| occupation    = Circus performer\n| years_active  =\n| known_for     =\n| notable_works =\n}}\nOmar Kingsley (1840April 3, 1879), also known as Ella Zoyara, was an American circus performer, equestrian, and female impersonator who was billed as \"Miss Ella\".\nEarly life\nSamuel Omar Kingsley was born in 1840 in St. Louis, United States. He was of Creole descent.\nCircus life\nKingsley was discovered by Philadelphia's Spencer Q. Stokes around the mid-1850s.\nApprenticed to Stokes, a circus proprietor, he learned equestrian acts and adopted the stage name Mademoiselle Ella Zoyara. Stokes outfitted Kingsley in women's attire, allowing him to portray an equestrienne. Kingsley traveled with Spencer Stokes to Europe, performing as a circus rider in all the major cities. While in Italy, the King of Sardinia, Victor Emmanuel II, presented Ella Zoyara with a stallion recognizing extraordinary equestrian talent.\nAs early as 1859, Kingsley's act was associated to Dan Rice's Great Show in the American circus scene. On March 3, 1860, Kingsley appeared in Dan Rice's Great Show billed as Ella Zoyara for the sixth appearance.\nWhen James M. Nixon brought Cooke's Royal Circus from Astley's Amphitheatre to Niblo's Garden, Ella Zoyara was on the bill on February 11, 1860. Trained in Berlin around 1856, the full-blood Arabian mare Zaidee, given to Zoyara by a member of the Prussian Court, performed under Zoyara's direction for the first time in front of an American audience. As a lead performer with Nixon's company, the equestrian was offered first-class travel from England and back for self and two servants, full medical care, carriage and horses on request, a benefit every two weeks, and $500 weekly. Nixon later merged Cooke's circus with P.T. Barnum's Old Grizzly Adams' California Menagerie for a tour of New England. From March 5 to April 6, 1860, the company travelled to Boston with equestrian acts including Omar Kingsley billed as \"Ella Zoyara\" among the attractions.\nKingsley created a sensation after marrying Sallie Stickney, in complete secrecy, in October 1861.\nHe only abandoned his female persona when he became a well-paid co-owner of the Wilson Circus, performing his daring tricks on horseback as a man. In 1863, Omar Kingsley went to California and made his debut in connection with John Wilson's circus. A few years later in 1866, Kingsley travelled to Sydney, Australia as a co-proprietor of Cooke, Zoyara, & Wilson's Great World Circus. In partnership with Wilson's Circus, Kingsley accompanied the travelling show to India.\nDeath\nOmar Kingsley died on April 3, 1879 in Bombay, India.\nReferences"
    }
  ]
}