{
  "content": [
    {
      "type": "text",
      "text": "# Omoide ni Kawaru Kimi: Memories Off\n\nis a Japanese romance visual novel developed by KID for the Dreamcast and the PlayStation 2. It is the third game in the Memories Off series. The game was released for the Dreamcast and the PlayStation 2 on November 28, 2002. It was later ported to the PlayStation Portable. It was adapted into the first tale of an OVA series, titled as \"Memories Off 3.5: Omoide no Kanata e\".\nStory\nShougo is a lazy university student. He used to have a girlfriend called Kanata Kurosu, but one day she left him and he did not know anything about her. One day, he meets her at the Cubic Cafe, Shougo's usual relaxation spot, and a new story begins.\nCharacters\n;\n: (OVA)\n:A first year student at Chihaya University.\n;\n:\n: (OVA & sequels)\n:Shougo's ex-girlfriend. She leaves him without a trace.\n;\n:\n:A second year student at Chihaya First High. She wants to be a food journalist. Mifu's older sister.\n;\n:\n:First year student at Chihaya First High and Neo's younger sister. She cannot walk and drives on a wheelchair. She has a cheerful personality and likes flowers.\n;\n:\n:A first year student at Chihaya University Law Department with a cold attitude.\n;\n:\n:A first year student at Chihaya University Arts Department.\n;\n:\n:A teenage freeter like Shin.\n;\n:\n:The second year high school student. Likes Kenji Miyazawa's Ginga Tetsudou no Yoru.\n;\n:Often called as Tenchou, he is the owner of a local cafe called Cubic Cafe. Most of the characters are frequent customers in this cafe.\n;\n:A frequent customer at Cubic Cafe and the older brother of a certain someone in Memories Off: Sorekara.\n;\n:\n:A frequent customer at Cubic Cafe. He grew up in an orphanage.\n;\n:\n:The series' recurring character.\n;\n:\n:Heroine of the first Memories Off. She studies at Fujikawa Nursing School. A frequent customer at Cubic Cafe. She makes a cameo in Memories Off: Sorekara.\n;\n:\n:A fourth year student in Chihaya University and Koyomi's best friend since high school. A pro-wrestling fan. Marked as a VERY dangerous driver by various people. She was a heroine in Memories Off 2nd.\n;\n:\n:A fourth year student in Chihaya University, and Shizuru's best friend since high school. Always refer herself as Beautiful University Student. Like Shizuru, she's a pro-wrestling fan as well. She was one of the heroines in the original Memories Off.\nMedia\nAnime\nYou that became a Memory ~Memories Off~ was adapted into the first half of an OVA series, titled as \"Memories Off 3.5: Omoide no Kanata e\". This OVA adapted Kanata's route in two episodes.\nMusic\nThe opening for all the versions of the game except the PSP port is Replay Machine by Nana Mizuki. The opening for the PSP port is Kimi no Kakera sung by Ayane. This song is also used as the opening for Memories Off: Sorekara.\nExternal links\n* [http://www.success-corp.co.jp/software/sl2000/memories_off/index.html SuperLite 2000's You that became a Memory ~Memories Off~ page]"
    }
  ]
}