{
  "content": [
    {
      "type": "text",
      "text": "# Omroep Zwart__disambig_1\n\n| launch_date =\n| replaced =\n| closed_date =\n| replaced_by =\n| former_names =\n| terr_serv_1 =\n| terr_chan_1 =\n| online_serv_1 =\n| online_chan_1 =\n| availability_note =\n| webcast =\n| child =\n| embed_header =\n| embedded =\n}}\nOmroep Zwart (, ), also known simply as Zwart (stylised in all caps), is a Dutch broadcasting association that is part of the Dutch public broadcasting system since 1 January 2022. The initiators are rapper Akwasi Ansah and film director Gianni Lieuw-A-Soe. The goal of the broadcaster is to create inclusive programs with new people, including those with different skin colors, preferences, origins, sexual orientations, backgrounds, or disabilities. The broadcaster collaborates with BNNVARA.\nProvisional recognition as an aspiring broadcaster\nOn 31 March 2021, it was announced that Zwart had reached the 50,000 members required to be eligible for admission to the NPO. In July 2021, this broadcaster received provisional recognition from minister Arie Slob. It was announced that Zwart will be able to broadcast on Dutch public television from 2022 and that it was provisionally recognized as an aspiring broadcaster. This recognition is valid until 2026. In November 2021, Zwart made an online marathon broadcast.\nProgrammes\nSince 2022, Zwart has been broadcasting programmes on the Dutch public broadcasting system. Initially, the broadcaster was allowed to air De nacht is Zwart ('The Night Is Black') on the public radio two nights a week, and has a regular segment on Giel Beelen's programme on NPO Radio 2. The first television programme, Podium Zwart on NPO 3, a late-night music and culture programme presented by  and , was aired on 27 May 2022. The premiere, on a Friday night, only attracted 23,000 viewers.\nTelevision programs\nSource:\n* Podium Zwart (2022, NPO 3)\n* Once Upon a Timeline (2022, NPO 3)\n* ''Idris Elba's Fight School (2022, NPO 3)\nDocumentaries\n* Een Gat in Mijn Hart (2022, NPO 2)\n* De Afhaalchinees (2023, NPO3)\nRadio programs\n* De Nacht Is Zwart (2022, NPO Radio 1)\n* De Nacht van Zwart (2022, NPO Radio 1)\n* Wat Anders (2022, NPO 3FM)\nPodcasts\n* Rouwrituelen'' (2022)\nPresenters\n* (2022–present)\n* Amber Roner (2022–present)\n* Ciana Mayam (2022–present)\n* Lara Lauwigi (2022–present)\n* Elif Kan (2022–present)\n*  (2022–present)\n*  (2022–present)\n* Vincent Reinders (2022–present)\n* Akwasi (2022–present)\n*  (2022–present)\nCriticism\n* Founder Akwasi faced criticism for his speech at a Black Lives Matter protest on the Dam Square in Amsterdam, in which he promised to kick Zwarte Piet characters in the face. During an interview with EO presenter Hans van der Steeg, he took the laptop of the editorial team and forced the recording of the conversation to be removed. Akwasi later apologized during an interview.\nReferences\nExternal links\n*\n* [https://omroepzwart.nl/ Official website]"
    }
  ]
}