{
  "content": [
    {
      "type": "text",
      "text": "# On being asked for a War Poem__disambig_1\n\nPhotograph of William Butler Yeats taken by Charles Beresford in 1911\n\"On being asked for a War Poem\" is a poem by William Butler Yeats written on 6 February 1915 in response to a request by Henry James that Yeats compose a political poem about World War I. Yeats changed the poem's title from \"To a friend who has asked me to sign his manifesto to the neutral nations\" to \"A Reason for Keeping Silent\" before sending it in a letter to James, which Yeats wrote at Coole Park on 20 August 1915. The poem was prefaced  with a note stating: \"It is the only thing I have written of the war or will write, so I hope it may not seem unfitting.\" The poem was first published in Edith Wharton's The Book of the Homeless in 1916 as \"A Reason for Keeping Silent\". When it was later reprinted in The Wild Swans at Coole, the title was changed to \"On being asked for a War Poem\".\nYeats and World War I\nWhen Henry James asked Yeats to submit a poem for publication in Wharton's collection which was intended to raise money for Belgium refugees, Yeats intended for the poem to state his political position on the \"European War\". The poem's original title, \"To a friend who has asked me to sign his manifesto to the neutral nations,\" appears, in the words of Jim Haughey, to have a \"toysome evasiveness\" regarding the politics surrounding the war. Peter McDonald suggests that the changes in the poem's title reflects Yeats's changing political positions from the beginning of the war until its end in 1919 when Yeats publishes The Wild Swans at Coole. Although there are minute variations in the wording of the version published in The Book of the Homeless and the one found in The Wild Swans at Coole, the poem's overall form remained the same even as the title changed. In the first two lines of the poem, Yeats states that it is better for a \"poet to keep his mouth shut\" than to enter into debates about wars and politics, feeling that a poet should speak only about traditional lyric subjects and leave the war to soldiers and politicians.\nTim Kendall, in The Oxford handbook of British and Irish war poetry, suggests that Yeats's alternatives to the subject of war stated in lines 5-6, are the more traditional subjects of poetry which the poet finds suitable material, yet Kendall sees the reversion of the subject back to Yeats's generic topics as \"self-unwriting\". The mention of the word \"silent\" in the title published in Wharton's collection, appears contrary to the construction of poetry or the poetic voice. In the poem \"Politics\", Yeats begins the poem where \"On being asked for a War Poem\" finishes with the opening lines:\nAlthough \"Politics\" describes a different political situation facing the world in the 1930s, Yeats again chooses not to focus on politics but the \"girl standing there.\"\nPoem text\nI think it better that in times like these\nA poet's mouth be silent, for in truth\nWe have no gift to set a statesman right;\nHe has had enough of meddling who can please\nA young girl in the indolence of her youth,\nOr an old man upon a winter’s night.\nReferences\nExternal links\n*"
    }
  ]
}