{
  "content": [
    {
      "type": "text",
      "text": "# Once Upon a Time (The Kingston Trio album)\n\n}}\nOnce Upon a Time is a live album by the American folk music group the Kingston Trio, recorded in 1966 and released in 1969 (see 1969 in music). It was originally released as a double-LP with a three-page booklet and reached number 163 on the Billboard Pop Albums chart. The lead-off single was \"One Too Many Mornings\" b/w \"Scotch and Soda\".\nHistory\nPrior to the release of Children of the Morning, the trio had decided to disband in one year after a tour and another album. Decca declined to release Once Upon a Time. It was offered to Capitol Records and they too passed. It wasn't until 1969 that it was eventually released on Tetragrammaton Records. By the time the album was released John Stewart had begun a solo career, Nick Reynolds was retired from the music business and Bob Shane had created a new group, The New Kingston Trio.\nReception\n}}\nAllmusic critic Bruce Eder praised the live album, citing individual songs, and writing \"Tetragrammaton folded in the early '70s, and the resulting double LP is one of the rarest in the Kingston Trio's output, which is sad -- the best of their concert recordings since those renowned live recordings of 1958, it captured the group ranging freely across its history and the folk landscape... If there is a flaw here... it is the result of a desire not to repeat too much material off of the group's earlier concert albums... In any case, the resulting 72-minute album runs circles around their last live album for Capitol (Back in Town), as well as most of their late Capitol work and a lot of their Decca sides, and it's worth tracking down.\"\nReissues\n*Once Upon a Time was reissued on CD in 2007 on RichKat Records through Collectors' Choice\n*Once Upon a Time was reissued on LP as On Stage on an unknown label.\n*Once Upon a Time was reissued on LP as 20 Greatest Hits on the Black Tulip label.\nTrack listing\nThe tracks \"Police Brutality\", \"A Day in Our Room\", \"Silicone Bust\" and \"Blind Date\" are comedy interludes by John Stewart.\nSide one\n# \"Hard Travelin'\" (Woody Guthrie) – 2:11\n# \"Early Mornin' Rain\" (Gordon Lightfoot) – 2:40\n# \"The M.T.A.\" (The Boston Subway) (Bess Lomax Hawes, Jacqueline Steiner) - 2:55\n# \"Tomorrow Is a Long Time\" (Bob Dylan) – 3:30\n# \"Rovin' Gambler/This Train\" (Samuel F. Omar) – 1:45\nSide two\n# \"Police Brutality\" (Stewart) – 0:49\n# \"One Too Many Mornings\" (Dylan) – 1:58\n# \"Colours\" (Donovan) – 3:16\n# \"A Day in Our Room\" (Stewart) – 0:39\n#\"Wimoweh\" (Paul Campbell, Solomon Linda) – 1:44\n#\"Tom Dooley\" (Alan Lomax, Frank Warner) – 2:50\n#\"Goodnight Irene\" (Lead Belly, Alan Lomax) – 2:36\nSide three\n# \"Hard, Ain't It Hard\" (Woody Guthrie) – 2:31\n# \"Get Away John\" (Dave Guard) – 2:25\n# \"The Ballad of the Shape of Things\" (Sheldon Harnick) – 3:41\n# \"Greenback Dollar\" (Hoyt Axton, Kennard Ramsey) – 3:22\n# \"Babe, You've Been on My Mind (Mama, You've Been on My Mind)\" (Bob Dylan) – 2:10\nSide four\n# \"The Tijuana Jail\" (Denny Thompson) – 2:10\n# \"Silicone Bust\" (John Stewart) – 1:12\n# \"I'm Going Home\" (Fred Geis) – 1:19\n# \"Where Have All the Flowers Gone?\" (Pete Seeger, Joe Hickerson) – 2:56\n# \"Scotch and Soda\" (Guard) – 1:57\n# \"Blind Date\" (John Stewart) – 2:05\n#\"Saints Go Marching In\" (Traditional) – 1:54\nPersonnel\n*Bob Shane – vocals, guitar, plectrum banjo\n*Nick Reynolds – vocals, tenor guitar, conga\n*John Stewart – vocals, banjo, guitar\n*Dean Reilly – bass\nProduction notes\n*Frank Werber – producer\n*Hank McGill – engineer\n*George Horn – re-mix engineer\n*Randy Steirling – assistant engineer\n*Jon Sagen – assistant engineer\n*George Yanok – assistant engineer\n*Joaquin Bandersnatch – liner notes\n*Fred Rubik – album design\n*Jon Echevarieta – art direction\n*Dennis Hodgson – photography\n*Don Jim – photography\n*Larry Korgan – cover design\nChart positions\n{| class=\"wikitable\"\n!Year\n!Chart\n!Position\n|-\n|1969\n|Billboard Pop Albums\n|163\n|-\n|}\nReferences\nExternal links\n*[http://www.lazyka.com/linernotes/trio_02(Rynolds,Shane,Stewart)/recrdngs/uponatim.htm Kingston Trio Liner Notes entry for Once Upon a Time, including the original liner notes and photos]"
    }
  ]
}