{
  "content": [
    {
      "type": "text",
      "text": "# One Sided War\n\n| recorded   =\n| venue      =\n| studio     =\n| genre      = Christian rock, Christian metal, hard rock\n| length     =\n| label      = Rat Pak\n| producer   = Michael Sweet\n| prev_title = Only to Rise\n| prev_year  = 2015\n| next_title = Unified\n| next_year  = 2017\n}}\nOne Sided War is the seventh studio album from the Christian musician and Stryper frontman Michael Sweet, who helmed the production on the album. The album released on August 26, 2016 by Rat Pak Records. This album charted at No. 77 on the Billboard 200 and it was awarded a five star rating by CCM Magazine.\nCritical reception\n| rev2 = Classic Rock Revisited\n| rev2score =\n| rev3 = Cryptic Rock\n| rev3score =\n| rev4 = Hardrock Haven\n| rev4score = 8.75/10\n| rev5 = Jesus Freak Hideout\n| rev5score =\n| rev6 = The National\n| rev6score =\n| rev7 = New Release Today\n| rev7score =\n| rev8 = Today's Christian Entertainment\n| rev8score =\n}}\nAt CCM Magazine, Andy Argyrakis rated the album a perfect five stars, stating that the release \"is most definitely his heaviest individual offering thus far\". At Jesus Freak Hideout, Bert Gangl rated the album three-point six stars out of five, saying that \"Sweet absolutely deserves credit for being one of the few artists from the '80s still convincingly practicing the classic metal idiom, which debatably places him head and shoulders above the lion's share of his hard-rocking contemporaries -- too many of whom have long since stopped writing material that equals, or betters, that of their heyday\".\nAt Hardrock Haven, John Kindred rated the album eight-point seven-five out of ten, writing \"It's brilliant\". Jay Heilman of Today's Christian Entertainment rated the album 4.8 out of five, saying it is a \"record any true rock rock fan will need to pick up\". At Classic Rock Revisited, the editor rated the album a B (buy it), stating \"Michael is a talented singer, guitarist and an interesting songwriter.  So much so, I am starting to believe his solo efforts are much more intense and unique than anything he ever did while in the black and yellow bee outfit.\"\nAlfie Vera Mella of Cryptic Rock rated the album four stars out of five, writing that \"Sweet's songwriting prowess stretches back to the humble beginnings of his band Stryper – most of the songs of which show Sweet and his comrades' penchant for the serious, edgy side of glam metal coupled with the cool playfulness of pop rock music. In Sweet's latest offering, this combination shines very well.\"\nCommercial performance\nFor the Billboard charting week of September 17, 2016, One Sided War was the No. 77 most sold album in the entirety of the United States via the Billboard 200, and it was the No. 1 most sold of the Christian Albums. Also, the album was the No. 4 most sold album of the Rock Albums, and it was the No. 1 most sold of the Hard Rock Albums. Lastly, the album was the No. 6 most sold of the Independent Albums.\nTrack listing\n|title13  = Not to Be Me\n}}\nPersonnel\n* Michael Sweet - vocals, guitar\n* Will Hunt - drums\n* John O'Boyle - bass\n* Joel Hoekstra  - guitar\n* Ethan Brosh - guitar\nGuest musicians\n* Moriah Formica - vocals on ''Can't Take This Life''\nChart performance\n{| class=\"wikitable sortable\"\n|-\n! Chart (2016)\n! Peakposition\n|-\n|-\n|-\n|-\n|-\n|}\nReferences"
    }
  ]
}