{
  "content": [
    {
      "type": "text",
      "text": "# One Battle After Another\n\n| producer       =\n| starring       =\n| cinematography = Michael Bauman\n| editing        = Andy Jurgensen\n| music          = Jonny Greenwood\n| production_companies =\n* Ghoulardi Film Company\n}}\n| distributor    = Warner Bros. Pictures\n| released       =\n| runtime        = 162 minutes\n| country        = United States\n| language       = English\n| budget         = $130–175million\n| gross          = $200.3 million\n}}\nOne Battle After Another is a 2025 American action thriller film co-produced, written and directed by Paul Thomas Anderson, inspired by the 1990 novel Vineland by Thomas Pynchon. It stars Leonardo DiCaprio, Sean Penn, Benicio del Toro, Regina Hall, Teyana Taylor, and Chase Infiniti, and follows an ex-revolutionary who is forced back into his former combative lifestyle when he and his daughter become pursued by a corrupt military officer.\nAnderson had wanted to adapt Pynchon's novel Vineland for years, and eventually incorporated several of his own stories into the book's narrative. Filming took place in California and was shot using VistaVision, making it one of the first films to use the format for principal photography since the 1960s. Budgeted between $130 million to $175 million, it is the most expensive film of Anderson's career.\nOne Battle After Another had its world premiere in Los Angeles on September 8, 2025, and was theatrically released in the United States by Warner Bros. Pictures on September 26. The film received critical acclaim for Anderson's screenplay and direction, themes, cinematography, editing, musical score, visuals, action sequences, and the main cast's performances.\nIt has grossed $200 million worldwide, becoming the highest-grossing film of Anderson's career.\nPlot\n\"Ghetto\" Pat Calhoun and Perfidia Beverly Hills are members of a far-left revolutionary group, the French75. While breaking out detained immigrants from Otay Mesa Detention Center, Perfidia sexually humiliates the commanding officer, Steven J. Lockjaw, who begins lusting after her. Pat and Perfidia become lovers as the French75 attacks politicians' offices, banks, and the power grid. When Lockjaw catches Perfidia planting a bomb, he releases her after she agrees to his demands to have sex with him at a motel.\nAfter Perfidia delivers a baby girl named Charlene, Pat unsuccessfully tries to persuade her to settle down with them. She abandons them to continue her revolutionary activities, but is captured after murdering a security guard during an armed bank robbery. Lockjaw arranges for her to avoid prison in exchange for the whereabouts of the key French75 members.\nPerfidia enters witness protection as Lockjaw hunts down her comrades and shoots many of them on sight, forcing the survivors to go on the run. Pat and Charlene assume the aliases Bob and Willa Ferguson, while Perfidia escapes Lockjaw's custody and flees to Mexico.\nSixteen years later, living off-the-grid in the sanctuary city of Baktan Cross, California, Bob has become a paranoid stoner. He is protective of Willa, now a free-spirited teenager who resents his drug habits and paranoia. Through his vehement anti-immigration efforts, Lockjaw has become a colonel and a prominent figure in the US security agencies.\nLockjaw is invited to join the Christmas Adventurers Club, a secret society of wealthy far-right white supremacists. He hunts for Willa to cover up his interracial relationship, which the club forbids. Lockjaw hires an indigenous bounty hunter, AvantiQ, who captures Bob's comrade Howard Sommerville, triggering a distress signal to the remaining French75.\nDisguised as an immigration and drug enforcement operation, Lockjaw dispatches his troops to Baktan Cross to find the duo. Deandra, a trusted member of the French75, rescues Willa before her school dance is raided. While high, Bob is contacted by the French75, who warn him about Lockjaw just before Lockjaw's men breach Bob's home.\nEscaping through a tunnel, Bob notifies the resistance network for help, but is unable to remember the password. Willa's karate teacher and community leader Sergio St.Carlos assists him while evacuating a stream of immigrants through a hidden passageway. Fleeing with Sergio's students across the rooftops, Bob falls and is apprehended. Deandra brings Willa to the Sisters of the Brave Beaver, a convent of revolutionary nuns, where she learns the truth about her mother's betrayal.\nThe Christmas Adventurers uncover evidence of Lockjaw's relationship with Perfidia, including claims that he fathered a child with her, and send member Tim Smith to eliminate him and Willa. Lockjaw tracks Willa down to the convent, where Deandra is arrested. While holding Willa hostage, he forcibly tests her DNA, confirming she is his biological daughter and thus disqualifying him from the Christmas Adventurers Club.\nSergio arranges for Bob to escape custody and drives him to the convent, throwing him from the car before being pulled over by police. Hot-wiring another car, Bob reaches the convent but fails to kill Lockjaw with Sergio's hunting rifle. Lockjaw hires Avanti to kill Willa, but after he refuses because of her age, he is instructed to deliver her to a far-right militia instead. Tim tracks Lockjaw down and shoots him in the face with a shotgun, causing him to crash his car, and leaves presuming him dead. Bob comes across the crash site while driving in search of Willa.\nAvanti delivers Willa to the militia, but after a change of heart, frees her and is killed gunning them down. She takes his car and pistol and drives off along the nearby desert highway in escape, only for Tim to begin tailing her, with Bob frantically trying to catch up. Willa eventually lures Tim into a crash by exploiting a blind summit. She shoots him dead when he fails to recite the revolutionary countersign. Bob arrives and finds Willa; disoriented by the lies she has discovered about her family history, Willa demands the countersign from Bob at gunpoint, but he convinces her to stand down. The two tearfully reunite and drive away. Lockjaw is revealed to have survived the attempt on his life.\nA severely scarred Lockjaw is seemingly welcomed into the Christmas Adventurers after claiming that he was \"reverse raped\" by Perfidia, but he is fatally gassed and cremated shortly afterwards. Returning home with Willa, Bob gives her a letter from Perfidia, where she apologizes for her actions and vows to reunite with the duo soon. A short time later, Bob gives his daughter his blessing as she departs for a protest in Oakland.\nCast\nProduction\nDevelopment\n]]\nAnderson had considered adapting Thomas Pynchon's novel Vineland (1990) for years, but struggled, believing his love for the novel would get in the way of his ability to fairly rework it. Instead, he set aside the idea of an adaptation, and wrote a series of separate stories. One Battle After Another emerged as a combination of those stories with some elements of Vineland, particularly the father-daughter dynamic.\nIn June 2023, Anderson's next film, rumored to star Leonardo DiCaprio, Regina Hall, Viggo Mortensen, and Joaquin Phoenix, found its home at Warner Bros. Pictures. In January 2024 DiCaprio and Hall were confirmed to star, with Sean Penn joining the cast. In February, Alana Haim, Wood Harris, Teyana Taylor, Shayna McHayle, and Chase Infiniti joined the cast. DiCaprio reportedly received his standard $20million fee for his involvement.\nFilming\nPrincipal photography began in California on January 22, 2024. The film, under the working title BC Project, filmed for eleven days across Humboldt County in Arcata, Cutten, Eureka, Kneeland and Trinidad. Local experts, including the Sisters of the Valley, on which the Sisters of the Brave Beaver in the film was based, were consulted. Anderson and his crew attended the prom at Eureka High School to make observations about music and fashion trends; students were cast as extras for a key scene. On February 3, production moved to Sacramento, with filming at the Sacramento County Administration Building and Sacramento County Courthouse. A homeless encampment was cleared to allow for filming, sparking controversy. The former Sacramento mansion of then governor Ronald Reagan served as exterior shots for the Christmas Adventurers' Club headquarters. On-location filming also took place in Anza-Borrego Desert State Park and Borrego Springs in May 2024, and El Paso, Texas, in June 2024. Other filming locations included La Purísima Mission, the Westgate Hotel, the city of San Diego and Otay Mesa near the Mexico–United States border.\nThe film was shot on 35 mm movie film using VistaVision cameras by Michael Bauman, marking his second collaboration with Anderson, following Licorice Pizza (2021). Between 75-80% of the film was shot on VistaVision.\nPost-production\nIn February 2024, Variety reported that the film had been greenlit with a $115million production budget. In August 2024, The Wall Street Journal reported the budget was \"more than $140million\", noting that Anderson's highest-grossing film, There Will Be Blood (2007), only made $76million, but that \"Warner executives say DiCaprio's box-office track record justifies the budget for Anderson\". That month, sources indicated the film had been titled The Battle of Baktan Cross as rumors circulated that it was loosely inspired by Pynchon's Vineland; Anderson previously adapted Pynchon's Inherent Vice (2009) into a feature film in 2014. By August 2025, Variety reported the film's final budget as $175million, while Warner Bros. said it cost $130million. The film is the most costly of Anderson's career. Deadline Hollywood reported that below the line, on-location shooting in California cost $101.6million, with a tax credit of $8.4 million.\nBeginning in January 2025, the film had multiple test screenings, which reinforced the rumored connection to Vineland. It marked the first time since Boogie Nights (1997) that Anderson agreed to audience testing; based on the feedback, he cut eight to ten minutes. The film's title was confirmed in March, with Warner Bros. debuting a teaser. One Battle After Another marks Anderson's sixth feature film collaboration with the composer Jonny Greenwood, and the sixth with Anderson and first assistant director and producer Adam Somner, who died in November 2024; the film is dedicated to Somner.\nMusic\nOne Battle After Another (soundtrack)}}\nThe score was composed by Radiohead guitarist Jonny Greenwood, recorded with the London Contemporary Orchestra and conductor Hugh Brunt. It was released by Nonesuch Records on September 26, 2025. The film also features two songs by Jon Brion, marking Anderson and Brion's first collaboration since Punch-Drunk Love (2002).\nRelease\nThe film was released on September 26, 2025, following previews from September 24. It is the first of Anderson's films to be released in IMAX. It was previously set to be released on August 8, 2025, but was moved for a potential awards season run. The film premiered at the TCL Chinese Theater in Los Angeles on September 8, 2025, and had a global tour beginning in London on September 16, in Mexico City on September 18, and ending in New York City on September 21. The film also screened at Fantastic Fest on September 23, 2025.\nOne Battle After Another was projected in the VistaVision format, with screenings at the Vista Theatre in Los Angeles, Regal Union Square 17 in New York, Coolidge Corner Theatre in Brookline, and Odeon Luxe Leicester Square in London. It was also released in other formats, including IMAX 70 mm, digital IMAX, Dolby Vision, standard 70 mm film, and 4DX.\nHome media\nOne Battle After Another was released on digital on November 14, 2025, and will be released on 4K and Blu-ray on January 20, 2026.\nReception\nBox office\n, One Battle After Another has grossed $70 million in the United States and Canada, and $130 million in other territories, for a worldwide total of $200 million. Due to the estimated $200 million spent producing and marketing the film, Variety estimated it would need to gross around $300 million worldwide in order to break-even. The publication also projected the film would lose Warner Bros around $100 million during its theatrical run, but noted the success of other 2025 films such as A Minecraft Movie and Sinners would offset the losses for the studio. However, Deadline reported that the breakeven point was closer to $200 million, and that it would return to 70MM IMAX theaters in December, meaning the film could still be a financial success.\nIn the United States and Canada, One Battle After Another opened in 3,634 theaters, the widest release for a film directed by Paul Thomas Anderson and his first film to debut in wide release. It made $8.8 million on its first day, including $3.1 million from Thursday previews. It earned $22 million over the weekend, topping the box office and handily marking the best weekend for a film directed by Anderson, topping the $4.9 million earned by There Will Be Blood in its fifth weekend in 2008. In its second weekend the film grossed $11 million (a drop of 50%), finishing second behind newcomer Taylor Swift: The Official Release Party of a Showgirl.\nCritical response\n| total_width       = 350\n}}\nAudiences polled by CinemaScore gave the film an average grade of \"A\" on its A+ to F scale, while those at PostTrak rated the film four-and-a-half out of five stars, with 74% of audiences saying they would \"definitely recommend\" it.\nBrian Tallerico of RogerEbert.com wrote that One Battle After Another \"is a timeless story of resistance, one that playfully weaves together influences as broad-reaching as the true story of Weather Underground and cinematic depictions of rebellion, but it's also a remarkably propulsive, fun, and eventually moving piece of work about the human beings caught up in the chaotic machine\". Justin Chang of The New Yorker called the film \"a father-daughter epic, with an unusually personal gush of feeling. You can count on one hand the number of scenes that Bob and Willa share, but their connection—a swirl of protectiveness, exasperation, and fiercely unconditional love—binds the movie and its madly whirling parts together.\" Katie Walsh of the Chicago Tribune called the film a \"searing indictment of this particular moment in American history\" by which \"Anderson balances the sprawling, conspiracy-minded aspects of this yarn with the intimate father-daughter story, which is the heart of the matter\".\nWriting for The New York Times, Manohla Dargis called the film \"a carnivalesque epic about good and evil, violence and power, inalienable rights and the fight against injustice; it's also a love story. The film speaks to the failures of the past and of the present but insists on the promise of the future.\" Richard Lawson of The Hollywood Reporter stated One Battle After Another is \"a furious film, a richly engaging and persuasive polemic\" in which \"Anderson shows a previously unseen aptitude for action and suspense; One Battle After Another is, essentially, a thriller, albeit one teeming with enormous ideas about the collapse and possible rescue of the country\". Alex Saveliev of Film Threat opened his review by writing that the film \"demands to be seen on the largest screen possible to fully absorb the 35mm VistaVision experience with every cell of your body. Everything about it is grand: its characters, its action sequences, its timely sentiments, even the quieter moments.\"\nPeter Bradshaw, writing in The Guardian, was effusive in his praise of the film. He celebrated the \"riff on the now recognisable Anderson-Pynchonian idea of counterculture and counter-revolution\", praised the score by Jonny Greenwood, and pondered if the \"central paternity crisis triangle [is] an image for an ownership dispute around the American melting-pot dream?\" Bradshaw awarded the film five stars. Actress Jennifer Lawrence was widely cited calling One Battle After Another \"the best movie I have ever seen!\"\nThe performances of the cast were highly praised. Owen Gleiberman of Variety wrote \"Anderson knows that the quality that liberates DiCaprio is comedy. By having him play Bob as a dissolute stoner addict, discombobulated by his loss of faith, he humanizes DiCaprio and coaxes a great performance out of him.\" Tallerico of RogerEbert.com felt DiCaprio gives a \"carefully modulated\" performance, but he nevertheless singled out Sean Penn's performance as \"his best work in years\", stating he \"flexes his muscles, grits his teeth, and growls his lines, but somehow threads the needle between truth and caricature\". David Sims of The Atlantic opined: \"Penn, giving a brilliant performance of cold villainy that could win him a third Oscar, is unafraid of lancing the inherent goofiness of a fascist. DiCaprio plays Bob as a sweetheart rather than a buffoon; he's a tired, strung-out antihero made weary not by his yearslong efforts to fight back but by the relentlessness of the world.\" David Ehrlich of IndieWire praised \"magnetically self-possessed newcomer/instant movie star Chase Infiniti, whose performance inspires a strange kind of secondhand pride\". He also singled out the performances of Taylor and Penn, calling the former \"eruptive (...) steaming with revolutionary zeal\" and the latter \"career-best\".\nWilliam Bibbiani of TheWrap was less enthusiastic, describing the plot as scattershot, unfocused, overly long, and the film's themes as shallow, writing: \"[Anderson] is more interested in taking cheap potshots at the film's real-world analogues than actually exploring them.\" Kyle Smith of The Wall Street Journal similarly noted the film is \"big and brash. Rangy in tone, style and theme, it has so much going on that a single viewing hardly seems sufficient to absorb it all. Whether it's a masterpiece or a hodgepodge will be a matter of some discussion; the reach is evident but the grasp is a little shaky.\" Right-wing commentators have criticized One Battle After Another for its sympathetic portrayal of antifascist revolutionaries, especially in the wake of the assassination of Charlie Kirk and the 2025 Dallas ICE facility shooting, both of which happened after production on the film was completed.\nAccolades\n{| class=\"wikitable sortable plainrowheaders\" style=\"border:none; margin:0;\"\n! scope=\"col\"| Award\n! scope=\"col\"| Date of ceremony\n! scope=\"col\"| Category\n! scope=\"col\"| Recipient(s)\n! Result\n! class=\"unsortable\" scope=\"col\"|\n|-\n! scope=\"row\" rowspan=\"8\"| AARP Movies for Grownups Awards\n| rowspan=\"8\"| January 10, 2026\n| Best Picture\n| One Battle After Another\n|\n| align=\"center\" rowspan=\"8\"|\n|-\n| Best Director\n| Paul Thomas Anderson\n|\n|-\n| Best Actor\n| Leonardo DiCaprio\n|\n|-\n| rowspan=\"2\"| Best Supporting Actor\n| Benicio del Toro\n|\n|-\n| Sean Penn\n|\n|-\n| Best Supporting Actress\n| Regina Hall\n|\n|-\n| Best Screenwriter\n| Paul Thomas Anderson\n|\n|-\n| Best Ensemble\n|\n|\n|-\n! scope=\"row\" rowspan=\"7\"| Astra Creative Arts Awards\n| rowspan=\"7\"| December 11, 2025\n| Best Casting\n| Cassandra Kulukundis\n|\n| align=\"center\" rowspan=\"7\"|\n|-\n| Best Cinematography\n| Michael Bauman\n|\n|-\n| Best Film Editing\n| Andy Jurgensen\n|\n|-\n| Best Original Score\n| Jonny Greenwood\n|\n|-\n| Best Sound\n| José Antonio García, Christopher Scarabosio, and Tony Villaflor\n|\n|-\n| Best Stunts\n|\n|\n|-\n| Best Second Unit Director\n| Adam Somner\n|\n|-\n! scope=\"row\"| Celebration of Cinema and Television\n| December 9, 2025\n| Ensemble Award\n| Regina Hall, Teyana Taylor, and Chase Infiniti\n|\n| align=\"center\"|\n|-\n! scope=\"row\"| Golden Trailer Awards\n| May 29, 2025\n| Best Original Score\n| 'Rise & Shine', Warner Bros., Major Major\n|\n| align=\"center\"|\n|-\n! scope=\"row\" rowspan=\"6\"| Gotham Film Awards\n| rowspan=\"6\"| December 1, 2025\n| Best Feature\n| Paul Thomas Anderson, Sara Murphy, and Adam Somner\n|\n| align=\"center\" rowspan=\"6\"|\n|-\n| Best Director\n| rowspan=\"2\"| Paul Thomas Anderson\n|\n|-\n| Best Adapted Screenplay\n|\n|-\n| rowspan=\"2\"| Outstanding Supporting Performance\n| Benicio del Toro\n|\n|-\n| Teyana Taylor\n|\n|-\n| Breakthrough Performer\n| Chase Infiniti\n|\n|-\n! scope=\"row\"| Hollywood Music in Media Awards\n| November 19, 2025\n| Score – Feature Film\n| Jonny Greenwood\n|\n| align=\"center\"|\n|-\n! scope=\"row\"| IndieWire Honors\n| December 4, 2025\n| Breakthrough Award\n| Chase Infiniti\n|\n| align=\"center\"|\n|-\n! scope=\"row\"| Palm Springs International Film Festival\n| January 3, 2026\n| Desert Palm Achievement Award\n| Leonardo DiCaprio\n|\n| align=\"center\"|\n|-\n! rowspan=\"2\" scope=\"row\"| Santa Barbara International Film Festival\n| rowspan=\"2\"| February 8, 2026\n| rowspan=\"2\"| Virtuoso Award\n| Chase Infiniti\n|\n| rowspan=\"2\" align=\"center\"|\n|-\n| Teyana Taylor\n|\n|-\n! rowspan=\"2\" scope=\"row\"| SCAD Savannah Film Festival\n| rowspan=\"2\"| October 26, 2025\n| Gold Derby Spotlight Award\n| Regina Hall\n|\n| align=\"center\"|\n|-\n| Outstanding Achievement in Casting Award\n| Cassandra Kulukundis\n|\n| align=\"center\"|\n|}\nSee also\n* \"The Revolution Will Not Be Televised\", a poem and Black Liberation song by Gil Scott-Heron whose lyrics are used by the revolutionaries in the film as a countersign.\n* The Battle of Algiers, a 1966 Italian-Algerian war film that the main character Bob Ferguson watches on TV.\n* List of media set in San Diego\nReferences\nExternal links\n*\n*"
    }
  ]
}