{
  "content": [
    {
      "type": "text",
      "text": "# Onward to Freedom__disambig_1\n\n}}\n| length     = 48:10\n| label      = Pathogenic\n| producer   = Josh Schroeder\n| prev_title = Antiseptic Bloodbath\n| prev_year  = 2012\n| next_title = Gazing at Medusa\n| next_year  = 2018\n}}\n}}\nOnward to Freedom is a solo album by Tourniquet drummer Ted Kirkpatrick. Originally announced as a side project to be released as The Tourniquet Ark, Kirkpatrick made the decision to release it under the Tourniquet name with himself listed as the primary artist. This has led to confusion in the fan community, and the erroneous classification of the album as an actual Tourniquet release. This has been exacerbated by Kirkpatrick choosing to refer to it as part of the Tourniquet catalog instead of as a part of his solo catalog. The album features many musicians, such as Marty Friedman and Chris Poland of Megadeth, Mattie Montgomery of For Today and Michael Sweet of Stryper. The album was released on November 11, 2014, via Tourniquet's own label, Pathogenic Records.\nCritical reception\nDarcy Rumble writes \"Start to finish, Onward to Freedom is an excellent record. Compelling performances by a host of musicians bringing an important message  will certainly stir listeners and inspire action.  There is enough diversity among the songs that even upon repeated listens, OTF  does not grow old.\nTourniquet’s captivating Onward to Freedom is musically powerful, lyrically moving. A must-have for heavy music fans, and lovers of Creation.\" \"The best on this album comes early. Twelve songs, including three instrumentals and two public service announcement experiments. Leaving only seven actual Metal songs. Onward to Freedom is solid, classic American Made Heavy Metal with plenty of skills and an important, heartfelt message. Recommended.\" reports Chad R. Shultz. Peter John Willoughby says \"Ultimately it is up to the fans to decide whether they want another concept album full of animal welfare\" Tom Metcalf of Untombed writes \"What a great album! All the performances were solid and I don’t see myself becoming tired of it anytime soon. I tried to give a track by track explanation as to how each individual guest lend their set skill and I hope it helps! I hope that Tourniquet, the band, can get together to put out an entire CD with all the band members soon. For we the fans want it!!!!\"\nTrack listing\nPersonnel\n;Tourniquet\n* Luke Easter - vocals (on track 9)\n* Aaron Guerra - guitar (on track 7)\n* Ted Kirkpatrick - drums\n;Additional musicians\n* Michael Sweet (of Stryper) - vocals (on track 2)\n* Mattie Montgomery (of For Today, Besieged) - vocals (on tracks 2 and 3)\n* Marty Friedman (of Megadeth) - guitar (on track 9)\n* Nick Villars (of The Great American Beast) - vocals (on tracks 3, 5, 11)\n* Chris Poland (of Megadeth) - guitar (on track 3)\n* Doug Pinnick (of King's X) - vocals (on track 6)\n* Rex Carroll (of Whitecross, King James) - guitar (on track 5)\n* Bruce Franklin (of Trouble) - guitar (on track 6)\n* Tony Palacios (of Guardian) - guitar (on track 11)\n* Ed Asner - narration\n* Gabbie Rae - vocals (on tracks 5, 12)\n* Blake Suddath (of Your Memorial) - vocals (on track 11)\n* Ashleigh Argota - vocals (on track 12)\n* Kevin Young (of Disciple) - vocals (on track 7)\n;Production\n* Josh Schroeder - producer\n* Consuelo Parra - cover art\n* Rex Zachary - cover art\n* Rick Narcarte - cover art\nReferences"
    }
  ]
}