{
  "content": [
    {
      "type": "text",
      "text": "# Open-source intelligence in the Russian invasion of Ukraine\n\nThe role of open-source intelligence (OSINT) in response to the Russian invasion of Ukraine has attracted significant attention.\nBackground\nOpen-source intelligence (also known by its acronym OSINT) refers to the gathering and analysis of intelligence based on publicly available sources of information.\n2022 invasion\nIn the early hours of 24 February, just before the start of the invasion, OSINT researchers at the Middlebury Institute of International Studies at Monterey used Google Maps to track a significantly large traffic jam on a road in Russia leading to the Ukrainian border. Jeffrey Lewis subsequently tweeted \"someone’s on the move.\" An hour later, Russian troops began the invasion.\nNetherlands-based investigative journalism group Bellingcat has published interactive maps of destroyed civilian targets and has worked on authenticating potential documentation of war crimes. In July 2022, Bellingcat was banned as an undesirable organisation by the Russian government, with the Prosecutor-General of Russia saying that it posed \"a threat to the security of the Russian Federation.\"\nOryx gained international prominence through its work during the Russian invasion of Ukraine, counting and keeping track of material losses based on visual evidence and OSINT from social media. It has been regularly cited in major media, including Reuters, BBC News, The Guardian, The Economist, Newsweek, CNN, and CBS News. Forbes has called Oryx \"the most reliable source in the conflict so far\", calling its services \"outstanding\". Because it reports only visually confirmed losses, Oryx's tallies of equipment losses have formed absolute minimum baselines for loss estimates.\nThe Free Buryatia Foundation, which was founded in opposition to the invasion, has used open-source intelligence to try to track the number of Buryats killed in action in Ukraine. As of April 2022, the Foundation has estimated that around 2,8% of Russian casualties were Buryat, one of the highest death tolls among the Russian federal republics.\nThe HALO Trust, the world's largest mine clearance charity, has also conducted open source research into the conflict to understand the types of weapons used and the subsequent contamination across Ukraine, which requires clearance.\nOSINT groups have also used tools such as facial recognition apps to try to identify perpetrators of war crimes, such as the Bucha massacre.\nDebates\nThe sharing of open-source intelligence on social media has raised ethical concerns, including over the sharing of graphic images of bodies and of potentially military-sensitive data. Matthew Ford of the University of Sussex has noted that \"Ukrainians fear such images will reveal their tactics, techniques, and procedures,\" and that Ukrainians have therefore undertaken a degree of self-censorship. Concerns have also been raised about the potential dissemination of misinformation, such as through fake accounts posing as insider sources.\nSee also\n* 200rf.com\n* Conflict Intelligence Team\nReferences"
    }
  ]
}