{
  "content": [
    {
      "type": "text",
      "text": "# Operation Kingpin (World War II)\n\nOperation Kingpin was part of the run-up to Operation Torch, the planned Allied invasion of North Africa during World War II. It was a successor to Operation Flagpole, in which a secret meeting between U.S. General Mark W. Clark and diplomat Robert Murphy, representing the Allies, and General Charles E. Mast, the leader of a group of pro-Allied Vichy France officers in French North Africa, was arranged to secure their cooperation with the invasion. In Operation Kingpin, French General Henri Giraud, code-named \"Kingpin\", was released from confinement and brought to Gibraltar to meet with Operation Torch commander General Dwight D. Eisenhower and Clark in order to secure his cooperation with the invasion.\nBackground\n, the subject of Operation Kingpin]]\nGeneral Giraud was under house arrest by the Vichy government at Toulon in southern France for his anti-Nazi leanings. Giraud was already planning for the day when American troops landed in France. He had agreed to support an Allied landing in French North Africa, provided that only American troops were used, and that he or another French officer was the commander of the operation. He considered this latter condition essential to maintaining French sovereignty and authority over the Arab and Berber natives of North Africa.\nGiraud designated General Charles Mast as his representative in Algeria. At a secret meeting on October 23 with U.S. General Mark W. Clark and diplomat Robert Murphy, the result of Operation Flagpole, the invasion was agreed on, but the Americans promised only that Giraud would be in command \"as soon as possible\". Giraud, still in France, responded with a demand for a written commitment that he would be commander within 48 hours of the landing, and for landings in France as well as North Africa. Giraud also insisted that he could not leave France before November 20. However, Giraud was persuaded that he had to go earlier.\nThe Operation\nOn October 26, 1942, Captain Jerauld Wright of the United States Navy was directed to take part in the mission to extract Giraud, code-named Operation Kingpin. Because Giraud flatly refused to deal with the British, and there were no American submarines within , Winston Churchill devised a subterfuge to appease the French general. , under the command of Lieutenant Norman \"Bill\" Jewell, briefly became \"USS Seraph\", flying the U.S. Navy ensign. Nominally, the sub came under the command of Wright, although Jewell took care of actual operations. In the spirit of things the British crew affected American accents that they imitated from the movies. Of course, it fooled nobody—including Giraud, who had been told of the deception by Wright.\nAs Captain G. B. H. Fawkes of the Royal Navy, the commander of 8th Submarine Flotilla in the Mediterranean, noted:\nIt was, I think, unique in the history of the two nations that a United States Naval officer should be placed in nominal command of a British submarine thereby making her the only warship on active duty to be commanded by two captains.\nOn October 27, Seraph had been ordered to set sail to the coast of southern France for a secret rendezvous. Seraph was ordered to patrol up and down the coast until she received a signal giving her the name of the port from which she was to pick up her passengers. She arrived  at a location some  east of Toulon on October 30, and on November 5 the boat took onboard Giraud, his son, and three staff officers. Two days later, her charges were transferred to a PBY Catalina flying boat that was sent from Gibraltar to search for her after they lost contact with the sub due to a problem with her main radio. The Catalina proceeded to the Operation Torch headquarters on Gibraltar, where Giraud's meeting with Generals Eisenhower and Clark would take place.\nResults of the meeting\n, commander in chief of the Allied Armies in North Africa, and General Henri Giraud, commanding the French Forces, saluting the flags of both nations at Allied headquarters]]\nAt the meeting, Eisenhower asked Giraud to assume command of French troops in North Africa during Operation Torch and direct them to join the Allies. But Giraud had expected to command the whole operation – the job which had been given to Eisenhower – and adamantly refused to participate on any other basis. He said \"his honor would be tarnished\" and \"Giraud will be a spectator in this affair. However, by the next morning, Giraud relented. He refused to leave immediately for Algiers, but rather stayed in Gibraltar until November 9.\nPro-Allied elements in Algeria had agreed to support the Allied landings, and in fact seized Algiers on the night of November 7–8; the city was then occupied by Allied troops. However, resistance continued at Oran and Casablanca. Giraud flew to Algiers on November 9, but his attempt to assume command of French forces was rebuffed; his broadcast directing French troops to cease resistance and join the Allies was ignored.\nInstead, it appeared that Admiral François Darlan, who happened to be in Algiers, had real authority. Even Giraud realized this. Despite Darlan's Vichyite reputation, the Allies recognized him as head of French forces, and he ordered the French to cease fire and join the Allies on November 10.\nOn November 11, German forces occupied southern France. Negotiations continued in Algiers; by November 13, Darlan was recognized as high commissioner of French North and West Africa, while Giraud was appointed commander of all French forces under Darlan. All this took place without reference to the Free French organization of General Charles De Gaulle, which had claimed to be the legitimate government of France in exile.\nThen on December 24, Darlan was assassinated under mysterious circumstances. With the strong backing of the Allies, especially Eisenhower, Giraud was elected to succeed him.\nAftermath of Operation Kingpin\nCaptain Jerauld Wright was awarded his first Legion of Merit in recognition of his participation in Operation Kingpin. The citation read, in part: \"For meritorious service of a high degree in connection with a mission by submarine to Algeria, and negotiations with the French near that city prior to the occupation of North Africa by Allied Forces.  In this duty he displayed good judgment, tact, and soldiery qualities that reflect great credit to the United States Navy.\"\nReferences\nFootnotes\nBibliography\n* Churchill, W. The Second World War: v3: The Hinge of Fate (1951)\n* Murphy, R. Diplomat Among Warriors, New York: Doubleday, 1964."
    }
  ]
}