{
  "content": [
    {
      "type": "text",
      "text": "# Operation Warzone\n\n|country=United States\n|language=English\n|runtime=86 minutes\n}}\nOperation Warzone is a 1988 American Vietnam War film.\nPlot summary\nDuring the Vietnam War, three U.S. Army soldiers, Sgt. Holt, Butler and Adams, survive a Viet Cong ambush and rescue two undercover American agents, named Hawkins and Jensen, whom are seeking out a mysterious Intelligence agent, known only as 'the General' who has classified documents detailing an illegal arms deal between a corrupt general, named Delevane based in the Pentagon, whom is involved in an arms-for-profit deal with a corrupt U.S. Army officer back in Vietnam, named Colonel Harker, who sends troops, led by Corporal Stringer, to look for 'the General'. During this, Hawkins tells Holt that there will be an arms shipment to be made very soon which will go to the North Vietnamese for huge profit which will prolong the war for the military back home.\nHawkins and Holt are captured by another group of soldiers, led by a shady Australian named Lt. Smitty, who tries to find out which one of them is the General. Hawkins and Holt are later rescued by Stringer and his soldiers where after asking a coded number question, Hawkins is revealed to be the General. They are taken to Colonel Harker, whom asks for the documents of the arms shipment, and then orders Stringer to execute both of them. But Stringer is revealed to be a turncoat who is working with Butler, also an undercover agent, who wants to help stop the arms deal from happening which leads to Holt, Butler, Hawkins, Stringer, Smitty, Adams and Jensen to team up to launch an climatic attack against Harker's camp. During the battle, Smitty and all of Harker's men are killed, but Hawkins is fatally wounded by Harker before he is killed. However, before he dies, Hawkins gives Holt the location and code word to the location of the arms shipment and urges the squad to acquire and use it to win the war for the U.S. Army. The film ends with a news report about a major American military offensive into North Vietnam related to the arms shipment, and the distraught Delevane commits suicide before he is to be questioned about his involvement in the deal.\nCast\n* Joe Spinell as Brigadier General George Delevane\n* Fritz Matthews as Sergeant Holt\n* William Zipp as Corporal Butler\n* John Cianetti as Specialist Sergeant Hawkins\n* David Marriott as Lieutenant Smitty\n* Sean Holton as Corporal Adams\n* Sonny King as Specialist Jenson\n* Chet Hood as Corporal Stringer\n* David Roger Harris as Colonel Harker\nReferences\nExternal links\n*\n*OperationWarZone on [https://www.znaud.com website]\n*"
    }
  ]
}