{
  "content": [
    {
      "type": "text",
      "text": "# Operation Together Forward\n\n,  – 24 October 2006\n| place             = Baghdad, Iraq\n| result            = Insurgent victory\n*Continued sectarian violence\n*Coalition Troop Surge in Baghdad\n| combatant1        =  United States Army  British Army    New Iraqi Army\n| combatant2        =  Mujahideen Shura Council\n*22px Al-Qaeda in Iraq\n----\nal-Mahdi Army\n| commander1        =  Gen. George Casey LtGen. Robert Fry\n| commander2        = 22px Ayyub al-Masri\n----\nMuqtada al-Sadr\n| strength1         = 61,000– 75,000\n| strength2         = Unknown\n| casualties1       =  101 killed, 1 captured 13 killed 197 killed\n| casualties2       = At least 411 individuals associated with death squads killed or captured. Heavy insurgent casualties (At least several hundred killed)\n}}\nOperation Together Forward, also known as Forward Together (), was an unsuccessful offensive against sectarian militias in Baghdad to significantly reduce the violence in which had seen a sharp uprise since the mid-February 2006 bombing of the Askariya Mosque, a major Shiite Muslim shrine, in Samarra.\nThe plan was announced on 14 June 2006 by the then-recently installed Prime Minister Nuri al-Maliki, and intended to increase security conditions in Baghdad through instituting major new measures. Operation Together Forward was planned as an operation to be led primarily by Iraqis but with Coalition support and would put about 70,000 security forces on the streets of Baghdad.\nThe major provisions of the operation included a curfew from 9pm to 6am, increased checkpoints and patrols, and further restrictions on carrying weapons. Additionally, Iraqi and Coalition troops would raid terrorist cells and attempt to disrupt insurgent activities through active missions against suspected insurgent locations.\nHowever, although highly touted at the time of its introduction, the plan failed to increase security in the capital as the high level of violence continued with a spate of major bombings (at least four such attacks with 40+ deaths each occurred in a one-week period) and sectarian killings throughout June and July.\nBackground\nSoon after taking up his command, General Chiarelli began ordering operations in Iraq designed to increase security as the new Iraqi government was forming in the face of a civil war. In March 2006, Operation Scales of Justice took place in Baghdad which significantly increased the number of security forces in the city and captured some 800 suspected insurgents in its first two months, but it did not reduce the overall violence.\nFor many months, senior British officers had been urging General Casey to make Baghdad the focus of his operations. It seemed to many intelligence analysts that that was AQI's intention, a document seized in a raid near Yusifiyah by Task Force Knight revealed the terrorists determination to make the attacks on Baghdad a central role in its plans to undermine the new Iraqi government. For this and other political reasons, the Security Plan was described by the Pentagon as \"Iraqi-led:\" more than three-quarters of the 61,000 to 75,000 security forces involved in the operation were Iraqi, but the aims of the operation were planned by the US-they wanted to clear neighbourhoods (with particular focus on the East Rasheed neighbourhood) of insurgents one by one before turning them over to Iraqi forces.\nTimeline\nViolence increased in July, tensions were high between Shia and Sunni following the 2006 al-Askari mosque bombing but then on 8 July 2006 a suicide bomber entered a Shia mosque in Baghdad and blew himself up, killing 8 worshippers-effectively bringing the Sectarian war to Baghdad. On the morning of 9 July, masked Mahdi Army militants gathered in groups in Baghdad's Hay al Jihad neighborhood and setup their own checkpoints asking drivers and passers by for identification. Any Sunni males among them were taken to a bus where more gunman were waiting, the bus drove to a waste ground where the captives were all murdered. By the end of the day, 36 bodies were brought into local hospitals, though the death toll maybe higher than 50; Sunni bombers carried out a double car-bomb attack on a Shia mosque in northern Baghdad, killing 19 and wounding 59. The violence on 9 July marked of 5 days of multiple suicide bombings and Shia retaliation that claimed more than 150 lives in the city.\nOperation Together Forward began on 9 July 2006, the operation consisted of clearance: operations (that were wearily familiar to the city's inhabitance) buildings were searched and weapons were seized, local troops were then meant to hold the area. Within weeks of the operation getting underway, it was obvious that it was not working-US commanders accused the Iraqi security forces of failing to provide two promised brigades, where Iraqi units did appear (particularly those from the Ministry of the Interior) they were often blamed for making situations worse. Stories abounded of Iraqi police acting like the acting like the Mahdi Army by using their freedom of movement to enter Sunni areas on murder missions. MND-B soldiers and Iraqi security forces executed continuous raids targeting known terrorist cells and cell leaders; they conducted some 32,000 combat patrols and killed or captured over 400 insurgents and seized numerous weapons and ammunition cashes.\nOn 24 July 2006, it was announced that Prime Minister Maliki was heading to Washington, D.C. for talks about the security situation with President George W. Bush.  The White House also publicly admitted for the first time that the Operation had been a failure, and that a new security strategy for Baghdad would be designed.\nCoalition commanders in the Green Zone discussed with White House about finding a new way to deal with the worsening situation. Casey stuck to his strategy of turning over the operation to the Iraqis, whilst senior officers and Washington policymakers were using the failure of the operation to open a debate about what needed to be done and whether Casey was the correct commander. Casey and Lieutenant General Robert Fry, the SBMR-I (Senior British Military Representative-Iraq) in Baghdad, agreed that the British forces team in Baghdad (particularly the intelligence section) would spearhead the F-SEC (Force Strategic Engagement Cell)- a new effort (made up of US military intelligence counterparts, CIA and MI6 personnel) to turn the Sunni community against the jihadists. The domestic policy in the UK made it impossible for British forces in Iraq to reverse its planned withdrawal and reinforce the Coalition in Baghdad, so Fry reversed his idea that Task Force Knight should move to an \"operational overwatch\" role and made them an important contributor to the operation.\nBy late July, hundreds of thousands of Baghdadis had fled to Jordan or Syria; US senior officers, concluding that the operation had failed were putting into action plans to launch a new security drive for the capital using a higher proportion of US troops. But given the dire nature of the national security situation and the apparent desire by top commanders at the Pentagon not to deploy more troops to an increasingly unpopular war.\nOn 1 August 2006, 70 Iraqis (including 20 soldiers) were killed in Baghdad violence and bombings.\nOn 7 August, MND-B soldiers and Iraqi security forces began phase II of the operation, which was designed to further increase security and reduce violence in and around Baghdad and give Iraqi forces the chance to operate with more autonomy than previous operations in the area. The Iraqis sent 6,000 more troops to the capital to support phase II as well as 3,700 troops mainly from the 172nd Infantry Brigade, however only two of the planned six Iraqi battalions showed up. This insufficiency in the Iraqi forces was seen as a reason for the operations lack of overall success. The Coalition was able to clear certain areas of insurgents, but they were not able to keep the insurgents and terrorists from infiltrating back into the cleared areas. The violence increased in August, US and Iraqi forces cleared 4,000 houses in the Dora and Risala neighbourhoods, however there was still more than a million houses and dwellings in the search areas, which made the operation furtherly unsustainable. In addition, the insurgents were usually tipped off by complicit members Iraqi security forces and would flee the area, therefore there was no strategic result in the operation.\nA second major operation, Operation Together Forward II began in August, following the same tactics as its predecessor, however the operation focused too much on the pace of the clearing operations and not on the building up of essential infrastructure to better support the needs of the local population. As a result, the level of violence jumped to 43% between summer and October 2006.\nBy 1 October 2006, Dora was completely cleared for the second time in less than two months, but with the same negligible results as in the previous operation-again the insurgents had been tipped off and fled the area.\nAlso in October, Gen. William Caldwell said: \"Operation Together Forward has made a difference in the focus areas but has not met our overall expectations of sustaining a reduction in the levels of violence.\"\nBaghdad attacks were said to have escalated by 22% over the beginning of the operation.\nDuring the operation the number of sectarian killings throughout the capital were at an all-time high. Each month during the operation between 1,300 and 2,000 civilians were killed. Attacks on American units in the city were happening each day. Members of the al-Mahdi Army conducted sniper attacks on American foot patrols, while Sunni insurgents attacked American convoys with roadside bombs. Some 81 American soldiers were killed during the operation in fighting in the capital along with almost 200 members of the Iraqi Army and the Iraqi police. Also 20 American soldiers were killed in the fighting in the town of Taji, just 20 kilometers north of Baghdad. One American soldier was captured in Baghdad a day before the operation ended. An unknown number of Iraqi insurgents were killed or captured but it was probably several hundred. The U.N. reported that 14,000 civilians were killed in the whole of Iraq during the battle.\nOn 23 October the White House announced that it would be reviewing its overall Iraq security strategy as the unrelenting violence the country continued and the U.S. military death toll for October became the highest of 2006. The operation ended the next day.\nOn 23 November a massive, coordinated car bomb and mortar attack in the Sadr City section of Baghdad killed 215 people and wounded a further 250.\nOn 12 December, a suicide car bomber targeting laborers killed 60 people in Baghdad and wounded 220 others. The truck driver signaled to the would-be workers that he had jobs—prompting people to crowd around the pickup before he detonated his bomb.  This scenario has been used dozens of times in Iraq to inflict maximum casualties, yet Iraqis continue to look for work in this manner - despite the obvious risk - due to the poor economic situation in the country.\nThe Iraq Study Group, in its December 2006 report cited Operation Together Forward II (i.e. the second phase of the Operation), writing:\nOn 22 January 2007, a suicide car bomber crashed into a market in the central neighborhood of Bab al-Sharqi, killing 88 people.  This attack highlighted the complete inability of the United States or the Iraqi government to stop large-scale bombings in Baghdad more than six months after Operation Together Forward was announced.\nOperation Fardh al-Qanoon\nIn February 2007, a new security operation was launched throughout Baghdad. The city was divided into 9 security zones which were cleared by US and Iraqi forces. Joint Security Stations were established following the securing of each sector to enable reconstruction work to begin in safety. As a result of this operation, made possible following a \"surge\" in US troop levels, large portions of the city came under Coalition control.\nSee also\n* Iraq War\n* Iraqi insurgency\n* Operation Sinbad\n* Operation Law and Order\nReferences\nExternal links\n* [http://www.centcom.mil/sites/uscentcom1/Lists/Press%20Releases/DispForm.aspx?ID=3213 Central Command press release]\n* [http://www.centcom.mil/sites/uscentcom1/Lists/Press%20Releases/DispForm.aspx?ID=3582 Central Command press release announcing Operation Together Forward, phase II]\n* [http://www.cnn.com/2006/WORLD/meast/10/19/baghdad.operation/index.html CNN: Baghdad violence forces U.S. to re-evaluate strategy]"
    }
  ]
}