{
  "content": [
    {
      "type": "text",
      "text": "# Operation Hornbill (World War Two)\n\nOperation Hornbill was a proposed commando operation by Australian forces during World War II. The operation was proposed by Ivan Lyon following the success of Operation Jaywick.\nA precursor to Operation Rimau, it was an ambitious plan by Ivan Lyon to sabotage Japanese military operations in the Pacific by using so called Snake Boats; a craft made to look like an Asian junk, which were to be built in Melbourne, Australia. A number of folboats and fifteen one-man submersible canoes, called ‘Sleeping Beauties’ (SBs) were to be deployed from the junks. The operation was to be formed and launched from the Allies’ strategic area of the Nautilus islands.\nAddendum to the above. ‘Sleeping Beauties’ were the adopted codename, they were Motor Submersible Canoes (MSC's) electrically propelled but could be sailed or paddled.\nWhilst the SBs were to be British, they planned to use folboats (Folding kayak)s built in Melbourne, Australia, as Lyon's 2IC, Lieutenant Donald Davidson RNVR, RANVR, was not happy with the British folboats brought over and used for Operation Jaywick. They had a lot of trouble simply putting them together, then Lyon's was damaged beyond proper repair when he collided with Davidson's during a try-out. As the Melbourne Hoehn design MKIII folboat became very well regarded for performance by Australian Commandos and proved to be very reliable in various sea and river operations, they were chosen and used for Operation Rimau (Rimau was formerly known as 'The Second Singapore Raid' before official secrecy was lifted).\nWith the preparation for Hornbill and future Australian based raids, three other small portable craft designs were submitted to the army, namely by Slazengers, Webb and Barr, but all were rejected mainly for poor seaworthiness and lack of manoeuvrability. Serviceman Sapper Webb's 'collapsible canoe', of which 20 were built by Hedleys Folboat section for army testing, were found to be extremely unstable in any but flat water and also infringed Hoehn's patent.\n‘Special Operations Executive’ (SOE), the British clandestine warfare agency, was behind Ivan Lyon's scheme, but because of the shortage of required submarines to help reconnoiter and deploy the small craft, and the growing complexity of the plan, the project was eventually shelved.\nReferences\n*Thompson, Peter and Macklin, Robert. (2002). Kill the Tiger: The Truth About Operation Rimau. Hodder.\n*Hoehn, John (2011) \"Commando Kayak\": The role of the Folboat in the Pacific War. Hirsch, hirschbooks.net or ozatwar.com/hoehn."
    }
  ]
}