{
  "content": [
    {
      "type": "text",
      "text": "# Opposition to the Second Boer War__disambig_1\n\nOpposition to the Second Boer War occurred both within and outside of the British Empire. Among the British public, there was initially much support for the war, though it declined considerably as the conflict dragged on. Internationally, condemnation of the British role in the war came from many sources, predominately left-wing and anti-imperialist commentators. Inside Britain, influential anti-war groups, especially those consisting of members of the opposition Liberal Party, quickly formed. They campaigned ineffectually against British wartime policies, which were supported by the Conservative Party of Prime Minister Lord Salisbury.\nAfter the Boers switched to guerrilla warfare in 1900 and British forces adopted scorched earth policies, the intensity of rhetoric opposing the war escalated. However, at all times supporters of the war controlled the UK government and represented a majority of British public opinion. Outside the British Empire, the Boer cause won far more support, particularly from left-wing political circles. In 1900, Belgian anarchist Jean-Baptiste Sipido attempted to assassinate the Prince of Wales, accusing him of causing the slaughter of thousands of Boers. However, no foreign government chose to intervene in the conflict, which ended in 1902.\nUnited Kingdom\nAt the start of the war in 1899, Liberal Party groups mobilized committees to protest the war, including the South African Conciliation Committee and W. T. Stead's Stop the War Committee. A common theme among these groups was the argument that it was a capitalistic desire to gain access to the gold and diamond deposits in the Boer republics that motivated the Unionist government to declare war. Angered crowds often broke up such anti-war meetings, viewing them as unpatriotic. The British press was overwhelmingly in support of the Unionist government's decision to go to war, with only the Manchester Guardian and the Westminster Gazette outspoken in their opposition. With the press against them, British anti-war elements relied heavily on street corner distribution of their numerous pamphlets.  Nevertheless, large numbers of young men volunteered for the war, as many as 100,000 a month at the peak. Liberal Party members split, with many top leaders following Lord Rosebery in support of the war. Many nonconformists, the backbone of the Liberal Party, likewise supported the war.\nThe 1900 United Kingdom general election was known as the \"khaki election\", where the Unionist government rallied patriotic voters. It resulted in a victory for the Unionist government on the back of recent British victories against the Boers. However, public waned as it became apparent that the war would not be easy and moral unease developed following reports about scorched earth policies adopted by British forces, which included the internment of Boer non-combatants in concentration camps. Public and political opposition was expressed by repeated attacks on the British government's policies in South Africa by Liberal MP David Lloyd George.\nLloyd George made his name in opposition, as he alleged that Joseph Chamberlain, his brother, and his son had large personal financial investments in a number of munitions firms that were making heavy profits in the war.  The allegations of corruption and greed did not carry public opinion, so the anti-war elements switched to an emphasis on humanitarianism, with heart-rending depictions of the suffering of Boer civilians interned in the camps. Emily Hobhouse in June 1901 published a fifteen-page pamphlet reporting on the horrific state of the camps, and Lloyd George openly accused the government of \"a policy of extermination\" directed against the Boer population. In June, 1901, Liberal party leader Henry Campbell-Bannerman took up the assault and answered the rhetorical \"When is a war not a war?\" with \"When it is carried on by methods of barbarism in South Africa,\" referring to those same camps and the policies that created them. In 1910, when the Boers came to friendly relations with the British, they pointed to the \"barbarism\" comment by Campbell-Bannerman as a mark of British good faith.\nIn April 1900, Emily Hobhouse and her friend Catherine Courtney organised a women’s branch of the South African Conciliation Committee with a women’s protest meeting being held at Queen’s Hall, Langham Place, London, on 13 June 1900. The Women's Liberal Federation participated in the Second Boer War protest movement, then moved towards support for women’s suffrage. Opposition to the war in the British Empire was strongest among Irish Catholics. Many Irish nationalists sympathised with Boers, having a shared opposition to British imperialism. Though many Irishmen served in the British Armed Forces, a small number fought for the Boers instead. Irish miners working in the Transvaal when the war began formed the nucleus of two tiny Irish commandos.\nNeutral countries\nThe overwhelming public sentiment in neutral countries, especially the Netherlands, Russia, Germany, France, and the United States favoured the Boers. Many commentators in the Western world saw the Boers as a group of heroic, outnumbered and brave freedom fighters. That included the general public, the leading newspapers, and many public figures. There was some fear that Germany might involve itself beyond mere rhetoric, but Germany remained strictly neutral. 225 Imperial Russian Army officers took leave to go and fight for the Boers.\nDonal Lowry points out that support for the Boers during the war was strongest among anti-imperialists, including French-Canadian separatists in Quebec and Marxist intellectuals such as György Lukács and Karl Kautsky. Irish Catholics in the United States, Australia, Britain and Ireland supported the Boers, whose actions inspired future generations of Irish separatist and nationalist leaders, especially in the Irish Republican Army.\nIn Australia\nAs part of the empire, Australia joined in the war but also suffered doubts about it. Most such doubts followed the English radical critique of war and empire, but others followed a different strain relating to an early form of Australian nationalism. Notable among the nationalist critique were the anti-war cartoons in the Bulletin magazine, which thumped home a nativist message that participation in a war started by Jews, capitalists and imperialists would mean having to accept non-white migrants once peace came (Breaker Morant had contributed to The Bulletin).\nThe execution by British forces of two Australian lieutenants (Breaker Morant and Peter Handcock) of the Bushveldt Carbineers for war crimes in 1902 and the imprisonment of a third, George Witton, was initially uncontroversial, but after the war prompted a movement to release Witton, which fuelled anti-war radicalism. More than 80,000 signatures on petitions and intercession by a South African millionaire saw Witton released in 1904. Three years later he wrote his influential apologia Scapegoats of the Empire.\nCanada\nIn Canada, attitudes toward the conflict were rooted in ethnic and religious communities.  There was a three-way political conflict between Canadians of British descent, Irish descent, and French descent.  Many French-Canadians were hostile to the British Empire, and by 1915, were largely refusing to volunteer for military service in the Canadian Armed Forces during First World War.  Protestant Canadians, typically of British descent, were strong supporters of the Empire and the \"mother country\".  They sent thousands of volunteers to fight alongside British forces against the Boers, and in the process identified themselves even more strongly with the British Empire. Opposition to Canadian involvement in the war also came from some English immigrants such as the intellectual leader Goldwin Smith.  In Canada, the Irish Catholics were fighting the French-Canadians for control of the Catholic Church, so the Irish generally supported the pro-British position.\nAssassination attempt\nIn Belgium, the 15-year-old anarchist Jean-Baptiste Sipido, a young tinsmith's apprentice, attempted to assassinate the Prince of Wales then passing through Brussels. He accused the Prince of causing the slaughter of thousands during the Boer War. In the following trial the Belgian jury found Sipido not guilty, despite the facts of the case being clear, which the Leader of the British House of Commons called \"a grave and most unfortunate miscarriage of justice\".\nAftermath\nThe existence of anti-war sentiment contributed to the perceptions of British actions after the war. There was much public outrage in the UK and official Australian government opposition against the use of cheap Chinese labour, known as coolies, after the war by the governor of the new crown colonies, Lord Milner. Workers were often kept in appalling conditions, received only a small wage and were forbidden to socialise with the local population. Some believe the issue of Chinese coolie labour can be seen as the climax of public antipathy towards the war.\nHaving taken the country into a prolonged war, the electorate delivered a harsh verdict at the first general election after the war was over. Arthur Balfour, succeeding his uncle Lord Salisbury in 1903 immediately after the war, took over a Conservative party that had won two successive landslide majorities but led it to a landslide defeat in 1906.\nSee also\n*List of peace activists\n*List of anti-war organizations\nReferences\nFurther reading\n*  Van Hartesveldt, Fred R. The Boer War: Historiography and Annotated Bibliography (2000) [https://books.google.com/books?id=AzY28y1teF4C&pg=PP6 excerpt]\n* Wilson, Keith M., ed. The international impact of the Boer War (Routledge, 2014). [http://www.history.ac.uk/reviews/review/243 online review by Matthew Seligmann]\nGreat Britain\n* Auld, John W. \"The Liberal Pro-Boers.\" Journal of British Studies 14#2 (1975): 78–101.\n* Beaven, Brad. \"The Provincial Press, Civic Ceremony and the Citizen-Soldier During the Boer War, 1899–1902: A Study of Local Patriotism.\" The Journal of Imperial and Commonwealth History 37.2 (2009): 207–28.\n* Brown, Stewart J. \"'Echoes of Midlothian': Scottish Liberalism and the South African War, 1899-1902.\" Scottish Historical Review 71.191/192 (1992): 156–83.\n* Denness, Zoë. \"Women and warfare at the start of the twentieth century: the racialization of the ‘enemy’ during the South African War (1899–1902).\" Patterns of Prejudice 46#3-4 (2012): 255–76.\n* Halévy, Élie.  Imperialism and the Rise of Labour, 1895–1905 (1951) pp. 69–138.\n* Hinton, Guy. \"Newcastle and the Boer War: Regional Reactions to an Imperial War.\" Northern History 52.2 (2015): 272–94.\n* Johnson, Matthew. Militarism and the British Left, 1902–1914 (Palgrave Macmillan, 2013).\n* McFarland, E. W. \"‘Empire-Enlarging Genius’: Scottish Imperial Yeomanry Volunteers in the Boer War.\" War in history 13.3 (2006): 299–328.\n* McFarland, E. W. \"Commemoration of the South African War in Scotland, 1900–10.\" The Scottish Historical Review (2010): 194–223. [http://www.euppublishing.com/doi/abs/10.3366/shr.2010.0205?journalCode=shr abstract]\n* Miller, S.M.  \"In Support of the 'Imperial Mission'? Volunteering for the South African War, 1899–1902\" Journal of Military History 69#3(2005), 691–711.\n* Morgan, Kenneth O. \"The Boer War and the media (1899–1902).\" Twentieth Century British History 13.1 (2002): 1–16.\n* Pelling, H. British Labour and British Imperialism: Popular Politics and Society in Late Victorian Britain (1968).\n* Porter, Bernard. \"The Pro-Boers in Britain.\" in Peter Warwick, ed. The South African War: The Anglo-Boer War 1899–1902 (1980): 239–42.\n* Price, Richard. An Imperial War and the British Working Class (Toronto, 1972)\n* Readman, Paul. \"The Conservative Party, Patriotism, and British Politics: The Case of the General Election of 1900\" Journal of British Studies 40#1  (2001), 107–45;\n*George R. Witton, Scapegoats of the Empire, (1907) Angus & Robertson, 1982.\n* Wood-Lamont, Sally. [http://www.attackingthedevil.co.uk/worksabout/bairns.php Biography of W.T. Stead], W.T. Stead and his \"Books for the Bairns\", (Salvia Books, Edinburgh, 1987)\nDominions and United States\n* Anderson, Stuart. \"Racial Anglo-Saxonism and the American Response to the Boer War.\" Diplomatic History 2.3 (1978): 219–36.\n* Bassett, Jan. Guns and brooches: Australian army nursing from the Boer War to the Gulf War (Oxford UP, 1997).\n* Chaktsiris, Mary G. \"‘Our Boys With the Maple Leaf on Their Shoulders and Straps’: Masculinity, the Toronto Press, and the Outbreak of the South African War, 1899.\" War & Society 32#1 (2013): 3–25.\n* Connolly, C. N. \"Manufacturing ‘spontaneity’: The Australian offers of troops for the Boer War.\" Australian Historical Studies 18.70 (1978): 106–17.\n* Douma, Michael James. \"Ethnic Identities in a Transnational Context: The Dutch American Reaction to the Anglo-Boer War 1899–1902.\" South African Historical Journal 65.4 (2013): 481–503.\n*\n* Miller, Carman. \"Framing Canada's Great War: a case for including the Boer War.\" Journal of Transatlantic Studies 6#1 (2008): 3–21.\n* Miller, Carman. \"Loyalty, Patriotism and Resistance: Canada's Response to the Anglo-Boer War, 1899–1902.\" South African Historical Journal 41#1 (1999): 312–23.\n* Miller, Carman.  Painting the Map Red: Canada and the South African War, 1899–1902 (Montreal: Canadian War Museum & McGill-Queen's University Press, 1993).\n* Mulanax, Richard B. The Boer War in American politics and diplomacy (University Press of America, 1994).\n* Page, Robert J.D. \"Canada and the imperial idea in the Boer War years.\" Journal of Canadian Studies 5#1 (1970): 33+\n*  Penlington, Norman. Canada and Imperialism, 1896–1899 (Toronto, 1965).\n* Penny, Barbara R. \"Australia's Reactions to the Boer War – a Study in Colonial Imperialism.\" Journal of British Studies 7#1 (1967): 97–130.\n* Strauss, Charles T. \"God Save the Boer: Irish American Catholics and the South African War, 1899–1902.\" US Catholic Historian 26#4 (2008): 1–26.\n* Wallace, Robert L. The Australians at the Boer War (Australian War Memorial, 1976).\n* Wilcox, Craig. ''Australia's Boer War: The War in South Africa 1899–1902'' (Oxford UP, 2002)."
    }
  ]
}