{
  "content": [
    {
      "type": "text",
      "text": "# Opposition to the American Civil War__disambig_1\n\nOpposition to the American Civil War, which lasted from 1861 to 1865, was widespread. Although there had been many attempts at compromise prior to the outbreak of war, there were those who felt it could still be ended peacefully or did not believe it should have occurred in the first place. Opposition took the form of both those in the North who believed the South had the right to be independent and those in the South who wanted neither war nor a Union advance into the newly declared Confederate States of America.\nNorthern opposition\nThe main opposition came from Copperheads (also known as \"Peace Democrats\"), the most well-known of which were Southern sympathizers in the Midwest, but the movement included a large proportion of the Democrats in the North who opposed the war for a variety of reasons. Irish Catholics after 1862 opposed the war, and rioted in the New York Draft Riots of 1863. The Democratic Party was deeply split. In 1861, most Democrats supported the war, but with the growth of the Copperhead movement, the party increasingly split down the middle. It nominated George McClellana War Democrat, for President in 1864, but imposed on him an anti-war platform and a Copperhead running mate in George H. Pendleton. In terms of Congress, the opposition was nearly powerless—and indeed in most states. In Indiana and Illinois, pro-war governors circumvented anti-war legislatures elected in 1862. For 30 years after the war, the Democrats carried the burden of having opposed the martyred Lincoln, the salvation of the Union and the destruction of slavery.\nSlavery supporters\nHowever, Clement Vallandigham, Samuel S. Cox, Matthew Carpenter, and Fowler's grounds for opposing the war were contrary to Lincoln's desire to abolish slavery. Cox voiced his opinion on the matter by saying at a meeting in the House of Representatives, \"this Government is a Government of white men; that the men who made it never intended by anything they did, to place the black race on an equality with the white.\" Furthermore, this group of men strived for war against the  South, deeming it constitutional, but criticized Lincoln of \"waging a battle for the conquest and subjugation of the South\" in a cruel way by challenging the constitutional rights of individuals and states. They also criticized the Emancipation Proclamation, saying that it unconstitutionally changed the purpose of the war from the preservation of the Union to abolition of slavery. The opinions of Vallandigham, Cox, Carpenter, and Fowler further attacked [https://www.alabamagazette.com/story/2021/04/01/opinion/abraham-lincolns-reason-for-war/2126.html Lincoln]'s claimed reason for the war by saying that Lincoln secretly went to war over slavery, and that abolitionists working with Lincoln started the war. In a last resort, Vallandigham proposed that the war stop by simply having both the Union and Confederacy withdraw their troops, engage in peace talks, and restore social and economic order. He did not explain how this would be executed. Vallandigham seemed to side with the South. He attempted to work with Confederate agents in Canada to start a revolution in the northwestern states, which would establish a Confederacy and ally with the South to crush the Union and end the war. This attempt by Vallandigham was desperate and unsuccessful. It was not a major opposition movement.\nSeymour\nThomas H. Seymour and the other peace Democrats for the 1860 election attacked the war by getting elected into the legislature. These candidates dealt with a mighty blow to the peace movement because the attack on Fort Sumter required men at arms and money to aid the Union. Openly opposing the war at this time was dangerous, for it was a time of patriotism and loyalty. Seymour and other peace Democrats could show their opposition to the war by merely being silent while other legislators openly conveyed their loyalty to the Union. Seymour also expressed his opposition by declining an offer to serve on the Committee on Military Affairs in Congress. At the beginning of the war, the state of Connecticut was ready to fight more than ever as huge numbers of enlistees proudly marched to fight. However, opposition still existed under the radar of most people. During this time, \"the Times failed to hang out the Stars and Stripes, but apologized later for the 'oversight'.\"\nThe press reviled Seymour's refusal to serve, and some called it \"treasonable.\" Other opposition began to arise in various towns such as Ridgefield, Windsor, West Hartford, Goshen, and Avon, where peace flags were being flown. Sharing views from Vallandigham, Cox, and Fowler, Seymour openly expressed his view on the war as being an \"invasion\" of the South. Seymour also supported the Crittenden Compromise, which proposed a \"measure of its own for stopping unnatural hostilities.\" This attempt was a strong one, in that Seymour tried to end the war by using the legislature. Unfortunately, the compromise was not passed, and Seymour's strong attempt at making peace failed. This was a hard blow to Seymour, for it gave more ammunition to label him as disloyal to the Union. Subsequently, Republican newspapers condemned Seymour as a man whose career ended in a \"blaze of infamy.\"\nThe peace movement gained momentum during the First Battle of Bull Run. On July 24, 1861, thirty women in Danbury, Connecticut, marched with peace banners, accompanied by a brass band playing \"The Hickory Tree.\" The group replaced the Stars and Stripes with peace flags, stating that \"a war like the present one\" could never restore the Union. Newspapers such as the Danbury Farmer reported the event and encouraged other publications to do the same, aiming to spread the peace movement. Rallies were subsequently held in towns including Bloomfield, Kent, Stonington, Middletown, and Cornwall Bridge, centered around the display of peace flags. Democratic politicians such as Gallagher and Godsell made guest appearances at these rallies. The flags were white and featured emblems symbolizing \"peace and union,\" or \"peace and our country.\" These events were intended not only to foster resistance to the war but also to raise awareness of the movement to President Abraham Lincoln.\nThe peace movement was not met without violence and resistance. Peace meetings were disrupted by Unionists who opposed anti-war sentiment. Peace flags were torn down and replaced by the Stars and Stripes. In the case of newspapers, Unionist papers attempted to quell peace papers by saying rebel papers were going to die out. In other states such as New Hampshire and Massachusetts, newspapers were harassed and threatened. \"On August 20th, the Unionists of Haverhill tarred and feathered the editor of the Essex County Democrat.\" In 1861, a mob attacked the Farmer, which produced heavy anti-war articles and stories in newspapers. The Democratic Party was labeled as disloyal, treacherous, and rebellious to the Union as well as pro-Southern. Seymour was ridiculed in the Republican editorial, the Hartford Courant, as \"a man who defies the Government.\" In addition, the Republican party strived to counter Seymour by further ca encouragedpperhead, a Southern sympathizer, and a traitor to the Union. The term \"copperhead\" refers to the Democrats who opposed the policies of the Lincoln administration. A Republican newspaper reported that Seymour, if elected governor, would use the Connecticut militia to repel recruiting officers. The attacks on the peace movement struck both the press and figures that upheld the opposition to Lincoln's policies. This hostility to the peace movement is evidence of how strong the anti-war campaign became.\nDraft riots\nThe other form of opposition to the American Civil War was through rioting. This proved to be the most effective in creating a disturbance and getting attention from the government. The New York City draft riots of 1863 proved how far people would go to oppose the war, especially Lincoln's policies. The origins of the draft riots come from labor competition. In New York, jobs such as longshoremen, hod-carriers, brickmakers, whitewashers, coachmen, stablemen, porters, bootblacks, barbers, and waiters were mainly occupied by African Americans. However, the large emigration of Irish and German people to America caused a clash between these immigrants and African Americans. The Irish and Germans needed jobs, but they had to compete with African Americans for them. Politicians argued that if Lincoln was elected president and the Union won the war, a large exodus of African Americans would come to the North and would create a very difficult economic situation for the Irish and German immigrants. This campaign basis created large dissent to African Americans. Newspaper editors such as James Gordon Bennett of the Herald spoke out \"if Lincoln is elected to-day, you will have to compete with the labor of four million emancipated Negroes....the north will be flooded with free Negroes, and the labor of the white man will be depreciated and degraded.\" This was the premise for many opposing the draft. If the immigrants and white men were drafted into the army, they felt their jobs would be open to African Americans, who would take those jobs. Several riots broke out before the draft was brought to New York City and created tension amongst African Americans, the police, and the resistance mobs. The riots reinforced hatred toward African Americans and to the state.\nOn the morning of July 13, 1863, the draft riots commenced. Hundreds of employees failed to report to their jobs and instead rallied at Central Park. There, the crowd of protestors split up and marched to the Ninth District Provost Marshal's Office. There, the draft lottery would be held. On the way, the crowd cut down telegraph poles, uprooted railroad tracks, and looted stores for weapons. The mob burned the draft office and marched to the Republican newspaper offices to protest there, whereas some crowds marched to the Democratic newspaper offices and cheered. Later on in the day, draft officers received orders to suspend the draft. This did little to ease the crowd. Policemen's homes were burned, and firehouses were attacked despite the fact that many firefighters were against the draft. Later in the week, the rioting continued but focused more against African Americans. Young men who were unmarried and had no children performed the most violent attacks since they were the most likely to be drafted. Eventually, the rioting was put down on July 17 by military regiments returning from Gettysburg. The quelling of the riots through troops is proof of how much attention the draft riots received. Not only that, but the magnitude at which the riots broke out also indicated how much opposition there was to the war. The New York draft riots of 1863 occurred to oppose the war for two reasons. The first reason is that labor competition would be increased if the war was won, since the belief that African Americans would emigrate to the North and steal jobs from white men. The second reason is that the draft would ensure the loss of jobs for white men and force anti-war oriented people to fight in the very war they opposed. Opposition to the draft did not always occur in an organized form, however.\nDraft dodgers\nDraft dodgers were prominent during the American Civil War. Between July 1863 and April 1865, four national drafts resulting in a call of 776,829 men took place, but of these men, only 46,347 were held to service. Although most men who opposed and dodged the draft did so legally, many still refused to report to the draft office and illegally avoided it. Between July 1863 and December 1864, 161,224 men failed to report to service under the draft. The large number of draft dodgers indicated the amount of opposition to fighting in the war. Some of the soldiers may have been peace Democrats as well as Southern sympathizers. Many did consist of Irish Catholics, who immigrated to the east coast and were mentioned earlier. Another reason immigrants avoided the draft was because they had just arrived in America. They did not want to fight and die for a country they had only been in for a short time. The Confederate States of America issued its first draft that called upon all able-bodied white males aged from eighteen to thirty-five to fight. However, it changed the draft age from seventeen to fifty. The extreme broadening of the draft age could have increased the opposition to the war. Although there were some draft dodgers that simply did not desire to fight but did not oppose the war.\nMany, however, were against the emancipation proclamation and sided with the northern Democrats. A particular reason men avoided the draft was due to the Confederate Army's increase in strength brought on by the emancipation proclamation. It \"steeled resolve in the Confederate Army by providing soldiers like James E. Harrison with fresh reminders of precisely why they must keep up the fight.\" Conversely, the emancipation changed what Union soldiers were fighting for dramatically. They thought they were fighting to preserve the Union, but the emancipation changed soldiers' views on the war. Many Unionists agreed that slavery should not be abolished and left the ranks of the Union Army. However, the emancipation did not change the opposition as a whole\nThe above evidence is clear in showing the two most critical opposition movements to the American Civil War. The New York draft riots, along with draft dodging, were an effective method in resisting the war in three ways. First, white men could keep their jobs if they did not go to war. Secondly, avoiding the draft meant less manpower for the Union to keep fighting. The war meant fewer jobs for white men in places such as New York City due to an influx of freed slaves if the Union won. With less manpower, it would be harder to keep the war going. Finally, immigrants who arrived in America were shortly conscripted to fight in a war for a cause that meant little to them. As for the peace movement in the North and South, Democratic leaders held the offensive in the opposition to the war. Men such as Vallandigham, Cox, Farrar, Fowler, Foote, and Carpenter strongly opposed the war and attempted to make agreements with both the Confederacy and the Union to end the war. On the other hand, movements led by Seymour spread like wildfire in Connecticut. The peace demonstrations held by peace men and women and the creation of the peace flag were clear displays of discontent with the war. The scale of the opposition to the war is witnessed through the Unionists' attacks on peace demonstrations and peace-promoting newspapers. Furthermore, the Emancipation Proclamation stirred Unionists' opinions on the war. Not only did it strengthen the Confederate Army, but it also reduced the manpower of white men in the Union Army. Although the peace movements, draft riots, and Emancipation Proclamation did not end the American Civil War nor did it lead to the Confederacy winning the war, they displayed the opinions of many Americans who were both ordinary people and Congressmen from north and south.\nSouthern opposition\nConsiderable opposition existed in the South. In the border states, a bloody partisan war raged in Kentucky, Missouri, and Indian Territory.  Many Confederate governors feuded with the Confederate government in Richmond, thus weakening the South militarily and economically.\nAppalachia\nThe mountain areas contained pockets of strong opposition. That happened in the Ozarks of Arkansas and even more so in the Appalachia area. It was a theatre of bloody feuds and brutal, partisan (guerrilla) warfare, especially in eastern Kentucky, eastern Tennessee, western North Carolina, northern Georgia, and West Virginia.  As Fisher (2001) explains:\nA constant in Civil War Appalachia was the prevalence of partisan violence. Throughout this region, loyalists, secessionists, deserters, and men with little loyalty to either side formed organized bands, fought each other as well as occupying troops, terrorized the population, and spread fear, chaos, and destruction. Military forces stationed in the Appalachian regions, whether regular troops or home guards, frequently resorted to extreme methods, including executing partisans summarily, destroying the homes of suspected bushwhackers, and torturing families to gain information. This epidemic of violence created a widespread sense of insecurity, forced hundreds of residents to flee, and contributed to the region's economic distress, demoralization, and division.\nSee also\n* Pacifism in the United States\n*List of peace activists\n*List of anti-war organizations\n*Gangs of New York, a 2002 fictionalized film referencing the New York Draft Riots of 1863\n*Red Strings\n*Maggie Flynn, a 1968 Broadway Musical that also touches upon the 1863 Draft Riots\nReferences\nFurther reading\nNorth\n* William Dusinberre. Civil War Issues in Philadelphia, 1856-1865 (1965)\n* Arnold Shankman. The Anti-War Movement in Pennsylvania, 1861-1865 (1980).\n* Barnet Schecter. ''The Devil's Own Work: The Civil War Draft Riots and the Fight to Reconstruct America (2005)\n*G. R. Tredway. Democratic Opposition to the Lincoln Administration in Indiana (1973). hostile to Lincoln\n* Hubert H. Wubben. Civil War Iowa and the Copperhead Movement (1980) finds a fragmented Democratic opposition had few disloyal or outright traitorous elements.\nSouth\n* Ambrose, Stephen E. \"Yeoman Discontent in the Confederacy.\" Civil War History 8 (1962): 259–268. [https://muse.jhu.edu/pub/14/article/415391/summary excerpt]\n* Auman, William T. \"Neighbor against Neighbor: The Inner Civil War in the Randolph County Area of Confederate North Carolina.\" North Carolina Historical Review 61 (1984): 59–92.\n* Coulter, E. Merton. The Confederate States of America, 1861-1865 Louisiana State University Press, 1950.\n* Coulter, E. Merton. William G. Brownlow, Fighting Parson of the Southern Highlands University of North Carolina Press, 1937. Tennessee\n* Faust, Drew Gilpin. The Creation of Confederate Nationalism: Ideology and Identity in the Civil War South'' Baton Rouge: Louisiana State University Press, 1988.\n* Fisher, Noel. \"Feelin' Mighty Southern: Recent Scholarship on Southern Appalachia in the Civil War\" in Civil War History. Volume 47, issue 4, 2001. pp 334+, in JSTOR\n* Fleming, Walter L. Civil War and Reconstruction in Alabama Columbia University Press, 1905.\n* Hahn, Steven. The Roots of Southern Populism: Yeoman Farmers and the Transformation of the Georgia Upcountry, 1850-1890 Oxford University Press, 1983.\n* Kimball, William J. \"The Bread Riot in Richmond, 1863.\" Civil War History 7 (1961): 149–154. in JSTOR\n* Kruman, Marc W. \"Dissent in the Confederacy: The North Carolina Experience.\" Civil War History 27 ( 1981): 293–313.\n* Kruman, Marc W. Parties and Politics in North Carolina, 1836-1865 Louisiana State University Press, 1983\n* Lonn, Ella. Desertion during the Civil War 1928.\n* McKitrick, Eric L. \"Party Politics and the Union and Confederate War Efforts.\" In The American Party Systems. William Nisbet Chambers and Walter Dean Burnham, eds. Oxford University Press, 1967.\n* McMillan, Malcolm C. ''The Disintegration of a Confederate State: Three Governors and Alabama's Wartime Home Front, 1861-1865 Mercer University Press, 1986.\n* Owsley, Frank Lawrence. State Rights in the Confederacy University of Chicago Press, 1925.\n* Rable, George C. The Confederate Republic: A Revolution against Politics University of North Carolina Press, 1994.\n* Ramsdell, Charles W. Behind the Lines in the Southern Confederacy Louisiana State University Press, 1944.\n* Rubin, Anne S. A  Shattered Nation: The Rise and Fall of the Confederacy, 1861-1868 (2005)\n* Shanks, Henry T. \"Disloyalty to the Confederacy in Southwestern Virginia, 1861-1865.\" North Carolina Historical Review 21 (1944): 118–135.\n* Tatum, Georgia L. Disloyalty in the Confederacy University of North Carolina Press, 1934; [https://books.google.com/books?id=n4eGfQqKWJAC&dq=disloyalty+confederacy&pg=PA3 reprint 2000]\n* Wakelyn, John L.  Confederates Against the Confederacy: Essays on Leadership and Loyalty (2002)\n* Yearns, Wilfred Buck, ed. The Confederate Governors'', University of Georgia Press, 1985."
    }
  ]
}