{
  "content": [
    {
      "type": "text",
      "text": "# Orders of the Russian Empire\n\nThe Orders of the Russian Empire were honorary awards (insignia) of nine titles, awarded by Russian monarchs from 1698 to 1917.\nPeter I established the first order of Russia in 1698, but for almost a hundred years after that, the award system in the Russian Empire was regulated by decrees for individual orders. The merits of cavaliers from the highest aristocracy and generals were determined at the personal discretion of the monarch, which did not create problems due to the existence of only three orders before the reign of Catherine II. To cover broad layers of the nobility, Catherine II introduced two new orders with four degrees each, improving but also significantly complicating the order system in the state.\nThe first general law on orders of the Russian Empire was the \"Regulation on Russian Imperial Orders\" approved by Paul I on the day of his coronation (April 5, 1797), which for the first time officially established the hierarchy of imperial awards and created a single body to manage award production – the Russian Cavalier Order (Cavalier Society). According to the establishment, only the emperor could be the supreme commander (grandmaster) of the order; direct leadership of the order was entrusted to its chancellor from among the holders of the Order of Saint Andrew the First–Called.\nHistory\nIn the Middle Ages, the word \"order\" meant a spiritual–knightly organization, each member of which had a distinctive sign – a cross of a certain shape and color, cut out of fabric and sewn onto knightly clothing. Over time, a new sign appeared – a star. By the 18th century, stars began to be made of metal, and they were worn on ribbons, the color of which corresponded to the color of the order's cloak (mantle). Fabric stars, embroidered with sequins and braid, existed until the first half of the 19th century. Later, such signs of various degrees began to be awarded to statesmen whose merits made them worthy (in the opinion of the monarch) of joining the order of those awarded the royal favor. That's why it was said: a sign for such order, a star for such order.\nIn Rus', in the early Middle Ages, the grivna, a neck bracelet forged from precious metal, began to serve as a reward. In addition, there was a custom to reward with a gold chain with a cross. Until the end of the 17th century, dengi (not coins) that was forged from silver wire was used as a reward. Dengi became the prototype for mass soldier awards. At the end of the 17th century, the award became a \"gold\" one – a medal in the form of a coin with the image of the coat of arms of Moscow. This award was given to all participants in battles and campaigns, including civilians. \"Golden\" were sewn onto the sleeve of a caftan or a hat, and worn on a chain around the neck, like portrait medals in Western Europe. In modern times, the concept of order began to mean the actual award badges.\nAfter the accession of Peter I, for several more years the military award remained a gold medal and gold kopecks (or altyn) for ordinary soldiers. In the first hundred years of its existence, the star for the highest order of Saint Andrew the First–Called was made of cloth and sewn onto a caftan, and only by the 19th century it began to be made of silver.\n*The first order of the Russian Empire – the Order of the Holy Apostle Andrew the First–Called was established by Tsar Peter I on November 30, 1698 \"to reward one for loyalty, courage and various services rendered to us and the fatherland\". The order became the highest award of the Russian state for high ranks. During the reign of Peter I, 24 Russians and 14 foreigners were awarded the order. The Tsar himself was sixth in order of awards. The first holder of the order was Admiral General Fyodor Golovin, who received the award on March 10, 1699. Under Catherine I, 18 people were awarded the order, under Peter II – 5, under Anna Ivanovna – 24, under Elizaveta Petrovna – 83, under Peter III – 15, under Catherine II – 100 people;\n*The second order, which became the highest award for ladies, was also established by Peter I on December 5, 1714, in honor of his wife Ekaterina Alekseevna – the Order of the Holy Great Martyr Catherine. The order had two degrees – a large cross (intended for persons of royal blood) and a smaller cross, or сavalier (awarded to applicants from the highest noble class – the wives of major statesmen and military commanders for socially useful activities, taking into account the merits of their husbands, as well as foreign subjects). The number of ladies of the grand cross should not have been more than 12, the smaller – 94. Peter I awarded this order only to his wife; subsequent awards took place after his death. During the reign of Catherine I, Elizabeth Petrovna – 13, Catherine II – 41, under Alexander I, 139 ladies were awarded the order, during the reign of Alexander II – 112, Alexander III – 64, Nicholas II – 105. In total, from 1713 to 1917, 734 ladies were awarded the order. Formally, the women's Order of Saint Catherine was in second place in the hierarchy of awards. The last to be awarded, on December 21, 1916, was the granddaughter of Nikolai Karamzin, wife of Major General Count Vladimir Kleinmichel, Countess Ekaterina Kleinmichel (née Princess Meshcherskaya, 1843–1925), head of the Yalta Community of Red Cross Sisters. On February 16, 1727, the Order of Saint Catherine was awarded to the only male representative – the young Prince Alexander Menshikov, who was distinguished by excessive shyness;\n*The third order was established in 1725 by Empress Catherine I, shortly after the death of her husband, Emperor Peter I. The Order of Saint Alexander Nevsky became an award one step lower than the Order of Saint Andrew the First–Called, to distinguish not the highest ranks of the state;\n*In 1769, Catherine II introduced the \"Military Order of the Holy Great Martyr and Victorious George\", which became the most respected due to its statute. This order was awarded regardless of officer rank for military exploits: \"Neither high breed, nor wounds received in front of the enemy, give the right to be awarded this order: but it is given to those who not only corrected their position in everything according to their oath, honor and duty, but in addition distinguished themselves by a special courageous act, or they gave wise and useful advice for our military service...\". The officers were proud of the Order of Saint George, 4th Class, like no other, since it was earned with their own blood and was recognition of the personal courage of the recipient;\n*Also, Catherine II, on the day of the 20th anniversary of her reign in 1782, established the fifth Russian order. The Imperial Order of the Holy Equal–to–the–Apostles Prince Vladimir in 4 degrees became a more democratic award, allowing it to reach a wide range of civil servants and officers;\n*In 1797, Paul I introduced the Order of Saint Anna into the awards system, the youngest in the hierarchy of Russian orders until 1831. During his short reign, he also instituted the exotic Maltese Cross, which was abolished by his son, Alexander I. Paul I reformed the award system and excluded the Order of Saint George and Saint Vladimir from the number of imperial orders during his reign due to hatred of his mother. However, after his death, Alexander I signed a manifesto on December 12, 1801 \"On the Restoration of the Orders of Saint George and Saint Vladimir in All Their Strength...\";\n*The most important innovation of Emperor Alexander I in the award system was the introduction of the Military Order Insignia for lower ranks and privates, assigned to the military order of the Holy Great Martyr and Victorious George. On February 13, 1807, the emperor signed the manifesto \"On the Establishment of a Special Insignia... Military Order\";\n*After the inclusion of the Kingdom of Poland into the Russian Empire, Nicholas I found it useful to include the Polish Orders of the White Eagle and Saint Stanislaus in the imperial and royal orders in 1831. The Polish Order Virtuti Militari was not included in the imperial and royal orders, but was awarded for the suppression of the Polish uprising under the official name \"Polish Insignia for Military Dignity\" from 1831 to 1843. In 1857, this insignia was equated with Russian medals and began to be worn in the same row with them, according to the time of award.\nIn the 18th century, stars for orders were made sewn. A star with fabric inserts was embroidered on a leather backing with thick silver or gilded thread. From the beginning of the 19th century, metal stars began to appear, usually made of silver and less often of gold, which replaced embroidered stars only by the middle of the 19th century. To decorate stars and signs so–called \"diamonds\" were used, that is, faceted rock crystal stones. There are stars in which the owner replaced some of the diamonds; probably due to financial difficulties.\nUntil 1826, salary as a holder of a Russian order of any degree gave the recipient the right to receive hereditary nobility (not a sufficient condition, but a good reason). Since 1845, those awarded only the Orders of Saint Vladimir and Saint George of any degree received the rights of hereditary nobility, while for other orders the award of the highest 1st Degree was required. By decree of May 28, 1900, those awarded the Order of the 4th Degree of Saint Vladimir received the rights only of personal nobility.\nAfter the October Revolution, the awarding of orders and medals of the Russian Empire in Soviet Russia was discontinued. However, the heads of the Russian Imperial House (House of Romanov) in exile continued to bestow a number of awards from the Russian Empire.\nTable of orders of the Russian Empire\n{| align=\"center\" class=\"wikitable\"\n|+\n! |Order\n! |Year of Establishment\n! |Motto\n! |Degrees\n! |Number of Awards\n! |Notes\n|----- style=\"background:#CCCCFF; height:2px\"\n|colspan=\"6\" |\n|-----\n| Saint Apostle Andrew the First–Called\n|align=\"center\"| 1698\n| «For Faith and Fidelity»\n|align=\"center\"| One\n| 900–1100\n| The first and highest order until 1917. Only the highest ranks were awarded. Restored in Russia as a state award in 1998.\n|----- style=\"background:#CCCCFF; height:2px\"\n|colspan=\"6\" |\n|-----\n| Saint Catherine\n|align=\"center\"| 1714\n| «For Love and Fatherland»\n|align=\"center\"| Two\n| 724\n| Women's order. Ladies of high society were awarded for socially useful and charitable activities, as well as grand duchesses by birthright. Restored in Russia as a state award in 2012.\n|----- style=\"background:#CCCCFF; height:2px\"\n|colspan=\"6\" |\n|-----\n| Military Saint George\n|align=\"center\"| 1769\n| «For Service and Bravery»\n|align=\"center\"| FirstSecondThirdFourth\n| 25125625~10 thousand\n| Order of Military Merit, the most respected in Russian society. The Order of the 4th Degree was also awarded for length of service (approximately 3/4 of all awards). Restored in Russia as a state award in 2000.\n|----- style=\"background:#CCCCFF; height:2px\"\n|colspan=\"6\" |\n|-----\n| Saint Prince Vladimir\n|align=\"center\"| 1782\n| «Benefit, Honor and Glory»\n|align=\"center\"| Four\n| 1st Degree: 500–600\n| Only the highest ranks were awarded the 1st Degree.\n|----- style=\"background:#CCCCFF; height:2px\"\n|colspan=\"6\" |\n|-----\n| Saint Alexander Nevsky\n|align=\"center\"| 1725\n| «For Labors and Fatherland»\n|align=\"center\"| One\n| 3000\n| In 1942, the Order of Alexander Nevsky (with a slightly changed name) was restored as a military award of the Soviet Union. Resumed in modern Russia, but as a civilian award.\n|----- style=\"background:#CCCCFF; height:2px\"\n|colspan=\"6\" |\n|-----\n| White Eagle\n|align=\"center\"| 1831\n| «Pro Fide, Rege et Lege»«For Faith, King and Law»\n|align=\"center\"| One\n| 4018\n| Polish order founded in 1705. After the annexation of the Kingdom of Poland to the Russian Empire, it entered the award system of the empire on November 17, 1831.\n|----- style=\"background:#CCCCFF; height:2px\"\n|colspan=\"6\" |\n|-----\n| Saint Anna\n|align=\"center\"| 1797\n| «Those Who Love Truth, Piety and Loyalty»\n|align=\"center\"| Four\n| Several hundred thousand\n| The order existed since 1735 in the German principality of Holstein. During the reign of Catherine II it became a dynastic order of the Russian Imperial House. The first awards of this order were carried out only as an imperial dynastic award. Introduced into the system of imperial awards by Paul I. One of the most popular orders.\n|----- style=\"background:#CCCCFF; height:2px\"\n|colspan=\"6\" |\n|-----\n| Saint Stanislaus\n|align=\"center\"| 1831\n| «Rewarding, Encouraging»\n|align=\"center\"| Three\n| Hundreds of thousands\n| Polish order, founded in 1765 and included in the system of Russian awards after the annexation of the Kingdom of Poland to the empire. The most widespread order for awarding, first of all, officials.\n|----- style=\"background:#CCCCFF; height:2px\"\n|colspan=\"6\" |\n|-----\n| Saint John of Jerusalem – Maltese Cross\n|align=\"center\"| 1798\n|\n|align=\"center\"| Three\n| 1500\n| Introduced into the system of imperial awards by Paul I. Since 1801, no awards have been made; since 1817, it has been abolished in Russia.\n|----- style=\"background:#CCCCFF; height:2px\"\n|colspan=\"6\" |\n|}\nSeniority and order of awarding orders\nThe procedure for awarding and the seniority of orders were legislated in the Code of State Institutions and separately for military orders in the Code of Military Regulations. Below is the seniority of orders according to the Code of Institutions of 1892 (senior orders above).\n{|\n|-\n|\n* Order of Saint Andrew the First–Called\n|\n* Order of Saint Catherine\n|\n|-\n|\n* Order of Saint Vladimir\n|\n|\n* Order of Saint George\n|-\n|\n* Order of Saint Alexander Nevsky\n|\n|\n|-\n|\n* Order of the White Eagle\n|\n|\n|-\n|\n* Order of Saint Anna\n|\n|\n|-\n|\n* Order of Saint Stanislaus\n|\n|\n|}\n: Notes:\n:# The Order of Saint Catherine, as an exclusively female order, was outside the general hierarchy; in terms of its status, it can be considered at the level of the Order of Saint Andrew the First–Called;\n:# The Order of Saint George is also considered outside the hierarchy, as an order exclusively for military merit; its status corresponds to the Order of Saint Vladimir, and according to the rules of wearing it is second only to the Order of Saint Andrew the First–Called.\nThe following gradualism (sequence) of awarding orders was envisaged:\n# Saint Stanislaus, III Degree;\n# Saint Anna, III Degree;\n# Saint Stanislaus, II Degree;\n# Saint Anna, II Degree;\n# Saint Vladimir, IV Degree;\n# Saint Vladimir, III Degree;\n# Saint Stanislaus, I Degree;\n# Saint Anna, I Degree;\n# Saint Vladimir, II Degree;\n# White Eagle;\n# Saint Alexander Nevsky;\n# Saint Alexander Nevsky With Diamond Jewelry.\nThe Order of Saint Anna of the 4th Degree and Saint George of all degrees, as military awards, did not participate in the general gradualism of awards. The highest orders of Saint Andrew the First–Called, Saint Catherine, and Saint Vladimir of the 1st Degree were also excluded from the legally established list of gradualism; these orders were awarded personally by the emperor at his own discretion. For other orders, the principle of gradual awarding from the lowest order to the highest was observed, observing the corresponding length of service and compliance with rank.\nThe order may have been broken. In the form of an initial award, it was allowed to award senior orders, bypassing the junior ones, in cases where the recipient had a rank of a sufficiently high class according to the Table of Ranks. Knights of the Order of Saint George of the 4th Degree, who served in the officer ranks for at least 10 years, were allowed to be awarded Stanislaus of the 2nd Degree, bypassing the 3rd Degree of the Orders of Saint Stanislaus and Saint Anna.\nfrom 1999 with Orders of the Russian Empire]]\nWomen's orders\n*Order of Saint Catherine;\n*Insignia of the Holy Equal–to–the–Apostles Princess Olga (the only award took place in 1916).\nOrders for non–Christians\nSince August 1844, on awards that were given to subjects of non–Christian faiths, images of Christian saints and their monograms on the Orders of Saint George, Saint Vladimir, Saint Anna, and so on were replaced by the state emblem of the Russian Empire – the double–headed eagle. This was done \"so that when Asians (hereinafter all non–Christians) are awarded awards, their religion will always be indicated\". In 1913, with the adoption of the new statute of the Military Order, the image of a horseman slaying a dragon and his monogram were returned to the Order of Saint George and the Crosses of Saint George.\nPrinciples of the reward system\nThe award system of the Russian Empire was based on the following principles.\n1. The awarding of orders, divided into several degrees, was carried out only sequentially, starting with the lowest degree. This rule had practically no exceptions (except for only a few cases in relation to the Order of Saint George);\n2. Orders awarded for military exploits (except for the Order of Saint George) had a special distinction – crossed swords and a bow made from an order ribbon;\n3. It was established that order insignia of lower degrees are removed upon receipt of higher degrees of this order. This rule had an exception of a fundamental nature – orders awarded for military exploits were not removed even if higher degrees of this order were received; likewise, holders of the Orders of Saint George and Saint Vladimir wore the insignia of all degrees of this order;\n4. The possibility of receiving the order of this degree again was practically excluded. This rule has been and is being steadily observed to this day in the award systems of the overwhelming majority of countries (\"innovations\" appeared only in the Soviet award system, and after it in the award systems of a number of socialist countries).\nOrder Administration (Chapter)\nPaul I established the Russian Cavalry Order, which was in charge of the production of insignia, medals, award weapons for officers, as well as the presentation of the awards themselves and certificates for them. Since 1798, it began to be officially called the Chapter of the Order; later in official documents the name Chapter of Russian Orders was also used. At the Chapter there were cavalry councils, councils of the most respected holders of certain orders, who at their meetings considered cases of awarding lower degrees of the corresponding orders.\nIn 1842, the Chapter was annexed to the Ministry of the Imperial Household, and the post of Chancellor of the Chapter was occupied by the Minister of the Household. The emperor has always remained the supreme commander (grandmaster) of Russian orders.\nBy a decree of the People's Commissar of Property Vladimir Karelin, published on January 22, 1918, the Chapter of Orders was abolished.\nSee also\n*State awards of the Russian Federation\nReferences\nSources\n*[https://dlib.rsl.ru/viewer/01004235893 Historical Outline of Russian Orders and a Collection of the Main Order Statutes – Saint Petersburg, 1892]\n*Pavel Winkler. [https://ru.wikisource.org/wiki/ЭСБЕ/Орден Order] // Encyclopedic Dictionary of Brockhaus and Efron: In 86 Volumes (82 Volumes and 4 Additional Ones) – Saint Petersburg, 1890–1907\n*\n*\nExternal links\n*[http://medalirus.ru/rus-ordena/ Orders of the Russian Empire], on the website \"Rewards of Imperial Russia, 1702–1917\"\n*[http://shkolazhizni.ru/archive/0/n-11387/ Why Couldn't Cornet Obolensky Wear the Medal?]"
    }
  ]
}