{
  "content": [
    {
      "type": "text",
      "text": "# Order of the Dragon King\n\n|type            = Order\n|motto           =\n|day             =\n|eligibility     =\n|for             = distinguished services to Bhutanese nation or people\n|status          = Currently constituted\n|head_title      = Sovereign\n|head            = Jigme Khesar Namgyel Wangchuck\n|house           =\n|chancellor      =\n|commander       =\n|grades          = First ClassSecond Class\n|former_grades   =\n|date            = 7 November 2008\n|first_induction =\n|last_induction  =\n|total           =\n|recipients      =\n|individual      =\n|higher          =  None\n|lower           = Order of Great Victory of the Thunder Dragon\n|image2          =\n|caption2        =  Ribbon bar of the order\n|}}\nThe Order of the Dragon King (Druk Gyalpo) is the highest decoration of the Kingdom of Bhutan, awarded in recognition of a lifetime of service to the people and Kingdom of Bhutan. Existing in two categories, it is the pinnacle of the honor system in Bhutan and takes precedence over all other orders, decorations and medals. Consisting of two Classes manufactured in sterling silver, the First Class comprises a Breast Star and Sash Badge while the Second Class has only a Sash and Badge.\nHistory\nIt was founded on 7 November 2008 by the King Jigme Khesar Namgyel Wangchuck to reward those who have devoted a lifetime of service to the nation and people of Bhutan.\nGrades\nThe order has two grades :\n* First class.\n* Second class.\nInsignia\nGeneral display\nThe general display of the order depends on the recipient's dress.\nIn national Bhutanese dress :\n* First class :  a badge from a large neck ribbon and a star from a medal ribbon on the left breast\n* Second class : a badge worn from a large neck ribbon\nIn European dress or uniform :\n* First class :  badge hanging from a sash and a breast star (without ribbon) on the left breast\n* Second class : badge hanging from a sash\nDetails\nThe 80mm star consists of a large ornate gold plated back plate with an enameled border centrepiece in orange enamel, and a red enameled center with the Royal Symbol in gold.\nThe 60mm detachable badge bears the same design as the breast star, with a top suspension device for attaching to the sash.\nThe ribbon is orange with large white and darker orange border stripes.\nNotable recipients\n* Queen Grandmother Ashi Kesang Choden (Order of the Druk Gyalpo, First Class).\n* Je Thrizur Tenzin Doendrup (Order of the Druk Gyalpo, First Class).\n* Je Khenpo Trulku Ngawang Jigme Choedra (Order of the Druk Gyalpo, First Class).\n* Narendra Modi - Prime Minister of India (Order of the Druk Gyalpo, First Class).\nReferences"
    }
  ]
}