{
  "content": [
    {
      "type": "text",
      "text": "# Order of the Renaissance (Oman)\n\nThe Order of the Renaissance () is an order of Oman.\nHistory\nThe order was instituted in 1973 by Sultan Qaboos bin Said as a unity or development medal. Three classes of the order where later created with the original medal becoming a separate fourth class. It is awarded to people who have contributed significantly to the development of Oman.\nInsignia\nThe insignia was created by Spink & Son with some changes over the years. The ribbon of the first three classes is white with a purple and green striped border. The first class has a star and sash ribbon with a badge, the second class has a star and a neck ribbon with a badge, and the third class has a neck ribbon with a badge. The badge is an eight pointed star with alternating purple and green enameled points and the national emblem of Oman in the center on a white enamel background with a green enamel border. The first class badge also has silver five pointed stars between each enameled point. The star is the same design as the badge with a background of silver rays behind the enameled points.\nThe fourth class is the original medal and has a different ribbon from the top three classes. It is twelve equal stripes of purple, green, and white with an eight pointed star of alternating purple and green as the pendant badge.\nNotable recipients\nFirst class\n* Princess Catharina Amalia, Princess of Orange (2025)\nSecond class\n* Al Mutasim bin Hamood bin Nasr al Busaidi (1975)\n* Salim bin Abdullah bin Ahmed al Ghazali (1975)\n* Mohammed al Sayyid Mustafa al Nu’amani (2021)\n* Abdullah bin Shaban Al Farsi (2021)\nThird class\n*Abdul Alim bin Mustahail al Rakhyoot (1976)\nFourth class\n* Abdullah bin Ahmed bin Suhail Amergeed (1973)\n* Ahmed bin Mohammad bin Salim al Amri (1973)\n* Ahmed bin Said bin Ahmed al Hardan (1973)\n* Hilal bin Fadhallah bin Musalim Tabook (1973)\n* Mohammad bin Musalim bin Saif al Amri (1973)\n* Musalim bin Ahmed bin Said Ali bin Bdr (1973)\n* Mustahil bin Said bin Nasib al Shahri (1973)\n* Said bin Ali bin Suhail Qattan (1973)\n* Said bin Salim bin Ajham Jaboob (1973)\n* Salim bin Ghareeb bin Sohail al Samhan (1973)\n* Salim bin Musalim bin Ahmed al Masheni (1973)\nReferences"
    }
  ]
}