{
  "content": [
    {
      "type": "text",
      "text": "# Order of the Iron Crown (Kingdom of Italy)\n\nFrench Empire\n|type        = Order of merit\n|established = 5 June 1805\n|status      = Extinct\n|higher      = Order of the Reunion\n|image2      =\n|caption2    = Ribbon of the order\n}}\nThe Order of the Iron Crown () was an order of merit that was established on 5 June 1805 in the Kingdom of Italy by Napoleon Bonaparte under his title of Napoleon I, King of Italy.\nThe order took its name from the ancient Iron Crown of Lombardy, a medieval jewel with what was thought to be an iron ring, later shown to be of silver, forged from what was supposed to be a nail from the True Cross as a band on the inside. This crown also gave its name to the Order of the Crown of Italy, which was established in 1868.\nAfter the fall of the Napoleonic Kingdom of Italy in 1814, the order was re-established in 1815 by the Emperor of Austria, Francis I, as the Austrian Imperial Order of the Iron Crown.\nSignificance of the Iron Crown\nand breast star]]\nThe Iron Crown of Lombardy was allegedly made for Roman emperor Constantine and crafted from the iron of one of the nails in the True Cross used in the Crucifixion of Jesus. Thus came the term of “Iron Crown”. It was allegedly gifted by Pope Gregory I to Theodelinda, Queen of the Lombards, who donated it to the Church upon her death in 628. Afterwards, the crown would have been used for the coronation of the Lombard kings and of Holy Roman Emperor Charlemagne, when he took the throne of Lombardy in 774.\nRegardless of origin, the crown is crafted of six hinged plates of gold, set with precious gems, and held together with a circlet structure of white metal underneath. It was most probably a votive crown and the white metal band within has proven to be crafted of silver rather than iron. From the 14th c. onwards, the crown was seen as the most prominent insignia of the Italian kingship. It was therefore used during the coronation of later Holy Roman Emperors as kings of Italy.\nIt is now kept in the treasury of the Cathedral of Monza.\nEstablishment of the order\nDuring his continued expansion of power, Napoleon Bonaparte conquered Italy in much the same manner as Charlemagne. As a symbolic gesture, he had himself crowned as King of Italy using the Iron Crown of Lombardy for the coronation, which occurred on 26 May 1805.\nSoon after, Napoleon founded the Order of the Iron Crown on 5 June 1805. The order was divided into three classes, with an allowance of up to 20 grand cross knights, 100 commander knights, and 500 ordinary knights.\nWith the eventual end of the Napoleonic Kingdom of Italy, the original order ceased to exist. However, the Emperor of Austria, Francis I, re-established the order in 1815 as the Austrian Imperial Order of the Iron Crown.\nInsignia\nThe ribbon colors of the order were gold and green, with the badge of the order being an imperial eagle set upon a representation of the Iron Crown of Lombardy.\n* Knights wore a traditional military-style medal on the left chest.\n* Commanders wore a traditional military-style medal on the left chest, with the addition of a rosette in the center of the ribbon to distinguish them from ordinary knights.\n* Holders of the Grand Cross wore a sash over the right shoulder and a neck badge, along with a six-pointed breast star (that featured the Iron Crown at its center) on the left breast.\n{|align=center class=wikitable width=60% style=\"margin-left: auto; margin-right: auto; border: none;\"\n|colspan=\"3\" align=\"center\"|center\n|-\n|colspan=3 style=\"text-align:center;\" |Ribbon bar\n|-\n|width=20% valign=top align=center|centerKnight\n|width=20% valign=top align=center|centerCommander\n|width=20% valign=top align=center|centerGrand Cross\n|-\n|}\nMaster of the order\n* 1805–1814: Napoleon I, Emperor of the French and King of Italy\nSources\n* Blom, Philipp.  To Have and to Hold: An Intimate History of Collectors and Collecting.  Overlook, 2003.  pp.&nbsp;146–147.\n* Gottschalck, Friedrich.  Almanach der Ritter-Orden.  Leipzig, Kingdom of Saxony: Georg Joachim Goeschen, 1819.\nExternal links\n*"
    }
  ]
}