{
  "content": [
    {
      "type": "text",
      "text": "# Order of Merit of the Federal Republic of Germany\n\n| firstawarded  =\n| lastawarded   =\n| total_awarded = 262,532 (as of December 31, 2022)\n| total_awarded_posthumously =\n| total_recipients =\n| precedence_label =\n| individual    =\n| higher        =\n| same          =\n| lower         =\n| related       =\n| website       =\n| image2        =\nGrand Cross Special Class\nGrand Cross 1st Class, Special Issue\nGrand Cross 1st Class\nGrand Cross\nKnight Commander\nCommander\nOfficer\nMember\nMedal\n| caption2      = Ribbon bars of the Order of Merit\n}}\nThe Order of Merit of the Federal Republic of Germany (, or , BVO) is the highest federal decoration of the Federal Republic of Germany. It may be awarded for any field of endeavor. It was created by the first President of the Federal Republic of Germany, Theodor Heuss, on 7 September 1951. Colloquially, the decorations of the different classes of the Order are also known as the Federal Cross of Merit ().\nIt has been awarded to more than 262,000 individuals in total, both Germans and foreigners. Since the 1990s, the number of annual awards has declined from more than 4,000, first to around 2,500, then from 2015 to under 1,500, with a low of 918 awards in 2022. Since 2013, women have made up a steady 30–35% of recipients.\nMost of the German federal states () have each their own order of merit as well, with the exception of the Free and Hanseatic Cities of Bremen and Hamburg, which reject any orders (by tradition their citizens, particularly former or present senators, will refuse any decoration in the form of an order, the most famous example being former Chancellor Helmut Schmidt).\nHistory\nThe order was established on 7 September 1951 by the decree of Federal President Theodor Heuss. Signed by Heuss, German Chancellor Konrad Adenauer, and Minister of the Interior Robert Lehr, the decree states:\nIn 2022 Federal President Frank-Walter Steinmeier introduced a gender quota which demands a minimum of 40% of nominees to the order to be women.\nClasses\nThe Order comprises four groups with eight regular classes and one special (medal) class (hereafter enumerated in English):\n* Grand Cross ()\n** Grand Cross special class of the Order of Merit (, Special Class of Grand Cross), official insignia of the President of Germany, reserved for heads of state and their spouses\n** Grand Cross 1st class of the Order of Merit in exceptional finish (, Grand Cross 1st class in exceptional finish), reserved for former Federal Chancellors of Germany\n** Grand Cross 1st class of the Order of Merit (, Grand Cross 1st class)\n* Great Cross of Merit ()\n** Grand Cross of the Order of Merit (, Great Cross of Merit with Star and Sash)\n** Knight Commander's Cross of the Order of Merit (, Great Cross of Merit with Star)\n** Commander's Cross of the Order of Merit (, Great Cross of Merit)\n* Cross of Merit ()\n** Officer's Cross of the Order of Merit (, Cross of Merit 1st Class)\n** Cross of the Order of Merit (, Cross of Merit)\n* Medal of Merit ()\n** Medal of the Order of Merit (, Medal of Merit)\nThe President of the Federal Republic holds the Grand Cross special class ex officio. It is awarded to him in a ceremony by the President of the Bundestag, attended by the Chancellor of Germany, the President of the Bundesrat, and the Supreme Court President. Other than the German president, only a foreign head of state and their spouse can be awarded with this highest class. There is also the provision of awarding the Grand Cross 1st class in exceptional finish (), in which the central medallion with the black eagle is surrounded by a stylized laurel wreath in relief. This Grand Cross 1st class in exceptional finish has been awarded only to three persons, the former German chancellors Konrad Adenauer, Helmut Kohl and Angela Merkel.\nInsignia\nOrder of the Black Eagle, The Third Reich Order of the German Eagle, The Third Reich Red Cross of Honour and the Prussian Pour le Mérite ]]\nExcept for the lowest class, the medal, the badge is the same for all classes, but with slightly different versions for men and women (slightly smaller badge and ribbon for women):\nThe badge for the Member and Officer classes however are only enamelled on one side, and flat on the reverse. The badge of the Order is made up of a golden four-armed cross enamelled in red, with a central gold disc bearing a black enamelled German federal eagle ().\nThe star is a golden star with straight rays, its size and points vary according to class, with the badge superimposed upon it. An interesting fact about the stars, of which no less than four grades use one, is that they all have the same basic shape as various other breast stars from German history.\n* 8-pointed golden Star: Grand Cross special class - the same shape as the Prussian Order of the Black Eagle\n* 6-pointed golden Star: Grand Cross 1st class (and special issue design if golden oak crown between the cross branches around the medallion) - the same shape as the Third Reich Order of the German Eagle\n* 4-pointed golden Star: Grand Cross (Grand Cross of Merit with Star and Sash) - the same shape as the Third Reich Social Welfare Decoration\n* silver Square-upon-point: Knight Commander (Grand Officer) - the same shape as the Grand Cross of the Pour le Mérite\nThe reasoning behind this is not clear. It is not known if this is deliberate or coincidence, as the tools used to make the stars were in short supply after the war, and using stamping dies that were readily available and could be reused or acquired from other manufacturers would have been a good way of cutting costs and simplifying production in a Germany only just starting to experience the . It is of course possible that this could have been deliberate, and a way to celebrate German history in the design of the new honour for the Federal Republic. This is unlikely however as two stars represent decorations awarded during the Third Reich, and the other two are of Prussian origin. Prussia itself had only been recently abolished and the legacy of so called \"Prussian militarism\" was not something openly celebrated in the new Federal Republic of Germany.\nThe riband of the Order is made up of the colours of the German flag. The pattern is a large central band of red, edged on both sides in a smaller band of gold-black-gold.\nGallery\nFile:German order merit with special sash.jpg|\nFile:German Order of Merit Grand Cross First Class.jpg|\nFile:Bundesverdienstkreuz mit Schulterband.jpg|\nFile:Bundesverdienstkreuz Stern.jpg|\nFile:Saksan liittotasavallan ansioristikunnan suurristin rintataähti.png|\nFile:Gr Verdienstkreuz BVK.jpg|\nFile:Order of Merit of the Federal Republic of Germany.jpg|\nFile:OĞUZ MADALYA 003.jpg|\nFile:Bundesarchiv Bild 199-1992-089-29, Britische Königin Elisabeth II. in Brühl.jpg|\nFile:Bundesadler on the inner lid of the German Order of Merit.png|The gold foil German Bundesadler found on the inner lid of the Order\nFile:Bundesverdienstkreuz Grand Cross with Star and Sash.png|Grand Cross with Star and Sash\nFile:Bundesverdienstkreuz Grand Cross badge.png|Grand Cross with badge\nFile:Bundesverdienstkreuz Grand Cross with Star and Sash in case.png|Grand Cross with Star and Sash in case\nFile:Bundesverdienstkreuz Grand Cross with Star and Sash set.png|Grand Cross with Star and Sash set\nFile:Bundesverdienstkreuz Grand Cross Star.png|Grand Cross Star\nFile:Bundesverdienstkreuz Commander Class.png|Commander's Cross set\nFile:Bundesverdienstkreuz Commander.png|Commander's Class in case\nFile:Commander Class set of the German Bundesverdienstkreuz.png|Commander's Class\nRecipients\nSee also\n*Iron Cross\n*Order of Karl Marx\n*Pour le Mérite\n*Knight's Cross of the Iron Cross\n*Awards and decorations of the German Armed Forces\nReferences\nExternal links\n*\n*[https://www.auswaertiges-amt.de/blob/215266/5c40f9ea236ed39858e8c2e8194ba175/ordensstufen-data.pdf Classes of the Order of Merit of the Federal Republic of Germany with their official French, English, Spanish and Russian translations] (PDF)\n* [http://www.bundespraesident.de/SharedDocs/Downloads/DE/verdienstorden.pdf?__blob=publicationFile Order of Merit of the Federal Republic of Germany brochure]\n* [https://web.archive.org/web/20060616084725/http://menschenundorden.hdg.de/Final/deu/page23.htm Stiftung Haus der Geschichte der Bundesrepublik Deutschland]"
    }
  ]
}