{
  "content": [
    {
      "type": "text",
      "text": "# Order of St. Thomas (award)\n\nOrder of St. Thomas}}\nThe Order of St. Thomas is the highest honorary award given by the Malankara Orthodox Syrian Church (Indian Orthodox Church) and named after St. Thomas the Apostle who founded the Church in India. It is reserved for heads of states and churches and awarded by the Catholicos of the East and Malankara Metropolitan, who is the primate of the Malankara Church. The award is usually presented at large public gatherings held at different locations of importance to the Malankara Church within India.\nRecipients\n1. Gyani Zail Singh, President of India (1982)\nDuring the Catholicate Platinum jubilee celebratory meeting held at Kottayam Nehru Stadium on 12 September 1982, the chief guest Gyani Zail Singh, President of India, was awarded the Order of St. Thomas by Catholicos Baselios MarThoma Mathews I. Dignitaries from several Churches around the world were present at the meeting including Catholicos of All Armenians Vazgen I and Catholicos-Patriarch of All Georgia Ilia II. Dr. P. C. Alexander, Principal Secretary to the Prime Minister of India and Union Minister C. M. Stephen were among the guests at this immense meeting. Dr. Paulos Mar Gregorios, Catholicos Designate Mathews Mar Coorilos, Governor of Andhra Pradesh K. C. Abraham, Michael Bosco Duraisamy of Salem representing the Pope of Rome, Metropolitan Emilianos representing the Ecumenical Patriarch of Constantinople, Metropolitan Nathaniel of Ethiopian Orthodox Church, Metropolitan Vladimir of Russian Orthodox Church, Metropolitan Sairadhariar of Armenian Orthodox Church, Metropolitan Nestor of Romanian Orthodox Church, Bishop Josif Velichki of Bulgarian Orthodox Church, Bishop Ambrosius of Finland, Kerala state minister R. Balakrishna Pillai and Chief Editor of Malayala Manorama Mr. K. M. Mathew were also present on the occasion.\n2. Bartholomew I, Ecumenical Patriarch of Constantinople (2000)\nOn 19 November 2000, the Ecumenical Patriarch of Constantinople Bartholomew I  was awarded the Order of St. Thomas by Catholicos Baselios Marthoma Mathews II at Parumala Seminary.\n3. Karekin II Nersessian, Supreme Patriarch & Catholicos of all Armenians (2008)\nOn 6 November 2008, the Supreme Patriarch & Catholicos of all Armenians Karekin II Nersessian was awarded the Order of St. Thomas by Catholicos Baselios Marthoma Didymos I at Mammen Mappila Hall, Kottayam. The dignitaries who were present at the public meeting included Armenian Ambassador to India Ashot Kocharian, Catholicos Designate Paulos Mar Milithios, Thomas Mar Athanasius of Chengannur, Knanaya Catholic Archbishop Mathew Moolakkatt of Kottayam and Priest Trustee Johns Abraham Konat among others.\n4. Abune Paulos, Patriarch of Ethiopia (2008)\nOn 30 December 2008, the Patriarch of Ethiopia Abune Paulos was awarded the Order of St. Thomas by Catholicos Baselios Marthoma Didymos I at Parumala Seminary. During his visit to India, Abune Paulos was also the chief guest at the centenary celebrations of Mar Gregorios Orthodox Christian Student Movement (MGOCSM).\n5. Aram I Keshishian, Armenian Catholicos of Cilicia (2010)\nOn 27 February 2010, the Armenian Catholicos of Cilicia Aram I Keshishian was awarded the Order of St. Thomas by Catholicos Baselios Marthoma Didymos I at Kolencherry St. Peter's College auditorium. The dignitaries who were present at the public meeting included Union Minister K. V. Thomas, Catholicos Designate  Paulos Mar Milithios, Philipos Mar Chrysostom of Mar Thoma Church, Yohannan Yosef of Chaldean Church, Dr. Yakub Mar Irenios, Dr. Thomas Mar Athanasius, Dr. Mathews Mar Severios, Yuhanon Mar Polycarpos, Armenian Archbishop Sebo Sarkesian, Armenian bishop Nareg Alemisian, Rev. Mesros Sarkesian and Priest Trustee Johns Abraham Konat among others.\n6. Abune Mathias, Patriarch of Ethiopia (2016)\nOn 24 November 2016, the Patriarch of Ethiopia Abune Mathias was awarded the Order of St. Thomas by Catholicos Baselios Marthoma Paulos II at the chapel of Orthodox Theological Seminary (Old Seminary), Kottayam. Abune Mathias was the chief guest for the bicentennial memorial feast of Pulikkottil Joseph Mar Dionysius I who established the Old Seminary in 1815 and the twentieth memorial feast of renowned theologian and philosopher Paulos Mar Gregorios.\nReferences"
    }
  ]
}