{
  "content": [
    {
      "type": "text",
      "text": "# Oregon Republican Party\n\n| chairperson      = Connie Whelchel\n| foundation       = 1857\n| membership_year  = 2025\n| membership       = 738,200\n| ideology         = Conservatism\n| seats1_title     = U.S. Senate delegation\n| seats1           = }}\n| seats2_title     = U.S. House delegation\n| seats2           = }}\n| seats3_title     = Statewide offices\n| seats3           = }}\n| seats4_title     = Oregon Senate\n| seats4           = }}\n| seats5_title     = Oregon House\n| seats5           = }}\n| colors           = }} Red\n| national         = Republican Party\n| headquarters     = 752 Hawthorne Ave NE, Salem, OR 97301\n| website          =\n| state            = Oregon\n| footnotes        =\n| symbol           =\n}}\nThe Oregon Republican Party is the state affiliate of the United States Republican Party in Oregon, headquartered in Salem. The party was established in the Oregon Territory in February 1857 as the \"Free State Republican Party of Oregon\" and held its first state convention on April 1, 1859, after Oregon achieved statehood.\nThe Republican Party was the dominant political organization in the state of Oregon from the time of the American Civil War through the 1960s, before moving to a position of approximate parity with the rival Democratic Party of Oregon for the next four decades. Since 2000, the Oregon Republican Party has become a minority party in state government, which has generally been controlled by Democrats. Oregon Republican currently control just 1 out of 6 U.S. House seats, no statewide offices, and minorities in the state legislature.\nIn recent years, the Oregon Republican Party has been the subject of significant controversy regarding the increasing influence of far-right organizations and militias within the party, especially during the first presidency of Donald Trump. The party received national attention and widespread criticism for its efforts to overturn the 2020 United States presidential election, and its resolution claiming the 2021 United States Capitol attack was a false flag operation.\nHistory\nAntislavery origins\nThe politics of the Oregon Territory were largely dominated by the generally states' rights Democratic Party with a vocal pro-slavery component. Only weak opposition came from the Whigs and their nativist Know Nothing cousins. A serious opposition first began to emerge in the aftermath of the bitter and costly Rogue River Wars of 1855 to 1856, centered around the growing anti-slavery sentiment nationally and the increasing threat that the Democratic Party would hasten the expansion of slavery in Oregon. Opposition to the Democrats gradually coalesced around the fledgling Republican Party that was intent upon slavery's limitation.\nA first convention of Republicans in Oregon was held in May 1856 at the Lindley schoolhouse in Jackson County, with the gathering called for the nomination of candidates to appear on the June 1856 territorial ballot. The convention also adopted a resolution declaring that while Congress had no power over the existence of slavery in states in which it already existed, outside of such state jurisdictions federal power should be exerted to prevent its introduction.\nThroughout 1856, antislavery sentiment continued to grow in Oregon, with Republican clubs springing up around the state. Republican county conventions were held in Clackamas, Washington, Marion, Linn, and possibly one or two other locales around the state. Representatives of these county gatherings were then assembled at a territorial organizing convention held in Albany on February 11, 1857, which adopted the official name \"Free State Republican Party of Oregon\" for the organization. A platform for the new political party was announced, emphasizing the indissoluble nature of the United States, opposition of the expansion of slavery to free territory, prohibition of polygamy, construction of a Pacific railroad to link Oregon with California, government effort to improve the navigability of rivers and harbors, and admission of Oregon to the United States only as a free state.\nThe year 1857 was marked by preparations for future Oregon statehood, including the holding of a constitutional convention, and the ruling Democratic Party found itself divided over the question of slavery, attempting to sidestep the issue by passing in state convention a resolution binding Democratic delegates to such a gathering to the position that the matter of slavery in Oregon be settled later by a vote of the people.\nThe Republicans did not nominate a candidate for Representative to Congress in the June 1857 election, instead pooling their support for G.W. Lawson, a Free Soil Democrat running as an independent. While pro-slavery Democrat Joseph Lane was ultimately sent as the Territorial delegate to Congress, voting further down the ticket showed a Republican advance, with Republicans joining with so-called \"soft\" (free state) Democrats to elect about a third of the delegates to the constitutional convention and 10 of the 30 members to the Oregon Territorial Legislature.\nThe constitutional convention held in the summer of 1857 ultimately steamrolled Republican sentiment and again sidestepped the slavery question by deciding to leave the slavery question to a vote of the people, while declaring that \"no negro, Chinaman, or mulatto should have the right to vote.\" The bill of rights adopted by the Democratic-dominated constitutional convention gave the future state legislature the right to exclude African Americans from immigrating to the state altogether, thereby setting the stage for restrictive racial laws in spite of Oregon's free state status.\nThree propositions were ultimately put to territorial voters, with the Democratic-authored Oregon Constitution gaining approval by a vote of about 7,200 to 3,100, a measure allowing slavery falling to defeat by a majority of nearly 5,100 votes, and a proposal allowing \"Free Negroes\" to settle in Oregon overwhelmingly defeated by a vote of 8,640 to 1,081. Oregon would not be a slave state but rather one closed to black immigration — a law remaining on the books (albeit not in actual effect) into the 20th century.\n19th century\n(1811–1861), the first Oregon Republican elected to the U.S. Senate, was an early casualty fighting for the Union in the American Civil War.]]On April 1, 1859, just two weeks after Oregon was admitted to the Union, the Republican Party held a convention in Salem at which it nominated David Logan as the party's choice for the state's first fully fledged Congressional representative. Logan would narrowly fall to defeat both in 1859 and again when nominated again for a full term in the election of 1860, but national political events would soon change the tide for the new political party. The Democratic Party found itself divided with the coming of the American Civil War between pro- and anti-Union elements. With the nation embroiled in war, pro-Union Democrats and Republicans put aside their differences at a fusion convention in April 1862, establishing themselves as the Union Party. This joint political organization would continue in Oregon through four elections under the Union Party banner, terminating only in 1868.\nAs the united political organization for a preserved United States of America in contradistinction to defeatists and Confederate sympathizers, the Union Party and, after 1868, the rechristened Republican Party experienced dramatic political gains in Oregon, buoyed by the defection and disenfranchisement of the Democratic South. The party, as one historian noted, began to \"grow like the plant that sprang up from the mustard seed.\" An alliance of Republicans and pro-Union Democrats in the Oregon State Legislature came together in 1860 to elect Edward Dickinson Baker as the first Republican U.S. Senator from Oregon. An era of Republican dominance in Oregon was begun.\nWhen the Civil War began in 1861, Baker raised his own militia, in which he served as commanding officer. On October 21, 1861, with Congress out of session, Colonel Baker and his men met Confederate forces on a hill called Ball's Bluff just outside Washington, D.C. Shortly after the battle started Baker was killed along with nearly 1,000 others.\nDespite the untimely death of Oregon's first Senator, E.D. Baker would hardly be the last. Over the next 30 years a steady stream of Republicans were sent to the U.S. Senate by the Oregon legislature, including Benjamin F. Harding (1862), George H. Williams (1864), Henry W. Corbett (1866), John H. Mitchell (1872, reappointed 1885, re-elected 1887 and 1891), Joseph N. Dolph (1882, re-elected 1889), and George W. McBride (1895).\nBy the 1890s, the ideology of the two major parties had begun to switch, with the Republican Party emerging as the party of sound money, industry and commerce, protective tariffs, and expansionist foreign policy.\n20th century\n(1874–1944) sat in the halls of the U.S. Senate for 25 years during the first half of the 20th century.|left]]The early 20th century saw a period of significant Republican leadership in Oregon. The Republican Party controlled the Governor's office from 1939 to 1957 with multiple Governors throughout other parts of the century as well. (1922–2011) was the face of the Oregon Republican Party for a generation.]]In 1918, Charles McNary was appointed to serve as a United States Senator after the death of Harry Lane. Frederick Mulkey was elected to serve the remainder of the term, serving for approximately one month, when McNary was elected to a full term. He was re-elected 4 times, serving a total of 25 years. In the Senate, McNary served as Chair of the Senate Agriculture Committee from 1926 to 1933, and then Minority Leader from 1933 to 1944. McNary helped pass legislation that led to the construction of the Columbia River's Bonneville Dam, and supported much of the New Deal. McNary was also the Republican Party's vice presidential nominee in the 1940 election, as Wendell Willkie's running mate.\nMcNary was the longest serving Senator in Oregon's history until surpassed by fellow Republican Mark Hatfield, who served from 1967 to 1997. Hatfield served as Chair of the Senate Appropriations Committee twice, and was also Governor of Oregon before his time in the Senate, from 1959 to 1967.\n(1913–1983) is considered one of Oregon's most influential Governors.]]\nIn 1967, Tom McCall was elected Governor of Oregon. McCall is considered one of Oregon's most influential Governors. McCall was a staunch environmentalist and an advocate of sustainable development. He is notable for passing the Oregon Bottle Bill, America's first container-deposit legislation, as well as the Oregon Beach Bill which established public ownership of land along the Oregon Coast from the water up to sixteen vertical feet above the low tide mark. McCall served until 1975.\nVictor Atiyeh served as Oregon's last Republican Governor, from 1979 to 1987. Republicans maintained both US Senate seats until 1995, and kept one until 2009.\n21st century\nwas Oregon's last Republican US Senator, serving until 2008.]]\nGerald Ford, the 38th president (1974–1977)Oregon Republicans controlled the State House of Representatives from 1991 until 2006. The house was split in 2005, with both parties creating a power-sharing agreement with both parties choosing a Co-Speaker, and all committees and chairmanships split evenly between the parties. The Senate was controlled by the Republicans from 1995 until 2002. The next session was split, with a similar power-sharing agreement created in the Senate.\nIn 2008, US Senator Gordon H. Smith was defeated by Democrat Jeff Merkley. Smith is the most recent Republican to serve in the US Senate. Since 2000, the Republicans have only held one statewide office, the Secretary of State, which was held by Dennis Richardson from 2017 to 2019, and then Bev Clarno, who finished Richardson's term due to his death while in office.\nTrump era\nserved as chairman of the National Republican Congressional Committee and also chaired the House Energy and Commerce Committee.|201x201px]]\nThe Oregon Republican Party gained national attention in June 2019 when all 11 Republican state senators staged a \"walkout\" designed to prevent a vote on Oregon House Bill 2020.  The walkout deepened the alignment of the party with right-wing militias, including Oregon 3 Percenters and Oath Keepers as well as pro-Trump social media.  State Senator Brian Boquist threatened, in response to the state government's efforts to return him to the state capitol in Salem, \"send bachelors and come heavily armed.\" According to the Pew Charitable Trusts, \"rare walkouts are ones like that in Oregon, where lawmakers flee the state for several weeks or months. These large events use a lot of political capital and show voters that those lawmakers might be sore losers and unwilling to negotiate.\"  Oregon Republicans continued such \"walkouts\" in 2021 to protest coronavirus restrictions and disable normal political processes, as well as organized groups to harass state inspectors doing their lawful work.\nEfforts to overturn the 2020 election\nFollowing the 2021 storming of the United States Capitol, Oregon Republicans again received national attention. On 21 December 2020, an armed group had forcibly entered the Oregon Capitol, caused damage, and sprayed “some kind of chemical agent” at the officers guarding the capitol.  Police identified the chemical agent as \"bear spray.\"  The capitol break-in was promoted by the far-right Patriot Prayer. In January 2021, evidence came to light that Representative Mike Nearman had opened doors to the Oregon Capitol \"allowing violent demonstrators who were protesting immediately outside the door to illegally enter the building\" and cause damage.  The militia-inflamed \"chaos in Oregon over the past year [was] a prologue to the insurrection at the U.S Capitol,\" in one account.  At least three \"men who participated to storm the Oregon Capitol on December 21st also appear to have been part of the mob that stormed the U.S. Capitol\" in January.  Also among the Oregonians arrested for the US Capitol attack was the vice chair of the Young Republicans of Oregon.\n\"The Trump era seems only to have exacerbated the Oregon GOP’s embrace of its most extreme constituencies,\" writes the conservative National Review.\nOn January 19, 2021, the Oregon Republican Party issued a resolution declaring that the 2021 storming of the United States Capitol by supporters of Donald Trump was a \"false flag\" event meant to \"discredit President Trump, his supporters, and all conservative Republicans.\" Others had previously claimed antifa had staged the attack, though the FBI stated there was no evidence of antifa involvement.\nThe party resolution provoked substantial controversy. Oregon's House Republicans pointedly disavowed the party resolution, and State Senator Tim Knopp stated publicly that he did \"not support the Oregon Republican Party’s resolution.\" Knute Buehler, a former Oregon House member and recent Republican gubernatorial nominee, \"filed to change his registration from Republican to independent.\" State Senator Brian Boquist also left the party and joined the Independent Party of Oregon.\nMore than 6,000 Republicans left the party in January 2021. In early February, state voter registration indicates a total of 11,000 registered Republicans in Oregon have left the party since Election Day.\nThe 2021–2023 leadership term saw significant officer turnover. Dallas Heard, an Oregon State Senator serving as the chairman of the party, resigned in 2022 after severe internal disagreements with party members. Senator Heard was succeeded as Chair first by Josephine County Commissioner Herman Baertschiger Jr., then restaurateur Justin Hwang. Following resignations, National Committeewoman Chris Barreto was replaced by former ORP Vice Chair Tracy Honl, while Treasurer Dennis Linthicum, State Senator from Klamath Falls, was replaced by Sodaville city manager Alex McHaddad. Dr. Angela Plowhead was elected Vice Chair in September 2022.\nPlatform\nThe party's formal platform, adopted in 2015, expresses opposition to abortion and assisted suicide; support for mandatory minimum sentencing for violent offenders, truth-in-sentencing laws, and the death penalty; lower taxes; deregulation and minimal government intervention in the economy; opposition to same-sex marriage; repeal of the Patient Protection and Affordable Care Act; opposition for \"amnesty\" for undocumented immigrants; an individual right to keep and bear arms; and voter ID laws. The party's platform, amended in 2019, includes opposition to National Popular Vote Interstate Compact, advocacy of the arming of educational staff \"to protect themselves and their students from violence\" while opposing gun-free zones; asserting that \"marriage is between one man and one woman\" and that \"there are only two sexes, male and female, based on a person’s biological sex at birth\"; favoring that \"all government business shall be conducted in English\"; continuing repeal of Obamacare; asserting that \"violent, radical, Islamic Jihadists and other groups have . . . declared war on America\"; and \"need for personal responsibility and self-reliance in the event of a disaster.\"\nAt the beginning of the 2022 legislative short session, the house republican caucus announced that they would use the session to \"fix failures from Democratic leadership by restoring education standards, holding state government accountable and enabling our law enforcement to do its job. We will push to remove roadblocks to health care access and preserve Oregon’s natural environment while protecting the way of life of communities relying on these resources. We will give Oregonians the freedom to recover financially from government-mandated shutdowns by fighting the state’s regulatory burdens and mandates.\"\nThe caucus fought to terminate the state of emergency related to COVID-19, and amend the Oregon Constitution to limit the declaration of an emergency to 30 days.\nPast elections\nPresidents\nRepublican nominees won 25 of Oregon's 32 Presidential popular votes from 1860 to 1984. Since 1988 the Democratic presidential nominee has won 8 straight popular votes.\nGovernance\nThe party is run by an elected state Leadership Team.\n{| class=\"wikitable\"\n!Office\n!Office-holder\n|-\n|Chairman\n|Connie Whelchel\n|-\n|Vice Chairman\n|Vacant\n|-\n|Secretary\n|Sheri Brady\n|-\n|Treasurer\n|Glenn Miller\n|-\n|National Committeeman\n|Dan Mason\n|-\n|National Committeewoman\n|Tracy Honl\n|}\nCounty parties\nEach of Oregon's 36 counties has semi-autonomous county leadership teams. They are elected by precinct committee members who in turn are elected by all Republicans in a specific precinct.\nParty Chairs\n{| class=\"wikitable sortable\"\n!Name\n!Year\n!County of residence\n!Profession\n|-\n|Kevin Mannix\n|2003–2005\n|Marion County\n|Politician, Activist\n|-\n|Vance Day\n|2005–2009\n|Marion County\n|Attorney\n|-\n|Bob Tiernan\n|2009–2011\n|Clackamas County\n|Politician\n|-\n|Allen Alley\n|2011–2013\n|Clackamas County\n|Politician\n|-\n|Suzanne Gallagher\n|2013\n|Washington County\n|Interior designer, Business owner, Activist\n|-\n|Art Robinson\n|2013–2015\n|Josephine County\n|Scientist, Politician\n|-\n|Bill Currier\n|2015–2021\n|Benton County\n|Politician\n|-\n|Dallas Heard\n|2021–2022\n|Douglas County\n|Politician\n|-\n|Herman Baertschiger Jr.\n|2022\n|Josephine County\n|Politician\n|-\n|Justin Hwang\n|2022–2025\n|Multnomah County\n|Businessperson\n|-\n|Jerry Cummings\n|2025\n|Columbia County\n|Pastor\n|-\n|Connie Whelchel\n|2025–present\n|Deschutes County\n|Businessperson\n|}\nCurrent elected officials\nMembers of Congress\nU.S. Senate\n* None\nBoth of Oregon's U.S. Senate seats have been held by Democrats since 2009. Gordon H. Smith was the last Republican to represent Oregon in the U.S. Senate. Elected in 1996, Smith lost his second re-election attempt in 2008 to Jeff Merkley who has held the seat since.\nThe Oregon Republican Party holds one of the state's six U.S. House seats.\nU.S. House of Representatives\nOut of the six seats Oregon is apportioned in the U.S. House of Representatives, one is held by a Republican:\n{| class=\"wikitable sortable\"\n|+\n!District\n!Member\n!Photo\n|-\n|2nd\n|\n|\n|}\nStatewide offices\n* None\nOregon has not had a Republican in statewide office since 2021 after the retirement of Secretary of State Bev Clarno and the election of Democrat Shemia Fagan to replace her. Clarno replaced Dennis Richardson, the last Republican to be elected to a statewide office in Oregon, upon his death from brain cancer in 2019.\nState legislators\nThe Oregon Republican Party holds 24 of 60 seats in the Oregon House of Representatives and 12 of the 30 Oregon Senate seats.\nThe Democratic Party of Oregon has a supermajority in both chambers. However, Democrats do not have the 20 seats that would be required to achieve quorum without bipartisan cooperation in the Senate, as a 2/3 quorum is required.\nSenate\n{| class=\"wikitable\"\n! District !! Home !! Senator !! Party\n|-\n| 1 || Port Orford|| David Brock Smith ||  | Republican\n|-\n| 2 || Cave Junction|| Noah Robinson ||  | Republican\n|-\n| 5 || Lincoln City|| Dick Anderson ||  | Republican\n|-\n| 6 || Fall Creek|| Cedric Ross Hayden ||  | Republican\n|-\n| 9 || Stayton|| Fred Girod ||  | Republican\n|-\n| 11 || Keizer|| Kim Thatcher ||  | Republican\n|-\n| 12 || Dundee|| Bruce Starr ||  | Republican\n|-\n| 16 || Tillamook|| Suzanne Weber ||  | Republican\n|-\n| 26 || The Dalles|| Daniel Bonham ||  | Republican\n|-\n| 28 || Klamath Falls|| Diane Linthicum ||  | Republican\n|-\n| 29 || Enterprise|| Todd Nash ||  | Republican\n|-\n| 30 || Powell Butte|| Mike McLane ||  | Republican\n|}\nHouse of Representatives\n{| class=\"wikitable\"\n! District !! Home !! Representative !! Party\n|-\n| 1 || Gold Beach || Court Boice ||  | Republican\n|-\n| 2 || Roseburg || Virgle Osborne ||  | Republican\n|-\n| 3 || Grants Pass || Dwayne Yunker ||  | Republican\n|-\n| 4 || Canyonville || Alek Skarlatos ||  | Republican\n|-\n| 6 || Medford || Kim Wallan ||  | Republican\n|-\n| 9 || Coos Bay || Boomer Wright ||  | Republican\n|-\n| 11 || Lebanon || Jami Cate ||  | Republican\n|-\n| 12 || McKenzie Bridge || Darin Harbick ||  | Republican\n|-\n| 15 || Albany || Shelly Boshart Davis ||  | Republican\n|-\n| 17 || Scio || Ed Diehl ||  | Republican\n|-\n| 18 || Silverton || Rick Lewis ||  | Republican\n|-\n| 21 || Salem || Kevin Mannix ||  | Republican\n|-\n| 23 || Amity || Anna Scharf ||  | Republican\n|-\n| 24 || McMinnville || Lucetta Elmer ||  | Republican\n|-\n| 31 || Banks || Darcey Edwards ||  | Republican\n|-\n| 32 || Tillamook || Cyrus Javadi ||  | Republican\n|-\n| 51 || Canby || Christine Drazan ||  | Republican\n|-\n| 52 || Hood River || Jeff Helfrich ||  | Republican\n|-\n| 55th || Klamath Falls || E. Werner Reschke ||  | Republican\n|-\n| 56 || Eagle Point || Emily McIntire ||  | Republican\n|-\n| 57 || Heppner || Greg Smith ||  | Republican\n|-\n| 58 || Echo || Bobby Levy ||  | Republican\n|-\n| 59 || Prineville || Vikki Breese-Iverson ||  | Republican\n|-\n| 60 || Crane || Mark Owens ||  | Republican\n|}\nMayors\nOf the state's ten largest cities, one has a Republican mayor as of 2023:\n* Medford (8): Randy Sparacino\nElection results\nPresidential\n{| class=\"wikitable\"\n|+Oregon Republican Party presidential election results\n!Election\n!Presidential ticket\n!Votes\n!Vote %\n!Electoral votes\n!Result\n|-\n|1860\n|Abraham Lincoln/Hannibal Hamlin\n|5,344\n|36.20%\n|}}\n|\n|-\n|1864\n|Abraham Lincoln/Andrew Johnson\n|9,888\n|53.90%\n|}}\n|\n|-\n|1868\n|Ulysses S. Grant/Schuyler Colfax\n|10,961\n|49.63%\n|}}\n|\n|-\n|1872\n|Ulysses S. Grant/Henry Wilson\n|11,818\n|58.66%\n|}}\n|\n|-\n|1876\n|Rutherford B. Hayes/William A. Wheeler\n|15,214\n|50.92%\n|}}\n|\n|-\n|1880\n|James A. Garfield/Chester A. Arthur\n|20,619\n|50.51%\n|}}\n|\n|-\n|1884\n|James G. Blaine/John A. Logan\n|26,860\n|50.99%\n|}}\n|\n|-\n|1888\n|Benjamin Harrison/Levi P. Morton\n|33,291\n|53.82%\n|}}\n|\n|-\n|1892\n|Benjamin Harrison/Whitelaw Reid\n|35,002\n|44.59%\n|}}\n|\n|-\n|1896\n|William McKinley/Garret Hobart\n|48,779\n|50.07%\n|}}\n|\n|-\n|1900\n|William McKinley/Theodore Roosevelt\n|46,172\n|55.46%\n|}}\n|\n|-\n|1904\n|Theodore Roosevelt/Charles W. Fairbanks\n|60,455\n|67.06%\n|}}\n|\n|-\n|1908\n|William Howard Taft/James S. Sherman\n|62,530\n|56.39%\n|}}\n|\n|-\n|1912\n|William Howard Taft/Nicholas M. Butler\n|34,673\n|25.30%\n|}}\n|\n|-\n|1916\n|Charles E. Hughes/Charles W. Fairbanks\n|126,813\n|48.47%\n|}}\n|\n|-\n|1920\n|Warren G. Harding/Calvin Coolidge\n|143,592\n|60.20%\n|}}\n|\n|-\n|1924\n|Calvin Coolidge/Charles G. Dawes\n|142,579\n|51.01%\n|}}\n|\n|-\n|1928\n|Herbert Hoover/Charles Curtis\n|205,341\n|64.18%\n|}}\n|\n|-\n|1932\n|Herbert Hoover/Charles Curtis\n|136,019\n|36.88%\n|}}\n|\n|-\n|1936\n|Alf Landon/Frank Knox\n|122,706\n|29.64%\n|}}\n|\n|-\n|1940\n|Wendell Willkie/Charles L. McNary\n|219,555\n|45.62%\n|}}\n|\n|-\n|1944\n|Thomas E. Dewey/John W. Bricker\n|225,365\n|46.94%\n|}}\n|\n|-\n|1948\n|Thomas E. Dewey/Earl Warren\n|260,904\n|49.78%\n|}}\n|\n|-\n|1952\n|Dwight D. Eisenhower/Richard Nixon\n|420,815\n|60.54%\n|}}\n|\n|-\n|1956\n|Dwight D. Eisenhower/Richard Nixon\n|406,393\n|55.21%\n|}}\n|\n|-\n|1960\n|Richard Nixon/Henry Cabot Lodge Jr.\n|408,060\n|52.56%\n|}}\n|\n|-\n|1964\n|Barry Goldwater/William E. Miller\n|282,779\n|35.96%\n|}}\n|\n|-\n|1968\n|Richard Nixon/Spiro Agnew\n|408,433\n|49.83%\n|}}\n|\n|-\n|1972\n|Richard Nixon/Spiro Agnew\n|486,686\n|52.45%\n|}}\n|\n|-\n|1976\n|Gerald Ford/Bob Dole\n|492,120\n|47.78%\n|}}\n|\n|-\n|1980\n|Ronald Reagan/George H. W. Bush\n|571,044\n|48.33%\n|}}\n|\n|-\n|1984\n|Ronald Reagan/George H. W. Bush\n|685,700\n|55.91%\n|}}\n|\n|-\n|1988\n|George H. W. Bush/Dan Quayle\n|560,126\n|46.61%\n|}}\n|\n|-\n|1992\n|George H. W. Bush/Dan Quayle\n|475,757\n|32.53%\n|}}\n|\n|-\n|1996\n|Bob Dole/Jack Kemp\n|538,152\n|39.06%\n|}}\n|\n|-\n|2000\n|George W. Bush/Dick Cheney\n|713,577\n|46.52%\n|}}\n|\n|-\n|2004\n|George W. Bush/Dick Cheney\n|866,831\n|47.19%\n|}}\n|\n|-\n|2008\n|John McCain/Sarah Palin\n|738,475\n|40.40%\n|}}\n|\n|-\n|2012\n|Mitt Romney/Paul Ryan\n|754,175\n|42.15%\n|}}\n|\n|-\n|2016\n|Donald Trump/Mike Pence\n|782,403\n|39.09%\n|}}\n|\n|-\n|2020\n|Donald Trump/Mike Pence\n|958,448\n|40.37%\n|}}\n|\n|-\n|2024\n|Donald Trump/JD Vance\n|919,480\n|40.97%\n|}}\n|\n|}\nGubernatorial\n{| class=\"wikitable\"\n|+Oregon Republican Party gubernatorial election results\n!Election\n!Gubernatorial candidate\n!Votes\n!Vote %\n!Result\n|-\n|1858\n|Endorsed E. M. Barnum (Democratic)\n|N/A\n|N/A\n|Did not run\n|-\n|1862\n|A. C. Gibbs\n|7,039\n|67.11%\n|Won\n|-\n|1866\n|George Lemuel Woods\n|10,316\n|50.68%\n|Won\n|-\n|1870\n|Joel Palmer\n|11,095\n|48.62%\n|Lost\n|-\n|1874\n|J. C. Tolman\n|9,163\n|36.06%\n|Lost\n|-\n|1878\n|Cornelius C. Beekman\n|15,610\n|47.69%\n|Lost\n|-\n|1882\n|Zenas Ferry Moody\n|21,481\n|51.75%\n|Won\n|-\n|1886\n|Thomas R. Cornelius\n|24,199\n|44.13%\n|Lost\n|-\n|1890\n|David P. Thompson\n|33,765\n|46.45%\n|Lost\n|-\n|1894\n|William Paine Lord\n|41,139\n|47.23%\n|Won\n|-\n|1898\n|Theodore Thurston Geer\n|45,094\n|53.22%\n|Won\n|-\n|1902\n|W. J. Furnish\n|41,611\n|45.9%\n|Lost\n|-\n|1906\n|James Withycombe\n|43,508\n|44.99%\n|Lost\n|-\n|1910\n|Jay Bowerman\n|48,751\n|41.42%\n|Lost\n|-\n|1914\n|James Withycombe\n|121,037\n|48.80%\n|Won\n|-\n|1918\n|James Withycombe\n|81,067\n|52.99%\n|Won\n|-\n|1922\n|Ben W. Olcott\n|99,164\n|42.64%\n|Lost\n|-\n|1926\n|I. L. Patterson\n|120,073\n|53.14%\n|Won\n|-\n|1930\n|Phil Metschan Jr.\n|46,480\n|18.83%\n|Lost\n|-\n|1934\n|Joe E. Dunne\n|86,923\n|28.73%\n|Lost\n|-\n|1938\n|Charles A. Sprague\n|214,062\n|57.41%\n|Won\n|-\n|1942\n|Earl Snell\n|220,188\n|77.87%\n|Won\n|-\n|1946\n|Earl Snell\n|237,681\n|69.06%\n|Won\n|-\n|1948 (special)\n|Douglas McKay\n|271,295\n|53.23%\n|Won\n|-\n|1950\n|Douglas McKay\n|334,160\n|66.05%\n|Won\n|-\n|1954\n|Paul L. Patterson\n|322,522\n|56.91%\n|Won\n|-\n|1956 (special)\n|Elmo Smith\n|361,840\n|49.48%\n|Lost\n|-\n|1958\n|Mark Hatfield\n|331,900\n|55.32%\n|Won\n|-\n|1962\n|Mark Hatfield\n|345,497\n|54.20%\n|Won\n|-\n|1966\n|Tom McCall\n|377,346\n|55.26%\n|Won\n|-\n|1970\n|Tom McCall\n|369,964\n|55.52%\n|Won\n|-\n|1974\n|Victor G. Atiyeh\n|324,751\n|42.14%\n|Lost\n|-\n|1978\n|Victor G. Atiyeh\n|498,452\n|54.90%\n|Won\n|-\n|1982\n|Victor G. Atiyeh\n|639,841\n|61.41%\n|Won\n|-\n|1986\n|Norma Paulus\n|506,989\n|47.85%\n|Lost\n|-\n|1990\n|David Frohnmayer\n|444,646\n|40.0%\n|Lost\n|-\n|1994\n|Denny Smith\n|517,874\n|42.41%\n|Lost\n|-\n|1998\n|Bill Sizemore\n|334,001\n|30.01%\n|Lost\n|-\n|2002\n|Kevin Mannix\n|581,785\n|46.16%\n|Lost\n|-\n|2006\n|Ron Saxton\n|589,748\n|42.75%\n|Lost\n|-\n|2010\n|Chris Dudley\n|694,287\n|47.76%\n|Lost\n|-\n|2014\n|Dennis Richardson\n|648,542\n|44.13%\n|Lost\n|-\n|2016 (special)\n|Bud Pierce\n|845,609\n|43.45%\n|Lost\n|-\n|2018\n|Knute Buehler\n|814,988\n|43.65%\n|Lost\n|-\n|2022\n|Christine Drazan\n|850,347\n|43.05%\n|Lost\n|}\nSee also\n* Dorchester Conference\nFootnotes\nFurther reading\n* Tom McCall with Steve Neal, Tom McCall, Maverick: an Autobiography. Portland, OR; Binford and Mort, 1977.\n* Steve Neal, McNary of Oregon: A Political Biography. Portland, OR: Oregon Historical Society Press, 1985.\n* Brent Walth, ''Fire at Eden's Gate: Tom McCall & the Oregon Story. Portland, OR: Oregon Historical Society Press, 1994.\n* [https://archive.org/details/republicanleagu00goog Republican League Register, a Record of the Republican Party in the State of Oregon.''] Portland, OR: Register Publishing Co., 1896.\nExternal links\n*[https://oregon.gop/ Oregon Republican Party Website]\n*[http://oregon.crnc.org/ Oregon Federation of College Republicans]"
    }
  ]
}