{
  "content": [
    {
      "type": "text",
      "text": "# Organization of Black American Culture\n\nThe Organization of Black American Culture (OBA-C) (pronounced Oh-bah-see) was conceived during the era of the Civil Rights Movement by Hoyt W. Fuller as a collective of African-American writers, artists, historians, educators, intellectuals, community activists, and others. The group was originally known as Committee for the Arts (CFA), which formed in February 1967 in Southside Chicago, Illinois. By May 1967, the group became OBAC and included Black intellectuals Hoyt W. Fuller (editor of Negro Digest), the poet Conrad Kent Rivers, and Gerald McWorter (later Abdul Alkalimat). OBAC aimed to coordinate artistic support in the struggle for freedom, justice and equality of opportunity for African Americans. The organization had workshops for visual arts, drama, and writing, and produced two publications: a newsletter, Cumbaya, and the magazine Nommo.\nBackground\nAs noted in Jonathan Fenderson's book Building the Black Arts Movement: Hoyt Fuller and the Cultural Politics, it was in the winter of 1966, when Hoyt W. Fuller, Gerald McWorter (later Abdul Alkalimat), and Conrad Kent Rivers began meeting and \"reading books, debating concepts, exchanging ideas\" at Fuller's Lake Meadow apartment at 3001 South Parkway Avenue, Chicago, Illinois. From these meetings, the members formed Committee for the Arts (CFA).\nAs recalled by Ann (McNeil) Smith, who would become director of OBAC Drama Workshop, it was not until a meeting in her and Duke McNeil's apartment in the fall of 1967 that Jeff Donaldson suggested that the group change its name to Organization of Black American Culture (OBAC). According to Fuller, OBAC, pronounced o-ba-see, was meant to \"echo the yoruba word oba, denoting loyalty and leadership\". The name, an acronym OBAC, chosen by Jeff Donaldson, was inspired by the Yoruba word Oba, meaning chief or leader. Some of their initial public gatherings were hosted by Margaret Burroughs at the South Side Community Art Center.\nOBAC members and governance\nMembers and governance of OBA-C during its inauguration were: Gerald McWorter, chairman; Hoyt W. Fuller, vice chairman; Joseph R. Simpson, secretary, Ernest (Duke) McNeil, treasurer; Jeff R. Donaldson; George R. Ricks; Donald H. Smith; Ronald C. Dunham; Bennett J. Johnson and Conrad Kent Rivers, all of whom were part of the Executive Council.\nFounding purpose and mission\nAs reflected in the organization's documents, OBA-C's purpose and mission were:\n* To work toward the ultimate goal of bringing the Black Community indigenous art forms which reflect and clarify the Black Experience in America;\n* To reflect the richness and depth and variety of Black History and Culture;\n* To provide the Black Community with a positive self image of itself, its history, its achievements, and its possibility for creativity.\nOBAC workshops\nWriters Workshop\nAmong those associated at various times with the OBAC Writers Workshop are founding member Don L. Lee (now Haki Madhubuti), Carolyn Rodgers, Angela Jackson, Sterling Plumpp, Sam Greenlee, Nikki Giovanni, Sonia Sanchez, Johari Amini, D. L. Crockett-Smith, Cecil Brown, Sandra Jackson-Opoku, and other writers of national stature.\nDrama Workshop\nDr. Ann Smith, then Anne McNeil, wife of OBAC treasurer Ernest Duke McNeil, founded OBAC's drama workshop with the support of actors Bill Eaves, Len Jones, Harold Lee, Clarence Taylor. OBAC Drama Workshop eventually led to the first black theater in Chicago, Kuumba Theater.\nVisual Arts Workshop\nIn 1967, members of the OBAC's visual arts workshop produced Wall of Respect, a mural dedicated to African-American heroes such as Muhammad Ali, W. E. B. Du Bois, and Malcolm X. The artists involved in the mural project included William Walker, Wadsworth Jarrell and Jeff Donaldson, who has written of the collective's determination to produce a \"collaborative work as a contribution to the community\". Donaldson went on to found the Coalition of Black Revolutionary Artists (COBRA), later renamed the African Commune of Bad Relevant Artists (AfriCOBRA) in support of Pan-Africanism.\nParticipating artists\nAs noted in the Negro Digest, a key question posed to all its workshop artists wasffender: \"Do you consider yourself a Black Artist, or an American Artist who happens to be black?\"\nActors and directors\n* Bill Eaves\n* Len Jones\n* Harold Lee\n* Clarence Taylor\nArtists\n* Jeff Donaldson\n*Wadsworth Jarrell\n* William Walker\nPoets and writers\n*Johari Amini\n*Cecil Brown\n*D. L. Crockett-Smith\n*Nikki Giovanni\n*Sam Greenlee\n*Angela Jackson\n*Sandra Jackson-Opoku\n*Don L. Lee (now Haki Madhubuti)\n*David Moore\n*Useni Eugene Perkins\n*Sterling Plumpp\n*Carolyn Rodgers\n*Sonia Sanchez\nMusicians\n* George R. Ricks\nDissolution and evolution\nAfter the visual arts and the drama workshops closed, OBAC became solely a writers' workshop within a couple of years, and continued in that form until 1992, surviving longer than any other literary group of the Black Arts Movement that flourished in the 1960s and 1970s. As S. Brandi Barnes, former treasurer and subsequently director of OBAC-Writers Workshop, wrote in 2010:\nBibliography\n* NOMMO: A Literary Legacy of Black Chicago (1987), edited by Carol A. Parks.\n* NOMMO2: Remembering Ourselves Whole\nSee also\n* AfriCOBRA\n* Black Arts Movement\nReferences"
    }
  ]
}