{
  "content": [
    {
      "type": "text",
      "text": "# Organization of World Heritage Cities\n\nThe Organization of World Heritage Cities (OWHC) is an international non-profit, non-governmental organization of 250 cities in which sites of the UNESCO World Heritage list are located. It was founded in 1993 in Fez, Morocco, during the second International Symposium of World Heritage Cities. The headquarters of the OWHC are located in Quebec City, Canada. Altogether the 250 member cities of the OWHC have a population of more than 130 million.\nHistory\nDuring the first International Symposium of World Heritage Cities in Québec City in 1991, the participating 41 cities adopted the Québec City Declaration. This declaration states the desire to build a network of World Heritage Cities.\nAt the second International Symposium of World Heritage Cities in Fez, Morocco, the OWHC was founded in 1993. 56 participating cities decided on the mission, goals and powers of the organisation. At the Founding General Assembly, the member cities elected the first Board of Directors and Secretary General.\nSince the first General Assembly, the member cities have been meeting every two years. Listed below are the years, locations and topics of the previous General Assemblies.\n* 1995 Bergen (Norway): Communication between World Heritage Cities\n* 1997 Evora (Portugal): Tourism and World Heritage – Challenges and Opportunities\n* 1999 Santago de Compostela (Spain): Innovation in the Management of World Heritage Cities\n* 2001 Puebla (Mexico): Prevention and Protection Measures for World Heritage Cities in Case of Disaster\n* 2003 Rhodes (Greece)\n* 2005 Cusco (Peru): Heritage of Humanity, Heritage with Humanity\n* 2007 Kazan (Russian Federation): Heritage and Economics\n* 2009 Quito (Ecuador): The revitalization of historic centres: how to involve all social actors?\n* 2011 Sintra (Portugal): World Heritage Cities and Climate Change\n* 2013 Oaxaca (Mexico): Heritage Cities, Sustainable Cities\n* 2015 Arequipa (Peru): World Heritage Cities, Resilent Cities\n* 2017 Ahmedabad  (India): World Heritage cities\n* 2017 Asmara (Eritrea): World Heritage cities, Africa's Modernest city\nOrganization\nAny city may become a member of the OWHC if it possesses the following two characteristics. Firstly the city has to be the location of a living urban fabric of historic or contemporary interest. Its outstanding universal value has been recognized by the UNESCO and therefore has been registered in the World Heritage List. Secondly the city has to adhere to the values of the OWHC.\nThe General Assembly is the paramount authority of the OWHC. In it the member cities are represented by their mayor. To be able to take part in the General Assembly and have the right to vote the city has to be a member in good standing (pay the annual membership fee). The General Assembly meets every two years. Special Assemblies may be called by members or the board of directors.\nAt the General Assembly the mayors discuss issues concerning the mission and objectives of the OWHC and formulate relevant recommendations to the board of directors. The Assembly guides the activities of the Organization, studies and approves the Organization's work program and controls the financial policy of the Organization.\nThe Board of Directors consists of eight mayors of members in good standing. It is elected by the General Assembly for two years. Directors may be elected two more times and therefore be directors for a maximum of six consecutive years. The Board of Directors meets at least once a year.\nAmong its duties are the implementation of the requests formulated and the resolutions adopted by the General Assembly and the planning of the organizations activities according to set up priorities. Furthermore, the Board of Directors examines the financial reports, authorizes the annual budget plan, prepares budget estimates and proposes their adoption to the general assembly. The Board of Directors also draws up the organization chart, the recruiting criteria and standards for the personnel of the General Secretariat and performs any other duty that could be assigned to it by the General Assembly. It is empowered to take all the measures required for the administration of the Organization and the attainment of its objectives.\nThe Board of Directors elects the President of the OWHC from among themselves. He is the chief executive officer of the OWHC and is tasked with the supervision, administration and management of the affairs of the Organization. He represents the OWHC at the national and international levels and binds the Organization in official acts.\nThe General Secretariat is headed by the Secretary General who is appointed by the General Assembly for a four-year term. He oversees the execution of mandates by the members, the day-to-day administration and personnel management and hiring. He also coordinates the activities of the OWHC, prepares the budget and the financial reports and ensures that the decisions of the board of directors and those of the members taken at the General Assembly are carried out.\nThe General Secretariat is supported in its duties by seven Regional Secretariats. They are groupings of cities that share cultural, linguistic or geographical affinities and/or have the same concerns and needs. Every member city of the OWHC is allowed to be part of one or more regions. The members of one region have to choose a city from among themselves as domicile for the Regional Secretariat, choose a Regional Coordinator and meet at least once a year. They serve as a link between the member cities of their particular region and the General Secretariat.\nThe seven Regional Secretariats are\n* Regensburg (Germany) for the North-West European Region\n* Budapest (Hungary) for the Central and Eastern European Region\n* Córdoba (Spain) for the South-European and Mediterranean Region\n* Valparaiso (Chile) for the Latinamerican and Caribbean Region\n* Kazan (Russian Federation) for the Euro-Asian Region\n* Tunis (Tunisia) for Africa and the Middle East\n* Gyeongju (South Korea) for the Asia-Pacific Region\nTo support the General Secretariat the Regional Secretariats assist in producing documents intended for members, data collection and the organization of relevant events. They aim to make it possible for each member to participate more extensively in the activities of the Organization, to foster communication and the exchange of information amongst themselves and to promote the development of the Organization and its presence and influence. To accomplish those aims the Regional Secretariats organize activities intended to promote the Organization's values and objectives.\nThe OWHC has five official languages: English, French, Spanish, Portuguese and Arabic. Of those English, French and Spanish are working languages.\nGoals\nDuring the founding of the OWHC in 1993 the member cities defined the goals and mission the Organization should have in the future. At the fourth General Assembly in Evora (Portugal) in 1997 the OWHC confirmed the Organization's association with the UNESCO and their joint efforts regarding World Heritage Cities in the UNESCO-OWHC agreement.\nThe OWHC aims for the implementation of the World Heritage Convention (Convention Concerning the Protection of the World Cultural and Natural Heritage adopted by the UNESCO in 1972). It encourages cooperation and exchange of information and expertise among its member cities on both regional and international levels. The OWHC works in close collaboration with other organizations pursuing similar goals while promoting action likely to support the efforts of cities located in developing countries. It assists members to adapt and improve their management methods in relation to the specific requirements of having a site inscribed on the UNESCO World Heritage List. Moreover, the organization ensures better links between research undertaken by specialists and the needs of the local managements. In addition the Organization intends to help develop a sense of solidarity among its member cities and to sensitize the populations to heritage values and their protection.\nTasks and projects\nThe OWHC organizes meetings on international and regional levels. In addition to the biennial General Assemblies there are World Congresses, conferences, seminars and workshops. All those meetings deal with the challenges in the realm of management and strategies pertaining to the preservation and development of historic cities. To accomplish its goals the OWHC additionally offers various activities, programs and projects which aim to promote and support the maintenance, recognition and development of world heritage.\nCurrent projects include Youth on the Trail of World Heritage, City2City, The Jean-Paul-L’Allier Prize for Heritage, an International Video Production Competition, the Solidarity day of World Heritage Cities, Mayors&Heritage and Case Studies.\nMember cities\nAfrica\n* Agadez ()\n* Cidade Velha ()\n* Dakar ()\n* Grand-Bassam ()\n* Harar Jugol ()\n* Island of Mozambique ()\n* Kashusha ()\n* Lamu ()\n* Mombasa ()\n* Saint-Louis ()\n* Timbuktu ()\n* Zanzibar City ()\nArab states\n* Aleppo ()\n* Algiers ()\n* Cairo ()\n* Damascus ()\n* Erbil ()\n* Essaouira ()\n* Fez ()\n* Ghadames ()\n* Ghardaïa ()\n* Jeddah ()\n* Kairouan ()\n* Marrakesh ()\n* Meknes ()\n* Muharraq ()\n* Rabat ()\n* Sanaa ()\n* Shibam ()\n* Sousse ()\n* Tétouan ()\n* Tunis ()\n* Zabid ()\nAsia and the Pacific\n* Ahmedabad ()\n* Acre ()\n* Aktau (, observer)\n* Jaipur ()\n* Andong ()\n* Anuradhapura ()\n* Baku-Old City ()\n* Bam ()\n* Bergama ()\n* Bhaktapur ()\n* Boeun ()\n* Bursa ()\n* Buyeo County ()\n* Chengde ()\n* Denpasar ()\n* Diyarbakır ()\n* Dujiangyan City ()\n* Galle ()\n* George Town ()\n* Gianyar ()\n* Gochang County ()\n* Gongju ()\n* Goris (, observer)\n* Gwangju ()\n* Gyeongju ()\n* Haenam ()\n* Hapcheon ()\n* Hội An ()\n* Huế ()\n* Hwasun County ()\n* Istanbul ()\n* Iksan ()\n* Jerusalem ()\n* Jongno ()\n* Kandy ()\n* Karangasem (, observer)\n* Kathmandu ()\n* Khiva ()\n* Konya ()\n* Kyoto ()\n* Lalitpur (Patan) ()\n* Levuka ()\n* Lijiang ()\n* Luang Prabang ()\n* Macau ()\n* Melaka ()\n* Miagao ()\n* Nara ()\n* Pyay (, observer)\n* Safranbolu ()\n* Selçuk ()\n* Seongbuk ()\n* Singapore ()\n* Surakarta (, observer)\n* Suwon ()\n* Suzhou ()\n* Tel Aviv ()\n* Turkistan ()\n* Vigan ()\n* Yangsan ()\n* Yazd ()\n* Yeongju ()\n* Yerevan (, observer)\nEurope\n* Alcalá de Henares ()\n* Amsterdam ()\n* Angra do Heroísmo ()\n* Aranjuez ()\n* Augsburg ()\n* Ávila ()\n* Baeza ()\n* Bamberg ()\n* Banská Štiavnica ()\n* Bardejov ()\n* Bath ()\n* Beemster ()\n* Bergen ()\n* Berlin ()\n* Bern ()\n* Bernau bei Berlin ()\n* Biertan ()\n* Bolgar ()\n* Bordeaux ()\n* Bruges ()\n* Brussels ()\n* Budapest ()\n* Cáceres ()\n* Carcassonne ()\n* Český Krumlov ()\n* Coimbra ()\n* Córdoba ()\n* Cuenca ()\n* Derbent ()\n* Dessau ()\n* Dubrovnik ()\n* Edinburgh ()\n* Elvas ()\n* Évora ()\n* Fontainebleau ()\n* Granada ()\n* Graz ()\n* Guimarães ()\n* Hamburg ()\n* Ibiza ()\n* Istanbul ()\n* Karlskrona ()\n* Kazan ()\n* Kolding ()\n* Kotor ()\n* Kraków ()\n* Kutná Hora ()\n* Lviv ()\n* Le Havre ()\n* Lübeck ()\n* Luxembourg ()\n* Lyon ()\n* Mérida ()\n* Modena ()\n* Mont-Saint-Michel ()\n* Moscow ()\n* Mostar ()\n* Nancy ()\n* Naumburg ()\n* Nesebar ()\n* Notodden ()\n* Ohrid ()\n* Oviedo ()\n* Padula ()\n* Palazzolo Acreide ()\n* Paris ()\n* Patmos ()\n* Porto ()\n* Potsdam ()\n* Prague ()\n* Provins ()\n* Quedlinburg ()\n* Rauma ()\n* Regensburg ()\n* Rhodes ()\n* Riga ()\n* Røros ()\n* Rotterdam ()\n* Saint Petersburg ()\n* Salamanca ()\n* Salzburg ()\n* San Cristóbal de La Laguna ()\n* San Gimignano ()\n* Santiago de Compostela ()\n* Segovia ()\n* Sighișoara ()\n* Sintra ()\n* Split ()\n* Stockholm ()\n* Stralsund ()\n* Strasbourg ()\n* Suzdal ()\n* Tallinn ()\n* Tarragona ()\n* Telč ()\n* Telford ()\n* Tinn ()\n* Toledo ()\n* Toruń ()\n* Třebíč ()\n* Trogir ()\n* Úbeda ()\n* Urbino ()\n* Vagharshapat ()\n* Valletta ()\n* Vatican City ()\n* Veliky Novgorod ()\n* Vienna ()\n* Vilnius ()\n* Vinje ()\n* Visby ()\n* Warsaw ()\n* Wismar ()\n* Yaroslavl ()\n* Zamość ()\nAmericas\n* Arequipa ()\n* Belo Horizonte ()\n* Brasília ()\n* Bridgetown ()\n* Camagüey ()\n* Campeche ()\n* Cartagena ()\n* Colonia del Sacramento ()\n* Cuenca ()\n* Cuernavaca ()\n* Cusco ()\n* Diamantina ()\n* Fray Bentos ()\n* Guadalajara ()\n* Guanajuato ()\n* Havana ()\n* Lima ()\n* Lunenburg ()\n* Mexico City ()\n* Morelia ()\n* Oaxaca ()\n* Olinda ()\n* Ouro Preto ()\n* Panama City ()\n* Philadelphia ()\n* Potosí ()\n* Puebla ()\n* Quebec City ()\n* Querétaro ()\n* Quito ()\n* Rimac ()\n* Rio de Janeiro ()\n* Salvador ()\n* San Antonio ()\n* San Miguel de Allende ()\n* San Pablo Villa de Mitla ()\n* Santa Ana de Coro ()\n* Santa Cruz de Mompox ()\n* São Luís ()\n* St. George's ()\n* Sucre ()\n* Tlacotalpan ()\n* Trinidad ()\n* Trujillo (, observer)\n* Valparaíso ()\n* Willemstad ()\n* Xochimilco ()\n* Zacatecas ()\nSee also\n*List of micro-regional organizations\nReferences\n# http://www.ovpm.org/\n# https://web.archive.org/web/20160305044101/http://www.ovpm.org/sites/ovpm/files/documents/general_by-laws.pdf\nLinks\n* [https://www.ovpm.org/cities/ Cities]"
    }
  ]
}