{
  "content": [
    {
      "type": "text",
      "text": "# Origins of the Chinese Revolution, 1915–1949\n\nOrigins of the Chinese Revolution, 1915–1949 () is a French-language non-fiction book by Lucien Bianco, published in 1967, by Editions Gallimard. It was published in English in 1971, with Muriel Bell as the translator, by Stanford University Press. It analyzes the Chinese Communist Revolution.\nKozo Yamamura of Boston College described the work as a \"survey book\".\nO. E. Westad of Yale University wrote that the book is \"a mainstay of the debate about what brought the Communists to power\".\nBackground\nBianco studied the governance of the Chinese Communist Party, characterized as a nationalist movement, despite Bianco's personal dislike of nationalism. Bianco discussed this in the postscript of the 2007 edition.\nThe research in the book was conducted in 1966.\nA large majority of the research used in the making of this book was produced in the United States, and many of the studies cited were products of Columbia University and Harvard University.\nContents\nThe collapse of the Qing dynasty and the May 4th Movement are in the opening portion of the book. The next portions discuss the development of the Chinese Communist Party.\nAllan B. Cole of the Fletcher School of Law and Diplomacy described the work as focusing on \"really big questions\" about the Communist Revolution, \"sketches [of] backgrounds and revolutionary periods\" and on analyzing similarities and differences with the regime of the Soviet Union; this was in opposition to \"a general and fairly thorough treatment of\" the course of the history of the country.\nJean-Phillippe Béja stated that Bianco's \"characterization of the regime is quite severe\".\nRelease\nIn 2007 there was a new edition of the original French version.\nIt was published in English in 1971, with Muriel Bell as the translator, by Stanford University Press.\nIt was translated into Traditional Chinese as 中國革命的起源1915-1949 by  (聯經出版公司) of Taiwan, with He Qiren (何启仁 Hé Qǐrén) as the translator.\nIts Japanese translation, 中国革命の起源 1915－1949, was published by University of Tokyo Press. The translator was  (坂野 正高 Banno Masataka) and the assistant translator was  (坪井 善明 Tsuboi Yoshiharu).\nReception\nJohn K. Fairbank of Harvard University wrote that the book \"brilliantly summarizes this whole subject\" and that the work is \"vivid and enlightening\" due to the author's \"mastery of the literature and the data of the historical record\".\nSebastian Veg, in China Perspectives, wrote in 2008 that even though the process that the book studied had not been completed yet at the time the book was written, the book was able to succeed in \"the test of time\".\nHarold Z. Schiffrin of Hebrew University wrote that it was \"the best single analysis\" due to it being \"the most comprehensive, critical, and balanced\" such work that has appeal for academics of all levels.\nBéja praised the author's thorough citation of sources, with the \"seriousness of his research\" being \"most striking\", adding that \"Not a single word is written without a reference to its source.\"\nCole stated that he felt \"satisfaction\" at seeing the French author use American sourcing, and that having a \"legatee of the French Revolution, empires, and republics\" create a work analyzing Chinese history was \"interesting\".\nYamamura stated that the book did not have \"new insights\", which \"disappointed\" Yamamura. Yamamura stated that the original French version at the book \"has its place\" with Francophone readers who had not yet specialized in the topic; at the time of Yamamura's review the English version had not yet been published.\nSee also\n* Stalin and Mao – Another book by Bianco\nReferences\n*\n*\n*  |url-access=subscription}}\n*\n*\nNotes\nFurther reading\n* |year=1969|volume=34|pages=132–135|language=fr}}\n* |year=1988 |volume=Année 1988|issue=17|pages=126–127 |lang=fr}} - [https://www.persee.fr/docAsPDF/xxs_0294-1759_1988_num_17_1_1975_t1_0126_0000_6.pdf PDF version]\n*\n*\nExternal links\n* [https://archive.org/details/originsofchinese00bian Origins of the Chinese revolution, 1915-1949] (English version) - At the Internet Archive\n* [https://www.sup.org/books/title/?id=2455 Origins of the Chinese Revolution, 1915-1949] - Stanford University Press\n* [https://web.archive.org/web/20160307235849/http://archives.cerium.ca/IMG/pdf/Bianco_Origins_of_the_Chinese_Revolution.pdf Chapter 1, pages 1-16] (English version): hosted at CÉRIUM (Centre d'études et de recherches internationales) at the Université de Montréal"
    }
  ]
}