{
  "content": [
    {
      "type": "text",
      "text": "# Oriskany Battlefield State Historic Site\n\n| added = October 15, 1966\n| refnum = 66000558\n}}\nOriskany Battlefield State Historic Site is a historic site in Oneida County, New York, United States that marks the Battle of Oriskany, fought in 1777 during the American Revolution, one of the bloodiest engagements of the war.\nThe park is northwest of the Village of Oriskany on NY Route 69 and is southeast of the City of Rome.  An obelisk, with plaques at the base commemorating the battle and its participants, is the central feature of the site.\nThe battlefield is on the south side of the Mohawk River.  The terrain consists of small rises, divided by ravines, above Mohawk River bottomlands.\nBattle\nPatriot militia General Nicholas Herkimer, leading a relief column to the besieged Fort Stanwix, was ambushed in a ravine by Iroquois chief Joseph Brant, leading a mixed group of Iroquois and Tories.  Herkimer had his ambushed militia fight in pairs behind cover.  One militiaman fired, while he was reloading the other militiaman covered him.  This tactic was effective due to the Iroquois warriors tactics of charging the enemy after they fired.  After sustaining high casualties in the number of native War Chiefs, and a heavy downpour the British forces withdrew, leaving the Tryon County militia in possession of the field.  The occupants at the fort used the reduction in the force before them as an opportunity to sally out and sack the British camp.  Herkimer died of his wounds days later.  Oriskany is known as the bloodiest battle of the American Revolution. In respects to the number of combatants, casualties sustained and the fact that many of the combatants had friends and relatives on the opposing side. See Battle of Oriskany for more details.\nCommemoration\nA monument at the site stands above a small rise that many of the ambushed Americans found their way to, and where Herkimer, wounded, rallied and directed the American forces.  Plaques on the monument depict Herkimer and list many of the American participants in the battle.\nThe monument was dedicated in 1884.\nThe site was declared a National Historic Landmark in 1962.\nIt is a New York State Historic Site.\nActivities and services\nVisitor center and museum, scenic views, picnic area, hiking, tours, and re-enactments.\nSee also\n*Herkimer Home State Historic Site\n*Mohawk Upper Castle Historic District\n*List of National Historic Landmarks in New York\n*List of New York State Historic Sites\nPhotos\nImage:OriskanyBattlefieldMonument PanelCombat 2007.jpg|Combat\nImage:OriskanyBattlefieldMonument PanelText 2007.jpg|Text description\nImage:OriskanyBattlefieldMonument PanelHerkimerDirecting 2007.jpg|Herkimer directing the battle\nImage:OriskanyBattlefieldMonument PanelTryonParticipantsListed 2007.jpg|Tryon militia participants\nImage:OriskanyBattlefield PlaqueB 2007.jpg|Plaque before Mohawk River bottomlands\nImage:OriskanyBattlefield PlaqueA 2007.jpg|Plaque at rally site\nReferences\nExternal links\n*[http://parks.ny.gov/historic-sites/21/details.aspx Oriskany Battlefield State Historic Site] at NYS Office of Parks, Recreation, and Historic Preservation (Official Site)\n*[http://www.wildernet.com/pages/area.cfm?areaID=NYSPOK&CU_ID=1 More information from Wildernet]\n*[http://www.revolutionaryday.com/nyroute5/oriskany/default.htm Oriskany Battlefield - information about the battle]\n*[https://web.archive.org/web/20070825080843/http://www.nps.gov/nr/twhp/wwwlps/lessons/79oriskany/79oriskany.htm The Battle of Oriskany: \"Blood Shed a Stream Running Down\", a National Park Service Teaching with Historic Places (TwHP) lesson plan]\n*[https://www.youtube.com/watch?v=Vz4mJOVZ7eM/ Video showing the Battlefield and a ranger talking about the battle] from 2016"
    }
  ]
}