{
  "content": [
    {
      "type": "text",
      "text": "# Orpheus S. Woodward\n\n|death_date    =\n|birth_place   = Harborcreek, Pennsylvania\n|death_place   = Neosho Falls, Kansas\n|placeofburial =\n|placeofburial_label =\n|placeofburial_coordinates =\n|nickname      =\n|birth_name    =\n|allegiance    =United States of AmericaUnion\n|branch        =United States ArmyUnion Army\n|serviceyears  =\n|rank          = ColonelBrevet Brigadier General\n|servicenumber =\n|unit          =\n|commands      = 83rd Pennsylvania Infantry\n|battles       =American Civil War\n*Battle of Chancellorsville\n*Battle of Gettysburg\n|battles_label =\n|awards        =\n|spouse        =\n|relations     =\n|laterwork     =\n|signature     =\n|website       =\n}}\nOrpheus Saeger Woodward (May 1, 1835 – June 26, 1919) was a Union Army officer during American Civil War.\nWoodward was born in Harborcreek, Pennsylvania, May 1, 1835. He was a farmer and hardware merchant before the Civil War. He started his Civil War service as a private in the Erie Pennsylvania Infantry. On September 13, 1861, he was appointed captain of the 83rd Pennsylvania Infantry Regiment.\nWoodward was wounded at Battle of Malvern Hill. He served in the Antietam campaign and fought at the Battle of Chancellorsville and at Little Round Top during the Battle of Gettysburg. He was promoted to colonel of the 83rd Pennsylvania Infantry Regiment on March 28, 1864. Woodward was severely wounded at the Battle of the Wilderness on May 5, 1864, which resulted in his right leg being amputated.  He was mustered out of the volunteers on September 20, 1864.\nOn February 24, 1866, President Andrew Johnson nominated Woodward for appointment to the grade of brevet brigadier general of volunteers, to rank from March 13, 1865, and the United States Senate confirmed the appointment on April 10, 1866.\nOrpheus Saeger Woodward died at Leavenworth, Kansas, June 26, 1919.  He was buried at Cedar Vale Cemetery, Neosho Falls, Kansas.\nSee also\n*List of American Civil War brevet generals (Union)\nReferences"
    }
  ]
}