{
  "content": [
    {
      "type": "text",
      "text": "# Orpheus with the Awkward Foot\n\n| coordinates  =\n| length       =\n| width        =\n}}\nOrpheus with the Awkward Foot (also simply known as Orpheus or the Francis Scott Key Monument) is a monumental statue located at Fort McHenry in Baltimore, Maryland, United States. The monument, designed by sculptor Charles Henry Niehaus, was commissioned by the United States Commission of Fine Arts to commemorate the 100th anniversary of the writing of \"The Star-Spangled Banner\", written by Francis Scott Key during the Battle of Baltimore in 1814. The statue was dedicated in 1922, with U.S. President Warren G. Harding in attendance.\nHistory\n1914 marked the centennial anniversary of the writing of \"The Star-Spangled Banner\", the national anthem of the United States, which was written by Francis Scott Key while in Baltimore during the War of 1812's Battle of Baltimore. To commemorate the occasion, the United States Congress allocated US$75,000 for the erection of a monument at Baltimore's Fort McHenry in honor of the national anthem and the battle that took place there. On May 28, 1916, the United States Commission of Fine Arts held a competition for design proposals for this monument, with 34 sculptors entering. Of the submissions, Charles Henry Niehaus's was selected by the commission. Niehaus was at the time working in Grantwood, New Jersey, but he had previously trained in Rome and at the Royal Academy of Fine Arts in Munich and had established a reputation in the United States as a skilled and highly sought-out sculptor. Niehaus's monument design consisted of a statue of the Greek mythological musician Orpheus. The decision to not have Key himself be the subject of the monument proved divisive, with some of Key's descendants and sculptor Hans Schuler (who had also submitted a design proposal during the competition) criticizing Niehaus's choice. Niehaus stated that the choice to have an allegorical depiction was made because he was unable to satisfactorily create a good portrayal of Key. Making reference to the odd choice in 2021, historian John R. Vile stated that the statue was perhaps \"[t]he oddest monument to Key\".\nDespite the design selection, the entry of the United States into World War I delayed construction for several years, with work on the monument finally beginning on November 4, 1920. The delay was additionally caused by marble pieces, procured from local masons, being rejected by inspectors. The construction was completed by June 1, 1922, and a dedication ceremony was scheduled for June 14, 1922 (Flag Day). U.S. President Warren G. Harding attended the dedication, giving a speech that was aired on radio nationwide. This was the first time that a president of the United States had had his voice transmitted via radio. In his speech, Harding praised Key, saying among other things, \"Key reached the sublime heights and wrote the poetic revelation of an American soul aflame\".\nIn 1928, Niehaus received compensation from the U.S. Congress for $33,121 in cost overruns from the project. In 1962, the statue was relocated from its original position to another location near the fort. That same year, a time capsule buried under the monument was opened. In a 1987 report issued by the National Park Service (which has administered the fort since 1933), they suggested possibly relocating the statue away from the fort, citing the monument as one of several \"ornamental statuary and markers that have been added to the site over the years\" that \"do not relate to the interpretive themes of the monument\" and \"intrude on the historical scene\". In particular, they noted that the size of the Orpheus statue takes visitors' attention away from the fort itself. Despite the proposals, the monument was not relocated from the fort. In 1992, the monument was surveyed as part of the Save Outdoor Sculpture! project.\nDesign\nworking on the model for the sculpture, 1917|left]]\nThe monument consists of a  bronze statue of Orpheus atop a  round marble base. Orpheus is nude, save for a headband and a fig leaf, and he is playing a five-stringed tortoise shell lyre. Orpheus's design is an example of the neoclassical sculpture designs that were popular during the time of its creation. On the base of the monument, which has a diameter of , is a medallion honoring Key, who is depicted in profile. This medallion is supported on either side by a soldier and a sailor in low relief, while the rest of the base depicts the Muses celebrating the U.S. Army and the U.S. Navy. Along the base, an inscription reads: \"To Francis Scott Key - Author of the Star Spangled Banner and to the soldiers and sailors who took part in the Battle of North Point and the defense of Fort McHenry in the War of 1812.\"\nThe statue itself is speculated to be the largest bronze statue cast at that point in time, with a contemporary publication claiming it as such.\nOriginally, the monument was located in a traffic circle in the middle of an entry road leading to the fort. However, in 1962, the statue was relocated to a less prominent position in the park, near the front gate. As part of the move, the monument lost its exedra, which had contained benches, cannonballs, and cannons.\nSee also\n* Francis Scott Key Monument\n* List of public art in Baltimore\nNotes\nReferences\nExternal links\n*\n*"
    }
  ]
}