{
  "content": [
    {
      "type": "text",
      "text": "# Ortega y Gasset Awards\n\nThe Ortega y Gasset Journalism Awards are named after the Spanish philosopher and journalist José Ortega y Gasset.  The awards were created by the newspaper El País in 1984.\nCategories\nEvery year, these awards are given to those whose work has shown \"a remarkable defense of freedom, independence, honesty and professional rigor as essential virtues of journalism\". The awards were originally divided in four categories:\n*Periodismo impreso (printed journalism)\n*Periodismo digital (digital journalism)\n*Periodismo gráfico (graphic journalism)\n*Trayectoria profesional (career award)\nAs of 2016, the new categories are:\n*Mejor Historia e Investigación Periodística (Best Story or Journalistic Investigation)\n*Mejor Cobertura Multimedia (Best Multimedia Coverage)\n*Mejor Fotografía (Best photography)\n*Trayectoria profesional (Career Award)\nWinners\n:;2000:\n*Best Information Work: Ernesto Ekaizer\n*Best Opinion Article: Fernando Savater\n*Best Research Work: John Carlin\n*Graphic: Julio Villarino\n:;2001:\n*Print: José Valdés and the research team of Reforma\n*Graphic: Gorka Lejarcegi\n* Career award El Comercio, Lima.\n:;2002\n* Best Information Work: El Nuevo Herald\n* Best Research: Ángeles Espinosa &ndash; El País\n* Graphic: Andrés Carrasco Ragel &ndash; Diario de Cádiz\n:;2003:\n* Best Opinion Article: Roberto Pombo\n*Best Information Work: Spanish journalists who distinguished themselves in the war in Iraq (Special Award)\n*Graphic: Xurxo Lobato\n:;2004\n*Best Information Work: El Nuevo Día of Puerto Rico\n*Best Research Work: Bru Rovira\n*Graphic: Sergio Pérez Sanz\n:;2005:\n*Best Information Work: Leticia Álvarez and Rosana Lanero &ndash; El Comercio\n*Best Research Work: Giannina Segnini, Ernesto Rivera and Mauricio Herrera Ulloa &ndash; La Nación\n*Graphic: Pablo Torres\n:;2006\n*Print: Matías Vallés, Felipe Armendáriz and Marisa Goñi, journalists of Diario de Mallorca\n*Digital: Sandra Balsells\n*Graphic: Sergio Caro\n*Career Award: Lozano family for La Opinión of Los Angeles\n:;2007\n*Print: Roberto Navia\n*Digital: Mundo.com en español (BBC website)\n*Graphic: Desirée Martín\n*Career award: Raúl Rivero\n:;2008\n*Print: Sanjuana Martínez\n*Digital: Yoani Sánchez\n*Graphic: Gervasio Sánchez\n*Career Award: Zeta Magazine\n:;2009\n*Print: Jorge Martínez Reverte\n*Digital: Amaya García Ortiz de Jocano\n*Graphic: Adolfo Suárez Illana (for photo of his father Adolfo Suárez)\n*Career award: Tomás Eloy Martínez\n:;2010\n*Print: El País (investigative journalism on the Gurtel case)\n*Digital: Judith Torrea (for her blog, \"Ciudad Juárez, en la sombra del narcotráfico\")\n*Graphic: José Cendón\n*Career Award: Jean Daniel\n:;2011\n*Print: Octavio Enriquez\n*Digital: Carlos Martínez D'Abuisson\n*Graphic: Cristóbal Manuel Sánchez Rodríguez\n*Career Award: Moisés Naím\n:;2012\n* Print: Humberto Padgett\n*Digital: Carmela Ríos\n*Graphic: Carlos Jacobo Méndez\n*Career Award: Sir Harold Evans\n:;2013\n*Print: Alberto Salcedo Ramos\n*Digital: Juan Ramón Robles\n*Graphic: Emilio Morenatti\n*Career Award: Jesús de la Serna\n:;2014\n*Print: Pablo Ferri Tórtola, Alejandra Sánchez Inzunza and José Luis Pardo\n*Digital: Álvaro de Cózar, Mónica Ceberio, Cristina Pop, Luis Almodóvar, Álvaro de la Rúa, Paula Casado, Fernando Hernández, Ana Fernández, Rubén Gil, José María Ocaña, Gorka Lejarcegi, Gema García and Mariano Zafra\n*Graphic: Pedro Armestre\n*Career Award: Alan Rusbridger\n:;2015\n*Print: Pedro Simón y Alberto Di Lolli\n*Digital: Gerardo Reyes\n*Graphic: José Palazón\n*Career Award: Teodoro Petkoff\n:;2016\n*Best Story or Journalistic Investigation: Joseph Zárate Salazar (for his story \"The woman of the blue lagoon against the black lagoon\")\n*Best Multimedia Coverage: Lilia Saúl and Ginna Morelo (for their coverage \"The disappeared\")\n*Best Photography: Samuel Aranda\n*Career Award: Adam Michnik\n:;2017\n*Best Story or Journalistic Investigation: El Periódico of Catalunya (for a series of stories on various cases of pedophilia in several schools in Barcelona)\n*Best Multimedia Coverage: Univisión Noticias (for their story \"Holidays in no man's water\")\n*Best Photography: Yander Alberto Zamora\n*Career Award: Alma Guillermoprieto\n:;2018\n*Best Story or Journalistic Investigation:  Miriam Castillo, Nayeli Roldán and Manuel Ureste (for their investigation \"The master scam\")\n*Best Multimedia Coverage: Univisión, Inger Díaz Barriga (for her story \"Better go, Cristina\")\n*Best Photography: David Armengou and Marcela Miret\n*Career Award: Soledad Gallego-Díaz\n:;2019\n*Best Story or Journalistic Investigation:  5W; Agus Morales and Eduardo Ponces (for their investigation \"Los muertos que me habitan\")\n*Best Multimedia Coverage: El Pitazo; Johanna Osorio Herrera y otros (for their investigation \"La generación del hambre\")\n*Best Photography: Vincent West of Reuters (for his image \"el empuje y la fuerza\")\n*Career Award: Darío Arizmendi\n:;2020\n*Best Story or Journalistic Investigation: \"Transnationals of faith,\" Latin American Center for Investigative Journalism\n*Best multimedia coverage: Aragon, town by town (Heraldo de Aragón)\n*Best Photography: Maria de Jesus Peters\n*Career Award: Monica Gonzalez Mujica\n2021\n* Best story or Journalistic Investigation: The women who won over the desert, by Isabela Ponce\n* Best Multimedia Coverage: \"A salon, a bar and a class,\" published by Mariano Zafra (Pamplona) and Javier Salas (Madrid) in El País,.\n* Best Photography: Birthday, taken by Brais Lorenzo (Orense, 1986), from the EFE Agency.\n* Career Award: Carlos Fernando Chamorro Barrios (Nicaragua, 1955/1956).\n2022\n* Best story or Journalistic Investigation: Paedophilia in the Spanish Church, published in the newspaper El País.\n* Best Multimedia Coverage:The challenge after the massacre: memory, truth, justice and non-repetition, published by the Nicaraguan media Divergentes.\n* Best Photography: Sashenka Gutiérrez, from the Efe Mexico Agency.\n* Career Award: David Beriáin and Roberto Fraile, two journalists who died in Burkina Faso on April 26, 2021. Recognition of their commitment to the profession by covering forgotten conflicts. This is the first Ortega y Gasset award to be given posthumously, as a tribute to all journalists who die in the exercise of their profession.\n2023\n* Best Story or Journalistic Investigation: A family that owes nothing flees the Exceptional Regime, by Julia Gavarrete and published in El Faro de El Salvador.\n* Best Multimedia Coverage: Congo River, by Xavier Aldekoa and published in La Vanguardia.\n* Best Photography: Santi Palacios.\n* Career Award: Martín Caparrós, Argentine journalist and chronicler, is awarded for his work in the profession as a reference for great chronicles written in the Spanish language.\nSee also\n* Prizes named after people\nReferences\nExternal links\n*"
    }
  ]
}