{
  "content": [
    {
      "type": "text",
      "text": "# Ottoman–Persian War (1505–1517)__disambig_1\n\nOttoman Empire Kingdom of Imereti (1517)\n|Pro-Ottoman Kurds\n|Yazidi tribes\n}}\n| combatant2        =  Safavid Iran\n| commander1        =  Bayezid II Selim I Mustafa Pasha Şehzade Korkut Serasker Hasan Bey Murad Pasha Hadım Ali Pasha  Haydar Pasha Kâtip Ali Pasha Cündî Kemal Bey Haydar Bey Şehzade Murad Hadım Sinan Pasha Yularkıstı Sinan Pasha Hasan Pasha Malkoçoğlu Turali Bey Malkoçoğlu Ali Bey Malkoçoğlu Bali Bey Bıyıklı Mehmed Pasha Yiğit Ahmet Cemşid Bey Idris Bitlisi Pir Hüseyin Bey Şadi Pasha Çerkes Hüseyin Bey Karaçinoğlu Ahmet Bey Mevahib Çelebi Seyyid Ahmed Bey Bedir Bey Mehmed Çelebi Deli Husrev Pasha  Karaçin Ahmed Bey Halil Eyyubi Atak Ahmed Beg Çavuş Ahmed Beg Mirza Mehmed Beg Mustafa bey Dukaginzade Ahmed Pasha Süleyman Bey Yörgüçoğlu Mehmet Bey Hasan Agha Ataş Bey Yörgüçoğlu İskender Bey Mehmed Bey Karlıoğlu Sinan Bey Üveys Bey\n}}\n| commander2        =  Ismail I Şahkulu Ibrahim Teki Baba Halife Baba Nur-Ali Khalifa Kara Maksud-i Abd al-Baqi Yazdi Husayn Beg Shamlu Saru Pira Ustajlu Mohammad Khan Ustajlu Sayyed Sharif al-Din Ali Shirazi Karahan Ustajli Seyid Sadraddin Acheh Soltan Qajar Malik Halil Eyyubi Tajlu Khanum  Aykutoğlu Muhammed Bey Çuka Khan Hüseyin Beg Kangırıl Sultan Saru Beg Yegan Beg Velihan Beg Durmuş Beg Ustajli Süleyman Bey Ahmed Bey Afshar Mehmed Bey Şeref Bey Davud Bey Mir Seyyid Şerif Mir Abdülbaki Avsar Sultan Ali Mirza Korçubaşı Saru Pire Köse Hamza Lala Hüseyin Bey  Pir Ömer Bey Şireci Atçeken Hızır Hulefa Bey\n}}\n| casualties1       = Heavy\n* 3,000 or 8,000–40,000 killed in Chaldiran\n* 50,000 killed in Qizilbash revolts(including civilians)\n| casualties2       = Heavy\n* 2,000–5,000 or 80,000 killed in Chaldiran\n* 40,000–200,000 Qizilbashs massacred in Anatolia(including civilians)\n}}\nThe Ottoman–Persian War (1505–1517) were a series of military conflicts fought between the Ottoman Empire and the Safavid dynasty of Iran during the reign of Sultan Bayezid II and his son Selim I. Sparked by sectarian and territorial rivalries, the wars culminated in major Ottoman victories, including the pivotal Battle of Chaldiran (1514) and the subsequent conquest of Eastern Anatolia and northern Mesopotamia. These campaigns marked the beginning of a long-standing Ottoman–Persian rivalry that would last until 1918\nBackground\nIn 1500, after becoming leader of the Safavid order, Ismail I launched a revolt against the Aq Qoyunlu state, first conquering the Shirvanshahs and later all of Iran. During his campaigns, he massacred thousands of Sunnis and ultimately destroyed the Aq Qoyunlu entirely. Prince Selim, who closely followed these events, feared a Safavid invasion of Ottoman territory and repeatedly warned his father, Beyazid II, though his concerns were ignored.\nIn 1505, Ismail's brother Ibrahim raided Trabzon, which was ruled by Selim, with 3,000 men, but was repelled by just 450 soldiers under Selim's command. This marked the first direct battle between the Ottoman Empire and Safavid Iran, and conflicts under Selim's leadership would continue for the next twelve years.\nThe second clash occurred in 1507, when the Safavids invaded the Dulkadirids with a force of 20,000 men, crossing Ottoman territory to attack the beylik and punish Ala al-Dawla Bozkurt.\nFrustrated by his father's inaction against the Safavids, Selim independently invaded Erzincan and defeated a Safavid force of 10,000 without his father's approval. Despite this victory, he was later ordered to return Erzincan to the Safavids.\nTimeline\n1505\nIn 1505, Ibrahim, the brother of Shah Ismail I, led a force of 3,000 men to raid the Ottoman province of Trabzon, then governed by Selim I.\nSelim, commanding just 450 soldiers, successfully repelled the Safavid incursion and pursued the retreating forces as far as Erzincan, inflicting heavy casualties and capturing their arms and supplies. He also dispatched another detachment to raid western Safavid territory.\nFollowing the clash, Shah Ismail sent an envoy to Bayezid II, protesting Selim's actions and demanding the return of the seized weaponry and prisoners. Bayezid, however, did not yield; instead, he responded with gifts and assurances of peace.\n1507\nIn 1507, the Safavids under Shah Ismail I invaded Anatolia once again, this time targeting Bozkurt Bey, ruler of the Dulkadirids. Their forces passed through Ottoman lands and recruited local Turkmen tribesmen, subjects of the empire, which was seen as a direct violation of Ottoman sovereignty.\nAlthough Bayezid II refrained from retaliation, Selim independently launched a counterattack. He struck at Erzincan and Bayburt, defeating the Safavid forces dispatched by Ismail.\n1510\nIn 1510, Shah Ismail sent another expedition toward Trabzon, repeating the failed 1505 attempt to challenge Selim's rule in the region. The invading forces, again led by Ismail's brother, were decisively defeated by Selim.\nFollowing this, Selim, now joined by Mustafa Pasha, launched an offensive toward Diyarbakır with 30,000 troops. However, at the Battle of Qarahamid (1510), their forces were defeated by Karahan Ustajli commanding just 12,000 soldiers. This setback stalled Ottoman advances for three years, during which pro-Safavid Kızılbaş uprisings continued within the empire.\n1511\nIn 1511, Şahkulu, a Turkmen Kızılbash leader in Anatolia, launched a pro-Safavid revolt primarily in the Teke Peninsula.\nIn the early stages of the rebellion, in May 1511, Şahkulu led a force of 400–500 men and raided Antalya. Shortly after, he confronted Şehzade Korkut, who, despite having a larger force, fled the battlefield without a fight, abandoning his treasury. Upon Korkut's retreat, Seeasker Hasan Pasha saved the treasury from Şahkulu and escaped to Antalya, where he was attacked and defeated by a 3,000 strong rebel force. Wounded in the battle, he took refuge in the castle at Adana with other survivors. The rebels laid siege to the castle, but Şahkulu, unable to capture it, lifted the siege and advanced northward, capturing Isparta and attacking Burdur.\nMurad Pasha, the sanjakbey of Burdur, attempted to defend the city with 2,000 men but was killed in the battle, and the city fell to the rebels.\nAfter waiting briefly at Burdur, Şahkulu marched to Kütahya on 16 April 1511. Bayezid II, fearing the rebels would reach İstanbul, sent Hadım Ali Pasha and  with 5,000 men to Kütahya. Şahkulu, upon learning this, temporarily retreated and awaited the Ottoman forces' arrival. After their arrival, he ambushed and killed almost the entire army, capturing and executing Ahmet Pasha.\nFollowing this victory, Şahkulu sent Teki Baba to besiege Kütahya while he invaded Manisa to capture Şehzade Korkut, defeating him in another battle and killing Serasker Hasan Pasha along with several sanjakbeys.\nAfter the rebels besieging Kütahya were routed by Haydar Pasha, Şahkulu left Manisa and attacked Kütahya, killing Haydar Pasha. In response, Bayezid dispatched an army of 50,000 under Kâtip Ali Pasha, who engaged Şahkulu near Ankara on 15 July. After a long battle, the Ottomans were defeated; their commander was killed and many soldiers fled, while Şahkulu suffered only about 500 casualties.\nAfter this victory, Şahkulu besieged Adana again but lifted the siege after learning that the Ottomans sent an 8,000 strong force under Hadım Ali Pasha. He then retreated toward Safavid lands with his 13,000 men. During the pursuit, Şahkulu attacked Karaman, killing berebey Haydar Pasha (not the same Haydar Pasha killed in Kütahya) and the sanjakbey of Karaman, Cündî Kemal Bey.\nFollowing this, Şahkulu fled to Sivas but was caught by Hadım Ali Pasha after a 14-day pursuit. In a subsequent battle at Sivas (or according to some sources, Adıyaman), the rebels defeated the Ottomans, killing Ali Pasha. Şahkulu went missing after the battle, presumed dead; his body was never found. Surviving rebels fled to Safavid lands, where they were welcomed by Shah Ismail.\n1512\nTaking advantage of the turmoil within the Ottoman Empire, Shah Ismail sent Nur-Ali Khalifa into Ottoman territory to recruit Qizilbashs who had been unable to join his service. Upon arriving in Şebinkarahisar, Nur-Ali Khalifa publicly proclaimed the orders of Shah Ismail. As a result, some three to four thousand sipahi gathered with their families. The depopulated villages are recorded in the Ottoman cadastral registers.\nNur-Ali Khalifa, along with the newly joined Qizilbashs, marched on Malatya and captured the city, then advanced toward Tokat. The people of Tokat pledged allegiance to Nur Ali Khalifa. A khutbah was recited in the name of Shah Ismail in Tokat. When Nur-Ali Khalifa left Tokat and arrived in Kazabad, Şehzade Murad, the son of Şehzade Ahmed, joined the Qizilbashs with an army of about ten thousand men.\nWhen Nur-Ali Khalifa returned to Tokat with the prince, the locals refused to let them enter the city. In response, they set Tokat on fire and turned toward Niksar. Şehzade Murad later parted ways with Nur-Ali Khalifa and went to meet Shah Ismail.\nNur-Ali Khalifa laid siege to Çemişgezek, which surrendered without resistance. Later, he reportedly oppressed and killed many notables and residents of the Melkişli tribe.\nWhile heading toward his tımar in the center of Erzincan, Nur-Ali Khalifa learned that Ottoman vizier Hadım Sinan Pasha was pursuing him with an army. In a battle near Eyüyazı, Hadım Sinan Pasha was defeated and Yularkıstı Sinan Pasha was killed. Following this, Nur-Ali Khalifa returned to central Erzincan as a victorious commander.\n1514\nThe two armies met at the Battle of Chaldiran. During the battle, the Ottomans fielded an army of approximately 60,000 to 300,000 men, while the Safavid army numbered around 20,000 to 80,000.\nAt the outset, Selim I ordered the capture of the hills southwest of the plain so that the army could safely position its back against the mountains. Accordingly, the vanguard troops under the command of Orhan Bey quickly secured these hills.\nSelim I personally commanded the center, accompanied by the Kazasker, the Grand Vizier Hersekzade Ahmed Pasha, the vizier Dukaginoğlu Ahmed Pasha, and Mustafa Pasha. The right flank, composed of Anatolian troops, was commanded by the Beylerbey of Anatolia, Hadım Sinan Pasha, and the Beylerbey of Karaman, Zeynel Pasha. The left flank, made up of Rumelian troops, was under the command of Rumeli Beylerbey Hasan Pasha. Anatolian and Rumelian azep troops were positioned in the most dangerous spot—right in front of the cannons. About 200 cannons were placed on the dominant hills. At first sight, Shah Ismail's army would not notice the hidden cannons and would charge at the azep troops standing in front of them. At that moment, the azep troops would skillfully clear the front and trap the Safavid army in a circle of cannon fire.\nShah Ismail himself commanded the right wing of his army, the left was commanded by the governor of Diyarbakir, Ustacluoğlu Mehmet Khan, and the center by his grand vizier Mir Abdulbaki. Shah Ismail planned to win a magnificent victory through the superiority of his armored cavalry.\nWhen the battle began, the Ottoman soldiers used heavy firearms called Fitilli musket or Gürleyen Demirler for the first time in this battle. When these muskets fired, they created large gaps in the Safavid ranks. Seeing his army falter, Shah Ismail led the right wing under his command to attack the Ottoman left wing. The azep troops could not carry out Selim's plan. They failed to move aside in time and the cannons could not fire. The tired and exhausted Rumelian troops were unable to withstand Shah Ismail's fresh forces. During this charge, Shah Ismail killed Rumeli Beylerbey Hasan Pasha.\nSultan Selim was quick to grasp the situation. He ordered his artillery to open fire while personally cutting off Shah Ismail's retreat with his elite janissaries. Although the Ottoman left wing was destroyed, Selim, who commanded the center, and Hadım Sinan Pasha, who commanded the right wing, used clever maneuvers to put the Safavid army in a difficult position.\nThe azep troops fell back behind the cannons, and the cannon fire began. The commander of the Safavid left wing, Ustacluoğlu Mehmet Khan, drove his soldiers straight into the mouth of the artillery. Shouting \"Strike now!\", he leapt forward himself but was knocked from his horse and killed by the lance of an Ottoman cavalryman.\nMalkoçoğlu Ali Bey and Malkoçoğlu Tur Ali Bey, following Selim's orders, charged at Shah Ismail with their men, but both were killed. However, Malkoçoğlu Ali Bey fired his double-barreled pistol, gifted by Selim himself, and wounded Shah Ismail in the arm and thigh. In response, Shah Ismail's groom, Atçeken Hızır, approached from behind and killed Malkoçoğlu.\nThe battle lasted one day. Realizing he would lose, Shah Ismail sent his last remaining forces against the Ottoman army. He then exchanged clothes and horses with Atçeken Hızır and fled. Hızır, disguised in Shah Ismail's garments, rode back into the battlefield shouting \"I am the Shah!\" He was captured by the Ottomans but later escaped.\nAt the end of the battle, as the Safavid army began to scatter, Shah Ismail left the battlefield and retreated to Dergezin. Many famous Kızılbash leaders like Ustaclu Mohammed Khan, Pir Ömer Bey Şireci, Köse Hamza, and Lala Hüseyin Bey were killed in this battle.\nSelim I at first thought the Safavid withdrawal was a ruse, but once it was clear the battle was won, he allowed his army to loot the battlefield and most of the captured prisoners were executed.\nIn this battle, the Ottoman army used the latest military technology and secured a great victory. On September 6, 1514, Selim I entered Tabriz, the capital of the Safavid state. He wanted to spend the winter there, but due to rising unrest among his exhausted troops, he had to return to Istanbul, abandoning part of the newly captured territory.\nThe Safavids later recovered their lost territories, except for Eastern Anatolia, without further fighting. The main aim of this war was not territorial conquest but to resolve the power struggle between the Safavids and the Ottomans. As a result of the battle, the tribes and beyliks in Eastern Anatolia declared allegiance to the Ottomans. The battle also severed the link between the Safavids and their Mamluk allies in Egypt, which made Selim's Egyptian campaign easier. In addition, the Ottomans gained control of the Van-Tabriz section of the Silk Road.\nThe Ottomans lost between 8,000 and 40,000 men, while the Safavids lost between 2 and 80 thousand men including prisoners. The advanced Ottoman weaponry—particularly the use of cannons and muskets by the Janissaries—proved decisive in the outcome. In contrast, the Safavid army, equipped mostly with traditional weaponry, suffered from poor planning and lack of discipline.\nThe same year Sultan Selim attempted to capture Urfa by dispatching a military force of 8,000 men under the command of Murad Bey, the Aq Qoyunlu leader who had taken refuge in the Ottoman Empire. However, Acheh Soltan Qajar, the governor of Urfa at the time, defeated this force with 800 soldiers and killed Murad Bey. As a result, Urfa remained under Safavid control for a while longer.\nAt the same time, Selim I ordered the siege of Bayburt and Kiğı, which were important positions on the northern route. He formed a joint force under the command of the Governor of Trabzon, Bıyıklı Mehmed Bey, and the Governor of Yanya, Mustafa Bey.\nWhen the Ottoman army arrived in front of Bayburt, a surrender notice was sent to Kara Maksud-i, one of the Safavid commanders responsible for defending the castle. Upon his refusal to surrender, the castle was attacked and captured on Tuesday, October 17, 1514, after a series of assaults.\nBefore the Kiğı Castle could be besieged, its governor announced his surrender and sent the castle keys to Bıyıklı Mehmed Bey. The Sultan, who received news of the swift conquest of these two key fortresses, promoted Bıyıklı Mehmed Bey to the rank of Pasha, and added Bayburt, Erzincan, and Karahisar Sanjaks to the Trabzon Sanjak under his authority.\n1515\nAn Ottoman army of 10,000 under Pir Hüseyin Bey and Bıyıklı Mehmed Pasha defeated Nur-Ali Khalifa and Aykutoğlu Muhammed Bey in Battle of Ovacık (1515) in June, killing Nur-Ali Khalifa in battle and annexing Tunceli.\nThree months later, an army of 15,000 men under Cemşid Bey, Yiğit Ahmet, Şadi Pasha, and Idris Bitlisi arrived at Diyarbakır, which had been under siege since 1514. They defeated a Safavid army of 10,000 under Karahan Ustajli and Durmuş Bey, capturing the city on September 10, 1515. Şadi Pasha was executed by Selim a few months later.\n1516\nAn army of 1,000 jannisaries under Çerkes Hüseyin Bey and Karaçinoğlu Ahmet Bey besieged Harput in March 23 and captured the city after a 3-day long siege.\nAnother army of 500 pro-Ottoman Kurds under Mevahib Çelebi, Seyyid Ahmed Bey, and Bedir Bey ambushed a Safavid army of 2,000 under Çuka Khan in Sinjar, killing 200 of them while only losing 12 men. The Safavid forces, disorganized by the sudden raid and unaware of the number of attackers, panicked and dispersed. Despite this, some managed to reach Mardin.\nAs a revenge, an army under Karahan Ustajli ambushed an Ottoman force at Bismil, killing the sanjakbey of Harput, Çerkez Hüseyin Bey and Mehmed Çelebi, along with the entire Ottoman army.\nHowever his victory didn't last long, and just a month later in May, an army of 6,000 under Karahan Ustajli met with an army of 20,000 Ottomans under Bıyıklı Mehmed Pasha in the Battle of Koçhisar (1516).\nThe battle began in the mid-morning with a strong assault by the Safavid left wing under the command of Karahan Ustajli on the Ottoman sipahi cavalry led by Hüsrev Pasha. Kara Khan's rapid attack placed the Ottoman left wing in a difficult position. Observing this, Bıyıklı Mehmed Pasha launched a counterattack with the Janissaries directly against Kara Khan.\nMeanwhile, Kangırıl Sultan and Hüseyin Bey led the Safavid right wing in a fierce charge against the Ottoman left flank, which consisted largely of tribal units. As a result, both sides' initial plans collapsed and the outcome came down to individual valor and unit cohesion.\nOn the Ottoman right, Pir Hüseyin Bey briefly attempted to retreat, but thanks to support from tribal chiefs, the line was held. Ustajlu Kara Khan, attacking the Ottoman left, was eventually caught in a pincer movement by the Karaman and Diyarbakır contingents. Although the Safavid cavalry attempted multiple breakout maneuvers, they were repeatedly repelled by disciplined volleys from the Janissaries armed with firearms.\nDuring one of these assaults, a bullet struck Kara Khan in the throat. After he fell from his horse, a Janissary named Nasuh decapitated him and raised his head on a spear. Demoralized by the death of their commander and suffering heavy casualties, the Safavid left wing fell into disarray and fled, with only a few managing to escape.\nWith the collapse of the Safavid left, the Ottoman army turned its full force on the remaining Safavid division led by Kangırıl Sultan. Unable to resist for long, Kangırıl Sultan managed to escape. The battle, which had started in the morning, concluded by late afternoon with a decisive Ottoman victory.\nThe Safavid army was effectively destroyed, with many commanders and soldiers killed, while the survivors fled to nearby friendly fortresses. Ottoman losses included 200 Karaman troops, 150 Kurdish fighters, 130 Anatolian soldiers, and 20 Janissaries.\n1517\nFollowing this victory, Bıyıklı Mehmed Pasha laid siege to Mardin. As Sultan Selim I launched the Great Egypt Campaign, he summoned Mehmed Pasha to join the imperial army. Leaving Deli Husrev Pasha in command of the siege, Mehmed Pasha departed and joined the sultan's forces on 3 August.\nAt the Battle of Marj Dabiq on 24 August 1516, Bıyıklı Mehmed Pasha served as commander of the Ottoman left flank. Following the Ottoman capture of Aleppo, Mehmed Pasha left the imperial army to rejoin the siege of Mardin.\nA smaller Ottoman force under Deli Husrev Pasha had already been besieging the city since June. When Mehmed Pasha arrived in late 1516 or early 1517, he brought a considerable number of cannons with him. With the arrival of reinforcements from Diyarbakır, the siege intensified and quickly turned in the Ottomans’ favor. By March, the city was captured.\nThe Safavid commander of the citadel, Ustajli Süleyman Bey, met the same fate as his brothers, Mohammad Khan Ustajlu and Karahan Ustajli—he was killed along with all his troops. His severed head was sent to Sultan Selim as a trophy. Following the fall of Mardin, Ottoman forces advanced into major cities across the Euphrates–Tigris basin, including Raqqa, Urfa, Batman, and Mosul.\nAfter capturing Mardin, Idris Bitlisi and Bıyıklı Mehmed Pasha besieged Hasankeyf, capturing the city shortly thereafter. The governor of Hasankeyf, al-Malik al-Hasan (?–1525), along with the castle defenders Davud Bey, Şeref Bey, and Mehmed Bey, were all taken prisoner by the Ottomans.\nLater, in April 1517, Bıyıklı Mehmed Pasha and Bedir Bey defeated Ahmed Bey Afshar and captured Mosul, bringing an end to the .\nAftermath\nFollowing these battles and campaigns, the Ottomans secured control over Eastern Anatolia and northern Iraq (including Mosul).\nThese conquests also significantly reduced the influence of Qizilbashs and addressed the Alevi unrests in Anatolia. Until the outbreak of the Celali rebellions, the Ottoman Empire maintained its territorial integrity in the region. As a result of his military successes, Selim I earned the epithets Yavuz (\"the Resolute\" or \"the Grim\").\nSee also\n*Battle of Ovacık (1515)\n*Siege of Harput (1516)\n*Battle of Koçhisar (1516)\n*Battle of Tabriz (1514)\n*Battle of Mosul (1517)\n*Siege of Bayburt (1514)\nReferences"
    }
  ]
}