{
  "content": [
    {
      "type": "text",
      "text": "# Ottoman–Ethiopian War (1557–1589)\n\nOttoman–Ethiopian War}}\n** Ottoman victory in the coastline\n** Establishment of Habesh Eyalet in Hergigo and Massawa\n| combatant1        =  Ethiopian EmpireMedri Bahri (1557–1561)\n| combatant2        = •  Egypt Eyalet•  Yemen Eyalet Adal Sultanate (1576)Medri Bahri (1561–1578)\n| commander1        =  Gelawdewos Menas  Sarsa DengelYeshaq (1557–1561)\n| commander2        =  Özdemir Pasha  Beylerbey Ahmad Pasha  Kedwart PashaYeshaq (1561–1578) Muhammad ibn Nasir\n| units1            =\n| units2            =\n| strength1         =\n| casualties1       =\n| casualties2       =\n| notes             =\n| campaignbox       =\n| territory         = Annexation of the Eritrean coastline excluding Baylul\n}}\nThe Ottoman–Ethiopian War was a period of military conflicts lasting from 1557 to 1589 between the Ottoman Empire and its allies on one side and the Ethiopian Empire on the other. The war was triggered with the Ottoman Empire invading territories of the Ethiopian Empire starting in 1557, when Özdemir Pasha took the port city of Massawa and the adjacent city of Arqiqo, followed by Debarwa, then capital of the Bahr Negus Yeshaq. The conflict continued over the next three decades and would only end in 1589. Afterwards, like Ottoman rule in North Africa, Yemen, Bahrain, and Lahsa, the Turks had no \"effective, long term control\" outside of the port and island where there was a direct Ottoman presence. As a result, the Ottomans were left with domain over Massawa, Arqiqo, and some of the nearby coastal environs, which were soon transferred to the control of Beja Na'ibs (deputies).\nYeshaq sought the assistance of Emperor Gelawdewos. Upon being reinforced by a large Abyssinian army, he recaptured Debarwa, taking all the gold the invaders had piled within. After growing disillusioned with the new Emperor of Ethiopia, Menas, he revolted with Ottoman support in 1560. He then pledged his allegiance again with the crowning of Emperor Sarsa Dengel. However, not long after, Yeshaq revolted once again with Ottoman support. He was defeated by the Emperor once and for all along with his Ottoman ally, the Beylerbey of Habesh, Ahmad Pasha, at the Battle of Addi Qarro where both were killed. The Ottomans abandoned their further territorial ambitions in 1589 after a series of defeats at the hands of the Ethiopian Emperor Sarsa Dengel.\nBackground\nÖzdemir Pasha had the rare chance to meet Sultan Suleiman in person within the private gardens of Topkapı Palace. There, he proposed a strategy to build on recent successes in Yemen by expanding Ottoman influence along the African coast of the Red Sea. The sultan found Ozdemir's argument persuasive, and before the year ended, he was dispatched to Egypt with approval to assemble an expeditionary force of several thousand troops. The Lahsa (al-Hasa) and Habesh eyalets were proclaimed, with Özdemir Pasha assigned the task of conquering Habesh.\nSpecific Ottoman interest in Habeshistan arose from its pivotal geographic position in the region: it had ports and coastline on both the Red Sea (and near the Bab-el-Mandeb, where Ottoman blockades could be performed if necessary) and on the Indian Ocean (specifically Zeila and the Somali coast). The Ottoman navy was still relatively weak and in its infancy, so Ottoman land forces would have to capture key areas to ensure that the weak navy would have some influence and strengthen. Selman also recognized a religious duty to conquer Habesh.\nAfter the 1517 conquests, the Ottomans also were interested in the region because of the hajj. Having conquered the former Muslim defenders of the hajj, the Ottomans, being the successor of those states, was charged with protecting and providing safe passage to all undertaking the hajj. Portuguese hegemony in the Red Sea and Indian Ocean, however, gave them some control over hajjis. In the same vein, other Muslim states in the region saw the Ottomans as their defenders as Muslim brothers:\n}}\nFinally, there was a pre-emptive element to the Ottoman invasion of Ethiopia. If the Portuguese had built fortresses and taken control of the Red Sea ports first (especially Dahlak), they would have controlled the whole region, both directly and through their allies. Despite the possible economic gain from taxing Habesh proper, the Ottomans were more concerned with overcoming and outmaneuvering the Portuguese in the Red Sea and Indian Ocean.\nThe Ottoman activities in Ethiopia proper preceded their invasion. They had supported the campaign of Adal Sultanate (which had begun in 1527) which was an Ottoman ally and attacked Ethiopia with the help of 200 Turkish arquebusiers. Following the Imam's reverse after the Battle of Jarte in 1542 they had sent him badly needed aid in the form of matchlockmen sent to Adal at a time when firearms in the region were rare: 10 cannons with artillery men, as well as many as 900 gunmen in 1542. This support led to the destruction of almost all the Portuguese force under Christopher da Gama. However, the surviving Portuguese forces teamed up with an Ethiopian contingent led by Gelawdewos and the Christian army was able to decisively defeat the Muslims in the Battle of Wayna Daga. Following this episode, the remainder of the Adalite-Ottoman army in Ethiopia withdrew.\nOttoman invasion\nThe Ottomans invaded the Kingdom of Medri Bahri, now modern-day Eritrea, in 1557 with a force of 3,000 janissaries, 1,000 horsemen who were sent from Egypt, and in addition to the men Ozdemur brought with him from Suakin First, they captured Massawa, Hirgigo and Beylul then moved inland and captured the regional capital of Debarwa from the Abyssinian Kingdom, he built masjids, a large mosque, and \"established a fort [...] with 'a long wall and very high tower... filled with vases of gold and silver, precious stones\", and other valuables that were obtained by looting, extractions on trade, and the imposition of a poll tax on the local population. Ozdemir Pasha had also captured the northern and north-west parts of Ethiopia. A fort was also constructed at Hergigo; a planned fort at Massawa had to be abandoned due to a lack of suitable building materials. Debarwa was then given to the local noble Ga'éwah, the sister of Ahmed ibn Ibrahim al-Ghazi's mother-in-law. According to Cengiz Orhonlu, Debarwa was intended to be the \"base of penetration of [...] Ethiopia\", but had to be abandoned for several reasons. Reinforced by an army dispatched by Emperor Gelawdewos, the forces with Bahr Negus Yeshaq decisively scored a victory against the Ottomans, recapturing Debarwa and seizing the immense treasure the invaders piled.\nThe Ottomans at this point made a change in tactics, opting to pit Ethiopian rulers against each other in order to achieve their conquest, rather than invading unilaterally. They had employed this same tactic earlier in the Balkans: absorbing local entities through local rulers due to a shortage of manpower (here because of its peripheral nature and problems with the Safavids and in the Mediterranean) rather than direct conquest. The Bahr Negash Yeshaq had bad relations with Emperor Menas, who had just assumed the throne, so in 1561 he revolted against Menas, but the following year he was defeated in battle. Yeshaq then fled to the Ottomans and promised to cede them Debarwa, Massawa, Arqiqo, and all the land in between in return for their help. On April 20th 1562, Osman Pasha defeated Menas in a battle at Enderta in the Southern Tigray region. Gunpowder weapons played a crucial role in the Ottoman victory. Yeshaq and the Emperor later made peace, and the Ottomans withdrew from Debarwa in 1572, which Yeshaq quickly occupied, but he returned it to the Ottomans as a result of the earlier agreement. Lobo stated that the Turks and the Bahr Negash joined forces against him, defeated him, and ruined his army so thoroughly that he could no longer hold the campaign; he was forced to hide in the mountains, where he led a wandering and languishing life until his death in 1563. An alliance with the Sultanate of Adal was also in the works.\nEthiopian counteroffensive\nIn 1576, Sarsa Dengel, Menas' successor, liquidated a massive invading Adalite army at the Battle of Webi River where he captured and executed the Adalite Sultan along with the core of the Adalite nobility thereby permanently extinguishing Adal as a military power. Özdemir Pasha would absorb Zeila from the weakened Adalites in 1559\nAfter failed reconciliation attempts with the Bahr Negus, he then marched north to Tigray where he dealt the Ottomans and their Medri Bahri allies a crushing defeat at the Battle of Addi Qarro, killing Ottoman Commander Ahmad Pasha along with the rebellious Bahr Negus Yeshaq.\nThe victorious Emperor then advanced on Debarwa whereupon the Turkish garrison surrendered with all its firearms. Sarsa Dengel then seized the vast riches stored by the Turks in Debarwa and ordered the destruction of the mosque and the fort that was erected during the Ottoman occupation. According to Ottoman sources, the Ethiopians then took Arqiqo and managed to destroy Massawa's fort as well as kill 40 of its 100 defenders, though it failed to take the city. As a result, 100 musketeers and 100 cavalrymen were sent to Massawa from Egypt. Given Debarwa's importance as a staging point for the conquest of the rest of Ethiopia, further Ottoman advances on the city were inevitable. Massawa was reinforced by 300 musketeers, 100 cavalry, 10 canonneers, 10 large guns, and 5 builders to repair the fort, all from Egypt. Again employing their earlier tactic of fighting with local leaders, the Ottomans appointed a man named Wad Ezum as Bahr Nagash, and in 1588 moved inland where they were defeated by a local lord. Emperor Sarsa Dengel was alarmed by the Ottoman expansion, and replied with a razzia on the Ottoman fort at Hergigo in 1589 where he killed the Ottoman commander Kedwart Pasha at the Battle of Arkiko.\nThe Emperor then turned south where he eliminated the Tigrean chief who coallaborated with Ottomans. Upon his return to Debarwa, the Ottomans sent him lavish gifts suing for peace. The Emperor accepted the gifts and thereby made peace with the Ottomans, sparing their fort at Arkiko. After these series of defeats and the resulting peace agreement, the Ottomans abandoned their territorial ambitions in 1589.\nLater relations\nThough pivotal to the control of the Red Sea, Habesh as a whole was less important than the Mediterranean or Eastern border with the Persian Safavids. After the death of Ozdemir Pasa, much of the Ottoman conquests were reversed, and the Yemeni revolt in 1569–70 further reduced the importance of Habesh.\nRecognizing the difficulty of expanding its territories and the minimal gain from success, in 1591 Habesh was put under the jurisdiction of a local Beja Na'ib, or deputy, who was to pay an annual tribute to the Ottomans, with a small Ottoman garrison left in Massawa.\nFurther relations between the Ethiopian emperor and the Ottoman Na'ib were marked by periods of relative peace and others of confrontation. The first major conflict came in 1615, in the reign of the Portuguese-influenced (he would later convert to Roman Catholicism) Ethiopian Emperor Susenyos. During the reign of the Na'ibs, Ottoman raiding parties from the garrison at Massawa would periodically raid the surrounding hinterland for cattle, slaves, and other booty. One such raid was defeated, which angered the Pasha of Massawa, who decided to impound goods at the port meant for the Emperor until 62 muskets taken from his men were returned. As a result, Susenyos ordered the governor of a northern province to cut the Na'ib off from Ethiopian supplies, as the eyalet of Habesh had no supplies of its own. Though the Pasha told his men to acquiesce in case of such an event before leaving on a hajj, he was replaced by another Pasha who was unyielding. Susenyos later commented that if he wished to retake Arqiqo, he could do it quickly, but could not hold it against retaliatory Ottoman assaults.\nDespite the relative weakness of the Na'ib and Ottoman garrison in the province, the threat of real Ottoman presence and attack kept the territory safe from attack. Even with the weakness of the Ottoman garrison, attacks continued with a number of soldiers and Arabs raiding the countryside for cattle in 1624; this raid was defeated, and its weapons (many firearms and scimitars) were captured and used against the fort at Hergigo. Susenyos then once again prevented caravans from supplying the ports in order to get more favorable terms in any future treaty.\nA peace treaty was finally brokered in which goods for the Emperor and the Ethiopian Church would be exempted from taxes, imperial agents and Jesuits had free travel, and the Ottomans would only purchase slaves by the Ottomans brought to the port by caravan; the treaty was to be honored by the successors of the rulers as well and contained provisions for breaking the treaty. As a result of the peace and Ottomans' technological superiority, Massawa, with its Ottoman garrison, was not fortified, while Hergigo was defended by a fortress guarded by artillery.\nRelations under Susenyos's successor, Fasilides, were markedly better. Susenyos's conversion to Catholicism had resulted in a backlash against the Catholic Portuguese. Fasilides expelled or killed all Jesuits, burned their books, and in 1648 made agreements with the Pashas of Massawa and Suakin to execute any Jesuits attempting to enter Ethiopia through those ports. There was little change in the relatively good (though obviously tense due to contrary intentions) relations until the reign of Iyasu I at the end of the 17th century. The Na'ib seized gifts intended for the Emperor because of their high value, and attempted to levy a tax on them. Refusing to pay, Iyasu banned a northern province from supplying Habesh with food on pain of death. The Na'ib was forced to give back the goods, supplemented with rugs in order to prevent famine in Habesh. In later interactions in the mid-18th century, the Na'ib would prevail over Iyasu II through his threat of killing Ethiopian clergy impounded in Massawa as a retaliation for cutting off food.\nLegacy\nWhen the Ottomans surrendered the fort of Debarwa to Emperor Sarsa Dengel after his victory over them at the Battle of Addi Qarro, they fired cannons as ceremonial salutation. This caught the imaginations of the Emperor's troops and inspired the Ethiopian tradition of firing cannons on notable occasions which continues to this day.\nSee also\n* Indian Ocean campaigns\n* Habesh Eyalet\n* Ottoman Zeila\nNotes\nReferences\n*"
    }
  ]
}