{
  "content": [
    {
      "type": "text",
      "text": "# Our King, Dr. Martin Luther King, Jr.\n\n| owner = Westside Health Authority\n| accession = [https://siris-artinventories.si.edu/ipac20/ipac.jsp?menu=search&aspect=Keyword&npp=50&ipp=20&spp=20&profile=ariall&ri=1&source=%7E%21siartinventories&index=.NW&term=87580085&x=0&y=0&aspect=Keyword IAS 87580085]\n}}\nOur King, Dr. Martin Luther King, Jr. (also known as \"The Chieftain\" or \"Chieftan Statue\") is a public bronze sculpture in Chicago of Martin Luther King Jr. produced by sculptor Geraldine McCullough. It is currently located in a public plaza outside of the Austin Health Center, at the corner of Chicago Ave and the section of Cicero Ave designated \"Mandela Road\", after the South African leader Nelson Mandela. The sculpture depicts King in a manner inspired by traditional African art, wearing a chieftain's garb, along with other symbols.\nHistory\nThe sculpture was unveiled on January 15, 1973 at its original location in East Garfield Park, outside the Martin Luther King Plaza Apartments at 3234 West Madison. The statue was placed at apartments that had burned during riots after King's assassination, and were unveiled on what would have been his 44th birthday, becoming the earliest known Chicago statue depicting King. By the early 2000s, the work was beginning to show signs of deterioration in the wooden base and corrosion of the statue's bronze, due to lack of proper care.\nWhen the property owner eventually moved the work into storage, and considered scrapping it, Rickie P. Brown, the Executive Director of the West Side Historical Society, organized an effort to reclaim the statue for a new location. On July 18, 2015, the statue was rededicated at its current location outside the Austin Health Center with a festive event featuring music and speeches.\nDescription\nThe statue is included in the Smithsonian Inventory of American Sculpture, with the following description:A portrait of Dr. Martin Luther King, Jr. as an African Chieftain. He holds a Coptic cross in his proper left hand and an Indian Prayer Wheel topped with a globe in his proper right hand. A dove of peace sits on his head and he wears the Nobel Peace Prize medal around his neck. He wears the dress of African royalty. There are twelve tiny heads around the crown of the headdress which represent his followers.Other sources refer to the prayer wheel as Tibetan. The element referred to as a Coptic cross is alternatively described by James Reidy's book Chicago Sculpture as a \"broken sword with a cross-shaped handle\". Since the unveiling of the new statue in its current location, a new inscription was added with additional details of its history (using a different name, \"Chieftan Statue\"):\"Chieftan Statue\"\nLocally famous sculptor Geraldine McCullough's impressive 7 foot tall bronze casting portrays Dr. Martin Luther King, Jr. as an African 15th Century Benin chieftain. The casting was commissioned to create a symbol of peace following the riots of 1968 after the assassination of Dr. Martin Luther King.\nThe tiger-tooth necklace indicates courage, and the side shields of the mask, one who shuns evil. The sculptor noted a similarity between King's facial features and those of the tribal group inhabiting ancient Benin in southern Nigeria and decided to portray her subject as a Bini ruler.\nShe was aware that Benin was famous for the great artistic merits of its bronze castings; and, just as the sculpture of Benin has a complex symbolism, so too has her bronze image of the civil rights leader. To call attention to his philosophy of nonviolence, she placed in one hand a broken sword with cross-shaped\nThe statue was first dedicated on January 15, 1973—what would have been Dr. Martin Luther King Jr.'s 44th birthday—about 3 miles from here, on Madison Street near Kedzie Avenue in the East Garfield Park neighborhood. It was relocated here at Chicago and Cicero avenues in 2015. handle.\nThe other hand holds a prayer wheel, meant to refer to universal prayer and Gandhi's philosophy of passive resistance. Around the figure's muscular neck are a necklace of tigers' teeth worn by Bini royalty and the Nobel Peace Prize medallion awarded to King in 1964. The row of heads of people on the crown represents King's followers. Above is a dove of peace.\n\"Darkness cannot drive out darkness; only light can do that.\"\nDr. Martin Luther King\nReferences"
    }
  ]
}