{
  "content": [
    {
      "type": "text",
      "text": "# Ovation Awards\n\n}}\nThe Ovation Awards were a Southern California award for excellence in theatre, established in 1989. They were given out by the non-profit arts service organization LA Stage Alliance and are the only peer-judged theatre awards in Los Angeles. Winners were selected by a voting committee of Los Angeles–area theater professionals who are selected through an application process every year. The Ovation Awards ceremony was held at different theatres throughout the Los Angeles area, including the Ahmanson Theatre and the Orpheum Theatre. Hosts for the ceremonies have included Nathan Lane, Lily Tomlin, and Neil Patrick Harris.\nEligibility\n* The producer(s) must be a qualifying member of LA Stage Alliance.\n* Productions must meet one or more of the following requirements: Include a director who is a full member of The Society of Stage Directors and Choreographers (SDC), a designer who is a full member of United Scenic Artists (USA), an actor who is a full member of Actors' Equity Association (AEA), or producer(s) who have previously produced an Ovation Award–nominated production in the previous three seasons.\n* In addition, eligible productions must meet the minimum number of performances, currently ten for intimate theatres and six for larger theatres.\n* Productions in venues with more than 100 seats which include no members of any theatrical union, and those produced by companies that are currently involved in a union labor strike, are ineligible.\nCategories\nProduction\n*Musical – Large Theatre\n*Musical – Intimate Theatre (Franklin R. Levy Award)\n*Play – Large Theatre\n*Play – Intimate Theatre\n*Touring Production\nPerformance\n*Lead Actress in a Musical\n*Lead Actor in a Musical\n*Featured Actress in a Musical\n*Featured Actor in a Musical\n*Lead Actress in a Play\n*Lead Actor in a Play\n*Featured Actress in a Play\n*Featured Actor in a Play\n*Ensemble Performance\n*Solo Performance (Ray Stricklyn Memorial Award)\nDirection/Choreography/Design\n*Direction of a Musical\n*Direction of a Play\n*Choreography\n*Music Direction\n*Set Design – Large Theatre\n*Set Design – Intimate Theatre\n*Lighting Design – Large Theatre\n*Lighting Design – Intimate Theatre\n*Sound Design – Large Theatre\n*Sound Design – Intimate Theatre\n*Costume Design – Large Theatre\n*Costume Design – Intimate Theatre\nWriting/Composition\n*Playwriting of an Original Play\n*Books/Lyrics/Music for an Original Musical\n2021 Ceremony and Aftermath\nThe 2021 awards ceremony featured several prominent mistakes taken as slights on marginalized communities. The ceremony did not provide an interpreter for the deaf, despite requests from nominated Deaf West Theatre. During the ceremony, actress Jully Lee's first name was mispronounced and she was misidentified with a photograph of a different Asian American actress. Two other nominees of color were also incorrectly pictured, with photos of their white costars displayed instead.\nIn response, over forty participating theatre companies revoked their membership in the LA Stage Alliance, citing the organization's disenfranchisement of Asian Americans and Pacific Islanders (AAPI) as well as people of color (BIPOC) from the Los Angeles theatre community. The Alliance, facing existing financial and organizational difficulties, initially released plans for institutional reform before deciding to disband altogether.\nLists of winners\n* 2007 Ovation Awards\n* 2008 Ovation Awards\n* 2009 Ovation Awards\n* 2010 Ovation Awards\n* 2011 Ovation Awards\n* 2012 Ovation Awards\n* 2013 Ovation Awards\n* 2014 Ovation Awards\n* 2015 Ovation Awards\n* 2016 Ovation Awards\nReferences\nExternal links\n*[http://www.lastagealliance.com/ovationawards The LA Stage Alliance Ovation Awards ]"
    }
  ]
}