{
  "content": [
    {
      "type": "text",
      "text": "# Ovation (award)\n\n| year = 1991–present\n| website = [http://www.ovacija.org/ Official website]\n}}\nOvation is a Russian national music award in the field of entertainment and popular music. Along with ZD Awards, it is one of the major mainstream music awards in Russia, with other awards in the Russian entertainment industry, such as Nika Award. The Ovation Award covers all genres, including classical music, folk music, rock and pop music, jazz, and musical theater.\nThe first Ovation ceremony was held in 1992, initiated by businessman Grigory Kuznetsov. The awards can be compared to American Grammy Awards and British Brit Awards.\nAmong the award winners are such pop icons of Russia and Eastern Europe as Alla Pugacheva and Valery Leontyev, as well as famous rock performers such as Bi-2 and Andrey Makarevich. In 2002, Vitas was named best singer, and the hit of the year was the single “Not Gonna Get Us” by t.A.T.u. The only international artists to have received the Ovation Award were Michael Jackson in 1994 and Natalia Oreiro in 2002, who received awards in the category of best concert tour.\nThe awards ceremony, whose trophy is a pair of applauding hands, was held in various concert halls in Moscow or St. Petersburg.  Initially, the winners were to be determined by the audience: anyone could buy a special card, fill it out and send it to the organizers. However, this method was only used to determine the winners at the first ceremony in 1992. At all subsequent Ovation events, the winners were determined by a special jury - the Higher Academic Commission, consisting of show business figures, journalists and various artists. \"Ovation\" trophies are awarded in several dozen categories, including \"Soloist of the Year\", \"Composer of the Year\", \"Best Rhythm and blues Album\", \"Best Vocal Debut of the Year\", etc. Additionally, there are various special prizes, such as \"Living Legend\" or the award for a major contribution to the development of the national culture. The prize has been awarded every year except 1993 and 2003–2007. The last time the award ceremony took place was in 2016.\nLiving Legend Award\nSource:\n* 1994 — Alla Pugacheva\n* 1995 — Joseph Kobzon\n* 1996 — Edita Piekha\n* 1998 — Makhmud Esambayev\n* 1999 — Valery Leontiev\n* 2000 — Yuri Antonov\n* 2001 — Igor Moiseyev\n* 2002 — Aleksandra Pakhmutova\n* 2003-2007 was not awarded\n* 2008 — Mstislav Rostropovich, Muslim Magomayev,\n* 2009-2015 was not awarded\n* 2016 — Alexander Zhurbin\n* 2017-2024 was not awarded\nFile:RIAN archive 378862 Alla Pugacheva (cropped).jpg|Alla Pugacheva, Pop singer.\nFile:Kobzon with mic.JPG|Joseph Kobzon, Pop singer.\nFile:Pieha Edita Stanislavovna.jpg|Edita Piekha, Pop singer.\nFile:Махмуд Эсамбаев.jpg|Makhmud Esambayev, Dancer.\nFile:Valery Leontiev at Laima Rendez Vous Jurmala 2017 (2).jpg|Valery Leontiev,  Pop singer.\nFile:Yuri Antonov (musician) (2015-12-10) 04.jpg|Yuri Antonov, Composer, singer\nFile:Igor Moiseyev 1961.png|Igor Moiseyev, Choreographer of character dance.\nFile:Aleksandra Pakhmutova.jpg|Aleksandra Pakhmutova, Composer.\nFile:Mstislav Rostropovich 1978.jpg|Mstislav Rostropovich, Cellist and conductor.\nFile:Maria Borisovna Mulyash.jpg|Maria  Mulyash, Music editor.\nSee also\n* Russian pop music\nReferences\nExternal links\n*[http://www.ovacija.org/ Official website]"
    }
  ]
}