{
  "content": [
    {
      "type": "text",
      "text": "# Owaraha\n\n| pushpin_map = Solomon Islands\n| pushpin_map_caption = Location in Solomon Islands\n| pushpin_label = Owaraha\n| archipelago = Solomon Islands (archipelago)\n| country =\n| country_admin_divisions_title = Province\n| country_admin_divisions = Makira-Ulawa Province\n| highest_mount = Farina\n| elevation_m = 143\n| population = 1547 (2009)\n}}\nOwaraha or Owa Raha (also known as Santa Ana) is an island in Makira-Ulawa Province, Solomon Islands.\nDescription\nThis relatively small coral island is 5.6&nbsp;km long and 4.5&nbsp;km wide. It is located at the eastern end of Makira (San Cristobal), separated from it by a 7.5&nbsp;km wide strait, and just north of smaller Owariki (Santa Catalina). The sound between Owaraha and Owariki is only 2.5&nbsp;km wide. The island has two main villages Gupuna (or Ghupuna) and Nafinotoga. The inhabitants of Owaraha speak the Owa language and share the same culture with the people in Owariki and in the eastern end of Makira Island. The Pagewa and Aiga Tatari clans of Owaraha and other nearby islands claim descent from the refugees from Teonimanu which was washed away.\nHistory\nFirst recorded sighting by Europeans was by the Spanish expedition of Álvaro de Mendaña on 4 July 1568. More precisely the sighting and also landing in Owahara was due to a local voyage done by a small boat, in the accounts the brigantine Santiago, commanded by Francisco Muñoz Rico and having Hernán Gallego as pilot. They charted it as Santa Ana.\nOwaraha was visited by Austrian anthropologist and photographer Hugo Bernatzik in 1932. Bernatzik carefully documented daily life among the island people and published an ethnography a few years later. He also took some of the best and earliest photographs of the islanders, reflecting a culture that he deemed was dying in contact with the modern world.\nDuring his sojourn in Owaraha Bernatzik met Heinrich Küper, a German adventurer who lived in Gupuna village. Küper was married to a respectable local woman, Kafagamurirongo, and was the only white who ever reached the arafa (high person) status within a Melanesian community. Küper's grandchildren still live in Owaraha.\nReferences\nExternal links\n*"
    }
  ]
}