{
  "content": [
    {
      "type": "text",
      "text": "# Owens Valley Indian War\n\n| combatant2        = MonoShoshoneKawaiisuTübatulabal\n| commander1        = William Mayfield George S. Evans Herman Noble Moses A. McLaughlin\n| commander2        = Captain GeorgeJoaquin JimShondowTinemba\n| strength1         = 2-3 Companies of 2nd Regiment California Volunteer Cavalry60 Mayfield's militia\n| strength2         = +500 Mono people\n| casualties1       = 60\n| casualties2       = 200\n| notes             =\n}}\nThe Owens Valley War was fought between 1862 and 1863 by the United States Army and American settlers against the Mono people and their Shoshone and Kawaiisu allies in the Owens Valley of California and the southwestern Nevada border region.  The removal of a large number of the Owens River indigenous Californians to Fort Tejon in 1863 was considered the end of the war. Minor hostilities continued intermittently until 1867.\nOrigins of the conflict\nDuring the winter of 1861–1862, in the Owens Valley, the storms that produced the Great Flood of 1862 resulted in snow and flooding conditions in the surrounding mountains and as far to the east as the Mono County seat at Aurora. There had been light snowfall in November, then mild weather until Christmas Eve when it began a heavy and rapid snowfall for days, the temperature dropped below zero and the passes over the Sierra were closed. During the second week of January it warmed slightly and the snow became a torrential rain.  Creeks overflowed their banks, flooding low-lying areas.  After a week it cooled again and snow began to fall.  Within a few days the snow was deeper than it had been before the rains had begun to fall.  Samuel Young of Aurora, recorded in his diary that the snow and rain had fallen for twenty six days out of thirty since December 24, 1861.\nThis cold weather and flooding resulted in the local Paiute suffering the loss of much of the game they depended on.  Additionally, the cattle driven into the Owens Valley in 1861 to feed the Aurora miners, competed with the native grazers. They also ate the native wild plant crops the Paiute irrigated and depended on as a staple to survive.  Starving, the Paiute began to kill the cattle and conflict with the cattlemen began, leading to the subsequent Owens Valley Indian War.\nEvents, skirmishes and battles of the Owens Valley Indian War\nBeginning of hostilities\n* Thompson - Crossen Incident\n* San Francis Ranch peace conference - January 31, 1862\n* McGee Brothers cattle drive - Feb. 1862\n* Van Fleet - Shondow Fight -\n* Taylor Cabin Fight -\n* Threatened settlers concentrated their herds  north of Owens Lake at the meadows on Oak Creek. They then sent messages for help to Aurora, county seat of nearby Mono County, and Visalia, county seat of their own Tulare County, over the Sierra Nevada mountains, for help.\n* Colonel James H. Carleton, the Commander of the District of Southern California, received correspondence from Mr. S. A. Bishop of Fort Tejon and Mr. W. A. Greenly of the Owens Valley explaining the situation in the Owens Valley and requesting military assistance.  Col. Carlton had Colonel George W. Bowie, Commanding Officer of Camp Latham, issue Special Orders Number 7. - March 17, 1862.\n** Lieutenant Colonel George S. Evans and a detachment of companies G, I and K, Second Cavalry, California Volunteers, was ordered to proceed from Camp Latham to Owens Valley via Fort Tejon. Evans was to investigate the situation in Owens Valley and report back. His command was to take forty days rations and one hundred rounds of ammunition per man.\n* When Acting Indian Agent for Nevada, Colonel Warren Wasson, had been informed of events to the south, he wired James W. Nye, Governor of Nevada Territory, then in San Francisco, about a peace mission to the Owens River Valley to prevent an Indian War from involving Nevada.  Governor Nye approved the idea and asked General George Wright, Commander of the Department of the Pacific, for a fifty-man escort for the mission. General Wright ordered Captain E. A. Rowe, Commander of Fort Churchill, Nevada, to provide the necessary men.  Captain Rowe ordered Post Lieutenant Herman Noble, 2nd Cavalry, Detachment Commander in Aurora, Nevada, to proceed to the Owens Valley with Colonel Wasson on a peacekeeping mission. Lieutenant Noble and his detachment linked up with Colonel Wasson about  south of Aurora on April 4, 1862, and proceeded southward towards the Owens Valley.\n* Raid on Alabama Hills Camp by settler posse under Charles Anderson - March 20, 1862\n* Volunteers arrive. 18 men from Aurora under John J. Kellogg, former Army captain and 22 from Visalia under Colonel William Mayfield, a retired Army officer.  Combined with local settlers, Colonel William Mayfield, as senior officer, led a force of 60 men on a march  north up the valley. - March 28, 1862\nEvans' first campaign\n* Lieutenant Colonel Evans' detachment of cavalry arrived at Owens Lake. - April 2, 1862.\n* Skirmish at Putnam's Trading Post - Evans chased off Paiute who had put settlers at Putnam's under siege. - April 4, 1862\n* Captain Wynne left with supplies, in command of a small garrison at Putnam's Trading Post while Lt. Col. Evans advanced up the valley to catch up with Col. Mayfield. - April 5, 1862\n* Battle of Bishop Creek - April 6, 1862\n* Lt. Colonel Evans met Col. Mayfield's militia retreating back to Putnam's Fort and camped overnight  north of Putnam's, at Big Pine Creek. - April 6, 1862.\n* Colonel Mayfield reported to Colonel Evans that forty of his militia were still ready to march and fight the Indians.  As Evans' and Mayfield's force marched north, Evans' scouts reported that Lieutenant Noble with fifty men of Company A, 2nd Cavalry, from Fort Churchill on their way south to Putnam's Store were nearby. Colonel Evans halted until Lieutenant Noble's command could come up with them and then proceeded to the north. - April 7, 1862.\n* Scouts were sent out and one scout returned reporting a large force of Indians  away near Bishop Creek. Evans moved up in a snow storm, but the Indians had left at the approach of the main body of cavalry. Campfires were observed in a canyon to the north. - April 8, 1862\n* Battle of Mayfield Canyon - April 9, 1862\n* Following the battle in Mayfield Canyon, Colonel Evans, out of provisions after feeding both his men and citizens in the Owens Valley, decided to return to Camp Latham, via Putnam's Store. Lieutenant Noble and his detachment accompanied Colonel Evans as far as Putnam's. The settlers demanded protection from the Indians from Colonel Evans. Colonel Evans explained that he did not have the authority to leave troops to protect the citizens and had no provisions for them to live upon if they did. Settlers had three options: remain in the valley, accompany Colonel Evans to Los Angeles or drive their livestock (4,000 cattle and 2,500 sheep) out of Owens Valley. Most of the settlers chose the latter. - April 10, 1862.\n* Colonel Evans started back some  to Los Angeles, and Lieutenant Noble returned to Aurora. - April 14, 1862\n* The Owens Valley Indians found they were left unopposed in the valley and attacked isolated parties of stockmen and miners throughout the area. - May and June 1862\nEvans' second campaign\n* Lt. Colonel Evans' detachment returned to Camp Latham. - April 28.\n** Evans' report recommended a military post be established in the Owens Valley to protect the citizens and the route to the mining areas from Visalia and Los Angeles.\n* Several citizens escorted out of Owens Valley by Colonel Evans traveled to San Francisco and urged General Wright that a permanent military post be established in the valley.  After reading Colonel Evans' report of the situation in Owens Valley, General Wright wrote to Colonel Ferris Foreman, new commander of Camp Latham, to send two or three companies of the Second Cavalry with Lt. Colonel Evans as commander to establish a post in the Owens Valley. - May 2, 1862\n* Captain E. A. Rowe, with a detachment of Company A, 2nd Cavalry, came to Adobe Meadows, establishing a camp for the purpose of having talks with Mono leader Mannawahe. - June and July 1862.\n* Colonel Evans with 201 men of Companies D, G and I, 2nd Cavalry, California Volunteers, departed Camp Latham for the Owens Valley. With them was a train of 46 wagons carrying equipment, ammunition and rations for the men.- June 14, 1862.\n* Evans reaches Owens Valley. - June 30, 1862.\n* After five days of chasing Indians in the valley, Colonel Evans decided that they  would not come out to fight in the open and that it was impossible to follow them in the mountains and that a permanent military camp was required. Camp Independence, a base of operations in Owens Valley, was established on Oak Creek and named for the occasion, Independence Day. - July 4, 1862.\n* Captain Rowe moved his command to a new camp east of the Owens River, opposite Camp Independence.  - July 5, 1862.\nFirst attempt at peace\n* Captain Rowe, Company A, 2nd Cavalry, California Volunteers, despatched a note to Colonel Evans at Camp Independence stating that he and Mr. Wasson, the Indian Agent, had talked to Indian leaders in the area and made a treaty with them. A temporary peace was made for the summer with the Owens Valley Indian leaders, in anticipation of a permanent arrangement to follow. - On July 7, 1862.\n** A meeting was arranged between Colonel Evans, Captain Rowe, Colonel Wasson and Captain George, a war chief of the Paiutes. Captain George stated that he didn't want to fight anymore and wanted to become a friend of the white man.\n** Colonel Evans felt that many of the promises made by Indian Agent Wasson could not be kept. He also reported that if the troops were withdrawn, the attacks would resume.\n* Department of the Pacific concurred with the terms of the treaty with the addition of provisions that the Indians were to restore all property stolen from the whites and they were to surrender four or five hostages to be a guarantee of their good faith.\n* J. H. P. Wentworth, Indian Agent for the Southern California District, met with Colonel Wasson and as a result sent messages out to the Indians to gather at Camp Independence. The meeting was held and a treaty was signed. - October 6, 1862\n** Captain George, Tinemaha, and several others surrendered themselves and their families as hostages.\n** chief of big pine band Joaquin Jim, not a participant in the treaty, continued hostilities.\n* Colonel Evans left Camp Independence to establish Camp Babbitt outside Visalia with Company D and I, 2nd Cavalry.  100 men of Company G, 2nd Cavalry, under Captain Theodore H. Goodman was left behind to garrison and continue building Camp Independence.\n* Captain Goodman resigned his commission, being replaced by Captain Ropes in command of Camp Independence. - January 31, 1863\nOwens Valley Indians return to war\n* Captain George disappeared from Camp Independence after receiving his rations. -  March 1, 1863\n** Captain Ropes sent soldiers to various settlements, warning people to stay home and be on their guard.\n* Four miners were attacked at Big Pine Creek, leaving 1 wounded and 1 killed. - March 2, 1863.\n* Captain Jack's band sacked the cabin of a mining company, taking guns and ammunition and destroying everything else not taken. Several other cabins were also sacked and another miner killed in the next few days.  At Ida Camp sections of a water pipe was taken for its lead. Later two miners fetching water from the spring for Ida were attacked, killing one, the other saving himself by a ruse.\n* Captain Ropes sent messages to Camp Babbit requesting assistance. Camp Babbitt immediately sent First Lieutenant S. R. Davis with 44 men to reinforce camp Independence.\n* Skirmish at Black Rocks - March 11, 1863\n* Battle of Alabama Hills - March 19, 1863\n* Company E, 2nd Cavalry arrived, as reinforcements under the command of Captain Herman Noble. - April 4, 1863\n* Battle of Big Pine Creek - April 9, 1863\n* Lt. Col. William Jones, Commander at Camp Babbitt, ordered Captain Moses A. McLaughlin to reinforce Camp Independence with a detachment of 24 men of Company D and 18 men of Company E, 2nd Cavalry, California Volunteers, with one 12-pounder howitzer, and four six-mule government teams, carrying rations, company property, ammunition, and forage.  Because settlers of Keyesville had appealed to the Department of the Pacific, orders included the instructions:\n* McLaughlin's detachment carries out the Keyesville Massacre - April 19,1863\nMcLaughlin's Owens Valley Campaign\n* Captain McLaughlin arrived at Camp Independence. As senior captain he became the new Camp Commander. - April 24, 1863\n*McLaughlin's Operations in Owens Valley - April 25 - May 14, 1863\n** McLaughlin changed tactics previously used in the war.  No longer pursuing the enemy up canyons in the mountains to be ambushed in places of their choosing, McLaughlin sent detachments of his men up the mountains at night.  Then at daylight they would sweep downward toward the valley, driving any enemy out into the valley where another detachment awaited to cut them off.\n** Under Captain McLaughlin the soldiers were constantly seeking out the Indian food stores and destroying them.\n** Scouting parties were employed in searching for any smaller bands who might have remained behind hidden in the tule swamps along the river, and scarcely a day passed without two or three of them being found and killed, and everything destroyed that could be of any use to the living. McLaughlin instructed the troops that it was of the utmost importance that prisoners should be taken, not only women but men, confident that their love of life would prompt them to furnish important information and that possibly they could be used as guides.\n** The Owens Valley Indians had never been taught how to maintain their firearms, and their firearms became rusted and encrusted with dirt, making many unserviceable. Some gun barrels exploded.\n* Several Indians who had remained hidden near the Owens River were captured by Captain Noble's men, and finding that they would not be harmed, but that they would receive food and clothing, and being informed through the interpreter that Captain McLaughlin came to make peace, not war, they were prevailed upon to conduct the troops to where they supposed a large party belonging to Joaquin Jim was encamped and where they could be surrounded. From these Indians McLaughlin learned that Captain George was near Death Valley and furnished them with passes and white flags, allowing them fifteen days from the 16th of May to find Captain George and the other Indians and bring them into camp. - May 14, 1863\n* Raid on Joaquin Jim's Camp - May 15–19, 1863\n* At Captain Noble's camp on Big Pine Creek, McLaughlin issued an order suspending hostilities until further orders and sent out more Indian messengers. - May 19, 1863\nCaptain George and others surrender, Paiute removed to Fort Tejon, Camp Independence abandoned\n* Captain George came to Camp Independence to talk peace. He indicated that he no longer wanted war. As a result of his surrender, more than four hundred Indians came in to lay down their arms. - May 22, 1863\n** The bands of Captain Dick and Tinemaha soon followed Captain George's example. By June there were 500 Paiute at the camp and almost 1000 by July.\n* Thomas M. Heston, of Visalia, was killed by Paiute, between Adobe Meadows and Aurora. - mid-June\n* Captain Brown with 90 soldiers and 26 Paiute including Captain George trailed Joaquin Jim through Round Valley, up Pine Creek and over Italy Pass into the Sierras, losing him a week later. - Late June 1863\n* By the time the surrendered Indians left under escort to Fort Tejon and the San Sebastian Indian Reservation they numbered over nine hundred. - July 11, 1863\n* Surrendered Mono people arrived at the Reservation, less 50 who had slipped away during the trip. - July 22, 1863\n* Captain McLaughlin abandoned Camp Independence, under orders to reopen and garrison Fort Tejon. - July 31, 1863.\n* Joaquin Jim in Long Valley and other remaining fugitive bands continued hostilities in the valley, no longer threatened by the soldiers at Camp Independence.\nApparent peace, mining rush, new settlements and minor incidents\n* Following the removal of the Paiute to the reservation, miners and other settlers believed that the Indian war was over, and began coming to the existing settlements, and new mining settlements sprang up:\n** Lone Pine, near the mouth of Owens River, Bend City, San Carlos, further up the river Chrysopolis, Galena, Graham City (or Riverside) and Owensville.\n** There were rushes to strikes in the White Mountains, Slate Mountain, the Keyes District, Head of the Lake, and the Sierra foothills.\n** Thousands of cattle were driven over the mountains into Owens Valley or through it into Nevada to escape the killing 1863-64 drought that beset the rest of California.\n* However, it was still dangerous for single travelers or small groups in the valley or surrounding mountains.\n** Stephen Orjada was ambushed by Indians as he rode from Keyesville to Walker Basin. - August 1863\n** Paiute attack miners in Little Round Valley. - August 2, 1863\n** W. L. Moore and Mark Cornish, coming from Aurora, beat off an attack by Paiute, killing two, near Adobe Meadows. - Mid August, 1863\n** Attack on the Church Party on Pine Creek in Round Valley. - September 2, 1863.\n* George K. Phillips organized and led a company of thirty well-armed men from San Carlos, with others from Bend City and the Union mill. With Merriam as guide, they left San Carlos to aid the three other men of the Church party to recover their bodies and punish their attackers. - September 3, 1863\n** The bodies of two men were recovered, one was never found, presumed captured.  Paiute were gone, leaving large supplies of pine nuts which Phillips' company destroyed.\n** Returning to San Carlos the party encountered two men intending to build a sawmill at Big Pine. Indians had warned them to leave, and after talking with the Phillips company they decided to do so.\n* During the remaining months of 1863, there were no further incidents with the Paiutes in Owens Valley.\n* Captain McLaughlin made a tour of inspection of Owens Valley as far as Bishop Creek. - November 23 - December 16,1863\n** McLaughlin reported:\nThe valley is fast filling up with settlers and miners, and no fear is entertained of Indians as far up as Bishop Creek, which is the highest settlement in the valley. There the people are very uneasy, and fear to travel to and from Aurora, from whence their supplies are obtained. I would therefore respectfully recommend that so soon as the grass is sufficiently good that a force be sent into the valley to be stationed between Bishop Creek and Aurora, where the greater portion of the Indians supposed to be now in the valley are congregated.\n* A letter to the Alta California, from Bend City, dated December 17, 1863, said: \"With regard to the Indians, all has been quiet on Owens River for months past, and there is no prospect of a renewal of hostilities.\"\nNew trouble\n* During the latter part of 1864 Indian depredations began again, and white settlers or travelers were picked off when it could be done safely.\n* Lieut. Robert Daley, commanding a detachment of Second Cavalry California Volunteers, was ordered to escort the Indian agent to the Owens River Valley to ascertain the true condition of the Indians there as soon as possible. - October 22, 1864\n* Horse trader named Watkins killed at Black Rocks Springs.\n* Affair at Cinderella Mine - November 21, 1864\n* The band of Joaquin Jim attacked a mine  from the Cinderella Mine, but the miners escape in a running fight. - November 22, 1864\n* The Cinderella Mine Affair and others led to the citizens of Owens Valley sending a petition to General Irvin McDowell, then commanding at the Presidio of San Francisco: - November 29, 1864\n* When McDowell did not immediately send any troops for Owens Valley, many residents left for safer locations, while the remaining inhabitants determined to fight.\n** Citizens of Owensville organized volunteers, with lawyer/gunfighter Will Hicks Graham as captain.\n** At Bend City W. L. Moore and W. A. Greenly were selected to lead the volunteer forces.\n*  Meanwhile, Lieut. Robert Daley, having returned from the Owens Valley, reported on conditions there: - December 3, 1864\nSir: In accordance with orders from headquarters Department of the Pacific, I have the honor to make the following report relative to the Indians in Owen's River Valley: I found Indian supplies in the valley not good, and the most of the Indians had left for the mountains. The Indian agent invited them to come in. Sixteen came and made the following report: They said they had been maltreated by the whites in various ways. To use their own language, they said Americans no good men. Hire Indian, and not pay him according to agreement. I learned from Mr. Maloney, one of the present proprietors of Camp Independence, that the settlers of the valley were in the habit of sending to the Tule River Reservation for Indians to come and work for them, and when they would get them there decline paying them, and after a certain length of time drive them from their claims and cabins without pay or allowance. The Indians said they would retaliate and drive the whites out of the valley. From what I could learn from the best authority (white settlers), I find that unless troops are sent there the whites will have to leave the upper portion of the valley, as all the men connected with mining in White Mountain and vicinity had to leave on account of the Indians, supposed to be Captain Joaquin's party, composed of Pi-Utes and Owen's River Indians, and they are determined (so say peaceable Indians) to drive the whites out of the valley. From conversation with Indians left in the valley we were informed that all the Indians capable of doing duty as warriors left for the mountains, leaving those that could not fight to take care of themselves. These Indians say they will go to Tule River Reservation if war commences. I believe the Indians have not been properly treated by the whites in Owen's River Valley, and I think, by all the information I could gather, that unless troops are sent there an outbreak by the Indians is inevitable.\n*  Major McDermit, commanding Fort Churchill, was ordered by General McDowell to send a company of Nevada Territory infantry to reoccupy Camp Independence to protect the settlers in the vicinity of the Owens River Valley, and restrain the white settlers from attacking innocent Indians. - December 7,1864. Company C, 1st Battalion Nevada Volunteer Infantry was dispatched to the area.\nHaiwai Meadows Outbreak\n* Haiwai Meadows Murders at McGuire's - January 1, 1865\n* Settlers under W. L. Moore and W. A. Greenly tracked the killers of the McGuire family to an Owens Valley Indian village east of the Owens River mouth on Owens Lake.  They tracked Newman and Flanigan to Little Lake, where they told the story of the attack at Haiwai to the posse.  For their desertion of Mrs. McGuire and her son, they were told to leave the country at once and not to return, under penalty of death. - January 2–3, 1865\n* Settlers meeting at Lone Pine decide to attack the village at Owens Lake. Four Paiute captured at Lone Pine after news of the Haiwai killings were killed. - January 3, 1865\n* Skirmish at Division Creek, north of Independence. Two prisoners at Camp Independence were shot. - January 2–3, 1865\n* Settler force of seventeen men from Putnams went to the Black Rocks and found that the Paiutes had burned their camps and fled to the mountains, killing cattle as they went. - January 3, 1865\n* A settler posse was organized under Moore and Greenly at Lone Pine and marched on the village on Owens Lake at night of the 5th. - January 4–5, 1865\n* Owens Lake Massacre - January 6, 1865\n* Company C, Nevada Volunteer Infantry, commanded by Captain John G. Kelley, reached Bishop Creek, and established a camp there, remaining until April. - January, 1865\n* Paiute attacked J. N. Rogers at Hells Gate near Haiwai Meadows. - February 28, 1865\n* Paiute killed miners Stewart and Rabe at Walkers Lake. - February 29, 1865\n* Captain Kelly left camp on Owens River to chastise the Indians at Owen's Lake. - March 13, 1865\n* Captain Wallace returned to Fort Churchill from Walker Lake with the Indians who murdered Stewart and Rabe. March 19, 1865\nEnd of Owens Valley warfare\n* Captain Kelley of the Nevada Volunteer Infantry was ordered to occupy Camp Independence. - April, 1865\n** Fort Independence was from this time continuously garrisoned until abandoned in 1877.\n* The company of Nevada Infantry at Fort Independence were relieved by Company E, 2nd Cavalry California Volunteers, from Camp Babbitt under Captain Herman Noble. - December 1865\n* Company E, 2nd California Cavalry, was relieved by two companies of the 9th Infantry Regiment arrived at Camp Independence in mid May 1866.  The Volunteers that were stationed there  mustered out of the service, many remained in the Valley.  Soon afterward United States Cavalry took the place of the 9th Infantry companies. - May 1866\n* U. S. Cavalry engages a party of Paiute east of Owens Lake, killing several warriors and capturing others. - August 1866.\n* Raid on the \"Spanish mines\" by the Panamint Shoshone - March 4, 1867.\n* U. S. Cavalry pursuit of the \"Spanish mines\" raiders to Coso Hot Springs and then  to Rainy Springs Canyon where they defeated them in the Skirmish at Rainy Springs Canyon. - March 12, 1867\nSee also\nReferences\n* [http://www.militarymuseum.org/OwensRiver.html  California and the Indian Wars, Indian Troubles in the Owens River District; Extracted from the History of Tulare and Kings Counties, California - History by Eugene L. Menefee and Fred A. Dodge - Historic Record Company - Los Angeles, California, 1913; Transcribed by Sally Kaleta.]\n* [https://books.google.com/books?id=afPkCbU7QsQC&q=No+Goodee+Cow+Man  Roger D. McGrath, Gunfighters, Highwaymen, and Vigilantes: Violence on the Frontier, University of California Press, 1987 pp.17-56]\n*[https://books.google.com/books?id=ch4VAAAAYAAJ&pg=PR7 The War of the Rebellion: a compilation of the official records of the Union and Confederate armies, Volume 27, Part 1, CHAPTER LXII. Operations on the Pacific Coast, January 1,1861 — June 30, 1862, United States. War Dept.]\n* [https://books.google.com/books?id=dQEVAAAAYAAJ The War of the Rebellion: Volume 35, Part 1, CORRESPONDENCE, ORDERS, AND RETURNS RELATING TO OPERATIONS ON THE PACIFIC COAST FROM JULY 1, 1862, TO JUNE 30, 1865. By United States. War Dept, Robert Nicholson Scott, Henry Martyn WASHINGTON: GOVERNMENT PRINTING OFFICE. 1897]\n* [https://books.google.com/books?id=RTEOAAAAIAAJ Records of California men in the war of the rebellion 1861 to 1867, by California. Adjutant General's Office, SACRAMENTO: State Office, J. D. Young, Supt. State Printing. 1890.]\n* [https://archive.org/stream/storyofinyo00chal#page/n0/mode/2up  Willie Arthur Chalfant, The story of Inyo, Hammond Press, W. B. Conkey Company, Chicago, 1922]"
    }
  ]
}