{
  "content": [
    {
      "type": "text",
      "text": "# Oxley, Queensland\n\n| local_map           = yes\n| zoom                = 12\n| pop                 = 9100\n| pop_year            =\n| pop_footnotes       =\n| established         = 1851\n| postcode            = 4075\n| area                = 7.2\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 14.8\n| dir1                =SW\n| location1           =Brisbane CBD\n| dist2               =\n| dir2                =\n| location2           =\n| dist3               =\n| dir3                =\n| location3           =\n| dist4               =\n| dir4                =\n| location4           =\n| lga                   = City of Brisbane(Jamboree Ward, Moorooka Ward, Tennyson Ward)\n| stategov              = Mount Ommaney\n| stategov2             = Inala\n| fedgov                = Moreton\n| near-n                = Fig Tree PocketCorinda\n| near-ne               = Rocklea\n| near-e                = Rocklea\n| near-se               = Willawong\n| near-s                = InalaDurack\n| near-sw               = Richlands\n| near-w                = Darra\n| near-nw               = Seventeen Mile Rocks\n}}\nOxley is a south-western suburb in the City of Brisbane, Queensland, Australia.  It is  from the Brisbane GPO by road. The suburb contains a mix of residential and industrial land. In the , Oxley had a population of 9,100 people.\nGeography\nOxley is bounded to the north by the Brisbane River and Oxley Creek flows along the eastern edge. In the east the environment is shaped by flood plains which experience major flooding and flash-flooding. Western parts of the suburb are characterised by rolling hills with clay-laden soils.\nThe suburb is traversed by the Ipswich Motorway connecting Oxley to Rocklea to the east and Darra to the west. Oxley Road connects Oxley to Corinda to the north and continues south across the Ipswich Motorway with the name Blunder Road to Durack, Seventeen Mile Rocks Road connects Oxley to the west to Seventeen Mile Rocks and Darra. Oxley is separated from Fig Tree Pocket by the Brisbane River.\nOxley has two golf courses and a golf driving range—Oxley Golf Course located at 290 Boundary Road (), and Corinda Golf Course located on Cliveden Avenue, the latter of which has now been purchased by Brisbane Boys' College as their playing fields along with the driving range. Oxley also contains the Canossa Private Hospital and.the Queensland Police Service's training academy.\nThe former Austral Bricks quarry site in Douglas Street, as well as two other plots of vacant land in the area have been converted to residential estates. The quarry was originally owned by Brittain Bricks. For many years the site was a brickworks, sourcing clay directly from adjacent pits. After production stopped, the kiln stack remained intact. During the mid-1990s the tall structure was removed as it was attracting lightning strikes.\nHistory\nThe area that is now known as Oxley has been an important place to Aboriginal people for thousands of years. The banks of Benarrawa, the original name for Oxley Creek, were home to clans such as the Yerongpan and Chepora, part of the Yugara and Yugarabul peoples. Surrounded by dense forest and abundant wildlife like kangaroos (murri), koalas (dumbirrbi), turtles (binkin), and black swans (marutchi), This area also served as a transit route (kul'gun) for other clans travelling throughout the region. Many traditional land management and hunting techniques were used around Benarrawa, such as firestick farming and the use of ingenious fishing methods like traps and chemical stunning.\n19th century\nOxley Creek was named in honour of John Oxley who first surveyed it in December 1823. Initially Oxley had called the creek Canoe Creek. This was in recognition of the first Europeans to reach the creek, Thomas Pamphlett, John Finnegan, Richard Parsons who reached the area after being shipwrecked on Stradbroke Island. At Oxley Creek the three found two canoes, one of which was used to cross the river and travel downstream. In 1925, Edmund Lockyer, during his survey of the Brisbane River, named it Oxley Creek in honour of John Oxley. The suburb takes its name from the creek.\nThe first land sale that covered parts of today's Oxley occurred in 1851. Oxley once covered a larger area including the suburbs of Chelmer, Graceville and Corinda to the north. It extended to the south into the current suburbs of Willawong and Durack. The first subdivision of residential lands occurred in 1864 near Douglas Street. Although the railway through the suburb connected Oxley to Brisbane, it was the road to Ipswich that defined the suburb's early development.\nA significant portion of the area now encompassing Oxley was originally leased by Thomas Boyland, in the early 1850s, with the area being known as Boyland's Pocket.  This land was later subdivided for small farms, approximately from the 1860s.\nThe suburb was a stop-over point on the Cobb & Co coach route west to the Darling Downs. The first hotel in Oxley was built in 1860 close to Oxley Creek on a rise near Factory Road. It attracted other businesses to the area and provided refreshments for travellers between Brisbane and Ipswich. The hotel soon gained a reputation as a venue where drinking and dancing occurred well into the morning hours. The hotel was moved several times due to flooding which was not a deterrent to the licensee. By 1892 a brick hotel has been built on the corner of Oxley Road and Ipswich Road, the site of a public bar still open today.\nBy the late 1860s the area had grown sufficiently to support a hotel, racecourse, post office and churches.\nA bark non-denominational church was built on the corner of Oxley Road and Bannerman Street (previously known as William Street and School Street). In 1891, an additional weatherboard building was erected as part of the church. It was used for Anglican and Presbyterian services. Following the closure of the church in the 1920s, the 1891 building was relocated to Sherwood to become part of a blacksmith's shop.\nIn 1869, a floating sugar mill and cane crushing plant, named the Walrus, was operating in Oxley Creek as well as other places.\nOxley East Non-Vested School opened on 31 January 1870. In 1881, it was taken over by the Department of Public Instruction and renamed Oxley State School. A pre-school was opened on 5 September 1977.\nIn the 1870s, small scale farming progressively diversified into dairying and other agricultural pursuits, for instance bacon processing. A small creamery was operating in 1873, most probably located near Factory Road in Oxley's south-east parts.\nBy 1873 there were five churches operating: Anglican, Congregational, Presbyterian, Baptist and Methodist.\nIn 1874, the Oxley railway station was opened on the Main Line railway from Brisbane to Ipswich. This led to the establishment of a second subdivision in 1876, referred to as the Township of Oxley which was centred on the train station. It consisted of 140 allotments with the lower ones experiencing periodic inundation. In the same year the construction of the first police station was completed. Dairying became common in the area during the 1890s. The 1893 Brisbane flood halted housing construction in the lower parts of Oxley for many years. William Brittain moved his brick making operations to a  site on Douglas Street in 1899.\nIn 1879, the local government area of Yeerongpilly Division was created. In 1891, parts of Yeerongpilly Division were excised to create Sherwood Division becoming a Shire in 1903 which contained the suburb of Oxley. In 1925, the Shire of Sherwood was amalgamated into the City of Brisbane.\nMrs Janet O'Connor Girls School opened in 1885 and closed in 1920.\nDuporth Ladies School moved from Brisbane to Oxley in 1888, with the site of this school later becoming the location for an Ursuline Convent (1924–57) and the Canossa Hospital (1965).\nIn June 1889, \"Oxley Station Terraces Estate\" made up of 145 allotments were advertised to be auctioned by T. A. Lawson & Co., auctioneers. A map advertising the auction contains a local sketch of the Estate. Newspaper advertisements for the auction state the Estate has splendid river frontage and is only five minutes' walk from Oxley Station.\n20th century\nA sailing club was established in 1902.\nBy 1904, the \"Bacon Factory\" as it was locally known as, which produced not only bacon but also cheese, ham and other small goods was established.\nIn 1911, due to regular flooding, the Oxley police station was moved to a site where the police academy currently is.\nThe Oxley Progress Association was founded in 1917. It built the small hall in Station Road in 1924. It supported the establishment of the Oxley War Memorial. This community group was still active in the early 1990s. During this time the Darra cement works on the western edge of Oxley had plans for a major expansion. With the help of the Oxley Progress Association residents were successful in stopping this development. In the 1960s the group played a major role in the proclamation of Queensland's Clean Air Act.\nThe Oxley war memorial to the fallen was opened in 1920 and moved in 1980.  The firm of stonemasons which constructed this memorial was F. Williams & Co of Toowoomba, with the original cost being approximately £110.  It is constructed of sandstone and marble and was built in honour of those from the district who died in World War I.  This memorial is listed on the Queensland Heritage Register.The Oxley Golf Club was established in 1928. Its golf course was officially opened for play on Saturday 23 March 1929.\nA Methodist church was built in 1930.\nOn Sunday 9 January 1938 a new Apostolic church was opened and dedicated by the Apostle Emil Zeike, the head of the Apostolic Church of Queensland. The church is in Irwin Street.\nThe Oxley Scout Group was formed in 1951 and in 1955 the Oxley fire station was established.\nAn ambulance station was built in the suburb in 1961 but was moved to Durack in 2002.\nOxley State High School opened on 24 January 1966.  On 1 January 1994, it was renamed Oxley Secondary College. It closed on 31 December 2000, with Centenary State High School in Jindalee replacing it. However, as at 2022, the suburb of Oxley is not within Centenary State High School's catchment area. Oxley Secondary College was off Clivenden Avenue ().\nThe bus/rail interchange at Oxley station was built in 1977.\n21st century\npeak]]The 2010–2011 Queensland floods inundated many properties along the main roads of Oxley Road, Blunder Road and the Ipswich Motorway as well as at least ten minor roads. The Bunnings warehouse on Blunder Road was flooded and was closed for 2 months.\nOn 17 July 2013, a new Woolworths store opened on Oxley Station Road.\nThe 2022 floods in Brisbane affected parts of Oxley. The Bunnings warehouse was flooded again. It was announced in August 2022 that the ground-level building would not re-open but that a new 3-level building would replace it with the ground floor level dedicated to car parking and the two upper levels for retailing which would be above the level of a future flood. Bunnings predicts that this design will enable them to reopen the store within 24 hours after a flood rather than months. The design has been proven at their Bundamba store which recovered from the 2022 floods within 24 hours.\nDemographics\nIn the , the population of Oxley was 7,291, 51.1% female and 48.9% male. The median age of the Oxley population was 34 years of age, 3 years below the Australian median.  64.4% of people living in Oxley were born in Australia, slightly below the national average of 69.8%. The other top responses for country of birth were Vietnam 4.3%, England 3.7%, New Zealand 3.3%, Philippines 1.4%, India 1.2%.  72.1% of people spoke only English at home, the next most popular languages were 6.1% Vietnamese, 1% Hindi, 1% Arabic, 1% Mandarin, 0.8% Cantonese.\nIn the , Oxley had a population of 8,336 people.\nIn the , Oxley had a population of 9,100 people.\nHeritage listings\n, 2014]]\nOxley has a number of heritage-listed sites, including:\n* The Fort, 199 Fort Road ()\n* Oxley War Memorial, 1218 Oxley Road\nEconomy\nWith an easily accessed supply of clay in the area, PGH Bricks & Pavers has one of two Queensland production plants located in Oxley.\nEducation\nOxley State School is a government primary (Prep–6) school for boys and girls at Bannerman Street (). In 2018, the school had an enrolment of 475 students with 36 teachers (29 full-time equivalent) and 22 non-teaching staff (15 full-time equivalent).\nThere is no secondary school in Oxley. The nearest government secondary schools are Corinda State High School in neighbouring Corinda to the north and Glenala State High School in neighbouring Durack to the south.\nQueensland Police Academy has its Brisbane campus at 92 Rudd Street ().\nFacilities\nCanossa Private Hospital is at 169 Seventeen Mile Rocks Road (). It is colocated with aged care services and a retirement village.\nOxley Creek Wastewater Treatment Plant is a sewage treatment plant at the northern end of Donaldson Road (). The treated effluent is released into the Brisbane River.\nAmenities\nThe Oxley branch of the Queensland Country Women's Association meets at the QCWA Oxley Hall at 76 Lincoln Street.\nThere are a number of churches in Oxley, including:\n* Oxley-Darra Uniting Church, 114 Oxley Station Road\n* Oxley Apostolic Church, 24 Irwin Terrace ()\nAlso, Oxley Samoan Church meets at Goodna State School at 1 Albert Street, Goodna. It is part of the Wesleyan Methodist Church of Australia.\nCanossa Retirement Village is at 11 Fort Road (). It is co-located with Canossa Private Hospital.\nDespite its name, the Archerfield Wetlands is a  greenspace precinct within the suburbs of Durack, Willawong, Rocklea, and Oxley in the Oxley Creek corridor. It borders the Archerfield Airport. The main entry point to the wetlands is via the Archerfield Wetlands District Park at 455 Bowhill Road, Durack. The district park replaces the former Inala wastewater treatment plant and has a number of indoor and outdoor community spaces, playgrounds with water features, and picnic and barbeque facilities. It is also the start of a number of walking and cycling trails through the larger wetlands. There is a northern entrance to the trails at  30 Gleneagles Crescent, Oxley ().\nTransport\n, 2009]]\nThe Ipswich Motorway traverses Oxley and the train from Brisbane to Ipswich has a station at Oxley, and is connected to a number of suburbs via bus services. A CityExpress bus stop on Blunder Road links Inala Plaza bus station to the inner city using Ipswich Road. Oxley Road connects the Ipswich Motorway to the suburb of Indooroopilly via the Walter Taylor Bridge.\nSee also\n* List of Brisbane suburbs\n*Suburbs and localities (Australia)\nNotes\nReferences\nSources\n*\nAttribution\nFurther reading\n*\nExternal links\n*"
    }
  ]
}