{
  "content": [
    {
      "type": "text",
      "text": "# Ozharov (Hasidic dynasty)\n\nThe Ozerov Hasidic dynasty is a Hasidic Jewish dynasty founded in 1827 when Yehudah Leib Epstein, rabbi of Ożarów in Poland since 1811, assumed leadership of his Hasidim (\"disciples\").\nEpstein was a disciple of the Seer of Lublin, Yaakov Yitzchak Rabinowicz of Prshiskhe, the Ohev Yisrael of Apt, Poland, and Myer of Apt. When Myer died in 1827, his hasidim (dynastic followers) asked Epstein to be their new rebbe (hereditary dynastic rabbinical leader). He moved to Opole towards the end of his life and died in 1837. He was succeeded by his son, Rabbi Yechiel Chaim Epstein, who was succeeded by his own son, Rabbi Arye Yehuda Leib Epstein, author of the Hasidic work Birkas Tov, in 1887. Two of Arye Yehuda Leib Epstein's six children became  rebbe of the dynasty, Avraham Shlomo Epstein (1864-1917) (who succeeded his father in 1913),\nand Alter Moshe David Epstein, who became rebbe on his brothers death in 1917 and was succeeded by his son, Moshe Yechiel Epstein.\nOzerov rebbes\n*Yehuda Leib Epstein of Ozharov (d. 23 Tevet 1837)\n**Yechiel Chaim Epstein (1820-1888), his son\n***Aryeh Yehuda Leib Epstein of Ozharov (1837-1914), his son\n****Avrohom Shlomo Epstein of Ozharov (1864-1917), his son\n*****Moshe Yechiel HaLevi Epstein of Ozerov-Chentchin (1889-1971),  his son\n******Tanchum Becker of Ozerov-Chentchin (b. 1949), son of Moshe Yechiel HaLevi Epstein's son in-law\nSee also\n* History of the Jews in Poland\n* Sarah Horowitz-Sternfeld\nReferences\n* בלבת אש Belabas Eish - history of the Ozharov dynasty.\n* Y. Alfasi החסידות מדור לדור Hachasidut midor ledor, Jerusalem.\n* Ha-Eish-Dos - history of the Eish Dos\n* Intro. to Birkas Tov, Y. Becker.\n* Oral history of the family, D. Zarmi.\nExternal links\n* [https://www.hebrewbooks.org/pdf/eshdat1.pdf Text of Sefer Eish Dos Volume 1 in Hebrew, PDF file]\n* [https://www.hebrewbooks.org/pdf/esdat2.pdf Text of Sefer Eish Dos Volume 2 in Hebrew, PDF file]\n* [http://www.ozarow.org/Letter_from_Rebbe.shtml A Letter from Grand Rabbi Tanchum Becker of Ozharov-Khentshin concerning the Jewish Cemetery in Ożarów, Poland, and a history of the Ozharover Dynasty]"
    }
  ]
}