{
  "content": [
    {
      "type": "text",
      "text": "# Pablo Neruda Ibero-American Poetry Award\n\n}}\n| location         = Santiago\n| country          = Chile\n| presenter        =\n| year             = 2004\n| year2            =\n| website          =\n| holder           = Elvira Hernández\n}}\nThe Pablo Neruda Ibero-American Poetry Award () is an annual award granted by the National Council of Culture and the Arts (CNCA) of Chile, through the .\nIt was created in 2004 by agreement between the CNCA, BancoEstado (sponsor), and the  (sponsor) as a tribute to the centenary of the birth of poet Pablo Neruda. It is granted annually \"to an author who has a distinguished career and whose work is a notable addition to the cultural and artistic dialogue of Ibero-America.\"\nThe prize consists of , a medal, and a diploma.\nIn 2012, for the first time, its prose counterpart was presented: the Manuel Rojas Ibero-American Narrative Award, in honor of the author of Hijo de ladrón, which on that occasion was won by the Brazilian Rubem Fonseca.\nWinners\n(right) receiving the award in 2015, together with President Michelle Bachelet and minister Ernesto Ottone]]\n(left) and minister Roberto Ampuero (right)]]\nreceiving the award in 2011, together with Sebastián Piñera]]\n{| class=\"wikitable\"\n! Year || Winner || Photo\n|-\n| 2004 ||  José Emilio Pacheco ||\n|-\n| 2005 ||  Juan Gelman ||\n|-\n| 2006 ||  Carlos Germán Belli\n|-\n| 2007 ||  Fina García Marruz ||\n|-\n| 2008 ||  Carmen Berenguer ||\n|-\n| 2009 ||  Ernesto Cardenal ||\n|-\n| 2010 ||  Antonio Cisneros||\n|-\n| 2011 ||  Óscar Hahn||\n|-\n| 2012 ||  Nicanor Parra ||\n|-\n| 2013 ||   ||\n|-\n| 2014 ||  Reina María Rodríguez ||\n|-\n| 2015 ||  Augusto de Campos ||\n|-\n| 2016 ||  Raúl Zurita ||\n|-\n| 2017 ||  Joan Margarit ||\n|-\n| 2018 ||  Elvira Hernández ||\n|}\nBooks presented\nwas compiled and published especially for the occasion of Parra receiving the award in 2012.\nSee also\n* Pablo Neruda Award, granted by the Neruda Foundation to poets under 40\n* Pablo Neruda Order of Artistic and Cultural Merit, also granted by the CNCA\nReferences"
    }
  ]
}