{
  "content": [
    {
      "type": "text",
      "text": "# Pacific Theater aircraft carrier operations during World War II\n\nNaval historians such as Evan Mawdsley, Richard Overy, and Craig Symonds concluded that World War II's decisive victories on land could not have been won without decisive victories at sea. Naval battles to keep shipping lanes open for combatant's movement of troops, guns, ammunition, tanks, warships, aircraft, raw materials, and food largely determined the outcome of land battles. Without the Allied victory in keeping shipping lanes open during the Battle of the Atlantic, Britain could not have fed her people or withstood Axis offensives in Europe and North Africa. Without Britain's survival and without Allied shipments of food and industrial equipment to the Soviet Union, her military and economic power would likely not have rebounded in time for Russian soldiers to prevail at Stalingrad and Kursk.\nWithout victories at sea in the Pacific Theater, the Allies could not have mounted amphibious assaults on or maintained land forces on Guadalcanal, New Guinea, Saipan, The Philippines, Iwo Jima, or Okinawa. Allied operations in the Atlantic and Pacific war theaters were interconnected because they frequently competed for scarce naval resources for everything from aircraft carriers to transports and landing craft.\nEffective transport of troops and military supplies between the two war theaters required naval protection for shipping routes around the Cape of Good Hope, through the Suez canal, and through the Panama Canal. In both theaters, maritime dominance enabled combatants to use the sea for their own purposes and deprive its use by adversaries. As naval historian Admiral Herbert Richmond stated, \"Sea power did not win the war itself: it enabled the war to be won\".\nAircraft carriers played a major role in winning decisive naval battles, supporting key amphibious landings, and keeping critical merchant shipping lanes open for transporting military personnel and their equipment to land battle zones. This article is part of a series that covers World War II from the vantage point of aircraft carrier operations and is focused upon operations in the Pacific Theater.\nPacific war overview (1930–1945)\nJapan embarked on imperialistic initiatives in the 1930s which started with the Japanese invasion of Manchuria in 1931 leading to the Second Sino-Japanese War in 1937 and invading French Indochina in 1940. From 1938, the US imposed increasingly restrictive trade restrictions on Japan of oil and other critical materials. The Japanese harbored grievances over perceived humiliations by the West in the past. Rather than withdraw from her conquests as demanded, she chose to acquire access to oil by further conquest, knowing that this would involve war with America, British Empire and others. Japan's view was that, if Germany prevailed in Europe, Japan's only serious enemy would be America, where public opinion was decidedly against war. Japan's confidence was buoyed by her perception that she had never lost a war.\nJapanese strategy\nMindful of the huge wartime industrial potential of America, yet hopeful that Axis successes in Europe would limit what the Allies could undertake in the Pacific, the Imperial Japanese Navy (IJN) pursued a strate strategy of Kantai Kessen - winning a decisive battle at the beginning of a short war, after which she could dictate peace terms.\nPearl Harbor\nOn December 7, 1941, Japan boldly launched a series of nearly simultaneous land and sea assaults. One of these temporarily crippled the American navy by destroying its battleship fleet at Pearl Harbor.  Over the next four months, Japan's army and navy drove the Americans out of the Philippines and neutralized potential American stepping stones back to the Philippines by overrunning Wake Island and Guam.\nJapan invaded Malaya (sinking two British Royal Navy capital ships in the process) and Borneo,  Singapore, and neutralized the British position in Easter Sunday Raid on Ceylon.  Dutch possessions in the East Indies were also overrun, giving Japan access to vast quantities of oil. Australia was driven out of New Britain and parts of New Guinea. Japan then established a defensive perimeter around her expanded empire by fortifying bases at many of the newly conquered possessions.\nIndian Ocean\nEmboldened by her relatively easy victories, Japan then sought to move her defensive perimeter even further outward. She raided the Indian Ocean. The British withdrew part of the Eastern Fleet to Africa's east coast. She attempted to isolate Australia and New Zealand from America by conquering the rest of New Guinea with an eye then to occupying New Caledonia, Fiji, and Samoa. This initiative was rebuffed at the Battle of the Coral Sea. The following month, at the Battle of Midway Japan lost four of the six fleet carriers that had been instrumental in her earlier successes. It was a decisive battle from which Japan would not recover.\nAllied strategy\nWith Japan's offensive capabilities blunted, the Allies took the strategic initiative. After six months of bitter fighting on land, sea, and in the air, the Allies established and held a position on Guadalcanal. The Allies then pursued a three pronged drive toward Japan.\nPhilippines\nThe first, under General Douglas MacArthur, attacked up the northern coast of New Guinea. Simultaneously, Admiral William Halsey Jr., island hopped up the Solomon Islands and Admiralty Islands and merged with Gen. MacArthur's campaign for the assault on the Philippines.\nCentral Pacific\nThe second prong, under Admiral Chester Nimitz, island-hopped across the Central Pacific taking the Gilbert and Marshall Islands to the Marianas. Nimitz then supported MacArthur's  invasion of the Philippines. The Allies successfully employed a strategy of by-passing Japanese strongpoints, isolating them by establishing air superiority, and then letting them wither on the vine. Japanese bases, instead of being valuable defensive positions, became liabilities that had to be supplied using scarce IJN resources. At the same time the American submarine force was destroying the majority of the Japanese merchant fleet.\nChina\nThe third prong was an anticipated thrust from India and Burma through China. Japanese conquests during the 1930s had left China's army exhausted, and logistical support for her from India and Burma was limited. Chinese military activity kept some 600,000 Japanese troops tied down (15% of IJA's troops in 1943–44) that might otherwise have resisted the other Allied thrusts. Nonetheless, the assault on Japan through the China route never became viable.\nJapanese home islands\nAfter the other two thrusts met up in the Philippines, the Allies invaded Iwo Jima and Okinawa and prepared for a final and costly assault on the Japanese home islands. This became unnecessary when the destruction resulting from the atomic bombings of Hiroshima and Nagasaki followed by Soviet entry into the war against Japan brought about Japan's surrender.\nCarriers in the Pacific theater (1939–1945)\nWartime carrier operations in the Pacific began with Japan using carriers to provide combat support for her invasions of China. Japan innovated the coordinated, massed use of aircraft from multiple carriers to establish air superiority wherever they struck. She launched her war with America by a raid on Pearl Harbor with 412 aircraft from six fleet carriers. It was entirely a carrier-launched aircraft operation. Opposing surface warships did not see or fire upon one another.\nDeployment of carriers in 1942\nFor five months, Japan's powerful carrier fleet, the Kidō Butai, dominated the Western Pacific and Eastern Indian Oceans. Japan attacked with near impunity wherever she chose. This dominance ended abruptly in May 1942 when Allied naval forces, centered around aircraft carriers, frustrated Japanese amphibious invasion plans for Port Moresby, New Guinea during the Battle of the Coral Sea. The Allies sank a light carrier but lost a fleet carrier in return. Each side also sustained heavy damage to another fleet carrier. The following month, the Allies sank four of Japan's six fleet carriers during the Battle of Midway at the cost of one American carrier. Two months after that, with air cover from American carriers, the Allies established a tenuous toehold on Guadalcanal at the southern end of the Solomon Islands. Both sides committed major troops and naval resources in their efforts to gain control of the island that neither side really wanted but could not afford to leave to the enemy. Opposing carriers fought major naval engagements over Guadalcanal, including carrier battles in the Eastern Solomon Islands and the Santa Cruz Islands. Overall combined losses for both sides during the Guadalcanal Campaign were 26,000 dead, three aircraft carriers sunk, four carriers heavily damaged, 67 other warships sunk, and 1,300 aircraft lost. As a result of these engagements, there were no operational Allied fleet or light carriers in the Pacific for a two-week period at the end of October 1942. Two such Japanese carriers were then operational but not engaged, in part because of the excessive loss of experienced pilots and supporting aircrews. Nonetheless, the Allies held Guadalcanal and the tide in the Pacific had decisively turned. For the rest of the war in the Pacific, the Allies maintained the strategic initiative.\nThe table below shows the raids and battles at which Japan's carriers were engaged during the year following the attack on Pearl Harbor. Some carriers were out of action during this period due to damage or to lacking sufficient aircraft and/or pilots to sortie with the fleet.\n;Legend:\n: indicates sunk during or shortly after battle\n: indicates month the carrier was newly commissioned\n{| class=\"wikitable\"\n|+ Imperical Japanese Navy Carriers, Pacific Theater (Dec 1941 – Dec 1942)\n! scope=\"col\" style=\"width: 10px;\" |\n! scope=\"col\" style=\"width: 100px;\" | Name\n! scope=\"col\" width=\"5\"  | Dec 41\n! scope=\"col\" width=\"5\"  | Jan 42\n! scope=\"col\" width=\"5\"  | Feb 42\n! scope=\"col\" width=\"5\"  | Mar 42\n! scope=\"col\" width=\"5\"  | Apr 42\n! scope=\"col\" width=\"5\"  | May 42\n! scope=\"col\" width=\"5\"  | Jun 42\n! scope=\"col\" width=\"5\"  | Jul 42\n! scope=\"col\" width=\"5\"  | Aug 42\n! scope=\"col\" width=\"5\"  | Sep 42\n! scope=\"col\" width=\"5\"  | Oct 42\n! scope=\"col\" width=\"5\"  | Nov 42\n! scope=\"col\" width=\"5\"  | Dec 42\n|-\n|colspan=15|Fleet:\n|-\n|1||Akagi CV ||Pearl Harbor||Rabaul||Darwin||Java||Ceylon|| ||style=\"background:#FFC7C7\"|Midway⇘\n|-\n|2||Kaga CV ||Pearl Harbor||Rabaul||Darwin||Java||repairs|| ||style=\"background:#FFC7C7\"|Midway⇘\n|-\n|3||Sōryū CV ||Pearl, Wake||Ambon||Darwin||Java||Ceylon|| ||style=\"background:#FFC7C7\"|Midway⇘\n|-\n|4||Hiryū CV ||Pearl, Wake|| Ambon||Darwin||Java||Ceylon|| ||style=\"background:#FFC7C7\"|Midway⇘\n|-\n|5||Shōkaku CV ||Pearl Harbor||Rabaul|| || ||Ceylon||Coral Sea||repairs|| ||Eastern Solomons || ||Santa Cruz||repairs||repairs\n|-\n|6||Zuikaku CV ||Pearl Harbor||Rabaul|| || ||Ceylon||Coral Sea||low on aircrews ||Kiska||Eastern Solomons || ||Santa Cruz||low on aircrews ||low on aircrews\n|-\n|7||''Jun'yō CV ||colspan=5| ||style=\"background:#9EFF9E;text-align:center\"|C||Dutch Harbor||Kiska|| || ||Santa Cruz|| ||\n|-\n|8||Hiyō CV ||colspan=7| ||style=\"background:#9EFF9E;text-align:center\"|C|| || ||Guadalcanal|| ||\n|-\n|colspan=15|Light:\n|-\n|1||Hōshō CVL ||Pearl Harbor (distant cover)|| || || || || ||Midway (distant)|| || || || || ||\n|-\n|2||Ryūjō CVL ||Philippines||Malay||Java||Java||Bengal|| ||Dutch Harbor||Kiska||style=\"background:#FFC7C7\"|Eastern Solomons⇘\n|-\n|3||Zuihō CVL || || ||Philippines || || || ||Midway (distant)||Kiska|| || ||Santa Cruz|| ||\n|-\n|4||Shōhō CVL ||||style=\"background:#9EFF9E;text-align:center\"|C|| || || ||style=\"background:#FFC7C7\"|Coral Sea⇘\n|-\n|5||Ryūhō CVL ||colspan=11| ||style=\"background:#9EFF9E;text-align:center\"|C||\n|-\n|colspan=15|Escort:\n|-\n|1||Taiyō CVE ||Philippines|| || || || || || || ||Truk||Truk|| || ||\n|-\n|2||Un'yō CVE ||colspan=5| ||style=\"background:#9EFF9E;text-align:center\"|C|| || || || || || ||\n|-\n|3||Chūyō'' CVE ||colspan=11| ||style=\"background:#9EFF9E;text-align:center\"|C||\n|}\nPrincipal Sources: Pike, Y'Blood.\nThe table below shows the location of American carriers at the time of the Japanese raid on Pearl Harbor. Also shown are raids and battles in which American carriers were engaged during the first year of the war.\n;Legend:\n: indicates sunk during or shortly after battle\n: indicates month the carrier was newly commissioned\n{| class=\"wikitable\"\n|+ United States Navy Carriers, Pacific Theater (Dec 1941 – Dec 1942)\n! scope=\"col\" style=\"width: 10px;\" |\n! scope=\"col\" style=\"width: 100px;\" | Name\n! scope=\"col\" width=\"5\"  | Dec 41\n! scope=\"col\" width=\"5\"  | Jan 42\n! scope=\"col\" width=\"5\"  | Feb 42\n! scope=\"col\" width=\"5\"  | Mar 42\n! scope=\"col\" width=\"5\"  | Apr 42\n! scope=\"col\" width=\"5\"  | May 42\n! scope=\"col\" width=\"5\"  | Jun 42\n! scope=\"col\" width=\"5\"  | Jul 42\n! scope=\"col\" width=\"5\"  | Aug 42\n! scope=\"col\" width=\"5\"  | Sep 42\n! scope=\"col\" width=\"5\"  | Oct 42\n! scope=\"col\" width=\"5\"  | Nov 42\n! scope=\"col\" width=\"5\"  | Dec 42\n|-\n|colspan=15|Fleet:\n|-\n|1||Saratoga CV ||Enroute San Diego|| || || || || || || ||Guadalcanal, Eastern Solomons || || ||Kolombangara ||\n|-\n|2||Lexington CV||Enroute Midway|| || ||Lae-Salamaua|| ||style=\"background:#FFC7C7\"|Coral Sea⇘\n|-\n|3||Ranger CV  ||colspan=13; style=\"text-align:center\"|operated exclusively in the Atlantic theater until mid-1944\n|-\n|4||Yorktown CV  ||Atlantic|| || ||Lae-Salamaua|| ||Coral Sea ||style=\"background:#FFC7C7\"|Midway⇘\n|-\n|5||Enterprise CV  ||Near Pearl Harbor||  || Kwajalein, Wotje, Maloelap||Wake, Marcus||Tokyo|| ||Midway|| ||Eastern Solomons || ||Santa Cruz||Naval Battle of Guadalcanal ||\n|-\n|6||Wasp CV  ||colspan=7; style=\"text-align:center\"|Atlantic theater until mid-June|| || ||Guadalcanal ||style=\"background:#FFC7C7\"|Enroute Guadalcanal⇘\n|-\n|7||Hornet CV  ||colspan=4; style=\"text-align:center\"|Atlantic theater until early March||Tokyo || ||Midway || || || ||style=\"background:#FFC7C7\"|Santa Cruz⇘\n|-\n|8||Essex CV  ||colspan=12| ||style=\"background:#9EFF9E;text-align:center\"|C\n|-\n|colspan=15|Light:\n|-\n|||CVLs ||colspan=13; style=\"text-align:center\"| The USN, unlike the IJN, did not have CVLs commissioned until 1943\n|-\n|colspan=15|Escort:\n|-\n|1||Langley AV ||Cavite|| ||style=\"background:#FFC7C7\"|Java⇘\n|-\n|2||Long Island CVE ||Norfolk|| || || || || || || ||Guadalcanal || || || ||\n|-\n|3||Copahee CVE ||colspan=6| ||style=\"background:#9EFF9E;text-align:center\"|C|| || || ||Guadalcanal|| ||\n|-\n|4||Nassau CVE  ||colspan=9| ||style=\"background:#9EFF9E;text-align:center\"|C|| || ||\n|-\n|5||Altamaha CVE  ||colspan=9| ||style=\"background:#9EFF9E;text-align:center\"|C|| || ||\n|-\n|6||Chenango CVE  ||colspan=9| ||style=\"background:#9EFF9E;text-align:center\"|C|| || ||\n|-\n|7||Suwannee CVE  ||colspan=9| ||style=\"background:#9EFF9E;text-align:center\"|C|| || ||\n|}\nPrincipal Sources: Pike, Y'Blood.\nBritain's carriers during 1942 were split between the Atlantic and Pacific theaters. Four of her eight carriers were in the Indian Ocean at the time of Japan's Indian Ocean raid in April. Japan's successful raid resulted in the British withdrawing her naval base from Ceylon to East Africa and in the loss of the light carrier HMS Hermes. Fleet carriers HMS Illustrious, Formidable, and Indomitable provided air cover for the British assault on Vichy French forces at Madagascar. However, all British carriers were moved to the Atlantic Ocean or Mediterranean Sea by January 1943 and did not return to engage against the Japanese in the Pacific until mid-1944.\nDeployment of carriers for 1943 to 1945\nDuring 1943 and 1944, the Allies, now with the strategic initiative, advanced toward the Philippines. For the army commanded by General Douglas MacArthur, which moved doggedly up the northern coast of New Guinea, air cover was typically provided by land-based aircraft from the Army Air Force. For some operations, however, air support was provided by carrier-based aircraft. Halsey's campaign up the Solomon Island chain was also supported by land-based and carrier-based aircraft. Raids and invasions for the USN drive across the Central Pacific under Admiral Nimitz, Spruance, and Halsey were mostly supported by carrier aircraft. With conditions in Atlantic Theater waters becoming more favorable for the Allies, the British brought more of their carriers to the Pacific Theater.  By the end of June 1944, as the separate forces under Gen. MacArthur and Adm. Nimitz assembled for the invasion of the Philippines, the Allies had a total of 21 operational fleet and light carriers in the Pacific and Japan had four.  By the end of the war, the Allies had 32 fleet and light carriers operational in the Pacific. Japan had none.\nEscort carriers were initially envisioned by many primarily for use in the Pacific to provide convoy protection and to transport replacement aircraft and pilots to the front. In practice, however, CVEs provided all the functions that the larger carriers did, including heated involvement in naval battles. By the end of the war, the Allies had a total of 89 CVEs afloat in the Pacific, of which 80 were operational, against none for Japan.\nNumber of carriers present at the six carrier-vs-carrier battles\nThe great majority of naval engagements during the Pacific War were surface ship-to-ship gun and torpedo fights. Submarine operations also played a significant, strategic role, enormously disproportionate to the number of naval personnel involved, for determining the course of the war. Similarly, the half-dozen carrier-versus-carrier battles dramatically altered the strategic balance disproportionate to the number of these engagements. These battles involved air-to-air and air-to-ship combat during which opposing American and Japanese carriers and their supporting warships, with minor exceptions, did not see or fire upon each other. Japan had more carriers present at all four of the carrier battles in 1942 but, due to Japanese losses and new American construction, IJN had significantly fewer present for the two carrier battles in 1944.\n{| class=\"wikitable\" style=\"margin-left: auto; margin-right: auto;\"\n! scope=\"col\" rowspan=\"2\" | Major carrier battle\n! scope=\"col\" rowspan=\"2\"  | Engagementstart date\n! colspan=\"4\" | Japanese carriers\n! colspan=\"4\" | Allied carriers\n|-\n! scope=\"col\" | Fleet\n! scope=\"col\" | Light\n! scope=\"col\" | Escort\n! scope=\"col\" | Total\n! scope=\"col\" | Fleet\n! scope=\"col\" | Light\n! scope=\"col\" | Escort\n! scope=\"col\" | Total\n|-\n||Coral Sea||4 May 1942||align=\"center\"|2||align=\"center\"|1||align=\"center\"|0||align=\"center\"|3||align=\"center\"|2||align=\"center\"|0||align=\"center\"|0||align=\"center\"|2\n|-\n||Midway ||4 June 1942 ||align=\"center\"|4 ||align=\"center\"|2||align=\"center\"|0||align=\"center\"|6||align=\"center\"|3||align=\"center\"|0||align=\"center\"|0||align=\"center\"|3\n|-\n||Eastern Solomons||24 August 1942||align=\"center\"|3||align=\"center\"|1||align=\"center\"|0||align=\"center\"|4||align=\"center\"|2||align=\"center\"|0||align=\"center\"|0||align=\"center\"|2\n|-\n||Santa Cruz||25 October 1942||align=\"center\"|3||align=\"center\"|1||align=\"center\"|0||align=\"center\"|4||align=\"center\"|2||align=\"center\"|0||align=\"center\"|0||align=\"center\"|2\n|-\n||Philippine Sea||19 June 1944||align=\"center\"|5||align=\"center\"|4||align=\"center\"|0||align=\"center\"|9||align=\"center\"|7||align=\"center\"|8||align=\"center\"|0||align=\"center\"|15\n|-\n||Leyte Gulf||23 October 1944||align=\"center\"|1||align=\"center\"|3||align=\"center\"|0||align=\"center\"|4||align=\"center\"|8||align=\"center\"|8||align=\"center\"|18||align=\"center\"|34\n|-\n|}\nPrincipal Sources: Pike, Y'Blood.\nVictors in the six carrier-vs-carrier battles\nTactically, considering the total number of ships and tonnage sunk and aircraft lost, two of these carrier-to-carrier battles could be considered IJN victories. Strategically, taking into account how the battles affected future operations, only one was an IJN victory and it was Pyrrhic due to extensive damage to IJN Shōkaku, which put her out of action for four months, and to the loss of over 100 experienced pilots, which effectively put IJN Zuikaku out of action for two months.\n{| class=\"wikitable\" style=\"margin-left: auto; margin-right: auto;\"\n! scope=\"col\" width=\"120px\"  | Engagement\n! scope=\"col\" width=\"110px\"  | Engagement Start Date\n! scope=\"col\" width=\"80px\"  | IJN Carriers Sunk\n! scope=\"col\" width=\"80px\"  | IJN Carriers Damaged\n! scope=\"col\" width=\"80px\"  | USS Carriers Sunk\n! scope=\"col\" width=\"80px\"  | USS Carriers Damaged\n! scope=\"col\" width=\"80px\"  | Tactical Victory\n! scope=\"col\" width=\"80px\"  | Strategic Victory\n|-\n||Coral Sea||4-May-1942||align=\"center\"|1||align=\"center\"|1||align=\"center\"|1||align=\"center\"|1||Japan||Allies\n|-\n||Midway ||4-Jun-1942 ||align=\"center\"|4||align=\"center\"|1||align=\"center\"|1||align=\"center\"|0||Allies ||Allies\n|-\n||Eastern Solomons||24-Aug-1942||align=\"center\"|1||align=\"center\"|0||align=\"center\"|0||align=\"center\"|2||Allies||Allies\n|-\n||Santa Cruz Islands||25-Oct-1942||align=\"center\"|0||align=\"center\"|2||align=\"center\"|1||align=\"center\"|1||Japan||Japan (Pyrrhic)\n|-\n||Philippine Sea||19-Jun-1944||align=\"center\"|3||align=\"center\"|0||align=\"center\"|0||align=\"center\"|0||Allies||Allies\n|-\n||Leyte Gulf||23-Oct-1944||align=\"center\"|4||align=\"center\"|0||align=\"center\"|3||align=\"center\"|1||Allies||Allies\n|-\n|}\nPrincipal Sources: Frank, Morison, Pike, Toland, Tully, Young.\nCarriers available for amphibious invasions\nAllied carrier striking power for supporting invasions grew dramatically during the war. Only three carriers supported the invasion of Guadalcanal in 1942. Forty-four supported the invasion of Okinawa in 1945. As preparations were being made for the invasion of Japan's home islands in 1945, preliminary planning provided for using a total of 42 carriers, including 18 from the British Pacific Fleet.\n{| class=\"wikitable\" style=\"margin-left: auto; margin-right: auto;\"\n! scope=\"col\" width=\"190px\"  | Allied Invasion\n! scope=\"col\" width=\"110px\"  | Invasion Start Date\n! scope=\"col\" width=\"50px\"  | Fleet Carriers\n! scope=\"col\" width=\"50px\"  | Light Carriers\n! scope=\"col\" width=\"50px\"  | Escort Carriers\n! scope=\"col\" width=\"50px\"  | Total Carriers\n|-\n||Invasion of Guadalcanal||7-Aug-1942||align=\"center\"|3||align=\"center\"|0||align=\"center\"|0||align=\"center\"|3\n|-\n||Invasion of Tarawa||20-Nov-1943||align=\"center\"|6||align=\"center\"|6||align=\"center\"|6||align=\"center\"|18\n|-\n||Invasion of the Philippines||23-Oct-1944||align=\"center\"|8||align=\"center\"|8||align=\"center\"|18||align=\"center\"|34\n|-\n|-\n||Invasion of Okinawa||1-Apr-1945||align=\"center\"|16||align=\"center\"|6||align=\"center\"|22||align=\"center\"|44\n|-\n|}\nPrincipal Sources: Pike, Y'Blood.\nPacific theater engagements in which carriers were lost\nThe following table shows the losses of carriers including escort carriers, total ships, aircraft, and personnel for major naval engagements involving carriers during the Pacific War. Personnel losses include those killed, wounded, missing, and captured.\nBy the end of 1942, Japanese aircraft and carrier personnel losses, including their experienced pilots, were significantly greater than Allied losses. The American capability to more rapidly replace ships, aircraft, and pilots resulted in a shift of strategic initiative from Japan to the US. By the end of 1944, the Japanese carrier capability had been virtually extinguished.\n{| class=\"wikitable\" style=\"margin-left: auto; margin-right: auto;\"\n! scope=\"col\" width=\"120px\"  | Engagement\n! scope=\"col\" width=\"110px\"  | Engagement Start Date\n! scope=\"col\" width=\"80px\"  | IJN Carriers Lost\n! scope=\"col\" width=\"80px\"  | Allied Carriers Lost\n! scope=\"col\" width=\"80px\"  | IJN Ships Lost\n! scope=\"col\" width=\"80px\"  | Allied Ships Lost\n! scope=\"col\" width=\"80px\"  | IJN Aircraft Lost\n! scope=\"col\" width=\"80px\"  | Allied Aircraft Lost\n! scope=\"col\" width=\"80px\"  | IJN People Lost\n! scope=\"col\" width=\"80px\"  | Allied People Lost\n|-\n||Coral Sea||4-May-1942||align=\"center\"|1||align=\"center\"|1||align=\"center\"|5||align=\"center\"|3||align=\"center\"|92||align=\"center\"|69||align=\"center\"|966||align=\"center\"|656\n|-\n||Midway ||4-Jun-1942 ||align=\"center\"|4 ||align=\"center\"|1||align=\"center\"|6||align=\"center\"|2||align=\"center\"|248||align=\"center\"|150||align=\"center\"|3,094||align=\"center\"|307\n|-\n||Eastern Solomons||24-Aug-1942||align=\"center\"|1||align=\"center\"|0||align=\"center\"|4||align=\"center\"|0||align=\"center\"|75||align=\"center\"|20||align=\"center\"|300e||align=\"center\"|90\n|-\n||Sinking Wasp||15-Sep-1942||align=\"center\"|0||align=\"center\"|1||align=\"center\"|0||align=\"center\"|2||align=\"center\"|0||align=\"center\"|46||align=\"center\"|0||align=\"center\"|193\n|-\n||Santa Cruz||25-Oct-1942||align=\"center\"|0||align=\"center\"|1||align=\"center\"|0||align=\"center\"|2||align=\"center\"|99||align=\"center\"|69||align=\"center\"|450e||align=\"center\"|266\n|-\n|\n|-\n||Subtotal||By Dec-1942||align=\"center\"|6||align=\"center\"|4||align=\"center\"|18||align=\"center\"|9||align=\"center\"|514||align=\"center\"|354||align=\"center\"|4,810||align=\"center\"|1,512\n|-\n|\n|-\n||Philippine Sea||19-Jun-1944||align=\"center\"|3||align=\"center\"|0||align=\"center\"|5||align=\"center\"|0||align=\"center\"|600e||align=\"center\"|123||align=\"center\"|2,987e||align=\"center\"|109\n|-\n||Leyte Gulf||23-Oct-1944||align=\"center\"|4||align=\"center\"|3||align=\"center\"|28||align=\"center\"|6||align=\"center\"|300e||align=\"center\"|200e||align=\"center\"|12,500e||align=\"center\"|3,000e\n|-\n|\n|-\n||Total||By Aug-1945||align=\"center\"|13||align=\"center\"|7||align=\"center\"|51||align=\"center\"|15||align=\"center\"|1,414||align=\"center\"|677||align=\"center\"|20,297||align=\"center\"|4,621\n|}\nNotes:\n\"e\" Indicates values are estimated.\nCommanders, organizations, and strategies (1939–1945)\nThe two men who had the greatest impact on Pacific war strategy were Admiral Isoroku Yamamoto and Admiral Ernest King. Both were effectively in charge of their nation's naval operations when the war broke out between them. Both were \"air-minded\" and had commanded iconic aircraft carriers, Yamamoto the IJN Akagi and King the USS Lexington. Both used their considerable influence to significantly change their nation's strategy away from long-held, pre-war positions. Both were regarded as smart, demanding, difficult to work with, and adept at using political maneuvering to get their way.\nAdmiral Isoroku Yamamoto\nAdmiral Yamamoto was Commander in Chief of the Combined Fleet, comprising Japan's five \"mobile fleets\" and three \"area fleets\". The five mobile fleets contained the principal warships. First Fleet (\"Main Body\") and Second Fleet (\"Advanced force\") contained battleships and cruisers respectively. Third Fleet, also referred to as the \"Striking Force,\" held IJN's fleet carriers.\nYamamoto's immediate supervisor on paper was Admiral Osami Nagano, Chief of the Imperial Japanese Navy General Staff (IJN) that, along with the Chief of the Imperial Japanese Army General Staff Office (IJA), reported to Imperial General Headquarters (IGH). In fact, Yamamoto was an extremely popular figure and, by threatening to quit, succeeded in getting his way even over Nagano's objections. He refused to be limited by the master war plan handed to him by IGH that embodied the long-standing IJN strategy of enticing an enemy's naval power to come to her. Instead, he insisted upon taking the war to the enemy with an initial strike on the American Navy at Pearl Harbor. Later, when his plans to invade Midway Island were opposed, he threatened to quit again. And, again, he got his way.\nAlthough the prewar strategy was not implemented, it had determined the design and construction of ships, aircraft, and weapon systems with which Japan entered the war. Limited by treaties to having fewer capital ships than the US and UK, Japan's master plan was to neutralize their enemy's numerical advantage by gradual attrition as an enemy US fleet raced toward Japan upon the outbreak of hostilities. Based upon wide-ranging surveillance, IJN submarines would be sent to sink or cripple ships. Land-based naval aircraft striking from Japan's Pacific Ocean islands would use bombs and torpedoes to sink or cripple more enemy ships. Then cruisers and destroyers using long-range torpedoes and night-fighting tactics would further weaken the approaching fleet. Carrier launched bombers and torpedo planes would continue the attrition. When the weakened enemy fleet finally engaged in the ultimate, decisive battle, the odds would no longer be against Japan. Her battleships, protected by air cover from carrier-launched fighters, would prevail over those of the enemy. This scenario required that Japan be able to take the initiative through use of torpedoes, planes, submarines, and other warships with extended ranges and striking power. Design of ships and planes emphasized the offense at the expense of the defense. For aircraft carriers and carrier-launched aircraft, this translated into lighter, faster, longer range with more punch but with less protection.\nYamamoto's subordinate, the innovative Admiral Shigeyoshi Inoue, commander of the Fourth Fleet (\"South Seas Force\"), also contributed significantly to altering IGH's plan. He insisted that protecting IJN bases would require that fortified airfields be established in several locations. These included Lae, Salamaua and Port Morseby in New Guinea and Tulagi on Florida Island near Guadalcanal in the southern Solomons. This would permit shuttling Japan's limited number of aircraft from base to base to confront Allied moves as they developed.\nAnother Yamamoto subordinate, the cautious Admiral Chūichi Nagumo, became commander of the Third Fleet's 1st Air Fleet, also known as the \"Mobile Force\" or \"Kidō Butai.\" It was the powerful Kidō Butai with its six large fleet carriers and massed airpower of 414 planes that attacked Pearl Harbor.\nYamamoto, although being an early advocate of naval aviation, typically monitored attacks from IJN Yamato the world's largest battleship with unmatched 18\" guns. He strongly believed that winning the war would result from a great \"decisive battle,\" similar to the Battle of Tsushima against the Russian Navy in 1905. Such a battle would probably involve powerful gunships as well as carriers. Yamamoto constantly looked for opportunities to bring this battle about. This doctrine to support the decisive victory was well established in the IJN and guided design of aircraft carriers and aircraft as well as the training of their officers. It also resulted in holding back the total commitment of the massed gunboat fleets, such as the First Fleet, in order for them to be available for that decisive battle. This pursuit of a decisive naval battle persisted after Yamamoto's death in April 1943. As the Allies continued to breach Japanese defensive barriers, pursuit of the decisive battle ran parallel with a strategy for inflicting heavy casualties at every Allied amphibious offensive to convince the Allies to negotiate for peace.\nAdmiral Ernest King\nAdmiral King was Chief of Naval Operations responsible for American operations both in the Atlantic and Pacific. In February 1942, he became one of the original members of the Joint Chiefs of Staff along with Admiral William D. Leahy, Army General George Marshall, and Army Air Force General Henry H. Arnold.\nLike Yamamoto, King was not satisfied with the war plans handed to him. The old \"War Plan Orange\" provided for responding to an assault on the Philippines by immediately sending the Pacific Fleet to the rescue. It assumed troops on Luzon could hold on as USN warships raced across the ocean to engage and soundly defeat the enemy. The scenario was similar to the original Japanese plan except for who would be victorious in that \"decisive battle.\" This strategy was not the plan in effect when the war started, however, and was certainly not feasible after the loss of the Pacific Fleet's battleships to IJN carrier aircraft at Pearl Harbor. The plan to thrust across the central Pacific was revived later, after the number of US aircraft carriers was greater than Japan's. \"War Plan Rainbow 5\" that was in effect when Pearl Harbor was attacked contemplated simultaneous war with Germany and Japan. This plan provided for concentrating on defeating Germany first and maintaining only a defensive posture in the Pacific. It was embraced by the American Joint Chiefs as well as by the British. Operations in the Pacific were to be restricted to protecting areas east of the 180th meridian, approximately the International Date Line, and would consequently concede many South Pacific islands to the Japanese.\nKing almost immediately began a political campaign to enlarge his mandate in the Pacific to include protecting the sea-lanes from America to Australia, \"safeguarding vital interests,\" and seizing \"vantage points\" from which offensive operations could be launched. For this \"passive defense\" he needed ships, aircraft, and troops. His efforts were strenuously opposed by the Army Air Force that expected to achieve victory in Europe through strategic bombing and regarded bombers sent to the Pacific as wasted. The Army also opposed King, given General Eisenhower's priorities for ensuring that Britain and the Soviet Union remained able to fight and given General MacArthur's priorities for winning the Pacific war with himself in charge. The British also opposed him, being more concerned about their nation's immediate survival than about near-term operations in the Pacific.\nNonetheless, to protect shipping lanes and vital interests, King sent to the South Pacific fleet carriers USS Lexington in January 1942 and USS Yorktown the following month. The month after that, in early March, he presented his strategy to President Roosevelt and the Joint Chiefs to hold Hawaii, support Australia, and move northward from the Allied base in New Hebrides against the Japanese. He was limited, however, to the use only of the current manpower commitments to the Pacific, then at 41,000 Army troops and 15,000 Marines. It is a reflection of Admiral King's aggressiveness, persistence, and effectiveness that, despite the \"Europe First\" priorities, almost all of the US troops sent overseas during the first six months of the war went to the Pacific and that the first American offensive of the war was at Guadalcanal rather than in North Africa.\nIn achieving this result, he was helped considerably by the planning of Richmond Kelly Turner, then Chief of War Plans Division and later commander of the amphibious force that invaded Guadalcanal. Reporting to Admiral King were both Admiral Chester Nimitz, Commander of the Pacific Ocean Areas and Admiral Robert Ghormley, Commander of the South Pacific Area. The Joint Chiefs appointed General MacArthur Commander of the South West Pacific Area.\nAdmiral Chester Nimitz\nAdmiral Chester Nimitz assumed command of the Pacific Fleet days after the attack on Pearl Harbor reduced the striking power of the US Pacific fleet by eight battleships. To him fell the task of translating King's aggressive plans for the Pacific into victories against a now superior, more experienced Japanese navy. His quiet dignity and seemingly calm demeanor did not deter him from making bold decisions. Nimitz promptly ordered that the task forces centered on his three operational aircraft carriers begin raiding enemy bases. Throughout the war, Nimitz made wise command changes when needed, sustained worthy subordinates at critical junctures, and provided the principles that governed strategic victories. Historian Toland credited Nimitz with making all the right decisions for the decisive Battle of Midway before a shot was fired.\nAdmirals Raymond Spruance and William Halsey\nUSN Admirals Raymond A. Spruance and William Halsey Jr. distinguished themselves early in the Pacific war, the former at Battle of Midway and the latter during the Guadalcanal campaign. Their many successes reflected strongly contrasting inclinations for aggressiveness, caution, and the balancing of immediate attack opportunities against responsibilities for successes of overall offensive and defensive objectives. Both were subjected to criticism for their command choices during the war, even as they achieved significant successes.\nSpruance began the war subordinate to Halsey as commander of a cruiser division. His cruisers escorted Halsey's carriers during the early raids on Japanese-held islands in the western Pacific and during the Doolittle Raid on Tokyo. When commanding his task force during the USN defense of Midway, Spruance followed Admiral Nimitz's guidance regarding \"calculated risk\" using a calculated mix of aggressive, all-out commitment when launching his first air strike balanced with a cautious retirement behind Midway Island to protect the island and his fleet after sinking four first-line IJN carriers.\nSome believed at the time that Spruance missed a significant opportunity to sink even more ships and should have pursued the \"defeated\" enemy fleet. In fact, Yamamoto was bringing forward his battleships and cruisers in hopes of a decisive night engagement against Spruance's carriers. Two years later during the Battle of the Philippine Sea, when covering USN landings on Saipan in the Mariana Islands, Spruance's carrier aircraft and submarines sank three IJN carriers and virtually wiped out the Japanese naval aircraft capability for the rest of the war. Again some believed Spruance should have followed up immediately by pursuing the defeated and retreating enemy fleet, then comprising 90% of IJN's naval forces. Again, however, Spruance chose to defend the Allied landings at Saipan, which he perceived as his principal assignment from Nimitz, rather than to attempt to sink more ships.\nHalsey was inclined to unrestrained aggressive action, even in the face of significant risks and restrictive operational orders. He is quoted as having said, \"As long as I have one plane and one pilot, I will stay on the offensive.\" This served America well during the Guadalcanal campaign, the most tenuous period of the Pacific war. While earlier commanders of the South Pacific Area were doubtful about the ability to sustain America's position on Guadalcanal, Halsey boldly committed his fleet, including his few carriers, to supporting the Marines there. This cost the USN many men, planes, and ships but, in the end, inflicted greater damage on the enemy and enabled the Americans to hold Guadalcanal. This marked the third major and the decisive turning point in the Pacific war. Together with Marc Mitscher, another admiral heavily inclined to the offensive, they successfully fought their way up the Solomon Island chain.\nUnrestrained offensive action, however, could have negative consequences as well as positive ones. The year after successfully clearing the Solomons, Halsey's aggressiveness was severely criticized after he pursued the then emasculated IJN carrier fleet far away from landings at Leyte Gulf in the Philippines. The IJN fleet, with carriers virtually stripped of aircraft after Spruance's \"Great Marianas Turkey Shoot\" in the Philippine Sea, was sent as a decoy to lure Halsey's powerful fleet away from other IJN forces so that the latter could successfully assault American landings at Leyte Gulf. Halsey took advantage of conflicting orders from Nimitz regarding his assigned priorities and took the bait, preferring to aggressively engage an enemy naval force and sink carriers rather than provide protection for an amphibious landing. He chased after the decoy fleet and succeeded in sinking four IJN carriers. In doing so, however, he left the Leyte landing dangerously exposed to IJN attack. Potential catastrophe for American forces at the Leyte landings was avoided in large part by the courage of a small, very much out-gunned USN fleet of escort carriers, destroyers, and destroyer escorts then under Gen. MacArthur's command off Samar. These CVEs and their escorts fought so aggressively that the Japanese commander thought he was facing Halsey's main fleet and withdrew.  Over 1,500 USN servicemen died and five American ships sank during this battle, including two escort carriers.\nTwo months later, mindful of criticism leveled at him for not properly supporting the landings at Leyte, Halsey kept his fleet aggressively focused on supporting Gen. MacArthur's invasion of Mindoro, as promised, even in the face of his fleet's fighting for survival against a devastating typhoon. Halsey's orders to maintain formation and to attempt refueling during this storm resulted in the loss of more servicemen, ships and about as many aircraft as were lost in combat during the battle of Midway. Again Halsey's judgment was questioned, and a formal inquiry was held. As before, however, senior commanders and naval historians concluded that Halsey's \"inherently bold leadership and strategic and tactical attack instincts\" were, on balance, to his credit and to America's overall benefit. America needed war heroes and Halsey, like Gen. MacArthur, was one to satisfy that need.\nFrom August 1943 to the end of the war, command of the powerful, virtually unstoppable USN \"Big Blue Fleet\", which included America's Fast Carrier Task Force, alternated between Admirals Halsey and Spruance. It was designated as the Third Fleet, including carrier Task Force 38 when Halsey was in command and as the Fifth Fleet, including carrier Task Force 58, when Spruance was in command. While one of these commanders and his staff were attacking the enemy, the other commander and his staff were planning subsequent attacks. The timing of changes in command and some of their operations was:\n* TF-38 (Halsey) From Aug 1943: Invasion of Bougainville\n* TF-58 (Spruance) From 6 Jan 1944: Invasion of Gilbert, Marshall, and Mariana Islands\n* TF-38 (Halsey) From 26 Aug 1944: Invasion of Palau, the Philippines\n* TF-58 (Spruance) From 26 Jan 1945: Invasion of Iwo Jima and Okinawa\n* TF-38 (Halsey) From 28 May 1945: Invasion of Okinawa and raids on Japanese home islands\nAdmiral Chūichi Nagumo, Tamon Yamaguchi, and Jisaburō Ozawa\nAccording to naval historians Jonathan Parshall and Anthony Tully, Admiral Nagumo was past his prime when he assumed command of the awesome Kidō Butai. He did not grasp the complexities of aerial warfare and tended to be passive rather than innovative, the opposite of his commander, Admiral Yamamoto. He relied heavily on his chief of staff, Admiral Ryūnosuke Kusaka, for decisions. At Midway, according to historian John Toland, Yamamoto conceived the operation too recklessly and Nagumo fought it too carefully.\nAdmiral Tamon Yamaguchi, captain of the IJN Hiryu, was unlike and had little respect for, his commander, Nagumo. He was aggressive, hot tempered, and the epitome of the traditional samurai. He went down with his ship at Midway.\nAdmiral Ozawa, Nagumo's replacement after the Battle of the Santa Cruz Islands, was more air-minded but still reticent and deliberate. In 1941, he had been instrumental in the revolutionary development of the Kidō Butai. Unfortunately for him, his overall command encompassed the period of declining naval resources relative to the Allies and the resultant, humiliating IJN defeats.\nJapanese invasions of China (1931–1945)\nJapan's wartime experience with aircraft carriers began shortly after her forces invaded Manchuria in 1931. With this invasion, Japan extended her control over Chinese territory that had begun with the First Sino-Japanese War in 1894. After an \"incident\" near Shanghai in 1932, Japan attacked China. Japan's victory led to the establishment of Manchukuo, which persisted as a puppet state within the Empire of Japan until the end of World War II. In 1937, another \"incident\" at Wanping led to fighting near Beijing that escalated into the Second Sino-Japanese War. This conflict merged with others to comprise World War II.\n1932 \"Incident.\" During the relatively short \"Shanghai Incident\" of 1932, 300 Japanese aircraft were involved, including 67 that were launched from carriers IJN Hōshō and Kaga, two of the 80 warships used to support Japan's troops. Over the course of five weeks, biwinged torpedo planes escorted by biwinged fighters launched from the carriers bombed Shanghai and Hangzhou. It was the first ever bombing of a civilian population. Japanese aircraft were opposed by a hodgepodge of aircraft types controlled by various Chinese warlords, there then being no centralized Chinese air force. In one encounter, an American test pilot, who had come to China to demonstrate Boeing fighter aircraft, engaged the attacking Japanese fighters. He was shot down and killed. The aerial victory was the first for an IJN pilot. The air battles ended with a ceasefire reached about a month after hostilities began.\nIn response to a USN expansion program perceived to be underway, the IJN built up its air capability to include 261 carrier-based aircraft and 701 aircrews. In addition, IJN land-based capability was increased to 419 aircraft and about 900 aircrews. Improved aircraft were also introduced, including the highly maneuverable Mitsubishi A5M fighter, the world's first low-wing monoplane and the immediate predecessor of the famed \"Zero\".\n1937 \"Incident.\" Shortly after the Second Sino-Japanese War broke out in July 1937, an agreement was reached with the Imperial Japanese Army (IJA) that the Imperial Japanese Navy (IJN) would have responsibility for aerial operations over central China. By August, IJN carriers Hōshō, Kaga, and Ryūjō with a total of 136 carrier-launched aircraft were dispatched to the waters off Shanghai to support the Empire's ground troops. At this time, China had a modest air force of 200 aircraft to oppose them. From April to July 1938, a 36 aircraft air group from IJN Sōryū transferred to Nanjing and operated from this land base. Japan's carrier-launched aircraft provided close air support for ground troops, shot down enemy aircraft, bombed airfields, and, after Chinese airfields were taken, operated from those airfields. The carrier doctrine that evolved during this period called for first strikes and massed strength. This approach placed a premium on speed, range, and striking force for both the carrier and its aircraft.\nThe air war pitted Japanese-built fighters and bombers, designed with the help of the British, principally against US and Russian-built aircraft supplied to the Chinese. Britain had been assisting Japan develop her naval aviation capability since 1921. By the time of the Second Sino-Japanese War began, Japan had purchased or manufactured naval aircraft with help from Britain's Sopwith Aviation Company and Gloster Aircraft Company and from Germany's Heinkel. The Americans supplied the Chinese with Curtis III, Curtiss II, and Boeing P-26 fighters. The Russians supplied highly effective Polikarpov I-15 fighters. Some British Gloster Gladiator and Italian Fiat CR.32 fighters were also in service. These fighters engaged Japanese carrier-launched fighters and bombers over central and southern China from 1937 to 1940. Japanese naval aircraft shot down many Chinese aircraft, but IJN also lost a considerable number. From 1937 to 1941, IJN lost 554 aircraft and 680 aircrew members. The unexpected effectiveness of China's fighters against Japanese naval aircraft led to development of the highly maneuverable, long ranging, rapid climbing, tight turning, impressively armed Mitsubishi A6M Zero fighter. This aircraft was so advanced compared to fighters available to the Chinese that, when it made its debut in China in mid-1940, Chinese adopted a policy of avoiding combat with it.\nJapan's invasion of China along with other \"incidents\" resulted in a shift toward an unfavorable view of Japan in the US and UK. In late 1937, Japanese navy aircraft dive-bombed and sank the USS Panay, which Japan maintained was by mistake and for which she apologized and paid reparations. British gunboats were also fired upon, with one ship being damaged. Immediately afterward, the Japanese army conducted a massacre and rape in Nanjing in which tens if not hundreds of thousands of civilians died. In mid-1938, Japanese warplanes shot down a civilian passenger aircraft, the first incident of its kind ever. Ultimately it was the United States demands that Japan leave China, and the associated sanctions imposed on Japan when she refused, that led to Japan's decision to expand her war to include the Western colonial powers. In anticipation of such a move in the Pacific, the IJN turned over responsibility for the air war in China to the IJA. By this time, the \"China Incident\" had become a quagmire for the IJA and tied down a substantial portion of its forces for the rest of World War II. Nonetheless, both the IJA and IJN had gained considerable experience in China, explaining in part their stunning successes during the months immediately following the attack on Pearl Harbor.\nJapanese invasion of French Indochina (1940)\nJapan used carriers during her invasion of French Indochina 22–26 September 1940. Operating from around Hainan Island, Sōryū and Hiryū launched aircraft that supported ground troops. In February 1941, these carriers operated out of Taiwan to support the blockade of Southern China.\nJapanese rapid expansion of empire (1941–1942)\nIn April 1941, Japan assembled its Kidō Butai (\"Mobile Force\"), the most powerful naval unit that had ever existed. It was the culmination of fourteen years of experimentation and refinement, and had become the core of Japan's national defence capability.\nAlso known as the First Air Fleet, it contained all four of Japan's fleet carriers and all three of Japan's light carriers along with 474 aircraft, supporting battleships, cruisers, and destroyers. This innovative concentration of aircraft and ship-borne guns provided Japan with an overwhelming naval unit that could be brought to bear effectively on military objectives throughout the Pacific and Indian Oceans. By early December 1941, Japan had added two more fleet carriers to this armada.\nPearl Harbor (7 Dec 1941)\nWhen it attacked Pearl Harbor on December 7, 1941, Hawaii time, the Japanese Mobile Fleet (Kidō Butai) was composed of Japan's six fleet carriers with 412 aircraft, two battleships, three cruisers, nine destroyers, and three submarines. A \"strike force\" with six more battleships following behind Kido Butai was protected by combat air patrols and anti-submarine patrols of two light carriers. An \"advance force\" of 25 submarines and 5 midget submarines was also deployed around Oahu.\nNinety American ships were in Pearl Harbor. The attack permanently destroyed two and disabled six American battleships. Of the other nine American battleships then active, one was on the West Coast for refitting, one was being used exclusively for training, and the other eight were in the Atlantic Theater, mostly on convoy duty.\nAt the time of the Pearl Harbor attack, the US had a total of seven fleet carriers (CVs) of which three were in the Pacific Theater and four in the Atlantic Theater. Admiral Nagumo, commanding the strike force, had hoped that as many as six American carriers would be at Pearl harbor. There were none. Of those in the Pacific theater, Saratoga was in San Diego following drydock repairs, Lexington was ferrying planes to Midway Island, and Enterprise was on training maneuvers outside Pearl Harbor. Within six months of the Pearl Harbor attack, however, three of the four fleet carriers in the Atlantic had been moved to the Pacific.\nJapanese expansion south and east (1941–1942)\nAs the Kidō Butai was attacking Pearl Harbor, the Japanese were also invading Malaya. Britain's Force Z, comprising a new battleship, an old battlecruiser, and four destroyers, had been sent to deter Japanese aggression there. The fleet carrier HMS Indomitable was intended to accompany this force, but it had run aground off Jamaica. Consequently, when Force Z sought to challenge the Japanese invasion of Malaya, it had no fighter protection. Japanese land-based aircraft from French Indochina quickly sank both British capital warships at a cost of only three Japanese aircraft. Thus, within 48 hours of Japan's initiating war against the Western powers, both America and Britain suffered crippling naval losses in the Pacific. Singapore, Britain's bastion in the Pacific, surrendered to Japan the following February.\nAlso coinciding with the Pearl Harbor attack, Japanese warships including the light carrier IJN Ryūjō moved south to secure the Philippine Islands. This was to prevent the American airbases there from threatening Japanese operations for securing the vital oil fields in the East Indies. Japan's land-based aircraft from Formosa supported northern invasion areas. The Ryujo supported the invasion of Daveo and Jolo on Mindanao in the south, which was at that time far away from existing Japanese land bases. Following this, in January, as the lone carrier of the Malaya Force, Ryujo supported operations there as well. In February she participated in the Battle of the Java Sea, assisting in sinking the American destroyer USS Pope.\nAfter the Attack on Pearl Harbor in December and until the Battle of Midway six months later, Japan's Kidō Butai moved virtually unchallenged as it supported the expansion of Japan's control in the Western Pacific and Eastern Indian Oceans. Supported by the combined air power of such a powerful fleet, the Japanese army and navy could strike virtually anywhere.\nOn the ''Kidō Butai's return journey from Pearl Harbor, IJN carriers Soryu and Hiryu'' and their supporting screen split off from the main group and went to Wake Island to support Japan's invasion there. From there, they went to Ambon Island in the Dutch East Indies and bombed it as part of a Japanese operation to isolate resource-rich Java. The other four fleet carriers returned to Japan's Inland Sea. From there, they sortied south to support the invasion of New Britain, enabling the establishment of a powerful Japanese naval base at Raboul. Soryu and Hiryu, along with light carriers Zuiho and Ryujo, supported the invasion of raw material-rich Java. The USS Langley, America's first aircraft carrier but then serving as a seaplane tender, was delivering planes to Java during this period. In February, it was sunk by Japanese bombers with 32 badly needed Allied planes aboard. Darwin, the only Australian base from which Java could be supported, was bombed to prevent interference with Japan's invasion of Java. A total of 188 carrier-launched planes from Akaga, Kaga, Hiryu, and Soryu, along with 54 land-based aircraft from recently conquered Kendari and Ambon Island, sank eight ships, seriously damaged nine others, and destroyed 18 Allied planes and the airfield at a cost to Japan of only two planes lost. By the end of March with complete control of the air, the Japanese navy defeated Allied naval forces near Java thereby permitting large numbers of Japanese troops to land and ultimately secure oil fields for use by the Empire. The Greater East Asia Co-Prosperity Sphere envisioned by Japanese planners had now been established. The next steps were to establish a strong military perimeter from which to defend these valuable conquests.\nIn April, six Japanese carriers raided the Indian Ocean, attacking Allied naval bases and shipping bases in Ceylon and India. The goal was to destroy the British fleet or to drive it from the Indian Ocean so it could not interfere with IJA's planned invasions of Burma and India. On Easter Sunday, 315 carrier-launched aircraft attacked Colombo destroying ships, port facilities, and aircraft. Britain had two fleet carriers, HMS Indomitable and HMS Illustrious, and the light carrier HMS Hermes in the area with a total of about 100 aircraft against 360 Japanese aircraft, but the opposing forces never located each other for a major battle. In various attacks, Japanese carrier-launched aircraft succeeded in sinking HMS Hermes, two cruisers, two destroyers, and 23 merchant ships at a cost to Japan of about 20 aircraft. At the same time, another Japanese naval force including the light carrier Ryujo patrolled the northern Indian coast, raiding cities and sinking 23 merchant ships. Britain's two fleet carriers escaped, sailing west. In four months, Britain's forward position in the Indian Ocean had been pushed back from Singapore to Ceylon to East Africa. Maintaining its presence there was essential for protecting convoy routes between Britain and Egypt around the Cape of Good Hope and up the African Coast to Suez.\nOther Japanese initiatives resulted in extending their defensive perimeter eastward in the Pacific from the Marshall Islands to the Gilbert Islands. In addition, the Japanese occupied Bougainville and the Shortland Islands in the Solomon chain, Manus in the Admiralties and Halmahera in New Ireland. They moved southward to the northern coast of New Guinea, where advancements were achieved under the cover of Japanese land-based aircraft as new airfields were constructed. A seemingly strong defensive perimeter from the Marshalls to Burma now protected the Empire, putting her vital areas beyond the reach of enemy land-based aircraft.\nIn response, the Allies used their three operational carriers then in the Pacific theater to make raids on Japanese outposts. While these were typically not of strategic importance, they provided experience to the American carrier air groups. An Allied attempted surprise raid on Rabaul in February by USS Lexington aircraft turned back when it was detected too far away to launch. Land-based Japanese \"Betty\" bombers from Rabaul pursued the carrier but 15 were shot down without doing damage to the Allies. In March, Japanese landings at Lae and Salamaua on the northern coast of New Guinea were hit hard by 104 aircraft that launched from USS Lexington and Yorktown from south of Port Moresby and flew over the Owen Stanley mountain range. Two thirds of the Japanese invasion transports were sunk or damaged in this attack.\nPushed back to Australia from the Philippines, the East Indies, and New Britain, the Allies began establishing and strengthening bases along the shipping routes from America to Australia. This included bases in Samoa, New Caledonia, Bora-Bora, Efate, and Fiji. The garrison at Port Moresby was also strengthened.\nAs a token of defiance, Americans launched the \"Doolittle Raid\" in April for which sixteen B-25 bombers from USS Hornet took off for a surprise raid on Tokyo. These medium bombers were not designed for carrier-launching, but they had the range and bomb-load capability needed for such an audacious operation. USS Enterprise accompanied Hornet to provide air cover for the ships involved in the operation. Insignificant damage was done at Tokyo, although conversion of IJN Ryūhō from a submarine tender to a light carrier was prolonged because of bomb hits. The principal benefit for the Allies from the raid was heightened morale for them and consternation for Japan's military leaders who had promised that Japan would suffer no such insults. IJN carriers Akagi, Soryu and Hiryu, just returning from their Indian Ocean Raid, chased after the American carriers but did not find them. The Doolittle Raid prevented Enterprise and Hornet from participating at the Battle of Coral Sea, where their presence could have had a significant impact. On the other hand, the raid shocked Japan and contributed to the IJN decision to expedite extension of their defensive perimeter further eastward in the Central Pacific. As a result, inadequate rest and refitting was provided to Kidō Butai, which had been fighting almost continuously since Pearl Harbor, before it sortied to the anticipated \"decisive battle\" at Midway.\nAllied battle for East Africa and the Indian Ocean (1940–1945)\nThe Allied effort in East Africa and the Indian Ocean was principally a British undertaking. Initially its focus was against Italy in East Africa. It shifted to Japan during the Indian Ocean raid, then to the Vichy French on Madagascar, then to German U-boats in the Indian Ocean, then back to Japan as the British Far Eastern Fleet prepared to return to the Pacific Ocean.\nProtecting The Shipping Lanes Around Africa To The Mediterranean (1940-1941).\nItaly entered the war on 10 June 1940, declaring war on France and Britain. France fell to Germany shortly afterward and Vichy France became a German puppet state allied to Germany and Italy. Essential shipping routes to British forces in Egypt were thereby threatened from two directions. Transport through the Mediterranean would no longer be protected by the French navy, then the world's fourth largest. Now such shipping would be vulnerable to attack by the almost equally strong Italian navy as well as by Italian land-based aircraft. From the other direction, Italian land and naval forces at its colony in East Africa would now threaten British shipping to Egypt around the Cape of Good Hope. At least one supply ship supporting German Raiders also operated out of Italian controlled areas. To protect the sea lanes from Adan to the Suez Canal, Britain fought Italian forces on land, sea, and air around East Africa from June 1940 until November 1941. In February 1941, Fairey Albacore bombers that launched from HMS Formidable bombed Mogadishu and mined its harbor. The following week, her aircraft bombed Massawa Harbor as well, sinking an Italian merchant ship. About the same time, aircraft from HMS Hermes supported British ground troops during the invasion of Italian Somaliland from Kenya. Italian and German merchant ships spotted by Hermes aircraft were sunk by bombs, scuttled, or captured. Carrier-launched air attacks by Hermes were also made on Mogadishu and Kismayu. In April, Fairey Swordfish bomber squadrons from HMS Eagle, temporarily land-based and operating out of Port Sudan, bombed Italian merchant ships and warships. They sank, drove aground, or led to the scuttling of five destroyers from the Italian Red Sea Flotilla based at Massawa in Eritrea. Also in April, British, Indian, and Free French ground forces took Massawa including its harbor and Italian naval base. This resulted in the Red Sea approaches to the Suez Canal being much safer. American President Roosevelt reclassified the area as no longer a \"combat zone\" and permitted American merchant ships, with America not yet at war, to sail to Suez. Following the Battle of Gondar in November 1941, Italian resistance in East Africa virtually ended. Although this Allied success was overshadowed by recent defeats in Greece and Crete, the East African campaign was the first Allied victory of World War II.\nAllied retreat to East Africa (1942)\nAs of the end of March 1942, Britain had a sizable Eastern Fleet, commanded from the Maldive Islands by Admiral James Somerville, to protect Ceylon. The fleet consisted of three aircraft carriers with a total of about 100 aircraft aboard. It also had five mostly old battleships, seven cruisers, sixteen destroyers, and seven submarines. However, this fleet was no match for Japan's five fleet carriers with over 300 planes when Admiral Nagumo's Kidō Butai invaded the Indian Ocean in April 1942. At the same time, Admiral Ozawa's force with a light carrier and six cruisers moved into the Bay of Bengal to attack Allied merchant shipping. In various naval engagements, Britain lost the light carrier, HMS Hermes, about 40 aircraft, eight other warships, and a couple dozen merchant ships at a cost to Japan of only about 20 aircraft. Admiral Somerville retreated to the East African coast and began operating out of Kilindini Harbour, at Mombasa, Kenya. While the Italian threat to the vital Britain-to-Egypt shipping lanes around the Cape of Good Hope had recently ended, now Britain faced the danger of the lanes being closed by Japan. One of the possibilities that Japan was considering at the time was pushing through the Middle East to link up with Germany and Italy in the Mediterranean, thereby creating a belt of Axis powers spanning half the globe.\nSolidifying position (1942)\nGerman U-boats and Japanese submarines continued to strike off the coast of East Africa. These threatened shipping lanes to India and Ceylon as well as the lanes from the Cape of Good Hope to Suez. There was also concern that the Vichy-French government at Madagascar might permit Axis occupation of the island as they had in French Indochina. To strengthen protection for her vulnerable East Africa shipping lanes, Britain seized key points along the coast of Madagascar during May 1942. In an early British employment of carrier-launched aircraft for combined operations, aircraft from HMS Indomitable neutralized airfields and warships enabling Allied troops to get ashore and succeed in taking Diego Suarez. HMS Illustrious provided air cover for the British fleet and attacked Vichy warships and merchant ships. At this time, three of Britain's four fleet carriers were in the Indian Ocean, with HMS Formidable, on station at Kilindini. HMS Victorious (CV), HMS Archer (CVE), USS Wasp, and USS Ranger were the only Allied carriers operational and on convoy defense duty in the Atlantic.\nRemaining on the defensive (1943)\nIn 1943, when planning was underway for invading mainland Italy, no aircraft carriers were left in the Indian Ocean. Even the two modern British battleships then in the Indian Ocean were ordered back to the Mediterranean. All that was possible for protection of shipping in the Indian Ocean were some anti-submarine patrols around Japanese bases in Malaya and the East Indies. Consequently, the U-boats German Admiral Donitz sent to South Africa in May 1943 had considerable success. After the surrender of the Italian fleet in the Mediterranean in September 1943, some Allied warships returned to the Eastern Fleet. The British fleet base was moved forward from Kilindini back to Ceylon, but it was still lacking carrier aircraft and strong amphibious forces needed to mount offensive actions. The Japanese, concerned about American threats in the Central Pacific, did not do more than send a few submarines into the Indian Ocean during the second half of 1943. In March 1944, Japan launched another raid into the Indian Ocean. Unlike the devastating raid of 1942, no aircraft carriers were involved and little was accomplished. It involved only three heavy cruisers with the objective of raiding Allied shipping between Yemen and Australia. Also at that time, Allied amphibious assault vessels that were being accumulated by the Eastern Fleet were recalled to the Mediterranean for use during the landings at Anzio. Consequently, there was no capability or planning for amphibious offensives in the Indian Ocean area.\nAnti-submarine activity (1944)\nA handful of German and Japanese submarines, never more than ten in total, sank 29 Allied merchantmen in the Indian Ocean during early 1944. Some hunter-killer anti-submarine groups were set up to cover the vast area between the Cape of Good Hope and the Malacca Straits. Between January and May three German and two Japanese submarines were sunk by British ships and aircraft. Two German supply ships for U-boats were also sunk, one found by aircraft from HMS Battler using Ultra intelligence.\nSwitch to the Offensive (1944). Although weakened by warship transfers to the Mediterranean in 1943, the British Eastern Fleet initiated some offensive actions in 1944. Three operations in particular were successful in their own right as well as serving as diversions for Allied invasions at Hollandia in New Guinea and Saipan in the Mariana Islands. In April, the USS Saratoga, on loan from the Americans to the British Eastern Fleet, and the HMS Illustrious, supported by three battleships, launched their bombers and fighters to attack Sabang north of Sumatra. Fairey Barracuda torpedo/dive bombers and Vought F4U Corsair fighters from Illustrious attacked the port of Sabang while Douglas SBD Dauntless scout/dive bombers, Grumman TBF Avenger torpedo bombers, and Grumman F6F Hellcat fighters attacked the airfields. This surprise raid damaged shipping, oil tanks and airfields. Units from six navies participated. In May, 85 bombers and fighters took off from the same carriers and damaged the oil refineries and Japanese naval base at Surabaya, in eastern Java. With the HMS Indomitable and HMS Formidable expected to join the Eastern Fleet soon as part of rebuilding to join the Allied Pacific fleet, the USS Saratoga returned to America for a refit. By June 1944, the Eastern Fleet had been sufficiently reinforced by British warships from the Atlantic theater that it could launch a carrier air attack on the Andaman Islands in the Bay of Bangal off Burma. In July, aircraft from carriers HMS Victorious and HMS Illustrious attacked Sabang on the northern end of Sumatra as battleships, cruisers and destroyers bombarded port installations. In August and September the Fleet's carriers attacked northern Sumatra. In October the entire fleet made a raid on the Nicobars islands in the Bay of Bengal. Another carrier-launched attack on the oil refinery at Belawan Deli in Sumatra was made in December and yet another in early January. By the end of 1944 these attacks, coupled with mine-laying by Allied aircraft and submarine patrols, had effectively cut-off Japanese troops in Burma and Siam from their supply lines. In addition, these raids provided combat experience for naval aviators as well as for logistical support and replenishment groups prior to initiating renewed British fleet operations in the Pacific.\nPreparing to Rejoin the Pacific Actions (1944-1945). In late 1944, the 21st Aircraft Carrier Squadron composed of eleven British escort carriers joined the East Indies Fleet. These CVEs were Ameer, Attacker, Emperor, Empress, Hunter, Khedive, Pursuer, Searcher, Shah, Stalker, and Trouncer. Also in November 1944, the British Pacific Fleet was formed from the British Eastern Fleet for upcoming operations in the Pacific. Warships remaining in the Indian Ocean as the British East Indies Fleet were two battleships, nine cruisers, four escort carriers, 25 destroyers, and 70 convoy escort vessels. The rest went to the new base in Australia. On the way to there in January 1945, 130 aircraft from four carriers attacked refineries on Sumatra, significantly reducing the oil available to Japan. Numerous Japanese aircraft were destroyed on the ground. The American Army Air Force had tried unsuccessfully to destroy these facilities in August 1944 using 54 land-based B-29 high-altitude bombers from Ceylon.\nInvasion of Rangoon, Burma (March 1945). In March 1945, the East Indies Fleet supported the invasion of Burma at Rangoon (Operation Dracula) with cover for landings and air strikes on coastal targets. CVEs in the fleet were Stalker, Hunter, Khedive, and Emperor. Diversionary bombing raids were made on the Andaman and Nicobar Islands in April as a naval assault was made on the Burma coast.\nFinal Actions of the East Indies Fleet (1945). In January 1945, Indian forces landed unopposed on Ramree Island off Burma after a naval bombardment using spotters from HMS Ameer.\nIn May, a detachment of escort carriers and destroyers was sent to find the Japanese cruiser IJN Haguro that was attempting to evacuate troops from the Andamans. Destroyer-launched torpedoes sank her. In June 1945, Stalker and Khedive deployed with Force 63 for photo reconnaissance flights over southern Malaya (Operation Balsam) and then attacked air fields. Other carriers provided air cover during mine-sweeping (Operation Collie). In September, Stalker performed photo reconnaissance of Port Swettenham and then air cover for landings during the invasion of Malaysia (Operation Jurist).\nEarly turning points in the Pacific War (1942)\nEarly IJN successes involved relatively little help from the Imperial Japanese Army. The IJA committed only about twenty percent of its forces to the rapid expansion effort following Pearl Harbor. Instead, IJA continued focusing on maintaining its position on the Asian mainland in China and Manchuria, the latter to hedge against a Soviet Union attack of the sort that humiliated Japan in 1939. With further expansion opportunities before them, conflicting IJA/IJN objectives along with inter-service revelries and animosities resulted in Japan's launching out in three directions almost simultaneously without the resources needed to ensure successes. On April 2, Yamamoto reached a compromise with the army that involved providing carrier support for moving in all three of those directions. He divided up the powerful, seemingly irresistible Kidō Butai to support invasions of New Guinea in May and the Aleutian Islands and Midway simultaneously in June. After severe setbacks and carrier losses during these three campaigns, too little offensive punch remained in the Kidō Butai to continue on the offensive or to block Allied initiatives. Naval historian Richard Frank is critical of Yamamoto's failure to keep the carriers of the Kidō Butai together, noting that, after Pearl Harbor, the six carriers never again fought as the formidable combined unit they had once been.\nThe Battle of the Coral Sea off New Guinea in May 1942 was the first naval engagement in which an IJN offensive operation was thwarted. At the Battle of Midway in June, another planned Japanese invasion was blocked. IJN lost four fleet carriers at Midway, resulting in the IJN never again undertaking a successful major initiative. IJN's Aleutian Islands campaign, also in June, was tactically successful but of little consequence. In July, the IJA began its campaign over the Kokoda Trail to take Port Moresby, but in the Japanese Army's first major defeat of the Pacific War, its troops were stopped and turned around in September by Australian troops. The Battle of Milne Bay in August was the first time Allied troops successfully resisted a Japanese amphibious assault, forcing the Japanese troops that had landed to withdraw. The Battle of Guadalcanal lasted from August 1942 to February 1943 and was the first successful Allied offensive of significance in the Pacific. The Allies took Buna and Gona on the northern New Guinea coast between November 1944 and January 1945. Thus, within a year of the Pearl Harbor attack, the strategic initiative had passed from Japan to the Allies. This shift was achieved largely by strategic Allied navy gambles against a superior Japanese navy before America's massive shipbuilding program was brought to bear.\nThe Japanese decision in December 1942 to withdraw from Guadalcanal coincided with turning points in the Atlantic theater. In November, the British won the Battle of El Alamein in Egypt and, along with the Americans, successfully invaded French North Africa. After Russia's determined stand at Stalingrad in December, Germany was unable to sustain an initiative on the Eastern front in Europe.\nCoral Sea (4–6 May 1942)\nFollowing its long string of successes at the outset of the war, Japan was emboldened to risk stretching and thereby weakening its defensive perimeter, extending it considerably further than originally planned. Japan's perceived need for this was reinforced by the shock of April's Doolittle Raid on Tokyo. The attempt to extend their defensive perimeter resulted in Japanese forces being positioned beyond where they could be effectively protected by air cover from land-based aircraft.\nJapanese plans to cut Australia and New Zealand off from America involved occupying the southern Solomon Islands and taking Port Moresby on the southern New Guinea coast. From there, New Caledonia could be taken, providing Japan with a base for operating against Samoa and Fiji. Some planners even began contemplating the occupation of Australia's northern coast. Others began thinking seriously about invading Hawaii.\nThe Japanese invasion of Lae and Salamaua on the northern coast of New Guinea began March 8, 1942. The Allied response was a bombing raid March 10 with 104 carrier aircraft launched south of New Guinea by USN Task Force 17 that included USS Lexington and USS Yorktown. They were joined by land-based B-17 bombers from the field at Townsville, Australia. Thirteen of the 18 Japanese vessels targeted were damaged or sunk, including sinking of a cruiser, two destroyers and three transports. Only one American dive bomber was lost. The Japanese were now on notice that USN carriers were roaming unchallenged and could strike by surprise. It caused a postponement of the move against Port Morseby and spurred consideration of adding IJN fleet carriers to that operation. Other American carriers were then making surprise raids on the Gilbert and Marshall Islands. All these actions fueled Japanese consideration of how to be rid of these annoying enemy carriers.\nWhile many Japanese Generals and Admirals had come to feel invincible, Admiral Yamamoto continued be mindful of America's industrial capability and held that only a short war could be victorious for Japan. On this matter there was rare agreement between the Army and Navy. While Japanese conquests had been impressive, they had not in the least impacted America's war-making potential or determination to fight. Yamamoto was ever watching for the opportunity to orchestrate that \"decisive battle\" that would sink America's aircraft carriers, destroy her will to fight, and lead to the negotiate peace essential for Japan's success. To help bring this about, at the end of April 1942, Yamamoto had available ten fleet and light carriers compared to only five that the Allies then had in the Pacific. Within a year, however, America's shipyards would begin delivering a new fleet or light carrier to the Pacific every month. Under pressure from the IJA to invade the Aleutians and having been urged by Admiral Inoue to provide effective carrier support for invading New Guinea, Yamamoto fatefully divided his carrier forces and split up the powerful Kidō Butai.\nIn May 1942, Japan initiated Operation MO to take Port Moresby. Light carrier IJN Shōhō, was to protect troop transports heading for the amphibious landing areas. Only two fleet carriers, IJN Shōkaku, IJN Zuikaku, rather than the entire six-carrier Kidō Butai, were sent to sink Allied warships expected to respond to the invasion. Faulty Japanese intelligence led Yamamoto to believe no more than one enemy fleet carrier could be in the area. The Allies, however, armed with intelligence about the IJN move and strength from code-breaking, radio traffic analysis, and visual reports from coast watchers, sent Task Force 11 and Task Force 17, centered on fleet carriers USS Lexington and USS Yorktown respectively into the Coral Sea to challenge the operation. Early in the battle, over 160 planes of the combined 250 carrier-launched planes the combatants had available were sent to locate and attack the other. Some Allied land-based B-17 bombers from Port Morseby were also sent out but did no damage. In the resultant Battle of the Coral Sea, the first naval engagement in which opposing surface ships neither saw nor fired upon each other, early Allied success, including the bombing of Japan's newly established seaplane base at Tulagi, caused Admiral Inoue to order the transports to turn back. Japan's invasion plans had been stopped. In the ensuing carrier battle, light carrier IJN Shōhō and fleet carrier USS Lexington were sunk. Together the combatants lost over 160 planes. Combat damage to IJN Shōkaku and large losses of IJN ''Zuikaku's'' aircraft and aircrew forced these carriers to retire to Japan. Naval historians Jonathan Parshall and Anthony Tully are highly critical of Yamamoto's decision to carve up the great power of Kidō Butai by using only two of its fleet carriers for this operation which, if all six carriers of the Kidō Butai had been engaged, could reasonably have been expected to succeed in capturing Port Moresby.\nTactically, the battle appeared to be a victory for Japan because she sank more warship tonnage even though she lost more aircraft. The displacement of USS Lexington was four times that of IJN Shōhō, and she could launch into battle 78 aircraft compared to only 30 for Shōhō. Strategically, however, it was a clear victory for the Allies because Japan's planned invasion of Port Moresby was thwarted. This was the first failure of a Japanese offensive naval operation during the war. Furthermore, Shōkaku was seriously damaged and unable to participate in the following month's decisive, tide-turning Battle of Midway. Finally, so many aircraft and aircrews of Carrier Division 5 were lost that IJN decided not to include Zuikaku in the operation either. Consequently, only aircraft from four of the six Kido Butai carriers were available for the invasion of Midway Island.\nMidway (4–7 June 1942)\nEight of Japan's fleet and light carriers, along with nearly all of Japan's surface fleet, did sortie to participate in the simultaneous operations to occupy Midway Island (Operation MI) and the Aleutian Islands (Operation AL). Both operations were intended to extend Japan's defensive perimeter and thereby prevent embarrassments like the Doolittle Raid on the Japanese mainland of the previous April. For Admiral Yamamoto, the operation was also another bid for the \"decisive battle\" he sought, believing the Americans would have to send their carrier fleet out in response to an assault on Midway. He, like Admiral Nagumo, did not know where the American fleet was but believed it would not be near Midway when the Japanese assault on it began.\nThe Japanese believed the Yorktown had been sunk or at least damaged and not operational as a result of the Coral Sea battle the month before. They did not know where the rest of the American carriers were. A cordon of IJN submarines had been positioned between Midway and Hawaii to report on any Allied ship movements. Another submarine had been operating at French Frigate Shoals to refuel a float plane that also was to scout and report on ship movements around Pearl Harbor. No carrier sightings had been reported to Nagumo from either of these operations. But even if the carriers were at Pearl Harbor, he reasoned, it would take them 48 hours to respond to his attack and reach Midway.\nSplitting forces as the IJN frequently did, the Japanese engaged aircraft from only four fleet carriers, Akagi, Kaga, Soryu and Hiryu, with a total of 248 bomber and fighter aircraft. An additional 95 such aircraft did not participate in the battle because two other carriers (Hosho and Zuiho) were kept too far in the rear to assist and two more (Ryujo and Junyo) were sent north for the simultaneous attack on Dutch Harbor and Kiska in the Aleutian Islands. Furthermore, as many as 56 additional aircraft and crews then back in Japan could have been made available to sortie with Zuikaku for the Midway operation. All together, IJN could have had as many as 399 dive bombers, torpedo bombers, and fighters available to strike Midway. Thus more than a third of the Japanese aircraft that could have been engaged in the combined invasions of Midway and the Aleutions were not. Confident of success and underestimating Allied capabilities, Yamamoto positioned only 248 bombers and fighters near enough to Midway to influence the battle compared to the 412 it used with its six carriers at Pearl Harbor.\nMilitary intelligence played a significant role in the battle for Midway. The Americans had broken Japan's naval code and knew the IJN was coming and what it planned to do. Americans brought all three of their available carriers along with 233 carrier-launched aircraft to the battle. In addition, they had as many as 120 aircraft of various types at Midway's airfield, which was effectively an \"unsinkable carrier.\" Sixty-seven of Midway's aircraft were bombers and fighters that, when added to American carrier-launched aircraft, resulted in a total of 300 such planes being available for the defense of the Midway. This was more than the 248 aircraft that Yamamoto's battle plan would put in effective range of Midway during the attack. ''Kidō Butai's'' aircraft striking Midway were going to be out-numbered.\nYamamoto's dual objectives for the Midway operation also created problems for the IJN carriers. The plan called for the carrier-launched aircraft to eliminate the ability of Midway to resist the landing of occupation forces. This was to be the carriers' first priority unless enemy aircraft carriers were found to be in the vicinity during the landings. In that unlikely event, the first priority would immediately shift to destroying the enemy carriers and only after that back to providing support for the Midway landing forces. Consequently, for the first strike against Midway, Japanese carrier aircraft were armed with high explosive and fragmentation bombs effective for destroying land targets. In accordance with Yamamoto's instructions, about half of the carrier aircraft were armed with torpedoes and armor-piercing bombs effective for sinking ships. These aircraft were kept in reserve as a precaution against the presence of enemy warships. At the same time that bombers were launched for the first-strike on Midway, reconnaissance planes were sent out to search for American carriers.\nThe Japanese first strike against Midway was launched at 0430 and consisted of 108 aircraft (72 bombers and 36 fighters). The attack did considerable damage to buildings, oil tanks, and the seaplane hangar. Twenty-four Midway-based American fighter pilots, outnumbered and with considerably inferior aircraft compared to the Japanese Zero fighters, rose to oppose the incoming bombers. Fifteen of these American planes were shot down. However, their efforts, combined with intense and accurate anti-aircraft fire, shot down 11 attackers and left another 14 inoperable. As a result, Nagumo lost the use of 25 of the 108 planes engaged in this first strike. This left the four carriers of his Kidō Butai with only 223 strike aircraft. This was slightly less than the 233 aboard the American carriers, which had not yet made their presence known. As a Japanese pilot was leaving the area at the end of the first strike on Midway, he caught sight of and reported a plane taking-off from Midway's airfield.\nAt 0710, about the same time the first strike on Midway ended, ten Midway-based pilots began attacking the Japanese carriers. Arriving simultaneously by chance, six Avengers attacked with torpedoes and four B-26s attacked with bombs. Lacking fighter support, most of these planes were shot down by the highly effective Japanese Zero fighters, just as had been the case over Midway during the first strike. The sacrifices of these American pilots had an unintended but highly significant consequence, however. They contributed to Admiral Nagumo's concluding that Midway had not been sufficiently neutralized and that it constituted an immediate threat to his carriers. He ordered that a second strike against Midway be made. Such a strike, against land targets, would require use of bombs different from what the planes then on two of his carriers were armed with. At 0715, believing he was under no immediate threat from enemy carriers, Nagumo ordered aircraft on Akagi and Kaga, which were armed with torpedoes, to be armed instead with high explosive and fragmentation bombs. Unbeknownst to Nagumo, American aircraft from USS Enterprise and USS Hornet had begun launching against him fifteen minutes before he made this fateful decision.\nOn the night of June 3, the three American carriers were about 300 miles east northeast of Midway at location auspiciously designated \"Point Luck.\" The Yorktown had been repaired by a Herculean effort of 1,400 workers at Pearl Harbor in only two days rather than the 90 days originally thought necessary. This added 75 aircraft to the American's striking power.\nAt 0702 Admiral Spruance, commanding TF-16 with Enterprise and Hornet and having learned the location of the Japanese carriers, aggressively ordered an offensive strike force of 116 planes, keeping back only 36 fighters back for defense of his own carriers. These planes were in the air by 0806 and expecting to find the enemy near the extreme end of their 200-mile range. Rather than risk losing the advantage of striking the enemy first, Spruance ordered his dive bombers off without waiting for the planes from Yorktown, which were still out of range to strike. Admiral Fletcher, commanding TF-17 with the Yorktown, ordered 35 planes sent out as soon as he could, keeping back another 35 for defense.\nAt 0728, as Type 97 torpedo planes on Akagi and Kaga were being rearmed with bombs for a strike against land installations, Nagumo received word that a reconnaissance float plane from the cruiser Tone had sighted \"ten ships, apparently enemy\" heading southeast away from Midway at a distance of about 200 miles. No carriers were mentioned in the report. Surface ships without carriers that far away did not pose an immediate threat to Nagumo, and rearming the Type 97 planes with bombs for a second strike at Midway continued. It occurred to someone that enemy ships heading southeast were headed into the wind, suggesting that they might be enemy carriers launching aircraft. In fact, they were. Considering this, Nugamo gave the order to discontinue removing torpedoes from the Type 97 bombers. Another report from the Tone plane was received at 0809 reporting \"5 cruisers and 5 destroyers.\" Not until 0820 was a report received that \"enemy appears to be accompanied by a carrier.\"\nAt 0745, Nagumo shifted the priority again, this time away from a second strike on Midway to launching planes for attacking American carriers. Planes on Hiryu and Soryu, already armed with torpedoes, could be launched relatively quickly. Many planes on Akagi and Kaga could also be launched relatively soon, albeit some still armed with types of bombs for attacking land installations that were less effective against warships. Perhaps 64 attack aircraft could be launched as early as 0830. However, the fighters that would escort those planes against the American carriers were now overhead in the Combat Air Patrol (CAP) and would have to be refueled first. About 0753, as Nagumo was still wrestling with whether to immediately launch a strike against the American carriers or to land his first strike and CAP aircraft and then launch a fully coordinated attack, his focus was diverted by an uncoordinated, nearly continuous series of three more airstrikes over a 40-minute period by Midway-launched aircraft. For the first, Marine Major Lofton Henderson, led 16 Dauntless dive bombers in slow, glide-bomb attacks. Six were shot down with nothing more than near misses on the carriers. Almost simultaneously, 12 B-17s dropped bombs from 20,000 without effect. The third attack was by Vindicator dive bombers. Two were shot down again with only near misses on Nagumo's warships. These attacks kept his ships maneuvering individually at high speed. Adding to the confusion, CAP aircraft were landing and launching.\nNagumo had just witnessed the massacre of American planes that attacked his fleet without fighter protection. Adding to his dilemma, first-strike planes low on fuel were now beginning to return from Midway. If they were not permitted to land, many planes would run out of fuel and be splashed into the ocean with losses of planes and some pilots. On the other hand, not attacking the American carriers immediately was also highly risky. Further increasing the risk would be not having a refueled and rearmed CAP overhead to protect his carriers if, as he now had reason to believe, American carrier-launched planes were headed his way. The decisions Nagumo had made during the last hour left him without good options.\nHe elected to hold off until he could launch a devastating, fully coordinated attack consistent with Japanese naval doctrine. He landed the Akagi and Kaga aircraft returning from the first strike on Midway for refueling and rearming with weapons for attacking warships rather than land installations. This delayed his being able to make an attack on the American carriers. By 0918, the first-strike planes had all landed. Unlike American carrier procedures, which armed and refueled aircraft on the flight deck, arming and fueling Japanese aircraft could only be done on the hangar decks. This involved additional time to lower than raise aircraft on elevators. Refueling and rearming was rushed. Bombs that were removed to make way again for torpedoes were not properly stowed. Fuel lines on the carriers were open. The closed-in hangar decks of Akagi and Kaga were highly vulnerable to disaster. Also at 0918, the first planes from the American carriers began to attack.\nIn a planned coordinated attack, American dive bombers were expected to distract enemy fighters so that the relatively slow, vulnerable torpedo planes could make their approaches in greater safety. American fighters would also be there to protect the attack planes from enemy fighters. For this battle, however, the torpedo planes from the three American carriers became separated from the dive bombers and fighters. By chance, these torpedo planes arrived before the dive bombers and were mostly unescorted by fighters. Squadrons from each American carrier unhesitatingly attacked Japanese carriers successively over the hour beginning just after Nagumo landed all the surviving planes from his first strike on Midway. Japanese Zeros from the airborne CAP descended upon and slaughtered these three American squadrons as they made their lumbering torpedo approaches. Few torpedoes were successfully launched and none struck the carriers. Only six of the 41 attacking torpedo planes survived. However, these torpedo plane attacks caused Nagumo's carriers to continue their high speed maneuvering and thereby prevented him from launching fighters to augment his CAP overhead as well as the aircraft he had just finished arming to attack the American carriers.\nLike those of the Midway-launched planes, the sacrifices of the carrier torpedo squadrons had significant, unexpected consequences. In the reverse of a planned coordinated attack, the threat from the carrier's torpedo planes had brought many of the defending zeros down to sea level and distracted them, along with the fleet's anti-aircraft gunners. The timely, simultaneous, and totally uncoordinated arrival of 54 American dive bombers came as a complete surprise. In the space of only five minutes beginning at about 1025, three 17-plane groups of bombers from Enterprise and Yorktown dived on Soryu, Akagi, and Kaga scoring fatal hits with a total of nine bombs. In the words of historical novelist Herman Wouk, \"It was a perfect, coordinated attack. It was timed almost to the second. It was a freak accident.\"\nOnly the IJN Hiryu, which had become separated from the other carriers during maneuvering resulting from the torpedo bomber attacks, now could launch aircraft with which to counterattack. Her commander, Admiral Tamon Yamaguchi, sent off two waves with a total of 40 aircraft, both of which found the USS Yorktown. Eight attacking planes were shot down by ''Yorktown's anti-aircraft and fighter defenses, but she was hit with three bombs and two torpedoes. Shortly thereafter, 24 American dive bombers from Enterprise and Yorktown hit Hiryu with four bombs, causing her to sink. Yorktown'' remained afloat and salvage appeared possible for three days, but Japanese submarine I-168 got through the warship screen and sank her along with a destroyer.\nFor several hours after his carriers had been struck, Yamamoto sought to engage the American carriers with his powerful fleet of gunboats in a night battle. Spruance avoided the trap by moving the carriers eastward. The following morning, he moved west again to protect Midway. As Yamamoto withdrew his fleet, American carrier aircraft sank one Japanese heavy cruiser and damaged another.\nYamamoto's operating plan was flawed by complexity and division of forces. Poor intelligence and communication failures fatally supported Nagumo's confidence that there was no imminent threat from enemy carriers. The reports from the single young pilot in ''Tone's search plane were not timely, clear or complete. A typographical error initially sent the Japanese submarines to the wrong location to watch for American carriers. Because radio silence was maintained as Nagumo sailed to Midway, he was not informed that the submarine cordon got in place too late to spot carriers that could be moving toward Midway from Pearl Harbor. Nagumo had also not been informed that the seaplane reconnaissance from French Frigate Shoals was not in operation because an American seaplane tender had anchored there and refueling by submarine was not possible. Had he known these things, he may have been less confident that the American carriers were only a distant threat and acted accordingly. However, it was a conscious decision rather than bad luck that Yamamoto and Nagumo did not use the 95 planes from the four carriers kept in the rear and sent to the Aleutians to attack Midway. By the time Yamamoto called back the Aleutian carriers, it was too late for them to influence the outcome of the Midway battle. In a near-run thing as this battle was, giving the enemy an unnecessary edge on planes was a serious miscalculation and could have determined the battle's outcome.\nIn contrast, the Americans had superior intelligence due to code-breaking by Joseph Rochefort's cryptographic team, good strategic guidance from Admiral Nimitz, and sound judgment from Admiral Spruance. A relative abundance of aircraft and brave, determined pilots kept Kidō Butai under attack for 55% of the time between 0710 and 1025, causing carriers to dodge and keeping the combat air patrol occupied. As a result, IJN was unable to launch a strike against the American carriers before three Japanese carriers were mortally wounded.\nExceptionally good luck also contributed. The delay of a Japanese destroyer to attack a submarine allowed dive bombers from Enterprise to follow it to find the Japanese carriers. American carrier-based aircraft found the IJN carriers within minutes of having to turn back for lack of fuel. And it was by chance that the three torpedo squadrons and the two dive bombing squadrons, whose departure was separated by as much as an hour and who flew different routes, arrived as they did.\nAll together, the four IJN carriers were sunk with hits from only a total of 13 bombs and one torpedo. One American carrier, the Yorktown, was sunk. American aircraft losses, including land-based planes from Midway Island, totaled 145 while the Japanese lost 292, twice as many.\nWhat the Japanese lost with its four carriers was the core of a weapons system of men, machines, and flight decks, unique at that point in the war, that enabled them to concentrate mobile forces to strike and dominate any local area. As a result of the catastrophic losses at Midway, the Japanese Navy was never again in a position to make an effective strategic initiative. The American victory is regarded as one of the most decisive in history. From that point on, Japan's ability to strike at will was over. The Allies took the initiative only two months later at Guadalcanal, the third major turning point in the Pacific War.\nAllies take the strategic initiative (1942–1945)\nGuadalcanal (Aug 1942 – Feb 1943)\nEven with the severe losses at Midway, Japan still had six fleet and light carriers  and more under construction. Confidence remained high. Still looking to extend her defensive perimeter to the east, she moved into the southern Solomons with an eye toward ultimately establishing bases in New Hebrides, Fiji, and New Caledonia to cut off Australia and New Zealand from American support. With fewer carriers available after Midway, IJA emphasized construction of new bases for land-based aircraft to support this operation. A 2,600 man Japanese airfield construction crew arrived on Guadalcanal on July 6. Even though the war in Europe had higher priority, America moved hastily to counter this Japanese initiative by landing Marines on Guadalcanal to deny its use by the Japanese. The operation was named \"Operation Watchtower,\" but to the men who fought with such limited advance planning and meager resources, it was dubbed \"Operation Shoestring.\" In the naval battles to establish control over this island, the opposing combatants would lose a combined total of three aircraft carriers, incur heavy damage to five other carriers, and lose a large number of other ships, planes, and experienced aircrews. After the costly naval battles over controlling Guadalcanal, there would be no carrier-to-carrier battles and no additional fleet or light carriers would be lost in any theater until mid-1944.\nOverview of the Guadalcanal Campaign.\nThe Guadalcanal Campaign involved ten major battles, three on land and seven at sea. The naval battles included two carrier battles and five night surface actions. The naval battles might be considered tactical victories for one side or the other when gauged by the relative number of ships sunk, aircraft shot down, and experienced aircrews lost. Whether the battle was a strategic victory must also take into consideration whether troop reinforcements and vital supplies were successfully landed on Guadalcanal, this being a driving objective for the various naval operations there. The ten battles were:\nInitial Allied Landings:\n* 1: August 8–9; Naval Battle of Savo Island (Japanese Victory)\nJapanese Response, Round 1:\n* 2: August 21; Col. Ichiki's Attack on Henderson Field (Allied Victory)\n* 3: August 24–25; Naval Carrier Battle of the Eastern Solomons (Allied Victory)\nJapanese Response, Round 2:\n* 4: September 12–14; Gen. Kawaguchi's Attack on Henderson Field (Allied Victory)\nJapanese Response, Round 3:\n* 5: October 11–12; Naval Battle of Cape Esperance (Allied Victory, Japanese convoy success)\n* 5: October 13–15: Naval Bombardment of Henderson Field, Reinforcement Convoy landings (Japanese victory)\n* 6: October 23–26; Gen. Maruyama's Attack on Henderson Field (Allied Victory)\n* 7: 26 October 26; Naval Carrier Battle of the Santa Cruz Islands (Japanese Pyrrhic Victory)\nJapanese Response, Round 4:\n*8: November 12–15; Naval Battle of Guadalcanal (Allied Victory)\n*9: November 30; Naval Battle of Tassafaronga (Japanese Victory)\nJapanese Withdrawal:\n*10: January 29–30; Naval Battle of Rennell Island (Japanese Victory)\nThese battles were part of three inter-related races to reinforce and resupply ground troops, control the sea, and control the air around Guadalcanal. The Japanese were initially distracted by their ongoing operations in New Guinea. They were also overconfident in their ability to easily dislodge the Allies from Guadalcanal. As a result, Japan committed resources to their Guadalcanal campaign piecemeal, creating lengthy pauses between land attacks that allowed the Allies to reinforce and to become increasingly capable of resisting them. The Allies, in contrast, feeling highly vulnerable and running scared, focused quickly, reinforced effectively, and ultimately won all three races. As early as the end of August, with Henderson Field operating, the Allies had virtually gained daytime control of the air between Guadalcanal and Japanese naval aircraft bases on Bougainville further up the Solomon chain. In addition to the aircraft at Henderson Filed, Allied aircraft carriers kept station relatively near Guadalcanal while the Japanese nearest bases were far away at Truk and Rabaul.  At night, however, Japanese cruisers and destroyers, with sailors skilled at night-fighting and with their highly effective \"Long Lance\" torpedoes, dominated at night.  This advantage was offset over the course of the Guadalcanal campaign by the Allied introduction and effective use of radar. By mid-November, the Allies had gained effective control of both the air and seas around Guadalcanal, day and night, allowing them to outperform the Japanese with reinforcement and resupply. Unable to adequately supply their troops, the Japanese decided to withdraw from Guadalcanal in December 1942 and completed doing so by early February 1943. From that time on, Japan remained on the defensive. Guadalcanal was the final and decisive turning point of the war in the Pacific.\nCommanders and Command Issues.\nThe Allied decision to invade Guadalcanal developed during a period of clashes at the highest level of command. As early as February 1942, US Fleet Commander Admiral Ernest King began promoting a more offensive posture in the Pacific. This was in opposition to both the US Joint Chiefs of Staff, including General George Marshall, and Britain's war leadership, all of whom were more in accord with the \"Germany first\" priorities for war resources. King succeeded in having greater resources committed to the Pacific, even as the American effort in North Africa was flagging. By March, a bitter dispute broke out between Adm. King and General Douglas MacArthur as to how these resources were to be deployed. This was ultimately resolved with a compromise leaving Gen. MacArthur in charge of the Southwest Pacific Area and charged with seizure of the Solomon Islands west of Guadalcanal, the northwest coast of New Guinea, and the Bismarck Archipelago including the Japanese naval fortress at Rabaul. Admiral Chester Nimitz would command the Pacific Ocean Areas and drive across the central Pacific. Admiral Robert Ghormley, under Nimitz, would command the South Pacific Area and seize Tulagi, where the Japanese had established a seaplane base. Ghormley would also, almost as an afterthought, seize Guadalcanal, where a Japanese airstrip was under construction. Under Ghormley, Admiral Frank Fletcher became commander of Allied Task Force 61.\nAdmiral Ghormley, although regarded as highly conscientious and with a long record of achievement, did not inspire the fighting men in the precarious position they came to find themselves on Guadalcanal. Consumed with administrative responsibilities and diplomatic challenges dealing with the French at his base at Nouméa on New Caledonia, he never found time to visit the troops on Guadalcanal. By mid-October Ghormley was replaced by Admiral William \"Bull\" Halsey. Admiral Fletcher had performed well at the battles at Coral Sea and Midway, but had lost a fleet carrier in each engagement. His understandable caution over concern about losing any more at Guadalcanal was not consistent with the more aggressive views of Admirals King and Nimitz. Fletcher was not returned to duty in the South Pacific Area after being wounded in the Battle of the Eastern Solomons in late August.\nResources were indeed limited for taking Tulagi and Guadalcanal. Only one division of marines was available for this amphibious assault. There were not enough transports or aircraft to properly support the invasion. Furthermore, Allied air support for the operation would depend upon carrier-launched aircraft since the area was beyond the effective range of Allied land-based aircraft. Japanese land-based aircraft at Rabaul and Bourgainville, on the other hand, were within effective range of striking Guadalcanal. Despite these problems, preparations were made to hastily seize the initiative following the game-changing Allied victory at Midway.\nInitial Allied landings (7 Aug 1942)\nAssembling Task Force 61 (June 1942 - July 1942). Landing and maintaining a toehold so far away from Allied land-based airfields required aircraft carriers. With only three Allied fleet carriers in the Pacific after the Midway battle, USS Wasp was transferred from the Atlantic. She embarked aircraft in San Diego and, then as part of TF-18, sailed with a convoy transporting the 2nd Marine Regiment (United States) to the Tonga Islands. USS Saratoga spent much of June transporting aircraft to Midway to replenish the base and the fleet carriers that had just fought there. Then she sailed for the Southwest Pacific area with TF-11. USS Enterprise, after a month of rest and overhaul at Pearl Harbor following its fighting at Midway, sailed to the South Pacific and as part of TF-16. Following refitting, USS Hornet was, for the moment, kept near Pearl Harbor.\nBeginning in mid-1942, new US escort carriers were being commissioned almost every month with more than half of them being sent to the Pacific theater. In early June 1942, America's then only operational escort carrier Long Island arrived from the Atlantic and provided air cover for Task Force One (TF-1), an assemblage of old battleships and destroyers that patrolled off the West Coast as a precaution should the Midway battle not go well. After Midway, CVE Long Island sortied west.\nTask Forces 11,16, and 18 were combined as Task Force 61 with three fleet carriers and a total of 82 warships, then under the command of Admiral Frank Fletcher, to support the landings on Guadalcanal.\nGuadalcanal landings (Aug 7–8, 1942). The Japanese were taken by surprise when 16,000 Marines of the 1st Marine Division under General Alexander Vandegrift made the first American amphibious landing since 1898. From a point 100 miles southwest of Guadalcanal, aircraft launched by Saratoga, Enterprise, and Wasp bombed Japanese positions on several islands in the area and provided close combat support, strafing the beaches and protecting transports and other warships with continuous combat air patrols. Aircraft from Wasp, attacked Japanese positions at Tulagi, Gavutu, Tanambogo, Halavo, Port Purvis, Haleta, and Bungana. Twenty-two Japanese floatplanes and floatplane fighters were destroyed with no aircraft losses for Wasp. Dive bombers and fighters from Saratoga and Enterprise attacked Lunga Point on Guadalcanal, driving off Japanese construction workers. Reconnaissance patrols were made over Santa Isabel Island and New Georgia. Both Tugali and Guadalcanal were secured by the end of the second day. It was the first time in the war that territory had been taken back from the Japanese.\nThe initial Japanese reaction in Rabaul, 650 miles away, was to send 27 land-based, high-level \"Betty\" medium bombers accompanied by 12 Zero fighters. The bombers were challenged by US carrier-launched Wildcats fighters from all three American carriers. The Wildcats were in turn attacked by the Zeros. Effective Allied anti-aircraft gunnery took a great toll on Japanese aircraft. Japanese bombs, dropped on the US ships from four miles up, missed their targets and did no damage. A second wave of Japanese bombers did no better. With additional raids over the first two days, total Japanese plane losses were 36 compared to 19 for the Allies, 14 of which were carrier-launched. But the IJA was not overly concerned. The 17th Army under General Harukichi Hyakutake was focused on operations in New Guinea and did not yet recognize the importance of the Guadalcanal landings.\nThe Battle of Savo Island (Aug 8–9, 1942) Unlike the IJA, IJN Eight Fleet Commander Admiral Gunichi Mikawa grasped the seriousness of the enemy landings. Disregarding the risks posed by US carrier aircraft, he boldly led a task force of seven cruisers and a single destroyer down \"The Slot\" of New Georgia Sound and precipitated the Battle of Savo Island on the night of August 8/9. The Allied warships, off Guadalcanal to protect the transports, were three times the number that Mikawa brought, but their captains were taken completely by surprise. In thirty minutes, the Allies lost three heavy cruisers and over 1,000 dead at a cost to the Japanese of only slight warship damage and 127 dead. This Battle of Savo Island was one of the worst naval defeats the US Navy ever sustained. It was a clear tactical victory for Japan. Strategically, however, neither the earlier bombings nor Mikawa's spectacular raid did more than merely delay Allied landings of troops and supplies on Guadalcanal. Mikawa had withdrawn quickly without attacking the Allied transports for fear of remaining in range of Allied carrier aircraft when the sun rose.\nHe need not have worried. Even before Mikawa's attack, Fletcher received permission from Ghormley to withdraw his carriers from the area because of the perceived risk from Japanese land-based bombers. This was only 36 hours after landing had begun compared to the 48 hours Fletcher had promised to provide air cover and compared to the 96 hours Admiral Richmond Turner thought would be necessary to complete landing all the troops, equipment, and supplies needed. Without the protection of Fletcher's carrier-aircraft, Turner felt obliged to remove his transports as well, even though less than half of the heavy equipment and supplies had been unloaded. Vandergrift and his Marines were to be alone, low on ammunition, short of heavy equipment, with only about one months supply of food, and with the water and air around them dominated by the Japanese. Nine days later, Japanese troop began to land.\nFor the next three months, the adversaries fought bitterly for control of Guadalcanal, the air above it, and the sea around it. Both sides struggled to get more troops, weapons, and supplies onto the island. The Guadalcanal airstrip, named Henderson Field, became the focal point of the battles because whether it operated or not would ultimately determine who controlled of the air around Guadalcanal.\nSupplying, Reinforcing, and Ground Fighting- Round 1, Col. Ichiki (15-23 Aug 1942)\nFirst aircraft for Henderson airfield.On August 15, a week after the initial landings, a USN destroyer delivered the first supplies to the Marines. Delivering by regular transports, which were slow and vulnerable, was considered too risky without air cover. On August 20, from a point 200 miles southeast of Guadalcanal, escort carrier USS Long Island launched 19 Wildcat fighters and 12 Dauntless dive bombers, the first to reach Henderson Field. The Cactus Air Force was now in business and able to put up resistance to the almost daily bombing raids. Long Island then picked up a like number of planes at Efate in the New Hebrides and delivered them further north in the New Hebrides to Espiritu Santo on August 29. From there they flew to Guadalcanal further increasing Henderson Field's capability.\nFailure of attack on Henderson Field by the Ichiki Detachment.The IJA continued to regard enemy presence on Guadalcanal as more of an annoyance than an immediate threat. IJA pulled together units totaling 6,000 soldiers to sweep what they believed to be only 2,000 Marines from the island. The IJN were to deliver the men in four separate parcels, the first being a partial detachment commanded by Colonel Kiyonao Ichiki, 917 men. IJN destroyers that had landed the unit later came under attack, one being damaged, by US Army Air Force (AAF) B-17s based 640 miles away on Espirato Santo. Instead of waiting as ordered for the rest of his detachment to arrive, the overconfident Colonel Ichiki advanced immediately with 770 of his men. These were virtually wiped out August 21 in the Battle of the Ilu River, where 2,500 Marines were dug in and expecting him. The Americans lost 44 dead. The recently arrived aircraft at Henderson Field participated in the battle, strafing enemy positions. Next day, five AAF P-400 fighters flew onto at Henderson Field to join in its defense. American and Japanese destroyers each sought to supply their respective troops and exchanged fire. The day after that, an IJN destroyer bombarded Henderson, the first of many, many bombardments to come.\nBattle of the Eastern Solomons (Aug 24–25, 1942). With Japanese leadership now taking Guadalcanal more seriously, plans were made to send another 1,900 fighting men to Guadalcanal by slow transports from the main Japanese naval base at Truk. Admiral Yamamoto began examining how to use this situation to win the \"decisive victory\" that had eluded him at Midway. He correctly assessed that the Allies would challenge Japanese initiatives to reinforce troops on Guadalcanal. Accordingly, Yamamoto sent Admiral Nagumo with the reorganized Kidō Butai , now centered around two of his surviving fleet carriers, Shōkaku and Japanese aircraft carrier Zuikaku, along with light carrier Ryūjō and 30 other warships from Truk to a point north of Guadalcanal from where he could strike the American carriers with his 177 carrier-launched aircraft. Ryūjō was to be sent forward to attack Henderson Field and become bait to lure the American carrier aircraft to strike her. In the process, the American carriers would expose their positions and become vulnerable to attack by aircraft from Kidō Butai .\nAdmiral Fletcher's Task Force 61, which included three fleet carriers, Saratoga, Enterprise, and Wasp, did rise to the bait, leading to the Battle of the Eastern Solomons. The carriers were located 150 miles east of Guadalcanal. Fletcher, however, deceived by Japanese fleet movements into believing the attempt at reinforcing troops on Guadalcanal was not imminent, dispatched Wasp to the south to refuel, leaving his force with only two carriers. When the Ryūjō came within range and launched bombers to attack Henderson Field, Fletcher launched his aircraft. They found Ryūjō and sunk her with four bombs and a torpedo. Kidō Butai consequently located TF-61, and her dive bombers placed three bombs on Enterprise causing serious damage. She retired to Pearl Harbor for two months of repairs but, importantly, her aircraft was sent off to Henderson Field where it augmented the Cactus Air Force. Saratoga also withdrew. In summary, the Americans lost use of a fleet carrier for two months and lost 17 planes. The Japanese lost a light carrier and 70 planes and experienced air crews, a high price on top of the previous losses at Coral Sea and Midway. And once again, the decisive battle had eluded Admiral Yamamoto.\nAlso, importantly, the slow transports under Admiral Raizō Tanaka that were intended to reinforce Guadalcanal were delayed and diverted. All that night, Henderson Field was bombarded by Tanaka's destroyers in an attempt to destroy aircraft so that his transports could land troops the next day. This was not successful. Henderson aircraft, now including some from Enterprise, found the Japanese supply group the next morning, sank one of the three transports, and damaged Tanaka's flagship. Eight Allied B-17s from Espiritu Santo joined the attack with high-level bombing and sank a destroyer while picking up survivors. The landing was cancelled and IJN Zuikaku came south to provide air cover for the retreating ships. Tanaka regarded the operation as a complete failure. These engagements convinced many Japanese that daylight runs to reinforce Guadalcanal would be overly costly.\" Tanaka was ordered back to the Shortland Islands in the Northern Solomons. The month before, Japan had control of the land, sea, and air around Guadalcanal, day and night. Now the Allied aircraft at Henderson Field dominated the air and sea by day.\nReinforcing, Supplying, and Ground Fighting- Round 2, Gen. Kawaguchi (Aug 26 - 15 Sept 1942).\nEfforts to reinforce and resupply. Guadalcanal now became the focus for Japanese operations. Japanese soldiers in New Guinea had come within 20 miles from Port Moresby but were stopped by Australian troops. On August 31, the Japanese high command postponed further efforts in New Guinea in order to concentrate resources for retaking Guadalcanal.\nJapan's made determined efforts to reinforce and resupply Guadalcanal and to neutralize Henderson Field. These were met with equally determined efforts to prevent Japanese resupply by Henderson Field pilots during daylight hours. After losing many men and ships, the Japanese were obliged to attempt such efforts only by nighttime supply runs from Bougainville dubbed \"Tokyo Express\" by Guadalcanal's defenders. These nighttime supply runs also involved bombardment by destroyer's guns of Henderson Field.\nAllied ships seeking to reinforce and resupply their troops on Guadalcanal were also attacked, but the Cactus Air Force (CAF) at Henderson Field continued to grow in spite of losses during air combat and crash landings by damaged planes. By the end of August, CAF had 61 operational aircraft. In mid-September, USS Hornet managed to launch some additional Marine planes to Henderson Field. Beyond this, Gen. Vandergrift had no illusions about receiving additional outside help for some time. Admiral Ghormley had made it clear that a shortage of ships, aircraft, and supplies prevented the Navy from providing more support.\n'''Failure of attack on Henderson Field by Kawaguchi's Brigade'''. Tanaka and General Kiyotake Kawaguchi, who was to lead the next assault on the Allies on Guadalcanal, argued about whether to attempt transporting the General's troops and supplies by using relative fast destroyers or small motorboats that were easier to hide during daylight hours near the islands as they moved south. Neither suggested the third option, using the traditional, relatively slow transports. A compromise was reached that split the Japanese Army forces between the two transport methods. As a result, troops and supplies landed at different points on Guadalcanal.\nGeneral Kawaguchi's forces landed in different places on Guadalcanal. He was unable to unite them due in part to the rugged terrain and to the lack of effective communication capability. He landed 20 miles east of Henderson Field and spent days struggling through the jungle with 2,100 men, mostly out of touch with the rest of his detachment, to finally reach a point south of Henderson field from where he would make his assault. In addition to the physical challenges that weakened his men, there was malaria and dysentery. He estimated there were only 5,000 Americans guarding Henderson Field and believed his 6,200 fit-for-duty Japanese, split geographically into three groups, could prevail. The Allies had, in fact, over 19,000 men on the island. Kawaguchi did manage to attack with 2,100 men at a point where he enjoyed a 3:2 advantage over the Marines on his immediate front. He was opposed there by Colonel \"Red Mike\" Edson, whose Marines doggedly held their line during a night of bloody, close-in fighting, including suicidal Japanese attacks into machine gun fire. This was the Battle of Edson's Ridge, September 12–14, 1942. Other Japanese forces that were supposed to take part in the offensive did so a day late and were ineffective. After losing over 600 men compared to American losses of about 40, Kawaguchi withdrew and began the long trek back to his starting point.\nOnly one Allied fleet carrier in the Pacific (15 Sept - 24 Oct 1942). Task Force 61, which supported the initial Allied invasion of Guadalcanal, started with three fleet carriers, USS Saratoga, Enterprise, and Wasp. Enterprise was badly damaged in the Battle of the Eastern Solomons and had to retire to Pearl Harbor for extensive repairs. A week later, Saratoga was torpedoed by I-26 and likewise had to retire for repairs. With the arrival of USS Hornet in the South Pacific Area in late August, the number of operational Allied fleet carriers in the Pacific theater was two. The day after the Battle of Bloody Ridge, however, Wasp took torpedo hits from submarines I-15 and I-19 and sank while with Hornet escorting a convoy transporting the 7th Marine Regiment to reinforce Guadalcanal. Hornet just missed being hit by torpedoes from I-15 on the same day. As of 15 September, only one American carrier, Hornet, and one battleship, the USS North Carolina were operational and close enough to support the Marines fighting to hold their tenuous grip on Guadalcanal.\nJapan had five operational carriers at the time. In preparation for the third ground initiative to retake Guadalcanal, IJN battleships Kongo and Haruna bombarded Henderson Field on the night of October 13–14, expecting then to be engaged by the American fleet. With only USS Hornet operational, the Americans declined battle and used their radar-equipped search planes to maintain a constant distance from Japanese warships. Delays for General Maruyama's getting into position for the upcoming ground assault lengthened the cruising time for the Japanese fleet, resulting in concerns for oil shortages that limited what the fleet could do to interdict Allied supply lines to Guadalcanal. Also, an October 21 fire on fleet carrier IJN Hiyo caused her to leave the fleet for repairs at Truk. USS Enterprise sailed from Pearl harbor, repaired and with her air squadrons, on October 16 and joined Hornet with Task Force 17 in the South Pacific on 24 October, in time for the Battle of the Santa Cruz Islands.\nReinforcing, Supplying, and Ground Fighting- Round 3, Gen. Maruyama (18 September - 26 October 1942)\nEfforts to reinforce and resupply. The broken Japanese Army, scattered around Guadalcanal and perhaps only 5,000 strong, could accomplish little without reinforcements. General Harukichi Hyakutake, headquartered at Rabaul, commanded the Japanese 17th Army. He recognized that the piecemeal approach that had been pursued so far against the Allies had been ineffective. He proposed to take the entire 2nd division to Guadalcanal along with its heavy artillery. He staunchly refused the Admiral Tanaka's offer to transport this force by destroyers and/or motorboats because they would be unable to properly handle the division's heavy equipment. Hyakutake insisted instead that he personally accompany his army division to Guadalcanal on regular transport ships, even if the navy refused to provide major surface units to escort them. Yamamoto recognized this would be suicidal and embarrassing to the navy, and he was thereby prodded into providing serious a naval escort for the transports. In addition, he would have his battleships bombard Henderson Field on the eve of the landing to reduce the next day's threat from the air. Yamamoto saw in this, of course, yet another opportunity for luring American carriers to within striking range of his own carriers and precipitating that \"decisive battle\" that consumed his strategic thinking.\nLike Yamamoto, Admiral Nimitz was being prodded by Vandergrift to commit more resources to the struggle on Guadalcanal. Nimitz requested help from MacArthur, who had a total of 55,000 American and Australian troops in Port Moresby. MacArthur declined, still concerned about the threat there. Feeling the need for a more aggressive commander in the South Pacific, Nimitz replaced Ghormley with Halsey, who promptly promised to give Vandergrift \"everything I've got\" for the anticipated battle.\nSince the last Japanese attack on Henderson Field, both sides had made determined efforts to reinforce and resupply their troops on Guadalcanal. The Allies brought in more Marines and aircraft without significant losses and felt strong enough to make attacks on enemy positions near the Matanikau River, west of Henderson Field. By this time, the new escort carrier USS Copahee had begun delivering troops, aircraft, and supplies to the South Pacific. She sailed from Nouméa and, on October 11, launched 20 fighters to Henderson Field. Almost 3,000 GI's of the Americal Division arrived on Guadalcanal in spite of two Japanese bombing raids. Vangergrift now had 23,000 men. According to Toland, \"The seesaw battle of supply...went to the Americans.\"\nThe Battle of Cape Esperance. During a cruiser and destroyer battle of October 11–12 Guadalcanal's Esperance, an Allied force escorting a supply convoy and using radar achieved surprise over a Japanese force also escorting a convoy. Nonetheless, 80% of the Japanese troops and cargo were landed at Tassafaronga Point.\nHyakutake now had a total of 15,000 troops fit for battle. But they had to be moved into place. As in their previous offensive on Henderson Field, the Japanese forces were divided. One group would shell the American positions from the west while another, under General Masao Maruyama would lead a division over 15 miles of jungle trail to the south of Henderson Field, the same general location at which the previous, failed attempt under General Kawaguchi had been launched. Only 5,600 soldiers marched toward the launch point for the attack on Henderson Field.\nAs Yamamoto promised, 14\" guns from his battleships mercilessly bombarded Henderson Field for an hour and a half on October 14, an event remembered forever by the unfortunate Marines at the receiving end. More than 40 aircraft were destroyed on the ground that night, leaving only 42 operable to fight in the morning.\n'''Failure of attack on Henderson Field by Maryuama's division'''. On October 24–25 during Maryuama's attack on Henderson Field, his men again and again attacked the Marines commanded by Lt. Col. Chesty Puller and the GIs of the Americal Division. They were pushed back, and the Allies held. The Allies followed up their victory by attacks to the west and east of the airfield, further solidifying their position.\nThe struggle over Henderson Field took place in the air as well. During the period from September 27 to October 26, the Cactus Air Force lost a total 103 aircraft, 48 in air combat, the rest from bombardment, etc., but destroyed 131 Japanese aircraft in return, including 12 launched from carriers. As the ground battle for Henderson Field raged, so did a major carrier battle at sea.\nBattle of the Santa Cruz Islands (25-27 October 1942). As Yamamoto expected, Halsey brought his carriers forward to support Allied troops on Guadalcanal. Both admirals were itching for a fight. Yamamoto, operating from battleship Yamato at Truk, sent the Second Fleet with 47 warships including four fleet carriers with 199 aircraft and four battleships to the Southern Solomons area under the command of Admiral Nobutake Kondō. Under Kondo, Admiral Nagumo was responsible for the three fleet carriers of Carrier Division 1. (Shokaku, Zuikaku, Zuiho)\nUnlike Halsey, some of his superiors opposed risking more naval resources to hold Guadalcanal. In the Atlantic, an Allied invasion force was on its way to North Africa, and German U-boats were taking an enormous toll on merchant shipping. Supplies for the British Army in Egypt were still being routed the long haul around the Cape of Good Hope because of the danger to Allied shipping in the Mediterranean. American planners were still contemplating an invasion of France from Britain as early as 1943 and wanted to conserve resources for that operation. However, on October 24, while the assault on Henderson Field was in progress, President Roosevelt overruled those arguing for conserving resources for deployment in Europe and, supporting Admiral King and General MacArthur, insisted that Guadalcanal be reinforced.\nTo oppose Yamamoto's powerful Combined Fleet, Halsey, operating from Nouméa, had 33 warships including two fleet carriers with 136 aircraft and two battleships. The 60 aircraft at Henderson Field were 450 miles away from the Santa Cruz Islands, beyond their range. Task Forces 16 and 17 were combined as Task Force 61 under the command of Admiral Thomas Kinkaid. Task Force 64 was under the command of Admiral Willis Lee who, like Kinkaid, reported directly to Nimitz. Admiral Kondo had a 3:2 advantage in strike aircraft over Admiral Kinkaid. In addition, Kondo's air groups contained the remainder of the 3,500 highly prized, highly trained, and now highly experienced pilots with which Japan began the war. In comparison, Enterprise squadrons consisted of an integrated mix of experienced squadron leaders and pilots with only three months training. ''Hornet's dive bomber and fighter squadrons were experienced, but the torpedo squadrons were not. Halsey understood the numerical odds but, characteristically, sought to even the odds by aggressively taking the initiative. He ordered Kinkaid to go looking for trouble north of the Santa Cruz Islands and intercept enemy forces approaching Guadalcanal.\nAs the land battle for Henderson Field remained undecided, aircraft from both fleets searched for each other, all believing that striking the enemy first was the key to success. Radar-assisted Catalina float planes could patrol at night, providing the Allies an advantage. A Catalina found IJN Zuikaku at 0250 on October 26 and dropped bombs that missed her. By dawn, both sides had put up their Combat Air Patrols (CAPs) to protect their ships. IJN Zuiho was found, attacked, and hit by two dive bombers from USS Enterprise. Unable to launch or recover aircraft, she withdrew. By this time, attack aircraft from both sides had located enemy carriers and passed in sight of each other as they sortied to attack their respective carrier targets. Japanese aircraft hit USS Hornet with six bombs and two torpedoes, crippling her. American aircraft hit IJN Shokaku with bombs. Japanese aircraft then hit USS Enterprise with bombs, which caused damage but did not knock her out of action. With both his carriers damaged, Admiral Kincaid withdrew.  With efforts to tow Hornet to safety underway, IJN torpedo bombers put another torpedo into her.  Admiral Halsey ordered her sunk, but US torpedoes failed to explode and USN destroyer gunfire proved insufficient.  She was left to her fate.  It was IJN destroyers and their highly effective long lance torpedoes that ultimately sank her.\nThe Battle of Santa Cruz Islands was a tactical victory for Japan.  The IJN sank a US fleet carrier and a destroyer without itself losing a ship.  However, IJN carriers Shōkaku and Zuihō  were severely damaged and forced to withdraw without recovering their strike aircraft. Some IJN aircraft were recovered by Zuikaku'', but most were forced down at sea.  Sixty-three IJN planes did not return to their carriers, and 23 more were lost during emergency landings.  In what had become a war of attrition rather than one of decisive battles, Japan was unable to make good her losses against the industrial capability of the United States.  At the excessive cost in experienced pilots and planes, Japan had won only a Pyrrhic victory.  The strategic victory belonged to the Allies.  IJN carriers were not used to reengage Allied naval forces again until mid-1944, by which time the USN had added 19 fleet and light carriers to its navy while the IJN added only five.\nAdm. Yamamoto expected Maruyama's ground assault to be successful, ending the threat to his warships from Allied aircraft at Henderson Field. He had planned to fly his own planes to the airfield and use it himself.  This did not come to be.  The third and ultimately final Japanese ground attack on Henderson Field was unsuccessful.\nNo Allied fleet carriers in the Pacific (27 Oct - 11 Nov 1942). Although she was able to remain in the Battle of Santa Cruz Islands after sustaining bomb damage, USS Enterprise was under repair at Nouméa from 20 October to 11 November.  USS Hornet had been sunk, and Saratoga was still under repair at Pearl Harbor for torpedo damage sustained 31 October 200 miles east of Guadalcanal while escorting a supply convoy.   All the British carriers and the USS Ranger were far away in the Atlantic Theater. For two weeks around early November, the Allies had no operational fleet or light carriers in the Pacific.  Battle attrition had also diminished the Japanese carrier strike capability.  Only two of Japan's six fleet and light carriers, IJN Zuikaku (CV) and Junyo (CVL), were available for offensive operations .  IJN Hosho had been relegated to training status and  Hiyo had been damaged by a boiler explosion.  Battle damage to Zuiho (CVL) and Shokaku(CV) sustained at the Battle of Santa Cruz had not yet been repaired. For a short period, battleships rather than aircraft carriers were the capital ships that would be making the principal contribution to the outcome of naval battles.\nReinforcing, Supplying, and Ground Fighting- Round 4, Adm. Tanaka (30 October -  12 November 1942).\nEfforts to reinforce and resupply.  Neither the IJN nor IJA were yet willing to give up on retaking Guadalcanal.\nSolomon Islands (1942–1945)\nNew Guinea (1942–1945)\nAllied drive across the Central Pacific (1943–1944)\nAllied domination and victory (1944–1945)\nFootnotes\n, , , and  (all commissioned during 1942, and all also operating exclusively in the Atlantic), participated in Operation Torch. Ranger was transferred to the Pacific as a training vessel in July, 1944.}}\n. Destroyer ''O'Brien, included in the USN losses, was also hit by an I-19'' torpedo during that attack, did not sink due to resulting structural damage until 19-Oct-1942 without loss of life.}}\n}}\nSee also\n* Timeline for aircraft carrier service\n* United States Navy in World War II\n* Aircraft carrier operations during World War II\nCitations\nReferences\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*"
    }
  ]
}