{
  "content": [
    {
      "type": "text",
      "text": "# Packing house__disambig_1\n\nAn apple and pear packing house in Pateros, Washington.\nA packing house is a facility where fruit is received and processed prior to distribution to market.\nBulk fruit (such as apples, oranges, pears, and the like) is delivered to the plant via trucks or wagons, where it is dumped into receiving bins and sorted for quality and size. In the case of citrus, ripe fruit with a greenish tint is placed in special storage rooms where ethylene gas is used to bring out the color. Obvious \"culls\" (fruit that is not suitable to sell for eating due to cosmetic defects) is removed and sold for juice or other uses. Fruit that is ready to be packed into crates or flats is run through a washer and then air-dried.  A light coating of natural wax is applied to help the fruit retain moisture and enhance its appeal.\nThe fruit is transported via conveyor belts to the grading tables where it is visually sorted into three grades: top quality, average, and orchard run, and is then carried via belts to the packing tables. During the late 19th century top-grade fruit would be wrapped in printed tissue paper (a technique developed in the town of Orange, California in the 1880s) and placed in the boxes so that the printed names showed between the slats. In the 1920s tissue wrappers were replaced with printed logos, and ultimately paper stickers.\nPacked fruit is designated by size, based on the average number of pieces it takes to fill a box. In the days of wooden crates, sizes generally ranged from the 100s to the 390s, demonstrating the wide range of sizes. The sizes for the smaller cardboard boxes introduced in the 1950s and still in use today range from the 40s to the 210s, depending upon the variety of fruit being shipped.\nToday, packing is often still performed by hand, even though Sunkist developed robotic packing machines in the 1980s. Packed boxes are stored in a \"pre-cooler\" to prepare them for the trip to market by truck or rail. Fruit was shipped across the country in ventilated railroad cars or insulated boxcars before the advent of the refrigerator car.\nSee also\n*List of packing houses\n*Packing house is also used to refer to a slaughterhouse.\nReferences\n*"
    }
  ]
}