{
  "content": [
    {
      "type": "text",
      "text": "# Packing for Mars\n\nPacking for Mars: The Curious Science of Life in the Void is a nonfiction work by science author Mary Roach.\nPublished in August 2010, Packing for Mars was recognized in \"Amazon's Best Books\" of that month, it quickly became a #6 New York Times bestseller, and it was chosen as the book of the year for the 7th annual One City One Book: San Francisco Reads literary event program.\nIn Packing for Mars, Roach searches for answers to questions about the gross, the bizarre, and the uncomfortable aspects of space travel. The book's sixteen chapters cover the entire comedic spectrum of all things space-related and also include some study of the scientific side of space travel. The chapters discussing the various bodily functions of astronauts in space (going to the bathroom, having sex, vomiting) and obscure testing procedures (animals in space, lying in beds for months, parabolic zero-g) are balanced by the informative sections on topics such as the psychological effects of being in space, astronaut training, and the increasing use of human cadavers over crash test dummies in research.\nMary Roach's overview\nMary Roach, the author of Packing for Mars, was raised in Etna, New Hampshire and spent several years working as a freelance copy editor and investigating unpopular topics. Roach explores many questions such as what happens after we die, what sex is all about, and what secrets human cadavers hold. However, in Packing for Mars, she turns her mind toward space and examines the logistics of space travel. In an interview, she describes her book to be about all the surreal physical and physiological challenges of living in space as a human being. Roach explains that in addition to these problems, human beings are not in the slightest equipped or prepared to confront these challenges.\nAlthough most of her other books have one-word titles, Mary Roach claims that it was especially difficult to come up with a one-word title for this specific book.\nSubjects covered\nThe book covers 12 topics:\n* The psychological specifications for being considered for a space mission\n* The psychological effects of being in space\n* Initial precautions of going to space\n* Testing procedures\n* Cadavers used for anatomically precise testing\n* Animal testing\n* Simulation procedures\n* Space hygiene\n* The physiological effects of being in space\n* Sex in Space\n* Preparing food for space\n* The author's thoughts on space travel\nReviews\n*\n*\n*\nReferences\nExternal links\n* [http://www.maryroach.net Mary Roach's website]\n* [http://books.wwnorton.com/books/detail.aspx?ID=15585 Packing for Mars on W. W. Norton & Company's website]\n*"
    }
  ]
}