{
  "content": [
    {
      "type": "text",
      "text": "# Packington\n\n| population =          734\n| population_ref = (2011)\n|shire_district=            North West Leicestershire\n|shire_county=            Leicestershire\n|region=                  East Midlands\n|constituency_westminster=      North West Leicestershire\n|post_town=              Ashby-de-la-Zouch\n|postcode_area=          LE\n|postcode_district=       LE65\n|dial_code=      01530\n|os_grid_reference=\n|london_distance=\n|static_image=Packington Methodist Church, High Street - geograph.org.uk - 1315821.jpg\n|static_image_width=240px\n|static_image_caption= The village ex Methodist Church - Now a private house\n}}\nPackington is a village and civil parish in the district of North West Leicestershire. It is situated close to the A42 road and the towns of Ashby de la Zouch and Measham. The population of Packington according to the 2001 UK census is 738, reducing slightly to 734 at the 2011 census.   Nearby villages include Normanton le Heath and Heather.\nPackington has a public house called the 'Bull and Lion' (reputedly the only one in Britain) and a local shop called 'Daybreak Services'. It is part of the National Forest and the Gilwiskaw brook runs through the village.\nHistory\nOrigins\nPackington's origins are unknown. Its placename suggests an Anglo-Saxon settlement, possibly established by followers of a leader named Pacca or similar. The settlement may already have been in place in the heyday of the Kingdom of Mercia under Aethelbald and Offa during the eighth century. However, this is merely speculative. It is likely that the course of the Gilwiskaw Brook played a critical part in the process of settlement; the brook's unusual name has roots in both Old English and Old Norse, reminding us that the wider area became part of the Viking Danelaw from the late ninth century.\nMiddle Ages\nThe first known report of Packington occurs in 1043. In this year Leofric, Earl of Mercia, endowed St. Mary's Abbey, Coventry, with the manor of Packington (and also other settlements in what is now Leicestershire). The Abbey (which became a Priory in 1102) retained it up to the dissolution of the monasteries in 1539-40.\nThe Domesday Book of 1086 confirms the Abbey's holding of eight and a half carrucates (one carrucate being the amount of land which one team of oxen could plough in a season) and reports that \"in demesne is one plough; and three villeins with a priest and one bordar and five sokemen have three ploughs. There is a mill rendering 12 pence and three acres of meadow. It is worth 20 shillings.\"\nIt is unclear whether there was a church in Packington when the Domesday Book of 1086 was compiled, though mention of a priest suggests the possibility. The oldest parts of the present Holy Rood Church are believed to date from the late eleventh century, or at the latest from the reign of King John (1199-1216).\nBy 1130, a link had already been established between Packington and Snibston (now part of Coalville). In that year records show both being held by Hugh, Sheriff of Leicester, presumably under an arrangement with the Priory. By 1220 a chapel at Snibston was to be served by a chaplain appointed by the vicar of Packington. This link continued for centuries, long after the Priory had been dissolved.\nIn 1257, St. Mary's Abbey was granted a licence by King Henry lll to hold a market in Packington.\nEarly modern times\nFollowing the dissolution, Packington passed into the hands of the Duke of Suffolk, who was subsequently executed for treason.  In 1563 it was granted to the Earl of Huntington, head of the Hastings family, who then resided at nearby Ashby Castle. Links with the family continued for over 350 years. Successive Earls held advowson regarding the vicars of Packington for most of this period.\nDuring the English Civil War the vicar, Thomas Pestell, was ejected from the church by Parliamentary troops and replaced by a Mr. Pegg. This appears to have been unpopular with the villagers and following the restoration of King Charles Rev. Pestell was himself restored in 1662, continuing in office until his death in 1690.\nIn the 1730s Theophilus, the then Earl, commissioned a map of his estates, which was produced in 1735. Packington as shown on the map has the same main routes as the present-day village. The map gives field names for the surrounding area, much of which belonged to the Hastings estate. It also shows holdings of independent landowners of the time. Most of the manor was dedicated to farming, although one area along the road to Normanton, known as Coalpit Heath, was the scene of sporadic coal production and had been since at least the sixteenth century.\nIn 1790 Francis, tenth Earl of Huntingdon, gave the manor of Packington to his illegitimate son Charles, who became General Sir Charles Hastings after military service in the Napoleonic Wars. Sir Charles married Parnell Abney, heiress to the Abney family of nearby Willesley Hall, and took up residence there. On his death in 1823, his son Sir Charles Abney Hastings succeeded. He established the first school in Packington (now called \"Old School House\") and built the bridges over the Gilwiskaw Brook.  The alliance of the Hastings and Abney families is commemorated in the name of Packington's village inn: The Bull and Lion, formerly known as the Bull's Head and Lion, reflects heraldic symbols of both families.\nFrom around 1750, Baptists established a base in Packington. In 1761 they were loaned a barn in Mill Street for services and from 1799 were led by Rev. Joseph Goadby who arranged the building of a chapel which opened in 1832. Methodists also established a presence with a chapel opening just off High Street in the 1830s.\nThe Packington Round House was probably built in the late eighteenth century (the exact date is unknown) as part of the Hastings estate. It was intended as a place to lock up offenders for short periods; it soon became a well-known local landmark and has remained so to the present day.\nLater in the nineteenth century the manor passed to Charles Frederick Abney Hastings who married Edith, holder of a Scottish peerage as Countess of Loudoun. Following her death in 1874 her son became Earl ofLoudon, continuing to live at Willesley Hall. Working closely with the vicar, Rev. Arthur Mammatt, the Earl opened a new primary school in 1893, as the original one was too small to cater for growing numbers, on the site of today's school.\nFrom early times some parts of Packington (both in the core of the village and in outlying fields) were in Derbyshire although most of the village belonged to Leicestershire. In the 1851 census, for example, 75 households were in Leicestershire and 54 in Derbyshire. The origins of this are obscure: it came to an end in 1884 when an Act of Parliament reformed local government; since then all of Packington has been in Leicestershire. The same Act finally severed Packington's connection with Snibston.\n'Twentieth Century ...and beyond'\nFollowing the Earl's death in 1920, his niece succeeded to the estate and to the title of Countess of Loudon. She decided to spend most of her time on her Scottish estate and arranged to sell off most of her holdings in Packington through auctions held in 1921 and 1922. Many estate tenants bought the property they had been occupying at this time. Further sales continued until the last remnant of the Hastings estate was the Round House. This was gifted to Packington Parish Council in 1997.\nBetween the world wars most employment in Packington continued to be in farming, with several large farms and numerous smallholdings both within the village and in outlying parts. There were a number of shops including a Post Office and several small businesses. In 1938 a coalmine was opened along Spring Lane in an attempt to maximise production from the Coalpit Heath area. This achieved limited success but was superseded by opencast mining from the early 1940s, carried out by Macalpines over approximately twenty years.\nElectricity came to the village in the 1930s, mains water and sewage in the 1950s and gas in the 1960s. Towards the end of World War Two a group of villagers decided to start raising funds for a Village Hall to serve as a memorial to villagers who had sacrificed their lives in both World Wars. After much collective effort Packington Memorial Hall opened in 1958 and soon became a focal point of village life.\nBy the 1960s some of the old farms were demolished and replaced by modern housing. The population of the village grew significantly in the 1960s and 1970s. Some new building has continued around the core of the village to the present day, with the population now over 800.\nWhile worship at the Holy Rood Church continues, the Baptist and Methodist churches are no longer present. Membership of the Baptist Chapel had declined significantly by the start of World War Two and the chapel was demolished in 1958. The Methodists opened a new chapel on High Street in 1905, which was recognised as a church in the 1930s. However, membership declined towards the end of the century and a final service was held in 2009. The former church is now a private residence.\nThe Post Office closed in 2008 but the village retains a very well-stocked and much used food and general store. The Bull and Lion public house continues to attract custom from within the village and further afield.\nDespite the increase in its population over the last sixty years, Packington is still quintessentially an old English village retaining its original medieval road layout and many picturesque old buildings.\nThe Packington Blind Horse\nThe foundation stallion for the Shire horse breed is generally recognized as the Packington Blind Horse who stood at stud in the village between 1755 and 1770.It is believed to have been bred by Mr. Hood of the village. Its descendants have been traced as far as 1832.\nReferences\n* Cox, B. \"The Place-names of Leicestershire\" Vol.7\n* Nichols, John (1795-1815) History and Antiquities of Leicestershire, Vol. III, pg. 927.\n* Mathews, A. G. (1948) Walker Revised\n* Owen C. \"The Leicestershire and South Derbyshire Coalfield 1200 - 1900\n* Gilbey, Sir Walter \"The Great Horse or The War Horse - form the time of the Roman Invasion till its development into the Shire Horse\" London 1899\n* Packington Village History Group website www.pvhg.uk\nExternal links"
    }
  ]
}