{
  "content": [
    {
      "type": "text",
      "text": "# Packers–Vikings rivalry\n\n| mostrecent = December 29, 2024Vikings 27, Packers 25\n| nextmeeting = November 23, 2025\n| stadiums= Packers: Lambeau FieldVikings: U.S. Bank Stadium\n| total = 129\n| series = Packers: 66–60–3\n| regularseason  = Packers: 65–59–3\n| postseason = Tied: 1–1\n| largestvictory = Packers: 45–7 Vikings: 42–7\n| mostpointsscored = Packers: 48 Vikings: 42\n| longeststreak = Packers: 6 (1961–1963)Vikings: 7 (1975–1978)\n| currentstreak = Vikings: 2 (2024–present)\n| section_header = Post-season history\n| section_info   =\n}}\n| zoom = 5\n| width = 280\n| height = 250\n| caption = Locations of the Green Bay Packers and Minnesota Vikings\n| mark1 = Green pog.svg\n| label1 = Packers\n| mark-coord1 =\n| label-pos1 = top\n| label-color1 = black\n| mark2 = Purple pog.svg\n| label2 = Vikings\n| mark-coord2 =\n| label-pos2 = top\n| label-color2 = black\n}}\nThe Packers–Vikings rivalry is a National Football League (NFL) rivalry between the Green Bay Packers and the Minnesota Vikings.\nIn the modern era, the Minnesota Vikings have been the biggest NFC North challenger to the Green Bay Packers. While the Packers have won almost 75% of its games against the Chicago Bears and Detroit Lions since the beginning of quarterback Brett Favre’s first season in 1992, they have only won ~50% of their games against the Vikings (going 35–31–2 in that period). CBS ranked it the #3 NFL rivalry of the 2000s.\nThe Packers lead the overall series, 66–60–3. The two teams have met twice in the playoffs, winning one each.\nNotable moments and games\n*The Packers, under coach Vince Lombardi beat the Vikings in nine of the first ten meetings in Minnesota's first five seasons in the NFL (1961–1965). In Green Bay's two Super Bowl seasons under Lombardi (1966–67), the two teams split their semi-annual meetings. In Minnesota's four Super Bowl seasons (1969, 1973, 1974, 1976) the Vikings won seven of eight meetings with the Packers. Vikings' coach Bud Grant went 22–14–1 against the Packers.\n*On September 26, 1993, the Vikings trailed the visiting Packers 13–12 with no timeouts and less than two minutes remaining on the clock. Needing a big play on 4th and 8 from their own 19, Minnesota quarterback Jim McMahon found Cris Carter for a 19-yard gain to keep the Vikings' drive alive. A couple more completions, mixed with three incomplete passes, set up a third-and-10 from mid-field with 14 seconds left. McMahon rolled right to avoid the rush, when suddenly he spotted rookie wide receiver Eric Guliford who was wide open by 20 yards. McMahon then connected on a 45-yard bomb with 6 seconds left to play before Mike Prior could force Guliford out of bounds. That would set up Fuad Reveiz's fifth field goal of the game, lifting the Vikings to a 15–13 victory. It was Guliford's only catch in his two seasons with the Vikings.\n*On October 5, 1998 Vikings rookie Randy Moss made his Monday Night Football debut at Lambeau Field and had five catches for 190 yards and two touchdowns. Randall Cunningham had two additional touchdown throws and Gary Anderson kicked three field goals in a 37–24 Vikings win. Favre threw three interceptions and was benched for Doug Pederson, who threw a pair of fourth-quarter touchdowns. The loss ended an 18-game winning streak for the Packers at Lambeau Field, dating back to 1995.\n*In a Monday Night Football game on November 6, 2000, the Packers and Vikings were tied at 20 in overtime when Brett Favre threw a long pass that Vikings cornerback Cris Dishman deflected towards Antonio Freeman, who was on the ground. The ball went straight from Dishman to Freeman's shoulder, who then rolled over to make the catch at the 15-yard line, and took it for the touchdown and the 26–20 win. This prompted commentator Al Michaels to famously utter, \"He did what?\"\n*On December 24, 2004 the Packers traveled to the Metrodome for a Week 16 matchup that would determine the 2004 NFC North champion. Both teams entered the game with 8–6 records. The Vikings took a 31–24 lead midway through the fourth quarter, but the Packers mounted a late comeback to tie the game with 3:34 remaining. The Packers then drove down the field and won the game on a 29-yard field goal from Ryan Longwell as time expired. It was the second time in the season that Longwell had kicked a last-second field goal to give the Packers a 34–31 win over the Vikings.\n*January 9, 2005 marked the first time that the two clubs played each other in the playoffs. The Vikings jumped to an early lead and won 31-17. In the 4th quarter after his second touchdown, Vikings wide receiver Randy Moss faux mooned Packer fans. In the moment, Fox announcer Joe Buck famously denounced the end zone celebration as \"a disgusting act.”\n*The week leading to the teams' 2007 Week Four match up at the Metrodome was talk of whether Brett Favre would break the all-time passing touchdown record. He had already tied the record the week before, therefore needing only one touchdown pass to break Dan Marino's all time record of 420. Favre broke the record in the first quarter on a 16-yard touchdown pass to Greg Jennings. The Packers went on to win the game 23–16.\n*In week 10 of the 2007 season the Packers defeated the Vikings 34–0, for the second shutout of the series.\n*A missed 52-yard field goal try by the Packers' Mason Crosby with 26 seconds remaining sealed a hard-fought 28–27 Vikings win at Hubert H. Humphrey Metrodome on November 9, 2008. Gus Frerotte overcame three interceptions (one returned 55 yards by the Packers' Nick Collins for a touchdown) to throw two touchdowns while Adrian Peterson rushed for 192 yards and the decisive touchdown with 2:22 to go in the fourth. Packers QB Aaron Rodgers threw for 142 yards but in the second quarter fumbled in the endzone and was flagged for intentional grounding, giving a safety to the Vikings; Jared Allen then sacked Rodgers in the Packers endzone with 52 seconds left in the first half for another Vikings safety.\n*Monday Night Football earned the highest ratings in cable television history on October 5, 2009 when the Vikings hosted the Packers. The game was the first meeting between the Packers and their former quarterback Brett Favre. The Vikings took over the game when Aaron Rodgers was sacked at the Vikings 33-yard line and fumbled. The Vikings drove downfield as Adrian Peterson rushed six times for 26 yards and Favre threw five times, ending in a one-yard touchdown to Visanthe Shiancoe. Rodgers managed a 62-yard touchdown to Jermichael Finley, and after an exchange of touchdowns (a 14-yard Favre pass to Sidney Rice and a Clay Matthews strip-tackle of Peterson returned 42-yards) Favre raced the Vikings to the Packers redzone; a pass to the endzone was picked off but the play was nullified on pass interference, and one play later Peterson rushed in another score. The Vikings never let the Packers closer as they won 30–23, taking a 4–0 record in the 2009 season's first quarter.\n*On October 24, 2010, the two teams met on Sunday Night Football Three Favre interceptions helped the Packers surge to a 28–24 lead but Favre led a late comeback; an end zone catch by Percy Harvin with 57 seconds remaining was nullified when review showed one foot out of bounds, and the Vikings failed to convert a touchdown in their final attempt. Favre suffered an injury to his left ankle that left his season in doubt and coach Brad Childress was livid with the officiating crew led by Scott Green. In the November 21 rematch, the Packers routed the Vikings 31–3 behind four Aaron Rodgers touchdown passes, making Rodgers 2–2 against Favre in his career. The loss dropped the Vikings to 3–7, all but eliminating them from playoff contention. Childress was fired by the Vikings the next day, and defensive coordinator Leslie Frazier was promoted to replace him. The Packers went on to win their fourth Super Bowl.\n*Adrian Peterson came up nine yards short of breaking Eric Dickerson's 1984 rushing record but his late scamper set up the winning field goal in a 37–34 Vikings win on December 30, 2012. The Packers erased a 20–10 halftime gap but could not eke out a win, while the Vikings advanced to the playoffs as the NFC's sixth seed.\n*On January 5, 2013 the Packers defeated the Vikings 24–10 in the Wild Card round just six days after falling to the Vikings in Week 17. The Packers were able to hold Adrian Peterson under 100 yards after he had run for 210 and 199 yards respectively in the first two meetings.\n*The Packers and Vikings played for the division crown in Week 17 of the 2015 season at Lambeau Field. The Vikings won the contest 20–13, claiming their first division title since 2009 and breaking the Packers' four-year streak.\n*In the first ever game in U.S. Bank Stadium, Week 2 of the 2016 season, the Vikings defeated the Packers 17–14 en route to a 5–0 start to the season. However, the Vikings went 3-8 the rest of the season and were eliminated from playoff contention with a 38-25 loss to the Packers at Lambeau Field in Week 16.\n*The two teams faced off at U.S. Bank Stadium on October 15, 2017. Midway through the first quarter, Minnesota linebacker Anthony Barr tackled Aaron Rodgers, causing him to leave the game with a broken collarbone. Rodgers had surgery on October 19 and was placed on injured reserve, giving quarterback Brett Hundley the reins. The teams headed in opposite directions going forward, as the Packers' eight-year streak of playoff berths ended with a 7–9 record after starting 4–1, while the Vikings finished 13–3 and won the NFC North, losing to the eventual Super Bowl LII champion Philadelphia Eagles in the NFC Championship Game. The following offseason, a controversial rule change was introduced that would cause similar tackles to result in a roughing the passer penalty.\n*On December 23, 2017, the Vikings won 16–0; the first time the Vikings shut out the Packers at Lambeau Field and Minnesota's first sweep of Green Bay since 2009. It was the second home shutout of the season for the Packers, who previously had not been shutout at home since 2006, following a 0–23 loss to the Baltimore Ravens.\n*On December 23, 2019, the 11–3 Packers and 10–4 Vikings met at U.S. Bank Stadium for Monday Night Football that would have implications on NFC playoff seeding. A Packers win would clinch the NFC North, while a Vikings win would keep them in contention for the division title. Despite three early turnovers in the first half from the Packers offense, they would eventually win 23–10 behind 3.5 sacks from OLB Za'Darius Smith and 154 rushing yards and two touchdowns from RB Aaron Jones. The win marked the first Packers win in Minnesota since 2015 and their first ever win at U.S. Bank Stadium. The Packers clinched the NFC North title, while the Vikings, having already clinched a playoff spot prior to the game due to a Rams loss, were locked in as the NFC's sixth seed.\n*On December 29, 2024, the 11–4 Packers met the 13–2 Vikings met at U.S. Bank Stadium for a game with major NFC playoff implications. Although both teams had already clinched playoff berths, a win by the Vikings would keep them in contention for the division title, while a Packers win gave them a chance to leapfrog Minnesota in terms of playoff seeding. Vikings quarterback Sam Darnold threw for 377 yards and three touchdowns as the team raced out to a 27–10 lead in the fourth quarter, although a late Packers rally made the final score 27–25. The Vikings' win gave them their first sweep of Green Bay since 2017 and set up a winner-take-all NFC North title game against the Detroit Lions the following week, while the Packers, who had already been eliminated from division title contention the previous week, were assured to be the conference's sixth or seventh seed. Both teams would lose to each of their respective conference rivals in the opening round; Packers 22–10 to the eventual Super Bowl LIX champion Eagles and the Vikings 27–9 to the Los Angeles Rams.\nSeason-by-season results\n;|title=Green Bay Packers vs. Minnesota Vikings Season-by-Season Results}}\n;|title=1960s (Packers, 11–7)|Season||at Green Bay Packers |at Minnesota Vikings||Notes}}\n|-\n|\n| style=\"|\n| style=\"| Packers  28–10 †\n| style=\"| Packers  33–7\n| Packers  2–0\n| Vikings join the National Football League (NFL) as an expansion team. They were placed in the NFL Western Conference, resulting in two meetings annually with the Packers.Packers win 1961 NFL Championship.\n|-\n|\n| style=\"|\n| style=\"| Packers  34–7\n| style=\"| Packers  48–21\n| Packers  4–0\n| In Minnesota, Packers score their most points in a game against the Vikings.Packers win 1962 NFL Championship.\n|-\n|\n| style=\"|\n| style=\"| Packers  28–7\n| style=\"| Packers  37–28\n| Packers  6–0\n|\n|-\n|\n| Tie 1–1\n| style=\"| Vikings  24–23\n| style=\"| Packers  42–13\n| Packers  7–1\n|\n|-\n|\n| style=\"|\n| style=\"| Packers  24–19\n| style=\"| Packers  38–13\n| Packers  9–1\n| Packers win 1965 NFL Championship.\n|-\n|\n| Tie 1–1\n| style=\"| Vikings  20–17\n| style=\"| Packers  28–16\n| Packers  10–2\n| Vikings' win was the Packers' only home loss in the 1966 season.Packers win 1966 NFL Championship and Super Bowl I.\n|-\n|\n| Tie 1–1\n| style=\"| Vikings  10–7 †\n| style=\"| Packers  30–27\n| Packers  11–3\n| As a result of expansion, the two eight-team divisions became two eight-team conferences split into two divisions, with the Packers and Vikings placed in the NFL Central division.Packers win 1967 NFL Championship and Super Bowl II.\n|-\n|\n| style=\"|\n| style=\"| Vikings  26–13 †\n| style=\"| Vikings  14–10\n| Packers  11–5\n|\n|-\n|\n| style=\"|\n| style=\"| Vikings  9–7 †\n| style=\"| Vikings  19–7\n| Packers  11–7\n| Vikings win 1969 NFL Championship, lose Super Bowl IV.\n|-\n|colspan=\"6\"| † Denotes a Packers home game played in Milwaukee\n|-\n;|title=1970s (Vikings, 15–4–1)|Season||at Green Bay Packers |at Minnesota Vikings||Notes}}\n|-\n|\n| Tie 1–1\n| style=\"| Packers  13–10 †\n| style=\"| Vikings  10–3\n| Packers  12–8\n| As a result of the AFL–NFL merger, the Packers and Vikings are placed in the NFC Central (later renamed to the NFC North in the 2002 season).\n|-\n|\n| style=\"|\n| style=\"| Vikings  24–13\n| style=\"| Vikings  3–0\n| Packers  12–10\n|\n|-\n|\n| Tie 1–1\n| style=\"| Vikings  27–13\n| style=\"| Packers  23–7\n| Packers  13–11\n|\n|-\n|\n| style=\"|\n| style=\"| Vikings  31–7\n| style=\"| Vikings  11–3\n| Tie  13–13\n| Vikings lose Super Bowl VIII.\n|-\n|\n| Tie 1–1\n| style=\"| Vikings  32–17\n| style=\"| Packers  19–7\n| Tie  14–14\n| Vikings lose Super Bowl IX.\n|-\n|\n| style=\"|\n| style=\"| Vikings  28–17\n| style=\"| Vikings  24–3\n| Vikings  16–14\n|\n|-\n|\n| style=\"|\n| style=\"| Vikings  17–10 †\n| style=\"| Vikings  20–9\n| Vikings  18–14\n| Vikings lose Super Bowl XI.\n|-\n|\n| style=\"|\n| style=\"| Vikings  13–6\n| style=\"| Vikings  19–7\n| Vikings  20–14\n|\n|-\n|\n| style=\"|\n| Tie  10–10 (OT)\n| style=\"| Vikings  21–7\n| Vikings  21–14–1\n| Both teams finished with 8–7–1 records, but the Vikings clinched the NFC Central based on a better head-to-head record, eliminating the Packers from playoff contention.\n|-\n|\n| Tie 1–1\n| style=\"| Packers  19–7 †\n| style=\"| Vikings  27–21 (OT)\n| Vikings  22–15–1\n|\n|-\n|colspan=\"6\"| † Denotes a Packers home game played in Milwaukee\n|-\n;|title=1980s (Packers, 14–5)|Season||at Green Bay Packers |at Minnesota Vikings||Notes}}\n|-\n|\n| style=\"|\n| style=\"| Packers  16–3\n| style=\"| Packers  25–13\n| Vikings  22–17–1\n| Packers' first season series sweep against the Vikings since the 1965 season.\n|-\n|\n| Tie 1–1\n| style=\"| Vikings  30–13 †\n| style=\"| Packers  35–23\n| Vikings  23–18–1\n|\n|-\n|\n| style=\"|\n| style=\"| Packers  26–7 †\n| canceled\n| Vikings  23–19–1\n| Vikings open Hubert H. Humphrey Metrodome.Due to the 1982 NFL players strike, the game scheduled in Minnesota was canceled.\n|-\n|\n| Tie 1–1\n| style=\"| Vikings  20–17 (OT)\n| style=\"| Packers  29–21\n| Vikings  24–20–1\n|\n|-\n|\n| style=\"|\n| style=\"| Packers  45–17 †\n| style=\"| Packers  38–14\n| Vikings  24–22–1\n|\n|-\n|\n| style=\"|\n| style=\"| Packers  20–17 †\n| style=\"| Packers  27–17\n| Tie  24–24–1\n|\n|-\n|\n| style=\"|\n| style=\"| Vikings  32–6\n| style=\"| Vikings  42–7\n| Vikings  26–24–1\n| In Minnesota, the Vikings recorded their largest victory against the Packers with a 35–point differential and score their most points in a game against the Packers.\n|-\n|\n| style=\"|\n| style=\"| Packers  16–10 †\n| style=\"| Packers  23–16\n| Tie  26–26–1\n|\n|-\n|\n| style=\"|\n| style=\"| Packers  18–6\n| style=\"| Packers  34–14\n| Packers  28–26–1\n|\n|-\n|\n| Tie 1–1\n| style=\"| Packers  20–19 †\n| style=\"| Vikings  26–14\n| Packers  29–27–1\n| Vikings trade for RB Herschel Walker, who makes his debut in Minnesota.Both teams finished with 10–6 records, but the Vikings clinched the NFC Central based on a better division record, eliminating the Packers from playoff contention.\n|-\n|colspan=\"6\"| † Denotes a Packers home game played in Milwaukee\n|-\n;|title=1990s (Vikings, 12–8)|Season||at Green Bay Packers |at Minnesota Vikings||Notes}}\n|-\n|\n| Tie 1–1\n| style=\"| Packers  24–10 †\n| style=\"| Vikings  23–7\n| Packers  30–28–1\n|\n|-\n|\n| Tie 1–1\n| style=\"| Vikings  35–21\n| style=\"| Packers  27–7\n| Packers  31–29–1\n|\n|-\n|\n| style=\"|\n| style=\"| Vikings  23–20 (OT)\n| style=\"| Vikings  27–7\n| Tie  31–31–1\n| Packers trade for QB Brett Favre.Vikings eliminate the Packers from playoff contention with their win in Minnesota.\n|-\n|\n| style=\"|\n| style=\"| Vikings  21–17 †\n| style=\"| Vikings  15–13\n| Vikings  33–31–1\n| In Minnesota, Vikings' K Fuad Reveiz kicked five field goals, including the game-winner.Final season both teams faced off at Milwaukee County Stadium in Milwaukee.Both teams finished with 9–7 records, but the Vikings clinched the better playoff seed based on their head-to-head sweep.\n|-\n|\n| Tie 1–1\n| style=\"| Packers  16–10\n| style=\"| Vikings  13–10 (OT)\n| Vikings  34–32–1\n|\n|-\n|\n| Tie 1–1\n| style=\"| Packers  38–21\n| style=\"| Vikings  27–24\n| Vikings  35–33–1\n|\n|-\n|\n| Tie 1–1\n| style=\"| Packers  38–10\n| style=\"| Vikings  30–21\n| Vikings  36–34–1\n| Packers win Super Bowl XXXI.\n|-\n|\n| style=\"|\n| style=\"| Packers  38–32\n| style=\"| Packers  27–11\n| Tie  36–36–1\n| Packers lose Super Bowl XXXII.\n|-\n|\n| style=\"|\n| style=\"| Vikings  37–24\n| style=\"| Vikings  28–14\n| Vikings  38–36–1\n| In Green Bay, the Vikings' win snapped the Packers' 25-game home winning streak in the regular season and 29-game home winning streak total, including playoffs, an NFL record.\n|-\n|\n| Tie 1–1\n| style=\"| Packers  23–20\n| style=\"| Vikings  24–20\n| Vikings  39–37–1\n|\n|-\n|colspan=\"6\"| † Denotes a Packers home game played in Milwaukee\n|-\n;|title=2000s (Packers, 12–9)|Season||at Green Bay Packers|at Minnesota Vikings ||Notes}}\n|-\n|\n| style=\"|\n| style=\"| Packers  26–20 (OT)\n| style=\"| Packers  33–28\n| Tie  39–39–1\n| In Green Bay, Packers win following Packers' WR Antonio Freeman's rolling catch off his shoulder and run in for a touchdown in overtime, prompting commentator Al Michaels to famously say, \"he did WHAT?!\"\n|-\n|\n| Tie 1–1\n| style=\"| Packers  24–13\n| style=\"| Vikings  35–13\n| Tie  40–40–1\n|\n|-\n|\n| Tie 1–1\n| style=\"| Packers  26–22\n| style=\"| Vikings  31–21\n| Tie  41–41–1\n|\n|-\n|\n| Tie 1–1\n| style=\"| Vikings  30–25\n| style=\"| Packers  30–27\n| Tie  42–42–1\n|\n|-\n|\n| style=\"|\n| style=\"| Packers  34–31\n| style=\"| Packers  34–31\n| Packers  44–42–1\n|\n|- style=\"font-weight:bold;background:#f2f2f2;\"\n| 2004 Playoffs\n| style=\"|\n| style=\"| Vikings  31–17\n|\n| Packers  44–43–1\n| NFC Wild Card Round.\n|-\n|\n| style=\"|\n| style=\"| Vikings  20–17\n| style=\"| Vikings  23–20\n| Vikings  45–44–1\n| Packers draft QB Aaron Rodgers.\n|-\n|\n| style=\"|\n| style=\"| Packers  9–7\n| style=\"| Packers  23–17\n| Packers  46–45–1\n|\n|-\n|\n| style=\"|\n| style=\"| Packers  34–0\n| style=\"| Packers  23–16\n| Packers  48–45–1\n| In Minnesota, Packers' QB Brett Favre breaks Dolphins' QB Dan Marino's record for most career touchdown passes following a 16-yard touchdown pass to Packers' WR Greg Jennings.Last season for Brett Favre as a Packers quarterback.\n|-\n|\n| Tie 1–1\n| style=\"| Packers  24–19\n| style=\"| Vikings  28–27\n| Packers  49–46–1\n| Packers' QB Aaron Rodgers makes his first career start in Green Bay.Vikings' win after Packers' K Mason Crosby missed a potential game-winning 52-yard field goal in the game's final seconds.\n|-\n|\n| style=\"|\n| style=\"| Vikings  38–26\n| style=\"| Vikings  30–23\n| Packers  49–48–1\n| Vikings sign former Packers QB Brett Favre.\n|-\n;|title=2010s (Packers, 13–6–2)|Season||at Green Bay Packers|at Minnesota Vikings||Notes}}\n|-\n|\n| style=\"|\n| style=\"| Packers  28–24\n| style=\"| Packers  31–3\n| Packers  51–48–1\n| Final season for Brett Favre.Packers win Super Bowl XLV.\n|-\n|\n| style=\"|\n| style=\"| Packers  45–7\n| style=\"| Packers  33–27\n| Packers  53–48–1\n| In Green Bay, the Packers recorded their largest victory against the Vikings with a 38–point differential.\n|-\n|\n| Tie 1–1\n| style=\"| Packers  23–14\n| style=\"| Vikings  37–34\n| Packers  54–49–1\n| Vikings clinch the final playoff spot and deny the Packers a first-round bye, setting up a playoff rematch at Green Bay the following week.\n|- style=\"font-weight:bold;background:#f2f2f2;\"\n| 2012 Playoffs\n| style=\"|\n| style=\"| Packers  24–10\n|\n| Packers  55–49–1\n| NFC Wild Card Round.\n|-\n|\n| style=\"|\n| Tie\n| style=\"| Packers  44–31\n| Packers  56–49–2\n| In Green Bay, the tie game marked the first NFL game to end in a tie under the new overtime format, where both teams scored a field goal in overtime.\n|-\n|\n| style=\"|\n| style=\"| Packers  42–10\n| style=\"| Packers  24–21\n| Packers  58–49–2\n|\n|-\n|\n| Tie 1–1\n| style=\"| Vikings  20–13\n| style=\"| Packers  30–13\n| Packers  59–50–2\n| Vikings clinched the NFC North with their win in Green Bay.\n|-\n|\n| Tie 1–1\n| style=\"| Packers  38–25\n| style=\"| Vikings  17–14\n| Packers  60–51–2\n| Vikings open U.S. Bank Stadium, with their game against the Packers being their inaugural game at the new stadium. Packers eliminated the Vikings from playoff contention with their win.\n|-\n|\n| style=\"|\n| style=\"| Vikings  16–0\n| style=\"| Vikings  23–10\n| Packers  60–53–2\n| In Minnesota, Vikings' LB Anthony Barr delivered a hit to Packers' QB Aaron Rodgers, which resulted in Rodgers suffering a broken collarbone and missing nine games. Following the incident, Rodgers alleged that Barr gave him \"the finger' and told him to \"suck it\". The hit prompted the introduction of a new rule aimed at penalizing similar hits with a roughing the passer penalty. Vikings sweep Packers for the first time since 2009.\n|-\n|\n| style=\"|\n| Tie\n| style=\"| Vikings  24–17\n| Packers  60–54–3\n|\n|-\n|\n| style=\"|\n| style=\"| Packers  21–16\n| style=\"| Packers  23–10\n| Packers  62–54–3\n| Packers clinched the NFC North with their win in Minnesota.\n|-\n;|title=2020s (Vikings, 6–4)|Season||at Green Bay Packers |at Minnesota Vikings||Notes}}\n|-\n|\n|\n| style=\"| Vikings  28–22\n| style=\"| Packers  43–34\n| Packers  63–55–3\n| Game in Minnesota is the highest-scoring game in the rivalry (77 points).\n|-\n|\n|\n| style=\"| Packers  37–10\n| style=\"| Vikings  34–31\n| Packers  64–56–3\n| Packers eliminated the Vikings from playoff contention with their win.\n|-\n|\n|\n| style=\"| Packers  41–17\n| style=\"| Vikings  23–7\n| Packers  65–57–3\n| Game in Green Bay was Aaron Rodgers' final win as a Packers' quarterback.\n|-\n|\n|\n| style=\"| Vikings  24–10\n| style=\"| Packers  33−10\n| Packers  66–58–3\n|\n|-\n|\n| style=\"|\n| style=\"| Vikings  31–29\n| style=\"| Vikings  27–25\n| Packers  66–60–3\n| Vikings clinched a playoff berth following the Packers' Week 15 win against the Seahawks.\n|-\n|\n|\n| November 23\n| January 3/4\n| Packers  66–60–3\n|\n|-\n;|title=Summary of results|Season|Season series|at Green Bay Packers|at Minnesota Vikings|Notes}}\n|-\n| Regular season\n| style=\"|\n|\n|\n|\n|-\n| Postseason\n| Tie 1–1\n| Tie 1–1\n| no games\n| NFC Wild Card: 2004, 2012\n|-\n| Regular and postseason\n| style=\"|\n|\n|\n| Packers have a 9–6 home record at Milwaukee County Stadium in Milwaukee and currently have a 26–22–3 home record at Lambeau Field in Green Bay.\n|-\nPlayers that played for both teams\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! Name\n! Position(s)\n!style=\"\"| Years with Packers\n!style=\"\"| Years with Vikings\n|-\n|Carroll Dale\n|WR\n|1965–1972\n|1973\n|-\n|Paul Coffman\n|TE\n|1978–1985\n|1988\n|-\n|Jan Stenerud\n|K\n|1980–1983\n|1984–1985\n|-\n|Bucky Scribner\n|P\n|1983–1984\n|1987–1989\n|-\n|Mossy Cade\n|DB\n|1985–1986\n|1988\n|-\n|Bryce Paup\n|LB\n|1990–1994\n|2000\n|-\n|Brett Favre\n|QB\n|1992–2007\n|2009–2010\n|-\n|Jeff Brady\n|LB\n|1992\n|1995–1997\n|-\n|Gilbert Brown\n|DT\n|1993–1999, 2001–2003\n|1993\n|-\n|Darren Sharper\n|DB\n|1997–2004\n|2005–2008\n|-\n|Ryan Longwell\n|K\n|1997–2005\n|2006–2011\n|-\n|Robert Ferguson\n|WR\n|2001–2007\n|2007–2008\n|-\n|Koren Robinson\n|WR\n|2006–2007\n|2005\n|-\n|Greg Jennings\n|WR\n|2006–2012\n|2013–2014\n|-\n|Desmond Bishop\n|LB\n|2007–2013\n|2013–2014\n|-\n|Letroy Guion\n|DT\n|2014–2016\n|2008–2013\n|-\n|Brandon Bostick\n|TE\n|2012–2014\n|2015\n|-\n|DuJuan Harris\n|RB\n|2012–2014\n|2015\n|-\n|Datone Jones\n|DE\n|2013–2017\n|2017\n|-\n|Dean Lowry\n|DE\n|2016–2022\n|2023\n|-\n|Aaron Jones\n|RB\n|2017–2023\n|2024–present\n|-\n|Eric Wilson\n|LB\n|2022–2024\n|2017–2020, 2025–present\n|-\n|Robert Tonyan\n|TE\n|2018–2022\n|2024\n|-\n|Chandon Sullivan\n|DB\n|2019–2021\n|2022\n|-\n|Za'Darius Smith\n|LB\n|2019–2021\n|2022\n|}\nSee also\n*List of NFL rivalries\n*NFC North\n*Minnesota–Wisconsin football rivalry\nReferences"
    }
  ]
}