{
  "content": [
    {
      "type": "text",
      "text": "# Padein Prince rebellion\n\nOn 2 August 1866, following the assassination of Crown Prince Kanaung during the Myingun Myinkhondaing rebellion, his eldest son Padein Prince fled to Shwebo—the ancestral seat of the Konbaung dynasty—amid growing unrest and political agitation, reportedly influenced by the Sacaterios of Crown Prince U Thin. He was accompanied by several supporters and fellow princes. Before departing for Shwebo, Padein Prince visited the industrial zone established by his late father. Together with his half-brothers—Prince Kyaymyin, Prince Taingda, and Prince Taung Pone—he was reported to have incited laborers to join the rebellion. The group subsequently proceeded to Shwebo, where they launched the uprising later known as the Padein Prince rebellion. It was among the most serious insurrections faced by the Konbaung dynasty and nearly brought an end to King Mindon's reign.\nBackground\nPadein Prince viewed the assassination of his father, Crown Prince Kanaung, as an indication that King Mindon supported or encouraged the ambitions of the Myingun and Myinkhondaing princes. Some believed that the king had a hidden agenda tied to the Myingun-Myinkhondaing rebellion. Another factor fueling Padein Prince's discontent was that Kanaung had been officially named Crown Prince, positioning Padein as the likely heir to the throne. Had Kanaung become king, Padein Prince would have inherited the right to succeed him. However, with Kanaung's death, Padein Prince's claim to the throne was lost. Consequently, he rose in rebellion against King Mindon.\nSeveral royal family members were involved in the rebellion led by the Padein Prince, most of whom were sons of Crown Prince Kanaung. These included the Kyaumyin Prince, Taingda Prince, Taungsin Prince, Taungpon Prince, Ywathar Prince, and Tuyun Daing Prince. Princess Yan Aung Myin later joined the rebellion as well.\nRebellion\nPadein Prince chose to march on Shwebo against King Mindon for several strategic reasons. Historically, Shwebo held great significance—it was the victorious stronghold of King Alaungpaya and the former fiefdom of his father, Crown Prince Kanaung, ensuring strong local support. It was also the place where King Mindon and Kanaung had once assembled their forces before successfully rebelling against King Pagan. By establishing his base there, Padein Prince quickly strengthened his rebel army with both manpower and weapons, especially as King Mindon's royal forces were still weakened by the recent Myingun Myinkhondaing rebellion. Although King Mindon attempted to negotiate by offering a full pardon and the restoration of Padein's titles if he returned to the capital, the prince—confident in his growing military strength—rejected the offer. Believing that swift action would secure victory, he launched an ambitious march toward the capital in an attempt to seize the throne by force. In response, royal authorities arrested members of their extended family who remained in the capital.\nAt that critical moment, King Mindon appeared to lack the resolve and strength to decisively confront the rebel forces. Rumors circulated that he was contemplating abdication in favor of Padein Prince. However, his chief queen, Setkya Dewi, along with other royal consorts, strongly opposed such a move. According to court accounts, the king consulted Setkya Dewi regarding the possibility of abdication, but she refused to accept the prospect of disgrace or deposition. She firmly declared, \"A king does not surrender his sacred duty. To abandon the throne is to betray our ancestors and invite chaos. Stand firm—for surrender would tarnish your honor far worse than any battlefield defeat.\" Her unwavering conviction rekindled the king's spirit, transforming his hesitation into renewed determination to defend the throne. Reinforced by her words, King Mindon resolved to suppress the rebellion. He convened a council with his royal sons and ordered a counteroffensive. Princes Mekkhaya, Nyaungyan, and Thonze were appointed to lead the royal army against the insurgent forces.\nIn the ensuing battle, the royal army mounted a determined and sustained defense, gradually weakening the forces of Padein Prince. As the conflict continued, the rebel troops faced critical shortages of gunpowder, weapons, and supplies, rendering them unable to maintain their resistance. Acknowledging the deteriorating situation, Padein Prince ordered a retreat along the Irrawaddy River toward Kyaukmyaung. The royal forces, under the command of Nyaungyan Prince, pursued the rebels and launched an assault on Kyaukmyaung. Padein Prince, his younger brother Taingda Prince, and their associates were captured on 6 October and subsequently detained in the royal capital.\nWhile imprisoned in 1867, Padein Prince and several younger princes were accused by court ministers of plotting a renewed rebellion, allegedly in collaboration with their younger sister, Princess Yan Aung Myin. In response to concerns over potential unrest, the Hluttaw (royal council) issued an order for their execution. News of the executions reached King Mindon shortly after they had been carried out. Reportedly moved by compassion and unwilling to impose further punishment on his nephews, the king issued a royal pardon. However, by the time the order arrived, Padein Prince had already been executed. His younger brother, Taingda Prince, and the remaining princes were spared and granted clemency.\nReferences"
    }
  ]
}