{
  "content": [
    {
      "type": "text",
      "text": "# Padfield v Minister of Agriculture\n\n| prior actions =\n| subsequent actions =\n| opinions =  A minister's discretion to refuse an investigation was subject to judicial review where a refusal would frustrate the policy of an Act.\n| transcripts =\n| keywords = Judicial review\n}}\nPadfield v Minister of Agriculture, Fisheries and Food [1968] [http://www.bailii.org/uk/cases/UKHL/1968/1.html UKHL 1] is a United Kingdom administrative law case, concerning judicial review.\nFacts\nPadfield and other milk producers in the South East Region argued they should get more milk subsidies to reflect growing transport costs, and applied to court to compel the minister to appoint an investigation.\nThe Agricultural Marketing Act 1958 section 19 said a committee of the Milk Marketing Board can investigate \"if the Minister so directs\" after a complaint on a scheme's operation if it cannot be considered by a consumers' committee (subsection 3(b)), and if it reports a scheme is \"contrary to the interests of consumers of the regulated products\" or \"any persons affected by the scheme\" and is \"not in the public interest\" the minister can amend the scheme, revoke it or direct the board to rectify it (subsection 6).\nThere were eleven milk regions with different prices for milk, fixed depending on costs of transporting milk from producers to consumers. All milk producers had to sell their milk to the Milk Marketing Board. Differentials had been fixed a few years earlier and transport costs had changed.\nThe SE region argued the difference between it and the Far Western Region should be altered: this would incidentally affect other regions. Board members were elected by individual regions, so it was impossible for SE producers to get a majority for their proposals.\nThey asked the Minister of Agriculture, Fisheries and Food (Fred Peart) to appoint a committee of investigation, but he refused. They requested mandamus (specifically, a court order requiring the Minister to appoint the Committee).\nJudgment\nCourt of Appeal\nDiplock LJ and Russell LJ held the minister's discretion could not be challenged. Lord Denning MR dissented.\nHouse of Lords\nThe House of Lords, reversing the Court of Appeal, held that a minister's discretion to refuse an investigation was subject to judicial review where a refusal would frustrate the policy of an Act. An order should be made to direct the minister to consider the complaint.\nLord Reid said:\nLord Upjohn said that if the minister\nLord Morris of Borth-y-Gest dissented.\nSee also\n*United Kingdom constitutional law\nNotes\nExternal links\n* [https://davidallengreen.com/2019/09/brexit-padfield-and-the-benn-act/ \"Brexit, Padfield, and the Benn Act\"], blog post by David Allen Green on the decision's relevance in the lead-up to Brexit."
    }
  ]
}