{
  "content": [
    {
      "type": "text",
      "text": "# Paget, Queensland\n\n| pop                 = 339\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4740\n| area                = 14.1\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 5.6\n| dir1                = SSE\n| location1           = Mackay CBD\n| dist2               = 332\n| dir2                = NNW\n| location2           = Rockhampton\n| dist3               = 392\n| dir3                = SE\n| location3           = Townsville\n| dist4               = 971\n| dir4                = NNW\n| location4           = Brisbane\n| lga                 = Mackay Region\n| stategov            = Mirani\n| stategov2           = Mackay\n| fedgov              = Dawson\n| near-n              = South Mackay\n| near-ne             = Coral Sea\n| near-e              = Coral Sea\n| near-se             = McEwens Beach\n| near-s              = Bakers Creek\n| near-sw             = Bakers Creek\n| near-w              = Ooralea\n| near-nw             = West Mackay\n}}\nPaget is a coastal suburb of Mackay in the Mackay Region, Queensland, Australia. In the , Paget had a population of 339 people.\nGeography\nPaget is bounded to the east by the Coral Sea, to the west by the Bruce Highway, and to the south by Bakers Creek. The suburb is principally used for industrial purposes. The North Coast railway line passes from south to north through the suburb with the Mackay railway station located in Paget ().\nThe land is flat and low-lying (below 10 metres above sea level). The western part of the suburb is principally used for industrial purposes where there is good road and rail access while the eastern oceanside part of the suburb is much less developed. Paget Junction railway station to the north of Mackay railway station () was the junction of the North Coast railway line with the now-closed Mackay railway line.\nThe Bakers Creek Conservation Park occupies the south-east headland created by Bakers Creek entering into the Coral Sea. It is a protected area due to the need to preserve the shorebird habitat consisting of intertidal zones and mangroves; it has been declared a nationally important area for shorebirds. It has a population of the vulnerable species Eracus neglectus (beach stone-curlew). It is considered of internationally significant for migrating shorebirds such as the Charadrius mongolus (lesser sand plover), Numenius madagascariensis (eastern curlew), Calidris tenuirostris (great knot) and Haematopus fuliginosus (sooty oystercatcher).\nHistory\nThe suburb takes its name from the Paget Junction railway station, which, in turn, was named by Queensland Railways Department on 30 October 1913, in honour of politician Walter Trueman Paget who was the Secretary for Railways 1908 to 1915. In 1943, Paget Junction was shortened to Paget.\nMackay Ambulance Station was at on the corner of Alfred Street and Sydney Street in the Mackay CBD until 2006, when it was relocated to Paget.\nDemographics\nIn the , Paget had a population of 273 people.\nIn the , Paget had a population of 339 people.\nEducation\nThere are no schools in Paget. The nearest government primary schools are Mackay West State School in neighbouring West Mackay to the north and Dundula State School in neighbouring Bakers Creek to the south. The nearest government secondary school is Mackay State High School in South Mackay to the north.\nFacilities\nMackay Ambulance Station is at 3 Transport Avenue ().\nPaget Waste Transfer Station & Recycling Centre is at 42 Crichtons Rd ().\nPaget Telephone Exchange is at 89 Broadsound Road ().\nAmenities\nLeprechaun Park is a sports centre at 435 Milton Street (). It is the home ground for Mackay's Brothers Rugby League Club.\nReferences"
    }
  ]
}