{
  "content": [
    {
      "type": "text",
      "text": "# Pagórki, Warmian-Masurian Voivodeship__disambig_1\n\n| subdivision_type1 = Voivodeship\n| subdivision_name1 = Warmian-Masurian\n| subdivision_type2 = County\n| subdivision_name2 = Elbląg\n| subdivision_type3 = Gmina\n| subdivision_name3 = Tolkmicko\n| coordinates =\n| pushpin_map = Poland\n| pushpin_label_position = bottom\n| elevation_m =\n| population_total =\n| website =\n}}\nPagórki  is a village in the administrative district of Gmina Tolkmicko, within Elbląg County, Warmian-Masurian Voivodeship, in northern Poland. It lies approximately  south of Tolkmicko,  north of Elbląg, and  north-west of the regional capital Olsztyn.\nHistory\nin 1899.]]\nRehberg originated as a settlement in the course of the German colonisation of the East on the territory of the Teutonic Order. It is not known when the village was founded. It is most likely that the Grand Master Dietrich von Grüningen donated the 40 hectares of Rehberg area to the Holy Spirit Hospital in Elbing in May 1255. The hospital must have founded a settlement there. In 1347, Rehberg was mentioned as a village for the first time in a document of the Elbing commander Alexander von Kornre. It probably received its name from the forest area Rehberge (= germ. \"Deer Mountains\") in which it was situated. In 1432, the Order gave the village together with the Rehberge area to the provincial knight Hans von Baysen, the Holy Spirit Hospital was compensated with other lands. Rehberg thus became a knight's estate. (German). In 1905 the village had 95 inhabitants.\nAfter the defeat of the Teutonic Order, Rehberg came under the sovereignty of the Polish crown between 1466 and 1772 as part of Royal Prussia, and between 1772 and 1945 it belonged to the Prussian province of West Prussia, consequently to the German Empire since 1871. From about 1772 the village had its own school. It was closed in 1823, and the children were assigned to the school in Cadinen, but they almost did not show up because of the large distance and often impassable roads. Until 1945, the Lutheran Rehberg belonged to the parish of Tolkemit.\nAfter World War II, the German population was expelled from Rehberg and the village was renamed Pagórki. In today's Pagórki there still exists a stately arcaded house from the early 19th century with four arcades and a hipped roof. In addition, there is the \"Kaiserstein\" (Emperor's Stone), a monument commemorating a visit by Kaiser Wilhelm II. Construction of a village community centre began in spring 2013 and was completed at the end of the same year.\nReferences"
    }
  ]
}