{
  "content": [
    {
      "type": "text",
      "text": "# Paisley War Memorial\n\nPaisley War Memorial, also known as Paisley Cenotaph, is a war memorial in at the centre of Paisley, Renfrewshire, Scotland.  It was unveiled in 1924, became a Category B listed building in 1980, and was upgraded to Category A in 1997.\nThe memorial was commissioned after the First World War, following an open competition which attracted 195 entries.  A public subscription raised funding of £14,000 to build the memorial.\nIt comprises a bronze equestrian sculptural group on a  high rectangular stone plinth.  The plinth rises on four steps from a stone platform with a retaining wall on three sides, open to the west.  The structure was designed by the architect Sir Robert Lorimer, and constructed by Neil McLeod & Sons Limited with stone carving by Allen & Sons, using about 200 tons of grey granite imported from Shap Fell in Cumbria.\nThe bronze sculpture group stop the plinth, about  high and weighing about 4.5 tons, was designed by Alice Meredith Williams and cast by JW Singer & Sons.  Williams had given her competition entry the title \"The Spirit of the Crusaders\": a model created for the competition is held by the National Museum of Wales in Cardiff.   It depicts a medieval knight in armour mounted on a horse, accompanied by four infantry soldiers in First World War battledress, with muddy boots, greatcoats, and helmets.  The knight carries a shield and pennant bearing the St Andrew's saltire for Scotland.\nThe arms of the burgh of Paisley, of St Andrew, and of St George, are carved into the front (south) and rear (north) faces of the plinth, and bronze plaques are mounted on the east and west faces.  Towards the bottom of the south face of the plinth, the stone bears an inscription which reads \"TO THE GLORIOUS MEMORY/ OF THE 1,953 MEN OF PAISLEY/ WHO GAVE THEIR LIVES ON LAND/ AND SEA IN THE GREAT WAR\".  After the Second World War, a further inscription as added \"AND IN GRATEFUL REMEMBRANCE OF THE/ MEN AND WOMEN OF THIS BURGH WHO/ GAVE THEIR LIVES FOR THEIR COUNTRY/ IN THE WORLD WAR 1939-1945\".\nThe memorial was unveiled on 27 July 1924, before a crowd of 20,000 people, by Mrs Macnab, a widow who lost three sons in the Great War.  Prayers were led by Rev. Dr A M MacLean, of Paisley Abbey, accompanied by the Provost Glover and the former Provost John Robertson who was chairman of the War Memorial Committee.\nAfter this memorial, Williams collaborated with Lorimer on sculptures for the Scottish National War Memorial in Edinburgh.\nFile:Paisley War Memorial - geograph.org.uk - 411180.jpg|West and south faces\nFile:War memorial, Paisley - geograph.org.uk - 43211.jpg|Memorial from the south\nFile:Paisley War Memorial (geograph 4665151).jpg|Detail of the sculptural group\nReferences\n* [https://canmore.org.uk/site/183279/paisley-the-cross-war-memorial Paisley, The Cross, War Memorial], Canmore, Historic Environment Scotland\n* [https://www.paisley.org.uk/paisley-history/paisley-cenotaph/ Paisley Cenotaph], paisley.org.uk\n* [https://www.warmemorialsonline.org.uk/memorial/95311 Paisley], War Memorials Online\n* [https://www.iwm.org.uk/memorials/item/memorial/28974 Paisley], War Memorials Register, Imperial War Museums\n* [https://player.bfi.org.uk/free/film/watch-unveiling-of-paisley-war-memorial-1924-online Unveiling of Paisley War Memorial],  British Film Institute\n* [http://www.roll-of-honour.com/Renfrewshire/Paisley.html Paisley War Memorial], roll-of-honour.com\n* [https://artuk.org/discover/artworks/paisley-cenotaph-301796 Paisley Cenotaph], ArtUK\n* [https://victorianweb.org/sculpture/warmonuments/24.html Spirit of the Crusades], The Victorian Web\n* [https://museum.wales/art/online/?action=show_item&item=1961 Spirit of the Crusades], museum.wales\n* [https://www.thehistorypress.co.uk/articles/the-art-of-remembering-the-wwi-memorials-of-morris-alice-meredith-williams/ The art of remembering: The WWI memorials of Morris & Alice Meredith Williams], thehistorypress.co.uk"
    }
  ]
}