{
  "content": [
    {
      "type": "text",
      "text": "# Paiute War\n\n|combatant1  =\n|combatant2  = PaiuteShoshoneBannock\n|commander1  =  William Ormsby John C. Hays Joseph Stewart\n|commander2  = Numaga\n|strength1   = 207 cavalry649 militia\n|strength2   = ~500 warriors\n|casualties1 = 85 killed about 34 wounded\n|casualties2 = 31 killed about 30 wounded\n}}\nThe Paiute War, also known as the Pyramid Lake War, Washoe Indian War and the Pah Ute War, was an armed conflict between Northern Paiutes allied with the Shoshone and the Bannock against settlers from the United States, supported by military forces. It took place in May 1860 in the vicinity of Pyramid Lake in the Utah Territory, now in the northwest corner of present-day Nevada. The war was preceded by a series of increasingly violent incidents, culminating in two pitched battles in which 79 Whites and 25 Indigenous people were killed.  Smaller raids and skirmishes continued until a cease-fire was agreed to in August 1860; there was no treaty.\nBackground\nEarly settlement of what is now northwestern Nevada had a disruptive effect on the Northern Paiute and Shoshone. The Shoshone and Paiute had subsisted on the sparse resources of the desert by hunting deer and rabbit and eating grasshoppers, rodents, seeds, nuts, berries, and roots. Miners felled single-leaf pinyon groves, a major food source for the Paiute, and because of the Nevada deserts, settlers grouped around water sources. Settlers' livestock trampled or ate the sparse vegetation. In addition, settlers and Paiutes competed for grazing lands, where the settlers tried to run cattle. Native Americans partly adapted to the change by trading finely woven baskets, deer, and rabbit skins for food and goods. Other times, settlers gave them food or blankets. Some Native Americans took jobs farming for settlers or served as stock tenders on Pony Express stations. Nonetheless, they resented the encroachment into their territory. Chief Numaga traveled to Virginia City and aired the grievances of the Paiutes. Herders had driven cattle all over Paiute grazing land, letting their livestock eat grass used by Paiute ponies. Worst, he claimed, these cattlemen threatened violence if Chief Numaga did not return cattle they claimed as missing from their herds. Cattlemen told William Weatherlow, a local militia captain, that Numaga and the Native Americans were extorting two cattle a week from them.\n1857: Raids in the north, harbingers of war\nIn 1857, Major William Ormsby (who later died in the First Battle of Pyramid Lake) and a man known as \"Smith\" were agents for the overland stagecoach. On October 5, 1857, Ormsby sent an express letter for ammunition to be ready for an emergency, foreseeing conflict with the Washoe people due to murders and robberies. Ormsby then allied with the Paiutes, who had been in conflict with the Washoe for some time. With 20–30 settlers and 300–400 Paiutes, Ormsby went in pursuit of the Washoes and Little Indians into the Carson Valley.\n1858: Treaty with the Paiute\nBy 1858 the Native Americans  and Whites agreed to a treaty with the principle of equal justice for all. Thieves and killers, white or Native, were to be turned over to the authorities. Thereafter, Paiutes under Numaga fought alongside Whites against raiding parties of Pit River Natives from across the Sierra Nevada. For the next two years, the Paiutes and Whites lived in relative peace. However, the winter of 1858 was especially harsh, making it impossible to get provisions or people over the Sierra Nevada. Food became scarce, forcing residents to hunt for wild game.\n1859: Winter starvation\nWith the arrival of spring in 1859, what was later known as the Comstock Lode was made public and sparked a rush of silver prospectors to the area. However, tensions had already been mounting since the first rush of silver miners had come across the Sierra Nevada. With the influx of so many people, many Natives believed that an evil spirit had been angered and was sending storms to freeze and starve them. The Carson City newspaper Territorial Enterprise reported in December 1859 that Whites were doing all they could to alleviate the starving Natives, offering them bread and provisions. However, the Natives refused to eat, fearing that the food was poisoned.\nSpring 1860\nTreaty broken\nOn January 13, 1860, Dexter Demming was murdered and his home was raided. Territorial Governor Isaac Roop sent Captain William Weatherlow to ascertain whether Paiute or Pit River Indians were responsible. After catching up with the raiding party it was ascertained that the raiders were part of the Smoke Creek Sam (Chief Saaba) band of Paiutes—a band that had broken off from Numaga and Winnemucca (aka Chief Truckee). The Whites began to demand revenge. A meeting was held in Susanville with Governor Roop and Captain Weatherlow. The governor directed Weatherlow and Thomas Harvey to meet Numaga at Pyramid Lake and ask him about the murders and to honor the treaty and turn over the killers.\nWhile traveling to Pyramid Lake, the two settlers were captured by Paiutes of the Smoke Creek Sam band. When the warriors wanted to kill them, one warrior known as \"Pike\" (who had lived in Harvey's home as a child) intervened for Harvey, who was allowed to leave. Pike was also eventually able to convince the band to release Weatherlow. The two men finally arrived at Chief Numaga's camp, where the Chief refused to admit or deny that his people had killed Dexter Demming. Weatherlow pressed the chief to follow the treaty, and Numaga finally stated he would not intervene if his people committed depredations against settlers, would refuse to come back to the city to resolve anything peacefully, and, aware of the recent silver discoveries, demanded $16,000 for the grazing land.\nWeatherlow and Harvey left the meeting warning the cattlemen on their journey home of the impending crisis. The men informed them that Chief Numaga was blackmailing them by requiring they turn over two cows a week to them, which they had been doing.\nPlans for war\nAfter returning, Weatherlow warned that all out war was inevitable. The local population, however, started to doubt the Paiutes were really to blame, because although Dexter Demming had been killed, it became known that his brother Jack had once killed a Native, and persons seeking revenge might have mistaken the two men. However, on February 12, 1860, Governor Roop wrote to Brevet Brigadier General Newman S. Clarke, commander of the Department of the Pacific, stating that the Honey Lake Valley was in danger of Paiute attack. He asked for arms, ammunition, and a platoon of men to drive the Paiutes from their strongholds.\nDuring March and April, the Natives gathered at Pyramid Lake to determine whether to drive the Whites out. While a majority of the men voted for war, without a unanimous decision they were forced to postpone their plans. Chief Numaga had voted against war. As Numaga debated whether to go to war, two Paiute children went missing, and what was later known as the Williams Station massacre unfolded into war.\nWar\nWilliams Station massacre\nWilliams Station was a combination saloon, general store and stagecoach station on the Carson River at present-day Lahontan Reservoir. On May 6, a raiding party led by mixed-race Bannock warrior Mogoannoga attacked the station, killing five Americans and burning down the establishment. There are conflicting accounts as to the party's motivation. One account claimed the raid was made without cause by a renegade band from the north. Another account, given by a Paiute member in an 1880 interview, claimed the incident originated when two proprietors of Williams Station deceived a young Native, persuading him to trade his pony for a bad gun, and captured two Paiute children. In an argument to back out of the deal, the settlers' dog bit the boy, and the men laughed at him. The young Native then reported to the tribe how he had heard two missing Paiute children in the settlers' root cellar. When a Paiute party found the settlers at Williams Station, they claimed the boy only heard the dog yelp and not any missing children. Ultimately, the party killed the men and found the two children tied up. In their rage, they murdered all the Whites in the area and left. When Williams, owner of the station, returned on May 8, he found his two brothers' bodies mutilated and three patrons of the saloon murdered. Passions were aroused, and stories escalated to include tales of 500 Indians who killed every person in the vicinity of Williams Station. A third account claimed the kidnapped children were two 12-year-old girls who were sexually assaulted before being hidden. According to this account, the band who attacked Williams Station was a rescue party that included the girls' father. When the news of the situation reached Numaga, he allegedly said, \"There is no longer any use for counsel; we must prepare for war.\"\nMilitia forms\nA militia was quickly formed from volunteers in Virginia City, Silver City, Carson City, and Genoa to apprehend the marauders. The volunteer force consisted of about 105 men and Major William Ormsby, who was chosen to lead the group. They did not believe that the Indians would fight back. The groups were individually led as follows:\n* Genoa Rangers – Captain F. F. Condon\n* Carson City Rangers – Major William Ormsby\n* Silver City Guards – Captain R. G. Watkins\n* 1st Virginia City Company – Captain F. Johnston\n* 2nd Virginia City Company – Captain Archie McDonald\nEach group of riders constituted no more than an undisciplined, leaderless mob of more than one hundred poorly armed riders with few rifles between them. One man in the group, Samuel Buckland, later stated the men were full of whiskey and without discipline. While Ormsby assumed a leadership position as being the first to arrive at the station, the five different groups never selected an overall commander and were disorganized in battle.\nThe Carson City Rangers arrived first at the ruins of Williams Station, stopping to rest and wait for the other volunteer groups. All the men met at the Williams Station to bury the dead and gather and stay the night. That night, Judge John Cradlebaugh of the Carson City Rangers told his men that he did not come to wage a war to defend white civilization, but rather to protect threatened communities. He advised his men that the Williams brothers had a bad reputation for shady dealings with both Whites and Natives, and that the Natives probably had a good reason for their attack. Come morning, he, his men, and a few others from the other groups, returned to Carson City. The remaining men proceeded north to the Truckee River, and then along that river towards Pyramid Lake. They noticed that the path left by the Natives to follow was obvious. Articles from the shop were laid out like a trail and tracks of unshod Native ponies were visible.\nFirst Battle of Pyramid Lake\nOn May 12, the Whites were attacked and routed by Paiute forces under the command of Chief Numaga, approximately five miles south of Pyramid Lake. The party first encountered a small band of Paiutes, whom they attacked. The band fled after returning a few shots, continuing to fire sporadically as they retreated into a ravine with the Whites in pursuit. Once in the ravine, a larger group of Natives appeared, closing the escape route and firing on the settlers from all sides. The Whites were poorly armed, badly mounted, and almost completely unorganized. The survivors escaped into a patch of woods and were pursued for some 20 miles. Seventy-six settlers were dead, including Ormsby, and many of the others were wounded. According to History of Nevada, three Natives were killed in the battle. Paiute Johnny Calico, who was 12 at the time, told a historian in 1924 that only three were injured and no one died.\nNatives interviewed in 1880 for historian Angel Myron's History of Nevada reported that the Whites panicked when the assault began and threw down their guns, surrendering, but instead were killed. Among them was Major Ormsby.\nOrganization of U.S. forces\nIn response to the First Battle of Pyramid Lake, settlers called upon Texas Ranger Colonel John C. Hays, who organized a militia of local volunteers dubbed the \"Washoe Regiment\". It was composed of 13 companies from the areas surrounding Carson City, Virginia City, Nevada City, and Sacramento. In addition to the volunteers under Hays, the US Army responded by sending a detachment of artillery and infantry from Fort Alcatraz, California. This contingent, known as the \"Carson River Expedition\", was led by Captain Joseph Stewart. Hays' volunteers went into action at the Battle of Williams Station and were joined by Stewart's regulars.\nWashoe Regiment\nField & Staff\n* Colonel John C. Hays\n* Lt. Colonel Edward J. Saunders\n* Major Daniel E. Hungerford\nCompanies\n* Company A \"Spy Company\" – Captain L. B. Fleeson\n* Company B \"Sierra Guards\" – Captain E. J. Smith\n* Company C \"Truckee Rangers\" – Captain Alanson W. Nightingill (The nearby Nightingale Mountains were later named in honor of Nightingill; he later became the first state controller of Nevada.)\n* Company D \"Sierra Guards\" – Captain J. B. Reed\n* Company E \"Carson Rangers\" – Captain P. H. Clayton\n* Company F \"Nevada Rifles\" – Captain J. B. Van Hagan (CA)\n* Company G \"Sierra Guards\" – Captain F. F. Patterson\n* Company H \"San Juan Rifles\" – Captain N. C. Miller\n* Company I \"Independent City Guards of Sacramento\" – Captain A. G. Snowden (CA)\n* Company J \"from Sacramento\" – Captain Joseph Virgo (CA)\n* Company K \"Virginia Rifles\" – Captain Edward Farris Storey\n* Company L \"Carson Rifles\" – Captain J.L. Blackburn\n* Company M \"Silver City Guards\" – Captain Ford\n* Company N \"Highland Rangers/Vaqueros\" – Captain S. B. Wallace\n* Company O \"Sierra Guards\" – Captain Creed Haymond\nCarson River Expedition\nField & Staff\n* Captain Joseph Stewart\n* Captain T. Moore, Quartermaster\n* Lieutenant Horatio G. Gibson, Asst. Commissary of Substance\nCompanies\n* Company G, 3rd US Artillery – Captain Joseph Stewart\n* Company I, 3rd US Artillery – Lieutenant Horatio G. Gibson\n* Company A, 6th US Infantry – Captain F. F. Flint\n* Company H, 6th US Infantry – Lieutenant J. McCreary\nSecond Battle of Pyramid Lake\nIn late June, Stewart and Hays retraced the steps of Ormsby's command and attacked Numaga's Paiutes at the same location as Ormsby's fight. Hays and Stewart defeated Numaga, and the Paiute forces scattered across the Great Basin. After a minor skirmish in the Lake Range northeast of Pyramid Lake, the volunteer forces were disbanded, and Stewart's regulars returned to the Carson River near Williams Station to construct Fort Churchill. Three regiment members and 25 Paiutes were reported killed.\nAftermath\nAfter the second battle of Pyramid Lake, the federal forces built a small fort at the southern end of Pyramid Lake to deny that area to the Paiutes. Small skirmishes and raids continued until August, when an informal cease-fire between Numaga and white surveyors working in the area north of Pyramid Lake was achieved during a meeting at Deep Hole, Nevada. In 1861 the fort at Pyramid Lake was abandoned in favor of Fort Churchill, further south on the Carson River. The disruption to food gathering activities, especially fishing in Pyramid Lake, may have killed more from starvation. The Bannock War of 1878 may be viewed as a continuation of the Pyramid Lake War, as some Paiutes and Bannock fought in both wars. The war is of particular note because of its effect on the famed Pony Express. Several stations were ambushed and the service experienced its only delays in delivery. A few riders distinguished themselves during this time, especially Robert \"Pony Bob\" Haslam, who accomplished (out of necessity) a  between Lake Tahoe (Friday's Station) and Fort Churchill and back with only nine hours of rest around May 10 of 1860.\nSee also\n*Ute Wars\n*Battle of Egan Station (skirmish between US Soldiers and Paiutes in August 1860)\nReferences\nExternal links\n* [http://www.xphomestation.com/paiutewar.html  The Paiute Indian War 1860]\n* [http://www.onlinenevada.org/pyramid_lake_war  Pyramid Lake War]"
    }
  ]
}