{
  "content": [
    {
      "type": "text",
      "text": "# Palace of Culture (Târgu Mureș)\n\nThe Palace of Culture (, ) is an edifice located in the centre of Târgu Mureș (Marosvásárhely), Romania. The building houses the Mureș County Library, the Mureș County Museum, and the State Philharmonic of Târgu Mureș.\nThe Palace of Culture of Târgu Mureș is listed in the National Register of Historic Monuments.\nBuilding\nThe Palace of Culture was built between 1911 and 1913 to the request of mayor György Bernády by Marcell Komor (1868-1944) and Dezső Jakab (1864-1932). The competition for building the Palace of Culture was won by Komor and Jakab with their two-floor plan. Only later to the request of mayor Bernády György the construction was expanded to 3 floors. Construction started in 1911 and lasted until 1913 when the inside decorations were completed.\nThe Art Nouveau edifice, designed in Secession style, has 3 buildings: the main building, the right building and the left building. Above of the Entrance Hall is the ''Mirrors' Hall, located on the first floor of the building. With a capacity of 700 seats, the multifunctional Concert Hall  forms the central part of the building. Its height corresponds to the three levels of the building. With more than 200 seats, the Small Hall'', beautifully decorated with floral motifs, is used for cultural and scientific conferences, and for various recitals and concerts.\nOn the window glasses there are illustrated sequences from Hungarian legends and on the balustrades of the windows the portraits of Kazinczy Ferenc, Tompa Mihály, Kemény Zsigmond and more. Above the 'quartet' gate the bronze embossments of Szent Erzsébet, Bolyai János and Bolyai Farkas, Aranka György and Bánk bán of Erkel Ferenc can be seen. On the main façade the statues and the embossments are in bronze. The roof is decorated with blue, ruddy and white tiles.\nUses\nThe building is home to the [http://www.filarmonicams.ro/ State Philharmonic of Târgu Mureș] (founded in 1950), the [http://www.bjmures.ro/index.php Mureș County Library] (since 1913), the art galleries of the [http://muzeulmures.ro/ Mureș County Museum], and hosts various exhibitions and events of the Târgu Mureș branch of the [https://uap.ro/en/targu-mures/ Visual Artists' Union of Romania].\nThe inside of the palace housed the City Cinema between 1913 and 1957, the first Romanian Theatre School between 1934 and 1940, the State Theatre of Târgu Mureș between 1946 and 1973, the Fine Arts and Music Secondary School between 1949 and 1970, the Academy of Fine Arts between 1932 and 1949 and the County House for Guidance of Folkloric Creation between 1950 and 1999.\nGallery\nFile:Music Hall Palace of Culture Targu Mures.jpg|The Concert Hall\nFile:Cultural Palace in Târgu Mureş 2.JPG|Hall of Mirrors\nFile:Cultural Palace in Târgu Mureş 1.JPG|The ceiling mural of the Culture Palace\nReferences\nExternal links\n* [http://palatul-culturii.ro/ Official website of the Târgu Mureș Palace of Culture]"
    }
  ]
}