{
  "content": [
    {
      "type": "text",
      "text": "# Palace of the Kings of Majorca__disambig_1\n\nPalace of the Kings of Majorca\nThe Palace of the Kings of Majorca (French: Palais des Rois de Majorque, Catalan: Palau dels Reis de Mallorca), is a palace and a fortress with gardens overlooking the city of Perpignan in Pyrenees-Orientales, France.\nHistory\nThe Kingdom of Majorca (1276-1349)\nIn 1276, King James II of Majorca made Perpignan the capital of the Kingdom of Majorca. He started to build a palace with gardens on the hill of Puig del rey, on the south of the town, completing it in 1309. The architects were Ramon Pau, Pons Descoll, and Bernat Quer.\nEnding the Western Schism\nIn 1415, Sigismund, Holy Roman Emperor, organised a European summit in Perpignan, to convince the Avignon Antipope Benedict XIII to resign his office and bring an end to the Western Schism through the Council of Constance. On 20 September 1415, the Emperor met with Antipope Benedict XIII at the palace with the King Ferdinand I of Aragon and the delegations of the Counts of Foix, Provence, Savoy, Lorraine, the embassy of the Roman church for the Council of Constance, and embassies from the kings of France, England, Hungary, Castile and Navarre. The Antipope refused to resign and to recognise the Pope that the Council had chosen, clashing with the Emperor, who left Perpignan on 5 November.\nThe Franco-Spanish wars\nPart of the northern wing of the palace was destroyed in a siege in 1502.\nFollowing the Treaty of the Pyrenees in 1659, France gained Roussillon, and proceed to develop the defensive features of the palace.\nThe General Council of the Pyrénées-Orientales bought the palace and the gardens in 1958, from the Ministry of Defence who keeps the Vauban bastions and 19th century buildings and courts as a garrison.\nArchitecture\nThe Palace of the Kings of Majorca is a fortified palace in the Gothic style. It is organised around three courtyards 60 m square. The first foremen on the site were Ramon Pau and especially Pons Descoyl, very active in Perpignan and the Baleares.\nIt has two chapels, one above the other: the lower is the ''Queen's Chapel, while the upper is Holy Cross'' with a pink marble door.\nHere we have together in the Great Hall; the seat of political power, the chapel and the royal residence. The position of the chapel in the heart the royal apartments, opposite the throne room, indicates the importance of the spiritual over the temporal. The plan of the palace was inspired by those of Majorca, and the chapel is like that of the earlier Sainte-Chapelle in Paris.\nThe walls, built with uncut stones and bricks bound with mortar, were coated with lime and painted.\nDoors, corridors, stairs, armatures and the main towers are all made of cut stone: ochre stone from Les Fonts, Baixas Blue, Sandstone, Red Marble from Villefranche-de-Conflent, White and Blue Marble from Ceret.\nActivities\nGuitares au Palais\nThe Guitares au Palais, a free three-day guitar music festival, is held in the last weekend of August in the palace and the gardens.\nThe festival's art director is Pedro Soler and opens the stage to an eclectic stream of guitar enthusiasts with performances in traditional acoustic guitar, flamenco, classical music, gypsy music, pop music and jazz.\nInternational guests includes the Rosenberg Trio, Tekamali and Paco Ibáñez in 2004, Montserrat Figueras, Rolf Lislevand and Manolo Sanlucar in 2005, The National and Sergio Lopez in 2006, Caetano Veloso in 2007, and the Rumberos Catalans, Bernardo Sandoval, Peter Finger and Aaron and Bryce Dessner in 2008.\nSee also\n* List of castles in France\nNotes\nReferences\n*"
    }
  ]
}