{
  "content": [
    {
      "type": "text",
      "text": "# Palestinian traditional costumes\n\n, photographed by the American Colony Photo Department, |alt=A woman from Ramallah]]\nPalestinian traditional clothing are the types of clothing historically and sometimes still presently worn by Palestinians. Foreign travelers to Palestine in the 19th and early 20th centuries often commented on the rich variety of the costumes worn, particularly by the fellaheen or village women. Many of the handcrafted garments were richly embroidered and the creation and maintenance of these items played a significant role in the lives of the region's women.\nThough experts in the field trace the origins of Palestinian clothing to ancient times, there are no surviving clothing artifacts from this early period against which the modern items might be definitively compared. Influences from the various empires to have ruled Palestine, such as Ancient Egypt, Ancient Rome and the Byzantine Empire, among others, have been documented by scholars largely based on the depictions in art and descriptions in literature of costumes produced during these times.\nUntil the 1940s, traditional Palestinian clothing reflected a woman's economic and marital status and her town or district of origin, with knowledgeable observers discerning this information from the fabric, colours, cut, and embroidery motifs (or lack thereof) used in the apparel.\nIn 2021, The art of embroidery in Palestine, practices, skills, knowledge and rituals was inscribed on the UNESCO Representative List of the Intangible Cultural Heritage of Humanity.\nOrigins\nPalestinian girl of Bethlehem in costume, [[Ottoman Syria, between 1890 and 1900|alt=Palestinian young woman of Bethlehem in costume]]\nof a woman wearing the Palestinian traditional costume of Ramallah in 1920]]\nGeoff Emberling, director of the Institute for the Study of Ancient Cultures, notes that Palestinian clothing from the early 19th century to World War I show \"traces of similar styles of clothing represented in art over 3,000 years ago.\"\nHanan Munayyer, collector and researcher of Palestinian clothing, sees examples of proto-Palestinian attire in artifacts from the late Levantine Bronze Age (1500 BC) period such as Egyptian paintings depicting Canaanites in A-shaped garments. Munayyer says that from 1200 BC to 1940 AD, all Palestinian dresses were cut from natural fabrics in a similar A-line shape with triangular sleeves. This shape is known to archaeologists as the \"Syrian tunic\" and appears in artifacts such as an ivory engraving from Megiddo dating to 1200 BC.\nIn Palestine: Ancient and Modern (1949) produced by the Royal Ontario Museum of Archaeology, Winifred Needler writes that \"no actual clothing from ancient Palestine has survived and detailed descriptions are lacking in the ancient literature\". In their length, fullness, and use of pattern these modern garments bear a general resemblance to the costumes of West Asian people seen in ancient Egyptian and Assyrian monuments. The dress of the daughters of Zion is mentioned in Isaiah 3:22–24:\nThis suggests that feminine city fashions of Isaiah's day may have resembled modern Palestinian country dress.\nNeedler also cites well-preserved costume artifacts from late Roman-Egyptian times consisting of \"loose linen garments with patterned woven bands of wool, shoes and sandals and linen caps,\" as comparable to modern Palestinian costumes.[6]\nc. 1900]]\nThe shift from woven to embroidered designs was made possible by artisanal manufacture of fine needles in Damascus in the 8th century. Embroidered dress sections, like the square chest piece (qabbeh) and decorated back panel (shinyar) prevalent in Palestinian dresses, are also found in costume from 13th-century Andalusia. Each village in Palestine had motifs that served as identifying markers for local women. Common patterns included the eight-pointed star, the moon, birds, palm leaves, stairs, and diamonds or triangles used as amulets to ward off the evil eye.\nSocial and gender variation\nTraditionally, Palestinian society has been divided into three groups: villagers, townspeople, and Bedouins. Palestinian costumes reflected differences in the physical and social mobility enjoyed by men and women in these different groups in Palestinian society.\nThe villagers, referred to in Arabic as fellahin, lived in relative isolation, so older, more traditional costume designs were found most frequently in the dress of village women. The specificity of local village designs was such that \"A Palestinian woman's village could be deduced from the embroidery on her dress.\"\nTownspeople (Arabic: ) had increased access to news and an openness to outside influences that was naturally also reflected in the costumes, with town fashions exhibiting a more impermanent nature than those of the village. By the early 20th century, well to-do women (and men) in the cities mainly had adopted Western wear. Typically, Ghada Karmi recalls in her autobiography how in the 1940s in the wealthy Arab district of Katamon, Jerusalem, only the maids, who were local village women, donned traditional Palestinian dresses.\nDue to their nomadic lifestyle, Bedouin costumes reflected tribal affiliations rather than affiliations to a localized geographic area.\nAs in most of the Middle East, men's clothing was more uniform than women's clothing.\nWeaving and fabrics\nWoolen fabrics for everyday use were produced by weavers in Majdal, Bethlehem, Ramallah, and Jerusalem. The wool could be from sheep, goats or camels. Weaving among the Bedouin was and is still traditionally carried out by women to create domestic items, such as tents, rugs, and pillow covers. Thread is spun from sheep's wool, colored with natural dyes, and woven into a strong fabric using a ground loom.\nLinen woven on hand-looms and cotton were mainstay fabrics for embroidered garments. However, cotton was not widely used until the end of the 19th century when it began to be imported from Europe. Fabrics could be left uncoloured or dyed various colours, the most popular being deep blue using Indigo dye, others being black, red and green. In 1870 there were ten dyeing workshops in the Murestan quarter of Jerusalem, employing around 100 men.\nAccording to Shelagh Weir, the colour produced by indigo (nileh) was believed to ward off the evil eye, and frequently used for coats in the Galilee and dresses in southern Palestine. Indigo dyed heavy cotton was also used to make sirwals or , cotton trousers worn by men and women that were baggy from the waist down but tailored tight around the calves or ankles. The wealthier the region, the darker the blue produced; cloth could be dipped in the vat and left to set as many as nine times. Dresses with the heaviest and most intricate embroidery, often described as 'black', were made of heavy cotton or linen of a very dark blue. Travellers to Palestine in the 19th and 20th centuries represented pastoral scenes of peasant women donned in blue going about their daily tasks, in art and literature.\nBecause of the hot climate and for reasons of prestige, dresses were cut voluminously, particularly in the south, often running twice the length of the human body with the excess being wrapped up into a belt. For more festive dresses in southern Palestine, silks were imported from Syria with some from Egypt. For example, a fashion of the Bethlehem area was to interlay stripes of indigo-blue linen with those of silk.\nFashions in towns followed those in Damascus, Syria. Some producers in Aleppo, Hama and Damascus produced styles specifically for the Palestinian market. Weavers in Homs produced belts and some shawls exclusively for export to Nablus and Jerusalem.\nThe production of cloth for traditional Palestinian costumes and export throughout the Arab world was a key industry of the destroyed village of Majdal. Majdalawi fabric was produced by a male weaver on a single treadle loom using black and indigo cotton threads combined with fuchsia and turquoise silk threads. While the village no longer exists today, the craft of Majdalawi weaving continues as part of a cultural preservation project run by the Atfaluna Crafts organization and the Arts and Crafts Village in Gaza City.\nPalestinian embroidery\nDiverse motifs were favored in Palestinian embroidery and costume as Palestine's long history and position on the international trade routes exposed it to multiple influences. Before the appearance of synthetically dyed threads, the colors used were determined by the materials available for the production of natural dyes: \"reds\" from insects and pomegranate, \"dark blues\" from the indigo plant: \"yellow\" from saffron flowers, soil and vine leaves, \"brown\" from oak bark, and \"purple\" from crushed murex shells. Shahin writes that the use of red, purple, indigo blue, and saffron reflected the ancient color schemes of the Canaanite and Philistine coast, and that Islamic green and Byzantine black were more recent additions to the traditional palette. Shelagh Weir, author of Palestinian costume (1989) and Palestinian embroidery (1970), writes that cross-stitch motifs may have been derived from oriental carpets, and that couching motifs may have origins in the vestments of Christian priests or the gold thread work of Byzantium. Simple and stylized versions of the cypress tree (saru) motif are found throughout Palestine.\nLongstanding embroidery traditions were found in the Upper and Lower Galilee, in the Judean Hills, and on the coastal plain. Research by Weir on embroidery distribution patterns in Palestine indicates there was little history of embroidery in the area from the coast to the Jordan Valley lying to the south of Mount Carmel and the Sea of Galilee, and to the north of Jaffa and from Nablus to the north. Decorative elements on women's clothing in this area consisted primarily of braidwork and appliqué. \"Embroidery signifies a lack of work,\" an Arab proverb recorded by Gustaf Dalman in this area in 1937, has been put forward as a possible explanation for this regional variation.\nVillage women embroidering in locally-distinctive styles was a tradition that was at its height in Ottoman-ruled Palestine. Women would sew items to represent their heritage, ancestry, and affiliations. Motifs were derived from basic geometric forms such as squares and rosettes. Triangles, used as amulets, were often incorporated to ward off the \"evil eye\", a common superstition in the Middle East. Large blocks of intricate embroidery were used on the chest panel to protect the vulnerable chest area from the evil eye, bad luck and illness. To avoid potential jinxes from other women, an imperfection was stitched in each garment to distract the focus of those looking.\ncostume pre-1918, Bonfils Portrait|alt=Girls in Bethlehem costume]]\nGirls would begin producing embroidered garments, a skill generally passed to them by their grandmothers, beginning at seven. Before the 20th century, most young girls were not sent to school. Much of their time outside of household chores was spent creating clothes, often for their marriage trousseau (or ) which included everything they would need in terms of apparel, encompassing everyday and ceremonial dresses, jewelry, veils, headdresses, undergarments, kerchiefs, belts and footwear.\nIn the late 1930s, new influences introduced by European pattern books and magazines promoted the appearance of curvilinear motifs, like flowers, vines or leaf arrangements. They introduced the paired bird motif, which became very popular in central Palestinian regions. John Whitting, who put together parts of the Museum of International Folk Art collection, has argued that \"anything later than 1918 was not indigenous Palestinian design, but had input from foreign pattern books brought in by foreign nuns and Swiss nannies\". Others say the changes did not occur before the late 1930s, when embroidery motifs local to certain villages could still be found. Geometric motifs remained popular in the Galilee and southern regions, like the Sinai Desert.\nMen's clothing\nSome professions, such as the Jaffa boatmen, had their own unique uniforms. The horse or mule drivers (mukaaris), widely used between the towns in an age before proper roads, wore a short embroidered jacket with long sleeves slit open on the inside, red shoes and a small yellow woolen cap with a tight turban.\nHistory\nPost-1948\nThe 1948 Palestinian expulsion and flight led to a disruption in traditional modes of dress and customs, as many women who had been displaced could no longer afford the time or money to invest in complex embroidered garments. Widad Kawar was among the first to recognize the new styles developing after the Nakba.\nNew styles began to appear in the 1960s. For example, the \"six-branched dress\" named after the six wide bands of embroidery running down from the waist.  These styles came from the refugee camps, particularly after 1967. Individual village styles were lost and replaced by an identifiable \"Palestinian\" style.\nThe shawal, a style popular in the West Bank and Jordan before the First Intifada, probably evolved from one of the many welfare embroidery projects in the refugee camps. It was a shorter and narrower fashion, with a western cut.\nIncome generating projects in the refugee camps and in the Occupied Territories began to use embroidery motifs on non-clothing items such as accessories, bags and purses. With the evolution of the different groups distinct styles are beginning to be appear. Sulafa the UNRWA project in the Gaza Strip has exhibited work at Santa Fe, New Mexico. Atfaluna, also from Gaza, working with deaf people, sells its products through the internet. West Bank groups include the Bethlehem Arabs Women's Union, Surif Women's Cooperative, Idna, the Melkite Embroidery Project (Ramallah). In Lebanon Al-Badia, working in the Refugee Camps, is known for high quality embroidery in silk thread on dresses made of linen. The Jerusalem-based Fair Trade organisation Sunbula, is working to improve the quality and presentation of items so that they can be sold in European, American and Japanese markets.\nGeography\n*Jerusalem: The Jerusalem elite followed Damascus fashions which in turn were influenced by those of the Ottoman court in Istanbul. Fabrics were imported from Syria with several specialist shops on the Mamilla Road. Wedding dresses were ordered from Aleppo and Turkey. From the beginning of the 20th century the upper classes began to wear European styles.\n*Galilee: Collections reveal that there was a distinct Galilee women's style from at least the middle of the 19th century. The standard form was a coat (Jillayeh), tunic and trousers. Cross-stitch was not used much, the women preferring patchwork patterns of diamond and rectangular shapes, as well as other embroidery techniques. In the 1860s, H.B. Tristram described costumes in the villages of El Bussah and Isfia as being either \"plain, patched or embroidered in the most fantastic and grotesque shapes\". Towards the beginning of the 20th century Turkish/Ottoman fashions began to dominate: such as baggy trousers and cord edging. Materials, particularly silks, were brought from Damascus. Before the arrival of European colour-fast dyes the Galilee was an important area for the growing of indago and sumac which were used for creating blue and red dyes.\n*Nablus: Women's dresses from villages in the Nablus area were the least ornate in the whole of Palestine.\n*Bethlehem: Wadad Kawar describes Bethlehem as having been \"the Paris of Central Palestine\". Both it and neighbouring Bayt Jalla were known for their fine Couching Stitch work. This technique was used extensively in the panels for malak (queen) wedding dresses. The malak dress was popular amongst brides from the villages around Jerusalem. So much so that the panels began to be produced commercially in Bethlehem and Bayt Jalla. Amongst the wealthier families it was the fashion for the groom to pay for the wedding dress so the work often became a display of status.\n*Ramallah: A variety of very distinguishable finely executed patterns.\nproject in Jalazone RC. .|alt=Doll in wedding-dress typical of Ramallah area]]\n*Lifta (near Jerusalem), and Bayt Dajan (near Jaffa) were known as being among the wealthiest communities in their areas, and their embroideresses among the most artistic. [https://web.archive.org/web/20070219004053/http://www.saudiaramcoworld.com/issue/199101/woven.legacy.woven.language.htm Saudi Aramco World: Woven Legacy, Woven Language]\n*Majdal (today a part of Ashkelon) was a center for weaving.\nGarment types\nBasic dress\n*Palestinian Thobe, loose fitting robe with sleeves, the actual cut of the garment varied by region.\n***qabbeh;  the square chest panel  of the Thob, often decorated\n* [ Banayiq Side panels of the thob]\n***; brocaded back hem panel on the Bethlehem dress.\n***shinyar;  lower back panel of the dress, decorated in some regions\n*Libas; pants,\n*Jubbeh; jacket, worn by men and women,\n*Jillayeh; embroidered jubbeh, often the embroidered outer garment of a wedding costume,\n*Shambar; large veil, common to the Hebron area and southern Palestine.\nHeaddress\nThe women in each region had their distinctive headdress. The women embellished their headdresses with gold and silver coins from their bridewealth money. The more coins, the greater the wealth and prestige of the owner (Stillman, p.&nbsp;38);\n*Shaṭweh is a distinctive conical hat \"shaped rather like an upturned flower pot\" only worn by married women. Used mainly in Bethlehem, also in Lifta and Ayn Karim in the District of Jerusalem, and  Beit Jala and Beit Sahour near Bethlehem  The shatweh is used to keep the iznaq (chin chain) in place.\n*Smadeh used in Ramallah, consists of an embroidered cap, with a stiff padded rim. A row of coins, tightly placed against another, is placed around the top of the rim. Additional coins might be sown to the upper part or attached to narrow, embroidered bands. As with the other women's head-dresses, the smadeh represented the wearers bridal wealth, and acted as an important cash reserve. One observer wrote in 1935: \"Sometimes you see a gap in the row of coins and you guess that that a doctor's bill has had to be paid, or the husband in America has failed to send money\" (quoted in Stillman, p.&nbsp;53.)\n*Araqiyyeh[http://www.palestineheritage.org/Iraqiyyeh.gif], used in  Hebron. The words ʿaraqiyyeh and taqiyyeh have been used since the Middle Ages in the Muslim world to denote small, close-fitting head-caps, usually of cotton, which were used by both sexes. The original purpose was to absorb sweat (Arab: \"araq\"). In the whole of Palestine, the word  taqiyyeh  continued to be used about the simple skull-cap used nearest to the hair. In the Hebron area, however, the word araqiyyeh  came to denote the embroidered cap with a pointed top a married woman would wear over her taqiyyeh. During her engagement period, a woman of the Hebron area would sow and embroider her  araqiyyeh, and embellish the rim with coins from her bridal money. The first time she would wear her  araqiyyeh would be on her wedding day. (Stillman, p.&nbsp;61)\nThe styles of headwear for men have always been an important indicator of a man's civil and religious status as well as his political affiliation: A turban being worn by a townsman and a kaffiyeh by a countryman. A white turban signified a qadi. In the 1790s, the Ottoman authorities instructed the Mufti of Jerusalem, Hassan al-Husayni, to put a stop to the fashion of wearing green and white turbans which they regarded as the prerogative of officially appointed judges. In the 19th century, due to the Qays–Yaman rivalry, white turbans were also worn by Yamanis, while the opposing Qaysis wore red. In 1912, the Palestine Exploration Fund reported that Muslim men from Jerusalem usually wore white linen turbans, called shash. It would be of red and yellow silk in Hebron, in Nablus red and white cotton. Men in Jaffa wore white and gold turbans, similar to the style in Damascus. A green turban indicated a descendant of Muhammed.\nFrom 1880 the Ottoman style of tarboush or fez began to replace the turban amongst the effendi class. The tarboush had been preceded by a rounder version with blue tassel which originated from the Maghreb. The arrival of the more vertical Young Turk version was emancipating for the Christian communities since it was worn by all civil and military officials regardless of religion. The exception was Armenians, who wore a black style.\nThe European styles, Franjy hat (burneiTah), were not adopted.\nThe kaffiyeh replaced the tarbush in the 1930s.\nShoes\nResidents of the major towns, Jerusalem, Jaffa, Ramleh, Lydd, Hebron, Gaza and Nablus, wore soft white sheepskin shoes with the point in front turned up: low cut, not above the ankle, and yellow for men. Before the mid-19th century non-Muslims wore black shoes. Village men wore a higher style fastened at the front with a leather button which provided protection from thorns in the fields. Bedouin wore sandals, made by wandering shoemakers, usually Algerian Jews.  The Arabic name for sandal, ''na'l, is identical to that used in the Bible. On special occasions Bedouin men wore long red boots with blue tassels and iron heels, jizmet, which were made in Damascus.\nCollections of Palestinian costumes\nExamples of Palestinian costumes and related artifacts are housed in several museums and collections, both public and private.\nPublic collections\nin an exhibition at Oriental Institute, Chicago |alt=Bride's wedding attire from Bayt Jibrin.]]\nThe following is a list of some of the public collections:\n*British Museum in London. The British Museum holds over 1,000 pre-1948 items in its Palestinian costume collection. Though not on permanent display, highlights of the collection were featured in Shelagh Weir's major 1989 \"Palestinian costume\" exhibition. Weir's monograph remains the seminal publication on traditional Palestinian costume.\n*The Israel Museum in Jerusalem holds one of the most sizable collections of Palestinian costumes. In 1986–87, the Museum held a major exhibit, \"Embroideries from the Holy Land\" and, in 1988, published Ziva Amir's The Development and Dissemination of the Chest-Panel of the Bethlehem Embroidery. An art historian, Amir traces the development of motifs (e.g., the floral vase) and the geographic spread of styles. An Israeli, Amir worked closely with Palestinian locals in Gaza and the West Bank.\n*L. A. Mayer Institute for Islamic Art in Jerusalem houses  Palestinian costumes and embroidery,  dating from the 18th and 19th centuries.\n*Museum of International Folk Art (MOIFA) at Museum of New Mexico at Santa Fe. John Whitting acquired Palestinian items directly from the owners and noted down the provenance of each, thereby making the collection especially informative. There are many items from villages which were destroyed/depopulated in the Nakba in 1948, e.g. al-Qubayba, al-Dawayima, Bayt Dajan, Lifta, Kafr Ana, Bayt Jibrin and  az-Zakariyya. The oldest items are traced back to the 1840s, while later examples include a wedding dress from Zakariyya () and a dress from Yatta ().\n*Palestine Costume Archive, in Canberra, Australia.  The Archive's collections tour worldwide.\n*Tareq Rajab Museum, Kuwait. Based on a private collection, this museum is open to the public and houses a significant Palestinian costume collection, as featured in Jehan Rajab's 1989 monograph Palestinian costume.\n*Olana State Historic Site in Hudson, New York. The collection of Palestinian and Syrian costumes held here, assembled by Frederic Edwin Church and his wife, Isabel, in 1868–1869, is one of the oldest extant.\nPrivate collections\n*Widad Kawar Arab Heritage collection. The collection of Ms. Widad Kawar. An important private collection now in Amman, Jordan, the Kawar collection of Palestinian and Jordanian dress toured extensively in the 1980s.\n*The Abed Al-Samih Abu Omar collection, Jerusalem. Private collection, mostly 20th century, featured in the book by Omar (1986):  Traditional Palestinian embroidery and jewelry,\n*Palestinian Heritage Foundation; The Munayyer Collection. The largest private collection in America, the Munayyer collection includes costumes from most Palestinian regions well known for distinctive costumes. The collection has been displayed in several American museums.\n*Palestinian Heritage Center, a cultural center located in Bethlehem, established in 1991 by Maha Saca. Has a collection of traditional costumes, some have been exhibited at the Oriental Institute, Chicago.\n*[https://archive.today/20061114140432/http://www.palestinecostumearchive.org/collections.htm List of worldwide collections of Palestinian costumes, from Palestine Costume Archive]\nSee also\n* Culture of Palestine\n* Islamic clothing\n* Serene Husseini Shahid\n* Widad Kawar\nReferences\nBibliography\n*Amir, Ziva, Arabesque: Decorative needlework from the Holy Land, New York: Van Nostrand Reinhold, 1977\n*Stillman, Yedida Kalfon (1979):  Palestinian costume and jewellery,  Albuquerque: University of New Mexico Press,   (A catalog of the  Museum of International Folk Art (MOIFA)  at Santa Fe's [https://web.archive.org/web/20071230160757/http://www.moifa.org/collections/coll-textile.html Museum of International Folk Art | Textiles & Costumes Collections] collection of Palestinian clothing and jewellery.)\n*Omar, Abed Al-Samih Abu (1986):  Traditional Palestinian embroidery and jewellery,  Jerusalem: Al-Shark (mostly based on his own collection.)\n*Hafiz al - Siba'i, Tahira Abdul (1987): A Brief Look at Traditional Palestinian Costumes: a Presentation of Palestinian Fashion, T. A. Hafiz,  English, French and Arabic text;\n*Needler, Winifred (1949). Palestine: Ancient and Modern — A handbook and guide to the Palestinian collection of the Royal Ontario Museum of Archaeology, Toronto. Royal Ontario Museum of Archaeology.\n*Völger, Gisela,  Welck, Karin v.  Hackstein, Katharina (1987):  Pracht und Geheimnis: Kleidung und Schmuck aus Palästina und Jordanien : Katalog der Sammlung Widad Kawar.  Köln: Rautenstrauch-Joest-Museum,\n*Völger, Gisela (1988):  Memoire de soie. Costumes et parures de Palestine et de Jordanie  Paris, (Exhibition catalogue from the Widad Kamel Kawar collection of the costume and jewelry of Palestine and Jordan.)\n*Weir, Shelagh and Shahid, Serene (1988):  Palestinian embroidery: cross-stitch patterns from the traditional costumes of the village women of Palestine  London: British Museum publications,\n*Rajab, J. (1989):  Palestinian Costume, Kegan Paul International, London,\n*[](1995): Threads of Tradition: Ceremonial Bridal Costumes from Palestine: The Munayyer Collection. Brockton, MA: Fuller Museum,  Brockton, MA,\n*Weir, Shelagh  (August 1995): Palestinian Costume British Museum Pubns Ltd\n*Widad Kawar/Shelagh Weir: Costumes and Wedding Customs in Bayt Dajan.[https://web.archive.org/web/20061009125716/http://arabheritage.org/bibliography.html :: Bibliography & Links ::]\nA fuller bibliography can be found here: [https://web.archive.org/web/20070613141917/http://www.palestinecostumearchive.org/bibliography.htm palestine costume archive - bibliography]\nExternal links\n*[https://amwrri.org/cultural-clothing-2/ Cultural Clothing – AMWRRI]\n*[https://web.archive.org/web/20070113234930/http://www.palestinecostumearchive.org/ Palestine costume archive]\n*[https://web.archive.org/web/20070202094059/http://arabheritage.org/index.html Widad Kawar Arab Heritage collection]\n*[http://www.palestineheritage.org/Costumes.htm The Munayyer collection: Palestinian Heritage Foundation]\n*[https://web.archive.org/web/20070219004053/http://www.saudiaramcoworld.com/issue/199101/woven.legacy.woven.language.htm Woven Legacy, Woven Language]"
    }
  ]
}