{
  "content": [
    {
      "type": "text",
      "text": "# Paludiculture\n\nPaludiculture is wet agriculture and forestry on peatlands. Paludiculture combines the reduction of greenhouse gas emissions from drained peatlands through rewetting with continued land use and biomass production under wet conditions. \"Paludi\" comes from the Latin \"palus\" meaning \"swamp, morass\" and \"paludiculture\" as a concept was developed at Greifswald University. Paludiculture is a sustainable alternative to drainage-based agriculture, intended to maintain carbon storage in peatlands. This differentiates paludiculture from agriculture like rice paddies, which involve draining, and therefore degrading wetlands.\nCharacteristics\nImpact of peatland drainage and rewetting\nPeatlands store an enormous amount of carbon. Covering only 3% of the Earth's land surface, they store more than 450 gigatonnes of carbon - more than stored by forests (which cover 30% of the land surface). Drained peatlands cause numerous negative environmental impacts such as greenhouse gas emission, nutrient leaching, subsidence and loss of biodiversity. Although only 0.3% of all peatlands are drained, peatland drainage is estimated to be responsible for 6% of all human greenhouse gas emission. By making soils waterlogged when re-wetting peatlands, decomposition of organic matter (~50% carbon) will almost cease, and hence carbon will no longer escape into the atmosphere as carbon dioxide.According to Leon Lamers, one hectare of drained marshland emits 20 to 25 tons of CO2 per year Peatland rewetting can significantly reduce environmental impacts caused by drainage by restoring hydrological buffering  and reducing the water table's sensitivity to atmospheric evaporative demand. Due to the drainage of soils for agriculture in many areas, the peat soil depth and water quality has dropped significantly over the years. These problems are mitigated by re-wetting peatlands. As such, they can also make installations against rising sea levels (levees, pumps) unnecessary. Wet bogs act as nitrogen sinks, whereas mineralisation and fertilisation from agriculture on drained bogs produces nitrogen run-off into nearby waters.\nArguments for cultivating crops on wet peatlands\n* Cultivating peatland products sustainably can incentivise the rewetting of drained peatlands, while maintaining similar land use in previously drained agricultural areas.\n* Paludiculture systems can contribute to landscape water management, storing water during floods and releasing it during droughts.\n* Raw materials can be grown on peatlands without competing with food production for land in other areas.\n* The growing of crops extracts phosphate from the land, which is important in wetlands; it also helps to extract other nutrients from water, making it suitable for post-water treatment purposes.\n* In many tropical countries, cultivating semi-wild native crops in peat swamp forests is a traditional livelihood which can be sustainable.\n* Paludicultures can obstruct nitrogen and phosphorus run-off from agriculture higher up in the river system and so protect lower waters.\n* Paludiculture areas can support wetland- or peatland-specialist species, and act as habitat corridors and ecological buffer zones between traditional agriculture and intact peatlands\n* Paludiculture could improve the quality of landscapes, for example by adding structural diversity in the form of novel crops.\nArguments against cultivating crops on wet peatlands\n* Paludiculture areas may require water inputs to keep them wet, potentially competing for water with other human and natural land uses.\n* Conversion of drained peatland to paludiculture could displace the production of food crops to other areas.\n* Paludiculture areas may create water pollution, for example due to release of nutrients when drained peat is rewetted, or if agrochemcials (fertilizers, perticides etc.) are used.\n* Paludiculture areas could act as ecological traps for wildlife, for example if harvesting destroys bird nests, and do not necessarily support the same biological communities as near-natural peatlands.\n* Paludiculture could alter landscape quality and character, whether it takes place in areas traditionally used for dryland farming or in near-natural peatland areas that were previously not used productively.\nDebates around the sustainability of paludiculture\nThe application of the term \"paludiculture\" is debated as it is contingent on whether different peatland agricultural practices are considered sustainable. In terms of greenhouse gas emissions, how sustainable a paludiculture practice is deemed to be depends on the greenhouse gas measured, the species of plant and the water table level of the peatland. \"Paludiculture\" been used to refer to cultivating native and non-native crops on intact or re-wetted peatlands. In the EU's Common Agricultural Policy, it is defined as the productive land use of wet and rewetted peatlands that preserves the peat soil and thereby minimizes CO2 emissions and subsidence. A 2020 review of tropical peatland paludiculture from the National University of Singapore evaluated wet and re-wetted management pathways in terms of greenhouse gas emissions and carbon sequestration and concluded that commercial paludiculture is only suited to re-wetted peatlands, where it is carbon negative or neutral, as opposed to intact peatlands, where it increases emissions. After decades of re-wetting, can still contribute to global warming to a greater extent than intact peatlands. Exceptions where paludiculture on intact peatlands may be sustainable are some traditions of cultivating native crops semi-wild in intact peat swamp forest, or gathering peatland products without active cultivation. The review also suggests that, to be sustainable, paludiculture should only use native vegetation to restore peatlands whilst producing biomass, as opposed to any wetland plants which have the possibility of surviving.  This is because using non-native species may create negative peatland conditions for other native plants, and non-native plants tend to have a lower yield and lifespan in undrained or re-wetted peatlands than when grown in their native habitats or drained wetlands.\nPaludiculture and ecosystem services\nAssessments of the sustainability of paludiculture should take into account ecosystem services besides carbon sequestration and how paludiculture can be integrated with traditional farming practices. Peatlands can provide a number of other ecosystem services e.g. biodiversity conservation and water regulation. It is therefore important to protect this areas and restore degraded areas. To conserve, restore and improve management of peat lands is a cost efficient and relatively easy way to maintain  ecosystem services. However, these the ecosystem services are not priced in a market and do not produce economic profit for the local communities. The drainage and cultivation, grazing, as well as peat mining on the other hand give the local communities short-term economic profits. It has therefore been argued that conservation and restoration, which has a significant and common value, needs to be subsidized by the state or the world at large.\nPaludiculture is not focused on nature conservation but on production, but paludiculture and conservation may complement each other in a number of ways. 1) Paludiculture can be the starting point and an intermediate stage in the process of restoring a drained peatland. 2) Paludiculture can lower the cost of the conservation project by e.g. decrease the costs of biomass removal and establishment costs. 3) Areas with paludiculture practice can provide buffer zones around the conserved peat areas. 4) Areas with paludiculture in between conservation areas can provide corridors facilitating species migration. 5) Paludiculture may increase the acceptance by the affected stakeholder to rewet once drained peatland. The support of the local communities in rewetting project are often crucial.\nThe effect on greenhouse gas emissions of paludiculture is complex. On the one hand a higher water table will reduce the aerobic decomposition of peat and therefore the carbon dioxide emissions. But on the other hand the increased ground water table may increase anaerobic decomposition of organic matter or methanogenesis and therefore increase the emission of methane (CH4), a short-lived but more potent greenhouse gas than CO2. The emissions emanating from rewetted peatland with paludiculture will also be affected by the land-use in terms of type of use (agriculture, forestry, grazing etc.), but also in terms of used species and intensity. Traditional use of peatland has often less impact on the environment than industrial use has, but need not be sustainable in the long run and if used at a larger scale.\nManagement\nThe most obvious way to maintain the ecosystem services that peatland provides is conservation of intact peatlands. This is even more true given the limited success of restoration projects especially in tropical peatlands. The conserved peatland still holds value for humans and hence provides a number of ecosystem services e.g. carbon storage, water storage and discharge. Conserving peatlands also avoids costly investments. Conservation is suggested to be a very cost-effective management practice for peatlands. The most obvious ecosystem services that the conservation management provides - i.e. carbon storage and water storage - are not easily priced on the market. Therefore, peatland conservation may need to be subsidised.\nTo rewet peatland and thereby restore the water table level is the first step in the restoration. The intention is to recreate the hydrological function and processes of the peatland. This takes a longer time than may be expected. Studies have found that rewetted previously drained peatland had the hydrological functions - e.g. water storage and discharge capacity - somewhere between a drained and an intact peatland six years after the restoration.\nUndrained peatlands are recommended to be left for conservation and not used for paludiculture. Drained peatlands, on the other hand, can be rewetted and used for paludiculture often using traditional knowledge together with new science. However local communities, especially in the tropics, maintain their livelihood by draining and using the peatland in various ways e.g. agriculture, grazing, and peat mining. Paludiculture can be a way to restore degraded and drained peatlands as well as maintaining an outcome for the local community. For example, studies of Sphagnum cultivation on re-wetted peat bogs in Germany shows a significant decrease of greenhouse gas emission compared to a control with irrigated ditches. The economic feasibility of Sphagnum cultivation on peat bogs are however still unclear. The basis for paludiculture is however very different in the south, among other things because of higher population and economic pressure on peatland.\nPaludiculture around the world\nTropical Peatlands\nTropical peatlands extensively occur in Southeast Asia, mainland East Asia, the Caribbean and Central America, South America, and southern Africa. Often located in lowlands, tropical peatlands are uniquely identified by rapid rates of peat soil formation, under high precipitation and high temperature regimes. In contrast, a high temperature climate accelerates decomposition rates, causing degraded tropical peatlands to contribute more substantially to global green house gas emissions.  Although tropical peatlands cover only 587,000&nbsp;km2, they store 119.2 Gigatonnes C at a density per unit area of 203,066 tonnes C km−2. For decades, these large carbon stores have succumbed to draining in order to cater for humanity's socio-economic needs. Between 1990 and 2015, cultivation (for management including industrial and small-holder agriculture) had increased from 11 to 50% of forested peatlands in Peninsular Malaysia, Sumatra, and Borneo. In Malaysia and Indonesia in the last twenty years, peat swamp forests have retreated from covering 77% of peatlands to 36%, endangering many mammals and birds in the region. In 2010, industrial agriculture covers about 3-3.1 million hectares, with oil palm accounting for 2.15 million hectares of this area. The conversion of natural tropical peatlands into other land uses leads to peat fires and the associated health effects, soil subsidence increasing flood risks, substantial greenhouse gas emissions and loss of biodiversity. Today efforts are being made to restore degraded tropical peatlands through paludiculture. Paludiculture is researched as a sustainable solution to reduce and reverse the degradation of peat swamp forests, and includes traditional local agricultural practices which predate the use of the term. Commercial paludiculture has not been trialled to the extent that it has in northern peatlands. Below are examples of paludiculture practices in tropical peatlands.\nCongo Basin\nThe Bantu people in Cuvette Central use peatlands for fishing, hunting and gathering, as well as small-scale agriculture near terra firme forests.\nIndonesia\nIn Indonesia there are three areas that could be the example of paludiculture practices such as beje system in Kutai and Banjar Tribes in East Kalimantan, Nut plantations in Segedong West Kalimantan, and Sago farming in Meranti Island district and Riau Province. Sago is cultivated semi-wild near rivers in Riau. Jelutong is grown in monocultures and mixed plantings in Central Kalimantanm and in South Sumatra and Jambi, and has been traded since the mid-1800s. This trade has been stiffed by 2006 tariffs and sanctions, and growing jelutong in monocultures is considered less efficient than crops like smallholder oil palm.\nBesides commercial production, peatland communities in Indonesia have developed less impactful practices for extracting resources. For example, Dayak communities only cultivate peatlands shallower than three meters for small-scale farming of sago and jelutong in coastal areas where the sea inputs nutrients.  In Sumatra, timber harvested in peat swamp forests are transported with wooden sleighs, rails and small canals in a traditional method called ongka which is less destructive than commercial logging transport. Peat subsidence and CO2 emissions have still been found present in agroforestry small-holdings in re-wetted peatlands in Jambi and Central Kalimantan, even those with native species.\nMalaysia\nIn Malaysia, sago plantations are mostly semi-wild, situated near rivers such as in Sarawak, although Malaysia also imports sago from Sumatra to make noodles. Peatlands are also used by the Jakun people in South East Pahang for hunting, gathering and fishing.\nPeru\nMestizo communities in Loreto, Peru use peatlands for hunting and gathering, and sustainably cultivating native palms, which they replant to restore the resource. They are conscious of the limits to the resource and the need to avoid wasteful felling during harvest.\nNorthern Peatlands\nThe greater part of the world's peatlands occur in the northern hemisphere, encompassing both boreal and temperate regions. Global estimates indicate that northern peatlands cover 3,794,000 km2, storing about 450 Gt of C at a density of approximately 118,318 t C km−2 . Peatlands form in poorly drained areas under conditions of high precipitation and low temperature . 66% of northern peatlands are found in Eurasia and 34% in North America. About 60% of these peatlands (2718×103 km2) are perennially frozen, with approximately 2152×103 km2 occurring in Eurasia and 565×103 km2 in North America . In the European Union (25 countries in Europe), peatlands cover approximately 291×103 km2, of which nearly 55% are in Finland and Sweden . Peatlands are more common in Belarus and Ukraine, where they occupy approximately 497×103 km2. Both boreal and temperate peatlands are primarily formed from bryophytes and graminoids, displaying slower rates of accumulation and decomposition comparative to the tropics . Northern peatlands have been drained for agriculture, forestry, and peat mining for fuel and horticulture. Historical uses of intact northern peatlands include fishing, hunting, grazing and gathering berries. Paludiculture is not widely established commercially in northern peatlands and most research projects identified below are ongoing. Many have not yet published peer-reviewed results. Most are focused on Sphagnum and reed farming. Rather than excavating decomposed Sphagnum as peat, non-decomposed reed fibres are harvested in cycles, as a renewable source of biomass. Sphagnum fibres can be used as a growing substrate, packaging to protect plants in transport, or to reintroduce moss when restoring other peatlands.\nBelarus\nThe University of Greifswald and Belarusian State University are researching reed beds in Naroch National Park as filters to reduce nitrogen and phosphorus run-off from degraded peatlands agriculture into the Baltic.  With research scheduled from January 2019 to September 2021, they aim to investigate the potential for harvesting reeds in the area to incentivise reed bed management.\nCanada\nPaludiculture practices include cultivating Sphagnum and cattail. One of the largest research projects was carried out between 2006 and 2012 by researchers from Université Laval in Quebec, trialling Sphagnum farming in eastern Canada. Their bog site, on the Acadian Peninsula, was previously used for block-cutting peat for fuel and so consisted of ditches of Sphagnum and raised areas of other vegetation. They found that Sphagnum farming could be practiced large-scale in the ditches, although they recommend active irrigation management for more consistent harvests.\nFinland\nThe Finnish Forest Research Institute and Vapo Oy, Finland's largest peat mining company, manage around 10 hectares for experiments in cultivating Sphagnum for restoration and to produce substrates.\nGermany\nThe Greifswald Mire Center lists six research projects for cultivating Sphagnum as a raw material for substrates and restoring moors in Germany: Hankhausen, Drenth, Parovinzialmoor, Ramsloh, Sedelsberg and Südfeld. The Drenth and Parovinzialmoor projects, running from 2015 to 2019, included testing varying irrigation and drainage methods. They found that peat moss can be grown on black peat. In Sedelsberg, researchers found cultivating Sphagnum on black peat to be \"expensive and time-consuming\". Researchers at the Südfeld project in 2002 observed a small increase in peat moss, and increasing reeds, cattails, and willows. Researchers are also investigating reed and cattail cultivation.\nIn Mecklenburg -West Pomerania, Greifswald University's ongoing Paludi-Pellets-Project aims to create an efficient biofuel source from sedges, reeds and canary grass in the form of dry pellets.\nIreland\nRenewable energy company Bord na Móna began peat moss trials in 2012 to restore Sphagnum in raised bogs for potential horticulture.\nLithuania\nLithuania's first peat moss cultivation trial was in 2011, in Aukštumala Moor in Nemunas Delta Regional Park. Researchers from Vilnius Institute of Botany transplanted sections of Sphagnum from a neighbouring degraded raised bog to the exposed peat surface. They found that 94% of the patches survived and expanded to the exposed peat.\nThe ongoing \"DESIRE\" project is investigating peatland restoration and paludiculture in the Neman River catchment area to reduce nutrient run-off into the Baltic.\nThe Netherlands\nIn the ongoing \"Omhoog met het Veen - AddMire in the Netherlands\" research project, Landscape Noord-Holland aims to investigate the restoration of reed beds and wet heathlands on moors previously converted for agriculture as well as to raise awareness about peatland degradation. The project is intended to promote paludiculture as an alternative income from agriculture. Researchers have rewetted 8 hectares, including for a water storage buffer area for the peat moss experiments. They are measuring the effects of soil erosion and atmospheric nitrogen on the growth of peat moss and the resulting greenhouse gas emissions and soil chemistry.\nRussia\nRussia has the largest area of peatlands of all the northern circumpolar countries with the world's largest peatland being the West Siberian mire massif and the largest in Europe the Polistovo-Lovatsky mire in northern Russia. An estimate derived from the digital soil database of Russia at a geographical scale of 1:5 million, indicates that the area of soils with a peat depth of more than 30&nbsp;cm is nearly 2210×103 km2. Approximately 28% occurs in the zone of seasonally frozen soils, nearly 30% in the zone of sporadic and discontinuous permafrost, and 42% in the zone of continuous permafrost. Peat with a depth of more than 50&nbsp;cm tends to be dominant in the Northern and Middle Taiga zones, but is uncommon in the Tundra zone.\nOngoing restoration does not seem to include paludiculture. The Wetland International together with the Institute of Forest Science of the Russian Academy of Sciences and the Michael Succow Foundation, implemented a major peatland restoration project in response to the extensive peat fires in the summer of 2010 in the Moscow region. The project was initiated within the framework of co-operation between the Russian Federation and the Federal Republic of Germany to the spearhead the ecological rewetting of peatlands and represents one of the largest peatland ecosystem restoration projects in the world. To date, over 35,000 ha of drained peatlands have been restored using ecological methods with another 10,000 ha currently underway.\nUnited Kingdom\nSome peatlands have traditionally been put to productive use in the United Kingdom. For example, reeds and sedges have been harvested from peatlands in The Broads for centuries. More recently, Natural England mobilized a £5 million Paludiculture Exploration Fund between 2023 and 2025, which funded projects tackling barriers to developing commercially viable paludiculture on lowland peat soils in England. These projects included: trials growing cattails (Typha sp.) on rewetted agricultural peat on Chat Moss, primarily to supply fibres for padded jackets; trials growing vegetable crops on rewetted agricultural peat in The Fens, and trials examining how integrating biochar into paludiculture systems could provide agronomic benefits and additional revenue streams associated with carbon storage.\nExamples of potential crops for cultivation on wet and rewetted peatlands\nThe [https://greifswaldmoor.de/dppp-109.html Database of Potential Paludiculture plants (DPPP)] lists more than 1,000 wetland plants, but only a minor fraction is suitable for paludiculture. Examples for potential and tested paludicultures are provided in the table below.\n{| class=\"wikitable\"\n|-\n! Species !! Region & sites !! Utilization\n!Greenhouse Gas Emissions on Re-wetted Sites\n|-\n| Alder (Alnus glutinosa) || Central Europe,\nFen, oligo-eutrotrophic\n| Timber, biofuel\n|\n|-\n| Canadian Poplar (Populus × canadensis)|| Northern Peatlands || Biofuel\n|\n|-\n| Cattails (Typha sp.) || Central Europe, North America, West Africa\nFen, polytrophic\n| Construction material (e.g. insulation), solid fuel, fermentation, fibers\n|Found to reduce CH4 emissions, with a negligible effect on N2O\n|-\n| Chokeberries ( Aronia melanocarpa )|| Northern peatlands || Food\n|\n|-\n| Cloudberries (Rubus chamaemorus)|| Northern peatlands || Food\n|\n|-\n| Common reed (Phragmites australis) || Europe, China,\nFen, polytrophic\n| Construction material (e.g. thatching), paper, solid fuel, fermentation\n|\n|-\n| Cranberries ( Vaccinium oxycoccos )|| Northern peatlands || Food\n|\n|-\n| Giant Reed (Arundo donax)|| Northern Peatlands || Biofuel\n|\n|-\n|Illipe Nut (Shorea stenoptera)\n|Tropics\n|Cocoa butter substitute\n|\n|-\n|Jelutong (Dyera costulata)\n|Cultivated in Indonesia\nNative to Tropical Peat Swamp Forests\n|Latex\n|\n|-\n|Karet Oblong (palaquium gutta)\n|Tropics\n|Latex\n|\n|-\n|Lingonberries (Vaccinium vitis-idaea )\n|Northern peatlands\n|Food\n|\n|-\n|Papyrus (Cyperus papyrus)\n|Tropics\n|\n|Shown to sequester carbon, but produce CH4\n|-\n|Red Balau (Shorea balangeran)\n|Native to Peat Swamp Forests, Tropics\n|Timber\n|Shown to produce high CH4 emissions\n|-\n|Reed Canary Grass (Phalaris arundinacea)\n|Northern Peatlands\n|Biofuel\n|Shown to reduce N2O emissions, but substantially increase CH4\n|-\n|Round-leaved sundew (Drosera rotundifolia)\n|Raised bog\n|Herbal medicine for cough diseases\n|\n|-\n|Sago (Metroxylon sagu)\n|Cultivated semi-wild in Malaysia, Maluku Islands, New Guinea, Riau, Borneo, Sumatra Native to Tropical Peat Swamp Forests\n|Starch\n|\n|-\n|Sphagnum sp.\n|Worldwide\nRaised bog, oligotrophic\n|Growing media e.g. for propagating orchids, and to substitute peat in other substrates.\nRoof greening, miniature models, garden landscaping, top dressing containers and flower beds, lining wire framed hanging baskets, making wreaths, compostable plant pots to reduce plastic use, packaging seedlings for transport and protection when cellar storing root vegetables. Restoring peatlands, e.g. of cutover bog when using the moss layer transfer technique.\n|Demonstrated to reduce CH4 emissions, negligible effect on N2O\n|-\n|Water buffaloes\n|Europe, Asia\n|Cheese (mozarella), meat, conservation grazing\n|\n|-\n|White Willow (Salix alba)\n|Northern Peatlands\n|Biofuel\n|\n|}\nReferences"
    }
  ]
}