{
  "content": [
    {
      "type": "text",
      "text": "# Pamela E. Queen\n\n| birth_place = New York City, New York, U.S.\n| death_date =\n| death_place =\n| state_delegate = Maryland\n| district = 14th\n| term_start = February 26, 2016\n| term_end =\n| appointer = Larry Hogan\n| predecessor = Craig Zucker\n| successor =\n| alongside = Anne Kaiser and Bernice Mireku-North\n| party = Democratic\n| occupation = Professor\n| relatives = Madison Scott (granddaughter)\n| website =\n}}\nPamela E. Queen (born 1960) is an American politician who serves as a Delegate to the Maryland House of Delegates representing Maryland's 14th Legislative District in northern Montgomery County.\nPersonal life\nQueen was born in New York City in 1960 and attended Tuskegee University, where she earned a B.S. in mathematics. She later went on to earn two master's degrees from Johns Hopkins University in computer science and management and a Ph.D. in finance from the George Washington University. Since 2010, she has worked as a professor of finance at Morgan State University in Baltimore, Maryland. Queen has been involved in a number of community and professional organizations.\nIn the legislature\nIn 2016, following the appointment of Delegate Craig Zucker to the Maryland Senate, Queen, a member of the Montgomery County Democratic Central Committee, was appointed by that committee to serve in the House of Delegates. She is the second African American woman to represent Montgomery County in the Maryland General Assembly. She was sworn in on February 26, 2016.\nQueen was a member of the Judiciary Committee from 2016 to 2018, afterwards serving in the Economic Matters Committee, including as the chair of its banking, consumer protection, and commercial law subcommittee since 2020. She is also a member of the Montgomery County Delegation, the Legislative Black Caucus of Maryland, the Women Legislators of Maryland, and the Maryland Legislative Latino Caucus.\nIn September 2025, Queen announced that she would not run for re-election in 2026.\nPolitical positions\nAbortion\nIn January 2019, Queen was one of nine Maryland lawmakers to add their names to a manifesto signed by 326 state legislators to reaffirm their commitment to protecting abortion rights.\nEducation\nQueen introduced legislation in the 2019 legislative session that would begin teaching students about organ donation at the age of 14.\nNational politics\nIn September 2018, Queen called for a county investigation into sexual assault allegations made against Supreme Court nominee Brett Kavanaugh. Montgomery County law enforcement officials declined to investigate the matter unless the alleged victim filed a complaint.\nIn December 2019, Queen attended a rally in Olney, Maryland to call for the impeachment and removal of Donald Trump.\nRedistricting\nIn 2019, Queen co-sponsored legislation that would place a referendum to add an amendment to the Constitution of Maryland prohibiting partisan redistricting on the 2020 ballot.\nSocial issues\nQueen introduced legislation in the 2019 legislative session that would provide additional Supplemental Nutrition Assistance Program benefits to low-income children during summer months and winter break. The bill passed and became law on May 28, 2019.\nQueen introduced legislation in the 2021 legislative session that would remove the governor from the state's parole board. The bill passed the House of Delegates by a vote of 93-41.\nPersonal life\nQueen's granddaughter is Madison Scott, a professional college basketball player. In March 2025, Queen traveled to Waco, Texas, to cheer on Scott during the Ole Miss–Baylor women's basketball game.\nElectoral history\n{| class=\"wikitable\"\n|+ Maryland House of Delegates District 14 Democratic Primary Election, 2018\n|-\n!Party\n!Candidate\n!Votes\n!%\n|-\n|Democratic\n|Anne Kaiser\n|11,845\n|33.3%\n|-\n|Democratic\n|Pamela Queen\n|11,198\n|31.5%\n|-\n|Democratic\n|Eric Luedtke\n|9,498\n|26.7%\n|-\n|Democratic\n|Paul Ransom\n|3,064\n|8.6%\n|}\n{| class=\"wikitable\"\n|+ Maryland House of Delegates District 14 General Election, 2018\n|-\n!Party\n!Candidate\n!Votes\n!%\n|-\n|Democratic\n|Anne Kaiser\n|37,733\n|24.5%\n|-\n|Democratic\n|Pamela Queen\n|35,991\n|23.4%\n|-\n|Democratic\n|Eric Luedtke\n|35,104\n|22.8%\n|-\n|Republican\n|Patricia Fenati\n|15,895\n|10.3%\n|-\n|Republican\n|Kevin Dorrance\n|14,546\n|9.5%\n|-\n|Republican\n|Michael A. Ostroff\n|14,347\n|9.3%\n|-\n|N/A\n|Other Write-Ins\n|144\n|0.1%\n|}\nReferences"
    }
  ]
}