{
  "content": [
    {
      "type": "text",
      "text": "# Pancha Ishwarams\n\n}}\nThe Pancha Ishwarams (five abodes of Shiva) () are five coastal ancient kovils (temples) built in dedication to the Hindu supreme being Ishvara in the form of the god Shiva, located along the circumference of Sri Lanka.\nThe most sacred pilgrimage complexes for Sri Lankan Tamil devotees of Hinduism, they adhere to the ancient Shaiva Siddhanta philosophy with central shrines for Shiva in each temple. Initial construction was by royal architects of the Naga kingdom (Nayanar). The Shiva lingams in each kovil are recorded as being Ravana's installations, while one of his descendants, the ancient Yaksha queen Kuveni was a devotee of Ishvara. Eventually, the kovils became international focal points of their classical era capitals in their respective districts, maintaining their own historical records, traditions and broad influence across Asia. Figures such as Agastya, Rama, Ravana and Arjuna – featured with the temples in Sthala Puranas, local Manmiyams, Mahabharata and Ramayana –  are displayed at these shrines, although recent research points to the temples' pre-Vedic origins, built to protect devotees from natural disasters.\nDeveloped through the patronage of Ceylonese residents, Sri Lankan and Indian royals during the Nayanar-Anuraigraamam Tamraparniyan floruit, pilgrims of other dharmic schools are noted to have worshipped and made donations for their upkeep – thus Buddhist and Jain elements are also within the complexes. The Pancha Ishwarams were looted and destroyed during the Portuguese colonial period in Sri Lanka, and extensive ruins of primarily Pallava construction were unearthed up until the 21st century. Most of the temples have since been restored. Their complexes retain elaborate sandstone lintels and pediments, intricate black granite carvings, tall gopurams, and stone iconography. Foundational steles remain and contain inscriptions. Bathing ponds and lake tanks constructed by the same Nayanar engineers to cultivate agriculture and irrigation are a typical feature.\nThe Athenaeum published that a research drive was underway in 1832 into the ancient sciences, literature, fine arts customs and city governance of the Pancha Ishwarams. The scholar and historian, Dr. Paul E. Pieris declared in 1917, at a meeting of the Royal Asiatic Society (Ceylon Branch), that:\nList of the Pancha Ishwarams\n{|class=\"wikitable sortable\"\n!Name!!Image!!Direction!!District!!Info\n|-\n| Naguleswaram ||  || North || Jaffna ||Naguleswaram or \"Keerimalai Naguleswara Tirutambaleswaram Kovil\" dominates the town of Keerimalai very near Kankesanthurai, a major port of entry for continental devotees. The site of worship of the sage Nagula Muni, its ruins include a Nayanar-Pallava gateway, Jaffna brick buildings, Keerimalai Springs and some stone idols. Its popularity is captured in the Dakshina Kailasa Puranam, Mahabharata, Suta Samhita of the Skanda Puranam and Yalpana Vaipava Malai and has undergone major renovations and expansion, including under Arumuka Navalar.\n|-\n| Ketheeswaram ||  || North West || Mannar || Ketheeswaram or Tirukkētīsvaram of Manthai is also one of the 275 Paadal Petra Sthalams of Shiva glorified in the poems of the Tevaram as well as the Ramayana, Skanda Puranam, Dathavamsa and Dakshina Kailasa Maanmiam. Built by Mayasura and the site of His worship – in the form of a stone lingam – by his son-in-law Ravana, King Malyavan, the sages Agastya and Bhrigu, the lunar node deity Ketu, Vijaya, the poet Eelattu Poothanthevanar and international classical-era merchants, it was of interest during the reign of Sirimeghavanna of Anuradhapura. Its ruins of Karaiyar Nayanar, Pallava, Jaffna, Pandya and Chola influence include its ancient lingam, the original shrine's basement, the Pallavi Theertham Tank, Kattukkarai Kulam Giant's Tank and stonework used to construct Mannar Fort, a church and the Hammershield Fort of Kayts. Undergone major renovations and expansion.\n|-\n| Koneswaram ||  || North East || Trincomalee || Koneswaram  or Tirukoneswaram of Trincomalee is the most popular among the five Ishwarams. Known as \"Then Kailayam\" (Kailash of the South), because it lies on the same longitude as Mount Kailash in the Himalayas, the Mahabharata and Ramayana describe how even in the pre-classical era of Ravana and Kuveni, it surpassed the description \"Rome of the Gentiles of the Orient\". Another Paadal Petra Sthalam of the Tevaram, it is also uniquely a Maha Shakta pitha and a Murugan Tiruppadai of Sri Lanka. It also features in Vayu Purana, Kandha Puranam, Thiruppugazh, Dakshina Kailasa Purana, Thirukonasala Puranam, Dakshina Kailasa Maanmiam, Mattakallappu Manmiyam, Mahavamsa and Yalpana Vaipava Malai. Its Jaffna, Pallava, Vanniar, Pandyan and Chola influenced ruins include its basement, stone inscriptions, statues, brickwork, steps, gopuram relics and metal idols found underwater, as part of Fort Frederick of Trincomalee and in a recently restored and expanded shrine. Ruins include Kulam tank and Agastya Thapanam of Kankuveli, Kanthalai Anai Tank and Kanniyai hot water spring.\n|-\n| Munneswaram ||  || West || Puttalam || Located in the pearling and fishing village of Munneswaram, Chilaw, in Demala Pattuva, the main deity of Munneswaram Kovil is Shiva as Munneshwarar or Munnainatha Peruman. Described in the Ramayana and Dakshina Kailasa Maanmiam as where Rama sought atonement from Shiva after his victory over Ravana, the temple is also mentioned in royal Tamil Kotte kingdom inscriptions, the Kokila Sandesa alongside Tenavaram, and the Yalpana Vaipava Malai, Konesar Kalvettu and Munneswara Maanmiam, where it is linked with Koneswaram and Kulakkottan. Deities include Murukan, Kannaki-Pattini, Aiyanaar, Ganesha and the first site of Kali worship in the country. Its ruins include its original basement and sanctums, life-sized lingam, stone pillars, metal vigrahams, issued coins, and the Munneswaram tank, where further ruins were uncovered in 2017. Restored and expanded by N. Coomaraswamy Kurukkal.\n|-\n| Tondeswaram (Tenavaram)||  || South || Matara|| Tenavaram is found in Devanthurai, Then-Thurai. Ruins of the \"Tenavarai Naga Risa Nila Kovil\" complex include Nayanar and Pallava-influenced Makara-Thoranam gateways with gana and yali riders, Lakshmi lintels, 200 pillars of the Aayiram Kaal Mandapam, a stone Galge shrine to Ganesh and unearthed lingam and Nandi. Its Vishnu shrine is rebuilt and prominent. The complex is mentioned in royal inscriptions of Kotte, Anuradhapura, Raigama and Dambadeniyan kings, the Tisara Sandesa, Kokila Sandesa, Paravi Sandesa and is the \"Da-Gana Cevitas (Sacra Luna)\" of Ptolemy. Its princes included astrological scholar Bhota Raja Panditar who composed the Sarasotimalai. The primary Shiva deity here, Chandra Maul Ishwaran as Tenavarai Nayanar, was visited by Ibn Batuta and mentioned in the Galle Trilingual Inscription.\n|}\nPopular culture\nThe temples have hosted several music, dance and dramatic performances, including a well received performance from the celebrated Carnatic vocalist Nageswari Brahmananda at Thiru Ketheeswaram. The Bharathanatyam dance drama musical \"Pancha Ishwarams of Lanka\" was debuted at Logan Hall, University of London in October 1999 as the second of a two-part concert. The production brought narratives of all five temples to the stage, as researched at the time by the historian S. Arumugam and professor K. Kailasanatha Kurukkal who presented the concert. Commissioned by the Shruthi Laya Shangam after the unearthing of the stone Nandi and lingam of the Tenavaram complex, its music and lyrics were composed by the Carnatic violinist Lalgudi Jayaraman, written by Jayaraman and Professor Va Ve Subramaniam, and choreographed by Vijayalakshmi Krishnaswamy. The production was performed by Jayaraman on the violin alongside his disciples Dr. Lakshmi Jayan, S. P. Ramh singing, Pavithra Mahesh on veena as well as Jagdeesan on mridangam, and dancers of the Kalakshetra school, Chennai and London. It was critically acclaimed and a huge audience favourite. Jayaraman interacted with the audience following the production, most of whom were expatriate Sri Lankan Tamils of the diaspora.\nRelated temples\nTwo other shore Shiva temples of ancient Sri Lanka rank in high sanctity alongside the Pancha Ishwarams. The Rameswaram Ramanathaswamy Kovil of Ramanathapuram district, linked to Koneswaram and Tenavaram, connected to Kalinga Magha and expanded by Jaffna kings  Jeyaveera Cinkaiariyan and Gunaveera Cinkaiariyan is now part of Tamil Nadu, India but formerly under Jaffna sovereignty. The Taantondreswaram temple of Kokkadichcholai, Batticaloa district was consecrated by Kalinga Magha and is also mentioned in the Mattakallappu Manmiyam.\nSee also\n*List of Hindu temples in Sri Lanka\nReferences"
    }
  ]
}