{
  "content": [
    {
      "type": "text",
      "text": "# Panhandle–Plains Historical Museum__disambig_1\n\n|established   =\n|location      = 2503 4th Avenue Canyon, Texas 79015\n|visitors      = 55,000 (2021)\n|founder       = Panhandle-Plains Historical Society\n|director      = Andrew Hay\n|curator       = Deana CraigheadJenni OpalinskiVeronica Arias\n|website       =\n|logo          = Panhandle-Plains Historical logo.png\n}}\nPanhandle–Plains Historical Museum is a history museum located on the campus of West Texas A&M University in Canyon, Texas, United States, a small city south of Amarillo. The museum's contents are owned and controlled by the Panhandle-Plains Historical Society, while West Texas A&M University and the Texas A&M University Board of Regents maintain and provide the facilities. Panhandle–Plains Historical Museum is the largest history museum in the state of Texas with 70,000 visitors annually and more than three million artifacts.\nThe museum's permanent exhibits include American Western life and agriculture history artifacts, art, paleontology, geology, Native American art and artifacts, firearms, antique vehicles, decorative arts and furniture, petroleum industry artifacts, sports artifacts, and textiles. The museum also features the outdoor Pioneer Town that includes a livery, saloon, schoolhouse, pioneer cabin and other buildings.\nThe Panhandle-Plains Historical Society was founded in 1921 by faculty and students of West Texas State Teachers College and area supporters to preserve the history of pioneer life and natural history in the West Texas region. The museum received financial assistance from the Commission of Control for the 1936 Texas Centennial. The museum opened its permanent and present location on April 14, 1933.\nThe noted historian Angie Debo served as curator of the museum from 1933 to 1934.\nIn 2001, the museum underwent a $5.8 million renovation.\nSome of the permanent exhibits include \"People of the Plains: Experiments in Living\", displays the difference and similarities of past and present Southern Plains settlers; \"Pioneer Town\", a recreation of a small settlement in the Texas Panhandle in the early 1900s; \"The Don D. Harrington Petroleum Wing\", a two floor exhibit showing the Texas Panhandle's oil boom years in the 1920s and 1930s; and \"The T-Anchor Ranch House\", an exhibit outside of the museum which recreates the original house that was constructed in the late 1870s.\nGallery\nFile:Allosaurus, Panhandle-Plains Historical Museum.jpg|Paleontology gallery\nFile:T-Anchor Ranch Headquarters, Panhandle-Plains Historical Museum.jpg|Pioneer cabin\nSee also\n*Recorded Texas Historic Landmarks in Randall County\nReferences\n*.\n*\nExternal links\n*\n*\n*[https://www.harringtonhousehistorichome.org/the-harringtons/ The Harringtons]\n*[https://artsandculture.google.com/partner/panhandle-plains-historical-museum?hl=en Virtual tour of the Panhandle–Plains Historical Museum] provided by Google Arts & Culture"
    }
  ]
}