{
  "content": [
    {
      "type": "text",
      "text": "# Pannonica de Koenigswarter\n\n| birth_place        = London, UK\n| death_date         =\n| death_place        = New York City, US\n| nationality        =\n| parents            = Charles RothschildRózsika Rothschild\n| spouse             =\n| other_names        =\n| years_active       =\n| known_for          = Patronage of jazz\n| occupation         =\n| notable_works      = Three Wishes: An Intimate Look at Jazz Greats\n}}\n'''Baroness Kathleen Annie Pannonica 'Nica' de Koenigswarter' (née'' Rothschild; 10 December 1913 – 30 November 1988) was a British-born jazz patron, photographer and writer. A leading patron of bebop, she was a member of the Rothschild family.\nPersonal life\nKathleen Annie Pannonica Rothschild was born in December 1913, in London, the youngest daughter of Charles Rothschild and his wife, Hungarian baroness Rózsika Edle von Wertheimstein, daughter of Baron Alfred von Wertheimstein of Bihar County. She was born into a branch of the wealthiest family in the world at the time. Her paternal grandfather was Nathan Rothschild, 1st Baron Rothschild. She grew up in Tring Park Mansion as well as Waddesdon Manor, among other family houses. The name \"Pannonica\" (shortened to \"Nica\" as a nickname) derives from Eastern Europe's Pannonian plain. Her friend Thelonious Monk reported that she was named after a species of butterfly her father had discovered, although her great-niece has found that the source of the name is a rare species of moth, Eublemma pannonica. She was a niece of Walter Rothschild, the 2nd Baron Rothschild, and her brother Victor Rothschild became the 3rd Baron Rothschild. Her elder sister was the zoologist and author Dame Miriam Rothschild.\nAttracted from a young age to drawing and painting, she won a silver medal at the Royal Drawing Society at the age of eleven. In the early thirties, she studied art history in Venice, Vienna and Munich. She also began to take an interest in photography.\nIt was at the Touquet airport, where she learned to fly an airplane, that  she met French diplomat Baron Jules de Koenigswarter, later a Free French hero. They got married in 1935. In 1937, they bought and moved to the Château d'Abondant, a 17th-century château in north-west France they acquired from the family of American banker Henry Herman Harjes (who had acquired the château in 1920 from the Duchesse de Vallombrosa). After the war, her husband entered the French diplomatic service and they settled in Norway and then in Mexico City (where he was counselor of the French Embassy).\nThe couple, who had five children, separated in 1951, and she moved to New York City, renting a suite at The Stanhope Hotel. Jules eventually filed for divorce, which was granted in 1956 along with custody of their three minor children. In 1958, she purchased a house in Weehawken, New Jersey with a Manhattan skyline view, originally built for film director Josef von Sternberg.\nKoenigswarter died of heart failure in 1988, aged 74, at the Columbia-Presbyterian Medical Center, in New York City. She had five children, two grandchildren, and four great-grandchildren.\nParticipation in the Free French Army\nDuring World War II, Jules de Koenigswarter joined the Free French Army to fight against Nazi Germany. Nica initially remained in France at the Château d'Abondant, opening her doors to passing refugees and evacuees. However, Jules urged Nica that she must escape. She managed to send her children from France to America, placing them with the Guggenheim family on Long Island, and joined the Free French Army alongside her husband in Equatorial Africa where she worked as a decoder for Gaullist intelligence, served as a radio host at Radio Brazzaville, before becoming an ambulance driver for the 1st Free French Division in Egypt and North Africa during the North African Campaign. At the close of the war she was decorated as a lieutenant by the allied armies. Nica would later be depicted on Thelonious Monk's Underground album cover as a French Resistance Fighter.\nJazz\nIn New York, de Koenigswarter became a friend and patron of leading jazz musicians, hosting jam sessions in her hotel suite, often driving them in her Bentley when they needed a lift to gigs, as well as sometimes helping them to pay rent, buy groceries, and making hospital visits. Although not a musician herself, she is sometimes referred to as the \"bebop baroness\" or \"jazz baroness\" because of her patronage of Thelonious Monk and Charlie Parker among others. Following Parker's death in her Stanhope rooms in 1955, de Koenigswarter was asked to leave by the hotel management; she re-located to the Bolivar Hotel at 230 Central Park West, a building commemorated in Thelonious Monk's 1956 composition \"Ba-lue Bolivar Ba-lues-are\".\nShe was introduced to Thelonious Monk by jazz pianist/composer Mary Lou Williams in Paris while attending the \"Salon du Jazz 1954\". She championed his work in the United States, writing the liner notes for his 1962 Columbia album Criss-Cross. She even took criminal responsibility when she and Monk were charged with marijuana possession by Delaware police in 1958, spending a few nights in jail. De Koenigswarter was sentenced to three years in prison. After a two-year legal battle that was financed by her family, the case was dismissed in a court of appeals on a technicality.\nShe was a regular visitor to many of New York's jazz clubs, including the Five Spot Café, Village Vanguard, and Birdland. In 1957, she bought a new piano for the Five Spot because she thought the existing one was not good enough for Monk's performances there. She also did the cover art for Bud Powell's album A Portrait of Thelonious. During the 1950s, she was licensed as a manager by the American Federation of Musicians. Her clients included Horace Silver, Hank Mobley, Sir Charles Thompson, and The Jazz Messengers. Horace Silver said about her : \"I recall playing a week with the Jazz Messengers at a jazz club in Youngstown, Ohio. The club owner refused to give Art Blakey any money because the band had started late several times and we hadn't drawn a crowd. There we were in Youngstown, Ohio, with a week's hotel bill to pay and none of us had any money. I could just picture myself being put in jail because I couldn't pay my hotel bill. But Art called the Baroness, and she wired us some money so we could pay our hotel bills and return to New York. She was a great lover of jazz music and a wonderful person.\" Sonny Rollins added : \"She realized that jazz needed any kind of help it could get, especially the musicians. She was monetarily helpful to a lot who were struggling. But more than that, she was with us. By being with the baroness, we could go places and feel like human beings. It certainly made us feel good. I don’t know how you could measure it. But it was a palpable thing. I think she was a heroic woman.”\nHampton Hawes recalled in his memoir Raise Up Off Me:\nAfter Monk ended his public performances in the mid-1970s, he retired to de Koenigswarter's house in Weehawken, New Jersey, where he died in 1982.\nShe used her wealth to pay for the funerals and burial grounds for several jazz musician friends, including Bud Powell, Sonny Clark and Coleman Hawkins.\nDedications\nThere are many compositions dedicated to her: Thelonious Monk's \"Pannonica\", Gigi Gryce's \"Nica's Tempo\", Sonny Clark's \"Nica\", Horace Silver's \"Nica's Dream\", Kenny Dorham's \"Tonica\", Kenny Drew's \"Blues for Nica\", Doug Watkins' \"Panonica\", Freddie Redd's \"Nica Steps Out\", Barry Harris's \"Inca\", Tommy Flanagan's \"Thelonica\", Frank Turner's \"Nica\" and more were all named after her. The San Francisco art rock band Oxbow released a recording entitled \"Pannonica\" (unrelated to the Thelonious Monk composition) with reissues of their 1991 album King of the Jews. A famous jazz club in Nantes, France, is called \"Le Pannonica\".\nLiterature\nDe Koenigswarter (Nica) appears prominently in \"El perseguidor\", a one-hundred page story by Julio Cortázar in the book Las armas secretas (The Secret Weapons, 1959). \"El perseguidor\", (\"The Pursuer\"), is a homage to Charlie Parker.\nIn October 2006, the French company Buchet Chastel published de Koenigswarter's book Les musiciens de jazz et leurs trois vœux (\"The jazz musicians and their three wishes\"). Compiled between 1961 and 1966, it is a book of interviews with 300 musicians who told her what their \"three wishes\" would be, and is accompanied by her Polaroid photographs. The book was edited for publication by Nadine de Koenigswarter, whom Nica always introduced to people as her granddaughter but who was in fact her great-niece. An English-language version was published in 2008 as Three Wishes: An Intimate Look at Jazz Greats.\nIn October 2023, Buchet Chastel published de Koenigswarter's book ''L'Oeil de Nica (\"The Eye Of Nica\"). A photobook of her photographs capturing jazz musicians but also views of Manhattan, moments captured in jazz clubs and deep America shots. A visual testimony to the American and particularly New York 1950-1960s, enhanced by the singular colors of the Polaroid. The photographs are from different boxes that were recently repatriated to France. Buchet Chastel also reissued the French edition of Three Wishes: An Intimate Look at Jazz Greats''.\nHer photographs were exhibited in 2007 at the Rencontres d'Arles festival.\nMedia depictions\nFilm\nNica was played by Diane Salinger in the Clint Eastwood biographical film Bird (1988) about Charlie \"Bird\" Parker. In the Eastwood-produced documentary film Thelonious Monk: Straight, No Chaser (1988) she is seen in library footage and heard in an interview.\nTelevision\nIn April 2009, a television portrait entitled The Jazz Baroness, written and directed by her great-niece Hannah Rothschild, was broadcast on the television channel BBC Four and repeated on 19 February 2012. It was broadcast in the US by HBO on 25 November 2009. A radio documentary by Rothschild of Nica, The Jazz Baroness, was broadcast on BBC Radio 4 on 12 February 2008. Rothschild has also written the biography detailed below.\nBiographies\n*  Youssef Daoudi, Monk!: Thelonious, Pannonica, and the Friendship Behind a Musical Revolution (2018)\n* Hannah Rothschild, The Baroness: The Search for Nica the Rebellious Rothschild (2012)\n* David Kastin, ''Nica's Dream: The Life and Legend of the Jazz Baroness (2011)\nPublished works\n*\n*\nFurther reading\n* The Women of Rothschild: The Untold Story of the World's Most Famous Dynasty'', Natalie Livingstone (2021)\nReferences\n}}\nFurther reading\n*Kastin, David (2006). \"Nica's Story: the Life and Legend of the Jazz Baroness\", Popular Music & Society, Volume 29, Number 3, July 2006, pp.&nbsp;279–298.\n*Montgomery-Massingberd, Hugh (1996), The Daily Telegraph Book of Obituaries: a Celebration of Eccentric Lives.  London: Pan.\n*\"La baronne du jazz\" - La vraie vie de légende de Pannonica de Koenigswarter by Stéphane Tamaillon and Priscilla Horviller (2020, French)\nExternal links\n*\n*\n*\n*"
    }
  ]
}