{
  "content": [
    {
      "type": "text",
      "text": "# Panorama (typesetting software)\n\n}}\nPanorama is a line layout and text composition engine to render text in various worldwide languages made by Bitstream Inc. Panorama uses Font Fusion as the base to support rendering of the text. The engine allows the user to manage different text formatting aspects like spacing, alignment, style effects (bold, embossed, outline, drop shadows etc.).\nPanorama provides support for OpenType font tables leading to automatic character substitution for ligatures, swashes, scientific figures, etc. Panorama supports three anti-aliasing modes  monochrome, grayscale, and LCD optimized (Horizontal and Vertical).\nVersion history\nPanorama has undergone several changes since its initial release as well as numerous additions of APIs to the core engine.\n{| class=\"wikitable\"\n! Major version\n! Minor version\n! Release date\n! Significant changes\n|-\n! rowspan=\"1\" | Version 1\n| style=\"white-space: nowrap;\"| 1.0\n| style=\"white-space: nowrap;\"| June 22, 2004\n| Initial release.\n|-\n! rowspan=\"1\" | Version 2\n| style=\"white-space: nowrap;\"| 2.0\n| style=\"white-space: nowrap;\" | June 20, 2005\n| New Shaping engine for complex language scripts. Support for bi-directional and mixed-directional text. Standard character set encoding supported (UTF-8, UTF-16, Unicode, and ASCII).\n|-\n! rowspan=\"1\" | Version 3\n| style=\"white-space: nowrap;\" | 3.0\n| style=\"white-space: nowrap;\" | August 14, 2006\n| Full support for Arabic, Hebrew, Indian, and Thai complex language scripts. Complete cursor rendering support. Support for multiple fonts.\n|-\n! rowspan=\"2\" | Version 4\n| style=\"white-space: nowrap;\" | 4.0\n| style=\"white-space: nowrap;\" | September 24, 2007\n| Support for transparency in all modes. Support for Macintosh platform including ability to render Mac font suitcases. Support for BREW platform. Language related enhancements resulting in better application of OTF rules and enhanced performance.\n|-\n| style=\"white-space: nowrap;\" | 4.5\n| style=\"white-space: nowrap;\" | April 10, 2008\n|Support for Unicode range-based and style-based font mapping. Alpha channel support in LCD mode. 32-bit Unicode support. Support for enhanced text view and editing with space wraps termination style. Support for Tab Stops on any platform.\n|-\n! rowspan=\"1\" | Version 5\n| style=\"white-space: nowrap;\" | 5.0\n| style=\"white-space: nowrap;\" | July 15, 2009\n| Support for fractional sizes and positions, text rendering text on paths, Unicode to Image mapping, and floating objects.\n|-\n! rowspan=\"1\" | Version 6\n| style=\"white-space: nowrap;\" | 6.0\n| style=\"white-space: nowrap;\" | May 10, 2011\n| Support for Thai shaping and OpenType rules, Unicode line breaking algorithm, font ratio, shadow width, and shadow color.\n|}\nFeatures\n* Support for Thai shaping and OpenType rules.\n* Enhanced support for the Unicode line breaking algorithm.\n* Better support for TV screens.\n* Enhanced font weight management and formatting support with font ratio, shadow width and shadow color.\n* Unicode Compliance  Full layout support for Unicode 5.0 and all international languages including complex scripting languages, such as Arabic, Indic, and Thai.\n* Supports bi-directional algorithms required to rearrange characters sequentially. For example, in languages such as Arabic, Hebrew, and Urdu the characters may be entered on a keyboard in one way, but need to be rendered in a correct way on a visual device.\n* Contextual Shaping  Applies contextual shaping to the characters, i.e., the characters are substituted, combined, or repositioned depending on the rules of the language.\n* Composes text in all worldwide languages, which includes various complex scripting languages such as:  Arabic, Indic, and Hebrew.\n* Supports key OpenType tables required for line layout such as, BASE, glyph definition (GDEF), glyph positioning (GPOS), and glyph substitution (GSUB).\n* Supports kerning information in OpenType fonts.\n* Text on Path  Enables text rendering along a path, outline, or a predefined shape.\n* Font Mapping  Supports script-based font mapping enabling the application to support multiple scripts at a single instance.\n* Style Mapping  Allows grouping of style-linked fonts to be treated as a single font. The engine \"knows\" to access a font’s own true-drawn style when you apply styles from the style menu.\n* Unicode Mapping  Supports automatic font switching based on the Unicode values of the text stream to be rendered.\n* Unicode-Image Mapping  Enables the developers to map a Unicode sequence to any image.\n* Paragraph Styling  Supports paragraph-specific formatting attributes including text alignment, letter/line spacing, and indentation functions.\n* Termination style  Facilitates the application to include an ellipses kind of termination style for the truncated text if the string does not fit inside the designated area.\n* Inline Images  Supports floating graphic object types that are inline with the text.\n* Rich-text Editing features, such as space wrap, tab stops, and dynamic property changes for inter-character space, line indents, and line gaps.\n* Supports industry-standard color formats, including monochrome, RGB, and BGR, with alpha channel support.\nFont Formats Supported\n* Multiple master fonts\n* WOFF fonts\n* Type 1\n* TrueType\n* TrueType collections\n* OpenType\n* Compact font format (CFF)/Type 2\n* TrueDoc Portable Font Resources (PFRs)\n* Bitstream Speedo\n* T2K\n* Font Fusion Stroke (FFS)\n* Embedded bitmaps (TrueType, TrueDoc, and T2K)\n* Windows bitmap font format FNT/FON\n* Bitmap Distribution Format (BDF)\n* Mac font suitcase (Dfont)\nCharacter Sets Supported\n{| class=\"wikitable\"\n| ARABIC || CHEROKEE || GUJARATI || KHMER || ORIYA || TAILE\n|-\n| ARMENIAN || CJK || GURMUKHI || LAO || PHAG || TAILU\n|-\n| BENGALI || COPTIC|| JAMO || LATIN || PHOENICIAN || TAMIL\n|-\n| BOPOMOFO || CYRILLIC || HANGUL || LIMBU || RUNIC || TELUGU\n|-\n| BRAILLE || DEVANAGARI || HANUNOO || MALAYALAM || SINHALA || THAANA\n|-\n| BUGINESE || ETHIOPIC || HEBREW || MONGOLIAN || SYLOTI || THAI\n|-\n| BUHID || GEORGIAN || HIRAGANA|| MYANMAR || SYRIAC || TIBETAN\n|-\n| BYZANTINE MUSIC || GLAGOLITIC || KANNADA || NKO || TAGALOG || TIFINAGH\n|-\n| CANADIAN || GREEK || KATAKANA || OGHAM || TAGBANWA || YI\n|}\nColor Formats Supported\n* Supports monochrome and grayscale format.\n* Supports industry-standard screen color formats including monochrome, RGB, and BGR.\n* Supports eight different pixel depths for R, G, B, and alpha channel in RGB or BGR format.\nText Style and Effects\n* Embossed\n* Engraved\n* Left and right drop shadows\n* Algorithmic obliquing\n* Algorithmic emboldening\n* Underline/Overline/Strikethrough (Single/Double/Dotted line)\n* Outlines\n* Colored border text styles\n* Superscript\n* Subscript\n* Flicker filter\n* User defined filter\nApplications/Operating Systems Supported\n* Cross-platform applications\n* Web (HTML) applications\n* Macintosh and Windows\n* BREW\n* Linux and UNIX\n* Embedded operating systems\n* Real time operating systems\nDevices Supported\nConsumer Electronic Devices, Mobile Handset, Set-top box, Digital TV, Printer, Medical Imaging Device, GPS System, Automobile Display, and other Embedded System\nSee also\n* Font Fusion\n* Bitstream Inc.\nReferences\nExternal links\n* [https://web.archive.org/web/20070831094826/http://www.bitstream.com/font_rendering/products/panorama/index.html Line layout engine for worldwide text layout, multilanguage, multilingual fonts, and international complex scripts]\n* [http://www.bitstream.com/corporate/news/index.html 2007 Bitstream Press Releases]\n* [http://www.embeddedtechjournal.com/news_2006/04/20060425_08.htm Embedded Technology Journal]\n* [https://web.archive.org/web/20071001005528/http://sec.edgar-online.com/2005/03/29/0001193125-05-063465/Section2.asp BITSTREAM INC 10-K, BITSTREAM INC Annual Report]"
    }
  ]
}