{
  "content": [
    {
      "type": "text",
      "text": "# Panty & Stocking with Garterbelt\n\n}}\n| creator      = Gainax\n}}\n| imprint      = Kadokawa Comics Ace\n| magazine     = Young Ace\n| first        = August 4, 2010\n| last         = June 4, 2011\n| volumes      = 1\n| volume_list  =\n}}\n|Jun Fukuda|Sōichi Tsuji|Satoshi Fujita|Kazuya Masumoto|Natsuki Uetake|Tomoko Suzuki|Katsumi Yasuda}}\n| writer       = Geek Fleet\n| music        =\n| studio       = Gainax\n| licensee     = Crunchyroll\n| network      =\n| first        = October 2, 2010\n| last         = December 25, 2010\n| episodes     = 13 (28 segments) + 1 OVA (8 segments)\n| episode_list = List of Panty & Stocking with Garterbelt episodes#Panty & Stocking with Garterbelt (2010)\n}}\n| producer     =\n| writer       =\n| music        = Various, , KM, TAAR, Monjoe, Yackle, Mitsunori Ikeda, and Junji Chiba}}\n| studio       = Trigger\n| licensee     = Amazon Prime Video\n| network      =\n| first        = July 10, 2025\n| last         = September 25, 2025\n| episodes     = 13 (30 segments)\n| episode_list = List of Panty & Stocking with Garterbelt episodes#New Panty & Stocking with Garterbelt (2025)\n}}\n, often shortened to just Panty & Stocking, is a Japanese anime television series produced by Gainax, as well as a series of tie-in media developed around it. The series ran from October to December 2010 on BS NTV and other channels. The rights to the series were later acquired by Trigger. A continuation, titled New Panty & Stocking with Garterbelt, aired from July to September 2025.\nStory\nThe series revolves around the exploits of the Anarchy sisters, Panty and Stocking, angels who were exiled from Heaven due to their bad behavior. They are sent to Daten City,}} a place on the border between Heaven and Hell, where they live at the church Cemetery Hills under the care of the reverend Garterbelt. The city is besieged by evil spirits referred to as Ghosts, which the sisters are tasked with destroying through their ability to transform their lingerie into weapons. By doing so, the sisters earn Heaven Coins with which they intend to one day buy their way back into Heaven. However, Panty and Stocking are constantly sidetracked by their respective addictions to sex and sugary sweets.\nThroughout the first season, the Anarchy sisters clash with their demonic counterparts, the Demon sisters Scanty and Kneesocks, who oversee the production of Ghosts in Daten City. The Demon sisters serve under Corset, Daten City's mayor, who seeks the blood kin of Hell's Monkey to unlock the gates to Hell and unleash the evil forces within; this kin is eventually revealed to be Brief, the Anarchy sisters' occult geek friend, whose penis functions as the required key. After Panty and Stocking thwart Corset, the season concludes with a cliffhanger twist ending in which Stocking kills Panty, reveals herself to be a demon, and joins forces with a significantly weakened Corset.\nIn the second season, Stocking's demon nature is revealed to be the work of Corset's brainwashing, and a resurrected Panty returns her to normal with the aid of Scanty and Kneesocks; the Demon sisters are consequently banished from Hell, while Corset is killed. Afterward, the Demon sisters take up residence at Cemetery Hills as reluctant allies to the Anarchy sisters, sharing a similar mission of collecting Hell Coins required for their own return home. The four also compete against the Anarchy sisters' cousins, the angel brothers Polyester and Polyurethane, who harbor their own agenda against the angel sisters.\nDevelopment\nFollowing the broadcast of director Hiroyuki Imaishi's previous project, Gurren Lagann, the series' staff went on a trip for rest and relaxation. At that time, they shared their opinions to each other under drunken and humorous circumstances, saying such things as \"Next time, I want to try this\" in approaches to animation. Almost all of the concepts for the anime were made during the initial trip; the names of the main characters, \"Panty\" and \"Stocking\", were coined at the very first meeting. Hiromi Wakabayashi, who provided the initial idea for the series, cited American adult animation, such as Drawn Together, as inspiration for its crudeness.\nCharacters\nMain\n;|パンティ|Panti}}\n:  Courtney Lin (second series)}}\n:The older Anarchy sister, Panty is a blonde-haired angel whose only interests are looking for men to have sex with and basking in the popularity of being an Anarchy sister. She does not take her Ghost-hunting duties as seriously as Stocking, preferring to fulfill her personal goal of having sex with 1,000 men on Earth before returning to Heaven. Her underwear transforms into a pistol called . She occasionally wields a second Backlace using Stocking's underwear, doubling her firepower and allowing her to combine them into more advanced firearms such as a submachine gun or sniper rifle. She can weaponize male underwear, though the weapon's size and usefulness depends on the size of the original wearer's penis.\n;|ストッキング|Sutokkingu}}\n:\n:The younger Anarchy sister, Stocking is a pink-and-violet-haired goth angel with a gluttonous appetite for sugary foods. While she does not have the same level of interest in sex as her older sister, Panty, she does show sexual urges and interests and is generally more interested in masochistic activities, such as bondage and electrocution. Her stockings transform into a pair of katana called  and . She owns a stuffed cat doll called , which changes its facial expressions in accordance with Stocking's mood.\n;|ガーターベルト|Gātāberuto}}\n:\n:The reverend of Daten City, and the Anarchy sisters' guardian. Garterbelt is a large black man with a massive afro. He relays missions from Heaven to Panty and Stocking, practices bondage, and displays interest in young males, particularly Brief, disguising himself as a masked figure called \"Master G\" while undertaking such hobbies. He is cursed with immortality and forbidden from dying until he fulfills his given task.\n;|チャック|Chakku}}\n:\n:Panty and Stocking's sidekick, a green dog-like creature with zippers on his body who closely resembles the character GIR in his own dog disguise from the American animated series Invader Zim. Chuck is often subject to mortal injuries. He can only be immobilized by opening the zippers on his head and releasing his brain, a 2-inch tall incubus who is romantically involved with Fastener's brain. He is used by Heaven as a mailbox of sorts, getting struck by lightning and spitting out a piece of paper containing a clue to a Ghost's whereabouts. He transforms into a Bull Ghost by turning himself inside-out.\n;|ブリーフ|Burīfu}}\n:\n:A self-proclaimed ghost hunter with an interest in science fiction and the supernatural, for which he is nicknamed \"Geek Boy\" by Panty and Stocking. Brief is enamored with Panty and tries acting as the voice of reason for the Anarchy sisters, but instead becomes the butt of many jokes in the series. His true identity is , the handsome son of head of the Rock Foundation, a large corporation in Daten City.\n;\n:The monsters of the week in the series, Ghosts are twisted aberrations born from the regrets or suffering of people who have died and become lost in limbo. Panty and Stocking are tasked with their destruction, which allows them to pass on to Heaven, leaving behind Heaven Coins. Although most Ghosts are savage or destructive, some are relatively harmless annoyances or even oppose their true nature and try to live peacefully. Ghosts are usually slain with angelic weapons, but there are other means of destroying them, such as Ghosts killing each other or peacefully accomplishing what they wanted to achieve in life. As a recurring joke, whenever Panty and Stocking defeat a Ghost with their angelic weapons, a styrofoam model of the Ghost is filmed being blown-up.\nRecurring\nIntroduced in season 1\n;|スキャンティ|Sukyanti}}\n:\n:The older of the Demon sisters, and Panty's arch rival. Scanty is a red-skinned demon with green hair and two horns. She is egotistical and prone to angry outbursts when her pride is hurt. She wears two pairs of scanties that transform into revolvers called , which she can combine into a shotgun.\n;|ニーソックス|Nīsokkusu}}\n:|Cherami Leigh (first series),|Krysta Gonzales}}\n:An arms dealer and friend of Brief who develops and sells lingerie that transforms into weapons, which are stored in a pocket dimension called the \"Pants Dimension\". Her public persona is a glasses-wearing geek nicknamed \"Geek Girl\".\n;|ラミー|Ramī}}\n:\n:The Anarchy sisters' uncle, father of Polyester and Polyurethane, younger brother of the king of Heaven, and Supreme Overseer of Heavenly Ethics. He allows his sons to plot against his nieces.\nMedia\nAnime\nList of Panty & Stocking with Garterbelt episodes}}\nThe television series was directed by Hiroyuki Imaishi and animated by Gainax. The series' animation is done in a distinct style resembling and paying homage to American cartoons, along with the Yoshinori Kanada techniques normally associated with Hiroyuki Imaishi's work. The theme of the anime is \"vulgar and indecent jokes\", with Imaishi saying, \"If we are going to do this, we will try it thoroughly.\" As a result, the series contains sexual themes and humor in every episode.\nThe series ran from October 2 to December 25, 2010, on BS NTV and other channels. It was also shown on AT-X seven days after the premiere of each episode, and made available online on Nico Nico Channel (a service of Niconico) through the series's own channel a day after the AT-X broadcast. Internationally, the series was made available for streaming on Crunchyroll.\nThe series was released in six DVD and Blu-ray volumes, respectively, over the course of six months, with the first DVD/Blu-ray volume released on December 24, 2010, followed by succeeding volumes near the end of each following month. The fifth volume, released on April 28, 2011, includes a disc-exclusive episode (OVA) compiling eight short stories, some of which are sequels/conclusions to earlier episodes of the series.\nOn April 14, 2011, Crunchyroll (formerly Funimation) announced they licensed the series in North America, which was released on DVD on July 10, 2012. The Blu-ray version was released January 15, 2013. The English dub was directed by Colleen Clinkenbeard, with John Burgmeier acting as head writer and Jamie Marchi, Leah Clark, and Jared Hedges serving as episode writers. The first two episodes were made available for streaming on May 22, 2012, for those subscribed to Funimation's Elite Video Subscription service.\nManga Entertainment released the series in the United Kingdom on July 30, 2012, although upon release, faults were discovered on some of the episodes. A corrected version was released on September 10, 2012.\nOn November 25, 2016, the official Twitter account for Gainax West posted an announcement teaser image featuring silhouettes of Panty and Stocking with the words \" Soon\". An announcement for \"something new with Panty & Stocking with Garterbelt\" was to be made on December 16, 2016, which Gainax West stated would not be a pachinko, pachislot, social network game, or Blu-ray. On December 16, 2016, various Panty & Stocking with Garterbelt projects were announced.\nA new anime project based on the series was announced by Studio Trigger at Anime Expo 2022. At Anime Expo 2023, it was announced that the rights to the Panty & Stocking IP had been acquired from Gainax by Trigger, who shared an announcement video for the project. Imaishi returned as series director, with Imaishi himself also handling series composition alongside Hiromi Wakabayashi and Atsushi Nishigori as character designer. The series world premiere event was held at Anime Expo 2025 on July 4, 2025, marking the 15th anniversary of the original series. A censored version of the series premiered on July 10, 2025, on Tokyo MX, BS NTV and other channels, while the uncensored version premiered on AT-X on July 15. TVアニメ「New PANTY & STOCKING with GARTERBELT 」公式サイト|website=newpsg.com|access-date=July 9, 2025|archive-url=https://web.archive.org/web/20250709102417/https://newpsg.com/onair/|archive-date=July 9, 2025|language=ja|url-status=live}}}} Amazon Prime Video licensed the second series for a global streaming release.\nManga\nA manga adaptation of the series by Tagro was serialized in Kadokawa Shoten's Young Ace magazine between August 2010 and June 2011. The series was compiled in a single  volume, released in Japan on June 4, 2011, and was published in English by Dark Horse Comics on May 28, 2015. Another manga illustrated by Imaishi was serialised in NewType before moving to Monthly Anime Style magazine. Some strips were included in the Panty & Stocking with Garterbelt: Datencity Paparazzi art book, released on June 4, 2011, but the series has not been published in tankōbon format.\nMusic\n| recorded     =\n| venue        =\n| studio       =\n| genre        = * Electronic\n* dance\n| length       =\n| label        = FlyingDog\n| producer     = Taku Takahashi\n| prev_title   =\n| prev_year    =\n| next_title   =\n| next_year    =\n}}\nThe series' musical score was composed by TCY Force and produced by Taku Takahashi (of M-Flo). The opening theme is \"Theme for Panty & Stocking\", performed by Hoshina Anniversary. The ending theme is \"Fallen Angel\", performed by Mitsunori Ikeda and featuring Aimee B. The original soundtrack was released on December 29, 2010. A hidden track is on the CD. The special edition of the volume 4 BD/DVD includes a bonus CD containing television edits of certain songs from the official soundtrack, as well as previously unreleased songs.\n| recorded     =\n| venue        =\n| studio       =\n| genre        = Electronic, dance\n| length       =\n| label        = flying DOG\n| producer     = Taku Takahashi\n| prev_title   =\n| prev_year    =\n| next_title   =\n| next_year    =\n}}\nA second album, Panty & Stocking with Garterbelt THE WORST ALBUM, was released on 20 July 2011 and features 24 tracks, including remixes of previous songs from the original anime soundtrack, some new songs, as well as \"Cherry Corrida\" drama tracks.\nCritical reception and cultural impact\nPanty & Stocking received a polarized reaction from critics. Carl Kimlinger of Anime News Network found the series to be \"unremittingly revolting\" and \"generally not funny\". Anime News Network's individual episode reviews were equally critical, accusing the series more than once of having a style-over-substance approach and generally flawed, tasteless and needlessly disturbing comedy in spite of its impressive production values. Reviewer Gia Manry found the visuals and sounds to be overwhelming and the writing substandard, concluding the review with a 1 out of 5 score. Critic Jacob Chapman considered the series to be a \"mess\" with a \"poisonous air hanging around [it]\" and thoroughly unpleasant to sit through.\nHowever, David Brothers of Comics Alliance said that the series felt like the result of an \"unholy union\" between The Ren & Stimpy Show and Dirty Pair. He recommended it, saying \"it's raunchy, gross, a whole lot of fun\" and that \"the mix of disparate influences and material makes it a refreshingly funny anime, and dumb in a way where you can clearly see the hand of smart, experienced animators at work behind the scenes.\" Mike LeChevallier of Japanator said that \"where plot structure is hit or miss, the pure stylization, soundtrack and memorable characters make this a series one worth watching from start to finish.\"\nIn 2011, Panty & Stocking with Garterbelt was part of the Jury Selections of the 15th Japan Media Arts Festival in the Animation category. In 2019, Polygon named Panty & Stocking with Garterbelt as one of the best anime of the 2010s, stating that it \"delivered raunchy, stupid humor in a great animation style\", while Crunchyroll listed it in their \"Top 100 best anime of the 2010s\" list. IGN also listed Panty & Stocking with Garterbelt among the best anime series of the 2010s, describing it as \"an irreverent, entertaining joy-ride with dozens of tributes to western cartoons and a bangin' soundtrack\".\nNew Panty & Stocking with Garterbelt has received generally positive reviews. Critics have praised Studio Trigger's updated animation and character designs for capturing the original series' style while utilizing modern techniques. Joshua Fox of Screen Rant described the original 2010 series as \"one of the wildest anime ever produced\" by the studio's founders, noting its raunchy dialogue and visuals for maximizing absurdity. He observed that while the series did not achieve the same recognition as other Studio Trigger projects, it is still held in high regard. According to Gizmodo, the show is often characterized as a fusion of the style of The Powerpuff Girls with the crass humor of Adult Swim, and it became a cult favorite for its brazen comedy and exaggerated action.\nThe performances of the new English voice cast received a mixed reception from critics, with many fans expressing dissatisfaction, particularly noting that the new cast did not match the original cast and lacked their charm. The transition in licensing from Crunchyroll for the first season to Amazon Prime Video for the second season was also a point of disappointment for long-time fans. While critics acknowledged the new cast, many fans felt the recasting diminished the series' humor and character dynamics, reflecting a broader preference for the original cast.\nNotes\nReferences\nExternal links\n*  (New)\n*\n*\n*"
    }
  ]
}