{
  "content": [
    {
      "type": "text",
      "text": "# Paradox (warez)__disambig_1\n\n| extinction    =\n| type          =\n| status        =\n| purpose       = Quality deprotections / Demo\n| headquarters  =\n| location      =\n| coords        =\n| region_served =\n| membership    =\n| language      =\n| general       =\n| leader_title  = Origin\n| leader_name   =\n| leader_title2 = Platforms\n| leader_name2  =\n| leader_title3 = Founders\n| leader_name3  = Bad BoyBlackHawkOlivierStinger (Exit)Clash\n| leader_title4 = Products\n| leader_name4  =\n| key_people    =\n| main_organ    =\n| parent_organization =\n| affiliations  =\n| budget        =\n| num_staff     =\n| num_volunteers =\n| website       = [https://web.archive.org/web/20070106101825/http://www.paradogs.com/ www.paradogs.com] (via Internet Archive)\n| remarks       =\n| former name   =\n}}\nPARADOX (PDX) is a warez–demogroup; an anonymous group of software engineers that devise ways to defeat software and video game licensing protections, a process known as cracking, which is illegal in most jurisdictions. They distribute cracks (software patches), keygens (key generators), and pre-cracked versions of entire programs. Over the years, distribution methods have changed, starting out with physically transported floppy disks and BBS distribution. Today most of their files reach the public over various peer-to-peer file networks.\nfor Paradox's release of Spyro: Year of the Dragon, which was infamous because early versions of the release failed to defeat the game's complicated copy protection]]\nParadox was originally formed in late 1989 by members of the Danish group Trilogy (Bad Boy, Black Hawk, Tas, Pcsu, QRD) and the French group M.A.D (Olivier, Stinger, The Surge, Clash, Tagada). They began by cracking Amiga software. The original group shut down voluntarily in 1991 when the most active members joined Quartex, but was later reborn under the leadership of 'Maximilien' in 1993, with ex-Quartex members Black Hawk and Paragon as co-founders. Maximilien worked previously for Nemesis, Crack Inc, Skid Row and Interpol (his first group as organiser) before finally joining Paradox. Paradox then moved into the Sega Genesis and SNES console scenes. They started cracking PC software in 1994. At the end of 2000, they cracked PlayStation game Spyro: Year of the Dragon, notable for the stringent anti-piracy measures programmed by Insomniac Games. Due to the extensive measures, the game's protection was initially not fully defeated, resulting in certain deliberately-programmed \"glitches\" to appear; Paradox released a fixed, working version for both NTSC and PAL versions two months later. In 2001, they released their last cracked game for PlayStation, and it was the popular video game Final Fantasy IX. In 2002, the team recruited computer black hat Evilgood, who is alleged to be one of the most qualified crackers of the time. His identity is still unknown. They have cracked games for other consoles and hand-held devices like the PlayStation, PlayStation 2, PlayStation Portable, Dreamcast, Nintendo 64, GameCube, Wii, and Xbox.\nParadox has been noted to crack challenging dongle protections on a number of debugging and software development programs. The team also successfully found a method of bypassing activation in Windows Vista. This was accomplished by emulating an OEM machine's BIOS-embedded licensing information and installing an OEM license. However, with Windows Vista Service Pack 1, this crack no longer works correctly; later crack tools exist that could remove Paradox's cracking method. In 2009, Paradox was first group to release SLIC 2.1 details and a working crack for Windows 7. In July 2020, the group released an up to date crack for Monster Hunter World: Iceborne for PC, a game protected by Denuvo Anti-Tamper, a protection widely known for being hard to crack. Paradox had members such as D3stY (d3zxor) and Genius specialized in dongle reverse engineering and patching for hardware dongles such as Rainbow Computer - Sentinel Dongle.\nDemoparty awards\n* First place in the Wild Compo category at Euskal 2001\n* First place in the Amiga 64 category at Saturne 1994\n* First place at Alcatraz Pentcost 1990\nRaids and arrests\nOne of their members going by the alias 'Rokman' was arrested in 1990 for using stolen credit card numbers to make $1 million in long-distance calls to other Paradox members for the purpose of file transfers.\nNearly all Quartex members in France, including Olivier, Clash and Tagada, were busted in 1991 in the Blue Box affair.\nMax 'MAXiMiLiEN' Louarn was arrested in the Nintendo copiers affair in 1993 and was held in preventive custody for three weeks before fleeing to Spain. Less than one year later, in 1994, Secret Service agents caught him while on trip to Washington in a vast calling card fraud affair. He was sentenced to 5 years and 8 months by a US court.\nLouarn was arrested again in October 2020 for taking part in creating and selling various circumvention devices for consoles such as the Nintendo Switch and the Nintendo 3DS.\nSee also\n* List of warez groups\n* Warez scene\n* Demoscene\n* Standard (warez)\nReferences\nExternal links\n* Official Website – Paradogs.com (down) [https://web.archive.org/web/20070321172523/http://www.paradogs.com/ archived version] via Wayback Machine\n* Official Community – Sceneboard.Paradogs.com (down)\n* [http://www.pouet.net/groups.php?which=156 An archive of Paradox demos]\n* [http://amp.dascene.net/newresult.php?request=groupid&search=3369 Their Amiga musicians and musics]\n* [http://www.keygenmusic.net/?page=team&teamname=paradox&lang=en Their music]"
    }
  ]
}