{
  "content": [
    {
      "type": "text",
      "text": "# Paraguayan War casualties\n\n, 1866. An early instance of war photography by Bate & Cía of Montevideo.]]\nThe number of people who died in the Paraguayan War (1864–1870) is unknown. Widely diverging estimates have been made. \"Determining the size of Paraguay's population has always been an exercise in frustration.\" However, there is a widespread impression that the casualties (military and civilian) were immense; there was also some population loss from non-lethal causes such as migration. The Dutch human geographer Jan Kleinpenning thought that Paraguay lost between a quarter and a half of its population, but much higher and lower estimates have been made.  No academic demographic scholarship makes it less than 7% (including migration) or greater than 69%.\nTraditional estimate\nThe traditional estimate was that the War cost Paraguay at least half its population including military and civilian casualties (the latter mainly owing to disease, dislocation and malnutrition) and that 90% of males of military age died. Assuming that to be so, the Paraguayan War must have been 10 to 20 times more lethal than the slightly earlier American Civil War. The traditional estimate was based partly on anecdotal evidence and partly on a supposed census of 1857 (which, according to Reber, never took place) according to which Paraguay had a prewar population of about 1.3 million; implying an utterly catastrophic decline in the subsequent War.  The following extract from an unsigned article in the 1911 edition of the Encyclopædia Britannica: is illustrative of the spurious precision of the era.\nDuring this warfare every male Paraguayan capable of bearing arms was forced to fight, whole regiments being formed of boys from 12 to 15 years of age.  Even women were used as beasts of burden to carry ammunition and stores, and when no longer capable of work were left to die by the roadside or murdered to avoid any ill consequences occurring from their capture.  When the war broke out the population of Paraguay was 1,337,439; when hostilities ceased it consisted of 28,746 men, 106,254 women above 15 years, and 86,079 children.  During the retreat of the Paraguayans the dictator ordered every town and village passed through to be razed to the ground, and every living animal for which no use could be found to be slaughtered.  When the end came the country and people were in a state of absolute prostration.\nOn those figures, since shown to be false, Paraguay lost 84% of its population.\nIn the modern mainstream media, the view that the loss in life was likely around half the population has been expressed by, among others, the current Encyclopædia Britannica entry (last revised in 2001) and a 2012 article in The Economist. In 2015, the BBC and Reuters stated Paraguay \"lost more than half of its population\", and the Los Angeles Times stated \"at least 70% of Paraguay's male population was killed\". The Paraguayan war casualties have been listed in Guinness World Records as the highest percentage of a country's dead toll from war.\nModern demographic scholarship in peer-reviewed journals\nThe first step in modern research was realising that prewar Paraguay's population could not possibly have been 1.3 million.\nJohn Hoyt Williams\nIn 1976, John Hoyt Williams published 'Observations on the Paraguayan Census of 1846'.  He analysed 20,000 pages of documentation surviving from an 1846 census of Paraguay ordered by the dictator Carlos Antonio López.  Correcting the raw figures for missing returns, he arrived at an estimated population of the order of 240,000 for the year 1846.  To estimate the population for the year before the War (1864) he assumed various growth rates, yielding a range between about 373,000 (annual growth rate 2.5%) to about 575,000 (annual growth rate of 5%). He remarked that “even the highest figure is far short of what is usually claimed by historians not utilizing hard data”.  In his opinion the most likely growth rate was 3%, implying a population of about 407,000.  He concluded:\nThe oft-posited figure of a million or more Paraguayans in 1864, in the absence of immigration, is absurd.\nThe Reber/Whigham–Potthast controversy\nVera Blinn Reber\nThe traditional view was challenged even more strongly by historian Vera Blinn Reber in 1988 in 'The Demographics of Paraguay: A Reinterpretation of the Great War, 1865–1870'.  Noticing that, even with the most sophisticated weapons of military destruction available after 1914, population losses in war were never remotely of the 50% order, she examined the traditional estimates with some scepticism.\nShe noted that, hitherto, mortality estimates had depended on comparing various censuses of the Paraguayan population before and after the war.  However, she claimed that the census data that had been used were not reliable. In particular, a supposed 1857 census, relied on by earlier historians, and which gave Paraguay a population of 1.3 million, was illusory and had never taken place, being mere government propaganda of the time. For Reber, there were only four Paraguayan censuses of even relative accuracy: 1792, 1846, 1886 and 1899. She accepted John Hoyt Williams's estimate for 1846, then created a curve by applying the technique of log-linear least squares regression to those four censuses, and achieved a best fit with an annual population increase of 1.48% (which, she argued, was compatible with what was known of other 19th century Latin American growth rates). She thus estimated the Paraguayan population on the eve of the war as of the order of 300,000.\nAs a separate and distinct point, an examination of the sex ratio after the war provided further evidence that mortality was lower than often assumed. The census of 1886 reported that there were 3 female Paraguayans for each male over 30 years old – not the 10:1 ratio often suggested.\nHer conclusion was:\nMy analysis of comparative rates in nineteenth-century Latin America, together with a re-evaluation of the Paraguayan censuses and household structure, indicates that the War of the Triple Alliance actually cost Paraguay between 7 and 18.5 percent of its prewar population… The evidence demonstrates that the Paraguayan population casualties due to the war have been enormously exaggerated.\nCauses of Paraguay population loss\nAccording to Reber's estimates, not all of the Paraguayan population loss during the war was caused by mortality. Some must have been owed to migration or loss of territory.  Her estimates were as follows.\n{| class=\"wikitable\"\n! Minimum !! Cause!! Maximum\n|-\n| 5.0% || Military|| 8.0%\n|-\n| 1.0%|| Cholera || 3.0%\n|-\n| 0.5% || Yellow fever || 1.0%\n|-\n| 1.0% || Other disease || 3.0%\n|-\n|1.0%|| Migration || 3%\n|-\n| 0.2% || Loss of territory || 0.5%\n|}\nWhigham and Potthast\nReber was challenged by Whigham and Potthast in 'Some Strong Reservations: A Critique of Vera Blinn Reber's \"The Demographics of Paraguay: A Reinterpretation of the Great War, 1864–70\"'. They did not take issue with Reber's finding that the supposed 1857 census was spurious. But they said that there was no reason to assume the Paraguayan birthrate was the same as in other Latin American countries, because the Paraguayan culture was unique. They asked what could have caused the 'traditional' population loss estimates to be made, and argued that even if the evidence was anecdotal it could not simply be ignored. In a brief reply, Reber in effect said the Whigham–Potthast critique, by failing to embrace demographic techniques, was non-responsive.\nIn a footnote in an article in the Journal of Latin American Studies Mario Pastore said that Whigham and Potthast, in attacking Reber's estimate, had misrepresented it; but, on the other hand, had failed to notice one of its weakest points, namely, \"that it was based on a non-linear regression with very few degrees of freedom\".\nThe ‘Paraguayan Rosetta Stone'\nIn 1999, Whigham and Potthast returned to the fray.  Their new paper contained two strands.\nFirst, they argued that John Hoyt Williams’ population estimate based on the 1846 census needed to be raised; he was working with incomplete data (missing parishes, and undercounting of some ethnic groups and children).  Furthermore, 1846 was only two years after a smallpox epidemic which must have reduced the population anyway.  Accordingly: we feel safe in arguing that Paraguay had a population somewhere between 420,000 and 450,000 at the beginning of the war.\nThe second strand was the recent discovery (by a Major Hugo Mendoza) in the Paraguayan national archives of a census for the year 1870.  This census had been ordered by the Provisional Government i.e. the government in Paraguay that operated under the occupying Allied armies.  Whigham and Potthast hailed this discovery as the ‘Paraguayan Rosetta Stone' and called their article 'The Paraguayan Rosetta Stone: New Insights into the Demographics of the Paraguayan War, 1864 -1870'.\nAfter considering the data they said as follows:\nHow many Paraguayans died or were displaced by the War of the Triple Alliance?  All our findings indicate that the number must have been tremendous. Previous references to an 18 percent loss, a 30 percent loss, or even a 50 percent loss must now be set aside. The true figure appears to have reached 60 to 69 percent.\nThis paper attracted criticism from the Dutch human geographer Jan Kleinpenning  in his paper 'Strong Reservations about “New Insights into the Demographics of the Paraguayan War” '.  Kleinpenning asked how they knew that the census was reliable seeing that in 1870 “Paraguay was a thoroughly damaged and disorganized country”.  Unless one assumed an unfeasible large growth rate its figures conflicted with later censuses.  He also criticised the paper for failing to use certain population data, long available in German language sources, including an 1873 census that put the population at 221,079.  Summarising his criticism, Professor Kleinpenning wrote:To conclude, it appears that Whigham and Potthast have too readily considered the 1870 census results reliable data, enthusiastic as they were about having found a new source of information on Paraguay's postwar population. They have paid too little attention to other postwar figures and the work of Reber.\nHowever, despite those criticisms, while not able to support the more extreme figures traditionally claimed, Kleinpenning concluded as follows:\nBecause Whigham and Potthast have made a serious attempt to correct the results of the 1846 census and the annual growth rate they assume seems to be realistic, I am inclined to take their 1846 figures as the basis. In that case, population losses due to the war rank between 43.1 and 51.5 percent.  This range is less than the 60 to 69 percent suggested but still perfectly in line with what always has been said: when the War of the Triple Alliance ended, Paraguay had lost about half its population.  The losses were, in my opinion, somewhat less dramatic than Whigham and Potthast calculated.  Yet this interpretation remains a sad one.  The most optimistic calculation that can be drawn, using Reber’s figure, is that at least a quarter of the Paraguayan population was lost.\nIn her own response 'Comment on “The Paraguayan Rosetta Stone”' Professor Reber did not have a high opinion of this Rosetta Stone.\nThe challenge of obtaining a complete census in 1870 must have been daunting.  The Allied Powers (Brazil, Argentina and Uruguay) had established a provisional government in Asunción, and Paraguay was in the process of creating a new constitution.  Brazilian troops did not evacuate Paraguay until June of 1876…\nEven assuming that it was in the interest of the Allied Powers to conduct a census, to what degree would Paraguayans have cooperated?  Before the war, the Paraguayan government carried out censuses on crop production and the availability of men for the military.  Previous Paraguayan experience with military recruitment may have led potential respondents to avoid cooperating with any government in census taking…\nThe 'Rosetta Stone' seemed even more dubious in the light of the ensuing census:\nWhigham and Potthast's analysis of the 1870 count becomes more questionable on comparing it with the 1886 census…  If one accepts both the Whigham and Potthast count and [the] revised census for 1886, the Paraguayan population would have grown in sixteen years from 166,351 to 329,645.  No country can possibly double its population in sixteen years without heavy immigration.  No such record [of immigration] exists for Paraguay.\nIn their reply 'Refining the Numbers: A Response to Reber and Kleinpenning' Whigham and Potthast attacked Reber's paper.  Here we summarise their responses to her two main points, viz. that a census carried out by defeated Paraguayans on the orders of a provisional government upheld by the occupying Allies was unlikely to be reliable, and that its count implied an unfeasible population increase in the ensuing sixteen years.\nTo the first of those points Whigham and Potthast offered the following reply:\nReber speculates that \"previous Paraguayan experience with military recruitment may have led the people to avoid cooperating with any government in census taking\".  This observation is ahistorical, as well as being beside the point.  By late 1869, the Paraguayan Army had largely disintegrated, and no recruitment was in progress.  No villager could mistake the head-counting of a locally known individual for the brutal incursions a press-gang,  In this instance, Reber is fishing in a dead pond.\nTo her second point (it was also made by Kleinpenning) they replied:\n[T]here was nothing normal about the postwar era, least of all the birthrate.  In a population with four or five times as many women as men and with a male occupying army present, birthrates not only could but must have been higher than under normal circumstances. Thus any back-projected corrections derived from a supposedly \"normal birthrate\" in the 1880s yield nothing but weak speculations.  They cannot negate the 1870 findings of the jefes, who had no reason to doubt the tragic scene unfolding before them.\nAllied losses\nThe Whigham-Potthast and Kleinpenning papers did not address Allied losses, but Reber noted:\nThe problem of evaluating military mortality in the War of the Triple Alliance is complicated by the unrealistic estimates of Argentine, Brazilian and Uruguayan troop size.  According to an agreement between the allies, Argentina was obligated to contribute 25,000 men, the Banda Orientals 5,000, and Brazil 40,000.  At the beginning of 1865 Brazil and Uruguay were apparently 20 percent below the requirement, while Argentina sent less than 50 percent of the required troops.  The determination of the Paraguayans and the cost of the war for the allies probably meant that total number probably never very much exceeded the initial numbers, although new troops were sent to replace the wounded, dead and deserted.  In August 1867, the allies numbered approximately 43,500 troops, of which 36,000 were Brazilians, 6,000 Argentines and 1,500 Uruguayans.  Moreover the lack of food, horses, cattle and shelter for the army meant that the situation for the allied troops remained difficult.  In any case, since the exact number of troops sent to fight Paraguay is unknown—and the number has in all likelihood been exaggerated—it is probable that the military losses of Argentina, Brazil and Uruguay have also been magnified.  Given the small number of troops that Argentina fielded at any given time, a recent estimate of 30,000 or 1.6 percent of total prewar population is clearly unrealistic.  Military losses suggested for Brazil range from 23,917 to 165,000, and the upper ranges are obviously distorted.\nOther views\nIn a 2016 trip to Israel, Paraguayan President Horacio Cartes told Prime Minister Benjamin Netanyahu that Paraguay \"has had a Holocaust\", stating that Paraguay lost \"practically all our population\" in the Paraguayan War.\nRevisionist positions\nIn the years 2021 - 2023, a special committee was established within Parlasur to study the real extent of the damage caused by the Paraguayan War. The hearings (15 in total) took place mainly in Paraguay but also in Argentina, Uruguay and Brazil.\nThese hearings caused favorable repercussions in Argentina, Uruguay and especially in Paraguay. However, the hearings were considered \"questionable\" and \"inaccurate\" by Brazil.\nThe results of the hearings were analysed and published in a Special Report in 2023. According to this report, Paraguay suffered \"severe, massive and systematic war crimes and crimes against mankind\", and this was approved by representatives of Parlasur from Argentina, Paraguay and Uruguay, but it was vetoed by representatives of Brazil.\nAccording to this Special Report, the Paraguayan population prior to the War was \"minimally\" around 700,000 inhabitants and the loss of life estimated at around 500,000 - 550,000 Paraguayans who died during the conflict.\nAnother investigation, closely related to this \"Special Committee\" of Parlasur, was published in Paraguay. The authors, with a \"maximalist approach\" favorable to the Paraguayan position, claim that the population of Paraguay in the year 1864 when the War broke out, was around 1,200,000 inhabitants. They assert in most research about Paraguayan losses during the Paraguayan War, the suffering of the Paraguayan population is largely neglected (especially during the \"Occupation period\" of 1869 - 1879) and \"hundreds of thousands\" continued perishing during those subsequent years because of diseases, starvation and other sufferings.\nNotes\nSources\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*"
    }
  ]
}