{
  "content": [
    {
      "type": "text",
      "text": "# Parachute Training Center: Edwards AFB Jump Tower\n\n-->\n| type                =\n| manufacturer        = Intamin\n| designer            =\n| model               = Parachute Tower 1200\n| theme               =\n| height_ft           = 250\n| vehicle_type        = Parachute\n| vehicles            = Parachutes\n| riders_per_vehicle  =\n| rows                =\n| riders_per_row      =\n| participants_per_group=\n| capacity            = 12\n| duration            =\n| restriction_ft      =\n| restriction_in      =\n| restriction_cm      =\n| virtual_queue_name  =\n| virtual_queue_image =\n| virtual_queue_status=\n| single_rider        =\n| pay_per_use         =\n| custom_label_1      =\n| custom_value_1      =\n| custom_label_2      =\n| custom_value_2      =\n| accessible          =\n| transfer_accessible =\n| assistive_listening =\n| cc                  = }}\nParachute Training Center: Edwards AFB Jump Tower (originally known as '''Parachuter's Perch''') was a 250-foot-tall Intamin Parachute Drop ride that operated at Six Flags Great Adventure. Located in the Boardwalk section of the park, the ride opened in 1983 as Parachuter's Perch. The ride closed by the end of the 2022 season, and stood dormant until its demolition in December 2024. The tower's height made it a prominent icon in the park's skyline for 40 years.\nHistory\nThe ride originally opened on April 8, 1978, as the Sky Chuter at Six Flags Over Mid-America (now Six Flags St. Louis). In 1982, the ride was closed, disassembled, and relocated to Six Flags Great Adventure; after being reassembled, it opened on June 9, 1983 as Parachuter's Perch., and Eruption sky sling ride. (Demolished)|left]]\nWhen Parachuter's Perch first opened, it was painted completely white. In 1994, bands of red were added around the bolt rings, and the orange and yellow parachutes were replaced by red, white, and blue colored parachutes. In 1996, the ride's name was changed to Parachute Training Center - Edwards Air Force Base Jump Tower, as a tie-in to The Right Stuff: Mach 1 Adventure, a nearby flight simulator.\nFrom 1983 to 2005, it was the tallest ride in the state of New Jersey; it would lose this title to Kingda Ka, another ride at Six Flags Great Adventure, upon its opening in 2005.\nIn Fall 2009, the ride was completely repainted, and the design of its parachutes was updated. The tower's new paint scheme consisted of three stripes: maroon, orange, and gold, from bottom to top.\nClosure\nIn February 2023, the ride page was removed from the official Six Flags Great Adventure website. Soon afterwards, the park announced on social media that the ride would be removed. The ride would stand dormant for the 2023 and 2024 seasons, with little action towards its removal.\nOn November 14, 2024, the park made an official announcement stating that Kingda Ka, Green Lantern, Twister, and the Parachute Training Center tower would be removed. Around the time of the announcement, demolition permits were filed with the local government. On December 19, 2024, the Parachute Training Center tower was demolished with explosives, falling to the ground in the direction of the former Green Lantern roller coaster site; the latter had been dismantled over the prior month.\nAfter the demolition of the Texas Chute Out at Six Flags Over Texas in 2012, Great Gasp's removal at Six Flags Over Georgia in 2005, and the closure of the Sky Flower at Tokyo Dome City Attractions in Tokyo, Japan, for the quarter-half of 2024, it remained the last remaining Intamin parachute tower in the world.\nSee also\n* 2024 in amusement parks\n* 2022 in amusement parks\n* Texas Chute Out, a similar ride found at Six Flags Over Texas\n* Great Gasp, a similar ride found at Six Flags Over Georgia\nReferences\nPrimary sources\n*[https://www.greatadventurehistory.com/ParaPerch.htm Great Adventure History], full of information of Parachuter's Perch"
    }
  ]
}