{
  "content": [
    {
      "type": "text",
      "text": "# Parkwood, Queensland\n\n| alternative_location_map = Australia Gold Coast\n| local_map           = yes\n| zoom                = 12\n| pop                 = 8837\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4214\n| area                = 5.6\n| timezone            = AEST\n| utc                 = +10:00\n| lga      = City of Gold Coast\n| stategov = Bonney\n| fedgov   = Fadden\n| dist1               = 11.0\n| dir1                = NW\n| location1           = Surfers Paradise\n| dist2               = 72.5\n| dir2                = SSE\n| location2           = Brisbane\n| near-n              = Arundel\n| near-ne             = Arundel\n| near-e              = Southport\n| near-se             = Southport\n| near-s              = Molendinar\n| near-sw             = Molendinar\n| near-w              = Arundel\n| near-nw             = Arundel\n}}\nParkwood is a suburb in the City of Gold Coast, Queensland, Australia. In the , Parkwood had a population of 8,837 people.\nGeography\nParkwood is about  by road north-west of Southport.\nThe suburb is bounded by Napper Road to the north, Olsen Avenue to the east, Smith Street to the south and west.\nThere is an unnamed hill with a peak of  in the north of the suburb () with the Brushwood Ridge Reserve.\nThe major industry is retail trade, but the majority of resident workers are technicians and trades workers. Parkwood is characterized by leafy, green streets, well-kept gardens and detached homes, the majority of which are owner-occupied or rented. The suburb as a whole was developed in the last 20 years and falls under the Gold Coast City Council Division 6.\nHistory\nParkwood was named and bounded on 16 September 1989. The area was previously known as Ernest.\nDemographics\nIn the , Parkwood had a population of 8,702 people.\nIn the , Parkwood had a population of 8,837 people.\nEducation\nThere are no schools in Parkwood. The nearest government primary school is Arundel State School in Arundel. The nearest government secondary schools are Pacific Pines State High School in Pacific Pines to the west, Coombabah State High School in Coombabah to the north, and Southport State High School in Southport to the east.\nTransport\nTravelling north, Parkwood is approximately  from Helensvale railway station and approximately 1 hour drive to Brisbane CBD (and 1 hour by train). The local bus service runs through many parts of Parkwood and all have interconnection with other bus routes and modes of transport. An extension to the G:link light rail system opened in December 2017. Beginning at Helensvale station, the extension includes new stops at Parkwood and Parkwood East before it joins the original section of the line at Gold Coast University Hospital. From there, trams continue to Southport, Surfers Paradise and Broadbeach.\nSport\nParkwood Golf Course is at 76 - 122 Napper Road ().\nThe Parkwood Sharks is the local rugby league club. The team plays home games at Musgrave Sports Park in Labrador.\nReferences\nExternal links\n*"
    }
  ]
}