{
  "content": [
    {
      "type": "text",
      "text": "# Parks and open spaces in the London Borough of Southwark\n\nDulwich Park in [[Southwark, London, England]]\nThe London Borough of Southwark, occupying a roughly triangular area south of Tower Bridge over the River Thames, considers itself to be one of the greenest boroughs in London, with its  of public parkland. There are more than 130 such green areas, ranging from the large areas around Dulwich and Southwark Park in Rotherhithe to the many sports grounds and squares. The main ones are:\n* Belair Park:   north of West Dulwich railway station: Grade II listed landscape, lake and sports facilities\n* Brimmington Park:\n* Brunswick Park:\n* Burgess Park:\n* Camberwell Green:\n* Dulwich Park:   created in 1890; contains several garden areas, many sports facilities\n* Elephant Park\n* Geraldine Mary Harmsworth Park:   surrounding the Imperial War Museum (also includes the Tibetan Peace Garden)\n* Goose Green in East Dulwich:\n* Newington Gardens:\n* Nunhead Cemetery:\n* One Tree Hill:   near Honor Oak Park railway station\n* Pasley Park:\n* Peckham Rye Park and Common with Piermont Green:   The park is Edwardian.\n* Potters Fields Park:\n* Russia Dock Woodland:\n* Southwark Park:   opened 1869, one of the earliest opened by the Metropolitan Board of Works: gardens, sports facilities\n* Sydenham Hill Wood:   remains of the Great North Wood.\n* Tabard Gardens:\nThe centre of the following squares are laid to gardens:\n* Addington Square\n* Lorrimore Square\n* West Square\nRiverside\nSouthwark is a riverside borough, and one of the largest open spaces is the River Thames itself, forming the northern boundary of the borough. A sign posted riverside trail forms a walkway for both pedestrians and cyclists.\nThe Bankside Open Spaces Trust is funded to manage some parks and open spaces in the north of the Borough.\nLocal nature reserves\nLocal nature reserves in the borough are Dulwich Upper Wood, Lavender Pond, Nunhead Cemetery, One Tree Hill and Sydenham Hill Wood and Fern Bank.\nExternal links\n* [https://web.archive.org/web/20050831033509/http://www.southwark.gov.uk/YourServices/ParksSection/ Southwark's Parks and Open spaces]\nReferences"
    }
  ]
}