{
  "content": [
    {
      "type": "text",
      "text": "# Parker-Gentry Award\n\nThe Parker/Gentry Award, established in 1996 and presented annually by the Field Museum of Natural History, honors an outstanding individual, team or organization in the field of conservation biology whose efforts have had a significant impact on preserving the world's natural heritage and whose actions and approach can serve as a model to others. The award is designed to highlight work that could benefit from wider publicity and fuller dissemination of scientific results.\nThe award bears the names of the late Theodore A. Parker III and Alwyn Howard Gentry, outstanding conservation biologists, who worked closely with several Field Museum curators, especially through the Rapid Assessment Program (RAP) launched by Conservation International.\nParker, an ornithologist, and Gentry, a botanist, were killed August 3, 1993 when their light plane crashed into a mountainside as they were making a treetop survey of an Ecuadorian cloud forest.\nAward winners\n* 1996 Fernando Rubio, Pronaturaleza, Peru\n* 1997 Christopher Gordon, Volta Basin Research Project, Ghana\n* 1998 Randall Borman, Central Cofan Zabalo, Ecuador\n* 1999 Juan Mayr Maldonado, Fundacion Pro Sierra Nevada de Santa Marta, Colombia\n* 2000 Louise H. Emmons, United States\n* 2001 Michael Lannoo, United States\n* 2002 Los Amigos Team, Cordillera Azul National Park, Peru\n* 2003 Lorivi Ole Moirana, Tanzania\n* 2004 Yang Yuming, Yunnan Province, China\n* 2005 Gary Stiles, Colombia\n* 2006 Jose \"Pepe\" Alvarez A., Peru\n* 2007 Judith Kimerling, United States\n* 2008 Tim Davenport, Tanzania\n* 2009 Daniel Rakotondravony, Madagascar\n* 2010 Therese and John Hart, Réserve de Faune á Okapis, D.R. Congo\n* 2011 Lester Kaufman, United States\n* 2012 Nina R. Ingle, Philippines\n* 2013, W. John Kress, United States\n* 2014, Rhett Ayers Butler, United States\n* 2015, Merlijn van Weerd, Netherlands\n* 2016, Uma Ramakrishnan, India\n* 2017, David Vaughan, United States\n* 2018, Instituto del Bien Común, Peru\n* 2019, Gun Lake Potawatomi, United States\n* 2020, Michael Goulding, United States\n* 2021, Fort Belknap Indian Community and American Prairie Reserve\n* 2022, August M. Ball and Cream City Conservation, United States\n* 2023, South Rupununi Conservation Society of Guyana, Guyana\n* 2024, Urban Rivers, United States\n* 2025, Dave Willard, United States\nSee also\n* List of environmental awards\nReferences"
    }
  ]
}