{
  "content": [
    {
      "type": "text",
      "text": "# Party of Independence, Labour and Justice\n\n-->\n| merger =\n| split =\n| predecessor = African Independence Party\n| merged =\n| successor =\n| newspaper =\n| think_tank =\n| student_wing =\n| youth_wing =\n| wing1_title =\n| wing1 =\n| wing2_title =\n| wing2 =\n| wing3_title =\n| wing3 =\n| membership_year =\n| membership =\n| position =\n| religion =\n| national =\n| european =\n| europarl =\n| affiliation1_title =\n| affiliation1 =\n| colors =\n| anthem =\n| blank1_title =\n| blank1 =\n| blank2_title =\n| blank2 =\n| blank3_title =\n| blank3 =\n| seats1_title = National Assembly of Burkina Faso (2012)\n| seats1 =\n| seats2_title = Municipal Councils (2012)\n| seats2 =\n| seats3_title =\n| seats3 =\n| seats4_title =\n| seats4 =\n| symbol =\n| flag =\n| country_dab1 =\n| parties_dab1 =\n| elections_dab1 =\n| country2 =\n| country_dab2 =\n| parties_dab2 =\n| elections_dab2 =\n| footnotes =\n}}\nThe Party of Independence, Labour and Justice (, abbreviated PITJ) is a political party in Burkina Faso. The veteran trade union leader and former general secretary of the African Independence Party (PAI) Soumane Touré is the chairman of the party.\nTouré's PAI lost the registration of the party name in June 2011. In September 2011 Touré founded PITJ as his new political platform.\nThe party failed to win any seats in the 2012 legislative election. The national list of the party got 8,139 votes (0.27%). In the Houet province the list of the party obtained 6,061 votes. PITJ contested the 2012 municipal elections, fielding candidates in 13 municipalities. The party won 64 seats. The party won the mayoral posts in Karankasso-Vigué (Houet province). When new mayors were installed in January 2013, PITJ retained the mayoral post in Karankasso-Vigué with Abdoulaye Simporé as its candidate. Simporé had also headed the PITJ candidature in Houet province. In March 2013 the PITJ leader Maxime Kambou was installed as first vice mayor of Gaoua. The party had won 16 out of 130 seats in the municipal council in 2012.\nReferences"
    }
  ]
}