{
  "content": [
    {
      "type": "text",
      "text": "# Partnership for the Delaware Estuary\n\nThe Partnership for the Delaware Estuary (PDE) is a regional nonprofit organization working to protect and enhance the Delaware Estuary, where fresh water from the Delaware River mixes with salt water from the Atlantic Ocean.  Established in 1996, its mission is to lead science-based and collaborative efforts to improve the tidal Delaware River and Delaware Bay, which spans Delaware, New Jersey, and Pennsylvania.\nThe Partnership for the Delaware Estuary is one of 28 National Estuary Programs throughout the coastal United States working to improve the environmental health of the nation's estuaries. Its staff works with partners in three states to increase awareness, understanding, and scientific knowledge about the Delaware Estuary, a major regional cultural, economic and recreational resource.\nThe estuary\nThe Delaware Estuary is the tidal portion, of the Delaware River Basin.  It includes all of the watersheds draining into this portion of the Delaware River and Delaware Bay.  The area surrounding the estuary stretches as far west as the Schuylkill River’s headwaters near Pottsville, Pennsylvania, and as far east as the Rancocas Creek’s headwaters near Fort Dix, New Jersey.  The vastness of this watershed makes the Delaware Estuary one of the largest estuaries in the country, or approximately  in size.  Within these boundaries are over 200 species of fish, the continent’s second-highest concentration of shorebirds, and over  of wetlands.\nGrants and activities\nInstitutions award grants to the PDE for various programs and projects that improve the estuary, often in partnership with other organizations. For example:\n* In 2004 the U.S. Environmental Protection Agency (EPA) awarded the PDE a $1.15 million Targeted Watershed Initiative Grant for clean-water projects identified by the Philadelphia Water Department to protect the Schuylkill River Valley, a major source of drinking water for the City of Philadelphia.  As a result, the PDE continues to employ a full-time coordinator for the Schuylkill Action Network, a membership organization whose mission is to improve the water resources of Pennsylvania's Schuylkill River Watershed.\n* In 2008 the PDE received a $50,000 grant from the EPA to carry out a two-year study on the effects climate change could have on the estuary.\n* In 2014 the William Penn Foundation granted over $630,000 to the PDE.  This supports collaborative efforts to improve two of the region’s most critical sources of water; Pennsylvania’s Schuylkill River and South Jersey’s Kirkwood-Cohansey Aquifer.  Projects that conserve land and reduce farm runoff will help prevent pollution in the Schuylkill River, the Delaware River and Bay’s largest tributary.  Efforts in South Jersey will help to monitor and conserve the region’s dwindling supply of groundwater.\nIn 2017 the PDE hosted its seventh biennial Delaware Estuary Science & Environmental Summit. This attracted more than 300 scientists, resource managers, and advocates who spent their time \"Reflecting on Progress, Charting the Future.\" This event's purpose is to gather experts from across the region who, otherwise, might never meet, much less collaborate, due to jurisdictional boundaries.\nReferences\nExternal links\n* [http://www.delawareestuary.org/ Partnership for the Delaware Estuary]\n* [https://www.epa.gov/nep National Estuary Program]\n* [https://inlandbays.org/ Delaware Center for the Inland Bays]\n* [http://www.schuylkillwaters.org/ Schuylkill Action Network]"
    }
  ]
}