{
  "content": [
    {
      "type": "text",
      "text": "# Partners in Policymaking\n\nPartners in Policymaking is a free program designed to teach people with disabilities and family members the power of advocacy to positively change the way people with disabilities are supported, viewed, taught, live and work.  Since its inception, Partners have worked to expand community opportunities and to hasten many fundamental changes in the nature of supports and services for people with disabilities in areas such as education, employment, civil rights, and community living.\nGoals\nSince 1987, Partners programs have been implemented nationally and internationally. Thousands of Partners graduates are part of a growing national and international network of community leaders serving on policy making committees, commissions, boards, and in elected office at all levels of government. The Partners movement is also available to thousands of others through free online self-advocacy courses in areas such as: inclusive education; obtaining meaningful employment; accessing high quality community living arrangements\nThrough the combination of both on-site training and a vast array of internet-based training resources, Partners in Policymaking is intended to assist people with disabilities to know their rights, to know what to expect in terms of high quality services and supports, and to know how to obtain such services and supports within their local communities.\nHistory\nThe program was originally conceived by the Minnesota Governor's Council on Developmental Disabilities under funding by the U.S. Administration on Developmental Disabilities and has since been adopted in over 35 US states. It has also been adopted in the Netherlands, New Zealand, Northern Ireland, Portugal, Ireland, Scotland, and England.  The \"core\" curriculum covers current issues, state-of-the-art approaches and best practices in many areas including legislative processes and strategies; communication and team-building; using assistive technology; independent living; creating inclusive communities; and employment.\nReferences"
    }
  ]
}