{
  "content": [
    {
      "type": "text",
      "text": "# Party of the People's Revolution\n\n)\n| ideology         = |Maoism}}\n| headquarters     = Hewa Bora\n| country          = the Democratic Republic of the Congo\n| dissolved        = 18 October 1996()\n| split            = MNC-L\n| predecessor      = Kabila-Massengo faction of the Simba rebels\n| merged           = AFDL\n| position         = Far-left\n| flag             = Flag of the Party of the People's Revolution.svg\n}}\nThe '''Party of the People's Revolution''' (, PRP) was a clandestine Maoist communist party in the Democratic Republic of the Congo, later known as Zaire. The PRP was a Marxist political movement born in the convulsions of the Congolese crisis, being founded in 1967 in Fizi by Laurent-Désiré Kabila, who decades later would overthrow Mobutu and take control of the country.\nHistory\nFormer militant of Patrice Lumumba's Congolese National Movement and supporter of Pierre Mulele's short-lived People's Republic of the Congo, Laurent-Désiré Kabila, withdrew with his men in 1965 to the mountains of the Fizi region, east of the Democratic Republic Republic of Congo. Gaining limited control of the mountain towns, they organized a people's commune, Hewa Bora, on the Chinese model. On December 24, 1967, they founded the Party of the People's Revolution (French abbreviation: PRP) in an attempt to establish a mass party that would overthrow Mobutu and spread the revolution throughout the country, establishing a socialist Congo. The PRP was Maoist in inspiration and received support from China and Julius Nyerere's Tanzania.\nInspired by the 1979 overthrow of Idi Amin and by the Uganda Bush War, Kabila and his supporters were convinced that conditions were brewing for a protracted people's war in Zaire. The PRP started a series of guerrilla uprisings and insurrections known as the Moba wars. However, after several years of armed struggle, the FAZ succeeded in crushing the Maoist insurgents, who were reduced to a weakened network scattered throughout East Africa and Western Europe. After the Rwandan genocide and the Zairian crisis, Kabila, who had abandoned Maoism, reappeared on the political scene as one of the main leaders against Mobutism. At the invitation of the new regimes in Uganda (Yoweri Museveni) and Rwanda (Paul Kagame), Laurent-Désiré Kabila became in 1996 the spokesman for the Alliance of Democratic Forces for the Liberation of the Congo (AFDL), a heterogeneous coalition of forces hostile to Mobutu, including the CNRD, the ADP and the MRLZ. With the founding of the AFDL, the PRP formally disbanded.\nReferences"
    }
  ]
}