{
  "content": [
    {
      "type": "text",
      "text": "# Past, Present and Future (Al Stewart album)\n\n| rev2      =\n| rev2Score =\n}}\nPast, Present and Future is Al Stewart's fifth studio album, released in October 1973 in the UK and in May 1974 in the US. This album is considered Stewart's first \"major album\" and it reached #133 on the Billboard Rock Album chart in 1974. He had taken on a different approach from his previous, folkier work, an approach that would stay with him for most of his career. All songs on this record have historical themes, each song representing a decade of the 20th century. The final song, \"Nostradamus,\" is about the famous supposed prophet and his prophecies.\nIn the programme for the UK concert tour that promoted the album, Stewart is quoted as saying \"My first four albums have been, for me, an apprenticeship. The new album.....is my thesis\". It states that the album \"is set for release on CBS in early October. Terminal Eyes is released as a single on September 28th.\"\nThe album was performed in its entirety live at the Royal Albert Hall in London, England, on 16 May 2015 as part of Al Stewart's UK tour; the performance at the Royal Albert Hall also featured the live performance of the album Year of the Cat in its entirety.\nTrack listing\nAll tracks composed by Al Stewart.\nSide one\n#\"Old Admirals\" – 5:54\n#\"Warren Harding\" – 2:39\n#\"Soho (Needless to Say)\" – 3:55\n#\"The Last Day of June 1934\" – 4:45\n#\"Post World War Two Blues\" – 4:17\nSide two\n#\"Roads to Moscow\" – 8:00\n#\"Terminal Eyes\" – 3:22\n#\"Nostradamus\" – 9:43\nCharts\n{| class=\"wikitable\"\n! Chart (1974)\n! Peakposition\n|-\n|US Top LPs & Tape (Billboard)\n|align=\"center\"|133\n|-\n|}\nPersonnel\n* Al Stewart – acoustic guitar, vocals\n* Tim Renwick – electric guitar\n* Peter Berryman – acoustic guitar\n* Isaac Guillory – acoustic guitar, classical guitar\n* B.J. Cole – steel guitar\n* Bruce Thomas – bass\n* Brian Odgers – bass\n* John Wilson – drums\n* Peter Wood – keyboards, piano, accordion\n* Rick Wakeman – piano, keyboards\n* Tim Hinkley – keyboards\n* Bob Andrews – keyboards\n* Bob Sargeant – keyboards\n* Francis Monkman – Moog synthesizer\n* Alistair Anderson – English concertina\n* Richard Hewson – string arrangements\n* Haim Romano – mandolin\n* Dave Swarbrick – mandolin\n* Luciano Bravo – steel band\n* Lennox James – steel band\n* Michael Oliver – steel band\n* Frank Ricotti – percussion\n* Roger Taylor – percussion\n* Krysia Kocjan – backing vocals\n* John Donelly – backing vocals\n* Mick Welton – backing vocals\n* Kevin Powers – backing vocals\n;Technical\n* Mike Stone – engineer\n* Mario Grattarola - photography\nCover art\nThe UK cover (CBS) is of gatefold design, with a photo of Al Stewart, unusually wearing a three-piece suit, leaning on a mantelpiece in a drawing room.  The picture was taken by photographer and film director Mario Grattarola at the Geffrye Museum in Hoxton, London. The album's inner section and back cover include all song lyrics, brief notes by the artist about each song and also a contribution by author Erika Cheetham about Nostradamus. The US album cover (Janus Records), by Hipgnosis and George Hardie, is a photography-like rendition of the Marvel Comics character Doctor Strange using his Cloak of Levitation to travel through a hole created in the air into an alternative universe.\nReferences"
    }
  ]
}