{
  "content": [
    {
      "type": "text",
      "text": "# Pataleshwar Mandir\n\n| native_name        = Lord Shiva Temple\n| country            = India\n| state              = Bihar\n| district           = Vaishali\n| location           = Jadhua Road, Hajipur\n| elevation_m        =\n| deity      = Shiva\n| festivals=\n| architecture       = Indian\n| temple_quantity  =\n| monument_quantity=\n| inscriptions       =\n| year_completed         = Not Known\n| website            =\n}}\nThe Pataleshwar Mandir is a Hindu Temple in the city of Hajipur, Bihar, India. Dedicated to Shiva, it is located at Jadhua Road, Hajipur. As per local folklore, it is said to have been in existence since ancient period and Lord Shiva is believed to be in the form of Lingam here. Apart from anthropomorphic images of Shiva, the worship of Shiva in the form of a lingam, or linga, is also important. The worship of the Shiva-Linga originated from the famous hymn in the Atharva-Veda Samhitâ sung in praise of the Yupa-Stambha, the sacrificial post.\nEtymology\nThe lingam (also, linga, ling, Shiva linga, Shiv ling, Sanskrit लिङ्गं, , meaning \"mark\", \"sign\", \"phallus\", \"inference\" or \"eternal procreative germ\") is a representation of the Hindu deity Shiva used for worship in temples. Whether the lingam symbolizes the physical body of the god or something purely spiritual is the topic of many a century-old debate within Hinduism.\nDeity\nThe presiding deity of the temple is 'Lord Shiva'. Shivratri is celebrated with full gaiety. It is a Hindu festival celebrated every year in reverence of Lord Shiva. Alternate common names/spellings include 'Herath', 'Hararatri', 'Shivaratri', Sivarathri, and Shivaratri. Shivaratri literally means the great night of Shiva or the night of Shiva. It is celebrated every year on the 13th night/14th day of the Maagha or Phalguna month of the Hindu calendar. Since many different calendars are followed by various ethno-linguistic groups of India, the month and the Tithi name are not uniform all over India. Celebrated in the dark fortnight or Krishna Paksha(waning moon) of the month of Maagha according to the Shalivahana or Gujarati Vikrama or Phalguna according to the Vikrama era.\nSignificance of a Pataleshwar Mandir\nThe lingam came out of soil on its own. The important celebration on Shivratri takes place here every year.\nVisiting the Temple\nMost visitors may reach the temple by simply asking local people. This is a very renowned temple.\nSee also\n*List of Hindu temples in India\n*Hajipur\nReferences\nExternal links\n*[https://web.archive.org/web/20130715092150/http://www.panoramio.com/photo_explorer#view=photo&position=2&with_photo_id=44635540&order=date_desc&user=5285546]"
    }
  ]
}