{
  "content": [
    {
      "type": "text",
      "text": "# Patricia A. Edwards\n\nPatricia A. Edwards, a member of the Reading Hall of Fame, is a Distinguished Professor of Language and Literacy in the Department of Teacher Education and a Senior University Outreach Fellow at Michigan State University.  She is a nationally and internationally recognized expert in parent involvement, home-school-community partnerships, and multicultural, early, and family/intergenerational literacy with a focus on poor and minority children.  She served on the International Literacy Association (formerly International Reading Association) Board of Directors from 1998–2001, as the first African American President of the Literacy Research Association (formerly the National Reading Conference) from 2006–2007, and as President of the International Literacy Association from 2010–2011.  Edwards also served as a member of the Board of Directors for the American Educational Research Association's (AERA) Family, School, and Community Partnerships Special Interest Group (SIG) from 2014–2016 and was elected to serve as its President-Elect/President from 2016–2020.\nEdwards has authored two family literacy programs (published in English and Spanish) titled Parents as Partners in Reading: A Family Literacy Training Program (1990, 1993)  and Talking Your Way to Literacy: A Program to Help Nonreading Parents Prepare Their Children for Reading (1990) that have garnered national and international recognition.  She has also authored, co-authored, and edited numerous books, peer-reviewed articles, and book chapters focusing on home-school-community partnerships, family literacy, and multicultural literacy.  She has served on several editorial boards for publications such as Educational Researcher, Journal of Literacy Research, The Reading Teacher, Language Arts, Research in the Teaching of English, International Race and Education, and the School Community Journal.  Edwards has received many awards and honors for her research and public service related to families and literacy.\nEducation\nEdwards grew up in Albany, Georgia and graduated from Albany State College (Albany, Georgia) with a B.S. in Elementary Education in 1970. In 1971, Edwards received a M.S. in Elementary Education from North Carolina A & T University (Greensboro, North Carolina).  She received an Ed.S. from Duke University in Reading Education in 1976 and a Ph.D. in Reading Education with a minor concentration in Educational Administration from the University of Wisconsin–Madison in 1979.\nCareer\nNorth Carolina\nAfter obtaining her master's degree, Edwards worked at North Carolina Central University coordinating the Pre-Student Teaching Program while simultaneously teaching in public schools in Durham, Raleigh, and Chapel Hill.  During this time, she explored how to teach in and how to help pre-service teachers learn to teach in a variety of organizational structures (e.g. team-teaching, self-contained classrooms, non-graded classrooms, open classrooms, etc.), in addition to exploring these structures' impact on parents and children.\nLouisiana\nUpon completion of her Ph.D., Edwards worked at Grambling State University followed by Louisiana Tech University.  While at Louisiana Tech, she received a W. K. Kellogg National Fellowship in 1983.  The program's goal was to support participants' intellectual and leadership development.   As part of the Fellowship, Edwards focused her learning on family involvement in education.  She visited many agencies and institutions of higher education throughout the United States and abroad meeting with noted experts in order to explore this topic from a variety of perspectives.\nEdwards also volunteered as a parent consultant at a local Head Start center in a small rural northern Louisiana community to investigate how to support parents' efforts to foster their children's educational development.   Edwards continued this research in her next job at Louisiana State University.  During this time, she developed many of the ideas that would become her program Parents as Partners in Reading: A Family Literacy Training Program (1990, 1993) by working with parents and teachers at Donaldsonville Elementary School located in Donaldsonville, Louisiana, a small rural southern community.  The program's goal was to train parents in effective book-reading practices desired by the school.  This led to the second program Edwards developed, Talking Your Way to Literacy: A Program to Help Nonreading Parents Prepare Their Children for Reading (1990).\nThese programs were implemented in schools and libraries; Early Reading First grants, Even Start, Head Start, and Title I programs; and in teenage parent and family centers across the nation.  For this work, Edwards received commendations from former Louisiana Congressman Clyde Holloway and the national press—e.g. The Washington Post, Los Angeles Times, New York Times, and the Milwaukee Journal.  Former First Lady Barbara Bush included Edwards's Parents as Partners in Reading program as one of ten promising family literacy programs nationwide in her book First Teachers.  In October 1988, Edwards and her Parents as Partners in Reading program were featured in a nationally televised documentary hosted by Phylicia Rashad, \"First Things First\" sponsored by Project Literacy U.S. and ABC/WQED Productions.  In October 1989, Edwards was highlighted on Dan Rather's Nightly News Series \"The Best of Us\" as one of five Americans everyone should know.  For Edwards's work with families and children, she received honors from the University of Wisconsin–Madison: Outstanding African American Alumni Award (1991) and the School of Education Alumni Achievement Award (1995).\nIllinois\nResulting from Edwards's family literacy work in Donaldsonville, Louisiana, she was invited to the Center for the Study of Reading at the University of Illinois Urbana-Champaign during the 1988–89 school year.  There, she continued her investigation into successful approaches for communicating with diverse family populations and transferred her knowledge about families and book reading from her initial research in a rural setting to an urban setting.  This work further contributed to her Parents as Partners in Reading and her Talking Your Way to Literacy programs.\nMichigan\nIn the fall of 1989, following her year at the Center for the Study of Reading, Edwards came to Michigan State University. In 1990, Edwards was appointed by U.S. Assistant Secretary John McDonald as an adviser to the First National Goal Readiness for School and was appointed to the Michigan State University Institute for Families, Youth and Children.  In 1994, the United Nations Educational, Scientific, and Cultural Organization (UNESCO) invited Edwards to the first World Symposium on Family Literacy in Paris, France as one of fifty researchers asked to participate in developing a world policy on family literacy and to share current and past research initiatives.\nAt Michigan State University, Edwards, now a Distinguished Professor, continues to investigate ways to involve and support families in their children's literacy development.  For example, she worked with a professional development school in Lansing, Michigan coordinating the Home Literacy Project to help educators develop a scope and sequence of family involvement activities related to the grade-level literacy curriculum.   In 2008, Edwards became a Senior University Outreach Fellow at Michigan State University for her service to educators throughout the state of Michigan.\nMajor topics of research\nThroughout her career, Edwards has advocated for explicit teaching—i.e. giving students, parents, and teachers the exact information and procedures needed for success      and not assuming that practices such as reading aloud and sharing time are mutually understood by teachers and families in the same ways.  She has focused her efforts on increasing family literacy and involvement, helping others better understand and capitalize on African American and other minority students' literacy resources, understanding what literacy looks like internationally, and preparing literacy teachers to work with diverse students and families.\nParent involvement, home-school-community partnerships, and family literacy\nIn the late 1980s and early 1990s, Edwards researched what families understood by the request to \"read to their child.\"  This led to the development of her family literacy programs Parents as Partners in Reading: A Family Literacy Training Program and Talking Your Way to Literacy: A Program to Help Nonreading Parents Prepare Their Children for Reading which gave parents, and people working with parents, specific strategies to help parents support their children's school learning.  Edwards conducted follow-up research to determine how local parent leaders took up and continued the practices from the Parents as Partners program.\nThrough Edwards's continued work with families, she has found that bridging the divide between families and schools requires support from all community members/organizations and that it requires recognizing families' diverse strengths and needs/desires.  It requires listening to parent stories about their children, i.e. seeing parents as experts, and getting to know the demographics and the people of the community the school serves.  Based on her work, she coined the terms differentiated parenting and parentally appropriate.  She proposed the concept of differentiated parenting to urge schools not to place all parents into one basket.  When schools design programs for parents, one size does not fit all; instead, schools must adapt to fit parents' needs.  As schools think about their activities and ways of engaging parents, these avenues must be parentally appropriate in order to make tasks compatible with parents' various capabilities in supporting their children in particular ways as requested by the school.\nLiteracy in multicultural contexts\nEdwards's work advocates for schools to recognize, learn about, and value students' varied home literacies and cultural practices—such as literacies used in African American church services or encouraging students to bring in their own cultural artifacts as an adaptation of sharing time for emergent bilinguals.  In the book Bridging Literacy and Equity: The Essential Guide to Social Equity Teaching, Althier Lazar, Patricia Edwards, and Gwendolyn McMillon challenge teachers and schools to abandon deficit ways of thinking and instead embrace culturally responsive practices and social equity teaching by recognizing the diverse resources their students bring, which are likely different from those with which their teachers grew up, and by advocating for their students.\nIn the book Change is Gonna Come: Transforming Literacy Education for African American Children, winner of the 2011 Edward B. Fry Book Award,  Edwards and co-authors Gwendolyn McMillon and Jennifer Turner address historical supports and roadblocks for African Americans to obtain education and literacy skills.  They also provide solutions that connect research, theory, pedagogy, and history to help teachers support their students' literacy development.  These solutions include mentoring students, collaborating with community and faith-based organizations, establishing strong school leadership, helping students take ownership of literacy and see it as critical to their lives, and forging positive home-school connections.\nLiteracy in international contexts\nEdwards has long been interested in the question \"How does the world read?\"   As Vice President of the International Literacy Association (ILA) (formerly International Reading Association), she developed a survey and databank of global literacy practices and ways in which teacher educators worldwide prepare their teachers to teach reading.  With assistance from the Director of International Development, councils and national affiliates of the International Literacy Association were asked to share publications and reports about their country's state of education with particular emphasis on literacy development and achievement. They were also asked to share photographs that captured home and school environments as well as artifacts exemplifying literacy materials in their countries.  Lastly, they were asked to gather other materials such as stories or audio/video clips of administrators, teachers, parents, and students talking about literacy and how it is used and taught in their countries.\nAs ILA President-Elect and President, as well as through the organization People to People, Edwards has led educators and ILA delegates on trips to China, South Africa, and Russia to learn about schools and literacy education in these countries.  She has found that understanding international literacy practices is especially important for cross-cultural communication and for preparing United States teachers for increasingly diverse classrooms.\nTeacher education and preparation\nThrough Edwards's work related to family involvement and literacy in multicultural and international contexts, she has found that teachers often lack preparation in how to respond to and meet the needs of diverse groups of students and their families.  Therefore, many of her books are written for teachers.  Her books New Ways to Engage Parents: Strategies and Tools for Teachers and Leaders, K–12, Tapping the Potential of Parents: A Strategic Guide to Boosting Student Achievement Through Family Involvement, and A Path to Follow: Learning to Listen to Parents provide concrete steps to aid teachers in their work with families such as gathering information about families and listening to their stories, promoting a variety of avenues for communication and involvement, and working with community organizations.  Edwards's books Bridging Literacy and Equity: The Essential Guide to Social Equity Teaching, Change is Gonna Come: Transforming Literacy Education for African American Children, and her co-edited book Best Practices in ELL Instruction offer teachers specific information and ideas for working with diverse learners.\nHonors and awards\n*2024 [https://www.literacyworldwide.org/get-involved/awards-recognition/awards-grants/ila-william-s-gray-citation-of-merit ILA William S. Gray Citation of Merit]\n*2020 LRA Oscar S. Causey Award for Reading Research\n* 2019 AERA Scholars of Color Distinguished Career Contribution Award\n* 2018 NCRLL (National Conference on Research in Language and Literacy Distinguished Scholar\n* 2017-2018 Jeanne S. Chall Visiting Researcher\n*2017 Delta Kappa Gamma Society International Educators Book Award\n*2015 Michigan Reading Association Teacher Educator Award\n* 2014 ILA/IRA Jerry Johns Outstanding Teacher Educator in Reading Award, International Literacy/Reading Association\n* 2012 Albert J. Kingston Service Award, Literacy Research Association (in honor of service to the organization)\n* 2012 Reading Hall of Fame Inductee\n* 2011 Edward B. Fry Book Award for Change is Gonna Come: Transforming Literacy Education for African American Children authored with Gwendolyn McMillon and Jennifer Turner\n* 2008 Senior University Outreach Fellow, Michigan State University\n* 2001 Distinguished Faculty Award, Michigan State University, February 13, 2001\n:* In honor of receiving the 2001 Distinguished Faculty Award, Mayor Raymond Ray Jacob proclaimed February 13, 2001 \"Dr. Patricia Edwards Day\" in the City of Donaldsonville, Louisiana.\n* 1997 Fellow Status in the National Conference on Research in Language and Literacy (NCRLL) in recognition of outstanding contributions to research in language and literacy, award given at the International Literacy/Reading Association meeting in Atlanta, Georgia\n* 1995 Elva Knight Research Award, International Literacy/Reading Association\n* 1995 School of Education Alumni Achievement Award, University of Wisconsin–Madison\n* 1995 Phi Delta Kappa Educator of the Year Award, Michigan State University Chapter\n* 1994 Awardee at the Annual Celebrate Teaching and Learning Dinner, sponsored by the Lilly Teaching Fellows and CIERT (UCAP Committee on Improvement, Evaluation and Rewards for Teaching), presented at Michigan State University\n* 1994 Teacher Scholar Award for 1993–1994, Michigan State University\n* 1992 Michigan Reading Association Celebrate Literacy Award\n* 1991 Outstanding African-American Alumni Recipient, University of Wisconsin–Madison\n* 1983-1986 W. K. Kellogg National Fellow\n* 1987–1988 Faculty Development Award, Louisiana State University\n* 1986 Distinguished Scholar for the Fifteenth Annual Dennis Memorial Lecture Series, Albany State College, Albany, Georgia\nWorks\nBooks\n*Edwards, P.A., Spiro, R., Domke, L. M., Castle, A. M., White, K. L., Peltier, M. T. T. & Donohue, T. H. (2019). Partnering with families for student success: 24 scenarios for problem solving with parents. New York: Teachers College Press.\n* Edwards, P. (2016). New ways to engage parents: Strategies and tools for teachers and leaders, K-12. New York: Teachers College Press.\n* Lazar, A. M., Edwards, P. A., & McMillon, G. T. (2012). Bridging literacy and equity: The essential guide to social equity teaching. New York: Teachers College Press.\n* Edwards, P. A., McMillon, G. M. T., & Turner, J. D. (2010). Change is gonna come: Transforming literacy education for African American children. New York: Teachers College Press.\n* Li, G. & Edwards, P.A. (Eds.) (2010). Best practices in ELL instruction. New York: Guilford Press.\n* Edwards, P. A. (2009). Tapping the potential of parents: A strategic guide to boosting student achievement through family involvement. New York: Scholastic, Inc.\n* Edwards, P. A. (2004). ''Children's literacy development: Making it happen through school, family, and community involvement. Boston: Allyn & Bacon.\n* Edwards, P. A. with Pleasants, H. M., & Franklin, S. H. (1999). A path to follow: Learning to listen to parents''. Westport, CT: Heinemann.\nBook chapters\n*Edwards, P. A., (2018). A teacher educator’s plea to prepare preservice teachers for family/school collaborators.  In J. E. Justice F. B. Tenore (Eds). Becoming Critical Teacher Educators: Narratives of Resistance, Possibility, and Praxis. (pp.&nbsp;61–69). New York: Routledge.\n*Edwards, P.A., Domke, L., & White, K. (2017). Closing the parent gap in changing school districts. In S. Wepner & D. Gomez (Eds.), Challenges facing suburban schools: Promising responses to changing student populations. (pp.&nbsp;109–121).  Lanham, MD: Rowman & Littlefield.\n*Edwards, P. A., Protacio, M.S., Peltier, M. R., & Hopkins, L. J. (2017).  Family literacy initiatives and reading comprehension.  In S. Israel (Ed).  Handbook on Reading Comprehension, 2nd edition.  (pp.&nbsp;568–598). New York: Guilford Press.\n*Edwards, P. A. (2015).  Preparing Educators Who Make a Difference in Our Diverse Communities.  In R. D. Johnson, S. Vasinda & S. Szabo (Eds.). Literacy Educators and Researchers: Making a Difference in Our Diverse Communities. The Thirty-Eighth Yearbook: A Double Peer-Reviewed Publication of the Association of Literacy Educators and Researchers, 11-22.\n*Edwards, P. A. (2016). Relationships in personalized learning: Teacher, student, family. In M. Murphy, Redding, S. & J. Twyman (Eds.), Handbook on Personalized Learning For States, Districts, and Schools.  (pp.&nbsp;189–204). Charlotte, NC: Information Age Publishing.\n*Edwards, P. A. & Peltier, M. R. (2016).  Family literacy movement.  In K. Chrisman, J. Pyles & D. Couchenour (Eds.), The Sage Encyclopedia of Contemporary Early Childhood Education.  (p.&nbsp;200). Thousand Oaks, CA: Sage Publications.\n*Edwards, P. A., & Piazza, S. V. (2015).  Literacy coaching and the ABCs of cultural understanding and communication: What’s the connection.  In C. Finbeiner & Lazar, A. (Eds.), Getting to Know Ourselves and Others Through the ABCs: A Journey Toward Intercultural Understanding.   (197-208). Charlotte, NC: Information Age Publishing.\n* Paratore, J.R., & Edwards, P.A., O'Brien, L.M. (2015). Helping parents help children achieve the Common Core State Standards: Reaching out in different ways. In L.B. Gambrell & L.M. Morrow (Eds.), Best practices in literacy instruction (5th ed.) (pp.&nbsp;390–413). New York: Guilford Press.\n* Edwards, P.A., Paratore, J., & Sweeney, J. (2014). In S.B. Wepner, D.S. Strickland, & D.J. Quatroche (Eds.), The administration and supervision of reading programs (5th ed.) (pp.&nbsp;214–222). New York: Teachers College Press.\n* Turner, J.D., & Edwards, P. A. (2009). Old tensions, new visions: Implications for teacher education programs, K- 12 schools, and family literacy programs. In G. Li (Ed.), Multicultural families, home literacies, and mainstream schooling (pp.&nbsp;246–268). Charlotte, NC: Information Age Publishing.\n* McMillon, G.M.T. & Edwards, P.A. (2008). Examining shared domains of literacy in the home, church and school of African American children. In J. Flood, S.B. Heath, and D. Lapp (Eds.), Handbook of research on teaching literacy through the communicative and visual arts, Vol. II (pp.&nbsp;319–328). New York: ILA & Routledge/Taylor & Francis.\nArticles\n* Edwards, P. A., & White, K. L. (2018).  Working with Racially, Culturally, and Linguistically Diverse Learners, Families and Communities: Strategies for Preparing    Preservice Teachers.  Journal of Family Diversity in Education, 3(1), 1-22.\n* Protacio, M.S. & Edwards, P.A. (2015). Restructuring sharing time for English learners and their parents. The Reading Teacher, 68(6), 413-421.\n* Edwards, P.A. (2010). Tapping the power of parents: Ideas for effectively involving parents and the community in children's education. Reading Today, 28(3), 18-19.\n* Klingner, J. K., & Edwards, P.A. (2006). Cultural considerations with response to intervention models. Reading Research Quarterly, 41(1), 108-117.\nReferences"
    }
  ]
}