{
  "content": [
    {
      "type": "text",
      "text": "# Patrick Knapp Schwarzenegger\n\n| birth_place        = Munich, West Germany\n| nationality        = Austrian,\nAmerican\n| occupation         =\n| education          = German School of Lisbon, AbiturUniversity of California, Los Angeles University of Southern California Law School\n| parents            =\n| spouse             =\n| children           = 4\n| relatives          = Gustav Schwarzenegger (grandfather)Arnold Schwarzenegger (uncle)Katherine Schwarzenegger (cousin)Patrick Schwarzenegger (cousin)Joseph Baena (cousin)\n}}\nPatrick Mario Knapp-Schwarzenegger (born February 2, 1968) also known as Patrick Knapp, is an Austrian-American attorney, businessman, and investor based in Los Angeles, California. He is the nephew of actor and politician Arnold Schwarzenegger.\nEarly life\nPatrick Mario Knapp-Schwarzenegger was born on February 2, 1968, in Munich, West Germany. He is the only child of Erika Knapp and Meinhard Schwarzenegger, elder brother and only sibling of Arnold Schwarzenegger. In 1971, Patrick’s father died in a car accident in Kitzbühel, Austria, when he was three years old. Patrick was raised by his mother and grandparents in Austria and Germany. In 1981, at age 13, he moved to Portugal; first, to Beja, where he played football and after, to Lisbon, Portugal, where he played football for S.L. Benfica and attended the German School of Lisbon. In 1987, Patrick graduated with a German Abitur high school diploma and then emigrated to the United States to attend college with the help of his uncle, Arnold.\nCareer\nIn 1991, Knapp-Schwarzenegger graduated from the University of California, Los Angeles with degrees in economics and political science and briefly worked for Congressman Lee H. Hamilton (D-Indiana), Chairman of the Foreign Affairs Committee.\nBetween 1992 and 1995 Knapp-Schwarzenegger attended law school, graduating in May 1995 with a Juris Doctor from the University of Southern California School of Law. His legal experience includes work in the Sony Music legal department in New York under the helm of Tommy Mottola in 1994, and during his last year of law school Knapp-Schwarzenegger worked at the Los Angeles District Attorney’s Office. That same year he was admitted to practice law in California and joined the Beverly Hills based entertainment law firm Bloom, Dekom & Hergott (in its latest incarnation known as GSB), becoming a partner in 2001.\nIn 2020, Knapp-Schwarzenegger (as a partner of GSB) merged with Stone, Genow, Smelkinson, & Christopher, LLP, to form legal powerhouse GGSSC, LLP, which represents some of the top talent in Hollywood.\nIn 2017, Knapp-Schwarzenegger served as an advisor to his uncle Governor Arnold Schwarzenegger on Season 8 of the Mark Burnett-produced NBC television show The New Celebrity Apprentice, with some of the other advisors being Tyra Banks, Warren Buffett, Jessica Alba, and Steve Ballmer. Knapp-Schwarzenegger served as a producer on various productions, including Jean-Michel Cousteau’s Wonders of the Sea, Deals and Visions, and the Kate Winslet narrated award winning Dreamscapes.\nKnapp-Schwarzenegger is also known to be active as investor and shareholder in various startup companies such as the international award-winning premium tequila brand Padre Azul and E-mobility innovator Kreisel Electric.\nIn 2022, Kreisel Electric was acquired by US based and New York Stock Exchange traded John Deere, representing one of the largest Austrian M&A transactions of that year.\nPersonal life\nIn 1999, Knapp-Schwarzenegger's mother Erika Knapp died at the age of 53 following a two-year battle with cancer.\nOn April 30, 2005, Knapp-Schwarzenegger married Bliss Ellis, a publicist and former model from Texas. The couple resides in Los Angeles with their four children: Valentina, Franziska, Leonardo, and Mario.\nIn 2006, Knapp-Schwarzenegger became a naturalized U.S. citizen. Before he gained his U.S. citizenship, he asked the Austrian government for the right to keep his Austrian citizenship, as they do not usually allow dual citizenship; his request was granted.\nExternal links"
    }
  ]
}