{
  "content": [
    {
      "type": "text",
      "text": "# Patrick Kavanagh Poetry Award\n\nThe Patrick Kavanagh Poetry Award is an Irish poetry award for a collection of poems by an author who has not previously been published in collected form. It is confined to poets born on the island of Ireland, or who have Irish nationality, or are long-term residents of Ireland. It is based on an open competition whose closing date is in July each year. The award was founded by the Patrick Kavanagh Society in 1971 to commemorate the poet.\nCompetition secretaries were Martin Hanratty (1971–72), Tom Quinn (1973–83), Magdalene Quinn (1984–2000), Daigh Quinn (2001–02), and Rosaleen Kearney (2003 onwards). Since 2009 the Judge of the Award and President of the Society has been the poet, novelist and screenwriter Brian Lynch. Past judges have included Brendan Kennelly, John Montague, Gerald Dawe, Thomas McCarthy, Theo Dorgan, Paula Meehan, Conor O'Callaghan, Vona Groarke, Moya Cannon, and Gabriel Rosenstock. It is now run by the society in conjunction with the Patrick Kavanagh Centre, Inniskeen.\nSince 2011, the award is presented at the end of September during the annual Kavanagh Weekend at the Patrick Kavanagh Centre.\nList of winners\n1971–1979\n* 1971: Sean Clarkin is a Wexford based poet whose book is Without Frenzy (1974).\n* 1973: Eiléan Ní Chuilleanáin is a Dublin based poet, critic, and member of Aosdána. Her poetry books include Acts and Monuments (1973), Site of Ambush (1975), The Second Voyage (1977), Cork (1981), The Rose Geranium (1981), The Magdalene Sermon (1989), The Brazen Serpent (1994), The Girl Who Married the Reindeer (2001), Selected Poems (2008) and The Sun-fish (2009).\n* 1974: Paul Durcan is a Dublin-based poet and a member of Aosdána. His books include Endsville (with Brian Lynch, 1967), O Westport in the Light of Asia Minor (1975), ''Sam's Cross (1978), Teresa's Bar (1976), Jesus, Break his Fall (1980), Ark of the North (1982), The Selected Paul Durcan (edited by Edna Longley, 1982), Jumping the Train Tracks with Angela (1983), The Berlin Wall Café (1985), Going Home to Russia (1987), In the Land of Punt (with Gene Lambert, 1989), Jesus and Angela (1998), Daddy, Daddy (1990), Crazy About Women (1991), A Snail in My Prime: New and Selected Poems (1993), Give Me Your Hand (1994), Christmas Day (1997), Greetings to Our Friends in Brazil (1999), Cries of an Irish Caveman (2001), The Art of Life (2004), The Laughter of Mothers (2007), Life Is a Dream: 40 Years Reading Poems 1967–2007 (2009) and Praise In Which I Live And Move And Have My Being (2012).\n* 1975: John Ennis is a Waterford based poet. His books include Night on Hibernia (1976), Dolmen Hill (1977), A Drink of Spring (1979), The Burren Days (1985), Arboretum (1990), In a Greener Shade (1991), Down in the Deeper Helicon (1994), Telling the Bees (1995), Selected Poems (1996), Tráithníní (2000) and Near St Mullins (2002).\n* 1976: Aidan Carl Matthews is a Dublin-based poet, author and playwright. His poetry books include Windfalls (1977), Minding Ruth (1983), and According to the Small Hours (1998). His plays are The Diamond Body; Entrance, Exit; and Communion. His story collections are Adventures in a Bathyscope (1988), and Lipstick on the Host (1992). His novel is Muesli at Midnight (1990).\n* 1977: Thomas McCarthy is a Cork-based poet and Aosdána member. His poetry works include The First Convention (1978), The Sorrow Garden (1981), The Non-Aligned Storyteller (1984), Seven Winters in Paris (1989), The Lost Province (1996), Mr Dineen's Careful Parade: New and Selected Poems (1999), Merchant Prince (2005), and The Last Geraldine Officer (2009). His novels are Without Power (1990) and Asya and Christine (1993). He has also written the nonfiction The Garden of Remembrances (1998).\n* 1978: Rory Brennan is a Dublin-based poet whose works include The Sea on Fire (1978), The Walking Wounded (1985), and The Old in Raphallo (1996).\n* 1979: Michael Coady is a Carrick-on-Suir based poet and member of Aosdána. His books include Two for a Woman, Three for a Man (1980), Oven Lane (1987), All Souls (1998), One Another (2003) and Going By Water (2009).\n1980–1989\n* 1980: Nuala Archer is a Cleveland based poet whose books include Whale on the Line (1981), Two Shores: Poems by Medbh McGuckian and Nuala Archer (1989), The Hour of Pan/Amá (1992), From a Mobile Home (1995), and Inch Aeons (2006)\n* 1981: Harry Clifton is a Dublin-based poet and novelist and a member of Aosdána. His poetry books include The Walls of Carthage (1977), Office of the Salt Merchant (1979), Comparative Lives (1982), The Liberal Cage (1988), Night Train through the Brenner (1996), The Desert Route Selected Poems 1973–1988 (1992), God in France (2003), Secular Eden: Paris Notebooks, 1994–2004 (2007) and The Winter Sleep of Captain Lemass (2012). His novels include On the Spine of Italy (1999) and Berkeley's Telephone (2000, collected stories).\n* 1982: Peter Sirr is a Dublin-based poet and a member of Aosdána. His books include Marginal Zones (1984), Talk, Talk (1987), Ways of Falling (1991), The Ledger of Fruitful Exchange (2000), Bring Everything (2000), Nonetheless (2004), Selected Poems 1982–2004 (2004), and The Thing Is (2009).\n* 1983: Greg Delanty is a Vermont based poet. His books include Cast in the Fire (1986), Southward (1992), American Wake (1995), The Hellbox (1998), The Blind Stitch (2002), Collected Poems 1986–2006 (2006), and The Ship of Birth (2007). He co-edited The Word Exchange: Anglo-Saxon Poems in Translation (2010).\n* 1984: 'Tom O'Malley' is a Navan-based poet whose poetry book is Journey Backward (1988).\n* 1985: Roz Cowman is a Cork-based poet. Her collection is The Goose Herd (1989).\n* 1986: Padraig Rooneys poetry books are In the Bonsai Garden (1988), The Escape Artist (2006), and The Fever Wards (2010). His novel is Oasis (1982).\n* 1987: Anthony Glavin (died 2006) was a poet and music professor. His poetry book is The Wrong Side of the Alps (1989).\n* 1988: Angela Greene (deceased) was a poet whose poetry book was Silence and the Blue Night (1993).\n* 1989: Pat Boran is a Dublin-based poet and author, and a member of Aosdána. His poetry books include The Unwound Clock (1990), History and Promise (1990), Familiar Things (1993), The Shape of Water (1996), As the Hand, the Glove (2001), New and Selected Poems (2007) and The Next Life (2012). His prose books are All the Way from China (1998), Strange Bedfellows (1991), A Short History of Dublin (2000), and The Portable Creative Writing Workshop (2005).\n1990–1999\n* 1990: Sinéad Morrissey is a Belfast-based poet. Her books include There Was Fire in Vancouver (1996), Between Here and There (2001), The State of the Prisons (2005), Through the Square Window (2009), and Parallax (2013).\n* 1991: 'Sheila O'Hagan' is a Dublin-based poet. Her works include Peacock's Eye (1992), The Troubled House (1995) and Along the Liffey: Poems & Short Stories (2009).\n* 1992: Aine Millar is a Dublin-based poet. Her collection is Goldfish in a Baby Bath (1994).\n* 1993: 'Conor O'Callaghan' is a Manchester based poet. His poetry books include The History of Rain (1993), Seatown (1999), Fiction (2005), and The Sun King (2013). His novel is Red Mist: Roy Keane and the Football Civil War (2004).\n* 1994: Celia de Fréine is a Dublin-based poet and dramatist who writes primarily in the Irish language. Her poetry book in English is Scarecrows at Newtownards (2005) and her poetry collections in Irish are Faoi Chabáistí is Ríonacha (\"Of Cabbages and Queens\") (2001) and Fiacha Fola (\"Blood Debts\") (2004). Her plays include Nara Turas é in Aistear (\"That the journey may not have been in vain\") (2000), Anraith Neantóige (\"Nettle Soup\") (2004) and Cóirín na dTonn (\"Corinne of the Waves\") (2004).\n* 1995: William Wall is a Cork-based poet and author. His poetry books are Mathematics and Other Poems (1997), Fahrenheit Says Nothing To Me (2004) and Ghost Estate (2011). His novels include Alice Falling (2000), Minding Children (2001), The Map of Tenderness (2003) and This Is The Country (2005). His short story collection is No Paradiso (2006).\n* 1996: Bill Tinley is a Maynooth based poet whose book is Grace (2001).\n* 1997: Fr. Michael McCarthy is a Durham based priest and poet. His collections are Birds' Nests and Other Poems (2003). and At the Races (2009).\n* 1998: Carmel Fitzsimons is a London-based poet.\n* 1999: Eibhlin nic Eochaidh is a Leitrim based poet.\n2000–2009\n* 2000 : Joseph Woods is a Dublin-based poet, and was Director of Poetry Ireland 2001–13. His books are Sailing to Hokkaido (2001), Bearings (2005), and Cargo (2011). He was co-editor of Our Shared Japan (2007).\n* 2001: Ann Leahy is Dublin based, and her collection is The Woman who Lived Her Life Backwards. (2008)\n* 2002: Alice Lyons is a Roscommon based poet and artist whose collection is Staircase Poems (2006)\n* 2003: Manus McManus is a Dublin-based poet and film writer/director.\n* 2004: Joseph Horgan is a Cork-based poet. His poetry collections are Slipping Letters Beneath the Sea (2008), A Song at Your Backdoor (2010) and An Unscheduled Life (2012).\n* 2005: Dave Lordan is Greystones based, and his poetry collections are The Boy in the Ring (2008), Invitation to a Sacrifice (2010) and Lost Tribe of the Wicklow Mountains (2015).\n* 2006: Enda Coyle-Greene is a Skerries-based poet whose collections are Snow Negatives (2007) and Map of the Last (2013).\n* 2007: Conor Carville is a Reading based poet whose first collection is Harms Way (2013).\n* 2008: Geraldine Mitchell is a County Mayo-based poet whose collections are World Without Maps (2011) and Of Birds and Bones (2014). She has written two novels for young people, Welcoming the French (1992) and Escape to the West (1994); and a biography of Muriel Gahan, Deeds Not Words (1997).\n* 2009: Martin Dyar is a Dublin and County Mayo-based poet whose first collection is Maiden Names (2012).\n2010–2019\n* 2010: Connie Roberts, a Co. Offaly native, emigrated to the United States in 1983. Her first collection is Little Witness (2015).\n* 2011: Helena Nolan is Kilkenny-born and working in Dublin.\n* 2012: Caoilinn Hughes is a Galway-born writer, currently working at Maastricht University in the Netherlands. Her first collection, Gathering Evidence (Carcanet 2014), won the Irish Times Strong/Shine Award in 2015.\n* 2013: Rafiq Kathwari lives in Omeath, Co. Louth. He was born in Kashmir and spent most of his adult life in the U.S. His collection is In Another Country (2015).\n* 2014: John Fitzgerald lives in Co. Cork and, until his retirement in 2022, was the librarian at University College Cork. He has published two collections with Gallery Press, The Time Being (2021) and Long Distance (2024), as well as a translation of The Lament for Art O'Leary (2023).\n* 2015: John Mee lives in Cork and is a professor of law at University College Cork. His pamphlet, From the Extinct, was published by Southword Editions (2016) and his first collection The Blue in the Blue Marble was published by Templar Poetry in 2024.\n* 2016: 'Laurence O'Dwyer', born in Tipperary, is a graduate of University College Cork and holds a PhD from Trinity College Dublin. He has published two collections with Templar Poetry: Tractography (2018) and Catalan Butterflies (2022).\n* 2017: Ruth Timmins is Dublin born but now lives in Curracloe, Co. Wexford.\n* 2018: Conor Cleary is Tralee born but now lives in Glasgow. He is a graduate of Trinity College Dublin and has an MA from Queens University Belfast. His pamphlet, Priced Out'', was published by the Emma Press in 2019.\n* 2019: Scott McKendry is a Belfast native. He holds a PhD from Queen's University Belfast and is currently a Government of Ireland Postdoctoral Fellow at Trinity College Dublin. His pamphlet Curfuffle (\"The Lifeboat\") was selected as Poetry Book Society Autumn Choice 2019. His first collection Gub was published in 2024 by Corsair Books.\n2020–ongoing\n* 2020: No award this year\n* 2021: Jerm Curtin is originally from Boherbue in north west Cork and now lives in Spain where he teaches English as a foreign language. He won for his collection A Drowned City, a vision of Cork City permanently under water due to climate change. Judge Brian Lynch said \"Curtin combines the sensitivity to language of a poet with a novelist's eye for character\". A chapbook Cacti & other poems was published by Southword editions in 2024.\n* 2022: Ben Keatinge was born in Dublin and is an alumnus of the School of English, Trinity College Dublin.\n* 2023: '''Lauren O'Donovan is from Cork. She is co-founder of Lime Square Poets and HOWL New Irish Writing.\n* 2024: Simon Costello' is from Offaly. His debut pamphlet Saturn Devouring was published by The Lifeboat Press.\nAnthology\nDancing with Kitty Stobling: Patrick Kavanagh Poetry Award Winners, 1971–2003'' is a selection of poems edited by Antoinette Quinn and was published by Liliput Press in 2004.\nReferences"
    }
  ]
}