{
  "content": [
    {
      "type": "text",
      "text": "# Patrick Shaw-Stewart\n\n| birth_place               = near Llanbedr, Merionethshire, Wales\n| death_date                =\n| death_place               = France\n| death_cause               = Killed in action\n| resting_place             = Metz-en-Couture, France\n| resting_place_coordinates =\n| monuments                 = Memorial at Balliol College Chapel, Oxford\n| nationality               = British\n| other_names               =\n| alma_mater                = Balliol College, Oxford\n| occupation                = Banker\n| years_active              =\n| employer                  = Barings Bank\n| organization              =\n| known_for                 =\n| notable_works             = \"Achilles in the Trench\" (poem)\n| style                     =\n| title                     =\n| partner                   =\n| children                  =\n| parents                   =\n| relatives                 =\n| module        =\n| branch        =\n| serviceyears  = 1914–1917\n| rank          = Lieutenant commander\n| battles       = First World War\n| unit          = 63rd (Royal Naval) Division\n}}\n}}\nPatrick Houston Shaw-Stewart (17 August 1888 – 30 December 1917) was a British scholar and poet of the Edwardian era who died on active service as a battalion commander in the Royal Naval Division during the First World War. He is best remembered today for his \"Achilles in the Trench\", one of the best-known war poems of the First World War.\nLife\nPatrick Shaw-Stewart was born in Aber Artro Hall, near Llanbedr in Merionethshire, Wales. He was the son of Major-General John Heron Maxwell Shaw-Stewart (1831–1908), a military engineer, and Mary Catherine Bedingfeld Shaw-Stewart. While Patrick was still young his parents' marriage broke down and he was largely raised by a nanny, whom he habitually referred to as \"dear\". His appearance was quite striking with a shock of bright ginger hair, pale white freckled skin, and a lengthy nose.\nHe began his studies at Eton College, where his academic career was from the beginning marked by great success. He came first in the Eton scholarship in 1901, a year after his friend, Ronald Knox, had come first in the same examination. He won the college's Newcastle Scholarship in 1905.\nShaw-Stewart subsequently matriculated at Balliol College, Oxford. At Oxford, he won the Craven, the Ireland, and the Hertford Scholarships in Classics as well as taking a double first in Classical Moderations in 1908 and Greats in 1910. Elected to a fellowship of All Souls' College, Oxford, he instead committed his career to Barings Bank due to the prospect of considerable financial rewards. In 1913, he was appointed one of the youngest managing directors in the bank's history.\nAt this time he became devoted to Lady Diana Manners and wrote her many intimate letters full of erotic allusions to Greek and Latin literature, though it proved to be a case of unrequited love, as Manners was devoted to Raymond Asquith, and after his death married Duff Cooper. He became a leading member of her \"corrupt coterie\" known as the Coterie. Another member of the Coterie, Julian Grenfell, said of Shaw-Stewart at this time \"animals edge away from him, and the more intelligent the animal, the more they edge away from him\", and also \"I think there is something rather obscene about him, like the electric eel at the zoo.\" Raymond Asquith's pithy appraisal was \"not long enough in the bottle\". Both found his single-minded preoccupation with achieving wealth and status somewhat distasteful.\nShaw-Stewart served in the Royal Naval Volunteer Reserve. When war was declared in 1914, he joined the Royal Naval Division, serving with Rupert Brooke. Shaw-Stewart was present at Brooke's burial on Skyros and commanded the firing party. He was shaken by his prominent role in the young poet's funeral in Greece: \"The brilliant and beguiling youth who had never failed in anything, for whom all life's prizes seemed to wait his taking, had little wish to outlive his friends.  He now used all his charm and influence in high places to get into the firing line.\"\nWhile he was at Imbros he seemed to enjoy speaking ancient Greek to the inhabitants of the island; in one of his letters he wrote: \"here I am, living in a Greek village and talking the language of Demosthenes to the inhabitants (who are really quite clever at taking my meaning).\"\nShaw-Stewart was involved in the Gallipoli campaign, which was his first experience of real combat. His letters home to friends and relations showed an increasing sense of frustration and disillusionment with the war. After the Allied withdrawal from the Dardanelles, he was posted to Salonika in a liaison role with the French.\nIn 1916, the Cross of Chevalier of the French Legion of Honour was conferred upon him \"in recognition of valuable services rendered\". and, later the same year, he was awarded the Croix de Guerre.\nDuring 1917, Shaw-Stewart increasingly felt that he was doing very little of any use in Salonika and was missing the comradeship of his friends in the Royal Naval Division. After having several requests to be moved to France turned down, he effectively absconded while on leave in England and rejoined his old battalion in France.\nPromoted to lieutenant commander and in temporary command of the Hood Battalion, he was killed in France on 30 December 1917 while making his way up a sunken road just behind the fire trenches. Stewart was struck in the mouth by a shell fragment and died almost immediately.  He is buried at Metz-en-Couture in the British extension to the communal cemetery.\nWork\nHis fame today stems from one of his poems, \"Achilles in the Trench\", one of the best-known of the war poems of the First World War.  It was written while Shaw-Stewart waited to be sent to fight at Gallipoli and was on leave on the island of Imbros, overlooking Hisarlik (the site of the ancient city of Troy), and in the poem, Shaw-Stewart makes numerous references to the Iliad, questioning, \"Was it so hard, Achilles,/So very hard to die?\"  In the stanza beginning, \"O hell of ships and cities\", he plays on the similarity of \"hell\" and \"Helen\", imitating the similar wordplay in Aeschylus's Agamemnon 681–690. In the final stanza, he evokes the image of flame-capped Achilles screaming from the Achaean ramparts after the death of Patroclus and requests that Achilles likewise shout for him during the battle.\nLegacy\nThe first biography of Shaw-Stewart, by Ronald Knox, was published in 1920. Elizabeth Vandiver's Stand in the Trench, Achilles includes a detailed discussion of Shaw-Stewart. A new biography by Miles Jebb was published in May 2010.\nA memorial to him was erected at Balliol College on the west wall of the Chapel passage. He is also named on the war memorial in the antechapel at All Souls College, Oxford and on the Knockbain parish war memorial in the county of Ross and Cromarty, Scotland.\nSee also\n* Siegfried Sassoon\nReferences\nFurther reading\n* Charlotte Higgins, \"'Achilles in the Trenches':  The Iliad and the Poetry of WW1\", The Guardian, Monday, 1 March 2010.\n* Evelyn Waugh (1959), Ronald Knox:  A Biography, 1988 reprint, London:  Cassell,  .\n*\nExternal links\n* [http://archives.balliol.ox.ac.uk/Past%20members/PHStewart.asp Biography from Balliol College, Oxford]\n* [http://www.poetryfoundation.org/poem/248442 Text of \"Achilles in the Trench\"]\n* [https://www.poetryfoundation.org/poets/patrick-shaw-stewart Patrick Shaw-Stewart]\n*"
    }
  ]
}