{
  "content": [
    {
      "type": "text",
      "text": "# Paul Hockings\n\n| birth_place        = Hertford, England\n| nationality        = British\n| occupation         = Anthropologist\n| known_for          = Ethnographic documentaries\n| awards             = Nilgiris Lifetime Achievement Award (2015)\n| education          = Doctor of Philosophy\n| alma_mater         =\n| discipline         = Anthropology\n| sub_discipline     =\n| workplaces         = Former dean at the Faculty of Social Sciences and Humanities of United International College, China\n| main_interests     =\n| notable_works      =\n}}\nPaul Hockings (born February 23, 1935) is an anthropologist whose prime areas of focus are the Dravidian languages, social, visual and medical anthropology.\nHe studied archaeology and anthropology at the University of Sydney, the University of California, Berkeley, and at the universities in Chicago, Stanford and Toronto. He taught anthropology at the University of California, Los Angeles and the University of Illinois at Chicago, and he has been the dean of United International College's Faculty of Social Sciences and Humanities. In 2024, he retired as the editor-in-chief of Visual Anthropology.\nEarly life and family\nHockings was born on February 23, 1935, at Hertford and was raised in Hampshire, England. At the age of ten years, he developed interest in prehistory and museums. His father Arthur Hockings, a Londoner, was a cricketer and an engineer, who worked as a personal assistant for Henry Royce. Later, he helped design landing-craft for D-Day. In 1952, Paul migrated to Australia with his parents.\nEducation\nHockings studied Near-Eastern archaeology at the University of Sydney, and completed two majors in the subjects of archaeology and anthropology at that university. In 1962, after receiving a grant for field studies from American Institute of Indian Studies, he moved to the Nilgiris in India and did research on the Badagas of the Nilgiris, completing a Ph.D. on this subject in 1965. He also studied anthropology at the universities of Chicago, Stanford, Toronto, and at the University of California, Berkeley.\nCareer and research\nHockings made (with director Mark McCarty) the first film in the style of observational cinema, entitled The Village. It was filmed in the summer of 1967 in Dunquin, a Gaeltacht village located at the westernmost tip of the Dingle Peninsula, overlooking the Blasket Islands, in County Kerry, southwestern Ireland, and released in 1968. In 1969, he was signed as an anthropologist by MGM Studios to make a film on mankind's origins for NBC television, entitled The Man Hunters; it drew a large North American audience. He was then working as a research director for MGM Documentary Dept. About the same time he served as the last research assistant for Ruth St. Denis, and was on an expedition to India with the photographer Alfred Eisenstaedt. He was the editor-in-chief of Visual Anthropology for a third of a century; and the University of Oslo has described him as \"a pioneer in the fields of ethnographic film and visual anthropology\".\nHockings is a professor emeritus of anthropology from the University of Illinois at Chicago. He worked at the University of California, Berkeley as a research assistant for David G. Mandelbaum, while also studying with Aldous Huxley and others; and then taught anthropology at the University of California, Los Angeles, before moving to Chicago. For a brief period he worked at the Museum of Anthropology at the University of British Columbia, and as a script writer, journalist and librarian in New Zealand. He served in China as the dean of Social Sciences and Humanities at the United International College in Zhuhai, and in Chicago as a Field Museum of Natural History's adjunct curator of anthropology.\nHe has studied the cultures of South India, and has been working with the Badagas for more than 50 years. He has researched their medical anthropology, culture and language.\nAwards\nIn 2015, he was awarded the Nilgiris Lifetime Achievement Award by the Nilgiri Documentation Centre; and in 2016, a Lifetime Achievement Award of the Society for Visual Anthropology.\nWorks\nHockings made several documentaries and published about 20 books and more than 200 papers.\nBooks\n*Hockings, Paul, and Christiane Pilot-Raichoor (2023). A Badaga and English Dictionary: Glossary and Gazetteer. New Delhi: Manohar. ISBN 978-93-91928-17-9.\n*\n*\n*\n*\n*\nSelected papers\n*\n*\n*\nDocumentaries\n*\nSee also\n*Colin Young\n*David G. Mandelbaum\nReferences\nExternal links\n*\n*"
    }
  ]
}