{
  "content": [
    {
      "type": "text",
      "text": "# Paul Warren (guitarist)\n\n| birth_place       = Garden City, Michigan, U.S.\n| death_place       =\n| occupation        = Guitarist\n| years_active      = 1970s–present\n| website           =\n}}\nPaul Warren (born December 22, 1953) is an American rock and blues guitarist, known for being a member of a few rock bands as well as the former touring guitarist for English rock singer Rod Stewart for 11 years. He also played with American rock singer Richard Marx. Warren was also a member of Ray Manzarek's Nite City from 1977 until their disbanding in 1978. In 1984 he toured with The Ventures, serving as their bassist while Bob Bogle took a tour break. In 2013, Rod Stewart hired a new guitarist and Warren was let go. Warren was also a session musician for Motown records in the early to mid-1970s and played on numerous albums.\nBiography\nWarren was born in Garden City, Michigan, to Pearl Elwanda Gribble and Walter Wayne Warren. His family relocated to Plymouth, Michigan, when Paul was a child. He started to play guitar at twelve years old, and at the age of seventeen, he was discovered by Norman Whitfield of Motown Records. Soon after, he became a regular session player for the famed Hitsville studios. The first recording he ever played on was \"Papa Was a Rollin' Stone\" by The Temptations. The song went to #1 on the Pop and Rhythm & Blues charts in 1972. It won a Grammy Award in 1983.\nWarren appeared with the band Pacific Gas & Electric in 1972 on the German television show Beat Club. He also claims to have performed the famous guitar solo on Funkadelic's song \"Get Off Your Ass and Jam\".\nAfter playing on numerous albums, he became a working studio musician, and when Motown moved offices to California in 1973, they paid for him to move so they could continue using his services as a session guitar player. He joined the rock band Rare Earth and is credited as being co-writer on three songs from the Back to Earth album.\nAfter quitting Motown in 1975, Ray Manzarek of The Doors employed Paul as lead guitarist for his new band Nite City. By their second album, Paul had also become the lead singer and wrote a number of songs on the Album Golden Days Diamond Nights. The band had separated by the release of their second album. In the late 1970s, Paul formed his own band Paul Warren & Explorer – and was a regular on the Sunset Strip scene playing almost every weekend at the Roxy, Whisky a Go Go, the Starwood, Madame Wong's in Chinatown, or other clubs. He was signed by RSO Records and released his failed first solo album One of the Kids in 1980. Later that year, RSO Records folded and Warren was unemployed. He became a guitar player for hire from 1981 until 1987, working for such greats as The Ventures, Tina Turner and Prism. He is also credited with producing a number of records in this era.\nIn 1987, he joined Richard Marx at the beginning of his career soon after the release of Richard's multi-platinum debut album. Warren was Marx's Musical Director for seven years before leaving in 1994. The day after quitting Marx's band, Warren went out on the road to work as lead guitarist for British singer Joe Cocker. The \"Have a Little Faith Tour\" lasted 18 months. In 1996, Warren was employed by Italian singer Eros Ramazzotti. His guitar playing for Eros lasted eleven years before quitting for good in 2005.  In the interim, circa 1999, he was employed in between tours with Eros to work as guitarist for Rod Stewart.  In late 2010, he released his first solo album in over a decade entitled Round Trip with his own band. [https://www.facebook.com/PaulWarrenProject?sk=wall The Paul Warren Project]\nIn recent years, Warren has worked on recording sessions with local artists, producers and recording studios. He is working on obtaining a pilot license as well as taking boxing lessons.\nWarren and his wife Melanie reside in Watertown, Tennessee, a suburb of Nashville.\nDiscography\n* Rare Earth - Back to Earth (1975)\n* Nite City - Nite City (1977)\n* Nite City - Golden Days Diamond Night (1978)\n* Paul Warren & Explorer - One of the Kids (1980)\n* Prism - Beat Street (1983)\n* The Paul Warren Project - Round Trip (2011)\n* Cactus - Tightrope (2021)\nReferences\nExternal links\n* [https://www.facebook.com/PaulWarrenProject The Paul Warren Project] on Facebook\n* [http://www.rodstewartfanclub.com/about_rod/article/EpFAEkEFEkHnZmwSsx.php Rod Stewart fan club site]\n* [https://www.youtube.com/watch?v=u6znXTbfJKI&list=RDMM&index=4 Pacific Gas & Electric on Beat Club (1972)]"
    }
  ]
}