{
  "content": [
    {
      "type": "text",
      "text": "# Paul Ewart\n\n(death date then birth date)-->\n| death_place =\n| death_cause =\n| resting_place =\n| resting_place_coordinates =\n| other_names =\n| residence   =\n| citizenship =\n| nationality =\n| fields      =\n| workplaces  = University of Oxford\n| patrons     =\n| education   =\n| alma_mater  = Queen's University Belfast\n| thesis_title =\n| thesis_url  =\n| thesis_year =\n| doctoral_advisor =\n| academic_advisors =\n| doctoral_students =\n| notable_students =\n| known_for   =\n| influences  =\n| influenced  =\n| awards      =\n| spouse      =\n| partner     =\n| children    =\n| signature   =\n| signature_alt =\n| website     =\n| footnotes   =\n}}\nPaul Ewart is professor of physics and former head of the sub-department of atomic and laser physics within the Department of Physics, University of Oxford, and fellow and tutor in physics at Worcester College, Oxford, where he is now an emeritus fellow.\nBorn in Belfast, Ewart studied at Queen's University Belfast obtaining BSc and PhD degrees in physics. After holding a research post in the Blackett Laboratory at Imperial College London he was appointed to a position at Oxford. His research concentrated on the use of laser spectroscopy to study combustion, aiming to improve the efficiency of engines.\nEwart would normally have been required to retire from the University of Oxford in 2015, as part of an Employer Justified Retirement Age (EJRA) policy which required academics to retire by the September following their 67th birthday, but was granted a two-year extension to September 2017. A second application for a further three year extension was refused, and Ewart challenged the policy in a tribunal, claiming that his dismissal was unfair and amounted to age discrimination, contrary to the Equality Act 2010. In December 2019 a tribunal found in his favour, concluding that the university had not justified \"what would otherwise be discrimination, and accordingly on each of the points of age discrimination alleged we find that the claimant has been discriminated against unlawfully on grounds of his age\", adding that \"There can hardly be a greater discriminatory effect in the employment field than being dismissed simply because you hold a particular protected characteristic\". In January 2020 the university announced its intention to appeal. In October 2020 Ewart was reinstated, with the payment of back pay and additional financial compensation. The university appealed the decision but the appeal was dismissed on 27 September 2021.\nSelected works\n*\n*\n*\n*\n*\nReferences"
    }
  ]
}