{
  "content": [
    {
      "type": "text",
      "text": "# Paulus Edward Pieris Deraniyagala\n\nPaulus Edward Pieris Deraniyagala (1900–1976) was a Sri Lankan paleontologist, zoologist, and artist.\nEarly life and education\nHe was born in Colombo, the son of Paul Edward Pieris and Lady Hilda Obeyesekere Pieris. He had two younger brothers, Justin Pieris Deraniyagala, Ralph St. Louis Pieris Deraniyagala, and a sister, Miriam Pieris Deraniyagala. He was educated at S. Thomas' College, Mount Lavinia and Trinity College, Cambridge, where he gained a BA in 1922 and an Oxbridge MA in 1923. He entered Harvard University for a year, where he was awarded a Master of Arts in 1924.\nCareer\nHe specialised in fauna and human fossils of the Indian subcontinent. From 1939 to 1963, he was the director of the National Museum of Ceylon, and from 1961 to 1964, he was also the dean of the Faculty of Arts at the Vidyodaya University.\nHe described several fossils and proposed scientific names for species and subspecies, with several now identified as dubious, including:\n*Sri Lankan rhinoceros (Rhinoceros sinhaleyus) in 1936 for a fossil found in Ratnapura District\n*Sri Lankan hippopotamus (Hexaprotodon sinhaleyus) in 1937\n*Sri Lanka lion (Leo leo sinhaleyus) in 1939 for two fossil teeth found at Kuruwita - the information about the teeth is not sufficient to determine whether it differs from other subspecies.\n*Panthera tigris sudanensis was named in 1951 for a tiger skin that he saw in a Cairo bazaar. When he asked the shop owner for the origin of this specimen, he was told that the animal was shot in Sudan. Vratislav Mazák thought it likely that the skin was smuggled from Iran or Turkey to Egypt and commented \"the situation is half-humorous, half-ironic\".\n*Javan elephant (Elephas maximus sondaicus) was described  in 1955 based on an illustration of a carving on the Buddhist monument of Borobudur in Java. It is considered synonymous with the Indian elephant (E. m. indicus).\n*Balangoda Man (Homo sapiens balangodensis) in 1955\n*Sri Lankan rhinoceros (Rhinoceros kagavena) in 1956\n*Sri Lankan gaur (Bibos sinhaleyus) in 1962\nDuring his trips to China, he studied the Chinese alligator and published a new genus name for it. In the scientific field of herpetology, he described many new species of lizards and snakes.\nHe served as president of the Ceylon Branch of the Royal Asiatic Society from 1952 to 1955.\nDeraniyagala is commemorated in the scientific names of three species of Sri Lankan reptiles: Aspidura deraniyagalae, Lankascincus deraniyagalae, and Nessia deraniyagalai.\nFamily\nHe was married to Prini Molamure; their son Siran Upendra Deraniyagala is also a scientist, specialising in archeology.\nSee also\n*:Category:Taxa named by Paulus Edward Pieris Deraniyagala\n* List of herpetologists\nReferences\nExternal links\n*[http://www.rootsweb.ancestry.com/~lkawgw/gen1005.html Genealogy of the Deraniyagala family, including a photo of Dr. Paul E. P. Deraniyagala]\n*[http://www.lankalibrary.com/geo/india-lanka.htm Dr. Paul E. P. Deraniyagala and his son's work, including two drawings by the former]"
    }
  ]
}