{
  "content": [
    {
      "type": "text",
      "text": "# Paul Schwarzkopf\n\n| birth_place        = Prague, Czech Republic\n| death_date         =\n| death_place        = Reutte, Austria\n| known_for          = Plansee Group\n| spouse             =\n}}\n| honours            = Wilhelm Exner Medal\n}}\nPaul Schwarzkopf (13 April 1886 – 27 December 1970) was an Austrian inventor and industrialist. Schwarzkopf is also credited with pioneering powder metallurgy.\nCareer\nAfter studying technical sciences in Prague (where he also became active with the Corps Austria, but later left) and Berlin, Schwarzkopf succeeded in inventing the drawn tungsten filament in 1911 in the Italian light bulb factory Lampada Zeta in Alpignano near Turin. This ductile thread was industrially manufactured in 1913 in a company founded by Schwarzkopf and his partner Karl Chvalov in Berlin. During World War I, Schwarzkopf first served in a Bohemian regiment, then went to the reserve officer school in Innsbruck in Tyrol, and then to the southern front.\nFrom 1909, he was a partner in the Deutsche Filament Factory in Berlin. In 1920, with his friend Richard Kurtz, he founded the Naamlooze Vennootschap Vereenigte Draadfabricken (NVVD) in Nijmegen, Netherlands for the production of tungsten wire. Thanks to the Reutte lawyer Hermann Stern, in 1922, he persuaded Schwarzkopf to establish the Plansee metal works.\nAfter the Anschluss, his assets were confiscated by the National Socialists, and the Plansee company was aryanized and the ownership was given to Deutsche Edelstahlwerke (DEW). Since he was a Jew, according to the Nuremberg Laws, he had to immigrate together with his family and moved to the USA. In 1947, he and his family returned to Austria and filed a restitution request for the company as well as claims for compensation for the stolen private properties, which was granted in 1952.\nPersonal life\nHe married Emma Sophia Gebauer and bore a son, Wilhelm (1907–1954) and son, Hans Heinrich (1913-1991). In 1930, he also married Maria Mondini and they gave birth to a son, Walter Max (1931–1978).\nSchwarzkopf died in his home in Reutte in 1970.\nHonors\n* In 1955, he received the Wilhelm Exner Medal.\n* In 1956, he was appointed honorary senator of the University of Innsbruck.\nReferences"
    }
  ]
}