{
  "content": [
    {
      "type": "text",
      "text": "# Paul Anthony Stewart\n\nPaul Anthony Stewart (born February 23, 1967) is an American stage and television actor.\nWhile Stewart has numerous theater credits, he is best known for portraying Danny Santos in the daytime soap opera Guiding Light.\nEarly life\nStewart was born Paul Anthony Tamaccio in Philadelphia.  He was raised in the nearby suburb of  Wayne, Pennsylvania, where he attended Radnor High School.  Upon high school graduation Stewart attended prestigious Princeton University, where he graduated with a degree in drama with an emphasis on dramatic literature.\nCareer\nStewart landed the role of Casey Bowman, a man with a troubled father, on the soap opera Loving. He was cast after a nationwide talent search, and began appearing on the show in April 1992. While portraying Casey by day, Stewart landed the starring role of Christian in the 1993 production of Cyrano: The Musical on Broadway at the Neil Simon Theatre.\nIn November 1998, Stewart began appearing as Danny Santos on Guiding Light.  In 2003 Stewart earned a Daytime Emmy Award Nomination for Outstanding Supporting Actor for the role of Danny. He also appeared in the 2003 revival of Fiddler on the Roof at the Minskoff Theatre, replacing Robert Petkoff as the progressive student Perchik.  On November 22, 2005, Stewart left his Guiding Light role. He and costar Nancy St. Alban, who played Danny's wife Michelle, made appearances in 2009 as the show concluded its run.\nAdditional theater work\nStewart's Broadway appearances include the role of Jerzy in the short-lived 2011 production of The People in the Picture at Studio 54. Off-Broadway, Stewart completed a limited run of Harbor at 59E59 Theater in September 2013. He also appeared in a new work by John Kander, The Landing, along with Julia Murney, David Hyde Pierce, and Frankie Seratch. The show ran Off-Broadway at the Vineyard Theatre in 2013.\nStewart has also appeared in Beautiful: The Carole King Musical as Don Kirshner.\nPersonal life\nStewart has been married to Michael Cook, a stylist and fashion editor, since August 2017.\nReferences\nExternal links\n*\n*\n*[http://www.soapcentral.com/gl/theactors/stewart.php Paul Anthony Stewart profile]"
    }
  ]
}