{
  "content": [
    {
      "type": "text",
      "text": "# Paul Dujardin (art historian)\n\nPaul Dujardin (born 1963) is an art historian and between 2002 and 2021, director-general of BOZAR in Brussels.\nCareer\nIn 1986 he became a graduate in art history and archeology at the Vrije Universiteit Brussel and in 1987 he obtained a degree in policy sciences at the VLEKHO. He also studied at the University of Oviedo, the Goethe-Institut and the Freie Universität Berlin.\nHe became assistant to the Secretary-General of the International Federation for Youth and Music. With Bernard Foccroulle and Claude Micheroux, he organized a series of seminars in collaboration with Les Jeunesses Musicales de la Communauté française. In 1989 he was one of the founders of the Festival of contemporary music Ars Musica of which he remained the coordinator until 1993.\nIn 1992 he became director-general of the Philharmonic Society of Brussels and took over the artistic direction and programming of the National Orchestra of Belgium. From 1996 to 2002 he represented the Philharmonic Society of Brussels in the European Concert Hall Organization (ECHO), an international federation that unites the most important European Arts Centers.\nIn January 2002, Dujardin became deputy director and artistic director of the Center for Fine Arts in Brussels. His alma mater describes Dujardin as someone who has taken this federal institution out of the cobwebs and transformed it into a prestigious cultural house without barriers.\nDujardin actively promotes the European cultural heritage, values and the European project. He has received several international awards and honors for his contribution to the promotion of European culture. He was President of the Direction Committee of the “New Narrative for Europe” project: an initiative of the European parliament implemented in collaboration with the European Commission launched to reinforce and promote the fundamental values related to science and culture). He also advocates in favor of giving culture a more important role in EU foreign affairs as an instrument of ‘soft power'.\nAwards and honors\n* 2020: Cross of Honour for Science and Art, First Class\n* 2014: Honorary doctorate ULB\n* 2011: Officer in the Order of Leopold(Belgium)\n* 2010: Recognition for Merits in Organizing the Chopin Year in Belgium, awarded by the Ambassador of Poland to Belgium\n* 2010: Order of Merit of the Federal Republic of Germany\n* 2009: Order of Cultural Merit van Hwagwan, South Korea\n* 2009: Granted hereditary Belgian nobility, with personal title of knight\n* 2006: Croix du mérite en vermeil, Luxembourg\nReferences"
    }
  ]
}