{
  "content": [
    {
      "type": "text",
      "text": "# Paul Miles-Kingston__disambig_1\n\nPaul Kenneth Miles-Kingston (born 8 April 1972, in London, England) is a British director of music, bass singer and organist who achieved fame as a boy soprano classical singer.\nChildhood and singing career\nPaul Miles-Kingston was born in 1972, the son of William Henry Miles-Kingston (1932-1999) and Carole Miles-Lovelock (formerly Miles-Kingston), née Brett (1945-2022). He has two brothers.\nMiles-Kingston received his primary education at St Faith’s Primary School, Winchester.\nIn 1982, he won a choral scholarship to Winchester Cathedral Choir. While a chorister, he sang many solos in services, broadcasts and oratorios. He toured the US and Canada with the choir in 1983, and sang with them at the BBC Proms. He won several prizes as a chorister for his solo singing and also for his musical contribution at The Pilgrims' School (the Winchester Cathedral Choir School).\nHe achieved success as a treble soloist in Andrew Lloyd Webber's Requiem, appearing with Sarah Brightman, Plácido Domingo and the Winchester Cathedral Choir at the world premiere in New York City and the British premiere in Westminster Abbey.\nMiles-Kingston was awarded a silver disc for the single 'Pie Jesu', which reached number 3 in the charts, and also received gold and platinum discs for the album, which sold over 400,000 copies by 1985 and won a Grammy Award in 1986. Jacob Siskind gave this review in Ottawa Citizen of Miles-Kingston's performance on the recording:\n\"Paul Miles-Kingston is the superb boy-soprano. He is so good he may almost give trebles a good name.\"\nIn 1985, Miles-Kingston sang twice at the Barbican Centre in London and also took part in a Gala Royal attended by Queen Elizabeth II and Prince Philip, Duke of Edinburgh in Edinburgh. On 18 August 1985, he appeared in Opera for Africa at the Arena di Verona in Italy, where he sang Lloyd Webber's 'Pie Jesu' with Sarah Brightman (with Lloyd Webber himself conducting for the first time in his career) and with singers such as Gwyneth Jones, Agnes Baltsa, Zdzisława Donat, Sherrill Milnes, José Carreras, Renato Bruson, Yevgeny Nesterenko and Giorgio Zancanaro making up the chorus. His performance was included on the CD that was released subsequently.\nMiles-Kingston was head chorister of Winchester Cathedral from January to July 1985. At that time Martin Neary was organist and master of the choristers. Together they released the album Music From Winchester Cathedral in 1985. The magazine The American Organist gave Miles-Kingston the following review for his singing talent in the July 1987 issue:\n\"His voice is quintessentially English: that is to say, it is not especially big, nor does it have the reedy continental color. But it is pure, clear and flawlessly even throughout its range. Although I doubt it was intended for the purpose, this recording will be an invaluable study instrument for trainers of childrens' voices and choirs.\"\nMiles-Kingston continued his education at Cranleigh School in Surrey and later at Durham University where he graduated in music and achieved a first in his finals recital as an organist.\nFor several years he worked as an oratorio soloist and consort singer, where he sang bass.\nAdult career and personal life\nMiles-Kingston has a Master of Arts in music from University of York, 2009, based on his thesis \"Training Boys to Sing\" from 2008. He has been St Peter's School, York director of music since September 2010, having served in the capacity as assistant director of music at the school since 2006.\nHe emphasizes that being a chorister or teaching choristers is not only about the music, but also about acquiring skills that benefit one later in education and life:\n\"Being a cathedral chorister involves commitment, hard work and sustained focus — skills which transfer directly to academic learning.\"\nHis son, William 'Will' Miles-Kingston, was tutored by him in singing, and as a chorister at York Minster won the BBC Radio 2 Young Choristers of the Year competition in 2019.\nRecordings\nSingles\n*\"Panis angelicus\"\n*\"I Wonder as I Wander\"\n*\"Bulalow\"\n*\"Pie Jesu\" (Duruflé)\n*\"Pie Jesu\" (Lloyd Webber)\n*\"Lullaby My Liking\"\n*\"Lord's Prayer\"\n*\"Nunc Dimittis\"\n*\"Bist du bei mir\"\nCD\n*A Dedication with Carole & Paul Miles Kingston (recorded in Romsey Abbey on 13 & 14 April 2004)\nReferences\nExternal links\n*[http://www.boysoloist.com/artist.asp?vid=368 The Boy Choir & Soloist Directory]\n*[https://www.youtube.com/watch?v=4qRSo-h6JBw Singing as a 10-year-old, with Sarah Brightman]"
    }
  ]
}