{
  "content": [
    {
      "type": "text",
      "text": "# Pawari\n\nBhoyari or Pawari is an Indo-Aryan dialect of central India, exclusively spoken by the people of the Kshatriya Pawar (Pawar / Bhoyar Pawar) caste. It is a dialect of the Rajasthani Malvi language, primarily spoken in the regions of Betul, Chhindwara, Pandhurna, and Wardha by the people of the Kshatriya Pawar (Bhoyar Pawar) caste. This is the same language that these people used to speak in their original homes in Rajasthan and Malwa. Between the 15th and 17th centuries, the Pawars migrated from Rajasthan and Malwa to the Satpura and Vidarbha regions, settling primarily in Betul, Chhindwara, Pandhurna, and Wardha districts. This language is exclusive to the Pawar community; no people of other castes speak this language, clearly showing the connection of the Pawars to Rajasthan and Malwa.\nInfluences\nToday, this dialect of Rajasthani Malvi has slight influences from Bundeli, Nimadi, and Marathi languages. In the districts of Betul, Chhindwara, and Pandhurna, Pawari has a slight Bundeli influence, whereas in the Wardha district, there is more Marathi influence. The Pawari spoken in Betul, Chhindwara, and Pandhurna is considered pure, as it is minimally influenced by other languages, with only a slight Bundeli touch. In contrast, the Pawari of the Wardha district is somewhat more mixed with Marathi, making the Pawari of Betul, Chhindwara, and Pandhurna more prestigious.\nDespite the change in location, the Pawars have retained their pure Rajasthani Malvi language. According to some scholars, Pawari is a dialect of Rangri (another dialect of Rajasthani Malvi), which is slightly mixed with Marwari, Mewadi, and Gujarati languages, further reinforcing the connection of the Pawars to Rajasthan and Malwa. This connection not only demonstrates their origins in Rajasthan and Malwa but also shows how well they have preserved their language throughout the years despite living among people of a different culture and language.\nReferences\nFurther reading\n*\nExternal links\n*"
    }
  ]
}