{
  "content": [
    {
      "type": "text",
      "text": "# Peace and Democracy Party\n\n| leader = Selahattin DemirtaşGültan Kışanak\n| predecessor = Democratic Society Party\n| successor = Peoples' Democratic PartyDemocratic Regions Party\n| founded = 3 May 2008\n| dissolved = 11 July 2014\n| ideology = Emancipation of womenKurdish nationalism}}\n| position = Centre-left to left-wing\n| national = Labour, Democracy and Freedom Bloc\n| european = Party of European Socialists (observer)\n| international = Socialist International (consultative)\n| headquarters = Ankara, Turkey\n| website =\n}}\nThe Peace and Democracy Party (, , BDP) was a Kurdish political party in Turkey existing from 2008 to 2014.\nDevelopment\nBDP succeeded the Democratic Society Party (DTP) in 2008, following the closure of the latter party for its alleged connections with the Kurdistan Workers' Party (PKK). The BDP was co-chaired by Selahattin Demirtaş and Gültan Kışanak. One-third of its representatives were Alevi.\nThe Deputy Chairs were Pervin Buldan and İdris Baluken. In the elections the BDP supported the Labour, Democracy and Freedom Bloc, which achieved the election of 35 Members of Parliament.\nAfter municipal elections on 30 March 2014, Berivan Elif Kilic became the co-mayor of Kocaköy, a farming town of 17,000 people in Turkey’s Kurdish region. Kilic shared the post of mayor with her male running mate, Affullah Kar, a former Imam. Under BDP party rules, all top positions are split between a man and a woman, in an effort to promote women’s participation in politics.\nIdeology\nThe party chairman has called for the PKK to disarm. The BDP had observer status in the Socialist International. BDP supported Turkey's membership in the European Union, same-sex marriages in Turkey, an anti-discrimination law to protect LGBT people and also wants the Government of Turkey to recognize the Armenian genocide.\nPeoples' Democratic Party\nPro-minority rights and feminist Peoples' Democratic Party (HDP) acted as the fraternal party to BDP. At the 2014 municipal elections, HDP ran parallel to BDP, with the BDP running in Turkey's Kurdish-dominated southeast while the HDP competed in the rest of the country except Mersin Province and Konya Province where BDP launched its own candidates.\nAfter the local elections, the two parties were re-organised in a joint structure. On 28 April 2014, the entire parliamentary caucus of BDP joined HDP, whereas BDP was assigned exclusively to representatives on the local administration level.\nLegal prosecution\nThe BDP has reported that between April 2009 and October 2011 more than 7500 BDP members were detained and over 3000 were arrested.\nReorganisation\nAt the 3rd Congress of the party on 11 July 2014, the name was changed to the Democratic Regions Party and a new structure restricting activities on the local/regional government level was adopted.\nReferences\nExternal links\n*[https://web.archive.org/web/20140924121413/http://www.bdp.org.tr/ Official website]"
    }
  ]
}