{
  "content": [
    {
      "type": "text",
      "text": "# Peacock revolution__disambig_1\n\n1968\n| branch       = Fashion\n| yearsactive  = late 1950s and mid–1970s\n| location     = United Kingdom\n| majorfigures =\n| influences   = }}\n| influenced   =\n}}\nThe peacock revolution was a fashion movement which took place between the late 1950s and mid–1970s, mostly in the United Kingdom. Mostly based around men incorporating feminine fashion elements such as floral prints, bright colours and complex patterns, the movement also saw the embracing of elements of fashions from Africa, Asia, the late 18th century and the queer community. The movement began around the late 1950s when John Stephen began opening boutiques on Carnaby Street, London, which advertised flamboyant and queer fashions to the mod subculture. Entering the mainstream by the mid-1960s through the designs of Michael Fish, it was embraced by popular rock acts including the Beatles, the Rolling Stones and Small Faces. By the beginning of the 1970s, it had begun to decline due to popular fashion returning to a more conservative style.\nFashion\nat Madame Tussauds, London]]\nThe fashion of the movement was mostly based around the embrace of feminine fashion elements by men, including tight silhouettes, bright patterns, long hair and makeup. It also embraced a variety of other influences, ranging from the Romantic era to traditional African and Asian elements. Suits were commonly worn, particularly in Edwardian or continental Europe's style of tailoring, and in unconventional textiles including corduroy, paisley and brocade. Suits also often incorporated bright colours, vivid patterns, embroidery, slim fits, large lapels, cravats, Nehru jackets, frilly shirts and kipper ties. Boots, generally winklepickers, were favoured over shoes. A 1973 article by the New York Times divided the period's suits into three different periods: the original style typified by the Nehru jacket and sport coat; the middle period which was influenced by Edwardian dress; and the later period which saw the rise of wide lapels and bell-bottoms.\nTerminology\nThe name \"peacock revolution\" was coined by consumer psychologist Ernest Dichter in 1965, eventually being popularised by journalist George Frazier during his 1968 columns for Esquire.\nThose who took part in the movement were known by various names, notably dandies, as well as variations like urban dandies and dandy mods. In the 1960s, terms such as \"soft mod\" or \"peacock mod\" were commonplace, to contrast from the more aggressive and rude boy influenced \"hard mods\" who would morph into the skinhead subculture.\nHistory\nOrigins (1950s and early 1960s)\nsubculture was influential upon the peacock revolution|150px]]\nIn the 1950s and early 1960s, the dominant style of menswear was business suits in dark and neutral colours, polo shirts and jumpers, with bright colours only been present occasionally, with patterned shirts like Hawaiian, plaid or striped. The earliest signs of rebellion against this hegemony in England was through the emergence of the Teddy Boy subculture, who wore suits in the style of the Edwardian era, while also embracing elements of fashions in the United States and continental Europe. Under the influence of the Teddy Boys, other subcultures began to emerge in Britain, including the rockers, and most relevantly, the mods.\nThe peacock revolution began from an intersection of 1950s queer fashion, the sexual revolution and the mod subculture. The popularity of the mod subculture had allowed for straight men to show an interest in fashion, and the sexual revolution allowed for men to present themselves in an overtly sexual manner. As early as Brioni's 1952 fashion show at Pitti Palace, the style of the Peacock Revolution were being anticipated. The first menswear show in modern history, the collection made use of bright colours, ornamentation, piping and elaborate waistcoats. By 1957, Scottish entrepreneur John Stephen began opening shops on Carnaby Street in London and using these developments to advertise gay styles of fashion to straight men. Works published by the BBC, Victoria and Albert Museum and the Week all credit Stephen as the pioneer of the peacock revolution. The designs of Michael Fish were also an important part of the growing movement. Fish began designing for Turnbull & Asser in 1962, where he began to experiment with more androgynous elements, such as floral designs, which he further after founding his own boutique Mr Fish in 1964. One running theme in Fisher's designs was the embrace of aspects of late 17th century fashion such as cravats, bizarre silks, military braids, brocade and high collared shirts. Christopher Gibbs too was an influential designer, introducing double breasted waistcoats, Turkish shirts and cloth covered buttons into the movement. In a 1968 article by Newsweek, the publication credited Oleg Cassini with helping to lead the movement.\nPeak popularity (mid–1960s)\n, Brian Jones and Michael Cooper (L–R) in 1967, wearing peacock revolution clothing |left]]\nMods quickly adopted these styles and soon London's Soho area became renowned for its androgynous fashions. As the style became increasingly popular, many prominent womenswear designers, including Pierre Cardin and Bill Blass began also producing menswear in the style. Cardin in particular would become an influential designer during the era, popularising the Nehru jacket which allowed for wearers to experiment with neck accessories like necklaces and medallions instead of ties.\nBy the mid-1960s, Stephen owned fifteen shops on Carnaby Street and clothes from these stores were being worn publicly by the Rolling Stones, the Beatles, Cliff Richard, Sean Connery and Antony Armstrong-Jones, 1st Earl of Snowdon. In 1964, Stephen claimed he \"dressed about 90 percent of England's popstars\". Soon, King's Road too began to develop similar boutiques. By 1966, Carnaby Street King's Road had become two of the most influential locations for fashion of the entire decade, largely popularised by the Rolling Stones and the Beatles, as well as the Who and Small Faces. Mary Quant later stated of Stephen, \"He made Carnaby Street. He was Carnaby Street. He invented a look for young men which was wildly exuberant, dashing and fun.\"\nPeacock revolution fashion reached the United States around 1964 with the beginning of the British Invasion, entering major fashion publications including GQ by 1966. Clothes were often sold in boutiques marked \"John Stephen of Carnaby Street\" and in department stores including Abraham & Straus, Dayton's, Carson Pirie Scott and Stern's. Furthermore, Lord John clothing began to be sold at Macy's, as Sears too began producing clothing in the style. By the mid–to late 1960s, the more radical end of the peacock revolution in the United States developed the hippie subculture.\nDuring the Rolling Stones' July 5, 1969 performance in Hyde Park, London, Jagger wore a white dress featuring bishop's sleeves and a bow-laced front which was designed by Fish. In a 2013 article, The Daily Telegraph writer Mick Brown stated that is moment \"epitomised the swinging Sixties\" and going on to call Jagger \"King of the Peacocks\".\nLater years and decline (late 1960s to mid–1970s)\nA decline in popularity of the peacock revolution's more extreme fashion styles was beginning as early as the 1967 release of Bonnie and Clyde. The film's costuming began a revived interest the fashions of the 1930s, and a rise in popularity of the designs Ralph Lauren and Bill Blass who began embracing such influence. A 1970 article by Life magazine cited a recent revived interest in peacock revolution fashion, citing women's greater attraction to the style and the hippie subculture's fashion \"proving that a fellow can wear any outlandish costume in public\" as the reasoning. Between 1972 and 1974, a second wave of popular musicians, including David Bowie, Elton John and Gary Glitter, portraying the movement emerged as a part of the glam rock genre, that trickled down to the general public.\nNostalgia for the fashions of the 1920s to the 1940s was eventually exacerbated by The Godfather (1972), The Sting (1973) and The Great Gatsby (1974) and the 1972 death of Edward VIII. By 1975, the release of John T Molloy's bestselling book Dress for Success, marked a general return to conservative men's fashion by popularising power dressing.\nLegacy\nIn the wake of the peacock revolution, menswear became more diverse in many western countries. The movement was one of the main factors in allowing men to wear clothes other than suits in both business and casual contexts. Furthermore, it allowed for a greater variation of both head and facial hair lengths and style in the workplace and increased the demand for men's grooming and cosmetic products. Many influential fashion designers also began their careers during the period, including Hardy Amies, Geoffrey Beene, Bill Blass, Cerruti 1881, Hubert de Givenchy and Yves Saint Laurent.\nThe movement was one of the main factors in popularising androgyny in fashion, especially in rock music.\nIn a July 2014 article by the New York Times, fashion photographer Bill Cunningham cited \"Signs of a new peacock revolution\", including the resurgence of designs by Domenico Spano.\nSee also\n* Swinging Sixties\n* British Invasion\n* 1960s in fashion\n* Great Male Renunciation\n* Men's Dress Reform Party\nReferences"
    }
  ]
}