{
  "content": [
    {
      "type": "text",
      "text": "# Peaking power plant\n\n, a former coal-fired base load power plant, now a gas-fired peaker, on the Hackensack River in New Jersey]]\nPeaking power plants, also known as peaker plants, and occasionally just \"peakers\", are power plants that generally run only when there is a high demand, known as peak demand, for electricity. Because they supply power only occasionally, the power supplied commands a much higher price per kilowatt hour than base load power. Peak load power plants are dispatched in combination with base load power plants, which supply a dependable and consistent amount of electricity, to meet the minimum demand.\nAlthough historically peaking power plants were frequently used in conjunction with coal baseload plants, peaking plants are now used less commonly. Combined cycle gas turbine plants have two or more cycles, the first of which is very similar to a peaking plant, with the second running on the waste heat of the first. That type of plant is often capable of rapidly starting up, albeit at reduced efficiency, and then over some hours transitioning to a more efficient baseload generation mode. Combined cycle plants have similar capital cost per watt to peaking plants, but run for much longer periods, and use less fuel overall, and hence give cheaper electricity.\nAs of 2020, open cycle gas turbines give an electricity cost of around $151–198/MWh.\nPeaker plants have been replaced with battery storage in some places. The New York Power Authority (NYPA) is seeking to replace gas peaker plants with battery storage, 142 Tesla Megapacks (providing 100 MW) replaced a gas peaker plant in Ventura County, California and in Lessines, Belgium 40 Tesla Megapacks (50 MW) replaced a turbojet generator. Australia's Clean Energy Council found in April 2021 that battery storage can be 30% cheaper than gas peaker plants.\nPeak hours\nPeak hours usually occur in the morning or late afternoon/evening depending on location. In temperate climates, peak hours often occur when household appliances are heavily used in the evening after work hours. In hot climates, the peak is usually late afternoon when air conditioning load is high, during this time many workplaces are still open and consuming power. In cold climates, the peak is in the morning when space heating and industry are both starting up.\nA peaker plant may operate many hours a day, or it may operate only a few hours per year, depending on the condition of the region's electrical grid. Because of the cost of building an efficient power plant, if a peaker plant is only going to be run for a short or highly variable time, it does not make economic sense to make it as efficient as a base load power plant. In addition, the equipment and fuels used in base load plants are often unsuitable for use in peaker plants because the fluctuating conditions would severely strain the equipment. For these reasons, nuclear, waste-to-energy, coal and biomass are rarely, if ever, operated as peaker plants.\nPower production in Germany during a day in 2005, without any solar and wind power\nRenewable energy\nAs countries trend away from fossil fuel-fired base load plants and towards renewable but intermittent energy sources such as wind and solar, there is a corresponding increase in the need for grid energy storage systems, as renewable alternatives to building more peaking or load following power plants. Another option is broader distribution of generating capacity, through the use of grid interties, such as the WECC Intertie Paths.\nTypes\nPeaker plants are generally gas turbines or gas engines that burn natural gas. A few burn biogas or petroleum-derived liquids, such as diesel oil and jet fuel, but those are generally more expensive than natural gas, so their use is limited to areas not supplied with natural gas. In addition to natural gas, many peaker plants are able to use petroleum as a backup fuel, storing oil in tanks on site. The thermodynamic efficiency of simple-cycle gas turbine power plants ranges from 20 to 42%, with between 30 and 42% being average for a new plant.\nFor greater efficiency, a heat recovery steam generator (HRSG) is added at the exhaust. This is known as a combined cycle plant. Cogeneration uses waste exhaust heat for process, district heating or other heating uses. Both of these options are used only in plants that are intended to be operated for longer periods than usual. Natural gas and diesel generators with reciprocating engines are sometimes used for grid support using smaller plants.\nAnother option for increased efficiency and power output in gas turbines is installing a turbine inlet air cooling system, that cools down the inlet air temperature increasing mass flow ratio. This option, in combination with a thermal energy storage tank, can increase the turbine power output in on-peak periods up to 30%.\nDaily peak load with large hydro/base load thermal generation and intermittent wind power. Hydro is managing the peaks, with some response from thermal.]]\nHydroelectric dams are intentionally variable. They can generate less during off-peak and quickly respond to peak demands, consequently hydroelectricity may function as load following or a peaking plant and with sufficient water, a base-load plant. Natural gas turbines or pumped storage are often used where there is not enough hydroelectricity to respond to daily and weekly variations in generation and consumption.\nIt is not unusual for a dam to be built with more capacity than can be sustained by the water supply, allowing for a higher peak output. Upgrading equipment at existing dams can be one of the least expensive ways of increasing peak generation. The ability to vary the amount of electricity generated is often limited by the requirement that minimum or maximum flows downstream are satisfied.\nPumped-storage hydroelectricity is the largest-capacity form of grid energy storage available, used for averaging off-peak and peak electrical demands. The site stores energy using the gravitational potential of water stored in a reservoir. Low-cost off-peak electric power from base load or intermittent sources is used to pump water at a low elevation to storage in a high elevation reservoir. During periods of high electrical demand, the stored water is released through turbines to produce electric power. Start up times are only a few minutes, and some can start in a few tens of seconds.\nBatteries are used in some cases where conditions favor it to smooth flow, avoiding a costly power line upgrade, as well as supplying peak power and other grid services such as operating reserve, sometimes in hybrid configuration with turbines or diesel engines. Battery power is by far the fastest responding of all powerplants, and can respond to grid conditions at millisecond timescales, giving slower responding equipment a chance to react to outages.\nPumped-storage and batteries are net consumers, as they have no inherent energy source, and the conversion between electricity and storage and back incurs some losses.\nSolar thermal peaker plants were proposed in 2017, under a US Department of Energy Technology 2 Market award to Hank Price of SolarDynamics, whose paper \"Dispatchable Solar Power Plant\"  proposed utilizing the thermal energy storage inherent in a solar thermal energy power plant, that enables this heat-based form of solar to generate like a gas peaker, to supply power on demand day or night, and in return be controlled by the utility and paid in capacity payments to be available when needed, like a traditional peaker plant. A solar thermal power plant makes electricity in a steam cycle power plant like a traditional power plant but the heat for steam is supplied by solar energy heating a material such as molten salts and storing the heat until needed to make steam for power generation.\nBase load power plants\nAn economical electrical supply system will also include base load power plants. These generating units will emphasize low incremental fuel cost, but may use a higher capital investment to improve efficiency. For example, a peaking plant might use only a gas turbine, while a base load plant might also add a steam \"bottom cycle\" to improve the overall plant fuel consumption per unit of electricity produced. Nuclear and coal burning plants generally operate continuously, stopping only for maintenance or unexpected outages.\nThe low incremental fuel cost of nuclear power plants compared with high capital cost, makes it most economic for them to be used for base load supply. Hydroelectric plants with few restrictions on water supply may be used for base load as their incremental fuel cost is zero. Since a steam cycle power plant may take hours to go from cold standby to full rating, they are not usually used to provide peak load service.\nIntermediate load following power plants such as hydroelectric operate between these extremes, curtailing their output on nights and weekends when demand is low. Base load and intermediate plants are used preferentially to meet electrical demand because the lower efficiencies of peaker plants make them more expensive to operate.\nSee also\n* Geothermal power\n* List of energy storage projects\n* Smart grid\n* Vehicle-to-grid\n* Turbine inlet air cooling\n* Load following power plant\nReferences"
    }
  ]
}