{
  "content": [
    {
      "type": "text",
      "text": "# Pecos War\n\nThe Pecos War, also known as the War of the Pecos and the Chisum War, was a range war fought by cattle baron John Chisum against neighboring small ranchers, farmers, and Native Americans from 1876-1877 along the Pecos River in New Mexico. The conflict was caused primarily by competition: Chisum believed that his livestock and other resources were being depleted upon by people he alleged to be rustlers. At the same time, Chisum was also fighting Mescalero Apaches from the nearby reservations who were said to prey on his herds.\nBackground\nIn 1876, John Chisum left Roswell to stake a claim over the wide grasslands along the Pecos River for his cattle business. His claim, however, placed him in odds with several smaller ranching families who had settled from Texas at the same year as him, as well as the Apache at the nearby Mescalero Indian Reservation. During that time, much of the frontier was in public domain, and the land was free to whoever staked a claim first. Herds of cattle were allowed to roam and graze around the frontier. And these cattle were identified through the use of special brands that belonged to different ranches. Much of the better lands for grazing was overtaken by Chisum and his Jinglebob Ranch.\nChisum would nickname these people as “little fellows”, and he believed many of them were rustlers who were stealing from his herd of cattle to sell as their own. This resulted in him recruiting and arming cowboys and ranch hands to protect his property, led by James M. Highsaw, who was described by a contemporary as “quick as lightning on the draw [and] cool under any circumstances.” Many of these men, including Tabb and Charles Rankin, were fired upon by Chisum’s enemies.\nMany of the smaller ranch communities, especially those with alleged criminal history, formed the Seven Rivers Warriors gang to defend against Chisum’s aggression. These included Buck Powell, Dick Smith, Andy Boyle, the Beckwith clan, W. H. Johnson, Jake Owen, Lewis Paxton, Nathan Underwood, Milo Pierce, Charlie Woltz, Charlie Perry, and Robert and Wallace Olinger. Both the Seven Rivers Warriors and the Mescalero Indian Reservation, specifically Indian agent Frederick C. Godfrey, were allied to Chisum’s rivals, the House and the Santa Fe Ring.\nWar\nThe first clash happened in October 1876 at the Wiley Cow Camp, about 80 miles from Chisum’s ranch, when a man named Yopp came into an argument with two cowboys. Yopp grabbed his rifle and fired at them, but cowboy Buck Powell shot back and killed him.\nOn March 10, 1877, James Highsaw confronted alleged rustler Dick Smith at a cow camp on Loving’s Bend after obtaining evidence on Smith’s rustling activities. Smith went for his gun but Highsaw drew faster and killed him. Highsaw was cleared of charges after his act was deemed self-defense.\nA month later, Chisum finally rode out with thirty armed men to the home of the Beckwith clan. They surrounded the house from a distance of 500 yards, cut off the water supply, and ordered their surrender. The Beckwiths, meanwhile, opened fire, while two men inside the house, Charles Woltz and Buck Powell, sneaked out to call for help. After a night of continued stand-off, Chisum’s cowboys recommended him to fall back, further stating that they were hired to drive cattle, not to get shot at.\nFight with Indians\nDuring the same time, Chisum was also in conflict with Apaches who were said to have stolen from his herd and attacked his men as well. Previously, in 1873, Chisum lost thousands of dollars' worth of horses, mules, and livestock because of alleged Apache raids. Continued predation forced Chisum and his allies to attack the Apache reservation in early 1875, resulting in several dead and many horses stolen. The Apache attempted retaliation but ended up fleeing.\nBy 1876, many Apache returned, some finding refuge as workers in nearby ranches. In the fall of 1877, Chisum’s men went to the reservation again to recover alleged stolen horses. This time, however, instead of having a gunfight, Chisum's men offered the Indians alcohol. Upon getting drunk, many of them were killed and an untold number of horses were stolen. The depredation by Chisum was investigated and confirmed upon by Indian Inspector Erwin C. Watkins.\nAftermath\nOn June, Chisum was put on trial for unlawful assembly, riot and larceny, as well as additional charges from the smaller ranchers. None successfully indicted him and the charges were dropped. Nonetheless, the war ended in a stalemate, and the conflict between Chisum and the smaller ranchers would continue during the Lincoln County War.\nReferences"
    }
  ]
}