{
  "content": [
    {
      "type": "text",
      "text": "# Peking gecko\n\n| genus = Gekko\n| species = swinhonis\n| authority = Günther, 1864\n| range_map = Gekko swinhonis distribution.png\n| synonyms = *Gecko swinhonis  (nomen nudum)\n*Gecko swinhonis\n*Gekko swinhonis\n*Gekko (Japonigekko) swinhonis\n| synonyms_ref =\n}}\nThe Peking gecko (Gekko swinhonis) is a species of lizard in the family Gekkonidae. The species is endemic to China.\nEtymology\nThe specific name, swinhonis, is in honor of English naturalist Robert Swinhoe.\nGeographic range\nG. swinhonis occurs in northern China, north of the Yangtze River.\nBut they had also been introduced to Incheon, South Korea via ships.\nHabitat\nThe preferred natural habitats of G. swinhonis are arid and moist grasslands and plains.\nReproduction\nG. swinhonis is oviparous.\nTaxonomy\nThe species G. swinhonis was first described by British herpetologist Albert Günther in 1864.\nConservation status\nG. swinhonis has been assessed as \"Vulnerable\" due to an inferred 30% population decline over the last three generations due to harvest levels. This species has a relatively wide distribution but it is exploited for traditional medicine and is impacted by habitat loss and degradation.\nReferences\nFurther reading\n*Boulenger GA (1885). Catalogue of the Lizards in the British Museum (Natural History). Second Edition. Volume I. Geckonidæ ... London: Trustees of the British Museum (Natural History). (Taylor and Francis, printers). xii + 436 pp. + Plates I-XXXII. (Gecko swinhonis, p.&nbsp;189).\n*Günther ACLG (1864). The Reptiles of British India. London: The Ray Society. (Taylor and Francis, printers). xxvii + 452 pp. + Plates I-XXVI. (Gecko swinhonis, new species, p.&nbsp;104 + PlateXII, figure A).\n*Li H-M, Zeng D-L, Guan Q-X, Qin P-S, Qin X-M (2013). \"Complete mitochondrial genome of Gekko swinhonis (Squamata, Gekkonidae)\". Mitochondrial DNA 24 (2): 86–88.\n*Rösler H (2000). \"Kommentierte Liste der rezent, subrezent und fossil bekannten Geckotaxa (Reptilia: Gekkonomorpha)\". Gekkota 2: 28–153. (Gekko swinhonis, p.&nbsp;82). (in German)."
    }
  ]
}