{
  "content": [
    {
      "type": "text",
      "text": "# Peking University HSBC Business School\n\n| type                   = Public University\n| city                   = Shenzhen, Guangdong\n| country                = China\n| dean                   = Hai Wen (海闻)\n| academic_staff         = 44\n| website                =\n| logo                   =\n| footnotes              =\n}}\nPeking University HSBC Business School (PHBS; ) is a graduate-level business school, under the auspices of Peking University, located in Shenzhen, Guangdong, China, at the university's only satellite campus. PHBS was founded in 2004 and, following HSBC's direct and indirect charity donation to the school in 2008, became the first Chinese institution of higher education to offer English-only business programs at a Master's level (EMBA program remains in Mandarin).\nIn February 2017, PHBS announced the establishment of a campus in the town of Oxford, United Kingdom (UK), which is believed to position the school as the first Chinese university and business school to maintain an independent international campus beyond the Mainland China border.\nLocation\nThe school is located near the Xili town of Shenzhen in University Town of Shenzhen which holds the campuses of Peking University Shenzhen Graduate School, Harbin Institute of Technology (Shenzhen), and Tsinghua University Shenzhen International Graduate School. Within the Peking University Shenzhen Graduate School campus are nine schools, including the School of Transnational Law, HSBC Business School, and other research institutes.\nThe university town is located just outside the city center, in a suburban community to the northwest of the city itself. The university area is separated from the urban sprawl by Tanglang mountain. The university town is connected to the rest of Shenzhen by multiple [https://web.archive.org/web/20120202163956/http://www.szmc.net/cms/page?arg=en%2Findex metro]  stations and public bus.\nOverview\nHSBC Business School (PHBS) was founded in 2004. The school aims to provide master's degree programs to domestic and international students, as well as a range of Executive Education programs to mid-career Chinese professionals.\nCurrently, PHBS offers two-year Master's programs in Management, Economics, Finance and MBA. The programs are math-intensive and based upon an international standard of methodology and research application. Each program culminates in a thesis defense process in which students must successfully orally defend a graduate-level research project in front of faculty.\nThe name \"HSBC\" was added to the school's name when HSBC made a charity donation to the school. This school uniquely teaches its full-time graduate classes solely in English and has approximately 35 English-speaking international faculty with advanced doctoral degrees from top institutions from outside Mainland China to bring an internationally focused education to the school. Students are both Chinese and international.  All classes are graduate level and include management, economics, and finance based subjects. The HSBC Business School also offers dual master's degree programs collaboratively with The University of Hong Kong and Chinese University of Hong Kong. Beginning in the year 2013/2014, HSBC School of Business will also be offering a dual degree program in collaboration with the Risk Management Institute at the National University of Singapore. Students of PHBS's Masters of Economics and Masters of Management program can also earn RMI's coveted Master of Science in Financial Engineering with three years of full-time study with most of the classes held at Shenzhen based PHBS.\nInternationalization\nAs an English-language program based in one of China's largest cities, Peking University HSBC Business School has sought to drastically increase the amount of international influence on campus in recent years. Currently, about 40% of PHBS faculty are non-Chinese, and the majority of PHBS faculty obtained their Ph.D. from American institutions. This included universities such as Columbia University, University of Pennsylvania, and Oxford University.\nIn addition, the school actively recruits international students who are interested in taking advantage of the Chinese financial and business markets. The school appeals to international applicants interested in the Chinese market.  The upcoming 2016-2017 international student class is expected to be the largest in the school's history with over 91 international students coming from 41 different countries.\nPHBS building\nIn fall 2013 classes started being taught in Peking University HSBC Business School’s new building. Located only a few minutes walking distance from the Shenzhen Graduate School's main area, the new building spans over 60,000 square meters.  The building’s construction was funded through the support of donations from HSBC and is the largest single business school building in the world.\nDesign features\nThe structure sits on a plot of land totaling 10,392 square meters. The building itself offers more than 60,000 square meters of space for student and faculty use. The building’s structure includes modern teaching and research space, study centers, a concert auditorium, exhibition rooms, archives, a staff center, a café, relaxation center, restaurant, art gallery and other facilities for the PHBS staff and students. The building also includes a lecture hall which can host up to 1000 participants.\nPHBS’ innovative and “green-conscious” design was constructed using XR-2 energy-efficient glass. The structure’s stone paneling helps insulate the building for further energy efficiency and its roof siphoning drainage system reduces the number of pipelines used. The surrounding area relies on a rainwater recovery system in order to keep the grounds green.\nGeneral information\nTuition\n*RMB 138,000 for Peking University programs\n*SGD 33,600 for the National University of Singapore program\nDegrees offered\n*Master of Economics\n*Master of Finance (Professional degree)\n*Master of Management\n*Master of Financial Media\n*Full-time MBA (*Chinese and English programs)\n*Executive MBA (*conducted only in Chinese)\n*Master or Certificate in China Studies for Economics & Management (MCS/CCS)\n*Finance-Economics Dual-Master Program with Chinese University of Hong Kong (*only available to domestic students)\n*Doctorate of Economics (*must have a masters in Economics or Finance and have written a master thesis in Chinese)\n*Executive MBA Program (*conducted only in Chinese)\n*Executive Development Program (conducted only in Chinese)\nDuration of programs\n*Domestic Master's Programs (academic and professional degrees both): 3 years, with internship forbidden in the first year\n*International Master’s Programs: 2 years\n*PhD Program: 3 years\nFaculty\n*Full-time Faculty: 52\n*Part-time and Visiting Faculty: 3\nAverage class size\n*Mandatory: 60\n*Elective: 15\nSee also\n* China Center for Economic Research\nReferences\nExternal links\n* [http://english.phbs.pku.edu.cn/ Peking University HSBC Business School]\n* [https://web.archive.org/web/20100621212816/http://www.phsb.pku.edu.cn/ PKU HSBC ]"
    }
  ]
}