{
  "content": [
    {
      "type": "text",
      "text": "# Peking duck__disambig_1\n\n| bpmf = ㄅㄟˇ ㄐㄧㄥ ㄎㄠˇ ㄧㄚ\n| poj = Pak-kian kho ah\n| j = bak1 ging1 haau1 aap3\n| c =\n| mi =\n| ci =\n| altname =\n}}\nPeking duck is a dish from Beijing that has been prepared since the Imperial era. The meat is characterized by its thin, crispy skin, with authentic versions of the dish serving mostly the skin and little meat, sliced in front of the diners by the cook. Ducks bred especially for the dish are slaughtered after 65 days and seasoned before being roasted in a closed or hung oven. The meat is often eaten with spring onion, cucumber, and sweet bean sauce, with pancakes rolled around the fillings. Aromatic duck is a similar dish to Peking duck and is popular in the United Kingdom and Ireland.\nHistory\nDucks have been roasted in China since the Southern and Northern dynasties. A variation of roast duck was prepared by the emperor in the Mongol-led Yuan dynasty. The dish, originally named \"shāo yāzi\" (燒鴨子), was mentioned in the Complete Recipes for Dishes and Beverages (飲膳正要) manual in 1330 by Hu Sihui (忽思慧), an inspector of the imperial kitchen. The Peking roast duck that came to be associated with the term was fully developed during the later Ming dynasty, and by then, Peking duck was one of the main dishes on imperial court menus. The first restaurant specialising in Peking duck, Bianyifang, was established in the Xianyukou, close to Qianmen of Beijing in 1416.\nBy the Qianlong period (1736–1796) of the Qing dynasty, the popularity of Peking duck spread to the upper classes, inspiring some poets and scholars who enjoyed the dish. For instance, one verse of \"Dūmén zhúzhīcí\", a local Beijing poem, was \"Fill your plates with roast duck and suckling pig\".\nIn 1864, the Quanjude (全聚德) restaurant was established in Beijing. Yang Quanren (楊全仁), the founder of Quanjude, developed the hung oven to roast ducks.\nBy the mid-20th century, Peking duck had become a national symbol of China, favored by tourists and diplomats alike. For example, Henry Kissinger, the secretary of state of the United States, met Premier Zhou Enlai in the Great Hall of the People on 10 July 1971, during his first (secret) visit to China. After a round of inconclusive talks in the morning, the delegation was served Peking duck for lunch, which became Kissinger's favourite. The Americans and Chinese issued a joint statement the following day, inviting President Richard Nixon to visit China in 1972. Following Zhou's death in 1976, Kissinger paid another visit to Beijing to savor Peking duck. Peking duck, at the Quanjude in particular, has also been a favorite dish for various political leaders ranging from Cuban Fidel Castro to former German chancellor Helmut Kohl.\nTwo notable restaurants in Beijing which serve this dish are Quanjude and Bianyifang, both centuries-old establishments which have become household names, each with their own style: Quanjude is known for using the hung oven roasting method, while Bianyifang uses the oldest technique of closed oven roasting.\nPeking duck is one of the representatives of gourmet Chinese food and has become one of the essential experiences for many foreign politicians and tourists.\nPreparation\nRaising the duck\nThe ducks used to prepare Peking duck originated in Nanjing. They were large, had black feathers, and lived in the canals that linked the city to major waterways.\nWith the relocation of the Chinese capital to Beijing, supply barge traffic increased in that area. Often these barges spilled water into side-canals, providing a habitat for the ducks. By the time of adoption of five-spice powder, a new breed of duck had been domesticated by Chinese farmers.\nNewly hatched ducks are raised in a free-range environment for the first 45&nbsp;days of their lives, and force-fed 4&nbsp;times a day for the next 15–20&nbsp;days, resulting in ducks that weigh 5–7&nbsp;kg (11–15&nbsp;lbs). The force-feeding of the ducks led to an alternate name for the animal, \"Peking stuffed duck\" ().\nCooking the duck\nFattened ducks are killed, plucked, eviscerated and rinsed thoroughly with water. Air is pumped under the skin through the neck cavity to separate the skin from the fat. The duck is then blanched in boiling hot water for two to three minutes before it is hung up to dry. This tightens the skin. While it is hung, the duck is glazed with a layer of syrup with honey, and the duck's inside is rinsed once more with water. A second layer of glaze/marinade of soy sauce, five-spice powder, and more maltose is then applied inside and out, and the duck is left to stand for 24&nbsp;hours in a cool, dry place (or a refrigerator). It is then roasted in an oven until the skin turns shiny brown.\nBesides two traditional methods to prepare Peking duck, recipes have been compiled by chefs all around the world to produce the dish at home.\nClosed-oven style\nPeking duck is traditionally roasted in a closed oven ( mènlú). Bianyifang, a restaurant in Beijing, China, is famous for keeping this tradition. The closed oven is built of brick and fitted with metal griddles (). The oven is preheated by burning Gaoliang sorghum straw () at the base. The duck is placed in the oven immediately after the fire burns out, allowing the meat to be slowly cooked through the convection of heat within the oven. Controlling the fuel and the temperature is the main skill. In closed-oven style, duck meat is combined well with the fat under the skin, and therefore is juicy and tender.\nOpen-oven style\nThe open oven () was developed in the imperial kitchens during the Qing dynasty and adopted by the Quanjude restaurant chain. It is designed to roast up to 20&nbsp;ducks at the same time with an open fire fueled by hardwood from peach or pear trees. The ducks are hung on hooks above the fire and roasted at a temperature of  for 30–40&nbsp;minutes. While the ducks are roasting, the chef may use a pole to dangle each duck closer to the fire for 30-second intervals. In open-oven style, the fat is usually melted during the cooking process, so the skin is crispy.\nServing\nchef slicing roasted Peking duck]]\ns, spring onions and sweet bean sauce]]\nPeking duck is traditionally carved in front of the guests and served in three stages. First, slices of duck skin are served with sugar and sweet bean sauce as a dip. Duck skin is best enjoyed hot and crisp to the bite. The meat is then served with steamed pancakes () and an assortment of vegetable dishes, typically julienned cucumber and spring onion. Traditionally, diners dip slices of duck into the condiments and wrap into the pancake with cucumber and any other ingredients. The wrap is then eaten by hand or with chopsticks. The carved duck (鸭架) – the remainder of the roast duck, with choice cuts removed – can be cooked in three ways. The traditional way is in a broth with ingredients such as Chinese cabbage and soft tofu. The carved duck can also be chopped and stir-fried in sweet bean sauce, or rapidly sautéed and served with salt and pepper (椒鹽). Otherwise, the carved duck is packed to be taken home by the customers.\nReheating\nWhole Peking ducks can be ordered as takeaway. The ducks can be reheated at home with an oven or stovetop. When an oven is used, the duck is heated at a temperature of  for 20 minutes, and then at  for another 10 minutes. The stove method involves submerging the duck in boiling water before placing it on a griddle  above the cooking fire. The water is replaced every 3–4 minutes until the duck is piping hot. To reheat the Peking duck with oil, the duck is sliced into thin pieces and placed in a strainer held over a wok of hot oil. The duck is then rinsed several times with the oil.\nNotable restaurants\nA number of restaurants in Beijing specialise in Peking duck. Examples include Quanjude, Bianyifang, Changan Yihao (長安一號), Dayali, Siji Minfu（四季民福）, Beijing Xiaowangfu (北京小王府) and Dadong Kaoyadian (大董烤鴨店). Some restaurants, in particular Quanjude and Bianyifang, have long histories of serving high quality duck that they are now household names, or Lao zihao'' (老字号), literally \"old brand name\". In addition, Quanjude has received worldwide recognition, having been named a China Renowned Trademark in 1999.\nDuck Chang's Restaurant, established in 1975 in Virginia, United States, was the first Chinese restaurant to prepare and serve Peking duck without a 24-hour advanced notice. In 2018, the James Beard Foundation awarded Sun Wah BBQ in Chicago, Illinois, with their America's Classics award, specifically citing Sun Wah's three-course \"Beijing Duck Feast\" in their announcement of the award.\nCrispy aromatic duck\nCrispy aromatic duck (香酥鴨 xiāng sū yā) is a similar dish to Peking duck. It is popular in the United Kingdom, where it was created in the latter half of the twentieth century.\nThe duck is first marinated with spices, then steamed until tender, and finally deep fried until crispy. The meat has less fat and is drier and crispier compared to that of Peking duck.\nIn Germany, some Asian fusion restaurants also serve crispy aromatic duck (Knusprige Ente), sometimes also labeled as Peking duck (Peking-Ente, also Pekingente). The duck is marinated with spices and deep-fried, served together with stir-fried vegetables (Wokgemüse) over fried noodles or with rice.\nThe traditional way of eating is to have the roasted duck carved into slices by the waiter, separate the duck skin and duck meat, and dip a little duck skin into each slice. Diners often wrap slices of duck meat in pancakes, and add sweet bean sauce, green onions, cucumber strips and other ingredients to make it a unified meal.\nGallery\nFile:全聚德烤房.JPG|\nFile:Carving up our duck.jpg\nFile:Gastronomia china-Pato a la pekinesa5251.JPG\nFile:Peking Duck 4.jpg\nFile:Peking Duck.jpg\nFile:Accompagnement pour canard laqué.JPG\nFile:Canard laqué pret a etre mangé.JPG\nFile:Peking_Duck,_in_a_restaurant_in_Peking.jpg\nFile:Peking Duck 2.jpg\nFile:Canard laqué.JPG\nFile:Peking duck by Mr Wabu in Beijing.jpg\nFile:Peking duck wrap.jpg\nSee also\n* Chinese cuisine\n* Taiwanese cuisine\n* Tibetan cuisine\n* List of duck dishes\n* Mandarin cuisine\n* Roast goose\n* Zhangcha duck\nExplanatory notes\nReferences\nExternal links\n* [http://news.bbc.co.uk/2/shared/spl/hi/picture_gallery/08/asia_pac_making_peking_duck/html/1.stm In Pictures: Making Peking Duck]—BBC News"
    }
  ]
}