{
  "content": [
    {
      "type": "text",
      "text": "# PEN/E. O. Wilson Literary Science Writing Award\n\nThe PEN/E.O. Wilson Literary Science Writing Award is awarded by the PEN America (formerly PEN American Center) for writing that exemplifies literary excellence on the subject of physical and biological sciences. The award includes a cash prize of $10,000.\nThe award was founded by scientist and author Dr. Edward O. Wilson, activist and actor Harrison Ford, and the E. O. Wilson Biodiversity Foundation. The award was inaugurated in 2011.\nExamples of published works that exemplify the quality of writing the award is designed to acknowledge include Rachel Carson's Silent Spring (1962) and James Watson's The Double Helix  (1969), which contribute 'to the public’s understanding of scientific principles at work in the world today.'\nThe award is one of many PEN awards sponsored by International PEN affiliates in over 145 PEN centers around the world. The PEN American Center awards have been characterized as being among the \"major\" American literary prizes.\nAward winners\n{| class=\"wikitable sortable mw-collapsible\"\n|+PEN/E. O. Wilson Literary Science Writing Award winners and runners-up\n!Year\n!Author\n!Title\n!Result\n!Ref.\n|-style=background:#cddeff\n! rowspan=\"2\" |2011\n|\n|\n|Winner\n|\n|-\n|\n| Becoming Animal\n|Runner-up\n|\n|-style=background:#cddeff\n! rowspan=\"2\" |2012\n|\n|\n|Winner\n|\n|-\n|\n| Moby-Duck: The True Story of 28,800 Bath Toys Lost at Sea and of the Beachcombers, Oceanographers, Environmentalists, and Fools, Including the Author, Who Went in Search of Them\n|Runner-up\n|\n|-style=background:#cddeff\n! rowspan=\"2\" |2013\n|\n| Subliminal: How Your Unconscious Mind Rules Your Behavior\n|Winner\n|\n|-\n|\n|\n|Runner-up\n|\n|-style=background:#cddeff\n!2014\n|\n| High Price: A Neuroscientist’s Journey of Self-Discovery That Challenges Everything You Know About Drugs and Society\n|Winner\n|\n|-style=background:#cddeff\n!2015\n|\n| War of the Whales: A True Story\n|Winner\n|\n|-style=background:#cddeff\n! rowspan=\"5\" |2016\n|\n| Thunder & Lightning: Weather Past, Present, Future\n|Winner\n|\n|-\n|\n|Rain: A Natural and Cultural History\n|Shortlist\n|\n|-\n|\n|'\n|Shortlist\n|\n|-\n|\n|'\n|Shortlist\n|\n|-\n| and Jeff Kanipe\n|Island on Fire: The Extraordinary Story of a Forgotten Volcano That Changed the World\n|Shortlist\n|\n|- style=\"background:#cddeff\"\n! rowspan=\"5\" |2017\n|\n| Patient H.M.: A Story of Memory, Madness, and Family Secrets\n|Winner\n|\n|-\n|\n|Coyote America: A Natural and Supernatural History\n|Shortlist\n|\n|-\n|\n|How to Make a Spaceship: A Band of Renegades, an Epic Race, and the Birth of a Private Spaceflight\n|Shortlist\n|\n|-\n|\n|Lab Girl\n|Shortlist\n|\n|-\n|\n|\n|Shortlist\n|\n|- style=\"background:#cddeff\"\n! rowspan=\"5\" |2018\n|\n| ''The Butchering Art: Joseph Lister's Quest to Transform the Grisly World of Victorian Medicine\n|Winner\n|\n|-\n|\n|American Eclipse: A Nation’s Epic Race to Catch the Shadow of the Moon and Win the Glory of the World\n|Shortlist\n|\n|-\n|\n|Growing a Revolution: Bringing Our Soil Back to Life\n|Shortlist\n|\n|-\n|\n|No One Cares About Crazy People: The Chaos and Heartbreak of Mental Health in America\n|Shortlist\n|\n|-\n|\n|Behave: The Biology of Humans at Our Best and Worst\n|Shortlist\n|\n|- style=\"background:#cddeff\"\n! rowspan=\"5\" |2019\n|\n| Eager: The Surprising, Secret Life of Beavers and Why They Matter''\n|Winner\n|\n|-\n|\n|'\n|Shortlist\n|\n|-\n|\n|'\n|Shortlist\n|\n|-\n|\n|Blue Dreams: The Science and the Story of the Drugs that Changed Our Minds\n|Shortlist\n|\n|-\n|\n|She Has Her Mother’s Laugh\n|Shortlist\n|\n|- style=\"background:#cddeff\"\n! rowspan=\"5\" |2020\n|\n| ''Mama's Last Hug: Animal Emotions and What They Tell Us about Ourselves\n|Winner\n|\n|-\n|\n|Conscience: The Origins of Moral Intuition\n|Shortlist\n|\n|-\n|\n|On the Backs of Tortoises: Darwin, the Galapagos, and the Fate of an Evolutionary Eden\n|Shortlist\n|\n|-\n|\n|\n|Shortlist\n|\n|-\n|\n|Losing Earth: A Recent History\n|Shortlist\n|\n|- style=\"background:#cddeff\"\n! rowspan=\"5\" |2021\n|\n| Owls of the Eastern Ice: A Quest to Find and Save the World's Largest Owl\n|Winner\n|\n|-\n|\n|\n|Shortlist\n|\n|-\n|\n|Fathoms: The World in the Whale''\n|Shortlist\n|\n|-\n|\n|'\n|Shortlist\n|\n|-\n|\n|'\n|Shortlist\n|\n|- style=\"background:#cddeff\"\n! rowspan=\"5\" |2022\n|\n| Fox & I: An Uncommon Friendship\n|Winner\n|\n|-\n|\n|'\n|Shortlist\n|\n|-\n|\n|'\n|Shortlist\n|\n|-\n|\n|Believers: Making a Life at the End of the World\n|Shortlist\n|\n|-\n|\n|Life’s Edge: The Search for What It Means to Be Alive\n|Shortlist\n|\n|-style=background:#cddeff\n! rowspan=\"4\" |2023\n|\n|Heartbreak: A Personal and Scientific Journey\n|Winner\n|\n|-\n|\n|Vagina Obscura: An Anatomical Voyage\n|Shortlist\n|\n|-\n|\n|''Sounds Wild and Broken: Sonic Marvels, Evolution's Creativity, and the Crisis of Sensory Extinction\n|Shortlist\n|\n|-\n|\n|\n|Shortlist\n|\n|-style=background:#cddeff\n! rowspan=\"5\" |2024\n|\n|California Against the Sea: Visions for Our Vanishing Coastline\n|Winner\n|\n|-\n|\n|The Bathysphere Book: Effects of the Luminous Ocean Depths\n|Shortlist\n|\n|-\n|\n|Crossings: How Road Ecology Is Shaping the Future of Our Planet\n|Shortlist\n|\n|-\n|\n|Womb: The Inside Story of How It All Began\n|Shortlist\n|\n|-\n|\n|In the Blood: How Two Outsiders Solved a Centuries-Old Medical Mystery and Took on the US Army\n|Shortlist\n|\n|-style=background:#cddeff\n! rowspan=\"5\" |2025\n|\n|Every Living Thing: The Great and Deadly Race to Know All Life\n|Winner\n|\n|-\n|\n|The Burning Earth: A History\n|Shortlist\n|\n|-\n|\n|Playing with Reality: How Games Have Shaped Our World\n|Shortlist\n|\n|-\n|\n|All in Her Head: The Truth and Lies Early Medicine Taught Us About Women’s Bodies and Why It Matters Today\n|Shortlist\n|\n|-\n|\n|The Age of Deer: Trouble and Kinship with Our Wild Neighbors''\n|Shortlist\n|\n|}\nReferences\nExternal links\n* [https://pen.org/pen-eo-wilson-prize-literary-science-writing/ PEN/E. O. Wilson Literary Science Writing Award]"
    }
  ]
}