{
  "content": [
    {
      "type": "text",
      "text": "# Pencombe with Grendon Warren\n\n|country = England\n|static_image = Pencombe Church - geograph.org.uk - 113360.jpg\n|static_image_width =\n|static_image_caption = Parish church of St John\n|constituency_westminster = North Herefordshire\n|post_town = BROMYARD\n|postcode_area = HR\n|postcode_district = HR7\n|dial_code = 01885\n|os_grid_reference = SO5865\n|unitary_england = Herefordshire\n|lieutenancy_england = Herefordshire\n|population =\n|population_ref =\n|region = West Midlands\n|london_distance_mi = 115\n|london_direction = ESE\n}}\nPencombe with Grendon Warren is a civil parish in the county of Herefordshire, England. The parish was created in 1895 from the parishes of Pencombe and Grendon Warren, its only nucleated settlement being the village of Pencombe.\nHistory\nAccording to A Dictionary of British Place Names and The Concise Oxfordshire Dictionary of English Place-names Pencombe derives from the Old English 'penn' with 'cumb' meaning \"valley with a pen or an enclosure\", and was written in 12th and 13th century as 'Pencumbe'. Grendon derives from the Old English 'grēne' with 'denu' meaning \"green valley\", and in the 1240s was written as Grendene, Grenden and Grendone. Warren may derive from either the surname \"de Warenne\", or from the Old French \"warir\" or \"garir\", leading to \"warenne\" or \"garenne\" meaning enclosed land or park for the breeding or hunting of rabbits or game.\nThe Pencombe part of the parish is listed in the Domesday Book as a manor in the Tornelaus hundred of Herefordshire. There were 21 villagers, four smallholders (middle level of serf below a villager), six slaves, a priest, a smith, and a further six people. There were ploughlands for three lord's plough teams and 20 men's plough teams, a mill, and a church. In 1066 Alfred of Marlborough was lord of the manor, this after the Norman Conquest in 1086 passing to his daughter Agnes, with Alfred of Marlborough becoming tenant-in-chief to king William&nbsp;I. The Grendon Warren part was included in the manor of Grendon, listed as \"Grenedene\" in the Domesday Book. At the time of the Norman Conquest Grendon was in the Plegelgete Hundred of Herefordshire. The manor's entire listed assets was eight ploughlands. The lords of the manor in 1066 were Edwy the noble and Ordric, with a manor each. In 1086 lordship was passed to William Devereux under Roger de Lacy who became tenant-in-chief to king William&nbsp;I.\nPencombe with Grendon Warren civil parish was created in 1895 by a union of the parishes of Pencombe and Grendon Warren, at the time administered by Bromyard Rural District Council of the Northern Division of Herefordshire, and was in the Union,—poor relief and joint workhouse provision set up under the Poor Law Amendment Act 1834—Police court and County court district of Bromyard, and in the Broxash Hundred. Grendon Warren was previously a chapelry of Pencombe, and an extra-parochial area, later a civil parish.\nIn 1913 Pencombe with Grendon Warren was in the Bromyard rural deanery of the Archdeaconry and Diocese of Hereford. It was  west from Bromyard station on the Great Western Railway, and  west from Dinmore station on the Shrewsbury and Hereford Railway. St John's Church, with a south tower with six bells, had been rebuilt in 1864-65 for £3,232, its parish registers dating to 1538. The incumbent's living was a rectory with  of glebe—an area of land used to support a parish priest—and a rectory house \"very pleasantly situated\" a half mile from the church. The rector was also the perpetual curate—an office supported by stipend rather than tithes or glebe—of Marston Stannett. A reading room was established in 1890, the interior of which was furnished with fittings costing £150, including billiard and newspaper rooms. Principal landowners were the Ecclesiastical Commissioners. The parish, with a 1911 population of 280, had an area of  of \"clayey\" soil over a part subsoil of stone, in which were grown wheat, beans, oats, clover and apples. The chapelry and hamlet of Marston Stennett, at the north-west of the parish, was at the time in Pencombe with Grendon Warren (now in the parish of Humber), its then chapel, rebuilt in 1868, comprising a chancel, nave, and a western turret with one bell. The original chapel had been built in 1711 by the sister to Lord Chief Justice Heley of Ireland. The chapelry living was a perpetual curacy, with  of glebe, in the gift of the rector of Pencombe.\nThe parish post office received letters through Worcester; the closest money order office was at Bredenbury, and telegraph office at Stoke Lacy. A public elementary school, with a schoolmaster's house, was built in 1862 for 120 children; average attendance in 1913 was 50. Resident within the parish were the school master and mistress, the local rector, and the parish clerk. Commercial occupations included 24 farmers, including two farms at both Grendon Warren and Marston Stennett. There were two shopkeepers, one of whom ran the post office, a beer retailer, and a blacksmith. One of the farmers was a landowner and the licensee of the Burghope Inn providing \"good accommodation for cyclists and tourists\"; he was also the assistant overseer for the parish, and the parishes of Stoke Lacy, Ullingswick, Bredenbury, and Wacton & Morton Jeffries.\nGovernance\nPencombe with Grendon Warren is represented on the lowest tier of UK governance by six members on the Pencombe Group Parish Council. As Herefordshire is today a unitary authority—no district council between parish and county councils—the parish sends one councillor, representing the Hampton Ward, to Herefordshire County Council. Pencombe with Grendon Warren is represent in the UK parliament as part of the North Herefordshire constituency.\nIn 1974 Pencombe with Grendon Warren became part of the Malvern Hills District of the county of Hereford and Worcester, instituted under the Local Government Act 1972.\nGeography\nPencombe with Grendon Warren is about  from north to south and  east to west. The parish is rural, of farms, fields and streams, isolated and dispersed businesses and residential properties, with the only nucleated settlement the village of Pencombe at the east of the parish. Watercourses drain the parish from its centre, the highest point being Hegdon Hill, a Marylin—a prominent hill with a drop of at least  on all sides—at , with a drop of , surmounted by a trigpoint and a radio mast. Two streams run to the River Lodon at the east of the parish, one flowing through Pencombe village. At the north-west two streams flow to a tributary feeding the River Lugg at Bodenham. At the centre and flowing south-west are three streams which become one, and again feed the River Lugg. The main through-route is a minor road which runs to Bromyard at the north-east and the A417 road at the south-west. Crossing this road at Pencombe is a further minor road which runs to the village of Little Cowarne at the south and to Risbury at the north-west. All other routes are minor farm and residential roads, tracks, cul-de-sacs and footpaths. Pencombe with Grendon Waren is approximately  north-west from the city and county town of Hereford. The nearest towns are Leominster, about  to the north-west and Bromyard  to the east. Adjacent parishes are Grendon Bishop at north, Bromyard and Winslow at the east defined by the River Lodon, Little Cowarne and Ullingswick at the south, Bodenham at the south-west, and Humber at the north-west. Both Bodenham and Humber borders are defined partly by the tributary of the River Lugg.\nCommunity\nParish amenities and facilities include, within Pencombe, St John's parish church which incorporates a library, the Wheelwights Arms public house, the Pencombe CE Primary School with a separate preschool, and the Pencombe & Little Cowarne Parish Hall, which incorporates a post office and provides facilities for the local Women's Institute and Young Farmers' Club. The nearest secondary school is Queen Elizabeth High School,  to the north-east at Bromyard. From Pencombe is an autograss circuit  to the north-west, a farm for growing fruit under polytunnels  to the south-west at the border with Little Cowarne parish, a care home  to the south, and holiday cottages  to the north. A bus stop in Pencombe provides a parish service connection to Hereford, Bromyard and Ledbury. The closest rail connection is at Leominster railway station,  to the north-west, on the Crewe to Newport Welsh Marches Line. The parish falls under the Wye Valley NHS Trust; the nearest major hospital is Hereford County Hospital at Hereford. Parish population in 2001 was 340, and in 2011, 329. The civil parish is covered by the ecclesiastical parish of Pencombe with Marston Stannett.\nLandmarks\nWithin the parish are Grade II listed buildings, structures and scheduled monuments.\nSt John's Church (listed 1973, and at ) within Pencombe village, was built in 1863-65 by Hereford architect Thomas Nicholson on the site of a 12th-century medieval church, and is Gothic Revival in Norman and Early English styles. Of sandstone courses with slate roof, it comprises a nave, a chancel with a three-bay apse, a gabled south porch with a niche containing a statue of the Virgin and Child, a vestry at the north of the chancel, and a buttressed south tower with a pyramidic roof, the south-east buttress incorporating an external stair turret with conical roof. The nave and chancel windows are of Early English tracery. The tower belfry stage contains two abat-sons on each face, and six bells, one dating to 1658 a survival from the previous church. The interior is plastered and roofed with braced timber, the chancel with altar, stained glass memorial window and a reredos of arches forming an arcade, and, at the west end of the church, two fonts, one octagonal of the 15th century. At the chancel arch is the pulpit.\nAt  south from the church off the road to Little Cowarne (listed 1973, and at ), is the 17th-century Causeway Cottage, of one storey with attic, timber-framed with infills of brick and plaster with two casement windows and a central doorway. At  further south is Cotswold House (listed 1973, and at ), an early 18th-century cottage, part timber-framed of one storey with attic and casement windows and central doorway, and a roof of slate tiles with gable ends. At  north from the church is a group of farm buildings, part of Court Farm, one of which is an early 17th-century outbuilding (listed 1973, and at ), with tiled roof and gabled front and ends with pigeon holes and ledges, and an elevated doorway accessed by steps. At  south-west from the church, on a private drive south from the road to the A417, is Mason's Cottage (listed 1973, and at ), dating to the 17th century, timber-framed of one storey with attic and two casement windows.\nTo the west of the church is the village green triangle. At the south of the triangle, and  from the church, is The White House (listed 1973, and at ), a 17th and 18th-century cottage of stone rubble painted white, of two storeys and with casement windows and slate tile roof, and at the back with the upper floor timber-framed. Just to the south from The White House, on the road junction, is Tally Ho (listed 1973, and at ), a 17th-century cottage of one storey with entrance porch plus attic, and of stone rubble walls painted white, tiled roof with dormers, and casement windows. The north-west and south-east gable ends have an attached external rubble chimney stack. The south-east gable end has exposed timber-framing. Opposite The White House, on the green, is a Sir Giles Gilbert Scott 1935 designed cast iron K6 Telephone Kiosk (listed 1989, and at ). At  north-east from the telephone kiosk, and on the green, is Pencombe War Memorial (listed 2019, and at ), probably dating to the 1920s, and of a stone cross with octagonal shaft, and on an octagonal plinth surrounded by a square fence. The memorial commemorates four serviceman who died in the First World War. In the parish, just north-east of the village to the north of the Bromyard road, and  from the church, is Norbrook Cottage (listed 1973, and at ). Dating to the 17th century, it has been extended and modernised. It is of two storeys and timber-framed with nogging (infills), casement windows, a gable-ended tiled roof with external stone chimney stack, and a front verandah.\nIn the wider parish are six Grade II listed farmhouses. Sidnall Farmhouse (listed 1973, and at ),  to the south-southwest of the church near the border with Little Cowarne parish, is an 18th-century stone rubble house of L-shaped plan, two storeys with gable ends, tiled roof and sash windows. Attached to the house is an 18th-century rectangular plan barn (listed 1973), of stone rubble ground floor and weatherboarding over timber-framing on the first. It \"retains a significant proportion of its historic fabric\", particularly its interior roof structure. Hennerwood Farmhouse (listed 1973, and at ),  west-northwest from the church and on a farm track leading south-west from the road to Risbury, dates to the early 17th century and is two-storey, of roughcast covered timber-framing with gable ends and a cross-wing. There are two blocks at the north-east, one possibly medieval, the other, 17th century. Adjoining the farmhouse is a 17th-century barn (listed 1973), with stone rubble ground floor walls and weatherboarding over timber-framing on the first. Further east towards Pencombe along the Risbury road is Nash Farmhouse and Church House Farmhouse, both about  north-west from the church. Nash Farmhouse (listed 1967, and at ), to the north of Risbury road, dates to the 17th century, and is of timber-framing with brick nogging (infills) with roughcast and stone rubble gable ends. It is of two storeys with a slate roof and diagonal chimneys. An extension is of the 18th century, with painted rubble walls. Windows are of mixed sash and casement, and there remains some original interior panelling. At the south-east of the house is a three-storey 17th-century outbuilding that was previously a cottage, with walls partly of rubble and partly timber-framed. At the south, on the opposite side of Risbury road, is the late 17th-century Church House Farmhouse (listed 1973, and at ), a two-storey gable-ended house with stone rubble walls and casement windows. At the extreme north-west of the parish, and north off the Risbury road, is the 17th-century Maidenhyde Farmhouse (listed 1973, and at ), of two-storey with attic, and stone rubble walls with timber-framing above and casement windows. The gable-ended roof with slate tiles has a central chimney stack with diagonal chimneys. Durstone Farmhouse (listed 1973, and at ), 1500 yards north from the church, is an 18th-century two-storey house of red brick with four windows with casements, a gabled porch, and a tiled roof with gable ends. Further north still is the listed outbuilding north-east from Grendon Court (listed 1973, and at ), and  north from the church. The building, with no obvious dating, might be a former chapel, but possibly converted to a barn in the 19th century. At  by , it is of two storeys with a gable-ended and tiled roof. The walls are stone rubble in which are three window openings: one blocked, the others partly blocked. It has a south doorway and an upper floor with a moulded beam from the 16th century.\nReferences\nExternal links\n*\n*[http://pencombegrouppc.org.uk Pencombe Group Parish Council]. Retrieved 5 November 2019\n*[https://pencombe.hmfa.org.uk Pencombe CE Primary School]. Retrieved 4 November 2019\n*[https://www.genuki.org.uk/big/eng/HEF/Pencombe \"Pencombe\"], Genuki. Retrieved 4 November 2019\n*[https://www.genuki.org.uk/big/eng/HEF/GrendonWarren \"Grendon Warren\"], Genuki. Retrieved 4 November 2019"
    }
  ]
}