{
  "content": [
    {
      "type": "text",
      "text": "# Pennsylvania Canal (Delaware Division)\n\n&ndash;Easton & connections from the Lehigh Canal and Morris Canal.\n| coordinates                 = Easton: , (40.688028, -75.204972) Bristol: (40.101363, -74.855829)\n| locmapin                    = Pennsylvania#USA\n| area                        =\n| built                       = 1828-1831, 1832-34\n| added                       = October 29, 1974\n| designated_nrhp_type        = December 8, 1976\n| mpsub                       = Covered Bridges of the Delaware River Watershed TR (AD)\n| refnum                      = 74001756\n| designated_other1_name      = Pennsylvania state historical marker\n| designated_other1_abbr      = PHMC\n| designated_other1_date      = January 1949\n| designated_other1_link      = List of Pennsylvania state historical markers\n| designated_other1_color     = navy\n| designated_other1_textcolor = #ffc94b\n}}\nThe Delaware Division of the Pennsylvania Canal, more commonly called the Delaware Canal, runs for  parallel to the right bank of the Delaware River from the entry locks near the mouth of the Lehigh River and terminal end of the Lehigh Canal at Easton south to Bristol. At Easton, which today is the home of The National Canal Museum, the Delaware Canal also connected with the Morris Canal built to carry anthracite coal to energy-starved New Jersey industries.\nLater, with a crossing-lock constructed at New Hope, the New Hope 'outlet lock' (1847) connected by Cable Ferry to enter at Lambertville, New Jersey, where it connected to a feeder navigation and canal that began at Bull's Island opposite Lumberville; which then ran over  south along the New Jersey bank of the Delaware River through Trenton to Bordentown, the west end of the Delaware and Raritan Canal (1834) to New York City via New Brunswick.}}\nThe Commonwealth of Pennsylvania built the Delaware Canal to feed anthracite coal to energy-hungry Philadelphia as part of its transportation infrastructure building plan known as the Main Line of Public Works, a legislative initiative creating a collection of self-reinforcing internal improvements to commercial transportation capabilities.\nThe Delaware Canal, like the Lehigh Canal, was primarily meant to carry anthracite coal and other bulk goods such as gravel and limestone, cement, and lumber from Northeastern Pennsylvania to Philadelphia. In reverse flow, the two canals carried manufactured goods, iron products and (a few decades later) steel products to the northeastern cities. The Delaware and Lehigh Canals also connected from Easton by ferry services across the Delaware River to New Jersey and the Delaware and Raritan Canal, connecting industrial loads to New York City.\nFirst opened in 1832, the Delaware Canal still has most of its original locks, aqueducts, and overflows. Although the two canals reached their peak shipping in 1855, after which coal transport down the Lehigh corridor was taken up increasingly by railroads, the canals stayed in operation until the Great Depression in the early 1930s. According to the National Park Service, it was the \"longest-lived canal in the country\".\n, which was a navigation built parallel to the course of the Lehigh River. The Delaware Canal, in comparison, was a ditch dug parallel to the main banks of the Delaware River and, although about 35% longer, had only half as many levels. Barge crews preferred the Delaware over the Lehigh because they could go faster, farther, longer before having to go through locks again.]]\nHistory\n]]\nThe Pennsylvania Canal system was spurred by the early success of the Erie Canal in New York State, which had opened in 1825. Construction on the Delaware Canal started in 1829, accomplished entirely with hand tools using primarily imported labor from Ireland.\nThe canal runs down a channel dug parallel to the Delaware River from Easton to Bristol, Pennsylvania; its line of travel is generally within sight of the river. Originally  in length, the canal is approximately  wide with a depth of about .\nAfter the original construction failed in 1830, it had to be re-engineered by Josiah White of the Lehigh Coal and Navigation Company, who had offered to engineer and build the Delaware Canal for a break in fees in 1824. The state sold the canal to the Lehigh Coal and Navigation Company in 1858.\nThe Delaware Canal took over the easy part of the journey for the coal barges transiting down the rapids strewn path of the Lehigh Valley from Mauch Chunk and the heights of Nesquehoning, Pennsylvania and the huge coal fields that connected beyond them.\nMillions of tons of coal traveled from Wilkes-Barre down the Lehigh Valley transportation infrastructure, then finished the journey on the Delaware Canal's barges.\nBut competition from the railroad led to a decline in barge traffic. By the 1920s, anthracite coal was waning as a source of fuel. The last commercial through traffic traveled the canal in October 1931 and the bankrupt Lehigh Coal and Navigation Company sold the canal back to the state for a nominal fee.\nIn 1933, a private group called The Delaware Valley Protective Association (DVPA) was founded to protect the canal as a historic asset. The DVPA persuaded the state to resume maintenance of the canal in 1940, when its towpath became Theodore Roosevelt State Park. The berms were restored and the canal was refilled with water.\nThrough the 1940s and 1950s, the canal was left mostly untouched. In the early 1960s, however, Pennsylvania officials explored plans to pave over the canal and create a road for cars. Local residents fought for the canal's protection. In 1964, Bucks County historian and DVPA member Willis M. Rivinus wrote the first Guide to the Delaware Canal to call attention to the canal's value.\nThrough the 1960s and 1970s, the DVPA and other influential citizens sought to secure federal landmark status to protect the Canal. In 1974, the Canal was placed on the National Register of Historic Places. In 1976, it was designated a National Historic Landmark, helping to guarantee its preservation. The towpath itself was named an official National Recreation Trail.\nIn 1988, the U.S. government created the Delaware and Lehigh National Heritage Corridor, covering a 165-mile north-south swath of eastern Pennsylvania that includes the Delaware Canal. In 1989, Theodore Roosevelt State Park was renamed Delaware Canal State Park.\n]]\nHowever, public funding for the canal often has been inadequate and, as in other parts of the country, private non-profit groups have been created to fill the void. In 1983, Bucks County resident Betty Orlemann organized the Friends of the Delaware Canal (FODC), now the canal's largest fund-raising and volunteer group. (The DVPA no longer exists). Under long-time executive director Susan Taylor, the FODC also functions as a watchdog group, ensuring goals are met to make the towpath trail walkable over its entire length and to eventually get the canal fully watered from Easton to Bristol.\n]]\nspanning the canal in Uhlerstown]]\nPortions of the Delaware Canal towpath were washed away or damaged during successive floods in 2004, 2005 and 2006.  A number of sections of the towpath were closed and impassable, including a long stretch north of Washington Crossing and sections south of Riegelsville. In February 2008, a section of the towpath collapsed and  of the canal lost water.\nThrough funds from the Federal Emergency Management Agency, the Pennsylvania Department of Conservation and Natural Resources (PA DCNR) currently is refurbishing the washed out sections of the canal. As of October 2009, according to Delaware Canal State Park manager Rick Dalton, 75&nbsp;percent of the towpath had been restored and was expected to be fully walkable by summer 2010.\nEngineering\nAt New Hope, engineers connected an undershot water wheel to another wheel with buckets, which lifted water from the Delaware River up into the canal using only the force of the river current.\nA few hundred yards above, there was an outlet lock to the Delaware River, and on the other side of the river a lock to the Delaware and Raritan canal. To enable boats to cross the river, engineers devised a system whereby two cables of unequal length attached to wheels on a spanning cable across the river would hold a boat at a diagonal to the current, thereby acting as a sail, pushing the boat across.\nMule barge tourist ride\nMule-drawn barges, operated by private concessionaires, provided rides for chartered private parties running from a landing at Lock #11 at New Hope north to a point about  above Centre Bridge, for a total one-way ride length of .\nTourist rides were also offered, however, they stopped in the vicinity of the Rabbit Run bridge, which carries PA 32 over the canal, about  north of Lock #11.  These rides were offered from approximately 1954 to 2006.  Each boat could transport between 55 and 80 passengers and were pulled by two mules.  Four boats, the Americana (painted red, white & blue), the Independence, the Liberty, and the Spirit of New Hope were used from the inauguration of the tourist ride until the 1997 season, when they were replaced by two new boats, the Molly Pitcher and the Myfanwy Jenkins (pronounced \"Mivanway\").\nSince 1997, operation of the barges have been under regulations by the U.S. Coast Guard (for example, steersmen are required to obtain a Master Mariner's license) and, if reopened, would face regulations imposed in 2009 on its sister operation on the Lehigh Canal in Easton, PA by the U.S. Department of Homeland Security for crew members in \"sensitive shipboard and dockside locations\".\nSee also\n* Lehigh Canal – A sister canal in the Lehigh Valley that fed coal traffic to the Delaware Canal via a connection in Easton, Pennsylvania.\n* Delaware and Raritan Canal – A New Jersey canal connection to the New York & New Jersey markets shipping primarily coal across the Delaware River. The D&R also shipped Iron Ore from New Jersey up the Lehigh.\n* Chesapeake and Delaware Canal – A canal crossing the Delmarva Peninsula in the states of Delaware and Maryland, connecting the Chesapeake Bay with the Delaware Bay.\n* Delaware and Hudson Canal - Another early built coal canal as the American canal age began; contemporary with the Lehigh and the Schuylkill navigations.\n* Schuylkill Canal - Navigation joining Reading, PA and Philadelphia.\nNotes\nReferences\n*\n|last1= Bartholomew|first1= Ann M.  |last2= Metz|first2= Lance E. |last3= Kneis|first3= Michael |date= 1989 |title= DELAWARE and LEHIGH CANALS, 158 pages\n|language= en  |edition= First |location=Oak Printing Company, Bethlehem, Pennsylvania\n|publisher= Center for Canal History and Technology, Hugh Moore Historical Park and Museum, Inc., Easton, Pennsylvania |publication-date= 1989 |isbn= 0930973097 |lccn= 89-25150\n}}\nFootnotes\nExternal links\n*[http://www.delawarecanalphotos.com/index.html Delaware Canal Photos]\n*[https://web.archive.org/web/20040212220909/http://www.dcnr.state.pa.us/stateparks/parks/delawarecanal.aspx PA DCNR Delaware Canal State Park]\n*[https://web.archive.org/web/20070816201257/http://www.nps.gov/history/nr/travel/delaware/del.htm Delaware Canal History]\n*[http://www.fodc.org Friends of the Delaware Canal]\n*"
    }
  ]
}