{
  "content": [
    {
      "type": "text",
      "text": "# Penobscot Expedition__disambig_1\n\n| date              = July 24 – August 16, 1779\n| place             = Penobscot Bay, Maine\n| result            = British victory\n| combatant2        =\n| combatant1        =\n| commander2        =  Solomon Lovell   Dudley Saltonstall   Peleg Wadsworth   Paul Revere\n| commander1        =  Francis McLean  John Moore  George Collier  Henry Mowat   Henry Evans\n| strength2         = 3,000  19 warships  25 support ships\n| strength1         = 700  10 warships\n| casualties2       = 474 killed, wounded, captured or missing  19 warships sunk, destroyed or captured  25 support ships sunk, destroyed or captured\n| casualties1       = 86 killed, wounded, captured or missing\n| campaignbox       =\n}}\nThe Penobscot Expedition was a 44-ship American naval armada during the Revolutionary War assembled by the Provincial Congress of the Province of Massachusetts Bay. The flotilla of 19 warships and 25 support vessels sailed from Boston on July 19, 1779, for the upper Penobscot Bay in the District of Maine carrying an expeditionary force of more than 1,000 American colonial marines (not to be confused with the Continental Marines) and militiamen. Also included was a 100-man artillery detachment under the command of Lt. Colonel Paul Revere.\nThe expedition's goal was to reclaim control of mid-coast Maine from the British who had captured it a month earlier and renamed it New Ireland. It was the largest American naval expedition of the war. The fighting took place on land and at sea around the mouth of the Penobscot and Bagaduce rivers at Castine, Maine, over a period of three weeks in July and August. It resulted in the United States' worst naval defeat until Pearl Harbor 162 years later in 1941.\nOn June 17, British Army forces landed under the command of General Francis McLean and began to establish a series of fortifications around Fort George on the Majabigwaduce Peninsula in the upper Penobscot Bay, with the goals of establishing a military presence on that part of the coast and establishing the colony of New Ireland. In response, the Province of Massachusetts raised an expedition to drive them out, with some support from the Continental Congress.\nThe Americans landed troops in late July and attempted to besiege Fort George in actions that were seriously hampered by disagreements over control of the expedition between land forces commander Brigadier General Solomon Lovell and expedition commander Commodore Dudley Saltonstall, who was later dismissed from the Navy for ineptitude. For almost three weeks, General McLean held off the assault until a British relief fleet arrived from New York on August 13 under the command of Sir George Collier, driving the American fleet to destruction up the Penobscot River. The survivors of the expedition made an overland journey back to more populated parts of Massachusetts with minimal food and arms.\nBackground\nBritish war planners looked for ways to gain control over the New England colonies following the somewhat successful raid on Machias in 1777 and General John Burgoyne's failed Saratoga campaign, but most of their effort was directed at another campaign against the southern colonies. Secretary of State for the Colonies Lord George Germain and his Under-Secretary William Knox were responsible for the war effort, and they wanted to establish a base on the coast of the District of Maine that could be used to protect Nova Scotia's shipping and communities from American privateers and raiders. The British also hoped to keep open the timber supply of the Maine coast for masts and spars for the Royal Navy. The coast down to the Penobscot was also next to the Bay of Fundy, which was easily approached from the large British naval base at Halifax. Loyalist refugees in Castine had also proposed establishing a new colony or province to be called New Ireland as a precursor to New Brunswick. Sir Francis Bernard supported the idea of a new colony, as it would make \"a resort for the persecuted loyalists of New England\".\nJohn Nutting was a Loyalist who had piloted Sir George Collier's expedition against Machias, and Knox induced him to write to Germain in January 1778 to promote the idea of a British military presence in Maine; he later dispatched him to London to do so in person. Nutting described the Castine peninsula as having a harbor that \"could hold the entire British Navy\" and was so easily defensible that \"1,000 men and two ships\" could protect it against any Continental force. He also proposed that the strategic location of such a post would help to carry the war to New England and would offer protection for Nova Scotia. Germain drafted orders for Lieutenant General Henry Clinton on September 2, to establish \"a province between the Penobscot and St. Croix rivers. Post to be taken on Penobscot River\".\nGermain ordered Clinton to \"send such a detachment of troops at Nova Scotia, or of the provincials under your immediate command, as you shall judge proper and sufficient to defend themselves against any attempt the rebels in those parts may be able to make during the winter to take post on Penobscot River, taking with them all necessary implements for erecting a fort, together with such ordnance and stores as may be proper for its defense, and a sufficient supply of provisions.\" However, Nutting's ship was captured by an American privateer and he was forced to dump his dispatches, bringing an end to the idea of a new colony in 1778.\nOrder of battle\nRoyal Navy\n* British Squadron, commanded by George Collier\n** HMS Raisonnable (64 guns)\n** HMS Greyhound (32 guns)\n** HMS Blonde (32 guns)\n** HMS Virginia (32 guns)\n** HMS Galatea (20 guns)\n** HMS Camilla (20 guns)\n** HMS Nautilus (18 guns)\n** HMS Otter (14 guns)\n** HMS Albany (14 guns)\n** HMS North (14 guns)\nContinental Navy\n* 1st Squadron, commanded by Solomon Lovell\n** USS Warren (32 guns)\n** Vengeance (24 guns)\n** Charming Sally (22 guns) (privateer)\n** Black Prince (18 guns) (privateer)\n** Hunter (18 guns)\n** Active (16 guns)\n** Hazard (16 guns)\n** Tyrannicide (14 guns)\n** Springbird (12 guns) (privateer)\n** Rover (10 guns) (privateer)\n* 2nd Squadron, commanded by Dudley Saltonstall\n** Monmouth (24 guns)\n** Putnam (24 guns)\n** Hector (20 guns)\n** Hampden (20 guns)\n** Sky Rocket (16 guns)\n** Defense (16 guns) (privateer)\n** Nancy (16 guns) (privateer)\n** USS Diligent (14 guns)\n** USS Providence (12 guns)\nBritish forces arrive\nA 1785 map depicting this action. The map is not to scale and marks the Bagaduce as the Penobscot River. Long Island as depicted on this map was later renamed Isleboro.\nNutting reached New York in January 1779, but General Clinton had received copies of the orders from other messengers. Clinton had already assigned the expedition to General Francis McLean who was based in Halifax, and he sent Nutting there with Germain's detailed instructions.\nMcLean's expedition set sail from Halifax on May 30, and arrived in the Penobscot Bay on June 12. The next day, McLean and Captain Andrew Barkley, the commander of the naval convoy, identified a suitable site at which they could establish a post.  On June 16, his forces began landing on a peninsula that was called Majabigwaduce (Castine, Maine) between the mouth of the Bagaduce River and a finger of the bay leading to the Penobscot River. The troops numbered approximately 700, consisting of 50 men of the Royal Artillery and Engineers, 450 of the 74th Regiment of (Highland) Foot, and 200 of the 82nd (Duke of Hamilton's) Regiment. They began to build a fortification on the peninsula which jutted into the bay and commanded the principal passage into the inner harbor.\nFort George was established in the center of the small peninsula, with two batteries outside the fort to provide cover for , which was the only ship expected to stay in the area. A third battery was constructed on an island south of the bay near the mouth of the Bagaduce River, in which Albany was harbored. Construction of the works occupied the troops for the next month, until rumors came that an American expedition was being raised in Boston to oppose them, following which efforts were redoubled to prepare works suitable for defense against the Americans. Captain Henry Mowat of the Albany was familiar with Massachusetts politics, and he took the rumors quite seriously and convinced General McLean to leave additional ships that had been part of the initial convoy. Some of the convoy ships had already left, but the orders were countermanded before armed sloops North and Nautilus were able to leave.\nAmerican reaction\nPlaque, St. Paul's Church (Halifax), Nova Scotia]]\nWhen news reached the American authorities at Boston, they hurriedly made plans to drive the British from the area. The Penobscot River was the gateway to lands controlled by the Penobscot Nation who generally favored the British, and Congress feared that they would lose any chance of enlisting the Penobscots as allies if a fort were successfully constructed at the mouth of the river. Massachusetts was also motivated by the fear of losing their claim over the territory in any post-war settlement.\nTo spearhead the expedition, Massachusetts petitioned Congress for the use of three Continental Navy warships: the 12-gun sloop Providence, 14-gun brig Diligent, and 32-gun frigate Warren. The rest of more than 40 vessels were made up of ships of the Massachusetts State Navy and private vessels under the command of Commodore Dudley Saltonstall. The Massachusetts authorities mobilized more than 1,000 militia, acquired six small field cannons, and placed Brigadier General Solomon Lovell in command of the land forces. The expedition departed from Boston harbor on July 19 and arrived off Penobscot on the afternoon of July 25.\nLanding\nOn July 25, nine of the larger vessels in the American flotilla exchanged fire with the Royal Navy ships from 15:30 to 19:00. While this was going on, seven American boats approached the shore for a landing, but turned back when British fire killed a soldier in one of the boats.\nOn July 26, Lovell sent a force of Continental Marines to capture the British battery on Nautilus Island (also known as Banks Island), while the militia were to land at Bagaduce. The Marines achieved their objective, but the militia turned back when British cannon overturned the leading boat, killing Major Daniel Littlefield and two of his men. Meanwhile, 750 men landed under Lovell's command and began construction of siege works under constant fire. On July 27, the American artillery bombarded the British fleet for three hours, wounding four men aboard HMS Albany.\nAssault\nOn July 28, under heavy covering fire from the Tyrannicide, Hunter, and Sky Rocket, Brigadier General Peleg Wadsworth led an assault force of 400 (200 marines and 200 militia) ashore before dawn at Dyce's Head on the western tip of the peninsula with orders to capture Fort George. They landed on the narrow beach and advanced up the steep bluff leading to the fort. The British pickets, who included Lieutenant John Moore, put up a determined resistance but received no reinforcement from the fort and were forced to retire, leaving the Americans in possession of the heights. Eight British troops were captured. At this point, Lovell ordered the attackers to halt and entrench where they were. Instead of assaulting the fort, Lovell had decided to build a battery within \"a hundred rods\" of the British lines and bombard them into surrender. The American casualties in the assault had been severe: \"one hundred out of four hundred men on the shore and bank\", with the Continental Marines suffering more heavily than the militia. Commodore Saltonstall was so appalled by the losses incurred by his marines that he refused to land any more and even threatened to recall those already on shore. In addition his flagship, the Continental frigate Warren, suffered considerable damage during the engagement with hits to the warship's mainmast, forestay and gammoning.\nAlthough possessing significant naval superiority over the British, over the next two weeks the excessively cautious Saltonstall dawdled despite repeated requests by General Lovell that he attack Mowatt's position at the entrance to the harbor. Instead he largely maneuvered the American fleet around the mouth of the Penobscot River beyond the range of the British guns with only occasional ineffective attempts to engage the British. As long as the British warships continued to hold the harbor they were able to pin down the American forces on the ground with concentrated fire and prevent them from taking Fort George.\nRealizing that time was running out, on August 11 General Lovell again wrote to Saltonstall pleading for him to attack saying: \"I mean not to determine on your mode of attack; but it appears to me so very practicable, that any farther delay must be infamous; and I have it this moment by a deserter from one of their ships, that the moment you enter the harbour they will destroy them.\" Saltonstall's ineptitude at Penobscot would lead to his being dismissed from the Navy as being \"ever after incompetent to hold a government office or state post\" the following October by the \"Committee for Enquiring into the Failure of the Penobscot Expedition\" of the Massachusetts General Court which determined that failure of the expedition was primarily the result of the \"want of proper Spirit and Energy on the part of the Commodore\", that he \"discouraged any Enterprizes or offensive Measures on the part of our Fleet\", and that the destruction of the fleet was occasioned \"principally by the Commodore's not exerting himself at all at the time of the Retreat in opposing the Enemies' foremost Ships in pursuit\".\nSiege\n'' by Thomas Lawrence. John Moore served under Francis McLean as a Lt. in the 82nd Regiment.]]\nOn July 29, one American was killed. July 30, both sides cannonaded each other all day, and  on July 31 two American sailors belonging to the Active were wounded by a shell. Lovell ordered a night assault on August 1 against the Half-Moon Battery next to Fort George, whose guns posed a danger to American shipping, and the Americans opened fire at 02:00. Colonel Samuel McCobb's center column, comprising his own Lincoln County Regiment, broke and fled as soon as the British returned fire. The left column comprising Captain Thomas Carnes and a detachment of marines, and the right column comprising sailors from the fleet, kept going and stormed the battery. As dawn broke, the Fort's guns opened up on the captured battery and a detachment of redcoats charged out and recaptured the Half-Moon, routing the Americans and taking 18 prisoners with them. Their own casualties were four men missing (who were killed), and 12 wounded.\nThe siege continued with minor skirmishing on August 2 with militiaman Wheeler Riggs of Falmouth being killed by an enemy cannon shot that bounced off a tree before hitting him. On August 4, Surgeon John Calef recorded in his journal that several men were wounded in exchanges of fire. On August 5, one man was killed and another captured, and on August 7, 100 Americans engaged 80 British with one killed and one wounded on the American side and two wounded among the British.\ndestroyed the American fleet]]\nDuring this time, the British had been able to send word of their condition, and request reinforcements, and on August 3 Captain (later Vice Admiral) Sir George Collier led a fleet of ten warships out of New York.\nThe next day, Saltonstall launched a naval attack against the British fort, but Collier's British relief fleet arrived and attacked the American ships. The privateer Hampden and one other vessel were captured by frigates  and . Over the next two days, the American fleet fled upstream on the Penobscot River pursued by Collier. On August 13, an American officer was wounded by enemy fire. On August 14 and 16 all of the vessels were scuttled and burned by their own crews while the rest were destroyed at Bangor. Several transports were either captured or later salvaged by the British. The surviving crews then fled overland to Boston with almost no food or ammunition.\nCasualties\nOver the course of the siege, Colonel David Stewart claims the British garrison suffered 25 killed and 34 wounded. Stewart gives no figures for captured or missing, but 26 prisoners are known to have been taken by the Americans.\nApart from the 100 men killed and wounded during the assault of July 28, the known American casualties throughout the siege came to 12 killed, 16 wounded and one captured, in addition to \"several wounded\" on August 4. The History of Penobscot says that \"our whole loss of men was probably not less than 150\". The chaotic retreat however, brought the American loss up to 474 killed, wounded, captured or missing.\nAftermath\nA committee of inquiry blamed the American failure on poor coordination between land and sea forces and on Commodore Saltonstall's failure to engage the British naval forces. On September 7, a Warrant for Court Martial was issued by the Navy Board, Eastern Department, against Saltonstall. Upon trial he was declared to be primarily responsible for the debacle, found guilty, and dismissed from military service. Paul Revere, who commanded the artillery in the expedition, was accused of disobedience and cowardice.  This resulted in his dismissal from the militia, even though he was later cleared of the charges. Peleg Wadsworth, who mitigated the damage by organizing a retreat, was not charged in the court martial.\nHistorian George Buker suggests that Saltonstall may have been unfairly blamed for the defeat. Buker argues that Saltonstall was unfairly represented by Lovell and others, and that Saltonstall was a scapegoat for the campaign's failure despite his tactically correct decisions given the geographic and military conditions in Penobscot Bay.\nA year later the British Cabinet formally approved the New Ireland project on August 10, 1780, and King George III gave his assent the following day to the proposal to separate \"the country lying to the northeast of the Piscataway [Piscataqua] River\" from the province of Massachusetts Bay in order to establish \"so much of it as lies between the Sawkno [Saco] River and the St. Croix, which is the southeast  boundary of Nova Scotia into a new province, which from its situation between the New England province and Nova Scotia, may with great propriety be called New Ireland\". Pursuant to the terms of the 1783 Peace of Paris all British forces then evacuated Fort George (followed by some 600 Loyalists who removed from the area to St. Andrews on Passamaquoddy Bay) and abandoned their attempts to establish New Ireland. During the War of 1812, however, British forces again occupied Fort George (still calling the area New Ireland) from September 1814 to April 1815 and used it as a naval base before withdrawing again with the arrival of peace.  Full ownership of present-day Maine (principally the northeastern borders with New Brunswick) remained disputed until the Webster-Ashburton Treaty in 1842. The \"District of Maine\" was a part of Massachusetts until 1820 when it was admitted into the Union as the 23rd state as part of the Missouri Compromise.\nLegacy\nIn 1972 the Maine Maritime Academy and the Massachusetts Institute of Technology searched for and found the wreck of Defence, a privateer that was part of the American fleet.  Evidence of scuttled ships was also found under the Joshua Chamberlain Bridge in Bangor and under the Bangor town dock, and several artifacts were recovered.  Cannonballs were also reported to have been recovered during the construction of the concrete casements for the I-395 bridge in 1986.\nThe earthworks of Fort George stand at the mouth of the Penobscot River in Castine, accompanied by concrete work added later by the Americans in the 19th century.  Archaeological evidence of the expedition, including cannonballs and cannon, was located during an archaeological project in 2000–2001.\nSince 2004 a comprehensive exhibit on the Penobscot Expedition has been provided by the Castine Historical Society, located at its base on School Street, Castine.\nIn 2021, San Francisco Unified School District announced that it would strip Paul Revere's name from Paul Revere K–8 for his role in the Penobscot Expedition. The San Francisco Board of Education mistakenly believed the expedition was to steal land from the Penobscot people. The renaming plan was later reversed in April 2021, and Paul Revere's name was restored to that school.\nIn popular culture\nBernard Cornwell's 2010 historical novel The Fort gives an account of the expedition. It draws attention to the presence there of a junior British officer named John Moore, later a famous general.\nSee also\n* Military history of Nova Scotia\n* Penobscot Expedition Site\nReferences\nNotes\nSources\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*[https://archive.org/details/siegepenobscot00calerich/page/n3?q=privateer+%22bay+of+fundy%22 The siege of Penobscot by the rebels; containing a journal of the proceedings of His Majesty's forces detached from the 74th and 82d regiments... with a chart of the peninsula of Majabigwaduce, and of Penobscot river, to which is subjoined a postscript by John Calef. 1910.]\nFurther reading\n* [https://web.archive.org/web/20130917085419/http://www.dtic.mil/cgi-bin/GetTRDoc?AD=ADA547183 Thesis – Penobscot Expedition]\n* [https://archive.org/stream/acg3054.0002.010.umich.edu#page/n163/mode/1up Jonathan Mitchell's Regiment – Begaduce Expedition. Maine Historical Society]\n* [https://babel.hathitrust.org/cgi/pt?id=uva.x000932986;view=1up;seq=137 British journal of the attack]\n* [https://archive.org/stream/acg3054.0002.003.umich.edu#page/379/mode/1up Paul Revere's account of the attack]\n*  A historical novel depicting the Penobscot Expedition, with a non-fiction \"Historical Note\" (pp.&nbsp;451–468) on sources and key details.\nExternal links\n* [https://archive.today/20121212020735/http://www.navy.mil/search/display.asp?story_id=8259 Revolutionary War-Era Swivel Gun reveals its secrets] (about a gun raised from Penobscot Bay)\n* [http://CPRR.org/Museum/BMLRR/Penobscot.html \"The Ancient Penobscot, or Panawanskek.\"] The Historical Magazine  and Notes and Queries concerning The Antiquities, History, and Biography of America. Third Series, Vol. I, No. II; Whole Number, Vol. XXI, No. II, February, 1872. Morrisina, N.Y., Henry B. Dawson. pp.&nbsp;85–92.\n* [http://penobscot1779.tripod.com/PE%20history.htm A Short History of the Penobscot Expedition]"
    }
  ]
}