{
  "content": [
    {
      "type": "text",
      "text": "# People's Republic of Korea__disambig_1\n\n(MR)}}\n| common_name            = Korea\n| image_map              = Korea (orthographic projection).svg\n| p1                     = Korea under Japanese ruleChōsen\n| flag_p1                = Merchant flag of Japan (1870).svg\n| s1                     = United States Army Military Government in Korea1945:United States Army Military Government in Korea\n| flag_s1                = US flag 48 stars.svg\n| s2                     = Soviet Civil Administration\n| flag_s2                = Flag of the Soviet Union (1936-1955).svg\n| s3                     = Provisional People's Committee of North Korea1946:Provisional People's Committee of North Korea\n| flag_s3                = Flag of the Provisional People's Committee for North Korea.svg\n| image_flag             = Flag of the People's Committee of Korea.svg\n| flag                   = List of Korean flags#National\n| flag_type              = Flag of the Preparatory People's Committees\n| image_coat             = Coat of arms of the People's Republic of Korea.svg\n| symbol_type            = Emblem\n| symbol_type_article    = Emblem of North Korea\n| national_motto         = \"Self-reliant and independent state\"\n| national_anthem        = \"The Patriotic Song\"\n| capital                = Seoul\n| largest_city           = capital\n| common_languages       = Korean\n| era                    = Cold War\n| date_start             = 15 August\n| event_start            = Surrender of Japan\n| year_start             = 1945\n| event1                 = Soviet forces stationed in Pyongyang\n| date_event1            = 24 August 1945\n| event2                 = PRK established\n| date_event2            = 6 September 1945\n| event3                 = American forces stationed in Seoul\n| date_event3            = 9 September 1945\n| event4                 = PRK dissolved in the South\n| date_event4            = 12 December 1945\n| event_end              = Committees co-opted in the North\n| date_end               = 8 February\n| year_end               = 1946\n| currency               = Korean won\n| title_leader           = President\n| leader1                = Syngman Rhee\n| year_leader1           = 1945–1946\n| title_deputy           = Chairman of the National People's Representative Conference\n| deputy1                = Lyuh Woon-hyung\n| year_deputy1           = 1945\n| today                  =\n| demonym                =\n| government_type        = Non-functioning government, Democratic republic under a provisional government\n| area_km2               =\n| area_rank              =\n| GDP_PPP                =\n| GDP_PPP_year           =\n| HDI                    =\n| HDI_year               =\n}}\nThe '''People's Republic of Korea''' () was a short-lived provisional government that was organized at the time of the surrender of the Empire of Japan at the end of World War II. It was proclaimed on 6 September 1945, as Korea was being divided into two occupation zones, with the Soviet Union occupying the north and the United States occupying the south. Based on a network of people's committees, it presented a program of democratization of society and the economy.\nIn the south, the US military government declared the PRK to be illegitimate on 12 December 1945. In the north, under the auspice of the Soviet military government, the Korean Worker's Party led by Kim il-sung took over the People's Committee by incorporating them into the political structure of the emerging Democratic People's Republic of Korea (North Korea), and by exerting an ever-increasing direct influence on the agenda and structure of other smaller political parties (such as the KDP and the DIP).\nHistory\nEstablishment\nOn 15 August 1945, the Empire of Japan formally surrendered to the Allies and capitulated on 2 September. The Japanese occupational authorities requested that a government be established to ensure the safety of their persons and property after the occupation ended. Whilst the Soviet Union continued to fight the Empire of Japan in Chongjin, , who served as the second-ranking member of the Japanese Government-General sought to secure the safe exit of the Japanese civilians at the request of Nobuyuki Abe. He proposed to Song Jin-woo that he take over the security and administrative rights of Korea, but when this was rejected, he asked to meet Lyuh Woon-hyung in Seoul. Under Lyuh's leadership, the newly formed Committee for the Preparation of Korean Independence (CPKI) organized people's committees throughout the country to coordinate the transition to independence. On 28 August 1945 the CPKI announced that it would function as the temporary national government of Korea. On 6 September, CPKI activists met in Seoul and established the PRK.\nSecurity and administrative rights were transferred to Lyuh, and the safety of the Japanese evacuating the Korean Peninsula was guaranteed. Accordingly, Lyuh suggested the following conditions:}}\nDeployment\ngiving a speech at a YMCA in Gyeongseong (16 August 1945)]]\nThe PRK has great significance in that it is the first Korean political organization to implement local autonomy, in the form of the people's committees. By the end of August, more than 140 committees were established nationwide in response to the support of the people. Later it was nominally nominate Syngman Rhee as PRK's leader, Kim Ku and Kim Kyu-sik were also invited to join the cabinet, but all of them refused.\nThe organizational work of the National Preparatory Committee was also carried out in North Korea. The leader in the North Korean region was Cho Man-sik, a native of Pyongyang, who 'took a non-violent yet uncompromising route' during the Japanese colonial period. Under different regional conditions in the south and north of the Korean Peninsula, Lyuh Woon-hyung and Cho Man-sik simultaneously launched the founding project.\nThe organization had different names and differences in composition, depending on whether it was led by communists or nationalists. It also provided a foundation for the construction of a new nation as a 'people's self-governing organization', created by both nationalists and socialists who had been engaged in the independence movement during the Japanese colonial period.\nSeo Joong-seok, a professor of history at Sungkyunkwan University, said, 'If there was no organization like the people's committees after liberation, there would have been great confusion. This is because major independence movement groups, including the Provisional Government of the Republic of Korea, were far abroad. However, before the liberation, the founding alliance was organized mainly by domestic groups, who were able to voluntarily perform major tasks such as security and administration.'\nProgram\nThe program of the PRK was presented in its 14 September twenty-seven point program. The program included: \"the confiscation without compensation of lands held by the Japanese and collaborators; free distribution of that land to the peasants; rent limits on the nonredistributed land; nationalization of such major industries as mining, transportation, banking, and communication; state supervision of small and mid-sized companies;... guaranteed basic human rights and freedoms, including those of speech, press, assembly, and faith; universal suffrage to adults over the age of eighteen; equality for women; labor law reforms including an eight-hour day, a minimum wage, and prohibition of child labor; and \"establishment of close relations with the United States, USSR, United Kingdom, and China, and positive opposition to any foreign influences interfering with the domestic affairs of the state.\" The motto of the PRK was, accordingly, \"Self-reliant and independent state\" ().\nDevelopments\nCommunist takeover in the North\nWhen Soviet troops entered Pyongyang on 24 August 1945, they found a local People's Committee established there, led by veteran Christian nationalist Cho Man-sik. While the Soviet authorities initially recognized and worked with the People's Committees, they made determined efforts to ensure that Koreans friendly to their political interests, especially Korean communists, were placed into positions of power.\nBy some accounts, Cho Man-sik was the Soviet government's first choice to lead North Korea. However in December 1945, at the Moscow Conference, the Soviet Union agreed to a US proposal for a trusteeship over Korea for up to five years in the lead-up to independence. Most Koreans demanded independence immediately, which included Cho Man-sik, who opposed the proposal at a public meeting on 4 January 1946. Afterwards, he disappeared into house arrest. He was replaced by Kim Il Sung, who alongside most of the Koreans Communists had supported the trusteeship under pressure from the Soviet government. On 8 February 1946, the People's Committees were reorganized as Interim People's Committees dominated by Communists. The new regime instituted popular policies of land redistribution, industry nationalization, labor law reform, and equality for women. Meanwhile, existing Communist groups were reconstituted as the Workers' Party of Korea under Kim Il Sung's leadership.\nAfter the failure of negotiations for unification, the Democratic People's Republic of Korea (DPRK) was proclaimed on 9 September 1948, with Kim Il Sung as premier.\nSuppression in the South\nAfter the American arrival in September 1945, the United States Army Military Government in Korea controlled the peninsula south of the 38th parallel. The military governor Lieutenant-General John R. Hodge refused to recognize the PRK and its People's Committees, which were outlawed on 12 December. He later stated, \"one of our missions was to break down this Communist government\". On 19 July 1947, Lyuh Woon-hyung was assassinated by Han Ji-geun, a member of the far-right White Shirts Society.\nEdgar Snow, an American journalist, returned to Korea after its liberation and stayed for two months to report on the situation:\n}}\nSome local units of the People's Republic remained active in the Jeolla region  and especially on Jeju Island, where their presence, together with marauding anti-communist youth gangs, contributed to tensions that exploded in the events known as Jeju uprising of 1948–1949.\nCountrywide\nEarly November saw the creation of the National Council of Korean Labor Unions (NCKLU) and its endorsement of PRK and its program. December saw the creation of the National League of Peasant Unions, the Korean Democratic Youth League, and the Women's League, and their support of the PRK.\nCentral People's Committee\n{| class=\"wikitable\"\n|+\n!Portfolio\n!Officeholder\n|-\n|President\n|Syngman Rhee\n|-\n|Vice President\n|Lyuh Woon-hyung\n|-\n|Prime Minister\n|Ho Hon\n|-\n|Minister of Home Affairs\n|Kim Ku\n|-\n|Minister of Foreign Affairs\n|Kim Kyu-sik\n|-\n|Minister of Finance\n|Cho Man-sik\n|-\n|Minister of Military\n|Kim Won-bong\n|-\n|Minister of Economy\n|Ha Pilwon\n|-\n|Minister of Agriculture and Forestry\n|Bong Mi-seon\n|-\n|Minister of Health\n|Lee Man-Gyu\n|-\n|Minister of Transport\n|Hong Nam-pyo\n|-\n|Minister of Security\n|Choi Yong-Dal\n|-\n|Chief Justice\n|Kim Byung-ro\n|-\n|Minister of Education\n|Kim Seong-su\n|-\n|Minister of Propaganda\n|Kwan-Sul Lee\n|-\n|Minister of Communications\n|Sin Ik-hui\n|-\n|Minister of Labor\n|Lee Sang-Hyuk\n|-\n|General Secretary\n|Yi Kang-guk\n|-\n|Minister of Legal Affairs\n|Choi Ikhan\n|-\n|Minister of Planning\n|Jeong Baek\n|}\nSee also\n* Division of Korea\n* Provisional Government of the Republic of Korea\nReferences\n}}"
    }
  ]
}