{
  "content": [
    {
      "type": "text",
      "text": "# People's Party of the Republic of Moldova\n\n| native_name = Partidul Popular din Republica Moldova\n| native_name_lang = ro\n| logo =\n| colorcode =\n| abbreviation = PPRM\n| president = Alexandru Oleinic\n| general_secretary = Alexandru Luncari\n| leader1_title = First vice president\n| leader1_name = Valeriu Cosarciuc\n| leader2_title = Vice president\n| leader2_name = Maxim Brailă\n| founder = Ian Lisnevschi\n| founded =\n| headquarters = str. Mihai Eminesc 24, Chișinău\n| membership_year = 2018\n| membership = 5,640\n| ideology = Social democracyPopulismPro-Europeanism\n| position = Centre-left\n| colours = |border=darkgray}} Purple Orange\n| slogan = «It's time to return Moldova to the People!»()\n| seats1_title = Parliament\n| seats1 = }}\n| seats2_title = District Presidents\n| seats2 = }}\n| website = [http://www.pprm.md/ pprm.md]\n| country = Moldova\n}}'''The People's Party of the Republic of Moldova (PPRM'''; ) is a centre-left political party in the Republic of Moldova.\nParty leadership\n* President - Alexandru Oleinic\n* First Vice President - Valeriu Cosarciuc\n* Vice President - Maxim Brailă\n* Secretary General - Alexandru Luncari\nHistory\nCreation of the People's Party of the Republic of Moldova (PPRM)\nThe inaugural congress of the People's Party of the Republic of Moldova (PPRM) took place on 15 April 2011. The Moldovan congress approved the Statute and Program of the PPRM and elected the governing bodies of the party. Ian Lisnevschi was elected as the party president.\nThe People's Party of the Republic of Moldova was founded with the support of three youth groups: the Young Democrats, Youth for Moldova, and Force of Moldova. The party aims to represent all citizens of the Republic of Moldova and to build a robust and modern state of welfare and justice. According to the PPRM, their ideology aligns with those who believe that responsibility, common sense, modesty, and efficiency must replace political warfare, incompetence, and populism.\n2nd Congress of the PPRM on 17 November 2012\nCongress approved essential changes to the party's statute and program, a new leadership was elected, and goals were set for the next term. Under the new statute, the party leadership consisted of four co-chairs, one of them the coordinating co-chair. Alexandru Oleinic, former Minister of Information Technology, was elected coordinating co-chair. The other three elected co-chairs were Valeriu Cosarciuc, former Minister of Agriculture, and Angela Cebotari and Vasile Guțu, both leaders in the territory.\nThe new political program, projected PPRM as a modern, pro-European party to establish the Republic of Moldova and upholding the rule of law, its sovereignty, and democracy. It highlighted the PPRM's commitment towards the consolidation of the Moldovan society as a united civic nation and the integration of ethnic groups in common cultural communion. Another key objective was political stability, which would be achieved by improving the political system. The congress voted to found the National Political Council, the Central Commission of Censors, and the Court of Ethics and Arbitration. It was attended by 345 delegates from 29 territorial organizations of the PPRM.\n3rd Congress of the PPRM on 24 May 2014\nThe main task of the congress was to prepare the People's Party of the Republic of Moldova for the 2014 parliamentary elections. After the approval of the new Statute, Alexandru Oleinc was elected as the president of PPRM. His colleague, Valeriu Cosarciuc, was elected as the first vice-president of the party. Congress delegates also discussed the draft electoral program, titled \"For a New Moldova,\"  aimed at promoting the election of the president by the people, eliminating the electoral threshold for political parties, and reviving agriculture by support to local producers. The delegates to the Congress also approved the political slogan \"It is time to return Moldova to the People\" for the electoral race of November 2014. More than 800 delegates from all over the republic participated in the Congress, according to the organizers.\n4th Congress of the PPRM on 21 March 2015\nThe main objective of the congress was to analyze the socio-political situation in the country after the parliamentary elections in November 2014 and in the advent of the general local elections in June 2015. Delegates to the congress decided to enhance their capacity to participate in local elections. The congressional delegates also confirmed the amendments to the statutes and the change of the PPRM logo to the Apple - the electoral symbol of the People's Party. At the closing of the congress, delegates unanimously adopted an appeal to the political forces of the Republic of Moldova to unite the people and the pro-national and pro-European political parties for the identification and implementation of national priorities.\n5th Congress of the PPRM from 24 March 2018\nThe People's Party of Moldova held its 5th congress on Saturday, 24 March with delegates and representatives of territorial party organizations from all districts of the Republic of Moldova. The vital important event on the agenda was the adoption of the new political program of the party. The document was titled \"We Believe in Moldova.\" The PPRM intended to send a clear message to its citizens to mobilize and have confidence in the future of the Republic of Moldova.\nCongress re-elected its governing bodies and the president of the political party. Alexandru Oleinic was unanimously re-elected as president of the People's Party. Valeriu Cosarciuc was re-elected as First Vice-President.\nElectoral results\n{| class=wikitable style=text-align:center\n|+ Parliament\n|-\n! rowspan=\"2\" |Election\n! rowspan=\"2\" |Leader\n! colspan=\"5\" scope=\"col\" |Performance\n! rowspan=\"2\" |Rank\n! rowspan=\"2\" |Government\n|-\n!Votes\n!%\n!± pp\n!Seats\n!+/–\n|-\n!rowspan=\"2\" |2019\n|rowspan=\"2\" |Alexandru Oleinic\n|rowspan=\"2\" colspan=3|Only constituencies\n|rowspan=\"2\" |}}\n|rowspan=\"2\" bgcolor=\"lightgrey\" |New\n|rowspan=\"2\" | 6th\n|-PSRM)}}\n|-\n|\n|-\n|}\nReferences\nExternal links\n*[http://pprm.md/ The official website of the People's Party of the Republic of Moldova]\n*[http://www.e-democracy.md/parties/pprm/ Information about the People's Party of the Republic of Moldova]\n*[https://www.facebook.com/www.pprm.md/ Facebook page of the People's Party of the Republic of Moldova]"
    }
  ]
}