{
  "content": [
    {
      "type": "text",
      "text": "# Percy Waram\n\n| birth_place = Cornwall, United Kingdom\n| death_date =\n| death_place = Huntington, New York, U.S.\n| restingplace = Evergreen Cemetery, Stonington, Connecticut, U.S.\n| restingplacecoordinates =\n| othername =\n| occupation = Actor\n| yearsactive = 1899–1957\n| spouse = Lucia Cole\n| children = 2\n}}\nPercy Thomas Carne Waram ( ; 28 October 1880 – 5 October 1961) was a British-born stage and film actor who spent much of his career in the United States. His career lasted 55 years on the American stage, and he had memorable roles in The Shanghai Gesture, Elizabeth the Queen, Mary of Scotland, Pride and Prejudice, and Anne of the Thousand Days. He starred in the Chicago production of Life With Father for three years, setting box office and attendance records, after which he took the production on the road for another 38 weeks. He starred in the Broadway production of The Late George Apley for a year, and then spent another 80 weeks with the show's national tour.\nWaram originated the role of Horace Vandergelder in The Merchant of Yonkers, and appeared in an influential if not successful modern dress version of Hamlet.\nWaram made only a few films, and had no starring roles, but is best remembered now for his role as General Haynesworth in the film A Face in the Crowd.\nEarly life\nPercy Thomas Carne Waram was born 28 October 1880 in Cornwall in the United Kingdom to Joseph Carne Waram and his wife, Margaret Frances ( Powrie). His father served in the British Army, and his mother's family was Irish. He was a descendant of Mary Saunderson Betterton (1637–1712), the famed Elizabethan era actress. His great-grandmother was Julia Betterton Glover (1779–1850), the great comic actress of the early 1800s and the first woman to perform in Hamlet. His grandmother and mother were also actresses.\nAs a child, Waram wanted to join the army like his father had. While on holiday when he was 15 years old, he visited his older sister, who was appearing in the play East Lynne. A member of the cast fell ill, and Waram was cast as a butler in the play. He was immediately recast in the double role of an English nurse (in blonde wig) and French nurse (in black wig). It was his stage debut.\nHis family's difficult financial condition led him to go to work as an actor. He took a position with the same traveling company in which his sister was an actress, but quit shortly thereafter to join Sir Ben Greet repertory company. He made his London theatrical debut in 1899. Waram came with the Greet troupe when it traveled to the United States in 1902. He made his American stage debut in the play Everyman at the Maryland Theatre in Baltimore, Maryland.\nAfter two years in the United States, Waram returned to the U.K. in 1905 to form his own touring troupe. The company largely performed in rural areas, often appearing in \"tough mining towns\". While performing in Glasgow, Scotland, an audience member threw a mug of beer at his head, knocking him senseless. Waram decided to rejoin the Ben Greet company after the incident, and traveled with them to the U.S. again. He traveled back and forth between the United Kingdom and United States, appearing in plays on both side of the Atlantic Ocean. He permanently relocated to the U.S. in 1908.\nStage work\nEarly years\nThe Greet troupe specialized in presenting plays by William Shakespeare, and Waram appeared in As You Like It, The Merchant of Venice, Macbeth, Julius Caesar, Much Ado About Nothing, ''A Midsummer Night's Dream, Hamlet, and The Taming of the Shrew. The Greet players occasionally did other plays, and Waram appeared in She Stoops to Conquer'' in 1908.\nWaram sometimes worked for other companies as well. He appeared in the Violet Allen Company's production of Twelfth Night an American tour in 1903, the Frances Delaval Company's production of Her Lost Self at the St. James' Theatre in London in 1906, and performed for the William Faversham Company in 1909.\nIn 1910, Waram formed a very small troupe under the name \"Percy Waram & Co.\", and toured the Keith-Albee-Orpheum and Proctor theater circuits in vaudeville in the sketch ''The Boatswain's Mate ( The Bos'n's Mate). W. W. Jacobs and Herbert N. Sargent wrote the sketch specifically for Waram, adapting a short story of the same name by Jacobs. The sketch made its debut at the Montauk Theatre in Passaic, New Jersey, and Waram & Co. performed it until October 1915. Vaudeville proved highly lucrative for him.\nBroadway debut and other early stage work\nWaram most likely made his Broadway debut in the 1909 production of The Barber of New Orleans'' at Daly's Theatre. The following year he appeared in Arthur Conan Doyle play The Fires of Fate at the Liberty Theatre on Broadway.\nAfter his three years in vaudeville ended, Waram returned to the stage as Captain Smollett in Treasure Island. The play premiered in June 1916 at the Colonial Theatre in Chicago. In October, the production moved to the Punch and Judy Theatre on Broadway, The play was Waram's first hit, running for 331 performances.\nWaram returned to Broadway in the Mark Swan play ''Somebody's Luggage'' at the 48th Street Theatre in August 1916. This was followed by the role of the Gardener in the Charles Frohman Company's production of J. M. Barrie play ''Barbara's Wedding. The play had its world premiere in Buffalo, New York.\nHis second hit play was Jane Cowl and Jane Murfin Lilac Time'', and his first important role. He played Captain Paget in the national touring company, which had a long run in Chicago in early 1918. He joined William Faversham's production of Lord and Lady Algy, which premiered at the Shubert Theatre on Broadway in December 1918, and stayed with the production during its 1919 national tour. He played the role of Lord Andrew Gordon in Guy Bolton and George Middleton play Adam and Eva during its national tour, which began in the summer of 1920 and did not end until March 1921. He followed by playing the role of George Herbert in Norman Trevor's Little Theater Group production of The Married Woman at Broadway's Princess Theatre in December 1921.\nWaram appeared in a number of Broadway plays over the next five years: As Phillip Blanchard in Eden Phillpotts' The Shadow at the Klaw Theatre in April 1922, as the Elder Brother in The Lucky One at the Garrick Theatre in November 1922, as Jacques in The Tidings Brought to Mary at the Garrick Theatre in December 1922, as Domin in R.U.R. at the Shubert Theatre in April 1923, as Winthrop Field in A Love Scandal at the Ambassador Theatre in November 1923, as Beaucaire in Monsieur Beaucaire at the Murat Theatre in Indianapolis in May 1924, as Maitland White in Philip Barry You and I at the Murat Theatre in May 1924, as Hugh Chadwell in Walter Archer Frost Cape Smoke at the Martin Beck Theatre in February 1925, as Horatio in a modern dress version of Hamlet at the Booth Theatre in November 1925, and as Citizen Hogan in ''Hangman's House at the Forrest Theatre in December 1926. Waram later considered his role in the modern dress Hamlet to be one of the most important in his career.\nThe Shanghai Gesture and stardom\nand Alfred Lunt. Waram originated the role of Sir Walter Raleigh.]]\nAfter a run of nearly a year on Broadway, John Colton hit play The Shanghai Gesture'' began a national tour, which began in Chicago in March 1927. Waram played Sir William Charteris, taking over from McKay Morris (who originated the role on Broadway). The play altered his career, turning him into a major star on the stage. After a four month run in Chicago, the play moved to Salt Lake City in May 1927, and San Francisco in June. After a four month run in California, the play moved to Kansas City, where it broke box office records for attendance. The play then toured Cincinnati, Detroit, Montréal, Pittsburgh, Baltimore, and Washington, D.C., before returning to Broadway's Majestic Theatre on January 30, 1928 for a final, limited run.\nWaram worked steadily through the early years of the Great Depression after the success of The Shanghai Gesture. Taking almost no time off, he appeared as Bill Walker in the October 1928 production of Major Barbara at the Guild Theatre, and the role of the Servant in ''Camel Through the Needle's Eye at the Guild Theatre in April 1929. He left Camel after just a week in the role to join the national touring company of Major Barbara. The role helped cement his reputation as a reliable actor, and brought him to the attention of producers nationwide. After spending the summer on tour, he took the role of Col. Pickering in the regional touring company of Pygmalion. The play premiered in September 1929 at the Wilson Theatre in Detroit for tryouts before moving to Indianapolis, St. Louis, Chicago, and Pittsburgh.\nIn October 1930, Waram originated the role of Sir Walter Raleigh in Maxwell Anderson new play, Elizabeth the Queen''. The play debuted at Ford's Theatre in Baltimore and then played regionally before making its Broadway premiere at the Guild Theatre in November 1930. Waram toured nationally in the role until June 1931.\nAfter taking a year off, Waram took the role of Comte Dubarry in the new operetta The Dubarry, which had its world premiere at George M. Cohan's Theatre in November 1932.}} The operetta was not successful, and in April 1933 Waram originated the role of Howard Bartlett in Somerset Maugham new play, For Services Rendered. After a tryout in Oakland, California, the first week of April, the play moved to the Booth Theatre on Broadway. The play closed quickly, and was critically panned. Waram's performance was considered the only outstanding aspect of the production. With work on the stage scarce due to the Great Depression, Waram joined the summer stock repertory company at the Casino Theatre in Newport, Rhode Island. He appeared in at least one play, the drawing room comedy ''Aren't We All? In October 1933, he appeared as Don Salluste de Bazan in an English-language adaptation of Victor Hugo Ruy Blas. After a brief run at the Majestic Theatre, the play moved to Baltimore, where it closed after a week. Waram was not out of work long: When Stanley Ridges left the role of Lord Morton (which he had originated) in Mary of Scotland at the Alvin Theatre, Waram took over the role. new play, Days Without End. It swiftly closed.}}\nAfter Mary of Scotland closed in May 1934, Waram accepted the role of Uncle Robert in Picnic'', a new comedy by Gretchen Damrosch staged at the National Theatre. The play quickly closed, and Waram returned to the Casino Theatre's summer stock company, where he appeared in A Bill of Divorcement and Benn Levy Art and Mrs. Bottle. Although Waram had no contract at the start of the 1934-1935 theater season, he appeared as Henry Pryor in the drama Living Dangerously at the Morosco Theatre in January 1935.\nFilm and stage work after 1935\nFirst film roles and Pride and Prejudice\nWaram was cast in his first film in March 1935. The role, a small one which barely made the final cut, was for Mutiny on the Bounty.\nAfter completing work in Hollywood, Waram returned to Broadway in the role of Mr. Bennett in Helen Jerome stage adaptation of Jane Austen Pride and Prejudice. The play debuted at the National Theatre in October 1935, and was a major hit. It ran for 219 performances (with only short interruptions for cast vacations) until May 1936.\nA series of much less successful plays followed over the next two years. These included the role Sir Hudson Lowe in the American premiere of St Helena in October 1936 at the Lyceum Theatre, Mr. Pinchwife in The Country Wife in December 1936 at Henry Miller's Theatre, and Malvolio in Twelfth Night at the Mohawk Drama Festival in Schenectady, New York, in July 1937. He joined the repertory company at the County Theatre in Suffern, New York, in the summer of 1937, appearing in A Bill of Divorcement and Pride and Prejudice. After nearly a year's break, Waram returned to the stage in Ruy Blas at a drama festival in Central City, Colorado, in May 1938.\nThree and a half years after Mutiny on the Bounty, Waram signed to do a second film. He played the role of slumlord business manager Arthur Mather in the social drama ...One Third of a Nation...\nThe Merchant of Yonkers and Life With Father\nPercy Waram and Jane Cowl in The Merchant of Yonkers in 1938\nIn December 1938, Waram originated the role of Horace Vandergelder in Thornton Wilder new play, The Merchant of Yonkers. After a brief tryout in Boston, the play moved to the Guild Theatre on Broadway. Actress Jane Cowl (who played the role of Dolly Levi) intensely disliked director Max Reinhardt, and Reinhardt retaliated by isolating Cowl physically on stage. The play was considered a disappointment, and ran for only 28 performances. The play was reworked into a musical by Jerry Herman and Michael Stewart, and debuted as Hello, Dolly! in 1964 to great acclaim. It ran for 2,844 performances.}}\nAfter another year away from the theater, Waram took the role of \"Father\" Clarence Day Sr. in a Chicago production of the hit Broadway play Life With Father. After a tryout at the Maryland Theatre in Baltimore, it opened at the Blackstone Theatre in Chicago on February 19, 1940. Waram was the first individual to take over the role of Father from the play's co-author Howard Lindsay, who originated the role on Broadway. Waram was widely praised for his interpretation.\nThe play ran for a record 66 weeks in Chicago, with attendance of more than 590,000 patrons and a box office gross of $850,000 ($}} in  dollars). The play called for Father to stamp a foot on the floor, calling for the cook to come upstairs. Waram stomped so ferociously that he broke his foot, and had to switch feet for the scene. He tried banging on a plate with silverware, but the prop plates broke too easily. He then tried whistling, but was not very good at it. He returned to stomping. When he came down with gout, he began using a cane to bang on the floor. Lillian Gish played opposite Waram as \"Mother\" Lavinia Day. Waram spent three years in the role.\nAfter a two-month break, a touring company of Life With Father began, with Margalo Gillmore in the role of \"Mother\". The tour ran until July 1942, and resumed again in October 1942 with June Walker as \"Mother\". After another 38 and a half weeks on the road and net profits of $559,000 ($}} in  dollars), the tour finally came to an end.\nJust as the tour of Life With Father came to an end, Waram was cast as Inspector Prentice in Paramount Pictures' noir crime film, Ministry of Fear.\nThe Late George Apley and Anne of the Thousand Days\nAfter a year away from the stage, Waram returned to acting in the role of Roger Newcombe in an adaptation of the novel The Late George Apley. Waram originated the role, with Leo G. Carroll in the leading role of George Apley. After a tryout at the Wilmington Playhouse in Wilmington, Delaware, in October 1944 and the Plymouth Theatre in Boston in November, it made its Broadway debut at the Lyceum Theatre. With only brief interruptions to rest the cast, the play ran until November 1945 on Broadway before embarking on an 80-week national tour.\nJust five months after finishing the Apley tour, Waram originated the role of Marcus Hubbard in Lillian Hellman play Another Part of the Forest. The play premiered in Wilmington before additional tryouts in Baltimore and Detroit. It premiered on Broadway at the Fulton Theatre in November 1946, where it ran for 182 performances. Waram left the show in September 1947.\nIn June 1946, during the national tour of The Late George Apley, Waram was cast as Roger Newcombe in the film version. Filming commenced in September 1947, and did not end until December. Waram only member of the stage production cast in film.\nIn November 1948, a year after filming The Late George Apley, Waram originated the role of Cardinal Wolsey in the new Maxwell Anderson play Anne of the Thousand Days. The play premiered at the Forrest Theatre in Philadelphia and moved to Broadway's Shubert Theatre in early December. Waram stayed with the production until early June 1949.\nFinal years\nLast roles\nWaram was cast in 1949 as senior law partner John Benley, father of Elizabeth Taylor Mary Benley, in Metro-Goldwyn-Mayer 1950 comedy The Big Hangover.\nNow 70 years old, Waram did not work in 1950 or 1951. He returned to Broadway in October 1952 in the dual role of the Station Master and God in Ugo Betti play The Gambler (adapted by Alfred Drake). The play premiered at the Lyceum Theatre, and closed after a short run. Waram returned to acting in October 1954, originating the role of Lucas Edgerton, a wealthy industrialist who goes on an art buying spree, in Reclining Figure.\nWaram's final hit stage role was that of the no-nonsense Judge in Enid Bagnold new play The Chalk Garden. The play had its world premiere at the Shubert Theater in Hartford, Connecticut, before moving to the Wilbur Theatre in Boston. It made its Broadway debut at the Ethel Barrymore Theatre in late October 1955, running for 182 performances.\nIn September 1956, Waram was cast in his final film role, that of General Haynesworth, chief executive officer of a vitamin company, in the film A Face in the Crowd.\nWaram appeared in his final stage role in October 1957. He played veteran police inspector Desiré Merlin in Michael Blankfort and Dorothy Stiles Blankfort's new play Monique. The work premiered at The Playhouse in Wilmington before moving to Broadway's John Golden Theatre two weeks later. The play closed after 63 performances.\nDeath\nWaram's wife, Lucia, died in March 1961.\nIn September 1961, Waram traveled to Huntington, New York, to be close to his daughter, who was ill. He entered the hospital himself on September 24, and died on October 5, 1961, at Huntington Hospital of an undisclosed illness. His funeral was held at Calvary Episcopal Church in Stonington, Connecticut, and he was buried at Stonington Cemetery.\nPersonal life\nPercy Waram married Lucia Cole, an American stage actress, on February 11, 1909. They met when she appeared alongside Waram in Everyman in 1902, and she later joined the Ben Greet company. The couple made their home in Stonington, and maintained a second home on the Cornish coast. The couple had two children: Frances Cole Waram (1911-1994), who married John H. Trowbridge in 1937, and Julian Thomas Cole Waram (1913-1982), for years a member of the United States Coast Guard. Waram's children were educated at a private school in Switzerland.\nWaram once voiced a fondness for quiet roles, and later said he preferred bloody mystery-thrillers.\nBoating and golfing were Waram's favorite pastimes, and he often smoked cigars. He was a member and strong supporter of the Actors' Equity Association (the American stage performer's union).\nWaram went mostly bald early in life. He had mid frontal baldness, and wore a toupée on stage in most of his roles. While starring in the play Lilac Time, his toupée caught on a piece of stage scenery. The near-disaster led him to grow out a mustache out of a fear that a fake mustache would fall off during a performance.\nFilmography\n{| class=\"wikitable\"\n|-\n! Year\n! Title\n! Role\n! Notes\n|-\n|1935|| Mutiny on the Bounty || Coleman || first film role\n|-\n|1939|| ...One Third of a Nation... || Arthur Mather ||\n|-\n|1944|| Ministry of Fear || Inspector Prentice ||\n|-\n|1947|| It Had to Be You || Horace Stafford ||\n|-\n|1947|| The Late George Apley || Roger Newcombe ||\n|-\n|1950|| The Big Hangover || John Belney ||\n|-\n|1957|| A Face in the Crowd || Gen. Haynesworth || final film role\n|}\nStage roles\n{| class=\"wikitable\"\n|-\n! Year\n! Title\n! Role\n! Location\n! Notes\n|-\n|1895 || East Lynne || English maid; French maid || not known || stage debut; United Kingdom stage debut\n|-\n|1902 || Everyman || not known || Baltimore, Md. || United States stage debut\n|-\n|1903 || Twelfth Night || not known || national tour ||\n|-\n|1906 || Her Lost Self || not known || West End (London) ||\n|-\n|1909 || The Barber of New Orleans || not known || Broadway || Broadway debut\n|-\n|1910 || The Fires of Fate || not known || Broadway ||\n|-\n|1916 || Treasure Island || Capt. Smollett || Chicago; Broadway || Chicago stage debut; first hit\n|-\n|1916 || ''Somebody's Luggage || not known || Broadway ||\n|-\n|1916 || Barbara's Wedding'' || Gardener || Buffalo, N.Y. || play's world premiere\n|-\n|1918 || Lilac Time || Captain Paget || national tour ||\n|-\n|1918 || Lord and Lady Algy || not known || national tour ||\n|-\n|1920 || Adam and Eva || Lord Andrew Gordon || national tour || 9 months in the role\n|-\n|1921 || The Married Woman || George Herbert || Broadway ||\n|-\n|1922 || The Shadow || Phillip Blanchard || Broadway ||\n|-\n|1922 || The Lucky One || Elder Brother (Bob Farringdon) || Broadway ||\n|-\n|1922 || The Tidings Brought To Mary || Jacques Hury || Broadway ||\n|-\n|1923 || R.U.R. || Domin || Broadway ||\n|-\n|1923 || A Love Scandal || Winthrop Field || Broadway ||\n|-\n|1924 || Monsieur Beaucaire || Beaucaire || Indianapolis, Ind. ||\n|-\n|1924 || You and I || Maitland White || Indianapolis, Ind. ||\n|-\n|1925 || Cape Smoke || Hugh Chadwell || Broadway ||\n|-\n|1925 || Hamlet || Horatio || Broadway || modern dress staging\n|-\n|1926 || ''Hangman's House || Citizen Hogan || Broadway ||\n|-\n|1927 || The Shanghai Gesture || Sir William Charteris || Chicago, national tour || 11 months in the role\n|-\n|1928 || Major Barbara || Bill Walker || Broadway ||\n|-\n|1929 || Camel Through the Needle's Eye || Servant || Broadway ||\n|-\n|1929 || Major Barbara || Bill Walker || national tour ||\n|-\n|1929 || Pygmalion || Col. Pickering || Detroit, regional tour ||\n|-\n|1930 || Elizabeth the Queen || Sir Walter Raleigh || Broadway, national tour || originated the role\n|-\n|1932 || The Dubarry || Comte Dubarry || Broadway || originated the role\n|-\n|1933 || For Services Rendered || Howard Bartlett || Broadway || originated the role\n|-\n|1933 || Aren't We All? || not known || Newport, R.I. ||\n|-\n|1933 || Ruy Blas || Don Salluste de Bazan || Broadway, Baltimore ||\n|-\n|1933 || Mary of Scotland || Lord Morton || Broadway ||\n|-\n|1934 || Picnic || Uncle Robert || Broadway ||\n|-\n|1934 || A Bill of Divorcement || not known || Newport, R.I. ||\n|-\n|1934 || Art and Mrs. Bottle || not known || Newport, R.I. ||\n|-\n|1935 || Living Dangerously || Henry Pryor || Broadway ||\n|-\n|1935 || Pride and Prejudice || Mr. Bennett || Broadway || originated the role; 8 months on Broadway\n|-\n|1936 || St Helena || Sir Hudson Lowe || Broadway ||\n|-\n|1936 || The Country Wife || Mr. Pinchwife || Broadway ||\n|-\n|1937 || Twelfth Night || Malvolio || Schenectady, N.Y. ||\n|-\n|1937 || A Bill of Divorcement || not known || Suffern, N.Y. ||\n|-\n|1937 || Pride and Prejudice || Mr. Bennett || Suffern, N.Y. ||\n|-\n|1938 || Ruy Blas || Don Salluste de Bazan || Central City, Colo. ||\n|-\n|1938 || The Merchant of Yonkers || Horace Vandergelder || Broadway || originated the role\n|-\n|1940 || Life With Father || \"Father\" Clarence Day Sr. || Chicago, national tour || record-breaking 66 weeks in Chicago; 57 weeks on tour\n|-\n|1944 || The Late George Apley || Roger Newcombe || Broadway, national tour || originated the role; 11 months on Broadway; 80 weeks on tour\n|-\n|1946 || Another Part of the Forest || Marcus Hubbard || Broadway || originated the role; 11 months on Broadway\n|-\n|1946 || Anne of the Thousand Days || Cardinal Wolsey || Broadway || originated the role; 7 months on Broadway\n|-\n|1952 || The Gambler || Station Master/God || Broadway ||\n|-\n|1954 || Reclining Figure || Lucas Edgerton || Broadway || originated the role\n|-\n|1955 || The Chalk Garden || The Judge || Broadway || originated the role; 7 months on Broadway\n|-\n|1957 || Monique'' || Insp. Desiré Merlin || Broadway || originated the role; final stage role\n|}\nReferences\n;Notes\n;Citations\nBibliography\n*\n*\n*\n*\n*\n*\n*|last=Mantle|first=Burns|title=Best Plays of 1935-36|location=New York|publisher=Dodd, Mead|date=1935|oclc=12631128}}\n*\n*\nExternal links\n*[https://www.imdb.com/name/nm0911278/?ref_=fn_al_nm_1  Percy Waram at IMDb.com]\n*[https://www.ibdb.com/broadway-cast-staff/percy-waram-64008 Percy Waram at IBDb.com]"
    }
  ]
}