{
  "content": [
    {
      "type": "text",
      "text": "# Peri-urban agriculture__disambig_1\n\n, Scotland. Much of this peri-urban land is in the process of conversion from agriculture to livery.]]\nPeri-urban regions can be defined as 'superficial' rural areas that are within the orbit of immediate urban hubs, in other words, areas that surround large population centers. These regions can also be referred to as 'exurban areas', 'the rural-urban fringe' or the 'fringe', they include the transition zones between the outer limits of the commuter belt and the edge of newly constructed suburban areas.\nPeri-urban agriculture is generally defined as agriculture undertaken in places on the fringes of urban areas. However, peri-urban agriculture can be described differently depending on the myriad of  urban-rural relationships, and the different farming systems within the various cities and contrasting regions around the world. For instance, the focus of peri-urban agriculture in developing countries is primarily concentrated on the relief of hunger and poverty, hence, food security, as for industrialized countries the emphasis is on ecological and social values. There is no universally agreed definition, and usage of the term generally depends on context and operational variables. The Food and Agriculture Organization of the United Nations defines peri-urban agriculture as \"agriculture practices within and around cities which compete for resources (land, water, energy, labour) that could also serve other purposes to satisfy the requirements of the urban population.\"\nThe term “peri-urban” used to describe agriculture, while difficult to define in terms of geography, population density, percentage of labor force in agriculture, or any other variable, often serves the purpose of indicating areas along the urban-rural continuum. These are places with dynamic landscape and social change and are often invoked in conversations about growth of cities.\nPeri-urban agriculture is first and foremost \"the production and distribution of food, fiber and fuel in and around cities\". Nevertheless the leading \"feature of urban and [peri-urban] agriculture which distinguishes it from rural agriculture is its integration into the urban economic and ecological system\"\nHistory\nThe concept of peri-urban has become prevalent as a result of limitations in the dichotomy between rural areas and urban areas. Historically, rural and urban land have been viewed as two separate economic systems with few interactions. Often, these arguments refer to the disappearance and urbanization of rural land. Peri-urban land falls along the continuum of urban to rural land and recognizes links between the two.\nImplementation\nUrban and peri-urban agriculture is expected to become increasingly important for food security and nutrition as rural land is built up. It is predicted to be particularly key for growing perishable produce accessible to the approximately 700 million urban residents already living in developing countries, especially because most growth is expected to take place in urban areas of developing countries.\nUrban and peri-urban agriculture tend to differ in their form and their purpose. \"Urban\" usually refers to small areas such as vacant plots, gardens, balconies, containers within cities for growing crops and raising small livestock or milk cows for own consumption or sale in neighbourhood markets. Peri-urban farming more often consists of units close to town which operate intensive semi- or fully commercial farms to grow vegetables and other horticulture, raise chickens and other livestock, and produce milk and eggs.\nPeri-urban livestock production is often based on small ruminants such as goats and sheep, which occupy less space than cows and bulls, are subjects of virtually no religious taboos, can provide both meat and milk, and generally reproduce at two to three years old.\nBenefits\nPeri-urban agriculture provides environmental benefits by preserving or creating urban open space in city edges where green space may be threatened by expanding urbanization. In addition to aesthetics, preservation and creation of green space has positive climatic effects including augmenting carbon sequestration, reducing the urban heat island effect, and providing a habitat for organisms. Peri-urban agriculture may also help recycle urban greywater and other products of wastewater, helping to conserve water and reduce waste.\nEcosystem services\nUrban and peri-urban agricultural systems can improve urban environments through provisioning, regulating, supporting and cultural ecosystem services. Ecosystem services are \"the benefits human populations derive from ecosystems\". Through the use of vacant lots and open spaces in urban and man-made environments, urban and peri-urban agriculture (UPA) contribute to the increase of ecosystem services in these otherwise low providing areas. Additionally, urban and peri-urban agriculture may prevent the extension of agriculture in rural areas, therefore, allowing the preservation and protection of threatened ecosystems and their ecosystem services. Also, the increase of food production capacity in urban and peri-urban areas allows the decrease of the conversions of non-agricultural land to farmland. Moreover, the level of degradation or revitalization of ecosystem services depends on whether an agricultural system is being managed in a sustainable way. For agricultural sustainability is not only about agricultural production but also about managing the landscapes surrounding the agricultural activities. Some of the ecosystem services provided by urban and peri-urban agriculture are inter alia, wildlife habitat, nutrient cycling, temperature regulation, carbon sequestration, water filtration and flood prevention, cultural information, and recreation.\nSupporting\nUrban and peri-urban agriculture zones are key drivers for sustainability and urban biodiversity. Biodiversity favors resilience by supporting and mitigating the negative impacts of the built environment by hosting a diversity of fauna and flora. Also, small urban and peri-urban managed systems have higher quality soil formation than agricultural soils, because of the regular inputs of organic matter, such as composts and manures.\nRegulating\nHigh levels of air pollution are present in urban centers which can have negative effects on human health, therefore urban and peri-urban agriculture can help mitigate greenhouse gas emissions (GHG) through carbon storage and  carbon sequestration. Furthermore, urban and peri-urban systems contribute to regulating temperatures in cities, in fact, evapotranspiration from urban and peri-urban agriculture can reduce the effects of urban heat islands.\nProvisioning\nThe production of local food contributes to food security and food safety, by shortening the supply chain and reducing transportation.\nCultural\nAlongside supporting and regulating ecosystem services, urban and peri-urban systems have a cultural and traditional value, some consider urban and peri-urban agriculture as a form of leisure, whereas other as a way of maintaining and perpetuating cultural and traditional agricultural practices.\nMultifunctionality\nPeri-urban agriculture is multifunctional. \"Multifunctional agriculture\" refers to  agriculture beyond its primary role of  producing food and fibre, but as also having other functions. The key elements of multifunctionality are commodity and non-commodity outputs. Commodity outputs are food and fiber, as well as marketable products such as tourism. Non-commodity outputs include, food security, food safety, environmental protection, biodiversity, and a rural way of life.\nAlso, the concept of multifunctionality is based on the idea of sustainable development, it aims  at  integrating the information over time and the geography of land uses and functions beyond its traditional function of food production, to include nature conservation, hydrological balance, aesthetics and recreation. According to OECD, \"beyond its primary function of supplying food and fiber, agricultural activity can also shape the landscape, provide environmental benefits such as land conservation, the sustainable management of renewable natural resources and the preservation of biodiversity, and contribute to the socio-economic viability of many rural areas\".\nSocial\nIn developing countries, besides the question of food security, one significant social dimension of peri-urban agriculture, specifically around production sites, is the rebuilding of communities and civil society.\nStudies have shown that urban gardening and farming, particularly when done in a community setting, have positive effects on nutrition, fitness, self-esteem, and happiness, providing a benefit for both physical and mental health.\nClosely related to health is food security, or dependable access to adequate and nutritious food. Urban gardening may be an opportunity for the urban poor to produce food for themselves or to sell their products for income, adding to income security. Localized agriculture can also improve resilience by ensuring that there will be a more certain food supply in times of shortage, instability, and uncertainty. Indeed, peri-urban agriculture can be advantageous because of the proximity of production to the consumer. Particularly, the fresh fruits, vegetables and local foods that are available for communities and neighborhoods that live in food deserts.\nIn addition, residents who share a plot of land may benefit from social interaction and recreation with others. Agriculture is often an effective strategy for poverty reduction and social integration of disadvantaged groups, with the aims of integrating them into the urban network, providing a decent livelihood, and preventing social problems such as drugs and crime.\nEnvironmental\nIn many urban areas peri-urban agriculture reduces the environmental impacts of urban expansion by serving as an ecological buffer.  Unlike traditional farmers, peri-urban professionals have greater conscious of the ecological value of the environment.\nMoreover, local production and consumption of foods reduces the consumption of energy due to shorter transportation distances, less packaging and processing, and greater efficiency in production inputs. Likewise, the recycling of urban waste into compost and waste water for irrigation conserves energy. Peri-urban systems, can also contribute to biodiversity conservation through the integration of native species, as well as modify positively urban micro-climates by regulating humidity, providing shade and regulating the wind.\nComparatively to conventional food systems, the limited use of energy in peri-urban agriculture reduces greenhouse gas emissions and has lower impacts on global warming.\nEconomic\nThe new business opportunities generated by peri-urban agriculture allow the creation of jobs and the generation of revenue, as well as improving local infrastructure and services, such as the construction of roads, schools, and restaurants. It also furthers agricultural training and education. Indeed, beyond providing productivity to vacant land, treated wastewater and recycled waste, urban and peri-urban agriculture is an important source of income for many urban poor. Farming households lower their food costs substantially and can generate income by selling excess produce, which is significant, as urban poor commonly spend 50-70% of their income on food.  In addition to farming jobs, peri-urban agriculture can spark a need for traders, input suppliers, processors, marketers, and others. Peri-urban agriculture gives women and other non-heads of household a low-barrier occupation through which to support their families, adding to household productivity and giving women an outlet to assert themselves.\nProducing food in areas nearby to cities shortens supply chains, which aids quality and cost. The proximity of peri-urban farms to urban areas incurs cost savings compared to those in rural areas, as farms are still able to take advantage of economies of scale, to an extent, and require less transportation infrastructure to bring food in from city outskirts. Perishable products are more easily preserved. Peri-urban farms are also able to flexibly respond and market themselves to urban consumer demands, since they are able to be closer and more specialized, and are tightly linked to the urban economy.\nChallenges\nChallenges for peri-urban agriculture, like its benefits, arise from its proximity to densely built urban areas. Competition for resources with other urban sectors, aspects of agriculture that may be unpleasant for city dwellers, and quality of inputs must all be monitored.\nWise resource allocation is a quintessential struggle for agriculture, and is especially greater for peri-urban agriculture than rural agriculture due to its proximity to greater numbers of people and to existing stresses on the urban environment. Peri-urban agriculture uses land, water, labor, and energy that might be used by other urban economic sectors.\nOutputs\nPeri-urban agriculture produces some aspects that may be unpleasant for urban residents, including smells, noises, pollution, and disease.\nManagement of animal waste can be challenging, since manure may contain chemicals and heavy metals unsuitable for use as fertilizer – and may even be hazardous.  Runoff from facilities leads to overnutriented soils and water, which can in turn cause eutrophication and algal blooms in nearby water supplies.\nPathogens are often spread from wastewater reused for irrigation, from live animals in close proximity to dense human populations, and the disposal or sale of manure. Crops are an opportunity to reuse urban waste productively, and wastewater as an irrigation source in particular has been explored by some cities to conserve water. If not treated properly before application, this wastewater can contaminate crops or surrounding vegetation with pathogens that make them unsafe for human consumption.  This is a food safety concern especially in markets with unlicensed vendors and missing enforcement of safety regulations, which are common venues for small urban and peri-urban farmers.\nAnimals raised in a peri-urban agriculture setting are by nature in close proximity to dense human populations and are often sold live or processed at food markets. Animal production is not allowed in some city centers – for example, in Beijing it is not allowed within the borders of a certain road that delineates the city center, but on the outskirts of cities it is growing as an industrial production system particularly as diets change to demand more meat. This has been a major factor in the avian influenza epidemics that have heavily affected Hong Kong, Nigeria, and Egypt. During outbreaks, people are advised to avoid open poultry markets.\nThe disposal of manure is a concern as well, since manure from industrial livestock systems may contain levels of chemicals such as nitrogen, phosphorus, and heavy metals which characterize it as a solid waste when used in excess. This is not only a concern in urban and peri-urban areas, but also faces rural farms as well.\nInsufficient or inferior inputs\nDue to its competition for resources and pressure to shift to industrial systems that will meet urban demand, inappropriate or excessive use of agricultural inputs including pesticides, nitrogen, phosphorus, and raw organic matter containing undesirable residues such as heavy metals, is a concern.\nThe nature of the environment nearby to urban areas can be hazardous to agricultural production. There are physical, chemical, and fungal threats in the form of roadway exhaust and debris, dense urban populations, water and soil pollution by organic pollutants, industrial chemicals, heavy metals, and antibiotics, and fungal and secondary metabolites.\nUncertainty of land ownership\nAnother major challenge to the viability of both urban and peri-urban agriculture is land availability due to changing land rights, uses, and values. High population densities lead to competition and conflicts over land and natural resources as land is converted from agricultural to residential and business uses, and as the intensity of agriculture practiced on scarce spaces available increases.  In addition, many urban and peri-urban farmers are urban poor and are frequently women, who tend to be economically vulnerable.\nSee also\n* Urban agriculture\nReferences"
    }
  ]
}