{
  "content": [
    {
      "type": "text",
      "text": "# Personal Independence Payment\n\nPersonal Independence Payment (abbreviated to PIP and usually pronounced as one word) is a welfare benefit in the United Kingdom intended to help working-aged people 16 and over with the extra costs of living with a health condition or a disability. It is available in England, Wales and Northern Ireland but not in Scotland, where Adult Disability Payment (ADP) is available instead.\nIt is non-means tested, non-contributory and tax-free; it is not linked to a person's ability to work and it is available equally to people in or out of work. It is not intended to be a substitute for a person's earnings, unlike Universal Credit, Employment and Support Allowance (ESA) or ESA's predecessor, Incapacity Benefit.\nEligibility for PIP is based upon the practical effects of a condition on a person's life, rather than the condition itself. It is not currently available to children who still claim Disability Living Allowance and are invited to claim PIP from their 16th birthday; it can be claimed by adults under the State Pension age, and people already on the benefit will continue to receive it after they retire.\nHistory\nPIP was introduced by the Welfare Reform Act 2012 and the Social Security (Personal Independence Payment) Regulations 2013 (which have been repeatedly amended). It began to replace Disability Living Allowance (DLA) for new claims from 8 April 2013, by means of an initial pilot in selected areas of north-west and north-east England. A full roll-out across Great Britain was planned for October 2013. However, this roll-out was delayed – primarily because the main contractor, Atos, wanted to ensure that the process was as reliable as possible; also, the assessments took much longer than expected, and assessors were hard to recruit - and as a result ministers announced that the roll-out would happen more gradually than originally planned.\nAlthough PIP was expected to cut costs by 20% over the longer term, costs were forecast to rise by £1billion to £15.4billion in 2015–16, partly due to a rise in mental health issues and learning disabilities.\nNew rules were introduced in 2017 and many charities raised concerns that disabled people would be left without support. The Disability Benefits Consortium (DBC) (comprising charities including Parkinson's UK, the MS Society and Mind) claimed about 160,000 people receiving PIP would be affected by proposed changes. Phil Reynolds of the consortium said, \"Across the DBC we have had our helpline and advice services inundated by calls about PIP since it was introduced. Instead of supporting disabled people, the benefits system seems increasingly rigged against them. The whole system needs urgent improvement, in order to accurately assess the support they need. Disabled people cannot afford to wait.\"  Charities that represent mental health and learning disability groups claim the changes do not recognise that the costs connected with those conditions are as severe as for other impairments. The changes were reversed in January 2018 following the decision not to appeal a high court ruling.\nClaiming PIP\nClaims will usually but not always be started over the phone. Most people claiming PIP are required to undergo assessments to prove their eligibility for the benefit.  Payments are varied according to the severity of disability as decided by the tests and relate to ability to carry out daily living activities and level of mobility. Claimants are also required to undergo periodic re-assessments to ensure ongoing eligibility for the benefit; depending on the type of disability, a person may be given a short award of up to two years or longer PIP award which would last for up to five or ten years.   The PIP Assessment Guide (updated on 1 May 2016) states: 'It would not be practical for the assessment to take account of the impact of a health condition or impairment on all everyday activities, nor to seek to include all possible areas where extra costs may be generated.'\nPIP is not available to children under 16 and PIP claimants must apply (if at all) before State Pension age. New PIP claims cannot be made after that age. DLA continues for children, and for existing recipients aged 64 or over on 8 April 2013; other people currently receiving DLA will be asked to claim PIP instead at some point.\nAssessment process\nResponsibility for the tests has been outsourced by DWP to two private companies, Independent Assessment Services (formerly known as Atos Healthcare) in the north of England, London and southern England, and Capita Business Services Ltd in central England, Wales and Northern Ireland. In 2018 37% of the 220,000 face-to-face assessments conducted by Capita were rated by DWP auditors as of an unacceptable standard, to need changes, or demonstrating that the assessor had failed to carry out the role properly. There was also concern at the delay in performing assessments.\nThe success rate for Mandatory reconsideration in relation to Personal Independence Payments is 15%, but 75% of appeals made to a tribunal were successful in 2018/19.\nEligibility\nTo qualify for PIP, applicants must be between 16 and State Pension age, living in England, Wales or Northern Ireland, and:\n* have had difficulties with daily living or getting around (or both) for at least 3 months\n* expect these difficulties to continue for at least 9 months (unless an applicant is terminally ill with less than 6 months to live)\nProposed changes to eligibility criteria\nOn 18 March 2025 , the UK Government published a green paper which set out plans to tighten the eligibility criteria for PIP.  Under the orginally proposed criteria prospective claimants from November 2026 would have to score at least 4 points for one daily living task to claim the daily living component of PIP. The mobility part of PIP is intended to remain unaffected. However 25 June 2025, following opposition to the initially proposed legislation from backbench Labour MPs, the government did a partial u-turn on its original plans, stating that the new eligibility parameters would only apply to new claimants once they come into force and that the current system would remain in place for pre-existing claimants of both PIP and the health element of Universal Credit. A second reading and House of Commons vote on the amended welfare legislation proposals took place on 1 July 2025. Although the bill was passed on its second reading this was only so after the government promised to delay any changes PIP criteria (which has been promised by ministers to be formally removed from the bill ahead of the bills third reading scheduled for 9 July 2025) and remain so until after a review conducted by work and pensions minister Stephen Timms which will be concluded sometime in Autumn 2026.\nDaily living component\nThere are two components of PIP: daily living and mobility needs. Each component can be paid at standard or enhanced rates.\nThe PIP daily living component is paid at one of two rates: standard or enhanced. Individuals may be entitled to the daily living component if they need help with daily living skills including preparing or eating food, dressing and undressing, or making decisions about money, assessed on a points system.\n{| class=\"wikitable\"\n|-\n! Daily living component\n! Weekly rate 2025-26\n|-\n| Standard rate\n| £73.90\n|-\n| Enhanced rate\n| £110.40\n|}\nEligibility\nTo qualify for the daily living part of PIP, applicants must need help more than half of the time with the following daily living skills:\n* preparing or eating food\n* washing, bathing and using the toilet\n* dressing and undressing\n* reading and communicating\n* managing medicines or treatments\n* making decisions about money\n* engaging with other people\nMobility component\nThe PIP mobility component is also paid at one of two rates: standard or enhanced. Individuals may be entitled to the mobility component if they need help going out or moving around.\n{| class=\"wikitable\"\n|-\n! Mobility component\n! Weekly rate 2025-26\n|-\n| Standard rate\n| £29.20\n|-\n| Enhanced rate\n| £77.05\n|}\nThe [https://www.motability.co.uk/about-the-scheme/personal-independence-payment/ Enhanced rate of the mobility component of PIP] can be exchanged for a vehicle or scooter on the [https://www.motability.co.uk Motability Scheme].\nOver 50,000 claimants lost their cars because they can walk 20 metres even if they cannot walk 50 metres.  Many claimants had the full benefit reinstated on appeal.\nIn December 2017 the High Court of Justice ruled that restrictions to the mobility component which stated that psychological distress could not be considered in deciding if a person could walk discriminated against people with mental health problems. In January 2018 Esther McVey announced that the government accepted this ruling.\nAward duration\nPIP is usually awarded for a fixed period, after which the claimant will have to re-apply if necessary. The exception is for the minority of claimants for whom PIP is awarded ongoing as their situation is not expected to improve.\n* Shorter term awards: Up to two years.\n* Longer term awards: Up to ten years.\nAll awards, including ongoing awards, are subject to review at any time.\nReaction and analysis\nIn April 2013 Iain Duncan Smith, the sponsor of the Welfare Reform Act, expressed his support for the changes to disability benefits brought about by the new law. He was critical of the older system of disability benefits which awarded an allowance to claimants with no further systematic checks to assess if the claimant's condition had improved or worsened. Iain Duncan Smith stated that, by requiring claimants to undergo periodic assessments, the system could be targeted at those most in need whilst preventing payments being made to people who had recovered from a temporary disability.\nThe UK disability rights organisation Scope has been critical of PIP and, while it expressed support in principle for assessing claimants more carefully, took the view that the assessment criteria were flawed, would cause undue hardship to disabled people and were too strongly focused on cutting welfare budgets.  In November 2021 it launched a campaign to give disabled people the right to request an assessor who is a specialist in their condition, after it was revealed that successful appeals were running at an average of more than 12,000 per month.\nPrior to the introduction of PIP, work capability assessments carried out by the private contractor Atos were subjected to critical scrutiny in Parliament following a number of controversial decisions in which disabled individuals were denied benefits and required to look for work, work they could not do due to their disability.\nIn June 2014 the Public Accounts Committee expressed the view that the implementation of the PIP scheme had been \"nothing short of a fiasco\", a charge rejected by the Government.\nPIP may affect entitlement to disability \"blue badge\" parking permits and the Motability scheme.\nThe Multiple Sclerosis Society of Great Britain produced a report about its members experiences of the test in September 2015.  1,780 participated. 42% of those who had a face-to-face assessment said the hidden symptoms of the condition had not been taken into account. More than a third said face-to-face assessments had caused their condition to relapse or deteriorate.\nCampaigners have expressed concern for patients with progressive, incurable conditions such as rheumatoid arthritis, Parkinson's disease, multiple sclerosis, and motor neurone disease are made to attend reassessments though it is unlikely they will get better and they will probably only get worse.  In 2017 Member of Parliament Carol Monaghan said she would challenge four cases of patients with multiple sclerosis being called for reassessment despite their illness worsening. \"MS is a progressive condition. They're never going to be any better than they are at the moment, so they should never be asked to go for a reassessment.  Some of these people are still able to walk to a certain extent, so they get themselves in, just about, and then they're being told, 'You look fine,'\" she said.  Phil Reynolds of Parkinson's UK said about a quarter of British people with Parkinson's lost some or all their benefit after reassessments, but got payments reinstated after appeal. \"It's absolutely crucial that the DWP looks again at the broken PIP assessment to ensure people with long-term conditions get the support they so desperately need, rather than rigging the system against them,\" he said.  Almost half multiple sclerosis patients claiming PIP must be reassessed inside two years, the MS Society claims. \"We're concerned about the number of people with MS being inappropriately reassessed, especially when we know assessments can cause stress and anxiety, and in some cases exacerbate MS symptoms.  With more than 100,000 people living with MS in the UK, the PIP system needs to accurately reflect the realities of living with a fluctuating and progressive condition. Having a disability like MS is hard enough. People should be able to rely on support without fear of having it taken away,\" said Laura Wetherly of the MS Society.\nTransition from Disability Living Allowance\nAdult recipients of Disability Living Allowance will continue to receive it until the Department for Work and Pensions invites them to apply for PIP. DLA continues for children. In Scotland, new benefits called the Child Disability Payment and Adult Disability Payment have been launched. It will gradually be the main benefit for disabled people with a different criteria than PIP.\nInformation for support organisations\nA toolkit of information for support organisations is available from the Department for Work and Pensions. It contains copies for forms and leaflets, factsheets and guides.\nReferences\nExternal links\n*\n*\n*\n*\n*\n*\n*\n*"
    }
  ]
}