{
  "content": [
    {
      "type": "text",
      "text": "# Personal aide to the president of the United States__disambig_1\n\n, left, Barack Obama's body man from 2009 to 2011, is seen here in a presidential motorcade outside Strasbourg for the 2009 NATO summit]]\nA personal assistant who accompanies the president of the United States virtually everywhere is generally referred to as a body man or body woman, but in some cases may be referred to as a personal aide. These personal aides to the president are often responsible for arranging and providing: lodging; transportation; interactions with media, public, and family; meals; personal briefings and briefing papers; logistical instructions; speech cards; snacks; cell phones; and any other necessary assistance. Such personal aides exist for many politicians aside from presidents, but the most famous have included personal aides to the president, as described below.\nHistory\nUpon taking office in 1969, Richard Nixon expanded and professionalized the White House Office staff. A new position was created, Personal Aide to the President. Previously this role had largely been filled by a White House valet. This role remained, but unlike the valet, the Personal Aide to the President travels wherever the president goes whereas the valet always remains stationed at the White House.\nList\nPresident Richard Nixon\n* Stephen Bull\nPresident Gerald Ford\n* Terrence O’Donnell\n* Gregory Willard\nPresident Jimmy Carter\n* Timothy Kraft\n* Phil Wise\nPresident Ronald Reagan\n* David Fischer\n* Jim Kuhn\nPresident George H. W. Bush\n* Timothy McBride\n* Michal Dannenhauer\n* David Bates\n* Tom Frechette\nPresident Bill Clinton\n* Douglas Band\n* Kris Engskov\nPresident George W. Bush\n*Logan Walters\n*Blake Gottesman\n* Jared Weinstein\n* Freddy Ford\n* Sam Sutton\n* Fidel Medina\nPresident Barack Obama\n* Reggie Love\n* Marvin Nicholson\nPresident Donald Trump\n* John McEntee (2017–2018)\n* Jordan Karem (2018–2019)\n* Nick Luna (2019–2021)\n* Christopher Ambrosini (2025–present)\nPresident Joe Biden\n* Stephen Goepfert (2021–2022)\n* Jacob Spreyer (2022–2025)\nIn popular culture\nThis role has been portrayed in fiction:\n* Dulé Hill as Charlie Young, in The West Wing\n* Tony Hale as Gary Walsh, in Veep\nSee also\n* Aide-de-camp, a military assistant to a senior official\n* White House social aide\n* White House Military Office\n* Road manager, performing similar duties for an entertainer or celebrity\nReferences"
    }
  ]
}