{
  "content": [
    {
      "type": "text",
      "text": "# Persecution of pagans in the late Roman Empire\n\n, 1st century AD copy of an original by Praxiteles. The Christian cross on the chin and forehead was intended to \"deconsecrate\" a holy pagan artifact. Found in the Agora of Athens. National Archaeological Museum in Athens.]]\nPersecution of pagans in the late Roman Empire began during the reign of Constantine the Great (306–337) in the military colony of Aelia Capitolina (Jerusalem), when he destroyed a pagan temple for the purpose of constructing a Christian church. Rome had periodically confiscated church properties, and Constantine was vigorous in reclaiming them whenever these issues were brought to his attention. Christian historians alleged that Hadrian (2nd century) had constructed a temple to Venus on the site of the crucifixion of Jesus on Golgotha hill in order to suppress Christian veneration there. Constantine used that to justify the temple's destruction, saying he was simply reclaiming the property. Using the vocabulary of reclamation, Constantine acquired several more sites of Christian significance in the Holy Land.\nFrom 313, with the exception of the brief reign of Julian, non-Christians were subject to a variety of hostile and discriminatory imperial laws aimed at suppressing sacrifice and magic and closing any temples that continued their use. The majority of these laws were local, though some were thought to be valid across the whole empire, with some threatening the death penalty, but not resulting in action. None seem to have been effectively applied empire-wide. For example, in 341, Constantine's son Constantius II enacted legislation forbidding pagan sacrifices in Roman Italy. In 356, he issued two more laws forbidding sacrifice and the worship of images, making them capital crimes, as well as ordering the closing of all temples. There is no evidence of the death penalty being carried out for illegal sacrifices before Tiberius Constantine (578–582), and most temples remained open into the reign of Justinian I (527–565). Pagan teachers (who included philosophers) were banned and their license, parrhesia, to instruct others was withdrawn. Parrhesia had been used for a thousand years to denote \"freedom of speech.\" Despite official threats, sporadic mob violence, and confiscations of temple treasures, paganism remained widespread into the early fifth century, continuing in parts of the empire into the seventh century, and into the ninth century in Greece. During the reigns of Gratian, Valentinian II and Theodosius I anti-pagan policies and their penalties increased.\nBy the end of the period of Antiquity and the institution of the Law Codes of Justinian, there was a shift from the generalized legislation which characterized the Theodosian Code to actions which targeted individual centers of paganism. The gradual transition towards more localized action corresponds with the period when most conversions of temples to churches were undertaken: the late 5th and 6th centuries. Chuvin says that, through the severe legislation of the early Byzantine Empire, the freedom of conscience that had been the major benchmark set by the Edict of Milan was finally abolished.\nNon-Christians were a small minority by the time of the last western anti-pagan laws in the early 600s. Scholars fall into two categories on how and why this dramatic change took place: the long established traditional catastrophists who view the rapid demise of paganism as occurring in the late fourth and early fifth centuries due to harsh Christian legislation and violence, and contemporary scholars who view the process as a long decline that began in the second century, before the emperors were themselves Christian, and which continued into the seventh century. This latter view contends that there was less conflict between pagans and Christians than was previously supposed. In the twenty-first century, the idea that Christianity became dominant through conflict with paganism has become marginalized, while a grassroots theory has developed.\nIn 529 AD, the Byzantine emperor Justinian ordered the closing of the Academy at Athens. The last teachers of the Academy, Damascius and Simplicius were invited by a Persian ruler Khosrow I to Harran (now in Turkey), which became a center of learning. Paganism survived in Harran until the 10th century thanks to its practitioners bribing local officials. In 933, however, they were ordered to convert. A visitor to the city in the following year found that there were still pagan religious leaders operating a remaining public temple.\nTolerance or intolerance\nRoman religion's characteristic openness has led many, such as Ramsay MacMullen to say that in its process of expansion, the Roman Empire was \"completely tolerant, in heaven as on earth\". Peter Garnsey strongly disagrees with those who describe the attitude concerning the \"plethora of cults\" in the Roman empire before Constantine as \"tolerant\" or \"inclusive\".  In his view, it is a misuse of terminology. Garnsey has written that foreign gods were not tolerated in the modern sense, but were made subject, together with their communities, when they were conquered.\nRoman historian Eric Orlin says that Roman religion's willingness to adopt foreign gods and practices into its pantheon is probably its defining trait. Yet he goes on to say this did not apply equally to all gods: \"Many divinities were brought to Rome and installed as part of the Roman state religion, but a great many more were not\". thereby demonstrating compatibility with Roman identity.}}\nAndreas Bendlin has written on the thesis of polytheistic tolerance and monotheistic intolerance in Antiquity saying that it has long been proven to be incorrect. According to Rodney Stark, since Christians most likely formed only sixteen to seventeen percent of the empire's population at the time of Constantine's conversion, they did not have the numerical advantage to form a sufficient power–base to begin a systematic persecution of pagans.\nBrown reminds his readers, \"We should not underestimate the fierce mood of the Christians of the fourth century\", and, he says, it must be remembered that repression, persecution and martyrdom do not generally breed tolerance of those same persecutors. Brown says Roman authorities had shown no hesitation in \"taking out\" the Christian church which they saw as a threat to the peace of the empire, and that Constantine and his successors did what they did for the same reasons. Rome had been removing anything it saw as a challenge to Roman identity since Bacchic associations were dissolved in 186 BCE; this had become the pattern for the Roman state's response to anything it saw as a religious threat. According to Brown, that attitude and belief in what was required to maintain the peace of the empire didn't change just because the emperors were Christian.\nConstantine I (306–337)\n]]\nAccording to Hans-Ulrich Wiemer, German historian of Antiquity, there is a persistent pagan tradition that Constantine did not persecute pagans. However, by twenty-first century definitions, Constantine can be said to have practiced a mild psychological and economic persecution of pagans. There are also indications he remained relatively tolerant of non-Christians throughout his long reign.\nNine years after Diocletian celebrated twenty years of stable rule with sacrifices on a smoking altar in the Roman Forum and the most severe persecution of Christians in the empire's history, the victorious Constantine I entered Rome and, without offering sacrifice, bypassed the altar. He proceeded to end the exclusion and persecution of Christians, restored confiscated property to the churches, and adopted a policy toward non-Christians of toleration with limits. The Edict of Milan (313) redefined Imperial ideology as one of mutual toleration. Constantine could be seen to embody both Christian and Greco-Roman religious interests.\nConstantine openly supported Christianity after 324; he destroyed a few temples and plundered more, converted others to churches, and neglected  the rest; he \"confiscated temple funds to help finance his own building projects\", and he confiscated funds in an effort to establish a stable currency; he was primarily interested in hoards of gold and silver, but he also, on occasion, confiscated temple land; he refused to support pagan beliefs and practices while also speaking out against them; he periodically forbade pagan sacrifices and closed temples, outlawed the gladiatorial shows while still attending them, made laws that threatened and menaced pagans who continued to sacrifice, while also making other laws that markedly favored Christianity; and he personally endowed Christians with gifts of money, land and government positions. Yet, Constantine did not stop the established state support of the traditional religious institutions, nor did society substantially change its pagan nature under his rule.\nConstantine never engaged in a purge. Opponents' supporters were not slaughtered when Constantine took the capital; their families and court were not killed. There were no pagan martyrs. Laws menaced death, but during Constantine's reign, no one suffered the death penalty for violating anti-pagan laws against sacrifice. \"He did not punish pagans for being pagans, or Jews for being Jews, and did not adopt a policy of forced conversion.\" Pagans remained in important positions at his court.\nConstantine ruled for 31 years and never outlawed paganism; in the words of an early edict, he decreed that polytheists could \"celebrate the rites of an outmoded illusion,\" so long as they did not force Christians to join them.  His earlier edict, the Edict of Milan, was restated in the Edict of the Provincials. Historian Harold A. Drake points out that this edict called for peace and tolerance: \"Let no one disturb another, let each man hold fast to that which his soul wishes…\" Constantine never reversed this edict.\nDrake goes on to say the evidence indicates Constantine favored those who favored consensus, chose pragmatists over ideologues of any persuasion, and wanted peace and harmony \"but also inclusiveness and flexibility\". In his article Constantine and Consensus, Drake concludes that Constantine's religious policy was aimed at including the church in a broader policy of civic unity, even though his personal views undoubtedly favored one religion over the other. Leithart says Constantine attributed his military success to God, and during his reign, the empire was relatively peaceful.\nConversion and baptism\nLenski says there can be no real doubt Constantine genuinely converted to Christianity.  In his personal views, Constantine denounced paganism as idolatry and superstition in that same document to the provincials where he espoused tolerance. Constantine and his contemporary Christians did not treat paganism as a living religion; it was defined as a superstitio – an 'outmoded illusion.' Constantine made many derogatory and contemptuous comments relating to the old religion; writing of the \"true obstinacy\" of the pagans, of their \"misguided rites and ceremonial\", and of their \"temples of lying\" contrasted with \"the splendours of the home of truth\". In a later letter to the King of Persia, Constantine wrote how he shunned the \"abominable blood and hateful odors\" of pagan sacrifices, and instead worshiped the High God \"on bended knee\".\nChurch historians writing after his death wrote that Constantine converted to Christianity and was baptised on his deathbed, thereby making him the first Christian emperor. Lenski observes that the myth of Constantine being baptized by Pope Sylvester developed toward the end of the fifth century in a romantic depiction of Sylvester's life which has survived as the Actus beati Sylvestri papae (CPL 2235). This story absolved the medieval church of a major embarrassment: Constantine's baptism by a bishop with Arian sympathies, Eusebius of Nicomedia, which occurred while on campaign to Persia. Constantine swung through the Holy Land with the intent of being baptized in the Jordan river, but he became deathly ill at Nicomedia where he was swiftly baptized. He died shortly thereafter on May 22, 337 at a suburban villa named Achyron.\nBan on sacrifices\nScott Bradbury, professor of classical languages, writes that Constantine's policies toward pagans are \"ambiguous and elusive\" and that \"no aspect has been more controversial than the claim he banned blood sacrifices\".  Bradbury says the sources on this are contradictory, quoting Eusebius who says he did, and Libanius, a historian contemporary to Constantine, who says he did not, that it was Constantius II who did so instead. According to historian R. Malcolm Errington, in Book 2 of Eusebius' De vita Constantini, chapter 44, Eusebius explicitly states that Constantine wrote a new law \"appointing mainly Christian governors and also a law forbidding any remaining pagan officials from sacrificing in their official capacity\".\nOther significant evidence fails to support Eusebius' claim of an end to sacrifice. Constantine, in his Letter to the Eastern Provincials, never mentions any law against sacrifices. Archaeologist Luke Lavan writes that blood sacrifice was already declining in popularity by the time of Constantine, just as construction of new temples was also declining, but that this seems to have little to do with anti-paganism. Drake has written that Constantine personally abhorred sacrifice and removed the obligation to participate in them from the list of duties for imperial officials, but evidence of an actual sweeping ban on sacrifice is slight, while evidence of its continued practice is great.\nAll records of anti-pagan legislation by Constantine are found in the Life of Constantine, written by Eusebius as a kind of eulogy after Constantine's death. It is not a history so much as a panegyric praising Constantine. The laws as they are stated in the Life of Constantine often do not correspond, \"closely, or at all\", to the text of the Codes themselves. Eusebius gives these laws a \"strongly Christian interpretation by selective quotation or other means\". This has led many to question the veracity of his record.\nWhile most scholars agree it is likely Constantine did institute the first laws against sacrifice, leading to its end by the 350's, paganism itself did not end when public sacrifice did. Brown explains that polytheists were accustomed to offering prayers to the gods in many ways and places that did not include sacrifice, that pollution was only associated with sacrifice, and that the ban on sacrifice had fixed boundaries and limits. Paganism thus remained widespread into the early fifth century continuing in parts of the empire into the seventh and beyond.\nMagic and private divination\nMaijastina Kahlos, scholar of Roman literature, says religion before Christianity was a decidedly public practice. Therefore, private divination, astrology, and 'Chaldean practices' (formulae, incantations, and imprecations designed to repulse demons and protect the invoker) all became associated with magic in the early imperial period (AD 1–30), and carried the threat of banishment and execution even under the pagan emperors. Lavan explains these same private and secret religious rituals were not just associated with magic but also with treason and secret plots against the emperor. Kahlos says Christian emperors inherited this fear of private divination.\nThe church had long spoken against anything connected to magic and its uses. Polymnia Athanassiadi says that, by the mid fourth century, prophecy at the Oracles of Delphi and Didyma had been definitively stamped out.   However, Athanassiadi says the church's real targets in Antiquity were home-made oracles for the practice of theurgy: the interpretation of dreams with the intent of influencing human affairs. The church had no prohibitions against the interpretation of dreams by itself, yet, according to Athanassiadi, both Church and State viewed using it to influence events as \"the most pernicious aspect of the pagan spirit\".\nConstantine's decree against private divination did not classify divination in general as magic, therefore, even though all the emperors, Christian and pagan, forbade all secret rituals, Constantine still allowed the haruspices to practice their rituals in public.\nConstantinople and temple looting\nof Sol Invictus]]\nOn 8 November 324, Constantine consecrated Byzantium as his new residence, Constantinoupolis – \"city of Constantine\" – with the local pagan priests, astrologers, and augurs, though he still went back to Rome to celebrate his Vicennalia: his twenty-year jubilee.  Two years after the consecration of Constantinople, Constantine left Rome behind, and on 4 November 328, new rituals were performed to dedicate the city as the new capital of the Roman empire. Among the attendants were the Neoplatonist philosopher Sopater and pontifex maximus Praetextus.\nA year and a half later, on 11 May 330, at the festival of Saint Mocius, the dedication was celebrated and commemorated with special coins with Sol Invictus on them. In commemoration, Constantine had a statue of the goddess of fortune Tyche built, as well as a column made of porphyry, at the top of which was a golden statue of Apollo with the face of Constantine looking toward the sun.\nLibanius the historian (Constantine's contemporary) writes in a passage from his In Defense of the Temples  that Constantine 'looted the Temples' around the eastern empire in order to get their treasures to build Constantinople.   says that Constantinople was \"literally crammed with [pagan] statuary gathered, in Jerome's words, by 'the virtual denuding' of every city in the East\". Historian Ramsay MacMullen explains this by saying Constantine \"wanted to obliterate non-Christians, but lacking the means, he had to be content with robbing their temples\". Constantine did not obliterate what he took, though. He reused it. Litehart says \"Constantinople was newly founded, but it deliberately evoked the Roman past religiously as well as politically\".\nConstantinople continued to offer room to pagan religions: there were shrines for the Dioscuri and Tyche. According to historian , there is good reason to believe the ancestral temples of Helios, Artemis and Aphrodite remained functioning in Constantinople.  The Acropolis, with its ancient pagan temples, was left as it was.\nDesacralization and destruction of temples\n, ca 400: it was defaced and thrown in a well at Abbey of Montier-en-Der.]]\nUsing the same vocabulary of restoration he had used for Aelia Capitolina, Constantine acquired sites of Christian significance in the Holy Land for the purpose of constructing churches, destroying the temples in those places. For example, Constantine destroyed the Temple of Aphrodite in Lebanon.\nHowever, archaeology indicates this type of destruction did not happen as often as the literature claims. For example, at the sacred oak and spring at Mamre, a site venerated and occupied by Christians, Jews and pagans alike, the literature says Constantine ordered the burning of the idols, the destruction of the altar, and erection of a church. The archaeology of the site, however, demonstrates that Constantine's church along with its attendant buildings, only occupied a peripheral sector of the precinct, leaving the rest unhindered.\nTemple destruction is attested to in 43 cases in the written sources, but only four have been  confirmed by archaeological evidence.\nArchaeologists Lavan and Mulryan write that earthquakes, civil conflict, and external invasions caused much of the temple destruction of this era.\nThe Roman economy of the third and fourth centuries struggled, and traditional polytheism was expensive. Roger S. Bagnall reports that imperial financial support declined markedly after Augustus. Lower budgets meant the physical decline of urban structures of all types. This progressive decay was accompanied by an increased trade in salvaged building materials, as the practice of recycling became common in Late Antiquity.\nChurch restrictions opposing the pillaging of pagan temples by Christians were in place even while the Christians were being persecuted by the pagans.  More common than destruction was the practice of \"desacralization\" or \"deconsecration\". According to the historical writings of Prudentius, the deconsecration of a temple merely required the removal of the cult statue and altar, and it could be reused. The Law Codes from around the same time as Prudentius say that temples “empty of illicit things” were to suffer no further damage and idols were only “illicit” if they were still venerated. However, this was often extended to the removal or even destruction of other statues and icons, votive stelae, and all other internal imagery and decoration.\nMutilating the hands and feet of statues of the divine, mutilating heads and genitals, tearing down altars and \"purging sacred precincts with fire\" were seen as 'proving' the impotence of the gods, but pagan icons were also seen as having been “polluted” by the practice of sacrifice. A ritual and chiseling crosses onto them cleansed them. Once these objects were detached from \"the contagion\" of sacrifice, they were seen as having returned to innocence. Many statues and temples were then preserved as art. For example, the Parthenon frieze was preserved after the Christian conversion of the temple, although in modified form.\nAccording to historian Gilbert Dagron, there were fewer temples constructed empire-wide, for mostly financial reasons, after the building craze of the 2nd century ended. However, Constantine's reign did not comprise the end of temple construction.  In addition to destroying temples, he both permitted and commissioned temple construction.  The dedication of new temples is attested in the historical and archaeological records until the end of the 4th century.\nUnder Constantine, (and for the first decade or so of the reigns of his sons), most of the temples remained open for the official pagan ceremonies and for the more socially acceptable activities of libation and offering of incense. Despite the polemic of Eusebius claiming Constantine razed all the temples, Constantine's principal contribution to the downfall of the temples lay quite simply in his neglect of them.\nConstantius II (337–361)\nConstantine's policies were largely continued by his sons though not universally or continuously.\nAccording to the Catholic Encyclopedia, Constantius issued bans on sacrifice which were in keeping with his personal maxim: \"Cesset superstitio; sacrificiorum aboleatur insania\" (Let superstition cease; let the folly of sacrifices be abolished).  He removed the Altar of Victory from the Senate meeting house. This altar had been installed by Augustus in 29 BC, and since its installation, each Senator had traditionally made a sacrifice upon the altar before entering the Senate house. When Constantius removed the altar he also allowed the statue of Victory to remain, therefore Thompson concludes that the removal of the altar was to avoid having to personally sacrifice when he was visiting Rome. In Thompson's view, this makes the altar's removal an act to accommodate his personal religion without offending the pagan senators by refusing to observe their rites. Soon after the departure of Constantius, the altar was restored.\nConstantius also shut down temples, ended tax relief and subsidies for pagans, and imposed the death penalty on those who consulted soothsayers. Orientalist Alexander Vasiliev says that Constantius carried out a persistent anti-pagan policy, and that sacrifices were prohibited in all localities and cities of the empire on penalty of death and confiscation of property.\nThere is no evidence that the harsh penalties of the anti-sacrifice laws were ever enforced. Edward Gibbon's editor J. B. Bury dismisses Constantius’ law against sacrifice as one which could only be observed \"here and there\", asserting that it could never, realistically, have been enforced within a society that still contained the strong pagan element of Late Antiquity, particularly within the imperial machinery itself. Christians were a minority and paganism was still popular among the population, as well as the elites at the time. The emperor's policies were therefore passively resisted by many governors, magistrates, and even bishops, rendering the anti-pagan laws largely impotent when it came to their application.\nRelative moderation\nAccording to Salzman, Constantius' actions toward paganism were relatively moderate, and this is reflected by the fact that it was not until over 20 years after Constantius' death, during the reign of Gratian, that any pagan senators protested their religion's treatment. The emperor Constantius never attempted to disband the various Roman priestly colleges or the Vestal Virgins and never acted against the various pagan schools. He remained pontifex maximus until his death.\nThe temples outside the city remained protected by law. At times, Constantius acted to protect paganism itself. According to author and editor Diana Bowder, the historian Ammianus Marcellinus records in his history Res Gestae, that pagan sacrifices and worship continued taking place openly in Alexandria and Rome. The Roman Calendar of the year 354 cites many pagan festivals as though they were still being openly observed.\nLegislation against magic and divination\nIn 357, Constantius II linked divination and magic in a piece of legislation forbidding anyone from consulting a diviner, astrologer, or a soothsayer; then he listed augurs and seers, Chaldeans, magicians and 'all the rest' who were to be made to be silent because the people called them malefactors. In the fourth century, Augustine labeled old Roman religion and its divinatory practices as magic and therefore illegal.  Thereafter, legislation tended to automatically combine the two.\nTemples\nThere is a law in the Theodosian Code that dates to the time of Constantius for the preservation of the temples situated outside of city walls.  Constantius also enacted a law that exacted a fine from those who were guilty of vandalizing sites holy to pagans and placed the care of these monuments and tombs under the pagan priests.  Successive emperors in the 4th century made legislative attempts to curb violence against pagan shrines, and in a general law issued in 458 by the Eastern emperor Leo and the western emperor Majorian, (457 to 461), the temples and other public works gained protection with strict penalties attached.\nMob violence\nMob violence was an occasional problem in the independent cities of the empire. Taxes, food and politics were common reasons for rioting. Religion was also a factor though it is difficult to separate from politics since they were intertwined in all aspects of life. In 361, the murder of the Arian bishop George of Cappadocia was committed by a mob of pagans, A Christian mob threw objects at Orestes and, finally, Hypatia was killed by a Christian mob though politics and personal jealousy were probably the primary causes. Mobs were composed of lower-class urban dwellers, upper class educated pagans, Jews and Christians, and in Alexandria, monks from the monastery of Nitria.\nRestoration of paganism by Julian (361–363)\nJulian, who had been a co-emperor since 355, ruled solely for 18 months from 361 to 363. He was a nephew of Constantine and received Christian training. After childhood, Julian was educated by Hellenists and became attracted to the teachings of neoplatonists and the old religions. He blamed Constantius for the assassination of Julian's father, brother and other family members, which he personally witnessed being killed by the palace guards. As a result, he developed an antipathy to Christianity which only deepened when Constantius executed Julian's only remaining brother in 354. Julian's religious beliefs were syncretic and he was initiated into at least three mystery religions, but his religious open-mindedness did not extend to Christianity.\nJulian lifted the ban on sacrifices, restored and reopened temples, and dismantled the privileged status of the Christians, giving generous tax remissions to the cities he favored and disfavor to those who remained Christian. He allowed religious freedom and spoke against overt compulsion, but there was little other option open to him. By the time Julian came to rule, the empire had been ruled by Christian emperors for two generations and the people had adapted.\nBradbury writes that Julian was not averse to a more subtle form of compulsion, and in 362, Julian promulgated a law that, in effect, forbid Christians from being teachers. Julian wrote that \"right learning\" was essential to pagan reform, and that such learning belonged only to those who showed 'piety toward the old gods'. In a letter written by Julian that still exists, he says: \"Let [the Christians] keep to Matthew and Luke\". Christians saw this as a threat that barred them from a professional career many of them already held.\nOn his trip through Asia Minor to Antioch to assemble an army and resume war against Persia, he found the cities falling short of pagan revival. His reforms were met by Christian resistance and civic inertia. Provincial priests were replaced with Julian's sympathetic associates, but after passing through Galatia and seeing the strength of the church and its charitable institutions, he wrote to the high priest of the province that all the new priests were to \"follow a thoroughgoing programme of personal moral example and public institutions to outdo the Christians at their own game... for it is disgraceful that none of the Jews is a beggar and the impious Galilaeans provide support for our people as well as theirs\".\nJulian reached Antioch on July 18 which coincided with a pagan festival that had already become secular. Julian's preference for blood sacrifice found little support, and the citizens of Antioch accused Julian of \"turning the world upside down\" by reinstituting it, calling him \"slaughterer\". Altars used for sacrifice had been routinely smashed by Christians who were deeply offended by the blood of slaughtered victims as they were reminded of their own past sufferings associated with such altars. \"When Julian restored altars in Antioch, the Christian populace promptly threw them down again\".\nBlood sacrifice was a central rite of virtually all religious groups in the pre-Christian Mediterranean, and its gradual disappearance is one of the most significant religious developments of late antiquity. Sacrifice did not decline according to any uniform pattern, but...In many of the larger towns and cities of the Eastern empire, public blood sacrifices were no longer normative by the time Julian came to power and embarked on his pagan revival. Public sacrifices and communal feasting had declined as the result of a decline in the prestige of pagan priesthoods and a shift in patterns of [private donations] in civic life. That shift would have occurred on a lesser scale even without the conversion of Constantine... It is easy, nonetheless, to imagine a situation in which sacrifice could decline without disappearing. Why not retain, for example, a single animal victim in order to preserve the integrity of the ancient rite? The fact that public sacrifices appear to have disappeared completely in many towns and cities must be attributed to the atmosphere created by imperial and episcopal hostility. Julian became frustrated that no one seemed to match his zeal for pagan revival. His reform soon moved from toleration to imperial punishment. Historians such as David Wood assert there was a revival of some persecution against Christians. On the other hand, H. A. Drake says that \"In the eighteen brief months that he ruled between 361 and 363, Julian did not persecute [Christians], as a hostile tradition contends. But he did make clear that the partnership between Rome and Christian bishops... was now at an end, replaced by a government that defined its interests and those of Christianity as antithetical. Scholars agree that Julian tried to undermine the church by ordering the construction of churches for Christian “heretical” sects and by destroying orthodox churches.\nAfter Antioch, Julian would not be deterred from his goal of war with Persia, and he died on that campaign. The facts of his death have become obscured by the \"war of words between Christians and pagans\" which followed. It was \"principally over the source of the fatal spear... The thought that Julian might have died by the hand of one of his own side... was a godsend to a Christian tradition eager to have the apostate emperor accorded his just deserts. Yet such a rumor was not solely the product of religious polemic. It had its roots in the broader trail of disaffection Julian left in his wake\".\nFrom Jovian to Valens (363–378)\nJovian reigned only eight months, from June 363 to February 364, but in that period, he negotiated peace with the Sassanids and reestablished Christianity as the preferred religion.\nBayliss says the position adopted by the Nicene Christian emperor Valentinian I (321–375) and the Arian Christian emperor Valens (364–378), granting all cults toleration from the start of their reign, was in tune with a society of mixed beliefs. Pagan writers, for example Ammianus Marcellinus, describe the reign of Valentinian as one “distinguished for religious tolerance... He took a neutral position between opposing faiths, and never troubled anyone by ordering him to adopt this or that mode of worship ... [he] left the various cults undisturbed as he found them”.\nThis apparently sympathetic stance is corroborated by the absence of any anti-pagan legislation in the Theodosian Law Codes from this era. Classics scholar Christopher P. Jones says Valentinian permitted divination so long as it was not done at night, which he saw as the next step to practicing magic.\nValens, who ruled the east, also tolerated paganism, even keeping some of Julian's associates in their trusted positions. He confirmed the rights and privileges of the pagan priests and confirmed the right of pagans to be the exclusive caretakers of their temples.\nAmbrose, Gratian, and the Altar of Victory\nwas one of the most influential advocates of paganism's destruction]]\nAmbrose and Gratian\nIn 382, Gratian was the first to formally, in law, divert into the crown's coffers those public financial subsidies that had previously supported Rome's cults; he appropriated the income of pagan priests and the Vestal Virgins, forbade their right to inherit land, confiscated the possessions of the priestly colleges, and was the first to refuse the title of pontifex maximus. He also ordered the Altar of Victory to be removed again. The colleges of pagan priests lost privileges and immunities.\nGratian wrote to Ambrose, the Bishop of Milan, for spiritual advice and received back multiple letters and books. It has long been convention to see the volume of these writings as evidence Gratian was dominated by Ambrose, who was therefore the true source of Gratian's anti-pagan actions. McLynn finds this unlikely and unnecessary as an explanation: Gratian was, himself, devout, and \"The many differences between Gratian's religious policies and his father's, and the shifts that occurred during his own reign, are to be explained by changed political circumstances [after the Battle of Adrianople], rather than capitulation to Ambrose\".\nModern scholars have noted that Sozomen is the only ancient source that shows Ambrose and Gratian together in any personal interaction. That event occurred in the last year of Gratian's reign. Ambrose crashed Gratian's private hunting party in order to appeal on behalf of a pagan senator sentenced to die. After years of acquaintance, this indicates Ambrose could not take for granted that Gratian would see him, so instead, Ambrose had to resort to such maneuverings to make his appeal.\nAfter Gratian\nGratian's brother, Valentinian II and Valentinian's mother strongly disliked Ambrose and generally refused to cooperate with him, taking every opportunity to side against him.  Yet, Valentinian II still refused to grant requests from pagans to restore the Altar of Victory and the income of the temple priests and Vestal Virgins or to overturn the policies of his predecessor.\nAfter Gratian, the emperors Arcadius, Honorius and Theodosius continued to appropriate for the crown the tax revenue collected by the temple custodians. Urban ritual procession and ceremony was gradually stripped of support and funding. Rather than being removed outright though, many festivals were secularized and incorporated into a developing Christian calendar, often with little alteration. Some had already severely declined in popularity by the end of 3rd century.\nAmbrose and Theodosius I\n.]]\nJohn Moorhead says that Ambrose, the Bishop of Milan is sometimes referred to as having influenced the anti-paganism policies of the emperor Theodosius I to the degree of finally achieving the desired dominance of church over state. Alan Cameron observes that this dominating influence is \"often spoken of as though documented fact\". Indeed, he says, \"the assumption is so widespread it would be superfluous to cite authorities\".\nModern scholarship has revised this view. Cameron says Ambrose was only one among many advisors, and there is no evidence Theodosius I favored him. On occasion Theodosius I purposefully excluded Ambrose, and at times, got angry enough with Ambrose that Theodosius sent him away from court. Neil B. McLynn observes that the documents that reveal the relationship between Ambrose and Theodosius seem less about personal friendship and more like negotiations between the institutions the two men represent: the Roman State and the Italian Church.\nAccording to McLynn, the events following the Thessalonian massacre cannot be used to \"prove\" Ambrose' exceptional or undue influence. The encounter at the church door does not demonstrate Ambrose' dominance over Theodosius because, according to Peter Brown, it never happened. According to McLynn, \"the encounter at the church door has long been known as a pious fiction\". Harold A. Drake quotes Daniel Washburn as writing that the image of the mitered prelate braced in the door of the cathedral to block Theodosius from entering, is a product of the imagination of Theodoret who was a historian of the fifth century. Theodoret wrote of the events of 390 \"using his own ideology to fill the gaps in the historical record\".\nTheodosius I (381–395)\nwas the first Roman Emperor to support the suppression of Pagan practices throughout the Empire]]\nTheodosius seems to have adopted a cautious policy overall toward traditional non-Christian cults. He reiterated his Christian predecessors' bans on animal sacrifice, divination, and apostasy, but allowed other pagan practices to be performed publicly and temples to remain open. Theodosius also turned pagan holidays into workdays, but the festivals associated with them continued. A number of laws against sacrifice and divination, closing temples that continued to allow them, were issued towards the end of his reign, but historians have tended to downplay their practical effects and even the emperor's direct role in them. Most of Theodosius' religious legislation was against heresy.\nModern scholars think there is little if any evidence Theodosius pursued an active and sustained policy against the traditional cults. There is evidence Theodosius took care to prevent the empire's still substantial pagan population from feeling ill-disposed toward his rule. Following the death in 388 of his praetorian prefect, Cynegius, who had vandalized a number of pagan shrines in the eastern provinces, Theodosius replaced him with a moderate pagan who subsequently moved to protect the temples. During his first official tour of Italy (389–391), the emperor won over the influential pagan lobby in the Roman Senate by appointing its foremost members to important administrative posts. Theodosius also nominated the last pair of pagan consuls in Roman history (Tatianus and Symmachus) in 391.\nBetween 382 and 384, there was yet another dispute over the Altar of Victory. According to the Oxford Handbook of Late Antiquity, Symmachus requested the restoration of the altar that Gratian had removed  and the restoration of state support for the Vestals. Ambrose campaigned against any financial support for paganism and anything like the Altar that required participation in pagan practices. Ambrose prevailed. Theodosius refused the appeal. Pagans remained outspoken in their demands for respect, concessions and support from the state.\nClassicist Ingomar Hamlet says that, contrary to popular myth, Theodosius did not ban the Olympic games.   indicates there are several reasons to conclude the Olympic games continued after Theodosius and came to an end under Theodosius II instead. Two scholia on Lucian connect the end of the games with a fire that burned down the temple of the Olympian Zeus during his reign.\nAnti-pagan legislation\nAnti-pagan legislation reflects what Brown calls \"the most potent social and religious drama\" of the fourth-century Roman empire. From Constantine forward, the Christian intelligentsia wrote of Christianity as fully triumphant over paganism. It didn't matter that they were still a minority in the empire, this triumph had occurred in Heaven; it was evidenced by Constantine; but even after Constantine, they wrote that Christianity would defeat, and be seen to defeat, all of its enemies - not convert them.\nThe laws were not intended to convert; \"the laws were intended to terrorize... Their language was uniformly vehement, and... frequently horrifying\". Their intent was to reorder society along religious lines and enable Christianity to put a stop to animal sacrifice. Blood sacrifice was the element of pagan culture most abhorrent to Christians. If they could not stop the private practice of sacrifice, they could \"hope to determine what would be normative and socially acceptable in public spaces\". Altars used for sacrifice were routinely smashed by Christians who were deeply offended by the blood of slaughtered victims as they were reminded of their own past sufferings associated with such altars.\nOne of the important things about this, in Malcolm Errington's view, is how much legislation was applied and used, which would show how dependable the laws are as a reflection of what actually happened to pagans in history. Brown says that, given the large numbers of non-Christians in every region at this time, local authorities were \"notoriously lax in imposing them. Christian bishops frequently obstructed their application. The harsh imperial edicts had to face the vast following of paganism among the population, and the passive resistance of governors and magistrates, thereby limiting their impact.\nTwenty-first century studies on the nature of the presence of the state, how it makes itself felt by the populace, \"the subtle nature of power\" and the eventual complete elimination of public sacrifice all show that, while the impact of imperial law was limited, it was not completely without influence.\nSecondly, the laws reveal the emergence of a language of intolerance. The legal language runs parallel to the writings of the apologists, such as Augustine of Hippo and Theodoret of Cyrrhus, and heresiologists such as Epiphanius of Salamis. Christian writers and imperial legislators both drew on a rhetoric of conquest. These writings were commonly hostile and often contemptuous toward a paganism Christianity saw as already defeated.\nLastly, on the one hand the laws, and these Christian sources with their violent rhetoric, have had great influence on modern perceptions of this period by creating an impression of continuous violent conflict that has been assumed on an empire-wide scale. Archaeological evidence, on the other hand, indicates that, outside of violent rhetoric, there were only isolated incidents of actual violence between Christians and pagans.  Non-Christian, (non-heretical), groups such as pagans and Jews enjoyed a tolerance based on contempt through most of Late Antiquity.\nTemple destruction and conversion\nἘπαρχότης τῶν πραιτωρίων τῆς Ανατολῆς\n|conventional_long_name = Praetorian prefecture of the East\n|common_name = Prefecture of the Orient\n|subdivision = Praet. Prefecture\n|nation = the East Roman Empire\n|era = Late Antiquity\n|capital = Constantinople\n|\n|image_map = Praetorian Prefectures of the Roman Empire 395 AD.png\n|image_map_caption =Praetorian Prefectures of the Roman Empire (395). The Praetorian Prefecture of the East is in grey.\n|year_start = 337\n|year_end = 7th century\n|event_end = reorganization into themata\n|category=\n}}\nAccording to Brown, Theodosius was a devout Christian anxious to close the temples in the East. His commissioner, the prefect Maternus Cynegius (384-88) commissioned temple destruction on a wide scale, even employing the military under his command and \"black-robed monks\" for this purpose. Garth Fowden says Cynegius did not limit himself to Theodosius' official policy, but Theodosius did not stop him.\nThe pagan historian Libanius wrote \"this black robed tribe\" were acting outside the law, but Brown says Theodosius did not enforce those laws. Theodosius voiced his support for the preservation of temple buildings, but passively legitimized the monk's violence by listening to them instead of correcting them, thereby failing to prevent the damaging of many holy sites, images and objects of piety by Christian zealots. However, in 388 at Callinicum, (modern Raqqa in Syria), the bishop along with monks from the area burned a Jewish synagogue to the ground, and Theodosius responded, \"The monks commit many atrocities\", and he ordered them to pay to rebuild it.\nThese examples were seen as the 'tip of the iceberg' by earlier scholars who saw these events as part of a tide of violent Christian iconoclasm that continued throughout the 390s and into the 400s.\nHowever, archaeological evidence for the violent destruction of temples in the fourth and early fifth centuries around the entire Mediterranean is limited to a handful of sites. Most recorded incidents of temple destruction are known from church and hagiographical accounts which are eager to portray their subjects' piety and power. They offer vividly dramatized accounts of pious bishops doing battle with temple demons. The temples of Zeus at Apameia and of Marnas at Gaza City are said to have been brought down by the local bishops around this period, but the only source for this information is the biography of Porphyry of Gaza which is considered a forgery.\nTrombley and MacMullen say part of why such discrepancies (between the literary sources and the archaeological evidence) exist is because it is common for details in the literary sources to be ambiguous and unclear. For example, Malalas claimed Constantine destroyed all the temples, then he said Theodisius did, then he said Constantine converted them all to churches.\nAccording to archaeologists Lavan and Mulryan: If one accepts all potential claims (several of which are very shaky) only 2.4% of all known temples in Gaul have evidence of being destroyed by violence (17 out of [approximately] 711) ... In Africa, only the city of Cyrene has produced good evidence (the burning of several temples) whilst work in Asia Minor has produced just one weak candidate (undated), and in Greece the only strong example may relate to a barbarian rather than a Christian raid. Finally, Egypt has produced no archaeologically-confirmed temple destructions at all dating from this period, with the  exception of the Serapeum, a situation paralleled in Spain. In Italy, we have only a single burning; Britain has produced the most evidence, with 2 Romano–Celtic temples out of 40 ...being burnt in the 4th c., whilst another was deliberately destroyed, with its mosaics smashed.\nEarthquakes caused much of the destruction that occurred to temples in this era, and people determined not to rebuild as society changed. Recycling and pragmatism contributed to demolition as well, with one building being taken down and another constructed according to the needs of the community with no anti-paganism being involved. Civil conflict and external invasions also destroyed temples and shrines. Lavan says: \"We must rule out most of the images of destruction created by the [written sources]. Archaeology shows the vast majority of temples were not treated this way\".\nSome scholars have long asserted that not all temples were destroyed but were instead converted to churches throughout the empire. According to modern archaeology, 120 pagan temples were converted to churches in the whole empire, out of the thousands of temples that existed, and only about 40 of them are dated before the end of the fifth century. R. P. C. Hanson says the direct conversion of temples into churches did not begin until the mid fifth century in any but a few isolated incidents. In Rome the first recorded temple conversion was the Pantheon in 609. None of the churches attributed to Martin of Tours can be proven to have existed in the fourth century.\nAnti-paganism after Theodosius I until the collapse of the Western Empire\nAnti-pagan laws were established and continued on after Theodosius I until the fall of the Roman Empire in the West. Arcadius, Honorius, Theodosius II, Marcian and Leo I reiterated the bans on pagan sacrifices and divination and increased the penalties. The necessity to do so indicates that the old religion still had many followers. In the later part of the 4th century there were clearly a significant number of pagan sympathizers and crypto-pagans still in positions of power in all levels of the administrative system including positions close to the emperor; even by the 6th century, pagans can still be found in prominent positions of office both locally and in the imperial bureaucracy.\nFrom Theodosius on, public sacrifice definitely ended in Constantinople and Antioch, and in those places that were, as Lavan says, \"under the emperor's nose\" by around 350. However, away from the imperial court, those efforts were not effective or enduring until the fifth and sixth centuries.\nBy the early fifth century under Honorius and Theodosius II, there were multiple injunctions against magic and divination. One example was the law of 409 de maleficis et mathematicis against astrologers ordering them to return to Catholicism, and for the books of mathematics that they used for their computations to be \"consumed in flames before the eyes of the bishops\". A fifth century writer Apponius wrote a condemnation of methods \"demons used to ensnare human hearts\" including augury, astrology, magical spells, malign magic, mathesis, and all predictions gained from the flights of birds or the scrutiny of entrails.\nThe prefecture of Illyricum appears to have been an attractive post for pagans and sympathisers in the 5th century, and Aphrodisias is known to have housed a substantial population of pagans in late antiquity, including a famous school of philosophy.  In Rome, Christianization was hampered significantly by the elites, many of whom remained stalwartly pagan. The institutional cults continued in Rome and its hinterland, funded from private sources, in a considerably reduced form, but still existent, as long as the Western Roman Empire lasted.\nBayliss writes that \"We know from discoveries at Aphrodisias that pagans and philosophers were still very much in evidence in the 5th century, and living in some luxury. The discovery of overt pagan statuary and marble altars in a house in the heart of the city of Athens gives a very different impression from that presented by the law codes and literature, of pagans worshipping in secrecy and constant fear of the governor and bishop\".\nAfter the fall of the Western Empire\nIn 476, the last western emperor of Roman descent, Romulus Augustulus, was deposed by Odoacer, who became the first barbarian king of Italy.}} By the time the Emperor Anastasius I, who came to the throne in 491 as the first emperor required to sign a written declaration of orthodoxy before his coronation, the Goths had been Christian for over a hundred years.\nPeter Brown has written that, \"it would be profoundly misleading\" to claim that the cultural and social changes that took place in Late Antiquity reflected \"in any way\" an overall process of Christianization of the empire. Instead, the \"flowering of a vigorous public culture that polytheists, Jews and Christians alike could share... [that] could be described as Christian \"only in the narrowest sense\" had developed. It is true that Christians had ensured that blood sacrifice played no part in that culture, but the sheer success and unusual stability of the Constantinian and post-Constantinian state also ensured that \"the edges of potential conflict were blurred... It would be wrong to look for further signs of Christianization at this time. It is impossible to speak of a Christian empire as existing before Justinian\".\nThe Byzantine emperor Justinian I, also known as Justinian the Great (527-565), enacted legislation with repeated calls for the cessation of sacrifice well into the 6th century. Judith Herrin writes that Emperor Justinian was a major influence in getting Christian ideals and legal regulations integrated with Roman law. Justinian revised the Theodosian codes, introduced many Christian elements, and \"turned the full force of imperial legislation against deviants of all kinds, particularly religious\". Herrin says, \"This effectively put the word of God on the same level as Roman law, combining an exclusive monotheism with a persecuting authority\".\nAccording to Anthony Kaldellis, Justinian is remembered as \"the last Roman emperor of ecumenical importance ... the arbiter of the Roman legal tradition.\" Yet it is as the emperor who sought, once again, to extend Roman authority around the Mediterranean, that he is often seen as a tyrant and despot. Justinian's government became increasingly autocratic. He persecuted pagans, religious minorities and purged the bureaucracy of those who disagreed with him. As Byzantine imperial culture became more orthodox, it led to the creation of the Monophysite church, which set Constantinople against both Rome and the Eastern provinces. \"Few emperors had started so many wars or tried to enforce cultural and religious uniformity with such zeal... In the words of one historian, 'Justinian was conscious of living in the age of Justinian'.\nHerrin adds that, under Justinian, this new full \"supremacy of Christian belief involved considerable destruction\".  The decree of 528 had already barred pagans from state office when, decades later, Justinian ordered a \"persecution of surviving Hellenes, accompanied by the burning of pagan books, pictures and statues\" which took place at the Kynêgion. Most pagan literature was on papyrus, and so it perished before being able to be copied onto something more durable. Herrin says it is difficult to assess the degree to which Christians are responsible for the losses of ancient documents in many cases, but in the mid-sixth century, active persecution in Constantinople destroyed many ancient texts.\nEvaluation and commentary\nIn the early 21st century, every aspect of Antiquity is undergoing revision as \"a hotly debated period\". What was thought to be well-known concerning the relation between society and Christianity \"has been rendered disturbingly unfamiliar\".\nIn the last decade of the twentieth century and into the twenty–first century, multiple new discoveries of texts and documents, along with new research (such as modern archaeology and numismatics), combined with new fields of study (such as sociology and anthropology) and modern mathematical modeling, have undermined much of the traditional view. According to modern theories, Christianity became established in the third century, before Constantine, paganism did not end in the fourth century, and imperial legislation had only limited effect before the era of the eastern emperor Justinian I (reign 527 to 565).\nEven periodization is debated, but late antiquity is generally thought of as beginning after the end of the Roman empire's Crisis of the Third Century (AD 235–284) and extending to about AD 600 in the West, and AD 800–1000 in the East.'\nDiffering scholarly views\nAccording to The Oxford Handbook of Late Antiquity (OHLA), scholars of the late Roman Empire fall into two categories on this topic; they are referred to as holding either the \"catastrophic\" view or the \"long and slow\" view of the demise of polytheism.\nCatastrophic view\nThe classic inception of the catastrophic view comes from the work of Edward Gibbon, The History of the Decline and Fall of the Roman Empire. Written in the 18th century, historian Lynn White says that Gibbon gave four reasons for the downfall of the Roman Empire: \"immoderate greatness\", wealth and luxury, barbarians, and Christianization, but it was Christianization that Gibbon saw as primary. White says that, by Gibbon's own self-description, Gibbon was a \"philosophical historian\" who believed that the primary virtues of civilization were war and monarchy. He saw Christian teaching as pacifistic and Christians as unwilling to support the virtue of war and join the military; he said Christians were hiding their cowardice and laziness under the cloak of religion. It was this unwillingness to support war that Gibbon claimed was the primary cause of Rome's decline and fall, saying: \"the last remains of the military spirit were buried in the cloister\". Gibbon disliked religious enthusiasm and zeal and singled out the monks and martyrs for particular denigration as representative of these \"vices\". According to historian Patricia Craddock, Gibbon's History is a masterpiece that fails only where his biases affect his method, allowing the \"desertion of the role of historian for that of prosecuting attorney\".\nEven so, historian Harold A. Drake writes that, \"It is difficult to overestimate the influence of Gibbon's interpretation on subsequent scholarship\". Gibbon's views developed into the traditional \"catastrophic\" view that has been the established hegemony for 200 years.  by threats and disabilities, if not by the direct use of force. }}\nLong, slow demise\nThe modern alternative is the \"long view\", first stated by Peter Brown, whom The Oxford Handbook of Late Antiquity calls the \"pioneer\" who inspired the study of Late Antiquity as a field in itself, and whose work remains seminal. Brown used anthropological models, rather than political or economic ones, to study the cultural history of the period. He said polytheism experienced a \"long slow\" demise that lasted from the 200s into the 600s.\nThe Christian church believed that the dominance over other philosophies had begun with Jesus; they marked the conversion of Constantine as the end — the final fulfillment — of this heavenly victory, even though Christians were only about 15–18% of the empire's population at the time of Constantine's conversion.  This narrative imposed a firm closure within the Christian literature on what, according to Pierre Chuvin, had in reality been a \"wavering century.\"\nSources\nAccording to MacMullan, the Christian record declares pagans were not only defeated, but fully converted, by the end of the fourth century, but he says that this claim was \"far from true\". Christians, in their triumphant exaggeration, and sheer bulk of material, have misrepresented religious history, as other evidence shows that paganism continued.  MacMullen says this is why \"We may fairly accuse the historical record of having failed us, not just in the familiar way, being simply insufficient, but also through being distorted\".\nThe historical sources are filled with episodes of conflict, however, events in late antiquity were often dramatized for ideological reasons. Jan N. Bremmer says that \"religious violence in Late Antiquity is mostly restricted to violent rhetoric: 'in Antiquity, not all religious violence was that religious, and not all religious violence was that violent'\". Brown contends that the fall of Rome is a highly charged issue that leads many to \"tendentious and ill supported polemics\". Antique Christian accounts proclaim uniform victory while some current historiography begins with the \"infinite superiority\" of the Roman Empire based on an \"idealized image\" of it, then proceeds to vivid accounts of its unpleasant, ignorant, and violent enemies (the barbarians and the Christians), which is all intended to frame a \"grandiose theory of catastrophe from which there would be no return for half a millennia\". The problem with this, according to Brown, is that \"much of this 'Grand Narrative' is wrong; it is a two dimensional history\".\nLegislation\nThe Theodosian Law Code has long been one of the principal sources for the study of Late Antiquity. It is an incomplete collection of laws dating from the reign of Constantine to the date of their promulgation as a collection in 438. Religious laws are in book 16. The code contains at least sixty-six laws targeted at heretics. Most are found in Book XVI, ‘De Fide Catholica’, \"On the Catholic Faith\". The laws fall into three general categories: laws to encourage conversion; laws to define and punish the activities of pagans, apostates, heretics and Jews; and laws concerned with the problems of implementing the laws, that is, laws aimed at the conversion of the aristocracy and the administrative system itself. Most importantly, it details the cult activities that the emperor and the Catholic Church considered unsuitable. The language of these religious laws is uniformly vehement and the penalties are harsh and frequently horrifying.\nContemporary scholars question using the Code, which was a legal document and not an historical work, for understanding history.  According to archaeologist Luke Lavan, reading law as history distorts understanding of what actually occurred during the fourth century. There are many signs that a healthy paganism continued into the fifth century, and in some places, into the sixth and beyond.  Christian hostility toward pagans and their monuments is seen by most modern scholars as far from the general phenomenon that the law and literature implies.\nArchaeology\nArchaeologists Luke Lavan and Michael Mulryan point out that the traditional catastrophic view is largely based on literary sources, most of which are Christian, and are therefore considered too partial. Christian historians wrote vividly dramatized accounts of pious bishops doing battle with temple demons, and much of the framework for understanding this age is based on the “tabloid-like” accounts of the destruction of the Serapeum of Alexandria, the murder of Hypatia, and the publication of the Theodosian law code. Lavan and Mulryan indicate that archaeological evidence of religious conflict exists, but not to the degree or the intensity to which it was previously thought, putting the traditional catastrophic view of \"Christian triumphalism\" in doubt. Rita Lizzi Testa, Professor of Roman history, Michele Renee Salzman, and Marianne Sághy quote Alan Cameron as saying that the idea that religious conflict is the cause of the swift demise of paganism is pure historiographical construction.\nAccording to Salzman: \"Although the debate on the death of paganism continues, scholars ...by and large, concur that the once dominant notion of overt pagan-Christian religious conflict cannot fully explain the texts and artifacts or the social, religious, and political realities of Late Antique Rome\". Lavan says in ''The Archaeology of Late Antique 'Paganism':  }}\nBayliss states that the Christian sources have greatly influenced perceptions of this period, to the extent that the impression of the conflict which they create has led scholars to assume that the conflict existed on an empire-wide level.  However, archaeological evidence indicates that the decline of paganism was peaceful in many places throughout the empire, for example Athens, was relatively non-confrontational.  While some historians have focused on the cataclysmic events such as the destruction of the Serapeum at Alexandria, in reality, there are only a handful of documented examples of temples being entirely destroyed through such acts of aggression. According to Bayliss, this fact means that the archaeological evidence might show that Christian responsibility for the destruction of temples has been exaggerated.\nAs Peter Brown points out with regard to Libanius’ anger: “we know of many such acts of iconoclasm and arson because well-placed persons still felt free to present these incidents as flagrant departures from a more orderly norm\".  Scholars such as Cameron, Brown, Markus, Trombley and MacMullen have lent considerable weight to the notion that the boundaries between pagan and Christian communities in the 4th century were not as stark as some prior historians claimed because open conflict was actually something of a rarity.\nBrown and others such as Noel Lenski and Glen Bowersock say that \"For all their propaganda, Constantine and his successors did not bring about the end of paganism\". It continued.  Previously undervalued similarities in language, society, religion, and the arts, as well as current archaeological research, indicate that paganism slowly declined for a full two centuries and more in some places, thereby offering an argument for the ongoing vibrancy of Roman culture in late antiquity, and its continued unity and uniqueness long after the reign of Constantine.\nSee also\n*Anti-paganism policies of the early Byzantine Empire\n*Greco-Roman world\n*Hellenistic religion\n*History of Christian thought on persecution and tolerance\n*Pentarchy\n*Paradox of tolerance\n*Religious policies of Constantius II\n*Persecution of pagans under Theodosius I\n*Religion in ancient Rome\n*Religious persecution in the Roman Empire\n*Restoration of paganism from Julian until Valens\n*Revival of Roman paganism\nNotes\nReferences\nBibliography\n*\n*  |author-link=Roger S. Bagnall |author-link2=Alan Cameron (classical scholar) |author-link3=Seth Schwartz |author-link4=Klaas Worp |ref= }}\n*  }}\n*\n*\n*\n*  }}\n*  }}\n*\n*  }}\n*\n*\n*\n*  |editor-link=Harold A. Drake}}\n*\n*\n*  }}\n*  }}\n*  |doi=10.4324/9781315103334 |s2cid=213344890 |ref= }}\n*\n*\n*\n*  }}\n*   }}\n*  |ref= }}\n*\n*  }}\n*  |author-link=Michele R. Salzman |jstor=j.ctvk12r62}}\n*\n*  }}\n*\n*  }}\n*\nFurther reading\n* Schusser, Theresia (2023). Christliche religiöse Gewalt im spätantiken Ägypten: hagiographische Schriften im Fokus kultur- und mentalitätsgeschichtlicher Fragestellungen [Christian religious violence in late antique Egypt: hagiographic writings in the focus of cultural and mental history]. Ägypten und Altes Testament, vol. 118. Münster: Zaphon, .\n* Sizgorich, Thomas (2009). Violence and belief in late antiquity. Militant devotion in Christianity and Islam.'' Philadelphia: University of Pennsylvania Press, ."
    }
  ]
}