{
  "content": [
    {
      "type": "text",
      "text": "# Perur Pateeswarar Temple, Coimbatore\n\n}}\n| country            = India\n| state              = Tamil Nadu\n| district           = Coimbatore\n| location           = Perur, Coimbatore.\n| elevation_m        =\n| deity      = Sri Pateeswarara Swamy (Shiva)\nSri Pachainayagi Amman (Parvati)\n| architecture       = Tamizh Chozha  architecture\n| year_completed     = 2nd century CE\n| inscriptions       =\n| creator            = Karikala Chola\n| website            =http://www.perurpatteeswarar.tnhrce.in/\n}}\nPerur Pateeswarar Temple is a Hindu temple dedicated to Lord Shiva located at Perur, in western part of Coimbatore in state of Tamil Nadu in India. The temple was built by Karikala Chola in 2nd century CE. The temple is located on the bank of the Noyyal River and has been patronized by poets like Arunagirinathar and Kachiappa Munivar. Patteeswarar (Shiva) is the presiding deity of this temple together with his consort Pachainayaki (Parvati). The main deity is a Swayambu Lingam.\nVarious names for the temple have been used over the years, including, Kamadenupuri, Pattipuri, Adhipuri, Daksha Kailasham, Thavasiddhapuram, Gnanapuram, Kalyanapuram, Pirava Neri Thalam, Pasupathipuram, and Melai Chidambaram.\nHistory\nThe temple was built by the Chola emperor Karikala in the 2nd century CE. Further contributions were made by Imperial Cholas in late 10th & early 11th centuries.\nArchitecture\nPerur Pateeswarar Temple has several gopurams and halls, notably the Kanaka Sabha, which contains a golden statue of Nataraja. The ceiling is covered in a network of stone chains, and the pillars are decorated with carvings of Shiva in his different forms.\nCulture\nEvery year, the temple celebrates a classical dance week, typically Bharata Natyam. The temple is believed to be one of the places where Shiva performed Ananda Thandavam.\nFestivals\nTemple chariot festival\nEvery year in the month of Panguni, Panguni Uthiram is celebrated. A temple chariot is paraded through the neighborhood as part of the celebration.\nSeedling planting festival\nThe festival has been celebrated by the farming community along the banks of Noyyal River. The festival is conducted in the month of Aani. The ritual forms a part of Indra festival. The festival has its reference from the \"Perur Puranam\" by Kachiappa Munivar.\nReferences\nExternal links\n* [https://web.archive.org/web/20120121054217/http://www.perurpatteeswarar.in/ Official Website]\n* [https://temple.dinamalar.com/en/new_en.php?id=460 Temple's Speciality Dinamalar]"
    }
  ]
}