{
  "content": [
    {
      "type": "text",
      "text": "# Peruvian–Bolivian War of 1841–42\n\nPeruvian–Bolivian War}}\n}}\n* Peruvian invasion repelled by Bolivian troops\n* Bolivian invasion repelled by Peruvian troops\n| territory         = Status quo ante bellum\n| combatant1        =  Peru\n| combatant2        =  Bolivia\n| commander1        =  Agustín Gamarra Manuel de Mendiburu Juan Buendía José María Lavayén Justo Arias y Aragüez José Rosa Ara Miguel de San Román\n| commander2        =  José Ballivián Eusebio Guilarte Jorge Córdova Narciso Campero Manuel Magariños Bernardo Rojas José María García José Velasco\n| strength1         = 7,000–9,000 men\n| strength2         = 6,800–7,700 men\n}}\nThe Peruvian–Bolivian War was a warlike confrontation between Peru and Bolivia in the years 1841 and 1842.\nIn 1841, Agustín Gamarra, President of Peru, tried to annex Bolivia, which cost the Peruvian president his life on November 18, 1841 at the Battle of Ingavi. The Bolivian Army, under the command of General José Ballivián, occupied the Peruvian provinces of Moquegua, Puno, Tarapacá, Tacna and Arica.\nThe eviction of Bolivian troops in southern Peru would be achieved by the increased availability of material and human resources in Peru. At the end of the war, the Treaty of Puno was signed on June 7, 1842.\nOccupation of La Paz\nPeruvian troops led by President Gamarra began the march to Bolivia on October 1, 1841, crossing the border the next day. After advancing without encountering resistance, on October 15 they entered La Paz without fighting. Ballivián's manifesto to oppose the invaders, however, was soon applied by the population.\nOn October 21, in the town of Mecapaca, a battle occurred between the Peruvian and Bolivian forces, as that town was occupied by a Peruvian column under the command of Colonel San Román, who was later attacked by the Bolivian 5th Battalion and a detachment of cuirassiers. The Peruvians, taken by surprise, rallied and forced their enemies to retreat in disorder. Soon, however, a crowd from La Paz stormed the city's hospital, where the wounded soldiers and officers had been taken, in order to kill them.\nBattle of Ingavi\nThe battle of Ingavi took place on November 18, 1841 in the town of Viacha within Ingavi Province. There, Bolivian troops under the command of José Ballivián clashed with Peruvian troops under Agustín Gamarra, defeating the Peruvian troops and killing General Gamarra in the process.\nThe defeat of the Peruvian Army gave Ballivián and the Bolivian Army the opportunity to counterattack and invade Peruvian territory, approaching Cuzco and threatening to seek the annexation of the port of Arica, which at the time was claimed by Bolivia since its creation during the Bolivarian era, in order to be able to improve its economy significantly.\nBolivian troops occupied the provinces of Tacna, Arica and Tarapacá within the Moquegua Department.\nOccupation of Southern Peru\nAt the end of 1841, after the battle of Ingavi, troops of the Bolivian Second Division under General José Ballivián occupied Peru from Moquegua to Tarapacá.\nOn December 9, 1841, a regiment under the command of Colonel Rodríguez Magariños occupied Tacna, another under the command of Colonel Bernardo Rojas occupied Arica, and another under the command of Colonel José María García occupied Tarapacá, while José Ballivián's forces occupies Moquegua and Puno.\nPeruvian counter-attack\n| combatant2        =\n| units1            =  Peruvian Army  Peruvian Navy\n| units2            =  Bolivian Army\n| commander1        =  Juan Buendía  Juan Bautista  Pablo Pimentel  Mariano Macedo  Manuel Layaven   Manuel de Mendiburu\n| commander2        =  José Ballivian Juan Landivar José María García   Manuel Magariños  Jorge Córdoba  Juan Zatizábal  Juan Montero\n| strength1         =  600 men\n| strength2         =  1,150+ men\n| casualties1       =  +165 killed and wounded\n| casualties2       =  2,000/\n}}\nColonel Manuel de Mendiburu, who was the military commander of the South, returned from Lima to the south to organize the Peruvian resistance to the Bolivian occupation.\nAt the same time, Juan Bautista Ramos, a Major in the Peruvian Army from Arica, organized a guerrilla war with local volunteers where they attacked and defeated the Bolivian forces of Bernardo Rojas in Arica on December 25, 1841. In Sama, Colonel José María Lavayén organized local forces that managed to defeat the Bolivian forces of Colonel Rodríguez Magariños. In Locumba, Colonel Manuel de Mendiburu also organized forces, including Justo Arias y Aragüez in 1842.\nJosé Rosa Ara also organized a column in Locumba, Tacna, composed of Peruvian soldiers and peasants and in the Battle of the Altos de Chipe they defeated a Bolivian regiment.\nThe Bolivian Army did not have enough troops to maintain the occupation. In the Recapture of Tarapacá, Peruvian montoneros formed by Major Juan Buendía, coming from Iquique, defeated on January 7, 1842, the detachment led by Colonel José María García, who was killed in the confrontation. Thus, the Bolivian troops vacated Tacna, Arica and Tarapacá in February 1842, retreating towards Moquegua and Puno.\nTwo more Bolivian defeats at Battle of Motoni (March 20) and Battle of Orurillo (April 3) in Puno subsequently forced the withdrawal of the last Bolivian forces that occupied Peruvian territory, exposing Bolivia to an other invasion.\nTreaty of Puno\n| image               =\n| image_width         =\n| caption             =\n| type                = Peace treaty\n| date_drafted        =\n| date_signed         =\n| location_signed     = Puno, Peru\n| date_sealed         =\n| date_effective      =\n| condition_effective =\n| date_expiration     =\n| negotiators         =\n| signatories         =\n*\n*\n| depositor           =\n| citations           =\n| languages           = Spanish\n| wikisource          = es:Tratado de Puno\n}}\nThe two nations signed the Treaty of Puno on June 7, 1842, officially ending the war. Both countries agreed to remain as separate sovereign states and the retreat of the last Bolivian troops on Peruvian territory was accomplished eight days later.\nThe Bolivian army that had invaded southern Peru was defeated by the Peruvian army and forced to withdraw. Bolivia also promised to deliver Gamarra remains to Peru.\nBolivia unconditionally renounced all claims in southern Peruvian territory, but nevertheless, the treaty did not manage to solve the border problem between the two states.\nThe conflict ended with a return to the situation before the war. Despite this, Peruvian historiography argues that their victories in all the battles on Peruvian soil, overshadow the one defeat at Ingavi, leaving Peru in a more favorable outcome after the end of the war.\nAlthough in the document Bolivia and Peru agreed not to touch on the issue of unification as a single state, in 1880 Presidents Nicolás de Piérola and Narciso Campero began a project for the national union of the two countries known as the United States of Peru–Bolivia, which ended up never happening. With the re-emergence of nationalism and anti-Chilean sentiment as a consequence of the War of the Pacific, the prospect of unification again began to become more common in political discourse between both states.\nSee also\n* Peru–Bolivian Confederation\nReferences"
    }
  ]
}