{
  "content": [
    {
      "type": "text",
      "text": "# Peshawar–Dera Ismail Khan motorway\n\nThe Peshawar–Dera Ismail Khan Motorway is a  long proposed motorway connecting Peshawar with the southern parts of Khyber Pakhtunkhwa, Pakistan. Starting at the provincial capital Peshawar in the north, it will pass through 12 districts including Darra Adamkhel, Kohat, Hangu, Karak, Bannu (Domel), Ghoriwala, Lakki Marwat, and Darra Pezu, reaching Dera Ismail Khan at its southern end.\nIt was originally announced in December 2019 and the plan was approved by the provincial government in 2020. The first part of the project was approved by the Imran Khan government in 2021 and the feasibility study was completed in 2022. It was approved for a public private partnership construction in 2024 and the land acquisition process and initial funds were released in 2025.\nHistory\nIn December 2019, the project was first announced, originally spanning 339 km from Peshawar to Dera Ismail Khan instead of the later 365 km. It was approved by Chief Minister Mahmood Khan, while the design was being finalized and early costs estimated to be Rs250 billion.\nIn December 2020, the Government of Khyber Pakhtunkhwa led by Mahmood Khan and the Planning Department approved the project for 360 km and 19 interchanges for a cost of Rs276 billion and aiming to construct it over four years.\nIn August 2021, the PC-1 of the project was approved by Prime Minister of Pakistan, Imran Khan. In September 2021, it was approved from Executive Committee of the National Council with an estimated cost of Rs300 billion.\nIn December 2022, the Government of Khyber Pakhtunkhwa completed the feasibility study of the project and entered into financing negotiations with Asian Development Bank (ADB) and the International Finance Cooperation (IFC) for loans covering 180 of the Rs. 300 billion required for the project. The remaining Rs. 120 billion are planned to be contributed by the provincial government.\nIn October 2024, under Chief Minister Ali Amin Gandapur, the construction of the motorway was included in eight flagship projects launched by the government. It was announced that it aims to serve as an international trade corridor and plans to connect Khyber Pakhtunkhwa with Punjab and Balochistan economically. On 24 December 2024, the Cabinet of Khyber Pakhtunkhwa approved the construction on a public-private partnership and directed the finance department to arrange funds for land acquisition.\nIn January 2025, the government released an initial Rs2 billion of funds for the land acquisition process. Ali Amin Gandapur said that it will feature six lanes, 19 interchanges, and two tunnels, connecting seven districts to be completed with an estimated cost of Rs348 billion. He claims that it will boost economic and commercial development. The same month, the World Bank expressed interest in collaborating on the project.\nDetails\nLocation\nThe motorway will be around  long and comprise 6 lanes, with 19 interchanges. The project has two tunnels of  each. It is expected to be completed in a period of 4 years. Passing through the three major Divisions of Khyber Pakhtunkhwa—Kohat, Bannu and Dera Ismail Khan, the motorway will connect the cities of Kohat, Hangu, Karak, Bannu, Lakki Marwat, Tank and Dera Ismail Khan with the Kharlachi (D.I.Khan), Ghulam Khan (North Waziristan) and Angur Ada (South Waziristan) border crossings on the Durand Line-Afghanistan–Pakistan border to the west.\nList of Interchanges\n# M1 Interchange\n# Tarnab Interchange\n# Ring Road Interchange\n# Matni-Badaber Interchange\n# Dara Adam Khel Interchange\n# Kohat Interchange\n# Sher Kot-Asterzai Interchange\n# Raeesan-Jozara Interchange\n# Hangu-Tall Interchange\n# Karapa-Lachi Interchange\n# Soor Dag Interchange\n# Bannu-Domel Interchange\n# Ghoriwala-Sarai Naurang Interchange\n# Gazni Khel-Lakki Marwat Interchange\n# Pezo-Tank Interchange\n# Yark Hakla-Islamabad Interchange\n# DI Khan Interchange\n# Zhob Quetta Interchange\n# Darya Khan-DI Khan Interchange\nSee also\n* Khyber Pakhtunkhwa\n* Motorways of Pakistan\n* Peshawar\n* Dera Ismail Khan\n* Bannu\n* Ghoriwala\n* China-Pakistan Economic Corridor\nReferences"
    }
  ]
}