{
  "content": [
    {
      "type": "text",
      "text": "# Petagas War Memorial\n\n|lat           =\n|long          =\n|extra         =\n}}\nThe Petagas War Memorial or Petagas War Memorial Garden () is a memorial park dedicated to the Second World War victims in Sabah particularly to 324 resistance movement members, who were executed on 21 January 1944 at the site by the Japanese occupying forces of North Borneo for their involvement in the Jesselton Revolt. The park memorial plate lists the names of men of various ethnic groups in North Borneo and from various islands in the Sulu Archipelago including the main resistance leader Albert Kwok and those who assisted or died in Labuan Military Prison. The park was built exactly on the site where the massacre took place and where the victims were initially buried. It is located in Kampung Peringatan Petagas in the district of Putatan in Sabah, Malaysia.\nHistory\nBackground and event leading to the establishment of resistance movement\n, the main leader of the Jesselton revolt]]\nWith the persistent harsh rule during the occupation of northern Borneo by the Imperial Japanese Army (IJA), a Kuching-born Chinese doctor named Albert Kwok founded more than 300 members to form the resistance movement, after he moved to Jesselton on 15 May 1941. Already facing the limited supply of weapons, the resistance movement was forced to launch the revolt ahead of schedule on 9 October 1943 as the Japanese decree to seize any opposition towards their administration became imminent. On the eve of the National Day of the Republic of China on 10 October, the attack was subsequently launched at Jesselton resulting in more than 50 Japanese casualties, with the majority dying from attacks by the parang, bujak and kris. Furious with the uprising by the local communities, Japanese reinforcement troops arrived in North Borneo from Kuching and began to launch a systematic retaliation on the civilian population. After threatening that more civilians were to be executed if the leaders of the uprising did not turn themselves in, Kwok with several movement leaders surrendered on 19 December 1943. They were initially imprisoned in Batu Tiga Prison before being executed at the Petagas War Memorial site on 21 January 1944 along with 175 others, who for the most part had nothing to do with the uprising.\nMassacre of civilians and resistance movement members\n. From left:(1st Row) Kong Tze Phui, Lim Keng Fatt, Imam Marajukim, and Charles Peter.(2nd Row) Jules Stephens, Li Tet Phui, and Subedar Dewa Singh.]]\nIn the early morning of 21 January 1944, Kwok and the 175 men from Batu Tiga Prison were dispatched on a North Borneo Railway train. The train arrived from Jesselton and stopped at 5.30 in the morning at an open track near Petagas. Two large pits had been dug there the day before and rain water had already filled the holes. The movement leaders including Kwok, Charles Peter, Tsen Tsau Kong, Kong Tze Phui and Li Tet Phui had to stand in a row and to lean forward. Four Japanese officers and the son of a Japanese businessman (killed during the uprising) were ordered to behead the five prisoners with katana. The remaining 170 prisoners had to kneel in front of the pits and were killed by either shots from two machine guns, ten small firearms or with bayonets. Eyewitnesses near the execution site reported that the screams of the men were heard throughout the day and the following night in Petagas. Even before the massacre in Petagas, 96 inmates comprising guerrillas members and men suspected of supporting the guerrillas had been tortured and killed at the Batu Tiga Prison. Another 131 men were transferred to the Labuan Military Prison immediately after the forced labour massacre. Only seven survived and the others died either from malnutrition, by torture or were executed.\nEstablishment of the memorial site\nOn 21 January 1946, the Chinese War Victims Relief Association (CWVRA) held a memorial service at the execution site as a second anniversary of the massacre. The park grounds and marble memorial were built in 1948 at the behest of the West Coast Memorial Fund Residential Committee (WCMFRC). At the same time, it was decided that the site of the massacre and its burial sites should be a permanent place of remembrance for all North Borneo's victims in World War II. The inauguration of the memorial took place on the fourth anniversary of the massacre on 21 January 1948. In 1949, the remains of the men who were murdered by the Japanese military police (kenpeitai) and interred in Labuan were reburied at Petagas.\n]]\nThe memorial continued to play an important role in North Borneo's historical consciousness even until the foundation of Malaysia in 1963 through the first Chief Minister Fuad Stephens and the Head of State Mustapha Harun, whose personal histories were closely linked with the resistance movement. Jules Stephens, as one of the members of the revolt serving under the North Borneo Volunteer Force (NBVF), was the father of Donald Stephens, while Mustapha was a member of the movement itself. In 1979, the memorial was renovated by the Kota Kinabalu City Hall with the financial support of the state government and extended with a parking space and a public toilet. The wooden monument was replaced with a marble stone. During the renovations, several stone clay jars with human remains were discovered in the burial ground. These turned out to be the ex-prisoners from the Labuan military prison, which had been reburied in Petagas.\nSince the opening of the Petagas War Memorial site, an annual memorial service has been held on 21 January with the participation of high-ranking state politicians, families of the victims, and the general population. At the 1998 service, a representative of the Japanese government and the Japanese consul in Kota Kinabalu attended the ceremony for the first time.\nOn 21 January 2018, the annual commemoration included another eight civilians who were not part of the Albert Kwok group. Their names (Lothar Wong Manjaji, Vitalianus Joseph Lim @ Ubing, Simon Thien, Bung Ah Tee @ Stephen Pan Tet Liong, Paul Chong Pin Sin, Paul Lee Fook Onn @ Paul Lee Onn, Lim Hock Beng, and Mohinder Singh a/l Harnam Singh Kalsi) were added onto a new plaque at the main monument. Following the discovery of the War Crime Document WO235/884 of the 1946 Trial Proceedings (held in Changi, Singapore), the families applied for and received an official acknowledgement from the Kota Kinabalu City Hall that between 12 June and early July 1945, a Japanese kenpeitai had blacklisted the 8 civilians as detrimental elements supporting the allies and ordered them to be (unlawfully) killed. The original document is held at the National Archives in the United Kingdom. A copy of that document, certified by the National Archives, is held at the Sabah Museum. As the eight men were not guerrilla members from the Albert Kwok group, their families requested for a separate memorial wall to be constructed also at the Petagas War Memorial garden. After a positive meeting with the Sabah State Secretary, who supported the request, a site at the garden was identified for the memorial construction. The Sabah state government led by Deputy Chief Minister and State Tourism Minister Christina Liew also plans to convert the whole Memorial garden into a historical site and tourist attraction in the city of Kota Kinabalu. By early 2021, it is hoped that a memorial hall will have also been built at the site of the war memorial.\nDescription\nThe memorial park is located near the Kota Kinabalu International Airport (Terminal 2) in the Putatan district, not far from the Putatan railway station. Surrounded by a white metal fence, the tree-lined terrain covers an area of 7,800 square metres.  To the left of the main entrance, beside park benches, is an information board with an overview of the history of the memorial in Malay and English languages.\nAbove the main entrance gate is an archway inscribed with the words \"Petagas War Memorial\" in Malay, Chinese and English.  From there, an 80-metre pathway leads towards the monument, a structure covered on all four sides with separate 2 metre high metal plates. Three of the metal plates inform about the massacre and its historical background in Malay, Chinese and English languages, while the fourth metal plate is an epitaph and contains the names of the dead. Immediately in front of the memorial is a 10 x 5&nbsp;m enclosed grass area where the remains of the dead are buried.\nWest side\nplanting project between Lions Club of Incheon Dong Yang, South Korea and Lions Club of Kota Kinabalu Damai, Malaysia at the memorial site in 2006.]]\nThe epitaph – the metal plate on the west side facing the cemetery – bears the words:\n{|\n|style=\"width: 5em\"|\n|style=\"width:10em\"|\n|}\nThis is followed by a list of all men buried at Kota Kinabalu and Labuan. Since the majority of the dead were Chinese, Chinese characters dominate the epitaph.\nNorth side\nThe metal plate on the north side begins with the title \"Epitaph for the Kinabalu Guerilla Movement Martyrs\" and an altered quotation from the Gospel of John:\n{|\n|style=\"width: 5em\"|\n|style=\"width:50em\"|\nGreater Love hath no man than this, that a man lay down his life for his country. (J.P.)\n|}\nEast side\nThe metal plate on the east side contains information in Chinese.\nSouth side\nThe south side corresponds in structure and content of the north side, in the Malay language.\nFootnotes\nReferences\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\nFurther reading\n*\n*\n*\nExternal links"
    }
  ]
}