{
  "content": [
    {
      "type": "text",
      "text": "# Petarwar block\n\n| subdivision_type        = Country\n| subdivision_name        =\n| subdivision_type1       = State\n| subdivision_name1       = Jharkhand\n| subdivision_type2       = District\n| subdivision_name2       = Bokaro\n| established_title       =\n| established_date        =\n| founder                 =\n| named_for               =\n| government_type          = Representative democracy\n| governing_body          =\n| unit_pref               = Metric\n| area_footnotes          =\n| area_rank               =\n| area_total_km2          = 307.31\n| elevation_footnotes     =\n| elevation_m             = 237\n| population_total        = 132,150\n| population_as_of        = 2011\n| population_rank         =\n| population_density_km2  = auto\n| population_demonym      =\n| population_footnotes    =\n| leader_title1           =\n| leader_name1            =\n| demographics_type1      = Language\n| demographics1_title1    = Official\n| demographics1_info1     = Hindi\n| demographics1_title2    = Additional&nbsp;official\n| demographics1_info2     = Urdu\n| demographics_type2      = Literacy (2011)\n| demographics2_title2    = Total literates\n| demographics2_info2     = 69,942 (62.33%)\n| timezone1               = IST\n| utc_offset1             = +5:30\n| postal_code_type        = PIN\n| postal_code             =  829121 (Petarwar), 829123 (Tenughat Dam)\n| area_code_type          = Telephone/STD code\n| area_code               = 06549\n| registration_plate      =  JH-09\n| blank1_name_sec1        = Lok Sabha constituency\n| blank1_info_sec1        = Giridih\n| blank2_name_sec1        = Vidhan Sabha constituency\n| blank2_info_sec1        = Gomia, Bermo\n| website                 =\n| footnotes               = CD Block\n}}\nPetarwar (also spelled Peterwar) is a community development block that forms an administrative division in the Bermo subdivision of the Bokaro district, Jharkhand state, India.\nOverview\nBokaro district, a part of the Chota Nagpur Plateau, has an undulating surface with an altitude varying between 200 and 282&nbsp;m. Topographically, the entire area is divided into three parts – the Bokaro uplands in the west, the Bokaro-Chas uplands in the middle, and the Barakar basin in the east. The general slope of the region is from the west to the east. The main rivers are the Damodar, Garga, Parga, Konar, and Gobei. The district, covered with hills and forests, is a mining-industrial area. With the construction of the gigantic Bokaro Steel Plant in the nineteen sixties, it has become the focal point of this district.\nMaoist activities\nJharkhand is one of the states affected by Maoist activities. , Bokaro was one of the 14 highly affected districts in the state., Bokaro was identified as one of the 13 focus areas by the state police to check Maoist activities.\nGeography\nPetarwar is located at .\nPetarwar CD block is bounded by Bermo CD block on the north, Jaridih and Kasmar CD blocks on the east, Gola CD blocks, in Ramgarh district, on the south and Gomia CD block on the west.\nPetarwar CD block has an area of 307.31&nbsp;km2. It has 23 gram panchayats, 65 villages and 1 census town. Petarwar police station is located in this CD block. Headquarters of this CD block is at Petarwar.\nDemographics\nPopulation\nAccording to the 2011 Census of India, Peterwar CD block had a total population of 132,150, of which 127,617 were rural and 4,533 were urban. There were 68,127 (52%) males and 64,023 (48%) females. The population in the age range 0-6 years was 19,946. Scheduled Castes numbered 19,620 (14.85%) and Scheduled Tribes numbered 18,349 (13.88%).\nTenu with a population of 4,533 in 2011 is the only census town in Petarwar CD block.\nLarge villages (with 4,000+ population) in Petarwar CD block are (2011 census figures in brackets): Petarwar (5,060), Gharwatanr Baludih (4,248), Champi (5,864), Khetko (8,057), Chalkari (7,895), Pichhri (10,581) and Angwali (9,059).\nLiteracy\ncensus the total number of literate persons in Peterwar CD block was 69,942 (62.33% of the population over 6 years) out of which males numbered 42,745 (73.85% of the male population over 6 years) and females numbered 27,197 (50.06% of the female population over 6 years). The gender disparity (the difference between female and male literacy rates) was 23.79%.\ncensus, literacy in Bokaro district was 73.48% , Literacy in Jharkhand was 66.41% in 2011.\nLiteracy in India in 2011 was 74.04%.\nSee also – List of Jharkhand districts ranked by literacy rate\nLanguage\nHindi is the official language in Jharkhand and Urdu has been declared as an additional official language. Jharkhand legislature had passed a bill according the status of a second official language to several languages in 2011 but the same was turned down by the Governor.\nIn the 2001 census, the three most populous mother tongues (spoken language/ medium of communication between a mother and her children) in Bokaro district were (with a percentage of the total population in brackets): Khortha (41.08%), Hindi (17.05%) and Santali (10.78%). In the 2011 census, scheduled tribes constituted 12.40% of the total population of the district. The five most populous mother tongues were (with a percentage of ST population in brackets): Santali (70.12%), Munda (17.05%), Oraon (5.90%), Karmali (4.23%) and Mahli (3.23%).\nEconomy\nLivelihood\nIn Peterwar CD block in 2011, amongst the class of total workers, cultivators numbered 22,292 and formed 39.01%, agricultural labourers numbered 15,680 and formed 27.44%, household industry workers numbered 1,135 and formed 1.99% and other workers numbered 18,035 and formed 31.56%. Total workers numbered 57,142 and formed 43.24% of the total population, and non-workers numbered 75,008 and formed 56.76% of the population.\nNote: In the census records a person is considered a cultivator, if the person is engaged in cultivation/ supervision of land owned. When a person who works on another person's land for wages in cash or kind or share, is regarded as an agricultural labourer. The household industry is defined as an industry conducted by one or more members of the family within the household or village, and one that does not qualify for registration as a factory under the Factories Act. Other workers are persons engaged in some economic activity other than cultivators, agricultural labourers and household workers.  It includes factory, mining, plantation, transport and office workers, those engaged in business and commerce, teachers, entertainment artistes and so on.\nInfrastructure\nThere are 62 inhabited villages in Peterwar CD block. In 2011, 53 villages had power supply. 2 villages had tap water (treated/ untreated), 62 villages had well water (covered/ uncovered), 62 villages had hand pumps, and all villages had drinking water facility. 14 villages had post offices, 14 villages had sub post offices, 9 village had telephone (land line) and 50 villages had mobile phone coverage. 62 villages had pucca (hard top) village roads, 33 villages had bus service (public/ private), 6 villages had autos/ modified autos, and 22 villages had tractors. 5 villages had banks branches, 4 villages had agricultural credit societies, no village had cinema/ video hall, 1 village had public library and public reading room. 32 villages had public distribution system, 19 villages had weekly haat (market) and 42 villages had assembly polling stations.\nTenughat Dam\nTenughat Dam was constructed across the Damodar River in 1978 by the Government of Bihar, outside the control of the Damodar Valley Corporation.\nAgriculture\nThe average annual rainfall in Bokaro district is 1291.2&nbsp;mm. The soil is generally laterite and sandy. 39.21% of the total area is under agriculture. It is generally a single monsoon-dependent crop. 9.90% of the cultivable land is under horticulture. Rice and maize are the main crops. Bajra, wheat, pulses and vegetables are also grown.\nBackward Regions Grant Fund\nBokaro district is listed as a backward region and receives financial support from the Backward Regions Grant Fund.  The fund created by the Government of India is designed to redress regional imbalances in development. As of 2012, 272 districts across the country were listed under this scheme. The list includes 21 districts of Jharkhand.\nEducation\nIn 2011, amongst the 62 inhabited villages in Peterwar CD block, all villages had primary schools, 44 villages had one primary school and 18 villages had more than one primary school. 40 villages had at least one primary school and one middle school. 9 villages had at least one middle school and one secondary school. Bermo (small block with only 3 inhabited villages) and Peterwar were the only CD Blocks in Bokaro district where all inhabited villages had primary schools. Peterwar CD block had 2 senior secondary schools and 1 degree college.\nHealthcare\nIn 2011, amongst the 62 inhabited villages in Peterwar CD block, 4 villages had primary health centres, 15 villages had primary health sub-centres, 8 villages had maternity and child welfare centres, 2 villages had TB clinics, 2 villages had allopathic hospitals, 1 village had an  alternative medicine hospital, 4 villages had  dispensaries, 2 villages had  veterinary hospitals, 4 villages had medicine shops and 40 villages had no medical facilities.\nReferences"
    }
  ]
}