{
  "content": [
    {
      "type": "text",
      "text": "# Peter Schwarzenbauer\n\n| birth_place        = Weißenburg in Bayern, Germany\n| death_date         =\n| death_place        =\n| death_cause        =\n| nationality        = German\n| education          =\n| alma_mater         = Munich University of Applied Sciences\n| occupation         =\n| years_active       =\n| title              =\n| term               =\n| predecessor        =\n| successor          =\n| spouse             =\n| children           =\n| parents            =\n}}\nPeter Schwarzenbauer (born October 19, 1959) is a German manager and member of the Board of BMW AG. He is responsible for the MINI, BMW Motorrad, Rolls-Royce and Aftersales BMW Group.\nEarly life and education\nSchwarzenbauer spent his school years in Munich and Brazil, where he graduated from high school in Nova Friburgo. From 1980 to 1984, he studied business administration with a focus on marketing at the University of Applied Sciences in Munich and completed his studies with a degree in business administration (FH).\nCareer\nAfter completing his studies, he began working for BMW AG's central marketing department as supervisor for overseas markets. In 1988, he was appointed as head of product events in marketing and sales. From 1990 to 1992, he worked as a business development manager in the Motorcycle Division of the BMW of North America. Two years later, he took over the sales management for Europe at BMW Motorrad in Munich. In 1994, Schwarzenbauer made the move to Porsche AG, where he became sales manager for Germany. From 1997 to 2003, he was Managing Director of Porsche Iberica S. A and from 2003 to 2008, he was the President and CEO of Porsche Cars North America Inc. On April 1, 2008, Schwarzenbauer was appointed to the board of management of Audi AG for marketing and sales.\nIn April 2013, he returned to BMW as a board member and is since then responsible for the MINI, BMW-Motorrad, Rolls-Royce and Aftersales BMW Group brands.\nReferences"
    }
  ]
}