{
  "content": [
    {
      "type": "text",
      "text": "# Peter King (British Army officer)\n\n|death_date=\n|image=\n|caption=\n|nickname=\n|birth_place= Caxton, Cambridgeshire\n|death_place= Lake Wahapo, nr Whataroa, New Zealand\n|allegiance=\n|branch=  British Army New Zealand Army\n|serviceyears=1937 to 1946 (British Army)1950 to 1952 & 1954 to 1960 (New Zealand Army)\n|rank=Major\n|unit=No. 4 CommandoRoyal New Zealand Artillery  Royal Army Dental Corps\n|commands=\n|battles=\n* Second World War\n** Operation Overlord\n** Operation Infatuate\n* Korean War\n* Kashmir (UN Observer Group)\n|awards=Military Cross (1944)Distinguished Service Order (1951)\n|relations=\n|laterwork=Chief Park Ranger, Westland National Park (1960-death)\n}}\nPeter Frank King  (30 October 1916 – 12 December 1962) was a British Commando in World War II, who was commissioned in the field and awarded the Military Cross. He also served in Korea with the New Zealand Army, being awarded the Distinguished Service Order in 1951. King died in a car accident in 1962.\nEarly life\nPeter King was born in Caxton, Cambridgeshire; his parents were William Edgar King, a master builder, and his wife, Hilda May Pleasants. He was educated at Truro School.\nWorld War II service\nKing joined the Dental Corps in March 1939 and served as a non-technician, excelling as a weapons instructor. He spent two years in this role, rapidly becoming a drill sergeant at the Dental Corps' depot, but then applied to transfer to a fighting unit. This was refused. King was so frustrated that he and another soldier, Pte Leslie Cuthbertson, then 20 and from Newcastle-upon-Tyne took matters in their own hands; they planned and executed an unofficial and unauthorised raid on occupied France.\nIn April 1942, the two men stole weapons and grenades and also a motor-boat from the south west of England. They landed in France, where they attempted to cut a railway line using a hand grenade,Some accounts, e.g. [http://www.dnzb.govt.nz/dnzb/alt_essayBody.asp?essayID=5K10], say that King and Cuthbertson attacked, or attempted to derail, a troop train. among other activities. After three days, King and Cuthbertson stole a French motor boat to return to England. This failed and they were adrift in the Channel for twelve days until picked up by an Air Sea Rescue Service launch.A New Zealand source[http://www.rnza.co.nz/artillery_heritage/korean_war/kwar/peter_king.htm] states that the two men were 15 days adrift and that they were picked up by a Royal Navy destroyer. They were initially treated as spies.\nBoth men were court-martialled in July 1942. King lost his sergeant's rank but he was posted to the Commando training base at Achnacarry, as a private on detachment from the Duke of Cornwall's Light Infantry. After training, he was allocated to No. 4 Commando, on the request of its commander, 15th Lord Lovat who had heard of his French adventures. King was a highly successful recruit to the Commandos, becoming Troop Sergeant Major of C Troop before the D Day landings.\nNo. 4 Commando landed at La Brèche, near Ouistreham early on D Day, and they were detailed to fight through and link up with the airborne troops who had captured vital canal bridges (Operation Pegasus). King was prominent in the fighting in Normandy and during further distinguished actions in Flushing on Walcheren Island, during the Battle of the Scheldt, he was commissioned in the field (becoming a 2nd Lieutenant, later attaining the rank of Captain). He was subsequently awarded the Military Cross for crossing into enemy territory on Schouwen from North Beveland, for three days' reconnaissance and artillery \"spotting\". His unit's War Diary records that \"during this period the patrol managed to cover most of the area allotted to it, artillery fire was successfully directed on to certain targets and on groups of Germans when seen grouped together in the open\".\nCuthbertson's and King's exploits were told in a book, The Amateur Commandos, and a film, Two Men Went to War, was based on them.\nNew Zealand\nKing emigrated to New Zealand in 1946 and worked as a factory manager in Christchurch and as a bushman at Otautau, Southland. He joined the New Zealand Army in November 1950 for war service in Korea (Kayforce).\nIn November 1951, King—now a Captain with the 16th Field Regiment, Royal New Zealand Artillery—and a signaller, Gunner Derek Rixon, manned a forward artillery observation post (OP) for New Zealand artillery supporting a company of The King's Own Scottish Borderers on Hill 355. The first large scale Chinese attack was broken up by the guns but, when their OP's communications were cut, the two men joined in the close-quarters defence of the hill, each becoming wounded. After two hours, the position was abandoned and Rixon carried King to safety. For his \"tenacity, commitment and courage\", King was awarded the Distinguished Service Order and Rixon received the Distinguished Conduct Medal for his \"fine example of courage, commitment and comradeship while fighting alongside his officer\". King was described as \"the genius of gunner observers\" by a Scottish infantryman.\nFrom July to September 1952, King commanded 161st Battery before his return to New Zealand.\nOut of the Army, King returned to the South Island, working at Te Anau as a trail guide. Late in 1954, he was selected to join the United Nations Military Observer Group in India and Pakistan in Kashmir and he was commissioned as a Major in the regular Army. Between 1956 and 1959, King served on the Kashmir cease-fire line based at Srinagar.\nKing married Dorothy Woodham Graham on 18 April 1959 at Blenheim; she was a postmistress and daughter of the well-known alpine guide Alec Graham. The couple subsequently had a son and a daughter. He retired from the Army in 1960 and worked for the New Zealand Forest Service at Otautau before being appointed as the first Chief Park Ranger of Westland National Park in 1960.\nPeter King drowned on 12 December 1962. He was travelling to a meeting in Hokitika when his car, out of control, went into Lake Wahapo, South Westland. He is buried at Whataroa, South Westland.\nNotes\nFootnotes\nCitations\nReferences\n*\nExternal links\n*[http://www.rnza.co.nz/artillery_heritage/korean_war/kwar/peter_king.htm DSO citation]"
    }
  ]
}