{
  "content": [
    {
      "type": "text",
      "text": "# Peter Barton (historian)\n\nPeter Arthur Barton (born 28 March 1955) is a British military historian, author and filmmaker specialising in trench warfare during World War I. He has published extensively on military mining and aspects of battlefield archaeology on the Western Front, and led archaeological excavations that have been featured in several Time Team episodes. His work has led to the rediscovery of many tunnels, wartime panoramas and mass graves of soldiers.\nCareer\nIn 2005, Barton published Beneath Flanders Fields, a history of the British tunnellers fighting in the Ypres Salient from 1914 to 1918, for which he collaborated with Peter Doyle and Johan Vandewalle. Between 2006 and 2011, Barton rediscovered and published several panoramic perspectives of the Western Front which allow readers to view the battlefields from the Belgian coast to the British lines at the Somme.\n]]\nWith his colleagues Simon Jones and Jeremy Banning, he has been involved in several large-scale archaeological projects on the former Western Front, including the successful dig at Zonnebeke near Ypres in January 2008 that rediscovered the Vampire dugout and the successful dig in May 2010 at Mametz on the Somme for surviving pieces of a Livens Large Gallery Flame Projector. The Zonnebeke excavation was shown on UK television as \"The Lost WWI Bunker\" (Time Team Special 33, first aired on 10 November 2008), while the Mametz excavation was shown on UK television as \"The Somme's Secret Weapon\" (Time Team Special 42, first aired on 14 April 2011). A version of the latter documentary, entitled \"Breathing Fire\" was broadcast internationally in autumn 2011.\nBarton designed the Tunnellers Memorial at Givenchy-lès-la-Bassée, unveiled on 19 June 2010, to commemorate the action on 26 June 1916 for which William Hackett of 254th Tunnelling Company was awarded the Victoria Cross. The memorial stands at the site of the Shaftesbury Shaft and the Red Dragon Crater. Its dimensions,  high and  wide, mirror the standard interior proportions of mine galleries constructed by the tunnelling companies in the Flanders clays.\nWorking with the Red Cross' records at their headquarters in Geneva, Barton has examined records that have lain virtually untouched since 1918, and estimates that there could be 20 million sets of details, carefully entered on card indexes, or written into ledgers. Barton has also worked alongside Glasgow University Archaeology Research Division to locate and explore mass graves at the Pheasant Wood site at Fromelles. The Australian Government commissioned him to carry out research into the identities of the casualties discovered.\nLa Boisselle mine crater, August 1916\nSince 2011, Barton, Jones and Banning have been involved with the  La Boisselle Project of the La Boisselle Study Group, a long-term archaeological, historical, technological and genealogical study of a site at Ovillers-la-Boisselle in the Somme department in Picardy in northern France. The area (known in the First World War as Îlot de La Boisselle to the French, as Granathof to the Germans and as Glory Hole to the British) still has mine craters as well as traces of trenches, shelters and tunnels related to underground warfare in this former sector of the front line. Barton also wrote, produced and presented a television documentary on the archaeology of the World War I tunnels beneath La Boisselle, which was shown on UK television as \"The Somme: Secret Tunnel Wars\" (BBC Four, first aired on 20 May 2013).\nBarton also acts as co-secretary of the All Party Parliamentary War Graves and Battlefields Heritage Group. The group consists of members from both Houses of Parliament and exists to support the work of the Commonwealth War Graves Commission, to further educational programmes aimed at increasing knowledge of war heritage and battlefield sites, to support campaigners seeking to conserve and promote heritage sites, and to encourage best practice in multi-disciplinary battlefield archaeology.\nWorks\n*\n*The Battlefields of the First World War (1st edition - 2005)\n*The Somme - a new panoramic perspective, Constable, 2006,\n*Passchendaele - Unseen Panoramas of the Third Battle of Ypres, Constable, 2007,\n*The battlefields of the First World War: the unseen panoramas of the Western front, Constable in association with the Imperial War Museum, 2005,  (2nd edition – 2008)\n*Arras – The Spring 1917 Offensive in Panoramas including Vimy Ridge and Bullecourt, Constable, 2010,\n*The Somme – the unseen panoramas, Constable, (revised edition – 2011),\n*\"The Somme 1916: from Both Sides of the Wire\", a 3-part television programme, shown on BBC 2 in July/August 2016\nReferences\nExternal links\n*\n* [http://www.laboisselleproject.com/tunnellers/ La Boisselle Study Group] and [http://www.laboisselleproject.com La Boisselle Project]"
    }
  ]
}