{
  "content": [
    {
      "type": "text",
      "text": "# Peter Loveday (historian)\n\nPeter Loveday  (28 December 1925 - 20 August 2011) was an Australian metallurgist, historian and political scientist. He was field and executive director of the Australian National University's North Australia Research Unit in Darwin between 1981 and 1990 where he provided scholarly leadership.\nEarly life\nLoveday was born in Renmark, in South Australia, and was the eldest of seven children born to Ronald Redvers and Lizzie Hilary (née Mills) Loveday. In 1928 Lovedays father received a grant of land at Cungena, on the Eyre Peninsula, as a part of the soldier settlement scheme where they struggled to make a living due, in large part, to the hardship of clearing mallee and attempting to grow wheat during a period of drought. Later they also attempted mixed farming and raised sheep on the property but, with insufficient capital, poor seasons and a lack of support from the government they left in February 1936. They then settled on a property near Port Lincoln and later to Whyalla.\nWhile the family were living in Whyalla boarded in the larger town of Port Lincoln so that he could complete his secondary schooling at Port Lincoln High School. When he completed his leaving certificate in 1941 he topped the state in chemistry and was dux of the school. Not having the financial means to go to university Loveday then studied and received a Diploma of Metallurgy at Sydney Technical College in 1942. Loveday then worked as a metallurgist for BHP in Newcastle (1942 - 1948) and then for the Broken Hill Associated Smelters in Port Pirie (1949 - 1951).\nEarly academic career\nIn 1952 Loveday started a bachelor of arts with honours at the University of Sydney where he received two university medals, one in history and the other in philosophy and, in 1957, started his doctor of philosophy at the same university which he completed in 1962. The title of Loveday's thesis was \"The development of parliamentary government in New South Wales 1856-1870\" and received still further academic awards for his work. This was the first doctoral thesis in Australian history at the university. This research had been supported by a General Motors Holden Research Fellowship. This thesis later formed a major part of the monograph Parliament, Factions and Parties: The First Thirty Years of Responsible Government in New South Wales, 1856-1889 (1966), which he co-authored with his friend Allan Martin.\nFollowing this success Loveday was employed between 1959 and 1967 at the University of Sydney and the University of Adelaide. Between 1968 and 1981 he was a senior fellow in political science at the Australian National University at the Research School of Social Sciences (RSSS).\nLife in the Northern Territory\nIn 1981 Loveday was appointed the field director and executive director of the North Australian Research Unit (NARU), a campus of the Australian National University, in Darwin. This appointment was based, in part, of Loveday's existing interest in the political economy of the Northern Territory and his existing publications in this area.\nWhile at NARU Loveday encouraged the academics to publish on all topics related to north Australia  including its economy, ecology and history and there was a hugely increased number of publications coming from the centre. Loveday also encouraged many visiting scholars to come to NARU including many from overseas and many took part in research fellowships.\nWorking at NARU Loveday felt freed from many of the restriction present at large, more bureaucratic universities, and he embraced informality; this also meant that his relationship with University administration in Canberra could be strained. He was also known to \"lead from the front\" and spent much of his time mentoring, editing and improving the work of others. Former students and colleagues of Loveday said of him 'he was the person who made my career possible' and 'his skills as a mentor were unrivalled'.\nIn part due to Loveday's influence NARU began to highlight the importance and relevance of Aboriginal communities in the region and a number of the research projects commenced centred First Nations experience and knowledge in a way not regularly seen at this point.\nIn 1991 Loveday and his wife Baiba retired to Sydney but they maintained strong links to Darwin and he continued to work as a researched and writer. In 1992 Loveday was made a Member of the Order of Australia for his service to education in the Northern Territory.\nSelected publications\n*\n*\n*\nPersonal life\nIn 1952 Loveday married his first wife Ruth and they had two children together, Nicholas and Kate, and in 1986 the marriage ended. In 1988 he married Baiba Berzins who was an archivist and fellow historian.\nReferences"
    }
  ]
}