{
  "content": [
    {
      "type": "text",
      "text": "# Peter King (Australian politician)\n\n| birth_place = Bingara, New South Wales\n| death_date =\n| death_place =\n| nationality = Australian\n| spouse =\n| party = Liberal Party of Australia (2001&ndash;04, 2015&ndash;present)  Independent (2004–2015)\n| relations =\n| children =\n| residence =\n| alma_mater = University of Sydney  University of Oxford\n| occupation = Barrister\n| profession =\n| religion =\n| signature =\n| website =\n| footnotes =\n}}\nPeter Edward James King (born 29 June 1952) is an Australian politician who was a Liberal Party member of the Australian House of Representatives from November 2001 to October 2004, representing the seat of Wentworth, New South Wales.  King is also a barrister and an author.\nEarly life\nHe was born in Bingara, New South Wales, and was educated at the Shore School, where he was School Captain and Captain of the GPS Rugby 1st XV, Sydney University, where he resided at St. Paul's College, and Oxford University, where he gained an MA and was selected as a Rugby Blue against Cambridge. He was Rhodes Scholar for New South Wales in 1975.\nEarly political career\nHe was a member of the Woollahra Municipal Council and was Mayor 1990–91. He was NSW State President of the Liberal Party 1989–92. Throughout the 1990s King was a leading advocate of the Australian monarchy, opposing the push for an Australian republic. He was unsuccessful candidate for Liberal preselection at the 1994 Warringah by-election, losing to Tony Abbott. Between November 2001 and 2004 he held the seat of Wentworth in the Australian Parliament.\nOusting by Malcolm Turnbull\nIn 2003, after only two years in the federal Parliament, King was challenged for his Liberal endorsement in Wentworth by Malcolm Turnbull, then a wealthy merchant banker, Federal Treasurer of the Liberal Party and former head of the Australian Republican Movement. During the bitter pre-selection campaign, King accused Turnbull of branch stacking, by having local members transferring their membership to a branch that would decide the selection, what King referred to as \"branch stripping\".\nFollowing his preselection loss, on 3 September 2004 King announced that he would stand for Wentworth as an independent at the 2004 election. As a result, the traditionally Liberal electorate was turned into an electoral wildcard, with the contest becoming a three-person race between Turnbull, King and Labor candidate David Patch. During the campaign, Turnbull spent over A$600,000 on the campaign. While the Liberal primary vote fell 10.3 percent to 41.8 percent, King received 18 percent of the primary vote with a 57/43 Liberal/Labor preference split which brought Turnbull over the line, but on a reduced 55.5 percent two-party vote after a 2.4 percent swing it made Wentworth a marginal seat on paper for the first time since the 1993 election. For standing against a preselected Liberal party member, King was banned from the Liberal Party for ten years. His wife Fiona, daughter of former National Party leader Ian Sinclair, was banned for five years.\nReturn to politics\nIn 2015, King rejoined the Liberal Party and in July 2017, an article appeared in the Australian Financial Review reporting he was supporting reform of the Liberal Party preselection processes. King refused to comment when asked whether he would like to re-enter Federal Parliament. In August 2017 King and lawyer Matthew Bransgrove formed an organisation called CivilDefenceNow and began a series of lectures to Liberal Party branches in the Wentworth electorate on the dangers posed to Australia's national security by North Korea.\nLegal career\nKing was a barrister prior to entering politics and still practises. He was a Judicial Member of the Administrative Decisions Tribunal of NSW 1995–2001. He is the author of Limitation of Liability in Australian Maritime Law (1991), and a critique of climate change policy called The Challenge of the Commons (2015). King appeared in cases for farmers against banks during the drought between 2001 and 2009 helping to keep many farmers on their farms; and in commercial and constitutional cases including the cases of Spencer v Commonwealth (2010) and Gaynor v Chief of Defence Force.\nHe was a barrister for Gareth Ward.\nOther Posts\nKing is a member of the Sydney University Senate, was Chair of the Australian Heritage Commission 1998–2001, Chair of the World Heritage Committee in 2001–01, and President of the World Heritage Bureau in 2001–02. King was elected the President of Sydney College of Divinity in 2010, a position he still holds.\nReferences"
    }
  ]
}