{
  "content": [
    {
      "type": "text",
      "text": "# Petersburg, Delaware County, Iowa\n\n|subdivision_type1        = State\n|subdivision_name1        =\n|subdivision_type2        = County\n|subdivision_name2        = Delaware County\n|government_footnotes     =\n|government_type          =\n|leader_title             =\n|leader_name              =\n|leader_title1            =\n|leader_name1             =\n|established_title        =\n|established_date         =\n|timezone                 = Central (CST)\n|utc_offset               = -6\n|timezone_DST             = CDT\n|utc_offset_DST           = -5\n|elevation_footnotes      =\n|elevation_m              =\n|elevation_ft             =\n|coordinates              =\n|postal_code_type         =\n|postal_code              =\n|area_code                =\n|blank_name               =\n|blank_info               =\n|blank1_name              =\n|blank1_info              =\n|website                  =\n|footnotes                =\n}}\nPetersburg (formerly, Petersburgh) is an unincorporated community in Delaware County, Iowa, United States. It lies at an elevation of 1112 feet (339 m).\nGeography\nPetersburg is located at the junction of county highways C64 (160th Street) and D13 (300th Avenue). It lies between Colesburg and Earlville, east of Almoral, in the northern part of Bremen Township.\nHistory\nThe first building, a store, was built in Petersburg in 1873. The post office was established in 1874. Petersburg's population was 76 in 1902.\nSaints Peter and Paul parish is a Roman Catholic parish in the Archdiocese of Dubuque. The Saints Peter and Paul Church was completed and consecrated in 1906. It was constructed in cut-stone in the Gothic Revival style.  The interior contains an intricately carved high altar, dark woods and gold trim.\nEducation\nPetersburg is within the Western Dubuque Community School District. It is zoned to Dyersville Elementary School in Dyersville, Drexler Middle School in Farley, and Western Dubuque High School in Epworth.\nThe remaining Catholic grade school in the \"Spires of Faith\" Catholic church network, which operates Catholic churches in the area, is St. Francis Xavier Catholic School in Dyersville, and the secondary school is Beckman Catholic High School.\nIn 1987, the St. Boniface School (New Vienna) and SS. Peter & Paul School (Petersburg) merged to create Hennessy Catholic School. Beginning in the fall of 2013, the Hennessy Catholic School consolidated all its classes from New Vienna into the Petersburg building, and Archbishop Hennessy closed entirely in 2018.\nSee also\n*Robinson, Iowa\nReferences\n*"
    }
  ]
}