{
  "content": [
    {
      "type": "text",
      "text": "# Pete King (saxophonist)\n\nPeter Stephen George King (23 August 1929 &nbsp;– 20 December 2009) was a British jazz tenor saxophonist. He co-founded London's Ronnie Scott's jazz club and was its manager for almost fifty years.\nBiography\nKing was born in Bow, London, England. He's first professional work was with Jiver Hutchinson in 1947, before going on to join the bands of Kenny Graham, Teddy Foster, and Leon Roy. In 1948, he was first tenor in George Evans' Saxes ‘n’ Sevens with Tony Arnopp, Kenny Clare and Les Evans.\nHe played with Oscar Rabin 1948–50 and Kathy Stobart 1950–52. In September 1952 he recorded with the Ronnie Scott Quintet, which also included Dill Jones, Lennie Bush, and Tony Crombie. While playing with the bands Scott formed in the latter half of the 1950s, King was also a member of Jack Parnell's band, and shortly afterwards, together with other musicians left to form Scott's nine-piece orchestra featuring Scott and King on tenor saxes and other leading jazz musicians including Derek Humble (as), Jimmy Deuchar (tp), Ken Wray (tb), Benny Green (bs), Lennie Bush (b), and Tony Crombie (d).\nIn 1956, both King and Scott were members of the Victor Feldman Big Band.\nAfter the break-up, in 1959, of Tubby Hayes' and Ronnie Scott's The Jazz Couriers, of which King had been the manager, he and Scott opened Ronnie Scott's jazz club and King effectively gave up playing to run the club, which he continued to do for several years after Scott's death in 1996.\nBesides being responsible for the day-to-day running of the club, King was instrumental to the negotiations between the Musicians' Union and the American Federation of Musicians to lift the former's ban on American musicians. Although there had been occasional exchanges for specific concerts, such as Stan Kenton and Louis Armstrong, the new deal provided for more regular exchanges of British and American players. As a direct result of the deal, the Tubby Hayes Quartet performed at the Half Note Club in New York and Zoot Sims was booked for a month-long residency at Ronnie's in November 1961. The success of the agreement led to leading saxophonists, including Sonny Stitt, Stan Getz, Johnny Griffin, Roland Kirk, Al Cohn, Ben Webster and Benny Golson, following suit.\nDiscography\nAs sideman\n* Jon Eardley, Namely Me (Spotlite, 1979)\n* Georgie Fame, Seventh Son (CBS, 1969)\n* Kenny Graham, Mango Walk (Esquire, 1976)\n* Kenny Graham, Afro Kadabra Caribbean Suite (Esquire, 1987)\n* Richard Kerr, From Now Until Then (Warner Bros., 1973)\n* R&J Stone, We Do It (RCA, 1976)\n* Dakota Staton, ''Dakota '67 (London, 1967)\nSee also\n*The Piano Has Been Drinking (Not Me) (An Evening with Pete King)\nReferences\nExternal links\n*\n*[https://archive.today/20130112173130/http://vzone.virgin.net/davidh.taylor/peking.htm Pete King] information site\n*[https://www.telegraph.co.uk/news/obituaries/culture-obituaries/music-obituaries/6860255/Pete-King.html Pete King] obituary in The Daily Telegraph''\n*[https://web.archive.org/web/20100525000811/http://www.timesonline.co.uk/tol/comment/obituaries/article6965334.ece \"Pete King: manager of Ronnie Scott's jazz club\"] obituary in The Times\n*[https://www.independent.co.uk/news/obituaries/pete-king-the-power-behind-the-throne-at-ronnie-scotts-jazz-club-1848141.html \"Pete King: The power behind the throne at Ronnie Scott's jazz club\"] obituary The Independent\n*[https://www.theguardian.com/music/2009/dec/23/pete-king-obituary John Fordham, \"Pete King obituary: Jazz saxophonist and co-founder of Ronnie Scott's who strove to keep the club afloat\"] obituary in The Guardian, 23 December 2009\n*[https://www.telegraph.co.uk/news/obituaries/culture-obituaries/music-obituaries/6860255/Pete-King.html Pete King] obituary in The Telegraph"
    }
  ]
}