{
  "content": [
    {
      "type": "text",
      "text": "# Peter Hoffmann (historian)\n\n| image = Peter C. Hoffmann.jpg\n| image_size =\n| alt =\n| caption = Hoffmann in 2008\n| native_name =\n| native_name_lang =\n| birth_name = Peter C. W. Hoffmann\n| birth_date =\n| birth_place = Dresden, Saxony, Germany\n| death_date =\n| death_place = Montreal, Canada\n| death_cause =\n| nationality = German\n| citizenship =\n| other_names =\n| occupation = Professor\n| period =\n| known_for =\n| title =\n| boards =\n| spouse =\n| partner =\n| children =\n| parents =\n| relatives =\n| awards =\n| website =\n| education =\n| alma_mater =\n| thesis_title = The diplomatic relations between Wurtemberg and Bavaria from the Crimean War and the beginning of the Italian Crisis\n| thesis_url =\n| thesis_year = 1961\n| school_tradition =\n| doctoral_advisor = Franz Schnabel\n| academic_advisors =\n| influences =\n| era =\n| discipline = History\n| sub_discipline = German resistance against Nazism\n| workplaces = McGill University\n| doctoral_students =\n| notable_students =\n| main_interests =\n| notable_works =\n| notable_ideas =\n| influenced =\n| signature =\n| signature_alt =\n| signature_size =\n| footnotes =\n}}\nPeter C. W. Hoffmann  (13 August 1930 – 6 January 2023) was a German-Canadian historian who was the William Kingsford Professor in the Department of History at McGill University. His principal area of research dealt with the German resistance against Nazism, and in particular, the resistance efforts of Claus von Stauffenberg. Hoffmann lived in Canada and in Germany.\nLife\nHoffmann was born in Dresden, Germany, on 13 August 1930 and grew up in Stuttgart. He was the son of , a former director of the Wurtemberg State Library and University Library of Tübingen. After studying at the universities of Stuttgart, Tübingen, Zurich, Northwestern University and Munich he received his doctorate in 1961 from Franz Schnabel following his thesis defence on The diplomatic relations between Württemberg and Bavaria during the Crimean War and until the beginning of the Italian Crisis. In 1965 he became a postdoctorate at the University of Northern Iowa. In 1970 he took up a teaching position on German History at McGill University in Montreal. Hoffmann was the William Kingsford Professor of History at McGill and a fellow of the Royal Society of Canada.\nHoffmann died on 6 January 2023, at the age of 92.\nWorks\n* Widerstand, Staatsstreich, Attentat - Der Kampf der Opposition gegen Hitler. 4. new reworked and expanded edition. Piper, München 1985. .\n* German Resistance to Hitler. Harvard University Press, Cambridge, Massachusetts 1989. .\n* Stauffenberg und der 20. Juli 1944. Beck, Munich 1998. .\n* ''Hitler's Personal Security. Da Capo Press, Boston 2000 [1979]. .\n* Stauffenbergs Freund. Die tragische Geschichte des Widerstandskämpfers Joachim Kuhn. C. H. Beck, Munich 2007. .\n* Claus Schenk Graf von Stauffenberg. Die Biographie. Fourth, expanded edition. Pantheon, Munich 2009. .\n* Carl Goerdeler and the Jewish Question, 1933–1942. Cambridge University Press, Cambridge 2011. .\n* Behind Valkyrie. German Resistance to Hitler. Documents''. McGill-Queen's University Press, Montreal & Kingston, London, Ithaca 2011. .\n* Carl Goerdeler gegen die Verfolgung der Juden. Böhlau Verlag, Cologne, Weimar, Vienna 2013. .\nLiterature\n* T. Lahme: Ein Leben im Widerstand. Zum 80. Geburtstag von Peter Hoffmann. In: FAZ, 9. August 2010, S. 28.\nReferences\nExternal links\n*\n* [http://webpages.mcgill.ca/staff/group3/phoffm/web/ Website with publications by Peter Hoffmann the McGill University server]"
    }
  ]
}