{
  "content": [
    {
      "type": "text",
      "text": "# Peter Maxwell Ewart\n\n| birth_place   = Kisbey, Saskatchewan, Canada\n| death_date    =\n| death_place   = Surrey, British Columbia, Canada\n| nationality   =\n| movement      =\n| spouse        =  Susan Jane Nickel (1916&ndash;1959, m. 1948)\n| awards        =\n| patrons       =\n| imagesize     =\n| field         = Painter\n| training      = Sir George Williams College, Art Association of Montreal, Commercial Illustration Studio of New York City\n| works         =\n| influenced by =\n| influenced    =\n}}\nPeter Maxwell Ewart (7 April 1918 – 23 January 2001) was a Canadian painter. He is especially known for his depictions of the Cariboo country of British Columbia and the Canadian Rockies. During his career, Ewart had over 40 solo exhibitions in Canada, the United States, and the United Kingdom.\nBiography\nPeter Maxwell Ewart was born in Kisbey, Saskatchewan, on 7 April 1918. At a young age his family moved to Montreal, where he attended West Hill High School. After taking correspondence courses in commercial illustration, he attended Sir George Williams College and the Art Association of Montreal. He next took instruction at the Commercial Illustration Studio of New York City, where he was introduced to avant-garde design.\nDuring World War II, while serving with the Royal Canadian Air Force as a wireless operator, he was stationed at Bella Bella in British Columbia. Ewart relocated to Vancouver in 1947, and one year later he married. In 1958 he moved to Langley in the Fraser Valley. The following year his wife Susan passed away. They had one daughter, Linda. Ewart was instrumental in the planning and construction of the Langley Arts Centre. He died in Surrey, British Columbia, on 23 January 2001.\nCareer\nEwart's training had led him to see the poster as a true art form. In Montreal, he was commissioned by the Canadian Pacific Railway (CPR) to produce a ski poster in 1939. During the next two decades, he completed 24 posters and two serigraphic prints for the CPR and Canadian Pacific Airlines. Twenty-one of his graphics are featured in the book Posters of the Canadian Pacific, by Marc H. Choko and David L. Jones (Firefly Books, 2004).\nHis first forays into painting consisted of marine views which gained a following. Some of his stated influences were Maurice Cullen and Clarence Gagnon. In 1971, one of his works was presented to Odessa, by its sister city of Vancouver.\nMuch of Ewart's subject matter was found in the Cariboo region of British Columbia between Spences Bridge and Ashcroft. He also painted the Canadian Rockies. His canvases often have a touch of red as a focal point, and frequently include people and horses. He variously tried to capture a sense of loneliness, the warmth of winter cabins, campfires and morning frosts. Ewart was a slow and meticulous painter, sometimes taking up to a year to finish a picture. One contemporary criticism was that although well done, his paintings approached that of a standard product and evolved little.\nLegacy\nIn 2015, Kwantlen Polytechnic University conferred a posthumous honorary degree on Ewart for his role as a co-founder of Langley Community Music School. Three years later, his name was bestowed on Peter Ewart Middle School, located in Willoughby within the Township of Langley.\nEwart's works are found in the collection of the Langley Centennial Museum and Exhibition Centre.\nExhibitions\n*Alex Fraser Galleries, Vancouver\n*Royal Canadian Academy of Arts\n*Royal Academy of Arts (London, England)\n*Montreal Museum of Fine Arts\n*Quebec Provincial Museum\n*Canadian National Exhibition (Toronto)\n*Mid-Century Exposition of Canadian Painting\n*Calgary Stampede (1967)\n*Alwin Galleries (London, England, 1972)\n*Langley Arts Centre\n*Expo 86, Vancouver\n*Peter Ewart Middle School (Langley, 2020)\nReferences\nExternal links\n*\n*[http://www.pegasusgallery.ca/artist/Peter_Ewart.html Peter Ewart], Pegasus Gallery"
    }
  ]
}