{
  "content": [
    {
      "type": "text",
      "text": "# Peter Clarke (historian)\n\nPeter Frederick Clarke,  (born 21 July 1942) is an English historian.\nEducation\nPeter Clarke studied at Eastbourne Grammar School and St John's College, Cambridge, where completed his B.A. in 1963, his M.A. and Ph.D. in 1967, and his Litt.D. in 1989.\nHe is married to the Canadian cultural historian, Maria Tippett.\nCareer\nHis 1971 work Lancashire and the New Liberalism challenged George Dangerfield's thesis, expressed in The Strange Death of Liberal England, that the decline of the Liberal Party was inevitable. Clarke argued that the Liberals successfully modified their policies to embrace the progressive politics of New Liberalism, which helped them capture working class votes in the former Conservative stronghold of Lancashire. It was the First World War, Clarke maintained, that caused the Liberals' decline. His next work, Liberals and Social Democrats (1978), examined the relationship between liberalism and socialism by focusing on four liberal and social democratic intellectuals: Graham Wallas, L. T. Hobhouse, J. A. Hobson and J. L. Hammond.\nClarke's The Keynesian Revolution in the Making, 1924–1936 (1988) was a study of John Maynard Keynes's economic proposals from his 1923 work A Tract on Monetary Reform to his 1936 General Theory of Employment, Interest and Money.\nClarke was reader in modern history University College London from 1978 to 1980, lecturer in history from 1980 to 1987 at the University of Cambridge, a fellow of St John's College, Cambridge from 1980 to 2000, tutor at St John's College from 1982 to 1987, reader in modern history from 1987 to 1991, professor of modern British history from 1991 to 2004.\nClarke was elected a Fellow of the British Academy for the Humanities and Social Sciences in 1989.\nHe was master of Trinity Hall, Cambridge from October 2000 to 2004.\nHe is a UK citizen and also, since 1998, a Canadian citizen.\nWorks\n*Lancashire and the New Liberalism (1971).\n*Liberals and Social Democrats (1978).\n*The Keynesian Revolution in the Making (1988).\n*A Question of Leadership: from Gladstone to Thatcher (1991, second edition 1999 (renamed From Gladstone to Blair)).\n*Hope and Glory: Britain 1900-1990 (1996, second edition, 2004 (renamed Hope and Glory: Britain 1900-2000)).\n*Understanding Decline: perceptions and realities of British economic performance (joint editor, 1997).\n*The Keynesian Revolution and its Economic Consequences (1998).\n*The Cripps Version: The Life of Sir Stafford Cripps (2002).\n*The Last Thousand Days of the British Empire (2007). Bloomsbury Press,\n*Keynes: The Most Influential Economist of the 20th Century (2009).\n*''Mr Churchill's Profession: Statesman, Orator, Writer (2013).\n*The Locomotive of War: Money, Empire, Power, and Guilt (2017). Bloomsbury Press,\n*Keynes in Action, Truth and Expediency in Public Policy'' (2022). Cambridge University Press\nReferences"
    }
  ]
}