{
  "content": [
    {
      "type": "text",
      "text": "# Pete Wareham\n\n| birth_place       =\n| genre             = Jazz, rock, avant-garde\n| occupation        = Musician, composer and producer\n| instrument        = Tenor and baritone saxophone\n| years_active      = 1997–present\n| associated_acts   = Acoustic Ladyland, Polar Bear, Melt Yourself Down\n| website           =\n}}\nPete Wareham is a British saxophonist, composer and band leader. He led the genre-defying North African/punk/jazz/dance band Melt Yourself Down and was a member of Nadine Shah’s Mercury Prize-nominated band, Seb Rochford’s Pulled By Magnets and also ran the influential group Acoustic Ladyland. Formerly of Rochford’s now disbanded Mercury Prize-nominated Polar Bear, Wareham has also played saxophone and flute with The Smile, Sons Of Kemet,  Mica Levi, James Chance, Supergrass, Ben E King.\nWareham composed the soundtrack for the BBC's new prime time Saturday night sitcom King Gary.\nCareer\nWareham graduated from Leeds College of Music in 1997 and later continued to pursue post graduate studies at the Guildhall School of Music and Drama. Wareham played tenor and baritone saxophone in the National Youth Jazz Orchestra during 1997–1999. His continued success as a saxophonist led to many notable performances, including appearances at New York's Blue Note Club, London's Ronnie Scott's Jazz Club as well as jazz venues all over the world.\nWareham formed Acoustic Ladyland in 2001. The band was originally intended, as the name suggests, to be an acoustic improv band reinterpreting the music of Jimi Hendrix. They became a distinctive group of improvisers with a contemporary rock and roll attitude. Acoustic Ladyland won the BBC Jazz Award Best Band 2005 and were also nominated for Best Album.\nIn July 2011, Wareham announced the band's final performance before disbanding Acoustic Ladyland and forming Melt Yourself Down in 2012. Initially signed to The Leaf Label they then signed with Decca in the summer of 2019. Wareham prefers not to be pigeon-holed in the jazz scene, taking influences from hiphop, rock, pop and global music, especially North African and South American among many. ‘My favourite kind of jazz is when it feels dangerous’ Wareham says and he wants to put people back in touch with the time when jazz ‘was subversive, wild and dirty.’ Described by the music press as ‘a vivacious, phantasmagorical melting pot’  and by The Times as ‘Melodically adept, rhythmically inspired…mind blowing magnificence’ Melt Yourself Down are equally well known for their blistering live sets.\nWareham has been developing his abilities as a producer since 2010 and has co-produced all the Melt Yourself Down albums. Since 2018 he has been mixing, editing and recording in his home studio in South East London.\n2020’s Caribbean Fire Dance which was MYD’s contribution to Blue Note’s Blue Note Reimagined album, was mostly recorded there and was mixed by Wareham. As of 2020 he has begun producing other artists also including Balderdasch.\nAwards and honours\n*Nadine Shah - Mercury Prize nominated 2018.\n*Sons Of Kemet - Mercury Prize Nominated 2018\n*Polar Bear - Mobo Award nominated 2015\n*Paul Hamlyn Award - Musical Composition winner 2015, Award Judge 2018\n*Polar Bear - Mercury Prize nominated 2005 & 2014\n*Acoustic Ladyland - BBC Jazz Awards ‘Best Band’ 2005\n*Acoustic Ladyland - Jazzwise Magazine Album of the Year 2004 & 2005\n*Jerwood Foundation - ‘Take 5 Award’ Recipient 2005.\n*Prizewinner - Young Jazz Musician of the Year, 1997.\nDiscography\n;With The Smile\n*\n;With Various Artists\n*\n;With Nadine Shah\n*\n*\n;With Acoustic Ladyland\n*\n*\n*\n*\n;With Polar Bear\n*\n*\n*\n*\n*\n*\n;With Melt Yourself Down\n*\n*\n*\n*\n*\n;With Paul Epworth\n*\nReferences\nExternal links\n* [http://www.meltyourselfdown.com Melt Yourself Down]\n* [http://www.polarbearmusic.com/ Polar Bear - Official Website]"
    }
  ]
}