{
  "content": [
    {
      "type": "text",
      "text": "# Peter and Gunvor Edwards\n\n-->\n| death_date = Gunvor:\n----Peter:\n| occupation = Illustrators\n}}\nPeter Edwards (1934 – 2017) and Gunvor Edwards (1934 – 2014) were two Swedish-English impressionistic artists known for illustrating several of The Railway Series books by the Rev. W. Awdry from 1963 to 1972. Gunvor died at the age of 80 on 23 April 2014 from dementia, and Peter died at the age of 83 on 3 April 2017 from cancer.\nRailway Series books\nThey illustrated the books:\n*Stepney the \"Bluebell\" Engine\n*Mountain Engines\n*Very Old Engines\n*Main Line Engines\n*Small Railway Engines\n*Enterprising Engines\n*Oliver the Western Engine\n*Duke the Lost Engine\n*Tramway Engines\nThe Railway Series books\nAfter John T. Kenney resigned from the Railway Series due to failing eyesight, editor Eric Marriot decided to ask Swedish-born artist Gunvor Edwards to see whether she would try her hand at some illustrations for the latest book, Stepney the \"Bluebell\" Engine. Gunvor accepted the commission and decided to start with a complex illustration, the Diesel standing alongside the other engines in their shed.\nHowever, Gunvor had difficulty with the small space she was required to work with (about ten by six inches) and soon realised that duplicating the work of previous illustrators was not going to be easy. So, she turned to her husband, Peter, who was, as he put it, \"trying to be a 'serious' artist\". And although he was no more able to imitate earlier work in the Railway Series any better than his wife, both Marriot and the Reverend W. Awdry were satisfied with his pictures. Although Edwards' style was more impressionistic than that of any previous Railway Series artist, Wilbert liked his work because he drew from life and \"obviously had an affection for the characters\".\nInspiration\nEdwards often went on location to sketch real locomotives and landscapes to get inspiration for illustrations. \"At a time in our life\", said Edwards, \"of short funds and few breaks, the family had an excuse to explore the Welsh Coast, Lakeland, Cornwall and Devon, Sussex and Kent with a steam trip to cap it all!\" This kind of dedication impressed the author; as he recalled, \"Peter was so keen on getting authentic drawings of the locomotives that he went down to Llanberis in January to visit workshops of the Snowdon Mountain Railway\".\nWorking life\nEdwards continued as illustrator up until 1972 with the publication of the final book in the series, Tramway Engines. He even illustrated the \"Surprise Packet\" in 1971 at a time when Awdry had writer's block. Peter also did the box art for the 1965 Meccano Percy set. It is thought that his illustrations were of some inspiration to Edgar Hodges in his illustrations of the 1979 and 1980 annuals.\nPeter Edwards often worked for the Central Office of Information as an illustrator and sculptor.\nPeter worked with museum and exhibition designer Neal Potter on several projects including the British Pavilion at Expo'85 in Japan, London's Museum of the Moving Image and the Root Zone at the RHS\nReferences"
    }
  ]
}