{
  "content": [
    {
      "type": "text",
      "text": "# Philippine Independence Medal\n\nThe Philippine Independence Medal is a military award and decoration of the Republic of the Philippines that was created by order of the Philippine Army Headquarters on 3 July 1946 as the Philippine Independence Ribbon. The medal was added in 1968. The medal recognizes those members of the military who participated in multiple Philippine Commonwealth military operations during the years of World War II.\nAward criteria\nTo be awarded the Philippine Independence Medal, a service member must have previously received both the Philippine Defense Medal and the Philippine Liberation Medal (authority for wear must be recorded before 24 November 1954). The award criteria effectively awarded the medal to anyone who had participated in both the initial resistance against Japanese invasion and also in the campaigns to liberate the Philippines from Japanese occupation from October 1944 to September 1945.\nThe decoration was also authorized for award to the United States and other foreign militaries, with a number of retroactive awards presented between 1945 and 1948. A famous American recipient was General of the Army Douglas MacArthur.\nThe Philippine Independence Medal was originally awarded as a service ribbon only, and it was not until 1968, that a full-sized medal was authorized and added by President Ferdinand Marcos.\nNotable recipients\n* Ramon A. Alcaraz\n* Frank A. Armstrong\n* Donald Blackburn\n* Jose Calugas\n* Edwin A. Doss\n* Richard W. Fellows\n* Leslie Fernandez\n* Wendell Fertig\n* Harold K. Johnson\n* Emilio S. Liwanag\n* Douglas MacArthur\n* Paul J. Mueller\n* Emmett O'Donnell, Jr.\n* Lorenzo Sabin\n* Manuel F. Segura\n* Arthur D. Simons\n* Jonathan M. Wainwright (general)\n* Mike C. Pena (U.S. Medal of Honor recipient)\nSee also\n* Awards and decorations of the Armed Forces of the Philippines\nReferences\nCitations\nBibliography\n* The AFP Adjutant General, AFP Awards and Decorations Handbook, 1995, 1997, OTAG."
    }
  ]
}