{
  "content": [
    {
      "type": "text",
      "text": "# Philippine Historical Association\n\nThe Philippine Historical Association (Kapisanang Pangkasaysayan ng Pilipinas in Tagalog)  is a professional association of historians in the Philippines and is considered one of the oldest organizations of historians in the country. It was founded on September 18, 1955 by a group of prominent historians at Carbungco Restaurant located at Lepanto St., Manila. Among the group were Encarnacion Alzona, Gabriel Fabella, Gregorio Zaide, Nicolas Zafra, Celedonio Resurreccion, Teodoro Agoncillo and Esteban de Ocampo.\nThe association is a non-stock, non-profit, non-sectarian and a non-partisan organization. Its national office is located in Manila. It was established in 1955 by members of the Philippine National Historical Society.\nThe objectives and purposes of the association are the following:\n# to promote and propagate historical knowledge and studies\n# to collect and preserve relics, manuscripts, documents and the like pertaining to the Philippines\n# to undertake any and other activities that will promote the objectives and purposes of the association.\nBoard of Governors\nA board of governors directs the annual activities of the PHA. It consists of eleven (11) regular members in good standing who are elected in the Annual General Assembly which is held on the last Sunday of January. The board of governors serves as the governing body of the association and manages its affairs and business. Upon their election, the board of governors elect among themselves the president, vice-president, secretary, treasurer, and auditor. Also elected are other officers such as the press relations officer, the editor-in-chief of the Historical Bulletin and the chairs of the committees on membership, curriculum, and research.\nThe post of executive director was added to the board in 1975. The first executive director was Jorge Revilla. In the following year, Gloria Santos assumed the post. She has held this office till the present time, making her the longest running and continuously serving executive director.\nSenior members of the association, the immediate past president and the chairmen of the National Historical Institute and the Philippine History Foundation constitute the Board of Consultants.\nA meeting held by the association's founders on October 2, 1955 resulted in the election of the first board of governors.\nPresidents\nThe first president of the association was Gabriel Fabella who occupied the post for three years. He was succeeded by a host of prominent scholars, among them, Dalmacio Martin, Ricardo Arcilla, Sixto Orosa, Celedonio Resurreccion, Diosdado Capino, Bonifacio Salamanca, Romeo Cruz, Oscar Evangelista, Napoleon Casambre, Epitacio Palispis, Cesar Pobre, Ambeth Ocampo, Celestina Boncan, and Evelyn Songco.\nHonorary presidents\nThe association holds the distinction of having had Philippine presidents as its honorary presidents. President Ramon Magsaysay was the first honorary president of the association. Since then, the association has been graced by the honor of having Presidents Carlos Garcia, Diosdado Macapagal, Ferdinand Marcos, Fidel Ramos, Joseph Estrada and Gloria Macapagal Arroyo in its roster as honorary president.\nThe first board of governors was inducted into office by President Ramon Magsaysay on December 12, 1955 in Malacañang Palace. Another incumbent president, Fidel Ramos, inducted into office the 1996 Board of Governors. This signature honor also took place in Malacañang Palace.\nPresident Carlos P. Garcia gave the keynote address of the association's annual seminar which was held at the University of the East on November 28–29, 1958. In 1976, President Ferdinand Marcos invited the association to hold its annual seminar in Malacañang Palace and delivered the keynote address. In 1998 President Fidel Ramos designated the association to bring the spirit of the centennial celebration to all four corners of the archipelago through the project The Centennial Goes to the Barrio. In 1999 President Ramos graciously accepted the association's invitation to be the guest of honor and speaker in the launching of its book Philippine Presidents: 100 Years.\nPhilippine Historical Foundation\nOne accomplishment of the 1980 Board of Governors was the creation of the Philippine Historical Foundation. As it was envisioned by its creators, the foundation was to be a non-stock, non-profit, non-denominational private organization for scholarly, educational, and cultural purposes.\nIn particular, the aims and objectives of the foundation are the following: 1) to foster, encourage and support scholarly research on any area of Philippine history; 2) to initiate, create, maintain and support a Philippine History Library and Museum to be administered by the Philippine Historical Association; 3) to provide financial support to worthwhile historical publications and projects; 4) to establish, assist and support professorial and research chairs in Philippine history; and 5) to collaborate with the Philippine Historical Association in achieving its purposes, aims and objectives and in implementing its program of activities and projects.\nA Board of Trustees consisting of eleven members serves as the governing body of the foundation. The Board is presided over by a chairman who is joined by a vice chairman, secretary, treasurer, executive director, legal counsel and public relations officer. The other six members seat in the Board as trustees. There are four sectoral committees --- academe, business, international and professional—which are in charge of getting pledges of commitment.\nPursuant to the nature of its organization, the Philippine History Foundation will raise funds, accept donations, grants, bequests and legacies in cash or in kind which it shall hold in trust.\nPast presidents, namely, Celedonio Resurreccion and Minerva Gonzalez, assisted the members of the incumbent board of governors in framing the constitution and by-laws of the foundation. Governor Antonio Avecilla was the first chairman of the foundation.\nPHA Historical Bulletin\nThe association promotes historical research and scholarship among its members through the publication of their works. The association has an official journal which is published every year. The journal first came out in 1957 and was called Buletin ng Kapisanang Pangkasaysayan ng Pilipinas. The Bulletin was renamed Historical Bulletin in 1959.\nThe association has come up with special issues of the Historical Bulletin. One such type of special issue is in honor of Filipino heroes and statesmen. Vol. XXII (1978) is devoted to Commonwealth President Manuel Quezon (Quezon: In Retrospect), edited by Mauro Garcia and Juan F. Rivera. Volume IV (June 1960), edited by Sixto Y. Orosa, and Vol. V (1961), edited by Carlos Quirino, are on Jose Rizal, the national hero. Volume IV (March 1960), edited by Teodoro A. Agoncillo, is on Claro M. Recto. Volume III (1959) is on Emilio Aguinaldo.\nAnother type of special issue is on significant events in Philippine history. Vol. XII (1968) is on the Japanese Occupation featuring the operations of the United States Army Forces in the Philippines, North Luzon.\nThere have also been special issues of the Historical Bulletin that dealt on themes in Philippine history. Volume XVII (1973) is on the study, teaching and writing of history.\nPHA Balita\nThe association maintains a newsletter called the PHA Balita. It was created in 1980 during the association's Silver Jubilee Year. The newsletter keeps the members informed of the activities of the association. It comes out twice a year.\nPHA Annual Conference\nThe main annual activity of the association is the holding of an annual conference whose theme deals with timely and relevant issues of national concern. The themes of the PHA Annual Conference in the last five years include Historical Development of Philippine Political Parties (2006), Kababaihan at Kabayanihan (2005), In Search of Good Governance: Retrospect and Prospects (2004), Terrorism: Historical Perspective and Implications (2003), and RP-US Relations: A Historical Perspective (2002).\nHistorical Milestones\n50th Anniversary of the Philippine Assembly\nIn 1957 President Carlos P. Garcia designated the association to take the lead for the celebration of the 50th anniversary of the Philippine Assembly, the first all-Filipino legislature in the country.\nInternational Conference of Historians of Asia (IAHA)\nWhen it was just on its fifth year of existence, the association took the bold step of organizing an international conference of historians in Manila. It was the first international conference of its kind to be held in the country. The First International Conference of Historians of Asia was held on November 25–30, 1960. Appointed to oversee the preparations of the conference was a three-man committee made up of Nicolas Zafra, as chairman, and Jorge Revilla and Celedonio Resurreccion, as members.\nThe conference had two aims. The first was to afford scholars in different countries an opportunity to come together for an exchange of views, ideas and information regarding conditions and problems of historical study and research in their respective countries. The second was to bring about, through an association of scholars from Asia, the establishment of closer cultural relations among Asian countries and the enhancement of the effectiveness and usefulness of written history as a means of promoting international peace, goodwill and understanding.\nThe conference was a success. Australia, Burma, Republic of China, Hong Kong, Indonesia, Korea, Japan, Macao, Pakistan, Ryukyus, Singapore, Thailand, and the United States sent delegates to the conference. No less than President Carlos P. Garcia addressed the delegates at the opening ceremony which was held at the Session Hall of the House of Representatives.\nSpeakers for the Philippines included Horacio de la Costa, S.J., Carmen Guerrero-Nakpil, Carlos Quirino, Encarnacion Alzona, Teodoro Agoncillo, Jose Maceda, Gregorio Zaide, Henry Otley Beyer, and Gabriel Fabella.\nAside from bringing together various historians in a meaningful discussion of historical research and study, the conference became the instrument for the creation of the International Association of Historians of Asia. Two days before the conference adjourned, the delegates adopted a constitution for the IAHA and elected its first officers. Constituting the first board of the IAHA were Domingo Abella, president; Chang Kuei-Yung, first vice-president; Yu-Kai Wang, second vice-president; Toshio Kawabe, third vice-president; Horacio de la Costa, S.J., secretary-general; Lao Kan, treasurer; and Sun Kwo-Tung, auditor.\nThe Filipino charter members of the IAHA include Domingo Abella, Teodoro Agoncillo, Celedonio Ancheta, Ricardo Arcilla, Horacio de la Costa, S.J., Pacifico Dumandan, Sr., Gabriel Fabella, Silvina Laya, Dalamcio Martin, Esteban de Ocampo, Sixto Orosa, Celedonio Resurreccion, Jorge Revilla, Leopoldo Yabes, Nicolas Zafra and Gregorio Zaide.\nJune 12 Independence Day\nIt was the association that proposed to then President Diosdado Macapagal to change our Independence Day celebration from July 4 to June 12.\nPromotion of Philippine History\nThe association supported two initiatives of its prominent member, Teodoro Agoncillo, that have had a great impact in the promotion of Philippine history.\nCommission on Philippine Historical Research\nThe first is the creation of a Commission on Philippine Historical Research which eventually became the National Historical Institute.\nRizal Law\nThe second is the teaching of the life and works of our national hero, Jose Rizal, which was eventually mandated under Republic Act No. 1425.\nDecade of Centennials of Nationalism and Independence\nThe association launched in 1988 a movement to celebrate the centennial of the Revolution. Every year from hereon till 1998 the annual seminars of the association would focus on a theme that was appropriate to the centenary celebration of that year. Hence, it was the Propaganda Movement for 1988, the publication of the La Solidaridad in 1989, the founding of the La Liga Filipina and the Katipunan in 1992, and the outbreak of the Revolution in 1996. Bannered as the “Decade of Centennials of Nationalism and Independence,” the movement follows the tradition of the Association of celebrating significant events in the country's history and observing the centenaries of leading historical personalities.\nPaligsahan sa Kasaysayan\nIn 1996, the Philippine History Foundation was made a member of the Rizal Martyrdom Centennial Commission under the Philippine Centennial Commission. The contribution of the foundation in this endeavor was the awarding of plaques for the Paligsahan sa Kasaysayan, a national high school competition on the life and martyrdom of the national hero, Jose Rizal, and the 1896 Philippine Revolution. The contest was launched in 1996 by the National Historical Institute as part of the Centennial Celebration. The winners in the regional contests went on to become the finalists of the Grand National Finals which were to be held in Manila. The first Grand National Finals was held in 1997 at the RPN Channel 9 Studio with Senator Orlando Mercado as quizmaster.\nThe first Paligsahan proved to be a success. In the following year, the feedback from the regions was to continue the contest. The National Historical Institute expanded the contest to include culture as another theme of the contest and thus renamed it as Paligsahan sa Kasaysayan at Kultura ng Pilipinas.\nMembers of the association also participated in the Paligsahan. They sat as members of the board of judges in the grand national finals. They also assisted the National Historical Institute in the formulation and evaluation of the questions.\n“The Centennial Goes to the Barrio”\nThe association actively participated in the celebration of the centennial of the 1896 Revolution. A project initiated by past president Pablo Trillana III became one of the projects of the Philippine Centennial Commission. This was The Centennial Goes to the Barrio Project which is aimed at bringing the celebration of the centennial to the different regions of the country through a lecture-forum and a photo exhibit on the Philippine Revolution and a seminar-workshop on the study, teaching and writing of local history.\nFrom 1997 to 1998 the association convened a total of fourteen such conventions --- Laoag, Ilocos Norte (Region 1), Santiago City (Region 2) Tarlac City (Region 3), Calaca, Batangas (Region 4), Kalibo, Aklan (Region 6), Cebu City (Region 7), Catbalogan, Samar (Region 8), Zamboanga City (Region 9), Iligan City, Lanao del Norte (Region 10), Malaybalay, Bukidnon (Region 12), Novaliches (National Capital Region) and Baguio City (Cordillera Administrative Region).\nProjects: “Towards the Effective Teaching of History”\nThe aim of the association is to promote the study and appreciation of history, in particular, Philippine history. In line with this aim, the association initiates, sponsors and supports the holding of seminars on the teaching of history in Manila and in different parts of the country.\nProjects: Akademyang Pangkasaysayan\nIn 1996, the association brought one step higher its mission of enhancing the teaching of history. It had been widely observed that many teachers of Philippine history in the secondary and tertiary levels are not majors in history. The association sought the endorsement of the Department of Education, Culture and Sports and the Commission on Higher Education to allow it to conduct accreditation seminars that would be carried out under the program called Akademyang Pangkasaysayan. As far as it was possible, the seminars would be held in Northern Philippines, Southern Philippines, National Capital Region, Visayas and Mindanao.\nThe program consists of two parts. Part I covers the period from pre-historic times up to the end of the 19th century including the Philippine Revolution. Part II covers the period from the American Occupation up to the present. The association envisions that at the end of the two-part course history teachers who are deficient in the subject shall attain a core of knowledge and methodology. On the other hand, the Akademya will serve as a refresher course to history majors. The association also intends to conduct intensive courses in the teaching of Asian and World History under the Akademyang Pangkasaysayan.\nThe association launched the Akademyang Pangkasaysayan on June 26–28, 1996 at St. Mary's College in Quezon City. Since then, it has brought the Akademyang Pangkasaysayan to various parts of the country --- Leyte Normal University in Tacloban City, Leyte, Aquinas University in Legazpi City, Albay, University of St. Anthony in Iriga City, Camarines Sur, Divine Word College in Tagbilaran City, Bohol, Ateneo de Davao in Davao City, and Ateneo de Cavite in Cavite City.\nPublications\n* Carballo, Maria Lourdes. Historical Bulletin, Volume 5. Quezon City: Philippine Historical Association, December 1961. Print\n* Onorato, Michael Paul. A Brief Review of American Interest in Philippine Development And Other Essays. Berkeley, California: McCuthchan, 1968. Print\n* Philippine Historical Association. Philippine Presidents: 100 Years. Quezon City: New Day Publisher, 1999. Print.\n20th Anniversary\nIn 1975, the association decided to advance the celebration of its twenty-fifth anniversary. The board of governors then felt that the association need not wait until its silver jubilee. In the words of the association's president, Celedonio Resurreccion, “age is fast overtaking many of the founders of the association and we want them to enjoy the ultimate satisfaction that their labors and contributions to the history profession are appreciated and recognized.”\nIt was for this reason that the association held a Recognition Day Ceremony on January 18, 1975 to confer a plaque of recognition with the highest distinction to thirteen members. The recipients of the awards were Encarnacion Alzona, Gabriel Fabella, Esteban de Ocampo, Mauro Garcia, Gloria Santos, Celedonio Ancheta, Carlos Quirino, Gregorio Zaide, Nicolas Zafra, Teodoro Agoncillo, Horacio de la Costa, S.J., Sixto Orosa, and Digno Alba (posthumous).\n25th Anniversary\nFive years later, in 1980, the association nevertheless kept its date with destiny. A Silver Jubilee Committee was created to draw up plans for the celebration. The committee was made up of past presidents of the association. The incumbent president, Bonifacio Salamanca, was unanimously designated as committee chairman.\nThe association launched its Silver Jubilee Year on June 12, 1980 with an exhibit on the past twenty-five years of the association which was set up on the second floor of the National Library on T.M. Kalaw St. in Ermita, Manila. Renowned historian and one of the founders of the association, Encarnacion Alzona, cut the ribbon to open the exhibit. In the evening, a dinner-lecture forum was held at the Club Filipino in cooperation with the Mabuhay ang Pilipino Movement. The guest speaker was Hon. Paco Albano, a delegate to the Constitutional Convention, who spoke on the topic “History and Liberty: The Philippine Experience.”\nThe association held two seminars during the year. The first, on the topic “Towards the Effective Teaching of History,” was held at the Divine Word College in Legazpi City, Albay on September 12–13, 1980. The second, the annual seminar, was held on December 4–5, 1980 on the topic “Kasaysayan: Lingap sa Nakaraan, Gabay ng Kaunlaran” (History: Custodian of the Past, Guardian of the Future).\n50th Anniversary\nAt the 2005 Annual General Assembly a resolution was passed to retain the 2004 Board of Governors as the 50th Anniversary Board to enable it to formulate a calendar of activities to mark the golden jubilee of the association. It was also decided to make the golden jubilee a year-long celebration.\nA concert entitled “An Evening of Philippine Music Featuring the UST Singers” launched the anniversary activities. This was held on December 18, 2004 at the Philam Life Theater at United Nations Avenue, Manila.\nTwo conferences were held in Manila. The first was the Bonifacio Salamanca Commemorative Program which had as its theme “Philippine-American Relations Revisited.” It was held at the College of Arts & Sciences, University of the Philippines Manila on July 7, 2005. The second was the 2005 Annual Conference which coincided with the celebration of Linggo ng Kasaysayan whose theme this year was “Kasaysayan: Kandungan ng Kagitingan.” It was held at the National Library Auditorium on September 16–17, 2005.\nThe Palawan Regional Conference was held at the Palawan State University in Puerto Princesa City on March 4–5, 2005. The conference theme was “America’s Legacy in Palawan with a focus on Culion Leper Colony and Iwahig Penal Colony.”\nThe PHA organized together with the National Historical Institute a conference as part of the commemoration of the 109th Death Anniversary and Martyrdom of Jose Rizal. The conference was held on December 2–3, 2005 at the Rizal Shrine in Dapitan City on the theme “Teaching Rizal in the Classroom: Making the Rizal Course Relevant in our Time.”\nMembers of the PHA Board toured selected historical sites during the summer break. These were Banaue on April 15–17, 2005, Corregidor on May 20, 2005 and San Miguel (Bulacan) on June 12, 2005.\nVols. 34 and 35 of the Historical Bulletin were launched on September 17, 2005 at the National Library during the 2005 Annual Conference.\nPresidents of the Philippine Historical Association\n{|\n|-valign=\"top\"\n|\n{|class=\"wikitable\"\n|-\n|1955 || Gabriel F. Fabella\n|-\n|1956 || Gabriel Fabella\n|-\n|1957 || Gabriel Fabella\n|-\n|1958 || Nicolas Zafra\n|-\n|1959 || Gabriel F. Fabella\n|-\n|1960 || Esteban A. de Ocampo\n|-\n|rowspan=2|1961 ||Dalmacio Martin (on leave)\n|-\n|Ricardo A. Arcilla (acting)\n|-\n|1962 || Nicolas Zafra\n|-\n|1963 || Esteban A. de Ocampo\n|-\n|1964 || Esteban A. de Ocampo\n|-\n|1965 || Gregorio F. Zaide\n|-\n|1966 || Gregorio F. Zaide\n|-\n|1967 || Celedonio A. Ancheta\n|-\n|1968 || Sixto Y. Orosa\n|-\n|1969 || Esteban A. de Ocampo\n|-\n|1970 || Esteban A. de Ocampo\n|-\n|1971 || Gregorio F. Zaide\n|-\n|1972 || Gloria M. Santos\n|}\n|\n{|class=\"wikitable\"\n|-\n|1973 || Celedonio O. Resurreccion\n|-\n|1974 || Celedonio O. Resurreccion\n|-\n|1975 || Diosdado G. Capino\n|-\n|1976 || Diosdado G. Capino\n|-\n|1977 || Ma. Minerva A. Gonzalez\n|-\n|1978 || Ma. Minerva A. Gonzalez\n|-\n|1979 || Bonifacio S. Salamanca\n|-\n|1980 || Bonifacio S. Salamanaca\n|-\n|1981 || &nbsp;\n|-\n|1982 || Romeo V. Cruz\n|-\n|1983 || Romeo V. Cruz\n|-\n|1984 || Rosario M. Cortes\n|-\n|1985 || Rosario M. Cortes\n|-\n|1986 || Oscar L. Evangelista\n|-\n|1987 || Oscar L. Evangelista\n|-\n|1988 || Napoleon J. Casambre\n|-\n|1989 || Napoleon J. Casambre\n|-\n|1990 || Cesar Pobre (acting)\n|-\n|1991 || Cesar Pobre\n|}\n|\n{|class=\"wikitable\"\n|-\n|1992 || Cesar Pobre\n|-\n|1993 || Milagros Guerrero\n|-\n|1994 || Epitacio Palispis\n|-\n|1995 || Epitacio S. Palispis\n|-\n|1996 || Oscar L. Evangelista\n|-\n|1997 || Oscar Evangelista\n|-\n|1998 || Pablo Trillana III\n|-\n|1999 || Pablo Trillana III\n|-\n|2000 || Ambeth Ocampo\n|-\n|2001 || Ambeth Ocampo\n|-\n|2002 || Cesar Pobre\n|-\n|2003 || Cesar Pobre\n|-\n|2004 || Evelyn Miranda\n|-\n|2005 || Evelyn Miranda\n|-\n|2006 || Celestina Boncan\n|-\n|2007 || Celestina Boncan\n|}\n|}\nReferences"
    }
  ]
}