{
  "content": [
    {
      "type": "text",
      "text": "# Philip and Alexander: Kings and Conquerors\n\nPhilip and Alexander: Kings and Conquerors is a single volume dual biography of Philip II of Macedon and his son, Alexander the Great. It was written by Adrian Goldsworthy and published in 2020 by Head of Zeus in the United Kingdom and Basic Books in the United States.\nSynopsis\nThis book is a historical biography about Philip II of Macedon and his son Alexander the Great. The book covers the lives of both men, from Philip's rise to power in Macedonia to Alexander's death in Babylon, a period of 78 years. Goldsworthy argues that Alexander's success and achievements wouldn't have been possible without Philip. Philip's military reforms and victories, along with uniting the Greek city-states under Macedonian rule, laid the foundation for Alexander's future conquests.. Phillip built a strong army and greatly expanded his territory over decades. Then, due to his father's preparations, Alexander was able to launch campaigns that conquered significant swaths of Asia, the Achaemenid Persian Empire, and more territory all the way to the Indus River Valley.\nPhilip II turned ancient Macedon from a backwater to a superpower of its day. Philip and his army subdued the surrounding territories, and then heading south, conquered or politically controlled the ancient Greek poleis.  Diplomatically, he avoided invading ancient Athens, preferring instead a strong alliance for his planned invasion of the Persian Empire. Stephen Batchelor, who reviews this book for Military History Matters says, \"Through this narrative a clear picture emerges of Philip and Alexander as leaders, warriors, and politicians.\"\nAbout the book\nThe book is divided into three main sections that cover 31 chapters, and an epilogue. The section titles are: \"Part One: Philip II\", \"Part Two: Alexander and Persia\", and \"Part Three: Lord of Asia.\" It also has sixteen unnumbered pages of mostly colored plates, as well as maps and illustrations of battle formations. The book is referenced with notes for each chapter. It contains two appendixes, a bibliography and an index, showing that book is based on ancient and contemporary scholarly sources. The work of sifting through the sometimes conflicting ancient sources to tell the story is also part of the narrative.\nReception\nJames Romm for The Wall Street Journal writes, \"[Goldsworthy's] Philip and Alexander is thus a compelling but temperate book, giving readers an in-depth but dispassionate account of its subjects.\" Stephen Batchelor, writing for the Military History Matters review of this book says, \"For readers both new to the period and those very familiar with it, there is much to enjoy and to ponder in this fast-paced, authoritative, and incisive study.\"\nReferences\nFurther reading\n*.\n*\nExternal links\n*\n* [https://headofzeus.com/books/9781784978693 Head of Zeus] (UK publisher).\n* [http://www.adriangoldsworthy.com/book13.php Author website]\n*\n* [https://www.metmuseum.org/toah/hd/alex/hd_alex.htm The Rise of Macedon and the Conquests of Alexander the Great]. The Metropolitan Museum of Art.\n* \"[https://doi.org/10.1515/9783110622942 The Courts of Philip II and Alexander the Great.]\" Published by De Gruyter. 2022."
    }
  ]
}