{
  "content": [
    {
      "type": "text",
      "text": "# Philip Edward Fisher\n\n| birth_place     = Birmingham, England\n| origin          =\n| genre           = Classical piano\n| occupation      = Classical pianist\n| years_active    =\n| label           = Chandos Records; Naxos Records\n| website         = [http://www.philipedwardfisher.com/ Philipedwardfisher.com]}}\nPhilip Edward Fisher (born 1979, Birmingham, England) is an English classical pianist.\nBiography\nBorn and raised in Birmingham, England, Philip Edward Fisher began playing the piano at the relatively late age of nine, making his concerto debut only three years later with a performance of Shostakovich's Second Piano Concerto at the city's Symphony Hall. He attended a local comprehensive school until winning a scholarship to study at the Purcell School of Music, London, following which he continued his studies at the Royal Academy of Music.\nIn 2001, he received the Julius Isserlis Scholarship from the Royal Philharmonic Society of London, enabling him to take up a place at the Juilliard School, which was soon followed by his New York City debut performing Rachmaninov's Third Piano Concerto under the baton of Larry Rachleff at Lincoln Center's Alice Tully Hall.\nPerformances\nPhilip Edward Fisher's engagements have included performances at Copenhagen's Tivoli Koncertsalen, New York City's Lincoln Center and Merkin Hall, London's Purcell Room, Wigmore Hall, Barbican Centre and Royal Festival Hall, Tampere's Tampere Hall, the Usher Hall in Edinburgh, San Antonio's Tobin Center for the Performing Arts, Glasgow's Royal Concert Hall, and Symphony Hall, Birmingham. In April 2011, he represented Chandos Records at the International Classical Music Awards in Tampere, Finland, performing Prokofiev's 1st Piano Concerto with the Tampere Philharmonic Orchestra under Hannu Lintu. The event was broadcast live across Europe by Finnish Radio, Germany's MDR Figaro, Saarländischer Rundfunk, Luxembourg's Radio 100,7, and Russian Orpheus Radio. Fisher has also made appearances at Music@Menlo, the Beethoven Chamber Music Festival and the Kyoto International Music Festival in Japan. He has been heard on New York's WQXR and Boston's WGBH, BBC Radio 3, Classic FM, and has appeared on Ukrainian Television, the BBC, and MTV.\nFisher has performed concertos with the Copenhagen Philharmonic Orchestra, the Tampere Philharmonic Orchestra, the Albany Symphony Orchestra, the Toledo Symphony Orchestra, the San Antonio Symphony, the Longwood Symphony Orchestra, the Juilliard Symphony Orchestra, and the Royal Scottish National Orchestra. He has collaborated with numerous leading conductors, including Hannu Lintu, Sebastian Lang-Lessing, David Alan Miller, Larry Rachleff, John Axelrod, James Lowe and Giordano Bellincampi. He played the complete set of Beethoven piano sonatas in a series of concerts at Brooklyn's Bargemusic. As a chamber musician, his collaborators include composer John Corigliano, the Brodsky Quartet, tenor Robert White, pianist Sara Davis Buechner, violinists Elmar Oliviera, Philippe Graffin and Augustin Hadelich, and Principal Trombonist of the New York Philharmonic, Joseph Alessi.\nRecordings\nIn May 2023, Fisher released the complete solo piano works of American composer John Corigliano for Naxos Records, including a studio recording of Corigliano's Piano Concerto with the Albany Symphony Orchestra under David Alan Miller.\nFisher's first solo release for Chandos Records, Piano Works by \"The Mighty Handful\", included Mussorgsky's Pictures at an Exhibition and Balakirev's Islamey, and featured on Classic FM as John Suchet's \"Album of the Week\",. It also received a nomination for \"Best Solo Instrumental Album\" at the International Classical Music Awards 2012.\nOther recent recordings include Handel's Eight Great Keyboard Suites, in two volumes for Naxos Records. The set was released to critical acclaim, and Volume 1 entered the US Classical Billboard Chart within the first week of its release.\nFisher also appears extensively as a guest artist with the Brodsky Quartet on their 2012 release Petit-fours (Chandos Records).\nReferences\nExternal links\n*"
    }
  ]
}