{
  "content": [
    {
      "type": "text",
      "text": "# Phoenix Ancient Art\n\nPhoenix Ancient Art, located in Geneva, New York City and Brussels, is a second-generation antiquities dealer specializing in Greek and Roman ancient art.  Its works of art have been purchased by arts and antiquities private collectors as well as museums such as New York's Metropolitan Museum of Art and the Louvre Museum in Paris. They have historically dealt in antiquities from the Sumerian art and Ancient Roman artistic traditions, as well as from Ancient Greek and Ancient Egyptian civilizations.\nNotable collections\nPhoenix Ancient Art has facilitated numerous museum acquisitions of seminal ancient art objects.\nNoteworthy sales and provenances from Phoenix include:\n* The Apollo Sauroctonos, known also as the Lizard or Python Slayer, currently attributed to Praxiteles, at the Cleveland Museum of Art\n* Bust of Isis from the 25th Dynasty (750–656 B.C) in Egypt, and Aryballos in the form of a female bust, early 6th century B.C., both at Princeton Museum of Art\n* Ka-Nefer-Nefer at the Saint Louis Art Museum\n* Bronze Statue of a Man, ca. mid-2nd to 1st century B.C., Greek, and Marble two-sided relief, 1st century A.D., Roman, the Metropolitan Museum of Art\n* Eye idol (larger), late 4th millennium B.C., stone, Yale University Art Gallery\n* The private collection of Harvard University molecular biologist and Nobel Laureate Walter Gilbert\n* The Man Dressed in a Roman Toga, Called \"The Orator\" at the Louvre Abu Dhabi\n*Etruscan Amphora attributed to the Ivy League Group at the Art Institute of Chicago\n*Bust of a Flavian Matron at the Toledo Museum of Art\n*Roman Marble Head of Pseudo-Seneca/Hesiod at the J. Paul Getty Museum\n*Attic Black Figure Amphora with a scene from the Iliad attributed to the Hattatt Painter at the Museum of Fine Arts, Houston\n*Ramesses II relief at the Miho Museum\nBackground\nFamily history\nPhoenix Ancient Art was founded by the Lebanese businessman Sleiman Aboutaam in 1968 and incorporated in 1995. The business continues today under the leadership of his two sons, Hicham and Ali Aboutaam.\nAli and Hicham were born in Beirut in 1965 and 1967 respectively. In the 1980s, at the height of the Lebanese Civil War, Ali was kidnapped by a Syrian gang and held hostage until Sleiman procured his release. Following the incident, the family (Sleiman, Souad, the boys and their sister Noura) relocated to Geneva, Switzerland, where they continue to operate a branch of the business today.\nIn the early 90s, the young men earned a formidable reputation as buyers. Nicknamed \"Tall and Taller\" by the socialite set (such as those attending events with art collector Leon Levy and his wife Shelby White), they were the awe and the fear of fellow industry players.\nIn 1998, the brothers assumed control of the family business. The takeover would have been a natural succession, but it was marked by the sudden loss of Sleiman and Souad on Swissair Flight 111.\nEvents\nIn April 2009, Phoenix Ancient Art launched e-Tiquities.com, an e-commerce platform for a wide range of artworks, also including jewelry, figurines, amulets, sculpture and pottery from regions as diverse as ancient Greece and Rome, Byzantium, Egypt, the Near East and the Islamic world.\nIn early 2014, Phoenix Ancient Art opened a second gallery in Geneva called ‘Phoenix Ancient Art Young Collectors’, a unique gallery space that exhibits a large variety of objects from the 6th millennium B.C. through the 14th century A.D.\nOn June 12, 2019, Phoenix Ancient Art opened a new gallery in Brussels.\nCriminal investigations\nIn 2004,  Hicham Aboutaam, the co-owner of Phoenix Ancient pleaded guilty of forging the origins of a rhyton, which their gallery sold for $950,000.\nIn 2023, Ali Aboutaam, the founder of Phoenix Ancient Art, was given a 18-month suspended jail sentence in Geneva, for \"violating the law on the transfer of cultural properties and use of forged provenance documents.\"\nFairs and exhibitions\nPhoenix Ancient Art participates in a number of international fairs, such as the Biennale des Antiquaires (Paris), the Brussels Antiques and Fine Art Fair BRAFA (Brussels), the International Fine Art and Antiques Show (New York City),  the PAD (London), the Point Art Fine Art Fair (Monaco), the Salon Art + Design (New York),the Spring Masters Fair (New York), and TEFAF (New York). They also hold local themed events in their galleries several times a year accompanied by their gallery publications.\nPublications\n* Crystal, hardcover editions\n* Softcover editions\n* The Painter's Eye: The Art of Greek ceramics\n* Warrior: Ancient Arms and Armor\n* Faiences\n* Fabulous Monsters\n* Greek and Roman Gold\n* Sacred Scents and Flames from the Ancient World\n* Art of the two lands : Egypt from 4000 B.C. to 1000 A.D.\n* Argos- the Dog in Antiquity\n* Exotics of the classical world\n* Alexander the Great and His World\nIn 2025, sheikh Hamad bin Abdullah al-Thani, a son of Abdullah bin Khalifa Al Thani and the owner of Dudley House, London brought a civil case against the brothers Ali and Hicham Aboutaam for selling him a forged Nike statue, and falsifying the provenance of other objects. The judge found the breach of the disclosure obligations was “deliberate, serious, prolonged and inexcusable”.\nFurther reading\n*http://www.blouinartinfo.com/power-game-changers-2014#prettyPhoto\n*http://www.lefigaro.fr/arts-expositions/2014/09/18/03015-20140918ARTFIG00352-la-biennale-des-antiquaires-vu-par-le-dessinateur-francois-aviril.php\n*http://www.nytimes.com/2013/11/15/arts/design/the-salon-art-design-a-wide-range-at-park-avenue-armory.html?_r=1&\n*http://www.bilan.ch/etienne-dumont/courants-dart/geneve-splendeurs-antiques-chez-phoenix\n*http://www.handelsblatt.com/panorama/kunstmarkt/brafa-erfolgreiche-stilmischung-in-bruessel/7652422.html\n*http://www.nytimes.com/2012/08/13/arts/design/cleveland-museum-buys-antiquities-stirs-ethics-debates.html?pagewanted=all\n*http://archives.tdg.ch/phoenix-presente-geneve-temoignages-antiquite-2011-04-15\n*https://ssrn.com/abstract=2370731\n*http://money.cnn.com/2008/10/23/magazines/fortune/antiquities_hira.fortune/index.htm, Really Old Money, October 23, 2008.\n*[https://www.nytimes.com/2007/03/18/business/yourmoney/18Art.html?ex=1332734400&en=0207ffb02360cdc2&ei=5124&partner=permalink&exprod=permalink \"New York Times\" article \"Do You Know Where That Art Has Been' by Ron Stodghil]\n*[https://www.nbcnews.com/id/24921553 NBC News] the Rich Spend During a Down Economy,\" quoting Mr. Aboutaam\n*[https://web.archive.org/web/20080720025357/http://www.forbes.com/business/2006/12/29/antiquities-collectors-steinhardt-biz-cz_cc_1229antiquity.html Article in Forbes Magazine: \"Ancient History for Sale\", by Carrie Coolidge.] The article also presents a photographic slideshow of antiquites from Phoenix Ancient Art.\n*[http://www.businessweek.com/magazine/content/05_39/b3952118.htm \"BusinessWeek\" article \"Antiquities to grow old with\"]\n*https://abcnews.go.com/International/IraqCoverage/story?id=2282183&page=1  The article reports how Hicham Aboutaam helped Interpol and ICE successfully recovered the famous stolen statue of Entemena, which is \"on the FBI top 10 list of art heists.\"\n*[http://www.mcdonald.cam.ac.uk/iarc/culturewithoutcontext/issue14/news.htm Illicit Antiquities Research Centre News]\n* https://www.wsj.com/articles/prominent-art-family-entangled-in-investigations-of-antiquities-1496246740\n* https://www.unodc.org/res/cld/case-law-doc/traffickingculturalpropertycrimetype/usa/dat_hamin_stele_html/Dat_Hamin_Stele.pdf\n*[https://www.ft.com/content/ffec8db8-2ec1-11db-a973-0000779e2340  \"Financial Times\" article \"Antiquities Weather the Market\"] FT article featuring the new era in the antiquities trade, Phoenix Ancient Art and a major Egyptian head of queen]\n*[http://www.artnet.com/Magazine/news/artnetnews2/artnetnews12-29-04.asp \"ArtNet\" article \"New Leaf for Aboutaams\"]\n*[http://www.nysun.com/article/30979 \"New York Sun\" article: \"Antiquities Dealers Suddenly Emerge into the Sunlight\"] Article where Hicham Aboutaam discusses the changing scrutiny in the antiquities business\n*[https://www.courthousenews.com/art-dealer-cant-sue-over-stigma-from-isis-report/ Art Dealer Can't Sue Over Stigma From ISIS Report]\nReferences"
    }
  ]
}