{
  "content": [
    {
      "type": "text",
      "text": "# Photo-induced cross-linking of unmodified proteins\n\nPhoto-Induced Cross-Linking of Unmodified Proteins (PICUP) is a protein cross-linking method by visible light irradiation of a photocatalyst in the presence of an electron acceptor and the protein of interest. Irradiation results in a highly reactive protein radical that forms a covalent bond between the amino acid side chains of the proteins to be linked. Cross-linking methods developed prior to PICUP, including the use of physical, oxidative, and chemical cross-linkers, often require more time and result in protein byproducts. In addition, the cross-linked protein yield is very low due to the multifunctionality of the cross-linking reagents.\nThe process was invented (US6613582B1) in 1999 to utilize protein cross-linking techniques to analyze the interactions between polypeptides as well as structural differences proteins undergo in a catalytic pathway. The techniques in the 20th century were not sufficient to be applied to cross-link fast and transient changes of these proteins in high yield. PICUP allowed for rapid ( Additionally, PICUP was able to be performed at physiological pH of 7.4, which opened doors for further application of protein cross-linking such as studying the biochemical mechanisms that proteins participate in the human body. In addition, irradiation by visible light in PICUP is useful because many biomolecules that participate in metabolic pathways to be analyzed do no absorb light with wavelengths below the range for UV light, allowing for cross-links without denaturation.\nBitan, Lomakin, and Teplow\nIn 2001, Gal Bitan, Aleksey Lomakin, and David B. Teplow applied PICUP to study amyloid β-protein (Aβ) oligomerization, which is observed in Alzheimer's disease. PICUP allowed for identifying and quantifying the Aβ oligomers that are metastable because of its ability to rapidly cross-link. Coupling PICUP with sodium dodecyl sulfate polyacrylamide gel electrophoresis (SDS-PAGE), the distribution of oligomers in rapid equilibrium was quantified. This application allowed for the study of amyloidogenic proteins associated with neurodegenerative diseases and opened doors for possible future therapeutic mechanisms. Neurodegenerative diseases are currently suggested to be the result of neurotoxic proteins, so the ability to study their oligomer distribution is effective in understanding how and under what conditions these oligomers are formed.\nMechanism\nThe mechanism of PICUP require the tris(bipyridyl)Ru(II) complex, an electron acceptor, ammonium persulfate (APS), and reactive amino acid side chains. Tris(2,2′-bipyridyl)dichlororuthenium(II) hexahydrate, a tris(bipyridyl)Ru(II) complex, initially contains a Ru2+. Upon visible light irradiation and in the presence of ammonium persulfate (APS), Ru2+ enters its excited state and is oxidized to Ru3+. Ru3+ is now an extremely reactive oxidizer that only wants to accept one electron instead of the standard two. The reaction can proceed in the absence of an electron acceptor, but it will have a much lower efficiency, producing byproducts resulting from the excited Ru(Bpy)3 reacting with oxygen. As an effective single electron oxidizer, Ru3+ will pick up a single electron from amino acids of the neighboring proteins, most commonly Tryptophan and Tyrosine. This produces a radical that is highly unstable on the amino acid side chains, which proceeds through reactions to reach a more stable state.\nThe unpaired single electron on the side chain reacts with another amino acid side chain of a polypeptide in the vicinity, resulting in a dimer with a covalent bond. With the regeneration of Ru2+ when Ru3+ picks up an electron from the amino acids allows for continuous formation of radicals with Ru3+ being oxidized by APS.\nIn the PCR tube that the reaction takes place in, numerous unstable protein radicals come in contact with each other through simple diffusion and react both intra- and intermolecularly to achieve a more stable state. The monomeric protein radicals are able to achieve a lower energy state through forming a covalent bond to produce a dimer and releasing a hydrogen atom. PLEASE NOTE: The image mistakenly shows the release of a proton and should not be used in this form (See also ref. 4). The creator has been contacted. This newly formed dimer is also able to react with numerous other monomers or dimers through the same mechanism, creating higher numbers of cross-linked oligomers. This allows for a distribution of variety of oligomers to be present in the mixture.\nMethod\nIn every experiment, it is important to determine the relative concentration of the protein in question, ammonium persulfate, and Tris(2,2′-bipyridyl)dichlororuthenium(II) hexahydrate that will be used in the protein cross-linking experiment. Previous experiments have shown that for amyloid β-protein (Aβ), the peptide assumed to cause toxicity in Alzheimer's disease, the ratio of protein: Ru(Bpy)3: APS is 1:2:40. The ratio of Ru(Bpy)3 and APS is suggested to be kept at this ratio, but the appropriate concentration of a given protein can vary. For many proteins that PICUP has not yet been used for, finding the appropriate concentrations can be done through trial and error. Generally, protein concentrations would fall in between 10 and 50μM, dissolved in the corresponding buffer, most likely sodium phosphate if testing for conditions at physiological pH. However, some studies of pure protein suggest that the protein to Ru(Bpy)3 ratio should be kept at 1:2 as well. This level arises from the fact that the lower amount of Ru(Bpy)3 can lead to the protein sample appearing to have more than the actual number of higher order oligomers, and a greater amount of Ru(Bpy)3 can allow for artificial cross-linking byproducts.\nThe general method for PICUP is as follows:\n# The appropriate amount of the protein is pipetted into the polymerase chain reaction tube (PCR).\n# Ammonium persulfate (APS) and Tris(2,2′-bipyridyl)dichlororuthenium(II) hexahydrate are added to the sample and mixed briefly.\n# The PCR tube is placed in a glass vial to hold it still inside the bellows of the camera that would irradiate the mixture. Upon closing the lid that covers the camera, pressing down the camera shutter illuminates the tube for however long you program the camera to irradiate for. Using the same camera for every replicate of the experiment ensures that the irradiation time and the distance from the light sourced is controlled for every PICUP experiment.\n# After the sample in the PCR tube is irradiated, a calculated amount of 1M Dithiothreitol (DTT) is immediately added to the mixture to quench the reaction. If the reaction is not quenched, the oligomers will continually aggregate and lower order oligomers will not be present in the mixture. In addition, if SDS-PAGE is to be used to analyze the oligomer distribution of the proteins after PICUP, DTT would also act as a denaturing agent to the proteins before gel electrophoresis.\nApplications\nUsing PICUP on protein complexes is useful in providing catalytic and kinetic information about these proteins, as catalytic mechanisms are rapid and PICUP allows for fast and highly efficient cross-linking of proteins. Some epitope and affinity tags were shown to be unaffected by the PICUP reaction, enabling visualization of the cross-linked proteins.\nFurthermore, PICUP allows for visualization of quantitative bands of protein oligomer distribution when it is coupled with protein fractionation techniques. This combination is especially useful when examining the oligomers of neurodegenerative diseases, such as Alzheimer's disease, Parkinson's disease, and Huntington's disease, that result from protein aggregation. PICUP is extremely important when possible prevention and treatment procedures for these diseases are explored, as it is necessary to investigate the aggregation propensity of the respective amyloidogenic proteins.\nSee also\n* Cross-link\nReferences"
    }
  ]
}