{
  "content": [
    {
      "type": "text",
      "text": "# Photography & Culture\n\nPhotography & Culture is a quarterly peer-reviewed academic journal, published by Taylor & Francis. It was founded in 2008 by Val Williams (University of the Arts London, UK) and was initially published triannually by Berg Publishers and then by Bloomsbury Publishing until 2015. Photography & Culture’s editors-in-chief are Erina Duganne (Texas State University, USA), Sarah Parsons (York University, Canada), Gil Pasternak (De Montfort University, Photographic History Research Centre, UK), and Yunchang Yang (Peking University, China).\nAims and scope\nThe official Journal's webpage states that:\n\"Photography & Culture is aimed at advancing the study of photography through direct considerations of its reciprocal relationship with culturally defined environments, conventions, heritage and politics.\n\"The journal embraces the prevalence of changing definitions for both 'photography' and 'culture', encouraging the development of knowledge about the dynamic nature of their correspondence with one another across geographies and temporalities. As such, the journal takes interest in photography's employment and cultural work within local and global contexts—from the early nineteenth century to the present day, and in connection with any analogue or digital artistic, professional, amateur and vernacular photographic practices.\n\"Since its establishment in 2008, the journal has provided a platform for the empirical, theoretical and visual work of recognised and emerging researchers alike. It has published full-length scholarly articles alongside shorter discursive critiques, reviews, and photographic portfolios. The journal has equally demonstrated its continued commitment to promoting internationally diverse research of multi- and inter-disciplinary character. It has actively sought individual submissions and proposals for special issues from a boundless range of academic fields, including anthropology, art history, cultural history, material culture, media studies, sociology, visual culture, visual politics, and many others.\n\"This vibrant and inclusive approach to the study of photography has rapidly turned Photography & Culture into a key resource for scholars, practitioners, archivists, curators, and students of all academic levels concerned with photographic history, theory, and practice.\"\nAbstracting and indexing\nThe journal is abstracted and indexed in:\nReferences\nExternal links\n*"
    }
  ]
}