{
  "content": [
    {
      "type": "text",
      "text": "# Phulwara oil\n\nPhulwara oil is extracted from seeds of Phulwara tree (Diploknema butyracea; family Sapotaceae). Phulwara Trees are also known locally as Chiuri Trees, Kaeleb Trees, or Butter Nut Trees. Refined Phulwara Oil is marketed as Phulwara Ghee.\nHabitat\nThe Phulwara Tree is a tree native to Nepal and adjoining areas of India. It grows in the sub-Himalayan tract between 300 and 1500 meters above sea level.\nThe tree also grows in the Andaman Islands.\nTree\nThe Phulwara is a medium-size deciduous tree with a straight trunk. It typically attains a height of 15 to 22 meters and a girth of 1.5 to 1.8 meters. In the Andaman Islands it can reach a height of 21 to 36 meters and a girth of 1.5 to 2.4 meters. In the hills of Kumaun, the tree attains a girth of 3 meters. The bark is dark grey or brown. The tree typically begins to yield fruits after five to nine years, reaching full potential in about fifteen years.  It can  yield fruits for fifty to sixty years.\nLeaves\nThe leaves form clusters at the end of branches that may be pink or white in colour. Normally, they are elliptically shaped, and are 20 to 35&nbsp;mm long by 9 to 18&nbsp;cm width.\nFlowers\nThe flowers, which are 2.0 to 2.5&nbsp;cm in diameter, are white or pale yellow in colour and have a sweet fragrance.\nFruit\nThe fruit is an oval shaped berry, 2.0 to 4.5&nbsp;cm in diameter. The fruit has a bright shiny green or blackish skin. The pericarp is thick and soft. The fruit ripens during the months of May and August. The fruit is sweet and edible, containing 8.5% sugars & 5.6% crude fibre.\nThe seed constitutes twenty percent of the fruit.  Typically three seeds are present in a single fruit. The seeds are black and sparkling, 1.5 to 2.0&nbsp;cm in length, with an almond shaped white kernel containing saponins. The seed coat varies from thin to thick and woody to crusty. The seeds contain 42-47% oil and the kernel contains 60-66% oil. 100 seeds weigh approximately 78 grams. The average annual fruit yield per tree is about .\nSeed collection\nRipened Phulwara fruits are collected by hand or by beating the plant with long bamboo sticks. The harvested fruits are dried in shade for eight to twelve days. Seeds can be separated from fruits either manually or mechanically. If the quantity of fruits is relatively small, the fruits are crushed manually and the seeds separated. For larger quantities, a roller machine is used for seed extraction. The machine sequences the fruit through trays, collecting fresh fruit at one end and the seeds at the lower end.\nOil extraction\nOil is extracted from the kernel of Phulwara seeds. The outer shell of seeds is removed by adopting traditional or mechanical methods. In the traditional method, the seeds are boiled in water and softened seeds are placed on the floor and pressed until the kernels come out. In the mechanical system, the shell of the seed is removed by a decorticator machine.\nAfter cleaning and drying, the seeds are pounded into a fine powder using a traditional pounder called Dhiki. The powder is steamed on a perforated plate over a boiling pan. Oil is then extracted using a traditional oil expeller known locally as Chepuwa.\nProperties of oil\nThe oil has a bitter taste due to impurities such as saponins, which accompany the extracted fat. Post-extraction filtration or purification is necessary for the ghee to become edible.\nTable-Physical characters of oil\n{| class=\"wikitable\" style=\"margin:auto;\"\n|-style=\"background:indigo; color:white\" align=\"center\"\n|character||range\n|-\n|Specific gravity, at 30&nbsp;째C||0.856-862\n|-\n|Refractive index.at 40째||1.4552-1.4650\n|-\n|Iodine value||90-101\n|-\n|Melting point||31-51&nbsp;째C\n|-\n|R.M.value||0.4-4.3\n|-\n|Titer value||48-52&nbsp;째C\n|}\nComposition of fatty acids\nPhulwara oil contains 56.6% palmitic acid and 3.6% stearic acid, both of which are saturated fatty acids. It also contains 36.0% oleic acid along with 3.8% linoleic acid, both of which are unsaturated fatty acids. Oleic acid is a mono-unsaturated fatty acid and has one double bond at the 9th carbon of its hydrocarbon chain. Linoleic acid has two double bonds in the hydrocarbon chain of the acid.\nTable-physical and chemical characters of fat\n{| class=\"wikitable\" style=\"margin:auto;\"\n|-style=\"background:green; color:white\" align=\"center\"\n|Fatty acid ||Percentage\n|-\n|Palmitic acid(C16:0)||56.6\n|-\n|Stearic acid(C18:0)||3.6\n|-\n|Oleic acid(C18:1)||36.0\n|-\n|Linoleic acid(C18:2)||3.8\n|}\nUses of oil\nPhulwara ghee is the main source of edible oil for more than one hundred thousand people. The Ghee is used to cook vegetables and roti (Nepali bread).\nChiuri butter is used in confectionery, pharmaceutical, vegetable ghee production, candle manufacturing and soap making. It has been found to be effective for rheumatism. It is also used as an additive in animal ghee.\nSee also\nDiploknema butyracea\nTrees of India\nReferences"
    }
  ]
}