{
  "content": [
    {
      "type": "text",
      "text": "# Picking sequence\n\nA picking sequence is a protocol for fair item assignment. Suppose m items have to be divided among n agents. One way to allocate the items is to let one agent select a single item, then let another agent select a single item, and so on. A picking-sequence is a sequence of m agent-names, where each name determines what agent is the next to pick an item.\nAs an example, suppose 4 items have to be divided between Alice and Bob. Some possible picking sequences are:\n* AABB - Alice picks two items, then Bob picks the two remaining items.\n* ABAB - Alice picks one item, then Bob picks one item, then Alice again, then Bob again. This is more \"fair\" than AABB since it lets Bob more chance to get a better item.\n* ABBA - Alice picks one item, then Bob picks two items, then Alice receives the remaining item. This is intuitively even more \"fair\" than ABAB, since, in ABAB, Bob is always behind of Alice, while ABBA is more balanced.\nAdvantages\nA picking-sequence has several merits as a fair division protocol:\n* Simplicity: it is very easy for the agents to understand how the protocol works and what they should do in each step - just pick the best item.\n* Privacy: the agents do not have to reveal their entire valuation function or even their entire ranking. They only have to reveal what item is the best for them in each step.\n* Low communication complexity: it requires only m reports, each of which includes a number between 1 and m, so that the total complexity is \\Theta(m \\log{m}).\nWelfare maximization\nHow should the picking sequence be selected? Bouveret and Lang study this question under the following assumptions:\n* Each agent has an additive utility function (this implies that the items are independent goods).\n* The agents may have different rankings on the items, but there is a common scoring function that maps the rankings to monetary values (e.g, for each agent, his best item is worth for him x dollars, his second-best item is worth for him y dollars, etc).\n* The allocator does not know the rankings of the agents, but he knows that all rankings are random draws from a given probability distribution.\n* The goal of the allocator is to maximize the expected value of some social welfare function.\nThey show picking-sequences that maximize the expected utilitarian welfare (sum of utilities) or the expected egalitarian welfare (minimum utility) in various settings.\nKalinowski et al show that, when there are two agents with a Borda scoring function, and each ranking is equally probable, the \"round robin\" sequence (ABABAB...) attains the maximal expected sum-of-utilities.\nFairness with different entitlements\nBrams and Kaplan study the problem of allocating cabinet ministries among parties. There is a coalition of parties; each party has a different number of seats in the parliament; larger parties should be allocated more ministries or more prestigious ministries. This is a special case of fair item assignment with different entitlements. A possible solution to this problem is to determine a picking sequence, based on the different entitlements, and let each party pick a ministry in turn. Such a solution is used in Northern Ireland, Denmark and the European parliament.\nBrams assumes that each agent has a strict ordering on the items, and has responsive preferences on bundles of items. This means that, at each point in the picking sequence, there is a single remaining item which is the \"best item\" for the agent. An agent is called sincere (truthful) if, at each point, he picks his best item. If agents have complete information on each other's preferences (as is common among parties), it may not be rational for them to choose truthfully; it may be better for them to make sophisticated (strategic) choices. Thus, the picking sequence induces a sequential game and it is interesting to analyze its subgame-perfect equilibrium. Several results are proved:\n* With two agents, both truthful and strategic choices lead to Pareto efficient allocations. Moreover, the game is monotonic in the following sense: an agent is always better-off if one or more of his positions in the sequence are improved (e.g, Alice is better-off in the sequence ABBA than in BABA). Both properties are still true with three or more agents, as long as they make truthful choices.\n* With three or more agents who make strategic choices, a picking-sequence might lead to inefficient allocations (i.e, the subgame-perfect equilibrium might not be Pareto-efficient).\n* With three or more agents who make strategic choices, the game might be non-monotonic, i.e, an agent might do worse by picking earlier in the sequence.\n* For two agents, there exists a simple modification of the picking-sequence which is a truthful mechanism - picking items truthfully is a dominant strategy. Therefore, there exists a subgame-perfect equilibrium which is Pareto optimal, and the game is monotonic.\nDetermining the picking-sequence\nGiven the agents' different rights, what would be a fair picking sequence?\nBrams suggests to use divisor methods, similar to the ones used for apportionment of congress seats among states. The two most commonly used methods are the ones proposed by Daniel Webster and Thomas Jefferson. Both methods start in the same way:\n* Calculate the divisor - the sum of the entitlements divided by the number of items (e.g, if the sum of all entitlements is 201, and there are 15 items to share, then the divisor is 201/15).\n* Calculate the quota - the fractional number of items each agent is entitled to. This is the entitlement divided by the divisor (e.g, for an agent with an entitlement of 10 out of 201, the quota is 10*15/201 ~ 0.75 items).\nCompetitive equilibrium\nPicking sequences can be used to find allocations that satisfy a strong fairness and efficiency condition called competitive equilibrium.\nSee also\n* Round-robin item allocation, a special case of a picking sequence in which the sequence is cyclic (1, 2, ..., n, 1, 2, ..., n, ...)\n* List of traditional children's games, which often require the selection of teams\nReferences"
    }
  ]
}