{
  "content": [
    {
      "type": "text",
      "text": "# Picking Cotton\n\n\"Picking Cotton\" is one of Erskine Caldwell's earlier  short stories, included in We Are the Living (1933). It is conspicuous for its humorous treatment of the theme of inter-racial sex, which was at the time of publication, highly controversial and, in many US states, illegal.\nPlot summary\nThe story begins with a detailed description of working conditions during the cotton-picking season, on Donnie Williams'  farm.  Workers prefer the Williamses to other farmers, despite the fact that they pay thirty five cents for hundred pounds while other farmers may offer forty or even fifty cents; this, because the Williamses are unique in offering at dinner \"a free, good sized watermelon, for every man, woman and child\"—an obvious attraction to those having to do hard work under the hot sun.\nBoth whites and blacks are employed on the Williams Farm, with no segregation or discrimination. Early every morning, workers flock to the Williams Farm—with the composition of the work-force changing from day to day, since some workers also have their own small plots, and others are itinerant workers moving through the countryside. Donnie Williams prefers his hired hands to work in pairs, since big crowds of workers tend to waste time gossiping and telling jokes rather than working.\nOn some occasions Harry, the narrator, was paired off with an African American named Sonny. He welcomed such occasions since Sonny worked as a houseboy to Mrs. Williams and could tell a lot of interesting gossip.\nOn other occasions, Harry is paired off with a fifteen-year-old red-headed girl called Gertie, who is in the habit of repeatedly asking him riddles while picking  cotton. As soon becomes clear, many of these riddles have a provocative content, such as \"do you know what is the age of consent?\" and \"Why does an old maid look under the bed at night before she puts off the light?\". Moreover, Gertie is in the habit of lifting her calico skirt to fan her face with,  revealing to Harry that she is wearing nothing underneath—which makes it hard for him to concentrate on picking cotton.\nThe point of these teasings and provocations becomes clear when one day they pass a black-haired girl and Gertie tells Harry that on the previous day this girl was paired off with a boy named Dennis, and that at the end of the day she had weighed-in four hundred pounds while the boy had only fifty pounds—clearly implying that Dennis had given away much of his harvest in return for sexual favours, in effect a form of prostitution.\nGertie then reveals to Harry that she herself was paired off with Sonny, from whom she got a hundred pounds of cotton. Harry reacts with an angry outburst: \"Did you let that damn nigger... I am going to beat hell out of him, he ought to have better sense than to pair off with a white girl!\"\nGertie, unruffled, continues to provoke Harry, who does not realize that she is manipulating his racism and jealousy in order to make him \"outbid\" Sonny and give two hundred pounds for her favors—which at the conclusion of the story he does.\nReferences"
    }
  ]
}