{
  "content": [
    {
      "type": "text",
      "text": "# Pilgrim Monument\n\n;Rises  above sea level\n| begin         = June 20, 1907\n| complete      =\n| open          =\n| dedicated_to  = The first landfall of the Pilgrims in 1620, and the signing in Provincetown Harbor of the Mayflower Compact.\n| relief        =\n| coordinates   =\n| website       =\n| extra         = This is the tallest all-granite structure in the United States.\n}}\nThe Pilgrim Monument in Provincetown, Massachusetts, was built between 1907 and 1910 to commemorate the first landfall of the Pilgrims in 1620 and the signing of the Mayflower Compact in Provincetown Harbor. This  campanile is the tallest all-granite structure in the United States and is part of the Provincetown Historic District.\nHistory\nIn 1620, the Pilgrims spent five weeks exploring Cape Cod before they sailed to Plymouth, Massachusetts. After spending weeks at sea, the Pilgrims resolved not to set foot on land until the Mayflower Compact was written and signed. In 1906 a contest was held to design a structure to commemorate the Pilgrims' landing, and over 150 entries were submitted. The winning design, by Boston architect Willard T. Sears, was based upon the Torre del Mangia in Siena, Italy, designed by Agostino and Agnolo da Siena in 1309.\nIn a ceremony on August 20, 1907, President Theodore Roosevelt officiated at the laying of the cornerstone. After the monument's completion, President William H. Taft dedicated it at a ceremony held on August 5, 1910.\nThe design was controversial because of its lack of any obvious relevance to the Pilgrim Fathers. One Boston architect derided it, saying \"If all they want is an architectural curiosity, then why not select the Leaning Tower of Pisa and be done with it?\" It was also noted that Boston itself already had a copy of the same tower: Boston's fire tower. The fire tower is made of brick like the Italian original, was built in 1892 by Edmund March Wheelwright, is  tall, was originally designed as part of the central fire station and used as a fire lookout, and later became part of the Pine Street Inn, a shelter for Boston's homeless.\nHowever, The Boston Globe noted that \"The people of Provincetown are not at all enthusiastic about the design, but are glad enough to get almost any sort of monument,\" and quoted \"an old sea captain\" as saying: \"I don't sympathize with all the kicking about the monument. It's good enough, and it has this in its favor, that it resembles many lighthouses on the coast of Portugal and on Portuguese Islands, and Provincetown, you know, is full of Portuguese.\"\nTourists from around the world visit Provincetown to climb the monument and view the Provincetown Museum at its base. The monument commemorates the Pilgrims, and the museum pays tribute to Provincetown's vibrant and historic maritime past. Provincetown residents take great pride in the structure. Christmas lights are strung from the top of the monument to its base annually and are lit in November to much fanfare.  It remains lit nightly into January.\nAccording to Edmund J. Carpenter in his book The Pilgrims and their Monument (self-published in 1911), the total expenditures in the planning and construction of the monument were $91,252.82, .\nGallery\nFile:Pilgrim Monument (intérieur).jpg|alt=|Interior of the monument showing the ramps used to reach the top\nFile:Pilgrim Monument.png|alt=|Monument in 1910\nFile:Provincetown - PM Mural 1.jpg|View of structure housing Signing of the Mayflower Compact\nFile:MayflowerCompactBasrelief.jpg|Signing of the Mayflower Compact by Cyrus Dallin\nReferences\nExternal links\n* [http://www.pilgrim-monument.org Pilgrim Monument and Provincetown Museum]"
    }
  ]
}