{
  "content": [
    {
      "type": "text",
      "text": "# Pilkington Jackson\n\n| death_place      = Edinburgh, Scotland\n| resting_place    =\n| resting_place_coordinates =\n| nationality      = British\n| education        =\n| alma_mater       = Edinburgh College of Art\n| known_for        = Sculpture\n| notable_works    =\n| style            =\n| movement         =\n| spouse           =\n| partner          =\n| awards           =\n| elected          =\n| patrons          =\n| memorials        =\n| website          =\n| module           =\n}}\nCharles d’Orville Pilkington Jackson RSA, FRBS, FRSA (11 October 1887 – 20 September 1973) was a British sculptor prominent in Scotland in the 20th century. Throughout his career he worked closely with the architect Sir Robert Lorimer. He is most noteworthy for his creation of one of Scotland's most iconic landmarks, the statue of Robert the Bruce at Bannockburn.\nEarly life\nCharles d'Orville Pilkington Jackson was born at Garlenick near Grampound, Cornwall the son of Ethel Katie D'Orville Smith. She had married his father on the 3rd May 1886, 22 year old medical student Louis Pilkington Jackson in an irregular marriage at 138 George Street, Glasgow.\nCharles attended the Edinburgh Institution from 1905 and the newly established Edinburgh College of Art in 1907, studying design and sculpture. He graduated in 1910 and received a travelling scholarship of £100, which he used to visit the British School in Rome. Whilst in Rome he worked with Giacomo Boni on the rebuilding of the Arch of Titus.\nCareer\nnear the Bannockburn Visitor Centre]]\nIn 1911, on his return to Scotland, Jackson established himself in a studio with William MacDonald, a bronze founder. During World War I he served with the British Army as a subaltern in the Royal Field Artillery and the Intelligence Corps in Egypt and Palestine, being Mentioned in Dispatches.\nAfter the war he received numerous commissions to design war memorials and these extend across the whole width and breadth of Scotland. He was appointed as \"supervising sculptor\" for the Scottish National War Memorial, which was planned and built within Edinburgh Castle between 1919 and 1927. He was also commissioned to create numerous memorials to famous Scots, including tableaux at the David Livingstone Centre, and a memorial to Elsie Inglis, on which he collaborated with Sir Frank Mears. In 1929 he went on holiday to Sweden with Robert Lorimer and visited the eminent Swedish sculptor Carl Milles whom he acknowledged as a great influence on his work.\nIn the Second World War, although being far beyond the age of conscription at 52, he again joined the army, this time serving in Scotland as a Gun Operations Room Officer for anti-aircraft guns. He had an extremely long working career leading to his most famous commission, the statue of Robert the Bruce being executed in 1964 at the age of 76. The mounted statue of Robert the Bruce forms the focal point of the memorial to the 1314 Battle of Bannockburn, and is sited to face southwards, from which direction the English army approached. The statue and monument are listed at category A, and are included as one of the 60 DoCoMoMo Key Scottish Monuments of the post-war period. A copy of this sculpture stands at the Alberta College of Art and Design in Canada, and an alternative version of the monument, showing Bruce on a rearing horse, was later installed at the Chivas Brothers Distillery in Paisley.\nPilkington Jackson exhibited regularly at the Royal Scottish Academy, and was elected as an academician in 1956. He also served on the Royal Fine Art Commission for Scotland, and taught at Edinburgh College of Art in the late 1920s.\nDeath\nPilkington died in Edinburgh on the 20 September 1973.\n}}\n}}\n}}\n}}\n}}\n}}\n}}\n}}\n}}\n}}\n}}\nOther works\n*Stone font, Holy Trinity Church, Ayr\n*Replacement head (in bronze) on the tomb of the 9th Lord Belhaven and Stenton (originally by William Birnie Rhind, 1896), Dean Cemetery (1924)\n*War memorial plaques, both in bronze and slate, for the British Linen Bank (1922) and for the Royal Bank of Scotland (1923) in Dundas House, St Andrew's Square, Edinburgh\n*Black & green marble war memorial plaque for Bank of Scotland staff at the Royal Bank of Scotland, Glasgow Road, Edinburgh (1921)\n*Screen with plaques in the Durham Light Infantry chapel of Durham Cathedral (1923)\n*Painted choir screen, St Serfs Church, Ferry Road, Edinburgh (1926)\n*Stone decorations for the chapel at Stowe School (1927)\n*Sculpture of pelican, porch wall, St Andrew's Garrison Church, Aldershot (1927)\n*A series of bronze tableaux depicting the life of David Livingstone for the David Livingstone Centre at Blantyre (1929)\n*Sculptural relief, exterior of the Crew Building, University of Edinburgh (1926–1932)\n*Series of 82 military statuettes for the United Services Museum in Edinburgh Castle (1929–33)\n*Lectern, pulpet and Elders' seats for Ardgour parish church in the Scottish Highlands (1930)\n*Bust of Gerard Baldwin Brown, Edinburgh University (1931)\n*Monument, a life-sized seated statue, to the child author Marjorie Fleming in Kirkcaldy Parish Church (1935)\n*Memorial to Evelyn, Lady Rayleigh, died 1934, in Chelmsford Cathedral\n*Carved decorative panel on the exterior of Dundee Street Library, Edinburgh (1938)\n*Bust of James Clerk Maxwell for University of Aberdeen, Marischal College (1956); a later copy is displayed at the James Clerk Maxwell Foundation in Edinburgh\n*Bronze bust of Frederick Lugard for Hong Kong University with a copy in the National Portrait Gallery, London (1960)\n*Fibreglass sculpture of Robert the Bruce on a rearing horse (a working model not chosen for use on the Bannockburn site) at the Chivas Brothers Distillery in Paisley (1964)\n*La Poliche Libre at the Royal Scottish Academy (1972)\n*Sculpture of the Good Shepherd in the church of St James, Goldenacre, Edinburgh.\nReferences\n*Papers of the late Charles D'Orville Pilkington Jackson Esq, National Library of Scotland, [http://www.nls.uk/catalogues/online/cnmi/inventories/acc7445.pdf Inventory account 7445]\n*\nExternal links\n*\n*"
    }
  ]
}