{
  "content": [
    {
      "type": "text",
      "text": "# Pinchot South Sea Expedition\n\nThe Pinchot South Sea Expedition was a 1929 zoological expedition to the Caribbean and South Pacific led and financed by Gifford Pinchot.\nItinerary and personnel\nThe expedition departed from New York City on 31 March 1929 aboard the Pinchots' yacht Mary Pinchot. Gifford Pinchot organized, financed, and led the expedition, which collected zoological specimens (and a few botanical specimens) for the U.S. National Museum of Natural History. The captain was Frederick A. Brown of Port Jefferson, New York, and the chief engineer was Henry Christensen. Aboard ship, besides the captain and crew, were Gifford Pinchot, his wife and fellow conservationist Cornelia Bryce Pinchot, their son Gifford Pinchot, Jr. (1916–1989), and Pinchot Jr.'s schoolmate Steve Stahlnecker. The expedition's photographer was Howard H. Cleaves, and its physician was J. B. Mathewson. The expedition's professional scientists were the malacologist Henry A. Pilsbry and the ornithologists A. K. Fisher and Alexander Wetmore. Harry A. Slattery accompanied the expedition from New York City to Panama. The yacht Mary Pinchot visited Key West (for a few days undergoing minor yacht repairs) and then Havana (for a one-day tourist trip). The expedition then visited Grand Cayman, the Swan Islands, Isla de Providencia and Isla de San Andrés for collecting specimens. The Mary Pinchot went through the Panama Canal and then to Cocos Island. The expedition collected in the Galápagos, Marquesas, and Tuamotus. The expedition reached its final destination, Tahiti, on October 15. Before the end of October, Pinchot's party departed Tahiti and then returned by steamer to San Francisco. By early November, Pinchot and his family were in Washington, D.C. Captain Brown and the crew of the Mary Pinchot went back through the Panama Canal and arrived at the yacht's winter station at Savannah, Georgia in December 1929.\nDocumentary of the expedition\nHoward Cleaves documented the expedition with a motion picture film that was shown in movie theaters throughout the United States. Cornelia Bryce Pinchot gave free talks with showings of Cleaves's documentary film.\nMordaunt Hall, a 1930s movie critic, wrote concerning Cleaves's film:\n}}\nCollections and discoveries\nThe expedition brought back several living reptiles:\n}}\nOn Isla de Providencia, the expedition discovered a new lizard species, which Doris Cochran named Anolis pinchoti.\nThe expedition discovered the fish species Entomacrodus corneliae, which Henry Fowler named Giffordella corneliae.\nThe expedition's malacologist Pilsbry identified several new mollusk species, including the genus Giffordius (two species) and Chionopsis pinchoti. Pilsbry's claim of a new species Drymaeus pinchoti is rejected in favor of the subspecies Drymaeus rufescens pinchoti; Codakia pinchoti is rejected in favor of Codakia distinguenda.\nA. K. Fisher and Alexander Wetmore, with the assistance of Pinchot Sr. and Jr., collected approximately 500 bird skins and skeletons and a few eggs; Fisher made detailed field notes.\nReferences\nExternal links\n*[http://www.afi.com/members/catalog/DetailView.aspx?s=1&Movie=12317 South Seas, release date: 1 Sep 1930, duration: 64 min., AFI Catalog of Feature Films]"
    }
  ]
}