{
  "content": [
    {
      "type": "text",
      "text": "# Piotr Edward Dankowski\n\n|death_date=\n|venerated_in=Roman Catholic Church\n|birth_place=Jordanów, Poland\n|death_place=Auschwitz\n|beatified_date=13 June 1999\n|beatified_place=Poland\n|beatified_by=Pope John Paul II\n|canonized_date=\n|canonized_place=\n|canonized_by=\n|attributes=\n|patronage=\n|major_shrine=\n|suppressed_date=\n|issues=\n|feast_day= April 3 and 12 June as one of the 108 Martys of World War II\n}}\nPiotr Edward Dańkowski (born June 21, 1908, in Jordanów, died on April 3, 1942, in Auschwitz) is a Polish Catholic saint who is one of the 108 Martyrs of World War II beatified by Pope John Paul II.  He is the patron saint of clerics and priests of the Archdiocese of Krakow.\nBiography\nHis father worked as a shoemaker and he was raised on a farm. He graduated from the gymnasium in Nowy Targ and in 1926, he entered the Major Seminary of the Archdiocese of Krakow. He studied theology at Jagiellonian University and was ordained a priest on February 1, 1931, at the Church of St. Anna.\nDańkowski worked as a priest in the various Polish parishes in the 1930s.  In Zakopane, he was a religious instructor at the gymnasium and high school, as well as being a confessor of the Albertine Sisters and was involved in social work.\nDuring the war, he was active in the Polish Resistance ZWZ under the pseudonym \"Jordan\". Together with his brother Stanisław, he translated allied radio and helped edit ZWZ pamphlets. He was arrested on May 10, 1941, and subjected to interrogation in the Gestapo headquarters in Zakopane. He was held in a prison in Tarnów, and in December 1941 he was transferred to the Auschwitz concentration camp. He was given the camp number 24 529  and was transferred into  Auschwitz III subcamp working on the early construction of the  Buna Werke factory of the IG Farben complex in the camp.“Beato Pietro Edoardo Dankowski S“. http://www.santiebeati.it/. 07 April 2020. Web. 4 February 2021.\nHe died sick and exhausted after being beaten by a Kapo with a trunk tied to his shoulders on April 3, 1942, Good Friday. His last words to a friend were \"See you in the Kingdom of God!\"\nHis body was destroyed in the crematorium.“Blessed Piotr Edward Dankowski“. CatholicSaints.Info. 19 March 2019. Web. 4 February 2021.\nHe was beatified along with 108 other martyrs of World War II on June 13, 1999, by Pope John Paul II.\nReferences"
    }
  ]
}