{
  "content": [
    {
      "type": "text",
      "text": "# Pippi Longstocking (1969 film)\n\n| studio         = Beta FilmKB Nord ArtSvenks ABSveriges Radio\n| distributor    = G.G. Communications (United States)\n| runtime        = 100 min.\n| country        = SwedenWest Germany\n| language       = Swedish, German\n}}\nPippi Longstocking (original German title: Pippi Langstrumpf) is a 1969 Swedish/West German movie, based on the eponymous children's books by Astrid Lindgren with the cast of the 1969 TV series Pippi Longstocking. The film consisted of re-edited footage from the TV series featuring a new soundtrack. It was produced by Beta Film, one of the German co-producers of the original show, while the Swedish TV series was still in post-production and has never been aired in Sweden. The movie was followed by Pippi Goes on Board, released later in the same year. It was released in the US in 1973.\nPlot\nA mysterious young girl, Pippi Longstocking, moves into the abandoned Villa Villekulla. The redheaded Pippi, living alone but for a monkey called Mr. Nilsson and her horse Little Old Man, befriends two neighboring children, Tommy and Annika. Soon inseparable companions, the three youngsters embark upon a series of colorful escapades, which turn the small Swedish town upside down. Local busybody Miss Prysselius schemes to have Pippi put into a children's home, and sets the town's bumbling cops Kling and Klang on her with riotous results.\nCast\n{|class=\"wikitable\"\n|-\n!Character\n!Original actor\n!English Dubbing\n|-\n!Pippi Longstocking\n|Inger Nilsson\n|Susan Davis\n|-\n!Annika\n|Maria Persson\n|\n|-\n!Tommy\n|Pär Sundberg\n|\n|-\n!Captain Efraim Longstocking\n|Beppe Wolgers\n|\n|-\n!Mrs. Prysselius\n|Margot Trooger\n|\n|-\n!Dunder-Karlsson\n|Hans Clarin\n|\n|-\n!Blom\n|Paul Esser\n|\n|-\n!Police Inspector Kling\n|Ulf G. Johnsson\n|\n|-\n!Police Inspector Klang\n|Göthe Grefbo\n|\n|-\n!Mr. Settergren\n|Fredrik Ohlsson\n|\n|-\n!Mrs. Settergren\n|Öllegård Wellton\n|\n|-\n!Benke\n|Staffan Hallerstam\n|\n|-\n|}\nDubbing Staff\n*Voice Director: Gordon Zahler\nIn popular culture\nThe film is shown in the episode \"We Got Us a Pippi Virgin\" of season 5 of Gilmore Girls. In the episode, Rory Gilmore and Lorelai Gilmore profess their love for the film and choose to watch it in place of Cool Hand Luke.\nSee also\n*Pippi Longstocking - character\n*Pippi Longstocking - Swedish television series\nReferences\nExternal links\n*\nno:Pippi Langstrømpe I (1969)"
    }
  ]
}