{
  "content": [
    {
      "type": "text",
      "text": "# Pitrbhakta dynasty\n\n{{Infobox Former Country\n| conventional_long_name = Pitrbhakta dynasty\n| common_name            = Pitrbhakta dynasty\n| era                    = Classical India\n| year_start             = c. 5th century CE\n| year_end               = c. 6th century CE\n| religion               = Hinduism\n| government_type        = Monarchy\n| capital                = Simhapura\n| common_languages       =\n| p1                     = Mathara dynasty\n| p2                     = Vasishtha dynasty\n| s1                     = Eastern Ganga dynasty\n| image_map =\n{\n\"type\": \"FeatureCollection\",\n\"features\": [\n{\n\"type\": \"Feature\",\n\"properties\": { \"marker-symbol\": \"monument\", \"title\": \"Rakaluva (Ragolu)\" },\n\"geometry\": { \"type\": \"Point\", \"coordinates\": [83.8936796, 18.3492579] }\n},\n{\n\"type\": \"Feature\",\n\"properties\": { \"marker-symbol\": \"monument\", \"title\": \"Tekkali\" },\n\"geometry\": { \"type\": \"Point\", \"coordinates\": [84.2301531, 18.6057678] }\n},\n{\n\"type\": \"Feature\",\n\"properties\": { \"marker-symbol\": \"monument\", \"title\": \"Davalapeta\" },\n\"geometry\": { \"type\": \"Point\", \"coordinates\": [83.3121281, 18.2722395] }\n},\n{\n\"type\": \"Feature\",\n\"properties\": { \"marker-symbol\": \"monument\", \"title\": \"Temburu\" },\n\"geometry\": { \"type\": \"Point\", \"coordinates\": [84.1263623, 18.6314777] }\n},\n{\n\"type\": \"Feature\",\n\"properties\": { \"marker-symbol\": \"monument\", \"title\": \"Srikakulam\" },\n\"geometry\": { \"type\": \"Point\", \"coordinates\": [83.8967813, 18.2969747] }\n},\n{\n\"type\": \"Feature\",\n\"properties\": { \"marker-symbol\": \"monument\", \"title\": \"Ragolu\" },\n\"geometry\": { \"type\": \"Point\", \"coordinates\": [83.8936796, 18.3492579] }\n},\n{\n\"type\": \"Feature\",\n\"properties\": { \"marker-symbol\": \"monument\", \"title\": \"Bobbili\" },\n\"geometry\": { \"type\": \"Point\", \"coordinates\": [83.3583654, 18.5735047] }\n},\n{\n\"type\": \"Feature\",\n\"properties\": { \"marker-symbol\": \"monument\", \"title\": \"Komarthi\" },\n\"geometry\": { \"type\": \"Point\", \"coordinates\": [84.0154204, 18.3944762] }\n},\n{\n\"type\": \"Feature\",\n\"properties\": { \"marker-symbol\": \"monument\", \"title\": \"Koroshanda or Kharasanda\" },\n\"geometry\": { \"type\": \"Point\", \"coordinates\": [84.1817567, 18.8166088] }\n}\n]\n}\n}}\nThe Pitrbhakta (IAST: Pitṛbhakta) dynasty ruled in the Kalinga region of eastern India in the fifth century CE. Their territory included parts of the present-day northern Andhra Pradesh and the southern Odisha. They probably overthrew the Mathara dynasty.\nHistory\nThe actual name of the family is not certain. The inscriptions of its kings describe them as pitṛabhaktaḥ (devotee of their fathers), which modern scholars have taken to be a dynastic appellation.\nUmavarman\nUmavarman is the earliest known king of the dynasty. Epigraphic evidence suggests that he overthrew the Mathara king Anantashaktivarman. Mātṛvara, a Simhapura-based royal officer held the office of deśākṣapatalādhikṛta under the Mathara king Anantashaktivarman. Later, he held the same office under the Pitrbhakta king Umavarman, as attested by two grants of Umavarman. These two grants were issued from Simhapura during Umavarman's regnal years 30 and 40. Both describe the king as the Kalingadhipati (\"Lord of Kalinga\"), unlike his earlier grants. Both mention Mātṛvara as Umavarman's deśākṣapatalādhikṛta. Anantashaktivarman thus seems to have been a rival of Umavarman.\nUmavarman's last known inscription (the one issued in regnal year 40) mentions his son Vasushenaraja. This prince is not mentioned in any other source. The inscription records the creation of a new agrahara named after Kalinga; the agrahara was granted to a brahmana of the Vasishtha gotra.\nThe find spots of Umavarman's inscriptions, and the localities mentioned in them, are all situated in present-day Ganjam (southern part), Srikakulam, and Visakhapatnam districts.\nNandaprabhanjanavarman\nThe next known Pitrbhakta king is Nandaprabhanjanavarman. He issued grants from Sarapallika, Vardhamanapura and Simhapura. All three inscriptions describe him as Sakala-Kalingadhipati (\"Lord of the whole of Kalinga\"). The only other person in the region to use this title was the Mathara king Prabhanjanavarman. Because of this, some scholars believe them to be contemporary rulers. However, historical evidence suggests that Nandaprabhanjanavarman was a later ruler.\nThe Ragolu inscription of Nandaprabhanjanavarman, issued from Simhapura, records a land grant in the Ragolaka village (modern Ragolu). An inscription of the Mathara king Shaktivarman records the creation of an agrahara in the same village. This further suggests that Pitrbhaktas succeeded the Matharas as the rulers of this region.\nChandavarman\nChandavarman is the next known Pitrbhakta ruler. He bore the title Kalingadhipati (\"Lord of Kalinga\"), and was a devotee of Vishnu. Mātṛvara's son Rudradatta served as his deśākṣapatalādhikṛta.\nVishakhavarman\nA king named Vishakhavarman, known only from one inscription, ruled the Paralakhemundi area (in present-day Gajapati district) in the late 5th century. His Koroshanda inscription has close palaeographical and phraseological similarities with the Pitrbhakta inscriptions. Specifically, the inscription describes him as a devotee at the feet of his father. This suggests that he was a contemporary of the Pitrbhaktas or ruled immediately after their fall from Simhapura. The inscription was issued from Shripura, which has been variously identified as Siripuram in the Vishakhapatnam district and the Batia Sripura village. The second identification is more plausible, as Batia Sripura is located near Koroshanda, the find spot of the inscription. Vishakhavarman did not bear the title \"Lord of Kalinga\". The Batia Sripura identification suggests that his rule was limited to the southern part of the present-day Ganjam district.\nThe Koroshanda inscription records the grant of a village named Tampoyaka in the Korasodaka panchali (administrative division). Tampoyaka can be identified with the present-day Tampa village, while Korasodaka can be identified with the find-spot Koroshanda.\nOne theory traces the name of Vishakhapatnam to this king, who may have built the Vishakhasvamin temple here. However, this is no concrete evidence to support this assumption.\nVishakhavarman was probably overthrown by the Eastern Gangas, who had captured the region by the 6th century CE.\nList of rulers\nThe following members of the family are known:\n* Uma-varman (Umāvarman)\n** Vasushena-raja (Vasuṣeṇarāja), son of Umavarman\n* Nanda-prabhañjana-varman\n* Chanda-varman (Caṇḍavarman or Acaṇḍavarman)\n* Vishakha-varman (Viśakhāvarman), possibly a Pitrbhakta king\nThe exact relationship between these rulers is uncertain.\nInscriptions\nThe following copper-plate inscriptions of the Pitrbhakta kings are known:\n{| class=\"wikitable\"\n! Find spot !! Issued by !! Issued from !! Regnal year\n|-\n| Baranga || Umavarman || Sunagara || 6\n|-\n| Tekkali || Umavarman || Vardhamanapura (modern Vadama near Palakonda) || 9\n|-\n| Davalapeta || Umavarman || Sunagara ||\n|-\n| Unknown (mentions Brhatprostha locality) || Umavarman || Simhapura || 30\n|-\n| Temburu || Umavarman || Simhapura || 40\n|-\n| Srikakulam || Nandaprabhanjanavarman || Sarapallika (modern Saripialli in Vizianagaram district) ||\n|-\n| Baranga || Nandaprabhanjanavarman || Vardhamanapura || 15\n|-\n| Ragolu || Nandaprabhanjanavarman || Simhapura || 24\n|-\n| Bobbili || Chandavarman || Simhapura || 4\n|-\n| Komarthi || Chandavarman || Simhapura || 6\n|-\n| Koroshanda (Kharasanda) || Vishakhavarman (possibly a Pitrbhakta king) || Shripura || 7\n|}\nAll the records are in Sanskrit language, written in a southern variety of the Brahmi script.\nReferences\nBibliography\n*\n*\nExternal links\n* [http://indepigr.narod.ru/orissa/menulisting6.htm Pitrbhakta inscriptions]"
    }
  ]
}