{
  "content": [
    {
      "type": "text",
      "text": "# Pitted Ware culture\n\nThe Pitted Ware culture (&nbsp;3500 BC–&nbsp;2300 BC) was a hunter-gatherer culture in southern Scandinavia, mainly along the coasts of Svealand, Götaland, Åland, north-eastern Denmark and southern Norway. Despite its Mesolithic economy, it is by convention classed as Neolithic, since it falls within the period in which farming reached Scandinavia. The Pitted Ware people were largely maritime hunters, and were engaged in lively trade with both the agricultural communities of the Scandinavian interior and other hunter-gatherers of the Baltic Sea.\nThe people of the Pitted Ware culture were a genetically homogeneous and distinct population descended from earlier Scandinavian Hunter-Gatherers (SHGs). The culture emerged in east-central Sweden around 3,500 BC, gradually replacing the Funnelbeaker culture throughout the coastal areas of southern Scandinavia. It subsequently co-existed with the Funnelbeaker culture for several centuries.\nFrom about 2,800 BC, the Pitted Ware culture co-existed with the Battle Axe culture, which was the successor of the Funnelbeaker culture in southern Scandinavia. }} By 2,300 BC, the Pitted Ware culture had been absorbed by the Battle Axe culture. The subsequent Nordic Bronze Age represents a fusion of elements from the Pitted Ware culture and the Battle Axe culture. Modern Scandinavians, unlike the Sami, display partial genetic origins from the Pitted Ware people.\nHistory\nand the Pitted Ware cultures.|262x262px]]\nGenetic studies suggest that the Pitted Ware peoples, unlike their Neolithic neighbors, were descended from earlier Scandinavian Hunter-Gatherers (SHGs). At the time of the emergence of the Pitted Ware culture, these hunter-gatherers persisted to the north of the agricultural Funnelbeaker culture. Their ceramic traditions are related to those of the Comb Ceramic culture. Because of this, Pitted Ware Culture is often combined with Comb Ceramic Culture to form Pit Comb Ware Culture.\nThe Pitted Ware culture arose around 3,500 BC. Its earliest sites are found in east-central Sweden, where it appears to have replaced the Funnelbeaker culture. Its subsequent expansion is accompanied by the disappearance of settlements of the Funnelbeaker culture throughout large parts of southern Scandinavia. It came to occupy the coasts of Denmark, southern Sweden, southern Norway and various islands of the Baltic Sea, such as Öland, Gotland, and Åland. There were lively contacts with hunter-gatherer communities of Finland and the eastern Baltic. During its initial years, the Pitted Ware culture co-existed with the Funnelbeaker culture. Although the two cultures exchanged goods with each other, its peoples appear to have had widely different identities, and they did not mix with each other to any notable extent. During the period of Pitted Ware expansion, the Funnelbeakers constructed a number of defensive palisades, which may mean that the two peoples were in conflict with each other. There is archaeological evidence of high levels of violence among the people of the Pitted Ware culture. Throughout its existence of more than 1,000 years, the Pitted Ware culture remained virtually unchanged.\nFrom around 2,800 BC, the Pitted Ware culture co-existed for some time with the Battle Axe culture and the Single Grave culture, which succeeded the Funnelbeaker culture in southern Scandinavia. Both were variants of the Corded Ware culture. Like the Funnelbeakers, the Corded Ware constructed a series of defensive palisades during this period, which may be a sign of violent conflict between them and the Pitted Ware. Though cultural influences of the Battle Axe culture are detectable in Pitted Ware burials, its peoples do not appear to have mixed with each other. By ca. 2,300 BC, the Pitted Ware culture had merged with the Battle Axe culture. The subsequent Nordic Bronze Age represents a fusion of elements from the Pitted Ware culture and the Battle Axe culture.\nSettlements\nPitted Ware settlements were typically located along the coasts. They usually lived in huts.\nEconomy\nTrindyxa (round stone axe), Gotland, [[Sweden]]\nThe economy of the Pitted Ware culture was based on fishing, hunting and gathering of plants. Pitted Ware sites contain bones from elk, deer, beaver, seal, porpoise, and pig. Pig bones found in large quantities on some Pitted Ware sites emanate from wild boar rather than domestic pigs. The hunting of seal was particularly important. For this reason, the Pitted Ware people have been called \"hard-core sealers\" or the \"Inuit of the Baltic\".\nSeasonal migration was a feature of life, as with many other hunter-gatherer communities. Pitted Ware communities in Eastern Sweden probably spent most of the year at their main village on the coast, making seasonal forays inland to hunt for pigs and fur-bearing animals and to engage in exchange with farming communities in the interior. This type of seasonal interaction may explain the unique Alvastra Pile Dwelling in south-western Östergötland, which belongs to the Pitted Ware culture as far as the pottery is concerned, but to the Funnelbeaker culture in tools and weapons.\nThe Pitted Ware peoples appear to have been specialized hunters who engaged in the trade of animal goods with peoples throughout the Baltic.\nTools\nThe repertoire of Pitted Ware tools varied from region to region. In part this variety reflected regional sources of raw materials. However the use of fish-hooks, harpoons, and nets and sinkers was fairly widespread. Tanged arrow heads made from blades of flintstone are abundant on Scandinavia's west coast, and were probably used in the hunting of marine mammals.\nCeramics\nA pottery shard showing the characteristic pits, from Uppland, [[Sweden]]\nOne notable feature of the Pitted Ware Culture is the sheer quantity of shards of pottery on its sites. The culture has been named after the typical ornamentation of its pottery: horizontal rows of pits pressed into the body of the pot before firing.\nThough some vessels are flat-bottomed, others are round-based or pointed-based, which would facilitate stable positioning in the soil or on the hearth. In shape and decoration, these ceramics reflect influences from the Comb Ceramic culture (also known as Pit-Comb Ware) of Finland and other parts of north-eastern Europe, established in the sixth and fifth millennia BC.\nSmall animal figurines were modelled from clay, as well as bone. These are also similar to the art of the Comb Ware culture. A large number of ceramic figurines have been found at Jettböle on the island of Jomala  in Åland, including some which combine seal and human features.\nGraves\nA characteristic moose figurine, from Åloppe, Uppland, [[Sweden]]\nThe Pitted Ware people buried their dead in cemeteries. Most excavated Pitted Ware burials are located at Gotland, where around 180 graves have been found at numerous sites with several layers. One such site is at Västerbjers.\nPitted Ware people were typically buried in flat inhumation graves, although cremation does occur. Unlike the Funnelbeakers, they did not have megalithic graves. Pitted Ware burials are also distinguished from Funnelbeaker burials through their use of red ochre.\nGrave goods include ceramics, boar tusks, pig jaws, pendants of fox, dog and seal teeth, harpoons, spears, fishhooks of bone, stone and flint axes, and other artifacts. The presence of slate artifacts and battle axes attest wide-ranging contacts between the Pitted Ware people and other cultures of Northern Europe and the Baltic. People of all ages and genders were buried in the same cemetery. There are no indications of difference in social status. Their mortuary houses and secondary burials are nevertheless evidence of complex burial customs.\nCulture\nThe Pitted Ware people had an animistic cosmography similar to that of the people of the Comb Ceramic culture and other Mesolothic hunter-gatherers of the Baltic.\nPhysical anthropology\nOsteological measurements have shown that the PWC physiologically adapted to the cold climate, by having narrower noses, shorter legs, and a lower bone mineral density, as opposed to other contemporaneous groups.\nGenetics\nGenetic studies of the Pitted Ware peoples have found them to have been strikingly genetically homogenous, suggesting that they originated from a small founder group.\nAlready Malmström (2009) extracted mtDNA from seventeen Pitted Ware people of Gotland. Eight individuals belonged to U4 haplotypes, seven belonged to U5 haplotypes, one to K1a1, one to T2b, and one to HV0. The results debunked previous theories suggesting that the Pitted Ware were related to the Sami people. }} On the contrary, Pitted Ware people showed closer genetic kinship to modern Balts, Estonians, and modern Scandinavians.\nIn a genetic study published in BMC Evolutionary Biology in March 2010, it was discovered that the Pitted Ware possessed a very low level (5%) of an allele (−13910*T) strongly associated with the ability to consume unprocessed milk. This frequency is dramatically different from modern Swedes (74%). Whether the increase of this allele among the Swedes was a result of admixture or natural selection was uncertain.\nIn a genetic study published in Science in April 2012, an individual from the Pitted Ware culture was examined. The individual was found to have \"a genetic profile that is not fully represented by any sampled contemporary population\".\nIn another genetic study published in Science in May 2014, the mtDNA of six individuals ascribed to the Pitted Ware culture was extracted. Four samples belonged to U4d, one belonged to U, and one belonged to V.\nA genetic study published in August 2014 found that Pitted Ware peoples were closely genetically similar to people of the Catacomb culture, who like the Pitted Ware people carried high frequencies of the maternal haplogroups U5 and U4. These lineages are associated with Western Hunter-Gatherers and Eastern Hunter-Gatherers.\nIn a genetic study published in Nature in September 2014, members of the Pitted Ware culture were determined to largely belong to the Scandinavian Hunter-Gatherer (SHG) cluster.\nIn a genetic study published in Proceedings of the Royal Society B in January 2015, the mtDNA of thirteen PCW individuals from Öland and Gotland was extracted. The four individuals from Öland carried H1f, T2b, K1a1 and U4a1. Of the ten individuals from Gotland, four carried U4, two carried U5 haplotypes, two carried K1a1, and one carried HV0. The results indicated that the Pitted Ware culture was genetically distinct from the Funnelbeaker culture, and closely genetically related to earlier Mesolithic hunter-gatherers of Scandinavia and Western Europe. It was found that the Pitted Ware culture left a genetic imprint on Scandinavians, although this number is certainly not more than 60%.\nA genetic study published in Nature Communications in January 2018 indicated genetic continuity between SHGs and the Pitted Ware culture, and found that the Pitted Ware people were genetically distinct from the Funnelbeaker culture. }}\nA 2018 study described the skin, hair and eye pigmentation of two Pitted Ware individuals from the Ajvide Settlement on the western coast of Gotland. The authors described the Pitted Ware specimens as sharing part of their phenotypic variation with Scandinavian Hunter Gatherers. Both specimens had a high probability of being dark-haired. One exhibited alleles associated with dark skin pigmentation on the SLC24A5 and SLC45A2 genes, while the other specimen carried a mix of alleles at these positions. The two specimens had a high probability of being blue eyed.\nA 2019 study published in Proceedings of the Royal Society B the remains of a Pitted Ware male were analyzed. He was found to the carrying the maternal haplogroup U5b1d2, and probably a subclade of the paternal haplogroup I2. He was estimated to be 25–35 years old and 165–175&nbsp;cm tall. It was found that the Pitted Ware people only slightly contributed to the gene pool of the Battle Axe culture, who were almost wholly of Western Steppe Herder descent.\nA genetic study published in Proceedings of the Royal Society B in June 2020 examined the remains of 19 Pitted Ware individuals buried on the island of Gotland. The study included a number of individuals who had been buried in a way typical of the Battle Axe culture. The 6 samples of Y-DNA extracted belonged to the paternal haplogroup I2a-L460 (2 samples), I2-M438 (2 samples), I2a1a-CTS595 and I2a1b1-L161. The 17 samples of mtDNA extracted belonged overwhelmingly to the maternal haplogroups U4 and U5. The study found no evidence of Battle Axe admixture among the Pitted Ware. They were genetically very different from earlier Funnelbeaker inhabitants of Gotland, although they carried a tiny amount of EEF admixture. The evidence suggested that while the Pitted Ware culture was culturally influenced by the Battle Axe culture, it was not genetically influenced by it.\nSee also\n* Germanic substrate hypothesis\n* Narva culture\n* Rzucewo culture\n* Dnieper-Donets culture\n* Swifterbant culture\n* Zvejnieki burial ground\n* Comb Ceramic culture\nNotes\nReferences\nSources\n*\n*\n*\n*\n*\n*\n*\n*\n* }}\n*\n*\n*\n*\n*\n*\n*\nFurther reading\n*"
    }
  ]
}