{
  "content": [
    {
      "type": "text",
      "text": "# Platine War__disambig_1\n\n* Buenos Aires clout over the Platine region ends\n* Brazilian hegemony in the Platine region starts\n| combatant1        =\nDefence Government\nArgentine rebels\n}}\n*\n*\n*\nCo-belligerent: Supported by:\n|combatant2         =\nCerrito Government\n| commander1        =  Pedro II\n* Justo J. de Urquiza\n}}\nJohn Grenfell\n| Count of Caxias\n| Marques de Sousa\n| Joaquín Suárez\n|\n|\n| Bartolomé Mitre\n| Carlos A. López\n}}\n| commander2        =  Juan M. de Rosas\n}}\nLucio Mansilla\n| Ángel Pacheco\n| Manuel Oribe\n}}\n| strength1         =\n20,200\n*  20,000\n*  2,000\n}}\n| strength2         =\n26,000\n*  8,500\n}}\n| casualties1       = 6,500+ dead and wounded\n| casualties2       =\n}}\nThe Platine War (, ; 18 August 1851&nbsp;– 3 February 1852) was fought between the Argentine Confederation and an alliance consisting of the Empire of Brazil, Uruguay, and the Argentine provinces of Entre Ríos and Corrientes, with the participation of the Republic of Paraguay as Brazil's co-belligerent and ally. The war was part of a decades-long dispute between Argentina and Brazil for influence over Uruguay and Paraguay, and hegemony over the Platine region (areas bordering the Río de la Plata). The conflict took place in Uruguay and northeastern Argentina, and on the Río de la Plata. Uruguay's internal troubles, including the longrunning Uruguayan Civil War (La Guerra Grande – \"The Great War\"), were heavily influential factors leading to the Platine War.\nIn 1850, the Platine region was politically unstable. Although the Governor of Buenos Aires, Juan Manuel de Rosas, had gained dictatorial control over other Argentine provinces, his rule was plagued by a series of regional rebellions. Meanwhile, Uruguay struggled with its own civil war, which started after gaining independence from the Brazilian Empire in 1828 in the Cisplatine War. Rosas backed the Uruguayan Blanco party in this conflict, and further desired to extend Argentine borders to areas formerly occupied by the Spanish Viceroyalty of the Río de la Plata. This meant asserting control over Uruguay, Paraguay, and Bolivia, which threatened Brazilian interests and sovereignty since the old Spanish Viceroyalty had also included territories which had long been incorporated into the Brazilian province of Rio Grande do Sul.\nBrazil actively pursued ways to eliminate the threat from Rosas. In 1851, it allied with the Argentine breakaway provinces of Corrientes and Entre Ríos (led by Justo José de Urquiza), and the anti-Rosas Colorado party in Uruguay. Brazil next secured the south-western flank by signing defensive alliances with Paraguay and Bolivia. Faced with an offensive alliance against his regime, Rosas declared war on Brazil.\nAllied forces first advanced into Uruguayan territory, defeating Rosas' Blanco party supporters led by Manuel Oribe. Afterwards, the Allied army was divided, with the main arm advancing by land to engage Rosas' main defenses and the other launching a seaborne assault directed at Buenos Aires.\nThe Platine War ended in February of 1852 with the Allied victory at the Battle of Caseros, for some time establishing Brazilian hegemony over much of South America. The war ushered in a period of economic and political stability in the Empire of Brazil. With Rosas gone, Argentina began a political process which would result in a more unified state. However, the end of the Platine war did not completely resolve issues within the Platine region. Turmoil continued in subsequent years, with internal disputes among political factions in Uruguay, a long civil war in Argentina, and an emergent Paraguay asserting its claims. Two more major international wars followed during the next two decades, sparked by territorial ambitions and conflicts over influence.\nBackground\nRosas rule in Argentina\n(1793–1877), governor of Buenos Aires and Foreign Affairs head of Argentine Confederation]]\nDon Juan Manuel de Rosas became governor of Buenos Aires after the brief period of anarchy following the end of the Cisplatine War in 1828. In theory, Rosas only held as much power as governors of the other Argentine provinces, but in reality, he ruled over the entire Argentine Confederation, as the country was then known. Although he was one of the Federalists, a faction which demanded greater provincial autonomy, in practice Rosas exercised control over the other provinces, having become a virtual dictator of Argentina. During his 20-year government, the country witnessed the resurgence of armed conflicts between the Unitarians (his rival political faction) and the Federalists.\nRosas desired to recreate the former Viceroyalty of the Río de la Plata, created by the Spanish king Charles III in 1776 and which was extinguished in 1825. He aimed to build a powerful, republican state with Argentina placed at the center. The defunct Viceroyalty had shattered into several separate nations following the Argentine War of Independence at the beginning of the 19th century. To achieve reunification, the Argentine government needed to annex the three neighboring countries – Bolivia, Uruguay and Paraguay, as well as to incorporate a portion of the southern region of Brazil. Rosas first had to gather allies across the region who shared his vision. In some instances, this meant that he had to become involved in the internal politics of neighboring countries, backing those sympathetic to union with Argentina, and occasionally even financing rebellions and wars.\nParaguay\nin blue, and Portuguese-America in green. The viceroyalty was split among Argentina, Bolivia, Brazil, Paraguay and Uruguay after Wars of Independence.]]\nParaguay considered itself a sovereign nation since 1811, but it was not recognized as such by any other nation. Argentina viewed it as a rebellious province. The Paraguayan dictator José Gaspar Rodríguez de Francia decided that the best way to maintain his own rule and the independence of Paraguay from Argentina was to isolate the country from contacts with the outside world. It was for this reason that, up until 1840, Paraguay had avoided establishing diplomatic relations with other nations. With the death of Francia, this policy began to shift, and his successor Don Carlos Antonio López signed two treaties in July 1841. These were the \"Friendship, Commerce and Navigation\" and \"Limits\" agreements made with the Argentine province of Corrientes, which itself had broken away from Argentina under Rosas. Meanwhile, Rosas increasingly put pressure on Paraguay. He continued to refuse to recognize Paraguayan independence and placed a blockade on international traffic to and from Paraguay on the Paraná River.\nParaguay held its own conflict against Juan Manuel de Rosas receiving very substantial support from the Empire of Brazil. President Carlos Antonio López declared war against Rosas and in the first phase of the \"Paraguayan front\" (1845–1846), Paraguay invaded the Province of Corrientes hoping to cause a rebellion alongside the Argentine dissidents led by Gen. José María Paz, which fared poorly. In the second phase however (1847–1850), the Paraguayans under Gen. Francisco Solano López occupied the Province of Misiones which was under Rosas' rule, resisting in their positions while suffering heavy losses against the counterattacks of the forces of Buenos Aires.\nThe friendship and alliance between the Republic of Paraguay and the Empire of Brazil remained strong until 1852, when Rosas was finally overthrown. In fact, the Brazilian diplomacy played a key role for the recognition of the Independence of Paraguay. On the other hand, Paraguay gave its full support to Brazil, fighting its own campaign against Buenos Aires. However, in the final phase of the conflict (1851–1852), President Carlos López refused to join forces with the Allied army, keeping a defensive role (as established with Brazil). This was because López was very suspicious of Justo José de Urquiza, former General of Rosas' army who became the leader of the Argentine insurrection.\nUruguayan conflict\n(River Plate) from Buenos Aires, 1852. The Argentine capital was the center of Rosas' power.]]\nThe old Brazilian province of Cisplatina had become the independent Oriental Republic of Uruguay after the Cisplatine War of the 1820s. The country soon was engulfed in a long civil war between its two political parties: the Blancos, led by Don Juan Antonio Lavalleja, and the Colorados, led by Don Fructuoso Rivera.\nLavalleja soon discovered that Rosas in neighbouring Buenos Aires was interested in aiding him financially and militarily. In 1832, Lavalleja began to receive aid from Bento Gonçalves, a soldier and farmer from the Brazilian province of Rio Grande do Sul. Gonçalves had been encouraged by Rosas to rebel against the Brazilian government in 1835, with the ultimate aim of enabling Argentina to annex the province of Rio Grande do Sul. Together, Lavalleja and Gonçalves initiated a military campaign in Uruguay which was characterized by extensive violence and pillage. Gonçalves betrayed Rosas and Lavalleja by becoming an ally of Rivera. Both then invaded Uruguay and overran most of the country outside the environs of the capital, Montevideo. Defeated, the then-Uruguayan president Manuel Oribe, like the betrayed Lavalleja a member of the Blanco party, resigned his position as president and fled to Argentina.\nRosas was determined to restore Argentine suzerainty over Uruguay and take revenge on Gonçalves. A series of interventions resulted. In 1839 an army led by Lavalleja, Oribe and Justo José de Urquiza, (Governor of Entre Rios) was quickly defeated by Rivera. At this point, Lavalleja turned his back on the conflict and played no further part in the civil war. Rosas sent another army of Argentines and Uruguayans in 1845, led by Oribe and Urquiza, and this time defeated Rivera's forces, slaughtering the survivors. Rivera was one of the few who managed to escape, and went into exile in Rio de Janeiro. What remained of Rivera's Colorados held power only in the country's capital Montevideo as Oribe's forces began the Great Siege of Montevideo. The violence in Uruguay escalated, with Oribe's men killing more than 17,000 Uruguayans and 15,000 Argentinians during the conflict.\nOribe's control of nearly all of Uruguay had been secured, enabling him to launch an invasion of southern Brazil, his forces stealing cattle, looting ranches, and liquidating political enemies as they went. More than 188 Brazilian farms were attacked, with 814,000 cattle and 16,950 horses stolen. Local Brazilians independently decided to retaliate, making raids into Uruguay which became known as \"Califórnias\", in reference to the violence in western North America during California's revolt against Mexico, its brief independence and subsequent annexation by the U.S. As conflict further escalated with the persistent support of Rosas for the Blancos, anarchy spread over wide areas in the region; with a growing threat to trade, the era's two greatest powers, France and the United Kingdom, were induced to declare war on Argentina and impose a blockade on the Río de la Plata. Buenos Aires was repeatedly bombarded by the Anglo-French fleet. The Argentine government was able to mount an effective resistance, however, leading to a peace accord in 1849.\nEmpire of Brazil reacts\n() around the time of the Platine War]]\nBy the middle of the 19th century, the Empire of Brazil was the richest and most powerful nation in Latin America. It thrived under democratic institutions and a constitutional monarchy and prided itself on the absence of caudillos, dictators and ''coups d'état'' which were common across the rest of the continent. During the minority of emperor Pedro&nbsp;II, which led to the regency period in the 1830s, however, there had been several internal rebellions driven by local disputes for power within a few provinces. One of these, the Ragamuffin War, had been led by Gonçalves, as noted above.\nFor the Brazilian Empire, expansionist plans on the part of powerful, republican Argentina represented an existential threat. It also meant a threat to Brazilian hegemony across its southern borders. A successful Argentine bid to incorporate Paraguay and Uruguay into a reconstituted Viceroyalty of the Río de la Plata (and control of the Platine river network consequently passing into entirely hostile hands) would have threatened to cut communication between the Brazilian province of Mato Grosso and Rio de Janeiro. With river transportation denied, the alternative land routes would require months of travel instead of days. Nor was Brazil keen to share a direct border with Argentina, fearing an increased vulnerability to an invasion by Rosas.\nThe members of the Brazilian Cabinet could not reach agreement as to how to address the danger posed by Rosas. Some ministers advocated seeking a peaceful resolution at any cost. These feared Brazil was unprepared for war and that a defeat would lead to a situation similar to the chaos following the loss of Cisplatina in the 1820s, which ended in abdication by Dom Pedro I, the Emperor's father. Other ministers took the position that only a military response would eliminate the threat. In 1849, however, Paulino José Soares de Sousa, a member of the pro-war faction and later Viscount of Uruguai, was chosen as the new minister of Foreign Affairs. Soares made clear his intent to deal with Argentina without foreign assistance, announcing that the \"Imperial Government does not desire or judge convenient an alliance with France or any other European nation related to the matters in the Platine region. It understands that they must be resolved by the nations which [we] are closely connected with... It will not admit European influence over America.\" The Empire of Brazil was determined to extend its zone of influence over South America.\nThe cabinet settled upon a risky alternative to resolve the complicated situation in the Platine region. Instead of undertaking a period of conscription to build up the Imperial Brazilian Army, which would have been costly, the Council decided to rely on the standing army. It sent a contingent south to secure the region. Brazil held an advantage in possessing a powerful and modern navy, along with an experienced professional army hardened by years of internal and external warfare. Up until this point, no other nation in South America possessed true navies or regular armies. Rosas' and Oribe's forces were largely made up of irregular troops on loan from those caudillos who supported them. Even a decade later, Argentina could only field an army of 6,000 men. Brazil also decided to adopt Rosas' own tactics by financing his opponents to weaken him both internally and externally.\nAlliance against Rosas\n(1801– 1870), governor of Entre Rios.]]\nThe Brazilian government set about creating a regional alliance against Rosas, sending a delegation to the region led by Honório Hermeto Carneiro Leão (later the Marquis of Paraná), who held plenipotentiary authority. He was assisted by José Maria da Silva Paranhos (later the Viscount of Rio Branco). Brazil signed a treaty with Bolivia in which Bolivia agreed to strengthen its border defenses to deter any attack by Rosas, though it declined to contribute troops to a war with Argentina.\nIsolationist Paraguay was more difficult to win over. Brazil made the initial overtures, becoming the first country to formally recognise Paraguayan independence in 1844. This soon led to the establishment of excellent diplomatic relations. The Brazilian ambassador in Paraguay, Pimenta Bueno, became a private councilor to President Carlos Antonio López. A defensive alliance was signed on 25 December 1850 between Brazil and Paraguay, in which López agreed to supply the Empire with horses for its army. But Paraguay refused to contribute troops to fight Rosas, believing that Justo José de Urquiza (who had invaded Uruguay in 1839 and in 1845), the ruler of the Argentine Entre Ríos province, secretly wished to annex Paraguay.\nBrazil's involvement in the Uruguayan civil war also began to deepen. Luís Alves de Lima e Silva, the Count of Caxias, assumed the presidency (governorship) of Rio Grande do Sul and the command of the four Brazilian Army divisions headquartered in the province. Beginning in 1849, the Imperial government directly assisted the besieged Uruguayan government of Colorados in Montevideo, and on 6 September 1850 the Uruguayan representative Andres Lamas signed an agreement with Irineu Evangelista de Sousa to transfer money to the Montevideo government through his bank. On 16 March 1851, the Empire of Brazil openly declared its support of Colorado government of Uruguay against Oribe, something it had been covertly doing for more than two years. This did not please the Argentine government, which began mobilizing for war.\nBrazil had also been searching for support against Rosas inside Argentina, with some success. On 1 May 1851, the province of Entre Ríos, still governed by Urquiza, declared to Rosas that \"it is the will of its people to re-assume the entire exercise of its own sovereignty and power which had been delegated to the governor of Buenos Aires.\" It was followed by the province of Corrientes, governed by Benjamín Virasoro, which sent the same message. Brazil encouraged and financially supported both uprisings. One of the reasons for Urquiza's betrayal of Rosas was a long-running rivalry. Rosas had tried to remove him from power several times since 1845, suspecting that the caudillo was nurturing designs for his overthrow. This was the trigger for military intervention, and Brazil sent a naval force to the Platine region, basing it near the port of Montevideo. The British Rear admiral John Pascoe Grenfell, a veteran of the Brazilian War of Independence and of the Cisplatine War, was appointed to lead the fleet, which reached Montevideo on 4 May 1851. His command included 1 frigate, 7 corvettes, 3 brigs and 6 steamships. The Brazilian Armada had a total of 59 vessels of various types in 1851, including 36 armed sailing ships, 10 armed steamships, 7 unarmed sailing ships and 6 sailing transports.\nUruguay, Brazil and the Argentine provinces of Entre Rios and Corrientes joined in an offensive Alliance against Rosas on 29 May 1851. The text of the treaty declared that the objective was to protect Uruguayan independence, pacify its territory, and expel Oribe's forces. Urquiza would command the Argentine forces and Eugenio Garzón would lead the Colorado Uruguayans, with both receiving financial and military aid from the Empire of Brazil.\nThis was followed on 2 August 1851 by landings of the first Brazilian detachments in Uruguay, consisting of approximately 300 soldiers of the 6th Battalion of Skirmishers sent to protect Fuerte del Cerro (Cerro Fort). In response, Rosas declared war against Brazil on 18 August 1851.\nAccording to Herrera y Obes, Rosas would have said, as war approached: \"poor Brazilians, I'm going to make of their Emperor my butler\".\nStage 1 – Allied invasion of Uruguay\nThe Count of Caxias led a Brazilian army of 16,200 professional soldiers across the border between Rio Grande do Sul and Uruguay on 4 September 1851. His force consisted of four divisions, with 6,500 infantrymen, 8,900 cavalrymen, 800 artillerymen and 26 cannons, a little under half the total Brazilian army (37,000 men); while another 4,000 of his men remained in Brazil to protect its border.\nThe Brazilian Army entered Uruguay in three groups: the main force, consisting of the 1st and 2nd divisions left from Santana do Livramento—around 12,000 men under Caxias's personal command. The second force, under the command of Colonel David Canabarro departed from Quaraim, comprising the 4th division, protecting Caxias' right flank. The third force, the 3rd Division under Brigadier General José Fernandes, left from Jaguarão, protecting Caxias' left. Canabarro's 4th Division joined Caxias's troops shortly after arriving at the Uruguayan town of Frutuoso, the combined force then joining up with Fernandes just before reaching Montevideo.\nDefeat of Oribe\nMeanwhile, the troops of Urquiza and Eugenio Garzón had surrounded the army of Oribe near Montevideo. Their forces numbered roughly 15,000 men, almost double Oribe's 8,500. Realising that the Brazilians were approaching and knowing that there was no hope of victory, Oribe ordered his troops to surrender without a fight on 19 October, and retreated into seclusion on his farm in Paso del Molino.\nThe Brazilian fleet, with their ships scattered throughout the River Plate and tributaries, prevented the defeated army of Oribe from escaping into Argentina. Urquiza suggested to Grenfell that they should simply kill the resulting prisoners of war, but Grenfell refused to harm any of them. Instead, Oribe's Argentine soldiers were incorporated into the army of Urquiza, and the Uruguayans into Garzon's.\nThe Brazilian army easily took the remaining Blanco Uruguayan territory, fending off remnants of Oribe's troops who attacked its flanks in several skirmishes. On 21 November the representatives of Brazil, Uruguay, Entre Ríos and Corrientes then formed another alliance in Montevideo with the objective of \"freeing the Argentine people from the oppression it suffers under the tyrant rule of Governor Rosas\".\nStage 2 – Allied invasion of Argentina\nAllied army advance\npassing through Tonelero and Argentine batteries]]\n]]\nShortly after the surrender of Oribe, the Allied forces split into two groups, the plan being for one force to maneuver upriver and sweep down on Buenos Aires from Santa Fe, while the other would make a landing at the port of Buenos Aires itself. The first of these groups was composed of Uruguayan and Argentine troops, along with the 1st Division of the Brazilian Army under Brigadier General Manuel Marques de Sousa (later the Count of Porto Alegre). It was initially based in the town of Colonia del Sacramento in the south of Uruguay across the Río de la Plata estuary from the city of Buenos Aires.\nOn 17 December 1851, a squadron of Brazilian ships, consisting of four steamships, three corvettes and one brig under the command of Grenfell, forced a passage of the Paraná River in the battle which became known as the Passage of the Tonelero. The Argentines had formed a powerful defensive line at The Tonelero Pass, near the cliffs of Acevedo, protected by 16 pieces of artillery and 2,000 riflemen under the command of general Lucio Norberto Mansilla. The Argentine troops exchanged fire with the Brazilian warships but were unable to prevent them from progressing upriver. The following day, the Brazilian ships returned and broke their way through the Tonelero's defences, carrying the remaining troops of Marques de Sousa's Brazilian division upstream towards Gualeguaichu. This second influx of ships caused Mansilla and his soldiers to withdraw in chaos, abandoning their artillery, believing that the Allies were intending to land and attack their positions from the rear.\nThe Allied army continued to make its way to the assembly point at Gualeguaichu. Urquiza and his cavalry traveled overland from Montevideo, while the infantry and artillery were carried by Brazilian warships up the Uruguay River. After meeting up, they marched west until they reached the city of Diamante on the east side of the Paraná River in the middle of December 1851. Eugenio Garzón and the Uruguayan troops were taken from Montevideo up to Potrero Perez by Brazilian warships and continued on foot until arriving at Diamante on 30 December 1851, when all the Allied forces were finally reunited.\nFrom Diamante contingents were ferried to the other side of the Paraná River, landing at Santa Fe. The Confederate Argentine troops in the region ran away without offering any resistance. The Allied Army, or the \"Grand Army of South America\" as it was officially called by Urquiza, marched on towards Buenos Aires.\nMeanwhile, the second force, comprising the majority of the Brazilian troops (about 12,000 men) under the command of Caxias, had remained in Colonia del Sacramento. The Brazilian commander took the steamship Dom Afonso (named in honor of the late Prince Afonso) and entered the port at Buenos Aires to select the best place to disembark his troops. He expected to have to defeat the Argentine flotilla anchored there, but the force did nothing to stop him and he safely returned to Sacramento to plan his assault. The attack was aborted, however, when news arrived of the Allied victory at Caseros.\nRosas defeated\nThe Allied army had been advancing on the Argentine capital of Buenos Aires by land, while the Brazilian Army commanded by Caxias planned a supporting attack by sea. On 29 January, the Allied vanguard defeated a force of 4,000 Argentines led by two colonels which General Ángel Pacheco had sent to slow down the advance at the Battle of Alvarez Field. Pacheco retreated. Two days later, troops under his personal command were defeated at the Battle of Marques Bridge by two allied divisions. On 1 February 1852, the Allied troops encamped approximately nine kilometers from Buenos Aires. The next day a brief skirmish between the vanguards of both armies ended with a retreat by the Argentines.\n, future Argentine president, wearing the Brazilian Order of the Southern Cross given to him by Pedro II during his exile in Petrópolis in 1852]]\nOn 3 February the Allied army encountered the main Argentine force commanded by Rosas himself. On paper, the two sides were well-matched. The Allies included 20,000 Argentines, 2,000 Uruguayans, 4,000 Brazilian elite troops totalling 26,000 men and 45 cannon (16,000 cavalrymen, 9,000 infantrymen and 1,000 artillerymen). On the Argentine side, Rosas had 15,000 cavalrymen, 10,000 infantrymen and 1,000 artillerymen, totalling 26,000 men and 60 cannon. Rosas had been able to select the best positions for his army, choosing the high ground on the slopes of a hill at Caseros, which lay on the other side of the Morón creek. His headquarters were in a mansion at the top of Caseros.\nThe Allied commanders were Marques de Sousa, Manuel Luis Osório (later the Marquis of Erval), Jose Maria Pirán, Jose Miguel Galán (who replaced Garzón after his unexpected death in December 1851), Urquiza, and the future Argentine presidents Bartolomé Mitre and Domingo Sarmiento—the latter both leading the Argentine Unitarians. These men formed a War Council, and gave orders to commence the attack. Almost immediately the forward units of the two armies began to engage in battle.\nThe Battle of Caseros resulted in a decisive victory for the Allies. Although they started with the inferior position on the battlefield, the Allied soldiers managed to annihilate Rosas' troops in a fight that lasted for most of the day. A few minutes before the Allied forces reached Rosas' headquarters, the Argentine dictator escaped the battlefield. Disguised as a sailor, he sought out Robert Gore, the British ambassador in Buenos Aires, and requested asylum. The ambassador agreed to have Rosas and his daughter Manuelita taken to the United Kingdom, where he would spend the last twenty years of his life. The official report stated that 600 men on the Allied side had been wounded or died, while the Argentine losses were 1,400 killed or wounded and 7,000 captured. Given the duration and scale of the battle, however, this may be an underestimate.\nTo mark their victory, the Allied troops marched in triumph through the streets of Buenos Aires. The parades included the Brazilian Army, which insisted that their triumphal procession take place on 20 February, to mark payback for the defeat it had suffered at the Battle of Ituzaingó twenty five years before on that date. The population of Buenos Aires was said to have looked on silently with a combination of shame and hostility as the Brazilians passed.\nAftermath\nBrazil\nThe triumph in Caseros was a pivotal military victory for Brazil. The independence of Paraguay and Uruguay was secured, and the planned Argentine invasion of Rio Grande do Sul was blocked. In a period of three years, the Empire of Brazil had destroyed any possibility of reconstituting a state encompassing the territories of the old Viceroyalty of the Río de la Plata, a goal cherished by many in Argentina since independence. Brazil's army and fleet had accomplished what the United Kingdom and France, the great powers of that time, had not achieved through interventions by their powerful navies. This represented a watershed for the history of the region, ushering in Brazilian hegemony over the Platine region and, according to Brazilian historian J. F. Maya Pedrosa, the rest of South America as well. The War of the Triple Alliance eighteen years later would only be a confirmation of Brazilian dominance. The country came out of the conflict with its monarchy strengthened and the cessation of internal revolts, including in the province of Rio Grande do Sul, entering into a period of economic and cultural prosperity.\nArgentina\n(1821–1906) in 1854; the man who led Buenos Aires against the Argentine Confederation until he reunified Argentina after his victory in the Battle of Pavón in 1861]]\nSoon after the Battle of Caseros the San Nicolás Agreement was signed. It was meant to comply with the constitutional mandate of the Federal pact that presided over the Argentine Confederation, convening a Constitutional Assembly to meet in Santa Fe. This agreement was not accepted by the province of Buenos Aires, since it reduced its influence and power over the other provinces. Following the revolution of 11 September 1852, Buenos Aires seceded from the confederation, thus dividing Argentina into two rival, independent states which fought to establish dominance. On the one side were the Federalists of the Argentine Confederation, led by Justo José de Urquiza. On the other, the State of Buenos Aires. The civil war was only brought to an end with the decisive victory of Buenos Aires over the Confederation at the 1861 Battle of Pavón. The bonaerense liberal leader Bartolomé Mitre was elected the first President of a united Argentine Republic in 1862.\nParaguay and Uruguay\nWith the opening of the Platine rivers, Paraguay found it possible to contract with European technicians and Brazilian specialists to aid in its development. Unhindered access to the outside world also enabled it to import more advanced military technology. During the greater part of the 1850s, the dictator Carlos López harassed Brazilian vessels attempting to freely navigate the Paraguay River. López feared that the province of Mato Grosso might become a base from which an invasion from Brazil could be launched. This dispute was also leverage with the Imperial government for acceptance of his territorial demands in the region. The nation also experienced difficulties in delimiting its borders with Argentina which wanted the whole Gran Chaco region: a demand which Paraguay could not accept, as this would entail surrendering more than half of its national territory.\nThe end of the Platine War did not bring a halt to conflict in the region. Peace remained out of reach in Uruguay, which remained unstable and in a state of constant crisis due to continuing internecine strife between the Blancos and Colorados. Border disputes, power struggles among diverse regional factions, and attempts to establish regional and internal influence would eventually spark the Uruguayan War as well as the later Paraguayan War.\nEndnotes\n.\n}}\n.\n}}\n.\n}}\n.\n}}\n.\n}}\n.\n}}\n.\n}}\n.\n}}\n.\n}}\n.\n}}\n}}\nFootnotes\nReferences\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n}}\n*\n}}\n*\n*\n*\n*\n*\n*\n*\n*\n*"
    }
  ]
}