{
  "content": [
    {
      "type": "text",
      "text": "# Pleasant Valley War\n\n| date             = 1882–1892\n| place            = Tonto Basin, Arizona Territory, United States\n| coordinates      =\n| map_type         =\n| latitude         =\n| longitude        =\n| map_label        =\n| causes           = Family feud and introduction of sheep into the valley\n| goals            =\n| methods          =\n| status           =\n| result           = Annihilation of the Graham faction.\n| side1            =\n| side2            =\n| leadfigures1     = |Tom Graham|Andy Blevins}}\n| leadfigures2     = |Edwin Tewksbury}}\n| howmany1         =\n| howmany2         =\n| casualties1      =\n| casualties2      =\n| casualties3      = 35–50 killed\n| casualties_label =\n| notes            =\n}}\nThe Pleasant Valley War, sometimes called the Tonto Basin Feud, or Tonto Basin War, or Tewksbury-Graham Feud, was a range war fought in Pleasant Valley, Arizona, in the years 1882–1892. The conflict involved two feuding families, the Grahams and the Tewksburys. The Grahams were ranchers, while the Tewksburys, who were part Native American, started their operations as cattle ranchers before branching out to sheep.\nPleasant Valley is located in Gila County, Arizona, but many of the events related to this feud took place in neighboring Apache and Navajo counties. Other neighborhood Arizona parts, such as Holbrook and Globe, were the setting of its bloodiest battles. Although the feud was originally fought between the Tewksburys and the Grahams against the well-established cattleman James Stinson, it soon involved other cattlemen associations, sheepmen, hired guns, cowboys and Arizona lawmen. The feud lasted for about a decade, with its most deadly incidents between 1886 and 1887; the last-known killing took place in 1892.\nThe Pleasant Valley War had the highest number of fatalities of such range conflicts in United States history, with an estimated total of 35 to 50 deaths, and the near annihilation of the males of the two feuding families. The Pleasant Valley War gave Arizona Territory a reputation for not being ready for statehood, which would not occur until 1912. Years after its end, many books and articles were written about the feud.\n1882–1885\nOrigin\nEdwin \"Ed\" Tewksbury was born in 1858 in San Francisco, California and was the second son of former miner James D. Tewksbury and his Native American wife. The family was composed of sons John, Jim, Ed and Frank and one daughter and owned a great number of horses and cattle as they started out their ranching business. The Grahams were originally from Ireland before migrating to Ohio in 1851 and were composed of Samuel Graham as the head, his wife Jane and their five children Allen, Margaret, Mary, John and Thomas. Jane died in 1861, and Sam married Mary E. Goetzman, with whom he fathered seven children. In 1881, John and Thomas staked claims in Arizona.\nThe Grahams were new ranchers who came to the lush ranges of Arizona after being invited by Ed Tewksbury. Tom Graham and John D. Tewksbury started out as friends but things changed when a big cattleman named James Stinson came into Pleasant Valley. His large herd quickly started to occupy many areas of grazing land, dominating the ranches built by the two families. Things escalated when Stinson accused members of both families of rustling cattle from his ranch. Accusations soon turned into warrants, and while both families were present in the Tewksbury house, cowboys from Stinson's outfit, Elisha Gilliland (John's cousin) and Epitazio Ruiz, led by John Gilliland, came up to arrest the Tewksburys. Tempers flared, and the Tewksburys refused to be arrested. Gilliland provoked an altercation and fired the first shot, which flew over Ed Tewksbury's head. John Gilliland was on horseback and the horse began to twirl and kick with the first shot. Ed Tewksbury drew his revolver and fired at the same time as Gilliland's second shot, which tore open John Graham's hat. As his horse turned around, Gilliland leaned over and Ed's bullet hit him in the shoulder. John Gilliland was still on horseback but too injured to continue the fight. He yelled at Elisha to run, but the cousin was wounded by Ed Tewksbury.\n}}\nIn 1884, the friendship between the Tewksburys and the Grahams was shattered when Stinson made a deal with the Grahams to pay them each 50 head of cattle, and see that they never served jail time, if they would turn state's evidence against the Tewksburys. The Grahams took the deal and started working for Stinson, betraying the Tewksburys by siding with their accusers. John Graham immediately filed a complaint with District Attorney Charles B. Rush, accusing the Tewksbury family of rebranding over sixty of Stinson's cattle. The Tewksburys were forced to face the charges in Prescott, but the case against them was thrown out of court for lack of evidence after the judge discovered the deal between Stinson and the Grahams. On the Tewksburys' way home from Prescott, the weak Frank contracted pneumonia and died soon after. The family blamed his death on Stinson and his men.\nOn July 23, 1884, the Tewksbury faction, consisting of John Tewksbury, William Richards, George Blaine and Ed Rose, visited the ranch house of James Stinson in a supposed planning of the upcoming rodeo. They were met by the ranch foremen, Marion McCann, and five other cowhands, and the former asked the Tewksburys to leave except for Rose, whom they knew was neutral in the conflict. The Tewksburys tried to reason with him, which ended in the two groups hurling insults at one another. Things heated up when Blaine called for McCann to come out and face him, before firing a shot at the foreman. The shot went high, and McCann retaliated by drawing his pistol and shooting Blaine in the throat. John Tewksbury also fired at McCann, before himself getting wounded and riding off with the others. Blaine survived his wound, and both groups settled the fighting in court. Afterward, Stinson left Arizona and dissolved his herd. The Grahams found themselves in a tight spot in 1885, after losing a significant number of their herd and subsequently being caught driving cattle that were not theirs.\nThe feud only got worse when the Tewksburys started bringing in herds of sheep in 1885. The Tewksbury brothers leased some sheep from brothers by the name of Daggs in northern Arizona. Local newspapers such as the Arizona Silver Belt reported that the feud was caused primarily by the Tewksburys' other occupation as sheepmen, which many cattlemen such as Stinson disliked due to the sheep's destructive eating habits in the open ranges. Historian Tim Ehrhardt suggested that this was not the case, contending the feud was primarily caused by the enmity that already existed between the families. Sheep were not brought into the valley until 1885, two years after the feuding between the Tewksbury and Graham factions began. Cattlemen from Gila County were also on the side of the Tewksburys during the war, and they would help Ed in many of his court defenses in the future.\nThe Tewksburys hired a Basque sheep herder to transport the sheep to Pleasant Valley. He was murdered and robbed en route by Andy Cooper (aka Andy Blevins), a member of the Graham faction. At that time, other cattlemen and sheepmen joined in the conflict, either willingly or not.\nHashknife Outfit\nOne of the principal factions in the Pleasant Valley War was the Hashknife Outfit, a branch of the Aztec Land and Cattle Company in Arizona and Colorado. The company bought the Hashknife brand and some 33,000 head of cattle and 2,000 horses from the company's headquarters in Texas. Along with the cattle and the brand came a number of original Hashknife cowboys. These cowboys were notorious for their rowdy and violent behavior. Residents of Holbrook initially welcomed the money of the cattle company and its associated cowboys, until they saw what they were in for. The buckaroos of the outfit quickly gained the unsavory reputation of being the \"thievinist, fightinest bunch of cowboys\" in the United States. Gunfights soon escalated with the locals and the cowboys for various reasons. The cowboys fought what they perceived as rustlers and thieves preying on the company's cattle, but they also targeted and harassed local ranches and farms that competed with the outfit. They also sided with the cattlemen during the war, harassing sheepherders in the region. On more than one occasion, Hashknife cowboys herded thousands of sheep into the Little Colorado River, where they drowned, or used horses to ride into a herd and scatter it. In 1886 there were twenty-six shooting deaths in Holbrook alone, which had a population of only about 250 people.\nDaggs Outfit\nAnother principal faction in the Pleasant Valley War was the Daggs Outfit. The five Daggs brothers were prominent businessmen first in Flagstaff and then in the Phoenix and Tempe area. The Daggs were originally from Missouri. The brothers were Peru Paxton (P.P.), William (W.A.), John (J.F.), Robert (R.E.) and Jackson (A.J.). The Daggs first arrived in the area around Flagstaff in 1875. They brought 1,500 sheep with them from California. They would become the largest sheep ranching company in northern Arizona. Their sheep business extended from northern Arizona to New Mexico and Colorado. At one time they were reported to have 50,000 sheep grazing in northern Arizona. Individually and as partners they had business interests in ranching, real estate, land development, mining, a butcher shop, an ice plant, railroads, and banking. J.F. Daggs owned the Flagstaff Brewery which turned out \"fine beer\" according to their ad in the Coconino Sun newspaper. R.E. and A.J. Daggs were attorneys. They also used their political connections with lawmen, attorneys and judges in Yavapai and Apache counties to help their employees whenever they were arrested during the feud.\nWells outfit\nFred Wells, another local cattleman, had borrowed a lot of money in Globe, Arizona, to build back his cattle herd and hire more cowboys after some reverses. The Wells clan had no stake in the feud, but Fred's creditors did. Wells was told to join their cowboys in driving off the Tewksbury cattle or forfeit his own stock. When Wells refused, his creditors demanded immediate payment of the loans and sent two deputies to seize his cattle. Wells gathered his clan and cattle together, joined by his young ranch hand named Frederick Russell Burnham, who would later make a name for himself as a scout in the late 19th century. According to Lott, Burnham was drawn into the conflict by his association with Fred Wells and his family; historian R. R. Money states that it was the Gordon Family. In his published memoirs, Scouting on Two Continents, Burnham does not name the family and states he did not wish to mention names that might re-kindle the conflict. Burnham was friends with both these families in Globe, so it could have been either, but in the undated manuscript he mentions his friendship with young Tommy Gordon and his family from Globe within the context of the feud.\nWells had trained Burnham in shooting and considered him almost a part of the family. They began driving Wells's herd into the mountains, hotly pursued by the deputies. The deputies had no trouble overtaking the Wells clan. The deputies forced the girls and the mother to halt, which set off the barking dogs. Burnham and John Wells, Burnham's close friend and the son of Fred Wells, rushed back. Just when they arrived, one of the dogs bit a deputy. The deputy shot the dog, and Burnham, John Wells, and two of the girls drew their weapons. The deputy fell dead in front of them, shot from a long distance by Fred Wells, and the other deputy raised his hands. The clan continued into the mountains with the captured deputy and released him after securing their herd. Wells, who did not want his family to be arrested as murderers, convinced the deputy to tell the authorities that nobody knew who fired the fatal shot. In exchange, the deputy could take some of Well's cattle back to Globe and the Wellses would ride for the cattlemen when called upon. The deputy returned to Globe and reported the incident.\nOnce partisan feelings became tense and hostilities began, Burnham became involved in the conflict, defending the Wells family and particularly John and his father Fred, as well as being forced to participate in raiding parties on sheepmen. After being drawn into it, Burnham was marked for death by the sheepmen, who described him as an \"unknown gunman\" with his \"Remington six-shooter belt.\" He hid for many days before escaping from the valley. Private posses were raised for raiding the opposition. Killings and counter-killings became a weekly occurrence. For the Wells outfit, it became a sheer waste of human life in a struggle without honor or profit in another man's feud, seemingly without end.\nBurnham realized that he was in an increasingly untenable position. His faction was losing, and at the age of nineteen he faced a grim future as a gunman whose only \"crime\" had been to stand by his friends, the Wellses. Burnham went to Globe, where he sought help from an older friend, Judge Aaron H. Hackney, the editor of the Arizona Silver Belt newspaper.}} On his way to Globe he was nearly killed by George Dixon, a well-known bounty hunter who found him hiding in a cave. Holding a Colt .45 to Burnham's head, Dixon ordered him outside but was shot and killed himself by a party outside the cave. Coyotero, a White Mountain Apache, had been tracking Dixon and killed the bounty hunter as he was capturing Burnham. The youngster quickly drew his Remington, moved behind a ledge, and shot Coyotero dead.\nOnce in Globe, Burnham contacted Hackney and was hidden in his house. With his help, Burnham assumed several aliases and made the difficult journey out of the Basin. He eventually arrived in Tombstone, Arizona and stayed with friends of Hackney. Once in Tombstone, he began to reflect on the feud:\nNow my mind began to clarify. I saw that my sentimental siding with the young herder's cause [Ed note: John Wells] was all wrong; that avenging only led to more vengeance and to even greater injustice than that suffered through the often unjustly administered laws of the land. I realized that I was in the wrong and had been for a long time, without knowing it. That was why I had suffered so in the Pinal Mountains.\n1886–1887\nIn February 1887 a Navajo worker of the Tewksburys was herding sheep in an area called the Mogollon Rim. Until that point, the rim had been tacitly accepted as the line across which sheep were not permitted. He was ambushed, shot and killed by Tom Graham, who beheaded the corpse and buried it where the worker fell. In August 1887, Mart Blevins, the head of the Blevins family, went out to search for some missing horses after suspecting the Tewksburys were behind the theft. He never returned, and his horse and rifle were recovered near the Tewksbury ranch. The Blevins boys, consisting of Andy, Charlie and one-armed Hamp, rode out in search of their father in the Tewksbury territory. Hamp's journey took him to the Hashknife camp, where he was joined by cowboys John Payne, Thomas Carrington and Robert Gillespie. Along the way, a Tewksbury enemy, Tom Tucker, joined Hamp in their pursuit. They tracked down the Tewksburys at a sheepherder's ranch owned by George Newton. Hamp and his gang asked Newton for some food, but they were met by Ed Tewksbury, who told them to go away. Things became violent when the Tewksburys drew their guns at Hamp's gang, and a shootout occurred in which Hamp Blevins and John Payne were killed. When the Grahams came back to bury the bodies, they found the ranch burned to the ground, and the Tewksburys were nowhere to be seen.\nOn August 17, 1887, William Graham was rounding up his family's horses when he was shot in the gut. The young man managed to ride away back to his home but his wound was so severe that when he arrived his intestines were hanging from his belly. He identified Ed Tewksbury as his murderer to his brothers before he died. However, Apache County Deputy Sheriff and Tewksbury ally James D. Houck confessed that he was the man who shot Willy Graham after he mistook him for his brother John Graham. Many people in the valley believed, though, that this was just a ruse to keep the allegations away from Ed Tewksbury. When lawmen came to arrest Ed Tewksbury for the murder of the young William, the man had already fled to the hills.\nShootout at Tewksbury's Ranch\nIn September 1887, the Graham faction rode to the Tewksbury cabin in the early morning. They hid in the foliage and spotted John Tewksbury Jr., and William Jacobs come by, gathering their horses. They ambushed and killed both men. The Grahams then went to the cabin and continued firing at it for hours, with fire returned from within. As the battle continued, hogs began devouring the bodies of Tewksbury and Jacobs. According to some accounts, the Grahams did not offer a truce, but John Tewksbury's wife, Eva, came out of the cabin with a shovel. The firing stopped while she scooped out shallow graves for her husband and his companion. Firing on both sides resumed once she was back inside, but no further deaths occurred that day. Historian Joseph G. Rosa disputed this account, however, and believed that the bodies lay where they fell until morning. Eva herself, at that time, was eight and a half months pregnant. When the law was approaching their positions, the Graham faction quickly rode away.\nOwens–Blevins Shootout\nA few days later, Andy Blevins, one of the leaders of the Graham faction, was overheard in a store in Holbrook, bragging that he had shot and killed both John Tewksbury and William Jacobs.\nCommodore Perry Owens, newly elected sheriff for Apache County, was a former cowboy turned lawman. At that time he was known for his skills as a gunman, being able to accurately shoot one pistol in each hand. He made a name for himself in his skirmishes with neighboring Apaches and Navajo. The Blevinses, in contrast, were notorious for their cattle rustling activities and cold-blooded murders in and out of the territory. As soon as Owens heard of the Blevins' whereabouts, he rode alone to the Blevins house in Holbrook to serve a warrant, carrying a Winchester rifle.\nTwelve members of the Blevins family were present at the house that day. Owens stated that he had an outstanding warrant for Andy Blevins and asked him to come out of the house. Blevins refused. His half-brother, John Blevins, came out the front door and fired a shot at Owens with a rifle. Owens returned fire, wounding John and killing Andy. A friend of the family named Mose Roberts, who was in a back room, jumped through a window at the side of the house.\nOwens, hearing the noise, ran to the side of the house and fired on Roberts, killing him. It is disputed as to whether Roberts was armed or not. Some reports indicate he was armed with a rifle, others allege that he was unarmed. It has also been said that he went out the window only to avoid bullets that passed into his room.  At that moment, 15-year-old Sam Houston Blevins ran outside, armed with a pistol picked up next to the body of his brother Andy. Owens shot and killed him, as the boy fired on Owens; Sam died in his mother's arms.\nWitnesses said the gunfight took less than a minute; it resulted in three dead and one wounded. Despite being fired at, Owens was not injured. The afternoon made Owens a legend but further inflamed the feud. Owens was not indicted, and his shootings were ruled as self defense by the three coroner's juries called to review each death. The cases were never prosecuted, and Owens lost his position as sheriff.\nShootings at Perkins Store\nAfter the murder of a Graham sympathizer named Henry Middleton, Sheriff William Mulvenon of Prescott, Arizona, led a posse in an attempt to finally quell the war. His instructions came directly from Governor Conrad Zulick, and he left Prescott on September 10, 1887. His posse made a stop at Haigler ranch in the northern side of the valley, and six others such as Tewksbury ally J.D. Houck reinforced his pack. His posse finally found a Graham faction at the Perkins Store in Young, Arizona, the faction consisting of John Graham and Charles Blevins. The posse hid themselves behind a stone wall and waited, before surprising John and Charles and ordering them to put up their hands.\nDuring the grand jury hearing concerning the events at the Perkins Store, Mulvenon said that Graham and Blevins tried to reach for their guns, forcing him and his posse to shoot them. Blevins died quickly, and Houck ran up to the mortally wounded Graham and shot him dead. Posse members testified, however, that Mulvenon opened fire before a demand was made for the two to surrender and that at least some of the posse members had an understanding with Mulvenon that no Grahams were to be taken alive. Some posse members were unaware of this understanding and did not fire. McKinney intervened to stop Houck and Mulvenon from shooting the dying Blevins again. A grand jury indicted Mulvenon for the murders, but he was found not guilty despite persuasive testimony from posse members Fairchild, McKinney and Weatherford.\nSix weeks later, Al Rose, participant in the Graham faction, was killed by eight unknown men wearing long coats and masks near the Houldon ranch belonging to the Grahams.\nInvolvement of Tom Horn\nIt was very likely during this stage that outsider and known assassin Tom Horn participated, possibly as a killer for hire, but it is unknown which side employed him, and both sides suffered several murders for which no suspect was ever identified. In his autobiography, however, Horn writes: \"Early in April of 1887, some of the boys came down from the Pleasant Valley, where there was a big rustler war going on and the rustlers were getting the best of the game.\" Horn says he was tired of working his mining claim and therefore was \"willing to go, and so away we went.\" He then claims that he \"became the mediator\" of the conflict, serving as a deputy sheriff under three famous Arizona lawmen of the time: William Owen \"Buckey\" O'Neill, Commodore Perry Owens, and Glenn Reynolds.  Horn worked on a ranch owned by Robert Bowen, where he became one of the prime suspects in the disappearance of Mart Blevins in 1887. Horn also participated with Glenn Reynolds in the lynching of three suspected rustlers of the Graham faction, Scott, Stott and Wilson, in August 1888.\n1888–1892\nOver the next few years after 1887, several lynchings and unsolved murders of members of both factions took place, often committed by masked men. The elder John Tewksbury died of natural causes. One of the Tewksburys' allies, George Newton, drowned in the Salt River on his way either to his ranch or a meeting with Ed Tewksbury, and many, including his family, thought that the Grahams were responsible. His widow offered a reward of $10,000 to whoever would recover Newton's body, but he was never found. Both the Tewksburys and the Grahams continued fighting until there were only two left.\nin Phoenix]]\nWith almost all of his clan and allies lost, Tom Graham gave up his residence in Prescott and fled to the Salt River Valley. He soon settled in Tempe and married a minister's daughter named Annie Melton. He planned to sell his stock and restart his business in his new-found home. While delivering a load of wheat from a store on August 2, 1892, Tom Graham, the last of the Graham faction involved in the feud, was fatally shot in the back by two assassins. The assassins called to him, and as Tom looked over his shoulder, a rifle bullet penetrated his back. Before he died, Tom named Ed Tewksbury and John Rhodes as his attackers.\nEd Tewksbury was accused of the murder. Defended by well-known Arizona attorney Thomas Fitch, the first trial ended in a mistrial due to a legal technicality. During the trial, Tom's widow, Annie, attempted to assassinate Ed with a pistol, but it got caught in her dress, and she was promptly removed from the court. The jury in the second trial dead-locked seven to five for acquittal. Over 100 witnesses had been called, and many – including two young women named Gregg and Cummings and Winslow cowboy, A.J. Steneel – confirmed Ed as one of the murderers. The jury finally closed the case, however, as they deemed that Ed was not present in the place of the murder. Edwin Tewksbury died in Globe, Arizona in April 1904. By the time of his release, none of the Grahams remained to retaliate against him, nor was there anyone on the Tewksbury side to have avenged his death had anyone killed him. Before his death, Ed confessed to his stepmother that he did kill Tom Graham, and he did this by stringing up horses along the route to Tempe. Generations of the Tewksbury family believed Ed's story years after the feud ended.\nSoon after Tom's murder, a young man named Yost was assassinated while traveling through Reno Pass in the Tonto Basin road. Yost had been connected with the Graham faction, and reports said that he was killed by the Apache Kid.\nAftermath\nEdwin Tewksbury was the last survivor among the men involved in the Pleasant Valley War. He died in Globe, Arizona, in April 1904. The graves of many of the murdered men can still be seen in the Young, Arizona, cemetery, and the Perkins Store still stands as a museum. In total 35 to 50 individuals were killed, with some participation from local vigilantes, hired hands and cowboys from both sides; and arrests by law enforcement were rare. The range war and the ongoing Apache Wars caused opposition to statehood for Arizona, because many legislators in Washington saw these as proof that the territory was not civilized enough to be part of the Union.\nCultural references\n* Well-known Western author Zane Grey wrote a book based on the Pleasant Valley War, entitled To The Last Man: A Story of the Pleasant Valley War. In his novel, the two main families were called Isbel and Jorth. Burnham is portrayed as one of the gunmen.\n* Historian Daniel Herman wrote a historical novel entitled The Feudist: A Novel of the Pleasant Valley War.\n* Western writer Will Henry wrote a fictional account based on the Pleasant Valley War, titled The Fourth Horseman.  In this novel, the two main families names were changed to Graden and Fewkes. The location's name was changed from Pleasant Valley to Peaceful Basin in the book.\n* The 1992 television movie, Gunsmoke: To the Last Man features Matt Dillon, hero of the television series Gunsmoke, in the Pleasant Valley War.\n* [https://www.youtube.com/watch?v=4nqPLSwF9ZM \"Drag-a-Long Droopy\" (1952)], a comic, animated cartoon depicting the cattle-sheep range wars.\n* [http://michaeldbast.com/my-documentary-about-the-pleasant-valley-war/ Film maker Michael Bast created a documentary film for television, Forgotten Gunfighters: The Pleasant Valley War].\n* The AHC cable channel profiled the Pleasant Valley War in the fourth episode of its history series, \"Blood Feuds\",  which aired January 27, 2016.\n* Travis Mills directed a 2020 documentary entitled \"The Pleasant Valley War\".\nSee also\n* Hell on the Range by Daniel Justin Herman\n* Ranching\n* Range war\n* Taylor Grazing Act\n* Young, Arizona\nNotes\nFootnotes\nSource notes\nReferences\n*\n*\n*\n*\n*\n* | title = About Arizona silver belt. (Globe City, Pinal County, Ariz.) 1878–19?? | publisher=Library of Congress | url =http://chroniclingamerica.loc.gov/lccn/sn84021913 | access-date = May 28, 2014}}\n*  | title = US History, Volume II: 1865–present | publisher = Boundless Learning, Incorporated | location = Boston, Massachusetts | year = 2013 | url = https://www.boundless.com/u-s-history/textbooks/boundless-u-s-history-textbook | access-date = May 29, 2014 | archive-url = https://web.archive.org/web/20140530053324/https://www.boundless.com/u-s-history/textbooks/boundless-u-s-history-textbook/ | archive-date = May 30, 2014 | url-status = dead }}\nFurther reading\n*\n*\n*\n* Herman, Daniel J. (2017). \"[https://www.jstor.org/stable/44984477 The Rim Country War Reconsidered: Honor Rustling, Vigilantism, and How History Got Remembered].\" Journal of Arizona History 58 (1): 1-62.\n*  (novel)\n*  (novel – uncut version of To the Last Man)\nExternal links\n* [http://www.americanwest.com/vispages/msmith1.htm The Pleasant Valley War], americanwest.com\n* For information regarding tours to historical sites during Pleasant Valley Days, visit [http://www.mypleasantvalleycc.com/]"
    }
  ]
}