{
  "content": [
    {
      "type": "text",
      "text": "# Plen-an-gwary\n\n.]]\nA plen-an-gwarry or plain-an-gwary (), is a \"playing-place\" or round, a medieval amphitheatre found in Cornwall. A circular outdoor space used for plays, sports (especially Cornish wrestling), and public events, the plen-an-gwary was a Cornish variant of a construction style found across Great Britain. Formerly common across Cornwall, only two survive nearly complete today: the Plain in St Just in Penwith () and Saint Piran's Round near Perranporth ().\nThe theatre area could be used for local gatherings, sports events, and production of plays. Cornwall culture had a type of play called miracle plays, written in the Cornish language, that were meant to spread Christianity. To capture the attention of the audience, \"the plays were often noisy, bawdy and entertaining.\" The most important work of literature surviving from the Middle Cornish period is Ordinalia, a 9000-line religious verse drama which had probably reached its present form by 1400. The Ordinalia consists of three miracle plays, Origo Mundi, Passio Christi and Resurrexio Domini'', meant to be performed on successive days. Such plays were performed in a plain-an-gwarry.\nSt Just-in-Penwith\nSt Just's plain-an-gwarry is a large circular space, encircled by a  wall of stone. There are two entries into the space. In November 1878 the ″Plane-an-Guare″ was restored under the guidance of several gentlemen including William Copeland Borlase. The outer wall was exposed and several loads of stone were brought up from Boscean. By December 1878 the ″renewal″ of the outer wall was almost complete. The restoration was funded to provide relief for the unemployed due to the closure of local mines. It is central to the celebrations of the annual Lafrowda Day festival.\nThe plain-an-gwarry was used for Cornish wrestling tournaments in ancient and modern times.\nPerran Round\nPerran Round in the parish of Perranzabuloe, between Perranporth and Goonhavern is considered to be the best surviving example of a plen-an-gwary.\nCornish wrestling tournaments were held at Perran Round in ancient and modern times.\nOther sites\nPlen-an-gwarys were largely confined to the west of Cornwall. Depending on sources there are a possible 48 to 51 plen-an-gwarys including nine sites with extant remains and a further nineteen sites with no above-ground remains. The possible sites below are based on place-names.\n* The Long Sentry field south-east of the church in St Mabyn, has been identified as the possible location of the most northerly Plain-an-gwarry.\n* There is evidence to suggest that Bartinney Castle near Sancreed in the Penwith Peninsula may have been an Iron Age Plen An Gwarry for the celebration of Celtic Fire festivals.\n* Plain-an-Gwarry, Redruth which was documented as being used for Cornish wrestling tournaments.\n* There is an area called Plain-an-Gwarry one mile to the north-east of Marazion.\n* Site in the parish of Grade–Ruan approximately 200 m from Treleage farm ()\n* In circa 1587 it is recorded that in Penryn a group of Spaniards landed with the intention of sacking the town, however finding the streets deserted they were alarmed by a 'mighty shout' and ran to their boats. The townfolk were at a performance of 'Samson' and the gates of Gaza had just fallen, resulting in a deafening cheer.\nOther possible sites where old documents and newspapers describe locations include:\n* A site below Wendron churchtown is recorded as being used as a venue for Cornish wrestling.\n* A site in Mellangoose which is recorded as being where the famous Cornish wrestler Captain Thomas Gundry regularly fought.\n* At the base of Bodmin Beacon are the remains the wrestling ring which many believe was a plen an gwari.\nGallery\nFile:Field at Playing Place - geograph.org.uk - 1058901.jpg|Field at Playing Place, the site of the plain-an-gwarry that gave the village of Playing Place its name.\nFile:Plaque at Playing Place - geograph.org.uk - 1058923.jpg|Playing Place plaque that acknowledges the plain-an-gwarry for which the village was named. It specifically refers to performances about Saint Kea\nFile:Origo Mundi kynsa gwersow.jpg|The opening verses of Origo Mundi, the first play of the Ordinalia (the magnum opus of mediaeval Cornish literature), written by an unknown monk in the late 14th century\nSee also\n* Christianity in Cornwall\n* Cornish literature\nReferences"
    }
  ]
}