{
  "content": [
    {
      "type": "text",
      "text": "# Plinking\n\nPlinking is informal target shooting done for leisure, typically at non-standard targets such as tin cans, logs, bottles, balloons, fruits or any other man-made or naturally occurring objects. The term is an onomatopoeia of the sharp, ringing sound (or \"plink\") that a projectile makes when hitting a metallic target such as a tin can or a road sign plate.\nPractice\nIn contrast to shooting done at established target ranges, plinking is generally done at home in one's backyard, in an open field, or on other private land, the owner of which does not demand entrance fees.\nAppeal\nThe primary attributes of plinking that make it appealing as a sport are as follows: easy availability and a broad variety of locations, minimum cost, freedom in practice, outdoors environment, and more engaging shooting experience when compared to established target ranges. Since not all people have reasonable access to a target range, outdoor shooting done at home or another nearby piece of land is a natural alternative, and for many, homemade shooting ranges are the only way to keep up good marksmanship.\nbullet]]\nSince target ranges generally charge a fee for the use of their facilities, and shooters usually have to buy their own paper targets, going to a target range can incur significant costs, especially when added up over time. In addition, gun ranges by necessity have many strict rules about the use of their facilities, concerning shot rate, types of ammunition, and firearms permitted, where the shooter is allowed to stand, and when they can go downrange to check their targets, which some shooters may find stifling. Many shooters also find the open air to be a much more pleasant shooting environment than an indoor target range, which is usually windowless and made of concrete and steel.\nBy contrast, plinking can be done at home or during casual excursions whenever the urge strikes (subject to local regulations), for merely the cost of ammunition, and the targets used can be any item of suitable size that is at hand, with beverage cans being one of the more popular choices. Plinking can be done alone or in small groups at the individual pace of the shooters.\nThe targets that are used are one of the main reasons why plinking is popular among gun enthusiasts, especially hunters. A three-dimensional target in an outdoor setting is much more akin to a real-world hunting scenario, allowing a hunter the opportunity for practice. Since any reasonably sized object, from a soda can or a charcoal briquet to an arbitrary spot on a tree can be used as a target, a three-dimensional plinking range can easily be set up that will simulate situations commonly found while hunting small game, such as when the animal is behind cover, or up in a tree. A plinking target will also often react much more positively to a hit than a paper target will, either with an audible impact, or visual confirmation by moving, splattering, or falling over. Steel targets, which are used for formal action and long range shooting competitions, are also popular among plinksters due to their relative ease to set up, as well as their clear evidence of good hits.\nSee also\n* Glossary of firearms terminology\n* List of rifle cartridges\n* Hunting\n* Target shooting\nReferences\nExternal links\n* [http://firearmusernetwork.com/programs/powerplinker/ Power Plinker]  - Promoting the benefits of plinking."
    }
  ]
}