{
  "content": [
    {
      "type": "text",
      "text": "# Plucking (hair removal)\n\nplucking]]\nPlucking or tweezing can mean the process of human hair removal, removing animal hair or a bird's feathers by mechanically pulling the item from the owner's body. In humans, hair removal is done for personal grooming purposes, usually with tweezers. An epilator is a motorised hair plucker. Those under the influence of deliriants or trichotillomania may pluck their own hair out of habit.\nRoman baths employed personnel solely to pluck hair from their clients' bodies.\nIn birds and animals, plucking is usually carried out by humans, sometimes called pluckers, to the carcass of the subject as part of food preparation.\nDisadvantages\nWhile plucking is a very convenient and affordable hair removal option, it has its disadvantages. If done incorrectly, it can cause trauma to the skin. Some examples of the negative impacts of plucking includes:\n* Folliculitis\n* Hyperpigmentation\n* Acne\n* Ingrown hairs\n* Infection\nAlternatives to Plucking (Tweezing)\nThere are several alternatives to plucking that can produce the same or even longer lasting results.\nShaving\nShaving is a popular go- to hair removal method utilized by both men and women.  This is done when an individual trims unwanted hair by a razor or other trimming device.  Results can last for up to a week. It is recommended that a sharp razor be utilized to lower the risk of getting razor bumps or infection.\nWaxing\nThere are two types of waxes. Stripless waxes, which is used for more sensitive areas of the body, is done when wax is pulled off of the skin with a strip. Stripless waxes are often utilized for facial skin or the groin area. Strip waxes, on the other hand, are used for larger areas of the body such as one's legs and arms. Nevertheless both techniques have lasting results for up to 3 weeks.\nThreading\nThreading is a Southeast Asian hair removal method. This semi permanent hair removal method is done when a cotton thread is pulled alongside the skin, removing the hair in a straight line. This removal technique is used for small areas of the body, such as for facial hair - especially eyebrows. Results last for up to 3 weeks.\nPoultry\n, China]]\nFeathers can be removed either manually or in a tumbling machine. Both methods require the feathers to be first loosened by submerging the slaughtered bird in hot water. Manual plucking involves pulling out the larger feathers then removing the down with a rubbing action. Automated plucking machines use rubber posts protruding from the inside of a spinning drum to pull the feathers from the bird. This process takes less than 30 seconds, whereas manual plucking typically takes several minutes.\nSee also\n| image2 = Poultry plucking machine 01.jpg\n| width2 =\n}}\n*Eyebrow\n*Feather-plucking, a behavioural disorder in captive birds\n*Unibrow\nReferences\nExternal links\n*[http://hairremoval.about.com/od/tweezingorplucking/Tweezing_or_Plucking.htm Tweezing or Plucking]  - About.com Hair Removal"
    }
  ]
}