{
  "content": [
    {
      "type": "text",
      "text": "# Plug-in electric vehicles in the United Kingdom\n\nThe adoption of plug-in electric vehicles in the United Kingdom is actively supported by the British government through the plug-in car and van grants schemes and other incentives.\nAbout 745,000 light-duty plug-in electric vehicles had been registered in the UK up until December 2021, consisting of 395,000 all-electric vehicles and 350,000 plug-in hybrids. Until 2019, the UK had the second largest European stock of light-duty plug-in vehicles in use after Norway. , roughly a quarter of overall sales were battery electric.\nStatistics\nA surge of plug-in car sales began in Britain in 2014. Total registrations went from 3,586 in 2013, to 37,092 in 2016, and rose to 59,911 in 2018. The market share of the plug-in segment went from 0.16% in 2013 to 0.59% in 2014, and achieved 2.6% in 2018.\n, the Mitsubishi Outlander P-HEV is the all-time top-selling plug-in car in the UK with almost 37,000 units registered, followed by the Nissan Leaf with nearly 24,000. Ranking third is the BMW 330e with more than 13,000 units, followed by the BMW i3 with 11,000.\n, the UK had 19,108 public charging points at 6,703 locations, of which 4,391 were rapid charging points at 1,332 locations.\nGovernment support\nSpeaking at the G8 summit in 2008, British Prime Minister Gordon Brown announced plans for Britain to be at the forefront of a \"green car revolution\". He suggested that by 2020 all new cars sold in Britain could be electric or hybrid vehicles producing less than . In preparation for the introduction of mass-produced electric vehicles to Britain's roads, trials of electric cars took place from 2009, with further trials in cities across the UK from 2010. Local councils were invited to submit bids to become Britain's first \"green cities\". One example is Glasgow, where a Scottish consortium was awarded more than  to run a pilot electric car scheme from 2009 to 2011.\n, part of London Streets fleet]]\nLondon mayor Boris Johnson also announced plans in April 2009 to deliver 25,000 electric car-charging places across the capital by 2015, in order to make London the \"electric car capital of Europe\". His target is to get 100,000 electric vehicles onto London's streets. Johnson also pledged to convert at least 1,000 Greater London Authority fleet vehicles to electric by 2015. Transport for London announced that all new taxis must be zero emissions capable by 2018. , there were about 3,000 plug-in electric vehicles in London, 3% of the mayor's goal, up from 1,700 electric cars in January 2009. The city also has only 1,408 charging points in operation, of which, only 57% were used in the first quarter of 2014. , Greater London postcode areas contain 8,000 electric vehicles according to the Driver and Vehicle Licensing Agency (DVLA).\nNissan's Sunderland plant – the largest car factory in the UK – was granted  from the British government and up to  from the European Investment Bank. Production of the Nissan Leaf at the Sunderland plant began in March 2013. The plant has the capacity to produce 60,000 lithium-ion batteries and 50,000 Leafs a year. The UK-produced Leaf, which is sold only in Europe, has an improved driving range, lower price and a more European design.\n, Scotland]]\n, the UK government had pledged  to support the deployment of plug-in vehicles in the five years between March 2010 and March 2015. However, , only  had been spent and an additional of  had been committed for projects up to March 2015, of which  were allocated for research and development;  on infrastructure such as public charging points; and  in consumer purchase incentives (Plug-in Car Grant). , the UK had around 5,000 public charging points, of which, only 200 are quick chargers. By April 2014 the UK was the leader in quick-charging deployment in Europe, with 211 CHAdeMO charging stations available across the country.\nAs a result of lower than initially expected electric and plug-in hybrid vehicle sales, in January 2014 the UK government launched the \"Go Ultra Low\" national campaign in partnership with five of the largest manufacturers of plug-in electric vehicles, BMW, Nissan, Renault, Toyota and Vauxhall. The campaign cost of  and its objective was to promote the benefits of electric and plug-in hybrid cars to buyers. The government classifies any car emitting less than 75g/km of  as ultra-low emission. The British government also announced its commitment to invest  to install more rapid charge-points to make motorway journeys by electric car feasible. According to Nicholas Clegg, Deputy Prime Minister, \"Our clear objective is to move the car fleet in this country to ultra low-emission vehicles by 2040 and to put money and policy money behind it.\"\nIn July 2014 Baroness Kramer, Minister of State for Transport, announced that all of the UK government's fleets would be supplied with funding to introduce electric vehicles. The \"Ultra Low Emission Vehicle Readiness Project\", funded with , is the first step towards making all government vehicles electrically powered. Central government fleets were to benefit first, with plans to bring in over 150 plug-in cars and vans. The Government Car Service, which had 85 vehicles used by ministers, was the initial target with electric cars expected to be in operation by the third quarter of 2014. A second phase would provide funds for the public sector in general to purchase more electric vehicles. Beneficiary agencies include the National Health Service, councils and police forces. In October 2019, the Labour Party said it would aim to ban the sale of new non-electrified cars by 2030.\nIn 2020, the UK government announced an intention to ban sales of new petrol and diesel-powered cars (including hybrids) in 2035.\nPurchase incentives\nIn January 2009, transport secretary Geoff Hoon said the British government would make  (~) available for consumer incentives to bring electric cars to market in the UK. The plug-in grant scheme was first announced in January 2009 by the Labour Government. The coalition government, led by David Cameron, took office in May 2010 and confirmed their support of the grant. This confirmed that  would be available for the first 15 months of the scheme, with the 2011 Spending Review confirming funding for the programme for the lifetime of the Parliament of around  (~).\nTwo subsidy programs were implemented, the Plug-in Car Grant, from 2011 until 2022, and the Plug-In Van Grant, from February 2012. Both offer buyers of eligible vehicles a purchase subsidy discounted at the point of purchase.\nPlug-in Car Grant\nThe Plug-in Car Grant programme was available between 2011 and 2022. The programme reduced the upfront cost of eligible cars by providing a 25% grant towards the cost of new plug-in cars, capped at . From 2015, the purchase price cap was raised to cover up to 35% discount of the vehicle's recommended retail price, up to the same  limit. This change means electric cars priced under , such as the Renault Zoe, were able to take advantage of most or all of the  discount. Both private and business fleet buyers were eligible for this grant, which was received at the point of purchase.\nplug-in hybrid is eligible for the Plug-in Car Grant scheme.]]\nEvolution\nThe government announced in April 2014 that funding for the full grant of up to  would remain in place until either 50,000 grants have been issued or 2017, whichever came first. Nevertheless, as forecasts estimated that the scheme would reached its 50,000 limit around November 2015, the government announced in August 2015 that the grant would continue until at least February 2016 for all plug-in cars with  emissions of 75 g/km of under. The government also announced that a minimum of  (~) had been made available to continue the Plug-in Car Grant.\nAs plug-in car sales surged during 2014 and 2015, the PICG was extended until March 2018. The maximum grant was reduced to , and the amount granted varies according to emission levels. Hydrogen fuel cell cars became eligible for the grant. Models with a list price of more than  are no longer eligible for the grant. The Plug-In Van Grant scheme was extended in October 2016 to make electric trucks above 3.5 tonnes eligible for grants of up to .\n, a total of 176,962 eligible cars have benefited from the subsidy since its launch in 2011, and at the same date the number of claims made through the Plug-in Van Grant scheme was 5,218 since the launch of the programme in 2012.\nIn 2018 the PICG was reduced from £4500 to £3500, and in March 2020 it was cut to £3000.\nEligibility\nAt the start of the scheme, vehicles eligible for the subsidy had to meet the following criteria:\n* Vehicle type: Only ultra-low emission cars wereeligible (vehicle category M1).\n*  Carbon dioxide exhaust emissions: Vehicles must emit equal or less than 75 grams of carbon dioxide () per kilometre driven.\n* Range: Electric vehicles (EVs) must be able to travel a minimum of  between charges. Plug-in hybrid electric vehicles (PHEVs) must have a minimum all-electric range of\nIn February 2015 the government announced that to take account of rapidly developing technology, the criteria for the plug-in car grant was updated and from April 2015, eligible ULEVs must meet criteria in one of the following categories depending on emission levels and zero-emission-capable mileage (this means that hydrogen fuel cell cars were also eligible for the grant):\n* Category 1:  emissions of less than 50g/km and a zero-emission range of at least .\n* Category 2:  emissions of less than 50g/km and a zero-emission range between .\n* Category 3:  emissions of 50–75g/km and a zero-emission range of at least .\nmodels with a list price of over , such as the BMW i8, are no longer eligible for the Plug-in Car Grant from March 2016.]]\nA price cap was in place for Category 2 and 3 models: those with a list price of more than  (~) were no longer eligible for the grant. Vehicles with a zero-emission range of at least  (category 1), including hydrogen fuel cell vehicles, get a full  (~), but plug-in hybrids (categories 2 and 3) costing under  (~) receive  (~).\nPlug-in Van Grant\nThe Plug-In Car Grant was extended to include vans since February 2012. Van buyers can receive 20% – up to  (~) – off the cost of a plug-in van. To be eligible for the scheme, vans have to meet performance criteria to ensure safety, range, and ultra-low tailpipe emissions. Consumers, both business and private can receive the discount at the point of purchase. The Plug-In Van Grant scheme was extended in October 2016 to make electric trucks above 3.5 tonnes eligible for grants of up to , when businesses switch their large trucks to an electric vehicle. Also in October 2016, the government announced their commitment for an additional  to the scheme so that all vans and trucks meeting the eligibility requirements can benefit from the grant scheme. The extension of the Plug-In Van grant means that N2 vans (3.5 – 12 tonnes gross weight) and N3 vans (over 12 tonnes gross weight) are now eligible.\nis eligible for the Plug-In Van Grant.]]\nThe eligibility criteria for vans with a gross weight of 3.5 tonnes or less (N1 van) are:\n* Vehicle type: only new vans are eligible vehicle category N1. This includes pre-registration conversions (normal, internal combustion engine vans that were converted to battery or hybrid versions by specialist converters before the car's first registration).\n* Carbon dioxide exhaust emissions: vehicles must emit less than 75 grams of carbon dioxide () per kilometre driven.\n* Range: eligible fully electric vans must be able to travel a minimum of  between charges. Plug-in hybrid electric vehicles (PHEVs) must have a minimum electric range of .\n, the number of claims made through the Plug-in Van Grant scheme was 2,938 units since the launch of the programme in 2012, up from 1,906 made by the end of December 2015.\nExpensive car supplement exemption\nSince 2017, new cars costing over £40,000 pay additional vehicle excise duty at the first five annual renewals. At first the supplement applied to all types of car but the 2020 Budget provided an exemption for zero-emission vehicles (both new and existing), effective from April 2020. This exemption ended in April 2025.\nHome charge points\nThrough the Office for Low Emission Vehicles (OLEV), the UK government provides grants towards the installation of up to two charge points at a residential address, or up to 20 at a workplace. The installer can claim 75% of the cost (including purchase, installation costs and VAT). The maximum grant for a residential point was initially capped at £1,000 then reduced to £500, and in March 2020 reduced again to £350.\nPlugged-in Places\nOn 19 November 2009, Andrew Adonis, the Secretary of State for Transport, announced a scheme called \"Plugged-in-Places\", making available  to be shared between three and six cities to investigate further the viability of providing power supply for electric vehicles, and encouraging local government and business to participate and bid for funds.\nThe scheme offers match-funding to consortia of businesses and public sector partners to support the installation of electric vehicle recharging infrastructure in lead places across the UK. There are eight Plugged-In Places: East of England; Greater Manchester; London; Midlands; Milton Keynes; North East; Northern Ireland; and Scotland. The government also published an Infrastructure Strategy in June 2011.\nLondon congestion charge\nplug-in hybrid is exempted from the London congestion charge.]]\nAll-electric vehicles (BEVs) and eligible plug-in hybrid electric vehicles (PHEVs) qualify for a 100% discount from the London congestion charge. A plug-in electric drive vehicle qualifies if the vehicle is registered with the Driver and Vehicle Licensing Agency (DVLA) and has a fuel type of 'electric', or alternatively, if the vehicle is a 'plug-in hybrid' and is on the government's list of PHEVs eligible for the OLEV grant.  , approved PHEVs include all extended-range cars such as the BMW i3 REx, and plug-in hybrids that emit 75g/km or less of  and that meet the Euro 5 standard for air quality, such as the Audi A3 Sportback e-tron, BMW i8, Mitsubishi Outlander P-HEV (passenger and van variants), Toyota Prius Plug-in Hybrid, and Volkswagen Golf GTE.\nThe original Greener Vehicle Discount was substituted by the Ultra Low Emission Discount (ULED) scheme that went into effect on 1 July 2013. The ULED introduced more stringent emission standards that limited the free access to the congestion charge zone to any car or van that emits 75g/km or less of  and meets the Euro 5 emission standards for air quality.  there are no internal combustion-only vehicles that meet these criteria. The measure is designed to limit the growing number of diesel vehicles on London's roads.  Mayor Boris Johnson approved the new scheme in April 2013, after taking into account a number of comments received during the 12-week public consultation that took place.  About 20,000 owners of vehicles registered for the Greener Vehicle Discount by June 2013 were granted a three-year sunset period (until 24 June 2016) before they had to pay the full congestion charge.\nEffective from 8 April 2019, the ULED scheme replaced the Cleaner Vehicle Discount This means that from April 2019, only vehicles which are Euro 6, emit up to 75g/km of  and have a minimum 20 mile zero emission range, will qualify for the discount. A further phase from October 2021 will mean that only zero-emission vehicles (pure electric vehicles and hydrogen fuel cell vehicles) will qualify for the discount, which will be phased out completely from December 2025.\nField testing programmes\nField testing with 100 Smart EDs began in London in 2007. On 30 April 2009, the Electric Car Corporation put on sale the Citroën C1 ev'ie, an adapted Citroën C1 intended for city driving. On that date, it had a list price of  ().\nA demonstration trial with the Mini E took place between December 2009 and March 2011 with forty Mini E cars leased to private users for a two consecutive six-month field trial periods. In addition, one Mini E was delivered to the government car pool in Downing Street to be tested by ministers in an urban environment on their official business around London. The UK trial was a partnership between BMW Group UK, Scottish and Southern Energy, the South East England Development Agency (SEEDA), Oxford City Council and Oxfordshire County Council. Data collection and research was conducted by Oxford Brookes University's Sustainable Vehicle Engineering Centre throughout the UK project. Funding support was provided by the Technology Strategy Board and the Department for Transport (DFT) as part of the  () UK-wide program involving trials of 340 ultra-low carbon vehicles from several carmakers. The selected test area is roughly a triangle contained within the M40 motorway between the M25 motorway and Oxford, the A34 south to the M3 motorway, and the M3 back to the M25.\nThe 40 Mini E electric cars were kept in use after the trial was completed in March 2011, participating in activities to promote awareness and understanding of electric vehicles. These cars were part of the BMW Group UK's official vehicle fleet of 4,000 low-emission luxury vehicles deployed for the London 2012 Olympic Games. The fleet also included 160 BMW ActiveE electric cars.\nCharging infrastructure\nelectric car charging at an on-street station in London in 2008]]\n, the UK had 75,675 public charging points at 38,350 locations, of which 15,109 were 50 kW or above, at 5,850 locations. According to the National Chargepoint Registry, in 2024 there were over 30 network operators (charge point owners, branded networks, such as POLAR and charge point controllers, such as Chargemaster) on a national and regional basis. , the regions with most of the infrastructure are Greater London (30.4%), the South East (12.6%), West Midlands (8.8%) and Scotland (8.3%).\n, the chargepoint operators with the largest UK networks are Shell Recharge, Connected Kerb, Pod Point, and PB Pulse. Regional operators include Source London, ChargePlace Scotland, Plugged-In Midlands, and eCar (for Northern Ireland).\nMany companies, local and regional authorities provide charging to employees and members of the public. Purchasers and lessees of electric vehicles can also claim a grant towards the installation of a charger at their home.\nSales\nAbout 745,000 light-duty plug-in electric vehicles had been registered in the UK up until December 2021, consisting of 395,000 all-electric vehicles and 350,000 plug-in hybrids. Before the market launch of highway-capable mass production plug-in electric cars in 2010, a total of 1,096 electric vehicles were registered in the country between 2006 and December 2010. , the UK had the second largest European stock of light-duty plug-in vehicles in use after Norway.\n2010–2013\nElectric car sales grew from 138 units in 2010 to 1,082 units during 2011. Before 2011, the G-Wiz quadricycle was top selling EV for several years. During 2012, a total of 2,254 plug-in electric cars were registered in the UK, of which, 1,262 were pure electrics, and sales were led by the Nissan Leaf with 699 units, followed by the Toyota Prius Plug-in Hybrid with 470 units, and the Vauxhall Ampera with 455 units sold in 2012. In addition, 279 Renault Kangoo Z.E. electric vans and 252 Renault Twizy electric quadricycles were sold through September 2012. Vehicles eligible for the Plug-in Car Grant accounted for 0.1% of total new car sales in 2012, with pure electric cars representing only 0.06%.\nDuring 2013, a total of 3,586 plug-in electric cars were registered, up 59.0% from 2012. Of these, 2,512 were pure electric cars, up 99.0% from 2012, and 1,072 plug-in hybrids, up 8.1% from 2012. Plug-in car sales represented a 0.16% market share of the 2.26 million new cars sold in the UK in 2013. The top selling plug-in electric car during 2013 was the Nissan Leaf, with 1,812 units sold, and the Prius PHV ended 2013 as the top selling plug-in hybrid with 509 units sold, up 8.5% from 2012.\n2014\nThe British market experienced a rapid growth of plug-in car sales during 2014, driven by the introduction of new models such as the BMW i3, Tesla Model S, Mitsubishi Outlander P-HEV, Renault Zoe, and Volkswagen e-Up!. The number of plug-in cars available in the market climbed from 9 models in 2011 to 18 in 2013, and to 29 models by the end of 2014. Registrations during 2014 totaled 14,518 plug-in electric cars and consisted of 6,697 pure electrics and 7,821 plug-in hybrids. Total registrations in 2014 were up 305% from 2013, with all-electric cars growing 167% while plug-in hybrid registrations were up 628% from a year earlier. The plug-in electric car segment captured a 0.59% market share of new car sales in 2014, over three times and a half the market share of 2013 (0.16%). In November 2014, with 646 all-electric cars and 1,225 plug-in hybrids registered, the segment's market share passed 1% of monthly new car sales for the first time in the UK. Again in January 2015, the segment's market share was over 1% of new car sales with 1,715 plug-in electric cars registered that month.\n, England. The Nissan Leaf, with 15,000 units sold by September 2016, has been the best-selling pure electric car in the UK since 2011.]]\nNissan Leaf sales in September 2014 achieved a record of 851 units, up from 332 units the same month in 2013, representing the best monthly sales ever in the UK, and also the largest volume of Nissan Leafs ever sold in one month in a European country. The previous European record was achieved by Norway in March 2013 with 703 Leafs sold in that month. Sales of recently introduced BMW i3 and i8 models exceeded 1,600 units during 2014. The Outlander P-HEV was among the new models with a significant effect in the market, released in April 2014, it captured a 35.8% market share of total plug-in sales during the first half of 2014. The Mitsubishi plug-in hybrid became the top selling plug-in electric vehicle in July 2014 and captured 43% of all applications to the Plug-in Car Grants scheme that month.\nThe Outlander P-HEV ended 2014 as the top selling plug-in electric car in the UK that year with 5,370 units sold. Sales of the Nissan Leaf also experienced significant growth in 2014, with 4,051 units sold, up 124% from the 1,812 units sold in 2013, and ranked as the top selling all-electric car in 2014. , the Leaf continued ranking as the top selling plug-in electric car in the UK ever with cumulative sales of 7,197 units since its introduction in March 2011. Over 24,500 light-duty plug-in electric cars were registered in the country at the end of December 2014.\n2015\nThe surge in demand for plug-in cars continued during 2015, to the extent that 2014's ultra-low emission vehicle (ULEV) sales figure was passed in June 2015. Plug-in electric car registrations in the UK totaled 28,188 units in 2015, consisting of 9,934 pure electric cars and 18,254 plug-in hybrids. Total registrations in 2015 were up 94.0% from 2014, with all-electric cars growing 48.3% year-on-year, while plug-in hybrid registrations were up 133.0% year-on-year. Since 2011, about 54,000 plug-in electric vehicles have been registered in the UK up until December 2015, including plug-in hybrids and all-electric cars, and about 2,900 commercial vans. This figure includes a significant number of registered plug-in electric cars and vans which were not eligible for the grant schemes.\nranks as the third best selling plug-in electric car in the UK ever with almost 6,000 units sold through October 2016.]]\nThe plug-in electric car segment raised its market share of new car sales in 2015 to almost 1.1%, up from 0.59% in 2014. With almost 3,100 plug-in cars sold during December 2015, the plug-in segment reached a record of 1.7% of new car sales in the UK, the highest ever. According to the British Vehicle Rental and Leasing Association (BVRLA), the market share of all new leased cars reached 4% in 2015, while a record 4.7% of all new leased cars registered during the last quarter of 2015 was a plug-in.\nSales of the Mitsubishi Outlander P-HEV in the British market reached the 10,000 unit milestone in March 2015, allowing the plug-in hybrid to overtake the Leaf as the all-time top selling plug-in electric vehicle in the UK. Sales of the Nissan Leaf sales passed the 10,000 unit milestone in June 2015. The top selling models in 2015 were the Outlander P-HEV with 11,681 units registered, up 118% from 2014, followed by the Leaf with 5,236 units (up 29%), and the BMW i3 with 2,213 units (up 59%).\n, cumulative sales of the Outlander P-HEV, the top selling plug-in car in the UK ever, totaled 17,045 units registered, and cumulative sales of the Nissan Leaf, the top selling all-electric car ever, totaled 12,433 units registered. Combined sales of the Outlander PHEV and the Nissan Leaf represent more than 50% of the British stock of plug-in electric cars sold since 2011.\n2016\nPlug-in car sales in March 2016 achieved the best monthly plug-in sales volume on record ever, with 7,144 grant eligible cars registered, exceeding the previous high of 6,104 units, recorded in March 2015. The plug-in market share during this month reached 1.37% of total UK new car registrations, continuing the trend for the fifth month running of sales equal of or exceeding the 1.3% market share threshold. The surge in March sales was expected as a result of the changes in the Plug-in Car Grant scheme, which now provides a stronger incentive for pure electrics over plug-in hybrids, as the grant amount available for purchase of both types of powertrain was reduced, but the grant for plug-in hybrids was cut by half.\nis the all-time top selling plug-in electric car in the UK, with 26,600 units sold up until December 2016.]]\nDuring the first quarter of 2016, Outlander P-HEV sales totalled 3,906 units, representing 52.3% of all plug-in hybrid registered in the UK during the quarter. By early April 2016, two years since launch, there were 21,053 Outlander P-HEVs in the UK's roads, and the plug-in SUV sales represent 36.2% of the 58,186 eligible cars registered since the grant scheme was introduced in January 2011. The sustained demand for plug-in cars over the previous 12 months through March 2016, has allowed the UK to become a leading market in the European Union for electric vehicles, ranking as the second biggest market after the Netherlands in terms of total plug-in car registrations, with 28,715 new units representing 20% of the European Union's collective plug-in sales.\nRegistrations during the first six months of 2016 recorded the highest-volume half-year ever for plug-in electric car registrations. A total of 19,252 plug-in electric cars were registered in the UK between January and June 2016. During the first half of 2016, the Mitsubishi Outlander PHEV was the top-selling plug-in car in the UK with 5,738 units registered. The Nissan Leaf remained the top-selling pure-electric car with 2,336 registrations.\nA total of 37,092 plug-in electric vehicles were registered in 2016, of which, 35,447 cars were eligible for the Plug-in Car Grant. Registrations consisted of 10,264 all-electric cars, up 3.3% from 2015, and 26,828 plug-in hybrids, up 41.9% from the previous year. Sales of plug-in hybrids oversold pure electric cars, with the latter more than doubling sales of battery electric models. The plug-in car segment's market share reached 1.37% of new car sales in 2016. While overall new car registrations year-to-date increased 2.3% from the same period in 2015, total plug-in car registrations in 2016 increased 28.6% from a year earlier. The Outlander P-HEV continued to lead sales of the plug-in electric segment in 2016 with 9,486 units delivered. The Leaf remained as the top selling all-electric car with 4,463 units registered. The other best selling models were the Mercedes-Benz C 350 e (4,934), BMW 330e (3,499), and the BMW i3 (2,450).\nBy mid-October 2016, sales of the Outlander P-HEV passed the 25,000 unit mark, accounting for about 50% of all plug-in hybrid sold in the UK since 2010. , the Outlander plug-in hybrid continued ranking as the all-time top selling plug-in electric car in the UK, with 26,600 units sold since its inception. Cumulative sales of the Nissan Leaf, the second all-time best selling plug-in car and top selling all-electric car ever, passed the 15,000 unit mark in September 2016. Ranking third is the BMW i3, with almost 6,000 units sold since its inception in late 2013 through October 2016.\n2017–2019\nRegistration of plug-in cars totaled 8,087 units in March 2017, surpassing the previous sales record achieved in March 2016 (7,534). In addition to the normal annual sales peak caused by the plate change, consumers rushed to complete purchases to avoid the new vehicle excise duty (VED) rates that came into force from 1 April for petrol-powered vehicles priced more than £40,000, including all plug-in hybrid models. The plug-in electric car segment reached a market share of 1.44% of new car sales in March 2017. Registrations during the first quarter of 2017 totaled 12,071 plug-in cars, consisting of 4,634 all-electric cars and 7,437 plug-in hybrids, achieving a record market share of 1.47% for that quarter.\nRegistrations totalled 49,182 plug-in cars in 2017, up 33% from 2016, and consisting of 35,585 plug-in hybrids and 13,597 all-electric cars, representing a market share of 1.94% of total new registrations.\nRegistrations totalled 59,911 plug-in electric cars in 2018, up 22% from 2017, and consisting of 44,437 plug-in hybrids and 15,474 all-electric cars, representing a market share of 2.53% of total new registrations. , the Mitsubishi Outlander P-HEV continued to rank as the most popular plug-in car, with almost 37,000 units registered, followed by the all-electric Nissan Leaf with almost 24,000 units.\n, the RAC foundation reported the stock of all-electric cars in use was led by the Nissan Leaf with 28,395 units, followed by the Tesla Model 3 with 10,572, the Renault Zoe with 9,929, and the Tesla Model S with 9,534.\n2020–2025\n, the Mitsubishi Outlander P-HEV is the all-time top selling plug-in car in the UK 47,447 units registered, followed by the Nissan Leaf with 33,492 and the Tesla Model 3 with 25,574. , roughly a quarter of overal sales were battery electric.\nTop selling models by year\nThe following table presents annual registrations of plug-in electric cars and vans by model between 2010 and 2013, and total registrations (cumulative) by model at the end of December 2014, and at the end of June 2016.\n{| class=\"wikitable\"\n|+ Registration of light-duty highway legal plug-electric cars by model in the UK between 2010 and June 2016\n|-\n! style=\"background:#ABCDEF\" rowspan=\"2\" | Model ||colspan=\"3\" style=\"text-align:center; background:#ABCDEF\"|Total registered at the end of||colspan=\"4\" style=\"text-align:center; background:#ABCDEF\"|Registrations by year between 2010 and December 2013\n|-\n!style=\"background:#ABCDEF\"| 2Q 2016 ||style=\"background:#ABCDEF\"| 2015||style=\"background:#ABCDEF\" | 2014  || style=\"background:#ABCDEF\" | 2013 || style=\"background:#ABCDEF\" | 2012 || style=\"background:#ABCDEF\" | 2011 || style=\"background:#ABCDEF\" | 2010\n|- style=\"text-align:center;\"\n| align=\"left\" | Mitsubishi Outlander P-HEV || 21,708 || 16,100 || 5,273 || &nbsp; || &nbsp; || &nbsp; || &nbsp;\n|- style=\"text-align:center;\"\n| align=\"left\" | Nissan Leaf || 12,837 || 11,219 || 6,838 || 1,812 || 699 || 635 || &nbsp;\n|- style=\"text-align:center;\"\n| align=\"left\" | BMW i3 || 4,457 || 3,574 || 1,534 || NA || &nbsp; || &nbsp; || &nbsp;\n|- style=\"text-align:center;\"\n| align=\"left\" | Renault Zoe || 4,339 || 3,327 || 1,356 || 378 ||&nbsp;||&nbsp;||&nbsp;\n|- style=\"text-align:center;\"\n| align=\"left\" | Mercedes-Benz C350 e || 3,337 || 628 || 0 || &nbsp; || &nbsp; || &nbsp; || &nbsp;\n|-style=\"text-align:center;\"\n| align=\"left\" | Tesla Model S || 3,312 || 2,087 || 698 || &nbsp; || &nbsp; || &nbsp; || &nbsp;\n|- style=\"text-align:center;\"\n| align=\"left\" | Volkswagen Golf GTE || 2,657 || 1,359 || 0 || &nbsp; || &nbsp; || &nbsp; || &nbsp;\n|- style=\"text-align:center;\"\n| align=\"left\" | Toyota Prius PHV || 1,655 || 1,580 || 1,324 || 509 || 470 || &nbsp; || &nbsp;\n|- style=\"text-align:center;\"\n| align=\"left\" | Audi A3 e-tron || 1,634 || 1,218 || 66 || &nbsp; || &nbsp; || &nbsp; || &nbsp;\n|- style=\"text-align:center;\"\n| align=\"left\" | Nissan e-NV200 || 1,487 || 1,047 || 399 || &nbsp; || &nbsp; || &nbsp; || &nbsp;\n|- style=\"text-align:center;\"\n| align=\"left\" | BMW 330e iPerformance || 1,479 || &nbsp; || &nbsp;|| &nbsp; || &nbsp; || &nbsp; || &nbsp;\n|- style=\"text-align:center;\"\n| align=\"left\" | BMW i8 || 1,307 || 1,022 || 279 || &nbsp; || &nbsp; || &nbsp; || &nbsp;\n|- style=\"text-align:center;\"\n| align=\"left\" | Vauxhall Ampera || 1,267 || 1,272 || 1,169 || 175 || 455 || 4 || &nbsp;\n|- style=\"text-align:center;\"\n| align=\"left\" | Volvo XC90 T8 || 813 || 38 || &nbsp; || &nbsp; || &nbsp; || &nbsp; || &nbsp;\n|- style=\"text-align:center;\"\n| align=\"left\" | Renault Kangoo Z.E || 785 || 740 || 663 || &nbsp; || &nbsp; || &nbsp; || &nbsp;\n|- style=\"text-align:center;\"\n| align=\"left\" | Porsche Panamera S E-Hybrid || 475 || 395 || 241 || &nbsp; || &nbsp; || &nbsp; || &nbsp;\n|- style=\"text-align:center;\"\n| align=\"left\" | Volvo V60 Plug-in Hybrid || 410 || 337 || 232 || &nbsp; || &nbsp; || &nbsp; || &nbsp;\n|- style=\"text-align:center;\"\n| align=\"left\" | Peugeot iOn || 405 || 374 ||368|| 26 || 251 || 124 || &nbsp;\n|- style=\"text-align:center;\"\n| align=\"left\" | Mercedes-Benz B-Class Electric Drive || 303 || 162 || 0 || &nbsp; || &nbsp; || &nbsp; || &nbsp;\n|- style=\"text-align:center;\"\n| align=\"left\" | Mitsubishi i MiEV || 252 || 251 ||266|| 1 || 107 || 125 || 27\n|- style=\"text-align:center;\"\n| align=\"left\" | Smart electric drive || 215 || 212 || 205 || 3 || 13 || &nbsp; || 63\n|- style=\"text-align:center;\"\n| align=\"left\" | Citroën C-Zero || 213 || 167 || 202 || 45 || 110 || 46 || &nbsp;\n|- style=\"text-align:center;\"\n| align=\"left\" | Kia Soul EV || 193 || 145 || 20 || &nbsp; || &nbsp; || &nbsp; || &nbsp;\n|- style=\"text-align:center;\"\n| align=\"left\" | BMW 225xe || 163 || &nbsp; || &nbsp; || &nbsp; || &nbsp; || &nbsp; || &nbsp;\n|- style=\"text-align:center;\"\n| align=\"left\" | Volkswagen e-Up! || 154 || 142 || 118 || &nbsp; || &nbsp; || &nbsp; || &nbsp;\n|- style=\"text-align:center;\"\n| align=\"left\" | Mercedes-Benz S500 PHEV || 125 || 157 || 14 || &nbsp; || &nbsp; || &nbsp; || &nbsp;\n|- style=\"text-align:center;\"\n| align=\"left\" | Volkswagen e-Golf || 123 || 114 || 47 || &nbsp; || &nbsp; || &nbsp; || &nbsp;\n|- style=\"text-align:center;\"\n| align=\"left\" | Chevrolet Volt || 119 || 122 || 124 || 23 || 67 || &nbsp; || &nbsp;\n|- style=\"text-align:center;\"\n| align=\"left\" | Renault Fluence Z.E. || 79 || 70 || 73 || 7 || 67 || &nbsp; || &nbsp;\n|- style=\"text-align:center;\"\n| align=\"left\" | Ford Focus Electric || 22 || 19 || 19 || &nbsp; || &nbsp; || &nbsp; || &nbsp;\n|- style=\"text-align:center;\"\n| align=\"left\" | Mercedes-Benz Vito E-Cell || 22 || 23 || 23 || &nbsp; || &nbsp; || &nbsp; || &nbsp;\n|- style=\"text-align:center;\"\n| align=\"left\" | Mia electric || 15 || 15 ||14 || &nbsp; || &nbsp; || &nbsp; || &nbsp;\n|- style=\"text-align:center;\"\n| align=\"left\" | Volkswagen Passat GTE || 1 || &nbsp; || &nbsp; || &nbsp; || &nbsp; || &nbsp; || &nbsp;\n|- style=\"text-align:center;\"\n| align=left | BYD e6 || 0 || 0 || 0 || 50 || &nbsp; || &nbsp; || &nbsp;\n|- style=\"text-align:center;\"\n! align=left style=\"background:#f1f5fa;\"|Total registrations ||style=\"background:#f1f5fa;\"| 66,374 ||style=\"background:#f1f5fa;\"| 47,920 ||style=\"background:#f1f5fa;\"|21,504||style=\"background:#f1f5fa;\"|3,586||style=\"background:#f1f5fa;\"|2,254||style=\"background:#f1f5fa;\"|1,082||style=\"background:#f1f5fa;\"|138\n|-\n| colspan=\"8\" style=\"text-align:left; background:#ABCDEF\"|Notes: NA: not available.  Registrations figures seldom correspond to same sales figure.\n}}\n|}\nSee also\n* Electric car use by country\n* Government incentives for plug-in electric vehicles\n* List of modern production plug-in electric vehicles\n* Neale (electric car)\n* New energy vehicles in China\n* Plug-in electric vehicle\n* Plug-in electric vehicles in Australia\n* Plug-in electric vehicles in California\n* Plug-in electric vehicles in Canada\n* Plug-in electric vehicles in Europe\n* Plug-in electric vehicles in France\n* Plug-in electric vehicles in Germany\n* Plug-in electric vehicles in Japan\n* Plug-in electric vehicles in the Netherlands\n* Plug-in electric vehicles in Norway\n* Plug-in electric vehicles in Sweden\n* Plug-in electric vehicles in the United States\n* Renewable energy in the United Kingdom\nReferences\n}}\nExternal links\n* [https://www.zap-map.com/ev-stats/ev-market Electric car market statistics in the UK], Zap-Map.\n* [https://www.zap-map.com/ EV charging point map in the UK]\n* [https://www.camecon.com/wp-content/uploads/2016/10/Fuelling_Britains_Future.pdf Fueling British's Future], Cambridge Econometrics, March 2015.\n* [https://www.ippr.org/articles/leading-the-charge-can-britain-develop-a-global-advantage-in-ultra-low-emission-vehicles Leading the Charge – Can Britain Develop a Global Advantage in Ultra-Low-Emission Vehicles], Institute for Public Policy Research, April 2013\n* [http://www.racfoundation.org/assets/rac_foundation/content/downloadables/powering_ahead-kay_et_al-apr2013.pdf Powering Ahead – The future of low-carbon cars and fuels], the RAC Foundation and UK Petroleum Industry Association, April 2013.\n* [https://www.gov.uk/plug-in-vehicle-grants Low-emission vehicles eligible for a plug-in grant] official website."
    }
  ]
}