{
  "content": [
    {
      "type": "text",
      "text": "# Plumbeous warbler__disambig_1\n\n| taxon = Setophaga plumbea\n| authority = (Lawrence, 1877)\n| synonyms = * Dendroica plumbea Lawrence, 1877\n| range_map = Dendroica plumbea map.svg\n}}\nThe plumbeous warbler (Setophaga plumbea) is a species of passerine bird belonging to the family Parulidae, the New World warblers. This species is found only in Dominica and Guadeloupe in the Lesser Antilles. Its natural habitats are subtropical or tropical dry forest and subtropical or tropical moist lowland forest.\nTaxonomy\nThe plumbeous warbler was first formally described as Dendroica plumbea in 1877 by George Newbold Lawrence with its type locality given as Dominica. This species is now classified within the genus Setophaga which belongs to the family Parulidae, the wood warblers or New World warblers. The plumbeous warbler forms a superspecies with the Elfin woods warbler (S. angelae) of Puerto Rico and the arrowhead warbler (S. pharetra) of Jamiaca.\nEtymology\nThe plumbeous warbler is classified in the genus Setophaga; this name means \"moth eater\" in Greek. The specific name, plumbea, is Latin and means \"lead coloured\", a reference to the dull grey, lead-like colour of this bird.\nDescription\nThe plumbeous warbler is a small bird with a length of . The adults have uniformly grey upperparts with a white supercilium and two white wingbars. The underparts are paler grey with a white belly and centre of the breast. The immatures have greenish-grey upperparts and buffish underparts with less distinct supercilim. The song is made up of between 3 and 12 slow, whistled notes, with the first three being at the same pitch. The call is a dry rattling sound.\nDistribution and habitat\nThe plumbeous warbler is endemic to the Lesser Antilles where it is restricted to Dominica and Guadeloupe, including Marie-Galante and Îles des Saintes. This species is found in humid montane forests as well as in drier scrub and mangroves.\nReferences"
    }
  ]
}