{
  "content": [
    {
      "type": "text",
      "text": "# Pogroms in the Russian Empire\n\nPogroms in the Russian Empire () were large-scale, targeted, and repeated anti-Jewish riots that began in the 19th century. Pogroms began to occur after Imperial Russia, which previously had very few Jews, acquired territories with large Jewish populations from the Polish–Lithuanian Commonwealth and the Ottoman Empire from 1772 to 1815. These territories were designated \"the Pale of Settlement\" by the Imperial Russian government, within which Jews were reluctantly permitted to live. The Pale of Settlement primarily included the territories of Poland, Ukraine, Belarus, Bessarabia (modern Moldova), Lithuania and Crimea. Jews were forbidden from moving to other parts of European Russia (including Finland), unless they converted from Judaism or obtained a university diploma or first guild merchant status. Migration to the Caucasus, Siberia, the Far East or Central Asia was not restricted.\nEarly pogroms\nEarly pogroms took place in the city of Odessa, Russian Empire (now in Ukraine) during the 19th and early 20th centuries. They occurred in 1821, 1859, 1871, 1881 and 1905.\n1881–1882\nThe use of the term \"pogrom\" became common in the English language after a large-scale wave of anti-Jewish riots swept through south-western Imperial Russia (present-day Ukraine and Poland) from 1881 to 1882; when more than 200 anti-Jewish events occurred in the Russian Empire, the most notable of them were pogroms which occurred in Kiev, Warsaw and Odessa. They changed perceptions among Russian Jews and indirectly gave a significant boost to the early Zionist movement.\nTo circumvent censorship, these pogroms were referred to in the Jewish press as the \"Storms in the South\" or \"Storms in the Negev\" (, Sufot BaNegev). The names are a reference to the  prophecy in Isaiah 21:1. Variants of the translation of the prophecy: \"...As storms in the South pass through, So it comes from the desert, from a terrible land.\" or: \"Like whirlwinds sweeping through the Negev, an invader comes from the desert, from a land of terror\", and so on, with \"Negev\" meaning \"South\" in Biblical Hebrew and the pogroms in question happening in the south (south-west) of the European part of the Russian Empire.\nThe event which triggered the pogroms was the assassination of Tsar Alexander II on 13 March [1 March, Old Style], 1881, for which some blamed \"agents of foreign influence,\" implying that Jews committed it. One of the conspirators was of Jewish origins, and the importance of her role in the assassination was greatly exaggerated during the pogroms that followed. Another conspirator was baselessly rumored to be Jewish. The right-wing Russian press engaged in an anti-Jewish campaign and spread rumors of an impending pogrom. An antisemitic blood libel was spread that Jews had been responsible for the tsar's murder.\nLocal economic conditions, such as debt owed to Jewish moneylenders, are thought to have contributed significantly to the rioting, especially with regard to the participation of the business competitors of local Jews and the participation of railroad workers. Russia's industrialization caused Russians to be moving into and out of major cities. People trying to escape the big cities carried their antisemitic values with them, spread the ideas throughout Russia, and caused more pogroms in different regions of Russia. That has been argued to have been actually more important than rumors of Jewish responsibility for the death of the Tsar. Those rumors, however, were clearly of some importance, if only as a trigger, and they drew upon a small kernel of truth: one of the close associates of the assassins, Hesya Helfman, was born into a Jewish home. The fact that the other assassins were all atheists and that the wider Jewish community had nothing to do with the assassination had little impact on the spread of such antisemitic rumors, and the assassination inspired retaliatory attacks on Jewish communities. During these pogroms, thousands of Jewish homes were destroyed; many families were reduced to poverty and large numbers of men, women and children were injured in 166 towns in the south-western provinces of the Empire, such as Ukraine.\nThere also was a large pogrom on the night of 15–16 April 1881 (the day of Eastern Orthodox Easter) in the city of Yelizavetgrad (now Kropyvnytskyi). On 17 April, the Army units were dispatched and were forced to use firearms to extinguish the riot. However, that only incited the whole situation in the region and between April 15 and April 28, 48 anti-Jewish disturbances occurred in Kherson Governorate.\nOn 26 April 1881, an even bigger disorder engulfed the city of Kiev. The Kiev pogrom of 1881 is considered the worst one that took place in 1881. The pogroms of 1881 continued on through the summer, spreading across the territory of modern-day Ukraine: (Podolia Governorate, Volyn Governorate, Chernigov Governorate, Yekaterinoslav Governorate, and others). During these pogroms the first local Jewish self-defense organizations started to form—the most prominent one in Odessa, which was organized by the Jewish students of the Novorossiysk University.\nFor decades after the 1881 pogroms, many government officials held the antisemitic belief that Jews in villages were more dangerous than Jews who lived in towns. The Minister of the Interior Nikolay Pavlovich Ignatyev rejected the theory that pogroms were caused by revolutionary socialists, and instead he adopted the idea that they were a protest by the rural population against Jewish exploitation. With this idea in mind, he promulgated the notion that pogroms had spread from villages to towns. Historians today recognize that although rural peasantry did largely participate in the pogrom violence, pogroms began in the towns and spread to the villages.\nThe new Tsar Alexander III initially blamed revolutionaries for the riots and in May 1882 issued the May Laws, a series of harsh restrictions on Jews.\nThe pogroms continued for more than three years and were thought to have benefited from at least the tacit support of the authorities, although there were also attempts by the Russian government to end the rioting.\nThe pogroms and the official reaction to them led many Russian Jews to reassess their perceptions of their status within the Russian Empire, and so led to significant Jewish emigration, mostly to the United States.\nCasualties\nAt least 40 Jews were killed during pogroms between April and December 1881. 25 Jews and 25 rioters were killed in 259 pogroms from 1881-1883 in Imperial Russia.\nBritish reaction\nBritish responses to pogroms in the Russian Empire varied. The leaders of the Jewish community in London were slow to speak out. It was only after Louisa Goldsmid's support following leadership from an anonymous writer named \"Juriscontalus\" and the editor of The Jewish Chronicle that action was taken in 1881. Public meetings were held across the country and Jewish and Christian leaders in Britain spoke out against the atrocities.\n1903–1906\n)]]\nA much bloodier wave of pogroms broke out from 1903 to 1906, leaving an estimated 2,000 Jews dead and many more wounded, as the Jews took to arms to defend their families and property from the attackers. Particularly, the 1905 pogrom stands as one of the most severe incidents of anti-Jewish violence in Russia at the time, both in terms of property damage and human casualties. In comparison, the pogrom wave that occurred between 1881 and 1882 resulted in fewer fatalities. According to police records in Odessa, a minimum of 400 Jews and 100 non-Jews lost their lives, while around 300 individuals, predominantly Jewish, were injured. Additionally, an estimated 1,632 residential and commercial properties owned by Jews sustained damage. These numbers are considered by some to be conservative estimates, particularly regarding the number of injured individuals. The violence against the Jewish community was extreme, and involved acts such as physical assault and other forms of harm against men, women, and children who were not engaged in opposition to the government at the time. Reports also indicate instances of individuals being thrown from windows, sexual assault against women across age groups, and fatal violence against infants witnessed by their parents.\nThe New York Times reprinted a story from the Jewish Daily News who reprinted a cable dispatch from St. Petersburg which described the Kishinev pogrom of Easter, 1903:\nThe anti-Jewish riots in Kishinev, Bessarabia [modern Moldova], are worse than the censor will permit to publish. There was a well laid-out plan for the general massacre of Jews on the day following the Orthodox Easter. The mob was led by priests, and the general cry, \"Kill the Jews\", was taken up all over the city. The Jews were taken wholly unaware and were slaughtered like sheep. The dead number 120 [Note: the actual number of dead was 47–48] and the injured about 500. The scenes of horror attending this massacre are beyond description. Babies were literally torn to pieces by the frenzied and bloodthirsty mob. The local police made no attempt to check the reign of terror. At sunset the streets were piled with corpses and wounded. Those who could make their escape fled in terror, and the city is now practically deserted of Jews.\n. An invalid Jewish soldier who, having returned home from the Russo-Japanese War, finds the bodies of his family who had died at the hands of pogromists. A rabbi is saying Kaddish for a member of the household who was killed.]]\nThis series of pogroms affected 64 towns (including Odessa, Yekaterinoslav, Kiev, Kishinev, Simferopol, Romny, Kremenchug, Nikolayev, Chernigov, Kamenets-Podolski, Yelizavetgrad), and 626 small towns (Russian: городок) and villages, mostly in Ukraine and Bessarabia.\nHistorians such as Edward Radzinsky suggest that many pogroms were incited by authorities and supported by the Tsarist Russian secret police (the Okhrana), even if some happened spontaneously. The perpetrators who were prosecuted usually received clemency by Tsar's decree.\nEven outside of these main outbreaks, pogroms remained common; there was an anti-Jewish riot in Odessa in 1905 in which thousands of Jews were killed.\nThe 1903 Kishinev pogrom, also known as the Kishinev Massacre, in present-day Moldova killed 47–49 persons. It provoked an international outcry after it was publicized by The Times and The New York Times. There was a second, smaller Kishinev pogrom in 1905.\nA pogrom on July 20, 1905, in Yekaterinoslav (present-day Dnipro, Ukraine), was stopped by the Jewish self-defense group. One man in the group was killed.\nOn July 31, 1905, there was the first pogrom outside the Pale of Settlement, in the town of Makariev (near Nizhni Novgorod), where a patriotic procession led by the mayor turned violent.\nAt a pogrom in Kerch in Crimea on 31 July 1905,[https://www.jewishvirtuallibrary.org/jsource/judaica/ejud_0002_0012_0_11044.html Kerch] the mayor ordered the police to fire at the self-defence group, and two fighters were killed (one of them, P. Kirilenko, was a Ukrainian who joined the Jewish defence group). The pogrom was conducted by the port workers apparently brought in for the purpose.\nAfter the publication of the Tsar's Manifesto of October 17, 1905, pogroms erupted in 660 towns mainly in the present-day Ukraine, in the Southern and Southeastern areas of the Pale of Settlement. In contrast, there were no pogroms in present-day Lithuania. There were also very few incidents in Belarus or Russia proper. There were 24 pogroms outside of the Pale of Settlement, but those were directed at the revolutionaries rather than Jews.\nEyewitness account from local milkmen described the 1905 Odessa pogrom as follows:\nThe three previous days they [Jewish family] had been in hiding. By Friday afternoon the pogrom was wrapping up. Friday night their neighbors, who were Russian, assured them that they could go home. They went and sat down for tea. And those same neighbors, it would seem, quietly let the killers in, since they never heard them knocking in the hallway. Suddenly, there was a knock on the door and strangers’ footsteps. The tea drinkers all hid: the servant by himself, the father by himself, the mother and daughter together. The killers found the mother and daughter first. They hit the mother in the head with an axe and cut the daughter’s arm. Their screams brought the father running, and he was taken down on the spot. The wounded mother was later taken to the hospital, while the daughter got off lightly.\nThe greatest number of pogroms were registered in the Chernigov gubernia in northern Ukraine. The pogroms there in October 1905 took 800 Jewish lives, the material damages estimated at 70,000,000 rubles. 400 were killed in Odessa, over 150 in Rostov-on-Don, 67 in Yekaterinoslav, 54 in Minsk, 30 in Simferopol—over 40, in Orsha—over 30.\nIn 1906, the pogroms continued: January — in Gomel, June — in Bialystok (ca. 80 dead), and August — in Siedlce (ca. 30 dead). The Russian secret police and the military personnel organized the massacres.\nIn many of these incidents the most prominent non-soldier/police participants were railway workers, industrial workers, and small shopkeepers and craftsmen, and (if the town was a river port (e.g. Yekaterinoslav) or a seaport (e.g. Kerch)), waterfront workmen; peasants joined in mainly to loot.[https://www.jewishvirtuallibrary.org/jsource/judaica/ejud_0002_0016_0_15895.html Pogroms]\nCauses\nHistorian Bob Weinberg traces the roots of the pogrom to the complex social and political setting of Russia during that period. He contends that part of the explanation for the brutality lies in the realm of identity politics. For some individuals involved, their actions were not just acts of violence but also expressions of their Orthodox Christian beliefs and loyalty to the Russian monarch. The sense of eroding authority and changes in political structures seemed to amplify this sentiment, as exemplified by events like the vandalization of Tsar Nicholas II's portraits, which stirred animosity and rallied those resistant to change.\nContributing to the climate of political polarization, pro-tsarist, right-wing organizations, such as the Black Hundreds, consolidated their ranks to counter revolutionary and liberal movements. These groups viewed the anti-government opposition as a threat to the autocracy and Russian national identity. Their newspapers and leaflets blamed minorities such as Poles, Armenians, Georgians, but especially Jews for the social and political unrest, calling on Russians to \"beat the Jews, students and wicked people who seek to harm our Fatherland\".\ns (nagaika)]]\nThe Black Hundreds explicitly linked their support for the tsar with antisemitism. Their rallies and patriotic marches, like the one that preceded the main pogrom on October 19, enjoyed the tacit blessing of the local authorities, and were used by advocates of the autocracy to support the government and undermine the concessions made as a result of the October revolution.  This ideology framed anti-Jewish violence as a way to \"strengthen the foundation of tsarist rule\" and punish what they perceived as \"treasonable behavior\" such as desecrating portraits of the tsar or forcing bystanders to pay tribute to revolutionary flags. Despite official denials, the presence of these groups raised the level of violence considerably.\nand a banner reading \"Down with Freedom,\" while commemorating attacks on \"high school students, Kikes, and intellectuals\".]]\nAntisemitism was common in the nobility and socially acceptable, and the tsar was said to make antisemitic statements, such as \"Nine-tenths of the troublemakers are Jews, the people’s whole anger turned against them. That is how the pogroms happened.\" though there was a distinction between official and unofficial participation in right-wing movements. The tsar exhibited leniency toward organizations like the Black Hundreds and encouraged \"patriots,\" often granting clemency to pogromists; he supported 1,713 petitions while only refusing 78, and 147 unknown.\nThe tsar and his ministers contributed to an attitude of antisemitism and of tolerance of, or the perception that they unofficially condoned, actions against Jews. Some ministers advocated restraint, but many supported a trend of repression over emancipation. Discriminatory legislation, e.g. the May Laws, that restricted Jews also contributed to their image as not to be trusted. While the tsar's government did not actually sponsor pogroms, they encouraged and subsidized antisemitism, increased conflict between Jews and gentiles, and worsened the conditions of Jews while blaming them for their misfortunes. Lower level officials explicitly encouraged and participated in antisemitic activities, believing they were accomplishing the tsar's wishes.\nVyacheslav von Plehve, Minister of the Interior, may have harbored antisemitic attitudes, which is the subject of debate, but certainly expressed some negative sentiments toward the Russian Jews. A diary entry from Aleksey Kuropatkin in 1903 states, \"I heard from Plehve as well as from the tsar that the Jews needed to be given a lesson, that they had become arrogant, and that they were leading the revolutionary movement.\" Prince Urusov was told by Plehve to be \"less Judeophilic.\" In 1903, Plehve received a delegation from Odessa concerned about the news of the pogrom in Kishinev. Tell the Jewish youth, your sons and your daughters, tell your entire intelligentsia, they should not think that Russia is an old, decaying and disintegrating body; young and developing Russia will overcome the revolutionary movement. The fear of the Jews is much talked about, but this is not true. The Jews are the most courageous of people. In Western Russia some 90 percent of the revolutionaries are Jews, and in Russia generally – some 40 percent. I shall not conceal from you that the revolutionary movement in Russia worries us ... but you should know that if you do not deter your youth from the revolutionary movement, we shall make your position untenable to such an extent that you will have to leave Russia, to the very last man!\nThe pogroms, while stemming from deep-rooted anti-Jewish religious hatred, also coincided with economic factors. Economic downturn at the turn of the 20th century played a part in creating the condition for the pogroms. Restricted trading, reduced industrial production, and the Russo-Japanese War resulted in high unemployment. Many workers blamed Jews for lay-offs during the economic recession. Hatred for Jews heightened when a number of Jews did not support the war with Japan. Patriotic Russians called Jews unpatriotic and disloyal.\nModern academics have theorized that the traditional explanation of Jews as scapegoats for all the problems of non-Jews does not adequately explain the extent and mechanism of the pogroms. According to this theory, Jewish economic roles as middlemen such as moneylenders, made them a form of insurance for non-Jews, and economic shocks which coincided with political turmoil, stopped that insurance and exacerbated ethnic violence. In times of economic crisis, middlemen were unable to forgive debts or extend new credit, leading to debtors being unable to repay, and damaging economic relationships due to political uncertainty. \"Middlemen minorities\" can be in a precarious position and become targets of both elites and lower-class groups in times of economic distress and instability. However, this theory does not negate the prevalence of antisemitism, blood libels, and religious and ethnic animosity that created the conditions for outbursts of violence.\nResponse of the United States\nThe pogroms increasingly angered American opinion.  The well-established German Jews in the United States, although they were not directly affected by the Russian pogroms, were well organized and convinced Washington to support the cause of Jews in Russia. Led by Oscar Straus, Jacob Schiff, Mayer Sulzberger, and Rabbi Stephen Samuel Wise, they organized protest meetings, issued publicity, and met with President Theodore Roosevelt and Secretary of State John Hay. Stuart E. Knee reports that in April, 1903, Roosevelt received 363 addresses, 107 letters and 24 petitions signed by thousands of Christians, public and church leaders alike—all calling on the Tsar to stop the persecution of Jews. Public rallies were held in scores of cities, topped off at Carnegie Hall in New York in May. The Tsar retreated a bit and fired one local official after the Kishinev pogrom, which Roosevelt had explicitly denounced. But Roosevelt was mediating the war between Russia and Japan at that time and could not publicly take sides. Therefore, Secretary Hay took the initiative in Washington. Finally, Roosevelt forwarded a petition to the Tsar, who rejected it claiming that the Jews themselves were at fault.  Roosevelt won Jewish support in his 1904 landslide reelection. The pogroms continued, as hundreds of thousands of Jews fled Russia, most heading for London or New York. With American public opinion turning against Russia, Congress officially denounced its policies in 1906. Roosevelt kept a low profile, as did his new Secretary of State Elihu Root. However, in late 1906 Roosevelt did appoint the first Jew to the cabinet, naming Oscar Straus as his Secretary of Commerce and Labor.\nOther prominent Americans who condemned Russia's actions included Cardinal James Gibbons.\nOrganization\nThe pogroms were traditionally believed to have been organized by the tsarist central government. However, that view is no longer accepted by historians due in part to work done by Hans Rogger, I. Michael Aronson and John Klier, who were unable to find the evidence for this.\nHowever, the antisemitic policy that was carried out from 1881 to 1917 made them possible. Official persecution and harassment of Jews influenced numerous antisemites to presume that their violence was legitimate. That sentiment was reinforced by the active participation of a few major and many minor officials in fomenting attacks and by the reluctance of the government to stop the pogroms and to punish those responsible for them.\nInfluence\nThe pogroms of the 1880s caused a worldwide outcry and, along with harsh laws, propelled mass Jewish emigration from Russia. Among the passed antisemitic laws were the 1882 May Laws, which prohibited Jews from moving into villages,  allegedly in an attempt to address the cause of the pogroms (when, in fact, the pogroms were caused by an entirely different reason). The majority of the Russian High Commission for the Review of Jewish Legislation (1883–1888) actually noted the fact that almost all of the pogroms had begun in the towns and attempted to abolish the laws. However, the minority of the High Commission ignored the facts and backed the laws. Two million Jews fled the Russian Empire between 1880 and 1920, with many going to the United Kingdom and United States. In response, the United Kingdom introduced the Aliens Act 1905, which introduced immigration controls for the first time, a main objective being to reduce the influx of Eastern European Jews.\nIn reaction to the pogroms and other oppressions of the Tsarist period, Jews increasingly became politically active. Jewish participation in The General Jewish Labor Bund, colloquially known as the Bund, and in the Bolshevik movements, was directly influenced by the pogroms. Similarly, the organization of Jewish self-defense leagues, which stopped the pogromists in certain areas during the second Kishinev pogrom, such as Hovevei Zion, led to a strong embrace of Zionism, especially by Russian Jews.\nCultural references\nIn 1903, Hebrew poet Hayyim Nahman Bialik wrote the poem In the City of Slaughter in response to the Kishinev pogrom.\nElie Wiesel's The Trial of God depicts Jews fleeing a pogrom and setting up a fictitious \"trial of God\" for his negligence in not assisting them against the bloodthirsty mobs. In the end, it turns out that the mysterious stranger who has argued as God's advocate is none other than Lucifer. The experience of a Russian Jew is also depicted in Elie Wiesel's The Testament.\nA pogrom is one of the central events in the musical play Fiddler on the Roof, which is adapted from Russian author Sholem Aleichem's Tevye the Dairyman stories. Aleichem writes about the pogroms in a story called \"Lekh-Lekho\". The famous Broadway musical and film Fiddler on the Roof showed the cruelty of the Russian pogroms on the Jews in the fictional Anatevka in the early 20th century.\nIn the adult animated musical drama film American Pop, set during Imperial Russia during the late 1890s, a rabbi's wife and her young son Zalmie escape to America while the rabbi is killed by the Cossacks.\nIn the animated film An American Tail, set during and after the 1880s pogroms, Fievel and his family's village is destroyed by a pogrom. (Fievel and his family are mice, and their Cossack attackers are cats.)\nThe novel The Sacrifice by Adele Wiseman also deals with a family that is displaced after a pogrom in their home country and who emigrate to Canada after losing two sons to the riot and barely surviving themselves. The loss and murder of the sons haunts the entire story.\nMark Twain gives graphic descriptions of the Russian pogroms in Reflections on Religion, Part 3, published in 1906.\nJoseph Joffo describes the early history of his mother, a Jew in the Russia of Tsar Nicholas II, in the biographical 'Anna and her Orchestra'. He describes the raids by Cossacks on Jewish quarters and the eventual retribution inflicted by Anna's father and brothers on the Cossacks who murdered and burnt homes at the behest of the tsar.\nIn Bernard Malamud's novel The Fixer, set in Tsarist Russia around 1911, a Russian-Jewish handyman, Yakov Bog, is wrongly imprisoned for a most unlikely crime.  It was later made into a film directed by John Frankenheimer with a screenplay by Dalton Trumbo.\nIsaac Babel recounts a pogrom he experienced as a child in Mykolaiv, ca. 1905, in The Story of My Dovecote. He describes another pogrom against travelers on a train in early 1918 in the short story \"The Way\".\nSee also\n* Antisemitism\n* History of Antisemitism\n* Martyrdom in Judaism\n* Religious antisemitism\n** Antisemitism in Christianity\n** Christianity and Judaism\n* Antisemitism in the Russian Empire\n** Relations between Eastern Orthodoxy and Judaism\n* Antisemitism in the Soviet Union\n* Antisemitism in Russia\n* Antisemitism in Europe\n* Antisemitism in the United States\n* British responses to the anti-Jewish pogroms in the Russian Empire\n* Emancipation of the Jews in England#Pogroms in Russia\n* History of the Jews in Russia and the Soviet Union\n* Jewish emancipation\n* Pogroms of the Russian Civil War\nReferences\nFurther reading\n* Arnold, Richard. Russian Nationalism and Ethnic Violence: Symbolic violence, lynching, pogrom, and massacre (Routledge, 2016).\n* Aronson, I. Michael. Troubled waters: Origins of the 1881 anti-Jewish pogroms in Russia (University of Pittsburgh Press, 1990).\n*Löwy, Bella. “The Russian Jews. Extermination or Emancipation?” The Jewish Quarterly Review 6, no. 3 (1894): 533–46. https://doi.org/10.2307/1450058.\n* Gerasimov, Ilya V. \"Anti-Jewish Violence. Rethinking the Pogrom in East European History.\" Ab Imperio 2012.3 (2012): 396–412. [https://muse.jhu.edu/article/491793/summary online]\n* Goldstein, Yossi. \"The impact of Russian terrorism in Kishinev on the Zionist movement and the Jewish intelligentsia.\" Terrorism and Political Violence 25.4 (2013): 587–596.\n* Grosfeld, Irena, Seyhun Orcan Sakalli, and Ekaterina Zhuravskaya. \"Middleman minorities and ethnic violence: anti-Jewish pogroms in the Russian empire.\" Review of Economic Studies 87.1 (2020): 289–342. [https://academic.oup.com/restud/article/87/1/289/5280103 online]\n* Humphrey, Caroline. \"Odessa: Pogroms in a cosmopolitan city.\" in Post-Cosmopolitan Cities: Explorations of Urban Coexistence (2012): 17–64.\n* Judge, Edward H. Easter in Kishinev: anatomy of a pogrom (NYU Press, 1995).\n* Klier, John Doyle. Russians, Jews, and the Pogroms of 1881–1882 (2014).\n* Penkower, Monty Noam. \"The Kishinev pogrom of 1903: A turning point in Jewish history.\" Modern Judaism 24.3 (2004): 187–225. [https://muse.jhu.edu/article/172771/summary online]\n* Schoenberg, Philip Ernest. \"The American Reaction to the Kishinev Pogrom of 1903.\" American Jewish Historical Quarterly 63.3 (1974): 262–283. [https://www.jstor.org/stable/23877915 online]\n* Staliūnas, Darius. \"Anti-Jewish disturbances in the north-western provinces in the early 1880s.\" East European Jewish Affairs 34.2 (2004): 119–138.\n* Weinberg, Robert. \"Workers, pogroms, and the 1905 revolution in Odessa.\" Russian Review 46.1 (1987): 53–75. [https://psi203.cankaya.edu.tr/uploads/files/Weinberg,%20Workers,%20Pogroms%20and%20Revo%20of%201905%20in%20Odessa%20(1987).pdf online]\n* Zhuravskaya, Ekaterina, Irena Grosfeld, and Seyhun Orcan Sakalli. \"Middleman Minorities and Ethnic Violence: Anti-Jewish Pogroms in the Russian Empire.\" (2018). [https://repec.cepr.org/repec/cpr/ceprdp/DP12154.pdf online]\nHistoriography\n* Budnitskii, Oleg. \"Jews, Pogroms, and the White Movement: A Historiographical Critique.\" Kritika: Explorations in Russian and Eurasian History 2.4 (2001): 1–23.\n* Dekel-Chen, Jonathan, et al., eds. Anti-Jewish violence: rethinking the pogrom in East European history (Indiana UP, 2010).\n* Karlip, Joshua M. \"Between martyrology and historiography: Elias Tcherikower and the making of a pogrom historian.\" East European Jewish Affairs 38.3 (2008): 257–280.\n* Klier, John Doyle, and Shlomo Lambroza, eds. Pogroms: Anti-Jewish Violence in Modern Russian History (2004).\n* Weinberg, Robert. \"Visualizing pogroms in Russian history.\" Jewish History (1998): 71–92. [https://www.jstor.org/stable/20101343 online]\n* Zipperstein, Steven J. Pogrom: Kishinev and the tilt of history  (Liveright, 2018). [https://books.google.com/books?id=qDwsDwAAQBAJ&dq=pogrom+russia&pg=PT4 online]\nExternal links\n* Lenin's speech: About Anti-Jewish Pogroms ([https://www.marxists.org/archive/lenin/works/1919/mar/x10.htm Text of the speech], )\n* [https://web.archive.org/web/20080303083049/http://www.berdichev.org/jewish_history_4.htm Jewish history of the Russian Federation (through the Second World War)]\n* [http://www.fordham.edu/halsall/mod/1881JC-pogroms.html Modern History Sourcebook: The Jewish Chronicle: Outrages Upon Jews in Russia, May 6, 1881]\n* [https://www.jewishvirtuallibrary.org/jsource/judaica/ejud_0002_0016_0_15895.html Jewish Virtual Library page \"Pogroms\"]\n* [https://web.archive.org/web/20070121190823/http://www.moria.farlep.net/vjodessa/en/pogroms.html History of pogroms in Odessa]\n* [http://www.2odessa.com/wiki/index.php?title=The_Pogrom_of_1905_in_Odessa:_A_Case_Study_excerpts The Pogrom of 1905 in Odessa: A Case Study]\n* [https://web.archive.org/web/20071030005858/http://www.hagshama.org.il/en/resources/view.asp?id=1421&subject=50 Kishinev pogrom history]\nhe:הסופות בנגב"
    }
  ]
}