{
  "content": [
    {
      "type": "text",
      "text": "# Pogrom Monument\n\nThe Pogrom Monument () is located on Eduard-Wallnöfer-Platz, in the centre of Innsbruck, and commemorates the November pogroms of 1938, during which the Innsbruck citizens Josef Adler, Wilhelm Bauer, Richard Berger and Richard Graubart were murdered. The memorial was erected in 1997.\nNovember pogrom in Innsbruck\nFollowing the assassination attempt on the German legal consul Ernst vom Rath in Paris, perpetrated by Herschel Grynszpan, Hitler and Reich Minister of Propaganda Joseph Goebbels met on November 9, 1938, at a comradeship evening in the Old Town Hall of Munich. Afterwards Hitler left the hall and Goebbels gave a speech in which he made public the death of von Raths. The \"spiteful, anti-Semitic speech\" culminated \"in an appeal for revenge and retaliation\". The Gauleiter and SA leaders present thereupon issued orders throughout the Third Reich to destroy Jewish shops, burn synagogues and confiscate valuables. The intervention of the police was prohibited.\nThe Tyrolean Gauleiter Franz Hofer gave the order that same night at one o'clock in the morning that \"the boiling soul of the people had to rise up against the Jews\". Two hours later the murderous actions began. The SS leaders had chosen the Innsbruck victims:\n* Josef Adler, Chief of the Federal Railways, leading exponent of the Zionist movement and member of the Culture Council\n* Wilhelm Bauer, co-owner of a factory\n* Richard Berger, co-founder of the local Zionist group in Innsbruck and chairman of the religious community\n* Richard Graubart, co-owner of the Graubart shoe store in Museumstraße\nThe use of firearms was prohibited. Adler, who suffered from a brain disease, was so badly injured by blows to the head that he subsequently died two months later. His wife also suffered a concussion. Berger was battered to death with a stone on the bank of the river Inn and then thrown into the river. Bauer was killed by the Nazis by striking him with pistols and stabbing him; afterwards they ripped the telephone cables out of the wall and blocked off the entrance door from the outside so that his wife could not get any help. Graubart was murdered by being stabbed in the back with a dagger.\n19 other Jews were injured, Jewish homes and businesses were looted and destroyed. The Innsbruck synagogue in Sillgasse was also vandalised.\nOrigin of the monument\nDuring the Landtag der Jugend on 17 November 1995, young people proposed the erection of a memorial to the victims of the pogrom night in November 1938 in the centre of Innsbruck. Mayor Herwig van Staa accepted the proposal of the project group (Herwig Ostermann, Walter Fuchs, Daniel Knabl, Mirjam Dauber and Sibylle Hammer) the following month and Provincial Councillor Elisabeth Zanon then issued and Invitation to Tender for the project ... not to forget. Pupils from Tyrol's secondary schools were invited to participate and in the summer of 1996 a jury of experts evaluated the 48 competition entries. The jury chose a design by student Mario Jörg from the Secondary Technical School for Mechanical Engineering in Fulpmes, where the monument was also made.\nThe Eduard-Wallnöfer-Platz (formerly Landhausplatz) was chosen as the location, where the New Landhaus, the Liberation Monument erected in 1948 and also the new Unification Fountain are located.\nThe design by Mario Jörg consists of a solid copper base on which the names of the victims can be read, and a seven-metre-high menorah. According to Mario Jörg, the use of shards of glass for the names intends to \"symbolize the broken hearts of the murdered Jews and their relatives\".\nAccompanying texts\nThe following words are engraved on the metal perimeter of the monument:\nUnveiling\nSince 8 June 1997 the pogrom monument has been open to the public. Chief Rabbi Paul Chaim Eisenberg said prayers in Hebrew and German. Diocesan Bishop Reinhold Stecher compared the memorial \"to a sundial that casts its shadow on people's conscience\". The Israeli ambassador, Yoel Sher, spoke about \"the sacred duty of remembering the victims of the Holocaust\". Oscar Klein, a jazz musician from a Jewish family in Innsbruck, provided the musical framework for the ceremony. The province of Tyrol had invited displaced Jews, Holocaust survivors and their relatives. Also present were Paul Grosz and Esther Fritsch, the Presidents of the Jewish Community of Austria and Tyrol-Vorarlberg respectively.\nAs part of the redesign of the Landhausplatz, the memorial was moved slightly and repositioned in January 2011. Since March 2012 a website on the Eduard-Wallnöfer-Platz has provided detailed descriptions of the monuments on this square.\nResponse\nIn Innsbruck there was no major controversy about the erection of the monument. The daily Der Standard attributed this to the fact that the initiative had come from young people. The simple symbolism of the monument was also well received by the public.\nThe Kronen Zeitung feared an \"influx of memorials\" on the Eduard-Wallnöfer-Platz and asked \"what is the occasion, where is the necessity, what are the real reasons\" for the memorial. Another subject of criticism was the construction costs for the \"6-ton monster\".\nThe Jewish Religious Community was only involved in the planning at a later stage. Contemporary historians at the University of Innsbruck criticized the limitation to the four victims of the November pogrom, as at that time more than 160 Jewish victims of the Nazi regime from Tyrol had already been identified during the entire period of Nazi rule. There was also criticism that Tyrolean politicians had refused to finance a factual and explanatory brochure for schoolchildren.\nReferences"
    }
  ]
}