{
  "content": [
    {
      "type": "text",
      "text": "# Polish–Ottoman War (1485–1503)\n\n1890)\n| partof            =\n| date              = 1485–1503\n| place             = Wild Fields, Moldavia, south of Poland, Grand Duchy of Lithuania\n| result            = Moldavian-Ottoman victory\n| combatant1        = Ottoman EmpireCrimean KhanateMoldavia\n| combatant2        = Kingdom of PolandDuchy of MasoviaTeutonic OrderGrand Duchy of Lithuania\n| commander1        = Bayezid IIMeñli I GirayStephen the Great\n| commander2        = Casimir IV Jagiellon John I Albert  Johann von Tiefen  Semyon Olshanski\n| strength1         =\n| strength2         =\n| casualties1       =\n| casualties2       =\n| campaignbox       =\n|\n| territory         = Moldavia gets Pokuttia\n}}\nThe Polish–Turkish War of 1485–1503 was a prolonged conflict, rather a series of conflicts, between the Kingdom of Poland and the Ottoman Empire. The conflict formally lasted eighteen years, but during this time hostilities were ceased on several occasions due to temporary treaties being signed between the warring parties.\nIn the war the Kingdom of Poland was supported by its fiefs, the Duchy of Mazovia and the State of the Teutonic Order, as well as the Grand Duchy of Lithuania. The Ottoman Empire on the other hand, was allied with the Crimean Khanate and by the Principality of Moldavia during the Moldavian Campaign of 1497–1499.\nFor most of the 15th century, Moldavia was a vassal of Poland, but other states, notably the Kingdom of Hungary, the Ottoman Empire and the Crimean Khanate, meanwhile tried to subdue Moldavia. After the Fall of Constantinople (1453), the Ottomans directed their expansion northwards towards the lower Danube and behind the mighty river and also threatened Poland.\nOutbreak of war\nIn 1485, the Ottomans captured the Moldavian Black Sea ports Akkerman and Kilia. That undermined Polish eastern trade. The king promised help and called the pospolite ruszenie, the royal army and mercenaries. In November 1485, the Poles commanded by Jan Karnkowski, entered Moldavia and defeated Tatar forces. John Albert himself prepared an anti-Ottoman raid in 1487 but had to change the plans and sent his forces to fight Tatars, allied with the Ottomans. On September 8, 1487, the Battle of Kopystrzyn in Podolia took place in which the Tatars were defeated.\nOn March 23, 1489, a two-year truce was signed between Poland and Ottoman Sultan Bayezid II. In it, Casimir IV recognized the Ottomans' possession of Kilia and Akkerman, a violation of his suzerainty over Moldovia, which led Stephen III of Moldovia to renounce Poland and seek Ottoman suzerainty. On January 25, 1491 the Battle of Zasław in Volhynia took place, in which Polish forces destroyed a Tatar raid.\nIn 1494, King John began military preparations for a new raid, despite a three-year truce that was signed on April 6 of that year. Stephen III refused to join the Polish effort, fearing that Moldavia would become the battleground between the Ottomans and Poles. Instead, he sought Ottoman assurance of support if the Poles invaded Moldavia. It took Poland three years to complete their preparations. Its army was made of Polish Crown forces, aided by a number of foreign mercenaries, 400 Teutonic Knights under Grand Master Johann von Tieffen and a 600-strong unit from Mazovia. Altogether, the Polish Army was some 40,000 strong, with 200 cannons.\nFearful of an alliance between Moldavia, Muscovy and the Ottomans, the Poles sought to make a pre-emptive strike to capture Moldavia; the Lesser Poland nobles, especially the Polish Ruthenians, in particular demanded war to eliminate the Tatar raiding threat and to seize access to the eastern trade. Polish units of the pospolite ruszenie gathered in May to June 1497 in Podolia, and in early August, the army crossed the Dniestr River and entered Moldavia.\nOn 1497, Poland began its Moldavian Campaign of 1497–1499. On September 24, the Poles began the siege of Suceava, which was a failure, and on October 19, they began to retreat. A week later, on October 26, the Poles were defeated in the Battle of the Cosmin Forest. The campaign ended in 1499 in a Moldovian victory.\nThe Polish raid provoked Ottomans and Tatars, with the aid of Stephen of Moldavia, to invade the southeastern corner of Poland. This took place in spring 1498: after crossing the Dniestr, the invaders ransacked Red Ruthenia, capturing as much as a hundred thousand people and reaching as far as Przeworsk. In the summer of that year, the Tatars again invaded Poland, mainly Podolia and Volhynia.\nAfter the battle of the Cosmin Forest, John I Albert hastily returned to Poland (suffering another major defeat on the way where 5,000 Polish soldiers were killed in Bukovina) and built the Kraków Barbican, fearing an attack by the Ottoman Empire after his successive defeats. The walls of Kraków were strengthened and additional fortifications were built to defend the city in case of a Turkish invasion.\nTruce\nOn July 13, 1498, John Albert signed a treaty with the Kingdom of Hungary in which both sides agreed to co-operate against the Ottomans. On August 15, 1499, Stephen III accepted the truce, and on October 9, 1503, King Alexander I Jagiellon signed a five-year peace treaty with Sultan Bayezid II.\nSee also\n* Polish–Ottoman Wars\nReferences\nSources\n* Roman Grodecki, Stanislaw Zachorowski, Jan Dabrowski, Dzieje Polski Sredniowiecznej, t. 2, Kraków 1995.\n* Henryk Lowmianski, Polityka Jagiellonów, Poznan 2006.\n*"
    }
  ]
}