{
  "content": [
    {
      "type": "text",
      "text": "# Politics of the Czech Republic__disambig_1\n\n| upperhouse              = Senate\n| upperhouse_speaker      = Miloš Vystrčil\n| upperhouse_speaker_title= President of the Senate\n| upperhouse_appointer    =\n| lowerhouse              = Chamber of Deputies\n| lowerhouse_speaker      = Markéta Pekarová Adamová\n| lowerhouse_speaker_title= President of the Chamber of Deputies\n| lowerhouse_appointer    =\n| title_hos               = President\n| current_hos             = Petr Pavel\n| appointer_hos           = Direct popular vote, two-round system\n| title_hog               = Prime Minister\n| current_hog             = Petr Fiala\n| appointer_hog           = Chamber of Deputies\n| cabinet                 = Cabinet of the Czech Republic\n| current_cabinet         = Cabinet of Petr Fiala\n| cabinet_leader          = Prime Minister\n| cabinet_deputyleader    =\n| cabinet_appointer       =\n| cabinet_hq              = Straka Academy, Prague\n| cabinet_ministries      = Ministerial departments\n| judiciary               = Judiciary\n| law                     = Law of the Czech Republic\n| court                   = Constitutional Court\n| court_seat              = Joštova 625, Brno\n| court1                  = Supreme Court\n| court_seat1             = Burešova 20, Brno\n| court2                  = Supreme Administrative Court\n| court_seat2             = Moravské náměstí 6, Brno\n}}\nThe Czech Republic is a unitary parliamentary republic, in which the president is the head of state and the prime minister is the head of government. Executive power is exercised by the Government of the Czech Republic, which reports to the Chamber of Deputies. The legislature is exercised by the Parliament. The Czech Parliament is bicameral: the upper house of the Parliament is the Senate, and the lower house is the Chamber of Deputies. The Senate consists of 81 members who are elected for six years. The Chamber of Deputies consists of 200 members who are elected for four years. The judiciary system is topped by the trio of the Constitutional Court, Supreme Court and Supreme Administrative Court.\nThe highest legal document is the Constitution of the Czech Republic, complemented by constitutional laws and the Charter of Fundamental Rights and Freedoms. The current constitution went in effect on 1 January 1993, after the dissolution of Czechoslovakia.\nThe Czech Republic has a multi-party system. Between 1993 and 2013, the two largest political parties were the centre-left Czech Social Democratic Party (ČSSD) and centre-right Civic Democratic Party (ODS). This changed in early 2014, with the rise of a new major political party ANO 2011, which has since led two cabinets.\nAccording to the V-Dem Democracy indices the Czech Republic was 2023 the 16th most electoral democratic country in the world.\nExecutive branch\nThe president is the head of state, and the prime minister is the head of government. The majority of executive power is given to the Cabinet, which consists of the prime minister, deputy prime ministers and ministers (usually heads of the ministries).\n|President\n|Petr Pavel\n|Independent\n|9 March 2023\n|-\n|Prime Minister\n|Petr Fiala\n|Civic Democratic Party\n|28 November 2021\n|}\nPresident\nThe president of the Czech Republic is elected by a direct vote for five years. They can only serve for two terms. The president is a formal head of state with limited executive powers specified in the articles 54 to 66 of the Constitution:\n* to appoint or dismiss the prime minister and other members of the Cabinet\n* to appoint or dismiss the entire Cabinet\n* to confirm or decline a resignation of the prime minister and other members of the Cabinet\n* to summon a session of the Chamber of Deputies\n* to dissolve the Chamber of Deputies when specific conditions described in the Constitution are met\n* to pardon and mitigate penalties imposed by the court, order not to initiate criminal proceedings, suspend them if they are already initiated and to wipe previous criminal records\n* to declare the date of elections to the Chamber of Deputies and the Senate\n* to bestow state honors\n* to appoint and promote generals\n* to appoint judges\n* to appoint the president and vice-president of the Supreme Audit Office\n* to appoint members of the Board of the Czech National Bank\n* to appoint or dismiss heads of diplomatic missions\nThe president is also the commander in chief of the Armed Forces and ratifies all domestic laws and international agreements.\nCabinet\n, the seat of the Cabinet, Prague]]\n, the seat of the Senate, Prague]]\nThe Cabinet is the supreme executive body in the Czech Republic. It makes its decisions as a body. It is held responsible by the Chamber of Deputies. The president appoints every new prime minister, who then chooses the ministers. All ministers of the Cabinet need to be approved by the president and within thirty days after the presidential approval they must ask the Chamber of Deputies for a vote of confidence.\nPrime minister\nThe prime minister is the head of government. The prime minister organizes the work of the Cabinet, presides over it and acts in its name. The prime minister sets the agenda for most foreign and domestic policies but has to obtain the president's approval to hire or dismiss any other member of the Cabinet.\nMinisters\nMinisters are any member of the Cabinet who are not the prime minister. They are usually the head of a ministry, but this is not required. A ministry – sometimes called government department – is a governmental organisation that manages a specific sector of public administration. The number of ministries varies depending on the particular Cabinet and is managed by the Competence Law. As of 2021, the Czech Republic had 13 ministers and 14 ministries.\nLegislative branch\nThun Palace, the seat of the Chamber of Deputies, [[Prague]]The Parliament (Parlament in Czech) consists of two houses. The lower house is the Chamber of Deputies, and the upper house is the Senate.\n|President of the Chamber of Deputies\n|Markéta Pekarová Adamová\n|TOP 09\n|10 November 2021\n|-\n|President of the Senate\n|Miloš Vystrčil\n|Civic Democratic Party\n|19 February 2020\n|}\nChamber of Deputies\nThe Chamber of Deputies ( in Czech) has 200 members, elected for four-year terms by proportional representation with a 5% election threshold. The Chamber of Deputies elections happen every four years, unless the reigning Cabinet prematurely loses the Chamber of Deputies' support. Candidates for every political party participating in the elections are split among 14 electoral districts, which are identical to the country's administrative regions. A citizen must be at least 21 years old to be eligible for candidacy.\nThe Chamber of Deputies was formerly known as the Czech National Council. It has the same powers and responsibilities as the now-defunct Federal Assembly of the Czechoslovakia.\nSenate\nThe Senate (Senát in Czech) has 81 members, each elected for a six-year term. Senate elections happen every two years and only a third of the seats is contested each time. All of the 81 Senate electoral districts are designed to contain roughly the same number of voters. The Senate elections use a two-round system, when the two most successful candidates from the first round face each other again in the second round usually a week later. Only citizens who have reached the age of 40 are eligible for candidacy. The senate's function is to be a stabilizing force and its influence is significantly lower than that of the Chamber of Deputies.\nJudicial branch\nThe Czech court system recognizes four categories of courts and the Constitutional Court, which stands outside of the court system.\nConstitutional Court\nThe Constitutional Court's main purpose is to protect people's constitutional rights and freedoms. The decisions of the court are final, cannot be overturned and are considered a source of law. The court is composed of 15 justices who are named for a renewable period of 10 years by the president and approved by the Senate. Its functionality is similar to that of the Supreme Court of the United States.\nSupreme courts\nThere are two supreme courts in the court system of the Czech Republic – the Supreme Court and the Supreme Administrative Court. Both reside in Brno.\nSimplified chart of the Czech political system\nSupreme Court\nThe Supreme Court of the Czech Republic  is the court of highest appeal for almost all legal cases heard in the Czech Republic. The justices of the Supreme Court analyze and evaluate legally effective decisions of lower courts. They unify the Czech judicature.\nSupreme Administrative Court\nThe Supreme Administrative Court of the Czech Republic protects people from unlawful decisions and procedures of the state authorities. It examines objections to elections and has the authority to ban or suspend the activity of political parties. It resolves competence disputes between governmental organizations and also serves as disciplinary court for other members of the judiciary.\nHigh courts\nThere are two high courts in the Czech Republic – one in Prague and one in Olomouc . They serve as courts of appeal to Regional Courts in cases, where the Regional Court acted as a court of first instance. Presidents of the high courts are appointed by the president for seven years. The vice-presidents are appointed by the minister of justice and also serve a seven-year term. A justice is required by the law to have at least eight years of experience before becoming a member of a High Court.\nRegional courts\nRegional courts serve mainly as the courts of appeal to district courts and also as the only instance of administrative courts besides the Supreme Administrative Court. However, they can also act as courts of first instance in cases of more severe criminal charges, disputes between corporations or disputes over intellectual property. There are eight regional courts in the Czech Republic: in Brno, Ostrava, Hradec Králové, Ústí nad Labem, Plzeň, České Budějovice and two in Prague.\nDistrict courts\nDistrict courts serve as the courts of first instance in almost all civil or criminal proceedings. There is a total of 86 district courts in the Czech Republic. Notaries and executors are appointed by the minister of justice to their jurisdictions.\nRegional government\nThe Czech Republic is divided in 14 administrative regions, including one for the capital of Prague. The older system of 73 administrative districts (okresy in Czech) and 4 municipalities was abandoned in 1999 in an administrative reform. Each of the regions has a regional council with a varied number of regional councilors and a president of the regional cabinet (hejtman in Czech) as its formal head. The capital of Prague is the only exception to this, as the City Council acts both as regional and municipal governing body and is led by a mayor. Regional councilors are elected for four-year terms similarly to deputies in the Chamber of Deputies. All adults eligible to vote are also eligible to be a candidate to a regional council.\nComposition of the Senate\nFor the current composition of the Chamber of Deputies of the Czech Republic, see List of MPs elected in the 2017 Czech legislative election.\nRecent political developments\nFrom 1991, the Czech Republic, originally as part of Czechoslovakia and since 1993 in its own right, has been a member of the Visegrád Group and from 1995, the OECD. The Czech Republic joined NATO on 12 March 1999 and the European Union on 1 May 2004. On 21 December 2007 the Czech Republic joined the Schengen Area.\nUntil 2017, either the Czech Social Democratic Party or the Civic Democratic Party led the governments of the Czech Republic. In October 2017, populist movement ANO 2011, led by the country's second-richest man, Andrej Babiš, won the elections with three times more votes than its closest rival, the centre-right Civic Democrats. In December 2017, Czech President Miloš Zeman appointed Andrej Babiš as the new prime minister.\nOn 28 November 2021, Czech President Miloš Zeman appointed opposition leader Petr Fiala as the country's new prime minister.  The centre-right coalition Spolu (meaning Together) won tightly contested legislative elections in October 2021 against Prime Minister Andrej Babiš and his right-wing populist ANO party.  Babiš  had sought re-election after four years in power. In January 2023, Former NATO general Petr Pavel won the election runoff over Andrej Babiš to succeed Miloš Zeman as the fourth president of the Czech Republic.\nSee also\n*Government of the Czech Republic\n*Ministry of Finance (Czech Republic)\nReferences\nExternal links\n* [https://web.archive.org/web/20081220003426/http://www.hrad.cz/en/ustava_cr/index.shtml Constitution of the Czech Republic]\n* [http://www.volby.cz/ Website with results of all elections in Czech and English]\n* [https://web.archive.org/web/20060526083516/http://www.rzb.at/eBusiness/services/resources/lnz_resource_rzb_static/0,7130,1023296711504-1025308884300_1025311539513_1025311893931-65903287614859521-1-NA-NA,00.pdf RZB Group: Czech Republic – Election 2006 Special]\n* [https://web.archive.org/web/20060718023209/http://www.praguemonitor.com/czech-election-2006/ Czech 2006 Election blog by the Prague Daily Monitor]\n* [https://web.archive.org/web/20060702103322/http://www.ku.edu/%7Eherron/ Erik Herron's Guide to Politics of East Central Europe and Eurasia]\nGovernment\n* [http://www.vlada.cz/en/ Official governmental website] English\n* [http://www.hrad.cz/en/ Official presidential website] English\n* [http://www.senat.cz/index-eng.php Official Senate website] English\n* [https://web.archive.org/web/20120812061745/http://portal.gov.cz/portal/obcan/ Portal of the Public Administration] Czech\n* [https://web.archive.org/web/20081210080250/https://www.cia.gov/library/publications/world-leaders-1/world-leaders-c/czech-republic.html Chief of State and Cabinet Members] CIA library on World leaders"
    }
  ]
}