{
  "content": [
    {
      "type": "text",
      "text": "# Politechnika Warszawska PW-5\n\nThe 'Politechnika Warszawska PW-5 Smyk' (Polish: \"Little rascal\") is a single seater sailplane designed at the Warsaw University of Technology (Polish: \"Politechnika Warszawska\") and manufactured in Poland. It is a monotype World Class glider.\nDevelopment\nThe PW-5 was designed for, and won a competition held by the International Gliding Commission for a simple, low cost sailplane that would form the basis for a new competition class, the IGC World Class. Unlike other soaring competition classes, the World Class designation would guarantee that all pilots participated on an equal footing, and that pilots could not gain advantage by spending large amounts of money. The PW-5 was unanimously chosen from 42 design proposals in IGC international World Class design competition. In November 1989, the IGC issued a worldwide call for proposals. By February 1990, it had received 84 requests for design specifications from 25 countries. By August 1990, the IGC had received 42 design proposals from 20 countries. In September 1990, after reviewing the proposals, many of which came with models, the IGC recommended that 11 designs from 9 countries proceed to the prototype competition. In October 1992, the IGC inspected and tested 6 prototypes from 5 countries at Oerlinghausen Germany. After further review and collecting manufacturing data, in spring 1993 the IGC declared the PW-5, designed by a faculty/student team at Warsaw University of Technology, the first World Class glider.\nThe glider was designed at the Faculty of Power and Aeronautical Engineering of the Warsaw University of Technology under the supervision of Roman Świtkiewicz. It was originally built by PZL at its factory in Świdnik and first flew in 1993. By the end of 2000 the new private company PZL-Bielsko1 was established by the original members of the design team from Warsaw University of Technology and the DWLKK company. A new factory at Bielsko produced a modified version of PW-5 glider called B1-PW-5.\nBecause its cost was comparable to the cost of the older Club class gliders of higher performance it did not sell as well as expected and the World class competitions were not very popular as well. In total fewer than 200 PW-5s have been built, though over 70 have been exported to the United States, where there is a keen following.\nDesign\n*The structure is all glass-epoxy composite\n*The wings are of trapeze contour with bow-shaped ends, shoulder-set on the fuselage, having a monospar structure with sandwich shells\n*Schempp-Hirth-type air brakes extend on the upper wing surface only\n*Fuselage shell of glass-epoxy composite monocoque structure, stiffened with frames\n*Fabric covered rudder\n*Fixed undercarriage consisting of main wheel behind the pilot, with shock absorber and drum brake, a smaller front wheel and a tail skid with a diminutive wheel to prevent scraping on the ground if overrotation takes place\n*Two tow releases, for aerotowing and winch-launching respectively\nVariants\nThere are presently two versions of the PW-5. The Bielsko version, identified as B1 PW-5, has a few safety- and performance-related improvements:\n*Automatic hook-up of all controls upon assembly\n*Tow release for winch-launching moved forward; this follows a winching accident in New Zealand\n*Ballast holder in the tail to allow centre of gravity corrections\n*Total energy probe on the vertical empennage\nThere is a project in progress for building a motorglider designated PW-5M based on the PW-5.\nThe PW-5 has a two-seater derivative, the PW-6.\nSpecifications\nReferences\nCitations\nBibliography\n* [https://web.archive.org/web/20030411082219/http://www.ssa.org/Johnson/85-1997-04.pdf Johnson R, An FTE of the PW-5 World Class Sailplane, Soaring, April 1997]\n* Carswell D, The Low Time Pilot in the PW-5 World Class Sailplane, Soaring, April 1997\n* Thomas F, Fundamentals of Sailplane Design, College Park Press, 1999\n* Simons M, Segelflugzeuge 1965–2000, Eqip, 2004\nExternal links\n* [https://www.youtube.com/watch?v=Jr8UK7Iq-ik video of PW5 wave soaring]"
    }
  ]
}