{
  "content": [
    {
      "type": "text",
      "text": "# Political systems of the Asante Empire\n\nThe  political organization of the historical Asante Empire was characterized by stools which denoted \"offices\" that were associated with a particular authority. The Golden Stool was the most powerful of all, because it was the office of the King of the Asante Empire. Scholars such as Jan Vansina have described the governance of the Asante Empire as a federation where state affairs were regulated by a council of elders headed by the king, who was simply primus inter pares.\nStructure and organization\nIn all, the Asante state was a centralized state made up of a hierarchy of heads starting from the \"Abusua Panyin\" who was head of a family or lineage. The family was the basic political unit in the empire. The family or lineage followed the village organization which was headed by the Odikro. All villages were then grouped together to form divisions headed by a divisional head called Ohene. The various divisions were politically grouped to form a state which was headed by an Omanhene or Amanhene. Finally, all Asante states formed the Asante Empire with the Asantehene as their king. The Seventy-Seven Laws of Komfo Anokye, drafted by Okomfo Anokye, served as the codified constitution of the Asante Empire.\nThe Golden Stool\nThe Golden Stool was the most powerful of all stools or \"offices\" in the Asante Empire. It was occupied by the Asantehene (King). According to Asante oral tradition, the Golden Stool first appeared near the end of the 17th century. It became the spiritual centre of the Empire after King Osei Tutu unified the Asante city-states into one empire. According to oral tradition, Okomfo Anokye, the chief priest and adviser of Osei Tutu, brought down the stool from the sky to the earth. He demanded that all chiefs of the Asante city-state surrender their stools and recognize the supremacy of the Golden Stool.\nAsantemanhyiamu/Kotoko council\nThe  was a council made up of the Amanhene, Kumasi chiefs and provincial rulers which met once a year. The Asantemanhyiamu translates as a \"Great Council\"  or \"National Assembly\". Some scholars have suggested that the Asantemanhyiamu and the Kotoko council were the same or a similar institution. The Asantemanhyiamu served as the judicial and legislative body of the state.\nInner/Kumasi council\nAs a result of the tedious work faced by the Asantemanhyiamu, another council headed by the king, known as the Inner or Kumasi council was formed in the eighteenth century. This Inner council gradually assumed the administrative duties of the Asantemanhyiamu in the nineteenth century. This led to the emergence of conflict between the Asantemanhyiamu and the Inner council. Edgerton refers to the Inner council as the Kotoko council instead whiles Wilks writes that the Inner council eventually evolved to be known as the Kumasi council by the 19th century The Inner/Kumasi council met everyday in the 19th century sometimes with meetings held until late night under torchlight. The council served as a court of law, justice and legislation. The council also held its meetings at the Pramakeseso.\nPolitical factions\nDuring the nineteenth century, there existed two factions that dominated the political scene of Asante which are referred to as the Peace party and Imperial/War party by modern historians. Vandervort comments that the Peace party advocated for mercantile policies, free enterprise and it undervalued the importance of military. The Imperial or War party, according to Vandervort, emphasized on state monopoly of trade as well as the support of a strong military force to preserve the empire and intimidate Asante neighbors. Throughout the first half of the 19th century, the Peace Party dominated Asante politics. During this period there emerged a phase termed to be similar to a capitalist revolution by Vandervort, which saw the growth in trade of kola nuts, gold, palm oil and strengthened the position of merchants who made up the Peace party. The Imperial party surpassed the Peace party as the major influence in Asante politics starting in the 1870s following the dip in relations with the British Empire.\nMpanyimfo\nThe Mpanyimfo in Asante was an assembly of the oldest members of a particular territory, who represented the inhabitants and acted as advisors to the chief in administrative matters.\nExecutive\nAsantehene\n, Germany]]\nThe Asante Empire was made up of a number of states grouped together and headed by a monarch. The Asantehene was regarded as primus inter pares. Thus, he was the highest form of authority in the empire and he held more power than the paramount chiefs known as the Amanhene, who were leaders of Asante states such as Mampong, Kokufu, Ejisu, Juaben and Bekwai. But the Asantehene did not enjoy absolute royal rule; several checks curbed any abuse of power. All Asante authorities including the Asantehene, pledged allegiance to the Golden stool. The Asantehene was the chief judge, chief administrator and commander-in-chief of the Asante army.\nAmanhene\nThe Asante Empire was made up of metropolitan and provincial states. The metropolitan states were made up of Asante citizens known as amanfo. The provincial states were other kingdoms absorbed into the empire. Every metropolitan Asante state was headed by the Amanhene or paramount chief. Each of these paramount chiefs served as principal rulers of their own states, where they exerted executive, legislative and judicial powers.\nOhene\nThe Ohene were divisional chiefs under the Amanhene. Their major function was to advise the Amanhene. The divisional chiefs were the highest order in various Asante state divisions. The divisions were made up of various villages put together. Examples of divisional chiefs included Krontihene, Nifahene, Benkumhene, Adontenhene and Kyidomhene.\nOdikuro\nEach village in Asante had a chief called Odikro who was the owner of the village. The Odikro was responsible for the maintenance of law and order. He also served as a medium between the people of his jurisdiction, the ancestor and the gods. As the head of the village, the Odikro presided over the village council.\nQueen\nled her state, Ejisu, in the War of the Golden Stool against the British.]]\nThe queen or Ohenemaa was an important figure in Asante political systems. She was the most powerful female in the Empire. She had the prerogative of being consulted in the process of installing a chief or the king, as she played a major role in the nomination and selection. She settled disputes involving women and was involved in decision-making alongside the Council of elders and chiefs. Not only did she participate in the judicial and legislative processes, but also in the making and unmaking of war, and the distribution of land.\nOsei Kwadwo reforms\nThe offices of government and public administration in Asante were completely reorganized during the reign of Asantehene Osei Kwadwo (r. 1764–1777) in a major administrative reform. He began a meritocratic system of appointing central officials according to their ability, rather than their birth. A group classification emerged in Asante politics.\nAdehyedwa stools\nThe Adehyedwa stools were offices originally independent of the king, that is, they were either pre-Asante stools that had been incorporated into the Asante administration system after the establishment of the kingdom, or they were non-Asante stools that\ntook over into the Asante administrative system due to special fidelity and loyalty. The succession in office was mostly regulated by maternal law with the exception of the Asafo stool in Kumasi. Matriclan succession meant that the successor for the office of an Adehyedwa chair was determined through the election of a noble who was suitable for the office within the maternal consanguinity.\nPoduodwa stools\nThe Poduodwa stools were offices created by the king and inherited by a certain lineage. This included the Bantama stool in Kumasi (Bantamahene or Bantahene). Bantama was the location of the mausoleum of the royal family. The bantahene was the chief, authority over the mausoleum however was traditionally exercised by the Asante Krontihene (Minister of Defence).\nEsomdwa stools (including the Mmammadwa stools)\nThe Esomdwa stools were offices of public administration (\"Esom\") that do not form part of the Adehyewa and Poduodwa stools. Among them were the Mmammadwa stools whose succession was organized via the \"Fekuw\" system. The Fekuw system was a kinship relationships that arose from the paternal blood line. However, the king had the right to intervene in the succession and to appoint a successor himself.\nAll office holders of a stool of the three categories mentioned had to swear allegiance to the king. These \"stools\" (offices) were subordinate to the highest of all stools, the golden stool, occupied by the Asantehene. They were therefore strictly separated from the group of Abusuadwa stools, which were not subject to the Golden stool.\nThe chiefs of the regional and supraregional public administration had the Ahenfie which served as the local palace police, at their disposal to exercise the state executive power.\nAbusuadwa stools\nThe Abusuadwa stools were all offices within a family clan (defined by the maternal blood line), which did not fulfill any public function and whose function, occupation and succession are solely the matter of their respective matrilineal Abusua.\nAn example is the Oyokohene, head of the Oyoko clan.\nWith the Kwadwo's administrative reform, among other things, the Asokwafo, previously a troop of royal hornblowers, was transformed into a kind of \"personnel pool\" for the education and training of future government officials. The king then recruited his officials from the Asokwafo community for a wide variety of administrative tasks. The head of the Asokwafo was the Batahene, who was also responsible for the management of the state trade organizations in Asante. The post of Okyeame (spokesman for the king), newly created under Kwadwo, was for example, filled with people from the Asokwafo circle. Likewise, the liaison men to the Europeans during Osai Bonsu's reign had previously been members of the Asokwafo.\nFinancial administration\nThe  was the head of the national treasurer's office at the court of the Asantehene. He was responsible for the implementation of a general financial budget and expenditure control of the Asante Empire. In addition, the Gyaasehene presided over the tax court. Subordinate to him were the Sanaahene, who was responsible for the routine administration of the Adaka Kesie, that is, through which all payments with gold dust from the royal treasury were processed. Every sub Asante chief possessed their own local treasury which was managed by a Sanaahene. Subordinate to the Sanaahene (and thus also to the Gyaasehene) was the , who was head of the cashiers and weighers. The national treasury contained separate offices for the mint () and the handling of monies (). According to Wilks, over a hundred workforce known as , was employed by the mint in reducing ingots and nuggets to gold dust. The Buramfo workforce was headed by the  who presided over the guild of goldsmiths. The arm responsible for revenue collection was the . Members of this institution travelled to the villages, towns and cities of the empire to collect taxes, tributes and tolls.\nMilitary administration\nAmong the Akan of the Gold Coast, Krontihene (or Kontihene) is the title of \"leader of the warriors\", who was sometimes also referred to as Sahene (war leader). He embodied the Minister of War of the Asante Empire and the Commander-in-Chief of the Asante Army in the absence of the King. Edgerton relates the process to justify war in Asante with that of the United States Congress. Although the Asantehene was commander in chief of the army, the decision to go to war fell to the function of the National Assembly and Inner Council.\nBureaucracy\nWilks states that the empire was bureaucratic as early as the 18th century due to reforms by the Asante kings. The Asante king appointed officers based on merit and assigned specific duties in the administration. All chiefs had the authority to appoint and dismiss staff. They also had the power to create a new office or abolish old ones.\nDiplomacy\nleads a diplomatic mission to Kumasi in 1820]]\nHistorian Adjaye identifies three types of professional Ambassadors in Asante. He lists the Ambassador-at-large, roving ambassadors and resident ambassadors. Roving ambassadors like Oheneba Owusu Dome, traveled from place to place for political purposes. In addition, there were temporal or Ad hoc ambassadors whose appointment came to an end following the conclusion of their missions. Training was mainly obtained through apprenticeship as young men observed the professionals in court for experience. Qualification was based on merit. Diplomatic missions were carried out mainly through oral or unwritten means. Despite the Asante being pre-literate, the Asante chancery did employ writing to an extent from the nineteenth century, as a solution to the weakness of oral diplomatic communication. Literate members of the chancery were educated by the British for instance. Adjaye estimates that Asante's diplomatic documents \"could have exceeded several thousands\" based on the remains of Asante letters found today in archival centers in Ghana, the United Kingdom, the Hague, Denmark, and Switzerland.\nThe Asante chancery was made up of four district bureaus. They included the Dutch bureau which was responsible for maintaining relations with the Dutch, the Danish bureau responsible for Danish and southeastern Gold Coast affairs, the Arabic bureau which directed communication with Muslim states in Northern Ghana and the English bureau which was in charge of Asante affairs with the British and Fante on the coast. Foreign envoys particularly from the coast were stopped at the southern borders of Asante until the Asantehene was prepared to receive them. This period of waiting could last from a day or two or even several weeks. After being allowed into Asante, the envoy had to wait until a date was fixed for his reception in the capital. When the foreign envoy was allowed into Kumasi, they were welcomed with large ceremonies. Throughout their stay in Kumasi, the envoys were provided with free accommodation as well as allowances on food and drink from the Asante government.\nOkyeame (Linguist)\nFrom Eisendstadt's work, the  is defined as the chief linguist who performed roles similar to that of a prime minister. Each town, district or region of Asante had an okyeame as a representative in the council. Adjaye also states that the collectively, the  (plural) performed both bureaucratic and judicial functions.The head of all Akyeame was the  who served as a Minister of Foreign Affairs and Chief of protocol.\nOther personnel\nThe  were a corps of envoys who served the Asantehene and all principal chiefs. By the 19th century, members of the Nhenkwaa were involved in the diplomatic structure of Asante. Unlike the Okyeame who was employed on embassies to more distant towns and foreign states, the Nhenkwaa were mostly sent on missions around Metropolitan Asante. The  grew to prominence starting from the early 19th century when they were employed as officials to dispatch messages between Asante and foreign governments. Besides their major function as transmitters of messages, the Afenasoafo engaged in the negotiation process for peace making or returning fugitives. They also provided the diplomatic channel of communication between foreign envoys and the Asantehene. The , which translates as criers or heralds, enforced law and order at the meetings of the Asantemanhyiamu and whenever the Asantehene sat in session. The Nseniefo publicized all new decrees and regulations throughout the empire. For instance, after the ratification of the Bowdich Treaty of 1817, the Nseniefo traveled to all the principal towns and villages where they assembled the people through the use of gongs for the announcement on the status of the treaty.\nElections and Impeachment\nElections\nDuring the period between the death of an Asantehene and the election of a successor, the Manponhene, the Asantehene's deputy, acted as a regent. This policy was only changed during a time of civil war in the late 19th century, when the Kwasafomanhyiamu or governing council itself ruled as regent. The succession was decided by a series of councils of Asante nobles and other royal family members. The methods of electing a chief varied from one chiefdom to another. For the election of the Asantehene, the Queen mother nominated eligible males as candidates from a royal lineage. She then consulted the elders of that lineage. The final candidate is then selected. The nomination was sent to a council of elders or kingmakers, who represent other Asante states. The Nkwankwaahene who represented the commoners, indicated if there was widespread approval or disapproval of the nominee. If the commoners disapproved of the nominee, the process was restarted. If Chosen, the new King was enstooled by the kingmakers.\nImpeachment\nKings of the Asante Empire who violated any of the oaths taken during his or her enstoolment, were destooled by Kingmakers. For instance, if a king punished citizens arbitrarily or was exposed as corrupt, he would be destooled. Destoolment entailed kingmakers removing the sandals of the king and bumping his buttocks on the ground three times. Once destooled from office, his sanctity and thus reverence were lost, as he could not exercise any of the powers he had as king; this includes Chief administrator, Judge, and Military Commander. The now previous king was dispossessed of the Stool, swords and other regalia which symbolized his office and authority.\nHe also lost his position as custodian of the land. However, even if destooled from office, the king remained a member of the royal family from which he was elected. One impeachment occurred during the reign of Kusi Obodom, caused by a failed invasion of Dahomey.\nSee also\n*Emblem of His Majesty the King of Ashanti\nReferences\nBibliography\n*\n* Emmanuel Akyeampong, Pashington Obeng: Spirituality, Gender, and Power in Asante History. In: The International Journal of African Historical Studies. 28 (3), 1995, S. 481–508.\n*\n*\n*\n*\n* Margaret Priestley: The Ashanti question and the British: eighteenth-century origins. In: Journal of African History. 2 (1), 1961, S. 35–59.\n*\n*\n* William Tordoff: The Ashanti Confederacy. In: Journal of African History. 3 (3), 1962, S. 399–417.\n* John K. Fynn: The reign and times of Kusi Obodum 1750-64. In: Transactions of the Historical Society of Ghana. 8, 1965, S. 24–32.\n* Kevin Shillington, 1995 (1989), History of Africa, New York: St. Martin's Press.\n*\n*\n*"
    }
  ]
}