{
  "content": [
    {
      "type": "text",
      "text": "# Pompeys Pillar National Monument\n\n| coords_ref =\n| area_acre = 51\n| area_ref =\n| established = January 17, 2001\n| visitation_num = 50,000\n| visitation_year = 2002\n| governing_body = U.S. Bureau of Land Management\n| website = [https://www.blm.gov/programs/national-conservation-lands/montana-dakotas/pompeys-pillar Pompeys Pillar National Monument]\n}}\nPompeys Pillar National Monument is a rock formation located in south central Montana, United States. Designated a national monument on January 17, 2001, and managed by the U.S. Bureau of Land Management in conjunction with The Friends of Pompeys Pillar, it consists of only , making it one of the smallest National Monuments in the U.S. The community of\nPompeys Pillar lies just east of the monument.\nHistory\nIt was previously designated a National Historic Landmark on July 25, 1965. The new Pompeys Pillar Interpretive Center opened in 2006. Exhibits in the 5,700-square foot center relate the journey of Captain William Clark and his detachment, including Sacagawea and her son Pomp, down the Yellowstone River Valley in 1806.\nThe pillar itself stands 150 feet (45 m) above the Yellowstone River and consists of sandstone from the late Cretaceous Hell Creek Formation, 75 – 66 million years ago. The base of the pillar is approximately .\nThe pillar features an abundance of Native American petroglyphs, as well as the signature of William Clark, co-leader of the Lewis and Clark Expedition. Clark's inscription is the only remaining physical evidence found along the route that was followed by the expedition.\nThe inscription consists of his signature and the date, July 25, 1806. Clark wrote that he climbed the sandstone pillar and \"had a most extensive view in every direction on the Northerly Side of the river\". He named the outcropping after Jean Baptiste Charbonneau—the son of expedition member Sacagawea—whom he nicknamed \"Pompey\". His original name for it was \"Pompey's Tower\"; it was given the current name in 1814.\nSituated 25&nbsp;miles (40&nbsp;km) northeast of Billings, Montana, along Interstate 94, the pillar gets 50,000 visitors annually. Archeological evidence suggests that the outcropping has been witness to 11,000 years of human involvement in the area. Consequently, in addition to the pictographs and the signature of William Clark, hundreds of other people have carved their initials into the rock, including early pioneers to the area.\nSee also\n*List of national monuments of the United States\n*List of National Historic Landmarks in Montana\n*National Register of Historic Places listings in Yellowstone County, Montana\nReferences\nExternal links\n*\n*\n*\n*"
    }
  ]
}