{
  "content": [
    {
      "type": "text",
      "text": "# Pool Revolution: Cue Sports\n\n| genre = Sports simulation &ndash; cue sports\n| modes = Single-player, multiplayer\n| platforms =Wii (WiiWare)\n}}\nPool Revolution: Cue Sports (also known in Europe as Cue Sports: Snooker vs. Billiards and in Japan as Cue Sports: Wi-Fi Taisen Billiards) is a sports simulation video game video game published by Hudson Soft for the Wii's WiiWare service. The game simulates a variety of cue sports.\nGameplay\nThe game features a number of different cue sports to play. They include snooker, carom billiards, and pool (pocket billiards) variations like eight-ball, nine-ball and rotation.\nThe gameplay is much like Wii Play Pool and Midnight Pool. Players can aim at the desired ball and have to judge the shot at the right angle. Players will be able to choose from many different table styles and the game includes online play where you can play against another player or try to clear the table the fastest in a split screen mode. The game also allows players to attempt different trick shots and also gives them the ability to create their own.\nControls\nThe Wii Remote will act as the cue and players will be able to use it to set the power and the direction buttons to set the direction of the shot. However, the game does come with the option for players to set the strength of the shot by simply pressing buttons on the controller.\nReception\n|rev1 = WiiWare World\n|rev1Score = 7/10\n}}\nPool Revolution scored average to good reviews from critics. WiiWare World gave the game 7 out of 10. They appreciated the addition of online multiplayer and the more serious simulation aspects compared to Midnight Pool, but felt it was lacking the charm of that game. Ultimately, they commented that \"if you can overlook the flaws there’s a very rewarding game here\". IGN UK scored the game at 6 out of 10, calling it an \"average, run-of-the-mill pool game\", but also admitted that it was \"charming, but certainly not for everyone\". Nintendo Power said the game \"might be the most accessible and feature-filled\" billiards title on WiiWare.\nReferences\nExternal links\n*[https://www.youtube.com/watch?v=RWyiQa4Cy9o Japanese trailer] on YouTube\n*[http://www.hudson.co.jp/ww/cuesports/usa/e/movie.html English trailer] on Hudson's Web Site\n*[https://web.archive.org/web/20081227090353/http://wii.ign.com/objects/142/14297671.html Pool Revolution: Cue Sports] at IGN"
    }
  ]
}