{
  "content": [
    {
      "type": "text",
      "text": "# Population transfer in the Ottoman Empire\n\nPopulation transfer in the Ottoman Empire was a common policy used by the Ottoman government. After the Russo-Turkish War (1878), the importance of religious and ethnic identity increased leading to the 1913-1918 period when the primary aim of population transfers was the ethnic restructuring of Anatolia by the Turkish nationalist ruling elite. The work on Ottoman population transfers begins with Ömer Lütfi Barkan's studies of Ottoman defters in the 1940s.\nHistory\nThe Ottoman Empire colonized newly conquered territories by deportation (sürgün) and resettlement, often to populate empty lands and establish settlements in logistically useful places. The term sürgün is known to us from Ottoman documents and comes from the verb sürmek (to displace). This type of resettlement primarily aimed to support daily governance of the Empire, but sometimes population transfers had ethnic or political concerns. Loyal Turkish and Muslim muhacir were resettled among populations considered to be hostile to the Empire, and Christians were intentionally displaced if they were considered a threat to the security of newly conquered territories.\nConquest\nAs the Ottoman Empire expanded, its government relocated people from Anatolia to the Balkans to strengthen their hold over new territories and also moved people from the conquered territory to Istanbul.\nDuring Mehmet I's reign Tatar and Turkmen people were moved to the Balkans to secure areas along the border with Christian Europe. Conquered Christians were moved to Anatolia and Thrace. These population transfers continued into the reigns of Murad II and Mehmet II.\nAfter Murad II's conquest of Salonika, Muslims were involuntarily relocated to Salonika, mostly from Anatolia and Yenice-i Vardar.\nMehmed the Conqueror resettled not only Muslims, but Christians and Jews, in his efforts to repopulate the city of Constantinople after its conquest in 1453.\nAccording to the deportation decree issued in newly conquered Cyprus on 24 September 1572, one family out of every ten in the provinces of Anatolia, Rum (Sivas), Karaman and Zülkadriye were to be sent to Cyprus. These deportees were craftsmen or peasants. In exchange for relocating they would be exempt from taxes for two years.\nLate Ottoman History\nIn the nineteenth century, Ottoman lands became a safe haven for Muslim refugees (muhacir) from the Caucasus and the Balkans.\nThe Ottomans had ruled the Balkans for nearly four centuries when their hegemony was challenged by Russia. By the early 19th century the first signs of declining Ottoman power could be seen in the independence struggles of the Serbian Revolution and the Greek Revolution of 1821. After Ottoman defeat in the Russo-Turkish War (1878) Ottoman influence greatly declined in the Balkans. In the aftermath of this calamity and the Balkan Wars of 1912–1913 over a million Muslims were displaced.\nThe first sanctioned population transfer took place in 1865, when about 40,000 Chechens, Kabardians, Ossetians, and other North Caucasian Muslims moved from Russia's Terek Oblast to the Ottoman Empire.\nThe newly created Balkan states were seeking to create ethnically homogeneous states; mutual population exchange agreements with the ruling Unity and Progress Party in Turkey were seen as the best tool for this demographic engineering. The ruling party in Turkey also used a combination of conscription and resettlement as part of their strategy, resettling the Muslim muhacir from the Balkans in border towns to increase the Muslim population in areas that had historic non-Muslim majorities.\nThe rise of competing nationalism between 1876 and 1926 set the stage for these population transfers. Ottoman xenophobia was fueled by deepening nationalist and anti-colonial sentiment in the early 20th century. The Ottoman literati resented the humiliating capitulations that impeded the empire's economic health. Separatist nationalist movements emerged from the non-Muslim communities of the Ottoman Empire who, as the main beneficiaries of the capitulations and constitutional reforms, faced hostility and resentment from the anti-imperialist factions.\nReferences\nSources\n*"
    }
  ]
}