{
  "content": [
    {
      "type": "text",
      "text": "# Portuguese conquest of Goa\n\n1590\n| date              = 25 November 1510\n| place             = Goa, Bijapur Sultanate\n| result            = Portuguese victory\n| combatant1        =\nSupported by Vijayanagara Empire\n| combatant2        = Bijapur Sultanate\n| commander1        = Afonso de AlbuquerqueTimoji\n| commander2        = Yusuf Adil ShahIsmail Adil ShahYusuf GurgijPulad KhanRassul Khan\n| strength1         = First attack:1,600 Portuguese220 Malabarese3,000 combat slaves23 ships2,000 men of TimojiSecond attack1,680 Portuguese34 ships\n| strength2         = First attack:over 40,000 menSecond attack8–10,000 men 200 cannon\n| casualties1       = First attack200 Portuguese deadSecond attack50 dead300 wounded\n| casualties2       = First attack UnknownSecond attackover 6,800 dead\n| territory         = Conquest of Goa by the Portuguese\n}}\nThe Portuguese conquest of Goa occurred when the governor Afonso de Albuquerque captured the city in 1510 from the Sultanate of Bijapur. Old Goa became the capital of Portuguese India, which included territories such as Fort Manuel of Cochin, Bom Bahia, Damaon, and Chaul. It was not among the places Albuquerque was supposed to conquer. He did so after he was offered the support and guidance of Timoji and his troops.\nAlbuquerque had been given orders by Manuel I of Portugal to capture Ormus, Aden, and Malacca only. Goa would remain under Portuguese control until 1961.\nBackground\nOn 4 November 1509, Afonso de Albuquerque succeeded Dom Francisco de Almeida as Governor of the Portuguese State of India, after the arrival in India of Marshal of Portugal Dom Fernando Coutinho, sent by King Manuel to enforce the orderly succession of Albuquerque to office. Unlike Almeida, Albuquerque realized that the Portuguese could take a more active role in breaking Muslim supremacy in the Indian Ocean trade by taking control of three strategic chokepoints – Aden, Hormuz, and Malacca. Aden trade was controlled by Arabs, Hormuz by Persians, and Malacca by Muslim Malays. Albuquerque also understood the necessity of establishing a base of operations in lands directly controlled by the Portuguese crown and not just in territory granted by allied rulers such as Cochin and Cannanore.\nPortuguese preparations\nShortly after a failed attack on Calicut in January 1510, Albuquerque was replenishing his troops in Cochin and organizing an expedition with which to attack the Suez in the Red Sea, where the Mamluks were believed, correctly, to be preparing a new fleet to send to India against the Portuguese. Marshal of Portugal Dom Fernando Coutinho had been killed in Calicut, fortuitously leaving Albuquerque with full, uncontested command of Portuguese forces in India. The Portuguese force was composed of 23 ships, 1,200 Portuguese soldiers, 400 Portuguese sailors, 220 Malabarese auxiliaries from Cochin, and 3,000 \"combat slaves\" (escravos de peleja). The expedition set sail for the Red Sea in late January 1510, on 6 February anchored by Canannore, and on 13 February sighted the Mount of Eli.\nBy the Mount of Eli, Albuquerque summoned his captains to his flagship Flor de la Mar, where he revealed the objective of the expedition: He had orders from King Manuel I to subjugate Hormuz, but seeing as the Mamluks were assembling a fleet at Suez, he considered diverting from the original course of action to destroy it before it was ready.\nThereafter, the expedition resumed its course and anchored by the city of Honavar, where Albuquerque was approached by an acquaintance of the Portuguese: the powerful Malabarese privateer, Timoji (Thimayya). Timoji claimed to Albuquerque that it would be dangerous to leave for the Red Sea, as the Sultan of Bijapur Yusuf Adil Khan had been gathering within the nearby city of Goa the remnants of the Mamluk expedition destroyed in the Battle of Diu and refitting them with new ships to send against the Portuguese, likely in retaliation for the destruction of the city of Dabul by Almeida the previous year. The city however was scarcely defended as Yusuf had recently died and his heir Ismail Adil Shah was young and inexperienced. Knowing of the discontent among the Hindus of Goa after falling to the Muslim rulers of Bijapur in 1496, Timoji proposed to support Albuquerque in capturing the city. Timoji's timely proposition was not entirely coincidental, as Albuquerque had already received in Cochin envoys of Timoji requesting a rendezvous.\nUpon assembling with his captains, Albuquerque convinced them that it was crucial that they attack Goa.\nFirst conquest of Goa\nOn 16 February, the Portuguese armada sailed into the deep waters of the Mandovi River. Supported by 2,000 men of Timoji, the Portuguese landed troops commanded by Dom António de Noronha and assaulted the fort of Pangim, defended by a Turkish mercenary Yusuf Gurgij and a force of 400 men. Yusuf was wounded and retreated to the city and the Portuguese captured the fort along with several iron artillery pieces. At Pangim, Albuquerque received envoys from the most important figures of Goa, and proposed religious freedom and lower taxes if they accepted Portuguese sovereignty. Thereafter they declared their full support for Portugal and Albuquerque formally occupied Goa on 17 February 1510, with no resistance.\nAlbuquerque reaffirmed that the city was not to be sacked and that the inhabitants were not to be harmed, under the penalty of death.\nIn the city, the Portuguese found over 100 horses belonging to the ruler of Bijapur, 25 elephants, and partially finished new ships, confirming Timoji's information about the enemy's preparations. For his assistance, he was nominated tanadar-mor (the chief tax-collector and representative) of the Hindus of Goa. The Muslims on their part were allowed to live by their laws under their own Muslim magistrate, Coje Bequi.\nExpecting retaliation from the Sultan of Bijapur, Albuquerque began organizing the city's defences. The city's walls were repaired, the moat was expanded and filled with water, and storehouses for weapons and supplies were built. The ships were to be finished and pressed into Portuguese service, and the five fording points into the island – Banastarim, Naroá, Agaçaim, Passo Seco, and Daugim – were defended by Portuguese and Malabarese troops, supported by several artillery pieces.\nAt the same time, Albuquerque sent friar Luiz do Salvador ahead of an embassy to the court of the neighbouring Hindu Vijayanagara Empire, hoping to secure an alliance against Bijapur.\nIsmail Adil Shah's counterattack\n]]\nUnbeknownst to Albuquerque, Ismail Adil Shah had just agreed on a truce with the Vijayanagara Empire, and could divert many more troops into recapturing the city than expected. To that effect, he sent a Turkish general, Pulad Khan, with 40,000 troops, which included many experienced Persian and Turkic mercenaries, that defeated Timoji's troops on the mainland. Ismail then set up his royal tent by the Banastarim ford, waiting for the monsoon to trap the Portuguese before giving Pulad Khan the order to assault the island.\nAlbuquerque was informed of this plan through the Portuguese renegade João Machado, who was now a prestigious captain in Ismail's service, though he remained Christian. He was sent to convince his countrymen to surrender or flee. Trusting the strength of his defensive position, Albuquerque rejected Machado's propositions. Machado also told Albuquerque that the Muslims within the city kept Ismail informed of Portuguese numbers and movements.\nWith the coming of the monsoon rains however, the Portuguese situation became critical: the tropical weather claimed a great number of Portuguese lives, foodstuffs deteriorated, and the Portuguese were stretched too thin to hold back the Muslim army. Under these conditions, Pulad Khan launched a major assault on 11 May, across the Banastarim ford at low tide amidst a heavy storm, quickly overwhelming the small number of Portuguese troops. As defences crumbled, a Muslim revolt broke out in the outskirts of Goa, in spite of the agreement with Albuquerque, which he would remember in the future.  The Portuguese hurriedly retreated into the city walls, with the aid of their Hindu allies, abandoning several artillery pieces by the riverside.\nThe following day, Pulad Khan ordered an assault against the city but was repelled. Only now did Albuquerque learn from friar Luiz of the truce between Bijapur and Vijayanagara, and he spent the rest of May preparing a retreat. Albuquerque refused to set fire to the city since this would announce their retreat to the besiegers and instead ordered a great quantity of spices and copper to be scattered on the streets to delay the enemy's advance. Before leaving however, he had Timoji with fifty of his men execute the Muslim inhabitants within the citadel, but also took several women that had belonged to Adil Khan's harem onto his ship, to later offer them as maids-in-waiting to Queen Maria. Before daybreak of 31 May, the remaining 500 Portuguese embarked under enemy fire, covered by a small number of Portuguese soldiers holding back the advance of enemy troops that breached the city walls. Ismail then solemnly retook possession of the city, to the sound of trumpets.\nTrapped in the river\nOn 1 June, the ships sailed away from the riverfront of Goa to the mouth of the Mandovi River, unable to leave for the high seas due to the monsoon storms. The expedition was now trapped on their own ships within the rivermouth, and for the following three months would endure a severe rationing of supplies to the point of cooking rats and leather, a continuous Muslim bombardment, and the harsh weather conditions, all which threatened to crush the expedition.\nThe riverwater was muddy, making fish hard to catch and the water undrinkable, although the heavy rain permitted some of the drinking water to be replenished. The Portuguese also suffered from the constant bombardment from artillery pieces on shore which, though erratic, forced them to frequently relocate the ships and avoid going out onto the decks. They avoided replying, to save ammunition. According to João de Barros: \"Thus by hunger and thirst on one part and by war, lightning and Winter thunderstorm on another, the common folk was so stricken that some were driven to desperation.\"\nMany jumped overboard and defected, informing the enemy of the scarcity in the armada. However, Ismail Adil Shah feared the renewal of hostilities with Vijayanagar at any moment, and wished to conclude a truce with the Portuguese. He sent an envoy proposing peace to the nearby town of Cintacora. Albuquerque received him with an abundant display of food and wine but rejected Ismail's proposal.\nThe governor would run through every ship, raising morale and instilling discipline, but his relation with his captains was degrading rapidly after his popular nephew, Dom António de Noronha, died in a sortie on land. One episode was relevant, as one fidalgo, Rui Dias, had been disobeying the governor's orders, sneaking out of his ship to meet with the women that Timoji had captured, who were locked in a cabin on the governor's own flagship. Upon learning of this blatant disobedience, Albuquerque ordered him to be immediately hanged. With the noose around his neck, mutiny sparked among the ranks of Portuguese fidalgos in the armada – who objected not so much to his execution but the fact that he was being hanged and not beheaded as befitted a fellow nobleman. Albuquerque was, however, resolute. Dias was hanged and several of the rebellious captains  were arrested, though only for a few days.\nInterlude\nBy 15 August, the armada finally sailed out of the Mandovi towards Cannanore and the next day reached Angediva Island to fetch water. There, they encountered Diogo Mendes de Vasconcelos leading an expedition of four ships and 300 men, sent by King Manuel I to trade directly with Malacca, based on the assumption that Diogo Lopes de Sequeira had been successful in opening trade with that city the previous year. As the head of Portuguese forces in India, Albuquerque knew that he had not, and persuaded Vasconcelos to assist him reluctantly in attempting to capture Goa instead.\nPassing by Honavar, Albuquerque learned from Timoja and his informants that Ismail had left Goa to fight Vijayanagar at Balagate and an insurrection had taken place, killing many officers of the garrison left behind.\nCannanore\nAt Cannanore they careened and refitted the ships, and were joined by the 12-ship squadron of Duarte de Lemos coming from Socotra along with the annual fleet of carracks coming from Portugal commanded by Gonçalo de Sequeira, with orders to relieve Lemos of his command and turn his ships over to the governor. The Portuguese now counted 1,680 men and 34 ships, among naus, caravels, and galleys – though Gonçalo de Sequeira stayed behind with his ships to oversee the loading of the pepper and return to Portugal with Duarte de Lemos.\nCochin\nBefore leaving for Goa, Albuquerque was alerted by the Raja of Cochin, a faithful ally of the Portuguese, of an impending power dispute between him and his cousin and requested his assistance. The annual provisioning of pepper bound to Portugal depended on the King of Cochin, and Albuquerque quickly sailed to his aid. Through a swift display of force the conflicting prince was sent to exile and the King of Cochin secured.\nHonavar\nAt Honavar the Portuguese once more joined forces with Timoji, who informed Albuquerque that Ismail had left a considerable garrison behind, about 8,000–10,000 \"whites\" (Persian and Turkic mercenaries) supported by native infantry. Timoji could provide 4,000 men and 60 foists (light galleys) of his own, while the king of Honavar proposed to send 15,000 men by land.\nSecond conquest of Goa\nOn 24 November, the Portuguese again sailed into the Mandovi and anchored by Ribandar, where they landed some men commanded by Dom João de Lima to scout the city's defences. Albuquerque summoned a council in which he expressed his intentions to storm the city in a three-pronged attack and divided his forces accordingly: one squadron commanded by himself, who would attack the city defenses from the west, where the shipyards were located; the other two commanded by Vasconcelos and Manuel de Lacerda would assault the city's riverside gates to the north, where the main enemy force was expected to be concentrated.\nBy daybreak of 25 November, the day of Saint Catherine, the landing began, with the Portuguese galleys moving in first to bombard the riverfront to clear it of enemies for the landing boats. Once ashore, the heavily armoured Portuguese infantry, led by the steel-clad fidalgos of the squadrons of Vasconcelos and Lacerda, assaulted the outer defences around the riverside gates. Using hand thrown clay bombs, they quickly threw the defenders into disarray. The Portuguese prevented the gates from closing with their pikes and thus broke into the city's fortified perimeter amidst their fleeing enemies. This initial success was followed by some confusion, as both the Portuguese and the defenders on both sides of walls found themselves simultaneously trying to open and close the gates. A certain Fradique Fernandes managed to scale the walls with the assistance of his lance, and hoisted a banner while shouting \"Portugal! Portugal! Vitória! Santa Catarina!\", adding to the defenders' confusion. In a last-ditch effort to organize a defence, some of the defenders rallied around the palace of Ismail Adil Shah, but they too were eventually shattered by a second Portuguese assault commanded by Vasconcelos, arriving at the sound of trumpets.\n.]]\nAfter five hours fighting, the defenders were now in a definitive rout, fleeing across the streets and away from the city along with many civilians – many of whom drowned trying to cross the narrow bridge over the moat in the ensuing flight, or were chased down by the Hindus of Goa.\nAlbuquerque, in the meantime, could not personally participate in the assault into the city, as the western defences of the city proved to be much stronger than expected. Nor did Timoji, who only arrived later. The governor then spent the rest of the day eliminating pockets of resistance within the city, and  allowed the soldiers four days to sack it. The shipyards, warehouses, and artillery reverted to the Crown and the property of Hindus was spared. The Muslims who had not fled were killed under the governors' orders for colluding with the army of Bijapur. To avoid an outbreak of plague, their bodies were thrown \"to the lizards\" in the river.\nThe Portuguese suffered 50 dead and 300 wounded in the attack – mainly due to arrows – while Albuquerque estimated that about 800 \"Turks\" and over 6,000 \"moors\" among civilians and fighting men had perished.\nDefence of Goa\n]]\nWith the city now firmly in Portuguese hands, on 1 December 1510 Albuquerque resumed its administration and organizing its defence. The old castle was rebuilt in European fashion, under the supervision of architect Thomaz Fernandez, with 20 Portuguese stonemasons and many paid local labourers at his disposal. It was garrisoned with 400 Portuguese soldiers, while a corps of 80 mounted crossbowmen served as watchmen and gateguards of the city, commanded by the captain of Goa, Rodrigo Rabelo, who received a bodyguard of 20 halberdiers. Francisco Pantoja was nominated alcaide-mor (chief magistrate) of the city. A riverguard was also created, with two tall ships, a galley, a galleot, and two brigantines.\nTimoji regained his post as tanadar-mor but his lowly caste as well as his mistreatment of underlings caused tensions within the Hindu society, and so he was replaced with his rival Melrao (Madhavrav), who had at his disposal 5,000 men to assist with the defence.\nWith an effective defensive system in place, Diogo Mendes de Vasconcelos requested the governor's permission to proceed to Malacca, which Albuquerque refused. Vasconcelos then mutinied and tried to sail without permission, for which he was arrested and his pilots hanged. Albuquerque personally assumed the command of the expedition and in February 1511 left Goa towards Malacca.\nFor the duration of the following year, the city would come under siege by the reorganized forces of general Pulad Khan, who once again overwhelmed the Portuguese with greater numbers, constructed a bridge and a fortress at Benastarim, and occupied the island of Goa, but he failed to take the city proper. Pulad Khan was replaced with Rassul Khan, under the suspicion of embezzling funds, but he was likewise unable to recapture the city.\nDuring this time the defenders were forced to spend night and day keeping watch with arms at hand at all times, but suffered from a grave shortage of supplies within the city walls as the monsoon rains settled in; many defected to the enemy field, but in this dire moment, João Machado returned to his beleaguered comrades, which greatly raised the morale among the Portuguese. Furthermore, João Machado brought with him knowledge on the fighting tactics of the Indians, which he taught the Portuguese how to counter:\nIn October 1512 Albuquerque returned from Malacca at the head of 20 ships and 2,500 men as reinforcements. With his force now numbering about 3,000 soldiers, it was time to pass on the offensive and secure Goa permanently.\nAssault on Benastarim\n]]\nTo secure control of Goa, it was necessary to take the fort Pulad Khan had constructed on the east side of the island, about 6 km from Goa, guarding a pontoon bridge that allowed his troops to cross over from the mainland.\nAccording to Albuquerque, it was garrisoned by 300 horsemen, among them many Turkic mercenaries, and 3,000 battle-ready warriors, plus another 3,000 he deemed \"useless\", probably levy. The pontoon bridge was protected by two river stockades, constructed on each side at some distance to prevent vessels from attacking it. Albuquerque ordered eight ships to destroy the stockade; once this was achieved, the vessels moved on ahead of Benastarim, thus blockading it from the river side, and initiated a naval bombardment.\nBefore the Portuguese infantry had marched out to complete its encirclement, 200 horsemen and 3,000 footmen of the Muslim army sallied out from Benastarim, seeking to resolve the conflict by provoking the Portuguese into a pitched battle outside Goa. Albuquerque wished to deny battle, seeing as the native infantry and cavalry were much lighter and more mobile than the heavily armoured Portuguese; but at the insistence of his soldiers, Albuquerque gathered the Portuguese in four squadrons and headed out against the Muslims: Albuquerque in the center, Dom Garcia on the right flank, Manuel de Lacerda on the left, and a small cavalry force of 35 mounted fidalgos in reserve. As the vanguard of the Portuguese center advanced in formation, it formed a pike square, supported by the squadron of Dom Garcia. The Muslims hesitated, and at this critical moment, a charge by the Portuguese cavalry threw them into a disorganized rout back to the fortress.\nWith the field now secure, the Portuguese decided in a war-council to draw out the artillery and expunge Benastarim through a heavy bombardment. At the end of eight days under fire and fearing a bloody assault, Rassul Khan decided to come to terms with Albuquerque.\nAlbuquerque allowed Rassul Khan and his men to depart with their lives, in exchange for leaving behind their weapons and handing over about 19 Portuguese renegades. Rassul Khan negotiated that they not be executed since they had converted to Islam, and since royal Portuguese directives banned the execution of renegades (to encourage their return), Albuquerque accepted the proposal. While keeping his word, their fates would prove to be worse than death: for having abandoned their comrades in combat, turned against them, and converted to \"infidel\" faith, Albuquerque decreed that they be punished by public mutilation, before a crowd in the main square. Most succumbed to the injuries in prison, but amongst the survivors was Fernão Lopes, who would later seek voluntary solitude on the Island of Saint Helena.\nAftermath\n(c. 1540)]]\n's \"Market of Goa\", from Jan Huygen's 1596 Itinerario]]\nBy taking Goa, Afonso de Albuquerque became the second European to conquer land in India since Alexander the Great.\nUnlike the Portuguese military garrisons established in allied lands such as Cochin and Cannanore, Goa included for the first time a large body of native non-Portuguese inhabitants for the Portuguese crown to rule. To better achieve this, Albuquerque resorted to medieval Iberian procedures: people of different religious communities were allowed to live by their laws under representatives of their respective communities. Exception was made to the practice of sati however, which was promptly abolished. Certain taxes due to Ismail Adil Shah were also abolished.\nGoa was an important trading port for Arabian and Persian war-horses imported from Hormuz. Taking advantage of Portuguese mastery of the seas, Albuquerque decreed that all vessels importing war-horses to India must unload their cargoes exclusively at Goa, thus securing what would become one of Goa's most valuable sources of income, as both the Vijayanagara Empire and the Sultanate of Bijapur sought to outbid each other for exclusive buying rights\nAlbuquerque also secured at Goa a pool of resources like vital rice and revenue to pay the soldiers and sailors, skilled native shipwrights and craftsmen capable of building and repairing fleets, and gunsmiths to maintain arsenals with which to arm them. This was crucial to lessening Portuguese dependence on men and material sent from faraway Europe, and ensure continued Portuguese presence in Asia. Establishing a strong naval base at Goa furthermore served a vital part in Albuquerque's strategy of undermining Muslim trade in the Indian Ocean, as Portuguese naval forces could then sever the link between the hostile Sultanate of Gujarat and the rich spice-producing regions in Southern India and Insulindia, where powerful Gujarati communities of merchants could be found, inciting local rulers to attack the Portuguese.\nAt Goa, Albuquerque instituted an orphans' fund and opened a hospital, the Hospital Real de Goa, modelled after the grand Hospital Real de Todos os Santos in Lisbon. Also at Goa were built smaller hospitals run by the city's charity, the Misericórdia, dedicated to serving the poor and the natives.\nArguably, what became Albuquerque's most iconic policy was that of encouraging his men to take local wives and settle in the city, granting them land confiscated from the evicted Muslims and a dowry provided by the state. Native women were allowed legal property rights for the first time. Albuquerque's generous policy was, however, not without controversy among high-ranking Portuguese officials and clergy. Nonetheless, the practice continued well beyond Albuquerque's lifetime, and in time the casados and the Indo-Portuguese descendants would become one of the Crown's main reserve of support whenever insufficient men and resources arrived from Europe.\n]]\nAs a whole, Albuquerque's policies proved immensely popular amongst his soldiers as well as the local population, especially his characteristically strict observance of justice. When Albuquerque died in sight of Goa in 1515, even the Hindu natives of Goa mourned his passing alongside the Portuguese. His tomb at the Nossa Senhora da Serra hermitage was converted to a shrine by the local Hindus, who would leave flowers there in his dedication and direct prayers to him, seeking aid in matters of justice, until his remains were returned to Portugal in 1566.\nIn 1520, the Portuguese extended their dominion south over the neighbouring district of Rachol, as that year Emperor Krishnadevaraya of Vijayanagara captured the Rachol Fort and delivered it to the Portuguese in exchange for mutual defence against the Muslims.\nIn 1526 King John III granted the city of Goa and its town hall the same legal status as Lisbon, in a foral in which the general laws and privileges of the city, its town hall, and the local Hindu community were detailed – especially important since at the time the native laws of Goa were still not written, instead being handled by councils of elders or religious judges and passed down orally (thus prone to abuses).\nAlthough Albuquerque had intended Goa to be the center of the Portuguese Empire in Asia, it was only in 1530 that governor Nuno da Cunha transferred the viceregal court from Cochin to Goa, thus officially making Goa the capital of the Portuguese State of India until 1961.\nSee also\n* History of Goa\n* Capture of Malacca (1511)\n* Velhas Conquistas\n* Luso-Indian\n* Siege of Goa (1517)\nNotes\nReferences\n* João Paulo de Oliveira e Costa, Vítor Luís Gaspar Rodrigues (2008) [https://books.google.com/books?id=V25xPgAACAAJ Campanhas de Afonso de Albuquerque: Conquista de Goa, 1510–1512] Lisbon, Tribuna da História.\n* Geneviève Bouchon, (2014) [https://books.google.com/books?id=2lSlAwAAQBAJ&q=genevieve+bouchon+albuquerque ''Albuquerque: Le Lion des Mers d'Asie], Paris, Éditions Desjonquères.\n* Gaspar Correia (1558–1563) [https://books.google.com/books?id=ZtY4AQAAMAAJ&q=lendas+da+india Lendas da Índia], 1864 edition, Lisbon, Typographia da Academia Real das Sciencias de Lisboa.\n* R.A. Bulhão Pato, H. Lopes Mendonça (1884) [https://books.google.com/books?id=bZcNAAAAQAAJ&q=Cartas+de+Afonso+de+Albuquerque+seguidas+de+documentos+que+as+elucidam Cartas de Afonso de Albuquerque seguidas de documentos que as elucidam] Lisbon\n* Elaine Sanceau (1936) [https://books.google.com/books?id=3-RBAAAAIAAJ&q=elaine+sanceau Indies Adventure: The Amazing Career of Afonso de Albuquerque, Captain-general and Governor of India (1509–1515)''], Blackie"
    }
  ]
}