{
  "content": [
    {
      "type": "text",
      "text": "# Portland State Vikings football under Jerry Glanville\n\nPortland State Vikings football under Jerry Glanville encompassed the 2007, 2008 and 2009 NCAA Division I FCS football seasons that Glanville served as the head coach. On February 28, 2007, Glanville was hired as the twelfth head coach in the history of Portland State football. He replaced Tim Walsh who resigned as head coach on February 16 to accept the position of offensive coordinator at Army. Prior to his arrival, Glanville had served as defensive coordinator at Hawaii for both the 2005 and 2006 seasons. He had also served as the head coach for both the Houston Oilers (from 1986 to 1989) and the Atlanta Falcons (from 1990 to 1993) of the National Football League prior to his arrival at Portland.\nThe Vikings entered the 2007 season with high expectations, but finished with only three wins and eight losses (3–8). Their loss against Weber State was noted for having set Football Championship Subdivision (FCS) records for both the most combined points and points scored by a team in a loss. Looking to improve in 2008, the Vikings only won one additional game to finish with four wins and seven losses (4–7). After finishing the 2009 season with only two wins and nine losses (2–9), Glanville resigned as head coach of the Vikings on November 17. During his three-season tenure at Portland State, Glanville compiled an overall record of nine wins and 24 losses (9–24).\n2007 season\nAs the 2007 squad entered the season, Nike released new team uniforms and stylized Viking logo. Although the team entered the season as the No. 13 ranked team in the FCS and the favorite to finish second behind Montana in the Big Sky, the team struggled and finished with a record of three wins and eight losses. After losses against No. 10 McNeese State to open the season, and UC Davis in their home opener, the first victory of the Glanville era came against Sacramento State at PGE Park. Portland then lost at San Diego State of the Football Bowl Subdivision a week before their second victory of the season at No. 21 Eastern Washington.\nThe Vikings then lost their next five consecutive games against Northern Arizona, Idaho State, Weber State, Montana and Montana State. Their 68–73 loss against Weber State is noted for the combined 141 points scored by both teams and 68 points scored by the Vikings in the loss, both FCS records. At the time, the 141 combined points also set the NCAA all-division record for most points in a game. Portland then closed the season with a victory at Northern Colorado to end their five-game losing streak.\nSchedule\n}}\n|\n}}\n|\n}}\n|\n}}\n|\n}}\n|\n}}\n|\n}}\n|\n}}\n|\n}}\n|\n}}\n|\n}}\n}}\n2008 season\nLooking to improve upon their three win 2007 season, Glanville led the Vikings to only an improvement of a single win in their 4–7 2008 campaign. After a victory over Division II  to open the season, Portland lost three consecutive road games against UC Davis, Washington State of the FBS and Sacramento State. The Vikings ended their three-game losing streak with a 47–36 victory over Eastern Washington. In the win, Portland quarterback set a FCS record for having the most pass attempts in a single game without an interception with 73.\nThe Vikings then lost at Northern Arizona and defeated Idaho State at PGE Park to improve their record to 3–4. However, Portland then had their second three-game losing streak of the season with losses at Weber State, at home against Montana and at home against Montana State before they won their final game of the season at home against Northern Colorado.\nSchedule\n| site_stadium = PGE Park\n| site_cityst = Portland, OR\n| score = 31–14\n| attend = 8,239\n| source =\n}}\n|\n}}\n|\n}}\n|\n}}\n|\n}}\n|\n}}\n|\n}}\n|\n}}\n|\n}}\n|\n}}\n|\n}}\n}}\n2009 season\nIn what was the final season of the Glanville era, Portland State only won a pair of games en route to a final record of two wins and nine losses. After a loss at Oregon State to open the season, the Vikings won their first game of the season at home against Southern Oregon of the NAIA. The Vikings then went on a three-game losing streak with losses at Montana, and against both Weber State and Sacramento State before they won their second and final game of the season at Northern Colorado. Portland State then concluded the season with five consecutive losses against Northern Arizona, UC Davis, at Seattle against Eastern Washington, against Montana State and at Idaho State.\nSchedule\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n}}\nReferences"
    }
  ]
}