{
  "content": [
    {
      "type": "text",
      "text": "# Portraits of presidents of the United States__disambig_1\n\n, the first presidential portrait]]\nBeginning with painter Gilbert Stuart's portrait of George Washington, it has been tradition for the president of the United States to have an official portrait taken during their time in office, most commonly an oil painting. This tradition has continued to modern times, although since the adoption of photography as a widely used and reliable technology, the official portrait may also be a photograph (or at least a photograph may be viable).\nPresidents will often display the official portraits of former presidents whom they admire in the Oval Office or elsewhere around the White House, loaned from the National Portrait Gallery. The gallery has collected presidential portraits since its creation in 1962, and began commissioning their portraits in 1994, starting with George H. W. Bush.\nIn 2018, President Donald Trump signed Public Law 115–158, which prohibits the use of federal funds to pay for an official portrait of any federal official or officer, including the president, the vice president, a member of Congress, the head of an executive agency, or the head of an office of the legislative branch. As most recent presidential portraits have been privately funded, this law primarily prevents other governmental officers such as agency heads and speakers of the House from commissioning official portraits using federal funds.\nPresidents\nGeorge Washington\nThe presidential portrait of George Washington was famously rescued by First Lady Dolley Madison when the British burned down the White House in the War of 1812.\nAndrew Jackson\nHistorians believe that Jackson sat for about 35 portraits, and that there are a total of about 200 paintings of Jackson done in oils or watercolor, many created posthumously and/or copied from existing images. Jackson was painted most often by his nephew-by-marriage Ralph E. W. Earl.\nTheodore Roosevelt\nPresident Theodore Roosevelt's official portrait was originally commissioned to Théobald Chartran in 1902, but when Roosevelt saw the final product he hated it and hid it in the darkest corner of the White House. When family members called it the \"Mewing Cat\" for making him look so harmless, he had it destroyed and hired John Singer Sargent to paint a more masculine portrait.\nSargent followed Roosevelt around the rooms of the White House, making sketches looking for the right lighting and pose, but was unhappy with them. When Roosevelt headed toward a staircase to try the rooms on the second level, both of their patience was running thin. Roosevelt suggested that Sargent did not have a clue what the artist wanted. Sargent responded that Roosevelt did not know what was needed to pose for a portrait. Roosevelt, having reached the landing, planted his hand on the balustrade post and turned to Sargent, angrily demanding \"Don't I?!\" and the perfect pose had been found.\nRoosevelt, always active, only agreed to stay still for half an hour a day, after lunch. But the portrait was eventually finished and was adored by Roosevelt.\nWarren G. Harding\nThe United States Commission of Fine Arts recommended F. Luis Mora to paint the portrait of Warren G. Harding. The portrait was painted from photographs. Two portraits of Harding painted by 'foreign artists' in the White House were rejected for inferior artistic merit and insufficient likeness. The painting was hung in the White House in June 1930.\nCalvin Coolidge\nDuring Ronald Reagan's presidency, he moved Coolidge's portrait from the Grand Hall into the Cabinet Room next to Thomas Jefferson's portrait. Reagan admired and quoted Coolidge, and thought Coolidge's impressive performance in the \"roaring twenties\" was outstanding. Reagan believed that Coolidge's portrait was much more suitable next to a founding father.\nHerbert Hoover\nPresident Herbert Hoover's official portrait was completed 23 years after he left office. The first official portrait was painted by John Christen Johansen in 1941. Hoover, however, later commissioned a second portrait that was completed in 1956 by Elmer Wesley Greene. At Hoover's request, this painting replaced the original, and currently stands as the official White House portrait. The Johansen painting now resides at the Herbert Hoover Presidential Library and Museum in West Branch, Iowa.\nJohn F. Kennedy\nWilliam G. Allman discusses the inspiration behind Aaron Shikler's portrait of John F. Kennedy.]]\nPresident John F. Kennedy's official portrait was painted posthumously by Aaron Shikler at the request of Jacqueline Kennedy in 1970. It is generally analyzed as a character study. Unlike most presidential portraits, Kennedy's depicts the president as pensive, with eyes downcast and arms folded. According to Shikler, Jackie's only stipulation was for him to create an image different from \"the way everybody else makes him look, with the bags under his eyes and that penetrating gaze. I'm tired of that image.\" Shikler drew a few sketches based on photographs, one of which was inspired by Ted Kennedy's somber pose at his brother's (John F. Kennedy) grave, his arms crossed and his head bowed. Jackie chose that sketch as the final pose. Shikler also painted the official White House portraits of First Lady Jacqueline Kennedy and the Kennedy children.\nRonald Reagan\nThere have been two official White House portraits of President Ronald Reagan. The first portrait of Ronald Reagan was painted by Aaron Shikler in 1989 but was rejected as being an insufficient likeness and put into storage in 1991. A second portrait, painted by Everett Raymond Kinstler in 1991, was deemed more successful and presently hangs in the White House.\nGeorge H. W. Bush\nPresident George H. W. Bush and First Lady Barbara Bush were painted by the American portrait artist Herbert Abrams in 1994. Chas Fagan was later commissioned to paint the second official portrait of Barbara Bush as she did not like the first portrait completed by Abrams.\nBill Clinton\nThe presidential portrait of Bill Clinton was the first of such portraits to be painted by an African American, Simmie Knox.\nBefore that, a portrait was commissioned by the National Portrait Gallery at the Smithsonian Institution. Years following its initial unveiling, the artist of the portrait, Nelson Shanks, revealed he added a subtle shadow on the left-hand side of the painting to reference the Monica Lewinsky scandal and how it was, \"a metaphor in that it represents a shadow on the office he held, or on him\". According to the Shanks, Clinton \"hate[d] the portrait\" and wanted it removed from the National Portrait Gallery. As of 2015, it remained in their collection but was not on display.\nGeorge W. Bush\nThe official White House portrait of George W. Bush was revealed on May 31, 2012. It was painted by John Howard Sanden who also painted the official portrait for First Lady Laura Bush that was revealed at the same time as her husband's portrait. In addition, Bush's portrait for the National Portrait Gallery was uncharacteristically released several weeks before his administration had ended. Painted by Robert A. Anderson, it was unveiled at the National Portrait Gallery of the Smithsonian Institution in Washington, D.C., on December 19, 2008. President Bush jokingly opened the unveiling with \"Welcome to my hanging\", which resulted in laughter from the room.  This was an official portrait commissioned by the White House, but funded by private donorship.\nThe caption at the National Portrait Gallery beside President Bush's portrait originally read that his administration was \"marked by a series of catastrophic events...\" [including] \"...the attacks on September 11, 2001, that led to wars in Afghanistan and Iraq.\" Vermont senator Bernie Sanders wrote a letter to the director of the National Portrait Gallery, noting the link between the terrorist attacks and Iraq had been \"debunked\". Director Martin E. Sullivan assured him the label would be changed to delete \"led to\".\nBarack Obama\nPresident Barack Obama (painting)}}\nInstitute for Creative Technologies, the Smithsonian Institution, and White House staff discuss the creation of Barack Obama's 3D portrait.]]\nBarack Obama was the first president to have his portrait taken with a digital camera in January 2009 by Pete Souza, the then–official White House photographer, using a Canon EOS 5D Mark II. Obama was also the first president to have 3D portraits taken, which were displayed in the Smithsonian Castle in December 2014.\nOn February 12, 2018, the official presidential likenesses of Barack Obama and Michelle Obama were unveiled at the National Portrait Gallery. Kehinde Wiley painted Mr. Obama, while Amy Sherald painted Mrs. Obama.  Different flowers in the background of Barack Obama's painting are symbolic, with chrysanthemums, for example, representing Chicago, and pikake representing Hawaii. The contemporary style of both paintings attracted note for breaking the trend of past presidential portraits being painted in a traditional style.\nThe official White House portrait of Barack Obama was unveiled on September 7, 2022. It was painted by Robert McCurdy, who focused on working off of a photograph of the former president. In the photorealistic portrait, Obama is dressed in a black suit with a gray tie, and painted against a minimal white backdrop, a signature of McCurdy's artworks. At the same time, the official portrait for First Lady Michelle Obama, painted by realism artist Sharon Sprung, was also unveiled. In First Lady Obama's oil painting portrait, she appears in an off-the-shoulder turquoise gown against a warm pink wall, looking \"intent but alluring and unmistakably herself.\"\nDonald Trump\nThe first official presidential portrait of Donald Trump was released on January 19, 2017, the day before his inauguration, and was used for the official @POTUS Twitter account until May 5, 2017. His official first term presidential portrait was released on October 6, 2017. For Trump's second term, a new portrait was taken and revealed to the public on January 17, 2025, which was replaced by another official portrait released on June 2, 2025. His portrait painting has been commissioned by the National Portrait Gallery using donations from Trump's Save America PAC.\nGalleries\nWhite House Historical Association presidential portraits\nFile:Gilbert Stuart - George Washington - Google Art Project.jpg|George Washington\nFile:Official Presidential portrait of John Adams (by John Trumbull, circa 1792).jpg|John Adams\nFile:Official Presidential portrait of Thomas Jefferson (by Rembrandt Peale, 1800).jpg|Thomas Jefferson\nFile:John Vanderlyn - James Madison - Google Art Project.jpg|James Madison\nFile:Samuel F. B. Morse - James Monroe - Google Art Project.jpg|James Monroe\nFile:John Quincy Adams by GPA Healy, 1858.jpg|John Quincy Adams\nFile:Ralph Eleaser Whiteside Earl - Andrew Jackson - Google Art Project.jpg|Andrew Jackson\nFile:Mvanburen.jpeg|Martin Van Buren\nFile:William Henry Harrison by James Reid Lambdin, 1835.jpg|William Henry Harrison\nFile:WHOportTyler.jpg|John Tyler\nFile:James Knox Polk by GPA Healy, 1858.jpg|James K. Polk\nFile:Zachary Taylor by Joseph Henry Bush, c1848.jpg|Zachary Taylor\nFile:George P.A. Healy - Millard Fillmore - Google Art Project.jpg|Millard Fillmore\nFile:Franklin Pierce by GPA Healy, 1858.jpg|Franklin Pierce\nFile:John Henry Brown - J. Buchanan - White House.jpg|James Buchanan\nFile:Alincoln.jpeg|Abraham Lincoln\nFile:Ajohnson.jpeg|Andrew Johnson\nFile:Ugrant.jpeg|Ulysses S. Grant\nFile:Rhayes.jpeg|Rutherford B. Hayes\nFile:Jgarfield.jpeg|James A. Garfield\nFile:Carthur.jpeg|Chester A. Arthur\nFile:Gcleveland.jpeg|Grover Cleveland\nFile:Eastman Johnson - Benjamin Harrison - Google Art Project.jpg|Benjamin Harrison\nFile:Wmckinley.jpeg|William McKinley\nFile:Troosevelt.jpeg|Theodore Roosevelt\nFile:William Howard Taft by Anders Zorn, 1911.jpg|William Howard Taft\nFile:President Woodrow Wilson (1913).jpg|Woodrow Wilson\nFile:Wharding.jpeg|Warren G. Harding\nFile:Calvin Coolidge.jpg|Calvin Coolidge\nFile:Hhoover.jpeg|Herbert Hoover\nFile:Froosevelt.jpeg|Franklin D. Roosevelt\nFile:HarryTruman.jpg|Harry S. Truman\nFile:Dwight D. Eisenhower, official Presidential portrait.jpg|Dwight D. Eisenhower\nFile:John F Kennedy Official Portrait.jpg|John F. Kennedy\nFile:Ljohnson.jpeg|Lyndon B. Johnson\nFile:Richard Nixon - Presidential portrait.jpg|Richard Nixon\n* Note: The official portraits for Gerald Ford, Jimmy Carter, Ronald Reagan, George H. W. Bush, Bill Clinton, George W. Bush, and Barack Obama were painted by artists who were not employed by the federal government at the time. These images are not in the public domain, and as such, are not included in this gallery. The full list can be seen here: [https://www.whitehousehistory.org/galleries/presidential-portraits The White House Historical Association Presidential Portraits]. The White House Historical Association portraits of Donald Trump and Joe Biden are yet to be unveiled.\nNational Portrait Gallery presidential portraits\nFile:Gilbert Stuart, George Washington (Lansdowne portrait, 1796).jpg|George Washington\nFile:John Trumbull - John Adams - Google Art Project.jpg|John Adams\nFile:Mather Brown - Thomas Jefferson - Google Art Project.jpg|Thomas Jefferson\nFile:Chester Harding - James Madison - Google Art Project.jpg|James Madison\nFile:James Monroe by John Vanderlyn, 1816 - DSC03228.JPG|James Monroe\nFile:George Caleb Bingham - John Quincy Adams - Google Art Project.jpg|John Quincy Adams\nFile:Andrew Jackson A13734.jpg|Andrew Jackson\nFile:Martin Van Buren by George Peter Alexander Healy (National Portrait Gallery).jpg|Martin Van Buren\nFile:Albert Gallatin Hoit - William Henry Harrison - Google Art Project.jpg|William Henry Harrison\nFile:George Peter Alexander Healy - Portrait of John Tyler (1859) - Google Art Project.jpg|John Tyler\nFile:JamesKnoxPolk.jpg|James K. Polk\nFile:James Reid Lambdin - Zachary Taylor - Google Art Project.jpg|Zachary Taylor\nFile:Millard Fillmore by James Reid Lambdin (National Portrait Gallery).jpg|Millard Fillmore\nFile:George Peter Alexander Healy - Franklin Pierce - Google Art Project.jpg|Franklin Pierce\nFile:James Buchanan, by George Peter Alexander Healy.jpg|James Buchanan\nFile:George Peter Alexander Healy - Portrait of Abraham Lincoln (1887) - Google Art Project.jpg|Abraham Lincoln\nFile:Washington Bogart Cooper - Andrew Johnson (after 1866) - Google Art Project.jpg|Andrew Johnson\nFile:Ulysses S. Grant by Thomas Le Clear (National Portrait Gallery).jpg|Ulysses S. Grant\nFile:Rutherford B. Hayes by Eliphalet Frazer Andrews (National Portrait Gallery).jpg|Rutherford B. Hayes\nFile:Ole Peter Hansen Balling - James Garfield - Google Art Project.jpg|James A. Garfield\nFile:Ole Peter Hansen Balling - Chester A. Arthur - Google Art Project.jpg|Chester A. Arthur\nFile:Anders Leonard Zorn - Grover Cleveland - Google Art Project.jpg|Grover Cleveland\nFile:Benjamin Harrison by Theodore C. Steele (National Portrait Gallery).jpg|Benjamin Harrison\nFile:August Benziger - William McKinley - Google Art Project.jpg|William McKinley\nFile:William Valentine Schevill - William Howard Taft - Google Art Project.jpg|William Howard Taft\nFile:Woodrow Wilson by John Christen Johansen (National Portrait Gallery).jpg|Woodrow Wilson\nFile:Warren G. Harding by Margaret Lindsay Williams (National Portrait Gallery).jpg|Warren G. Harding\nFile:Portrait of President Calvin Coolidge.jpg|Calvin Coolidge\nFile:Pres. Ronald Reagan.jpg|Ronald Reagan\n* Note: Theodore Roosevelt and the presidents following Coolidge are excluded due to their being out of the public domain. The full list may be seen at this link: [https://americaspresidents.si.edu/gallery National Portrait Gallery's \"America's Presidents\" collection]. For the article about the portrait of Barack Obama from the National Portrait Gallery, see President Barack Obama (painting).\nSee also\n*List of presidents of the United States\n*National Portrait Gallery\n*List of photographs of Abraham Lincoln\nReferences\nExternal links\n* [https://obamawhitehouse.archives.gov/photos-and-video/photogallery/official-portraits-us-presidents The White House Official Portraits of the US Presidents (archive)]\n* [http://www.whitehousehistory.org/ White House Historical Association]"
    }
  ]
}