{
  "content": [
    {
      "type": "text",
      "text": "# Port Wine, Queensland\n\n| pop                 = 27\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4724\n| area                = 1381.4\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 78.8\n| dir1                = ESE\n| location1           = Alpha\n| dist2               = 167\n| dir2                = WNW\n| location2           = Emerald\n| dist3               = 219\n| dir3                = E\n| location3           = Barcaldine\n| dist4               = 437\n| dir4                = W\n| location4           = Rockhampton\n| dist5               = 1000\n| dir5                = NW\n| location5           = Brisbane\n| lga                 = Barcaldine Region\n| stategov            = Gregory\n| fedgov              = Maranoa\n| near-n              = Pine Hill\n| near-ne             = Willows\n| near-e              = Lochington\n| near-se             = Lochington\n| near-s              = Sedgeford\n| near-sw             = Sedgeford\n| near-w              = Sedgeford\n| near-nw             = Beaufort\n}}\nPort Wine is a former rural locality in the Barcaldine Region, Queensland, Australia. In the , Port Wine had a population of 27 people.\nOn 22 November 2019, the Queensland Government decided to amalgamate the localities in the Barcaldine Region, resulting in five expanded localities based on the larger towns: Alpha, Aramac, Barcaldine, Jericho and Muttaburra. Port Wine was incorporated into Alpha.\nGeography\nThe Central Western railway line forms the northern boundary of the locality. The Capricorn Highway also traverses the north of the locality from east to west but diverges south from the railway line unlike other localities in which the railway and highway are adjacent.\nThe western branch of the Belyando River enters the locality from the south-west (Sedgeford) while the eastern branch rises in the south of the locality. The two branches merge within the locality and then flow north to exit the locality to the north-west (Beaufort). The Beylando River is a tributary to the Suttor River, and then the Burdekin River, within the North East Coast drainage basin.\nThe predominant land use is grazing on native vegetation.\nThe abandoned town of Pinehill () is in the most northern part of the locality immediately south of the Pinehill railway station ().\nHistory\nThe district was opened up by the arrival of the Central Western railway in 1883 when the Pinehill railway station was the terminus of the line for one year. In August 1883 there was a land sale for 56 town lots and 180 country lots at Pine Hill (as the town's name was then written). The sale was successful yielding  with buyers planning to build hotels and shops in the new town, although the newspaper of the day speculated that the land might be worthless in two years (presumably in the expectation that the town would not remain the terminus). The railway line opened 1 November 1883. The Queensland National Bank relocated their business from Bogantungan (the previous terminus) to Pine Hill in November 1883. The town was described in December 1883 as:\"There is dust everywhere, not only in the streets but in the houses.You breathe it, you eat it, you drink it, you sniff it, touch what you will it is there. It sometimes almost blinds you, and it will no doubt assist in producing premature deafness in some cases, for your ears get filled with dust and thus all the five senses are affected ... it ought to have been named The Dust Flat\".On 22 September 1884 the railway line had reached its new terminus Alpha and Pine Hill was described as \"unsuited for permanent settlement\". There was criticism of the Queensland Government for profiting from land sales in short-lived terminus towns like Pine Hill.\nPine Hill State School opened circa 1884 but closed in 1905. It reopened on 25 January 1926 but closed circa 1946.\nAlthough the town's streets and allotments can still be seen on maps, there is no evidence of any building there today. The town's name lives on in the locality of Pine Hill to the north of Port Wine.\nThe origin of the name Port Wine is unclear. However there are mentions of Port Wine Creek in the district from 1913.\nEducation\nThere are no schools in Port Wine. The nearest primary school is in Alpha. The nearest secondary school is in Alpha but only to Year 10. The nearest secondary school to Year 12 is in Emerald. Boarding schools and distance education are other options.\nReferences"
    }
  ]
}