{
  "content": [
    {
      "type": "text",
      "text": "# Portland Packing Company Factory\n\n| locmapin = Maine#USA\n| built =\n| architect =\n| architecture = Late Victorian\n| added = June 7, 1996\n| area = less than one acre\n| refnum = 96000651\n}}\nThe Portland Packing Company Factory is an historic factory building at 14–26 York Street in Portland, Maine. It was added to the National Register of Historic Places in 1996. Built in 1884, it was home to Maine's oldest and largest vegetable canning company until 1927. After years of neglect, it was renovated in 1995–96. It was listed on the National Register of Historic Places in 1996.\nDescription and history\nThe former Portland Packing Company Factory building is located in Portland's downtown area, on the east side of York Street opposite the end of Danforth Street. The building is a two-story brick structure, shaped roughly like a parallelogram. Due to the sloping lot, the rear (east side) of the building has a fully exposed third floor. It has a flat roof and rests on a rubblestone foundation. The main facade is divided into six similar sections, separated by wide pilasters. Each section has three bays, most of which are windows set in segmented-arch openings, and is topped by a line of corbelling, and has a band of projecting brickwork between the first and second levels. Three of the sections have a loading door instead of a window at the central bay, and there is one section where the entire ground floor is taken by a half-round opening with a large entrance sized (but no longer used) for vehicular access.\nThe Portland Packing Company was founded about 1862, by the merger of two smaller packing companies. By the turn of the 20th century, the company was Maine's largest vegetable canning business, an industry that exceeded the combined size of the state's slate, granite, and ice harvesting business in economic importance. This building was part of one of thirteen factories operated by the company in the state, and was built in 1884. Its design is attributed to Portland architect Francis H. Fassett on stylistic grounds. It functioned primarily as a storage facility, and was in 1927 sold to Blake Rounds Supply Company. After some years of vacancy and neglect, it was rehabilitated for commercial use in 1995-6.\nSee also\n*National Register of Historic Places listings in Portland, Maine\nReferences"
    }
  ]
}