{
  "content": [
    {
      "type": "text",
      "text": "# Portuguese conquest of Tangier\n\nThe Portuguese conquest of Tangier (Portuguese: Conquista de Tânger) from the Wattasid dynasty, was a campaign that took place on 28 August 1471 by Portuguese forces under the order of King Afonso V, surnamed the African.\nBackground\nThe Portuguese began their overseas expansion with the conquest of Ceuta in 1415. Since then, they had conquered more cities in North Africa, such as, Ksar es-Seghir (1458), Anfa (1471) and Asilah (1471). These conquests, allowed Portugal to go further into Muslim territory, sacking and raiding villages, which brought much profit.\nLong before 1471, the Portuguese already intended to take Tangier, having previously launched some attacks in an attempt to conquer the city. The famous disaster of Tangier, in 1437, was one of these attempts led by Prince Henry, the same man who began the Age of Discovery.\nOn the other hand, Morocco was under serious political and internal conflicts, which made it harder to fight the Portuguese threat.\nThe Conquest\nShortly after the conquest of Asilah by the Portuguese, Afonso V ordered Dom João, who was probably the son of the Duke of Bragança, to take Tangier.\nThe citizens of Tangier believed support from Muhammad al-Shaikh, the governor of Asilah, would come to assist in repelling the invading Portuguese army. However, involved in his ongoing conflict with the governor of Fez, al-Shaikh opted to sign a treaty with the Portuguese, allowing them to enter Tangier unopposed.\nFearing the same fate as Asilah, where 2,000 residents were killed and more 5,000 sold into captivity, the civilians of Tangier fled the city.\nAftermath\nDom João nominated the first captain of Tangier to be Rodrigo Afonso de Melo, who took office with a garrison after the Marquis had left with the remainder of his troops. The number of Portuguese soldiers in Tangier in 1471 numbered 40 horsemen; 470 infantry, of which 130 were crossbowmen; 10 gunners, 6 scouts.\nOver the next decades, the Portuguese would continue to attack other strategic cities, conquering many. The next generations of Muslim leaders would unsuccessfully assault Portuguese Tangier multiple times. Portuguese rule over Tangier would last until 1661, when they transferred it to England.\nSee also\n*Portuguese Tangier\n*Battle of Azemmour\n*Battle of Alcácer Quibir\n*Moroccan-Portuguese conflicts\n*Conquest of Asilah\nReferences"
    }
  ]
}