{
  "content": [
    {
      "type": "text",
      "text": "# Portugal–United Kingdom relations__disambig_1\n\nBoris Johnson with Portuguese Prime Minister António Costa in 10 Downing Street, June 2022.]]\nPortugal–United Kingdom relations are the bilateral relations relations between Portugal and the United Kingdom. The relationship, largely driven by the nations' common interests as maritime countries on the edge of Europe and close to larger continental neighbours, dates back to the Middle Ages in 1373 with the Anglo-Portuguese Alliance.\nBoth countries share common membership of the Atlantic Co-operation Pact, the Council of Europe, NATO, the OECD, the OSCE, the United Nations, the World Health Organization, and the World Trade Organization. Bilaterally the two countries have the Anglo-Portuguese Alliance, and a Double Taxation Convention.\nHistory\nbeing entertained by John I of Portugal, 14th century.]]\nThe history of the relationship between Portugal and Britain dates back to the Middle Ages. England aided Portugal in the Reconquista, and after taking Lisbon in 1147, the first King of Portugal Afonso Henriques made the Englishman Gilbert of Hastings the Bishop of Lisbon. In 1373, the Kingdom of England signed the Anglo-Portuguese Alliance, the oldest alliance in the world still in force. The alliance was formalised by the Treaty of Windsor in 1386, and in 1387 Philippa of Lancaster, the daughter of John of Gaunt, 1st Duke of Lancaster, was married to John I of Portugal.\nDuring the late 16th century, England found itself fighting against Spain which at this time was in personal union with Portugal. The English Armada was launched as part of this conflict in an attempt to restore Portuguese independence and counter both Spanish and Portuguese military ships which formed the Spanish Armada.\nA further marriage between the Portuguese and English royal families occurred with the Marriage Treaty in 1662 when Charles II of England married Catherine of Braganza, daughter of King John IV of Portugal.  Her dowry gave Britain Tangiers and Bombay, plus free trade to Portuguese colonies in Brazil and Asia. In return Charles raised a brigade of troops to serve in Portugal's Restoration War against Spain. Catherine is credited with popularising tea, which is now seen as a key part of British culture. In 1703, Portugal joined an alliance of England and the Netherlands in the War of the Spanish Succession against France and Spain. That same year, Portugal and England signed the Methuen Treaty. In the 18th century, the two nations were allies in the Seven Years' War.\nThe 19th century saw the alliance between Portugal and the United Kingdom come into effect once more when Napoleon Bonaparte built the Continental System, which Portugal refused to join, leading Napoleon to invade. In 1807 Napoleon's army attacked Lisbon, forcing the Portuguese royal family to flee to Brazil under the protection of the British Royal Navy. In the later half of the century, as Portugal's imperial power declined following Brazil's independence, there were disputes between itself and the United Kingdom in southern Africa (1890 British Ultimatum) which was a great embarrassment for the Portuguese monarchy and colonial prestige.  Portugal was one of the Allies of World War I along with Britain. While officially neutral in World War II, Portugal remained friendly to the British, a counterpart to Spain's cooperation with the Axis.\nOn 13 June 2022, the Prime Minister of Portugal and the Prime Minister of the United Kingdom signed a new agreement between the two nations in London, known as the UK-Portugal Joint Declaration on Bilateral Cooperation, thereby reinforcing the Anglo-Portuguese Alliance and confirming its status as the longest-running alliance still in force. The Joint Declaration was also signed to celebrate the 650th anniversary of the Treaty of Tagilde.\nThe 650th anniversary of the Anglo-Portuguese Treaty of 1373 was officially commemorated by both nations on 16 June 2023. The British government stated at this time that they intend to enter into \"a new bilateral Defence Agreement, due to be signed later in the year, set to take our defence cooperation to the next level.\"\nEconomic relations\nFrom 1 January 1986 until 30 December 2020, trade between Portugal and the UK was governed by the European single market, while the United Kingdom was a member of the European Union.\nTrade between the United Kingdom and Portugal is governed by the EU–UK Trade and Cooperation Agreement since 1 January 2021.\nWorld Wars\nPortugal was an official Allied Power in World War I, yet they received nothing after the Treaty of Versailles. In World War II, Prime Minister António de Oliveira Salazar was committed to the six-century-old treaty (which had been renewed in 1899). Portugal provided assistance to Spain during the Spanish Civil War, while the United Kingdom provided non-intervention and neutrality. This helped Portugal by not by declaring war but by helping Spain stay neutral and by assuming a co-belligerent status against Germany by leasing air bases in the Azores to the Allies in 1943. It cut off vital shipments of tungsten to Germany in 1944, after heavy Allied pressure. Lisbon was the base for International Red Cross operations aiding Allied POWs, and a main air transit point between Britain and the U.S.\nPost-1945\nThe states are members of NATO and Organization for Security and Co-operation in Europe. There have been several state visits between the nations.\n* The President of Portugal Francisco Craveiro Lopes paid a state visit to the United Kingdom in October 1955.\n* The President of Portugal António Ramalho Eanes paid a state visit to the United Kingdom in November 1978.\n* The President of Portugal Mário Soares paid a state visit to the United Kingdom in April 1993.\n* The President of Portugal Jorge Sampaio paid a state visit to the United Kingdom in February 2002.\n* The President of Portugal Marcelo Rebelo de Sousa paid a state visit to the United Kingdom in November 2016.\n* Queen Elizabeth II of the United Kingdom paid state visits to Portugal in February 1957, and in March 1985.\nTwinnings\nThe list below is of British and Portuguese town twinnings.\n* Bristol, Bristol and Porto, Porto\n* Barton-upon-Humber, Lincolnshire and Gondomar, Porto\n* Halton, Cheshire and Leiria, Leiria\n* Sherborne, Dorset and Sesimbra, Setúbal\n* Wellington, Somerset and Torres Vedras, Lisboa\nColonisation of Britain and Portugal in China\nIn 1557 and 1842, and in 1898, Britain and Portugal established Hong Kong and Macau on both sides of the Pearl River Estuary along the coast of Guangdong Province. Today, Hong Kong and Macau have been established a Chinese Special Administrative Regions on 1 July 1997 and 20 December 1999, and ended the rule of 156 and 442 years, respectively, for British and Portuguese.\nDisappearance of Madeleine McCann\nOn 3 May 2007, Madeleine McCann disappeared from a holiday apartment in Praia da Luz.\nRoyal marriages\n* John I of Portugal and Philippa of Lancaster, daughter of John of Gaunt (1387)\n* Catherine of Braganza and Charles II of England (1662)\nResident diplomatic missions\n* Portugal has an embassy in London and a consulate-general in Manchester.\n* The United Kingdom has an embassy in Lisbon.\nFile:Embassy of Portugal Belgrave Square.JPG|Embassy of Portugal in London\nFile:Britisch Embassy in Lisbon 02.jpg|Embassy of the United Kingdom in Lisbon\nSee also\n* Foreign relations of Portugal\n* Foreign relations of the United Kingdom\n* Disappearance of Madeleine McCann\n* Anglo-Portuguese Alliance\n* List of Ambassadors from the United Kingdom to Portugal\n* Beira Patrol\n* British migration to Portugal\n* Portuguese in the United Kingdom\nReferences\nFurther reading\n* Chapman, Annie Beatrice Wallis. The Commercial Relations of England and Portugal, 1487–1807 (Royal Historical Society, 1907)\n** Chapman, A.B.W. and V.M. Shillinton. Commercial Relations of England and Portugal (Routledge; 2005).\n* Fisher, H. E. S.  \"Anglo-Portuguese Trade, 1700–1770\". Economic History Review 16#2 1963, pp. 219–233 [https://www.jstor.org/stable/2598637 online]\n* Gregory, Desmond. The beneficent usurpers: a history of the British in Madeira (Associated University Presses, 1988).\n* Hayes, Paul. Modern British Foreign Policy: The Nineteenth Century 1814–80 (1975) pp. 133–54.\n* Horn, David Bayne. Great Britain and Europe in the eighteenth century (1967), covers 1603 to 1702; pp 269–309.\n* Ligthart, Henk, and Henk Reitsma. \"Portugal's semi-peripheral middleman role in its relations with England, 1640–1760.\" Political Geography Quarterly (1988) 7#4: 353–362.\n* Prestage, Edgar. Chapters in Anglo-Portuguese Relations (Greenwood, 1971)\n* Robson, Martin. Britain, Portugal and South America in the Napoleonic Wars: Alliances and diplomacy in economic maritime conflict (IB Tauris, 2010)\n* Richards, D.S. ''Peninsula Years: Britain's Red Coats in Spain and Portugal (2002)\n* Shaw, Luci M.E. The Anglo-Portuguese alliance and the English merchants in Portugal, 1654–1810'' (Aldershot: Ashgate, 1998)\nExternal links\n* [https://www.bhsportugal.org/ British Historical Society of Portugal]"
    }
  ]
}