{
  "content": [
    {
      "type": "text",
      "text": "# Portuguese conquest of Daman\n\nPortuguese Empire\n| combatant2        = Sultanate of Gujarat\n| commander1        =  Dom Constantino de Bragança\n*António Moniz Barreto\n*Dom Pedro de Almeida\n| commander2        = Siddi Bofeta\n| strength1         = 3,000 men100 ships.\n| strength2         = 4,000 men\n| casualties1       = Few.\n| casualties2       = 500 men\n}}\nThe Portuguese conquest of Daman was a military campaign undertaken by the Portuguese Empire against the city of Daman, in India, until then owned by the Sultanate of Gujarat. The Portuguese captured the city.\nContext\nUpon assuming office as viceroy of India, Dom Constantino de Bragança sought to reinforce the security of Portuguese Bassein by establishing a new stronghold at nearby Daman, which the Portuguese governor of India Francisco Barreto had previously obtained from the Sultan of Gujarat Ahmad Shah III as a concession but was unable to take possession of it due to the resistance of the lord of the territory, whom the Portuguese identified as Cide Bofata, who rebelled against the decision of the sultan and gathered 4000 men to defend it. The viceroy therefore sailed with a force of 100 ships to take Daman by force.\nThe campaign\nUpon landing at Daman, the Siddi Bofeta had the resident Christians beheaded for suspecting collusion with the Portuguese, and then promptly abandoned the city to retreat inland, allowing the Portuguese to capture the settlement unopposed. The first Portuguese to enter the city and fly a regimental flag was Manuel Rolim, upon which the Portuguese armada fired a gun salute. The Gujarati camped at Pernel, where they prepared a force of 2000 horsemen to resist the Portuguese. António Moniz Barreto marched out during the night with 500 men, and successfully conducted a night-time attack against the camp, driving the enemy from it with a loss of 500 men. 36 large cannon were captured, along with money and other spoils.\nBy liberality and other means, Dom Constantino compelled the native inhabitants who had fled to return to their homes. The viceroy also confirmed the rights over the customs of Daman to the neighbouring King of Sarceta, a nearby mountain ruler.\nDom Constantino then endeavoured to capture Valsad (Bulsar in Portuguese), towards which objective he dispatched Dom Pedro de Almeida with 150 horsemen and 150 infantrymen. The local inhabitants fled at the approach of the Portuguese, and a garrison of 120 men was left in the place.\nAftermath\nThe Gujarati fort was captured by the Portuguese and christened as Nossa Senhora da Purificação after the day it was captured.\nHaving secured the region, Dom Constantino established a garrison of 1200 men at Daman, upon which he returned to Goa, capital of Portuguese possessions in Asia. After the acquisition of Bassein in 1534 and Diu in 1535, Portuguese grip on navigation in the Gulf of Khambat became even tighter, making it increasingly difficult for Indian ships to travel without acquiring a cartaz, and the invicibility of Portuguese fleets terrified the Gujaratis into accepting the system. Control of the Gulf was therefore complete.\nDaman would remain in the possession of Portugal for 402 years, until 1961.\nSee also\n*Portuguese India\n*Fort of Daman\n*Fort São Jerónimo\n*Mughal–Portuguese conflicts\n**Siege of Daman (1581)\n**Mughal–Portuguese War (1692–1693)\n*Daman and Diu Portuguese Creole\nReferences"
    }
  ]
}