{
  "content": [
    {
      "type": "text",
      "text": "# Poston War Relocation Center\n\n| coordinates_footnotes           =\n| subdivision_type                = Country\n| subdivision_name                = United States\n| subdivision_type1               = State\n| subdivision_name1               = Arizona\n| established_title               = Opened\n| established_date                = 1942\n| extinct_title                   = Closed\n| extinct_date                    = 1945\n| founder                         = War Relocation Authority\n| population_total                = 17,814\n| population_as_of                = September, 1942\n}}\nThe Poston Internment Camp, located in Yuma County (now in La Paz County) in southwestern Arizona, was the largest (in terms of area) of the 10 American concentration camps operated by the War Relocation Authority during World War II.\nThe site was composed of three separate camps arranged in a chain from north to south, three miles from each other. Internees named the camps Roasten, Toastin, and Dustin, based on their desert locations. The Colorado River was about  to the west, outside of the camp perimeter.\nPoston was built on the Colorado River Indian Reservation, over the objections of the Tribal Council, who refused to be a part of doing to others what had been done to their tribe.   Army commanders and officials of the Bureau of Indian Affairs, though, overruled the council, seeing the opportunity to improve infrastructure and agricultural development (which would remain after the war and aid the reservation's permanent population) on the War Department budget and with thousands of \"volunteers\".\nThe combined peak population of the Poston camps was over 17,000, mostly from Southern California. At the time, Poston was the third-largest \"city\" in Arizona. It was built by Del Webb, who later became famous building Sun City, Arizona, and other retirement communities. The Poston facility was named after Charles Debrille Poston, a government engineer who established the Colorado River Reservation in 1865 and planned an irrigation system to serve the needs of the Indian people who were to live there.\nA single fence surrounded all three camps, and the site was so remote that authorities considered building guard towers to be unnecessary. The thousands of internees and staff passed through the barbed-wire perimeter at Poston I, which was where the main administration center was located.\nPoston was a subject of a sociological research by Alexander H. Leighton, published in his 1945 book, The Governing of Men. As Time wrote, \"After 15 months at Arizona's vast Poston Relocation Center as a social analyst, Commander Leighton concluded that many an American simply fails to remember that U.S. Japanese are human beings.\"\nEstablishment of the camp\nWhen Poston was chosen as the site for the relocation center, the Colorado River Indian Reservation Tribal Council adamantly opposed the use of their land because they did not want to be involved in inflicting the same injustice they had faced on the Japanese internees. The council was soon overridden, and the BIA and WRA jointly took control of  of tribal land and began construction in early 1942. Del Webb (Del E. Webb Construction Company) began building Poston I on March 27, and his workforce of 5,000 completed the first camp less than three weeks later. Construction on II and III began soon after, contracted to be finished within 120 days. In the meantime, Poston was partially opened on May 8, as the Parker Dam Reception Center, one of two such sites that augmented the 15 temporary \"assembly centers\" where Japanese Americans waited to be transferred to the more permanent WRA camps. Around two-thirds of Poston's population were brought directly from their homes to what was then Parker Dam, and many of these early arrivals volunteered to help complete the still-under-construction camps.\nUpon completion, the Poston site consisted of hundreds of residential barracks, a hospital, an administrative center, and guard and staff housing. The camp officially opened as the Colorado River Relocation Center on June 1, 1942, and the BIA relinquished its authority over Poston in 1943.\nLife at Poston\nLife at Poston for the Japanese internees was difficult from the start. Japanese Americans across the West Coast were uprooted from their lives and placed in different camps around the United States, including Poston. Hurried construction and lack of supplies made living conditions for internees barely suitable. Barracks were made with redwood, which shrunk more than expected and created cracks throughout the buildings. A shortage of lumber led them to build using adobe.  Weather also added to the difficulties of living in the camp because of its location in the desert. Extreme heat during the summer, reaching up to 115°F, and extreme cold in the winter, reaching as low as 35°F, added to the frustrations of internees. Outbreaks of disease were another common factor across most camps that contributed to poor quality of life. Poston was not immune to disease outbreaks, and tuberculosis was rampant with 140 reported cases. Care for these sick people was also lacking, which led to avoidable death or disability. By the end of 1942, heating systems were still not in place and clothing allowances still had not been delivered.\n...We're trapped like rats in a wired cage,\nTo fret and fume with impotent rage;\nYonder whispers the lure of the night,\nBut that DAMNED FENCE assails our sight... -->\nJapanese Americans in Poston were becoming increasingly frustrated with their new lives in the internment camp. Rising tensions came to a head in November 1942, sparked by the beating of a suspected informer on Saturday evening November 14. Two men suspected to have beaten the man were detained and under investigation. The community demanded the release of these two men, and their request was refused. Because of the denial of their request, workers went on strike on November 19. A compromise was reached by the director and the evacuees' Emergency Executive Council, ending the strike on November 24.\nUnlike the nine other concentration camps, the agricultural and animal-husbandry areas of Poston were within the perimeter fence. Schools and a number of other buildings were constructed by the internees. Many of the inhabitants participated in and created recreational activities, such as the Boy Scouts, sports teams, and jobs. Baseball teams were very common among the internees, as leagues were set up soon after opening. Scores and game summaries were recorded in the Poston daily press bulletin, along with other daily news. Some elements made life at Poston livable for internees, but their time at the camp was mostly filled with frustration and struggles to the end of their internment.\nWritten accounts\n| quote = They've sunk the posts deep into the ground\nThey've strung out wires all the way around.\nWith machine gun nests just over there\nAnd sentries and soldiers everywhere.\nWe're trapped like rats in a wired cage,\nTo fret and fume with impotent rage;\nYonder whispers the lure of the night,\nBut that DAMNED FENCE assails our sight.\nWe seek the softness of the midnight air,\nBut that DAMNED FENCE in the floodlight glare\nAwakens unrest in our nocturnal quest,\nAnd mockingly laughs with vicious jest.\nWith nowhere to go and nothing to do,\nWe feel terrible, lonesome, and blue:\nThat DAMNED FENCE is driving us crazy,\nDestroying our youth and making us lazy.\nImprisoned in here for a long, long time,\nWe know we're punished—though we've committed no crime,\nOur thoughts are gloomy and enthusiasm damp,\nTo be locked up in a concentration camp.\nLoyalty we know, and patriotism we feel,\nTo sacrifice our utmost was our ideal,\nTo fight for our country, and die, perhaps;\nBut we're here because we happen to be Japs.\nWe all love life, and our country best,\nOur misfortune to be here in the west,\nTo keep us penned behind that DAMNED FENCE,\nIs someone's notion of NATIONAL DEFENSE!\n}}\nA camp newspaper, the Poston Chronicle (formerly Official information bulletin, then Official daily press bulletin) was published weekly between May 1942 and October 1945. The name of the newspaper was selected from over 30 entries and was submitted by S. Kido, who reasoned the objective of the newspaper was, \"to record chronologically events that occur at this outpost of the desert for pioneering endeavors of the Japanese race.\"\nThe final edition of the newspaper (volume XXVII number 18) was published in English on October 23rd, 1945 and in Japanese on October 24th.\nClara Breed, a librarian from San Diego, made a point of maintaining contact with Poston camp children she had met in San Diego. She corresponded with many of them and sent them reading materials and other gifts. Their letters to her became an important record of life in the camps. Hundreds of \"Dear Miss Breed\" postcards and letters are now part of the permanent archives at the Japanese American National Museum and were the basis for a 2006 book, Dear Miss Breed: True Stories of the Japanese American Incarceration during World War II and a Librarian Who Made a Difference, by Joanne Oppenheim.\nThree reports (\"Labor\", \"Leisure\", and \"Demands\") and an autobiography written by Richard Nishimoto, an Issei worker for the University of California's Japanese American Evacuation and Resettlement Study, were published in Inside an American Concentration Camp: Japanese American Resistance at Poston, Arizona.\nA novel by Cynthia Kadohata, Weedflower, illustrates the life of a Japanese-American girl and her family after the bombing of Pearl Harbor, when they are incarcerated at Poston. The book is fiction but contains facts from interviews of incarcerees and Mohave Indians who lived on the reservation. The passage on the back of the book reads \"Twelve-year-old Sumiko's life can be divided into two parts: before Pearl Harbor and after it. Before the bombing, although she was lonely, she was used to being the only Japanese American in her class and she always had her family to comfort her. When the government forces all of the Japanese Americans living in California into internment camps, Sumiko soon discovers that the Japanese are just as unwanted on the Mohave reservation they have been shipped to as they were at home. But then she meets a young Mohave boy, who, after initial resentment, becomes her first real friend. Together, they navigate the racial and political challenges of the times, and both help each other understand the true meaning of friendship.\"\nIn ''Kiyo's Story, A Japanese American Family's Quest for the American Dream'' by Kiyo Sato, the Japanese-American author writes about her family's time while incarcerated at the Poston camp during World War II. This memoir shows how the power of family, love, and relentless hard work helped to overcome the huge personal and material losses endured by internees. Sato went on to achieve professional distinction. She is a registered nurse with a master's degree in nursing and served in the USAF Nurse Corp during the Korean War, where she rose to the rank of captain.|left]]\nPassing Poston: An American Story is a documentary recounting the experiences of four Japanese Americans in Poston: Kiyo Sato, Ruth Okimoto, Mary Higashi, and Leon Uyeda. Kiyo Sato's story (recounted above) is from when she is a young girl, and has to face the tragedy of her citizenship being taken away. Ruth Okimoto gives an interesting perspective of the internment as a young girl, as well. She remembers soldiers coming to her front door with rifles to take them to Poston, and being behind barbed wire in the middle of the desert. She reflects on this time in her life filled with anxiety through art, and is trying to understand her feelings about such a surreal part of her life. Mary Higashi relives the moment she entered the barracks and realized she would have to live with almost nothing. She also talks about how this handicapped her for life, as she was never able to finish college. Lastly, Leon Uyeda gives the opposite side of the internment story, saying he somewhat enjoyed the camp. He liked being surrounded by other Japanese people, and not having to bombarded with racial hostility.\nThe Japanese American Memorial to Patriotism During World War II, located in Washington, DC, features inscriptions of the names of those confined to the Poston center. Filmmaker Reed Leventis depicts the life at Poston camp through a short digital video \"Poston: A Cycle of Fear\". The video was supported by the National Japanese American Memorial Foundation and will be available for viewing by visitors of the Memorial in Washington, DC. http://www.njamf.com/Poston/\nMemoirs of the Japanese relocation told by a teacher at Poston Camp 1, \"Dusty Exile\" by Catherine Embree Harris, published by Mutual Publishing, 1999, a softcover book, contains photos and illustrations of life in the Poston relocation center until it closed.  Catherine Harris went on to work in the Children's Bureau of the U.S. Department of Education in Washington, DC.  She maintained contact with many of the people she met in Poston throughout her life and retirement in Honolulu, HI.\nPoston today\nA number of buildings built for the concentration camps are still in use today. Others, while still intact, are seriously deteriorated and in desperate need of maintenance. Most were removed after the camp closed, and the land was returned to the Colorado River Indian Tribes; many are still in use as utility buildings in surrounding areas, while the former residential areas have been largely converted to agricultural use. The Poston Memorial Monument was built in 1992, on tribal land with tribal support, and still stands today.\nGallery\nFile:Poston, Arizona. Construction continues on the War Relocation Authority center for evacuees of Japa . . . - NARA - 537419.tif|Construction of the Poston War Relocation Center in 1942.\nFile:Parker, Arizona. Lieutenant Commander Ralph B. Snavely of the United States Public Health Service w . . . - NARA - 536260.jpg|Lieutenant Commander Ralph B. Snavely of the United States Public Health Service managing the construction of a well on April 9, 1942.\nFile:Parker, Arizona. \"The land is plentiful. But the water is scarce\". Irrigation canals such as that . . . - NARA - 536249.jpg|An irrigation canal at the Poston Center on April 10, 1942.\nFile:Poston, Arizona. Apache Indians assist in the unloading of beds for evacuees of Japanese ancestry a . . . - NARA - 536128.tif|Apaches unloading bed frames for Japanese internees on April 29, 1942.\nFile:Poston, Arizona. Community store on first day of evacuees of Japanese ancestry at the relocation ce . . . - NARA - 537417.tif|The community store on its opening day in 1942.\nFile:Poston, Arizona. First service at the newly established post office, Post, at the relocation center . . . - NARA - 537415.tif|The first customer to use the post office.\nFile:Poston, Arizona. On the night of the arrival of the first evacuees of Japanese ancestry, religious . . . - NARA - 537416.tif|Japanese internees holding their first religious services meeting at the Poston Center.\nFile:Poston, Arizona. Cooks and chefs among evacuees of Japanese ancestry were immediately given opportu . . . - NARA - 537413.tif|The kitchen in 1942.\nFile:Poston.arizona.hideko.kimoto.marianne.nosui.aki.sakuma.tadako.yoshwaru.george.fujii.1943.jan.04.gif|Front row: Hideko Kimoto, Marianne Nosui, Aki Sakuma, Tadako Yoshwaru, George Fujii. Back row: Hidio Zumo. The legal staff at Camp 1 of the Poston Center, photographed on January 4, 1943.\nFile:Poston, Arizona. Although Poston, Arizona is soon to be closed to Japanese Americans, it has alread . . . - NARA - 539893.jpg|The Poston Center in September 1945, after it was turned over to the Colorado River Indians.\nFile:Poston, Arizona. Mrs. A.D. Franchville, Superintendent of Home Economics on detail to Poston from D . . . - NARA - 539890.jpg|Hopi Indians at the Poston Center in September 1945.\nNotable Poston internees\n* Jack Fujimoto (born 1928), the first Asian American to become president of a higher-education institution in the mainland United States\n* Tak Fujimoto (born 1939), cinematographer\n* Mikiso Hane (1922-2003), professor of history at Knox College\n* Frances Hashimoto (1943–2012), businesswoman and community activist\n* Satoshi Hirayama (1931–2021), Japanese-American baseball player for the Hiroshima Carp in Japan's Central League\n* James Kanno (1925–2017), mayor of Fountain Valley, California from 1957 to 1962\n* Nobe Kawano (1923–2018), clubhouse manager for the Los Angeles Dodgers\n* Yosh Kawano (1921–2018), clubhouse manager for the Chicago Cubs\n* Saburo Kido (1902–1977), lobbyist, attorney, and newspaper editor\n* Robert Kinoshita (1914–2014), artist, art director, and set and production designer\n* Doris Matsui (born 1944), member of the U.S. House of Representatives\n* George Matsumoto (1922–2016), architect and educator\n* Isamu Noguchi (1904–1988), artist and landscape architect\n* Vincent Okamoto (1943–2020), decorated veteran of the Vietnam War and judge\n* Daniel Okimoto (born 1942), academic and political scientist\n* Emiko Omori (born 1940), cinematographer and director\n* Sandra Sakata (1940–1997), fashion designer and fashion retailer\n* Ben Sakoguchi (born 1938), artist\n* Roy I. Sano (born 1931), retired bishop of the United Methodist Church\n* Hideo Sasaki (1919–2000), landscape architect\n* Kiyo Sato (born 1923), writer\n* Noriko Sawada (1923–2003), writer and civil-rights activist\n* T.K. Shindo (1890–1974), photographer\n* Teru Shimada (1905–1988), actor\n* Kobe Shoji (1920–2004), an executive in the sugarcane industry, veteran of the 442nd Infantry Regiment, and athlete\n* Chizuko Judy Sugita de Queiroz (born 1933), artist and art educator\n* Shinkichi Tajiri (1923–2009), sculptor\n* Ronald Phillip Tanaka (1944–2007), poet and editor\n* A. Wallace Tashima (born 1934), the first Japanese American to be appointed to a United States Court of Appeals\n* Hisako Terasaki (born 1928), etcher\n* Tamie Tsuchiyama (1915–1984), worked on behalf of the Japanese-American Evacuation and Resettlement Study\n* George Uchida (1925–2004), judoka, wrestler, author, and coach\n* Hisaye Yamamoto (1921–2011), short-story writer\n* Mia Yamamoto (born 1943), transgender criminal-defense attorney and civil-rights activist\n* Wakako Yamauchi (1924–2018), playwright\nSee also\n* Japanese American Internment\n* Other camps:\n** Gila River War Relocation Center This center was also located on an Indian Reservation in Arizona.\n** Granada War Relocation Center\n** Heart Mountain War Relocation Center\n** Jerome War Relocation Center\n** Manzanar National Historic Site\n** Minidoka National Historic Site\n** Rohwer War Relocation Center\n** Topaz War Relocation Center\n** Tule Lake War Relocation Center\nReferences\n* A. A. Hansen and B. K. Mitson, 1974. Voices Long Silent: An Oral Inquiry into the Japanese Evacuation.  This study and many others interviewing former internees at several relocation centers are part of the research of the Japanese American World War II Evacuation History Project, at California State University, Fullerton. Professor Hansen has published extensively in this research arena.\n* For a historical interpretation by a tribal member of the Colorado River Indian Reservation, see his chapter on Poston: Dwight Lomayesva, 1981. \"The Adaptation of Hopi and Navajo Colonists on the Colorado River Indian Reservation,\" Master of Social Sciences Thesis (Fullerton, CA: California State University, Fullerton).\nExternal links\n* [https://calisphere.org/collections/26947/?q=&rq=BANC+MSS+69%2F5+p Writings by students at the Poston War Relocation Center, 1942-1943], The Bancroft Library\n* [http://www.oac.cdlib.org/findaid/ark:/13030/tf0r29n4nc/ Rosalie H. Wax Papers], The Bancroft Library\n* [https://calisphere.org/item/ark:/28722/bk0016z543m/ Yukiye Kusuda letters to Robert W. Carnachan, 1942-1944], The Bancroft Library\n* [https://web.archive.org/web/20030307134007/http://www.cr.nps.gov/history/online_books/anthropology74/ce10.htm  National Park Service book on internment camps: \"Poston War Segregation Center\" section]\n* [http://www.postonpreservation.org/ Poston Preservation Project] — by former internees and their descendants.\n* [http://www.oac.cdlib.org/ark:/28722/bk0016z3v0v/?brand=oac4 Julia Kiriloff Grill correspondence, 1940-1948], The Bancroft Library\n* [http://encyclopedia.densho.org/Poston%20%28Colorado%20River%29/ Densho Encyclopedia: \"Poston (Colorado River)\"]\n* [http://encyclopedia.densho.org/Poston%20Chronicle%20%28newspaper%29/ Densho Encyclopedia: \"Poston Chronicle\" (camp newspaper)]\n* [https://calisphere.org/item/ark:/28722/bk0016z4d15/ Material relating to the Poston Cooperative Enterprises, Inc., Colorado River Relocation Center, Poston, Ariz., 1943-1945], The Bancroft Library\n* [https://calisphere.org/search/?q=BANC+MSS+92%2F834+c Mimeograph material relating chiefly to the Young Buddhist Association's activities during the World War II internment, ca.1943-1945], The Bancroft Library\n* [https://www.rafu.com/george-taniguchi/]\n* [http://www.discovernikkei.org/en/journal/2020/8/10/george-taniguchi-1/]\n* [https://www.drf.com/news/former-jockey-racing-official-george-taniguchi-dies-94]"
    }
  ]
}