{
  "content": [
    {
      "type": "text",
      "text": "# Postage stamps and postal history of the Democratic Republic of the Congo\n\nThis is a survey of the postage stamps and postal history of the Democratic Republic of the Congo, formerly Zaire and the Belgian Congo.\nColonial period\nThe Congo Free State was established in 1885 as a personal initiative of Leopold II of Belgium, which was formally annexed, becoming the Belgian Congo, in 1907. Both entities issued their own stamps.\nFile:Stamp Belgian Congo 1894 50c.jpg|An 1894 stamp of the Congo Free State\nFile:Belgian congo 1915 issue-25c.jpg|A 1915 stamp of the Belgian Congo\nRepublic\nIn 1960, the Belgian Congo became independent as the Republic of the Congo. On 1 August 1964, the state's official name was changed to the Democratic Republic of the Congo.\nZaire\nIn 1971, the state's name changed to Zaire. The first stamps of Zaire were issued on 18 December 1971.\n1997-present\nIn 1997 the country's name reverted to the Democratic Republic of the Congo.\nKatanga issues\nThe State of Katanga seceded from the Republic of the Congo and, during its three years of independence, produced its own stamps and issues overprinted on earlier stamps of the Belgian Congo and the Republic of the Congo.\nSouth Kasai issues\nFor a short period in 1960–61, South Kasai was a secessionist region in the south central area of the country that issued overprinted Belgian Congo stamps.\nFile:Stamp_Katanga_1961_fair_50c.jpg|Katanga 50c stamp of 1961\nSee also\n*Postage stamps and postal history of Belgium\nReferences\nFurther reading\nBelgian Congo\n* Adair, T. Stewart. The Belgian Congo: The Stamps of the Belgian Congo. London: A.J.Sefi, 1925\n* Cock, Andre de. Le Congo Belge et ses marques postales, evaluation des cachets du Congo Belge. Antwerp: R-Editions, 1986  217p. Originally published in 1931.\n* Du Four, Jean and Rene Goffin. ''Congo, cinquante ans d'histoire postale. s.l.: Editions de la Revue Postale, 1962 507p.\n* Gallant, Roger. Histoire du service postal au Congo Belge = De geschiedenis van de postdienst in Belgisch Kongo: 1886-1960. Brussels: The Author, 2005 2 volumes (Volume 2 is subtitled: De Postzegels)\n* Gudenkauf, Abbe G. Belgian Congo: Postal History of the Lado Enclave, 1897-1910. Newbury: Philip Cockrill, 1985 144p.\n* Keach, R. H. A Philatelic Bibliography of Belgian Congo & Ruanda Urundi. Tadworth, Surrey: R. Keach, 1976 85p.\n* Mallet-Veale, H. The Stamps of the Belgian Congo and Belgian East Africa. Johannesburg: The South African Philatelist, 1928 39p.\n* Oth, Jean. Le Congo belge en 1940-1950. Neufchateau? : The Author?, 1992 51p.\nRepublic of Congo\n* Frenay, J. M. Histoire Postale de l’Etat Indépendant du Congo. ?: The Author, 1991 30p.\nKatanga\n* Donegan, George J., Jr. Donegan's Katanga philatelist: a specialized catalogue of the \"Etat du Katanga\" postal issues. Springfield, MO.: G.J. Donegan, Jr., 1964 27p.\n* Hoorens, Emile R. Histoire postale de l'Etat du Katanga 1960-1963. Brussels: E.R. Hoorens, 1997 197p.\nSouth Kasai\n* Dufresne, André. \"Les Timbres-Poste Du Sud-Kasai\". Les Cahiers de l’Académie ─ OPUS XV''. p.&nbsp;153-159.[http://aqep.info/opus/15f.pdf]\nExternal links\n* [http://www.congoposte.be/ Congo Belge et Ruanda-Urundi: Septante-sept ans d'histoire postale en Afrique centrale]\n*[https://www.africafederation.net/Katanga_Stamps.htm Katanga Postal Authority]\n*[https://web.archive.org/web/20150504212626/http://www.linns.com/howto/refresher/country_20050328/refreshercourse.aspx Linns Refresher Courses - Name changes]"
    }
  ]
}