{
  "content": [
    {
      "type": "text",
      "text": "# Poznań Voivodeship (14th century – 1793)\n\nPoznań Voivodeship 14th century to 1793 (, ) was a unit of administrative division and local government in Poland from the 14th century to the Second Partition of Poland in 1793. It was part of the Greater Poland Province.\nGeography\nThe voivodeship comprised the western part of the former Duchy of Greater Poland with its historic capital Poznań. As the westernmost part of the Polish–Lithuanian Commonwealth it bordered on the Neumark region of the Imperial Margraviate of Brandenburg in the west, the Bohemian crown land of Silesia in the south and the Duchy of Pomerania in the north. The adjacent Greater Polish area in the east belonged to the Kalisz Voivodeship.\nThe Northern outpost of Drahim was pawned to Brandenburg-Prussia according to the 1657 Treaty of Bromberg. In the course of the First Partition of Poland in 1772, the voivodeship lost the northern area around Wałcz to the Prussian Netze District, the remains were annexed in 1793 and incorporated into the province of South Prussia.\nZygmunt Gloger in his monumental book Historical Geography of the Lands of Old Poland provides this description of Poznań Voivodeship:\"Poznań Voivodeship, together with Kalisz and Kuyavia, was in the ancient times inhabited by the Polans. As early as the times of Bolesław Chrobry, the Land of Poznań had its own voivodes, while the city of Poznań itself was main gord of the ancient Lechia (...) When, following the Testament of Bolesław III Krzywousty Poland was divided among his sons, for more than 150 years Greater Poland was a separate duchy. In 1305 it was united with the Kingdom of Poland, by Wladyslaw Lokietek, who turned it into a voivodeship (...) In 1346, King Casimir the Great took control of the Wschowa Land, uniting it with Poznań Voivodeship.\nThe voivodeship, split by the Warta river into two almost equal halves, made western part of Greater Poland. Its area was 294 sq. miles, divided into Poznań County (162 sq. miles), Kościan County (92 sq. miles), Wałcz County behind the Noteć river (30 sq. miles), and the Land of Wschowa (9 sq. miles). In the mid-16th century, it had 259 Roman-Catholic parishes. Most densely populated was the Land of Wschowa, while Wałcz County was covered by vast forests.\nPoznań Voivodeship had nine senators. These were: the Bishop of Poznań, the Voivode of Poznań and the Castellan of Poznań, as well as six minor castellans – those of Miedzyrzecz, Rogoźno, Srem, Przemecz, Krzywin and Santok. The Land of Wschowa had its own starosta, as well as its separate civil servants (...) The sejmiks for both Poznań and Kalisz Voivodeships took place in Środa Wielkopolska, where the two voivodeships elected 12 deputies to the Sejm, and 4 deputies to the Greater Poland Tribunal at Piotrków Trybunalski.\"\nMajor towns\n, the capital of the voivodeship, in the 17th century]]\nThe largest city of the voivodeship was the royal city of Poznań, which as one of the largest and most influential cities of entire Poland enjoyed voting rights during the Royal free elections.\n(in alphabetical order):\nAdministration\nGreater Poland general governor (Starosta Generalny) seat:\n* Poznań\nVoivodeship governor (Wojewoda) seat:\n* Poznań\nVoivodes:\n* Jan Opaliński, 1628–1637\n* Krzysztof Opaliński, 1637–1655\n* Józef Potocki, 1743–1751\n* Stanisław Potocki, 1756–1760\nGeneral council (Sejmik Generalny) for Greater Poland seat:\n* Koło\nRegional council (Sejmik) seat:\n* Środa Wielkopolska\nAdministrative division:\n* Poznań County (Powiat Poznański), Poznań\n* Kościan County (Powiat Kościański), Kościan\n* Wałcz County (Powiat Walecki), Wałcz\n* Wschowa Land (Ziemia Wschowska), Wschowa\nReferences\nSources\n* [http://literat.ug.edu.pl/glogre/0017.htm Poznań Voivodeship, description by Zygmunt Gloger]\npt:Voivodia de Poznań"
    }
  ]
}