{
  "content": [
    {
      "type": "text",
      "text": "# Prasanna Jayawardene\n\n|         birth_place = Colombo, Sri Lanka\n|              batting = Right-handed\n|                role = Wicket-keeper\n|       international = true\n|   internationalspan = 2000–2015\n|       testdebutdate = 28 June\n|       testdebutyear = 2000\n|    testdebutagainst = Pakistan\n|             testcap = 83\n|        lasttestdate = 3 January\n|        lasttestyear = 2015\n|     lasttestagainst = New Zealand\n|        odidebutdate = 4 April\n|        odidebutyear = 2003\n|     odidebutagainst = Pakistan\n|              odicap = 114\n|         lastodidate = 22 May\n|         lastodiyear = 2007\n|      lastodiagainst = Pakistan\n|            odishirt = 3\n|               club1 = Sebastianites C&AC\n|               year1 = 1999&ndash;present\n|               club2 = Nondescripts\n|               year2 = 1998&ndash;2005\n|               club3 = Colombo\n|               year3 = 2001&ndash;2003\n|               club4 = Sinhalese\n|               year4 = 2000&ndash;2001\n|             columns = 4\n|             column1 = Test\n|            matches1 = 58\n|               runs1 = 2,124\n|            bat avg1 = 29.50\n|           100s/50s1 = 4/5\n|          top score1 = 154*\n|      hidedeliveries = true\n|  catches/stumpings1 = 124/32\n|             column2 = ODI\n|            matches2 = 6\n|               runs2 = 27\n|            bat avg2 = 5.40\n|           100s/50s2 = 0/0\n|          top score2 = 20\n|  catches/stumpings2 = 4/1\n|             column3 = FC\n|            matches3 = 228\n|               runs3 = 9,274\n|            bat avg3 = 29.61\n|           100s/50s3 = 14/39\n|          top score3 = 229*\n|  catches/stumpings3 = 513/106\n|             column4 = LA\n|            matches4 = 123\n|               runs4 = 2,031\n|            bat avg4 = 21.37\n|           100s/50s4 = 0/8\n|          top score4 = 70\n|  catches/stumpings4 = 126/54\n|                date = 16 September\n|                year = 2015\n|              source = http://www.espncricinfo.com/srilanka/content/player/49236.html ESPNcricinfo\n|nickname=Peach}}\nHewasandatchige Asiri Prasanna Wishvanath Jayawardene (Sinhala: හේවාසන්දච්චිගේ ආසිරි ප්‍රසන්න විශ්වනාත් ජයවර්ධන) (born 10 September 1979), commonly known as Prasanna Jayawardene is a former Sri Lankan cricketer, who played Test and ODIs for Sri Lanka Cricket team. He is a right-handed batsman and a wicketkeeper, where he served as the permanent wicketkeeper in tests.\nThough he hasn't announced his retirement from international cricket, he has not played international cricket after April 2015.\nHe played club cricket for Woodhall Spa Cricket Club in Lincolnshire as recently as 2025.\nDomestic career\nHe made his Twenty20 debut on 17 August 2004, for Nondescripts Cricket Club in the 2004 SLC Twenty20 Tournament.\nInternational career\nIn 1998, a baby-faced Jayawardene was selected to tour England after promising domestic form, though he didn't go on to play a match. He was regularly touted as \"the next Sri Lankan cricketer\", working as an understudy to full-time keeper Romesh Kaluwitharana. He would go on to make his debut against the touring Pakistanis in June 2000, though he played no role in the match as Sri Lankan openers Sanath Jayasuriya and Marvan Atapattu batted for more than a day, and rain washed out the game leaving no chance for Prasanna to bat or keep. However, the meteoric rise of Kumar Sangakkara by the time South Africa toured later in the year in addition to Kaluwitharana being the team's reserve keeper of choice meant he would not play any more matches for multiple years.\nHowever, by mid-2002 the Sri Lankan selectors decided to start playing Sangakkara as a specialist batsman, opening a slot for an extra keeper, though Kaluwitharana being first reserve played the majority of matches. As a result, Jayawardene would only play two series over the next five years; one in 2002 against a touring Bangladeshi team of which the decision to permit Test status to was doubted, where he scored 5 and a duck in two innings, and one in 2004 against a Zimbabwean side without any notable players (the majority of the team had either left or been fired by a board in political turmoil) and which would, partially as a result of the series, have Test status stripped just a year later, with Prasanna scoring just 4 runs in a series where Sri Lanka scored over 500 runs in every innings they batted. To make things worse for Jayawardene, Sri Lanka began choosing a specialist keeper less frequently. Up to this date his batting average was just 3.\nHowever, in 2007, his fortunes changed for the better, as the retirement of Kaluwitharana the year prior and the decision by Sri Lanka to allow a second keeper to be selected gave him another chance to play Test cricket. He would grasp this opportunity with both hands, scoring decently (while he didn't score a 50 he averaged around 30) in series against New Zealand and South Africa before getting a breakout 120 against Bangladesh in a game of multiple firsts, bowler Chaminda Vaas batting alongside Jayawardene for six hours as they both registered their first Test century.\nThis innings along with a promising series against South Africa later in the year propelled Jayawardene into the regular team, though he was somewhat weak compared to batters like Tillakaratne Dilshan, Thilan Samaraweera, captain Mahela Jayawardene, Sangakkara and veterans Jayasuriya and Atapattu. He never really had an amazing run of form over his main stint as Sri Lankan keeper, though a career-best 154* against India in 2009, appeared to bring on a raise in form, scoring fifties often as 2010 and 2011 came about, and managing his third and fourth centuries against Pakistan and England respectively.\nHowever, Jayawardene's form began to drop off significantly in 2012, and coupled with his senior age (33) and the retirements of Muttiah Muralitharan and Mahela among others, Sri  Lanka began to experiment with young keepers Kaushal Silva, Dinesh Chandimal and later Niroshan Dickwella, and an injury sustained from a Mitchell Johnson bouncer against Australia in late 2012 was the nail in the coffin. Chandimal, keeping in tandem with Dickwella, played particularly well, pushing Prasanna out of the team for a full year even after he had recovered, and he went on to play just three more series for Sri Lanka, against Pakistan in late 2013 (scoring 161 runs at an average of 40.25), against England in mid-2014 (scoring just 14 runs in one match at 7.00) and against New Zealand in late 2014-2015 (49 runs at 12.25). While he hasn't officially retired from international nor domestic cricket, the series in New Zealand was the last time he was picked in a Sri Lankan squad and he last played in domestic cricket in the Sri Lanka Premier League.\nPrasanna also has the 6th most stumpings in Test history with 32, ahead of Australian Ian Healy (29) and behind Adam Gilchrist (37).\nReferences"
    }
  ]
}