{
  "content": [
    {
      "type": "text",
      "text": "# Pre-19th-century trade catalogs\n\nTrade catalogs, originating in the late sixteenth and early seventeenth centuries primarily in Europe, are print catalogs which advertise products and ideas in words, illustrations, or both. They included decor, ironwork, furniture, and kitchenware. If a trade catalog included illustrations, the items were commonly engraved or hand-drawn and replicated.\nCatalogs spread through trade, by travelers or traveling merchants. They contained lists of items from different places, with local catalogs advertising services. Because some communities had small networks of trade and commerce, the origin of the first trade catalog is unknown. Catalogs showcasing furniture designs, headed by designer Thomas Chippendale, became popular in the mid-1700s.\nPrinting press\nTrade catalogs and pattern books were propelled by the printing press. Although its origin is unknown, historians believe that the oldest known version was invented in China around 1000 AD. Printing was refined in China in 1297, leading to the mass production of books, and 150 years later the Gutenberg printing press appeared in 1440 in Germany. With Gutenberg's reinvention of the printing press, printing spread throughout Europe; this allowed the efficient production of books, pamphlets, and other typed works.\nHistory\nAccording to James Symonds, trust had to exist between the customer and the catalog; customers had to know that the way the items were described (or illustrated) was the way they would receive them. Catalog products might not have been sold, indicating that illustrations shown may not have physically existed.\nEngland\nEngland's first true trade catalogs that were not a culmination of designs or ideas were for metalware, and appeared in the 1760s. Catalogs typically did not have a name or company attached to them, a strategem to keep the sources of products concealed from competitiors. Because a limited number of catalogs was produced and passed through many consumers, many covers of these books bound did not remain intact. Illustrations in the catalogs were rarely colored, and many were reused.\nWith the rise of Rococo in England, many more engravings explored and depicted complex decor and patterns in catalogs. These designs were not copies of print illustrations, however, but were original ideas influenced by catalog depictions.\nEnglish craftsman Thomas Chippendale (1718-1779) published Gentleman and Cabinet Maker’s Director in 1754, considered the earliest comprehensive collection of ideas in a catalog. Chippendale designed furniture in many styles, including French Rococo, Gothic, Chinese, English, and Queen Anne style.\nJosiah Wedgwood (1730-1795) was an English potter who also popularized the spread of trade catalogs; his first catalog, Queen’s Ware, was published in 1774. Wedgwood targeted upper-class customers, believing that selling to the wealthy would also influence into buying his ceramics.\nThomas Sheraton (1751-1806) was another key figure in the popularity and competitiveness of designs in trade catalogs. Publishing his first book (The Cabinet-maker and Upholster’s Drawing Book) in 1791, the furniture designer is considered one of the movement's leaders in the spread of mainstream design.\nScotland\nThe widespread use of trade catalogs in Scotland came from the newly-popular Chippendale in the mid-1700s. Their spread is attributed to James Rannie, a wealthy businessman who was responsible for many Scottish subscriptions to Chippendale's Director. Many subscribers were not wealthy, but were employed in agriculture.\nUnited States\nPrinting did not reach North America until 1639, beginning in the present-day United States. Early presses were scarce, making catalogs difficult to obtain. Furniture and decor largely came from England through trade catalogs from manufacturers such as Chippendale and Sheraton. Trade ceased during the American Revolutionary War, decreasing the number of trade catalogs from overseas, and colonial-style furniture began to flourish.\nDocumented catalogs\nCollections of trade catalogs are part of the Winterthur Library Digital Collections.\nFile:Candelabra_designs.jpg|From a 1790 candelabra and escutcheon catalog|alt=Drawings of metalwork\nFile:Composition_ornament_designs.jpg|From a 1785 composition ornament catalog|alt=Drawings of round ornaments\nFile:Escutcheon_designs.jpg|From a 1780 doorknob and escutcheon catalog|alt=A page with many drawings\nFile:Dresser_design.jpg|From William Gomm & Son & Co.'s 1761 furniture and ornament-details catalog|alt=Drawing of a four-drawer dresser\nFile:Drawer_pulls_designs.jpg|From a 1780 furniture-hardware catalog|alt=Drawings of six drawer pulls and an escutcheon\nFile:Georgian_designs.jpg|From a 1780 Georgian-design catalog|alt=Four drawings of objects\nReferences"
    }
  ]
}