{
  "content": [
    {
      "type": "text",
      "text": "# Prefabs in the United Kingdom\n\n, as it would have appeared in 1950]]\nPrefabs (prefabricated homes) were a major part of the delivery plan to address the United Kingdom's post–World War II housing shortage. They were envisaged by war-time prime minister Winston Churchill in March 1944, and legally outlined in the Housing (Temporary Accommodation) Act 1944.\nTaking the details of the public housing plan from the output of the Burt Committee formed in 1942, the wartime coalition government under Churchill proposed to address the need for an anticipated 200,000 shortfall in post-war housing stock, by building 500,000 prefabricated houses, with a planned life of up to 10 years, within five years of the end of the Second World War. The Housing (Temporary Accommodation) Act 1944 aimed to deliver 300,000 units within 10 years, within a budget of £150 million.\nThrough use of the wartime production facilities and creation of common standards developed by the Ministry of Works, the programme got off to a good start and, of 1.2 million new houses built between 1945 and 1951 when the programme officially ended, 156,623  prefab houses were constructed. Today, a number survive, a testament to the durability of a series of housing designs and construction methods only envisaged to last 10 years. On the back of this scheme, local authorities developed non-traditional building techniques, which included some prefabrication, notably pre-cast reinforced concrete (PRC), to fulfil the underestimated demand.\nContext\nThe combined effect of war and a lack of materials had a huge impact on the volume and quality of available housing stock. Contemporary estimates suggest that there was a shortage of 200,000 houses nationally. The result was the repeat of a strategy deployed by the  government following the First World War, namely a country-wide investment programme in a national public house building scheme.\nTo tackle the problem Prime Minister Winston Churchill set up the cross-party Burt Committee in 1942, which sent British engineers to the United States the following year to investigate how Americaone of the main wartime advocates of prefabricated constructionintended to address its needs for post-war housing.\nThe outcome of the Burt Committee was that it favoured prefabricated housing as a solution to the problems. In a radio broadcast in March 1944, as the war in Europe was ending, Churchill announced a Temporary Housing Programme, known officially as the Emergency Factory Made or EFM housing programme. The vision was for a Ministry of Works (MoW) emergency project to build 500,000 'new-technology' prefabricated temporary houses directly at the end of the war:\nThis vision and promise passed into law as the Housing (Temporary Accommodation) Act 1944, which planned to build 300,000 prefab houses in Britain over the next four years, with a structural lifetime of between 10 and 15 years. In fact just over 150,000 were built.\nBy 1951 the EFM housing programme and its offshoots had created one million new council houses, resulting in 15 per cent of all the dwellings in Britain being state-owned, more than the proportion in the Soviet Union at that time.\nStandards\nThe Ministry of Works created research institutes, standards and competition authorities that resulted in core building regulations.\nAll approved prefab units had to have a minimum floor space of , and be a maximum of  wide to allow for transportation by road.\nThe most innovative creation of the Ministry of Works was what was termed the \"service unit,\" something which they initially specified all designs had to include. A service unit was a combined back-to-back prefabricated kitchen that backed onto a bathroom, pre-built in a factory to an agreed size. It meant that the unsightly water pipes, waste pipes and electrical distribution were all in the same place, and hence easy to install.\nThe service unit also contained a number of innovations for occupants. The house retained a coal fire, but it contained a back boiler to create both central heating as well as a constant supply of hot water. For a country used to the rigours of the outside lavatory and tin bath, the bathroom included a flushing toilet and man-sized bath with hot running water. In the kitchen were housed such modern luxuries as a built-in oven, refrigerator and Baxi water heater, which only later became commonplace in all residential accommodation.\nAll prefabs under the housing act came pre-decorated in magnolia, with gloss-green on all additional wood, including the door trimmings and skirting boards.\nTo speed construction many were developed on the side of municipal parks and green belts, giving their residents, who had most often come from cramped shared rooms in inner cities, the feeling of living in the rural countryside.\nTemporary Housing Programme\nThe Ministry of Works built a small estate off Edward Road, Northolt, in 1944 to demonstrate to the construction industry, parliament and the media the principles of their standards, and show that houses and flats could be built of concrete as well as brick. The highlight of the show was the live construction over two days of a Sir-Frederick-Gibberd-designed BISF house, under the watchful 24-hour eyes of the media.\nThe Ministry of Works then held a public exhibition of five types of prefab at the Tate Gallery in London, in 1944:\n* Two timber-framed designs, the Tarran and the Uni-Seco\n* One steel-framed with asbestos panels, the Arcon\n* One aluminium prefab, made from surplus aircraft materials, the AIROH\nThis proved so popular that the Tate held two follow-up exhibitions in 1945. In April 1945, in a public relations exercise, an Arcon was completed and handed over to its new occupants by 22 men in under eight hours, and in May an AIROH was erected on a bombed site in London's Oxford Street in just four hours.\nWhile the cost of the prefabs was met directly by the Ministry of Works, the sites and utility infrastructure costs were the responsibility of the local authority. The 1944 Act had envisaged problems in obtaining access to sites quickly and hence slowing the programme, and so gave councils the authority to claim sites where two or more prefabs could be constructed. Councils were also given power over the site once identified, even before purchase was completed. The programme delivered quick housing, with properties going up at the rate in some authorities of 1.75 units per site per day, and the 100,000th house completed in January 1947 in Clapham, South London.\nHowever, the cost of the programme at £150 million met with opposition at many levels, both politically and economically. In August 1945 the Portal was abandoned for lack of steel, while the Uni-Seco was effectively stopped from production from the middle of 1946 through lack of supply of wood. It was stated that both the Arcon and AIROH were above budget; the British prefabs in both manufacture and construction costs combined turned out to be more costly than traditionally built brick houses, while the American sourced units were cheaper. The population allocated prefabs were also concerned that prefabs were a permanent over a temporary solution, with the postwar radio comedy Stand Easy! with Charlie Chester creating popular skit-chants on the subject, including:\nAs the economy began to recover, the cost of the unwanted post-war excess production reduced and hence costs of manufacture rose sharply. When the Chancellor allowed the pound to float freely against the dollar from 1947 onwards, a programme costing 60 per cent of government income was severely cut back.\nProduction of the major types by local authorities continued until 1947, but only 170,000 of the 500,000 units promised were completed by 1951, when Churchill's new Conservative government took over. The prefab programme did not contribute greatly to the one million homes that the Attlee government succeeded in building.\nPre-cast Reinforced Concrete\nDespite the construction of 156,622 temporary housing programme prefabs the United Kingdom still faced an acute housing shortage, and waiting lists soared in urban areas. Local authorities then took the lead in building new homes despite a shortage of materials and the hard winter of 1947. New estates were created and established ones expanded. To meet the shortage and bring the cost of housing down, a new form of construction was pioneered, commonly called 'PRC' (Pre-cast Reinforced Concrete).\nPre-cast Reinforced Concrete houses were largely made from concrete panels reinforced with steel then bolted together or constructed with a steel frame. They were quick to assemble and required less skilled labour than traditional build.\nDifferent builders marketed new PRC designs such as the Airey, the Cornish, the Wates, the Unity, the Reema, the Tarran- a development of the Tarran THP design, the Woolaway and Parkinson types. The city of Leeds built the highest number of PRCs. They were similar to the prefabs in that they were built by non-traditional methods from components made in a factory but unlike the prefabs they were permanent, having a 60-year expected life.\nThe construction of these new quick-build houses seemed like part of the solution to the housing crisis at the time. From 1945 to 1955, 1.5 million homes were completed, relieving some of the housing demand. The percentage of people renting from local authorities had risen from 10 per cent in 1938 to 26 per cent in 1961.\nTotal production\n{| class=\"wikitable\"\n!align=center|Name\n!width=\"100\" align=center| Programme\n!width=\"100\" align=center| Sponsor\n!width=\"100\" align=center| Designer\n!width=\"100\" align=center| Frame\n!width=\"100\" align=center| Walls\n!width=\"100\" align=center| Roof\n!width=\"100\" align=center| Bedrooms\n!width=\"100\" align=center| Units\n!align=center|Cost of Construction\n!align=center|Notes\n|-\n|Airey\n|\n|\n|\n|Concrete (PP&P)\n|\n|\n|\n|25,567\n|£???\n|\n|-\n|AIROH\n|EFM THP\n|Aircraft Industries\n|\n|Aluminium\n|Aluminium or clad\n|Aluminium or Asbestos\n|3\n|54,000\n|£1,610\n|Could be erected in 4hrs. 675 sq ft\n|-\n|Arcon\n|EFM THP\n|\n|Joseph Walsh\n|\n|Asbestos\n|\n|2\n|46,000\n|£1,209\n|Distinctive curved roof\n|-\n|BISF (Permanent House)\n|\n|BISF\n|Sir Frederick Gibberd\n|Steel\n|Steel/ Concrete\n|Steel\n|3+\n|31,516\n|£1,304 + £137\n|\n|-\n|Cornish Unit\n|\n|\n|\n|Concrete (PP&P)\n|\n|\n|\n|23,173\n|£???\n|\n|-\n|Howard\n|\n|\n|\n|\n|\n|\n|2+\n|1,404\n|£???\n|\n|-\n|Laing \"Easiform\"\n|\n|Laing\n|Laing\n|Concrete (LS)\n|Concrete (LS)\n|Clay Tile\n|2+\n|\n|£???\n|\n|-\n|Mowlem\n|\n|Mowlem\n|Mowlem\n|Concrete (LS)\n|Concrete (LS)\n|Clay Tile\n|2+\n|\n|£???\n|\n|-\n|Newland & Kingston\n|\n|Tarran Industries\n|\n|Concrete (LS)\n|\n|\n|2+\n|2,681\n|£1,022\n|\n|-\n|Orlit\n|\n|\n|\n|Concrete (PP&P)\n|\n|\n|\n|8,449\n|£???\n|\n|-\n|Phoenix\n|THP\n|Laing\n|Laing\n|\n|\n|Steel plate over rolled steel poles\n|2\n|43,206\n|£1,200\n|\n|-\n|Portal\n|EFM\n|Automobile industries\n|\n|\n|\n|\n|\n|\n|\n|Original prototype 616 sq ft\n|-\n|Reema\n|\n|\n|\n|Concrete (LS)\n|\n|\n|\n|7,067\n|£???\n|\n|-\n|Scotswood\n|\n|\n|\n|Wood\n|\n|\n|\n|1,067\n|£???\n|\n|-\n|Tarran\n|THP\n|Tarran Industries\n|\n|Wood\n|Pre-cast concrete\n|\n|\n|\n|£???\n|\n|-\n|Tarran variants\n|\n|Tarran Industries\n|\n|Wood\n|Pre-cast concrete\n|\n|\n|\n|£???\n|A permanent house\n|-\n|Smiths Building Systems\n|\n|\n|\n|Concrete (LS)\n|\n|\n|\n|3,877\n|£???\n|\n|-\n|Spooner\n|\n|\n|\n|Wood\n|\n|\n|\n|3,507\n|£???\n|\n|-\n|Stent\n|\n|\n|\n|Concrete (LS)\n|\n|\n|\n|1,287\n|£???\n|\n|-\n|Uni-Seco\n|THP\n|\n|\n|\n|\n|\n|\n|30,000\n|£1,131\n|\n|-\n|Unity Structures\n|THP\n|\n|\n|Steel\n|\n|\n|\n|13,701\n|£???\n|\n|-\n|Wates\n|\n|\n|\n|Concrete (LS)\n|\n|\n|\n|18,776\n|£???\n|\n|-\n|Woolaway\n|\n|\n|\n|Concrete (PP&P)\n|\n|\n|\n|4,845\n|£???\n|\n|-\n|Wimpey \"no fines\"\n|\n|Wimpey\n|Wimpey\n|Concrete (LS)\n|Concrete (LS)\n|Clay tile\n|2+\n|53,371\n|£???\n|\n|-\n|All other steel frames\n|\n|\n|\n|Steel\n|\n|\n|\n|4,890\n|£???\n|\n|-\n|All other in-situ\n|\n|\n|\n|Steel\n|\n|\n|\n|3,783\n|£???\n|\n|-\n|}\nNOTES:\n* LS - Precast Concrete, Large Slab\n* PP&P - Precast Concrete, Pier & Post\nHouse types\nWhen the Ministry of Works opened up the design competition, some 1,400 designs were submitted. Reviewed by the Building Research Station, many were rejected from the conceptual stage, such as the British Powerboat Company's proposal for the Jicwood all laminated plywood design; while others were only dismissed after the prototype stage, such as the steel framed Riley. However, a few were approved after testing for construction.\nPortal (Temporary Housing Programme prototype design)\nThe first prototype to be unveiled was the motor industry contribution, a steel panelled experimental temporary bungalow called the Portal after the minister of works, Lord Portal. With a floor area of , and an estimated cost of £600 constructed, and £675 fully furnished. It included a prefabricated slot-in kitchen and bathroom capsule, that included a pre-installed refrigerator. The proposed rent was 10 shillings (50p) a week for a life of ten years.\nAirey\ns in Seacroft, Leeds]]\nDeveloped by Leeds based construction magnate Sir Edwin Airey, it was easily recognisable by its precast concrete columns and walls of precast shiplap concrete panels. Due to its variation of design, available with a flat or pitched roof, and with variations for rural or urban sites; it became one of the most prolific of the permanent designs.\nAIROH (THP)\nThe AIROH (Aircraft Industries Research Organisation on Housing) house was a , ten tonne all-aluminium bungalow assembled from four sections, each to be delivered to the site on a lorry, fully furnished right down to the curtains. The proposed rate of production of complete houses was to be one every twelve minutes.  This was possible because the completely equipped and furnished AIROH could be assembled from only 2,000 components, while the aircraft it would replace on the production line required 20,000. The parents of future Labour Party leader Neil Kinnock were allocated an AIROH, on which he commented:\nAlthough impressive, the AIROH by 1947 was costing £1,610 each to produce, plus costs of the land and installation. However, as the design was so easy to produce, 54,500 AIROHs were constructed.\nArcon (THP)\nDeveloped and constructed by Taylor Woodrow, the Arcon was an asbestos-clad variant of the Portal, with the same prefabricated kitchen and bathroom capsule. It had a longer life, but also came with a higher cost of construction. The later rolled top roofed Arcon Mk5 was developed by Edric Neel. 38,859 were constructed through the programme.\nThe two bedrooms were approximately the same fairly generous size with picture windows which included an opening window. The kitchen was fitted with steel cupboards, drawers and an integral sink unit. A side door entered directly into the kitchen. A gas copper, gas oven and hob, and a fitted-in gas fridge were incorporated into the inbuilt steel kitchen units. A drop-down wall-fitted table adjacent to a built-in larder was opposite the built-in units. The lounge had an open coal fire, the heat from which heated a back boiler, thus giving \"free\" hot water. The bathroom had a full-size bath and fitted steel cupboards. There was a separate toilet. The lounge and both bedrooms had steel built-in cupboards and drawers. Arcons were so well fitted (in Debden, Loughton, Essex) that the only furniture necessary were beds, kitchen chairs, lounge seating and floor coverings. Chain-link fencing, a gate and a coal shed built with corrugated steel from Anderson shelters and brick front and rear walls was also provided. Gardens were of sufficient size to grow vegetables, and many early residents quickly erected a chicken run.\nBISF\nBISF houses in Port Glasgow with modified (left) and original (right) cladding\nThe BISF (British Iron and Steel Federation) house is a permanent steel-frame house designed by architect Sir Frederick Gibberd and constructed nationwide from 1946. The main structure is of steel columns with a central spine to support the first floor beams. It has distinctive upper cladding made of steel, which makes a design feature out of the joining of the two prefabricated halves.\nCornish Unit\n, South Yorkshire.]]\nDesigned by A Er v.senthil and R Tonkin for the Central Cornwall Concrete & Artificial Stone Co., they are also known as Cornish Type and Selleck Nicholls & Williams houses. The houses came in type-1 and type-2 designs, incorporating variations of a bungalow, two storey semi-detached and terraced layout with a medium pitched Mansard hipped roof.\nThe first floor is PRC clad over a single-storey concrete frame, while the type-1 house has the Mansard roof over timber trusses. Internal walls are made of PC wall block or brick. So successful was the design, 30,000 Cornish Unit houses were eventually constructed.\nHowever the roofs and wall insulation incorporated asbestos, while the wooden frame-based construction means that as the concrete decays the two parts tend to separate, resulting in large amounts of internal cracking. The major defects are:\n* Horizontal and vertical cracking of PRC columns\n* High rates of carbonation and significant levels of chloride in PRC columns\n* Cracking of first floor ring beams\nHawksley\nA W Hawksley Ltd of Hucclecote were formed in 1940 by the Hawker Siddeley group owners of the Gloster Aircraft Company to build the Albemarle aircraft designed by Armstrong Whitworth. Post-Second World War, its parent company Hawker Siddeley kept it open to supply prefab houses and bungalows to the MoW. After their MoW work finished, they continued exporting their buildings to Australia, New Zealand and Uruguay into the 1960s. Their designs included:\n* BL8: an aluminium-clad timber-framed bungalow.\n* C2/C3: either a three-bedroom bungalow, or convertible to a government building such as a post office or doctors' surgery\n* Hawksley House: a semi-detached or terraced house with 2–4 bedrooms based on the principles of the Swiss architect G. Schindler\n* Hawkesley Single Storey building: a general-purpose building suitable for schools, offices, hospitals and village halls\nAn estate of 60 Hawksley bungalows was constructed in Letchworth Garden City in 1950–51. There are also similar houses in the Canley and Tile Hill areas of Coventry, however many of these have been demolished in favour of modern buildings for Warwick University. As of 2014, the buildings are still maintained and occupied.\nThe company later developed an aluminium house for the Margaret MacMillan Memorial Fund, for use in tropical overseas relief missions.\nHoward\nAnother designed by Sir Frederick Gibberd, the steel-framed design was privately promoted by John Howard & Company. A more industrial aesthetic design, and more adventurous in its use of innovative technologies. Asbestos cement cladding panels are clearly expressed with metal flashings over a base course of foamed slag concrete panels, with windows and doors fitting within the module set up by the cladding. Unlike the BISF, this house proudly displays its lightweight prefab nature, but there are also technical advances that set the Howard House apart, for example the precast concrete perimeter plinth that supports a suspended steel ground floor. Only 1,500 Howard Houses were built.\nLaing Easi-Form\nDesigned by Laing and Co., as they are poured in-situ into moulds type designs developed from 1919 onwards, they do not suffer the problems of many steel framed buildings. The rare Mk1 version had  thick solid no-fines clinker concrete walls, built in the period 1919 to 1928. The more common Mk2 version from 1925 to 1945 had cast in situ cavity walls,  thick inner and outer leaves with  cavity, usually finished externally with stone dashed render coat. Post-1945, the Mk3 version, which makes up the majority of houses, was modified to specification, and hence had cast in situ concrete walls, inner and outer leaves of  thickness separated by a  cavity, and reinforcement in both skins located in four horizontal bands above and below window openings.\nLecaplan\nDesigned by J C Tilley and manufactured by W. & C. French Limited Lecaplan came in two types, Type A were 2-storey terraced houses. Characterised with shallow pitch gable roof covered with concrete tiles.  They have external walls of concrete panels throughout, or front and rear walls infilled with timber shiplap boarding.  Type B were a later variant of similar profile but with an added entrance porch and exclusively concrete walling throughout.  Of each type some 1600 were constructed between 1966 and 1971.\nMowlem\nLike the Laing Easi-Form, a cast in situ concrete form of construction, first used in 1952 but mainly in the period 1962 to 1981. With a solid cavity wall, the poured concrete substitutes for the inner blockwork walls of traditional housing. Solid wall types  thick cast in lightweight concrete, rendered externally. Cavity wall types have an inner leaf of at least 100-125mm thick concrete.\nOrlit\nDesigned by Czech architect Erwin Katona, who left Czechoslovakia in 1938 to move to the UK, the design is a two-storey precast reinforced concrete design. The design was produced in Scotland by the Orlit Company, resulting in most houses being located in Scotland and Ulster.\nOn-site construction was based on a foundation which supported storey-high precast concrete columns at fixed intervals, supporting concrete beams fixed to the columns, resulting in a virtually monolithic frame. Faced externally with large concrete slabs, and internally with interlocking foamslag blocks. Internal partitions are constructed of breeze blocks finished in plaster, as is the foamslag internal cladding. The floors are constructed of precast concrete flooring units, with timber flooring on timber runners.\nDue to both the speed of construction and the quality of production, over time the PRC deteriorates, particularly at construction joints and junctions between components, with a gradual reduction in structural effectiveness. This resulted in the Orlit being designated as defective under the Housing Defects Act 1984, and hence a majority of mortgage lenders will not give any form of mortgage on them.\nPhoenix (THP)\nPhoenix prefabs in Wake Green Road, Birmingham]]\nThe Phoenix, designed by Laing and built by themselves as well as partners McAlpine and Henry Boot, looked much like an AIROH with a central front door. It was a two-bedroom in-situ preform design with steel frame, asbestos clad walls and an innovative roof of tubular steel poles with steel panels attached. Like all designs, it came pre-painted in magnolia, with green highlights on frames and skirting. Phoenix prefabs cost £1,200 each constructed onsite, while the specially insulated version designed for use on the Isle of Lewis in the Hebrides cost £2,000.\nReema\nReema houses were built from large-scale (nominally single-storey height) precast reinforced concrete panels, themselves made in factories, before construction was enabled onsite. Reema houses came in two forms:\n* Reema Conclad\n* Reema Hollow Panel\nDue to structural degradation and the use of asbestos in the wall and roof insulation, both are difficult to obtain a mortgage on today. The Reema Hollow Panel is listed universally as defective after a Government-sponsored investigation and the subsequent Housing Defects Act 1984, while the Reema Conclad is often mis-recognised as a Hollow Panel.\nSwedish\n, Kent]]\nBetween September 1945 and March 1946, Sweden exported 5,000 prefabricated houses to the UK and 2,100 to France. The design was adapted by the MoW from a standard Swedish kit, with the all-timber houses arriving in flat sections, and then stored at the docks for allocation. In England and Wales this was often in small numbers to rural areas in support of farm workers. The first of these houses were built at Abbots Langley, Hertfordshire, in January 1946. There are two basic designs: semi-detached houses with a single storey utility extension and semi-detached dormer bungalows. A pair of the bungalows at Auckley near Doncaster (Grid Ref: SE651012) have been listed by Historic England (their ref: 1392257).\nIn Scotland a slightly different style of house (without the single-storey utility extension) was erected in large estates in Edinburgh, Glasgow, Inverness and elsewhere.\nTarran (THP)\nThe Tarran was designed by building firm of Tarran Industries Ltd. of Hull. A wooden frame designed bungalow, over clad with precast concrete panels. 19,014 Tarrans were erected under the Temporary Housing act, but one- and two-storey variants were built in some numbers afterwards.\nTarran variants\nUni-Seco (THP)\nin Lewisham in 2013]]\nProduced by the London-based Selection Engineering Company Ltd, the three versions of the Uni-Seco were largely erected in London and the southeast. A two-bedroom flat-roofed bungalow, it had a resin-bonded plywood timber frame with asbestos wall sections, it was based on a military wartime office design. With dimensions of  by , the first two versions included the MoW standard kitchen/bathroom service unit, plus a lounge; Mark 3s had a central entrance over the original side door.\nIn 1943, Uni-Seco had appointed the Czechoslovak émigré George Fejer as an industrial designer, who on a part-time basis helped out with their kitchen design. Fejer later worked with Arthur Webb and George Nunn at Hygena to create the UK style of fitted kitchen, based on the principles of the Frankfurt kitchen. Approximately 29,000 Uni-Seco units were constructed. The Excalibur Estate in Catford, Lewisham, is the UK's largest residual estate of prefabs, presently consisting of 187 Uni-Seco bungalows, but the demolition of all but six was announced in 2011.\nUnity Structures (THP)\n]]\nUnity Structures were a construction company based in Rickmansworth. Using common storey-level precast reinforced concrete panels, they produced various updated versions of their bungalow and twin-storey house variations. Using metal bracing within the cavity and metal joists connected at column joints, the PRC columns act as mullions. Copper straps tie the inner panel to outer PRC panel on earlier variants, while later the copper strap fixed to column holding just outer PRC cladding panels.\nAlthough the design incorporates significant steelwork resulting in fair current structural condition, the concrete used in casting is decaying, and resultantly leaks chlorides. This results in internal staining through panel joints, and corrosion of the metal reinforcing and straps.\nA Unity Structures bungalow originally located in Amersham is preserved at the Chiltern Open Air Museum.\nWimpey no-fines\nGeorge Wimpey & Co., being a house builder, focused on both design but also speed and ease of construction. Their method used \"no-fines\" concrete, the composition of which used no-fine aggregates. Using huge reusable moulds, they were held in place as the concrete for the entire outer structure was poured in one operation. The ground floor was also concrete, while the first floor was made of wooden floorboards. Interior walls were a mixture of conventional brick and blockwork construction. Wimpey's design was particularly successful, resulting in many thousands built, and still occupied today.\nOther types\n* Hamish prefabs (types 1 and 2)\n* Duplex Sheath prefab\n* Bricket Wood Special prefab\n* Blackburn Orlit prefab\n* Glasgow foam slag (building material)\nResidual housing stock today\nThe strength of the post-war temporary prefab house; fast construction over an aluminium, steel or wooden frame, is today its weakness. The properties were only designed to last 10 years, and so some of the quality standards were not as high as they would have been should a longer life have been envisaged. Secondly, the quality of metal production then was not as good as it was now, but it should be remembered that in only the previous few years British manufacturing plants had become adept at producing a consistently high quality product for the war effort, and so standards were consistent.\nThe quality of a steel-framed prefab house, which can be suffering from rust, or a wooden house from rot, can be found in the footings of the structure where it meets the foundation slab. With checks undertaken by a qualified building surveyor, the structural integrity of the house can be quickly ascertained through exposure of the footings: if they are not rusty or rotted, the house is normally structurally sound.\nThe second problem with non-refurbished houses is the use of asbestos in the original construction, particularly in the roof structure. Again, a qualified surveyor should be able to ascertain if asbestos is present, what type, and how to address its removal. There are a number of central and local government grants available for domestic asbestos removal which should cover most of the cost.\nThe third problem with the survival of prefabs in the 21st century is that of style. Never seen as aesthetically pleasing, the tight building regulations meant they also came with reasonable-sized rooms and gardens. Modern house construction can create around 35 living spaces per acre, while often the prefabs will form site layouts of fewer than 20. This, together with the age of the properties, makes redevelopment of mass prefab sites a distinct advantage to councils and housing associations. Hence, every year since 2000, the number of prefabs remaining has approximately halved.\nPreservation\n]]\nBristol has one of the largest remaining populations of prefab housing stock, which also remains one of the most diverse. A wartime production centre for aircraft, engines and explosives, it was easy to reach for Luftwaffe bombing, and hence had a large post-war need for new housing stock. There remain around 700 examples of Uni-Seco, Phoenix, Tarron and roll-topped Arcon Mk Vs. The stock diversity has resulted in English Heritage selecting 16 prefabs for Grade II listed building status.\nThe Excalibur estate in Catford, London Borough of Lewisham is the UK's largest remaining estate of post-WW2 prefab houses, with 187 Uni-Seco wooden frame bungalows plus a flat-roofed prefab church. While residents fought to save the entire 187-unit estate, English Heritage wanted to save 21 examples, and the council, which still owns 80% of the properties, wanted the ability to demolish the whole estate. In September 2009, the Department for Culture, Media and Sport agreed to Grade II list six of the least altered properties. Similar debates have resulted in the listing of 16 Phoenix prefabs in Wake Green Road, Hall Green in Birmingham, and two in Doncaster.\nApproximately six prefabs have been extracted from site for preservation, including one AIROH at the Museum of Welsh Life at St Fagans. An Arcon Mark V from Yardley in Birmingham is now preserved at the Avoncroft Museum of Buildings. A scale model of a newly-constructed 1950s prefab is on display at the People's Palace museum in Glasgow.\nSee also\n* Houses for Britain\n* Atholl steel house\nReferences\nFurther reading\n*\n*\n*\n*\n*\n*\nExternal links\n* [http://viewfinder.english-heritage.org.uk/story/slide.aspx?storyUid=44&slideNo=1 English Heritage slideshow of various archive slides of prefab houses and their construction]\n* [http://www.foursteelwalls.co.uk/casestudies/cs-bisf.html BISF House]\n* [https://web.archive.org/web/20100930153955/http://www.museumwales.ac.uk/en/rhagor/article/1866/ Account of moving into a prefab from the Museum of Wales]\n* [https://web.archive.org/web/20100611155655/http://www.hiresources.co.uk/NT-AllType.asp List of Non-standard construction types, and major identifying criteria]\n* [https://docs.google.com/viewer?a=v&q=cache:fE-HS1mU_fUJ:libraries.mit.edu/archives/research/collections/collections-ac/pdf/ac302.pdf+%22Unity+structures%22+prefab&hl=en&gl=uk&sig=AHIEtbQnJgIMEbtWLIBqcMkv8lrPEiLINg List of Prefab construction companies]\nAudio/visual\n* [http://www.britishpathe.com/record.php?id=58662 AW Haksley Prefabs for Northern Ireland] from archive of British Pathé\n* [http://www.britishpathe.com/video/new-style-buildings New Style Buildings 1962 in Bethnal Green, London], from archive of British Pathé\n* [https://archive.today/20130209163034/http://www.wpafilmlibrary.com/detail/new_export_-_houses_english_built_prefabricated_houses_are_packed_up_and_sent_off_to_northern_irelands/48f8e850-ac1c-102b-b605-0030482f0128.html Lorry leaving the factory of AW Hawksley with an export house]\n* [http://landmarkprc.co.uk/index.php/Unity-PRC-House.html Reconstruction process on a Unity Structures Mk1 house] (slide show)"
    }
  ]
}