{
  "content": [
    {
      "type": "text",
      "text": "# President Jackson Seamounts\n\nto\n| location       =\n| group          = 8 linearly aligned seamounts\n| coordinates    =\n| country        = United States\n| type           = Underwater volcanic chain\n| volcanic_group =\n| age            =\n| last_eruption  =\n| discovered     =\n| discovered_by  =\n| first_visit    =\n| translation    =\n| language       =\n| pronunciation  =\n| photo          =\n| photo_alt      =\n| photo_caption  =\n}}\nThe President Jackson Seamounts are a series of seamounts (underwater volcanoes) located on the Pacific Plate, off of California. It consists of 8 seamounts, 4 independent and 4 morpohologically fused, just west of the northern Gorda Ridge. They are generally very small, and arranged linearly.\nThe assembly consists of 8 seamounts arranged in a chain. The easternmost of the seamounts is located about  east of the axial ridge that spawned the volcanoes, Gorda Ridge. The chain was mapped initially with SeaBeam equipment in 1985, however its incomplete coverage limited its usefulness. A GLORIA sidescan survey conducted in 1986 further established the rough size and locations of the seamounts. A further sampling cruise by the United States Geological Survey (USGS) recovered pillow lava and hyaloclastite from 4 of the 8 volcanoes. The samples seemed to be of more primitive origin then those erupted elsewhere on the ridge. In 1998, the Monterey Bay Aquarium Research Institute conducted two dives on a cone cluster located southeast of the main structure.\nThe chain consists of eight volcanoes. Of these, four are self-dependent, whereas the other four form twin fused, morphologically complex, flat-topped structures. The volcanoes form a linear chain, and are relatively small, measuring less than  in diameter, and are nearly circular in shape. They average ± in volume, but range from  to . In addition to the eight main seamounts, there is a scattered disk of minor volcanic cones and flows about  southeast of the chain.\nThe summits of the seamounts, with the exception of the second one from the northwest, are all flat. Several have nested or cross-layered calderas and pit craters (29 in total), many of which push into the flank of the volcanoes. In several cases, newer volcanic structures have all but erased older ones. In addition to all this the seamounts are pocketed by multiple small cones, and are littered by debris ranging far and wide from the range. There is evidence of erosional activity throughout, with erosional valleys and landslide debris visible.\nSee also\n*Vance Seamounts\nReferences"
    }
  ]
}