{
  "content": [
    {
      "type": "text",
      "text": "# President of the State Affairs Commission\n\n| mr = Chosŏn minjujuŭi inmin'gonghwaguk kukmu wiwŏnjang\n| rr = Joseon minjujuui inmin gonghwaguk gukmu wiwonjang\n| context = north}}\nThe '''President of the State Affairs Commission of the Democratic People's Republic of Korea''' (), alternatively styled \"President of State Affairs\" in official translations, is the supreme leader and head of state of North Korea. The president chairs the State Affairs Commission (SAC), which is the highest leadership institution in North Korea, and serves as the commander-in-chief of the North Korean armed forces.\nThe North Korean constitution gives the president the power to lead the overall affairs of the state and appoint important state officials. The president also has the power to appoint diplomatic representatives and conclude treaties with other countries. The president can declare a state of emergency, a state of war or a mobilization order and direct the country's national defence during times of war. The president also has absolute control over North Korea's nuclear arsenal.\nThe president of the State Affairs is elected by the Supreme People's Assembly. The position is held by the general secretary of the Workers’ Party of Korea (WPK), who leads the ruling political party of North Korea and serves as the supreme leader of North Korea. The term of the president is the same as that of the Supreme People's Assembly and has no term limits.\nThe current president is Kim Jong Un, who took office on 29 June 2016 and was re-elected on 11 April 2019.\nHistory\nChairman of the National Defence Commission\nThe position was first established as the '''chairman of the National Defence Commission of the Central People's Committee''' (Korean: 중앙인민위원회 국방위원회 위원장) on 28 December 1972. At that time, the National Defence Commission was a commission subordinate to the Central People's Committee, which was the highest leadership institution in North Korea from 1972 until 1998.\nThe 1972 North Korean constitution stated that the president of North Korea is also the chairman of the National Defence Commission, as well as the supreme commander of the country's armed forces. Kim Il Sung, who was the president of North Korea, was the chairman of the National Defence Commission from 28 December 1972 until 9 April 1993.\nOn 9 April 1992, the position became known as the chairman of the National Defence Commission (Korean: 국방위원회 위원장) following the approval of an amendment to the 1972 constitution that made the National Defence Commission into a separate institution from the Central People's Committee. The amendment expanded the chairman's powers to become the head of the highest military leadership institution in North Korea.\nThe 1992 constitutional amendment no longer required the president to also be the chairman of the National Defence Commission and the supreme commander of the armed forces. This allowed Kim Jong Il, who was Kim Il Sung's designated successor, to be elected as chairman of the National Defence Commission on 9 April 1993. Prior to his election, Kim Jong Il was elected as first vice chairman of the National Defence Commission on 24 May 1990 and became the supreme commander of the Korean People's Army on 24 December 1991.\nFollowing Kim Il Sung's death on 8 July 1994, another constitutional amendment was approved on 5 September 1998 which further expanded the powers of the chairman of the National Defence Commission. The amendment enshrined Kim Il Sung as North Korea's eternal president and abolished the position. While it is not stated by the amended constitution, the National Defence Commission became the de facto highest leadership institution in the country with its chairman holding the highest office of the state.\nDespite the 1998 constitutional amendment effectively making the chairman of the National Defence Commission the highest office in North Korea, it did not have the status of head of state. The president of the Presidium of the Supreme People's Assembly was designated as the country's head of state from 1998 until 2019.\nOn 9 April 2009, the powers of the chairman of the National Defence Commission was expanded through another constitutional amendment. The amendment designated the chairman as the supreme leader of the country. The chairman was given the power to direct all state affairs and conclude important treaties with foreign countries. The chairman can also appoint or dismiss important national defence officials, grant special pardons, declare a state of emergency and a state of war and issue mobilization order.\nAfter his election as chairman of the National Defence Commission in 1993, Kim Jong Il was re-elected in September 1998, September 2003 and April 2009, and served in this position until his death on 17 December 2011.\nFirst Chairman of the National Defence Commission\nFollowing Kim Jong Il's death, the position of chairman of the National Defence Commission remained vacant from December 2011 until April 2012.\nA constitutional amendment was approved on 13 April 2012 which enshrined Kim Jong Il as the eternal chairman of the National Defence Commission (Korean: 영원한 국방위원회 위원장). The amendment also created the position of first chairman of the National Defence Commission (Korean: 국방위원회 제1위원장) which was designated as the supreme leader of the country.\nKim Jong Un, who is Kim Jong Il's designated successor, was elected as first chairman of the National Defence Commission on 13 April 2012 and was re-elected in April 2014.\nPresident of the State Affairs Commission\nOn 29 June 2016, a constitutional amendment was approved by the Supreme People's Assembly that created the State Affairs Commission to replace the National Defence Commission as the highest leadership institution in North Korea. The amendment also created the position of chairman of the State Affairs Commission.\nKim Jong Un was elected as chairman of the State Affairs Commission on 29 June 2016 and was re-elected on 11 April 2019.\nOn 11 April 2019, the constitution was amended to make the chairman of the State Affairs Commission the head of state of North Korea. Another constitutional amendment on 29 August of the same year gave the chairman the power to promulgate the ordinances of the Supreme People's Assembly and the decrees and decisions of the State Affairs Commission and appoint North Korea's diplomatic representatives to foreign countries.\nIn February 2021, the official English translation for the position was changed to president of the State Affairs. However, in the Korean-language title, the word 위원장, meaning \"chairman\", was replaced neither by the word 주석 (used for the office of president of North Korea held by Kim Il Sung between 1972 and 1994) nor by the word 대통령 (used by the president of South Korea).\nElection\nAccording to the Constitution, the president of the State Affairs is elected by the Supreme People's Assembly. It requires that the election should be according to the \"consensus of the entire Korean people\".\nThe election of the president of the State Affairs takes place during a session of the Supreme People's Assembly. The Central Committee of the Workers' Party of Korea sends a proposal to the Supreme People's Assembly for a candidate to be elected as the president. The Central Committee's proposal is introduced to the Supreme People's Assembly by the chairman of its Standing Committee. Then, the Supreme People's Assembly unanimously votes for the candidate. In practice, this position is reserved for the general secretary of the Workers’ Party of Korea, the top leader in the one-party state.\nThe term of the president of the State Affairs is the same as the term of the Supreme People's Assembly, which is usually five years. The constitution does not set a term limit for the president. The president may not be elected as a deputy to the Supreme People's Assembly. The Supreme People's Assembly has the power to recall the president.\nThe constitution does not set other qualifications for the president of the State Affairs. As a result, the right to be elected as president is governed by the normal provisions regarding the right to be elected, which are granted to all North Korean citizens who are at least 17 years old.\nPowers\nDomestic policy\nThe president of the State Affairs has the power to direct the overall work of the state as the supreme leader of North Korea. The president also heads the State Affairs Commission, which is the highest leadership institution in North Korea. The State Affairs Commission is responsible for discussing and deciding on important state policies. The SAC also supervises the execution of the orders of the president and the SAC decrees, decisions and directives. Decisions and directives of state institutions that are contrary to the orders of the president or SAC decrees, decisions and directives can be revoked by the SAC.\nNominations and appointments\nThe president of the State Affairs has the power to nominate the first vice president, vice president, and members of the State Affairs Commission, who are then elected by the Supreme People's Assembly. The president can also propose for their recall by the Supreme People's Assembly. The president also has the power to appoint or dismiss important state officials. However, the constitution does not state who these important state officials are.\nLegislation\nThe president of the State Affairs can submit an agenda that will be discussed by the Supreme People's Assembly. The commission can also submit an agenda to the Supreme People's Assembly. The president has the power to promulgate ordinances of the Supreme People's Assembly and the SAC decrees, decisions and directives, and to issue orders. Orders of the President of SAC take precedence over the regular laws passed by the Supreme People's Assembly. The State Affairs Commission supervises the execution of these orders.\nForeign affairs\nThe president of the State Affairs represents North Korea in its foreign relations as its head of state, can conclude major treaties, and can appoint and recall North Korea's diplomatic representatives to foreign countries. Foreign countries address the credentials and recall of their ambassadors to North Korea to the president, although customarily the task of receiving them is delegated to the chairman of the SPA Standing Committee.\nCommander-in-chief\nThe president of the State Affairs is the commander-in-chief of the Armed Forces of North Korea. As commander-in-chief, the president has command of the entire armed forces. The president additionally has \"monolithic command\" over the nuclear forces of North Korea. The president has the power to declare a state of emergency, a state of war or a mobilization order, and can organize a national defence committee during wartime.\nOther powers\nThe president of the State Affairs Commission can exercise the right to grant special pardon.\nList of office holders\nChairman of the National Defence Commission of the Central People's Committee (1972–1992)\n{| class=\"wikitable\" style=\"text-align:center;\"\n|-\n! rowspan=\"2\" |No.\n! rowspan=\"2\" | Portrait\n! rowspan=\"2\" width=\"150\" |Name\n! colspan=\"3\" |Term of office\n! colspan=\"2\" rowspan=\"2\" |Party\n! rowspan=\"2\" |SPA\n|-\n! width=\"85\" |\n! width=\"85\" |\n! width=\"85\" |\n|-\n| rowspan=\"5\" |1\n| rowspan=\"5\" |\n| rowspan=\"5\" |Kim Il Sung(1912–1994)\n| rowspan=\"5\" |1972\n| rowspan=\"5\" |1992\n| rowspan=\"5\" |\n| rowspan=\"5\" bgcolor=\"\" |\n| rowspan=\"5\" |Workers' Party of Korea\n|5th\n|-\n|6th\n|-\n|7th\n|-\n|8th\n|-\n|9th\n|}\nChairman of the National Defence Commission (1992–2012)\n{| class=\"wikitable\" style=\"text-align:center;\"\n|-\n! rowspan=\"2\" |No.\n! rowspan=\"2\" | Portrait\n! rowspan=\"2\" width=\"150\" |Name\n! colspan=\"3\" |Term of office\n! colspan=\"2\" rowspan=\"2\" |Party\n! rowspan=\"2\" |SPA\n|-\n! width=\"85\" |\n! width=\"85\" |\n! width=\"85\" |\n|-\n|(1)\n|\n|Kim Il Sung(1912–1994)\n|1992\n|1993\n|\n| bgcolor=\"\" |\n|Workers' Party of Korea\n| rowspan=\"2\" |9th\n|- style=\"height:37px;\"\n| rowspan=\"4\" |2\n| rowspan=\"4\" |\n| rowspan=\"4\" |Kim Jong Il(1941–2011)\n| rowspan=\"4\" |1993\n| rowspan=\"4\" |2011\n| rowspan=\"4\" |\n| rowspan=\"4\" bgcolor=\"\" |\n| rowspan=\"4\" |Workers' Party of Korea\n|-\n|10th\n|-\n|11th\n|- style=\"height:37px;\"\n| rowspan=\"2\" |12th\n|-\n| colspan=\"8\" |Vacant(17 December 2011 – 13 April 2012)\n|}\nFirst Chairman of the National Defence Commission (2012–2016)\n{| class=\"wikitable\" style=\"text-align:center;\"\n|-\n! rowspan=\"2\" |No.\n! rowspan=\"2\" | Portrait\n! rowspan=\"2\" width=\"150\" |Name\n! colspan=\"3\" |Term of office\n! colspan=\"2\" rowspan=\"2\" |Party\n! rowspan=\"2\" |SPA\n|-\n! width=\"85\" |\n! width=\"85\" |\n! width=\"85\" |\n|-\n| rowspan=\"2\" |3\n| rowspan=\"2\" |\n| rowspan=\"2\" |Kim Jong Un(born 1983)\n| rowspan=\"2\" |2012\n| rowspan=\"2\" |2016\n| rowspan=\"2\" |\n| rowspan=\"2\" bgcolor=\"\" |\n| rowspan=\"2\" |Workers' Party of Korea\n|12th\n|-\n|13th\n|}\nPresident of the State Affairs (since 2016)\n{| class=\"wikitable\" style=\"text-align:center;\"\n|-\n! rowspan=\"2\" |No.\n! rowspan=\"2\" | Portrait\n! rowspan=\"2\" width=\"150\" |Name\n! colspan=\"3\" |Term of office\n! colspan=\"2\" rowspan=\"2\" |Party\n! rowspan=\"2\" |SPA\n|-\n! width=\"85\" |\n! width=\"85\" |\n! width=\"85\" |\n|-\n| rowspan=\"2\" |(3)\n| rowspan=\"2\" |\n| rowspan=\"2\" |Kim Jong Un(born 1983)\n| rowspan=\"2\" |2016\n| rowspan=\"2\" |Incumbent\n| rowspan=\"2\" |\n| rowspan=\"2\" bgcolor=\"\" |\n| rowspan=\"2\" |Workers' Party of Korea\n|13th\n|-\n|14th\n|}\nTimeline\nColors =\nid:kwp  value:rgb(0.84,0.08,0.22) legend:Workers'_Party_of_Korea\nid:gray1  value:gray(0.85)\nid:gray2  value:gray(0.95)\nDateFormat = dd/mm/yyyy\nPeriod     = from:01/01/1972 till:$today\nTimeAxis   = orientation:horizontal\nScaleMajor = unit:year increment:5 start:1975\nScaleMinor = unit:year increment:1 start:1973\nLegend     = columns:1 left:150 top:35 columnwidth:170\nTextData =\npos:(20,38) textcolor:black fontsize:M\ntext:\"Political party:\"\nBarData =\nbar:il-sung\nbar:jong-il\nbar:jong-un\nPlotData =\nwidth:5 align:left fontsize:9 shift:(5,-4) anchor:till\nbar: il-sung\nfrom: 28/12/1972 till: 09/04/1993 color:kwp text:\"Kim Il Sung\"\nbar: jong-il\nfrom: 09/04/1993 till: 17/12/2011 color:kwp text:\"Kim Jong Il\"\nbar: jong-un\nfrom: 13/04/2012 till: $today     color:kwp text:\"Kim Jong Un\"\n}}\nSee also\n* General Secretary of the Workers' Party of Korea\n* Central Military Commission of the Workers' Party of Korea\n* Vice President of the State Affairs Commission\n* President of South Korea\nReferences"
    }
  ]
}