{
  "content": [
    {
      "type": "text",
      "text": "# President of South Yemen\n\n}}\nThe People's Democratic Republic of Yemen, commonly referred to as South Yemen, gained independence as the People's Republic of South Yemen on 30 November 1967. The President of the Republic served as head of state, appointing a Prime Minister to serve as head of government.\nOn 22 June 1969, the left wing of National Front (NF) took power following the Corrective Move, reorganizing the government. The Chairman of the Presidential Council became the head of state. This was followed closely in 1970 by the renaming of the country to the People's Democratic Republic of Yemen. Another reorganization in 1978, following the establishment of the Yemeni Socialist Party in October, changed the title of the head of state to Chairman of the Presidium of the Supreme People's Council. This lasted until unification with the Yemen Arab Republic on 22 May 1990, when the then-Chairman became the Prime Minister of the united Yemen.\nPresident of the People's Republic of South Yemen\n{| class=\"wikitable\" style=\"text-align:center\"\n! rowspan=2|\n! rowspan=2| Portrait\n! rowspan=2| Name\n! colspan=3| Term of office\n! rowspan=2| Party\n|-\n! Took office\n! Left office\n! Time in office\n|-\n! style=\"background:; color:black;\"| 1\n|\n| rowspan=\"1\" |Qahtan Muhammad al-Shaabi\n| rowspan=\"1\" |30 November 1967\n| rowspan=\"1\" |22 June 1969\n| rowspan=\"1\" |\n| rowspan=\"1\" |National Front\n|}\nChairman of the Presidential Council\nThe Presidential Council of Democratic Yemen was established as part of the reforms made during the \"Corrective Move\", in which Qahtan al-Shaabi got overthrown by the left wing of the National Front (NF). Its role was to manage internal divisions within the National Front (NF), which evolved into the Yemeni Socialist Party in 1978, and maintain regional balance.\nThe council consisted of five members: Abdul Fattah Ismail of the North, Mohammed Ali Haytham of Abyan, Mohammed Saleh al-Awlaqi of Shabwa, Ali Antar of Dhale and Salim Rubaya Ali (Salmin) of Abyan who served as president. Over the next two years, personnel changes occurred, with Ali Nasir Muhammad replacing al-Awlaqi. The council's membership was based primarily on regional influence within the National Front, rather than military power, as in the Yemen Arab Republic up north.\nThe council's structure, with equal power for all members, resulted in a de facto triple presidency shared by Salemin, Ismail, and Ali Nasser. However, this balance did not prevent internal strife, particularly between Rubai, who favored a pro-Chinese Maoist approach, and Ismail, who advocated for a Russian Marxist model. While Rubai relied on his regional base and the loyalty of the army, Ismail's influence stemmed from his role as the party's ideological leader and his own \"Popular Militia\". Ali Nasser acted as a mediator between the two. Despite the council's power-sharing arrangement, conflict persisted and ended with Salemin's execution in 1978. The council's structure mirrored the factionalism within the National Front and was never designed to be a democratic body.\n{| class=\"wikitable\" style=\"text-align:center\"\n! rowspan=2|\n! rowspan=2| Portrait\n! rowspan=2| Name\n! colspan=3| Term of office\n! rowspan=2| Party\n|-\n! Took office\n! Left office\n! Time in office\n|-\n! style=\"background:; color:black;\"| 2\n|\n| rowspan=1 | Salim Rubaya Ali\n| rowspan=1 | 23 June 1969\n| rowspan=1 | 26 June 1978\n|\n| rowspan=1 | National Front\n|-\n! style=\"background:; color:black;\"| 3\n| rowspan=2 |\n| rowspan=2 | Ali Nasir Muhammad\n| rowspan=1 | 26 June 1978\n| rowspan=1 | 21 December 1978\n| rowspan=2|\n| rowspan=1 | National Front\n|-\n! style=\"background:; color:white;\"|\n| rowspan=1 | 21 December 1978\n| rowspan=1 | 27 December 1978\n| rowspan=1 | Yemeni Socialist Party\n|}\nChairman of the Presidium of the Supreme People's Council\nAfter Salmeen's assassination in 1978, Ismail briefly succeeded him, only to be replaced by Ali Nasser Mohammed after two years, and on 1986 a civil war eventually led to Ali Nasser's own removal.\n{| class=\"wikitable\" style=\"text-align:center\"\n! rowspan=2|\n! rowspan=2| Portrait\n! rowspan=2| Name\n! colspan=3| Term of office\n! rowspan=2| Party\n|-\n! Took office\n! Left office\n! Time in office\n|-\n! style=\"background:; color:white;\"| 4\n|\n| rowspan=1 | Abdul Fattah Ismail\n| rowspan=1 | 27 December 1978\n| rowspan=1 | 21 April 1980\n|\n| rowspan=1 | Yemeni Socialist Party\n|-\n! style=\"background:; color:white;\"|\n|\n| rowspan=1 | Ali Nasir Muhammad\n| rowspan=1 | 21 April 1980\n| rowspan=1 | 24 January 1986\n|\n| rowspan=1 | Yemeni Socialist Party\n|-\n! style=\"background:; color:white;\"| 5\n|\n| rowspan=1 | Haidar Abu Bakr al-Attas\n| rowspan=1 | 24 January 1986\n| rowspan=1 | 22 May 1990\n|\n| rowspan=1 | Yemeni Socialist Party\n|}\nFor Presidents after unification in 1990, see: List of Presidents of Yemen\nPresident of the Democratic Republic of Yemen, 1994\nSouth Yemen also rebelled as the Democratic Republic of Yemen for a period of weeks in 1994.\n{|class=\"wikitable\"\n|-\n|\n|Name\n|Took Office\n|Left Office\n|Leading Party\n|-\n|1\n|Ali Salim al-Baidh\n|21 May 1994\n|7 July 1994\n|Yemeni Socialist Party\n|}\nReferences\nBibliography\n*"
    }
  ]
}