{
  "content": [
    {
      "type": "text",
      "text": "# President Street Station__disambig_1\n\n| built        =\n| architect    = Parker, George A.; Isaac Ridgeway Trimble; Philadelphia, Wilmington and Baltimore Railroad\n| architecture = Mid 19th Century Revival, Italianate, Greek Revival\n| restored     = 1996-1997\n| added        = September 10, 1992\n| area         = less than one acre\n| refnum       = 92001229\n| mapframe               = yes\n| designated_other1      = BCL\n| designated_other1_abbr = BCL\n| designated_other1_date = 2009\n}}\nThe President Street Station in Baltimore, Maryland, is a former train station and railroad terminal. Built in 1849 and opened in February 1850, the station saw some of the earliest bloodshed of the American Civil War (1861-1865), and was an important rail link during the conflict. It is the oldest surviving big-city railroad terminal in the United States.\nIn 1997, a preservation campaign and renovation project was completed, enabling the station to be operated as Baltimore Civil War Museum.\nHistory\n19th century\ntwenty years after construction, in 1869]]\nThe Baltimore and Port Deposit Rail Road (B&PD), founded in 1832, completed a rail line from Baltimore to the western shore of the Susquehanna River in 1837.  The railroad's Baltimore terminus was on the east side of the basin now known as the Inner Harbor at the southern end of President Street.\nThe B&PD exchanged freight cars with the Baltimore and Ohio Railroad (B&O), the oldest railroad line in the country, established in 1827, which had built a track along Pratt Street, to the eastern basin harbor area from its original Mount Clare depot on the western side of the central business district.\nThe B&PD and its merger successor company, the Philadelphia, Wilmington and Baltimore Railroad (PW&B), transferred passengers to the B&O's first downtown depot at East Pratt and South Charles streets by a horse-drawn car on B&O's connecting track. (The Baltimore City Council prohibited the operation of locomotives on this track for reasons of frightening horses and fears of fires). By 1838, the PW&B was carrying passengers from further northeast through Philadelphia to Baltimore, where they could transfer to the B&O and continue west to Ohio or by a new branch line further south to the national capital at Washington, D.C.\nThe PW&B started building its own station at the southwestern corner of President Street with Canton Avenue with train yards, including a roundhouse, shops and freight warehouses of about six square city blocks, extending east along Canton Avenue, later renamed Fleet Street. The Greek Revival-style station opened on February 18, 1850.\nIn addition to the brick head house with a distinctive arched roof, the original station also had a  long barrel vaulted train shed over the tracks. The PW&B added a similarly styled freight house, adjacent to the south of the passenger station, in 1852.\nAmerican Civil War\nOn February 23, 1861, President-elect Abraham Lincoln, traveling in secret after abandoning his inauguration whistle stop train tour, transferred from the President Street Station to Camden Station in order to thwart the Baltimore Plot assassination attempt.\nThe station was involved in the Baltimore riot of 1861, as Massachusetts state militia troops bound for Washington, D.C. were being pulled in several connecting horse cars and later marching to the B&O Camden Station, ten blocks west and were attacked by an angry mob of Southern and Confederate sympathizers, with a large number of civilians and four soldiers killed and many people wounded in the ensuing melee. On Friday, April 19, 1861, Baltimore Southern sympathizers attacked the passing 6th Massachusetts infantry regiment of the state militia and the \"Washington Brigade\" of Philadelphia from the Pennsylvania state militia. Both units were heading to Washington to reinforce defenses in response to the requests for troops in his proclamation declaring the existence of an insurrection by President Lincoln after the firing on Fort Sumter in Charleston harbor in South Carolina by newly organized Confederate States military forces a few days earlier.\nIn 1873, the newly organized Union Railroad built a new set of tracks in northeastern Baltimore, connecting the original PW&B main line with the Northern Central Railway (NCRY) going north to York and Harrisburg, Pennsylvania. The new connection ran through the new Union Tunnel to NCRY's new Charles Street Station, north of Mount Royal Avenue. The Charles Street Station, originally named \"Union Station,\" was rebuilt twice and renamed \"Pennsylvania Station\" in 1928.\n20th century\nin 1936]]\nThe station on North Charles Street and its successors, in the northern reaches of the city, largely replaced the President Street Station for passenger service. The latter continued to serve as a freight station into the 1940s World War II era but served some passenger trains until 1911. The Pennsylvania Railroad, which acquired the PW&B in a merger in 1881, demolished the President Street's eastern train shed after heavy snow damage in 1913 and erected a new, shorter shed, built with wooden roof trusses.\nPresident Street Station was later used as a warehouse. The train shed was destroyed by fire, leaving only the present head house by 1970, when it was abandoned. In 1979, the derelict building was acquired by the City of Baltimore, which planned to demolish it to clear the way for a proposed southern extension of the Jones Falls Expressway (Interstate 83). The proposed extension, which was not built, would have connected to Interstate 95.\nIn 1989, the station's wooden arched roof collapsed in a snowstorm.\nBaltimore Civil War Museum\nIn the 1990s, a public-private partnership supported by the Friends of the President Street Station (FofPSS) funded the reconstruction/restoration/renovation of the vacant station and historic site, The building reopened in April 1997 as the \"Baltimore Civil War Museum\" with the assistance of the Baltimore and Ohio Railroad Museum, located at the nearby Mount Clare Shops.\nPresident Street Station, Inc. operated the museum until 2000, when the building lease was partnered with the Maryland Historical Society (MdHS), located on their campus of buildings on West Monument Street, until 2006. The lease/partnership arrangement with the City and the FoPSS originally expired in 2017.\nThe museum temporarily closed in 2007, due to budget constraints by the MdHS in connection with their nearby extension at the new Fells Point Maritime Museum on Thames Street, then re-opened on weekends only, operated by MdHS and subsequently by FofPSS volunteers. The Civil War Museum was open on weekends in February 2010, in observance of Black History Month, although heavy snowfall forced closure of the museum on two weekends.\nIn 2009, the City of Baltimore announced plans to designate the old depot as a landmark, which would restrict modifications to the building's exterior, and to request proposals for commercial development of the grounds. FofPSS opposed the city's plan, and called instead for the station's preservation and management as a museum by the National Park Service (NPS). The director of Baltimore City's Commission for Historical and Architectural Preservation, which will review proposals, said that any commercial use \"must be subordinate to the history\" and that a multi-use partnership would be ideal.\nAs of 2015, Friends of the Pennsylvania Street Station operates the museum.\nNational Park Service study\nIn 2015, U.S. Senators Barbara Mikulski and Benjamin Cardin introduced bill  The President Street Station Study Act, which would authorize the National Park Service to study the suitability and feasibility of designating the station as a unit of the National Park System. It was incorporated into the John D. Dingell Jr. Conservation, Management, and Recreation Act and enacted in 2019.\nIn 2019 NPS initiated its President Street Station study. In 2022 NPS conducted a public meeting and a public comment period on the study, and stated that the study was expected to be complete in 2023.\nReferences\nExternal links\n*[https://presidentstreetstation.org/ Official website]\n*[https://baltimore.org/listings/baltimore-civil-war-museum-at-president-street-station/ \"Historic President Street Station\"] at Visit Baltimore"
    }
  ]
}