{
  "content": [
    {
      "type": "text",
      "text": "# President of Rhodesia__disambig_2\n\n| constituting_instrument  =\n| precursor                = Queen of Rhodesia\n| formation                = 2 March 1970\n| first                    = Clifford Dupont\n| last                     = Henry Everard\n| abolished                = 1 June 1979\n| superseded_by            = President of Zimbabwe Rhodesia\n| unofficial_names         =\n| deputy                   =\n| salary                   =\n| website                  =\n}}\nThe president of Rhodesia was the head of state of Rhodesia from 1970 to 1979. As Rhodesia reckoned itself a parliamentary republic rather than a presidential republic at the time, the president's post was almost entirely ceremonial, and the real power continued to be vested in Rhodesia's prime minister, Ian Smith. Two individuals held the office of president, while two others served as acting presidents. Most were of British descent, but Clifford Dupont, the longest-serving, was of Huguenot stock.\nAs with Rhodesia itself, the position lacked international recognition for the entire period.\nRhodesia was internationally recognised as a British colony until 1980.\nOrigins\nOn 11 November 1965, Ian Smith's Rhodesian Front Government proclaimed the Unilateral Declaration of Independence (UDI) from the United Kingdom. On orders from the UK, the then-Governor of Southern Rhodesia, Sir Humphrey Gibbs, immediately sacked Smith and his cabinet. This action was ignored by Smith, who stated that the UDI brought into immediate force a new constitution which dispensed with the position of Governor – and with it, his reserve power to sack them.\nThe new constitution reconstituted Rhodesia as a Commonwealth realm. It recognised Queen Elizabeth II as \"Queen of Rhodesia,\" with a governor-general as her representative in the country. In lieu of the appointment of a governor-general, an \"Officer Administering the Government\" would exercise the functions of the governor-general.\nSmith had intended to name Deputy Prime Minister Clifford Dupont as Governor-General. However, Queen Elizabeth II would not even consider Smith's \"advice\" to appoint Dupont as her viceregal representative. Instead, Whitehall insisted that Gibbs was the Queen's only legitimate representative, and hence the only lawful authority in what it still maintained was the Colony of Southern Rhodesia – a position backed by most of the international community.\nRepublic\nFor five years, Smith and his government continued to profess loyalty to Queen Elizabeth II and recognised her as Rhodesia's head of state. Indeed, the UDI announcement ended with the words \"God Save The Queen.\" However, in 1969, Smith decided to sever links with the British Crown, by making the country a republic. At a referendum that year, the mostly white electorate voted overwhelmingly in favour of a republic.\nRhodesia was formally proclaimed a republic in 1970, and Dupont assumed the office of president. Smith's position as prime minister remained unchanged. A presidential flag was adopted, featuring a blue field with the coat of arms in the centre. Following the model of the state president of South Africa, Rhodesian presidents had little de facto executive power, and mostly acted on the advice of the prime minister.\nDupont resigned due to ill health in 1975. He was succeeded as president in 1976 by John Wrathall, who died in office in 1978. In 1979 there was an Internal Settlement, which saw a black majority government for the first time, and the country was renamed Zimbabwe Rhodesia. Josiah Zion Gumede was chosen as president. Like the UDI and the declaration of a republic, Zimbabwe Rhodesia was unrecognised internationally and in 1979, Britain resumed control of the rebel colony under the Lancaster House Agreement. Britain appointed Lord Soames as governor until the country became independent within the Commonwealth of Nations as Zimbabwe on 18 April 1980.\nList of presidents of Rhodesia\n;Parties\n|Rhodesian Front|border=1px solid #AAAAAA}}\n;Symbols\n{| class=\"wikitable\" text-align:center;\"\n|-\n! rowspan=2|\n! rowspan=2| Portrait\n! rowspan=2| Name\n! colspan=3| Term of office\n! rowspan=2| Political party\n! rowspan=2| Cabinet\n|-\n! Took office\n! Left office\n! Duration\n|-\n!colspan=\"8\"|Officer Administering the Government (1965–1970)\n| term_end          = 16 December 1965\n| timeinoffice      =\n| acting            = y\n| alt_party         = Rhodesian Front\n| cabinet           = Smith\n}}\n| alt_party         = Rhodesian Front\n| cabinet           = Smith\n}}\n|-\n!colspan=\"8\"|President of the Republic of Rhodesia (1970–1979)\n| acting            = y\n| alt_party         = Rhodesian Front\n| cabinet           = Smith\n}}\n| timeinoffice      =\n| alt_party         = Rhodesian Front\n| cabinet           = Smith\n}}\n| acting            = y\n| alt_party         = Rhodesian Front\n| cabinet           = Smith\n}}\n| alt_party         = Rhodesian Front\n| cabinet           = Smith\n}}\n| acting            = y\n| alt_party         = Rhodesian Front\n| cabinet           = Smith\n}}\n| acting            = y\n| alt_party         = Rhodesian Front\n| cabinet           = Transitional government\n}}\n| acting            = y\n| alt_party         = Rhodesian Front\n| cabinet           = Transitional government\n}}\n|}\nNotes\nTimeline\nColors =\nid:rf value:lightpurple legend:Rhodesian_Front\nid:gray1  value:gray(0.85)\nid:gray2  value:gray(0.95)\nDateFormat = dd/mm/yyyy\nPeriod     = from:01/01/1970 till:01/01/1980\nTimeAxis   = orientation:horizontal\nScaleMajor = gridcolor:gray1 unit:year increment:5 start:1970\nScaleMinor = gridcolor:gray2 unit:year increment:1 start:1970\nLegend     = columns:1 left:150 top:35 columnwidth:170\nTextData =\npos:(20,38) textcolor:black fontsize:M\ntext:\"Political party:\"\nBarData =\nbar:Dupont\nbar:Everard\nbar:Wrathall\nbar:Pithey\nPlotData =\nwidth:5 align:left fontsize:9 shift:(5,-4) anchor:till\nbar:Dupont\nfrom: 02/03/1970 till: 31/12/1975 color:rf text:\"Clifford Dupont\"\nbar:Everard\nfrom: 31/12/1975 till: 14/01/1976 color:rf\nfrom: 31/08/1978 till: 01/11/1978 color:rf\nfrom: 05/03/1979 till: 01/06/1979 color:rf text:\"Henry Everard (acting)\"\nbar:Wrathall\nfrom: 14/01/1976 till: 31/08/1978 color:rf text:\"John Wrathall\"\nbar:Pithey\nfrom: 01/11/1978 till: 05/03/1979 color:rf text:\"Jack Pithey (acting)\"\n}}\nSee also\n*Governor of Southern Rhodesia\n*Prime Minister of Rhodesia\n*President of Zimbabwe Rhodesia\n*President of Zimbabwe\nReferences\nExternal links\n*[https://www.nytimes.com/1990/11/08/obituaries/humphrey-gibbs-87-of-rhodesia-and-a-foe-of-white-rebels-dies.html Humphrey Gibbs, 87, of Rhodesia And a Foe of White Rebels, Dies]"
    }
  ]
}