{
  "content": [
    {
      "type": "text",
      "text": "# President of the Senate of the Philippines__disambig_1\n\n}}}}\n| flag = Flag of the Senate President of the Philippines.svg\n| flagsize = 160px\n| flagborder = yes\n| flagcaption = Flag of the Senate President\n| image = Vicente C. Sotto III, Senate portrait 2025.png\n| imagesize =\n| incumbent = Tito Sotto\n| incumbentsince = September 8, 2025\n| department = Senate of the Philippines\n| style =\n*The Honorable\n*His Excellency}}\n| member_of = Senate of the Philippines  National Security Council  Commission on Appointments\n| seat = GSIS Building, Pasay\n| appointer = Senate\n| termlength = At the Senate's pleasure; elected at the beginning of the new Congress by a majority of the senators-elect, and upon a vacancy during a Congress.\n| inaugural = Manuel L. Quezon\n| formation =\n| succession = Second\n| deputy = President pro tempore of the Senate\n| salary = Vary from ₱325,807 to ₱374,678 monthly\n}}\nPresident of the Senate of the Philippines (), commonly referred to as Senate President, is the title of the presiding officer and the highest-ranking official of the Senate of the Philippines, and third highest and most powerful official in the government of the Philippines. They are elected by the entire body to be their leader. The Senate president is second in the line of succession to the presidency, behind only the vice president and ahead of the speaker of the House of Representatives.\nThe incumbent Senate president is Tito Sotto of the Nationalist People's Coalition.\nElection\nThe Senate president is elected by the majority of the members of the Senate from among themselves. Since there are 24 senators, 13 votes are needed to win the Senate presidency, including any vacant seats or senators not attending the session. Although Senate presidents are elected at the start of each Congress, there had been numerous instances of Senate coups in which a sitting Senate president is unseated in the middle of session. Term-sharing agreements among senators who are both eyeing the position of the Senate president also played a role in changing the leadership of the Senate, but in a smooth manner, through the peaceful transition of power. Three known instances were in 1999, 2006, and 2018.\nUnlike most Senate presidents that are the symbolic presiding officers of the upper house, the Senate president of the Philippines wields considerate power by influencing the legislative agenda and has the ability to vote not just in order to break ties, although the Senate president is traditionally the last senator to vote. A tied vote, therefore, means that the motion is lost, and that the Senate president cannot cast a tie-breaking vote since that would mean that the presiding officer would have had voted twice.\nHistory\n20th century\n, the first president of the Philippine Senate, was the longest serving in history, with a total of 19 years in office.]]\nThe position was established upon the inauguration of the Senate of the Philippines in 1916, replacing the Philippine Commission as the upper house of the Philippine Legislature. The first Senate president, Manuel L. Quezon, was elected on October 16, 1916 by unanimous acclamation. He served until 1935 when he was sworn in as the first president of the Commonwealth of the Philippines.\nThe next officeholder was Manuel Roxas, who served from after the bicameral Congress was restored in 1945 until his election as president the following year. Control of the Senate actively shifted between Nacionalistas and Liberals from then until 1972 under a two-party system, resulting in various presiding officers from both parties in a single Congress.\nThe first known ouster of a president of the Senate of the Philippines occurred in 1949, when Liberal Party senators supporting president Elpidio Quirino’s bid for reelection joined forces with senators from the Nacionalista Party to unseat José Avelino, a fellow Liberal, as Senate president. The move stemmed from the rivalry between Quirino and Avelino over who would become the party’s standard-bearer in the upcoming presidential election. Quirino and Avelino ultimately ran for the presidency under separate Liberal Party factions, with Quirino defeating Avelino by receiving more than 50% of the votes. Mariano Jesús Cuenco was elected to replace Avelino and retained the position despite Avelino’s subsequent attempt to reclaim the Senate presidency during the Second Congress.\nThis Congress also saw the greatest number of changes in the Senate presidency. Quintín Paredes succeeded Cuenco in March 1952, but was replaced by Nacionalista senator Camilo Osías in mid-April. Osías was later unseated by Eulogio Rodriguez, who served as Senate president for a year before Osías regained the position in April 1953. In May 1953, Liberal senator Jose Zulueta was elected Senate president, serving until Rodriguez was reelected to the position in November of the same year. Rodriguez went on to serve as Senate president for ten consecutive years.\nHis successor, Ferdinand Marcos, was the only pre-martial law Senate president who switched parties in the middle of his tenure, when he left the Liberal Party after failing to gain its nomination as their presidential candidate for the 1965 elections and ran under the Nacionalista ticket.\nGil Puyat served as the last president of the Senate before his and other senators' terms were cut short after Marcos declared martial law. The bicameral Congress was eventually abolished upon the ratification of the 1973 Constitution, providing for a unicameral legislature, which would be later convened as the Batasang Pambansa.\nThe 1987 Constitution restored the Senate and the House of Representatives as the two houses of Congress under the presidency of Corazon Aquino, a year after Marcos was ousted by the People Power Revolution. Jovito Salonga, who previously served as senator from 1965 to 1972, was the first president elected by the reestablished Senate in the 8th Congress. He was ousted upon the election of Neptali Gonzales as Senate president, after a rump session was held by only 13 senators, enough to constitute a quorum, while senators supporting Salonga boycotted the session. The ouster was primarily attributed to declining public approval of the Senate’s leadership, as Salonga was one of the candidates in the 1992 presidential election, and many senators felt that a presidential candidate should not preside over a joint session of Congress that would canvass the election returns. Salonga questioned the legality of Gonzales’s election, as the official mace of the Senate was not present in the session hall when an aide from the Office of the Sergeant-at-Arms seized it. A makeshift mace was instead used (a framed seal of the Senate tied by Ernesto Maceda to the mace of the 1986 Constitutional Commission). For a brief period, the Senate had two presidents sworn into office, until Salonga relinquished his position to Gonzales after the session resumed in January 1992.\nGonzales stepped down on January 18, 1993, after fellow senators from Laban ng Demokratikong Pilipino and two senators from other rival parties voted Edgardo Angara into the Senate presidency. Angara was reelected when the 10th Congress first convened, only to be replaced by Gonzales in August 1995. Gonzales resigned the presidency of the chamber for a second time on October 10, 1996 after a coup staged by 16 senators. Ernesto Maceda of the Nationalist People's Coalition was installed in his place and served until January 1998. Neptali Gonzales then assumed the Senate presidency for a final, third time, serving until the end of his senatorial term on June 30 of the same year.\nMarcelo Fernan was elected over Francisco Tatad on July 27, 1998, and served until his resignation on June 28, 1999 due to failing health; he died two weeks later. President pro tempore Blas Ople acted as presiding officer until he was formally elected Senate president on July 26, 1999.\n21st century\nwas the second, and to date, last Senate president to serve three non-consecutive terms, after Neptali Gonzales.]]\nOple resigned the Senate presidency on July 12, 2000, honoring a term-sharing deal with Franklin Drilon, who succeeded him, with the former assuming the post of president pro tempore. Drilon was then replaced by Aquilino Pimentel Jr. on November 14, 2000, after 13 senators voted Drilon out following his decision to break away from the Lapian ng Masang Pilipino, the ruling coalition led by president Joseph Estrada, whom he called on to resign, to join the opposition supporting then–vice president Gloria Macapagal Arroyo in light of Estrada being impeached by the House of Representatives. Pimentel himself resigned at the height of the controversial trial of Estrada when 11 out of the 21 senators present voted not to open the second envelope containing crucial evidence that could prove acts of corruption committed by the president.\nThe Senate had its first president from the Nacionalista Party since 1972, with Manny Villar assuming the position on July 24, 2006 after agreeing to a term-sharing arrangement with Drilon two years earlier. Juan Ponce Enrile was unanimously elected to replace Villar on November 17, 2008, serving until his resignation in 2013 following criticisms of mishandling Senate funds, particularly the disparity in the distribution of his so-called \"cash gifts,\" with 18 senators receiving ₱1.6 million each and six receiving only ₱250,000 each.\nFranklin Drilon served a third term as chief of the Senate during the 16th Congress. Koko Pimentel, a member of the ruling party PDP–Laban, was elected in 2016 and remained Senate president until May 21, 2018, when he resigned in favor of, and nominated, Tito Sotto as his successor. Sotto, who was term-limited, was reelected in 2019 and led the Senate throughout the COVID-19 pandemic until 2022.\nJuan Miguel Zubiri was elected on July 25, 2022, at the start of the 19th Congress. He resigned the Senate presidency in May 2024 following criticisms from both supporters of president Bongbong Marcos and former president Rodrigo Duterte over investigations conducted by the Senate Committee on Public Order and Dangerous Drugs linking alleged leaked documents of the Philippine Drug Enforcement Agency to Marcos for illegal drug use, and due to his opposition to moves calling for charter change through people's initiative.\nOn May 20, 2024, Francis Escudero was elected Senate president, with 15 senators voting in favor, following a resolution signed by 13 senators circulating to oust Zubiri. Escudero defended his seat at the opening of the 20th Congress against Tito Sotto, winning with 19 votes to remain president of the Senate. However, on September 8, 2025, during a plenary session of the Senate, Sotto replaced Escudero as Senate president, on his second term as such, as the sole nominee for the position. This was also the first time in Senate history that the outgoing president administered the oath of office to their successor.\nPowers and duties\npresiding over a plenary session, circa 1964]]\nAccording to the Rule III, Section 3 of the Rules of the Senate, the Senate president has the following powers and duties:\n* To preside over the sessions of the Senate on the days and at the hours designated by it; to call the Senate to order and, if there is a quorum, to order the reading of the Journal of the preceding session and, after the Senate shall have acted upon it, to dispose of the matters appearing in the Order of Business in accordance with the Rules;\n* To decide all points of order;\n* To sign all measures, memorials, joint and concurrent resolutions; issue warrants, orders of arrest, subpoena and subpoena duces tecum;\n* To see to it that all resolutions of the Senate are complied with;\n* To have general control over the session hall, the antechambers, corridors and offices of the Senate;\n* To maintain order in the session hall, the antechambers, corridors and in the offices of the Senate, and whenever there is disorder, to take appropriate measures to quell it;\n* To designate an acting sergeant-at-arms, if the sergeant-at-arms resigns, is replaced or becomes incapacitated;\n* To appoint the subordinate personnel of the Senate in conformity with the provisions of the General Appropriations Act;\n* To dismiss any employee for cause, which dismissal in the case of permanent and classified employees shall be in conformity with the Civil Service Law; and\n* To diminish or increase the number of authorized personnel by consolidating or separating positions or items whenever the General Appropriations Act so authorizes and the total amount of salaries or allocations does not exceed the amount earmarked therein.\nThe Senate president is also the ex officio chairman of the Commission on Appointments, a constitutional body within the Congress that has the sole power to confirm all appointments made by the president of the Philippines. Under Section 3 of Chapter II of the Rules of the Commission on Appointments, the powers and duties of the Senate president as its ex officio chairman are as follows:\n* to issue calls for the meetings of the commission;\n* to preside at the meetings of the commission;\n* to preserve order and decorum during the session and, for that purpose, to take such steps as may be convenient or as the commission may direct;\n* to pass upon all questions of order, but from his decision, any member may appeal to the commission; and,\n* to execute such decisions, orders, and resolutions as may have been approved by the commission.\nThe Senate president also supervises the committees and attended its hearings and meetings if necessary and such committee reports are being submitted to their office.\nIn joint sessions of Congress, the Senate president presides on behalf of the upper chamber, such as during State of the Nation Addresses, where they traditionally sit to the left of the president on the rostrum.\nResidence\nThe Senate President does not have an official residence in Metro Manila where the Senate is holding its sessions but it maintains a residence (cottage) in Romulo Drive,  Baguio City.\nRelated officials\nActing Senate president\nDuring the absence of the Senate president, the rules of the chamber provide that the president pro tempore presides over Senate sessions as part of discharging his duties. However, on five separate occasions in which the Senate president was absent for an extended period (such as during official travel abroad) or had resigned, the Senate designated acting presiding officers to conduct its legislative business.\nSince 1930, five senators, including four who were serving as the incumbent president pro tempore, have acted as president of the Senate:\n* Sergio Osmeña, who filled in for Manuel Quezon during his illness in 1930;\n* José Clarín who served from 1932 to 1933 during Quezon's brief leave and trip to the United States over the Hare–Hawes–Cutting Act;\n* Fernando Lopez during a trip abroad by Eulogio Rodriguez;\n* Blas Ople in 1999 after the resignation of Marcelo Fernan; and\n* Jinggoy Estrada in 2013 after the resignation of Juan Ponce Enrile.\nPresiding Officer of the Senate Impeachment Court\n(left) administers the oath to 22 senator-judges before officially starting the impeachment proceedings of chief justice Renato Corona.]]\nAccording to Article XI, Section 3, Paragraph 6 of the 1987 Constitution, the Senate has the sole power to try and decide all cases of impeachment. It provides that when the president of the Philippines, after being impeached by the House of Representatives, is on trial and the articles of impeachment have been transmitted to the Senate, the chief justice of the Supreme Court shall preside over the Senate convened as an impeachment court. If an impeachable officer other than the president is on trial, the president of the Senate serves as the presiding officer and casts the last vote on the judgment in accordance with the Senate Rules of Procedure in Impeachment Trials.\nChief justice Hilario Davide Jr. presided over the trial of president Joseph Estrada from December 7, 2000, until January 16, 2001, when several senators voted not to open an envelope containing a letter purportedly proving Estrada's guilt on the charges against him. During the trial of chief justice Renato Corona in 2012, Juan Ponce Enrile served as the presiding officer of the impeachment court, becoming the first president of the Senate to serve in such capacity.\nAfter lengthy debates on the constitutionality of the articles of impeachment filed by the House of Representatives against vice president Sara Duterte, Senate president Francis Escudero was sworn in as presiding officer of the Senate impeachment court on June 9, 2025. However, this occurred prior to a formal trial, as a majority of senators in the 19th Congress voted the following day to remand the articles to the House, effectively halting the proceedings. The Supreme Court later unanimously nullified the complaint against Duterte for violating the “one-year bar rule” in the Constitution regarding the filing of cases against impeachable officers. The Senate subsequently adopted a resolution clarifying that the case was not being closed but merely set aside pending the Court’s resolution of the motion for reconsideration filed by the House. A trial in the Senate would only proceed if the Court reverses its decision, directs the Senate to conduct one, and the chamber votes to retrieve the case from the archives and act upon it.\nList of Senate presidents\nAll senators from 1941 onwards were elected at-large, with the whole Philippines as one constituency.\nEvery president of the Senate has been a member of a political party or faction; the number affiliated with each is:\n:|Liberal|border=1px solid #AAAAAA}} }} |Nacionalista|border=1px solid #AAAAAA}} }} |LDP|border=1px solid #AAAAAA}}  |NPC|border=1px solid #AAAAAA}}  |LAMP|border=1px solid #AAAAAA}} }} |PDP–Laban|border=1px solid #AAAAAA}}  |PMP|border=1px solid #AAAAAA}}  |Independent|border=1px solid #AAAAAA}} }}\n{| class=\"wikitable unsortable\" style=\"text-align:center; border:1px #aaf solid;\"\n|-\n! rowspan=\"2\" | No.\n! rowspan=\"2\" | Portrait\n! rowspan=\"2\" width=\"200\" | Name\n! colspan=\"2\" | Term of office\n! colspan=\"2\" rowspan=\"2\" | Party/Coalition\n! rowspan=\"2\" width=\"95\" |Legislature\n|-\n! width=\"95\"|\n! width=\"95\"|\n|-\n| rowspan=\"7\" |1\n| rowspan=\"7\" |\n| rowspan=\"7\" |Manuel L. QuezonSenator for the 5th District(1878–1944)\n| rowspan=\"7\" |October 16,1916\n| rowspan=\"7\" |November 15,1935\n| rowspan=\"2\" style=\"background:;\"|\n| rowspan=\"2\" width=\"95\" |Nacionalista(until 1922)\n|4th Legislature\n|-\n|5th Legislature\n|-\n| style=\"background-color:#191970\" |\n|Nacionalista Colectivista(1922–1925)\n|6th Legislature\n|-\n| rowspan=\"3\" style=\"background:;\"|\n| rowspan=\"3\" |Nacionalista(1925–1934)\n|7th Legislature\n|-\n|8th Legislature\n|-\n|9th Legislature\n|-\n|style=\"background:;\"|\n|Nacionalista Democratico(from 1934)\n|10th Legislature\n|-\n| colspan=\"8\"\n|-\n| rowspan=\"2\" |2\n| rowspan=\"2\" |\n| rowspan=\"2\" |Manuel Roxas(1892–1948)\n| rowspan=\"2\" |June 9,1945\n| rowspan=\"2\" |May 28,1946\n|style=\"background:;\"|\n|Nacionalista(until 1946)\n| rowspan=\"2\" |1st Commonwealth Congress\n|-\n| style=\"background:;\"|\n|Liberal(from 1946)\n|-\n| rowspan=\"2\" |3\n| rowspan=\"2\" |\n| rowspan=\"2\" |José Avelino(1890–1986)\n| rowspan=\"2\" |May 28,1946\n| rowspan=\"2\" |February 21,1949\n| rowspan=\"2\" style=\"background:;\"|\n| rowspan=\"2\" |Liberal\n|2nd Commonwealth Congress\n|-\n| rowspan=\"2\" |1st Congress\n|- style=\"height:61px\"\n| rowspan=\"2\" |4\n| rowspan=\"2\" |\n| rowspan=\"2\" |Mariano Jesús Cuenco(1888–1964)\n| rowspan=\"2\" |February 21,1949\n| rowspan=\"2\" |December 30,1951\n| rowspan=\"2\" style=\"background:;\"|\n| rowspan=\"2\" |Liberal\n|-\n| rowspan=\"7\" |2nd Congress\n|-\n|5\n|\n|Quintín Paredes(1884–1973)\n|March 5,1952\n|April 17,1952\n|style=\"background:;\"|\n|Liberal\n|-\n|6\n|\n|Camilo Osías(1889–1976)\n|April 17,1952\n|April 30,1952\n|style=\"background:;\"|\n|Nacionalista\n|-\n|7\n|\n|Eulogio Rodriguez(1883–1964)\n|April 30,1952\n|April 17,1953\n|style=\"background:;\"|\n|Nacionalista\n|-\n|8\n|\n|Camilo Osías(1889–1976)\n|April 17,1953\n|May 20,1953\n|style=\"background:;\"|\n|Nacionalista\n|-\n|9\n|\n|Jose Zulueta(1889–1972)\n|May 20,1953\n|November 30,1953\n|style=\"background:;\"|\n|Liberal\n|- style=\"height:50px\"\n| rowspan=\"4\" |10\n| rowspan=\"4\" |\n| rowspan=\"4\" |Eulogio Rodriguez(1883–1964)\n| rowspan=\"4\" |November 30,1953\n| rowspan=\"4\" |April 5,1963\n| rowspan=\"4\" style=\"background:;\"|\n| rowspan=\"4\" |Nacionalista\n|-\n|3rd Congress\n|-\n|4th Congress\n|-\n| rowspan=\"3\" |5th Congress\n|-\n| rowspan=\"2\" |11\n| rowspan=\"2\" |\n| rowspan=\"2\" |Ferdinand Marcos(1917–1989)\n| rowspan=\"2\" |April 5,1963\n| rowspan=\"2\" |December 30,1965\n|style=\"background:;\"|\n|Liberal(until 1964)\n|-\n|style=\"background:;\"|\n|Nacionalista(from 1964)\n|-\n|12\n|\n|Arturo Tolentino(1910–2004)\n|January 17,1966\n|January 26,1967\n|style=\"background:;\"|\n|Nacionalista\n| rowspan=\"2\" |6th Congress\n|- style=\"height:80px\"\n| rowspan=\"2\" |13\n| rowspan=\"2\" |\n| rowspan=\"2\" |Gil Puyat(1907–1980)\n| rowspan=\"2\" |January 26,1967\n| rowspan=\"2\" |January 17,1973\n| rowspan=\"2\" style=\"background:;\"|\n| rowspan=\"2\" |Nacionalista\n|-\n|7th Congress\n|-\n| colspan=\"8\" (January 17, 1973 – July 27, 1987)}}\n|-\n|14\n|\n|Jovito Salonga(1920–2016)\n|July 27,1987\n|January 18,1992\n|style=\"background:;\"|\n|Liberal\n| rowspan=\"2\" |8th Congress\n|- style=\"height:66px\"\n| rowspan=\"2\" |15\n| rowspan=\"2\" |\n| rowspan=\"2\" |Neptali Gonzales(1923–2001)\n| rowspan=\"2\" |January 18,1992\n| rowspan=\"2\" |January 18,1993\n| rowspan=\"2\" style=\"background:;\"|\n| rowspan=\"2\" |LDP\n|-\n| rowspan=\"2\" |9th Congress\n|- style=\"height:64px\"\n| rowspan=\"2\" |16\n| rowspan=\"2\" |\n| rowspan=\"2\" |Edgardo Angara(1934–2018)\n| rowspan=\"2\" |January 18,1993\n| rowspan=\"2\" |August 28,1995\n| rowspan=\"2\" style=\"background:;\"|\n| rowspan=\"2\" |LDP\n|-\n| rowspan=\"4\" |10th Congress\n|-\n|17\n|\n|Neptali Gonzales(1923–2001)\n|August 29,1995\n|October 10,1996\n|style=\"background:;\"|\n|LDP\n|-\n|18\n|\n|Ernesto Maceda(1935–2016)\n|October 10,1996\n|January 26,1998\n|style=\"background:;\"|\n|NPC\n|-\n|19\n|\n|Neptali Gonzales(1923–2001)\n|January 26,1998\n|June 30,1998\n|style=\"background:;\"|\n|LDP\n|-\n|20\n|\n|Marcelo Fernan(1927–1999)\n|July 27,1998\n|June 28,1999\n|style=\"background:;\"|\n|LDP\n| rowspan=\"5\" |11th Congress\n|-\n|21\n|\n| Blas Ople(1927–2003)\n|July 26,1999\n|April 13,2000\n| style=\"background:;\"|\n| LAMP\n|-\n| rowspan=\"2\" |22\n| rowspan=\"2\" |\n| rowspan=\"2\" |Franklin Drilon(born 1945)\n| rowspan=\"2\" |April 13,2000\n| rowspan=\"2\" |November 13,2000\n|style=\"background:;\"|\n|LAMP(until November 2000)\n|-\n| style=\"background:;\" |\n|Independent(from November 2000)\n|-\n|23\n|\n|Nene Pimentel(1933–2019)\n|November 13,2000\n|June 30,2001\n|style=\"background:;\"|\n|PDP–Laban\n|-\n| rowspan=\"3\" |24\n| rowspan=\"3\" |\n| rowspan=\"3\" |Franklin Drilon(born 1945)\n| rowspan=\"3\" |July 23,2001\n| rowspan=\"3\" |July 24,2006\n|style=\"background:;\"|\n|Independent(until 2003)\n| rowspan=\"2\" |12th Congress\n|- style=\"height:44px\"\n| rowspan=\"2\" style=\"background:;\"|\n| rowspan=\"2\" |Liberal(from 2003)\n|-\n| rowspan=\"2\" |13th Congress\n|- style=\"height:75px\"\n| rowspan=\"2\" |25\n| rowspan=\"2\" |\n| rowspan=\"2\" |Manny Villar(born 1949)\n| rowspan=\"2\" |July 24,2006\n| rowspan=\"2\" |November 17,2008\n| rowspan=\"2\" style=\"background:;\"|\n| rowspan=\"2\" |Nacionalista\n|-\n| rowspan=\"2\" |14th Congress\n|- style=\"height:60px\"\n| rowspan=\"2\" |26\n| rowspan=\"2\" |\n| rowspan=\"2\" |Juan Ponce Enrile(1924–2025)\n| rowspan=\"2\" |November 17,2008\n| rowspan=\"2\" |June 5,2013\n| rowspan=\"2\" style=\"background:;\"|\n| rowspan=\"2\" |PMP\n|-\n| 15th Congress\n|-\n|27\n|\n|Franklin Drilon(born 1945)\n|July 22,2013\n|June 30,2016\n|style=\"background:;\"|\n|Liberal\n|16th Congress\n|-\n|28\n|\n|Koko Pimentel(born 1964)\n|July 25,2016\n|May 21,2018\n|style=\"background:;\"|\n|PDP–Laban\n| rowspan=\"2\" |17th Congress\n|- style=\"height:78px\"\n| rowspan=\"2\" |29\n| rowspan=\"2\" |\n| rowspan=\"2\" |Tito Sotto(born 1948)\n| rowspan=\"2\" |May 21,2018\n| rowspan=\"2\" |June 30,2022\n| rowspan=\"2\" style=\"background:;\"|\n| rowspan=\"2\" |NPC\n|-\n|18th Congress\n|-\n|30\n|\n|Juan Miguel Zubiri(born 1969)\n|July 25,2022\n|May 20,2024\n|style=\"background:;\"|\n|Independent\n| rowspan=\"2\" |19th Congress\n|- style=\"height:66px\"\n| rowspan=\"2\" |31\n| rowspan=\"2\" |\n| rowspan=\"2\" |Francis Escudero(born 1969)\n| rowspan=\"2\" |May 20,2024\n| rowspan=\"2\" |September 8,2025\n| rowspan=\"2\" style=\"background:;\"|\n| rowspan=\"2\" |NPC\n|-\n| rowspan=\"2\" |20th Congress\n|- style=\"height:78px\"\n|32\n|\n|Tito Sotto(born 1948)\n|September 8,2025\n|Incumbent\n| style=\"background:;\" |\n|NPC\n|}\nTimeline\nSenate presidents by time in office\n{| class=\"wikitable sortable\"\n! data-sort-type=\"number\" |Rank\n!Name\n! class=\"unsortable\" |Time in office\n!TE\n! data-sort-type=\"number\" |\n|- style=\"height:2em\"\n!1\n|\n|\n|\n|; 1919; 1922; 1925; 1928; 1931; 1934\n|- style=\"height:2em\"\n!2\n|\n|10 years, 113 days\n|\n|; 1953; 1954; 1958; 1962\n|- style=\"height:2em\"\n!3\n|\n|8 years, 104 days\n|\n|; 2001; 2004; 2013\n|- style=\"height:2em\"\n!4\n|\n|\n|\n|; 1970\n|- style=\"height:2em\"\n!5\n|\n|\n|\n|; 2010\n|- style=\"height:2em\"\n!6\n|\n|\n|\n|\n|- style=\"height:2em\" bgcolor=#D4F2CE\n!7\n|\n|\n|\n|; 2019; 2025\n|- style=\"height:2em\"\n!8\n|\n|\n|\n| (2)\n|- style=\"height:2em\"\n!9\n|\n|\n|\n|\n|- style=\"height:2em\"\n!10\n|\n|\n|\n|\n|- style=\"height:2em\"\n!11\n|\n|\n|\n|; 1995\n|- style=\"height:2em\"\n!12\n|\n|2 years, 197 days\n|\n| (2); 1995; 1998\n|- style=\"height:2em\"\n!13\n|\n|\n|\n|; 2007\n|- style=\"height:2em\"\n!14\n|\n|\n|\n|\n|- style=\"height:2em\"\n!15\n|\n|\n|\n|\n|- style=\"height:2em\"\n!16\n|\n|\n|\n|; 2025\n|- style=\"height:2em\"\n!17\n|\n|\n|\n|\n|- style=\"height:2em\"\n!18\n|\n|\n|\n|\n|- style=\"height:2em\"\n!19\n|\n|\n|\n|\n|- style=\"height:2em\"\n!20\n|\n|\n|\n|\n|- style=\"height:2em\"\n!21\n|\n|\n|\n|\n|- style=\"height:2em\"\n!22\n|\n|\n|\n|\n|- style=\"height:2em\"\n!23\n|\n|\n|\n|\n|- style=\"height:2em\"\n!24\n|\n|46 days\n|\n|; 1953\n|- style=\"height:2em\"\n!25\n|\n|\n|\n|\n|- style=\"height:2em\"\n|}\nNotes\nSources\n*[http://www.senate.gov.ph/senators/senlist.asp List of Senators of the Philippines]\n*[http://www.senate.gov.ph/senators/roll.asp Roll of Senate Presidents]\nReferences\n}}\n}}"
    }
  ]
}