{
  "content": [
    {
      "type": "text",
      "text": "# President of Mongolia__disambig_1\n\n| insignia = State emblem of Mongolia.svg\n| insigniasize = 100px\n| insigniacaption = State Emblem of Mongolia\n| image = Ukhnaagiin Khürelsükh (2024) (cropped).jpg\n| imagesize = 200px\n| incumbent = Ukhnaagiin Khürelsükh\n| incumbentsince = 25 June 2021\n| style = His Excellency\n| status = Head of stateExecutive President\n| seat = Ulaanbaatar, Mongolia\n| nominator = State Great Khural Political parties with representation nominate candidates\n| appointer = Direct popular vote\n| inaugural = Punsalmaagiin Ochirbat\n| termlength = Six years,\n| termlength_qualified = non renewable\n| constituting_instrument = Constitution of Mongolia (1992)\n| deputy = Vice President of Mongolia Chairman of the State Great Khural\n| salary = 82,393,920 ₮/US$ 24,304 annually (2024)\n| formation =\n| website = [http://www.president.mn president.mn]\n| residence = President’s Residence at the Ikh Tenger Complex\n}}\nThe president of Mongolia, }} is the executive head of state of Mongolia. The current president is Ukhnaagiin Khürelsükh.\nPolitical parties with representation in the State Great Khural nominate candidates. The president was originally limited to two four-year terms, but this was changed to a non-renewable six-year term starting with the 2021 presidential election. The president can be removed from office if two-thirds of the Khural find them guilty of abusing their powers or violating their oath. Before inauguration, however, the president-elect must suspend their membership of any political party.\nPowers of the president\n*Nominating a candidate for the office of Prime Minister, who is then approved or rejected by the State Great Khural (parliament). This is a ceremonial responsibility, as the Khural will most likely reject any nominee who is not its own choice – in effect, the prime minister is appointed by the Khural.\n*Vetoing the Khural's legislation (can be overridden with a two-thirds majority)\n*Approving judicial appointments\n*Appointing the chief judge of the Supreme Court of Mongolia\n*Chairing the National Security Council of Mongolia\n*Acting as commander-in-chief of the armed forces.\n*Nominates the prosecutor general, the official in charge of implementing the laws, who is then approved or rejected by the Khural.\n*Provides guidelines for the activities of the Government.\nResidences\nGenerally, Mongolian leaders have lived at the president's residence at the Ikh Tenger Complex (). The complex is a protected area in the Bogd Khan Mountain. The residence is located next to the mansions of the Speaker of Parliament and Prime Minister.\nWinter Palace\nIn 2017, newly elected president Battulga said that he intended to live in the \"Winter Palace\" in central Ulaanbaatar, also known as the marshal's residence, in a departure from tradition. It is located in the heart of the capital between Peace Avenue and Seoul Street (next to the 1st School and the Russian Embassy). The two story-building was built in 1947 as the residence of Marshal Khorloogiin Choibalsan. It has two luxury rooms and five other rooms as well as 52-80 person capacity banqueting hall.\nList of presidents\nSee also\n*List of heads of state of Mongolia\n*Vice President of Mongolia\n*Prime Minister of Mongolia\nNotes\nReferences\nExternal links\n* [https://president.mn Official website]\n* [https://web.archive.org/web/20081014005530/http://www.president.mn/index.php Official website (2008)]"
    }
  ]
}