{
  "content": [
    {
      "type": "text",
      "text": "# President of the Quorum of the Twelve\n\nPresident of the Quorum of the Twelve (also President of the Quorum of the Twelve Apostles, President of the Council of Twelve Apostles, and President of the Twelve) is a leadership position that exists in some of the churches of the Latter Day Saint movement. In these churches, the President is the head of the Quorum of the Twelve.\nPosition in the original Latter Day Saint church\nWhen Joseph Smith organized the first Quorum of the Twelve of the Church of the Latter Day Saints in 1835, he ranked the members in order of seniority, by age. The oldest—and therefore most senior—member was believed to be Thomas B. Marsh; he was designated by Smith as the quorum president. When new members were added to the quorum due to vacancies caused by death, apostasy, or excommunication, the new member was received as the junior member of the quorum, regardless of their age. The principle was established that the senior member of the quorum was to be its president.\nWhen Marsh was excommunicated from the church in 1839, Brigham Young was the senior member of the quorum, and he therefore became the President of the Quorum. Young still held this position when Smith was killed  in 1844. As President of the Quorum of the Twelve Apostles, Brigham Young claimed the authority to lead the church after Joseph Smith's death. The majority of Latter Day Saints endorsed Young's leadership; the church Young and his followers continued is today the Church of Jesus Christ of Latter-day Saints (LDS Church). Other Latter Day Saint denominations were formed by Latter Day Saints who dissented from Young's leadership over the church.\nThe Church of Jesus Christ of Latter-day Saints\nIn the LDS Church, the President of the Quorum heads the Quorum of the Twelve Apostles, the second-highest leadership body in the church. The identity of the quorum president is determined by apostolic seniority: the member of the quorum who has been an apostle for the longest period of time is the president of the quorum. When the President of the Church dies, the highest-governing body, the First Presidency, is dissolved and the Quorum of the Twelve becomes the governing body of the church. In every instance, the President of the Quorum of the Twelve Apostles has been selected by the Quorum as the next President of the Church. Therefore, the senior apostle in the LDS Church is the President of the Church, and the second-most senior apostle is the President of the Quorum of the Twelve Apostles.\nThe President of the Quorum of the Twelve Apostles is set apart to the position and exercises priesthood \"keys\" of quorum presidency. The president conducts Quorum meetings and otherwise acts as administrative leader of the apostles.\nDue to the death of Boyd K. Packer on July 3, 2015, Russell M. Nelson became the new quorum president.\nCommunity of Christ\nIn the Community of Christ, the President of the Council of Twelve Apostles is the head of the church's Council of Twelve Apostles, the second-highest leadership body of the church. The quorum president is recommended by the First Presidency and is formally elected by the World Conference. The position is not based on seniority in the Council.\nAs of 2014, the President of the Council of Twelve Apostles is Linda L. Booth; she is the first woman to serve in this position.\nThe Church of Jesus Christ (Bickertonite)\nIn The Church of Jesus Christ (Bickertonite), the President of the Quorum of Twelve Apostles is the administrative head of the Quorum of Twelve Apostles and is selected from its membership. The President of the Church is also selected from the membership of the Quorum and remains a member of the Quorum during his presidency.\nNotes"
    }
  ]
}