{
  "content": [
    {
      "type": "text",
      "text": "# Presidential Administration of Uzbekistan\n\n| native_name_a   =\n| native_name_r   =\n| type            =\n| seal            = Flag of the President of Uzbekistan.svg\n| seal_width      = 150\n| seal_caption    = Flag of the president of Uzbekistan\n| logo            =\n| logo_width      =\n| logo_caption    =\n| image           =\n| image_size      =\n| image_caption   =\n| formed          =\n| dissolved       =\n| jurisdiction    =\n| headquarters    = Tashkent, Uzbekistan\n| motto           =\n| employees       = 423 (managerial personnel)\n| budget          =\n| chief1_name     = Saida Mirziyoyeva\n| chief1_position = Head\n| chief2_name     = Sardor Umurzakov\n| chief2_position = Advisor\n| public_protector =\n| deputy          =\n| parent_department =\n| parent_agency   =\n| parent_agency_type =\n| child1_agency   =\n| child2_agency   =\n| keydocument1    =\n| website         =\n| agency_id       =\n| map             =\n| map_size        =\n| map_caption     =\n| footnotes       =\n| embed           =\n}}\nThe Administration of the President of the Republic of Uzbekistan () is a state body that officially provides support for the activities of the President of Uzbekistan.\nPowers and duties\nIn the official website of the President of Uzbekistan, it states that the Administration assists the implementation of the powers of the President, analyzes the local and global situation, assists in ensuring law and order in the country, makes proposals regarding local and foreign affairs, creates communication between the Presidency and the people, watches over and assists the implementation of Presidential Decrees, resolutions, and decisions.\nHistory\nWhen held by Sardor Umurzakov, the position of Chief of Staff, which was the highest-ranking in the Administration after the President himself, acted as the president's \"de facto enforcer\".\nIn September 2023, the post of the Chief of Staff was dissolved, and the highest-ranking title in the Administration was now First Assistant to the President, to which President Shavkat Mirziyoyev's daughter Saida Mirziyoyeva was appointed.\nIn June 2025, position of Head was re-established and First Advisor to the President Saida Mirziyoyeva was appointed to the position. Sardor Umurzakov was made her Independent Advisor.\nStructure\nAs of 2023, the number of Advisors to the President was 11, and they were as follows:\n* Advisor-Speechwriter to the President\n* Advisor to the President on Coordination of Law Enforcement and Regulatory Agencies\n* Advisor to the President on Sustainable Development of the Aral Sea Region\n* Advisor to the President on issues of socio-political development\n* Advisor – Director of the National Agency for Social Protection\n* Advisor to the President on Economic Development\n* Advisor to the President on Personnel Policy\n* Advisor to the President on Religion and Interethnic relations\n* Advisor to the President on Special Assignments, held by Sardor Umurzakov\n* Advisor to the President on Energy Security\n* Advisor to the President on Agricultural Development\nThe Administration is now headed by two people since June 2025:\n* Head of the Administration, now Saida Mirziyoyeva\n* Independent Advisor to the Head\nReferences"
    }
  ]
}