{
  "content": [
    {
      "type": "text",
      "text": "# President of Iraq__disambig_1\n\n|tag2= |name2=}}\n| insignia = Coat of arms of Iraq.svg\n| insigniasize =\n| insigniacaption = Coat of arms of Iraq\n| insigniaalt =\n| flag =\n| flagsize =\n| flagalt =\n| flagborder = yes\n| flagcaption =\n| image = Abdul Latif Rashid in Davos - 2025 - 02 (cropped).jpg\n| imagesize =\n| alt =\n| imagecaption =\n| incumbent = Abdul Latif Rashid\n| acting =\n| incumbentsince = 17 October 2022\n| department = Executive branch of theFederal Government of the Republic of Iraq\n| style = His Excellency\n| type = Head of state\n| status =\n| abbreviation =\n| member_of =\n| reports_to =\n| residence = Radwaniyah Palace, Baghdad\n| seat =\n| nominator =\n| appointer = Parliamentary vote\n| appointer_qualified =\n| termlength = Four years,\n| termlength_qualified = renewable once\n| constituting_instrument = Constitution of Iraq (2005)\n| precursor = King of Iraq\n| formation =\n| first = Muhammad Najib ar-Ruba'i\n| last =\n| abolished =\n| superseded_by =\n| succession =\n| unofficial_names =\n| deputy = Vice President\n| website =\n| footnotes =\n}}\nThe president of the Republic of Iraq)}} is the head of state of Iraq. Since the mid-2000s, the presidency is primarily a symbolic office, as the position does not possess significant power within the country according to the constitution adopted in October 2005.\nDue to the Muhasasah political system informally adopted since the creation of the new Iraqi federal state, the office is expected to be held by a Kurd (all were from the PUK party). Although, it is not an official legal requirement.\nOn the 2022 Iraqi presidential election held on 13 October 2022, the Iraqi parliament voted Abdul Latif Rashid as the new president of Iraq.\nElection\nAccording to Article 61 of the Iraqi Constitution, the President is elected through a process of indirect suffrage; that is, an election held by the Council of Representatives, instead of popular mandate.\nPowers of the Iraqi President\nAccording to Article 73 of the Iraqi Constitution, the powers of the president are:\n* Issuing a special pardon on the recommendation of the Prime Minister, with the exception of what is related to the private right, and those convicted of international crimes, terrorism, and financial and administrative corruption.\n* Ratification of international treaties and agreements, after the approval of the House of Representatives, and they are considered ratified after fifteen days from the date of their receipt by the President.\n* Ratifiying and issuing laws enacted by the Council of Representatives, considered ratified after fifteen days from the date of their receipt by the President.\n* Calling the elected Council of Representatives to convene within a period not exceeding fifteen days from the date of ratification of the election results, and in other cases stipulated in the constitution.\n* To award medals and decorations based on the recommendation of the Prime Minister, in accordance with the law.\n* To accredit ambassadors.\n* Issuing republican decrees.\n* To ratify death sentences issued by the competent courts.\n* Performing the mission of the High Command of the Armed Forces for honorary and ceremonial purposes.\n* Exercising any other presidential powers stipulated in [the] constitution.\nConditions for running for the office of President\nThe Iraqi constitution, in Article 68, specifies a number of conditions that a candidate for the presidential office must:\n* Be an Iraqi by birth and of Iraqi parents.\n* Be fully qualified and have attained forty years of age.\n* Have a good reputation, political experience, and is known for his integrity, uprightness, justice, and devotion to the homeland.\n* Have not been convicted of a crime involving moral turpitude.\nPresidential Palaces\nIn the early days of the Iraqi Republic in 1958, neither the head of the Sovereign Council, Muhammad Najib al-Rubaie, nor the Prime Minister, Abdul Karim Qassem, took any palace to be an official republican palace for the state. Al-Rubaie stayed in his personal home before 14 July 1958. Qassem also remained in his home before the revolution, while his office at the Ministry of Defense was taken as his official office in his capacity as prime minister. Sometimes he slept there.\nWith Abd al-Salam's accession to power in 1963, he focused his attention on the palace that was being built during the reign of King Faisal II and in which he was to marry later. Abd al-Salam took care of the palace and completed it in 1965, the first republican palace of Iraq.\nAnd it continued as a republican palace until 2003, at the beginning of the American occupation of Iraq.\nThe American forces used it as a headquarters in the first days of the occupation, then made it into an American embassy until 1 January 2009, when the Iraqi government took over it, restored it and changed its name to the Government Palace. In 2012, the Arab summit postponed from the previous year was held in this palace.\nThe current presidential palace in which the Iraqi president resides is the Peace Palace, which was built during the era of Saddam Hussein. Another complex used as a presidential palace during Saddam Hussein's rule was the Radwaniyah presidential palace complex. In addition, there are a scattered number of presidential palaces in Baghdad and the rest of the provinces, such as the Sujood Palace and Al-Faw Palace in Baghdad, and the presidential palaces in Mosul, Basra, Tikrit and Babylon.\nPresidents of Iraq\nAfter the revolution of 14 July 1958, elections were scheduled to be held to choose a President of the Republic, but they never took place. Therefore, the position of the president remained suspended, while Najib al-Rubaie was assigned to head the Sovereignty Council, which was considered as the president of the republic. Thus, Abd al-Salam Aref became the first to bear the title of President of the Iraqi Republic.\nPresidency Council\nThe presidency council was an entity that operated under the auspices of the \"transitional provisions\" of the Constitution. According to the Constitution, the Presidency Council functioned in the role of the president until one successive term after the Constitution was ratified and a government was seated. The presidency council had the additional power to send legislation back to the Council of Representatives for revision.\nNotes\nSee also\n* List of presidents of Iraq\n* List of prime ministers of Iraq\n* List of kings of Iraq\nReferences"
    }
  ]
}