{
  "content": [
    {
      "type": "text",
      "text": "# President's House, University of Michigan__disambig_1\n\n| locmapin =\n| built =\n| architect = Alexander J. Davis\n| builder = Harpin Lum\n| architecture = Italianate\n| added = October 15, 1970\n| area = less than one acre\n| refnum = 70000285\n}}\nThe '''President's House''' is the official residence of the President of the University of Michigan, located at 815 South University Avenue, on the University of Michigan's central campus in Ann Arbor, Michigan. The house is the oldest building on the university campus, and is one of the original four houses constructed for faculty when the university moved from Detroit to Ann Arbor. The house was listed on the National Register of Historic Places in 1970.\nHistory\n, showing the campus in 1847 with two of the faculty houses shown on the left.]]\nIn 1840, the University of Michigan moved from its original location in Detroit to Ann Arbor. To house faculty members, four houses were constructed by builder Harpin Lum, costing a total of $26,900 (equivalent to $}} in ). The houses may have been designed by campus architect Alexander J. Davis, but there is no record of the actual architect.\nUntil 1852, the university was governed by a faculty committee, and there was no president. Henry Philip Tappan became the first president of the university in 1852 and moved into this house, which was at the time vacant. Tappan was succeeded in 1863 by Erastus Otis Haven, who added a single-story kitchen to the house, as well as a third story. Haven was succeeded in 1871 by James Burrill Angell, who had made his acceptance of the post conditional on refurbishment of the President's House. During Angell's tenure, the President's House was substantially altered by adding a west wing containing a semi-circular library and more bedrooms.\nAngell's successor, Harry Burns Hutchins, chose not to live in the house, and it remained vacant during Hutchins's tenure. When Marion LeRoy Burton was appointed in 1920, the President's House was thoroughly renovated at his request, adding a sun parlor with a sleeping porch and enclosing a rear porch to make a dining area. Subsequent presidents did some renovation work on the interior, but exterior changes were confined to the addition of a small study and glassed-in plant room during Alexander Grant Ruthven's tenure, and a glassed-in porch and stone terrace during Harlan Hatcher's tenure. In 1970, what is now the Hatcher Graduate Library was constructed behind the house. The house was extensively renovated in the late 1980s.\nAfter former President Mark Schlissel was dismissed in early 2022 for an inappropriate relationship with a subordinate, the university regents voted to allocate $15 million to address deferred maintenance at the house, expand the upstairs living quarters, and make the building ADA compliant. The renovation was completed in fall 2023 at a cost of $11.5 million. The house was then occupied by President Santa Ono and his family. Ono resigned in May 2025, and Interim President Domenico Grasso moved in by early July.\nDescription\nThe President's House is a three-story Italianate structure, with numerous wing additions to the original central mass. It is constructed of bricks covered with stucco, the stucco being marked to resemble mortar courses. The house is topped with a truncated hipped roof supported by double brackets, and a balustrade in the center. The main entrance is through a small porch with Doric columns. The house currently has 22 rooms.\nSee also\n*\n*\nReferences"
    }
  ]
}