{
  "content": [
    {
      "type": "text",
      "text": "# Presidential state car (Brazil)__disambig_1\n\nThe Presidential State Car is the official state car of the president of Brazil.\nNon-ceremonial vehicles\nFor day-to-day ground travel, the president of Brazil uses an armored version of the 2024 Chery Tiggo 8 Max Drive.\nPreviously, non-ceremonial transportation for the president was an Australian-built Chevrolet Omega C, which was included in the presidential fleet and used by the president in some shifts. The car was even used in the parade of independence on September 7, 2016 and 2018, replacing the 1952 Rolls-Royce Silver Wraith (see below) traditionally used in the parade. Also, an armored 2011 Ford Fusion Hybrid, built on a Ford CD3 platform, was received. This vehicle replaced the 2008 Ford Fusion used previously, at which point the Ford Fusion was also included in the presidential motorcade.\nAt an earlier stage, president Fernando Henrique Cardoso (who served from 1995 to 2003) and his successor, Luiz Inácio Lula da Silva, had used an Australian-built Chevrolet Omega CD.\nIn February 2012, the Brazilian government bought 12 Canadian-built Ford Edge models, 10 of which were armored, for the use of President Dilma Rousseff and her security team.\nSince then, besides Ford Edge and Fusion Hybrid, some Ford Bronco Sport and Mitsubishi Outlander models have been used as part of agreements with the automakers. In January 2024, president Luiz Inácio Lula da Silva received a BYD Tan EV from BYD Brazil’s CEO, to commemorate BYD investments in the country. The car is expected to be lent for one year.\nThe state-provided vehicles of the federal government's most important officials (the president, ministers, magistrates, etc.) use green-and-yellow license plates (see below). Each plate is adorned with the coat of arms of Brazil and displays the official's title on it (such as President of the Republic, President of the Senate, Defense Minister, or Supreme Court President).\nGallery\nFile:PR comboio.jpg|Presidential 2004 Chevrolet Omega CD\nFile:Brazilian Presidential Motorcade.jpg|Presidential 2008Ford Fusion\nFile:2019 Desfile Cívico 7 de Setembro - 48693129622.jpg|Presidential license plate in September 2019\nCeremonial state car\nThe ceremonial state car of Brazil is a 1952 Rolls-Royce Silver Wraith, which is used by the president of Brazil on special occasions like Independence Day commemorations, state visits, and the inauguration of the president-elect. This is one of the two Rolls-Royce models purchased by former president Getúlio Vargas in 1953.\nOrigins\nWhen Getúlio Vargas became president in 1951, he had two Cadillacs as official state cars, dating from 1941 and 1947 respectively. Rolls-Royce was chosen to prepare four Silver Wraith models with special modifications for security, with the intention to purchase two examples. Vargas received the first hardtop model on 31 January 1953. The first foreign head of state to use it was General Manuel Odria, President of Peru.\nThe government paid £5,831 for the hardtop model and £7,540 for the second Silver Wraith, a cabriolet. The cars were paid for by wealthy friends as a present to Vargas himself, on condition that he would donate them to the presidency at the end of his term in office.\nWith political problems, Vargas shot himself in the chest on 24 August 1954 and, with his suicide, the handover did not happen. The cars became part of the President's estate and were claimed by his family. The solution only came in 1957, although the cars had still been used by President Juscelino Kubitschek de Oliveira in the interim. The family took the hardtop Rolls-Royce and gave the cabriolet to the presidency. The last official service of the hardtop model was for the personal transportation of Berta Craveiro Lopes, wife of Portuguese president General Craveiro Lopes.\nNowadays\nThe car can be seen in state ceremonies that take place on the first Sunday of each month at the Planalto Palace and in the streets around it. Sometimes, the car is also used for the rehearsal of state ceremonies and parades. Its speed limit is 80&nbsp;km/h, but it is rarely seen to travel faster than 20&nbsp;km/h.\nThe daily transportation of the president is made by modern vehicles, with the Rolls-Royce reserved exclusively for ceremonial occasions. In 2001, the Rolls-Royce was sent for restoration by President Fernando Henrique Cardoso after 48 years of service.\nGallery\nFile:Solenidades. Homenagens (46509135282) (cropped).jpg|Jair Bolsonaro riding in the car in January 2019\nFile:Rolls Royce da Presidência (9684134369).jpg|The Spirit of Ecstasy hood ornament (kneeling version) on the car\nSee also\n* Official state car\nReferences\nExternal links\n* [https://web.archive.org/web/20101231061359/http://www.maxicar.com.br/old/reporter/rollsroyce.asp History of the Presidency of the Republic's Rolls Royce (in Portuguese)]\n* [https://www.youtube.com/watch?v=cbrDn_AOYTU A video of the Presidential Rolls Royce] [https://www.youtube.com/watch?v=JMVTJ_jq-kA Idem]"
    }
  ]
}