{
  "content": [
    {
      "type": "text",
      "text": "# President Ramon Magsaysay State University\n\n|image        = President_Ramon_Magsaysay_State_University.png\n|motto        = Leading the Path Towards Greater Opportunities\n|established  = 1910\n|type         = State University\n|head_label   = Regular Chairman & Presiding Officer (Board of Regent)\n|head         = Hon. Ronald Adamat (Commissioner, CHED)\n|president    = Roy Villalobos\n|city         = Zambales\n|country      = Philippines\n|coordinates  =\n|pushpin_map  = Luzon mainland#Philippines\n|pushpin_map_caption = Location in Luzon##Location in the Philippines\n|campus       =\n|colors       =  Blue & gold\n|sports_nickname = \"Ramonian\"  \"Blue Jaguars\"\n|affiliations = PASUC; AACCUP; Development Council of State Universities and Colleges in Region III Center for Institutional Research and Policy Studies (DC-SUC/CIRPS); State Colleges and Universities Athletic Association, Region III (SCUAA III); Central Luzon Agriculture and Resources Research and Development Consortium (CLARRDEC); Philippine Council for Agriculture, Forestry and Natural Resources Research and Development (PCARRD); State Universities and Colleges – Association of Colleges of Agriculture in the Philippines (SUC-ACAP); Association of State Colleges and Universities - Solid North (ASCU-SN)\n|athletics_affiliations = State Colleges and Universities Athletic Association - SUC III (Olympics);  DC-SUC III/CIRPS; SCU Faculty Association of Region 3 (SCUFAR 3)\n|website      =\n}}\nPresident Ramon Magsaysay State University, commonly referred to as PRMSU, is a state university in Zambales established in 1910. The university is named after the province's greatest son and former President of the Republic of the Philippines, President Ramon Magsaysay. In 2017, the name of the university was changed from Ramon Magsaysay Technological University to its present name. The main campus of the university is located in the Municipality of Iba, Province of Zambales. It also has satellite campuses in the municipalities of Sta. Cruz, Candelaria, Masinloc, Botolan, San Marcelino, Castillejos all in the province of Zambales. The university also offers nursing courses at the Mondriaan Aura College in Subic Bay Freeport Zone, Business Administration at the Wesleyan College of Manila under a consortium program.\nHistory\nThe President Ramon Magsaysay State University, a merger of three public education institutions in the province of Zambales, was established by virtue of Republic Act 8498, enacted on February 12, 1998, through the initiative of Congressman Antonio M. Diaz. The University Charter integrated the former Ramon Magsaysay Polytechnic College (RMPC) in Iba, the former Western Luzon Agricultural College (WLAC) in San Marcelino, and the former Candelaria School of Fisheries (CSF) in Candelaria. The strengths of its parent-institutions, which had existed since the early 1900s, served as PRMSU's springboard for its accelerated growth and development.\nThe RMPC in 1998, which is now PRMSU's Main Campus, was founded as a farm school in 1910. It was converted into a provincial trade school in 1919. Through the years, it metamorphosed into Zambales Trade School in 1933, Western Luzon School of Arts and Trades in 1953, Zambales School of Arts and Trades in 1957, and Ramon Magsaysay Memorial School of Arts and Trades in 1961. It became a DECS-supervised College (RMPC) in 1993 and a chartered state college in 1995.\nWLAC, now the San Marcelino Campus, started as a farm school in 1927. It became the Zambales Rural High School in 1933, the Zambales National Agricultural School in 1960, the Western Luzon Junior Agricultural College in 1977, and eventually evolved into a full-fledged state college in 1985. WLAC's integration into the university system also included its satellite campus in Botolan (1993) as well as its extension classes in the Subic Bay Freeport Zone (SBFZ) Compound (1996–2001) and Subic (1999–2003). The phase-out of SBFZ and Subic campuses gave rise to PRMSU-Castillejos Campus starting June 2003.\nThe CSF-Post Secondary Department, with its component faculty and physical facilities, is known today as the PRMSU-Candelaria Campus. Established in 1965, CSF started as a secondary vocational high school and eventually offered post-secondary, non-degree courses under the supervision of the Technical Education and Skills Development Authority (Philippines) (TESDA).\nDr. Feliciano S. Rosete assumed office as the first duly elected and appointed President of the university effective February 12, 2001, the start of the full operation of the institution as a multi-campus university system. With a viable organizational structure, the institution transformed dramatically as it accelerated the full integration of its component campuses. Through strong partnership with the Provincial Government, DepEd and municipal governments, PRMSU had established LGU-subsidized satellite campuses in Masinloc, Castillejos, and Sta. Cruz in the years 2002, 2003 and 2004, respectively. Faculty development and infrastructure build-up were intensified. Degree programs increased from 12 to 65 in the last nine (9) years. Enrolment expanded from 2,000 to 8,000 per semester over the same period. Massive scholarships from various stakeholders attracted more and more students. Graduates registered commendable performance in licensure examinations especially in electrical, mechanical and civil engineering and other flagship programs. In addition to its Php 93.0M annual budget from the National Government, income from revenue-generating projects and self-liquidating academic programs reached as high as Php 80.0M per year. Major curricular programs attained various accreditation levels and PRMSU achieved an unprecedented Level III-A status under the Commission on Higher Education-Department of Budget and Management-Philippine Association of State Colleges and Universities (CHED-DBM-PASUC) Leveling Scheme. The CHED also listed PRMSU as one of the top 30 higher education institutions (HEIs) recognized by the China, South Korea and other countries.\nIn terms of research, PRMSU contributed to the stock of new scientific knowledge when it won the Regional Best Research Paper Award in Agriculture among 26 CLARRDEC-member agencies in 2008, and eventually emerged as Second Placer among hundreds of PCARRD-member agencies nationwide in the same year. And in 2009, PRMSU also won the Regional Best Research Paper Award in energy/industry research among 19 CLIERRDEC-member agencies.\nThe Department of Budget and Management in 2007 classified PRMSU as a Level III-A university, thus leveling with established universities in Metro Manila like the University of the Philippines and the Polytechnic University of the Philippines.\nCampuses\n* Iba (Main) Campus\n* Botolan Campus\n* Candelaria Campus\n* Castillejos Campus\n* Masinloc Campus\n* San Marcelino Campus\n* Sta. Cruz Campus\nGallery\nFile:Iba,Zambalesjf9503 03.JPG|Welcome arch\nFile:RMTUjf9490 10.JPG|Welcome sign\nFile:RMTUjf9490 09.JPG|Entrance\nFile:RMTUjf9490 13.JPG|Main building\nFile:RMTUjf9490 08.JPG|Monument\nFile:RMTUjf9484 05.JPG|Department\nReferences\nExternal links\n*\n*\n* [http://www.philstar.com/education-and-home/546154/ramon-magsaysay-technological-university-marks-centennial Ramon Magsaysay Technological University marks centennial]\n* [https://archive.today/20130705190508/http://www.pia.gov.ph/news/index.php?article=561359016145 R. Magsaysay Tech U students, recipients of joint education assistance program]"
    }
  ]
}