{
  "content": [
    {
      "type": "text",
      "text": "# President of the Church__disambig_1\n\nIn the Latter Day Saint movement, the president of the Church is generally considered to be the highest office of the church. It was the office held by Joseph Smith, founder of the movement, and the office assumed by many of Smith's claimed successors, such as Brigham Young, Joseph Smith III, Sidney Rigdon, and James Strang. Several other titles have been associated with this office, including First Elder of the church, Presiding High Priest, President of the High Priesthood, Trustee-in-Trust for the church, Prophet, Seer, Revelator, and Translator. Joseph Smith was known by all of these titles in his lifetime (although not necessarily with consistency).\nSmith was killed in 1844 without having indisputably established who was to be his successor. Therefore, his death was followed by a succession crisis in which various groups followed leaders with succession claims. Years later, the office of President was reorganized in many of the resulting Latter Day Saint denominations, the largest of which are the Church of Jesus Christ of Latter-day Saints (LDS Church), the Community of Christ (formerly the Reorganized Church of Jesus Christ of Latter Day Saints), and the Church of Jesus Christ (Bickertonite). Some smaller denominations, such as the Church of Christ (Temple Lot), reject the office as an unscriptural creation.\nJoseph Smith: the first president\nJoseph Smith, the founder of the [[Latter-day Saint movement]]\nThe concept that the Church of Christ would have a single presiding officer arose in late 1831. Initially, after the church's formation on April 6, 1830, Joseph Smith referred to himself as merely \"an apostle of Jesus Christ, and elder of the church.\" However, there was one other apostle—Oliver Cowdery—and several other elders of the church, making the formal hierarchy of the church unclear.\nIn September 1830, after Hiram Page claimed to have received revelations for the church, a revelation to Smith stated that \"no one shall be appointed to receive commandments and revelations in this church excepting my servant Joseph Smith, Jun., for he receiveth them even as Moses.\" This established Smith's exclusive right to lead the church.\nIn early June 1831, Smith was ordained to the \"high priesthood\", along with twenty-two other men, including prominent figures in the Latter Day Saint movement such as Hyrum Smith, Parley P. Pratt, and Martin Harris. As \"high priests\", these men were higher in the priesthood hierarchy than the elders of the church. However, it was still unclear whether Smith and Cowdery's calling as apostles gave them superior authority than that of other high priests.\nOn November 11, 1831, a revelation to Smith stated that \"it must needs be that one be appointed of the high priesthood to preside over the Priesthood and he shall be called President of the high priesthood of the Church ... and again the duty of the President of the high priesthood is to preside over the whole church.\" Smith was ordained to this position and sustained by the church on January 25, 1832, at a conference in Amherst, Ohio.\nIn 1835, the Articles and Covenants of the Church of Christ were revised, changing the phrase \"an ... elder of the church\" to \"the first elder of this Church.\" Thus, subsequent to 1835, Smith was sometimes referred to as the First Elder of the church. The 1835 revision also added a verse referring to the office of \"president of the high priesthood (or presiding elder)\", which had since been added to the church hierarchy.\nRemoval\nThough there has never been a popular movement in the church to have a president removed or punished, he could theoretically be removed from his position or otherwise disciplined by the Common Council of the Church. The only president of the church brought before the Common Council was Joseph Smith, who was tried for charges made against him by Sylvester Smith after the return of Zion's Camp in 1834. The Council determined that Smith had \"acted in every respect in an honorable and proper manner with all monies and properties entrusted to his charge.\"\nProphet, seer, and revelator\nProphet, seer, and revelator is an ecclesiastical title used in the Latter Day Saint movement. The LDS Church is the largest denomination of the movement, and it currently applies these terms to the members of the First Presidency and the Quorum of the Twelve Apostles. In the past, it has also been applied to the Presiding Patriarch of the church and the Assistant President of the Church. Other denominations of the movement also use these terms.\nOrigin of the phrase\nThe phrase \"prophet, seer, and revelator\" is derived from a number of revelations Joseph Smith stated he received. The first revelation Smith said he received after the organization of the Church of Christ on April 6, 1830, declared that \"there shall be a record kept among you; and in it [Smith] shalt be called a seer, a translator, a prophet, an apostle of Jesus Christ, an elder of the church through the will of God the Father, and the grace of your Lord Jesus Christ\". In 1835, Smith further clarified the role of the president of the church, \"to preside over the whole church, and ... to be a seer, a revelator, a translator, and a prophet\". In 1841, Smith recorded a revelation that again restated these roles: \"I give unto you my servant Joseph to be a presiding elder over all my church, to be a translator, a revelator, a seer, and prophet.\" In 1836, at the dedication of the Kirtland Temple, approximately one year after Smith organized the church's Quorum of the Twelve Apostles, he instructed that the members of the First Presidency and the apostles should also be accepted by the church as prophets, seers, and revelators:\nI made a short address, and called upon the several quorums, and all the congregation of Saints, to acknowledge the Presidency as Prophets and Seers and uphold them by their prayers. ... I then called upon the quorums and congregation of Saints, to acknowledge the Twelve, who were present, as Prophets, Seers, Revelators, and special witnesses to all the nations of the earth holding the keys of the kingdom, to unlock it, or cause it to be done among them, and uphold them by their prayers.\nLater, Smith further confirmed that people other than the president of the church may hold these titles. For example, in 1841, a revelation described the role of Smith's brother Hyrum Smith as Assistant President of the Church: \"And from this time forth I appoint unto him that he may be a prophet, and a seer, and a revelator unto my church, as well as my servant Joseph\".\nCurrent usage within the LDS Church\nAt the LDS Church's semiannual general conferences, the name of the president of the church is presented to the members as \"prophet, seer, and revelator and President of The Church of Jesus Christ of Latter-day Saints\". Members are invited to sustain the president in these roles, and the signalling for any in opposition is also allowed. Additionally, the counselors in the First Presidency and the members of the Quorum of the Twelve Apostles are sustained by the membership as \"prophets, seers, and revelators\". Until October 1979, the Presiding Patriarch of the church was also sustained as a \"prophet, seer, and revelator\". Apostles who are not members of the Quorum of the Twelve or the First Presidency and other general authorities, (e.g., members of the Quorums of the Seventy and Presiding Bishopric) are not sustained as prophets, seers, and revelators.\nThe procedure of sustaining is repeated in local congregations of the LDS Church several times per year at stake, district, ward, or branch conferences. These procedures are mandated by the theology of the LDS Church, which dictates governance by the \"common consent\" of the membership, wherein no one serves on the local or general level unless he or she has been formally sustained by individual congregations or the church as a whole.\n, President of the Church of Jesus Christ of Latter-day Saints]]\nPresident of the LDS Church\nThe president of the LDS Church is the church's leader and the head of the First Presidency, the church's highest governing body. Latter-day Saints consider the president of the church to be a prophet, seer, and revelator, and refer to him as the Prophet, a title originally given to Joseph Smith. When the name of the president is used by adherents, it is usually prefaced by the title \"President\". Latter-day Saints consider the president of the church to be God's spokesman to the entire world and the highest priesthood authority on earth, with the exclusive right to receive revelations from God on behalf of the entire church or the entire world.  The President of the Church chairs the Council on the Disposition of the Tithes and the Council of the Church. The President of the Church also serves as the ex officio chairman of the Church Boards of Trustees/Education.\nProphet-Presidents of the Community of Christ\nIn the Community of Christ, formerly the Reorganized Church of Jesus Christ of Latter Day Saints (RLDS), the president of the church's formal title is the Prophet-President. The prophet-president is the highest priesthood leader of the church. The position is composed of several roles: (1) President of the Church, (2) President of the High Priesthood and (3) Prophet, Seer, and Revelator to the church.\nAs President of the Church, the prophet-president is the church's chief executive and is the leader of the First Presidency, the church's chief executive council. As President of the High Priesthood, the Prophet-President is the church's leading priesthood official. (Since the initiation of the ordination of women in 1984, it became possible for this position to be filled by a woman, which happened in 2025.) As Prophet, Seer, and Revelator, the prophet-president is Community of Christ's spiritual leader and can present revelations to the church to be added to the Doctrine and Covenants—an open canon of scripture, which stands with the Bible and the Book of Mormon as sacred text. In the church, only the Prophet-President is considered to be a prophet, seer, and revelator, and so far, each person to hold this position has presented additional revelations or spiritual writings to the church, which have been added to the Doctrine and Covenants.\nSuccession to the presidency\nGenerally, the prophet-president will name or ordain a successor prior to his death or retirement. The office was traditionally referred to as President of the High Priesthood. Prior to 1995, these successors had been chosen consistent with lineal succession, even though it was not a church rule. Accordingly, the first six Prophet-Presidents following movement founder Joseph Smith were his direct descendants.\nIn 1995, Wallace B. Smith broke with the precedent of lineal succession by naming W. Grant McMurray as his successor.  In November 2004, McMurray resigned from the office of Prophet-President without naming a successor, citing medical and personal issues. The First Presidency, composed of McMurray's two counselors, continued to function as the church's chief executive council. A Joint Council of church leaders led by the Council of Twelve Apostles announced in March 2005 that Stephen M. Veazey would be Prophet-President designate. Veazey had been serving as president of the Council of Twelve. Delegates elected to a special World Conference of the church approved Veazey and he was ordained as the Prophet–President on June 3, 2005.\nRemnant Church of Jesus Christ of Latter Day Saints\nThe Remnant Church of Jesus Christ of Latter Day Saints continued to believe in the lineal succession through the Jewish Laws of Inheritance. As such, the president of the Remnant Church following its formation, Frederick Niels Larsen, was a direct descendant (maternal 2nd great-grandson) of Joseph Smith, Jr. Following Larsen's death in 2019, Terry W. Patience became President of the Remnant Church.\nPresident of The Church of Jesus Christ (Bickertonite)\n, President of The Church of Jesus Christ (Bickertonite) 2005–2018]]\nSimilar to other denominations in the Latter Day Saint movement, in The Church of Jesus Christ (Bickertonite), the President of the General Church is also a member of the Quorum of Twelve Apostles.\nPresident of the Church of Jesus Christ (Cutlerite)\nThe tiny Church of Jesus Christ (Cutlerite), headquartered in Independence, Missouri, has a First Presidency with a president and two counselors.  Succession generally goes to the first counselor at the time of the previous president's death or resignation (no Cutlerite president has ever resigned), subject to approval of the church membership.\nPresident of the Fundamentalist Church of Jesus Christ of Latter-Day Saints\nIn the earliest years of its existence, the Mormon fundamentalist Short Creek Community regarded the Church of Jesus Christ of Latter-day Saints (LDS Church) as \"the only true and living church,\" viewing itself merely as a \"body of Priesthood\" set apart to perpetuate plural marriage and other \"crowning ordinances\" of the Gospel, such as the United Order. Hence, they tended to express a degree of admiration for contemporary LDS Church presidents, while simultaneously insisting that they had compromised on serious matters and did not truly hold the \"keys of the Presidency of the Church,\" which had allegedly been returned to the spirit world at the death of Joseph F. Smith in 1918. Thus, they generally valued Church direction less than direct pronouncements from their own Priesthood Council. This \"Council of Friends\" consisted of seven \"High Priest Apostles\" or \"Presiding High Priests,\" the seniormost of whom was considered \"President of the Priesthood\" or Prophet.\nFollowing LDS Church president Spencer W. Kimball's 1978 Revelation on Priesthood, extending the right of ordination to black African males in perceived contradiction to the teachings of Brigham Young and other early LDS leaders, the fundamentalists in Colorado City, Arizona, and Hildale, Utah, began to regard their parent organization as a \"complete Gentile sectarian church.\" In 1991, Rulon Jeffs, by that time sole surviving member of the Priesthood Council and thus Prophet of the group, incorporated his followers into \"the Corporation of the President of the Fundamentalist Church of Jesus Christ of Latter-Day Saints\" or FLDS Church, with himself as president. Upon his death in 2002, Jeffs was succeeded by his First Counselor and son, Warren Jeffs. Despite the younger Jeffs' resignation from the Presidency in 2011 following his imprisonment for child sexual assault, and a brief tenure by Wendell Loy Nielsen as President of the Church's corporate assets, most FLDS members continue to regard Jeffs as a prophet.\nLatter Day Saint sects without a church president\nSome sects in the Latter Day Saint movement do not accept the office of President of the Church as a valid office in the priesthood; these groups often maintain that because Jesus' original church was led by twelve apostles, not by a president or a three-man presidency, the latter-day church should be similarly organized. For instance, the Church of Christ (Temple Lot) is governed by a Quorum of the Twelve; the members of the quorum are generally regarded as co-equal holders of the highest office in the church.\nSee also\n*Assistant President of the Church\n*We Thank Thee, O God, for a Prophet\n*Prophet#Latter Day Saint movement\n*Revelation#Latter Day Saint concept of revelation\n*Revelation (Latter Day Saints)\n*Seer stone (Latter Day Saints)\n*Urim and Thummim#In the Latter Day Saint movement\nReferences\nBibliography\n*John A. Widtsoe (1960). [https://web.archive.org/web/20020504055609/http://www.cumorah.com/language/evidencesandreconciliations.html Evidences and Reconciliations], Salt Lake City: Bookcraft, 256–58.\n*[//www.churchofjesuschrist.org/topics/prophets \"Gospel Topics: Prophets\"], churchofjesuschrist.org\nExternal links\n*[http://josephsmith.net/article/prophet-seer-and-revelator \"Prophet, Seer, and Revelator\"], josephsmith.net\n*James E. Faust, [//www.churchofjesuschrist.org/ensign/1996/08/continuing-revelation \"Continuing Revelation\"], Ensign, August 1996, p.&nbsp;2.\n*Jeffrey R. Holland, [//www.churchofjesuschrist.org/ensign/2004/11/prophets-seers-and-revelators \"Prophets, Seers, and Revelators\"], Ensign, November 2004, p.&nbsp;6.\n*Harold B. Lee, [//www.churchofjesuschrist.org/ensign/1972/08/the-president-prophet-seer-and-revelator \"The President—Prophet, Seer, and Revelator\"], Ensign, August 1972, p.&nbsp;35.\n*Dennis B. Neuenschwander, [//www.churchofjesuschrist.org/ensign/2000/11/living-prophets-seers-and-revelators \"Living Prophets, Seers, and Revelators\"], Ensign, November 2000, p.&nbsp;40.\n*Book of Mormon, [http://scriptures.churchofjesuschrist.org/en/mosiah/8/13-18#13 Mosiah 8:13–18]"
    }
  ]
}