{
  "content": [
    {
      "type": "text",
      "text": "# Presidente Prudente\n\n|subdivision_name1  = Southeast\n|subdivision_name2  =\n| established_date =\n| population_demonym = Prudentino\n| motto =  Labor omnia vincit (Latin)The work conquers all\n| leader_title = Mayor\n| leader_name = Milton Carlos de Mello\n| leader_party = Republicans\n| coordinates =\n| subdivision_name3 = Presidente Prudente\n| subdivision_type4 = Metropolitan Region\n| subdivision_name4 = -->\n| blank_name = Neighboring municipalities\n| blank_info = North: Flora Rica, Flórida Paulista, and Mariápolis;South: Anhumas and Pirapozinho;East: Caiabu, Indiana, and Regente Feijó;West: Álvares Machado, Alfredo Marcondes, and Santo Expedito.\n| blank1_name = Distance to capital\n| blank1_info =\n| area_total_km2 = 562.794\n| area_footnotes =\n| area_rank = SP: 139th\n| area_urban_km2 = 16.5\n| area_urban_ref =\n| blank2_name = Administrative districts\n| blank2_info = Ameliópolis, Eneida, Floresta do Sul, Montalvão, and Presidente Prudente (seat).\n| population_total = 225668\n| population_footnotes =\n| population_rank = SP: 36th\n| population_est = 234083\n| pop_est_as_of = 2024\n| population_as_of = Census of 2022\n| elevation_m = 475\n| elevation_footnotes =\n| blank3_name = Climate\n| blank3_info = Tropical\n| blank4_name = Climate classification\n| blank4_info = Aw\n| blank5_name = HDI (UNDP/2010)\n| blank5_info = 0.806\n| blank6_name = HDI rank\n| blank6_info = SP: 13th\n| blank7_name = GDP\n| blank7_info =  thousand IBGE/2011\n| blank7_name_sec1 = GDP per capita (IBGE/2011)\n| blank7_info_sec1 =\n| website =\n|timezone               = UTC-3\n|utc_offset             = -3\n|timezone_DST           = UTC-2\n|utc_offset_DST         = -2\n|postal_code_type       = Postal Code\n|postal_code            = 19000-000\n|area_code              = +55 (18)\n|population_density_km2 = auto\n|population_density_sq_mi =\n}}\nPresidente Prudente is a Brazilian municipality located in the interior of São Paulo, approximately 558 kilometers (347 miles) from the state capital, São Paulo.\nAccording to the 2024 estimate by the Brazilian Institute of Geography and Statistics (IBGE), Presidente Prudente has a population of 234,083 inhabitants, with a floating population of 402,000 inhabitants, making it the 40th most populous municipality in São Paulo. The municipality covers a territorial area of 560.637&nbsp;km².\nThe municipality comprises the seat and the districts of Ameliópolis, Eneida, Floresta do Sul, and Montalvão, which are subdivided into 255 neighborhoods.\nPresidente Prudente was emancipated from Conceição de Monte Alegre (now Paraguaçu Paulista) in the early 1920s. Its name honors the former Brazilian president Prudente de Morais (1841–1902), who was a lawyer and politician, serving as the first governor of São Paulo during the Republic (1889–1890).\nToday, the city is a major industrial, cultural, and service hub in western São Paulo, earning the nickname \"Capital of Western São Paulo.\" According to a study by the Getúlio Vargas Foundation, it ranks as the 27th most promising city in Brazil for building a professional career.\nIndustrialization in the city began in the mid-1930s, spurred by the economic crisis of 1929, which prompted the exploration of new economic activities. In addition to industry, cotton cultivation was also significant.\nThe municipality boasts a rich cultural tradition, encompassing crafts, theater, music, and sports. The main football club is Grêmio Desportivo Prudente, which plays at the Estádio Paulo Constantino (Prudentão). Other notable landmarks include the Parque do Povo and the Teatro Municipal Procópio Ferreira, alongside other theaters and small parks.\nHistory\nOrigins\nindigenous people, the first inhabitants of the São Paulo region|alt=Indigenous Xavante representatives|177x177px]]\nThe area now known as the western region of São Paulo was originally inhabited by indigenous Xavante, Kaingang, and Guarani/Pai Tavytera populations.\nThe territory was characterized by forests on reddish purple soils and grasslands on other soil types. The rise of urban markets in Minas Gerais led wilderness explorers to settle in the region, investing in cattle ranching. This need for land control sparked conflicts with the region's indigenous peoples.\nAs gold reserves in Minas Gerais dwindled, a significant migratory wave moved toward São Paulo. This migration intensified as many from Minas Gerais fled conscription for the Paraguayan War, which lasted from December 1864 to March 1870, and continued after the war ended.\nIn 1893, a path was established between the Campos Novos do Paranapanema region and the Paraná River, connecting it to Mato Grosso. This region saw the expansion of coffee plantations into the reddish purple soils of the south. The ridges of the Western São Paulo Plateau gained value due to their suitability for coffee cultivation.\nThe advance of coffee and the resulting expansion of capitalist control encouraged the occupation and growth of the Far Western São Paulo region. Coffee landowners from older regions moved to Western São Paulo, acquiring land for the purpose of subdividing it into lots, leading to the establishment of subsistence agriculture properties alongside coffee estates.\nThe development of Presidente Prudente was further aided by the railway, which served as the primary means of transporting people and goods for decades. The choice of the urban site was closely tied to the route of the Sorocaba Railway, which followed the ridge lines.\nPolitical and administrative emancipation\n|alt=Portrait of Prudente de Morais]]\nWith the significant development of the region now encompassing Presidente Prudente, the village of Goulart was established on 14 September 1917 by Colonel Francisco de Paula Goulart. This occurred shortly before the territorial and administrative emancipation from Conceição de Monte Alegre (now Paraguaçu Paulista).\nMuch of the territory consisted of subdivided lots. In addition to farmers, merchants emerged, interested in purchasing lots to develop municipal commerce. With the inauguration of regular train services on 19 January 1919, both rural and urban populations grew. Colonel José Soares Marcondes owned the company responsible for selling these lots, the Cia. Marcondes de Colonização, Indústria e Comércio.\nUpon emancipation, the city consisted of a single district, the Seat, created by State Law No. 1,798 on 28 November 1921 and established on 13 March 1923, covering an area of approximately 20,000&nbsp;km² at the time. The Comarca, of the 4th level, was created by Law No. 1,887 on 8 December 1922. Initially named Vila Goulart in honor of Francisco de Paula Goulart, it later adopted its current name to honor former Brazilian president Prudente de Morais.\nEconomic growth\nCoffee cultivation was the most significant economic activity for the new municipality, driven by landowners, contractors, and settlers. In 1927, an estimated ten million coffee plants were recorded in the municipality. The first half of the 1920s marked the peak of Prudente's coffee production. Its decline was driven by the depletion of the region's sandy soils, frost that destroyed crops, reduced exports due to changes in coffee quality, competition from other countries, and the economic crisis of 1929.\nWith the coffee crisis, a shift to cotton was inevitable, supported by favorable national and international conditions. Cotton attracted foreign companies to the western São Paulo region, which traded with and financed small farmers due to high international demand for the product.\nThe introduction of cotton and, later, peanut cultivation brought changes to the structure of labor relations in the area. However, it was only in the following decade that cotton cultivation became significant, with a notable increase in planted area as coffee cultivation continued to decline. Other crops such as rice, corn, beans, and potatoes became the economic foundation for farmers, who used their sales to finance coffee crops, pay for properties, and support their families. The processing of these products occurred in municipalities and settlements, increasing the number of establishments and fostering their growth.\nIn the 1940s, 44.7% of the region's usable land consisted of pastures. The growing importance of cattle ranching in the Alta Sorocabana region was solidified, particularly through the deforestation of previously unexploited areas. Early industrial activities, initially tied to timber extraction, shifted toward processing raw materials, primarily for cattle production. Surplus products not consumed locally were transported to São Paulo by rail. In the early 1930s, there were seventeen industrial establishments, which grew to 138 by 1940, employing 655 people. Industrial development complemented the dominant agricultural economy, reinforcing its prominence.\nSocial development and modern times\nThe city's growth necessitated the establishment of the first school, now Escola Estadual Professor Adolpho Arruda Mello, in 1925; the first health facility in 1926; the establishment of the Parish in 1925; and the District Education Inspectorate in 1928, which was transformed into the Office of Education in 1932.\nElectricity supply services began in 1924, provided by the Companhia Marcondes de Colonização Indústria e Comércio through a small thermoelectric plant powered by a steam locomotive and a 60 kVA generator, supplying energy from dusk until midnight.\nReligious services provided by the Catholic Church were formalized with the creation of the São Sebastião Parish in 1925, led by Father José Maria Martinez Sarrion, who served as parish priest until his death in 1951. Within a short period, the municipality achieved a significant level of regional political-administrative autonomy.\nAt its founding, Presidente Prudente originally spanned approximately 15,600&nbsp;km², with its boundaries reaching the Aguapeí-Peixe watershed to the north, the Paranapanema River to the south, the municipalities of Campos Novos Paulista (formerly Campos Novos do Paranapanema) and Conceição do Monte Alegre to the east, and the Paraná River to the west.\nChanges in the territorial-administrative framework progressively reduced the municipality's area due to successive divisions by state laws. By 1960, it reached its current configuration. Throughout its territorial expansion, the city gradually absorbed the rural area. This rural dominance has been increasingly replaced by the urban area to meet the demands of urban expansion, driven by the growth of productive activities (industry, commerce, and services) and the rising demand for housing due to population concentration.\nGeography\nPresidente Prudente is located in the western region of São Paulo state, within the mesoregion and microregion of the same name, approximately 558 kilometers from São Paulo, the state capital, and 979 kilometers from Brasília, the federal capital. It occupies an area of , and is bordered by the municipalities of Flora Rica, Flórida Paulista, and Mariápolis to the north; Pirapozinho, Anhumas, and Regente Feijó to the south; Caiabu to the east; and Alfredo Marcondes, Álvares Machado, and Santo Expedito to the west.\nThe municipality lies within the hydrographic basin of the Paraná River, with several sub-basins of small and medium streams playing significant roles in its configuration. It is drained by the Veado and Cedro streams, part of the Santo Anastácio River basin, and the Onça stream and Mandaguari River, which belong to the Peixe River basin. The city's terrain is gently undulating, with frequent hills, most of which are divided by watercourses. The soil is classified as Bauru sandstone, with agricultural characteristics suitable for various crops. The highest point in the city is at 472 meters.\nClimate\n{| class=\"wikitable\" style=\"float:left; margin:1em; border-collapse:collapse; text-align:center; font-size:88%\"\n|+ Largest 24-hour precipitation accumulations recorded in Presidente Prudente by month (INMET, 1961–present)\n|-\n! Month\n! Accumulation\n! Date\n! Month\n! Accumulation\n! Date\n|-\n| January\n|\n| 30/01/1988\n| July\n|\n| 25/07/2007\n|-\n| February\n|\n| 28/02/1980\n| August\n|\n| 20/08/2009\n|-\n| March\n|\n| 30/03/1998\n| September\n|\n| 28/09/2010\n|-\n| April\n|\n| 26/04/1999\n| October\n|\n| 04/10/1972\n|-\n| May\n|\n| 21/05/2017\n| November\n|\n| 07/11/1987\n|-\n| June\n|\n| 14/06/2023\n| December\n|\n| 17/12/1968\n|}\nThe climate of Presidente Prudente is classified as tropical rainy (type Aw according to the Köppen classification), characterized by rainy, hot summers and dry, cooler winters, with an average annual temperature of approximately . The annual precipitation index is , concentrated in the spring and summer months, with a significant decrease during winter, when low relative humidity levels are common. The annual insolation is approximately .\nAccording to data from the National Institute of Meteorology (INMET) from January 1961 to May 2012, the lowest recorded temperature in Presidente Prudente was  on 18 July 1975, a day marked by a black frost event associated with a major cold wave that kept temperatures extremely low across much of Brazil. Another sub-zero record was  on 20 July 1981. The highest recorded temperature was  on 6 October 2020.\nAccording to INMET, the highest 24-hour precipitation accumulation was  on 30 January 1988. Other accumulations equal to or exceeding  include  on 28 February 1980,  on 18 January 1968,  on 19 February 1967,  on 28 September 2010,  on 9 January 1994,  on 4 October 1972,  on 18 January 2009,  on 7 November 1987,  on 16 April 1999,  on 23 February 1993,  on 17 December 1968,  on 24 January 1994,  on 2 October 1970,  on 27 February 1996,  on 30 March 1998, and  on 22 February 1963. The lowest recorded relative humidity was 8% on the afternoon of 23 August 2006.\n, (1981–2010 normals, extremes 1961–present)\n|Jan record high C = 39.0\n|Feb record high C = 39.5\n|Mar record high C = 39.4\n|Apr record high C = 36.4\n|May record high C = 33.4\n|Jun record high C = 33.2\n|Jul record high C = 34.4\n|Aug record high C = 38.1\n|Sep record high C = 40.9\n|Oct record high C = 41.8\n|Nov record high C = 39.9\n|Dec record high C = 39.4\n|Jan record low C = 11.6\n|Feb record low C = 14.2\n|Mar record low C = 9.2\n|Apr record low C = 5.8\n|May record low C = 2.0\n|Jun record low C = 1.8\n|Jul record low C = -1.8\n|Aug record low C = 0.0\n|Sep record low C = 4.8\n|Oct record low C = 7.2\n|Nov record low C = 10.3\n|Dec record low C = 10.2\n|Jan high C = \t31.0\n|Feb high C = \t31.0\n|Mar high C = \t30.8\n|Apr high C = \t29.6\n|May high C = \t26.3\n|Jun high C = \t25.7\n|Jul high C = \t26.1\n|Aug high C = \t28.2\n|Sep high C = \t28.9\n|Oct high C = \t30.5\n|Nov high C = \t30.5\n|Dec high C = \t30.9\n| year high C = \t29.1\n|Jan mean C = \t25.7\n|Feb mean C = \t25.6\n|Mar mean C = \t25.4\n|Apr mean C = \t24.0\n|May mean C = \t20.7\n|Jun mean C = \t19.7\n|Jul mean C = \t19.7\n|Aug mean C = \t21.5\n|Sep mean C = \t22.5\n|Oct mean C = \t24.5\n|Nov mean C = \t25.2\n|Dec mean C = \t25.6\n| year mean C = \t23.3\n|Jan low C = \t21.7\n|Feb low C = \t21.7\n|Mar low C = \t21.2\n|Apr low C = \t19.5\n|May low C = \t16.5\n|Jun low C = \t15.4\n|Jul low C = \t14.9\n|Aug low C = \t16.2\n|Sep low C = \t17.3\n|Oct low C = \t19.4\n|Nov low C = \t20.3\n|Dec low C = \t21.2\n| year low C = \t18.8\n|precipitation colour = green\n|Jan precipitation mm = \t232.5\n|Feb precipitation mm = \t172.2\n|Mar precipitation mm = \t138.3\n|Apr precipitation mm = \t73.0\n|May precipitation mm = \t82.6\n|Jun precipitation mm = \t48.3\n|Jul precipitation mm = \t39.7\n|Aug precipitation mm = \t42.7\n|Sep precipitation mm = \t84.2\n|Oct precipitation mm = \t121.0\n|Nov precipitation mm = \t129.6\n|Dec precipitation mm = \t175.6\n|year precipitation mm = \t1339.7\n| unit precipitation days = 1.0 mm\n| Jan precipitation days = \t13\n| Feb precipitation days = \t12\n| Mar precipitation days = \t9\n| Apr precipitation days = \t5\n| May precipitation days = \t6\n| Jun precipitation days = \t4\n| Jul precipitation days = \t3\n| Aug precipitation days = \t4\n| Sep precipitation days = \t6\n| Oct precipitation days = \t8\n| Nov precipitation days = \t9\n| Dec precipitation days =\t12\n| year precipitation days =\n| Jan humidity = \t72.6\n| Feb humidity = \t73.2\n| Mar humidity = \t70.1\n| Apr humidity = \t66.3\n| May humidity = \t68.1\n| Jun humidity = \t66.1\n| Jul humidity = \t59.3\n| Aug humidity = \t53.6\n| Sep humidity = \t58.2\n| Oct humidity = \t61.9\n| Nov humidity = \t63.6\n| Dec humidity = \t69.3\n| year humidity =\t65.2\n|Jan sun = \t197.2\n|Feb sun = \t186.5\n|Mar sun = \t228.9\n|Apr sun = \t239.5\n|May sun = \t215.1\n|Jun sun = \t209.7\n|Jul sun = \t235.8\n|Aug sun = \t233.4\n|Sep sun = \t195.4\n|Oct sun = \t216.1\n|Nov sun = \t227.0\n|Dec sun = \t206.4\n|year sun = \t2591.0\n|source 1 = Instituto Nacional de Meteorologia\n}}\nEcology and environment\nvegetation during the dry season in Presidente Prudente, with the Ibis Hotel in the background|alt=Cerrado vegetation with Hotel Ibis|277x277px]]\nThe rural area of Presidente Prudente is characterized by pastures and sparse tree cover, with the soil covered year-round. The municipality exhibits significant diversity in land use, as older neighborhoods are densely populated with considerable tree cover along streets and in backyards. Newer neighborhoods, which form the majority, feature sparse constructions with lawns and scattered tree cover. Housing complexes are densely built. Land use in the city is not highly diversified, with residential use predominating over other uses such as industry, commerce, and services.\nTo implement a more robust environmental management system, the municipal government, through the Municipal Secretariat of the Environment, invests in cleaning public spaces, including the removal of shrubs, litter, and debris, as well as the eradication of leucaena and other non-native species, while creating green areas in the urban zone.\nSeveral vacant lots within the urban perimeter are covered with native Cerrado vegetation and are maintained and protected by municipal environmental preservation agencies, such as the Municipal Secretariat of the Environment. Parts of neighborhoods such as Jardim Planalto, Brasil Novo, Jardim Paraíso, and Vale do Sol had their lots fenced with wire in 2010.\nThe Municipality of Presidente Prudente has adopted increasingly stringent and contradictory environmental and tax policies. Councilor Valmir da Souza Pinto proposed a bill stipulating that property owners who fail to adopt robust environmental management practices will pay higher property taxes (IPTU). The bill was voted on 17 March 2015 and reported on 31 March of the same year.\nDemographics\n}}\nAccording to the Brazilian Institute of Geography and Statistics, in 2014, the population of the municipality was  inhabitants, making it the 36th most populous in the state with a population density of 367.7 inhabitants per km². According to the 2000 census, 48.22% of the population were male (91,797 inhabitants) and 51.78% were female (97,389 inhabitants). Approximately 97.91% (185,229 inhabitants) resided in the urban area, while 2.09% (3,957 inhabitants) lived in the rural area.\nThe Municipal Human Development Index (HDI-M) of Presidente Prudente is considered high by the United Nations Development Programme (UNDP). In 2010, its value was 0.806, ranking it as the thirteenth highest in the state, ahead of the capital, São Paulo, which ranks fourteenth. In 2010, the social index was 0.785. The city has most indicators above the national average, according to the UNDP. The per capita income is 14,652.00 reais. The Gini coefficient, which measures social inequality, is 0.46, where 1.00 is the worst and 0.00 is the best. The poverty incidence, as measured by the IBGE, is 14.47%, with a lower limit of 10.10%, an upper limit of 18.85%, and a subjective poverty incidence of 10.84%. In 2000, the population of Presidente Prudente consisted of 135,104 Whites (71.41%), 7,045 Blacks (3.72%), 39,965 Pardos'' (21.12%), 194 Indigenous (0.10%), 5,777 Asians (3.05%), and 1,100 undeclared (0.58%).\nReligion\n, suffragan to the Archdiocese of Botucatu]]\nReflecting the cultural diversity of Presidente Prudente, the city is home to a variety of religious expressions. Although it developed within a predominantly Catholic social framework, numerous Protestant denominations are now present. The growth of evangelicals has been notable, reaching nearly 17.83% of the population.\nLocated in the country with the largest absolute number of Catholics globally, Presidente Prudente reflects this trend. The Catholic Church had its legal status recognized by the federal government in October 2009, despite Brazil being an officially secular state. The city is home to various Protestant or reformed denominations, such as the Assembly of God. According to the 2010 census by the Brazilian Institute of Geography and Statistics, the population of Presidente Prudente comprises: Roman Catholics (64.31%), Evangelicals (26.69%), no religion (4.24%), Spiritism (1.11%), Jehovah's Witnesses (0.68%), Buddhism (0.41%), Mormons (0.19%), Brazilian Apostolic Catholics (0.10%), Umbanda and Candomblé (0.08%), Orthodox Catholics (0.04%), Agnostics (0.04%), and Esoterics (0.03%).\nPolitics\nThe executive power of the municipality of Presidente Prudente is represented by the mayor, assisted by their cabinet of secretaries. The first municipal mayor was Pedro de Mello Machado, affiliated with the Paulista Republican Party (PRP), serving from August to December 1923. The current mayor, elected in the 2024 municipal elections, is Milton Carlos de Mello, popularly known as Tupã, elected by the Republicans party with 52.81% of the valid votes.\nThe legislative power is exercised by the municipal chamber, composed of thirteen councilors elected for four-year terms. In the current legislature, which began in 2025, the chamber consists of three seats for the Republicans, three for the Progressistas (PP), two for Brazil Union and the Social Democratic Party, and one seat each for the Brazilian Democratic Movement (MDB), Podemos (PODE), and the Liberal Party (PL). The chamber is responsible for drafting and voting on laws fundamental to the administration and the executive, particularly the participatory budget (Budget Guidelines Law).\nPresidente Prudente is governed by an organic law, enacted on 5 April 1990, and serves as the seat of a comarca, classified as fourth grade. According to the Superior Electoral Court, in November 2019, the municipality had 176,219 registered voters, representing 0.530% of the total voters in the state of São Paulo.\nAdministrative divisions\nPresidente Prudente is officially divided into five districts: Ameliópolis, Eneida, Floresta do Sul, and Montalvão, in addition to the seat district. When the city was emancipated, it consisted solely of the seat district, established by State Law No.  on November 28, 1921, and implemented on March 13, 1923. The Judicial District, classified as fourth grade, was created by Law No.  on December 8, 1922.\nThe city is also subdivided into approximately 220 neighborhoods, with the largest and most populous, according to the city hall, being Ana Jacinta. The poorest region of the municipality comprises the neighborhoods Jardim Santa Mônica and Vila Furquim, where many families live in precarious conditions. The eastern part of the city also includes areas marked by a social exclusion map. In these areas, the levels of exclusion and social vulnerability are stark, with visible manifestations of social issues, where entire families rely on the solidarity and charity of others, as many residents' rights are often disregarded or entirely absent from the community.\nEconomy\nThe gross domestic product (GDP) of Presidente Prudente ranks as the 128th largest in Brazil, with a strong emphasis on the service sector. According to 2005 data from the IBGE, the municipality had a GDP of R$2,971,249,000. Of this total, R$327,020,000 consisted of taxes on products net of subsidies. The per capita GDP is R$. Among Brazil's 5,565 municipalities, Presidente Prudente holds the 27th position in the ranking of the most promising cities for building a professional career, according to a study by the Getúlio Vargas Foundation, published in Você S.A magazine.\nIn 2022, the city exported US$141 million in products and imported US$16.6 million, resulting in a trade surplus of US$124.7 million.\nPrimary sector\n{| class=\"wikitable\" style=\"font-size: 90%; float:right; margin:1em; border-collapse:border; text-align:center;\"\n! colspan=\"3\" class= style=\"background:#b8860b; text-align:right; font-size:larger; color:indigo;\"|Production of sugarcane,sweet potato, and cassava (2007)\n|-\n| bgcolor=#f5f5f5 | Product\n| bgcolor=#f5f5f5 | Harvested area (hectares)\n| bgcolor=#f5f5f5 | Production (tons)\n|-\n|Sugarcane\n| 10,000\n| 200,000\n|-\n|Sweet potato\n| 800\n| 9,600\n|-\n|Cassava\n| 50\n| 1,250\n|}\nAgriculture is the least significant sector of Presidente Prudente's economy. Of the municipality's total GDP, R$23,232,000 represents the gross value added by agriculture. According to the IBGE, in 2008, the municipality had a herd of 52,607 cattle, 1,620 horses, 300 pigs, 66 goats, 55 buffaloes, seven donkeys, 181 mules, 820 sheep, and 11,500 poultry, including 7,400 hens and 4,100 roosters, broilers, and chicks. In 2007, the city produced 2,750,000 liters of milk from 3,680 cows. Additionally, 89,000 dozens of chicken eggs and 905 kilograms of bee honey were produced. In temporary crops, the main products are sugarcane (200,000 tons), sweet potato (9,600 tons), and cassava (1,250 tons).\nSecondary sector\nThe industrial sector is currently the second most significant contributor to Presidente Prudente's economy. R$ of the municipal GDP comes from the gross value added by industry (secondary sector). According to the city hall's registry, there are 445 industries in the municipality. This figure accounts for approximately 58% of the industries affiliated with Fiesp/Ciesp in the Western São Paulo region. Small and micro-enterprises are prominent in the city's industrial landscape. A significant portion of the secondary sector's contribution comes from the four industrial districts, which collectively cover an area of 45 alqueires.\nThe NIPP I (Antônio Crepaldi Presidente Prudente Industrial Nucleus) spans approximately 20 alqueires and houses 41 industries from various sectors. These include factories that produce fire extinguishers; furniture, mortar, and beverage production; metal structures; cleaning products; agricultural products; electrical goods; and industrial equipment. The NIPP II (Presidente Prudente Industrial Nucleus) covers 18 alqueires but is still in the implementation phase. The NIPP III (Belmiro Maganini Non-Polluting Industrial Nucleus) occupies about four alqueires and hosts 60 industries in sectors such as electronics, road equipment, industrial kitchens, clothing, hospital equipment, metal frames, pharmaceuticals, cosmetics, footwear, soft drinks, sawmills, and furniture. The NIPP IV (Antônio Onofre Gerbasi Non-Polluting Industrial District), covering approximately three alqueires, is home to 52 industries, including precast concrete, batteries, seed production, slabs, mortar, stone cutting, marble and granite processing, wood, and furniture manufacturing.\nTertiary sector\nR$ million of the municipal GDP comes from service provision. The tertiary sector is currently the largest contributor to Presidente Prudente's GDP. According to the IBGE, in 2008, the city had 8,884 companies and commercial establishments and  workers, with  total employed personnel and  salaried workers. Salaries and other remunerations totaled R$852,251,000, with the average monthly salary in the municipality being 2.7 minimum wages.\nInfrastructure\nIn 2000, the city had  households, including apartments, houses, and rooms. Of these, 39,445 were owned properties, with  fully paid (58.13%), 7,369 under acquisition (13.75%), and 10,445 rented (18.93%). A total of 5,187 properties were provided, with 810 supplied by employers (1.47%) and 4,377 provided in other ways (7.93%). Another 101 were occupied in other forms (0.18%). The municipality has treated water, electricity, sewage systems, urban cleaning, fixed telephony, and mobile telephony. In 2000, 96.84% of households were served by the general water supply network; 97.29% of households had garbage collection; and 95.01% of residences had sanitary sewage systems.\nHealthcare\nIn 2005, the municipality had 91 healthcare facilities, with 58 private and 33 public establishments, including hospitals, emergency rooms, health centers, and dental services. These facilities provided 1,294 hospital beds, with 71 public and 1,223 private. The city has eight general hospitals, six public, one private, and one philanthropic. Presidente Prudente also has 1,425 nursing assistants, 408 general practitioners, 236 pediatricians, 221 gynecologist-obstetricians, 218 nurses, and 1,063 professionals in other categories, totaling 3,571 healthcare workers. In 2008, 2,667 live births were recorded, with 8.4% premature, 77.1% delivered by caesarean section, and 13.4% born to mothers aged 10 to 19 (0.3% aged 10 to 14). The crude birth rate is 12.9.\nThe former University Hospital (now Regional Hospital - HR) was purchased in 2010 for R$78 million by the São Paulo State Government, which invested millions in renovations. The HR serves as a reference for 45 municipalities in Western São Paulo and currently has 550 beds, all under the Unified Health System (SUS), including 56 Intensive Care Unit (ICU) beds, with 20 for adults, 10 for coronary care, 6 for pediatrics, and 20 for neonates. It offers medical residency programs in Cardiology, General Surgery, Plastic Surgery, Vascular Surgery, Dermatology, Gynecology and Obstetrics, Infectious Diseases, Neurosurgery, Ophthalmology, Orthopedics, Otorhinolaryngology, Pediatrics, Psychiatry, Urology, ICU, Pediatric ICU, and Neonatology.\nEducation\nPresidente Prudente campus]]\nThe Municipal Education Secretariat of Presidente Prudente (Seduc), legally established by Law No. 2296/83 on December 21, 1983, provides training courses for teachers in the municipal network, promotes literacy projects, and facilitates the use of municipal school buildings outside class hours and during vacation periods for cultural and recreational activities. The Secretariat also coordinates with federal and state agencies to establish general education and teaching programs.\nPresidente Prudente has schools in all regions of the municipality. Due to extensive urbanization, the few residents in rural areas have easy access to schools in nearby urban neighborhoods. Education in state schools is of a lower standard than in municipal schools, but the city hall is conducting studies to improve public state education to achieve better results in the IDEB (Basic Education Development Index). In 2008, the municipality had approximately 40,639 enrollments, 2,673 teachers, and 193 schools in public and private networks. The municipal literacy rate is 98%.\nThe municipality is also notable for its universities, such as São Paulo State University (Unesp), Union of São Paulo Educational Institutions (Uniesp), and University of Western São Paulo (Unoeste), as well as institutions such as Antônio Eufrásio de Toledo University Center (Toledo), São Paulo State Technological College (Fatec), the National Commercial Learning Service (SENAC), the National Service for Industrial Training (Senai), and Sesi, which together enroll over 80,000 students across more than 110 different undergraduate and postgraduate courses. The city has three universities, two colleges, and seven distance education colleges.\n{| class=\"wikitable\" style=\"margin:1em; border-collapse:collapse; text-align:center;\"\n! colspan=4 |Education in Presidente Prudente in numbers\n|-\n! Level\n! Enrollments\n! Teachers\n! Schools (total)\n|-\n! Early childhood education\n| align=\"right\"| 3,854\n| 221\n| 65\n|-\n! Primary education\n| align=\"right\"|\n| 1,417\n| 87\n|-\n! Secondary education\n| align=\"right\"| 9,105\n| 735\n|}\nScience and technology\nPresidente Prudente is considered one of the most innovative cities in the state of São Paulo. In 2016, a law was enacted to promote and support technological innovation, scientific and technological research, and technological development, aiming to bridge the gap between the municipal government and higher education institutions while facilitating investments in startups, research, and development. The law established the Municipal Innovation Fund to provide financial resources for the projects of researchers and entrepreneurs, the Innovation Assistance Grant for individuals developing projects (startups), the Innovation Award to recognize successful initiatives and projects, the Municipal Council for Science, Technology, and Innovation, and the Municipal Innovation Seal for companies contributing to the municipality’s development in this area. The city was the first in Brazil to enact a Municipal Innovation Law.\nIn 2017, the Inova Prudente Foundation, officially the Vicente Furlanetto Foundation for Education, Research, and Innovation of Presidente Prudente (FUNDEPI), was inaugurated. This physical space, equipped with infrastructure and services, aims to integrate startups, entrepreneurs, researchers, and the community, while fostering the development of entrepreneurs and small businesses, applied research for improving or creating new products or processes, and driving innovation. The facility underwent renovations, and in 2018, Brazil’s first Municipal Technology and Innovation Coworking Space was opened. The space accommodates 120 “coworkers,” 200 researchers, and 40 companies.\nIn early 2019, the municipal government launched the InovaTec Program, which grants exemptions from municipal fees and taxes and a 60% reduction in the calculation base for the Service Tax (ISS) owed by these companies. In practice, they pay only 2% ISS on monthly revenue, the lowest rate allowed by federal legislation. The Inova Prudente Foundation was recognized as a success case at the GovTech Conference, an event organized by StartSe held in April 2019 in São Paulo.\nThe municipality is also home to the Presidente Prudente Technological Incubator (INTEPP), established in 2004. Its goal is to support the creation, development, and consolidation of technology-based companies, providing physical infrastructure and services to establish new businesses, attract investments, and capture market share, generating income and jobs.\nCrime and public safety\n]]\nAs in most medium and large Brazilian municipalities, crime is also a challenge in Presidente Prudente, although it has the lowest crime rates in São Paulo state. In 2006, the homicide rate in the municipality was 12 per 100,000 inhabitants. The rate of deaths by firearms, which was 11.8 in 2002, rose to 16.3 in 2003, then stood at 11.7 and 14.6 in 2004 and 2005, respectively, before dropping to 6.0 in 2006. The rate of deaths from traffic accidents, which was 22.7 in 2002, increased to 30.9 in 2006.\nThe decline in homicides related to urban violence is attributed to measures implemented by the São Paulo State Military Police (PMSP), such as the Digital Incident Report (RDO), adopted in 46 other municipalities in São Paulo state. The RDO standardizes incident reports (BOs) filed at police stations via intranet, stores them in databases, and allows access by other police agencies. According to the municipal government, the Ministry of Cities invests little in security in Presidente Prudente.\nThe Presidente Prudente region has the highest concentration of prisons in Brazil, with a prison population of 18,318 inmates across 21 facilities, which have a capacity of only 13,757, meaning the prison population exceeds capacity by 33.15%. The establishment of prisons in the interior allowed the state government to address two issues with a single measure: relocating inmates away from large urban centers and meeting demands for new job opportunities in these municipalities. The prisons created an estimated 18,000 jobs for prison facilities, supported by R$230 million in investments.\nServices and communications\nin the municipality]]\nThe water supply service in Presidente Prudente is managed by the São Paulo State Basic Sanitation Company (Sabesp). The municipality gets 70% of its water from the Rio do Peixe, while the remaining 30% is sourced from the Santo Anastácio River and small underground reservoirs and springs. One hundred percent of the urban area is served by the electricity distribution network, with 112,454 megawatt-hours consumed annually in 2001 and approximately 180,000 consumers.\nThere are still dial-up and broadband (ADSL) internet services offered by various free and paid access providers. In fixed telephony, the city was served by Empresa Telefônica Paulista until 1973, when it began to be served by Telecomunicações de São Paulo (TELESP), which built the telephone exchanges still in use today. In 1998, this company was privatized and sold to Telefônica, and in 2012, the company adopted the Vivo brand for its operations. Mobile telephony services are provided by various operators. There is also 3G access, available in the municipality since 2009, and 4G access, available since 2013. The area code (DDD) for Presidente Prudente is 018, and the Postal Code (CEP) ranges from 19,000-000 to 19,109-999. On January 8, 2009, the municipality began to be served by portability, along with other cities with DDD 018 and states including Rio Grande do Sul (DDDs 51 and 55), Tocantins (63), Mato Grosso (65), and Amazonas (92 and 97).\nThere are twelve channels in the VHF band - channels 2 to 13 - and 69 in the UHF band - channels 14 to 83. There are also microwave (SHF) and satellite channels, which offer significantly better frequency and require special receivers. These receivers typically deliver the signal to the television on a VHF channel. There is also a daily newspaper in Presidente Prudente, \"O Imparcial.\" The city previously had \"Oeste Notícias,\" which was closed by its management on January 31. The city has several online portals, the most accessed of which are [https://g1.globo.com/sp/presidente-prudente-regiao/ Portal G1 - Presidente Prudente], [https://www.diariodeprudente.com/ Diário de Prudente], and [https://portalprudentino.com.br/ Portal Prudentino]. There are also nine radio stations in the city, with the main ones being \"101 FM\" and \"98 FM.\"\nTransportation\n), near Presidente Prudente]]\nThe municipality is served by the Tietê-Paraná Waterway, which facilitates the transport of goods to Mercosur countries. Presidente Prudente is also served by Ferroban (Bandeirantes Railway S.A.) within its territory, on a section formerly belonging to the now-defunct Sorocabana Railway. However, since 1999, there has been no passenger rail transport, only freight transport. The municipality has easy access to SP-270 (Raposo Tavares Highway), connecting São Paulo to Presidente Prudente and Presidente Epitácio to Mato Grosso do Sul; SP-501 (Júlio Budisk Highway), linking Presidente Prudente to SP-294 - Comandante João Ribeiro de Barros (Alta Paulista - Osvaldo Cruz, Dracena, Adamantina); and SP-425 (Assis Chateaubriand Highway), connecting Presidente Prudente to Santo Inácio (PR) and subsequently to São José do Rio Preto and the border with Minas Gerais. Additionally, it has access to regionally and nationally significant highways via paved, dual-lane secondary roads. The city is also served by the Dr. Adhemar de Barros Airport , with a capacity for 178,926 passengers, making it the third largest in São Paulo state.\nThe municipal vehicle fleet in 2009 totaled 103,460 vehicles, including 65,001 cars, 3,327 trucks, 576 tractor-trucks, 7,685 pickups, 272 minibuses, 22,169 motorcycles, 3,650 mopeds, 743 buses, and 37 wheeled tractors. The city’s duplicated and paved avenues and numerous traffic lights facilitate traffic flow, but the increase in the number of vehicles over the past decade has led to increasingly slow traffic, particularly in the seat district. Additionally, finding parking spaces in the commercial center has become challenging, causing some losses to commerce, partly due to merchants and their employees occupying the limited available spaces.\nPreviously, public transportation in Presidente Prudente was provided by two companies: Transporte Coletivo Presidente Prudente (TCPP) and Pruden Express. Currently, following a bidding process, only one company, Prudente Urbano, provides the service. The Municipal Secretariat for Traffic Affairs (SEMAV) is the municipal body responsible for the city’s traffic and transportation systems. It regulates and oversees the public transportation system and manages municipal traffic. It comprises departments for Planning, Traffic, Transportation, and Public Safety Cooperation.\nCulture and leisure\nTourism, arts, and events\nvenues]]\nat Cidade da Criança, an important recreational space]]\nThe city has twenty hotels, four movie theaters (820 seats), two theaters (555 seats), seven amphitheaters, five libraries, and two spaces for aeromodeling. The municipality also has thirteen social clubs, as well as the Eduardo José Farah Municipal Stadium (the largest capacity in Brazil’s interior, with 65,000 seats) and the Quarto de Milha Ranch Covered Arena (the largest covered arena in Latin America).\nEvents such as the National Theater Festival (FENTEPP), the Nikkei Fest, the Presidente Prudente Literary Festival (FLITPP), the Festival of Nations and the Expo-Prudente, contribute to the city’s role as a cultural hub in the region. For leisure, the city offers the Matarazzo Cultural Center, a complex that includes the Dr. Abelardo de Cerqueira César Municipal Library, Profª Jupyra Cunha Marcondes Municipal Art School, Municipal Art School, Paulo Roberto Lisboa Theater, Sebastião Jorge Chammé Auditorium, Condessa Filomena Matarazzo Cinema, Os Sombras e Os Temperamentais Boulevard, Presidente Prudente Seresteiros Square Boulevard, Francisco Artoni Coreto Square, Bandstand, Multipurpose Rooms for workshops and rehearsals, Galleries, and an Atelier.\nThe city also features the Parque do Povo, Cidade da Criança (a 70-hectare green area with infrastructure, including attractions such as a cable car, ecological trail, zoo, playground, kart track, planetarium, astronomical observatory, water park, fishermen’s association, Free Environmental School, and two lakes), the Nelson Bugalho Ecological Park, the Procópio Ferreira Municipal Theater and the SESC Thermas.\nSports\nand Palmeiras at the Prudentão, during the 2009 Campeonato Paulista]]\nFollowing the era of Prudentina in the 1960s, the dissolution of the fully professional Corinthians de Prudente in 2001, and the brief stint of Grêmio Prudente Futebol in 2010 when it adopted the city’s name, Presidente Prudente is now home to Grêmio Desportivo Prudente and has a stadium, the Eduardo José Farah Municipal Stadium, known as Prudentão, inaugurated on October 12, 1982, with a current capacity of up to 44,414 people. The first match played there was between Santos Futebol Clube and the now-defunct Esporte Clube Corinthians, attended by approximately 20,240 spectators, with Santos winning 1-0. The record attendance was for a match between Sociedade Esportiva Palmeiras and Sport Club Corinthians Paulista, with 45,972 spectators on March 3, 1996, resulting in a 3-1 victory for Palmeiras. In lower divisions, notable teams include Oeste Paulista Esporte Clube and Presidente Prudente Futebol Clube.\nOn December 23, 2010, the Flávio Araújo Athlete Training Center was inaugurated, named in honor of the local sports journalist who had a distinguished career in national radio. The center is a reference in sports, offering medical care and physical training facilities, a covered court, and a football field used as a training center for Grêmio Prudente.\ncourt in Presidente Prudente, in the Jardim Alto da Boa Vista]]\nIn other sports, the city is also seeing significant investments in expanding sports facilities, such as the PUM (Multi-Use Park), which includes five covered courts, a health club, and locker rooms for athletes. The Olympic Center has received investments in Olympic disciplines, such as the athletics track and swimming and water polo pools. The People’s Park courts have also been covered, and its two football fields have been upgraded with synthetic turf. The Caetano Peretti Municipal Stadium has accommodations for amateur athletes and a renovated field, with plans for a possible additional athletics track. The city also has twelve gateball stadiums, seven sports halls, and four baseball stadiums.\nHolidays\nIn Presidente Prudente, there are three municipal holidays, eight national holidays, and three optional holidays. The municipal holidays are: Saint Sebastian’s Day on January 20; the city’s anniversary on September 14; and the homage to Our Lady of the Immaculate Conception on December 8.\nNotable people\n*Camilo Sanvezzo, footballer\n*Antônio Carlos Zago, footballer\n*Pablo (Pablo Freitas Cardoso Mello)\n*Thaila Ayala, actress and model\n*Mauro Vinícius da Silva, triple jumper, 2-time World Champion\n*Matheus Martinelli, footballer\nSee also\n* Interior of São Paulo\n* List of microregions of São Paulo (state)\n* Roman Catholic Diocese of Presidente Prudente\n* List of municipalities in São Paulo\n* Municipalities of Brazil\nReferences\nExternal links\n*\n* [https://web.archive.org/web/20090221054001/http://www.prudente.unesp.br/ UNESP University] (in Portuguese).\n* [https://maps.google.com/maps?q=Presidente+prudente&ie=UTF8&t=h&z=9 Satellite photo of Presidente Prudente]. Google Maps.\n* [http://www.unoeste.br Unoeste University] (in Portuguese)."
    }
  ]
}