{
  "content": [
    {
      "type": "text",
      "text": "# Presidential Advisory Council\n\n| native_name_a   =\n| native_name_r   =\n| type            = Council\n| seal            = Logo Dewan Pertimbangan Presiden (2020).png\n| seal_width      = 180px\n| seal_caption    =\n| logo            =\n| logo_width      =\n| logo_caption    =\n| image           =\n| image_size      =\n| image_caption   =\n| formed          =\n| preceding1      = Supreme Advisory Council\n| preceding2      =\n| dissolved       =\n| superseding1    =\n| superseding2    =\n| jurisdiction    =\n| headquarters    = Central Jakarta, Indonesia\n| coordinates     =\n| motto           =\n| employees       =\n| budget          =\n| chief1_name     = None\n| chief1_position = Chairman\n| chief2_name     =\n| chief2_position =\n| public_protector =\n| deputy          =\n| parent_department =\n| parent_agency   =\n| parent_agency_type =\n| child1_agency   =\n| child2_agency   =\n| keydocument1    = Law No.9/2016\n| website         =\n| agency_id       =\n| map             =\n| map_size        =\n| map_caption     =\n| footnotes       =\n| embed           =\n}}\nPresidential Advisory Council (; abbreviated as Wantimpres) is a non-structural government agency that serves as an advisory council for the President of Indonesia. The council was formed in 2007 during the presidency of Susilo Bambang Yudhoyono, and is modelled after the former constitutional Supreme Advisory Council (Dewan Pertimbangan Agung) that was disbanded in 2003.\nLegal basis\nArticle 16 of the Constitution of Indonesia authorises the president to establish an advisory council to support its daily administration.\nIndonesian Act No.19/2006 provides the legal basis for the advisory council. The law specifies the powers and authorities of the council, as well as its membership, remunerations, and working procedures.\nFunctions\nThe main function of the advisory council is to advise the president on its daily administration. Advice to the president could be made on personal basis, or as the council in the whole. Members of the advisory council are expected to brief the president on a daily basis, whether by prior request from the president or not.\nAdvices given to the president are considered confidential, thus members are prohibited to publish and announce the advice that had been given to the public. Members of the advisory council are allowed to attend daily cabinet meetings and to join presidential entourage on a working or a state visit.\nMembers of the advisory council are supported by one secretary for each members to support their daily advisory function. Members' secretaries are subordinate to each members and have no capacity to supersede the main council members.\nList of chairperson\n* Ali Alatas (2007&ndash;2008)\n* T. B. Silalahi (2008&ndash;2009)\n* Emil Salim (2010&ndash;2014)\n* Sri Adiningsih (2015&ndash;2019)\n* Wiranto (2019&ndash;2024)\n* None (2024&ndash;2029)\nMembers\n2024–2029\nNo advisory council appointed for Prabowo Subianto presidency, as Prabowo only appoints Special Advisors only which tasked for specific issues. The only person appointed with rank of Presidential Advisor for Prabowo presidency so far only Dudung Abdurrahman, holding position as \"Presidential Advisor for National Defense Affairs\".\n2019–2024\nThe latest formation of the advisory council was decreed by the Presidential Decree No.137/P/2019. On 13 December 2019, President Joko Widodo inaugurates 9 individuals to fill the council for 2019–2024 term, with Wiranto designated as the chairman.\n{| class=\"wikitable\" style=\"text-align:center; border-collapse: collapse\"\n|-\n!colspan=14|Members of the Presidential Advisory Council\n|-\n| rowspan=2|Chairman\n| colspan=10|\n|-\n| colspan=10|Wiranto\n|-\n|rowspan=2|Members\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|-\n| width=\"150\"|Sidarto Danusubroto\n| width=\"150\"|Agung Laksono\n| width=\"150\"|Muhammad Luthfi bin Yahya\n| width=\"150\"|Soekarwo\n| width=\"150\"|Muhamad Mardiono(2019–22)\n| width=\"150\"|Arifin Panigoro(2019–22)\n| width=\"150\"|Tahir\n| width=\"150\"|Putri Kuswisnu Wardani\n| width=\"150\"|Djan Faridz(2023–24)\n| width=\"150\"|Gandi Sulistiyanto(2023–24)\n|}\n2015–2019\nThe 2015–2019 formation of the advisory council was decreed by the Presidential Decree No. 6/P Tahun 2015 dan Keppres 8/P Tahun 2015. The chairperson was Sri Adiningsih. The members of the advisory council were Sidarto Danusubroto, Yusuf Kartanegara, Hasyim Muzadi (2015–2017), Agum Gumelar (2018–2019), Suharso Monoarfa, Rusdi Kirana (2015–2017), Jan Darmadi, Abdul Malik Fadjar, Subagyo Hadi Siswoyo, and Yahya Cholil Staquf (2018–2019)\nReferences"
    }
  ]
}