{
  "content": [
    {
      "type": "text",
      "text": "# President's Task Force on 21st Century Policing\n\nThe '''President's Task Force on 21st Century Policing''' was created by an executive order signed by United States President Barack Obama on December 18, 2014. Obama created it in response to the unrest in Ferguson, Missouri following the shooting of Michael Brown by a police officer there. The eleven members of the task force include academics, law enforcement officials, and civil rights activists. The co-chairs of the task force are former Philadelphia police commissioner Charles H. Ramsey and George Mason University professor of criminology, law and society Laurie Robinson.\nOn March 2, 2015, the task force released its interim report, and on May 18 of that year, it released its final report. The final report called for, among other things, more data on police shootings and on civilians' attitudes toward the police, as well as for the removal of policies that reward police who produce more arrests and convictions. The same year the task force published an implementation guide for stakeholder groups, listed as local governments, law enforcement, and communities. Additionally, on July 23, 2015, a forum, drawing together more than 150 participants from law enforcement, elected office, and civic society, was co-hosted by the White House and the Office of Community Oriented Policing Services (COPS) to explore reaching the goals of the President’s Task Force on 21st Century Policing.\nIn another report released a year later, the task force released an update saying that at least nine states and cities in the United States had adopted the task force's recommendations. However, because there are 18,000 police departments in the United States, some members of the task force, as well as President Obama himself, have expressed frustration with the slow rate at which its recommendations have been adopted.\nCities and States that Adopted Recommendations\n[https://www.sanfranciscopolice.org/sites/default/files/FileCenter/Documents/27535-SFPD%20Response_21st%20Century%20Policing_Final%202015_09_22.pdf San Francisco]\nReferences\nExternal links\n*"
    }
  ]
}