{
  "content": [
    {
      "type": "text",
      "text": "# Preston–Somers expedition__disambig_1\n\n|place =\n|result = English victory\n|combatant1 =\n|combatant2 =\n|commander1 =\n|commander2 =\n|strength1 =\n|strength2 =\n|casualties1 =\n|casualties2 = 80 killed\n|campaignbox =\n}}\nThe Preston–Somers expedition, or the Capture of Caracas, was a series of military actions that took place from late May until the end of July 1595 during the Anglo-Spanish War. The English expedition headed by George Somers and Amyas Preston sailed to the Spanish Main initially intending to support Sir Walter Raleigh's 1595 expedition to the Orinoco.\nAfter failing to meet Raleigh, the expedition went on venture of its own along the coast of the Spanish Province of Venezuela and captured the fort at La Guaira, the port of Caracas. After making an arduous trek through the mountains of the Venezuelan Coastal Range, the English were able to outmanoeuvre the waiting Spanish force and captured the Caracas itself.\nThe failure of a ransom led to the plundering and torching of the city.\nThe English continued along the coast to capture Coro, before a brief excursion to the Spanish West Indies. Despite the challenges they faced the expedition was a success for the English, who were able to return unmolested with some profit having set out as only a supporting expedition.\nBackground\nEngland's war with Spain had been going on for nearly ten years; Spanish colonies, warships, and merchants were subject to attacks by English privateers. Many of these were ordered by Queen Elizabeth I but a number were also operated as joint stock ventures similar to the English Armada. In 1595 one such expedition was that of Amyas Preston and George Sommers with their privateer ships Ascension, Gift, Julian and Darling (owned by Sir Walter Raleigh), Angel, and a pinnace called Delight. The expedition's purpose was to cooperate with Raleigh's work of exploration in the same year at Trinidad and Guiana in the hope of finding El Dorado, as well as to commit to amphibious descents throughout the Spanish Main with them. For this purpose they had a disembarkation force of 300 men, many of whom were professional soldiers of the English army who had been fighting against the Spanish in Holland and in France. Preston made a name for himself during the battle against the Spanish Armada in 1588. Somers first sailed into the public eye when, heading toward Spain in command of the Flibcote, and in the company of three other vessels, he brought home Spanish prizes worth more than £8,000.\nHaving sailed from Plymouth, on 12 March they were further accompanied by Captain Moses Willis's Archangel and two other vessels out of Southampton which they met at sea. As a test for training the soldiers, they disembarked and attacked the Portuguese settlement at Porto Santo, on the island of the same name in the Madeira archipelago, and successfully plundered small villages.\nExpedition\nBy 18 May, Preston and Somers had reached Dominica and after refreshing for six days on the island they sailed south to Los Testigos Islands. Here they celebrated a muster ashore on 28 May and continued southwest to Margarita Island, which they soon sighted, and came ashore on the following day. They explored nearby Coche Island the next day and captured a Spanish caravel and a few pearl fishermen who had come from Puerto Rico, which turned out be valuable.\nCumana and La Guaira\nOn 1 June the eight English privateer vessels and the Spanish prize appeared before Cumaná off Spanish Venezuela and seized three more caravels in the bay. Upon landing however they found the residents had been alerted to their presence; the English then decided on a ransom or otherwise threatened to set the town on fire. The ruse succeeded and a modest amount of foodstuffs were acquired from the Spanish. The English departed in peace the following evening, after having burned the caravels.\nThe English moved further along the main coast and anchored a mile and a half east of La Guaira at a beach near Macuto. They landed a small force and moved inland parallel to the sea and sighted the fortress (present-day Fort el Vigía) that protected the small town but also protected the main gateway to the city of Santiago de León de Caracas further inland. Somers then disembarked the rest of the men onshore and led the force overland. After probing the defences, the English assaulted the small fortress of La Guaira and with complete surprise occupied it with little resistance. The remainder of the garrison then fled and immediately warned other Spanish forces in the area of the English presence. The next day in the afternoon a patrol of fifty Spanish cavaliers descended out of the mountains from Caracas and saw that the English had occupied the fort. A number of the musketeers under Captain Roberts emerged from the keep and offered them combat, from which the Spanish then promptly withdrew. The Spanish soon realised the English were going to strike at Caracas itself.\nCaracas\nThe Spanish did everything they could to bar their advance, so they concentrated their strength along the main road also known as the Kings Highway leading up to Caracas. Preston and Somers knew that getting to Caracas would be a serious challenge since it was much further inland and the defences were strengthened now that the element of surprise had been lost. For the English, getting to Caracas was a huge challenge as it was built on a high plain, at an altitude of ,  inland within a valley protected by the mountains of El Ávila which is located along the central stretch of the Venezuelan Coastal Range with a summit elevation on the road at Pico Naiguata of 9,072&nbsp;ft (2,765 m ) and a topographic isolation of 8,054&nbsp;ft (2,455 m) above sea level. Caracas itself had a garrison composed mainly of militia that had been organized by the governor Diego Osorio Villegas.\nof Westward Ho! novel from an 1899 edition showing the English in discussion during the raid on Caracas]]\nAt night the English slipped out of the fort, and knew that by heading up the mountains they would be difficult to see, let alone be engaged. The Spanish did not maintain close watch upon the English movements, and this worked to Preston's and Somers' advantage. Without haste they marched a column undetected through the rain during the night. They had help from a lone Indian whom they used as a guide, and were able to advance up a little-known track high into the mountain, keeping well clear of the main road. They climbed through the thickly wooded slopes in the dark, some of the time having to cut their way through, and halted at a stream for refreshment and waited for dawn. They walked close around the summit of Pico Naiguatá, then marched down through the early morning fog and were within sight of the town by daylight. The English could not believe their luck when at midday on 8 June they appeared unexpectedly outside Caracas completely undetected. They had marched for six miles in impossible terrain, and what's more, apart from fatigue there were no casualties. A part of the city's militia had formed in front of them, but the majority were still gathered along the main road.\nPreston and Somers then formed three groups, the main battle group in the center, and two smaller, flanking forces on either side. The English thought the Spanish would attack, but they remained in place. The English attacked and forced the Spanish to flee, leaving behind one dead soldier and a number of wounded, but the attackers had suffered no casualties. The rest of the militia further up guarding the main road were surprised by the unexpected attack and were in complete disorder and too late to do anything. The English soon entered the city with little resistance encountered, since most of the non-combatants had fled inland. In the absence of the governor Diego de Osorio, the mayor of Baruta, a lone elderly Spanish rider named Alonso Andrea de Ledesma bravely attempted to check their progress with his lance and shield; he was however shot dead. So admired for his courageous effort, Preston ordered that De Ledesma be carried on his shield and receive a hero's honour before being buried. The invaders had secured the city by 3pm. The Spanish militia attempted to retake the town in poorly coordinated attempts, but were repelled.\nThe English remained in possession of Caracas for five days and the Spanish offered a parley from which the English attempted a ransom of 30,000 ducats. The Spanish offered 2,000, then 3,000, but being so small Preston and Somers then set about sacking and plundering the place, stripping it of anything of value. A ransom of 4,000 ducats was offered to spare the remains of the town, but Preston and Somers soon received intelligence from Indians that the Spanish had sent for help and were delaying the negotiations until reinforcements could arrive. Preston and Somers were furious as the Spanish had gone against their honour of a parley, and as a consequence in the morning they burned Caracas and some surrounding settlements to the ground. They then departed the way they came, taking whatever they could away from the Spanish militia who now had more reinforcements. The militia entered Caracas soon after the English had left, only to find the vast majority of it in ruins. The English had returned to La Guaira by noon on 14 June with the booty, exhausted by their arduous trek. The next day Preston and Somers set the fortress ablaze, as well as demolishing its defenses, and were thus prepared to leave.\nChichiriviche and Coro\nThe next morning the English departed from La Guaira and headed West. On the 16th they soon arrived outside Chichiriviche. Somers led a boat party that captured three anchored Spanish vessels and secured some of the booty from them before setting fire to them. The town was entered with virtually no resistance, but it was too small to make a ransom and the English departed further west, this time to Santa Ana de Coro.\nOn 20 June, having made their way along the coast, the English sighted Coro Bay. Preston led his formation there and ferried all his troops ashore by 11&nbsp;p.m. Their target was the town of Coro, which was established at the south end of the Paraguaná Peninsula in a coastal plain, flanked by the sandy Médanos Isthmus. The area was famous for having been colonized by the Germans as sort of a part payment from the Spanish in the 1520s to 1540s. The town had a small garrison under command of Governor Juan de Riberos.\n]]\nSomers stayed behind with fifty men to secure the anchorage, but the Spanish were soon aware of his force and hastily marshalled militia to impede them. The English attempted a night time assault on the town, but ran into a barricade the Spaniards had built, blocking their advance. The English attacked in number but the Spaniards defended stoutly, repelled their attack at first, and then tried to advance around the barricade to outflank it, but this too failed and losses were beginning to mount. With more men coming up however, the English launched another assault and managed to fight their way through, driving the defenders off. There was soon a running fight with the English pursuing the Spaniards, who really only delayed their advance. They reached Coro itself and after another small fight, the town was gained and secured the following morning with relatively few casualties. The English held the town, but its buildings had stood empty as the residents along with de Riberos had received ample warning of the advance and fled inland with their valuables. Preston then ordered the town to be sacked and the English went on the plunder again.\nCoro was held for about two days and on preparing a ransom Preston had learned that a rain storm had struck the English anchorage. The cables of Somers's fifty-man pinnace had parted which was then driven out to sea. Preston therefore ordered Coro thoroughly sacked and torched; all the buildings were destroyed including the church and chapel. Preston hastened his column back to the coast and set sail in order to search for Somers. The following evening Somers stood just outside Lake Maracaibo's entrance seeking safety, but with the wind up they both decided to leave, and with wind astern headed toward Hispaniola on 26 June.\nAftermath\nBy 30 June, the Preston–Somers squadron sighted Hispaniola and next day anchored off Cape Tiburón to search for fresh provisions. When the formation resumed its cruise on 8 July, Preston's Ascension and Somers's Gift were the only ones left when the other ships decided to depart for home.\nFour days later the remaining privateer vessels anchored off Jamaica, and stayed there for a few days before proceeding toward the Caymans. They reached Cabo Corrientes, Cuba by the 22nd, and there they decided to impose a short blockade off Havana in an attempt to take a few small prizes. Prizes were short coming with only two small ships captured, and disease began to take its toll. Dysentery raged throughout the vessels, having already killed eighty men, and soon the expedition was terminated. Being fortunate that the Spaniards had not caused any damage, and not to chance further luck, they headed home to England.\nAftermath\nBefore the English left the Caribbean, they encountered and fell in with Raleigh's ships returning from Guiana, with whom they kept company. They made a visit to Newfoundland in August to stock up on fish before crossing the Atlantic. They arrived at Milford Haven in Wales on 10&nbsp;September without further loss, and counted their plunder.\nThe expedition's success in terms of plunder was only moderate, and it just about covered the cost with little profit having been made. The expedition had only been meant to support Raleigh's in his quest for El Dorado, and had done far more than it should have done. As an independent expedition it was highly successful in terms of military results, however. The capture of Caracas via the mountains was a rare feat, and except for the losses to disease, casualties were fairly light.\nSeventeenth-century Spanish historian José de Oviedo y Baños described the feat performed by Preston and Somers: \"This was a hidden path, rather, an old disused path, used by the native Indians to ascend the mountain. From there down the mountain into the valley of St. Francis, a road so rocky and impassable that it seemed impossible for a human foot to use.\"\nSomers and Preston were both knighted by Queen Elizabeth I for their efforts in the expedition and for further feats in the war with Spain. In 1596, Preston was captain of the  with Lord Howard in the Cadiz expedition.\nAfter returning to Caracas, the governor Diego de Osorio ordered the build up of defences of La Guayra. The coastal defences of the Caribbean shore was also built up to resist future attacks of pirates. Several permanent garrisons and the fortification of the Royal Road to Caracas were established.\nLegacy\nIn 1607, both Preston and Somers reunited, in a way, to become involved in the foundation of the Colony of Virginia: specifically Jamestown, the first permanent English settlement in North America, on the banks of the James River. Somers is remembered today as the founder of the English colony of Bermuda, then known as the Somers Isles, a commercial venture.\nThe Preston–Somers raid would be the only attack that Caracas would suffer in its colonial history, unlike other coastal cities on the Spanish Main. This fact was exploited for a tourism campaign in 1980 to promote Venezuela as \"the best kept secret of Caribbean\".\nSome sources (mainly Venezuelan as Mario Briceño Iragorry in his book El Caballo de Ledesma) suggest that Alonso Andrea de Ledesma, the elderly lone rider who resisted the English forces in Caracas, may have been the inspiration for Don Quixote by Miguel de Cervantes, which was written nearly ten years later. The Venezuelan composer Eric Colon wrote an opera called El Caballero de Ledesma that premiered on 5&nbsp;May 1979, in a sold-out Teatro Municipal by the Opera Metropolitana de Caracas. The 19th-century writer Charles Kingsley used the Sommers Preston expedition as the basis of his most popular adventure, Westward Ho!.\nReferences\nFootnotes\nBibliography\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*"
    }
  ]
}