{
  "content": [
    {
      "type": "text",
      "text": "# President of Armenia__disambig_2\n\n| insignia = Seal of the President of Armenia.svg\n| insigniasize =\n| insigniacaption = Presidential seal\n| insigniaalt =\n| flag = Flag of the President of Armenia.svg\n| flagsize =\n| flagalt =\n| flagborder =\n| flagcaption = Presidential standard\n| image = President of the Republic of Armenia Vahagn Khachaturyan 2 (alt-crop).jpg\n| imagesize =\n| alt =\n| imagecaption =\n| incumbent = Vahagn Khachaturyan\n| acting =\n| incumbentsince = 13 March 2022\n| department =\n| style = Mr. President (formal)His Excellency (diplomatic, abroad)\n| type = Head of state\n| status =\n| abbreviation =\n| member_of =\n| reports_to =\n| residence = Presidential Palace\n| seat = Yerevan\n| nominator =\n| appointer = National Assembly\n| appointer_qualified =\n| termlength = Seven years\n| termlength_qualified = non renewable\n| constituting_instrument = Constitution of Armenia (1995)\n| precursor = First Secretaries of the Communist Party of Armenia\n| formation =\n| first = Levon Ter-Petrosyan\n| last =\n| abolished =\n| superseded_by =\n| succession =\n| unofficial_names =\n| deputy = President of the National Assembly\n| salary = }}\n| website =\n| footnotes =\n}}\nThe president of Armenia () is the head of state and the guarantor of independence and territorial integrity of Armenia elected to a single seven-year term by the National Assembly of Armenia. Under Armenia's parliamentary system, the president is simply a figurehead and holds ceremonial duties, with most of the political power vested in the parliament and prime minister.\nVahagn Khachaturyan has been serving as president since 13 March 2022.\n__TOC__\nBackground\nThe president of the republic strives to uphold the constitution, and to ensure the regular functioning of the executive and judicial powers. They are the guarantor of the independence, territorial integrity and security of the republic. The president of the republic is immune: they cannot be prosecuted or held liable for actions arising from their status during and after their term of office. For the actions not connected with their status the president of the Republic may be prosecuted when their term of office expires.\nAccording to Article 60 of the Constitution of Armenia, in case when the office of the president of the republic is vacant and before the newly elected president assumes the office, the chairman of the National Assembly, or, if it is impossible, the prime minister performs the duties of the president.\nPost-foundation history\nThe post of the president of Armenia was founded by the decision of Armenian SSR Supreme Council of May 3, 1990.\nOn June 21, 1991, RA Supreme Council made a decision which determined that an election based on the common and equal electoral rights of the citizens of RA would take place before December 31 of 1991. On the basis of RA Supreme Council's decision of June 25, 1991, the elections of the president of the Republic of Armenia were scheduled to be held on Wednesday, October 16, 1991.\nArmenia became an independent state on 21 September 1991 after the independence referendum earlier that year. The first presidential election was held on 17 October 1991. Levon Ter-Petrosyan won the majority of the votes and became the first president of independent Armenia. He was re-elected in 1996; however, he did not finish his second term as president and resigned in 1998. Robert Kocharyan followed him in the office until 2008. President Serzh Sargsyan was elected in February 2008 and re-elected in February 2013 for a second term until 2018. Armen Sarkissian replaced him as president on 9 April 2018, and he was in turn replaced by the current office holder Vahagn Khachaturyan on 13 March 2022.\nElection process\nElection process until constitutional changes in 2015\nThe elections of the president are held according to the procedures defined by the Constitution and the law. The president of the republic used to be elected by the citizens of the Republic of Armenia for a five-year term of office. Every person having attained the age of thirty-five, having been a citizen of the Republic of Armenia for the preceding ten years, having permanently resided in the Republic for the preceding ten years, and having the right to vote was eligible to be elected as president of the republic. The same person could not be elected for the post of the president of the republic for more than two consecutive terms. The election of the president of the republic was held fifty days prior to the expiration of their term of office according to the procedure defined by the Constitution and the law. The candidate who had received more than half of the votes is elected president of the republic.\nIf the election involves more than two candidates and none of them receives the required number of votes, a second round of election is held on the fourteenth day following the voting. The two candidates having received the highest number of votes may participate in the second round of election of the president of the republic. In the second round the candidate who receives the highest number of votes is elected president of the republic. If only one candidate runs for the election, they can be elected if they receive more than half of the votes of electors participated in the polls. If the president of the republic is not elected, a new election is appointed and the voting is held on the fortieth day following the date of appointment of the new election.\nThe president of the republic takes office on the day when the term of office of the previous president expires. If the president of the republic is elected by new or extraordinary elections, they shall take office on the twentieth day following the elections.\nIn case if insuperable obstacles for one of the candidates arise, the elections of the president of the republic should be held off for two weeks. In case if the insuperable obstacles are not removed, new elections should be held upon end of the two-week term, on the fortieth day. In case of decease of one of the candidates before the elections day, new elections are held, and the voting takes place on the fortieth day after the appointment of the new election day.\nIf the president of the republic resigns, dies, is incapable to perform their duties or is removed from office extraordinary elections are held on the fortieth day following the vacancy of the office of the president. During martial law or state emergency election of the president should not be held and the president in this case continues their responsibilities. The new election of the President of Republic is held fortieth day after the expiration of the term of the martial law or state of emergency\nOath\nThe president of the republic assumes their duties as stated in the law. In National Assembly's special session the President should swear the following oath to the people \"Assuming the office of the President of the Republic of Armenia I swear to fulfill the requirements of the Constitution in an unreserved manner, to respect fundamental human and civil rights and freedoms, to ensure the protection, independence, territorial integrity and security of the Republic to the glory of the Republic of Armenia and to the welfare of the people of the Republic of Armenia\".\nConstitutional powers and duties\nThe powers of President of Armenia are determined by the Constitution.\nThe president is the one to ensure the regular functioning of the Executive, Legislative and Judicial powers of the Republic of Armenia. They do not directly control any of those branches, but they hold the power to interfere in their actions.\nRoles in the executive branch\nAccording to Article 1 of the Law on the President of the Republic of Armenia adopted on August 1, 1991, the president is the head of the executive branch. However, this term ceased to exist in 2007. The president of the Republic should deliver addresses to the people and the National Assembly.\nForeign relations\nThe president of the Republic is the one who\n*Represents the Republic of Armenia in international relations, carries out general guidance of foreign policy, concludes international agreements, forwards international agreements to the National Assembly for ratification, and signs their ratification instruments;\n*Approves, suspends or annuls the international agreements for which no ratification is required;\n*Appoints and recalls from office diplomatic representatives of the Republic of Armenia in foreign countries and international organizations.\nGovernment formation\nThe president appoints as prime minister the person enjoying the confidence of the majority of the deputies. This is done on the basis of the distribution of the seats in the National Assembly and consultations held with the parliamentary factions. If the appointment of the prime minister according to the above-mentioned procedures is impossible, the president of the Republic can appoint as the prime minister the person enjoying the confidence of the maximum number of the deputies. The Government is formed within 20 days after the appointment of the Prime Minister.\nUpon the recommendation of the prime minister, the president of the Republic can appoint and dismiss from office the members of the Government. They also may appoint one of the ministers as a deputy prime minister, with the suggestion of the prime minister.\nPresident appoints state office positions, forms and presides over National Security Council, and may establish other advisory bodies if necessary.\nGovernment operations\nThe procedure for the organization of operations of the Government and other public administration bodies under the Government are defined by the decree of the president.\nThe president may cancel the action of governmental decision for one month and apply to Constitutional Court to deal with the problem. The president is the one who validates decisions of the government about appointing and rejecting governors. Governmental sessions on issues connected to external policy and national security are also initiated by the president. According to Article 111 of the constitution the president is the one who can call a referendum to make amendments in the Constitution of the Republic of Armenia\nGovernment resignation\nThe president of the Republic accepts the resignation of the Government only in one of the following days/cases:\n# When the first sitting of the newly elected National Assembly is held\n# When the President of the Republic assumes office\n# When the National Assembly expresses no confidence in the Government\n# When the National Assembly does not give an approval to the Program of the Government.\n# When the Prime Minister resigns or when the office of Prime Minister remains vacant\nAfter the acceptance of the resignation of the Government by the president of the Republic the members of the Government continue performing their responsibilities until the new Government is formed.\nMilitary affairs\nThe president of the Republic is the Commander-in-Chief of the armed forces of the republic, who coordinates the operations of the government bodies in the area of defense, appoints and dismisses from office the highest commander of the armed forces and other troops.\nIn the event of an armed attack against the Republic, an imminent danger or declaration of war, the president may declare a martial law, may call for a general or partial mobilization and decide on the use of the armed forces. During warfare, they may appoint or dismiss from the office the Commander of the Armed Forces.\nThe president is the one who awards the orders and medals of the Republic of Armenia, promotes to highest military ranks and awards honorary titles.\nMartial law and states of emergency\nOne of the unique powers given to the president of the republic by the Constitution is the power to declare a martial law. But in this case no new elections can be held in the republic, and so the power can be a subject of usurpation by the incumbent president, that is why the National Assembly reviews the case and decides whether the grounds presented by the president are sufficient for declaring the martial law or state of emergency.\nIn the event of an imminent danger to the constitutional order, the president, after consulting with the Chairman of the National Assembly and the Prime Minister, declares a state of emergency and takes appropriate measures and addresses the people on the situation.\nImpact on independent agencies\nPresident of the republic plays a significant role in the formation of different independent agencies. They are the one who recommends to the National Assembly the candidacy of the prosecutor general, the chairman of the Central Bank and the chairman of Control Chamber. Upon the recommendation of the prosecutor general they appoint and/or dismiss the deputies of the prosecutor general. They also appoint the Council of Control chamber upon the recommendation of the Chairman of Control chamber. The members of the Council of the Central Bank are also appointed by the president.\nStaff formation and remuneration\nThe president forms their staff according to the procedures defined by the law. Their remuneration, servicing and security are also prescribed by the law.\nOther issues\nThe president resolves issues related to granting citizenship of the Republic of Armenia and political asylum. They also promote others to the highest diplomatic and other classification ranks.\nRoles in the legislative branch\nThe president of the Republic signs and promulgates the laws passed by the National Assembly. Within the period of twenty-one days they may remand the law passed by the National Assembly and return it in form of a letter, where they note their objections and recommendations and requests new deliberations on the issue. After the recommendations and objections of the president are considered, they should, within five days, sign and promulgate the law readopted by the National Assembly.\nThe president has the power to dissolve National Assembly and hold extraordinary elections if the National Assembly does not give an approval to the program of the Government two times in succession within two months.\nThe president of Republic may also dissolve the National Assembly upon the recommendation of the chairman of the National Assembly or the prime minister in the following cases:\n#If the National Assembly fails within three months to resolve on the draft law that was considered to be urgent by the decision of the Government;\n#If in the course of a regular session no sittings of the National Assembly are convened within three months;\n#If in the course of a regular session the National Assembly fails, for more than three months, to adopt a resolution on issues under consideration.\nThe president of the Republic also has the power to:\n*Put a veto on the decision of the National Assembly to adopt a law;\n*Initiate the amendment of the constitution.\nLegal acts issued by the President\nAccording to the Law on Legal acts, the president of the Republic of Armenia may adopt only regulatory or individual decrees or executive orders. Decrees and orders issued by the president cannot contradict the Constitution and laws of the Republic of Armenia and are subject to implementation throughout the territory of the Republic.\nRoles in the judicial branch\nThe president of the Republic of Armenia appoints 4 members of the Constitutional Court and, if the National Assembly fails to appoint the president of the Constitutional Court in the period prescribed in Article 83 Clause 1 of the Constitution, appoints the president of the Constitutional Court from among the members of the Constitutional Court.\nThey may, on the basis of a conclusion of the Constitutional Court terminate the powers of any of their appointees in the Constitutional Court or give their consent to involve the member as an accused, detain them, or authorize to institute a court proceeding to subject them to administrative liability.\nUpon the recommendation of the Council of Justice, the president appoints the presidents and the judges of the Court of Cassation and its chambers, the Court of Appeal, First Instance Court and specialized courts.\nThe president appoints two legal scholars as members of the Council of Justice. They can also grant pardon to convicted persons and suggest the National Assembly to declare an amnesty.\nMilitary powers and duties\nPowers of the president of the Republic of Armenia in the field of defense\nThe president of the Republic of Armenia is the supreme commander of the Armed Forces. The president of the Republic of Armenia coordinates the activities of state bodies in the field of defense and states:\n* the main directions of the military policy, including national security strategy and military doctrine,\n* the structure of the Armed Forces,\n* plans for the development of the Armed Forces of the other troops, the use of the armed forces, the deployment of the Armed Forces, mobilization plans of the Armed Forces, the Republican plan for civil defense,\n* defence plan for operational equipment in the Republic of Armenia, the state program of development of the military–industrial complex, armaments and military equipment,\n* lists of posts of senior commanders, senior officers of the positions and their respective officers of higher ranks of the Armed Forces and other troops;\nThey also appoint and dismiss the supreme command of the Armed Forces and other troops, confer the highest military ranks.\nIn the case of an armed attack on the Republic of Armenia, in the presence of an immediate threat or a declaration of war leads to martial law, the president decides on the use of the armed forces and can declare general or partial mobilization. They can also appoint and dismiss the commander of the Armed Forces during the war.\nThe president decides the participation of Armed Forces in peacekeeping or military operations outside the territory of the Republic of Armenia in accordance with international treaties of the Republic of Armenia.\nPresident publishes a decree on compulsory military service and demobilization and carries out other statutory powers in the field of defense.\nManagement and control of the armed forces\nThe general management of the armed forces is implemented by the president of Republic of Armenia as the supreme commander of the Armed Forces. But If the president does not have a parliamentary majority or parliamentary political vector is contrary to the president, the president lacks the rights to bring their decisions to life.\nDirect management of the Armed Forces is realized by the minister of defense of the Republic of Armenia, which organizes and controls the activities of the Armed Forces and other agencies and organizations within the system of the Ministry of Defence of the Republic of Armenia.\nThe management of the Armed Forces is exercised by the chief of the general staff, which is the highest military officer of the Armed Forces.\nMartial law\nDeclaring martial law\nThe president declares martial law in a case of an armed attack, an imminent danger thereof or declaration of war by the National Assembly of the RA. After declaring martial law the National Assembly of the RA convenes a special session.\nContent of the president's decree declaring martial law\nThe content of the declaration of Martial Law should include the circumstances that justify the declaration, the justification for the need to declare martial law, the borders of a territory where martial law is declared, forces and means of ensuring the legal regime of martial law, the period of martial law, the date of entry into force of martial law, measures of civil protections and the list of additional commitments that should be done by the citizens of RA and foreign countries, stateless persons and organizations. Simultaneously with or after the declaration of martial law, the President can declare general or partial mobilization, as well as a decision to use the armed forces of the Republic of Armenia. Decree of the president to declare martial law is subject to immediate publication on television, radio and the press.\nLegal regime of martial law\nIf the Martial Law is declared no elections are held and the National Assembly cannot be dissolved. The president of the Republic of Armenia and the National Assembly shall exercise their powers under martial law for the entire period.\nPresidential powers on ensuring the legal regime of martial law\nThe president manages the process to ensure the legal regime of martial law. In accordance with \"Legal Regime of Martial Law\" law, the President establishes the legal regime of martial law, providing for temporary measures and restrictions, the legal regime of martial law ensuring bodies and powers authorities, as well as ensures the implementation of measures and temporary restrictions on control of the legal regime of martial law. They can also announce general or partial mobilization and establish procedures for military service during the validity period of martial law.\nThe president also implements the legal regime of martial law aimed at ensuring the Constitution of the Republic of Armenia, this Law and other laws of other powers.\nTermination of powers\nThe President's powers are suspended if they resign, die, are incapable to perform their duties or are removed from office. The President of the Republic submits their resignation to the National Assembly.\nImpeachment\nThe president may be impeached for treason or other grave crimes. In order to obtain a conclusion on impeaching the president of the Republic, the National Assembly appeals to the Constitutional Court by a resolution adopted by the majority of the total number of deputies. The resolution to remove the president of the Republic from office is passed by the National Assembly by a two-thirds majority vote of the total number of deputies, based on the conclusion of the Constitutional Court. If the Constitutional Court concludes that there are no grounds for impeaching the president of the Republic the impeachment is removed from the agenda of the National Assembly.\nHealth issues\nIn case of serious illness of the president of the Republic or other insurmountable obstacles which make it impossible for the President to perform their responsibilities, the National Assembly, upon the recommendation of the Government, the conclusion of the Constitutional Court and with a minimum of two-thirds majority vote of the total number of its members, adopts a decision that states the incapacity of the president of the Republic to discharge their powers. If the Constitutional Court concludes that there are reasons for the incapacity of the president of the Republic to discharge their responsibilities, the Government cannot apply to the National Assembly with such an issue.\nOfficial residence\nThe official residence of the president of Armenia is located at Baghramyan Avenue 26 in Yerevan. Since 2018, the Honour Guard Company of the Ministry of Defense performs public duties at the residence, the gates of which are usually open to visitors on weekends and for a short period on weekdays.\nPress Secretary\nThe following have served as Press Secretary to the President:\n* Ruben Shugaryan (1992–1993)\n* Aram Abrahamyan (1993–1995)\n* Levon Zurabyan (1995–1995)\n* Kasia Abgaryan (1998–1999)\n* Vahe Gabrielyan (1999–2003)\n* Ashot Kocharyan (2003–2005)\n* Viktor Soghomonyan (2005–2008)\n* Samvel Farmanyan (2008–2010)\n* Armen Arzumanyan (2010–2013)\n* Arman Saghatelyan (2013–2015)\n* Vladimir Hakobyan (since 2015)\nList of officeholders\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n!\n! Name\n! width=\"100px\" | Portrait\n! Elected\n! Took office\n! Left office\n! Time in office\n! Office powers\n! Party\n|-\n! rowspan=2 style=\"background:; color:black;\"| 1\n| rowspan=2| Levon Ter-Petrosyan\n| rowspan=2|\n| 1991\n| 11 November 1991\n| 11 November 1996\n| rowspan=2|\n| rowspan=7| Head of Executive\n| rowspan=2| Pan-Armenian National Movement\n|-\n| 1996\n| 11 November 1996\n| 3 February 1998\n|-\n! rowspan=3 style=\"background:; color:black;\"| 2\n| rowspan=3| Robert Kocharyan\n| rowspan=3|\n| —\n| 3 February 1998\n| 9 April 1998\n| rowspan=3|\n| rowspan=3| Independent\n|-\n| 1998\n| 9 April 1998\n| 9 April 2003\n|-\n| 2003\n| 9 April 2003\n| 9 April 2008\n|-\n! rowspan=2 style=\"background:; color:white;\"| 3\n| rowspan=2| Serzh Sargsyan\n| rowspan=2|\n| 2008\n| 9 April 2008\n| 9 April 2013\n| rowspan=2|  years\n| rowspan=2| Republican Party\n|-\n| 2013\n| 9 April 2013\n| 9 April 2018\n|-\n! style=\"background:; color:black;\"| 4\n| Armen Sarkissian\n|\n| 2018\n| 9 April 2018\n| 1 February 2022\n|\n| rowspan=3| State representation,Guarantor of Constitution\n| Independent\n|-\n! style=\"background:; color:white;\"| –\n| Alen Simonyan\n|\n| —\n| 1 February 2022\n| 13 March 2022\n|\n| Civil Contract\n|-\n! style=\"background:; color:black;\"| 5\n| Vahagn Khachaturyan\n|\n| 2022\n| 13 March 2022\n| Incumbent\n|\n| Independent\n|}\nElection results\nPresidential elections were held on March 2, 2018, and per the constitutional reforms implemented by the ruling party, it was the first time in Armenia's history when the president was elected by the National Assembly instead of a popular vote.\n{| class=\"wikitable\" style=\"text-align:center\"\n! rowspan=\"2\" |Candidate\n! colspan=\"2\" |First round\n|-\n!Votes\n!%\n|-\n| align=\"left\" |Armen Sarkissian\n|90\n|85.71\n|-\n| align=\"left\" |Invalid/blank votes\n|1\n|0.95\n|-\n| align=\"left\" |Abstentions\n|10\n|9.52\n|-\n| align=\"left\" |Total\n|101\n|96.19\n|-\n|-\n| align=\"left\" |Eligible Voters\n|105\n|100\n|-\n| colspan=\"5\" align=\"left\" |Source: [https://www.reuters.com/article/us-armenia-president/armenian-parliament-elects-ex-pm-sarkissian-as-countrys-new-president-idUSKCN1GE0WQ Reuters]\n|}\nFollowing the resignation of Armen Sarkissian in January 2022, the ruling Civil Contract Party nominated Vahagn Khachaturyan for the presidency. He was elected president by the Armenian parliament in the second round of voting. He was inaugurated on 13 March 2022.\nTimeline\nThis is a graphical lifespan timeline of the presidents of Armenia. They are listed in order of first assuming office.\nColors =\nid:ind value:rgb(0.86,0.86,0.86) legend:Independent\nid:panm value:rgb(1,0.78,0) legend:Pan-Armenian_National_Movement\nid:rpa value:rgb(0.82,0.41,0.12) legend:Republican_Party_of_Armenia\nid:cc value:rgb(0.32,0.41,0.69) legend:Civil_Contract_(Armenia)\nid:gray1  value:gray(0.85)\nid:gray2  value:gray(0.95)\nDateFormat = dd/mm/yyyy\nPeriod     = from:01/01/1991 till:31/12/+1}}\nTimeAxis   = orientation:horizontal\nScaleMajor = gridcolor:gray1 unit:year increment:5 start:1995\nScaleMinor = gridcolor:gray2 unit:year increment:1 start:1991\nLegend     = columns:1 left:150 top:35 columnwidth:170\nTextData =\npos:(20,38) textcolor:black fontsize:M\ntext:\"Political party:\"\nBarData =\nbar:Ter-Petrosyan\nbar:Kocharyan\nbar:Sargsyan\nbar:Sarkissian\nbar:Simonyan\nbar:Khachaturyan\nPlotData =\nwidth:5 align:left fontsize:9 shift:(5,-4) anchor:till\nbar:Ter-Petrosyan\nfrom: 11/11/1991 till: 03/02/1998 color:panm text:\"Levon Ter-Petrosyan\"\nbar:Kocharyan\nfrom: 04/02/1998 till: 09/04/2008 color:ind text:\"Robert Kocharyan\"\nbar:Sargsyan\nfrom: 09/04/2008 till: 09/04/2018 color:rpa text:\"Serzh Sargsyan\"\nbar:Sarkissian\nfrom: 09/04/2018 till: 01/02/2022 color:ind text:\"Armen Sarkissian\"\nbar:Simonyan\nfrom: 01/02/2022 till: 13/03/2022 color:cc text:\"Alen Simonyan (acting)\"\nbar:Khachaturyan\nfrom: 13/03/2022 till: $today     color:ind text:\"Vahagn Khachaturyan\"\n}}\nThe following chart lists presidents by lifespan (living presidents on the green line), with the years outside of their presidency in beige.\nImageSize = width:$width height:$height\nPlotArea  = right:10 left:1 bottom:80 top:60\nPeriod    = from:$start till:$end\nTimeAxis  = orientation:horizontal\nLegend    = orientation:vertical columns:1 left:0 top:50 columnwidth:500\nColors =\nid:bg          value:white\nid:lightline   value:rgb(0.8, 0.8, 0.8)\nid:lighttext   value:rgb(0.5, 0.5, 0.5)\nid:LIFESPAN    value:rgb(0.88, 0.90, 0.70) Legend: Lifespan\nid:INDEPENDENT value:rgb(0.86, 0.86, 0.86) Legend: Independent\nid:PANM        value:rgb(1, 0.78, 0)       Legend: Pan-Armenian_National_Movement\nid:RPA         value:rgb(0.82, 0.41, 0.12) Legend: Republican_Party_of_Armenia\nid:CC          value:rgb(0.32, 0.41, 0.69) Legend: Civil_Contract_(Armenia)\nid:NAME        value:rgb(0.15, 0.13, 0.05)\nid:TODAY       value:green\nBackgroundColors = canvas:bg\nScaleMinor = gridcolor:lightline unit:year increment:1 start:$start\nScaleMajor = gridcolor:lighttext unit:year increment:10 start:1940\nLineData=\nat:$now color:TODAY width:0.1\nPlotData=\nbar:1 width:18\ncolor:LIFESPAN align:center fontsize:M\nfrom:09/01/1945 till:11/11/1991 shift:(-0,$dy) textcolor:NAME text:Levon Ter-Petrosyan\ncolor:PANM\nfrom:11/11/1991 till:03/02/1998\ncolor:LIFESPAN\nfrom:03/02/1998 till:$now\nbar:2 width:18\ncolor:LIFESPAN align:center fontsize:M\nfrom:31/08/1954 till:04/02/1998 shift:(-0,$dy) textcolor:NAME text:Robert Kocharyan\ncolor:INDEPENDENT\nfrom:04/02/1998 till:09/04/2008\ncolor:LIFESPAN\nfrom:09/04/2008 till:$now\nbar:3 width:18\ncolor:LIFESPAN align:center fontsize:M\nfrom:30/06/1954 till:09/04/2008 shift:(-0,$dy) textcolor:NAME text:Serzh Sargsyan\ncolor:RPA\nfrom:09/04/2008 till:09/04/2018\ncolor:LIFESPAN\nfrom:09/04/2018 till:$now\nbar:4 width:18\ncolor:LIFESPAN align:center fontsize:M\nfrom:23/06/1953 till:09/04/2018 shift:(-0,$dy) textcolor:NAME text:Armen Sarkissian\ncolor:INDEPENDENT\nfrom:09/04/2018 till:01/02/2022\ncolor:LIFESPAN\nfrom:01/02/2022 till:$now\nbar:5 width:18\ncolor:LIFESPAN align:center fontsize:M\nfrom:05/01/1980 till:01/02/2022 shift:(-0,$dy) textcolor:NAME text:Alen Simonyan\ncolor:CC\nfrom:01/02/2022 till:13/03/2022\ncolor:LIFESPAN\nfrom:13/03/2022 till:$now\nbar:6 width:18\ncolor:LIFESPAN align:center fontsize:M\nfrom:22/04/1959 till:13/03/2022 shift:(-0,$dy) textcolor:NAME text:Vahagn Khachaturyan\ncolor:INDEPENDENT\nfrom:13/03/2022 till:$now\nTextData =\nfontsize:M\ntextcolor:green\npos:($warning,30)\ntext:Updated /\nTextData =\npos:(340,$height)\nfontsize:L\ntextcolor:black\ntext:\"Lifespan of each Armenian president\"\n}}\nThe following chart shows presidents by their age (living presidents in green), with the years of their presidency in blue. The vertical black line at 35 years indicates the minimum age to be president.\nbar:Kocharyan color:alive from:0  till:43.43\nbar:Kocharyan color:pres from:43.43  till:53.61\nbar:Kocharyan color:alive from:53.61  till:\nbar:Sargsyan color:alive from:0  till:53.78\nbar:Sargsyan color:pres from:53.78  till:63.78\nbar:Sargsyan color:alive from:63.78  till:\nbar:Sarkissian color:alive from:0  till:64.79\nbar:Sarkissian color:pres from:64.79  till:68.61\nbar:Sarkissian color:alive from:68.61  till:\nbar:Simonyan color:alive from:0  till:42.07\nbar:Simonyan color:pres from:42.07  till:42.18\nbar:Simonyan color:alive from:42.18  till:\nbar:Khachaturyan color:alive from:0  till:62.89\nbar:Khachaturyan color:pres from:62.89  till:\nLineData=\nlayer:front\nat:35 width:1.5 color:black # Minimum age to be President\n}}\nPresidential Awards\nThe president of Armenia grants the following awards.\n* RA Presidential Award\n* RA Presidential Youth Award in the area of Classical Music\n* RA Presidential Youth Award\n* RA Presidential Award for Considerable Contribution to the Process of Recognition of the Armenian Genocide\n* Global Award of the President of the Republic of Armenia for Outstanding Contribution to Humanity through IT (Global IT Award)\n* Educational Awards of the President of the Republic of Armenia in the Sphere of Information Technologies\nSee also\n* Deputy Prime Minister of Armenia\n* List of leaders of Armenia\n* President of the National Assembly of Armenia\n* Prime Minister of Armenia\n* Vice President of Armenia\nExternal links\n* [https://president.am/en/history The History of the Residence of the President of Armenia]\nReferences"
    }
  ]
}