{
  "content": [
    {
      "type": "text",
      "text": "# Presidential Emergency Facility\n\nA Presidential Emergency Facility (PEF), also called Presidential Emergency Relocation Centers and VIP Evacuation and Support Facilities, is a fortified, working residence intended for use by the president of the United States should normal presidential residences, such as the White House or Camp David, be destroyed or overrun during war or other types of national emergencies. Some Presidential Emergency Facilities are specially designated sections of existing government and military installations, while others are dedicated sites that have been purpose-built. Various sources state there are, or were, between 9 and 75 such facilities.\nQuantity and location\nIn his 1984 journalistic expose “The Day After World War III”, Edward Zuckerman states there were then nine Presidential Emergency Facilities within a 25-minute helicopter trip from Washington, D.C. According to Zuckerman, sites known to him at that time were code-named Cartwheel (at Fort Reno Park), Corkscrew (at Lambs Knoll), Cowpuncher (in Martinsburg, West Virginia), and Cannonball (Cross Mountain, Pennsylvania), though all have since been decommissioned.   The White House itself is known as Crown while the presidential compound at the High Point Special Facility is Crystal (sometimes referred to as Crystal Palace).\nOther known sites include Cactus (Camp David), and Creed (also known as the R site, Raven Rock Mountain Complex).\nIn a 2004 report to the Federal Communications Commission (FCC) concerning Corkscrew, which at the time had been decommissioned as a PEF site, historian David Rotenstein contended there were 75 PEFs “scattered throughout the United States”, a number also claimed by the Brookings Institution.\nDesign and staffing\nConstruction on Presidential Emergency Facilities began in the 1960s from classified, black budget government appropriations.\nPurpose-built Presidential Emergency Facilities are silo-like structures constructed from reinforced concrete that sit atop an underground warren of bunkers and chambers designed to withstand a nuclear explosion. One of the few descriptions of a Presidential Emergency Facility observed while still in operation was provided by U.S. Coast Guard Captain Alex R. Larzelere, a former White House military aide, who visited one such site in 1968.\nLarzelere went on to describe the subterranean interior of the site, noting there were quarters for the president and his staff with beds kept ready for immediate use with fresh linens, communications facilities, and stores stocked with emergency rations, medicine, and other supplies to sustain several people for a prolonged period.\nBill Gulley, a former U.S. Marine assigned to the White House Military Office, reported in 1980 that PEFs were all \"manned twenty-four hours a day\".\nTelecommunication network\n]]\nA dedicated telecommunication network was needed for open lines of communications between the Presidential Emergency Facility sites. In the 1950s and 1960s, the widely used telecommunication technology for transmitting information was microwave radio relay. This is a point-to-point communication system that requires an unobstructed line-of-sight between the transmitter and the receiver. For this system to be able to transmit information in a long distance, stations with a microwave tower need to be set at fixed locations every . At each station, the radio signal receiver and transmitter can relay the information to the next station. Tall microwave towers would be easily identified and could compromise the security of the sites. The planner designed such towers to have radio equipment installed at the top of tower structure which was enclosed in plexiglass to conceal them from the view. The towers themselves were disguised to have an appearance of other structures such as water towers. There was no explanation of what exactly was built there but there were signages to make the public believe that the functions of the towers were anything but the telecommunication equipment. At the Cartwheel site, the tower was built next to two other actual water towers. At the Cactus site, the staff ran water tanker trucks regularly to the site to make it more believable to the public that the tower was indeed a water tower.\nThe stations were decommissioned due to outdated threats and technology. After decommissioning, Corkscrew and Cartwheel were transferred to Federal Aviation Administration and continued to be used as telecommunication towers.\nSee also\n*Federal Relocation Arc\n*Ground-Mobile Command Center\n*White House Big Dig\nReferences"
    }
  ]
}