{
  "content": [
    {
      "type": "text",
      "text": "# President of Paraguay\n\n| insignia =\n| insigniasize =\n| insigniacaption =\n| insigniaalt =\n| flag = Flag of the President of Paraguay.svg\n| flagsize =\n| flagalt =\n| flagborder = yes\n| flagcaption = Standard of the president\n| image = Santi Peña (cropped).jpg\n| imagesize =\n| alt =\n| imagecaption =\n| incumbent = Santiago Peña\n| acting =\n| incumbentsince = 15 August 2023\n| department =\n| style = Mr. PresidentMost Excellent Mr. President of the Republic Su Excelencia\n| type =\n| status = Head of stateHead of government\n| abbreviation =\n| member_of =\n| reports_to =\n| residence = Mburuvicha Róga\n| seat = Palacio de los López, Asunción\n| nominator =\n| appointer = Direct popular election\n| appointer_qualified =\n| termlength = Five years,\n| termlength_qualified = non renewable\n| constituting_instrument = Constitution of Paraguay (1992)\n| precursor =\n| formation =\n| first = Carlos Antonio López\n| last =\n| abolished =\n| superseded_by =\n| succession =\n| unofficial_names =\n| deputy = Vice President of Paraguay\n| salary = 61,054,085 Paraguayan guarani/8,587 USD per month\n| website =\n| footnotes =\n}}\nThe president of Paraguay (), officially known as the president of the Republic of Paraguay (), is the head of the executive branch of the government of Paraguay, serving as both head of state and head of government according to the Constitution of Paraguay. His honorific title is Su Excelencia.\nThe incumbent president of Paraguay is Santiago Peña, who took office on 15 August 2023. The presidential seat is the Palacio de los López, in Asunción. The presidential residence is the Mburuvichá Roga, also in Asunción. Once presidents leave office, they are granted by the Constitution of Paraguay the speaking-but-non-voting position of senator for life.Constitution of the Republic of Paraguay, 1992, Article 189 (subsection 1): \"(1) Former presidents of the Republic who were democratically elected will be national senators for life, except for those who were impeached from office.\n(2) They will not count toward a quorum.  They will have the right to speak, but not to vote.\"\nFeatures of the office\nRequirements\nArticle 228 of the Constitution establishes that the president must be a naturalized citizen, be at least 35 years old, and have full political and civil rights.\nElection\nArticle 230 of the Constitution establishes that the president and the vice president must be elected in a joint ticket by a single round of direct vote, in an election taking place between 90 and 120 days before the expiration of the previous presidential term (per Article 229, August 15). Article 229 also establishes that the president serves a single term of 5 years and is forbidden to be re-elected under any circumstances, and that the vice president must resign from their role 6 months before the election, if they decide to run for the presidency.\nThe re-election ban dates back to the aftermath of the Alfredo Stroessner dictatorship, in which Stroessner was re-elected without term limits. An attempt by the Senate to abolish term limits on 1 April 2017 resulted in protests; it was ultimately rejected.\nPowers and duties\nAccording to Article 238 of the Constitution, the president's duties are:\n#Representing the State and direct the general administration of the country.\n#Comply with and enforce the Constitution and its laws.\n#Participating in the formation of laws.\n#Veto laws passed by Congress.\n#Issue decrees that require the endorsement of the Minister of the branch.\n#Appoint and remove by itself the ministers of the Executive Branch, the Attorney General of the Republic and the officials of the Public Administration.\n#The management of the foreign relations of the Republic.\n#Report to Congress of the efforts carried out by the Executive Branch, as well as report on the general situation of the Republic and plans for the future.\n#Being the Commander in Chief of the Nation's Armed Forces.\n#Pardon or commute sentences imposed by the judges and courts of the Republic, and with a report from the Supreme Court of Justice.\n#Convene extraordinary sessions of Congress.\n#Proposing bills to Congress.\n#Prepare and present the annual project of the General Budget of the Nation\nSuccession\nArticle 234 of the Constitution establishes that in the event of impediment or absence of the offices of the President and Vice President, the Presidency of the Republic shall be assumed by, in order of succession, the President of the Senate, the President of the Chamber of Deputies, and the President of the Supreme Court of Justice.\nResidence\nThe Mburuvicha Róga in Asunción is the official residence of the president. It was first built in 1930.\nThe Palacio de los López is the president's workplace, located in the center of Asunción. It was first built in orders of Paraguay's first president Carlos Antonio López in 1844, and was planned to be handed to his son and designated successor, Francisco Solano López. It was completed in 1867, in the midst of the Paraguayan War, and thus it was never used by Solano López. The Palace was heavily damaged in the war, and it was not until 1894 that it was finally restored and repaired by Juan Bautista Egusquiza, who was the first president to establish the Palace as his official workplace.\nFile:Mburuvicha Róga Asunción Paraguay.jpg|Mburuvicha Róga, the official residence\nFile:Palacio de López 2023.jpg|Palacio de los López, the official workplace\nLatest election\nSee also\n*First Lady of Paraguay\n*List of presidents of Paraguay\nReferences\nExternal links\n* [https://www.presidencia.gov.py Presidency of the Republic of Paraguay]"
    }
  ]
}