{
  "content": [
    {
      "type": "text",
      "text": "# Prespa (medieval town)\n\nPrespa (, )  was a medieval town, situated in the homonymous area in south-western Macedonia. It was a residence and burial place of the Bulgarian emperor Samuel and according to some sources capital of the First Bulgarian Empire and seat of the Bulgarian Patriarchate in the last decades of the 10th century.\nLocation\nThe toponym Prespa is used for a lake, an island settlement or simply an island. The exact borders and character of the town are difficult to define by the historical sources. It has been searched in the valley of the Lake Prespa, surrounded by the mountains Baba, Petrino, Galičica, Zvezda and Korbets. It is situated in the territories of three modern countries: Albania, North Macedonia and Greece. According to the archaeological research, in the Early Middle Ages there were construction activities in the following sites:\n*On the island of Saint Achilleios in the Little Prespa Lake (today in Greece)\n*In the modern village of Agios Germanos to the east of the Little Prespa Lake in Greece\n*On the islands of Golem Grad (in North Macedonia) and Maligrad (in Albania) in Lake Prespa\n*In the vicinity of the modern village Carev Dvor to the north of the lake\n*On the summit of Galičica, the mountain range between Prespa and Lake Ohrid (the fortress Vasiliada)\nIt is likely that the town itself, the center of that agglomeration of settlements, was situated on the Island of Saint Achilleios. It is the largest of the three mentioned islands (1,700 m long and 500 m wide). The ruins of several churches have been discovered, including a large basilica, which was according to some researchers one of the seven large churches, constructed by prince Boris I after the Christianization of Bulgaria, while other suggest that it was built by Thessalian Greeks by orders of emperor Samuel. Its architectural plan is similar to that of the Great Basilica in the old capital Pliska. There are traces of the early medieval Bulgarian painting and sculpture in the ruins. On the inner side of the apse are written the names of the bishops who were subordinated to the Bulgarian Patriarch in the late 10th century. The central part of the island along with the heights Kale (the Bulgarian for fortress) and Kulata (the Tower) used to be fortified. There were churches and probably residential buildings in lower parts and along the coast. That area constituted the Outer town. The northern end was named Porta (Gate) which may suggest that the Outer town also had defense structures.\nHistory\n, found in the village of Agios Germanos]]\nThe town gained great political significance after 971 when the capital of Bulgaria Preslav was seized by the Byzantines during the war against Sviatoslav of Kiev. A few years later, Prespa was one of the centers of the uprising of the Cometopuli brothers, who kept the western Bulgarian lands out of Byzantine occupation. There are theories that the lake town was the residence of the eldest of the four brothers, David, before he was killed in 976. Later it became the residence of Samuel who de facto ruled the Bulgarian Empire after the murder of his brother Aron in 976 or 986 and especially after the legitimate emperor Roman was captured by the Byzantines in 991. Due to that fact, some authors suggest that Prespa became official capital of the empire. According to Encyclopedia Bulgaria the town was capital between 973 and 996, according to the Cyril and Methodius Encyclopedia it was capital at least to 1015 but many medievalists do not agree with that. Some think that Sofia was the political center of the country up to 986 while others consider that Prespa was never an official capital of Bulgaria, unlike Skopje and Ohrid.\nAfter the conquest of Larissa in Thessaly in 983 or 985, Samuel took the relics of Saint Achilles to Prespa. The large island of the Little Prespa Lake was named after the saint. During the rule of Samuel there were palaces on the island which were connected to a tower on the opposite shore by means of artificial sand-bank. On the eastern shore of the lake, near the village of Agios Germanos, Samuel erected an inscription dedicated to his parents, Comita Nikola and Ripsimia of Armenia, and his eldest brother David. When Samuel was proclaimed Emperor in 997, the seat of the Bulgarian Patriarchate was in Prespa but was subsequently moved to Ohrid.\nImmediately after the disastrous defeat at the hands of the Byzantines in the battle of Kleidion, his soldiers were blinded by order of the Byzantine emperor Basil II. Emperor Samuel sought refuge in Prespa, where he died of a heart attack on 6 October 1014. Prespa remained an Imperial residence for his successor Ivan Vladislav. In 1016 the Serbian prince Jovan Vladimir was murdered in Prespa by order of Ivan Vladislav. The Byzantines conquered Prespa in 1018, after the larger part of the Bulgarian nobility surrendered to Basil II. The emperor did not destroy the fortress but renamed it to Constantia.\nPrespa, including the Basilica of Saint Achilles and Samuel's palaces, was destroyed by Latin mercenaries in 1073, in the aftermath of the suppression of the Uprising of Georgi Voiteh, who attempted to restore the independence of Bulgaria. Prespa continues to be mentioned as an administrative center in 12th-century sources. It was ruled by the Despotate of Epirus in the beginning of the 13th century, then by the Second Bulgarian Empire and in 1259 was seized by the Nicaean Empire during the campaign that led to the Battle of Pelagonia. It is not mentioned in later sources.\nDuring excavations in 1969 the Greek archaeologist Nikolaos Moutsopoulos discovered a grave which is thought to be the burial place of emperor Samuel.\nFootnotes\nSources\nReferences\n* Ангелов, Д., Чолпанов, Б. Българска военна история през Средновековието (X-XV век), Издателство на БАН, София 1994,\n* Андреев, Й. Самуил, в: Андреев, Й., Лазаров, Ив., Павлов, Пл. Кой кой е в Средновековна България. Исторически справочник, издателство „Просвета“, София 1994 (1995), , стр. 334\n* Ваклинов, Ст. [http://www.promacedonia.org/sv/index.html Формиране на старобългарската култура VI-XI век], Издателство „Наука и изкуство“, София 1977 (цитиран по електронното издание в сайта [https://web.archive.org/web/20140721130524/http://www.promacedonia.org/index.html Книги за Македония], от 9.8.2008)\n* Георгиев, П. Преспа, в: Кирило-Методиевска енциклопедия, т. III, стр. 327-331, Академично издателство „Марин Дринов“, София 2003,\n* Енциклопедия „България“, том 1, Издателство на БАН, София 1978\n* Енциклопедия „България“, том 5, Издателство на БАН, София 1986\n* Златарски, В. [http://www.promacedonia.org/vz1b/index.html История на българската държава през средните векове, том 1, част 2: От славянизацията на държавата до падането на Първото царство (852-1018)], Издателство „Наука и изкуство“, София 1971 (достъпно в Интернет от сайта [https://web.archive.org/web/20140721130524/http://www.promacedonia.org/index.html Книги за Македония] на 27.7.2008)\n* Иванов, Й. Български старини из Македония (фототипно издание), Издателство „Наука и изкуство“, София 1970\n* Иванов, Й. Цар Самуиловата столица в Преспа, в: Известия на българското археологическо дружество, т. I, 1910, стр. 55-80.\n* История на България, том III, Издателство на БАН, София 1982\n* Кънчов, В. [http://www.promacedonia.org/vk_1/vk1_b_5.html Избрани произведения, Том I], София, 1970, стр.214-216 и 218-219\n* Микулчиќ И. [http://www.kroraina.com/knigi/im3/im_resen.htm#2 Средновековни градови и тврдини во Македонија], Скопје, 1996\n* Муцопулос, Н. Базиликата „Свети Ахилий“ в Преспа. Един исторически паметник-светиня, София, 2007.\n* Николов, Г. Централизъм и регионализъм в ранносредновековна България (края на VII - началото на XI век), Академично издателство „Марин Дринов“, София 2005,\n* Павлов, Пл. [https://web.archive.org/web/20090525122132/http://www.vmro-rousse.hit.bg/Pl_Pavlov.html Цар Самуил и „Българската епопея“], София / Велико Търново 2002 (достъп от сайта [https://web.archive.org/web/20100820172720/http://www.vmro-rousse.hit.bg/ ВМРО Област Русе] на 27.7.2008)\nExternal links\n* [https://www.youtube.com/watch?v=yH9eE4G2kAQ&feature=PlayList&p=CD1FBD35542F3DD1&playnext=1&index=26 БНТ: Островът на цар Самуил] (YouTube)"
    }
  ]
}