{
  "content": [
    {
      "type": "text",
      "text": "# Presidential Memorandum on Military Service by Transgender Individuals (2017)\n\n| signedpresident  = Donald Trump\n| summary          = Military service by transgender individuals\n| type             = Presidential memorandum\n| documentnumber   = 2017-18544\n| publicationdate  =\n| documentcitation = 41319\n}}\nThe Presidential Memorandum on Military Service by Transgender Individuals, officially the Presidential Memorandum for the Secretary of Defense and the Secretary of Homeland Security, is the 27th presidential memorandum signed by U.S. President Donald Trump on August 25, 2017. The intent was to prevent transgender people from serving in the U.S. military, on the basis that they would be a financial burden due to sex reassignment procedures and associated costs. Federal courts delayed the implementation of this rule by issuing four injunctions. On January 22, 2019, however, the U.S. Supreme Court allowed the Trump administration's ban to take effect.\nOn October 30, 2017, in the case of Jane Doe v. Trump, Judge Colleen Kollar-Kotelly granted the plaintiffs a preliminary injunction on the provisions of the memorandum prohibiting open military service and enlistment of transgender people. On November 21, 2017, in the case of Stone v. Trump, Judge Marvin J. Garbis granted the plaintiffs a preliminary injunction on the entirety of the Presidential Memorandum for the Secretary of Defense and the Secretary of Homeland Security. Also that day, the United States Department of Justice appealed the preliminary injunction in the case of Jane Doe v. Trump. The Pentagon's six-month delay on accession of transgender individuals into military service expired January 1, 2018.\nThe original policy, which this Memorandum replaced, had been blocked in 2017 (Jane Doe v. Trump), when it was ruled that as far as could be seen, \"all of the reasons proffered by the president for excluding transgender individuals from the military in this case were not merely unsupported, but were actually contradicted by the studies, conclusions and judgment of the military itself\". The 2018 Memorandum and policy superseding this Memorandum was itself stayed on 13 April 2018 when a Washington court ruled in Karnoski vs. Trump (Western District of Washington) that the 2018 Memorandum essentially repeated the same issues as its predecessor order from 2017, that transgender service members (and transgender individuals as a class) were a protected class entitled to strict scrutiny of adverse laws (or at worst, a quasi-suspect class), and ordered that matter continue to a full trial hearing on the legality of the proposed policy.\nOn January 25, 2021, Trump's successor Joe Biden signed an executive order which revoked the transgender military ban.\nProvisions\n* Maintain the currently effective policy regarding accession of transgender individuals into military service beyond January 1, 2018, until such time as the Secretary of Defense, after consulting with the Secretary of Homeland Security, provides a recommendation to the contrary. This provision takes effect on January 1, 2018.\n* Prohibit open military service of transgender individuals \"until such time as a sufficient basis exists upon which to conclude that terminating that policy and practice would not have the negative effects discussed above.\" However, until the Secretary of Defense has made that determination, no action may be taken against such individuals under the policy of this memorandum. This provision takes effect on March 23, 2018.\n* Prohibit all use of Department of Defense or Department of Homeland Security resources to fund sex reassignment surgery procedures for military personnel, except to the extent necessary to protect the health of an individual who has already begun a course of treatment to reassign his or her sex. This provision takes effect on March 23, 2018.\n* By February 21, 2018, the Secretary of Defense, in consultation with the Secretary of Homeland Security, shall submit to me a plan for implementing both the general policy set forth in this memorandum and the specific directives set forth in this memorandum.  The implementation plan shall adhere to the determinations of the Secretary of Defense, made in consultation with the Secretary of Homeland Security, as to what steps are appropriate and consistent with military effectiveness and lethality, budgetary constraints, and applicable law.  As part of the implementation plan, the Secretary of Defense, in consultation with the Secretary of Homeland Security, shall determine how to address transgender individuals currently serving in the United States military.\nEnactment\nOn August 29, 2017, Secretary James Mattis announced that currently serving transgender troops would be allowed to remain in the armed services, pending further study. Mattis stated he would set up a panel of experts from the Departments of Defense and Homeland Security to provide recommendations on implementing the President's policy direction.\nLawsuits\nOn August 9, 2017, the first of four lawsuits was filed in United States District Court seeking to block the Presidential Memorandum from being implemented.\nJane Doe v. Trump\nOn August 9, 2017, five transgender United States military personnel filed a lawsuit, Jane Doe v. Trump. They sued Trump and top Pentagon officials over the proposed banning of transgender people from serving in the military. The suit asks the court to prevent the ban from going into effect, under the auspices of the equal protection and due process clauses of the Fifth Amendment. The suit was filed on their behalf by two major LGBT-rights organizations, GLBTQ Legal Advocates & Defenders (GLAD) and the National Center for Lesbian Rights, who filed a petition in the United States District Court in Washington. On August 31, 2017, the plaintiffs applied for a preliminary injunction on the proposed ban, stating \"it is unconstitutional\" and that \"Plaintiffs have suffered serious and irreparable harms that will continue absent this Court's intervention.\" Also on August 31, three former secretaries of military services, Eric Fanning, Ray Mabus, and Deborah Lee James, submitted declarations in support of the plaintiffs.\nOn October 4, the Civil Division of the Department of Justice filed a motion to dismiss the amended complaint in Jane Doe v. Trump and to oppose the application for a preliminary injunction, arguing instead \"that challenge is premature several times over\" and that Secretary Mattis's Interim Guidance, issued on September 14, 2017, protects currently-serving transgender personnel from involuntary discharge or denial of reenlistment. On October 30, 2017, Judge Colleen Kollar-Kotelly granted the plaintiffs a preliminary injunction on the provisions of the memorandum prohibiting open military service and enlistment of transgender people. The Pentagon's six-month delay on accession of transgender individuals into military service expires January 1, 2018. In the ruling, Judge Kollar-Kotelly noted the defendants' motion to dismiss the case was \"perhaps compelling in the abstract, [but] wither[s] away under scrutiny.\" The ruling effectively reinstated the policies established prior to President Trump's tweets announcing the reinstatement of the ban, namely the retention and accession policies for transgender personnel effective on June 30, 2017. However, the court denied a preliminary injunction against the ban on government-funded sex reassignment surgery for service members \"because no Plaintiff has demonstrated that they are substantially likely to be impacted by this directive.\" On November 21, 2017, the United States Department of Justice appealed the preliminary injunction in the case of Jane Doe v. Trump.\nOn January 4, 2019, the court lifted the injunction.\nStone v. Trump\nOn August 28, 2017, the American Civil Liberties Union (ACLU) of Maryland filed a federal lawsuit, Stone v. Trump, on behalf of several transgender military service members, alleging that the ban violated their equal protection rights.\nOn November 21, 2017, Judge Marvin J. Garbis granted the Plaintiffs' motion for preliminary injunction on the entirety of the Presidential Memorandum of August 25, stating in his Order \"[t]he lack of any justification for the abrupt policy change, combined with the discriminatory impact to a group of our military service members who have served our country capably and honorably, cannot possibly constitute a legitimate governmental interest.\"\nKarnoski v. Trump\nAlso on August 28, Lambda Legal filed a federal lawsuit, Karnoski v. Trump, in Seattle on behalf of three transgender soldiers, the Human Rights Campaign, and the Gender Justice League, alleging that the ban violated equal protection, due process and free speech protections. On December 11, 2017, Judge Marsha J. Pechman issued a preliminary injunction blocking the Presidential Memorandum of August 25, stating the \"Defendants have failed to demonstrate that the policy prohibiting transgender individuals from serving openly is substantially related to important government interests\" and \"the prohibition on military service by transgender individuals was announced by President Trump on Twitter, abruptly and without any evidence of considered reason or deliberation.\"\nThe preliminary ruling was affirmed on 13 April 2018, and the policy stayed, in Karnoski vs. Trump (Western District of Washington), when the court ruled that the 2018 memorandum essentially repeated the same issues as its predecessor order from 2017, that transgender service members (and transgender individuals as a class) were a protected class entitled to strict scrutiny of adverse laws (or at worst, a quasi-suspect class), and ordered that matter continue to a full trial hearing on the legality of the proposed policy.\nStockman v. Trump\nOn September 5, 2017, Equality California (EQCA) filed a lawsuit, Stockman v. Trump in United States District Court for the Central District of California against the ban; the lawsuit includes four named and three unnamed transgender plaintiffs. In the complaint, which seeks an immediate injunction based on the Fifth Amendment, EQCA noted \"the stated bases offered in support of Defendants' August 25 Directive are pretextual, arbitrary, capricious, and unsupported by facts, evidence, or analysis\" and that \"transgender people have been serving openly [since 2016] without incident or any negative impact upon military readiness, lethality, unit cohesion, or the national defense generally.\" Judge Jesus Bernal issued an order granting the preliminary injunction and denying the motion to dismiss on December 22, 2017, writing the defendants' \"justifications fall far short of exceedingly persuasive\" and characterizing the ban as causing irreparable harm since \"[t]here is nothing any court can do to remedy a government-sent message that some citizens are not worthy of the military uniform simply because of their gender.\"\nLegislation\nOn September 15, 2017, a bipartisan bill () was introduced by senators John McCain (R-AZ), Jack Reed (D-RI), Kirsten Gillibrand (D-NY), and Susan Collins (R-ME) to prohibit involuntarily separating or denying re-enlistment of transgender troops solely on the basis of gender identity. During his testimony before the Senate, the highest-ranking uniformed officer of the United States military, General Joseph Dunford, chair of the Joint Chiefs of Staff, announced his advice that any troops who have served \"with honor and value\" should continue to serve, and that gender identity is not a credible reason for involuntary discharge. A bipartisan bill with nearly identical text () was introduced in the House on October 12, 2017. It was sponsored by Rep. Jackie Speier (D-CA) and co-sponsored by Charles Dent (R-PA), Susan Davis (D-CA), Ileana Ros-Lehtinen (R-FL), Adam Smith (D-WA), and Kyrsten Sinema (D-AZ).\nRevocation\nAs requested by the memorandum of August 25, Secretary Mattis submitted a memorandum and report regarding military service by transgender individuals. The United States Secretary of Homeland Security, Kirstjen Nielsen, concurred with Mattis's recommendations as applied to the Coast Guard. One of the recommendations made was \"that transgender persons with a history or diagnosis of gender dysphoria -- individuals who the policies state may require substantial medical treatment, including medications and surgery -- are disqualified from military service except under certain limited circumstances.\" On March 23, 2018, President Trump announced the prior memorandum of August 25 was revoked. With respect to future policies, the memorandum of March 23 went on to declare the Secretaries of Defense and Homeland Security \"may exercise their authority to implement any appropriate policies concerning military service by transgender individuals.\"\nOn January 25, 2021, U.S. President Joe Biden, Trump's successor, met with Secretary of Defense Lloyd Austin and signed an executive order which repealed the transgender military ban.\nSee also\n*Sexual orientation and gender identity in military service\n*Sexual orientation and gender identity in the United States military\nReferences"
    }
  ]
}