{
  "content": [
    {
      "type": "text",
      "text": "# President Dad\n\n| ko_hangul       = 소녀교육헌장\n| romanized       = Sonyeo Gyoyuk Heonjang\n|Humor      = y\n| author          = Rhim Ju-yeon\n| illustrator     =\n| publisher       =  Daiwon C.I.\n| publisher_en    =  Tokyopop\n| publisher_other =\n| demographic     =\n| magazine        =  Issue\n| first           = 2002\n| last            = 2004\n| volumes         = 7\n| chapter_list    =\n| related         =\n| content         =\n| subcat          = Daiwon\n| addpubcat1      = Tokyopop titles\n| ko              = Y\n}}\nPresident Dad is a manhwa created by Rhim Ju-yeon and distributed in English by Tokyopop. The work was originally titled as The Charter of National Education for Girls (소녀교육헌장, Sonyeo Gyoyuk Heonjang) published by Daiwon C.I. in 2002, South Korea.\nPlot\nPresident Dad follows a normal young girl, Ami Won, after her father becomes the president of South Korea. This situation seems to flip poor Ami's life upside down. There are problems that come simply from being a girl her age... Entering highschool, dealing with friends and peers, falling in love... And other problems that come from this new position, such as her new bodyguard Fahrenheit, the pressure from her aunt to face the title of first lady, and all of the unwinding mysteries that all of the people around her are wrapped in.\nCharacters\nMain characters\n*Ami Won is a freshman in high school whose father just became the President of Korea. Because her mother is deceased, she has taken the seat of first lady. Though she may look simple minded, Ami during her youth was considered a genius but her mother wanted her to be normal. In terms of fairytales, Ami is considered as Cinderella and her aunt and cousin as cruel stepmother and cruel step sister. Though, she does get a happy ending (albeit briefly) with her falling in love with Fahrenheit.\n*Moo-Hyun Kang is a 16-year-old North Korean, now living in South Korea. He's lived in several different countries during his young life, including China and France. He's one of Ami's classmates. At a young age, Moo-Hyun's family was attacked by a famous assassin, Michael Savior, whom Moo-Hyun killed in order to protect his younger sister. After, he served at the army and became trained in the arts of war. Another translation of his name appears to be Christine. He was once dating Ami, however they later discover that they are cousins (Ami's maternal grandmother became pregnant after a relationship with his grandfather). It is later revealed that he is Michael Savior's son.\n*Hwa-Ryun Lee is Ami's classmate and close friend. This character is actually Fahrenheit in disguise. However, his personality changes noticeably when being Hwa-Ryun, which is why she is considered a separate character. As the story progresses, it is revealed that Hwa-Ryun is a real woman living in Japan, whom Fahrenheit was merely imitating the personality and appearance of. After this is discovered, the character known as Hwa-Ryun to Ami takes on the personality of Fahrenheit himself and a slightly different appearance.\n*Fahrenheit is the man assigned as Ami's personal bodyguard. In order to watch over Ami at school, he also doubles as a classmate of Ami's, Hwa-Ryun Lee. He possesses the strange ability to take on the appearance of anyone he wishes by changing height and bodybuild. Fahrenheit can also imitate anyone's voice. He later falls in love with Ami.\nSecondary Characters\n*Bi-Na Sa is Ami's cousin, the daughter of a wealthy and important aristocratic family. She despises Ami and is helping her mother in trying to have her replace Ami as the first lady. Bi-Na shares a strong resemblance with Ami's mother. In book 7, it is revealed that Sur Hee manipulated her to imitate her looks and personality, in revenge against her mother who disrespected her.\n*Sur-Hee is Ami's late mother. She is also known as Snow White.  Her strange power is later revealed in the 7th book. She is believed to have guided Ami from the after life.\n*Ricardo is a man that married a woman named Lucia, another false persona created by Fahrenheit in order to get close to Ricardo and assassinate him.\n*Sistina Savior is the sister of Michael Savior, who attempts to take revenge on Moo-Hyun for the murder of her brother, by trying to kill Ami.\nBig Brother and followers\n*Big Brother (The Ruler)\n*Dorothy (The Reader)\n*Agatha (The Seeker)\n*Lewis (The Numberer)\n*Tristan and Isolde (The Executor)\n*Amedeo (The Joker)\n*Fahrenheit (The Changer)\n*Snow White (The Chooser)\n*Michael Savior\nMinor characters\n*Eui-Jung Kim is Ami's best friend, and one of her classmates.\n*Ho-Chan Won is Ami's father, the newly elected president of South Korea.\n*Rick is the lead singer of a band called High Peach, of whom Ami is a devoted fan. In book 7, it is revealed that he is the illegitimate son of a rich man, who is Bi-Na's father, making them half-siblings and Ami his cousin.\nMedia\nManhwa\n| LicensedISBN    =978-1-59816-210-3\n}}\nReferences"
    }
  ]
}