{
  "content": [
    {
      "type": "text",
      "text": "# Presidential Security Force of Indonesia\n\n\"Paspampres\"\n| image                         = Pasukan Pengamanan Presiden.png\n| image_size                    = 250\n| caption                       =\n| start_date                    =\n| country                       =\n| allegiance                    =  President of the Republic of Indonesia\n| branch                        = Tri-services (Army, Navy including Marines, and Air Force)\n| type                          = Protective security unit\n| role                          = *Close protection and escort towards the President, Vice President and VVIP\n*Public duties and Honor guard\n| size                          =\n| command_structure             =  (TNI)\n| garrison                      = Jakarta, Indonesia\n| garrison_label                =\n| equipment                     =\n| equipment_label               =\n| nickname                      =\n| motto                         =  (Loyal and Vigilant)\n| colors                        = Light Blue\n| colors_label                  = Beret colour\n| march                         =\n| mascot                        =\n| battles                       =\n| decorations                   =\n| battle_honours                =\n| current_commander             = Major General Achiruddin\n| current_commander_label       = Commander\n| ceremonial_chief              = Brigadier General (Marine) Oni Junianto\n| ceremonial_chief_label        = Deputy Commander\n| colonel_of_the_regiment       =\n| colonel_of_the_regiment_label =\n| notable_commanders            =\n| website                       = [http://www.paspampres.mil.id www.paspampres.mil.id]\n}}\nThe Presidential Security Force of Indonesia ( abbreviated \"Paspampres\") is one of the Central Executive Agencies () of the Indonesian National Armed Forces responsible for proximate security and escort towards the head of state and VVIP in Indonesia, which includes the President, Vice President with their immediate families, former Presidents and Vice Presidents, and visiting foreign heads of state. Paspampres is based in Jakarta, and its personnel are drawn from deputized best-chosen officers, soldiers, seamen, marines, and airmen from special forces and/or special units within the Indonesian National Armed Forces (TNI) (and until 2000, from the Indonesian National Police). It is commanded by a two-star military general.\nHistory\nThe formation date of the Presidential Security Force (Paspampres) is based on the operation to evacuate President Sukarno, Vice President Mohammad Hatta, Prime Minister Sutan Syahrir as well as several ministers and high-ranking government officials from Jakarta to Yogyakarta on 3 January 1946, This operation was based on the safety concerns of the President and VIPs about the allied forces intimidation in Jakarta. The rescue operation was conducted using the  a code-name for the special Presidential train. This date is commemorated as  or Paspampres Service Day.\nThe formation of a formal force dedicated to protecting the Indonesian president only came after several assassination attempts on President Sukarno. On 6 June 1962 a special regiment known as the Tjakrabirawa Regiment, was formed to protect the president and his family. June 6 was also the birthday of President Sukarno.  consisted of personnel from the army, navy, air force and police. In 1966, it was dissolved due its taking part in an army-led abortive coup d'état in 1965. The 1st Battalion's commanding officer, Lieutenant Colonel Untung Syamsuri, led the coup attempt and its members carried out the kidnappings of army generals who were later murdered. The protection of the president was then entrusted to an Army Military Police Task Force (Satgas POMAD) in 1966.\nA new presidential protection force named  (an abbreviation of  or \"Presidential Escort Force\") was formed on the 13 January 1976, under the command of the Minister of Defence and Commander of the Armed Forces. This force was renamed in 1988 becoming the current Paspampres. Today, Paspampres has strength of about 2,500 personnel and is headed by a two-star general/admiral/marshal from the TNI.\nResponsibility and tasks\nResponsibility\nAccording to Indonesian Government Regulation No. 59/2013, the Presidential Security Force (Paspampres) is responsible for the physical security at close range at all times of:\n*president and vice-president along with their immediate families,\n*former presidents and vice-presidents,\n*foreign heads of state/heads of government visiting Indonesia\nOther than those main duties, Paspampres is also tasked with state-protocol duties to support the main tasks of the Indonesian National Armed Forces.\nSpecific security duties for VVIPs as specified in article 3 of the Government Regulation No. 59/2013, include:\n#Personal security;\n#Installation security;\n#Activity security;\n#Rescue security;\n#Food safety;\n#Medical security;\n#News security; and\n#Escort\nTasks\nCurrently, the main tasks of the Paspampres are to:\n# provide protection for VVIPs and to ensure the safety of VVIPs from any immediate danger,\n# Secure installations which include security personnel, material, and all facilities used by the VVIP,\n# perform emergency rescue of VVIPs,\n# provide direct protection at close quarters from all forms of threats to VVIPs while traveling,\n# ensure the safety of food and medically related materials consumed by VVIPs,\n# provide guards of honor and the Presidential Band during state visits and other state occasions if required\nOrganisation\nThe organisation of Paspampres are as follows:\n*Leadership element, consist of the Commandant and Deputy Commandant\n*Leadership assistance element, consist of Inspectorate, Planning Staff, Intelligence Staff, Operations Staff, Personnel Staff and Logistics Staff.\n*Service staff element, consist of Chief of Staff, Secretariat and Headquarters Detachment.\n*Executive element agencies, consisting of several operational detachments and a separate armoured detachment ( abbreviated \"Yonkavser\") equipped with APCs\n**The Special Security Detachment performs daily duties, such as close protection towards the President, Vice President with their immediate families. The Special Security Detachment consists of:\n***Commando Group ( - \"Pokko\"), each commanded by a Colonel.\n****GROUP A, consisting of 4 Detachments, conducts close-range physical security towards the President with their immediate family.\n****GROUP B, consisting of 4 Detachments, conducts close-range physical security towards the Vice President with their immediate family.\n****GROUP C, in charge of close-range physical security towards visiting VVIPs during their visit to Indonesia. According to article 22 of the Government Regulation No. 59/2013, visiting foreign VVIPS includes the President, King, Emperor, Queen, His Highness, Pope, Governor-General, Vice President, Prime Minister, Chancellor, and Secretary-General of the United Nations. This unit also consists of 1 training detachment in charge of training and fostering the ability of Paspampres personnel.\n****GROUP D, consisting of 4 Detachments carrying out close physical security towards former Presidents and Vice Presidents with their immediate families\n***Private Escort Company\n***Special Security Company\n***Debarment Platoon\n**The State Protocol Escort Battalion ( abbreviated \"\") is tasked for escort and ceremonial duties such as Honour guard duties, Public duties, and Guard mounting. It has more than 400 guardsmen and detachments from this unit are assigned operationally to the four close-protection Groups mentioned above (Group A-D). This battalion is also responsible for the external security of the national official residences.\nat the Merdeka Palace yard]]\nReporting sub-units\n* Presidential Band\n* Group A Presidential Honor Guard Battalion\n* Group B Vice Presidential Honor Guard Battalion\n* Protocol and Honor Guard Battalion Bogor Palace\n* Protocol and Honor Guard Battalion National Palaces of Jakarta (Independence and State Palace)\n* Protocol and Honor Guard Battalion Garuda Palace\n* Protocol and Honor Company Gedung Agung\n* Horse Guards Troop and State Coach Troop (raised 2015)\n* State Lancer Guard Troop (raised 2016)\n* National Color Guards Company (raised 2016, reports to HQ)\nCeremonial duties\nduring State visits]]\nGuard of Honor\nThe Paspampres as a special joint-service command of the TNI, other than responsible for guarding and escorting the President, Vice President and VVIPs, are also responsible to carry out state-protocol duties during official ceremonies such as becoming the Honor Guard during a state visit and also carrying out public duties, quarter guard and guard mounting duties for the national official residences.\nThese ceremonial duties of Paspampres are assigned towards personnel of the \"State Protocol Escort Battalion\" ( abbreviated \"Yonwalprotneg\"), a detachment of the Paspampres consisting of chosen Military policemen from the Military Police Corps of Indonesia. This detachment is also tasked to become the Cordon Guard during the arrival ceremony at the airport apron during a state visit and also becomes the main Honour guard during a state visit and state funeral. 4 SPEB's are active, each corresponding to the four regiments of the force, with two assigned as guards of honor for public duties.\nUniform\npresenting arms weapon salute]]\nThe uniform worn by the Paspampres Honour guard is  a red full dress uniform with a white buff belt worn on the upper waist, white trousers with white parade boots and a black shako with white hackle or peaked cap as the headdress. When mounted, personnel wear a dragoon helmet and carry lances or sabres. During certain ceremonies such as a state funeral or changing of the guard ceremony, a light blue beret is worn instead for the headdress. At night, a black trouser is worn instead as a mess dress. If on vehicle escort, personnel wear civilian business dress. A peaked cap may also be worn on certain occasions. Cordon Guards () wear dominantly black, with red, and gold dress uniforms. This is different to the Honor Guards () who wear red and white uniforms.\nPresidential band\nThe Paspampres presidential band is a military band tasked for playing the national anthems during a State visit ceremony and performs music accompaniment during state-level receptions or banquets in the palaces and other official locations when the head of state is present.\nRecruitment\nPaspampres personnel are recruited and selected from the Indonesian National Armed Forces (Army, Navy (including Marines), and Air Force). They are selected from special forces and special units within the Armed Forces, such as from Kopassus, Kostrad, Raider Infantry Battalions (Airborne soldiers), Paskhas, Kopaska, Denjaka, Taifib and  Marines, as well as military policemen which are then tasked for escort and public duties. Each individual (men) has to be more than 175&nbsp;cm tall and minimal 180&nbsp;cm tall for close protection agents, each of them gets rigorous military training (sharp shooting, tactical combat, diving) and special martial arts training, such as Yong Moodo, Pencak Silat, Tarung Derajat, Mixed Martial Arts, and Aikido.\nAll Paspampres personnel are required to be proficient in at least in one of the martial arts, and it was proven by becoming second winners in the World Yong Moodo (Korean martial arts) Championship 2013. Paspampres personnel must carry out their duties with a high level of vigilance against any possible threat and are prepared to sacrifice their own life if required for the President, Vice President, and VVIP.\nEquipments\nWeaponry\nSome of the weapons used by Paspampres:\n|File:Heckler & Koch MP7A1.png|Heckler & Koch MP7A1\n|File:GLOCK 17 Gen 4 Pistol MOD 45160305.jpg|Glock series pistols\n||Pindad snipers (SPR)\n|title=}}\nVehicles\nApart from the official presidential cars which are a number of Mercedes-Benz S600 Guard limousines, the Paspampres also operate other tactical vehicles, such as:\nReferences\nExternal links\n*[http://paspampres.mil.id/ Official Website]\n*[https://www.youtube.com/watch?v=P6MLX71960w&t Paspampres video 1]\n*[https://www.youtube.com/watch?v=1SxCiT-MJDw Paspampres video 2]\n*[https://www.youtube.com/watch?v=lBi8yW5SRmw Paspampres video 3]\n*[https://www.youtube.com/watch?v=vH5Obdar8Mk The State Protocol Escort Battalion (Yonwalprotneg) of Paspampres]\n*[https://www.youtube.com/watch?v=d_-0l9Neftk Paspampres shooting exercise]"
    }
  ]
}