{
  "content": [
    {
      "type": "text",
      "text": "# Prewar period (Kosovo)\n\n* Many guerrilla attacks, leading to dozens of Yugoslav casualties.\n| side1 =  Kosovo Liberation Army\n----\nRepublic of Kosova FARKSupport: Albania\n| side2 =   Police of Serbia\n| leadfigures1 =  Adem Jashari Hamëz Jashari Ilaz Kodra Hashim Thaçi\n----\nIbrahim Rugova Jusuf Zejnullahu Bujar Bukoshi\n| leadfigures2 =  Slobodan Milošević\n| howmany1 =   active members\n----\n913,705 Kosovan citizens voted for their independence\n| howmany2 =  40,000 soldiers 35,000 policemen 1,000–1,200 volunteers\n| casualties1 =  at least 1 killed Several arrested\n| casualties2 =  Dozens killed Several injured\n| casualties3 =\n}}\nThe Prewar period of Kosovo refers to a period in the history of Kosovo which happened during the early to mid-1990s.\nIt is generally believed to have started on 22 September 1991, with the declaration of the Republic of Kosova and later ended with the start of an insurgency in the territory.\nEvents\nDeclaration of independence of the Republic of Kosova\nIn late June 1990, Ethnic Albanian members of the provincial assembly proposed a vote on whether to form an independent republic. The ethnic Serbian president of the assembly would shut it down, however he would promise to reopen the assembly on 2, but this was later postponed.\nOn 2 July, the vast majority of Ethnic Albanian members of the Provincial Assembly returned to the Assembly which had been locked; so in the street outside they voted to make Kosovo a republic within the Yugoslav federation. In response, the Serbian government dissolved the Assembly and government of Kosovo, removing all of its remaining autonomy, before passing a law on labour relations which dismissed 80,000 Albanians.\nThe ethnic Albanian members of the dissolved Kosovo Assembly met in secret in Kaçanik on 7 September and formed the \"Republic of Kosova\" in which laws from Yugoslavia would only be accepted if they were compatible with the Republic's constitution. The \"Republic of Kosova\" was then declared an independent state on 22 September 1991. This declaration was endorsed by 99% of the voters in an unofficial referendum held several days later. The first country that recognized the Republic of Kosova was Albania Serbian authorities rejected the election results, and attempted to capture and prosecute the voters.\nTraining of Kosovars in Albania\nDuring the year of 1991, a group of ethnic Kosovars would flee to Albania where they would complete a secret military training course with help from the Albanian army and government. The training was also supported by then Albanian president Ramiz Alia. Among these fighters, 50 would illegally cross the border into Yugoslavia. This group, led by Adem Jashari, Hamëz Jashari and Ilaz Kodra would later become the founding members of the KLA.\nSiege of Prekaz\nOn 29 December, Adem Jashari received a call that warned him about an approaching MUP convoy with armored vehicle's and helicopters. In response, Adem and his brother Hamëz gathered four of their friends and relatives and sought refuge in the neighboring street of Kodra. Believing it was safe, they returned home in the early hours of December 30, however they were met with gunfire from Serbian police officers. During the ensuing shootout, a crowd of both armed and unarmed Kosovo Albanians converged on the Jashari home, breaking the siege and forcing the MUP unit to retreat and declare Prekaz a \"no-go area\".\nSkenderaj–Drenas attacks\nBetween the years of 1991–1994, Adem Jashari led multiple attacks on Yugoslav police stations and patrols in the towns of Skenderaj and Drenas. During these attacks his forces would be able to kill dozens of officers.\nGlogovac attack\nIn 22, 23 or 25 May 1993, the KLA carried out an attack under the leadership of Hashim Thaçi and Adem Jashari. Concealed gunmen ambushed a police vehicle, resulting in the deaths of 5 officers and the wounding of 2.\nLješane incident\nOn 26 May 1992, Serbian Police were planning to arrest Tahir Berisha, an art teacher from the village of Lješane, Peć. When they confronted him, Tahir shot at the officers and killed one of them while injuring the other, however he was shot and killed.\nArrest in Autumn 1994\nDuring Autumn 1994, the Serbian Secret Service arrested Besim Rama, an Albanian from Prekaz i Epërm who was very close to Adem Jashari. During Rama's court trial, the Court of Pristina charged Albanian fighters Adem Jashari, Ilaz Kodra, Hashim Thaçi, Rexhep Selimi, Fadil Kodra, Zenun Kodra, Nuredin Lushtaku, Sami Lushtaku, Sahit Jashari, ldriz AsIlani, Ali Jonuzi and Jakup Nura in absentia.\nAttacks in 1995\nIn 1995, KLA attacks intensified. A Serbian policeman was allegedly murdered in 1995 by the KLA. In 1995 the KLA began to ambush and murder Serbian policemen and soldiers hoping to destabilize the region so that NATO and the United States would intervene. The KLA would only take responsibility for these attacks the following year.\nAftermath\nThe Insurgency in Kosovo started in 1995, after the Dayton Agreement that ended the Bosnian War. In 1996, the KLA began attacking Serbian governmental buildings and police stations. After the further escalation of tensions, this insurgency would lead to the more intense Kosovo War in February 1998.\nReferences\n*\n*\n*\n*\n*\n*\n*\n*"
    }
  ]
}