{
  "content": [
    {
      "type": "text",
      "text": "# Prime Minister of the Democratic Republic of the Congo__disambig_1\n\n| insignia = Coat of arms of the Democratic Republic of the Congo (black spear).svg\n| insigniasize = 125px\n| insigniacaption = Arms of the Democratic Republic of the Congo\n| nativename =\n| image = Prime Minister of DRC Judith Suminwa Tuluka (2025) (cropped).jpg\n| imagesize = 165px\n| incumbent = Judith Suminwa\n| acting = no\n| incumbentsince = 12 June 2024\n| style =\n| residence =\n| appointer = Félix Tshisekedi,\n| termlength =\n| formation = 24 June 1960\n| succession =\n| inaugural = Patrice Lumumba\n| deputy =\n| salary =\n| website = [https://www.primature.cd/public/ www.primature.cd]\n}}\nThe prime minister of the Democratic Republic of the Congo (, , ) is the head of government of the Democratic Republic of the Congo. The Constitution of the Third Republic grants the prime minister a significant amount of power.\nThe post is currently occupied by Judith Suminwa who succeeded Sama Lukonde on 12 June 2024. She is the first woman prime minister of the country.\nHistory\nThe position of prime minister was already present in the first post-independence government of the Democratic Republic of the Congo, with the first prime minister being Patrice Emery Lumumba. Over the years, the position's powers and attributions have varied widely, and there were long periods of time under Mobutu Sese Seko and in the aftermath of the First Congo War when the position ceased to exist. Mobutu abolished the position in 1966 but restored it in 1977 under the name \"First State Commissioner\" which, in reality, was weak in comparison to the pre-war office of prime minister, and was occupied by several individuals who were appointed at Mobutu's whim. The office became vacant with Mobutu's forced ouster in 1997.\nAside from the Lumumba Government, the Congo (DRC) has known several powerful figures in the position, such as Moise Tshombe, who had previously led a secession of his native Katanga province, and Étienne Tshisekedi, the long-time opponent of the Mobutu regime, who was brought to this position three times under popular pressure.\nThe position resurfaced as an institution in the constitution of the Third Republic, and Antoine Gizenga was appointed as the first prime minister of the Third Republic on 30 December 2006. Gizenga, one of the few active and living politicians to hail from the DRC's colonial past, was Lumumba's deputy prime minister in 1960, and served as prime minister of a rival national government in rebellion in February 1961.\nDescription\nUnder the constitution of the Third Republic, the prime minister shares the leadership of the executive branch of government with the president of the Democratic Republic of the Congo. The prime minister is appointed by the president, hailing from the party or political group that has the majority in the National Assembly.\nThe prime minister has a secondary role in the executive branch. When the prime minister is from the same party as the president, the head of the executive is constitutionally the president. However, when there is cohabitation (i.e., when the president is from one party while another party controls the National Assembly) the prime minister's importance is enhanced, because the president possesses little power to be exercised without the consent of the prime minister.\nRequirements\nThe constitution does not expressly outline any direct requirement for this position. The only requirement is the approval by the National Assembly of the government's composition and program, which then leads to the investiture of the government.\nSee also\n*Government of the Democratic Republic of the Congo\n**President of the Democratic Republic of the Congo\n**List of heads of state of the Democratic Republic of the Congo\nHistorical:\n*Colonial Heads of Congo\n**Rulers of Katanga\n**Rulers of Kuba\n**Rulers of Luba\n**Rulers of Ruund (Luunda)\n**Rulers of Kasongo Luunda (Yaka)\n**Rulers of Kongo\n*Zaire\nReferences"
    }
  ]
}