{
  "content": [
    {
      "type": "text",
      "text": "# Primate's Palace, Warsaw\n\n|location_town=Warsaw\n|location_country=Poland\n|architect=\n|client=\n|engineer=\n|construction_start_date=1593\n|completion_date=1610\n|date_demolished=1939\n|cost=\n|structural_system=\n|style=Classicist\n}}\nThe '''Primate's Palace''' () is a historical palace at the Senatorska Street in the Śródmieście district of Warsaw, Poland.\nHistory\nThe construction of the palace began in 1593, from the initiative of the Bishop of Płock Wojciech Baranowski. After he became the Primate of Poland, he transformed the palace into the headquarters of the primate. It was demolished during the years of the Swedish Deluge in 1655–1657. Architect Józef Fontana was hired for the reconstruction. It was however plundered again in 1704 by Saxons, Vlachs and Cossacks.\nUntil 1795 the rooms in the palace served as the home of the primates of Poland. The building was gradually expanded. At the end of the 17th century it was expanded by architect Tylman van Gameren. In the first half of the 18th century it was rebuilt in rococo style to serve as a residence of Primate Adam Ignacy Komorowski. From 1777 to 1786 the palace was thoroughly reconstructed in the Classicist style. The main body of the building was expanded with the side wings with pavilions. Architects of the interior were Jan Chrystian Kamsetzer and Szymon Bogumił Zug.\nSince the 18th century it served various purposes and housed numerous institutions. In the interwar period it housed the Ministry of Agriculture. The palace was destroyed during the Nazi Invasion of Poland, after the war it was gradually restored. It then served the city administration and, among other things, civil weddings occurred there. It used to house offices of various companies and its historical halls were used for conference and exhibition purposes.\nSince 2016 the palace has been refurbished and turned into a five-star hotel. It features 20 high-end rooms, a restaurant, a café and a casino.\nGallery\nImage:16042011 DSC0003.JPG|\nImage:Miod67DSC 1207.jpg|\nImage:Miod70DSC 1210.jpg|\nReferences"
    }
  ]
}