{
  "content": [
    {
      "type": "text",
      "text": "# Prince Edward Island automobile ban\n\nThe Canadian province of Prince Edward Island enacted a ban on motorized automobiles from 1908 to 1919, with some bans partially lifted after a plebiscite in 1913.\nThe Prince Edward Island government voted to ban automobiles from the Island in 1908, when there were only seven cars on the Island, due to residents' concerns over their safety, that they frightened horses and livestock, and due to the quality of Island roads. In the spring of 1913 the provincial legislature voted to relax the ban and allow automobiles on roads three days a week, but due to public outcry a plebiscite was held that summer at school district meetings to determine if the ban would be reinstated in each district. An estimated 90% of respondents supported the ban, but official results were suppressed.\nFollowing the plebiscite, the provincial government allowed individual districts to petition to have the ban lifted. This resulted in a situation where many roads were open to automobiles but others were not, requiring motorists to have their cars towed by horse or rail across banned districts. As public opinion of automobiles changed over the next several years, more districts rescinded the ban and more roads became available to motorists.\nThe ban was lifted province-wide in 1919, although resistance to automobiles remained common for several years afterwards.\nHistory\nThe first horseless carriage brought to Prince Edward Island, regarded as the first car purchased in British North America, was purchased in 1866 by Georges-Antoine Belcourt, then parish priest of North Rustico, and driven in the parish's Saint-Jean-Baptiste Day parade that year. The next was a steam-powered carriage purchased by a consortium of Charlottetown businessmen in 1900 and used for local tours. By 1908, a total of seven privately owned cars operated on the Island.\nResidents of the largely rural province were angered over the influx of automobiles to the Island. Cars at the time were seen as a luxury only available to wealthy individuals, while the province was experiencing an economic depression. Letters written to local newspapers complained that the loud vehicles frightened horses, the primary mode of transport at the time. Farmers were prevented from bringing their goods to market, and residents were afraid to shop on market days and to attend church on Sundays.\nBan enacted\nResponding to public outcry, Liberal Assemblyman David P. Irving supported a motion to ban cars from the Island, which was passed unanimously and became law on March 26, 1908. Automobiles were thereafter banned from driving on Island roads throughout the province.\nBan rescinded\nBy 1913, the Island economy had improved with the introduction of fur farming of silver foxes, and many Islanders were exposed to automobiles for the first time while travelling off-island. Fox breeder William Keir Rogers owned a number of international fox ranches and claimed he owned the first new car on the Island; he gained the nickname \"Good Roads Rogers\" for his efforts to have the ban rescinded and to see the roads improved.  A consortium of businessmen from Charlottetown and Summerside appealed to the provincial government to relax the ban, claiming loss of potential tourism revenue they estimated at $90,000. In April 1913 the Automobile Act was passed, permitting automobiles to use the province's roads on Monday, Wednesday, and Thursday, but banning them on Tuesday and Friday (market days), Saturday (shopping day), and Sunday (church day).\nPlebiscite and ban reinstated\nRural residents were again angered by the relaxing of restrictions and protested the decision. Prominent farmers complained that the ban was relaxed after consulting with businessmen but without consulting any farmers on the Island. In response, a plebiscite was held across the Island in June 1913, in which each school district voted whether to relax the restrictions as proposed by the government, or to reinstate the full ban. Contemporary reports estimate that over 90% of respondents supported reinstating the ban, although the provincial government suppressed the official results.\nThe mixed results of the plebiscite led to a situation where automobiles were allowed to operate in some communities but were banned from others. Automobile owners could drive through one community but then have to hire a team of horses to tow their car through the next district. A well known fox magnate, Frank Tuplin, owned a car in Summerside, a banned community. He would load the car onto the railway to bring it to Charlottetown to drive around for the day, before bringing it back to his home again by rail.\nBan rescinded again\nBy 1916, several factors led to changing opinions on automobiles on the Island. The economy continued to improve, and mass production drove down the cost of automobiles to within reach of average Islanders. Mobilization during World War I strengthened the case for automobile use, and more frequent exposure to automobiles lessened fears of injury to horses. The provincial government allowed the ban to be relaxed in individual districts, if 75% of the district's residents petitioned in support of lifting the ban.\nAs more and more districts reversed the ban in this way, more roads became available to Island motorists. In 1917, the Conservative government of John Alexander Mathieson proposed a bill to rescind the automobile ban throughout the province. The vote on the bill was a tie, 14 in favour and 14 opposed, including several of Mathieson's Conservatives voting against his proposal. The tie was broken by Speaker John S. Martin in favour of rescinding the ban. The ban was formally lifted in 1919.\nDuring the final years of the ban and for a few years afterwards, newspapers reported incidents of farmers blockading roads to prevent passage of automobiles.\nReferences\nFurther reading\n*"
    }
  ]
}