{
  "content": [
    {
      "type": "text",
      "text": "# Printer tracking dots\n\nPrinter tracking dots, also known as printer steganography, DocuColor tracking dots, yellow dots, secret dots, or a machine identification code (MIC), is a digital watermark which many color laser printers and photocopiers produce on every printed page that identifies the specific device that was used to print the document. Developed by Xerox and Canon in the mid-1980s, the existence of these tracking codes became public only in 2004.\nHistory\nIn the mid-1980s, Xerox pioneered an encoding mechanism for a unique number represented by tiny dots spread over the entire print area, and first deployed this scheme in its DocuColor line of printers. Xerox developed this surreptitious tracking code \"to assuage fears that their color copiers could be used to counterfeit bills\" and received U.S. Patent No. 5515451 describing the use of the yellow dots to identify the source of a copied or printed document. The scheme was then widely deployed in other printers, including those made by other manufacturers.\nThe public first became aware of the tracking scheme in October 2004, when Dutch authorities used it to track counterfeiters who had used a Canon color laser printer. In November 2004, PC World reported the machine identification code had been used for decades in some printers, allowing law enforcement to identify and track counterfeiters. The Central Bank Counterfeit Deterrence Group (CBCDG) has denied that it developed the feature.\nIn 2005, the civil liberties activist group Electronic Frontier Foundation (EFF) encouraged the public to send in sample printouts and subsequently decoded the pattern. The pattern has been demonstrated on a wide range of printers from different manufacturers and models. The EFF stated in 2015 that the documents that they previously received through a Freedom of Information Act request suggested that all major manufacturers of color laser printers entered a secret agreement with governments to ensure that the output of those printers is forensically traceable.\nIn 2007, the European Parliament was asked about the question of invasion of privacy.\nTechnical aspects\nThe pattern consists of a dot-matrix spread of yellow dots, which can barely be seen with the naked eye. The dots have a diameter of  and a spacing of about . Their arrangement encodes the serial number of the device, date and time of the printing, and is repeated several times across the printing area in case of errors. For example, if the code consists of 8&nbsp;×&nbsp;16 dots in a square or hexagonal pattern, it spreads over a surface of about  and appears on a sheet of size A4 paper about 150 times. Thus, it can be analyzed even if only fragments or excerpts are available. Some printers arrange yellow dots in seemingly random point clouds.\nAccording to the Chaos Computer Club in 2005, color printers leave the code in a matrix of 32&nbsp;×&nbsp;16 dots and thus can store 64 bytes of data (64×8).\n, Xerox was one of the few manufacturers to draw attention to the marked pages, stating in a product description, \"The digital color printing system is equipped with an anti-counterfeit identification and banknote recognition system according to the requirements of numerous governments. Each copy shall be marked with a label which, if necessary, allows identification of the printing system with which it was created. This code is not visible under normal conditions.\"\nIn 2018, scientists at the TU Dresden analyzed the patterns of 106 printer models from 18 manufacturers and found four different encoding schemes.\nVisibility\nThe dots can be made visible by printing or copying a page and subsequently scanning a small section with a high-resolution scanner. The yellow color channel can then be enhanced with an image processing program to make the dots of the identification code clearly visible. Under good lighting conditions, a magnifying glass may be enough to see the pattern. Under UV-light, the yellow dots are clearly recognizable.\nUsing this steganographic process, high-quality copies of an original (e.g. a banknote) under blue light can be made identifiable. Using this process, even shredded prints can be identified: the 2011 \"Shredder Challenge\" initiated by the DARPA was solved by a team called \"All Your Shreds Are Belong To U.S.\" consisting of Otávio Good and two colleagues.\nPractical application\nBoth journalists and security experts have suggested that The Intercept handling of the leaks by whistleblower Reality Winner, which included publishing secret NSA documents unredacted and including the printer tracking dots, was used to identify Winner as the leaker, leading to her arrest in 2017 and conviction.\nProtection of privacy and circumvention\nCopies or printouts of documents with confidential personal information, for example health care information, account statements, tax declaration or balance sheets, can be traced to the owner of the printer and the inception date of the documents can be revealed. This traceability is unknown to many users and inaccessible, as manufacturers do not publicize the code that produces these patterns. It is unclear which data may be unintentionally passed on with a copy or printout. In particular, there are no mentions of the technique in the support materials of most affected printers. In 2005, the Electronic Frontier Foundation (EFF) sought a decoding method and made available a Python script for analysis.\nIn 2018, scientists from TU Dresden developed and published a tool to extract and analyze the steganographic codes of a given color printer and subsequently to anonymize prints from that printer. The anonymization works by printing additional yellow dots on top of the printer's tracking dots. The scientists made the software available to support whistleblowers in their efforts to publicize grievances.\nComparable processes\nOther methods of identification are not as easily recognizable as yellow dots. For example, a modulation of laser intensity and a variation of shades of grey in texts are feasible. , it was unknown whether manufacturers were also using these techniques.\nSee also\n*EURion constellation, a dot matrix spread over a bank note, which stops some printers and color copiers from processing\n*\n*\nReferences\nExternal links\n*[https://bigbrotherawards.de/2004/technik-canon Laudatio der deutschen BigBrotherAwards 2004]\n*[http://dasalte.ccc.de/colorcopy/ Information by the Chaos Computer Club]\n*[https://www.eff.org/Privacy/printers/ Information by the Electronic Frontier Foundation]\n*[https://www.eff.org/pages/list-printers-which-do-or-do-not-display-tracking-dots EFF List of Printers Which Do or Do Not Display Tracking Dots] (last updated 2017)"
    }
  ]
}