{
  "content": [
    {
      "type": "text",
      "text": "# Prince Edward, Duke of Edinburgh\n\n| birth_place  = Buckingham Palace, London, England\n| spouse       =\n| issue        =\n| full name    = Edward Antony Richard Louis The middle name Louis is pronounced .|group= fn |name= sur}}\n| house        = Windsor\n| father       = Prince Philip, Duke of Edinburgh\n| mother       = Elizabeth II\n| module       =\n}}\nPrince Edward, Duke of Edinburgh (Edward Antony Richard Louis; born 10 March 1964), is a member of the British royal family. He is the youngest child of Queen Elizabeth II and Prince Philip, Duke of Edinburgh, and the youngest sibling of King Charles III. Edward was born third in the line of succession to the British throne and is 15th as of 2025.\nBorn at Buckingham Palace during the reign of his mother, Edward studied at Heatherdown School and completed his A-Levels at Gordonstoun before spending part of his gap year teaching at Whanganui Collegiate School in New Zealand. He then went up to read history at Jesus College, Cambridge, graduating in 1986 with a Bachelor of Arts degree from the University of Cambridge. After a brief stint in the Royal Marines, he worked as a theatre production assistant at the Really Useful Theatre Company before assisting in television production. He later formed his own company, Ardent Productions.\nEdward stepped down from the company in 2002 to begin full-time duties as a working member of the royal family and undertook engagements on behalf of his mother. He holds patronage with over 70 charities and organisations, including the National Youth Theatre, the Sport and Recreation Alliance, and the British Paralympic Association. His charity work focuses on the arts, athletics, and the development of the Duke of Edinburgh's Award, which centres on fitness, wellbeing and community service.\nEdward was given the title of Earl of Wessex prior to marrying Sophie Rhys-Jones in 1999. They have two children: Lady Louise Mountbatten-Windsor and James Mountbatten-Windsor, Earl of Wessex. Edward's mother conferred him the additional title of Earl of Forfar in 2019. On Edward's 59th birthday in 2023, his brother Charles III granted him the title Duke of Edinburgh as a life peerage, a dukedom previously held by their father, who died in 2021, then briefly by Charles.\nEarly life and education\nand Prince Edward with their parents, Queen Elizabeth II and Prince Philip, Duke of Edinburgh, at the opening of the 1978 Commonwealth Games in Edmonton, Canada]]\nEdward was born at 8:20pm on 10 March 1964 at Buckingham Palace, London, as the third son and the fourth and youngest child of Queen Elizabeth II and Prince Philip, Duke of Edinburgh. He is the most recent child to be born to a reigning British monarch. His birth was the only one witnessed by his father. He was baptised on 2 May 1964 in the private chapel at Windsor Castle.\nAs with his three elder siblings, Charles, Anne, and Andrew, a governess was appointed to look after Edward and was responsible for his early education at Buckingham Palace before he attended Collingham College, Kensington (then known as Gibbs School). In September 1972, he joined Heatherdown School, near Ascot in Berkshire. Later, as his father and elder brothers had done before him, he moved to Gordonstoun in northern Scotland, where he was appointed head boy in his last term. Edward obtained a C-grade in English and two D-grades in history and politics at A-level, and after leaving school spent a gap year abroad, working as a house tutor and junior master for two terms at the Wanganui Collegiate School in New Zealand.\nUpon his return to the United Kingdom, Edward studied at Jesus College, Cambridge, where he read history. His admission to the university despite poor A-Level results caused some comment. Edward graduated in 1986 with a Bachelor of Arts degree (Lower Second Hons).\nPost-university\nRoyal Marines\nAfter graduating in 1986, Edward joined the Royal Marines, who had reportedly sponsored his tuition at Cambridge on condition of future service. He had signed up to join the Royal Marines in September 1983. In January 1987, he dropped out of the commando course having completed one-third of the 12-month training. Media reported that Prince Philip, who was the Captain General Royal Marines, was displeased, but Prince Edward later said that his father had not put undue pressure on him to change his mind. Others stated that Philip was the most sympathetic family member toward his son's decision. Buckingham Palace said that Edward's decision came after \"much consideration\" and that he was leaving with great regret \"but has concluded that he does not wish to make the service his long-term career\".\nTheatre and television\nAfter leaving military service, Edward opted to pursue a career in entertainment. He commissioned the 1986 musical Cricket from Andrew Lloyd Webber and Tim Rice, for his mother's 60th birthday celebration, which led to a job offer at Lloyd Webber's Really Useful Theatre Company, where he worked as a production assistant on musicals such as The Phantom of the Opera, Starlight Express, and Cats. While there he met actress Ruthie Henshall, whom he dated for three years.\nEdward's first foray into television production was the programme The Grand Knockout Tournament, informally known as ''It's a Royal Knockout'', on 15 June 1987, in which four teams sponsored by him, his siblings Anne and Andrew, and Andrew's wife Sarah competed for charity. The programme was criticised by the media and the public, and it was later reported that the Queen was not in favour of the event, with her courtiers having advised against it. The programme raised over £1,500,000 for its selected charities.\nArdent Productions\nIn 1993, Edward founded the television production company Ardent Productions. Ardent was involved in production of a number of documentaries and dramas. But Edward has been accused in the media of using his royal connections for financial gain. Industry insiders  have referred to Ardent as \"a sad joke\" with a perceived lack of professionalism in its operations. Andy Beckett, writing in The Guardian, opined that \"to watch Ardent's few dozen hours of broadcast output is to enter a strange kingdom where every man in Britain still wears a tie, where pieces to camera are done in cricket jumpers, where people clasp their hands behind their backs like guardsmen. Commercial breaks are filled with army recruiting advertisements\".\nArdent's productions were better received in the United States and a documentary Edward made about his great-uncle Edward VIII (the late Duke of Windsor) in 1996 sold well worldwide. Nonetheless, the company reported losses every year it operated, with the exception of one when Edward did not draw a salary. An Ardent two-man film crew later allegedly invaded the privacy of Edward's nephew, Prince William, in September 2001, when he was studying at the University of St Andrews, which went against industry guidelines regarding the privacy of members of the royal family; William's father (Edward's elder brother Charles) was reportedly angered by the incident. In March 2002, Edward announced that he would step down as production director and joint managing director of Ardent to concentrate on his public duties and to support the Queen during her Golden Jubilee year. Ardent Productions was voluntarily dissolved in June 2009, with assets reduced to just £40.\nMarriage and children\nfor the wedding of Princess Madeleine and Christopher O'Neill, 2013]]\nEdward met Sophie Rhys-Jones for the first time in 1987 when he was dating her friend. They met again at a promotion shoot for the Prince Edward Summer Challenge to raise money for charity in 1993, and the two began their relationship soon afterwards. In December 1993 and amid growing speculation about whether they were planning to marry, Edward wrote a letter to newspaper editors, in which he denied any wedding plans and asked the media to respect their privacy. Edward proposed to Sophie on holiday in the Bahamas in December 1998 and their engagement was announced on 6 January 1999. Edward proposed to Sophie with an Asprey and Garrard engagement ring worth an estimated £105,000: a two-carat oval diamond flanked by two heart-shaped gemstones set in 18-carat white gold.\nTheir wedding took place on 19 June 1999 in St George's Chapel at Windsor Castle. This was a departure from the weddings of his elder brothers, which were large, formal events at Westminster Abbey or St Paul's Cathedral, and had ended in divorce. On his wedding day, Prince Edward was created Earl of Wessex, with the subsidiary title of Viscount Severn (alluding to the Welsh roots of the Countess's family), breaking from a tradition whereby sons of the sovereign were created royal dukes.\nSophie had an ectopic pregnancy in 2001. Edward and Sophie have two children: Lady Louise Mountbatten-Windsor, born prematurely on 8 November 2003 due to a sudden placental abruption; and James Mountbatten-Windsor (then Viscount Severn, now Earl of Wessex), born on 17 December 2007. Edward's children since 2023 are styled as the children of a duke, rather than as Prince/ss and Royal Highness. The family's country seat is Bagshot Park; their office and official London residence is at Buckingham Palace.\nActivities\nof the Commonwealth Games in 2010.]]\nThe Earl and Countess of Wessex established their foundation, the Bagshot Park Charity, later renamed the Wessex Youth Trust, in 1999, with a focus on helping, supporting and advancing registered charities which provide opportunities specifically for children and young people. Twenty years after its inception, the Wessex Youth Trust changed its name to the Earl and Countess of Wessex Charitable Trust, managed by the private office of the Earl and Countess of Wessex and Forfar. It was announced that the trust's broad charitable objectives would not change, however, their future efforts would be aimed towards supporting a different range of charities. In July 2023, the trust's remaining funds were transferred to the Edinburgh Trust No. 2, which was originally set up in 1964.\nEdward's patronages include the British Paralympic Association, the International Real Tennis Professionals Association, the Commonwealth Games Federation, BadmintonScotland, the Tennis and Rackets Association, City of Birmingham Symphony Orchestra and Chorus, London Mozart Players, Haddo House Choral and Operatic Society, Northern Ballet, the Edinburgh International Festival, the Royal Birmingham Conservatoire, the Production Guild, and National Youth Theatre.\nThe Earl of Wessex assumed many duties from his father, Prince Philip, Duke of Edinburgh, as Prince Philip reduced his commitments before retiring from royal duties. Prince Edward opened the 1990 Commonwealth Games in New Zealand and the 1998 Commonwealth Games in Malaysia and became vice-patron of Commonwealth Games Federation in 2006, picking up his father's ceremonial duties who had served as president. He has also taken over his father's role in the Duke of Edinburgh's Award (DofE) scheme, attending Gold Award ceremonies around the world.\nIn September 2007, the Earl visited Israel in his capacity as Chairman of the International Council of the Duke of Edinburgh's Award to attend a number of events organised by the Israel Youth Award program, an affiliate of the Duke of Edinburgh's Award. Edward was himself a recipient of the Award's gold medal in 1986 for \"a 60-mile, four-day trek from Blair Atholl to Tomintoul\" that he had planned. He has been a trustee of the DofE since 1988 and of the International Award since 2006. Edward later went on to become chair of trustees of the Duke of Edinburgh's International Award in 2015, and was named patron of the Duke of Edinburgh's Award in 2023. He has promoted the charity's work on different occasions. Edward is also a trustee of the International Award Association, which \"encompasses the DofE UK and all its other 61 National Award Authorities across the globe\". He was also Chairman of the DofE's international council and in 1999 founded the International Special Projects Group \"to provide a capital fund to broaden the reach of the Award\". In 2018, Edward, as patron of the Tennis and Rackets Association, played on all 50 real tennis courts around the world and raised over £2 million for the Duke of Edinburgh's Award scheme.\n, Gloucestershire, in 2011]]\nIn June 2011, Edward visited Baltimore to meet the students and staff of the Living Classrooms Foundation and encourage them to participate in the Duke of Edinburgh's Award's programme. In December 2011, the Earl and Countess of Wessex visited troops in Afghanistan. On the same trip, the royal couple visited Bahrain, and received two gifts of jewels from the Bahraini royal family and Prime Minister. Given concern about human rights abuses in Bahrain, this gift attracted controversy, with calls for the jewels to be sold, and the proceeds used for the benefit of the Bahraini people. In February and March 2012, the couple visited the Caribbean for the Queen's Diamond Jubilee. The itinerary consisted of Saint Lucia; Barbados, Saint Vincent and the Grenadines; Grenada; Trinidad and Tobago; Montserrat; Saint Kitts and Nevis; Anguilla; Antigua and Barbuda. Highlights included Independence Day celebrations in Saint Lucia, addressing Senate and Assembly of Barbados jointly, and a visit to sites affected by the volcanic eruptions in Montserrat.\nIn 2013, the couple visited South Africa. The Queen appointed the Earl of Wessex as Lord High Commissioner to the General Assembly of the Church of Scotland for 2014. In 2015, for his contributions to projects associated with badminton, Edward was awarded the President's Medal by the Badminton World Federation President Poul-Erik Høyer. In May 2016, the Earl visited Ghana. Alongside President Mahama, he presented young people with the Head of State Awards for their participation in the Duke of Edinburgh's International Award Scheme. In September 2016, Edward travelled to Chile as a part of the Duke of Edinburgh's Award's diamond anniversary, and visited projects by British and Commonwealth Fire and Rescue Company and Chilean-British Culture University, of which he is an honorary member and patron respectively. The Earl and Countess of Wessex represented the Queen at the 50th Anniversary Celebrations of Sultan Hassanal Bolkiah's Accession to the Throne of Brunei in October 2017. In February 2018, the Earl and Countess toured Sri Lanka, participating in the 70th Independence Day celebrations in Colombo. In April 2018, the Earl visited Australia to attend the XXI Commonwealth Games and attend fundraising events for those participating in the Duke of Edinburgh Award challenges.\n]]\nIn July 2019, the Earl and Countess visited Forfar on their first official visit to the royal burgh since the Queen granted Prince Edward the additional title Earl of Forfar in March 2019. The Earl was presented with 'Earl of Forfar' tartan, which was designed by Forfar's Strathmore Woollen Company to celebrate their new titles. In 2020, he took over the patronage of London Youth from his father who had held the position for 73 years.\nIn February 2022, Edward was appointed president of the Royal Windsor Horse Show, a position previously held by his father Prince Philip, Duke of Edinburgh. In the following month, he visited Kenya to oversee the progress of the Duke of Edinburgh's International Award in the country. In April 2022, the Earl and Countess of Wessex and Forfar toured Saint Lucia, Saint Vincent and the Grenadines, and Antigua and Barbuda to mark the Queen's Platinum Jubilee. Their planned visit to Grenada was postponed after talks with the island's government and governor-general, and the couple expressed their hopes to visit the country on a later date. In 2022 and in recognition of his role as patron of the Production Guild, the Earl of Wessex Award was created as part of the Guild's inaugural Talent Showcase to recognise UK film and TV organisations who have created \"a successful way of inspiring local talent or skills, widening access or being more inclusive.\" After he was created Duke of Edinburgh on his 59th birthday, Edward and Sophie visited Edinburgh to meet with members of the Ukrainian and Eastern European communities in the city, some of whom were displaced following the Russian invasion of Ukraine. Edward became patron of the Duke of Edinburgh's Award upon being raised to the dukedom. In 2024, he served as Lord High Commissioner to the General Assembly of the Church of Scotland, succeeded in the role the following year by Lady Elish Angiolini.\nIn the media\nIn 1999, Edward was criticised by Labour MPs John Cryer and Lindsay Hoyle for comments he made during an interview with The New York Times, in which he stated that in Britain \"They [the British media] hate anyone who succeeds\" and \"America is where the money is\". The criticism prompted him to issue a statement, clarifying \"that offending the British public was the very last thing I would have wanted to do\".\nIn 2011, close associates of Jonathan Rees, a private investigator connected to the News International phone hacking scandal, stated that he had penetrated Edward and Sophie's bank accounts and sold details about them to the Sunday Mirror.\nTitles, styles, honours and arms\nof Prince Edward]]\nTitles and styles\nUntil his marriage, Edward was known as \"His Royal Highness The Prince Edward\". On 19 June 1999, he became \"His Royal Highness The Earl of Wessex\". Buckingham Palace announced the intention that Edward would eventually be created Duke of Edinburgh, a title then held by his father, Prince Philip, once it had merged in the Crown upon the death of both his parents. On 10 March 2019, his 55th birthday, Edward was granted the additional title of Earl of Forfar for use in Scotland. On his 59th birthday, 10 March 2023, Edward was created Duke of Edinburgh, thus becoming \"His Royal Highness The Duke of Edinburgh\". His ducal title is not hereditary, so it will revert to the crown on his death.\nIn 1994, the Independent Royalist Party of Estonia, aspiring to make Estonia a monarchy, sent a letter to Queen Elizabeth II requesting permission to crown Prince Edward as King of Estonia. The letter had called Edward a \"young British prince much admired by Estonians\", adding the party \"would be most honoured if you would accept this rare request\". Buckingham Palace declined the offer, saying that it was \"a charming idea but a rather unlikely one\".\nHonours\nEdward is a Royal Knight Companion of the Most Noble Order of the Garter, an Extra Knight of the Most Ancient and Most Noble Order of the Thistle, a Knight Grand Cross of the Royal Victorian Order, and a Personal Aide-de-Camp to the Sovereign. In 2013 Edward received an Honorary Doctorate from the University of Bath.\nArms\n|badge          =\n|symbolism      = As with the Royal Arms of the United Kingdom, the first and fourth quarterings are the arms of England, the second of Scotland and the third of Ireland.|other_versions= Scottish version of the Duke's arms as a Knight of the Order of the Thistle.}}\nAncestry\n|boxstyle_1=background-color: #fcc;\n|boxstyle_2=background-color: #fb9;\n|boxstyle_3=background-color: #ffc;\n|boxstyle_4=background-color: #bfc;\n|1= 1. Prince Edward, Duke of Edinburgh\n|2= 2. Prince Philip, Duke of Edinburgh\n|3= 3. Elizabeth II of the United Kingdom\n|4= 4. Prince Andrew of Greece and Denmark\n|5= 5. Princess Alice of Battenberg\n|6= 6. George VI of the United Kingdom\n|7= 7. Lady Elizabeth Bowes-Lyon\n|8= 8. George I of Greece\n|9= 9. Grand Duchess Olga Constantinovna of Russia\n|10= 10. Prince Louis of Battenberg\n|11= 11. Princess Victoria of Hesse and by Rhine\n|12= 12. George V of the United Kingdom\n|13= 13. Princess Victoria Mary of Teck\n|14= 14. Claude Bowes-Lyon, 14th Earl of Strathmore and Kinghorne\n|15= 15. Cecilia Cavendish-Bentinck\n}}\nFilmography\n{| class=wikitable\n|+ Television\n! Year !! Title !! Role\n|-\n| rowspan=\"3\" | 1996 || Edward on Edward || host, associate producer\n|-\n| Castle Ghosts of Scotland || rowspan=\"2\" | executive producer\n|-\n| Castle Ghosts of Ireland\n|-\n| 1997 || Network First || producer (1 episode)\n|-\n| 1998 || Crown and Country || host, executive producer\n|-\n| 1999 || Stars Over Mississippi || rowspan=\"2\" | executive producer\n|-\n| rowspan=\"2\" | 2000 || When Cameras Cross the Line\n|-\n| Once Upon a Christmas || producer\n|-\n| rowspan=\"3\" | 2001 || Tales from the Tower || rowspan=\"4\" | executive producer\n|-\n| ''Varian's War\n|-\n| Twice Upon a Christmas\n|-\n| 2003 || Out of the Ashes\n|-\n| 2015 || Whatever Happened to the Windsors?'' || narrator\n|}\nNotes\nReferences\nExternal links\n* [https://www.royal.uk/duke-edinburgh The Duke of Edinburgh]  at the official website of the British royal family\n* [https://www.canada.ca/en/canadian-heritage/services/royal-family/members-royal-family/duke-edinburgh.html The Duke of Edinburgh] at the website of the Government of Canada\n*\n*"
    }
  ]
}