{
  "content": [
    {
      "type": "text",
      "text": "# Prince Edward Road\n\n| image                   = Image:Prince Edward Road East 201411.jpg\n| caption                 = Prince Edward Road East in San Po Kong\n| former_names            = Edward Avenue, Kashima-dori (During Japanese Occupation, 1942-1945)\n| namesake                = Edward VIII\n| location                = Prince Edward, Hong Kong\n| coordinates             =\n| mapframe-wikidata = yes\n}}\nPrince Edward Road East (Chinese: 太子道東) and Prince Edward Road West (Chinese: 太子道西) are roads in Kowloon, Hong Kong, going in an east-west direction and linking Tai Kok Tsui, Mong Kok, Kowloon Tong, Kowloon City and San Po Kong (outside the retired Kai Tak Airport).\nThe roads were named after Prince Edward in 1922, later Edward VIII, after his visit to Hong Kong.\nPrince Edward station and the Prince Edward area in Hong Kong are both named after Prince Edward Road, rather than Prince Edward himself.\nPrince Edward Road\nIn the beginning of the 1920s, the Hong Kong government was developing the Mong Kok district and decided to build a road connecting this to Kowloon City. In April 1922, Prince Edward (later Edward VIII) came to Hong Kong and visited the construction of this road. Due to this visit, the government named this road Prince Edward Road. In the 1930s, Prince Edward Road was extended to the area of Ngau Chi Wan. During Japanese occupation, the road was renamed as Kashima-dori ().\nPrince Edward Road West and Prince Edward Road East\nPrince Edward Road West\nPrince Edward Road West is a road between Tai Kok Tsui, Mong Kok, Kowloon Tong and Kowloon City. This road was originally named Edward Avenue () before 1924. It was later renamed Prince Edward Road () in 1924, and in 1958 the Chinese name was changed from what was literally \"British Royal Prince Road\" to a new name () that is literally \"Crown Prince Road\" . In 1979, it became the Prince Edward Road West.\nPrince Edward Road West starts from Kowloon City where it succeeds Prince Edward Road East. It runs across Kowloon City and Prince Edward, and ends at Tai Kok Tsui at an intersection with Tong Mi Road and West Kowloon Corridor.\nThe section of Prince Edward Road West from Olympic Garden to Nathan Road runs unidirectionally from east to west. Boundary Street serves as its complement by providing a nearby route which runs from west to east.\nPrince Edward Road East\nPrince Edward Road East is a road between Kowloon City and San Po Kong. It was originally the Sai Kung Road and later part of the Clear Water Bay Road. It later became part of the Prince Edward Road. In 1979, it became the Prince Edward Road East.\nThe modern Prince Edward Road East starts from Choi Hung Interchange, where it meets Clear Water Bay Road to the northeast and Kwun Tong Road to the southeast. Then it goes west along the boundary between San Po Kong and the retired Kai Tak Airport, and finally ends at Olympic Garden in Kowloon City, where it branches into three roads, Ma Tau Chung Road, Argyle Street and Prince Edward Road West.\nPrince Edward Road East was once misspelled as \"Princess Edward Road East\" by MTR Corporation in the map describing Sha Tin to Central Link (from Diamond Hill station to Kai Tak).\nNotable places along the road\n* Diocesan Boys' School\n* Mong Kok Stadium\n* Kowloon Hospital\n* St. Teresa's Church (#258)\n* St. Teresa's Hospital (#327)\n* Olympic Garden\n* Former Kai Tak Airport\n* Prince Edward station\n* Mikiki\n* Kowloon Walled City, demolished in the 1990s\nEvents\nOn 9 May 2005, a dozen stacks of shelving on a construction site next to the road fell off due to adverse weather conditions. The relevant section of the road was closed, leading to a severe disruption of traffic among East Kowloon, and affecting more than 100,000 people.\nSee also\n* Prince Edward, Hong Kong\n* List of streets and roads in Hong Kong\nReferences\nExternal links"
    }
  ]
}