{
  "content": [
    {
      "type": "text",
      "text": "# Princess Sophia of the United Kingdom\n\n| alt          = Sophia aged about 48\n| house        = Hanover\n| father       = George III\n| mother       = Charlotte of Mecklenburg-Strelitz\n| signature    = Princess Sophia's signature.svg\n| birth_date   =\n| birth_place  = Buckingham House, London, Kingdom of Great Britain\n| death_date   =\n| death_place  = Kensington Palace, London, United Kingdom of Great Britain and Ireland\n| burial_date  = 6 June 1848\n| burial_place = Kensal Green Cemetery, London\n}}\nPrincess Sophia (3 November 1777 – 27 May 1848) was the twelfth child and fifth daughter of King George III and Queen Charlotte. Sophia is perhaps best known for the rumours surrounding a supposed illegitimate child to whom she gave birth as a young woman.\nIn her youth, Sophia was closest to her father, who preferred his daughters over his sons; however, she and her sisters lived in fear of their mother. The princesses were well-educated but raised in a rigidly strict household. Though he disliked the idea of matrimony for his daughters, King George had intended to find them suitable husbands when they came of age. However, the King's recurring bouts of madness, as well as the Queen's desire to have her daughters live their lives as her companions, stopped would-be suitors from offering for most of the princesses. As a result, Sophia and all but one of her sisters grew up in their mother's cloistered household, which they frequently referred to as a \"Nunnery\".\nThough she never wed, rumours spread that Sophia became pregnant by Thomas Garth, an equerry of her father's, and gave birth to an illegitimate son in the summer of 1800. Other gossip declared the child was the product of rape by her elder brother the Duke of Cumberland, who was deeply unpopular. Historians are divided on the validity of these stories, as some believe she gave birth to Garth's child while others call them tales spread by the royal family's political enemies.\nThe efforts of the Prince Regent to gain his sisters increased independence were further hastened along with Queen Charlotte's death in 1818. In her last years, Sophia resided in the household of her niece Princess Victoria of Kent (the future Queen Victoria), at Kensington Palace. There, she fell under the sway of Victoria's comptroller, Sir John Conroy, who took advantage of her senility and blindness; rumours also circulated that Sophia was in awe of Conroy because of his ability to deal effectively with the \"bullying importunities\" of Sophia's supposed illegitimate son. Sophia frequently served as his spy on the Kensington household as well as on her two elder brothers, while Conroy squandered most of her money. The princess died on 27 May 1848 at her residence in Vicarage Place, Kensington Palace.\nEarly life\nSophia was born at Buckingham House, London on 3 November 1777, the twelfth child and fifth daughter of King George III and Queen Charlotte. The young princess was christened on 1 December 1777 in the Great Council Chamber at St James's Palace by Frederick Cornwallis, Archbishop of Canterbury. Her godparents were Prince August of Saxe-Gotha-Altenburg (her first cousin once-removed), the Duchess of Brunswick-Wolfenbüttel (her first cousin twice-removed) and the Duchess of Mecklenburg (wife of her first cousin once-removed), all of whom were represented by proxies.\nand Amelia, c. 1785]]\nUpon Sophia's birth, King George ensured his daughters and younger sons would have allowances; through a provision of Parliament, Sophia and her elder sisters were each to receive an annual income of £6,000 either upon their marriages or the king's death. The royal household was very rigid and formal, even when only the royal family were together in private. For instance, when the King entered a room, his daughters were expected to stand up, remain silent until addressed, and not leave until given permission. Queen Charlotte made attempts to be economical where possible; the younger princesses wore country-made dresses, which were less expensive, and ate plain food.\nSophia's early life was focused on education. Lady Charlotte Finch served as her governess, a role she performed for all the royal children. As with the strict education and discipline received by her brothers, Lady Charlotte through the sub-governesses chosen by Queen Charlotte arranged expert tutors to give the princesses lessons in English, French, music, art, and geography; Sophia and her sisters were also allowed to play sports and boisterous games with their brothers. The queen sought to combine her daughters' entertainments with educational benefits. Sophia and her siblings were brought up with an exposure to theatre and were entertained with special performances. Sophia's first appearance in public occurred when she accompanied her parents and elder siblings to a commemoration for George Frideric Handel, held at Westminster Abbey on 26 May 1784.\nUncommon for men of the period, Sophia's father was involved in her early upbringing and preferred his daughters to his sons. When possible he attended the princesses' birthday parties and other special events, and was kept informed on their progress in the schoolroom. A family friend once remarked, \"I never saw more lovely children, nor a more pleasing sight than the King's fondness for them.\" On the other hand, Queen Charlotte invoked fear in her daughters and, according to royal historian A. W. Purdue, she was not \"benignly maternal\".\nAdulthood\n, painted by Richard Cosway, is believed to have been commissioned by Sophia's brother the Prince of Wales.|left]]\nBy 1792 Sophia and her sister Mary were being included in more family activities, and at age fourteen, Sophia debuted at court on her father's birthday, 4 June 1792. According to biographer Christopher Hibbert, in her young adulthood Sophia was a \"delightful though moody girl, pretty, delicate and passionate.\" As within her childhood, Sophia was devoted to her father, though she occasionally found him exasperating. She wrote that \"the dear King is all kindness to me, and I cannot say how grateful I feel for it.\"  Prior to 1788, King George had told his daughters that he would take them to Hanover and find them suitable husbands despite misgivings he had, which stemmed from his sisters' own unhappy marriages. He remarked, \"I cannot deny that I have never wished to see any of them marry: I am happy in their company, and do not in the least want a separation.\" However, the King had his first bout of madness that year, when Sophia was aged eleven. Sophia remarked of her father's behaviour, \"He is all affection and kindness to me, but sometimes an over kindness, if you can understand that, which greatly alarms me.\" Further lapses into insanity occurred in 1801 and 1804, thus forestalling talk of marriage for his daughters. The question of matrimony was rarely raised; Queen Charlotte feared the subject as something which had always discomforted the King and would push him back into insanity. Furthermore, the queen, strained from her husband's illness, wanted the princesses to remain close to her.\nAs a result, like most of her sisters, Sophia was forced to live her life as a companion of her mother. The princesses were not allowed to mix with anyone outside of the Royal Court, and rarely came into contact with men other than pages, equerries, or attendants. Constantly chaperoned, the girls frequently complained about living in a \"Nunnery\". For entertainment, the queen read sermons to them and the princesses practised embroidery. On one occasion Sophia wrote their days were so \"deadly dull... I wished myself a kangaroo.\"\nThe Princess Royal was the only daughter who was able to marry while relatively young. The rest of the princesses were not without suitors, but most of the various men's efforts were stopped by Queen Charlotte. Most of the girls longed for families and children of their own, and often asked the Prince of Wales, to whom they remained close, for help, either in finding spouses, allowing them to marry their loves, or allowing them to live outside of Queen Charlotte's household. A grateful Sophia once jokingly wrote to her brother, saying \"I wonder you do not vote for putting us in a sack and drowning us in the Thames.\" Before George became regent, he had little power to oblige his sisters. His ascension to the regency in 1811 led to Sophia and the other remaining unmarried princesses to receive increases in their allowances, from £10,000 to £13,000. He also supported their desire to venture out into society. Queen Charlotte was outraged at these attempts, and the Prince-Regent had to reconcile the two parties carefully so that his sisters could still enjoy some independence.\nIllegitimate child\nto paint this in 1797, three years before Sophia supposedly gave birth to a child.]]\nDuring Sophia's lifetime, there were various rumours about her alleged incestuous relationship with her brother, Ernest Augustus, Duke of Cumberland, who later became the King of Hanover. The Prince Regent supposedly warned his sisters not to be alone in the same room with the Duke, and Cumberland was deeply unpopular with the British people. It is unclear whether there was truth to these rumours or whether they were circulated by the Duke's numerous political enemies.\nLimited in exposure to eligible men, Sophia and several of her sisters became involved with courtiers and equerries. Sophia entered into a relationship with her father's chief equerry, Major-General Thomas Garth, a man thirty-three years her senior. He had a large purple birthmark on his face, causing Sophia's sister Mary to refer to him as \"the purple light of love\" and courtier and diarist Charles Greville to call him a \"hideous old devil\". Despite this, one lady-in-waiting noted \"the princess was so violently in love with him that everyone saw it. She could not contain herself in his presence.\" Greville wrote about Sophia and her sisters' affairs in a diary entry, \"women fall in love with anything – and opportunity and the accidents of the passions are of more importance than any positive merits of mind or of body... [The princesses] were secluded from the world, mixing with few people – their passions boiling over and ready to fall into the hands of the first man whom circumstances enabled to get at them.\"\nGossip soon spread of the existence of an illegitimate child. Some historians contend that, sometime before August 1800 in Weymouth, Sophia gave birth to a child fathered by Garth. Flora Fraser believes the rumours that Sophia had a child, but has questioned whether the child was fathered by Garth, or Sophia's brother the Duke of Cumberland. Historians further write that the child, baptised Thomas Garth like his father, was raised by his father in Weymouth, where his mother would visit him occasionally. In 1828 he apparently tried to blackmail the royal family with certain incriminating documents from his father about his supposed parents' relationship, though this ended in failure.\nConversely, Anthony Camp challenges the belief that Sophia had a child and provides a detailed summary of the available evidence. In his book Royal Babylon: the Alarming History of European Royalty, author Karl Shaw writes of the possibility that the Duke raped his sister, citing evidence from Charles Greville's diaries, as well as other factors.|group=note}} Historian Gillian Gill believes that Sophia secretly gave birth to the child and that this is the reason Sophia never married. Alison Weir and others, however, write of a possible marriage between Sophia and Garth the same year as the child's birth, but there is no evidence to back this assertion other than the presence of a wedding ring in a portrait of an aged Sophia.\nLater life\n.|left]]\nSophia was a favourite of her niece, Princess Charlotte of Wales, as the young princess liked her gentle character and had a certain fascination for the gossip surrounding Sophia's past. Charlotte's feelings towards her other aunts were capricious; she once wrote, \"I can hardly believe [Sophia] belongs to them- so wholly different is she in thoughts, opinions, matters. Her nobleness and rectitude of mind renders her no favourite here. The constant scenes of intrigue, of tracasseries, she can but ill support.\" The Prince Regent's efforts to help his sisters led to the marriages of Mary and Elizabeth, and Queen Charlotte's death in 1818 allowed Augusta and Sophia their domestic freedom, though it was too late for them to marry. From her mother Sophia inherited Lower Lodge at Windsor Great Park, which she in turn gave to the Prince Regent. The death of Augusta in 1840 resulted in Sophia inheriting Clarence House and Frogmore.\n, London (February 2025)]]\nAfter the queen's death, Sophia lived in Kensington Palace during her final years, next to her niece Princess Victoria of Kent, the future Queen Victoria. As a result, Sophia was one of the few paternal relatives that Victoria saw often. Like her sister-in-law the Duchess of Kent, Sophia fell under the spell of Victoria's comptroller Sir John Conroy and let him manage her money. The princess became a part of the Duchess of Kent's social circle and, in return, Sophia spied for Conroy when he was absent from Kensington Palace. Sophia also reported to Conroy on what she heard at St. James's Palace, as she had privileged access to courtiers as well as to her two elder brothers. Gossipmongers speculated that Conroy's successful ability to deal with the \"bullying importunities\" of Sophia's illegitimate son endeared her to him,  while some historians write that Conroy took advantage of Sophia, who in her last years had become \"dizzy, easily muddled... mourning her fading looks\" and a \"confused, nearly blind aunt.\" Sophia often dined with the household, but the Duchess of Kent distrusted her. Victoria was aware her aunt was a spy and the two never became close. Sophia's wealth allowed Conroy to live a rich lifestyle, acquiring for himself a house in Kensington for £4,000, as well as two other estates for £18,000. Sophia was also responsible for certain members of Victoria's household gaining higher statuses; Victoria's governess Louise Lehzen, for instance, was made a Hanoverian baroness on the orders of George IV, and Conroy was named a Knight Commander of the Hanoverian Order.\nDeath\nAfter having been blind for over ten years, on the morning of 27 May 1848, Sophia became ill at her residence at Vicarage Place, Kensington; she was visited by her sister Mary, sister-in-law Queen Adelaide, and nephew-in-law Prince Albert. Sophia's death occurred at 6:30 pm later that day, when Mary, the Duchesses of Kent and Cambridge were present.\nSophia was buried at Kensal Green Cemetery in London, immediately in front of (east of) the central chapel rather than at Windsor Castle, as she wished to be near her brother, Prince Augustus Frederick, Duke of Sussex (who lies on the opposite side of the path). After her death, it was discovered that Conroy had squandered most of her money and that the princess had virtually no estate to bequeath. Charles Greville wrote an entry in his diary on 31 May:\n}}\nAncestors\n| boxstyle_1 = background-color: #fcc;\n| boxstyle_2 = background-color: #fb9;\n| boxstyle_3 = background-color: #ffc;\n| boxstyle_4 = background-color: #bfc;\n| 1 = 1. Princess Sophia of the United Kingdom\n| 2 = 2. George III of the United Kingdom\n| 3 = 3. Princess Charlotte of Mecklenburg-Strelitz\n| 4 = 4. Frederick, Prince of Wales\n| 5 = 5. Princess Augusta of Saxe-Gotha\n| 6 = 6. Duke Charles Louis Frederick of Mecklenburg-Strelitz\n| 7 = 7. Princess Elisabeth Albertine of Saxe-Hildburghausen\n| 8 = 8. George II of Great Britain\n| 9 = 9. Princess Caroline of Brandenburg-Ansbach\n| 10 = 10. Frederick II, Duke of Saxe-Gotha-Altenburg\n| 11 = 11. Princess Magdalena Augusta of Anhalt-Zerbst\n| 12 = 12. Adolphus Frederick II, Duke of Mecklenburg-Strelitz\n| 13 = 13. Princess Christiane Emilie of Schwarzburg-Sondershausen\n| 14 = 14. Ernest Frederick I, Duke of Saxe-Hildburghausen\n| 15 = 15. Countess Sophia Albertine of Erbach-Erbach\n}}\nSee also\n, differenced by a label of three points argent, the centre point bearing a heart gules, the outer points each bearing a rose gules.]]\n* British royal family\n* Descendants of George III and Queen Charlotte\nNotes\nReferences\nWorks cited\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\nExternal links\n*"
    }
  ]
}