{
  "content": [
    {
      "type": "text",
      "text": "# Prince Edward Island Light Horse\n\n| type                          = Line cavalry\n| role                          =\n| size                          = One regiment\n| command_structure             =\n| garrison                      = Charlottetown, Prince Edward Island\n| battles                       =\n| battle_honours                = See #Battle honours\n}}\nThe Prince Edward Island Light Horse was a cavalry regiment of the Non-Permanent Active Militia of the Canadian Militia (now the Canadian Army). First authorized in 1901 as an independent squadron of Canadian Mounted Rifles, it became a full regiment in 1903 and received its regimental number in 1914. The regiment served until 1946 when it was amalgamated with The Prince Edward Island Highlanders to form what is now The Prince Edward Island Regiment (RCAC).\nLineage\n* Originated on 1 June, 1901, in Charlottetown, Prince Edward Island, as “L” Squadron, Prince Edward Island Mounted Rifles.\n* Redesignated on 1 October, 1901, as “L” Squadron, Canadian Mounted Rifles.\n* Redesignated on 1 April, 1903, as the Prince Edward Island Light Horse\n* Granted full regimental status on 16 February 1914, with the formation of an additional squadron in Summerside, PEI.\n* Redesignated on 1 April, 1914, as the 36th Prince Edward Island Light Horse.\n* Redesignated on 15 March, 1920, as The Prince Edward Island Light Horse.\n* Redesignated on 1 April, 1941, as the 17th (Reserve) Armoured Regiment (Prince Edward Island Light Horse).\n* Amalgamated on 1 April, 1946, with The Prince Edward Island Highlanders to form the 17th (Prince Edward Island) Reconnaissance Regiment; now The Prince Edward Island Regiment (RCAC).\nHistory\nEarly history\nThe Prince Edward Island Light Horse was first authorized on 1 June 1901, as an independent squadron in the Non-Permanent Active Militia component of the Canadian Mounted Rifles. On 16 February 1914, it was granted full regimental status after an additional squadron was established in Summerside, PEI. A few months later on 1 April 1914, the regiment was redesignated as the 36th Prince Edward Island Light Horse.\nOn 15 March 1920, as a result of the Canadian Militia reforms following the Otter Commission, the regiment was simply redesignated as The Prince Edward Island Light Horse.\nSecond World War\nDuring the Second World War, the PEI Light Horse on 27 February 1941 mobilized an armoured squadron which formed the Headquarters Squadron of the 1st Canadian Armoured Brigade. They would later on 1 November 1943 be reorganized as the 2nd Canadian Corps Defence Company (The Prince Edward Island Light Horse). On 6 July 1944, the PEI Light Horse landed in France and served as part of the II Canadian Corps until the end of the war in Europe in May 1945.\nThe youngest Canadian soldier to die in the Second World War, 14-year-old Robert Cyril Claude Brooks was a member of the 17th (Reserve) Armoured Regiment (Prince Edward Island Light Horse). He was killed in a training accident near Coleman, Prince Edward Island, at approximately 7:30&nbsp;pm on 23 September 1944, when a Universal Carrier was driven through a guard rail on a bridge, overturning into the water below. He was trapped beneath the overturned vehicle and drowned, along with two fellow members of the regiment, Sergeant D.C. Ramsay and Trooper W.N. Dennis.\nPostwar\nOn 1 April, 1946, The Prince Edward Island Light Horse was amalgamated with The Prince Edward Island Highlanders to form the 17th (Prince Edward Island) Reconnaissance Regiment (now The Prince Edward Island Regiment (RCAC)).\nSub-units\nThe Prince Edward Island Light Horse (3 March 1920)\n* Regimental Headquarters (Charlottetown, PEI)\n* A Squadron (Charlottetown, PEI)\n* B Squadron (Summerside, PEI)\n* C Squadron (Montague, PEI)\nAlliances\n*  - 9th Queen's Royal Lancers (Until 1946)\nUniform\nThe officers of the 36th PEI Light Horse in full dress wore a scarlet dragoon tunic with yellow facings and piping, and dark blue trousers with a broad yellow stripe. For regimental headdress, instead of the more expensive metal cavalry helmets, they wore white Canadian-pattern pith helmets with gilt regimental badge, chin strap and spike surmounted by a red over white hair plume.\nThe non-commissioned officers and other ranks of the regiment in full dress on the other hand wore scarlet serge frock with yellow facings and dark blue trousers with a broad yellow stripe. For regimental headdress, they wore peaked caps of dark blue with yellow bands and piping.\nBattle honours\nGreat War\n* Arras, 1917, '18\n* Ypres, 1917\n* Amiens\n* Hindenburg Line\n* Pursuit to Mons\nSecond World War\n* North-West Europe, 1944–1945\nBattle honour awarded to regiment's successor, Prince Edward Island Regiment, after the regiment was amalgamated, but for service and actions of the 2nd Canadian Corps Defence Company (The Prince Edward Island Light Horse).\nNotable members\n* John George MacKay\n* Robert Cyril Claude Brooks\nSee also\n* List of regiments of cavalry of the Canadian Militia (1900–1920)\nNotes and references"
    }
  ]
}