{
  "content": [
    {
      "type": "text",
      "text": "# Prince Edward Island Regiment\n\n| colors                        = Gold and black\n| march                         = \"Old Solomon Levi\"\n| notable_commanders            =\n| anniversaries                 =\n| engagements                   =\n| battles                       =\n| battle_honours                = See #Battle honours\n| website                       =\n| identification_symbol         = PEIR\n| identification_symbol_label   = Abbreviation\n| identification_symbol_2       = 100px100px\n| identification_symbol_2_label = NATO Map Symbol\n}}\nThe Prince Edward Island Regiment (RCAC) is a Primary Reserve armoured reconnaissance regiment of the Canadian Forces, 5th Canadian Division, 36 Canadian Brigade Group.  The regiment is based in Charlottetown and Summerside, Prince Edward Island.\nOrganization\nThe Prince Edward Island Regiment is organized into the following components:\n* Regimental Headquarters\n* Recce Squadron\n* Headquarters Squadron\n* Band\nLineage\nThe Prince Edward Island Regiment (RCAC)\n* Originated on 25 June 1875, in Charlottetown, Prince Edward Island, as the ''Queen's County Provisional Battalion of Infantry.\n* Amalgamated on 30 June 1876, with the Charlottetown Provisional Battalion of Infantry and redesignated as the Queen's County Battalion of Infantry.\n* Redesignated on 4 October 1878, as the 82nd Queen's County Battalion of Infantry.\n* Redesignated on 8 May 1900, as the 82nd Queen's County Regiment.\n* Redesignated on 5 June 1906, as the 82nd Abegweit Light Infantry.\n* Redesignated on 29 March 1920, as The Prince Edward Island Regiment.\n* Redesignated on 15 June 1927, as The Prince Edward Island Highlanders.\n* Redesignated on 1 January 1941, as the 2nd (Reserve) Battalion, The Prince Edward Island Highlanders.\n* Redesignated on 1 June 1945, as The Prince Edward Island Highlanders.\n* Converted to armour and amalgamated on 1 April 1946, with the 17th (Reserve) Armoured Regiment (Prince Edward Island Light Horse), RCAC and redesignated as the 17th (Prince Edward Island) Reconnaissance Regiment\n* Redesignated on 4 February 1949, as The Prince Edward Island Regiment (17th Reconnaissance Regiment).\n* Amalgamated 28 February 1955, with the 28th Light Anti-Aircraft Regiment, RCA.\n* Redesignated on 19 May 1958, as The Prince Edward Island Regiment (RCAC).\nThe Charlottetown Provisional Battalion of Infantry\n* Originated on 2 July 1875, in Charlottetown, Prince Edward Island, as the Charlottetown Provisional Battalion of Infantry.\n* Amalgamated on 30 June 1876, with the Queen's County Provisional Battalion of Infantry and redesignated as the Queen's County Battalion of Infantry.\nThe Prince Edward Island Light Horse\n* Originated on 1 June 1901, in Charlottetown, Prince Edward Island, as “L” Squadron, Prince Edward Island Mounted Rifles.\n* Redesignated on 1 October 1901, as “L” Squadron, Canadian Mounted Rifles.\n* Redesignated on 1 April 1903, as the Prince Edward Island Light Horse\n* Granted full regimental status on 16 February 1914, with the formation of an additional squadron in Summerside, PEI.\n* Redesignated on 1 April 1914, as the 36th Prince Edward Island Light Horse.\n* Redesignated on 15 March 1920, as The Prince Edward Island Light Horse.\n* Redesignated on 1 April 1941, as the 17th (Reserve) Armoured Regiment (Prince Edward Island Light Horse).\n* Amalgamated on 1 April 1946, with The Prince Edward Island Highlanders to form the 17th (Prince Edward Island) Reconnaissance Regiment.\n28th Light Anti-Aircraft Regiment, RCA\n* Originated on 31 March 1882, in Charlottetown, Prince Edward Island, as the Prince Edward Island Provisional Brigade of Garrison Artillery.\n* Redesignated on 1 January 1893, as the Prince Edward Island Battalion of Garrison Artillery.\n* Redesignated on 1 January 1895, as the 4th Prince Edward Island Battalion.\n* Redesignated on 28 December 1895, as the 4th Prince Edward Island Regiment of Garrison Artillery.\n* Amalgamated on 1 January 1904, with the Charlottetown Field Company.\n* Redesignated on 1 April 1908, as the 4th Prince Edward Island Regiment (Heavy Brigade).\n* Redesignated on 2 May 1910, as the 4th Prince Edward Island Heavy Brigade, CGA.\n* Redesignated on 1 June 1912, as the Prince Edward Island Heavy Brigade, CGA.\n* Redesignated on 2 February 1920, as the 1st (Prince Edward Island) Heavy Brigade.\n* Redesignated on 15 March 1920, as the 1st (Prince Edward Island) Heavy Brigade, CA.\n* Redesignated on 1 July 1925, as the 1st (Prince Edward Island) Medium Brigade, CA.\n* Redesignated on 3 June 1935, as the 1st (Prince Edward Island) Medium Brigade, RCA.\n* Redesignated on 1 April 1946, as the 28th Light Anti-Aircraft Regiment, RCA.\n* Amalgamated on 28 February 1955, with The Prince Edward Island Regiment (17th Reconnaissance Regiment).\nThe Charlottetown Field Company\n* Originated on 16 August 1878, in Charlottetown, Prince Edward Island, as the Charlottetown Engineer Company.\n* Redesignated on 1 August 1899, as the Charlottetown Field Company.\n* Amalgamated on 1 January 1904, with the 4th Prince Edward Island Regiment of Garrison Artillery''.}}\nof |CPI=Charlottetown Provisional Bn of Infy|Ipyby=Independent  }}\n}}\nProvisional  of Garrison }}\nof Garrison Arty}}\nCoy}}\n, PEI Mounted Rifles}}\n}}\n}}\n}}\n}}\n2 Heavy  Depot, }}\n}}\n}}\n|2PEIH=2nd (Reserve) Bn, The PEI Highlanders|1CAHQ=1st Canadian  Bde  Sqn (The PEI Light Horse), CASF|2PEIL=2nd (Reserve) Regt, The PEI Light Horse}}\n, CASF}}\nRegt|28LAA=28th Light Anti-Aircraft Regt, RCA}}\n)}}\nPerpetuations\nThe PEIR perpetuates the following units of the Canadian Expeditionary Force:\n*1st Brigade, Canadian Garrison Artillery, CEF\n*No. 2 Canadian Siege Battery, CEF\n*No. 8 Canadian Siege Battery, CEF\n*105th Battalion (Prince Edward Island Highlanders), CEF\nHistory\nIn 1946 the amalgamation of The Prince Edward Island Light Horse and The Prince Edward Island Highlanders created The Prince Edward Island Regiment, 17th Reconnaissance Regiment.\nThe Prince Edward Island Regiment was amalgamated with the 28th Light Anti-Aircraft Regiment in 1955.\nRobert Cyril Claude Brooks\nThe youngest Canadian soldier to die in the Second World War, 14-year-old Robert Cyril Claude Brooks was a member of the 17th (Reserve) Armoured Regiment (Prince Edward Island Light Horse). He was killed in a training accident near Coleman, Prince Edward Island, at approximately 7:30&nbsp;p.m. on 23 September 1944, when a Universal Carrier was driven through a guard rail on a bridge, overturning into the water below. He was trapped beneath the overturned vehicle and drowned, along with two fellow members of the regiment, Sergeant D.C. Ramsay and Trooper W.N. Dennis.\nAlliances\n* – 9th/12th Royal Lancers (Prince of Wales's)\n* – The Black Watch\nBattle honours\nBattle honours in small capitals are for large operations and campaigns and those in lowercase are for more specific battles. Bold type indicates honours emblazoned on the regimental guidon. The Second World War Battle Honour is for the service of the Prince Edward Island Light Horse which was, on 27 February 1941, Headquarters Squadron, 1st Canadian Armoured Brigade and on 1 November 1943 became the 2nd Corps Defence Company.\n}}\n*\n*\n*\n*\n}}\n}}\n}}\n}}\n}}\nEquipment\n{| border=1 style=\"border-collapse: collapse;\"\n|- style=\"background:#ccc;\"\n!Model!!Type!!Dates!!Builder!!Details\n|-\n| Volkswagen/Bombardier Iltis || light utility vehicle || 1985–2004 || Volkswagen, Germany || optional M101 trailer unit; replaced by G-Wagen\n|-\n| LUVW C&R (G-Wagen) 4 × 4 || light utility vehicle || 2004- || Mercedes-Benz, Germany || replaced the Iltis light trucks in Afghanistan\n|-\n|  LUVW MILCOTS (Milverado) - 2003 Silverado Basic model 861 (GM K25943HD) || light utility vehicle || 2003- || Chevrolet, USA || replacing the Iltis jeeps in North American operations only\n|-\n|  C9 || light machine gun || ||\n|\n|- TAPV\n|  Colt Canada C7 rifle || personal weapon || 1984- || Diemaco/Colt Canada\n|\n|-\n|  C6 || GPMG || ||\n|\n|}\nThe Prince Edward Island Regiment (RCAC) Museum\nThe Prince Edward Island Regiment (RCAC) Museum collects, preserves, displays and studies the military history of the founding units of The Prince Edward Island Regiment, from the island's formation (founding). The main concentration is on the period 1870 until the present. The RCAC museum is at the J. David Stewart Armoury in Charlottetown, Prince Edward Island.\nOrder of precedence\nExternal links\n*\n* [http://peiregiment.com/ PEIR Association]\n* [https://web.archive.org/web/20110610215424/http://www.army.forces.gc.ca/36cbg_hq/pages/home_e.html 36 Canadian Brigade]\n* [https://web.archive.org/web/20071016150023/http://regiments.org/regiments/na-canada/volmil/pe-cav/946PEIR.htm regiments.org]\nNotes and references"
    }
  ]
}