{
  "content": [
    {
      "type": "text",
      "text": "# Princess Marie Antoinette of Schwarzburg\n\n}}\n| issue       =\n| house       = Schwarzburg\n| father      = Sizzo, Prince of Schwarzburg\n| mother      = Princess Alexandra of Anhalt\n| birth_date  =\n| birth_place = Großharthau, Kingdom of Saxony\n| death_date  =\n| death_place = Klingen, West Germany\n}}\nMarie Antoinette, Princess of Schwarzburg (; 7 February 18984 November 1984) was the eldest child of Sizzo, Prince of Schwarzburg.\nEarly life and background\nMarie Antoinette was born at Großharthau, Kingdom of Saxony, the first child of Sizzo, Prince of Schwarzburg (1860–1926), and his wife, Princess Alexandra of Anhalt (1868–1958). Her father was the son of Friedrich Günther, Prince of Schwarzburg-Rudolstadt, and Countess Helena von Reina (1835-1860); and her mother was the daughter of Frederick I, Duke of Anhalt, and Princess Antoinette of Saxe-Altenburg. Through her mother she was descendant of King Frederick William II of Prussia.\nMarriage\nMarie Antoinette married on 4 January 1925 in Wildenfels to Friedrich Magnus V, Count of Solms-Wildenfels (1886–1945), only son of Friedrich Magnus IV, Count of Solms-Wildenfels (1847-1910) and his wife, Anna Jacqueline, Countess of Bentinck-Aldenburg-Middachten (1855-1903).\nThey had five children:\n* Countess Anne of Solms-Wildenfels (1 January 19267 July 2015); unmarried and without issue.\n* Friedrich Magnus VI, Count of Solms-Wildenfels (b. 18 January 1927); married three times. His first marriage was in 1948 to Katharina Duerst; they divorced in 1954 and remarried in 1966; had issue. His second marriage was in 1971 to Gisela Frania; they divorced in 1972 and had no issue. His third marriage was in 1994 to Gisella Marie Parsoll, with whom he had no issue.\n* Countess Jutta of Solms-Wildenfels (b. 12 February 1928); married in 1957 Salim Farid Saad.\n* Count Albrecht Sizzo of Solms-Wildenfels (28 May 19298 February 2010); married in 1970 Ingrid Gross.\n* Countess Kristin of Solms-Wildenfels (b. 27 May 1938); married in 1971 Dietrich Gross.\nHouse of Schwarzburg\nOn 21 April 1896 her father was recognised as a dynast of the House of Schwarzburg, having previously not had dynastic rights due to his parents' morganatic marriage. Following her brother's death in 1971, the House of Schwarzburg became extinct in the male line.\nAncestry\nNotes and sources\n*[https://thepeerage.com/p6749.htm#i67490 thePeerage.com - Marie Antoinette Prinzessin von Schwarzburg]\n*Genealogisches Handbuch des Adels, Fürstliche Häuser, Reference: 1991 201"
    }
  ]
}