{
  "content": [
    {
      "type": "text",
      "text": "# Priscilla, Queen of the Desert (musical)__disambig_1\n\nPriscilla, Queen of the Desert is a jukebox musical with book by Australian film director-writer Stephan Elliott and Allan Scott, using well-known pop songs as its score. Adapted from Elliott's 1994 film The Adventures of Priscilla, Queen of the Desert, the musical tells the story of two drag queens and a trans woman, who contract to perform a drag show at a resort in Alice Springs, a resort town in the remote Australian desert. As they head west from Sydney aboard their lavender bus, Priscilla, the three friends come to the forefront of a comedy of errors, encountering a number of strange characters, as well as incidents of homophobia, while widening comfort zones and finding new horizons.\nProduced by Allan Scott in coalition with Back Row Productions, Michael Chugg, Michael Hamlyn and John Frost, the Simon Phillips-directed and Ross Coleman-choreographed original production of Priscilla debuted in Australia at the Lyric Theatre, Sydney in October 2006. Having had a successful run in Sydney, the production transferred to Melbourne in 2007 and then Auckland, New Zealand in 2008, before returning to Sydney for a limited engagement. The Australasian success of Priscilla provoked a two-year strong West End production in addition to its Bette Midler-produced Broadway debut in 2011. While the original production received one out of its seven Helpmann Award nominations, Priscilla was nominated for the Laurence Olivier Award for Best New Musical as well as two Tony Awards, winning these awards in the costume design categories.\nSynopsis\nAct I\nThe drag queen Mitzi Mitosis – stage name of Anthony \"Tick\" Belrose – is performing at a club (\"Downtown\" [Australia and London]/\"I've Never Been to Me\"; \"It's Raining Men\" [Broadway]) when his estranged wife Marion, calls in for a favour. While Tick is offstage, fellow drag queen Miss Understanding performs her own number (\"What's Love Got to Do With It?\"). From the phone in Tick's dressing room, Marion reveals that she needs an act for a few weeks at her business in distant Alice Springs, Australia. Tick is at first reluctant, but Marion informs him that part of the reason she's asking is because their now eight-year-old son Benji wants to meet his father (\"I Say A Little Prayer\"). Tick confides in another fellow drag queen Farrah, before deciding he will leave for Alice Springs. Tick then calls a friend, a transgender woman named Bernadette to join him but Bernadette's husband has just died. The pair meet at the funeral (\"Don't Leave Me This Way\"), where Bernadette agrees to join him. Tick also asks a friend Felicia – stage name of Adam Whitely – to come with them (\"Venus\"/\"Material Girl\"), with Bernadette taking an immediate dislike to his show-off performance style. Nonetheless, the newly formed trio buy a \"budget Barbie campervan\" they nickname \"Priscilla, Queen of the Desert\" (\"Go West\"). Tick informs them that the trip is a favour to his wife, but does not tell them it is also to meet his son who wants to see him (\"I Say A Little Prayer (Reprise)\"). As the journey to Alice Springs begins, Adam angers Bernadette after making transphobic jokes about her life before transitioning. Later the group arrives at a bar in Broken Hill, in full drag, and start a bar dance party (\"I Love the Nightlife\"), but when they return to the bus learn that the townspeople wrote hateful statements on the bus in spray paint. Tick is very upset, but Adam and Bernadette comfort him (\"Both Sides, Now\"/\"True Colors\"). While on the road, Adam practices his lip-syncing as Felicia sitting in the giant high heel on the roof of the van (\"Follie! Delirio vano è questo! Sempre libera (from La traviata)\"). The next morning, Priscilla breaks down and Adam buys lavender paint to erase the vandalism (\"Colour My World\"). They manage to get the locals of another town on their side and meet Bob, a mechanic from a small town nearby who agrees to help fix Priscilla. The group celebrates that they've found people that accept them (\"I Will Survive\").\nAct II\nThe second act opens with a group of bogans singing (\"Thank God I'm A Country Boy\"). Bernadette talks with Bob and learns that when he was in Sydney, he saw her when she was a young \"Les Girl\" (\"A Fine Romance\"). The two begin to grow feelings for each other. Later in a bar (\"Thank God I'm A Country Boy Reprise\"), the trio is about to perform (\"Shake Your Groove Thing\") when Cynthia, Bob's wife, interrupts their act by \"popping\" ping-pong balls (\"Pop Muzik\"). After this, the trio leaves, leaving Bob to wonder about his feelings for Bernadette (\"A Fine Romance (Reprise)\"). All of a sudden, Bernadette asks if he wants a free ride back to his real home, in which he agrees (\"Girls Just Wanna Have Fun\"). Later when they arrive, Adam dresses up like a woman to try to meet men (\"Hot Stuff\"), but ends up getting chased and nearly becomes the victim of a hate crime until Bernadette rescues him by kicking one of his attackers. Later as they arrive in Alice Springs, Tick reflects on the trip after someone literally leaves the cake out in the rain (\"MacArthur Park\"). As another act performs first (\"Boogie Wonderland\"), the trio gets ready to perform a variety of songs that they sang or lip-synced on their journey (\"The Floor Show\"). Afterwards, Tick finally meets his son, Benji, who accepts his father's sexuality and lifestyle (\"Always on My Mind/I Say a Little Prayer\") and Adam gets to perform his own solo Madonna hit, (\"Like A Prayer\" [Broadway]; \"Confide in Me/Kylie Medley\" [Australia and West End]), his favorite singer. Afterwards the gang talks about their plans after Alice Springs, and realize they can't leave each other (\"We Belong\"). They go off stage together and the company performs a medley of songs to close the show (\"Finally (Finale)\").\nCast information\n{| class=\"wikitable sortable\" style=\"border:1px solid; width:100%; text-align:center; margin:1em auto;\"\n|-\n! colspan=\"10\" |Original casts\n|-\n!Character\n!Australia\n!West End\n!Broadway\n!Original\nUK Tour\n!Original\nUS Tour\n!10th Anniversary Australia Tour\n|-\n!Anthony \"Tick\" Belrose (\"Mitzi Mitosis\")\n|Jeremy Stanford\n|Jason Donovan\n|Will Swenson\n|Jason Donovan, Noel Sullivan\n|Wade McCollum\n|David Harris\n|-\n!Bernadette Bassenger\n| colspan=\"3\" |Tony Sheldon\n|Richard Grieve\n|Scott Willis\n| colspan=\"3\" |Tony Sheldon\n|-\n!Adam Whitely (\"Felicia Jollygoodfellow\")\n|Daniel Scott\n|Oliver Thornton\n|Nick Adams\n|Graham Weaver\n|Bryan Buscher-West\n|Euan Doidge\n|-\n!Bob\n|Michael Caton\n|Clive Carter\n|C. David Johnson\n|Giles Watling\n|Joe Hart\n|Robert Grubb\n|-\n!The Divas\n|Danielle Barnes, Sophie Carter, Amelia Cormack\n|Zoe Birkett, Kate Gillespie, Emma Lindars\n|Jacqueline Arnold, Anastacia McCleskey, Ashley Spencer\n|Emma Kingston, Laura Mansell, Ellie Leah\n|Emily Afton, Bre Jackson, Brit West\n|Cle Morgan, Samm Hagen, Angelique Cassimatis\n|-\n!Miss Understanding\n|Trevor Ashley\n|Wesley Sebastian\n|Nathan Lee Graham\n|Alan Hunter\n|Nik Alexzander\n|Blake Appelqvist\n|-\n!Marion\n|Marney McQueen\n|Amy Field, Yvette Robinson*\n|Jessica Phillips\n|Julie Stark\n|Christy Faber\n|Adele Parkinson\n|-\n!Cynthia\n|Lena Cruz\n|Kanako Nakano\n|J. Elaine Marcos\n|Frances Mayli McCann\n|Chelsea Zeno\n|Lena Cruz\n|-\n!***Farrah / Young Bernadette\n|Damien Ross\n|Steven Cleverley\n|Steve Schepis\n|Regan Shepherd\n|Travis Taber\n|Adam Noviello\n|-\n!Shirley\n|Genevieve Lemon\n|Daniele Coombe\n|Keala Settle\n|Ellie Leah\n|Babs Rubenstein\n|Emma Powell\n|-\n!Jimmy\n|Kirk Page\n|Tristan Temple\n|James Brown III\n|\n|Taurean Everett\n|-\n!Frank\n|Ben Lewis\n|John Brannoch\n|Mike McGowan\n|Leon Kay\n|David Koch\n|-\n!Benjamin**\n|Joshua Arkey, Alec Epsimos, Rowan Scott, Joel Slater\n|Gene Goodman, Red Walker, Cameron Sayers, Darius Caple\n|Luke Mannikus, Ashton Woerz\n|Various\n|Shane Davis, Will B.\n|Samuel Boyden, Sebastian Cocks, Aaron David, William Fleming, Ryder Hewison, Nikolas Karagianis, Elijah Slavinskis, Lenny Thomas, and Various others\n|}*In the West End production, the role of Marion was played by Yvette Robinson whilst Amy Field was on maternity leave (1 December 2009 – 25 September 2010).**In every production, the role of Benjamin is played by more than one actor, each alternating at certain performances, due to their young age. In the UK Tour the role of Benji was shared between around 30 different boys up and down the UK.\nIn some productions (only) Farrah and Young Bernadette were played by the same Actor.\nProductions\nAustralia (2006–08)\nPriscilla, Queen of the Desert premiered on 7 October 2006 at the Lyric Theatre, Star City Casino, Sydney, Australia and ended its run on 2 September 2007. Directed by Melbourne Theatre Company artistic director Simon Phillips, it starred Tony Sheldon as Bernadette, Jeremy Stanford as Tick/Mitzi and Daniel Scott as Adam/Felicia with Michael Caton as Bob and Joshua Arkey, Alec Epsimos, Rowan Scott and Joel Slater as Benjamin.\nThe Sydney production transferred to the Regent Theatre in Melbourne, beginning previews on 28 September 2007 before opening on 6 October 2007. The show closed on 27 April 2008 to make way for the Australian premiere of Wicked.\nThe Melbourne production transferred to Auckland in New Zealand for a limited run, opening on 28 May 2008 and closed on 6 July 2008.\nThe musical returned to the Star City Hotel and Casino in Sydney on 7 October 2008 for the second anniversary of the show's premiere and closed on 21 December 2008. The show starred original cast members Sheldon and Scott, alongside Todd McKenney as Tick/Mitzi and Bill Hunter as Bob.\nWest End (2009–11)\nA West End production started previews on 10 March 2009 at the Palace Theatre with the opening press night on 23 March. It is co-produced by Andrew Lloyd Webber's Really Useful Group and directed by Simon Phillips with musical arrangements by Stephen 'Spud' Murphy, choreography by Ross Coleman, costume designs by Tim Chappel and Lizzy Gardiner, production designs by Brian Thomson, and lighting by Nick Schlieper. The original cast included Jason Donovan as Mitzi (aka \"Tick\"), Tony Sheldon as Bernadette, and Oliver Thornton as Adam/Felicia. Notable replacements include Ben Richards as Tick/Mitzi, Don Gallagher as Bernadette, Portia Emare as one of the Divas and Ray Meagher as Bob. The West End production closed on 31 December 2011.\nToronto (2010–11)\nThe musical opened on 12 October 2010 at the Princess of Wales Theatre in Toronto as a Pre-Broadway tryout. The musical featured all of the Broadway cast with a new production team. It received largely positive reviews and strong ticket sales. The musical played for 12 weeks, a month longer than originally planned, closing on 2 January 2011. Several modifications were made to the production.\nBroadway (2011–12)\nPriscilla premiered on Broadway on 20 March 2011 at the Palace Theatre with previews beginning 28 February 2011. Before opening on Broadway, the show made its North American debut at the Princess of Wales Theatre in Toronto for a limited 12-week tryout.\nThe original cast included Will Swenson as Tick/Mitzi, Tony Sheldon, again, reprising his role of Bernadette, and Nick Adams as Adam/Felicia. Choreography is by Ross Coleman, set design by Brian Thomson, lighting design by Nick Schlieper and costume designs by Tim Chappel and Lizzy Gardiner. Producers include Bette Midler, who joined the production team after seeing the West End production; Liz Koops and Garry McQuinn for Back Row Productions; Michael Hamlyn for Specific Films; Allan Scott Productions; David Mirvish; Roy Furman; Terry Allen Kramer; James L. Nederlander; and Terri and Timothy Childs.\nThe Broadway cast album was recorded in late January 2011 on Rhino Records for release on 15 March 2011. The production released video footage from their North American premiere on Tuesday, 15 February. The Broadway production closed on 24 June 2012 after 23 previews and 526 performances.\nItaly (2011–14)\nAn Italian production opened on 14 December 2011, only a few months after the Broadway debut, at the Teatro Ciak in Milan, where it ran until 30 April 2012. The cast included Antonello Angiolillo as Tick/Mitzi, Simone Leonardi as Bernadette, and Mirko Ranù as Adam/Felicia. Later the show was transferred to Teatro degli Arcimboldi in Milan (from 6 November to 31 December 2012), to Teatro Brancaccio in Rome (from 24 January 2013 to 21 April 2013), and to Politeama Rossetti in Trieste (from 10 to 26 May 2013).\nAfter an hiatus, the production embarked on a tour, opening on 31 October 2013 at the Teatro Alfieri in Turin and concluding on 19 January 2014 at the Gran Teatro in Rome, with some changes in the cast, including Marco D'Alberti as Bernadette, and Riccardo Sinisi as Adam/Felicia.\nSão Paulo (2012)\nIn Brazil Priscilla ran at the Teatro Bradesco, São Paulo, from 16 March to 9 December 2012, produced by GEO Eventos, BASE Entertainment and Nullarbor Productions, and starring Luciano Andrey as Tick/Mitzi, Rubén Gabira as Bernadette, André Torquato as Adam/Felicia, Li Martins as Cynthia and Saulo Vasconcelos as Bob. The production included the Brazilian disco anthem \"Dancing Days\" during the final bows.\nUS National Tour (2013)\nAfter the show closed on Broadway, a national tour opened on 8 January 2013 at the Orpheum Theatre in Minneapolis, Minnesota with Wade McCollum as Tick/Mitzi, Scott Willis as Bernadette, and Bryan West as Adam/Felicia. The tour played its final performance on 17 November 2013 at the Paramount Theatre in Seattle, Washington.\nIn 2016, Fiddlehead Theatre produced one of the first regional productions of the piece at Boston's Shubert Theatre. Featuring the book and songs from the West End production, the production was led by Director Stacey Stephens, Choreographer Arthur Cuadros, Costumes by Stacey Stephen and Set by Brian Ruggaber.  The show featured Andrew Giordano as Tick/Mitzi, Matthew Tiberi as Adam/Felicia, and Larry Daggett as Bernadette.  The show went on to win two Independent Reviewer of New England awards for Best Actor, Mr. Daggett and for Best Costumes, Mr. Stephens.\nUK National Tour (2013–14)\nThe first UK tour started on 9 February 2013 at the Opera House in Manchester and concluded on 12 April 2014 at the Theatre Royal in Plymouth. Jason Donovan and Noel Sullivan alternated as Tick/Mitzi, with Richard Grieve as Bernadette, and Graham Weaver as Adam/Felicia. The tour included the changes made for the Broadway production, except for the songs by Madonna.\nStockholm (2013)\nA Swedish production ran from 21 September 2013 to 18 May 2014 at the Göta Lejon in Stockholm, with Patrik Martinsson as Tick/Mitzi, Björn Kjellman as Bernadette, Erik Høiby as Adam/Felicia, and Pernilla Wahlgren as one of the Divas.\nArgentina (2014–15)\nA non-replica staging premiered on 5 February 2014 at the Teatro Lola Membrives, Buenos Aires, starring Alejandro Paker as Tick/Mitzi, Pepe Cibrián Campoy as Bernadette, and Juan Gil Navarro as Adam/Felicia. The Buenos Aires production closed on 31 August 2014 and then was transferred to Teatro Candilejas in Villa Carlos Paz, with Alejandro Paker reprising as Tick/Mitzi, Moria Casán as Bernadette, and Diego Ramos as Adam/Felicia.\nAthens (2014)\nIn Greece the show opened on 6 May 2014 at the Badminton Theater in Athens, where it ran until 15 June 2014, with Giorgos Kapoutzidis as Tick/Mitzi, Fotis Sergoulopoulos as Bernadette, and Panagiotis Petrakis as Adam/Felicia. After an hiatus, the production returned to the Badminton Theater from 26 September to 5 October 2014.\nManila and Singapore (2014)\nA non-replica production ran from 9 May to 13 July 2014 at the Newport Performing Arts Theater in Resorts World Manila, with Leo Tavarro Valdez as Tick/Mitzi, Jon Santos as Bernadette, and Red Concepción as Adam/Felicia.\nAfter a limited engagement from 16 to 26 October 2014 at the Resorts World Theatre in Sentosa, Singapore, the production came back to the Newport Performing Arts Theater in Manila from 28 November to 7 December 2014.\nSeoul (2014)\nJo Kwon from the band 2AM played Adam in a Korean production which ran from 3 July to 28 September 2014 at the LG Arts Center in Seoul.\nSpain (2014–2018)\nIn Spain Priscilla premiered on 2 October 2014 at the Nuevo Teatro Alcalá, Madrid, with Jaime Zataraín as Tick/Mitzi, Mariano Peña and José Luis Mosquera alternating as Bernadette, Christian Escuredo as Adam/Felicia, David Venancio Muro as Bob, Rossana Carraro, Patricia del Olmo and Aminata Sow as The Divas, Susan Martín as Marion, Cristina Rueda as Shirley, Etheria Chan as Cynthia, and Alejandro Vera as Miss Understanding.\nAfter the show closed in Madrid on 28 February 2016, the production embarked on a national tour, opening on 5 August 2016 at the Teatro Jovellanos in Gijón and finishing on 25 February 2018 at the Teatro Principal in Vitoria-Gasteiz.\nItaly (2015)\nAnother Italian tour kicked off on 27 May 2015 at the Teatro Manzoni in Milan, starring Cristian Ruiz as Tick/Mitzi, Marco D'Alberti as Bernadette, and Riccardo Sinisi as Adam/Felicia. The tour played its final performance on 8 November 2015 at the Teatro Coccia in Novara.\nUK National Tour (2015–16)\nA second UK tour started on 25 August 2015 at the Opera House in Manchester, with Jason Donovan and Duncan James (and Darren Day from February 2016) alternating as Tick/Mitzi, Simon Green as Bernadette, and Adam Bailey as Adam/Felicia, and closed on 18 June 2016 at the New Theatre in Oxford, including stops in London (at the New Wimbledon Theatre from 5 to 10 October 2015) and Amsterdam (at the Koninklijk Theater Carré from 10 to 22 November 2015). After the tour ended, the production was transferred to Israel for a limited engagement at the Menora Mivtachim Arena, Tel Aviv from 4 to 9 July 2016.\nNorwegian Epic Cruise Ship\nIn October 2015, an adapted, shorter version of Priscilla premiered onboard Norwegian Cruise Lines cruise ship Norwegian Epic.\nAuckland (2016)\nEight years after the first run in Auckland, the show returned to the Civic Theatre from 16 October to 13 November 2016, starring Bryan West as Tick/Mitzi, Simon Green as Bernadette, and André Torquato as Adam/Felicia.\nTokyo (2016)\nFrom 8 to 29 December 2016, Priscilla ran at the Nissay Theatre, Tokyo, with Ikusaburo Yamazaki as Tick/Mitzi, Takanori Jinnai as Bernadette, and Yunhak from Supernova and Keita Furuya alternating as Adam/Felicia.\nParis (2017–2018)\nThe show ran at the Casino de Paris from 25 February 2017 to 7 July 2018, starring Laurent Bàn as Tick/Mitzi, David Alexis as Bernadette, and Jimmy Bourcereau as Adam/Felicia.\nAfter closing in Paris, the production was expected to embark on a national tour, set to launch in January 2019, but it was cancelled due to poor ticket sales.\nSouth Africa and Hong Kong (2017)\nA South African production ran at the Cape Town Artscape Theatre from 28 March to 23 April 2017, and at the Johannesburg's Teatro at Montecasino from 28 April to 18 June 2017, with Daniel Buys as Tick/Mitzi, David Dennis as Bernadette, and Phillip Schnetler as Adam/Felicia.\nFollowing the season in South Africa, the production was transferred to the Lyric Theatre in the Hong Kong Academy for Performing Arts from 29 September to 22 October 2017.\nMunich and St. Gallen (2017–2021)\nFrom 14 December 2017 to 12 April 2018, a non-replica production ran at the Gärtnerplatztheater, Munich, with Armin Kahl as Tick/Mitzi, Erwin Windegger as Bernadette, and Terry Alfaro as Adam/Felicia, before transferring to the Theater St. Gallen, Switzerland, from 23 February to 31 May 2019. Additional engagements included new runs at both the Gärtnerplatztheater (15 to 24 July 2019, 4 to 16 February 2020, and 21 to 31 October 2021) and the Theater St. Gallen (15 September 2019 to 4 January 2020).\nAustralia (2018)\nA tour to commemorate the 10th anniversary of the show began performances on 21 January 2018 at the Regent Theatre in Melbourne, with David Harris as Tick/Mitzi, Tony Sheldon reprising his role of Bernadette, and Euan Doidge as Adam/Felicia. After visiting the Capitol Theatre in Sydney and the Festival Theatre in Adelaide, the production played its final performance on 4 November 2018 at the Lyric Theatre in Brisbane.\nItaly (2018–2020)\nAnother Italian tour started on 15 December 2018 at the Creberg Teatro in Bergamo, starring Cristian Ruiz as Tick/Mitzi, Manuel Frattini as Bernadette, and Mirko Ranù as Adam/Felicia, and finished on 21 April 2019 at the Gran Teatro Morato in Brescia. After an hiatus, the tour restarted on 12 December 2019 at the Teatro Brancaccio in Rome, with Cristian Ruiz reprising as Tick/Mitzi, Simone Leonardi as Bernadette, and Pedro Antonio Batista González as Adam/Felicia, and concluded on 16 February 2000 at the Teatro Municipal in Reggio Emilia.\nTokyo (2019)\nThree years after its Japanese debut, Priscilla returned to the Nissay Theatre, Tokyo, for a second limited engagement from 9 to 30 March 2019, with the same lead cast.\nUK National Tour (2019–2021)\nOn 5 September 2019 a non-replica UK tour launched at the Orchard Theatre, Dartford, starring Joe McFadden as Tick/Mitzi, Miles Western as Bernadette, Nick Hayes as Adam/Felicia, Daniel Fletcher as Bob, Claudia Kariuki, Rosie Glossop, and Aiesha Pease as The Divas, Miranda Wilford as Marion, Jacqui Sanchez as Cynthia, and Kevin Yates as Miss Understanding. This version of the show was produced by Jason Donovan and includes new designs by Phil R Daniels and Charles Cusick Smith, lighting by Ben Cracknell, sound by Ben Harrison, musical supervision by Stephen 'Spud' Murphy and Richard Weeden, musical direction by Sean Green, choreography by Tom Jackson-Greaves, and direction by Ian Talbot OBE. On 15 March 2020, the tour was suspended due to the COVID-19 pandemic and did not reopen until 21 June 2021, having its final performance on 6 November 2021 at the Theatre Royal, Glasgow.\nLinz (2022)\nA a non-replica production ran from 1 January to 10 June 2022 at the Landestheater, Linz, with Karsten Kenzel as Tick/Mitzi, David Arnsperger as Bernadette and Gernot Romic as Adam/Felicia.\nHelsinki (2022–2023)\nFrom 25 August 2022 to 6 May 2023, a non-replica production ran at the Helsinki City Theatre, starring Lauri Mikkola as Tick/Mitzi, Clarissa Jäärni as Bernadette and Niki Rautén as Adam/Felicia.\nWroclaw (2022–)\nA non-replica production premiered at the Capitol Theater in Wrocław on 8 October 2022, with an audience preview the night before. Mitzi/Tick is portrayed by Albert Pyśk and Michał Zborowski, Bernadette by Justyna Antoniak and Justyna Szafran, and Adam/Felicia by Rafał Derkacz.\nPriscilla the Party! (2024)\nAn immersive version of the show, Priscilla the Party!, also directed by Simon Phillips, opened on 25 March 2024 at HERE at Outernet in London, with Owain Williams as Tick/Mitzi, Dakota Starr as Bernadette and Reece Kerridge as Adam/Felicia. The show closed on 26 May 2024, four months earlier than expected due to financial difficulties.\nMexico City (2024–)\nA non-replica production premiered on 2 August 2024 at the Centro Teatral Manolo Fábregas in Mexico City, starring Jesús Zavala as Tick/Mitzi, Alejandra Bogue and Roshell Terranova alternating as Bernadette, and José Peralta as Adam/Felicia.\nSpain (2024–2025)\nA second Spanish production ran from 3 October 2024 to January 18 2025 at the Teatre Tívoli, Barcelona, with Víctor González as Tick/Mitzi, Sharonne as Bernadette, Daniel Garod as Adam/Felicia, Esteban Oliver as Bob, Rossana Carraro, Anna Lagares and Paula Moncada as The Divas, Sara Navacerrada as Marion, Malia Conde as Shirley, Etheria Chan as Cynthia, and Raúl Maro as Miss Understanding. Following the closing in Barcelona, the production toured Spain from January to April 2025.\nTel Aviv (2025–)\nA multi million shekel production based on the Latent Image/Specific Films Motion Picture Distributed by Metro-Goldwyn-Mayer Inc. developed for the stage and originally directed by Simon Phillips, adapted to Hebrew by Eli Bijaoui and directed by Moshe Kepten, premiered on 15 March 2025 at the national theater of Israel, Habima. The play is presented through special arrangement with Theatrical Rights Worldwide.\nThe production stars Lee Biran/Ido Rosenberg as Tick/Mitzie, Yehezkel Lazarov as Bernadette, Michael Ben David as Adam/Felicia and actor Tal Kalay (known as drag queen \"Talula\") as Miss Understanding and cover Bernadette\nMusical numbers\nOriginal Australian and New Zealand production\nAct I\n*Overture – Orchestra\n*Downtown – The Divas and Company\n*I've Never Been to Me — Tick and the Divas\n*What's Love Got to Do with It? – Miss Understanding\n*Don't Leave Me This Way – Bernadette, Tick and Company (†)\n*Venus – Felicia and the Boys\n*Go West – Bernadette, Tick, Adam and Company\n*I Say a Little Prayer – Tick and the Divas\n*I Love the Nightlife – Shirley, Bernadette, Mitzi, Felicia and Company (†)\n*Both Sides, Now – Bernadette, Tick and Adam\n*Follie! Delirio vano è questo! Sempre libera (from La traviata) – Felicia and the Divas\n*Colour My World – Adam, Tick, Bernadette and Company\n*I Will Survive – Bernadette, Adam, Tick, Jimmy and Company\nAct II\n*Thank God I'm a Country Boy – The Company\n*A Fine Romance – Young Bernadette and Les Girls\n*Shake Your Groove Thing – Mitzi, Bernadette, Felicia and the Divas\n*Pop Muzik – Cynthia and Company\n*A Fine Romance (reprise) – Bob\n*Girls Just Wanna Have Fun – The Divas and Adam\n*Hot Stuff – Felicia, the Divas and Bernadette\n*MacArthur Park – Bernadette, Tick, Adam and Company\n*Boogie Wonderland – Marion and Company\n*The Morning After – Mitzi, Bernadette, Felicia and the Divas\n*Go West (reprise) – Adam (*)\n*Always on My Mind – Tick and Benjamin\n*Confide in Me – Felicia (^)\n*We Belong – Felicia, Mitzi and Bernadette\n*Finally / Shake Your Groove Thing / Hot Stuff / I Love the Nightlife / I Will Survive – The Company\nAmendments for the West End production\n* (†) \"I Say a Little Prayer\" is the fifth number, and is again reprised as the ninth number of the show in the West End production. This, therefore, means that each number (from the fifth number onwards) in Act I is one number delayed. This gives a total of fourteen numbers in Act I of the West End production.\n* (*) \"Go West (reprise)\" is replaced by \"Come into My World\" in the West End production.\n* (^) Although replaced by \"Kylie Medley\" in the West End production, \"Confide in Me\" appears in that medley.\nBroadway and Internationally\nAct I\n*Overture – Orchestra\n*It's Raining Men – The Divas, Tick and Company\n*What's Love Got to Do with It? – Miss Understanding\n*I Say a Little Prayer – Tick\n*Don't Leave Me This Way – Bernadette, Tick and Company\n*Material Girl – Felicia and the Boys\n*Go West – Bernadette, Tick, Adam and Company\n*Holiday / Like a Virgin* – Adam, Tick and Bernadette\n*I Say a Little Prayer (reprise)* – Tick and The Divas\n*I Love the Nightlife – Shirley, Bernadette, Mitzi, Felicia and Company\n*True Colors – Bernadette, Mitzi and Felicia\n*Follie! Delirio vano è questo! Sempre libera (from La traviata) – Felicia and the Divas\n*Colour My World – Adam, Tick, Bernadette and Company\n*I Will Survive – Bernadette, Felicia, Mitzi, Jimmy and Company\nAct II\n*Thank God I'm a Country Boy* – The Company\n*A Fine Romance – Young Bernadette and Les Girls\n*Thank God I'm a Country Boy (reprise)* – The Company\n*Shake Your Groove Thing – Mitzi, Bernadette, Felicia and the Divas\n*Pop Muzik – Cynthia and Company\n*A Fine Romance (reprise) – Bob\n*Girls Just Wanna Have Fun – Adam and the Divas\n*Hot Stuff – Felicia, The Divas, and Bernadette\n*MacArthur Park – Bernadette, Tick, The Divas and Company\n*Boogie Wonderland* – The Company\n*The Floor Show* – Mitzi, Bernadette, Felicia and Company\n*Always on My Mind/I Say a Little Prayer – Tick, Benji\n*Like a Prayer – Felicia and Company\n*We Belong – Felicia, Mitzi, Bernadette and Company\n*Finally (Finale) – The Company\n* – Song does not appear on Original Broadway Cast Recording.\nUK Tour\nAct I\n*Overture – Orchestra\n*Downtown – The Divas, Tick and Company\n*It's Raining Men – The Divas, Tick and Company\n*I've Never Been to Me – The Divas and Tick\n*What's Love Got to Do with It? – Miss Understanding\n*I Say a Little Prayer – Tick\n*Don't Leave Me This Way – Bernadette, Tick and Company\n*Venus – Felicia and the Boys\n*Go West – Bernadette, Tick, Adam and Company\n*I Say a Little Prayer (reprise)* – Tick and The Divas\n*I Love the Nightlife – Shirley, Bernadette, Mitzi, Felicia and Company\n*True Colors – Bernadette, Mitzi and Felicia\n*Follie! Delirio vano è questo! Sempre libera (from La traviata) – Felicia and the Divas\n*Colour My World – Adam, Tick, Bernadette and Company\n*I Will Survive – Bernadette, Felicia, Mitzi, Jimmy and Company\nAct II\n*Thank God I'm a Country Boy* – The Company\n*A Fine Romance – Young Bernadette and Les Girls\n*Thank God I'm a Country Boy (reprise)* – The Company\n*Shake Your Groove Thing – Mitzi, Bernadette, Felicia and the Divas\n*Pop Muzik – Cynthia and Company\n*A Fine Romance (reprise) – Bob\n*Girls Just Wanna Have Fun – Adam and the Divas\n*Hot Stuff – Felicia, The Divas, and Bernadette\n*MacArthur Park – Bernadette, Tick, The Divas and Company\n*Boogie Wonderland* – The Company\n*The Floor Show* – Mitzi, Bernadette, Felicia and Company\n*Always on My Mind/I Say a Little Prayer – Tick, Benji\n*Confide in Me – Felicia and Company\n*We Belong – Felicia, Mitzi, Bernadette and Company\n*Finally (Finale) – The Company\n10th Anniversary Australian Production 2018\nAct I\n*Overture – Orchestra\n*It's Raining Men – The Divas, Tick and Company\n*What's Love Got to Do with It? – Miss Understanding\n*I Say a Little Prayer – Tick\n*Don't Leave Me This Way – Bernadette, Tick and Company\n*Better The Devil You Know – Felicia and the Boys (†)\n*Go West – Bernadette, Tick, Adam and Company\n*Go West/The Locomotion/Can't Get You Out of My Head – Bernadette, Tick, Adam\n*I Say a Little Prayer – Tick and the Divas\n*I Love the Nightlife – Shirley, Bernadette, Mitzi, Felicia and Company\n*True Colors – Bernadette, Tick and Adam\n*Follie! Delirio vano è questo! Sempre libera (from La traviata) – Felicia and the Divas\n*Colour My World – Adam, Tick, Bernadette and Company\n*I Will Survive – Bernadette, Adam, Tick, Jimmy and Company\nAct II\n*Thank God I'm a Country Boy* – The Company\n*A Fine Romance – Young Bernadette and Les Girls\n*Thank God I'm a Country Boy (reprise)* – The Company\n*Shake Your Groove Thing – Mitzi, Bernadette, Felicia and the Divas\n*Pop Muzik – Cynthia and Company\n*A Fine Romance (reprise) – Bob\n*Girls Just Wanna Have Fun – Adam and the Divas\n*Hot Stuff – Felicia, The Divas, and Bernadette\n*MacArthur Park – Bernadette, Tick, The Divas and Company\n*Boogie Wonderland* – The Company\n*The Floor Show* – Mitzi, Bernadette, Felicia and Company\n*Always on My Mind/I Say a Little Prayer – Tick, Benji\n*Kylie Medley/Confide in Me – Felicia and Company\n*We Belong – Felicia, Mitzi, Bernadette and Company\n*Finally (Finale) – The Company\n* (†) Replace Venus from the Original Production which was replaced by Material Girl in the International Productions.\nRecordings\nA cast recording of the original Australian production was released on 29 September 2007; both in stores and on the Australian iTunes. All songs, with the exception of the reprise of \"Go West\", from the original Australian production are present on the recording and are performed by the original Australian cast. A Broadway cast recording was released on 5 April 2011.\nCritical reception\nIn reviewing the West End production, the London Evening Standard (thisislondon) reviewer wrote: \"From the first moments when three divas hang suspended high above a silver-spangled bridge and belt out Downtown, the show never loses its spectacular, helter-skelter momentum of songs to which the drag queens lip-sync.\"\nReviews for the Toronto production include praise for the costumes from the Globe and Mail: \"The costumes designed by Tim Chappel and Lizzy Gardiner, the same team that won an Oscar for the movie, are a fabulous mix of Village People meet Tim Burton culminating in, at the curtain call, a whole crass menagerie of dragged-up koalas and 'roos.\" The Star favorably wrote: \"This eye-popping, ear-pleasing, toe-tapping honey of a show moves like a cyclone from start to finish and will leave you gasping for breath on numerous occasions, thanks to its spectacular spectacle, its raunchy humour and its virtuoso performances.\"\nDispute over use of recorded music\nUse of a recorded string section in the Broadway production of Priscilla led to a dispute between producers and the American Federation of Musicians (AFM). The AFM argues that using recordings in place of live music is a marginal cost-saving measure which cheats audiences of the full, rich sound of a live orchestra. Producers argued that the artistic conception of the show requires a \"synthetic pop flavor\" that can only be achieved with recorded music. AFM member Scott Frankel, who composed the music for Grey Gardens, stated: \"What is most special about seeing a Broadway musical, rather than some other art form, is the interaction between the orchestra musicians and the performers onstage\".\nAwards and nominations\nOriginal Sydney production\n{| class=\"wikitable\" width=\"95%\"\n|-\n! width=\"5%\"| Year\n! width=\"25%\"| Award\n! width=\"40%\"| Category\n! width=\"20%\"| Nominee\n! width=\"10%\"| Result\n|-\n| rowspan=4|2008\n| rowspan=3|Sydney Theatre Awards\n| colspan=2|Best Production of a Musical\n|\n|-\n| rowspan=2|Best Performance by an Actor in a Musical\n| Todd McKenney\n|\n|-\n| Tony Sheldon\n|\n|-\n| ARIA Music Awards\n| colspan=2|Best Original Soundtrack or Musical Theatre Cast Album\n|\n|-\n|}\nOriginal West End production\n{| class=\"wikitable\" style=\"width:95%;\"\n|-\n! style=\"width:5%;\"| Year\n! style=\"width:20%;\"| Award\n! style=\"width:45%;\"| Category\n! style=\"width:20%;\"| Nominee\n! style=\"width:10%;\"| Result\n|-\n| rowspan=3|2010\n| rowspan=3|Laurence Olivier Award\n| colspan=2|Best New Musical\n|\n|-\n| Best Actor in a Musical\n| Tony Sheldon\n|\n|-\n| Best Costume Design\n| Tim Chappel and Lizzy Gardiner\n|\n|}\nOriginal Broadway production\n{| class=\"wikitable\" style=\"width:95%;\"\n|-\n! style=\"width:5%;\"| Year\n! style=\"width:20%;\"| Award\n! style=\"width:45%;\"| Category\n! style=\"width:20%;\"| Nominee\n! style=\"width:10%;\"| Result\n|-\n| rowspan=14|2011\n| rowspan=2|Tony Award\n| Best Performance by a Leading Actor in a Musical\n| Tony Sheldon\n|\n|-\n| Best Costume Design\n| Tim Chappel and Lizzy Gardiner\n|\n|-\n| rowspan=4|Drama Desk Award\n| colspan=2|Outstanding Musical\n|\n|-\n| Outstanding Book of a Musical\n| Allan Scott and Stephan Elliott\n|\n|-\n| Outstanding Actor in a Musical\n| Tony Sheldon\n|\n|-\n| Outstanding Costume Design\n| Tim Chappel and Lizzy Gardiner\n|\n|-\n| rowspan=4|Outer Critics Circle Award\n| colspan=2|Outstanding New Broadway Musical\n|\n|-\n| Outstanding Actor in a Musical\n| Tony Sheldon\n|\n|-\n| Outstanding Costume Design\n| Tim Chappel and Lizzy Gardiner\n|\n|-\n| Outstanding Choreographer\n| Ross Coleman\n|\n|-\n| Drama League Award\n| colspan=2| Distinguished Production of a Musical\n|\n|-\n| rowspan=2|Astaire Award\n| Outstanding Male Dancer in a Broadway Show\n| Nick Adams\n|\n|-\n| Outstanding Female Dancer in a Broadway Show\n| J. Elaine Marcos\n|\n|-\n| colspan=2|Theatre World Award\n| Tony Sheldon\n|\n|-\n|}\nReferences\nExternal links\n*\n* [http://www.priscillathemusical.com/ Official website]"
    }
  ]
}