{
  "content": [
    {
      "type": "text",
      "text": "# Prisons in ancient Rome__disambig_1\n\nImprisonment in ancient Rome was not a sentence under Roman law. Incarceration (publica custodia) in facilities such as the Tullianum was intended to be a temporary measure prior to trial or execution. More extended periods of incarceration occurred but were not official policy, as condemnation to hard labor was preferred.\nDetention\nDetention is mentioned in the Twelve Tables, Rome's earliest legal code (mid-5th century BC), and throughout juristic texts. \"Detention,\" however, includes debt bondage in the early Republic; and the wearing of chains (vincula publica), mainly for slaves and convict labor.\nIncreasingly during the Imperial era, a long-term sentence, often for life, was hard labor at the mills, mines, or quarries, which might be privately or publicly owned. Slaves or lower-status citizens sentenced to hard labor were held in camps at these worksites, which employed a combination of free, enslaved, and convict labor. On large commercial agricultural estates (latifundia, sometimes compared to plantations), enslaved laborers who had offered resistance were kept chained in semi-underground places of imprisonment called ergastula.\nPrison facilities\nThe first Roman prison was said to have been built by Ancus Marcius and enlarged by Servius Tullius, during the semilegendary period of the Roman kings. The Porticus Argonautarum, built by Agrippa on the Campus Martius, is thought by some to have been used as a temporary prison. Among other structures used as prisons in Rome, only that built by Augustus and named after Octavia has left considerable ruins. The prison in Alba Fucens is described as dark, underground, and small. The most famous place of incarceration was the Mamertine Prison.\nThe tresviri or triumviri capitales  oversaw prisons and executions, along with other functions that, as Andrew Lintott notes, show them to have been \"a mixture of police superintendents and justices of the peace,\" playing some role also in administering prison guards. The capitales were first established around 290–287 BC and were supervised by the urban praetor.\nConditions and design\nThe prisons were filthy, poorly ventilated, and were underground. The prisons would be divided into outer and inner areas. The inner parts of the prison were more secure and darker. Prison would not have had individual cells. They would have had groups of prisoners chained together in different rooms. Prisons would often times be very crowded. The prisons were designed to psychologically and physically torture a prisoner into confessing. Emperor Valens drafted a law which required the confession to be submitted in written form. The prisons would also be designed to strip the prisoner of dignity. There was very little rations in the prison, because friends and family were expected to supply the prisoners needs.  The Christian Church would provide charity to prisoners. Emperor Constantine regulated the amount of charity the Christians could provide. A Bishop would have the right to administer prisons according to Canon law. The presence of Christian priests in prisons reminded the guards to treat the prisoners well, although the prisoners still lived in horrible conditions. The prisoners were not segregated by gender.\nReferences"
    }
  ]
}