{
  "content": [
    {
      "type": "text",
      "text": "# Prishantha Gunawardena\n\nSri Lankan\n| signature      =\n| website        =\n}}\nPrishantha Gunawardena (Sinhala:ප්‍රිශාන්ත ගුණවර්ධන) (born on 1964) is a leading archeologist and writer of Sri Lanka. He is renowned for the archeological excavations done in the birthplace of Buddha. He is also interested in Cultural Resource Management, Tourism, Urbanism, Architecture and Ethno-archaeology.\nEarly life\nProf. Prishantha was born on 1964 at Minneriya, to a middle class business family as the youngest of 6 children. His father was a businessman, who travelled to Hingurakgoda, a city near Polonnaruwa for his business matters.\nPrishantha first attended to Minneriya National College. After grade 5 scholarship exam, he was able to come Kandy and attended to Dharmaraja College, Kandy. But, after few years of education, he again went to Minneriya National College and finished his ordinary level and advanced level. He was a sporty character at the school, who participated for Elle and won all-island competitions as well.\nIn 1985, he entered University of Kelaniya and studied Archaeology, under Prof. Senaka Bandaranayake. At the school, and also in the university, Prishantha was a bright student with lot of talents. He played shot put, discus throwing and 100m running events at the university.\nIn Archaeology\nIn 1988, Prishantha participated for excavations in Aluthnuwara, near Anuradhapura, with his teacher prof. Senaka Bandaranayake, as a crew member. The crew also consists with well known Archaeologist, Prof. Robin Cunningham, where he completing his master's degree. The excavations underwent 3 years, and many new archaeological findings were found.\nAfter finishing degree, he acted as an assistant lecturer of archaeology in University of Kelaniya. After his marriage in 2000, he went Bradford University in England for completing his master's degree. His topic was \"development in Buddhist monasteries towards urbanization\". His consultant was his past friend, Prof. Robin Cunningham. He had to wait 8 years for completing his master's degree in 2008.\nIn 2003, Prof. Prishantha was appointed as head of the Archaeological Department of University of Kelaniya. In 2004, Prishantha started a 9 years long excavation research. The research was granted with many international universities, such as University of Kelaniya, Durham University, Bradford University, Lester University, University of Stirling, Maharaja Sayajirao University of Vadodara, with hundreds of archeologists, botanists, chemists, physicists, and sociologists. The research was about \"rural life existed in Anuradhapura kingdom\".\nIn 2007, he established a separate subject for human sciences in the Department, as Anthropology. Also he converted archaeology for post-graduate degrees as well, with 88 students.\nHe married Chathuri Bandaranayake in 2000, and he has two daughters and one son.\nReferences\n* https://web.archive.org/web/20121212005204/http://www.kln.ac.lk/social/arch/prishanta.php\n* http://www.saarcculture.org/index.php?option=com_content&view=article&id=248\n* [https://web.archive.org/web/20131126002035/http://news.nationalgeographic.com/news/2013/11/131125-buddha-birth-nepal-archaeology-science-lumbini-religion-history/ ]\nExternal links\n* [https://archives.sundayobserver.lk/2006/08/27/pow07.asp ]\n* http://antiquity.ac.uk/ant/087/ant0871104.htm"
    }
  ]
}