{
  "content": [
    {
      "type": "text",
      "text": "# Proclamation of the Republic (Brazil)\n\n}}\n| result            = Republican victory:\n| combatant1        = Republicans\n| combatant2        =\n| commander1        = Deodoro da Fonseca\n| commander2        =\n| casualties2       = 1 wounded\n}}\nThe Proclamation of the Republic (), Coup of 1889 (Golpe de 1889), or Coup of the Republic (Golpe da República), or Foundation of the Republic (Fundação da República) was a military coup d'état that established the First Brazilian Republic on November 15, 1889. It took over the constitutional monarchy of the Empire of Brazil and ended the reign of Emperor Pedro II.\nThe coup took place in Rio de Janeiro, the capital of the Empire at the time, when a group of military officers of the Imperial Army, led by Marshal Deodoro da Fonseca, staged a coup d'état without the use of violence, deposing Emperor Pedro II and the President of the Council of Ministers of the Empire, the Viscount of Ouro Preto.\nA provisional government was established that same day, 15th of November, with Marshal Deodoro da Fonseca as President of the Republic and head of the interim Government.\nBackground\nAllegory of the Republic (1896), painting by Manuel Lopes Rodrigues in the Bahia Art Museum\nFrom the 1870s, in the aftermath of the Paraguayan War (also called the War of the Triple Alliance, 1864-1870), some sectors of the elite transitioned into opposition to the current political regime. Factors that influenced this movement included:\n* Emperor Pedro II had no male children, only daughters. The throne would be occupied, after his death, by his eldest daughter, Isabel, Princess Imperial of Brazil, married to a Frenchman, Prince Gaston, Count of Eu, which generated fear among some elites that the country would be ruled by a foreigner.\n* The slaveholding agrarian elite resented the abolition of slavery, which they considered to be a personal desire of the imperial family.\n* The positivist and republican ideas of Auguste Comte spread among members of the Imperial Brazilian Army, increasing resentment of the monarchy.\nPolitical situation in 1889\nThe 37th and last ministerial cabinet of the imperial government was inaugurated on June 7, 1889, under the command of the President of the Council of Ministers of the Empire, Afonso Celso de Assis Figueiredo, the Viscount of Ouro Preto of the Liberal Party. Finding himself in a difficult political situation, he presented a program of political reforms to the Chamber of Deputies in a last desperate attempt to save the Empire. These reforms included, among others, the following measures: greater autonomy and administrative freedom for the provinces (a federal system), universal suffrage, freedom of education, reduction the Council of State's powers, and non-lifelong mandates for the Imperial Senate. His proposals aimed at preserving the monarchical regime in the country, but they were vetoed by the majority of conservative deputies who controlled the General Chamber. On 15 November 1889, the republic was proclaimed by the positivist troops, with the support of the agrarian elite, who resented not being compensated for the loss of their slaves after abolition.\nLoss of prestige of the monarchy\nThere were many factors that led the Empire to lose the support of its economic and military bases. On the part of the conservative groups, by the serious friction with the Catholic Church; by the loss of the political support from the large landowners due to the abolition of slavery in 1888, which occurred without the compensation of the slaveholders.\nOn the part of the progressive groups, there was the criticism that the monarchy had maintained, until very late, slavery in the country (Brazil being the last country in the Americas to abolish it). Progressives also criticized the absence of initiatives aimed at the economic, political or social development of the country, the maintenance of a political regime of caste and census voting, that is, based on the annual income of the people, the absence of a system of universal education, high rates of illiteracy and misery, and the political withdrawal of Brazil from all other countries on the continent, which were republican.\nThus, at the same time that imperial legitimacy was declined, the republican proposal - perceived as meaning social progress - gained space. However, it is important to note that the Emperor's legitimacy was distinct from that of the imperial regime: While, on the one hand, the population generally respected and loved Emperor Pedro II, on the other hand, it less and less liked the Empire. In this sense, it was a common voice at the time that there would be no third reign, that is, the monarchy would not continue to exist after the death of Pedro II, whether due to the lack of political support of the monarchical regime itself or due to the concerns about the succession by a woman, Princess Isabel, in a still very misogynistic society. The prince consort, husband of Princess Isabel, the French Count d'Eu, was hard of hearing, spoke with a French accent, and, moreover, owned slums in Rio, for which he supposedly collected exorbitant rents from poor people. It was feared that, when Isabel ascended the throne, Brazil would be de facto ruled by a foreigner.\nAlthough the phrase of Aristides Lobo (journalist and republican leader from São Paulo, later made provisional minister), \"The people witnessed bestialized\" to the proclamation of the republic, has entered into history, more recent historical research has given another version to the acceptance of the republic among the Brazilian people. This is the case of the thesis defended by Maria Tereza Chaves de Mello (A República Consentida, FGV Publisher, EDUR, 2007), which indicates that the republic, before and after the proclamation, was popularly seen as a political regime that would bring about development, in a broad sense, to the country, although the common people did not want to change the regime of government.\nAbolitionist issue\n'' to the proclamation of the Brazilian Republic]]\nAfter the abolition of the Brazilian slave trade in 1850, the issue of complete abolition of slavery in Brazil became a subject of significant debate, facing resistance among the country's traditional agrarian elites. The Empire had adopted measures that would lead to the gradual extinction of the slave regime, but the elites, watching with concern the events of the American Civil War, demanded from the State reparations proportional to the total price they had paid for their slaves.\nHowever, the Empire proceeded with abolishing slavery via the Golden Law (1888), and large landowners turned on the emperor and his regent, losing them their last pillar of support in Brazil. Former slaveholders joined the Republican cause not out of actual anti-imperial sentiment but as a \"revenge\" against the monarchy, earning them the nickname \"Republicans of the last minute\" or \"Republicans of May 13\".\nThe imperial regime's downfall was in many ways tied to slavery. In the view of the progressives, the Empire of Brazil was very slow to act on slavery, which undoubtedly undermined its legitimacy over the years. Then the former slaveholders, after being denied compensation, turned to the Republican cause.\nShortly after Princess Isabel signed the Golden Law, João Maurício Vanderlei, the only senator of the empire who voted against the project of abolishing slavery, said: \"Her Highness redeemed a race but lost the throne\". However, the Republican and black journalist José do Patrocínio celebrated the princess' action, dubbing her \"The Redeemer\".\nReligious issue\nFrom the colonial period, the Catholic Church, as institution, was submitted to the state. This was maintained after independence and meant, among other things, that no order of the Pope could be enforced in Brazil without having been previously approved by the Emperor (Regal Benefict). In 1872, Vital Maria Gonçalves de Oliveira and Antônio de Macedo Costa, bishops of Olinda and Belém respectively, decided to follow on their own the orders of Pope Pius IX, which excluded the Freemasons from the church. As members of high influence in monarchic Brazil were Freemasons (some books also mention Dom Pedro II himself as a Mason), the bill was not ratified.\nThe bishops refused to obey the law and were arrested. In 1875, thanks to the intervention of the Duke of Caxias, the bishops received an imperial pardon and were released. However, in the episode, the image of the Empire was worn next to the Catholic Church. This was an aggravating factor in the crisis of the monarchy, since the support of the Catholic Church to the monarchy was always essential to its subsistence.\nMilitary issue\nThe military (the Imperial Brazilian Army) was dissatisfied with the prior restraint on speech imposed by the monarchy on military officers, by which its officers could not express themselves in the press without the prior authorization of the Minister of War. The military did not have autonomy of decision-making on the defense of the territory, being subject to the orders of the Emperor and the Cabinet of Ministers, formed by civilians, that they surpassed to the orders of the generals. Thus, in the Empire, most war ministers were civilians.\nIn addition, the Brazilian Army soldiers often felt discredited and disrespected. On the one hand, the rulers of the empire were civilians, whose selection was extremely elitist and whose formation was bachelors, but that resulted in positions highly paid and valued; On the other hand, the military opted for a more democratic and technical selection, but its officers did not receive professional valorization or political, social or economic recognition. Promotions were hard to come by and were based on personal criteria rather than on merit and/or seniority.\nThe Paraguayan War, in addition to spreading republican ideals, showed the military this devaluation of the professional career, which continued and even intensified after the end of the war. The result was the perception, on the part of the military, that they sacrificed themselves for a regime that little considered them and that gave more attention to the Navy of Brazil. Simultaneously the military suffered a strong positivist influence that spread to the military schools. They became desirous of a strong republic headed by a dictator.\nRepublican and positivist actions\nDuring the Paraguayan War, the Brazilian military's contact with the reality of its South American neighbors led them to reflect on the relationship between political regimes and social problems. From this, a greater interest for the republican ideal and Brazilian economic and social development began to develop, both among the career military and among the civilians called to fight in the conflict.\nThus, it was no coincidence that Republican propaganda had, by its initial mark, the publication of the  in 1870 (the year in which the Paraguayan War ended), followed by the  in 1873 and the emergence of Republican clubs, which multiplied, since then, in the main centers in the country.\nIn addition, various groups were heavily influenced by Freemasonry (Deodoro da Fonseca was a Freemason, as well as his entire ministry) and Auguste Comte's positivism, especially after 1881, when the  emerged. Its directors, Miguel Lemos and Raimundo Teixeira Mendes, initiated a strong abolitionist and republican campaign.\nRepublican propaganda was carried out by what were later called \"historic Republicans\" (as opposed to those who became Republicans only after November 15, called \"Nov. 16 Republicans\").\nThe ideas of many of the republicans were published by the newspaper The Republic. According to some researchers, Republicans were divided into two main streams:\n* The evolutionists, who admitted that the proclamation of the republic was inevitable, not justifying an armed struggle;\n* The revolutionists, who defended the possibility of taking up arms to conquer it, with popular mobilization and with social and economic reforms.\nAlthough there were differences between each of these groups as regards the political strategies for the implementation of the republic and also the substantive content of the regime to be established, the general idea common to both groups were that the republic should be a progressive, opposed to the \"exhausted\" monarchy. Thus, the proposal of the new regime was of a revolutionary social character and not only of a mere exchange of rulers.\nMilitary coup of November 15, 1889\nIn Rio de Janeiro, Republicans insisted that Marshal Deodoro da Fonseca, a monarchist, head the revolutionary movement that would replace the monarchy with the republic.\nAfter much insistence from the revolutionaries, Deodoro da Fonseca agreed to lead the military movement.\nAccording to historical accounts, on November 15, 1889, commanding a few hundred soldiers moving through the streets of Rio de Janeiro, Marshal Deodoro, as well as a large part of the military, intended only to overthrow the then Chief of the Imperial Cabinet (equivalent to the Prime Minister), the Viscount of Ouro Preto. \"The main culprits of all this [the proclamation of the Republic] are Count of Eu and the Viscount of Ouro Preto: the last to persecute the Army and the first to consent to this persecution,\" Deodoro later wrote.\nThe military coup, which was scheduled for November 20, 1889, had to be anticipated. On the 14th, the conspirators issued a rumor that the government had arrested Benjamin Constant Botelho de Magalhães and Deodoro da Fonseca. Later it was confirmed that it was even rumor. Thus, the revolutionaries anticipated the coup, and in the early hours of November 15, Deodoro was willing to lead the movement of army troops that put an end to the monarchist regime in Brazil.\nThe conspirators went to the residence of Marshal Deodoro, who was sick with dyspnea, and they finally convinced him to lead the movement. Apparently decisive for Deodoro was to know that, as of November 20, the new President of the Council of Ministers of the Empire would be Silveira Martins, an old rival. Deodoro and Silveira Martins had been enemies since the time when the marshal had served in Rio Grande do Sul, when both fought for the attention of the Baroness of Triunfo, a very beautiful and elegant widow who, according to the reports of the time, had preferred Silveira Martins. Since then, Silveira Martins did not miss an opportunity to provoke Deodoro from the Senate floor, insinuating that he misused funds and even challenging his effectiveness as a military leader.\nIn addition, Major Frederico Solon de Sampaio Ribeiro had told Deodoro that an alleged arrest warrant had been issued against him, a false argument that finally convinced the old marshal to proclaim the Republic on the 16th and to exile the Imperial Family by night, in order to avoid an eventual popular commotion.\nConvinced that he would be arrested by the imperial government, Deodoro left his residence at dawn on November 15, crossed the Campo de Santana, and on the other side of the park called the soldiers of the battalion there, where the Duke de Caxias Palace is now located, to rebel against the government. They offered a horse to the marshal, who rode on it, and, according to testimony, took off his hat and proclaimed, \"Long live the Republic!\" Then he alighted, crossed the park again, and returned to his residence. The demonstration continued with a parade of troops on Direita street until the Imperial Palace. Recent studies indicate that Marshal Deodoro shouted, \"Long live His Majesty the Emperor!\" however, for until then he was convinced to testify to the cabinet, not to proclaim the republic, and only did so when it was falsely told that his rival would take the Position.\n]]\nThe rioters occupied the headquarters of Rio de Janeiro and then the Ministry of War. They deposed the Cabinet and arrested their president, Afonso Celso de Assis Figueiredo, Viscount Ouro Preto.\nIn the Imperial Palace, Viscount de Ouro Preto, the president of the cabinet (prime minister), had been trying to resist asking the commander of the local detachment and responsible for the security of the Imperial Palace, General Floriano Peixoto, to confront the mutineers, explaining to General Floriano Peixoto that there were enough legalist troops on the scene to defeat the rioters. The Viscount of Ouro Preto reminded Floriano Peixoto that he had faced much more numerous troops in the Paraguayan War. However, General Floriano Peixoto refused to obey the orders given by the Viscount of Ouro Preto and thus justified his insubordination, responding to the Viscount of Ouro Preto:\n}}\nThen, adhering to the republican movement, Floriano Peixoto gave a prison sentence to the head of government.\nThe only one wounded in the episode of the proclamation of the republic was the Baron of Ladario, Minister of the Navy, who resisted the arrest warrant given by the mutineers and was shot. It is said that Deodoro did not address criticism of the Emperor Pedro II and that he hesitated in his words. Despite this, it was known that Deodoro da Fonseca was with Lieutenant Colonel Benjamin Constant at his side and that there were some civilian republican leaders at that time. But Deodoro favored the republic only after the death of the Emperor: \"I would like to carry the coffin of the Emperor,\" he said.\nOn the afternoon of November 15, at the City Hall of Rio de Janeiro, the Republic was solemnly proclaimed.\nAt night, in the Municipal Council of the Neutral Municipality, Rio de Janeiro, José do Patrocínio drafted the official proclamation of the Republic of the United States of Brazil, approved without a vote. The text went to the newspaper charts that supported the cause, and, only the next day, November 16, was announced to the people the change of the political regime of Brazil.\n: the imperial canoe docks at the Navy Arsenal]]\nPedro II, who was in Petrópolis, returned to Rio de Janeiro. Thinking that the aim of the revolutionaries was only to replace the office of Ouro Preto, the Emperor still tried to organize another ministerial cabinet, under the chairmanship of the councilor José Antônio Saraiva. The Emperor, in Petropolis, was informed and decided to go down to the Court. Upon learning of the coup, the Emperor acknowledged the fall of the Ouro Preto Cabinet and sought to announce a new name to replace the Viscount of Ouro Preto. However, since nothing had been said about Republic until then, the most exalted Republicans spread the rumor that the Emperor had chosen Gaspar da Silveira Martins, political enemy of Deodoro da Fonseca since Rio Grande do Sul, to be the new head of government. Deodoro da Fonseca then persuaded himself to join the Republican cause. The Emperor was informed of this and, disillusioned, decided not to offer resistance:\nThe next day, Major Frederico Solon de Sampaio Ribeiro gave Pedro II a communication, informing him of the proclamation of the republic and ordering his departure for Europe, in order to avoid political upheavals. The Brazilian Imperial Family was exiled in Europe, only being allowed to return to Brazil in 1920 by President Epitácio Pessoa.\nProclamation\nThe following is the proclamation of the republic as contained in a message from the United States Ambassador to Brazil, Robert Adams Jr., to James G. Blaine, US Secretary of State:\nReactions\n]]\nDespite Pedro II not showing any will to resist, there was a significant monarchist reaction after the fall of the Empire, which was thoroughly repressed. A few examples can be given. On 17 November 1889, upon hearing the news of the Emperor's fall, the 25th Infantry Battalion resisted by attacking the local Republican Club in Desterro (present-day Florianópolis). They were defeated by Republican militias and policemen and several were killed. Others were executed. According to the source, other battalions across the country also unsuccessfully fought against policemen and militias loyal to the Republic. In Rio de Janeiro, then-the Brazilian capital, on 18 November between 30 and 40 monarchist soldiers rebelled. Other monarchists rebellions occurred in Rio. On 18 December 1889, around 50 men  of the 2nd Artillery Regiment – which had taken part in the proclamation of the republic – rebelled in a restorationist attempt. It led the government to ban freedom of the speech and exile or arrest several monarchist politicians. Another far more serious monarchist rebellion occurred on 14 January 1890, when one cavalry regiment, two infantry regiments, and one artillery battalion attempted to overthrow the republic. It had more than 100 casualties, and 21 officers and soldiers who took part of it were executed and more monarchist politicians were arrested.\nduring the naval revolt (Drawing by L. Tinayre, published at Le Monde Illustré, 1894).]]\nIn 1890, Admiral Balthazar da Silveira paid a visit to New York to thank the United States of America for its prompt recognition of the new Republican regime at the behest of Deodoro da Fonseca.\nIn 1891, the so-called Revolta da Armada, a rebellion movement promoted by units of the Brazilian Navy against the dictatorial government of Deodoro da Fonseca, supposedly supported by the monarchist opposition to the recent installation of the republic, in which the navy threatened to bomb the federal capital, happened in Rio de Janeiro. The Navy, still resented by circumstances and outcomes of the coup that had put an end to the monarchy in Brazil. Again between 1893 and 1894, before the dictatorship and the rights curtailment promoted by the government of Floriano Peixoto, the naval monarchist rebelled against the government. In that episode, the Republicans had aid of the United States Navy to defeat the monarchists.\nThe Federalist Revolution, that occurred from 1893 to 1895, between federalists, monarchists, and even republicans, led by the monarchist leaders Gaspar da Silveira Martins, Custódio de Melo, and Saldanha da Gama against the republican government resulted in the death of 10,000 men.\nThe War of Canudos was a conflict between the state of Brazil and a group of some 30,000 settlers who had founded their own community in the northeastern state of Bahia, named Canudos. After a number of unsuccessful attempts at military suppression, it came to a brutal end in October 1897, when a large Brazilian army force overran the village and killed nearly all the inhabitants. This was the deadliest civil war in Brazilian history. The community of Canudos was led by Antônio Conselheiro, in the interior of the state of Bahia against the great farmers supported by the Republican army. Rumors were created that Canudos was armed to attack neighboring towns and leave for the capital to depose the republican government and reinstall the monarchy. Only 300 survived the massacre caused by Republican Army troops in 1897\nAnother event occurring as a reaction to the Republic was the Revolt of Ribeirãozinho, also called the Ribeirãozinho Revolution. It was a conservative movement of the early 20th century that occurred in the city of Ribeirãozinho (now Taquaritinga), in São Paulo, and whose fundamental objective was the restoration of the monarchy and the coronation of Prince Luiz of Orléans-Braganza, son of Isabel, Princess Imperial of Brazil. Unhappy with the First Brazilian Republic, the São Paulo monarchists had planned an uprising that was supposed to take place on August 23, 1902, and which was to topple then President Campos Sales. In fact, the uprising had only been carried out in Ribeirãozinho and Espírito Santo do Pinhal, a neighboring town. This attempt to restore the monarchy lasted one day.\nReferences\nAdditional reading\n*\n*"
    }
  ]
}