{
  "content": [
    {
      "type": "text",
      "text": "# Prom Queen (Lil Wayne song)\n\n\"Prom Queen\" is the lead single from Lil Wayne's album, Rebirth. The track is produced by Infamous and Andrew \"Drew\" Correa. The song is written by and contains backing vocals from Shanell Woodgett. The song made its official debut on January 27, appearing on Lil Wayne's MySpace page. The following day, \"Prom Queen\" was made available for purchase on all online music stores and Lil Wayne performed the single live for the first time during a concert in San Diego, which was streamed live on AT&T's FREEdom of Choice and Mobile Music Facebook pages that evening. The song features the Auto-Tune effect.\nMusical style\n\"Prom Queen\" is a rap rock song, featuring \"mall-metal riffage\" and Auto-Tuned vocals. The song also incorporates elements from emo, grunge and late-'90s rap-rock.\nMusic video\nThe music video premiered on Jimmy Kimmel Live!. The music video is about a young, high schooler Lil Wayne falling in love with a girl at school, but she denies him for someone else when she became prom queen. As they both age, Wayne becomes famous, while the girl becomes pregnant with the baby of her boyfriend who has left her. Wayne records the song \"Prom Queen\" as newspaper clippings of his life come up, such as his awards at the 2009 Grammy Awards and the major success of his album Tha Carter III. Later, Wayne performs with a Gibson Dark Fire guitar at a concert; Young Money artist Shanell Woodgett, who wrote the song, is also seen together with Wayne. During the concert, the girl who shunned Wayne in high school makes her way to the stage. When she reaches her hand out, hoping for Wayne to remember her, Wayne does remember her, and what she did to him; as a result, Wayne turns around just as they are about to touch hands, showing the girl how it felt when she did the same to him. At the end of the video, Wayne and Shanell are seen at the high school gym; they kiss and leave silently.\nThe video also features the members of nu metal band Korn as Wayne's backup band, as well as Young Money artist Shanell Woodgett and her younger sister, Danity Kane member D. Woods.\nThe video has directed by Dave Meyers.\nChart performance\n\"Prom Queen\" started to make an impact on the charts in early February. It made a \"Hot Shot Debut\" at number 17 on the Billboard Hot 100 based on downloads in the US and rose to number 15 the next week, also a \"Hot Shot Debut\" at number 26 on the Pop 100 and rose to number 22 the next week, and also charted at number 16 on the Bubbling Under R&B/Hip-Hop Singles. In Canada it also made a \"Hot Shot Debut\" at number 71 on the Canadian Hot 100 also based on downloads and skyrocketed up to number 36 the next week.\nCharts\n{| class=\"wikitable sortable plainrowheaders\"\n|+Chart performance for \"Prom Queen\"\n!Chart (2009)\n!Peakposition\n|-\n! scope=\"row\"| Australia (ARIA)\n| style=\"text-align:center;\"|93\n|-\n! scope=\"row\"| Australia Urban (ARIA)\n| style=\"text-align:center;\"|10\n|-\n! scope=\"row\"| Canada (Canadian Hot 100)\n| style=\"text-align:center;\"|36\n|-\n! scope=\"row\"| US Billboard Hot 100\n| style=\"text-align:center;\"|15\n|-\n! scope=\"row\"| US Billboard R&B/Hip-Hop Songs\n| style=\"text-align:center;\"|16\n|-\n! scope=\"row\"| US Billboard Pop 100\n| style=\"text-align:center;\"|22\n|}\nCertifications\nRelease history\n{| class=\"wikitable plainrowheaders\"\n! scope=\"col\"| Region\n! scope=\"col\"| Date\n! scope=\"col\"| Format(s)\n! scope=\"col\"| Label\n! scope=\"col\"|\n|-\n! scope=\"row\" rowspan=\"2\"| United States\n| January 28, 2009\n| Digital download\n| rowspan=\"2\"| Cash Money, Universal Motown\n|\n|-\n| February 3, 2009\n| Contemporary hit radio\n|\n|-\n|}\nReferences"
    }
  ]
}