{
  "content": [
    {
      "type": "text",
      "text": "# Prometheus (software)\n\n| latest release version = v3.2.1\n| latest release date =\n| programming language = Go\n| operating system = Cross-platform\n| genre = Time series database\n| license = Apache License 2.0\n| website =\n| repo =\n}}\nPrometheus is a free software application used for event monitoring and alerting. It records metrics in a time series database (allowing for high dimensionality) built using an HTTP pull model, with flexible queries and real-time alerting. The project is written in Go and licensed under the Apache 2 License, with source code available on GitHub.\nHistory\nPrometheus was developed at SoundCloud starting in 2012, when the company discovered that its existing metrics and monitoring tools (using StatsD and Graphite) were insufficient for their needs. Specifically, they identified needs that Prometheus was built to meet, including a multi-dimensional data model, operational simplicity, scalable data collection, and a powerful query language, all in a single tool. The project was open-source from the beginning and began to be used by Boxever and Docker users as well, despite not being explicitly announced.  Prometheus was inspired by the monitoring tool Borgmon used at Google.\nBy 2013, Prometheus was introduced for production monitoring at SoundCloud. The official public announcement was made in January 2015.\nIn May 2016, the Cloud Native Computing Foundation (CNCF) accepted Prometheus as its second incubated project, after Kubernetes. In August 2018, the CNCF announced that the Prometheus project had graduated.\nVersions\nPrometheus 1.0 was released in July 2016. Subsequent versions were released through 2016 and 2017, leading to Prometheus 2.0 in November 2017.\nArchitecture\nA typical monitoring platform with Prometheus is composed of multiple tools:\n* Multiple exporters typically run on the monitored host to export local metrics.\n* Prometheus to centralize and store the metrics.\n* Alertmanager to trigger alerts based on those metrics.\n* Grafana to produce dashboards.\n* PromQL is the query language used to create dashboards and alerts.\nData storage format\nPrometheus data is stored in the form of metrics, with each metric having a name that is used for referencing and querying it. Each metric can be drilled down by an arbitrary number of key=value pairs (labels). Labels can include information on the data source (which server the data is coming from) and other application-specific breakdown information such as the HTTP status code (for metrics related to HTTP responses), query method (GET versus POST), endpoint, etc. The ability to specify an arbitrary list of labels and to query based on these in real time is why Prometheus' data model is called multi-dimensional.\nPrometheus stores data locally on disk, which helps for fast data storage and fast querying. There is the ability to store metrics in remote storage.\nData collection\nPrometheus collects data in the form of time series. The time series are built through a pull model: the Prometheus server queries a list of data sources (sometimes called exporters) at a specific polling frequency. Each of the data sources serves the current values of the metrics for that data source at the endpoint queried by Prometheus. The Prometheus server then aggregates data across the data sources. Prometheus has a number of mechanisms to automatically discover resources that should be used as data sources.\nPromQL\nPrometheus provides its own query language PromQL (Prometheus Query Language) that lets users select and aggregate data. PromQL is specifically adjusted to work in convention with a Time-Series Database and therefore provides time-related query functionalities. Examples include the  function, the instant vector and the range vector which can provide many samples for each queried time series. Prometheus has four clearly defined metric types around which the PromQL components revolve. The four types are:\n* Gauge\n* Counter\n* Histogram\n* Summary\nExample code\n{{sxhl|2=promql|1=\n# A metric with label filtering\ngo_gc_duration_seconds{instance=\"localhost:9090\", job=\"alertmanager\"}\n# Aggregation operators\nsum by (app, proc) (\ninstance_memory_limit_bytes - instance_memory_usage_bytes\n) / 1024 / 1024\n}}\nAlerts and monitoring\nConfiguration for alerts can be specified in Prometheus which specifies a condition that needs to be maintained for a specific duration in order for an alert to trigger. When alerts trigger, they are forwarded to the Alertmanager service. Alertmanager can include logic to silence alerts and also to forward them to email, Slack, or notification services such as PagerDuty. Some other messaging systems like Microsoft Teams could be configured using the Alertmanager Webhook Receiver as a mechanism for external integrations. also Prometheus Alerts can be used to receive alerts directly on android devices even without the requirement of any targets configuration in Alert Manager.\nTime Series Database\nPrometheus has its own implementation of time series database where it stores the recent data (1–3 hours of data by default) in a combination of memory and mmap-ed files from disk, and persists the older data in the form of blocks with an inverted index. Inverted index is well suited for Prometheus data format and querying patterns. As part of background maintenance, smaller blocks are merged to form bigger blocks in a process called compaction to improve query efficiency by having fewer blocks to read. Prometheus also uses a Write-Ahead-Log (WAL) to provide durability against crashes.\nDashboards\nPrometheus is not intended as a full-fledged dashboard. Although it can be used to graph specific queries, it is not a full-fledged dashboard and needs to be hooked up with Grafana to generate dashboards; this has been cited as a disadvantage due to the additional setup complexity.\nInteroperability\nPrometheus favors white-box monitoring. Applications are encouraged to publish (export) internal metrics to be collected periodically by Prometheus. Some exporters and agents for various applications are available to provide metrics. Prometheus supports some monitoring and administration protocols to allow interoperability for  transitioning: Graphite, StatsD, SNMP, JMX, and CollectD.\nPrometheus focuses on the availability of the platform and basic operations. The metrics are typically stored for a few weeks. For long-term storage, the metrics can be streamed to remote storage.\nStandardization into OpenMetrics\nThere is an effort to promote Prometheus exposition format into a standard known as OpenMetrics. Some products adopted the format: InfluxData's TICK suite, InfluxDB, Google Cloud Platform, DataDog and New Relic.\nLibrary interfacing\nPrometheus is interfaced with by various libraries. For example, POCO C++ Libraries supports interfacing with Prometheus through its Poco::Prometheus library.\nSee also\n* Check MK\n* Ganglia (software)\n* Zabbix\n* Comparison of network monitoring systems\n* List of systems management systems\nReferences\nFurther reading\n*\n*\n*\n*\n*\n*\nExternal links\n*"
    }
  ]
}