{
  "content": [
    {
      "type": "text",
      "text": "# Pronto Software\n\n}}\nPronto Software is an Australian enterprise software vendor.\nPronto Xi is Pronto Software's main product. It has modules for financials, retail, CRM, supply chain management, warehouse management, manufacturing and facilities management.\nHistory\nThe company was founded in 1976 as Prometheus Software Development in Sydney, Australia. Originally trading under the name 'Prometheus Software', the company was sold to Sausage Software in 1999. The name was then changed to 'Pronto Software' following a management buyout in 2002.\nRecognition\n*2006 Pronto Software named The Age/D&B Victorian Business of the Year. Launches PRONTO-Xi Phase 5\n*2007 Awarded IBM's Reseller of the Year\n*2008 Won the D&B/The Age Business Awards (IT) and AIIA iAwards for Alert Intelligence\n*2009 Won the Australian Business Awards for Enterprise. Surpassed $50 million in turn over.  Launches PRONTO-Xi Phase 6.\n*2011 Won the 2011 IBM Choice Award for Midmarket Leadership. Launches Pronto Xi Dimensions.\n*2015 Awarded 2015 ABA100 Winner in The Australian Business Awards for Best Software Product.\n*2016 ABA100 Winner for Cloud Innovation in The Australian Business Awards.\nTechnology\nIn 1984, the company released the PRONTO Enterprise Management suite. Subsequent developments included the launch of PRONTO-Xi Phase 4 in 2005. In 2016, the company introduced Pronto Woven, a digital consultancy service designed to integrate with and extend the functionality of Pronto Xi.\nPronto Xi operates on Linux (Red Hat), UNIX (AIX or Solaris), and Microsoft Windows Server 2008 platforms. In UNIX and Linux environments, the system is accessed via a proprietary thin client, communicating with the application server over SSH, Telnet, or SSL-encrypted Telnet protocols. A web-based client has been introduced to support modern deployment strategies and serves as the basis for ongoing platform evolution.\nSupported relational database management systems (RDBMS) include Informix Dynamic Server, Oracle Database, and Microsoft SQL Server.\nTechnology partners\nPronto Software is partnered with IBM, Remap, TIG Freight Management, ProSpend, Action HRM, Nomos One, Maralan Documentation, QBuild, Square, BundyPlus, Filebound Solutions, Ozedi and Finlease.\nIndependent Consultants\nThere is a range of independent consultants not affiliated with Pronto Software servicing various industries.\nTo date, Pronto software does not offer affiliation programs for independent consultants.\nReferences"
    }
  ]
}