{
  "content": [
    {
      "type": "text",
      "text": "# Prop Culture\n\nDan Lanigan\n| presenter            = Dan Lanigan\n| country              = United States\n| language             = English\n| num_seasons          =\n| num_episodes         = 8\n| company              = Cinema Relics ProductionsABC Studios\n| channel              = Disney+\n| released             =\n| opentheme            =\n| endtheme             =\n}}\nProp Culture is an American documentary television series hosted by Dan Lanigan. The series premiered on Disney+ on May 1, 2020. In May 2023, it was removed from the service.\nPremise\nThe series is hosted by film historian and collector Dan Lanigan, who explores and showcases costumes, set designs, music, and props from various Disney films. Throughout each episode, Lanigan conducts interviews with cast and crew from each film, providing in-depth insights into their production and legacies.\nFilms highlighted in the series include Pirates of the Caribbean: The Curse of the Black Pearl, Mary Poppins, Tron, The Nightmare Before Christmas, The Muppet Movie, Who Framed Roger Rabbit, The Chronicles of Narnia: The Lion, the Witch and the Wardrobe, and Honey, I Shrunk the Kids.\nEpisodes\n|ShortSummary    = Dan learns the stories behind the props from the movie Mary Poppins. Actress Karen Dotrice guest stars.\n|LineColor       = 3350B1\n}}\n|ShortSummary    = Dan enters the world of the visionary science fiction movie, Tron and restores one of its most memorable props.\n|LineColor       = 3350B1\n}}\n|ShortSummary    = Dan meets creative contributors behind Tim Burton's The Nightmare Before Christmas. Film composer Danny Elfman guest stars.\n|LineColor       = 3350B1\n}}\n|ShortSummary    = Dan uncovers treasures from Pirates of the Caribbean: The Curse of the Black Pearl. Concept designers Jim Byrkit and Crash McCreery, costume designer Penny Rose, and swordsmith Tony Swatton guest star, along with visiting St. Vincent and the Pirates of the Caribbean at Disneyland.\n|LineColor       = 3350B1\n}}\n|ShortSummary    = Dan explores the futuristic inventions from Honey, I Shrunk the Kids. Rick Moranis, Thomas Wilson Brown, Jared Rushton, and Amy O'Neill guest star.\n|LineColor       = 3350B1\n}}\n|ShortSummary    = Dan investigates props from The Chronicles of Narnia: The Lion, the Witch and the Wardrobe. William Moseley, Anna Popplewell, and Georgie Henley guest star.\n|LineColor       = 3350B1\n}}\n|ShortSummary    = Dan uncovers the secrets behind Walt Disney's Oscar-winning film Who Framed Roger Rabbit. Actor Christopher Lloyd, who played Judge Doom in the film, guest stars.\n|LineColor       = 3350B1\n}}\n|ShortSummary    = Dan takes a road trip to find missing props from The Muppet Movie. Brian Henson and Muppet performer Dave Goelz guest star.\n|LineColor       = 3350B1\n}}\n}}\nReferences\nExternal links\n*"
    }
  ]
}