{
  "content": [
    {
      "type": "text",
      "text": "# Property of the Republic\n\n| runtime        = 138 min\n| country        = Soviet Union\n| language       = Russian\n| budget         =\n| gross          = 47,1 tickets sold\n}}\nProperty of the Republic () is a 1971 Soviet two-part adventure film directed by Vladimir Bychkov. The detective story takes place during the Civil War in Russia. The picture was the 44th most attended domestic film in the Soviet Union.\nSpring 1918. Tarakanov, managing the estate of Prince Tikhvinsky, with the help of the former court fencing teacher Shilovsky and homeless boy Keshka, steals from abandoned mansion collection of paintings and sculptures. Hopping across the border, criminals roam the circus troupe, and they are being tailed by an employee of Criminal Investigation,   Makar Ovchinnikov.\nPlot\nEpisode One\nIn 1918, Soviet authorities seize a valuable art collection from the estate of Prince Tikhvinsky and transport it to Petrograd. However, when museum officials open the crates, they find the treasures have mysteriously vanished. Two years later, a painting from the missing collection is discovered with a street vendor in Petrograd. The case is reopened, and detective Makar Ovchinnikov is assigned to investigate. Meanwhile, a young icon painter, Innokentiy, is taken from a monastery to be formally trained. He ends up in a Petrograd orphanage, where he meets an adventurous man named Shilovsky, known as \"The Marquis,\" who grows fond of him. Together with Tarakanov, the former steward of Prince Tikhvinsky, Marquis searches for some crates without revealing their contents to Innokentiy. They eventually find the collection in the Tikhvinsky family crypt. Tarakanov, intent on selling the treasures abroad, blackmails Marquis into helping him. They smuggle the collection out of Petrograd on a barge numbered 777. Meanwhile, former imperial investigator Prokofy Dobrovo, a retired criminologist, begins his own search.\nEpisode Two\nMarquis and Tarakanov transfer the treasures from the barge to a train. Ovchinnikov arranges surveillance on the train and meets Innokentiy, who is fleeing to Crimea with his orphan friends. At one station, Ovchinnikov prepares to apprehend the criminals, but they start a fire to fake the cargo’s destruction. Dobrovo inspects the scene and advises Ovchinnikov that the treasures weren’t burned, encouraging him to continue the search. The criminals join a traveling circus to get closer to the border. Marquis performs as a sharpshooter, with Innokentiy as his assistant, while Tarakanov manages the cash and hides the collection in his locked wagon. Ovchinnikov joins the circus as a performer to stay close. During an escape attempt with Tarakanov’s wagon, Ovchinnikov is captured by the bandits of Ataman Lagutin. The gang leader interrogates him and, discovering he’s a \"Red,\" subjects him to a deadly game of Russian roulette. Ovchinnikov survives, and Lagutin grants him one more day of life.\nMarquis, disguised as a crippled beggar, infiltrates the bandits’ monastery hideout, attempting to steal the wagon but is also captured. The next morning, both Marquis and Ovchinnikov face execution. Mocking them, Lagutin challenges Marquis to shoot at some statues from the collection to earn a reprieve. Marquis agrees, but instead of shooting the statue, he turns his gun on Lagutin, killing him before being fatally shot himself. In the ensuing chaos, Innokentiy frees Ovchinnikov, and they take refuge in the monastery bell tower, holding off the bandits until Red Army cavalry and circus performers arrive to rescue them. During the battle, Tarakanov escapes with his wagon. In a remote area, he opens it to check on the collection, only to find the body of Ataman Lagutin instead of the treasures.\nCast\n* Oleg Tabakov as Makar Ovchinnikov\n* Andrei Mironov  as Shilovsky aka Marquis\n* Vitya Galkin as homeless Keshka\n* Yevgeniy Yevstigneyev as Carl Genrikhovich Vitol\n* Spartak Mishulin as Ilya Tarakanov\n* Mikhail  Ekaterininskiy as Director of the Museum\n* Olga Zhiznyeva as Duchess Tikhvinskaya\n* Yuri Tolubeyev as criminologist Prokofy Filippovich Dobrovo\n* Igor Kvasha as Ataman Lagutin\n* Vladimir Grammatikov as magician\n* Rogvold Sukhoverko as Commissioner Kochet\n*Georgy Millyar as old railroad\n* Arkady Tolbuzin as director\n*Elmira Zherzdeva as singer\nRelease\nVladimir Bychkov's film watched 47.1 million viewers, which is 67 results in the history of Soviet film distribution.\nReferences\nExternal links\n*"
    }
  ]
}