{
  "content": [
    {
      "type": "text",
      "text": "# Proposed relocation of the Parliament of the United Kingdom\n\nSeveral parties have advocated the relocation of the Parliament of the United Kingdom from its current location at the Palace of Westminster, London, to the English Midlands or Northern England, for economic or other reasons. A contributing factor in favour of relocating the Parliament is the extremely high cost of any restoration programme.\nProposals\nThere has been some interest in relocating to York, Manchester or Birmingham, while former MP George Galloway once suggested Leeds as a new location.\nThe Electoral Reform Society supports the idea of relocation, making a case for England's and Britain's demographic or geographic centres of gravity.\nIn the 1850s, during the Great Stink, Parliament considered moving to either Henley, Oxford or St Albans, to avoid the foul smell of the Thames, but ultimately decided against it.\nCurrent position on temporary relocation and restoration programme\n2012\nOctober\nThe House of Commons Commission issued a bulletin stating:\n\"At its meeting on Monday 29 October, the House of Commons Commission considered an internal Study Group report on the restoration and renewal of the Palace of Westminster. The Commission was united in taking very seriously its responsibilities for this iconic and much-loved Grade 1 listed building in a UNESCO world heritage site. It also expressed strong support for continuing to protect the health and safety of visitors, Members and staff. It is therefore of the unanimous view that doing nothing is not an option. Equally, the Commission is acutely conscious of the current public spending environment and is committed to ensuring that any consideration of how the Palace could be restored is based upon securing maximum value for taxpayers' money.\nThe report is a useful first analysis of the issues. However, the Commission has ruled out the option of constructing a brand new building away from Westminster and no further analysis will be undertaken on this option. In addition, the Commission was not persuaded that the case for a decant had been made, and wished to ensure that all options were rigorously tested by independent analysis, detailed costings and robust technical information, to ensure no suggestion of internal bias. Fulfilling their obligations as custodians of the Palace of Westminster requires informed, considered decision-making by both Houses of Parliament. A great deal of work remains to be done before Parliament is in a position even to consider the merits and demerits in principle of particular options.\"\n2015\nDecember\nBuilding published: \"Nine firms and joint ventures have been shortlisted for two client advisory roles on the mammoth £6bn restoration of the Houses of Parliament.\nAllies & Morrison, BDP, Foster + Partners and HOK were shortlisted for the architectural lot, while Aecom and Mace, Capita & Gleeds, CH2M, Arcadis and Turner & Townsend were shortlisted for programme, project and cost management services.\nThe client advisory contracts are expected to be awarded by the end of June 2016 and to be worth up to a combined £29m.\nA 'decision in principle' is expected to be reached by members of both Houses of Parliament in spring 2016 to allow for the works to begin in 2020/21.\"\n2016\nJuly\nBuilding stated: \"It is understood the Department of Health’s headquarters, the 1980s-built Richmond House, which is a stone’s throw away from the Palace of Westminster, is still the frontrunner to be parliament's temporary home and that the necessary conversion works could be rolled into the Northern Estate programme.\nA parliamentary joint committee is currently finalising a report into its preferred option for restoring the Palace of Westminster, which could take up to 30 years and cost between £4bn and £6bn.\nA parliamentary spokesperson confirmed decanting parliament could form part of the Northern Estate programme but declined to comment on candidate buildings. The spokesperson said: 'No decisions have yet been taken on the future restoration of the Palace of Westminster.'\"\nSeptember\nA senior parliamentary committee stated, \"The Joint Committee on the Palace of Westminster concludes that the Palace of Westminster 'faces an impending crisis which we cannot responsibly ignore'.  There is a substantial and growing risk of either a single, catastrophic event, such as a major fire, or a succession of incremental failures in essential systems which would lead to Parliament no longer being able to occupy the Palace.\"  and that the Parliament be vacated for six years for an urgent, £4+ billion repair. In response, Graham Stringer, MP for Blackley and Broughton, suggested moving the seat of government to Manchester or Salford.\nAlso in September, Neil Gray, member of the new Joint Committee on the Palace of Westminster, proposed: \"the Joint Committee declines to consider a draft Report until it has given full consideration to the possibility of constructing a permanent new Parliamentary building, while finding an alternative future use for the Palace of Westminster; notes that this option was included in the Pre-Feasibility Study and Preliminary Strategic Business Case published in October 2012 but was rejected by the House of Commons Commission and the House of Lords House Committee at that stage; and resolves to apply the same rigorous scrutiny to the possible construction of a new Parliamentary building as it has applied to the other options for delivering the Restoration and Renewal Programme, before making a recommendation about the best option for carrying out the works.\" the committee voted 11/1 against this proposal.\nOctober\nSpeaking to Building, former leader of the Scottish National Party, Alex Salmond, said Liverpool or Manchester would be an ideal site to rebuild the Houses of Parliament. The Houses of Parliament should be rebuilt in Liverpool or Manchester with a detailed replica of the Commons' debating chamber. Salmond said the move was needed to \"equalise\" the economy so it was less dependent on London. MPs were due to vote soon on whether to press ahead with vital renovation plans for the Palace of Westminster, which was riddled with rodents, asbestos and plumbing problems. Renovations were expected to take six years to complete at a cost of around £4bn.\nMany MPs, though, were furious that relocating Parliament into a new building with modern technology, preferably outside of London, had not been considered. Salmond said that by the time a new parliament was built or refurbishment was completed, currently estimated at 2028, Scotland would be independent. \"This place [the Palace of Westminster] should become a museum. My advice would be to build a modern parliament in Manchester, Liverpool, somewhere in the north of England – obviously Scotland will be independent by then – to equalise the country. I would, just for sentiment’s sake, have the debating chamber be a mimic of this debating chamber here, the same way as [1990 UK political drama] House of Cards did. We could do it for a fraction of the cost and this place would get more tourists than it does at the present moment.\"\nSalmond insisted that turning the palace into a museum would be far cheaper than making it fit for 21st-century office use because repairs and upgrades would be less extensive. He believed the £4bn cost was likely to prove a vast underestimate of the final price tag. \"The basic refurbishment that costs the money is to secure it for working conditions. The amount to stop it collapsing is relatively small, the amount to replace the asbestos and make it safe is extensive. But the cost to make it compliant with modern technology is horrendous. I would secure the tourist trail, make it the museum it should be, instead of people having to just traipse in and out, and build somewhere else.\" Salmond has experience with troubled political buildings, having opposed the construction of the Scottish Parliament in Holyrood, Edinburgh when cost estimates rose from £50m to £230m in 2000. The eventual cost was £414m.\nLabour leader Jeremy Corbyn has also said that proposals to create a temporary floating parliament building while vital repair work at the Palace of Westminster is carried out should be seriously looked at.\nDecember\nLiberal Democrat peer Tony Greaves suggested on the BBC's Daily Politics moving the Capital out of London. / A consortium led by WSP Parsons Brinckerhoff and including consultant Gleeds won the £500m revamp of MPs' offices in Westminster, known as the Northern Estate Programme, and seen as a necessary precursor for the Renovation of the Palace of Westminster.\n2017\nJanuary\nAndrew Tyrie, chairman of the Treasury Select Committee, said insufficient evidence had been produced to justify the \"hugely expensive restoration project\". \"Neither the report by Deloitte, nor that by the Joint Committee on the Palace of Westminster, provides enough of the evidence needed to come even to a preliminary decision on these proposals – so the Treasury committee will attempt to collect some of it.\" BBC News reported a Commons vote on whether to press ahead with a full or partial evacuation was expected in the coming weeks.\nIn a separate development Michael Gove joined a group of MPs who had spoken out against plans to shut down the Palace of Westminster to carry out vital repairs. Gove and a group of seven other MPs were arguing against the official proposal – drawn up by Aecom, HOK and Deloitte – of a full move out of MPs and Lords for six years to carry out £3.5bn of repair works.\nFebruary\nDavid Natzler, Clerk of the House of Commons, in response to a question from Phil Boswell, stated during a meeting of the Public Accounts Committee, that: \"in 2012 the Commissions of the House of Commons and the Lords ... came to the conclusion that Parliament would stay at Westminster and ruled ... out ... a new building anywhere else in the country\". From the point of view of parliamentary staff, said Natzler, such a ruling was the \"equivalent\" of a ministerial directive.\nSeptember\nA team of consultants proposed the temporary relocation of the two debating chambers and associated facilities onto the three Woolwich Ferry hulls which are due to be decommissioned in Autumn 2018. The proposal, which they called HMS Parliament, had the vessels moored outside the Palace of Westminster and was estimated to cost £55m.\n2018\nJanuary\nOn 31 January 2018, MPs voted in the House of Commons that they would leave the Palace of Westminster while restoration and renewal works were undertaken. The move to leave the Palace is not expected before 2025.\nArguments for a permanent move north\nA restoration and renewal of the Palace of Westminster could well result in the temporary relocation of Parliament but a permanent relocation to a new building seems unlikely although the final hurdle of public reaction to the commitment of vast financial resources to the Westminster site could still have the potential to influence MPs and other groups known to be supportive of a permanent move.\n* Meeting a desire of devolution and decentralisation, expressed by movements such as the Scottish independence initiative.\n* Avoiding an expensive open-ended restoration of the Palace of Westminster.\n* Mitigating the privileges of the City of London and reducing the primacy of London.\n* Taking advantage of high real-estate prices in London.\n* Stimulating the economy of the central United Kingdom.\n* A chance to emphasise the separation of powers in the current devolved environment of the United Kingdom while cementing a new role for the government of the Union.\n* A move of the seat of government to a greenfield site on the outskirts of Greater Manchester would shift the centre of gravity of the main governing body of the Union, centralising it between its four main constituent parts of England, Northern Ireland, Scotland and Wales.\nSee also\n*Joint Committee on the Palace of Westminster\n*Palace of Westminster\n*Relocation of the German seat of Government\nReferences\nExternal links\n* [http://www.parliament.uk/mps-lords-and-offices/offices/commons/house-of-commons-commission/minutes/commons-commission-bulletins-to-members/bulletin-29-october-2012/ Direct link to the House of Commons Commission bulletin]"
    }
  ]
}