{
  "content": [
    {
      "type": "text",
      "text": "# Propaganda in World War II\n\nwith title \"Together we will crush him!\"]]\nPropaganda in World War II (WWII) had the goals of influencing morale, indoctrinating soldiers and military personnel, and influencing civilians of enemy countries. Both the Allies and the Axis powers used propaganda during the war.\nBackground\nBy the 1930s, propaganda was being used by most of the nations that joined World War II. Propaganda engaged in various rhetoric and methodology to vilify the enemy and to justify and encourage domestic effort in the war. A common theme was the notion that the war was for the defence of the homeland against foreign invasion.\nThe Nazi Party propagandist Joseph Goebbels once wrote in his diary:\nBritain\nWinston Churchill in  created the Political Warfare Executive (PWE) for the distribution of propaganda damaging to the morale of the enemy. Foreign language broadcasts of the BBC World Service were central to gaining influence over the German people. Goebbels, before committing suicide, remarked, \"Enemy propaganda is beginning to have an uncomfortably noticeable effect on the German people.... British broadcasts have a grateful audience\".\nThe British used black propaganda techniques to deliver subversive messages directly to the German people by dropping leaflets and postcards.\nThe Hollywood film Mrs. Miniver () by William Wyler told the saga of the British home front and ended with a sermon delivered in a church destroyed by Allied bombs: \"This is the people's war. It is our war. We are the fighters. Fight it, then. Fight it with all that is in us, and may God defend the right\".\nGermany\nThe Reich Ministry of Public Enlightenment and Propaganda was established in . Goebbels, who was appointed by Adolf Hitler to lead the ministry, used radio, press, books, films, and all other forms of communication media to promote the Nazi ideology. Germany's defeat in World War I was emphasised to provoke German feelings of rage and anger. Germany's cultural achievements and military accomplishments built up national pride. The Allied armies were cast as butchers, the Soviets as inhuman beasts. The ministry censored opposing viewpoints.\nGermany's war against the Soviet Union was described by Nazi Party officials as Weltanschauungskrieg ().\nSoldiers on the front lines had limited access to information. Often, written materials were the most direct means of propaganda available. By , the 12th Infantry Division of the Wehrmacht was given newspapers daily, a practice that continued during the occupation of Vendée, receiving also the field newspaper of the 4th Army, and the transcribed Wehrmachtbericht ().\nThe Nazi Party recognized early on the value of radio receivers to transmit political propaganda. German troops were given such receivers that were used for entertainment and indoctrination. During Operation Barbarossa, the 12th Infantry Division of the Wehrmacht were served by a travelling \"radio van\" that made the rounds carrying a very powerful receiver. The Panzergrenadier Division Großdeutschland and the 18th Panzer Division were also given radios.\nFilms were shown to German soldiers for entertainment and indoctrination. They were very popular with the soldiers, who had a \"film van\" accompany them during the occupations of France and The Netherlands. It was the most popular off-duty activity among the soldiers. The 18th Panzer Division converted schools in Prague to cinemas, a practice that they had learned from the Soviets.\nThe effectiveness of Goebbels' propaganda was diminished by Germany's defeat at the Battle of Stalingrad in February 1943. Forced to concede the military defeat, he made a case for total war, which prolonged the war without altering its eventual outcome.\nUnited States\nhead, clutching the Statue of Liberty]]\nFew Americans, after World War I and the Great Depression, supported fighting another distance war. However, after the Pearl Harbor attack, the Office of War Information (OWI), the main source of propaganda, was created by President Franklin Roosevelt in . Photographers documented various aspects of the American home front to undermine enemy morale. Some of the propaganda has been criticised as having racially charged content, such as the films of Frank Capra Why We Fight, which showed the enemy nations as inhuman. The involvement of the OWI in Hollywood has been noted for the creation of patriotic propaganda films such as Yankee Doodle Dandy, Pin-Up Girl, and Anchors Aweigh. Posters, movies, and cartoons helped recruit Americans to serve in the war.\nProduction was presented as the critical factor in winning the war. Popeye and Bugs Bunny were shown fighting the Japanese, and a short film of Donald Duck attacking Hitler with a tomato was released by Walt Disney. Such efforts aimed to combine entertainment with awareness of the war effort.\nDomestic propaganda\nDomestically, Roosevelt's wartime propaganda supported the war by generating more soldiers, keeping the morale, and maintaining civilian workforce and production. The \"hidden army\" needed for weapons production and agricultural production was an important target of American propaganda during the war. After Pearl Harbor was attacked, a propaganda campaign focused on agriculture and directed at young men with the intention of reducing the one million American males who left farms during the war. Government-produced films from  to  featured stories of agriculture production during the war. In the propaganda film ''It's Everybody's War'', the actor Henry Fonda explains the farmers' importance in the war effort and their role in sustaining their \"brothers overseas\". The theme of American masculinity in domestic wartime propaganda idealised men and patriotism, and poster art featured overtly muscular men carrying bayonets confidently into war or many tomatoes in baskets at home.\nAdditionally, popular comics featuring Captain America and Wonder Woman reflected the war to their audience. Against the Axis powers, the comic characters fought to protect the United States and instilled patriotic themes to further sell the war to Americans.\nPortrayal of race\nLike in most other propaganda, the OWI commonly appropriated the \"symbols and values\" of enemies as a means of dehumanising them. Nancy Brcak and John Pravia make the argument that during the war, when Jim Crow laws were still enforced in America, the perceived \"acceptance\" of the \"inferiority\" of minorities became \"clearly a part of US propaganda\" and was especially employed in the Pacific War against Japan. In the Pacific, depictions of Japanese soldiers featured exaggerated stereotypical features. In some, Japanese soldiers were conveyed as sexually depraved and often as engaging in inhuman and evil acts.\nAt home, African-Americans were encouraged to engage in war and to defend America. Surveys conducted by the OWI indicated African-Americans' contention with fighting for their race both at home and in the war. They found the war less important than the current race issues faced in America, unlike white Americans. The OWI went on to engage in a propaganda campaign aimed to generate a sense of belonging and loyalty with America and African-Americans. An initial piece of propaganda in , 2.5 million pamphlets of \"Negros and the War,\" was largely distributed and argued that without America, African-Americans could not fight for their freedoms. The OWI also co-operated with Hollywood movie producers to try to depict African-Americans as integral and normal in films, such as in Stormy Weather and Cabin in the Sky. In the film Bataan, an African-American soldier dies heroically after he is involved in an earlier scene in discussing strategy and his American patriotism with his white platoon.\nHow, despite such depictions, the African-American characters were often stereotypes and remained inferior to other characters in both screen time and importance in the films. Clayton R. Koppes and Gregory D. Black found that \"In a Columbia University study in \", out \"of one hundred black appearances in wartime films, seventy-five perpetuated old stereotypes, thirteen were neutral, and only twelve were positive.\"\nPamphlet propaganda\nThe OWI coordinated the majority of the Pacific War propaganda, including pamphlets that intended to undermine the morale of Japanese troops. In the last months of the war, the Allies dropped 2 billion pamphlets over Japan. Pamphlets translated from English to Japanese, which were incorporated with Japanese symbolisms and cultures, derived from the use of Japanese prisoners-of-war to create more direct and effective propaganda pamphlets to spread over the Pacific. Near the end of the war in , pamphlets in English and Japanese stated \"I cease resistance\" and encouraged the surrender of Japanese soldiers. They also included promises of humane treatment upon surrender, Japanese culture remaining if the military surrendered, and the young and the sick being helped. The pamphlets may have contributed to the 10,000 troops surrendering in Okinawa, and they also further supported the use of the Allied pamphlet campaign for the OWI. The pamphlets also came to report bombing runs, to warn citizens of targeted cities, and to threaten the use of atomic weapons after the bombing of Nagasaki unless surrender occurred. The use of pamphlets continued until the end of the war in .\nJapan\nunder the Nationalist Government]]\nJapanese propaganda during World War II presented the war as a defensive against the influence and the hostility of the West. It conveyed the Japanese as victims who would have to fight for their independence and freedom. Japanese propaganda commonly operated to demoralise Allied troops and often employed racial themes to degrade Western culture's oppression of Japan. Common Japanese propaganda depicted Roosevelt and the American people as \"sexually depraved\" and demons. To the Australian soldiers, a Japanese propaganda piece (refer to figure) details an Australian soldier far from home and fighting while an American took his wife. The piece aimed to discourage American-Australian relations.\nSome Japanese propaganda was aimed towards African-American troops and took advantage of the racist climate in America to incite \"anti-war sentiment.\" Propaganda was distributed that was designed to highlight Japanese morality in comparison to American racism and commonly noted that Japanese victory would ensure discriminatory freedom from white American oppression. It evoked the brutal history of African-Americans to further the propaganda's effect. The propaganda generated a variety of responses, in some cases it \"resonate[d] strongly\" with African-American troops, a poll in  highlighted that 70% had \"misgivings about the importance of the war to them personally.\"\nSoviet Union\n1939–1941\nAt the start of World War II, the Molotov–Ribbentrop Pact, a non-aggression pact between the Soviet Union and Nazi Germany, was signed. It lasted up until , when Germany invaded the Soviet Union by surprise in Operation Barbarossa. During that period, nationalism dominated Soviet propaganda. Ewe M Thompson highlights the press as a primary medium by which nationalist propaganda functioned within the Soviet Union. In , during the Soviet invasion of Poland, the Soviet press continued to vilify Poland and its people. Soviet newspapers \"encouraged hatred\" from the states of the union by presenting Poland as having \"brutalised millions of Belarussians, Ukrainians, and Jews\". The press glorified the liberation of the country from \"Polish overlords\". It also endorsed Hitler's resentments of the Poles, and introduced Soviet schools containing Russian textbooks aimed \"to increase the use of Russian among the non-Russian population\". The effect of Soviet propaganda promoted the \"Russification\" in Soviet states.\n1941–1945\n]]\nSoviet propaganda, during the country's victory at Stalingrad, had the notion of the hearth and family become a focus for rhetoric for nationalist and patriotic themes. The language of the propaganda often \"dress[ed]\" itself in private values and to sound like private speech. The use of personal letters, some of which directed from soldiers to wives back home, were often published along with romantic imagery of the Russian homeland to incite \"hatred of the invader,\" and \"self-sacrifice\". Stalin was considered the father of the Soviet family, published personal letters was depicted \"brothers who fought side by side\" and the land itself was described as an endangered \"mother\", which served as a symbol to encourage devotion to state. Propaganda also aimed to encourage women to replace domestic male roles like factory work but also to do so within the family. Common mother propaganda encouraged adoption and domestic rekindling. Mothers with a minimum of 7 children were awarded publicly for their efforts in helping the motherland, which further encouraged the devotion of women to help the war effort.\nIndia\nBritish, Nazi and Indian propaganda were present in India during the Second World War.\nBritish propaganda\nDuring the Second World War, the British government engaged in censorship and propaganda strategies that aimed to maintain the status quo of British Raj. Despite the objections of Indian nationalists and the consequences of the war like famine, British propaganda aimed to absolve the blame placed upon Britain. In , \"British officials suppressed 92 journals in August\" through British-owned newspapers papers like The Hindu and The Statesmen. British propaganda intended to \"repress Indian voices in public media\" and \"regulate social criticism generated by resistant intellectual culture\". The media also played reels glorifying Indian troops fighting against Axis powers. The Indian National Army, an Indian soldier army fighting for Indian independence with the support of the Japanese army, was censored throughout the war to maintain a \"complicit\" India.\nIndian nationalist propaganda\nAmongst British propaganda, Indian nationalism in the media expressed the anti-colonialist criticisms of Mahatma Gandhi through nationalist reporters like war correspondent T.G. Narayanan. Operating under the \"constraints of censorship\", Narayanan became a prominent voice for Indian nationalism. His work covered the Bengal famine of 1943 and expressed Gandhi's blame on the British government and the necessity of \"self-governance\" within the media  For Indian troops, nationalist media highlighted the unfair conditions such as lower pay and status than British troops and implicated the British regime for the issues of the country.\nNazi propaganda\nNazi propagandists operating in India distorted ideologies of nationalism to loosen the grip of British colonialism over India. Mein Kampf was translated into Indian languages, and Indian newspapers were bribed to translate and print Hitler's speeches. Anti-Jewish sentiment was aimed towards Muslims to garner Nazi sympathy. One Indian newspaper, Princely India, stated on , \"We Indians need Hitler if we are to win swaraj at all.\"\nAustralia\nPropaganda in Australia during the Second World War aimed at promoting the necessity of Australia's freedom as well as its defence from foreign invasion.\n\"This Is Ours\"\nThe poster This Is Ours depicts Australia and New Zealand shaded white against a counterpoising blackness around it. The National Archive of Australia regarded its aim was to highlight the \"threat of Japanese invasion\" and the \"climate of fear\" induced by Australian and Japanese conflict. The white propaganda was directed to Australian citizens and employed rhetoric that emphasised notions of home, Australian patriotism, and confidence in the security of the country.\nAustralia Has Wings\nAustralia Has Wings was a 1941 promotional propaganda film depicting the Australian aircraft industry and promoting the \"heroic motivation for freedom,\" amongst commentary that supported the country, the Australian air force and the defence of Australia.\nItaly\nposter]]\nAlthough Germany and Italy were partners in World War II, German propagandists made efforts to influence the Italian press and radio in their favour. In , the so-called Dina (Deutsch-italienischer Nachrichten-Austausch) service was set up, ostensibly to improve news exchanges during the war. In fact, however, the Nazis knew that an equivalent exchange would not be achieved at all since the Italian media were much weaker in terms of personnel. In reality, the Dina service served from the beginning to flood Italy with German news material and to indirectly control reporting there.\nPsychological warfare\nDuring World War II, propaganda was replaced by the term \"psychological warfare\" or \"psy-war.\" Psychological warfare was developed as a non-violent weapon that was used to influence the enemy soldiers and the civilians' psychological states. Psychological warfare's purpose is to demoralise enemy soldiers, or to get soldiers to surrender to a stronger military force. During World War II, the Psychological Warfare Branch (PWB) operated in the southwest Pacific. The PWB would use leaflets instead of guns or bombs. They would fly planes over the Philippines and Japan, and they would drop the leaflets out of bomber planes.\nSee also\n* Home front during World War II\n* Propaganda in World War I\nReferences"
    }
  ]
}