{
  "content": [
    {
      "type": "text",
      "text": "# Prostitution in the Central African Republic\n\nProstitution in the Central African Republic is legal and commonplace. Procuring or profiting off the prostitution of others is illegal, as is coercing people into prostitution. Punishment is a fine and up to one year in prison, or 5 years if the case involves a minor.\nHuman trafficking and Child prostitution is a problem in the country. A study published in 2017 found that about two thirds of the prostitutes in the capitol, Bangui,  worked part-time to supplement their income or to pay school and college fees. Some of the full-time prostitutes visit hotels, bars and nightclubs looking for wealthy clients, especially French men. They are known as \"pupulenge\" (dragonflies) or \"gba moundjou\" (look at the white). Those who work in the poorer neighbourhoods are known as \"kata\".\nThe same survey found the age of the full-time prostitutes ranged from 16 to 30 and most (90%) came from the Central African Republic. Others came from the Congo, Chad and Cameroon.\nHIV\nCondoms in the country are rare, as they are in other sub-Saharan countries. As a result infections of HIV and other STIs are high amongst sex workers in the country. UNAIDS estimated that in 2016, 9.2% of the sex workers in the country were infected by HIV. Other sources put the rate of infection higher.\nChild Prostitution\nChild Prostitution is a problem in the country, and no statutory rape laws to protect minors.\nSome young women and girls enter the trade without third party involvement for survival or to pay school/college fees. Others become prostitutes or mistresses of wealthy men to earn money for their families. There is also evidence of commercial sexual exploitation of children, either internally or to and from other countries in the area.\nIn 2016, reports emerged of abuse by UN Peacekeeping personnel. It was alleged that peacekeepers from Gabon, Morocco, Burundi, and France had paid for sex with girls as young as 13 at a camp for displaced persons near Bangui. Previously peacekeepers had been accused of 22 other instances of abuse or sexual exploitation.\nSex trafficking\nThe Central African Republic is a source and destination country for children subjected to trafficking in persons including forced prostitution. Most child victims are trafficked within the country, but a smaller number move back and forth from Cameroon, Chad, Nigeria, Republic of the Congo, Democratic Republic of the Congo, and Sudan.\nThere are no specific laws in the country to deal with human trafficking, but traffickers can be prosecuted under legislation dealing with prostitution, slavery, sexual exploitation, labour code violations, and mandatory school age.\nU.S. State Department's Office to Monitor and Combat Trafficking in Persons upgraded the country in from 'Tier 3' to \"Tier 2 Watch List\" in 2018.\nReferences"
    }
  ]
}