{
  "content": [
    {
      "type": "text",
      "text": "# Prostitution in Los Angeles in the 19th century__disambig_1\n\nProstitution in Los Angeles in the 19th century was centered in Los Angeles' red-light district and was controlled by powerful male figures. The business of prostitution thrived due to its proximity to a working-class male subculture in the red-light district. Crib prostitution made up the majority of the sex industry in Los Angeles at this time and this created diversity within the red-light district. Chinese prostitutes were particularly prominent in the crib district. The sex industry was largely male dominated, specifically by Tom Savage and Bartolo Ballerino. They both built their reputations using political alliances which solidified their hold on the crib district in Los Angeles.\nHell's Half Acre\nSince the 1850s, Hell's Half Acre has been the center of crime and violence in Los Angeles. Alameda Street was part of the red light district and centered around Negro Alley. This area contained saloons, restaurants and brick buildings with small rooms known as cribs. \"Crib prostitution\" was defined as women working out of buildings with narrow rooms with the bare minimum of a door, window, and room for bed and wash basin. Crib prostitution was considered just above streetwalking. They had the lower-paying clientele, saw more customers, and worked in unsanitary conditions. Prostitutes a part of the crib district symbolized sex work in Los Angeles but were considered bargain \"$1 prostitutes\".  They made less money than sex workers in brothels, but paid more rent for tiny cribs which only contained a makeshift bed and wash basin. Well-off boarding houses charged $5-6 a month, prostitutes paid $18 a week which is about $70 a month. Most didn't live in the cribs and only used them for prostitution while boarding in houses uptown. It was often said that this type of prostitution catered to the masses rather than the classes.\nCribs were filled with drug abuse, physical violence, and suicide because of the pimps. Because of these conditions, the city reformers believed the crib district represented the “abode of the lowest type of the most lewd women”. When reform efforts started they saw the cribs as a much worse form of prostitution compared to the brothels and parlor houses. Although women working in the crib district worked in the worst conditions, they were given more freedom to come and go within the industry and had more control over their income and hours compared to those working in the brothels.\nChinese Prostitutes\nMany Chinese immigrants came to Los Angeles beginning in the 1860-1880s and moved onto the block dominated by Negro Alley. In 1860, the U.S. Census Bureau reported 15 Chinese living in the County of Los Angeles. One year later, the number increased almost threefold. The Chinese population grew at a higher rate than the total population. The majority of cribs were on Alameda Street and in Chinatown on a street formerly Calle de los Negros, sometimes called “Negro Alley”. Negro Alley was the center of the town's vice district with both side of the alley taken up by saloons and gambling houses. Chinese communities in the West tended to be heavily male dominated because many immigrants saw America as a short-term economic opportunity that would let them return to families in China. By 1870, a census listed that out of 172 Chinese, 36 of them were women and many of these women worked as prostitutes. Between 1870 and 1880 the Chinese population jumped from 234 to 1,169 which is a 400% increase.\nChinese prostitutes in Los Angeles display the worst experiences of prostitution. They had the least amount of autonomy, fewest benefits, and had the worst working conditions. Chinese tongs, powerful secret organizations of men, controlled Chinese prostitutes in Los Angeles. Almost all women working under tongs were forced to become prostitutes in America. Tongs transported “slave women” who were sometimes young girls sold by their parents, from mainland China. Tongs had even more control over them if they had narcotics additions or gambling debts. The main function of the tongs was to provide social and fraternal needs to its members. They operated gambling parlors, opium establishments, and brothels. Working under the tongs gave Chinese prostitutes less autonomy than other prostitutes. They also worked in cribs, but the tongs made it so they were segregated from the rest of the community. Chinese prostitutes were segregated from other cribs operating in area with Chinese prostitutes at north end of Los Angeles Street and Caucasian prostitutes at south end of the street. It appeared that the tongs had made deals with the local authorities to prevent arrest in their area. Local tongs were very possessive of the prostitutes that worked under them which resulted in violence and the Chinese massacre of 1871 after conflict between two tongs over the ownership of a prostitute named Ya Hit.\nIntegrated Neighborhoods\nThe sex trade formed neighborhoods with ethnic or race-specific names like Chinatown, Little Tokyo, and the “Colored” District. Prostitution was centered in Chinatown in the late nineteenth century and spread east into Skid Row and south along Central Avenue which increased diversity by attracting people from other parts of the city. Prostitutes tended to go to these areas because there was less police activity. Many middle-class Americans at this time allowed prostitution as long as it stayed in the mixed-ethnic working-class districts. Restricting prostitution to mixed-ethnic neighborhoods increased diversity and possibility for inter-ethnoracial contact within the sex trade.\nCity Administration\nLike many other American cities in the late nineteenth century, the city administration of Los Angeles was geared towards regulation of illegal business instead of criminalization or eradication. Accepting illegal businesses like prostitution fueled these parties within the red-light district. The best locations for prostitution to occur was far from the view of city officials. This is why most who were successful in prostitution did so in buildings far from street view on higher levels or at the back of buildings. They tended to be far away from single-family homes. Buildings on the corner of Commercial and Los Angeles checked off these boxes as they were small rooms, not on the first floor, and, and with no single-family homes nearby.\nTom Savage\nIn the 1880s there was a prizefighting scene in Los Angeles which attracted a group of sporting men, saloonkeepers, gamblers, and others. The characteristics of this group of people aligned with the characteristics of the working-class male subculture.  Savage's rise to political power can be connected back to his forming of alliances within this community. These connections gave him a face in the city's Democratic party. By 1892 he became a Democratic delegate in the Eighth Ward, but newspaper stories implied that he acted more as the muscle to guarantee a favorable outcome to his associates. In 1894, Savage served a two-year term on the Los Angeles City Council and in 1898 and 1900 he again served as delegate for Democratic Party in various capacities. From 1901 to 1904, Savage gained more power and respect within the Eighth Ward and in 1904 the Times quoted Savage claiming the Eight Ward as “his ward”. The elite representatives of the male working-class subculture used their mutual alliances to gain political power, but they also wanted economic power. They saw opportunities within the realm of drinking, gambling, and fighting, bu especially prostitution.\nBouquet Saloon\nBouquet Saloon was at the corner of Commercial and Los Angeles Street in the red-light district and was one of the favored meeting places for power brokers of the ward. In 1897, Savage took over the lease and used it as a base for political and economic operations for the next decade. When Savage took over the lease, he obtained two adjoining rooming house known as the Arlington and Belmont. They combined to be nearly 70 small rooms which could be rented for prostitutes.  Savage understood the mindset of city leaders due to his political connections. He knew that they found prostitution most problematic when blatant so he separated his saloon from his prostitution business. Bouquet Saloon continued to be a space for sporting men while Savage's prostitution business occurred in the adjoining rooming houses.\nMay Davenport\nAccording to the Times, Davenport was Savage's wife and at some point she lived at the rooming houses with her nephew and Savage. There is little information on what Davenport did within the business, but court documents suggest she may have owned the furniture and physical assets apart from the 43 rooms in the Arlington. Her contributions left her with substantial financial benefits and when she died from a drug overdose she had $6,042 in her bank account and her total estate was worth $40,000.\nNick Oswald\nOswald worked as a bartender in a saloon in the crib district and when the man who owned the saloon retired, he gave he saloon to Oswald. This gave him his start in the business of prostitution as he invested the profits from the saloon to buy cheap houses to rent out to prostitutes. Oswald knew he needed a political alliance to be successful in the business so he sought out to be the associate of Savage. They soon formed an alliance and began working together.\nUse of Political Power\nIn 1904, urban reformers protested against the cribs on Alameda Street. Savage saw this as an opportunity to use his political pull to his own benefit. When the cribs were raided and closed, many of the women who were working at these cribs became working under Savage. Savage's political connections set him apart from others in the business as he was able to offer working conditions that were relatively free from harassment from law enforcement which was appealing to prostitutes and their pimps. The protection increased demand and women had to pay a premium to stay in these rooms, sometimes up to $100 and $150.\nHow He Protected Himself\nSavage was in control of the leases' of the Arlington and Belmont, but was not the property owner. By not being a property owner, he was not held accountable for how the building or business looked which helped him when it came to the reformers. Another way that Savage was able to thrive in the business was by employing managers to deal with the details of daily operation which freed him from direct involvement in an illegal business. In 1907 during a raid of the red-light district Savage was arrested along with manager Charles Armstrong for “keeping houses of ill fame”. Savage was able to avoid conviction by claiming he wasn't involved in running the houses. He claimed to have only had leases on the buildings and was subletting them to others. Davenport was not able to distance himself from the business of prostitution and was forced to plead guilty.\nDownfall\nIn 1906, Savage was hit with setbacks that began to loosen his grip on Los Angeles’ red-light district. His first setback was the loss of his business associate and common-law wife, May Davenport. She attempted overdosing on morphine following an argument with Savage and died 11 days later. He also lost his business partnership with Nick Oswald who in the years following attempted to build a rival red-light empire to end Savage’s reign. In 1907, it was implied in the Los Angeles Times that after Savage had “openly boasted of his control of the police and his ability to give ‘protection’ to the women who paid him high rental for rooms in his dives in the Arlington and Belmont” contributed to city authorities no longer allowing prostitution at the Arlington and Belmont. In 1909, progressive reformers changed the perspective on prostitution to favoring a policy of law enforcement and abolishment instead of toleration and regulation.\nBartolo Ballerino\nBartolo Ballerino was known as the \"Father of the Cribs\". He was born around 1830, and is Italian descent, but grew up in Chile. He migrated to California during the Gold Rush and invested in Los Angeles real estate. Most of the land he invested in turned into Hell's Half Acre. By 1880s he was already known as “crib king” and many sex workers lived and used his International Hotel for work. It was described as “shacks divided into small compartments called “cribs” which are rented to fallen women of all nationalities...” Ballerino controlled a saloon and restaurant catered to those in the sex industry. He claimed that he was taking care of the women who lived in the International Hotel saying he built a park and planted flowers. Documentary evidence shows this isn't true and they were constantly pestered for money for improvements.\nDownfall\nWomen's aid groups and religious leaders had already been working to close the cribs, but the real beginning of the end was initiated by party politics. In 1902, the Republican Los Angeles Times was clear in their support for P.W. Powers who was the party's mayoral candidate. To attempt to tie the Democratic candidate Meredith Snyder, the Times began a campaign against Chris Buckley, a Democratic booster. Buckley had recently acquired the late T. Bauer's series of cribs and the Times claimed Buckley and Ballerino were trying to create a super district of prostitution and gambling in Hell's Half Acre. Buckley was from San Francisco and had been the chief owner of prostitution houses there before they were closed by the mayor administration. Buckley used his connections in Los Angeles to move his empire there and teamed up with Ballerino to expand and take over the crib district.\nThe Times began to advocate for the abolishment of the red light district and were longer neutral on their coverage of Ballerino and the red light district. The Herald and other morning papers followed the Times efforts and this led reformers to try and create change within the crib district because police wouldn't. Hundreds of church workers marched and gathered more than 2,500 citizens to help shut down the cribs and help the women. Church group tried to deter clients by blocking the crib district and telling them their reputation was in jeopardy. They warned them that if reasoning didn't convince them, they would take pictures and put them in the papers.\nA group progressive women began visiting the crib district trying to help women who wanted to leave. They went with a closed carriage so any women who wanted to leave could be taken by carriage to a rescue home. They also left cards with names of rescue homes which were set up by private citizens. Mayor Snyder and the Democrats realized they could no longer turn blind eye to the issue as they were getting bad publicity in the media. On September 12, Ballerino was arrested for renting a crib for the purpose of prostitution. Charges were brought repeatedly, but Ballerino was able to fight them off when sex workers named in the complaints didn't show up for trail or “forgot” who Ballerino when testifying.\nIn December 1903, police raided the entire district which led Ballerino to build a series of cribs on the second floor of the International Hotel and claimed that anyone with money could rent the rooms. This brought back the sex workers who had fled during the raid. In January 1904, Buckley and Ballerino tried to work around the police and installed counters and shelves so that those working in the crib could claim to be selling cigars or displaying signs they were going into dressmaking. Ballerino continued to be arrested and prosecuted for renting to prostitutes on in February 1904 he was convicted and sentenced to 30 days in jail and fined $500. This marked the end of his reign as the “crib king”.\nSee also\n* Sonoratown, Los Angeles#Prostitution\nReferences"
    }
  ]
}