{
  "content": [
    {
      "type": "text",
      "text": "# Protected areas of the Czech Republic__disambig_1\n\nNational Nature Monument]]\nThere are several types of protected areas of the Czech Republic. The main form of landscape protection is delimitation of special protected areas. All the types of protected areas are determined by law.\nSpecial protected areas\nThere are six types of special protected areas distinguished by their size and importance. The types of large-scale protected areas are national park and protected landscape area; the types of small-scale protected areas are national nature reserve, nature reserve, national nature monument, and nature monument.\nNational park\nNational park (, abbreviated as NP) are defined as a large areas with a typical relief and geological structure and a predominant occurrence of natural or man-made ecosystems, unique and significant on a national or international scale in terms of ecology, science, education or awareness. They are established by the Czech Government. As of 2025, there are four national parks in the Czech Republic, with a total area of , which is 1.50% of the Czech Republic's area.\n{| class = \"wikitable\"\n!Short name\n!Full name\n!Established\n!colspan=2|Area\n!colspan=2|Protected zone area\n|-\n! style=\"text-align: left\" | Krkonoše\n|Krkonošský národní park (KRNAP)\n|1963\n|\n|\n|-\n! style=\"text-align: left\" | Podyjí\n|Národní park Podyjí\n|1991\n|\n|\n|-\n! style=\"text-align: left\" | Šumava\n|Národní park Šumava\n|1991\n|\n|\n|-\n! style=\"text-align: left\" | Bohemian Switzerland\n|Národní park České Švýcarsko\n|2000\n|\n| ||\n|-\n| colspan=7 |  The Šumava Protective Zone constitutes the Šumava PLA\n|}\nProtected landscape area\nProtected landscape area (abbreviated PLA; , abbreviated CHKO) is a large area of harmonic landscape with a typical relief, with a considerable share of natural forest and permanent grassy ecosystems, there can also be preserved human settlement monuments. They are established by the Czech Government. As of 2025, there are 27 protected landscape areas in the Czech Republic, with a total area of , which is 14.59% of the Czech Republic's area.\n{| class=\"wikitable sortable\"\n! Czech name\n! English translation\n! Established\n! colspan=2 | Area\n|-\n! style=\"text-align: left\" | Český ráj\n|Bohemian Paradise\n|1955\n|\n|-\n! style=\"text-align: left\" | Moravský kras\n|Moravian Karst\n|1956\n|\n|-\n! style=\"text-align: left\" | Šumava\n| Bohemian Forest\n|1963\n|\n|-\n! style=\"text-align: left\" | Jizerské hory\n| Jizera Mountains\n|1968\n|\n|-\n! style=\"text-align: left\" | Jeseníky\n| Ash Mountains\n|1969\n|\n|-\n! style=\"text-align: left\" | Orlické hory\n| Orlické Mountains\n|1969\n|\n|-\n! style=\"text-align: left\" | Žďárské vrchy\n| Žďár Hills\n|1970\n|\n|-\n! style=\"text-align: left\" | Český kras\n| Bohemian Karst\n|1972\n|\n|-\n! style=\"text-align: left\" | Labské pískovce\n| Elbe Sandstone Mountains\n|1972\n|\n|-\n! style=\"text-align: left\" | Beskydy\n| Beskids\n|1973\n|\n|-\n! style=\"text-align: left\" | Slavkovský les\n| Slavkov Forest\n|1974\n|\n|-\n! style=\"text-align: left\" | České středohoří\n| Central Bohemian Uplands\n|1976\n|\n|-\n! style=\"text-align: left\" | Kokořínsko – Máchův kraj\n| Kokořín Area – Mácha's Region\n|1976\n|\n|-\n! style=\"text-align: left\" | Lužické hory\n| Lusatian Mountains\n|1976\n|\n|-\n! style=\"text-align: left\" | Pálava\n| Pálava\n|1976\n|\n|-\n! style=\"text-align: left\" | Křivoklátsko\n| Křivoklát Area\n|1978\n|\n|-\n! style=\"text-align: left\" | Třeboňsko\n| Třeboň Basin\n|1979\n|\n|-\n! style=\"text-align: left\" | Bílé Karpaty\n| White Carpathians\n|1980\n|\n|-\n! style=\"text-align: left\" | Blaník\n| Blaník\n|1981\n|\n|-\n! style=\"text-align: left\" | Blanský les\n| Blanský Forest\n|1989\n|\n|-\n! style=\"text-align: left\" | Litovelské Pomoraví\n| Litovel Morava Basin\n|1990\n|\n|-\n! style=\"text-align: left\" | Broumovsko\n| Broumov Area\n|1991\n|\n|-\n! style=\"text-align: left\" | Poodří\n| Oder Basin\n|1991\n|\n|-\n! style=\"text-align: left\" | Železné hory\n| Iron Mountains\n|1991\n|\n|-\n! style=\"text-align: left\" | Český les\n| Upper Palatine Forest\n|2005\n|\n|-\n! style=\"text-align: left\" | Brdy\n| Brdy\n| 2016\n|\n|-\n! style=\"text-align: left\" | Soutok\n| Confluence\n| 2025\n|\n|}\nNational nature reserve\nNational nature reserve (, abbreviated NPR) is a smaller area of exceptional nature value, where a typical relief of typical geological composition is combined with ecosystems important on an international or national level. They are established by the Czech Ministry of Environment. As of 2025, there are 109 national nature reserves in the Czech Republic, with a total area of , which is 0.39% of the Czech Republic's area.\nNature reserve\nNature reserve (, abbreviated PR) is a smaller area with concentrated nature features and ecosystems typical for a given geographical region. They are established by the appropriate Regional Government () or Management of a National Park or Landscape Protected Area. As of 2025, there are 825 nature reserves in the Czech Republic, with a total area of , which is 0.56% of the Czech Republic's area.\nNational nature monument\nNational nature monument (, abbreviated as NPP) is a nature formation of a smaller area, usually geological or geomorphological formation, mineral or fossil collection locality or a habitat of endangered plants or animals in parts of ecosystems with a local environmental, scientific or esthetic importance.  They are established by the Czech Ministry of Environment. As of 2025, there are 126 national nature monuments in the Czech Republic, with a total area of , which is 0.14% of the Czech Republic's area.\nNature monument\n]]\nNature monument (, abbreviated as PP) is a nature formation of a smaller area, usually geological or geomorphological formation, mineral or fossil collection locality or a habitat of endangered plants or animals in parts of ecosystems with an international or national environmental, scientific or esthetic importance. They are established by the appropriate Regional Government or Management of a national park or protected landscape area. As of 2025, there are 1623 nature monuments in the Czech Republic, with a total area of , which is 0.44% of the Czech Republic's area.\nOther forms of landscape protection\nNature park\n]]\nNature park () is usually a large area serving the protection of a landscape against activities that could decrease its natural and esthetic value. They can be established by any State Environment Protection body.\nMemorable tree, group of trees or alley\nMemorable tree, group of trees or alley () can be established by any State Environment Protection body.\nNotable landscape feature\nNotable landscape feature () is usually a natural, cultural or historical feature typical for a given locality or region. They can be established by any State Environment Protection body.\nSpecially protected species of plants and animals\nSpecially protected species of plants and animals () are those species or subspecies which are very rare, generally endangered, scientifically or culturally important. They are listed in a Ministry of the Environment of the Czech Republic regulation. As of 2025, there are 505 plant species, 27 mushroom species and 309 animal species on the list.\nReferences\nExternal links\n*\nFurther reading\n*\n*"
    }
  ]
}