{
  "content": [
    {
      "type": "text",
      "text": "# Provisional People's Government of the Republic of Poland\n\nThe '''Provisional People's Government of the Republic of Poland' (), also known as the Government of Ignacy Daszyński, was established on 7 November 1918 in Lublin. It was a precursor government of a sovereign Poland following World War I. It proclaimed the creation of a constitutional republic with the right to parliamentary elections, nationalization of key industries, as well as social, labour, and land reforms. Prominent personalities of the provisional government included Stanisław Thugutt as Minister of Internal Affairs, Tomasz Arciszewski as Minister of Labour, as well as Col. Edward Rydz-Śmigły as the Minister of War and Supreme Commander of\nthe Polish Armed Forces. Ignacy Daszyński became Prime Minister. The Provisional Government dissolved itself after several days when Józef Piłsudski became Head of State (Naczelnik Państwa'') on 14 November 1918 in Warsaw.\nHistory\nas interim Head of State]]\nOn 2 October 1918, Polish members of the Austro-Hungarian parliament, led by Daszyński, forwarded a historic motion demanding restoration of an independent Polish state. They also recognized that the \"Polish question\" was an international matter and requested Polish participation in the Paris Peace Conference, in order to negotiate the re-emergence of sovereign Poland. Daszyński gave his speech to the Austrian parliament on 3 October 1918, stating:\n}}\nOn 15 October 1918, Daszyński and other Polish deputies to the Austrian parliament adopted a document in which they declared themselves to be Polish citizens, not Austrian. On 28 October, the Polish Liquidation Committee was formed, led by Wincenty Witos first in Kraków, then in Lwów. On 6 November, Daszyński and his deputies proclaimed the formation of the Polish People's Republic led by interim government based in Lublin, with Daszyński as Prime Minister. On Sunday, 10 November at 7 a.m., Józef Piłsudski, newly freed from 16 months in a German prison in Magdeburg, returned by train to Warsaw. Piłsudski, together with Colonel Kazimierz Sosnkowski, was greeted at Warsaw's railway station by Regent Zdzisław Lubomirski and by Colonel Adam Koc. Next day, due to his popularity and support from most political parties, the Regency Council appointed Piłsudski as Commander in Chief of the Polish Armed Forces. On 14 November, the Council dissolved itself and transferred all its authority to Piłsudski as Chief of State (Naczelnik Państwa). After consultation with Piłsudski, Daszyński's government dissolved itself and a new government formed under Jędrzej Moraczewski. Italy became the first country in Europe to recognise Poland's renewed sovereignty.\nReferences"
    }
  ]
}