{
  "content": [
    {
      "type": "text",
      "text": "# Pru Goward\n\n| successor2          = Mark Speakman\n| premier2            = Mike BairdGladys Berejiklian\n| office3             = Minister for Social Housing\n| term_start3         = 30 January 2017\n| term_end3           = 2 April 2019\n| premier3            = Gladys Berejiklian\n| predecessor3        = Brad Hazzard\n| successor3          = Melinda Pavey\n| office4             = Minister for Women\n| term_start4         = 3 April 2011\n| term_end4           = 30 January 2017\n| premier4            = Barry O'FarrellMike Baird\n| predecessor4        = Linda Burney\n| successor4          = Tanya Davies\n| office5             = Minister for Mental HealthAssistant Minister for Health\n| term_start5         = 2 April 2015\n| term_end5           = 30 January 2017\n| premier5            = Mike Baird\n| predecessor5        = Jai Rowell\n| successor5          = Tanya Davies\n| office6             = Minister for Medical Research\n| term_start6         = 2 April 2015\n| term_end6           = 30 January 2017\n| premier6            = Mike Baird\n| predecessor6        = Jillian Skinner\n| successor6          = Brad Hazzard\n| office7             = Minister for Planning\n| term_start7         = 23 April 2014\n| term_end7           = 2 April 2015\n| premier7            = Mike Baird\n| predecessor7        = Brad Hazzard\n| successor7          = Rob Stokes\n| constituency_MP9    = Goulburn\n| parliament9         = New South Wales\n| term_start9         = 24 March 2007\n| term_end9           = 1 March 2019\n| predecessor9        = new district\n| successor9          = Wendy Tuckerman\n| birth_name          = Prudence Jane Goward\n| birth_date          =\n| birth_place         = Adelaide, South Australia, Australia\n| death_date          =\n| death_place         =\n| party               = Liberal Party\n| relations           =\n| spouse              = Alastair Fischer (m. 1973; dis. 1983) David Barnett (1986–2022 (his death))\n| children            = 3 (including Tziporah Malkah)\n| alma_mater          = University of Adelaide (1974)\n| website             =\n| footnotes           =\n| honorific_prefix    = The Honourable\n| honorific_suffix    =\n}}\nPrudence Jane Goward  (born 2 September 1952) is an Australian former politician and Liberal member of the New South Wales Legislative Assembly from 2007 to 2019, representing the seat of Goulburn.\nShe was the New South Wales Minister for Family and Community Services and Minister for Social Housing, from January 2017 to March 2019 in the Berejiklian government, and the Minister for Prevention of Domestic Violence and Sexual Assault, from 2015 until March 2019. Goward has also previously served as the Minister for Mental Health, Minister for Medical Research, and Assistant Minister for Health between April 2015 and January 2017, and the Minister for Women between 2011 and January 2017, in the second Baird government and the Minister for Planning during 2014 and 2015. With the first Berejiklian government she returned to Community Services portfolio which she previously held between 2011 and 2014, in the O'Farrell and first Baird governments.\nPrior to entering politics, Goward served as the Australian Federal Sex Discrimination Commissioner and Commissioner Responsible for Age Discrimination with the Australian Human Rights and Equal Opportunity Commission. In 2019, Goward became an academic with Western Sydney University.\nEarly life and personal background\nGoward was born to Gerald Goward and Zipporah Riggs, and was raised in Adelaide. She attended Morphett Vale Primary School, Willunga High School and gained entrance to Woodlands Church of England Girls Grammar School on a half scholarship. She graduated with a Bachelor of Arts (Econ) (Hons) in 1974 from the University of Adelaide.\nShe was married from 1973 to 1983 to university lecturer Alastair Fischer, whom she met while studying at Adelaide University.\nGoward married journalist David Barnett in 1986. Goward and Barnett maintained a close personal friendship with former prime minister John Howard for many years, and jointly wrote a biography of Howard in 1997. Barnett died in August 2022, aged 90.\nShe is the mother of three daughters, former model, actress and television host Tziporah Malkah (earlier known as Katherine \"Kate\" Fischer), Penny Fischer, and Alice Barnett. She has two granddaughters.\nCareer\nGoward joined ABC TV and Radio in 1980, firstly as a reporter with Nationwide, then as a political correspondent on the 7.30 Report, and later as host of the 2CN Morning Show and Daybreak on Radio National. In 1994, Goward was the narrator of the ABC's 5-part documentary series The Liberals: Fifty Years Of The Federal Party, which detailed the events of the Liberal Party of Australia from 1944 to 1994. She has also worked as a high school teacher, a university lecturer in economics, a broadcast journalism lecturer at University of Canberra, a media consultant and freelance writer.\nShe was Executive Director of the Office of the Status of Women in the Department of the Prime Minister and Cabinet from 1997 to 1999. In this position, Goward criticised the business community for the \"primitive attitudes\" that kept women out of senior executive ranks and boardrooms. At the time of her appointment, she was criticised by Anne Summers, a previous Executive Director, and Carmen Lawrence, a prominent female politician, for her perceived inexperience and political connection to the Howard government.\nGoward was the Sex Discrimination Commissioner at HREOC, a five-year tenure she began in July 2001. In this role, she called for the introduction of paid maternity leave, a position rejected by the Howard government. Howard extended her tenure for an additional three years in July 2006. However, she successfully ran for New South Wales state parliament in March 2007.\nPru Goward, while Minister for the Department of Family and Community Services, initiated the Going Home Staying Home reforms which redistributed funding for youth refuges across the state.\nIn August 2019, Western Sydney University announced that Goward had been appointed Professor of Social Intervention and Policy.\nParliamentary career\n]]\nIn 2006, Goward nominated for Liberal Party preselection for the New South Wales state parliament in seat of Epping in Sydney's north-west, but was defeated by the former President of the Right to Life Association, Greg Smith. She was subsequently preselected unopposed for the seat of Goulburn, to replace retiring Liberal frontbencher Peta Seaton. Goward was expected to win the seat, however an unexpectedly strong swing to Labor in the Southern Highlands area of the seat put her victory in doubt on election night. Her main contender, the Independent Mayor of Goulburn, Paul Stephenson, conceded defeat on 29 March 2007. Goward was quoted as saying that she \"didn't expect to win it. I knew I was behind the whole time, even four days before the election we were told I was five points behind, so I'm just so grateful.\"\nAs the minister responsible for child protective services there have been reports of inadequate staffing and services to meet the need.\nAs the state's Community Services Minister, Goward announced in mid-March 2014 that around 300 harbourfront public housing properties will be sold under the management of Government Property NSW, with the proceeds reinvested into the public housing system. Considered historic structures, the harbourfront properties are located at Millers Point, The Rocks and on Gloucester Street, and include the Sirius complex, a high-rise, 79-unit apartment complex near the Harbour Bridge. The government expects to generate hundreds of millions of dollars from the sales and Goward explained, as a justification of the sale: \"In the last two years alone, nearly [A]$7 million has been spent maintaining this small number of properties. That money could have been better spent on building more social housing, or investing in the maintenance of public housing properties across the state.\"\nDue to the resignation of Barry O'Farrell as premier, and the subsequent ministerial reshuffle by Mike Baird, the new Liberal Leader, in April 2014 in addition to her existing responsibilities as a minister, Goward was appointed as the Minister for Planning; and lost the portfolio of Family and Community Services. Following the 2015 state election, Goward was sworn in as the Minister for Mental Health, the Minister for Medical Research, the Minister for Women, the Minister for Prevention of Domestic Violence and Sexual Assault (a newly created portfolio), and the Assistant Minister for Health in the second Baird government. Following the resignation of Baird as premier and the election of Gladys Berejiklian as Liberal leader, in January 2017 Goward was sworn in as the Minister for Family and Community Services, the Minister for Social Housing, and the Minister for Prevention of Domestic Violence and Sexual Assault.,\nIn December 2018, she announced that she would not be contesting the next election in March 2019.\nControversies\nIn May 2007, Goward was caught speeding in a school zone. This was her second driving offence for 2007. Goward said \"It was extremely careless on my part and like thousands of other drivers I deeply regret it.\"\nIn February 2014, Katrina Hodgkinson, the Nationals member for Burrinjuck, which bordered Goulburn to the west, announced that she would be seeking Nationals preselection for Goulburn, then occupied by Goward. Her decision followed a statewide electoral redistribution by the NSW Electoral Commission that resulted in Burrinjuck being renamed as Cootamundra after being significantly redrawn, with effect from the 2015 state election. Her announcement resulted in a dispute between the Nationals and Liberals; and on 28 February, Hodgkinson announced she would withdraw her nomination for Goulburn. Hodgkinson subsequently contested the newly constituted seat of Cootamundra, and won the seat for the National Party.\nIn October 2021 Goward was criticised for being tone-deaf and classist following her publication of a column in the Australian Financial Review titled 'Australia's social underclass is not a force to be ignored', in which she referred to lower-income Australians with the derogatory term 'proles'.\nAwards\nGoward was awarded a Centenary Medal in 2001 for services to journalism and women's rights. She was appointed an Officer of the Order of Australia in the 2023 Australia Day Honours.\nReferences\nExternal links\n*[https://web.archive.org/web/20051107014258/http://www.hreoc.gov.au/about_the_commission/president_commissioners/goward.html Profile of Pru Goward at the Human Rights and Equal Opportunity Commission]\n*[http://www.prugoward.com.au/ Official Website of Pru Goward]\nPublications\n*\n*\n2019}}\n2017}}\n2014 }}\n2015}}\n2019}}\n2017}}\n2017}}\n2017}}\n2019 }}\n2019 }}"
    }
  ]
}