{
  "content": [
    {
      "type": "text",
      "text": "# PS Kingswear Castle\n\n{|\n|Ship registry=\n|Ship route=*River Dart (1924)\n*River Medway and Thames (1985)\n*River Dart (2013)\n|Ship ordered=1924\n|Ship awarded=\n|Ship builder=Philip and Son, Dartmouth, UK\n|Ship original cost=\n|Ship yard number=\n|Ship way number=\n|Ship laid down=\n|Ship launched=1924\n|Ship sponsor=\n|Ship christened=\n|Ship completed=\n|Ship acquired=\n|Ship commissioned=\n|Ship recommissioned=\n|Ship decommissioned=\n|Ship maiden voyage=\n|Ship in service=\n|Ship out of service=\n|Ship renamed=\n|Ship reclassified=\n|Ship refit=\n|Ship struck=\n|Ship reinstated=\n|Ship homeport=\n|Ship identification=*\n*Callsign: MCGH6\n|Ship motto=\n|Ship nickname=\n|Ship honours=\n|Ship honors=\n|Ship captured=\n|Ship fate=\n|Ship status=Active\n|Ship notes=\n|Ship badge=\n}}\nLOA\n* LBP\n|Ship beam=\n|Ship height=\n|Ship draught=\n|Ship draft=\n|Ship depth=\n|Ship hold depth=\n|Ship decks=\n|Ship deck clearance=\n|Ship ramps=\n|Ship ice class=\n|Ship power=\n|Ship propulsion=Compound Diagonal Steam engine (1904) built by Cox and Co of Falmouth\n|Ship sail plan=\n|Ship speed=\n|Ship range=\n|Ship endurance=\n|Ship test depth=\n|Ship boats=\n|Ship troops=\n|Ship capacity=\n|Ship complement=\n|Ship crew=\n|Ship time to activate=\n|Ship sensors=\n|Ship EW=\n|Ship armament=\n|Ship armour=\n|Ship armor=\n|Ship aircraft=\n|Ship aircraft facilities=\n|Ship notes=\n}}\n|}\n'PS Kingswear Castle' is a steamship. She is a coal-fired river paddle steamer, dating from 1924 with engines from 1904. After running summer excursions on the River Medway and the Thames for many years she returned to the River Dart in Devon in December 2012 to run excursions from 2013 onwards on the river she was built on and for. Kingswear Castle is listed as part of the National Historic Fleet of ships of \"Pre-eminent National Significance\".\nHistory\n.]]\nThe Kingswear Castle was built by Philip & Sons of Dartmouth in 1924 for service on the River Dart, following sister ships Compton Castle and Totnes Castle, and was operated by the River Dart Steamboat Co. Her predecessor of the same name from 1904 is now a rotted and barely recognisable hulk in the River Dart, but the engines were re-used in the current steamboat.\nKingswear Castle was chartered to the United States Navy during World War II, and was used for carrying stores and personnel at Dartmouth. In 1965 Kingswear Castle was withdrawn from service and became the first purchase of the Paddle Steamer Preservation Society (PSPS) two years later. She was then taken to the Isle of Wight and was moored at Island Harbour Marina from August 1967 to June 1971. However, due to her deteriorating condition, she was then taken to the River Medway.\nAfter various difficulties and a great deal of restoration work she was finally brought into service again in 1985, and was operated by the Paddle Steamer Kingswear Castle Trust based at Chatham Historic Dockyard in Kent, in association with the PSPS.\nOn 18 December 2012 she returned to the River Dart again, under charter to the Dartmouth Steam Railway and Riverboat Company, to run passenger trips around Dartmouth Harbour and up river to Totnes.\nSee also\n*PS Waverley\n*PS Wingfield Castle\n*PS Medway Queen\n*Paddle Steamer Preservation Society\nReferences\nExternal links\n*[http://www.kingswearcastle.co.uk/ Paddle Steamer Kingswear Castle Trust]\n*[http://www.paddlesteamers.org/ Paddle Steamer Preservation Society (PSPS)]"
    }
  ]
}