{
  "content": [
    {
      "type": "text",
      "text": "# Psychic Wars\n\n| released        = February 22, 1991\n| runtime         = 50 minutes\n}}\nis a 1991 Japanese OVA anime film created by Toei Animation based on a novel by Yasuaki Kadota. It has been translated for the English-speaking world at least twice.\nPlot\nAn old psychic woman enters a hospital in Osaka and asks surgeon Dr. Ukyo Rettsu to remove a large cancer growth that is killing her. Dr. Rettsu discovers that the cancer is in fact a demon messenger, heralding that a prophesied demonic invasion from 5,000 years ago is coming soon, which tells the surgeon that he is, in fact, the man prophesied to halt the it. Although the old woman dies, her glowing spirit imbues Dr. Rettsu with powers including superhuman toughness, strength and speed. In order to stop the invasion as predicted, Rettsu and his lover Fuyuko Asahina start investigating Japan's past, which leads to an ancient temple where Rettsu has to kill a giant demon.\nThey next go to Kyoto University to consult Rettsu's old friend Dr. Takase, who redirects them to the old ruins of the Jomon period under suspicions the ancient demon civilization might have been located there. In another expedition with Asahina, Rettsu explores the place and finds a portal that takes him back five millennia into history, meeting in the process five nun spirits  who promise to help him. In the Jomon period, Rettsu allies with human natives and protects them from the demons, and ultimately infiltrates the demon civilization in its underground realm.\nAfter reuniting with Asahina, Rettsu plans to marry her, but is warned by the Five Goddesses that the demon race is not extinct yet, as the queen is still alive. Taking Rettsu to a secret catacomb, Asahina then reveals that she is the demon queen herself, who assumed human form after the destruction of her civilization. Through history she seduced men to spawn demons and send them back in an attempt to rebuild her race, but they were constantly killed by the five nuns, and now she asks Rettsu to die with her, as she had fallen in love with him. Hearing his rejection, the queen attacks and dominates Rettsu, but he is saved by the goddesses, who help him defeat her. Asahina dies proclaiming her love for him, after which Rettsu returns to his life.\nReleases\nToei Animation released a VHS of the Psychic Wars OVA on February 22, 1991. Psychic Wars was broadcast in North America by Super Channel on December 1, 2008 and on the Sci-Fi Channel. The OVA is licensed in the US and United Kingdom by Manga Entertainment.\nReferences\nExternal links\n*"
    }
  ]
}