{
  "content": [
    {
      "type": "text",
      "text": "# Public Service Recognition Award\n\nThe Public Service Recognition Award is an honor bestowed by the Town of Dedham, Massachusetts to recognize citizens who have performed outstanding acts of service to the community.  It is presented \"to a citizen or citizens of Dedham who by his/her actions best exemplifies the spirit of public service through their sharing of time, talent, and energy for the betterment of our Community.\"  Winners receive an original painting of the Fairbanks House, America's oldest timber-frame house.\nThe founding chairman of the committee has said that \"There are far too many unsung heroes in our community.  Our goal is to sing some of their praises and give them the recognition they deserve for the good works they do day in and day out.\"  Donald Gosselin, the first recipient of the award, said in his acceptance speech that \"Any program that encourages volunteering is a great benefit to our community.\"  He added that there wasn't \"enough capacity in this auditorium\" to recognize all of the volunteers in town.\nIn 2012, Town Meeting created the Public Service Recognition Committee to select the winner and present the award immediately before the Spring Annual Town Meeting.  This committee has seven members, appointed by the Town Moderator, with one from each of the town's seven precincts.  Nominations are solicited from members of the public.\nWinners\n{| class=\"wikitable\"\n! Year\n! Adult\n! Youth\n|-\n| 2013||Donald Gosselin ||Not awarded\n|-\n| 2014||Amy Black  ||Caroline Bell\n|-\n| 2015||Bill Podolski ||Not awarded\n|-\n| 2016||Rita Mae Cushman||Jakob Farnham and Kyle Fonseca\n|-\n|2017 ||Tim Kelleher ||\n|-\n|2018 ||Dimitria Sullivan||Eric and Jack Linari\n|-\n|2024 || Carol Flavell || Lauren Peloquin\n|}\nCommittee chairmen\n{| class=\"wikitable\"\n! Year\n! Chairman\n|-\n| 2013||Brian Keaney\n|-\n| 2014||Susan Fay\n|-\n| 2015||Susan Fay\n|-\n| 2016||Marianne Martin\n|-\n| 2018||Cheryl Schoenfeld\n}}"
    }
  ]
}