{
  "content": [
    {
      "type": "text",
      "text": "# Puppet (software)\n\n| latest release version =\n| latest release date    = |df=yes}}\n| programming language   = C++ & Clojure from 4.0, Ruby\n| operating system       = Linux, Unix-like, Microsoft Windows\n| platform               =\n| size                   =\n| language               =\n| genre                  =\n| license                = Open Source Puppet: Apache for >2.7.0, GPL for prior versions. Puppet Enterprise: proprietary\n| website                =\n}}\nPuppet is a software configuration management tool used to manage stages of the IT infrastructure lifecycle.\nPuppet uses an open-core model; its free-software version was released under version 2 of the GNU General Public License (GPL) until version 2.7.0, and later releases use the Apache License, while Puppet Enterprise uses a proprietary license. Puppet and Puppet Enterprise operate on multiple Unix-like systems (including Linux, Solaris, BSD, Mac OS X, AIX, HP-UX) and has Microsoft Windows support. Puppet itself is written in Ruby. Facter, Puppet’s cross-platform system profiling library, is written in C++. Puppet Server and Puppet DB are written in Clojure.\nIt is developed by Puppet Inc., which is owned by Perforce, which is owned in turn by private equity firms.\nDesign\nPuppet consists of a custom declarative language to describe system configuration.\nPuppet is model-driven, requiring limited programming knowledge to use.\nPuppet is designed to manage the configuration of Unix-like and Microsoft Windows systems declaratively.\nArchitecture\nPuppet follows client-server architecture. The client is known as an agent and the server is known as the master. For testing and simple configuration, it can also be used as a stand-alone application run from the command line.\nPuppet Server is installed on one or more servers, and Puppet Agent is installed on all the machines to be managed. Puppet Agents communicate with the server and fetch configuration instructions. The Agent then applies the configuration on the system and sends a status report to the server.\nPuppet resource syntax:\ntype { 'title':\nattribute => value\n}\nExample resource representing a Unix user:\nuser { 'harry':\nensure => present,\nuid    => '1000',\nshell  => '/bin/bash',\nhome   => '/home/harry'\n}\nCompany\n| industry = Computer software\n| key_people = Luke Kanies (Founder), Yvonne Wassenaar (CEO), Andrew Shafer\n| products = Puppet, Puppet Enterprise, and Puppet Forge\n| foundation =\n| location = Portland, Oregon, U.S.\n| owner = Perforce\n| homepage =\n}}\nPuppet Inc., is a subsidiary of Perforce based in Portland, Oregon, USA.\nIn 2005, Puppet was founded by former CEO Luke Kanies. On Jan. 29, 2019 Yvonne Wassenaar replaced Sanjay Mirchandani as CEO. Wassenaar previously worked at Airware, New Relic and VMware. In February 2011 Puppet released its first commercial product, Puppet Enterprise, built on its open-source base, with some extra commercial components. Puppet purchased the infrastructure automation firm Distelli in September 2017. Puppet rebranded Distelli's VM Dashboard (a continuous integration / continuous delivery product) as Puppet Pipelines for Applications, and K8s Dashboard as Puppet Pipelines for Containers. The products were made generally available in October, 2017. In May 2018, Puppet released Puppet Discovery, a tool to discover and manipulate resources in hybrid networks. In June 2018, Puppet raised an additional $42 million for a total of $150 million in funding. The round was led by Cisco and included Kleiner Perkins, True Ventures, EDBI, and VMware. Puppet's partners include VMware, Amazon Web Services, Cisco, OpenStack, Microsoft Azure, Eucalyptus, and Zenoss.\nIn April 2022, it was announced Puppet had been acquired by the Minneapolis-headquartered software developer, Perforce. The company subsequently laid off 15% of Puppet's workforce in Portland.\nControversy\nFollowing acquisition by Perforce in 2022, subsequent policy changes implemented by Perforce in early 2025 significantly altered the accessibility and distribution of Puppet software which prompted frustration within the open-source community.\nPerforce announced that future Puppet binaries and packages would be published to a private repository with access granted to community contributors under an End-user license agreement (EULA) and usage beyond 25 nodes would require a commercial license. Although the core Puppet codebase remains licensed under the Apache 2.0 license, the frequency of public commits and updates was reduced. The open-source community criticized these changes, viewing them as a departure from Puppet’s original open-source principles.\nConcerns were raised about diminished transparency and the prioritization of commercial interests over community collaboration. In response, members of the community initiated a fork of the project, called OpenVox, with the aim of preserving and continuing the open-source development of Puppet. The new fork also sought to avoid legal complications, as Perforce retained control over the Puppet trademark which restricted its use by third parties.\nSee also\n* Comparison of open-source configuration management software\n* CFEngine\nReferences\nExternal links\n*"
    }
  ]
}