{
  "content": [
    {
      "type": "text",
      "text": "# Qar (Ancient Egyptian official)\n\nQar ( 2280 BC}}) was an official of the Sixth Dynasty of Egypt. Son of Idu, he probably lived and served between Merenre I and Pepi II.\nTomb\nThe tomb of Qar (G 7101) lies north of the edge of the Eastern Giza Cemetery, north of the nearby double mastaba of Kawab. The above ground part of the superstructure has fallen apart and very little of it remains. Most of the excavating that was done was with the underground level of the mastaba. The section of the stairway, leading into the tomb is the only remaining part of the above ground section. The superstructure is not the same as traditional mastabas. This tomb does have a different design from previous dynasties. The top portion of the mastabas was made out of mud brick, and it had a below section containing the actual tomb. The lower section is a walled courtyard with a rock cut chapel, with burial chambers reach by shafts. A staircase leads down into the tome from the surface. The walls of the courtyard are decorated with many scenes of Qar. Some of these decorations are carved into limestone blocks and then inlayed into the natural rock. Others are directly carved into the natural rock. Many portions of the blocks have been displaced or broken up leaving many scenes incomplete. The staircase lowers down into the tomb and then open up to an open courtyard and is sort of the base. The courtyard has four small rooms attached to it. Each room that was excavated did show various amount of damage to wall decorations. Scenes were found intact while others had huge scenes missing. A second chapel was found, it is thought of being made for Qar's wife. The tomb does have about seven associated shafts, one of them being Qar.\nExcavation\nThe tomb was first excavated by George Reisner and Alan Rowe. Reisner was the Director of the Harvad University Museum. The first excavation was done from December 1924 to January 1925. Reisner had departed from the site on January 24, 1925. Over the years, the site was revisited to make corrections to the drawings or do more excavation. The years in which trips were made back to the site were in 1951, 1973, 1974, and 1975.\nScenes\nQar did incorporate a lot of his family into scenes throughout his tomb. One of the first scenes into the tomb is a depiction of Qar and his son Idu. This scene can be located on the wall on the staircase leading down into the courtyard below. Both men are wearing a wig, short beard, broad collar, bracelets, and a short skirt. Qar is facing to the right with a throw stick in his right hand. Idu is also facing right with a throw stick in his right hand and in his left hand are three birds. So, Qar and his son Idu are in a fowling scene together and to show that he is a great provider. In the scene the Qar and Idu are both identified with text above them. The staircase is where decorations start because the chapel portion of the mastaba has fallen apart. Another scene that shown to depict him and his family is the scene in Room E, North Wall. Qar and his mother \"khenut\" are seated next to each other facing right. They are both wearing the sort of similar outfits, a short wig, a broad collar, bracelets, and a half-pleated skirt. The scene shows himself and his mother sitting a table filled with bread and other things. It is a scene that shows Qar telling everyone about what he wants to eat for the afterlife.\nFamily\nThe walls of the tomb are also decorated with scenes of Qar and different family members. During the excavations it was found out that one of the shafts of the superstructure belongs to Qar's wife resting spot.\nThe tomb depicts several members of his family:\n* His mother Khenout ().\n* Gefi (gfi), his wife, beloved by him (ḥmt.f mrt.f) who bears the titles of known to the king () and priestess of Hathor (ḥmt-nṯr [ḥwt-ḥr]).\n* Idw, a beloved son (sȝ.f mry.f) who carries at the time of the tomb construction several titles, some being already carried by his father: scribe of the royal records in the presence () and overseer of the scribes ().\n* Nekhti, a brother (sn.f Nḫti).\n* Tjetout, a beloved sister () and another beloved sister, Bendjet () who is probably the person buried in G7215.\nDependents\nIn the tombs there are listing of kids of Qar. There are a few scenes depicted Qar doing many activities with his kids.\nSeveral dependents of Qar were also represented with their most relevant titles:\n* Idu, lector priest ().\n* Idu, scribe (zš).\n* Idu, true(?) document scribe of the Great House ().\n* Nekheti, overseer of k3-servants ().\n* Nekheti, companion, supervisor of the king, scribe, noble of the king ().\n* Nesouhor, overseer of the portal ().\n* Rensi, director of the dining hall ().\n* Kheti, scribe.\n* Qar, senior lector priest ().\nTitles\nHis titles were:\n{| class=\"wikitable\"\n|+\n!Title\n!Translation\n!Index Jones\n|-\n|imy-rȝ kȝt nbt\n|overseer of all works\n|945\n|-\n|iwn knmwt mȝˁ\n|true support of Knmwt\n|23\n|-\n|imy-rȝ wp(w)t ḥtp(w)t-nṯr m prwy\n|overseer of the division(s)/apportionments of divine offerings in the two houses\n|403\n|-\n|imy-rȝ niwt ȝḫt(y)-ḫwfw\n|overseer of the pyramid town of Khufu\n|578\n|-\n|imy-rȝ niwt nṯr-mn-kȝw-rˁ\n|overseer of the pyramid town of Menkaoure\n|?\n|-\n|imy-rȝ ẖnw\n|overseer of the Residence\n|738\n|-\n|imy-rȝ zš(w) ˁprw m pr[wy]\n|overseer of the scribes of the crews in the [two] houses\n|784\n|-\n|mdw rḫyt\n|staff of the Rekhyet-people/commoners/ herdsman of rekhyt\n|1698\n|-\n|ḥm-nṯr Mȝˁt\n|priest of Ma't\n|1930\n|-\n|ḥry-sštȝ n wḏ(t)-mdw nbt\n|privy to the secret of all proclamations/decrees\n|2262\n|-\n|ḥry-sštȝ n kȝt nbt\n|privy to the secret of all works\n|2360\n|-\n|ḫnty-š Mn-nfr-Mry-rˁ\n|official of the pyramid Nfr-Mry-re Pepi\n|2535\n|-\n|ẖry-tp nzwt\n|king's liegeman/royal chamberlain\n|2874\n|-\n|zȝb imy-rȝ zš(w)\n|juridical overseer of scribes\n|2933\n|-\n|zȝb imy-rȝ zš(w) n kȝt nb(t)\n|juridical overseer of scribes of all works\n|2938\n|-\n|zȝb zš\n|juridical scribe\n|2964\n|-\n|zš ˁ(w) (nw) nzwt\n|scribe of the royal documents/records, king's document scribe\n|3057\n|-\n|zš ˁ(w) (nw) nzwt ḫft-ḥr\n|scribe of the royal records in the presence, king's document scribe in the presence\n|3063\n|-\n|zš ˁ(w) (nw) nzwt ḫft-ḥr mȝˁ\n|true king's letter scribe in the presence, true\n|3065\n|-\n|smr wˁty\n|sole companion\n|3268\n|-\n|sḥḏ wˁb(w) Wr-ḫˁ.f-rˁ\n|inspector of the priest of (the pyramid), 'Great-is-Khafra'\n|3379\n|}\nTranslation and indexes from Dilwyn Jones\nReferences\n*\n*\nExternal links\n*[http://www.gizapyramids.org/ The Giza Archives]  maintained by the Museum of Fine Arts in Boston. Quote: \"This website is a comprehensive resource for research on Giza. It contains photographs and other documentation from the original Harvard University - Boston Museum of Fine Arts Expedition (1904 to 1947), from recent MFA fieldwork, and from other expeditions, museums, and universities around the world.\"\n*While still reachable the Giza Archives became Digital Giza in 2011 and is maintained by Harvard University. The website can be reached here:[http://giza.fas.harvard.edu/ The Digital Giza]."
    }
  ]
}