{
  "content": [
    {
      "type": "text",
      "text": "# Qian Hong (Jin dynasty)\n\nMay 271\n| monarch = Emperor Wu of Jin\n| office1 = Inspector of Yang Province (揚州刺史)\n| term_start1 = February 266 or after\n| term_end1 = ?\n| monarch1 = Emperor Wu of Jin\n| office2 = Army Protector Who Inspires Might(振威護軍)\n| term_start2 =\n| term_end2 =\n| monarch2 = Cao Huan\n| office3 = Administrator of Shu Commandery(蜀郡太守)\n| term_start3 =  December 263\n| term_end3 =\n| monarch3 = Cao Huan\n| birth_date = Unknown\n| birth_place = Fucheng County, Hebei\n| death_date = May 271\n| death_place = Yuzhong County, Gansu\n| father = Qian Zhao\n| occupation = Official\n}}\nQian Hong (died May 271) was an official of the Jin dynasty of China. He previously served in the state of Cao Wei during the Three Kingdoms period. His father, Qian Zhao (), was a notable military general of the Cao Wei state.\nLife\nQian Hong was the second son of Qian Zhao (), a military general of the Cao Wei state in the Three Kingdoms period. He initially served as the Administrator () of Longxi Commandery (隴西郡; around present-day Longxi County, Gansu). In late 263, he participated in the campaign against Wei's rival state, Shu Han, as a subordinate of the Wei general Deng Ai. After the fall of Shu, the Wei government appointed Qian Hong as the Administrator of Shu Commandery (蜀郡; around present-day Chengdu, Sichuan). Between 264 and 265, he was promoted to Army Protector Who Inspires Might ().\nIn 266, following the replacement of the Cao Wei state by the Jin dynasty (266–420) in February that year, Qian Hong was appointed as the Inspector () of Yang Province. In February 270, he repelled an invasion led by Ding Feng, a general from the Jin dynasty's rival state Eastern Wu. Around the time, Qian Hong had disagreements with his superior, Chen Qian (), who was the overall supervisor of military affairs in Yang Province. Both Qian Hong and Chen Qian wrote reports to Emperor Wu to accuse each other of incompetence. Emperor Wu eventually reassigned Qian Hong to be the Inspector of Liang Province.\nIn 271, the Xianbei chieftain Tufa Shujineng started a rebellion in Beidi Commandery (北地郡; around present-day Tongchuan, Shaanxi) and led his tribal forces to attack Jincheng Commandery (金城郡; around present-day Yuzhong County, Gansu). Qian Hong, then the Inspector of Liang Province, led government forces to attack the rebels. However, due to his incompetence, he caused the Qiang tribes to rebel as well. He was eventually cornered by the rebels and killed in battle.\nSee also\n* Lists of people of the Three Kingdoms\nReferences\n* Chen, Shou (3rd century). Records of the Three Kingdoms (Sanguozhi).\n* Fang, Xuanling (ed.) (648). Book of Jin (Jin Shu).\n* Pei, Songzhi (5th century). Annotated Records of the Three Kingdoms (Sanguozhi zhu)."
    }
  ]
}