{
  "content": [
    {
      "type": "text",
      "text": "# Qinghai-Tibet Networking Project\n\nThe HVDC Qinghai-Tibet, Qinghai-Tibet Networking Project, or Qinghai-Tibet Interconnection Project () began operation in December 2011, extending from Xining in Qinghai Province in the east to Lhasa in Tibet in the west. Tibet, rich in hydropower resources, serves as a crucial energy relay base for the \"West-East Electricity Transmission\" initiative (). However, the region has faced significant challenges, including severe power shortages during the winter and difficulties in consuming excess power during the water-abundant summer months. The commissioning of the Qinghai-Tibet Networking Project has alleviated Tibet's energy bottleneck, fundamentally resolving its long-standing power supply issues.\nThe Qinghai-Tibet Networking Project is the world's highest-altitude and longest DC transmission line traversing permafrost regions. The project has a total investment of 13.918 billion RMB.\nProject\nThe DC section of the Qinghai-Tibet Networking Project spans a total length of 1,038 kilometers, supported by 2,361 towers, including 1,207 towers situated in the tundra region. The Qinghai section alone covers 608 kilometers, with 1,395 pylons at altitudes ranging between 2,800 and 5,300 meters. In June 2015, the project passed the power reversal test, enabling the first-ever transmission of Tibetan hydropower out of the region. Since then, the project has established a pattern of exporting Tibetan hydropower to Qinghai during the summer and autumn, while supplying green power from Qinghai to Tibet in the winter and spring. This has generated economic benefits for Tibet and optimized the allocation of clean energy resources across western China.\nIn 2024, the project will undergo further expansion with the DC Phase II, increasing converter capacity by an additional 600 MW, building on the existing 600 MW capacity. This expansion will significantly enhance the project's forward and reverse transmission capabilities, further strengthening its role in the region's energy infrastructure.\nSee also\n*Lhasa Converter Station\n*Lhasa 500kV Transmission Project\n*Golmud Converter Station\n*Sichuan-Tibet Networking Project\n*Central Tibet Networking Project\nReferences"
    }
  ]
}