{
  "content": [
    {
      "type": "text",
      "text": "# Queen of Heaven (antiquity)__disambig_1\n\nQueen of Heaven was a title given to several ancient sky goddesses worshipped throughout the ancient Mediterranean and the ancient Near East. Goddesses known to have been referred to by the title include Inanna, Anat, Isis, Nut, Astarte, and possibly Asherah (by the prophet Jeremiah). In Greco-Roman times, Hera and Juno bore this title. Forms and content of worship varied.\nInanna\ncylinder seal depicting the goddess Inanna resting her foot on the back of a lion while Ninshubur stands in front of her paying obeisance, c. 2334-2154 BC]]\nInanna is the Sumerian goddess of love and war. Despite her association with mating and fertility of humans and animals, Inanna was not a mother goddess and is rarely associated with childbirth. Inanna was also associated with rain and storms and with the planet Venus. The Venus tablet of Ammisaduqa, believed to have been compiled around the mid-seventeenth century BCE, referred to  the planet Venus in the tablet as the \"bright queen of the sky\" or \"bright Queen of Heaven\".\nAlthough the title of Queen of Heaven was often applied to many different goddesses throughout antiquity, Inanna is the one to whom the title is given the most number of times. In fact, Inanna's name is commonly derived from Nin-anna which literally means \"Queen of Heaven\" in ancient Sumerian (It comes from the words NIN meaning \"lady\" and AN meaning \"sky\"), although the cuneiform sign for her name (Borger 2003 nr. 153, U+12239 𒈹) is not historically a ligature of the two.\nIn several myths, Inanna is described as being the daughter of Nanna, the ancient Sumerian god of the Moon. In other texts, however, she is often described as being the daughter of either Enki or An. These difficulties have led some early Assyriologists to suggest that Inanna may have been originally a Proto-Euphratean goddess, possibly related to the Hurrian mother goddess Hannahannah, accepted only latterly into the Sumerian pantheon, an idea supported by her youthfulness, and that, unlike the other Sumerian divinities, she at first had no sphere of responsibilities.\nThe view that there was a Proto-Euphratean substrate language in Southern Iraq before Sumerian is not widely accepted by modern Assyriologists. In Sumer Inanna was hailed as \"Queen of Heaven\" in the third millennium BC. In Akkad to the north, she was worshipped later as Ishtar. In the Sumerian Descent of Inanna, when Inanna is challenged at the outermost gates of the underworld, she replies:\nHer cult was deeply embedded in Mesopotamia and among the Canaanites to the west. F. F. Bruce describes a transformation from a Venus as a male deity to Ishtar, a female goddess by the Akkadians. He links Ishtar, Tammuz, Innini, Ma (Cappadocia), Mami, Dingir-Mah, Cybele, Agdistis, Pessinuntica and the Idaean Mother to the cult of a great mother goddess.\nAstarte\nwith four branches protruding from roof, on the reverse of a Julia Maesa coin from Sidon]]\nThe goddess, the Queen of Heaven, whose worship Jeremiah so vehemently opposed, may have been possibly Astarte.\nAstarte  is the name of a goddess as known from Northwestern Semitic regions, cognate in name, origin and functions with the goddess Ishtar in Mesopotamian texts. Another transliteration is ‘Ashtart; other names for the goddess include Hebrew עשתרת (transliterated Ashtoreth), Ugaritic ‘ṯtrt (also ‘Aṯtart or ‘Athtart), Akkadian DAs-tar-tú (also Astartu) and Etruscan Uni-Astre (Pyrgi Tablets).\nAstarte was connected with fertility, sexuality, and war. Her symbols were the lion, the horse, the sphinx, the dove, and a star within a circle indicating the planet Venus. Pictorial representations often show her naked. Astarte was accepted by the Greeks under the name of Aphrodite. The island of Cyprus, one of Astarte's greatest faith centers, supplied the name Cypris as Aphrodite's most common byname.\nHebrew Bible references\nThe \"Queen of Heaven\" is mentioned in the Bible and has been associated with different goddesses by different scholars, including: Anat, Astarte or Ishtar, Ashtoreth, or as a composite figure. The worship of a \"Queen of Heaven\" (, Malkath haShamayim) is recorded in the Book of Jeremiah, in the context of the prophet condemning such religious worship and it being the cause of Yahweh declaring that he would remove his people from the land.\nIn Jeremiah 44:15-18:\nThere was a temple of Yahweh in Egypt at that time, the 6th-7th centuries BC, that was central to the Jewish community at Elephantine in which Yahweh was worshipped in conjunction with the goddess Anath (also named in the temple papyri as Anath-Bethel and Anath-Iahu).\nThe goddesses Asherah, Anat, and Astarte first appear as distinct and separate deities in the tablets discovered in the ruins of the library of Ugarit (modern Ras Shamra, Syria). Most biblical scholars tend to regard these goddesses as one, especially under the title \"Queen of heaven\".\nIsis\nnursing the Pharaoh Seti I]]\nIsis was venerated first in Egypt. As per the Greek historian Herodotus, writing in the fifth century BC, Isis was the only goddess worshiped by all Egyptians alike, and whose influence was so widespread by that point, that she had become syncretic with the Greek goddess Demeter. It is after the conquest of Egypt by Alexander the Great, and the Hellenization of the Egyptian culture initiated by Ptolemy I Soter, that she eventually became known as 'Queen of Heaven'.\nApuleius confirms this in Book 11, Chap 47 of his novel, The Golden Ass, in which his character prays to the \"Queen of Heaven\". The goddess herself responds to his prayer, delivering a lengthy monologue in which she explicitly identifies herself as both the Queen of Heaven and Isis.\n}}\nSee also\n*\n*\n*\n* Mazu, also commonly known as the \"Empress of Heaven\".\n*\n* Nuit, also known as \"Lady of the Starry Heaven\".\nReferences"
    }
  ]
}