{
  "content": [
    {
      "type": "text",
      "text": "# Queen regnant__disambig_1\n\nqueen regent}}\nwas the queen regnant of Denmark, Norway, and Sweden in the late 14th and early 15th centuries.]]\nA queen regnant (: queens regnant) is a female monarch, equivalent in rank, title and position to a king. She reigns suo jure (in her own right) over a realm known as a kingdom; as opposed to a queen consort, who is married to a reigning king; or a queen regent, who is the guardian of a child monarch and rules pro tempore in the child's stead or instead of her husband who is absent from the realm, be it  in sharing power or  in ruling alone. A queen regnant is sometimes called a woman king. A princess, duchess, or grand duchess regnant is a female monarch who reigns suo jure over a principality or (grand) duchy; an empress regnant is a female monarch who reigns suo jure over an empire.\nA queen regnant possesses all the powers, such as they may be, of the monarchy, whereas a queen consort or queen regent shares her spouse's or child's rank and titles but does not share the sovereignty of her spouse or child. The husband of a queen regnant traditionally does not share the queen regnant’s rank, title, or sovereignty and usually holds a lower princely title. However, the concept of a king consort is not unheard of in both contemporary and historical periods.\nA queen dowager or empress dowager is the widow of a king or emperor; a queen mother is a queen dowager who is also the mother of a reigning sovereign.\nSince the abdication of Margrethe II of Denmark on 14 January 2024, there are currently no female sovereigns in the world. This is the first time this has been the case in over 200 years.\nHistory\n, the earliest Pharaoh of Egypt confidently proven to have been a woman (18th/17th century BC)]]\nThe oldest attested queen regnant was the Pharaoh Sobekneferu from the 18th/17th century BC.\nIn ancient Africa, ancient Persia, Asian and Pacific cultures, and in some European countries, female monarchs have been given the title king or its equivalent, such as pharaoh, when gender is irrelevant to the office, or else have used the masculine form of the word in languages that have grammatical gender as a way to classify nouns. The Roman Empress Irene of Athens sometimes titled herself basileus (βασιλεύς), 'emperor', rather than basilissa (βασίλισσα), 'empress', and Mary of Hungary was crowned as Rex Hungariae, King of Hungary in 1382.\nAmong the Davidic Monarchs of the Kingdom of Judah, there is mentioned a single queen regnant, Athaliah, though the Hebrew Bible regards her negatively as a usurper. The much later Hasmonean Queen Salome Alexandra (Shlom Tzion) was highly popular.\nAccession of a queen regnant occurs as a nation's order of succession permits. Methods of succession to kingdoms, tribal chiefships, and such include nomination (the reigning monarch or a council names an heir), primogeniture (in which the children of a monarch or chief have preference in order of birth from eldest to youngest), and ultimogeniture (in which the children have preference in the reverse order of birth from youngest to eldest). The scope of succession may be matrilineal, patrilineal, or both; or, rarely, open to general election when necessary. The right of succession may be open to men and women, or limited to men only or to women only.\nThe most typical succession in European monarchies from the Late Middle Ages until the late 20th century was male-preference primogeniture: the order of succession ranked the sons of the monarch in order of their birth, followed by the daughters. Historically, many realms like France and the Holy Roman Empire forbade succession by women or through a female line in accordance with the Salic law, and nine countries still do, such countries being Japan, Morocco, Jordan, Saudi Arabia, Bahrain, Brunei, Liechtenstein, Bhutan. No queen regnant ever ruled France, for example. Only one woman, Maria Theresa of Austria, ruled Austria. As noted in the list below of widely-known ruling queens, many reigned in European monarchies.\nA similar system was practised in many of the kingdoms of the Indian subcontinent from the Middle Ages to the Indian independence movement. In many of these kingdoms, adoption was allowed from a relative if a monarch did not have children, and the adopted child could succeed to the throne at the death of the monarch. Often, the wife or mother of a childless king were allowed to succeed to the throne as well and allowed to rule as queen regnants in their own right, until their death, after which the throne passed to the next closest relative. Prominent examples from Indian history include Queen Didda of Kashmir, Razia Sultana, Rudrama Devi, Keladi Chennamma, Ahilyabai Holkar, Velu Nachiyar, Queen Gowri Lakshmi Bayi and Qudsia Begum of Bhopal.\nIn the late 20th and early 21st centuries, Sweden, Norway, Belgium, the Netherlands, Denmark, Luxembourg and the United Kingdom amended their laws of succession to absolute primogeniture (in which the children of a monarch or chief have preference in order of birth from eldest to youngest regardless of gender). In some cases, the change does not take effect during the lifetimes of people already in the line of succession at the time the law was passed.\nIn 2011, the United Kingdom and the 15 other Commonwealth realms agreed to remove the rule of male-preference primogeniture. Once the necessary legislation was passed, this means that had Prince William had a daughter first, a younger son would not have become heir apparent.\n, who reigned as queen of the United Kingdom from 1952 until her death in 2022, is the longest-reigning queen regnant in world history.]]\nIn 2015, Elizabeth II became the longest-reigning queen regnant and female head of state in world history. She was the longest serving incumbent head of state and monarch from 2016 until her death on 8 September 2022.\nUpon Elizabeth's death, Margrethe II of Denmark became the only remaining female monarch of a sovereign state in the world, until her abdication on 14 January 2024. This made it the first time that no female sovereigns have reigned in over 200 years. On the other hand, there are non-sovereign queens, such as Rain Queen Masalanabo Modjadji VII and Māori queen Nga wai hono i te po, who currently reign.\nVictoria, Crown Princess of Sweden, Princess Elisabeth, Duchess of Brabant (monarchy of Belgium), and Catharina-Amalia, Princess of Orange (monarchy of the Netherlands) are currently heirs apparent to the thrones of their respective monarchies, along with Leonor, Princess of Asturias, who is the heir presumptive of the throne of Spain. All four are therefore liable to become queens regnant following the end of the current reigns.\nEast Asia\nBecause there is no feminine equivalent to king and emperor in East Asian languages, different titles are used for female monarchs and female consorts. The titles of female monarchs in East Asia are translated directly as \"female king\" or \"female emperor\" and the titles of female consorts in East Asia are translated directly as \"king's consort\" or \"emperor's consort\". So, the titles of female monarchs in East Asia are the same as those of male monarchs, just indicating that they are women.\nIn China the term nǚhuángdì (女皇帝, \"female emperor\"), abbreviated as nǚhuáng (女皇), has been used for three empresses regnant to assume the title of huángdì: Daughter of Xiaoming, Chen Shuozhen and Wu Zetian, because the title huánghòu (皇后, \"emperor's consort\") means only an empress consort. The term nǚwáng (女王, \"female king\") was also used for queens regnant of the Eastern Queendom of the tribe Sumpa and it is different from the title wánghòu (王后, \"king's consort\") which means a queen consort.\nIn Korea, the term yeowang (Hangul: 여왕, Hanja: 女王, \"female king\") was developed to refer to three queens regnant of Silla: Seondeok, Jindeok and Jinseong, because the title wangbi (Hangul: 왕비, Hanja: 王妃, \"king's consort\") means only a queen consort. The term yeoje (Hangul: 여제, Hanja: 女帝, \"female emperor\") was also used for Yi Hae-won, the pretender empress regnant of Korean Empire because the title hwanghu (Hangul: 황후, Hanja: 皇后, \"emperor's consort\") means only an empress consort.\nAlthough Vietnam is a country in Southeast Asia, it used the royal titles of East Asia. The title as a queen regnant of Trưng Trắc was Nữ vương (chữ Hán: 女王, \"female king\") and the title as an empress regnant of Lý Chiêu Hoàng was Nữ hoàng (chữ Hán: 女皇, \"female emperor\"), and they are different from the titles of female consorts.\nIn Japan, the title used for two queens regnant of Yamatai: Himiko and Toyo was joō (女王, \"female king\") and it is different from the title ōhi (王妃, \"king's consort\") which means only a queen consort. The term jotei (女帝, \"female emperor\") or josei tennō (女性天皇, \"female heavenly emperor\") has been used for empresses regnant of Japan because the title kōgō (皇后, \"emperor's consort\") means only an empress consort.\nAlthough the Chrysanthemum Throne of Japan is currently barred to women following the Imperial Household Law (Emperor Naruhito's daughter Princess Aiko cannot accede to the Chrysanthemum Throne), this has not always been the case; throughout Japanese history, there have been eight empresses regnant. The Japanese imperial succession debate became a significant political issue during the early 2000s, as no male children had been born to the Imperial House of Japan since 1965. Prime Minister Junichirō Koizumi pledged to present parliament with a bill to allow women to ascend the Imperial Throne, but he withdrew this after the birth of Prince Hisahito (Naruhito's nephew) in 2006.\nList\nSee also\n* List of elected and appointed female heads of state and government\n* List of female monarchs\n* Matriarchy\n* Monarch\n* Order of succession\n* Queen consort\n* Rani\n* Regent\n* Salic law\n* Sultana\n* Trưng sisters\n* Women in government\nNotes\nReferences\nFurther reading\n*  Studies 30 women who exercised full sovereign authority in Europe.\nExternal links\n*"
    }
  ]
}