{
  "content": [
    {
      "type": "text",
      "text": "# Queen Square, Bath\n\n| map_caption = Location within Bath\n| mapframe = yes\n| mapframe-zoom = 15\n| former_names =\n| namesake    =\n| maint       =\n| location    = Bath, Somerset, England\n| postal_code =\n| north       =\n| east        =\n| south       =\n| west        =\n| completion_date =\n| designer    =\n| website     =\n}}\nQueen Square is a square of Georgian houses in the city of Bath, England. Queen Square is the first element in \"the most important architectural sequence in Bath\", which includes the Circus and the Royal Crescent. All of the buildings which make up the square are Grade I listed.\nThe original development was undertaken by John Wood, the Elder, in the early 18th century. He designed the building frontages following the rules of Palladian architecture and then sub-let to individual builders to put up the rest of the buildings. The obelisk in the centre of the square was erected by Beau Nash in 1738 in honour of Frederick, Prince of Wales.\nDuring World War II several buildings on the south side of the square were damaged by bombing during the Bath Blitz. Following restoration many of the buildings are now offices with the west side housing the Bath Royal Literary and Scientific Institution and on the south side the Francis Hotel.\nVision\nQueen Square was the first speculative development by the architect John Wood, the Elder, who later lived in a house on the square.\nWood set out to restore Bath to what he believed was its former ancient glory as one of the most important and significant cities in Britain. In 1725 he developed an ambitious plan for his home town:\nWood's grand plans for Bath were consistently hampered by the Corporation (council), churchmen, landowners and moneymen. Instead he approached Robert Gay, a barber surgeon from London, and the owner of the Barton Farm estate in the Manor of Walcot, outside the city walls. On these fields Wood established Bath's architectural style, the basic principles of which were copied by all those architects who came after him.\nDevelopment\nQueen Square is a key component of Wood's vision for Bath. Named in honour of Queen Caroline, wife of George II, it was intended to appear like a palace with wings and a forecourt to be viewed from the south side:\n*North side: Numbers 21–27 make up the north side, which was described by Nikolaus Pevsner as \"one of the finest Palladian compositions in England before 1730\".\n*West side: the west side (numbers 14–18 and 18A, 19 & 20) was designed by John Pinch in 1830 and differs from Wood's original design as the central block is in Neo-Grecian style.\nWood wrote that:\n}}\nHe understood that polite society enjoyed parading, and in order to do that Wood provided wide streets, with raised pavements, and a thoughtfully designed central garden. The formal garden was laid out with gravel pathways, low planting and was originally enclosed by a stone balustrade. The current railings date from 1978, a replica of the pre-WW2 originals. The garden area within the railings is exactly one acre (63.6 metres by 63.6 metres).\nWith the Palladian buildings at Queen Square, Wood \"set fresh standards for urban development in scale, boldness and social consequence.\" The elegant and palatial north façade of seven individual townhouses, with emphasis only on the central house to suggest a grand entrance, is heralded as Wood's greatest triumph, but the other three wings purposefully act as foils to this ostentatious palace front. The east and west sides of the square are the wings of the ‘palace', enclosing a forecourt. Wood undoubtedly took his inspiration from Inigo Jones's Covent Garden piazza (1631–37) in London and perhaps Dean Aldrick's Peckwater Quadrangle at Christ Church, Oxford (1706–10).\nSpeculative building\nAt Queen Square, Wood introduced speculative building to Bath. This meant that whilst Wood leased the land from Robert Gay for £137 per annum, designed the frontages, and divided the ground into the individual building plots, he sub-let to other individual builders or masons. They had two years' grace in which to get the walls up and the roof on, after which they had to pay a more substantial rent. As Bath was booming, most plots were reserved before the two years were up, providing the builder with the necessary income to complete the house. Ultimately this meant less work and risk for Wood; in addition he received £305 per annum in rents, leaving him a healthy profit of £168&nbsp;– the equivalent (in terms of average earnings) of £306,000 in 2012.\nObelisk\nObelisk]]\nThe obelisk in the centre of the square, of which Wood was \"inordinately proud\", was erected by Beau Nash in 1738 in honour of Frederick, Prince of Wales. It formerly rose from a circular pool to a point  high, but a severe gale in 1815 truncated it.}}\nAlthough outside the city walls, Queen Square quickly became a popular residence for Bath's Georgian society. It was away from the crowded streets of medieval Bath, but only a short walk to the Abbey, Pump Room, Assembly Rooms and baths. To the north, Wood's vision continued with Gay Street where Jane Austen lived; the Circus, which became home to Georgian artist Thomas Gainsborough; and then along Brock Street to the Royal Crescent.\nSecond World War\nDuring the Second World War, between the evening of 25 April and the early morning of 27 April 1942, Bath suffered three air raids in reprisal for RAF raids on the German cities of Lübeck and Rostock, part of the Luftwaffe campaign popularly known as the Baedeker Blitz. During the Bath Blitz, over 400 people were killed, and more than 19,000 buildings were damaged or destroyed.\nDuring the raids, a  high explosive bomb landed on the east side of the square, resulting in houses on the south side being damaged. The Francis Hotel lost  of its hotel frontage, and most of the buildings on the square suffered some level of shrapnel damage. Casualties on the square were low considering the devastation, the majority of hotel guests and staff having taken shelter in the hotel's basement.\nThe buildings have subsequently been restored, although there are still some signs of the bombing.\nPresent\nAll of the buildings have been designated by Historic England as Grade I listed buildings.\nNumbers 16–18 are now occupied by the Bath Royal Literary and Scientific Institution (BRLSI). The south side (numbers 5–11), which was originally left open, is now occupied by the 4-star Francis Hotel.\nThe square hosts many attractions all year, such as a French market, Italian market, and boules weekend.\nOn 30 October 2011, the square was occupied as part of the global Occupy movement, with protesters, under the banner of Occupy Bath, pitching tents and creating other temporary structures. The protestors held a variety of debates, talks and musical events related to financial inequality. The camp dismantled on 10 December 2011, with the protesters vowing to continue via other means.\nReferences"
    }
  ]
}