{
  "content": [
    {
      "type": "text",
      "text": "# Queen Elizabeth Hospital Birmingham Charity\n\n} parameter -->\n| relief      =\n| map_size    =\n| map_alt     =\n| map_caption =\n| location    =\n| region      =  West Midlands\n| state       = England\n| country     = UK\n| coordinates =\n| healthcare  =  UK: NHS\n| funding     =\n| type        =\n| affiliation =\n| patron      =\n| network     =\n| standards   =\n| emergency   =\n| helipad     =\n| beds        =\n| speciality  =\n| founded     = 2001\n| closed      =\n| demolished  =\n| website     = https://www.qehb.org/\n| other_links =\n| module      =\n}}\nThe Queen Elizabeth Hospital Charity is a charity that was founded to support medical and health research, and to fund and encourage excellence in healthcare for patients and their caregivers, wholly or mainly through the services provided by University Hospital Birmingham NHS Foundation Trust.  It raises money for campaigns that attempt to complement NHS services. The QEH Charity was formed in 2001, however, there has been an official charity associated with the Queen Elizabeth Hospital since the creation of the NHS in 1948. QEH became independent in April 2016.\nHistory\nThe former United Birmingham Hospitals, which were a number of teaching hospitals in Birmingham, had charitable funds managed by the Special Trustees of the Former United Birmingham Hospitals Trust Funds. When the hospitals were split into separate trusts,  the charitable funds were also dealt with in the same way. The Special Trustees were dissolved by a Statutory Instrument on 1 April 2001. These separate charitable funds are held within the umbrella group known as Queen Elizabeth Hospital Charity. On 1 April 2016, QEHB Charity became an independent charity, bearing the charity number 1165716.\nActivities\nQEHB Charity is a small charity working on fundraising and communications regarding events and charitable occasions, such as Breast Cancer Awareness Month. From writing newsletters to organizing skydives, the variety of day-to-day life at the charity is such that it reflects the diversity of the hospital’s activities.\nResearch\nThe research that QEHB Charity supports projects exploring all areas of medical science, from brain tumours to a plethora of rare diseases. Queen Elizabeth Hospital Birmingham prides itself on having many 'Centres of Excellence', and QEHB Charity's support of research has been able to help the professionals continue with their pioneering studies. As well as supporting research projects through grants, QEHB also supports research posts. An example of this is at Cancer Immunology and Immunotherapy Centre at the, where QEHB Charity is currently funding the post of a Cancer Immunotherapy Support Officer.\nEquipment\nThe charity also helps to fund equipment the NHS does not provide. In 2013 it funded the introduction of CyberKnife, a revolutionary radiotherapy machine, brought to the QE in 2013.\nFundraising\nMuch like research the charity helps to fund, the way in which the money is raised at QEHB Charity is incredibly varied. Organisations such as Warwickshire Country Cricket Club have supported the charity for many years.  Events such as abseils and skydives have been participated on a team or individual basis in the past. QEHB Charity has a strong community-based ethos of people from all walks of life coming together for good causes. Queen Elizabeth Hospital Charity's work is funded entirely by donations from the general public, along with members of staff and patients of the Queen Elizabeth Hospital Birmingham. It raises money through a variety of methods Donations Community fundraising and donations, events Outward-bound sponsored events, Legacies, Corporate and retail partnerships.\nReferences"
    }
  ]
}