{
  "content": [
    {
      "type": "text",
      "text": "# Queen Sasuk\n\n1065\n| birth_place  = Goryeo\n| death_date   = 1107 (aged about mid 40s)\n| death_place  = Goryeo\n| burial_place = Illeung tomb\n| spouse       =\n| issue        = Heonjong of GoryeoAn unnamed daughterPrincess Suan\n| regnal name  = *Consort Yeonhwa ()\n*Concubine of Duke Gukwon ()\n*Duchess Consort Gukwon ()\n*Queen Mother Sasuk ()\n*Grand Queen Mother Sasuk ()\n| posthumous name = *Queen Gwangsuk Jeonghwa Sasuk()\n*Queen Mother Gwangsuk Jeonghwa Sasuk()\n| temple name  =\n| house        = Gyeongwon Yi clan\n| father       = Yi Sŏk ()\n| mother       =\n| religion     =\n}}\nQueen Sasuk of the Gyeongwon Yi clan (; 1065 – 1107) was a Korean Goryeo queen consort as the second wife of her first cousin, King Seonjong of Goryeo, and the mother of his successor, King Heonjong. She was the Regent of Goryeo during the minority of her son in 1094 and 1095. Princess Wonsin, Princess Janggyeong, Yi Cha-gyŏm, and Yi Cha-ryang were her first cousins while Lady Jeongsin was her first cousin once removed.\nBiography\nMarriage and Palace life\nShe married Seonjong, the second son of her aunt, Queen Inye, when he was still Duke Gukwon () and then became Concubine of Duke Gukwon (). But after his first wife's death, she formally became Duchess Consort Gukwon () and lived in the Duke's manor () until his ascension. In 1083, he ascended the throne and following this, she was given the royal title of Consort Yeonhwa () while living in Yeonhwa Palace (). They later had a son in June 1084 and 2 daughters. But, misfortune befell on them with their eldest daughter died too early after birth and the other daughter was born blind and would not have a chance to marry.\nRegency and death\nMeanwhile, King Seonjong died in 1094 due to his illness and their only young son became the new King, Heonjong. Because the new king was just 11 years old at this time, his mother then became and acted as his regent who presided over and executed all government affairs including military and administrative affairs. As a queen mother, she moved to Yeongnyeong Mansion () in Junghwa Hall () from her reigned day on 1 June in order to purpose the strengthening of the royal power. In other words, she went directly to the court and observed the court affairs, also her orders was \"Je\" () that corresponded to the King's orders and commands.\nIn 1095, Duke Gyerim became the new King after takinh over the young King's throne. While under such circumstances, the queen mother's cousin, Yi Cha-ŭi (), must have lost his life after trying to revolt against Gyerim by making Wang Yun ascend the throne. The young king abdicated to his uncle after 1 year and 5 months of reign. Her official residence was closed under Gyerim's command and her power was completely cut off. Together with her son, they returned to her old palace where the late king stayed in when he was still a Duke.\nIn \"Heungseong Palace\" (), the two lived quietly and Heonjong died 2 years later in 1097. From this time, she was described as living a life of virtue, although she became more lonely than before, and was said to have lived a life without problems until her death in around 1107 at 42 to 43 years old. After her death, she was later enshrined at her husband's shrine.\nAfterlife\nKing Sukjong's eldest son, King Yejong buried her in Illeung tomb, Gaeseong, along with her husband and held her ritual. She was said to had been suffered a lot after her son's deposition from the throne during the reign of King Sukjong. When King Yejong discussed about enshrining Consort Jeongsin in Seonjong's tomb, the officials said,\nFrom this point, it can be seen that Yi played a certain role as the spouse of Duke Gukwon and in Goryeosa, (임조칭제, 臨朝稱制; Imjochingje) referred to the political power of the Queen Mother which she used for her regency on behalf of the young-weak King. She was known to exert her political influence when she was a regent.\nSome people have said,\nPosthumous name\n*In April 1140 (18th year reign of King Injong), name Jeong-hwa () was added.\n*In October 1253 (40th year reign of King Gojong), name Gwang-suk () was added to her posthumous name too.\nReferences\nExternal links\n*[http://encykorea.aks.ac.kr/Contents/Index?contents_id=E0025761 Queen Sasuk] on the Encyclopedia of Korean Culture\n*[https://www.doopedia.co.kr/mo/doopedia/master/master.do?_method=view2&MAS_IDX=101013000763609 사숙태후] on Doosan Encyclopedia ."
    }
  ]
}