{
  "content": [
    {
      "type": "text",
      "text": "# Queen Mary Psalter\n\nThe Queen Mary Psalter (British Library, Royal MS 2 B.vii) is a fourteenth-century English psalter named after Mary I of England, who gained possession of it in 1553. The psalter is noted for its beauty and the lavishness of its illustration, and has been called \"one of the most extensively illustrated psalters ever produced in Western Europe\" and \"one of the choicest treasures of the magnificent collection of illuminated MSS. in the British Museum\".\nOrigin and history of the manuscript\nThe psalter was perhaps produced c. 1310–1320 by one main scribe and, unusually for a work so heavily illuminated, a single artist, who is now known as the \"Queen Mary Master\". It was probably made in London, and  possibly for Isabella of France, queen of Edward II of England, though there is no agreement on the matter. For the next two hundred years, its history is not known. A note in a sixteenth-century hand indicates that it was owned by an Earl of Rutland, and though it does not identify the earl it appears likely that it was Henry Manners. A Protestant, he was imprisoned in May 1553, which may explain how the psalter landed in the possession of Queen Mary: a second note, in Latin, explains that the psalter was impounded by Baldwin Smith, a customs officer, and thus remained in England. It remained in the possession of Queen Mary and her successors until 1757, when George II donated the Old Royal Library to the British Museum.\nElements of the text are not known from other manuscripts and may have been specially composed. Some of the captions and illustrations betray the influence of the twelfth-century Historia scholastica.\nAt least twenty manuscripts from the fourteenth century have survived that reflect the \"Queen Mary style\". The contents indicate that it was probably made for a woman. Comparisons to psalters that focus on women and were known to have been owned by women (such as the Isabella Psalter, the Munich Psalter, and the Imola Psalter) are drawn. Especially the Isabella Psalter is similar in content and style to the Queen Mary Psalter, strengthening the case for identifying the original patron or owner as Isabella of France. Kathryn Smith argues that specifically the scenes depicting Joseph, if read in the proper historical context, suggest Isabella: \"it [the Joseph cycle] functioned in two ways: as a commentary on royal policy and current events during the reign of Edward II, and as an \"anti-model\" of conjugal fidelity for his queen, Isabella of France.\"\nDescription\n, Harvesting acorn to feed swine.]]\nThe Queen Mary Psalter is noted for its ornate, embroidered binding, executed on crimson velvet under Mary I; \"on each side is a large conventional pomegranate-flower worked on fine linen in coloured silks and gold thread.\" Queen Mary used the pomegranate as a memento for her mother, Catherine of Aragon, and the entire binding was probably done \"by her own direction.\" The remaining clasp plates are engraved with images pertaining to the House of Tudor.\nThe psalms (in Latin) are preceded by an Old Testament cycle containing 223 scenes, and are glossed in Anglo-Norman by way of a caption placed above the image. The psalms are accompanied by over 800 illustrations, which fall into three categories: initials, many containing imagery related to David; large illuminations depicting the Life of Christ; and marginal drawings at the bottom of every page. This last section contains six sequences, including a bestiary and the \"lives of the martyred saints.\" According to Anne Rudloff Stanton, \"the codex is an intricately designed and encyclopaedic masterpiece, presenting largely visual stories that span the courtly world as well as biblical history.\" Among the themes she identifies among the narratives, Stanton notes the \"crucial nature of women's actions\" and especially mothers protecting their children. The selection of women is broad. Included are women from the Old Testament characters, including Eve, Sarah, and Bathsheba; Stanton notes that four scenes of childbirth occur in the preface alone. Women from and associated with the New Testament include Mary and Saint Anne. A final group of images concerns saints, three of whom are female (Catherine of Alexandria, Mary Magdalene, and Margaret the Virgin); in the case of two of the three male saints, Thomas Becket and Saint Nicholas, special attention is paid to the saints' mothers.\nReferences\n;Notes\n;References\n;Bibliography\n*\n*\n*\n*\n*\"Royal\": McKendrick, Scott, Lowden, John and Doyle, Kathleen, (eds), Royal Manuscripts, The Genius of Illumination, 2011, British Library, 9780712358156\n*\n*\nExternal links\n*\n*[http://bestiary.ca/etexts/warner1912/warner1912.htm Introduction to the 1912 facsimile edition (bestiary.ca)]\n*[https://web.archive.org/web/20120401045243/http://www.english.cam.ac.uk/medieval/result.php?mode=keyword_click&search=Queen+Mary+Psalter images on 'Medieval Imaginations' (english.cam.ac.uk)]"
    }
  ]
}