{
  "content": [
    {
      "type": "text",
      "text": "# Queen of spades__disambig_2\n\nin a standard deck\n| image2 = Queen of spades fr.svg\n| caption2 = Pallas,  in the Paris pattern\n| image3 = Атласная колода экстра дама пики.jpg\n| caption3 =  in a Russian deck\n| image4 = Wuest Tarock Queenspades.gif\n| caption4 =  from 19th-century tarock deck\n}}\nThe queen of spades () is a face card in decks of French-suited playing cards and Tarot, depicting a queen of the spades () suit and associated with the Greek goddess Pallas. In Old Maid, several games of the Hearts family, and some variants of poker, it has a special function.\nRoles by game\nIn the Hearts family of card games, the queen of spades is usually considered an unlucky card; it is the eponym of the Black Maria and Black Lady variants of Hearts. The player who ends up with the queen of spades after a match scores 13 points (points are to be avoided in this game). The exception is when the player receives this card with all 13 hearts, in which the player is said to have shot the moon, and this player scores no points, while all opponents are scored 26 points.\nIn the game of Old Maid, while any card can technically be used for this purpose, the queen of spades is traditionally used as a card that has no match, thereby making it the \"old maid\" card.\nIn the seven card stud poker variant known as \"The Bitch\", a face-up deal of the queen of spades results in the deal being abandoned, all cards being shuffled and a new deal starting with only those players who had not already folded when the queen of spades was dealt.\nIn pinochle, the queen of spades and the jack of diamonds combine for a unique two-card meld known as a \"pinochle\".\nIn Crazy Eights, playing the Queen of Spades card means that the next player to play their turn has to first pick up 5 cards from the deck.\nCard reading\nIn cartomancy, the queen of spades is considered to be a sign of intelligence. It is representative of judgment that is practical, logical, and intellectual. It represents a woman who is creative and makes her plans ahead of time.\nEncoding\nThe queen of spades is encoded into Unicode with the code point U+1F0AD, as part of the playing cards Unicode block.\nSee also\n* List of playing card nicknames\n* List of poker hand nicknames\n* Standard 52-card deck\nReferences"
    }
  ]
}