{
  "content": [
    {
      "type": "text",
      "text": "# Queen Marimba\n\nQueen Marimba is a folk hero whose accomplishments have become part of the folklore of Africa. As is customary in most African cultures she is considered to be a god and was one of the immortals. She led the Akamba tribe in East Africa in very ancient times across the Ukambani plains in present day Kenya, stretching across the Kilimanjaro plains in present day Tanzania. There has been scant research done on her and presently the most notable source for information on her life comes from the writings of Vusa'mazulu Credo Mutwa. He asserts in his book; Indaba My Children, that she was the mother of the Akamba people (bantu original) at the time when they were getting to know their Maasai neighbours.\nVarious renditions of his book have been published since the late 60's, including \"My People, My Africa\", \"Indaba My Children\" and \"Africa Is My Witness.\"\nShe is associated with music and teaching the people to sing, as well as having created the forerunners of  all the various instrument families. Instruments that she's credited with creating include ngoma (drum), marimba (xylophone), kalimba (lamellaphone), makweyana or musical bow and a raft zither or hand xylophone known as mukimbe.\nReferences\n*New York: John Day: \"[https://books.google.com/books?id=kUksAAAAMAAJ&q=drum My People, My Africa]\", by Vusa'mazulu Credo Mutwa (1969)\n*Grove Press: \"[https://books.google.com/books?id=ocZaJMc8rq8C&q=queen+marimba+mouth+bow Indaba My Children: African Folktales]\", by Vusa'mazulu Credo Mutwa (1999)\n*University Musical Society’s Youth Education Program: \"[https://web.archive.org/web/20090706083041/http://www.ums.org/assets/pdf/studyguide/uganda2006-sg.pdf Children of Uganda Teacher Resource Guide]\" by Bree Juarez. Edited by Bree & Ben Johnson (2005)\n*Berliner, Paul. (1978). The Soul of Mbira: music and traditions of the Shona people of Zimbabwe. Berkeley: University of California Press.\n*Howard, Joseph H. (1967). Drums in the Americas. New York: Oak Publications.\n*Mutwa, Credo Vusa'mazulu. (1969). My people: the incredible writings of Vusa'mazulu Credo Mutwa. Johannesburg: Blue Crane Books, 1969.\n*Tracey, Andrew. (1970). The Matepe Mbira Music of Rhodesia. Journal of the African Music Society, IV: 4, 37-61.\n*Tracey, Andrew. (1970). How to play the mbira (dza vadzimu). Roodepoort, Transvaal, South Africa: International Library of African Music.\n*Tracey, Hugh. (1961). The evolution of African music and its function in the present day. Johannesburg: Institute for the Study of Man in Africa.\n*Tracey, Hugh. (1969). The Mbira class of African Instruments in Rhodesia (1932). African Music Society Journal, 4:3, 78-95.\nRecordings\n*Columbia Records: Drums of Passion. Liner notes by Akinsola Akiwowo (1958).\nExternal links\n* [https://web.archive.org/web/20090706083041/http://www.ums.org/assets/pdf/studyguide/uganda2006-sg.pdf] The Children of Uganda detailed study guide\n* [https://web.archive.org/web/20180902190023/http://www.amadinda.co.uk/ amadinda] a website that includes a tutorial on how to play bakisimba on drums from Uganda\n* [https://web.archive.org/web/20080807020739/http://www.africaonline.com/ africaonline] a website containing comprehensive information about the African continent\n* [https://books.google.com/books?id=rcDlMYNADGEC&dq=queen+marimba&pg=PA114] a page from Indaba My Children: African Folktales where the creation of ngoma is described\n* [http://www.jamboree.freedom-in-education.co.uk/real_history/marimba.htm \"The Queen's Gift\"] by Bethan Lewis"
    }
  ]
}