{
  "content": [
    {
      "type": "text",
      "text": "# Queensland University Magazine\n\nThe Queensland University Magazine, later known as Galmahra (after the Indigenous name of Jackey Jackey), was first published in 1911, the same year that the University of Queensland was established. It was a publication of the Student Union.\nThe first issues were designed with the purpose of “building up University life and chronicling term by term, events of common interest”. In 1920, the magazine changed its name to Galmahra, reflecting a change in the mood of the student body, and certainly of its editorial board. The new name, from the Aboriginal word for “poet, seer, teacher or philosopher amongst the tribes”, suggested “a poetic expression of the spirit of this sunlit-sombre land in which we live” as well as respect for the famous guide of the Kennedy expedition of 1948, known as Jackey Jackey. As well as publishing news relating to the university, it also featured literary articles, reviews, short fiction and verse, some of which was not contributed by undergraduates. It was hoped that the publication would inspire local poets, both of the university and outside to contribute material.\nSeveral years of discord between the editors of the magazine and the conservative Senate of the university, almost led to the cancellation of the magazine in 1925. In 1932, the student's weekly newspaper, Semper Floreat was first published, and Galmahra eventually became an annual magazine. It was suspended between 1951 and 1959, and again from 1969. Some of the featured poetry included works by Judith Wright, Val Vallis, David Rowbotham and David Malouf.\nEditors\n{| class=\"wikitable\"\n!Year\n!Editor\n|-\n!1911\n|A. S. Fielding\n|-\n|1912\n|A.S. Fielding\n|-\n|1913\n|H. W. Dinning\n|-\n|1914\n|A. H. Jones\n|-\n|1915\n|C. R. Wonderley\n|-\n|1916\n|T. Thatcher and A.E. Pearse\n|-\n|1917\n|Geo. Cooling\n|-\n|1918\n|T. Thatcher\n|-\n|1919\n|J. Lindsay\n|-\n|1920\n|I. F. Jones\n|-\n|1921\n|P. R. Stephensen\n|-\n|1922\n|W. J. Chamberlain and John Denis Fryer\n|-\n|1923\n|Colin Bingham\n|-\n|1924\n|Cecil Hadgraft\n|-\n|1925\n|Colin Bingham\n|-\n|1926\n|Edgar George Holt\n|-\n|1927\n|Frederick William Whitehouse\n|-\n|1928\n|Rhys Jones\n|-\n|1929\n|J. G. Harrison\n|-\n|1930\n|W.A.L.T. Hyde\n|-\n|1931\n|N.C. Tritton\n|-\n|1932\n|S.L. Russell\n|-\n|1933\n|M. E. Freeman\n|-\n|1934\n|E.T.S. Pearce\n|-\n|1935\n|J. H.P. Ryan\n|-\n|1936\n|E.J. Ritchie and J.H. Richardson\n|-\n|1937\n|H.T. Gibbs\n|-\n|1938\n|John Sachs\n|-\n|1939\n|Donald MacFarlane\n|-\n|1940\n|R. A. Beven\n|-\n|1941\n|R. Mathews\n|-\n|1942\n|Peter Miles\n|-\n|1943\n|No issue published\n|-\n|1944\n|Lucius Allen\n|-\n|1945\n|A.M. Hertzberg\n|-\n|1946\n|R.B. McIntyre\n|-\n|1947\n|G. Watson\n|-\n|1948\n|D.H. Rowbotham\n|-\n|1949\n|Bert Cornelius\n|-\n|1950\n|John Quinlem\n|-\n|1960\n|Dan O’Neill\n|-\n|1963\n|A.B (\"Barry\") Baker and John Carmody\n|-\n|1968\n|David Murr\n|}\nReferences\n*\n*\n*\n*"
    }
  ]
}