{
  "content": [
    {
      "type": "text",
      "text": "# Queen of the House (album)\n\n| recorded   = March–April 1965\n| studio     = Capitol Studios\n| genre      = |pop}}\n| label      = Capitol\n| producer   = Steve Douglas\n| prev_title = Wednesday's Child Is Full of Woe\n| prev_year  = 1963\n| next_title = Home of the Brave\n| next_year  = 1965\n| misc       =\n}}\nQueen of the House is a studio album by American singer Jody Miller. It was released in June 1965 via Capitol Records and contained 12 tracks. It was named for the title track, which became a top 20 single on the pop charts and a top ten single on the country charts. The remaining tracks were mostly covers of popular songs from the era. Queen of the House was met with positive reviews since its release. The album itself would also make both the American country and pop charts.\nBackground\nQueen of the House was named for its title track. The tune was an answer song to Roger Miller's \"King of the Road\". According to the liner notes, singer–songwriter Mary Taylor wrote the lyrics to \"Queen of the House\". She then told Roger Miller about her composition. Miller insisted that Taylor cut the track, however she was unable to at the time. Instead, \"Queen of the House\" was brought to the attention of producer Steve Douglas who chose to cut it with new recording artist Jody Miller. Jody Miller recently signed to Capitol and had recorded an album of folk music (''Wednesday's Child Is Full of Woe'') and a single that dented the American charts (\"He Walks Like a Man\"). \"Queen of the House\" would ultimately become Jody Miller's breakout single as a recording artist. Its commercial success spawned an album of the same name.\nRecording and content\nThe Queen of the House album was recorded in sessions between March and April 1965 at Capitol Studios, located in Hollywood, California. The sessions were produced by Steve Douglas. It also featured arrangements by musician Billy Strange and background vocals from The Johnny Mann Singers. Most of the album's 12 tracks were covers of songs that were popular from the sixties era. Among its covers was \"I Walk the Line\", \"Silver Threads and Golden Needles\" and \"The Race Is On\". On her official website, Jody Miller jokingly spoke of her cover of \"The Race Is On\": \"I'm told when George Jones [the original performer of 'The Race Is On'] heard our version of 'The Race is On,' he stopped drinking just so he could start back again!\"\nOther covers on the album included Connie Francis's pop single \"Everybody's Somebody's Fool\", Don Gibson's country and pop top ten song \"Sea of Heartbreak\", Warren Smith's top ten country song \"Odds and Ends\". The album project also included Miller's first single \"He Walks Like a Man\".\nRelease, critical reception and chart performance\n}}\nQueen of the House was originally released in June 1965 on Capitol Records. It was first distributed as a vinyl LP, offered in both mono and stereo versions. Six songs appeared on either side of the disc. It was the second studio album released in Miller's career. Upon its release, Billboard magazine gave the album a positive review in June 1965. \"She has a fresh, zestful approach and makes happy sounds throughout this debut package,\" the publication commented. They also highlighted several of her covers featured on the album project. Years later, the online publication AllMusic rated the album 4.5 out of 5 possible stars.\nQueen of the House was Miller's first album to make the American Billboard 200 pop chart, peaking at number 12 in 1965. It was also her first album to make the American Billboard Top Country Albums chart, peaking at number 17. In November 2021, Capitol Records chose to release all of Miller's albums to digital retailers, making Queen of the House available digitally for the first time.\nSingles\nA total of three singles were included on Queen of the House. Among them was \"He Walks Like a Man\", Miller's first single to make any national chart. It was originally released by Capitol in November 1963. It reached number 66 on the Billboard Hot 100 in early 1964. The album's title track was the most successful single from the project. It was first released as a single in April 1965. It reached number 12 on the Billboard Hot 100 in 1965, becoming her highest-peaking single there. It was also Miller's first single to enter the Billboard Hot Country Songs chart, peaking at number five. Its country success would create a new career in the genre for Miller in the years to come. The third and final single was Miller's cover of \"Silver Threads and Golden Needles\". It was released in June 1965. It reached number 54 on the Hot 100. Additionally, \"Queen of the House\" and \"He Walks Like a Man\" charted in Australia. \"He Walks Like a Man\" peaked at number eight in 1964, while the title track reached number 68.\nTrack listing\n| length1         = 2:22\n| title2          = He Walks Like a Man\n| writer2         = Diane Hildebrand\n| length2         = 2:35\n| title3          = Everybody's Somebody's Fool\n| writer3         =\n| length3         = 2:50\n| title4          = The Race Is On\n| writer4         = Don Rollins\n| length4         = 1:58\n| title5          = Odds and Ends\n| writer5         = Harlan Howard\n| length5         = 2:38\n| title6          = Sea of Heartbreak\n| writer6         =\n| length6         = 2:25\n}}\n| length1         = 1:55\n| title2          = I Walk the Line\n| writer2         = John R. Cash\n| length2         = 2:25\n| title3          = Soft and Gentle Ways\n| writer3         = Steve Stone\n| length3         = 3:03\n| title4          = If I\n| writer4         = Tommy Boyce\n| length4         = 2:09\n| title5          = The Greatest Actor\n| writer5         = Charlie Williams\n| length5         = 2:30\n| title6          = These Are the Years\n| writer6         =\n| length6         = 2:30\n}}\nTechnical personnel\nAll credits are adapted from the liner notes of Queen of the House.\n* Steve Douglas – Producer\n* George Jerman – Photography\n* The Johnny Mann Singers – Background vocals\n* Billy Strange – Arranger, conductor\nCharts\n{| class=\"wikitable plainrowheaders\" style=\"text-align:center\"\n|-\n! scope=\"col\"| Chart (1965)\n! scope=\"col\"| Peakposition\n|-\n! scope=\"row\"| US Billboard 200\n|align=\"center\"|124\n|-\n! scope=\"row\"| US Top Country Albums (Billboard)\n|align=\"center\"|17\n|-\n|}\nRelease history\n{|class=\"wikitable plainrowheaders\"\n|-\n!scope=\"col\"| Region\n!scope=\"col\"| Date\n!scope=\"col\"| Format\n!scope=\"col\"| Label\n!scope=\"col\"| Ref.\n|-\n! scope=\"row\"| Germany\n| rowspan=\"3\"| June 1965\n| Capitol Records\n| rowspan=\"2\"| LP Stereo\n|\n|-\n! scope=\"row\"| New Zealand\n| World Record Club\n|\n|-\n! scope=\"row\"| North America\n| Capitol Records\n| rowspan=\"2\"|\n|\n|-\n! scope=\"row\"| Australia\n| 1966\n| World Record Club\n|\n|-\n! scope=\"row\"| North America\n| November 2021\n| Capitol Records Nashville\n|\n|\n|-\n|}\nReferences"
    }
  ]
}