{
  "content": [
    {
      "type": "text",
      "text": "# Queensland Brain Institute\n\n| mission = Neuroscience research\n| focus = Basic science\n| president =\n| ceo =\n| chairman =\n| head_label = Director\n| head = Professor Pankaj Sah\n| faculty =\n| adjunct_faculty =\n| staff = More than 400\n| key_people =\n| budget =\n| endowment =\n| debt =\n| num_members =\n| subsidiaries =\n| owner =\n| non-profit_slogan =\n| former_name =\n| location = Building 79, University of Queensland\n| city = Brisbane\n| state = Queensland\n| province =\n| country = Australia\n| coor =\n| address =\n| website =\n| dissolved =\n| footnotes =\n}}\nThe Queensland Brain Institute (QBI) is an Australian neuroscience research institute, located in Brisbane at the St Lucia campus of The University of Queensland (UQ). Founding director Professor Perry Bartlett  established the QBI in 2003 with assistance from The University of Queensland, Queensland State Government, and Chuck Feeney, founder of The Atlantic Philanthropies. The purpose-built facility was commissioned in 2004 and on 19 November 2007, the building was opened by former Queensland Premier Anna Bligh.\nSince 2015, Professor Pankaj Sah has been Institute director. Professor Helen Cooper is the deputy director (Research).\nThe institute is one of nine institutes at The University of Queensland, including the Australian Institute for Bioengineering and Nanotechnology (AIBN), the Translational Research Institute, and the Institute for Molecular Bioscience (IMB).\nOverview\nAs one of Australia's leading neuroscience research centres, the Queensland Brain Institute encourages interest in the wonders of the brain and support for neuroscience's vital role in helping people to live healthier, happier and more productive lives.\nThrough fundamental research, QBI researchers strive to improve the world's understanding of the brain in health and disease and to find solutions for brain disorders, diseases and injuries, including MND, dementia, depression, stroke and mental health.\nHistory\nThe Queensland Brain Institute was established in 2003 as part of an initiative to develop a bioscience precinct at the University of Queensland.\nPlanning for the Institute effectively began in 2002 with the resolution that it would investigate the biological bases of higher brain function and its application to enhance the community's neurological and mental health.\nSince its inception QBI has grown from an initial five founding groups to a cohort of 44 scientific groups and close to 450 personnel.\nResearch\nResearch at QBI focuses on the fundamental mechanisms of brain function and its application to brain diseases and disorders. Although most of QBI's activity is basic science based on model systems (rodent, zebrafish, Drosophila and C. elegans) the institute is also involved in significant research involving humans. This not only relates to clinical studies, but also to the use of humans as experimental subjects.\nAs of 2022, QBI focuses on five key areas:\n* Cognition and behaviour\n* Brain development and plasticity\n* Brain injury\n* Ageing and dementia\n* Mental health\nThe Institute houses more than 400 staff and students. Five research centres currently exist within QBI:\n* The Science of Learning Research Centre (SLRC), established in 2010\n* The Clem Jones Centre for Ageing Dementia Research (CJCADR), established in 2013.\n* The Asia-Pacific Centre for Neuromodulation (APCN), established in 2012 focuses on using deep brain stimulation to advance diagnosis and treatment of neurological diseases.\n* SUSTech-UQ Joint Centre for Neuroscience and Neural Engineering, officially opened in 2020, aims, through multi-disciplinary research teams, to enhance the quality of life of people impacted by disease and damage of the nervous system.\n* Centre for RNA in Neuroscience, which aims to work at the interface between RNA biology and the development of RNA therapies for mental health and neurological disorders.\nDirectors\n{| class=\"wikitable\"\n|+\n!Order\n!Name\n!Start date\n!End date\n|-\n|1\n|Emeritus Professor Perry Bartlett\n|2003\n|2015\n|-\n|2\n|Professor Pankaj Sah\n|2015\n| -\n|}\nReferences\nFurther reading\n* The work of M.V. Srinivasan's group on honey bees.\n*\nExternal links\n*"
    }
  ]
}