{
  "content": [
    {
      "type": "text",
      "text": "# Queenie (miniseries)\n\n| starring       = Mia SaraJoss AcklandSarah MilesSerena GordonKirk DouglasLeigh LawsonGary CadyClaire BloomTopol\n| narrator       =\n| music          = Georges Delerue\n| cinematography = Tony Imi\n| editor         = Michael RippsEric A. Sears (as Eric Sears)\n| company        = Von Zerneck/Samuels ProductionsHighgate Pictures\n| network        = ABC\n| first_aired    =\n| last_aired     =\n| runtime        = 232 minutes\n| country        = United States\n| language       = English\n| budget         = $1,000,000 AUD\n}}\nQueenie is a 1987 ABC miniseries based on the eponymous 1985 novel by writer and producer Michael Korda. Winston Beard (a pseudonym for James Goldman) and April Smith adapted the novel for television, with Larry Peerce directing.\nBackground\nIn April 1985 Korda published Queenie, a roman à clef about his aunt, actress Merle Oberon, who had married his uncle Alexander Korda. In May 1987, Queenie aired in two parts on ABC.\nPlot\nQueenie Kelley (Oberon had been known earlier in life as \"Queenie O'Brien\" and \"Queenie Thompson\") is an extremely beautiful girl of Indian and Irish descent, fair enough to pass for white. Growing up in Calcutta, however, Queenie is made all too aware of her \"chee-chee\" (mixed) background by her enemies, specifically wealthy Prunella Rumsey.\nOne of Prunella's mother's lovers, however, is Queenie's uncle, Morgan Jones. When their affair is discovered by Sir Burton Rumsey, he fires Jones from his musician position at the cricket club. Queenie visits with Sir Burton to plead for her uncle's job back, but he does so under the condition Queenie sleeps with him. When she realizes that he has lied to her, she storms out of the mansion, but not before he falls over a balcony and falls to his death. Once at home, Queenie tells her mother and uncle what happened, Jones and Queenie depart for England. Lost in London, Queenie finds a career as a stripper. Later, she makes her way to Hollywood, where she is renamed Dawn Avalon. Avalon becomes one of the biggest stars in Hollywood.\nDuring this time, Queenie deals with complicated relationships while trying to conceal her true identity and avoid jail due to the ongoing investigation of Rumsey's death.\nCast\n{| class=\"wikitable\"\n! Actor !! Role\n|-\n! colspan=\"2\" |Starring\n|-\n|Joss Ackland\n|Sir Burton Rumsey\n|-\n|Martin Balsam\n|Marty Rose\n|-\n|Claire Bloom\n|Vicky Kelley\n|-\n|Gary Cady\n|Lucien Chambrun\n|-\n|Kirk Douglas\n|David Konig\n|-\n|Joel Grey\n|Aaron Diamond\n|-\n|Leigh Lawson\n|Morgan Jones\n|-\n|Sarah Miles\n|Lady Sybil\n|-\n|Mia Sara\n|Queenie Kelley\n|-\n|Topol\n|Dimitri Goldner\n|-\n! colspan=\"2\" |Also starring\n|-\n|Serena Gordon\n|Prunella Rumsey\n|-\n|Rosalie Crutchley\n|Grandmother\n|-\n|Kate Emma Davies\n|Young Queenie Kelley\n|-\n|Albert Moses\n|Inspector Gopal\n|-\n|Abigail Painter\n|Young Prunella Rumsey\n|-\n|Ernest Clark\n|Sir Philip Wentworth\n|}\nCritical reception\nThe New York Times criticized the miniseries for not only being \"absurd\" but also being politically dated: \"Even the details show an insensitivity no longer acceptable in today's global village. Why, for instance, when so many Indian actors have excelled in such productions as A Passage to India and The Jewel in the Crown, do we still have to find Indian characters played by British actors using dark makeup and a singsong accent?\"\nReferences\nExternal links\n*\n*[http://home.alphalink.com.au/~agilbert/queenie.html \"Queenie: Smudging the distinctions between Black and White\", by Mark Haslam]"
    }
  ]
}