{
  "content": [
    {
      "type": "text",
      "text": "# Queen Elizabeth's Foundation for Disabled People\n\n'''Queen Elizabeth's Foundation for Disabled People (QEF''') is a charity that works with both children and adults with physical and learning disabilities or acquired brain injuries to help them gain new skills and increase their independence, helping them to achieve their potential.\nQEF operates a Care and Rehabilitation Centre just outside Leatherhead and a mobility centre in Carshalton. It also operates a chain of charity shops in the south east of England.\nThe president of QEF is Corinna, Lady Hamilton of Dalzell, DL. The charity's chief executive is Karen Deacon.\nThe QEF group also includes subsidiaries: Medical Engineering Resource Unit (MERU) based in Carshalton and The Grange (2016) Ltd in Kent.\nPatronage\nQueen Elizabeth The Queen Mother had a personal interest in the charity throughout her life, offering encouragement around the original proposals, to formally opening the Cripple's Training College on 27 June 1935 as the Duchess of York. As Queen she visited in 1941 and requested that the charity should be renamed Queen Elizabeth's Training College for the Disabled. Queen Elizabeth The Queen Mother visited a total of eight times, each visit being treasured by the trainees, residents, and staff. On 1 January 1967, the College was renamed Queen Elizabeth's Foundation in order to reflect the range of services the charity offered in addition to the training college.\nHistory\nQueen Elizabeth's Foundation for Disabled People was founded in 1932 by Dame Georgiana Buller, the Vice Chairman of the Central Council for the Care of Cripples. It opened as a vocational training college in 1934 under the name the Cripples' Training College, taking physically disabled trainees with conditions such as paralysis and tuberculosis. A women's section was set up in 1946.\nIn 1948 the foundation acquired the Dorincourt Estates in Leatherhead and in 1956 set up Banstead Place Medical Rehabilitation Centre. The College and the facilities at the Dorincourt Estates were amalgamated to become Queen Elizabeth's Foundation for the Disabled in 1967. The college developed a vocational approach to training disabled people and expanded to run workshops in areas such as engineering draughtsmanship and computer programming, as well as a mobility scheme.\nThe charity announced its closure in November 2025.\nReferences\nExternal links\n*\n*"
    }
  ]
}