{
  "content": [
    {
      "type": "text",
      "text": "# Queens Borough Hall\n\n| map_type = New York City\n| completion_date = 1940\n| architect = William Gehron and Andrew J. Thomas\n| architecture =\n| area =\n}}\nQueens Borough Hall is a public building in the Kew Gardens neighborhood of Queens, one of the five boroughs of New York City. It houses the Office of the Queens Borough President and other city offices and court space. It is located in the Kew Gardens municipal facilities stretch bounded by Queens Boulevard and Union Turnpike among other roads.\nDesigned by architects William Gehron and Andrew J. Thomas in the stripped classical style, it was built between March and November 1940 at a cost of some $1,800,000, low for its size.  Featuring a red brick facade, was 580 feet long upon construction and four stories high; the office suite for the borough president and his or her cabinet was designed for the center of the building.  The building was opened on December 4, 1940, with Mayor Fiorello H. La Guardia and many other city officials in attendance.  The structure subsequently won a design award from the Queens Chamber of Commerce. The building bears a striking resemblance to the Naval Ordnance Laboratory Administration building in Maryland, (now Food and Drug Administration headquarters) which was built in the same stripped classical style.\nA previous Queens Borough Hall, built around 1910, had been located in the Long Island City neighborhood.\nQueens Borough Hall was designed to serve as the center of civic life, and had other functions, such as a post office, when first built.  It has become a popular spot for marriages, with some 9,000 of them being performed in the hall during 2006.  Fridays are the most popular day for the ceremonies, which are presided over by the borough's deputy city clerk in a small chapel.\nFrederick MacMonnies's heroically scaled and controversial marble allegory of Civic Virtue (1909–22) was moved outside Queens Borough Hall in 1941, and decades later was still drawing criticism from those who viewed it as depicting \"masculinity as virtue and femininity as vice\". In 2012 it was moved to Green-Wood Cemetery in Brooklyn.\nAt the east end of Queens Borough Hall on 82nd Avenue, a retired New York City Subway redbird train, R33 car #9075, was previously on display signed as a 7 train. The Redbird car was formerly a visitor center for the Queens Borough Hall, but the visitor center closed in 2015 due to low patronage, and the car was then briefly used as a landmark and for movie shoots. Following years of degradation and neglect caused by apathetic Borough Hall officials, it was decided the car would be put up for auction; It sold for $235,700 in July 2022. This is part of a greater overall effort by Borough President Donovan Richards of \"reimagining the surroundings at borough hall\".\nIn 2025, the city government completed a $6.25 million renovation of the plaza in front of the building's Queens Boulevard entrance.\nSee also\n* List of New York City borough halls and municipal buildings\nReferences\nCivic Virtue\nExternal links\n* [https://web.archive.org/web/20090523102500/http://www.nyc.gov/html/dcas/html/resources/queens_boroughhall.shtml Department of Citywide Administrative Services page]"
    }
  ]
}