{
  "content": [
    {
      "type": "text",
      "text": "# Queen Elizabeth Hospital, Gateshead\n\n| map_type   = United Kingdom Tyne and Wear\n| map_caption=Shown in Tyne and Wear\n| Region     =\n| State      =\n| Country    = UK\n| HealthCare =NHS England\n| Type       = District General\n| Speciality =\n| Standards  =\n| Emergency  = Yes\n| Affiliation= Newcastle University Medical School\n| Beds       =\n| Founded    = 1948\n| Closed     =\n| Website    =\n| Wiki-Links =\n}}\nThe Queen Elizabeth Hospital is based in Sheriff Hill in Gateshead, England. It is managed by Gateshead Health NHS Foundation Trust.\nHistory\nThe hospital has its origins in the Sheriff Hill Isolation Hospital. The first building was completed in 1878 and others were added later. The  site was enclosed by a large stone wall tipped with barbed wire and broken glass, and by 1903 the hospital comprised a main block with an administrative building in the centre with a ward block on each side, another three-ward block, a porter's lodge, a steam disinfecting building, a laundry and a mortuary. The hospital had a  maximum capacity of 78 patients, who were tended by two resident doctors and 10 nurses.\nDuring the period 1918 to 1939, the isolation hospital remained the sole medical provision in Sheriff Hill. Faced with an increase in population, Gateshead Council decided that a new general hospital should be built. In March 1938, preliminary work started on the Queen Elizabeth Hospital on the site of the isolation hospital; the foundations were laid in 1939 but the outbreak of the Second World War delayed the building work. After the war the building work started again and the new buildings were officially opened by the Queen Mother on 18 March 1948.\nAn out-patients department, an accident and emergency department, a new operating theatre and a medical records department were added in 1967. A new pathology \"centre of excellence\" for patients from Gateshead, Sunderland and South Tyneside, funded from a £12 million grant from the government, opened in early 2014. A new £32 million emergency care centre opened in February 2015.\nSee also\n* List of hospitals in England\nReferences\nSources\n*\n*\n*"
    }
  ]
}