{
  "content": [
    {
      "type": "text",
      "text": "# Queenslander (architecture)\n\nQueenslander with a large veranda]]\nsuburban Queenslander in Hendra]]\n]]\nQueenslander architecture is a modern term for a type of residential housing, widespread in Queensland, Australia. It is also found in the northern parts of the adjacent state of New South Wales, and shares many traits with architecture in other states of Australia, but is distinct and unique. The form of the typical Queenslander-style residence distinguishes Brisbane's suburbs from other capital cities. The Queenslander is considered Australia's most iconic architectural style.\nThis style developed in the 1840s and is still constructed today, displaying an evolution of local style. The term is primarily applied to residential construction, although some commercial and other types of construction are identified as Queenslander.\nCharacteristics\nThe quintessential Queenslander is a single detached house made of timber with a corrugated iron roof located on a separate block of land. They are all high-set, single-storey dwellings with a characteristic veranda that extends around the house to varying extents but never entirely surrounds it. In later years, many have been renovated to enclose part or all of these verandas to create extra bedrooms. The under-house area is often also enclosed to provide extra living area to these houses, which leads to the common misconception that an authentic Queenslander has two storeys.\nThe term has evolved to apply to many different types of structures found in Queensland, such as churches. The many and varied styles all share similar features, such as prominent exterior staircases, gabled roofs, and the defining trait of being built on stumps, raising the structure from the traditional 2.8 m and varying in height depending on terrain.\nThey are typically \"tripartite\" in sectional composition: underfloor (stumps), primary rooms (can be two levels), and roof. All have one or more veranda spaces, a sheltered edge of the building that is typically only partly enclosed and used as another living zone. This consideration for climate is the defining characteristic of the Queenslander type.\n, 2025]]\nThe raising of the main living spaces off the ground can be seen as both a stylistic and practical device. There are many potential benefits and each home owner would have their own reasons for raising the house. The vertical \"stumps\", initially of timber, allow the building to \"float\" above the terrain. The building has a more imposing aesthetic when raised. Queenslanders all have this underfloor area that can used to cool the building through ventilation, however this feature will only cool the house under specific conditions more common in northern Queensland climates. Many Queenslanders are actually hotter due to this feature. Raising was often used as protection for houses in flood prone areas. Many colonial settlements were on floodplains to make use of the fertile soil, however the risk of flooding was much higher, especially before large dams were built.  Raising allows for protection of the main structure from termite and other pest attacks. The stumps help to overcome any variations in the terrain that would normally require earthworks to flatten for construction and allow for the natural flow of water across the terrain in the event of excessive rain and downpours. The underfloor space is often high enough for additional uses such as storage, a carport, or even as extra living area in the cool, dark spaces beneath the building. The underfloor area was sometimes decoratively screened at the perimeter with timber battens. At that time, there was also a belief that tropical diseases were caused by prolonged exposure to 'bad air' close to the ground (Miasma theory).  Mosquitos tend to become less common farther from the ground (insect netting or window coverings were not common at the time). Another advantage of being constructed on stumps is that the buildings are highly adaptive. Raising, lowering, reorienting, or completely relocating Queenslanders is relatively easy.\nThe main living areas of the house, being raised from the terrain, are a series of rooms on a platform floor. Traditionally, planning and fenestration encouraged cross-ventilation for passive cooling in a variety of innovative methods, including fanlights, ceiling roses, and alignment of doors and windows to allow uninterrupted air flow. The veranda is the most typical inclusion in the plan, and can be used day and night as a semiexternal living space. In Brisbane, many people have tables and chairs for dining and a daybed or sleepout on their verandas. Whirly birds placed on roofs allow for hot air to be drawn out of ceiling spaces.\nThe roof is a large and visible presence externally, and was traditionally steeply pitched. They are of varied materials, including slate and tiles, but are most characteristically sheeted with corrugated steel. The steel roofs could withstand torrential rains and be reused if damaged by cyclonic winds.\nTypically, the Queenslander is suited to the warm temperate climates and the subtropical climate of Queensland of high rainfall and mild to hot, humid climate with average summer temperatures in the range of . However, the type is found across the state and outside of Queensland, in both colder and hotter locations, usually with adaptations to suit.\nHistory\nA low-set Queenslander c. 1935With timber plentiful and the preferred building material in Queensland after 1900, a new product emerged to fill the need for housing stock – “Ready to Erect” homes provided by timber merchants with all of the pieces already pre-cut and readily available for ordering.  The homes were cheaper than the other options for home building - either working with an established builder or employing an architect. However, it would appear that “ready to erect” houses (or mill cut houses) were more suitable to the Queensland house than those constructed in other Australian states or climates.  The companies that offered this product in Brisbane were primarily Brown and Broad of Newstead and Campbell Brothers of Creek Street Brisbane. Brown and Broad began the “ready to erect” home building phase, with their products announced in 1915. The motto of the company was “Houses built in half the time.”  However, their catalogues also emphasized reliability and quality, and the fact that their tradesman were all expert in their own trade.  By 1922, the ready to build homes had spread to northern New South Wales, with an indication that this “ready to build” product may be a “Queensland phenomenon.”  There were some other timber companies in Queensland that had also adopted the concept of ready to build homes.\nOwing to their simplicity of construction, standardised designs were produced through the 1920s and 1930s. Despite these advantages, tastes changed and the style fell out of favour after the Second World War. The need for cheaper homes first had large verandas reduced to small landings. Subsequently, internal walls were no longer made of timber and were made of fibreboards, such as asbestos sheeting or fibre/gypsum panels. Additionally, after the war, surplus military earthmoving equipment became common and preparing sites for construction was then possible and the relative cheapness of construction on stumps diminished.  Land availability decreased and preferences moved towards lower-maintenance types of housing. These factors led to the adoption in Queensland, as elsewhere, of the ubiquitous \"modern\" American style, usually a single level and usually sold as a combined land and home package. These newer homes are usually made with a timber or metal frame, but with a brick veneer.\nStyle\nThe Queenslander, a \"type\" rather than a \"style\", is defined primarily by architectural characteristics of climate-consideration. They have been constructed in the popular styles of the time, including Colonial, Victorian, Federation, Arts and Crafts/Art Nouveau, Interwar styles, and post-World War II styles. The Queenslander is popularly thought of as an \"old\" house, although Queenslanders are constructed today using modern styles, as well as \"reproductions\" of previous styles.\nAshgrovian\n, Ashgrove 1937]]\nAshgrovian is the term coined for a variation of the Queenslander built between the late 1920s and World War II in the suburb of Ashgrove in Brisbane. The term Ashgrovian was coined from the prolific number of these dwellings constructed in the interwar period and was an adaptation of the Bungalow style which was popular in the early parts of the 20th century. Extremely popular with middle-income earners, these dwellings were almost always fronted with a grand gable roof, often surrounded by secondary smaller gables behind. The smaller gables usually sheltered verandas and sleepouts. A staircase almost always dominated the front yard leading to the veranda, which in later years was commonly filled in to form extra rooms. Other late additions included projecting bay or box-seat windows usually centrally located in the front of the house.\nCurrent\nMany old Queenslander buildings, both residential and commercial, have been demolished to make way for more modern buildings, particularly in the inner urban area of Brisbane, contributing to Brisbane's gentrification. However, community awareness of urban heritage has had local governments implement conservation measures to protect the unique 'tin and timber' character of neighbourhoods and towns dominated by Queenslander architecture. While master-planned housing estates are indistinguishable from those in other states, many custom-built homes are designed in a more modern version of the Queenslander style, particularly holiday houses in coastal areas. Many Queenslander-style homes are being removed/relocated to save them from demolition when the land is being developed.\nStump caps\nAs white ant (termites) pose a serious problem in Queensland to timber dwellings, Queenslander buildings have stump caps (also known as ant caps). These are metal plates placed on top of each stump shaped to make it difficult for white ants to reach the main part of the building. However, accumulations of dirt or ants' nests can enable the caps to be traversed by the white ants, so regular inspections are needed to ensure the stump caps are in good condition and for early detection of white ant entry to the main structure.\nNot being built of stone or brick, Queenslander architecture cannot have a foundation stone. However, the desire for the traditional ceremony of laying a foundation stone, particularly for churches and other community buildings, evolved a new tradition in Queenslander buildings of a stump-capping ceremony, where an ant cap was ceremonially affixed to one or more stumps. Since an ant cap cannot have a commemorative message (unlike a foundation stone), sometimes a plaque or other method of commemoration was subsequently added to the building to record the occasion for posterity, but mostly such stump-capping ceremonies left no permanent commemoration.\nSee also\n*Architecture of Australia\n*Australian residential architectural styles\n*Bahay na Bato, an architectural style that evolved for the tropics in the Philippines\n*List of architectural styles\n*List of house styles\n*List of Queensland's Q150 Icons\nReferences\nFurther reading\n*\nExternal links\n*[http://www.qm.qld.gov.au/Find+out+about/Histories+of+Queensland/Queensland+families/Queensland+house Queensland house – Queensland Museum]\n*[http://nosmalldreams.net/ Sustainable Queenslander House Renovation]\n*[http://www.phab.com.au/projects/timber-and-tin/ Timber and Tin Revisited: Modifications to the Queensland House Using Burra Charter Principles]\n*[https://www.slq.qld.gov.au/research-collections/queensland/built-heritage/house-histories House Histories] - Research the history of your Queenslander (State Library of Queensland)\n*[https://onesearch.slq.qld.gov.au/permalink/61SLQ_INST/tqqf2h/alma9917994044702061 ]\n*[https://www.slq.qld.gov.au/collections/queensland/built-heritage Built Heritage] (State Library of Queensland)\n*[https://explorer.corley.slq.qld.gov.au/ Corley Explorer] (State Library of Queensland)"
    }
  ]
}