{
  "content": [
    {
      "type": "text",
      "text": "# Queens of Noise\n\n| recorded   = November 1976\n| venue      =\n| studio     = Brother (Santa Monica, California)\n| genre      =\n* Hard rock\n* glam rock\n* pop metal\n| length     =\n| label      = Mercury\n| producer   =\n* Kim Fowley\n* Earle Mankey\n| prev_title = The Runaways\n| prev_year  = 1976\n| next_title = Live in Japan\n| next_year  = 1977\n| misc         =\n| single2     = Queens of Noise\n| single2date = February 1977\n| single3     = Neon Angels on the Road to Ruin\n| single3date = February 25, 1977   1977\n| single4     = Midnight Music\n| single4date = March 1977\n}}\n}}\nQueens of Noise is the second studio album by the American rock band the Runaways, released on January 7, 1977, through Mercury Records. It is the last album to involve Cherie Currie and Jackie Fox as members of the band.\nIt is fundamentally a hard rock album, although it also exhibits influences from glam rock. While the album features a range of different tempos, most of it consists of the \"heavy\" guitar-driven tracks that have come to be seen as the Runaways' signature sound, although it also features two noticeably softer songs that have sometimes been described as early power ballads.\nWhile stylistically similar to the band's self-titled debut album The Runaways, Queens of Noise features greater emphases on volume and musical sophistication. The album has received generally positive reviews and has remained the band's best-selling record in the United States.\nBackground\n, Joan Jett, Jackie Fox, Sandy West, and Cherie Currie.]]\nAfter their self-titled debut album achieved some critical and popular success in the summer of 1976, the Runaways retained the same five woman line-up for Queens of Noise: Cherie Currie (lead vocals), Lita Ford (lead guitar), Joan Jett (rhythm guitar), Jackie Fox (bass guitar), and Sandy West (drums).\nAccording to Fox, the band was contractually obligated to produce two studio albums each year for their label (Mercury Records), which led to the eventual release of Queens of Noise on January 7, 1977.\nBefore the recording of Queens of Noise began, the increasingly poor relationship between the Runaways and their manager, Kim Fowley, led them to arrive at the mutual decision to bring in a different day-to-day producer for the album. The man selected to both engineer and produce the album was Earle Mankey, most famous for his work with the Beach Boys, although Fowley did remain involved in its production on a periodic basis.\nRecording\nQueens of Noise was recorded in November 1976 at Mankey's Brothers Studio in Santa Monica, California, a facility most famous for its association with the Beach Boys.\nAccording to Fox, the Runaways did much of the producing themselves, which resulted in a greater emphasis on volume as well as more musical sophistication than the \"keep it simple\" approach that Fowley preferred.\nWith the singular exception of \"Midnight Music\", all of the songs on the album were recorded in the same fashion: drums, bass, and rhythm guitar (except for the riffs) were all recorded \"live\" at the same time, with West, Fox, and Jett (respectively) all in sight of each other during recordings. They each recorded in separate rooms, however, in order to prevent their instruments from \"bleeding\" together during recording. Riffs, lead guitar solos, and vocals were then recorded later and ultimately mixed with the drum, bass, and rhythm guitar tracks to achieve the finished product. Ford used multiple techniques for recording her solos, including playing both through a mic'd amplifier and directly into the mixing board. According to Fox, West did not use a click track while recording.\nIn addition to the ten songs that were released on Queens of Noise, the Runaways also recorded two more during these sessions that did not ultimately make the final cut for the album: \"Hollywood Dream\" and \"C'Mon\".\nBoth of these songs were eventually included on the 1980 album Flaming Schoolgirls, which included previously unreleased material that was not made public until after the Runaways' breakup in 1979.\nAccording to Fox, the recording and potential inclusion of \"Hollywood Dream\" on this album sparked a \"true band rebellion\" because only lead vocalist Currie wanted to see it released.\nFord and Fox were so displeased with the song that they both refused to record their respective instruments on the track, and with the support of Jett and West they helped ensure that it was not included in the finalized album.\nRelease and packaging\nQueens of Noise was released on three different formats: vinyl record, musicassette, and Stereo 8 track tape.\nThe cover features all five of the Runaways dressed in similar black shirts and pants, all \"clinging to long, metallic shafts\" in a design that Marianne Moro describes as a \"stripper pole album cover theme\".\nThe Runaways are partially obscured by smoke in the photograph that was used on the front cover of the album, which according to Fox was taken \"at the last moment before we all started choking\". The back cover features a similar photograph that is posed differently and does not include any smoke, which Fox notes was originally intended to grace the front of the album, while the eventual front image was initially planned to be put on the back.\nAfter Fox suggested that the smoke-filled image would draw more attention on the front of the album, as well as noting the practical concern that it would not lend itself well to having the track listing and other notes printed over it, Mercury Records agreed and switched the covers.\nComposition\nQueens of Noise features a total of ten songs that are evenly split between the two sides of the original vinyl record. Nine of the ten songs were written or co-written by members of the band themselves, while the other (the title track \"Queens of Noise\") was written specifically for the Runaways, meaning that the album does not include any true covers.\nJett described herself as \"really proud\" of Queens of Noise as a whole and declared that it \"is a lot more listenable\" than The Runaways, while Fox felt that it is \"not a very good album\" overall.\n\"Queens of Noise\"\nThe album's titular song has a \"heavy\" sound and features a distinctive riff as well as a guitar solo by Ford. The only song on the album that was not written or co-written by any of the Runaways themselves, \"Queens of Noise\" was penned by Billy Bizeau of the Quick, the other band that Fowley managed.\nJett noted that the title of the song was derived from a lyric in the song \"American Nights\" from the album The Runaways, while Fowley referred to it as a \"great opening song and statement\".\nAccording to Fox, Currie believed that the song had been written with the intention that she would sing the lead vocals, but Jett insisted on singing them and, with the support of the rest of the band, did so. However, according to Currie, she was unable to sing the lead vocals because she had an abortion shortly before the song was recorded, and by the time she had recovered and returned to the studio, Jett had already recorded the lead vocals.\nAccording to Fox, Currie was infuriated by the decision to include Jett's version on the album, although as a compromise she was allowed to sing the first verse during live performances of the song while Jett sang the second verse.\nBoth Fox and Andy Doherty believe that this song in particular serves as a microcosm of the growing tension between Currie and Jett over the issue of lead vocals, a tension reflected by those duties being evenly split between the two on this album.\n\"Take It or Leave It\"\nWritten singlehandedly by Jett, who also handles lead vocal duties on the song, \"Take It or Leave It\" challenges the title track in terms of strength and power with its \"thunderous\" drumming from West, who begins the song with a drum fill, and \"powerful\" guitar playing by both Ford and Jett.\nBarry Myers praised it as \"possible single material\" while Fowley referred to it as \"pure Runaways\", although Fox dismissed it as \"one of my least favorite Runaways songs\".\nAlex Henderson nonetheless deemed it a \"classic\" in his review for AllMusic, along with the songs \"Neon Angels On the Road to Ruin\" and \"I Love Playin' with Fire\", while Jett noted that it \"always went over really well\" with audiences when it was played live.\n\"Midnight Music\"\nIn sharp contrast to the first two songs on the album, \"Midnight Music\" is a softer and more melodic song with Currie on lead vocals. She was quite happy with the finished version of the song, remarking that it \"turned out more fantastic than I thought it would\".\nWritten by local songwriter Steven Tetsch, Fowley, and Currie together, Fox noted that the song was initially unpopular with the other four members of the band, but in 2000 remarked that upon further listening it was \"actually one of the better songs on the album\".  Despite this, Doherty argued that it is not representative of the Runaways' style because it \"lacks their spirit and rough around the edges approach\".\n\"Born to Be Bad\"\nWritten by Fowley, West, and Michael \"Micki\" Steele during the latter's brief tenure as bassist, \"Born to Be Bad\" is very slow in tempo and features \"unusually mellow\" lead vocals from Jett for part of the song.\nFox believed that Fowley intended the lyrics to refer at least in part to the Vietnam War but Jett interpreted them as concerning homeless people living in the Manhattan neighborhood of Bowery, a claim supported by Jett's declaration that the song is \"about someone who is a born loser\".\nThe song has received both highly positive and highly negative reviews. Myers lamented that it is \"not one of the best tracks\" on the album, while Fox dismissed it as \"almost as embarrassing as 'Johnny Guitar.\n\"Neon Angels on the Road to Ruin\"\nWritten by Ford, Fowley, and Fox, \"Neon Angels on the Road to Ruin\" is driven by a slow riff and a guitar solo that are both provided by Ford.\nDescribed simply as a \"crunching heavy rock track\" and \"hard-ass rock\", the song is considered by both Henderson and Doherty to be one of the best tracks on the album.\nFowley described it as reminiscent of a \"European approach to heavy metal\", while Fox viewed it as the band's \"concession to Lita's heavy metal [desires].\"\nCurrie's performance on lead vocals has been called \"outstanding\", although Fox observed that Currie hated to sing it live night after night because she had great difficulty repeatedly hitting the highest notes in the song.\n\"I Love Playin' with Fire\"\nThe first track on the second side of the original album, \"I Love Playin' with Fire\" is the second song on Queens of Noise that was written by Jett alone.\nIt is an up-tempo song with Jett providing lead vocals that Myers describes as \"divinely decadent\", while it also features both a powerful riff and another guitar solo from Ford.\nFowley described the lyrical content of the song as Jett's perspective on \"getting ripped off and almost destroyed by superficial love\".\nFox remarked that it was \"always a lot of fun to play\" and that she thought that Ford's solo was \"one of her best\".\nThe song also features hand clapping during the third verse, which the Runaways recorded with a group of friends that included Rodney Bingenheimer, an experience that Fox remembered as an excruciatingly long process because \"someone was off on every take\".\n\"California Paradise\"\nWritten by Fowley, Jett, West, and Kari Krome (Jett's friend and an important catalyst in the band's formation), \"California Paradise\" was the first of the Queens of Noise songs to be penned, and it was even one of the songs that Fox learned while auditioning for the band.\nAfter beginning with another opening drum fill from West, the song quickly becomes a guitar-driven \"stomping rock track\" with Currie on lead vocals and Jett harmonizing with her on the choruses.\nIt is a unique track on the album because the guitar solo is split between Jett, who plays the first portion, and Ford.\nFowley described it as an \"answer to 'California Girls' by the Beach Boys although musically it resembles a Gary Glitter record\".\nFox praised it as \"probably the best song on the album\".\n\"Hollywood\"\nWritten by Fowley, Fox, and Jett, \"Hollywood\" features Jett on lead vocals for the fifth and final time on the album, while Fox provides backing vocals.\nAccording to Jett, the lyrics of the song concern \"a girl wanting to become a star knowing that you can become one.\" Doherty described it as \"one of the weaker [songs] on the album\", although Myers considered it one of the four songs that made up the \"consistently enjoyable\" stretch between \"I Love Playin' with Fire\" and \"Heartbeat\".\n\"Heartbeat\"\nOriginally written by Ford and Fox, \"Heartbeat\" was conceived as a mock love song to Joey Ramone and was initially intended to feature Fox on lead vocals.\nBecause Currie had already lost a significant number of lead vocals to Jett by the time it was recorded, Fowley decided to have Fox and Currie sing the lead vocals together in an effort to appease Currie, but Fox recalled that \"Cherie's voice and mine didn't blend well at all\" and they gave up trying to record together.\nWithout Fox's knowledge or approval, Currie and Fowley then rewrote the lyrics to be about David Bowie and recorded the vocals without Fox. According to Currie, \"[Fowley] wrote something and I rearranged it and wrote the melody\".\nJett described the lyrical content as the story of a frontman and a frontwoman who fall in love but \"can't stay together because each one has to go their own way to help their career\".\nMyers described it as one of the album's two \"tear-jerkers\", along with \"Midnight Music\", and praised Currie's vocals as \"irresistibly moody\".\n\"Johnny Guitar\"\nThe concluding track \"Johnny Guitar\" was written by Fowley and Ford, and at 7:15 it is more than twice as long as all but one of the other songs on Queens of Noise.\nDescribed by Jett as a chance \"for Lita to show off her lead guitar work\", the \"seven minute epic\" has been criticized as \"an unnecessary use of vinyl\" and a \"doom-laden attempt at a slow blues number\".\nFox even went so far as to declare it \"without a question the single worst song the Runaways ever did\".\nIt has also garnered positive reviews, however, including Henderson's recognition of it being a \"fine vehicle\" for Ford's guitar playing and Moro's belief that it proved Ford \"could actually play\".\nCritical reception\n| rev2 = ''Christgau's Record Guide\n| rev2score = C−\n| rev3 = The Rolling Stone Album Guide\n| rev3score =\n| rev4 = Sounds\n| rev4score =\n}}\nIn a contemporary review, Sounds'' magazine's Barry Myers said Queens of Noise features an \"improved studio sound\" and recommended it to his readers.\nIn a negative review for The Village Voice, Robert Christgau gave the album a grade of \"C−\" and panned the Runaways as \"bimbos\" whose singing sounds out of tune. He amended the grade to a \"C\" for ''Christgau's Record Guide: Rock Albums of the Seventies''.\nIn a retrospective review for AllMusic, Alex Henderson referred to it as the Runaways' \"outstanding sophomore effort ... hard rock that pulls no punches either musically or lyrically\".\nAndy Doherty called Queens of Noise \"a real development\" from The Runaways, deeming that it is \"definitely worth a listen . . . in fact, quite a few listens\".\nIn his book The Rough Guide to Rock, Peter Buckley praised Queens of Noise as \"a pop-metal pinnacle\".\nReleases and legacy\n, Cherie Currie, Dakota Fanning and Kristen Stewart at the SXSW 2010 screening of the film The Runaways.]]\nBetween 1997 and 2011, Queens of Noise was re-released on CD six separate times.\nIn 2008, it was included by Australian label Raven Records on a 22-song \"2-for-1\" CD that also included the entirety of The Runaways along with two selections from ''Waitin' for the Night.\nWhile critics such as Myers recognized that the Runaways possessed \"tremendous potential\" going forward and eagerly anticipated their third studio album, Queens of Noise'' was the final studio album to feature either Currie or Fox.\nDoherty described the losses of the band's lead vocalist and bassist, respectively, as \"a pity as they were both strong in their respective fields\".\nQueens of Noise proved to be the best-performing of any of the Runaways' albums in the charts, reaching number 172 on the Billboard 200 in the United States. The eventual third album, ''Waitin' for the Night'', failed to chart.\nMultiple songs from the album were featured in the 2010 film about the band. In addition to the inclusion of the album version of \"Hollywood\", it also featured covers of \"California Paradise\", \"Queens of Noise\", and \"I Love Playin' With Fire\" recorded by Dakota Fanning and Kristen Stewart, who respectively portrayed Currie and Jett.\nTrack listing\nCredits adapted from the album liner notes.\n| extra_column = Lead vocals by\n| title1       = Queens of Noise\n| writer1      = Billy Bizeau\n| extra1       = Joan Jett\n| length1      =\n| title2       = Take It or Leave It\n| writer2      = Jett\n| extra2       = Jett\n| length2      =\n| title3       = Midnight Music\n| writer3      = Cherie Currie, Kim Fowley, Steven Tetsch\n| extra3       = Currie\n| length3      =\n| title4       = Born to Be Bad\n| writer4      = Fowley, Michael Steele, Sandy West\n| extra4       = Jett\n| length4      =\n| title5       = Neon Angels on the Road to Ruin\n| writer5      = Lita Ford, Fowley, Jackie Fox\n| extra5       = Currie\n| length5      =\n}}\n| title7       = California Paradise\n| writer7      = Fowley, Jett, Kari Krome, West\n| extra7       = Currie and Jett\n| length7      =\n| title8       = Hollywood\n| writer8      = Fowley, Fox, Jett\n| extra8       = Jett\n| length8      =\n| title9       = Heartbeat\n| writer9      = Currie, Ford, Fowley, Fox, Earle Mankey\n| extra9       = Currie\n| length9      =\n| title10      = Johnny Guitar\n| writer10     = Fowley, Ford\n| extra10      = Currie\n| length10     =\n}}\nPersonnel\nAdapted from the album liner notes.\nBand members\n*Lita Ford – lead guitar, groan on \"Johnny Guitar\"\n*Joan Jett – rhythm guitar, 12-string guitar on \"Born to be Bad\", overdubbed first solo on \"California Paradise\", hand clapping on \"Queens of Noise\" and \"I Love Playin' With Fire\", lead and backing vocals\n*Jackie Fox – bass guitar, hand clapping on \"Queens of Noise\", backing vocals on \"Queen of Noise\", \"Take It Or Leave It\", \"Hollywood\"\n*Sandy West – drums, backing vocals on \"Take It Or Leave It\"\n*Cherie Currie – lead and backing vocals, tambourine and snare on \"Midnight Music\"\nAdditional musicians\nM. Barle — hand clapping on \"Queens of Noise\" and \"I Love Playin' With Fire\"\nM. Gormley, B. Krayer — hand clapping on \"Queens of Noise\"\nG. Zipperman, K. J. Smythe, Karls — hand clapping on \"I Love Playin' With Fire\"\nProduction\n*Kim Fowley – producer\n*Earle Mankey – producer, engineer, mixer\nCharts\n{| class=\"wikitable plainrowheaders\"\n|-\n! scope=\"col\"| Chart (1977)\n! scope=\"col\"| Peakposition\n|-\n!scope=row|Australian Albums (Kent Music Report)\n|align=\"center\"|36\n|-\n|-\n|-\n|}\nNotes\nReferences\nExternal links\n*"
    }
  ]
}