{
  "content": [
    {
      "type": "text",
      "text": "# Queen Elizabeth II Health Sciences Centre\n\n| map_caption = Location in Nova Scotia\n| Helipad =\n| HealthCare = Medicare\n| Type = Teaching\n| Speciality =\n| Standards =\n| Emergency = Tertiary trauma centre (Highest Level I)\n| Affiliation= Dalhousie University Faculty of Medicine\n| Beds =\n| Founded = 1994 (amalgamation)\n| Closed =\n| Website = [https://www.nshealth.ca/locations-and-facilities/qeii-health-sciences-centre Official website]\n| Wiki-Links =\n}}\nQueen Elizabeth II Health Sciences Centre, in Halifax, Nova Scotia, Canada, is a large teaching hospital affiliated with Dalhousie University. The QEII cares for adult patients. Pediatric patients within the region are cared for at the IWK Health Centre. Administratively, the QEII is part of the Nova Scotia Health Authority.\nHistory\nThe Queen Elizabeth II Health Sciences Centre was created through an amalgamation of four Halifax health-care centres, namely: the Victoria General Hospital, the Camp Hill Medical Centre, the Cancer Treatment and Research Foundation, and the Nova Scotia Rehabilitation Centre. The former Halifax Infirmary and Camp Hill Hospital had previously merged to form the Camp Hill Medical Centre in 1988. Elizabeth II, Queen of Canada, named the new hospital on 15 August 1994. The QEII was formally created by an Order in Council in September 1994. The amalgamation was finalized by legislation (the Queen Elizabeth II Health Sciences Centre Act) in 1996.\nThe Halifax Infirmary was established by the Sisters of Charity of Saint Vincent de Paul (Halifax) in 1886 with a new building constructed at the intersection of Queen and Morris Streets in 1933. The Sisters of Charity operated the hospital until it was taken over by the provincial government in 1973. Until 1973, the Halifax Infirmary functioned largely as the city's Roman Catholic hospital. The building was closed when the present Halifax Infirmary on Summer Street opened in 1998; the \"new Infirmary\" has consolidated all emergency and outpatient services for the Queen Elizabeth II Health Sciences Centre, eliminating duplication between the Infirmary and Victoria General.\nCamp Hill Hospital was founded by the Canadian military in 1917 as temporary lodgings for casualties of the First World War. It was constructed on the east side of Robie Street across from Cherry Street and was expanded throughout the years. In 1971, the City of Halifax founded the Abbie J. Lane hospital adjacent to Camp Hill on the corner of Jubilee Road (now Veteran's Memorial Lane) and Summer Street. In 1987, the Camp Hill Veterans' Memorial building was opened, and the original Camp Hill facilities were subsequently demolished. The new Veteran's Memorial Building, the Abbie J. Lane Hospital, and the Halifax Infirmary on Queen Street were merged to form the Camp Hill Medical Centre. By 1992, planning had begun for construction of the new Halifax Infirmary building to replace the aging Queen Street facilities and relocate the Infirmary to the Camp Hill Medical Centre Summer Street campus.\nThe Victoria General Hospital was established in 1887 by the City of Halifax and the provincial government when the former City and Provincial Hospital at the same site (Peter McGuigan, The Historic South End Halifax) was renamed; the City and Provincial Hospital having been established in 1859. In 1948, a new Victoria General Hospital was opened immediately east of the land which would eventually become home to the IWK Health Centre, a children's hospital, on a block bounded by Tower Road, University Avenue, and South Street, and was the largest hospital in the province in terms of both staff and bed capacity. A hospital parking area was established in the lot between Tower Road and South Park Street; in the 1980s the lot was expanded to physically join with the hospital facilities, effectively dividing Tower Road into two sections north and south of the facility. Historically, the VG, as it is called, was aligned with the Dalhousie University Faculty of Medicine as the province's only teaching hospital.\nA new, 450-bed Halifax Infirmary was completed in 1996 at a cost of around $130 million, and the first patients were moved to the new building in early 1997. A new emergency department opened at the Infirmary on 1 March 1997, replacing the emergency centres at the old Infirmary and the Victoria General. A 672-space above-ground parking garage opened at the Infirmary in 2003. An enlarged emergency department, the Charles V. Keating Emergency and Trauma Centre, opened in a $20.4-million extension to the Infirmary building in June 2009.\nThe pipes in some parts of the QEII have been contaminated with legionella bacteria since the 1980s, which has rendered water in some buildings undrinkable.\nPhysical components\nQueen Elizabeth II Health Sciences Centre - Bethune Building (foreground); Centennial Building is visible in the background\nThe QEII Health Sciences Centre occupies 10 buildings located on two campuses (formally termed \"sites\") on the Halifax Peninsula.\n* Halifax Infirmary site\n** Abbie J. Lane Memorial Building (mental health/family medicine)\n** Camp Hill Veterans' Memorial Building (veterans health services, administered on behalf of Veterans Affairs Canada)\n** Halifax Infirmary (inpatient services, outpatient clinics, emergency department)\n* Victoria General site\n** Bethune Building (administrative offices, patient services and clinics)\n** Centennial Building (inpatient and outpatient services)\n** Centre for Clinical Research (resource centre for all QEII-based health research, affiliated with Dalhousie University Faculty of Medicine)\n** Dickson Building (Nova Scotia Cancer Centre, Specimen Collection Services)\n** Mackenzie Building (Department of Pathology and Laboratory Medicine)\n** Nova Scotia Rehabilitation Centre (physical rehabilitation)\n** Victoria Building (inpatient and outpatient services)\nSee also\n* Royal eponyms in Canada\nReferences\nExternal links\n*\n* [http://www.qe2foundation.com/ QEII Foundation]"
    }
  ]
}