{
  "content": [
    {
      "type": "text",
      "text": "# Queen Victoria Street, Hong Kong\n\n| image                   = HK Queen Victoria Street Tsit Wing Group.jpg\n| caption                 = Section of Queen Victoria Street, between Des Voeux Road Central and Queen's Road Central in June 2006\n| length_m                = 200\n| namesake                = Queen Victoria\n| length_ref              =\n| location                = Central, Hong Kong\n| coordinates             =\n| direction_a             = North\n| terminus_a              = Connaught Road Central\n| direction_b             = South\n| terminus_b              = Queen's Road Central\n}}\nBeginning of Queen Victoria Street: Intersection with Connaught Road in August 2011\nQueen Victoria Street () is a one-way street in Central, Hong Kong Island, Hong Kong. Named after Queen Victoria, the street stretches from Connaught Road Central to Queen's Road Central. The street is noted for the many landmarks that it runs past, namely Central Market and the headquarters of the Hang Seng Bank.\nHistory\nDuring the First Opium War, the British occupied Hong Kong in 1841 and one year later, the territory was ceded to them in the Treaty of Nanking. The street is named after Queen Victoria, who was the reigning British monarch at the time Hong Kong was colonised. Particularly, its Chinese name is a mistranslation of \"Queen\" and means queen consort instead of queen regnant.\nAt the time of the handover of Hong Kong in 1997, it was believed that Queen Victoria Street would be renamed along with other streets and places to erase memories of the colonial past. This was in spite of a statement by the Urban Council declaring it generally had no intention of modifying the names of streets that bore colonial references. The renaming did not come to fruition at the handover, and the street still retains its royal name to the present day.\nDescription and features\nFrom its northern end, Queen Victoria Street begins at Connaught Road Central, travelling down one-way past the headquarters of the Hang Seng Bank, located to the west of the street. It then reaches the intersection with Des Voeux Road Central; the next segment of the street ascends up a slope southwards. Here, it passes Central Market—also located on its west side—before ending on Queen's Road Central. The street is parallel to the adjacent Jubilee Street,}}\n|type=incomplete\n|notes=Westbound entrance only\n}}\nSee also\n* List of places named after Queen Victoria\n* List of streets and roads in Hong Kong\nReferences\nExternal links\n*[https://maps.google.com/maps?f=d&hl=en&geocode=&saddr=22.284649,114.156763&daddr=%E5%9F%9F%E5%A4%9A%E5%88%A9%E7%9A%87%E5%90%8E%E8%A1%97+%4022.283530,+114.155130&mrcr=0&mrsp=0&sz=18&mra=dme&sll=22.283904,114.156028&sspn=0.002035,0.003648&ie=UTF8&ll=22.284083,114.155926&spn=0.002035,0.003648&z=18&om=1 Google Maps of Queen Victoria Street]"
    }
  ]
}