{
  "content": [
    {
      "type": "text",
      "text": "# Queen Arwa Mosque\n\n()\n*  ()\n}}\n| image                 = Queen Arwa al-Sulayhi Masjid.jpg\n| image_size            =\n| alt                   =\n| caption               = View of the mosque, nestled in the buildings of Jibla and slopes of the Sarat Mountains, as seen from the palace\n| map_type              = Yemen#Middle East#West Asia\n| map_size              =\n| map_caption           = Location in Yemen\n| map_relief            = 1\n| location              = Jiblah\n| coordinates           =\n| religious_affiliation = Islam\n| rite                  =\n| region                = South Arabia\n| country               =\n| state                 =\n| province              = Ibb Governorate\n| territory             =\n| prefecture            =\n| sector                =\n| district              = Jiblah\n| cercle                = Jiblah\n| municipality          =\n| consecration_year     =\n| status                =\n| functional_status     = Active\n| heritage_designation  =\n| leadership            =\n| patron                =\n| website               =\n| architecture          =\n| architect             =\n| architecture_type     = Mosque\n| architecture_style    = Yemenite\n| founded_by            =\n| funded_by             =\n| general_contractor    =\n| facade_direction      =\n| groundbreaking        =\n| year_completed        = 1111 C.E. (532 A.H.)  1358 C.E. (renovation)\n| construction_cost     =\n| specifications        = Yes\n| capacity              =\n| site_area             =\n| length                =\n| width                 =\n| width_nave            =\n| height_max            =\n| dome_quantity         = 2\n| dome_height_outer     =\n| dome_height_inner     =\n| dome_dia_outer        =\n| dome_dia_inner        =\n| minaret_quantity      = 2\n| minaret_height        =\n| spire_quantity        =\n| spire_height          =\n| materials             =\n| nrhp                  =\n| added                 =\n| refnum                =\n| designated            =\n}}\nThe Mosque of Queen Arwa bint Ahmad Al-Sulayhi (|Masjid Al-Malikah Arwā bint Aḥmad Aṣ-Ṣulayḥī}}), or simply the Queen Arwa Mosque, is a historical mosque in Jibla, Yemen. It was built between 1056 and 1111 C.E. by Queen Arwa al-Sulayhi and her tomb had later become the site of pilgrimage. It retains its importance as one of the oldest ancient Yemeni mosques. It is also known as Hurrat-ul-Malikah Mosque, as the queen was often referred as Al-Malika Al-Hurra, which means \"The Noble Queen\".\nHistory\nThe construction of the mosque is attributed to Queen Arwa bint Ahmad al-Sulayhi, who ruled the Sulayhid state of Yemen for the period between 1085 and 1138. When Queen Arwa moved to the city of Jibla in 1087, she ordered the conversion of the Palace of  () into a mosque. The mosque still retains its architectural and decorative elements of the time which show the extent of the influence of Fatimid architecture.\nArchitecture\nThe complex is rectangular with an open courtyard () in the middle, surrounded by four corridors. The wall of the qiblah is located at the northern hallway. The area of the qiblah is accessible through five entrances on the southern side. It consists of four rows of high columns, some octagonal and some rectangular shaped. The roof is directly covered by the ceiling and the hall is covered with wooden beams dating back to the 11th-century, some of which were renewed in 1358. The southern hallway consists of southern wall with two entrances. The eastern hallway consists of two pillars with pointed columns. On the south-side of the western hallway there is a hall currently used as a madrasa for the memorization of the Quran.\nFile:Jibla.jpg|Courtyard\nFile:Mosque carved historical entrance.JPG|Carved historical entrance\nFile:Wooden ceiling, Maulatena Hurratul Maleka.jpg|Wooden ceiling\nFile:Cont.water at Hurrat-ul-Malaika mosque.JPG|Continuous running water at the mosque\nFile:Mimbar Hurrat-ul-Malaika Mosque, Ji Jibla.jpg|Minbar\nMihrab\nThe mihrab is located in the middle of the wall of the qiblah at the northern hallway. It is a simple cavity of about 85&nbsp;cm deep, and topped by a tapered lace on two poles with floral and geometric motifs. The mihrab is surrounded by kufic inscriptions, which reads as follows: \"In the name of God the Most Gracious the Most Merciful I accept your Lord and be among the worshipers and not of the ignorant and worship your Lord until there comes to you the certainty (death)\", and decoration of niche from the inside and variety of plant decorations which includes leaves of grapes. On the side of the mihrab there is an inscription written in kufic of script from Surah At-Taubah 18. The mihrab is painted with modern chemical paint.\nMinarets\nThe mosque has two minarets, one located on south-east, and another on south-west. The eastern minaret consists of a high square stone based body with sixteen ribs.\nFile:Jibla, Yemen (15452313647).jpg|Both of the mosque's minarets, as seen from below\nFile:Mosque view from entrance.JPG|View from the entrance, January 1970\nFile:Minerat seem from palace of Arwa al-Sulayhi, Jibla, Yemen.jpg|As seen from the Palace of Queen Arwa\nFile:Queen_Arwa_Mosque_-_Jibla.jpg|View of a minaret, as seen from the courtyard\nMausoleum of the Queen\nIt was built as ordered by the queen and is located on the north-west corner of the mosque. The site of her tomb was separated from the building of the mosque as she mentioned in her will and told by eyewitnesses and judges. The facade of the mausoleum is adorned with architectural elements, in the form of hollow niches in the eastern wall. Out of four entrances, there are two in the south which have width of , height of  and depth of . The kufic line is engraved with a prominent kufic floral engraving design and Biblical scripts on the façade.\nFile:Tasbih Hurrat-ul-Malaika .JPG|Wooden tasbih of Hurrat-ul-Malikah\nFile:Mousoleum Hurrat-ul-Malaika Arwa.JPG|Mausoleum of the Queen inside the Mosque\nFile:Hurratul malika.jpg|The Queen's grave\nSee also\n* List of mosques in Yemen\nReferences\nExternal links\n* In Arabic\n* [https://www.art.com/products/p37125983680-sa-i9778542/queen-arwa-mosque-11th-century-jibla-ibb-governorate-yemen.htm Queen Arwa Mosque, 11th Century, Jibla, Ibb Governorate, Yemen]"
    }
  ]
}