{
  "content": [
    {
      "type": "text",
      "text": "# Queen of the Mountains (film)\n\n| runtime        = 135 minutes\n| country        = Kyrgyzstan\n| language       = Kyrgyz, Russian\n| budget         = $1.3M\n}}\nQueen of the Mountains () is a 2014 Kyrgyzstani epic drama film directed by Sadyk Sher-Niyaz. It was selected as the Kyrgyzstani entry for the Best Foreign Language Film at the 87th Academy Awards, but was not nominated.\nCast\n* Elina Abai Kyzy as Kurmanjan Datka\n* Nazira Mambetova as older Kurmanjan Datka\n* Aziz Muradillayev as Alymbek Datka\n* Adilet Usubaliyev as Kamchybek\n* Dildorbek Rahmonov as Uzbek old man\nPlot\nThe film begins in 1816 in Alay District, when a young Kurmanjan Datka is brought to a fortune teller in a cave who foretells that she will one day be worth ten sons. Throughout the movie there are intermittent scenes of a tiger in her vicinity, with the first immediately after leaving the cave.\nMarried off at a young age, after moving to her husband's yurt she refuses him. She repulses the attempted rape by his friend, and escapes on horseback, to go back to her family. She marries the local datka, Alymbek, who runs into trouble when he disputes the Kokand's khan's increasing taxes. The khan himself is under pressure, with northern tribes seeking independence.\nAlymbek desires the unification of all Kyrgyz tribes, and he meets with Jantai, khan of a northern tribe; a \"Great Assembly\" of all tribes is called--and the Kokand khan, when word reaches him, has Alymbek murdered. As part of that scheme, killers threaten Kurmanjan who escapes on horseback, protected by a tiger. Kokand's khan invades Alay and the tenuous Kyrgyz unity is threatened, until Kurmanjan (who just presided over a birth and was told to seek safety) shows up with the women of her tribe to strengthen the army. A patriotic speech convinces the men (who invoke Manas) to stay and defend a crucial mountain pass. The invasion is thwarted.\nThe emir, unhappy with the khan's assassination of Alymbek, himself returns the body, with the head of the killer, and proclaims Kurmanjan as datka. Now united, quickly after the fall of the khanate the Alai people submit to  the Russian Empire who recognize their courage, and general Mikhail Skobelev negotiates with Kuramanjan. Prisoners are exchanged, seized lands are returned, and the Alai people are left free to govern themselves and practice Islam.\nOne of Kuramanjan's sons, Abdyldabek, goes to exile in Afghanistan, where he dies. Skobelev's successor is less sympathetic to the Alai, and conflicts between Alai and Russians lead to bloodshed involving her other son, Kamchybek, who is to be executed. Kuramanjan is there, as are armed rebels, but she allows the hanging to proceed. She, in voice over narration, speaks of the sacrifices mothers perform for their country.  The closing scene, dated 1906, portrays a group photograph of Kyrgyz children in front of yurts, and one of Kuramanjan on horseback--the famous photograph taken by Carl Gustaf Emil Mannerheim.\nCritical reception\nThe film has received positive reviews, with the Montreal Gazette calling it \"hauntingly poetic\". Queen of the Mountains was named as one of the best of the Montreal World Film Festival by Cult Montreal and that it \"should be nominated for an Oscar\".\nOn 4 November 2014, a special screening of the film was hosted by Sharon Stone at the Egyptian Theater.\nAwards\n*2014: Award for Best Feature Film at the 2014 Eurasian Film Festival\nSee also\n* List of submissions to the 87th Academy Awards for Best Foreign Language Film\n* List of Kyrgyzstani submissions for the Academy Award for Best International Feature Film\nReferences\nExternal links\n*"
    }
  ]
}