{
  "content": [
    {
      "type": "text",
      "text": "# Queen Jiang (character)\n\nQueen Jiang () is a character from the Chinese classical novels The Investiture of the Gods (Fēngshén Yǎnyì) and The Story of King Wu Conquering Zhou and Bringing Peace (). As the first queen consort crowned by King Zhou of Shang, she was the daughter of the Eastern Duke, Jiang Huanzhu (). She bore two sons, Yin Hong and Yin Jiao, with King Zhou.\nAfter Daji entered the palace, she plotted and ultimately caused the tragic death of Queen Jiang. After her death, Queen Jiang is deified as the Taiyin Star (), one of the Twelve Luminaries ().\nLegend\nAccording to historical records and surviving oracle bone inscriptions, Queen Jiang does not appear to have existed. It is believed that her prototype was Jiuhou Nü, who was a consort of King Zhou of Shang. She was the daughter of the leader of the Guifang, Jiuhou, and was presented to King Zhou through a political alliance. However, she was ultimately executed by King Zhou on charges of \"disliking lewdness\", and her father suffered the same fate with dismemberment. The tomb of Jiuhou Nü is located in present-day Qixian County, Hebi City, Henan Province, along the banks of the Qi River.\nIn Fengshen Yanyi , Queen Jiang was the daughter of the Eastern Duke, Jiang Huanchu. She was of extraordinary beauty and became the queen consort of King Zhou of Shang. She gave birth to two sons, Yin Jiao and Yin Hong. At that time, Daji, who was of bewitching beauty, had just been selected for the palace and was honored as the imperial concubine. She was not familiar with Jiang, but they became acquainted a few months later. Two years later, Jiang was crowned queen, which aroused Daji's jealousy. As a result, Daji launched a series of conspiracies to frame Queen Jiang.\nAfter being framed by Daji, Jiang was demoted to the status of imperial concubine by King Zhou of Shang and banished to the cold palace. In her solitude there, Daji gained favor, while Jiang endured loneliness. Despite Yin Jiao and Yin Hong, her two sons, informing King Zhou of Shang about everything, the king chose to heed Daji's slanderous words and disregarded his sons' counsel, opting instead to punish the two princes with beatings. Two months later, Lady Yin, the wife of Li Jing, spoke of Queen Jiang's virtues in front of King Zhou. Upon hearing this, King Zhou released Queen Jiang. That night, King Zhou of Shang reinstated Jiang as queen once again.\nOnce, under the influence of alcohol, Daji accompanied King Zhou in disguise for a patrol. After two hours, they returned on horseback. Later, in a fit of jealousy, Daji punished Queen Jiang with thirty lashes and sent her to the cold palace. To prove her innocence, Queen Jiang sent a messenger pigeon to Lady Yin, the wife of Li Jing. Upon receiving the message, Lady Yin rushed to the cold palace. When Lady Yin entered the cold palace, she saw Queen Jiang being gouged out of her eyes, so she went to stop her. However, Queen Jiang was already dead.  After the conclusion of the event, Daji slandered King Zhou by accusing Queen Jiang of plotting rebellion, attempting to assassinate King Zhou, and assisting her father, Duke Jiang Huanchu, in usurping the throne of Shang from the Zhou dynasty. Subsequently, King Zhou enfeoffed Daji as queen. After Queen Jiang's death, her two sons, Yin Jiao and Yin Hong, were marginalized by Daji and eventually slandered to death by King Zhou. When Jiang Ziya was naming gods, Queen Jiang was appointed as the Taiyin Star.\nIn popular culture\n*Portrayed by Yuan Quan in 2023 Chinese film Creation of the Gods I: Kingdom of Storms\nReferences"
    }
  ]
}