{
  "content": [
    {
      "type": "text",
      "text": "# Queensland in World War I\n\nWorld War I impacted on many aspects of everyday life in Queensland, Australia. Over 58,000 Queenslanders fought in World War I and over 10,000 of them died.\nHistory\nThe outbreak of war created a heightened sense of patriotism; the recruitment call for Queenslanders to volunteer for the Australian Imperial Force met its initial quota of 2500 enlisted men by September 1914.\nAs Australian soldiers marched off to World War I on a wave of patriotism, Queensland was in a state of political flux. With an increasingly active and unionised workforce, vocal and radical anti-war groups, and a change of government in 1915, the people of Queensland struggled to find a partisan approach towards the war. Despite these issues, the Queensland Government had a duty to support the war effort, to keep social conflict to a minimum, to provide reasonable living and working conditions for its citizens, and to look to the welfare of returned soldiers and families of soldiers who died.\nAs the most visible public servants across the state, the Queensland Police were intimately involved in government actions throughout the war. Additional duties were thrust upon them, even as their numbers decreased due to police officers enlisting in the armed forces. These duties included enforcing some of the provisions of the National Security Regulations, and the War Precautions (Alien Registrations) Regulations. Police were required to maintain the internal security of the state and to administer support to the war effort and to recruitment. One of their earliest tasks was tracking members of the British reserve forces in Australia to notify them of their call-up on the outbreak of war. Foreign-born reservists of combatant counties were considered to be prisoners of war; some were interned while others were paroled to move freely within the community provided they regularly reported to police.\nAnti-German sentiment led to a Cabinet direction in 1916 that persons of German or Austrian birth were not to be employed in the Queensland Public Service if there were British nationals available for the task. (At that time, those born or naturalised in Australia were British nationals as there was no separate status of Australian citizenship.) However, due to the shortage in personnel, the 65 German-born Queensland police officers were not dismissed, though they were scrutinised by their senior officers. Throughout the war Queensland police were required to maintain secret surveillance on members of the Turkish, Syrian, Bulgarian, Greek, and Italian communities across the state. At the behest of the Queensland War Council, police also provided assessments of the moral character of soldiers' wives who were receiving assistance.\nThe Queensland War Council and subsequent Local War Council Committees were established in 1915 principally to help recruit and provide support for returned soldiers and for the families of those who were disabled or killed in war. The Queensland War Council Chairperson was the Premier of Queensland. The council was the primary force in the repatriation of Queensland soldiers until the Australian Government established a similar entity in early 1918. In the early part of the war the council supported the establishment of the Anzac cottages and the tuberculosis home schemes. The Queensland Government's Discharged Soldiers Settlement Act 1917 provided land and financial assistance for which all returned servicemen could apply. Another measure to support returned servicemen was the preferential employment scheme adopted by the Queensland Public Service.\nThe Queensland Government did not require women to take employment in war industries as they had in Britain, and full-time employment for women did not significantly increase. Relatively small numbers of women were accepted as military nurses, and only after prolonged lobbying were the Voluntary Aid Detachments of the Australian Red Cross able to send units to overseas hospitals. It was in voluntary organisations that women made their direct and most significant contributions to the war effort. These organisations took on the responsibility of providing comforts for sick and wounded soldiers here and abroad, and providing frontline troops with morale-building gifts and articles of clothing. The Red Cross Society began work almost immediately upon the declaration of war. From initial knitting circles, the scope of Red Cross support expanded rapidly to include teaching handcrafts to convalescent soldiers, mending hospital clothes and providing food and other necessary supplies to local and overseas military hospitals. So strong was the mobilisation of Red Cross \"kitchen ladies\" that in addition to providing food for the Rosemount, Kangaroo Point and Lytton military hospitals, they were also able to supplement food to asylums, orphanages, and public hospitals. Other voluntary organisations - the National Council of Women (which was an amalgam of 41 other societies), the Queensland Soldiers' Comfort Fund, the Babies of the Allies Clothing Society, the Women's Mutual Service Club, the Soldier's Pastime Club, Sailor's and Soldiers Residential Club, and the Christmas Box Fund to name but a few - provided similar services. The social and economic value of such voluntary work was considerable.\nQueensland women also exercised their right to vote during the war years. The Military Service Referendum Act 1916 and the War Precautions (Military Service Referendum) Regulations 1917 were contentious, the debate concerning conscription dividing Australian society on religious and political grounds. Women rose to their feet to speak publicly in support or against the proposals. Both attempts to conscript men for military service were defeated. At the height of the second conscription referendum, the Queensland Government, which was the only state with an anti-conscription position, took the extraordinary step of stationing armed police on the Queensland Government Printing Office to prevent the Australian Government censoring anti-conscription material in the Raid on the Queensland Government Printing Office.\nQueensland society changed considerably during the war years. The strains on the local economy prompted the government to embrace the acquisition of state-owned industries in an effort to keep living standards affordable. This social experiment also divided the population, and, as the war drew to a conclusion, the state was no less polarised by political ideology. However, there was a shared empathy for the survivors of Queensland's 57,705 enlistees, for those who were killed, and for their families. This manifested itself in many ways but particularly in the erection of World War I memorials in many towns across the state and in the annual Anzac Day ceremonies.\nSee also\n* Queensland in World War I (1914)\nReferences\nAttribution\nThis Wikipedia article was originally based on [https://web.archive.org/web/20160223232006/http://www.archives.qld.gov.au/Researchers/History/Pages/qld_home_front.aspx \"The Queensland home front during the First World War\"] (January 2014) by Brian Rough published by the State of Queensland under [https://creativecommons.org/licenses/by/3.0/au/ CC-BY 3.0 AU] licence (accessed on 24 February 2016, [https://web.archive.org/web/20160223232006/http://www.archives.qld.gov.au/Researchers/History/Pages/qld_home_front.aspx archived] on 24 February 2016).\nExternal links\n*"
    }
  ]
}