{
  "content": [
    {
      "type": "text",
      "text": "# Queen Hyogong\n\n| spouse       = Mokjo of Joseon (m. 1223)\n| issue        = 6 sons\n| posthumous name =\n| house        = Pyeongchang Yi (by birth)Jeonju Yi (by marriage)\n| father       = Yi Gong-suk\n| mother       = Lady Jeong\n| religion     =\n}}\nQueen Hyogong of the Pyeongchang Yi clan (; 1207–?) was the wife Yi Ansa and mother of Yi Haengni, making her became great-grandmother to Yi Jachun who was the father of Yi Seonggye, Joseon's founder. Among the Joseon queens, she was the only one who came from the Yi clan and honoured as Hyo-Bi () at first.\nBiography\nHer 4th great-grandfather was Yi Gwang, Prince Baekoh (; 1126–1170) from Pyeongchang-gun, Gangwon Province. Because King Sejong disallowed a man and woman from the same clan to marry and any woman with the surname Yi,\"Joseon Wangjo Sillok\"  24 June 1442 part. 1 she became the only Joseon Queen Consort whom came from a Yi clan () in Joseon history.\nIn 28 July 1392, when Taejo established a new dynasty, she was granted the royal title Consort Hyo () along with her husband whom was granted the title King Mok (). Later on 22 April 1411, King Taejong, gave her a posthumous name Queen Hyogong (). Her tomb was located in Alleung, Neung-ri, Gapyeong-myeon, Siheung-gun, Hamgyeongnam-do along with her husband.\nFamily\n*Father: Yi Gong-suk (; 1176–?)\n**Grandfather: Yi Seong-ro ()\n**Grandmother: Lady Jeong ()\n*Mother: Princess Consort Dolsan of the Jeong clan (; 1180–?); Yi Gong-suk's second wife\n**Grandfather: Jeong Seok (; 1160–?)\n**Grandmother: Lady Gim of the Samcheok Gim clan (; 1160–?); daughter of Kim In-gwe ().\n**Sister: Lady Yi ()\n*Husband: Yi An-sa (이안사; 1204–1274)\n*Son(s):\n#Yi Jeong, Grand Prince Anpung (; 1224–?) - married a woman from the Yi clan.\n#Yi Eo-seon, Grand Prince Ancheon (이어선 안천대군; 1230–1274) – married the daughter of Gim Nam-ok () from the Gimhae Gim clan.\n#Yi Jin, Grand Prince Anwon (; 1232–?) – married Princess Consort Pyeongsan of the Pyeongsan Sin clan ().\n#Yi Haeng-ri, Ikjo of Joseon (; 1236–?) – married Queen Jeongsuk of the Deungju Choe clan ().\n#Yi Mae-bul, Grand Prince Anchang (; 1238–?) - married a woman from an unknown clan.\n#Yi Gu-su, Grand Prince Anheung (; 1240–?) – married a woman from the Cheongju Han clan.\nReferences"
    }
  ]
}