{
  "content": [
    {
      "type": "text",
      "text": "# Queen's Chapel\n\n| country          = England\n| website          =\n}}\nThe '''Queen's Chapel' (officially, The Queen's Chapel St. James's Palace'' and previously the German Chapel) is a chapel in central London, England. Designed by Inigo Jones, it was built between 1623 and 1625 as an adjunct to St. James's Palace, initially as a Catholic chapel for the Infanta Maria Anna of Spain, Holy Roman Empress, who in the end never used it because she didn't marry King Charles I of England. Afterwards, it was used by the woman he did marry, Queen Henrietta Maria of France, a Catholic, and her retinue. In later years, it served various continental Protestants who were resident at Court. It is one of the facilities of the British monarch's household religious establishment, the Chapel Royal, but should not be confused with the 1540 liturgical building also known as the Chapel Royal, which is within the palace, just across Marlborough Road. Queen's Chapel is a Grade I listed building.\nHistory\nThe Queen's Chapel was built as a Catholic chapel at a time when the construction of churches for that denomination was otherwise prohibited in England, and was used by Charles I's wife French Queen Henrietta Maria, who imported chapel furnishings from France. During the English Civil War it was used as a stable. It was refurbished in 1662, and again in the 1680s by Christopher Wren. From the 1690s the chapel was used by the Continental Protestant courtiers of William and Mary. In 1718, the chapel was given over to German courtiers of George I who had moved to England with him. The chapel was then called the German Chapel. On 17 September 1782 the German organist Augustus Frederic Christopher Kollmann began work at the Royal German Chapel and he was there for the rest of his life. He was succeeded by his son George Augustus Kollmann and his daughter Johanna Sophia Kollmann who died in 1849.\nIt became an administered Chapel Royal again in 1938.\nThe chapel was built as an integral part of St James's Palace, but when the adjacent private apartments of the monarch burned down in 1809 they were not replaced, and in 1856–57 Marlborough Road was laid out between the palace and the Queen's Chapel. The result is that physically the chapel now appears to be more part of the Marlborough House complex than of St James's Palace.\nThe body of Queen Elizabeth The Queen Mother lay at the Queen's Chapel for several days in 2002, during the preparations for her lying-in-state in Westminster Hall before her ceremonial funeral.\nArchitecture\nThe brick building is rendered to appear as if it were stone built. It was built in a Palladian style. It has gable ends with pediments. The interior vault is gilded and painted.\nGallery\nFile:The Queen's Chapel from Marlborough House.jpg|East and North wallsfrom Marlborough House grounds\nFile:Queen's Chapel Jan Kip 1688.jpg|The Queen's Chapel in 1688 after refurnishing by Christopher Wren in 1682–1684\nFile:German Chapel, St James's Palace, from Pyne's Royal Residences, 1819 - panteek py107-331.jpg|The German Chapel in 1819\nFile:Information board on The Queen's Chapel.jpg|Plaque next to the Queen's Chapel\nSee also\n* Savoy Chapel\nReferences\nFurther reading\n*The Buildings of England London 6: Westminster (2003) pages 587–88.\n*  (note services page not updated since 2018)"
    }
  ]
}