{
  "content": [
    {
      "type": "text",
      "text": "# Queensland Railways 1800 class rail motor\n\n}}\nThe 1800 class railmotors were a class of self-propelled diesel railmotors built by Commonwealth Engineering, Granville for the Queensland Railways.\nHistory\nIn 1949, the Queensland Railways placed an order for 12 aluminium two-carriage 1800 class railmotors with Commonwealth Engineering, Granville. Each set comprised a power car (RM – \"Rail Motor\") and trailer car (TP – \"Trailer Passenger\"). The railmotors seated 55 passengers and were delivered to Queensland Railways between 1952 and 1954.\nThese trains were used on most Brisbane's suburban lines as well as country lines, especially in North Queensland. On suburban lines, they usually ran with two diesel powered railmotors at each end and one or more non powered trailer cars between the two. However, the 1800 class were not popular with passengers as they featured uncomfortable seating, poor riding qualities and inadequate ventilation for Queensland's humid subtropical climate.\nPreservation\nTwo trailer carriages, one of which is converted from a railmotor, remain in service on the Gulflander, operating between Normanton and Croydon, and one complete railmotor is preserved at the Rosewood Railway Museum. Three  railmotor bodies without bogies and one trailer passenger body also without bogies are privately owned.\nGallery\nFile:ITM3580404 1800 CLASS NEW RAILMOTOR ON TRAVERSER AT IPSWICH WORKSHOPS Dept No.QSA0946 E267.jpg|New 1800 Class Railmotor at Commonwealth Engineering Granville NSW 1952.\nFile:Railmotor93.jpg|1800 Class railmotor trailer cars 1809 and 1811 behind RM93 on the Gulflander\nSummary\n{| class=\"wikitable sortable\"\n! Number !! In service !! Withdrawn !! Scrapped !! Notes\n|-\n|RM1800\n|\n|\n|\n|\n|-\n|TP1801\n|\n|\n|\n|\n|-\n|TP1802\n|\n|\n|\n|\n|-\n|RM1803\n|\n|\n|\n|Body privately owned at Wondai.\n|-\n|RM1804\n|\n|\n|\n|Body privately owned near Dalby.\n|-\n|TP1805\n|\n|\n|\n|\n|-\n|TP1806\n|\n|\n|\n|\n|-\n|RM1807\n|\n|\n|\n|\n|-\n|RM1808\n|\n|\n|\n|\n|-\n|TP1809\n|\n|\n|\n|In use as a trailer on the Gulflander since 1980.\n|-\n|TP1810\n|\n|\n|\n|\n|-\n|RM1811\n|\n|\n|\n|Used as the QR Commissioners Car in the 1980s. Demotored in 1991, reclassified TP1811 for use as a trailer on the Gulflander.\n|-\n|RM1812\n|\n|\n|\n|Body privately owned near Gympie.\n|-\n|TP1813\n|\n|\n|\n|Body privately owned near Ebenezer.\n|-\n|TP1814\n|\n|\n|\n|\n|-\n|RM1815\n|\n|\n|\n|Preserved at the Rosewood Railway Museum.\n|-\n|RM1816\n|\n|\n|\n|\n|-\n|TP1817\n|\n|\n|\n|\n|-\n|TP1818\n|\n|\n|\n|\n|-\n|RM1819\n|\n|\n|\n|\n|-\n|RM1820\n|\n|\n|\n|\n|-\n|TP1821\n|\n|\n|\n|\n|-\n|TP1822\n|\n|\n|\n|\n|-\n|RM1823\n|\n|\n|\n|\n|}\nReferences"
    }
  ]
}