{
  "content": [
    {
      "type": "text",
      "text": "# Queens' College Boat Club\n\n}}\n| founded        =\n| motto          = Vis Apri (\"Power of the Boar\")\n| home_water     = River Cam\n| membership     =\n| affiliations   = British Rowing CUCBC\n| website        =\n| events         =\n| distinctions   =\n}}\n'''Queens' College Boat Club''' (QCBC) is the rowing club for members of Queens' College, Cambridge.\nThe current positions of the men's 1st VIII are 16th in the Lent Bumps and 14th in the May Bumps. The 1st women's VIII currently reside near the bottom of the 1st division in the Lent Bumps and May Bumps, being 15th and 17th, respectively.\nHistory\nIn the men's May Bumps, the Queens' 1st VIII took the headship for the first time in 1962, achieving the rare feat of four consecutive bumps to do so. This had only ever been achieved once before, by Lady Margaret Boat Club in 1950. Queens' retained the Mays Headship in 1963, and went head again in 1968 when they were also head in the Lent Bumps In the men's Lent Bumps, the Queens' 1st VIII largely remained in the 2nd division until about 1910, when they moved up into the 1st division. With only occasional years where the 1st VIII dropped into the 2nd division, the club eventually rose to take the headship in 1968, but lost it the following year (dropping four places) and declined into the 2nd division by 1980. Since then, the form has been somewhat erratic, rising to 3rd in 1995 before plummeting into the 2nd division again by 2000. Queens' ended a good run of form in 2007, having risen back into the mid-1st division, they crashed down four places and were awarded spoons, dropping another three places the following year.\nThe Queens' 1st women first appeared in 1981, and rose as high as 2nd in the Lent Bumps and 4th in the May Bumps, but have yet to take a headship in either event.\nIn December 2009, Queens' M1 became the first ever crew to win the Fairbairn Cup. This came after a term's racing in which Queens' also won the University IVs First and Second Men's divisions.\nQueens' Ergs\nThe Queens’ College Boat Club hosts the annual Queens' Ergs competition in the Michaelmas Term, an 8x500m indoor rowing relay race open to novices (those who have begun rowing that term) only. It usually attracts over 1000 rowers, and is the second largest indoor rowing event in the UK.\nHonours\nHenley Royal Regatta\n{| class=\"wikitable\"\n|+\n|-\n!width=70|Year\n!width=400|Races won\n|-\n| 1912 || Wyfold Challenge Cup\n|-\n| 1955 || Ladies' Challenge Plate\n|-\n| 1962 || Ladies' Challenge Plate\n|-\n| 1963 || Thames Challenge Cup\n|-\n|}\nReferences\nExternal links\n*[http://qcbc.soc.srcf.net/ Queens' College Boat Club]"
    }
  ]
}