{
  "content": [
    {
      "type": "text",
      "text": "# Queen Elizabeth Grammar School, Penrith\n\n| motto                   = Semper Eadem  (Always Constant)\n| established             =\n| closed                  =\n| type                    = AcademySelective grammar school\n| religious_affiliation   =\n| president               =\n| head_label              = Headteacher\n| head                    = David Marchant\n| r_head_label            =\n| r_head                  =\n| chair_label             =\n| chair                   =\n| founder                 =\n| address                 = Ullswater Road\n| city                    = Penrith\n| county                  = Cumbria\n| country                 = England\n| postcode                = CA11 7EG\n| ofsted                  = yes\n| local_authority         = Westmorland and Furness\n| urn                     = 136732\n| staff                   =\n| enrolment               = 830\n| gender                  = Coeducational\n| lower_age               = 11\n| upper_age               = 18\n| houses                  = Blencowe\nLowther\nTudor\nStrickland\n| colours                 =\n| publication             =\n| free_label_1            =\n| free_1                  =\n| free_label_2            =\n| free_2                  =\n| free_label_3            =\n| free_3                  =\n| website                 =\n}}\nQueen Elizabeth Grammar School (QEGS) is a coeducational selective grammar school in Penrith, Cumbria, England. The school has approximately 1040 pupils. The headteacher is David Marchant, who took over in September 2022. The headteacher from September 2004 to August 2015 was Chris Kirkup, who was succeeded by Paul Buckland from September 2016.\nHistory\nThe school was established by a royal charter issued at Westminster on 18 July 1564.\nThe charter was a response to a local appeal to the Crown, with the document saying the school was to be created 'in accordance with the humble petition of the beloved inhabitants of the town and parish of Penrith ... and of very many of our subjects of the whole neighbouring district'. The charter was sealed in the presence of Queen Elizabeth and bore a representation of the monarch on horseback on one side and sitting under a canopy on the other.\nThe creation of the school was aided by the involvement of Sir Thomas Smith, the dean of Carlisle. A linguist and a diplomat, Smith was admitted to the Privy Council in 1571 and had been educated in classical scholarship at Padua, before lecturing on natural philosophy and Greek at Queens' College, Cambridge. As an educationalist and classicist, Smith wanted to set up a grammar school in Penrith dedicated to Latin and Greek learning.\nThe grammar school was financed from the income of a former chantry school in Penrith, which was located near St Andrew's Church. This chantry and its associated school were founded by William Strickland, the bishop of Carlisle, in the early 15th Century. The school associated with the chantry was built on land belonging to the Lowther family, a local aristocratic family, who would later become the Earls of Lonsdale. The Lowther family made an annual endowment to the chantry school of around £6. However, both the chantry and its school were dissolved under the Dissolution of Colleges Act 1545 and the land on which they were built reverted to the Crown.\nIn 1564, under the charter of the grammar school, the lands of the dissolved chantry and school were restored back to the Lowther family, now headed by Richard Lowther. The new grammar school therefore inherited both the site of the former chantry school in the churchyard of St Andrew's Church and its annual endowment of around £6.\nIt is possible that some time was needed to secure this funding before teaching could begin, as the first recorded master was elected by the governors in 1569, some five years after the charter's initial issuing.\nThe school moved from these original premises in St Andrew's churchyard to its present site on Ullswater Road (A592), close to the railway station, in 1917.\nDuring the 1970s and 1980s, after the abolition of the eleven-plus, the school had its own selection process where pupils would attend the first two years of their secondary education at Penrith's Ullswater High School or its predecessor schools, then be recommended to move either to QEGS or stay at Ullswater. It is Cumbria's only true grammar school: though some other secondary schools in the county use the word 'Grammar' in their name, they are actually comprehensive schools.\nIn more recent times the school has had issues with financial management and has been issued a notice to improve by the government. They became part of the multi-academy trust Changing Lives Learning Trust in 2023.\nAdmissions\nThe admission process involves an eleven-plus style exam, which tests mathematics, verbal reasoning and non-verbal reasoning or spatial intelligence. The top 160 applicants are offered places at the school. If a student at the school decides to leave their place, it is offered to a child who nearly made it into the top 160 of that year group.\nNotable former pupils\n* Will Addison, rugby player\n* Sarah Hall, novelist\n* Charlie Hunnam, actor, star of Queer as Folk and King Arthur: Legend of the Sword\n* Lawson Soulsby, Baron Soulsby of Swaffham Prior, a microbiologist\n* Oliver Turvey, racing driver\n* Derek Eland, artist\n* Louie Johnson, rugby player\n* Gabriel Breeze, footballer\nReferences"
    }
  ]
}