{
  "content": [
    {
      "type": "text",
      "text": "# Queen Clea\n\nQueen Clea is a fictional character appearing in DC Comics publications and related media, commonly as a recurring adversary of the superhero Wonder Woman. The ruthless dictator of Venturia, a remote kingdom on the sunken continent of Atlantis, she first appeared in 1944's Wonder Woman #8, written by Wonder Woman creator William Moulton Marston and illustrated by Harry G. Peter. After several clashes with Wonder Woman, she became a member of Villainy Inc., a team consisting of several of Wonder Woman's Golden Age foes, including the Cheetah, Giganta, and Doctor Poison. She appeared periodically during Wonder Woman's Silver and Bronze Age adventures, and would be re-introduced during DC Comics' Post-Crisis era as the leader of Villainy Inc.\nFictional character biography\nGolden Age\nQueen Clea in Wonder Woman (vol. 1) #28, April 1948; art by Harry G. Peter.]]\nAs Queen of a crumbling Atlantean outpost named Venturia, Queen Clea enslaved the men of her realm and amused herself by putting many to death in gladiatorial combat. Wanting to extend her rule, Clea repeatedly attacked Venturia's flourishing sister city of Aurania, though unsuccessfully. Despite this failure she expanded her ideas towards domination over the entire lost continent of Atlantis. In 1944, it was said that Queen Clea reigns over Aurania - and it is possible that she has been Queen for quite a long time. Though Aurania has long been overshadowed by their Venturian rival, the ruthless Clea planned and executed a surprise attack that caught the Venturian military cold, and Aurania conquered and occupied Venturia. No explanation is given for this switch.\nVenturian queen Eeras managed to flee and went to the surface world where she adventured for some months, trying to find some sort of weapon to repulse the Auranian. She focused on a chemical invented by one Van Vlek; working the trail to that secret formula she ended up in Dakar where she met American military intelligence agent Steve Trevor. Pooling their resources they secured the whole formula, and Eeras asked Trevor to fly her to Atlantis on his way back to the US. Trevor, who assumed that she was a lunatic, accepted; not expecting to fly into an actual access to Atlantis he had to land in less-than- perfect conditions and they were captured by Auranian troops.\nWonder Woman came to the rescue, forging an alliance with Queen Eeras as both an Amazon and an American. Clea was, of course, busy throwing Trevor into the arena to fight prehistoric boars; Wonder Woman fought everybody off and Eeras successfully used the \"devitamizer\" derived from the Van Vlek formula to make all Auranians present collapse.\nThe Auranian prisoners recovered, and Clea had her daughter Ptra replace her as a prisoner - which was facilitated since the Venturians kept their prisoner in an iron mask that allowed her to eat and drink but prevented her speaking. Clea covertly rebuilt Aurania's power. Probably inspired by Eeras's previous strategy, she formed a band of Auranian pirates who attacked surface world ships - using blasts of air from the volcano to soar on parachutes and board nearby ships, sword in hand.\nClea was especially interested in getting herself some of the bigger, stronger and smarter manlings of the surface world, and soon struck a deal with a ship full of German prisoners who were being deported to America for farm work. As the German soldiers, equipped with local swords and shields, attacked the Venturians, Clea personally sneaked behind enemy lines to get the \"devitamizer\" that had previously felled her, then brought down the Venturian forces and Eeras. Thankfully Wonder Woman, Steve Trevor and the Holliday Girls were present to investigate the fate of the kidnapped American sailors. Wonder Woman and Eela were gassed and Wonder Woman was bound with her lasso, then the two women were covered with iron. Despite it being three inches thick, Wonder Woman broke free and freed herself and other prisoners. They freed everyone, then captured Clea and Ptra.\nQueen Eeras, being reluctant to execute prisoners, agreed to hand Clea and Ptra over to the Amazons. The incorrigible Clea soon managed to escape, when fighting Octavia, daughter of Eeras when Wonder Woman wanted her to play bullets and bracelets with her. She fired early, grazing Octavia's skull, then knocked out Wonder Woman from behind. She bound the girls, and with her prisoners returned to Atlantis. However, when she landed in Atlantis, she discovered that there had been a revolution and that the inept manlings had taken over thanks to surprise and a stockpile of captured surface world weapons which had not been used by the more traditionalist female rulers. Wonder Woman and Octavia escaped and made contact with Steve Trevor and the Holliday Girls, who had been flying nearby looking for them. In the meanwhile Clea managed to convince the stupid manling king to let her rule but it was too late, and her manlings were dispersed by the Holliday Girls. Clea was captured anew and again imprisoned by the Amazons.\nSome months later, the Saturnic slaves-driver Eviless escaped from her cell on Paradise Island and assembled a gang of prisoners, called Villainy, Inc. Clea was a part of it. Villainy, Inc. did take over Paradise Island, but were soon repulsed by Wonder Woman. Still, Clea took Giganta with her and managed to flee - and they stole a huge chest filled with Amazon jewels, too.\nClea tried to anonymously buy a submarine from Steve Trevor to return to Atlantis (why she needed a sub is unclear, possibly she wanted the weaponry on board), but Trevor recognised her and played along to capture her. He was knocked out by Giganta, and Clea and her aide decided to capture the Holliday Girls and maybe Wonder Woman to force him to give them a submarine. This sort of worked, and they forced Wonder Woman to steal a US Navy sub for them - but Clea and Giganta were recaptured before their sub could fully dive, and reimprisoned by the Amazons.\nBronze Age\nQueen Clea teams up with the Penguin in Justice League of America (vol. 1) #135, October 1976; art by Dick Dillin.]]\nIn a later story, Clea stole the fabled Trident of Poseidon to make herself virtually unstoppable. She allied with King Kull and his agents against the Justice League and Justice Society when he plans to wipe out life on Earth-One, Earth-Two, and Earth-S so his subjugated Beast-men can rule once again. On Earth-Two with Penguin of Earth-One, Blockbuster of Earth-One, and Ibac of Earth-S, she attempts to take over the recently risen Atlantis. The Earth-One Superman, Earth-One Green Arrow, Earth-S Spy Smasher, and Earth-Two Wonder Woman defeat the villains without much trouble, Wonder Woman beating Clea. A cloud is nearly used to make all land on Earth-Two sink, starting with a nearby island, but Superman stops it using his freezing breath, throws it on a comet, and Atlantis heads beneath the waves again.\nModern Age\nWhen Clea took her battle to the surface world she battled against Queen Hippolyta, who was acting as Wonder Woman in the 1940s, and was defeated. Clea then teamed with the original Villainy Inc. in order to overtake Hippolyta but this did not work out either. A new version of the team was assembled in modern times in the hopes of finishing where her plans left off. Invading the hidden nation of Skartaris, Clea did succeed in ruling the land for a limited time. Both versions of the team were defeated by Wonder Woman. In one instance Clea's own daughter, Ptra, helped Wonder Woman defeat her mother.\nClea later appears as part of a large team of super-villains assigned to kill Wonder Woman. She is once again in possession of the Trident of Poseidon and appears to possess the power of flight. She explains that she, and her fellow cohorts, have had their abilities amplified by the witch Circe. She eventually is subdued by several of Wonder Woman's allies and taken into custody by Nemesis and the Department of Metahuman Affairs. As that agency was later destroyed, the present whereabouts of Queen Clea are not known.\nDuring the Infinite Crisis storyline, Queen Clea appeared as a member of Alexander Luthor Jr.'s Secret Society of Super Villains.\nPowers and abilities\nAs an Atlantean, Queen Clea can breathe both above and under water. Clea can also physically withstand the great amounts of undersea depth pressures. Because of this, her body is resistant to most physical injury and provides a form of super strength. When in possession of the mystical trident belonging to Poseidon, Clea's strength levels increase and she has limited control over water. The trident also has the ability to fire force blasts. Due to a spell by the witch Circe, Clea now also has the ability of flight. Also, as Clea was depicted as arguably young both in the 1940s while battling Hippolyta and around the same age when later battling Diana in modern times, it can be suggested that Clea either has a longer than average lifespan or is possibly immortal.\nIn other media\nQueen Ocina, a character inspired by Clea, appears in the Super Friends episode \"Return of Atlantis\", voiced by Kathy Garver. She is the ruler of an unnamed Atlantean city which is a misandrist society dominated by women.\nSee also\n* List of Wonder Woman enemies\nReferences\nExternal links\n* [https://web.archive.org/web/20060818122229/http://www.mykey3000.com/cosmicteams/cosmic/uv.html#villainy Cosmic Teams Profile]\n* [http://spider-bob.com/villains/dc/QueenClea.htm Queen Clea Profile]\n*\n* Jett, Brett. [http://www.mediafire.com/view/38n6bhda988zen7/WhoIsWonderWoman_PDF--bonus.pdf/ \"Who Is Wonder Woman?--Bonus\"], (2009): \"Major Villains\", 1–17.\n* Marston, William Moulton. Emotions Of Normal People. London: Kegan Paul, Trench, Trübner & Co, Ltd. 1928.\n* [http://www.dcuguide.com/who.php?name=queenclea The Unofficial Queen Clea Biography]"
    }
  ]
}