{
  "content": [
    {
      "type": "text",
      "text": "# Queen bee (sociology)\n\n}}\nfinalists in 2014 appear before the audience. The \"queen\" is an elected senior leadership role for American high school and university students in their final year of study .]]\nA queen bee is a woman who dominates or leads a group, is in a favoured position or behaves as such. The term has been applied in several social settings, including business and education. It has also become a stock character or the basis of fictional characters in novels, film, television and other media.\nBusinesses\nIn a business environment, queen bee may refer to women who are emotionally immature and view other women as competition, but not necessarily all other women. They often will refuse to help other women advance within a company by, for example, preferring to mentor a male over a female employee. Some may actively take steps to hinder another woman's advancement as they are seen as direct competitors. Such tactics are sometimes referred to as heterophily (in the sense of positive preference and favoritism for opposite-sex colleagues) or the queen bee syndrome.\nThe term loophole woman, coined by Caroline Bird in her book Born Female: The High Cost of Keeping Women Down (1968), has a similar meaning. Marie Mullaney defines the loophole woman as one who, \"successful in a male-dominated field such as law, business administration, or medicine, is opposed to other women's attaining similar levels of professional success. Such professional success, if attained by women on a large scale, would detract from, if not substantially reduce, her own status and importance.\"\nSchools\nA queen bee in a school setting is sometimes referred to as a school diva or school princess. They are often stereotyped in the media as being beautiful, charismatic, manipulative, popular, and wealthy, often holding positions of high social status, such as being head cheerleader (or being the captain of some other, usually an all-girl, sports team), the Homecoming or Prom Queen (or both). The phenomenon of queen bees is common in finishing schools.\nQueen bees may wield substantial influence, popularity, and power over their cliques and are considered role models by clique members and outsiders. Her actions are closely followed and imitated. Sussana Stern identifies the following qualities as characteristic of queen bees:\n*Possessing an inflated ego, an exaggerated sense of self-aggrandizement, and an overly-heightened sense of self-esteem, which may lead to arrogance and snobbery.\n*Being overly-aggressive, selfish, manipulative, shallow, superficial, and hubristic\n*Behaving as a bully or sociopath\n*Being wealthy and/or spoiled\n*Being tall, fashionable, sexy, pretty, popular, talented, privileged, or even of superior intelligence\n*Being envied/feared/admired by peers (mainly female peers), who often express internalized sentiments of inadequacy, inferiority, and insecurity.\nFictional examples\n* Kathryn Merteuil from the 1999 film Cruel Intentions played by Sarah Michelle Gellar; a wealthy, cold-hearted and cocaine-using manipulator from the elite Upper East Side of New York. Kathryn hides her true malevolent nature beneath a wholesome facade of Catholicism, propriety and compassion, fooling her peers and teachers into believing she is a model student and an image of perfection when she is really an expert in deceit and cruelty, and uses and humiliates others for her own pleasure.\n* Regina George in the 2004 film Mean Girls, played by Rachel McAdams. The wealthy, beautiful, and popular queen bee of Northshore High school, who rules over the Plastics, an exclusive clique of wealthy and beautiful girls.\n* Courtney Shayne in the 1999 film Jawbreaker, played by Rose McGowan. The sociopathic Courtney murders her rival, Elizabeth Purr (Charlotte Ayanna) at the beginning of the film, and goes to extreme lengths to cover up the murder and maintain her popularity by tarnishing the reputation of her victim, by spreading lies that Elizabeth was a rebellious, promiscuous girl who was murdered by a one-night stand.\n* Marianne Bryant in the 2010 film Easy A, played by Amanda Bynes. A hypocritical, domineering and judgemental Christian fundamentalist girl who uses her faith to unfairly pass judgement and inflict her beliefs on others.\n* Chris Hargensen in the 1974 Stephen King novel Carrie and its various film adaptations. Chris is a wealthy, spoiled and sadistic girl with a long history of bullying unpopular classmates, her favorite victim being the titular character, Carrie White.\n* Heather Chandler in the 1989 black comedy Heathers, played by Kim Walker. Chandler is a wealthy and beautiful but maliciously cruel narcissist who rules over the students of Westerburg High School. Her overwhelming cruelty to her peers causes them a great deal of mental stress, leading them to develop low self-esteem and eating disorders.\n* Jennifer Check in the 2009 horror film ''Jennifer's Body, played by Megan Fox. A conceited and spiteful cheerleader who often browbeats and dominates her weak-willed best friend (played by Amanda Seyfried), and who becomes possessed by a succubus, killing and cannibalising her male classmates, after being sacrificed in a dark magic ritual.\n* Mertle Edmonds in the film Lilo and Stitch'', voiced by Miranda Paige Walls. She is the leader of a clique composed of herself and three other girls in the hālau hula. She takes great pleasure in putting down, insulting, bullying, and making fun of others, especially Lilo Pelekai.\n* Emma Woodhouse, the titular protagonist from Jane Austen's novel Emma and its film and television adaptations could be considered to be an early example of the \"queen bee\" stereotype. Emma is the beautiful and intelligent daughter of a wealthy landed gentry family, and is genuinely well-liked and popular amongst the people of the village of Highbury, where she lives. Although she is kind and genuinely well-meaning, Emma has a tendency to be selfish and meddlesome, constantly interfering in the lives of those around her, especially their romantic relationships, believing her judgement to be infallible. Gradually throughout the novel, she is considerably humbled, and she accepts that she must improve her attitude and become less self-centred and interfering. Her rival, Mrs Augusta Elton, the village vicar's wife, follows the queen bee character more closely, being vain and obnoxious, and constantly competes with Emma for status in the community.\n* Rachel Green, from the sitcom Friends, played by Jennifer Aniston. Throughout the series, Rachel was constantly described as the most popular girl in Lincoln High School, being the head cheerleader, Prom Queen and class president. However, despite her close friendship with the overweight, awkward Monica Geller (Courteney Cox), Rachel was also revealed to be somewhat spiteful towards some of her less popular classmates and even toward Monica's older brother, Ross Geller (David Schwimmer).\nSee also\n*Elitism\n*Mean girl\n*Narcissism\n*Sociopathy\n*Queen bee syndrome\n*Prima donna\n*Diva\nReferences\nFurther reading\n*\n*\n*\n*"
    }
  ]
}