{
  "content": [
    {
      "type": "text",
      "text": "# Queen's Road, Brighton__disambig_1\n\n| direction_b = North\n| terminus_b = Seven Dials, Brighton\n| previous_type = A\n| previous_route = 2004\n| next_type = A\n| next_route = 2011\n}}\n'''Queen's Road''' is a major street in the seaside resort of Brighton, part of the English city of Brighton and Hove.  It was laid out in 1845, partly replacing a large area of poor quality slum housing, during a period when Brighton was growing rapidly following the arrival of the railway from London.  The street's purpose was to connect Brighton railway station directly with the old town and the main commercial area, and the railway partly funded its construction and its subsequent widening.  Queen's Road quickly took on a commercial character, with many hotels and pubs opening; several large warehouses were built; and it also became the centre of the town's medical profession.  In the postwar era large offices began to predominate, and buildings including Brighton's first \"super cinema\" were lost.  Several architecturally important buildings survive, though, and the street remains important as \"the principal thoroughfare for visitors arriving ... by train\".\nHistory\nIn the early 19th century, there was little development in the area now served by Queen's Road: a local directory recorded 25 properties in the area in 1822.\nBrighton railway station opened in 1840 in temporary premises as the eastern terminus of a line to Shoreham-by-Sea.  The line from London, built in stages, was completed the following year, and a large permanent station building was built on an artificial plateau  above sea level.  At this time, the only ways to reach Brighton town and seafront were indirect: either eastwards via the steeply sloping Trafalgar Street and through the densely populated artisan area now known as North Laine as far as London Road, or north-westwards along the steep uphill gradient of Terminus Road to Seven Dials, thence down Dyke Road past St Nicholas' Church.\nSome distance to the south of the station, the ancient Church Street (leading to St Nicholas' Church) crossed from west to east.  Next to it on its north side stood Windsor Terrace, a terrace of houses built around the late 1820s; these stood opposite the burial ground of Hanover Chapel, a Presbyterian (originally Congregational) chapel built further down Church Street in 1825.  To the south of this, two slum districts developed north of North Street, which was a major commercial route and the northern boundary of the old town.  Durham and Petty France were jointly described as \"an overcrowded warren\" which lay on the projected route of the new road.  A report in 1845 by the Town Commissioners, forerunners of the later Brighton Borough Council, described how the authorities dealt with the issue: \"...[t]he reason [for the demolition programme] did not stem from concern for the inhabitants, but because these slums were along the route from the station to the seafront, and the Town Commissioners did not wish the visitors to see them.  Neither did they gain the consent of the tenants; the inhabitants ... had to be lured out of their houses by a festivity at The Level.  While they were there, the houses were demolished.\"  This has been described as the first of the many slum clearances to have taken place in Brighton over the years; similarly the construction of the road has been identified as \"one of the first railway-inspired developments\" in Brighton.}} and passing between Windsor Terrace and the burial ground of Hanover Chapel.  The western section of the burial ground was buried underneath the new road, but its boundary wall and railings survive as a Grade II-listed raised pavement in front of the former Windsor Terrace, whose houses have been incorporated into Queen's Road.  At the north end, a bridge was built across the western end of Trafalgar Street, and buildings were erected right up to the station frontage.  The London and Brighton Railway paid £2,000 towards the cost of the road's construction.\nBrighton's first dedicated healthcare institution, the Brighthelmston Dispensary, moved to a new building in Queen's Road in 1849 from its previous home at Middle Street.  By the time it closed in 1930 it was known as the Brighton, Hove and Preston Dispensary.  The similar Brighton, Hove and Preston Provident Dispensary, also originally based at Middle Street, moved to Queen's Road in 1878 and closed in 1948 upon the formation of the National Health Service.  The Sussex Throat and Ear Hospital, the Sussex Eye Hospital and the Brighton, Hove and Preston Dental Hospital were also based in nearby premises at various points in the late 19th and early 20th centuries.\nQueen's Road was widened in 1878; most of the cost was met by the London, Brighton and South Coast Railway.  Further changes took place in 1924, when a hotel and several other buildings were demolished to provide a link road between Queen's Road, the parallel Surrey Street and Trafalgar Street, and in 1935 when this road (Junction Road) was widened further to provide bus stops.  The widening of 1878 affected the buildings on the east side, which were replaced by a series of furniture depositories, warehouses and similar facilities.  None survive; the last was demolished in 1990.  In June 1880, a fire started in one of these buildings, an upholsterer's warehouse, and spread.  Volunteer firefighters, police officers, the railway fire brigade and soldiers from Preston Barracks were all required to bring it under control; it was the worst fire in Brighton at that time.  In 1884, Hanover Chapel's former burial ground was taken over by Brighton Corporation, the successor to the Town Commissioners, following the passing of that year's Brighton Improvement Act.  It was maintained as a graveyard until 1949, when it was redesigned as the Queen's Road Rest Garden; this involved digging up the gravestones and placing them around the walls instead. Since 1989, it has been entered through a gateway in Queen's Road.\nIn 1921 the Adullam Strict Baptist Chapel, a pub and several other buildings were demolished to make way for the Regent Cinema, designed by Art Deco architect Robert Atkinson.  When it opened on 27 July 1921 it was regarded as the first \"super-cinema\" and \"the most luxurious in the country\".  Rebuilt after a fire in 1928, it remained in use until 1967 when it was converted into a bingo hall.  This closed in 1973 and the cinema was demolished in 1974.\nThe east side of the street was substantially redeveloped in the 1960s, mostly with large office blocks.  This has contributed to its status as one of Brighton's main commercial streets, along with North Street, West Street and Western Road.  Since it was built, Queen's Road has also been the most important route from the railway station to central parts of Brighton and (via West Street) the seafront, and is the first thing visitors see upon arrival: the view southwards also offers people \"[their] first prospect of the sea as they troop from their trains\".  By the 1930s, when mainline trains were electrified, \"queues for trains back to London would stretch on sunny weekends down Queen's Road to the Clock Tower.\"  The immediate impact of the railway upon the town was demonstrated when in May 1850 it was found that 75,000 people had come to Brighton by train.  As well as \"a constant stream of pedestrian traffic\", the road is used regularly by buses and taxis and, as part of the A2010 road, by through traffic travelling towards Seven Dials and beyond.\nAlmost the whole of the west side of Queen's Road, along with a short terrace of commercial buildings on the east side (120–124 Queen's Road), are included in the West Hill Conservation Area, one of 34 conservation areas in Brighton and Hove.  This conservation area was designated in 1977.\nBuildings\nBrighton railway station, a Grade II*-listed building, faces the north end of Queen's Road and is the street's \"most important building\".  The original (1841) section, a two-storey, nine-bay Italianate structure designed by David Mocatta, is largely hidden by the elaborate iron canopy erected in front of it in 1882 by H.E. Wallis, who also added the curved train shed.  The building is \"entirely characteristic of the greater Victorian railway station\".  As originally designed by Mocatta the station had a Tuscan colonnade leading straight on to Queen's Road.\nTwo distinctive and elaborate Victorian pubs, the Queen's Head and the Royal Standard, are immediately south of the station on the west side, separated by a \"more restrained stucco terrace\" with shops on the ground floor and accommodation above.  The Queen's Head was refronted in 1878 when the road was widened; the Royal Standard (number 61), similarly refronted around 1890–1900 but in a contrasting brick and terracotta style, has decorative columns and cupolas.  In contrast, there are no historic buildings on the east side until Sun Dial House is reached at the junction of North Road.  It is of brick and stucco with a corner dome and a prominent sundial.  Opposite are two Grade II-listed buildings: the \"imposing if ungainly\" Masonic Centre (number 25), one of the original houses in the area (built  1825–1830, and attributed to Amon Wilds and Charles Busby) but rebuilt for the Freemasons by local architect John Leopold Denman; and next to (and contemporary with) it, number 27: stucco-clad and rusticated, and previously used as the Brighton, Hove and Preston Dental Hospital and later by John Leopold Denman as his office and studio.\nFurther down on the west side, number 52 Queen's Road is a listed building and survives next to two 1980s office buildings of contrasting styles: Lynden House is modern in style, while Imperial House reflects 19th-century architecture.  Other than the dental hospital, all the former medical buildings stood on the east side between North Road and the former burial ground, a section now occupied by office buildings of the 1960s and 1970s such as Eagle Star House.  Also in this area was the Oddfellows Hall, built in 1854 and demolished in 1969.  Towards the bottom of the road, the sites of the demolished Regent Cinema and an adjacent bank are now occupied by a Boots shop.  Designed by Derek Sharp, it was one of the company's largest shops when built in 1979.\nAt the bottom (south) end of Queen's Road stands the Jubilee Clock Tower, built in 1887 to commemorate the Golden Jubilee of Queen Victoria.  It was built at the point where Queen's Road, West Street, North Street and Western Road meet, which by the 1880s formed a major landmark in the town but which lacked any distinguishing features: the only building on the site was a small shelter.  The white stone and red granite structure,  high, has four clock faces and elaborate decoration.  Its showy appearance has caused controversy ever since it was built, and demands for its demolition or removal have been frequent, but it survives and is Grade II-listed.\nSee also\n*\n*Buildings and architecture of Brighton and Hove\n*Cemeteries and crematoria in Brighton and Hove#Hanover Chapel burial ground\nNotes\nReferences\nBibliography\n*\n*\n*\n*\n*\n*\n*\n*\n*"
    }
  ]
}