{
  "content": [
    {
      "type": "text",
      "text": "# Queen Tan'gyŏng\n\n| issue        =\n| birth_date   = 7 February 1487\n| birth_place  = Joseon\n| death_date   =\n| death_place  = Joseon\n| burial_date  =\n| place of burial = Onreung, Ilyeong-ri, Jangheung-myeon, Yangju, Gyeonggi Province\n| house        = Geochang Shin\n| module =\n}}\n'''Queen Tan'gyŏng (; 7 February 1487 – 27 December 1557), of the Geochang Shin clan, was a posthumous name bestowed to the wife and first queen consort of Yi Yeok, King Jungjong, the 11th Joseon monarch. She was queen consort of Joseon for seven days in September 1506, after which she was known as Deposed Queen Sin''' ().\nBiography\nThe future Queen was born on 7 February 1487 during the reign of King Seongjong. Her father, Sin Sugŭn was member of the Geochang Shin clan. Her paternal aunt, Queen Jeinwondeok, was King Yeonsangun's primary consort. Her mother, Han Eun-gwang, who was Sin Sugŭn's second wife, was a member of the Cheongju Han clan.\nThrough her maternal grandmother, Lady Sin was a great-great-granddaughter of Princess Gyeongjeong. As well as a fourth cousin to the future King Jungjong as they shared Queen Wongyeong and King Taejong as their great-great-great-grandparents (on her father's side as well making her parents third cousins).\nThrough her maternal grandfather, Lady Sin and her future husband were also third cousins as they shared Han Yŏngjŏng () as their great-great-grandfather. With Queen Insu, she was a first cousin twice removed and through marriage, she was her grandmother-in-law.\nIn 1499 at the age of 13, she married the 12-year-old Grand Prince Chinsŏng, King Seongjong's second son and younger half-brother to King Yeonsan. Through her paternal aunt's marriage, King Yeonsan was her uncle-in-law and through her own marriage, a brother-in-law.\nAs grand prince's wife, she received title the Princess Consort (). Her mother was given the royal title of \"Internal Princess Consort Cheongwon\" (), and her father was given the royal title of \"Internal Prince Ikch'ang, Sin Sugŭn\" ()\nIn 1506, King Yeonsan was deposed, and on the same day, soldiers belonging to the coup leaders surrounded Grand Prince Jinseong's house. Jinseong was about to kill himself, thinking that Yeonsan had sent troops to kill him; but Princess Sin dissuaded him from taking his own life. When her husband became king (temple name: Jungjong), she became a queen consort. However because her father was the brother-in-law of Yeonsan, he was opposed to her husband's enthronement; her father either led a coup, or permitted a coup to take place against the King Jungjong, and was killed.\nBecause this incident meant she was the daughter of a traitor, the Queen was deposed and expelled from the palace. When Yun Myung-hye (known as Queen Janggyeong) who was Jungjong's second queen consort died in 1515, Deposed Queen Sin's supporters tried to suggest her reinstatement, but highly-placed officials were against the idea - one of her main supporters was poisoned and another exiled.\nDeposed Queen Sin received help from Jungjong's successor, King Injong, to make her life better.\nOn 27 December 1557, in the 12th year of King Myeongjong's reign, she died without issue. The king held a portrait of Lady Sin at the funeral ceremony and she was buried in a family tomb according to the wishes of her parents. Her tomb was named Onneung.\nShe continued to be addressed as Deposed Queen Sin until 230 years later, when in 1739 King Yeongjo formally and posthumously honoured her as Queen Tan'gyŏng, as well as giving her father, her mother and her father's first wife royal titles.\nFamily\nParent\n* Father − Sin Sugŭn (; 1450–1506)\n* Mother − Han Eun-gwang, Internal Princess Consort Cheongwon of the Cheongju Han clan (; 1459–1523); Sin Sugŭn's second wife\n* Stepmother − Internal Princess Consort Yŏngga of the Andong Kwon clan (; 1448–?)\nSibling\n* Older sister - Lady Sin of the Geochang Shin clan (; 1483–?)\n* Older brother − Sin Hongbo (; 1483–?)\n* Older brother − Sin Hongp'il (; 1484–1541)\n* Older brother - Sin Hongdu (; 1486–?)\n* Younger sister - Lady Sin of the Geochang Shin clan (; 1489–?)\n* Younger brother − Sin Hongu (; 1489–?)\n* Younger brother − Sin Hongjo (; 1490–1561)\nConsort\n* Yi Yeok, King Jungjong (16 April 1488 – 29 November 1544)—No issue.\nIn popular culture\n* Portrayed by Kim Hee-jung in the 2001 SBS TV series Ladies in the Palace.\n*Portrayed by Yoon Suk-hwa in the 2017 SBS TV series Saimdang, Memoir of Colors.\n*Portrayed by Park Si-eun and Park Min-young in the 2017 KBS2 TV series Queen for Seven Days.\nReferences\nExternal links\n*\n}}\n}}"
    }
  ]
}