{
  "content": [
    {
      "type": "text",
      "text": "# Queensland Soldiers' Comforts Fund\n\n'''Queensland Soldiers' Comforts Fund''', a working subdivision of the Australian Comforts Fund, was established during World War I. The purpose of the Fund was to provide comforts to soldiers on active service. This was achieved via appeals for donations, public subscriptions, and organising fundraising activities. Numerous branches of the Queensland Soldiers' Comforts Fund were spread throughout Queensland,  Australia during this period.\nFormation\nat the opening of the Red Cross Fete at Junction Park School, Annerley, Brisbane, 1916]]\nQueensland Soldiers' Comforts Fund was inaugurated at a public meeting convened by the Mayoress of Brisbane on 21 September 1915. A committee for the fund was formed with Lady Elsie Goold-Adams, wife of the Governor of Queensland Sir Hamilton John Goold-Adams, elected as patroness, and Lady Cowley, wife of former politician Sir Alfred Cowley, appointed president. Premises for the operation of the Queensland Soldiers' Comforts Fund was secured at Panbury House in Eagle Street, Brisbane.\nComfort packages\nOne of the committee's first activities was to appeal for public donations of various items that could be dispatched to soldiers overseas in time for Christmas. Accepted items included shirts, undershirts with short sleeves, mufflers, balaclava caps, handkerchiefs, writing pads, envelopes, pencils, pipes, tobacco, cigarettes, bootlaces, toothbrushes, toothpaste, soap, Vaseline, sweets, coffee, games, books and magazines.\nBy the end of World War I, the Queensland Soldiers' Comfort Fund declared that since October 1915 they had packed and shipped 5,010 cases to soldiers overseas, which included 17,324 shirts and 37,983 pairs of socks.\nBranches\nQueensland Soldiers' Comforts Fund established a number of branches outside of their main Brisbane office. These included Ayr, Beaudesert, Beerwah, Benaraby, Bowen, Bundaberg, Caboolture, Calliope Valley, Charters Towers, Degilbo, Emu Creek, Eumundi, Goondiwindi, Ipswich, Isis Girls' Club, Kedron, Laidley, Lake Clarendon, Longreach, Many Peaks, Mapleton, Maroochy River, Maroon, Memerambi, Mitchell, Morven, Mount Morgan, Nambour, Nanango, Ormiston, Poona, Pialba, Sandgate, Tallebudgera, Townsville, Tiaro, Toogoolawah, Warra, Wattle Branch and Wynnum.\nFundraising initiatives\nQueensland Soldiers' Comfort Fund oversaw several fundraising operations.\nCoo-ee Cafe\nThe Coo-ee Cafe was a volunteer-run cafe initially situated in the basement of the Brisbane Club building in Adelaide Street, Brisbane, before moving to the ground floor. The cafe was in operation between 6 February 1917 and 23 November 1918. During this period over £7,600 (approximately 40 percent of profits made by the cafe) were contributed to various comforts funds.\nWar-time Kitchen\nWar-time Kitchen in Southport, Queensland was opened in September 1917 and operated by volunteers. The kitchen sold home-made cakes, sweets, jams and pickles. Seventy-five percent of profits made went towards the Queensland Soldiers' Comforts Fund, averaging £40 per month.\nJam Shop\nSituated in a shop in the Podmore and Hall building in Adelaide Street, Brisbane, the Jam Shop sold home-made jams and pickles to the public. The shop averaged £25 per month of profits for the Fund.\nRefreshment stall at the Brisbane Exhibition\nDuring the annual Brisbane Exhibition at the Exhibition Grounds in 1917 and 1918, the Queensland Soldiers' Comforts Fund maintained its own refreshment stall, selling sandwiches, fruit and soft drinks with proceeds going toward the Fund. The stall realized profits of £301 and £640 respectively.\nReferences\nFurther reading\n* ''[http://onesearch.slq.qld.gov.au/SLQ:SLQ_PCI_EBSCO:slq_alma21148644140002061 OM73-29, Queensland Soldiers' Comforts Fund Records], John Oxley Library, State Library of Queensland\n* [http://onesearch.slq.qld.gov.au/SLQ:SLQ_PCI_EBSCO:slq_alma21148412440002061 10004 Presentation Address to Marie Cowley 1919], John Oxley Library, State Library of Queensland\n* [http://onesearch.slq.qld.gov.au/SLQ:SLQ_PCI_EBSCO:slq_alma21132365860002061 Report of the work done by the Queensland Soldiers' Comforts Fund, 1915-1919]''. Brisbane: C.J. Walker. 1919"
    }
  ]
}