{
  "content": [
    {
      "type": "text",
      "text": "# Queen Mary's School\n\nQueen Mary School}}\n| motto        =\n| established  = 1925\n| closed       =\n| type         = Private day and boarding\n| religious_affiliation     = Church of England\n| president    =\n| head_label   = Head\n| head         = C. Cameron\n| r_head_label =\n| r_head       =\n| chair_label  = Chair of Governors\n| chair        = T. Fielden\n| founder      =\n| specialist   =\n| address       = Baldersby Park\n| city         = Topcliffe\n| county       = North Yorkshire\n| country      = England\n| postcode     = YO7 3BZ\n| local_authority          =\n| ofsted       =\n| urn          = 121725\n| dfeno        = 815/6000\n| staff        =\n| gender       = Girls\n| enrolment   = 270~\n| lower_age    = 3\n| upper_age    = 16\n| houses       = Byland, Fountains, Jervaulx, Rievaulx\n| colours      =\n| publication  =\n| free_label_1 = Affiliation\n| free_1       = Woodard Corporation\n| free_label_2 =\n| free_2       =\n| free_label_3 =\n| free_3       =\n| website      = http://www.queenmarys.org\n}}\n'''Queen Mary's School is a private day and boarding school for girls in Baldersby Park''' near Topcliffe, between Ripon and Thirsk in North Yorkshire, England. Established in 1925, the school is set on  of landscaped grounds and houses approximately 300 pupils. It caters to girls aged 3 to 16 and boys up to age 7. The school is a member of the Woodard Corporation and attended the 200th anniversary of the birth of the movement's founder in 2011. In 2015 the school celebrated its 90th anniversary.\nHistory\nIn 1925 the Woodard Corporation established a girls' preparatory boarding school in the mansion of Duncombe Park, near Helmsley. The number of pupils increased from 23 to 59 after one year and in 1931 the School of Duncombe Park was renamed Queen Mary's School. In 1979 a senior school was added to the preparatory school. In 1985 the lease on Duncombe Park expired and the school moved to Baldersby Park.\nBaldersby Park\nBaldersby Park, formerly known as Newby Park, covers an area of some 200 acres, which includes the site of the deserted medieval village of Newby-on-Swale. Baldersby Park House was built in the early 18th century by Sir William Robinson to the designs of Colen Campbell. It was the first villa built in England in the Palladian style.  In 1845 Lord de Grey sold Newby Park to the railway magnate George Hudson. Hudson rebuilt the house as Baldersby Park, providing it with a northern front in a Jacobethan style, retaining its Georgian south front. The interior was reconstructed after a fire in 1902.  It is now a Grade I listed building.\nThe house is built of stone with a Westmorland slate roof. It has two storeys, a square main block with a front of five bays, linked by wings to recessed three-bay pavilions. In the centre of the main block are four giant attached fluted Ionic columns carrying an entablature with a dentilled triangular pediment containing scrolled foliage, and deep eaves. There is a modillion eaves cornice, and a parapet with a balustrade. The doorway has pilasters, an entablature, and a radial fanlight with a moulded keystone. The windows are sashes, those on the ground floor with architraves and triangular pediments, and in the upper floor with eared and shouldered architraves. In the centre of the right return is a doorway with Ionic columns, and alternate rusticated and plain blocks, and a triangular pediment.\nSince 2010, Baldersby Park has been the location of the Deer Shed Festival, an annual music, arts and science festival attracting up to 10,000 paying attendees each year.\nHouses\nThere are four houses, which have regular inter-house competitions, including cross-country, drama, music and debating and general knowledge competitions. There are also regular 'house meetings' where senior girls fulfil their inter-house responsibilities.\nThe four houses, named after local abbeys are Byland (blue), Fountains (yellow), Jervaulx (green) and Rievaulx (red). Traditionally, sisters are in the same house, yet cousins are sometimes in different houses. All teachers are also assigned to houses and assist the senior girls by mentoring.\nMusic\nThe school is well known throughout North Yorkshire for its music especially its Chapel Choir which has released three CDs of music (Praise ye the Lord - 2000, Ave Maria - 2005 and The Turning Stars - 2013) and has contributed to local musicians' CDs such as Spanish guitarist Eduardo Niebla. They feature in his 2010 album 'My Gypsy Waltz'.\nOld Girls\nThe Queen Mary's Association (formerly known as the Duncombists) is the Old Girls Association for the school. In 2014 it was relaunched ahead of the schools 90th Birthday in 2015. To celebrate the 90th Anniversary the QMA is organizing a number of events including a return visit to Duncombe Park as well as a reunion at the school.\nSee also\n*Grade I listed buildings in North Yorkshire (district)\n*Listed buildings in Rainton with Newby\nReferences\nExternal links\n*\n*[http://www.isc.co.uk/schools/england/yorkshire-area-north/thirsk/queen-marys-school-thirsk Profile] on the ISC website"
    }
  ]
}