{
  "content": [
    {
      "type": "text",
      "text": "# Queen Elizabeth College, Mauritius\n\n}}\n| free_label              = Named after\n| free_text               = Queen Elizabeth II (1952)\n| website                 = http://qec.edu.govmu.org\n}}\nQueen Elizabeth College (QEC) is a, previously, all-girls, prestigious academic institution in Mauritius with high admission standards. As from 2021, it has now become a mixed school and accommodates girls and boys of age 15 to 18 years based on their academic performance at the National Certificate of Education (NCE) examinations. The school prepares its students for the O Level examinations, awarding the School Certificate; and the A Level examinations, awarding the Higher School Certificate.\nThe school is well known for having produced many female leaders at the national level as well as at the international level. The graduates have become female scholars, professionals, scientists, leaders and politicians amongst others.\nHistory\nBy late 40’s, there were two secondary schools for boys but there was an urgent need for a secondary school for girls. In 1950, the Government purchased a private house with nine acres of ground and turned it into a school at Vandermersch Street in Rose Hill. The school opened in 1951 and was located at a short distance from the main road. A small garden with endemic plants and palm trees offered a welcome green space during recreation.\nThe new compound inaugurated in 1953 and named after Queen Elizabeth II. Mrs. Betty Flashman assumed duty as the first headmistress in the same year. The building accommodated classrooms for science (physics, chemistry, and biology), and new subjects including art, cookery, needlework, and music. It was endowed with a library, a gymnasium, a swimming pool, and a large field for sports. The new facilities added up to ensure a complete and successful education for girls.\nAdmission to the college was based on top performance nationwide in 6th standard at primary level. There were twelve classrooms for students from Forms 1 to 5. At that time, sixth formers were few. They used the physics laboratory and the geography room as their classes. It was among the first schools to offer opportunity for girls to study a range of subjects including biology and physics. A system of Houses based on women models - Nightingale, Pankhurst, Fry and Curie – inculcated a sense of belonging as each house would add points for performance in both academic studies and in sports.\nThe headmistress was respected for her discipline and fairness. Dress codes were strictly imposed: only walking shoes were allowed, dangling earrings were banned, and uniforms had to reach the level of the knee. The headmistress would personally inspect case by case the performance and the choice of subjects of each student before promotion was granted to higher levels. A community of young girls from the Royal Navy used to group together during lunch.\nMrs Flashman left for UK in the early 60s, and was replaced temporarily by a number of headmistresses, namely Mrs Albert, Mrs Teckam and Ms. Bazire. Ms Kistoe took over for a longer time period before moving to the newly established Mauritius Institute of Education (MIE). She was replaced by Mrs Balgobin.   She renamed classes to be named after precious stones and gems instead of the traditional 'A, B, C, D', namely, Beryl, Garnet, Jade, and Onyx (later Pearl and Amber were added). She also changed the school badge to a metal material with a crown representation on it with the permission of Buckingham Palace. Mrs Cabon initiated the first Majorettes who gracefully gave performances during the national celebrations.\nOver the years, the school was visited by several dignitaries namely Princess Alexandra (1955), Mrs Indira Gandhi (1970), Prince Edward (1993) and Mrs Margaret Thatcher (1997). The school prides itself in producing well-educated citizens and laureates who pursue their studies in Mauritius and abroad and who serve Mauritius in various other capacities including professionals, diplomats and others in Mauritius and elsewhere.\nSee also\n* List of secondary schools in Mauritius\n* Education in Mauritius\nReferences\nExternal links\n*[http://qec.edu.govmu.org Queen Elizabeth College, Mauritius]\n*[http://www.gov.mu/portal/sites/mesweb/laureates.htm History of QEC laureates(2005-2009) on Government Portal of Mauritius.]\n*[http://www.lemauricien.org/wes/050218/ze.htm Article on Laureates year 2005]\n*[https://web.archive.org/web/20090208104148/http://www.islandcrisis.net/2009/02/mauritius-hsc-result-2008-2009-the-latest-details/ Article on Laureates year 2008]\n*[https://web.archive.org/web/20100211134136/http://www.lemauricien.com/mauricien/100208/ac.htm#1 Article on Laureates year 2009 by Le Mauricien Newspaper]\n*[https://web.archive.org/web/20100212170540/http://www.lematinal.com/education/3069-Des-laureats-2009-sexpriment.html Article on Laureates year 2009 by Le Matinal Newspaper]"
    }
  ]
}