{
  "content": [
    {
      "type": "text",
      "text": "# Queen of the Spiders\n\nQueen of the Spiders is an adventure module for the Dungeons & Dragons fantasy role-playing game.  It was published by TSR, Inc. in 1986 and is a compilation of seven previous related modules, often referred to as a \"supermodule.\"  Together, the seven adventures form an integrated campaign that begins in the World of Greyhawk, continues underground into the Underdark, and concludes in the Demonweb Pits, the abyssal lair of the demonic goddess Lolth.  The campaign was originally intended for use with the rules from the first edition of Advanced Dungeons & Dragons.\nThe 152-page supermodule bears the code \"GDQ1–7\" for \"Giants, Drow and Queen,\" and can be further combined with two other campaigns to form an even larger campaign.  The larger campaign begins with T1–4, The Temple of Elemental Evil, continues on to A1–4, Scourge of the Slave Lords, and concludes with GDQ1–7.\nPlot\nA new beginning was added to the adventure. Giants have been raiding civilized lands in increasing numbers.  The player characters have been called upon to combat the giants and to investigate the giants' reasons for invading and the strength of their forces.\nThe first module, Steading of the Hill Giant Chief, takes place in a gigantic wooden fort populated by hill giants and ogres. Here, the players uncover evidence of an alliance with other types of giants, as well as some mysterious letters from those behind the scenes.\nIn the second module, Glacial Rift of the Frost Giant Jarl, the action moves north to colder lands, where the setting is a system of caves clustered around a deep and narrow chasm in glacial ice. Here, the protagonists encounter frost giants, yeti and winter wolves, among other monsters.\nThe third module, Hall of the Fire Giant King, is set in a volcanic region where King Snurre has assembled a horde of fire giants, trolls and hell hounds. A secret passage from this module leads deep into the earth, where the adventurers discover the true nature of the force behind the raids – the drow in the service of Lolth, the demoness.\nThe fourth module, Descent into the Depths of the Earth, is on a larger scale than the others, with a map covering many kilometres of a deep underground region, later known as the Underdark. In the Underdark, there are many unique monsters previously unknown to surface adventurers, including the drow, which had been considered mythical. Troglodytes, jermlaine and svirfneblin (deep gnomes) made their first appearances in D&D literature in this module.\nIn the next module, Shrine of the Kuo-Toa, the adventurers explore a subterranean complex populated by the Kuo-toa, a race of fish-frog monsters in the service of the lobster goddess Blibdoolpoolp.\nPlayers next make their way to the Vault of the Drow, a deep subterranean eldritch land in a huge cyst deep under the earth.\nThe adventure is completed with Queen of the Demonweb Pits. It takes place primarily in the eponymous Demonweb Pits, the 66th level of the Abyss.\nPublication history\nThe seven adventures described above were compiled in the GDQ1–7 supermodule.  These included:\n* The three modules in the Against the Giants series: G1, Steading of the Hill Giant Chief; G2, Glacial Rift of the Frost Giant Jarl; and G3, Hall of the Fire Giant King\n* The three modules in the \"Drow\" series: D1–2, Descent into the Depths of the Earth (which incorporates the earlier D1, Descent into the Depths of the Earth and D2, Shrine of the Kuo-Toa); and D3, Vault of the Drow\n* Module Q1, Queen of the Demonweb Pits\nAll of the component modules were originally written by Gary Gygax, except for Queen of the Demonweb Pits, which was written by David C. Sutherland III and Gygax. The omnibus collection was produced with the assistance of Jeff Grubb and David Cook. The book was published by TSR in 1986 as a 128-page book with a 24-page map booklet, and credited to Gygax. Artist Keith Parkinson provided the cover art for the supermodule, which also features art by George Barr. The re-release was packaged as a sequel to A1–4.\nThe cover art of the module was also used for the AD&D Gold Box computer game Pools of Darkness.\nReception\nPeter Green reviewed Queen of the Spiders for White Dwarf #85. In his conclusion to the review, Green wrote that \"TSR have proven over the years that they are capable of better products than this. Instead of wasting time with old material, they should concentrate on presenting new roleplaying ideas.\"\nQueen of the Spiders was ranked as the single greatest Dungeons & Dragons adventure of all time by Dungeon magazine in 2004, on the 30th anniversary of the Dungeons & Dragons game.\nScott Taylor of Black Gate in 2015 rated the Queen of Spiders series as #1 in \"The Top 10 Campaign Adventure Module Series of All Time, saying \"I've played this series half a dozen times in my life, and each time it reinvents itself, becomes fresh and alive, and leaves me feeling like I've taken on the hosts of shadow and won a great victory for all the free peoples of the land. It is a true masterpiece, and that is all I really have to say about that.\"\nFrancesco Cacciatore for Polygon commented in 2025 that \"While it has its flaws, Queen of the Spiders is a fundamental piece of D&D history with an enduring legacy. You may love or hate Gygax and his style, but there is an undeniable feeling of fear and wonder here. Players start by carefully infiltrating and surviving giants' strongholds, leading to an epic bloodbath in G3. When they think it's all over, the Underdark opens up in front of them, an unexplored wilderness devoid of light and filled with creatures unseen at the time. And then, when they believe they can bull rush through everything, a whole city of hostile creatures appears, where the characters have to switch tactics to subterfuge and cunning.\"\nReviews\n*Coleção Dragon Slayer\nReferences\n*\nExternal links\n* [http://www.acaeum.com/ddindexes/modpages/super.html Supermodules] at Acaeum.com"
    }
  ]
}