{
  "content": [
    {
      "type": "text",
      "text": "# Queensland Korean War Memorial\n\n-->\n| unveiled = August 2011\n| coordinates =\n| location = Cascade Gardens, Gold Coast Highway,  Broadbeach, Queensland, Australia\n| nearest_town = Gold coast\n| designer = Screen Art & WJD Constructions\n| total_burials =\n| unknowns =\n| commemorated =\n| by_country =\n| by_war =\n| inscription =\n| embedded =\n| source =\n}}\nThe Queensland Korean War Memorial is situated at Cascade Gardens in Broadbeach, City of Gold Coast, Queensland, Australia.\nHistory\nThe Korean War commenced in 25 June 1950 and ended with an armistice signed 27 July 1953. It was a war between South Korea, supported by the United Nations, and communist North Korea, supported by the People's Republic of China and with military material aid from the Soviet Union. The war was a result of the physical division of Korea at the conclusion of World War II. The Australian Army, Navy and Air Force fought as part of the United Nations force. There were more than 1,500 Australian casualties including 339 who were killed. However, the impact on the civilian population was greater with an estimated half million South Koreans killed, while the number of those killed in North Korea is not known.\nThe memorial site was dedicated on 20 November 2010. Construction commenced in May 2011 and upon completion it was officially unveiled on 20 August 2011 by the Premier of Queensland Anna Bligh and Consul General Jin Soo Kim, Republic Of Korea.\nThe Queensland Korean War Memorial is a traditional story board about the Korean War and the veterans and families it honours. It was built jointly by the governments of the Republic Of Korea, the combined federal, state and regional Governments of Australia, Gold Coast CIty Council,  Department of Veterans' Affairs and Returned and Services League of Australia (RSL) with a project team made up of the Korean communities of southeast Queensland and the veterans themselves with help from the City of Gold Coast and RSL.\nOn 25 August 2014 the Queensland Korean War Memorial was officially declared a military memorial of national significance.\nSee also\n* Korean War Memorial, Canberra\n* List of Australian military memorials\nReferences\nExternal links\n* [http://www.koreanwarmemorial.com.au/ Queensland Korean War Memorial website]\n*"
    }
  ]
}