{
  "content": [
    {
      "type": "text",
      "text": "# Queen Victoria's Rifles__disambig_1\n\n|allegiance=\n|branch=23px Territorial Army\n|type=Infantry\n|role=\n|size=Battalion\n|command_structure=London Regiment\n|garrison=Davies Street drill hall (1890–1961)\n|garrison_label=\n|nickname=\n|motto=\n|colors=\n|colors_label=\n|march=\n|mascot=\n|equipment=\n|equipment_label=\n|battles=\n|anniversaries=\n|decorations=\n|battle_honours=\n|disbanded=\n|commander1=\n|commander1_label=\n|commander2=\n|commander2_label=\n|commander3=\n|commander3_label=\n|notable_commanders=\n|identification_symbol=\n|identification_symbol_label=}}\nThe '''9th (County of London) Battalion, London Regiment (Queen Victoria's Rifles)''' was a Territorial Army infantry battalion of the British Army. The London Regiment was formed in 1908 in order to regiment the various Volunteer Force battalions in the newly formed County of London, and the Queen Victoria's Rifles were one of twenty six units brought together in this way.\nHistory\nEarly history\nThe Queen Victoria’s Rifles could trace their origins back to the old volunteer regiments of the Napoleonic Wars when the '''Duke of Cumberland's Sharpshooters were formed as a Corps of Riflemen on 5 September 1803.\nThe regiment was raised as the 1st (Victoria Rifle Club) Middlesex Rifle Volunteer Corps and became the 1st Middlesex Rifle Volunteer Corps' on the formation of the Volunteer Force in 1860. One of the first officers of the Regiment was Captain Hans Busk - a key lobbyist in getting the Government to raise the Volunteer Force.\nBy 1892 the 1st Middlesex and 6th (St George's) Rifle Volunteer Corps were linked together with Headquarters at St John's Wood and Davies Street, near Berkeley Square, respectively. Both were also linked as Volunteer Battalions of the King's Royal Rifle Corps.\nTerritorial Force\nIn 1908 the Territorial and Reserve Forces Act came into effect and the new Territorial Force was created. At this time the regiment amalgamated with the 19th Middlesex (St Giles and St George’s, Bloomsbury) Volunteer Rifle Corps to form the 9th (County of London) Battalion, London Regiment (Queen Victoria's Rifles).\nFirst World War\nA 2/9th Battalion of the London Regiment was formed on the outbreak of war, with the existing battalion renamed 1/9th Battalion and landing at Le Havre in November 1914; they were attached to the 13th Brigade of the 5th Division.\n: Memorial to the Queen Victoria's Rifles ]]\nOn 17 April 1915, the 13th Brigade mounted an attack on Hill 60. The Hill was a small promontory on the edge of the Ypres Salient that afforded good views for the Germans across the British lines and in to Ypres. It was therefore of great tactical significance to both sides who \"fought with great gallantry\". Prior to the attack, the hill had been undermined for days with five galleries being driven under the German positions. The plan was to detonate large mines under the hill to destroy the enemy and their positions, then the 13th Brigade would occupy the area. The Hill was captured on 17 April, and on 20 April two and a half companies of the QVRs were ordered up to the front line as the enemy made a counter-attack. At dawn on 21 April the Germans began bombarding the QVRs with hand grenades. Casualties were heavy, including two officers, Major Lees and Lieutenant Summerhays who were killed. It was then that Lieutenant Geoffrey Harold Woolley left a position of safety to take command of the soldiers on the Hill. The situation quickly deteriorated, with many men and all the other officers on the hill being killed. Woolley refused verbal and written orders to withdraw, saying he and his company would remain until properly relieved. They repelled numerous attacks through the night. When they were relieved the next morning, he returned with 14 men remaining from the 150-strong company. For his gallantry Lieutenant Woolley was awarded the Victoria Cross, the first to be won by the Territorial Force.\nInter-war\nIn 1937, on the break-up of the London Regiment, the regiment was again linked with the King's Royal Rifle Corps and became the Queen Victoria's Rifles, The King's Royal Rifle Corps and converted to motor cycles.\nSecond World War\nAt the outbreak of the Second World War, 1/QVR was serving as part of the 1st London Division and was designated a motor-cycle reconnaissance battalion, armed with revolvers instead of rifles. In May 1940, the battalion was transferred to the 30th Infantry Brigade, under Brigadier Claude Nicholson, and was hurriedly sent across the English Channel, but, due to an error, their motor cycles and sidecars were left in England. Although understrength and ill-equipped, they fought in the desperate siege of Calais between 23 and 26 May, which bought valuable time for the British Expeditionary Force (BEF) to be evacuated from Dunkirk. Suffering very heavy losses, almost the entire force was either killed or captured and the battalion had to be reconstituted from scratch.\nAfter returning to the United Kingdom, in December, the battalion became part of the war-raised 27th Armoured Brigade, then serving under command of the 9th Armoured Division, and was designated as the 7th Battalion, King's Royal Rifle Corps on 1 April 1941.\nThe 2nd Battalion was, like 1/QVR, originally serving in a motorised reconnaissance role as part of the 2nd London Division, until, in December 1940, it was transferred to help create the 28th Armoured Brigade, then part of the 9th Armoured Division. The battalion was redesignated as the 8th Battalion, King's Royal Rifle Corps the following month.\nPostwar\nAfter the war, the Queen Victoria's Rifles was merged with the Queen's Westminsters to form the Queen's Royal Rifles on 1 May 1961.\nMemorials\nAs of 2018, 1/9th and 2/9th Battalions' First World War memorial and the Queen Victoria's Rifles Second World War memorial were both in store at an Army Reserve Centre at 405 Mile End Road in Bow.\nReferences\nSources\n*\nBibliography\n* Beckett, Ian F. W., (1982) Riflemen Form: A Study of the Rifle Volunteer Movement 1859–1908, Aldershot, The Ogilby Trusts, .\n* Keeson C. A. C. (1923) The History and Records of the Queen Victoria’s Rifles 1792- 1922. Constable and Company Ltd. London\n* [https://web.archive.org/web/20080123122453/http://www.regiments.org/regiments/uk/volmil-london/vinf/L09QVR.htm QVR at www.regiments.org]"
    }
  ]
}