{
  "content": [
    {
      "type": "text",
      "text": "# Queensferry, Flintshire\n\n| population                  = 2,109\n| population_ref              = (2011)\n| website                     = [https://queensferrycommunitycouncil.gov.uk/ Council website]\n| module= Map of the community\n}}\nQueensferry (, sometimes  or ) is a town and community in Flintshire, Wales, lying on the River Dee near the border. The community includes the village of Sandycroft. It is between Connah's Quay, Shotton and Saltney Ferry. Queensferry is also part of the wider Deeside conurbation.\nDescription\nIts name derives from the ferries that crossed the River Dee. The settlement of Higher Ferry () is now known as Saltney, while Queensferry was named Lower Ferry (). The town's name was changed to Kingsferry on the coronation of King George IV of the United Kingdom in 1820, and became Queensferry on the coronation of Queen Victoria in 1837.\non the North Wales Coast Line]]\nQueensferry lies along the B5441 and B5129 roads, and is bypassed by the A494 dual carriageway.  It is contiguous with Deeside. Queensferry is considered part of Deeside, which lends its name to many of Queensferry's features, including the Deeside Leisure Centre, a sports and leisure venue that also hosts music concerts.\nThe town has a Memorial Institute rather than a cenotaph type of war memorial. It is a corrugated black and white building near the entrance to Asda from the coast road. The Jubilee Bridge, also known as the Blue Bridge, spans the River Dee. It is a double leaf rolling bascule bridge. The railway station served the town on the North Wales Coast Line between 1864 and 1966.\nGovernance\nQueensferry is a ward and elects one county councillor to Flintshire County Council.\nNotable people\n* Reg Spencer (1908–1981) footballer with 235 caps with Tranmere Rovers F.C.\n* T. G. Jones (1917–2004) footballer with 178 caps for Everton F.C. and 17 for Wales\n* Grenville Millington (born 1951) former football goalkeeper with 288 caps with Chester City F.C.\n* Kevin Ratcliffe (born 1960 in Mancot) footballer with 359 caps with Everton F.C. and 59 with Wales\n* Beverley Jones (born 1974) paralympian athlete\nReferences\nExternal links\n*\n*[https://www.bbc.co.uk/news/wales/north_east_wales BBC Wales - Connah's Quay, Shotton & Queensferry website]\n*[https://www.geograph.org.uk/search.php?i=659 Photos of Queensferry and surrounding area on geograph.org.uk]"
    }
  ]
}