{
  "content": [
    {
      "type": "text",
      "text": "# Queens West\n\nQueens West is a district and redevelopment project along the East River in Long Island City, Queens, New York City. The project, located on Hunter's Point south of the Anable Basin, is a joint project sponsored by the Port Authority of New York & New Jersey (PANYNJ) and the Empire State Development Corporation (ESD). The Queens West Development Corporation (QWDC), a subsidiary of ESD, was established in 1992 to facilitate implementation of the approved development plan.\nHistory\nThe project on  was first announced in 1983 when the Port Authority of New York and New Jersey announced a new development along Long Island City's underused industrial waterfront, much of it brownfield land. There were no specific proposals, but one plan would include 11 residential buildings with about 4,500 units on , as well as  of state park land, a public library, two public schools, and  of retail space.\nLegislation authorizing the development was passed in 1983 or 1984, but delays arose due to the need to purchase land from several owners, as well as the fact that roughly a quarter of the proposed development was underwater. The Empire State Development Corporation joined the project in 1989, by which time the Port Authority had only purchased about a third of the necessary land. The proposals for the Long Island City waterfront development changed during the planning process. By 1990, when the project was sent to the New York City government for review, the development was slated to contain 6,300 apartments, a hotel, office space, and a school spread across 15 buildings, as well as  of open space. About 80% of the space would be residential, and the rest would be commercial.\n]]\nThe Queens West master plan ultimately called for three office towers, a hotel, apartments, and  of waterfront space, which were to be developed incrementally. The project officially began construction in with the start of Hunters Point Community Park. The park was constructed first partially because developers wanted to convince the U.S. Department of Housing and Urban Development to provide funding for the first apartment buildings, and HUD would only provide that funding if amenities were guaranteed for the apartments. Gantry Plaza State Park first opened in May 1998 and was expanded in July 2009. The Pepsi-Cola sign in Gantry Plaza State Park was made a New York City designated landmark in April 2016. Queens West is home to the Hunter's Point Community Library.\nIn May 2009,  were transferred to the New York City Economic Development Corporation (NYCEDC) for construction of the development renamed Hunter's Point South. It was completed in 2014 with 5,000 residential units, an 11-acre park, and 96,000 square feet of retail space and 46,000 square feet of public and community facilities.\nIn November 2018, Amazon.com announced that it was going to construct one of two campuses for its proposed Amazon HQ2 on the Long Island City waterfront, near Queens West. The campus would have 25,000 workers. However, in February 2019, Amazon announced it would withdraw its plans to build the HQ2 location in Queens West due to community opposition.\nTransportation\nThe district lies west of the Long Island City station, served by the Long Island Rail Road, and the Vernon Boulevard–Jackson Avenue station, served by the New York City Subway's . The district also contains the Long Island City ferry stop, which is served by NYC Ferry's Astoria route.\nReferences\nExternal links\n*\n*[https://www.nycedc.com/sites/default/files/filemanager/Projects/Hunters_Point_South/HPS_Presentation_June2009.pdf NYCEDC Hunters_Point_South]\n*\n*\n*\n*https://web.archive.org/web/20160320124931/http://www.abbnyc.com/pdfs/queens_west.pdf\n*http://www1.nyc.gov/assets/planning/download/pdf/plans/transportation/qern_fullb.pdf\n*http://bushwickdaily.com/bushwick/categories/sponsored/836-lic-for-brooklynites-where-to-live-in-hunters-point-queens-plaza-court-square-and-dutch-kills"
    }
  ]
}