{
  "content": [
    {
      "type": "text",
      "text": "# Queens Vietnam Veterans Memorial\n\n| area            =\n| established     = December 20, 2019\n| visitation_num  =\n| visitation_year =\n| governing_body  =\n}}\nThe Queens Vietnam Veterans Memorial is a memorial at Elmhurst Park in Elmhurst, Queens, New York City in honor of the veterans of the Vietnam War of 1955–1975. It was designed by Landscape Architects Denise Mattes and Frank Varro, and fabricated by Sprung Monuments, Corinthian Cast Stone Inc., and Barre Granite Association Inc.\nLocated at the northeastern corner of Elmhurst Park, it was announced in June 2017. Although planning and fundraising started in the mid-2000s, construction began on November 29, 2018, with $2.3 million in funding from the Queens Borough Council. The memorial was dedicated on December 20, 2019.\nDesign\nThe Memorial is a slightly sunken elliptical space framed by two Barre Gray Granite walls. One wall contains the names of the 371 Queens residents who died in the Vietnam War, with their ages at their death. Under the names is a timeline of the war, describing some of the major events from May 7, 1954, to April 30, 1975. There is then a short statement honoring those veterans who have lost their lives after the war due to things ranging from PTSD to Agent Orange exposure side effects. It also honors Pat Toro, a veteran who advocated for the memorial but died prior to its construction. The opposite granite wall has a drawing of Bamboo etched in its surface, with a bench where visitors can sit and view the names and history. The outside face of the wall is engraved with the name of the memorial, a dedication to all Vietnam Veterans, an engraving of the Vietnam Service Medal, and the Service Marks for the Army, Navy, Marines, Air Force and Coast Guard. The faces of the wall with the title and the names and history are lit, as is a flag pole. In the center of the elliptical space is a granite map showing the area around Vietnam, with several places mentioned in the historical text marked as well. The vertical seam running through Vietnam on the map marks the longitudinal great circle that the memorial lies on. The plantings around the memorial were selected to provide color throughout the year, with a focus on the fall colors of Green, Yellow, and Red, the colors of the Vietnam Service Medal Ribbon, around Veterans Day.\nHistory\n]]\nThe Memorial was donated by Borough President Melinda Katz after securing funding. She, along with the New York City Parks Department, Queens veterans, various elected officials, and community leaders broke ground for its construction. It was the first memorial to honor all Queens residents who served in the Vietnam War and were killed in action, or listed as \"Missing in Action.\" {resent at the groundbreaking ceremony also included State Senators Joseph Addabbo Jr. and Toby Ann Stavisky, State Assemblymembers Brian Barnwell and Michael DenDekker, City Councilmember Robert Holden and then-State Senator-elect John Liu. The site is within Elmhurst Park, which opened in 2011.\nVandalism\nOn June 2, 2021, the Memorial was vandalized with graffiti. The graffiti included negative references to God, \"fallen souls\", and “baby killers,” as well as a swastika over a 110, presumably for the 110th Police Precinct.\nReferences"
    }
  ]
}