{
  "content": [
    {
      "type": "text",
      "text": "# Queen's Building\n\nQueens Building}}\n'''Queen's Building''' () was a late 19th-century neoclassical building located in Central, Hong Kong.  Named after Queen Victoria, it was situated to the west of Statue Square on Hong Kong Island's waterfront with Victoria Harbour at the time.  It was demolished in 1962 and replaced with the Mandarin Oriental, Hong Kong.\nHistory\nIn the 1880s, the colonial government of Hong Kong initiated the Praya Reclamation Scheme to expand the amount of land available in the city.  However, the project soon ran into difficulties; it almost went bankrupt in 1893 when finances ran low and inclement weather from typhoons delayed the reclamation.  Despite these challenges, the project was finished in 1904, costing more than $3 million.  It added a total of  of land and shifted Hong Kong Island's harbour front from Des Voeux Road to Connaught Road.  Half of this new land was set aside constructing new buildings, with the other half utilised for thoroughfares and public spaces.  Queen's Building was one of the new structures conceived under this plan and its construction began at around the same time that the reclamation scheme was being carried out. Hong Kong architectural firm Leigh & Orange were commissioned to be the architects and in 1899, the construction was completed. It was one of two arcaded Victorian structures that flanked Statue Square (the old Hong Kong Club Building being the other).\nQueen's Building was viewed as one of the finest examples of Neoclassical architecture in Hong Kong, so much so that it was labelled \"the city's most prestigious commercial building\" when it opened.  It was four storeys high and featured porticos, balconies and arches, topped off with a small cupola. It primarily housed shipping, insurance and trading corporations from Europe, and the entrance of Queen's Building became a popular stop for rickshaws and sedan chairs.\nBy the 1960s, Hong Kong saw an increase in modern commercial development.  As a result, Queen's Building was demolished in 1962, with an office building planned as its replacement.  However, this did not come to fruition, and the Mandarin Oriental, Hong Kong was constructed on the site instead, opening in October 1963.\nSee also\n* Prince's Building\n* King's Building\n* List of lost buildings and structures in Hong Kong\nReferences\nFootnotes\nBibliography\n*"
    }
  ]
}