{
  "content": [
    {
      "type": "text",
      "text": "# Queen Camilla\n\n}}\n| reign = 8 September 2022 – present\n| cor-type = Coronation\n| coronation = 6 May 2023\n| birth_name = Camilla Rosemary Shand\n| birth_date =\n| birth_place = King's College Hospital, London, England\n| spouses =\n*\n}}\n| issue =\n| house = Windsor (by marriage)\n| father = Bruce Shand\n| mother = Rosalind Cubitt\n| signature = File:Camillarsignature.svg\n| module =\n}}\n}}\nCamilla (born Camilla Rosemary Shand, later Parker Bowles, 17 July 1947) is Queen of the United Kingdom and 14 other Commonwealth realms as the wife of King Charles&nbsp;III., Papua New Guinea, Saint Kitts and Nevis, Saint Lucia, Saint Vincent and the Grenadines, the Solomon Islands, and Tuvalu.|name=realms}}\nCamilla was raised in East Sussex and South Kensington in England and educated in England, Switzerland and France. In 1973, she married British Army officer Andrew Parker Bowles; they divorced in 1995. Camilla and Charles were romantically involved periodically, both before and during each of their first marriages. Their relationship was highly publicised in the media and attracted worldwide scrutiny. In 2005, Camilla married Charles in the Windsor Guildhall, which was followed by a televised Anglican blessing at St George's Chapel in Windsor Castle. From their marriage until Charles's accession, she was known as the Duchess of Cornwall. On 8 September 2022, Charles became king upon the death of his mother, Queen Elizabeth II, with Camilla as queen consort. Charles and Camilla's coronation took place at Westminster Abbey on 6 May 2023.\nCamilla carries out public engagements representing the monarch and is the patron of numerous charities and organisations. Since 1994, she has campaigned to raise awareness of osteoporosis, which has earned her several honours and awards. She has also campaigned to raise awareness of issues such as rape, sexual abuse, illiteracy, animal welfare and poverty.\nEarly life and education\nCamilla Rosemary Shand was born on 17 July 1947 at King's College Hospital, London. Her family split their time between their 18th-century country house—The Laines in Plumpton, East Sussex—and their London house in South Kensington. Her parents were British Army officer-turned-businessman Major Bruce Shand and his wife, Rosalind, daughter of Roland Cubitt, 3rd Baron Ashcombe. Camilla has a younger sister, Annabel Elliot, and had a younger brother, Mark Shand. One of her maternal great-grandmothers, Alice Keppel, was a mistress of King Edward VII.\nRosalind was a charity worker who during the 1960s and 1970s volunteered at the Chailey Heritage Foundation (which helps young children with disabilities) near their Sussex home. Bruce had various business interests after retiring from the army. He was most notably a partner in Block, Grey and Block, a firm of wine merchants in South Audley Street, Mayfair, later joining Ellis, Son and Vidler of Hastings and London.\nOn 1 November 1947, Shand was baptised at St. Peter's Church, Firle, East Sussex.\nDuring her childhood, Shand became an avid reader through the influence of her father, who read to her frequently. She grew up with dogs and cats, and, at a young age, learnt how to ride by joining Pony Club camps, going on to win rosettes at community gymkhanas. According to her, childhood \"was perfect in every way\". Biographer Gyles Brandreth describes her background and childhood:\n}}\nWhen she was five, Shand was sent to Dumbrells, a co-educational school in Ditchling village. From the age of 10, she attended Queen's Gate School near her London home. Her classmates at Queen's Gate knew her as \"Milla\"; her fellow pupils included the singer Twinkle (Lynn Ripley), who described her as a girl of \"inner strength\" exuding \"magnetism and confidence\". One of the teachers at the school, the writer Penelope Fitzgerald, who taught French, remembered Shand as \"bright and lively\". Shand left Queen's Gate with one O-level in 1964; her parents did not make her stay long enough for A-levels. Aged 16, she attended the Mont Fertile finishing school in Tolochenaz, Switzerland. After completing her course there, she studied French and French literature at the British Institute in Paris for six months.\nOn 25 March 1965, Shand was a debutante in London, one of 311 that year. After moving from home, she shared a small flat in Kensington with her friend Jane Wyndham, niece of decorator Nancy Lancaster. She later moved into a larger flat in Belgravia, which she shared with her landlady Lady Moyra Campbell, the daughter of the 4th Duke of Abercorn, and later with Virginia Carington, daughter of the 6th Baron Carrington. Virginia was married to Shand's uncle Lord Ashcombe from 1973 until 1979, and in 2005 became a special aide to Camilla and Charles. Shand worked as a secretary for a variety of firms in the West End, and as a receptionist for the decorating firm Sibyl Colefax & John Fowler in Mayfair. She was reportedly fired from the job after \"she came in late, having been to a dance\".\nShand continued to ride, and frequently attended equestrian activities. She also had a passion for painting, which eventually led to her private tutoring with an artist, although most of her work \"ended up in the bin\". Other interests were fishing, horticulture and gardening.\nMarriages and children\nFirst marriage\nIn the late 1960s, Shand met Andrew Parker Bowles, then a Guards officera lieutenant in the Blues and Royals – through his younger brother, Simon, who worked for her father's wine firm in Mayfair. After an on-and-off relationship for years, Parker Bowles and Shand's engagement was announced in The Times in 1973. Sally Bedell Smith wrote that the announcement was sent out by the pair's parents without their knowledge, which forced Parker Bowles to propose. They married on 4 July 1973 in a Catholic ceremony at the Guards' Chapel, Wellington Barracks, in London. Shand was 25 years old and Parker Bowles 33. Her wedding dress was designed by British fashion house Bellville Sassoon, and the bridesmaids included Parker Bowles's goddaughter Lady Emma Herbert. It was considered the \"society wedding of the year\" with 800 guests. Royal guests present at the ceremony and reception included Queen Elizabeth II's daughter, Anne; the Queen's sister, Margaret; and Queen Elizabeth The Queen Mother.\nin Allington, Wiltshire]]\nThe couple made their home in Wiltshire, purchasing Bolehyde Manor in Allington and later Middlewick House in Corsham. They had two children: Tom (born 1974) and Laura (born 1978). Tom is a godson of King Charles III. Both children were brought up in their father's Catholic faith, particularly during the lifetime of their paternal grandmother, Ann Parker Bowles; Camilla remained an Anglican and did not convert to Catholicism. Laura attended a Catholic girls' school, but married in an Anglican church; Tom did not attend Ampleforth College as his father had, but Eton—and was married outside the Catholic Church. Tom, like his father, is in remainder to the Earldom of Macclesfield.\nIn December 1994, after 21 years of marriage, the couple issued divorce proceedings on the grounds they had been living separately for years. In July of that year, Camilla's mother, Rosalind, had died from osteoporosis, and her father later described this as a \"difficult time for her\". Their petition was heard and granted in January 1995 at the High Court Family Division in London. The divorce was finalised on 3 March 1995. A year later, Andrew married Rosemary Pitman (who died in 2010).\nRelationship with Charles\nShand reportedly met Prince Charles in mid-1971. Andrew Parker Bowles had ended his relationship with Shand in 1970 and was courting Princess Anne. Though Shand and Charles belonged to the same social circle and occasionally attended the same events, they had not formally met. Gyles Brandreth states that they did not first meet at a polo match, as has been commonly believed. Instead, they first met at the home of their friend Lucía Santa Cruz, who formally introduced them. They became close friends and eventually began a romantic relationship, which was well known within their social circle. As a couple, they regularly met at polo matches at Smith's Lawn in Windsor Great Park, where Charles often played polo. They also became part of a set at Annabel's in Berkeley Square. As the relationship grew more serious, Charles met Shand's family in Plumpton, and he introduced her to some members of his family. The relationship was put on hold after Charles travelled overseas to join the Royal Navy in early 1973, and ended abruptly afterward.\nThere have been different explanations for why the relationship ended. Robert Lacey wrote in his 2008 book Royal: Her Majesty Queen Elizabeth II that Charles met Shand too early, and he had not asked her to wait for him when he went overseas for military duties. Sarah Bradford wrote in her 2007 book Diana that a member of the close circle of his great-uncle Lord Mountbatten said Mountbatten arranged for Charles to be taken overseas to end the relationship with Shand, to make way for an engagement between Charles and his granddaughter Amanda Knatchbull. Some sources suggest Queen Elizabeth The Queen Mother did not approve of Shand because she wanted Charles to marry one of the Spencer family granddaughters of her close friend Lady Fermoy. Other sources suggest Shand did not want to marry Charles but instead Andrew Parker Bowles, having had an on-and-off relationship with him since the late 1960s—or that Charles had decided he would not marry until he was 30.\nThe majority of royal biographers agree that Charles would not have been allowed to marry Shand had he sought permission to do so. According to Charles's cousin and godmother Patricia Knatchbull, 2nd Countess Mountbatten of Burma, some palace courtiers at that time deemed Shand unsuitable as a prospective consort. In 2005, she stated, \"With hindsight, you can say that Charles should have married Camilla when he first had the chance. They were ideally suited, we know that now. But it wasn't possible.\"[...] \"it wouldn't have been possible, not then.\" Nevertheless, they remained friends. In August 1979, Lord Mountbatten was assassinated by the Provisional Irish Republican Army. Charles was grief-stricken by his death, and reportedly relied heavily on Camilla Parker Bowles for solace. During this period, rumours began circulating, among close friends of the Parker Bowleses and in polo-playing communities, that Camilla and Charles had rekindled their intimate relationship. A source close to Parker Bowles confirmed that by 1980 they had indeed rekindled as lovers. Royal staff have also said that it occurred earlier. Parker Bowles's husband, Andrew, reportedly approved of the affair, while he had numerous lovers throughout their marriage. According to the BBC, Camilla was the official escort to the Prince during the Zimbabwean independence celebrations in 1980. Nevertheless, Charles soon began a relationship with Lady Diana Spencer, whom he married in 1981.\nThe affair became public knowledge in the press a decade later, with the publication of Diana: Her True Story in 1992, followed by the \"Tampongate\" (also known as \"Camillagate\") tape scandal in 1993, when an intimate telephone conversation between Parker Bowles and Charles was secretly recorded, and the transcripts were published in the tabloid press. The book and tape immediately damaged Charles's public image, and the media vilified Parker Bowles. In 1994, Charles finally spoke about his relationship with Parker Bowles in Charles: The Private Man, the Public Role with Jonathan Dimbleby. He told Dimbleby in the interview, \"Mrs. Parker Bowles is a great friend of mine... a friend for a very long time. She will continue to be a friend for a very long time.\" He later admitted in the interview that their relationship was rekindled after his marriage had \"irretrievably broken down\" in 1986.\nImage rehabilitation\nFollowing both of their divorces, Charles declared his relationship with Parker Bowles was \"non-negotiable\". Charles was aware that the relationship was receiving a lot of negative publicity, and appointed Mark Bolland—whom he had employed in 1995 to refurbish his own imageto enhance Parker Bowles's public profile. In July 1997, she was involved in a head-on car accident while driving to Highgrove House, though neither she nor the other driver sustained any major injuries. Parker Bowles occasionally became Charles's unofficial companion at events. In 1999, they made their first public appearance together at the Ritz London Hotel, where they attended a birthday party for her sister; about 200 photographers and reporters from around the world were there to witness them together. In 2000, she accompanied Charles to Scotland for a number of official engagements, and in 2001, she became president of the Royal Osteoporosis Society (ROS), which introduced her to the public.\nParker Bowles later met Queen Elizabeth II, for the first time since Parker Bowles and Charles's relationship was made public, at the 60th birthday party of the former Greek king Constantine II in 2000. This meeting was seen as an apparent seal of approval by the Queen on her son's relationship with Parker Bowles. After a series of appearances at public and private venues, the Queen invited Parker Bowles to her Golden Jubilee celebrations in 2002. She sat in the royal box behind the Queen for one of the concerts at Buckingham Palace. Charles reportedly paid privately for two full-time security staff for her protection. Although Parker Bowles maintained her residence, Ray Mill House, which she purchased in 1995, near Lacock in Wiltshire, she then moved into Clarence House, Charles's household and official residence since 2003. In 2004, she accompanied Charles on almost all of his official events, including a high-profile visit together to the annual highland games in Scotland. The media speculated on when they would announce their engagement, and as time went by, polls conducted in the United Kingdom showed overall support for the marriage.\nDespite this image rehabilitation, Parker Bowles received backlash from supporters of Diana who wrote to national newspapers to air their views, especially after Parker Bowles and Charles's wedding plans were announced. This sentiment was later parodied by internet trolls on Facebook and TikTok through fake fanpages and accounts dedicated to Diana. In 2023, The Independent named Camilla the most influential woman of 2023 in its \"Influence List\" and her name appeared on the list again in 2024 and 2025.\nSecond marriage\nOn 10 February 2005, Clarence House publicised the engagement of Camilla Parker Bowles and the Prince of Wales. As an engagement ring, Charles gave Parker Bowles a diamond ring believed to have been given to his grandmother when she gave birth to Charles's mother. The ring comprised a square-cut diamond with three diamond baguettes on each side. As the future supreme governor of the Church of England, the prospect of Charles marrying a divorcée was seen as controversial, but with the consent of the Queen, the government, and the Church of England, the couple were able to wed. The Queen and Tony Blair, along with Archbishop of Canterbury Rowan Williams, offered their best wishes in statements to the media. In the two months following the announcement of their engagement, Clarence House received 25,000 letters with \"95 or 99 per cent being supportive\"; 908 hate mail letters were also received, with the more threatening and personal ones sent to the police for investigation.\nThe marriage was to have been on 8 April 2005, in a civil ceremony at Windsor Castle, with a subsequent religious service of blessing at St George's Chapel. However, to conduct a civil marriage at Windsor Castle would oblige the venue to obtain a licence for civil marriages, which it did not have. A condition of such a licence is that the licensed venue must be available for a period of one year to anyone wishing to be married there, and as the royal family did not wish to make Windsor Castle available to the public for civil marriages, the venue was changed to the town hall at Windsor Guildhall. On 4 April, the marriage was delayed by one day to allow the Prince of Wales and some of the invited dignitaries to attend the funeral of Pope John Paul II.\nOn 9 April 2005, the marriage ceremony was held. The parents of Charles and Camilla did not attend; instead, Camilla's son Tom and Charles's son Prince William acted as witnesses to the union. The Queen and the Duke of Edinburgh did attend the service of blessing. Afterwards, the Queen held a reception for the newlyweds at Windsor Castle. Performers included the St George's Chapel Choir, the Philharmonia Orchestra, and Welsh composer Alun Hoddinott. As a wedding gift, The Marinsky Theatre Trust in St. Petersburg brought a Belarusian mezzo-soprano singer, Ekaterina Semenchuk, to the United Kingdom to perform a special song for the couple. Following the wedding, the couple travelled to Charles's country home in Scotland, Birkhall, and carried out their first public duties together during their honeymoon.\nDuchess of Cornwall\nAfter becoming Duchess of Cornwall, Camilla automatically acquired rank as the second highest woman in the British order of precedence after Queen Elizabeth II, and as typically fifth or sixth in the orders of precedence of her other realms, following the Queen, the relevant viceroy, the Duke of Edinburgh, and the Prince of Wales. It was revealed that the Queen altered the royal order of precedence \"on blood principles\" for private occasions, placing the Duchess fourth, after the Queen, Princess Anne and Princess Alexandra. Within two years of the marriage, the Queen extended Camilla visible tokens of membership in the royal family: she lent Camilla the Greville Tiara, which previously belonged to the Queen Mother, and granted her the badge of the Royal Family Order of Elizabeth II.\nAfter their wedding, Clarence House, Charles's official residence, also became Camilla's. The couple also stay at Birkhall for holiday events, and Highgrove House in Gloucestershire for family gatherings. In 2008, they took up residence at Llwynywermod, Wales, where they stay on their visit to Wales every year in the summer and for other occasions. To spend time alone with her children and grandchildren, Camilla still maintains Ray Mill House, in which she resided from 1995 to 2003.\n, 2012]]\nAccording to an undated statement from Clarence House, Camilla used to be a smoker but has not smoked for many years. Though no details were publicly released, it was confirmed in March 2007 that she had undergone a hysterectomy. In April 2010, she fractured her left leg while hill walking in Scotland. In November 2010, Camilla and Charles were indirectly involved in student protests when their car was attacked by protesters. Clarence House later released a statement on the incident: \"A car carrying Prince Charles and the Duchess of Cornwall was attacked by protesters, but the couple were unharmed.\" In 2011, they were named as individuals whose confidential information was reportedly targeted or actually acquired in conjunction with the news media phone hacking scandal.\nOn 9 April 2012, Camilla and Charles's seventh wedding anniversary, the Queen appointed Camilla to the Royal Victorian Order. In 2015, Charles commissioned a pub to be named after Camilla, situated at Poundbury village. The pub opened in 2016 and is named the Duchess of Cornwall Inn. On 9 June 2016, the Queen appointed the Duchess as a member of the British Privy Council. On 1 January 2022, she made Camilla a Royal Lady of the Most Noble Order of the Garter. On 14 February 2022, Camilla tested positive for COVID-19, four days after Charles had also contracted it, and began self-isolating. She and Charles received their first doses of a COVID-19 vaccine in February 2021. She completed 3,886 engagements between 2005 and 2022.\nForeign and domestic trips\nCamilla's first solo engagement as Duchess of Cornwall was a visit to Southampton General Hospital; she attended the Trooping the Colour for the first time in June 2005, making her appearance on the balcony of Buckingham Palace afterwards. She made her inaugural overseas tour in November 2005, when she visited the United States, and met George W. and Laura Bush at the White House. Afterward, Camilla and Charles visited New Orleans to see the aftermath of Hurricane Katrina and met some of the residents whose lives were affected by the hurricane. In March 2006, the couple visited Egypt, Saudi Arabia and India. In 2007, Camilla conducted the naming ceremonies for HMS Astute and the new Cunard cruise ship, MS Queen Victoria. In November 2007, she toured with the Prince of Wales on a four-day visit to Turkey. In 2008, she and Charles toured the Caribbean, Japan, Brunei and Indonesia. In 2009, they toured Chile, Brazil, Ecuador, Italy and Germany. Their visit to the Holy See in Italy included a meeting with Pope Benedict XVI. They later visited Canada. In early 2010, they visited Hungary, the Czech Republic and Poland. Camilla was unable to carry out her engagements on their tour of Eastern Europe after developing a trapped nerve in her back. In October 2010, she accompanied Charles to Delhi, India, for the opening of the 2010 Commonwealth Games.\nin Cardiff, Wales, 7 June 2011]]\nIn March 2011, Camilla and Charles visited Portugal, Spain, and Morocco, visiting the heads of state of each country. In June 2011, the Duchess alone represented the British royal family at the 125th Wimbledon Tennis Championships. In August 2011, she accompanied Charles to Tottenham to visit the aftermath of the London riots. The couple later went to visit with Tottenham residents in February 2012, meeting with local shop owners six months after the riots to see how they were doing. In London on 11 September 2011, the Duchess attended the 10th anniversary memorial service of the 9/11 attacks, along with David Cameron and the Prince of Wales. In November 2011, Camilla travelled with Charles to tour the Commonwealth and Arab States of the Persian Gulf. They toured South Africa and Tanzania and met with those countries' respective presidents, Jacob Zuma and Jakaya Kikwete.\nIn March 2012, the couple visited Norway, Sweden and Denmark to mark Elizabeth II's Diamond Jubilee. In May 2012, they undertook a four-day trip to Canada as part of the jubilee celebrations. In November 2012, they visited Australia, New Zealand and Papua New Guinea for a two-week jubilee tour. During the Australian tour, they attended the 2012 Melbourne Cup, where Camilla presented the Melbourne cup to the winner of the race. In 2013, the couple went on a tour to Jordan, meeting with King Abdullah II and Queen Rania. They visited Syrian refugee camps of the civil war. Camilla attended the State Opening of Parliament for the first time in May 2013, and the same month, she travelled to Paris on her first solo trip outside the United Kingdom. That same year, she and Charles attended the inauguration of Willem-Alexander, King of the Netherlands, as well as the preceding celebrations in honour of the departing Queen Beatrix.\nIn June 2014, Camilla and Charles attended the 70th anniversary commemorations of D-Day in Normandy, France, and in November of that year, they embarked on a nine-day tour to Mexico and Colombia. In May 2015, they visited Northern Ireland and undertook their first joint trip to the Republic of Ireland. In April 2018, they toured Australia and attended the opening of the 2018 Commonwealth Games. They also toured the West African countries of The Gambia, Ghana and Nigeria in November 2018. In March 2019, Charles and Camilla went on an official tour to Cuba, making them the first British royalty to visit the country; the tour was part of offers to strengthen UK–Cuban ties. In January 2020, the Duchess, on behalf of the UK, attended commemorations in Poland to mark the 75th anniversary of the liberation of Auschwitz-Birkenau. In March 2021, the couple went on their first official foreign visit since the start of the COVID-19 pandemic and visited Greece at the invitation of the Greek government to celebrate the bicentennial of Greek independence. In March 2022, they visited the Republic of Ireland to commemorate Elizabeth II's Platinum Jubilee. In May 2022, the couple undertook a three-day trip to Canada as part of the jubilee celebrations.\nQueen consort\nCamilla became queen consort on 8 September 2022 upon her husband's accession as Charles III, following the death of Elizabeth II. In his first address to the nation, Charles paid tribute to his \"darling wife\" Camilla for \"the loving help and steadfast devotion to duty\". On 10 September, she attended the Accession Council where Charles was formally proclaimed king and she served as a witness together with her stepson William.\nFollowing the accession, Camilla announced that she was replacing the traditional role of lady-in-waiting with a new role of queen's companion, which would be a more occasional and less formal role, assisting her at official engagements but not in replying to letters or day-to-day planning. She appointed the Marchioness of Lansdowne, the Baroness Chisholm of Owlpen, Jane von Westenholz, Lady Sarah Keswick, Lady Brooke, Sarah Troughton, and her sister, Annabel, to the role.\nOn 13 February 2023, Buckingham Palace announced that Camilla had tested positive for COVID-19, which forced her to postpone a number of public  engagements.\nCamilla was crowned alongside Charles on 6 May 2023 at Westminster Abbey, London.\nOn 16 June 2023, Buckingham Palace announced that the King had appointed the Queen to the Order of the Thistle. On 5 July, she accompanied Charles to a national service of thanksgiving at St Giles' Cathedral where the Honours of Scotland were presented to him. In the same month, it was announced that unlike the previous consort, Prince Philip, Queen Camilla would not receive a Parliamentary annuity and her activities would be funded through the Sovereign Grant instead.\nanniversary in France, June 2024]]\nIn March 2023, Camilla accompanied Charles for a state visit to Germany, which was his first foreign visit as monarch. In September and October 2023, the King and Queen undertook state visits to France and Kenya, and in November, Camilla appeared at Charles's side at his first State Opening of Parliament as Sovereign.\nDue to the King's cancer diagnosis in 2024, the Queen deputised for him in his absence at the Commonwealth Day service at Westminster Abbey and at the Royal Maundy at Worcester Cathedral, making her the first consort to hand out the ceremonial coins at the latter event. In June, the King and Queen travelled to Normandy to attend the 80th anniversary commemorations of D-Day. In October, Camilla and Charles toured Australia and Samoa. In the following month she cancelled several of her public engagements due to a chest infection that was later revealed to be a form of pneumonia.\n, 2024]]\nDespite initially cancelling a planned Vatican visit, the King and Queen, while visiting Italy, made a surprise visit to the Vatican on 9 April 2025—their 20th wedding anniversary—to meet Pope Francis at Casa Santa Marta as Francis was recovering from pneumonia. Francis died 12 days later. In May 2025, Camilla accompanied Charles on a two-day visit to Canada. During the visit, she was sworn in as a member of the King's Privy Council for Canada. In July, the Queen was appointed Vice-Admiral of the United Kingdom, making her the first female to hold this title. In September, she was forced to withdraw from attending the Duchess of Kent's funeral due to acute sinusitis. In the following month, Camilla accompanied Charles on his historic state visit to the Holy See.\nCharity work\nPatronages\nThe Queen is the patron or president of more than 100 charities and organisations. Barnardo's, St Catherine's School, Bramley, Animal Care Trust, The Royal College of Podiatry, Battersea Dogs & Cats Home, British Forces Broadcasting Service, British Equestrian Federation, British Racing School, Dundurn Castle, New Queen's Hall Orchestra, St John's Smith Square, London Chamber Orchestra, Elmhurst School for Dance (now Elmhurst Ballet School), Trinity Hospice, Georgian Theatre Royal, Arthritis Research UK, The Girls' Friendly Society, Nuffield Orthopaedic Centre, Royal National Hospital for Rheumatic Diseases, Plumpton College Charitable Foundation, Children's Hospice South West, Elephant Family (joint president with the King), Garden Museum (joint patron with the King), Friends of the Royal Academy of Arts, Maggie's Cancer Caring Centres, Cornwall Air Ambulance Trust, Wiltshire Air Ambulance, and the P. G. Wodehouse Society of the Netherlands.}}\nShe is the honorary commodore-in-chief of the Royal Navy Medical Service. In this role, she visited the training-ship HMS Excellent in January 2012, to award medals to naval medical teams returning from service in Afghanistan. She is also an honorary member of other patronages and in February 2012, she was elected a bencher of Gray's Inn. In February 2013, she was appointed Chancellor of the University of Aberdeen, a role which is ceremonial and involves conferring graduates with their degrees. She took up the office in June 2013. She is the first female chancellor of the University of Aberdeen and the only member of the royal family to hold the post since it was created in 1860.\nIn 2015, Camilla's presidency of the Women of the World Festival, an annual festival that celebrates the achievements of women and girls as well as looking at the obstacles they face across the world, notably domestic violence, was announced. In 2018 and 2020, she became the vice-patron of the Royal Commonwealth Society and the Royal Academy of Dance, respectively, of which Queen Elizabeth II was a patron. In March 2022, as president of the Royal Voluntary Service, Camilla launched the organisation's Platinum Champions Awards to honour 70 volunteers nominated by the public for their efforts in improving lives in their communities. In the same month, the Queen made Camilla patron of London's National Theatre, a role previously held by Camilla's stepdaughter-in-law Meghan, Duchess of Sussex. In January 2024, Camilla became the first royal patron of the Anne Frank Trust UK.\nIn May 2024, after a major review of royal patronages and charity presidencies, Camilla took on 15 new patronages, including Army Benevolent Fund, Royal Academy of Dance, Royal Voluntary Service, Royal Literary Fund, Royal Foundation of St Katharine, and Queen's Nursing Institute.\nOsteoporosis\nIn 1994, Camilla became a member of the National Osteoporosis Society after her mother died from the disease that year. Her maternal grandmother also died from the disease in 1986. She became patron of the charity in 1997 and was appointed president in 2001 in a highly publicised event, accompanied by Charles. In 2002, she launched a mini book, A Skeleton Guide to a Healthy You, Vitamins and Minerals, which aims to help women protect themselves from the disease. The following month, she attended the Roundtable of International Women Leaders to Examine Barriers to Reimbursement for Diagnosis and Treatment of Osteoporosis conference along with 13 eminent women from around the world. The event was organised by the International Osteoporosis Foundation and hosted by Queen Rania of Jordan and during it, she made her first public speech. The international conference, which took place in Lisbon, Portugal, brought together worldwide public figures to focus on osteoporosis treatment and called for government assistance around the world. In 2004, she attended another conference in Dublin, organised by the Irish Osteoporosis Society. The following year, she visited the United States National Institutes of Health in Maryland to give a presentation on osteoporosis to high-profile health figures.\nwelcomes Charles and Camilla to the NIH for a discussion on osteoporosis with Surgeon General Richard Carmona and other health officials, November 2005.]]\nIn 2006, Camilla launched the Big Bone walk campaign, leading 90 children and people with osteoporosis for a 10-mile walk and climb around Loch Muick at the Balmoral Estate in Scotland to raise money for the charity. The campaign raised £200,000, and continues almost every year as one of the fundraisers for the charity. In 2011, she appeared in the BBC Radio drama The Archers, playing herself, to raise the profile of the disease, and in 2013 teamed up with the television series Strictly Come Dancing to raise funds for the National Osteoporosis Society. By 2006, she had spoken at more than 60 functions on the disease in the United Kingdom and around the world and had also opened bone scanning units and osteoporosis centres to help people with the disease. Almost every year, Camilla attends and partakes in World Osteoporosis Day, by attending events around the United Kingdom on 20 October. She continues to attend conferences around the world, and meets with health experts to further discuss the disease.\nFor her work on raising awareness of osteoporosis around the world, Camilla was honoured with an Ethel LeFrak award in 2005 from an American charity and received the Kohn Foundation Award in 2007 from the National Osteoporosis Society. In July 2007, Camilla opened the Duchess of Cornwall Centre for Osteoporosis at the Royal Cornwall Hospital, Truro. In the same year, King's College London awarded her an honorary fellowship for raising the profile of osteoporosis. In 2009, the National Osteoporosis Society created The Duchess of Cornwall's Award (later renamed The Queen's Award for Osteoporosis), which recognises achievements in the field of osteoporosis. In 2016, she received an honorary doctorate from the University of Southampton in recognition of her efforts in raising awareness about osteoporosis. In 2019, the National Osteoporosis Society was renamed as the Royal Osteoporosis Society.\nVictims of rape and sexual abuse\nAfter visiting nine rape crisis centres in 2009 and hearing accounts from survivors, Camilla began raising awareness and advocating ways to help victims of rape and sexual abuse to overcome and move past their trauma. She often speaks to victims at a rape crisis centre in Croydon and visits other centres to meet staff and victims, around the United Kingdom and during overseas tours. During a 2008 meeting with the then-mayor of London, Boris Johnson, Camilla recounted an incident from her teenage years when on a train to Paddington at 16 or 17, a man assaulted her—only for her to defend herself using her shoe and then report the man to authorities, leading to his arrest. In 2010, alongside Boris Johnson, she opened a centre in Ealing, West London, for rape victims. The centre later expanded to other areas including Hillingdon, Fulham, Hounslow, and Hammersmith. In 2011, Camilla opened the Oakwood Place Essex Sexual Assault Referral Centre at Brentwood Community Hospital in Essex. She is patron of the Wiltshire Bobby Van Trust, which provides home security for victims of crime and domestic abuse, and of SafeLives, a charity that campaigns against domestic abuse and violence.\nIn 2013, Camilla held a meeting at Clarence House which brought together rape victims and rape support groups. Director of Public Prosecutions Keir Starmer and Home Secretary Theresa May (both future prime ministers) were guests at the occasion. At the occasion, she introduced a plan to help the victims: about 750 wash-bags, created by her Clarence House staff and packed with luxury toiletries, were distributed to victims at the centres. Camilla thought of the gesture after she visited a centre in Derbyshire and asked victims what they would like to help them feel at ease after the trauma and forensic examinations. According to Clarence House, the event was the first meeting of high-profile figures to focus exclusively on rape and sexual abuse subjects. In the same year, Camilla travelled to Northern Ireland and opened The Rowan, a sexual assault and referral centre at Antrim Area Hospital which was the first centre to provide help and comfort to rape and sexual abuse victims in Northern Ireland. In March 2016, during a tour to the Western Balkans with her husband, Camilla visited UNICEF programmes in Montenegro and while there, she discussed child sexual abuse and was shown an exclusive preview of a new app designed to protect children from online sexual abuse. The following year, she partnered with retail and pharmacy chain Boots to create a line of wash-bags which will be given to sexual assault referral centres around the United Kingdom. As of 2024, it has donated more than 50,000 wash-bags filled with toiletries, which are offered at SARCs after a forensic examination.\nIn May 2020, Camilla supported SafeLives's 'Reach In' campaign, which encourages people to look out for people around them that might be suffering from domestic violence. In July 2020, she guest-edited The Emma Barnett Show on BBC Radio 5 Live, which featured conversations on domestic violence. In September 2021, Camilla was named as patron of the Mirabel Centre, Nigeria's first sexual assault referral centre. In October 2021, she gave a speech at the launch of Shameless, a project endorsed by the Women of the World Foundation and Birkbeck, University of London looking to educate people on sexual violence. She expressed her shock at the murder of Sarah Everard and urged both men and women to break down the \"culture of silence\" surrounding sexual assault.\nIn February 2022, the Duchess and Theresa May supported a campaign initiated by the NHS England to encourage survivors of sexual and domestic abuse to come forward for help. The campaign also highlighted the support offered at sexual assault referral centres (SARCs) in England. The campaign was released on the first day of Sexual Abuse and Sexual Violence Awareness Week. She also visited the Haven Paddington, a sexual assault referral centre in West London and Thames Valley Partnership, a charity for domestic abuse survivors in Aylesbury. In November 2022, Camilla hosted her first reception at Buckingham Palace after becoming queen to raise awareness of violence against women and girls during the UN's annual 16 Days of Activism against Gender-Based Violence campaign. She was joined by Sophie, Countess of Wessex, Queen Rania of Jordan, Queen Mathilde of Belgium, Crown Princess Mary of Denmark and the first lady of Ukraine, Olena Zelenska. Her work with survivors of domestic abuse and campaigners working to raise awareness on the issues was covered in the ITV documentary Her Majesty The Queen: Behind Closed Doors in November 2024.\nLiteracy\n, then headmaster of The Doon School which she visited in November 2013 on her India tour]]\nBeing an avid reader, Camilla is an advocate for literacy. She is the patron of the National Literacy Trust and other literacy charities. She often visits schools, libraries and children's organisations to read to young children. Additionally, she partakes in literacy celebrations, including International Literacy Day and World Book Day. In 2011, she donated money to support the Evening Standards literacy campaign, and replaced the Duke of Edinburgh as patron of BookTrust. Camilla has also launched and continues to launch campaigns and programmes to promote literacy. On spreading literacy, she stated in 2013 during a speech at an event for the National Literacy Trust that \"I firmly believe in the importance of igniting a passion for reading in the next generation. I was lucky enough to have a father who was a fervent bibliophile and a brilliant storyteller too. In a world where the written word competes with so many other calls on our attention, we need more Literacy Heroes to keep inspiring young people to find the pleasure and power of reading for themselves.\"\nCamilla has been patron of the Queen's Commonwealth Essay Competition since 2014. The initiative, which is run by the Royal Commonwealth Society, asks young writers from across the Commonwealth to write essays on a specified theme, with Camilla launching the competition annually. Since 2015, she has been involved with 500 Words, a competition launched by BBC Radio 2 for children to write and share their stories and was announced as the competition's honorary judge in 2018. Since 2019, she has supported Gyles Brandreth's initiative Poetry Together, which aims to bring younger and older generations together through poetry recitation.\nIn January 2021, Camilla launched the Duchess of Cornwall's Reading Room online club for readers, writers and literary communities to connect and share their interests and projects. In January 2022, she joined members of the Reading Room initiative to promote planting books in phonebox libraries around the United Kingdom. In February 2023, the Reading Room initiative was relaunched as a charity under the name the Queen's Reading Room. The inaugural Queen's Reading Room Festival was held at Hampton Court Palace on 11 June, with Judi Dench, Richard E. Grant, Robert Harris, Kate Mosse and other celebrities as guests. The festival has become an annual event. In March 2025, Camilla launched the Queen's Reading Room Medal to recognise the work of people that contribute to the practice of reading among their communities.\nIn October 2021, Camilla was announced as patron of Silver Stories, a charity that links young people to the elderly by encouraging them to read stories over telephone. In May 2022, she became patron of Book Aid International, a role previously held by Prince Philip from 1966 until his death in 2021. In July 2022 and ahead of her 75th birthday, she launched her Birthday Books Project, with the aim of providing wellbeing and happiness-themed mini libraries at 75 primary schools from disadvantaged areas in the United Kingdom. In May 2023, as patron of the National Literacy Trust, Camilla opened the first Coronation library at Shirehampton Primary School in Bristol, and 50 Coronation libraries will be created for children in communities with low levels of literacy across the United Kingdom in 2023 and 2024. In September 2023, she launched a new UK-France literary prize with Brigitte Macron, the Entente Littéraire Prize at the Bibliothèque nationale de France (BnF) in Paris. The Entente Littéraire Prize will recognise Young Adult (YA) Fiction and allow UK and French citizens to share joint literary experiences, reinforcing cultural ties whilst celebrating the joys of reading. In January 2024, twenty new manuscripts by different authors were added to the miniature library of Queen Mary's Dolls' House as part of the Modern-Day Miniature Library project headed by Camilla to reflect Britain's modern literature.\nOther areas\nCamilla is a supporter of animal welfare and patron of many animal welfare charities, including Battersea Dogs & Cats Home and president of Brooke. She often visits other animal shelters to show her support and to see how the animals are cared for. Camilla, who had owned two Jack Russell Terriers named Rosie and Tosca, adopted two rescue puppies of the same breed named Beth and Bluebell from Battersea Dogs and Cats Home in 2011 and 2012, respectively, followed by another rescue named Moley in 2025. Also in 2012, she opened two veterinary facilities at the University of Bristol's School of Veterinary Sciences at Langford in Somerset, which provide treatment for sick animals. In 2015, she worked with department store Fortnum & Mason to sell 250 jars of honey produced by bees in her private garden in Wiltshire; the jars, priced at £20, sold out in two weeks and the proceeds were donated to the Medical Detection Dogs charity, of which she is a patron. Since then, she sends a limited edition of honey every year to Fortnum & Mason, with proceeds donated to her other charities.\nCamilla supports organisations around the world working to combat poverty and homelessness. She is the patron of Emmaus UK, and in 2013, during her solo trip to Paris, she went to see the work done by the charity in that city. Every year around Christmas, she visits Emmaus communities across the United Kingdom. In a similar vein, she is a staunch supporter of credit unions, which she states are a \"real force for change in the financial landscape, serve the people, not profit\" and \"provide a friendly financial community where members mutually benefit from advice, as well as savings accounts and loans.\" She annually hosts disabled and terminally ill children from her patronages Helen & Douglas House and Roald Dahl's Marvellous Children's Charity for lunch at Clarence House, where they also decorate the Christmas tree. She also supports healthy-eating, anti-FGM, arts and heritage related organisations and programmes.\nIn March 2022 and amid the Russian invasion of Ukraine, Camilla made a \"substantial\" donation to the Daily Mails refugee campaign. In February 2023, she and Charles donated to the Disasters Emergency Committee (DEC) which was helping victims of the 2023 Turkey–Syria earthquakes.\nFashion and style\nCamilla topped Richard Blackwell's list of \"Ten Worst-Dressed Women\" in 1994, and her name appeared on it again in 1995, 2001 and 2006. In the years after her marriage, she has developed her own style and tried outfits and ensembles by notable fashion designers. She is said to prefer \"signature tea and shirt dress styles\" and favours \"tones of nude, white and navy\" and \"round necklines\". She has also been praised for her jewellery collections. In 2018, Tatler named her on its list of Britain's best dressed people, praising her for her hat choices which have given \"millinery a good name\". Charles and Camilla topped Tatlers Social Power Index for 2022 and 2023. In 2024, the magazine included her on its list of the most glamorous European royals.\nIn 2022, Camilla took part in her first solo magazine shoot for British Vogue, appearing in the July 2022 issue. The shoot took place at Clarence House, and the outfits were chosen from her own wardrobe. In 2023, she was named among British Vogues \"The Vogue 25\", which annually celebrates influential women pushing British society forwards. In response to an enquiry by People for the Ethical Treatment of Animals, Buckingham Palace stated in May 2024 that Camilla would no longer \"procure any new fur garments\".\nTitles, styles, honours and arms\nTitles and styles\nand Duchess of Cornwall (right)\n}}\nUpon marrying Charles, Camilla was styled \"Her Royal Highness The Duchess of Cornwall\". In Scotland, she was known as \"Her Royal Highness The Duchess of Rothesay\". Legally, Camilla was Princess of Wales but adopted the feminine form of her husband's highest-ranking subsidiary title, Duke of Cornwall, in a concession to the low public opinion of her. In 2021, upon the death of Prince Philip, Duke of Edinburgh, Charles inherited his father's titles, and Camilla thus became also formally Duchess of Edinburgh until Charles's accession the following year.\nClarence House stated on the occasion of Charles and Camilla's wedding in 2005 that, upon his accession, she intended to be known as princess consort rather than as queen. Like the initial title of duchess, this promise reflected public disapproval. There is no legal or historical precedent for such a title, however, and Camilla was to be queen under common law anyway. The rising public acceptance of her allowed the 2005 announcement to be quietly shelved. In her 2022 Accession Day message, Elizabeth&nbsp;II stated that it was her \"sincere wish\" for Camilla to be known as queen consort upon Charles's accession to the throne.\nCamilla duly became queen consort upon Charles's accession on 8 September 2022. She was initially styled as \"Her Majesty The Queen Consort\" to distinguish her from the recently deceased Queen Elizabeth II. Since her coronation on 6 May 2023, she has been styled \"Her Majesty The Queen\", consistent with past queens consort.\nHonours\nCamilla is a Royal Lady of the Most Noble Order of the Garter, Extra Lady of the Most Ancient and Most Noble Order of the Thistle, Dame Grand Cross of the Royal Victorian Order, Grand Master and First and Principal Dame Grand Cross of the Most Excellent Order of the British Empire, recipient of the Royal Family Order of Elizabeth II, recipient of the Royal Family Order of Charles III, and a member of the Privy Council of the United Kingdom and the Privy Council of Canada.\nArms\nA new grant of arms was made in 2023 after Charles's accession as king. Camilla's coat of arms impale the royal arms to the dexter, with her father's own arms to the sinister.\n|year_adopted      = 21 February 2023 (first granted 14 July 2005)\n|coronet           = Tudor Crown\n|escutcheon        = Within the Garter Our Royal Arms [Quarterly, I and IV Gules, three lions passant guardant in pale Or langued and armed Azure. II Or a lion rampant Gules armed and langued Azure within a double tressure flory-counter-flory Gules. III Azure a harp Or stringed Argent] impaling the Arms of Shand [Azure a Boar's Head erased behind the ears Argent armed and langued Or on a Chief engrailed Argent between two Mullets Gules a Cross crosslet fitchy Sable] surmounted by Our Crown\n|supporters        = To the dexter A Lion Guardant Or Crowned proper and to the sinister A Boar Azure armed and unguled Or langued Gules and gorged with a Coronet composed of Crosses formy and Fleurs-de-lys attached thereto a Chain reflexed over the back and ending in a Ring all Or\n|orders            = The ribbon of the Order of the Garter: Honi soit qui mal y pense ('Shame be to him who thinks evil of it')\n|bannerimage       = Royal Standard of Queen Camilla.svg\n|banner            = A banner of Camilla's arms combined with the Royal Standard\n|symbolism         = The arms contain symbolism from Camilla's paternal arms: those of the Shands of Craig from Aberdeenshire. The boar's head might indicate a connection to the prominent Gordon family of Aberdeenshire, whose arms also contain a boar's head. The mullets (stars) probably stem from marriage alliances with families that used mullets in their arms: potentially the Aberdeenshire family of Blackhall or the family of Reid of Pitfoddells. The cross is used to difference the family arms and is specific to Camilla's father, Major Bruce Shand. Camilla's blue boar supporter echoes Major Shand's crest (\"a boar statant Azure armed and langued Gules his dexter forefoot resting on a mullet Gules\").\n|previous_versions =    Initial versions of her arms as Duchess of Cornwall were depicted without the Order of the Garter, to which she was appointed in 2022. Between 2012 and 2022, her arms featured the Royal Victorian Order circlet, with the insignia of GCVO appended.\n|other_versions=\n}}\nAncestry\nCamilla's ancestry is predominantly English. She also has Dutch, Scottish, Colonial American, French and French–Canadian ancestors.\nCamilla is descended from Dutch emigrant Arnold Joost van Keppel, who was created Earl of Albemarle by King William III in 1696. Through Anne van Keppel, Countess of Albemarle and a granddaughter of King Charles II, Camilla's bloodline is descended from the Houses of Stuart and Bourbon.\nCamilla's Scottish lineage descends from King Robert III through his daughter Mary, who was the mother of Sir William Edmonstone of Duntreath, an ancestor of her maternal great-great-grandfather, Sir William Edmonstone, 4th Baronet. Her paternal ancestors, an upper-class family, emigrated to England from Scotland.\nCamilla's French lineage derives partially through her maternal great-great-grandmother, Sophia Mary MacNab of Hamilton, Ontario, daughter of Sir Allan MacNab, who was prime minister of the Province of Canada before Confederation. Sophia's son George Keppel and King Edward VII's mistress Alice Keppel were Camilla's maternal great-grandparents.\nThrough Henry Cavendish, 2nd Duke of Newcastle, Camilla and Charles are ninth cousins once removed.\nIn popular culture\n, London]]\nEmerald Fennell and Olivia Williams have portrayed Camilla during various stages of her life on the Netflix series The Crown. Fennell's performance in the 2020 fourth season earned her a nomination for the Primetime Emmy Award for Outstanding Supporting Actress in a Drama Series. Haydn Gwynne played Camilla in the sitcom The Windsors.\nIn 2024, to celebrate Queen Camilla's role as President of The WOW Foundation and the work of the foundation in empowering girls and women, Barbie created a one-of-a-kind Barbie doll in her likeness.\nBibliography\nBooks\n*Foreword to:\nAuthored articles and letters\n*\n*\n*\n*\n*\n*\nGuest-editor\n*\"HRH The Duchess of Cornwall: Guest Editor\". Country Life. 13 July 2022.\nSee also\n*List of current consorts of sovereigns\nNotes\nReferences\nCitations\nWorks cited\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\nFurther reading\n*\nExternal links\n*[https://www.royal.uk/the-queen The Queen] at the official website of the Royal Family\n*[https://www.canada.ca/en/canadian-heritage/services/royal-family/members-royal-family/queen-consort.html The Queen] at the website of the Government of Canada\n*\n*\n*\n|-\n|-\n}}\n|-\n|-\n}}"
    }
  ]
}