{
  "content": [
    {
      "type": "text",
      "text": "# Queens Park railway station, Perth\n\n| elevation          =\n| distance           =  from Perth\n| line               =\n*\n}}\n| bus_routes         =\n| bus_stands         =\n| structure          = Ground\n| platform           = 2 (1 island)\n| depth              =\n| levels             =\n| tracks             = 2\n| parking            =\n| bicycle            =\n| opened             = 1899\n| closed             = 1990, 20 November 2023\n| rebuilt            = 1997, mid-2025\n| electrified        = Yes\n| accessible         =\n| architectural_style =\n| code               = AQP99091 (platform 1)99092 (platform 2)\n| owned              = Public Transport Authority\n| operator           = Transperth Train Operations\n| zone               = 2\n| former             = Woodlupine\n| passengers         = 238,960\n| pass_year          = 2013–14\n| pass_percent       =\n| pass_system        =\n| mpassengers        =\n| services           =\n| other_services     =\n| other_services_header = Former services\n| other_services_collapsible = yes\n| mapframe           = yes\n| mapframe-caption   = Location of Queens Park railway station\n| mapframe-zoom      = 13\n}}\nQueens Park Station is a suburban railway station on the Transperth network. It is located on the Armadale and Thornlie-Cockburn lines, 11.4 kilometres from Perth Station serving the suburb of Queens Park, Western Australia.\nHistory\nQueens Park Station opened in 1899 as Woodlupine, being renamed Queens Park on 16 April 1912.\nIn 2012, the station was refurbished.\nRebuild\nAs part of a Metronet project for several level crossing removals on the Armadale line, Queens Park Station was rebuilt as an elevated station and the Hamilton Street and Wharf Street level crossings were replaced with elevated rail. The design saw Queens Park Station moved about  closer to Hamilton Street, with a new passenger car park underneath the elevated railway. The new station features stairs and lifts, with future proofing to allow escalators and fare gates to be added in the future. The new station platforms are side platforms as opposed to the previous island platform design in order to reduce the impact of the bridge structure on the surrounding area. The platforms are also to length of a six-car train (150m), as opposed to the previous station which only had a length of a four-car train (100m).\nServices\nQueens Park Station is served by Transperth Armadale and Thornlie–Cockburn line services. Thornlie-Cockburn line services operate between Perth and Cockburn Central, every 15 minutes during the day and every 30 minutes at night. Armadale line services operate between Perth and Cannington, running every 7.5 minutes during the day and every 15 minutes at night. This results in an overall frequency of 12 trains per hour during the day and 6 per hour at night. Each line usually operates with A Series trains in 4 or 2 car sets or a 3 car B Series train, however on event days the station is served by special event services on the Thornlie-Cockburn line which run as 6 car B or C Series sets and skip McIver, Claisebrook, Burswood and Victoria Park stations. Passengers travelling to those stations can instead use the Armadale line.\nThe station saw 238,960 passengers in the 2013-14 financial year.\nPrior to the 2023 closure, the station was also served by the twice daily B pattern which was intended as a school special for the nearby St Joseph's School and St Norbert College. It was skipped by Armadale line C Pattern services.\nPlatforms\n| pattern = All stops\n| dest =\n| notes =\n}}\n| pattern = All stops\n| dest =\n| notes =\n}}\n| pattern = All stops\n| dest =\n| notes =\n}}\n| pattern = All stops\n| dest =\n| notes =\n}}\nReferences\nExternal links\n*\n*[http://wastations.i8.com/Queens_Park_Station.html Gallery]  History of Western Australian Railways & Stations"
    }
  ]
}