{
  "content": [
    {
      "type": "text",
      "text": "# Queen of England Inn\n\n| alternate_names     = Fischl/Szuhanek House\n| architectural_style = Eclectic/Historicist\n| address             = 27 3 August 1919 Boulevard, Timișoara, Romania\n| years_built         = First half of the 19th century\n}}\nThe Queen of England Inn (; ; ), housed in Fischl/Szuhanek House, is a historical building located in Timișoara, Romania, at 27 3 August 1919 Boulevard. It is part of the Fabric (II) urban site, a historical monument identified with the code TM-II-s-B-06097.\nHistory\n) with the inn on the left]]\nThe building was most likely built in the first half of the 19th century.\nIn his monograph Alt-Temesvar im letzten Halbjahrhundert: 1870–1920, József Geml, the mayor of Timișoara from 1914 to 1918, mentioned that the summer garden of the Queen of England café was one of the most popular places in the neighborhood, along with \"Curtea Fabricii\" (Fabrikshof, the brewery), Lerchenfeld, Schweiz, and Breslmaier.\nIn the second half of the 19th century, the economic growth of the neighborhood and the increasing popularity of the establishment created the need to expand and transform it into a more spacious and welcoming inn. The proposed upgrades included a business meeting room, a dance hall, and a billiard room. Architect Anton Schmidt was commissioned to redesign the building, preserving its original classical style while adding an upper floor and an attic to enhance its visibility from the two main streets. However, the project was ultimately never carried out.\nFor nearly a century, the Arena Summer Theater operated in the inner courtyard of the inn, under the direction of Eduard Reimann, head of the German Theater. Constructed from wood, the Arena required frequent maintenance and repairs. It served as a venue for touring theater troupes who deviated from their regular routes after completing seasons in other cities. Due to its popularity, four additional summer gardens eventually opened in the neighborhood, drawing away part of its loyal audience. In response, Reimann invested a decade of effort and funds into renovating the theater. In 1863, he leased the venue to the Serbian Theater from Novi Sad, under an agreement that the Serbian troupe would continue restoration work and pay a fee of 10 florins for each performance. The Arena ceased operations in 1919.\nOn 8 July 1869, the horse-drawn tram was inaugurated in Timișoara, on the section from St. George Square to the Queen of England Inn.\nThe building is said to have belonged to the Fischl family, originally from Vienna. Their daughter, Irene Fischl, lost her brother during World War I and was orphaned by both parents at the age of 18. In 1927, she married painter , and the couple lived together in the building.\nArchitecture\nThe building stands at the end of \"Kunz Row\" and is designed in an eclectic historicist style, characterized by prominent architectural elements typical of its time. The central arched entrance gate reflects the influence of the classicist movement from the first half of the 19th century.\nReferences"
    }
  ]
}