{
  "content": [
    {
      "type": "text",
      "text": "# Queen's Tower, London\n\nThe '''Queen's Tower''' is a  tower topped with a copper-covered dome. It is situated in the South Kensington Campus of Imperial College London, England, just north of the Imperial College Road. To reach the base of the dome from the ground on foot, one must ascend a series of narrow spiral staircases with 325 steps in total. The tower used to be the central tower of the Imperial Institute, and is now the sole remaining part of that building.\nHistory\nThe Imperial Institute was founded on Queen Victoria's Golden Jubilee in 1887, and its partial demolition began in 1957. At that time it was generally known as the Collcutt Tower, after its designer, the Victorian architect Thomas Edward Collcutt. The tower itself would have been demolished along with the rest of the Institute, had it not been for a public campaign led by the then Poet Laureate John Betjeman, a supporter of 19th-century architecture. He warned that tastes in architecture change, and that the destruction of this building (at a time when Victorian architecture had fallen out of favour) would be a loss.\nRestoration\nIn 1966, with the rest of the building demolished, the tower was repaired to enable it to stand on its own, which involved the construction of new foundations. There are also two stone lions at the foot of the tower, which were once set at the entrance to the Imperial Institute. These two stone lions are pair of a set of four, the other two (which are not in such good condition) are in the grounds of the Commonwealth Institute.\nIn 2022 works started to complete repairs to the masonry and replace the copper roof, following a fail of masonry. The timber louvres around the bell chamber will be replaced along with repairs or replacement of the flat roofs to the balconies. The work is expected to take two years to complete. The work required an 83m free-standing scaffold tower consisting of an inner access scaffold, outer scaffold exoskeleton and a bespoke circular temporary roof covering. Propping was installed in the basement tunnels and transfer the load into the tower's foundations.\nBells\nThere are ten bells hung for change ringing in the middle of the tower, about two thirds of the way up. These bells, known collectively as the Alexandra Peal, were a gift from Mrs Elizabeth M. Millar of Melbourne, Australia in 1892, and are named after Queen Victoria — the tenor (largest) bell — the Prince and Princess of Wales (Albert Edward and Alexandra), two other children of Queen Victoria (Alfred and Arthur) and the five Wales grandchildren (Albert Victor, George, Louise, Victoria and Maud). They are rung on royal anniversaries and on the dates of the Imperial College degree ceremonies.\nViewing gallery\nThe highest viewing gallery is below the dome at the top of the building. Upon walking through the door one gets a unique view, with the top of the Albert Memorial on top of the Royal Albert Hall. Being one of the tallest towers in west London, the Queen's Tower enjoys an uninterrupted view in all directions. It has been estimated that in good viewing conditions the furthest visible point is 20 miles away. As of February 2022, the viewing gallery is closed to visitors.\nImperial College London\nThe Queen's Tower is now in the custody of Imperial College London.\nSee also\n*Queen's Lawn\nReferences\nExternal links\n*[http://www.imperial.ac.uk/about/history/queens-tower/ Imperial college: History of the tower]\n*[https://web.archive.org/web/20110910080009/http://www.architecture.com/LibraryDrawingsAndPhotographs/Albertopolis/TheStoryOf/ImperialCollege/QueensTower.aspx Original design drawing for the tower]"
    }
  ]
}