{
  "content": [
    {
      "type": "text",
      "text": "# Queens of Drama (film)\n\n| image          = Queens of Drama poster.jpg\n| caption        = Release poster\n| director       = Alexis Langlois\n| producer       = Inès Daïen DasiBenoit Rolland\n| writer         = Carlotta CocoThomas ColineauAlexis Langlois\n| starring       = Louiza AuraGio Ventura\n| music          = Pierre DespratsMona SoyocYelleRebeka Warrior\n| cinematography = Marine Atlan\n| editing        = Alexis LangloisGabriel Gonzalez\n| studio         = Les Films du PoissonWrong Men\n| distributor    =\n| released       =\n| runtime        = 114 minutes\n| country        = FranceBelgium\n| language       = French\n}}\nQueens of Drama () is a French musical drama film, directed by Alexis Langlois and released in 2024.\nPlot\nThe film centres on a star-crossed romance between Mimi Madamour (Louiza Aura) and Billie Kohler (Gio Ventura), two singers who first meet as competitors in a television singing competition where Mimi is selected for a place in the competition and goes on to have a huge pop hit, while Billie is rejected and pursues underground success as a punk rocker.\nProduction\nFrom the initial idea to the start of filming, Queens of Drama took around six years to develop. While the writing process was relatively quick, the biggest challenge was securing funding, as finding support for a queer film in France proved to be especially difficult, director Alexis Langlois claims.\nQueens of Drama carries strong autobiographical elements, with the character of Dorothy serving as a reflection of the director’s own journey as a queer filmmaker navigating the film industry. Drawing from personal experiences of exclusion and discrimination as a working-class queer artist in Paris, Langlois channels the frustrations of battling funders during the making of their short film Terror, Sisters! (2019) and internal doubts into the narrative.\nThe casting process for Queens of Drama focused on finding the right chemistry between the leads, Mimi and Billie. Although the role of Billie was originally written for director Alexis Langlois’s sister, the unexpected connection between Gio Ventura and newcomer Louiza Aura during auditions ultimately shaped the film’s central dynamic. Apart from Louiza Aura and Gio Venture, the cast also includes Bilal Hassani, Alma Jodorowsky, Nana Benamer, Asia Argento, Thomas Poitevin, Dustin Muchuvitz, Raya Martigny, Drag Couenne, Julia Fiquet, Jean-Biche and Élodie Barthels.\nRather than being written as traditional show tunes, tracks like Don’t Touch emerged from a collaborative process with, among others, the band Yelle where director Alexis Langlois provided the script and emotional tone to the composers—treating them like actors interpreting a role.\nThe film’s horror sequences draw inspiration from several films and series that director Alexis Langlois loved as a teenager, including Evil Dead, Street Trash, The Witches, The Faculty, and Buffy the Vampire Slayer.\nAnalysis\nMusic plays a central role in Queens of Drama, with the songs crafted not just as pop numbers, but as narrative devices that carry emotional and thematic weight.\nQueens of Drama engages with the role of pop music in queer culture, reflecting on how queer communities have long embraced and reinterpreted mainstream pop to create their own icons and narratives. Director Alexis Langlois emphasizes the importance of having, around the time of the film's release, openly queer pop singer like Chappell Roan, whose music makes queer identity visible rather than merely subtextual. The film aligns with this cultural shift, celebrating the resilience and creativity of queer audiences in shaping meaning from popular culture, while also highlighting the ongoing need for authentic queer representation in the mainstream.\nThe visual language of Queens of Drama is rich in symbolism and queerness, using the evolving physical appearances of its characters to mirror internal transformations and explore non-normative identities. Billie’s grotesque, hyper-stylized look—muscular, flamboyant, and adorned with exaggerated features like a Thierry Mugler-inspired nose—serves as both a metaphor for the repression of sexual identity and an assertion of radical self-expression. Inspired by Pete Burns, the character blurs gender binaries by embracing visual extremes, while Mimi's contrasting transformation—from shaved head to a  white Afro—emphasizes shifting power dynamics and the fluidity of identity.\nRelease and recognition\nThe film premiered on 18 May 2024 at the 2024 Cannes Film Festival, where it was a nominee for the Queer Palm. It was nominated for the Louis Delluc Prize for Best First Film. The film was shown at several festivals worldwide, including Rio de Janeiro International Film Festival, BFI London Film Festival and Thessaloniki International Film Festival.\nReferences\nExternal links\n*"
    }
  ]
}