{
  "content": [
    {
      "type": "text",
      "text": "# Queen Ingrid's Hospital\n\n| map_caption =\n| Logo        =\n| Logo Size   =\n| Location    = Nuuk\n| Region      =\n| State       =\n| Country     = Greenland\n| HealthCare  =\n| Funding     = Government\n| Type        = General\n| Speciality  =\n| Standards   =\n| Emergency   =\n| Helipad     =\n| Affiliation =\n| Patron      =\n| Network     =\n| Beds        = 130\n| Founded     = 1954\n| Closed      =\n| Website     =\n| Wiki-Links  = [http://peqqik.gl/Footerpages/English.aspx?sc_lang=kl-GL www.peqqik.gl]\n}}\n'''Queen Ingrid's Hospital''' () is the central hospital of Greenland. It is in Nuuk, the capital. The local health center, Queen Ingrid's Health Center, is an extension to the main hospital building, but operates separately from the hospital.\nIn 2022 the health commission concluded that a new hospital was needed to replace the current one, which the Naalakkersuisut (Government of Greenland) has talked about since 2020.\nHistory\nin the foyer]]\nThe hospital opened in 1954 as a tuberculosis sanatorium called Queen Ingrid's Sanatorium, from which the hospital is nicknamed \"Sana\". It was named after Ingrid, the queen of Denmark from 1947 to 1972. In 1961 the hospital got its status as the national hospital and its current name. Patients from every part of Greenland can be transferred there if their regional hospital cannot treat their illnesses.\nIn March 2011 the local health center and a new national pharmacy was inaugurated.\nThe design of the buildings takes the form of sunken angular blocks and is clad in copper both on the facades and roof. The architecture by C. F. Møller Architects is inspired by the ice floes that float in Nuup Kangerlua and the image of Sermitsiaq mountain.\nA year later, in October 2012, a new emergency center was opened. The center includes an ICU, an ER (which is operated by the health center, not the hospital) and new operating rooms. In February 2018 an IMCU ward was opened.\nPatient transport to the hospital\nNon-emergency admissions can be planned via regular scheduled flights. Emergency admissions can take place via evacuation from all over Greenland using King Air ambulance flight or helicopters operated by Air Greenland.\nThere are not always specialist doctors available in Greenland, therefore elective admissions are planned ahead for when specialists are available. Acute and subacute cases that can not be handled by the available staff, will be conferred with Rigshospitalet in Denmark, to where patients can be evacuated if needed.\nIn rare cases evacuations to Reykjavík can take place, if the distance is shorter from the patient's place to there compared with the distance to Queen Ingrid's Hospital, for example Ittoqqortoormiit.\nDepartments\nQueen Ingrid's Health Center is the local health center of Nuuk. Organizationally, it is not part of the hospital, but is built in extension of the hospital. The health center is run by specialists in family medicine and registered nurses. The prescribed medicine is free of charge, and can be collected in the national pharmacy.\nThe Department of Medicine includes two general wards, M1 and M2, as well as several outpatient clinics.\nSince 2014 a need for an expansion of the children ward has been discussed.\nThe Department of Surgery includes three general wards. K1 (orthopedic surgery), K2 (parenchymal surgery and urology), K3 (gynecology and obstetrics), several outpatient clinics, and a maternity ward.\nThe Emergency department includes an intermediate intensive care unit (IMCU), an intensive care unit (ICU) with an integrated Neonatal intensive care unit (NICU).\nThe Department of Psychiatry has one general 12-bed psychiatric ward, A1, as well as several outpatient clinics. Some forensic patients have to be transferred to a special ward in Denmark. Since 2018 a new psychiatric building has been planned. The project has been delayed by budget overruns, and several cancellations of tenders.\nIn 2005 the Danish entrepreneur and millionaire Svend Junge, who lived most of his life in Greenland, donated a new CT scanner to the hospital's Department of Radiology. It was in use until 2017 when two new CT scanners were bought by the hospital itself. In 2012 the British Candy Foundation donated a new MRI machine. It was used until 2023 when the Danish Kirsten & Freddy Johansens Foundation donated a new machine to the hospital.\nReferences\nExternal links\n* [https://peqqik.gl/Kontakt/Sundhedscentre/Dronning-Ingrids-Hospital/DIH-forside-dk-og-gl-ikke-link Queen Ingrid's Hospital]\n* [https://peqqik.gl/Kontakt/Sundhedscentre/Sermersooq/Dronning-Ingrids-Sundhedscenter-gl-og-dk Queen Ingrid's Health Center]\n* [https://peqqik.gl/Kontakt/Sundhedscentre/Landsapoteket-Nuuk/Landsapoteket-gl-og-dk National Pharmacy]"
    }
  ]
}