{
  "content": [
    {
      "type": "text",
      "text": "# Queenie (TV series)\n\n| developer            =\n| director             =\n| starring             =\n| narrated             =\n| theme_music_composer =\n| opentheme            =\n| endtheme             =\n| composer             =\n| country              = United Kingdom\n| language             = English\n| num_seasons          = 1\n| num_episodes         = 8\n| list_episodes        =\n| executive_producer   =\n| producer             =\n| location             = United Kingdom\n| cinematography       =\n| editor               =\n| camera               =\n| runtime              =\n| company              =\n| budget               =\n| network              = Channel 4\n| first_aired          =\n| last_aired           = present\n| related              =\n}}\nQueenie is a British television series, based on the novel of the same name by Candice Carty-Williams. The series is developed by Further South Productions in association with Lionsgate Television for Channel 4.\nCast\n* Dionne Brown as Queenie Jenkins\n* Samuel Adewunmi as Frank Ssebendeke II\n* Bellah as Kyazike Mayagenda\n* Sally Phillips as Gina Hargadon\n* Jon Pointing as Tom Blake\n* Tilly Keeper as Darcy Pike\n* Llewella Gideon as Grandma Veronica\n* Michelle Greenidge as Aunty Maggie\n* Elisha Applebaum as Cassandra Stone\n* Cristale De'Abreu as Diana Jenkins\n* Mim Shaikh as Adi Malik\n* Joseph Marcell as Grandad Wilfred\n* Joseph Ollman as Guy Carew\n* Melissa Johns as Janet\n* Laura Whitmore as Doctor Ellison\n* Santana Holness as Young Maggie\nProduction\nAn adaptation of Carty-Williams' novel was in development with Channel 4 as of 2019. In August 2021, it was confirmed Channel 4 had commissioned an eight-episode adaptation, with Carty-Williams herself attached as showrunner and executive producer. Also executive producing are Steve November and Sarah Conroy of Further South Productions, with Lisa Walters as co-executive and series producer. Joining Carty-Williams in the writing room are Ryan Calais Cameron, Yolanda Mercy, Natasha Brown and Thara Popoola. The series is directed by Joelle Mae David and Makalla McPherson.\nIn May 2023, the cast was announced, with Dionne Brown set to lead the series as the titular character. Also joining the cast were Samuel Adewunmi, Bellah, Sally Phillips, Jon Pointing, Tilly Keeper, Llewella Gideon, Michelle Greenidge, Cristale De'Abreu, Elisha Applebaum, and Mim Shaikh. More cast members were revealed in December 2023, including Joseph Marcell, Joseph Ollman, Melissa Johns, and Laura Whitmore.\nPrincipal photography began in April 2023 in South London.\nEpisodes\n| ShortSummary    =\n| LineColor       = FF5F5F\n}}\n| ShortSummary    =\n| LineColor       = FF5F5F\n}}\n| ShortSummary    =\n| LineColor       = FF5F5F\n}}\n| ShortSummary    =\n| LineColor       = FF5F5F\n}}\n| ShortSummary    = Queenie rings in the New Year by cleaning her house alone. She decides to swear off men as her New Years Resolution. Queenie presents an article idea which is approved by her boss. She see Ted at work and attempts to push past the awkwardness, finding out he's married and his wife is pregnant. Queenie leaves work only to run into Adi, who isn't as estranged with his wife as he previously implied. Queenie gets advice from her friends while having a quiet evening at home, only to have it interrupted by Guy drunk and begging for sex. Queenie let's him sleep it off on her couch, he pushes more and Queenie ends up sleeping on the couch. Cassandra comes by in the morning for the Brunch Date her and Queenie planned, only to find out her boyfriend, Guy, had been in Queenie's apartment all night. Cassandra insults Queenie and leaves. Queenie leaves her apartment to see Tom, who denies her entry. Queenie finds out Tom is seeing a new woman. Queenie gets called into a meeting with HR who states that Ted has reported her for inappropriate behavior and they place her on leave. The episode ends with Queenie having a panic attack in her grandparents' bathtub.\n| LineColor       = FF5F5F\n}}\n| ShortSummary    =\n| LineColor       = FF5F5F\n}}\n| ShortSummary    =\n| LineColor       = FF5F5F\n}}\n| ShortSummary    =\n| LineColor       = FF5F5F\n}}\n}}\nRelease\nOnyx Collective boarded the project in May 2023 as an international distributor; the series was first aired on Channel 4 on 4 June 2024, and on Hulu, Disney+ and Star+ on 7 June 2024.\nFirst look stills were released in December 2023.\nReferences\nExternal links\n*"
    }
  ]
}