{
  "content": [
    {
      "type": "text",
      "text": "# Queen City Yacht Club\n\nThe Queen City Yacht Club (QCYC) is a maritime-themed club based in Toronto, Ontario. It is located on Algonquin Island in the Toronto Islands, and has been a part of Toronto's sailing community since it was founded in 1889. Toronto at the time was known as the \"Queen City of the Lake\". The original clubhouse was located on the city side of Toronto Harbour, at the foot of York Street.\nHistory\nEdward James Lennox designed the Queen City Yacht Club clubhouse on Lake Street opposite the York street bridge in 1901.\nTaken in 1916, a photo in the Library and Archives Canada collection taken from Canada Steamship Lines' Dock at the foot of York Street shows the Queen City Yacht Club (Toronto).\nIn 1920, dredging in the harbour caused the collapse of that clubhouse and hastened the club's planned move to Sunfish Island (now Algonquin Island).\nIn 1940–41, the Royal Canadian Navy Reserves scheme for training yacht club members developed the first central registry system.\nIn 1979 the club acquired T.S.S. Rapids Queen, a passenger steamship built in 1892 as T.S.S. Columbian and hull used as a breakwall against the waves from Toronto Harbour.\nIn 1991, as part of the club's centennial celebrations, Wayne Lilley wrote Queen City Yacht Club, 1889-1989.\nIn 2003 the Yacht Club purchased a new ferry vessel to replace the aging Algonquin Queen, the replacement vessel (Algonquin Queen ii) operates to this day as a ferry vessel.\nQueen City attracts boaters from around Lake Ontario with events such as the club's annual pig roast.  With racing traditions dating back to 1889, members regularly and successfully compete in events such as the Lake Ontario 300, Lake Ontario Short-Handed Series, Women's Keelboat Series, and inter-club regattas.\nThe Yacht Clubhouse, which was included amongst other buildings of historical and architectural interest, was included in Doors Open Toronto. Built in the traditional style of a yacht club, the great hall of the clubhouse is suited for entertainment and meetings.\nReferences\nExternal links\n*[http://www.qcyc.ca Queen City Yacht Club's Official Site]"
    }
  ]
}