{
  "content": [
    {
      "type": "text",
      "text": "# Queensland Police Museum\n\nQueensland Police Museum collects and exhibits items related to the Queensland Police Service and the history of policing in Queensland, Australia. It was originally established in 1893 as a collection of items for study by police for technical purposes. It was not until 20 May 1979 that it became a museum open to the public. It is currently located at Queensland Police Headquarters at 200 Roma Street, Brisbane.\nHistory\nOn 27 November 1893 Mr Finucane, Chief Clerk of the Queensland Police, signed a memorandum on behalf of Commissioner David Thompson Seymour, which instructed all police officers to send in items of interest concerning crimes and suicides, that they might come across in the course of their duties. This was the basis of the collection of the Queensland Police Museum. It was not established as a museum for the public at that time; its purpose was to educate police officers about criminality. It consisted initially of a glass cupboard and then later a small room.\nOn 31 May 1895 the Police Museum collection was written up in the Brisbane Courier:… the exhibits in the museum, founded by Mr Finucane, speaking of the seamy side of colonial life, are a painful reminder that criminal instincts, slumbering in the hearts of men, like extinct volcanoes, belch forth at times in full eruption…The collection was by nature eclectic and included some very gruesome things. The objects were initially housed at the Petrie Terrace Police Depot and police officers were required to see the display as part of their training. By 1930 the museum was still located at Petrie Terrace Barracks. In 1934, a new appeal for objects was made by the Police Commissioner, Cecil James Carroll. The museum was written about in several newspapers in the 1930s. In the Truth on 17 September 1933 the article was titled as Brisbane Chamber of Horrors: Grisley Relics of Ghastly Crimes and summarised as:… reminders of dark and dreadful deeds in the wild days when Queensland pioneers were waging a fierce and furious fight in the cause of justice lie there, amid dust and stillness and mutely bear witness to many a strange and terrible tale…The museum was described by The Sunday Mail in May 1936 as Queensland’s Black Museum and the article titled as Grim Relics of Early Crimes. Such newspapers give insight into the early collection (much of which is no longer in the collection).\nOn 13 July 1949, the collection was officially handed over into the care of Detective Constable Les Bardwell head of the Technical Section, Criminal Investigation Branch, at the old church building in George Street and then the basement level of Morcome House across the road. Bardwell was keen to study, classify and set them up as museum pieces to join his already extensive firearm reference collection.\nBardwell also wanted to show off the collection and in September 1949 requested the purchase of display cases to be used at the annual Royal National Exhibition (now known as the Ekka). Displays were organised for this show every year and people still remember the police display as a room “stuffed with unusual objects”.\nIn February 1978, Commissioner Terry Lewis approved the formation of a museum committee which included members of the Public Relations Branch, Criminal Investigation Bureau, Photographic Section and Commissioner's Office. It was their job to sort through the collection and decide what was to be kept and displayed. On 20 May 1979, the “new” Police Museum opened. Located on the 7th floor of Forbes House in Makerston Street, it was not initially open to the public but group bookings were taken.\nIn 1980 the museum was opened to the public on Wednesday afternoons and in 1981 Ross Chippindall, an assistant in the Media Liaison office was appointed as part-time curator. Although Chippindall had no museum qualifications, he was an avid scrounger of collection material and a firearm enthusiast. By the end of 1982, 4,000 people had visited the museum and displays were being mounted at school fetes and country shows.\nIn 1985, Sergeant 2/c Bob Good temporarily took over the running of the museum and over a year or so, managed to have the museum displays refurbished and a system in place for evaluating the collection material. In 1986 Gabrielle Flynn, with skills in historical research and education, was appointed as fulltime curator and the museum began opening for  hours per week.\nBy the late 1980s plans were in place to build a new Police Headquarters in Roma Street which was to include a purpose-built home for the museum. The building, along with the new museum, opened in August 1990. The display area was divided into six colour-themed areas – Heritage; Crime; Technology; Developments; Murder! and Crisis. The colour scheme won two Dulux Colour Awards. The curator, Gabrielle Flynn was kept busy with visiting school groups, designing photographic displays and answering historical enquiries. The museum was now open every weekday.\nSince 1997 when the current curator was employed, staffing levels have grown to five; the education program thrives; more than 13,000 visitors come into the museum every year and opening hours have expanded to include the last Sunday of the month (February–November) at which lectures are given about historical and contemporary policing.\nIn 2009, Commissioner Bob Atkinson proposed that the museum compile a complete list of all Queensland police officers. In 2014, as part of the celebration of 150 years of the Queensland Police Service, the list was published and is available for viewing at the museum. At that time it contained approx 30,000 names. It is also available online but limited to officers who commenced prior to 1975 for privacy reasons.\nSee also\n* History of the Queensland Police\nReferences\nAttribution\nThis article was originally based on [https://mypolice.qld.gov.au/museum/2012/11/27/from-the-vault-happy-birthday-to-us-119-years-old-today/ Happy Birthday to Us – 119 years old today!]  © State of Queensland (Queensland Police Service) 2018, released under [https://www.police.qld.gov.au/copyright.htm CC-BY-4.0 licence].\nExternal links\n*"
    }
  ]
}