{
  "content": [
    {
      "type": "text",
      "text": "# Queen's University of Ireland\n\nwas built by Sir Thomas Deane]]\nThe '''Queen's University of Ireland' was established formally by royal charter on 3 September 1850, as the degree-awarding university of the Queen's Colleges'' of Belfast, Cork, and Galway that were established in 1845 \"to afford a university education to members of all religious denominations\" in Ireland.\nThe university system itself was replaced by the Royal University of Ireland in 1880, which in turn was replaced by Queen's University Belfast, with the Cork and Galway colleges forming the National University of Ireland, along with University College Dublin.\nThe three Queen's colleges are currently known as:\n*University of Galway\n*Queen's University Belfast\n*University College Cork\n, and built in 1849]]\nEstablishment\nThe Queen's Colleges (Ireland) Act 1845 (8 & 9 Vict. c. 66) (An Act to enable Her Majesty to endow new Colleges for the Advancement of Learning in Ireland) established the colleges with the intention that they would provide for Roman Catholic requests for university education, since Catholics did not generally attend Trinity College Dublin at that time (though there were no legal restrictions preventing them from doing so).\nNevertheless, at the prompting of Protestant interests, the Queen's Colleges were not permitted to give instruction in theology. Thus, the Queen's Colleges became derided as the \"godless colleges\" — Pope Pius IX even ventured as far as declaring them to be \"detrimental to religion\" in an official condemnation. This non-acceptance was articulated in the creation of a rival to the Queen's Colleges — the Catholic University of Ireland in Dublin.\nis dominated by a clock tower]]\nIn 1845 the Mayor of Limerick applied to have a Queen's College located in the city; however Cork, Galway and Belfast were chosen.\nThe colleges were incorporated on 30 December 1845; and on 30 October 1849 they opened for students. A ''Board of Queen's Colleges'' was created to draw up regulations for the colleges, consisting of the President and Vice-President of each college.\nAcademic degrees were conferred by the chancellor and senate of the university with a status similar to those of other universities of the former United Kingdom of Great Britain and Ireland.\nIn 1866 the university considered examining and conferring degrees on students other than those of the Queen's colleges, such as the Catholic Carlow College the St. Patricks College Carlow Report was conducted and the college was deemed to meet the suitable, however it was never enacted.\nThe Queen's College at Belfast became predominantly Protestant, unlike the colleges at Cork and Galway.\nA number of significant figures in Irish public life participated in the governing senate of the university such as Sir Dominic Corrigan (Vice-Chancellor). Naturalist Robert Ball became secretary of Queen's University of Ireland in 1851. Thomas Spring Rice, 1st Baron Monteagle of Brandon served on the senate of the university.\nDissolution\nThe Queen's University was superseded by a new, inclusive, degree-awarding institution, the Royal University of Ireland in 1880. The Queen's University was formally dissolved on 3 February 1882. Immediately on incorporation, the Royal University broke with the “godless\" convention, by setting examinations for, and awarding degrees to students of colleges with a religious heritage, notably Magee Presbyterian College, and the Catholic University of Ireland (that included St. Patrick's College, Maynooth and University College Dublin.)\nThe Belfast college was separated from the other two in 1908, and became The Queen's University of Belfast (QUB). Queen's College, Cork is now University College Cork (UCC), while Queen's College Galway is now the University of Galway. Since 1908 the last two have been part of the federal National University of Ireland system.\nArms\nbetween an open ancient book in chief and the Irish harp in base all Proper.\n|notes = Granted 15 September 1851\n}}\nReferences\nExternal links\n* [http://www.dippam.ac.uk/eppi/documents/13784 Report of Her Majesty's Commissioners appointed to inquire into the progress and condition of the Queen's Colleges at Belfast, Cork and Galway] (1858)\n* [http://www.dippam.ac.uk/eppi/eppi_lc_subjects/2471 Annual Reports on Condition and Progress of Queen's University, Ireland, 1851–1882]"
    }
  ]
}