{
  "content": [
    {
      "type": "text",
      "text": "# Queenie Chan\n\n| birth_place = Hong Kong\n| death_date =\n| death_place =\n| nationality =\n| area =\n| cartoonist =\n| write =\n| art =\n| pencil = y\n| ink =\n| edit =\n| publish =\n| letter =\n| color =\n| alias =\n| signature =\n| signature_alt =\n| notable works = The Dreaming, Odd Is On Our Side,  In Odd We Trust\n| influences =\n| awards =\n| website =\n}}\nQueenie Chan is a Chinese-Australian Original English-Language comic artist who co-wrote and illustrated the graphic novel In Odd We Trust, a prequel to Dean Koontz's Odd Thomas, and published by Del Rey. She illustrated the sequel, Odd Is On Our Side, and is currently illustrating ''The Boy's Book of Positive Quotations for Fairview Press, and continuing the series for her personal work The Dreaming.\nEarly life\nBorn in the 1980s in Hong Kong, Chan grew up immersed in Asian pop culture such as manga. She would often read Chinese-translated versions of Shonen Jump. Then, at the age of 6, she and her family migrated to Australia. Where she discovered American comic strips such as Garfield and Calvin and Hobbes.\nAs a teen, she regularly traveled back to Hong Kong keep up with the newest releases and by 17, she started to draw her own manga stories after reading Rurouni Kenshin. Her works are heavily inspired by the \"manga-style\".\nEducation\nChan attended Meriden High School before graduating and enrolling at the University of New South Wales (UNSW) to study computer programming.\nOn March 25th, 2025, she graduated from Macquarie University and received her PhD on Comic Studies. Her thesis discusses effects of neoliberalism on global creative labour through the lens of South Korean “Webtoons”, dissects an existing case study of an activist digital comic, and produce a comic-game hybrid that attempts an intersectional approach to critiquing neoliberalism.\nCareer\nQueenie Chan started publishing her own web comics before she considered submitting her work to Tokyopop in 2005, where she successfully published her three volume series The Dreaming''.\nBill Sherman, reviewing Chan's work on The Dreaming praised her work stating she was a \"skillful visual storyteller, capable of slathering on the atmosphere\".\nAwards and Accomplishments\n* 2025, Doctor of Philosophy (PhD), University of Macquarie – Research on capitalism and digital comics (Webtoons)\n* 2024, The Dreaming vol. 1-3 – Australian Library & Information Association (ALIA) 2024 Graphics Notables (YA)\n* 2023, Women Who Were Kings #4: Catherine the Great – ALIA 2023 Graphics Notables (YA)\n* 2021, Women Who Were Kings #3: Elizabeth I – Shortlisted for Ledger Awards (Now CAAA)\n* 2017, Fabled Kingdom vol. 2 – Shortlisted for Ledger Awards\nSelected bibliography\nPublished works\n* The Dreaming (2005–2007)\n* In Odd We Trust (2008)\n* Odd Is On Our Side (2010)\n* ''The Boy's Book of Positive Quotations (Illustrator) (2009)\n* Small Shen (2012) (Art work by Queenie Chan, story by Kylie Chan)\nOne-shot manga\n* A Chinese Ghost Story\n* Twinside\n* Block 6''\nShort stories\n* Only Flora\n* Keeper of the Soul\n* Message To You\n* The Two Dollar Deal\n* Ten Years Ago Today\n* Blood of Snow\n* Yuen\n* A Girl Called Marian\n* Greenhouse\n* A Short Ghost Story\n* Twins\n* Air+Space\n* Shirley's Story\n* Twinside\n* Block 6\n* A Chinese Ghost Story\nReferences\nExternal links\n* [http://www.queeniechan.com/ Queenie Chan Website]\n* [https://web.archive.org/web/20081122090754/http://www.silverbulletcomicbooks.com/pb/111599896251790.htm An interview with Queenie Chan conducted at Silverbulletcomicbooks.com]\n*"
    }
  ]
}