{
  "content": [
    {
      "type": "text",
      "text": "# Queen Mary University of London__disambig_1\n\nQueen Mary's College}}\n| mottoeng               = With united powers\n| established            = 1785 – The London Hospital Medical College1843 – St Bartholomew's Hospital Medical College1882 – Westfield College1887 – East London College/Queen Mary College\n| type                   = Public research university\n| endowment              = £48.0&nbsp;million (2024)\n| budget                 = £712.2 million (2023/24)\n| chancellor             = The Princess Royal(as Chancellor of the University of London)\n| principal              = Colin Bailey\n| academic_staff         =  ()\n| administrative_staff   =  ()\n| students               =  () FTE ()\n| undergrad              =  ()\n| postgrad               =  ()\n| city                   =\n| faculty                =\n| affiliation            = Universities UKRussell GroupAssociation of Commonwealth UniversitiesEuropean University Association\n| academic_affiliation   = Alan Turing InstituteInstitute of Physics and Engineering in Medicine  London International Development CentreSepnetScience and Engineering SouthUCLPartnersUniversity of London Institute in Paris\n| location               = London, England, United Kingdom\n| campus                 = Urban\n| colours                =\n| website                =\n| logo                   = Queen Mary University of London logo.svg\n}}\nQueen Mary University of London (QMUL, or informally QM, and formerly Queen Mary and Westfield College) is a public research university in Mile End, East London, England. It is a member institution of the federal University of London. Queen Mary is a member of the Russell Group of research-intensive British universities, the Association of Commonwealth Universities and Universities UK.\nToday, Queen Mary has six campuses across East and Central London in Mile End, Whitechapel, Charterhouse Square, Ilford, Lincoln's Inn Fields and West Smithfield, as well as an international presence in China, France, Greece and Malta. The Mile End campus is the largest self-contained campus of any London-based university. Queen Mary is organised into three faculties – the Faculty of Humanities and Social Sciences, the Faculty of Science and Engineering, and Barts and The London School of Medicine and Dentistry. In 2023/24 the university had around 26,000 students. The annual income of the institution for 2023–24 was £712.2 million of which £146.8 million was from research grants and contracts, with an expenditure of £522.5 million.\nQueen Mary is a major centre for medical teaching and research and is part of UCLPartners, the world's largest academic health science centre. Queen Mary runs programmes at the University of London Institute in Paris, taking over the functions provided by Royal Holloway.\nThere are nine Nobel laureates among Queen Mary's alumni, and current and former staff. Notable alumni include Ronald Ross, who discovered the origin and cure for malaria; Davidson Nicol, who discovered the breakdown of insulin in the human body; British politician Peter Hain; and Andrew Pollard, the chief investigator of the Oxford–AstraZeneca COVID-19 vaccine.\nHistory\nSt Bartholomew's Hospital Medical College and The London Hospital Medical College\nThe Medical College of The Royal London Hospital (now part of the School of Medicine and Dentistry) was England's first medical school when it opened in 1785.\nIn 1850, Elizabeth Blackwell became the first fully qualified female doctor in the UK, after training at St Bartholomew's Hospital.\nPeople's Palace\nThe predecessor to Queen Mary College was founded in the mid-Victorian era as a People's Palace when growing awareness of conditions in London's East End led to drives to provide facilities for local inhabitants, popularised in the 1882 novel All Sorts of Conditions of Men – An Impossible Story by Walter Besant, which told of how a rich and clever couple from Mayfair went to the East End to build a ”Palace of Delight, with concert halls, reading rooms, picture galleries, art and designing schools.\" Although not directly responsible for the conception of the People's Palace, the novel did much to popularise it.\nThe trustees of the Beaumont Trust, administering funds left by Barber Beaumont, purchased the site of the former Bancroft's School from the Drapers' Company. On 20 May 1885, the Drapers' Court of Assistants resolved to grant £20,000 \"for the provision of the technical schools of the People's Palace.\" The foundation stone was laid on 28 June 1886, and on 14 May 1887 Queen Victoria opened the palace's Queen's Hall, as well as laying the foundation stone for the technical schools in the palace's east wing.\nThe technical schools were opened on 5 October 1888, with the entire palace completed by 1892. However, others saw the technical schools as one day becoming a technical university for the East End. In 1892, the Drapers' Company provided £7,000 a year for ten years to guarantee the educational side income.\nEast London College\nPart of the Charterhouse Square site\nIn 1895 John Leigh Smeathman Hatton, director of evening classes (1892–1896; later director of studies 1896–1908 and principal 1908–1933), proposed introducing a course of study leading to the Bachelor of Science degree of the University of London. By the start of the 20th century, the first degrees were awarded and Hatton, along with several other professors, were recognised as teachers of the University of London. In 1906 an application for Parliamentary funds \"for the aid of Educational Institutions engaged in work of a University nature\", led to the college being admitted on an initial three-year trial basis as a school of the University of London on 15 May 1907 as East London College.\nThe ground-breaking wind tunnel built in the first-ever aeronautical department in the UK\nTeaching of aeronautical engineering began in 1907, which led to the first UK aeronautical engineering department being established in 1909, boasting a ground-breaking wind tunnel and creating what became (following the demise of the University of Paris) the oldest aeronautical programme in the world.\nIn 1910 the college's status in the University of London was extended for a further five years, with unlimited membership achieved in May 1915. During this period the organisation of the governors of the People's Palace was rearranged, creating the separate People's Palace Committee and East London College Committee, both under the Palace Governors, as a sign of the growing separation of the two concepts within a single complex.\nDuring the First World War, the college admitted students from The London Hospital Medical College who were preparing for the preliminary medical examination, the first step in a long process that would eventually bring the two institutions together. After the war, the college grew, albeit constrained by the rest of the People's Palace to the west and a burial ground immediately to the east. In 1920 it obtained both the Palace's Rotunda (now the Octagon) and rooms under the winter gardens at the west of the palace, which became chemical laboratories. The college's status was also unique, being the only School of the University of London that was subject to both the Charity Commissioners and the Board of Education.\nIn April 1929 the College Council decided it would take the steps towards applying to the Privy Council for a Royal Charter, but on the advice of the Drapers' Company first devised a scheme for development and expansion, which recommended among other things to re-amalgamate the People's Palace and the college, with guaranteed provision of the Queen's Hall for recreational purposes, offering at least freedom of governance if not in space.\nQueen Mary College\nQueen Mary's College}}\nIn the early hours of 25 February 1931 a fire destroyed the Queen's Hall, though both the college and the winter gardens escaped. In the coming days discussions on reconstruction led to the proposal that the entire site be transferred to the college which would then apply for a charter alone. The Drapers' Company obtained St Helen's Terrace, a row of six houses neighbouring the site, and in July 1931 it was agreed to give these over to the People's Palace for a new site adjacent to the old, which would now become entirely the domain of the college. Separation was now achieved. The Charter was now pursued, but the Academic Board asked for a name change, feeling that \"East London\" carried unfortunate associations that would hinder the college and its graduates. With the initial proposed name, \"Queen's College\", having already been taken by The Queen's College, Oxford and \"Victoria College\" felt to be unoriginal, \"Queen Mary College\" was settled on. The Charter of Incorporation was presented on 12 December 1934 by Queen Mary herself.\nUnder the charter\nDuring the Second World War, the college was evacuated to Cambridge, where it shared with King's College. After the war the college returned to London, facing many of the same problems but with prospects for westward expansion. The East End had suffered considerable bomb damage (although the college itself had incurred little) and consequently several areas of land near to the college site now became vacant. New buildings for physics, engineering, biology and chemistry were built on the new sites, whilst the arts took over the space vacated in the original building, now renamed the Queens' Building.\nLimited accommodation resulted in the acquisition of further land in South Woodford (now directly connected to Mile End tube station by means of the Central line's eastward extension), upon which tower blocks were established. The college also obtained the Co-operative Wholesale Society's clothing factory on the Mile End Road which was converted into a building for the Faculty of Laws (and some other teaching), as well as the former headquarters of Spratt's Patent Ltd (operators of the \"largest dog biscuit factory in the world\" – see Spratt's Complex) at 41–47 Bow Road, which was converted into a building for the Faculty of Economics founded by Maurice Peston, Baron Peston. Both faculties were physically separated from what was now a campus to the west.\nFrom the mid-1960s until the mid-1980s the college proposed to link with the London Hospital Medical College and St Bartholomew's Hospital Medical College with a joint facility in Mile End. A further link with both The London and St. Bartholomew's was made in 1974 when an anonymous donor provided for the establishment of a further hall of residence in Woodford, to be divided equally between Queen Mary College students and the two medical colleges.\nAt the start of the 1980s changing demographics and finances led to a reorganisation of the University of London. At Queen Mary some subjects, such as Russian and Classics were discontinued, whilst the college became one of five in the university with a concentration of laboratory sciences, including the transfer of science departments from Westfield College, Chelsea College, Queen Elizabeth College and Bedford College.\n1989 to 2010\nDrapers' arms.]]\nIn 1989 Queen Mary College (informally known as QMC) merged with Westfield College to form Queen Mary & Westfield College (often abbreviated to QMW). In the years that followed, operations became focused on the Queen Mary site, leading to the eventual sale of the Westfield site.\nIn 1990, The London Hospital was renamed The Royal London Hospital, after marking its 250th year, and a re-organisation of medical education within the University of London resulted in most of the free-standing medical schools being merged with existing large colleges to form multi-faculty institutions. In 1995 The London Hospital Medical College and St Bartholomew's Hospital Medical College merged into Queen Mary & Westfield College to form an entity named Barts and The London School of Medicine and Dentistry.\nIn 2000 the college changed its name for general public use to Queen Mary, University of London; in 2013, the college legally changed its name to Queen Mary University of London.\nThe VISTA telescope is a 4-metre class wide-field telescope at the Paranal Observatory in Chile that was conceived and developed by a consortium of UK universities led by Queen Mary University, costing approximately £36m.\nThe Westfield Student Village opened in 2004 on the Mile End Campus, bringing over 2,000 rooms to students and a huge array of facilities, restaurants, and cafes.\nThe Blizard Building, home to the Medical School's Institute of Cell and Molecular Science opened at the Whitechapel campus in 2005. The award-winning building was designed by Will Alsop, and is named after William Blizard, an English surgeon and founder of The London Hospital Medical College in 1785.\nThe year 2006 saw the refurbishment of The Octagon, the original library of the People's Palace dating back to 1888.\nIn 2007 parts of the School of Law – postgraduate facilities and the Centre for Commercial Law Studies – moved to premises in Lincoln's Inn Fields in central London. The Women at Queen Mary Exhibition was staged in the Octagon, marking 125 years of Westfield College and 120 years of Queen Mary College.\nIn September 2009, the world's first science education centre located within a working research laboratory opened at the Blizard Institute of Cell and Molecular Science, hoping to inspire children with school tours and interactive games and puzzles.\n2010 to present\nQueen Mary became one of the few university-level institutions to implement a requirement of the A* grade at A-Level after its introduction in 2010 on some of their most popular courses, such as Engineering, Law, and Medicine.\nFollowing on from the 2010 UK student protests, Queen Mary set fees of £9,000 per year for September 2012 entry, while also offering bursaries and scholarships.\nOn 12 March 2012 it was announced that Queen Mary would be joining the Russell Group in August 2012. Later in March, Queen Mary and the University of Warwick announced the creation of a strategic partnership, including research collaboration, joint teaching of English, history and computer science undergraduates, and the creation of eight joint post-doctoral research fellowships.\nIn January 2013, Queen Mary established the world's first professorial chair in animal replacement science.\nFrom 2014, Queen Mary began awarding its own degrees, rather than those of the University of London.\nQueen Mary became the first Russell Group university to offer Degree Apprenticeships and three years later was the first UK university to launch a social change degree,  the BSc in Chartered Manager Degree Apprenticeship.\nIn 2021, Queen Mary became the first UK university to receive the Platinum-level Engage Watermark from the National Co-ordinating Centre for Public Engagement.\nCampuses\nThe main Mile End campus contains the Faculty of Humanities and Social Sciences, the Faculty of Science and Engineering, the Queens' Building, the main college library, the student union, Draper's bar and club, several restaurants, a number of halls of residences and a gym. The educational and research sites of the Arts Research Centre, Computer Science, the large Engineering building, G.E. Fogg Building, Francis Bancroft Building, G. O. Jones Building, Joseph Priestley Building, Lock-keeper's Graduate Centre, and the Mathematical Science Building, are all located within the Mile End campus.\nThe Grade II listed Queens' Building is home to the Octagon. Built in 1887, the Octagon was originally the Queen Mary University of London library.  It was designed by architect ER Robson and inspired by the British Museum Reading Room. In 2006, \"brightly coloured leather bound books\" were restored and reinstated to the bookshelves, along with \"busts of famous literati looking down from the beautiful high domed ceiling.\"\nat QMUL's Mile End Campus]]\nThe People's Palace is home to the Grade II listed art deco style Great Hall; this has a seating capacity of over 700 and standing of 1,000.  It is complemented by 3 lecture theatres and a foyer. The night the votes were counted for the 1945 general election, the then local MP for Limehouse and Leader of the Labour Party, Clement Attlee, was present at The People's Palace, where he learned the final result and received confirmation that he had become Prime Minister. A statue of Attlee that was originally displayed outside Limehouse Library was, after its restoration, unveiled outside the Queen Mary library by Peter Mandelson in April 2011.\nThe Whitechapel campus encompasses Barts and The London School of Medicine and Dentistry, the Whitechapel Medical Library, the award-winning Blizard Institute of Cell and Molecular Science, and The Royal London Hospital.\nThe West Smithfield campus of the School of Medicine and Dentistry, the West Smithfield Medical Library, the Wolfson Institute of Preventive Medicine, the John Vane Science Centre, the Heart Centre and St Bartholomew's Hospital are based in Smithfield.\nThe Centre for Commercial Law Studies and LLM teaching and postgraduate law research activities are based in Lincoln's Inn Fields in Holborn.\nThe Malta campus, situated on the island of Gozo, is part of Barts and The London School of Medicine and Dentistry. Students taught at the Malta campus are offered the same curriculum as taught in London, for the MBBS Medicine and Medicine Foundation programmes.\nHarold Pinter Drama Studio\nThe Harold Pinter Drama Studio is the main teaching and performance space of the students and staff of the Department of Drama. On 26 April 2005, Harold Pinter, who was to win the Nobel Prize in Literature later that year, gave a public reading and was interviewed by his official authorised biographer, Michael Billington, in the studio named for Pinter and located as part of the Faculty of Arts (Department of Drama, School of English and Drama) in the Mile End campus, to celebrate its refurbishment.\nOrganisation and administration\nQueen Mary and Westfield College was established by Act of Parliament and the granting of a Royal charter in 1989, following the merger of Queen Mary College (incorporated by charter in 1934) and Westfield College (incorporated in 1933). The Charter has subsequently been revised three times: in 1995 (as a result of the merger of the college with the Barts and The London School of Medicine and Dentistry); in 2008 (as a result of the Privy Council awarding the College Degree Awarding Powers; and in July 2010 (following a governance review).\nSchools, faculties and departments\nThere are three faculties and an interdisciplinary life sciences institute. These are split further into independent schools, institutes, and departments:\n;Faculty of Humanities and Social Sciences\n* School of the Arts\n* School of Business and Management\n* School of Economics and Finance\n* School of Law\n** Centre for Commercial Law Studies\n** Department of Law\n* School of Society and Environment\n** Department of Geography and Environmental Science\n** Department of History\n** Department of Politics and International Relations\n;Faculty of Medicine and Dentistry\n* Barts and The London School of Medicine and Dentistry\n* Barts Cancer Institute\n* The Blizard Institute\n* Institute of Dentistry\n* Institute of Health Sciences Education\n* William Harvey Research Institute\n* Wolfson Institute of Preventive Medicine\n* The Centre of the Cell\n;Faculty of Science and Engineering\n* Institute of Bioengineering\n* School of Biological and Behavioural Sciences\n* School of Electronic Engineering and Computer Science\n* School of Engineering and Materials Science\n** Centre for Bioengineering\n** Centre for Sustainable Engineering\n** Centre for Intelligent Transport\n** Centre for Research in Engineering and Materials Education\n* School of Mathematical Sciences\n* School of Physics and Astronomy\n* Materials Research Institute (MRI)\n;Life Sciences Institute\n* Centre for Computational Biology\n* Centre for Genomic Health\n* Centre for Mind in Society\n* Institute of Bioengineering\nCentral administration\nQueen Mary is an 'exempt charity' under the Charities Act 1993. The Higher Education Funding Council for England has been Queen Mary's principal regulator since June 2010.\nFinances\nIn the financial year ended 31 July 2024, Queen Mary had a consolidated income (including share of joint ventures) of £722.5&nbsp;million (2022/23 – £678.8&nbsp;million) and total expenditure of £531.3&nbsp;million (2022/23 – £603.3&nbsp;million). Key sources of income included £396.8&nbsp;million from tuition fees and education contracts (2022/23 – £382.9&nbsp;million), £147.2&nbsp;million from research grants and contracts (2022/23 – £138.2&nbsp;million), £86.9&nbsp;million from funding body grants (2022/23 – £87.2&nbsp;million) and £23.7&nbsp;million from endowment and investment income (2022/23 – £16.7&nbsp;million).\nAt year end Queen Mary had endowments of £48.0&nbsp;million (2022/23 – £43.7&nbsp;million) and total net assets of £856.5&nbsp;million (2022/23 – £662.7&nbsp;million).\nQueen Mary offers several packages of bursaries and scholarships, many of which are aimed at supporting undergraduate students from low income households. In 2017/18, 5,215 students were awarded a Queen Mary Bursary worth £7,724,401, 53 students received Science and Engineering Excellence Scholarships worth £157,500 and 21 students received Economics and Finance Excellence Scholarships worth £63,000.\nAcademic profile\nThe Blizard Building, housing the Institute of Cell and Molecular Sciences\nAround 32,000 students study at the 21 academic schools and institutes, with more than 40 per cent coming from overseas, representing more than 170 different nationalities. Queen Mary awarded more than £2 million in studentships to prospective postgraduate students for the 2011/12 academic year.\nResearch\nQMUL was ranked joint ninth in the UK among multi-faculty institutions for the quality (GPA) of its research. In the 2014 Research Excellence Framework it was 20th for its Research Power, fifth in the UK for the quality of research outputs and the Linguistics department was ranked first in the UK.\nIn the UK Research Assessment Exercise results published in December 2008, Queen Mary was placed 11th according to an analysis by The Guardian newspaper and 13th according to The Times Higher Education Supplement, out of the 132 institutions submitted for the exercise. The Times Higher commented \"the biggest star among the research-intensive institutions was Queen Mary, University of London, which went from 48th in 2001 to 13th in the 2008 Times Higher Education table, up 35 places.\"\nSince 2007 Queen Mary University of London's Centre for Digital Music develops the free and open source software Sonic Visualizer for audio analysis, in particular for analyzing audio spectrograms. With more than 100,000 downloads, it is the most famous software for its category.\nThe QS World University Rankings 2019 ranked Queen Mary third in the world for research citations for the subject of medicine.\nThe growth and strength of research at the college was rewarded with an invitation to join the Russell Group of research-intensive universities in the UK in 2012.\nThe university is also a member of the Screen Studies Group, London. Other research highlights include an international team of scientists, led by astronomers at Queen Mary, discovering a planet orbiting Proxima Centauri, the closest star to the Solar System. In 2018, a project involving Queen Mary researchers reached its goal of sequencing 100,000 whole genomes from National Health Service patients.\nDiscoveries\nQueen Mary University of London released the AMIGOS dataset, which contains neuro-physiological data of individuals and can be utilized for scientific reasons, to investigate human emotions.\nThe AMIGOS dataset has been used in hundreds of scientific studies on signal processing.\nLibraries\nQueen Mary's main library is located on the Mile End campus where most subjects are represented. It also has two medical libraries in Whitechapel and West Smithfield. Usual opening hours are 8am to midnight. Since September 2017, the Mile End Library has been open 24 hours a day, 7 days a week during term time (including bank holidays).\nAs members of a college of the University of London, students at Queen Mary have access to Senate House Library, shared by other colleges such as King's College London and University College London, in addition to library access throughout most of the individual University of London colleges, subject to approval at the given University.\nPartnerships\nQueen Mary offers a joint degree programme with Beijing University of Posts and Telecommunications. The first of its kind to be approved by the PRC Ministry of Education, it is taught 50% by each institution in English, with staff from Queen Mary teaching part of the programme in Beijing. Students graduate with a dual Bachelor of Science degree in Engineering, meaning they receive two separate degrees, one from each university. The programmes are in Telecommunications and Management and Ecommerce Engineering and Law. More than 9,600 students have graduated from the programme in the past 20 years. In 2020 Queen Mary-BUPT opened a new Joint Teaching and Learning Centre that promotes excellence in teaching and learning as well as best practices for Transnational Education. And in 2022 the QMUL-BUPT School Hainan was launched, bringing innovative teaching methodologies from the two universities to Hainan, China.\nQueen Mary collaborated with Royal Holloway to help run programmes at the University of London Institute in Paris (ULIP) which is a central academic body of the University of London located in Paris, France, enabling undergraduate and graduate students to study University of London ratified French Studies degrees in France. From September 2016, Queen Mary took over the functions provided by Royal Holloway and all students are now considered registered students of Queen Mary.\nQueen Mary provides academic guidance for the Global Master of Business Administration degree offered by the University of London's distance learning.\nQueen Mary is a founding partner in UCLPartners, an academic health science centre located in London. Queen Mary joined UCLPartners in 2011.\nRankings and reputation\nperformance over the past ten years]]\nNational\nIn the 2021 Research Excellence Framework (REF), which assesses the quality of research in UK higher education institutions, Queen Mary is ranked 19th by GPA and 21st for research power (the grade point average score of a university, multiplied by the full-time equivalent number of researchers submitted).\nThe Complete University Guide 2026 ranks Queen Mary 41st overall and 16th for Research Quality. According to The Times and Sunday Times University League Table 2025, Queen Mary ranks 39th overall and 17th for Research Quality in the UK.\nInternational\nU.S. News & World Report 2025-26 ranked Queen Mary as 94th in the world. Similarly, QS World University Rankings 2026 ranked Queen Mary as 110th in the world. Times Higher Education World University Rankings 2025 ranked Queen Mary 141st in the world. Academic Ranking of World Universities 2024 ranks Queen Mary between 201 and 300 in the world. The university was ranked 395th in the world in the CWTS Leiden Ranking 2024.\nQueen Mary ranks 9th in the U.S. News & World Report Best Global Universities in the United Kingdom, and 4th in London. In Times Higher Education Best universities in the UK 2025, it has been ranked 17th.\nQueen Mary was ranked 118th in Europe in the CWTS Leiden Ranking 2024. The university was ranked 30th in the 2025-26 U.S. News & World Report Best Global Universities in Europe. 2017 Times Higher Education ranked Queen Mary 60th among European universities.\nSubject specific\nThe Guardian University league tables 2025 ranks Queen Mary 9th in the UK for Media & Film Studies, 24th for Medicine, 9th for Dentistry, 20th for General Engineering and 12th for Law.\nIn 2026, QS World University Rankings ranked both the subjects of Law and Legal studies, and English Literature and Language 42nd in the world, with the subjects of Politics, Mathematics, History, Linguistics and Medicine all ranking in the top 100.\nAdmissions\n{| class=\"floatright\"\n|\n{| class=\"wikitable\" style=\"font-size:85%; text-align:center; margin-bottom: 5px\"\n|+UCAS Admission Statistics\n!\n!2024\n!2023\n!2022\n!2021\n!2020\n|-\n| Applications\n| 42,475\n| 41,155\n| 41,820\n| 37,695\n| 34,340\n|-\n| Accepted\n| 4,785\n| 4,805\n| 5,575\n| 6,385\n| 5,485\n|-\n| Applications/Accepted Ratio\n| 8.9\n| 8.6\n| 7.5\n| 5.9\n| 6.3\n|-\n| Offer Rate (%)\n| 64.5\n| 61.4\n| 61.4\n| 64.5\n| 64.6\n|-\n| Average Entry Tariff\n|\n|\n| 154\n| 151\n| 145\n|}\n{| style=\"font-size:80%;float:left\"\n|\n}}\n|}\n|}\n{| class=\"wikitable floatright sortable collapsible mw-collapsible\"; style=\"font-size:85%; text-align:right;\"\n|+ class=\"nowrap\" |HESA Student Body Composition (2023/24)\n|-\n!Domicile and Ethnicity\n! colspan=\"2\" data-sort-type=number |Total\n|-\n|British White\n|align=right|\n|-\n|British Ethnic Minorities\n|align=right|\n|-\n|International EU\n|align=right|\n|-\n|International Non-EU\n|align=right|\n|-\n! colspan=\"4\" data-sort-type=number |Undergraduate Widening Participation Indicators\n|-\n|Female\n|align=right|\n|-\n|Independent School\n|align=right|\n|-\n|Low Participation Areas\n|align=right|\n|}\nIn terms of average UCAS points of entrants, Queen Mary ranked 32nd in Britain in 2014. The university gives offers of admission to 75.0% of its applicants, the 12th lowest among the Russell Group.\nAccording to the 2017 Times and Sunday Times Good University Guide, approximately 12% of Queen Mary's undergraduates come from independent schools. In the 2016–17 academic year, the university had a domicile breakdown of 68:10:22 of UK:EU:non-EU students respectively with a female to male ratio of 54:46.\nStudent life\nQueen Mary Students' Union\n'''Queen Mary Students' Union (QMSU''') unites the various clubs and societies of Queen Mary. The union is based at the recently refurbished Students' Hub. The union mascot is a leopard called Mary. The Students' Union is led by 6 elected executive officers, with the President for 2025-26, being Diya Mary Selastin. The union has a sub-division to represent students studying at Barts and The London School of Medicine and Dentistry, called Barts and The London Students' Association.\n;SU facilities and publications\n# Qmotion (Gym/Fitness Centre)\n# Drapers Bar\n# Ground\n# The Learning Cafe\n# Infusion Shop\n# The Print (newspaper)\n# CUB (magazine)\n# Quest (radio)\n# Queen Mary Theatre Company\n# QMTV (television)\n# Students' Union Hub\nThe Students' Union Hub replaces the previous office called the Blomley Centre. It is named after a former president and VP Education, Laura Blomeley, who completed her term in office with terminal cancer. In remembrance of her commitment to QMSU, two key rooms in the new Students' Union Hub have been named after her.\nSports\nThe Merger Cup is a series of annual sporting fixtures played between Queen Mary and Barts and The London (BL) sports clubs. The event has taken place since the merger of the two institutions in 1995.\nThe results of a number of matches normally played on the same day are combined to determine the overall winner. Sporting fixtures include badminton, basketball, football, hockey, netball, rugby, squash, swimming, tennis and rowing.\nIn recent times Queen Mary have won the cup in 2005, 2006, 2007 and 2008. 2009 saw the cup return to the medical school with a 9–7 victory over Queen Mary, but a close 10–9 win brought it back to Queen Mary in 2010. In 2011, Barts and The London were Merger Cup winners. In 2012 QM won with a 15–7 defeat of BL, QM were also victorious in 2013.  In 2014 Barts dominated 29–24, winning most major sports in the process. In 2016, Barts won against Queen Mary 67–37.\nThe university has an alumni football club, Queen Mary College Old Boys FC, which was founded in 1989 and maintains close links with university. The club has three teams and competes in the Amateur Football Combination  The club's 1st XI won four league titles in five seasons, including two league and London Old Boys Cup doubles\nStudent housing\nMany Queen Mary students are accommodated in the college's own halls of residence or other accommodation; students are also eligible to apply for places in the University of London intercollegiate halls of residence, such as Connaught Hall.\nMost students in college or university accommodation are first-year undergraduates or international students. The majority of second and third-year students and postgraduates find their own accommodation in the private sector.\nUndergraduate\nFeilden House with The Curve restaurant beneath, located in the centre of Westfield Student Village\nPooley House, the largest campus building, on the edge of Regent's Canal\nThe college's Westfield Student Village, situated in the north-east corner of the Mile End Campus, has en-suite, self-catering housing for 1,195 students, staff and academic visitors in six contemporary buildings. A shop, laundrette, café bar, 200-seat restaurant and central reception (staffed 24 hours a day), and a communal area situated adjacent to the Regents canal, form part of the Village development. Rooms are arranged in flats and maisonettes housing between four and eleven students.\nUndergraduate student housing at Queen Mary includes:\n* Albert Stern House – Located next to Ifor Evans at the western end of the main Queen Mary campus.\n* Beaumont Court – Housing for 167 first year, associate and foundation students in maisonettes and flats. Located opposite Sir France House and adjacent to Creed Court.\n* Sir Christopher France House – Situated on the bank of the Regents canal, flats in this building have full en-suite facilities.\n* Creed Court – Housing for 124 postgraduate students in 10 maisonettes and 12 flats. Located opposite Sir France House and adjacent to Beaumont Court.\n* Ifor Evans – Located at the western end of the campus.\n* Lindop House – A residential development situated directly opposite the Queens' Building. Housing for 74 first year undergraduate, mostly medics, and foundation students in single rooms in 11 six-person flats and 2 four-person flats.\n* Maurice Court – containing 12 maisonettes and 18 flats for up to 173 first year students. Located at the rear of Creed and Beaumont Courts and very close to Mile End Hospital.\n* Maynard & Varey Houses – Two buildings housing 200 first year undergraduate, associate and foundation students. Situated in Westfield Way at the eastern end of the Mile End campus directly opposite the college's Chemistry and IT Resource Centre.\n* Pooley House – Located at the far end of the campus, providing housing for 378 first year, associate and foundation students in 48 flats. The largest building in the village development.\n* Richard Feilden House – Housing for 200 first year, associate and foundation students. The Curve, a 200-seat restaurant is situated on the ground floor. Opened in 2007, it is the newest dwelling in the Village and is situated opposite the Joseph Priestley Building.\nPostgraduate\nPostgraduate student housing at Queen Mary includes:\n* Chapman, Chesney and Selincourt – Four residences situated in Westfield Way, at the eastern end of the Mile End campus adjacent to the Regents Canal. 94 single en-suite rooms for final year undergraduate and new postgraduate students\n* Dawson Hall – Located near Barbican tube station in the City of London and set around lawns and trees on the college's Charterhouse campus, close to St Bartholomew's Hospital. Provides single rooms for 207 medical and dental students and medical based postgraduates.\n* Floyer House – Houses 145 medical and dental students and medical based postgraduates, located close to The London Hospital and Dental Institute at the college's Whitechapel campus.\nEquality, diversity and inclusion\nStudents from more than 170 nationalities attend Queen Mary, approximately 41% of them from overseas. According to The Times' Good University Guide, in 2021–2, 77% of Queen Mary students came from a black or ethnic minority background; this is the highest proportion of any university in the Russell Group and in the top 5 of any UK institution of higher education. The Times also cites QM as having one of the narrowest (i.e. best) black achievement gaps among UK institutions.\nIn 2008, in recognition of the institution's commitment to advancing gender equality and diversity, the university achieved an Athena SWAN bronze award. This was elevated to a silver award in 2017, and the accreditation was renewed in 2022.\nIn 2019, Queen Mary's Diversity and Inclusion Manager resigned, citing a \"tick-box mentality\" to equality, diversity and inclusion, as well as a \"toxic\" working environment that prioritised accolades over meaningful improvement; the departing manager further declared that Queen Mary was \"institutionally racist.\" Other academics have raised grievances regarding incidents of racism. In January 2020, a former lecturer who had brought the university to an employment tribunal for direct racial and gender discrimination and harassment as a continuing act had her case dismissed on the basis that the alleged incidents had occurred after statutory time limits had expired.\nQueen Mary's UCU branch established an anti-racism working group in 2020 to “focus attention on institutional racism at Queen Mary University of London, but also to address questions of equality and diversity within the Union itself.”\nQMUL and Leopold II of Belgium\nIn 2016, the university authorities removed plaques commemorating two visits by Leopold II of Belgium to the university site in 1887.  Leopold, a cousin of Queen Victoria, had no links to Queen Mary other than a visit in April 1887 to Mile End and a subsequent visit in June 1887 to lay the foundation stone of the Octagon library, where the plaques were sited. The brutal and exploitative nature of Leopold's rule over the Congo Free State between 1885 and 1908, and his commemoration at Queen Mary, came under renewed scrutiny as of institutional links with colonial repression were re-evaluated in the wake of the global attention paid to the Rhodes Must Fall campaign. However, the suitability of any commemoration of Leopold on university property had been raised as early as 2013. In June 2016, the university's Pan-African society launched a petition for the removal of the plaques that celebrated a “genocidal colonialist” and were offensive to students from ethnic minority backgrounds. The society argued that their removal would help those students feel more “welcome, respected and integrated”. By December 2016, the plaques had been removed from public view \"as part of ongoing refurbishment work.” This attracted criticism from academics at other institutions who called the decision a \"whitewashing\" of history that \"suggests a fear within the university authorities... of attracting negative attention.\"\nUCU Strikes and Snitch Forms\nIn 2022, as part of ongoing national strikes by the University and College Union, more than 100 staff at Queen Mary University of London taking part in a national marking boycott were withheld 100% of their wages for 21 days. Several other universities had threatened to dock full pay for action short of a strike, however Queen Mary University of London was the only institution to follow through on the threat. This led to the university being branded the worst university employer in the UK.\nIn the 2022/23 academic year, while strike action was continuing, the university continued to crack down and became the first university in the UK to implement a 'student snitch form'. Students were encouraged to report striking staff, with threats of docking 39 days pay for those who did not reschedule missed teaching. Several senior academics resigned from the university in response to this action, citing a lack of trust leading to unbearable working conditions. Throughout this process, students and staff were sent very different messages in email updates by principal Colin Bailey, leading to increased division within the university.\nNotable people\nNotable alumni\nFile:Student_photograph_of_Davidson_Nicol.jpg|Davidson Nicol, Former Under-Secretary-General of the United Nations\nFile:Simon Case (cropped).jpg|Simon Case, 13th Cabinet Secretary\nFile:Guðni Th. Jóhannesson (2017-03-30).jpg|Guðni Th. Jóhannesson, 6th President of Iceland\nFile:Tigran Avinyan, May 2019.jpg|Tigran Avinyan, Deputy Prime Minister of Armenia\nFile:Peter Caruana portrait.jpg|Peter Caruana, fifth Chief Minister of Gibraltar\nFile:Professor Peter Mathieson 2015.jpg|Peter Mathieson, Vice-Chancellor and Principal of theUniversity of Edinburgh\nFile:Official portrait of Lord Woolley of Woodford.jpg|Simon Woolley, Principal of Homerton College, Cambridge\nFile:BaronessRoyallPortrait.jpg|Janet Royall, Principal of Somerville College, Oxford\nFile:Nicholas Burns, U.S. Ambassador.jpg|Nicholas Burns, 13th United States Ambassador to China\nFile:Peter Hain Ministerial portrait.jpg|Peter Hain, former Leader of the House of Commons\nFile:Jane Hill Downing Street reception 2011 cropped.jpg|Jane Hill, BBC News presenter\nFile:Jay Sean USC.jpg|Jay Sean,  singer, songwriter, record producer\nFile:Dr. Ibilola Amao photo.jpg|Ibilola Amao, engineer\nNotable academics\nFile:Richard-owen2.jpg|Sir Richard Owen, British biologist, comparative anatomist and paleontologist\nFile:Lorna Casselton (cropped).jpg|Lorna Casselton, British professor of genetics, Vice-President of the Royal Society.\nFile:Official portrait of Lord Hennessy of Nympsfield crop 2, 2019.jpg|Lord Peter Hennessy, British contemporary and constitutional historian, author and broadcaster.\nFile:Professor Miri Rubin.jpg|Miri Rubin, Israeli historian of early modern and medieval Europe, author.\nFile:Tristram Hunt 2015.jpg|Tristram Hunt, British cultural historian, Labour MP, Director of the Victoria & Albert Museum.\nNobel laureates\nTo date, nine Nobel laureates have been either students, or academics, at Queen Mary and its historically preceding institutions.\n{| class=\"wikitable\" style=\"float: center; border: 5px solid #BBB; margin: .96em 0 0 .9em;\"\n|-\n!colspan=2 |Name\n!Institutional role\n!Prize\n!Year\n!Rationale\n|-\n|\n|Sir Ronald Ross\n|Student at St Bartholomew's Hospital Medical College (1874-1880).\n|Physiology or Medicine\n|\n|For discovering the life-cycle of the malarial parasite Plasmodium\n|-\n|\n|Edgar Adrian\n| Undertook clinical work at St Bartholomew's Hospital Medical College during the First World War.\n|Physiology or Medicine\n|\n|For his work on the function of neurons\n|-\n|\n|Sir Henry Hallett Dale\n|Undertook clinical training at St Bartholomew's Hospital Medical College (1900-1902).\n|Physiology or Medicine\n|\n|For his discoveries relating to the chemical transmission of nerve impulses\n|-\n|\n|Sir John Vane\n|Founded the William Harvey Research Institute at St Bartholomew's Hospital Medical College (1986).\n|Physiology or Medicine\n|\n|For his work on prostaglandins\n|-\n|\n|Sir Joseph Rotblat\n|Professor of Physics at St Bartholomew's Hospital Medical College (1950-1976).\n|Peace\n|\n|For his lifelong devotion to nuclear abolition\n|-\n|\n|Sir Peter Mansfield\n|BSc (1959) and PhD (1962) in physics from Queen Mary's College.\n|Physiology or Medicine\n|\n|For his pioneering work on Magnetic Resonance Imaging as a diagnostic technique\n|-\n|\n|Sir Charles K. Kao\n|Visiting associate at Queen Mary's College (1969), later an Honorary Fellow of QMUL (2008).\n|Physics\n|2009\n|For his achievements concerning the transmission of light in fibres for optical communication\n|-\n|\n|Mario Vargas Llosa\n|Formerly a visiting professor at Queen Mary's College, and later an Honorary Fellow (1988).\n|Literature\n|\n|\"For his cartography of structures of power and his trenchant images of the individual's resistance, revolt, and defeat\"\n|-\n|\n| Sir Peter John Ratcliffe\n| Completed MBBChir at St Bartholomew's Hospital Medical College (1978).\n| Physiology or Medicine\n| 2019\n| For the discovery of how cells sense and adapt to oxygen availability\n|}\nPrincipals\nTo date, Queen Mary has had a total of 22 principals (11 of Westfield College, eight of Queen Mary College, and three since the merger of Queen Mary, Westfield, Barts, and The London).\nThe current principal is Colin Bailey, a structural engineer, who became Principal in September 2017.\nSee also\n* Armorial of UK universities\n* Biodiversity Impact Credit, biometric developed by Queen Mary University\n* List of universities in the UK\nNotes\nReferences\n}}\nBibliography\n*\nExternal links\n*\n* [https://www.qmsu.org/ Queen Mary Students' Union website]\n}}"
    }
  ]
}