{
  "content": [
    {
      "type": "text",
      "text": "# Queen Elizabeth Hotel\n\nMontreal, QuebecH3B 4A5\n| coordinates           =\n| opening_date          = April 15, 1958\n| closing_date          =\n| developer             =\n| architect             =\n| operator              = Fairmont Hotels and Resorts\n| owner                 = Ivanhoé Cambridge\n| number_of_restaurants = 2\n| number_of_suites      = 100\n| floor_area            =\n| floors                = 21\n| number_of_rooms       = 950\n| parking               =\n| website               =\n| footnotes             =\n}}\nFairmont The Queen Elizabeth () is a historic grand hotel in Montreal, Quebec, Canada. With 950 rooms and 21 floors it is the largest hotel in Quebec, and the second largest Fairmont hotel in Canada after the Fairmont Royal York in Toronto. Located at 900 René Lévesque Boulevard West, in Downtown Montreal, it is connected to Central Station and to the underground city. The hotel is known for being the location for John Lennon and Yoko Ono recording \"Give Peace a Chance\" in Room 1742 during their 1969 anti-war Bed-In.\nHistory\nThe Queen Elizabeth () opened on April 15, 1958. The hotel was built and owned by the Canadian National Railway and operated by Hilton Hotels International, though it was never branded as a Hilton.\nCanadian National Railway selected leading architects and designers to give the interior decoration a \"New France\" theme, using Quebec handicrafts. The artists included Albert Edward Cloutier (carved wooden panels), Jean Dallaire (wall hanging), Marius Plamondon (stained glass mural), Claude Vermette (ceramic tiles) and Julien Hébert (bronze elevator doors). Cloutier painted a mural for the main dining room of the Salle Bonaventure in the hotel.\nThere was controversy over naming the hotel: Quebec nationalists wanted it called Château Maisonneuve in honour of Montreal's founder, Paul Chomedey de Maisonneuve. CN's president, Donald Gordon, insisted it be named for the queen, who had unexpectedly come to the throne in 1952 while the hotel was still on the drawing board.\n, Yoko Ono, and guests, including Timothy Leary (foreground), recorded \"Give Peace a Chance\" in Room 1742 on June 1, 1969]]\nMany famous guests have stayed there, including Queen Elizabeth II (four times) and the Duke of Edinburgh, Queen Elizabeth the Queen Mother, King Charles III, Fidel Castro, who was the first head of state to visit the hotel, Charles de Gaulle, and Princess Grace of Monaco, during Expo '67, Indira Gandhi, Jacques Chirac, Nelson Mandela, the Dalai Lama, Sadiq Raji, Mikhail Gorbachev, Jimmy Carter, Henry Kissinger, Perry Como, Joan Crawford, John Travolta, Mikhail Baryshnikov, and George W. Bush.\nThe hotel reached worldwide fame when John Lennon and Yoko Ono, who had been refused entry into the United States, conducted their Bed-In in Room 1742 at the hotel between May 26 and June 2, 1969. \"Give Peace a Chance\" was recorded in this room on June 1 by André Perry. This song is the first solo single issued by Lennon and became an anthem of the American anti-war movement during the 1970s. It peaked at #14 on the Billboard Hot 100 and #2 on the British singles chart.\nThe NHL Entry Draft was also held at the hotel ten times between 1963 and 1979.\nIn 1970, the Government of Quebec moved its centre of operations into the Queen Elizabeth in the midst of the October Crisis.\nCN Hotels assumed direct management of the hotel on January 1, 1984, when the contract with Hilton ended. CN Hotels was sold to Canadian Pacific Hotels in 1988. In 2001, Canadian Pacific Hotels was rebranded as Fairmont Hotels and Resorts, following their purchase of that smaller chain. The hotel was renamed Fairmont The Queen Elizabeth.\nIn 2010, six doormen of the hotel were arrested on charges of racketeering and extortion.\nFrom June 17, 2016, to July 10, 2017, the hotel was closed for a  renovation.\nSee also\n* Royal eponyms in Canada\nReferences\nExternal links\n*"
    }
  ]
}