{
  "content": [
    {
      "type": "text",
      "text": "# Queen (1773 ship)\n\n{|\n| Ship name = Queen\n| Ship owner =\n| Ship operator =\n| Ship ordered =\n| Ship builder =\n| Ship original cost =\n| Ship laid down =\n| Ship launched = 1773\n| Ship acquired =\n| Ship commissioned =\n| Ship decommissioned =\n| Ship in service =\n| Ship out of service =\n| Ship renamed =\n| Ship struck =\n| Ship reinstated =\n| Ship honours =\n| Ship honors =\n| Ship captured =\n| Ship fate = Foundered December 1796\n| Ship notes =\n}}\n|}\nQueen was a three-decker sailing ship built in 1773 at Georgia in the United States.\nCareer\nIn 1791 her ownership changed to Calvert & Co., a company that had several vessels carrying convicts, trading with the East Indies under contract to the British East India Company (EIC), and in the South Seas Whale Fisheries.\nQueen transported convicts in 1791 from England to Australia as part of the third fleet. Under the command of Richard Owen, she sailed from Cork, Ireland, on 10 April 1791 and arrived in Port Jackson, New South Wales on 26 September 1791. She embarked 133 male and 22 female convicts, of whom seven male convicts died during the voyage. Queen transported the first contingent of Irish convicts to Australia. The New South Wales Corps provided the guard.\nAfter delivering her convicts, Queen sailed to Bengal, but her departure date from Port Jackson is currently unknown. In Bengal she picked up a cargo of cotton for the EIC.\nQueen finally returned to England on 6 February 1793, having been gone for two years and four months. The Times : The Queen was in a leaky state and her crew were reported to all dead (except eight or nine) and those very ill from scurvy. She did not touch at the Cape of Good Hope nor at St. Helena, to which the violent disorder of the scurvy is attributed. Only six men could come up on deck when she came in. Had the wind been unfavourable, they may have all perished.\nOn 3 July 1793 Richard Owen received a letter of marque for Queen. By late 1793-early 1794 Queen was sailing between London and Antigua, and armed with ten 9-pounder guns.\nIn 1794 a French squadron of three frigates captured Queen, Owen, master, sailing from San Domingo to London, and Donna Maria, Smitheam, master, from New Orleans, but a British squadron under Captain John Borlase Warren, in , recaptured them both. The recapture took place on 27 August. In mentioning the two vessels, Warren described Queen as coming from Jamaica, and the brig Mary, from New Orleans to London, as carrying a cargo of furs, indigo, and so forth.\nFate\nQueen is listed in Lloyd's Register in 1797 with R. Colley, master. However, Lloyd's List reported that the \"Queen (transport), from the West Indies, foundered the 30th December in a Gale.— People saved\".\nNotes\nCitations\nReferences\n*\nExternal links\n*[http://members.iinet.net.au/~perthdps/convicts/shipNSW1.html Convicts and Convict Ships Sent to Port Jackson NSW 1787-1800]"
    }
  ]
}