{
  "content": [
    {
      "type": "text",
      "text": "# Queen of Hearts (building)\n\n| image               = Bulgaria-Balchik-02.jpg\n| alt                 =\n| caption             = Queen of Hearts\n| former_names        =\n| alternate_names     =\n| map_type            =\n| map_alt             =\n| map_caption         =\n| building_type       = hotel\n| architectural_style =\n| structural_system   =\n| cost                =\n| location            = Balchik, Bulgaria\n| client              =\n| owner               =\n| current_tenants     =\n| landlord            =\n| coordinates         =\n| altitude            =\n| start_date          =\n| completion_date     = 1871\n| inauguration_date   =\n| demolition_date     =\n| height              =\n| diameter            =\n| other_dimensions    =\n| floor_count         =\n| floor_area          =\n| main_contractor     =\n| architect           =\n| structural_engineer =\n| services_engineer   =\n| civil_engineer      =\n| other_designers     =\n| quantity_surveyor   =\n| awards              =\n| url                 =\n| references          =\n}}\nThe Queen of Hearts or Dama Kupa () is a historic building and former hotel in the Black Sea resort town of Balchik, Dobrich Province, northeastern Bulgaria.\nThe Queen of Hearts was finished in 1871 and its architecture includes Neo-Baroque and Neo-Gothic features. Its façade was constructed out of local white Balchik limestone, with lead elements incorporated for stability. The cast shutters with bronze ornaments are a highlight of the exterior decoration.\nUpon its completion, the fourt-storey Queen of Hearts edifice was the tallest building between Varna and Constanța, as well as the tallest residential building in all of Bulgaria before the Liberation in 1878. It was designed as a hotel with a piano lounge and it served as a hotel for many years. For some time, its name was the Silver Coast Hotel (, Srebrist bryag), inspired by the nickname of the scenic Black Sea coastline between Balchik and Kavarna.\nA legend ties the name of the building to a Greek noble from Constantinople. Allegedly, he who won a fortune in a cards game by betting on the queen of hearts and invested in a European-style hotel in the then bustling oriental port town of Balchik, only to lose the investment in another bet. Another explanation for the building's name is that its owner had the family name Kupov.\nThe Queen of Hearts building is protected as a monument of Bulgarian culture. It is currently owned by the Balchik municipality and houses the municipal department of agriculture.\nGallery\nFile:Queen of Hearts Balchik 1.jpg\nFile:Queen of Hearts Balchik 2.jpg\nFile:Queen of Hearts Balchik 3.jpg\nReferences"
    }
  ]
}