{
  "content": [
    {
      "type": "text",
      "text": "# Queen's Cross\n\nwith Queen's Cross Church in background]]\n'''Queen's Cross''' is an area in the West End of Aberdeen, Scotland. It is located just west of the main thoroughfare of Union Street and about  from the geographical town centre at Mercat Cross.\nQueen's Cross itself is the intersection of Fountainhall Road, Queen's Road, St Swithin Street, Albyn Place and Carden Place, where there is a roundabout with Queen Victoria's bronze statue in the middle. The statue of Queen Victoria at Queen's Cross, marks the beginning of Aberdeen's West End. The statue itself was originally located on St Nicolas Street, and was moved to its present location in 1964 (when what is now Marks and Spencer was built). The statue replaced an Alexander Brodie marble statue of 1866 (now within the Town House). It was erected by the Royal Tradesmen of the city to commemorate Her Majesty's Jubilee. The statue was originally to have been marble, sculpted by Pittendreigh Macgillivray, ARSA, however this plan was not executed. Granite was the next possibility, but the statue was considered too small and delicate for this material. Finally a bronze was ordered from C. B. Birch, ARA, who had produced a marble statue of Queen Victoria for the Maharajah of Oodypore. The statue faces west, looking up Queen's Road towards Balmoral, the Queen's summer residence.\nThere are two Church of Scotland churches at the intersection; Queen's Cross Church and Rubislaw Church, and also St Joseph's Primary School.\nThere was a tram depot at Queen's Cross. The building was purchased by Grampian Television in 1960 and converted into their television studios and headquarters. In 2003 Grampian Television relocated their studios and offices to new premises in West Tullos; the former tram depot was subsequently demolished by 2004 with new flats built on the site.\nThe surrounding buildings and their streets are typical of the Victorian period in which they were built. They are built of the local gray granite.\nThe Queen's Cross area, particularly Queen's Road and Albyn Place, is home to the offices of many finance businesses who have moved into the old Victorian mansion houses. There are also a number of exclusive restaurants and bars in the area.\nThis area is considered by many in the local area as the centre point of the West End of Aberdeen.\nReferences"
    }
  ]
}