{
  "content": [
    {
      "type": "text",
      "text": "# Queen's Pier\n\n}}\n'''Queen's Pier''', named after Queen Victoria, was a public pier in front of City Hall in Edinburgh Place, Central, Hong Kong. For three generations it served not only as a public pier in day-to-day use but also as a major ceremonial arrival and departure point. The pier witnessed the official arrival in Hong Kong of all of Hong Kong's governors since 1925; Elizabeth II landed there in 1975, as did the Prince and Princess of Wales in 1989.\nThe second and final pier structure, built along the newly reclaimed waterfront, was designed in a modern utilitarian style and was opened by Maurine Grantham, wife of Governor Alexander Grantham, in June 1954.\nOn 26 April 2007, the pier was closed by the government to enable land reclamation, soon after the adjacent Star Ferry pier was closed. There was fierce opposition by conservationists, who carried over their campaign to preserve the landmark. Police officers evicted some 30 protesters from the site on 1 August 2007; activists filed for a judicial review, and the High Court hearing began on 7 August. On 10 August, the court dismissed the request.\nFinally, the Queen's Pier was completely demolished in February 2008. Its base piles were also removed in March 2008. In 2008, the government's attempts, post dismantling, to create the appearance of public support for reassembling the pier at the new waterfront were criticised by conservationists.\nHistory\nFull length of Queen's Pier, c.1930\nA former wooden pier at the site known as \"Queen's Statue Wharf\" was replaced in 1925. It was a ceremonial landing area for the British royal family visiting Hong Kong, and for successive governors to assert their authority on arrival. The first governor to land there was Cecil Clementi, in November 1925. The preceding governor, Reginald Stubbs, boarded the Victoria from the pier at the end of his term on 31 October 1925.\n1925 pier\n's inauguration in 1925]]\nThe 1925 pier was originally named \"Statue Pier\", but was renamed \"Queen's Pier\" in honour of Queen Victoria on 31 July 1924. It was a sheltered pier made of concrete and steel, with round pillars and arches, built on the site of the present Mandarin Oriental Hotel at a cost of HK$20,000. Intended to be opened in time for the arrival of Edward, the Prince of Wales, construction delays postponed its completion until October 1925. It was demolished in January 1955.\n1954 pier\nAs part of post-war reclamation, the old pier was demolished. Work commenced in February 1954 on a new pier on the new waterfront designed in a modern utilitarian style. The structure was described as a U-shaped plan, with an open-sided superstructure. It consisted of tiled reinforced concrete base and pillars, and was modelled after previous piers in the area. Its flat roof was also made of concrete, topped with bitumen waterproofing. Five sets of stairs allowed boat passengers to board and disembark, three located on the north side, one on the east and one on the west.\nThe pier was considered \"an integral part\" of the ceremonial cluster including City Hall and Edinburgh Place which was being formed at the time, and the entrance to the City Hall formed an axis with the Pier to lend a sense of occasion to visiting dignitaries. The secondary design goal was to maximise public access to the very limited open space in Central in contrast with the city bustle.\nThe pier was opened by Lady Maurine Grantham, wife of Governor Sir Alexander Grantham, on 28 June 1954.\nFunction\nThe pier's primary role was ceremonial. It was the traditional landing place of successive governors, who would arrive at Central on board the official Governor's Yacht which would dock at Queen's Pier. From the 1960s, governors would inspect a guard of honour at Edinburgh Place, followed by the swearing-in at City Hall.\nHM The Queen landed there on 4 May 1975 on her first visit, after arriving by plane at Kai Tak Airport. The Prince and Princess of Wales landed there in November 1989.\nThe pier's secondary role was as a public pier, where pleasure craft were allowed to dock. Tour boats offering a view of the Kowloon side of the harbour used the pier for passenger boarding. Up to 1978, it was the finishing line for the annual cross-harbour swimming race. As the ceremonies declined, the pier's secondary purpose became the main one: people met and strolled in the area, and others fished.\nOn 26 April 2007, the pier was closed in order to facilitate land reclamation in Central.\nDemolition\nOld Star Ferry Pier (front left) and Queen's Pier (front right) in 2005. The new pier (background left) is now in full operation.]]\nFrom the outset, the fate of the pier has been intimately linked with the Central Reclamation project which was unveiled in 1989 but not explicitly spelled out as such. However, the scale of reclamations has only been slightly cut back following significant legal battles.\nIn conjunction with the proposed demolition of the Queen’s Pier and the adjacent Edinburgh Place Ferry Pier necessitated by Phase III of the Central Reclamation project, the Antiquities and Monuments Office (AMO) commissioned a heritage impacts survey in 2001. The Antiquities Advisory Board (AAB), in two separate meetings in March 2002 and December 2006, reached the same view of not raising objections as to the demolition of the Queen’s Pier. Instead, the Board asked the Government to preserve relics of the Queen’s Pier for reconstruction on the reclaimed harbourfront.\nGovernment position\nFollowing the controversy and the demolition of the Star Ferry Pier in Edinburgh Place in early 2007, activists declared Queen's Pier the next battleground against the conservation policy of the Government of Hong Kong. The criticism received over its handling of the Star Ferry Pier caused Michael Suen, the Secretary for Housing, Planning and Lands, to propose a piece-by-piece relocation of the pier to a new location on the reclaimed waterfront during a Legco session on 21 March 2007. The Government later unveiled four design options for such relocation. The intended closure of the pier was 26 April 2007.\nAt the end of January 2007, the government declared it would postpone the demolition of Queen's Pier until a consensus could be reached on the course of action; consultations with the Hong Kong Institute of Architects, the Hong Kong Institute of Engineers, and the Conservancy Association were held. The Institute of Architects, whose members opposed dismantling the pier, originally maintained that the pier should remain untouched. However, it was reported that after meeting the government, the Institute and the Conservancy Association were persuaded by the government that the pier could first be dismantled, and then reassembled at another location after completion of the reclamation. This change of heart was heavily criticised by Winston Chu, founder of the Society for Protection of the Harbour. The HKIA clarified that their opposition had not in fact changed.\nChief Executive Donald Tsang said that being overzealous in saving the past may hurt Hong Kong's competitiveness, and called on activists to take a more balanced view toward economic growth and conservation. Soon after Tsang's re-election as Chief Executive, on 26 March, the Government pressed ahead with plans to dismantle and move the entire pier, piece by piece, enabling the reclamation to go ahead.\nThe government said that the in-situ preservation, though apparently viable on paper, would risk irreversible damage to the pier. Furthermore, it argued that important underground facilities such as the Airport Railway Extended Overrun Tunnel would be affected, saying a natural curvature of the track was required. \"Setting aside the technical difficulties and the huge risk involved in the works, underpinning for the construction of the extended overrun tunnel would cost about HK$500&nbsp;million and take more than two years to complete\".\nAppearing before a public forum at the pier on 29 July, Secretary for Development Carrie Lam Cheng Yuet-ngor repeated the government's insistence that keeping the pier was not an option. She said she would \"not give the people false hope\". Although Lam's performance in public debates was praised, the Secretary for Development's conflict of interest as the head of the Antiquities Advisory Board was criticised. Lam said the AAB did not have governmental authority, and that it had not suggested keeping the pier in its totality.\nDismantling and storing\nAt the end of July 2007, the Development Bureau issued a paper for the Legislative Council's lands and works panel. Hoardings were erected by the end of July, and the target date for completing \"preservation works\" was set as November. It was suggested for the pier's pitched roof to be disassembled into halves and the 34 concrete columns to be cut at roof and deck level. The pieces would be labelled and then lifted by a crane barge and transported to the government's explosives depot in Kau Shat Wan, Lantau Island, where it would be stored under guard.\nDistrict councils\nThe government polled 16 District Councils, fourteen of which voted in support of relocating the pier to the new waterfront. However, in July 2008 activists cried foul when eight councils revealed that the preservation of the pier in its existing location was not put forth as one of the options; the vice-chairmen of two councils that voted to support this also objected that their decision may have not been an informed one as not all possible options were on the table. The chief town planner said that the omitted proposal \"was not an efficient option and would create unnecessary construction waste\".\nAfter it was revealed in August 2008 that the government was behind the 13 concerted District Councils' motions in 2008 supporting the relocation of the pier to the new waterfront, Albert Ho condemned the government of tampering with District Councils to \"create public opinion.\" Convenor of the Urban Design Alliance doubted the openness of consultation, saying that \"the government had engineered its results\". Dr Li Pang-kwong, of Lingnan University, said that the problematic framework of the councils has led them to work too closely with the government. He said the 'copy and paste' Queen's Pier motions passed by 13 councils to support government decisions was a rubber-stamp, and a clear sign that councils lacked independence.\nConservationists' position\nRon Phillips, original designer of the pier, backed preservation, saying that any loss of the City Hall and the adjacent open space would be something \"future generations will come to regret\". The Hong Kong Institute of Architects denounced the government's insistence that dismantling and reassembling of the pier was the only feasible option, in disregard of the pier's \"grade 1\" status. The architects concluded that the \"technical difficulties were not irresolvable, and the government's reasons for not revising the current infrastructural design were not at all convincing\".\nEnvironmental groups were angered by the government's technobabble, and for inflating the costs and technical difficulties of keeping the pier at the original site. The proposed 40-metre-wide road, planned in the 1980s, was now \"obsolete\", and would make the waterfront \"inaccessible to the public\". Albert Lai, Chairman of the Hong Kong People's Council for Sustainable Development, drew attention to the fact that the budgeted spending for infrastructure over the past three years of HK$90&nbsp;billion contrasted poorly with HK$90&nbsp;million spent on acquiring and renovating heritage sites.\nThe Civic Party accused the government of misleading the public: the development plans for the North Island Line precluded the restoration of the pier before 2016. Christine Loh criticised Donald Tsang for failing to grasp the economical, cultural and social importance of heritage.\nLocal Action, a loose alliance of protesters on site, described the pier as a cornerstone of Hong Kong identity. By linking the pier with earlier social movements in late 1960s and early 1970s, it argued that the place was a symbol of Hong Kong civic activism and therefore should not be demolished.\nPreservation campaign battlefronts\nPublic and media\nIn September 2004, legislator Law Chi-kwong took a swim in Victoria Harbour bearing a plaque saying \"Goodbye to the Queen\", to protest the Central and Wan Chai Reclamation, particularly the loss of Queen's Pier.\nBanners erected by protesters, tents on the rooftop\nSoon after the unsuccessful attempt to save the Star Ferry pier in early 2007, a campaign to preserve the pier in situ was launched. Ahead of the closure, members of the public, environmentalists, and some lawmakers arrived to tie blue ribbons to indicate their desire to preserve the harbour. On 22 April, about 100 protesters once again rallied at the pier, launching farewell voyages in a last-ditch attempt to urge the Government to reconsider: a petition of over 400 signatures from the Arts community was collected.\nThe hunger strikers' encampment, day 3\nAn occupation of the pier was started by ten activists on the designated closure date. The campaign was boosted by the appearance of Chow Yun-fat early on the morning of 28 April to sign the petition, and to appeal pre-emptively to the police not to hurt protesters. Some activists, like Chu Hoi-dick, have been involved in the Star Ferry pier protest, and took turns to maintain a round-the-clock presence. Leung Chun-yiu spent three nights a week at the site, despite working a full-time job, vowing to block the demolition non-violently in any way he could.\nOn 27 July, three students, as part of a group called Local Action started a hunger strike at the pier. Hunger striker Chan King-fai said: \"The government wasn't chosen by us. All we can do is to use our humble and limited voices.\" The government responded with a communications offensive, announcing that Secretary for Development Carrie Lam would appear on RTHK's City's Forum and at a public forum on 29 July at the pier.\nOn 30 July, the Government ordered an end to the \"unlawful occupation\" of government land by midnight. Activists vowed to defy the order; a candlelight vigil held at the pier was attended by 200 sympathisers. The Government did not risk a violent confrontation immediately on the expiry of the eviction deadline. In an operation which lasted ten hours during daylight hours on 1 August 2007, 300 Police officers cleared away the 30 or so protesters from the site, amid scuffles. Hong Kong Human Rights Monitor complained that its observers were denied access to the area during the eviction.\nLegislative Council\nAn application for HK$50&nbsp;million to fund the dismantling and relocating of the pier was scheduled for debate by the Public Works sub-committee on 9 May 2007, the same day the Antiquities Advisory Board would hold a public hearing to decide on the historical grading of the pier. Government stressed the timing was \"a coincidence\", and steadfastly refused to defer the vote pending an outcome of the AAB vote.\nOn 9 May, after an hour-long heated debate, the government was forced to withdraw its motion due to the lack of support. Choy So-yuk, from the usually pro-Government DAB, called for the vote to be postponed, and the Liberal Party equally did not back the Government. However, Government ministers declared that it had \"no plans to list the pier as a declared monument\", and insisted that there was \"no direct relationship between the grading and whether we will demolish and relocate the pier\". During the debate, the Director of Leisure and Cultural Services also said that even if the site was pronounced a first-class monument, there remained no legally binding prohibition against its demolition. Liberal Party chairman James Tien said that, in failing to muster support to implement its policies, \"the Government is like a crab with weak legs\".\nThe government claimed that its handling of the issue had been \"in line with pledges made by Chief Executive Donald Tsang Yam-kuen during his recent re-election campaign\" to regain the moral high ground regarding heritage preservation, following the mistakes of the Star Ferry saga. Civic Party legislative councillor Fernando Cheung Chiu-hung said that there was \"no sincerity [from the government] to preserve historic venues\".\nThe public works subcommittee approved the Government's re-submitted request for funds to dismantle and relocate Queen's Pier on 23 May in a 10–7 vote. Choy So-yuk, who voted against the appropriation on 9 May, abstained. She revealed that she had been lobbied by Michael Suen and Donald Tsang; party whips did not allow her to cast an opposing vote. The Hong Kong Institute of Architects said it \"regretted the funding approval\".\nAntiquities Advisory Board grading vote\nOn 6 March 2007, the AAB agreed on a review of the Pier’s grading and commissioned the AMO to conduct a study on the historic and heritage value of the Pier. Subsequently the Board convened an open meeting on 9 May 2007, in which the Board adopted the AMO’s report. The AAB by simple majority recommended the Pier to be graded as a grade I historic building on the grounds of historical significance and social value. Twelve members voted for Grade 1 listing, and ten voted for Grade 2 listing. However, the status is not-binding on the Government.\nAfter the hearing, an activist from 'Local Action' declared the AAB's decision a victory for the people, and warned the government \"not to treat the voice of the people lightly\". In spite of conservationist campaigns and the AAB’s grading recommendation, then-Secretary for Housing, Planning and Lands Michael Suen stated that the Pier must be removed from the site before relocation; Suen further stated that the AAB’s recommendation had no bearing on the Government’s action.\nLegal challenge\nAs Lands Department officials arrived on 30 July to put up notices ordering an end to the \"unlawful occupation\" of government land, the activists filed for a judicial review, claiming that the decision of the Secretary for Home Affairs not to declare the structure a monument was unreasonable and illegal. The High Court set the date for the case to be heard as 7 August. Judge Johnson Lam said that the case about the future of Queen's Pier should be heard as there is great public interest in the outcome and justified a one-week respite for the site.\nOn 10 August, the High Court dismissed the request for judicial review, thus giving the go-ahead for the government to demolish it. The judge ruled that the applicants had failed to establish that the government had acted perversely.\nInstitute of Planners controversy\nThe Hong Kong Institute of Planners, the majority of whose members work in government departments, had backed the in-situ preservation of the pier. There was uproar in May 2008 when it made an apparent U-turn in a position paper submitted to the government backing the relocation to a waterfront location, based on a sparsely attended meeting. It then submitted a revised paper presenting that a majority of its members supported such a move as a conclusion prior to the completion of a survey. A former vice-president of the institute questioned how the institute had become allies of the government.\nPossibility of reinstatement\nIn 2021, it was revealed that the government was looking at a reinstatement of the pier away from the Central Harbourfront area.\nPopular culture\nThe pier is featured in the following programmes and videos:\n* My Date with a Vampire (ATV)\n* Life Made Simple (TVB)\n* Glittering Days (TVB)\n* the music video of \"Goodbye Bell\", a song by Sam Hui\n* in the 2010 movie Dream Home set in Hong Kong in the year 2007.\n* in the 1988 television miniseries Noble House starring Pierce Brosnan.\nSee also\n* List of demolished piers in Hong Kong\n* Central Market\n* Central Police Station\n* Heritage conservation in Hong Kong\n* Lee Tung Street\n* List of Grade I historic buildings in Hong Kong\n* Yau Ma Tei Police Station\nReferences"
    }
  ]
}