{
  "content": [
    {
      "type": "text",
      "text": "# Queen's Park station (Toronto)\n\n| other  =   TTC buses and Streetcars\n| 1=  Avenue Rd\n| 3=  Carlton\n| 4=  Carlton\n}}\n| website       =\n| structure     = Underground\n| platform      = Centre platform\n| depth         =\n| levels        =\n| tracks        = 2\n| parking       =\n| bicycle       =\n| opened        =\n| closed        =\n| rebuilt       =\n| accessible    = Yes\n| owned         =\n| passengers    = }}\n| pass_year     =\n| pass_rank     =\n| services      =\n| mapframe = yes\n| mapframe-custom =\n}}\n'''Queen's Park''' is a subway station on Line 1 Yonge–University in Toronto, Ontario, Canada. The station, which opened in 1963, is located under University Avenue at College Street.\nThe station is wheelchair-accessible and has had underground connections to adjoining buildings since 2002. Wi-Fi service is available at this station.\nEntrances\nThe mezzanine level of the station is located under the intersection of College Street and University Avenue/Queens Park and entrances are located at all four corners.\n* Northwest entrance: The only uncovered stairwell entrance is located beside the Leslie L. Dan Pharmacy Building at the southeast corner of the University of Toronto St. George Campus.\n* Northeast entrance: This is where the elevator between ground level and the ticketing mezzanine is situated. A different elevator provides further access to the train platform. There is a tunnel here connecting to the Ontario Government Buildings and other important destinations include the Ontario Legislative Building and Women's College Hospital.\n* Southwest entrance: Twin escalators provide a direct connection to the Intact Centre, with Princess Margaret Cancer Centre, Mount Sinai Hospital and the Toronto Rehabilitation Institute being on the west side of University Avenue to the south.\n* Southeast entrance: Beside this entrance is the MaRS Discovery District, where a connecting tunnel is to be constructed, and a short distance to the south are Toronto General Hospital and the Hospital for Sick Children.\nArchitecture and art\nThe station is in a bored tunnel, and it is one of only two stations in the system to have a tubular shape, the other being the next station south at St. Patrick. North of the station, the tunnel curves east around the Ontario Legislative Building, then comes back to its original alignment centred under the road just before Museum Station\nA ceramic tile mural, a gift from the Government of Portugal, is located within the fare-paid area of the mezzanine. The mural features subject matter inspired by Portuguese exploration of the New World. It was designed by Ana Vilela, manufactured by Viúva Lamego in Lisbon and installed here in 2003.\nStation improvements\nfurther renovations at the station have been ongoing since the fourth quarter of 2023, including asbestos removal and cosmetic upgrades such as new wall finishes. Some riders have expressed frustration with the station's safety and appearance due to a lack of proper wayfinding signage and missing tiles.\nSurface connections\nA transfer is required to connect between the subway system and these surface routes:\nTTC routes serving the station include:\n{| class=\"wikitable\"\n! Route\n! Name\n! Additional information\n|-\n!13A\n|Avenue Road\n|Northbound to Eglinton station\n|-\n!13B\n|Avenue Road\n|Northbound to Eglinton station and southbound to Gerrard Street West\n|-  -->\n|-\n!306\n|Carlton\n|Blue Night streetcar service; eastbound to Main Street station and westbound to High Park Loop\n|-\n!506\n|Carlton\n|Streetcar; eastbound to Main Street station and westbound to High Park Loop\n|}\nSee also\n*Queen's Park\nReferences\nExternal links\n*"
    }
  ]
}