{
  "content": [
    {
      "type": "text",
      "text": "# Queen Elizabeth Planetarium\n\n|location=Coronation Park\n|address2=Edmonton, Alberta, Canada\n|place_type=Planetarium\n|owner=City of Edmonton\n|designer=Walter Tefler and R. F. Duke\n|features=\n|amenities=\n|surface=\n|area=\n|open= 22 September 1960 (closed 1983)28 September 2023\n|dedicated_to=Elizabeth II\n}}\nThe Queen Elizabeth Planetarium or Queen  Planetarium is a planetarium located within Coronation Park, in Edmonton, Alberta. It was the first public planetarium in Canada, operating between 1960 and 1983 and again from 2023 onward. Designed by Walter Tefler and R.F. Duke, it was named to commemorate the visit of Elizabeth II, Queen of Canada, in 1959. The Planetarium is now operated by the Edmonton Space Sciences Foundation.\nHistory\nPlanning\nEdmonton City Council was, in 1958, presented with a proposal to build a permanent civic memorial to mark the visit of Canada's then-monarch, Queen Elizabeth II, and her husband, Prince Philip, in July of the following year. Originally, it was thought to symbolize the three areas of government by placing three projects or, more likely, a three-sided obelisk, on a 30.8 metre (94 foot) trilon. Another suggestion was a fountain, and the park itself. However, after Alderman Frederick John Mitchell proposed that an observatory be built, S. Frank Page, the Assistant Secretary and Editor of  Stardust, the newsletter of the Royal Astronomical Society of Canada, Edmonton Centre, suggested in November 1958 that a planetarium would be more useful, as he anticipated that city lights would interfere with an observatory.\nOn 21 December 1958, H.J. McKim Ross, of the Montgomery Branch of the Royal Canadian Legion, made to City Council a motion supporting the project in principle. This was passed unanimously. A committee was then formed—consisting of Professor E.S. Keeping, Professor Gads, Franklin Loehde, F. Jersen, D. Rosenfield, and Earl Milton—to put together a submission to Council. This was approved by the Finance Committee in March, with an estimated cost of $110,000, and, on 9 March, the proposal to construct a planetarium in Coronation Park was confirmed by City Council by a margin of seven to four.\nThe Queen visited the site during her cross-Canada tour in July of that year. William Hawrelak, Mayor of Edmonton, said to her at the event,\nyou have now set foot on an area of Canadian soil that was named in honour of your coronation [...] In commemoration of this royal visit [...] it is the wish of your loyal and devoted people to erect a building of masonry, brick, and stone at this location; a structure that will serve during the years ahead as a practical and pleasurable monument to perpetuate the memory of this great occasion. The aesthetic value of this planetarium will soon give the development of the Canadian parkland, an additional beauty dedicated to the welfare and convenience of our citizens. May it always be in keeping with the spirit in which you come to us: friendly, warm hearted, and sincere.\nWe respectfully request your Majesty’s permission to name this building The Queen Elizabeth II Planetarium. In your presence today, we humbly demonstrate our allegiance, our gratitude, and our affection.\nOpening\nThe official opening ceremonies were held on 22 September 1960. The Mayor, by then Elmer Ernest Roper, dedicated the building and a message of congratulations from the Queen's Secretary was read by C.J. Forward, Chief Justice of the Court of Queen's Bench of Alberta. Professor E.S. Keeping represented the University of Alberta and presented to the Planetarium a 68 pound fragment of the Bruderheim Meteorite, which was made the centrepiece of the building's astronomical display. Also present was the then-President of the Edmonton Centre branch of the Royal Astronomical Society of Canada, James Harrington.\nThe Queen Elizabeth II Planetarium was designed to be the main focal point of Coronation Park. At the time of its construction, and for a few years afterward, the Planetarium was the only structure in Coronation Park. It was also the first such public facility in Canada. The second would not open until 1966, in Montreal. During the first five years of the Planetarium's operation, much of the work was done by volunteers from the Royal Astronomical Society. Eventually, a full-time lecturer and receptionist had to be hired. The Planetarium was, however, hampered by a seating capacity of only 65.\nClosure and restoration\nThe facility closed at the end of 1983, superseded by the adjacent Edmonton Space Sciences Centre (now the Telus World of Science), which opened earlier that year. The Planetarium thereafter remained vacant, falling into a poor state of repair.\nTwo separate applications were submitted to the Historical Resources Development Board by Dale Nosko and Howard Gibbins in late 2004. With the assistance of Robert Geldart, these were passed by the Historical Resources Review Panel 31 on May 2005 and the Edmonton Historical Board in late June, both bodies agreeing that the building should be added to the A List of Municipal Historic Resources within Edmonton, which was done by the General Manager of the Planning and Development Department. The city announced In November 2016 plans to restore the Planetarium and grant it full heritage status, doing so in March 2017.\nWith a budget of seven million dollars, the Planetarium was originally scheduled to be restored and open by the end of 2019, in time for the 2020 International Planetarium Society Conference to be held in Edmonton. The reopening was later pushed back to the spring of 2020 and again, because of delays due to restrictions in place during the COVID-19 pandemic, to the autumn of 2021. The Queen Elizabeth II Planetarium reopened to the public on 28 September 2023, with its first director, Ian McLennan, as the first person to enter. As it is a relatively small planetarium, the intended audience is young students; though, the facility can also be rented for private events.\nThe rehabilitation was intended to honour the heritage, historical, and architectural importance of the original exterior, while increasing the interior's functionality. Accessibility and sustainability were integrated into the redesign along with the use of period-accurate materials and aesthetics. In 2021, the Queen Elizabeth Planetarium restoration received one of eight national awards from the National Trust.\nDirectors\nThe first director of the Planetarium was Ian McLennan, a member of the Edmonton Centre branch of the Royal Astronomical Society of Canada, serving from 22 August 1960 to 31 October 1965, when he moved on to become the Director of the Strasenburgh Planetarium in Rochester, New York.\nMcLennan was succeeded by David Rodger on 1 November 1965, but, departed on 31 July 1967, when he was appointed Director of the H.R. MacMillan Planetarium in Vancouver, British Columbia. During Rodgers’ directorship, the Queen Elizabeth II Planetarium produced its most successful shows and saw the 25,000th attendee on 4 July 1966. In 1967, an attendance record of 33,500 was reached. Shortly thereafter, the staff position of technician was added, William Cable being the first.\nCable was made the next director, taking over on 2 August 1967. Cable reduced the involvement of the Royal Astronomical Society of Canada and attendance dropped during his tenure, from the 33,000 in 1967 to 12,500 in 1972, when Cable left the Planetarium.\nGarry T. Stasiuk was hired November 15, 1969 as Education Director.  Garry came to the QEP II Planetarium from the University of Manitoba Planetarium where he was the  Supervisor of the University Planetarium under the Direction of Professor Robert J. Lockhart.  Garry’s Credentials include a Master Degree level Certification in Planetarium Management and Planetarium Astronomy from the State University of New York at Oswego.\nGarry Produced 4 school programs:  A Story based presentation for Pre-school Children, Introduction to the Planetarium for Kindergarten to Grade 3.  Planets, Comets and the Night Sky for grades 4 to 6 and Life in the Universe for grades 7 to 12 and up.  At the request of the classroom teacher, presentations were adjusted to fit specific topics that the students were studying..\nThe school shows set record attendances for the Planetarium… every preschool child in the Edmonton area attended the planetarium show in February and March with as many as 6 shows a day! Attendance for the elementary level and High shows dramatically increased…\nIn 1971 Garry, because of his interest in how the students were reacting to the school presentations studied Psychology at the University of Alberta.\nGarry’s Psychology University Class project was a paper about  “Learning Behavior in the Planetarium.”   For many planetaria around the world “Learning Behavior in the Planetarium”  became a white paper standard guide on how to produce and present planetarium shows for the specific age level of the students attending the planetaria.\nDuties also include presenting shows to the public when necessary,\nIn December 1972 Garry left the Queen Elizabeth II Planetarium to Direct the H. C. Kendall Planetarium at the Oregon Museum of Science and Industry in Portland, Oregon.\nOn 5 January 1973, John Hault was installed as director, remaining in the position until the Planetarium closed on 31 December 1983. He subsequently become the Director of the Edmonton Space Sciences Centre.\nSee also\n* List of planetariums\n* Royal eponyms in Canada\nReferences\nExternal links\n* [https://sites.google.com/view/qeplanetarium/home Queen Elizabeth II Planetarium—Canada's First Public Planetarium]\n* [https://www.youtube.com/watch?v=1KfgN00ZsLs City of Edmonton: Queen Elizabeth II Planetarium Restoration]\n* [https://www.youtube.com/watch?v=KggcV6UKNDk&t=4s City of Edmonton: QEP Planetarium Award]"
    }
  ]
}