{
  "content": [
    {
      "type": "text",
      "text": "# Queensland Country Heelers\n\n2000\n|region     =\n|ground     =\n|capacity   =\n|coach      = Rob Johnston\n|captain    =\n|league     = NRC Div.2\n|season     =\n|position   =\n|unionurl=\n|pattern_la1=\n|pattern_b1= _white_rugby_collar_white_sides\n|pattern_ra1=\n|pattern_so1=\n|leftarm1=0433a9\n|body1=0433a9\n|rightarm1=0433a9\n|shorts1=ffffff\n|socks1=0433a9\n}}\nThe Queensland Country Heelers is an amateur rugby union football team that represents the regions of Queensland outside of Brisbane. The team is selected by the Queensland Country Rugby Union following the annual Queensland Country Championships, and plays other representative teams from around Australia.\nLogo and colours\nQueensland Country adopted the Heelers logo featuring an Australian cattle dog in 2000. These working dogs, also known as \"Queensland Heelers\", are well known throughout regional areas of Queensland. The team colours are blue and white.\nCompetition\nRegular fixtures include City-Country matches, where Queensland Country play against Brisbane sides, and the \"Battle of the Borders\" Cup against the New South Wales Country Cockatoos.\nQueensland Country Under 19\nSince 2018, a Queensland Country Under 19 team competes in the national Under-19s Rugby Championship, known as the URC. In previous years, Country colts teams at under&nbsp;21, under&nbsp;20 and under&nbsp;19 age levels were fielded in national and state competitions and in occasional matches against other representative sides.\nHistory\nThe Queensland Country team first played against Brisbane when the Queensland Rugby Union started the Country Week competitions in 1902. Brisbane narrowly won the first match 16–15 and Country won for the first time, in the eighth season, in 1907.\nCountry Week carnivals became sporadic with the rise of rugby league after 1909. but the strength of Queensland's country rugby prior to 1914 was considerable. In 1912, a North Queensland team drawn from Cairns, Charters Towers, and Townsville defeated Queensland's representative team by 21-3. In 1913, a Darling Downs team also secured a win, by 6–0, over the Queensland side that had won three out of four matches with New South Wales.\nThe start of the First World War brought rugby union to a halt in Queensland after 1914. The QRU was re-established in 1928–29 but the game languished in country regions for many years. It was not until the 1960s, when new competitions and clubs were started in Toowoomba and Warwick, that Country rugby began to develop. Annual trials and more regular fixtures for the Queensland Country team were arranged. In 1964, Queensland Country  defeated Brisbane's Sub-Districts by 25-14 and surprisingly held NSW Country to a 14–14 draw. The Queensland Country Rugby Union was founded in 1965.\nFrom the 1970s through to the 1990s, the Queensland Country team played regular City-Country matches against Brisbane sides that were generally stronger. Queensland Country was admitted to the second division of the Wallaby Trophy in the 1970s, before that competition ended. The team also put up spirited performances against touring international sides, including South Africa and England, and managed to record occasional wins over Brisbane Sub-Districts and NSW Country in the 1980s and 1990s.\nThe Heelers name was adopted in 2000 for the start of the Australian Rugby Shield competition, which Queensland Country won in the inaugural season, defeating Perth on full-time in a semi-final in Perth, and coming from 16–17 down against NSW Country to score in the final minutes to win the final at Sydney Stadium by 23-17.\nFollowing the suspension of the Australian Rugby Shield after nine seasons at the end of 2008, the focus of the Queensland Country Heelers returned to annual City-Country fixtures and, in particular, to the \"Battle of the Borders\" Cup. The Heelers won the cup in 2013 for only the second time in seven years, defeating NSW Country 21–20 in the match played as the curtain raiser for the Combined Country versus British and Irish Lions tour match at Hunter Stadium in Newcastle.}}\n|- style=\"line-height:0;font-size:85%;\"\n|style=\"padding:0;width:50%;\"| ||style=\"padding:0;width:50%;\"|\n|- class=\"wraplinks\" style=\"vertical-align:top; text-indent:0.6em;\"\n|\n|\n----Notes:\n|-\n| colspan=\"100%\" style=\"font-size:85%; text-align:center\"|  Denotes debut selection. (c) Denotes team captain.\n|}\nHonours\n* Australian Rugby Shield Winners (2000)\n* Australian Rugby Shield Winners (2024)\nSee also\n* Rugby union in Queensland\n* Queensland Country Championships\nReferences\n}}\nSources\n*\n* (No date) Queensland country heelers. Available at: http://www.rugbyarchive.net/team/2549 (Accessed: 24 January 2025)."
    }
  ]
}