{
  "content": [
    {
      "type": "text",
      "text": "# Queen Vic Fire Week\n\n\"Queen Vic Fire Week\" is a group of four episodes of the BBC soap opera EastEnders, broadcast between 6 and 10 September 2010 on BBC One. The episodes included a fire at The Queen Victoria public house, also known as The Queen Vic or The Vic, and the departure of the character Peggy Mitchell, portrayed by Barbara Windsor, who left the series after sixteen years in the role. During the episodes, Peggy—the pub landlady—has her crack cocaine-addicted son Phil (Steve McFadden) imprisoned in The Queen Victoria, forcing him to go cold turkey. She later learns that her deceased husband Archie (Larry Lamb) was murdered by the person he raped: Stacey Branning (Lacey Turner). Before she can report Stacey to the police, Phil escapes and sets the pub on fire. Stacey and her infant daughter Lily are trapped inside, but are rescued by her lover Ryan Malloy (Neil McDermott) – prompting Stacey to reveal to him that he is Lily's father. In light of the incident, Peggy decides against reporting Stacey for Lily's sake. She then plans to make a fresh start, bidding her family goodbye and leaving Walford.\nThe episodes were directed by Lee Salisbury and produced by Bryan Kirkwood. The first was written by Daran Little and the remainder by Simon Ashdown. Kirkwood intended to give Windsor an \"epic and poignant\" departure, as befitting her status as the ultimate EastEnders matriarch. The fire storyline was created for her exit, and to facilitate a refurbishment of The Queen Victoria set for the transition to high-definition television broadcasting. The episodes were filmed over seventeen days, more than twice the series' typical filming duration, with the interior set rebuilt on the George Lucas Stage in Elstree for the fire.  A special version of the theme tune, called \"Peggy's Theme\", was created for Windsor's final episode. It was released as an EP, available for download following the episode, and features as the lead track on composer Simon May's album The Simon May Collection. The episodes were accompanied by two documentaries on BBC Three, one following the filming of the fire, and the other examining ten of Peggy's most iconic moments in EastEnders.\nViewership ranged from 8.60–10.09&nbsp;million, with no episode watched by less than a third of the total viewing audience. They were the most watched programmes on BBC One in the week of broadcast, and the Friday episode was the second-most watched show across all channels. The episodes received a mixed response from critics. Several highlighted inaccuracies and implausibilities in the storyline, including the lack of fire alarms and sprinklers in the pub. Others focussed on Peggy's departure, with James McCarthy of the Western Mail writing that it would \"doubtless remain the stuff of EastEnders legend for years to come,\" and Jim Shelley calling it \"a good way to go.\" In contrast, the Daily Mirror Polly Hudson found Peggy's exit a nonsensical \"non event\", and Gareth McLean of The Guardian deemed it \"suitably sentimental\", but several years overdue. The fire was nominated in the \"Best Stunt\" category at the 2011 All About Soap Bubble Awards.\nPlot\n6 September 2010\nPeggy Mitchell (Barbara Windsor), who has just regained her status as landlady of The Queen Victoria public house, decides to throw a wedding reception for Janine Butcher (Charlie Brooks) and Ryan Malloy (Neil McDermott) to let everyone know the pub is hers again. Peggy's friend Pat Evans (Pam St Clement) arranges a hen party for Janine at the R&R nightclub, but Janine feels betrayed by Pat when Peggy reveals that she said Janine's marriage would not last. Janine meets a man named Richard Monroe (Andrew Hall), who settles her bill. Impressed by his car, Janine leaves with him. Worried about her son Phil (Steve McFadden) because of his addiction to the drug crack cocaine, Peggy enlists the help of Minty Peterson (Cliff Parisi) and Billy Mitchell (Perry Fenwick) to abduct him from the flat he is living in. They bring him back to The Queen Vic, locking him in the living room upstairs, where the windows have been boarded up to stop him from escaping. Stacey Branning (Lacey Turner) reveals to Dot Branning (June Brown) that her deceased husband Bradley (Charlie Clements) is not the father of her baby Lily.\n7 September 2010\nStacey explains to Dot that Bradley knew he was not Lily's father. Dot informs Bradley's father Max (Jake Wood), who tells her he already knows. Concerned by Stacey telling people her secrets, he wonders if she has ceased taking medication for her bipolar disorder. He tells her that she needs to keep the truth about Lily's father and the fact that she killed Peggy's husband Archie (Larry Lamb) several months previously to herself (see Who Killed Archie?). Phil tries to convince various people to let him out as he is suffering withdrawal symptoms, but nobody will. Janine awakens in Richard's flat and gets dressed, though they did not have sex. She returns home and tells Pat that she feels guilty, and Pat tells her not to inform Ryan. Janine fears that she is not good enough for Ryan, but he reassures her and they marry. Stacey attends their wedding reception in The Queen Victoria, leaving Lily in a bedroom upstairs. She is surprised by a photograph of Peggy and Archie, and is frightened to hear Phil making noises in the living room. Stacey tells Peggy that she thinks Archie is alive and locked upstairs. Peggy assures Stacey that Archie is dead, telling her that Bradley killed him, as he was posthumously found guilty of the murder. Stacey then confesses that she killed Archie.\n9 September 2010\nPeggy demands that Stacey leave the pub and Stacey pleads with her not to call the police for Lily's sake. She attempts to tell Ryan that he is Lily's father, but is interrupted by Pat, who thinks Stacey is trying to seduce him and slaps her. Phil smashes through the door using a crowbar that was left in the room. He starts taking cash and drinking alcohol, and interrupts Peggy before she can call the police about Stacey. They argue, with Phil accusing Peggy of loving the pub more than she loves him and throwing a match to the alcohol-soaked floor to start a fire. It spreads quickly, causing an explosion. The customers flee the pub, Syed Masood (Marc Elliott) is knocked to the ground and trampled in the process but is rescued by his father Masood Ahmed (Nitin Ganatra) and brother Tamwar (Himesh Patel).\nPeggy tries in vain to extinguish the flames, but is forced out by her friends and family. Stacey, unaware of the events, heads upstairs to Lily and becomes trapped. She uses the crowbar to smash a boarded-up window and hands Lily over to Ryan, who has climbed a ladder. Peggy realises Phil is still inside and returns to the building with Billy. They find him trapped beneath a wooden beam, and are able to drag him out to safety. Ryan goes back up the ladder and carries an unconscious Stacey out. Stacey regains consciousness and sees that Lily is safe, and tells Ryan that Lily is his daughter. Peggy stares at the pub as it is completely destroyed.\n10 September 2010\nThe next day, Peggy visits Stacey in hospital and asks her to confess to burning the pub, as a sentence for arson would be less than one for murder, but Stacey refuses. Peggy realises that Stacey needs to look after her daughter so she leaves. Ryan confronts Stacey at the hospital, shocked with her confession, refuses to acknowledge his daughter, and goes on his honeymoon with Janine. Peggy goes into the pub and looks around as she remembers events from her time there. She then tells Billy she wants to take Phil away to make a fresh start and to protect him. Her niece Ronnie (Samantha Womack) tells Peggy she is five months pregnant and asks Peggy not to leave as she is like a mother to her. Peggy tells Ronnie to give her real mother, Glenda (Glynis Barber), another chance. Peggy's daughter Sam (Danniella Westbrook) does not want her to leave as Peggy promised to look after Sam's baby Richard for her, however, Peggy says she is old now and the baby needs a strong mother. Peggy gives her jewellery to Sam to sell so she has some money. Peggy speaks to Phil, accepting responsibility for making him the way he is and offering to help him get off the drugs. He says she needs him more than he needs her and that she suffocates him. Realising that he is right, Peggy asks the rest of her family to look after him, saying emotional goodbyes. Though Phil claims not to have meant what he said, Peggy says she has to leave for his sake. As she leaves the house, Phil begins to follow her, but she sends him back inside. She looks at the pub and walks out of Walford.\nCharacters and cast\n* Nitin Ganatra as Masood Ahmed\n* Adam Woodyatt as Ian Beale\n* Laurie Brett as Jane Beale\n* Thomas Law as Peter Beale\n* June Brown as Dot Branning\n* Jake Wood as Max Branning\n* Lacey Turner as Stacey Branning\n* Jamie Borthwick as Jay Brown\n* Patsy Palmer as Bianca Butcher\n* James Forde as Liam Butcher\n* Sid Owen as Ricky Butcher\n* Maisie Smith as Tiffany Butcher\n* Linda Henry as Shirley Carter\n* John Partridge as Christian Clarke\n* Shona McGarty as Whitney Dean\n* Elicia Daly as Nurse Denton\n* Pam St Clement as Pat Evans\n* Tameka Empson as Kim Fox\n* Kylie Babbington as Jodie Gold\n* Zöe Lucker as Vanessa Gold\n* Laila Morse as Mo Harris\n* Lindsey Coulson as Carol Jackson\n* Devon Higgs as Morgan Jackson-King\n* Diane Parish as Denise Johnson\n* Charlie Brooks as Janine Malloy\n* Neil McDermott as Ryan Malloy\n* Marc Elliott as Syed Masood\n* Himesh Patel as Tamwar Masood\n* Nina Wadia as Zainab Masood\n* Charlie G. Hawkins as Darren Miller\n* Perry Fenwick as Billy Mitchell\n* Glynis Barber as Glenda Mitchell\n* Barbara Windsor as Peggy Mitchell\n* Steve McFadden as Phil Mitchell\n* Samantha Womack as Ronnie Mitchell\n* Rita Simons as Roxy Mitchell\n* Danniella Westbrook as Sam Mitchell\n* Andrew Hall as Richard Monroe\n* Luke Harris as DC Andrew Newton\n* Cliff Parisi as Minty Peterson\n* Derek Martin as Charlie Slater\n* Gillian Wright as Jean Slater\n* Jane Slaughter as Tracey\n* Cheryl Fergison as Heather Trott\n* Rudolph Walker as Patrick Trueman\nBackground\nIn October 2009, actress Barbara Windsor's decision to leave EastEnders after sixteen years of portraying the character Peggy Mitchell was announced. The show's executive producer, Bryan Kirkwood, said it was a massive honour for him to be responsible for the character's exit, but explained that as she has become the \"quintessential matriarch of the show\", they had to get the exit storyline right, which he said would be \"both epic and poignant\".\nIn June 2010, it was announced that The Queen Victoria would be destroyed in a fire to tie in with EastEnders transition to high definition so the set could be completely refurbished. It was reported that the fire could tie in with the departure of Peggy or one of the several other characters whose departure had previously been announced. Director Lee Salisbury said the fire, as well as Peggy's departure, would have a huge effect on several characters, especially the Mitchell family, of which Peggy is the matriarch. Kirkwood said the fire was \"one of the most spectacular stunts that EastEnders has ever seen, and it's very exciting.\"\nProduction\n's character, Peggy Mitchell, departed from EastEnders after sixteen years on screen.]]\nFilming\nAll four episodes were directed by Lee Salisbury, who learned three weeks before filming that he would be working on the episodes, and said he was \"a bit dumbstruck\" to discover he would be directing the fire episodes and Windsor's departure, but that he was proud to do so. He said his main aim for the fire was to show the fear, panic and pandemonium that comes when a fire starts and quickly spreads. He wanted the story to be character-led rather than led by the fire, saying that the fire \"almost becomes a backdrop\". Salisbury said it was hard to make the fire look real because \"you can't actually set fire to stuff\". As the fire lasted for some time, characters' scenes could be divided up into small sections. Salisbury commented: \"Bryan Kirkwood, the writer [Ashdown] and myself also wanted it to be an episode where things kept happening and the audience would keep thinking, 'Wow, that must have been the explosion' or 'That must have been the stunt'. But more things keep happening and happening, and I think that's what people will find really shocking.\" The production team had several production meetings for the weeks' worth of episodes, whereas there is usually just one.\nThe episodes took seventeen days to film, where normally crew are given eight days to film a week's worth of episodes. Between forty and forty-five members of crew were required for filming the fire episode, including assistant directors, a design department, cameras, lighting, sound, make up, costume, visual effects, fire safety officers and a stunt team consisting of a stunt co-ordinator and stunt doubles. Filming was done with four television cameras, a steadicam and a dolly. The exterior fire scenes were filmed first, in five night shoots lasting until 4&nbsp;a.m., and the real exterior set was burnt. Safety was the top priority for the fire scenes, and fire safety advisors ensured all cast and crew were protected. Stunt doubles wore flame-proof gel on their faces and for the scene where Ryan and Stacey fall from the ladder, several layers of cardboard boxes were stacked on the ground for the stunt doubles to fall onto. For filming the final explosion scene, all the actors whose characters were involved were filmed separately for their reactions. The explosion had to be delayed due to a power failure at Elstree Studios, two minutes before the explosion was due to be set off, which also affected a live broadcast of Big Brother. The power cut lasted two hours and filming was further delayed due to rain. Despite the delay, the scenes were completed on schedule. Salisbury noted that the demise of such an iconic set as The Queen Victoria left several cast members in tears.\nThe interior set of The Queen Victoria pub was taken apart and rebuilt exactly to scale on the George Lucas Stage, a fire stage at Elstree Film Studios, for interior scenes, filmed over four days. The interior set took seven weeks to build and two weeks to get into the studio. Controlled gas pipes were used to shoot jets of flames and a header was specially built to collapse on Phil. Salisbury had to ensure that the fire for the interior scenes matched that of the already-filmed exterior scenes.\nIn 2016, Windsor said that the Queen Vic fire was her favourite stunt to film since joining the cast in 1994. She called it her \"Joan of Arc moment\" and revealed that when the explosion happened, she \"was actually blown off my feet and landed on Steve McFadden who ended up with bruised ribs\".\nTheme music\nWindsor's final episode on 10 September 2010 did not end with the usual EastEnders theme tune. Instead the occasionally used \"Julia's Theme\", a piano version of the theme, was reworked specially for the broadcast, and given the name \"Peggy's Theme\". The theme was created by the original theme tune composer, Simon May, who was reportedly thrilled to write the theme tune for Windsor. He added more piano to the theme and gave it a \"more melancholy feel\". May composed the theme not knowing what would happen on screen, but when Kirkwood brought a rough edit of the episode, May noted that the music fitted perfectly first time, saying it was \"remarkable and very moving.\" The theme features as the lead track on the album The Simon May Collection and was also released as an EP available to download immediately after the episode. He revealed: \"All the actors and crew had made a really special couple of shows. My main purpose was to bring something to the table, and I didn't think it would be a single. [...] But when everybody heard the track they said 'you've got to release that as the single because it's something special'.\"\nRelated media\nA number of trailers were released to television in August 2010 to promote Peggy's departure from the series, and a section on the official EastEnders website was dedicated to the character, allowing fans to \"heart Peggy\". The 10 September episode was followed by a twenty-minute episode of documentary programme EastEnders Revealed titled \"Peggy Mitchell: Queen of the Vic\". Narrated by Shane Richie, the documentary looked at ten moments from Peggy's time in the show that made her a British icon. According to overnight figures, it received ratings of 4.49&nbsp;million viewers. Official ratings raised the figure to 4.62&nbsp;million. A documentary looking at the filming of the fire was broadcast on 24 September 2010 on BBC Three. It received 800,000 viewers.\nReception\nRatings\nThe 6 September episode, featuring Janine's hen party, attracted 9.54&nbsp;million viewers on BBC One. It was watched by 36.1% of television viewers during its original broadcast. The later BBC Three repeat was viewed by 840,000 people, attaining a 3.9% share of the audience during broadcast. The 7 September episode, in which Stacey confessed to Peggy that she killed Archie, was viewed by 8.60&nbsp;million people on BBC One and 990,000 on BBC Three, with audience shares of 34.9% and 4.7% respectively. The fire episode on 9 September received 9.40&nbsp;million viewers and a 41% share of the audience, and the BBC Three repeat saw 1.59&nbsp;million viewers (7.4%) tuning in. Peggy's departure on 10 September received 10.09&nbsp;million viewers for BBC One, a 38.1% share during broadcast, and the later BBC Three repeat was watched by 1.16&nbsp;million viewers, attaining a 5.3% share. Additionally, the four episodes were the most-watched programmes on BBC One that week and the Friday episode was the second most-watched on all channels.\nCritical response\nThe fire and Peggy's exit episodes garnered a mixed reception by critics. Liam Tucker, founder of website Watch With Mothers, compared the fire episode to the film The Texas Chain Saw Massacre and admired the special effects and performances of the episode, but said that it seemed unlikely that everyone would have escaped safely, especially Stacey and her baby. Roz Laws from the Sunday Mercury wondered if the fire episode was inaccurate due to the lack of fire alarms, sprinklers and emergency lighting in the pub, but noted that the episode's use of the song \"Murder on the Dancefloor\", featuring the line \"Gonna burn this god damn house right down\", was \"clever\". A writer for Heat said \"We knew the Vic fire was coming, but actually seeing it was quite another thing, and knowing that it also marked the end of an era with the departure of  Windsor made it that much more emotional.\" A reporter for the Nottingham Evening Post wrote \"Never in the history of soap fires, of which there have of course been legion, have so many hilariously overindulgent explosions been captured on camera.\" The People deemed the lack of deaths \"a wasted opportunity.\"\nWriting for entertainment news website Digital Spy, Daniel Kilkelly said Peggy's final episode featured \"plenty of poignant moments [...]—not least the scene which saw Peggy standing in the destroyed Queen Vic and appearing completely devastated.\" Gareth McLean from The Guardian said the use of \"Peggy's Theme\" was a \"suitably sentimental sendoff\" for the character, but said that \"in hindsight, Peggy should have left Walford three or four years ago, her character trapped in a cycle of increasingly samey stories that reduced her to a parody of her former self\", describing her efforts to put out the flames as \"like a very sooty clockwork mouse\". James McCarthy of Welsh newspaper Western Mail said Windsor's \"final emotional scene will doubtless remain the stuff of EastEnders legend for years to come,\" and Jim Shelley from the Daily Mirror said \"It was a good way to go.\" However, Shelley's colleague Polly Hudson said Peggy's exit was a \"non event\", as \"Peggy just left, nonsensically and at complete odds with everything we've learnt about her character over the last 15 years.\"\nIn February 2011, the fire was nominated for 'Best Stunt' at the 2011 All About Soap Bubble Awards. In May, it was nominated for 'Spectacular Scene of the Year' at the 2011 British Soap Awards. In 2015, Inside Soap listed the Queen Vic fire as their 9th favourite soap opera stunt of all time, saying it was \"just smoke and mirrors—we wanted proper carnage!\"\nImpact\nThe London Fire Brigade used the \"dramatic and distressing\" events of EastEnders to publicly highlight the devastation a real fire can cause, urging viewers to be more aware of how to protect themselves.\nReferences\nExternal links\n*[https://www.bbc.co.uk/programmes/b006m86d/features/farewell-peggy Farewell Peggy]"
    }
  ]
}