{
  "content": [
    {
      "type": "text",
      "text": "# Queenstown Gardens\n\n| area =\n| created =\n| operator = [http://www.qldc.govt.nz Queenstown Lakes District Council]\n| visitation_num =\n| status =\n| open = All year\n| website =\n}}\nThe Queenstown Gardens, located next to the town of Queenstown, New Zealand, is a botanical garden which contains a variety of exotic and native trees and plants as well as a large pond and a range of facilities. The facilities in the garden include a children's playground, tennis, lawn bowls, skate boarding, BMX biking, skating, Parkrun, disc golf and ice skating/ice hockey. In winter for about four days it becomes the site of the LUMA Southern Lights Festival.\nThere is a variety of trails in the garden with views of the surrounding mountains and of Lake Wakatipu and the Frankton Arm as well as Queenstown itself.\nThe most visible large tree species in the garden is that of the Douglas fir of which there are many large specimens. This tree also forms a protective forest that surrounds much of the gardens. There is also a Rose Garden just past the tennis court.\nHistory\nMāori used the Queenstown Gardens peninsula in pre European times: specifically the local tribe of Kāti Māmoe had a settlement here at one stage, but it was no longer there once European explorers arrived.\nThe first two trees planted at the garden were English oaks in 1866 by the first Mayor of Queenstown, James W. Robertson, and Mr McConnochie, the nurseryman at the time, to commemorate the incorporation of the borough, but it was not until 1867 that the gardens were officially opened and the major planting began. Residents at the time set about planting exotic trees which they planted wherever they chose. By the 1900s the Department of Tourist and Health Resorts was promoting the gardens internationally.\nThe band rotunda near the Park Street entrance was originally established in 1891 but rebuilt in 1999 by the Queenstown Lions Club.\nIn the 1960s a formal rose garden was established with 850 rose bushes planted. The Disc Golf Course is the first permanently marked course in New Zealand.\nHeritage trees\nThe heritage trees planted by the first mayor of Queenstown, James William Robertson, and protected in the gardens are:\n* Black Oak (Quercus velutina)\n* Red Oak (Quercus rubra)\n* Grand Fir (Abies grandis)\n* Algerian Fir (Abies nordmanniana)\n* Monkey Puzzle (Araucaria araucana)\n* Western Hemlock (Tsuga heterophylla)\n* Wellingtonia (Sequoiadendron giganteum)\nWildlife\nThere are many different bird species that can be found in or near the gardens. Native species include New Zealand scaup, paradise shelducks, bellbirds, tūī, Australasian crested grebe, black-billed gulls and fantails. Introduced birds species that can be found include sparrows, chaffinches, mallards and blackbirds.\nMemorials\nThere are two significant memorials in the gardens:\n* The Scott Memorial unveiled in 1913 is a tribute to Robert Falcon Scott and the men who died during the Antarctic expedition of 1912.\n* The Rees Memorial was built in 1978 by the Queenstown and District Historical Society to commemorate the arrival of the areas first settler William Gilbert Rees who arrived in 1860.\nGallery\nImage:Queenstown (5862637465).jpg|Luma Southern Lights Festival\nImage:Silver fern statue, Queenstown Park; 24.03.19.jpg|Entrance artwork\nImage:Queenstown Gardens, New Zealand (15).JPG|Rotunda\nImage:The Scott Memorial, Queenstown Gardens, New Zealand (6).JPG|The Scott Memorial\nImage:Rees Memorial in Queenstown Gardens.jpg|Rees Memorial\nImage:Rosa 'Augusta Luise' kz02.jpg|The Rose Gardens\nImage:Queenstown NZ Parkrun 6th January 2014.jpg|Queenstown Parkrun\nArtworks\nThere is a range of different artworks that can be found in the gardens:\nImage:Kuri Sculpture in the Queenstown Gardens.jpg|Kurī Sculpture by Richard Wells\nImage:Wooden_artwork_in_the_Queenstown_Gardens.jpg|Wooden artwork\nImage:Woman_on_pillows_artwork_Queenstown_Gardens.jpg|Woman sitting on pillows\nImage:Auxilium_artwork_Queenstown_Gardens.jpg|Auxilium by Andrew Rogers\nImage:The_Good_Book_sculpture_Queenstown_Gardens.jpg|The Good Book sculpture by Trevor Askin\nReferences\nExternal links\n* [http://www.queenstowntennisclub.co.nz/ Tennis Club]\n* [http://www.bowlsqueenstown.co.nz/ Bowling Club]\n* [https://newzealandhoneymoonpackages.com/location/new-zealand/south-island/queenstown/ Queenstown Honeymoon Packages]\n* [http://www.queenstownicearena.co.nz/ Queenstown Ice Arena] (Home of the Southern Stampede and the Queenstown Ice Hockey Club)\n* [https://www.parkrun.co.nz/queenstown/ Queenstown Parkrun]\n* [https://luma.nz/ Luma Southern Light Project]"
    }
  ]
}