{
  "content": [
    {
      "type": "text",
      "text": "# Queen Elizabeth II Island\n\n__NOTOC__\n| etymology           = Named after Elizabeth II\n| location            = Lake Burley Griffin, Canberra ()\n| total_islands       = 1\n| area_km2            =\n| area_footnotes      =\n| rank                =\n| length_km           =\n| length_footnotes    =\n| width_km            =\n| width_footnotes     =\n| coastline_km        =\n| coastline_footnotes =\n| elevation_m         = 578\n| elevation_footnotes = (approx.)\n| highest_mount       =\n| country             = Australia\n| population          = 0\n| website             =\n}}\nQueen Elizabeth II Island, formerly Aspen Island, is an artificial island located within Lake Burley Griffin, in Canberra, Australian Capital Territory, Australia. It lies within the Parliamentary Triangle.\nThe island is located on the south-eastern side of the Central Basin of Lake Burley Griffin and is linked by a footbridge to the mainland at Kings Park. The Australian National Carillon is situated on the island, and the footbridge is named after John Douglas Gordon, who played the inaugural recital. Queen Elizabeth II Island is the largest of three islands at the south-eastern end of the Central Basin. The two smaller adjacent islands are unnamed.\nHistory\nThe island was originally gazetted as Aspen Island on 21 November 1963, and named after the aspen tree, of which some are classified by botanists in the section Populus, of the poplar genus.\nOn 1 January 2022, prime minister Scott Morrison announced that Aspen Island would be renamed Queen Elizabeth II Island in June 2022 as part of the Australian celebrations of the Platinum Jubilee of Elizabeth II, Queen of Australia. The island was renamed on 4 June in a ceremony presided over by the newly elected prime minister Anthony Albanese.\nGallery\nAspen Island.jpg|The north-west end of Queen Elizabeth II Island, during summer.\nAspen Island November 2014.jpg|Queen Elizabeth II Island viewed from the Kings Avenue Bridge\nQueen Elizabeth II Island Sign.jpg|Queen Elizabeth II Island Sign\nSee also\n* List of islands of Australia\nReferences"
    }
  ]
}