{
  "content": [
    {
      "type": "text",
      "text": "# Queer culture in the Southern United States\n\nQueer Culture has been a fundamental part of the United States Southern Culture for hundreds of years. When examined through a queer lens, it denotes not only a geographic region but also a constellation of ideologies, including notions of “authentic” Southern identity, heritage, religion, and conservative social norms. Many indigenous people and tribes have been driven out of the South by colonial violence. Despite this, the South today contains the largest concentration of queer individuals and people of color in the United States. Approximately 35% of LGBTQ+ people in the country reside in the South, compared with 19% in the Northeast. Among the queer people living in the south about 40% also identify as people of color.\nFor many feminists and queer people in the South, engaging with regional history has been a significant factor in political and social  \"radicalization\". It's a common misconception that queer activism did not happen in the South but rather in the metropolitan areas of the West and North. However, before explicitly queer political movements gained visibility, the South served as a central site of radical social struggle, most notably during the Civil Rights Movement. By the 1970s, queer feminist activism in the region was already well established. Examples of early queer activism in the South include the Georgia gay liberation front, Lambda Inc (the first queer community center in Alabama), Mississippi gay alliance, and the Carolina gay association. Despite the activism seen in the South, the South still has the least amount of protections for queer people in the United States. Since the 70's queer activism in the South increased, many queer organizations have formed and interest on the issue has increased.\nAnti-Trans Issues\nIn the early 1920's,  a growing number of anti-transgender and anti-drag legislative proposals appeared across the United States, with the highest concentration occurring in Southern states. All southern states but Virginia, North Carolina, and South Carolina, have passed laws that ban gender-affirming care for trans people under the age of 18. Although North Carolina and South Caroline not having any passed laws, both states have had these laws considered. On 2 March 2023, Tennessee signed into action a bill that explicitly bans drag shows in public spaces While Tennessee remains the only state to have implemented a drag-specific ban, several other Southern states, including South Carolina, Texas, West Virginia, and Kentucky, have considered similar bills during 2023. The existence of these bills has prevented and continues to prevent trans youth from getting the medical care they need to continue living in the South.\nWomen in print movement\nThe women in the print movement were most prominent between the 1970s and 1990s. The movement promoted print and literature as a means of communication and liberation. Queer people and queer/feminist topics have historically not been included in literature and the women in print movement worked to change that through its explicitly queer feminist writing. The vast majority of the print was either self-published or published through an explicitly feminist publishing company, such as Nadia Press. The forms of print included: journals, paperbacks, zines, newsletters, underground publications, etc.  Although the movement wasn't explicitly Southern, it was still prominent in the South. The existence of underground print in the South allowed queer people to organize, and share ideas, stories, and experiences without the danger and social scrutiny associated with mainstream print.\nNotable queer Southern print and people\n*June Arnold (1926–1982) was a southern lesbian novelist who was very active in the women in print movement, founded Daughters inc, a distinctly queer and feminist publishing house, and wrote for various other queer southern publications. Her writing focused on lesbian living and the South.\n*Pat Parker (1944–1986), was a Southern lesbian poet. She was an active member of the women's movement and was a member of the early black panther party. Her writing has been described as the standard for the women's liberation movement. Her writing focused on life as an African-American lesbian, feminism, poverty, etc. Some of her most notable writings include Jonestown & Other Madness, Woman Slaughter, and Movement in Black.\n* Michael Stipe (born 1960) is an American singer and former frontman of the alternative rock band R.E.M. Born in Decatur, Georgia, Stipe revealed in 1994 that he had relationships with men and women, later describing himself as \"queer\" in 2001.\n*Alice Walker (born 1944) is a southern lesbian writer, despite not coming out until much later in life after publishing her most notable work. Walker is most known for writing The Color Purple a novel that follows a Southern African-American lesbian. Walker also was the first African-American woman to win the Pulitzer Prize for The Color Purple.\n*Amazon Quarterly is credited as the first lesbian journal. Although this journal wasn't exclusively Southern, one of the founders was from the South and that was occasionally reflected in the writing present.\n* Nadia Press was a lesbian feminist publishing company (active 1973-2003) located in Florida. The company mainly published queer fiction stories but also published general queer writing and books.\n* Sinister Wisdom is a lesbian literary and art journal that focuses on lesbians living in the South. It was founded in 1979 by Cathrine Nicholson and Harriet Ellenberger as a place for southern queer people to submit their writing and art. Some notable people who have written for the journal include Audre Lorde, Adrienne Rich, and Pat Parker. Eventually, the journal moved its headquarters to Nebraska but despite this move, it still held its focus on Southern lesbians.\n*Feminary was created shortly after Sinister Wisdoms move to Nebraska. Feminary is a Southern lesbian journal, originally a newsletter, created in 1978 in  North Carolina's research triangle, originally a newsletter, whose focus was Southern lesbian-feminist consciousness and intersectionality. When viewing the idea of \"southern\" the journal directly addresses the issue of race in the South, something that queer journals didn't typically do during this time. The journal worked to create new issues until 1982.\nSee Also\n* LGBTQ rights in the United States\n* LGBTQ rights by country or territory\nReferences"
    }
  ]
}