{
  "content": [
    {
      "type": "text",
      "text": "# Queenstown Airport\n\n| operator            = Queenstown Airport Corporation Ltd.\n| city-served         = Queenstown\n| location            = Frankton, Otago, New Zealand\n| hub                 = Glenorchy Air\n| elevation-f         = 1,171\n| elevation-m         = 357\n| metric-elev         = yes\n| coordinates         =\n| website             =\n| pushpin_map         = New Zealand\n| pushpin_map_caption = Location of airport in New Zealand\n| timezone            = NZST\n| utc                 = UTC+12:00\n| summer              = NZDT\n| utcs                = UTC+13:00\n| r1-number           = 05/23\n| r1-length-f         =\n| r1-length-m         = 1777\n| r1-surface          = Grooved Bitumen\n| r2-number           = 14/32\n| r2-length-f         =\n| r2-length-m         = 720\n| r2-surface          = Bitumen\n| metric-rwy          = yes\n| stat1-header        = Passengers total\n| stat1-data          = 2,210,034\n| stat2-header        = Aircraft movements\n| stat2-data          = 10,101\n| stat-year           = 2022\n| footnotes           =\n}}\nQueenstown International Airport  is an international airport located in Frankton, Otago, New Zealand, which serves the resort town of Queenstown. The airport handled 2.10 million passengers as of 2024, making it the fourth busiest airport in New Zealand by passenger traffic. The airport is known for its scenery and challenging approach to land due to the nearby high terrain and proximity to housing.\nHistory\naircraft]]\nQueenstown Airport was first licensed to operate in 1935, but it was not until the 1950s that commercial flights became commonplace, particularly commercial sightseeing operations to Milford Sound.\nA regular scenic route between Queenstown and Dunedin was first established by Southern Scenic Air Services Ltd on 17 July 1950.\nIn the 1960s, the original grass runway was lengthened.\nMount Cook Airline was the pioneer of tourist flights into Queenstown.\nRegular services from Christchurch began on 6 November 1961, operating DC-3s with three flights a week on a Monday, Wednesday, and Friday to Queenstown via Mount Cook and onto Te Anau-Manapouri.\nAnsett New Zealand introduced the first jet aircraft flights into Queenstown Airport in 1989 using British Aerospace 146 aircraft.\nIn 1995, Air New Zealand began operating Queenstown Airport's first trans-Tasman flight from Sydney. Since this, an almost continuous expansion programme began to cater to passenger and airline demand.\nIn 2010, runway lighting was installed to enhance low-visibility operations during daytime. In 2012, the airspace around Queenstown was redesigned to allow for Required Navigation Performance, Authorisation Required (RNP AR) operations.\nIn April 2012, Queenstown Airport opened its new sealed cross-wind runway on the former grass runway; the cost of this project was $800,000 and took 10 months to complete. Sealing the runway reduced the number of disruptions as well as further improved safety.\"\nAfter announcing plans to expand the airport in 2010, work began in 2014 to extend the international terminal. On 23 June 2015, the new $17 million international terminal was opened. The  expansion to the southern end of the terminal building doubled the size of the airport's international operations, and brought a new mezzanine level on top to enable airbridges to be built at a later stage.\nIn November 2015, Queenstown Airport commenced a $17 million series of major airfield infrastructure improvements designed to improve operations for evening flights in winter 2016 and improve overall safety and efficiency of operations.\nIn June 2015, the airport launched its new international terminal.\nIn May 2014, New Zealand's Civil Aviation Authority (CAA) and Australia's Civil Aviation Safety Authority (CASA) approved Queenstown Airport's foundation safety case for after-dark flights, reliant on some additional infrastructure, including upgraded runway lights and widening the main runway to . On 4 May 2016, the airport's runway lights were officially switched on by transport minister Simon Bridges. The runway lighting allowed the airport to extend operations beyond sunset to its 10:00 pm noise abatement curfew. The first after-dark flight was a Jetstar flight from Melbourne on 24 June 2016.\nThe airport was voted 'World's Most Scenic Airport Landing' in 2015 by international private jet booking service PrivateFly.\nIn March 2025, the airport finished installing an engineered materials arrestor system (EMAS) at both ends of the primary runway, becoming the first airport in Australasia to do so. In the event of a runway overrun, this system is designed to safely bring the aircraft to a stop, thus greatly reducing the damage to the aircraft and the risk of injury to those onboard and on the ground.\nTerminal\nQueenstown Airport has a single terminal that handles both international and domestic flights. It has been expanded several times since the 1990s to cope with the introduction of international flights and the rapid increase in passenger numbers. The terminal consists of a single level with nine gates. The terminal  does not utilise jet bridges, however an expansion of the international departures area in 2015 included the construction of a mezzanine level to allow for the possible future provision of jet bridges.\nOperations\nAir New Zealand currently operate domestic flights to Auckland, Wellington and Christchurch, while Jetstar operates domestic services to Auckland and Wellington. Air Safaris currently operate a link service to Lake Tekapo airport.\nInternational services have increased over recent years with services to Sydney, Melbourne, Brisbane, and the Gold Coast operated by Air New Zealand, Jetstar, Qantas and Virgin Australia.\nQueenstown Airport is also used for sightseeing flights, especially to Milford Sound and Aoraki Mount Cook.\nAirlines and destinations\nChristchurch, Melbourne, Sydney, Wellington  Seasonal: Brisbane (resumes 22 June 2026)\n| Glacier Southern Lakes Helicopters | Milford Sound\n| Glenorchy Air | Milford Sound, Stewart Island\n| Jetstar | Auckland, Gold Coast, Melbourne, Sydney, Wellington  Seasonal: Brisbane (begins 15 June 2026)\n| Milford Flights | Milford Sound\n| Milford Sound Flightseeing | Milford Sound\n| Qantas | Brisbane, Melbourne, Sydney\n| True South Flights | Milford Sound\n|Virgin Australia | Brisbane, Melbourne, Sydney\n}}\nStatistics\n{| class=\"wikitable sortable\" style=\"font-size: 95%;\"\n|+ Busiest international routes to and from ZQN (2023)\n|- style=\"background:lightgrey;\"\n! Rank || Airport || Passengers\n|-\n| 1 || Sydney || 377,215\n|-\n| 2 || Melbourne || 250,185\n|-\n| 3 || Brisbane || 133,189\n|-\n| 4 || Gold Coast || 51,820\n|}\nStrategic partnership with Auckland Airport\nOn 8 July 2010, Auckland International Airport Limited, the operator of Auckland Airport, announced it had agreed to take a 24.99% shareholding in Queenstown Airport Corporation Limited and formed a strategic alliance between the two airports. The alliance was expected to generate an extra 176,000 passengers annually through Queenstown Airport.\nIncidents\nOn 22 June 2010, a Pacific Blue flight to Sydney departed from Queenstown. At the time, the airport had no runway lights, so the airline mandated that departure occur at least 30 minutes before evening civil twilight, allowing enough time for the aircraft to return to the airport case of an emergency. The Boeing 737–800 took off on a departure requiring a visual segment, after the departure time limit and in poor weather conditions. Passengers described a distressing take-off procedure, with the aircraft flying at a low altitude above Lake Wakatipu and the surrounding mountain terrain. The take-off was deemed an endangerment to the safety of the 70 passengers and crew aboard by the Civil Aviation Authority. Both pilots were suspended over the incident, and in April 2011, the flight's captain was charged under the Civil Aviation Act with unnecessary endangerment. This charge was later reduced to one of a careless use of an aircraft, with a maximum fine of NZ$7,000. In March 2013, the pilot, Roderick Gunn, was found guilty and fined $5,100.\nIn another separate incident in June 2010, two airliners were found to have had a high potential to have breached the required 1000-foot vertical separation, according to a report by the New Zealand Transport Accident Investigation Commission. Both were Boeing 737 aircraft, one operated by Qantas and the other by Pacific Blue. The report states that the breach was not investigated further because, in such circumstances, it was clear (1) that the potential for such a breach was high and (2) that, by itself, such a potential was a safety issue that needed addressing. Because of the report and other concerns, Airways New Zealand and the Civil Aviation Authority have changed the procedures at Queenstown Airport. Flight paths have been altered for large passenger aircraft, along with the use of multilateration air traffic management that both organisations say will ensure this situation is unlikely to be repeated.\nSee also\n* List of airports in New Zealand\n* List of airlines of New Zealand\n* Transport in New Zealand\n* List of busiest airports in New Zealand\nReferences\nExternal links\n*[http://www.queenstownairport.co.nz/ Official website]"
    }
  ]
}