{
  "content": [
    {
      "type": "text",
      "text": "# Queen Aminata\n\nAminata Sylla, better known by her ring-name Queen Aminata, is a Guinean professional wrestler. She is signed to All Elite Wrestling (AEW) and AEW's sister promotion Ring of Honor (ROH). She is also known for time in Ohio Valley Wrestling (OVW), and on the American independent circuit.\nEarly life\nSylla has stated she immigrated from Guinea to the United States in April 2013, having previously lived and studied in Paris, France. While there, Sylla studied private international law and was qualified to practice in France.\nProfessional wrestling career\nEarly career (2017–2020)\nAminata made her debut in 2017, wrestling largely on the independent circuit in Ohio. On April 30, 2017, she wrestled at a WWE house show teaming with Kaylee, losing to Asuka and Kairi Sane. In 2020 she wrestled in Japan for various promotions including Sendai Girls. She also worked for MCW Pro Wrestling.\nAll Elite Wrestling / Ring of Honor (2021–present)\nAminata (left) towering over Mio Momono in February 2024\nOn April 7, 2021, she made her All Elite Wrestling (AEW) debut on Dark, teaming with Amber Nova and losing to Big Swole and Red Velvet. She made her television debut on November 23, 2022, on Rampage, losing to Hikaru Shida.She made her debut for AEW's sister promotion Ring of Honor (ROH) on the December 23 episode of Ring of Honor Wrestling, defeating Maya World.\nOn January 3, 2024, she made her Dynamite debut, losing to newcomer Mariah May. On the February 16 edition of Rampage, Aminata gained her first victory in AEW by defeating Anna Jay. Following the match, it was announced that Aminata was officially signed to the company. In the same month, Aminata entered a tournament to crown the inaugural ROH Women's World Television Champion. She defeated J–Rod in the first round, Taya Valkyrie in the quarterfinals and Red Velvet in the semifinals to face Billie Starkz in the final at Supercard of Honor. At the event on April 5, Aminata lost to Starkz after Starkz feigned an injury to choke out Aminata to win the title. On July 26 at Death Before Dishonor, Aminata unsuccessfully challenged Athena for the ROH Women's World Championship after interference from Athena's stablemate Lexy Nair. On the October 16 episode of Dynamite, Aminata unsuccessfully challenged Mercedes Moné for the AEW TBS Championship.\nOn July 12, 2025 at All In, Aminata competed in the women's Casino Gauntlet match, which was won by Athena.\nPersonal life\nSylla has stated she is a polyglot who can speak four languages: French, English, Susu and Fulani. She is a Muslim, as well as a mother.\nChampionships and accomplishments\n*Deadlock Pro-Wrestling\n**DPW Women's Worlds Championship (1 time, current)\n**Battle Of The Best Tournament (2025)\n*Generation Championship Wrestling\n**GCW Women's Championship (1 time)\n**Diamond Cup (2020)\n*IWA Mid-South\n**Miss Independent 2\n*Pro Wrestling Illustrated\n** Ranked No. 55 of the top 250 female wrestlers in the ''PWI Women's 250'' in 2024\nReferences\nExternal links\n*"
    }
  ]
}