{
  "content": [
    {
      "type": "text",
      "text": "# Queen's Hotel, Kandy\n\nThe '''Queen's Hotel''' is an 80-room British Colonial style three star hotel, located at central hill capital Kandy  in Sri Lanka. Located in the center of the city at end of the main street, this former Governor's residence is one of the oldest hotels in Sri Lanka with a history of over 160 years. It is currently managed by the Ceylon Hotels Corporation PLC.\nThe hotel was originally constructed as a residence, the 'Dullawe Walauwa', designed by Devendra Mulachariya on instructions from King Sri Vickrama Rajasinha. Soon after the British defeated the Kandyan Kingdom in 1815, it was adapted as a mansion for the Governor of Ceylon, with adjoining buildings constructed to house British troops. The building was subsequently converted into the barracks for the Ceylon Rifle Regiment. In 1840 it was used as a hostel, known as Malabar House, due to its location on Malabar Street (now known as D S Senanayake Veediya). It was then operated as a boarding house, known as the Stainton Hotel, managed by James Stainton. After his death in 1863 his wife continued to run the business until 1869.  In 1869 it opened under new management, the Queens Hotel Company, and its name was changed to the Queens Hotel. In 1895 it was acquired by Kandy Hotels Company Limited who undertook extensive enlargements and improvements to the building, in order to make it into a first-class hotel.\nNotable attractions of the hotel are the Queen of Hearts restaurant, Royal Ball Room and The Pub Royal, the latter being the only British Pub in the city that offers service with old colonial flavor. The Lord Mountbatten Lounge Bar was named after Lord Mountbatten of Burma who was a frequent guest at the Queen's when he was the Supreme Allied Commander South East Asia Theatre with the South East Asia Command based in Kandy.\nFacilities\nThe hotel has 80 rooms, including five suites, two restaurants, a coffee shop, hair/beauty saloon and a souvenir/gift shop. It also has an outdoor swimming pool and BBQ facilities.\nSee also\n*\nReferences"
    }
  ]
}