{
  "content": [
    {
      "type": "text",
      "text": "# Queensland Pioneer Steam Railway__disambig_2\n\nThe Queensland Pioneer Steam Railway is located near Ipswich, Queensland, Australia and runs through the former West Moreton pioneering coal fields. It was first opened in 1881 by colliery proprietor and politician Lewis Thomas (1832–1913) as a tramway to his coal mines.\nThe right-of way was later taken over by Queensland Railways and extended to take in over 20 mines before reaching to its present terminus at Swanbank Loop where it served the Swanbank Power Stations. The branch remains the oldest continuously operating branchline in Queensland. Since 1978, Queensland Pioneer Steam Railway has operated passenger trains on this branch line using heritage rollingstock.\nOperations\nThe  narrow gauge Railway conducts steam/heritage diesel train trips from Bundamba Racecourse on the Swanbank Branch Line to either Swanbank Power station, near Ipswich, Queensland, Australia, or to '3 Mile 8 Chain' Box Flat balloon loop.\nQueensland Pioneer Steam Railway (QPSR) operate heritage railway excursions through the scenic and historic country side of the Bundamba, West Moreton and Swanbank area's. The train operates using heritage locomotives and rollingstock ranging from 100 year old timber carriages to former Sunlander carriages.\nThe Swanbank Branch line is made up of the old Redbank-Bundamba Loop Line and The Swanbank Extension. There are diverse gradients and negotiating winding curves throughout the trip.\nHistory\nQueensland Pioneer Steam Railway (QPSR) Co-operative Ltd was registered as a non-profit railway society in 1978 by a small group of railway enthusiasts from Ipswich and Brisbane. QPSR was formed to manage the restoration and operation of a vintage steam train which the group had rallied together earlier in 1977 to purchase, ex-Queensland Railways Steam locomotive PB15 No 448 from the defunct Pioneer Valley Heritage Park at Kuraby.\nThe group obtained the permission of Redbank Malt Factory to store the locomotive on their privately owned rail siding. After investigating many proposals for a permanent home, the Queensland Electricity Generating Board agreed to allow QPSR access to their branch railway from Box Flat to Swanbank.\nQPSR ran its first steam train rides at Swanbank during the 1978 Ipswich Colour City Carnival, using carriages hired from QR. Steam trains ran again for the 1979 Colour City Carnival and in 1980 a full season of operation weekends was planned.\nStations\nSwanbank\nLocated next to the Swanbank lake, the heritage station located at Swanbank park was formerly located at Forest Hill and survived under Queensland Rail until 2003. It was relocated to this spot and restored. It has been fitted with 1930s vintage communication equipment, luggage conveyance and weighing systems as well a souvenir shop. This building took over from the former Albion Station waiting shed that had served previously as the station since 1981.\nBox Flat\nWestfalen Collieries allowed QPSR to use part of its property at Box Flat to establish a depot, a commitment today continued by the Gunne organization that own the land. Track laying started into the depot site, a compound was erected and in 1981 a shed was started and then completed.\nRacecourse\nThe Bundamba Racecourse station was on TL Cooney Av opposite the entrance to Bundamba Racecourse and is located a short distance () from Bundamba railway station. The station never had a large building and was only ever a grass high level platform; since 2014 the organization has been looking to develop the site with a building and more facilities.\nLocomotives\nPB15 448\nEx-Queensland Railways PB15 class locomotive, Number 448  has been the main stay of the railway and following a 10-year overhaul is fully restored in working order. It is one of over two hundred locomotives of this class to be purchased by the Queensland Railways, this engine was built by Walkers Ltd. Maryborough, Queensland to the design of locomotive engineer H. Horniblow, and was allocated construction number 91 of 1908. The tender, which is carried on two four wheel bogies carries 4 Ton (4064&nbsp;kg) of coal and 1800 gallons (81231) of water. It was sold to K.R. Hunter's Pioneer Valley Amusement Park after its retirement in August 1970, from where a group of Ipswich and Brisbane enthusiasts purchased it on that venture's failure.\nKilrie\nThe second locomotive is known as Kilrie which was built in 1924 by Perry Engineering, Gawler, South Australia. One of twelve 0-4-0T locomotives purchased by the State Rivers and Water Supply Commission of Victoria for construction of the Hume Weir on the Murray River, near Albury.  At completion of construction duties in 1935 it was sold to the Pioneer Sugar Mill, Brandon, Queensland where it received the name \"Kilrie\".  In 1960 it was modified from 0 to 4-0T to 0-4-2T wheel arrangement, together with conversion from coal to oil firing.\nKilrie entered preservation when sold to the Australian Narrow Gauge Railway Preservation Society (ANGRMS) at Woodford.  Being 3’ 6\" gauge, Kilrie perhaps did not easily fit with their 2’ gauge collection and operating railway, so Kilrie was placed on long-term lease to the Queensland Pioneer Steam Railway (QPSR) at Swanbank, west of Brisbane.  In 2008, Kilrie was purchased outright by the QPSR following donations made by the Ipswich City Council, Babcock & Brown and Payce.\nKilrie has served as an operating loco at Swanbank for many years, during which time it has been restored to coal firing and fitted with Westinghouse automatic air braking.\nDEL 1616\nThe eighteen members of the 1600 class diesel electric locomotive were designed and constructed by the English Electric Co. at their Rocklea Brisbane, works. Two contracts were let of which the first was for twelve with a follow on contract for another six. The first batch were delivered between December 1962 and June 1963, with the others arriving between October 1963 and January 1964. A lengthy delay occurred before delivery owing to the first four being over the design weight. This resulted in numbers 1604 and 1605 being the first to enter service. All others were delivered after the weight problem had been overcome.\nThe unit at Swanbank is 1616 (construction number A079 of December 1963). It was condemned by the Queensland Railways during April  1991 and was purchased by QPSR in August 1991. Designed for branch line use these units are a hood-type with a full-width cab across one end. They are fitted with dual driving stations to permit operation in either direction without the requirement to turn the locomotive\nMount Isa Mines 5802\nIn November 2020, QPSR (assisted by Ipswich City Council) acquired Ex-Mount Isa Mines Diesel-Hydraulic shunter 5802 from Zig Zag Railway. This locomotive has a repainted in a facetious livery of deep blue and cream lining, inspired by the NSWGR 40 Class. It is planned to operate in conjunction with other locomotives such as Kilrie.\nGuest Locomotives\nDuring special events or during periods of high patronage QPSR has hired in Queensland Rail Heritage Locomotives. Most recently locomotive 221a, a member of the American built AC16 class, joined the running fleet as part of the Troop Train Event of 2016 as a representative of US involvement in the Australian war effort of WW2. In 1991, the railway played host to A10 number 6\nC17 761\nThis C17 locomotive was built by Walkers Limited, Maryborough given the plate number 422 with the locomotive being built in 1927. In April 1927, 761 entered service lasting for 42 years until being written off from the books in October 1969. The locomotive was then displayed at the Mitchell Memorial Park in Mitchell, a town west of Roma.\nThe locomotive was purchased by the Queensland Pioneer Steam Railway in March 2019, with the main intention being that C17 761 would be restored as a second steam locomotive (with PB15 448 being the main locomotive). The locomotive was planned to be given a name - 'Booringa' - in honour of the Booringa Shire Council. The locomotive formally arrived at Ipswich in February 2020 with C17 761 arriving in a better condition (perhaps due to the arid climate of Mitchell). C17 996 was traded in for C17 761, with C17 996 being sold to the Mary Valley Rattler for spare parts.\nCarriages\nMost day time trips use the Co-ops timber set, built between 1885 and 1950 this set of well appointed coaches offer a cross section of rail travel in Queensland in the 1950s ranging from the oldest operating side door coach in Queensland (Van 110), to the last operating \"Prison Van\" in Australia, right through to a Kuranda Parlour coach.\n\"The Queensland Pioneer\" Dinner Trains feature former Sunlander, Mid and Westlander coaches completed in 1954. These carriages showed a style and opulence in Queensland Rail travel that has never quite been matched on general intercity travel.\nSpecial & Notable Events\nTroop Train\nAnnually Queensland Pioneer Steam Railway holds a Troop Train. These recreations of the World War 1 and 2 military operations that operated across Australia during hostilities feature re-enactors, returned service vets, multiple military and war department vehicles as well as period dance and music.\nMurder Mystery Trains\nMurder Mystery Trains have become a staple feature of the QPSR calendar and generally form part of Dinner TraTin Experiences and see passengers trying to work out \"who dun it\".\nThe Train Tea Society\nIn May 2016, QPSR and the Flowers Theatre company broke new ground in hosting the play \"Train Tea Society\" at the Swanbank Station as part of the Anywhere Theatre Festival - which had been converted to theatre seating for the event.\nThe award-winning work by writer and comedian Emily Vascotto was directed by Gabriella Flowers and tells the story of Mrs J.A \"Eliza\" Cameron and her team of Ipswich women who served tea to returning troops during the First World War.\nThis is believed to be the first documented staging of a theatrical production with a steam locomotive operating under its own power.\nReferences\n* Behan, D.D. (November 1998). \"The Redbank-Bundamba Loop Line and the Swnabank Extension\". Australian Railway Historical Society Bulletin: 410–420.\n* Turner, Jim (1997). Australian Steam Locomotives 1896–1958. Kenthurst: Kangaroo Press. pp.&nbsp;21, 88. .\n* Armstrong, John (1994). Locomotives in the Tropics Volume 2. Brisbane: Australian Railway Historical Society. pp.&nbsp;79–83, 102–106. .\n* Oberg, Leon (2010). Locomotives of Australia 1850s-2010. Dural: Rosenberg Publishing. pp.&nbsp;106–108, p. 240.. .\n* [http://www.qpsr.net/1600.shtml 1600 Class Diesel Electric] [https://web.archive.org/web/20140124092059/http://www.qpsr.net/1600.shtml Archived] 24 January 2014 at the Wayback Machine. Queensland Pioneer Steam Railway\n* Behan, D.D. (January 1999). \"The Redbank-Bundamba Loop Line and the Swnabank Extension\". Australian Railway Historical Society Bulletin: 12–18.\n* Behan, D.D. (April 1999). \"The Redbank-Bundamba Loop Line and the Swnabank Extension\". Australian Railway Historical Society Bulletin: 139–145.\n* Armstrong, J. (September 1965). \"The Special Racecourse Trains to Bundamba\". Australian Railway Historical Society Bulletin: 164–167.\n* Kerr, J.D. (June 1968). \"The Redbank-Bundamba Loop Line\". Australian Railway Historical Society Bulletin: 129–147\nNotes\nExternal links\n* [http://www.qpsr.org/ Queensland Pioneer Steam Railway]"
    }
  ]
}