{
  "content": [
    {
      "type": "text",
      "text": "# Quentin Durward\n\nQuentin Durward is a historical novel by Sir Walter Scott, first published in 1823. The story concerns a Scottish archer in the service of the French King Louis XI (1423-1483) who plays a prominent part in the narrative.\nComposition and sources\nQuentin Durward was composed in a remarkably short space of time. After carrying out some preparatory research towards the end of 1822 Scott began writing in January 1823 and supplied the finishing sentences in response to a request from his coadjutor James Ballantyne on 3 May.\nScott's principal source was the Mémoires of Philippe de Commines. As usual he adapts historical facts freely in the construction of his fiction, though he generally follows Comines' balanced approach to the character of Louis XI. He was able to make substantial use of other documents and the editorial commentary in the collection in which Comines was included, the first series of the ''Collection complete des mémoires relatifs a l'histoire de France'' by [Claude Bernard] Petitot (1819‒26). Occasional details are drawn from a wide range of historians, most of whom were more hostile to Louis. It is likely that some details for Scott's descriptions of northern France were derived from manuscript material deriving from continental journeys by his friend James Skene of Rubislaw. For his gipsy material Scott relied largely on two works: 'Dissertation on the Gipseys ... from the German of H. M. G. Grellmann (1807), and A Historical Survey of the Customs, Habits, and Present State of the Gypsies by John Hoyland (1816).\nEditions\nThe first edition was published in three volumes in London on 17 May 1823 by Hurst, Robinson, and Co., and in Edinburgh two days later by Archibald Constable and Co. As with all the Waverley novels before 1827 publication was anonymous. The print run was 10,000 and the price one and a half guineas (£1 11s 6d or £1.57½). In 1830 Scott provided Quentin Durward with an introduction and notes for the 'Magnum' edition, where it appeared in two volumes in December 1831 and January 1832.\nThe standard modern edition, by J. H. Alexander and G. A. M. Wood, was published as Volume 15 of the Edinburgh Edition of the Waverley Novels in 2001: this is based on the first edition; the 'Magnum' material appears in Volume 25b.\nPlot introduction\nThe plot centres on the medieval rivalry between Louis XI of France and Charles the Bold, Duke of Burgundy. Louis incites the citizens of Liège to revolt against Charles, and they seize and murder Charles's brother-in-law, Louis de Bourbon, Bishop of Liège, under the command of Louis's ally, William de la Marck, who was hoping to install his son in Louis de Bourbon's place (a real historical event which occurred in 1482).\nAt the time of the murder, Louis is present in Charles' camp at Péronne, hoping to fool him with a false display of friendship. Charles, however, sees through his mask of deceit, accuses him of instigating the uprising, and has him imprisoned. Louis's superior coolness of mind permits him to allay Charles's suspicions and to regain his liberty. In a sub-plot, the Burgundian heiress Isabelle de Croye takes refuge at Louis's court when Charles attempts to give her hand in marriage to his odious favourite Campo-Basso. Louis, in turn, resolves to give her in marriage to the bandit-captain William de la Marck, and sends her to Flanders under the pretence of placing her under the protection of the Bishop of Liège. She is guarded on her journey by Quentin Durward, an archer, who has left behind poverty in Scotland to join the Archers of Louis's Scottish Guard. Quentin prevents the intended treachery and earns Isabelle's love. Charles, though, promises her in marriage to the Duke of Orléans (heir to the French crown) but she refuses, and, in anger, the Duke promises her to whoever brings him the head of de la Marck. This Quentin does with the help of his uncle, Ludovic Lesley, and wins Isabelle's hand.\nPlot summary\n'' by Richard Parkes Bonington, 1828]]\nThe story takes place in the year 1468. The age of feudalism and chivalry is passing away, and the King of France incites the wealthy citizens of Flanders against his own rebellious vassal the Duke of Burgundy. Quentin Durward comes to Tours, where his uncle is one of the Scottish bodyguard maintained by Louis XI, to seek military service, and is invited by the king, disguised as a merchant, to breakfast at the inn, and supplies by him with money. Narrowly escaped being hanged by the provost-marshal for cutting down Zamet, whom he finds suspended from a tree, he is enlisted by Lord Crawford. In the presence chamber, he is recognised by Louis. The royal party is preparing for a hunting excursion, when the Count of Crèvecœur arrives with a peremptory demand for the instant surrender of the duke's ward, the Countess of Croye, who has fled from Burgundy with her aunt to escape a forced marriage; and proclaims that his master has renounced his allegiance to the crown of France. In the chase which follows, Durward saved the king's life from a boar, for which service Louis, after consulting with his barber, entrusts him with the duty of conducting the countess and Lady Hameline, ostensibly to the protection of the Bishop of Liege, but really so that they might fall into the hands of William de la Marck. After proceeding some distance, they are overtaken by Dunois and the Duke of Orléans, who wanted to seize the countess, but are prevented by Lord Crawford, who arrives in pursuit and takes them prisoner. Then Hayraddin comes riding after them, and under his guidance they journey for nearly a week, when Quentin discovers that the Bohemian is in league with De la Marck. He accordingly alters their route, and they reach the bishop's castle in safety.\nA few days afterwards, however, it is assaulted by the citizens, and Hayraddin, having effected Lady Hameline's escape with Marthon, Quentin rush back to save the countess, and, at Gieslaer's suggestion, Pavilion passes them as his daughter and her sweetheart into the great hall where the outlaw, known as the Boar of Ardennes, is feasting with the rioters. The bishop, who is also governor of the city, is then dragged in, and, having denounced his captor, is murdered by a stroke of Nikkel Blok's cleaver. There is a shout for vengeance, but De la Marck summons his soldiers, upon which Quentin holds a dirk at the throat of his son Carl, and exhorts the citizens to return to their homes. With the syndic's help, Lady Isabella and her protector reach Charleroi, where she is placed in a convent, while he carries the news to the Duke of Burgundy, at whose court Louis, with a small retinue, is a guest. Charles, in a furious rage, accuses the king of being privy to the sacrilege and has him treated as a prisoner.\nAt a council the following day, he is charged with abetting rebellion among the vassals of Burgundy, and the countess is brought as a witness against him. She admits her fault, and Quentin Durward is being questioned respecting his escort of her, when a herald arrives with a demand from De la Marck to be acknowledged as Prince-Bishop of Liège, and for the release of his ally the King of France. Louis replied that he intends to gibbet the murderer, and the messenger, who is discovered to be Hayraddin, is sentenced to death, the quarrel between the duke and the king being at the same time adjusted, on the understanding that the Duke of Orléans will marry Lady Isabelle. Crèvecœur, however, intercedes for her, and it is arranged that whoever brings the head of the Boar of Ardennes can claim her hand. Quentin, who has learnt his plans from the Bohemian, advances with the allied troops of France and Burgundy against his stronghold, and a desperate battle ensues. At length the young Scot is in the act of closing with De la Marck, when Pavilion's daughter implores his protection from a French soldier; and, while placing her in safety, his uncle La Balafré fights the ruffian, and carries his head to the royal presence. Lord Crawford declares him to be of gentle birth, but the old soldier having resigned his pretensions to his nephew, King Louis vouches for Quentin's services and prudence, and the duke being satisfied as to his descent, remarks that it only remains to inquire what are the fair lady's sentiments towards the young emigrant in search of honourable adventure, who, by his sense, firmness and gallantry, thus becomes the fortunate possessor of wealth, rank and beauty.\nCharacters\nPrincipal characters in bold\n* Quentin Durward, a Scottish cadet\n* Ludovic Lesley, Le Balafré ('scarred'), his maternal uncle\n* King Louis XI of France, first seen as Maitre Pierre\n* Tristan l'Hermite, his provost-marshal\n* Petit-André, Tristan's assistant\n* Dame Perrette, hostess of 'The Fleur de Lys'\n* Isabelle, Countess of Croye, first seen as Dame Perrette's servant Jacqueline\n* Lady Hameline, her aunt\n* Lord Crawford, commander of Scottish archers\n* Count de Dunois, grand huntsman\n* Louis, Duke of Orléans, the future Louis XII\n* Cardinal Jean Balue\n* The Bishop of Auxerre\n* Olivier le Dain, the court barber\n* Princess Anne of Beaujeau and Princess Joan, the king's daughters\n* Philippe de Crèvecœur d'Esquerdes, Count of Burgundy\n* The Countess, his wife\n* Toison d'Or, his herald\n* William de la Marck, the freebooting 'Boar of the Ardennes'\n* Carl Eberson, his son\n* Hayraddin Maugrabin, a Bohemian\n* Zamet, his brother\n* Marthon, a gipsy woman\n* Louis of Bourbon, Prince-Bishop of Liège\n* Pavillon, a currier and syndic\n* Gertrude, his daughter\n* Peterkin Geislaer, his deputy\n* Nikkel Blok, a butcher\n* Philippe D'Argenton (Philippe de Commines)\n* Lord of Hymbercourt, governor of Liège\n* Duke Charles of Burgundy, or Charles the Bold\n* Le Glorieux, his jester\n* Martius Galeotti, or Martivalle, an astrologer\nChapter summary\nVolume One\nIntroduction:  In the course of an extended residence in France the Author is inspired by the library and family papers in the Chateau de Hautlieu to produce the narration that follows.\nCh. 1 The Contrast: The calculating Louis XI and the impulsive Charles the Bold of Burgundy are set against each other.\nCh. 2 The Wanderer: Quentin Durward, a Scottish archer in search of mercenary employment in France, encounters Maitre Pierre and a companion; after attending a hunting-mass they approach the royal castle of Plessis.\nCh. 3 The Castle: Maitre Pierre conducts Quentin past the castle to an inn.\nCh. 4 The Dejeuner: Maitre Pierre and Quentin discuss the archer's employment over breakfast. Quentin asks the innkeeper about Maitre Pierre's identity, but he is evasive. In his bedroom Quentin hears a young woman nearby singing 'County Guy' to her lute.\nCh. 5 The Man-at-Arms: Quentin and his uncle Ludovic Lesley (Le Balafré), serving in Louis's Scots Guards, catch up with family news. Quentin and Balafré debate whether it is preferable to serve Louis or Charles.\nCh. 6 The Bohemians: Quentin feels disappointed by Balafré's narrow-mindedness. He is threatened with execution by Louis's provost-marshal Tristan l'Hermite (Maitre Pierre's companion) and his assistant Petit-André for cutting down a hanged gypsy, but he is rescued by a detachment of the Guards under Balafré.\nCh. 7 The Enrolment:  Quentin is enlisted into the Guards by their commander Lord Crawford, who says that Isabelle of Croye and her aunt Lady Hameline have arrived to claim Louis's protection after Isabelle's rejection of her guardian Charles's proposal that she marry his favourite Campo-basso.\nCh. 8  The Envoy: At Court Louis, whom Quentin recognises as Maitre Pierre, attempts to mollify the Burgundian envoy Count Crevecœur who has demanded the return of the Croyes.\nCh. 9  The Boar-Hunt: Offended by Louis' behaviour towards himself, the Cardinal La Balue arranges to meet Crevecœur who has come to his assistance after a hunting fall. At the same hunt Quentin rescues Louis from the boar.\nCh. 10  The Sentinel: Louis arranges for Quentin to keep concealed watch as he entertains Crevecœur and Balue to dinner.\nVolume Two\nCh. 1 (11)  The Hall of Roland: Restored to open guard duty, Quentin witnesses a meeting between the Croyes and Princess Joan, whose destined husband the Duke of Orleans joins them and torments her by his attentions to Isabelle.\nCh. 2 (12)  The Politician: Louis explains to Oliver le Dain his intention to instruct Quentin to convey the Croyes to Liège so that William de la Marck can seize and marry Isabelle.\nCh. 3 (13)  The Journey: Delighted with his commission, Quentin accompanies Louis to the sage Galeotti, who says the scheme will bring success to the sender but danger to those sent. Galeotti promises to carry out an astronomical calculation relating to Louis' plan to negotiate with Charles in person, but privately determines to inform Balue.\nCh. 4 (14)  The Journey: As their journey begins, Quentin defends the Croyes from two horsemen: their combat is interrupted by the arrival of Crawford.\nCh. 5 (15)  The Guide: Crawford arrests the horsemen, revealed as Orleans and the Count de Dunois, and Isabelle tends Quentin's wound.  Hayraddin arrives to act as guide.\nCh. 6 (16)  The Vagrant: Hayraddin expounds his view of life to Quentin and identifies himself as the brother of the man whose body he had cut down in Ch. 6. He is expelled from monastic accommodation for egregious misbehaviour, arousing Quentin's suspicions.\nCh. 7 (17)  The Espied Spy: Quentin overhears Hayraddin and a Lanzknecht arranging to ambush the Croyes for William, while sparing Quentin's life.\nCh. 8 (18) Palmistry: Quentin obtains the Croyes' permission to change their planned route, and they arrive at Schonwaldt, the Bishop's castle near Liège.\nCh. 9 (19) The City: After Hayraddin reveals he has continued access to the Croyes, Quentin is acclaimed as a Guard by the citizens of Liège and rescued from the embarrassing situation by the syndic (magistrate) Pavillon.\nCh. 10 (20) The Billet: Quentin receives an encouraging note dropped from a window into the castle garden. As Schonwaldt is stormed by the Liégois it becomes clear that Hayraddin has arranged to rescue Hameline, who he thinks is Quentin's intended wife, rather than Isabelle.\nCh. 11 (21) The Sack: Quentin arranges with Pavillon to rescue Isabelle by passing her off as the syndic's daughter.\nCh. 12 (22) The Revellers: During wild revelry William has the Bishop murdered. Quentin takes charge of the situation and leaves with Isabelle for the syndic's house.\nCh. 13 (23) The Flight: Escorted by Quentin, Isabelle sets out to submit to Charles again, surrendering herself to Crevecœur on the road.\nVolume Three\nCh. 1 (24) The Surrender: Crevecœur treats Quentin with disdain and they press on to Péronne, leaving Isabelle at Charleroi.\nCh. 2 (25) The Unbidden Guest: After a short pause at Landrecy, Quentin is treated with more respect by Crevecoeur, who on reaching Péronne is informed by D'Hymbercourt and D'Argenton of Louis's arrival to meet Charles.\nCh. 3 (26) The Interview: Louis has an initial exploratory conversation with Charles, takes up his lodgings, and debates with Dain the wisdom of coming to Péronne.\nCh. 4 (27) The Explosion: Louis woos Charles's ministers individually, and when Crevecœur brings Charles news of the Bishop's murder skilfully limits the damage.\nCh. 5 (28) Uncertainty: Louis decides to kill Galeotti, who he believes has betrayed him. Balafré objects to killing in cold blood, but Tristan makes the necessary arrangements.\nCh. 6 (29) Recrimination: Galeotti tricks Louis into sparing his life.\nCh. 7 (30) Uncertainty: Charles consults his counsellors and plans to confront Louis to ascertain his role, if any, in the Bishop's murder. D'Argenton advises Louis how best to treat Charles.\nCh. 8 (31) The Interview:  In an interview with Isabelle arranged by Crawford, Quentin asks her to tell Charles only what she knows about Louis from personal experience, to avoid inflaming the situation.\nCh. 9 (32) The Investigation: First Isabelle, and then Quentin, testify discreetly before Charles in the presence of Louis and Burgundian nobles.\nCh. 10 (33) The Herald: Hayraddin appears as William's herald: he is exposed by Charles's herald, chased by hunting dogs to the entertainment of Charles and Louis, and condemned to death.\nCh. 11 (34) The Execution: Before his execution by Tristran and Petit-André, Hayraddin tells Quentin of William's plan to disguise some of his men as French auxiliaries at Liège.\nCh. 12 (35) A Prize for Honour: Louis and Charles agree that Isabelle will be awarded to the warrior who kills William.\nCh. 13 (36) The Sally: As the Burgundian forces set out for Liège with Louis in attendance, Quentin gives Isabelle a letter from Hameline, passed on by Hayraddin before his execution, defending William whom she has married. Quentin discloses William's tactic to Louis and Charles.\nCh. 14 (37) The Sally: Quentin is diverted from encountering William in battle by the necessity of saving Pavillon's daughter from assault. Balafré kills William and surrenders his prize Isabelle to Quentin.\nReception\nThe reviews of Quentin Durward were mostly favourable, rating it among the best of the Waverley Novels, though there were a few dissenting voices. Particularly appreciated were the witty Introduction, the contrasting depictions of Louis and Charles, the striking incidents and descriptions, the control of the plot (though some thought it thin), and the vivid presentation of an interesting and unfamiliar period. The most common adverse criticisms were that historical analysis was too prominent, threatening to overpower the fiction, and that the female characters were weak. Sales in Britain were initially rather slow, perhaps because it came too quickly after Peveril of the Peak, but it was an immediate hit on the Continent.\nAdaptations\n* 1956 Full color comic book adaptation Quentin Durward by Gaylord DuBois for Dell Comics\n* 1953 comic book adaptation in Thriller Picture Library № 48\n* 1955 movie The Adventures of Quentin Durward, starring Robert Taylor\n* 1971 TV series Quentin Durward\n* 1988 Soviet movie ''The Adventures of Quentin Durward, The Archer of The King's Guard''\n* an illustrated novel drawn by the Portuguese artist Fernando Bento and first published in the Fifties in the boy's journal Cavaleiro Andante\n* an opera by François-Auguste Gevaert (1858) on a libretto by Eugène Cormon and Michel Carré\nReferences\nExternal links\n*\n* [http://www.walterscott.lib.ed.ac.uk/works/novels/durward.html Page on Quentin Durward at the Walter Scott Digital Archive]\n*"
    }
  ]
}