{
  "content": [
    {
      "type": "text",
      "text": "# Quest for Glory III: Wages of War\n\nQuest for Glory III: Wages of War is a hybrid adventure/role-playing video game released in 1992 for MS-DOS. It is the third entry in the Quest for Glory video game series and the sequel to Quest for Glory II: Trial by Fire.\nQuest for Glory II hinted that Ad Avis would return in this installment of the video game series. However, the Coles did not think they could reach a new audience with a game that was significantly darker in tone than previous games in the series. Therefore, Quest for Glory III: Wages of War was created instead, with the game just hinting at the whereabouts of Ad Avis and saving that particular plotline for Shadows of Darkness, which was changed to the fourth in the series.\nThe game was re-released on Steam with support for Windows.\nPlot\nRakeesh the Paladin brings the Hero (and Prince of Shapeir) along with Uhura and her son Simba to his homeland, the town of Tarna in a jungle and savannah country called Fricana, which is inspired by central African ecosystems. Fricana is home to Liontaurs, half-human, half-lion creatures.\nThe Liontaur city of Tarna is on the brink of a war; the Simbani, the tribe of Uhura, are ready to do battle with the Leopardmen. Both tribes have taken a sacred relic from the other tribe and refused to return it before the other does. The Hero must prevent the war and then thwart a demon who may be loosed upon the world.\nThe Hero earns membership in the warring tribes, and leads his newfound allies into battle against the demon wizard. As soon as the battle is won, the Hero suddenly disappears into darkness.\nGameplay\nJust like the previous installments, this game offers three 'standard' character classes: Warrior, Magic User and Thief. However, a 'hidden' class can be opened: a Paladin. In the finale of the previous game a character who has proved honorable enough is named 'Paladin' by Rakeesh, and can be imported to Quest for Glory III as such. However, any saved character of any other class can be imported as a Paladin as well, preserving all of his skills acquired in the previous games. Such system allows to create a cross-class characters, so that Paladin for instance can use his own specific abilities along with the spells intended for Magic User without any penalties.\nThe Fighter class is favoured in Wages of War, and has access to the Trials of Simbani quests. Magic-Users are treated with hostility, and have but a sidequest which involves creating a magical staff and challenging the leopardman shaman, while thieves are relegated to just two incidents which are particular to them and in which they can use their class-specific skills.\nIn a departure from the first two games, Quest for Glory III features an \"overworld\" screen where all important cities and landmarks are represented in miniature, instead of the series of interconnected screens that the other installments of the franchise used. Travel across this overworld is subject to random encounters with enemies, which the player character must defeat in battle or escape. While traveling from one landmark to another, time passes rapidly, and the player is prone to random encounters, most of which are hostile. The stealthy Thief character is less prone to these encounters. Some random encounters are not hostile, and others are silly yet nevertheless helpful in one way or another, such as the Awful Waffle Walker (meant to save the Hero from starvation), and Arne the Aardvark (possible to question for hints).\nDevelopment\nThe game was created in Sierra's SCI1, the Sierra Creative Interpreter, Version 1. Wages of War marked the first game in the series to use the VGA graphics engine which would be used for the next game of the series. Instead of a text parser interface to control the hero, the use of the mouse to point and click was the main input device.\nAccording to Corey Cole, Lori Cole was responsible for \"90% of the design work\" for Quest for Glory III, which she did while also supervising the VGA remake of Quest for Glory: So You Want to Be a Hero.\nDue to a programming oversight it is impossible to achieve a perfect score in Quest for Glory III. Also, due to an unforeseen glitch early in the game, it's possible to make the game unwinnable if the player misses a key event.\nCorey Cole has stated that the game was developed with a budget of $750,000.\nReception\nThe changes introduced in this installment of the video game series were met with mixed reactions by fans, particularly with respect to the point-and-click interface which replaced the text parser that earlier games in the series had used. It is regarded mostly as a pedestrian effort.\nComputer Gaming World stated that Quest for Glory III \"offers perhaps the most exotic and intriguing backdrop\" in the series, and praised the \"sumptuous\" VGA graphics and soundtrack. The magazine concluded that the game \"is yet another excellent product from the creative characters at Sierra\", and stated that the next game \"will be tough to surpass the expectations generated by the excellence already found\". In 1993, Dragon gave the game 5 out of 5 stars.\nJim Trunzo reviewed Quest for Glory III: Wages of War in White Wolf #34 (Jan./Feb., 1993), rating it a 4 out of 5 and stated that \"Wages of War improves upon its prefecessors in many ways. The art and music surpass prior offerings, the no-typing interface functions quickly and smoothly and the story quickly immerses the player in the game. Frankly, it's hard to believe Sierra can top this effort. Yet, somehow, you get the feeling that it will!\"\nIn 1994, PC Gamer US named Quest for Glory III as the 28th best computer game ever. The editors wrote, \"With a tightly woven plot, terrific graphics, and an excellent soundtrack, Quest for Glory III is what adventurin' is all about.\"\nPC Mag's Neil J. Rubenking considered the game a \"perfect blend\" of roleplaying and adventure gaming, and appreciated the levity provided by the world's characters between the more tense moments of battle.\nRetrospective reviews\nMichael Baker for RPGamer gave the game 3 out of 5 stars. He felt Wages of War \"could have been much more involved and exciting than it actually was\", and criticised the game's combat system. He also considered the VGA graphics to be less well utilised than the EGA graphics in the previous entry in the series. Richard Cobbet of PC gamer considers the title \"a bit of a filler of a game\".\nReferences\nExternal links\n*"
    }
  ]
}