{
  "content": [
    {
      "type": "text",
      "text": "# Quincy Stewart\n\nQuincy Jermaine Stewart (born March 27, 1978) is an American former professional football player who was a linebacker in the National Football League (NFL) and Canadian Football League (CFL).  He played college football for the Louisiana Tech Bulldogs.\nStewart was born and raised in Tyler, Texas, by his parents with his 3 siblings (2 brothers and a sister).\nStewart was on the John Tyler High School football team that went 16&ndash;0 and won the 1994 class 5A Division II state championship of Texas, a season that included a memorable regional semifinal against Plano East Senior High School.\nStewart played in the NFL for the San Francisco 49ers team during the 2001 season and 2002 season and the New York Jets during the 2003 season.  He signed with the Minnesota Vikings in 2004 but was released during training camp.  Stewart played for the Edmonton Eskimos of the CFL during the 2005 season and the 2006 season and was part of the team that won the 93rd Grey Cup in 2005.  He was released in February 2007.\nIn 2008&ndash;2009, Stewart was working as a biology teacher in Spring Woods High School in Houston, Texas. As of 2014 he was on the coaching staff of the McCallum High School Knights football team. In 2015, he was the head basketball coach at Danbury High School in Danbury, Texas. He left Danbury in 2017 to be the Head Football Coach for Venus High School. In 2018, he became one of the Defensive Coaches at Duncanville High School in Duncanville, Texas specializing with the linebackers. In January 2020, he started his role as head coach for the Sam Houston Hurricanes in San Antonio, Texas.\nHe currently resides in San Antonio, Texas with his wife and 4 daughters\nHe is currently the defensive coordinator for Hebron high school in Carrollton, Texas. He has been the defensive coordinator there for  three seasons.\nReferences\nExternal links\n* [http://www.nfl.com/player/quincystewart/2504351/profile NFL profile]"
    }
  ]
}