{
  "content": [
    {
      "type": "text",
      "text": "# Rabbit Hole (Cowards, Pt. 1)\n\n}}\n}}\n\"Rabbit Hole (Cowards, Pt. 1)\" is a song by the American rock band Chevelle. The song was released as the band's lead single from their tenth studio album Bright as Blasphemy on March 26, 2025. \"Rabbit Hole (Cowards, Pt. 1)\" also marked the band's first release on their new record label Alchemy Recordings, after signing a record deal with them in July 2024 after they departed from Epic Records, whom the band had been with since 2002.\nBackground\nLike the rest of the album, Rabbit Hole (Cowards, Pt. 1) was self-produced by the Loeffler brothers, this marked a significant shift in their creative process after taking advice from longtime producer Joe Barresi, who encouraged them to step outside their comfort zone and take full control of the production to push their artistic boundaries and \"see how it goes\". The band teased the song with a satirical statement encouraging listeners to \"put on our tinfoil hats, slam a Dunkies, and go deep doomscrolling underscoring the track's commentary on internet obsession and digital-era anxiety\".\nRelease\n\"Rabbit Hole (Cowards, Pt. 1)\" was officially released on March 25, 2025, as the lead single from Chevelle's upcoming tenth studio album, Bright as Blasphemy. It marked the band's first new release in four years since their 2021 album, NIRATIAS. A music video was released for the song on May 14. The song was announced alongside the band’s 2025 North American summer tour with Asking Alexandria and Dead Poet Society. Also to accompany the single's release, Chevelle launched a browser-based promotional video game for free on the band's official website.\nThe song was later confirmed to be the first installment of a two-part narrative, continued in the follow-up single, \"Jim Jones (Cowards, Pt. 2)\", which was released as the album's second single on May 28, 2025.\nComposition\n\"Rabbit Hole (Cowards, Pt. 1)\" is a mid-tempo song characterized by gnarly, down-tuned guitar riffs, dynamic rhythmic shifts, and a dissonant breakdown in the final section. Pete Loeffler's vocals alternate between restrained falsetto and aggressive snarls, contributing to the track's push-and-pull tension.\nLyrically, the song delves into themes of internet-fueled paranoia, disillusionment, and the search for truth in a chaotic digital landscape. The band described the track’s tone as suited for doomscrolling, suggesting a commentary on modern information overload and conspiracy culture.\nCharts\n\"Rabbit Hole (Cowards Pt. 1)\" debuted on the Billboard Hot Hard Rock Songs chart in late March 2025, peaking at number 16 for the week of April 12, 2025. It debuted at number 28 on the Billboard Rock & Alternative Airplay chart and number 27 on the Mainstream Rock Airplay chart in April, reaching numbers 22 and 8, respectively, as of June 8, 2025.\n{| class=\"wikitable\"\n|+ Weekly charts for \"Rabbit Hole (Cowards, Pt. 1)\"\n|-\n! Chart (2025)\n! Peakposition\n|-\n| US Hot Hard Rock Songs (Billboard)\n| style=\"text-align:center;\" | 16\n|-\n| US Mainstream Rock Airplay (Billboard)\n| style=\"text-align:center;\" | 3\n|-\n| US Rock & Alternative Airplay (Billboard)\n| style=\"text-align:center;\" | 22\n|-\n|}\n\"Rabbit Hole (Cowards, Pt. 1)\" reached No. 9 on Secondary Market Rock Chart's Top 50 Active/Mainstream Rock Chart on May 27, 2025.\nPersonnel\nChevelle\n* Pete Loeffler – lead vocals\n* Sam Loeffler – drums\n* Kemble Walters – bass guitar\nTechnical personnel\n* Pete Loeffler – producer, mixing, songwriter, arrangement\n* Sam Loeffler – producer, mastering\n* Kemble Walters – engineering assistance\nReferences"
    }
  ]
}