{
  "content": [
    {
      "type": "text",
      "text": "# Racecourse, Queensland\n\n| local_map           = yes\n| zoom                = 11\n| pop                 = 181\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4740\n| area                = 8.4\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 6.5\n| dir1                = WSW\n| location1           = Mackay CBD\n| dist2               = 6.7\n| dir2                = W\n| location2           = South Mackay\n| dist3               = 949\n| dir3                = NNW\n| location3           = Brisbane\n| dist4               =\n| dir4                =\n| location4           =\n| lga                 = Mackay Region\n| stategov            = Mirani\n| fedgov              = Capricornia\n| near-n              = Foulden\n| near-ne             = Foulden\n| near-e              = West Mackay\n| near-se             = PagetOoraleaBakers Creek\n| near-s              = Te Kowai\n| near-sw             = Te Kowai\n| near-w              = Te Kowai\n| near-nw             = Erakala\n}}\nRacecourse is a western suburb of Mackay in the Mackay Region, Queensland, Australia. In the , Racecourse had a population of 181 people.\nGeography\nThe northern boundary follows a small section of the Pioneer River while most of the eastern boundary is aligned with the North Coast railway line.\nMost of the land in Racecourse is used for the cultivation of sugar cane.  The cane is transported via a network of cane tramways through the district and refined at the local Racecourse Sugar Mill ().\nHistory\nThe suburb takes its name from the Mackay Racecourse established by the Mackay Turf Club in 1867 on the south-west corner of the Peak Downs Highway and Broadsound Road / Bruce Highway, which is now within present boundaries of the suburb of Ooralea and has been renamed Ooralea Racecourse.\nDemographics\nIn the , Racecourse had a population of 242 people.\nIn the , Racecourse had a population of 184 people.\nIn the , Racecourse had a population of 181 people.\nHeritage listings\nRacecourse has a number of heritage-listed places, including:\n* Selwyn House, Cowleys Road\nEducation\nThere are no schools in Racecourse. The nearest government primary schools are Mackay West State School in neighbouring West Mackay to the east and Dundula State School in neighbouring Bakers Creek to the south-east. The nearest government secondary school is Mackay State High School in South Mackay to the east.\nSee also\n* List of tramways in Queensland\nReferences\nExternal links\n*"
    }
  ]
}