{
  "content": [
    {
      "type": "text",
      "text": "# Race Walking Association\n\nThe Race Walking Association (RWA) is the major competition provider for the event of race walking in England, the Isle of Man and the Channel Islands answerable to England Athletics. It was founded in 1907 as the Road Walking Association, and permitted to organise National Road Walking Championships. Some emphasis is placed on the development of future athletes, and the promotion of walking as a discipline within England. It is a notionally democratic body, controlled by the elected Officers and supported by the elected General Committee. Under this organisation lie three regional bodies; Southern Area RWA, Midlands Area RWA, and Northern Area RWA, each responsible for activities in their region.\nImpact of the RWA\n*They make some attempt to promote and maintain popularity of the event within the United Kingdom.\n*They have twice successfully lobbied for the event not to be removed from the Olympic Games.\n*Athletes within the RWA area have won 15 Olympic medals: 6 Gold, 5 Silver, 4 Bronze.\n*Athletes within the RWA area have also won 12 Commonwealth Games medals: 4 Gold, 3 Silver, 5 Bronze.\n*Athletes within the RWA area have set many world records.\nMagazine\nThe RWA has published a magazine, Race Walking Record monthly since November 1941. The magazine has a worldwide distribution and has many Olympians and major organisations amongst its subscribers. It started as a newsletter for race walkers doing military service during the Second World War, developing through many forms over the decades and currently available as a free online publication.\nMajor Race Walking Events in the UK\n*Olympic Games (London 1908, London 1948, London 2012)\n*Commonwealth Games (Edinburgh 1970, Manchester 2002, Birmingham 2022)\n*World Athletics Championships (London 2017)\n*European Athletics Championships (Birmingham 2026)\n*World Race Walking Cup (Milton Keynes 1977, Isle of Man 1985)\n*European Race Walking Cup (Leamington 2007)\n*50&nbsp;km National Championships\n*35&nbsp;km National Championships\n*20&nbsp;km National Championships\n*10&nbsp;km National Championships\n*Aviva 5000m National Championships and World Trials\n*Long Distance National Championships (100&nbsp;mile/24&nbsp;hours)\n*Younger Age Groups National Championships (U11/U13/U15/U17) 1&nbsp;km-5&nbsp;km\n*Junior National Championships (U20/U23) 5k-10&nbsp;km\n*Inter Area Match (North v Midlands v South)\n*Inter County Championships\n*County Track and Field Championships\n*30&nbsp;km Masters National Championships\n*20&nbsp;km Masters National Championships\n*5&nbsp;km Masters National Championships\n*Isle of Man Parish Walk\nReferences\nExternal links\n*[http://www.racewalkingassociation.com/ Race Walking Association]"
    }
  ]
}