{
  "content": [
    {
      "type": "text",
      "text": "# Raceview, Queensland\n\n| pop                 = 9699\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4305\n| area                = 5.9\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 3.5\n| dir1                = SE\n| location1           = Ipswich CBD\n| dist2               = 42.6\n| dir2                = SW\n| location2           = Brisbane CBD\n| dist3               =\n| dir3                =\n| location3           =\n| dist4               =\n| dir4                =\n| location4           =\n| lga                 = City of Ipswich\n| stategov            = Ipswich\n| fedgov              = Blair\n| near-n              = Eastern Heights\n| near-ne             = Silkstone\n| near-e              = Blackstone\n| near-se             = Swanbank\n| near-s              = Flinders View\n| near-sw             = Flinders View\n| near-w              = Churchill\n| near-nw             = Ipswich CBD\n}}\nRaceview is a suburb of Ipswich in the City of Ipswich, Queensland, Australia. In the , Raceview had a population of 9,699 people.\nGeography\nThe Cunningham Highway passes through the south-eastern corner of Raceview, entering from Blackstone and exiting to Flinders View.\nHistory\nIn 1828 during the convict era, there was a farm called Plough Station. The origin of the suburb name is from an early racecourse at the end of Grange Road, which later relocated to Bundamba.\nRaceview Provisional School opened on 20 August 1901. On 1 January 1909, it became Raceview State School.\nDuring World War II, American military personnel who died in or near Australia were buried in a  extension of Ipswich General Cemetery as a temporary arrangement until their bodies could be returned to the United States after the war. Mrs Rose Manson, who lived in nearby Salisbury Street, placed flowers on the graves every Sunday and wrote letters to their next-of-kin in the USA, reporting on the burial ceremonies and sending them photos of the cemetery. Many of the families wrote back to her, some sending seeds from their gardens, which she grew to provide flowers for the graves. She also sent cards on Mothers Day to the mothers. After the war ended, Mrs Dave Moretz of Wichita, whose son Harry was among the graves Mrs Mason visited, launched a national campaign to raise money to bring Mrs Mason to the USA. In May 1947, Mrs Mason left Sydney on the Marine Phoenix for a six-month tour of all of the states of the USA. In November and December 1947, 1397 American war dead were exhumed from the cemetery, embalmed, placed in steel coffins, and taken on the ship Gauchec Victory to the United States for permanent burial with military honours. All that remained of the former cemetery was a white memorial which was the base of the flagpole and part of the cemetery around that memorial was made into a park, called Manson Park in Mrs Manson's honour. In 1971, Major J. Watson of the United States Air Force placed a commemorative plaque in the park.\nIn August 1947, Raceview Public Hall was established on a site north of the Raceview State School (now 185 Cascade Street, ) by relocating the former Glenville Hall  from South Station Road, Booval. As at 2022, the building is still extant, but not in use as a public hall.\nIn May 1959, the Starline Drive-In Theatre opened on the southern side of Cascade Street between Whitehill Road and Raceview Street.  It could accommodate 300 cars. It subsequently was converted to have two screens. It closed in 1996 and was demolished by 1977. The site is now the Cascade Gardens Retirement Village.\nBethany Lutheran Primary School opened on 2 February 1982.\nDemographics\nIn the , Raceview had a population of 9,721 people.\nIn the , Raceview had a population of 9,699 people.\nEducation\nRaceview State School is a government primary (Prep-6) school for boys and girls at 96 Wildey Street (). In 2018, the school had an enrolment of 996 students with 69 teachers (63 full-time equivalent) and 45 non-teaching staff (29 full-time equivalent). It includes a special education program.\nBethany Lutheran Primary School is a private primary (Prep-6) school for boys and girls at 126 Cascade Street (). In 2018, the school had an enrolment of 278 students with 22 teachers (19 full-time equivalent) and 21 non-teaching staff (11 full-time equivalent).\nThere are no secondary schools in Raceview. The nearest government secondary school is Bremer State High School in neighbouring Ipswich CBD to the west.\nAmenities\nThere is a shopping precinct on Raceview Road (). Raceview Post Office is located within that precinct ().\nCascade Gardens Retirement Village is at 67 Cascade Street ().\nElim Retirement Village is at 123 Cemetery Road ().\nIpswich Hockey is at 65 Briggs Road ().\nBrothers Leagues Club Ipswich is at 20 Wildey Road ().\nParks\nThere are a number of parks in the area:\n* Banksia Drive Park ()\n* David W Coultas Park ()\n* Greg Richards Park ()\n* Haley Weber Park ()\n* James Hatton Park ()\n* Leonie Edwards Park ()\n* Manson Park, 19 Cemetery Road ()\n* Marsh Park ()\n* Pat Hayes Park ()\n* Pitman Park ()\n* Poplar Street Park ()\n* Rea Park ()\n* Vista View Park ()\n* Worley Park ()\nReferences\nExternal links\n*"
    }
  ]
}