{
  "content": [
    {
      "type": "text",
      "text": "# Racking\n\nRacking,  often referred to as Soutirage or  Soutirage traditionnel (meaning racking in French), also filtering or fining, is the process of moving wine or beer from one container to another using gravity rather than a pump, which can be disruptive to the beverage. The process is also known as Abstich in German and travaso in Italian.\n''Alexis Lichine's Encyclopedia of Wines and Spirits'' defines racking as \"siphoning wine or beer off the lees (in the case of wine) or trub (in the case of beer), into a new, clean barrel or other vessel\". Racking allows clarification and aids in stabilization. Wine that is allowed to age on the lees often develops \"off-tastes\". A racking hose or tube is used and can be attached to a racking cane to make the task easier. The racking process is repeated several times during the aging of wine.\nProcess\n's Merlot]]\nRacking or soutirage is a traditional method in wine production of moving wine from one barrel to another using gravity rather than a pump. The process is repeated when the casks are moved to the second-year cellar. Soutirage was developed in the Bordeaux region of France in the 19th century at a time when there was no electricity to power pumps. Many estates such in Bordeaux and some estates in Pomerol and St. Emilion still employ this labor-intensive method. During aging, the wine is decanted several times from barrel to barrel. This process softens tannins, clarifies the wine and enhances aromatic qualities. According to Oz Clarke, \"traditionally the wine is 'racked' or drawn from barrel or tank to another empty one on a number of occasions (called soutirage). This helps clarify and freshen the wine by removing the fine lees or sediment which forms and provides a tiny amount of oxygen to help the aging process. The wine may also be 'fined' (collage) using egg white or other materials to settle out particles in suspension which are then removed through further racking.\" Egg white is often applied to each barrel during the process.\nEquipment\nA racking hose is a flexible, plastic hose, used to siphon wine or beer from one vessel to another. It is used in both racking and bottling operations.  A racking cane is a rigid tube, often bent or L-shaped, that is attached to the racking hose to make racking easier. A protective cap is placed over the lower end of the cane that allows liquid to be drawn into the cane from above rather than below while keeping most large solids out. The cap allows the tip of the cane to be lowered close to the lees without unduly disturbing them. The lower tip of the racking cane should initially be held about midway between the surface and the lees and gradually lowered as the volume decreases due to the siphoning.\nSee also\n*Clarification and stabilization of wine\n*Wine rack\nReferences\nFurther reading\n*"
    }
  ]
}