{
  "content": [
    {
      "type": "text",
      "text": "# Radar warning of Pearl Harbor attack\n\nOn the morning of 7 December 1941 the SCR-270 radar at the Opana Radar Site on northern Oahu detected a large number of aircraft approaching from the north. This information was conveyed to Fort Shafter’s Intercept Center. The report was dismissed by Lieutenant Kermit Tyler who assumed that it was a scheduled flight of aircraft from the continental United States. The radar had in fact detected the first wave of Japanese Navy aircraft about to launch the attack on Pearl Harbor.\nAttack on Pearl Harbor\nOn 6 December 1941, Private Joseph P. McDonald arrived for his 05:00 shift to relieve his tent mate and fellow staffer, Private Richard Schimmel, at Fort Shafter's Intercept Center. The center served as the tracking center for the US Army Air Corps (USAAC)'s radar monitoring, then a new technology. It used five radar systems located across Oahu. For several weeks, Intercept Center staff had been on high alert because military intelligence had not been able to locate the Imperial Japanese Navy's whereabouts. At 04:00 7 December 1941, USAAC radar plotters arrived to operate radars for their scheduled 04:00 to 07:00 shift. After the radar plotters left the Intercept Center at 07:00 to eat breakfast, McDonald remained at his post beyond his 06:00 schedule until his shift replacement, Schimmel, arrived from breakfast.\nAlso at 04:00 Private Joseph Lockard, a U.S. Army third-class specialist and his colleague, Private George Elliott were manning their truck-mounted SCR-270 radar at the Opana Radar Site. Lockard served as the primary radar station operator; Elliott served as the station's primary plotter and temporary motorman. A third staffer, scheduled to be off-duty between 04:00 and 07:00, served as the station's regular motorman. Since 27 November 1941, Lockard and Elliot staffed the radar from 04:00 to 07:00, a departure from their old 07:00–16:00 schedule. The United States Department of War’s previous warning of a Japanese attack in the Pacific prompted the scheduling change.\nAt 07:02 Lockard and Elliot saw a massive formation of aircraft on the oscilloscope. More experienced in radar than Elliot, Lockard considered it highly unusual to see 180 planes showing up on his radar. Lockard and Elliot detected the formation  out, close to their oscilloscope's  display limit. Initially puzzled over the oscilloscope's pronounced reading, they confirmed that the radar was in good working order. Lockard then called his immediate supervisor, but was unable to reach him. Elliot contacted the Intercept Center at Fort Shafter. McDonald received the call and Elliott requested the plotters. When McDonald indicated that the plotters had left, Elliott warned that a large number of planes were en route to Hawaii from the north 3 points east. Assuming he was the only one left at the center, McDonald replied that he did not know what to do since no one else was there with him. Suddenly, the connection went dead.\nAfter checking the time on the center's clock, McDonald saw a USAAC Lieutenant, Kermit Tyler sitting at the plotting table. McDonald informed Tyler of the call from Opana. Inexperienced in the Intercept Center's operations and on his second day on the job, Tyler downplayed the report. After returning to the switchboard, McDonald called Opana back and instead reached his friend, Lockard. McDonald relayed to Lockard Tyler's general lack of urgency. More frantic than his colleague Elliot, Lockard warned that a large number of aircraft were headed quickly towards Oahu, covering the entire scope. Holding Lockard on the line, McDonald returned to Tyler at the plotters table, advising him of the urgency in Lockard's voice. When Tyler suggested to McDonald that it was likely a formation of B-17 aircraft coming from the continental United States, Lockard requested to speak directly with Tyler. When Lockard again warned Tyler about planes en route to Oahu, Tyler told Lockard, \"Don't worry about it.\" After ending the call with Lockard, McDonald asked Tyler if they should contact the plotters and notify Wheeler Field, Tyler again replied, \"Don't worry about it\".\nBelieving Lockard's report, McDonald intended to contact Wheeler Field. However, he was concerned that he would be court-martialed for circumventing Tyler. At 07:45 McDonald's shift replacement arrived at the center, relieving McDonald.\nLockard and Elliot tracked the planes on the radar oscilloscope from 07:02 until the signal was lost at 07:40 due to background interference from the permanent echo created by the surrounding mountains. At approximately 07:45 Lockard switched off his radar to ride back to his base for breakfast.\nExhausted from working a 14-hour shift, McDonald elected to contact Wheeler Field from the orderly tent next to his tent overlooking Pearl Harbor. However, the orderly tent's Sergeant was using it. After returning to his tent, McDonald warned his tent mate, Schimmel that the Japanese were en route to Oahu. Moments later McDonald and Schimmel heard a loud noise indicating the arrival of a large formation of aircraft. At approximately 07:50 they saw Japanese planes in a single file attacking Pearl Harbor and Hickam Field.\nAfter the Japanese attack started, McDonald and Schimmel were called back to the Intercept Center. Schimmel found McDonald's message from Elliot balled up in a trash can. Before the message would be retrieved by authorities towards an investigation, Schimmel copied the message word-for-word in a spiral-bound notebook with the date “December 7, 1941” and the words “a great number of planes coming in from the north.”\nPost-attack investigations\nPost-attack, McDonald was interviewed by authorities investigating the attack. U.S. Associate Supreme Court Justice Owen Roberts told McDonald his warning to Tyler was more urgent and historic than the famed \"Message to Garcia\". Colonel W.H. Tetley, Commanding Officer of the 580th Aircraft Warning Company Signal Corps, lauded McDonald's efforts to notify Tyler, noting that had Tyler informed the Fighter Wing, it may have been able to get airborne in sufficient time to intercept and reduce the impact of the attack, saving lives, fleet, aircraft and equipment.\nLockard was the subject of a 1 February 1942 Associated Press article revealing to the American public the identity of the U.S. soldier who \"detected Japanese planes approaching Pearl Harbor while he was practicing at the listening device the morning of Dec. 7 only to have his warning disregarded.\"\nIn August 1942, the Naval Board of Inquiry found that Tyler had been assigned to the Intercept Center with little or no training, no supervision and no staff with which to work. They subsequently cleared Tyler of all wrongdoing, taking no disciplinary actions against him.\nKey participants\nLockard was promoted to Staff Sergeant and awarded the Distinguished Service Medal, he then attended Officer Candidate School was commissioned as a Second lieutenant in the U.S. Army Signal Corps. Upon completion of further radar training, he served as a radar officer on Adak and Amchitka Islands for the remainder of the war. After the war he worked for the Pennsylvania Railroad, Litton Industries, GTE, Sylvania Electric and AMP Inc. where he registered over 35 patents. He died on 2 November 2012, in Harrisburg, Pennsylvania, Dauphin County.\nMcDonald served in the central Pacific theater including assignments on Kanton, Makin, Kwajalein, Guadalcanal, New Guinea and Saipan. After the war he worked at Pratt & Whitney for 20 years. He died on 7 August 1994. On 29 November 2005 he was posthumously awarded the Army Commendation Medal for his efforts to notify his superiors of the impending Japanese attack. U.S. Sen. Chris Dodd, US. Rep. John Larson, East Hartford Mayor Melody Currey and Major General Thaddeus J. Martin attended the ceremony. McDonald's son George accepted the award on his family's behalf.\nTyler continued to serve in the military, eventually retiring as a United States Air Force Lieutenant colonel in 1961. He died on 27 February 2010.\nIn popular culture\nThe radar warning has been featured in numerous books and motion pictures including Walter Lord's Day of Infamy, Gordon Prange and Donald M. Goldstein's At Dawn We Slept, Tora! Tora! Tora!, and Pearl Harbor.\nReferences"
    }
  ]
}