{
  "content": [
    {
      "type": "text",
      "text": "# Radical Republicans\n\nUnconditional unionismDevelopmentalismFree labor\n| national         = Republican Party\n| country          = United States\n}}\nThe Radical Republicans were a political faction within the Republican Party originating from the party's founding in 1854—some six years before the Civil War—until the Compromise of 1877, which effectively ended Reconstruction. They called themselves \"Radicals\" because of their goal of immediate, complete, and permanent eradication of slavery in the United States. The Radical faction also included strong currents of nativism, anti-Catholicism, and support for the prohibition of alcoholic beverages. These policy goals and the rhetoric in their favor often made it extremely difficult for the Republican Party as a whole to avoid alienating large numbers of American voters of Irish Catholic, German, and other White ethnic backgrounds. In fact, even German-American Freethinkers and Forty-Eighters who, like Hermann Raster, otherwise sympathized with the Radical Republicans' aims, fought them tooth and nail over prohibition. They later became known as \"Stalwarts\".\nThe Radicals were opposed during the war by the Moderate Republicans (led by President Abraham Lincoln), and by the Democratic Party. Radicals led efforts after the war to establish civil rights for former slaves and fully implement emancipation. After unsuccessful measures in 1866 resulted in violence against former slaves in the former rebel states, Radicals pushed the Fourteenth Amendment for statutory protections through Congress. They opposed allowing ex-Confederate politicians and military veterans to retake political power in the Southern U.S., and emphasized equality, civil rights and voting rights for the \"freedmen\", i.e., former slaves who had been freed during or after the Civil War by the Emancipation Proclamation and the Thirteenth Amendment.\nDuring the war, Radicals opposed Lincoln's initial selection of General George B. McClellan for top command of the major eastern Army of the Potomac and Lincoln's efforts in 1864 to bring seceded Southern states back into the Union as quickly and easily as possible. Lincoln later recognized McClellan as unfit and relieved him of his command. The Radicals tried passing their own Reconstruction plan through Congress in 1864. Lincoln vetoed it, as he was putting his own policy in effect through his power as military commander-in-chief. Lincoln was assassinated in April 1865. Radicals demanded for the uncompensated abolition of slavery, while Lincoln wished instead to partially emulate the British Empire's abolition of slavery by financially compensating former slave owners who had remained loyal to the Union. The Radicals, led by Thaddeus Stevens, bitterly fought Lincoln's successor, Andrew Johnson. After Johnson vetoed various congressional acts favoring citizenship for freedmen, a much harsher Reconstruction for the defeated South, and other bills he considered unconstitutional, the Radicals attempted to remove him from office through impeachment, which failed by one vote in 1868.\nDuring the Reconstruction period, Radical Republicans supported prolabor legislation, in contrast to conservative Democrats and Liberal Republicans.\nRadical coalition\n]]\nThe Radicals were heavily influenced by religious ideals, and many were Protestant reformers who saw slavery as evil and the Civil War as God's punishment for slavery.\nThe term \"radical\" was in common use in the anti-slavery movement before the Civil War, referring not necessarily to abolitionists, but particularly to Northern politicians strongly opposed to the Slave Power. Many and perhaps a majority had been Whigs, such as William H. Seward, a leading presidential contender in 1860 and Lincoln's Secretary of State, Thaddeus Stevens of Pennsylvania, as well as Horace Greeley, editor of the New-York Tribune, the leading Radical newspaper. There was movement in both directions: some of the pre-war Radicals (such as Seward) became less radical during the war, while some prewar moderates became Radicals. Some wartime Radicals had been Democrats before the war, often taking pro-slavery positions. They included John A. Logan of Illinois, Edwin Stanton of Ohio, Benjamin Butler of Massachusetts, and Vice President Johnson; Johnson would break with the Radicals after he became president.\nThe Radicals came to majority power in Congress in the elections of 1866 after several episodes of violence led many to conclude that President Johnson's weaker reconstruction policies were insufficient. These episodes included the New Orleans riot and the Memphis riots of 1866. In a pamphlet directed to black voters in 1867, the Union Republican Congressional Committee stated:\n}}\nThe Radicals were never formally organized and there was movement in and out of the group. Their most successful and systematic leader was Pennsylvania Congressman Thaddeus Stevens in the House of Representatives. The Democrats were strongly opposed to the Radicals, but they were generally a weak minority in politics until they took control of the House in the 1874 congressional elections. The \"Moderate\" and \"Conservative\" Republican factions usually opposed the Radicals, but they were not well organized. Lincoln tried to build a multi-faction coalition, including Radicals, \"Conservatives,\" \"Moderates\" and War Democrats as while he was often opposed by the Radicals, he never ostracized them. Andrew Johnson was thought to be a Radical when he became president in 1865, but he soon became their leading opponent. However, Johnson could not form a cohesive support network. Finally in 1872, the Liberal Republicans, who wanted a return to classical republicanism, ran a presidential campaign and won the support of the Democratic Party for their ticket. They argued that Grant and the Radicals were corrupt and had imposed Reconstruction far too long on the South. They were overwhelmingly defeated in the 1872 election and collapsed as a movement.\nOn issues not concerned with the destruction of the Confederacy, the eradication of slavery and the rights of Freedmen, Radicals took positions all over the political map. For example, Radicals who had once been Whigs generally supported high tariffs and ex-Democrats generally opposed them. Some men were for hard money and no inflation while others were for soft money and inflation. The argument, common in the 1930s, that the Radicals were primarily motivated by a desire to selfishly promote Northeastern business interests, has seldom been argued by historians for a half-century. On foreign policy issues, the Radicals and moderates generally did not take distinctive positions.\nWartime\n, Lincoln's Secretary of the Treasury]]\nAfter the 1860 elections, moderate Republicans dominated the Congress. Radical Republicans were often critical of Lincoln, who they believed was too slow in freeing slaves and supporting their legal equality. Lincoln put all factions in his cabinet, including Radicals like Salmon P. Chase (Secretary of the Treasury), whom he later appointed Chief Justice, James Speed (Attorney General) and Edwin M. Stanton (Secretary of War). Lincoln appointed many Radical Republicans, such as journalist James Shepherd Pike, to key diplomatic positions. Angry with Lincoln, in 1864 some Radicals briefly formed a political party called the Radical Democratic Party, with John C. Frémont as their candidate for president, until Frémont withdrew. An important Republican opponent of the Radical Republicans was Henry Jarvis Raymond. Raymond was both editor of The New York Times and also a chairman of the Republican National Committee. In Congress, the most influential Radical Republicans were U.S. Senator Charles Sumner and U.S. Representative Thaddeus Stevens. They led the call for a war that would end slavery.\nReconstruction policy\nOpposing Lincoln\n, one of the authors of the Wade–Davis Manifesto opposing Lincoln's \"ten percent\" reconstruction plan]]\nThe Radical Republicans opposed Lincoln's terms for reuniting the United States during Reconstruction (1863), which they viewed as too lenient. They proposed an \"ironclad oath\" that would prevent anyone who supported the Confederacy from voting in Southern elections, but Lincoln blocked it and once Radicals passed the Wade–Davis Bill in 1864, Lincoln vetoed it. The Radicals demanded a more aggressive prosecution of the war, a faster end to slavery and total destruction of the Confederacy. After the war, the Radicals controlled the Joint Committee on Reconstruction.\nOpposing Johnson\nAfter Lincoln's assassination, War Democrat Vice President Andrew Johnson became president. Although he appeared at first to be a Radical, he broke with them and the Radicals and Johnson became embroiled in a bitter struggle. Johnson proved a poor politician and his allies lost heavily in the 1866 elections in the North. The Radicals now had full control of Congress and could override Johnson's vetoes.\nControl of Congress\nAfter the 1866 elections, the Radicals generally controlled Congress. Johnson vetoed 21 bills passed by Congress during his term, but the Radicals overrode 15 of them, including the Civil Rights Act of 1866 and four Reconstruction Acts, which rewrote the election laws for the South and allowed blacks to vote while prohibiting former Confederate Army officers from holding office. As a result of the 1867–1868 elections, the newly empowered freedmen, in coalition with carpetbaggers (Northerners who had recently moved south) and Scalawags (white Southerners who supported Reconstruction), set up Republican governments in 10 Southern states (all but Virginia).\nImpeachment\n, Lincoln's Secretary of War, whom Johnson tried to remove from office]]\nThe Radical plan was to remove Johnson from office, but the first effort at the impeachment trial of President Johnson went nowhere. After Johnson violated the Tenure of Office Act by dismissing Secretary of War Edwin M. Stanton, the House of Representatives voted 126–47 to impeach him, but the Senate acquitted him in 1868 in three 35–19 votes, failing to reach the 36 votes threshold required for a conviction; by that time, however, Johnson had lost most of his power.\nSupporting Grant\nGeneral Ulysses S. Grant in 1865–1868 was in charge of the Army under President Johnson, but Grant generally enforced the Radical agenda. The leading Radicals in Congress were Thaddeus Stevens in the House and Charles Sumner in the Senate. Grant was elected president as a Republican in 1868 and after the election he generally sided with the Radicals on Reconstruction policies and signed the Civil Rights Act of 1871 into law.\nThe Republicans split in 1872 over Grant's reelection, with the Liberal Republicans, including Sumner, opposing Grant with a new third party. The Liberals lost badly, but the economy then went into a depression in 1873 and in 1874 the Democrats swept back into power and ended the reign of the Radicals.\nThe Radicals tried to protect the new coalition, but one by one the Southern states voted the Republicans out of power until in 1876 only three were left (Louisiana, Florida and South Carolina), where the Army still protected them. The 1876 presidential election was so close that it was decided in those three states despite massive fraud and illegalities on both sides. The Compromise of 1877 called for the election of a Republican as president and his withdrawal of the troops. Republican Rutherford B. Hayes withdrew the troops and the Republican state regimes immediately collapsed.\nReconstruction of the South\n]]\nIn 1865, Radical Republicans increasingly took control, led by Sumner and Stevens. They demanded harsher measures in the South, more protection for the Freedmen and more guarantees that the Confederate nationalism was eliminated. Following Lincoln's assassination in 1865, Andrew Johnson, a former War Democrat, became president.\nThe Radicals at first admired Johnson's hard-line talk. When they discovered his ambivalence on key issues by his veto of Civil Rights Act of 1866, they overrode his veto. This was the first time that Congress had overridden a president on an important bill. The Civil Rights Act of 1866 made African Americans United States citizens, forbade discrimination against them and it was to be enforced in Federal courts. The Fourteenth Amendment to the U.S. Constitution of 1868 (with its Equal Protection Clause) was the work of a coalition formed of both moderate and Radical Republicans.\nBy 1866, the Radical Republicans supported federal civil rights for freedmen, which Johnson opposed. By 1867, they defined terms for suffrage for freed slaves and limited early suffrage for many ex-Confederates. While Johnson opposed the Radical Republicans on some issues, the decisive congressional elections of 1866 gave the Radicals enough votes to enact their legislation over Johnson's vetoes. Through elections in the South, ex-Confederate officeholders were gradually replaced with a coalition of freedmen, Southern whites (pejoratively called scalawags) and Northerners who had resettled in the South (pejoratively called carpetbaggers). The Radical Republicans were successful in their efforts to impeach President Johnson in the House, but failed by one vote in the Senate to remove him from office.\nThe Radicals were opposed by former slaveowners and white supremacists in the rebel states. Radicals were targeted by the Ku Klux Klan, who shot to death one Radical Congressman from Arkansas, James M. Hinds.\nThe Radical Republicans led the Reconstruction of the South. All Republican factions supported Ulysses Grant for president in 1868. Once in office, Grant forced Sumner out of the party and used Federal power to try to break up the Ku Klux Klan organization. However, insurgents and community riots continued harassment and violence against African Americans and their allies into the early 20th century. By the 1872 presidential election, the Liberal Republicans thought that Reconstruction had succeeded and should end. Many moderates joined their cause as well as Radical Republican leader Charles Sumner. They nominated New-York Tribune editor Horace Greeley, who was also nominated by the Democrats. Grant was easily reelected.\nEnd of Reconstruction\nBy 1872, the Radicals were increasingly splintered and in the congressional elections of 1874, the Democrats took control of Congress. Many former Radicals joined the \"Stalwart\" faction of the Republican Party while many opponents joined the \"Half-Breeds\", who differed primarily on matters of patronage rather than policy.\nIn state after state in the South, the so-called Redeemers' movement seized control from the Republicans until in 1876 only three Republican states were left: South Carolina, Florida, and Louisiana. In the intensely disputed 1876 U.S. presidential election, Republican presidential candidate Rutherford B. Hayes was declared the winner following the Compromise of 1877 (a corrupt bargain): he obtained the electoral votes of those states, and with them the presidency, by committing himself to removing federal troops from those states. Deprived of military support, Reconstruction came to an end. \"Redeemers\" took over in these states as well. As white Democrats now dominated all Southern state legislatures, the period of Jim Crow laws began, and rights were progressively taken away from blacks. This period would last over 80 years, until the gains made by the Civil Rights Movement.\nHistoriography\nIn the aftermath of the Civil War and Reconstruction, new battles took place over the construction of memory and the meaning of historical events. The earliest historians to study Reconstruction and the Radical Republican participation in it were members of the Dunning School, led by William Archibald Dunning and John W. Burgess. The Dunning School, based at Columbia University in the early 20th century, saw the Radicals as motivated by an irrational hatred of the Confederacy and a lust for power at the expense of national reconciliation. According to Dunning School historians, the Radical Republicans reversed the gains Abraham Lincoln and Andrew Johnson had made in reintegrating the South, established corrupt shadow governments made up of Northern carpetbaggers and Southern scalawags in the former Confederate states, and to increase their power, foisted political rights on the newly freed slaves that they were allegedly unprepared for or incapable of utilizing. For the Dunning School, the Radical Republicans made Reconstruction a dark age that only ended when Southern whites rose up and reestablished a \"home rule\" free of Northern, Republican, and black influence.\nIn the 1930s, the Dunning-oriented approaches were rejected by self-styled \"revisionist\" historians, led by Howard K. Beale along with W.E.B. DuBois, William B. Hesseltine, C. Vann Woodward and T. Harry Williams. They downplayed corruption and stressed that Northern Democrats were also corrupt. Beale and Woodward were leaders in promoting racial equality and re-evaluated the era in terms of regional economic conflict. They were also hostile towards the Radicals, casting them as economic opportunists. They argued that apart from a few idealists, most Radicals were scarcely interested in the fate of the blacks or the South as a whole. Rather, the main goal of the Radicals was to protect and promote Northern capitalism, which was threatened in Congress by the West; if the Democrats took control of the South and joined the West, they thought, the Northeastern business interests would suffer. They did not trust anyone from the South except men beholden to them by bribes and railroad deals. For example, Beale argued that the Radicals in Congress put Southern states under Republican control to get their votes in Congress for high protective tariffs.\nThe role of Radical Republicans in creating public school systems, charitable institutions, and other social infrastructure in the South was downplayed by the Dunning School of historians. Since the 1950s, the impact of the moral crusade of the civil rights movement led historians to reevaluate the role of Radical Republicans during Reconstruction, and their reputation improved. These historians, sometimes referred to as neoabolitionist because they reflected and admired the values of the abolitionists of the 19th century, argued that the Radical Republicans' advancement of civil rights and suffrage for African Americans following emancipation was more significant than the financial corruption which took place. They also pointed to the African Americans' central, active roles in reaching toward education (both individually and by creating public school systems) and their desire to acquire land as a means of self-support.\nDemocrats retook power across the South and held it for decades, restricting African American voters and largely extinguishing their voting rights over the years and decades following Reconstruction. In 2004, Richardson argued that Northern Republicans came to see most blacks as potentially dangerous to the economy because they might prove to be labor radicals in the tradition of the 1871 Paris Commune or Great Railroad Strike of 1877 and other violent American strikes of the 1870s. Meanwhile, it became clear to Northerners that the white South was not bent on revenge or the restoration of the Confederacy. Most of the Republicans who felt this way became opponents of Grant and entered the Liberal Republican camp in 1872.\nNotable Radical Republicans\n* Amos Tappan Akerman: attorney general under the Grant administration who vigorously prosecuted the Ku Klux Klan in the South under the Enforcement Acts\n* Adelbert Ames: Governor of Mississippi in 1868–1870 and 1874–1876\n* James Mitchell Ashley: representative from Ohio\n* John Armor Bingham: representative from Ohio and principal framer of the Fourteenth Amendment to the United States Constitution\n* Austin Blair: Governor of Michigan in 1861–1865\n* George Sewall Boutwell: representative from Massachusetts and Treasury Secretary under President Grant from 1869 to 1873\n* William Gannaway Brownlow: publisher of the Knoxville Whig, Tennessee governor and senator\n* Rufus Bullock: Governor of Georgia 1868–1871\n* Benjamin Butler: Massachusetts politician-soldier who was hated by rebels for restoring control in New Orleans\n* Zachariah Chandler: senator from Michigan and Secretary of the Interior under President Grant\n* Salmon P. Chase: Treasury Secretary under President Lincoln and Supreme Court chief justice who sought the 1868 Democratic nomination as a moderate\n* Schuyler Colfax: Speaker of the House (1863–1869) and the 17th Vice President of the United States (1869–1873). Was called the Christian statesman\n* John Conness: senator from California\n* John Creswell: elected Baltimore Representative to the House in 1863 during the Civil War, Creswell worked closely under Radical Republican Baltimore Representative Henry Winter Davis and was appointed Postmaster-General by President Grant in 1869, having vast patronage powers appointed many African Americans to federal postal positions in every state of the United States\n* Edmund J. Davis: Governor of Texas in 1870–1874\n* Henry Winter Davis: representative from Maryland\n* Charles Daniel Drake: senator from Missouri\n* Reuben Fenton: Governor of New York in 1865–1868\n* Thomas Clement Fletcher: Governor of Missouri in 1865–1869\n* John C. Frémont: the 1856 Republican presidential candidate\n* James A. Garfield: House of Representatives leader, less radical than others and president in 1881\n*Horace Greeley: the founder and editor of the New-York Tribune, which became the most radical newspaper of the day. Greeley initially strongly supported Radical Reconstruction, but over time became disenchanted with the corruption associated with it, and broke with the Radical Republicans to run for president on the Liberal Republican ticket against Grant.\n* Joshua Reed Giddings: representative from Ohio and an early leading founder of the Ohio Republican Party\n* Ulysses S. Grant: president who signed Enforcement Acts and Civil Rights Act of 1875 while as General of the Army of the United States he supported Radical Reconstruction and civil rights for African Americans\n* Galusha A. Grow: representative from Pennsylvania and Speaker of the House 1861 to 1863\n* John Parker Hale: senator from New Hampshire and one of the first to make a stand against slavery. He was a former Democrat who broke away because of slavery\n* Hannibal Hamlin: Maine politician and vice president during Lincoln's first term\n* Friedrich Hecker: leader of the German-American Forty-Eighters\n* James M. Hinds: Congressman from Arkansas, murdered by the Ku Klux Klan in 1868\n* William Woods Holden: Governor of North Carolina in 1868–1871\n* Jacob M. Howard: senator from Michigan\n* Timothy Otis Howe: senator from Wisconsin\n* George Washington Julian: representative from Indiana and principal framer of the Fifteenth Amendment to the United States Constitution\n* William Darrah Kelley: representative from Pennsylvania\n* Samuel J. Kirkwood: senator from Iowa\n* James H. Lane: senator from Kansas and leader of the Jayhawkers abolitionist movement\n* John Alexander Logan: senator from Illinois\n* Owen Lovejoy: representative from Illinois\n* David Medlock, Jr: Texas House of Representatives for the 12th Texas Legislature – 1870 to 1873 and was on the Federal Relations Committee.\n* Oliver P. Morton: Governor of Indiana (1861–1867) and senator\n* Franklin J. Moses, Jr.: Governor of South Carolina in 1872–1874\n* Samuel Pomeroy: senator from Kansas\n* Harrison Reed: Governor of Florida in 1868–1873\n* Samuel Shellabarger: representative from Ohio and principal drafter of the Civil Rights Act of 1871\n* Rufus Paine Spalding: representative from Ohio who took a leading role in the Congressional debates over Reconstruction\n* Edwin McMasters Stanton: Secretary of War under the Lincoln and Johnson administrations\n* Thaddeus Stevens: Radical leader in the House from Pennsylvania\n* Charles Sumner: senator from Massachusetts, dominant Radical leader in the Senate and specialist in foreign affairs who broke with Grant in 1872\n* Albion W. Tourgée: novelist\n* Lyman Trumbull: senator from Illinois with strongly anti-slavery sentiments, but otherwise moderate\n* Daniel Phillips Upham: Arkansas politician-soldier who was ruthless in a campaign that would temporarily rid the South of the Ku Klux Klan\n* Benjamin Franklin Wade: senator from Ohio, next in line to become president if Johnson were removed\n* Henry Clay Warmoth: Governor of Louisiana in 1868–1872\n* Elihu Benjamin Washburne: representative from Illinois\n* George Henry Williams: senator from Oregon (1865–1871) and attorney general under President Grant\n* Henry Wilson: Massachusetts Senator, chairman of the Senate Military Affairs Committee during the Civil War, and vice president under Grant\n* James F. Wilson: representative from Iowa, chairman of the House Judiciary Committee during the impeachment of President Johnson and senator from Iowa\n* Richard Yates: Governor of Illinois in 1861–1865 and Senator\nNotes\nReferences and further reading\nSecondary sources\n*\n*\n*\n*\n*  Re Michigan Senator Zachariah Chandler\n*  567 pages, intense anti-Radical narrative by prominent Democrat\n* Brands, H. W. The Man Who Saved the Union: Ulysses Grant in War and Peace (Doubleday, 2013) [https://www.google.com/books/edition/The_Man_Who_Saved_the_Union/fGn2t-tuQBMC?hl=en online]\n*\n*  Major critical analysis.\n*  A major scholarly biography\n*\n*  Major synthesis; many prizes\n*  Abridged version\n*  Lincoln as moderate and opponent of Radicals.\n* Howard, Victor B. Religion and the Radical Republican Movement, 1860–1870 (University Press of Kentucky, 2014) [https://scholar.archive.org/work/vweit52z55crfbw4bqbartrmgy/access/wayback/https://uknowledge.uky.edu/cgi/viewcontent.cgi?referer=&httpsredir=1&article=1139&context=upk_united_states_history online]\n* Lyons, Philip B. Statesmanship and Reconstruction: Moderate versus Radical Republicans on Restoring the Union after the Civil War (Lexington Books, 2014).\n*  Pulitzer Prize.\n*\n*  Hostile\n*  Pulitzer Prize.\n*  Fourth and final volume of a biography. The main title of all four volumes is Lincoln the President; the fourth volume was completed by Richard N. Current upon Randall's death.\n*  Volumes 6 and 7. Highly detailed political narrative.\n* Richards, Leonard L. Who Freed the Slaves?: The Fight Over the Thirteenth Amendment (University of Chicago Press, 2015).\n*\n*\n*\n*  Scholarly history\n*\n*\n*\n* Summers, Mark Wahlgren. Railroads, Reconstruction, and the Gospel of Prosperity: Aid Under the Radical Republicans, 1865–1877 (Princeton University Press, 2014) [https://books.google.com/books?id=oeD_AwAAQBAJ&dq=Radical+Republican&pg=PP1 online].\n*\n*  Favorable to Radicals\n*  Favorable biography.\n*\n*  Hostile to Radicals\n*  2 vol.\nHistoriography and memory\n*\n* Keith, LeeAnna. When It Was Grand: The Radical Republican History of the Civil War (2020) [https://www.amazon.com/When-Was-Grand-Radical-Republican/dp/0809080311 excerpt]; also [https://networks.h-net.org/node/11717/reviews/6266230/bekken-keith-when-it-was-grand-radical-republican-history-civil-war online review]\n*\n* Leipold, Bruno, Karma Nabulsi, and Stuart White, eds. ''Radical republicanism: Recovering the tradition's popular heritage (Oxford University Press, 2020) [https://books.google.com/books?id=M4_UDwAAQBAJ&dq=%22Radical+Republican%22+historiography&pg=PP1 online].\n*\n*\nPrimary sources\n* [http://www.sonofthesouth.net/leefoundation/civil-war-1865.htm Harper's Weekly] news magazine\n* [http://www.hti.umich.edu/cgi/t/text/text-idx?sid=70e7f9526905ba30&idno=ABZ4229.0001.001&view=header&c=moa Barnes, William H., ed. History of the Thirty-ninth Congress of the United States. (1868)] useful summary of Congressional activity.\n* Blaine, James.Twenty Years of Congress: From Lincoln to Garfield. With a review of the events which led to the political revolution of 1860 (1886). By Republican Congressional leader [https://books.google.com/books?id=3GQFAAAAQAAJ&q=intitle:twenty+inauthor:blaine full text online]\n* Fleming, Walter L. Documentary History of Reconstruction: Political, Military, Social, Religious, Educational, and Industrial 2 vol (1906). Uses broad collection of primary sources; vol 1 on national politics; vol 2 on states [https://books.google.com/books?id=1OoLAAAAIAAJ&q=intitle:documentary+intitle:history+inauthor:fleming full text of vol. 2]\n* Hyman, Harold M., ed. The Radical Republicans and Reconstruction, 1861–1870. (1967), collection of long political speeches and pamphlets.\n* Edward McPherson, [https://books.google.com/books?id=kaG2Am68tuAC&dq=mcpherson+period+of+reconstruction&pg=PP3 The Political History of the United States of America During the Period of Reconstruction (1875)], large collection of speeches and primary documents, 1865–1870, complete text online. [The copyright has expired.]\n* Palmer, Beverly Wilson and Holly Byers Ochoa, eds. The Selected Papers of Thaddeus Stevens 2 vol (1998), 900 pp; his speeches plus and letters to and from Stevens\n* Palmer, Beverly Wilson, ed/ The Selected Letters of Charles Sumner 2 vol (1990); vol 2 covers 1859–1874\n* [https://cdl.library.cornell.edu/cgi-bin/moa/moa-cgi?notisid=ABK2934-0012-69 Charles Sumner, \"Our Domestic Relations: or, How to Treat the Rebel States\" Atlantic Monthly September 1863], early Radical manifesto\nYearbooks\n* American Annual Cyclopedia...1868 (1869), [https://books.google.com/books?id=maIoAAAAYAAJ online], highly detailed compendium of facts and primary sources; details on every state\n* American Annual Cyclopedia...for 1869 (1870) [https://books.google.com/books?id=ZyMVAAAAYAAJ online edition]\n* [https://books.google.com/books?id=LJ4YAAAAIAAJ Appleton's Annual Cyclopedia...for 1870] (1871)\n* [https://books.google.com/books?id=Jp8YAAAAIAAJ  American Annual Cyclopedia...for 1872] (1873)\n* Appleton's Annual Cyclopedia...for 1873 (1879) [https://books.google.com/books?id=c6QoAAAAYAAJ online edition]\n* [https://books.google.com/books?id=2WcMAAAAYAAJ  Appleton's Annual Cyclopedia...for 1875] (1877)\n* Appleton's Annual Cyclopedia ...for 1876 (1885) [https://books.google.com/books?id=r6MYAAAAIAAJ online edition]\n* [https://books.google.com/books?id=Do4EAAAAYAAJ Appleton's Annual Cyclopedia...for 1877''] (1878)"
    }
  ]
}