{
  "content": [
    {
      "type": "text",
      "text": "# Radio in the United Kingdom\n\n}}\nRadio broadcasting in the United Kingdom involves around 600 licensed radio stations.\nBBC Radio\nCommercial radio\nAlso available nationally on analogue radio are two national commercial channels, namely Classic FM (FM 99.9&nbsp;MHz—101.9&nbsp;MHz); and Talksport (AM 1053&nbsp;kHz or 1089&nbsp;kHz in most areas). These stations are also available at 11D or 12A on DAB (on the Digital One multiplex). As with the BBC, digital radio has brought about many changes, including the rollout of local stations such as Radio X, Kiss and Kerrang Radio to other areas of the United Kingdom.\nCommercial radio licences are awarded by Ofcom, a government body which advertises a licence for an area and holds a so-called \"beauty contest\" to determine which station will be granted permission to broadcast in that area. Stations submit detailed application documents containing their proposed format and the outcome of research to determine the demand for their particular style of broadcast. Original 106 was the last radio station to be granted a licence by Ofcom.\nMost local commercial stations in the United Kingdom broadcast to a city or group of towns within a radius of 20–50 miles, with a second tier of \"regional\" stations covering larger areas such as North West England. The predominant format is pop music, but many other tastes are also catered for, particularly in London and the larger cities, and on digital radio.\nRather than operating as independent entities, many local radio stations are owned by large radio groups which generally broadcast the same station on frequencies which used to carry local individual stations with their own station name. They broadcast as a single network with local inserts for news, weather, travel and commercials. The largest operator of radio is Global Radio which bought the former media group, GCap Media; it owns Classic FM and the Capital radio network. Other owners are Bauer Radio and News Broadcasting, which mainly own stations that broadcast in highly populated city areas.\nMany of these stations, including all the BBC stations, are also available via digital television services.\nCommunity radio\nCommunity radio stations broadcast to a small area, normally within a 3-mile (5&nbsp;km) radius, and are required by the Act to be not-for-profit organisations, owned by local people, on which the broadcasters are mostly volunteers. They are recognised under the Communications Act 2003 as a distinct third tier of radio in the United Kingdom. The community radio movement in the United Kingdom was founded in the mid-1970s, broadcasting through Restricted Service Licences, the internet and cable television.\nAn Access Radio pilot scheme, launched in 2002, gave fifteen stations, including Resonance FM and ALL FM, trial licences, and this has blossomed into a lively sector, overseen unofficially by the Community Media Association.\nThe broadcasters predominantly serve an easily defined racial community such as Asian Star Radio in Slough, or a geographically defined community such as Coast FM, Speysound Radio or The Bay Radio. They can also serve religious groups, such as Christian radio station Branch FM in Yorkshire. As well as this, they can also be linked with universities and student unions who run the stations under a community licence, for example Smoke Radio in London, Demon FM in Leicester, and Spark FM in Sunderland.\nHospital radio\n* Hospital radio\n* List of hospital radio stations in the UK\nRadio publications\n* Practical Wireless\n* Radio Times\n* Radio Today (website)\n* RadCom\nStatistics\nSee also\n* British Wireless for the Blind Fund\n* Broadcasting Act 1990\n* Communications Act 2003\n* Digital radio in the United Kingdom\n* Independent Local Radio\n* Independent National Radio\n* List of radio stations in the United Kingdom\n* List of DAB multiplexes in the United Kingdom\n* Pirate radio in the United Kingdom\n* Radio Academy\n* Student Radio Association\n* Timeline of digital radio in the United Kingdom\n* Timeline of independent radio in the United Kingdom\nNotes\nReferences"
    }
  ]
}