{
  "content": [
    {
      "type": "text",
      "text": "# RAF Warmwell\n\n| pushpin_map = Dorset\n| pushpin_map_caption = Shown within Dorset\n| pushpin_label = RAF Warmwell\n| pushpin_label_position =\n| ownership = Air Ministry\n| operator = Royal Air ForceUnited States Army Air Forces\n| controlledby = RAF Flying Training Command1937-40RAF Fighter Command1940-44 & 1944-Ninth Air Force1944\n| open_to_public =\n| site_other_label =\n| site_other =\n| site_area =\n| code = XW\n| built = /37\n| used = May 1937 - November\n| builder =\n| materials =\n| height =\n| length =\n| fate =\n| condition =\n| battles = European theatre of World War II\n| events =\n| past_commanders =\n| garrison =\n| occupants =\n| designations =\n| website =\n| footnotes =\n| IATA =\n| ICAO =\n| FAA =\n| TC =\n| LID =\n| GPS =\n| WMO =\n| elevation =\n| r1-number = 00/00\n| r1-length =\n| r1-surface = Grass\n| r2-number = 00/00\n| r2-length =\n| r2-surface = Grass\n| r3-number = 00/00\n| r3-length =\n| r3-surface = Grass\n| h1-number =\n| h1-length =\n| h1-surface =\n| airfield_other_label =\n| airfield_other =\n}}\nRoyal Air Force Warmwell or more simply RAF Warmwell is a former Royal Air Force station near Warmwell in Dorset, England from 1937 to 1946, located about 5 miles east-southeast of Dorchester; 100 miles southwest of London.\nDuring the Second World War it was used by the Royal Air Force and the United States Army Air Forces Ninth Air Force.\nHistory\nRAF use\nAt  above sea level RAF Warmwell originally opened in May 1937 as a landing ground named RAF Woodsford, for units carrying out air-to-ground firing and bombing on ranges set up off the south coast of Dorset at Chesil Bank. With the airfield code of 'XW' it was renamed RAF Warmwell in July 1938 due to possible confusion with Woodford, near Manchester, which was an airfield where Avro was producing the Lancaster bomber. After the use by squadrons using the ranges diminished, and as the Second World War started more and more units were based here to act as fighter defence for the important naval facilities at Portland and Portsmouth, as well as working in 10 Group as part of the fighter defences for the south-west of England. Warmwell's three runways remained grass-surfaced for its entire life even though as the war progressed, and the emphasis became on intruding into German-occupied Europe, many intruder units were based here, using the Supermarine Spitfire, Hawker Hurricane and Tempest, and the Westland Whirlwind, the first twin-engined heavy fighter for the RAF.\n* Air Sea Rescue Flight RAF, Warmwell (1941) became No. 276 Squadron RAF\nThe following units were also here at some point:\n;Units:\nUSAAF use\nAlthough USAAF-marked aircraft were seen at Warmwell from July 1942 it was not until March 1944 that the base came under American control. While under USAAF control, Warmwell was known as USAAF Station AAF-454 for security reasons, and by which it was referred to instead of location.\n474th Fighter Group\nThe 474th Fighter Group arrived on 12 March 1944 from Oxnard Flight Strip California flying Lockheed P-38 \"Lightnings\".  Operational squadrons of the group were:\n* 428th Fighter Squadron (F5)\n* 429th Fighter Squadron (7Y)\n* 430th Fighter Squadron (K6)\nResumed RAF use\nThe 474th was a group of Ninth Air Force's 70th Fighter Wing, IX Tactical Air Command which left for the Continent in August 1944, and the RAF once more assumed control of the airfield. After the last RAF squadrons to be based there left and Armament Practice Camps stopped using the ranges by October 1945 the station went onto Care and Maintenance the following month before closing down. During the immediate post-war years the hangars were used for food storage but this was not quite the end for the airfield, for during the extensive test programme for the Westland Wyvern, company test pilot Harald Penrose had to make a force-landing on the obstructed and overgrown surface.\nCurrent use\nThe airfield proper has for many years been occupied by a quarry which has effectively removed all trace of the flying field, whilst the site on which the technical site once lay is now a small village called Crossways, the original northern taxiway being still in use as a road through the village where two dispersal pans and the old ATC tower (albeit heavily converted to a public dwelling - Egdon House) still remain, and the old station cinema is now the .  still remain, rumoured to be used by local farmers for fertilizer storage, plus an Over Blister hangar (one of eight built during the war) and other buildings exist in the woodland areas surrounding Crossways, although some have been demolished. One of the base's billets is now one of the local shops, and at the junction of Mount Skippet Way and Airfield Close in Crossways village housing is a memorial to the airfield, located in a grassed recreational area. During recent clearance work in preparation for new buildings on the North East side of the old airfield a brick block house and a concrete rifle range were revealed. Both have now been demolished but the photographs shown were taken just prior to their removal. Further clearances to build an access road across the south-east corner of the flying field has also resulted in the excavation of a group of the aircraft tie-down points.\nSee also\n*List of former Royal Air Force stations\nReferences\nCitations\nBibliography\n*\n* Freeman, Roger A. (1994) UK Airfields of the Ninth: Then and Now 1994. After the Battle\n* Freeman, Roger A. (1996) The Ninth Air Force in Colour: UK and the Continent-World War Two. After the Battle\n*\n*|reference=Maurer, M. Air Force Combat Units Of World War II. USAF Historical Division. Washington D.C., USA: Zenger Publishing Co., Inc, 1980. .}}\n* [http://home.att.net/~jbaugher/usafserials.html USAAS-USAAC-USAAF-USAF Aircraft Serial Numbers--1908 to present]\n* Anthony Cooke (2000) Reflections of RAF Warmwell:\n* Anthony Cooke (1995) Airfield Focus - 21: Warmwell .\nExternal links\n* [https://web.archive.org/web/20080118155145/http://daveg4otu.tripod.com/dorset/war.html RAF Warmwell on Dorset Airfields]\n* [http://www.rafwarmwell.org.uk/ RAF Warmwell: WW2 Dorset RAF Airbase]\n* [https://archive.today/20070518161644/http://worldwar2airfields.fotopic.net/c236380.html Photographs on worldwar2airfields.net]\n* [http://www.152hyderabad.co.uk 152 Hyderabad]"
    }
  ]
}