{
  "content": [
    {
      "type": "text",
      "text": "# RAF Locking__disambig_1\n\n| type = Royal Air Force training station\n| coordinates =\n| gridref =\n| image_map =\n| image_mapsize =\n| image_map_alt =\n| image_map_caption =\n| pushpin_map = Somerset\n| pushpin_mapsize =\n| pushpin_map_alt =\n| pushpin_map_caption = Location in Somerset\n| pushpin_relief =\n| pushpin_image =\n| pushpin_label = RAF Locking\n| pushpin_label_position = left\n| pushpin_mark =\n| pushpin_marksize =\n| ownership = Ministry of Defence\n| operator = Royal Air Force\n| controlledby =\n| open_to_public =\n| site_other_label =\n| site_other =\n| site_area =\n| code =\n| built =\n| used = 1939–\n| builder =\n| materials =\n| height =\n| length =\n| fate = Site sold and station buildings demolished, redeveloped for commercial and residential use.\n| condition = Closed\n| battles =\n| events =\n| current_commander =\n| past_commanders =\n| garrison =\n| occupants =\n| website =\n| footnotes =\n}}\nRAF Locking was a Royal Air Force station near the village of Locking and about  from Weston-super-Mare in North Somerset, England. During the period 1939 to 2000, the station trained tens of thousands of engineers in the maintenance of aircraft then radar, radio and computers.\nNo 5 School of Technical Training\nEarly in 1938 the Government purchased  of land near to the village of Locking and warned adjacent landowners not to sell further property.  Speculation about its use was ended when the House of Commons was notified of additional technical training camps during the RAF Expansion Debate on 12th May 1938. RAF Locking was opened as a training unit in 1939 as No.5 School of Technical Training.  Its role was to train new RAF and Fleet Air Arm entrants in the trades of aircraft mechanics, airframes, carpentry, fabric working and parachute packing. Training was also provided for marine craft personnel.  Within three years 30,682 personnel had been trained. Fleet Air Arm training ceased at the end of 1942 after 5710 ratings had passed through.  RAF training continued and by the end of WW2 the station had developed into a huge settlement comprising hutted accommodation, classrooms and offices, workshops and hangars.  Aircraft used for training included Avro Ansons, Gloster Meteors, Hawker Hunters and a Handley Page Victor.  Thousands of personnel were trained in support of the war effort. Training was gradually reduced in line with the numbers in the forces and No.5 School of Technical Training closed in 1950.\nBoy Entrant Training\nIn May 1947 the first recruits to the Royal Air Force boy entrants scheme arrived at RAF Locking.  They were to graduate in November 1948. The scheme offered general education and technical  training to boys aged 15 to 17 and a half whose education was not up to School Certificate level.  Recruits needed nomination by an approved organisation such as their local education authority or the Boy Scouts Association.  They were also required to undertake aptitude and intelligence tests. The scheme was run down after five entries.  Subsequent entries were partially or totally completed at RAF Cosford. After the tenth entry, the scheme was discontinued.\nNo 1 Radio School\nTen days after the closure of No 5 School of Technical Training, RAF Locking was transferred to No 27 Group, RAF Training Command, to become the home of No. 1 Radio School RAF responsible for the training of radio and radar trades. The school developed from the Royal Flying Corps School of Wireless Operators that moved to what became RAF Flowerdown in Hampshire in 1918.The apprentice training school then moved to RAF Cranwell in 1929.  The school became known as No 1 Radio School in 1943 and moved to RAF Locking in 1950. During its time at RAF Locking it supported training of apprentices, adult trainees of all UK forces and many overseas students.  It was not until 1990 that the station gradually closed down and No 1 Radio School transferred to RAF Cosford to become part of the Defence School of Communications and Information Systems.\nApprentice Training\nIn 1952 Apprentice Training of radio and radar was moved from RAF Cranwell to RAF Locking. At the time, the training accounted for both ground based and airborne specialisations. In 1965 all aircraft electronic courses were transferred to RAF Cosford.  At Locking, in 1964 apprentice training was initially developed in two levels: a two year Craft Apprentice course from which 1085 personnel graduated as Junior Technicians, and a three year Technician Apprentice course from which 248 personnel graduated as Corporals. In 1970 a Mechanic Apprentice course was introduced from which 111 personnel graduated as Senior Aircraftsmen. Initially, training concentrated on theoretical subjects. Later saw the transition to more practical matters including workshop practices and training on specific equipment. Lastly, skills were developed to maintain, modify, repair and operate electronic equipment. A third aim of training was to develop leadership, pride of service and sense of responsibility. In common with other RAF training establishments, Apprentice training at RAF Locking ceased in 1976.\nRAFLAA Monument\nTwenty five members of the Royal Air Force Apprentice Association (RAFLAA) and their wives together with 45 other guests assembled at 2pm on Wednesday 18 July 2018 to witness the dedication of the RAFLAA Monument.  The monument commemorates the training of over 5,750 apprentices at RAF Locking during the period 1952 to 1976. Squadron Leader Richard Atkinson AFC RAF (Retd.) was the designer and driving force for the construction of the monument. He was an apprentice at RAF Locking from 1959 - 1961.   In attendance were Air Commodore Martin Palmer RAF (Retd.) President of the Association, The Honourable Mayor of Weston-super-Mare, Squadron Leader John Clark (Retired) ex Flight Commander RAF Locking, the Chairman of Locking Parish Council, St Modwen Southwest Regional Director, St Modwen Senior Development Manager, representatives from Homes England, and the Branch Secretary of the Weston-Super-Mare Royal Air Force Association.\nThe Western Band\nAfter the war, RAF bands were re-established as six Regional Bands. At first known as No 5 Band, the Western Band of the Royal Air Force was initially formed at Bridgnorth in 1947, then at Stanmore, next at Buckeburg in Germany, before finally settling at RAF Locking in 1949.  During the 1950s and 1960s the band was mostly engaged with Apprentice and station parades alongside its duties throughout Wales and the Southwest of England.  In 1964 the Near East Air Force Band was disbanded resulting in the Western Band taking responsibility for an annual tour of the Mediterranean and Gulf states.  In 1977 the Southern Band, formerly No 4 Band, ceased operations leaving the Western Band as the last of the six Regional Bands.  During the Gulf War the band was deployed to Saudi Arabia to provide medical orderlies.  The band undertook multiple overseas tours including one accompanying The Queen on a state visit to Thailand.  In 1997 the imminent closure of RAF Locking caused the posting of band members and the loss of identity of the Western Band which had provided 50 years of music.\nMajor rebuild\nIn the early 1960s a major plan to replace hutted accommodation with more substantial buildings was implemented.  Notable was the provision of 14 apprentice blocks each to accommodate 80 residents.  Each of the blocks was given the name of a Royal Flying Corps or Royal Air Force Victoria Cross holder.  Included in the plan were the provision of new Mess buildings for Officers and for Senior NCOs, a Training Wing headquarters, Apprentice Mess and club, airmen’s mess, and NAAFI.  A new station headquarters was built overlooking the parade square  whilst a new gymnasium was provided.  Planned but not provided was a swimming pool. Helpfully the RAFLAA provided a map depicting the station layout, as it was in 1964, on the rear of their monument.  Of all the new buildings that were so established, when the station was bulldozed in 2004 only  St Andrews (PMUB) church survived and was converted to the Locking Parklands Community Centre.\nTraining development\nOne of the factors which governed the switch from apprentice to adult recruits was the raising of school leaving age in England and Wales in the early 1970s.  The change which sought to attract more mature recruits included a requirement that they be educated to include General Certificate of Education ‘O’ levels in mathematics and a science subject.  Direct Entrant Mechanics graduated after 16 weeks in the rank of Leading Aircraftsman or Senior Aircraftsman.  Direct Entrant Adult Fitters graduated after 14 months in the rank of Junior Technician.  The Fitter course commenced with theoretical subjects.  Aligned was practical application including introduction to fault diagnosis.  Trade practices were included to develop workshop skills in correct use of tools, soldering, wiring terminations and basic filing and shaping of various materials.  The second phase of training concentrated on learning about specific equipment already in service within the intended trade,  Compared to Apprentice training which typically lasted 2 or 3 years, Direct Entrant training lasted for 14 months.  Published statistics indicate that after re-development, No1 Radio School provided initial or further technical training to over 14,000 personnel of which 1,700 were foreign students.  In addition, training of new equipment and systems was provided to Royal Air Force, Royal Navy and British Army students.\nGiven No 1 Radio School’s training included that of computers, it was natural that in 1976 it assumed responsibility for the tuition of Synthetic Trainers, otherwise known as simulators to personnel who graduated in the trade of L Tech ST.  Then between 1988 and 1989 the School absorbed the training of personnel of Trade Group 11, Telecommunication Operators.\nNotable visitors\nMarshall of the RAF Lord Trenchard, the founder of the RAF, visited the station in August 1941 and again in 1942.\nRAF Locking was visited by HRH Group Captain the Duke of Kent in July 1940. He returned, promoted to the rank of Air Commodore in April 1941\nHRH Princess Margaret  visited the station in 1953, 1955, 1974 and 1994.\nHRH the Princess of Gloucester reviewed a parade in 1959.  In 1979 she returned in the rank of Air Marshall\nIn 1978 Anne, Princess Royal attended a cadet rally at RAF Locking.\nThe station was visited by HM Queen Elizabeth II on 30th October 1986 during which she planted a tree.\nIn 1991 the station was visited my HRH Diana, Princess of Wales.\nCommunity engagement\nIn 1956 the station was granted the Freedom of the Borough of Weston-super-Mare allowing the station to parade through the Borough “with swords drawn, bayonets fixed, colours flying, drums beating and bands playing”. In 1971 the station gave the first midsummer open day for the public called Flowerdown Fair to raise funds for charities, notably the Royal Air Force Association and the Royal Air Force Benevolent Fund.  Initially a very much homespun event,  over subsequent years it became more and more ambitious with lengthy air displays. In December 1981, a disastrously high tide caused by an unexpected change in wind direction resulted in significant flooding in Weston-super-Mare and especially Uphill.  Personnel from RAF Locking turned out to assist under a scheme called Aid to Civil Powers.  Much of the work involved filling and dispersing sandbags and providing transport. In 1982 the station hosted the first British Sports Association for the Disabled BSAD) Wheel Chair Marathon.  Teams of three were to push a disabled person around a course for 26 miles and 385 yards, each team member taking it in turns and the passenger being the baton. Entry was open to any service or cadet team with the intention of making money for BSAD and providing fun and excitement for the passengers. In 1990, RAF Locking was awarded the Wilkinson Sword of Peace in recognition of its service to the local community.\nClosure and redevelopment\nThe final Freedom of Weston Parade was held on 23rd September 1998 and was honoured by a flypast by Spitfire MK356 of the Battle of Britain Memorial Flight and once gate guardian at RAF Locking.  The station was formally closed at 1600hrs on the 31st March 2000 in a ceremony involving the Royal Air Force Ensign and the Command Pennant being hauled down in the presence of the last Station Commander Sqn Ldr Geoff Symes.  At midnight the ownership of the site passed to Defence Estates. Ownership then passed to the South West Regional Development Agency.  Initially there were hopes to develop the site to include leisure facilities.  The decision was taken to demolish all buildings on the 81 hectare site and work commenced in 2003 and was completed in early 2004.  North Somerset Council’s intentions for the site, now called Locking Parklands, include the development of new homes with supporting infrastructure to include schools and a GP surgery.  The former airmen’s quarters estate has been renamed Flowerdown Park, whilst the former officer’s quarters estate is now Locking Grove.\nReferences"
    }
  ]
}