{
  "content": [
    {
      "type": "text",
      "text": "# Railways in Kathiawar\n\n(districts): Halar, Jhalavad, Sorath and Gohelwad. This map, produced by the Government Photographic Department, Poona dated 1878 has been marked up with colour coding to aid identification and provide the time scale of the construction and other proposals of the Railways/Tramways in the Peninsula.]]\nKathiawar is a peninsula which today forms part of the Indian state of Gujarat. The peninsula covers an area of 23,345 sq. miles (60,720 sq.&nbsp;km) and in 1901 had a population of 2,645,805.\nKathiawar in the late 19th century was governed by 193 small Princely States, ruled by local potentates who acknowledged British control in return for local sovereignty. These states comprised the \"Kathiawar Agency\". The rest of the peninsula, chiefly in the east along the Gulf of Cambay, were districts ruled directly by the British as part of British India's Bombay Presidency, which included part of the peninsula.\nIn 1872, the Bombay, Baroda and Central India Railway (BB&CIR) railway extension from Viramgam reached Wadhwan. This started a period of growth in railways financed and operated by the Native states. The problem was that there were many small states which were crossed. Only the three larger states could afford to build such constructions which led to problems and many partners leading to appeals for compensation from the local Durbar Governments.\nBelow were three major railways:\n*Kathiawar State Railway\n*Bhavnagar State Railway\n*Gondal State Railway\nwhich worked together with other minor railways:\n*Morvi Railway\n*Junagadh State Railway\n*Porbandar State Railway\n*Dhrangadhra Railway\n*Jetalsar–Rajkot Railway\n*Jamnagar & Dwarka Railway\nThese railways merged, with others, in 1948 to form the Saurashtra Railway. Saurashtra Railway later along with others became part of Western Railway of Indian Railways.\nCustoms union of British India\nThe Government of India Act 1858 brought India under the direct control of the British Crown. Kathiawar by its nature as a collection of individual autonomous states did not fall into the provision of the act. The Gaikwar of Baroda had already handed their right to the area over to the British India as part of the settlement of 1807 which saw the Government in Bombay dealing with the political development of the peninsular. In 1882 Lord Lytton wrote:\nThe raising of taxes and tariffs was left to the individual states. Some states such Rajkot, Palitana and Bhavnagar instituted legislative assemblies although these were partly a cosmetic attempted to start a democratisation of the states. The right to levy taxes on the people and interstate was a privilege the princely families was not going to give up easily. The result was higher and higher tariff walls within the province. Some of the larger states like Gondal and Palitana did not charge duties, making the transit of goods via those states preferable. With the maritime states, the tariffs were set to encourage imports and exports from the interior to their respective ports. This only produced what only could be termed economic warfare and the over development of their ports the only thing it actually produced was bad feelings between the various states and an encouragement of imports over local development of the hinterland States.\nAs these tariffs caused barriers in the development of the peninsular there was a call for a unification and removal of these barriers this idea was turned down by the Durbars at the time as late as the 1820s. The import of British manufactured goods was the cause of the decline in the Indian craft industries. The states had no trading agreements with the East India Company nor the British Government but the development of the ports took trade away from the British Ports and Bombay, the exception was Bhavnagar which had been accorded the status of a British Port. The railways gave it a fast and vital link into parts of northern and Central India and with the subsidies it gave the import of goods a lucrative trade. In 1917 the ports were admitted into the British customs union and further development of the ports and links took place.\nTimeline\nThe development of the Network followed a chequered history with many false starts.\n*1863: Ghogha Kathiawad Light Railway Proposal\nThere is an unconfirmed record that states ‘During 1863, Maharaja Jaswantsinhji received a proposal to start a Narrow Gauge line like in parts of Gaekwad Railway in Baroda. Maharaja was not inclined, as by that time another company called Ghogha Kathiawad Light Railway Company had been formed... But nothing materialised.’.\n*1869: Gondal-Ghogha Port Railway Proposal shown in PINK on map.\nA railway to connect Gondal to the sea at Ghoga, in the Bay of Cambay was considered important to develop the region. The railway from Gogha Port to Gondal was planned by private enterprise, but no surveys were made.\n*1869: Junagadh-Verval Railway Proposal\nThe Kathiawar reports from 1869 notes that a survey had been made for a Railway line from Junagadh to Verval was finished but the cost of 40 to 50 Lakhs of Rupees was too high for the Durbar to go ahead. Proposals for a light railway system were being looked at.\n*1872: Veraval-Junagadh-Dhoraji Railway Proposal  Final 1888-89 route shown in GREEN on map - see note.\n'Another line was proposed from Veraval to Junagadh and Dhoraji and was surveyed by Mr A W Forde C E, but the cost was beyond the means of Junagadh Durbar. This proposal came to nothing'.\nIt seems probable these two accounts of 1869 and 1872 refer to the same proposal, which was not implemented.\nNote – it was only in 1888-89 that the Junagadh State Railway(JunSR)  opened the line from the docks at Veraval via Junagadh  to Jetalsar - (see 1888-89 below) where it connected to the Bhavnagar State Railway at Dhoraji.\n*1872: Bombay, Baroda and Central India Railway (BB&CIR) shown in RED on map.\nThis 39 mile(63km) broad gauge (BG) branch line from Viramgam to Wadhwan opened on 23 May 1872. This being the first railway in the peninsular.\nIt was subsequently converted to metre gauge(MG) in 1902.\n*1874: Bhavnagar to Wadhwan Railway Proposal  Final 1879-80 route shown in BLUE on map - see note.\n‘In 1874 a third line was considered from Bhavnagar to Wadhwan, but a difference of opinion as to the proper route and the probable cost prevented action’.\nNote – this line finally opened in 1880 - see below\n*1877: Bhavnagar-Gondal Railway Survey  Final 1879-80 route shown in BLUE on map.\n‘It was not until June 1877 that steps were taken to begin the Bhavnagar-Gondal line, a distance of 201 miles using funds supplied by Bhvnagar and Gondal States under British Management. The joint Administrators of Bhavnagar State for the line in their Territory and Gondal employed Mr Forde, C. E., to survey an extension to Dhoraji. The Government of Bombay commissioned Mr Hargrave C.E. of Baroda Railway, to survey from Bhavnagar to Wadhwan. Labouring under restrictions as to the route the proposals were broadly followed, except the Gondal section which was modified’.\n*1879-80: Bhavnagar State Railway  shown in BLUE on map.\n‘First sod turned on the 20th March 1879 by the Bhavnagar State engineer and two miles of embankments built. Mainline to Wadhwan opened for traffic on December 16th 1880 by the Governor of Bombay. In the 106 miles between Bhavnagar and Wadhwan had 16 stations they were Bhavnagar Wharf, Bhavnagar city, Gadichi, Vartej, Sihor, Songad, Sanosra, Dhola Junction, Ujalvav, Nigala, Botard, Ranpur, Chuda, Limbdi, Kharva, Wadhwan City and the Junction with the BB&CIR Railway.\n*1881: Bhavnagar State Railway and Gondal State Railway shown in BLUE/YELLOW on map.\n‘.. and a month later the branch from Dhola Junction to Dhoraji. At a cost of Rs8,600,000. Apportioned 2/3 Bhavnagar and 1/3 Gondal. The Branch line has 12 stations from Dhola Junction, Mandava, Dhasa, Lathi, Adtala, Chital, Mayapadar, Kunkavav, Khadkhad or (Sultanpur Road), Vavdi, Jetpur, Jetalsar and Dhoraji. At mile 122 from the port the total is 201.6 Miles. Much damage was done to the embankments from too small provision for water ways and several stations and buildings fell before they were used. By the first half of 1882 the Profits were about Rs300,000 (£30,000).\n*1884-87: Morvi Railway  shown in LIGHT GREEN on map.\nIn 1884 the Morvi Durbar started construction of its 2ft 6in/762mm narrow gauge(NG) tramway from Wadhwan to Rajkot via Muli, Dolia and Vankaner. The line was 76 miles passing through various small states. The Wadhwan Durbar was concerned about this and refused it entry into Wadhwan without an acceptance that they owned the rights of passage over the Bhogava River and paying such duties as required. It was also not supposed to link with the BB&CIR Railway.  In 1887 the 2ft 6in/762mm NG line from Vankaner to Morvi, opened; 15.7 Miles(25km)  of 2’6” gauge tramway.\n*1888-89: Junagadh State Railway  shown in DARK GREEN on map.\nThe 16 mile(26km) MG line from Jetpur via Jetalsarto Junagadh  opened Sept 1888, operated by Bhavnagar State Railway built by Junagadh State.\nGondal gave permission for the Jetpur section to be built subject to that if the Jetalsar Gondal Rajkot line was built it would be handed to Gondal at cost.  The 15 mile(24km) extension from Junagadh to Veraval Docks opened in Feb 1889.\n*1889-90: Porbandar State Railway  shown in DARK RED/BLUE on map.\nThe Government of India “persuaded” Gondal to assist with the building of a line to Porbandar which opened 1889 and extended to reach on to the harbour of Porbandar in 1890.  Gondal really wanted to spend the money on the Jetalsar-Rajkot Railway.\n*1890-91: Morvi Railway  shown in LIGHT GREEN on map.\nThe ‘Wankaner to Malia Section’ of the Morvi Railway opened in 1890 and was laid as a 2ft 6in/762mm narrow gauge(NG) road-side tramway by the Morvi Durbar for the convenience of the people and for transportation of Salt and cloth. and the port of Navlakhi. This appears in some records as the ‘Wankaner-Maliya Miyana Section’  and is reported to have been converted to MG in 1924 – see below\nIn 1891 the Morvi Railway was extended to interchange with the BB&CIR MG line at Wadhwan; this was against all agreements. This led to notices being given to the Managers of the BB&CIR and the Morvi Railway. Terms were finally agreed in 1897. Wadhwan became a partner paying Rs2 lacs for the upgrade of the line between Wadhwan and Dolia.\n*1893-96: Jetalsar-Rajkot Railway  shown in PURPLE on map.\nThe 46 mile(74km) MG line from Jetalsar Junction to Rajkot was built by a consortium comprising:- Gondal 6/16; Junagadh 6/16; Jetalsar 2/16; and Rajkot 2/16. The line was opened Apr 1896  by Lord Harris Governor of Bombay. It was built by a consortium (in proportions):- Gondal 6/16, Junagadh 6/16, Jetalsar 2/16, and Rajkot 2/16; this agreement had been signed on the 14th November 1891.\n*1893-97: Jamnagar State Railway  shown in BLUE on map.\n1893, Construction of the Rajkot to Nawanagar line commenced. In April 1897 the MG line from Rajkot to Nawanagar and the port at Bedi Bandar opened,  54 miles(87km). The railway was worked by the BGJPR coalition and until 1911 when dissolved, then independently and later as the Jamnagar & Dwarka Railway(J&DR).\n*1897-1900: Dhrangadhra State Railway  shown in BLUE on map.\n1897 Dec 1, Lord Sandhurst cuts the first sod in the construction of the Wadhwan to Dhrangadra  railway. 1898, the MG line from Wadhwan and Dhrangadhra opened, operated initially by Bhavngar Railwa and in 1900 Famine earth works from Halvad to Malia were in progress on the Dhrangada State Railway.\n*1900: There was an ‘Area wide Famine’\n*1900: Wadhwan-Sayla-Dolia Railway Proposal shown in PINK on map.\nColonel Hunter’s ‘Famine Relief Scheme’. Wadhwan via Sayla to Dolia, paid for by Wadhwan and Sayla Durbars, not completed due to objections by Morvi Darbar. Earthworks built before Morvi Darbar objected and the scheme abandoned.\n*1902: Bombay, Baroda and Central India Railway (BB&CIR)  shown in RED on map.\nThis 39 mile(63km) branch line from Viramgam to Wadhwan was converted to metre gauge(MG); it was previously broad gauge (BG) and had opened in 1872.\n*1904-5: Morvi Railway  shown in MUSTARD YELLOW on map.\nThe NG tramway from Wadhwan to Rajkot that had been constructed from 1884 (see above) was converted to metre gauge(MG) and linked to the BB&CIR MG at Wadhwan. The new line was diverted some 4 miles to the north closing the stations at Sayla and Dolia. The railway was now north of the Bhogavo River and travelled through 8 miles of Sayla territory  and mainly followed the line of the tramway from Than via Vankaner to Rajkot.\nReferences"
    }
  ]
}