{
  "content": [
    {
      "type": "text",
      "text": "# Rainmaking (ritual)\n\nRain Dances}}\nA rain dance being performed in Harar, Eastern Ethiopia\nagency, presumably Prairie Band Potawatomi people)]]\nRainmaking is a weather modification ritual that attempts to invoke rain. It is based on the belief that humans can influence nature, spirits, or the ancestors who withhold or bring rain.\nAmong the best known examples of weather modification rituals are North American rain dances, historically performed by many Native American tribes, particularly in the Southwestern United States. Some of these weather modification rituals are still implemented today.\nAmerican Rainmakers\nby George Catlin, 1830s]]\nJulia M. Buttree (the wife of Ernest Thompson Seton) describes the rain dance of the Zuni, along with other Native American dances, in her book The Rhythm of the Redman. Feathers and turquoise, or other blue items, are worn during the ceremony to symbolize wind and rain respectively. Details on how best to perform the Rain Dance have been passed down by oral tradition. In an early sort of meteorology, Native Americans in the midwestern parts of the modern United States often tracked and followed known weather patterns while offering to perform a rain dance for settlers in return for trade items. This is best documented among the Osage and Quapaw tribes of Missouri and Arkansas.\nIn April 2011, Texas governor Rick Perry called the Days of Prayer for Rain in the State of Texas, asking that Texans pray for \"the healing of our land [Texas]\" and for an end to the drought.\nIn the Ozarks, multiple methods of attempting to call rain have been documented:\n}}\nAfrican Rainmakers\nRain is a central concern of low-rainfall African societies outside Equatorial Africa, which depend on it for their sustenance and that of their animals. The power to make rain is usually attributed to African kings. In a number of African societies, kings who failed to produce the expected rain ran the risk of being blamed as scapegoats and killed by their people.\nMaghreb\nTunisia\nOmek Tannou is an ancient Tunisian rainmaking ritual traditionally performed by rural communities during periods of drought. Children parade a wooden doll representing the goddess Tanit, singing supplications for rain. which was inherited from Punic and Berber traditions involving invocations of the goddess Tanit. It is now all but extinct though traces of the ritual survive in some folk songs and oral traditions in northern Tunisia.\nSouthern Africa\nSan people\nAmong the San, shamans enter a trance-often induced by rhythmic dancing and hyperventilation-to access the spirit world and spiritually capture mythical \"rain animals\", notably the eland antelope.\nLobedu people & the Mashona people\nA famous rain making monarch is the Rain Queen of Balobedu, South Africa. Queen Modjadji, or the Rain Queen, is the hereditary queen of Balobedu, a people of the Limpopo Province of South Africa. The Rain Queen is believed to have special powers, including the ability to control the clouds and rainfall. She is known as a mystical and historic figure who brought rain to her allies and drought to her enemies. The Lozi people are closely related to the Balobedu and therefore also have rainmaking abilities. Queen Modjadji is believed to have ancestral ties to the Shona people of present-day zimbabwe, a culture renowned historically for their rain shrines and ceremonies involving ancestral spirits. The Shona have some of the most powerful rainmaking abilities of the Southern Bantu as it was mainly practiced there until the late 1500s.\nMbukushu people\nThe Hambukushu are renowned for their rain-making abilities in the Okavango Delta, earning them the title \"The Rain-makers of Okavango.\"\nLozi people\nThe Lozi people of Zambia also conduct rainmaking ceremonies, often led by royal figures and spiritual mediums who invoke Nyambe (their high god) to bless the land with rain.\nAsian Rainmakers\nrain dance being performed in San Jose del Monte, Philippines, 2023]]\nIn Thailand and Cambodia, various rites exist to obtain rain in times of drought. The most peculiar of these is probably the procession of Lady Cat, during which a cat is carried around in procession through the streets of villages while villagers splash water at the cat, in hope that as water has come on the cat, water will fall on humans as well.\nChina\nWu Shamans in ancient China performed sacrificial rain dance ceremonies in times of drought. Wu anciently served as intermediaries with nature spirits believed to control rainfall and flooding.\n\"Shamans had to carry out an exhausting dance within a ring of fire until, sweating profusely, the falling drops of perspirations produced the desired rain.\"\nEuropean Rainmakers\nRoman religion had a ceremony called the  (Latin: \"calling the waters\") which sought to produce rain in times of drought. During the ceremony, the  had the  (\"Water-flowing stone\". Festus distinguishes it from another , \"stone of the Manes\") brought from its usual resting place, the Temple of Mars in Clivo near the Porta Capena, into the Senate.  Offerings were made to Jupiter petitioning for rain, and water was ceremonially poured over the stone.\nCaloian, Dodola and Perperuna'', among other terms, refer to a family of Slavic and Romanian rainmaking rituals, some of which survived into the 20th century.\nSee also\n* Green Corn Ceremony\nReferences\nExternal links\n* [http://cgi2.nhk.or.jp/michi/cgi/detail.cgi?dasID=D0004200019_00000 Dragon Festival for rainmaking in Nio, Japan]  NHK (video)\n* [http://e360.yale.edu/features/the_long_strange_journey_of_earths_traveling_microbes The Long Strange Journey of Earth's Traveling Microbes] (2011). Fred Pearce. Yale Environment 360."
    }
  ]
}