{
  "content": [
    {
      "type": "text",
      "text": "# Raja Ashfaq Sarwar\n\n| image               =\n| caption             =\n| title               = ex Member Punjab Assembly, PMLN Minister for Labour & Human Resource\n| term_start          = 11 May 2013\n| title2              = Secretary General PMLN Punjab\n| term_start2         = 2008\n| title3              = Adviser to Chief Minister Punjab\n| term_start3         = 2008\n| term_end3           = 2013\n| title4              = Member Punjab Assembly, Minister for Health & Population Welfare\n| term_start4         = 1997\n| term_end4           = 1999\n| title5              = Member Punjab Assembly,\n| term_start5         = 1993\n| term_end5           = 1996\n| title6              = Member Punjab Assembly, Minister for Youth AffairsMinister for Forestry, Wildlife, & Fisheries\n| term_start6         = 1990\n| term_end6           = 1992\n| title7              = Member Punjab Assembly, Minister for Labour\n| term_start7         = 1988\n| term_end7           = 1990\n| birth_date          =\n| birth_place         = Rawalpindi, Pakistan\n| alma_mater          = Lawrence College\n| party               = Pakistan Muslim League (N)\n| website             = www.pmln.org.pk\n| footnotes           =\n| death_date          =\n| relations           = Shahid Khaqan Abbasi (cousin)Sadia Abbasi (cousin)\n| term_end2           = 26 March 2013\n| term_end            = 2018\n}}\nRaja Ashfaq Sarwar (Urdu: ; 27 October 1954 — 11 April 2020) was a Pakistani politician, Member of Punjab Assembly, former Adviser to Chief Minister of Punjab, and Minister for Labour and Human Resource. He was Secretary General of the center-right party PMLN in Punjab. He had held various portfolios over his career including Minister for Youth Affairs, Minister for Forestry Wildlife & Fisheries, and Minister for Health.\nEarly life and education\nRaja Ashfaq Sarwar, born at Holy Family Hospital in Rawalpindi, hails from the village of Ghora Gali in the Murree Hills and is the eldest son of Raja Ghulam Sarwar (late) a two-time member of West Pakistan Assembly. He attended Lawrence College.\nPolitical career\nHis political career started in 1988 when he successfully contested for a Punjab Assembly seat from Murree as an Independent candidate. He joined PML (a part of IJI then) later becoming PMLN, and was appointed Provincial Labour Minister.\nHe successfully contested for the same seat in 1990 and became the Punjab Minister for Forestry, Wildlife, Fisheries and Minister of Youth Affairs. Within the party he became President of PML Youth Wing Punjab where he appointed Khawaja Saad Rafique as general secretary. He was re-elected as an MPA in 1993 and 1997 where he became Provincial Minister for Health and Population Welfare up until the 1999 coup d'état by General Pervez Musharraf.\nFollowing the Military Coup he took a break from his own elections to focus on strengthening PML N, and restoring Democracy and the Judiciary in Pakistan. During this period he was twice-elected as General Secretary of PMLN in Punjab and currently holds this position. In 2008 he was appointed as Adviser to Chief Minister of Punjab Shahbaz Sharif.\nOn 11 May 2013 he was again elected as Member of Punjab Assembly from his home constituency of PP-1 in Rawalpindi District, serving Tehsil Murree and Tehsil Kotli Sattian, however he lost the 2018 General Election to Major Latosab Satti, a candidate of PTI.\nHe died on 11 April 2020 at the age of 65 after a prolonged illness.}}\nReferences\nExternal links\n* [http://pakistanileaders.com.pk/profile/Raja_Ashfaq_Sarwar Profile of Raja Ashfaq Sarwar]\n* [http://www.murreehill.com/polhis.html Political History of Murree]\n* [http://www.pmln.org.pk Official PML-N Website]"
    }
  ]
}