{
  "content": [
    {
      "type": "text",
      "text": "# Rakteswari\n\nRakteswari (also Rakteshwari), identified as an aspect of Adi Parashakti, also known as Durga Parameswari, is a principal and popular form of Hindu goddess worshipped mainly in Parshurama Kshetras.  Rakteswari is the iṣṭa-devatā (tutelary deity) of Tulu Nadu.\nWorship and festivals\nRakteswari is worshipped in the Hindu temples of India by adherents of Shaktism. Her temples, worship and festivals are particularly popular in Indian subcontinent during every Sankramana (or Sankranthi days/ Sun transit days of every month in Hindu calendar). Coconut flowers, Vermilion and whole coconuts are the significant offerings for her worship.\nThe beeja-mantra of Rakteswari, Om Kleem Ram Rakteswaryai namaha, is recited on Sikharagra (on top of a mountain), near a flowing river, any dense forest, Kadamba trees, garden, etc. under the guidance of a competent guru as any shakta (Shakta Upanishads) tradition requires.\nDeity Rakteswari is often misunderstood as a spirit/demon. Dakshinachara sects are dismissive of Rakteswari as a goddess who demands blood sacrifice. She is a fierce deity worshipped in her calm posture in dakshinachara (\"right-hand path\") with kumkum (Vermilion) and whole coconut as bali (offerings).\nAssociation with the planet Mars\nIn traditional Hindu astrology, Moon, Mars are the chief significators of blood in human body. When Mars is afflicted in any horoscope and it occupies an even sign, then goddess Rakteswari has to be propitiated to get rid of any blood related disorders. As per some local beliefs, contagious diseases like Smallpox and menstrual bleeding disorders (Mars represents private parts of body too) can be cured by worshipping Rakteswari\nThe vamamarga worship (\"left-hand path\") of Rakteswari is not ruled out in folklore genre. The Folk performances mandate music, folk dance, recital and other elaborate vesha (costumes ) as outlined in Dravidian Tulu Oral folk literature,  Cow ghee lamp and Kumkum (Vermilion) are offered to appease Rakteswari in typical household worship, like any other female deity.\nTemple\nThe regions of Konkan, coastal Karnataka and Kerala, considered as Parashurama Kshetra, have numerous temples dedicated to Rakteswari. Worship of Rakteswari by Brahmins and many other various Hindus in mulasthana  is famous in South Canara.\nRakteshwari, in dakshinachara (\"right-hand path\") tradition, is depicted as srichakravasini (peaceful and soothing deity as a resident of the tip of Sri Chakra) and worshipped as Durga Parameswari by Durga sukta and Śrī Sūkta.\nIconography\nSword,  one of the divine weapons of Adi Parashakti, which represents elimination of Discrimination according to Devi Mahatyam, is a symbolic form of goddess Rakteswari. The tip of Sri Chakra is an iconic form of the supreme goddess, Durga Parameswari.\nReferences"
    }
  ]
}