{
  "content": [
    {
      "type": "text",
      "text": "# Rally for Culture and Democracy\n\n||}}\n| logo             =\n| colorcode        =\n| president        =\n| founder          = Saïd Sadi\n| foundation       =\n| split            = Socialist Forces Front\n| ideology         = |Social liberalism|Berberism|Algerian nationalism|Secularism}}\n| position         = Centre to centre-left\n| headquarters     = Algiers\n| national         = Forces of the Democratic Alternative\n| flag             = File:Flag of the Rassemblement pour la Culture et la Démocratie.svg\n| logo_alt         = Logo of the Rally for Culture and Democracy\n| website          =\n| seats1_title     = Council of the Nation\n| seats1           = }}\n| country          = Algeria\n| colors           =   Blue, Yellow\n| seats2           = }}\n| seats2_title     = People's National Assembly\n| seats3           = }}\n| seats3_title     = People's Provincial Assemblies\n| seats4           = }}\n| seats4_title     = Municipalities\n| seats5           = }}\n| seats5_title     = People's Municipal Assemblies\n}}\nThe Rally for Culture and Democracy (; ; , RCD) is a political party in Algeria. It promotes secularism (laïcité) and has its principal power base in Kabylia, a major Berber-speaking region. Some consider it to take the position of a liberal party for the Berber-speaking population in Algerian politics.\nHistory and profile\nThe Rally for Culture and Democracy was founded by Saïd Sadi in 1989. He was a presidential candidate in 1995, winning 9.3 percent of the popular vote.\nIn 1997, the party won 19 of 390 seats. The RCD boycotted the 2002 elections. Saïd Sadi was a candidate again in the 2004 presidential election and won 1.9 percent of the vote. The party participated in the 2007 legislative elections, winning 3.36% of the vote and 19 seats.\nOn March 9, 2012, during an opening speech at the 4th RCD congress, Saïd Sadi announced that he would not seek a new term as president of the RCD. The doctor decided to withdraw from the presidency of his party to become a simple activist. \"With a clear conscience and full confidence in the future, I announce my decision not to run for the post of president of the RCD,\" he told the delegates.\nOn March 10, 2012, Mohcine Belabbas, deputy of Algiers, was elected president of the RCD, following the party congress, held in Algiers.\nThe RCD announced on March 20, 2021, that it would boycott the 2021 Algerian legislative elections.\nIn the repression against political activists that followed the Hirak, the Ministry of the Interior prohibited the RCD from using its premises to host \"illegal\" political or association meetings. On January 10, 2022, the RCD announced that its president, Mohcine Belabbas, was placed under judicial supervision by the investigating judge. In January 2022, the day after the Council of State froze the activities of the Socialist Workers' Party (PST), the RCD declared that this decision \"is none other than a questioning of political pluralism and exercise, hard-won achievements\" and denounces \"the administrative and judicial relentlessness\" which \"targets\" it as well as its president, Mohcine Belabbas, believing that this \"signs an unspeakable and unacceptable authoritarian drift\".\nThe party renews its leadership on June 3, 2022, with the election of Atmane Mazouz as party president.\nRegional strength\nIn the 2007 legislative election, support for the RCD was higher than its national average (3.36%) in the following provinces:\n{| class=\"wikitable\"\n!Province\n!Percentage\n|-\n|Tizi Ouzou Province\n|34.28%\n|-\n|Béjaïa Province\n|17.51%\n|-\n|Bouïra Province\n|9.09%\n|-\n|Algiers Province\n|8.58%\n|-\n|Illizi Province\n|7.31%\n|-\n|Tipaza Province\n|6.89%\n|-\n|Guelma Province\n|4.83%\n|-\n|Boumerdès Province\n|4.55%\n|-\n|Saïda Province\n|4.30%\n|-\n|Sétif Province\n|4.25%\n|-\n|Aïn Defla Province\n|3.43%\n|}\nMinisters\n{| class=\"wikitable\"\n|+RCD Ministers in the Algerian Government\n!Minister\n!Ministère\n!Government\n!Start\n!End\n|-\n|Amara Benyounès\n|Ministry of Health\n|Benbitour Government\n|December 23, 1999\n|August 26, 2000\n|-\n|Hamid Lounaouci\n|Ministry of Transport\n|Benbitour Government\nGovernment Benflis I\n|December 23, 1999\n|May 31, 2001\n|-\n|Amara Benyounès\n|Ministry of Public Works\n|Government Benflis I\n|August 26, 2000\n|May 31, 2001\n|}\nVisual Identity\nSee also\n* Politics of Algeria\n* Socialist Forces Front (FFS), the main socialist Berber party\n* Arouch Movement, a Berber political organisation modelled on traditional village councils\n* List of liberal parties\nReferences\nExternal links\n* (in Berber, French, and Arabic)"
    }
  ]
}