{
  "content": [
    {
      "type": "text",
      "text": "# Ralph King-Milbanke, 2nd Earl of Lovelace\n\nRalph Gordon King-Milbanke, 2nd Earl of Lovelace (2 July 1839 – 28 August 1906) was a British nobleman and author of Astarte: A Fragment of Truth concerning George Gordon Byron, Sixth Lord Byron. He was Lord Byron's grandson.\nLife\nRalph was born at 10 St James's Square, London on 2 July 1839. He was the second son of William King-Noel, 1st Earl of Lovelace, and Ada King, Countess of Lovelace, the world's first computer programmer. His maternal grandparents were the poet Lord Byron and Lady Annabella Byron, 11th holder of the barony of Wentworth.\nHis father, who succeeded as eighth Baron King in 1833, was created Earl of Lovelace on 30 June 1838. He was lord-lieutenant of Surrey from 1840 to his death in 1893, and interested himself in agricultural and mechanical engineering.\nDuring 1847–8, Ralph was a pupil at Wilhelm von Fellenberg's Pestalozzian school at Hofwyl, near Bern.\nSubsequently he was educated privately. He matriculated at University College, Oxford in 1859, but did not graduate.\nOn 1 September 1862, upon the death of his elder brother, Byron King-Noel, Viscount Ockham – who had succeeded his grandmother, Lady Byron, as 12th Baron Wentworth – Ralph  became 13th Baron Wentworth and Viscount Ockham (the courtesy title of Lord Lovelace's heir-apparent).\nHe assumed the surname of Milbanke, Lady Byron's maiden surname, by royal licence on 6 November 1861.\nTaking little part in public life, he read widely and showed independent if rather erratic judgment.\nAt the age of twenty-two he spent a year in Iceland and was a zealous student of Norse literature.\nIn early life he was a bold Alpine climber. He spent much time in the Alps, and in 1887 made the first ascent of the Aiguille Noire de Peuterey with his guide, Emile Rey. A peak of the Dolomites also bears his name. An accomplished linguist, he was especially conversant with Swiss and Tyrolese dialects. His intimate acquaintance with French, German, and English literature was combined with a fine taste in music and painting.\nHe enjoyed the intimacy of W. E. H. Lecky and other men of letters.\nIn 1893, he succeeded his father as second earl of Lovelace.\nIn 1906, he privately printed Astarte: A Fragment of Truth concerning George Gordon Byron, first Lord Byron, dedicated to his second wife Mary Caroline Lovelace née Stuart-Wortley.\nThis vigorous if somewhat uncritical polemic purported to be a vindication of Lovelace's grandmother, Lady Byron, from the aspersions made upon her after the \"revelations\" of Harriet Beecher Stowe in 1869–70.\nLovelace alleged, on evidence of hitherto undivulged papers left by Lady Byron and now at his disposal, that Byron's relations with his half-sister, Augusta Leigh, were criminal, and that she was the Astarte of the poet's Manfred. Lovelace printed a statement signed in 1816 by Dr. Lushington, Sir Robert Willmot, and Sir Francis Doyle, and various extracts from correspondence. He also cited a letter in support of his conclusion from Sir Leslie Stephen, who had examined the papers. Astarte provoked replies from a Mr. John Murray and from a Mr. Richard Edgcumbe.\nLovelace died very suddenly at Ockham Park, Ripley, Surrey, on 28 August 1906.\nAfter cremation at Woking Crematorium, his ashes were buried in All Saints' Church, Ockham. The church's King Chapel, intended as a chapel over the family vault, still contains the funerary urn with the ashes of the 2nd Earl of Lovelace and those of Lady Mary Lovelace. The urn has the form of a stone casket on monolithic pedestal with heraldic enamel plaques.\nFamily\nHe was first married, on 25 August 1869, to Fanny (died 1878), third daughter of George Heriot, vicar of St. Anne's, Newcastle. On 30 December 1880, he married Mary Caroline, eldest daughter of the Rt. Hon. James Stuart-Wortley. She survived him, but there was no male issue. Lovelace's daughter, Ada King-Milbanke, by his first wife, succeeded to her father's barony of Wentworth. The earldom of Lovelace devolved on his half-brother Lionel Fortescue King, son of the first earl by his second wife.\nNotes\nReferences\n*\n*\nExternal links\n*ThePeerage.com: Ralph Gordon Noel King, 2nd Earl of Lovelace – website ThePeerage\n*Ralph Gordon Noel – website Cracroft's Peerage"
    }
  ]
}