{
  "content": [
    {
      "type": "text",
      "text": "# Ramakrishna Mission Institute of Culture__disambig_1\n\n| headquarters        = Kolkata, West Bengal, India\n| leader_title        = Foundation Year\n| leader_name         = 29 January 1938\n| leader_title2       =\n| main_organ          =\n| affiliations        = Neo-Vedanta\n| membership          =\n| location            =\n| area_served         =\n| website             =\n}}\nThe Ramakrishna Mission Institute of Culture (RMIC) in Kolkata, India, is a branch of the Ramakrishna Mission founded on 29 January 1938 as an outcome of the commemoration of Sri Ramakrishna's Birth Centenary Celebrations, the institute has grown over the years, and is now situated on its present magnificent premises at Gol Park in Kolkata.\nThe institute is well known for its philanthropic, educational and cultural activities all over the world. Based on the philosophy of the unity of human life, the institute endeavours to make people aware of the richness of different cultures all over the world and also of the need for intercultural appreciation and understanding.\nAbout the institute\nThe Ramakrishna Mission Institute of Culture, a branch of the Ramakrishna Mission (founded by Swami Vivekananda), started functioning in 1938. The institute has grown over the years, and the fact that it is now housed at its present magnificent building (completed in 1960) in south Kolkata is a testimony to its popularity.\nInstitutes\nThe institute has a number of departments including a School of Languages; a large library; a museum; the Vivekananda Archives, Shrine and Meditation Hall; a Publication Department; and a Centre for Indological Studies and Research. The institute has a busy schedule of lectures, seminars, symposia, scripture classes, study circles, elocution competitions and other religious and cultural programmes. Attached to the institute is an International Scholars' House. It is meant for the guests of the institute, scholars and students who come from different parts of India and from abroad at the invitation of the Institute or of the universities and other learned societies for study, research or simply for the exchange of ideas with Indian scholars. This bringing together of scholars of different nationalities and backgrounds helps to create a bridge that unites minds and spirits.\nVivekananda Study Circle\nA forum for dissemination and popularization of science has been set up by the institute, called Vivekananda Study Circle. It is planned that the Circle will meet once in a month where distinguished scientists will initiate discussions on various scientific issues. The issues are further understood through interaction between the speaker and the audience.\nPlans are afoot to set up non-lab-based research, organizing seminars/colloquia, spreading general awareness about health and hygiene (etc.) among people in nearby areas and collaborating with scientific organizations of repute for furtherance of other objectives.\nVivekananda Study Circle (Junior)\nThis includes the members of the Children's Library, located at the centre. Monthly programs are held by the members of the junior study circle, based on some particular topic(s) which changes every month. Along with the monthly programs, the members also participate in other programs that takes place on special occasions like Independence Day and Republic Day (26 January). An annual function is held by this study circle named, \"Banikumar's Mahisasuramardini\", which usually takes place a day before or after the Mahalaya, along with an annual prize distribution ceremony of the recitation and drawing competitions.\nSee also\n*Ramakrishna Mission\nReferences\nExternal links\n*[http://www.sriramakrishna.org RMIC Website]\n*[http://www.belurmath.org Official Website of The Headquarters of Ramakrishna Math and Ramakrishna Mission (Belur Math)]\n*[http://www.vedantany.org/headquarters About Ramakrishna Math and Ramakrishna Mission]"
    }
  ]
}