{
  "content": [
    {
      "type": "text",
      "text": "# Rameswarpur\n\n}}\n| subdivision_type        = Country\n| subdivision_name        =\n| subdivision_type1       = State\n| subdivision_name1       = Odisha\n| subdivision_type2       = District\n| subdivision_name2       = Bhadrak\n| established_title       =\n| established_date        =\n| founder                 =\n| named_for               =\n| government_type         =\n| governing_body          =\n| unit_pref               = Metric\n| area_footnotes          =\n| area_rank               =\n| area_total_km2          =\n| elevation_footnotes     =\n| elevation_m             =\n| population_total        =\n| population_as_of        =\n| population_rank         =\n| population_density_km2  = auto\n| population_demonym      =\n| population_footnotes    =\n| demographics_type1      = Languages\n| demographics1_title1    = Official\n| demographics1_info1     = Oriya\n| timezone1               = IST\n| utc_offset1             = +5:30\n| postal_code_type        =\n| postal_code             =\n| registration_plate      = OR-\n| blank1_name_sec1        = Nearest city\n| blank1_info_sec1        = Bhadrak\n| website                 =\n| footnotes               =\n}}\nRameswarpur is a village near Dhamnagar in Bhadrak district of Odisha, India. This settlement was initiated about four centuries ago during the reign of Mughal Emperor Akbar by the Bengali \"Ghosh Mahashays\" who migrated from Kotrung, West Bengal to permanently settle down here, having come as a part of the contingent of Todarmal during his famed survey of India.\nThis small village also boasts of conducting the oldest Durga Puja on record at the same venue  anywhere in the world, which continues from the first of the Mahashays. Before the concept of Sarvajanin Durga Puja started, it was being conducted by princely houses and the first such Puja being conducted anywhere in the world at the same venue and continuing till date is in Orissa. It is at Rameswarpur in Bhadrak district of the state, where it was started about four centuries ago by the Bengali Mahashay family (Roy family) who migrated in from Kotrung ( present-day Uttarpara Kotrung )  situated in the Hooghly district of West Bengal as a part of Todarmal's famous survey with Shri Chaitanya Dev of India during Emperor Akbar's rule. Rameswarpur is in the banks of River Genguti.\nRameswarpur holds the record of performing the oldest Durga Puja in the World. The Mahashays, who were benevolent Zamindars, gradually lost hold of the land they once owned, still continue the Puja as a part of their centuries old tradition. The family direct bloodline relates to the Luminaries like the Bengali poet and essayist Annada Shankar Ray whose father incidentally had shifted base to Dhenkanal, also in Orissa following a family feud. The Mahashays were famous for benevolent activities.\nThe Village also conducts the \"Raksha Kali\" Puja ( a very common Puja in Bengali households ) which was initially conducted by the Mahashay family but later converted to \"Sarbajanin\" by handing over to the villagers as a very large number of animal sacrifices were started by the surrounding villagers during the Puja, which did not go well with the Roy family. The 500-year-old Durga Puja of the Mahashays is still being organised by the Roy family.\nThe Village has a healthy mix of population of all castes and is generally peaceful.\nReferences\nExternal links"
    }
  ]
}