{
  "content": [
    {
      "type": "text",
      "text": "# Ranma ½: Hard Battle\n\n| composer = Toshio Okamoto\n| designer =\n| released=\n| genre = Versus fighting\n| modes = Single-player, multiplayer\n| platforms = Super NES\n}}\nRanma ½: Hard Battle, known as  in Japan and as just Ranma ½ in Europe, is a 2-D fighting video game released by Masaya and DTMC for the Super Nintendo Entertainment System. It is based on the manga and anime series Ranma ½. Hard Battle is the second Ranma ½ game to be translated into English, this time keeping the original graphics, music, and names of the characters, though the voices were still dubbed into English.  The game's English translation (but not its English voice acting) was provided by Viz Media (who had begun releasing the English dub of Ranma 1/2 earlier that same year).\nGameplay\nand Ukyo Kuonji.]]\nHard Battle has three modes of play: the standard one-player tournament mode, a two-player competitive mode, and a two-player five-character team challenge mode. There are ten characters in the game (twelve if Ranma and Pantyhose Taro's cursed forms are counted). All twelve characters are available for the two-player modes. After completing tournament mode, Pantyhose becomes a playable tournament character. Happosai is unlockable by entering a code.\nThe control is simpler than most other fighting games. Each of the SNES controller's buttons (plus the up arrow) can be assigned to activate one of four moves: jump, block, normal attack, and power attack. Different normal and power attacks can be triggered depending on a variety of factors, such as how far the attacker is from the opponent, if they are ducking, or if a directional arrow is pressed along with the attack button.\nInstead of entering a series of directional movements and pressing an attack button to activate a special attack, most moves are done by holding the left, right, or down arrow in conjunction with an attack button for a few seconds and then releasing the attack button. The longer the attack button is held, the stronger the attack will be. For instance, one of Ryoga's special attacks is the bandana throw. If held for several seconds, he throws three bandanas instead of one. Many moves can also be executed while holding the block button.\nAnother feature of Hard Battle is the ability to recover from throws. By pressing an attack button after being thrown, the character can attempt to land on his or her feet and take less damage. Unlike many fighting games, opponents never get stunned after being hit with powerful attacks or a combo.\nEach character has his or her own story. In any case, the character is manipulated into fighting the other characters by Principal Kuno.\nReception\n|issue=18|publisher=|date=March 1993|pages=130–131|language=fr}}\n|CVG = 81/100\n|EGM = 7/10, 8/10, 7/10,8/10, 8/10\n|Fam = 6/10, 6/10, 5/10, 5/10\n|GameFan = 341/400\n|GMaster = 78%\n|HC = 88/100\n|JP = 84%\n|PO = 84%\n|SJ = 93/100\n|TOT = 68/100\n|VGS = 40%\n|rev1 = Super Action\n|rev1Score = 84%\n|rev2 = Super Pro\n|rev2Score = 68/100\n|rev3 = The Super Famicom\n|rev3Score = 72/100\n|rev4 = VideoGame\n|rev4Score = 9/10\n|award1Pub = Super Famicom Magazine (1993)\n|award1 = Best 30 by Game Report Card Division, Character 13th\n}}\nRanma ½: Hard Battle garnered generally favorable reviews from critics. A reviewer in Nintendo Power complimented on the characters and the unique team mode in the game, while finding the game offered little new to the genre.\nReaders of Super Famicom Magazine voted to give the game a 23.13 out of 30 score, ranking among Super Famicom games at the number 41 spot in a 1993 public poll, and received an award in the character category. According to Famitsu and the Nikkei Marketing Journal, the title sold over 49,698 copies in its first week on the market due to the fighting game boom and popularity of its characters, selling out at many stores within the year. It sold approximately between 205,569 and 320,000 copies during its lifetime in Japan.\nRetrospective reviews for Ranma ½: Hard Battle have been more mixed. It remains popular more than 25 years since its release and has been featured in competitive play at fighting game tournaments as a side event such as Evo Japan 2018.\nSee also\n*List of Ranma ½ video games\nNotes\nReferences\nExternal links\n*[http://cheats.ign.com/objects/008/008200.html Ranma 1/2: Hard Battle] IGN entry\n*[http://www.mbohbot.com Michel Bohbot Illustration]"
    }
  ]
}