{
  "content": [
    {
      "type": "text",
      "text": "# Raoul de Warren\n\nRaoul de Warren (born 5 September 1905 in Lyon - d. 5 March 1992 in Paris) was a French writer, historian, genealogist and lawyer.\nHe was the President of the Evidence Commission for the ''Association d'entraide de la noblesse française (Mutual Aid Association of the French nobility)''.\nFamily\nRaoul de Warren's father, William de Warren, was a descendant of a Jacobite family that moved to Nancy in 1692, after the deposition of king James II of England.\nHis mother, Marie Seguin, was the granddaughter of Marc Seguin, a member of the Institut de France, builder of the first steamship in France, inventor of boilers, railroads and suspension bridges.\nRaoul de Warren married Marie de Montrichard.\nCareer\nRaoul de Warren obtained a Bachelor of Arts degree in history and geography, and became a Doctor of Law, specializing in agricultural issues.\nHis honors thesis, Ireland and its political institutions (1928) won an award from the Institut de France.\nHowever, the Irish minister in Paris did not consider the thesis of any great value.\nHis first work of fiction was  a short psychological drama published in 1926, while he was studying at Nancy. In 1934 he published a new novel entitled Un jour comme tous les autres (A day like any other) developing the theme of premonition.\nRaoul de Warren has been recognized as a leading authority on the French nobility.\nHe became Secretary General of the Federation of French Heraldry and Genealogy.\nThe Genealogy Society of Loir-et-Cher was created in 1966 by Raoul de Warren and Michael de Sachy. It is the oldest genealogical society in France, after Paris.\nReception\nThe Romanian poet and novelist Jean Parvulesco has described de Warren's works of fiction as inspiring and \"mediumistic\".\nA review of his novel ''L'insolite aventure de Marina Sloty'', which involves time travel and romance, describes the novel as \"a true success\" and \"excellent\".\n}}"
    }
  ]
}