{
  "content": [
    {
      "type": "text",
      "text": "# Rape during the Syrian civil war__disambig_1\n\nRape during the Syrian civil war was used as a strategy throughout the Syrian conflict by pro government supporters, members of the Free Syrian Army, and militants fighting for the Islamic State of Iraq and the Levant. According to the International Rescue Committee (IRC) rape has been a \"significant and disturbing feature\" during the conflict, and the primary reason given for 600,000 women fleeing the war zone is fear of sexual assault. For the background and legal content use the prosecution of Syrian civil war criminals. Human Rights Watch have requested that the United Nations Security Council refer Syria to the International Criminal Court.\nSyrian state forces\nFollowing the onset of the Arab spring, which had spread to Syria in 2011, reports of rape by pro-government forces increased. In Daraa, at the onset of the conflict state forces organized the rape of women in the region.\nIn Syria women who are raped can become victims of honour killings, or if allowed by their families to live are no longer eligible for marriage. When the state forces began their crackdown on protesters in Jisr al-Shugour a tactic used was raiding homes in which women were sleeping. A report released by Save the Children in 2013 stated, \"There is proof that girls and boys scarcely over the age of 12 have experienced sexual violence, including both torture to their genitals and rape.\" Sarah Leah, the director for the Middle East branch of HRW has said that, \"Syrian security forces have used sexual violence… with complete impunity\".\nA UN report published in 2015 stated:\nWomen and girls were found to have been raped and sexually assaulted in government detention facilities, in particular in the investigation branches of the Military Intelligence Directorate and prisons administered by the General Security Directorate in Damascus. State officials have perpetrated rape, a crime against humanity. ...  Victim and witness accounts of sexual violence were also recorded in northern governorates. During house searches in Aleppo city in 2012 and 2013, Government forces sexually assaulted women and men in their homes. In 2013, detainees were raped in the Political Security branch and sexual assaulted at the Military Security branch in Latakia. Many women and men, including minors, have been victims of the deliberate use of sexual humiliation, sexual torture and rape while in the custody of Government authorities throughout the span of the unrest and conflict in Syria (from 2011 – 2014).\nISIS\nDuring the Yazidis genocide, ISIS sold women into sexual slavery and raped girls as young as nine. Amar Hussein, a captured IS terrorist who has admitted to raping over 200 women, stated that those in command had given free rein to IS fighters to rape as many Yazidi women as they wanted.\nA pamphlet published online by ISIS on the social media platform Twitter explicitly endorsed the rape of children; it reads: \"It is permissible to have intercourse with the female slave who hasn't reached puberty, if she is fit for intercourse\".\nInternational reactions\nIn 2012 in a declaration by the UN stated that in Syria rape was being used as a weapon of war, however the help being given to victims was \"sorely lacking\", and that \"Hospitals and clinics are not equipped to deal with the sheer volume of victims, and many victims do not report their attacks\"\nThe NGO Euro-Mediterranean Human Rights Network (EMHRN) released a report in November 2013 stated that, since the conflict began in 2011, approximately 6,000 women had been raped, which included gang-rapes, with figures likely to be far higher given that the majority cases go unreported. According to the EMHRN report the majority of documented attacks have occurred during government-backed attacks on rebel positions, on those kept in detention and at checkpoints.\nSpeaking at the UN in 2012, Norwegian Foreign Minister Espen Barth Eide stated that the rapes which occurred during the Bosnian war were being repeated in Syria, with rapes in the tens of thousands.\nDuring the first 11 months of 2013 the UN Population Fund (UNFPA) released figures which showed that it had given psychological help to 33,430 people in Syria who had been victims of either rape or gender based violence, with a further 4,800 cases reported in December 2013. Jody Williams of the International Campaign to Stop Rape & Gender Violence in Conflict has said of the sexual violence being visited on the men, women and children of Syria, \"With every war and major conflict, as an international community we say 'never again' to mass rape, Yet, in Syria, as countless women are again finding the war waged on their bodies--we are again standing by and wringing our hands.\"\nReferences\nBibliography\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*"
    }
  ]
}