{
  "content": [
    {
      "type": "text",
      "text": "# Rapoport-Bick (rabbinic dynasty)\n\nThe Rapoport-Bick dynasty was the most important of all the non-chasidic rabbinic dynasties of Medzhybizh, in Ukraine. The Rapoport dynasty traces its roots back to Rabbi Jacob Emden (1697–1776) who was involved in the Frankist debates of 1757 and his father Rabbi Tsvi Hirsh Ashkenazi, known as the Chacham Tsvi (1660–1718). The Rapoports themselves are a long distinguished rabbinic family that traces its roots back to Central Europe and Northern Italy in the 15th century.\nHere is a pedigree chart of the Rapoport lineage:\n::*R. Yakov Moshe Kohen Rapa (15th century)\n::*R. Abraham Menakhem Kohen Rapa\n::*R. Gershon Kohen Rapa (b. 1538), Porto, Italy\n::*R. Simcha Katz Rapa\n::*R. Moses Jeremiah Katz Rapoport, rabbi in Vienna\n::*R. Meir haKohen Rapoport (d. 1600), rabbi in Belz\n::*R. Nakhman Rapoport (d. 1674), rabbi in Kamenets-Podolsky, Poznań, Dubno\n::*R. Simkha haKohen Rapoport (d. 1717)\n::*R. Khaim haKohen Rapoport (d. 1771), rabbi in Lviv\n::*R. Arieh Leib Rapoport (d. 1759), rabbi in Prezwork\n::*R. Dov Berish Rapoport (d. 1823), rabbi in Medzhybizh, married into the Emden family\n::*Rapoport-Bick (rabbinic dynasty)\nRabbi Chaim Yekhiel Mikhel Bick (1887-1964), seated, surrounded by his family in 1926. He was the last rabbi of any type to practice in Medzhybizh. Standing to the right of him is his son Moshe Tsvi who also became a rabbi.\nThe first Rapoport rabbi to make his home in Medzhybizh was Rabbi Dov Berish Rapoport (d. 1823). He was the grandson of Rabbi Khaim haCohen Rapoport of Lvov (d. 1771), who was also involved in the Frankist debates. Rabbi Dov Berish became the head of the Jewish court (Av Beit Din) and spiritual leader of the entire Jewish community of Medzhybizh. However, in a dispute with Rabbi Moshe Khaim Ephraim, the Baal Shem Tov's grandson, around the year 1800, the non-Chasidic and the Chasidic communities separated into two groups. The Rapoport-Bick family continued to control the town's Jewish court. The Chasidic community at the time chose Rabbi Issachar Dov-Ber Landa to represent them in official matters. Both Rabbis Rapoport and Landa are buried side by side in the Medzhybizh Jewish Cemetery, just a few steps away from the Baal Shem Tov's grave.\nThe Bick family were responsible for the official religious \"business\" of the community, such as relations with the Russian authorities and kashrut rulings. They were based out of R. Joel Sirkes' synagogue in Medzhybizh - the town shul. The name, BICK, is an acronym in Hebrew for \"Defender of the Faith.\"  Other members of the family included R. Isaac Bick who was the head of the Beit Din in Medzhybizh until 1902 when he left for Rhode Island by way of Hester St. in NY City. His two eldest sons also became rabbis, Shoul (Shaul) in Brooklyn, and Haym (Herman)in Massachusetts. There are still rabbis of the Bick family today who have congregations in Brooklyn and in Israel.\nThe last rabbi of any type to live in Medzhybizh was Rabbi Chaim Yechiel Mikhl Bick (1887–1964). He left in 1925 for New York. (This excludes any rabbis who may have been deported to the Medzhybizh ghetto during World War II, of which no specific records survive.)\nLineage of dynasty\n*R. Dov Berish Rapoport (?-1823) - Married to Miriam Emden of the Emden rabbinic family. Grandson of R. Khaim haCohen Rapoport of Lvov. Leader of the Medzhybizh community until about 1800 when the official leadership split between Chasidic and non-Chasidic groups. Was Leader of the Court until 1803. Buried in the Medzhibozh Jewish Cemetery.\n**R. Tsvi Arieh Rapoport (?-1840) - Married to Faige (Hinde). Head of the Jewish Court in Medzhybizh from 1803 until his death in 1840. Buried in Medzhybizh.\n***Pesia Rapoport  = R. Saul Issachar Berish Bick (1786–1854) - Head of the Jewish Court from 1840 until his death in 1854. Buried in Medzhibozh.\n****R. Simkha Bick (1828–1896) - Head of the Jewish Court 1863–1868.\n*****R. Isaac Bick (1864–1932) - Head of the Jewish Court ending in 1902. Perhaps one of the most renown and beloved of all the Bicks. Born in Medzhybizh, in 1905 he was elected a member of the Russian Duma representing the entire district. He immigrated to the U.S. in 1922 just ahead of his cousin (R. Khaim Yekhiel Mikhl Bick) and was one of the last rabbis of any type to live in Medzhibozh. Beis Yakov congregation in Providence, RI, brought him over from the Netherlands with some of his family by way of New York City.\n****R. Tsvi Aryeh Bick (?-1878) - Married to Fumet Margolioth. Head of the Medzhybizh Jewish Court 1868–1878. Buried in Medzhybizh.\n*****R. Khaim Yekhiel Mikhel Bick (1863–1887) - Married to Henya Yuta (Anita) Pregerson.   Head of the Jewish Court at the time of his death. Wife was pregnant at his untimely death.\n******R. Khaim Yekhiel Mikhel Bick II (1887–1964) - Married to Miriam Gurvits. Was the last Av Beit Din of Medzhybizh, serving from 1911 to 1925. Was the last rabbi of any type to serve in an official capacity living in Medzhybizh (not counting any rabbis deported into the Medzhybizh ghetto during World War II). Immigrated to New York in 1925.\n*******R. Moshe Tsvi Aryeh Bick (1911–1990) - carried on the dynasty in New York. Was known to be one of the great poskim (decisors of halacha) of the 20th century.\n********R. Shaul Bick (1933-2015)\n********R. Avraham Yehoshua Bick (1937-) - current Medzhibozher Rov, Bnei Moshe Medzhibozh Congregation, Brooklyn, New York.\n********Rebbitzin Chana Spiegel (1938-) famous mechaneches - Wife of Grand Rabbi Yakov Yitzchok Spiegel Ostrover Kalishiner Rebbe.\n********Rebbetzin Friedman - Wife of Rabbi Chaim Elozor Friedman, Tenke Rov of Boro Park, Cong. B'nei Usher, Brooklyn New York.\n*********R. Dovid Bick  (1972-)\n*******Yeshayah Bick\n********R. Ezra Aharon Bick (1950 -), grandson of R. Khaim Yekhiel Mikhel Bick. Rav at Yeshivat Har Etzion, Alon Shevut, Israel.\nBibliography\nChapin, David A. and Weinstock, Ben, The Road from Letichev: The history and culture of a forgotten Jewish community in Eastern Europe, Volume 1.  iUniverse, Lincoln, NE, 2000.\nReferences"
    }
  ]
}