{
  "content": [
    {
      "type": "text",
      "text": "# Rathdowney, Queensland\n\n| pop                      = 320\n| pop_year                 =\n| pop_footnotes            =\n| established              =\n| postcode                 = 4287\n| area                     = 72.2\n| timezone                 = AEST\n| utc                      = +10:00\n| dist1                    = 31.3\n| dir1                     = SW\n| location1                = Beaudesert\n| dist2                    = 42.2\n| dir2                     = SE\n| location2                = Boonah\n| dist3                    = 113\n| dir3                     = SSW\n| location3                = Brisbane CBD\n| dist4                    =\n| dir4                     =\n| location4                =\n| lga                      = Scenic Rim Region\n| stategov                 = Scenic Rim\n| fedgov                   = Wright\n| near-n                   = Knapp Creek\n| near-ne                  = Tamrookum Creek\n| near-e                   = Innisplain\n| near-se                  = Running Creek\n| near-s                   = Palen Creek\n| near-sw                  = Barney View\n| near-w                   = Maroon\n| near-nw                  = Maroon\n}}\nRathdowney (historically also written as Rathdownie) is a rural town and locality in the Scenic Rim Region, Queensland, Australia. In the , the locality of Rathdowney had a population of 320 people.\nGeography\nRathdowney is on the Mount Lindesay Highway  south of Beaudesert at the base of the McPherson Range.\nThe eastern boundary is marked by the Logan River. It is also close to some of the areas of greatest biodiversity in Australia, and a gateway to various National Parks such as Border Ranges National Park and Mount Barney National Park with a variety of lush rainforest, eucalypt forest, mountain heath and other habitats.\nThe former locality of Bigriggan (also spelled Bigriggen) is within Rathdowney,  west of the town (). It is accessed via Bigriggan Road which terminates at the Bigriggan Reserve Park, located near the confluence of Burnett Creek and the Logan River. The park provides camp sites with a kiosk by the river with access available to caravans, motorhomes and buses.\nHistory\nMununjali (also known as Mananjahli, Manaldjahli and Manandjali) is a dialect of the Yugambeh language. The Mununjali language area includes landscape within the local government boundaries of the Scenic Rim and Beaudesert Shire Councils.\nThe first European exploration of the area was by Patrick Logan, commandant of the Moreton Bay penal colony, in 1828. The area became available for settlement in 1842. Thomas Lodge Murray-Prior purchased a large freehold estate in 1876, which he named Rathdowney Station after the Murray-Prior estates in Rathdowney, Ireland.\nThe town was named after the former Rathdowney pastoral station.\nTimber clearing was the first major industry in the area.  Cattle grazing and dairy farming are now the main industries.\nBigriggan Provisional School  opened in November 1892. There were a number of temporary closures due to low student numbers before it closed in 1906. It re-opened in 1910 as Bigriggan State School but closed permanently on 25 April 1912.\nRathdownie Provisional School opened on 10 February 1908. On 1 January 1909 it became Rathdownie State School.  In 1914 the name was changed to Cashell's Hill State School. It closed in 1924.\nEnright's General Store opened in 1909. It operated until 1971. It is commemorated by a plaque. train at Rathdowney in 1912]]The Beaudesert Shire Tramway was extended to Rathdowney in 1911, but closed in 1944.\nRathdowney Terminus State School opened on 14 May 1912; the school's name presumably refers to the terminus of the tramway. In 1915 it was renamed Rathdowney State School.\nIn April 1928, 116 subdivided allotments of \"Telemon Estate, Beaudesert\" were auctioned by Isles, Love & Co. and in conjunction with M. Selwyn Smith & Son Auctioneers. 25 dairy and agricultural farms, 72 township allotments and 19 farmlets from the estate of Chris J. Collins were available. According to the map advertising the auction, the estate was 17 miles from Beaudesert and 64 miles from Brisbane.\nThe foundations for St David's Anglican Church were laid on Saturday 9 March 1929. The church was opened and dedicated on Saturday 13 July 1929 by Bishop Henry Le Fanu.\nSt Joseph's Catholic Church was opened on 29 September 1929 by Archbishop James Duhig. Prior to this, Catholic services were held in the Rathdowney Memorial Hall and the Rathdowney School of Arts.\nIn 1957, Palen Creek Methodist Church was relocated to 39 Running Creek Road () in Rathdowney. In the 1970s, it was further extended with the Glenapp hall and the Barney View Lutheran Church. When the Methodist Church became part of the Uniting Church in Australia in 1977, it became the Palen Creek Uniting Church. It held its last service on Sunday 23 February 2014. It is now in private ownership.\nDemographics\nIn the , Rathdowney had a population of 434.\nIn the , Rathdowney had a population of 308 people.\nIn the , the locality of Rathdowney had a population of 320 people.\nHeritage listings\nRathdowney has the following heritage-listed sites:\n* St David's Anglican Church, 8-12 Hardgrave Street and 14-18 Prior Street\n* St Joseph's Catholic Church, 157-159 Mount Lindesay Highway\nEducation\nRathdowney State School is a government primary (Prep-6) school for boys and girls at 143-155 Mount Lindesay Highway (). In 2017, the school had an enrolment of 39 students with 7 teachers (3 full-time equivalent) and 5 non-teaching staff (3 full-time equivalent).\nThere are no secondary schools in Rathdowney. The nearest government secondary schools are Boonah State High School in Boonah to the north-west and Beaudesert State High School in Beaudesert to the north-east.\nAmenities\nCurrently the small town has a police station, a small shop, a pub, a service station, a post office, memorial grounds, information centre, and a bowls club.\nThe Scenic Rim Regional Council operates a mobile library service which visits Collins Street.\nSt David's Anglican Church is at 8-12 Hardgrave Street ().\nSt Joseph's Catholic Church is at 157-159 Mount Lindesay Highway ().\nAttractions\nThere are many tours, farm stays, guest houses and other opportunities available for visitors to experience this region, which is about a 90-minute drive from Brisbane or the Gold Coast. In Autumn every year the population rises by several thousand for one day at the Rathdowney Heritage Festival, organised by the Rathdowney and District Historical Association (RADHA).\nThe RADHA also operate the Rathdowney Information Centre and Historical Museum at 82 Mount Lindesay Highway (). The centre presents information on natural heritage, indigenous heritage and history of white settlement from the time of the first pioneers to present day. The Glenapp railway siding was relocated to the museum.\nSee also\n* Boonah, Queensland\n* List of tramways in Queensland\nReferences\nExternal links"
    }
  ]
}