{
  "content": [
    {
      "type": "text",
      "text": "# Ratu Ratu Queens: The Series\n\nor  -->\n| genre                = Comedy drama\n| creator              = Lucky Kuswandi\n| showrunner           = Muhammad Zaidy\n| based_on             =\n| inspired_by          =\n| developer            =\n| writer               = Andri Cung\n| screenplay           =\n| story                =\n| director             = Lucky Kuswandi\n| creative_director    =\n| starring             =\n| voices               =\n| narrated             =\n| theme_music_composer =\n| open_theme            =\n| end_theme             =\n| composer             =\n| country              = Indonesia\n| language             =\n| num_seasons          = 1\n| num_episodes         = 6\n| list_episodes        =\n| executive_producer   =\n| producer             =\n| location             = New York City, U.S.\n| cinematography       = Gunnar Nimpuno\n| animator             =\n| editor               = Ahmad Yuniardi\n| camera               =\n| runtime              = 37–51 minutes\n| company              = Palari Films\n| network              = Netflix\n| first_aired          =\n| last_aired           =\n| related              =\n}}\nRatu Ratu Queens: The Series () is an Indonesian comedy drama television series and a prequel to the 2021 film Ali & Ratu Ratu Queens. The series is based on characters created by Gina S. Noer and Muhammad Zaidy. Nirina Zubir, Happy Salma, Tika Panggabean, and Asri Welas reprised their roles from the film as Party, Chinta, Ance, and Biyah, respectively.\nIt premiered on Netflix on 12 September 2025.\nPremise\nRatu Ratu Queens: The Series serves as the prequel to the 2021 film Ali & Ratu Ratu Queens. It follows the lives of four Indonesian immigrants as they form a friendship and navigate life in New York City.\nCast and characters\nMain cast\n*Nirina Zubir as Party, a waitress and the breadwinner of her family, who is seeking roommates to share her apartment in Queens.\n*Happy Salma as Chinta, a socialite married to a foreigner. Party works part time as a cleaner in her house.\n*Tika Panggabean as Ance, a helicopter single mother raising her teenage daughter, Eva.\n*Asri Welas as Biyah, a costumed street busker on the run from a loan shark.\n*Luna Allegra Kurtz as Eva, Ance's teenage daughter who is still struggling to process the grief of her father's death. Aurora Ribero plays the older version of Eva in the 2021 film.\nRecurring cast\n*Michael Notardonato as Luca, a chef and Party's love interest.\n*Yoshi Sudarso as Bisma, a fellow member of the Indonesian diaspora and Party's neighbor, who owns an Indonesian restaurant.\n*Aimee Saras as Ambar, a waitress who is Party's rival and has a crush on Luca.\n*Shanty as Tuti Emut, Biyah's former friend who betrays her and later becomes a popular dangdut singer.\n*Bi Jean Ngo as Ahma, Party's landlord who owns a convenience store.\n*Kevin Tan as Black Dragon, a mafia boss to whom Biyah owes money.\n*Edward Lewis French as Ricky, Chinta's husband.\n*Rita Matu Mona as Party's mother who falls ill.\n*Yusuf Mahardika as Juki, Party's younger brother.\nEpisodes\n| ShortSummary    =\n| LineColor       = FFDD72\n}}\n| ShortSummary    =\n| LineColor       = FFDD72\n}}\n| ShortSummary    =\n| LineColor       = FFDD72\n}}\n| ShortSummary    =\n| LineColor       = FFDD72\n}}\n| ShortSummary    =\n| LineColor       = FFDD72\n}}\n| ShortSummary    =\n| LineColor       = FFDD72\n}}\n}}\nProduction\nProducer Muhammad Zaidy revealed that the idea of a series focusing on the lives of the four characters was conceived in 2015, prior to the 2021 film. In August 2024, it was reported that the prequel series of the 2021 film Ali & Ratu Ratu Queens had been in production, with Lucky Kuswandi returned to direct. It was then announced as part of Netflix's Southeast Asian slate in February 2025.\nPrincipal photography took place in New York City and Jakarta for fifty-one days. It had wrapped in September 2024.\nRelease\nRatu Ratu Queens: The Series premiered on Netflix on 12 September 2025.\nReferences\nExternal links\n*"
    }
  ]
}