{
  "content": [
    {
      "type": "text",
      "text": "# Rave Republic\n\n}}\nRave Republic is a DJ duo, based out of Singapore. They are currently ranked number 92 on DJ Mags Top 100 DJs. Rave Republic are best known for their pop-EDM crossover productions which have topped charts across the region. They are also known for performing on the main stage at major festivals such as Ultra Singapore and Electric Daisy Carnival, China. Rave Republic was signed to Warner Music Singapore and have released records on most major mainstream and electronic labels.\nEarly life\nRave Republic, who were proudly founded in Singapore, consist of two members: originally Swiss and Australian. The Australian was a brand manager for Procter & Gamble; a company which he later left to pursue his biggest passion of music. He is also an aspiring actor who landed a role in the Singapore box office smash, Ah Boys to Men 3.\nIn 2017, the duo signed to the UK-based Active Talent Agency.\nMusical career\nAfter two relatively successful solo careers, Mathias & Stas formed Rave Republic in February 2014. The two musicians met by doing their DJ sets after each other in local Singapore nightclubs and finding out they have excellent chemistry together. Their ambition was to create a \"festival atmosphere inside a nightclub\". They quickly gained residencies at top clubs around the region including in Singapore, Hong Kong, Japan, Philippines, Taiwan, and Malaysia. They DJed the main stage at multiple festivals including It's the Ship and Ultra Singapore.\nTheir December, 2015 debut single, 'Far Away' was released under Warner Music Singapore and reached #1 on the iTunes Dance Chart. Their follow-up single, 'Shoot for the Moon' went to #3 on the iTunes overall chart and #1 on the dance chart. It also featured on Spotify's Viral Top 50 playlist.\nTheir debut EP, 'Rule it All' launched in September, 2016 and debuted at #2 on the iTunes overall album chart and #1 on the dance chart. It features collaborations with multiple contestants from The Voice (US & UK) as well as remixes from producers from three different continents.\nIn 2017, the team released 'Leave My Mind' alongside the ex-child star, Ming Bridges, and Fulses. The track charted in 8 countries on iTunes and reached #2 on Singapore's Spotify Viral Top 5.\nRave Republic released their collaboration with Dutch duo, Syzz, titled 'Fall Into My Love' in March 2018. The track featured the 2-time Grammy nominated, platinum songwriter, TyteWriter and graced 8 Top 50 charts in the world and played on radio stations in as many countries.\nThe duo teamed up with Luciana to release their dance-pop single 'In My City' in October, 2018 and realised success with over 1 million streams on Spotify.\nJeffrey Sutorius, the former front man for Dash Berlin debuted his collaboration with Rave Republic at Ultra Music Festival. The vocalist was revealed to be the Emmy-winner Matluck on 'Middle of the Night'. This track was signed to Warner Music and released in May, 2019.\nIn 2021, they teamed up with UK producer Olly James to create 'Rave is our Religion', and made their debut on W&W's Rave Culture label.\nThey have also collaborated with stars including Timmy Trumpet, DJ Jean and Twista.\nAwards\n* 2018 - Ranked 98th in the DJ Mag Top 100 DJs\n* 2019 - Ranked 94th in the DJ Mag Top 100 DJs\n* 2020 - Ranked 81st in the DJ Mag Top 100 DJs\n* 2021 - Ranked 86th in the DJ Mag Top 100 DJs\n* 2022 - Ranked 94th in the DJ Mag Top 100 DJs\n* 2023 - Ranked 92nd in the DJ Mag Top 100 DJs\nDiscography\nSingles\n* 2016: Rave Republic - Shoot for the Moon (feat. The Madison Letter)\n* 2017: Rave Republic & Fulses - Leave My Mind (feat. Ming Bridges)\n* 2018: Rave Republic & Kazden- Aurora\n* 2018: Rave Republic & Syzz - Fall Into My Love\n* 2018: Rave Republic & Luciana Caporaso - In My City\n* 2019: Rave Republic - Heartbreaker\n* 2019: Rave Republic - Beijing\n* 2019: Rave Republic & Jeffrey Sutorius - Middle Of The Night\n* 2019: Rave Republic - Drop It\n* 2019: Rave Republic & Justin Prime - Old School (feat. Lee McKing)\n* 2020: Rave Republic & Tim Morrison - Free Fall\n* 2020: Rave Republic, Gian Varela & Fagin - Don't Leave Me Alone\n* 2020: Rave Republic & Reggio - Deep Love\n* 2020: Rave Republic & Sixth Sense - Love On Fire\n* 2020: Rave Republic & Sammy Boyle - Pineapple Pizza\n* 2021: Rave Republic & Olly James - Rave Is Our Religion\n* 2021: Rave Republic & Chester Young - City Life\n* 2021: Rave Republic & Reggio - Legacy\n* 2021: Rave Republic & Chester Young - Get out of My Head\n* 2021: Rave Republic, Sixth Sense & Jone Fields - Only You (feat. Jonny Rose)\n* 2021: Rave Republic, Fablers & Kevin Krissen - Can I Be The One (feat. Matt Weiss)\n* 2022: Rave Republic, Justin Prime & EMKR - Missing You\n* 2022: Rave Republic & GIFTBACK - Eyes Wide Shut\n* 2022: Rave Republic, Bonka & Maikki - Brakes On\n* 2022: Rave Republic & TBR - D.N.A.\nReferences"
    }
  ]
}