{
  "content": [
    {
      "type": "text",
      "text": "# Ravi Jayewardene\n\n|birth_place = Colombo, British Ceylon\n|death_date =\n|death_place = Colombo, Sri Lanka\n|placeofburial=\n|placeofburial_label= Place of burial\n|image=\n|caption=\n|nickname=Ravi\n| allegiance  = Ceylon\n| branch      =Ceylon Army\n| serviceyears= 1956-1966\n| rank        =Captain\n| commands    =\n| unit        =Ceylon Light Infantry\n| battles     =1958 Riots\n| awards      =\n| laterwork=National Security Adviser\n}}\nCaptain Ravindra \"Ravi\" Vimal Jayewardene (22 April 1936 &ndash; 2 April 2017) was a Sri Lankan aviator and sports shooter. He was the son of President J. R. Jayewardene and served as the National Security Adviser in his father's administration.\nEarly life\nThe only child of J. R. Jayewardene and Elina Jayewardene, Ravi was educated at S. Thomas' Preparatory School and at Royal College Colombo.\nMilitary service\nAvoiding a political career, he joined George Steuart Group after completing school and thereafter joined the volunteer force of the Ceylon Army and following training at the Volunteer Force Training Centre he was commissioned as a Second Lieutenant in the 2nd (V) Ceylon Light Infantry in 1956. He was mobilized for internal security duties and commanded light infantry troops in Panadura during the 1958 Riots. Having been mobilized regularly, he transferred to a regular commission in 1959, but was sent on compulsory leave following the 1962 attempted coup.\nHe competed in the 50 metre rifle, prone event at the 1964 Summer Olympics. In 1966, he left the army with the rank of Captain.\nAir Ceylon\nHaving gained his pilot license from the Ratmalana Flying School, he joined Air Ceylon thereafter. In April 1971, during the JVP Insurrection he was arrested at the Ratmalana Airport by the police on accusations of giving weapons and jungle warfare training to youth associated with the JVP, but was never charged. Following a heart attack, he left Air Ceylon. Leaving the country shortly thereafter, he spent time as a Buddhist monk in Thailand for three years before migrating to Australia where he worked as a mechanic, even after his father was elected Prime Minister.\nNational Security Adviser\nFollowing the 1983 riots, he returned to Sri Lanka in 1983 and was appointed National Security Adviser. With the escalation of the Sri Lankan Civil War, with concerns over the presidential security, he formed the elite Special Task Force. He assisted Lalith Athulathmudali, Minister of National Security, in the formation of the Sri Lankan Home Guard to defend border villages that were consistently attacked by the LTTE. He stepped down from his post when his father's term in office ended.\nLater life\nJaywardene died on 2 April 2017 after a brief illness, aged 80.\nReferences\nExternal links\n*"
    }
  ]
}