{
  "content": [
    {
      "type": "text",
      "text": "# Ray E. Tenhoff Award\n\nThe Ray E. Tenhoff Award recognizes the most outstanding technical paper presented at the annual Society of Experimental Test Pilots (SETP) Symposium in Los Angeles, California. The award was established in 1962 and is given in memory of Convair test pilot, Ray E. Tenhoff, founder and first president of SETP. Tenhoff was killed in B-58 Hustler accident on April 22, 1960.\nCriteria\nThe award is determined by a panel of judges at the completion of the annual SETP Symposium in Los Angeles, California. The award, consisting of a plaque and cash honorarium, is presented at the annual Awards Banquet.\nRecipients\nRecipients of this award, from 1962 to present, include:\n*1962—Thomas P. Frost\n*1963—Donald R. Segner\n*1964—Glenn M. Gray\n*1965—Drury W. Wood, Jr.\n*1966—Fred W. Haise, Jr.\n*1967—Drury W. Wood, Jr.\n*1968—Olle Klinker and Erik Dahlstrom\n*1969—Larry G. Van Pelt\n*1970—James Pollitt\n*1971—Norm Driscoll\n*1972—Paul S. Norton\n*1973—Flt Lt John Potter, RAF\n*1974—Karl-Eric Henriksson\n*1975—Charles C. Bock, Jr.\n*1976—Lt Col John H. Taylor, USAF\n*1977—Raymond L. McPherson\n*1978—A. Scott Crossfield\n*1979—John E. Krings\n*1980—LCDR Richard N. Richards, USN and Carroll D. Pilcher\n*1981—Maj Ivan M. Behel, USMC and William B. McNamera\n*1982—G. Warren Hall and LTC Robert K. Merrill, USA\n*1983—Charles A. Sewell\n*1984—G. Warren Hall and LTC Patrick M. Morris, USA\n*1985—Stephen Ishmael and Lt Col Ted Wierzbanowski, USAF\n*1986—Lt Col Frank T. Birk\n*1987—William H. Dana and Nicholas D. Lappos\n*1988—Laurence A. Walker and Lt Col William R. Neely, Jr., USAF\n*1989—LCDR Mike Carriker, USN and SqnLdr David Southwood, RAF\n*1990—LCDR Kent Rominger, USN and Jennings Bryant, NATC\n*1991—Capt Chris A. Hadfield, RCAF and Sharon W. Houck\n*1992—C. Gordon Fullerton and Maj Regis Hancock, USAF\n*1993—C. Gordon Fullerton\n*1994—Maj William J. Norton, USAF and Maj Pamela A. Melroy, USAF\n*1995—Capt Ricardo Traven, CAF, Susan E. Whitley and F. Alan Frazier\n*1996—Capt Maurice Girard, CAF and Capt Stuart McIntosh, CAF\n*1997—Capt Greg Weber, USAF and Maj Kevin Christensen, USAF\n*1998—Ricardo Traven, John Hagan\n*1999—Ralph Johnston and Robert Ryan\n*2000—Horst Philipp\n*2001—Maj Tim McDonald, USAF and Steve Barter\n*2002—Ricardo Traven, The Boeing Company\n*2003—Burt Rutan, Doug Shane\n*2004—Bill Gray\n*2005—Norman Howell\n*2006—Maj Douglas Wickert, USAF\n*2007—Justin Paines, QinetiQ; Buddy Denham, Naval Air Systems Command\n*2008—Lt Col Daniel D. Daetz, USAF; Maj Jack D. Fischer, USAF; Brian Knaup, Dept. of the USAF\n*2009—Robert A. Rivers, NASA\n*2010—Flt Lt Dane Petersen, RAAF and Sqn Ldr Darren Hughes, RAAF\n*2011—Sqn Ldr Simon Seymour-Dale, RAF\n*2012—Aaron Tobias, Cessna and Maurice Girard, Cessna\n*2013—Mark Stucky, Clint Nichols, Mike Alsbury, Scaled Composites\n*2014—Maj Casey Richardson, USAF, Capt Michael Pacini, USAF, P. Travis Millet, Dept. of the Air Force\n*2015—Lt Brent Robinson, USN, James Denham, Dept. of the Navy\n*2016—Maurice Girard and Richard Ling, Bombardier Aerospace\n*2017—Lt Col Matt Russell, USAF\n*2018—Col Douglas Wickert, USAF\n*2019 - Evan Thomas, Scaled Composites; Christopher Guarante, Boom Technology; Jake Riley, Scaled Composites\n*2020 - Lt Col Justin Elliott, USAF; Lt Col David Schmitt, USAF\n*2021 - Kelly Latimer, Virgin Galactic, Todd Ericson, Virgin Orbit, Zack Rubin, Virgin Orbit, Bryce Schaefer, Virgin Orbit\n*2022 - Maj Aaron E Okun  and Robert Vitagliano\n*2023 - Andrew Bankston, Bell & Michael Remaly, Boeing & LCDR Gavin Kurey, USN\n*2024 - Kevin Prosser & Nathaniel Rutland, Gulfstream Aerospace\nSee also\n* List of aviation awards\nReferences"
    }
  ]
}