{
  "content": [
    {
      "type": "text",
      "text": "# Ray Stewart (Scottish footballer)\n\n| birth_place = Stanley, Perthshire, Scotland\n| height =\n| position = Defender\n| years1 = 1976–1979\n| clubs1 = Dundee United\n| caps1 = 44\n| goals1 = 5\n| years2 = 1979–1991\n| clubs2 = West Ham United\n| caps2 = 345\n| goals2 = 62\n| years3 = 1991–1992\n| clubs3 = St Johnstone\n| caps3 = 17\n| goals3 = 3\n| years4 = 1994–1995\n| clubs4 = Stirling Albion\n| caps4 = 2\n| goals4 = 0\n| totalcaps = 408\n| totalgoals = 70\n| nationalyears1 = 1981–1987\n| nationalteam1 = Scotland\n| nationalcaps1 = 10\n| nationalgoals1 = 1\n| manageryears1 = 1998–2000\n| managerclubs1 = Livingston\n| manageryears2 = 2000–2002\n| managerclubs2 = Stirling Albion\n| manageryears3 = 2003–2004\n| managerclubs3 = Forfar Athletic\n}}\nRaymond Struan McDonald Stewart (born 7 September 1959) is a Scottish former footballer, who played as a defender for Dundee United, West Ham United, St Johnstone and Stirling Albion. During his career he won the 1980 FA Cup with West Ham and played in 10 full internationals for Scotland. Nicknamed Tonka, Stewart was renowned for his shooting, which meant that he scored 70 league goals during his career (mostly from penalties). After his playing career ended he managed Livingston, Stirling Albion and Forfar Athletic.\nClub career\nDundee United\nStewart was born in Stanley, Perthshire. He played local football with Errol Rovers in the Dundee Sunday Boys' League before joining Dundee United in May 1973, turning down offers from other clubs including Glasgow Rangers. He made his debut days before his 17th birthday against Celtic where, playing as a midfielder, he was tasked with marking Kenny Dalglish. He was voted SPFA Young Player of the Year in 1979.\nWest Ham United\nAfter three seasons with Dundee United he came to the attention of West Ham United. Turning down an initial bid of £175,000 he transferred to West Ham for a fee of £430,000 in 1979 making him the most expensive teenage footballer at the time. Stewart made his West Ham debut on 4 September 1979, playing as a defender, in a League Cup game against Barnsley. His first West Ham goal, a penalty, came on 29 September 1979 in a 2–1 home win against Burnley. In 1980 West Ham won the FA Cup. Stewart was West Ham's top scorer playing a vital part in their victory, including two goals in the fourth round against Leyton Orient and a last minute penalty winner in the quarter-final against Aston Villa. In the semi-final replay on 16 April 1980, against Everton, Stewart was moved into central defence replacing an injured Alvin Martin. The following season Stewart was a vital member of the team which won the 1980–81 Football League Division Two, playing 41 games and scoring five goals, all penalties.\nRenowned for his ability as a penalty taker he only missed 10 out of 86 penalties he took.  One of his penalties came in the 1–1 draw with Liverpool in the 1981 Football League Cup Final, West Ham however lost the replay.\nStewart continued to be an important member of the West Ham side throughout the 1980s including scoring six goals, again all penalties, in their highest finish of third, in the Football League in 1985–86; a season in which he finished third highest scorer for West Ham behind Tony Cottee and Frank McAvennie. In 1989, with West Ham fighting a relegation battle, Stewart suffered a serious injury in the first half of a game in January against Derby County. He ruptured two of the four ligaments around his knee including the main anterior cruciate ligament. He was out-of-action for fourteen months. He returned in a reserve team game in March 1990 and played seven games in a month in a bid to get fit. This proved to be too many games and he needed a further operation on his knee. He returned for the beginning of the 1990–91 season having been recalled by new West Ham manager, Billy Bonds. His injury, along with further problems with hamstring injuries, meant his appearances became fewer with none at all between January 1989 and April 1991. He made a substitute appearance in West Ham's 4–0 1991 FA Cup semi-final defeat to Nottingham Forest on 14 April 1991 coming on to replace Martin Allen and just five in the West Ham side which won promotion from the 1990–91 Second Division. His last game came on 4 May 1991 in a 1–1 draw at Selhurst Park against Charlton Athletic Following his run of injuries, aged 31, Stewart was not offered a further contract and was released on a free transfer.\nStewart scored 84 goals, all but six being penalties, in 434 games for West Ham. Despite playing in defence he was sent off only twice in his West Ham career, neither for fouls committed but on both occasions for comments made to referees or linesmen in games against Aston Villa and Liverpool. In all of West Ham's three FA Cup triumphs, 1964, 1975 and 1980, he is also notable as the only non-English player to appear in any of the West Ham winning teams. He became a favourite with the fans who nicknamed him \"Tonka\" after Tonka Toys, which were described as 'indestructible'.\nSt Johnstone\nIn 1991 Stewart returned to Scotland, to play for St Johnstone and in 1994, briefly for Stirling Albion.\nInternational career\nFollowing his performances with newly promoted West Ham in the 1980–81 season, Stewart was called up by manager Jock Stein for Scotland making his debut on 15 May 1981 against Wales in Swansea. A sending-off following an incident with Mark Hateley in an under 21 game against England at Hampden Park in April 1982 cost him his place in that year's Scotland World Cup squad and he did not play international football under Stein but was recalled under new Scotland manager Andy Roxburgh, playing three more games. He made ten appearances in all, scoring one goal in a 2–0 win against Northern Ireland on 19 May 1981 at Hampden in the British Home Championship.\nInternational goals\n:''Scores and results list Scotland's goal tally first, score column indicates score after Stewart goal''.\n{| class=\"wikitable sortable\"\n|+ International goal scored by Ray Stewart\n|-\n! # !! Date !! Venue !! Opponent !! Score !! Result !! Competition\n|-\n| 1 || 19 May 1981 || Hampden Park, Glasgow, Scotland ||  || align=\"center\"|1–0 || align=\"center\"|2–0 || Home Championship\n|}\nManagerial career\nIn 1998, Stewart began his career as a manager, with spells at Livingston, Stirling Albion and Forfar Athletic. He was sacked in 2000 by Livingston as their directors believed he was not capable of guiding the club to the top tier of Scottish football. His two-season stint with Stirling Albion came to an end in 2002 when he was told his contract would not be renewed after Stirling had been relegated to the Third Division. His last managerial post, with Forfar Athletic, came to an end in November 2004 when he was sacked after a 5–1 first round Scottish Cup defeat by Montrose.\nManagerial statistics\n{| class=\"wikitable\" style=\"text-align: center\"\n|-\n!Team!!Nation!!From!!class=\"unsortable\"|To!!Matches!!Won!!Drawn!!Lost!!Win %\n|-\n|align=left|Livingston\n|\n|align=left|1 August 1997\n|align=left|20 March 2000\n|-\n|align=left|Stirling Albion\n|\n|align=left|17 May 2000\n|align=left|30 April 2002\n|-\n|align=left|Forfar Athletic\n|\n|align=left|13 January 2003\n|align=left|28 November 2004\n|-|-\n!colspan=\"4\"|Total\n|}\nReferences\nExternal links\n*\n*"
    }
  ]
}