{
  "content": [
    {
      "type": "text",
      "text": "# Reactions to the Tigray war__disambig_1\n\nof ethnic Tigrayans]]\nin Paris, France (5 February 2022).]]\nThe events of the Tigray war sparked numerous reactions and protests worldwide.\nDomestic reactions\n* In the first week of November 2020, the Ogaden National Liberation Front (ONLF) issued a statement saying \"ONLF is gravely concerned about the … outbreak of war in and around Tigray. The nations of Ethiopia have had their share of wars and natural disasters, and were expecting a period of reprieve and recuperation. Consensus and dialogue are the only way forward for all to reach a win-win solution\". An anonymous civil society member in Jigjiga stated: \"We oppose the decision of [Somali Region] President Mustafe to portray Somalis in Ethiopia as supporters of the war against Tigray\".\n* On 12 November 2020 TPLF chairman Debretsion Gebremichael denied allegations that the Tigray forces had surrendered, stating that \"we are still holding. These people cannot defeat us. We cannot be beaten.\"\n* On 24 November in a Foreign Policy article by former Prime Minister of Ethiopia Hailemariam Desalegn, he stated that, while he believed calls for peace and dialogue by international observers were well-intentioned, he nevertheless considered them misguided. He also dismissed the idea that the Ethiopian government and the TPLF were morally equivalent, describing it as \"bothsidesism,\" and claiming that TPLF officials were, instead, trying to \"manipulate the international community\" by presenting themselves as victims to retain their power and be absolved of past crimes.\n* On 27 November Ethiopian Attorney General, Gedion Timothewos, pressed by the BBC's Stephen Sackur to clarify if his country was now \"sinking into civil war\", responded: \"If the Prime Minister were to let the TPLF go on with the kind of things they have been doing, if he had let them acquire the heavy weaponry they wanted to acquire by attacking the Northern Command, yes, we would have descended into that kind of situation; but by taking the measures we are taking right now, we will be able to avert that possibility.\"\n* On 10 September 2021 a collective of 24 Ethiopian civil society organisations called for peace in Ethiopia, stating:}}\nDomestic protests\nOn 9 February 2021 when religious leaders started a visit to Mekelle organized by federal authorities to show that the situation was \"normal\", protestors used stones and burnt tires to block central parts of the town in objection to the claim that the situation had returned to normality. Soldiers fired at the protestors, killing one. The head of the transport division of Ayder Referral Hospital and his son was beaten by soldiers and stated that there were many injured who were not being brought to the hospital.\nOn 30 May 2021 more than 10,000 pro-Ethiopia protestors gathered in Addis Ababa to protest \"Western intervention\" in the domestic affairs of Ethiopia. On 29 July, hundreds of Eritrean refugees rallied in Addis Ababa for protection by the government from the TDF, fearing the danger posed to other Eritrean refugees stuck in Tigray, unable to leave due to ongoing fighting. Thousands of protesters gathered in the capital to denounce the TDF on 8 August. Thousands more would protest the TPLF again on 7 November 2021, as Tigrayan forces were getting closer to Addis Ababa, with protesters also directing their anger at Western governments trying to \"interfere\" in the conflict.\nOn 22 October 2022 in Addis Ababa, hundreds of thousands gathered in Meskel Square to support the Ethiopian government (ahead of planned peace talks in South Africa), protesting against external interference in the country's affairs.\nInternational\nDirectly involved in the war\n*  Eritrean President Isaias Afewerki stated in a February 2021 Eritrean television interview that the 2018 Ethiopia–Eritrea peace agreement had been \"a clear indication that the role of [the TPLF had] ended or 'game over'\". He stated that Eritrea had \"the responsibility and obligation to support Ethiopia more than any of our other neighbouring countr[ies]\", which \"is why [Eritrea is] supporting Ethiopia and the conflict over the [previous] 3 months\".\nOthers\n*  Canadian Foreign Minister François-Philippe Champagne called on all parties to show restraint. Champagne also called for a peaceful solution and protection of civilians.\n*  At the UN Security Council meeting, China objected to interfering in Ethiopia's internal affairs.\n*  Djiboutian President Ismaïl Omar Guelleh expressed strong support for Abiy, saying that he had chosen to \"restore law and order at the federal level, and punish those seeking to break up the country\" and dismissed the prospect of negotiations, saying that the TPLF had \"structured itself so as to bring the central government to its knees\" and that talks could \"only lead to the partition of Ethiopia\", setting a precedent for secession by other groups in the region.\n*  At the UN Security Council meeting, India objected to interfering in Ethiopia's internal affairs.\n*  extended its emergency grant aid of 6.6&nbsp;million US dollars for people affected by the war.\n*  expressed the need for the Ethiopian leaders to seek peaceful resolution to the conflict.\n*  Minister of Foreign Affairs Mevlüt Çavuşoğlu stated that the Turkish government \"understood\" the federal Ethiopian government's decision and \"expressed his confidence that the operation would end soon and not compromise the safety of civilians.\"\n*  Norway said it was \"deeply concerned by reports of the use of [sexual and gender-based violence (SGBV) ] in Tigray. Norway joins UN Special Rapporteur Pramilla Patten in calling on all parties to commit to a zero-tolerance policy for SGBV. Obligations under international humanitarian and human rights law must be respected.\"\n*  The Polish Ministry of Foreign Affairs stated in response to the massacre in the Church of Our Lady Mary of Zion, \"We strongly condemn the perpetrators of this barbaric crime committed in a place of worship. We expect the Ethiopian authorities to immediately take all possible to clarify its circumstances and punish the perpetrators.\" Poland also called \"on the parties to the conflict to refrain from violence and respect human rights, to ensure the safety of civilian population, and to properly protect the places of worship and freedom of religion. We appeal for an unimpeded access for humanitarian deliveries to the Tigray province.\n*  At the UN Security Council meeting, Russia objected to interfering in Ethiopia's internal affairs.\n*  Somalia President Mohamed Abdullahi Farmajo politically supports the current military actions taken by the Ethiopian government against Tigray People's Liberation Front.\n*  British Foreign Secretary Dominic Raab said he had spoken with Abiy and urged \"de-escalation of the Tigray conflict\" and further stated that \"civilians and humanitarian access must be protected\".\n** British House of Lords member, David Alton, called on the British government to investigate the reports of massacres and attacks on refugee camps in Tigray.\n*  US Secretary of State Mike Pompeo urged de-escalation of the conflict and immediate action to restore peace, and emphasized the importance of protecting civilians. Then US President-elect Joe Biden's foreign policy adviser Antony Blinken expressed deep concern over the humanitarian crisis in Ethiopia, ethnic violence and threats to peace and security in the area. He called on the TPLF to protect civilians and take steps to end the conflict.\n** US Assistant Secretary of State for Africa Tibor Nagy condemned the Tigray People's Liberation Front for their rocket attacks against Asmara, calling it an \"unjustifiable attacks against Eritrea [...] its efforts to internationalize the conflict in Tigray.\"\n** On 27 February 2021, US Secretary of State Antony Blinken urged for the immediate withdrawal of Eritrean forces and Amhara regional forces from Tigray. He also asked the African Union and regional partners, to work with the United States to address the crisis in Tigray.\n** On 12 March 2021, the US announced it would be resuming some aid to Ethiopia, which had previously been blocked by the Trump administration over the Grand Ethiopian Renaissance Dam (GERD) dispute, but that security assistance programs would remain suspended due to concerns over the conflict in Tigray.\n** On 17 September 2021, President Joe Biden signed a new executive order allowing Washington to take punitive sanctions against the governments of Ethiopia, Eritrea, the Tigray People's Liberation Front and the Amhara regional government if they play a role in prolonging the conflict, obstructing humanitarian access or commit serious human rights abuses.\n** On 14 December 2021, the US Government's Millennium Challenge Corporation terminated its threshold program with the government of Ethiopia, following the determination that Ethiopia is ineligible to receive foreign aid due to its human rights record.\n** On 23 December 2021, the US said it would remove Ethiopia, along with Guinea and Mali, from the African Growth and Opportunity Act (AGOA), effective 1 January 2022.\n** On 10 February 2022, the US House of Representatives advanced a bill to impose sanctions on Ethiopians responsible for worsening of the crisis. The Ethiopian Stabilization, Peace and Democracy Act was proposed to sanction the individuals and countries that provided training, weapons, or financial support to the parties involved in amplifying the crisis. Additionally, it also called on the US State Department to determine the role of foreign governments in fueling the war, including of the UAE, Turkey and China.\n** In September 2022, Senator Bob Menendez, the Democratic chairman of the Senate Foreign Relations Committee, criticized the Biden administration for hesitating to impose sanctions on the government of Ethiopia.\n*  President Joe Biden met with Kenyan President Uhuru Kenyatta to discuss the deteriorating humanitarian situation in Tigray and the need to prevent further loss of life and to ensure humanitarian access.\nIntergovernmental organizations\n*  The United Nations\n** In November 2020, the UN warned that, if a full-scale conflict arose, it could lead to a major humanitarian crisis.\n** Though the UN Security Council had planned \"to issue a statement calling for an end to violence in Ethiopia's Tigray region,\" these plans were canceled on 5 March 2021 due to Chinese and Russian opposition.\n** On 3 November 2021, the UN said that all sides in the conflict had \"committed violations of international human rights, humanitarian and refugee law, some of which may amount to war crimes and crimes against humanity.\"\n** On 5 November 2021, the United Nations Security Council unanimously issued a statement calling \"for a cessation of hostilities.\" A follow-up meeting is expected in the following week.\n** On 17 October 2022, as the war escalated following the collapse of a months-long ceasefire, UN Secretary-General António Guterres, expressed his alarm that \"the situation in Ethiopia [was] spiraling out of control\" and that Ethiopian society was \"being ripped apart,\" urging that peace talks be arranged as soon as possible.\n*  The European Commission said it was mobilizing an initial €4&nbsp;million in emergency aid, to assist displaced Ethiopian refugees who had fled to Sudan. The EU plans on cutting aid to and sanctioning other regions of Ethiopia due to the conflict. In December 2021, EU Foreign Policy Chief Josep Borrell said that the situation in Ethiopia was \"one of my biggest frustrations\" of the year because the EU was not able to react properly to the large-scale human rights violations, \"mass rapes using sexual violence as a war arm, killings and concentration camps based on ethnic belonging.\"\n*  The African Union (AU) appealed for cessation of hostilities and protection of civilians. The AU also stated that the European Union and United Nations Security Council should not intervene until an African Union envoy is sent to Ethiopia.\n** The Chairperson of the African Union Commission, Moussa Faki Mahamat, made a statement defending the Ethiopian Government by tweeting \"In #Ethiopia, the federal govt took bold steps to preserve the unity, stability and respect for the constitutional order of the country; which is legitimate for all states. It cannot be denied, however, that the crisis in #Tigray has provoked large scale displacement. We encourage #IGAD to support #Ethiopia in addressing the humanitarian dimensions. Particular attention should be paid to refugees and displaced people. #IgadSummit.\"\nProtests by the diaspora\nEthiopians and Eritreans in the diaspora took to the streets to protest and express their views. These protests included:\nOpposing the Ethiopian federal government\n* On 9 November 2020, in Washington D.C., US\n* On 12 November 2020, in Denver, Colorado, USA\n* On 14 November 2020, in the Netherlands\n* On 18 November 2020, in Las Vegas, Nevada, USA\n* On 21 November 2020, in Stavanger, Norway\n* On 24 November 2020, in Louisville, Kentucky, USA\n* On 25 November 2020 in Pretoria, South Africa\n* On 28 December 2020, in Denver, Colorado, USA\n* On 3 January 2021, in Aurora, Colorado, USA\n* On 8 January 2021, in multiple cities, including\n** In Melbourne\n** In Perth, Australia\n** In Portland, Oregon, USA\n** In Sioux City, Iowa, USA\n* Mid-January 2021, in The Hague, South Holland, Netherlands\n* On 22 January 2021, in Louisville, Kentucky, USA\n* On 11 February 2021, in New York City, USA, at the Headquarters of the United Nations\n* On 16 March 2021, in Geneva, Switzerland in front of the United Nations Office in Geneva\n* On 25 March 2021, in Wellington, New Zealand and Pretoria, South Africa\n* On 24 April 2021, in Edmonton, Alberta, Canada by Tigrayan-Canadians.\n* On 15 May 2021, in Edmonton, Alberta, Canada by Oromo-Canadians.\n* On 12 June 2021, in Cornwall, England, UK more than one thousand Ethiopians and Tigrayans rally around the annual G7 event. Ethiopian protesters were heard shouting \"Abiy is a criminal.\"\n* On 8 September 2021, in Houston, Texas, USA in front of the city's Turkish embassy, protesting against Turkish support of Ethiopia.\n* On 13 September 2021, in Switzerland at the United Nations Office at Geneva\n* On 13 October 2021, in Portland, Maine, USA\n* On 4 November 2021, in Washington, D.C., USA, around the one-year anniversary of the war.\n* On 4 December 2021, in Burlington, Vermont, USA, calling for boycotts of Ethiopian products\n* On 26 January 2022, in Pretoria, South Africa, calling for the United States and European Union to pressure the Ethiopian government to withdraw troops from Tigray.\n* On 17 February 2022, in Brussels, Belgium during the 6th EU–AU Summit. Ethiopians were also joined with nationals from the Comoros and the Democratic Republic of the Congo, each protesting against injustices happening in their own countries.\n* On 2 April 2022, in Ottawa, Ontario, Canada at the ByWard Market, protesting against Ethiopia's blockade of Tigray.\n* On 24 May 2022, in Columbus, Ohio, USA\n* On 28 June 2022, in the North Texas area of Texas, USA\n* On 12 October 2022, in Pretoria, South Africa, in front of the UAE embassy.\n* On 4 November 2022, around the second anniversary of the war, protests happened worldwide to bring international attention to the war, including at the Place du Luxembourg in Brussels, Belgium, and on the Interstate 5 Highway in Seattle, Washington, USA.\n* On 6 November 2022, in Washington, D.C., USA, while blocking parts of the 14th Street bridges for 2 hours.\nOpposing the TPLF and/or supporting the government\n* On 7–12 March 2021, in Washington, D.C., USA, at the United States Department of State, as well as \"several Canadian cities,\" including Toronto, Ontario.\n* On 15 March 2021, in Geneva, Switzerland, hundreds of Ethiopians (including some Eritreans) held a protest outside of the United Nations building in support of \"the government actions taken against the Tigray People's Liberation Front\".\n* On 29 April 2021, in Milan, Italy 28 Ethiopians and Eritreans peacefully marched in support of the Ethiopian government.\n* On 21 November 2021, Ethiopians and Eritreans protested in 27 cities across the world.\n* On 22 November 2021, Ethiopians protest in Pretoria, South Africa against alleged U.S. interference in the war.\n* On 20 December 2021, in Wellington, New Zealand, at the country's parliament.\n* On 18 September 2022, Protestors in front of the White House called that the Tigray People's Liberation Front (TPLF) be disarmed in the interest of peace in the Horn of Africa, not just Ethiopia.\n* On 5 October 2022, a grand rally of Eritreans and Ethiopians residing in Germany in the city of Giessen protested against TPLF forces.\n* On 23 October 2022, in Washington, D.C., USA, protesting against possible U.S. interference.\nReferences"
    }
  ]
}