{
  "content": [
    {
      "type": "text",
      "text": "# Realm of Kings\n\n| publisher      = Marvel Comics\n| startmo        = November\n| startyr        = 2009\n| endmo          = March\n| endyr          = 2010\n| SciFi          = first\n| Superhero      = y\n| multigenre     = y\n| Crossover      = y\n| titles         = Realm of Kings (one-shot)Realm of Kings: Imperial Guard #1-5Realm of Kings: Inhumans #1-5Guardians of the Galaxy (vol. 2) #20-24Nova (vol. 4) #31-35Realm of Kings: Son of Hulk #1-4\n| main_char_team = Shi'arInhumansKreeGuardians of the GalaxyStarjammersNovaDarkhawk\n| writers        = Dan AbnettAndy LanningSon of HulkScott Reed\n| artists        = Realm of KingsMahmud AsrarLeonardo MancoNovaAndrea Di VitoImperial GuardKev Walker\n| pencillers     = Guardians of the GalaxyBrad WalkerInhumansPablo RaimondiSon of HulkMiguel Munera\n| inkers         = Guardians of the GalaxyVictor OlazabaInhumansAndrew HennessySon of HulkTerry Pallot\n| letterers      =\n| colorists      =\n| editors        =\n| TPB            = Realm of Kings\n| ISBN           = 0-7851-4809-4\n| TPB1           = Guardians of the Galaxy\n| ISBN1          = 0-7851-4543-5\n| TPB2           = Nova\n| ISBN2          = 0-7851-4067-0\n| cat            = Marvel Comics\n| cat+#          =\n| sortkey        = Realm of Kings\n| self-titled    = y\n}}\n\"Realm of Kings\" is a crossover comic book storyline published in 2010 by Marvel Comics. Written by Dan Abnett and Andy Lanning, it is a follow-up to the 2009 storyline \"War of Kings\". The series introduced the setting known as the Cancerverse, an alternate universe that was conquered by the Many-Angled Ones and their servants, among them a corrupted Mar-Vell.\nPublication history\nThe series started with a Realm of Kings one-shot that establishes the setting and is followed by a number of separate series or storylines which focus on how the different characters, Imperial Guard, Inhumans, Guardians of the Galaxy and Nova, deal with this situation.\nThe storyline also includes the limited series Realm of Kings: Son of Hulk by Scott Reed, with art by Miguel Munera. This focuses on Hiro-Kala and his journey into the Microverse.\nPlot summary\nA giant time-space tear called the Fault had been created by Black Bolt's T-Bomb, killing both himself and the Shi'ar leader Vulcan. The Fault becomes an immediate concern for the Guardians of the Galaxy and the Nova Corps, who send Wendell Vaughn, the first Quasar, into the Fault to scout it. Quasar discovers that the Fault is a tunnel leading to another universe that is ruled by a corrupted Mar-Vell and his servants, evil organic masses who consumed their universe like a cancer. It is described as a Cancerverse, where \"Life has won, Death has lost.\" He is captured by that universe's Avengers (called the Revengers), who plan on imposing their Earth on his, to enable their gods, the Many-Angled Ones, to continue to spread.\nTitles\n* Realm of Kings (one shot)\n* Realm of Kings: Imperial Guard #1-5\n* Realm of Kings: Inhumans #1-5\n* Guardians of the Galaxy (vol. 2) #20-24\n* Nova (vol. 4) #31-35\n* Realm of Kings: Son of Hulk #1-4\nCollected editions\n{| class=\"wikitable\"\n|+\n!Title\n!Material collected\n!Published date\n!ISBN\n|-\n|Realm of Kings\n|Realm of Kings, Realm of Kings: Inhumans #1-5, Realm of Kings: Son of Hulk #1-4, Realm of Kings: Imperial Guard #1-5\n|August 2010\n|\n|-\n|Realm of Kings: Imperial Guard\n|Realm of Kings Imperial Guard #1-5\n|June 2010\n|\n|-\n|Guardians of the Galaxy Volume 4: Realm of Kings\n|Guardians of the Galaxy (vol. 2) #20-25, Realm of Kings\n|June 2010\n|\n|-\n|Nova Volume 6: Realm of Kings\n|Nova (vol. 4) #29-36\n|June 2010\n|\n|-\n|War of Kings Aftermath: Realm of Kings Omnibus\n|Realm of Kings, Realm of Kings: Inhumans #1-5, Realm of Kings: Son of Hulk #1-4, Realm of Kings: Imperial Guard #1-5, Nova (vol. 4) #29-36, Guardians of the Galaxy (vol. 2) #20-25, Thanos Imperative #1-6, Ignition, Devastation, Annihilators #1-4, Annihilators: Earthfall #1-4, Thanos Sourcebook, material from I am an Avenger #3\n|February 2017\n|\n|}\nAftermath\nBoth the Nova and Guardians of the Galaxy series were put on hiatus following the conclusion of \"Realm of Kings\" and the events in the storyline lead directly into \"The Thanos Imperative\".\nAlso the conclusion of Son of Hulk intersects with the end of the back-to-back Hulk storylines  \"Fall of the Hulks\" and \"World War Hulks\" in the story arc \"Dark Son\", partly written by Scott Reed.\nReferences\nExternal links\n*\n*"
    }
  ]
}