{
  "content": [
    {
      "type": "text",
      "text": "# Rebellion: The Litvinenko Case__disambig_1\n\n| music          =\n| cinematography =\n| editing        = Andrei Nekrasov\n| distributor    = BBC (theatrical)\n| released       =\n| runtime        = 105 minutes\n| country        = Russia\n| language       = English, Russian, French\n| budget         =\n}}\nRebellion: The Litvinenko Case (), distributed as Poisoned by Polonium, is a 2007 Russian documentary film covering the death of ex-Russian spy and dissident, Alexander Litvinenko, who was assassinated in London, United Kingdom in 2006. It was directed by Russian filmmaker Andrei Nekrasov and written by Nekrasov and producer Olga Konskaya.\nContent\nThe film covers the flight from Russia and subsequent murder of Litvinenko, a controversial Russian dissident living in London. Litvinenko was murdered with the radioactive poison Polonium-210 in 2006, triggering already souring relations between Russia and Britain (and the West in general). The man wanted by the British police on suspicion of the murder of Litvinenko is Andrey Lugovoy, who had visited London before Litvinenko's death and met with him four times. Russia has rejected the request for his extradition.\nThe film includes interviews with Litvinenko, which, according to the film-makers shows him \"explaining the reasons of his rebellion and detailing the rise of the police state in Russia in the past decade.\" They claim that his defection, his claim that Putin wanted his spooks to assassinate the Yeltsin-era tycoon Boris Berezovsky, and \"investigation of the alleged involvement of  [the] FSB in the 1999 bombings of apartment houses in Moscow, which was blamed on the Chechens and served as the pretext for the war, made him the sworn enemy of the Kremlin\" and possibly led to his death.\n\"Nekrasov claims that the culture of fear and secrecy triumphantly survived the end of the Soviet Union. The surviving authoritarianism and paranoia were welded to a new worship of money and gangsterism.\" The documentary also includes interviews with assassinated journalist Anna Politkovskaya.\nReaction\nThe film received its world premiere at the Cannes Film Festival in 2007, where it was selected for the main programme. The film however has been banned in Russia. When human rights organisation Memorial was raided by the Russian authorities in November 2008 for alleged involvement in anti-Semitic publications, observers suspected that the real reason was because it had screened Rebellion: The Litvinenko Case in St Petersburg on November 23, the second anniversary of Mr Litvinenko’s death. The Russian government has denied the accusation that the screening was related to the raid.\nThe New York Times wrote of the film: \"Mr. Nekrasov’s extraordinary testament...\" \"More personal essay than political diatribe...\" The Guardian called the film \"ferocious\", and wrote that \"Rebellion exerts an awful grip.\" The tabloid New York Sun described the film as \"utterly unexciting\" and a \"squandered opportunity\".\nNotes\nReferences\n* [https://web.archive.org/web/20080415151727/http://www.dreamscanner-productions.com/litvinenko/index.html Official website]\n* Jason Buchanan (All Movie Guide), [http://guide.alibaba.com/shop/poisoned-by-polonium-the-litvinenko-case-widescreen_30264992.html Poisoned By Polonium: The Litvinenko Case] Description. Alibaba.com"
    }
  ]
}