{
  "content": [
    {
      "type": "text",
      "text": "# Rebellion (song)\n\n| writer     =\n| producer   =\n| chronology = Linkin Park\n| prev_title = Wastelands\n| prev_year  = 2014\n| next_title = Final Masquerade\n| next_year  = 2014\n| misc       =\n}}\n}}\n\"Rebellion\" is a song by American rock band Linkin Park. The song was originally recorded by the band for their sixth studio album, The Hunting Party, where it appears as the eighth track on the album. The song features Armenian-American multi-instrumentalist Daron Malakian from rock band System of a Down, who plays additional guitar on the track. The track was released as the fourth official single from The Hunting Party on June 4, 2014 and was later released on American rock radio on October 13, 2014.\nComposition\nIn a preview for the album by Rolling Stone, it was stated that \"'Rebellion' uses a speedy riff and a jackhammer-fast drum line that splits the difference between hardcore and disco that, together, charges toward a chorus with the message “Rebellion – we lost before we start.” . In another preview for the album by AltWire, it has been described as \"sonically resembling a Toxicity-era System of a Down track with Daron Malakian's signature guitar sound on full display, as he delivers a blisteringly fast sixteenth note guitar riff behind Mike Shinoda's sung lead vocals, breaking only momentarily for the chorus where Chester Bennington takes over the microphone to sing “we are the fortunate ones, imitations of rebellion”.\"\nCancelled music video\nMike Shinoda said that they were collecting live footages to make a music video for Rebellion but no music video exists as of now. However, a lyric video was released on June 3, 2014. The video, in the vein of the lyric video from their previous single \"Wastelands\", features simplistic and linear white on black text slides with occasional special effects added to the lyrics, such as the words shattering into pieces, like the word \"Rebellion\" in the video.\nIn December 2015, Mike Shinoda stated that he would love to put together a music video for \"Rebellion\". However, he felt that it would simply cost too much money and take too much time, and he believed that the time has come to move on to the next album.\nLive performances\n\"Rebellion\" debuted at the Carnivores Tour, co-headlined with Thirty Seconds to Mars, alongside \"Final Masquerade\", and is a major song throughout 2014. At two performances, Daron Malakian joined the band to play guitar. The song was removed from all setlists in 2015's North American Tour, but Linkin Park brought it back for their festival set in summer 2015. When played live at The Hunting Party cycle, \"Rebellion\" has a short extended intro where the album intro is looped twice, and Linkin Park guitarist Brad Delson always played the song differently compared to Daron Malakian.\nIn 2017, the song returned at the Linkin Park and Friends: Celebrate Life in Honor of Chester Bennington memorial concert at Hollywood Bowl. Daron Malakian appears once again to play guitar and sing Chester Bennington's parts. System of a Down bandmate Shavo Odadjian played bass, and Sum 41's Frank Zummo played drums. Brad Delson, Dave Farrell and Rob Bourdon, however, did not perform during the song.\nReception\nIn a track-by-track review by Billboard, the song was given a positive response and explained as \"After a chomping intro riff — maybe the gnarliest guitar part on the record — Linkin Park once again brandish their Euro-metal broadswords and get medieval on our asses...while the song speaks to the anger of being American and having nothing to really rebel against, the band plays with the urgency of insurgents.\" Sound and Motion Magazine cited the bridge as the song's highlight, and stated \"With heavy guitar and drum line this track sounds similar to the sound that first brought Linkin Park into the limelight which should make many loyal fans ecstatic.\"\nTrack listing\n| length1 = 3:44\n|writer1 = }}\nPersonnel\n;Linkin Park\n* Chester Bennington – vocals\n* Rob Bourdon – drums, percussion\n* Brad Delson – guitar\n* Dave \"Phoenix\" Farrell – bass guitar\n* Joe Hahn – sampling, programming\n* Mike Shinoda – vocals, guitar, keyboards\n;Additional musicians\n* Daron Malakian – additional guitar\nCharts\n{| class=\"wikitable sortable plainrowheaders\" style=\"text-align:center\"\n|+ Chart performance for \"Rebellion\"\n|-\n! scope=\"col\"| Chart (2014)\n! scope=\"col\"| Peakposition\n|-\n! scope=\"row\"| Canada Digital Songs (Billboard)\n| 55\n|-\n|-\n! scope=\"row\"| UK Rock & Metal (OCC)\n| 13\n|-\n|-\n! scope=\"row\"| US Mainstream Rock (Billboard)\n| 15\n|-\n|}\nRelease history\n{|class=\"wikitable plainrowheaders\"\n! Region\n! Date\n! Format\n! Label\n|-\n! scope=\"row\"| Worldwide\n| June 4, 2014\n| Digital download\n| rowspan=\"3\"| Warner Bros.\n|-\n! scope=\"row\" rowspan=\"2\"| United States\n| October 13, 2014\n| Active rock radio\n|-\n|}\nReferences"
    }
  ]
}