{
  "content": [
    {
      "type": "text",
      "text": "# Reborn to Master the Blade: From Hero-King to Extraordinary Squire\n\n| imprint      = HJ Bunko\n| first        = November 30, 2019\n| last         =\n| volumes      = 13\n| volume_list  =\n}}\n| magazine     = Comic Fire\n| imprint      = HJ Comics\n| first        = December 6, 2019\n| last         =\n| volumes      = 6\n| volume_list  =\n}}\n}}\n| network      = TV Tokyo, BS TV Tokyo, AT-X\n| network_en   =\n| first        = January 10, 2023\n| last         = March 28, 2023\n| episodes     = 12\n| episode_list =\n}}\n\"''The Hero King, Reincarnated to Master Martial Arts—Thus Becoming the World's Strongest Female Knight-in-Training''\"}} is a Japanese fantasy light novel series written by Hayaken and illustrated by Nagu. It began serialization online in March 2019 on the user-generated novel publishing website Shōsetsuka ni Narō. It was later acquired by Hobby Japan, who have published thirteen volumes since November 2019 under their HJ Bunko imprint. A manga adaptation with art by Moto Kuromura has been serialized online via Hobby Japan's Comic Fire website since December 2019 and has been collected in six tankōbon volumes. Both the light novel and manga have been licensed digitally in North America by J-Novel Club and in print by Yen Press. A two-episode mini anime adaptation was released between November 7 and November 14, 2020, on Comic Fire's Twitter account. An anime television series adaptation by Studio Comet aired from January to March 2023.\nPlot\nIn the Kingdom of Silvare lived the Hero-King Inglis. With the personal blessing of the goddess Alistia, Inglis became a divine knight, slaying the enemies of humanity and the dark gods to establish the Kingdom. As a last favor granted to him on his deathbed, the goddess Alistia reincarnated Inglis as his single greatest regret was not being able to reach the peak of mastering the blade. Now reborn as a woman (perhaps at the jesting whims of the goddess), Inglis Eucus strives to live a life in the far future where she can truly master the blade.\nCharacters\n;\n:\n: The main protagonist of the series and the Hero-King of the Kingdom of Silvare, who reincarnated as a woman in order to dedicate her new life to training martial arts. She is also known by her nickname Chris. Despite accepting her new life as a woman and having girlish habits like a love of desserts and fancy clothes, she still retains parts of her previous life, like liking only women and seeing her friends as grandchildren. She possesses ancient magic called Aether, which most people in the new world do not understand, making her extremely powerful, even though she's a Runeless (although some characters like Ripple, Yua, and Black Mask are strong enough to fight back against her). She loves to battle and is very overconfident, showing little to no timidity regardless of how strong her opponents are and usually begs them to fight her if they aren't interested, to the confusion of friends and foes alike. She also has a powerful appetite.\n;\n:\n:Chris' maternal cousin. She possessed an Artifact that allows her to use a magic bow that shoot arrows of light. She is also known by her nickname Rani. Like her cousin, she has a monstrous appetite.\n;\n:\n: A student at the Knight Academy that Chris and Rani befriend. As a result of her older brother Leon turning traitor and joining the Steelblood Front, her family is shunned for being traitors and untrustworthy by the people. Leone joins the Knight Academy to not only redeem her family's honor but also arrest her brother. She possessed an Artifact sword that can change its size.\n;\n:\n: A student at the Knight Academy and daughter of the current Prime Minister. Her Artifact allows her to fly. She at first bullies Chris and Leone upon meeting them, but soon warms up to them.\n;\n:\n: A Hieral Menace, special humans that can turn into Artifacts. She was previously Leon Olfa's partner before the latter turned traitor.\n;\n:\n: A Hieral Menace and member of the Steelblood Front. She is Black Mask's partner.\n;\n:\n: A Hieral Menace, Eris' colleague and Rafael's partner. She possesses a condition that, when she absorbs mana from special Rune artifacts, causes her unintentionally summon Magicite beasts. She is cured after summoning a powerful Kaiju Magicite beast. She is also one of the only characters who can fight back against Chris.\n;\n:\n: Rani's older brother, Ripple's partner, and Chris's cousin. He possesses an Artifact sword.\n;\n:\n: A former Holy Knight and Leone's older brother. Once a respected knight, Leon became a traitor and join the rebel Steelblood Front after having enough of the Highlanders mistreating the surface people. At one point, he does aid Chris and her friends in taking down a powerful Magicite beast.\n;\n:\n:The mysterious leader of the Steelblood Front, a revolutionary terrorist group that aims to overthrow the Highlanders rule over the surface people. Despite his antagonism, he will not kill innocent people and only seeks to defeat the Highlanders. He also possesses Aether magic, making him the only person who is strong enough to fight Chris at an equal level.\n;\n:\n| ISBN              = 978-4-79-862064-0\n| LicensedRelDate   = June 28, 2021 (digital)October 17, 2023 (print)\n| LicensedISBN      = 978-1-71-837848-3\n| LicensedISBN_note = (digital) (print)\n| ChapterList       =\n| Summary           =\n}}\n| ISBN              = 978-4-79-862147-0\n| LicensedRelDate   = October 1, 2021 (digital)February 20, 2024 (print)\n| LicensedISBN      = 978-1-71-837850-6\n| LicensedISBN_note = (digital) (print)\n| ChapterList     =\n| Summary         =\n}}\n| ISBN              = 978-4-79-862244-6\n| LicensedRelDate   = December 21, 2021 (digital)June 18, 2024 (print)\n| LicensedISBN      = 978-1-71-837852-0\n| LicensedISBN_note = (digital) (print)\n| ChapterList     =\n| Summary         =\n}}\n| ISBN              = 978-4-79-862344-3\n| LicensedRelDate   = April 15, 2022 (digital)November 19, 2024 (print)\n| LicensedISBN      = 978-1-71-837854-4\n| LicensedISBN_note = (digital) (print)\n| ChapterList     =\n| Summary         =\n}}\n| ISBN              = 978-4-79-862479-2\n| LicensedRelDate   = June 17, 2022 (digital)February 18, 2025 (print)\n| LicensedISBN      = 978-1-71-837856-8\n| LicensedISBN_note = (digital) (print)\n| ChapterList     =\n| Summary         =\n}}\n| ISBN            = 978-4-79-862675-8\n| LicensedRelDate = September 16, 2022 (digital)May 13, 2025 (print)\n| LicensedISBN    = 978-1-71-837858-2\n| LicensedISBN_note = (digital) (print)\n| ChapterList     =\n| Summary         =\n}}\n| ISBN            = 978-4-79-862826-4\n| LicensedRelDate = December 14, 2022 (digital)August 12, 2025 (print)\n| LicensedISBN    = 978-1-71-837860-5\n| LicensedISBN_note = (digital) (print)\n| ChapterList     =\n| Summary         =\n}}\n| ISBN            = 978-4-79-862886-8\n| LicensedRelDate = March 10, 2023 (digital)January 6, 2026 (print)\n| LicensedISBN    = 978-1-71-837862-9\n| LicensedISBN_note = (digital) (print)\n| ChapterList     =\n| Summary         =\n}}\n| ISBN            = 978-4-79-863016-8\n| LicensedRelDate = July 21, 2023 (digital)\n| LicensedISBN    = 978-1-71-837864-3\n| ChapterList     =\n| Summary         =\n}}\n| ISBN            = 978-4-79-863264-3\n| LicensedRelDate = April 5, 2024 (digital)\n| LicensedISBN    = 978-1-71-837866-7\n| ChapterList     =\n| Summary         =\n}}\n| ISBN            = 978-4-79-863381-7\n| LicensedRelDate = July 8, 2024 (digital)\n| LicensedISBN    = 978-1-71-837868-1\n| ChapterList     =\n| Summary         =\n}}\n| ISBN            = 978-4-79-863595-8\n| LicensedRelDate = December 30, 2024 (digital)\n| LicensedISBN    = 978-1-71-837870-4\n| ChapterList     =\n| Summary         =\n}}\n| ISBN            = 978-4-79-863778-5\n| LicensedRelDate = —\n| LicensedISBN    =\n| ChapterList     =\n| Summary         =\n}}\nManga\n| ISBN              = 978-4-79-862268-2\n| LicensedRelDate   = October 13, 2021 (digital)November 21, 2023 (print)\n| LicensedISBN      = 978-1-71-837888-9\n| LicensedISBN_note = (digital) (print)\n| ChapterList       =\n| Summary           =\n}}\n| ISBN              = 978-4-79-862496-9\n| LicensedRelDate   = January 12, 2022 (digital)March 19, 2024 (print)\n| LicensedISBN      = 978-1-71-837889-6\n| LicensedISBN_note = (digital) (print)\n| ChapterList       =\n| Summary           =\n}}\n| ISBN              = 978-4-79-862653-6\n| LicensedRelDate   = August 1, 2022 (digital)June 18, 2024 (print)\n| LicensedISBN      = 978-1-71-837890-2\n| LicensedISBN_note = (digital) (print)\n| ChapterList     =\n| Summary         =\n}}\n| ISBN              = 978-4-79-862885-1\n| LicensedRelDate   = March 22, 2023 (digital)September 17, 2024 (print)\n| LicensedISBN      = 978-1-71-837891-9\n| LicensedISBN_note = (digital) (print)\n| ChapterList     =\n| Summary         =\n}}\n| ISBN            = 978-4-79-863156-1\n| LicensedRelDate = July 17, 2024 (digital)February 18, 2025 (print)\n| LicensedISBN    = 978-1-71-837892-6\n| LicensedISBN_note = (digital) (print)\n| ChapterList     =\n| Summary         =\n}}\n| LicensedISBN    = 978-1-71-837893-3\n| LicensedISBN_note = (digital)\n| ChapterList     =\n| Summary         =\n}}\nAnime\nA two-episode mini anime adaptation of the series was announced on October 31, 2020. The first episode was streamed on November 7, 2020, on Comic Fire's official Twitter account, followed by the second episode on November 14.\nOn November 29, 2021, a new anime adaptation was announced. It was later revealed to be a television series produced by Studio Comet. The series is directed by Naoyuki Kuzuya, with scripts written by Mitsutaka Hirota, character designs handled by Reiichirō Ōfuji, and music composed by Kenta Higashiohji. It aired from January 10 to March 28, 2023, on TV Tokyo and other networks. The opening theme song is \"Day1\" by Auo featuring Win Morisaki, while the ending theme song is  by Yui Nishio. Crunchyroll streamed the series worldwide outside of Asia. Muse Communication licensed the series in Asia-Pacific.\n|director=\n|directorR=\n|writer=\n|writerR=\n|aux2=\n|aux2T=Storyboarded by\n|aux2R=\n|airdate=\n|airdateR=\n|episodes=\n| ShortSummary        = King Inglis of Silvare lies on his death bed and is visited by the Goddess Alistia. As a reward for his service for defending humanity from evil, Alistia agrees to grant Inglis a wish to be reincarnated so he may learn to master the blade. Inglis wakes up hundreds of years later as a baby, but is shocked to learn he is now a girl. Retaining her old name Inglis, but also going under the nickname Chris, Chris learns in her new life that humanity has forgotten how to use powerful magic called Aether, which she can still use, but have Runes that allows the use of magical Artifacts to fight monsters called Magicite beasts. When a Magicite dragon attacks Chris, her mother, aunt, and her cousins, Chris uses her Aether granted to her by Alistia in her previous life to secretly kill the dragon, making her older cousin appear to be the one who defeated it. Five years later, Chris and her cousin Rafinha \"Rani\" Bilford, watches Rafael, the latter's older brother, training to become a knight in the courtyard. When a merchant son named Rahl easily defeats all of the Knight trainees, Chris realize Rahl is cheating by secretly using a spell to slow down his opponents if they look into his eyes. To avenge her cousin Rafael, Chris challenges Rahl to a duel. Using her previous life sword skills and closing her eyes, Chris is able to defeat Rahl, much to the crowd's joy.\n}}\nの邂逅\n| NativeTitleLangCode = ja\n| DirectedBy          = N/A\n| WrittenBy           = Mitsutaka Hirota\n| Aux2                = Naoyuki Kuzuya\n| OriginalAirDate     =\n| ShortSummary        = Now six years old, Chris and Rani undergo their Baptism which would give them Runes. While Rani gets a high class rune, Chris purposely botches her Baptism to become a \"Runeless\", so she can focus more on her sword skills and not get anyone's attention of her real power. Six years later, Chris and Rani attend a banquet where the ambassador from Highland, the floating island that provides the surface kingdoms Artifacts in exchange for tribute and supplies, is attending. While uncomfortable with many men looking at her since Chris likes women, Chris is introduced to Rafael's colleague, Sir Leon and his partner Eris, a Hieral Menace, who are Artifacts that can turn into humans. Rahl, who is now a Highlander and the ambassador from Highland, kills a noble for stopping him from forcing a female knight to sleep with him and threatens Lord Bilford if he doesn't get what he wants. Chris is able to diffuse situation by taking the knight's place, with everyone unaware she plans to fight Rahl. However, Eris tries to stop Chris, leading to a fight between the two. Excited to find a powerful opponent, Chris prepare to use her powers only for Eris to let her go after realizing Chris is strong enough to protect herself. As Chris begs Eris to continue their fight, Eris is suddenly attacked by Sir Leon.\n}}\n| ShortSummary        = Sir Leon reveals he has joined the anti-Highland group, the Steelblood Front, having enough of the Highlanders mistreating the surface people and having a monopoly on Artifacts. He tries to kidnap Eris for the Steelblood Front so they can make their own Hieral Menace, but is stop by Chris, although they are both confused by her love of fighting. Suddenly Rani, who went to confront Rahl, is seen jumping out the window after Rahl has turned into Magicite beast due to Leon using Prismer powder on him as punishment. Chris manages to save her as Leon makes his escape. To prevent Rahl's rampage, Chris and Eris kick the beast out to outskirts of the city where Chris uses her secret technique, Aether Strike, to kill the monster. Eris leaves and agrees to keep Chris's powers a secret. Years later, Chris and Rani, now fifteen, leave their home to join the royal academy in the capital to become knights. While resting at the city of Nova, Chris and Rani work with the local lord, Lady Cyrene, a Highlander beloved by the people for improving their lives after taking over the city. However, she has fired many corrupt knights who later became bandits led by their leader, Hawk. Cyrene, her soldiers, along with Chris and Rani head to the bandits hideout to arrest them, only to discover they have a Hieral Menace in their ranks.\n}}\nが支配する街\n| NativeTitleLangCode = ja\n| DirectedBy          = Kyōhei Suzuki\n| WrittenBy           = Mitsutaka Hirota\n| Aux2                = Naoyuki Kuzuya\n| OriginalAirDate     =\n| ShortSummary        = While Rani and Lady Cyrene forces fight the bandits, Chris faces the Hieral Menace, Sistia Rouge, who is a member of the Steelblood Front. Chris enjoys her fight with Sistia, but is forced to let her escape after the latter takes Rani hostage, all while maintaining her confidence. After capturing the bandits, Cyrene thanks Chris and Rani and reveals a secret under the city of Nova. Cyrene reveals the Highlanders have secretly put a magic circle under the land in order to turn it into a floating island under their control. Cyrene is opposed to this plan since the people of Nova are either force to leave or made into slaves of the Highlanders, and is willing to fight her people to ensure the inhabitants be treated as equals, which moves Rani. Later that night, Cyrene turns into a Magicite beast after being poisoned by her maid who wanted revenge against the Highlands for killing her son, but she is suddenly killed by Cyrene. To stop Cyrene's rampage, Chris and Rani reluctantly join forces with Sistia and the leader of the Steelblood Front, a black mask man, who also possessed Aether just like Chris; they are displeased with the maid for using Prismer against their wishes. Although Sistia and Black Mask want to kill Cyrene, Chris opposes this and wants to instead help her. Together, Chris freezes Cyrene in ice while Black Mask use his power to shrink her and remove the Prismer in her body. After saving Cyrene, Chris and Rani leave Nova, which Black Mask promises them the Steelblood Front will protect the people and remove the magic circle. As they head to the Knight Academy, Cyrene, who has become a small harmless creature named Rene, joins them which Chris promises to one day find a cure to turn her back to normal.\n}}\n| ShortSummary        = While visiting the city of Ahlemin where a frozen corpse of a giant Magicite beast is held, Chris and Rani help the city's defenders when a horde of Magicite beasts attack the city. With the help of another Knight Academy student Leone Olfa, Chris and Rani are able to easily defeat the horde. Despite Leone's help, much to Chris and Rani's anger, the defenders refuse to reward Leone and called her untrustworthy instead as she is revealed to be Sir Leon's younger sister. Rafael and his Hieral Menace partner, Ripple, who have come to transport the frozen Magicite corpse to another safer location, explain to Chris and Rani due to Sir Leon turning traitor and joining the Steelblood Front, the Olfa family are discriminated by the public as traitors despite the family being innocent. Leone wants to join the Knight Academy to not only redeem her family's honor, but also arrest her brother. Later, Chris and her friends arrived at the Royal capital and attend the Knight Academy's opening ceremony. On the students first day, Principal Miriela hold a test for the students where they must escape her Golems, which Chris wins after learning the winner gets free food for a month. Later that night at the dorms, a student named Liselotte Arcia refuses to have Leone as her roommate which Chris and Rani defend her and have Leone as their roommate instead. As they go to sleep, Leone thanks Chris and Rani for being her friends and not judging her for her brother's action.\n}}\n| ShortSummary        = Chris, Rani and Leone, along with their new friends, exchange students Lathi and Pullum, attend a lesson by one of their teachers on how to learn to use flying vehicles called Flygears, where Chris shows talent in flying. As the students continue their lessons, Miriela chooses Chris, Rani, Leone, Liselotte, and Pullum, who are the top students in their year, to take a special test which they must escape from the Labyrinth of Ordeals dimension in a limited time while testing both their physical and mental skills. Within the labyrinth, Chris meets apparitions of her past memories including those from her previous life, which she easily defeat before blasting a hole in the labyrinth's roof. Later, Chris encounters Liselotte, who admits she was too harsh on judging Leone and helps Chris escape using her Artifact. They soon help Leone face her apparitions, which Liselotte apologizes to Leone for her previous behavior. In the end, Chris, Rani, Leone and Liselotte pass the test. In celebration for passing and Liselotte finally accepting Leone as her roommate, the girls have a small party.\n}}\nの病\n| NativeTitleLangCode = ja\n| DirectedBy          = Tomio Yamauchi\n| WrittenBy           = Daisuke Tazawa\n| Aux2                = Naoyuki Kuzuya\n| OriginalAirDate     =\n| ShortSummary        = Chris, Rani, Leone, Liselotte and Miriela are invited to attend a party welcoming the new Highland Ambassador, Sir Theodore, Lady Cyrene's brother. While shopping for gowns, Chris and the others witness Eris and Ripple fighting teleporting Magicite beasts, which Ripple has become sicker since the beasts appearances. At the party where they are reunited with Rafael, more Magicite beasts teleport and attack, forcing everyone to fight them. After dealing with the threat, Chris and the others discover Ripple is the cause of the teleporting Magicite beasts. Theodore believes this is the work of a faction of Highlanders who oppose helping the surface people and cause Ripple's body to summon Magicite beasts as a trump card against the pro-surface Highlanders. Wanting to help Ripple and fight more Magicite beasts, Chris convinces Prince Wayne to allow Ripple to stay at the Knight's Academy so Miriela can cure her condition. Theodore also learns of what happened to his sister, but seeing that she will not accept his help, he realizes that his sister is not the same as she once was.\n}}\n| ShortSummary        = To deal with the Magicite beasts summoned by Ripple, Miriela gathers the best students in the Academy which includes third year student Silva Ayren and second year student Yua. However, Silva is proud and arrogant, and looks down on Chris and Leone for being a Runeless and a traitor's sister respectively while Yua has hard time remembering names. After dealing with the Magicite beasts, Ripple agrees to a one on one match between Chris set in another dimension. Ripple at first has the advantage due to possessing guns as her Artifact before Chris defeats her by getting close to her. Miriela and Theodore figures out what causes Ripple to summon Magicite beasts; every time she touches a special Rune artifact, Ripple accidentally sucks mana, which enough mana causes the portals to appear. Not soon after this revelation, Ripple faints and summons a giant Magicite beast at the Academy.\n}}\n| NativeTitleLangCode = ja\n| DirectedBy          = Fumio Maezono\n| WrittenBy           = Daisuke Tazawa\n| Aux2                = Kazuo Miyake\n| OriginalAirDate     =\n| ShortSummary        = Chris kicks the giant Magicite beast into the air, which is then killed by a passing Yua. Now knowing what causes Ripple's condition, Chris and the others vow to protect her carefully. Two weeks later, Chris is bored that there are no Magicite beasts for her to fight and fails to get a duel with Yua. As Rani receives a new artifact from Theodore that allows her to heal, Silva is seriously injured protecting Lathi and Pullum from a Magicite beast. Using her new artifact and Chris's mana, Rani heals Silva's wounds, which the latter thanks them and apologizes for his past behavior. Miriela receives word that the Royal Guard want Ripple under their custody as they plan to exchange her with the Highlanders for another Hieral Menace, which Miriela opposes. While on patrol, Leone and Liselotte discover Leon, Sistia, and Black Mask are in the city.\n}}\n襲撃計画\n| NativeTitleLangCode = ja\n| DirectedBy          = Sayaka TsujiLee Kisup\n| WrittenBy           = Daisuke Tazawa\n| Aux2                = Naoyuki Kuzuya\n| OriginalAirDate     =\n| ShortSummary        = Black Mask stops the fight between Leone and Leon and reveals to Liselotte that King Carlias plans to get a new Hieral Menace with the Highlanders in exchange for Ripple and the city Ahlemin, hoping this information might convince the Knight Academy to let Steelblood Front attack the Highlander ambassador. They then leave after the explanation. With this new information, Miriela forms a plan where Chris and Rani sneak during the upcoming meeting with the Highlanders as maids to protect the ambassador while everyone in the Academy will force out all of the Magicite beasts inside of Ripple so she can no longer summon them again. Silva agrees to the plan as he wishes to repay Ripple for saving him in the past. During the party welcoming the Highland Ambassador, Ivel the Archlord, the young boy insults King Carlias and his entourage, which the king endures for the sake of his kingdom. When a Steelblood assassin fails to kill Ivel, Ivel demands Carlias' arm as compensation or his Kingdom will be destroyed. Chris takes Carlias's place and tells Ivel to attack her instead. Much to Ivel's confusion, Chris is able to withstand all of his magic attacks until the Steelblood Front attack the city in their airship.\n}}\n| ShortSummary        = Ivel reveals he never intended to give the kingdom a new Hieral Menace as the whole meeting was a setup to trick the Steelblood Front into coming so he can finally finish them off. Angered that he and his people suffered for nothing, Carlias allows Chris to arrest Ivel, which she accidentally kicks him into the air. Nevertheless, Chris and Rani fly to the Steelblood airship while the people are being evacuated. As Chris fight Black Mask, Miriela and the Knight Academy students are getting tired fighting the Magicite beasts summoned by Ripple until they are saved by Leon, who heals their wounds and help them fight. Back at the airship, Ivel arrives to finish off Black Mask, to which Black Mask has Sistia turned into her weapon form. As Chris gets excited for a three-way battle between her, Ivel, and Black Mask, a Kaiju Magicite beast is summoned by Ripple.\n}}\n| ShortSummary        = With three opponents on her hands, Chris is unsure of who to fight, but Rani tries to convince her to return to the academy. Ivel tries to fight Black Mask himself, only for Black Mask to easily defeat him. With that done, Black Mask has completed his mission in killing the arch lord and taking control of his battleship. He and Sistia prepare to leave, but they also provide Chris and Rani a flying vehicle to help them get back to the academy, although Chris is disappointed that they didn't get to finish their fight and hopes to face them again soon. Meanwhile, Ripple is finally cured of her condition, but the Magicite beast proves to be too powerful. It manages to capture Yua, but Miriela creates a force field around her to prevent her from being absorbed. Silva forcefully turns Ripple into her weapon form to defeat the monster himself, despite Leon warning him of the dire consequences. Chris arrives just in time to stop Silva before he can attack. Following a violent battle, Chris manages to kill the Magicite beast and rescue Yua. With the threat now over, Leon leaves. Chris and Rani are dismayed that they can't celebrate with a meal due to the academy being destroyed during the battle. As the students and staff rebuild the academy, Chris and Rani visit Carlias, who offers Chris to be the head of the Royal Knights, but she declines, not wanting to leave Rani. Although shocked at first, Carlias respects her decision and instead rewards her and Rani with a large feast.\n}}\n}}\nGame\nReborn to Master the Blade: Bravery Road is a browser game released in early 2023 on the G123 platform in multiple languages. The game was based on the light novel series Reborn to Master the Blade: From Hero-King to Extraordinary Squire.\nNotes\nReferences\nExternal links\n*  at Shōsetsuka ni Narō\n*\n*\n*\n*"
    }
  ]
}