{
  "content": [
    {
      "type": "text",
      "text": "# Reckingen-Gluringen\n\n| postal_code\t\t= 3998\n| municipality_code\t= 6075\n| area\t\t\t= 41.2\n| elevation\t\t= 1316|elevation_description=\n| population\t\t= 550|populationof = December 2002 | popofyear = 2002\n| website\t\t= www.gemeinde-goms.ch\n| mayor                = Norbert Carlen |mayor_asof=|mayor_party=\n| mayor_title\t= |list_of_mayors\t=\n| places\t\t=\n| demonym\t\t=\n| neighboring_municipalities= Binn, Ernen, Fieschertal, Formazza (IT-VB), Grafschaft, Münster-Geschinen, Ulrichen\n| twintowns\t\t=\n|}}\nReckingen-Gluringen is a former municipality in the district of Goms in the canton of Valais in Switzerland. It was formed in 2004 from the union of the villages and municipalities of Reckingen and Gluringen. On 1 January 2017 the former municipalities of Reckingen-Gluringen, Blitzingen, Grafschaft, Münster-Geschinen and Niederwald merged into the new municipality of Goms.\nHistory\nReckingen is first mentioned in 1225 as Requinguen.  Gluringen is first mentioned in 1203 as Gluringen. Joseph Biner (1697–1766), a Roman Catholic canonist, historian, and theologian was born in Gluringen.\nGeography\nReckingen-Gluringen has an area, , of .  Of this area, 27.6% is used for agricultural purposes, while 19.4% is forested.  Of the rest of the land, 1.2% is settled (buildings or roads) and 51.8% is unproductive land.\nReckingen lies on both sides of the Rhone river.  It consists of three loosely interconnected settlements.  Gluringen is on the north flank of the Rhone valley.\nDemographics\nReckingen-Gluringen has a population (|lc=on}}) of .  , 6.9% of the population are resident foreign nationals.  Over the last 10 years (1999–2009 ) the population has changed at a rate of -13.9%.  It has changed at a rate of -7.4% due to migration and at a rate of -3.3% due to births and deaths.\n, the gender distribution of the population was 50.1% male and 49.9% female.  The population was made up of 228 Swiss men (46.4% of the population) and 18 (3.7%) non-Swiss men.  There were 230 Swiss women (46.8%) and 15 (3.1%) non-Swiss women.\nThe age distribution of the population () is children and teenagers (0–19 years old) make up 25.9% of the population, while adults (20–64 years old) make up 56.1% and seniors (over 64 years old) make up 18%.\nReckingen demographics\nMost of the population, in Reckingen  speaks German (344 or 96.6%) as their first language, French is the second most common (4 or 1.1%) and Serbo-Croatian is the third (3 or 0.8%).\nOf the population in the municipality 210 or about 59.0% were born in Reckingen and lived there in 2000.  There were 92 or 25.8% who were born in the same canton, while 20 or 5.6% were born somewhere else in Switzerland, and 25 or 7.0% were born outside of Switzerland.\n, there were 144 people who were single and never married in the municipality.  There were 173 married individuals, 30 widows or widowers and 9 individuals who are divorced.\nThere were 37 households that consist of only one person and 11 households with five or more people.  Out of a total of 139 households that answered this question, 26.6% were households made up of just one person and there were 5 adults who lived with their parents.  Of the rest of the households, there are 29 married couples without children, 53 married couples with children  There were 8 single parents with a child or children.  There were 3 households that were made up of unrelated people and 4 households that were made up of some sort of institution or another collective housing.\nthere were 100 single family homes (or 47.2% of the total) out of a total of 212 inhabited buildings.  There were 82 multi-family buildings (38.7%), along with 16 multi-purpose buildings that were mostly used for housing (7.5%) and 14 other use buildings (commercial or industrial) that also had some housing (6.6%).\n, a total of 133 apartments (38.7% of the total) were permanently occupied, while 198 apartments (57.6%) were seasonally occupied and 13 apartments (3.8%) were empty.\nGluringen demographics\nMost of the population, in Gluringen , speaks German (150 or 93.2%) as their first language, Serbo-Croatian is the second most common (6 or 3.7%) and Portuguese is the third (4 or 2.5%).\nOf the population in the municipality 81 or about 50.3% were born in Gluringen and lived there in 2000.  There were 45 or 28.0% who were born in the same canton, while 18 or 11.2% were born somewhere else in Switzerland, and 15 or 9.3% were born outside of Switzerland.\n, there were 63 people who were single and never married in the municipality.  There were 81 married individuals, 12 widows or widowers and 5 individuals who are divorced.\nThere were 12 households that consist of only one person and 6 households with five or more people.  Out of a total of 62 households that answered this question, 19.4% were households made up of just one person and there was 1 adult who lived with their parents.  Of the rest of the households, there are 16 married couples without children, 25 married couples with children  There was one single parent with a child or children.  There were 2 households that were made up of unrelated people and 5 households that were made up of some sort of institution or another collective housing.\nthere were 23 single family homes (or 37.1% of the total) out of a total of 62 inhabited buildings.  There were 29 multi-family buildings (46.8%), along with 3 multi-purpose buildings that were mostly used for housing (4.8%) and 7 other use buildings (commercial or industrial) that also had some housing (11.3%).\n, a total of 55 apartments (46.6% of the total) were permanently occupied, while 54 apartments (45.8%) were seasonally occupied and 9 apartments (7.6%) were empty.\nHistoric Population\nThe historical population is given in the following chart:\nColors=\nid:lightgrey value:gray(0.9)\nid:darkgrey  value:gray(0.8)\nImageSize  = width:1100 height:500\nPlotArea   = height:350 left:100 bottom:90 right:100\nLegend     = columns:3 left:220 top:70 columnwidth:160\nAlignBars  = justify\nDateFormat = x.y\nPeriod     = from:0 till:560\nTimeAxis   = orientation:vertical\nAlignBars  = justify\nScaleMajor = gridcolor:darkgrey increment:100 start:0\nScaleMinor = gridcolor:lightgrey increment:20 start:0\nColors=\nid:RE     value:yellowgreen      legend:Reckingen\nid:GL     value:green          legend:Gluringen\nPlotData=\ncolor:yellowgreen width:30   mark:(line,white) align:center\nbar:1850 from: 0 till:342 text:\"342\" color:RE\nbar:1860 from: 0 till:344 text:\"344\" color:RE\nbar:1870 from: 0 till:343 text:\"343\" color:RE\nbar:1880 from: 0 till:322 text:\"322\" color:RE\nbar:1890 from: 0 till:333 text:\"333\" color:RE\nbar:1900 from: 0 till:314 text:\"314\" color:RE\nbar:1910 from: 0 till:303 text:\"303\" color:RE\nbar:1920 from: 0 till:311 text:\"311\" color:RE\nbar:1930 from: 0 till:414 text:\"414\" color:RE\nbar:1940 from: 0 till:360 text:\"360\" color:RE\nbar:1950 from: 0 till:365 text:\"365\" color:RE\nbar:1960 from: 0 till:410 text:\"410\" color:RE\nbar:1970 from: 0 till:345 text:\"345\" color:RE\nbar:1980 from: 0 till:350 text:\"350\" color:RE\nbar:1990 from: 0 till:355 text:\"355\" color:RE\nbar:2000 from: 0 till:356 text:\"356\" color:RE\nbar:1850 from: 342 till:468 text:\"126\" color:GL\nbar:1860 from: 344 till:479 text:\"135\" color:GL\nbar:1870 from: 343 till:475 text:\"132\" color:GL\nbar:1880 from: 322 till:430 text:\"108\" color:GL\nbar:1890 from: 333 till:439 text:\"106\" color:GL\nbar:1900 from: 314 till:427 text:\"113\" color:GL\nbar:1910 from: 303 till:421 text:\"118\" color:GL\nbar:1920 from: 311 till:424 text:\"113\" color:GL\nbar:1930 from: 414 till:527 text:\"113\" color:GL\nbar:1940 from: 360 till:473 text:\"113\" color:GL\nbar:1950 from: 365 till:495 text:\"130\" color:GL\nbar:1960 from: 410 till:557 text:\"147\" color:GL\nbar:1970 from: 345 till:475 text:\"130\" color:GL\nbar:1980 from: 350 till:481 text:\"131\" color:GL\nbar:1990 from: 355 till:513 text:\"158\" color:GL\nbar:2000 from: 356 till:517 text:\"161\" color:GL\nHeritage sites of national significance\nThe Church of Mariä Geburt is listed as a Swiss heritage site of national significance.  Both the villages of Gluringen and Reckingen are part of the Inventory of Swiss Heritage Sites.\nPolitics\nIn the 2007 federal election the most popular party was the CVP which received 71.36% of the vote.  The next three most popular parties were the SVP (12.45%), the SP (9.06%) and the FDP (5.74%).  In the federal election, a total of 247 votes were cast, and the voter turnout was 58.9%.\nIn the 2009 Conseil d'État/Staatsrat election a total of 215 votes were cast, of which 30 or about 14.0% were invalid.  The voter participation was 53.8%, which is similar to the cantonal average of 54.67%.  In the 2007 Swiss Council of States election a total of 241 votes were cast, of which 6 or about 2.5% were invalid.  The voter participation was 60.0%, which is similar to the cantonal average of 59.88%.\nEconomy\n, Reckingen-Gluringen had an unemployment rate of 1.8%.  , there were 25 people employed in the primary economic sector and about 15 businesses involved in this sector.  29 people were employed in the secondary sector and there were 11 businesses in this sector.  104 people were employed in the tertiary sector, with 21 businesses in this sector.\nthe total number of full-time equivalent jobs was 121.  The number of jobs in the primary sector was 16, all of which were in agriculture.  The number of jobs in the secondary sector was 22 of which 9 or (40.9%) were in manufacturing and 13 (59.1%) were in construction.  The number of jobs in the tertiary sector was 83.  In the tertiary sector; 16 or 19.3% were in wholesale or retail sales or the repair of motor vehicles, 3 or 3.6% were in the movement and storage of goods, 49 or 59.0% were in a hotel or restaurant, 6 or 7.2% were the insurance or financial industry, 4 or 4.8% were technical professionals or scientists.\nOf the working population, 7.7% used public transportation to get to work, and 42.7% used a private car.\nThere were 155 residents of Reckingen who were employed in some capacity, of which females made up 43.9% of the workforce.  , there were 89 workers who commuted into the municipality and 75 workers who commuted away.  The municipality is a net importer of workers, with about 1.2 workers entering the municipality for every one leaving.\nThere were 79 residents of Gluringen who were employed in some capacity, of which females made up 40.5% of the workforce.  , there were 25 workers who commuted into the municipality and 22 workers who commuted away.  The municipality is a net importer of workers, with about 1.1 workers entering the municipality for every one leaving.\nReligion\nFrom the  in Reckingen, 327 or 91.9% were Roman Catholic, while 8 or 2.2% belonged to the Swiss Reformed Church.  Of the rest of the population, there were 3 members of an Orthodox church (or about 0.84% of the population).  There were 7 (or about 1.97% of the population) who were Islamic.  6 (or about 1.69% of the population) belonged to no church, are agnostic or atheist, and 5 individuals (or about 1.40% of the population) did not answer the question.\nIn Gluringen, 142 or 88.2% were Roman Catholic, while 10 or 6.2% belonged to the Swiss Reformed Church.  Of the rest of the population, there were 6 members of an Orthodox church (or about 3.73% of the population), and there was 1 individual who belongs to another Christian church.  1 (or about 0.62% of the population) belonged to no church, are agnostic or atheist, and 1 individuals (or about 0.62% of the population) did not answer the question.\nEducation\nIn Reckingen about 129 or (36.2%) of the population have completed non-mandatory upper secondary education, and 20 or (5.6%) have completed additional higher education (either university or a Fachhochschule).  Of the 20 who completed tertiary schooling, 75.0% were Swiss men, 15.0% were Swiss women.\n, there were 13 students in Reckingen who came from another municipality, while 41 residents attended schools outside the municipality.\nIn Gluringen about 55 or (34.2%) of the population have completed non-mandatory upper secondary education, and 9 or (5.6%) have completed additional higher education (either university or a Fachhochschule).  Of the 9 who completed tertiary schooling, 55.6% were Swiss men, 11.1% were Swiss women.\n, there were 2 students in Gluringen who came from another municipality, while 18 residents attended schools outside the municipality.\nReferences\nExternal links\n* [http://www.reckingen-gluringen.ch Official website]\n*\n*\n*"
    }
  ]
}