{
  "content": [
    {
      "type": "text",
      "text": "# Reconquest of Jubaland\n\nThe Somali Reconquest of Jubaland, or Conquest of Jubaland, or The Darood Invasion refers to the numerous military engagements between the various southern Somali clans, and the Oromo people in the regions that are now the State of Jubaland, in Somalia, and the Northern Frontier District (NFD) of Kenya. The Reconquest of Jubaland began after Oromos invaded and occupied  Somali territories to the south of the Juba river in the 16th and 17th centuries at the dawn of the Oromo invasions. Prior to this the Garre, Tunni, Ajuuraan, alongside various other native Somali clans inhabited and ruled the NFD.\n| commander2        = Unknown\n| units1            =\n| units2            =\n| strength1         =\n| strength2         =\n| casualties1       = Minimal\n| casualties2       = Heavy casualties\n}}\nBackground\nDuring the Oromo Expansions, Oromos  invaded and occupied numerous Somali clans in Jubaland and the Northern Frontier District for approximately over a century.\nIn 1819–23, Sheikh Ibrahim Hassan and his companions founded the fortified town of Bardheere. In the early 19th century the Sheikh of the town launched a Jihad against the Oromos to reclaim the lands they had taken previously. This would be the start of a reconquest spanning a century, where with the addition of the migrating Daroods from the Ogaadeen, Marexan, and Aulihan clans, would ally with the Somalis in NFD, winning numerous campaigns, battles, skirmishes, and victories. Which secured the NFD and Jubaland, restored land which belonged to the Somali clans prior to the Oromo invasions, alongside pushing the Oromos out of southern Somalia, and back towards the Tana river in Kenya.\nHistory\nDarood migrations into Jubaland\nDaroods from the Ogaden, particularly belonging to the Marexan and Ogaden sub clans, started migrating to the Shabelle river in the early part of the eighteenth century, but the already established Hawiye and the Rahanweyn conflicted with them and didn’t allow easy settlement. It was not until towards the late 18th century that the Rer Abdille of the Ogaden clan had managed to get a lodgment on the shabelle river. In 1780, the Ogaden and Marexan succeeded in establishing themselves on the middle reaches of the Shebelle,  from this stronghold they were able to expedition  further towards the south. But they never achieved their aim of occupying the Baidoa Plateau. The local Rahanweyn clan, in particular the Eelay, fiercely resisted them and were able to keep the invaders out.\nMany of these Ogaden families in particular the Telemuggeh, entered into a shegat relationship with the Eelay, for around  twenty years they lived in this subordinate position around Buur Hakaba on the south-eastern corner of the Baidoa Plateau. It was here that Abdi Ibrahim, of the Ogaden clan was born, he would soon lead various invasions further into Oromo territory.\nBetween 1840 and 1850 the Ogaden attempted to reverse the relationship that existed between the Eelay and themselves; they had gained strength and wealth during their stay at Buur Hakaba, and felt confident of being able to defeat their hosts and to take over the extensive grazing areas which at that time were commanded by the tribe. The Eelay, however, were too powerful; and, after a fierce fight near Maddagoi at which the Ogaden were defeated, the group of ner abuille, Telemuggen, maghabul, and aulihan, together with those who had become shegat to them, were compelled to extricate themselves as best they could. They could not go to the west, for the middle Juba was closed to them by the Rahanweyns who at this time were still a force to be reckoned with in 1838.\nCulture\nA journal published by Virginia Tech, referencing IM Lewis respectively stated of colonial-era Jubaland of the post reconquest era was wholly Darod-inhabited: \"the Darod clan of the Samaale who are virtually the sole Somali occupants of Jubaland\", and \"While Somalis from other clans could be found within BEAP and across the Jubba River in Italian Somaliland, Jubaland province was almost exclusively populated by the Darod.\" Arthur Henry Hardinge and Catherine Besteman stated respectively that Darod Somalis in precolonial Jubaland were an aggressive society that revoked one's Somali status unless they appeared \"on the battlefield\" or \"bloodied their spears\", and that by the 19th century, \"Darod Somalis had successfully conquered the territory that was to later become Jubaland province\".\nHerbert, Turton and Castagno, characterized the Darod reconquest as \"Darod Somalis slowly expanding westward  in a nearly continuous migration since the 1600s\".\nSee also\n* Jubaland\n* Oromo invasions\nReferences"
    }
  ]
}