{
  "content": [
    {
      "type": "text",
      "text": "# Recording of the Israeli Declaration of Independence\n\nThe recording of the Israeli Declaration of Independence was a complete recording of the declaration using a direct to disc recording technique on acetate discs using special cutting machines. Neither the original records nor their duplicates were demanded by Israel state authorities and to date they cannot be located, except for one original acetate disc. However, copies of the recording itself survived on different media.\nThe \"Tslil\" Recording Company\n\"Tslil - Palestine Electrical Recording Company Ltd.\" was founded in early 1947 in Tel Aviv and specialized in recording and marketing of commercial records of music of Israel and classical music. \"Tslil\" records were also played by \"Kol Yerushalayim\" (The Voice of Jerusalem), the Hebrew station of the Palestine Broadcasting Service of the British Mandate administration.\nIn April 1948, a few weeks prior to the Declaration of Independence, Lucien Salzman of \"Tslil\" recorded the Israel Philharmonic Orchestra playing the \"Hatikvah\" national anthem at the \"Ohel Shem\" hall in Tel Aviv, a recording that was later used for many years by \"Kol Yisrael\" (The Voice of Israel), notably as the closing tone of the broadcasts at midnight, as well as by Israel embassies all over the world.\nThe Recording of the Ceremony\nThe declaration ceremony was held at the Tel Aviv Museum on Friday, 14 May 1948 at 16:00 and the recording was performed by Lucien Salzman from \"Tslil - Israeli Electrical Recording Company Ltd.\". The official invitation to perform the recording was issued by Karel Salmon from Kol Yisrael on behalf of Mendel Mahler-Kalkstein, the Secretary-General of the Palestine Philharmonic Orchestra, that was invited to play the Hatikvah national anthem by an undersized ensemble of 30 of its players. Presenting a certificate issued by the provisional government, Minhelet HaAm, Lucien Salzman entered the museum building with two assistants, his nephew Giora Hanoch and Fedor Shanon. They installed the two disc cutting machines and the amplifiers in a small room on the second floor and placed two identical microphones (model Shure 701D) on the presidential table. One of the microphones was wrapped with a white ribbon bearing the Tslil company name in Hebrew (צליל).\nThe direct to disc recording was made on double-sided 30-cm discs turning at 78 rpm that allowed a recording time of about 3 minutes only. At the end of the recording of a disc on one cutting machine the recording was switched to another disc on the other machine and vice versa. Therefore, the recording of the entire 33-minute ceremony yielded 11 sides on 6 records. The recording ends with the \"Hatikvah\" national anthem played by the Israel Philharmonic Orchestra followed by the concluding statement of David Ben Gurion: \"The State of Israel is established! This meeting is adjourned!\"\nThe Whereabouts of the records\nThe \"Tslil\" recording company handed over to the Israeli Philharmonic Orchestra (IPO) the original records as well as several duplicate sets thereof. The IPO tried to convince the then leading record companies in the United States, Columbia and Victor, in the commercial value of the historic recording, apparently to no avail. After \"Tslil\" ceased its operation in 1951 Lucien Salzman kept one duplicate set at his home.\nOnly in 1981, during a research conducted for the Pillar of Fire documentary television series, the records reemerged and the recording was transferred to 1/4-inch magnetic tapes at the \"Kol Yisrael\" studio. Several segments of the recording were used in the last episode of the series. In the late 1980s Lucien Salzman donated the records to the Israel Broadcasting Authority but the whereabouts of these records is still unknown. Only one of the six original records survived and is in the archives of the Israel Philharmonic Orchestra (see picture).\nThe Recording of the Radio Broadcast\nIn addition to the recording of Lucien Salzman from \"Tslil\" there is also a recording of the live radio broadcast of the ceremony transmitted by \"Kol Yisrael\". This recording begins with the words (in Hebrew): \"Here is the Voice of Israel! Here is the Voice of Israel!\" in the voice of Mordechai Zlotnik (later Avida) who together with his colleague Rita Persits broadcast the ceremony.\nTwo double-sided 33⅓ rpm LP records with the recording of the radio broadcast are at the Israel State Archive but their origins or the identity of those who performed the recording are not known. At the Israel State Archive there is also a CD (Compact Disc) with exactly the same recording of the radio broadcast of the ceremony, related to Hans and Ralf Hellinger from the \"Radio Doctor\" company in Tel Aviv.\nReferences\nSources\n*\nExternal links\n* [https://www.youtube.com/user/israelarchive#p/f/13/BG95PmoeAkM The first part of the recording, David Ben Gurion reading the Declaration of Independence (in Hebrew), in a film of Israel State Archives on YouTube]\n* [https://www.knesset.gov.il/docs/eng/megilat_eng.htm The first part of the recording, David Ben Gurion reading the Declaration of Independence (in Hebrew), on the Knesset site]\n* [http://www.ipo.co.il/eng/About/History/.aspx The Israel Philharmonic Orchestra]\n* [https://web.archive.org/web/20160401190652/http://www.archives.gov.il/ArchiveGov_eng Israel State Archives]"
    }
  ]
}