{
  "content": [
    {
      "type": "text",
      "text": "# Reconquest of New Netherland\n\n| date              = 30 July 1673 (O.S.)9 August 1673 (N.S.)\n| place             = Present day New York City\n| coordinates       =\n| map_type          =\n| map_relief        =\n| map_size          =\n| map_marksize      =\n| map_caption       =\n| map_label         =\n| territory         =\n| result            = Dutch victory\n* Dutch recapture of New Netherland\n| status            =\n| combatants_header =\n| combatant1        =\n| combatant2        =\n| commander1        =  Cornelis Evertsen the Youngest Anthony Colve Jacob Binckes\n| commander2        =  John Manning\n| units1            =\n| units2            =\n| units3            =\n| strength1         = 9 ships600 men\n| strength2         = 100 soldiers, and fortifications of Fort James\n| strength3         =\n| casualties1       = None\n| casualties2       = 100 prisoners, deaths unknown.\n| casualties3       =\n| notes             =\n| campaignbox       =\n}}\nOn 9 August 1673 (N.S.; 30 July 1673 (O.S.)), during the Third Anglo-Dutch War (which was part of the Franco-Dutch War) a combined Dutch fleet commanded by Cornelis Evertsen the Youngest of the Admiralty of Zeeland and Jacob Binckes of the Admiralty of Amsterdam recaptured New York, which had been English since the Peace of Breda of 1667. The town of New York was re-christened \"New Orange\" and New Netherland was re-established as a Dutch colony under governor-general Anthony Colve. The Dutch Republic, however, returned the colony to English rule under the Treaty of Westminster (1674), in exchange for the colony of Suriname, which eventually led to the replacement of governor Colve by governor Edmund Andros on 10 November 1674 (N.S.)\nBackground\nBefore the Second Anglo-Dutch War had even started an English fleet took over the colony New Netherland of the Dutch West India Company in 1664 in a bloodless coup in the name of the Duke of York. The colony was renamed New York, and the town of New Amsterdam was given the same name. This situation was left in place in the Peace of Breda of 1667. After the Third Anglo-Dutch War broke out in 1672 the Dutch Republic embarked on a commerce raiding style of naval warfare with England and France outside Europe, while in the European theater the main Dutch fleet under admiral Michiel de Ruyter successfully followed a \"fleet-in-being strategy\" to keep the combined English and French fleets at bay, to prevent a seaborne invasion of the Dutch mainland. Several naval expeditions were launched by the Dutch, among which an ambitious secret design by the Admiralty of Zeeland, set up by the Zeeland Grand Pensionary Pieter de Huybert and his nephew Justus de Huybert, who was the secretary of the Admiralty Board of Zeeland. This naval expedition, commanded by Cornelis Evertsen, was not very successful at first, but when the Zeeland squadron met the squadron of Jacob Binckes, sent out with a similar objective by one of the Holland admiralties, near Guadeloupe, the two commanders decided to join forces (and to form a joint command). They knew that the tobacco fleet of the Colony of Virginia and the Province of Maryland would soon depart for the English Motherland, and they therefore decided to make an attempt to repeat the feat accomplished by Abraham Crijnssen in 1667, who in the Battle of The James River (1667) had managed to capture that fleet. This led to the Second Battle of the James River (1673) in July 1673. After the battle the two commanders received intelligence that New York was only weakly defended and that the governor, Francis Lovelace happened to be absent. They therefore decided opportunistically to make an attempt to recapture New Netherland, and sailed to Staten Island, where they arrived on 28 July 1673 (O.S).\nReconquest\nAfter the Dutch fleet of 21 ships (including prizes) arrived on the roadstead of Staten Island, a number of small boats with Dutch colonists aboard soon approached Evertsen's flagship Swaenenburgh. They brought him the latest news about the situation in New York, confirming the intelligence the Dutch commanders had previously received about the absence of governor Lovelace and the unreadiness of Fort James. The fort was commanded by captain John Manning. It had a garrison of about 100 men, and it would take them around four days to rally an additional 300–400 men to defend it. The Dutch were now convinced that they could recapture it. A council of war was held on how to attack it and when. The Dutch colonists were afraid that the rest of the Dutch population were neutral and would not support them. So the Council decided to draft a proclamation to the inhabitants of New York to assure them that they would be unharmed if they agreed to submit again to the States General of the Netherlands This proclamation was issued in the evening of 8 August 1673 (N.S.).\nMeanwhile the Dutch ships had been discovered by the English and a strong guard was set at the fort and beacons were fired to warn those who still did not know. On the morning of 9 August (N.S.), everyone was prepared, and rumours were rampant. All of the soldiers were hoping for reinforcements from governor Lovelace. The Dutch fleet waited patiently for the flood. A force of 600 marines and sailors were selected for the assault on Manhattan Island. But first the commanders sent a demand for surrender to Fort James. Captain Manning then sent three parlimentaires, one, Thomas Lovelace, a brother of governor Lovelace, the other two by the names of John Carr and John Sharpe, to the Swaenenburgh. When the English parlimentaires demanded to see his commission. Evertsen huffily replied that \"his commission stuck in the muzzle of his guns, which they would soon discover if they did not surrender forthwith\".\nMeanwhile the wind had risen and was blowing landward so the Dutch ships weighed anchor and sailed toward the fort, where they again anchored in the Hudson River, under the ramparts of the fort, but outside the range of its guns. There was another exchange of messages with Manning by way of parlimentaire. It became clear that Manning was stalling, so the Dutch decided to break off the negotiations. They opened up on the fort with their ship's artillery, which fire was answered by the fort. The Dutch landing force was then sent ashore under the command of marine captain Anthony Colve somewhat north of the town, where Broadway Street (formerly Heerenstraat) began. The Dutch troops marched down that street toward the fort on the tip of the island while the Dutch colonists cheered them on, and several joined them. When they arrived before the fort captain Manning ran up a white flag and asked for honorable terms to surrender. He was granted the honors of war. The English troops consequently marched out of the gate, flags flying and drums beating, and laid down their arms in front of the fort. The Dutch troops then entered the fort and locked up the rank and file English soldiers in the Dutch Reformed Church within the fort; the English officers were left in possession of their own quarters. The next day all prisoners of war were transferred to the Dutch ships, as was governor Lovelace, after he asked for a safe conduct to negotiate with the Dutch commanders.\nAftermath\nThe Dutch commanders swiftly began to consolidate their conquest by sending out commissions to outlying settlements to demand submission to the new regime, and set up new local governments under the control of the new governor-general they appointed to rule the colony as the new Director of New Netherland. This was captain Anthony Colve. (They also sent out a small task force under captain Boes to harass the English fisheries near Newfoundland.) Colve was to rule the colony, while reinforcing its defenses in the expectation that an invasion from the surrounding English colonies in New England would be imminent. The town of New York was rechristened New Orange, while fort James would be known as Fort Willem Hendrick after the stadtholder. There were indeed diplomatic and military interactions with Connecticut and Massachusetts, while Maryland troops sacked the small Dutch settlement of Hoerenkil in the winter of 1673/74 and the spring of 1674. The Dutch also captured numerous English ships along the coastline. However, meanwhile in Europe, on the instigation of Spain, which had been neutral in the war with France, but was ready to join the Dutch in an alliance, provided the war with England were ended, the Peace of Westminster was concluded with the Court of St James's in February 1674. One of the provisions of the peace was that the Dutch Republic would give up New Netherland in exchange for Suriname. The news of this reached New Orange in May of 1674, and Colve started to make preparations for the required transfer of power, which eventually took place on 10 November 1674 (N.S.)\nNotes\nReferences\nSources\n*\n*"
    }
  ]
}