{
  "content": [
    {
      "type": "text",
      "text": "# Record of Lodoss War: Deedlit in Wonder Labyrinth\n\n| released = Microsoft WindowsPS4, PS5, Xbox One, Xbox Series X/SNintendo Switch\n| genre = Action role-playing, platform-adventure\n| modes = Single-player\n}}\n\"Lodoss Island War Chronicle: Deedlit in Wonder Labyrinth\"|lead=yes|group=lower-alpha}} is a 2021 action role-playing video game developed by Team Ladybug and co-published by Playism and Why so serious? (WSS Playground) for Microsoft Windows. Versions for Nintendo Switch, PlayStation 4, PlayStation 5, Xbox One, and Xbox Series X and Series S were also released. It is based on Ryo Mizunos Record of Lodoss War series, taking place before the events of The Crown of the Covenant. Controlling the high elf Deedlit, who finds herself in a strange interconnected labyrinth filled with her past foes and companions, the game focuses on exploration and searching for items and power-ups in the vein of Castlevania: Symphony of the Night, fighting bosses and minibosses. During gameplay, the player also locates two elemental spirits and swaps between each one.\nThe idea for Deedlit in Wonder Labyrinth came up when Playism was approached by an editor of the eponymous novels. Under Mizuno's supervision, Playism decided to go with the project after seeing that both the material and artwork of Team Ladybug went together. The game is inspired by Symphony of the Night and Ikaruga, while both levels and gameplay were designed to reflect its story concept around exploration. The title was first launched via Steam Early Access in March 2020 prior to the full version and received several updates through 2020 and 2021, which introduced new stages, gameplay adjustments and game modes. The game garnered mixed to positive reception from critics and has reportedly sold 100,000 copies as of April 2021.\nGameplay and premise\nDeedlit in Wonder Labyrinth is an action role-playing game similar to Castlevania: Symphony of the Night and Touhou Luna Nights that is part of the Record of Lodoss War series, taking place before the events of The Crown of the Covenant. The player controls the high elf Deedlit through a strange labyrinth filled with her past foes and companions, collecting items and magic, defeating enemies and bosses, and obtaining power-ups that allow the player to backtrack and reach previously inaccessible areas. As the player uncovers more of the labyrinth, a map is updated to show progress. Deedlit can find and use various weapon types, ranging from daggers to bows, with the latter also being used to solve environmental puzzles. The player can also sell collected weapons at an in-game shop run by the dwarf Ghim, a recurring character in Lodoss War.\nDuring gameplay, the player locates the wind spirit Sylph and the fire spirit Salamander. Each elemental spirit possesses different attributes that alter Deedlit's abilities, and it is possible to swap between the two. Sylph grants levitation and wind aligned damage, while Salamander offers fire damage and a ground slide that includes temporary invulnerability. Both spirits enable Deedlit to absorb wind and fire damage, respectively, which comes into place when accessing certain areas or obstacles. However, certain enemies and bosses are invincible to fire-based or wind-based attacks. One elemental spirit can be actively used, while the other can be leveled up three times by absorbing \"Soul Screamers\" dropped by defeated enemies when not in use. When Deedlit is hit, the active spirit is leveled down, and having a level 3 spirit active grants steady healing, so swapping between spirits to level the other is key.\nThe game incorporates elements found in role-playing games, such as an inventory screen; a hit point-based health system that determines the maximum amount of damage Deedlit can withstand before dying (starting at 100 HP), which can be expanded by obtaining life containers and replenished by switching between the two elemental spirits at their maximum level; and magic points (MP), which determine how frequently a magical attack may be cast. The game is over once Deedlit's HP is depleted, with a penalty of decreasing her experience points that can potentially result in dropping down a level, though the player can continue with their progress via save points.\nDevelopment\nauthor Ryo Mizuno supervised production of Deedlit in Wonder Labyrinth.]]\nDeedlit in Wonder Labyrinth was developed over the course of a year by Team Ladybug, a division of Japanese online magazine DenFaminicoGamer who previously worked on Shin Megami Tensei: Synchronicity Prologue and Touhou Luna Nights, under supervision of series creator Ryo Mizuno. According to Playism, they were approached by an editor of the Record of Lodoss War'' novels, which led them to reviewing the source material. They decided to go with the idea after seeing that the material and Team Ladybug's artwork went together. The game was inspired by Castlevania: Symphony of the Night and Ikaruga, while the levels and gameplay were designed to reflect its story concept around exploration. The title was built using the Mogura Engine 2, previously used in Luna Nights.\nRelease\nDeedlit in Wonder Labyrinth was first unveiled in 2018 during the series' 30th anniversary for PC via Steam. It was later announced that the game would be coming to Steam Early Access in fall 2019, with a full release following in spring 2020. Publisher Playism revealed that the title would launch via Early Access on March 13, but was released a day earlier instead. An update which introduced a second stage for the Early Access version was released in June. Another update for the Early Access version, which added the third and fourth stages as well as the hero Parn, was first slated for November but was delayed to January 19, 2021, in order to introduce features such as menu settings and a higher resolution.\nThe full version of Deedlit in Wonder Labyrinth, which added the fifth and sixth stages as well as various gameplay adjustments in response to player feedback, was released on March 27. The game's soundtrack was also distributed as an album during the same time period as well. A final update was released on July 13, which introduced boss rush and new game+ modes, as well as achievements. Versions for Nintendo Switch, PlayStation 4, PlayStation 5, Xbox One, and Xbox Series X and Series S were released on December 16 by Playism and co-publisher Why so serious? (WSS Playground), featuring multiple language settings while the PS4, PS5 and Switch versions are available in both digital and physical formats. It also became available via Xbox Game Pass for PC and Xbox consoles. However, the Western release of the Switch version was delayed to January 28, 2022.\nReception\n| MC_PC= 74/100\n| Destruct_PC= 8/10\n| EuroG_PC= Recommended\n| Fam_NS= 8/10, 9/10, 8/10, 8/10\n| IGN_PS5= 7.8/10\n| NLife_NS= 8/10\n| PCGUS_PC= 68/100\n| PCM_PC= 3.5/5.0\n| RPGFan_PC= 90/100\n|TA_NS = 4/5\n| rev1= 3DJuegos\n| rev1_PC= Recommended\n| rev2= Gameblog\n| rev2_PC= 6/10\n| rev3= RPG Site\n| rev3_PC= 7/10\n| rev4= Vandal\n| rev4_PC= 8/10\n}}\nRecord of Lodoss War: Deedlit in Wonder Labyrinth on PC garnered \"mixed or average\" reviews, according to review aggregator site Metacritic. On Switch, it garnered \"generally favorable\" reviews. As of April 30, 2021, the game reportedly sold 100,000 copies on PC. According to Famitsu, the Switch version sold over 10,374 copies in its first week on the market.\nDestructoids Zoey Handley felt that Deedlit in Wonder Labyrinth was slightly more linear than Symphony of the Night and criticized the environments for being monotonous and lacking in variety. Nevertheless, Handley praised the pixel art visuals and animations, boss encounters, weapons, energetic soundtrack and plot progression. Eurogamers Álvaro Arbonés also commended its simplistic story and art direction for being faithful to the source material, music, presentation and Ikaruga-esque elemental spirit mechanic. However, Arbonés criticized aspects such as the aforementioned spirit mechanic for being complicated and introduction of underutilized ideas. PC Gamers Eric Watson criticized the game's short length, low difficulty level and linear nature but gave positive remarks to the element-swapping mechanic and boss fights, noting the retro-style audiovisual presentation.\nPCMags Gabriel Zamora gave positive commentary in regards to the sprite work, controls, puzzles, action-RPG and spirit-swapping mechanics but noted the title's short length, map design and frequent visual distraction as negative points. RPGFans Mark Tjan gave high praise to the 2D pixel art and puzzle-based gameplay. However, Tjan felt mixed about the soundtrack and criticized the scenario for being light on details and uninspired enemy designs. Alejandro Pascual of Spanish gaming website 3DJuegos commended its styling, pixel art graphics, elemental spirit mechanics and boss sequences but criticized the game for being sparse in terms of exploration, power-up items and the story for not honoring the series its based on. Gianni Molinaro of French gaming publication Gameblog felt that Deedlit in Wonder Labyrinth was very basic, criticizing the easy difficulty level. Nevertheless, Molinaro regarded it to be a fun Metroidvania, giving positive remarks to the pixel-based presentation and bosses.\nRPG Sites James Galizio gave positive remarks to the Ikaruga-style color-shifting mechanics, weapon variety and sprite animations, though he found the game's map locations lacking in visual variety and felt that some of the gameplay mechanics were underutilized due to the short length, which was also criticized as well as its difficulty. Vandals Carlos Leiva regarded it as a \"terrific metroidvania-style action-platformer adventure that entertains from start to finish\", praising the visuals, element gameplay system and boss battles but noted that the linear progression, unoriginal magic skills and short duration were some of its negative points.\nNotes\nReferences\nExternal links\n*"
    }
  ]
}