{
  "content": [
    {
      "type": "text",
      "text": "# Recycling in the Republic of Ireland\n\ncollection in Dublin]]\nRates of household recycling in Ireland have increased dramatically since the late 1990s. The Irish Environmental Protection Agency (EPA) is the agency with overall responsibility for environmental protection in Ireland and monitors rates of recycling in Ireland along with other measures of environmental conditions in Ireland. The EPA, along with Repak, the principal organisation for packaging recycling in Ireland, report on recycling rates each year. In 2012 Ireland's municipal solid waste (MSW) recycling rate was 34%, while the rate of packaging recycling reached 79% (the second highest in the European Union behind Germany). The amount of municipal waste generated per person per year in Ireland has fallen significantly in recent years (from over 800&nbsp;kg of waste in 2007 to 570&nbsp;kg per person in 2012). This figure remains above the European Union annual municipal waste average of 503&nbsp;kg per person, however.\nEach local council in Ireland has considerable control over recycling, so recycling practices vary to some extent across the country. Most waste that is not recycled is disposed of in landfill sites.\nPlastic bag levy\nOne noticeable success in Ireland's environmental track record was the introduction of a plastic bag levy in 2002, the first country in the world to do so. All consumers were required to pay 15c for a plastic bag; this led to an immediate decrease of over 90% in the amount of plastic bags in circulation. From 328 bags per inhabitant per year when the levy was introduced, usage fell to 21 bags per capita.\nThe levy encouraged retailers to switch to paper bags, and encouraged consumers to bring their own bags when shopping. The National Litter Pollution Monitoring System showed that when the levy was introduced, 5% of all litter was plastic bags. The 2006 figure is 0.5%. Media coverage also helped raise awareness about the damage plastic bags do to the environment.\nThere has been some evidence of complacency, however, suggesting that the number of plastic bags had begun to rise again to 33 bags per capita. To address this, the levy was increased in July 2006 to 22c; preliminary figures indicate the rate has again fallen to 21 bags per capita. In Dunnes Stores single use bags are no longer sold. Customers may purchase a bag for life priced at €1.\nWEEE\nThe Waste Electrical and Electronic Equipment (WEEE) directive was introduced into Irish law in August 2005. Under this law, retailers of electrical goods are required to provide free in-store take back for old electrical goods for customers buying new electrical equipment. The cost of this is passed onto consumers.\nIreland is the top country in Europe for electronics recycling as a result of the WEEE directive, with 30,000 tonnes of electrical and electronic being collected in 2008. This works out at around 9 kilograms per person, a figure more than double the EU target.\nPackaging\nRepak is Ireland's packaging recovery organisation.\nRepak is a not for profit company set up by Irish business and owned by its members. Repak charges fees to its members in accordance with the amount and type of packaging they place on the Irish market. These fees are used to subsidise the collection and recovery of waste packaging through registered recovery operators across Ireland – so that the individual member companies are exempt from this requirement. Repak is approved under licence by the Minister for the Environment, Community and Local Government to operate as a compliance scheme for packaging recovery. Since Repak was set up in 1997 packaging recycling in Ireland has grown from a very low base to the point where Ireland is now one of the leading recycling countries in the EU.\nPractices around the country\nAlthough waste collection practices vary in each county in Ireland, most services share the guiding principles that waste is sorted into different categories at household level and that waste collection charges are highest for waste going to landfill sites. Waste collection services have been increasingly run by private companies, rather than local government, over the last decade. In Dublin several companies now compete to provide waste collection services. Black bins are used to collect non-recyclable waste. Green bins, used to collect packaging waste and glass, are collected every two weeks-householders can dispose of paper, cardboard, cans, plastic bottles and tins in this bin, and it is illegal to dispose of such waste in a black bin. Most householders have to pay every time their black bin is collected.\nIn 2008, Dublin City Council introduced use of a third bin (brown bin) to households in Dublin City Council area. This was introduced to reduce landfill use for compostable waste. Households use this brown bin to dispose of compostable waste such as grass and hedge cuttings and uncooked food waste. Dublin City Council began to charge for waste collection to fund improvements in recycling facilities. Nine Bring Centres, which consist of bottle banks and recycling facilities were made available at various locations around the City in 2001. At the end of the year 54 public and 53 private bring centres were in operation.\" Most householders have to pay every time their black bin is collected but pay a lesser fee for collection of their brown bin and no fee for collection of their green bin. This system is designed to discourage people from using the black bin and therefore to reduce the amount of waste going into landfill.\nIn Dundalk,  took over from the Dundalk Town Council for waste disposal. They have since in introduced a green bins (2001) and brown bins (2007) along with the black bin. Up until the 2007 the black bins were collected every week but now they are collected every second week with the other bins been collected the week the black bins are not collected.\nVariations of this system are in place across the country. Some local authorities, such as Limerick County Council, now outsource all waste collection to private authorities. Householders can choose what size bin they want, and pay accordingly. However, they are not charged every time the bin is collected. Other councils operate a weigh-and-pay system, where households are charged according to the weight of the waste collected, for example, South Tipperary County Council charge 14c per kg (accurate as of 31 August 2007). Recyclable waste in South Tipperary is collected separately in plastic bags which are purchased at local shops, together with stickers that are placed on the bags.\nIn Galway city, over 50% of waste is now recycled, the highest proportion in the country.\nGreyhound Recycling and Recovery is one of the private waste collection companies in the area.\nReferences\nExternal links\n*[http://www.finfacts.com/irelandbusinessnews/publish/article_10009822.shtml/ CSO reports that 88.7% of Irish households engage in some form of waste recycling]\n*[http://www.citizensinformation.ie/categories/environment/waste-management-and-recycling/ Waste management and recycling]  at Citizens Information\n*[http://www.wastecostcompare.com/ Waste Cost Compare]\n*[http://www.repak.ie/ Repak's home page]"
    }
  ]
}