{
  "content": [
    {
      "type": "text",
      "text": "# Red king crab\n\n}}\nThe red king crab (Paralithodes camtschaticus), also called Kamchatka crab or Alaskan king crab, is a species of king crab native to cold waters in the North Pacific Ocean and adjacent seas, but also introduced to the Barents Sea. It grows to a leg span of , and is heavily targeted by fisheries.\nDescription\nThe red king crab is the largest species of king crab. Red king crabs can reach a carapace width up to , a leg span of , and a weight of . Males grow larger than females. Today, red king crabs infrequently surpass  in carapace width and the average male landed in the Bering Sea weighs . It was named after the color it turns when it is cooked rather than the color of a living animal, which tends to be more burgundy.\nDistribution\nThe red king crab is native to cold waters in the North Pacific Ocean and adjacent seas, ranging from the Bering Sea south to the Gulf of Alaska, off the Kamchatka Peninsula, and in the Sea of Okhotsk and Sea of Japan. It was introduced artificially by the Soviet Union into the Murmansk Fjord, Barents Sea, during the 1960s to provide a new, and valuable, catch in Europe.\nRed king crabs have been seen in water temperatures that range from , with typical being . Immatures prefer temperatures below . The depth at which it can live has much to do with what stage of its lifecycle it is in; newly hatched crab (zoea larvae) stay in the shallower waters where food and protection are plentiful. Usually, after the age of two, the crabs move down to depths of  and take part in what is known as podding; hundreds of crabs come together in tight, highly concentrated groups. Adult crabs are found usually more than  down on the sand and muddy areas in the substrate. They migrate in the winter or early spring to shallower depths for mating, but most of their lives are spent in the deep waters where they feed.\nEcology\nP. camtschaticus faces many predators in its native range, including Pacific cod, walleye pollock, rock sole, flathead sole, rex sole, Dover sole (Microstomus pacificus), arrowtooth flounder, Elasmobranchs, halibut, sculpin, Greenland turbot, Pacific salmon, Pacific herring, otters (Enhydra lutris) and seals.\nFisheries\n, Japan, where it is known as tarabagani]]\nThe red king crab is the most coveted of the commercially sold king crab species, and it is the most expensive per unit weight. It is most commonly caught in the Bering Sea and Norton Sound, Alaska, and is particularly difficult to catch, but is nonetheless one of the most preferred crabs for consumption.\nRed king crabs are experiencing a steady decline in numbers in their native far east coastal waters for unclear reasons, though several theories for the precipitous drop in the crab population have been proposed, including overfishing, warmer waters, and increased fish predation. Fishing controls set by the United States in the 1980s and 2000s have failed to stem the decline.\nIn Europe\n, Norway]]\nIn the 1960s, the Soviet Union transported red king crabs from the North Pacific Ocean to the Murmansk Fjord. They did not survive transport overland, so a batch was flown in, which survived, was released, and bred and spread in the wild.\nIt was first found in Norway in 1977. In the Barents Sea, it is an invasive species and its population is increasing tremendously. This is causing great concern to local environmentalists and local fishermen, as the crab eats everything it comes across and is spreading very rapidly, eating most seabed life and \"creating a desert\". Since its introduction in the 1960s, it has spread west along the Norwegian coast and also has reached Svalbard. The species keeps on advancing southwards along the coast of Norway and some scientists think they are advancing around  a year. In Norway they are sometimes called \"Stalin's crabs\", since they were introduced by the Soviet Union.\nBy the mid 1990s, the king crabs reached North Cape. The Norwegian Institute of Marine Research found in 2010–2013 that they have reached Sørøya and are breeding there. A few have been caught as far south as Tromsø. There is fear of the result if they reach the cod breeding grounds off Lofoten.\nA report on 8 June 2009 said that a red king crab had been caught off Skogsvåg at Sotra south of Bergen in south Norway. An important natural predator of the red king crab, the giant Pacific octopus (Enteroctopus dofleini, formerly called Octopus apollyon), does not occur in European waters. A fisherman in Honningsvåg (a town near the North Cape) complained that king crabs' claws were ruining fishing nets and deep lines. Despite these concerns, the species is protected by diplomatic accords between Norway and Russia as part of a fisheries agreement between Norway and Russia about the Barents Sea, and a bilateral fishing commission decides how to manage the stocks and imposes fishing quotas. West of the North Cape on Norway's northern tip, Norway manages its crab population itself. As of May 2006, only 259 Norwegian fishermen were allowed to catch it east of the North Cape.\nIn the Norwegian Sea, some evidence indicates that the red king crabs eat the egg masses of the capelin, which is an important prey for the cod. The report (as at 24 May 2006) said that in Norwegian Sea, in the Barents Sea (east of the North Cape), catching red king crab is allowed with license only due to a fisheries agreement between Norway and Russia, but elsewhere in Norwegian seas, the catching of king crab is much freer.\nIn January 2022 it was reported that fishermen in the United Kingdom had caught red king crabs, but they were later identified as the native Lithodes maja.\nWaste recycling\nOn average, crab processing waste can account for 69% of the catch mass. The mass fraction of carapace from these wastes is approximately 60%; the rest comprises the entrails (including the digestive organ, the hepatopancreas). In red king crab, the hepatopancreas makes up about 90% of the intestines of the carapace and 5–10% of the total weight of the animal. The hepatopancreas of the digestive system of commercial crabs is a valuable source of a complex of enzymes with various activities: collagenase, protease, hyaluronidase, lipase, nuclease, etc. The complex of proteolytic enzymes of the red king crab hepatopancreas is of interest in various industries.\nPhysiology\nMature female red king crabs must stay in warmer water (near ) to ensure the eggs will be ready for hatching, while the male red king crabs stay in relatively cold water (near ) to conserve energy. In spring (May), female red king crabs move to shallow coastal areas to molt and spawn, and males join the females in the shallow water before molting. In the summer (mid-June through mid-November), these crabs spend their time in fairly deep water, below the established summer thermocline. When the thermocline breaks down, the red king crabs migrate back to intermediate depths, where they stay until the female red king crabs release the eggs fertilized in the previous spawning.\nThe red king crab has a wide range of tolerance to temperature, but it affects their growth. The organism's growth and molting is slow when outside temperature falls below ; around , they molt rather quickly.\nOverall, red king crabs have a high adaptation capacity in changes of salinity level because the crabs retain their vital functions and their feeding  activities. A difference is seen, though, in the salinity tolerance between juvenile  and adult red king crabs. Juveniles are slightly more tolerant to low salinity because their volume regulation is significantly better. Juveniles are consistently hyposmotic to the seawater because they have lower sodium concentration in their hemolymph. As the juveniles are smaller, their exoskeleton is more rigid. The adult red king crabs are hyperosmotic in high salinity and becomes hyposmotic in lower salinity. The hyperosmoticity is due to the higher sodium and potassium concentrations in the hemolymph compared to the surrounding water they live in.\nA slight fluctuation on the pH level of the water (i.e. making the water more acidic) would have great effect on the red king crab. They grow slower in acidified water (pH&nbsp;7.8 instead of 8.0) and eventually die after longer exposure times because of the imbalance of the organisms' acid-base equilibrium.\nRespiration\nThe red king crab has five sets of gills used for respiration, which are in the bronchial chamber within the carapace. The carapace is a covering of sheets of exoskeleton that overhang the thorax vertically to fit over the base of the thoracic legs. The carapace encloses two branchial chambers that enclose the gills. The gill surfaces are covered in chitinous cuticle, which is permeable to gases, allowing gas exchange. Internal gills, like other specialized gills, need metabolic energy to pull water over the respiratory surface. To induce a current into the branchial chamber the crab uses back and forth movements of an appendage called the scaphognathite. The water is drawn in from behind the walking legs then expelled from the branchial chambers through the tubes called prebronchial apertures, which are located beside the mouth. To filter the water before entering the branchial chamber, crabs have branchiostegal hairs that can collect debris. Due to the environment to which it is exposed, the posterior gills of the crab can also be cleared of parasites and sediment by increasing the movement of its fifth set of primitive legs.\nEach gill has a main axis with many lateral filaments or lamellae that are vascularized. The afferent channel transports blood from the gill axis into each filament through a fine afferent canal to the gill top. Blood returns by a minute efferent canal to the gill tip to the efferent channel and passes to the pericardial chamber, which contains the heart. Gases are exchanged in the numerous filaments, and oxygen absorption is especially facilitated by hemocyanin. Red king crabs exhibit unidirectional ventilation. This can be described as the flow of water in a U-shaped course; water passes posteriorly from the incurrent opening, an opening in the carapace near the base of the chelipeds, dorsally over the gills, and anteriorly to exit beside the head.\nCirculation\nDue to their respiratory system's limited ability to deliver by diffusion, respiratory gases must be transported around the body.Paralithodes camtschaticus has an open circulatory system with a dorsal, ostiate heart. An open circulatory system has circulating fluid that passes somewhat freely among the tissues before being collected and recirculated. The heart is in a pericardial chamber, and blood passes through this chamber into the lumen of the heart through two pairs of ostia. Seven arteries conduct blood from the heart to various regions of the body. Each artery branches extensively, and smaller arteries ultimately end in the hemocoel. Venous blood drains into the sternal sinus, where it is conveyed by channels to the gills for aeration and returned again to the pericardial sinus.\nThey have a neurogenic heart, which has rhythmic depolarization that is responsible for initiating heartbeats. Heartbeats originate in nervous tissue; innervated muscle cells cause the heart to contract when stimulated by nerve impulses. The cardiac ganglion, which consists of nine neurons, attaches to the dorsal wall of the heart. The anterior neurons innervate the heart, whereas the other posterior neurons make synaptic contact with those anterior neurons. The posterior neuron acts as the pacemaker but also functions as the cellular oscillator and the central pattern generator. This posterior neuron produces a train of impulses, which excites the other posterior neurons. The heart contracts when the posterior neurons activate the five anterior neurons, which send impulses to the muscle cells. This is how the Frank–Starling mechanism works within crustaceans. The Frank-Starling mechanism refers to the vitally important intrinsic control of the heart; mainly, the stretching of the cardiac muscle tends to increase the force of its contraction by an effect at the cellular level. This mechanism is important as it allows the organism to match its output of blood with its input of blood. Because of the stretching between beats, the Frank-Starling mechanism allows the heart to then naturally contract more forcefully, allowing greater flow of blood, which results in the matched heart output to the increased blood received. The Frank-Starling mechanism is a little different in crustaceans, as it involves the cardiac ganglion as described previously. The stretching of the heart induces the ganglion to fire more regularly and powerfully.\nRed king crab blood contains leukocytes and the second-most common respiratory pigment called hemocyanin. Arthropod hemocyanin is a distinct variation specific to arthropods and is a metalloprotein that uses copper atoms that are bound to its structure. Two copper atoms are needed to bind one O2 molecule. Because it is a large protein molecule, it is found in the blood plasma, but not in body tissues or muscles. Hemocyanins are named appropriately because when oxygenated, their color changes from colorless to blue.\nSee also\n*Alaskan king crab fishing\n*Crab duplex-specific nuclease\n*Japanese spider crab\n*Norway king crab\nReferences\nExternal links\n*\n*"
    }
  ]
}