{
  "content": [
    {
      "type": "text",
      "text": "# Red Dwarf X\n\n| last_aired    =\n| prev_season   = Red Dwarf: Back to Earth\n| next_season   = Series XI\n| episode_list  = List of Red Dwarf episodes\n}}\nRed Dwarf X is the tenth series of the British science fiction sitcom Red Dwarf. It was broadcast on UK television channel Dave between 4 October and 8 November 2012. There are six episodes and it was the first full series of Red Dwarf since 1999.\nProduction\nDevelopment\nIn June 2010, Craig Charles, Chris Barrie and Hattie Hayridge reported plans to produce further series of Red Dwarf, although a subsequent article on the official Red Dwarf website emphasised that nothing had yet been confirmed. In January 2011, Robert Llewellyn confirmed on his website that a new series would be filmed in late 2011 and broadcast in 2012 on the digital channel Dave, although the channel's owners UKTV initially refused to comment, suggesting that a new series had not been officially greenlit. On 10 April 2011, a six-episode Red Dwarf tenth series to be broadcast on Dave in autumn 2012 was officially announced. Doug Naylor confirmed the plans both on Twitter and at the Dimension Jump XVI convention, and Dave issued the announcement through its website.\nFilming\nFilming dates for the new series were announced on 11 November 2011, along with confirmation that the series would again be shot at Shepperton Studios in front of an audience. Principal filming began on 16 December 2011 and ended on 27 January 2012, and the cast and crew subsequently returned for six days filming pick-ups.\nMusic\nOn 4 May 2012, Howard Goodall, who had composed music for Red Dwarf from its beginning until series VII, was announced as composer of the score for Red Dwarf X.\nPost-production\nOn 19 June 2012, the post-production process was completed and all six episodes were signed off ready for their broadcast in the following autumn.\nPromotion\nThe first trailer for Red Dwarf X was released on 20 July 2012 on Dave's official Facebook page, and was followed by a new teaser released every following Friday until the series premiered. Red Dwarf X began airing on 4 October 2012. The show was also advertised on billboards throughout the UK, mainly near train stations.\nCast\nThe only returning characters from the previous series are:\n* Chris Barrie as Arnold Rimmer\n* Craig Charles as Dave Lister\n* Danny John-Jules as the Cat\n* Robert Llewellyn as Kryten\nEpisodes\n|ProdCode        = 1\n|ShortSummary    = Rimmer receives an SOS distress call from a doomed ship commanded by his all-conquering brother, Howard. But Rimmer can't bring himself to save Howard until he's on an equal footing career-wise. He has 15 hours to pass his Astro-Nav exam and become an officer. The same exam he's already failed ten times.\n|LineColor       = FF6347\n}}\n|ProdCode        = 2\n|ShortSummary    = Every year Lister sends himself a Father's Day card to celebrate the fact that he is his own father, but when Rimmer points out he's been a lousy father to himself Lister decides to do something about it. Meanwhile, Rimmer and Kryten install a new computer: the beautiful, but lethally logical, Pree.\n|LineColor       = FF6347\n}}\n|ProdCode        = 3\n|ShortSummary    = Marooned in Britain in 23 AD, the Dwarfers need an 8-volt battery to power up their Returner Remote and get home. Remembering a lesson from school Rimmer suggests they make a battery out of lemons but the nearest lemon to Britain in 23 AD is in India, 4,000 miles away. They begin their journey, a journey that will ultimately lead them to a meeting with a historical A-List Celebrity that could alter the entire history of civilisation.\n|LineColor       = FF6347\n}}\n|ProdCode        = 4\n|ShortSummary    = Lister loses Rimmer in a game of poker to a group of Genetically Engineered Life Forms (GELF) and in return gets an unwanted gift: a groinal exploder programmed to detonate in 24 hours unless Lister pays his debts. Meanwhile, Kryten and Cat become quantum entangled and do everything in perfect unison.\n|LineColor       = FF6347\n}}\n|ProdCode        = 5\n|ShortSummary    = Lister has women trouble when he gets himself in a love triangle with Snack Dispensers 23 and 34, then to make matters worse he gets a letter from an old girlfriend telling him she's pregnant and it might be his. Lister and Rimmer hunt through the mountain of letters from the mail pod to discover if Lister is finally a dad to somebody other than himself.\n|LineColor       = FF6347\n}}\n|ProdCode        = 6\n|ShortSummary    = Hiding in an asteroid, surrounded by a Simulant Death Ship and a fleet of Annihilators, the Dwarfers begin to wonder whether this is the beginning of the end. Only one man can save them. Unfortunately that man is Arnold J. Rimmer.\n|LineColor       = FF6347\n}}\n}}\nBroadcast\nIn Australia, Red Dwarf X was broadcast on ABC1 from 7 November 2012. In New Zealand, Red Dwarf X was broadcast on BBC UKTV between January and February 2013. In the United States, Red Dwarf X made its American broadcast debut on the PBS station KERA-TV in Dallas, Texas, in July and August 2013. The distributor announced plans to roll out the show to other American public broadcasting stations in 2014.\nHome media\nRed Dwarf X was released on Blu-ray and DVD in the United Kingdom on 19 November 2012, in Australia on 12 December 2012, and in the United States on 8 January 2013. A limited-edition DVD steelbook was released along with the standard DVD and Blu-ray; a different limited-edition steelbook Blu-ray, exclusive to Zavvi, was released on 25 April 2016.\nIn Japan, Red Dwarf X was released in a box set along with Back to Earth. The set was released on 3 February 2015.\nReferences\nExternal links\n*\n*\n*\n*"
    }
  ]
}