{
  "content": [
    {
      "type": "text",
      "text": "# Red Sun Rising (wargame)\n\nRed Sun Rising, subtitled \"The Russo-Japanese War 1904-05\", is a board wargame published by Simulations Publications Inc. (SPI) in 1977 that simulates the Russo-Japanese War at the turn of the twentieth century.\nBackground\nThe expanding geographical interests of Russia and Japan collided in the late 19th century, and resulted in a formal declaration of war in 1904. In 1904 and 1905, the opposing forces engaged in both land and sea combat in which Japanese forces proved they were the equal and often superior to the European forces.\nDescription\nRed Sun Rising is a 2-player board wargame in which one player controls Japanese forces, while the other player controls Russian forces. The game has both land and naval aspects, and coordination of the two aspects is necessary in order to win. On land, although Japanese forces all start in Japan and must be ferried to Russian soil, they are much stronger that initial Russian forces. As Japanese forces land and head inland, the Russian player, with weaker forces, must try to hold back the Japanese forces until reinforcements arrive via rail. It is a similar situation in the naval game — the Japanese player controls a potent navy and large merchant fleet; the Russian player's Imperial Navy can only hope to disrupt some of the flow of soldiers and supplies from Japan.\nThe land map covers the area between Port Arthur in the west to Vladivostok in the east, and from Kirin in the north to Seoul in the south. The naval map covers the Yellow Sea, Sea of Japan, and the Japanese archipelago. The game includes 400 markers for land-based units, and 100 ship counters.\nThe game starts in February 1904, with each turn divided into a naval and a land segment. Together, this represents one month. The game lasts a maximum of 23 turns (December 1905), which is longer than the historical war, which ended in August 1905. The game can end much earlier if the Japanese player either totally overwhelms the Russian defence, or the Russian player significantly slows down the Japanese player.\nSupply is a key component of the game. For the Russians, supply starts at a supply line, which then moves to Army HQs, and then to units within range. The Japanese are supplied from Japanese ships, which then moves to Army HQs and then to units within range. Roads and railways are a necessity for moving supplies expeditiously, and the Japanese must capture a key rail junction if they are to have any hope of advancing into Manchuria.\nCommand and control is another important aspect of the game. Leaders, represented by counters, are needed to activate military units before they can move and fight. The ability of each leader to do this depends on rolling a die and getting a result equal to or less than a leader's Command Value. Russian leaders, on average, have lower leadership ratings, meant to simulate the historical sluggishness and ineptitude of the Russian leadership.\nVictory conditions\nThere are seven Russian cities on the map. Victory is measured by the number of cities captured by the Japanese player, who must, at a minimum, keep to a timeline of one city captured by Spring 1904, two by Summer 1904, three by Winter 1904, etc. If Japan fails to keep to this schedule, the game ends immediately, and victory is assessed by how many cities are in Japanese control at that moment:\n* Five or more: Significant Japanese victory\n* Four: Marginal Japanese victory\n* Three: Marginal Russian victory\n* One or two: Significant Russian victory\nPublication history\nIn 1975, Game Designers Workshop (GDW) published two interconnected board wargames about the Russo-Japanese War, Port Arthur (land game); and Tsushima (naval game). These were also offered as a combined game, The Russo-Japanese War. Shortly afterwards, SPI game designer Mark Herman started work on a game about the same war, which was developed by Frank Davis and published as Red Sun Rising by SPI in 1977 with graphic design by Redmond A. Simonsen. The concept of the game proved popular, and Red Sun Rising debuted at #10 on SPI's Top Ten Bestseller List before it was even published, based on pre-orders alone. The game rose to #9 after publication, but disappeared from the Top Ten two months later. The sudden dive in popularity was due to problems with vague rules, as pointed out by several critics. SPI published several sets of errata to try to restoke interest in the game, but its popularity never returned.\nReception\nIn his 1980 book The Best of Board Wargaming, Nick  Palmer called this \"deceptively attractive ... With little opportunity for Russian ground initiative and an unsatisfactory naval theatre, Red Sun Rising is not very interesting.\" Palmer concluded by giving the game an Excitement grade of only 50%, saying, \"Specialists in the [Russo-Japan War] willing to tinker with the rules should be able to develop something pretty good without much additional work, but as it stands the game seems to fall short of its promise.\"\nIn Issue 28 of the British wargaming magazine Perfidious Albion, Charles Vasey and Geoffrey Barnard discussed this game. Vasey commented, \"While this game looks interesting, it swiftly becomes rather odd. Make no mistake, it is organised much better than GDW's sketchy Russo-Japanese War, but its superior lines disguise the fact that it [only] has a 50 cc engine under the bonnet!\" Barnard replied, \"What SPI seems to have done is chopped out all the nice touches that were in the GDW game and replaced them with stodge, and then given us an extra double helping of yet more stodge.\"  Vasey concluded, \"Red Sun Rising has sensible premises and good ideas ... It is also pretty well unplayable as it stands ... A dismal effort which still leaves us with no adequate game on this war.\" Barnard concluded, \"I'd rather play the GDW version.\"\nIn Issue 15 of the British wargaming magazine Phoenix, Donald Mack gave a thorough analysis of gameplay and rules, and pointed out, \"Red Sun Rising, as originally published, suffered severely from vagueness and obscurities in its rules, so much so that one could only wonder what the playtesters, let alone the designer and developer, had been about when they were working on it.\" Mack did note that errata released by SPI had dealt with many of the issues. Mack also pointed out that the \"Player Notes\" for the Russian player suggested strategies that would be almost impossible to achieve. Despite these problems, Mack concluded, \"Red Sun Rising has had me grinding my teeth at my appalling luck; it has never had me bored.\" In Issue 27, Mack noted that this game \"is particularly good ... through use of supply and command control as the two dominant features of its system.\" Mack also thought the Victory Conditions were \"another excellent concept\". Overall, Mack concluded by calling it a \"clever, easy, subtle game.\"\nIn The Guide to Simulations/Games for Education and Training, Martin Campion considered this game as an educational tool, but concluded, \"This game has a few puzzling rules that would need to be solved, but its main problem for class use is that it has no short scenarios.\"\nOther reviews and commentary\n* Fire & Movement #12\n* The Wargamer Vol. 1, no. 7\nReferences"
    }
  ]
}