{
  "content": [
    {
      "type": "text",
      "text": "# Red Queen's race__disambig_1\n\nin Chapter Two – The Garden of Live Flowers]]\nThe '''Red Queen's race''' is an incident that appears in Lewis Carroll's Through the Looking-Glass and involves both the Red Queen, a representation of a Queen in chess, and Alice constantly running but remaining in the same spot.\n\"Well, in our country,\" said Alice, still panting a little, \"you'd generally get to somewhere else—if you run very fast for a long time, as we've been doing.\"\n\"A slow sort of country!\" said the Queen. \"Now, here, you see, it takes all the running you can do, to keep in the same place. If you want to get somewhere else, you must run at least twice as fast as that!\"\nThe Red Queen's race is often used to illustrate similar situations:\n* In evolutionary biology, to illustrate that sexual reproduction and the resulting genetic recombination may be just enough to allow individuals of a certain species to adapt to changes in their environment—see Red Queen hypothesis.\n* As an illustration of the relativistic effect that nothing can ever reach the speed of light, or the invariant speed; in particular, with respect to relativistic effect on light from galaxies near the edge of the expanding observable universe,EG: Understanding relativity: a simplified approach to Einstein's theories, by Leo Sartori;  or at the event horizon of a black hole.EG: Analog essays on science, edited by Stanley Schmidt;\n* Isaac Asimov used it in his short story \"The Red Queen's Race\" to illustrate the concept of predestination paradox.\n* In environmental sociology, to illustrate Allan Schnaiberg's concept of the treadmill of production where actors are perpetually driven to accumulate capital and expand the market in an effort to maintain relative economic and social position.\n* Vernor Vinge used it in his novel Rainbows End to illustrate the struggle between encouraging technological advancement and protecting the world from new weapons technologies.\n* James A. Robinson and Daron Acemoglu used it in their political science book The Narrow Corridor to illustrate the competition and cooperation required between state and society required to support the spread of liberty.\n* Andrew F. Krepinevich used it in his article \"The New Nuclear Age: How China’s Growing Nuclear Arsenal Threatens Deterrence\" to illustrate how in a tripolar nuclear power system it is not possible for each state to maintain nuclear parity with the combined arsenals of its two rivals.\n* Marc Reisner referenced the Red Queen in his book Cadillac Desert to describe a growing Los Angeles’ quest for water. As the city swelled in population, it required more and more water sources just to maintain a supply barely enough to sate its residents and farms.\n* Steve Blank used it in his article “The Red Queen Problem - Innovation in the DoD and Intelligence Community” as a metaphor for how the US Department of Defense and Intelligence community are not able to keep pace with their adversaries in the 21st century because of their outdated approach to technological innovation.\n* Mark Atherton used it in fraud detection and other areas of fighting online attackers to describe the never ending struggle to  combat relentless adversaries.\n* Jay-Z compared the struggle for Black liberation to the Red Queen’s race in his song “Legacy”: “That’s called the Red Queen’s Race/You run this hard just to stay in place/Keep up the pace, baby/Keep up the pace.”\nReferences"
    }
  ]
}