{
  "content": [
    {
      "type": "text",
      "text": "# Red Shoes and the Seven Dwarfs\n\n| starring       =\n| cinematography =\n| editing        =\n| music          = Geoff Zanelli\n| studio         = Locus Corporation\n| distributor    = Next Entertainment World\n| released       =\n| runtime        = 93 minutes\n| country        = South Korea\n| language       = English\n| budget         =\n| gross          = $9.7 million\n| based_on       = Snow White, by the Brothers Grimm\n}}\nRed Shoes and the Seven Dwarfs, known in Korean as simply Red Shoes (), is a 2019 English-language South Korean animated fantasy film produced by Locus Corporation. It is based on the 1812 German-language fairy tale \"Snow White\" by the Brothers Grimm, and its name is derived from the 1845 Danish fairy tale The Red Shoes by Hans Christian Andersen. The film features the voices of Chloë Grace Moretz, Sam Claflin, Gina Gershon, Patrick Warburton, and Jim Rash.\nRed Shoes and the Seven Dwarfs was released on July 25, 2019 in South Korea and was released on September 18, 2020 in the United States. It received mixed reviews.\nPlot\nA group of heroic princes called the Fearless Seven—Merlin, Arthur, Jack, Hans, and identical triplets Pino, Noki and Kio—save a Fairy Princess from a dragon. However, upon seeing her green face, they assume she is a witch and attack her. To teach them a lesson, she curses them to transform into green dwarfs whenever people look at them, and the only way to undo the curse is if they receive a kiss from \"the most beautiful woman in the world\".\nOver a year later, King White marries the witch Regina and she takes over his kingdom. His overweight but strong daughter, Princess Snow White (\"Snow\"), returns to find her father. She finds his diary with a warning not to touch the apples she finds hanging on a tree. They turn into a pair of red shoes and Snow puts them on regardless. They transform her into a slim version of herself. Queen Regina suddenly attacks her, unaware that she is Snow, and the tree dies. Snow escapes on a broomstick and crashes at the dwarves' house, alerting the seven nearby. They prepare to attack, thinking she is the Fairy Princess, but welcome her into their home upon seeing her. Snow is shocked when she sees herself in the mirror and introduces herself as \"Red Shoes\". The seven are immediately smitten by her and agree to help her find her father, striving to impress her so she might kiss them, especially Merlin and Arthur. They encounter a large wooden bunny who Merlin eventually befriends. Regina hires the selfish pathetic Prince Average of a neighboring realm (recommended by her Magic Mirror). He sends his soldiers after Snow but she is saved by Merlin. Average attacks the dwarves and tries to abduct Snow but fails. That night, Snow and Merlin grow emotionally closer and find that Snow cannot remove the shoes. Regina gives Average and his bodyguards magic apples that turn them into giant monstrous wooden bears.\nIn a secluded forest, Snow tries to give Merlin a hint about her real self but instead confesses her feelings for him, and they kiss. Merlin is shocked to see that the kiss did not undo his curse as he thought Snow was the prophetic beautiful woman. Suddenly Average and his bodyguards attack and Merlin fights them off. Average falls into a river, taking Merlin with him. Snow finally removes the shoes so she can use her strength to save Merlin, exposing herself as Snow White. She believes Merlin would not have helped her real self, so Merlin leaves, ashamed. She then puts her shoes back on in an attempt to reconcile with him, knowing Merlin likes her for her looks more than her real self. Merlin talks with his dwarf self and, realizing that Snow White likes him for himself, decides to help her. Suddenly, Regina appears disguised as Merlin and asks Snow to eat an apple to take off her shoes, but the real Merlin arrives and the exposed witch escapes with Snow.\nRegina, now aged and weak, tries to force Snow to eat the apple. When her stepdaughter refuses, she threatens to kill a captured Merlin. Snow tells Merlin to save her father and eats the apple, transforming her into a new apple tree. The Mirror explains that Snow will die when Regina picks the new shoes from the tree. Merlin fails to escape until the other dwarves, the bunny, and three wooden bear cubs save him and destroy the Mirror. Merlin sacrifices himself to save Snow by falling down the castle with Regina. With Regina dead, the wooden animals change back into humans, revealing the bunny to be King White. Snow, back to her real self, reunites with her father. Pino, Noki, and Kio take Merlin to Snow, and he admits his sincere romantic feelings before dying in her arms. Snow gives Merlin one last kiss, reviving him and restoring his human form for good. They happily accept each others' appearances and everyone rejoices, while Arthur does not recognize Snow was Red Shoes.\nIn the end credits, Snow and Merlin marry and the other dwarfs find their own unusual-looking girlfriends. The Fairy Princess fishes Average out of a river and, after he makes a rude remark, turns him into another green dwarf.\nVoice cast\n* Chloë Grace Moretz as Princess Snow White/Red Shoes; an overweight version of the classic Brothers Grimm fairy tale character, who is kind, selfless, and a strong hand-to-hand fighter. Her alias, \"Red Shoes\", is based on a Hans Christian Andersen story of the same name.\n* Sam Claflin as Merlin; a heroic, athletic, and caring but somewhat conceited prince and the leader of the Fearless Seven, who fights using magical lightning and initially judges women based on their looks.\n* Gina Gershon as Queen Regina; Snow White's stepmother and an evil witch seeking to steal back her magical shoes from her stepdaughter to achieve immortality and eternal youth.\n* Jim Rash as Prince Average; a selfish, weak-willed prince who tries to force Snow White to be his birthday date.\n* Patrick Warburton as the Magic Mirror; a snarky, talking mirror based on the Evil Queen's mirror of the original story. He is part of a magical tree and controls its branches.\n* Simon Kassianides as Arthur; Merlin's closest friend, his rival for Snow White's affection, and the second-in-command of the Fearless Seven, who fights with swords like Excalibur. He later finds love with Little Red Riding Hood who turns into a werewolf.\n* Frederik Hamel as Jack; an arrogant, French-accented prince in the Fearless Seven, who fights using an invisibility cloak and believes women are most interested in diamonds. He later finds love with a reverse mermaid.\n* Nolan North as Hans, the Twin Guards, and King White.\n** Hans is sweet, German-accented prince in the Fearless Seven, and pastry chef, who fights with a shield that doubles as a frying pan and believes women can be won over with confectionery. He is proven correct when he finds love with Sleeping Beauty.\n** The Twin Guards are the two muscular but dim bodyguards of Prince Average.\n** King White is Snow White's slightly overweight but loving father and Regina's unwitting husband.\n* Frank Todaro as Pino, Noki, and Kio; inventive, Italian-accented identical triplet princes in the Fearless Seven who fight using a giant wooden robot of their creation, which they keep improving. They later build robot girlfriends.\n* Brian T. Delaney as Big Bunny and Sculptor.\n* Piotr Michael and Benjamin Diskin as two armored knights who work for Agerage to find Snow White.\n* Ava Kolker, Asher Blinkoff, and Juju Journey Brener as the three Wooden Bear Cubs.\nAdditional voices by Brian T. Delaney, Benjamin Diskin, Terri Douglas, Piotr Michael, Amanda Troop, and Kari Wahlgren.\nMusic\n| producer     =\n}}\nThe music was composed by Geoff Zanelli, and was released on streaming services on June 26, 2020. The soundtrack contains 20 songs, with three promotional singles: \"Start of Something Right\", \"This is Me\", and \"Something So Beautiful\", with the former two sung by Jordyn Kayne and the latter by Giuseppe Izzo for the English version, which was also sung by  and Yongzoo for the Korean version respectively.\n| extra8        = Giuseppe Izzo\n| title9        = Town Escape\n| length9       = 2:50\n| title10       = Big Guns\n| length10      = 3:31\n| title11       = The Real Me\n| length11      = 1:25\n| title12       = Flying Machine\n| length12      = 1:46\n| title13       = The Three Bears\n| length13      = 4:12\n| title14       = Merlin Falls\n| length14      = 1:34\n| title15       = The Real Snow\n| length15      = 2:38\n| title16       = Start of Something Right\n| length16      = 3:08\n| writer16      =\n| extra16       = Jordyn Kayne\n| title17       = Magichard\n| length17      = 4:50\n| title18       = Regina Offers the Apple\n| length18      = 2:03\n| title19       = I Got Merlin'd\n| length19      = 4:07\n| title20       = This Is Me\n| length20      = 2:32\n| writer20      =\n| extra20       = Jordyn Kayne\n}}\n| length1       = 3:09\n| music1        = Geoff Zanelli\n| writer1       =\n| extra1        =\n| title2        = This Is Me\n| note2         =\n| length2       = 2:44\n| lyrics2       =\n| music2        = Geoff Zanelli\n| writer2       =\n| extra2        = Raon Lee\n| title3        = Something So Beautiful - Korean Version\n| note3         =\n| length3       = 2:57\n| music3        = Geoff Zanelli\n| writer3       =\n| extra3        = Yongzoo\n| title4        = Start of Something Right\n| note4         = Instrumental\n| music4        = Geoff Zanelli\n| title5        = This Is Me\n| note5         = Instrumental\n| music5        = Geoff Zanelli\n| title6        = Something So Beautiful\n| note6         = Instrumental\n| music6        = Geoff Zanelli\n}}\nReception\nCritical reception\nReception of the film has mixed.\nFat shaming controversy\nA marketing campaign for the film revealed at the 2017 Cannes Marché du Film was criticized by critics and audiences for alleged fat shaming. Chloë Grace Moretz, who voiced Snow/Red Shoes, stated she was \"appalled\" by the marketing that she felt it did not reflect the actual film's message. The production company immediately terminated the campaign and issued an apology, stating:\nAs the producer of the theatrical animated film Red Shoes and the 7 Dwarfs, now in production, Locus Corporation wishes to apologize regarding the first elements of our marketing campaign (in the form of a Cannes billboard and a trailer) which we realize has had the opposite effect from that which was intended. That advertising campaign is being terminated. Our film, a family comedy, carries a message designed to challenge social prejudices related to standards of physical beauty in society by emphasizing the importance of inner beauty. We appreciate and are grateful for the constructive criticism of those who brought this to our attention. We sincerely regret any embarrassment or dissatisfaction this mistaken advertising has caused to any of the individual artists or companies involved with the production of future distribution of the film, none of whom had any involvement with creating or approving the now discontinued advertising campaign.\nLater sources, including organizations aimed at promoting positive messaging in family entertainment, would be more sympathetic to the film, noting that Red Shoes and the Seven Dwarfs is \"loaded with valuable lessons for children and adults\" and \"promotes body image and self-acceptance, while confronting stereotypes.\"\nSee also\n* South Korean animation\nReferences\nExternal links\n*"
    }
  ]
}