{
  "content": [
    {
      "type": "text",
      "text": "# Red cooking\n\nserved with thickened braising sauce]]\nRed cooking, also called Chinese stewing, red stewing, red braising, or flavor potting, is a slow braising Chinese cooking technique that imparts a reddish-brown coloration to the prepared food. Red cooking likely originated in Jiangsu province. While the technique is used all over China, it is most strongly associated with the Jiangnan region.\nThere are two types of red cooking:\n*Hongshao (): can be done in less than 20 minutes and usually does not require much water\n*Lu (): usually requires prolonged cooking of up to several hours and the items must be submerged in the cooking liquid.\nTypes\nSoy sauce (usually a mix of light and dark soy sauce), fermented bean paste, red fermented tofu and rock sugar is commonly used to both flavor and impart a reddish-brown hue to the items being cooked. Food coloring is sometimes added for a more intense red coloration. Both lu and hongshao are forms of stewing or braising characterized by usage of soy sauce, Chinese rice wine (Shaoxing wine, huangjiu etc.) and rock sugar. Whole spices (star anise, black cardamom (caoguo), cassia or fennel seeds) or five-spice powder are crucial elements in these dishes but are used in moderation so that their flavors do not overwhelm the main ingredients.\nRed-cooked stews may be heavy in meat content or contain a variety of meats, vegetables, and hard-boiled eggs. Such dishes may be served hot or cold, and the sauce or stock is often reused as master stock.\nSee also\n* Ah-so sauce\n* Char siu\n* Fujian cuisine\n* Hunan cuisine\n* Jiangsu cuisine\n* Kho (cooking technique)\n* List of cooking techniques\n* Lou mei\n* Shanghai cuisine\n* Zhejiang cuisine\nReferences\n* ''Charmaine Solomon's Encyclopedia of Asian Food, Charmaine Solomon, 1998, Tuttle,\n* Chinese Cooking for Dummies, Martin Yan, 2000, For Dummies,\n* Martin Yan's Invitation to Chinese Cooking, Martin Yan, 2000, Bay Books,\n* Xiandai Hanyu Cidian (Modern Chinese Dictionary)'', Shang Wu Press, Beijing, 1996,\nExternal links\n* [http://www.chinesefood-recipes.com/chinese_cooking_methods/stew_redcook_clearsimmer.php Article describing red cooking]"
    }
  ]
}