{
  "content": [
    {
      "type": "text",
      "text": "# Redbank Plains, Queensland\n\n| pop                 = 24349\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4301\n| area                = 18.0\n| timezone            = AEST\n| utc                 = +10:00\n| lga                 = City of Ipswich\n| stategov            = Bundamba\n| fedgov              = Blair\n| fedgov2             = Oxley\n| dist1               = 11.9\n| dir1                = ESE\n| location1           = Ipswich CBD\n| dist2               = 34.2\n| dir2                = SW\n| location2           = Brisbane\n| dist3               = 7.17\n| dir3                = SE\n| location3           = Springfield Central, Queensland\n| near-n              = Collingwood Park\n| near-ne             = Redbank\n| near-e              = Bellbird Park\n| near-se             = Augustine HeightsSpring Mountain\n| near-s              = White Rock\n| near-sw             = Swanbank\n| near-w              = Swanbank\n| near-nw             = New Chum\n}}\nRedbank Plains is a suburb in the City of Ipswich, Queensland, Australia. In the , Redbank Plains had a population of 24,349 people.\nGeography\nRedbank Plains is  by road from the Ipswich CBD and approximately  from the Brisbane CBD. Redbank Plains is  North West from Springfield Central.\nHistory\nThe history of the name is not recorded, but the neighboring suburb of Redbank was named by Major Edmund Lockyer in September 1825 due to the red soil on the bank of the Brisbane River.\nA school (name unknown) was opened in 1868 by the Roman Catholic Church. On 17 January 1870 it became Redbank Plains Non Vested School. In 1873 a new school was built and on 9 Feb 1874 it opened as Redbank Plains State School.\nA Primitive Methodist church opened at 382 Redbank Plains Road () on Sunday 26 December 1875. At January 2010 the church (then known as the Redbank Plains Uniting Church) was still extant. In April 2011 the church was damaged by a fire (suspected to be arson); at that time the church was described as not being used but was still full of its church furniture. Three weeks later in May 2011, the building was completely gutted in another fire (also suspected to be arson). In October 2013 the property was sold for $300,000. As at September 2015 no building was on the site.\nThe Redbank Plains Library opened in 1985. It had a major refurbishment in 2010.\nRedbank Plains State High School opened on 27 January 1987.\nStaines Memorial College opened 25 January 2005 in Springfield. It is named in the memory of Graham Staines, a missionary in India who was burned to death by fundamentalist Hindus in 1999. In 2010 the college relocated to Redbank Plains.\nFernbrooke State School opened on 1 January 2017.\nSt Ann's Catholic Primary School opened in 2020 with 98 students in Prep to Year 3.\nDemographics\nIn the , Redbank Plains had a population of 19,299 people.\nIn the , Redbank Plains had a population of 24,349 people.\nAmenities\nThe Ipswich City Council operates the Redbank Plains Library in Moreton Avenue.\nThe main shopping centre in Redbank Plains is called Town Square Redbank Plains. Town Square is located on the corner of Redbank Plains Road South and Redbank Plains Road East . Town Square has 5 major retailers as well as 43 small retail spaces and offices. Town Square has dining options, medical services, health and fitness, specialty retail and services including a Post Office.\nTransport infrastructure\nRedbank Plains is serviced by two motorways within close proximity - the Ipswich Motorway and Centenary Motorway. Residents of Redbank Plains can access rail services from Redbank station, Goodna station and Springfield station. In 2019, the Department of Transport and Main Roads conduced a study on expanding the rail network between Springfield and Ipswich. The report recommended a rail station be built at School Road, Redbank Plains.\nEducation\nRedbank Plains State School is a government primary (Prep-6) school for boys and girls at 39-53 School Road (). In 2017, the school had an enrolment of 739 students with 54 teachers (50 full-time equivalent) and 38 non-teaching staff (26 full-time equivalent). It includes a special education program.\nFernbrooke State School is a government primary (Prep-6) school for boys and girls at 8 Regents Drive (). In 2017, the school had an enrolment of 386 students with 23 teachers (22 full-time equivalent) and 12 non-teaching staff (8 full-time equivalent).\nSt Ann's School is a Catholic primary (Prep-Year 6) school for boys and girls on a  site on Halletts Road, adjacent to the Cashmere Rd Reserve (). The school opened in 2020 with 98 students in Prep to Year 3 with Years 4 to 6 to be added in each successive year.\nStaines Memorial College is a private primary and secondary (Prep-12) school for boys and girls at 227-263 School Road (). It is a non-denominational Christian school. In 2017, the school had an enrolment of 471 students with 34 teachers (32 full-time equivalent) and 31 non-teaching staff (21 full-time equivalent).\nRedbank Plains State High School is a government secondary (7-12) school for boys and girls at Willow Road (). In 2017, the school had an enrolment of 1729 students with 142 teachers (137 full-time equivalent) and 67 non-teaching staff (48 full-time equivalent). It includes a special education program.\nWeather radar\nThe CP2 weather radar is located at the end of Vic Cumner Drive. This polarmetric radar was established in 2007 and is used to measure rainfall, rain drop sizes and for the detection of hail storms. The data collected by the specialist radar facility that is operated by the Bureau of Meteorology and the National Centre for Atmospheric Research is used in a range of research projects by The Centre for Australian Weather and Climate Research. Unlike the nearby radars at Mount Stapylton and Marburg, the radar does not provide a streaming media loop to the public.\nReferences\nExternal links\n*\n* [http://www.ipswich.qld.gov.au/documents/heritage/redbank_plains.pdf Road Names & History, Ipswich City Council]"
    }
  ]
}