{
  "content": [
    {
      "type": "text",
      "text": "# Redheugh Gardens War Memorial\n\n|location       = Hartlepool, County Durham, England\n|designer       = Philip Bennison\n|inscription    =  East face: \"FOR US THEY DIED\"; west face: \"LIVE THOU FOR ENGLAND\".\n|established    =\n|unveiled       = 17 December 1921\n}}\nRedheugh Gardens War Memorial or Hartlepool War Memorial is a World War I and World War II memorial located in the Headlands of Hartlepool, County Durham, England. It commemorates Hartlepool military servicemen and civilians who lost their lives in both wars – with specific mention of the first British soldiers to have died on British soil during 16 December 1914 Raid on Scarborough, Hartlepool and Whitby of World War I. In 2001 a plaque was unveiled to memorialise 240 men and women who succumbed from 1919 to 1967 during war and conflict.\nRaid on Scarborough, Hartlepool and Whitby\nThe death of the first soldiers on British soil during World War I is commemorated by the Redheugh Gardens War Memorial, which was unveiled seven years and one day after the East Coast Raid.\nWinged Victory memorial\nThe memorial, commissioned by the War Memorial Committee and designed by Philip B. Bennison, commemorates the servicemen and civilians who lost their lives in World War I. The main figure on the memorial is the draped Winged Victory (also called Triumphant Youth). The unveiling program describes it as: \"The winged figure of Triumphant Youth which crowns the column, symbolizes a spiritual freedom and regeneration which comes through pain and sacrifice.\" It is sculpted in bronze and sits upon several pedestals made of limestone and ashlar. First below the sculpture is a chamfered plinth and cornice that carries on each of its four faces the bronze: the Hartlepool town seal, the Brus family (Hartlepool overlords) coat of arms, the coat of arms of Prince Bishops of Durham and, representing the Raid on Hartlepool, a 1914 dated cartouche of the lighthouse. The bronze panels were made by R.H. Machin. The pedestal at the base is a square shaft that is rockfaced and coursed.\nThe memorial inscriptions are:\n* West face: \"LIVE THOU FOR ENGLAND\"\n* East face: \"FOR US THEY DIED\"\nJohn Lambton, 3rd Earl of Durham unveiled the memorial and Rev. D. Patterson performed the dedication on 17 December 1921. The wife of Hartlepool Councillor C.T. Watson unveiled the plaques.\nIt was made a Grade II structure has been listed with the British Listed Buildings since 1985. In 2002 the memorial was renovated, including new gates, railings and walls.\nMemorial wall\nDesigned by Philip B. Bennison, ARCA, the Whitbed Portland stone wall was first built as a World War I memorial, and its use was extended to memorialise those from World War II. The wall has five bronze slate panels  high x  wide of the names of the deceased.\nThe inscriptions on the first four panels are:\n* \"To these Unconquered Dead\" (on the wall)\n* \"Of the Navy / Army and / Mercantile / Marine /\" (at the top of panels)\n* \"Who fell in the Great War / and in grateful appreciation / of those who shared its dangers\" (on the wall).\nOn a fifth panel is the inscription: \"Bombardment. / The following / were killed in the / bombardment / of Hartlepool / December 16th 1914\" and 52 full names. Pillars at the end of the wall contain the dates of the wars.\nFunded by public subscription, the memorial was unveiled by John Lambton, 3rd Earl of Durham on 17 December 1921.\nOn the back of the wall is a 2001 memorial to 240 \"Citizens, Servicemen and Servicewomen of the Borough of Hartlepool / who gave their lives in conflict and War during the years from 1919 to 1967.\" There are two bronze plaques each  x  with the town badge of Hartlepool and the initials and surnames of the dead. The David Timlin MBE War Memorial Appeal Fund raised the money for the plaques through public subscription, and as a result there is a commemorative plate acknowledging Timlin's efforts. The memorial plaques were dedicated on 24 June 2001.\nGallery\nFile:Cannon, Heugh Headland, Hartlepool - geograph.org.uk - 1607919.jpg|Cannon, Heugh Headland, Hartlepool.\nFile:Heugh Battery memorial plaque Geograph 1608078 0295fa65-by-Andrew-Curtis.jpg|Plaque marks the first attack on Hartelepool on 16 December 1914 and the first British soldier killed on the British mainland during World War I.\nFile:Memorial to the first British soldier killed on British soil during the Great War - geograph.org.uk - 429905.jpg|Memorial to the first British soldier killed on British soil during the Great War\nFile:Cliff Terrace From the Breakwater - geograph.org.uk - 615003.jpg|Cliff Terrace From the Breakwater With the lighthouse on the right and the war memorial standing in Redheugh Gardens left of centre.\nFile:Earl of Durham Vanity Fair 24 December 1887.jpg|The Earl of Durham as caricatured by Spy (Leslie Ward) in Vanity Fair, December 1887\nSee also\n* Raid on Scarborough, Hartlepool and Whitby – East coast raid during World War I\n* West Hartlepool War Memorial\nNotes\nReferences\nExternal links\n* [http://www.newmp.org.uk/detail.php?contentId=7433 Youth Column (or Winged Victory) memorial] – more information about the memorial\n* Maps\n** [https://maps.google.com/maps?q=54.6958%C2%B0N+1.1768%C2%B0W&hl=en&ie=UTF8&sll=38.875684,-104.758359&sspn=0.274229,0.653687&t=h&z=16 Satellite image of Redheugh Gardens War Memorial]\n** Map that shows both Hartlepool memorials [https://maps.google.com/maps?saddr=54.6850%C2%B0N+1.2144%C2%B0W&daddr=54.6958%C2%B0N+1.1768%C2%B0W&hl=en&ie=UTF8&ll=54.693976,-1.199913&spn=0.025447,0.081711&sll=54.69511,-1.18147&sspn=0.003181,0.010214&geocode=FUhtQgMdQHjt_w%3BFXiXQgMdIAvu_w&t=h&mra=ls&z=14 Map with: A = West Hartlepool WM – B = Redheugh Gardens WM]"
    }
  ]
}