{
  "content": [
    {
      "type": "text",
      "text": "# Redstockings\n\n| founder           =\n| predecessor       = New York Radical Women\n| founding_location = New York City\n| dissolved         =\n| type              = Nonprofit\n| headquarters      = New York City\n| location_country  = United States\n| membership        =\n| membership_year   =\n| website           =\n}}\nRedstockings, also known as '''Redstockings of the Women's Liberation Movement''', is a radical feminist nonprofit that was founded in January 1969 in New York City, whose goal is \"To Defend and Advance the Women's Liberation Agenda\". The group's name is derived from bluestocking, a term used to disparage feminist intellectuals of earlier centuries, and red, for its association with the revolutionary left.\nHistory\nThe group was started by Ellen Willis and Shulamith Firestone in January 1969, after the breakup of New York Radical Women. Other early members included Kathie Sarachild, Patricia Mainardi, Barbara Leon, Corrine Grad Coleman, Lucinda Cisler, Irene Peslikis, and Alix Kates Shulman. Firestone soon split with the group to form New York Radical Feminists, along with Anne Koedt. Rita Mae Brown was also briefly a member during 1970. The group was mainly active in New York City, where most of the group's members resided, and later also in Gainesville, Florida. A group called Redstockings West was started in San Francisco in 1969 but was independent of the East Coast group. Redstockings went through several phases of activity and inactivity; they first split up in 1970 and were formally refounded in 1973 by Sarachild, Carol Hanisch, Mainardi, and Leon. (Willis was involved only peripherally with the re-formed group.)\nOne of the group's earliest actions was on February 13, 1969, when members stormed a hearing of the New York State Joint Legislative Committee on Public Health, which was considering abortion law reform. They objected to the hearing, asking: \"Why are 14 men and only one woman on your list of speakers—and she's a nun?\"  The committee chairman countered that these were the experts on the subject, which further enraged the Redstockings women, whose position was that there were no better experts on abortion than women and that abortion law needed to be repealed rather than reformed.\nAbout a month later, Redstockings soon held its own \"hearing\", an open meeting in the Washington Square Methodist Church, where twelve women testified about their experiences with illegal abortion. The March \"speakout\" was Redstockings' opportunity to hear testimony of those they felt were the experts: \"We are the true experts, the only experts, we who have had abortions,\" one of the twelve said. One of the women in attendance was Gloria Steinem, who would years later identify the meeting as a milestone in her feminist activism.\nIn the early 1970s, Redstockings were noted for their \"speakouts\" and zap actions and street theater on the issue of abortion rights. (This style of protest was emulated by an early-1980s pro-choice group, No More Nice Girls, one of the founders of which was Redstockings veteran Ellen Willis.)\nOn March 3, 1989, Redstockings met again at the Washington Square Methodist Church to commemorate the 20th anniversary of their 1969 meeting, at a speakout called \"Abortion: Women Tell it Like it Is, Was, and Ought to Be...1969-1989.\"\nMore recently, the group leads a project to make available, through the Women's Liberation Archives for Action, radical feminist papers and original source organizing material building on their concept \"History for Activist Use\"; the project also puts out new theory on women's oppression and what to do about it. In 2001, they released a book called ''Confronting the Myth of America: Women's Liberation and National Health Care''. As of 2006, the group is active and operates a website, though Sarachild is the only original member still active with the group.\nIdeology\nThe group is a strong advocate of consciousness raising and what they refer to as \"The Pro-Woman Line\" – the idea that women's submission to male supremacy was a conscious adaptation to their lack of power under patriarchy, rather than internalized \"brainwashing\" on the part of women, as was held by some other radical feminist groups. Consciousness raising was the act by which the theory of \"the personal is the political\" met practice, and was more essential to Redstockings' feminism than organizational membership. Redstockings holds the view that all men oppress all women as a class and that it is the responsibility of individual men to give up male supremacy, rather than the responsibility of women to change themselves.\nRedstockings' relationship to other strands of feminism of the 1970s was complex. Like many other radical feminists, they were critical of liberal feminist groups like the National Organization for Women, whom they viewed as advancing women's liberation only as a type of institutional reform while ignoring the interpersonal power of men over women.  The Redstockings were more influenced by Marxism than other radical feminist groups. However, they strongly rejected socialist feminism (which they referred to as \"politico\" feminism) as subordinating the issue of women's liberation to class struggle. On the other hand, Redstockings were against cultural feminism, which in their view substituted the building of a separatist women's culture for political engagement. (In Redstockings' view, most other tendencies of radical feminism, especially after 1975, were expressions of \"cultural feminism\".) Brooke Williams was a member of the group who critiqued this tendency strongly.\nRedstockings were strongly opposed to lesbian separatism, seeing interpersonal relationships with men as an important arena of feminist struggle, and hence seeing separatism as escapist. (Like most radical feminists of the time, Redstockings saw lesbianism primarily as a political identity rather than a fundamental part of personal identity, and therefore analyzed it primarily in political terms.) Redstockings were also opposed to male homosexuality, which they saw as a deeply misogynist rejection of women. Redstockings' line on gay men and lesbians is often criticized as homophobic.\nWritings\nNotable essays associated with the group include \"The Redstockings Manifesto\" and \"Program for Consciousness-Raising\", as well as \"The Politics of Housework\" by Pat Mainardi. \"The Redstockings Manifesto\" and \"The Politics of Housework\" were included in the 1970 anthology ''Sisterhood Is Powerful: An Anthology of Writings From The Women's Liberation Movement'', edited by Robin Morgan. The Manifesto contains seven sections. The first section briefly introduces women's recent unity in the struggle for freedom from \"male supremacy\" The second section claims women as an \"oppressed class\", and expands upon the class and political implications of women's relationships with men. The third section names \"[m]ale supremacy [as] the oldest, most basic form of domination.\" The fourth section addresses the role of institutions in women's oppression, claiming that institutions are \"tools of the oppressors\". Additionally, this section argues against the claim that women permit or are responsible for their oppression. Instead, the Manifesto claims that men must be changed but that \"any man is free to renounce his superior position provided that he is willing to be treated like a woman by other men.\" The fifth section sets forth Redstockings' primary goal, which is \"to develop female class consciousness through sharing experience and publicly exposing the sexist foundation of all our institutions.\" In order to accomplish this task, honesty is required in order to raise consciousness regarding women's oppression by men. The sixth section briefly outlines Redstockings' assertion that its members \"identify with all women\" and aim to minimize barriers between women both outside of and within the movement. The final section is the Manifesto's call to action. In these final six sentences, the Manifesto calls on women to unite to break from male oppression, and on men to forgo their privilege and endorse the freedom of women from male supremacy.\nThe refounded group published a journal, Feminist Revolution. A nearly complete anthology of articles from the journal was published in 1979 by Random House. The republished anthology, however, omits a controversial report on Gloria Steinem's involvement with a liberal youth group that was later revealed to have been funded by the CIA. The anthology's publication, however, created a lasting rift between members of Redstockings and feminists who were close to Steinem.\nReferences\nFurther reading\n*\n*\n*\n*\n**\n*\n*\n*\n**\n*\nSee also\n* Radicalesbians\n* SCUM Manifesto\n* Valerie Solanas\n* Red Stocking Movement (Denmark)\n* Women's International Terrorist Conspiracy from Hell\nExternal links\n*  Feminist newspaper written and published by radical women in Gainesville.\n* \"She Said, She Said,\" episode 5 of [https://www.thelastarchive.com/ The Last Archive] podcast by Jill Lepore, released July 2, 2020."
    }
  ]
}