{
  "content": [
    {
      "type": "text",
      "text": "# Regan Ware\n\n|    birth_place = Tokoroa, New Zealand\n|         height =\n|         weight =\n|         school = Hamilton Boys' High School\n|     university =\n|      relatives =\n|       position = Wing, Centre\n|    currentclub =\n|         years1 = 2014–2015\n|         clubs1 = Waikato\n|          apps1 = 11\n|        points1 = 0\n|         years2 = 2016\n|         clubs2 = Bay of Plenty\n|          apps2 = 10\n|        points2 = 5\n|         years3 = 2018\n|         clubs3 = Taranaki\n|          apps3 = 8\n|        points3 = 10\n|         years4 = 2020\n|         clubs4 = Bay of Plenty\n|          apps4 = 9\n|        points4 = 5\n|         years5 = 2021\n|         clubs5 = Tasman\n|          apps5 = 5\n|        points5 = 10\n|         years6 = 2025–\n|         clubs6 = Hyderabad Heroes\n|      repyears1 = 2015–\n|       repteam1 = New Zealand 7s\n|       repcaps1 = 303\n|     reppoints1 = 692\n|      repyears2 = 2018\n|       repteam2 = Māori All Blacks\n|       repcaps2 = 1\n|     reppoints2 = 5\n|     clubupdate = 4 August 2024\n|      repupdate = 4 August 2024\n|         medals =\n}}\n|    show-medals = no\n}}\nRegan Edward Ware (born 7 August 1994) is a New Zealand professional rugby union player who plays as a back for the New Zealand national sevens team.\nClub career\nWare was named as a late signing for  during the 2021 Bunnings NPC after a season ending injury to Mark Tele'a. He made his debut for Tasman in Round 5 of the competition against  at Lansdowne Park, coming off the bench and scoring a try in a 51–14 win for the Mako. The side went on to make the final before losing 23–20 to .\nInternational career\nHe debuted for New Zealand at the 2015 Dubai Sevens tournament. Ware was selected for the New Zealand squad for the 2016 Summer Olympics in Rio de Janeiro, Brazil. Of Māori descent, Ware affiliates to the Ngāti Korokī Kahukura and Ngāti Porou iwi.\nWare was part of the All Blacks Sevens squad that won a bronze medal at the 2022 Commonwealth Games in Birmingham. He competed at the Rugby World Cup Sevens in Cape Town. He won a silver medal after his side lost to Fiji in the gold medal final.\nIn 2024, He was named in the New Zealand sevens squad for the Paris Olympics. He played in the matches against Japan and South Africa before sustaining an injury, he was replaced by Joe Webber.\nReferences\nExternal links\n*"
    }
  ]
}