{
  "content": [
    {
      "type": "text",
      "text": "# Regional heritage\n\nRegional heritage consists of the natural and cultural environments and associated intangible cultural heritage that is perceived to be of importance in a region. The word “regional heritage” is a parallel to the word world heritage but does not refer to a specific object, but rather sets of sites, buildings and landscapes perceived to be valuable. Regional heritage are not formally appointed. Instead, it is subject to constant evaluation and discussion, and appears more or less clearly in the consensus among local, regional and national stakeholders.\nRegional heritage is physical environments, as perceived by humans. And in addition, its history, stories, customs and the \"genius loci\" that are constantly recreated and is transferred from generation to generation, creating a sense of identity and continuity.\nKeith Dewar writes: \"Heritage can be world heritage, regional heritage, or it can belong to a particular culture or simply to an extended family. Heritage should not be seen simply as cultural elements, since the natural environment also contains places of significance. Heritage value can be found in a national park or a farm woodlot. Natural sites are not necessarily in the past; they exist and are alive in the present.\"\nSee also\n*World heritage\n*Cultural heritage\n*Natural heritage\n*Intangible cultural heritage\n*Cherokee Strip Regional Heritage Center\nReferences\n* Ylva Blank & Malin Weijmer “The Spatial Scales of Cultural Heritage: National, European and Regional Heritage Policy”, Nordisk Kulturpolitisk Tidskrift, 12(2) 2009, s. 55–83.\n* Cunningham, A. B. ”Indigenous knowledge and biodiversity: global commons or regional heritage?”, Cultural Survival Quarterly, 1991.\n* Keith Dewar “Heritage”, i J. Jenkins, J. J. J. Pigram, Encyclopedia of Leisure and Outdoor Recreation, Routledge, 2003, s. 224.\nExternal links\n* [http://www.wrhf.org/ Waterloo Regional Heritage Foundation]\n* [http://www.csrhc.org/ Cherokee Strip Regional Heritage Center]\n* [http://www.redlakemuseum.com/ Red Lake Regional Heritage Centre]\n* [http://www.wellingtonheritagepromotions.org.nz/ Wellington Region Heritage Promotion Council]\n* [http://www.regionarv.se Regionarv Småland]\n* [http://www.vgv-birkenfeld.de/_birkenfelder-land/index.php?nav=regionale_highlights&secnav=goetterallee&teaser= Regional-Erbe Birkenfelder Land]"
    }
  ]
}