{
  "content": [
    {
      "type": "text",
      "text": "# Religion in the Inca Empire\n\nworshiping the Inti inside the Coricancha, representation of Martín de Murúa]]\nThe Inca religion was a group of beliefs and rites that were related to a mythological system evolving from pre-Inca times to Inca Empire. Faith in the Tawantinsuyu was manifested in every aspect of his life, work, festivities, ceremonies, etc. They were polytheists and there were local, regional and pan-regional divinities.\nIt has been noted that aspects of the Andean religion extend well beyond the border of the former Inca Empire into the lands of the Mapuches and Huilliches in southern Chile, which has raised the hypothesis whether there is a prior dissemination of Andean religion from Tiwanaku.\nDuality\nA theme in Inca mythology is the duality of the Cosmos. The realms were separated into the upper and lower realms, the hanan pacha and the ukhu pacha and urin pacha. Hanan pacha, the upper world, consisted of the deities of the sun, moon, stars, rainbow, and lightning while ukhu pacha and urin pacha were the realms of Pachamama, the earth mother, and the ancestors and heroes of the Inca or other ayllus. Kay pacha, the realm of the outer earth, where humans resided was viewed as an intermediary realm between hanan pacha and ukhu pacha. The realms were represented by the condor (upper world), puma (outer earth) and snake (inner earth).\nAsymmetrical dualism is especially important in Andean worldview. Asymmetrical dualism is the idea that reality is built by forces that are different and compromised but need each other to be complete. Additionally, one force is slightly larger or more powerful than the other, leading to a disparity between beings and forces. This disparity is the foundation of reality and which causes things to happen. Throughout Andean thought, this asymmetrical dualism can be seen in the dispersion of life force or vitality throughout the land. Camac is the life force that inhabits everything in reality. It does not distinguish between living and dead and inhabits things in different quantities. This life force permeating different places at different times gives recognition to certain places or objects. These places and objects were regarded as holding special energy and were collected under the title of wak’a.\nSacred sites or things named ''wak'a were spread around the Inca Empire. In Andean mythology a wak'a was a deific entity which resided in natural objects such as mountains, boulders, streams, battle fields, other meeting places, and any type of place that was connected with past Incan rulers. A wak'a could also be an inanimate object such as pottery which was believed to be a deity-carrying vessel. Spiritual leaders in a community would use prayer and offerings to communicate with a wak'a for advice or assistance. Human sacrifice was part of Incan rituals in which they usually sacrificed a child (qhapaq hucha) or a slave. The Incan people thought it was an honor to die as an offering.\nArchaeological remains confirm such human sacrificial practices, according to Reinhard and Ceruti: \"Archaeological evidence found on distant mountain summits has established that the burial of offerings was a common practice among the Incas and that human sacrifice took place at several of the sites. The excellent preservation of the bodies and other material in the cold and dry environment of the high Andes provides revealing details about the rituals that were performed at these ceremonial complexes.\"\nDeities\nInca deities occupied the three realms:\n*hanan pacha, the celestial realm in the sky.\n*ukhu pacha, the inner earth realm.\n*kay pacha'', the outer earth realm, where humans live.\nDeities of the official pantheon\n*Viracocha: He was typically personified as a human male, and known as the creator of humanity and everything else in the world.  In Inca Water Worship and Religion, it states, \"He created humanity on an island in Lake Titicaca on the border between modern Peru and Bolivia and taught people how to live, assigning them tribal dress and customs and determining where they should live.\" After this occurred, Viracocha gave control over humanity to lower gods then disappeared. When the Spaniards came to the Inca territory, the Inca thought they were god like because of their similarities in appearance with Viracocha. Viracocha is often depicted as one of a triad of gods with Inti and Inti-Illapa. Not to be confused as a trinity (as later Christians would do), the three gods had multiple, overlapping personalities. There does not seem to be any major ceremonies devoted to him as well, as a small priesthood and only a few shrines dedicated to him.\n* Inti:  Inti was one of the most important gods to the Inca people and known as the sun god. He is typically viewed as a boy from the Inca society and was also known as a golden disk with fire-like rays coming and a face in the middle. The image of Inti as a boy with sun rays protruding from his head is reflected in the principal idol of Inti that was created by Pachakuti. Named Punchao, this idol bridged the expanse between the Sun and humanity, as Inca rulers’ vital organs were burned, and the ash stored inside the statue. The Inca believed the sun was a key element for agriculture by protecting and helping with the growth of their crops. The temple dedicated to Inti was the Coricancha (a.k.a. The Golden Enclosure), which was one of the most important temples for the Inca people. Inside Coricancha was a miniature field of corn and the corn was made out of gold. Annually, the emperor would \"farm\" this as a tradition. Viracocha did not start out as the top deity in Inca religion, Inti was the first original and most powerful god. The transition from Inti to Virachocha has a couple of theories including: 1. The Inca society and people developed intellectually and started to question Inti's power. They questioned why an all-powerful god did the same thing every day. 2. The society moved forward and they started going more towards Henotheism. Since Viracocha was seen as a human, they saw this as being more powerful.\n* Illapa (Inti-Illapa): The name of this god means thunder and controls things like weather, rain, and lightning. The Inca valued this god because Illapa was in control of the weather and the growth of their crops. Many of the Inca society saw the image of this deity as a man wearing a sling. Every time that Illapa used the sling, it would create the thunder heard by the Inca people.\n* Kon (Wakon): The Inca rain god extended beyond its agricultural significance to encompass its role in spiritual beliefs and rituals. This god was perceived as a divine entity capable of both providing life-giving rains and unleashing destructive floods, highlighting the complex relationship between the Inca people and the forces of nature. Integrated into broader cosmological beliefs, reflecting the interconnectedness of water, life, and spirituality in Inca culture\n* Mamaquilla (Kilyamama): The name of this god in the Inca language can be translated into Mother Moon. The Coya, or Incan queen was considered to be the daughter of Mamaquilla and leader of moon worship. All of the Inca society recognized this deity as female who was also seen as a silver disk with a face in the middle. She was the wife of the deity Inti and was also in control of calendars. This god was in charge of calendars because of the moon's cycle which the Inca could track.  All the temples that worshiped Mamaquilla were worked on by priestesses.\n* Pachamama: The name of this god translates to Earth Mother and is known as a female among the Inca society. The Inca saw her as a protector of their crops/fields and a god of fertility to help their crops grow. Pachamama embodies a gendered understanding of nature, representing both a maternal nurturing force and a powerful deity. Pachamama is portrayed as a source of fertility and abundance in Bolivian indigenous belief systems, influencing agricultural practices and environmental administration. Pachamama embodies the interconnectedness of life and nature, serving as a central figure in rituals and ceremonies that honor the earth and its resources.\n* Mama Cocha: The meaning of this god's name from the Inca language is Mother of Lakes and is widely known as a female. The job of this deity is to keep the world strong and provide sources of water.\n* Stellar Deities: These are deities formed using constellations or other cosmology features and are mostly believed to be of animals or activities. In the book Inca Water Worship and Religion, an example would be \"Urcuchillay, which is known to western astronomers as Lira, [who] was thought to protect llamas and alpacas.\" Another important stellar deity was Qollqa (Pleiades). This constellation was honored because she was the mother of all other stellar deities. When the constellation appeared after not being visible for 37 days, the start of the agricultural year was marked.\n* Huacas:  Anything, including people, places, and objects, in the world that the Inca believed had a supernatural spirit, were called Huacas. The size of the Huaca determined how much power it had. For example, mountains were considered some of the more powerful Huacas. The Inca worshiped and cared for them similar to the other deities.\nHousehold gods\nIn addition to the communally worshiped deities, Incan families sometimes worshiped household gods via their representation as miniature figurines most commonly referred to as  or .  were often natural or carved stone objects that resembled crops or livestock, such as  for maize,  for potatoes and  for llamas.\nOrigin\nThe Incas had an immense number of origin stories that historians and scholars have trouble deciphering and sorting out. These stories often contradict themselves, seeming to retell the story at a later point to include information and events that had occurred. Many of the origin stories of the Incas had life begin at Lake Titicaca. The story has the Creator god Wiraqocha Pachayachachic form giants to see if humans would work well at that size. When he found that they did not, he made them of his own size. These humans were hubristic and greedy, and thus were turned to stone or other forms and some were engulfed by the stone or sea. The Creator then summoned a great flood to destroy the land and all life on it except for three men, who would later help create humans again. At a later point at Lake Titicaca, the Creator made the sun, moon, and stars. The moon shone brighter than the sun, and being filled with jealousy, the sun threw ashes in her face to dim her shine. The Creator then spread out with two servants to call forth the people of every nation, from every mountain, crevice, cave and lake before walking over the water into the west.\nThe origin stories of the Incas reflect an attitude of change, where the past could be changed to better situate the present. This allowed for the possibility of new peoples and lands being discovered having been present from the very beginning. The origins of the Incas however do not represent the origin stories of other pre-Incan Andean peoples. There are vastly more versions and stories that predate and play into the Incan stories. Inca origin and religion draws from many local and ancestral traditions. The official tradition of the Inca Empire was the cult of the Sun, but the Incas allowed locals to worship their existing beings. Many people thought that their founding ancestor arose from an exact spot, a paqarisqa. These locals worshiped their gods through pilgrimages, offerings, and other rites that allowed them to keep true to tradition while still providing necessary sacrifices and offerings to the Sun god.\nReligious expansion\nReligious traditions in the Andes tended to vary among different ayllus. While the Inca generally allowed or even incorporated local deities and heroes of the ayllus they conquered, they did bring their gods to those peoples by incorporating them in law such as required sacrifice. The Inca attempted to combine their deities with conquered ones in ways that raised the status of their own. One example of this is Pachamama, the goddess of Earth, who was worshiped long before the rise of the Inca. In the Inca mythology Pachamama having been integrated was placed below the Moon who the Inca believed ruled over all female gods.\nDivination\nThe Incas also used divination. Divination was used to inform people in the city of social events, predict battle outcomes, and ask for metaphysical intervention.\nDivination was essential before taking any action.  Nearly every religious rite was accompanied by sacrifices.  These were usually maize beer, food or llamas, but were occasionally of virgins or children.\nDivination was an important part of Inca religion, as reflected in the following quote:\n}}\nMummification\nRulers in Peru, such as the Inca ruler Huayna Capac, were often mummified upon the time of their death, allowing for their bodies to be worshipped within the palaces. These worshipping events were intercepted by the Spaniards under Polo de Ondegardo, who was newly appointed as Corregidor (Chief Magistrate) of Cuzco in 1559, when it was under Spanish control. Ondegardo conducted a massive effort to prevent the Inca from committing their “idolatrous sins”, mainly by locating the mummified bodies of late Inca kings and sending them to the viceroy in Lima. They remained in a hospital for around 80 years before their whereabouts became unknown. The Inca used to mummify their kings and several times a year they would be aligned in accordance to when they chronologically ruled in Cuzco's plaza for the public to pay their respects. In the other parts of the year, the mummies were returned to the Cuzco palaces and were worshipped privately by groups of visitors. Francisco Pizarro stated that “It was customary for the dead to visit one another, and they held great dances and debaucheries, and sometimes the dead went to the house of the living, and sometimes the living came to the house of the dead”. The kings were thought to have been able to speak back to the worshippers through the use of oracles, and even gave advice to the protection and ruling of the land. The ruling Inca was expected to seek advice from the mummies of his ancestors for important issues. Not all Inca mummies were glorified, however, as in one case Topa Inca Yupanqui's mummified body was torched and his bloodline all killed as they sided with Huascar in the civil war.\nInca mummies were seen as possessing agency, not really alive nor dead, more of an animated death. Terence D'Altroy said that, “royal mummies ate, drank, visited one another, sat at council, and judged weighty questions.” Mummies participated in ceremonial roles that allowed them to be consulted as advisors in times of distress. Originally kept on royal estates, the descendants eventually thought that by staying in his own house, a mummy could be better served and watched over.  The mummies played such an important role in politics that there are instances of mummies being married. One such story is that Washkar had his mother marry his father's mummy in order for him to receive a legitimate ruling claim.\nUpon the arrival of the Spanish, the Inca started to hide the bodies of the kings and become more secretive with their worship, as stated by Juan de Betanzos. After being appointed, Polo do Ondegardo and his men found most of the mummified kings and took their bodies along with other ritualistic items such as their , or their statues. A popular thought is that Ondegardo had the bodies buried in or around Cuzco in secret so that they would not be uncovered and worshipped again. Garcilaso de la Vega visited Ondegardo's house and was shown an assembly of embalmed kings and attested to the degree of their preservation: “The bodies were perfectly preserved without the loss of hair of the head or brow or an eyelash. They were dressed as if they had been in life, with Ilautus (royal headbands) on their heads... their hands were crossed across their breast.”. The mummies were afterwards sent to the viceroy for him to see them and then afterwards they were brought back to Cuzco and thought to be secretly buried. The viceroy stored the mummies in the Hospital of San Andrés in Lima because he was “a major benefactor of it”. Since the hospital was solely for the Spanish residents, they were likely on display for the citizens to view, away from the natives.\nIn Cusco\nBecause of their immediate defeat at the hands of the Spanish, much information surrounding Incan religion has been lost. Many historians rely on the religious customs of conquered Incan subjects to gather information about Incan beliefs. The Incans adopted most if not all of their religious beliefs from three main groups that lived around Peru. These groups were the Wari, the Chavin and the Nazca. With the combination of all three of these ancestral societies’ religions, the Incas were able to create a religious system that dominated almost every aspect of life in the empire.\nThe Incas were profoundly religious, and so it makes sense that their religious structure was very complicated. The religion was centralized in the capital city of Cusco. Within Cusco, a highly complicated and organized calendar controlled the state religion's festivals and holy days. This calendar was responsible for almost all of the religious ceremonies that took place throughout the empire. Within the city of Cusco, there were also over three hundred and twenty eight huacas or sacred objects. Huacas were located throughout the empire with most of them happening to be around the capital city. Within the capital city there was also a quipa. The quipa described all the sacred places and how they are to be used during ceremonies and sacrifices. Each sacred place or huaca was organized into forty-one different directions called ceques. These ceques started from the central temple of the Sun called Coricancha or \"the golden enclosure\".\nThere were ten groups of Incan nobility that were in charge of being priests within the city of Cuzco. These ten groups of nobility were called panacas. The panacas had a vital role to Incan society in Cusco because they were in charge of worship for the deities. All of the religious aspects that took place around the city were organized and arranged by this special group of nobility. The members of these ten groups were said to have a first royal ancestor that had conquered the valley. The panacas were decided through mother's rank, fraternal succession, choice, and the success and honor of the individual on the battlefield. These ten groups were then divided into two smaller groups, one representing Hanan who lived north of the valley river and also Hurin who lived south of the valley river. The Hanan and Hurin each consisted of five groups of nobility. It is known that the first group of each of the Panacas dedicated all their sacrifices to the sun. The remaining four were in charge of dedicating their sacrifices to Moon, Thunder, Virachoa, and the Earth. These groups of nobility made up the uppermost tier of society, and they were highly revered and respected throughout the empire.\nThese five gods or entities that received the majority of sacrifices in Cusco represent the most vital aspects of Incan life. The Sun God represented the institutional organization of the society because everything in Incan life revolved around the Sun. Virachoa is also known as Apu Qun Tiqsi Wiraqutra and is considered the creator of civilization. He is one of the most, if not the most, powerful gods in Incan mythology. The sacrifices to Virachoa represent how much the Incans relied on outside forces to explain events in their daily lives. The sacrifices to Thunder represent the handling of transitions in life and society. The sacrifices to Earth and Moon show the fertility of the Earth and nature. All ten groups of nobilities had the responsibility to explain and account for all the occurrences of the natural world in and outside of the Incan empire.\nFestivals\n, Cusco]]\n, 2005]]\nThe Inca calendar had 12 months of 30 days, with each month having its own festival, and a five-day feast at the end, before the new year began. The Incan year started in December, and began with Qhapaq Raymi, the magnificent festival.\n{| class=\"wikitable\"\n!Gregorian month !!Inca month !!Translation\n|-\n|January   ||Camay  ||Fasting and Penitence\n|-\n|February  ||Hatun-pucuy ||Great Ripening\n|-\n|March     ||Pacha-puchuy ||Earth Ripening\n|-\n|April     ||Ayrihua or Camay Inca Raymi     ||Festival of the Inca\n|-\n|May       ||Aymoray qu or Hatun Cuzqui     ||Harvesting\n|-\n|June      ||Inti Raymi   ||Feast of the Sun and the great festival in honour of the sun for the harvest\n|-\n|July      ||Chahua-huarquiz, Chacra Ricuichi or Chacra Cona ||The Harvest Festival\n|-\n|August    ||Yapaquis, Chacra Ayaqui or Capac Siquis ||Sowing month\n|-\n|September ||Coya Raymi and Situa   ||Festival of the Moon and Purification festival\n|-\n|October   ||K'antaray or Uma Raymi    ||Month of crop watching\n|-\n|November  ||Ayamarca     ||Festival of the dead\n|-\n|December  ||Capac Raymi  ||Magnificent festival\n|}\nThe Qhapaq Raymi was the first and biggest festival of the year. During this festival, Inca boys went through their puberty rites as they entered adulthood. Additionally, public events of drinking, dancing, and eating llama blood cakes occurred to venerate the Sun god.\nInti Raymi, perhaps the second most important festival, occurred during the month with June's solstice. Like the Qhapag Raymi, the Inti Raymi focused on celebrating the Sun god, with day-long chanting that escalated at noon and diminished till sunset. The festival lasted eight or nine days and was filled with offerings of chicha, coca, and other items that venerated the Sun god. At the end of the festival, the Inca ruler was the first to plow the earth, signaling the beginning of the plowing season.\nIn the month of Qoya Raymi the Situa, a ceremony of purification, was performed that started in Cuzco and expanded out in the four directions. Performed in the rainy season, due to a higher number of illnesses, residents of Cuzco beat each other with torches and shook clothing outside to rid themselves of disease. Then four groups of 100 people left with sacrificial ashes along the four roads out of Cuzco, the roads of Kollasuyu, Chinchaysuyu, Antisuyu, and Cuntisuyu. The runners took the ashes along these roads and passed them off to people of lesser social status who continued the carrying of the burden. When they reached a designated area, they would bathe in a river, ridding Cuzco and its peoples of impurities.\nSee also\n*Andean world\n*Inca mythology\n*Inca cuisine\n*Spanish conquest of Peru\n*Huarochirí Manuscript\n*Muisca religion\n*Yanantin\nReferences\nReading list\n* Sullivan, E. Lawrence. Native Religions and Cultures of Central and South America. New York and Londo: Continuum, 1997.\n* MacCormack, Sabine. Religion in the Andes. Princeton, New Jersey: Princeton Press, 1991.\n* [http://0-search.eb.com.tiger.coloradocollege.edu:80/eb/article-69447 \"pre-Columbian civilizations.\"] Encyclopædia Britannica. 2006. Encyclopædia Britannica Online. 19  Sept  2006.\n* Conrad, Geoffrey W. Religion and Empire: the dynamics of Aztec and Inca expansionism. Cambridge, New York: Cambridge University Press, 1984.\n* Pugh, Helen Intrepid Dudettes of the Inca Empire. 2020.\nExternal links\n* [https://www.worldhistory.org/Inca_Religion/ Inca Religion – World History Encyclopedia]\n* [https://web.archive.org/web/20070305220022/http://philtar.ucsm.ac.uk/encyclopedia/latam/inca.html \"Inca Religion\"], Elliott Shaw (General Editor), Overview of World Religions, PHILTAR, University of Cumbria"
    }
  ]
}