{
  "content": [
    {
      "type": "text",
      "text": "# Renaissance garden\n\nA Renaissance garden is a garden or park created in the era and style of the Renaissance. Because the first such gardens originated in Italy, they are sometimes called Italian gardens. However, gardens made later in Germany, France, or England might have had some differences compared to the original Italian gardens.\nContemporary development\nThe fundamental design of the Renaissance garden has its roots in Italy. A new outlook on life began to take hold here during the end of the 15th century, with a return to forms, values, and ideas from antiquity, which influenced not only the humanities but also architecture and horticulture. The concept of humanism also led to a new understanding of gardens as well. Medieval limitations were abandoned, and instead of focusing on castles and fortifications, palaces and villas started to emerge. Nature took on a new significance. Also, the representational needs of the enlightened urban upper middle classes were to be taken into consideration, who were increasingly developing retreats for leisure and contemplation outside of cities, particularly in northern Italy.\nwere designed by Niccolò Tribolo]]\nAntiquity and humanism\nThe Renaissance witnessed a significant transition towards the literature and culture of classical antiquity, which often contradicted the views of the late Middle Ages. Within this movement, humanism emerged as the \"scientific-spiritual side,\" emphasizing the ancient concept of culture and the ideal of humanity as desires and goals. The educated individual became the ultimate objective of humanistic education.\nin France with its ornamental geometric and kitchen gardens]]\nProminent figures of that era sought inspiration from ancient authorities like Vitruvius or Ovid when creating living spaces, aiming to recreate the ambiance of classical antiquity. Beautiful settings such as the Golden Age, the gardens of the Hesperides, the Nymphs and the Muses, or the Elysian fields of Homer and Virgil were depicted in the literary works studied for designing these spaces. Detailed literary descriptions of Roman gardens, such as those of Lucius Licinius Lucullus on the Pincio, Gaius Maecenas on the Esquiline, Sallust's Horti Sallustiani, Julius Caesar's gardens in Trastevere, the imperial gardens on the Palatine Hill, and notably, Nero's vast Domus Aurea  (which are based on Suetonius's De vita Caesarum extended over a hundred hectares and contained meadows, arable land, vineyards, orchards, and artificial lakes), served as valuable models. Renaissance gardens’ design language was influenced by the revived aesthetics of Greek and Roman antiquity, embracing orderly homogeneity, and the use of staircases, sculptures, and water features.\nNature\nThe master builders of the Renaissance epoch aimed to achieve a balance between architecture and nature with their ideals. Today, the Renaissance garden is called the \"third nature\" - in distinction from the first (untouched) and second (cultivated) nature:\n]]\nThe garden was intended to be an aesthetic image of rurality (Ruris imitatio) in contrast to the hustle and bustle of the city, which allegorically understood nature had produced artificial-looking formations. Nature was re-evaluated; it became the surface on which new happiness in life could be experienced. It was about the connection, or even the competition, between art and nature:\n. It was the best-known Renaissance garden in Germany and a model for similar gardens in other German residences.]]\nSince Francesco Petrarch, the ideal of the country villa and garden as a refuge spread in Italy.\nChristianity\nThe immense significance of the church at that time led to the development of a garden architecture that combined Christian ideals with the ideas of antiquity: from the confined garden spaces (Hortus conclusus) of the medieval cult of Mary to the open Garden of Eden. According to Ulisse Aldrovandi, in a paradiso terrestre, \"spirit and soul would be free from lower drives.\" Erasmus of Rotterdam's influential work, Convivium religiosum, published in 1522, described the transition from the monastic-style hortus conclusus to the Christian-style Renaissance garden. The basic attitude of Renaissance humanism is optimism, where the spiritualization of the world consistently reflects a positive affirmation of the world.\nIn addition, the design of Renaissance gardens also incorporated elements from Arabic horticultural traditions, often with a Christian reinterpretation. One example is the usage of cascades, such as \"salsabil,\" which did not always require the use of stairs and may have originated from ancient Roman practices. These Arabic-inspired elements were integrated into the overall design of the gardens, adding a distinct and diverse touch to the Renaissance aesthetic.\nGeometry and interrelations\nin Austria]]\nFirst and foremost, the use of classical order structures, such as perspective, proportion, symmetry, circles, quadrilaterals, and triangles, was a reflection of the strong connection and admiration for the aesthetics of antiquity during the Renaissance. Garden architects tried to achieve this by extending natural geometric structures (a symbol of cosmic order) to larger units.  As a result, the Renaissance garden is often categorized as a type of geometric garden due to its variety of geometric forms and plant structuring. The interrelationship between outdoor space and the building was recognized, and builders and garden designers worked to integrate them into a single entity.\nIn 1452, the architect Leon Battista Alberti dedicated his work \"De re aedificatoria\" (On Architecture) to Pope Nicholas V. In this work, Alberti drew inspiration from Pliny the Younger's descriptions of gardens in ancient Rome. Alberti incorporated these ideas into his guidelines for the selection, placement, decoration, and arrangement of villas. These principles were applicable to both the design of palaces and gardens, reflecting a unified approach to creating harmonious and aesthetically pleasing spaces.\nThe allegorical novel \"Hypnerotomachia Poliphili,\" written by Francesco Colonna and published in 1499, played a pivotal role in shaping Renaissance garden art. The novel, which at the time was considered the bible of garden design, narrates the story of Poliphilus, the protagonist, who visits an island with a vast garden that is incredibly beautiful and meticulously documented. In this garden, the richness of nature blends with the refined elegance of geometric forms. Many influential garden designers of the Italian Renaissance drew inspiration from the novel's garden concepts, incorporating them into their own designs.\nLandscape structures\nIn Italy, the earliest Renaissance gardens were established either within existing city castles or as part of newly constructed countryside villas. Older fortification constructions were repurposed to accommodate these gardens. The spatial constraints of these areas provided the foundation for the new gardens’ design. Country residences, often situated on slopes, required the gardens to be laid out on terraces to accommodate the natural terrain. This arrangement was in line with the concepts of garden planners, as it allowed for the inclusion of perspectives, axes, stonework, and most importantly, water features. In urban settings, attempts were made to incorporate terrace forms into gardens, although this was not always feasible. The smallest garden units found within cities were known as Giardini segreti (secret garden).\nDesign elements\nin Salzburg date from the late Renaissance period and were commissioned by Prince Archbishop Markus Sittikus von Hohenems in the early 17th century]]\nThe Renaissance gardens varied in their form across different regions, such as Italy, France, and German-speaking areas. These differences were primarily influenced by the circumstances surrounding their creation. New gardens in Italy were often established in previously undeveloped rural locations. In contrast, gardens in France and German-speaking regions were often built within existing castles and palaces, utilizing available spaces, and frequently repurposing former fortifications. The distinct requirements and preferences of the builders also contributed to the variations. The French gardens were often commissioned by members of the higher nobility, whereas the creation of gardens in Italy saw a greater involvement from the affluent patrician class. The climate also had an impact on determining design options. Despite these regional distinctions, there were stylistic elements that were shared.\nBasic structures\nStone boundary walls, derived from medieval horticulture, were often used to enclose the gardens. Axes, such as avenues, walkways, canals, or arcades, were introduced as overarching elements that structured the garden's perspective while taking the location and architecture of the buildings into consideration. The overall layout typically consisted of different sections within the garden complex, such as pleasure gardens and kitchen gardens, which were designed to interact with each other and harmonize with the surrounding natural environment. In the classical Renaissance garden, there were often up to four roughly equal rectangular areas, known as ''All'italiana-Parterre, which featured strong geometric shapes such as squares, rectangles, diagonals, and circles. These areas were often enclosed by galleries with corner pavilions. Another distinctive feature of the Italian Renaissance garden was the grotto, a hidden and mysterious place that symbolized a passage to the underworld or a secret retreat within the garden.\nPopular planting forms in Renaissance gardens included knotted parterres, borders, hedges, avenues, pergolas, and treillages. The gardens were accentuated with topiaries and ornamental features, often using boxwood. In certain complex gardens, such as those designed by Sebastiano Serlio, early elements of labyrinths can be observed.\nCommonly utilized bulbous plants included hyacinths, lilies, various species of iris, and tulips. In Italy, where rainfall patterns were irregular, it was common to place these plants in terracotta pots for cultivation.\nTerraces\nTerrace steps connected by stairs were built in accordance with the size and characteristics of the property. The Italian villa culture flourished on the climatically favorable mountain slopes of Latium, Tuscany, and Liguria. Due to the prevalence of malaria, the lowlands were considered unsuitable. Even in the Venetian terraferma, the only area in Italy where villegiatura (vacationing in the countryside) developed in flatlands, early villas were built on the few hills available. The terraced layout allowed for the creation of intricate staircases or belvederes, offering panoramic views.\nWater games\nDue to the scorching summers in Italy, the presence of springs and natural watercourses was a must for designing gardens. Water served not only as a means of irrigation but also as a focal point for many renowned Renaissance gardens, showcasing stunning water features known as Giochi d'acqua'' or water features. These water elements not only served practical purposes but also expressed a romantic admiration for nature. As the Renaissance garden evolved into Mannerism, water features became more elaborate. In addition to water basins and flooded caves, fountains, cascades, and playful water features, such as joke fountains that would surprise visitors by splashing them when stepping on a specific floor slab, were created to provide unexpected effects. Notable examples of grand water features include the cascades of Villa d'Este and the Neptune Fountain in the Boboli Gardens at Palazzo Pitti in Florence.\nOther elements\nIn the gardens of the late Renaissance and Mannerism, there were deliberate violations of the principle of harmonious design, exemplified by buildings intentionally constructed at unconventional angles (such as in the Sacro Bosco in Bomarzo) and the use of oversized masks in the garden of the Giusti Palace near Verona.\nDemarcation from the Baroque garden\nThe exquisite Baroque garden was a continuation and enhancement of the serene Renaissance garden. Both are part of one idea, which they represent as a complete work of art. Geometry acts as the connecting element in the utilization of stone and plants. The Baroque Garden served as a grand and public environment with a clear message, where all aspects were secondary to the overall design, in contrast to the Renaissance Garden, which sought to create intimate and isolated spaces. As a result, the Renaissance garden remained a loose association of individual, yet coherent, adjacent garden spaces. The Baroque garden, on the other hand, was a fully composed and centrally oriented overall complex. Whereas in the Renaissance garden, nature was brought into the garden as an expression of the new humanism, the Baroque garden imposed rationalistic structures on nature. The old garden style emphasized concentration, while the new one expanded in scope and ambition.\nUnlike the Renaissance garden, the Baroque park did not emphasize high terraces, belvederes, and elaborate staircases. Instead, it focused on extensive sculptural decoration. However, certain elements like grottoes, cabinets, and pleasure houses were still incorporated. The usage of bricks in architecture gave way to plant-based architecture, where plants played a central role. The Baroque Garden as opposed to Renaissance Garden, relied on standing water elements. Knotted parterres were replaced with intricate broderie parterres. The visual axis became the dominant feature in the garden's staging, with all floral arrangements and horticultural design elements serving the overall ensemble. The perfection of the Baroque garden became a symbol of royal absolutism, contrasting with the ideals of the Renaissance. Furthermore, the Baroque garden marked the integration of garden art as an equal form of artistic expression alongside other genres.\nImportant Renaissance gardens\nwith trees, boxwoods, and vines]]\nIt is improbable that original(pure) Renaissance gardens remain in their pristine form today. There are reconstructed complexes and those that have been preserved in the outlines of their structure. Thus, walls, staircases, terraces, fountains, grottoes, and even sculptures can be authentic. However, perspectives about the planting of these gardens differ. Gardens are by definition transient because the plants and structures they support flourish and eventually vanish. The architecture of the garden is constantly evolving, gardens are reshaped; the subsequent epochs of Baroque gardening, as well as English landscape gardening, did not survive the then-widespread Renaissance gardens untouched.\nin Tivoli: transverse axis with fish ponds, Neptune fountain and a water organ]]\nDuring the early 16th century, a notable Renaissance garden was established on the site of the current Belvedere courtyard and the Vatican Apostolic Library. This garden is regarded as the first example of a Renaissance garden, and its creation and design are well-documented. It was designed by Donato Bramante in 1503 under the commission of Pope Julius II, drawing inspiration from the architectural principles of Leon Battista Alberti. Although the Vatican Garden did not persist long, Bramante's innovative design language made an impression. In France, Jean Androuet du Cerceau emerged as an influential architect of Renaissance gardens. Around 1500, the first French Renaissance garden was created at the royal castle of Amboise.\nAmong the renowned Renaissance gardens, the Villa d'Este in Tivoli stands out as one of the most famous examples in Italy. However, the reconstructed park at Villandry is the sole surviving Renaissance garden in France. In Germany, the restoration of the Renaissance garden at Heidelberg Castle (Hortus Palatinus) was planned, which was once hailed as the \"eighth wonder of the world\" and now showcases elements of an English landscape garden. The Renaissance garden at Berg Castle in Saarland is also a popular tourist attraction. The \"hanging gardens of Neufra\" at the castle in Neufra were restored in 1988. Furthermore, the Bishop's Palace in Kielce Poland unveiled a rebuilt Renaissance garden on its west side in 2003.\nList\n* Park of the Villa d'Este in Tivoli\n* Gardens of the Medici Villas in Tuscany\n* Park of Château de Villandry near Tours\nSee also\n* Baroque garden\n* Italian garden\nReferences\nExternal links\n* [https://commons.wikimedia.org/wiki/Category:Renaissance_gardens?uselang=de Commons: Renaissance Garden]  - Collection of images, videos, and audio files\n* Luzius Winkler, [https://www.hev-zuerich.ch/der_zuercher_hauseigentuemer/jahr-2005/ms-art-200508-17.htm Italian Gardens in and around Florence]\n* Jürgen Reinke, [http://www.burgendaten.de/ Castle Database] : Italian Renaissance Garden\n*"
    }
  ]
}