{
  "content": [
    {
      "type": "text",
      "text": "# Renaissance Cincinnati Downtown Hotel\n\n| start_date      =\n| completion_date = 1901\n| building_type   = Hotel\n| architectural_style = Neoclassical\n| antenna_spire   =\n| roof            =\n| top_floor       =\n| floor_count     = 19\n| room_count      =\n| unit_count      =\n| elevator_count  = 9\n| cost            =\n| floor_area      = 266,000 sq ft\n| engineer        =\n| contractor      =\n| developer       =\n| owner           =\n| management      = Columbia Sussex\n| status          = complete\n| architect       = D.H. Burnham & CompanyGraham, Anderson, Probst & White\n| refnum    = 08000802\n}}\n| references      =\n}}\nThe Renaissance Cincinnati Downtown Hotel (previously known as the Bartlett Building and the Union Trust Building) is a historic building in downtown Cincinnati, Ohio, located at 4th & Walnut Street.  The 19-story tower was the tallest building in the state for 3 years until completion of the Fourth & Walnut Center.\nThe Union Trust Building was dedicated January 1, 1901. In 1985, the skyscraper was renamed for its new owners, The Bartlett Company. The company sold the building for $8 million in 2006. At the time, it was also home to Fosdick & Hilmer (engineering firm), an American Airlines reservation center, CVS Pharmacy, Phillip Bortz Jewelers, and Jimmy John's among many others. In June 2010, after a second failed sale of the building, Fifth Third Bank foreclosed on the property and all tenants vacated the building.\nAn affiliate of Columbus real estate firm E.V. Bishoff Co. acquired the building on February 8, 2013 for $535,000, ending more than five years of legal limbo for the vacant tower. In May of that same year, it was announced that the building would be converted into a $33 million hotel. On July 25, 2014, Columbia Sussex reopened the building as the Renaissance Cincinnati Downtown Hotel with 283 rooms, 40 suites, eight meeting rooms, and nearly 14,400 square feet of total meeting space. It became the third Renaissance Hotels branded hotel in Ohio. The onsite restaurant has been branded [http://www.dburnhams.com/ D. Burnham's], a tribute to the buildings architect Daniel Burnham.\nSee also\n*List of tallest buildings in Cincinnati\n*East Fourth Street Historic District\n*West Fourth Street Historic District\nReferences\nExternal links\n*  Marriott.com, Renaissance Hotels, Cincinnati"
    }
  ]
}