{
  "content": [
    {
      "type": "text",
      "text": "# Renaissance Tower (Dallas)\n\n| completion_date     = 1974\n| building_type       = Commercial offices\n| antenna_spire       =\n| roof                =\n| floor_count         = 56\n| elevator_count      =\n| cost                =\n| floor_area          =\n| architect           = Hellmuth, Obata and KassabaumHKS, Inc.\n| structural_engineer =\n| main_contractor     = The Beck Group\n| developer           =\n| owner               =Gray Street 1201 Elm LLC\n| management          = JLL\n| website             = [http://www.renaissancetower.com/ http://www.renaissancetower.com]\n| references          =\n}}\nRenaissance Tower is a , 56-story modernist skyscraper at 1201 Elm Street in downtown Dallas, Texas, U.S. The tower is the second-tallest in the city, the fifth-tallest in Texas, and the 47th-tallest in the United States. Renaissance Tower was designed by the architectural firm Hellmuth, Obata and Kassabaum, completed in 1974, and renovated by architects Skidmore, Owings and Merrill in 1986.  Major tenants include Neiman Marcus Group, Hilltop Securities and Godwin Lewis PC.\nHistory\nAt the time of completion in 1974, it was the tallest building in Dallas at  and was originally known as the First International Bancshares Tower (First International Bancshares, Inc. was the new holding company parent of First National Bank in Dallas). In 1985, it was surpassed by Bank of America Plaza, which became Dallas's tallest building by far. It was also clear that Renaissance Tower would be overtaken by Comerica Bank Tower and Chase Tower then under construction. Therefore, in order to regain some status, the building underwent a major renovation in 1986 that included a re-glazed exterior and removal of the lighting on its sides. In 1986, James T. Chiles was brought in by the owner, the Prudential Insurance Company of America to design the broadcast center and towers on top the building, one of which was . This brought the structural height of the building up to , securing its place as the second-tallest building in Dallas. Excluding antennas and spires, the Renaissance Tower is the fifth-tallest.\nDan Goodwin, a high-rise firefighting and rescue advocate, scaled the outside of the Renaissance Tower on November 7, 1981, clad in a Spider-Man suit and using only suction cups and his hands and feet to climb the outside of the building. Goodwin later stated he made the climb as a gift to a young Dallas boy stricken with cystic fibrosis whom he had met shortly after his ascent of Chicago's Sears Tower on May 25, 1981. Goodwin scaled the Renaissance Tower on his twenty-sixth birthday.\nIn 1986, Winstead PC moved from the Mercantile National Bank complex to the Renaissance Tower. In 2008, Winstead PC occupied almost  of space in the building. During that year, the firm hired CB Richard Ellis to study possibilities for relocation. Winstead selected an Uptown Dallas as a location and relocated in 2012.\nIn 1996, Blockbuster Inc., which was then headquartered in Fort Lauderdale, Florida, began studying the idea of moving its headquarters, which consisted of 400 employees, into  of space in the Renaissance Tower. In November 1996, Blockbuster confirmed that it was moving into  of space on eight floors in the Renaissance Tower, choosing floor 23 as their center of operations. Blockbuster moved all employees out of Renaissance Tower in 2011 following its bankruptcy.\nIn 2014, Westhan Global Logistics moved from its company's registered address to Renaissance Tower. Occupying a space on the seventh floor.\nAt the base of the building, there is a glass-pyramid structure that houses a two-story underground food court and cafeteria. The food court connects to other nearby structures with tunnels via the Dallas Pedestrian Network.\nIn May 2022, the building was sold to Gray Street Partners, a San Antonio, Texas real estate investment firm.\nTenants\nNationally recognized law firm Simon Greenstone Panatier, PC occupy Suite 3400.\n*Previously Trizec Properties had its Dallas offices in Suite 3838.\n*Westhan Global Logistics currently occupies Suite 2964*\nIn popular culture\nThe building lobby and exteriors were used for on location filming and for establishing shots for the home of the fictional Ewing Oil in Seasons 2-10 of the 1980s television series Dallas.  Subsequently, the building  was also used as home of the fictional company Ewing Energies on the 2012 reboot Dallas.\nA room on the 54th floor was used as the OCP boardroom set in the movie RoboCop.\nThe building, like most of downtown Dallas, was featured in the music video \"Robo Sapien\" by German industrial band Die Krupps.\nIt was also used for the 1989 Revenge TV Movie Trapped Starring Kathleen Quinlan\nSee also\n* List of tallest buildings in Dallas\n* List of tallest buildings in Texas\n* List of tallest buildings in the United States\nReferences\nExternal links\n* [http://www.renaissancetower.net/ Renaissance Tower official website]\n* [https://web.archive.org/web/20081206032551/http://www.dallasarchitecture.info/rentower.htm Renaissance Tower - Architecture in Downtown Dallas]"
    }
  ]
}