{
  "content": [
    {
      "type": "text",
      "text": "# RenderWare__disambig_1\n\n| license                = Proprietary\n| website                = [https://web.archive.org/web/20070214132346/http://www.renderware.com/ renderware.com] (archived)\n}}\nRenderWare is a video game engine developed by British game developer Criterion Software.\nOverview\nReleased in 1993, RenderWare was a 3D API and graphics rendering engine used in video games, Active Worlds, and some VRML browsers. RenderWare was developed by Criterion Software Limited, then a subsidiary of Canon. It originated in the era of software rendering on CPUs prior to the appearance of GPUs, competing with other libraries such as Argonaut Games's BRender and RenderMorphics' Reality Lab (the latter was acquired by Microsoft and became Direct3D). Renderware 4 was revealed at GDC 2004.\nRenderWare was licensed over 200 times. The scope went towards an integrated middleware with low-level APIs for rendering, physics, audio, and AI, all of which are extensible through plug-ins which also serve the official high-level API. The aim was to reduce the learning curve by also including service and support for licensees. With RenderWare Studio, an integrated development environment including a debugger was included. RenderWare themselves claimed a 70% marketshare across studios that choose an external engine in 2003.\nIn May 2002, Criterion Games announced that they would acquire MathEngine PLC, a UK-based studio based in London. Criterion Games eventually integrated the Karma physics engine from MathEngine into RenderWare (also utilized in Unreal Engine 2) for real-time physics interactions, collisions, and ragdoll physics in their games.\nRenderWare's principal commercial importance was in providing an off-the-shelf solution to the difficulties of PS2 graphics programming. As such, the engine was often described as \"Sony's DirectX\" during this era, in reference to its surrounding framework and toolchain middleware. RenderWare 2 implemented its own internal scripting language, RWX (RenderWare script); previous versions of RenderWare had required use of an external scripting language. RWX support was removed in RenderWare 3. This next iteration focused on a binary model file format. As with the previous version increment, Criterion removed support for RenderWare 3's formats in RenderWare 4.\nRenderWare is cross-platform: it allows for the creation of games that work with Windows, Apple Mac OS X, and many video game consoles of the time, such as the GameCube, Wii, Xbox, Xbox 360, PlayStation 2, PlayStation 3, and PlayStation Portable. RenderWare is no longer available for purchase, although Electronic Arts still honors old contracts, meaning that external developers who licensed the technology before the Criterion acquisition may still use the software. What was RenderWare 4 has dissolved into the rest of EA internal tech. During a 2007 Gamasutra interview, Bing Gordon, EA CCO, stated that RenderWare did not graphically perform well enough for next-gen hardware, and that it no longer stood up to its competition, namely Epic Games' Unreal Engine. He also said at the time that the RenderWare team was \"mostly a dev house\".\nSee also\n*\nReferences\nFurther reading\n*\nExternal links\n*\n* [https://github.com/electronicarts/RenderWare3Docs RenderWare3 Docs] at GitHub\n* [http://www.tnlc.com/rw/api/rwdoc.htm RenderWare V2.1 API Reference]\n* [https://sigmaco.org/p/renderware/ Historical and technical insight of RenderWare at SIGMA'Co]"
    }
  ]
}