{
  "content": [
    {
      "type": "text",
      "text": "# Rene and Georgette Magritte with Their Dog after the War__disambig_2\n\n\"René and Georgette Magritte with Their Dog after the War\" is a ballad written and sung by Paul Simon.\nThe song first appeared as the eighth track on Hearts and Bones, the 1983 album that was the sixth in Simon's solo career.  It also appears on Negotiations and Love Songs (1988), Paul Simon 1964/1993 (1993), The Paul Simon Anthology (1993), Greatest Hits: Shining Like a National Guitar (2000), The Studio Recordings 1972-2000 (2004), Songwriter (2011), and In the Blue Light (2018). The 2004 re-release of Hearts and Bones has a 3:47 minute demo version of this song among the bonus tracks. A re-recording of the song was featured on Simon's 2018 album In the Blue Light.\nTheme\nThe song is about the surrealist artist René Magritte and his wife Georgette.  The title derives from a photograph of the Magrittes and their dog in Belgium by photographer Lothar Wolleh.  He took two photographs of them: one, \"René and Georgette Magritte With Their Dog During the War\", was a black and white photo, purportedly from the World War II era, but likely taken during the 1960s. The second, \"René and Georgette Magritte With Their Dog\", was taken in their home in Belgium in 1967.\n\"Simultaneously an evocative mood piece and a joyous tribute to the doo wop groups of the '50s\", the song depicts the Magrittes as secret admirers of the Penguins, the Moonglows, the Orioles, and the Five Satins.  The lyrics refer to this as \"the deep forbidden music they've been longing for\" and says that others also \"have (it) hidden away in the cabinet cold of their hearts.\"\nThe song also portrays the Magrittes \"strolling down Christopher Street\", stopping in a men's store, and seeing \"all of the mannequins dressed in the style that brought tears to their immigrant eyes just like\" the aforementioned doo wop groups.\nReviews\nWhile not a chart hit (Allmusic retrospectively referred to the whole album as \"a commercial disaster\"), the song was well received by fans and reviewers. It has been called a \"very nice homage to the painter and his work\".  Another reviewer deemed the song \"flat-out terrific...despite its obvious pretensions.\"\nRolling Stone lauded this song saying that it \"ranks among the best Simon has written\" and added:There they are, a Belgian surrealist painter, his old lady and their pooch, dancing naked in a hotel room, window-shopping on Christopher Street and getting dolled up to dine with \"the power elite.\" [...] It's a hilarious and magical juxtaposition of images that's also touching, because Paul Simon obviously identifies with the figure of the grown-up, respectable artist irrevocably smitten with those doo-wop groups, \"the deep forbidden music\" that originally made him fall in love with rock & roll.\nSam Sutherland described this tune as \"a polished gem, both a musical analogue to the artist's dead-pan surrealism and a unique love song.\"\nVideo\nAlso released in 1984, the 3:42 minute music video produced for this song was created by Joan Logue, produced by Alan Kleinberg, and executive produced by Paul Simon, and features Simon and then-wife Carrie Fisher as the Magrittes. It is described as: a witty tribute to Magritte's work and a haunting visual interpretation of Simon's music and lyrics.  A photograph of the Magrittes serves as the point of departure for both the song and images, as Logue employs video effects to technologically echo and transform the eerie resonances of the surreal imagery of Magritte's paintings.\nPersonnel\n* Paul Simon - vocals, electric guitar\n* Richard Tee - Fender Rhodes, synthesizer\n* Anthony Jackson - fretless bass\n* Rob Sabino - piano\n* Wells Christie - synclavier\n* Uncredited - snare drum, tambourine\n* The Harptones - background vocals\n* Georges Delerue - orchestration\nReferences"
    }
  ]
}