{
  "content": [
    {
      "type": "text",
      "text": "# Reorganization of occupied dioceses during World War II\n\n(left, with Hitler and von Ribbentrop), nuncio to Germany, also served as de facto nuncio to Poland.]]\nThe reorganization of occupied dioceses during World War II was an issue faced by Pope Pius XII of whether to extend the apostolic authority of Catholic bishops from Nazi Germany and Fascist Italy to German-occupied Europe during World War II.\nAlthough such reorganization was often refused, the decision of Pius XII to appoint German apostolic administrators to occupied Poland was \"one of his most controversial decisions\". These actions were the primary justification given by the Soviet-backed Polish Provisional Government (which replaced the pro-Catholic Polish government-in-exile), for declaring the Concordat of 1925 null and void in 1945, an act that had tremendous consequences for post-war Polish-Holy See relations. There was no Apostolic Nuncio to Poland between 1947 and 1989.\nHistory\nA note from Reich Ambassador to the Holy See Diego von Bergen, dated 29 August 1941, demanded that \"all ecclesiastical appointments to important posts in annexed or occupied regions be first communicated to Berlin\". The note was meant to apply to all \"residential bishops, coadjutors with the right of succession, prelati nullius, apostolic administrators, capitular vicars, and all having equivalent functions in the government of a diocese\". Explicitly included in the demand were Alsace, Lorraine, Luxembourg, Lower Styria, Carinthia, and Carniole, as Germany viewed the right of consultation on appointments granted by the Reichskonkordat as extending to occupied territory.\nThe Holy See explicitly refused the demand on 18 January. Tardini wrote in August 1940:\nThe present historical moment is very serious from this point of view: Hitler, the persecutor of the Church and the master of much of Europe, wishes in one way or another to impose the appointment of German bishops within non-German territories, and he wants to exercise and influence on the appointments, more so than previously agreed to.... What can the Holy See do? It can do what it has always done: reaffirm and defend its liberty, firmly maintain its rights against government coercion when such pressure is detrimental to the good of souls. The people will joyfully greet such apostolic firmness on the part of the Holy See and will stand close around it as the sole herald of divine truth and the sole protector of human dignity.\nAlbania\nItaly invaded Albania on Good Friday 1939. By the end of the war, most of the surviving Catholic priests in Albania were of Italian origin an had been used by the fascist regime for the expansion of Italian culture and influence. Following the Italian invasion, \"the Catholic Church enjoyed a position of favour and influence throughout the Second World War\". Anton Harapi, a Catholic priest, was made regent, and Maliq Bushati, a Catholic, was made prime minister. According to Kent, \"in Albania, more than in any other country, the Catholic Church had been an antinational force in the service of the national enemy\".\nBelgium\nThe deaneries of Eupen, Malmedy, and Moresnet, all Diocese of Liège but annexed to Nazi Germany, were subordinated to an Apostolic Administrator, first (1941–1943) Hermann Joseph Sträter, diocesan administrator of Aachen, and then (1943–1945) Johannes Joseph van der Velden, Bishop of Aachen.\nCzechoslovakia (western part)\nThe heartland of Western Czechoslovakia became the Protectorate of Bohemia and Moravia of the Reich in 1939. In October 1938, the western border regions of Czechoslovakia had been dissected and annexed mostly by Nazi Germany (Sudetenland) and, to a small extent, by the Second Polish Republic (Trans-Olza, an area of Czechoslovak Silesia). These annexations had only partially been internationally recognised at the time and were reversed after World War II. Most of the people in the Budejovice diocese were of Czech ethnicity (with a small German minority). A. Eltschkner was appointed bishop and the German government was notified even before an announcement appeared in ''L'Osservatore Romano. On 24 July von Bergen demanded a bishop of German ethnicity or nationality for Budejovice (hinting his favor for J. Remiger), referencing the appointment of French bishops to Metz and Strasbourg in 1919. An investigation was conducted by the Congregation for Extraordinary Ecclesiastical Affairs, which concluded that the original appointment should be followed through.\nAfter the Polish takeover of Trans-Olza, never internationally recognised, the Polish government had requested the Holy See to disentangle the parishes there from either the Archdiocese of Breslau (northerly Trans-Olza) or the Archdiocese of Olomouc (southerly Trans-Olza), respectively, both traditionally comprising cross-border diocesan territories in Czechoslovakia and Germany. The Holy See complied and Pope Pius XI then subjected the Catholic parishes in Trans-Olza to an apostolic administration under Stanisław Adamski, Bishop of Katowice, who held that position until 31 December 1939. On 23 December 1939 Orsenigo appointed – with effect of 1 January 1940 – Breslau's Archbishop Adolf Bertram and Olomouc' Archbishop Leopold Prečan as apostolic administrators for exactly those Catholic parishes of Trans-Olza, where Pius XI had deposed them in 1938.\nEstonia\nEduard Profittlich, S.J., the apostolic administrator of Estonia, was one of many Catholic clergy victims of the Soviet deportations from Estonia in 1941. The Occupation of Estonia by Nazi Germany prevented the Catholic hierarchy from reconstituting itself although Jesuit Henri Werling was permitted to assume Profittlich's duties.\nFrance\nCharles Ruch, Bishop of Strasbourg was expelled after the German annexation and could return only in 1945.\nAfter a francophile manifestation on the occasion of the feast of the Assumption of Mary (15 August) in 1940, the Nazi occupants expelled Joseph-Jean Heintz, Bishop of Metz and he could return only in the autumn of 1944.\nHungary\nHungary obtained some territory of former Romania on 29 August 1940, and in turn, it demanded ecclesiastical reorganisation. That was denied by the Holy See.\nLithuania\nA treaty between Lithuania and the Soviet Union brought the city of Wilno and the Wilno Region under the jurisdiction of still-independent Lithuania on 10 October 1939. The Lithuanian government requested to have Archbishop Romuald Jałbrzykowski removed from the see. The reply of Cardinal Secretary of State Luigi Maglione was that \"the government of Kaunas should appreciate that the Holy See cannot run behind armies and change bishops as combat troops occupy new territory belonging to countries other than their own\". Jałbrzykowski was expelled by the Germans in 1942. When auxiliary bishop Mečislovas Reinys took over Jałbrzykowski, further tension was sparked between the Poles and Lithuanians.\nPoland\nFollowing the occupation of Poland (1939–1945), the government of dioceses was \"one of the first questions the Holy See had to face\". Many of the main sees were vacant prior to the war, including Warsaw, where Cardinal Aleksander Kakowski had died in December 1938. In Krakow, elderly Archbishop Adam Stefan Sapieha had sent his letter of resignation to the pope.\nCardinal August Hlond, the primate of Poland, was unable to return to his Archdioceses of Poznań-Gniezno and had accompanied the Polish government-in-exile to Romania and then continued to Rome. However, he had appointed vicars general to represent him, Cathedral Capitular Eduard van Blericq for Gniezno and Auxiliary Bishop Walenty Dymek for Poznań.\nOther bishops had been forced out of their dioceses in the first days of the war such as Stanisław Okoniewski, the bishop of Chełmno-Pelplin, and Karol Mieczysław Radoński, the bishop of Włocławek. Archbishop Antoni Julian Nowowiejski of Płock diocese was killed at Soldau Concentration Kamp i Działdów. Okoniewski's auxiliary bishop Konstantyn Dominik was interned by the end of 1939. Furthermore, Radoński's auxiliary bishop Michał Kozal was arrested by the end of 1939 and eventually died in Dachau concentration camp; the auxiliary of Lublin, Bishop Władysław Goral was similarly arrested and killed in Oranienburg-Sachsenhausen as was Bishop Leon Wetmanski, the auxiliary of Płock, at Auschwitz. Indeed, the German occupants undertook a systematic policy of forcing bishops from their dioceses, interning and arresting them.\nApproximately 2,600, or 20%, Polish clergy members were killed by the Nazis, including five of the six bishops of the Reichsgau Wartheland; priests were targeted for their resistance activities and cultural importance. Along the Nazi-Soviet demarcation line, established by the Molotov–Ribbentrop Pact, rather than appointing new bishops in the newly dissected dioceses, the bishops of neighboring diocese were made to serve as apostolic administrators. The apostolic administrators, in turn, were to designate two priests who could replace them in the event of their death or arrest.\nAlmost immediately, the Reich's ambassador to the Holy See, Diego von Bergen, made it clear that Nazi Germany would like to see German prelates made temporary administrators of the sees whose bishops had been deposed. Prelate Franz Hartz, German Territorial Prelature of Schneidemühl, was suggested by the ambassador as administrator for Gniezno-Poznań, Danzig's Bishop Carl Maria Splett for Chełmno-Pelplin, and Breslau's Archbishop Adolf Bertram for Katowice, which had been disentangled from his see in 1922. According to Monsignore Domenico Tardini, Pius XII \"acknowledging the soundness of this proposal, has decided to postpone it\". Except for Splett, the Holy See did not take up any of the proposals.\nAs the nuncio to Warsaw, Filippo Cortesi, had fled with the government-in-exile, Pius XII extended the jurisdiction of Cesare Orsenigo, the nuncio to Germany, to Poland on 1 November. Nazi Germany strictly opposed Orsenigo's competence for Poland because the Holy See did not recognise the German annexations of Polish territory and Danzig, but it upheld its diplomatic ties with the Polish government-in-exile.\nBy 29 November, Pius XII reversed his stance against appointing foreigners to sees in occupied Poland. Orsenigo suggested to Pius XII it would be \"opportune to appoint\" Splett as apostolic administrator to Chełmno-Pelplin. Splett was bishop of then exempt Danzig diocese which belonged to the nunciature to Poland, and he was a Danziger so he was not German until the annexation of his home country only weeks before his appointment. That made Pius XII agree for Orsenigo to designate Splett as apostolic administrator to Chełmno-Pelplin with effect of 5 December 1939.\nThe government-in-exile, now in London, saw this as a betrayal of the 1925 concordat between the Holy See and Poland, which prohibited placing any Polish territory under the jurisdiction of a bishop outside Poland. It was very unusual that not the Consistorial Congregation or the Congregation for Extraordinary Ecclesiastical Affairs respectively, in the papal name, but Orsenigo, using special papal plenipotentiary powers, appointed Splett, a peculiarity repeating with each appointment of foreign apostolic administrators in German annexed and occupied Poland.\n, whom Orsenigo made apostolic administrator for Catholic parishes in Trans-Olza]] On 23 December 1939 Orsenigo appointed Bertram and Leopold Prečan, Archbishop of Olomouc, as apostolic administrators for the Catholic parishes in Trans-Olza with effect of 1 January 1940. Trans-Olza was actually a Czechoslovak area, which Poland had annexed on 2 October 1938 on the grounds that most Czechoslovaks there were of Polish ethnicity. The parishes there actually had belonged either to the Archdiocese of Breslau or to the Archdiocese of Olomouc, respectively, both traditionally comprising crossborder diocesan territories in Czechoslovakia and Germany.\nWhen the Polish government demanded after the Polish takeover of Trans-Olza, which still lacked international recognition, that the parishes there be disentangled from these two archdioceses, the Holy See complied. Pope Pius XI then subjected the Catholic parishes in Trans-Olza to an apostolic administration under Stanisław Adamski, Bishop of Katowice. In Trans-Olza Bertram, Prečan replaced Adamski in 1940, who again had replaced them there in 1938. It is wrong, however, that Bertram, as apostolic administrator, replaced Adamski as bishop of Katowice.\nOn 22 June 1940, Orsenigo informed Splett that he would appoint him also apostolic administrator for the diocesan territories of Płock (Lipno county) and of Włocławek (Rypin county) within Reichsgau Danzig-West Prussia, if the respective bishops would consent. Bishop Antoni Julian Nowowiejski of Płock agreed. After Nowowiejski's murder in Soldau concentration camp on 28 May 1941 the Holy See invested his vicar general Stanisław Figielski as apostolic administrator on 6 March 1942. On 7 January 1941 the Holy See appointed Bolesław Gumowski for the German annexed Suwałki Region within the Diocese of Łomża.\nIn early 1941, Bertram, Metropolitan bishop of the Eastern German Ecclesiastical Province and speaker of the Fulda Conference of Bishops, rejected the request to admit the Danzig diocese as member in his ecclesiastical province and at the conference. Any arguments that Free City of Danzig had been annexed to Nazi Germany did not impress since Danzig's annexation lacked international recognition.\nBishop Adamski of Katowice, whom German occupants prevented from carrying out his duties since 1940, had appointed Franz Stryż as vicar general. In early 1941, Adamski was expelled from Katowice diocese, which made Stryż appeal at Orsenigo in March the same year to invest Heinrich Wienken as apostolic administrator. However, the Holy See refused. After Stryż's death, the exiled Adamski secretly invested as new vicar general Franz Wosnitza (1902–1979) on 3 June 1942. Having grown up in Königshütte (Chorzów), Wosnitza had been studying Catholic theology in Breslau when his hometown turned Polish in 1922. He then decided to move back home to become bilingual and to live as German expatriate in the Polish Katowice diocese, where its Bishop Hlond consecrated him priest on 20 June 1926. He started a career as priest also serving the minority of Poles who had German as a native language. The Consistorial Congregation, pretending the late Stryż had chosen Wosnitza, confirmed the latter as vicar general, an act not required by canon law for a vicar general appointed by his bishop, to help Adamski conceal that he was still acting in secret as bishop of Katowice. Wosnitza's appointment silenced the claims of the German occupants to invest an apostolic administrator of their choice.\nOn 18 October 1941, Orsenigo appointed Joseph Paech (1880–1942), Capitular vicar of Poznań-Gniezno, as apostolic administrator for the Catholics among the German minority in Poland within Reichsgau Wartheland. For the Catholic parishioners of Polish language in Wartheland, Orsenigo appointed Auxiliary Bishop Dymek as apostolic administrator on 9 April 1942, but in August the same year he declared his resignation because of German obstruction and violence.\nAfter Paech's resignation through ill health, Nazi Germany requested for Pius XII to appoint a German apostolic administrator. On 2 May 1942, Orsenigo then made Father Hilarius Breitinger, since 1934 serving as German expatriate at Poznań's Franciscan Church of St. Anthony of Padua, the apostolic administrator to the Reichsgau Wartheland for the Catholic parishioners of German language. The Polish government-in-exile protested the appointments of Breitinger and Splett as violations of the concordat. On 12 November the government-in-exile issued a statement from London stating that \"Pius XII's decision is tantamount to the acceptance of illegal German demands and comprises an unfriendly act towards the Polish people\". Relations between the Holy See and the government-in-exile appreciably worsened, and the Holy See countered that the government-in-exile itself had abrogated the concordat by not ensuring communication between the Vatican and the Polish clergy. According to Phayer, \"betrayal was exactly what Poles felt when Pius appointed the German Franciscan Breitinger the apostolic administrator to the Wartheland in May 1942\".\nHowever, Pius XII appointed foreigners Splett and Breitinger to fill the Polish bishoprics in parallel with the Polish incumbents, complying with German demands, originating from Wartheland's Reichsstatthalter Arthur Greiser, that only German clergy could fulfill the spiritual needs of ethnic Germans.\nWhile the bishops living under German occupation, like Adamski, Teodor Kubina (1880–1951; Częstochowa), Nowowiejski, and Sapieha considered their agreement to and the appointments of administrators for (parts of) their dioceses as the only way to maintain some precarious, though, modus vivendi for the Catholic Church under the anti-Christian and anti-Polish ideology of Nazism, bishops in exile like Hlond and Radoński were more concerned about these emergency measurements because Polish Catholics could resent them as additional humiliation, and Germany could gain from them a propagandist benefit, misinterpreting them as complaisances by the Holy See.\nPostwar legacy\nforced out German prelates after the war and replaced them with Polish ones.]]\nOn 12 September 1945 the Provisional Government of Poland declared the Concordat of 1925 null and void as a result of the \"unilateral violation by the Holy See stemming from illegal conduct repudiating its principles during the occupation\", primarily as a result of the appointment of German apostolic administrators in violation of article 9.\nGerman prelates in Poland after the war were viewed as collaborators with the occupation. Carl Maria Splett, the bishop of Danzig and administrator of Chełmno, was tried for collaboration in January 1946. He was accused of aiding the persecution by suppressing the Polish language within his diocese and barring the return of Polish prelates even after they were released from the Nazi concentration camps. When he defended himself by claiming he was following the orders of the Gestapo, the prosecution retorted that he just as easily could say he was following the orders of the pope. On 2 February 1946 the special tribunal in Gdansk sentenced Splett to eight years in prison, denial of civil rights for five years and confiscation of property. The trial of Splett galvanised widespread anti-Vatican and anti Roman/Italian Curial sentiment among Polish Catholics.\nNotes\nReferences\n*Blet, Pierre, and Johnson, Lawrence J. 1999. Pius XII and the Second World War: According to the Archives of the Vatican. Paulist Press. .\n*Chadwick, Owen. 1988. Britain and the Vatican During the Second World War. Cambridge University Press. .\n*Diskin, Hanna. 2004. ''The Seeds of Triumph: Church and State in Gomułka's Poland. Central European University Press.\n*Dunn, Dennis J. 2004. The Catholic Church and Russia. Ashgate Publishing. .\n*Kent, Peter. 2002. The Lonely Cold War of Pope Pius XII: The Roman Catholic Church and the Division of Europe, 1943–1950.'' Ithaca: McGill-Queen's University Press.\n*\n*"
    }
  ]
}