{
  "content": [
    {
      "type": "text",
      "text": "# Republicanism in Morocco\n\n(1921–1926)]]\nMorocco, currently a monarchy, has known some attempts to establish republican forms of government.\nIn the 17th century, Morisco refugees from Andalusia formed the Republic of Salé, a base for piracy. In 1921, Berber rebels in the Rif established the breakaway Republic of the Rif under Abd el-Krim against Spanish colonial rule. The state lasted until 1925, when the rebels attempted to take the city of Fes, in a failed attempt to expand the republic into the French protectorate in Morocco.\nA failed attempt to establish a republic took place during a coup attempt in 1971 against King Hassan II. It was ultimately put down by General Mohamed Oufkir. However, the following year Oufkir initiated his own coup d'état; the Air Force tried multiple times to bring down the king's airplane, attacked the Rabat airport and bombed the royal palace in Rabat. The coup ultimately failed.\nDuring the 2011–2012 Moroccan protests, a minority of protesters from the Al Adl Wa Al Ihssane Islamist movement and leftist groups such as Ila al-Amam chanted republican slogans.\nCurrent republicanism in Morocco\nBoth inside and outside Morocco there are many active Moroccan anti-monarchy activists and dissidents in exile who openly criticise the monarchy or advocate for the creation of a \"Republic of Morocco\" and for the abolition of the Moroccan monarchy through a popular revolution.\nThe Moroccan authorities continue to crack down on any movement or persons who advocate republicanism or question the legitimacy of the monarchy. As a result, many Moroccan republicans are active in the diaspora in Europe or North America, often in self-imposed exile.\nCurrently, the Al Adl Wa Al Ihssane Islamist movement and the Democratic Way Marxist group are the largest republican movements in Morocco.\nReferences\nExternal links\n*[http://www.crwflags.com/fotw/flags/ma-rif.html Flag and history of Rif-republic]"
    }
  ]
}