{
  "content": [
    {
      "type": "text",
      "text": "# Republicans (Brazil)\n\n| president        = Marcos Pereira\n| secretary_general = Evandro Garla\n| founder          = Marcelo Crivella\n| foundation       =\n| registered       =\n| religion         = Catholic Church (majority)Universal Church of the Kingdom of God (supported)\n| ideology         = Social conservatismChristian rightEconomic liberalism\n| position         = Right-wing\n| youth_wing       = Jovens Republicanos\n| womens_wing      = Mulheres Republicanas\n| wing1_title      = Elders' wing\n| wing1            = Idosos Republicanos\n| think_tank       = Fundação Republicana Brasileira\n| membership       = 495,136 (2022)\n| headquarters     = SDS-Setor de Diversão Sul-Ed. Miguel Badia, 30-Bloco L-3º Andar, Sala 320-Brasília/DF, Brazil\n| colours          =  Navy Blue  Green   Yellow\n| blank1_title     = TSE Identification Number\n| blank1           = 10\n| seats1_title     = Mayors\n| seats1           = }}\n| seats2_title     = Chamber of Deputies\n| seats2           = }}\n| seats3_title     = Federal Senate\n| seats3           = }}\n| seats4_title     = Mercosur Parliament\n| seats4           = }}\n| seats5_title     = State Assemblies\n| seats5           = }}\n| seats6_title     = City Councillors\n| seats6           = }}\n| symbol           =\n| slogan           = \"The real conservative party of Brazil\"\n| website          =\n}}\nThe Republicans (), formerly the Brazilian Republican Party (, PRB) and originally formed as the Municipalist Renewal Party (, PMR), is a Brazilian political party. Its electoral number, the numerical assignment for Brazilian political parties, is 10.\nThe party is socially conservative and economically liberal, and has a strong association with the evangelical Universal Church of the Kingdom of God. Its party president Marcos Pereira is a bishop of the Church.\nAs the PRB, it was the party of former Vice President of Brazil José Alencar, where it was part of Luiz Inácio Lula da Silva's government. While it also supported Dilma Rousseff until her impeachment, it was one of the closest allies of the Bolsonaro government, and Vice President Hamilton Mourão joined the party at the tail end of his tenure in 2022.\nHistory\nThe party was founded in August 2005 as the Municipalist Renovator Party by pastors of the Universal Church of the Kingdom of God. Lula's Vice President José Alencar moved to PRB on 2005 after leaving the Liberal Party. In March 2006, the party was renamed the Brazilian Republican Party as a suggestion by Alencar.\nThe Brazilian Republican Party first fought against President Luiz Inácio Lula da Silva, then rallied behind him after his re-election in 2006. According to one study, the PRB was supportive of the Lula da Silva and Rousseff presidencies “on the basis of their concern for social democracy and for eliminating inequality.”  However, later the PRB started to join the new rising wave of conservativism and anti-petism in Brazil and all of the PRB's deputies voted in favor of Dilma's impeachment.\nThey then supported the government of Michel Temer. In the 2018 presidential election, the Brazilian Republican Party supported the candidate of the Brazilian Social Democracy Party, Geraldo Alckmin. Afterwards the party started to switch its support to President Jair Bolsonaro, reflecting their strong ideological affinity. For the 2022 Brazilian general election, the Republicans formed a coalition with the Liberal Party (PL) and the Progressives (PP) in order to support Jair Bolsonaro's 2022 presidential campaign. Candidates launched by the Republicans had their image heavily associated and sometimes were endorsed by Bolsonaro.\nIn August 2019, the Brazilian Republican Party changed its name into Republicanos. Justifying as \"the name change reinforces the reformulation of the party's program and statutes... consolidating its position as a party conservative in customs and liberal in the economy”, seeking to emulate the American Republican Party. The name change came with a manifesto adopting a resolutely socially conservative position defending Christian values, the traditional family and private property.\nParticipation\nThe party leader  was Marcos Pereira.\nThe party's most important members are Bishop Marcelo Crivella, Rio de Janeiro senator and nephew of Universal's founder Bishop Edir Macedo, journalist Celso Russomanno and former Vice-President José Alencar. Famous football player Ronaldinho, also known as Ronaldo de Assis Moreira, joined the party in March 2018.\nStatistics\nIn 2022, it had 495,136 members.\nIn 2012, 80% of its members were Catholic and 20% evangelical, including six from the universal Church.\nIdeology\nThe party defines itself as \"socially conservative but economically liberal\", defending Christian values, the traditional family and private property. The party aligned itself with Jair Bolsonaro during his government from 2018 to 2022.\nSome commentators say that the Universal Church of the Kingdom of God (UCKG), a neo-charismatic church that is organized like a business enterprise, has used the party as a base for its bishops to run for political office. According to the emeritus professor of political sciences from the University of Brasília, David Fleischer, \"The PRB is an evangelical party.\" Several members, such as Celso Russomanno, are Catholic. Several leading members, such as Edir Macedo and Marcelo Crivella, have expressed statements of Christian fundamentalism and religious intolerance. A UN report accused members of the UCKG of verbal and physical attacks on members of the Umbanda and Candomblé religions. Macedo considered participating in presidential elections in order to transform Brazil into a theocratic state.\nAs mayor of Rio de Janeiro, Crivella called the Carnival of Rio de Janeiro an \"un-Christian excess\" and ordered severe financial cuts for the organisers. Furthermore, he is known for statements of religious intolerance. In his 1999 book Evangelizing Africa, he claimed that homosexuality is a \"terrible evil,\" that Catholics are \"demonic\", that African religions are based on \"evil spirits,\" and that Hindus drink their children's blood. He has since tried to distance himself from the book, saying that it was the work of a young, immature missionary.\nElectoral history\nPresidential elections\n{| class=\"wikitable\" style=\"text-align:center\"\n! rowspan=\"2\" |Election\n! rowspan=\"2\" |Candidate\n! rowspan=\"2\" |Running mate\n! rowspan=\"2\" |Coalition\n! colspan=\"2\" |First round\n! colspan=\"2\" |Second round\n! rowspan=\"2\" |Result\n|-\n!Votes\n!%\n!Votes\n!%\n|-\n|2006\n|Luiz Inácio Lula da Silva (PT)\n|José Alencar (PRB)\n|PT; PRB; PCdoB\n|46,662,365\n|48.6% (#1)\n|58,295,042\n|60.8% (#1)\n|Elected\n|-\n|2010\n| rowspan=\"2\" |Dilma Rousseff (PT)\n| rowspan=\"2\" |Michel Temer (PMDB)\n|PT; PMDB; PR; PSB; PDT; PCdoB; PSC; PRB; PTC; PTN\n|47,651,434\n|46.9% (#1)\n|55,752,529\n|56.1% (#1)\n|Elected\n|-\n|2014\n|PT; PMDB; PSD; PP; PR; PDT; PRB; PROS; PCdoB\n|43,267,668\n|41.6% (#1)\n|54,501,118\n|51.6 % (#1)\n|Elected\n|-\n|2018\n|Geraldo Alckmin (PSDB)\n|Ana Amélia (PP)\n|PSDB; PP; PR; PRB; PSD; SD; DEM; PTB; PPS\n|5,096,350\n|4,76% (#4)\n| -\n| -\n|Lost\n|-\n|2022\n|Jair Bolsonaro (PL)\n|Walter Braga Netto (PL)\n|PL; PP; Republicanos\n|51,072,345\n|43,2% (#2)\n|58,206,354\n|49,1% (#2)\n|Lost\n|-\n| colspan=\"9\" |Source: [http://electionresources.org/br/president.php?election=1994&state=BR Election Resources: Federal Elections in Brazil – Results Lookup]\n|}\nLegislative elections\n{|class=wikitable style=text-align:center\n!rowspan=\"2\"|Election\n!colspan=\"4\"|Chamber of Deputies\n!colspan=\"4\"|Federal Senate\n!rowspan=\"2\"|Role in government\n|-\n!Votes\n!%\n!Seats\n!+/–\n!Votes\n!%\n!Seats\n!+/–\n|-\n!2006\n|align=\"center\"|244,059\n|align=\"center\"|0.26%\n|style=\"text-align:center;\"|}}\n|New\n|align=\"center\"|264,155\n|align=\"center\"|0.31%\n| style=\"text-align:center;\" |}}\n|New\n|\n|-\n!2010\n|align=\"center\"|1,633,500\n|align=\"center\"|1.69%\n|style=\"text-align:center;\"|}}\n| 6\n|align=\"center\"|3,332,886\n|align=\"center\"|1.96%\n|style=\"text-align:center;\"|}}\n| 1\n|\n|-\n!2014\n|align=\"center\"|4,423,993\n|align=\"center\"|4.55%\n|style=\"text-align:center;\"|}}\n| 13\n|align=\"center\"|301,162\n|align=\"center\"|0.34%\n|style=\"text-align:center;\"|}}\n| 0\n|\n|-\n!2018\n|align=\"center\"|4,992,016\n|align=\"center\"|5.08%\n|style=\"text-align:center;\"|}}\n| 9\n|align=\"center\"|1,505,607\n|align=\"center\"|0.88%\n|style=\"text-align:center;\"|}}\n| 0\n|\n|-\n!2022\n|align=\"center\"|7,618,108\n|align=\"center\"|6.91%\n|style=\"text-align:center;\"|}}\n| 12\n|align=\"center\"|4,259,279\n|align=\"center\"|4.19%\n|style=\"text-align:center;\"|}}\n| 2\n|\n|-\n|colspan=\"10\"|Sources: [http://electionresources.org/br/deputies.php?election=1998&state=BR Election Resources], [https://web.archive.org/web/20110515095756/http://jaironicolau.iesp.uerj.br/banco2004.html Dados Eleitorais do Brasil (1982–2006)]\n|}\nNotable members\nCurrent\n* Hamilton Mourão - Vice President of Brazil (2019–2023) and Senator for Rio Grande do Sul (2023–present)\n* Marcos Pereira - Vice-President of the Chamber of Deputies (2019–present); Federal Deputy for São Paulo (2019–present); President of Republicans (2018–present); Minister of Industry, Foreign Trade and Services (2016–2018)\n* Damares Alves - Senator for the Federal District (2023-present)\n* Marcelo Crivella - Mayor of Rio de Janeiro (2017–2021); Minister of Fishing and Aquaculture (2012–2014); Senator for Rio de Janeiro (2003–2017)\n* Tarcísio de Freitas - Minister of Infrastructure (2019–2022); Governor of São Paulo (2023–present)\n* Mecias de Jesus - Senator for Roraima (2019–present)\n* Celso Russomanno - Federal Deputy for São Paulo (1995–2011; 2015–present)\n* Johnathan de Jesus - Federal Deputy for Roraima (2011–present)\n* Silas Câmara - Federal Deputy for Amazonas (1999–present)\n* Rosângela Gomes - Federal Deputy for Rio de Janeiro (2015–present)\n* Cléber Verde - Federal Deputy for Maranhão (2007–present)\n* Pinto Itamaraty - Senator for Maranhão (2016–2017)\n* Ronaldinho - Footballer (2018-present)\nFormer\n* José Alencar - Vice President of Brazil (2003–2010); Minister of Defense (2004-2006); Senator for Minas Gerais (1999–2002)\n* Clarissa Garotinho - Federal Deputy for Rio de Janeiro (2015–present)\n* Lincoln Portela - Federal Deputy for Minas Gerais (1999–present)\n* Flávio Bolsonaro - Senator for Rio de Janeiro (2020–2021)\nReferences\nExternal links\n*[http://www.prb10.org.br/ Republicanos 10 | Portal de Notícias Oficial], Official website\n|-"
    }
  ]
}