{
  "content": [
    {
      "type": "text",
      "text": "# Republic (film)\n\n| music          = Mani Sharma\n| cinematography = M. Sukumar\n| editing        = Praveen K. L.\n| studio         = JB EntertainmentsZee Studios\n| distributor    = Zee Studios\n| released       =\n| country        = India\n| budget         =\n| language       = Telugu\n}}\nRepublic is a 2021 Indian Telugu-language Political Social Drama film written and directed by Deva Katta, and produced by JB Entertainments and Zee Studios. The film stars Sai Tej, Aishwarya Rajesh, Ramya Krishna, and Jagapathi Babu. The plot follows Panja Abhiram (Tej), an IAS officer who tackles the corruption in the political system and the administrative machinery. This film is 3rd film in Deva Katta's Quadrilogy which shows a bureaucrat's perspective on society.\nPrincipal photography of the film began in mid-2020 and ended in February 2021, after being briefly suspended by the COVID-19 pandemic. Mani Sharma scored the film while the cinematography and editing were performed by M. Sukumar and Praveen K. L., respectively. Republic was released theatrically on 1 October 2021.\nPlot\nIn 1970, Telleru Lake was one of the biggest freshwater lakes in India and pivotal for fishing and farming. For over 40 years, fishing farms built on the lake, mainly owned by 'Visakha' Vani, have been polluting the lake.\nThe story shifts to Panja \"Abhi\" Abhiram, an intelligent and impious youth from Eluru who likes society to be truthful and honest after experiencing corruption within his own family with his father, Panja Dasarath, being a corrupt government official, which causes him to dislike his father. With his high scores in academic exams, he gets a seat at MIT. However, due to his father participating in an election rigging, he decides to dive deeper into the political system to change it.\nAbhi soon meets Myra Hansen, who is an NRI searching for her missing brother, Dr. Varun Hansen, who is known to have had an interaction with a local goon named Guna. Meanwhile, by founding a new party and making a clean sweep in the election, Vani makes her son Indukuri Vishnu Vardan the next Chief Minister of Andhra Pradesh, gaining the image of kingmaker. Later, Abhi meets Mani, an auto driver, and his father, trying to fight for justice against Vani.\nMeanwhile, Abhi and Myra come to know that Varun has been found dead, but they do not get any support from the police to locate his corpse. After passing the UPSC mains exam, Abhi heads to his interview in Delhi. While boarding the train, he experiences PTSD due to a childhood mishap on the train. He ends up seeing Mani being killed by Guna, who is under Vani's orders. Abhi, after seeing all of this, goes to his interview but ends up criticizing the interviewer's mentality and leaving the interview. However, a few days later, he is the topper in the exam, which surprises everyone, including Abhi himself. Abhi then finds out that the UPSC board selected him as an experiment in implementing him as the supreme authority of the district and that he cannot be interfered with by any politician in the state.\nAfter Abhi starts his job, he sets out to try and find Guna, who has a shoot-at-sight order against him, and he manages to kill him. However, at the same spot, he finds Myra unconscious. Abhi rushes her to the hospital and finds that she has been brutally raped and was close to being killed by Guna due to Varun's research. He then inquires about Varun's children only to find out that Guna has killed them, and their bodies have still not been found. Abhi, filled with rage, decides to tell the media that the system is why such incidents are happening. He gets the video evidence of Varun and learns that Varun was a neurological professor and doctor. The story then dives into a flashback on how Varun's wife, Radhika, dies of a neurological disease after consuming fish from Telleru Lake. He then sees more people afflicted, plans to research what happened, and concludes that Vani's fish farms contaminated it. An enraged Abhi suspends his father, the Deputy Collector, and the health officer for faking reports about the lake.\nAbhi, with this information, visits Vani to request her to remove her farms and all the construction on the lake. Vani tries to make him understand reality by telling her story; earlier, being the daughter of a socialist, she used to be like him, but during the emergency, she lost her father and husband. Then she understood that no matter how much somebody tries to change the system, it will not change, and she adapted to the system later. Vani sides with the fishermen by stating they will all be stakeholders in her farms and turns them against Abhi.\nAbhi, in an attempt to get both sides to go against Vani, calls a meeting but ends up being very violent, causing multiple injuries and deaths. Considering these facts, the UPSC board suspends Abhi and starts an inquiry on the issue. Later, Abhi learns that Vani has decided to support a central party in the government earlier and used to oppose them. He then understands and gets frustrated more for being used as a political pawn by the central party to get Vani into their alley. However, due to this, his father also gets into trouble with the villagers, causing him to get beat up. Abhi saves his father, and in a flashback, it is revealed that Dasarath was an honest officer. Still, due to his sincerity, he gets transferred to multiple states, which also causes his wife and daughter to be killed, which ultimately makes him adapt to the system and become corrupt.\nAbhi and Dasarath team up and decide to appeal to the court with all of the proper evidence. The High Court Justice Narasimham, inspired by the closing statement of Abhi despite having a lot of pressure from the state and central-level politicians, stands for justice, gets Vani, Vijay Kumar, and Dasarath removed from their posts, and gives them life sentences. The Supreme Court also orders all construction on the lake to be demolished at once. With this outcome, Vani becomes hospitalised and tells Abhi that no matter how much he tries, the system will not change.\nA few days later, Abhi finds construction starting again on the lake and confronts the villagers about why they chose to do it. They state that his caste ruled for 40 years, but it is now their turn to rule. Abhi ultimately gains support from Mani's father. Soon, though, Abhi finds himself at the edge of the forest by Mani's father and his gang and is ultimately killed by them because they want the lake for themselves. Before killing Abhi, Mani's father apologises to Abhi for his betrayal (realising that by entering the vicious circle, he will become a new victim in the power game). This also prompts Vani to commit suicide, realising that she is concerned about Abhi, appreciates his work, and is finally tired of being a victim of this political cycle. This incident throws the two Telugu states into distress. The movie ends with a montage of real-life sincere officers killed for doing their duty to society.\nCast\n* Sai Tej as Collector Panja Abhiram, IAS\n* Ramya Krishna as 'Visakha' Vani, a corrupt politician\n* Jagapathi Babu as Deputy Collector Panja Dasarath, Abhiram's father & a corrupt official\n* Aishwarya Rajesh as Myra Hansen, an NRI\n* Rahul Ramakrishna as 'Auto' Mani\n* Srikanth Iyengar as SP Gopal Rao\n* Sai Dheena as Guna, a goon.\n* Manoj Nandam as Sub-Inspector Manoj\n* C. V. L. Narasimha Rao as Justice Narasimham\n* Ravi Raja as CM Indhukuri Vishnu Vardhan, Vani's son\n* Subbaraju as Vijay Kumar, IAS\n* Aamani as Kamala, Abhiram's stepmother\n* Surekha Vani as Abhiram's mother\n* Jayaprakash as Prakash Rao IAS, UPSC Board Secretary\n* Posani Krishna Murali as School Principal\n* Ravi Varma as Rahul Sengupta\n* Venkatesh Kakumanu as Abhiram's friend\nProduction\nThe film was launched in early 2020 and filming began in mid-2020. Due to COVID-19 pandemic, the filming was paused and later resumed in December 2020. Nivetha Pethuraj was earlier cast for the film, who was later replaced by Aishwarya Rajesh.  The film's title was announced 25 January 2021. The film was shot for 64 days and completed the shoot in February 2021. Tej started dubbing for his character in June 2021.\nSoundtrack\n| recorded     = 2021\n| studio       =\n| genre        = Feature film soundtrack\n| length       = 8:50\n| label        = Zee Music Company\n| producer     = Mani Sharma\n| prev_title   = Seetimaarr\n| prev_year    = 2021\n| next_title   = Acharya\n| next_year    = 2022\n| misc         =\n}}\nRelease\nIn early 2021, the makers announced the film would release on 4 June 2021. However, due to the second wave of the COVID-19 pandemic in India, the film's release was postponed. In August 2021, the film's release date was announced to be as 1 October 2021.\nReception\nRepublic got highly positive reviews upon its release.\nCalling it \"Outstanding,\" Srinivas Kanchobhotla of Idlebrain.com opined that Republic was not merely a film but a \"social treatise about the systemic malaise.\"\nReviewing the character of Abhiram in the film, Subhash K Jha said, \"He is one&nbsp;of the truest heroes&nbsp;I’ve&nbsp;seen&nbsp;in any film in any language in recent times.\"\nRam Venkat Srikar of Cinema Express called it \"well-crafted\" and wrote: \"Republic is a smart construction on the idea of corruption and how its repercussions seep into the lives of innocents.\" He added that the writing is strong and coherent. Srikar drew comparisons with Alan J. Pakula's The Parallax View (1974) as in the conflict in both films, encircles a water body and mysterious disappearances.\nIn his review for the Hindustan Times, Haricharan Pudipeddi said: \"Tej is aptly cast, and he gets ample scope and screen time to shine and deliver a strong performance.\"\nCalling it an \"intense political drama,\" Neeshita Nyayapati of The Times of India rated the film 3/5. Nyayapati appreciated the performances writing, \"Tej gives the film and the character his all [..] Ramya Krishnan is delicious as the baddie, a woman who will smile in your face even as she plots your fate.\"\nThe Hindu critic Sangeetha Devi Dundoo termed it a \"gripping political drama doesn’t take an escapist entertainment route.\" She opined that the film's strength lied in its grey characters.\nAppreciating the performances of Tej, Ramya and Aishwarya, Prakash Pecheti of Telangana Today stated: \"Republic surely adds a cap in the feather for Sai Dharam Tej.\"\nReviewing the film for The New Indian Express, Gabbeta Raniith Kumar said that Katta presented Republic as a cautionary tale reminding the audience of the importance of citizen activism, criticism and constant vigilance to protect the sanctity of democracy.\nReferences\nExternal links\n*\n*"
    }
  ]
}