{
  "content": [
    {
      "type": "text",
      "text": "# Republicans, Liberals, Reformers\n\nRepublicans, Liberals, Reformers (Repubblicani, Liberali, Riformatori) was a federation of parties in Italy.\nIt was formed on March 18, 2007 by the Italian Republican Party (PRI) and the Italian Liberal Party (PLI), both tiny liberal parties in the centre-right House of Freedoms coalition, due to their common reference to the European Liberal Democrat and Reform Party (of which PRI is member and PLI a would-be member). The federation is aimed principally at uniting the Republican and the Liberal traditions, but also at forming joint-list for the next elections and especially for the 2009 European Parliament election.\nThe two Republican members of the Chamber of Deputies (Giorgio La Malfa and Francesco Nucara, both elected on Forza Italia's list) formed a component in the Mixed Group named \"Republicans, Liberals, Reformers\" along with Giovanni Ricevuto, a former member of the New Italian Socialist Party (NPSI).\nThe federation between PRI and PLI, approved by the PRI's congress on 1 April 2007 and by PLI's congress on 24 June 2007, is open to the entry of other parties, movements and associations. Some members of the Liberal Reformers, led by Ernesto Caccavale (ex-PLI, ex-FI and ex-PL) left the group of Benedetto Della Vedova and formed the Italian Reformers, in order to start a collaboration with \"Republicans, Liberals, Reformers\". Also some former Liberals, Republicans, Radicals, Socialists and Social Democrats now members of Forza Italia could join the new political group.\nAs of November 2007 the PRI-PLI federation was trying to reinforce collaboration with Liberal Reformers and Decide! with the final goal of ultimately creating a new liberal party. As PRI joined the People of Freedom in early 2008, however, the federation was effectively dissolved.\nThe federation was almost disbanded in early 2008, when PRI and PLI decided to run the next general election separately: within the People of Freedom and as a stand-alone list respectively."
    }
  ]
}