{
  "content": [
    {
      "type": "text",
      "text": "# Republican Party (Cambodia)\n\nThe Republican Party (; ) was a Cambodian short-lived political movement established during the Khmer Republic period (1970–75).\nHistory\nThe Republican Party was one of the new parties established in the aftermath of the Cambodian coup of 1970, which had overthrown the Sangkum regime of Prince Norodom Sihanouk.\nIt was first formed in 1971 as the \"Independent Republican Association\" by Tep Khunnah, a close associate of coup leader Prince Sisowath Sirik Matak. The Republican Party was formally created on June 15, 1972, in preparation for parliamentary elections; Sirik Matak became its secretary-general. It adopted the symbol of male and female heads to indicate its emphasis on \"family values\".\nThe Republican Party was essentially a vehicle for Sirik Matak's interests. It functioned mainly as an alternative to the power bloc of the other coup leader, General Lon Nol, whose brother Lon Non controlled the Socio-Republican Party (PSR). Whereas the latter cultivated a populist power base, encompassing both radical students and - importantly - the Khmer National Armed Forces, the Republicans attracted the urban elite, Sino-Khmer businessowners, and a handful of military officers (such as Thongvan Fanmuong). Although the Republicans' nationalist platform was in many ways similar to that of the PSR, Sirik Matak's rather aloof style placed him at a disadvantage to the populism of Lon Nol. When the elections were eventually held on September 3, 1972, the Republicans refused to participate, citing numerous irregularities in favor of the PSR.\nThe political situation in the Khmer Republic continued to unravel, and on March 25, 1973, Tep Khunnah was the target of an assassination attempt when a grenade was thrown into his car. The incident was widely believed to be the work of Lon Non, whose \"Republican Security Battalion\" was linked with such activities by Western intelligence agencies.\nPressure from the Americans, who wished to see a broader government in Phnom Penh, eventually led to Non resigning his position and removing himself to Paris. A \"High Political Council\" was set up, including Sirik Matak, Lon Nol, Cheng Heng, and In Tam. Republican Party delegates were invited into the de facto coalition government, although they were not allowed to vote in an Assembly they still regarded as illegal. Tep Khunnah had, in the meantime, run into Lon Non in a Paris nightclub, punching him and causing him to lose several teeth.\nDespite the appointment of the \"High Political Council\", Sirik Matak and the Republicans could not break the dominance of the PSR before the total collapse of the Khmer Republic on April 17, 1975.\nSee also\n*Khmer Republican Party\n*Democratic Party (Cambodia)\n*Social Republican Party\n*Pracheachon\nReferences"
    }
  ]
}