{
  "content": [
    {
      "type": "text",
      "text": "# Republican Guard (Algeria)\n\n| image                         = Republican Guard (Algeria) Logo.png\n| caption                       = Insignia of the Republican Guard\n| start_date                    = 1963\n| country                       =\n| allegiance                    =  President of Algeria\n| branch                        = Algerian People's National Army\n| type                          = InfantryCavalry\n| role                          = Honour GuardSecurity\n| size                          =\n| command_structure             =\n| garrison                      = Algiers\n| garrison_label                =\n| equipment                     =\n| equipment_label               =\n| nickname                      =\n| patron                        =\n| motto                         =\n| colors                        =\n| colors_label                  =\n| march                         =\n| mascot                        =\n| battles                       =\n| anniversaries                 =\n| decorations                   =\n| battle_honours                =\n| current_commander             =\n| current_commander_label       =\n| ceremonial_chief              =\n| ceremonial_chief_label        =\n| colonel_of_the_regiment       =\n| colonel_of_the_regiment_label =\n| notable_commanders            =\n}}\ninspecting the Republican Guard in Algiers, 2012.]]\nThe Algerian Republican Guard (, ), is a military corps of the Algerian army. It is under the direct authority of the President of Algeria. The Algerian Republican Guard is composed of about 12,000 troops. It includes a horse mounted cavalry unit. The cavalry detachment finds its roots in the mix of traditions of both the famous Berber cavalry, especially the Numidian cavalry and the equally famous Arab cavalry.\nHistory\nThe Republican Guard was founded by a group of cavalry units which came from the city of El Eulma located in Setif and which, in 1963, settled in the Colonel Chabou barracks known also as Lido Mouhamadia, in the east of Algiers. This group took over from the leaving French army.\nSince then, the unit has provided honors to the President of Algeria. It then took four years, between 1969 and 1972 to set up the Algerian Republican Guard. Since October 3, 2006, the Republican Guard has been an autonomous military force, with its own command.\nStructure\nThe Republican Guard has several types of regiments ranging from parade regiments, protection, escort, and intervention.\nThe regiments of the Republican Guard include the following:\n* Special Intervention Regiment (Régiment spécial d'intervention - RSI), special forces,\n* 1st Parade Regiment (1er Regiment de Parade),\n* 2nd Guard and Protection Regiment (Régiment de garde et de protection),\n* 3rd and 4th Motorized Intervention Regiments (Régiment motorisé d'Intervention),\n* 5th Guard and Protection Regiment,\n* 11th Cavalry and Escort Regiment (11e Régiment de cavalerie et d’escorte),\n* 47th Motorized Intervention\n* 56th Guard and Protection Regiment.\nOther units may include:\n* Directorate General of Security and Presidential Protection (DGSPP)\n* Support Units\n** Headquarters\n** Central Support Establishment\n** Horse Breeding Center (Laghouat)\n* Training Units\n** School of Non-Commissioned Officers of the Republican Guard (Laghouatl\n** School of Music at Lido Bordj El kifan Algiers\n** Republican Guard Training Center in (Laghouat)\n** Riding Training Center (Laghouat)\nPurpose\nThe Republican Cavalry's mission is to offer a stylish official display, mixing the Algerian nation's history, culture and traditions with a display of military discipline and professionalism. Their responsibilities include protecting the President and government buildings such as El Mouradia Palace, as well as welcoming foreign guests, and participating in national events.\nCharacteristics\nHistory of the cavalry\nIn 1963, the formation of the first nucleus of the cavalry at the horse breeding center at Sidi Mabrouk in Constantine. Its elements were moved to the El Eulma Barracks with the number of riders at a time not exceeding 23. It was transferred that same year to the Lido barracks where the official formation of the cavalry unit was started. Seventy young people from villages were then recruited into joining the unit. The unit was originally called \"National Horse Riding Establishment\". In 1964, it first participated in the riding festival at Oued Himimine in Constantine. In 1965, the first military rider participated in a show jumping competition in Italy. In 1966, with the participation of the Algerian Equestrian Federation, a training session was organized for military and civilian riders under the supervision of foreign trainers. In the period from 1967 to 1968, training courses were given to Algerian trainers in the field of horse riding with the help of foreign experts and while acquiring horses of a German breed. In 1970, four riders of the Gendarmerie Group of the Ministerial Reserve participated with the national team in the international competition in neighboring Morocco. Following the creation of the Republican Guard in 1972, the cavalry formations were reinforced with elements of the special troops from the city of Skikda. From this date, the Cavalry formations participated in all cultural and sporting fields besides its main missions which consist of presenting honors on horseback or on foot. It has since been seen at championships, and national and international sports competitions, including competitions in Rouen (France), Novi Sad (Yugoslavia) and Rabat (Morocco), Damascus (Syria) and Tripoli (Libya).\nUniform and equipment\nThe cavalry's ceremonial uniforms reflects the national colours and traditions of Algeria. It consists of green Algerian trousers known as \"saroual\", red tunics known as \"kamisa\" or \"kamidja\", and long white capes known as \"burnous\". These colors are those of the Algerian flag.\nThe troopers are also equipped with a traditional white headdress bearing the coat of arms of the Algerian Republican Cavalry, and a sword. The mounted horses of the Republican Cavalry are all pure blood white-colored barbs, equipped with a harness bearing the Cavalry's coat of arms, as well as a triple ponpon (white-red-green) on their heads.\nThe Guard Infantry soldiers wear a red-green full dress uniform with white peaked caps.\nSports and cultural infrastructures\nThe main competition building of the guard is the Republican Guard sports complex at Lido Algiers. The sports regrouping center at Eucalyptus Algiers has been active since 2009. The development project is underway in accordance with the vision and the expected objectives of the High Command of the National People's Army.\nMusical unit\nin 2011.]]\nThe Cavalry possesses a band, which plays the national anthem, \"Qassaman, and other national songs on official occasions such as an official visit by a foreign head of state, or during international events where military musical units gather. The musical units play many instruments including the traditional bagpipe.\nCommanders\n* Major General Abdelghani Hamel (2008–2010)\n* Major General Ahmed Moulay Melliani (2010–2015)\n* Corps General Benali Benali (2015–2025)\n* Major General Tahar Ayad (since 2025)\nReferences\nExternal links\n*  (Official Website)\n* [https://www.youtube.com/watch?v=esGKuawCyho  La fanfare de la garde républicaine algérienne à l'aéroport d'Alger]\n* [https://www.youtube.com/watch?v=1gFzy_yM3Tg Orchestre De la Garde Républicaine Algérienne]"
    }
  ]
}