{
  "content": [
    {
      "type": "text",
      "text": "# République-class battleship__disambig_1\n\n|section2=\n| class_before=\n| class_after=\n| built_range=1901–1907\n| in_commission_range=1907–1936\n| total_ships_completed=2\n| total_ships_scrapped=2\n}}\n|section3=\n| length= loa\n| beam=\n| draft=\n| propulsion=\n*3 × triple-expansion steam engines\n*3 × screw propellers\n| power=\n* 24 × Niclausse boilers\n*\n| speed=\n| range= at\n| complement=\n* 32 officers\n* 710 enlisted men\n| armament=\n* 4 ×  Modèle 1893/96 guns\n* 18 ×  Modèle 1896 guns\n* 13 ×  Modèle 1902 guns\n* 8 ×  guns\n* 2 ×  torpedo tubes\n| armor=\n* Belt:\n* Primary turrets:\n* Secondary turrets:\n* Conning tower:\n* Upper deck:\n* Lower deck:\n| notes=\n}}\n}}\nThe 'République class' consisted of a pair of pre-dreadnought battleships—, the lead ship, and —built for the French Navy in the early 1900s. They were ordered as part of a naval expansion program directed at countering German warship construction authorized by the German Naval Law of 1898. The French program called for six new battleships; the last four became the very similar . République and Patrie, designed by Louis-Émile Bertin, were a significant improvement over previous French battleships. They carried a similar offensive armament of four  guns and eighteen  guns, though most of the 164&nbsp;mm guns were now mounted in more flexible gun turrets rather than in casemates. They also had a much more effective armor protection arrangement that remedied the tendency of earlier battleships to lose stability from relatively minor damage.\nBoth ships entered service with the fleet in 1907, after the revolutionary British battleship  had been commissioned into the Royal Navy and made all existing battleships obsolescent. They nevertheless served as front-line units in the French fleet for most of their careers, well into World War I. Their peacetime careers were largely uneventful, consisting of a normal routine of training exercises, visits to French and foreign ports, and naval reviews for French politicians and foreign dignitaries. At the outbreak of war in August 1914, the ships escorted troop ship convoys carrying units of the French Army from French North Africa to France before joining the rest of the main fleet to seek battle with the Austro-Hungarian Navy; this resulted in the minor Battle of Antivari in September, where the French battle fleet caught and sank the Austro-Hungarian cruiser .\nThe fleet thereafter patrolled the southern end of the Adriatic Sea until repeated attacks from Austro-Hungarian U-boats forced them to withdraw. Patrie was transferred to the Gallipoli campaign in May 1915 and République joined her there in January 1916 to cover the Allied evacuation from the Gallipoli Peninsula. The two ships thereafter became involved in Greece, where they assisted a coup against the neutral but pro-German government that ultimately led to Greece's entry into the war on the side of the Allies. République and Patrie were then sent to Mudros, but they saw no further action during the war. In January 1918, République had two of her 305&nbsp;mm guns removed for use by the army and was converted into a training ship. After the war ended, Patrie was similarly converted for training purposes. République was decommissioned in 1921 and broken up in Italy, but Patrie lingered on in her training role until 1936, when she was decommissioned. She was sold for scrap the following year.\nDesign\nRépublique (\"Republic\") and Patrie (\"Fatherland\") were authorized by the Fleet Law of 1900, which called for a total of six battleships. The law was a reaction to the German 1898 Naval Law, which marked a significant expansion of their fleet under Admiral Alfred von Tirpitz. Since Germany was France's primary enemy, a considerable strengthening of its fleet pressured the French parliament to authorize a similar program. Louis-Émile Bertin, who had become the Directeur central des constructions navales (DCCN—Central Director of Naval Construction) in 1896, was responsible for preparing the new design. Bertin had campaigned through the early 1890s for revisions to the battleships then being built, as he correctly determined that their shallow belt armor would render them vulnerable to flooding from hits above the belt that could dangerously destabilize the vessels.\nUpon becoming the DCCN, Bertin was in a position to advance his ideas on battleship construction. In November 1897, he called for a battleship displacing , a significant increase in size over earlier battleships, which would allow him to incorporate the more comprehensive armor layout he deemed necessary to protect against contemporary armor-piercing shells. The new ship would be protected by a tall belt that covered most of the length of the hull topped with a flat armored deck; combined, these created a large armored box which was highly subdivided with watertight compartments to reduce the risk of uncontrollable flooding.\nDesign work on the ship continued for the next two years as the staff worked out various particulars. The staff submitted a revised proposal on 20 April 1898, with the displacement now increased to , which was on par with contemporary British designs. To ensure passage through the Suez Canal, draft was limited to . The staff specified the standard main armament of four  guns in two twin-gun turrets. The naval command approved the submission, but requested alterations to the design, particularly to the arrangement of the secondary battery layout. These proved difficult to incorporate, as the requested changes increased top weight, which necessitated reductions in armor thicknesses to keep the ship from becoming too top-heavy. The navy refused to allow the reductions, so further rearrangements were considered.\nOn 23 December, the designers evaluated a pair of proposals for the secondary gun turrets from Schneider-Creusot and the government-run ''Direction de l'artillerie (Artillery Directorate), and that from the latter was adopted for the new ship. These were new two-gun turrets that allowed for more secondary weapons to be carried in turrets, which were more flexible mounts than traditional casemates. Another meeting on 28 April 1899 settled on the final characteristics of the design, and on 29 May, Bertin was directed to alter the design to conform to the adopted specifications. Final design work took another two months, and Bertin submitted the finalized version on 8 August. After nearly a year of inaction, Jean Marie Antoine de Lanessan, the Minister of the Navy approved the design on 10 July 1900, and on 9 December parliament approved the 1900 Fleet Law that authorized a total of six ships.\nThe French originally planned to build six vessels of the class, which is sometimes referred to as the Patrie class, but developments abroad, particularly the construction of the British s, led to a re-design of the last four members of the class. Foreign battleships began to carry a heavy secondary battery, such as the  guns of the King Edward VIIs, which prompted an increase in French secondary batteries from , producing the , though these are sometimes considered to be a sub-class of the République class rather than a distinct class of their own. Unfortunately for République and Patrie, they entered service shortly after the revolutionary all-big-gun battleship  entered service with the Royal Navy, rendering pre-dreadnoughts like them obsolescent.\nGeneral characteristics\nThe ships were  long at the waterline,  long between perpendiculars, and  long overall. They had a beam of  at the waterline and an average draft of . The République-class ships had a designed displacement of , though in service République displaced  at full load, and Patrie'' displaced slightly more,  at full load. The ships' hulls were modelled on the s, which Bertin had also designed. The hulls were divided into 15 watertight compartments below the lower armor deck. Bilge keels were fitted to improve their stability.\nRépublique and Patrie were built with a tall forecastle deck that extended all the way to the mainmast. République and Patrie retained a small fighting mast for the foremast, but had a lighter pole mast for the mainmast. The forward superstructure consisted of a four-deck structure erected around the forward mast and the conning tower. The charthouse, commander's quarters, and bridge were located here. In service, the arrangement proved to have several problems; the conning tower was too small to accommodate the crew, and the bridge wings obstructed views aft, which forced the commander to leave the safety of the armored conning tower to see all around the ship. In 1912–1913, the wings were removed to reduce the problem. Similar problems caused difficulties in the aft superstructure as well, particularly with the rear fire control system.\nThey had a crew of 32&nbsp;officers and 710&nbsp;enlisted men, though while serving as a flagship, their crews were increased to 44&nbsp;officers and 765&nbsp;enlisted men to include an admiral's staff. Each battleship carried eighteen smaller boats, including pinnaces, cutters, dinghies, whalers, and punts. As a flagship, these boats were augmented with an admiral's gig, another cutter, and three more whalers. As completed, the ships wore the standard paint scheme of the French fleet: green for the hull below the waterline and black above, and buff for the superstructure. This scheme was replaced in 1908 with a medium blue-gray that replaced the black and buff, while the green hull paint was eventually replaced with dark red.\nMachinery\nThe ships were powered by three vertical triple-expansion steam engines with twenty-four Niclausse boilers. Républiques engines were four-cylinder models, while Patrie had three-cylinder machinery. The boilers were divided into four boiler rooms, the forward three trunked into two funnels and the aft room ducted into the rear funnel. The engines were located amidships in separate watertight compartments, between the forward group of three boiler rooms and the aft one. Each engine drove a bronze, three-bladed screw; the centerline propeller was  in diameter for both ships, and République had  outer screws while Patrie had  screws. The ships were equipped with six electric generators; two 500-amp generators were used to power the main battery turrets and ammunition hoists and four 800-amp generators provided power for the rest of the ships' systems.\nThe propulsion system was rated at  and provided a top speed of  as designed. On speed trials shortly after entering service, both vessels handily exceeded these figures, République reaching  from  and Patrie making  from . Coal storage amounted to  normally and up to  at full load. At an economical cruising speed of , the ships could steam for .\nArmament\nThe main battery for the République-class ships consisted of four Canon de 305 mm Modèle 1893/96 guns mounted in two twin-gun turrets, one forward and one aft. These guns fired a  shell at a muzzle velocity of . At their maximum elevation of 12&nbsp;degrees, the guns had a range of . Their rate of fire was one round per minute. Both the turrets and the guns were electrically operated; both guns were typically elevated together, but they could be decoupled and operated independently if the need arose. The guns had to be depressed to a fixed loading position, −5&nbsp;degrees, between shots. Ready ammunition storage amounted to eight rounds per turret. Though earlier French battleships had carried a mix of several types of shells, including armor-piercing (APC), semi-armor-piercing (SAPC), cast iron, high-explosive, and shrapnel shells, République and Patrie standardized on a load-out of just APC and SAPC shells. In peacetime, each gun was supplied with 65&nbsp;shells, for a total of 260 per ship, of which 104 were APC and the remaining 156 were SAPC. The wartime supply was three times that, at 780&nbsp;shells in total.\nThe secondary battery consisted of eighteen Canon de 164 mm Modèle 1893 guns; twelve were mounted in twin wing turrets and six in casemates in the hull. The turret guns had a maximum range of  while the casemate guns could engage targets out to . They were supplied with APC and SAPC ammunition, weighing  and , respectively, which was fired at a muzzle velocity of . Their rate of fire was three rounds per minute. As with the main battery turrets, the secondary turrets were electrically operated, though elevation was done by hand. Unlike the main battery guns, they could be loaded at any angle. The casemate guns were entirely hand-operated.\nThough designed with a tertiary battery of twenty-four  guns for defense against torpedo boats, during construction it had become clear that the gun was no longer adequate for use against the latest torpedo boats. Accordingly, on 22 August 1905, the navy ordered that sixteen of those guns, all of which were to be mounted in the hull, be replaced with thirteen  Modèle 1902 guns, which had a rate of fire of 15&nbsp;shots per minute and a maximum range of . The remaining eight 47&nbsp;mm Modèle 1902 guns, which were located in the foremast fighting top and in the forward and aft superstructure, were retained. These guns had the same rate of fire as the 65&nbsp;mm guns, but their range was less, at . They also fired a significantly lighter shell, , compared to the  shell of the larger gun. Ammunition stowage amounted to 450&nbsp;rounds per gun for the 65&nbsp;mm weapons and 550&nbsp;shells per gun for the 47&nbsp;mm guns.\nThe ships were also armed with two  torpedo tubes submerged in the hull, abreast the forward 164.7&nbsp;mm gun turrets. They were arranged at a fixed angle, 19&nbsp;degrees forward of the beam. Each tube was supplied with three Modèle 1904 torpedoes, which had a range of  at a speed of , carrying a  warhead. Each ship carried twenty naval mines that could be laid by the vessels' pinnaces.\nArmor\nThe ship's main-belt armor consisted of two strakes of cemented steel that was  thick amidships, which was reduced to  toward the bow and stern. The belt terminated close to the stern and was capped with a transverse bulkhead that was  thick backed with  of teak planking, which was in turn supported by two layers of  steel plating. Forward, it continued all the way forward to the stem. It extended from  below the waterline to  above the line, and along the upper edge of the belt, it tapered slightly to . A third, thinner strake of armor covered the upper hull at the main deck and 1st deck levels; it consisted of  of steel plating on 80&nbsp;mm of teak. It was connected to the forward main battery barbette by a  bulkhead.\nHorizontal protection consisted of two armored decks. The upper deck, at main deck level, covered almost the entire ship, from the bow to the aft transverse bulkhead. It consisted of three layers of  steel for a total thickness of . Below that, the lower deck was flat over the engine and boiler rooms, consisting of three layers of  steel, the total thickness being . On the sides of the deck, it angled down to connect to the lower edge of the main belt. The sloped sides were two layers of  steel. Sandwiched between the two decks and directly behind the belt was an extensively subdivided cofferdam, which Bertin intended to limit flooding in the event of battle damage. Coal storage bunkers were placed behind the cofferdam to absorb shell splinters or armor fragments.\nThe main-battery turrets received the heaviest armor; the faces of the gunhouses were  thick and the sides and rears were 280&nbsp;mm thick, all cemented steel. Behind each plate were two layers of  thick steel. The roof consisted of three layers of  of steel. Their barbettes were  thick above the main deck and reduced to  below the deck; for the forward barbette, a transitional thickness of  was used where the barbette was covered by the thin upper belt. The secondary turrets had cemented  faces and sides and  of mild steel, the greater thickness being used to counterbalance the weight of the guns. The roof consisted of three layers of  of steel. The secondary casemates were  thick, backed with two layers of 10&nbsp;mm of steel; the guns themselves were fitted with gun shields of the same thickness as the casemate wall.\nThe forward conning tower had  of steel on the front and side, with a  thick rear wall. All four sides were backed by two layers of 17&nbsp;mm plating. Access to the rear entrance to the tower was shielded by a curved bulkhead that was  thick. A heavily armored tube that consisted of 200&nbsp;mm thick steel protected the communication system that connected the conning tower with the transmitting station lower in the ship. Below the upper deck, it was reduced to 20&nbsp;mm on two layers of 10&nbsp;mm steel.\nModifications\nTests were carried out to determine whether the main-battery turrets could be modified to increase the elevation of the guns (and hence their range), but the modifications proved to be impractical. The Navy did determine that tanks on either side of the vessel could be flooded to induce a heel of 2&nbsp;degrees. This increased the maximum range of the guns from . New motors were installed in the secondary turrets in 1915–1916 to improve their training and elevation rates. Also in 1915, the 47&nbsp;mm guns located on either side of the bridge were removed and the two on the aft superstructure were moved to the roof of the rear turret. On 8 December 1915, the naval command issued orders that the light battery was to be revised to just four of the 47&nbsp;mm guns and eight  guns. The light battery was revised again in 1916, the four 47&nbsp;mm guns being converted with high-angle anti-aircraft mounts. They were placed atop the rear main battery turret and the number 5 and 6 secondary turret roofs.\nIn 1912–1913, each ship received two  Barr & Stroud rangefinders, though Patrie later had these replaced with  rangefinders taken from the dreadnought battleship . Tests revealed the wider rangefinders were more susceptible to working themselves out of alignment, so the navy decided to retain the 2&nbsp;m version for the other battleships of the fleet. By 1916, the command determined to modernize the fleet's rangefinding equipment, and Patrie was fitted with one 2.74&nbsp;m and two 2&nbsp;m rangefinders for her primary and secondary guns, and one  Barr & Stroud rangefinder for her anti-aircraft guns. Details of Républiques later rangefinding equipment have not survived, and the historians John Jordan and Philippe Caresse note that \"this [program] was never fully implemented\", leaving it unclear whether Républiques equipment was altered at all.\nShips\n{| class=\"wikitable plainrowheaders\"\n|+ Construction data\n! scope=\"col\" | Name\n! scope=\"col\" | Builder\n! scope=\"col\" | Laid down\n! scope=\"col\" | Launched\n! scope=\"col\" | Commissioned\n|-\n! scope=\"row\" |\n|Arsenal de Brest\n|27 December 1901\n|4 September 1902\n|12 January 1907\n|-\n! scope=\"row\" |\n|Société Nouvelle des Forges et Chantiers de la Méditerranée\n|1 April 1902\n|17 December 1903\n|1 July 1907\n|}\nHistory\nPrewar careers\nDespite having been built to counter German naval expansion, République and Patrie spent their careers in the Mediterranean Sea. In May 1907, France concluded an informal agreement with Britain and Spain after Germany had provoked the First Moroccan Crisis. It included plans to concentrate the British fleet against Germany, while the French fleet, with Spanish support, would face those of Italy and Austria-Hungary. The ships were assigned to the 1st Division of the Mediterranean Squadron after entering service, Patrie serving as the flagship. Toulon served as the squadron's home port, though they frequently also lay in Golfe-Juan and Villefranche-sur-Mer. Throughout the 1900s and early 1910s, the ships were occupied with routine peacetime training exercises in the western Mediterranean and Atlantic. They also held naval reviews for the President of France, other government officials, and foreign dignitaries during this period. The ships also made frequent visits to foreign ports in the Mediterranean, including visits to Spain, Monaco, and Italy, among others. By early 1911, the s had begun to enter service, displacing République and Patrie to what was now the 2nd Squadron of the Mediterranean Fleet, Patrie still serving as the unit's flagship.\nThroughout their peacetime careers, the ships were involved in several accidents. During maneuvers in February 1910, Patrie accidentally hit République with a torpedo, forcing her to return to port for repairs. On 25 September 1911, République was damaged by the accidental explosion of the battleship  in Toulon; the blast hurled a large section of the ship's armor plate into the air, striking République near her forward main battery turret, killing twenty-three men. Repairs were nevertheless completed quickly and the ships conducted their typical training routine that year. Following the assassination of Archduke Franz Ferdinand in June 1914 and during the ensuing July Crisis, the ships remained close to Toulon to be prepared for the possibility of war.\nWorld War I\n|alt=A large light gray ship passes slowly through calm waters.]]\nAt the outbreak of World War I in August 1914, the French fleet was mobilized to defend the troop convoys carrying elements of the army from French North Africa to Metropolitan France. The German battlecruiser  was in the Mediterranean at the time, and the French high command feared it would try to interdict the convoys. The ships of the 2nd Squadron steamed to Algiers, escorted a convoy of troop ships carrying some 7,000 men until they were relieved midway to France by the dreadnoughts  and Courbet. They thereafter joined the rest of the main French fleet and made a sweep into the Adriatic Sea to attempt to bring the Austro-Hungarian Navy to battle in September. The French encountered just the protected cruiser  and a torpedo boat, sinking the former in the Battle of Antivari. Patrols in the southern Adriatic followed, but after repeated attacks by Austro-Hungarian U-boats, the battleships of the fleet withdrew to Corfu and Malta, while lighter units continued the sweeps.\nIn May 1915, Patrie was sent to reinforce the Dardanelles Division fighting Ottoman forces in the Gallipoli campaign; she provided gunfire support to Allied troops ashore until they were evacuated in January 1916, which République was sent to help cover. The 2nd Squadron ships then were sent to Greece to put pressure on the neutral but pro-German government; they sent men ashore in December to support a coup launched by pro-Allied elements in the government, but were compelled to retreat by the Greek army. The Greek monarch, Constantine I, was forced to abdicate in June 1917 and his replacement led the country into the war on the side of the Allies. Both ships were then sent to Mudros off the Dardanelles to guard against the possibility of a sortie by Goeben, which had fled to the Ottoman Empire at the start of the war, transferred to Ottoman service, and had been renamed Yavuz Sultan Selim, though the only attempt made ended in failure when the battlecruiser struck several mines and ran aground.\nFates\nIn late January 1918, République steamed to Toulon for maintenance, and while there, had two of her main battery guns removed for use by the French Army. Since replacements were not available, she was reduced to a training ship. Patries crew suffered an outbreak of influenza that killed eleven men while at Mudros in July, and was used as a barracks ship in Constantinople during the Allied intervention in the Russian Civil War in 1919. She joined République in the Training Division in August, though the latter vessel was replaced by another ship in December 1920. Decommissioned in May 1921 and stricken from the naval register in June, République was thereafter sold to ship breakers in Italy. Patrie remained in service until a pair of accidents in 1924 forced her out of service for repairs, after which she served as a stationary training vessel until 1936, when she too was decommissioned, sold in September 1937, and broken up.\nFootnotes\nReferences\n*\n|oclc=496786828\n}}\n*\n| url-access = registration\n| url = https://archive.org/details/conwaysallworlds0000unse_l2e2\n}}\n*\n}}\n*\n}}\n*\n}}\n*\n|name-list-style=amp\n}}\n*\n}}\n*\n}}\n*\n}}"
    }
  ]
}