{
  "content": [
    {
      "type": "text",
      "text": "# Republican Accountability\n\nclass=skin-invert\n| logo_size =\n| logo_alt =\n| logo_caption = Logo of the Republican Accountability Project\n| image =\n| image_size =\n| alt =\n| caption =\n| map =\n| map_size =\n| map_alt =\n| map_caption =\n| map2 =\n| map2_size =\n| map2_alt =\n| map2_caption =\n| abbreviation =\n| nickname =\n| pronounce =\n| pronounce ref =\n| pronounce comment =\n| pronounce 2 =\n| named_after =\n| motto =\n| predecessor =\n| merged =\n| successor =\n| formation = May 2020\n| founder = Defending Democracy Together\n| founding_location =\n| extinction =\n| merger =\n| type =\n| tax_id =\n| registration_id =\n| status =\n| purpose =\n| professional_title =\n| headquarters =\n| location =\n| location2 =\n| additional_location =\n| additional_location2 =\n| coordinates =\n| origins =\n| region =\n| products =\n| services =\n| methods =\n| fields =\n| membership =\n| membership_year =\n| language =\n| owner =\n| sec_gen =\n| leader_title =\n| leader_name =\n| leader_title2 =\n| leader_name2 =\n| leader_title3 =\n| leader_name3 =\n| leader_title4 =\n| leader_name4 =\n| board_of_directors =\n| key_people =\n| main_organ =\n| parent_organization =\n| subsidiaries =\n| secessions =\n| affiliations = Never Trump movement\n| budget =\n| budget_year =\n| revenue =\n| revenue_year =\n| disbursements =\n| expenses =\n| expenses_year =\n| endowment =\n| endowment_year =\n| staff =\n| staff_year =\n| volunteers =\n| volunteers_year =\n| students =\n| students_year =\n| website =\n| remarks =\n| formerly = Republican Voters Against TrumpRepublican Accountability Project\n| footnotes =\n| bodystyle =\n}}\nRepublican Accountability (RA), formerly Republican Accountability Project (RAP) and, for the 2024 presidential election, Republican Voters Against Trump (RVAT), is a political initiative launched in May 2020 by Defending Democracy Together for the 2020 U.S. presidential election cycle. The project was formed to produce a US$10 million advertising campaign focused on 100 testimonials by Republicans, conservatives, moderates, right-leaning independent voters, and former Trump voters explaining why they would not vote for Donald Trump in 2020. By August 2020, they had collected 500 testimonials.\nOn January 29, 2021, it transitioned to the Republican Accountability Project (RAP), which focuses on defending \"Republican principles\", and attacking Republicans whom they hold responsible for the 2021 storming of the United States Capitol. The organization purchased ad campaigns to criticize members of the Republican Party, particularly those allegedly involved in the attack.\nStrategy\nDuring the 2020 presidential campaign\nThe advertising campaign targets white college-educated suburban voters in Pennsylvania, Wisconsin, Michigan, Florida, North Carolina and Arizona. Paul Waldman, writing for The Washington Post compared the campaign to a similar 1964 Lyndon B. Johnson ad called \"Confessions of a Republican\" giving Republicans \"permission\" to vote against Barry Goldwater in the 1964 presidential election.\nAd space purchased on social media and Fox News was scheduled to start the first week of June 2020. An ad produced by RVAT featuring Trump's descriptions of the coronavirus pandemic was planned to air during the Republican National Convention in Arizona, Michigan, Wisconsin, North Carolina, Florida and Pennsylvania.\nAfter the 2020 presidential election\nAfter the election, the lame duck president questioned the legitimacy of the results and encouraged his supporters to demonstrate in support of overturning the results. After the 2021 attack on the US Capitol, RVAT transitioned to RAP, assessing legislators on their willingness to support the assertions that the election results were not legitimate and their support of the January 6th event and of overturning the election results. In April 2021, the organization released a \"GOP democracy report card\" which gave 14 members of congress an A and over 100 members an F. They credited 6% of Republicans as consistently supporting democracy, with many of those retiring or losing their seats.\nAds featuring former Trump officials\nIn August 2020, former senior official in the Trump administration Miles Taylor filmed a spot, calling Trump \"dangerous\" and saying \"What we saw week in and week out, for me, after two and a half years in that administration, was terrifying. We would go in to try to talk to him about a pressing national security issue—cyberattack, terrorism threat—he wasn't interested in those things. To him, they weren't priorities.\" Later that month another former Homeland Security staffer from the Trump administration, Elizabeth Neumann, made an ad in which she endorsed Biden and called Trump \"racist\" and \"a threat to America.\" In September, Olivia Troye, former homeland security and counterterrorism advisor to Vice President Pence and aide to the White House Coronavirus Task Force filmed an ad endorsing Biden.\nAds featuring other high-profile individuals\nIn October 2020 former CIA director and retired General Michael Hayden made an ad for the group. In October former GOP congressman Jim Kolbe also made an advertisement.\nLeadership\nOrganizers included Republican political strategist Sarah Longwell, conservative writer Bill Kristol, GOP strategist Mike Murphy, and former Jeb Bush aide Tim Miller. The PAC receives funding from several prominent megadonors including LinkedIn cofounder Reid Hoffman, investor John Pritzker and hedge fund manager Seth Klarman.\nReception\nThe Philadelphia Inquirer said the group was \"waging guerrilla warfare within the GOP\". The Washington Post columnist Jennifer Rubin called the pieces \"some of the best pro-Biden ads\".\nSee also\n* 43 Alumni for America\n* The Lincoln Project\n* List of former first Trump administration officials who endorsed Joe Biden\n* List of former first Trump administration officials who endorsed Kamala Harris\n* List of Republicans who opposed the Donald Trump 2016 presidential campaign\n* List of Republicans who opposed the Donald Trump 2020 presidential campaign\n* List of Republicans who opposed the Donald Trump 2024 presidential campaign\n* Republican Political Alliance for Integrity and Reform (RePAIR)\n* Right Side PAC\nReferences\nExternal links\n*"
    }
  ]
}