{
  "content": [
    {
      "type": "text",
      "text": "# Republic Motor Truck Company\n\n| founder = Frank Ruggles\n| defunct =\n| fate = Merged\n| successor = LaFrance-Republic\n| hq_location = Alma, Michigan\n}}\nRepublic Motor Truck Company Plant 1\nRepublic Motor Truck Company Plant 2 and 4\nRepublic Motor Truck Company Plant 3\nA 1918 Republic Tractor advertisement in the Syracuse Herald, June 6, 1918.\nShare of the Republic Motor Truck Company, issued 19. June 1922\nRepublic Model C (1914)\nRepublic truck from 1923\nRepublic 76-6 (1927-1929)\nRepublic 60 (1927-1929)\nRepublic 65 (1929)\nRepublic S-25W (1928-1929)\nThe Republic Motor Truck Company was a manufacturer of commercial trucks from 1913 to 1929, in Alma, Michigan. By 1918, it was recognized as the largest exclusive truck manufacturer in the world, and the maker of one out of every nine trucks on the roads in the United States. It was one of the major suppliers of \"Liberty trucks\" used by American troops during World War I.\nHistory\nThe precursor to Republic Motor Truck Company was the Alma Manufacturing Company, founded by Frank Ruggles, which began producing trucks in 1913 for the Maxwell Motor Company under the Hercules name. Not long afterwards, Ruggles reorganized the company, first as the Alma Motor Truck Company and then (after changing the truck's name from Hercules to Republic) as the Republic Motor Truck Company .\nThe company got some early publicity from two firsthand accounts of cross-country trips using Republic trucks. One trip was taken by two men, Lester Poyer and H. L. Dewey, and their adventures were later published as a book, 4080 Mile Haul By Republic Dispatch Truck. This trip was later confused with one taken by the author Edgar Rice Burroughs (creator of Tarzan) and his family, whose adventures were chronicled in the pamphlet \"An Auto-Biography\" that was distributed by the company.\nThe company was already doing well by 1916, but the entry of the United States into World War I gave the company a further boost when it won one of the government's contracts to build several thousand of the so-called Liberty trucks. In 1917, Republic purchased a major supplier, Torbensen Axle Company.\nBy 1918, Republic was advertising in such national publications as the Saturday Evening Post, declaring that one goes to \"Damascus for swords, Teheran [sic] for rugs, Lynn for shoes, Rochester for cameras, Dayton for cash registers, Alma for trucks.\" Over 3,000 dealers served the United States, with additional dealers in at least 56 foreign countries and colonies.\nForm July 1, 1913, to December 31, 1918, more than 40000 Republic Trucks were produced and sold. At the end of the war, Republic, which now had an annual capacity of 30,000 trucks a year, decided to expand and financed this expansion by issuing $3 million in gold notes. However, a postwar depression combined with the return of thousands of Liberty trucks to the United States led to a major reduction in demand for new trucks. Republic's output dropped to 1,453 in 1921.\nSelling Torbensen Axle in 1922 (later Eaton Axle and Spring, now Eaton Corporation) was insufficient to meet cash demands, and Republic was forced into receivership. After reorganization, the company attempted unsuccessfully to regain its former status as a preferred manufacturer, buying the Linn Manufacturing Company, makers of the heavy-duty Linn tractor, in 1927.\nAfter the sudden death of its president, Oliver Hayes, in 1928, the company merged with the American LaFrance Company to become LaFrance-Republic. LaFrance-Republic in turn was purchased by the Sterling Motor Truck Company in 1932, which was purchased by the White Motor Company in 1951. A parts depot for Republic existed in Alma until 1957.\nRepublic Motor Truck production models\n* Republic Model C (1914); Motor 30 HP, The engine displacement was 3801 cc with a bore of 95.25 mm and a stroke of 133.35 mm. The wheelbase of the 1t was 3150 mm. The track gauge was 1422 mm.\n* Republic Dispatch (1918) (0,75t)\n* Republic Special (1918) (0,75t)\n* Republic Model 10-X (1918) (1t)\n* Republic Model 11 (1918) (1,5t)\n* Republic Model A (1918) (2t)\n* Republic Model T (1918) (3,5t)\n* Republic Model V (1918) (5t)\n* Republic Model 10 (1919-1922) (1t)\n* Republic Model 11-X (1919-1924 ?) (1,5t)\n* Republic Model 19 (1919-1922) (2,5t)\n* Republic Model 20 (1919-1922) (3,5t)\n* Republic Model 20 A (1920) (3,5t)\n* Republic Model 11XX (1920) (2t)\n* Republic Model 19A (1920) (2,5t)\n* Republic Model 75 (1921-1922) (0,75t)\n* Republic Model 10E (1921-1922) (1t)\n* Republic Model Rapid Transit (1922) (0,75t)\n* Republic Model 11XB (1922-1924 ?) (3t)\n* Republic Model Rapid Transit (1922) (1,25t)\n* Republic Model 75 (1923-1927) (1,25t)\n* Republic Model 11-X (1923-1925) (2t)\n* Republic Model 19 (1923-1925) (3t)\n* Republic Model 20 (1923-1924 ?) (4,5t)\n* Republic Model 12\n* Republic Model 15\n* Republic Model 25 (1926-1929)\n* Republic Model 30 (1926-1929)\n* Republic Model 30 W (1926-1929)\n* Republic Model 35 (1925-1930)\n* Republic Model 50 (1927-1929)\n* Republic Model 60 (1927-1929)\n* Republic Model 65 (1929)\n* Republic Model 75 (1925-1928)\n* Republic Model 75-6 (1928-1929)\n* Republic Model S-25W (1928-1929)\nSee also\n* G-numbers (list of World War I trucks)\n* Sterling Trucks\nReferences and notes\nFurther reading\n*\n*\nExternal links\n* http://www.johncolemanburroughs.com/mag0/0030.html\n* http://www.eaton.com/us/en-us/company/about-us/our-heritage.html\n* https://web.archive.org/web/20081227112626/http://www.transchool.eustis.army.mil/Museum/LIBTrucks.htm"
    }
  ]
}