{
  "content": [
    {
      "type": "text",
      "text": "# Republic of the North Solomons\n\n| common_name            = North Solomons\n| conventional_long_name = Republic of the North Solomons\n| date_event1            = 9 August 1976\n| date_start             = 1 September\n| deputy1                = John Momis\n| event1                 = Reintegrated into Papua New Guinea as \"North Solomons Province\"\n| event_start            = Declared\n| flag_p1                = Flag of Papua New Guinea.svg\n| flag_s1                = Flag of Papua New Guinea.svg\n| flag_s2                = Flag of Bougainville.svg\n| government_type        = Republic\n| image_flag             = Flag of Bougainville.svg\n| image_map              = North solomons.png\n| leader1                = Alexis Sarei\n| life_span              = 1975&ndash;1976\n| p1                     = Territory of Papua and New Guinea\n| s1                     = Papua New Guinea\n| s2                     = Autonomous Region of Bougainville\n| status                 = Unrecognized state\n| title_deputy           = Chairman\n| title_leader           = President\n| year_deputy1           = 1975&ndash;1976\n| year_end               = 1976\n| year_leader1           = 1975&ndash;1976\n| year_start             = 1975\n}}\nThe Republic of the North Solomons was an unrecognised state that purported to exist for about six months in what is now the Autonomous Region of Bougainville, Papua New Guinea (PNG). It involved \"a Unilateral Declaration of Independence of the Republic of North Solomons and a failed bid for self-determination at the UN\".\nHistory\nIndependence was unilaterally declared on 1 September 1975, from the Australian-administered territory of Papua and New Guinea, which itself was due to become independent on 16 September. The name \"North Solomons\" was adopted in anticipation of a future merger with the British Solomon Islands.\nIn October 1975, the town council of Kieta voted unanimously to disband and hand over its assets to the North Solomons government.\nTensions soon escalated and by mid-1976, the Papua New Guinea riot police squad was sent to southern Bougainville to restore order. John Momis, at the time Chairman of the putative Republic's ruling council, denounced this action as an invasion.\nMutual concerns about security on the island and the Republic's failure to achieve any international recognition eventually led to talks between the PNG Government and the secessionist leader. A settlement was reached in August 1976 on the basis of increased decentralisation. Bougainville was renamed \"North Solomons Province\", in recognition of its geography, and re-absorbed politically into PNG with increased self-governance powers, a model later replicated to delineate provincial powers throughout PNG.\nInterim government\nThe chairmanship of the North Solomons interim government was initially offered to Bougainville district commissioner Alexis Sarei, who declined on the grounds that he could not commit to the role full-time due to family matters. In October 1975, John Momis was announced as the interim chairman of the government, responsible for government policy, with Sarei as chief secretary holding responsibility for administrative matters. The other members of the executive were Hanao Tato, Clement Dana, Asurei Tolovai, John Dakeni, Raphael Bele, Aloysius Noga, and Anthony Anugu. A number of public servants were engaged as assistants to Sarei, including Moses Havini, Thomas Anis, Simon Tania, Joseph Noro, James Dogel, and John Dove. Leo Hannett was appointed as government spokesman and plans were announced for an election to be held by the end of 1975.\nIn December 1975, the interim government announced its plans to abolish all local government councils and replace them with village governments, which would collect a head tax and be responsible for rural development. It was reported that the breakaway government had been evicted from Arawa House and relocated to the Catholic mission at Tunuru, where they had established offices in a converted maternity ward. The government also resolved that all Bougainville businesses should pay their 1975–76 income tax to the North Solomons government.\nReaction\nPapua New Guinea's Chief Minister, Michael Somare, initially showed no outward concern at Bougainville's stand. The Roman Catholic Church, the most powerful organization in Bougainville, officially announced its support for the breakaway move. (Bougainvilleans have experienced German, British, and Australian colonial administrations and missionaries.) Papua New Guinea, Australia and the United Nations did not recognize the secession and PNG government officials on the island simply ignored it. Through their district council, the Western Islands District of the British Solomon Islands Protectorate—comprising a third of the population of the Solomon Islands—asked to join independent Bougainville.\nContext\nMany Bougainville islanders have always regarded themselves as a separate entity in Papua New Guinea.  The island is over 900 kilometres east of the mainland and, geographically, is nearer the Solomon Islands, forming part of the Solomon Islands archipelago.\nThe declaration of independence followed the discovery sometime previously of the world's largest deposits of copper in the region. The Papua New Guinea Government had then established the Bougainville Copper mine company in Panguna, central Bougainville. Bougainville Copper was a subsidiary of Conzinc Rio Tinto of Australia, which in turn was controlled by the British company Rio Tinto Group. When the mining started, the Australian administration, backed by armed police, gave access to prospectors while informing residents that their land was being taken over without discussion.\nReferences\nFurther reading\n*\ncategory:1975 establishments in Oceania\ncategory:1976 disestablishments in Oceania\ncategory:Autonomous Region of Bougainville\ncategory:decolonization\ncategory:former republics in Oceania\ncategory:former unrecognized countries\ncategory:island countries\ncategory:politics of Papua and New Guinea\ncategory:separatism in Papua New Guinea\ncategory:states and territories established in 1975"
    }
  ]
}