{
  "content": [
    {
      "type": "text",
      "text": "# Republican and conservative support for Barack Obama in 2008\n\n]]\nUnited States President Barack Obama, a member of the Democratic Party, was endorsed or supported by some members of the Republican Party and by some political figures holding conservative views in the 2008 election. Although the vast majority of Obama's support came from liberal constituencies, some conservatives identified in him shared priorities or other positive attributes. As in any election, voters can and sometimes do cross party lines to vote for the other party's nominee. Republican and conservative Obama supporters were often referred to as \"Obama Republicans\", \"Obamacans\" or \"Obamacons\".\nRepublican and conservative supporters of Obama included elected officials, former elected officials, academics, commentators, and retired military officers. According to exit polls on Election Day, 9% of those who identified themselves as Republicans voted for Barack Obama, conflicting with polling data gathered by The Economist in October 2008 reporting 22% of conservatives favored Obama, up slightly from the 7% of self-identified Republicans who voted for John Kerry in 2004.\nEtymology of \"Obama Republican\"\nOn February 12, 2008, Barack Obama mentioned Obama Republicans in his Potomac primary victory speech: \"We are bringing together Democrats and independents, and yes, some Republicans. I know there is—I meet them when I'm shaking hands afterwards. There's one right there. An Obamacan, that's what we call them.\" In another speech, he said, \"We, as Democrats right now, should tap into the discontent of Republicans. I want some Obama Republicans!\" In his call for Republican votes, Obama referred to Ronald Reagan, who he says \"was able to tap into the discontent of the American people ... to get Democrats to vote Republican—they were called Reagan Democrats.\"\nRepublicansforObama.org\nRepublicansforObama.org was founded in December 2006 by John Martin, a US Navy reservist. The organization grew to include over 2,500 registered members from across the United States, and was featured in USA Today, The New Yorker and other media throughout the 2008 Presidential Campaign.\nCommentary and events\nConservative praise for Obama was highlighted in the conservative Insight magazine in July 2007. Insights story focused on Obama's character as contrasted with the then Democratic front-runner Hillary Clinton. In January 2008, Andrew Sullivan of The Atlantic also praised Obama's character and personality. In March 2008, Andrew Bacevich, writing in The American Conservative, said that \"principled conservatives\" should consider voting for Obama since he promised a quick end to the Iraq War; which Bacevich said had contributed to the growth of federal and presidential power. Bruce Bartlett, writing in the New Republic, cited Obama's opposition to the Iraq War as the main issue which appealed to conservatives. Also mentioned were his opposition to some parts of the PATRIOT Act and his possible support for school vouchers.\nIn June 2008, Republican Douglas Kmiec was denied Roman Catholic communion for his support of Obama, due to an interpretation of church policy and Obama's pro-choice stance. In June 2008, Washington Post commentator Robert Novak blamed the policies of President George W. Bush for Republican defections to the Obama camp and suggested that Republicans Colin Powell and Chuck Hagel might soon declare their support for Obama.  In July 2008, African-American libertarian-conservative columnist Thomas Sowell criticized \"Obamacons\" and advised them to more seriously consider Obama's liberal positions on many issues before supporting him over Republican candidate John McCain—despite Sowell's previous strident criticism of McCain.\nOn October 19, 2008, Colin Powell, who served as President George W. Bush's first Secretary of State, endorsed Obama in an appearance on Meet the Press. Calling Obama a \"transformational figure,\" Powell cited John McCain's selection of Sarah Palin (who Powell believed is not \"ready to be president\"), Republican personal attacks on Obama, and Obama's ability to improve strained relations between the U.S. and its allies as reasons for his choice.\nThe Republican party reported a total of 700 Republican voters in Iowa who voted for Obama during the January 2008 caucuses, and 500 in Colorado during their February 2008 caucuses. Polls in late February 2008, the height of the Democratic primaries and the point at which the Republicans had virtually decided on John McCain, showed that up to 14% of Republicans supported Obama. Some disenchanted or moderate Republican donors who contributed to the George Bush campaign in 2004 have donated to the Obama campaign.\nFollowing General Powell's endorsement, other prominent Republicans continued to join the ranks who had decided to vote for Senator Obama, including: Former Massachusetts Governor William Weld, former Minnesota Gov. Arne Carlson, former spokesman for President George W. Bush, Scott McClellan, and prominent conservatives Ken Adelman and Charles Fried.\nThis wave of endorsements led The Economist to publish an in-depth examination of \"The Rise of the Obamacons\" and their influence:\nThe biggest brigade in the Obamacon army consists of libertarians, furious with Mr Bush's big-government conservatism, worried about his commitment to an open-ended \"war on terror\", and disgusted by his cavalier way with civil rights. ... For many conservatives, Mr Obama embodies qualities that their party has abandoned: pragmatism, competence and respect for the head rather than the heart. Mr Obama's calm and collected response to the turmoil on Wall Street contrasted sharply with Mr. McCain's grandstanding. ... How much do these Obamacons matter? More than Mr McCain would like to think. The Obamacons are manifestations of a deeper turmoil in the Republican rank-and-file, as the old coalition of small-government activists, social conservatives and business Republicans falls apart. They also influence opinion. ... The more tantalising question is whether the rise of the Obamacons signals a lasting political realignment. ... If the Republican Party continues to think that the problem lies with the rats, rather than the seaworthiness of the ship, then the Obamacons are here to stay.\nThe rush of Republicans and other conservatives openly endorsing Barack Obama was the subject of satire on the television show The Colbert Report on October 29, 2008, which drew record ratings with a self-serving endorsement by the conservative host character played by comedian Stephen Colbert.\nThe Wall Street Journal characterized the Obamacans as \"the latest sign that the Republican Party's coalition is fracturing.\"\nPolling data\nThe final election Gallup Poll, from October 27 to November 2, indicated 10% of Republicans supported Obama instead of McCain, compared to 7% of Democrats who supported McCain. Gallup also indicated his support among self-described conservatives, although stronger than John Kerry's, was weaker than what Al Gore received. In August, Andrew Romano of Newsweek stated that the polls he had read indicate the cross-over voters \"cancel each other out.\"  However The Economist cited a poll in late October 2008 that indicated Obama was \"winning 22% of self-described conservatives, a higher proportion than any Democratic nominee since 1980.\"\nRepublican officials who endorsed Obama\nCabinet and Cabinet-level members\n* Kenneth Duberstein, White House Chief of Staff (1988–1989), White House Deputy Chief of Staff (1987–1988), White House Director of Legislative Affairs (1982–1983)\n* Wally Hickel, Governor of Alaska (1966–1969, 1990–1994), United States Secretary of the Interior (1969–1970)\n* Paul H. O'Neill, Secretary of the Treasury (2001–2002)\n* Colin Powell, Secretary of State (2001–2005), Chairman of the Joint Chiefs of Staff (1989–1993), National Security Advisor (1987–1989), Deputy National Security Advisor (1986–1987)\nU.S. Senators\n* Edward Brooke, U.S. Senator from Massachusetts (1967–1979), Attorney General of Massachusetts (1963–1967)\n* Lincoln Chafee, Governor of Rhode Island (2011–2015), U.S. Senator from Rhode Island (1999–2007), Mayor of Warwick (1993–1999); Chafee was registered as an Independent at the time but served as a Republican in Congress\n* David Durenberger, U.S. Senator from Minnesota (1978–1995); registered Independent since 2005 but served as a Republican in Congress\n* Charles Mathias, U.S. Senator from Maryland (1969–1987) and U.S. Representative from Maryland's 6th congressional district (1961–1969)\n* Larry Pressler, U.S. Senator from South Dakota (1979–1997) and U.S. Representative from South Dakota's 1st congressional district (1975–1979)\n* Lowell Weicker, Governor of Connecticut (1991–1995), U.S. Senator from Connecticut (1971–1989), U.S. Representative from Connecticut's 4th congressional district (1969–1971), Connecticut State Representative (1963–1969); registered Independent since 1995 but served as a Republican in Congress\nU.S. Representatives\n* John B. Anderson, U.S. Representative from Illinois's 16th congressional district (1961–1981) and 1980 presidential candidate; registered as an Independent since 1980 but served as a Republican in Congress\n* Mickey Edwards, U.S. Representative from Oklahoma's 5th congressional district (1977–1993)\n* Robert Ellsworth, United States Deputy Secretary of Defense (1975–1977), United States Permanent Representative to NATO (1969–1971), U.S. Representative from Kansas's 2nd (1961–1963) and 3rd (1963–1967) congressional districts\n* Harris Fawell, U.S. Representative from Illinois's 13th congressional district (1985–1999), Illinois State Senator (1963–1977)\n* Paul Findley, U.S. Representative from Illinois's 20th congressional district (1961–1983)\n* Wayne Gilchrest, U.S. Representative from Maryland's 1st congressional district (1991–2009)\n* Jim Leach, U.S. Representative from Iowa's 1st (1977–2003) and 2nd congressional districts (2003–2007); spoke at the 2008 Democratic National Convention in support of Obama and was appointed Chair of the National Endowment for the Humanities (2009–2013) under Obama\n* Pete McCloskey, U.S. Representative from California's 11th (1967–1973), 17th (1973–1975), and 12th (1975–1983) congressional districts, 1972 Republican presidential candidate; registered Democrat since 2007 but served as a Republican in Congress\n* Claudine Schneider, U.S. Representative from Rhode Island's 2nd congressional district (1981–1991)\nGovernors\n* Arne Carlson, Governor of Minnesota (1991–1999), Minnesota State Auditor (1979–1991), Minnesota State Representative (1971–1979), Minneapolis City Council member (1965–1967)\n* Linwood Holton, Assistant Secretary of State for Legislative Affairs (1974–1975), Governor of Virginia (1970–1974)\n* Bill Weld, Governor of Massachusetts (1991–1997), United States Assistant Attorney General for the Criminal Division (1986–1988), United States Attorney for the District of Massachusetts (1981–1986)\nOther federal government officials\n* Kenneth Adelman, director of the Arms Control and Disarmament Agency (1983–1987), member of the Defense Policy Board Advisory Committee\n* William H. Donaldson, chairman of the U.S. Securities and Exchange Commission (2003–2005), Under Secretary of State for Arms Control and International Security Affairs (1973–1974)\n* Charles Fried, Associate Justice of the Massachusetts Supreme Court (1995–1999), Solicitor General of the United States (1985–1989); although he had initially served as an adviser for McCain, he switched to supporting Obama due to his disapproval of McCain's selection of Sarah Palin as Vice President\n* Rita Hauser, member of the President's Intelligence Advisory Board (2001–2004), United States Ambassador to the United Nations Human Rights Council (1969–1972)\n* Douglas Kmiec, United States Assistant Attorney General for the Office of Legal Counsel (1988–1989), Deputy Assistant Attorney General for the Office of Legal Counsel (1985–1988); later served under Obama as United States Ambassador to Malta (2009–2011)\n* Scott McClellan, White House Press Secretary (2003–2006), White House Deputy Press Secretary (2001–2003), author of What Happened\n* David Sturtevant Ruder, chairman of the U.S. Securities and Exchange Commission (1987–1989)\nOther state and local officials\n* Lou Thieblemont, mayor of Camp Hill, Pennsylvania; changed party registration to Democratic to vote for Obama in the primary\n* Jim Whitaker, mayor of the Fairbanks North Star Borough, Alaska (2003–2009), Alaska State Representative (2003); delivered a speech on the second day of the 2008 Democratic National Convention in support of Obama\nOther national Republican figures who endorsed Obama\n*Ken Adelman, former diplomat, director of the Arms Control and Disarmament Agency, and member of the Pentagon's Defense Policy Board\n*Wick Allison, former publisher of National Review\n*Jack Antaramian, Florida real estate developer and Bush fundraiser\n*Julie Nixon Eisenhower, daughter of former President Richard Nixon, granddaughter-in law of Dwight D. Eisenhower\n*Susan Eisenhower, granddaughter of Dwight D. Eisenhower and president of the Eisenhower Institute. After endorsing Obama, Eisenhower announced on August 21, 2008, that she was leaving the Republican Party.\n*Susan Ford, daughter of President Gerald R. Ford\n*C.C. Goldwater, granddaughter of former Arizona Senator and Republican presidential candidate Barry Goldwater (endorsing Barack Obama on behalf of herself, her sibling, and some of her cousins)\n*Lilibet Hagel, wife of Senator Chuck Hagel (R-NE)\n*Dennis Hopper, actor who cited his admiration of Obama and dislike of Republican vice presidential nominee Sarah Palin.\n*Larry Hunter, Senior Fellow at the Institute for Policy Innovation and Chief Economist for the Free Enterprise Fund, former Reagan policy advisor\n*Rear Admiral John Hutson, USN (ret.), former Judge Advocate General of the Navy and the current dean and president of Franklin Pierce Law Center.\n*Tricia Mosley, former staffer to Senator Strom Thurmond\n*Dan M. Rooney, executive and Pittsburgh Steelers president/owner\n*Radio host Michael Smerconish, later switched to Independent.\n*Tag Tognalli, former Reagan White House Staff, 1981–1989 and Connecticut McCain Delegate to 2000 Republican National Convention.\nSupport for Obama from conservative writers\n*Andrew Bacevich, Professor of International Relations at Boston University.\n*Christopher Buckley, author, son of conservative figure William F. Buckley Jr.\n*Francis Fukuyama, author, key figure in the rise of neoconservatism and loosely affiliated with conservatism. Fukuyama left the neoconservative movement following the Iraq War and supported John Kerry in the 2004 election.\n*Jeffrey Hart, senior editor of National Review magazine.\n*Dorothy King, archeologist, author, and conservative blogger.\n*Scott McConnell, editor of the American Conservative, a magazine associated with Patrick Buchanan. (McConnell had also endorsed John Kerry in 2004.)\n*John Patrick Diggins, distinguished professor of history at the Graduate Center of the City University of New York.  Writing in the American Conservative, Diggins wrote \"I prefer the professor to the warrior.\"\n*Andrew Sullivan, commentator and author of The Conservative Soul, who had also endorsed John Kerry in 2004.\nSee also\n*Obama–Trump voters\n*Party switching\n*The Lincoln Project\n*Reagan Democrat\n*Democratic and liberal support for John McCain in 2008\nReferences\nExternal links\n*[https://www.npr.org/templates/story/story.php?storyId=91480956 Obamacons: Conservatives that support Obama] National Public Radio June 13, 2008.\n*[http://www.republicansforobama.org/ Republicans for Obama]"
    }
  ]
}