{
  "content": [
    {
      "type": "text",
      "text": "# Republic of Cuba (1902–1959)\n\n| conventional_long_name = Republic of Cuba\n| status                 = Sovereign state (1902–1906), (1909–1959)Occupied territory (1906–1909)\n| life_span              = 1902–1906a1909–1959\n| event_pre              = Platt Amendment\n| date_pre               = 12 June 1901\n| event_start            =\n| date_start             = 20 May 1902\n| event1                 = Treaty of Relations\n| date_event1            = 17 February 1903\n| event2                 = U.S. Occupation\n| date_event2            = 1906–1909\n| event3                 = Treaty of Relations\n| date_event3            = 29 May 1934\n| event4                 = 1940 Constitution\n| date_event4            = 10 October 1940\n| event5                 = 1952 coup d'état\n| date_event5            = 10 March 1952\n| event_end              = Cuban Revolution\n| date_end               = 26 July 1953–1 January 1959\n| event_post             = Socialist state\n| date_post              = 16 April 1961\n| p1                     = Military Government of Cuba1902:of Cuba\n| flag_p1                = US flag 45 stars.svg\n| p2                     = Provisional Government of Cuba1909:of Cuba\n| flag_p2                = US flag 46 stars.svg\n| s1                     = Provisional Government of Cuba1906:of Cuba\n| flag_s1                = US flag 46 stars.svg\n| flag_s2                = Flag of Cuba.svg\n| s2                     = Cuba1959: of Cuba\n| image_flag             = Flag of Cuba.svg\n| flag                   = Flag of Cuba\n| image_coat             = Coat of arms of Cuba.svg\n| image_map              = CUB orthographic.svg\n| stat_year1             = 1958 est.\n| stat_pop1              = 6950289\n| capital                = Havana\n| largest_city           = Havana\n| motto                  = Patria y Libertad (Fatherland and Liberty)\n| national_anthem        = La Bayamesa\"The Bayamo Song\"\n| official_languages     = Spanish\n| government_type        = }}\n| title_leader           = President\n| leader1                = Tomás E. Palma\n| year_leader1           = 1902–1906 (first)\n| leader2                = Fulgencio Batista\n| year_leader2           = 1952–1959\n| leader3                = Carlos Piedra\n| year_leader3           = 1959 (last)\n| title_representative   = Vice President\n| representative1        = Luis Estévez y Romero\n| year_representative1   = 1902–1905 (first)\n| representative2        = Rafael Guas Inclán\n| year_representative2   = 1955–1959 (last)\n| title_deputy           = Prime Minister\n| deputy1                = Carlos S. Zayas\n| year_deputy1           = 1940–1942 (first)\n| deputy2                = José M. Cardona\n| year_deputy2           = 1959 (last)\n| legislature            = Congress\n| house1                 = Senate\n| type_house1            = Upper chamber\n| house2                 = House of Representatives\n| type_house2            = Lower chamber\n| area_km2               = 110,860\n| area_rank              =\n| area_sq_mi             = 42,426\n| percent_water          = 0.94\n| currency               = Peso (CUP)\n| time_zone              = CST\n| utc_offset             = −5\n| utc_offset_DST         = −4\n| time_zone_DST          = CDT\n| drives_on              = right\n| calling_code           = +53\n| today                  =\n| demonym                = Cuban\n| GDP_PPP                =\n| GDP_PPP_year           =\n| HDI                    =\n| HDI_year               =\n| footnote_a             = American occupation between 1906 and 1909.\n}}\nThe Republic of Cuba (), covering the historical period in Cuban history between 1902 and 1959, was an island country comprising the island of Cuba, as well as Isla de Pinos (after 1925) and several minor archipelagos. The period began in 1902 following the end of its first U.S. military occupation years after Cuba declared independence in 1898 from the Spanish Empire. This era included various changing governments and U.S. military occupations, and ended with the outbreak of the Cuban Revolution in 1959. During this period, the United States exerted great influence on Cuban politics, notably through the Platt Amendment.\nThe governments of Cuba between independence from Spain and the Revolution have been regarded as client state of the United States. From 1902 to 1934, Cuban and U.S. law included the Platt Amendment, which guaranteed the United States right to intervene in Cuba and placed restrictions on Cuban foreign relations. In 1934, Cuba and the United States signed the Treaty of Relations in which Cuba was obligated to give preferential treatment of its economy to the United States, in exchange the United States gave Cuba a guaranteed 22 percent share of the U.S. sugar market that later was amended to a 49 percent share in 1949.\nThe country continued to use the 1940 Constitution until the new constitution was promulgated in 1976.\n1902–1933: Early governments\nAfter the Spanish–American War, Spain and the United States signed the 1898 Treaty of Paris, by which Spain ceded Puerto Rico, Guam, and the Philippines to the United States for the sum of $20million (equivalent to $million in ). With the end of U.S. military government jurisdiction, Cuba gained formal independence on 20 May 1902, as the Republic of Cuba. Under Cuba's new constitution, the U.S. retained the right to intervene in Cuban affairs and to supervise its finances and foreign relations. Under the Platt Amendment, the U.S. leased the Guantánamo Bay naval base from Cuba.\nU.S. occupation, 1906–1909\nFollowing political purging and a corrupt and rigged election in 1906, the first president, Tomás Estrada Palma, faced an armed revolt by veterans of the war. As in the independence war, Afro-Cubans were overrepresented in the insurgent army of 1906. For them, the August Revolution revived hopes for a 'rightful share' in Cuba's government. On 16 August 1906, fearing the government ready to smash the plot, former Liberation Army general Pino Guerra raised the banner of revolt. Immediately, Palma arrested every Liberal politician within reach; the remainder went underground. In an effort to avert intervention, Roosevelt sent two emissaries to Havana to seek a compromise between the government and the opposition. Regarding such neutrality as a censure of his government, Estrada Palma resigned and made his entire cabinet resign too, leaving the Republic without a government and forcing the United States to take control of the island. Roosevelt immediately proclaimed that the U.S. had been compelled to intervene in Cuba and that their only purpose was to create the necessary conditions for a peaceful election.\n1909–1924\nIn 1909, home-rule government was restored when José Miguel Gómez was inaugurated as Cuba's second president, while the U.S. continued intervening in Cuban affairs. In the War of 1912, the Partido Independiente de Color attempted to establish a separate black republic in Oriente Province, but was suppressed by the Cuban National Army under General Monteagudo, with considerable bloodshed.\nSugar production played an important role in Cuban politics and economics. In the 1910s, during and after World War I, a shortage in the world sugar supply fueled an economic boom in Cuba, marked by prosperity and the conversion of more and more farmland to sugar cultivation. Prices peaked and then crashed in 1920, ruining the country financially and allowing foreign investors to gain more power than they already had. This economic turbulence was called \"the Dance of the Millions\".\nMachado era\nIn 1924, Gerardo Machado was elected president, \"capitalizing on widespread unrest at growing dependence on the United States and at rampant corruption\". During his administration, tourism increased markedly, and American-owned hotels and restaurants were built to accommodate the influx of tourists. The tourist boom led to increases in gambling and prostitution in Cuba. He developed the Central Highway, increased spending on public education, and promoted industrialization. Machado initially enjoyed support from much of the public and from all the country's major political parties. However, his popularity declined steadily.\nMachado had pledged to serve only one term. However, in 1928, he directed a constitutional convention that amended the Constitution of Cuba to extend the term of the presidency, and that called for him to serve an additional term. In 1928, Machado held an election which was to give him another term, this one of six years.\nThe Wall Street crash of 1929 led to a collapse in the price of sugar, political unrest, and repression. Protesting students, known as the Generation of 1930, turned to violence in opposition to the increasingly unpopular Machado. The political opposition group Unión Nacionalista led an unsuccessful revolt in 1931. Labor unions also opposed the Machado government, calling a general strike in 1930, followed by \"a long series of militant work stoppages\" and the organization of the first national union for sugarcane workers. \"By 1933, Cuban labor was more highly organized and more radically led than almost any proletariat in Latin America.\"\n1933–1958: Unrest and new governments\nRevolution of 1933\nThe Generation of 1930 and a clandestine terrorist organization known as the ABC turned to violence in opposition to the increasingly unpopular Machado. U.S. ambassador Sumner Welles arrived in May 1933 and began a diplomatic campaign which involved \"mediation\" with opposition groups in including the ABC. This campaign significantly weakened Machado's government and, backed with the threat of military intervention, set the stage for a regime change.\nA general strike (in which the Popular Socialist Party sided with Machado), uprisings among sugar workers, and an army revolt forced Machado into exile in August 1933. He was replaced by Carlos Manuel de Céspedes y Quesada, son of Cuban patriot Carlos Manuel de Céspedes and former ambassador to the U.S.\n. Fulgencio Batista, who controlled the military, appears at far right.]]\nIn September 1933, the Sergeants' Revolt, led by Sergeant Fulgencio Batista, overthrew Céspedes. General Alberto Herrera served briefly as president ( 12–13 August) followed by Carlos Manuel de Céspedes y Quesada from 13 August until 5 September 1933. A five-member executive committee (the Pentarchy of 1933) was chosen to head a provisional government. They were ousted by a student-led organization, the Student Directory, which appointed Ramon Grau San Martin as provisional president and passed various reforms during the ensuing One Hundred Days Government. Grau resigned in 1934, after which Batista dominated Cuban politics for the next 25 years, at first through a series of puppet-presidents. The period from 1933 to 1937 was a time of \"virtually unremitting social and political warfare\".\nConstitution of 1940\nA new constitution was adopted in 1940, which engineered radical progressive ideas, including the right to labor and health care. Batista was elected president in the same year, holding the post until 1944. He is so far the only non-white Cuban to win the nation's highest political office. His government carried out major social reforms. Several members of the Communist Revolutionary Union held office under his administration. Cuban armed forces were not greatly involved in combat during World War&nbsp;II, although president Batista suggested a joint U.S.-Latin American assault on Francoist Spain to overthrow its authoritarian regime.\nBatista adhered to the 1940 constitution's structures preventing his re-election. Ramón Grau San Martin was the winner of the next election, in 1944. Grau further corroded the base of the already teetering legitimacy of the Cuban political system, in particular by undermining the deeply flawed, though not entirely ineffectual, Congress and Supreme Court. Carlos Prío Socarrás, a protégé of Grau, became president in 1948.\nBatista dictatorship\n(bohio) dwellings in Havana, Cuba in 1954, just outside the Havana baseball stadium. In the background is advertising for a nearby casino.]]\nBefore the presidential election in 1952, Batista staged a coup. Back in power and receiving financial, military, and logistical support from the United States government, Batista suspended the 1940 Constitution and revoked most political liberties, including the right to strike. He outlawed the Popular Socialist Party in 1952. He then aligned with the wealthiest landowners who owned the largest sugar plantations, and presided over a stagnating economy that widened the gap between rich and poor Cubans. Eventually, it reached the point where most of the sugar industry was in U.S. hands, and foreigners owned 70% of the arable land. As such, Batista's repressive government then began to systematically profit from the exploitation of Cuba's commercial interests, by negotiating lucrative relationships with both the American Mafia, who controlled the drug, gambling, and prostitution businesses in Havana, and with large U.S.-based multinational companies who were awarded lucrative contracts. To quell the growing discontent amongst the populace—which was subsequently displayed through frequent student riots and demonstrations—Batista established tighter censorship of the media, while also using his Bureau for the Repression of Communist Activities secret police to carry out wide-scale violence, torture, and public executions. These murders mounted in 1957, as socialism became more influential. Many people were killed, with estimates ranging from hundreds to about 20,000 people killed. Cuba had Latin America's highest per capita consumption rates of meat, vegetables, cereals, automobiles, telephones, and radios, though about one-third of the population was considered poor and enjoyed relatively little of this consumption.\nWhile Cuba had the highest ratio of hospital beds to population in Latin America, around 80% of these beds were located in the city of Havana, there was only one rural hospital, and it was equipped with only 10 beds. In 1951, the World Bank reported that between 80 and 90% of children in rural areas suffered from some form of intestinal parasites, in 1956 about 13% of the rural population had a history of typhoid and 14% at one point had tuberculosis. A study conducted in 1959 by public health authorities found that throughout the country around 72% of the population was afflicted with parasitism and in the rural areas this percentage was as high as 86.54%. Only 11% of farm worker families drank milk, and rural infant mortality stood at 100 per 1000 live births. Only 1 in 4 peasants were able to afford regularly eating meat, eggs and fish and chronic unemployment was at 25%. Cuba was a very unequal society with a mere 8% of landowners owning approximately 75% of the land, and while one-fifth of the population took in 58% of the national income, the bottom fifth got 2% of it, the lowest rates for the bottom 20% in the world then and even now.\nCuba was also under a lot of influence from the United States to the point where the U.S. controlled 80% of Cuba's trade. In 1959, around 40% of Cuban sugar land, almost all the cattle ranches, 90% of mines, and 80% of the utilities were owned by American firms.\nIn 1958, Cuba was a relatively well-advanced country by Latin American standards, and in some cases by world standards. On the other hand, Cuba was affected by perhaps the largest labor union privileges in Latin America, including bans on dismissals and mechanization. They were obtained in large measure \"at the cost of the unemployed and the peasants\", leading to disparities. Between 1933 and 1958, Cuba extended economic regulations enormously, causing economic problems. Unemployment became a problem as graduates entering the workforce could not find jobs. The middle class, which was comparable to that of the United States, became increasingly dissatisfied with unemployment and political persecution. The labor unions supported Batista until the very end. Batista stayed in power until he was forced into exile in December 1958 during the Cuban Revolution.\nEconomy\nTourism\nBetween 1915 and 1930, Havana hosted more tourists than any other location in the Caribbean. The influx was due in large part to Cuba's proximity to the United States, where restrictive prohibition on alcohol and other pastimes stood in stark contrast to the island's traditionally relaxed attitude to leisure pursuits. Such tourism became Cuba's third-largest source of foreign currency, behind the two dominant industries of sugar and tobacco. Cuban drinks such as the daiquiri and mojito became common in the United States during this time, after Prohibition was repealed.\nA combination of the Great Depression of the 1930s, the end of prohibition, and World War II severely dampened Cuba's tourist industry, and it wasn't until the 1950s that numbers began to return to the island in any significant force. During this period, American organized crime came to dominate the leisure and tourist industries, a modus operandi outlined at the infamous Havana Conference of 1946. By the mid-1950s Havana became one of the main markets and the favourite route for the narcotics trade to the United States. Despite this, tourist numbers grew steadily at a rate of 8% a year and Havana became known as \"the Latin Las Vegas\".\nAgriculture\nThe sugar industry was one of the largest industries in the country and had been for centuries.\nMedia\nCuba in 1950 was the first country in Latin America to broadcast television. Eight years later, the first color television broadcasting was done, and it was one of the first countries in the world to do color broadcasts. Television in Cuba grew dramatically in the 1950s, and by the late 1950s, it had the 9th highest number of TV sets out of any country in the world and the 4th highest number of TV channels out of any country.\nForeign relations\nCuba had close relations with the United States during this period.\nCuba was involved in World War 1 committing 10,000 soldiers to be used in Europe along with declaring war being on the side of the Allied Powers. The most meaningful impact on Cuba that World War I had was on its sugar trade as much of the world's European supply was cut off with demand exploding along with profits from the industry. Cuba later ended up signing the Treaty of Versailles. Cuba was a member of the League of Nations and later on its successor, the United Nations (UN). During the Spanish Civil War the Cuban government had an official position of neutrality.\nSimilar to the United States when World War II began Cuba declared its neutrality. Prior to entering the war the Cuban government would take measures such as: banning all Axis media, interning foreign nationals and signed a lend-lease agreement with the United States in November 1941 for $7.2 million USD in equipment but received little aid as it was a low priority for the Americans during the war and other theatres were more pressing. It would later declare war on the Axis powers after the Attack on Pearl Harbor. During the war a number of civil liberties were restricted.\nReferences\nWorks cited\n*\n*\nExternal links\n*\n* https://archive.org/details/in.ernet.dli.2015.159198/page/n9/mode/2up"
    }
  ]
}