{
  "content": [
    {
      "type": "text",
      "text": "# Republic (retailer)\n\n| type = Private\n| fate =\n| successor = USC\n| location = Leeds, England\n| locations = 114 stores (2013)\n| area_served = United Kingdom\n| key_people = Tim Whitworth, Carl Brewins, David Kelly\n| brands =\n| revenue =  £177.47&nbsp;million (2012)\n| operating_income =  £3.732&nbsp;million (2012)\n| industry = Fashion retail\n| num_employees = approx 2,177 (2013)\n| parent =\n| homepage =\n}}\nRepublic was a clothing retailer with 121 stores in the United Kingdom. In February 2013, it entered administration, and was purchased by Sports Direct International. Republic was merged into Sports Direct's USC brand.\nHistory\nFounded in 1985, as Just Jeans, after 1990, the name changed to Best Jeanswear; Republic was launched in 1998. It was a private limited company (Republic (Retail) Ltd.) and, in 2005, Change Capital invested in the company to finance expansion plans. In May 2011 the company was bought by private equity firm TPG Capital for £300m\nAdministration and acquisition\n, Leeds]]\nRepublic filed for administration on 13 February 2013, with Ernst & Young appointed administrators. 150 head office staff were immediately made redundant, leaving 2,500 jobs at risk. During the administration time, a total of 8 Republic stores closed, 5 in Scotland, with a further 2 closed in Northern Ireland and one in Middlesbrough, England.\nOn 28 February 2013, Sports Direct bought 114 Republic stores, the brand name, all remaining stock and own-brands including SoulCal, Crafted and Fabric from the administrators. The Republic head office was also purchased.\nSports Direct attempted to negotiate a reduction in rent for a number of stores, but the proposal was rejected by its landlords for those stores: Intu and Land Securities. As a result, 20 stores were closed. The remaining Republic stores were subsequently merged with USC.\nPosition\nThe company was positioned in the mass sector of the clothing market, and had a focus on young fashionlines were stocked from casual brands including Bench, Fenchurch, G-Star Raw, American Apparel, Henleys and Drunknmunky, as well as own brands SoulCal & Co, Miso, Crafted, Fabric, and ex-brand White Label. Before entering administration, Republic introduced a new own-branded line, @Republic, which transferred to USC.\nReferences\nExternal links\n*"
    }
  ]
}