{
  "content": [
    {
      "type": "text",
      "text": "# Republic Bharat\n\n| network = Republic Media Network\n| picture_format = SDTV and HDTV\n| parent =\n| country = India\n| language = Hindi\n| headquarters = Noida, Uttar Pradesh, India\n| owner =\n| key_people = Sumit Srivastava\n| sister_channels = Republic TV  Republic Bangla  Republic Kannada\n| website =\n| online_serv_1 = Republic Bharat live\n| online_chan_1 =\n| online_chan_2 = [https://www.youtube.com/watch?v=wmbkEmiTbCI Republic Bharat]\n| online_serv_2 = YouTube\n| area = Worldwide\n}}\nRepublic Bharat (stylized as R. भारत) is a free-to-air Indian Hindi-language news channel affiliation of Republic TV, launched on 2 February 2019, operated and owned by Republic Media Network. It is also available on DD Free Dish. It is a sister channel of Republic TV, which broadcasts news primarily in English; both were founded by Arnab Goswami.\nHistory\nRepublic Bharat was launched on 2 February 2019 through satellite and cable platforms. Republic Bharat launched in the United Kingdom through the Sky platform on August 15. It has a separate UK beam with locally curated programs and events.\nIn October 2020, according to the Broadcast Audience Research Council, Republic Bharat has the highest TV viewership among all Hindi news channels in India. Republic Bharat launched its digital platform in October 2023.\nThe channel and the Republic TV network has been criticized as being a part of \"Godi media\" pro-Narendra Modi news outlets in India.\nRegulatory complaints\nSoon after the launch of the channel, the Telecom Regulatory Authority of India (TRAI) received three complaints against the channel alleging that the channel was violating TRAI's broadcast sector regulations. The complaint was filed by TV Today. According to the complaint, Republic Bharat had declared its genre as Hindi news, but it was being added in additional genres. This was seen as a deliberate attempt to illegally garner higher Broadcast Audience Research Council ratings and increase viewership.\nTRP scam\nIn October 2020, upon receiving a complaint accusing some channels of fraudulently inflating their viewership ratings, Mumbai Police launched an investigation into the Television Rating Points (TRP) manipulation scam. With an inflated TRP, ARG Outlier Media (the company which owns Republic World and Republic Bharat) was allegedly able to bargain for higher revenue from advertisers.\nGoswami denies the allegations and has accused the Mumbai Police of retaliating against the channel's recent criticism of their activities. On 21 October, Central Bureau of Investigation got involved in the investigation, with the case now potentially covering every news channel in India. On 13 December, Republic World CEO was arrested in Mumbai, before being granted bail.\nOfcom censure\nIn December 2020, the channel was fined 20,000 pounds (approximately ₹21.07 lakh or USD$25,374) by the Office of Communications (Ofcom) for broadcasting content involving \"offensive language\", \"hate speech\" and \"abusive or derogatory treatment of individuals, groups, religions or communities\". It was also asked to air a public apology. Between 26 February and 9 April, the channel broadcast an apology in Hindi as well as English multiple times, throughout the day.\nReferences\nExternal links\n*"
    }
  ]
}