{
  "content": [
    {
      "type": "text",
      "text": "# Republic of Sudan (1956–1969)__disambig_1\n\n(Arabic)Jumhūrīyat as-Sūdān\n| conventional_long_name = Republic of Sudan\n| common_name = Sudan\n| iso3166code = omit\n| status      =\n| status_text =\n| p1          = Anglo-Egyptian Sudan\n| flag_p1 = Flag of the Governor-General of the Anglo-Egyptian Sudan.svg\n| p2      = Republic of Egypt (1953–1958)Republic of Egypt\n| flag_p2 = Flag of the Egyptian Revolution (1952).svg\n| s1      = Democratic Republic of Sudan\n| flag_s1 = Flag_of_Sudan_(1956–1970).svg\n| image_flag = Flag of Sudan (1956-1970).svg\n| flag_alt = Flag (1956–1970)\n| flag   = Flag (1956–1970)\n| flag_type = Flag (1956–1970)\n| image_coat = Coat of arms of Sudan (1956–1970).svg\n| coat_alt   =\n| symbol     =\n| symbol_type = Emblem (1956–1970)\n| image_map  = Location of Sudan (before 2011).svg\n| image_map_alt =\n| image_map_caption =\n| capital    = Khartoum\n| national_motto = \"Victory is ours\"\n| national_anthem = Naḥnu Jund Allah, Jund Al-waṭan\"We are Soldiers of God, Soldiers of the Homeland\"\n|common_languages = Arabic, English, Regional languages\n|religion   = Sunni Islam , Christianity, Animism\n|government_type = Parliamentary republic Military dictatorship\n| area_km2   = 2,530,397\n| title_leader = President\n|leader1  = Sovereignty Council\n|year_leader1 = 1956&ndash;1958\n|leader2  = Ibrahim Abboud\n|year_leader2 = 1958&ndash;1964\n|leader3  = Sovereignty Council\n| year_leader3 = 1964&ndash;1965\n|leader4  = Ismail al-Azhari with Sovereignty Council\n|year_leader4 = 1965&ndash;1969\n|title_deputy = Prime minister\n|deputy1  = Ismail al-Azhari\n| year_deputy1 = 1956\n| deputy2  = Abdallah Khalil\n| year_deputy2 = 1956 - 1958\n| deputy3  = Ibrahim Abboud\n| year_deputy3 = 1958&ndash;1964\n|deputy4  = Sirr Al-Khatim Al-Khalifa\n|year_deputy4 = 1964&ndash;1965\n|deputy5 = Muhammad Ahmad Mahgoub\n|year_deputy5 = 1965&ndash;1966\n|deputy6 = Sadiq al-Mahdi\n|year_deputy6 = 1966&ndash;1967\n|deputy7 = Muhammad Ahmad Mahgoub\n|year_deputy7 = 1967&ndash;1969\n|era     = Cold War\n|event_start = Independence\n|date_start = 1 January\n|year_start = 1956\n|event_end = Disestablished\n|date_end = 25 May\n|year_end = 1969\n|legislature = Parliament\n|area_rank = 9th\n|currency  = Sudanese pound\n|today    = SudanSouth Sudan\n|demonym   = Sudanese\n}}\nRepublic of The All Sudan was established as an independent sovereign state upon the termination of the condominium of Anglo-Egyptian Sudan, over which sovereignty had been vested jointly in Egypt and the United Kingdom.\nOn December 19, 1955, the Sudanese parliament, under Ismail al-Azhari's leadership, unanimously adopted a declaration of independence that became effective on January 1, 1956.\nDuring the early years of the Republic, despite political divisions, a parliamentary system was established with a five-member Supreme Commission as head of state.\nIn 1958, after a military coup, General Ibrahim Abboud was installed as president. This government was disestablished when a coup led by Colonel Gaafar Nimeiry founded the Democratic Republic of Sudan in 1969.\nBackground\nBefore 1955, however, whilst still subject to the condominium, the autonomous Sudanese government under Ismail al-Azhari had temporarily halted Sudan's progress toward self-determination, hoping to promote unity with Egypt. Despite his pro-Egyptian National Unionist Party (NUP) winning a majority in the 1953 parliamentary elections, Azhari realized that popular opinion had shifted against such a union. Azhari, who had been the major spokesman for the \"unity of the Nile Valley\", therefore reversed the NUP's stand and supported Sudanese independence. Azhari called for the withdrawal of foreign troops and requested the governments of Egypt and the United Kingdom to sponsor a plebiscite in advance.\nPolitics of independence\nand opposition leader Muhammad Ahmad Mahgoub on 1 January 1956]]\nSudan achieved independence without the rival political parties' having agreed on the form and content of a permanent constitution. Instead, the Constituent Assembly adopted a document known as the Transitional Constitution, which replaced the governor-general as head of state with a five-member Supreme Commission that was elected by a parliament composed of an indirectly elected Senate and a popularly elected House of Representatives. The Transitional Constitution also allocated executive power to the prime minister, who was nominated by the House of Representatives and confirmed in office by the Supreme Commission.\nAlthough it achieved independence without conflict, Sudan inherited many problems from the condominium. Chief among these was the status of the civil service. The government placed Sudanese in the administration and provided compensation and pensions for British officers of Sudan Political Service who left the country; it retained those who could not be replaced, mostly technicians and teachers. Khartoum achieved this transformation quickly and with a minimum of turbulence, although southerners resented the replacement of British administrators in the south with northern Sudanese. To advance their interests, many southern leaders concentrated their efforts in Khartoum, where they hoped to win constitutional concessions. Although determined to resist what they perceived to be Arab imperialism, they were opposed to violence. Most southern representatives supported provincial autonomy and warned that failure to win legal concessions would drive the south to rebellion.\nThe parliamentary regime introduced plans to expand the country's education, economic, and transportation sectors. To achieve these goals, Khartoum needed foreign economic and technical assistance, to which the United States made an early commitment. Conversations between the two governments had begun in mid-1957, and the parliament ratified a United States aid agreement in July 1958. Washington hoped this agreement would reduce Sudan's excessive reliance on a one-crop (cotton) economy and would facilitate the development of the country's transportation and communications infrastructure.\nThe prime minister formed a coalition government in February 1956, but he alienated the Khatmiyyah by supporting increasingly secular government policies. In June, some Khatmiyyah members who had defected from the NUP established the People's Democratic Party (PDP) under Ahmed al-Mirghani's leadership. The Umma and the PDP combined in parliament to bring down the Azhari government. With support from the two parties and backing from the Ansar and the Khatmiyyah, Abdallah Khalil put together a coalition government.\nMajor issues confronting Khalil's coalition government included winning agreement on a permanent constitution, stabilizing the south, encouraging economic development, and improving relations with Egypt. Strains within the Umma-PDP coalition hampered the government's ability to make progress on these matters. The Umma, for example, wanted the proposed constitution to institute a presidential form of government on the assumption that Abd al-Rahman al-Mahdi would be elected the first president. The consensus was lacking about the country's economic future. A poor cotton harvest followed the 1957 bumper cotton crop, which Sudan had been unable to sell at a good price in a glutted market. This downturn depleted Sudan's reserves and caused unrest over government-imposed economic restrictions. To overcome these problems and finance future development projects, the Umma called for greater reliance on foreign aid. The PDP, however, objected to this strategy because it promoted unacceptable foreign influence in Sudan. The PDP's philosophy reflected the Arab nationalism espoused by Gamal Abdel Nasser, who had replaced Egyptian leader Naguib in 1954. Despite these policy differences, the Umma-PDP coalition lasted for the remaining year of the parliament's tenure. Moreover, after the parliament adjourned, the two parties promised to maintain a common front for the 1958 elections.\nThe electorate gave a plurality in both houses to the Umma and an overall majority to the Umma-PDP coalition. The NUP, however, won nearly one-quarter of the seats, largely from urban centers and from Gezira Scheme agricultural workers. In the south, the vote represented a rejection of the men who had cooperated with the government—voters defeated all three southerners in the preelection cabinet—and a victory for advocates of autonomy within a federal system. Resentment against the government's taking over mission schools and against the measures used in suppressing the 1955 mutiny contributed to the election of several candidates who had been implicated in the rebellion.\nAfter the new parliament convened, Khalil again formed an Umma-PDP coalition government. Unfortunately, factionalism, corruption, and vote fraud dominated parliamentary deliberations at a time when the country needed decisive action with regard to the proposed constitution and the future of the south. As a result, the Umma-PDP coalition failed to exercise effective leadership.\nAnother issue that divided the parliament concerned Sudanese-United States relations. In March 1958, Khalil signed a technical assistance agreement with the United States. When he presented the pact to parliament for ratification, he discovered that the NUP wanted to use the issue to defeat the Umma-PDP coalition and that many PDP delegates opposed the agreement. Nevertheless, the Umma, with the support of some PDP and southern delegates, managed to obtain approval of the agreement.\nFactionalism and bribery in parliament, coupled with the government's inability to resolve Sudan's many social, political, and economic problems, increased popular disillusion with a democratic government. Specific complaints included Khartoum's decision to sell cotton at a price above world market prices. This policy resulted in low sales of cotton, the commodity from which Sudan derived most of its income. Restrictions on imports imposed to take the pressure off depleted foreign exchange reserves caused consternation among town dwellers who had become accustomed to buying foreign goods. Moreover, rural northerners also suffered from an embargo that Egypt placed on imports of cattle, camels, and dates from Sudan. Growing popular discontent caused many anti-government demonstrations in Khartoum. Egypt also criticized Khalil and suggested that it might support a coup against his government. Meanwhile, reports circulated in Khartoum that the Umma and the NUP were near agreement on a new coalition that would exclude the PDP and Khalil.\nOn November 17, 1958, the day parliament was to convene, a military coup occurred. Khalil, himself a retired army general, planned the preemptive coup in conjunction with leading Umma members and the army's two senior generals, Ibrahim Abboud and Ahmad Abd al Wahab, who became leaders of the military regime. Abboud immediately pledged to resolve all disputes with Egypt, including the long-standing problem of the status of the Nile River. Abboud abandoned the previous government's unrealistic policies regarding the sale of cotton. He also appointed a constitutional commission, headed by the chief justice, to draft a permanent constitution. Abboud maintained, however, that political parties only served as vehicles for personal ambitions and that they would not be reestablished when civilian rule was restored.\nAbboud military government (1958–1964)\nThe coup removed political decision making from civilian control. Abboud created the Supreme Council of the Armed Forces to rule Sudan. This body contained officers affiliated with the Ansar and the Khatmiyyah. Abboud belonged to the Khatmiyyah, whereas Abd al Wahab was a member of the Ansar. Until Abd al Wahab's removal in March 1959, the Ansar were the stronger of the two groups in the government.\nThe regime benefited during its first year in office from the successful marketing of the cotton crop. Abboud also profited from the settlement of the Nile waters dispute with Egypt and the improvement of relations between the two countries. Under the military regime, the influence of the Ansar and the Khatmiyyah lessened. The strongest religious leader, Abd al-Rahman al-Mahdi, died in early 1959. His son and successor, the elder Sadiq al Mahdi, failed to enjoy the respect accorded his father. When Sadiq died two years later, Ansar religious and political leadership divided between his brother, Imam Al-Hadi al-Mahdi, and his son, the younger Sadiq al-Mahdi.\nDespite the Abboud regime's early successes, opposition elements remained powerful. In 1959, dissident military officers made three attempts to displace Abboud with a \"popular government.\" Although the courts sentenced the leaders of these attempted coups to life imprisonment, discontent in the military continued to hamper the government's performance. In particular, the Sudanese Communist Party (SCP) gained a reputation as an effective anti-government organization. To compound its problems, the Abboud regime lacked dynamism and the ability to stabilize the country. Its failure to place capable civilian advisers in positions of authority, or to launch a credible economic and social development program, and gain the army's support, created an atmosphere that encouraged political turbulence.\nAbboud's Southern Policy proved to be his undoing. The government suppressed expressions of religious and cultural differences that bolstered attempts to Arabize society. In February 1964, for example, Abboud ordered the mass expulsion of foreign missionaries from the south. He then closed parliament to cut off outlets for southern complaints. In 1963, southern leaders had renewed the armed struggle against the Sudanese government that had continued sporadically since 1955. The rebellion was spearheaded from 1963 by guerrilla forces known as the Anyanya (the name of a poisonous concoction).\nReturn to civilian rule (1964–1969)\nOctober 1964 Revolution\nRecognizing its inability to quell growing southern discontent, the Abboud government asked the civilian sector to submit proposals for a solution to the southern problem. However, criticism of government policy quickly went beyond the southern issue and included Abboud's handling of other problems, such as the economy and education. Government attempts to silence these protests – which were centered in the University of Khartoum – brought a reaction not only from teachers and students but also from Khartoum's civil servants and trade unionists.\nThe specific incident that triggered what later became known as the October Revolution was the storming of a seminar at the University of Khartoum on \"the Problem of the Southern Sudan\" by riot police on the evening of 20 October 1964. The police killed three people in their attack; two students, Ahmed al-Gurashi Taha from Garrasa in the White Nile and Babiker Abdel Hafiz from Wad-Duroo in Omdurman, and a University of Khartoum manual labourer, Mabior, from the southern part of Sudan. Protests started the following day, 21 October, spreading across Sudan. Artists including Mohammed Wardi and Mohammed al-Amin encouraged the protestors. According to Mahmoud A. Suleiman, deputy chairman of the Justice and Equality Movement in 2012, \"the main reason for the October Revolution was the Sudanese people's dislike of being ruled by military totalitarian regimes.\"\n}}\nSources\n*\n* Mohamed Hassan Fadlalla, Short History of Sudan, iUniverse, 30 April 2004, .\n* Mohamed Hassan Fadlalla, The Problem of Dar Fur, iUniverse, Inc. (July 21, 2005), ."
    }
  ]
}