{
  "content": [
    {
      "type": "text",
      "text": "# Repugnant battle honours of the Indian Army\n\nThe Government of India has declared  repugnant some battle honours earned by Indian Army units, which are descended from erstwhile units of the Presidency armies under the East India Company and later under the British Indian Army of the British Raj. Indian Army units do not inscribe these battle honours on their colours and do not celebrate commemoration days associated with these battles. This decision was taken post-independence regarding those battle honours concerned with battles in India and Pakistan which the Indian government regards as part of the \"subjugation\" of India and in some cases, neighbouring countries.\nList of repugnant battle honours\nRepugnant battle honours include :\n* Assaye (1803)\n* Carnatic\n* Sholinghur (1781)\n* Mangalore\n* Mysore\n* Sedaseer (1799)\n* Seringapatam (1799)\n* Egypt Medal (1801)\n* Delhi (1803)\n* Leswarree (1803)\n* Deig (1804)\n* Kirkee (1817)\n* Nagpore\n* Maheidpoor (1817)\n* Corygaum (1818)\n* Nowah\n* Ava\n* Kemmendine\n* Arracan\n* Bhurtpore (1805)\n* China\n* Meeanee (1843)\n* Hyderabad\n* Maharajpoor (1843)\n* Punniar (1843)\n* Moodkee (1845)\n* Ferozeshah (1845)\n* Aliwal (1846)\n* Sobraon (1846)\n* Punjaub\n* Chillianwallah (1849)\n* Mooltan (1848-1849)\n* Goojerat (1849)\n* Pegu\n* Delhi 1857\n* Lucknow (1857)\n* Defence of Arrah\n* Behar\n* Central India\n* Egypt 1882\n* Burma 1885-87\n* Defence of Chitral\n* Punjab Frontier\nNon-repugnant battle honours\nThe earliest battle honour held by the modern Indian Army which is not considered by the Indian Government to be \"repugnant\" and can be emblazoned on colours is \"Bourbon\" (dated 8 July 1810) which is held by the 3rd Battalion, Brigade of the Guards. Battle honours prior to this period have either been lost due to disbandment, are now held only by units transferred to Pakistan during Partition, or are considered by the Indian Government to be repugnant.\nOther pre-World War I battle honours not considered by the Indian Government to be repugnant are as follows :\n* Abyssinia 1868\n* Afghanistan 1839\n* Afghanistan 1878-80\n* Ahmed Khel 1880\n* Ali Masjid 1878\n* Bani Bu Ali 1821\n* Bourbon 1810\n* Bushehr 1856\n* Kabul 1842\n* Kandahar 1842\n* Charasiah 1879\n* China 1858–59\n* China 1860–62\n* China 1900\n* Cutchee\n* Ghazni 1839\n* Ghazni 1842\n* Java 1811\n* Kabul 1879\n* Kahun 1840\n* Kandahar 1880\n* Khelat 1839\n* Khushab 1856\n* Malakand 1897\n* Peiwar Kotal 1878\n* Pekin 1860\n* Pekin 1900\n* Persia 1856-57\n* Reshire 1856\n* Samana 1897\n* Somaliland 1901-04\n* Taku Forts 1900\n* Tel-el-Kebir 1882\n* Tirah 1897-98\n* Tofrek 1885\nGallery\nImage:Egypt_(Sphinx).jpg|Sphinx symbol depicting the campaign in Egypt, 1801 awarded to Madras Sappers. It has been declared repugnant by the Indian government.\nImage:Assaye (Elephant).jpg|Elephant emblem depicting the Battle of Assaye, 1803 awarded to Madras Sappers. It has been declared repugnant by the Indian government.\nImage:China (Dragon).jpg|Dragon symbol depicting the campaign in China, during the First Opium War, 1840 awarded to Madras Sappers. It has been declared repugnant by the Indian government.\nSee also\n* Battle and theatre honours of the Indian Army\n* Awards and decorations of the Indian Armed Forces\nNotes\n*Sandes, Lt Col E.W.C. The Indian Sappers and Miners (1948) The Institution of Royal Engineers, Chatham. Pages i to xxx, 1 to 726, frontispiece and 30 illustrations, 31 general maps and 51 plans.\nReferences"
    }
  ]
}