{
  "content": [
    {
      "type": "text",
      "text": "# Republic of China (1912–1949)__disambig_1\n\n| (Postal)| (pinyin)}}\n| p1                     = Qing dynastyQing dynasty\n| flag_p1                = Flag of China (1889–1912).svg\n| s1                     = ChinaPeople's Republic of China\n| flag_s1                = Flag of the People's Republic of China.svg\n| s2                     = TaiwanRepublic of China (Taiwan)\n| flag_s2                = Flag of the Republic of China.svg\n| image_flag             = Flag of the Republic of China 1912-1928.svg\n| image_flag2            = Flag of the Republic of China.svg\n| flag_type              = 1928)|Bottom: Flag (after&nbsp;1928)}}\n| image_coat             =\n| symbol_type            = 1928)|Bottom: Emblem (after&nbsp;1928)}}\n| coa_size               = 120px\n| national_anthem        = \"Song of Five Races Under One Union\"(1912–1913)\"Song to the Auspicious Cloud\"(1913–1915)\"China Heroically Stands in the Universe\"(1915–1921)\"Song to the Auspicious Cloud\"(modified version)(1921–1928)\"Three Principles of the People\"\n| flag_anthem            = \"Blue Sky, White Sun, and a Wholly Red Earth\"\n| other_symbol_type      =\n| other_symbol           =\n| image_map              = Republic of China (orthographic projection, historical).svg\n| image_map_caption      = Land controlled by the Republic of China (late 1945) shown in dark green; land claimed (until early 1946) but not controlled shown in light green.\n| capital                = De jure:\nDe facto:\n| largest_city           = Shanghai\n| government_type        =\n| demonym                = Chinese\n| official_languages     = Standard Chinese\n| national_languages     =\n| religion               = See Religion in China\n| title_leader           = President\n| leader1                = Sun Yat-sen\n| life_span              = 1912–1949\n| year_leader1           = 1912 (first, provisional)\n| leader2                = Chiang Kai-shek\n| year_leader2           = 1948–1949\n| leader3                = Yan Xishan (acting)\n| year_leader3           = 1949–1950 (last)\n| title_deputy           = Premier\n| deputy1                = Tang Shaoyi\n| year_deputy1           = 1912 (first)\n| deputy2                = He Yingqin\n| year_deputy2           = 1949 (last)\n| title_representative   = Vice President\n| representative1        = Li Yuanhong\n| year_representative1   = 1912–1916 (first)\n| representative2        = Li Zongren\n| year_representative2   = 1948–1954 (last)\n| legislature            = National Assembly\n| house1                 = Control Yuan\n| type_house1            = Upper house\n| house2                 = Legislative Yuan\n| type_house2            = Lower house\n| event_pre              = Xinhai Revolution\n| date_pre               = 10 October 191112 February 1912\n| event_start            = Proclamation of the Republic\n| date_start             = 1 January 1912\n| event1                 = Admission to the League of Nations\n| date_event1            = 10 January 1920\n| event2                 = Northern Expedition\n| date_event2            = 1926–1928\n| event3                 = Admission to the United Nations\n| date_event3            = 24 October 1945\n| event4                 = Adoption of the Constitution\n| date_event4            = 25 December 1947\n| event_end              = Government retreat to Taipei\n| date_end               = 7 December\n| year_end               = 1949\n| event_post             = Loss of last major holdings outside Taiwan\n| date_post              = 1 May 1950\n| drives_on              = Left until 1946, right afterward\n| utc_offset             = +5:30 to +8:30\n| time_zone              = Kunlun to Changbai Standard Times\n| stat_year1             = 1912\n| stat_area1             = 11364389\n| stat_year2             = 1946\n| stat_area2             = 9665354\n| stat_pop3              = 541,000,000\n| stat_year3             = 1949\n| currency               =\n}}\nThe Republic of China (ROC) was established on 1 January 1912 as a sovereign state in mainland China following the 1911 Revolution, which overthrew the Manchu-led Qing dynasty and ended China's imperial history. From 1927, the Kuomintang (KMT) reunified the country and initially ruled it as a one-party state with Nanjing as the national capital. In 1949, the KMT-led government was defeated in the Chinese Civil War and lost control of the mainland to the Chinese Communist Party (CCP). The CCP established the People's Republic of China (PRC) while the ROC was forced to retreat to Taiwan; the ROC retains control over the Taiwan Area, and its political status remains disputed. The ROC is recorded as a founding member of both the League of Nations and the United Nations, and previously held a permanent seat on the United Nations Security Council until 1971, when the PRC took the seat of China from the ROC in the United Nations General Assembly Resolution 2758. It was also a member of the Universal Postal Union and the International Olympic Committee. The ROC claimed  of territory, and its population of 541&nbsp;million in 1949 made it the most populous country in the world.\nThe Republic of China was officially proclaimed on 1 January 1912 by revolutionaries under Sun Yat-sen, the ROC's founder  and provisional president of the new republic, following the success of the 1911 Revolution. Puyi, the final Qing emperor, abdicated on 12 February 1912. Sun served briefly before handing the presidency to Yuan Shikai, the leader of the Beiyang Army. Yuan's Beiyang government quickly became authoritarian and exerted military power over the administration; in 1915, Yuan attempted to replace the Republic with his own imperial dynasty until popular unrest forced him to back down. When Yuan died in 1916, the country fragmented between local commanders of the Beiyang Army, beginning the Warlord Era defined by decentralized conflicts between rival cliques. At times, the most powerful of these cliques used their control of Beijing to assert claims to govern the entire Republic.\nMeanwhile, the KMT under Sun attempted multiple times to establish a rival national government in Guangzhou, eventually taking the city with the help of weapons, funding, and advisors from the Soviet Union under the condition that the KMT form the First United Front with the CCP. CCP members joined the KMT and the two parties cooperated to build a revolutionary base in Guangzhou, from which Sun planned to launch a campaign to reunify China. Sun's death in 1925 precipitated a power struggle that eventually resulted in the rise of General Chiang Kai-shek to KMT chairmanship. Chiang led the successful Northern Expedition from 1926 to 1928, benefitting from strategic alliances with warlords and the help of Soviet military advisors. By 1927, Chiang felt secure enough to end the alliance with the Soviets and purged the Communists from the KMT. In 1928, the last major warlord pledged allegiance to the KMT's Nationalist government in Nanjing. Chiang subsequently ruled the country as a one-party state (Dang Guo) under the KMT, receiving international recognition as the representative of China.\nWhile there was relative prosperity during the Nanjing decade (1927–1937), the ROC faced serious threats from within and without. After being severely weakened by the purge, the CCP gradually rebuilt its strength by organizing peasants in the countryside. In addition, warlords who resented Chiang's consolidation of power led several uprisings, most significantly the Central Plains War. In 1931, the Japanese invaded Manchuria, followed by a series of smaller encroachments and ultimately a full-scale invasion of China in 1937. World War II devastated China, leading to enormous loss of life and material destruction. War with Japan continued until its surrender in September 1945, after which Taiwan was placed under Chinese administration. Civil war then resumed, and the CCP's People's Liberation Army began to gain upper hand in 1948 over a larger and better-armed Republic of China Armed Forces due to better tactics and corruption within the ROC leadership. The CCP proclaimed the People's Republic of China in October 1949, though remnants of the ROC government would persist in mainland China until late 1951.\nName\nThe Republic of China's first provisional president, Sun Yat-sen, chose  as the country's official Chinese name. The name was derived from the language of the Tongmenghui's 1905 party manifesto, which proclaimed that the four goals of the Chinese revolution were \"to expel the Manchu rulers, revive China (Zhōnghuá), establish a people's state (mínguó), and distribute land equally among the people.\"}} On 15 July 1916, in his welcoming speech to the Cantonese delegates in Shanghai, Sun explained why the term  was chosen over the Japanese-derived . He associated the label  with the limiting and authoritarianism-prone Euro-American models of representative republicanism. What he strived for was a more grass-roots model, which he termed , and which he thought would allow more checks and balances by the people. Later on 20 October 1923, at a national conference for youths in Guangzhou, to explain the core idea behind , he pithily compared the phrase  to  in the form of a parallelism: an emperor's country is ruled by only one emperor (), a people's country is ruled by all four hundred million people (). Both the \"Beiyang Government\" (from 1912 to 1928), and the \"Nationalist Government\" (from 1928 to 1949) used the name \"Republic of China\" as their official name. In Chinese, the official name was often shortened to , , or .\nThe choice of the term  in 1912, as well as its similar semantic formation to , may have influenced the choice of the Korean term minguk () by the Provisional Government of the Republic of Korea (founded in 1919 within the Republic of China), which replaced Daehan Jeguk () with Daehan Minguk (). Today, the Republic of China () and Republic of Korea () are unique in the choice of the term  as an equivalent to \"republic\" in other languages.\nThe country was in English known at the time as \"the Republic of China\" or simply \"China\".\nIn China today, the period from 1912 to 1949 is often called the \"Republican Era\" (), because from the Chinese government's perspective the ROC ceased to exist in 1949. In Taiwan, these years are called the \"Mainland period\" (), since it was when the ROC was based on the mainland.\nHistory\nA republic was formally established on 1 January 1912 following the Xinhai Revolution, which itself began with the Wuchang uprising on 10 October 1911, successfully overthrowing the Qing dynasty and ending over two thousand years of imperial rule in China. From its founding until 1949, the republic was based on mainland China. Central authority waxed and waned in response to warlordism (1915–1928), a Japanese invasion (1937–1945), and a full-scale civil war (1927–1949), with central authority strongest during the Nanjing Decade (1927–1937), when most of China came under the control of the authoritarian, one-party military dictatorship of the nationalist Kuomintang party (KMT). Neither the Nanjing government nor the earlier Beiyang government succeeded in consolidating governance in rural China.\nIn 1945, at the end of World War II, the Empire of Japan surrendered control of Taiwan and its island groups to the Allies; and Taiwan was placed under the Republic of China's administrative control. The communist takeover of mainland China in 1949, after the Chinese Civil War, left the ruling Kuomintang with control over only Taiwan, Penghu, Kinmen, Matsu, and other minor islands. With the loss of the mainland, the ROC government retreated to Taiwan and the KMT declared Taipei the provisional capital. Meanwhile, the CCP took over all of mainland China and founded the People's Republic of China (PRC) in Beijing.\n1912–1916: Founding\n(left) and Sun Yat-sen (right) with flags representing the early republic]]\nIn 1912, after over two thousand years of dynastic rule, a republic was established to replace the monarchy. The Qing dynasty that preceded the republic had experienced instability throughout the 19th century and suffered from both internal rebellion and foreign imperialism. A program of institutional reform proved too little and too late. Only the lack of an alternative regime prolonged the monarchy's existence until 1912.\nThe Chinese Republic grew out of the Wuchang Uprising against the Qing government, on 10 October 1911, which is now celebrated annually as the ROC's national day, also known as \"Double Ten Day\". Sun Yat-sen had been actively promoting revolution from his bases in exile. He then returned from the United States to China and on 29 December, Sun Yat-sen was elected as the provisional president by the revolutionists' assembly in Nanjing, which consisted of representatives from seventeen provinces. On 1 January 1912, he was formally inaugurated and pledged \"to overthrow the despotic government led by the Manchu, consolidate the Republic of China and plan for the welfare of the people\". Sun's new government lacked military strength. As a compromise, he negotiated with Yuan Shikai the commander of the Beiyang Army, promising Yuan the presidency of the republic if he were to remove the Qing emperor by force. Yuan agreed to the deal. On 12 February 1912, regent Empress Dowager Longyu signed the abdication decree on behalf of Puyi, ending several millennia of monarchical rule. In 1913, official elections were held nation-wide for each provincial assemblies, which chose their legal delegates for the first National Assembly of the republic. The Kuomintang emerged as the formal political party that replaced the revolutionary organization Tongmenghui, and at the 1913 elections, it won the largest share of seats in both houses of the National Assembly and in some provincial assemblies. Song Jiaoren led the Kuomintang Party to electoral victories by fashioning his party's program to appeal to the gentry, landowners, and merchants. Song was assassinated on 20 March 1913, at the behest of Yuan Shikai.\nYuan was elected the first formal president of the ROC in 1913. He ruled by military power and ignored the republican institutions established by his predecessor, threatening to execute Senate members who disagreed with his decisions. He soon dissolved the ruling Kuomintang (KMT) party, banned \"secret organizations\" (which implicitly included the KMT), and ignored the provisional constitution. Ultimately, Yuan declared himself Emperor of China in 1915. The new ruler of China tried to increase centralization by abolishing the provincial system; however, this move angered the gentry along with the provincial governors, who were usually military men.\n1916–1927: Warlord Era\nYuan's changes to government caused many provinces to declare independence and become warlord states. Increasingly unpopular and deserted by his supporters, Yuan abdicated in 1916 and died of natural causes shortly thereafter. China then declined into a period of warlordism. Sun, having been forced into exile, returned to Guangdong in the south in 1917 and 1922, with the help of warlords, and set up successive rival governments to the Beiyang government in Beijing, having re-established the KMT in October 1919. Sun's dream was to unify China by launching an expedition against the north. However, he lacked the military support and funding to turn it into a reality.\nMeanwhile, the Beiyang government struggled to hold onto power, and an open and wide-ranging debate evolved regarding how China should confront the West. In 1919, a student protest against the government's weak response to the Treaty of Versailles, considered unfair by Chinese intellectuals, led to the May Fourth movement, whose demonstrations were against the danger of spreading Western influence replacing Chinese culture. It was in this intellectual climate that Marxist thought began to spread. The Chinese Communist Party (CCP) was founded in 1921.\nAfter Sun's death in March 1925, Chiang Kai-shek became the leader of the Kuomintang. In 1926, Chiang led the Northern Expedition with the intention of defeating the Beiyang warlords and unifying the country. Chiang received the help of the Soviet Union and the CCP. However, he soon dismissed his Soviet advisers, being convinced that they wanted to get rid of the KMT and take control. Chiang decided to purge the Communists, massacring thousands in Shanghai. At the same time, other violent conflicts were taking place in China: in the South, where the CCP had superior numbers, Nationalist supporters were being massacred.\n1927–1937: Nanjing decade\nChinese warlord coalitions during the \"Nanjing Decade\"]]\nChiang Kai-shek pushed the CCP into the interior and established a government, with Nanjing as its capital, in 1927. By 1928, Chiang's army overthrew the Beiyang government and unified the entire nation, at least nominally, beginning the Nanjing decade.\nSun Yat-sen envisioned three phases for the KMT rebuilding of Chinamilitary rule and violent reunification; ; and finally a constitutional democracy. In 1930, after seizing power and reunifying China by force, the \"tutelage\" phase started with the promulgation of a provisional constitution. In an attempt to distance themselves from the Soviets, the Chinese government sought assistance from Germany.\nAccording to Lloyd Eastman, Chiang Kai-shek was influenced by European fascist movements, and he launched the Blue shirts and the New Life Movement in imitation of them, in an effort to counter the growth of Mao's communism as well as resist both Western and Japanese imperialism. According to Stanley Payne, however, Chiang's KMT was \"normally classified as a multi-class populist or 'nation-building' party but not a fitting candidate for fascism (except by old-line Communists).\" He also stated that, \"Lloyd Eastman has called the Blue Shirts, whose members admired European fascism and were influenced by it, a Chinese fascist organization. This is probably an exaggeration. The Blue Shirts certainly exhibited some of the characteristics of fascism, as did many nationalist organizations around the world, but it is not clear that the group possessed the full qualities of an intrinsic fascist movement....The Blue Shirts probably had some affinity with and for fascism, a common feature of nationalisms in crisis during the 1930s, but it is doubtful that they represented any clear-cut Asian variant of fascism.\"\nStill other historians have noted that Chiang and the KMT's exact ideology itself was very complex and oscillated over time, with different factions of his government cooperating with both the Soviets and Germans as they saw fit, and that Chiang eventually became disillusioned with the Blue Shirts, which officially disbanded by 1938, something Payne also mentions as \"possibly because of competition with the KMT itself.\" Some have also noted that in contrast to older historians from decades ago, Chiang's efforts have been increasingly seen by newer Western and Chinese historians alike as an arguably necessary if austere part of the complicated nation-building process in China during his time, especially given the wide range of both domestic and foreign challenges it faced on many different concurrent fronts.\nSeveral major government institutions were founded during this period, including the Academia Sinica and the Central Bank of China. In 1932, China sent its first team to the Olympic Games. Campaigns were mounted and laws passed to promote the rights of women. In the 1931 Civil Code, women were given equal inheritance rights, banned forced marriage and gave women the right to control their own money and initiate divorce.\nNo nationally unified women's movement could organize until China was unified under the Kuomintang Government in Nanjing in 1928; women's suffrage was finally included in the new Constitution of 1936, although the constitution was not implemented until 1947.\nAddressing social problems, especially in remote villages, was aided by improved communications. The Rural Reconstruction Movement was one of many that took advantage of the new freedom to raise social consciousness. The Nationalist government published a draft constitution on 5 May 1936.\nContinual wars plagued the government. Those in the western border regions included the Kumul Rebellion, the Sino-Tibetan War, and the Soviet Invasion of Xinjiang. Large areas of China proper remained under the semi-autonomous rule of local warlords such as Feng Yuxiang and Yan Xishan, provincial military leaders, or warlord coalitions. Nationalist rule was strongest in the eastern regions around the capital Nanjing. The Central Plains War in 1930, the Japanese invasion of Manchuria in 1931, and the Red Army's Long March in 1934 led to more power for the central government, but there continued to be foot-dragging and even outright defiance, as in the Fujian Rebellion of 1933–1934.\nReformers and critics pushed for democracy and human rights, but the task seemed difficult if not impossible. The nation was at war and divided between Communists and Nationalists. Corruption and lack of direction hindered reforms. Chiang told the State Council: \"Our organization becomes worse and worse... many staff members just sit at their desks and gaze into space, others read newspapers and still others sleep.\"\n1937–1945: Second Sino-Japanese War\n]]\nFew Chinese had any illusions about Japanese desires on China. Hungry for raw materials and pressed by a growing population, Japan initiated the seizure of Manchuria in September 1931, and established the former emperor Puyi as head of the puppet state of Manchukuo in 1932. The loss of Manchuria, and its potential for industrial development and war industries, was a blow to the Kuomintang economy. The League of Nations, established at the end of World War I, was unable to act in the face of Japanese defiance.\nThe Japanese began to push south of the Great Wall into northern China and the coastal provinces. Chinese fury against Japan was predictable, but anger was also directed against Chiang and the Nanjing government, which at the time was more preoccupied with anti-Communist extermination campaigns than with resisting the Japanese invaders. The importance of \"internal unity before external danger\" was forcefully brought home in December 1936, when Chiang Kai-shek was kidnapped by Zhang Xueliang and forced to ally with the Communists against the Japanese in the Second United Front, an event now known as the Xi'an Incident.\nChinese resistance stiffened after 7 July 1937, when a clash occurred between Chinese and Japanese troops outside Beijing near the Marco Polo Bridge. This skirmish led to open, although undeclared, warfare between China and Japan. Shanghai fell after a three-month battle during which Japan suffered extensive casualties in both its army and navy. Nanjing fell in December 1937, which was followed by mass murders and rapes known as the Nanjing Massacre. The national capital was briefly at Wuhan, then removed in an epic retreat to Chongqing, the seat of government until 1945. In 1940, the Japanese set up the collaborationist Wang Jingwei regime, with its capital in Nanjing, which proclaimed itself the legitimate \"Republic of China\" in opposition to Chiang Kai-shek's government, although its claims were significantly hampered due to its being a puppet state controlling limited amounts of territory.\nsoldiers during the 1938 Yellow River flood]]\nThe United Front between the Kuomintang and the CCP had salutary effects for the beleaguered CCP, despite Japan's steady territorial gains in northern China, the coastal regions and the rich Yangtze River valley in central China. After 1940, conflicts between the Kuomintang and Communists became more frequent in the areas not under Japanese control. The Communists expanded their influence wherever opportunities presented themselves through mass organizations, administrative reforms and the land- and tax-reform measures favoring the peasants and, the spread of their organizational network, while the Kuomintang attempted to neutralize the spread of Communist influence. Meanwhile, northern China was infiltrated politically by Japanese politicians in Manchukuo using facilities such as the Manchukuo Imperial Palace.\nAfter its entry into the Pacific War during World War II, the United States became increasingly involved in Chinese affairs. As an ally, it embarked in late 1941 on a program of massive military and financial aid to the hard-pressed Nationalist Government. In January 1943, both the United States and the United Kingdom led the way in revising their unequal treaties with China from the past. Within a few months a new agreement was signed between the United States and the Republic of China for the stationing of American troops in China as part of the common war effort against Japan. The United States sought unsuccessfully to reconcile the rival Kuomintang and Communists, to make for a more effective anti-Japanese war effort. In December 1943, the Chinese Exclusion Acts of the 1880s, and subsequent laws, enacted by the United States Congress to restrict Chinese immigration into the United States were repealed. The wartime policy of the United States was meant to help China become a strong ally and a stabilizing force in postwar East Asia. During the war, China was one of the Big Four Allies, and later one of the Four Policemen, which was a precursor to China having a permanent seat on the United Nations Security Council.\nIn August 1945, with American help, Nationalist troops moved to take the Japanese surrender in North China. The Soviet Union—encouraged to invade Manchuria to hasten the end of the war and allowed a Soviet sphere of influence there as agreed to at the Yalta Conference in February 1945—dismantled and removed more than half the industrial equipment left there by the Japanese. Although the Chinese had not been present at Yalta, they had been consulted and had agreed to have the Soviets enter the war, in the belief that the Soviet Union would deal only with the Kuomintang government. However, the Soviet presence in northeast China enabled the Communists to arm themselves with equipment surrendered by the withdrawing Japanese army.\n1945–1949: Defeat in the Chinese Civil War\nIn 1945, after the end of the war, the Nationalist Government moved back to Nanjing. The Republic of China emerged from the war nominally a great military power but actually a nation economically prostrate and on the verge of all-out civil war. The problems of rehabilitating the formerly Japanese-occupied areas and of reconstructing the nation from the ravages of a protracted war were staggering. The economy deteriorated, sapped by the military demands of foreign war and internal strife, by spiraling inflation, and by Nationalist profiteering, speculation, and hoarding. Starvation came in the wake of the war, and millions were rendered homeless by floods and unsettled conditions in many parts of the country.\nOn 25 October 1945, following the surrender of Japan, the administration of Taiwan and Penghu Islands were handed over from Japan to China. After the end of the war, United States Marines were used to hold Beijing and Tianjin against a possible Soviet incursion, and logistic support was given to Kuomintang forces in north and northeast China. To further this end, on 30 September 1945 the 1st Marine Division, charged with maintaining security in the areas of the Shandong Peninsula and the eastern Hebei, arrived in China.\nIn January 1946, through the mediation of the United States, a military truce between the Kuomintang and the Communists was arranged, but battles soon resumed. Public opinion of the administrative incompetence of the Nationalist government was incited by the Communists during the nationwide student protest against the mishandling of the Shen Chong rape case in early 1947 and during another national protest against monetary reforms later that year. The United States—realizing that no American efforts short of large-scale armed intervention could stop the coming war—withdrew Gen. George Marshall's American mission. Thereafter, the Chinese Civil War became more widespread; battles raged not only for territories but also for the allegiance of sections of the population. The United States aided the Nationalists with massive economic loans and weapons but no combat support.\n, Chengdu, and Xichang before arriving in Taipei.]]\nBelatedly, the Republic of China government sought to enlist popular support through internal reforms. However, the effort was in vain, because of rampant government corruption and the accompanying political and economic chaos. By late 1948 the Kuomintang position was bleak. The demoralized and undisciplined National Revolutionary Army proved to be no match for the Communists' motivated and disciplined People's Liberation Army. The Communists were well established in the north and northeast. Although the Kuomintang had an advantage in numbers of men and weapons, controlled a much larger territory and population than their adversaries, and enjoyed considerable international support, they were exhausted by the long war with Japan and in-fighting among various generals. They were also losing the propaganda war to the Communists, with a population weary of Kuomintang corruption and yearning for peace.\nIn January 1949, Beiping was taken by the Communists without a fight, and its name changed back to Beijing. Following the capture of Nanjing on 23 April, major cities passed from Kuomintang to Communist control with minimal resistance, through November. In most cases the surrounding countryside and small towns had come under Communist influence long before the cities. Finally, on 1 October 1949, Communists led by Mao Zedong founded the People's Republic of China. Chiang Kai-shek declared martial law in May 1949, whilst a few hundred thousand Nationalist troops and two million refugees, predominantly from the government and business community, fled from mainland China to Taiwan. There remained in China itself only isolated pockets of resistance. On 7 December 1949, Chiang proclaimed Taipei the temporary capital of the Republic of China.\nDuring the Chinese Civil War both the Nationalists and Communists carried out mass atrocities, with millions of non-combatants killed by both sides. Benjamin Valentino has estimated atrocities in the civil war resulted in the death of between 1.8&nbsp;million and 3.5&nbsp;million people between 1927 and 1949, including deaths from forced conscription and massacres.\nGovernment\nThe first Republic of China national government was established on 1 January 1912, in Nanjing, with a constitution stating Three Principles of the People, which state that \"[the ROC] shall be a democratic republic of the people, to be governed by the people and for the people.\"\nSun Yat-sen was the provisional president. Delegates from the provinces sent to confirm the government's authority formed the first parliament in 1913. The power of this government was limited, with generals controlling both the central and northern provinces of China, and short-lived. The number of acts passed by the government was few and included the formal abdication of the Qing dynasty and some economic initiatives. The parliament's authority soon became nominal: violations of the Constitution by Yuan were met with half-hearted motions of censure. Kuomintang members of parliament who gave up their membership in the KMT were offered 1,000 pounds. Yuan maintained power locally by sending generals to be provincial governors or by obtaining the allegiance of those already in power.\nWhen Yuan died, the parliament of 1913 was reconvened to give legitimacy to a new government. However, the real power passed to military leaders, leading to the warlord period. The impotent government still had its use; when World War I began, several Western powers and Japan wanted China to declare war on Germany, to liquidate German holdings in China.\nIn February 1928, the Fourth Plenary Session of the 2nd Kuomintang National Congress, held in Nanjing, passed the Reorganization of the Nationalist Government Act. This act stipulated that the Nationalist Government was to be directed and regulated under the Central Executive Committee of the Kuomintang, with the Committee of the Nationalist Government being elected by the KMT Central Committee. Under the Nationalist Government were seven ministries—Interior, Foreign Affairs, Finance, Transport, Justice, Agriculture and Mines, and Commerce, in addition to institutions such as the Supreme Court, Control Yuan, and the General Academy.\nof Nanjing, which nominally ruled over all of China during 1930s]]\nWith the promulgation of the Organic Law of the Nationalist Government in October 1928, the government was reorganized into five different branches, or yuan, namely the Executive Yuan, Legislative Yuan, Judicial Yuan, Examination Yuan as well as the Control Yuan. The Chairman of the National Government was to be the head-of-state and commander-in-chief of the National Revolutionary Army. Chiang Kai-shek was appointed as the first chairman, a position he would retain until 1931. The Organic Law also stipulated that the Kuomintang, through its National Congress and Central Executive Committee, would exercise sovereign power during the period of \"political tutelage\", that the KMT's Political Council would guide and superintend the Nationalist Government in the execution of important national affairs, and that the Political Council has the power to interpret or amend the Organic Law.\nShortly after the Second Sino-Japanese War, a long-delayed constitutional convention was summoned to meet in Nanjing in May 1946. Amidst heated debate, this convention adopted many constitutional amendments demanded by several parties, including the KMT and the Communist Party, into the Constitution. This Constitution was promulgated on 25 December 1946 and came into effect on 25 December 1947. Under it, the Central Government was divided into the presidency and the five yuans, each responsible for a part of the government. None was responsible to the other except for certain obligations such as the president appointing the head of the Executive Yuan. Ultimately, the president and the yuans reported to the National Assembly, which represented the will of the citizens.\nUnder the new constitution the first elections for the National Assembly occurred in January 1948, and the assembly was summoned to meet in March 1948. It elected the president of the republic on 21 March 1948, formally bringing an end to the KMT party rule started in 1928, although the president was a member of the KMT. These elections, though praised by at least one US observer, were poorly received by the Communist Party, which would soon start an open, armed insurrection.\nForeign relations\nBefore the Nationalist government was ousted from the mainland, the Republic of China had diplomatic relations with 59 countries, including Australia, Canada, Cuba, Czechoslovakia, Estonia, France, Germany, Guatemala, Honduras, Italy, Japan, Latvia, Lithuania, Norway, Panama, Siam, the Soviet Union, Spain, the United Kingdom, the United States, and the Holy See. The Republic of China was able to maintain most of these diplomatic ties, at least initially following the retreat to Taiwan. Chiang Kai-shek had vowed to quickly return and \"liberate\" the mainland, an assurance that became a cornerstone of the ROC's post 1949 foreign policy.\nThe foreign concessions that existed prior to the Republic continued to exist. By the early 1930s China regained sovereignty over around 2/3rds of them.\nThe ROC did try to participate in a variety of entities for the international community including the League of Nations along with its successor the United Nations and the Olympic Games. It was hoped by the government that participating in the Olympic Games this could give more legitimacy to the country in the eyes of the international community and \"sports could also cultivate modern citizens and a strong nation\". The Republic of China sent athletes to the 1924 Summer Olympics in Paris, 1932 Summer Olympics in Los Angeles, 1936 Summer Olympics in Berlin and the 1948 Summer Olympics but no athletes won any medals. For 1928 a single athlete was sent. Although athletes were sent to the 1924 games they did not participate in the games.\nLeague of Nations\nThe Republic of China was a member of the League of Nations and participated until it was dissolved. Those in the country's foreign relations were among the most stable of those working in the government in terms of composition. The ROC was a non-permanent member of the League Council for the League of Nations being a non-permanent member of the League Council from: 1921–1923, 1926–1928, 1931–1932, 1934, and 1936. Although the ROC lobbied to be a permanent member of the League Council it never became one. At the League of Nations, China wanted to see the unequal treaties revised. The ROC thought that by being in the League they could improve their international standing.\nUnited Nations\nUnder the Charter of the United Nations, the Republic of China was entitled to a permanent seat on the UN Security Council (UNSC). Though multiple objections were raised that the seat belonged to the lawful government of China, which had to many become the PRC even arguably prior to the official conclusion of the Chinese Civil War, the ROC retained the permanent seat reserved for China on the UNSC until 1971 when it was supplanted by the PRC.\nAdministrative divisions\n{| class=\"wikitable\"\n|+Provinces and Equivalents of the Republic of China (1945)\n|- bgcolor=\"#cccccc\"\n! Name!!TraditionalChinese!!Pinyin!!Abbreviation!!Capital!!Chinese!!Modern equivalent (if applicable)\n|-\n| colspan=7 align=\"center\" style=\"background: #ffff99;\" |Provinces\n|-\n|Andong||安東||Āndōng||安 ān||Tonghua||通化||\n|-\n|Anhui||安徽||Ānhuī||皖 wǎn||Hefei||合肥||\n|-\n|Chahar||察哈爾||Cháhār||察 chá||Zhangyuan (Zhangjiakou)||張垣(張家口)||\n|-\n|Zhejiang||浙江||Zhèjiāng||浙 zhè||Hangzhou||杭州||\n|-\n|Fujian||福建||Fújiàn||閩 mǐn||Fuzhou||福州||\n|-\n|Hebei||河北||Héběi||冀 jì||Qingyuan (Baoding)||清苑(保定)||\n|-\n|Heilongjiang||黑龍江||Hēilóngjiāng||黑 hēi||Bei'an||北安||\n|-\n|Hejiang||合江||Héjiāng||合 hé||Jiamusi||佳木斯||\n|-\n|Henan||河南||Hénán||豫 yù||Kaifeng||開封||\n|-\n|Hubei||湖北||Húběi||鄂 è||Wuchang||武昌||\n|-\n|Hunan||湖南||Húnán||湘 xiāng||Changsha||長沙||\n|-\n|Xing'an||興安||Xīng'ān||興 xīng||Hailar (Hulunbuir)||海拉爾(呼倫貝爾)||\n|-\n|Jehol (Rehe)||熱河||Rèhé||熱 rè||Chengde||承德||\n|-\n|Gansu||甘肅||Gānsù||隴 lǒng||Lanzhou||蘭州||\n|-\n|Jiangsu||江蘇||Jiāngsū||蘇 sū||Zhenjiang||鎮江||\n|-\n|Jiangxi||江西||Jiāngxī||贛 gàn||Nanchang||南昌||\n|-\n|Jilin||吉林||Jílín||吉 jí||Jilin||吉林||\n|-\n|Guangdong||廣東||Guǎngdōng||粵 yuè||Guangzhou||廣州||\n|-\n|Guangxi||廣西||Guǎngxī||桂 guì||Guilin||桂林||\n|-\n|Guizhou||貴州||Guìzhōu||黔 qián||Guiyang||貴陽||\n|-\n|Liaobei||遼北||Liáoběi||洮 táo||Liaoyuan||遼源||\n|-\n|Liaoning||遼寧||Liáoníng||遼 liáo||Shenyang||瀋陽||\n|-\n|Ningxia||寧夏||Níngxià||寧 níng||Yinchuan||銀川||\n|-\n|Nenjiang||嫩江||Nènjiāng||嫩 nèn||Qiqihar||齊齊哈爾 ||\n|-\n|Shanxi||山西||Shānxī||晉 jìn||Taiyuan||太原||\n|-\n|Shandong||山東||Shāndōng||魯 lǔ||Jinan||濟南||\n|-\n|Shaanxi||陝西||Shǎnxī||陝 shǎn||Xi'an||西安||\n|-\n|Xikang||西康||Xīkāng||康 kāng||Kangding||康定||\n|-\n|Xinjiang||新疆||Xīnjiāng||新 xīn||Dihua (Ürümqi)||迪化(烏魯木齊)||\n|-\n|Suiyuan||綏遠||Suīyuǎn||綏 suī||Guisui (Hohhot)||歸綏(呼和浩特)||\n|-\n|Songjiang||松江||Sōngjiāng||松 sōng||Mudanjiang||牡丹江||\n|-\n|Sichuan||四川||Sìchuān||蜀 shǔ||Chengdu||成都||\n|-\n|Taiwan||臺灣||Táiwān||臺 tái||Taipei||臺北||\n|-\n|Qinghai||青海||Qīnghǎi||青 qīng||Xining||西寧||\n|-\n|Yunnan||雲南||Yúnnán||滇 diān||Kunming||昆明||\n|-\n| colspan=7 align=\"center\" style=\"background: #ffff99;\" |Special Administrative Region\n|-\n|Hainan||海南||Hǎinán||瓊 qióng||Haikou||海口||\n|-\n| colspan=7 align=\"center\" style=\"background: #ffff99;\" |Regions\n|-\n|Mongolia Area (Outer Mongolia)||蒙古||Ménggǔ||蒙 méng||Kulun (now Ulaanbaatar)||庫倫||}}\n|-\n|Tibet Area (Tibet)||西藏||Xīzàng||藏 zàng||Lhasa||拉薩||\n|-\n|colspan=7 align=\"center\" style=\"background: #ffff99;\" |Special Municipalities\n|-\n|Nanjing||南京||Nánjīng||京 jīng||(Qinhuai District)||秦淮區||\n|-\n|Shanghai||上海||Shànghǎi||滬 hù||(Huangpu District)||黄浦區||\n|-\n|Harbin||哈爾濱||Hā'ěrbīn||哈 hā||(Nangang District)||南崗區||\n|-\n|Shenyang||瀋陽||Shěnyáng||瀋 shěn||(Shenhe District)||瀋河區||\n|-\n|Dalian||大連||Dàlián||連 lián||(Xigang District)||西崗區||\n|-\n|Beijing (while capital)||北平||Běipíng||平 píng||(Xicheng District)||西城區||\n|-\n|Tianjin||天津||Tiānjīn||津 jīn||(Heping District)||和平區||\n|-\n|Chongqing||重慶||Chóngqìng||渝 yú||(Yuzhong District)||渝中區||\n|-\n|Hankou, Wuhan||漢口||Hànkǒu||漢 hàn||(Jiang'an District)||江岸區||\n|-\n|Guangzhou||廣州||Guǎngzhōu||穗 suì||(Yuexiu District)||越秀區||\n|-\n|Xi'an||西安||Xī'ān||安 ān||(Weiyang District)||未央區||\n|-\n|Qingdao||青島||Qīngdǎo||膠 jiāo||(Shinan District)||市南區||\n|}\nNobility\nThe Republic of China retained hereditary nobility like the Han Chinese nobles Duke Yansheng and Celestial Masters and Tusi chiefdoms like the Chiefdom of Mangshi, Chiefdom of Yongning, who continued possessing their titles in the Republic of China from the previous dynasties.\nMilitary\nThe number of soldiers China had full-time varied depending on the year but overall increased over time. By the mid-1930s close to when the Second Sino-Japanese War began, China had 2 million soldiers.\nMilitary conscription was practiced in the Republic of China starting in March 1936 after a 1933 law was passed. All males between 18 and 45 were required to register for as citizen-soldiers where they would learn how to use weapons, build fortifications, execute basic orders, conduct reconnaissance and do liaison work. Able-bodied men from 20 to 25 were required to serve in the military for 3 years before becoming reservists which they would remain as until they were 45. Those being exempt from serving in the military were: only sons, high school graduates and above, students who were in high school or above, could not meet physical standards, \"suffered from incurable diseases\" and had special governmental appointments. One could also get a deferment if they were civil servants, \"could not recover from any disease within months\", teachers, \"those who were not clear of suspicion for criminal offenses\" or where half the sons in a given family were active duty soldiers. Those barred from military service were people who were serving a life sentence or \"deprived of political rights\".\nArmy\ntroops in the 1920s]]\nThe Republic of China's military initially consisted of the decentralized forces of the former Qing dynasty, with the most modern and organized being the Beiyang Army, before it split into factions that attacked each other. During the Second Revolution in 1913, as the president of the republic, Yuan Shikai used the Beiyang Army to defeat provincial forces opposed to him and to extend his control over north China and other provinces as far south as the Yangtze River. This also led to the expansion of the size of the Beiyang Army, and an effort was made by Yuan to reduce provincial armies in areas he controlled, though they were not completely disbanded. Yuan ended the Qing practice of frequently rotating officers among command positions in the Beiyang divisions, which led to the subordinates developing personal loyalty to their commanders, whose units became their power base. He maintained control over the Beiyang Army by providing the division commanders with the patronage of the presidency, and had them keep each other in check. Yuan was unable to completely reorganize the fragmented command structure of China's military to be more of a bureaucratic institution under the direct control of the central government. After Yuan's death in 1916, the Beiyang Army split among different factions led by his generals that rivaled each other. Though they continued to control the central government in Beijing, they were unable to take over the south. The southern warlords had their own armies but they were also divided by conflicts among themselves. Despite the breakdown of centralized leadership, some military schools established during the Qing dynasty continued to function during the warlord era, including the Baoding Military Academy, which graduated the majority of officers that served in warlord armies and many that later became Nationalist officers.\nSun Yat-sen created a new government in 1917 as an alternative to the Beiyang, but he did not have the military power to control the southern warlords. Therefore, the National Revolutionary Army was established by Sun in 1924 in Guangdong with the goal of reunifying China under the Kuomintang, with Soviet advisors and equipment. To avoid the problems of warlord armies, the NRA was under the political and ideological control of a party, the KMT, and included party representatives in its ranks. After Sun's death in 1925, Chiang Kai-shek led the Nationalist Army in its first campaign against less organized warlord forces from 1926 to 1928, becoming known as the Northern Expedition. After the success of the Northern Expedition the National Revolutionary Army was seen as China's national army, despite warlords still controlling parts of the country. During the next decade the army was increased in size from 250,000 to around two million, organized into 200 divisions. In the 1930s a small number of these divisions received training from German instructors, as well as modern uniforms and weapons, as part of the process of creating a professional army. The Whampoa Military Academy had been established by Sun Yat-sen with Soviet assistance to provide officers for the KMT army, and in 1928 it was moved to Nanjing to become the Central Military Academy, where its size and training program was expanded by the Germans. But these German-trained forces represented a small part of the total KMT army, numbering about 40 divisions.\nWhen the war between Japan and China broke out in 1937, Chiang Kai-shek deployed his best divisions to central China, where they took heavy losses during the Battle of Shanghai and the following retreat. Half of the officers that graduated from the Central Military Academy were killed in the first few months of fighting. By 1941, the Chinese Nationalist Army had 3.8 million troops in 246 front-line divisions and 70 reserve divisions, though the majority of the divisions were under-strength and the troops were poorly trained. Many of these divisions were still more loyal to warlords than to Chiang Kai-shek. The U.S. also provided military assistance to China, planning to equip 30 divisions, but the prioritization of the European theater and the logistical difficulties of getting the supplies to China prevented these plans from being fully carried out.\nAfter the Battle of Wuhan in 1938, the Chinese Army tried to avoid direct large scale fighting with the Japanese. Chiang also wanted to preserve his army instead of engaging in ground operations, despite pressure from the American leadership to go on the offensive. It was not until early 1944 when Chiang agreed to launch a major offensive against Japanese forces in Burma to reopen the overland supply line to China, though it was unsuccessful. It took place around the same time as Japan's largest offensive since 1941, Operation Ichi-Go. The Japanese advanced rapidly in central and southeast China, as the Chinese Army still suffered from a lack of supplies, and by the start of 1945 they captured several U.S. air bases and created a direct connection to French Indochina. In early 1945, Chinese and Allied troops in Burma succeeded in opening a land route to India, allowing more equipment to be sent to the Chinese, which they used to stop Japanese advances in southeast China by May. They were planning an offensive to retake control of a port in southern China when Japan surrendered.\nDuring the Second Sino-Japanese War, the armed forces of the CCP were nominally incorporated into the National Revolutionary Army, while remaining under separate command, but broke away to form the People's Liberation Army shortly after the end of the war. With the promulgation of the Constitution of the Republic of China in 1947 and the formal end of the KMT party-state, the National Revolutionary Army was renamed the Republic of China Armed Forces, with the bulk of its forces forming the Republic of China Army, which retreated to Taiwan in 1949 after their defeat in the Chinese Civil War. Units which surrendered and remained in mainland China were either disbanded or incorporated into the People's Liberation Army.\nNavy\nwas the Chinese navy's flagship in the early 1930s.]]\nThe Republic of China's Navy during between 1911 and 1949 was primarily composed of ships from the Qing Dynasty or ships obtained from foreign countries. As most threats to the Republic were on land from the warlords and the Communists there was no interest in developing any maritime strategies. No significant efforts were made during this period to grow the navy because of China being in a state of general disarray. Sometimes warlords did use maritime forces but mainly as a way of supporting land combat. When Sun Yat-sen established his constitutional protection government in Guangzhou in 1917, some of his early support came from the Chinese navy, represented by admirals Cheng Biguang and Lin Baoyi. In 1926, Admiral Yang Shuzhuang led some elements of the Beiyang Fleet to defect to the National Revolutionary Army and became the head of the revolutionary navy on the Yangtze River. One of Admiral Yang's subordinates was Chen Shaokuan, who became the commander of the ROC Navy in 1932 and remained in that position until after the war with Japan. During the 1930s he organized the Chinese navy into the Central, Northeast, and Guangdong Fleets.\nChiang Kai-shek announced in 1928 that it was his intention to build a large navy for China, but this goal was undermined by financial problems and other difficulties. Many senior officers did not have modern naval training, and newer officers that were educated in Western countries were not promoted. When the war with Japan broke out, the majority of the Chinese fleet was used during the Battle of Shanghai to slow down the Japanese advance along the Yangtze River. Many ships were sunk by Japanese aircraft or were sunk deliberately by the Chinese to use as blockships in the Yangtze. By 1939 most of the Chinese navy had been destroyed, with one estimate claiming that over 100 of the navy's 120 ships in 1937 had been sunk. Some Chinese warships (notably the cruisers Ning Hai and Ping Hai) were later refloated and put into service by the Imperial Japanese Navy. The building of a Chinese navy was no longer a priority during the rest of the war, and in 1940 Chiang Kai-shek disbanded the Ministry of the Navy.\nIn 1945, Chiang revived plans to create a modern Chinese Navy and asked the United States for assistance. The Nationalists received over 100 ships from the U.S. and its allied countries, as well as some captured Axis ships. Before the end of 1945 a navy training center was established in Qingdao by the U.S. Navy. The new navy was mainly used to transport troops and patrol the coastline during the Chinese Civil War. In 1948, the former British cruiser HMS Aurora was gifted to China and was renamed Chongqing, becoming the flagship of the ROCN. In February 1949, as Chinese Communist forces advanced to the Yangtze River from the north, a mutiny of sailors occurred on Chongqing and the flagship defected to the Communists. This was followed in April by a mutiny of the entire fleet along the Yangtze, which was led by its commander to the other side. Because of this, 23 April 1949 is considered the founding date of the People's Liberation Army Navy. At the end of the war the rest of the ROCN moved Nationalist troops from the mainland to Taiwan.\nThe ROC Marine Corps was created from the former Naval Guard Corps, and consisted of two marine brigades, which were used during the war against Japan in several provinces before the corps was disbanded in 1946. In 1947, a reorganized Republic of China Marine Corps was created by the commander of the Navy using select personnel from the Army.\nAir Force\nbomber with Chinese Nationalist insignia]]\nThe Republic of China Air Force during the Second-Sino Japanese War was outmatched by the Japanese aviation forces. Foreign advisors from Germany, France, Italy and the United Kingdom came to China in the 1930s; while foreign aircraft were also imported from a variety of countries. With the beginning of the war they began to rely most heavily on the United States and Soviet Union for advisors. The low amount of planes being domestically produced would prove to be a hindrance.\nBeginning in 1929, the Nationalist government started expanding its air power to improve its position over warlords and the Communists. The ROC Air Force was formally established in April 1929, and that month the aviation department of the Ministry of War was separated as the National Aviation Administration, with General Chang We-chang as its head. He started a program of buying American aircraft, with the first, Vought Corsair planes, arriving in early 1930. The Chinese Air Force expanded from the first 12 Corsair planes in 1930 to a size of eight squadrons, with seven of bomber-observation planes and one of pursuit planes, in 1931, with a total of 40 to 50 aircraft. Several American pilots became advisors to China's air force and fought in battles against the Japanese or warlords. The Nationalist Air Force had a role in the Central Plains War of 1930 by bombing cities, directing artillery, and observing warlord army defensive positions, and is credited with helping bring about a faster victory for Chiang Kai-shek's government. It had less success against the Japanese during the Shanghai Incident in 1932.\nIn September 1932, the Central Aviation School was founded with the help of an American mission led by John Jouett, and its graduates included the majority of Chinese pilot officers by 1937. On his recommendation, the ROCAF was restructured, with a Ministry of Aviation equal to that of the Military and Navy Ministries being established under the Military Affairs Commission. Additional planes were purchased, and factories were also opened in China. As of 1936, the Chinese Air Force had 645 aircraft, and multiple factories and schools.\nWhen the war with Japan broke out in July 1937, much of the ROC Air Force was destroyed during the fighting in central China by December of that year. From 1938 to 1940 the Soviet Volunteer Group did much of the fighting against the Japanese, along with the remnants of the ROCAF. The Soviets sent 885 planes to China over those years.\nEconomy\n, Shanghai, 1920]]\nIn the early years of the Republic of China, the economy remained unstable as the country was marked by constant warfare between different regional warlord factions. The Beiyang government in Beijing experienced constant changes in leadership, and this political instability led to stagnation in economic development until Chinese reunification in 1928 under the Kuomintang. After this reunification, China entered a period of relative stability—despite ongoing isolated military conflicts and in the face of Japanese aggression in Shandong and Manchuria, in 1931—a period known as the \"Nanjing Decade\".\nChinese industries grew considerably from 1928 to 1931. While the economy was hit by the Japanese occupation of Manchuria in 1931 and the Great Depression from 1931 to 1935, industrial output recovered to their earlier peak by 1936. This is reflected by the trends in Chinese GDP. In 1932, China's GDP peaked at 28.8&nbsp;billion, before falling to 21.3&nbsp;billion by 1934 and recovering to 23.7&nbsp;billion by 1935. By 1930, foreign investment in China totaled 3.5&nbsp;billion, with Japan leading (1.4&nbsp;billion) followed by the United Kingdom (1&nbsp;billion). By 1948, however, the capital investment had halted and dropped to only 3&nbsp;billion, with the US and Britain being the leading investors.\nHowever, the rural economy was hit hard by the Great Depression of the 1930s, in which an overproduction of agricultural goods lead to falling prices for China as well as an increase in foreign imports (as agricultural goods produced in western countries were \"dumped\" in China). In 1931, Chinese imports of rice amounted to 21&nbsp;million bushels compared with 12&nbsp;million in 1928. Other imports saw even more increases. In 1932, 15&nbsp;million bushels of grain were imported compared with 900,000 in 1928. This increased competition lead to a massive decline in Chinese agricultural prices and thus the income of rural farmers. In 1932, agricultural prices were at 41 percent of 1921 levels. By 1934, rural incomes had fallen to 57 percent of 1931 levels in some areas.\nIn 1937, the Second Sino-Japanese War began with a Japanese invasion of China, and the resulting warfare laid waste to China. Most of the prosperous east coast was occupied by the Japanese, who committed atrocities such as the Nanjing massacre. In one anti-guerilla sweep in 1942, the Japanese killed up to 200,000 civilians in a month. The war was estimated to have killed between 20 and 25&nbsp;million Chinese, and destroyed all that Chiang had built up in the preceding decade. Development of industries was severely hampered after the war by devastating civil conflict as well as the inflow of cheap American goods. By 1946, Chinese industries operated at 20% capacity and had 25% of the output of pre-war China.\nOne effect of the war with Japan was a massive increase in government control of industries. In 1936, government-owned industries were only 15% of GDP. However, the ROC government took control of many industries to fight the war. In 1938, the ROC established a commission for industries and mines to supervise and control firms, as well as instilling price controls. By 1942, 70% of Chinese industry was owned by the government.\nFollowing the surrender of Japan in World War II, Japanese Taiwan was placed under the control of the ROC. In the meantime, the KMT renewed its struggle with the communists. However, the corruption and hyperinflation as a result of trying to fight the civil war, resulted in mass unrest throughout the Republic and sympathy for the communists. In addition, the communists' promise to redistribute land gained them support among the large rural population. In 1949, the communists captured Beijing and later Nanjing. The People's Republic of China was proclaimed on 1 October 1949. The Republic of China relocated to Taiwan where Japan had laid an educational groundwork.\nTransportation\nChina's infrastructure would grow dramatically during this period. The railroad network length grew from  in 1912 to  by 1945. The Shanxi warlord Yan Xishan was known for his strong commitment toward developing railroads. During the Nanjing decade the length of the highway network grew from  to  while growth was also seen in navigable waterways. In the early 1930s, a Sichuan warlord named Liu Xiang was strongly committed toward creating an entirely Chinese navigation company and eliminating foreign-owned companies in the Yangtze River basin.\nCommunications\nThe Republic of China had a national postal system which began under the Qing Dynasty and carried over into the Republican period. The postal service did pull of Manchuria when the Japanese did invade it in 1931 and in Mongolia in 1924. The postal service continued to operate in other areas of the country even when they were taken by the Japanese and eventually began offering their services once again in Manchuria. In rural areas the postal service even offered free deliveries.\nRadio had been previously experimented with during the Qing Dynasty and work continued into the Republican era. Radio stations began appearing in the 1920s being mainly concentrated in Shanghai. The Kuomintang would create a national radio program, the Central China Broadcasting Station (CCBS). The CBBS held programs that related to the news, education and entertainment along with putting the news in difference dialects of Chinese. However, those who actually listened to the radio in China were predominantly in the urban areas. Most radios were foreign made and little were made domestically.\nCulture\nPrior to the fall of the Qing dynasty, interaction and trade with western countries was more common in China than it had been in previous times. This led to greater cultural influence from the west in China. The culture of China and daily life within the country was disrupted from its previous state by the fall of dynastic rule. The Republic of China maintained the increase of western cultural influence in the country. Chinese intellectuals of the time were not unified in their opinions on the cultural changes occurring in the newly founded state. Some took progressive stances and advocated for Art Reform, while more conservative intellectuals believed China should maintain older Chinese traditions.\nMotion pictures were introduced to China in 1896. They were introduced through foreign film exhibitors in treaty ports like Shanghai and Hong Kong. Chinese-made short melodrama and comedy films began emerging in 1913. Chinese film production developed significantly in the 1920s.Throughout the 1920s and 1930s, filmmaking in China was largely done by film studios and there was comparatively little small scale filmmaking.Upscale movie theaters in China had contracts which required them to exclusively show Hollywood films, and thus as of the later 1920s, Hollywood films accounted for 90% of screen time in Chinese theaters. After the Japanese invasion of China in 1937, a large number filmmakers left to join the War of Resistance, with many going to the Nationalist-controlled hinterlands to join the Nationalist film studios Central Motion Picture Studio or China Motion Picture Studio. A smaller number went to Yan'an or Hong Kong.\nDuring the Nanjing government, the ROC launched a cultural campaign promoting the \"Arts of the Three Principles of the People.\" It sought (mostly unsuccessfully) to attract cultural workers to create new propaganda works and more successfully established a censorship apparatus directed against unwelcome cultural products, especially left-wing artists and their works.\nSee also\n* Sino-Soviet relations\n* Economic history of China (1912–1949)\n* History of China–United States relations\n* Vice Premier of the Republic of China\n* Project National Glory\n* Republican Fever\nNotes\nReferences\nCitations\nSources\n* Boorman, Howard, et al., eds.,Biographical Dictionary of Republican China. (New York: Columbia University Press, 4 vols, 1967–1971). 600 articles. Available online at Internet Archive.\n*\n*\n*\n*\n*\n*\n* . In the series \"Inventing the Nation.\"\n*\n*\n* Jowett, Philip. (2013) ''China's Wars: Rousing the Dragon 1894–1949 (Bloomsbury Publishing, 2013).\n* Leung, Edwin Pak-wah. Historical Dictionary of Revolutionary China, 1839–1976 (1992) [https://archive.org/details/historicaldictio0000unse online free to borrow]\n* Leung, Edwin Pak-wah. Political Leaders of Modern China: A Biographical Dictionary (2002)\n* Li, Xiaobing. (2007) A History of the Modern Chinese Army [https://books.google.com/books?id=svBt-hzD53AC excerpt]\n* Li, Xiaobing. (2012) China at War: An Encyclopedia [https://books.google.com/books?id=R7qNuIJJsNEC excerpt]\n*\n*\n*\n*\n* Paulès, Xavier, The Republic of China, 1912–1949 (Polity Press, 2023).\n*\n*\n*\n*\n*\n* Vogel, Ezra F. China and Japan: Facing History (2019) [https://www.amazon.com/China-Japan-Ezra-F-Vogel/dp/0674916573/ excerpt]\n* Westad, Odd Arne. Restless Empire: China and the World since 1750 (2012) [https://archive.org/details/restlessempirech0000west Online free to borrow]\n* Wilbur, Clarence Martin. Sun Yat-sen, frustrated patriot (Columbia University Press, 1976), a major scholarly biography [https://archive.org/details/sunyatsenfrustra0000wilb online]\n*\n; Historiography\n* Yu, George T. \"The 1911 Revolution: Past, Present, and Future\", Asian Survey'', 31#10 (1991), pp.&nbsp;895–904, [https://www.jstor.org/stable/2645062 online]  historiography\n*\nExternal links\n*\n*"
    }
  ]
}