{
  "content": [
    {
      "type": "text",
      "text": "# Republican Party of Puerto Rico\n\n| name             = Republican Party of Puerto Rico\n| native_name      = Partido Republicano de Puerto Rico\n| logo             = Republican Party of Puerto Rico logo.png\n| chairperson      = Angel M. Cintrón\n| foundation       = 1899\n| dissolved        =\n| headquarters     = San Juan, Puerto Rico\n| ideology         = ConservatismPuerto Rican statehood\n| position         = Center-right to right-wing\n| national         = Republican Party}}\n| colors           = |border=darkgray}} Red\n| website          =\n| country          = Puerto Rico\n| footnotes        =\n}}\nThe Republican Party of Puerto Rico () is the local affiliate of the national United States Republican Party in Puerto Rico. The affiliation started in 1903. The party does not participate in the November elections mandated by the Constitution of Puerto Rico for local registered political parties because it is not a registered party in Puerto Rico for local electoral purposes. Instead, the party holds its own elections to select the Puerto Rico delegates to the Republican National Convention and holds presidential primaries on the last Sunday of February.\nThe Republican Party of Puerto Rico's ideology supports statehood for Puerto Rico.  The local affiliate is based in San Juan, Puerto Rico.\nHistory\nThe origin of the Republican Party of Puerto Rico can be traced to the aftermath of the Spanish–American War. Once the Spanish–American War came to an end in 1898, Puerto Rico became a territory of the United States. At that point, the former Spanish colonial-era parties that existed in Puerto Rico were forced to redefine themselves given the new political reality created by the change in sovereignty. On July 4, 1899, the dissenting wing of one of such parties, the Partido Autonomista (Autonomist Party), which had just formed Partido Autonomista Ortodoxo in 1897, founded a party with an ideology of annexation to the United States and called it Partido Republicano de Puerto Rico (Republican Party of Puerto Rico). This new party favored joining the United States as a federated state and was led by José Celso Barbosa. In 1903 the Republican Party of Puerto Rico affiliated itself with the U.S. Republican Party.\nIn 1924 Partido Republicano de Puerto Rico split into two factions: one faction joined with the Union Party to form the Alianza (The Alliance), a pro-autonomy group, and the other faction, renamed itself Partido Republicano Puro (Pure Republican Party) and joined with the Socialist Party to form the pro-statehood Coalición (The Coalition). The 1924 split brought Partido Republicano de Puerto Rico to an end, and Coalición became the de facto pro-statehood ideology.\nIdeology\nThe Republican Party of Puerto Rico believes in equal and full citizenship rights for U.S. citizens of Puerto Rico, and that this can only be achieved through statehood for Puerto Rico.\nRepublican presidential primaries 2016 results\n{| class=\"wikitable\"\n!Candidates\n!Recent positions\n!Logo\n!Island delegates\n!Popular vote\n!Senatorial districts\n|-\n|]]Donald Trump\n|Chairman of The Trump Organization\n(1971–2017)\n|\n|0\n|5,052 (13.1%)\n|None\n|-\n|]]Ted Cruz\n|U.S. Senator from Texas\n(2013–present)\n|\n|0\n|3,340 (8.6%)\n|None\n|-\n|]]Marco Rubio\n|U.S. Senator from Florida\n(2011–2025)\n|\n|20 Delegates\n|27,485 (71.0%)\n| All 8 districts\n|-\n|Other Candidates\n|\n|\n|0\n|1,356 total votes\n|None\n|-\n| colspan=\"6\" |Official Result by [http://presidenciales16.ceepur.org/ Puerto Rico's State Election Commission]\n|}\nSee also\n* Democratic Party (Puerto Rico)\n* Republican Party (United States)\n* Republican Party of Puerto Rico (1899)\nNotes\nReferences\nExternal links\n*[http://www.RepublicanPartyofPuertoRico.gop Republican Party of Puerto Rico]\n*[https://web.archive.org/web/20080327232705/http://www.statehoodpr.org/ Puerto Rico Statehood Student Association]"
    }
  ]
}