{
  "content": [
    {
      "type": "text",
      "text": "# Republic of Vietnam Military Forces\n\n}}\n| headquarters = Saigon, Central-South region of Vietnam\n| flying_hours =\n| website =\n| commander-in-chief =  Ngô Đình Diệm (1955&ndash;1963) Trần Thiện Khiêm (1964) Nguyễn Khánh (1964&ndash;1965) Trần Văn Minh (1965) Nguyễn Văn Thiệu (1965&ndash;1975)\n| commander-in-chief_title = Commander-in-Chief\n| chief minister =\n| chief minister_title = Prime Minister\n| minister =\n| minister_title = Minister of Defense\n| commander =  See list\n| commander_title = Chief of Joint General Staff\n| age =\n| conscription =\n| manpower_data =\n| manpower_age =\n| available =\n| available_f =\n| fit =\n| fit_f =\n| reaching =\n| reaching_f =\n| active = 586,838\n| ranked =\n| reserve =\n| deployed = 1,000,000 in 1972\n| amount =\n| percent_GDP =\n| domestic_suppliers =\n| foreign_suppliers =\n| imports =\n| exports =\n| history = Military history of Vietnam\n| ranks = Ranks and insignia of the Republic of Vietnam\n}}\nThe Republic of Vietnam Military Forces (RVNMF;  – QLVNCH) were the armed forces of the Republic of Vietnam and were responsible for the defence of the country from 8 December 1950 to 30 April 1975. Its predecessor, the Vietnamese National Army, was the armed forces of the State of Vietnam (formed in 1949), before it became a republic in 1955. The Republic of Vietnam Military Forces day has been celebrated in June 19 every years since 1965.\nBranches\nThe QLVNCH (also known as the RVNMF) was established on 26 October 1955 when the State of Vietnam became a republic after a rigged referendum. Created out from ex-French Union Army colonial Indochinese auxiliary units (French: Supplétifs), gathered earlier on 8 December 1950 into the Vietnamese National Army or VNA (Vietnamese: Quân Đội Quốc Gia Việt Nam – QĐQGVN), Armée Nationale Vietnamiènne (ANV) in French, when France and Vietnam signed an international treaty on 8 December 1950. The treaty was based on the Franco-Vietnamese Summit in Đà Lạt on November 5, the conference estimated that within five years, the Vietnamese armed forces would consist of 115,000 men, with military equipment and weapons provided by the United States. In the first phase, France would lend officers to Vietnam, and the costs would be covered by U.S. aid and the Vietnamese budget. Although Vietnam as the State of Vietnam gained independence from France in 1949, its army was still controlled by the French until Vietnam's full independence was recognized on 4 June 1954. The armed forces of the new state consisted in the mid-1950s of ground, air, and naval branches of service, respectively, the Republic of Vietnam Military Forces day is also celebrated (mostly by the overseas Vietnamese people) every years in 19 June\n* Army of the Republic of Vietnam (ARVN)\n* Republic of Vietnam Air Force (VNAF)\n* Republic of Vietnam Navy including Marine Corps\nTheir roles were defined as follows: to protect the sovereignty of the Vietnamese nation and that of the Republic; to maintain the political and social order and the rule of law; to defend the newly independent Republic of Vietnam from external (and internal) threats; and ultimately, to help reunify Vietnam – divided since the Geneva Accords in July 1954 into two transitional states, one at the north ruled by Ho Chi Minh’s Lao Dong Party regime and the other in the south under Ngô Đình Diệm's authoritarian regime.\nCommand structure\nRegional commands\nThe Republic of Vietnam Military Forces consisted of four military corps (Quân đoàn) as follows:\nI Corps headquartered in Da Nang, included five provinces:\nTactical zone 11, including 2 provinces Quang Tri and Thua Thien\nTactical zone 12, including 2 provinces Quang Tin and Quang Ngai\nQuang Nam Special Zone, including Quang Nam Province and Da Nang City\nII Corps headquartered in Nha Trang, but the 2nd Army Corps Command is located in Pleiku (had to move to Nha Trang from mid-March 1975), included 12 provinces:\nTactical Zone 22, including 3 provinces Binh Dinh, Phu Yen, Phu Bon\nTactical Zone 23, including 7 provinces Darlac, Khanh Hoa, Ninh Thuan, Binh Thuan, Tuyen Duc, Quang Duc, Lam Dong and Cam Ranh city\nSpecial area 24, including 2 provinces Kon Tum and Pleiku\nIII Corps headquartered in Bien Hoa, include 10 provinces:\nTactical Zone 31, including 3 provinces Tay Ninh, Hau Nghia, Long An\nTactical zone 32, including 3 provinces Phuoc Long, Binh Long, Binh Duong\nTactical Zone 33, including 4 provinces Binh Tuy, Phuoc Tuy, Long Khanh, Bien Hoa and Vung Tau city\nCapital Military District of Saigon - Gia Dinh\nIV Corps headquartered in Can Tho, included 16 provinces:\nDinh Tuong tactical zone, including 4 provinces Kien Tuong, Dinh Tuong, Go Cong, Kien Hoa\nTactical Zone 41, including 7 provinces Kien Phong, Chau Doc, Vinh Long, Vinh Binh, An Giang, Kien Giang, Sa Dec\nTactical Zone 42, including 5 provinces Phong Dinh, Chuong Thien, Ba Xuyen, Bac Lieu, An Xuyen\nOn July 1, 1970 the four Corps were redesignated as Corps Tactical Zones (CTZs).\nCriticism\nThe ARVN always had problems keeping men in the ranks, but during 1973–75, the problem reached epidemic proportions. During 1974, for example, only 65 percent of authorized manpower was present for duty at any time. The nation's officer corps still suffered from the promotion and retention of generals due to their political loyalties, not their professional abilities. Corruption and incompetence among officers was endemic, with some \"raising it almost to an art form.\"\nIn 1972, General Creighton Abrams fumed at ARVN complaints that they lacked arms and equipment. He said: “The ARVN haven’t lost their tanks because the enemy tanks knocked them out. The ARVN lost their tanks because goddamn it, they abandoned them. And, shit, if they had the Josef Stalin 3 [tank], it wouldn’t have been any better.” He likewise harangued President Nguyen Van Thieu and chief of staff General Cao Van Vien: “Equipment is not what you need. You need men that will fight... You’ve got all the equipment you need... You lost most of your artillery because it was abandoned.”\nLeadership\nFirst Republic (1955-1963)\nPresident - Supreme Commander-in-chief : Ngo Dinh Diem\nMinister of National Defense : Ngo Dinh Diem\nChief of the Joint General Staff :\n* Army general Lê Văn Tỵ (1955-1962)\n* Lieutenant general Trần Thiện Khiêm (1962-1963) (acting)\n* Major general Trần Văn Đôn (1963)\nMilitary junta (1963-1967)\nChief of State - Supreme Commander-in-chief :\n* Lieutenant general Dương Văn Minh (1963-1964) - Chairman of the Military Revolutionary Council\n* Lieutenant general Nguyễn Khánh (1964) - Chairman of the Military Revolutionary Council\n* Lieutenant general Dương Văn Minh (1964) - Chief of State\n* Phan Khắc Sửu (1964-1965) - Chief of State\n* Lieutenant general Nguyễn Văn Thiệu (1965-1967) - Chairman of National Leadership Committee\nCommander-in-chief\n* Army general Trần Thiện Khiêm (1964)\n* Army general Nguyễn Khánh (1964-1965)\n* Lieutenant general Trần Văn Minh (1965)\nMinister of National Defense :\n* Lieutenant general Trần Văn Đôn (1963-1964)\n* Army general Trần Thiện Khiêm (1964)\n* Army general Nguyễn Khánh (1964)\n* Prime Minister Trần Văn Hương (1964-1965)\n* Lieutenant general Trần Văn Minh (1965)\n* Lieutenant general Nguyễn Văn Thiệu (1965)\n* Lieutenant general Nguyễn Hữu Có (1965)\nChief of the Joint General Staff :\n* Lieutenant general Trần Văn Đôn (1963-1964)\n* Lieutenant general Lê Văn Kim (5-30 January 1964)\n* Lieutenant general Nguyễn Khánh (1964)\n* Lieutenant general Trần Thiện Khiêm (1964)\n* Lieutenant general Nguyễn Khánh (1964-1965)\n* Lieutenant general Trần Văn Minh (1965)\n* Lieutenant general Nguyễn Hữu Có (1965)\n* Army general Cao Văn Viên (1965-1967)\nSecond Republic (1967-1975)\nPresident - Supreme Commander-in-chief :\n* Nguyễn Văn Thiệu (1967-1975)\n* Trần Văn Hương (1975)\n* Dương Văn Minh (1975)\nMinister of National Defense :\n* Lieutenant general Nguyễn Hữu Có (1967)\n* Army general Cao Văn Viên (1967)\n* Lieutenant general Nguyễn Văn Vỹ (1967-1972)\n* Army general, Prime Minister Trần Thiện Khiêm (1972-1975)\n* Lieutenant general Trần Văn Đôn (1975)\nChief of the Joint General Staff :\n* Army general Cao Văn Viên (1967-1975)\n* Lieutenant general  (27-28 April 1975)\n* Lieutenant general Vĩnh Lộc (28- morning 30 April 1975)\n* Brigadier general Nguyễn Hữu Hạnh (30 April 1975)\nNotable commanders\nArmy\n* Trần Văn Đôn\n* Lê Văn Tỵ\n* Nguyễn Phước Vĩnh Lộc\n* Phạm Văn Phú\n* Nguyễn Khoa Nam\n* Lê Văn Hưng\n* Lê Nguyên Vỹ\n* Nguyễn Văn Thiệu\n* Đỗ Mậu\n* Dương Văn Minh\n* Lê Minh Đảo\n* Ngô Quang Trưởng\n* Cao Văn Viên\n* Trần Thiện Khiêm\n* Trần Văn Minh\n* Đỗ Cao Trí\n* Phạm Xuân Chiểu\n* Tôn Thất Đính\n* Lê Văn Kim\n* Nguyễn Hữu Có\n* Nguyễn Chánh Thi\n* Lê Nguyên Khang\n* Hoàng Xuân Lãm\n* Nguyễn Văn Vy\n* Ngô Du\n* Dư Quốc Đống\n* Nguyễn Viết Thanh\n* Nguyễn Văn Minh\n* Nguyễn Văn Hiếu\n* Huỳnh Văn Cao\n* Phạm Văn Đổng\n* Trần Văn Hai\n* Nguyễn Ngọc Loan\n* Trần Quang Khôi\n* Nguyễn Hữu Hạnh\n* Đặng Văn Quang\n* Lữ Mộng Lan\nAir Force\n* Nguyễn Cao Kỳ\n* Trần Văn Minh\n* Nguyễn Xuân Vinh\n*\n* Nguyễn Ngọc Loan\n* Nguyễn Khánh\nNavy\n* Lâm Ngươn Tánh\n* Chung Tấn Cang\n* Trần Văn Chơn\n* Cao Văn Viên\n*\n* Hoàng Cơ Minh\n* Hồ Tấn Quyền\nMarine Division\n* Lê Nguyên Khang\nAirbone Division\n* Đỗ Cao Trí\n* Nguyễn Văn Vy\n* Nguyễn Chánh Thi\n*\n*\nRangers\n* Phan Xuân Nhuận\n* Tôn Thất Xứng\n* Đỗ Kế Giai\n* Trần Văn Hai\nPresidential Guard\n*\n* Lê Quang Tung\n* Tôn Thất Đính\n*\nSpecial Forces\n*\n* Phạm Văn Phú\n* Lê Quang Tung\nSee also\n* Cambodian Civil War\n* First Indochina War\n* Khmer National Armed Forces\n* Laotian Civil War\n* Royal Lao Armed Forces\n* Royal Thai Armed Forces\n* Republic of Vietnam National Police\n* Republic of Vietnam Marine Division\n* Provincial Reconnaissance Unit\n*South Vietnamese military ranks and insignia\n* People's Army of Vietnam\n* Vietnamese National Army\n* Vietnam War\n* Weapons of the Vietnam War\nNotes\nReferences\n*Gordon L. Rottman and Ron Volstad, US Army Special Forces 1952-84, Elite series 4, Osprey Publishing Ltd, London 1985.\n*Gordon L. Rottman and Ron Volstad, Vietnam Airborne, Elite Series 29, Osprey Publishing Ltd, London 1990.\n*Gordon L. Rottman and Ramiro Bujeiro, Army of the Republic of Vietnam 1955-75, Men-at-arms series 458, Osprey Publishing Ltd, Oxford 2010.\n*Kenneth Conboy and Simon McCouaig, South-East Asian Special Forces, Elite series 33, Osprey Publishing Ltd, London 1991.\n*Lee E. Russell and Mike Chappell, Armies of the Vietnam War (2), Men-at-arms series 143, Osprey Publishing Ltd, London 1983. .\n*  }}\n*Leroy Thompson, Michael Chappell, Malcolm McGregor and Ken MacSwan, Uniforms of the Indo-China and Vietnam Wars, Blandford Press, London 1984.\n*Martin Windrow and Mike Chappell, The French Indochina War 1946-54, Men-at-arms series 322, Osprey Publishing Ltd, Oxford 1998.\n*Phillip Katcher and Mike Chappell, Armies of the Vietnam War 1962-1975, Men-at-arms series 104, Osprey Publishing Ltd, London 1980.\nFurther reading\n*Jade Ngoc Quang Huynh, South Wind Changing, Graywolf Press, Minnesota 1994.\n*Mark Moyar, Triumph Forsaken: The Vietnam War, 1954-1965, Cambridge University Press, Cambridge, U.K. 2009. , 0521757630\n*Neil L. Jamieson, Understanding Vietnam, The Regents of the University of California press, Berkeley and Los Angeles, California 1995.\n*Nguyen Cao Ky, How we lost the Vietnam War, Stein & Day Pub 1979. , 0812860160\n*Tran Van Don, Our Endless War: Inside Vietnam, Presidio Press, Novato, California 1978. , 0891410198"
    }
  ]
}