{
  "content": [
    {
      "type": "text",
      "text": "# Republican Palace Museum\n\n| years_built      =\n| completion_date  =\n| opened_date      =\n| inauguration_date =\n| owner            =\n| floor_area       =\n| map_caption      = Location of the Republican Palace Museum in Khartoum, Sudan\n| building_type    = Museum\n| architectural_style = Byzantine architecture\n| logo             =\n| logo_size        =\n| logo_caption     =\n| grounds_area     =\n| facilities       =\n| website          =\n}}\nThe Republican Palace Museum () is an important museum in Khartoum, Sudan, and contains historical collections dating back to Turco-Egyptian Sudan. The museum is part of the Republican Palace complex, the seat of government in Sudan during successive periods of modern Sudan's history. The museum was a cathedral that was opened in 1912 and closed in 1971 to be repurposed and opened to the public as a museum on 31 December 1999.\nLocation\nThe museum building is located in Khartoum, on the southeastern side of the Old Republican Palace building and southeast of the New Republican Palace. The building overlooks University Street opposite the buildings of the Ministry of Foreign Trade, and the ''Martyrs' Gardens''.\nThe total area of the museum is 7160 square metres. The museum's main hall building is 853 square meters in area, with a length of 50.3 meters and a width of 13.8 metres. The building's height is 13 metres from the outside, and 10.3 metres on the inside.\nThe Republican Palace Museum took its name from the Republican Palace because most of its holdings and exhibits belong to the Republican Palace, and its location within the walls of the palace and its subordination to the palace in terms of management and supervision as it is part of the Republican Palace. The museum was opened on 31 December 1999, and it is one of three parts of the complex that is open to the public, including the Library and Mosque.\nOpening hours\nThe museum is open to the public on Sundays, Wednesdays and Fridays of each week in two periods. The morning period runs from nine o’clock local time in Khartoum until one o’clock in the afternoon, and the evening period runs from four o’clock in the afternoon until eight o’clock in the evening.\nHistory\nThe museum building itself is a historical monument. It was once an Anglican Cathedral. The ''All Saints' Cathedral was commissioned by the British governor-general Reginald Wingate and completed in 1912. The Cathedral, which has a Byzantine architectural style and which includes its exhibits, was also inaugurated in 1912.\nMabel Esplin completed seven stained glass windows for the Cathedral. In 1911, she was commissioned to design seven lancet windows and in 1912, lancet windows for the north wall of the north transept, which depicted St Alban, St Edmund, St Theodore and St Sebastian. She also completed in that year a three-light window for the Gordon Memorial Chapel with the theme \"Hope, Faith and Charity\". 1914 saw her complete a circular West window for the South Transept, a circular East window depicting \"Death and Resurrection\", and another three-light window in the Gordon Memorial Chapel with the theme \"Fortitude, Justice and Wisdom\". In one window and in an attempt to introduce local colour, the figure of Balthazar was portrayed in the costume of a Sudanese Sheikh. Due to her ill health, Esplin was unable to complete the project and the illustration of the remaining windows was executed by Joan Fulleylove, who had earlier worked as Esplin's assistant,). Church Stained Glass Windows. Retrieved 14 August 2012|group=nb}} and who also designed a three-light window for St Mary's Church in Fulham.\nFile:Stained Glass in the Republican Palace Museum, Khartoum, Sudan - Saint Alban.jpg|St Alban stained glass\nFile:Stained Glass in the Republican Palace Museum, Khartoum, Sudan - Saint Edmund.jpg|St Edmund stained glass\nFile:Stained Glass in the Republican Palace Museum, Khartoum, Sudan - Saint Sebastian.jpg|St Sebastian stained glass\nFile:Stained Glass in the Republican Palace Museum, Khartoum, Sudan.jpg|St Theodore stained glass\nIt remained in service until it was closed for security reasons in 1971, and an alternative church was built for in Al-Amarat. The building remained unused until the cathedral's bell tower was removed in October 1996 and then the cathedral was converted into its present purpose as a museum in 1997. The museum was opened on the night of 31 December 1999 by President Omar Hassan Ahmed Al-Bashir.\nFunctionality\nThe museum's primary purpose is to preserve Sudan's historical symbols of governance, sovereignty, and the national movement. It adopts a scientific approach to safeguard a significant part of Sudan's national heritage, ensuring its accessibility to interested individuals and visitors. Furthermore, the museum documents the evolution of Sudan's government system in modern times, serving as an educational resource for students, researchers, and museum-goers.\nIn addition to its preservation efforts, the museum actively contributes to cultural activities by hosting lectures, seminars, and participating in national and international exhibitions. It promotes tourism in Sudan and acts as a custodian of archaeological artefacts, historical buildings, and documents associated with the Presidency of the Republic. These items are meticulously documented and presented scholarly, underscoring the Presidency's commitment to their preservation and availability for researchers, scholars, students, interested individuals, delegations, and tourists.\nMoreover, the museum facilitates communication between the Presidency of the Republic and various segments of society, shedding light on significant historical events linked to the Presidency's headquarters in Sudan. It documents governance and administration systems, successive presidents and governments, and the historical trajectory of the national movement against colonialism in modern Sudanese history. Ultimately, the museum aligns with the state's policy on patriotic education, aiming to foster national loyalty, introduce state symbols, and highlight Sudan's achievements and triumphs as a nation.\nCultural and social activities\nThe museum serves as a venue for various activities related to the Presidency of the Republic, such as hosting programs during summits, conferences, and official visits. It also takes on the responsibility of organising and conducting temporary exhibitions that align with national occasions and celebrations. Moreover, the museum actively participates in domestic and international exhibitions, showcasing its collections and contributing to cultural exchange. The museum also offers accompanying programmes and cultural activities specifically designed for educational institutions and civil society organisations. These events aim to provide an enriching experience for visitors and promote engagement with Sudan's history and heritage. Furthermore, the museum plays a role in knowledge dissemination by organising and hosting lectures and seminars on relevant topics of interest.\nEducational activities\nThe museum actively promotes national education by implementing educational programs that introduce the symbols of the state to school children. These programs aim to instil a sense of national identity and pride among the younger generation. Additionally, the museum conducts documentary lectures that delve into the governance and administration of Sudan, highlighting the significant historical events associated with the presidency of the Republic of Sudan. These lectures also cover the regulations and etiquette of ceremonial activities, providing valuable insights into the protocols and customs of the state.\nIn line with its mission to preserve Sudan's heritage, the museum offers educational programs that raise awareness about the importance of museums, antiquities, and archaeological work. These programs educate visitors on the significance of preserving cultural artefacts and guide best practices for their protection. Furthermore, the museum supports the development of artistic skills by establishing a dedicated studio for young children and students to practise art and design. This initiative aims to nurture creativity and artistic expression among the younger generation, fostering a deeper appreciation for the arts and culture.\nDepartments\nThe museum's exhibits aim to shed light on Sudanese history, albeit with some information selectively and inconsistently presented. Visitors can explore the historical and cultural significance of the Republican Palace and gain a deeper understanding of Sudan's political and social development. Apart from its permanent displays, the museum hosts temporary exhibitions, particularly during national occasions and celebrations, to further engage visitors with Sudan's rich heritage. Additionally, the museum actively participates in internal and external exhibitions, showcasing Sudanese culture to a broader audience.\nAutomobile suite\nA pavilion outside the building displays the old presidential cars that were used by the former rulers of Sudan during the periods of the Anglo-Egyptian Sudan from 1889 to 1956, and the former presidents in the periods after the independence of Sudan in 1956. Among its exhibits is a Rolls-Royce car presented by the King of Egypt in 1924 as a gift to Sir Robert Howe, Governor-General of British Sudan at the time, and another car of the same model that was presented as a gift to President Nimeiri in 1984. It is a car with high specifications and consists of a bulletproof body.\nThere are also displays of the Humber cars of the former governors-general of Sudan from the period from 1940 to 1956, and a 1954 Rolls-Royce car, which was used by the last British Governor-General of Sudan, Knox Helm, and subsequently used by members of the Sudanese Sovereignty Council when Sudan gained its independence in 1956. The car was also used to transport visitors to Sudan, including government leaders and heads of foreign countries, including Egyptian President Gamal Abdel Nasser, who visited Sudan in November 1959.\nPhotographs and paintings suite\nIt includes oil paintings and photographs of rulers and presidents of Sudan and heads of state who visited, before and after independence, including a painting of king Fuad of Egypt, another of King Farouk of Egypt in the period from 1939 to 1952, and a painting of Lord Allenby, the British High Commissioner to Egypt. There are also paintings and photographs of Sudanese presidents, including Ismail al-Azhari, Ibrahim Abboud, Jaafar Nimeiri, Abdel Rahman Swar al-Dahab, and Sudanese heads of government, including Muhammad Ahmed Al-Mahjoub, Sir Al-Khatim Al-Khalifa, and Al-Jazouli Daffallah.\nHonours suite\nThis includes an exhibition of various medals and necklaces used in Sudan, including the Order of the Two Niles, one of the highest Sudanese decorations.\nGift suite\nThe presidential gifts that the presidents of Sudan received after independence are displayed here in all their forms and types, including a huge jug presented by former Pakistani President Bhutto to President Nimeiri during his visit to Sudan.\nSuite of musical instruments, utensils, and furniture\nThis is a suite that contains a number of various musical instruments, pieces of utensils, dishes, and furniture used inside the Republican Palace in previous eras, including presidential tables made of wood. It is decorated with copper ornaments and was placed for display in the museum's great hall. There is also the wooden seat on which President Ismail Al-Azhari was sitting, and a rectangular table used at the inauguration of the first Consultative Council of Sudan in 1946. Also seen in the suite is a piano that was played by General Charles Gordon, the governor-general of Sudan, who was killed by the Mahdist in 1884, and a huge electric piano brought to the palace by the Governor-General of Sudan in 1916.\nDocumentation suite\nThis is a pavilion aimed at presenting a historical presentation of the period of the national struggle to achieve the independence of Sudan.\nDecoration suite\nThis contains the decorations and memorial pieces of the museum.\nWeapons suite\nThe suite hosts a mix of guns and swords used during the Turkish Sudan, the Mahdist uprising, and the Anglo-Egyptian conquest of Sudan.\nLibrary\nThere is a public library attached to the museum. However, the palace received many books and literature, especially during the dual rule of 1898. There was no library for preserving books or classifying them, which were deposited in the ceremonial department in the palace. In 1976, it was decided to collect the books in the palace and keep them in a library for which a room was allocated in the palace's main building. The library had collections of books and various references in 1988 and 2006. The library was moved to the southeastern part of the palace building to make room for the vice president's office. A reading hall was added to serve its visitors, and an archive made up of two halls, one for storing documents and the other for display. The library is open to the public.\nSee also\n* List of museums in Sudan\nNotes\nReferences\nExternal links\n*"
    }
  ]
}