{
  "content": [
    {
      "type": "text",
      "text": "# Republican Party of the Virgin Islands\n\n| headquarters     = P.O. Box 9901 St. Thomas, VI 00801\n| chairman         = John Yob\n| foundation       = 1948\n| ideology         = Conservatism\n| national         = Republican Party\n| colorcode        =\n| colors           = Red\n| leader1_title    = National Committeewoman\n| leader1_name     = April Newland\n| leader2_title    = National Committeeman\n| leader2_name     = Johann A. Clendenin\n| seats1_title     = Legislature of the Virgin Islands\n| seats1           = }}\n| seats3_title     = U.S. House of Representatives\n| seats3           = }}\n| state            = the United States\n| symbol           =\n}}\nThe Republican Party in the Virgin Islands is a political party in the U.S. Virgin Islands, and is affiliated with the Republican Party at the national level.\nJohn Canegata was the party chairman until the 2020 Republican National Convention at which the Republican National Committee removed him as chairman for violations of party rules. He was replaced by Gordon Ackley, who served as chairman from 2022 until resigning in 2024. John Yob was elected to fill the vacancy in May 2024.\nJohann A. Clendenin serves on the Republican National Committee as national committeeman.\nThe party has a small influence in the islands, failing to be competitive in gubernatorial elections for over three decades.\nHistory\nFounded in 1948 as a committee under the leadership of Roy Gordon, it was the successor to the Republican Club of the Virgin Islands founded by Adolph Achille Gereau in 1924.\nMelvin H. Evans, who was the territory's first elected governor, was a Republican. He later served in Congress.\nFormer Governor Kenneth Mapp had been a Republican member of the Virgin Islands Legislature, but was elected to the territorial governorship as an independent. Previously the lieutenant governor, he was the Republican nominee for Congress in 1996.\nRepublican National Convention\nUnder national Republican Party rules, the Virgin Islands sends nine delegates to the Republican National Convention.\nElectoral performance (2010–present)\n{| class=\"wikitable plainrowheaders\"\n! Year\n! Gubernatorial vote\n! House vote\n! Legislative seats\n|-\n| 2024\n| No election held\n| 3rd (1,348) }}\n| }}\n|-\n| 2022\n| No candidate\n| No candidate\n| No candidates\n|-\n| 2020\n| No election held\n| No candidate\n| }}\n|-\n| 2018\n| No candidate\n|  No candidate\n| }}\n|-\n| 2016\n| No election held\n|  No candidate\n| }}\n|-\n| 2014\n| No candidate\n| 2nd (1,964) }}\n| }}\n|-\n| 2012\n| No election held\n| 2nd (2,131) }}\n| }}\n|-\n| 2010\n| No candidate\n| 2nd (2,223) }}\n| No candidates\n|}\nSee also\n* Politics of the United States Virgin Islands\n* Republican Party presidential debates, 2012\n* Republican Party presidential primaries, 2012\n* Results of the 2012 Republican Party presidential primaries\nNotes\nReferences\nExternal links\n*[http://www.usvigop.org Republican Party of the United States Virgin Islands]"
    }
  ]
}