{
  "content": [
    {
      "type": "text",
      "text": "# Republic of Slowjamastan\n\n| claimed_by = Randy Williams (as Sultan)\n| established = December 1, 2021\n| location = Imperial County, Southern California, United States\n| area_sq_mi = 0.01729\n| official_website =\n|name=Slowjamastan|leader_name1=Randy Williams|anthem=Slowjamastan (I Think It’s Gonna Be an Awesome Place)}}\nThe Republic of Slowjamastan is a micronation located within Imperial County, Southern California, United States. Founded on December 1, 2021, by slow jam DJ Randy Williams, Slowjamastan is located on an empty plot of desert land along State Route 78. A micronation is a political entity that claims independence and mimics acts of sovereignty as if it were a sovereign state, but lacks any legal recognition.\nAlthough Slowjamastan has no structures, located on the plot of land is a large border sign by the highway, a border control post and an open desk that serves as the Williams' office—the self-proclaimed sultan of the micronation. He founded Slowjamastan following a visit to Molossia, another micronation located in Dayton, Nevada, in August 2021, and purchased the plot of land in October for US$19,000.\nLocation\nThe Republic of Slowjamastan is located on an empty,  plot of desert land in Imperial County, Southern California. It follows California State Route 78, and is located between Ocotillo Wells in San Diego County and Westmorland,  southwest of the Salton Sea, about  from San Diego, and  north of the US–Mexico border. Although Slowjamastan has no structures, on the plot of land is a large border sign by the highway, a border control post and an open desk in Dublândia—the purported capital of Slowjamastan—that serves as the sultan's office. There are plans for expanding the territory. As of February 2025, it is not inhabited.\nHistory\n, the founder and self-proclaimed Sultan of Slowjamastan]]\nSlowjamastan was declared independent on December 1, 2021, by slow jam DJ Randy Williams, also known by his stage name R Dub!, who presents the Sunday Night Slow Jams radio show. Williams, who had visited all United Nations member states except for Turkmenistan, became inspired to create a micronation after visiting the Republic of Molossia—a micronation located in Dayton, Nevada—in August 2021. When Williams returned to his residence in San Diego, he immediately began working on plans for his own micronation and in October 2021 purchased the land.\nA micronation is a political entity that claims independence and mimics acts of sovereignty as if it were a sovereign state, but lacks any legal recognition. Micronations are classified separately from states with limited recognition or quasi-states, as they lack the legal basis in international law for their existence. However, Williams bases Slowjamastan's legitimacy on meeting the criteria of the Montevideo Convention.\nPlans envisioned by Williams for tourist attractions in Slowjamastan include a bowling alley, interactive armadillo farm, hot dog emporium, restaurant and a lazy river, pending the configuration of a working water system in the desert. Upon declaring independence, Williams sent postcards to nearby residents and businesses. While local business owners declared the idea of Slowjamastan as bizarre and eccentric, they were open to the project possibly bringing tourists and increased attention to the area.\nSlowjamastan was represented at MicroCon 2022 held in Las Vegas, MicroCon 2023 held in Joliet, Illinois and at MicroCon EU 2023 held in Ypres, Belgium.\nIn 2024, Williams represented Slowjamastan as a guest at the 2024 NATO summit in Washington, D.C. in the United States.\nGovernance and citizenship\nSlowjamastan is run by Williams, who ostensibly rules as the sultan of the micronation. He asserts that Slowjamastan is both a dictatorship and \"occasional democracy\" as he allows input from citizens. Slowjamastan also has a virtual parliament. The laws of Slowjamastan are based on the \"everyday annoyances\" experienced by Williams while growing up in the United States. Some prohibitions include Crocs, mumble rap, people who put their feet up on the dashboard, and eating string cheese by biting directly into it. Slowjamastan prints banknotes of its own currency called the duble and issues passports with quotations on them from hip hop artists. People can apply for citizenship and cabinet positions online via Slowjamastan's website. As of July 2024, the number of citizens was more than 19,000. Citizens of Slowjamastan are known as Slowjamastanis.\nNotes\nReferences\nPrimary\nSecondary\nExternal links\n*\n* [https://micronations.wiki/wiki/Republic_of_Slowjamastan Republic of Slowjamastan] at MicroWiki"
    }
  ]
}