{
  "content": [
    {
      "type": "text",
      "text": "# Republic Square, Yerevan\n\n| marker_image            =\n| image                   = File:Հանրապետության Հրապարակ.jpg\n| image_size              = 300px\n| image_alt               =\n| image_map               =\n| caption                 = The History Museum and the National Gallery (left) and the Government House (right) in Republic Square as seen at night, 2013\n| map_type                =\n| latitude                =\n| longitude               =\n| map_size                =\n| map_caption             =\n| map_alt                 =\n| other_name              =\n| former_names            = Lenin Square (1940–1990)\n| part_of                 =\n| namesake                =\n| type                    =\n| owner                   =\n| maint                   = Yerevan Municipality\n| length                  =\n| length_m                =\n| length_ft               =\n| length_km               =\n| length_mi               =\n| length_ref              =\n| length_notes            =\n| width                   =\n| area                    =\n| addresses               =\n| location                = Kentron, Yerevan, Armenia\n| postal_code             =\n| metro                   = Republic Square\n| coordinates             =\n| direction_a             =\n| terminus_a              =\n| direction_b             =\n| terminus_b              =\n| junction                =\n| cost                    =\n| references              =\n| construction_start_date = 1926\n| completion_date         = 1977\n| demolition_date         =\n| designer                = Alexander Tamanian (square design); surrounding buildings: Alexander Tamanian, Gevorg Tamanian, Mark Grigorian, Eduard Sarapian, Rafayel Israyelian, Samvel Safarian, Varazdat Arevshatian\n| known_for               =\n| status                  =\n| website                 =\n}}\nRepublic Square (, Hanrapetut′yan hraparak, known locally as Hraparak , \"the square\") is the central town square in Yerevan, the capital of Armenia. It consists of two sections: an oval roundabout and a trapezoid-shaped section which contains a pool with musical fountains. The square is surrounded by five major buildings built in pink and yellow tuff in the neoclassical style with extensive use of Armenian motifs. This architectural ensemble includes the Government House, the History Museum and the National Gallery, Armenia Marriott Hotel and two buildings that formerly housed the ministries of Foreign Affairs and Transport and Communications. The square was originally designed by Alexander Tamanian in 1924. The construction of most of the buildings was completed by the 1950s; the last building—the National Gallery—was completed in 1977.\nDuring the Soviet period it was called Lenin Square and a statue of Vladimir Lenin stood at the square. Soviet parades and celebrations were held twice (originally thrice) a year until 1988. After Armenia's independence, Lenin's statue was removed and the square was renamed. It has been described as Yerevan's \"architectural highlight\" and the city's \"most outstanding architectural ensemble\". As Armenia's and the city's \"most important civic space\", Republic Square was the main site of demonstrations during the 2018 Velvet Revolution.\nArchitecture\nRepublic Square consists of two sections: an oval roundabout with a stone pattern in its center designed to look like a traditional Armenian rug, and a trapezoid-shaped section containing the musical fountain, in front of the History Museum and the National Gallery. The buildings around the square are made of pink and yellow tuff stones, fortified on a basalt-made base.\nIts architecture has been well acclaimed. Leonid Volynsky opined in 1963 that any capital could be proud of such a square, with its \"integrity and magnitude, its cheerful resonance, its uniqueness.\" Travel writer Deirdre Holding suggested in 2014 that it is \"certainly one of the finest central squares created anywhere in the world during the 20th century.\"\nHistory\nIn 2003, when the square underwent renovation, extensive excavations took place and an archaeological layer of the 18th-19th centuries was unearthed, consisting of cellars and basements. Tuff water pipes, dated to the 9th-11th centuries, were also excavated at the square. In January 2020, the Armenian government considered uncovering the older layers and turning it into a museum accessible to the public.\nThe pre-Soviet square was designed by Boris Mehrabyan (Megrabov) in his 1906-11 general plan of Yerevan. The current square was designed by Alexander Tamanian within his 1924 general plan of Yerevan. The area was gradually cleared of buildings. The construction of the square started in 1926, when the construction of the Government House began. It was developed until the 1950s when the rest of the five buildings were constructed and finally completed in 1977, when the National Gallery was built. The square was named Lenin Square (, Lenini hraparak; , ploshchad’ Lenina) for Soviet leader Vladimir Lenin, whose statue was erected in the square in 1940 and dismantled in 1991.\nOn 25 August 1990, the flag of Soviet Armenia was lowered and that of independent Armenia was raised on the Government House in the square. On 1 November 1990, the Yerevan City Council voted to rename Lenin Square to Republic Square.\nIn 2013, the municipal authorities proposed a controversial renovation of the square, which architects criticized.\nSurrounding buildings\n{| class=\"wikitable\"\n! Image\n! History and use\n|-\n| colspan=\"2\" align=center  | Government House #1\n|-\n|\n| The building is home to the Government of Armenia. It originally housed the People's Commissariat (the executive of Soviet Armenia). The north-western portion, built in 1926–29, was designed by Alexander Tamanian. The construction of the rest of the building was taken up by Gevorg Tamanian, Alexander's son, in 1938 and was completed in 1941.\n|-\n| colspan=\"2\" align=center  | Museums Building\n|-\n|\n| The building houses the History Museum of Armenia and the National Gallery of Armenia. Construction began in the 1950s with the National Gallery building being completed in 1977. It was designed by Mark Grigorian and Eduard Sarapian. A small portion of the ensemble, the Arno Babajanyan Concert Hall, dates back to 1916.\n|-\n| colspan=\"2\" align=center  | Armenia Marriott Hotel\n|-\n|\n| It was completed in 1958 according to the design of Mark Grigorian and Eduard Sarapian. The hotel was called Armenia during the Soviet period. A luxury hotel, it is considered the flagship hotel of Armenia. It has 380 rooms.\n|-\n| colspan=\"2\" align=center  | Government House #2\n|-\n|\n|  The building was designed by Samvel Safaryan, Rafayel Israyelian, Varazdat Arevshatyan and was completed in 1955. The friezes above first-floor windows are incomplete. The building housed the Ministry of Foreign Affairs between 1996 and 2016. In 2013 the Armenian government sold the building for over $51 million to a company owned by Argentine businessman Eduardo Eurnekian. It has been effectively abandoned since the mid-2010s.\n|-\n| colspan=\"2\" align=center  | Trade Unions and Communications Building\n|-\n|\n| Built in 1933–56, it was designed by Mark Grigorian and Eduard Sarapian. The building housed the Ministry of Transport and Communications until 2016. The Armenian government announced its intention to privatize the building in 2016, but has failed to do so so far.\n|-\n|}\nLenin monument\nMark Grigorian noted that Tamanian originally intended to include a monument to Soviet leader Vladimir Lenin in his plans for Yerevan's central square. However, Tamanian's idea was not realized until after his death, when Anastas Mikoyan urged the Soviet Armenian leadership to \"actively pursue the matter.\" The  copper statue of Lenin, sculpted by Sergey Merkurov, was inaugurated in the square on November 24, 1940, standing atop an  high granite pedestal. It faced the site of the planned National Gallery and \"soon gained considerable acclaim as a great piece of monumental art.\" The pedestal was designed by Natalia Paremuzova and Levon Vartanov.\nOn March 28, 1991, the Yerevan City Council voted to remove Lenin's statue. Mayor Hambardzum Galstyan abstained and argued in favor of a more nuanced and tolerant stance. It was removed on April 13, 1991. The statue was \"placed on a truck and, like the body of a deceased person, driven round and round the central square as if in an open coffin\" while people cheered. Some people threw pebbles and coins at the statue. It was placed in the backyard of the Museums Building, where it remains as of 2023. The Armenian-American singer Cher was famously photographed with the headless statue of Lenin when she visited Armenia in April 1993.\nIn 1996 president Levon Ter-Petrosyan ordered the dismantling of the pedestal, causing significant controversy and a wave of protests from a wide range of groups and individuals who emphasized its fine aesthetics. Levon Abrahamian notes that the pedestal was a \"good piece of architecture\" and despite its Soviet symbolism, it was perceived by many as a work of \"national art.\" According to Abrahamian, \"The fight for preserving the pedestal proved to be much more ferocious than the discourse on removing Lenin from the square. Journalists, architects, artists, poets, well-known figures of culture wrote articles in newspapers in defense of the pedestal.\" The poet Silva Kaputikyan called its dismantling an \"act of vandalism.\" On July 31, 1996, some 50 members of the Armenian Communist Party temporarily stopped the dismantling when they broke through the barrier around the pedestal. During the presidential election campaign in September 1996, a stage was built at the place of the pedestal, where Ter-Petrosyan gave a speech.\nReplacements\nOn December 31, 2000, a  cross lit by light-bulbs was erected in the space left empty by Lenin's pedestal. This installation was completed on the eve of 2001, which was when the Armenian state and the Armenian Apostolic Church celebrated the 1700th anniversary of being a Christian nation. The cross was lit by 1700 symbolic lamps, and continued to be at the center of celebrations that took place throughout the year of commemoration. However, at the end of 2001, the period of celebration ended and the cross was quietly dismantled. Since it was a temporary fixture, there was little discussion preceding its erection, as well as after its dismantling. The placement of a cross on that spot was interpreted \"as the final victory of the Christian faith over the antichrist Lenin.\"\nIn February 2004 a billboard-sized television screen appeared in the empty space playing advertisements. It was removed in 2006.\nIn June 2019 the Yerevan municipality put up several karases (large clay wine amphorae) at the center of the lawn that has been grown in place of the statue.\n;Proposals\nTer-Ghazaryan writes that \"After the monument to Lenin was toppled, the balance of Republic Square was thrown off, and the empty space left where Lenin used to stand has been subject to various design proposals, but none has succeeded.\" Several competitions have been held to find a replacement. In the early 1990s, when the pedestal was still standing, several candidates were put forth to be placed on it, including Noah, king Argishti I, General Andranik and Armenia's first president Levon Ter-Petrosyan. One of the most common proposals is to move the statue of Sasuntsi Davit (David of Sasun) to the square. According to Ter-Ghazaryan the largely apolitical nature of this Armenian national hero of an epic novel would be a safe choice; however, she wrote in 2013 that the relocation of the monument from its current spot in front of Yerevan Railway Station \"seems unlikely.\" In 2019 human rights activist Avetik Ishkhanyan argued that Aram Manukian's statue should have been erected on Lenin's pedestal.\nOther landmarks\nFountains\nAfter years of non-operation, the musical fountains were renovated by the French company Aquatique Show International and cost around €1.4 million. They were opened in September 2007.\nChristmas tree\nA Christmas tree has been installed at the square every December since at least 1950. In 2020, a month after the 2020 Nagorno-Karabakh war ended, the Yerevan City Hall announced that no Christmas tree and other decorations will be installed at the square to honor the memory of the fallen soldiers.\nDrinking fountain\nThe drinking fountain (also known as pulpulak), located next to the museums' buildings, consists of seven fountains and is thus called Yot aghbyur (\"Seven springs\"). It was originally installed in 1965 and renovated in 2010.\nNotable events\nParades\nDuring the Soviet era, military and non-military parades were held in the square on May 1 (the International Workers' Day), May 9 (Victory Day, until 1969) and November 7 (October Revolution Day). The leadership of Soviet Armenia stood at the podium, below the Lenin monument. During Jubilee parades celebrating the anniversaries of the foundation of Soviet Armenia (1961, 1970, 1980), a wooden extension was added to the podium, in order to accommodate all the guests from the national government. The last of these parades were held in 1988.\nMilitary parades celebrating the independence of Armenia have been held on September 21 of 1996 (5th anniversary), 1999 (8th anniversary), 2006 (15th anniversary), 2011 (20th anniversary), 2016 (25th anniversary). Smaller military parades were also held at the square during the First Karabakh War, on May 28 of 1992 and 1993. No parade was held in 2021, 30th anniversary of independence, in the aftermath of the Second Nagorno-Karabakh War. In 2025, a parade by military bands and demonstrations by the Honor Guard company was held.\nConcerts\n*On September 30, 2006 French-Armenian singer Charles Aznavour performed at the square in celebration of Armenia's 15th anniversary. Presidents Robert Kocharyan and Jacques Chirac were in attendance.\n*On April 23, 2015, the Armenian-American metal band System of a Down gave their first-ever concert in Armenia in Republic Square. The free concert was dedicated to the 100th anniversary of the Armenian Genocide and was attended by thousands.\n*On June 8, 2017, Russian hip-hop artist Timati gave a free concert in the square, which was attended by more than 40,000 people.\n*On October 6, 2019, the Dutch DJ Armin van Buuren performed at the square as an opening act of the World Congress on Information Technology (WCIT).\n*On September 30 and 31, 2021 following Hayko's death, his songs were played on loudspeakers at the square.\n*Tata Simonyan performed on October 12, 2025 during Erebuni-Yerevan, when the city's foundation is celebrated.\nPolitical demonstrations\nSoviet period\nOn April 24, 1965, large demonstrations took place in the square and elsewhere in Yerevan to commemorate the 50th anniversary of the Armenian genocide.\nOn the evening of January 20, 1974, on the eve of the 50th anniversary of Lenin's death, two dissidents and members of the underground National United Party,  and Smbat Avagyan, burned the large portrait of Lenin hanging from the arch of the History Museum in protest of Soviet rule. Zohrabyan was arrested and sentenced to seven years of imprisonment and three years of exile. Avagyan managed to escape, and another dissident, , instead confessed to being Zohrabyan's accomplice to protect Avagyan.\nIndependent Armenia\nFollowing the 2008 presidential election president-elect Serzh Sargsyan held a rally of around 60,000 to 70,000 \"would-be supporters\" who were brought from different parts of Yerevan and Armenia in buses. Many of them headed towards Freedom Square where a competing rally was being held by official runner-up Levon Ter-Petrosyan. In March, following the violent crackdown of opposition demonstrations, the square was occupied for some time by the Armed Forces of Armenia.\nOn May 4, 2012, at a Republican Party rally and concert at Republic Square during the parliamentary election campaign, dozens of balloons filled with hydrogen exploded, resulting in the injury of at least 144 people.\nFrom April 17 to 23, 2018 large demonstrations took place at Republic Square led by Nikol Pashinyan against the rule of Serzh Sargsyan. On April 22, when opposition leader Pashinyan was arrested, police forces were deployed in the square. Dozens of protesters were detained from the square. By the evening, some 115,000 protesters filled the entire square and the nearby streets. The next day, on April 23, after Sargsyan resigned, it became the center of mass celebrations. On April 24, the Armenian Genocide Remembrance Day, dozens of protests came together to clean the square and its adjacent street. More rallies took place at the square on May 1 and 8. On May 8, when he was elected prime minister, Pashinyan delivered a speech to his supporters at the square. On August 17, 2018, Pashinyan held a rally to celebrate his first 100 days in office. Up to 150,000 attended the rally.\nOn December 22, 2020, a month after the end of the 2020 Nagorno-Karabakh war, a coalition of more than a dozen opposition parties held a rally at the square calling for Pashinyan's resignation. On March 1, 2021 a few days after calls by the military to resign, Pashinyan held a rally with his 20,000 supporters at the square. In the run up to the June 20, 2021 parliamentary election, both Pashinyan (Civil Contract) and his chief rival Robert Kocharyan (leader of Armenia Alliance) held rallies at the square, drawing more than 20,000 and 30,000 supporters, respectively.\nOther events\nIn 1968 the celebration of Yerevan's 2750th anniversary were staged on the square with extravagant celebrations.\nOn June 25, 2016 Pope Francis and Karekin II held an ecumenical prayer at Republic Square. It was attended by some 50,000 people.\nReferences\n}}\nBibliography\n*\n*\n*\n* |isbn=978-0253073556}}\n*\n*\nExternal links\n*[https://360.aua.am/explore-armenia/republic-square/ 360 degree view of the Republic Square]\n*[http://www.myyerevan.am/cameras/republic-square-online.html Republic Square WebCam]"
    }
  ]
}