{
  "content": [
    {
      "type": "text",
      "text": "# Republic of Negros\n\n| p1                     = Spanish East Indies\n| flag_p1                = Flag of Spain (1785-1873 and 1875-1931).svg\n| p2                     = Federal State of the Visayas\n| flag_p2                =\n| s1                     = Federal State of the Visayas\n| flag_s1                =\n| s3                     = Military Government of the Philippine Islands\n| flag_s3                = US flag 45 stars.svg\n| image_flag             = Flag of the Negros Republic.svg\n| flag_type              =\n| image_map              = Atlas of the Philippine Islands (1900) (14585672399).jpg\n| image_map_caption      = Map of Negros Island in 1900\n| national_anthem        =\n| capital                = Bacólod\n| common_languages       = Hiligaynon, Cebuano and Spanish\n| government_type        = Republican canton\n| title_leader           = President\n| leader1                = Aniceto Lacson\n| year_leader1           = 1898–1899\n| title_representative   = Governor-General of the Provinces\n| representative1        = Melecio Severino\n| year_representative1   = 1899–1901\n| legislature            = Chamber of Deputies\n| title_deputy           = President of the Chamber of Deputies\n| deputy1                = José Ruíz de Luzuriaga\n| year_deputy1           = 1899–1899\n| era                    = New Imperialism\n| currency               = Spanish milled dollar\n| footnotes              =\n| today                  = Philippines\n}}\nThe Republic of Negros (; ; ) was a short-lived revolutionary entity which had existed on the island of Negros first as a canton of the First Philippine Republic and later as a protectorate of the United States.\nNomenclature\nThe entity had gone by multiple names throughout its short existence: the Negros Canton (; ; ) of the First Philippine Republic, and the Federal Republic of Negros (; ; ) or Federal State of Negros (; ; ) under U.S. protection. According to Gregorio Zaide, the protectorate had been annexed to the Philippine Islands as simply the Republic of Negros.\nHistory\nwas established (1898–1901)]]\nFrom November 3 to 6, 1898, the Negrenses began to revolt against the Spanish Empire‘a colonial government, headed locally by politico-military governor Colonel Isidro de Castro. The Spaniards decided to surrender upon seeing armed troops marching in a pincer movement towards Bacólod, the chief city of the island. The revolutionaries, led by Generals Juan Araneta, from Bago and Aniceto Lacson, from Talisay, were actually carrying fake arms consisting of rifles carved from palm fronds and cannons of rolled bamboo mats painted black. On 5 November, Spanish officials surrendered themselves to native troops. A provisional government was then established with Aniceto Lacson as President, and a notice of this was transmitted by Melecio Severino to President Emilio Aguinaldo on Luzón. On November 27, 1898, the unicameral Congress of Deputies () met in Bacólod and declared the establishment of the Republican Canton of Negros (). The Congress of Deputies acted as a constituent assembly to draft a constitution.\nMotivated by either economic interests or sheer realpolitik, the hacendero-led cantonal government surrendered to invading U.S. forces on March 4, 1899, following the outbreak of hostilities between the nascent First Philippine Republic and the U.S. military government which had been established during the Spanish–American War, and came under U.S. protection on April 30, 1899 as a territory separate from the Philippine Islands. A constitution for a Federal Republic of Negros, which proposed two governors, a U.S. military governor and a civil governor elected by voters of Negros, was framed by a committee sitting in Bacólod and sent to General Otis in Manila, proclaimed to take effect on October 2, 1899. The Negros government operated smoothly under this constitution until the province of Occidental Negros was established on April 20, 1901, and annexed to the Philippine Islands by the United States simply as the \"Republic of Negros\".\nLeaders\nThe leaders of the short-lived republic were:\n:{|class=wikitable\n|-\n|General Aniceto Lacson y Ledesma(November 5, 1898 - November 27, 1898)November 5, 1898 - July 22, 1899 || (President in Negros Occidental only until November 27, 1898)de facto President\n|-\n|Demetrio Larena y Sandes(November 24, 1898 - November 27, 1898)November 5, 1898 - July 22, 1899 || (President in Negros Oriental only)de facto Vice-President\n|-\n|Don José Ruiz de Luzuriaga y GuiquínJuly 22, 1899 - November 6, 1899|| President of the Chamber of Deputies\n|-\n| Don Eusebio Ruiz de Luzuriaga y Ramos || Secretary of the Treasury\n|-\n| General Simeón Lizares y Montebón || de facto Secretary of the Interior\n|-\n| Nicolás Gólez y Coloso || Secretary of Development and Public Works\n|-\n| Don Agustín Amenábar || Secretary of Agriculture and Commerce\n|-\n|Capitán Juan Anacleto Araneta y Torres || Secretary of War\n|-\n|Antonio Jayme y LedesmaJuly 24, 1854 - October 9, 1937|| Secretary of Justice\n|-\n|Melecio Severino é YoracNovember 6, 1899 - April 30, 1901|| de facto Governor-General of the Provinces\n|-\n|}\nCommemoration\nNovember 5, popularly referred to by the Negrenses as Cinco de Noviembre, has been officially observed since 1989 as a special non-working holiday in Negros Occidental. The republic itself has been commemorated in a historical marker in the main square of Bago, on which is inscribed:\nReferences\n*(Note: 1. The book cover incorrectly lists author as \"Maximo M Lalaw\", 2. Originally published in 1921 by The McCullough Printing Co., Manila)"
    }
  ]
}