{
  "content": [
    {
      "type": "text",
      "text": "# Republic of Baja California\n\n}}\n| conventional_long_name = Republic of Lower California\n| common_name            = Baja California|\n| image_flag             = Flag_of_the_Republic_of_Sonora.svg\n| flag_caption           = Flag\n| image_map              = File:Mapa Mexico 1853 1.PNG\n| map_width              = 250px\n| map_caption            = Mexico in 1853. Gray area represents Baja California and red area represents the 1854 Gadsden Purchase.\n| status                 = Unrecognized state\n| government_type        = Republic|\n| leader_title1          = President\n| leader_name1           = William Walker\n| event_start            = Established\n| year_start             = 1853\n| date_start             = November 3,\n| event_end              = Disestablished\n| year_end               = 1854\n| date_end               = January 21,\n| life_span              = 1853–1854|\n| p1                     = Second Federal Republic of Mexico\n| flag_p1                = Bandera Histórica de la República Mexicana (1824-1918).svg\n| s1                     = Republic of Sonora\n| flag_s1                = Flag of the Republic of Sonora.svg|\n| capital                = La Paz\n| demonym                = Baja Californian (Baja Californiano)\n| population_estimate    = 8,000 (1853)\n}}\nThe Republic of Lower California, also known as the Republic of Baja California, was a proposed state from 1853 to 1854, after American private military leader William Walker failed to invade Sonora from Arizona. Walker wanted to appropriate Sonora, and his claims had both the support of tycoons and government complacency in the United States.\nIn November 1853, Walker set off with two hundred men to La Paz, where he captured the political head and proclaimed the independence of the Republic of Lower California, a state that never had recognition nor truly existed because Walker had neither full control of the peninsula nor the support of the population. He faced resistance from the Mexican army and from civilians, among them a group led by . In spite of being repulsed from Ensenada and suffering the mutiny of his US troops, Walker declared himself president of the Republic of Sonora, which also included Baja California, and, like his successor, was not there in fact or endorsement. In fact, Walker reached Sonora only in 1854 and, when pressured by the United States Navy, had to flee to Ensenada, Mexico. In the face of Melendrez's harassment and the desertion of more troops, Walker and the remnants of his filibuster army surrendered to the US military in San Diego. Brought to trial, the judge said he was guilty of violating the Neutrality Act signed between Mexico and the United States after the US invasion of Mexico in 1847. However, Walker was acquitted by the jury.\nHistory\nWilliam Walker was an American physician and adventurer who settled in California during the gold rush. He had tried to take over the state of Sonora before launching the campaign against Baja California, with the support of American moguls.\nWalker left California with 45 American mercenaries on October 15, 1853, with the intention of arriving at Guaymas (Sonora), and occupying the Mexican state. However, one year before, the Mexicans had already repelled an expedition of French filibusters, increased their troops and had military preparedness. Perhaps this made Walker refrain. He chose to first attack and take the Baja California peninsula as a first step to seize Sonora. Aboard the schooner Caroline, Walker's expedition arrived at Cabo San Lucas on October 28 of that year. He moved by sea to La Paz, capital of Baja California territory, which he occupied five days after the capture of Rafael Espinosa, political head of the territory. There, the filibusters hauled down the Mexican flag and hoisted in place a flag of three horizontal stripes, two red and a white center, with two stars representing Baja California and Sonora. On November 3, 1853, the mercenaries proclaimed the independence of the peninsula which they called the Republic of Lower California. Later, the expedition captured Colonel Juan Clímaco Rebolledo, who came to replace Espinosa in the office of a political leader without knowing that the capital of Baja California had been seized by the American invaders.\nSince the expedition of reinforcements from California were slow in coming, Walker decided to move its headquarters to the north of the peninsula, near the border with U.S. and the land passage to Sonora, which was the goal of their ambitions and also the US government, which had already expressed its intention to buy northwestern Mexico. In La Paz, there were some clashes between civilian residents and filibusters, Walker played as military victories over the Mexican government, which he accused of being tyrant and decadent. And in Ensenada, the filibusters established their headquarters in what is now the Third and Gastélum streets of that city  From there, Walker issued a proclamation to the American people, requesting their support to defend the independence of Baja California, which had a self-appointed president. Many American volunteers joined the call of Walker, to add a number of 253 climbers who arrived in Ensenada on the boat Anita.\nSee also\n* Baja California (disambiguation)\n* Filibustering expeditions in Mexico\nNotes\nReferences\n* Olmeda García, María del Pilar (2010). Baja California. Historia de las instituciones jurídicas. Ciudad de México: Instituto de Investigaciones Jurídicas UNAM.\n* Rosengarten, Frederic (2002). William Walker y el ocaso del filibusterismo. Tegucigalpa: Guaymuras.\nExternal links\n*"
    }
  ]
}