{
  "content": [
    {
      "type": "text",
      "text": "# Republican League (Lithuania)\n\n| logo             =\n| logo_size        =\n| leader           = Jan Szybakowski\n| headquarters     = Kauno g. 1A, Vilnius\n| foundation       =\n| dissolution   =\n| split            =\n| ideology         = Polish interestsRegionalism\n| position         = Centre-left\n| european    = European Free Alliance\n| membership       =\n| colours          = White, red and dark blue\n| seats1_title     = Seimas\n| seats1           = }}\n| seats2_title     = European Parliament\n| seats2           = }}\n| seats3_title     = Municipal councils and mayors\n| seats3           = }}\n| website          =\n}}\nThe Republican League (, ), originally known as the '''Lithuanian Polish People's Party' (Lithuanian: Lietuvos lenkų liaudies partija, Polish: Polska Partia Ludowa) was a centre-left political party in Lithuania which represented the interests of the Polish minority. It was established as a left-wing competitor to the Electoral Action of Poles in Lithuania. The party performed poorly and was disbanded in 2017.\nHistory\nThe party was registered on 23 September 2002 and founded by the initiative of Ryszard Maciejkianiec, a former Member of the Seimas from the Union of Poles in Lithuania (later a member of the Lithuanian Social Democratic Union) and the editor-in-chief of Nasz Czas. The first chairwoman of the party was Polish community activist, journalist Antonina Poltawiec.\nImmediately after its registration, the party began cooperation with the European Free Alliance and was admitted to the alliance as a full member in 2004.\nThe party was founded with the intent of providing an alternative to the Electoral Action of Poles in Lithuania, which at the time had become dominant in the Polish-majority areas of Lithuania, and was highly promoted by Nasz Czas''.\nIn the 2002 local elections, Maciejkianiec was elected to the municipal council of Vilnius District Municipality, where he remained until 2007. In the 2004 parliamentary election, it ran candidates in nine constituencies with Polish populations, but won no seats.\nIn 2010, the party was renamed to the Republican League and abandoned its status as a regionalist Polish minority party, though it continued to strive for the integration of Lithuanian Poles and other national communities into the country's economic, cultural and social political life. Jan Szybakowski was elected as its new chairman. The reorganization did not turn the party's fortunes around and the party was liquidated on 2017 after failing to provide a list of members.\nProgram\nAccording to its program approved in 2006, the party\nThe party proposed replacing the existing administrative divisions of Lithuania with five regions - Žemaitija, Suvalkija, Dzūkija, Aukštaitija and the Vilnius Region. It supported Lithuania's integration into NATO and the European Union and was socially conservative.\nReferences"
    }
  ]
}