{
  "content": [
    {
      "type": "text",
      "text": "# Republic of Florida Militia\n\n– -->\n| dissolved        = 2019\n| merger           =\n| split            =\n| merged           =\n| country          = United States\n| allegiance       =\n| motives          = Creation of a White ethnostate\n| headquarters     = Tallahassee\n| area             = Florida\n| ideology         = AccelerationismWhite separatismWhite nationalismAntisemitism\n| position         = Far-right\n| slogan           = Nos Sumus in Posterum(We Are the Future)Unus Locus Unus Populus (One Location One People)\n| anthem           = Old Folks at Home\n| crimes           =\n| attacks          = Parkland high school shooting (Claimed)\n| status           =\n| size             =\n| revenue          =\n| financing        =\n| partof           =\n| allies           = Atomwaffen DivisionTraditionalist Worker PartyVinlanders Social ClubLeague of the South\n| opponents        =\n| battles          =\n| flag             =\n| website          = RepublicOfFlorida.info ([https://web.archive.org/web/20180321134628/http://republicofflorida.info/ Archived])\n| url              =\n| module           =\n| module2          =\n| module3          =\n| module4          =\n| module5          =\n| module6          =\n| predecessor      =\n| successor        =\n| newspaper        =\n}}\nThe Republic of Florida (ROF), is a white supremacist group based in Florida. The group's goal is to secede from the United States and form a white ethno-state. The group has a small following in the Tallahassee area, and a small presence in South Florida.\nThe group likens the Militia's relationship with the Republic to the United States Army's relationship with the American Government. Participation in paramilitary training is not mandatory for all ROF members. The group attends events organized by other white supremacist groups and spreads its ideology online. It has developed relationships and associations with other organizations, including Vinlanders Social Club, League of the South, the Atomwaffen Division, and the Traditionalist Worker Party.\nROF's leader, Jordan Jereb, founded the group in 2014. Jereb and other members of the group have made violent threats in the past. While the group does not have a significant history of violence, its use of violent language has raised concerns. Jereb was first arrested in 2016 for threatening a staffer in the office of Florida Governor Rick Scott. In August 2017, he was arrested a second time and charged with trespassing after allegedly entering his old high school with another member of the group.\nIn February 2018, the Anti-Defamation League (ADL) reported that Jereb had claimed that suspected shooter Nikolas Cruz was affiliated with ROF. This claim was quickly picked up by other media outlets, causing known white supremacists like The Daily Stormer's Andrew Anglin and Traditionalist Worker Party's Matthew Parrott to distance themselves from group.\nIt was later reported that Jereb had recanted his claim of Cruz's involvement with ROF, stating that he had made the claim as a joke and had no real information about Cruz's alleged ties to the militia. Despite this, the association between the militia and the school shooting brought additional attention and scrutiny to the group and its leadership.  In 2015, the group, together with the League of the South (LS), organized a protest in Tallahassee, Florida against the Florida State University's Students for a Democratic Society (SDS) group, who had burned a Confederate flag to protest increased Ku Klux Klan (KKK) recruiting in the area.\nReferences"
    }
  ]
}