{
  "content": [
    {
      "type": "text",
      "text": "# Resignation (Boardwalk Empire)\n\n| length         = 58 minutes\n| guests         = * Stephen Root as Gaston Means\n* Brian Geraghty as Warren Knox\n* Domenick Lombardozzi as Ralph Capone\n* Erik LaRay Harvey as Dunn Purnsley\n* Peter McRobbie as Supervisor Frederick Elliot\n* Kevin O'Rourke as Edward L. Bader\n* Eric Ladin as J. Edgar Hoover\n* Arron Shiver as Dean O'Banion\n* Morgan Spector as Frank Capone\n* Ty Michael Robinson as Samuel Crawford\n* Sean Cullen as Carl Billings\n| prev           = New York Sour\n| next           = Acres of Diamonds\n| season_article = Boardwalk Empire (season 4)\n| episode_list   = List of Boardwalk Empire episodes\n}}\n\"Resignation\" is the second episode of the fourth season of the American period crime drama television series Boardwalk Empire. It is the 38th overall episode of the series and was written by consulting producer Dennis Lehane and executive producer Howard Korder, and directed by Alik Sakharov. It was released on HBO on September 15, 2013.\nThe series is set in Atlantic City, New Jersey, during the Prohibition era of the 1920s. The series follows Enoch \"Nucky\" Thompson, a political figure who rises to prominence and interacts with mobsters, politicians, government agents, and the common folk who look up to him. In the episode, Chalky faces trouble when a New York associate visits, while Richard reconnects with his sister and questions his nature.\nAccording to Nielsen Media Research, the episode was seen by an estimated 2.21 million household viewers and gained a 0.9 ratings share among adults aged 18–49. The episode received positive reviews from critics, who praised the performances and directing, but feeling that the episode was more set-up for incoming storylines.\nPlot\nIn Chicago, Nelson Van Alden now works for Irish mobster Dean O'Banion, both as a delivery man and as an enforcer sent to collect debts. O'Banion has him cooperate with Capone in influencing the upcoming municipal elections, much to Van Alden's chagrin. Capone is reluctant to employ Van Alden but eventually decides that he could use him as a spy.\nSuspecting Knox of hiding something, Nucky asks Gaston Means for information. His suspicions are confirmed when Knox has his associate, Supervisor Frederick Elliot, arrested in Washington, D.C. Knox is revealed to be an undercover Bureau of Investigation agent, reporting to his boss, J. Edgar Hoover. Back in Atlantic City, Eddie states that he feels taken for granted by Nucky, something that the latter rebuffs. Later, Eddie informs Nucky that he is resigning. To keep Eddie, Nucky promotes him to taking care of his business' financial concerns.\nRichard has settled with his pregnant sister Emma in Plover, Wisconsin. Emma warns Richard that while he can stay, he should never return if he abandons her again. Later, Richard travels to Milwaukee to kill a man, whose address he received in Michigan. However, he decides to let the man live when the latter claims he is a family man. Richard starts changing his perspective on killing, such as refusing to put down Emma's dog. Later, he answers a phone call at the family home, in which a county assessor talks about debts on Emma's name. However, the assessor is Carl Billings, who had hired Richard to kill the man in Milwaukee and has tracked him down after being forced to do the job himself.\nAt the Onyx Club, Chalky meets Valentin Narcisse, an associate from New York. Narcisse reveals that Dickie, whom Dunn killed, worked for him. When Chalky refuses to disclose the identity of the person who killed Dickie, Narcisse ends their partnership. To save the club, Nucky offers 10% of the club's profits, which Narcisse accepts. In the car ride back to New York, Narcisse talks with Alma, who thanks him for \"rescuing\" her, but Narcisse questions her accusations against Dunn. Aware that she conspired with Dickie to trap and humiliate Dunn, Narcisse orders his henchmen to strangle her and dump her body. The following morning, Alma's body is found at one of Edward L. Bader's construction sites, attracting unwanted media attention.\nProduction\nDevelopment\nIn August 2013, HBO confirmed that the second episode of the season would be titled \"Resignation\", and that it would be written by consulting producer Dennis Lehane and executive producer Howard Korder, and directed by Alik Sakharov. This was Lehane's first writing credit, Korder's 13th writing credit, and Sakharov's second directing credit.\nReception\nViewers\nIn its original American broadcast, \"Resignation\" was seen by an estimated 2.21 million household viewers with a 0.9 in the 18-49 demographics. This means that 0.9 percent of all households with televisions watched the episode. This was a 8% decrease in viewership from the previous episode, which was watched by 2.38 million household viewers with a 0.9 in the 18-49 demographics.\nCritical reviews\n\"Resignation\" received positive reviews from critics. Matt Fowler of IGN gave the episode a \"great\" 8.5 out of 10 and wrote, \"The introduction of Dr. Narcisse helped give the season a tiny bit of momentum, but most of all he was just fun to watch. Nucky is off to Florida, remaining oblivious to the fact that Knox is set to possibly poison his operation from within. Other than providing texture for the show, the Capone/Van Alden stuff continued, as it always has, to feel like the odd-story out. But it's all part of the show-DNA now. Questionable, but never not watchable.\"\nGenevieve Valentine of The A.V. Club gave the episode a \"B\" grade and wrote, \"This grim pragmatism, the sense of the futility of forward motion, sneaks deliberately through the aptly-titled 'Resignation,' another patchwork episode that sets up disparate conflicts, presents one of this season's guest antagonists, and handles its first loaded point just about as badly as it could have.\"\nAlan Sepinwall of HitFix wrote, \"Jeffrey Wright doesn't turn up until midway through 'Resignation,' and he only has a handful of scenes. But he puts what screen time he gets to spectacular use, establishing Narcisse almost instantly as one of the show’s most compelling characters. Whether he's intended to be this year's version of Gyp Rosetti or is part of a longer game for the series, I cannot wait to watch every single damn minute he is on screen.\" Seth Colter Walls of Vulture gave the episode a 4 star rating out of 5 and wrote, \"Well, we've finally got ourselves a new season, seeing as how our official protagonist-of-record (Nucky) and our actual one (Chalky) were set up with proper antagonists this week. That's the bother with hitting the reset button on a show's secondary-character universe every year.\"\nRodrigo Perez of IndieWire wrote, \"The point has been made, Boardwalk Empire can be a deliberately paced show, but on tonight's episode 'Resignation,' it appears at least one of the fourth season's key elements is in place. That would be Dr. Valentin Narcisse, the brewing antagonist, whose striking demeanor and decisive words cut to the core of every character. Narcisse, at the very least, would make a worthy adversary for any character on this show.\" Chris O'Hara of TV Fanatic gave the episode a perfect 5 star rating out of 5 and wrote, \"Backlash and brutality took center stage this week on Boardwalk Empire, with several characters taking hits to their bodies, wallets and pride.\"\nMichael Noble of Den of Geek wrote, \"Like much of Boardwalk Empire, this episode is a study in contrasts. Compare the easy manner with which Chalky's hand slips to his wallet when the band members ask for money up front, as Mr Pastor used to do. A few dollars here and there is one thing. It makes Chalky feel like Prince Largesse, but a slice of his club? That's a different game and Dr Narcisse is a different player.\" Paste gave the episode a 6.9 out of 10 rating and wrote, \"All four storylines, not to mention the interstices that kept other parts of the show's clockwork plot machine rolling along for the rest of the season, were excellently acted and immaculately visualized. It's just that two of them were also kind of ridiculous and not terribly well-written. Unfortunately, that's part of Boardwalk Empires identity at this point, and preposterous dialogue and hamfisted thematization are just part of the package. Two episodes in, though, and things are still a bit dull.\"\nReferences\nExternal links\n* [https://www.hbo.com/boardwalk-empire/season-4/2-resignation \"Resignation\"] at HBO\n*"
    }
  ]
}