{
  "content": [
    {
      "type": "text",
      "text": "# Restorative Liberal Revolution\n\nThe Restorative Liberal Revolution, also known as the Invasion of the 60 due to the number of men with whom the movement began, was an expedition of Venezuelans exiled in Colombia under the command of Cipriano Castro that began on 23 May 1899, with the purpose of overthrowing the government of Venezuelan President Ignacio Andrade.\nOrigin\nThe political crisis experienced by the regime of Ignacio Andrade, and Yellow Liberalism in general, after the death of Joaquín Crespo in the , was an opportunity for Cipriano Castro to launch the last phase of the revolutionary movement that he had been organizing in his exile in Colombia, since the defeat of the Legalist Revolution in 1893.\nInitially, he proposed an alliance with , also in exile, but given the failure of the talks and the fragility of the Andrade government, he decided to rely only on his 60 men and the Castro Restorative Liberal party that awaited him in Táchira. So he began his revolution crossing the border of the Táchira River on 23 May 1899.\nDevelopment\nThe forces of the rebels grew as they entered the Venezuelan Andean center to overthrow the unpopular Andrade government. On 12 September, with already 2,000 troops under his command, Castro defeated 4,000 government soldiers commanded by the Minister of War, General Diego Bautista Ferrer, in the , who lost 2,000 men trying to assault the enemy positions.\nTwo days later Andrade assumed personal command of the government army and Castro launched a coordinated offensive against Caracas. After this, several warlords and their militias deserted to the rebel side. When Castro was preparing to confront  in La Victoria, he was surprised that General Ferrer decided to disobey the government's orders and not confront him. With 10,000 soldiers, Castro entered the capital on 23 October with generals and caudillos Luciano Mendoza, Samuel Acosta and Luis Lima Loreto by his side. Andrade is overthrown in a coup and forced into exile on Curaçao and then in Puerto Rico.\nTimeline of the revolution\n* 24 May: The Sixty passed through Capacho, where they were joined by 120 more men from the Castro party, including Eleazar López Contreras. Hours later, the Restorative Army carried out a successful ambush in Tononó on the government troops.\n* 27 May: The rebels, already with 400 troops, were located in Las Pilas, near San Cristóbal, and attacked the government reinforcements with as a result, a new revolutionary victory.\n* 28 May: The Restorers settled in Táriba where they reorganized their forces.\n* 11 June: The rebels faced the Continuationist troops led by  in the . After four hours of intense fighting, the government army was defeated.\n* 16 June: Castro and his troops returned to San Cristóbal and besieged it.\n* 23-24 June: The Restorers attacked the city, which was defended by General Juan Pablo Peñaloza. The city could not be taken.\n* 12 July: Castro lifted the siege in the face of the proximity of 4,000 government troops under the command of Antonio Fernández.\n* 27 July: The Restorers faced the Continuationist troops in the Combat of Cordero. The government artillery forced the Restorers to fall back towards Palmira.\n* 28 July: After 18 hours of exchanges of fire, the Continuationist managed to regroup with Peñaloza in San Cristóbal.\n* 31 July: Castro and the Restorers advanced towards Mérida and Trujillo.\n* 2 August: The Restorers decided to march towards the center of the country. Days later they camped in Tovar.\n* 5 August: The rebels took Bailadores.\n* 6 August: The Restorers attacked Tovar, a city defended by two thousand troops led by . After a fierce battle, the town was taken.\n* 9 August: Castro and the Restorers arrived in Mérida.\n* 16 August: They occupied Valera.\n* 22 August: The rebels took Carora and continued their march.\n* 26 August: Castro and the Restorers stopped in Parapara before a flood of the Tocuyo River. A contingent under the command of Elías Torres Aular and Lorenzo Guevara attacked them. Castro defeated Torres in the rear, while Guevara retreated. The rebels captured a Krupp cannon.\n* 1 September: Castro and the Restorers passed through Barquisimeto without being attacked. The rebels advanced through Yaritagua, Urachiche and Chivacoa.\n* 8 September: The rebels presented combat to General Rosendo Medina in Nirgua. Medina was defeated.\n* 12 September: Castro arrived in Tocuyito in command of almost 2,000 soldiers and camped there. The government organized a large army in Valencia with the intention to definitively crush the Restoration movement\n* 14 September: Castro, outnumbered 2 to 1, fought the government army in the town of Tocuyito. President Andrade was present in La Victoria to lead the battle. The Continuationist Generals Diego Bautista Ferrer and Antonio Fernández followed contradictory orders issued by the President himself. The military maneuvers ordered by Castro, added to the contradictory orders of the President, sowed chaos in the government army that ended by withdrawing.\n* 16 September: The rebels took Valencia. As a result of the result of the Battle of Tocuyito, senior government leaders began to negotiate the outcome with Castro. Finance Minister Manuel Antonio Matos acted as intermediary.\n* 19 October: Ignacio Andrade decided to abandone the Presidency. He boarded the boat Bolívar and left for exile on the Island of Saint Thomas. Vice President Víctor Rodríguez Párraga assumed power temporarily.\n* 22 October: Castro triumphantly entered Caracas, definitively defeating the government.\nSee also\n* 1908 Venezuelan coup d'état\nReferences"
    }
  ]
}