{
  "content": [
    {
      "type": "text",
      "text": "# Return to Queens Blvd.\n\n| length       = 26 minutes\n| guests       = * Jamie-Lynn Sigler as Herself (special guest star)\n* Gus Van Sant as Himself (special guest star)\n* Martin Scorsese as Himself (special guest star)\n* Mercedes Ruehl as Rita Chase (special guest star)\n* Louis Lombardi as Ronnie\n* Camille Saviola as Turtle's Mom\n* Bow Wow as Charlie\n* Mercedes Mason as Kara\n* Jordan Feldman as Van Sant's Assistant\n* Beverly Sanders as Eric's Receptionist\n| prev         = Play'n with Fire\n| next         = Drive\n| episode_list = List of Entourage episodes\n}}\n\"Return to Queens Blvd.\" is the twelfth episode and season finale of the fifth season of the American comedy-drama television series Entourage. It is the 66th overall episode of the series and was written by series creator Doug Ellin and producer Ally Musika, and directed by co-executive producer Mark Mylod. It originally aired on HBO on November 23, 2008.\nThe series chronicles the acting career of Vincent Chase, a young A-list movie star, and his childhood friends from Queens, New York City, as they attempt to further their nascent careers in Los Angeles. In the episode, the boys return to Queens after Vince's career setback, hoping to make a comeback.\nAccording to Nielsen Media Research, the episode was seen by an estimated 2.05 million household viewers and gained a 1.3 ratings share among adults aged 18–49. The episode received generally positive reviews from critics, although some expressed frustration with the repetitive nature of the series.\nPlot\nThe boys have returned to Queens, with Vince (Adrian Grenier) still debating on the next step in his life. They often hang out at the house of Vince's mother, Rita (Mercedes Ruehl), who is hoping her son returns to his career. She suggests auditioning for a film by Gus Van Sant, who is filming in the area and has lost his main star.\nVince is forced to auditioning, but Van Sant has blocked him access. Eric (Kevin Connolly) meets with Van Sant to convince him in giving him a chance, but he stands firm in his opinion that Vince lacks acting range. Desperate, Eric gets Ari (Jeremy Piven) to deliver footage from Smoke Jumpers to Van Sant to make him change his mind. While this changes his perception of Vince, Van Sant decides to not cast him anyway. Meanwhile, Turtle (Jerry Ferrara) is still in contact with Jamie-Lynn Sigler, keeping it a secret from the boys, and causing Drama (Kevin Dillon) to suspect. He takes Turtle's phone during a call, and is shocked to find that he is in a relationship with Sigler.\nBelieving his career to be over, Vince decides to fire Eric for not helping him, prompting the latter to return to Los Angeles. Afterwards, Ari visits Vince with big news. He gets a phone call with Martin Scorsese, who saw the Smoke Jumpers footage thanks to Van Sant and Eric, and wants Vince to star as Nick Carraway in his adaptation of The Great Gatsby. Vince gladly accepts, and returns to Los Angeles to apologize to Eric. They reconcile and return to New York to start working on the film.\nProduction\nDevelopment\nThe episode was written by series creator Doug Ellin and producer Ally Musika, and directed by co-executive producer Mark Mylod. This was Ellin's 42nd writing credit, Musika's seventh writing credit, and Mylod's 16th directing credit.\nReception\nViewers\nIn its original American broadcast, \"Return to Queens Blvd.\" was seen by an estimated 2.05 million household viewers with a 1.3 in the 18–49 demographics. This means that 1.3 percent of all households with televisions watched the episode. This was a slight decrease in viewership with the previous episode, which was watched by an estimated 2.06 million household viewers with a 1.3 in the 18–49 demographics.\nCritical reviews\n\"Return to Queens Blvd.\" received generally positive reviews from critics. Ahsan Haque of IGN gave the episode an \"amazing\" 9 out of 10 and wrote, \"As a season finale, it was great to see that long awaited happy ending for Vince, but the dramatic implication of a possible Vince and Eric split-up could have worked out well too. Sure, we've seen Vince and Eric disagree in the past, but Eric's much more capable of standing on his own feet now. Nevertheless, it was touching to see Vince fly down to personally apologize to Eric, even if it all felt like it happened too quickly.\"\nJosh Modell of The A.V. Club gave the episode a \"C+\" grade and wrote, \"So we come to the end of another season of Entourage, and maybe this is true of all the seasons, but it feels like we're back where we started – and this roller-coaster ride is getting a little boring. Vince is on top of the world! Vince is ready to quit the business! No, Vince is in demand! Vince is a great actor! No, he sucks! Last season let us build our hopes on Medellin and then dashed them (pretty well, I thought) – this one tried to repeat the formula what seemed like six times. With mixed results.\" Alan Sepinwall wrote, \"I understand that the show is meant to be a fantasy camp. It's that everything always works out in the least interesting, least entertaining way possible. Vince and E have a big blow-up, E decides to explore a life without his meal ticket, and five minutes later, everything's just peachy. It's not dramatically interesting, it's not funny, it's not engaging. It's just... there.\"\nEmily Christner of TV Guide wrote, \"Might it be the end of the line for Vince and the boys in Hollywood?  The gang heads back to Queens in this Season 5 Finale to regroup and to try to get Vince back in the game with a Gus Van Sant movie. Gus has different feelings about the quality of Vince's work however, and it's a fight to the finish. Michael Phelps makes a very short cameo when Eric almost knocks him over on the sidewalks of New York.\" Rob Hunter of Film School Rejects wrote, \"A fracture in the group is long overdue, and this was the perfect opportunity for Eric to step out on his own and leave the children behind. I know, I’m a fool. But it could have made for some interesting story lines... just like the others that were dropped in favor of the status quo.\"\nDoug Ellin and Ally Musika submitted this episode for consideration for Outstanding Writing for a Comedy Series at the 61st Primetime Emmy Awards.\nReferences\nExternal links\n* [https://www.hbo.com/entourage-lwm/season-5/12-return-to-queens-blvd \"Return to Queens Blvd.\"] at HBO\n*"
    }
  ]
}