{
  "content": [
    {
      "type": "text",
      "text": "# Reuben Ward Binks\n\nReuben Ward Binks (1880, Bolton, Lancashire – 17 May 1950, Westmorland) was an English artist in canine portraiture, Lakeland landscapes and wildlife painting.\nLife and career\nBinks was recognised as the leading artist of his day in canine portraiture, not only in the UK but abroad. He painted dogs for three generations of the British Royal family, and among his patrons were four successive monarchs.\nHe spent many months in the Punjab, painting for an Indian potentate, the Maharaja Bhupinder Singh, the ruling Maharaja of the princely state of Patiala from 1900 to 1938) and he paid several visits to the USA to fulfil commissions for prominent American families, including Geraldine R. Dodge, niece of the famous millionaire, John D. Rockefeller.\nStarting as a miniaturist, he painted some exquisite examples of that art, but had to give it up owing to the strain on his eyes and took to painting sporting subjects. A great lover of dogs, they featured in many of his pictures and it was soon apparent that he had a distinct flair in that direction.\nHe used a variety of media – drypoint, etching, aquatint, pastel and watercolour – and, as his skill developed, so did his reputation.\nHis talent attracting Royal notice, Binks was commissioned to paint the famous terrier, “Caesar” Caesar (dog), for King Edward VII and some of the favourite dogs of Queen Alexandra. He also painted Clumber spaniels for King George V, Cairns for King Edward VIII (then Prince of Wales), retrievers for King George VI (then the Duke of York), terriers for the Duke of Gloucester (then Prince Henry), Alsatians for the late Duke of Kent (then Prince George), and the pets of Princess Victoria (sister of King George V).\nDuring the reign of King George V, Binks was frequently asked to attend the Royal shoots at Sandringham in order to sketch the sporting dogs at work. Among his most treasured possessions was a signed portrait of His Majesty given to him by the King in 1929, framed in red morocco and bearing the Royal crown in gilt.\nIn 1925, Binks went to India to paint 150 pictures of dogs for the Maharajah of Patiala.\nMuch of his work appeared in such UK publications as the weekly newspaper, The Sketch, Field magazine, Country Life magazine and Bystander magazine.\n}}"
    }
  ]
}