{
  "content": [
    {
      "type": "text",
      "text": "# Revolution on Granite\n\nDemocratic Bloc\n* People's Movement of Ukraine\n* Students\n}}\n| side2 =\n* Communist Party of Ukraine\n}}\n| leadfigures1 =\n* Ihor Yukhnovskyi\n* Oles Donii\n* Oleh Medunytsia\n* Viktor Roh\n* Oleh Tyahnybok\n}}\n| leadfigures2 =\n| howmany1 = 100,000\n| howmany2 =\n| casualties1 =\n| casualties2 =\n| fatalities =\n| injuries =\n| arrests =\n| damage =\n| detentions =\n| charged =\n| fined =\n}}\nThe Revolution on Granite () was a student-led protest campaign that took place primarily in Kyiv and Western Ukraine in October 1990. Ukraine was then the Ukrainian Soviet Socialist Republic, part of the Soviet Union until its declaration of independence on 24 August 1991. The protest was held from 2 October until 17 October 1990. One of the students' demands was the resignation of the Chairman of the Council of Ministers of the Ukrainian SSR Vitaliy Masol. On the last day of the protests, Masol was forced to resign and was replaced by Vitold Fokin.\nThe Revolution on Granite is considered the first major political protest of Ukraine centred on Maidan Nezalezhnosti (Independence Square), the others being the 2004 Orange Revolution and the 2013–14 Revolution of Dignity.\nHistory\nThe Ukrainian Student Union was launched in August 1989. This organisation was deeply unsatisfied with the results of the March 1990 Ukrainian parliamentary election. In this election the Communist Party of Ukraine had won 331 seats in the Supreme Soviet of the Ukrainian SSR (the parliament of the Ukrainian SSR) and the Democratic Bloc 111 seats. Student leader  declared that the Democratic Bloc ought to have won a majority. The Student Union then began preparations for a large-scale protest, which was to become known as the Revolution on Granite.\nOn 2 October 1990 the students announced a hunger strike and occupied Kyiv's October Revolution Square (now named Maidan Nezalezhnosti [Independence Square]). They had decided against using the originally intended protest site Mariinskyi Park since that place was filled with Militsiya (the Soviet police force). The day had started with a rally which was attended by 100,000 people and initiated by the People's Movement of Ukraine, the Ukrainian Republican Party, and other smaller patriotic organisations. During the protest various other marches, whose participants numbered in the tens of thousands, were held in solidarity with the students. Also workers' organisations rallied to the cause by calling for nationwide strikes. During the protest, prominent cultural figures, opposition politicians and Soviet dissidents visited the students to show their support. On one of the first days of protests, chairman of the Supreme Soviet of the Ukrainian SSR Leonid Kravchuk visited the protestors.\nThe protesters wanted to prevent the signing of the New Union Treaty, a new multi-party parliamentary election held before or in the spring of 1991, military service for Ukrainian (in the Soviet Armed Forces) to be fulfilled only in the Ukrainian Soviet Socialist Republic, the property of the Communist Party of Ukraine and Komsomol nationalised and the resignation of the Chairman of the Council of Ministers of the Ukrainian SSR, Vitaliy Masol. The demand to not sign the proposed New Union Treaty, which would transform the Soviet Union into the Union of Soviet Sovereign Republics, was part of the then resurgence of Ukrainian nationalism which eventually led to Ukraine's 1991 declaration of independence.\nOn the first day of the protest, only a few dozen students from Kyiv, Lviv, Dneprodzerzhinsk (now Kamianske), Ivano-Frankivsk, and several other cities gathered at the square. In a few days, there were several hundreds of them, along with around tens of thousands of Ukrainians who supported them. The students set up shelter-half tents on the square. The protest acquired its name from the setup of the tents on the granite of the square. Of all protesters, about 200 were on hunger strike (all of them survived their action). Eventually another camp was set up in front of the Supreme Soviet of the Ukrainian SSR. During the protest and because deputies had sided with the students, student Oles Doniy from the T. H. Shevchenko Kyiv State University (now Taras Shevchenko National University of Kyiv) stated the students' demands in a speech to the Verkhovna Rada (Ukraine's parliament).\nOn 17 October 1990, Masol was forced to resign and was replaced by Vitold Fokin.[https://books.google.com/books?id=C8C3xuqd6aMC&pg=PA21 How Ukraine Became a Market Economy and Democracy] by Anders Åslund, Peterson Institute for International Economics, 2009, [https://books.google.com/books?id=qmN95fFocsMC&pg=PA850 Eastern Europe and the Commonwealth of Independent States 1999], Routledge, 1998,  (page 850) The four other student demands were not initially met. But soon military conscription was to be limited to the territory of Ukraine; the planned New Union Treaty was not to be taken into consideration and multi-party elections were set to be held in the 1994 Ukrainian parliamentary election.\nLegacy\nVarious Revolution on Granite organizers later became leading figures in organising the 2004 Orange Revolution. Mykhaylo Svystovych and Vyacheslav Kyrylenko started their political career with taking part in the Revolution on Granite.\nThe Revolution on Granite is viewed as the first major political protest centred on Maidan Nezalezhnosti, the others being the 2004 Orange Revolution, and the 2013–14 Euromaidan.[http://www.businessinsider.com/why-ukraine-is-so-important-2014-1 Why Ukraine Is So Important], Business Insider (28 January 2014)[https://books.google.com/books?id=2DI9DwAAQBAJ&pg=PA154 The Process of Politicization: How Much Politics Does a Society Need?], Cambridge Scholars Publishing, 2017,  (page 154) These protest largely mimicked the style of protest of the Revolution on Granite: occupation of a large square and building a stage there where artists would perform.\nIn May 2024 a monument to one of the leaders of the leaders of the protest campaign  was opened in Lviv.\nReferences\nExternal links"
    }
  ]
}