{
  "content": [
    {
      "type": "text",
      "text": "# Revolution (novel)\n\nRevolution is a young adult historical fiction novel by Jennifer Donnelly about a girl named Andi Alpers who is struggling with drugs, thoughts of suicide, and the way her family has fallen apart after the death of her ten-year-old brother.  When her father takes her with him to Paris on a business trip to ensure she works on her school thesis, Andi discovers a journal written by a girl her age, Alexandrine Paradis, two centuries earlier which has its own tragedies inside.  Revolution was an Amazon Best Book of the Year (2010) and honored by [http://www.kirkusreviews.com/lists/2010-best-books-teens-complete-list/ Kirkus Reviews] and [http://www.schoollibraryjournal.com/slj/newslettersnewsletterbucketextrahelping/887793-443/best_books_2010_fiction.html.csp School Library Journal]; the audiobook version received a 2011 [http://www.ala.org/ala/mgrps/divs/yalsa/booklistsawards/odyssey/odyssey.cfm American Library Association Odyssey Honor].\nPlot summary\nAndi Alpers is doing the best she can to take care of her mother's deep depression while popping pills for her own.  Her father is off living with his pregnant 25-year-old girlfriend, her grades are falling apart, and if she does not turn in her thesis outline after break, she will be kicked out of school.  Her best friend Vijay does all he can to help her move on. But she does not care, because she knows it is her fault that her ten-year-old brother was killed by a crazy man named Max, who, trying to stay away from the cops grabbed her brother Truman and held a knife to his neck. Max, feeling threatened by a cop pulling out a gun, jumped into the street and was hit by a delivery van while still holding Andi's brother, killing them both, while she was ditching school with Nick Goode when she really should have been walking her brother to school.  The only thing that keeps her alive is her music.\nBut then her father swoops back into the picture after hearing about her grades.  He ships her mother off into a mental hospital to recover and takes Andi to Paris with him to make sure she writes the outline for her thesis.  He is there to do a DNA test on the remains of a heart believed to be that of Louis-Charles, the young son of Louis XVI and Marie Antoinette, who was locked away during the French Revolution and believed to have died in the tower at the age of ten.  Despite this, rumors of the Lost Dauphin's escape were numerous, as were the people who stepped up to claim the throne at the end of the Revolution.\nAndi becomes more interested in this story when she discovers the diary of Alexandrine Paradis, a girl who played with and watched over the prince in her youth and later became a hunted figure nicknamed The Green Man because she continued to set off fireworks all around the city for the prince to see from the tower, so he would not lose hope.  As she reads through the diary, Andi almost starts to believe that Alex wants her to finish reading it instead of working on her musical DNA project on Amadé Malherbeau, a famous musician of around the same time who is known for his quirky style.\nDuring her library adventures in research and exploring around Paris, Andi meets Virgil, a taxi driver, and they begin an odd courtship of musical discourse over the phone after she accidentally leaves her iPod with him after making music together at a bar.  All the while, the music she plays on her guitar and the talks she and Virgil have keep her hoping for a better future, despite her fights with her father and her emotional distress over memories the diary evokes of her own brother.  After her frantic attempt to get up to the top of the Eiffel Tower to commit suicide, Virgil drags her with him down to a closed off part of the catacombs of Paris, where the bones of the thousands of dead were laid to rest centuries ago, to play at a party.  When the police come in to break things up and everyone is running everywhere, Andi is suddenly transported to the 18th century and everyone thinks she is Alex.\nHer savior is the subject of her thesis, Malherbeau, and her confused babblings are attributed to the crack in the head she took while stumbling in the darkness of the catacombs, until she starts playing her guitar in public at the base of the tower for Louis-Charles to hear and is seriously heckled by those present.  Andi carries out the rest of Alex's mission, knowing that the heart in the jar that her father is testing is indeed Louis-Charles, and that he will die in just a few nights.  In exchange for his help, she gives Malherbeau her iPod, and he listens to Beethoven play music he has not finished composing yet, as well as music from more recent artists such as Radiohead.  Andi returns to her own century wondering if all that had happened was true or some strange effect from her medication and the knock to the head.  She also returns with a sense of acceptance of all that has happened.\nIn the epilogue, Andi is living in France with her mother, who has gotten through her own depression with help.  She still has a strained relationship with her father, who is with his new family, but enjoys playing music with Virgil around Paris.\nPublication history\nThe book was published in October, 2010 by Delacorte Press, an imprint of Random House, with a first run of 250,000 copies.\nReception\nThe Kirkus Reviews gave Revolution a starred review, saying \"Donnelly combines compelling historical fiction with a frank contemporary story. Andi is brilliantly realized, complete and complex. The novel is rich with detail, and both the Brooklyn and Paris settings provide important grounding for the haunting and beautifully told story.\"  Publishers Weekly thought \"Donnelly's story goes on too long, but packs in worthy stuff. Musicians, especially, will appreciate the thread about the debt rock owes to the classics.\"  School Library Journal called it \"stunning\" and \"A Favorite Book Read in 2010.\"\nAwards and nominations\n*Amazon's Best Books of the Year (2010) by [https://www.amazon.com/b?node=2486012011]\n*Kirkus Reviews (Best Teen Book, 2010) [http://www.kirkusreviews.com/lists/2010-best-books-teens-complete-list/]\n*School Library Journal (Favorite Book Read, 2010) [http://www.schoollibraryjournal.com/slj/newslettersnewsletterbucketextrahelping/887793-443/best_books_2010_fiction.html.csp]\n*American Library Association Odyssey Honor (Audiobook, 2011) [http://www.ala.org/ala/mgrps/divs/yalsa/booklistsawards/odyssey/odyssey.cfm]\n*Indies Choice Book Award (Young Adult, 2011)\nReferences\nExternal links\n* [https://www.theguardian.com/books/2010/nov/27/revolution-jennifer-donnelly-fiction-review Guardian.co.uk Revolution Review]\n* [http://booktunes.net/interview/16813189-A-Child%27s-Heart Booktunes Interview ''A Child's Heart'']"
    }
  ]
}