{
  "content": [
    {
      "type": "text",
      "text": "# Revolution in Me__disambig_1\n\n| length     = 53:58\n| label      = London Records\n| producer   =\n| prev_title =\n| prev_year  =\n| next_title = Ghosts\n| next_year  = 2007\n| misc       =\n}}\nRevolution in Me is the debut studio album by British musician Siobhán Donaghy, released on 29 September 2003 by London Records. It was her first solo album following her acrimonious departure from British girl group Sugababes. Donaghy departed the group amid reports of her being bullied by its other members. When she quit the Sugababes, the band was dropped by London Records, who decided to retain Donaghy's contract as a solo artist.\nDonaghy began promoting the album in early 2003 under the pseudonym Shanghai Nobody, an anagram of her name. Using the pseudonym, she issued the promotional single \"Nothing but Song\", and performed at small English clubs such as Dublin Castle. She reverted to her given name for the release of the album's lead single \"Overrated\" in June 2003, which was a top twenty hit on the UK Singles Chart. \"Twist of Fate\" was issued as the album's second single in September. Despite receiving positive reviews, the album was a commercial disappointment upon release, peaking at #117 on the UK Albums Chart. \"Iodine\" was scheduled to be issued as the third single from the album in December, but Donaghy was dropped by London Records before it was released.\nA 20th anniversary edition of Revolution in Me was released on 8 December 2023. This reissue contained a bonus disc of b-sides, outtakes and alternate versions. An outtake from the album, \"Pop Illusion\", was released as a promotional single to support the reissue.\nBackground\nDonaghy was twelve years old when she signed a management contract with producer Ron Tom, who helped form British pop group All Saints in the mid-1990s. Two years later, in 1998, Donaghy became a founding member of Sugababes when Tom introduced her to Mutya Buena and Keisha Buchanan. The group signed to London Records, and their debut album One Touch was primary produced by Cameron McVey. She was sixteen years old when their first single \"Overload\" was released in 2000. The song and album were critical and commercial successes, with \"Overload\" receiving a nomination for Brit Award for British Single of the Year.\nHowever, Donaghy acrimoniously exited the group in August 2001 during a promotional tour in Japan. Tensions between Donaghy and her bandmates were reported by numerous publications during the album's promotional cycle. Donaghy said she and Buchanan \"had nothing in common at all, and we went on not to get on. She was Mutya's friend, so I ended up being the odd one out.\" Buchanan and Buena reportedly invented their own coded language to exclude Donaghy from conversations. Buchanan and Buena said Donaghy never returned after she \"excused herself to go to the toilet\" at an airport,  while Donaghy said she and Buchanan had a \"falling out\" when in Japan. Donaghy later accused Buchanan of bullying, saying: \"It was clear that there was someone in that band who never wanted me in it and that's Keisha. She never wanted me in that band and made my life a living hell.\" Buchanan has denied accusations of bullying other Sugababes members.\nImmediately after quitting the band in Japan, Donaghy flew back home to her family in Eastcote, Middlesex. She said she suffered panic attacks and a nervous breakdown in the following months, explaining that at this point she would have been \"happy never to work again. I had got to the point where I'd look in the mirror and not know who I was. I felt like I didn't have a personality. I'd lost my identity... I felt like a zombie. A dead person.\" She was later diagnosed with clinical depression, and prescribed anti-depressants.\nComposition and recording\nFollowing Donaghy's departure from the Sugababes, the group was dropped by London Records, although the label opted to retain Donaghy's contract as a solo artist. She was then sued by the band's manager. Donaghy said she spent all the money she earned as a member of the band fighting the lawsuit. Several months after leaving the band, she traveled with her sister to Ibiza for a holiday, where she met Johnny Lipsey, who had produced several tracks on the first Sugababes album. On returning home, Lipsey reintroduced Donaghy to Cameron McVey, who invited her to record at his home studio in Eastcote. Donaghy then began writing material with a new team of songwriters. During this time, the Sugababes – who had replaced Donaghy with former Atomic Kitten singer Heidi Range – had a UK number one single with \"Freak like Me\". Donaghy commented: \"If I'd still been in that band, I wouldn't have given a fuck that I was number one.\"\nSeveral songs on Revolution in Me contain lyrics dealing with Donaghy's time as a member of the Sugababes. She said it contains lyrics describing \"how being in the Sugababes made me feel. I learnt a lot—about how awful people can be. But it's not completely melancholy and about depression. It is positive. I was very bitter when I left the [band]. But one day I woke up and realised: shit happens. Get over it. I had enough of dwelling on it and blaming others. I felt I needed to become a better person.\" Yahoo! Music said the record incorporates lyrical themes of \"taking stock of life, controlling your destiny and searching for support.\"\nDonaghy said she and Cameron McVey wanted the album to sound \"quite rough-around-the-edges.\" She said McVey was inspired by their experience of recording \"Overload\", which was \"done in one take on a 58 hand-held mic. That was what he saw in me and wanted for [the album]...  A live band, a one-take vocal.\" The record was primarily produced by McVey, his son Marlon McVey, and Marlon's Mattafix bandmate Preetesh Hirji. It also features production contributions from Matt Kent, Jody Street, Neil Pearson and Silvio Pacini. The album was described by media as a pop rock record. It additionally contains songs ascribed to the trip hop, hard rock, alternative pop, and alternative country genres.\nMusically, The Guardian journalist Alexis Petridis described Revolution in Me as being in stark contrast to One Touch, saying the album dismissed the R&B influences found on One Touch to create \"a peculiar character of its own\". Yahoo! Music described it as a \"mostly refined, sophisticated pop\" album that features Donaghy's \"undeniably powerful voice sitting centrally in the mix, never overbearing but never understated.\" Their writer also commended the constant \"twists and turns thrown [in] to avoid the album sounding one-dimensional.\" Drowned in Sound said the record contains \"a newly acquired sense of real songcraft\", while RTÉ said that from its \"opening moments\", the album demonstrates how Donaghy \"has an edge under her belt that [other musicians] could only dream about\".\nSongs\n\"Nothing but Song\" is the first song on the album. The track contains sampled audience noise and scratching, a prominent bass riff and looped piano. Drowned in Sound said the song \"floats on unfinished piano lines and 'Disco Inferno'-style sampled crowd noise that becomes remarkably and inexplicably affecting.\" RTÉ said the track exemplifies how Donaghy \"lays out a stall with something decidedly more interesting to offer than that of her sickly sweet contemporaries.\" \"Man Without Friends\" begins with gentle guitar lines, but gradually builds to a sing-along coda featuring the lyric \"I start to unravel in my mind\". Yahoo! Music said the song was subversive, saying its \"laidback mood\" dilutes the \"acidity of the words\". \"Overrated\" is an alternative pop song, and directly references her time as a member of the Sugababes. RTÉ described it as \"a frank account of disappointment and misery.\"\nDonaghy said \"Little Bits\" was one of her favourite songs on the record. She said that on the track, \"I talk about my depression quite frankly, and it's a most beautiful piece of music—quite Massive Attack. It starts slow, raw and basic, with guitar-picking and a shaker, and builds up into this full-sound instrumental boom. It catches everyone. I always thought it should have felt like this before – really magical – but it never did.\" The song builds to a crescendo featuring woodwind and string instrumentation. \"Next Human (XY)\" features a xylophone, and the lyrics to the song use chromosomes as a metaphor for a romantic relationship.\n\"Twist of Fate\" had the working title \"Hate\", with its chorus containing the lyric \"To say that I hate you is not an easy thing to say\". It is an alternative pop song, with Yahoo! Music saying it \"leaves behind the beats for close on five minutes of pure radio-friendly pop-rock with a naggingly catchy chorus\". Stylus praised Donaghy's vocal performance on the track, saying that during the chorus, her voice \"opens up to reveal voices within voices, a meaningless platitude invested with phenomenal power\", saying that her vocals created \"that perfect unison of melancholy and hopefulness\". \"Faces\" is a sparse song built around a steel drum loop. The track features a contribution from American musician Ry Cooder.\n\"Dialect\" is a hard rock song, featuring electric guitars and heavy drum loops. The Independent described it as being \"as far removed from Sugababes as possible; it rocks.\" When describing her vocal performance, Donaghy said she \"was screaming on that one\". \"Iodine\" is an alternative country song. Drowned in Sound described it as \"the world-weary cousin\" of the Sugababes's \"New Year\". The track contains political lyrics, such as \"There is no left-wing to fight the right-ring\". RTÉ said that on first listen, \"you actually do a double take. While Donaghy may seem a bit young to know much about the intricacies of global politics, her efforts have to be admired\". They said Donaghy's work was \"a lot of lot more ambitious\" than the work of other female artists active at the time.\nRelease and promotion\nDonaghy began promoting the album with a series of concerts at small club venues, under the pseudonym Shanghai Nobody—an anagram of her name. These shows included a performance at Dublin Castle in Camden Town, which she said \"helped me deal with my stage fright\", noting that as a member of the Sugababes, she \"missed out all the scummy venues\". \"Nothing but Song\" was issued as a promotional white label 7-inch vinyl single by London Records in early 2003. \"Overrated\" was issued as the lead single from the album in June, peaking within the top twenty of the UK Singles Chart. That same month, Donaghy performed on the new stage at the 2003 Glastonbury Festival, coincidentally at the same time the Sugababes performed on the main stage.\n\"Twist of Fate\" was issued as the second single from the album in September 2003, peaking at number 52 on the UK Singles Chart. Revolution in Me was released on 29 September 2003, and peaked at number 117 on the UK Albums Chart. The booklet of the original CD can be folded to make use of nine different album covers. In numerous interviews around the time of the album's release, Donaghy commented on the turkeys seen in the music video for \"Twist of Fate\". She said that this imagery would be more relevant to her upcoming Christmas single, \"Iodine\". \"Iodine\" was scheduled to be released as a single on 8 December 2003. However, Donaghy parted ways with London Records before the single or music video was released. The song was instead released as a free download on her website on December 8, alongside an announcement that Donaghy was working on material for her second studio album.\nA \"Collector's Edition\" of the album, containing b-sides and single versions as bonus tracks, was released in May 2021. This was the first time the album was issued digitally. A 20th anniversary edition was released on CD and vinyl on 8 December 2023. This reissue contained a 16-track bonus disc of b-sides, outtakes and alternate versions. An outtake from the album, \"Pop Illusion\", was released as a promotional single to support the release.\nCritical reception\n|rev2 = RTÉ\n|rev2score =\n|rev3 = Stylus\n|rev3Score = B−\n|rev4 = The Guardian\n|rev4score =\n|rev5 = The Observer\n|rev5score =\n|rev6 = Yahoo! Music\n|rev6score =\n}}\nThe album received positive reviews from music critics upon release. Drowned in Sound praised Donaghy's songwriting, saying Revolution In Me demonstrates \"exactly how much of an influence Donaghy had on the first Sugababes album.\" They went on to compare the two, saying neither were records that one could \"fully digest on first listen.\" They said the album \"makes you work for your pay off and thus will probably be largely overlooked by the masses. The sad thing is, given the proper attention, this could be the album to revitalise the woeful current state of pop music. Instead, it will have to make do with being the pop album of the year for those few in the know.\"\nSimilarly, RTÉ said the album made it \"clear the deeper-thinking Donaghy took the soul\" of the Sugababes \"with her when she left\". Their writer contrasted Revolution in Me to Three, the album the Sugababes released around the same time. They noted that while Three was \"likely to outsell Revolution in Me ten times over\", they said this would be \"a shame\". They praised the quality of songwriting, but said the album was \"difficult to categorise: it's too smart to sit alongside Girls Aloud in the commercial pop world, but it's not quite offbeat enough to be embraced by the indie masses.\" Yahoo! Music said it was \"refreshing to see Donaghy take the road less trodden. It's unlikely to put her at the top of the charts, but then one suspects that was never really the point. More power to her for making a debut that shows flashes of real intelligence and inspiration instead of going for the cheap thrill.\"\nThe Observer described Revolution in Me as a \"fine album\", and a \"rounded meditation on the teenage psyche.\" Stylus praised the quality of the songwriting, performances and production, saying: \"The words are hollow enough to climb inside, and the music is warm enough to keep you there once you're in, acoustic guitars, fathomless beats and skittish electronics binding songs together. And Siobhan, the ancient naïf, with her voice like syrup and cut glass.\" In a mixed review, The Guardian commended the quality of Donaghy's lyricism, saying that her \"unstinting candour provides a welcome edge to a set of songs that sometimes feels neither here nor there.\" However, they went on to lament the lack of \"pop\" refrains, complaining that as \"pleasant as the album is\", the absence of hooks \"may be to its detriment.\"\nTrack listing\n| extra1        =\n| length1       = 3:49\n| title2        = Man Without Friends\n| writer2       =\n| extra2        =\n| length2       = 4:30\n| title3        = Overrated\n| writer3       =\n| extra3        = C. McVey\n| length3       = 4:46\n| title4        = Little Bits\n| writer4       =\n| extra4        = |Kent}}\n| length4       = 5:17\n| title5        = As You Like It\n| writer5       =\n| extra5        = C. McVey\n| length5       = 4:22\n| title6        = Next Human (XY)\n| writer6       =\n| extra6        =\n| length6       = 4:26\n| title7        = Suasex\n| writer7       =\n| extra7        =\n| length7       = 4:28\n| title8        = Twist of Fate\n| writer8       =\n| extra8        = C. McVey\n| length8       = 4:50\n| title9        = Faces\n| writer9       =\n| extra9        = }}\n| length9       = 3:48\n| title10       = Dialect\n| writer10      =\n| extra10       =\n| length10      = 4:27\n| title11       = Revolution in Me\n| writer11      =\n| extra11       = }}\n| length11      = 4:40\n| title12       = Iodine\n| writer12      =\n| extra12       = C. McVey\n| length12      = 4:31\n| total_length  = 53:54\n}}\n| extra_column  = Producer(s)\n| title_width   = 30%\n| writing_width = 47%\n| extra_width   = 23%\n| title13       = Overrated\n| note13        = Radio Edit\n| writer13      =\n| extra13       = C. McVey\n| length13      = 3:42\n| title14       = Thus Far\n| writer14      =\n| extra14       =\n| length14      = 5:52\n| title15       = Those Anythings\n| writer15      =\n| extra15       = Mister\n| length15      = 4:10\n| title16       = Instances\n| writer16      =\n| extra16       =\n| length16      = 4:26\n| title17       = Twist of Fate\n| note17        = Radio Edit\n| writer17      =\n| extra17       = C. McVey\n| length17      = 3:49\n| title18       = Don't Know Why\n| writer18      = Hannah Reese\n| note18        = Live\n| length18      = 5:10\n| title19       = I'm Glad You're Mine\n| writer19      = Al Green\n| note19        = Live\n| length19      = 3:11\n| title20       = Overrated\n| note20        = Single Version\n| writer20      =\n| extra20       = C. McVey\n| length20      = 4:36\n| total_length  = 88:50\n}}\n| extra_column  = Producer(s)\n| title_width   = 30%\n| writing_width = 47%\n| extra_width   = 23%\n| title1        = Pop Illusion\n| writer1       =\n| extra1        = C. McVey\n| length1       = 3:39\n| title2        = Fickle\n| writer2       = Donaghy\n| extra2        = C. McVey\n| length2       = 3:48\n| title3        = Instances\n| writer3       =\n| extra3        =\n| length3       = 4:25\n| title4        = Those Anythings\n| writer4       =\n| extra4        = Mister\n| length4       = 4:09\n| title5        = Thus Far\n| writer5       =\n| extra5        =\n| length5       = 5:51\n| title6        = Don't Know Why\n| writer6       = Reese\n| note6         = Live\n| extra6        =\n| length6       = 5:11\n| title7        = I'm Glad You're Mine\n| writer7       = Green\n| note7         = Live\n| extra7        =\n| length7       = 3:09\n| title8        = Twist of Fate\n| note8         = Original Mix\n| writer8       =\n| extra8        = C. McVey\n| length8       = 4:05\n| title9        = Nothing but Song\n| note9         = Alternative Mix\n| writer9       =\n| extra9        =\n| length9       = 3:57\n| title10       = Dialect\n| note10        = Alternative Mix\n| writer10      =\n| extra10       =\n| length10      = 4:20\n| title11       = Instances\n| note11        = Alternative Mix\n| writer11      =\n| extra11       =\n| length11      = 4:25\n| title12       = Overrated\n| note12        = Single Version\n| writer12      =\n| extra12       = C. McVey\n| length12      = 4:35\n| title13       = Man Without Friends\n| note13        = Alternative Mix\n| writer13      =\n| extra13       =\n| length13      = 4:51\n| title14       = Twist of Fate\n| note14        = Radio Edit\n| writer14      =\n| extra14       = C. McVey\n| length14      = 3:49\n| title15       = Overrated\n| note15        = Radio Edit\n| writer15      =\n| extra15       = C. McVey\n| length15      = 3:40\n| title16       = Pop Illusion\n| note16        = Luke Mornay Great Escape Mix\n| writer16      =\n| extra16       = }}\n| length16      = 7:45\n| total_length  = 71:39\n}}\nNotes\n* \"Nothing but Song\" contains a sample of \"You Don't Know\" by Bob Andy.\n*  signifies a co-producer\n*  signifies an executive producer\n*  signifies an additional producer and remixer\nCredits and personnel\nCredits adapted from the liner notes of the 20th anniversary edition of Revolution in Me.\n* Recorded at Bear Studios (tracks 1, 9 and 11), Eastcote Studios (tracks 2–6, 10 and 12) and Mayfair Studios (tracks 7 and 8)\n* Track 1 mixed by Preetesh Hirji at Bear Studios; all other tracks mixed by Tom Elmhirst at Eastcote Studios (tracks 2–6, 9 and 11), Mayfair Studios (tracks 7 and 12) and Strongroom Studios (tracks 8 and 10)\nMusicians and technical personnel\n* Siobhan Donaghy – vocals\n* Ben Allen – guitars (tracks 8, 10)\n* Steve Barney – drums (track 3)\n* Keith Davey – 2023 reissue artwork\n* John Davies – mastering\n* Wendon Davis – percussion (track 10)\n* Olli Gardner – keyboards (track 10)\n* Chris Hanby – bass (track 10)\n* Preetesh Hirji – synthesizers (tracks 9, 11), strings (track 11), production and mixing\n* Matt Kent – guitars (tracks 1, 2, 4, 5), keyboards and co-production (track 4), programming (track 5), production (track 6)\n* Shawn Lee – guitar, bass and drums (track 2)\n* Jesper Matlsson – bass (track 8)\n* Cameron McVey – beats (track 3), production and executive production\n* Marlon McVey (credited as \"Mister\") – bass, beats and drums (track 1), percussion (track 9), backing vocals and beats (track 11), production and engineering\n* Luke Mornay – mixing and remixing on \"Pop Illusion (Luke Mornay Great Escape Mix)\"\n* Tom Parker – mastering (2023 bonus disc); 2023 reissue project consultant\n* Andy Robertson – drums (track 10)\n* Jeremy Shaw – guitar (tracks 3, 4, 8, 12) bass (tracks 3, 8), keyboards (tracks 3, 4, 12)\n* Paul Simms – beats and keyboards (track 3), production\n* Jeremy Stacey – drums (tracks 3, 8)\n* Jodie Street – programming and additional keyboards (track 5), co-production (track 4), production (track 6)\n* Antti Uusimaki – engineering and mixing on \"Those Anythings\"\n* Rosie Wetters – cello on \"Thus Far\"\nCharts\n{| class=\"wikitable sortable plainrowheaders\" style=\"text-align:center\"\n! scope=\"col\"| Chart (2003)\n! scope=\"col\"| Peakposition\n|-\n!scope=\"row\"|UK Albums Chart (OCC)\n| 117\n|}\n{| class=\"wikitable sortable plainrowheaders\" style=\"text-align:center\"\n! scope=\"col\"| Chart (2023)\n! scope=\"col\"| Peakposition\n|-\n|-\n!scope=\"row\"|UK Record Store Chart\n| 7\n|-\n|}\nReferences"
    }
  ]
}