{
  "content": [
    {
      "type": "text",
      "text": "# Revolution of 8 October 1812\n\n| nongregorian =\n| Deaths =\n| Result = Fall of the First Triumvirate, appointment of the Second Triumvirate\n| URL =\n}}\nThe Revolution of 8 October 1812 () took place during the Argentine War of Independence. Led by José de San Martín and Carlos María de Alvear, it deposed the First Triumvirate and allowed the creation of the Second Triumvirate, which called the Assembly of Year XIII.\nContext\nThe First Triumvirate was a government of three members that ruled Argentina during the Argentine War of Independence, after the fall of the Junta Grande, which had many members. The Triumvirate had a conservative policy, and had removed the radical supporters of the late Mariano Moreno who promoted the May Revolution and managed government the first months. However, a strong royalist conspiracy headed by Martín de Álzaga made them unite forces once more. Álzaga was defeated and executed, but Morenists returned to the political scene.\nThe revolutionary war was reinforced by a number of Argentine-born officers who left Spain when the Peninsular War was nearing a total French victory. The most notable of them were José de San Martín and Carlos María de Alvear. They organized a local wing of the Lodge of Rational Knights from Cádiz, and quickly headed the local military forces.\nRevolution\nBoth the Morenist peoples and the new military group opposed the conservative policy of the First Triumvirate, and wanted a government that fostered the ideas of the Age of Enlightenment, such as the early Primera Junta headed by Moreno.\nThe revolution was caused by the end of the terms of Manuel de Sarratea and Feliciano Chiclana, as Juan Martín de Pueyrredón promoted antimorenist new members, Manuel Obligado and Pedro Medrano. The people organised a riot all across the city, headed by Bernardo de Monteagudo, and attacked the houses of Pueyrredón and Bernardino Rivadavia. At the night of 7 October, a military unit headed by San Martín and Alvear stationed in front of the Buenos Aires Cabildo, in support of the popular request. The Cabildo closed the assembly that was about to elect Obligado and Medrano, and took government again.\nThere were rumors that San Martín or Alvear would be appointed in place of the Triumvirate, but they denied any appointment. They declared that the military did not intervene in the conflict to take the government by force, or to promote someone from their ranks, but to guarantee that the popular will was respected. Thus, the Cabildo elected a new triumvirate, the Second Triumvirate. Nicolás Rodríguez Peña was appointed by 172 votes against 12, Antonio Álvarez Jonte by 147 against 35, and Juan José Paso by 96 against 87. The new triumvirate called the Assembly of Year XIII, a popular request that the First Triumvirate avoided to follow.\nBibliography\n*\nReferences"
    }
  ]
}