{
  "content": [
    {
      "type": "text",
      "text": "# Revolutionary Social Movement\n\n| dissolution =\n| predecessor = La Cagoule\n| ideology = Fascist corporatismFrench fascismAntisemitismAnti-communism Collaborationism\n| position = Far-right\n| country = France\n}}\nThe Revolutionary Social Movement (in French: Mouvement Social Révolutionnaire, MSR) was a fascist movement founded in France in September 1940. Its founders were Eugène Deloncle, who was previously associated with La Cagoule, and Eugène Schueller, owner of the L'Oréal company.\nThe MSR supported the return of Pierre Laval to the Vichy government, led by Petain, who removed Laval from the government in December 1940. The MSR collaborated with and was a factions of the Rassemblement National Populaire (RNP), which was founded in January 1941.\nA split in the RNP came after the Eastern Front opened up in July 1941, and the Legion of French Volunteers Against Bolshevism was formed. Another frontman in the RNP was Marcel Déat, who had the confidence of Laval. When he found out that Deloncle was plotting against him, he had him and his faction removed from the RNP. Deloncle also took many member of the RNP's paramilitary wing with him.\nIn October 1941, Deloncle plotted against seven Parisian synagogues with the help of a local SS officer, Hans Sommer, who provided the explosives for the attack.\nFurther splits in the MSR happened over the next year, as Deloncle became more occupied with the LVF. The other factions then coalesced around Jean Filliol, a former Cagoulard, and revolutionaries Georges Soulès and André Mahé. A coup against the Deloncle faction was completed on 14 May 1942, which left Deloncle without a political future. He was killed two years later in a shootout with the Gestapo, which had suspected him of having obtained ties to the Allies.\nFor a time in 1942, leadership passed to Jean Fontenoy.\nFiliol began plotting against Laval, whose government interned him in October 1942. The remaining Soulès faction of the MSR moved into an anti-German position but disappeared at the end of the war.\nReferences\n*\n*"
    }
  ]
}