{
  "content": [
    {
      "type": "text",
      "text": "# Revolutionary Committee of the Chinese Kuomintang\n\n| native_name      = }}\n| native_name_lang = zh-Hans-CN\n| logo             = Revolutionary Committee of the Chinese Kuomintang emblem.png\n| colorcode        =\n| abbreviation     = RCCK\n| chairman         = Zheng Jianbang\n| founded          =\n| split            = Kuomintang (left-wing faction)\n| headquarters     =\n| newspaper        =\n| membership_year  = 2022\n| membership       = 158,000\n| ideology         = Socialism with Chinese characteristicsChinese nationalismLeft-wing nationalism\n| seats1_title     = National People's Congress (14th)\n| seats1           = }}\n| seats2_title     = NPC Standing Committee\n| seats2           = }}\n| seats3_title     = CPPCC National Committee (14th)\n| seats3           = }} (Seats for political parties)\n| symbol           =\n| flag             =\n| website          =\n| country          = China\n}}\n| mi =\n| bpmf = ㄓㄨㄥ ㄍㄨㄛˊ ㄍㄨㄛˊ ㄇㄧㄣˊ ㄉㄤˇ ㄍㄜˊ ㄇㄧㄥˋ ㄨㄟˇ ㄩㄢˊ ㄏㄨㄟˋ\n| j = zung1 gwok3 gwok3 man4 dong2 gaak3 ming6 wai2 jyun4 wui6\n| ci =\n| altname = Abbreviation\n| c2 = 民革\n| p2 = Mín'gé\n| w2 = Minko\n| tib = ཀྲུང་གོ་གོ་མིན་ཏང་གསར་བརྗེ་ཨུ་ཡོན་ལྷན་ཁང\n| wylie = krung go go min tang gsar brje u yon lhan khang\n| zha = Cunghgoz Gozminzdangj Gwzming Veijyenzvei\n| mong = ᠳᠤᠮᠳᠠᠳᠤᠤᠯᠤᠰ ᠤᠨᠭᠣᠮᠢᠨᠳᠠᠩ ᠤᠨᠬᠤᠪᠢᠰᠬᠠᠯ ᠤᠨᠵᠥᠪᠯᠡᠯ\n| mon = Дундад улсын гоминдангийн хувьсгалын зөвлөл\n| monr =\n| uig = جۇڭگو گومىنداڭ ئىنقىلابىي كومىتېتى\n| uly = Junggo gomindang inqilabiy komitéti\n| uyy = Junggo gomindang inqilabiy komitéti\n| usy =\n| mnc = ᠮᡳᠨᡬᡝ\n| mnc_rom = Ming'e\n}}\nThe Revolutionary Committee of the Chinese Kuomintang (RCCK; also commonly known, especially when referenced historically, as the Left Kuomintang or Left Guomindang), commonly abbreviated in Chinese as Minge (), is one of the eight minor democratic parties in the People's Republic of China under the direction of the Chinese Communist Party.\nIt was founded in January 1948, during the height of the Chinese Civil War, by members of the left-wing of the Kuomintang (KMT), especially those who were against Chiang Kai-shek's policies. The first chairman of the party was General Li Jishen, a senior Nationalist military commander who had many disputes with Chiang over the years, while Soong Ching-ling (the widow of Sun Yat-sen) was named Honorary Chairwoman. Other early leading members were Wang Kunlun, Cheng Qian, He Xiangning and Tao Zhiyue. The party claims to be the true heir of Sun Yat-sen's legacy and his Three Principles of the People. In December 2022, the party had around 158,000 members. Its membership mostly consists of people with historical ties to the KMT and Taiwan.\nAmong the official political parties of the People's Republic of China, the Revolutionary Committee is officially ranked second after the CCP, being the first-ranking minor party. It also owns numerous assets, some formerly owned by the Kuomintang, throughout mainland China. The Revolutionary Committee operates a range of party-owned institutions, such as party schools. The RCCK currently has 41 seats in the National People's Congress, six seats in the NPC Standing Committee and 65 seats in the Chinese People's Political Consultative Conference. Its current chairman is Zheng Jianbang.\nHistory\nAfter the end of World War II, the relationship between the Kuomintang and the CCP, who had allied to fight the Japanese, became increasingly tense; ultimately, both sides restarted the civil war, which World War II had interrupted. In 1945 and 1946, members of the Kuomintang's left formed the Three Principles of the People Confederation of Comrades and the Kuomintang Democratic Promotion Association in Chongqing and Guangzhou, respectively.\nIn November 1947, the first joint representative meeting of the Kuomintang left was held in Hong Kong; on 1 January 1948, the meeting announced the official establishment of the \"Chinese Kuomintang Revolutionary Committee\", and nominated Soong Ching-ling, the widow of Sun Yat-sen, as the Honorary Chairwoman of the Revolutionary Committee (despite Soong Ching-ling never formally joining the commission).\nChairman Li Jishen, He Xiangning, and Feng Yuxiang were selected as the central leadership of the organization. In 1949, Li Jishen and other representatives of the RCCK were invited by the CCP to participate in Chinese People's Political Consultative Conference.\nPeople's Republic of China\nAfter the founding of the People's Republic of China in October 1949, members of the Chinese Kuomintang Revolutionary Committee maintained positions in the municipal and central governments.\nIn November 1949, the second congress of the Chinese Kuomintang Revolutionary Committee was held in Beijing. At the second congress, the Chinese Kuomintang Revolutionary Committee, Chinese Nationalist Democratic Promotion Association, the Comrades of the Three Peoples Principles, and other members of the Kuomintang's left wing agreed to merge and form the Revolutionary Committee of the Chinese Kuomintang.\nSoong Ching-ling served as the Vice Chairwoman of the People's Republic of China and Honorary Chairwoman of the People's Republic of China. Li Jishen served as Vice Chairman of the Central People's Government and Vice Chairman of the Central Military Commission.\nToday, the Revolutionary Committee of the Chinese Kuomintang focuses on improving relations with the Kuomintang on Taiwan, and its membership mainly consists of the descendants of Kuomintang revolutionaries. It recruits members with current ties to Taiwan who support Chinese unification.\nOrganization\nThe RCCK is one of the eight minor so-called \"democratic parties\" under the leadership of the CCP. The highest body of the RCCK officially is the National Congress, which is held every five years. The 14th National Congress, held in December 2022, was the most recently held party congress. The National Congress elects the Central Committee of the RCCK.\nAccording to its constitution, the RCCK is officially committed to socialism with Chinese characteristics and upholding the leadership of the CCP. Among the official political parties of the PRC, the RCCK is officially ranked second after the CCP, being the first-ranking minor party.\nCentral Committee\nThe Central Committee of the RCCK is the highest body of the RCCK between National Congresses. It has six working departments:\n* General Office\n* Organization Department\n* Propaganda Department\n* Liaison Department\n* Social Services Department\n* Research Department.\nThe Central Committee additionally owns the newspapers Unity Daily () and Unity (). The Central Committee is headed by a chairperson, who is assisted by several vice chairpersons. The current leaders of the RCCK are:\nRCCK Central Committee Chairman\n* Zheng Jianbang, also a vice chairman of the Standing Committee of the National People's Congress\nRCCK Central Committee Vice Chairpersons\n* He Baoxiang (First-ranking)\n* Liu Jiaqiang\n* Li Huidong\n* Tian Hongqi\n* Wang Hong\n* Feng Gong\n* Wu Jing\n* Ouyang Zehua\n* Gu Zhenchun\n* Chen Xingying\nMembership\nAccording to the State Council Information Office, the RCCK consists \"mainly of people who have links with the KMT, have historical and social connections with the committee, or have relationships with Taiwan compatriots, along with specialists in social and legal affairs, and in business relating to agriculture, rural areas, and rural people\". In December 2022, the party had around 158,000 members.\nHistorical leaders\nChairpersons of the Central Committee\n{| class=\"wikitable\" style=\"text-align: center; border-collapse: collapse;\"\n!No.\n! colspan=\"2\" width=\"150\" |Chairperson\n! width=\"140\" align=\"center\" |Took office\n! width=\"140\" align=\"center\" |Left office\n!\n|-\n!1\n| align=\"center\" |\n| align=\"center\" |\n| align=\"center\" |January 1948\n| align=\"center\" |October 1959\n|\n|-\n!2\n| align=\"center\" |\n| align=\"center\" |\n| align=\"center\" |August 1960\n| align=\"center\" |1 September 1972\n|\n|-\n!3\n| align=\"center\" |\n| align=\"center\" |\n| align=\"center\" |October 1979\n| align=\"center\" |30 April 1981\n|\n|-\n!4\n| align=\"center\" |\n| align=\"center\" |\n| align=\"center\" |9 September 1981\n| align=\"center\" |23 August 1985\n|\n|-\n!5\n|\n|\n|September 1985\n|December 1987\n|\n|-\n!6\n| align=\"center\" |\n| align=\"center\" |\n| align=\"center\" |December 1987\n| align=\"center\" |December 1992\n|\n|-\n!7\n|\n|\n|December 1992\n|2 February 1996\n|\n|-\n!8\n| align=\"center\" |\n| align=\"center\" |\n| align=\"center\" |11 November 1996\n| align=\"center\" |15 December 2007\n|\n|-\n!9\n| rowspan=\"1\" align=\"center\" |\n| rowspan=\"1\" align=\"center\" |\n| align=\"center\" |15 December 2007\n| align=\"center\" |18 December 2012\n|\n|-\n!10\n|\n|\n|18 December 2012\n|18 March 2018\n|\n|-\n!11\n| rowspan=\"1\" align=\"center\" |\n| rowspan=\"1\" align=\"center\" |\n| align=\"center\" |10 December 2022\n| align=\"center\" |Incumbent\n|\n|}\nHonorary Chairpersons of the Central Committee\n# Song Qingling (), 1948–1949\n# Qu Wu (), 1988–1992\n# Zhu Xuefan (), 1992–1996\n# Hou Jingru (), 1992–1994\n# Sun Yueqi (), 1992–1995\nChairpersons of provincial committees\n* Han Youwen (), Chairman of the Xinjiang Branch until 1998\nElectoral history\nNational People's Congress elections\n{| class=\"wikitable\"\n! Election year\n! Number of seats\n|-\n| 2017–18\n| }}\n|-\n| 2022–23\n| }}\n|}\nSee also\n* Politics of China\n* Left Socialist-Revolutionaries\nReferences\nExternal links\n*"
    }
  ]
}