{
  "content": [
    {
      "type": "text",
      "text": "# Revolutionary Road (film)\n\n| based_on       =\n| screenplay     = Justin Haythe\n| starring       =\n| music          = Thomas Newman\n| cinematography = Roger Deakins\n| editing        = Tariq Anwar\n| studio         =\n}}\n| distributor    = Paramount Pictures\n| released       =\n| runtime        = 119 minutes\n| country        =\n| language       = English\n| budget         = $45 million\n| gross          = $79.5 million\n}}\nRevolutionary Road is a 2008 romantic drama film directed by Sam Mendes and written by Justin Haythe, based on the 1961 novel of the same name by Richard Yates. It stars Leonardo DiCaprio and Kate Winslet as Frank and April Wheeler, with Michael Shannon, Kathryn Hahn, David Harbour, and Kathy Bates in supporting roles. Set from the late 1940s to the mid-1950s, the film portrays the Wheelers' struggle to cope with their personal problems and the ensuing breakdown in their marriage. Revolutionary Road is the second onscreen collaboration for DiCaprio, Winslet, and Bates, all of whom previously co-starred in 1997's Titanic. The film soundtrack was composed by Thomas Newman, his fourth collaboration with Mendes.\nDevelopment of the film adaptation began in 1961. However, a lack of commercial prospects and disagreements with the screenplay caused the project to be in limbo until the 2000s. BBC Films eventually purchased the film rights to the novel and Haythe rewrote the screenplay. Winslet read the script and persuaded her then-husband Mendes to direct, and DiCaprio to play the role of Frank.\nRevolutionary Road was theatrically released in the United States on December 26, 2008, by Paramount Pictures. The film grossed over $79.5 million worldwide and received positive reviews from critics, who mostly praised the performances of Winslet, DiCaprio, and Shannon, as well as its faithfulness to the novel. At the 81st Academy Awards, the film earned three nominations: Best Supporting Actor for Shannon, Best Art Direction, and Best Costume Design. It also received four nominations at the 62nd British Academy Film Awards and four nominations, including Best Motion Picture – Drama, at the 66th Golden Globe Awards, with Winslet winning Best Actress.\nPlot\nIn 1948, longshoreman Frank Wheeler meets April at a party. He is hoping to be a cashier and she wants to be an actress. Frank later secures a sales position with Knox Machines, and he and April marry. The Wheelers move to 115 Revolutionary Road in suburban Connecticut when April becomes pregnant.\nThe couple become friends with their realtor Helen Givings, her husband Howard, and neighbors Milly Campbell and her husband Shep. To their associates, the Wheelers are the perfect couple, but their relationship is troubled. April is not successful at acting, while Frank hates his tedious job. On his 30th birthday, Frank invites a secretary at work, Maureen Grube, out for a drink, and they afterwards have sex. Meanwhile, Helen asks April if she and Frank will meet her son John, who had been in an insane asylum, and thinks the younger couple may be able to help her son with his condition. April accepts.\nWanting to escape their suburban existence and a chance to support the family so Frank can find his passion, April suggests starting a new life in Paris, France. Frank initially balks, but becomes convinced. Over the next several weeks, the Wheelers tell their acquaintances about their plans, but only John seems to understand their desire to leave the U.S. As the couple prepare to move, Frank is offered a promotion, and April becomes pregnant again. When Frank discovers she is contemplating having an abortion, the couple have an argument. April claims they had their second child only to prove the first was not a \"mistake\". The next day, Frank takes the promotion and tries to accept his uneventful life. At the end of an evening at a jazz bar with the Campbells, Shep and April end up alone together. She confides her depression over the canceled Paris plans and her life in general, and the two end up having sex in the car. Shep professes his long-held love for April, but she rejects his interest.\nThe following day, Frank confesses to his affair, hoping to reconcile with April. To his surprise, April apathetically says it does not matter, as she no longer loves him, which he does not believe. When the Givings come for dinner, Frank announces plans have changed because April is pregnant. John lambasts Frank for crushing April's hope, as well as him accepting his circumstances. Angered, Frank nearly attacks John, and the Givings leave. Afterwards, Frank and April have an argument, and April leaves the house to think.\nFrank spends the night in a drunken stupor. The next morning, he is shocked to find April in the kitchen, calmly making breakfast as if nothing had happened. Frank, unsure how to react, eats with her, then leaves for work. April goes to the bathroom, where she performs a vacuum aspiration abortion on herself. Afterwards, she starts to bleed and calls an ambulance. Frank arrives at the hospital, distraught, and is comforted by Shep. April dies in the hospital from blood loss. A guilt-ridden Frank moves to the city to sell computers and spend his spare time with his children.\nA new couple, the Braces, buys the Wheeler's old home. While Milly and Shep have dinner with the Braces, Milly tells them about Frank and April. Shep walks out, crying; he asks Milly to never mention the Wheelers again. Years later, Helen tells her husband that the Braces seem to be the best-suited couple for the Wheelers' old house. When Helen starts talking about why she disliked Frank and April, her husband turns off his hearing aid.\nCast\nProduction\nDevelopment and casting\nIn 1961, following the publication of Richard Yates' novel, director John Frankenheimer considered making the film, but opted to make The Manchurian Candidate instead. Samuel Goldwyn Jr. expressed an interest in the film adaptation, but others in his studio told him that it lacked commercial prospects. Then in 1965, producer Albert S. Ruddy bought the rights but disliked the ending to the novel, and wanted to obscure April's death with \"tricky camerawork\". He became involved in adapting The Godfather and, five years later, while a writer-in-residence at Wichita State University, Yates offered to adapt his work for the screen. Ruddy was occupied by other projects at the time and demurred, eventually selling the rights to actor Patrick O'Neal. The actor praised the book and spent the rest of his life trying to finish a workable screenplay. Yates read O'Neal's treatment of his novel and found it \"godawful\", but O'Neal refused the writer's repeated offers to buy back the rights to the novel. Yates died in 1992, O'Neal two years later.\nThe project remained in limbo until 2001 when actor Todd Field expressed interest in adapting it for the screen. However, when told by the O'Neal estate he would be required to shoot O'Neal's script as written, Field changed his mind and went on to direct Little Children instead. Producer David Thompson eventually purchased the rights for BBC Films. In March 2007, BBC Films established a partnership with DreamWorks, and the rights to the film's distribution were transferred to DreamWorks' owner, Paramount Pictures. On February 14, 2008, Paramount's other division, Paramount Vantage, announced that it was \"taking over distribution duties on Revolutionary Road\", but the distribution rights reverted to Paramount Pictures when Paramount folded the production and moved the distribution and marketing operations of Paramount Vantage into the main studio. The BBC hired Justin Haythe to write the screenplay because, according to the screenwriter, he was \"hugely affordable\".\nKate Winslet received the screenplay from her agent, and then read the novel. She was impressed and even met with O'Neal's widow, Cynthia O'Neal, and discussed the film adaptation. Winslet sent the script to producer Scott Rudin, who suggested that her then-husband Sam Mendes would be perfect as director. Winslet gave Mendes Yates' novel and said, \"I really want to play this part.\" He read Haythe's script and then the book in quick succession. Haythe's first draft was very faithful to the novel, using large parts of Yates' own language, but Mendes told him to find ways to externalize what Frank and April do not say to each other.\nWinslet sent the script to friend Leonardo DiCaprio, and persuaded him to take the part of Frank. DiCaprio was intrigued by the 1950s era and complexities of marriage; \"The dynamic between Frank and April is so powerful and realistic, you feel like you're a fly on the wall watching an intimate relationship disintegrate,\" he said. DiCaprio said that he saw his character as \"unheroic\" and \"slightly cowardly\", and that he was \"willing to be just a product of his environment\". On April 24, 2007, it was announced that Kathy Bates had joined the cast, along with David Harbour, Michael Shannon and Zoe Kazan. Kazan said she fought hard for the role of Maureen Grube, despite objections from casting director Debra Zane who thought she was too young.\nTo prepare for the role, Winslet read The Feminine Mystique by Betty Friedan. She said, \"The hardest thing about playing April, honestly, was making a very specific choice to not have her being as mannered as she is in the book. In the book, she's very, very highly strung and sometimes hysterical. She feels like a string that's literally going to snap at any moment.\" DiCaprio prepared for the role by watching several documentaries about the 1950s and the origin of suburbs. He and Winslet have been reluctant since Titanic to co-star in projects that show them in a romantic relationship. DiCaprio said they \"just knew it would be a fundamental mistake to try to repeat any of those themes\".\nFilming\nIn mid-2007, the cast rehearsed for three and a half weeks before principal photography and shot mostly in sequence and on location in Darien, Connecticut. Mendes wanted to create a claustrophobic dynamic on set, so he filmed the Wheeler home interiors in a real house. The property, including the neighbor's house, were very small but featured 1950s-style architecture. The homeowners gave permission for DreamWorks to dismantle and remodel the interior and exterior. Around 45 tradespeople were involved with the transformation, including carpenters, interior designers and landscapers. Production designer Kristi Zea and her team had five weeks to renovate the homes. \"We wanted to keep the sense of isolation that was described in the book\", Zea said. Debra Schutt served as a set decorator, and said, \"We ruled out anything with bright colors and anything that hit you over the head with the period. The look is really quite plain\".\nwas meticulous with the home's interior lighting.]]\nCinematographer Roger Deakins, who previously worked on Mendes' Jarhead, shot with a combination of jib and handheld camera equipment. Deakins analyzed the use of every light fixture in the house; Schutt recalls \"he's quite specific about what he wants. For instance, for the night scene by the side of the road, he wanted streetlights that would give a rectangular, tapered light, and for an argument in the Wheelers' front room, he wanted a ceiling fixture that would send light down and out in a fan shape with a hard edge\". Period streetlights and automobiles were also fitted with specific light bulbs by the art department. Deakins found it difficult at times working in a small, shaded house with bulky camera equipment. Nevertheless, Winslet was impressed with his ability to \"bounce light all over\" using Arri Compact HMI lamps. To gradually illustrate the home's neglect and Wheelers' collapsing marriage, the crew removed props in the house and Deakins transitioned to handheld cameras, respectively. Mendes said, \"I wanted a real rawness in Leo and Kate's performances in the last half-hour of the movie, and when we reached that point, I told Roger I didn't want to make any decisions [about shots]; I wanted it to be handheld, and I wanted to let the actors be explosive and unpredictable\".\nRecalling the on-set atmosphere, Michael Shannon said that he did not feel that there were any \"stars\", but \"a group of people united by a passion for the material and wanting to honor the book\". He said Winslet and DiCaprio could only make such a good performance as a couple because of their friendship since Titanic. For Shannon, it was more important to prepare for the moment when he walked on the set than being concerned about the actors he was working with. In the fight scenes between DiCaprio and Winslet, DiCaprio said, \"So much of what happens between Frank and April in this film is what's left unsaid. I actually found it a real joy to do those fight scenes because finally, these people were letting each other have it\". Winslet described her working relationship with DiCaprio as \"challenging\" and \"physically comfortable\", but she also felt \"pressure\" working with him, and working with her then-husband Mendes. She added, \"the on-set atmosphere was very fluid in that way in that we'd all share ideas [...] without treading on each other's toes\". DiCaprio found the filming process physically and emotionally exhausting, that he postponed his next film for two months.\nOnce filming was complete, Deakins had the film negative (Kodak Vision2 200T 5217 and 500T 5218) processed at DuArt Film and Video in New York, one of his favorite laboratories in the area. During post-production, handled by EFILM, Mendes deleted around 20&nbsp;minutes of footage to keep it in the spirit of Yates' novel.\nMusic\nThomas Newman composed the soundtrack for Revolutionary Road; it is his fourth film score collaboration with Mendes. Consisting of fifteen tracks, Newman uses a variety of piano, strings, metallic sound effects and basslines for a haunting minimalist sound. The music was recorded at Newman Scoring Stage in Los Angeles and the album was released on December 23, 2008.\nRelease\nHome media\nRevolutionary Road was released on DVD and Blu-ray on June 2, 2009. The Blu-ray edition includes an audio commentary by Mendes, 26-minutes of deleted scenes, and two documentaries on the development of the project.\nReception\nBox office\nRevolutionary Road premiered in Los Angeles on December 15, 2008, followed by a limited U.S. release on December 26, 2008, and then a wider release (1,058 theaters) on January 23, 2009. In most other countries, it was released between January 15–30, 2009. The film earned $22.9&nbsp;million at the domestic box office and $56.7&nbsp;million internationally for a moderate worldwide total of $79.6&nbsp;million\n| source = —Kenneth Turan of the Los Angeles Times\n}}\nRevolutionary Road received generally positive reviews from critics. On the review aggregator Rotten Tomatoes, the film has an approval rating of 67% based on 215 reviews, with an average score of 6.60/10. The website's critical consensus reads, \"Brilliantly acted and emotionally powerful, Revolutionary Road is a handsome adaptation of Richard Yates' celebrated novel\". On Metacritic, the film has a weighted average score of 69 out of 100, based on 38 critics, indicating \"generally favorable reviews\".\nRex Reed of The New York Observer gave the film a positive response; \"a flawless, moment-to-moment autopsy of a marriage on the rocks and an indictment of the American Dream gone sour\" and \"a profound, intelligent and deeply heartfelt work that raises the bar of filmmaking to exhilarating\". Peter Travers of Rolling Stone called the film \"raw and riveting\" and commented, \"Directed with extraordinary skill by Sam Mendes, who warms the chill in the Yates-faithful script by Justin Haythe, the film is a tough road well worth traveling ... DiCaprio is in peak form, bringing layers of buried emotion to a defeated man. And the glorious Winslet defines what makes an actress great, blazing commitment to a character and the range to make every nuance felt\". Writing for the San Francisco Chronicle, Mick LaSalle said, \"Finally, this is a movie that can and should be seen more than once. Watch it one time through her eyes. Watch it again through his eyes. It works both ways. It works in every way. This is a great American film\".\nRoger Ebert of the Chicago Sun-Times gave Revolutionary Road a maximum rating of four stars, commending the acting and screenplay and calling the film \"so good it is devastating\". Of DiCaprio and Winslet, he said, \"they are so good, they stop being actors and become the people I grew up around\". ''Entertainment Weekly's'' Owen Gleiberman graded the film B+ and commented, \"The film is lavishly dark—some might say too dark—yet I'd suggest it has a different limitation: For all its shattering domestic discord, there's something remote and aestheticized about it. April brings a private well of conflict to her middle-class prison, but Winslet is so meticulous in her telegraphed despair that she intrigues us, moves us, yet never quite touches our unguarded nerves\". Joe Neumaier of the New York Daily News said:\n}}\nSome film critics gave a mixed response. David Ansen of Newsweek opined that it is \"impeccably mounted—perhaps too much so. Mendes [...] has an innately theatrical style: everything pops off the screen a little bigger and bolder than life [...] Instead of losing myself in the story, I often felt on the outside looking in, appreciating the craftsmanship, but one step removed from the agony on display. Revolutionary Road is impressive, but it feels like a classic encased in amber\". Kirk Honeycutt of The Hollywood Reporter described the film as a \"didactic, emotionally overblown critique of the soulless suburbs\", and thought it was a repeat of American Beauty. He wrote, \"Once more, the suburbs are well-upholstered nightmares and its denizens clueless—other than one estranged male. Everything is boldly indicated to the audience from arch acting styles to the wink-wink, nod-nod of its design. Indeed his actors play the subtext with such fury that the text virtually disappears. Subtlety is not one of Mendes' strong suits\".\nWriting for Variety magazine, Todd McCarthy thought the film was \"faithful, intelligent, admirably acted, superbly shot\". He added, \"It also offers a near-perfect case study of the ways in which film is incapable of capturing certain crucial literary qualities, in this case the very things that elevate the book from being a merely insightful study of a deteriorating marriage into a remarkable one [...] Even when the dramatic temperature is cranked up too high, the picture's underpinnings seem only partly present, to the point where one suspects that what it's reaching for dramatically might be all but unattainable—perhaps approachable only by Pinter at his peak.\" McCarthy later changed his opinion, calling Revolutionary Road \"problematic\" and that it \"has some issues that just won't go away\". He concludes that Revolutionary Road suffers in comparison to Billy Wilder's The Apartment and Richard Quine's Strangers When We Meet because of its \"narrow vision\", even arguing that the television series Mad Men handles the issues of conformity, frustration, and hypocrisy \"with more panache and precision\".\nTop ten lists\nThe film appeared on several critics' top ten lists of the best films of 2008.\n* 1st – Mick LaSalle, San Francisco Chronicle\n* 2nd – Rex Reed, New York Observer\n* 6th – Peter Travers, Rolling Stone\n* 8th – James Berardinelli, ReelViews\n* 9th – David Denby, The New Yorker\n* No order – Joe Neumaier, New York Daily News\n* No order – Roger Ebert, Chicago Sun-Times (alphabetical top 20 list)\nAwards and nominations\n{| class=\"wikitable\" style=\"font-size:100%\"\n|- style=\"text-align:center;\"\n! colspan=\"5\" style=\"background:#B0C4DE;\" | List of awards and nominations\n|- style=\"text-align:center;\"\n! style=\"background:#ccc;\"| Awards\n! style=\"background:#ccc;\"| Category\n! style=\"background:#ccc;\"| Recipients\n! style=\"background:#ccc;\"| Result\n!\n|-\n| rowspan=\"3\" | Academy Awards\n| Best Supporting Actor\n| Michael Shannon\n|\n| rowspan=\"3\" |\n|-\n| Best Art Direction\n| Debra Schutt and Kristi Zea\n|\n|-\n| Best Costume Design\n| Albert Wolsky\n|\n|- style=\"border-top:2px solid gray;\"\n| rowspan=\"4\" | British Academy Film Awards\n| Best Actress\n| Kate Winslet\n|\n| rowspan=\"4\" |\n|-\n| Best Costume Design\n| Albert Wolsky\n|\n|-\n| Best Production Design\n| Debra Schutt and Kristi Zea\n|\n|-\n| Best Adapted Screenplay\n| Justin Haythe\n|\n|- style=\"border-top:2px solid gray;\"\n| Chicago Film Critics Association Awards\n| Best Supporting Actor\n| Michael Shannon\n|\n|\n|- style=\"border-top:2px solid gray;\"\n| Costume Designers Guild Awards\n| Excellence in Period Film\n| Albert Wolsky\n|\n|\n|- style=\"border-top:2px solid gray;\"\n| rowspan=\"4\" | Detroit Film Critics Society\n| Best Actor\n| Leonardo DiCaprio\n|\n| rowspan=\"4\" |\n|-\n| Best Actress\n| Kate Winslet\n|\n|-\n| Best Supporting Actor\n| Michael Shannon\n|\n|-\n| Best Cast\n|Revolutionary Road\n|\n|- style=\"border-top:2px solid gray;\"\n| rowspan=\"4\" | Golden Globe Awards\n| Best Motion Picture – Drama\n|Revolutionary Road\n|\n| rowspan=\"4\" |\n|-\n| Best Actor – Motion Picture Drama\n| Leonardo DiCaprio\n|\n|-\n| Best Actress – Motion Picture Drama\n| Kate Winslet\n|\n|-\n| Best Director – Motion Picture\n| Sam Mendes\n|\n|- style=\"border-top:2px solid gray;\"\n| rowspan=\"4\" | Houston Film Critics Society Awards\n| Best Actor\n| Leonardo DiCaprio\n|\n| rowspan=\"4\" |\n|-\n| Best Actress\n| Kate Winslet\n|\n|-\n| Best Cinematography\n| Roger Deakins\n|\n|-\n| Best Original Score\n| Thomas Newman\n|\n|- style=\"border-top:2px solid gray;\"\n| London Film Critics Circle Awards\n| Actress of the Year\n| Kate Winslet\n|\n|\n|- style=\"border-top:2px solid gray;\"\n| New York Film Critics Circle Awards\n| Best Actress\n| Kate Winslet\n|\n|\n|- style=\"border-top:2px solid gray;\"\n| rowspan=\"2\" | Online Film Critics Society Awards\n| Best Actress\n| Kate Winslet\n|\n| rowspan=\"2\" |\n|-\n| Best Supporting Actor\n| Michael Shannon\n|\n|- style=\"border-top:2px solid gray;\"\n| Palm Springs International Film Festival\n| Ensemble Cast\n| Leonardo DiCaprio, Kate Winslet, Michael Shannon, Kathryn Hahn, David Harbour, Kathy Bates, Dylan Baker and Zoe Kazan\n|\n|\n|- style=\"border-top:2px solid gray;\"\n| rowspan=\"5\" | Satellite Awards\n| Best Film – Drama\n|Revolutionary Road\n|\n| rowspan=\"5\" |\n|-\n| Best Actor – Motion Picture Drama\n| Leonardo DiCaprio\n|\n|-\n| Best Supporting Actor – Motion Picture\n| Michael Shannon\n|\n|-\n| Best Adapted Screenplay\n| Justin Haythe\n|\n|-\n| Best Art Direction and Production Design\n| Kristi Zea, Teresa Carriker-Thayer, John Kasarda and Nicholas Lundy\n|\n|- style=\"border-top:2px solid gray;\"\n| Screen Actors Guild Awards\n| Outstanding Performance by a Female Actor in a Leading Role\n| Kate Winslet\n|\n|\n|- style=\"border-top:2px solid gray;\"\n| rowspan=\"4\" | St. Louis Gateway Film Critics Association Awards\n| Best Actor\n| Leonardo DiCaprio\n|\n| rowspan=\"4\" |\n|-\n| Best Actress\n| Kate Winslet\n|\n|-\n| Best Supporting Actor\n| Michael Shannon\n|\n|-\n| Best Cinematography\n| Roger Deakins\n|\n|- style=\"border-top:2px solid gray;\"\n| Vancouver Film Critics Circle Awards\n| Best Actress\n| Kate Winslet\n|\n|\n|}\nReferences\nExternal links\n*  ([https://web.archive.org/web/*/http://revolutionaryroadmovie.com/* archive])\n*\n*\n*\n*"
    }
  ]
}