{
  "content": [
    {
      "type": "text",
      "text": "# Revolutionary Mexicanist Action\n\n| native_name_lang = es\n| lang1            =\n| name_lang1       =\n| lang2            =\n| name_lang2       =\n| lang3            =\n| name_lang3       =\n| logo             =\n| logo_size        =\n| logo_upright     =\n| logo_alt         =\n| caption          =\n| colorcode        = gold\n| abbreviation     = ARM\n| leader           = Nicolás Rodríguez Carrasco\n| president        =\n| chairperson      =\n| secretary        =\n| general_secretary =\n| first_secretary  =\n| secretary_general =\n| presidium        =\n| governing_body   =\n| standing_committee =\n| spokesperson     =\n| leader1_title    =\n| leader1_name     =\n| leader2_title    = Leader of Women's Faction\n| leader2_name     = Leonor Gutiérrez\n| leader3_title    =\n| leader3_name     =\n| leader4_title    =\n| leader4_name     =\n| leader5_title    =\n| leader5_name     =\n| founder          = Nicolás Rodríguez Carrasco\n| founded          =\n| registered       =\n| legalised        =\n| banned           = February 27, 1936\n| dissolved        = 1970s\n| merger           =\n| split            =\n| predecessor      =\n| merged           =\n| successor        =\n| headquarters     =\n| newspaper        =\n| think_tank       =\n| student_wing     =\n| youth_wing       =\n| womens_wing      =\n| wing1_title      =\n| wing1            =\n| wing2_title      =\n| wing2            =\n| wing3_title      =\n| wing3            =\n| wing4_title      =\n| wing4            =\n| membership_year  = 1936\n| membership       = ~60,000\n| ideology         = UltranationalismFascismSecularismAnticommunismAntisemitismAnti-democracyXenophobiaSinophobia1940–1970s Faction: Neo-Fascism\n| position         = Third Position\n| national         =\n| regional         =\n| continental      =\n| international    =\n| affiliation1_title =\n| affiliation1     =\n| affiliation2_title =\n| affiliation2     =\n| colors           =  Gold\n| slogan           = Mexico for Mexicans\n| anthem           =\n| blank1_title     =\n| blank1           =\n| blank2_title     =\n| blank2           =\n| seats1_title     =\n| seats1           =\n| seats2_title     =\n| seats2           =\n| seats3_title     =\n| seats3           =\n| seats4_title     =\n| seats4           =\n| symbol           =\n| flag             =\n| flag_title       =\n| flag_alt         =\n| website          =\n| country          = Mexico\n| footnotes        =\n}}\nThe Revolutionary Mexicanist Action (), better known as the Gold Shirts (), was a Mexican fascist, secular, anti-Semitic, anti-communist, ultra-nationalist paramilitary organization, originated in March 10, 1934 in Mexico City and operated until disbanded in 1936. With ultra-nationalist, strikebreaking roots and Nazi German support, the organization sought to expel Chinese, Jews, and communists from Mexico. The organization often violently engaged with labor movements associated with the Mexican Communist Party and with labor strikers.\nIts members were known as the Golden Shirts because most of them were veteran soldiers of Pancho Villa, who referred to his soldiers this way because of the uniform they wore. The term 'Golden Shirts' was never used by the organization, as it was a nickname used by both supporters and detractors of the ARM. However, they did use the term 'Los Dorados' in propaganda and official documents.\nNicolás Rodríguez Carrasco, a brigadier general under Pancho Villa in the 1910s during the Mexican Revolution, led the group during its most active period. Many founding members of the paramilitary had also been veterans of the Mexican Revolution of 1910–1920. Members were known as \"the Gold Shirts\", a name reminiscent of Villa's elite soldiers whom he referred to as \"los dorados\" (the golden ones).\nOperating under the motto of \"Mexico for Mexicans\", the organization called for the expulsion of Jews and Chinese from Mexico. The Gold Shirts advocated the seizure of Chinese- and Jewish-owned businesses. They also fiercely opposed labor movements and often clashed with members of the Mexican Communist Party. The group was very active in union busting, with the Gold Shirts instigating violent clashes with strikers.\nThe organization received financial support from the Nazi Party of Nazi Germany, as well as from the National Fascist Party of Italy, and from Mexican industrialists such as Eugenio Garza Sada (1892–1973). The Gold Shirts also received political protection from ex-president Plutarco Elías Calles (in office from 1924 to 1928), who vehemently opposed the Cárdenas government (in office from 1934 to 1940).\n\"The true fascists of Mexico are the Gold Shirts, they took the fight against communism and the Jews as their flag.”\n[https://de.m.wikipedia.org/wiki/Heinrich_R%C3%BCdt_von_Collenberg ~Heinrich Rüdt von Collenberg], ambassador of the Third Reich in Mexico\nDescription of Clothing and Salute\nMembers of the ARM wear bright golden ranch-style shirts, tied at the waist, with black pants and a palm hat. They wear a red bandana around the neck. On the yellow shirt, there is an embroidered shield of Aztec inspiration called Yaoyotl. Its deeper meaning consists of four half-moons and cotton (Ichcatl) representing agriculture. The Chimalli is made of tiger (jaguar) skin, and the half-moons are gold. The fringes are made of quetzal feather beards, twisted with gold thread. A central band with the letters A.R.M., in the colors of our flag, represents the Dorados' program.\nThe shield of Moctecuhzoma II, the most notable and powerful lord of Pre-Columbian America, from Tenochtitlan to Nicaragua, was the Chimalli with gold half-moons, all decorated with symbols of the god of war.\nTheir organization is divided into branches like infantry and cavalry, and they are supported by a female nursing corps. Many people wonder if this is a brotherhood, a kind of club, or just a ridiculous eccentricity, but there is no doubt that we are dealing with a fascist organization, like those that have recently appeared in Italy and Germany. The very name \"camisas doradas\" (golden shirts) is akin to the blackshirts and brownshirts of those countries. Furthermore, like their counterparts, they employ the tactic of inspiring fear and respect by their mere presence, exhibit an aggressive, crude nationalism, and openly confess anti-communism, constantly resorting to the use of force. Let’s hope the authorities closely monitor the activities of this organization, which mimics the attitudes of Mussolini's fasci di combattimento or Hitler's stormtroopers.\n\"The salute with the right arm, raised with a clenched fist, is the ancient Aztec victory salute.\" Unlike other fascist organizations in the world, the ARM found a salute that characterizes the organization and differentiates it from other parties. This salute was found in ancient culture, which at the time was looked down upon by many Mexicans. The Dorados gave it their own meaning, infused it with mysticism, and it became the \"Call to victory, the call to action to save Mexico, the war salute par excellence.\"\nThis battle pose can be found in various contemporary representations as well as in ancient codices. [Even the Huitzilopochtli (god of war) is depicted raising his arm with his Xiuhcoatl. On some occasions, the uniformed members used a type of club, resembling a macahuitl/mace. This Dorados salute consisted of two steps: first, the hand was placed on the \"Yaoyotl\" shield, and then the right hand was raised with a clenched fist.\nHistory\nBackground (1920s–1933)\nAnti-Chinese and Anti-Semitic sentiment\n[[File:ProrazaDF1930.png|thumb|left|Mexico City [https://es.m.wikipedia.org/wiki/Comit%C3%A9_Pro-Raza Pro-Race Committe]e meeting in 1930]]\nAt the start of the 1920s, racism in Mexico and xenophobic sentiments begun to intensify. Organizations such as the Pro-Race Committee and the Anti-Chinese and Anti-Jewish Nationalist League were created in response to a large influx of immigrants to Mexico. This was a result of growing economic concerns among the Mexican working and middle class. As Chinese-Mexicans, and Jews to a lesser extent, had come to constitute a considerable portion of the merchant class, many protests and boycotts against Chinese businesses were held. Mexican labor unions had put political pressure to restrict Chinese and Jewish immigration to Mexico.\nThe Mexican government, both state and federal, actively enacted and enforced discriminatory laws targeting people of Chinese descent. Following the Great Depression, Jews had become subject to the same type of persecution. Notably in May 1931 where 250 Jewish merchants were expelled from the La Lagunilla Market in Mexico City.\n1930s Labor Strikes\nThe government of President Pascual Ortiz Rubio faced intense political instability, exacerbated by the Great Depression. Droughts and floods heavily impeded agricultural production. By 1932, mass labor strikes in multiple industries were erupting throughout the country.\nPlutarco Elías Calles wished to \"keep workers under control\" in response to the support Vicente Lombardo Toledano had been garnering among laborers. Ortiz Rubio would resign from the presidency in September 1932 as a result of Calles's influence and power in the government.\nGreen Shirts (1932)\nAs the result of labor strikes and the support Toledano had garnered, Calles wished to protect the business interests of industrialists from strikers. Under the protection of a Callista official, if not Calles himself, Nicolás Rodríguez Carrasco founded the Green Shirts (Camisas Verdes) in 1932. Rodríguez Carrasco had joined the Pro-Race Committee a year prior. The Green Shirts were a paramilitary group which was characterized as anti-communist, anti-union, ultranationalist. Calles politically protected and financially supported the group. The Green Shirts's campaigned under the mantra of \"Mexico for Mexicans\". As Calles began to lose power under Abelardo Rodríguez, the group was shortly dissolved by Rodríguez after taking power in September of that year.\nFoundation and early activities (1933–1935)\nThe Revolutionary Mexicanist Action was founded on March 10, 1934, within the Pro-Race Committee of the Federal District. The organization declared its fundamental objective was the moral and aggrandizement of Mexico, stating that their struggle \"was not an offensive against foreigners but rather a defense of national interests.\"\nThe founders and early members were generals and other ex-military men. Prominent members included Nicolás Rodríguez Carrasco, Roque González Garza (instrumental figure during the Mexican Revolution and former acting President of Mexico),  Julio Madero González (brother of Francisco I. Madero and Gustavo A. Madero), Silvestre Terrazas (former Governor of Chihuahua), and Eduardo Dávila Garza (Head of the Mexican Catholic Apostolic Church). Other key members included Ovidio Pedrero Valenzuela and Andrés Morán.\nRoque González Garza led the group for a few months from its foundation until Nicolás Rodríguez Carrasco assumed the position of supreme leader.\n1935 Revolution Day Riot\nTensions between Calles and president Lázaro Cárdenas rose with the latter increasing the suppression efforts of the Gold Shirts. On November 20, 1935, a violent clash between communists and the Gold Shirts during the Revolution Day parade at the Zócalo resulted in 3 deaths and more than 40 injuries of which included Rodríguez Carrasco. Rodríguez Carrasco was stabbed twice in the abdomen and left critically injured.\nPolitical pushback and Ban (1935–1936)\nThe incident sparked nation-wide public outrage against the Revolutionary Mexicanist Actiontion, mainly from labor organizations. The Mexican senate sought to ban the organization a day after the riot. On November 22, senators Ernesto Soto Reyes and Guillermo Flores Muñoz condemned the Gold Shirts for the incident and called for a commission to ban the group. In his speech, Soto Reyes state the organization was composed of \"irresponsible straw-men\" and called into question the legitimacy of the group. He asserted the organization did not represent any union or worker's interests and therefore did not contravene any legal statue by requesting its prohibition.\nDisbandment (1936)\nIn February 1936, the group participated in anti-communist rallies in Monterrey and in Puebla. The Monterrey rally was filmed by fascist film director and Gold Shirts supporter Gustavo Sáenz de Sicilia. Members of the ARM engaged in gunfire with the police, leaving 10 members dead. Following this incident, on February 27, 1936, Cárdenas ordered the dissolution of the group.\nOn February 27, 1936, Cárdenas ordered the dissolution of the group. On August 11, Rodríguez Carrasco was arrested for promoting \"inter-labor conflicts\" and was set to be expelled from the country. He was detained in Pachuca where was driven to an airport and flown to Ciudad Juárez then to El Paso, Texas. Following his exile, Rodríguez Carrasco was classified as a non-threat by the Mexican government.\nOrganization in Exile (1936–1940)\nRodríguez Carrasco moved to Laredo, Texas, with his wife, Leonor Gutiérrez. Rodríguez Carrasco established a Revolutionary Mexicanist Action headquarters in Mission, Texas. Rodríguez Carrasco approached wealthy Texan oilmen whose assets in Mexico were negatively affected by worker strikes and government policies for funds. Other donors he personally received funds from included Reverend P.L. Delgado, William H. Wood, and a wealthy farmer only known as Smithers. Throughout this time, Rodríguez Carrasco drafted numerous manifestos against the Mexican government, Jews, communists, and President Cárdenas in The McAllen Monitor.\nRodríguez Carrasco also met with Henry Allen in 1937. Allen was a prominent figure of an American anti-Semitic fascist group known as the Silver Legion. Allen offered Rodríguez Carrasco protection and both directly received funds from the Nazi Party.\nBy March 1937, Rodríguez Carrasco was receiving $2000 to $3000 a month in donations from American and Mexican nationals alike for the Revolutionary Mexicanist Action. The money was given to contacts that would regularly travel between Brownsville and Nogales.\nApproximately just under a year after moving to Texas, Rodríguez Carrasco met young woman named Emilia Herron. Herron belonged to a very wealthy family El Paso. Herron and Rodríguez Carrasco developed an affair and then divorced his wife Leonor Gutiérrez. Rodríguez Carrasco contacted immigration services to have Gutiérrez deported back to Mexico. A distraught Gutiérrez brought with her a great volume of documents containing sensitive information regarding the Revolutionary Mexicanist Action. She notified the police of Mexico City of Rodríguez Carrasco's activities. She made many public declarations regarding the organization's activities against the government and named many public figures who supported the paramilitary group. This caused serious internal conflicts within the organization with some prominent members no longer supporting Rodríguez Carrasco.\nRebellion Plot (1938)\nSince at least 1935, the organization had been plotting a rebellion against the Mexican government. Carlos Walterio Steinman, a former colonel in the Mexican Army residing in New York, told Rodríguez Carrasco he had raised over 4 million dollars to help in a \"change of government\" in a letter dated July 3, 1935.\nThe Gold Shirts received funds to purchase armament from former governor of San Luis Potosí and very close friend of Rodríguez, Saturnino Cedillo. Cedillo, who by 1937 had close alleged ties to German Nazis, had developed major political and personal grievances with Cárdenas. Cedillo had several private meetings with members of the Revolutionary Mexicanist Action.\nThe Mexican Government had received various reports on Rodríguez Carrasco's plot and purchases of weapons. On January 31, 1938, the rebellion was launched in Tamaulipas, where troops had been already dispatched at the request of Tamaulipas governor Marte R. Gómez. Three Gold Shirts members and one police officer were killed in a day of fighting.\nRodríguez Carrasco's Illness and death (1940)\nFollowing the thwarted rebellion, Rodríguez Carrasco lost a considerable amount of financial support as well as support from the Gold Shirts. He remained exiled in Texas while continuing to publish articles for The McAllen Monitor.\nBy 1940, Rodríguez Carrasco developed a blood illness, most likely aplastic anemia. Following the quick deterioration of his health, Rodríguez Carrasco effectively stepped down as leader of the Gold Shirts. In August 1940, Rodríguez Carrasco requested a pardon from President Cárdenas to be allowed to return to Mexico stating he wished to pass in his mother's house citing his illness. The request was approved and he returned to Mexico on August 5. He died 6 days later on August 11 in his mother's house from his illness.\nPost-Rodríguez Carrasco's Death (1940–1970s)\nSchism (1940s)\nThe inauguration of Manuel Ávila Camacho seemingly ended the Revolutionary Mexicanist Action ban. Following the death of Nicolás Rodríguez Carrasco, two separate factions led by Aniceto López Salazar and Joaquín Rodríguez Carrasco (brother of Nicolás) emerged from the Gold Shirts. Both figures laid claim to be the true heirs of the organization. López Salazar and Joaquin's factions were based in Mexico City and Chihuahua respectively. Joaquín Rodríguez Carrasco's faction retained the organization's original objectives as the more radical and militant members comprised this group. López Salazar's faction was noted to have developed anti-fascist sentiments, less xenophobia and anti-Semitism, while remaining implacably opposed to communism and labor-strikes. This faction also was noted to have been much more amendable with the government with López Salazar consistently publicly disavowing the group's past violent actions. López Salazar and other members of his faction routinely met with government officials to discuss the paramilitary's role in \"maintaining national interests\".\nOn International Workers' Day, 1952, the \"Golden Shirts\" attacked contingents of the Communist Party and the Peasant Workers Party in front of the Palace of Fine Arts in Alameda Central. In the confrontation Luis Morales Jiménez, a student of the IPN, and Lucio Arciniega, a shoemaker artisan, members of the Communist Youth, died.\nBy the 1960s, membership reached 500,000 in Mexico and the United States. A significant amount of members belonged to the Mexican Army or law enforcement. The Mexican government routinely hired the paramilitary group to combat leftwing paramilitaries. However, the group had issues with funds and by the 1970s the Gold Shirts seemed to have dissolved with no notable activity from the Gold Shirts.\nOrganization & structure\nInitially, organizing, directing messages, appointments, as well as basic tasks were all carried out by Rodriguez Carrasco. By May 1934, however, the ARM was divided into 15 zones. The zones were divided throughout the country but mainly in Mexico City. Each of these zones consisted of several groups of 10 to 15 individuals. Each group had a sub-chief who only reported to the zone chief who, in turn, would report to the supreme chief. By 1935, the ARM had 350 group leaders in the 15 zones. At this time, the organization had approximately 4000 members.\nIn the Mexico City chapter, there were a total of 377 members. Many members had been former military which included 14 generals, 7 lieutenant colonels, 13 colonels, 3 majors, 3 captains, 1 first sergeant, 1 lieutenant, a police chief, and a cop. General Vicente Gonzalez, chief of Mexico City's police force, was also in close contact with Rodriguez Carrasco.\nThe headquarters of the Mexicanist Revolutionary Action was in a two-story building used by the organization, the headquarters was located on Calle Justo Sierra 29 in the Historic Center of Mexico City, one street from the Historical Jewish Synagogue. \"A two-story building, in one of the oldest places in the city, overlooking the main headquarters of the ARM, a Mexican fascist party, well armed, with shirts, symbols, salutes and a strong nationalist creed of hatred of Jews and the communists. The entire upper floor is occupied by the offices of the Dorados, the premises must have been rented with a view to future expansion. The house occupied by the Mexicanist Revolutionary Action on Justo Sierra Street was converted into a real one. There were more than a hundred men ready for anything and no less than 500 weapons, as well as clubs and stones, inside the building.\nA medical team was also formed (mostly nurses and male nurses with the Yaoyotl embroidered on their clothing).\nThe organization had a female Section called '''Mexican Nationalist Women's Action in charge of Leonor Gutiérrez''', the first wife of General Carrasco.\nSome other outstanding and very important women within the group and the organization were, Margarita Vda. de Cárdenas, María de la Paz Luque and Teresa Castrejón.\n\"Mexican women have sacred obligations towards the people and the country, for that reason, and because we are golden affiliates of the A.R.M.\" 1936.\nIn 1939 the Mexican Nationalist Women's Action led a protest against abortion led by Victoria Huante.\n“Mexican women cannot remain calm when they see that in a State that is part of a country that prides itself on cult, there is an attempt to denigrate the mission of women, putting them at the level of inferior beings who do not have a clear idea. of what it means for humanity to dignify and honor the creation of new beings.\n1934 Leadership\nThe council of the Gold shirts were known as the Mesa Directiva.\n{| class=\"wikitable\"\n|+ Mesa Directiva Leadership 1934\n|-\n! Name !! Title\n|-\n| Gen. Lucio G Verdiguel  || Secretary General\n|-\n| Manuel Rodriguez Carrasco || Treasurer\n|-\n| Alfredo Serratos || Organization Secretary\n|-\n| Gen. Miguel M Ramos || Secretary of education\n|-\n| Gen. Jose M Sanchez || Secretary of Hacienda\n|-\n| Gen Arturo E Valverde || Secretary of Agriculture\n|-\n|Salvador Diaz F. || Chief of Migration\n|-\n|Gen.  Jose E Solares || Chief Assistant\n|}\nBy 1934, the organization had branches registered in: Villa Union, Mazatlan, Concordia, Culiacan, Saltillo, Torreon, Coahuila, Durango, Chiuahua, Juarez, Toluca, Monterrey, Nuevo León, Nuevo Laredo, Tamaulipas, Sabinas, Hidalgo, Puebla Texmelucan, Tehuacan, Guadalajara, Orizaba, Veracruz, Iguala Guerrero. Each of these chapters had leaders referred to as Chiefs.\n{| class=\"wikitable\"\n|+ Chief of Zones\n|-\n! Name\n|-\n|Jose Vela\n|-\n|Matias Rodriguez\n|-\n|Agapito Lopez\n|-\n|Enrique Backmaann\n|-\n|Primitivo Gonzales\n|-\n|Col. M. Sanchez T.\n|-\n|Manuel Gonzales\n|-\n|Rafael Plata\n|-\n|Jesus Carcia\n|-\n|German Ramirez\n|-\n|Daniel M. Trejo\n|-\n|1st Captain Jose Ramos\n|-\n|Felipe Garcia\n|-\n|Teodoro Buendia\n|-\n|}\nBeliefs\nTheir motto was \"Mexico for the Mexicans,\" a racialized or ethnic group that excluded Mexicans of Jewish or Chinese descent, and those who held anti-fascist political views, supported trade unions, or were communists or socialists. Rodríguez claimed that blood tests carried out by ethnographers showed that Mexicans and Nordic peoples were racially equal. They were fiercely antisemitic and Sinophobic: they demanded the removal of citizenship from and immediate deportation of Jews and Chinese from Mexico, with all their businesses turned over to \"Mexicans.\"\nAlthough the dorados copied their style from the German Blackshirts and Sturmabteilung, the anti-communism and authoritarianism of the former and the antisemitism of the latter, they nonetheless lacked the fascist mission, and were essentially counterrevolutionary and reactionary, and as such were more easily employed by the existing state, according to fascism expert Stanley G. Payne. John W. Sherman, an expert in Mexican right-wing organizations, describes them as \"fascist\" and \"fascist-inspired,\" for their nationalistic, racist, and pro-business beliefs and activities.\nRespect for Hitler\nNicolás Rodríguez, founder of the ARM, said about Adolf Hitler:“Hitler, an insignificant ex-soldier of the world war, but a man of clear vision and an unsuspected love for his homeland; he took in at a glance the great problem of the Jewish danger, matured his plans, and when he found himself master of Germany, he bravely faced the situation and expelled without mercy, in a brilliant and audacious act, all the Jews residing in the Reich.”\nActivities\nThe Gold Shirts often violently clashed with supporters of the Mexican Communist Party and the Red Shirts, including a famous attack on a communist protest in 1935 in Mexico City at the Zócalo. Three people died and over fifty were injured, including Rodríguez. They ransacked communist party offices on various occasions.\nARM members were often hired to intimidate workers or to prevent agrarian reform on haciendas. They attacked workers in Monterrey in 1936 as part of their anti-union activities.\nOn one night in 1936, the Gold Shirts raided Jewish businesses, destroying them and attacking their owners. The protests in response were immediate, highlighting those of the United States embassy, the Mexican Communist Party, and the International Red Aid. The general public described the event as a pogrom.\nSee also\n* Camisas Rojas\n* Gun politics in Mexico\nReferences\nExternal links\n*[http://espejodemudanzas.blogspot.com/2011/02/la-oposicion-en-el-sexenio-cardenista_26.html The opposition in the sixth cardenista (1934–1940) – The Mexican Revolutionary Action: The Golden Shirts]"
    }
  ]
}