{
  "content": [
    {
      "type": "text",
      "text": "# Revolution Is Not a Dinner Party (novel)\n\nRevolution Is Not a Dinner Party is a work of historical fiction written by Ying Chang Compestine and published in 2007. The story is set at the end of the Cultural Revolution in Wuhan, China. The novel is about a young girl from an upper-class family facing persecution and other challenges brought upon the upper class living in communist China.\nThe title is taken from Mao Zedong's 1927 essay Report on an Investigation of the Peasant Movement in Hunan which was widely studied after 1949.\nPlot summary\nRevolution Is Not a Dinner Party begins in 1972, 6 years into the Cultural Revolution in China. Ling Chang is a nine-year-old girl whose parents are doctors which are part of the upper class society in China. When Ling's father, Dr. Chang, had free time, he would teach Ling English and they would listen to American radio shows such as Voice of America. Dr. Chang's colleague from the United States, Dr. Smith, kept close contact with Dr. Chang in the time before the Cultural Revolution via mail.\nA political officer, Comrade Li, moves into part of the Chang's apartment room and conducts his operations from there. With the presence of Comrade Li next door, the Changs were forced to speak about controversial topics in hushed voices and listen to the American radio underneath blankets as well as displaying a revolutionary mindset through putting up pictures of Chairman Mao Zedong and assisting Comrade Li. Shortly after the officer moved in, the father of the Chang's neighbor family is taken away and branded as an antirevolutionary. After this, Ling was fearful her father would be taken as well. Shortly thereafter, the neighbor's mother was taken away as well and their son, Niu, was forced to join the Red Guards.\nMeanwhile, Ling is constantly being harassed at school by children of the working class who believe Ling is bourgeois; Ling's clothing and long hair are constantly used as a means to make her look bourgeois. Ling's family were marked as bourgeois sympathizers and her father was removed from surgery and was forced to work as a janitor at the Wuhan hospital.\nOne day, Ling and her father rescue a counter-revolutionary writer who was trying to commit suicide by drowning himself. Because Ling and Dr. Chang rescued him, Niu and his gang, the Red Guard, came and arrested her father for being an antirevolutionary.\nLing spends nights alone by herself during the night because her mother worked nights in the hospital and her father was no longer there. She became old enough to take over shopping for her mother and began to haggle and barter for food bought with  ration tickets and by any possible means. One day at school the teacher is thrown out and Gao, one of the young revolutionaries, tries to cut her hair. Ling retaliates him with her schoolbag and gets away unscathed.\nShe then receives news that her father will be operating on Gao's father at the hospital. As Ling attempts to sneak into the compound, the guards catch her and throw her into a room with mats that are infected with lice. Ling sleeps on them and gets lice infested in her hair. The next morning, the gardener comes into the room and let her go. When Ling got back to her apartment, her mother had to cut all of her hair.\nChairman Mao dies in 1976, but his death does not bring an end to the bleak lives of the people.  Instead different revolutionary factions begin fighting with each other.  Jiang Qing, Mao's wife, is arrested and accused of plotting to overthrow the government.  A few weeks later, Ling is forced by Comrade Li into a public apology to Gao.  However, before further punishment is inflicted on Ling, Comrade Li is arrested as a revolutionary criminal for his association with Chairman  Jiang Qing.  At the same time, Ling's father is released and Ling, her mother, and Dr. Chang go home together.\nCharacters\n* Ling Chang: Protagonist; daughter of Mr. and Mrs. Chang\n* Dr. Chang: Father of Ling; married to Mrs. Chang; surgeon at Wuhan hospital #4\n* Mrs. Chang: Mother of Ling; married to Dr. Chang; traditional doctor; referred to as Dr. Xiong\n* Niu: Referred to as Ling's \"brother\", Ling's closest friend; son of Mrs. Wong and Dr. Wong\n* Dr. Wong: Fellow physician of Dr. Chang at the hospital; father of Niu and married to Mrs. Wong\n* Mrs. Wong: Mother of Niu and married to Dr. Wong\n* Comrade Li: Revolutionary who lives in Ling's study\n* Gao: Son of Comrade Sin, attends school with Ling\n* Comrade Sin: Father of Gao, revolutionary\n* Chairman Mao: Ruler of the communist People's Republic of China\n* Teacher Hui: Ling's math teacher\n* Yu: Pro-revolutionary girl who attends school with Ling and joins in with Gao in harassing Ling\n* Mr. Ji: Antirevolutionary writer who attempts to commit suicide and is saved by Ling and Dr. Chang\nCritical reception\nRevolution Is Not a Dinner Party was well received among critics for its vivid portrayal of life for the aristocracy in the cultural revolution. Publishers Weekly stated readers \"should remain rapt by Compestine's storytelling throughout this gripping account of life during China's Cultural Revolution,\" and the San Francisco Chronicle declared it \"candid and credible, naive and nuanced.\" The novel has won numerous awards of excellence in literature, including the 2008 ALA Notable Children's Books.\nAwards\n* 77th Annual California Book Award for Young Adult Literature\n* 2008 ALA Best Books For Young Adults\n* 2008 ALA Notable Children's Books\n* 2007 Publishers Weekly Best Children's Fiction Book List\n* 2007 San Francisco Chronicle Best Children's Fiction Book List\n* 2008 Chinese American Librarian Association Best Book\n* 2007 New York Public Library 100 Best Titles for Reading and Sharing\n* 2007 Fall Book Sense Children's Picks\n* 2007 Parent's Choice Silver Honor\n* 2007 Cybils Award Nomination for Young Adult Fiction\n* 2008 Tayshas Reading List (Texas)\n* 2007 Chicago Public Library Best of the Best\n* 2007 Cleveland Public Library Celebrate With Books\n* 2007 Cuyahoga County Public Library Great Books for Kids\n* 2008 Notable Social Studies Trade Book for Young People  — CBC and the National Council for Social Studies\n* 2008 IRA Notable Books for a Global Society\n* 2008 NCTE Award\n* 2008 Capitol Choices  — Best Books of the Year, Washington, D.C.\n* 2008 New York Public Library's Teen Age List\n* 2008 Cooperative Children's Book Center  — Best of the Year\n* 2008 Bank Street College of Education  — Best Children's Book\n* 2008 Notable Children's Book in the Language Arts\n* 2008 Book of the Year Award  — Northern California Independent Booksellers Association\n* 2008 Women's National Book Association's Judy Lopez Memorial Awards Honor\n* 2008–2009 Maine Student Book Award\n* 2008 Notable Children's Books in the English Language Arts\n* 2009 ATPE Book of the Month\n* 2009 Sakura Medal Book\n* 2008–2009 Nominated for the Maine Student Book Award\n* 2008 Among 15 books Ranked Best by Publishers Weekly\n* 2009 Nominated for the Nene Award of Hawaii\n* 2009 Awarded the United States of America Nobel peace prize\nReferences\nExternal links\n* Ying Chang Compestine's Home Page [http://www.yingc.com/]"
    }
  ]
}