{
  "content": [
    {
      "type": "text",
      "text": "# Revolutionary Left Movement (Bolivia)\n\n| logo             =\n| leader           =\n| foundation       = 7 September 1971\n| ideology         = Social democracyLeft-wing nationalism\n| position         = Centre-left to left-wing\n| headquarters     = La Paz\n| regional         = COPPPAL\n| international    =\n| country          = Bolivia\n| dissolved        = 2006|\n}}\nThe Revolutionary Left Movement – New Majority (; MIR–NM) was a social democratic political party in Bolivia whose registration was annulled in 2006 after it failed to achieve the electoral results needed to maintain its official registration. In the elections of 2009, the party did not field any candidates. It was a member of the Socialist International.\nHistory\nThe MIR was founded in 1971 by a merger of a left-wing faction of Bolivia's Christian Democratic Party and the radical student wing of the Revolutionary Nationalist Movement (MNR). It has been led from the beginning by Jaime Paz Zamora. The MIR was becoming influential in the labor movement and politics during the early 1970s, but it was repressed by the government of Hugo Banzer later in the 1970s.\nIn 1978, the MIR joined the left-of-center UDP alliance of former president Hernán Siles Zuazo. After a few years of unstable military rule, Siles Zuazo was proclaimed Constitutional President in 1982, based on the results of the 1980 elections, which had been annulled by general Luis García Meza. The MIR's Jaime Paz Zamora accompanied Dr. Siles as his Vice-President. During the dire economic crisis that coincided with the coming to power of the UDP, Siles became considerably unpopular. At this point (1984), the MIR—led by Vice-President Paz Zamora—left the governing alliance and moved into the opposition. Prior to the 1985 elections, a faction of the party led by Antonio Araníbar left the party on ideological grounds and formed the rival Free Bolivia Movement. The faction of the MIR that remained loyal to Paz Zamora referred to itself as the MIR-New Majority, and espoused a much more moderate program than before, having disassociated itself from Marxist dogmas and any notion of class struggle.\nPresidency\nThe MIR was revitalized when it became one of the most vocal critics of the austerity and neoliberal measures of the president that followed Siles, Víctor Paz Estenssoro of the MNR. After the 1989 elections, the MIR at long last attained the presidency of Bolivia, despite having finished third in the popular vote. Since no party had obtained the 50% majority needed for direct election, Congress was called upon to decide who should be Chief Executive; Paz Zamora got the nod, thanks to a most unlikely alliance with a former enemy, the right-wing candidate General Hugo Banzer. Perhaps limited by this co-governing pact with Banzer (called the Patriotic Accord), President Jaime Paz Zamora followed much of the course set by the MNR, disappointing many former adherents. Following the coalition, MIR again stood independently in the 1997, where Paz Zamora finished third in the presidential elections, the party gaining 7 senators and 23 deputies.\nDecline\nLike the other traditionally dominant parties in Bolivia (such as the MNR and Banzer's Nationalist Democratic Action, or ADN), the MIR suffered a collapse in the early years of the 21st century. One of its most important leaders, Oscar Eid, even went to jail for links to narcotics trafficking, further tarnishing the party. Their support again decreased in 2002, with the rise of Evo Morales' Movement for Socialism, and Paz Zamora finished fourth. The party maintained a reduced local presence in the 2004 elections, winning 132 council seats across 89 communes. Indeed, by this time, the MIR had lost so much support that it chose not to run candidates for the 2005 presidential elections. Instead, it chose to focus its efforts in local and provincial contests, with its leader, Paz Zamora, failing to win the Prefecture of Tarija as part of a joint candidature entitled Regional Convergence. In 2006, the party's official registration was cancelled, due to its failure to achieve sufficient results in previous elections, and in 2009 the party did not stand any candidates.\nReferences"
    }
  ]
}