{
  "content": [
    {
      "type": "text",
      "text": "# Revolutionary Marxist–Leninist League\n\nThe Revolutionary Marxist–Leninist League was a small Maoist political party in Britain.\nThe group was founded in 1968 by a group of students around Abhimanyu Manchanda (partner of Claudia Jones), who had been expelled from the CPGB in 1965 after Manchanda accused the Soviet Union of collaboration with U.S. imperialism in suppressing national liberation movements, including in Vietnam, and of being complicit in the murder of Patrice Lumumba.\nAccording to Diane Langford:Membership of the inner core, the Revolutionary Marxist Leninist League, was not open and could only be acquired by working for some time in one of the ‘front’ groups such as Friends of China or the Britain Vietnam Solidarity Front.  A period of candidate membership followed, and attainment of full acceptance felt like an achievement.  According to Manu, he and Claudia had been aghast at how easy it was to join the Communist Party of Great Britain. Claudia used to make fun of the CPGB,. ‘All you have to do is fill in a form on the back of the Daily Worker (now Morning Star) and you could become a member.’\nThe RMML participated in the Joint Committee of Communists, but suffered two splits the following year: of the Communist Workers League of Britain (Marxist–Leninist), and of the Association of Communist Workers around Harpal Brar. In 1971, a further group left, to found the Marxist–Leninist Workers Association, which later merged via the Communist Unity Association into the Revolutionary Communist League of Britain.\nIn 1977, the group was renamed the Revolutionary Marxist–Leninist Communist League, and it attempted to apply the Three Worlds Theory by working to build anti-Soviet movements in Britain. This did not prove successful, and the group dissolved in 1980.\nReferences\nFurther reading\n*Peter Barberis, John McHugh and Mike Tyldesley, Encyclopedia of British and Irish Political Organizations\n*Diane Langford [http://www.marxists.org/history/erol/uk.secondwave/langford.pdf The Manchanda Connection], Marxist Internet Archive\n*Marx Memorial Library [https://marx.soutron.net/Portal/Default/en-GB/RecordView/Index/59738 Abhimanyu (Manu) Manchanda Collection]\n*  | access-date=2021-07-21}}"
    }
  ]
}