{
  "content": [
    {
      "type": "text",
      "text": "# Revolution (video game)\n\nRevolution is an isometric 3D puzzle video game released by U.S. Gold in 1986 for the ZX Spectrum and Amstrad CPC. It was programmed by Costa Panayi and is a development of the earlier 3D games Highway Encounter and Alien Highway.\nGameplay\nThe player controls a bouncing ball on a series of superimposed levels, each consisting of an array of square tiles that are arranged with a number of puzzles.\nEach puzzle consists of two black cubes that turn temporarily white when touched by the player's ball, before turning black again. To solve the puzzle, both cubes must be touched in rapid succession so that they turn white simultaneously.\nThere are nine levels. When all the puzzles on one level are complete, the player ascends to the next.\nThe height of the ball's bounce is controlled by the \"fire\" button, while the direction controls steer it around the map. The player must make sure not to fall off the edge of the level, or through the gaps between tiles.\nFlying platforms, conveyor belts, adhesive surfaces, spiked balls, and other structures may help or hinder the player in their attempt to solve the puzzles.\nThe player has five balls. There is also a time limit that must be beaten.\nBackground\nMark Haigh-Hutchinson:\nThe result of Costa's efforts was REVOLUTION, an abstract isometric puzzle game. It was designed with lastability in mind - each time the game starts the puzzles are shuffled between levels as well as their locations within the level.\nShifting the puzzles around and creating a new landscape, or set of levels, each time you start play - it's trying to make the game something more than other games on the market' Luke [Andrews] would say at the time.\nEven with our old games, you always had the first level, second level, third level, and so on. ALIEN HIGHWAY, the remix of HIGHWAY ENCOUNTER started us thinking that way, and with REVOLUTION I think the changes in the puzzle and landscapes are the main attraction. If someone picks up the game and can't get past the first level, then the game can be played on level one and the player still gets thirty new puzzles so you can still enjoy it, even if you never get past the first level!\nReception\n* Your Sinclair: \"Yet another cracker from Costa Panayi...\"\n* Sinclair User: \"A brilliant game with masses of tortuous puzzles, set in an abstract landscape. Think, not zap\".\nReferences\nExternal links\n*"
    }
  ]
}