{
  "content": [
    {
      "type": "text",
      "text": "# Revolutionary Palestinian Communist Party\n\n| logo             = file:شعار الحزب الشيوعي الفلسطيني-الثوري.svg\n| name             = Revolutionary Palestinian Communist Party\n| native_name      =\n| foundation       = October 1982\n| ideology         = Communism\n| national         = Alliance of Palestinian Forces\n| country          = Palestine\n| founder          = Arabi Awwad\n| split            = Jordanian Communist Party\n}}\nThe Revolutionary Palestinian Communist Party () is a small Palestinian political party, founded in October 1982. Arabi Awwad was the general secretary of the party. As of the early 2000s, the party headquarters were in Damascus. The party calls for the establishment  of an independent Palestinian state on \"all national soil\" through armed struggle.\nThe RPCP emerged from a split in the West Bank branch of the Jordanian Communist Party in 1982, over the issue of recognizing the State of Israel. The moderates formed the Palestinian Communist Party, which adhered to the Soviet line of recognizing Israel. The radical group, led by former West Bank party secretary Awwad, formed the Revolutionary Palestinian Communist Party. The RPCP joined the PLO. The party supported the Palestinian National Alliance, but did not formally join it. Apart from Awwad, other politburo members of the party included Jiryis Qawwas and Abdullah Nimr.\nThe RPCP took part in the armed resistance against the Israeli invasion in Lebanon; a number of party members (including Awwad's son Fahd Awwad) were killed during this struggle.\nThe RPCP broke away from the PLO in 1987, in rejection of what they saw as rapprochement by Yasser Arafat with imperialist forces (notably, the Palestinian Communist Party joined the PLO just afterwards). The party vehemently opposed the Oslo Accords. In the early 1990s, the RPCP disbanded its armed wing (after a long period of inactivity). In 1994 the RPCP joined the Alliance of Palestinian Forces.\nThe party argues that the armed Syrian opposition is supported by colonialist, Zionist and reactionary forces.  These are said to be seeking to weaken the Arab states in order to dominate the region. Awwad died in March 2015.\nReferences"
    }
  ]
}