{
  "content": [
    {
      "type": "text",
      "text": "# Revolution of Maria da Fonte\n\nThe Revolution of Maria da Fonte, or Revolution of the Minho, is the name given to a popular revolt in the spring of 1846 against the Cartista government of Portugal (presided over by António Bernardo da Costa Cabral, 1st Marquess of Tomar).  The revolt resulted from social tensions remaining from the Liberal Wars, exacerbated by great popular discontent generated by new military recruitment laws, fiscal alterations and the prohibition on burials inside churches.  It began in the area of Póvoa de Lanhoso (Minho) by a popular uprising that little by little extended to the whole north of Portugal.  The instigator of the initial riots was a woman called Maria, native of the freguesia of Fontarcada, who would become known by the nickname of Maria da Fonte.  As the initial phase of the insurrection had a strong female element, she ended up giving her name to the revolt.  The uprising afterwards spread to the remainder of the country and provoked the replacement of the government of Costa Cabral by one presided over by Pedro de Sousa Holstein, 1st Duke of Palmela.  When queen Maria II dismissed that government in a palace coup, known as the Emboscada (Ambush), on October 6 that year, and instead nominated marshal João Francisco de Saldanha Oliveira e Daun, 1st Duke of Saldanha to form a new one, the insurrection was reignited.  The result was a civil war of 8 months, known as the Patuleia, that was only ended by the signing of the Convention of Gramido on 30 June 1847, after the intervention of foreign military forces from the Quadruple Alliance.\nReferences\n*Bonifácio, Maria de Fátima, História da Guerra Civil da Patuleia 1846-1847, Editorial Estampa, Lisbon, 1993 ()\n*Capela, José Viriato; Borralheiro, Rogério, A Revolução do Minho de 1846 e as reformas da administração. In: CONGRESSO DA MARIA DA FONTE, 150 ANOS, Póvoa de Lanhoso, 1996, História da Coragem Feita com Coração: Actas. Póvoa de Lanhoso, City Hall, 1996, pp.&nbsp;169–184.\n*Castelo Branco, Camilo, Maria da Fonte, Lisbon, Ulmeiro, 1986 (Preface by Hélia Correia. There are multiple editions of this work).\n*Coelho, José Abílio, Algumas notas sobre a revolução das mulheres de Fontarcada. In: CONGRESSO DA MARIA DA FONTE, 150 ANOS, Póvoa de Lanhoso, 1996, História da Coragem Feita com Coração: Actas. Póvoa de Lanhoso, City Hall, 1996, pp.&nbsp;263–269.\n*Gomes, João Augusto Marques, História da Revolução da Maria da Fonte, in collection Biblioteca do Povo e das Escolas, (n.º 167), Lisbon.\n*Vieira, Casimiro José, Apontamentos para a história da Revolução do Minho em 1846 ou da Maria da Fonte, Braga, Typographia Lusitana, 1883; Lisbon, Rolim, 1987 (fac-simile edition of the 1883 edition with preface by José Manuel Sobral)."
    }
  ]
}