{
  "content": [
    {
      "type": "text",
      "text": "# Revolutionary Socialist League (UK, 1938)\n\n|dissolution =\n|secretary = Denzil Dean Harber\n|ideology = Revolutionary socialismTrotskyism\n|position = Far-left\n|international = Fourth International\n|headquarters = London\n|merger = Marxist League  Marxist Group  Militant Group  Revolutionary Socialist Party\n|successor = Revolutionary Communist Party\n}}\nThe first Revolutionary Socialist League (RSL) was formed in early 1938 by the merger of the Marxist League led by Harry Wicks and the Marxist Group led by C. L. R. James.\nIn August 1938, James P. Cannon and Max Shachtman came to London in an attempt to unite all four British Trotskyist groups. The RSL, the Militant Group, and the Revolutionary Socialist Party merged to form a new Revolutionary Socialist League, but the Workers International League (WIL) refused, claiming that agreement on perspectives was insufficient and that the new group represented a dilution of democratic centralism.\nThe new RSL became the British affiliate of the newly formed Fourth International. It maintained the Militant Labour League for those members who were involved in Labour Party entryism, and published The Militant.\nThe group adopted a defeatist policy during the Second World War, which it modelled on Lenin's revolutionary defeatist tactics of the 1914–1918 war. This was seen by its rivals in the WIL as pacifism. However, it had some initial successes when the Shop Assistants' Union adopted its position in 1940. This led the Labour Party to ban the Militant Labour League. In addition, the group became increasingly inactive as many younger members were conscripted into the British Army.\nThe group's opposition to the war became a major cause of factional strife both within the group and between it and the WIL. Three major positions developed, with ensuing factional divisions. Firstly, a Left Fraction formed, which opposed the war on a basis all other factions described as pacifist. Secondly, the leadership faction around Denzil Dean Harber held a position that opposed the Proletarian Military Policy (PMP) of the WIL and was described by its opponents as semi-pacifist. Third, the WIL and tendencies leaving the RSL at different times adhered to the aforementioned PMP.\nIn 1939, some RSL members split to form the Revolutionary Workers League (RWL), which Isaac Deutscher soon joined, due to the inaction of the RSL leadership when the war began. Initially, they used the RSL name and only changed the name later. However, the majority of the RWL joined the WIL in 1940, with the remainder returning to the RSL in 1941. Another split produced the Socialist Workers Group which published Socialist Fight and entered the Independent Labour Party, some of its former members eventually joining the Trotskyist Opposition which had been expelled from the RSL in 1942. This group, led by John Lawrence, advocated adoption of the PMP of the Socialist Workers Party and was in favour of fusing with the WIL. Collaboration between the Trotskyist Opposition and the WIL was so close that Lawrence was employed by the latter on technical tasks. In 1943, the Left Fraction who were opposed to that policy were expelled.\nThe leadership of the Revolutionary Socialist League refused to enter into any unity negotiations, despite the party's drastic reduction from 300 to 20 members, until in 1944 the Fourth International held a two-day conference. This conference was required to reunite the group so that it could fuse with the WIL into a single organization which could then affiliate to the Fourth International. As planned on the first day, the Trotskyist Opposition and the Left Fraction were reunited with the RSL. Despite the objections of the Left Fraction, the second day saw the reformed RSL unified with the WIL – on the WIL's terms – to form the new Revolutionary Communist Party.\nReferences\n* Al Bornstein and Sam Richardson (1986), \"Against The Stream\" in The War and the International: A History of the Trotskyist Movement in Britain 1937-1949. London: Socialist Platform."
    }
  ]
}