{
  "content": [
    {
      "type": "text",
      "text": "# Revolutionary Action\n\n| dates            = –present\n| dissolved        =\n| merger           =\n| split            = Autonomous Action\n| predecessor      =\n| merged           =\n| successor        =\n| country          = Belarus, Ukraine\n| allegiance       =\n| motives          =\n| area             =\n| headquarters     = Minsk\n| newspaper        =\n| ideology         = Anarcho-communismInsurrectionary anarchismIllegalismPlatformism\n| position         = Far-left\n| crimes           =\n| attacks          =\n| status           = Active\n| size             =\n| revenue          =\n| financing        =\n| partof           =\n| allies           = Rev Dia\n| opponents        =\n| battles          =\n| flag             =\n| website          =\n| module           =\n| module2          =\n| module3          =\n| module4          =\n| module5          =\n| module6          =\n}}\nRevolutionary Action (, РД) is the oldest Belarusian anarchist organization. It seeks to spread anarchist ideas, organize a movement of direct action, and foment a social revolution in Belarus. The group promotes social anarchism, anarcho-communism, and illegalism, and operates in secret due to laws that criminalize their activities.\nInitially part of the Autonomous Action network, Revolutionary Action split in 2010 due to ideological differences. The group has participated in various direct actions throughout the 2010s and into the 2020s.\nHistory\nThe organization was first formed in Minsk at a meeting on 13 February 2005. The meeting discussed the situation in the Belarusian anarchist movement, an acute lack of organization, discipline and directional vector of actions in it. As a result of the discussion, it was decided to create an anarcho-communist organization in Minsk, as a branch of \"Autonomous Action\", which has existed in Russia since 2002. The Belarusian Autonomous Action (AA-Belarus) was an amalgamation of the Belarusian Anarchist Front (BAF) and several activists of the politicized hardcore punk scene. At that time, AA-Belarus barely had ten members.\nOn 5 March 2010, by an absolute majority of votes, the Belarusian chapter decided to leave Autonomous Action and form an independent organization. The reasons for this decision were:\n*the drift of AA towards Left liberalism;\n*inconvenience of the organizational principles of AA for the Belarusian organization and local realities;\n*high membership fees in AA and the lack of transparency in their use.\nOn 11 April 2010 \"Autonomous Action-Belarus\" announced its withdrawal from AA, and changed its name to \"Revolutionary Action\".\nIdeology\nRevolutionary Action's ideology is based on \"social anarchism, anarcho-communism and illegalism\". The latter, in the interpretation of the organization, implies that activists use those methods in their activities that are effective in a given situation, without regard to their legality. The organization sees among its goals: spreading the ideas of anarchism, creating an organized movement, combining agitation and direct action, preparing for a social revolution and expanding both on the territory of the Republic of Belarus and abroad. RA uses the website and social networks to disseminate its ideas. The participants in the Revolutionary Action do not advertise their organizational affiliation and their participation in any actions as an organization, due to the existence of Article 191 (Action on behalf of an unregistered organization) in the Criminal Code of the Republic of Belarus and the attention of the special services to the activities of the organization.\nOrganization principles\n*Closeness of the membership;\n*Distribution of duties;\n*Equality in voting (one person – one vote);\n*Planning;\n*Conspiracy;\n*Illegalism.\nMilitant anarchism\nOne of the vectors in the development of the Revolutionary Action ideology, in addition to focusing on social revolution and illegalism, is the development of a practical concept, which the organization itself calls \"militant-anarchism\" – a practice aimed at training organized and disciplined revolutionary anarchists capable of acting in different conditions using different methods to promote anarchist ideas. Militant anarchism includes platformism, that is, the unification of anarchists in an organization according to the principle of theoretical and tactical unity. According to the description of Revolutionary Action, militant-anarchism, as opposed to post-left anarchism, stands for political methods of struggle: agitation, recruiting new participants, theoretical preparation, infrastructure creation, direct action and preparation for social revolution. An important component of militant anarchism is also military training and the study of tactics of participation in armed conflicts. According to the organization, the reason for this was their analysis of Euromaidan, the Russo-Ukrainian War and the Syrian civil war.\nActivities\n2005–2010\nBased on the analysis of the information presented on the organization's website and information in the media, it can be concluded that the RA members actively participated in many anarchist street actions as sanctioned (Chernobyl Way in 2006–2009, Social March), and unauthorized (May Day procession in 2008, action against the exercises in the West-2009).\nIn addition, on their website, the participants of Revolutionary Action openly sympathize with the anarchist attacks on state and financial institutions that took place in Minsk in 2009–2010: (\"Anarchists attacked a casino in the center of Minsk\", \"Anarchists attacked the Federation of Trade Unions of Belarus\", \"Anarchists attacked a branch of Belarusbank\").\nIn the fall of 2010, after an attack on the Russian embassy in Minsk, the organization was exposed due to the betrayal of some of its members; some of its activists were arrested and sentenced to prison terms in Belarus. Human rights organizations recognized them as political prisoners.\n2010—2015\nAs a result of the repressions of 2010, the anarchist movement suffered serious damage. Between 2010 and 2013, the organization's website mainly published local and international news on social and economic issues, as well as information on anarchist prisoners. From the end of 2013 to the beginning of 2014, symbolic actions were held and propaganda materials distributed in Minsk and Gomel.\nIn the spring of 2014, the anarchists launched a campaign against the holding of the Ice Hockey World Championships in the Republic of Belarus. According to the anarchists, the holding of the championship was a waste on the part of the authorities, at a time when wages were not raised and detained for many workers. On the eve of the championship, many oppositionists and anarchists received administrative arrests on bogus charges. During this period, anarchists also paid attention to the pro-Russian influence in Belarus. In Brest, the building of the Russian Center for Science and Culture was filled with black paint.\nIn December 2014, anarchists in Minsk held the first illegal picket since 2010. Its conduct was associated with the introduction of new taxes and the deterioration of the economic situation of the country's citizens, an alternative to which the anarchists saw the transfer of control over the budget to society.\n2015—2017\nIn early 2015, the anarchist movement was subjected to massive repression by the Belarusian law enforcement agencies, caused by the picket at the end of 2014 and the activation of anarchists. At the same time, anarchists carried out an unauthorized blocking of a road in Minsk for the first time in five years. This action was held in solidarity with one of the political prisoners of the anarchists, Mikola Dziadok.\nIn 2015, a Ukrainian branch of Revolutionary Action was launched. Members of the RA-Belarus confirmed in an interview that they cooperate with the activists of the RA-Ukraine. In addition, Ukrainian anarchists have repeatedly held solidarity actions near the Belarusian embassy in Kyiv.\nDuring the period 2015–2017, anarchists held several illegal processions and pickets in Brest, Minsk and Baranovichi. Campaigning related to social and economic problems of the Belarusian society, such as tax increases, army conscription, or the manifestation of police brutality, was distributed on a regular basis. The most active at this time were groups of activists from Brest, Minsk and Grodno.\nIn the same period, actions were published on the RA website in which the buildings of the Ministry of Internal Affairs and the Investigative Committee were attacked with smoke bombs, and billboards with \"state propaganda\" were damaged with paint. One of the most resonant was the paint-throwing of the Belteleradiocompany building, which activists linked to \"constant lies on the air\" by the state media. In the summer of 2017, anarchists used Molotov cocktails to burn an advertisement for the bailiff service in the town of Ivatsevichi. Later, a criminal case was opened on this fact and two suspects were detained.\n2016: Anti-censorship activities\nSince the fall of 2016, the RA website has been blocked in Russia and Belarus. Later, the organization created three mirrors revbel.cc, revbel.info and revbel.net. All of them were also blocked from Belarusian IPs, as well as a public page and a group on the social network VKontakte and the BandaLuki project. In June 2017, the organization presented its own application for Android, which allows bypassing the blocking using Tor and VPN and gaining access to the organization's website and the BandaLuki project. At that moment, the organization maintained a Facebook group, a Telegram channel and a Twitter account. For the period from 2015 to 2017, about ten units of the organization's campaign materials, including brochures and leaflets, were included in the Republic's list of extremist materials by a court decision.\n2017: Protests against Presidential Decree No. 3\nAt the end of February 2017, the deadline for payment of the tax provided for by Decree No. 3 of the President of the Republic of Belarus, better known as the \"Decree on Parasites\", expired. Decree No. 3 \"On the prevention of social dependency\" established the obligation of citizens of Belarus who did not participate in the financing of public expenditures, or participated in less than 183 calendar days in the past year, to pay the state a fee in the amount of 20 basic units. This tax caused discontent among Belarusian citizens, as a result of which a series of protests took place in the country, some of which were attended by anarchists. At the end of February, they blocked the carriageway of one of the streets of Minsk, along which they passed with pyrotechnics and a banner \"Official is the main parasite\". There is no information in the media about the arrests of participants in this action. The presence on the banner of the organization's logo and a link to its website suggests that the RA participants are probably related to this action. At the beginning of the year, anarchists have already begun to spread agitation under the slogan \"The official is the main parasite\" in different cities. Thus, the activists focused on the fact that the burden on the country's budget is created not by people who have lost their jobs as a result of rising unemployment, but by an excessive administrative apparatus, the effectiveness of which was questioned.\nOn 5 March, in Brest, another protest action against decree No. 3 was held near the building of the city executive committee, which was unexpectedly led by a group of anarchists under black banners and with a banner \"Official is the main parasite\", which contained a link to the website of the Revolutionary Action. The anarchists made several speeches into a megaphone and provided an opportunity for any of the protesters to speak into it. Then a column of 1000–2000 protesters, led by a group of anarchists, chanting slogans, marched along Sovetskaya Street and blocked Masherov Avenue. The action ended after a short picket near the TsUM building. On the same day, 5 people were detained in Brest in connection with these events.\nOn 13 March, the website of Revolutionary Action and the organization's community in social networks began to spread a call for protests in a number of Belarusian cities on 18–19 March. As a result, the actions were held in only five cities and a total of 200 to 500 people were gathered. The organization itself attributes such a low number of protesters to the refusal of a number of opposition media outlets to spread the anarchist call.\nAfter the dispersal of the 25 March demonstration in Minsk and the arrest of many protesters and anarchists, Revolutionary Action launched the BandaLuki project, in which it collects dossiers on employees of the Ministry of Internal Affairs, special services and state media workers who participated in repressions against the opposition and anarchists.\n2020 Belarusian protests\nActivists of the Revolutionary Action took active part in the 2020–2021 Belarusian protests. In the summer of 2020, the movement published a video instruction on how to participate in the clutch of protesters on its channel. In 2021, some of its members face charges under the accusation of establishment or leadership of a criminal organisation. The Belarus Solidarity Foundation opened a collection for one-off assistance to the families of the activists of the initiative.\nIn November 2021, the Ministry of Internal Affairs declared Revolutionary Action's web resources an extremist group. Creation of an extremist group or participation in it is a criminal offence in Belarus.\nReferences"
    }
  ]
}