{
  "content": [
    {
      "type": "text",
      "text": "# Revolutionary Independent Labour Movement\n\n}}\nThe Revolutionary Independent Labour Movement (Movimiento Obrero Independiente y Revolucionario), or MOIR, is a left-wing party in Colombia that was founded in September 1969. Francisco Mosquera was the founder and ideological leader of MOIR. In August 1994 he died, after which Hector Valencia became the Secretary General of the party. In 2008 Valencia died and the union leader Gustavo Triana, vice president of the country's largest union (Central Unitaria de Trabajadores - CUT), was elected Secretary General.\nThe MOIR describes itself as \"a political party of the working class. Its primary mission is to lead the proletarian class struggle in Colombia for its ultimate emancipation, establishment of socialism in Colombia and realize communism. Defend the people's interests and the Colombian nation and its immediate objective is the New Democratic Revolution\".\nIdeology\nAt its founding, the MOIR believed that in Colombia it was necessary to first carry out Mao Zedong's New Democracy Revolution to achieve socialism, complemented by the formation of a true Workers' Party and an Agrarian Revolution due to the semi-feudal character of the country, all leading to the formation of a Anti-Imperialist United Front for Sovereignty and Democracy, where all sectors of society could fit against foreign domination.\nLikewise, the party emphasized that the revolution had to be carried out looking at the specific conditions of the countries and with total autonomy and sovereignty of the people. In this way, it was characterized by its anti-imperialist struggle against the United States (USA) and the Soviet Union. The opposition against this last power caused problems with other pro-Soviet Marxist-Leninist organizations in the country.\nUnlike other left-wing parties, the MOIR criticized the call for armed insurrection because, according to them, the conditions had not been met for an armed uprising of a revolutionary nature because this was an instrument that the people used for their emancipation. However, due to the conditions of the country, the people were not prepared due to a lack of awareness and organizational and combative level. For this reason, they affirmed that total support must be obtained from the country's population to form a true workers' party, a peasant movement that seeks true agrarian reform, and mainly attack the main problems and their causes, which are imperialism and the bourgeoisie. In this way, they alternatively defended civil resistance, civil disobedience and mass democratic struggle as their methods of political and revolutionary action.\nAlthough unlike the other parties the MOIR does not consider a prolonged revolution necessary as an appropriate tactic in the specific circumstances of Colombia, it does not condemn this method.\nHistory\nThe MOIR has an ideological base in Maoism. It split from the Peasant Student Workers Movement (Movimiento Obrero Estudiantil y Campesino, MOEC), headed by Francisco Mosquera, due to internal differences by rejecting armed struggle and adopting a marxist-leninist ideology.\nThis movement gained traction in universities and syndicates. It was characterized by not only its rejection of the government, but also leftist parties of the times such as the Colombian Communist Party and Socialist Bloc. It's youth organization, Juventud Patriótica (JUPA), headed by Marcelo Torres (leader of the National University of Colombia), played an important role in the student movement in 1971.  It led a movement that demanded co-government and managed to recruit a large number of university students and faculty.\nThe study and identification with Maoism led them to be recognized by the Chinese Communist Party (CCP), as well as others such as the Communist Party of Colombia - Marxist-Leninist and the extinct Tendencia Marxista Leninista Maoísta, as its related parties in Colombia. However, by 1980 they had broken ties with the CCP.\nIn 1972, the MOIR included electoral competition in its tactics and began its participation in parliamentary and departmental elections, and developed alliances with different political sectors. However, they maintained their criticism against the supposed revisionism and opportunism of other left-wing groups.\nThe 1980s\nThe 1980s were marked by a progressive decline in the number of militants because of dramatic splits and actions by armed groups. In this period, paramilitaries and guerrillas assassinated several party cadres and forced the central leadership to call for a massive withdrawal from the rural areas, where the MOIR was beginning to build peasant agricultural associations.\nThe MOIR participated in various left-wing coalitions and even cooperated with the Colombian Communist Party at times in the National Opposition Union (UNO). However, he opposed the formation of the Unitary Party of Workers (CUT), which was the point of convergence of almost all Colombian unionism, considering it an opportunist and liberal centre. In this way, its worker militants maintained their affiliation to the increasingly diminished General Party of Workers (CGT).\nThe 1990s and 2000s\nIn 1994, Francisco Mosquera, Secretary General, died and a process of divisions began within the party. Mosquera's successor and co-founder of the MOIR: Héctor Valencia, ran against with Senator Jesús Bernal Amorocho, who led the bank workers sector of the party. This faction finally becomes independent and achieves the consecutive re-election of Bernal in the Congress of the Republic of Colombia.\nA second sector, led by the historical leader Marcelo Torres Benavides, called the Valencia leadership \"left-wing opportunist.\" He split to pursue broad front politics and the reconstruction of the party, and formed the (MOIRist) Colombian Labor Party (PTC).\nThe PTC managed to elect Bernal as senator, but on September 2, 2002, it expelled him from its ranks for alleged embezzlement of funds in the union that he directed, which is why the PTC is left without parliamentary representation.\nTo complete this episode of factionalism, small groups in Bogotá considered the modern MOIR as a traitor to \"Francisco Mosquera Thought\" and separated from the party. These are the self-proclaimed MOIR Francisco Mosquera and the Francisco Mosquera Thought Defense Committee led by Ramiro Rojas.\nThe MOIR participated in the process of forming the Social and Political Front in 1999, but withdrew due to disagreements with other leftist sectors.\nIn 2006, the MOIR united with other revolutionary and democratic movements in the Alternative Democratic Pole (Polo Democrático Alternativo - PDA). The MOIR works with farmers in the \"National Association for Agricultural Salvation\" (Asociación Nacional por la Salvación Agropecuaria), with students in the \"Colombian Student Organization\" (Organización Colombiana de Estudiantes - OCE), with industrial workers (with other movements Central Unitaria de Trabajadores - CUT), with consumers \"National League of public services users\"(Liga Nacional de Usuarios de Servicios Públicos) and intellectuals \"Center for Labor Studies\" (Centros de Estudios para el Trabajo-CEDETRABAJO).\nIn the legislative elections of 2002, the MOIR won a senate seat with a senator named Jorge Enrique Robledo. Later in the legislative elections in 2006 and 2010, he was reelected senator, with a total of 80,969 and 165,339 votes respectively, the last time with the third largest vote in that election. The Colombian economic news magazine \"Portafolio\" considered Robledo the best senator of Colombia for his efforts in defense of agriculture, workers, education, health, national economics, users of public services, Colombian sovereignty and democracy.\nElection results\n{| class=wikitable\n|-\n! Election year\n! # ofoverall votes\n! % ofoverall vote\n! # ofoverall seats won\n! +/–\n! Government\n|-\n! 2002\n| 45,703\n| 0.5 #37\n|\n|\n|\n|}\nReferences\nExternal links\n*[http://www.moir.org.co/ Official web site]\n*[http://deslinde.org.co/ \"Center for Labor Studies\" web site]"
    }
  ]
}