{
  "content": [
    {
      "type": "text",
      "text": "# Revolution in Our Time\n\n'Revolution in Our Time: The Black Panther Party's Promise to the People' is a nonfiction book about the Black Panther Party, written by Kekla Magoon and published November 23, 2021 by Candlewick Press. In 2021, the book was a finalist for the National Book Award for Young People's Literature.\nReception\nRevolution in Our Time is a Junior Library Guild book.\nThe book received starred reviews from Booklist, Horn Book,Kirkus Reviews, Publishers Weekly, and School Library Journal.\nKirkus Reviews referred to the book as a \"highly readable and not-to-be-missed story of America’s history and current reality\" Publishers Weekly called it a \"detailed, accessible text\" that \"presents an incisive, in-depth study of the Black Panther Party.\" Booklist wrote, \"This rounded accounting of a pivotal but often-overlooked time in U.S. history should be widely read.\" The Horn Book similarly wrote that \"this compelling work would be invaluable for both individual and classroom reading,\" and Shelf Awareness said it is \"a must-have for American history units that will spend more time in readers' hands than on the shelves.\"\nHorn Book, Kirkus Reviews, and Publishers Weekly named Revolution in Our Time one of the best young adult books of 2021.\nThe audiobook, narrated by Tyla Collier, received a positive review from Lit Hub.\n{| class=\"wikitable\"\n|+Awards for Revolution in Our Time\n!Year\n!Award\n!Result\n!Ref.\n|-\n| rowspan=\"2\" |2021\n|Los Angeles Times Book Prize for Young Adult Literature\n|Finalist\n|\n|-\n|National Book Award for Young People's Literature\n|Finalist\n|\n|-\n| rowspan=\"4\" |2022\n|Coretta Scott King Book Award for Author\n|Honor\n|\n|-\n|Michael L. Printz Award\n|Honor\n|\n|-\n|ALSC Notable Children's Books\n|Selection\n|\n|-\n|Walter Dean Myers Award for Teen\n|Finalist\n|\n|}\nReferences\nExternal links\n* [https://revolutioninourtime.com Official website]"
    }
  ]
}