{
  "content": [
    {
      "type": "text",
      "text": "# Revolutionary People's Constitutional Convention\n\n]]\n'''The Revolutionary People's Constitutional Convention''' (RPCC) was a conference organized by the Black Panther Party (BPP) that was held in Philadelphia from September 4–7, 1970. The goal of the Convention was to draft a new version of the United States Constitution and to unify factions of the radical left in the United States. The RPCC represented one of the largest gatherings of radical activists across movements and issues in the United States. The Convention was attended by a variety of organizations from the Black Power Movement, Asian American Movement, Chicano Movement, American Indian Movement, Anti-war movement, Women's Liberation, and Gay Liberation movements. Estimates of attendance range from 6,000 to 15,000. Attendees convened in workshops to draft declarations of demands related to various issues, which were ultimately intended to be incorporated into a new constitution which would function as the final vision of those movements. The RPCC also signified a shift in BPP focus from black self-defense to a broader revolutionary agenda. While conflicts did arise during the Philadelphia Convention, the conference was ultimately deemed a success by the Panthers. After the Philadelphia conference, attempts were made to reconvene to finalize and ratify the new constitution in Washington, DC a few months later but ultimately failed due to police interference and Panther disorganization.\nHistorical context\nIn 1966 Bobby Seale and Huey Newton founded the Black Panther Party (BPP) in Oakland, California. Seale and Newton drafted the 10-point party platform with the stated goal of protecting black communities in the US. Over the course of the 1960s the BPP founded several \"survival programs,\" liberation schools, and police patrol projects throughout the country. By 1970, the BPP had expanded to become a national and international organization, and held a prominent place in the Black Power Movement. Simultaneously, similar activist movements were emerging in other marginalized communities. The same year as the founding of the BPP, a group of Mexican American students in Los Angeles formed the Young Chicanos for Community Action, which would later become known as the Brown Berets, one of the most prominent groups in the emerging Chicano Movement. Just a few years later in 1968 the American Indian Movement was formed in Minneapolis, Minnesota to advocate for the rights of Native Americans and quickly began using direct action as a means to air demands. At the same time the formation of groups such as the Asian American Political Alliance and the Asian Marxist groups I Wor Kuen in New York and the Red Guard in San Francisco marked the beginning of the national Asian American Movement. In 1969, a police raid and subsequent riots at Stonewall Inn in New York City led to an acceleration of the gay rights movement and the formation of the Gay Liberation Front. This new movement overlapped with the second-wave feminism of the sixties in the formation of lesbian feminist groups such as the Radicalesbians. The rise of these specific identity-oriented organizations and movements also coincided with and contributed to the rise of the New Left more generally, along with the growing Anti-War movement and prominent anti-war groups such as the Youth International Party and Students for a Democratic Society. These groups shared many goals, including putting an end to the Vietnam War and fighting police brutality in American cities. However, while these radical organizations and movements influenced one another's ideology, and often organized and protested together, their connections remained largely loose and informal and they did not represent a unified activist front. Forming unity and a singular agenda between these groups was the ultimate focus of the Revolutionary People's Constitutional Convention.\nLead up to convention\nOn May 31, 1970 an advertisement was published in the Black Panther newspaper calling for a \"mass rally and national press conference to announce date and place of Revolutionary People's Constitutional Convention\" at the Lincoln Memorial in Washington DC on June 19, or Juneteenth.  This same advertisement was reprinted in the paper on several occasions. The rally attracted some 1,000 attendees and a banner was held aloft which read \"Revolutionary People's Constitutional Convention.\" The Panthers delivered an address which denounced the US constitution as having failed to protect black people and called for a \"Revolutionary People's Constitutional Convention, to be convened by the American people, to write a new constitution that will guarantee and deliver to every American citizen the inviolable human right to life, liberty, and the pursuit of happiness.\" The statement also asserted that \"Black people are not the only group within America that stands in need of a new constitution. Other ethnic groups, the youth of America, Women, young men who are slaughtered as cannon fodders in mad, avaricious wars of aggression, our neglected elderly people all have an interest in a new constitution…\" On the same day a similar rally was held in Bobby Hutton Memorial Park in Oakland, \"to inform the Black Community concerning the issues of political prisoners and the re-writing of the constitution to make it apply to Black people.\" On August 8 and 9 the Black Panther Party hosted a planning session for the convention at Howard University in Washington DC. Representatives of several activist groups, including the Gay Liberation Front, Radicalesbians, the Third World Gay Liberation Front, Rising Up Angry, the Southern Christian Leadership Conference, and the National Urban League were invited by the Panthers and attended. While tensions between the various groups arose, the session was generally deemed to be productive and no objections were raised to the ultimate decisions of the Agenda Committee. Soon afterwards on August 21 Huey Newton, the Minister of Defense of the BPP, published a letter in the Black Panther newspaper entitled \"Letter to the Revolutionary Brothers and Sisters about the Women's and Gay Liberation Movements\" in which he affirmed the role of those movements as in line with the radical liberation envisioned by the BPP. This was the first declaration in support of gay rights made by any black political organization in the US, and was widely acclaimed and reprinted by feminists and gay activists, solidifying the place of feminist and gay liberation organizations at the RPCC. A registration form for the convention was published in the same issue of the paper, followed a week later with a schedule of events. A few weeks before the Convention three Philadelphia Panther centers were raided by police, resulting in 14 arrests. The Hartford Courant reported that the Philadelphia Police Commissioner, Frank L. Rizzo, \"had considered violence a strong possibility and had tried to keep the Panthers out of town.\" Despite these attempts, the RPCC convened as scheduled on Labor Day weekend.\nConvention Structure\nAfter much build up, the Revolutionary People's Constitutional Convention was held in Philadelphia from September 4–7. In attendance were leaders and members of most prominent New Left and radical activist organizations in the US, including the Young Lords Party, the Youth International Party, Students for a Democratic Society, the Young Patriots, I Wor Kuen, the Gay Liberation Front, Radicalesbians, the Third World Gay Liberation Front, Rising Up Angry, the Southern Christian Leadership Conference, and the National Urban League, as well as individuals not affiliated with any group and international visitors. The Black Panther paper reported after the convention that 15,000 people had been in attendance, while the New York Times reported only 6,000. The New York Times also reported that approximately half of the attendees were white. Registration for the convention occurred at the Church of the Advocate in Philadelphia. Opening events included a screening of the documentary The Battle of Algiers, as well as a street fair where RPCC attendees were offered discounted prices.\nSaturday\nThe opening plenary session of the convention was held in McGonigle Hall at Temple University, and was scheduled for Saturday at 9am but was delayed for four hours. The session featured speeches by Panthers Michael Tabor (a member of the New York 21), Huey Newton, Audrea Jones, and Charles Garry. On Saturday afternoon and evening, attendees were scheduled to break into eleven workshops based on social groupings, but these workshop were ultimately canceled at the last minute. While some of the social grouping workshops, such as Lesbians, Women, Gay men, and the YIP, attempted to meet outside of the structure of the convention or managed to reschedule their workshops within the weekend's agenda, most of these groups did not meet or create demands. The groups scheduled to be represented were as follows: Third World People, Women, G.I.s, College Students, High School Students, Workers, Female Homosexuals, Male Homosexuals, Welfare People, Street People, Head Workers (people's technicians, doctors, lawyers, scientists, clergy). Later in the evening attendees reconvened for another speech by Newton. Those who could not fit inside the Temple University Gymnasium marched together through North Philadelphia. There was minimal violence and no arrests were made.\nSunday\nOn Sunday attendees once again split into workshops, this time based on topic. The topics were as follows: Self-determination for nation minorities, Self-determination for women, Self-determination for street people, The family and the rights of children, Health, Control and use of the military and police, Control and use of the means of production, Control and use of the educational system, Control and use of the legal system, Control and use of the land, Internationalism–relations with liberation struggles around the world, and Revolutionary art. Workshops were also held where-in attendees could participate in activities, such as a session held by Gay Liberation activists in which male activists were encouraged to dress in women's clothing and act stereotypically female, and then participate in a conversation about the misogyny entailed in these imitations. On Sunday evening the conference reconvened for each workshop to announce their list of demands to the rest of the Convention, and Newton delivered another speech.\nObjections to the Philadelphia convention\nWhile the convention was largely regarded a success by organizers and attendees, some attendees felt less positively about the weekend's events. Many women, especially the white lesbian activists in attendance, objected to what they perceived as the patriarchal nature of the convention. This conflict began with the cancelation of the Saturday evening social grouping workshops, and was then exacerbated when female attendees asked for a special women's meeting to be held Sunday morning as a replacement for the cancelled sessions and were told that such a meeting would not be considered an official part of the convention. Lesbian activists were also frustrated by what they saw as the aggressive masculinity of Huey Newton's opening speech, and were unsatisfied with Audrea Jones' speech, which a later statement called \"totally devoid of any awareness of women's oppression.\" This second point was particularly important to Lesbian activists, as the presence of a female speaker of color with \"a heavy woman's consciousness\" had been a crucial point of negotiation at the August planning session. Lesbian attendees were particularly galled by Newton's assertion in his speech on Sunday night that, \"We will have our manhood, even if we have to level the face of the earth.\" Several lesbian activists ultimately met outside of the confines of the official Convention schedule and drafted their own list of demands, but these were not ultimately read at the final session on Sunday evening or included in the official collection of demands. By the end of the Convention, many lesbian attendees had marched out in protest.\nWashington convention and aftermath\nConsidering the success of the RPCC, plans were announced by the Panthers at its end for a second meeting in Washington DC to ratify the new constitution, tentatively scheduled for November 4. On November 7 an advertisement was run in the Panther newspaper declaring a second Revolutionary People's Constitutional Convention to take place November 27–29. Difficulties plagued the Washington convention from its inception, with the newly formed DC chapter of the BPP, simultaneously struggling to find a space for the event and suffering from disorganization as a result of the arrest of several of their leaders. The Panthers first attempted to rent space for the convention at the University of Maryland but were rebuffed, and later sought space at the DC National Guard Armory but were once again turned down. Ultimately the Panthers settled an agreement with Howard University for the convention space. However, due to a last minute price dispute with the school, the Convention was set to commence with no clear space for it to take place.  Despite this, registration continued at All Souls Unitarian Church. That night a concert was held in Meridian Hill Park (also known as 'Malcolm X Park') with approximately 5,000 people in attendance. The Panthers made their dispute with Howard University public and DC Panther leader Elbert Howard called on Panthers and their allies to \"liberate Howard University and to make that institution serve the needs of the community.\" However Panther pressure was ultimately unsuccessful in getting Howard to yield their space. While some small meeting spaces were offered up around the city, the event was ultimately disorganized and largely unsuccessful. At the end of the weekend Huey Newton spoke at St. Stephens of the Incarnation Church and assured attendees that another convention would be held where the constitution would be discussed and finalized. This promise never came to fruition however, as soon after the second RPCC the BPP began to fall victim to internal divides and external law enforcement efforts, and ultimately retracted much of its national efforts to focus on solidifying the Panther base in California. Simultaneously, the deescalation of the Vietnam War brought to a close one of the largest focuses of protest in the 60s and early 70s, and further weakened the power and human numbers wielded by the New Left. Ultimately, the vision set out by attendees of the Philadelphia Revolutionary People's Constitutional Convention was never fully completed.\nReferences\nCitations\nExternal links\n* \"[http://aboutplacejournal.org/wp-content/uploads/2014/02/RPCC-WORKSHOP-REPORTS1.pdf Workshop on Internationalism and Relations with Liberation Struggles Around the World]\", AboutPlaceJournal.org. PDF of the workshop statements and demands drafted at the Philadelphia RPCC."
    }
  ]
}