{
  "content": [
    {
      "type": "text",
      "text": "# Revolutionary War Heritage Trail\n\nThis is a list of Historic Sites on the Revolutionary War Heritage Trail in the American state of New York. The New York State Office of Parks, Recreation and Historic Preservation and the office of Heritage, New York, the New York City Department of Parks and Recreation, Brooklyn College and the City University of New York, and a local not-for-profit organization, Brooklyn Heritage, Inc.; placed a series of signs depicting 18 sites of historical significance in Brooklyn.\nLocations whose coordinates are included below may be seen together in \"Map all coordinates using OpenSourceMap\" at right side of this page.\n{| class=\"wikitable\"\n|-\n! Location\n! Name of Siteand coordinates\n! Type\n! Built\n! Notes\n! Photograph\n|-\n| Tottenville\n| The Conference House\n| Stone houseNational Historic Landmark Dutch Colonial Homestead.\n| In September 1776, Benjamin Franklin, John Adams and Edward Rutledge met at Billopp House with British Admiral Lord Howe in an unsuccessful negotiation for peace\n| Conference House Park. 7455 Hylan Blvd, Staten Island, NY 10307  +1 718-984-6046\n|\n|-\n| Richmond\n| Historic Richmond Town\n| Historical Society\n| 100-acre site exploring the diversity of the American experience, from colonial days to the present.\n| 441 Clarke Ave, Staten Island, NY 10306 -Quaint, old houses and historic sites. Ice cream parlor. Picnic benches. Ample parking lot.\n|\n|-\n| Fort Wadsworth\n| Fort Wadsworth\n| Redoubts\n| This strategic coastal location at the Narrows was used by the British as the staging ground for the massive British invasion of Brooklyn in August 1776.\n| 210 New York Ave.Staten Island, NY (718) 354-4500  Series of red sandstone Forts, Forts Richmond (on the site now called Battery Weed) and Tompkins, on the sites of the current forts but of different design, and Forts Morton and Hudson, with positions for a total of 164 guns in the four forts. National Park Service & Gateway National Recreation Area Headquarters.\n|\n|-\n| Fort Hamilton\n| Denyse's Ferry\n| Ferry Historic Marker\n| Site of the Gravesend Bay landing of the 20,000 strong British army under Admiral Howe. The camp spread out to New Lots.\n| The Underpass, waterfront Bike Path, Brooklyn, NY 11209-  Handicapped accessible, parking lot. At the parking pull-over, next to the Belt Parkway eastbound lanes. Also the bike path access walkway from 4th Ave. Markers for the Battle of Brooklyn and Gravesend Landing.\n|\n|-\n| Fort Hamilton\n| Fort Hamilton Overlook-Harbor Defense Museum\n| Military Museum\n| Military museum housed in a 19th-century fort showcasing historic weapons, uniforms, cannons & more.\n| The Caponier, 230 Sheridan Loop, Brooklyn, NY 11252  -  Handicapped accessible, parking lot. Next to family friendly community club.\n|\n|-\n| Fort Hamilton\n| Fort Hamilton Overlook-Rodman Gun\n| Redoubt-Military Museum -the Narrows Fort\n| On July 4, 1776, a small American battery on the site of today's Fort Hamilton (the east side of the Narrows) fired into one of the British men-of-war, HMS Asia convoying troops to suppress the American Revolution.\n| John Paul Jones Park, 101-14 4th Ave, Brooklyn, NY 11209 -  Handicapped accessible, street parking. Family friendly park. The Civil War-era experimental 20-inch Rodman gun, one of two remaining and the largest gun produced by either side in civil-war period, originally situated in Fort Pitt, Pennsylvania, but was presented to the park by the United States Military in 1900.\n|\n|-\n| Fort Hamilton\n| Verrazzano Bridge Underpass-The Battle of Brooklyn marker\n| Commemorative Marker for the Revolutionary War Heritage trail.\n| At the parking pull-over, next to the Belt Parkway eastbound lanes. Also the bike path access walkway from 4th Ave. Markers for the Battle of Brooklyn.\n| The Underpass, waterfront Bike Path, Brooklyn, NY 11209 - Handicapped accessible, parking lot.\n|\n|-\n| New Utrecht\n| Barkuloo Cemetery\n| Cemetery Originally 2 Revolutionary war soldiers, 21 people in total were buried here.\n| 1-acre site colonial cemetery owned by the Cortelyou family.\n| 34 MacKay Pl, Brooklyn, NY 11209 - This burial ground was founded in 1725 by Dutch immigrants.\n|\n|-\n| Madison\n| Wyckoff-Bennett Homestead\n| National Historic Landmark Dutch Colonial Homestead\n| Home built before 1766 in Flatlands. Here two Hessian soldiers etched their names in windowpanes before marching to Battle Pass.\n| Wyckoff Family home from 1776 to 1835, 1669 E 22nd St, Brooklyn, NY 11229 - one of the last privately owned Dutch Colonial houses in New York City\n|\n|-\n| Gowanus\n| Red Lion Inn\n| National Historic Landmark Colonial Tavern (demolished) Historic Markers\n| Tavern where the first skirmish of the Battle of Long Island (Brooklyn) took place on August 27, 1776\n| Red Lion Inn (Brooklyn) Historic Marker, 923 4th Avenue, Brooklyn, NY 11232 - Colonial tavern named in honor of Henry V of England, the marker is on land ceded to the State of Maryland Location is on the sidewalk of Martense street adjacent to the Maintenance yard for Greenwood-Cemetery.\n|\n|-\n| Gowanus\n| Battle Hill\n| National Historic Landmark Battle of Brooklyn Historical Marker\n| Historical Markers for largest battle of the revolutionary war, fought from Gowanus to Brooklyn Heights, August 27–29, 1776. The markers are clustered in front of the Statue of Minerva and next to the Civil War Monument, and at the steps base.\n| Greenwood Cemetery, 500 25th St, Brooklyn, NY 11232 - High point in Gowanus, site of the defense of General Stirling's retreat. Here fought the 8th Connecticut Regiment, Huntington's 17th Continentals, led by command Lt. Col. Joel Clark- thrice attacking 2000 British troops.\n|\n|-\n| Park Slope\n| Vechte–Cortelyou House\n| National Historic Landmark Dutch Colonial Homestead.\n| Home built before 1766 in Gowanus. There is a marker on 5th Ave () and 3rd Street.\n| Old Stone House (Brooklyn), 336 3rd St, Brooklyn, NY 11215 - During the 1776 Battle of Brooklyn, Maryland Continentals under General Stirling waged a battle at the site of this reconstructed Dutch farmhouse. Upon withdrawing they found themselves surrounded and were captured while retreating. Their sacrifice enabled Gen. Stirling to retreat to Brooklyn Heights.\n|\n|-\n| Park Slope\n| Maryland 400\n| Historic Landmark Historic marker on the façade of the American Legion Post building.  \"In Honored Memory of Maryland's 400. Forever Remembered.\"\n| Maryland Regiment Burial Site, 256 of whom died near this spot and are beneath the lot on the side of the building. A dig did not find any bones, the book- Old Stone house, gives the location at an Island in Gowanus Creek, near 2nd street and 3rd Avenue as the Arresick.\n| American Legion Post 1636, 193 9th St, Brooklyn, NY 11215 - During the 1776 Battle of Brooklyn, Col Mordecai Gist & Maryland Continentals under General Stirling waged a battle at the Vechte–Cortelyou House. Upon withdrawing they found themselves surrounded and were captured while retreating. All were killed or captured, their sacrifice enabled Gen. Stirling to retreat to Brooklyn Heights over the Gowanus creek. Gen. Sullivan surrendered to the Hessian commander. The bodies of the dead were laid in trenches facing east.\n|\n|-\n| Roode Hoek\n| Fort Defiance\n| National Historic Landmark Redoubts of Fort Defiance filled in by landfill, Historic Marker placed in front of pier in park - Red Hook Lane Heritage Trail street signs\n| Redoubts on a high point in the tidal marshland; which held HMS Roebuck from taking part in the Battle of Long Island (Brooklyn), the carronade of which took place before noon on August 27, 1776\n| Fort Defiance, (Brooklyn) Historic Marker, Ferris St &, Coffey St, Brooklyn, NY 11231 - Defensive redoubts and embankments, the trenches ran from Van Dyke & Conover to Coffey street pier.\n|\n|-\n| Roode Hoek\n| Red Hook Lane Arresick\n| Colonial road thru the tidal marsh from Fort Defiance to Fulton Street.\n| Head of Red Hook Lane Heritage Trail at Columbia & Nelson streets, where a flanking action on the American line results in death of Lt.Col Grant, an aide and the Pennsylvanian rifleman who shot them from a tree, took place during retreat by Gen. Stirling August 27, 1776\n| Street sign - corner Dwight Street & Delevan, 389 Columbia Street, Brooklyn, NY 11231 - The triangular piece of land on the corner of Columbia and Nelson streets.\n|\n|-\n| Prospect Park\n| Battle Pass\n| National Historic Landmark Flatbush Pass or Valley Grove or The Porte, is a historic hill pass that played a significant part in the 1776 Battle of Long Island. Plaque in a Rock. Historic Marker\n| Pass thru the Guan Hills which the Hessians took to flank Gen. Stirling's regulars during the Battle of Long Island (Brooklyn) which took place on August 27, 1776. They broke when Howe arrived at their rear from Bedford(Jamaica) pass and pursued across Long meadow in Prospect park to the Old stone house, where the Maryland 400 under Sullivan made a stand.\n| Prospect Park, 36 East Dr, Brooklyn, NY 11238. Americans under John Sullivan and Hessians under Leopold Philip de Heister formed a skirmish line after the Americans set up an ambush at the Dongan oak. The Americans were flanked by Clintons night march thru Bedford pass.\n|\n|-\n| Prospect Park\n| Dongan Oak\n| National Historic Landmark Colonial Historic plaque Marker (Eagle on top) placed just south of the redoubt hill in Prospect Park.\n| Place where a large tree was felled to block the advance of the Hessian invaders during a skirmish of the Battle of Long Island (Brooklyn) which took place on August 27, 1776\n| Dongan Oak Historic Marker, 41 East Dr, Brooklyn, NY 11238 - Large white Oak used as the marker between Flatbush and Brooklyn. Replanted as a memorial.\n|\n|-\n| Vlacke Bos\n| Flatbush Reformed Protestant Dutch Church\n| National Historic Landmark Church constructed in 1793-98\n| The bodies of American soldiers who died in the Battle of Long Island during the American War are reportedly buried underneath the church structure.\n| Flatbush Reformed Church, 890 Flatbush Ave, Brooklyn, NY 11226 - During the 1776 Battle of Brooklyn, Maryland Continentals under General Stirling whom died in the bayonet charge at Battle Pass were buried here, the church was constructed over them. Currently closed for renovation.\n|\n|-\n| Park Slope\n| Grand Army Plaza\n| National Historic Landmark originally known as Prospect Park Plaza, is a public plaza that comprises the northern corner and the main entrance of Prospect Park in the New York City borough of Brooklyn.\n| Originally, the grounds of the Grand Army Plaza was a battleground of the Battle of Long Island, which was the first major battle of the American Revolutionary War. Prospect Park was created to commemorate the battles fought there during the War of Independence.\n| Grand Army Plaza, Brooklyn, NY 11238 - Preservation of the battlefield was one of the reasons given for the creation of Prospect Park, Many memorials throughout the park have been lost to time.\n|\n|-\n| Prospect Park\n| Maryland Monument\n| National Historic Landmark a \"monolith of Maryland granite with bronze tablets on the four sides\"\n| The Monument to the Maryland 400 of the Battle of Long Island, for their part in saving the army.  A 12-foot polished granite Corinthian pillar with a marble orb on top and backed by a semicircular stone wall. There is a marble pedestal.\n| Prospect Park, Maryland Monument, 150 West Dr, Brooklyn, NY 11218  - Preservation of the battlefield was one of the reasons given for the creation of Prospect Park,.\n|\n|-\n| Prospect Park\n| Lookout Hill\n| National Historic Landmark site of a stand by the Maryland 400, a company of Patriots who protected the American retreat during the Battle of Brooklyn in 1776\n| The Monument to the Maryland 400 of the Battle of Long Island is at the base of the hill.\n| Lookout Hill, 150 West Dr, Brooklyn, NY 11218 - Preservation of the battlefield was one of the reasons given for the creation of Prospect Park.\n|\n|-\n| Prospect Park\n| Lafayette Memorial\n| Site of a monument to a friend of America from France,  Gilbert du Motier, Marquis de Lafayette, Brooklyner Henry Harteau left a bequest for a statue of the general in his will.\n| After the French soldier declared to congress his wish to volunteer to the rebel cause, Congress on July 31, 1777, gave him an appointment as a major-general. The Bas-relief monument depicts Lafayette with James Armistead Lafayette, a rebel spy and confidante.\n| 9th St &, Prospect Park West, 11215 The Battle of Brandywine on September 11, 1778, was his first battle, where he was wounded. Many battles later led him to the siege of Yorktown, where Lafayette occupied Malvern Hill, and at Williamsburg peninsula was successful in cutting off Gen. Cornwallis's retreat. The French fleet's arrival effectively ended the revolutionary war.\n|\n|-\n| Cobble Hill, Brooklyn\n| Fort Box Fortification\n| Fortification Originally known as Fort Box, Contributing property to NRHP -\n| Built up redoubts named after Major Daniel Box, General Greene's \"Brigade-Major\"—this place is now commemorated by Carroll Park; it was leveled by the British after the war. Noted for decorative cast iron gates and fencing motifs also found on the Soldier and Sailors World War I Monument by artist Eugene H. Morahan.\n| Carroll Park, President St, Brooklyn, NY 11231 - memorial to the fortifications used by Gen. Washington. Charles Carroll (1737-1832), was an American Revolutionary and a signer of the Declaration of Independence. Carroll Street is named after him. A member of the Continental Congress from 1776 to 1778, he also represented the state of Maryland in the U.S. Senate from 1789 to 1792.\n|\n|-\n| Cobble Hill, Brooklyn\n| Ponkiesberg Fortification\n| Ponkiesbergh Fortification Originally known as Fort Cobble Hill, Contributing property to NRHP - Bank built in 1922, 1926 installation of historical marker - is a large bronze plaque in the wall of the former South Brooklyn Savings Institution.\n| Built up redoubts called the “Corkscrew Fort,”, was leveled by the British, then built up for the war of 1812. The redoubt “Smith’s Barbette” was named for Capt. William Smith, the engineer who built the fort.\n| Trader Joe's, 130 Court St, Brooklyn, NY 11201 - memorial to the fortifications used by Gen. Washington to watch by spyglass the Gowanus invasion on Aug.27, 1776. Set on Bergen Hill, it afforded views of Gowanus, Prospect park, and the Upper New York harbor.\n|\n|-\n| Boerum Hill, Brooklyn\n| Fort Greene Fortification\n| Destroyed Fortification Originally known as Fort Greene, Contributing property to NRHP -\n| Built up redoubts named after Gen. Nathanael Greene and commanded by Col. Moses Little — this star-shaped redoubt is not marked; it was leveled by the British after the war.\n| Bond Street, Pacific to Schermerhorn St, 382 State St, Brooklyn, NY 11217 - At that time it held an entire regiment and was the largest fort on Long Island. It was raised on land owned by Simon Boerum (1724-1775), who served as a delegate to the Continental Congress.\n|\n|-\n| Columbia Heights, Brooklyn\n| Fort Stirling\n| Destroyed Fortification - Originally known as Fort Half-Moon, it was on the Brooklyn Heights from Clark st to Orange st.\n| Curved redoubt of 8 guns with an open back; it was fortified by the British for the duration the war, as the position had a commanding view of the harbor. The Fort Greene Chapter of the DAR placed a memorial there.\n| Clark Street & 154 Columbia Heights, Brooklyn, NY 11201 - It was garrisoned by the Hessian troops from nearby fort Brooklyn until the evacuation in 1788. The marker has a Bas-Relief cannon and is next to the fence on the Clark street entrance to the promenade.\n|\n|-\n| Columbia Heights, Brooklyn\n| Fort Brooklyn\n| Destroyed Fortification 1823-25 - Originally known as The Congress, it was planned on the Brooklyn Heights but was abandoned by the Continentals.\n| A British fort 450 feet square with ramparts 40 to 50 feet above a ditch, there were barracks and 2 magazines built in May, 1780.\n| Pierrepont Street & Henry Street, Brooklyn, NY 11201 - fort Brooklyn was occupied until the evacuation in 1783. There is no marker\n|\n|-\n| Brooklyn Heights, Brooklyn\n| Four Chimneys House\n| General Washington's Headquarters Aug.27th-29th, 1776, it was where a war council decided to evacuate Long Island by the Continentals.- Hezekiah Pierrepont (1768-1838) bought the home and the land which he subdivided. Contributing property Historic district, Historic marker\n| Historical Marker installed by the DAR Also called the  \"Retreat Decision\" House. Country home of Philip Livingston, a delegate to the Continental Congress\n| Montague Street & Pierrepont Pl, 2 Montague Terrace, Brooklyn, NY 11201 Brooklyn, NY 11201 - Only the marker remains, the house was demolished to make way for the first suburb in NYC, The Brooklyn Heights Historic District.\n|\n|-\n|}\nReferences\n*\nExternal links\n*[http://www.nysl.nysed.gov/msscfa/sc13605.htm Finding Aid to the Pierrepont Family Papers, 1805-1919] at the New York State Library, accessed May 11, 2016."
    }
  ]
}