{
  "content": [
    {
      "type": "text",
      "text": "# Revolutions (Jean-Michel Jarre album)\n\n| recorded   = 1987–1988\n| venue      =\n| studio     = Croissy studio\n| length     = 44:21\n| label      = Disques Dreyfus\n| producer   = Jean-Michel Jarre\n| prev_title = Rendez-Vous\n| prev_year  = 1986\n| next_title = Jarre Live (Destination Docklands)\n| next_year  = 1989\n| misc       =\n| single2     = London Kid\n| single2date = December 1988\n}}\n}}\n}}\nRevolutions is the ninth studio album by electronic musician and composer Jean-Michel Jarre, first released in September 1988. The album reached number&nbsp;2 in the UK charts, Jarre's best chart position since Oxygène. The Destination Docklands concert in London coincided with the release of the album.\nComposition and recording\nThe album was recorded and mixed at Croissy studio. A key feature of the record is the constant presence of the Roland D-50, a digital synthesizer which Jarre called the \"anti Yamaha DX7,\" complimenting its \"warm sound.\" Revolutions consists predominantly of the synthesizer's presets; despite dismissing the DX7 for permitting a similar reliance, Jarre defended this decision by stating that \"If you like the sound of the piano, you don't try to change or twist the sound. You use it. The same goes for a violin or a clarinet. So, if there is a sound that you like in the synth, why should you go 'no, since it's in the instrument, we should not use it?' That's stupid.\"\nThe song \"London Kid\" was a collaboration with Shadows guitarist Hank Marvin. The title track contains reworked samples of an unpublished composition by Turk Kudsi Erguner, which Jarre had acquired from ethnologist Xavier Bellenger. Jarre, meanwhile, claimed in a 2018 interview that Erguner was hired as a session musician before abruptly suing his past collaborators in a bid for royalties. Regardless, Erguner took his case to court and won a modest indemnity. Jarre removed the flute part — the Ney — from new releases of the record and from live performances, the track was later retitled as \"Revolution, Revolutions\". Jarre stated that he preferred the remixed version of the track, describing the court case with Erguner as \"a good opportunity to change it.\" The title track also featured vocoder by Jarre and Michel Geiss. The track \"September\" is dedicated to South African ANC activist Dulcie September, who was assassinated in Paris on 29 March 1988.\nTrack listing\n1988 vinyl edition\n1988 CD edition\n1991 remaster\nPersonnel\nPersonnel listed in album liner notes:\n* Jean-Michel Jarre – Roland D-50, Korg DSS-1, Korg DSM-1, Fairlight CMI, Synthex, EMS Synthi AKS, OSC OSCar, EMS Vocoder, Dynacord Add-one, Cristal Baschet, Akai MPC60, drum programming, percussions\n* Dominique Perrier – E-mu Emulator, Fairlight CMI, Ensoniq ESQ-1, Roland D-50, Elka Synthex, OSC Oscar, Akai MPC 60 programming\n* Michel Geiss – ARP 2600, Kawai K5, Matrisequencer, Cavagnolo MIDY 20, Elka AMK 800.\n*Henri Loustau – sound engineer\n*Philippe Cusset – assistant\n* Joe Hammer – Drums, Simmons, SDX, Dynacord Add-one\n* Guy Delacroix – Bass guitar\n* Sylvain Durand – Fairlight CMI on \"London Kid\"\n* Hank Marvin – Guitar on \"London Kid\"\n* Jun Miyake – Trumpet and Megaphone on \"Tokyo Kid\"\n* Kudsi Erguner – Turkish flute\n* Patrice Tison – Guitar\n* Mireille Pombo – Vocal chorus on \"September\"\n* Francis Rimbert – Additional synthesizer programming\n* The Bruno Rossignol Choir, directed by Bruno Rossignol – choir on \"Industrial Revolution\", \"London Kid\" and \"The Emigrant\"\n* Female choir from Mali, directed by Sori Bamba – choir on \"September\"\nCharts\n{| class=\"wikitable sortable plainrowheaders\" style=text-align:center\"\n! Chart (1988)\n! Peakposition\n|-\n|-\n|-\n|-\n|-\n|-\n|-\n|-\n|}\nCertifications\nReferences\n;Notes\n;Bibliography\n*\nExternal links\n* [http://www.discogs.com/Jean-Michel-Jarre-Revolutions/master/75910 Revolutions] at Discogs"
    }
  ]
}