{
  "content": [
    {
      "type": "text",
      "text": "# Revolution (Miranda Lambert album)\n\n| recorded   = 2009\n| venue      =\n| studio     = Blackbird StudiosWrucke's House StudioOmniSound Studios\n| genre      = Country\n| length     = 50:52\n| label      = Columbia Nashville\n| producer   = Frank LiddellMike Wrucke\n| prev_title = Crazy Ex-Girlfriend\n| prev_year  = 2007\n| next_title = Four the Record\n| next_year  = 2011\n| misc       =\n}}\nRevolution is the third studio album by American country music singer Miranda Lambert. It was released on September 29, 2009, via Columbia Records Nashville. The album includes the singles \"Dead Flowers\", \"White Liar\", \"The House That Built Me\", \"Only Prettier\", and \"Heart Like Mine\", all of which charted on the U.S. Billboard Hot Country Songs chart.\nRevolution won the Album of the Year award at the Academy of Country Music Awards and at the Country Music Association Awards in 2010.\nContent\nLambert began working on Revolution in February 2009. She wrote or co-wrote all but four of the album's 15 tracks. The album includes co-writes with her ex-husband, then boyfriend, Blake Shelton, who also provides background vocals on \"Maintain the Pain\", and former Columbia Records artist Ashley Monroe. Charles Kelley and Dave Haywood of Lady Antebellum co-wrote \"Love Song\", on which they also sing background vocals. The album also includes covers of Fred Eaglesmith's \"Time to Get a Gun\" and John Prine's \"That's the Way the World Goes 'Round\".\nTo help promote the album, an EP titled Dead Flowers was released on September 8, 2009.\nThe album's lead single, \"Dead Flowers\", was released in May 2009 following Lambert's performance on the 44th Annual Academy of Country Music Awards. The song reached a peak of number 37 in July 2009 after spending sixteen weeks on the U.S. Billboard Hot Country Songs chart. \"White Liar\" was released as the album's second single in August 2009. In November 2009, Lambert performed \"White Liar\" on the 2009 CMA Awards; following this performance, the single became her first Top 40 hit on the U.S. Billboard Hot 100, jumping from number 66 to number 38. It reached a peak of number 2 in February 2010 on the U.S. country chart. \"The House That Built Me\", the third single, was released in March 2010. It became Lambert's fastest-rising single to date, and became her first Number One hit for the week of June 12, 2010, on the U.S. Billboard Hot Country Songs chart, staying at number 1 for 4 consecutive weeks. \"Only Prettier\" was released as the fourth single on July 26, 2010, and debuted at number 45 for the week of July 17, 2010. It reached a peak of number 12 in December 2010. The fifth and final release, \"Heart Like Mine\", was released on January 10, 2011.\nOn September 24, 2009, Lambert performed all the tracks on Revolution in sequence at the Ryman Auditorium, five days before the album's scheduled release date.\nPromotion\nIn promotion for Revolution, Lambert made appearances on Good Morning America, Late Show with David Letterman, and The Ellen DeGeneres Show throughout the first week of the album's release. Additionally, she was featured on the cover story of Country Weekly magazine; she also made appearances in several other magazines, including Rolling Stone and US Weekly.\nLambert began her first headlining tour in support of Revolution. The Roadside Bars & Pink Guitars tour kicked off in March 2010 and included at least 22 stops, including a performance at the Bonnaroo Music Festival.\nCritical reception\n| rev1 = AllMusic\n| rev1Score =\n| rev2 = Billboard\n| rev2Score =\n| rev3 = Entertainment Weekly\n| rev3Score = A\n| rev4 = MSN Music (Consumer Guide)\n| rev4Score = A−\n| rev5 = PopMatters\n| rev5Score = 8/10\n| rev6 = Rolling Stone\n| rev6Score =\n| rev7 = Slant Magazine\n| rev7Score =\n| rev8 = Spin\n| rev8Score = 7/10\n}}\nUpon its release, Revolution received universal acclaim from most music critics. At Metacritic, which assigns a normalized rating out of 100 to reviews from mainstream critics, the album received an average score of 85, based on 11 reviews, which indicates \"universal acclaim\".\nRolling Stone magazine praised the album, writing, \"Lambert remains country's most refreshing act, and not just because she makes firearms seem like a matter-of-fact female accessory.\" Entertainment Weekly magazine wrote, \"She's found stylistic shades of songwriters twice her age...\" and that the album is \"...a portrait of an artist in full possession of her powers, and the best mainstream-country album so far this year.\" The Boston Globe commented that Revolution is the sound of Miranda Lambert coming into her own.\" Slant Magazine also had high praises reserved for the album, writing, \"Miranda Lambert expands on her fascinating, fully realized artistic persona on Revolution.\"\nThe song \"The House That Built Me\" was ranked number 1 on Engine 145's Best Country Songs of 2009. Two additional songs from Revolution also made the list; \"White Liar\" at number 11 and \"Only Prettier\" at number 37.\nCommercial performance\nRevolution debuted at number 1 on the U.S. Billboard Top Country Albums chart, her third consecutive Number One album on the chart. It also debuted at number 8 on the U.S. Billboard 200. The album sold approximately 66,000 copies in the first week of release, her highest first week total to date. In February 2010, Revolution was certified Gold, and in October 2010 the album was certified Platinum by the RIAA. As of  2016, the album has sold 1,790,000  copies in the US.\nAwards and nominations\n{| class=\"wikitable\"\n|-\n!Award\n!Category\n!Result\n|-\n|45th Academy of Country Music Awards\n|Album of the Year\n|\n|-\n|1st American Country Awards\n|Album of the Year\n|\n|-\n|2010 Teen Choice Awards\n|Choice Album – Country\n|\n|-\n|44th Country Music Association Awards\n|Album of the Year\n|\n|-\n|2010 American Music Awards\n|Favorite Country Album\n|\n|-\n|53rd Grammy Awards\n|Best Country Album\n|\n|}\nTrack listing\nPersonnel\nCredits adapted from album's liner notes.\nVocals\n*Miranda Lambert – lead vocals\n*Natalie Hemby – background vocals\n*Kim Keyes – background vocals\n*Mike Wrucke – background vocals\n*Charles Kelley – guest vocalist (on \"Love Song\")\n*Buddy Miller – guest vocalist  (on \"Somewhere Trouble Don't Go\")\n*Ashley Monroe – guest vocalist  (on \"Me and Your Cigarettes\")\n*Randy Scruggs – guest vocalist  (on \"That's the Way That the World Goes 'Round\")\n*Blake Shelton – guest vocalist  (on \"Maintain the Pain\")\n*Chris Stapleton – guest vocalist  (on \"Time to Get a Gun\")\nMusicians\n*Chad Cromwell – drums\n*Fred Eltringham – drums\n*Glenn Worf – bass\n*Richard Bennett – guitar\n*Jim Hoke – guitar, utility\n*Jay Joyce – guitar\n*Randy Scruggs – guitar\n*Mike Wrucke – banjo, acoustic guitar, mandolin, electric guitar, keyboards, Hammond B-3 organ\n*Chuck Leavell – Hammond B-3 organ\n*Eric Darken – percussion\n*Greg Leisz – steel guitar\n*Russ Pahl – steel guitar\nProduction\n*Mike Wrucke – engineering, mixing, producer\n*Eric Tonkin – assistant engineering, mixing assistant\n*Mark Petaccia – assistant engineering\n*Oran Thornton – assistant engineering, mixing assistant\n*Stephen Marcussen – mastering\n*Stewart Whitmore – digital editing\n*Brittany Hamlin – production coordination\n*Frank Liddell – producer\nDesign\n*Randee St. Nicholas – photography\n*Tracy Baskette-Fleaner – creative director, design\n*Judy Forde-Blair – creative producer, liner notes\n*Tammie Harris Cleek – imaging, photo production\n*Enzo Angileri – hair stylist\n*Mylah Morales – make-up\n*David Thomas – stylist\nBusiness\n*Lisa Ramsey-Perkins – A&R\nCharts\nWeekly charts\n{| class=\"wikitable sortable plainrowheaders\" style=\"text-align:center\"\n|-\n! scope=\"col\"| Chart (2009)\n! scope=\"col\"| Peak position\n|-\n|-\n|-\n|-\n|}\nSingles\n{| class=\"wikitable\" style=\"text-align:center;\"\n|-\n! rowspan=\"2\"| Year\n! rowspan=\"2\"| Single\n! colspan=\"3\"| Peak chart positions\n|- style=\"font-size:smaller;\"\n! style=\"width:40px;\"| US Country\n! style=\"width:40px;\"| US\n! style=\"width:40px;\"| CAN\n|-\n| rowspan=\"2\"| 2009\n| style=\"text-align:left;\"| \"Dead Flowers\"\n| 37\n| —\n| —\n|-\n| style=\"text-align:left;\"| \"White Liar\"\n| 2\n| 38\n| 67\n|-\n| rowspan=\"2\"| 2010\n| style=\"text-align:left;\"| \"The House That Built Me\"\n| 1\n| 28\n| 52\n|-\n| style=\"text-align:left;\"| \"Only Prettier\"\n| 12\n| 61\n| —\n|-\n| 2011\n| style=\"text-align:left;\"| \"Heart Like Mine\"\n| 1\n| 44\n| 69\n|-\n| colspan=\"10\" style=\"font-size:8pt\"| \"—\" denotes releases that did not chart\n|}\nYear-end charts\n{| class=\"wikitable plainrowheaders\" style=\"text-align:center\"\n|-\n! scope=\"col\"| Chart (2009)\n! scope=\"col\"| Position\n|-\n! scope=\"row\"| US Billboard 200\n| 170\n|-\n! scope=\"row\"| US Top Country Albums (Billboard)\n| 35\n|-\n! scope=\"col\"| Chart (2010)\n! scope=\"col\"| Position\n|-\n! scope=\"row\"| US Billboard 200\n| 27\n|-\n! scope=\"row\"| US Top Country Albums (Billboard)\n| 7\n|-\n! scope=\"col\"| Chart (2011)\n! scope=\"col\"| Position\n|-\n! scope=\"row\"| US Billboard 200\n| 58\n|-\n! scope=\"row\"| US Top Country Albums (Billboard)\n| 19\n|}\nCertifications\nReferences"
    }
  ]
}