{
  "content": [
    {
      "type": "text",
      "text": "# Revolutionary Workers' Groups\n\n'''Revolutionary Workers' Groups''' (RWG) were left wing groups in Ireland officially founded in 1930 with the objective of creating a Revolutionary Workers' Party. Formed initially as the Preparatory Committee for the Formation of a Workers’ Revolutionary Party, it changed its name in November 1930. It was helped to be established by Bob Stewart and Tom Bell from the Communist Party of Great Britain and Comintern. In 1933 they disbanded and established the Communist Party of Ireland.\nHistory\nThe group produced a weekly paper ''The Irish Workers' Voice'', first issued on April 5, 1930, with the Scottish socialist Tom Bell as its editor. The paper went on to be a publication for the Communist party, and was consistently published up to 1936.\nThey had their headquarters in 64 Great Strand Street in Dublin, which was named \"Connolly House\", opened in 1932 as a socialist bookshop.\nThe RWG ran two candidates in the newly reconstituted 1930 Dublin Corporation election. James Larkin Jnr, was successful. The RWG ran two candidates in Dublin in the 1932 Irish general election, Joseph Troy and Jim Larkin, Jnr. Members also ran in Belfast municipal elections: Tommy Geehan in Falls, and Phil Wilson and William Boyd in Cromac.\nThe RWG was banned by the Cosgrave government in 1931, under the Coercion Act, along with 11 other organisations. The ban was lifted by the de Valera government following the victory of Fianna Fáil at the 1932 general election.\nIn Northern Ireland, the Revolutionary Workers' Groups set up the Outdoor Relief Workers Committee in July 1932, to help workers in the campaign against Task work, and for better conditions and trade union recognition.\nThe RWG headquarters, known as \"Connolly House\", was attacked by anti-communists during the 1933 Dublin riot.\nMembers of the RWG included many Irish communists such as James Gralton and Sean Murray.\nIn June 1933 the Communist Party of Ireland was formed and the RWG disbanded.\nReferences"
    }
  ]
}