{
  "content": [
    {
      "type": "text",
      "text": "# Revolutionary History\n\nRevolutionary History was a British journal covering the history of the far left. It was established by the historians Sam Bornstein and Al Richardson and maintained an editorial board representing many strands of British Trotskyism. In a 2004 edition of the Weekly Worker, the publication was described as \"the premier Marxist historical journal in the world.\"\nJournal scope\nAlongside the history of Trotskyism Revolutionary History articles also covered other anti-Stalinist communist traditions. Most issues were themed and consisted of documents that had either never appeared in English or had been out of print for many years, together with contextual and introductory materials. Some issues consisted of original studies of episodes of revolutionary struggle or studies of specific individuals or organisations. Revolutionary History has been described as the English equivalent of the French journal Cahiers Léon Trotsky.  The journal gained a reputation for its inclusive approach to the history of Trotskyism, having a wide representation of Trotskyist groups on its board, which, at one point, even included a representative of the Socialist Workers Party. Initially focusing on the obscure or unpublished Trotskyist sources from the Balkans, Scandinavia, and Southern and Eastern Asia, it later broadened its scope, covering such topics as the history of the communist movement in France.\nRevolutionary History used the motto ‘Those who do not learn from history are doomed to repeat it’, paraphrasing the philosopher George Santayana in The Life of Reason. The motto was chosen to reflect the publication’s aim to highlight and explore the contribution of small non-conformist groups in revolutionary history.\nPublication history\nRevolutionary History was founded in 1988 as an English-language quarterly by the Trotskyist historians Bornstein and Richardson. Later, the journal would appear approximately once a year and was published through Merlin Press. The editorial board was staffed by several well known Trotskyists including Edward Crawford and Paul Flewers, the former of whose archived correspondence as editor of Revolutionary History is held at the University of London's Senate House. Despite being a British publication, Revolutionary History gained greater recognition in Argentina, France and Sri Lanka. Following the death of founding editor Richardson in 2003, the journal was edited by various visiting editors, alongside the editorial board including the academic Esther Leslie. The first series of Revolutionary History finished in 2013 on volume 11, the journal began a second series in 2015 but thereafter ceased publication. In 2018 the journal’s editorship   issued a statement via its Facebook page stating that the publication was floundering due to a lack of direction and failure to adapt to a contemporary audience. The proposed solution was to further broaden the scope of Revolutionary History beyond the topic of Trotskyism.\nReception\nWhilst Revolutionary History was praised for opening up the histories of the international Trotskyist movement, it was also critiqued for presenting such primary sources uncritically. The journal has also been lauded for bringing Trotskyists back into the history of the workers struggle in the twentieth-century, its ambitious translations of non-English material, championing previously ignored individuals such as Victor Serge, and Marguerite and Alfred Rosmer, as well as largely avoiding the more insignificant history of disputes within various Trotskyist groups.\nIn an exchange with its editor Richardson, the Marxist historian Ian Birchall once criticised the journal for not living up to its motto, quoting the lyrics of the song Bill Bailey to suggest it was too sectarian. Richardson defended the journal, replying “…learning from history can be ‘simple’ – providing you are allowed to get to know about it in the first place.”\nSupplements and side publications\nUnpublished articles were also provided as a digital supplement to Revolutionary History.\nReferences\nExternal links\n*[https://www.marxists.org/history/etol/revhist/backissu.htm Back issues of Revolutionary History journal]"
    }
  ]
}