{
  "content": [
    {
      "type": "text",
      "text": "# Reward dependence__disambig_1\n\nReward dependence (RD) is characterized as a tendency to respond markedly to signals of reward, particularly to verbal signals of social approval, social support, and sentiment. When reward dependence levels deviate from normal we see the rise of several personality and addictive disorders.\nIn psychology, reward dependence is considered a moderately heritable personality trait which is stable throughout our lives. It is an inherited neurophysiological mechanism that drives our perception of our society and the environment. Even though we are born with these personality traits, their expression during our life span can be modulated throughout our development.\nOrigin and definitions\nReward dependence is one of the temperament dimensions from the \"tridimensional personality theory\", which was proposed by C. Robert Cloninger as part of his \"unified bio-social theory of personality\". His personality theory suggested the hypothesis that specific neurochemical transmitters in our brain determine how we respond to a specific stimulus we may experience.\nThese innate personality traits can play a significant role not only in an individual's predisposition to certain disorders, but also in their maintenance of those disorders.\nBy understanding the specific temperamental traits that are common among individuals with specific disorders, clinicians can form a more targeted, informed approach to treatment and look to newer psychotherapies for guidance. The relationship between temperament and individual clusters of DSM personality disorders is often investigated. According to the DSM-IV, the tridimensional structure allows up to nine major personality disorders to be identified, the theory thereby making a great contribution to the understanding of psychiatric disorders.\nCloninger's Tridimension Personality Theory and reward dependence\nCloninger's tridimensional personality theory offers three independent \"temperament\" dimensions which aid in measuring how different individuals feel or behave. Reward Dependence (RD) is one of the three temperament dimensions, the other two being \"Harm Avoidance (HA)\" and \"Novelty Seeking (NS)\". A temperament, according to Cloninger, is the automatic emotional response to experience.\nCloninger suggested that RD is influenced by a single monoamine neurotransmitter system: the noradrenergic system  and RD is correlated with low basal noradrenergic activity. This suggestion has led to several research experiments that have investigated and supported his hypothesis, that RD traits are indeed in part determined by norepinephrine.\nMeasure of the RD dimension, as suggested by Cloninger, is used to assess the Altruistic-warm versus detached-tough mindedness components of our personalities.\nAccording to Cloninger's theory, individuals high in reward dependence and low in norepinephrine levels are ambitious, warm, sentimental, pleasant, sociable, sensitive, sympathetic and socially dependent. Individuals with high RD personalities have a disposition to recognize salient social cues which in turn facilitates effective communication, warm social relations, and their genuine care for others, but these individuals are then disadvantaged in being excessively socially dependent. High reward dependent individuals also exhibit persistent behaviors and are easily influenced by emotional appeals.\nIndividuals low in reward dependence and high in norepinephrine levels are then hypothesized to be typically independent, non-conformist, practical, tough-minded, cynical, unwilling to share their intimate feelings with others, socially detached, irresolute, insensitive to social cues and pressures, and content to be alone. They are also minimally motivated to please others and act for immediate gratification. So being low in reward dependence is related to social withdrawal, with aggressive anti-social behavior, detachment, and coldness in social attitudes.\nThe RD temperament interacts with other temperaments and characters inherent in us enabling us to adapt to life experiences and influence susceptibility to emotional and behavioral disorders\nQuantifying reward dependence\nTwo questionnaires were devised by Cloninger to measure the temperaments and characters of individuals. RD can be measured using both the Tridimensional Personality Questionnaire (TPQ) personality test and by the newer and refined version of the personality test called Temperament and Character Inventory (TCI) and its revised version (TCI-R). Owing to the limitations encountered in the TPQ, in that the three dimensions' clinical utility was not readily apparent to many clinicians, Cloninger revamped the questionnaire and produced the TCI scale, which incorporates four dimensions of \"temperament\" and three dimensions of \"character\".\nThe so-called subscales of RD in TCI-R are\n# Sentimentality (RD1)\n# Openness to warm communication or social sensitivity (RD2)\n# Attachment (RD3)\n# Dependence on approval by others (RD4)\nA study comparing the TCI to the five factor model of personality found that reward dependence was substantially positively associated with extraversion and to a lesser extent openness to experience.\nBrain physiology\nCloninger describes reward dependence as being a prime component of the Behavior maintenance System (BMS). Norepinephrine (NE), apart from producing alertness and arousal, is seen as influencing the brain reward system by aiding in the learning of new paired associations.\nAccording to Cloninger, the norepinephrine neurotransmitter has its major ascending pathways arising in the locus coeruleus in the pons, projecting onward to the hypothalamic and limbic structures, and then branching upwards to the neocortex.\n*Reward dependence has been linked to \"dissociable connectivity streams\" in the brain. Striatal projections and Tracts between the prefrontal cortex predict our individual differences in reward processing, reward dependence and reward-guided behaviors. These findings suggest that personality traits may be affected by the strength of limbic-striatal connectivity.\n:High reward dependence is characterized by learning from reward signals, persisting repetition of actions that are associated with rewards, increased sociability and a need for social approval. The striatum, especially the dorsal regions, is necessary to carry out these functions.\n*Using Positron Emission Tomography (PET) researchers have shown that reward dependence is linked to opiate receptor binding (the endorphin system) in the bilateral ventral striatum: a core substrate of the reward circuit which is strongly implicated in addictive behavior development. These findings demonstrate that people with high reward dependence (who feel a greater need for social rewards and verbal approval) have more opiate receptors found in the ventral striatum, whereas people with low reward dependence have a lower concentration of receptors. It is then suggested that increased ventral striatal opiate receptors could provide the biological link between personality traits and substance abuse risk.\n*fMRI studies have shown that individuals with immature development of the inferior part of the frontal lobe around the midline inner surface of the brain, showed greater reward dependence. People with social reward dependence personalities were also seen to have brains with far less tissue in the fronto-striatal section of the brain (e.g. damage to the fronto-striatal area is often linked to autism and schizophrenia). Relationship between concentration of grey matter (brain-cell containing tissue) in different brain regions and social reward dependence was also studied. It was found that the greater the concentration of tissue in the orbitofrontal cortex (the outer strip of the brain just above the eyes), and in the ventral striatum (a deep structure in the centre of the brain), the higher they tended to score on the social RD measure. The researchers warn that these studies are only correlational and cross-sectional and none of this research is definitive in proving that brain structure determines personality but it could be that personality, through experience, may help in determining the structure of the brain.\n*Social Reward Dependence has also been associated with the temporal lobes, the caudate Grey Matter Density (GMD) in the orbitofrontal cortex and the basal ganglia of the ventral striatum. These structures, which are rich in dopamine receptors, are known to play a crucial role in reward receipt, Incentive anticipation and simple and discrete primary and secondary rewards prediction errors. These significant findings show a correlation between primary reward processing circuits and reward dependence, keeping with the fMRI research studies that demonstrated that, following the experience of complex rewards the activation of the striatal circuits occur.\n:Primary reward processing has also been associated with the orbitofrontal cortex and the grey matter density in the ventral striatum, whereas higher RD scores were associated with the interactions between dopamine projections, neuropeptides and opiates in the ventral striatum. It is demonstrated here, then, that there is evidence for a structural disposition of the brain towards social interactions, and that both sensitivity to salient social reward cues and primary reward processing share the same brain systems.\n:In addition to these findings,  the bilateral temporal poles were also identified in which gray matter density correlated with reward dependence. The medial prefrontal cortex and orbitofrontal cortex, along with other temporal structures, project to the temporal pole, enabling reward stimuli information between the two regions to be integrated. In an fMRI study, the temporal poles and the ventral striatal areas have been shown to be activated in response to social rewards (such as humor) and also in looking forward to simpler rewards (such as money).\nRelationship to clinical disorders\nCloninger's theory suggests that over expression of the RD temperament could cause psychiatric illnesses, such as addictive behaviors, sociopathies, and personality disorders.\nLow levels of norepinephrine cause an increase in reward dependence. When produced in normal levels, norepinephrine creates a sense of well-being, but low levels of norepinephrine cause symptoms of depression, lack of arousal and lack of motivation. In humans, this leads to then a negative feedback mechanism whereby we seek out pleasurable activities to remove the negative affect caused by the low levels of norepinephrine, therefore increasing our reward dependence.\nAn increase in the RD temperament leads us to seek out those behaviors or substances that will allow us to remain in a pleasant physical and/or mental state, attributing to the fact that we humans are hedonistic individuals, seeking to avoid pain and embracing pleasurable stimuli. Our pleasure and reward systems in the brain are hyper-activated, which makes us display continuous approach behaviors to the reward in question. Our neuro-circuitry is as such that when we stop having access to such pleasurable objects of desire, we then experience negative consequences (withdrawal symptoms). Addictive behaviors then arise to alleviate such negative consequences and the cycle continues.\nRelationship to addictive behaviors\nPeople who have high reward dependent personalities but find themselves in situations where they are unable to find rewards and approval through family support or other types, will seek reward through other means e.g. substance abuse or over-eating. It is then suggested that individuals with such predispositions should adopt preventive strategies or avoid such situations, where they seek such rewards that could potentially have adverse consequences. Reward dependence drives behavior maintenance systems, and in addictive behaviors, maintenance of behaviors occurs despite adverse consequences.\nAccording to researchers the reward circuit is continuously involved in initiating behaviors that are essential for the sustenance of the individual (such as eating) or of the preservation of the species (such as sexual reproduction). Food intake or sexual stimuli then lead to endorphin regulated release of dopamine in core substrates of the reward processing system, which subsequently activate craving sensations. The development of addictions is then directly related to the acquired or genetic abuse of the reward circuit. This finding then suggests that individuals with increased reward dependence have a relative deficit of endorphins and are possibly at higher risk for developing addictive behaviors.\nAdolescents low in reward dependence may find conventional sources of reward unfulfilling (e.g., academic achievement or activities involving social affiliation), and eventually turn to unconventional reward sources (e.g., smoking and other forms of substance misuse) to derive satisfaction and pleasure. A study conducted using adolescents with Excessive Internet video Game Play (EIGP) showed that such addictive behaviors were correlated with higher RD scores on the TCI, whereas both low and high scores of RD were implicated in specific alcoholic and drug addictions.\n* Proposed Type 1 Alcoholism is clinically characterized by a late onset (after the age of 25) of alcohol-related problems (usually after an extended period of drinking that is socially encouraged), strong psychological dependence (loss of control) with guilt and fear about alcohol dependence, and rare occurrence of fighting and arrests after drinking. Psychologically, it is proposed to be characterized by high reward-dependence (in both males and females).\n:Low reward dependence is then hypothesized to fit the psychological profile of Type 2 Alcoholism (predominantly in males). Type 2 Alcoholism is clinically characterized by an early onset of alcohol-related problems before the age of 25 (independent of external circumstances), drinking often associated with antisocial behavior, spontaneous alcohol-seeking behavior (inability to abstain), low associated guilt and fear, and frequent fighting and arrests after drinking. This combination of traits also describes people with Antisocial Personality Disorder (ASPD) and is consistent with findings that type 2 alcoholics frequently suffer from ASPD. Since the inception of these theories they have been tested in several investigations and the results have been consistent with the theories.\n*The likelihood of becoming a smoker has also been linked to reward dependence. Both males and females were seen to score low in the Sentimentality-Dependence-Attachment subscale of RD, possibly accounting for indifference towards social pressures to quit. Whereas they scored high on the Persistence sub scale of RD, representing resistance to extinction of previously rewarded behavior thereby reengaging in the addictive behavior.\n*Craving has increasingly received attention as a critical phenomenon in addictive psychopathology.  Craving has been defined as \"the desire or the memory of a pleasant experience superimposed on a negative affective state\".  Hence, conceptually, craving combines elements of desire/motivation and emotions. Pathologic gamblers with an addictive personality have been linked to high RD scores. Pathological gambling disorder (PGD) is defined as incessant and repetitive gambling behaviors that cause significant disruption in an individual's day-to-day life. The positive relation of gambling craving to depression and negative relation to reward dependence suggests that, individuals who have a lesser disposition to experience positive emotions are the ones who most miss gambling when abstaining. Meanwhile, pathologic gamblers seem to turn to gambling as a way to cope with depressive feelings and lack of positive experiences in life. Pathologic gamblers would potentially benefit from interventions targeting early relief of depression symptoms and replacement of the activity and joy once prompted by gambling.\n:fMRI studies also show that brain systems involved in the processing of primary rewards, such as the striatum, may sub serve social rewards processing.  Since higher RD scores are also correlated to the basal ganglia of the ventral striatum, this explains why Parkinson's disease (PD) patients on medications indulge in impulsive gambling behaviors. Pathologic gamblers were shown to experience stronger cravings than did Alcohol-Dependent Subjects (ADS). This may be a disturbing experience for pathologic gamblers and a potential cause for relapse.\nRelationship to personality disorders\nSocial reward dependence is hypothesized to be related to behaviors that represent the RD personality dimension sub-scales of social sensitivity and attachment. It is suggested that the brain substrates that are involved in the response to simple primary rewards stimuli are also implicated in the response to complex social rewards stimuli. The RD sub-scale from the TCI inventory measures how sensitive individuals are to social rewards. High RD scores on the test correlate to increased attachment and an increased need for social relationships. Low RD scores show a movement towards social detachment and insensitivity.\n*According to Cloninger's model, the early life onset of neuropsychiatric disorders lead to personality disorders, with individuals having low RD scores. Antisocial personality disorder (ASPD) is characterized in behavioral terms by childhood or adolescent onset of recurrent antisocial behavior. Cloninger had predicted from his biosocial theory that individuals most at risk of aggressive, antisocial behavior, will be those with lower RD scores and these individuals are equated with the primary psychopaths who show aloofness and social detachment. Particular research conducted on childhood behavior has tested this theory and researchers have shown that children with lower RD scores have more of an anti-social profile as defined in the DSM, and are at highest risk for early onset of frequent delinquent behavior.\n* Lower scores of RD were also seen in obsessional personality, attention deficit hyperactivity disorder (ADHD) and in Borderline Personality Disorder (BPD) individuals, who exhibit symptoms leading to self-harm due to social detachment and feelings of rejection, whereas higher scores of RD were shown in Histrionic Personality Disorder (HPD) and Dependent Personality Disorder individuals who exhibit behavioral instability and poor emotional control.\n*Studies in autistic disorder and Asperger syndrome have shown results, where lower oxytocin levels and lower RD scores were reported in these children leading to their abnormal social behaviors. The direction of the effect i.e. whether reduced oxytocin leads to decreased affiliation or vice versa has not been clearly established. Recent animal studies would, however, suggest that changes to oxytocin lead to changes in behavior.\n:Also a significant positive correlation between plasma oxytocin levels and RD personality dimension was found by researchers in New Zealand. Considerable evidence from animal studies has shown oxytocin to be involved in the processing of social information and the regulation of social affiliative behavior. Results from studies measuring plasma oxytocin levels in patients with a diagnosis of major depressive episode according to DSM III-R has shown decreased oxytocin levels in these patients and lower RD scores on the TCI, leading to an assumption that lower reward dependence leads to depression.\n:Lower RD scores and decreased plasma oxytocin levels have also typically been associated with paranoid, schizoid and schizotypal personality disorders.\n*In another study conducted with patients with Above-normal Plasma Vasopression (AVP) depression, it was found that these patients had lower RD scores than controls and other patients with depression disorders. In this case a directional relationship was found in which the low reward dependence is a state-dependent characteristic of patients with AVP depression, and not vice versa.\n:Research has also found a low expression of reward dependence in suicide attempters. These findings and the negative correlation between reward dependence and the number of suicide attempts may suggest the implication of the noradrenergic pathway in suicide behaviors. Low scores of RD have also been implicated in showing criminality in adult age.\nAt the 2010 Annual meeting of the American Psychological Association (APA), a study looking at treatment methods of personality disorders was presented in which it was found, that panic disorder patients with higher RD scores were more resistant to Escitalopram treatment. Since long-term pharmacotherapy is needed for treatment of panic disorder, the present results suggest that development of therapeutic strategy for panic patients with high reward dependence is needed.\nOther clinical disorders\nIn response to a lack of social reward, individuals with high reward dependence are more likely to have increased noradrenergic activity. These individuals experience feelings of depression, agitation and extreme discontent, leading them to indulge in habits that reinforce reward-seeking, such as increased sexual activity or overeating.\nIndividuals with higher reward dependence also look for more social approval, and are more inclined to succumb to peer-pressure. They often become overly concerned with their body image and maybe prone to eating disorders, such as Bulimia nervosa. Whereas restricting anorexia, in particular, tends to reflect low reward dependence.\nReward dependence is not consistently associated with diagnosis but can also significantly affect treatment issues, such as Therapeutic alliance. Persistence in completing weight-loss programs were related to high RD scores during pre-treatment. This demonstrates that, having higher reward dependence enhances an individual's disposition to being more dedicated and sociable, making them increasingly respond to societal pressures, thereby reducing their risk of dropping out from weight-loss programs.\nOther research\nA study of norepinephrine levels in gamblers found high cerebrospinal fluid (CSF) levels of the norepinephrine (NE) metabolite 3-methoq-4-hydroxyphenylglycol (MI-IPG). This could suggest a relationship between the noradrenergic system and gambling, and gambling could be seen as a reward-dependent behavior, but according to Cloninger's theory these gamblers should exhibit low levels of NE, not high. Cloninger suggests that had these gamblers been retested after they had refrained from gambling for a determined period, their CSF MHPG levels might have been low. A study of norepinephrine levels in alcoholics with high reward dependence also showed a significant decrease of MHPG in their CSF. This finding demonstrates a significant relationship between reward dependence and norepinephrine.\nSeveral genes have also been found to express the RD temperament dimension. Specifically, the gene MAOA-uVNTR has been highly implicated in evoking the RD personality trait.\nSee also\n* Substance dependence\n* Dopamine\n* Reward system\n* DSM\n* Personality disorder\n* Harm avoidance\n* Novelty seeking\n* C. Robert Cloninger\nReferences"
    }
  ]
}