{
  "content": [
    {
      "type": "text",
      "text": "# Reworking Race\n\n'Reworking Race: The Making of Hawaii's Interracial Labor Movement' is a 2006 book by Moon-Kie Jung on Hawaii's shift from a conservative oligopoly to one of the most progressive parts of the United States.\nReception\nJose M. Alamillo credits Jung's \"sound research, crisp narrative, and innovative reworking of the concept of 'interracialism'\" in his review for The American Historical Review. Alamillo says that \"Jung effectively rescues the concept of 'interracialism' from scholars whose exclusive focus on its negative dimensions overlooks its 'affirmative transformation of race.\" Though Alamillo notes a lack of focus on women, gender, and relations beyond the workplace, he suggests that Jung's work remains quite strong in how it \"helps us understand how an interracial labor movement helped make Hawaii into one of the most progressive states in the country.\"\nJohn H. M. Laslett says in his review for the Journal of American Ethnic History that \"Moon-Kie Jung's book makes a major contribution to the ongoing debate about the nature and sources of American working-class solidarity,\" highlighting the book's \"carefully researched\" nature and Jung's \"persuasive case for his 'fusion argument.'\" Laslett mentions a few \"minor weaknesses.\" First, he notes that Jung's argument \"may not be quite as original as he claims\" given that \"Robin Kelley, Tomas Almaguer, and Alexander Saxton have made similar points about race, class, and labor struggles.\" Second, Laslett argues that, though Jung says that the arguments about Hawaii's racial cohesion apply to other contexts, Jung \"makes no references to situations in which race and class--or gender--loyalties continued to remain in conflict.\" Third, Laslett argues that \"Jung's study is also a bit too narrowly focused on racial and class tensions in the workplace to be entirely persuasive.\"\nAwards\nReworking Race won a variety of awards from the American Sociological Association (ASA). Jung's 2003 paper \"Interracialism: The Ideological Transformation of Hawaii's Working Class\", later integrated into the book, won the ASA's 2004 Honorable Mention for the Labor and Labor Movements' Distinguished Scholarly Article Award. In 2007, the book was the ASA's Outstanding Contribution to Political Sociology. In 2008, the book won the ASA's Book Award.\nReferences"
    }
  ]
}