{
  "content": [
    {
      "type": "text",
      "text": "# Rhondda Heritage Park\n\nRhondda Heritage Park, Trehafod, Rhondda, South Wales, is a tourist attraction which offers an insight into the life of the coal mining community that existed in the area until the 1980s.\nVisitors can experience the life of the coal miners on a guided tour through one of the mine shafts of the Lewis Merthyr colliery. Tours are led by former colliery workers. Rhondda Heritage Park is an Anchor Point of ERIH, The European Route of Industrial Heritage.\nRhondda Heritage Park exists on the site of the former Lewis Merthyr Colliery as a testament to the coal mining history of the Rhondda Valleys, which until the end of the 20th century was one of the most important coal mining areas in the world: in an area only  long, Rhondda alone had over 53 working collieries at one time.\nHistory of the Lewis Merthyr Colliery\nAlthough coal was mined as early as the seventeenth century in the Rhondda for domestic purposes, the earliest recorded opening and mining of a safe coal level was in 1790 by Dr Richard Griffiths, who was also responsible for bringing the first tram road into the Rhondda. Subsequently, Walter Coffin opened and sunk the first pits paving the way for the discovery of rich and prosperous steam coal seams with many more lines to follow.\nTwo pits were opened in 1850 on what was to become the Lewis Merthyr site:\n*Hafod by two brothers David and John Thomas\n*Coed Cae by Edward Mills\nBoth pits had to be abandoned early on due to the conditions of the workings.\nIn the mid-1870s William Thomas Lewis (later Lord Merthyr) purchased and reopened the two pits, mining the upper bituminous (household) coal seams, until Hafod closed around 1893 and Coed Cae in the 1930s.\nBy 1880 WT Lewis had sunk the Bertie shaft, and in 1890 the Trefor shaft (both named after his sons), by which time the company had become known as the Lewis Merthyr Consolidated Collieries Ltd, employing some 5,000 men and producing almost a million tons of coal annually. The two headframes and associated colliery buildings are now Grade II* listed buildings.\nIn 1904 the company sunk the Lady Lewis Colliery  to the north east in the Rhondda Fach. In 1905 the company acquired Universal Colliery at Senghenydd, which was later to suffer the worst ever mining disaster in British history. In 1929 the colliery became part of the Powell Dyffryn Group, and in the same year Coed Cae stopped winding coal. Hafod No 2 followed, and Hafod No 1 in 1933. The colliery was nationalised in 1947.\nIn 1958 Lewis Merthyr Colliery and the neighbouring Ty Mawr Colliery merged and all coal winding ceased at Lewis Merthyr, with coaling continuing via Ty Mawr and men and supplies only at Lewis Merthyr. By 1969 the Colliery had become the Ty Mawr/Lewis Merthyr Colliery. As many as thirteen seams have been worked at the Lewis Merthyr using the advanced longwall method of working with most of the coal being won with pneumatic picks and hand loaded onto conveyors.\nUntil the 1950s the coal industry maintained a steady level of production and employment, but since that time there has been a continuing decline in the number of miners in employment. Most of the pits which have been closed have still left coal to mine, but with oil and coal available more cheaply from abroad the demise of the industry has been inevitable. Nowhere has the decline of the coal industry been more dramatic than in the South Wales Coal Field. At Lewis Merthyr production came to an end on the 14 March 1983 with production continuing in the four feet seam until July when coaling ceased forever at Ty Mawr/Lewis Merthyr.\nBy 1990 not one productive colliery existed in the Rhondda. Rhondda's past has been captured and preserved as an historic landmark at the Lewis Merthyr Colliery, now the Rhondda Heritage Park.\nMiner's Lamp Memorial\nMining Memorial at Rhondda Heritage Park\nIn May 2000, a  replica Miner's Lamp monument was unveiled at the entrance of Rhondda Heritage Park. According to the plaque on the monument it was erected \"as a memorial to all those who through accident, disaster or disease, lost their lives or otherwise suffered as a result of the mining industry of the South Wales coalfield\". The memorial was unveiled by Rhondda-born actor Glyn Houston.\nLewis Merthyr Band\nLewis-Merthyr Band\nThe Lewis-Merthyr Band remains active to the present day. Founded in or before 1855, the band has been highly successful, winning numerous contest accolades, and continues to perform across Wales and wider. Lewis-Merthyr Band is believed to be the oldest instrumental ensemble in Rhondda, still currently in existence.\nSee also\n*Big Pit National Coal Museum\n*National Coal Mining Museum for England\nReferences\nExternal links\n*[http://www.rhonddaheritagepark.com Rhondda Heritage Park]\n*[http://www.heritageparkhotel.co.uk/ Heritage Park Hotel]\n*[http://www.welshcoalmines.co.uk Welsh Coal Mines website - all the pits with brief histories]"
    }
  ]
}