{
  "content": [
    {
      "type": "text",
      "text": "# Richard M. Edwards\n\n|birth_place        = Philadelphia, Tennessee, U.S.\n|death_date         =\n|death_place        = Johnson City, Tennessee, U.S.\n|resting_place      = Fort Hill Cemetery Cleveland, Tennessee\n|profession         = Attorney\n|spouse             = Mary Craigmiles (m. 1851)\n|religion           =\n|relations          =\n|residence          =\n|party              = Democratic Greenback\n|education          =\n|signature          =\n|allegiance=  United States of America\n|branch=\n|serviceyears= 1862&ndash;1865\n|rank=  Colonel\n|unit=\n|commands= 4th Reg. Tenn. Volunteer Cavalry (1862&ndash;1863)\n|battles= American Civil War\n|awards=\n|laterwork=\n}}\nRichard Mitchell Edwards (December 31, 1822 &ndash; January 19, 1907) was an American attorney, politician and soldier who served one term in the Tennessee House of Representatives (1861&ndash;1862). A Southern Unionist, he represented Bradley County at the East Tennessee Convention in 1861, and served as colonel of the 4th Tennessee Cavalry of the Union Army during the Civil War. He ran unsuccessfully for governor on the Greenback Party ticket in 1878 and 1880.\nEarly life\nEdwards was born near Philadelphia, Tennessee, in what was then Roane County, but is now part of Loudon County. He may have been orphaned at a young age, and was raised by his uncle, Dr. Pleasant James Riley Edwards. In 1836, he moved with his uncle to Cleveland, Tennessee, where his uncle became a prominent physician, and would eventually be elected mayor. The younger Edwards would later recall spending much of his childhood \"fishing, hunting and playing with the Indian boys of the Ocoee district,\" and remembered the departure of his Cherokee friends on the Trail of Tears as one of the \"saddest\" days of his life. In the early 1840s, Edwards attended Cleveland's Oak Grove Academy.\nIn November 1847, during the Mexican–American War, Edwards enlisted in Company I of the 5th Tennessee Volunteer Infantry, and was elected the company's corporal. After traveling downriver via flatboat to New Orleans, he arrived with his company in Veracruz in January 1848. In February, he took part in skirmishes in the Orizaba area, and helped escort General William G. Belknap from Veracruz to the National Bridge (en route to Mexico City). In April 1848, he was appointed hospital steward at Veracruz by Dr. Barclay McGhee, a prominent Monroe County physician who was serving as a military surgeon. He later wrote that he helped alleviate an outbreak of yellow fever by using a water cure that his uncle had taught him. He was discharged in July 1848.\nAfter the war, Edwards studied law under Samuel A. Smith, and was admitted to the bar. He married Mary Lucinda Craigmiles in 1851, and commenced the practice of law in Cleveland, initially specializing in \"legal affairs for soldiers.\" A Democrat, he supported Andrew Johnson for governor in 1853, and was appointed vice president of the state's Democratic Party convention in April of that year. After Johnson won the election, he appointed Edwards to the Board of Directors of the East Tennessee and Georgia Railroad.\nCivil War\nDuring the contentious 1860 presidential election, Edwards campaigned for the Northern Democratic candidate, Stephen Douglas, and openly opposed the Southern Democratic candidate, John C. Breckinridge. As the secession crisis intensified in 1861, he remained committed to the Union, and endorsed his district's Unionist congressional candidate, George W. Bridges, in March of that year. Edwards was a delegate to the Knoxville and Greeneville sessions of the pro-Union East Tennessee Convention in May and June 1861, and represented Bradley County on the Convention's powerful business committee at both sessions. While in Greeneville, Edwards made a pact with several other Convention delegates, including Joseph A. Cooper and Robert K. Byrd, to return to their respective homes and raise and drill companies for military service.\nIn August 1861, Edwards was elected to the Tennessee House of Representatives seat for Bradley County. Since the state had seceded and joined the Confederacy, Edwards and several other Unionist members of the legislature—including John M. Fleming, Robert H. Hodsden, and Dewitt Clinton Senter—were required to take the Confederate oath of allegiance in order to take their seats. He remained with the legislature until February 1862, when the Union Army's capture of Nashville forced the state government to flee. In March 1862, he joined the commissary of the Union Army's First Tennessee Regiment, led by fellow East Tennessee Convention delegate General James G. Spears.\nCommissioned by Tennessee's military governor Andrew Johnson to raise a cavalry regiment, Edwards spent the Spring of 1862 recruiting soldiers and acquiring horses and other supplies for what would initially be known as the First East Tennessee Cavalry. By July he had recruited over 400 men, including future congressman Jacob Montgomery Thornburgh (who was appointed lieutenant-colonel of the regiment) and Sevier County sheriff and bridge burner William C. Pickens. In September, Edwards and his burgeoning regiment marched with General George W. Morgan from the Cumberland Gap area to Greenup, Kentucky, on the Ohio River. After he and Pickens quarreled over who should command the regiment, Pickens and several of the recruits split off in hopes of forming their own regiment.\nIn November, the First East Tennessee was transferred to the Army of the Cumberland and ordered to Louisville, Kentucky, where Edwards continued to recruit men from among the East Tennessee Unionist refugees who were flocking to the area. The competition among the new regiments for recruits was intense. At one point, Governor Johnson's son, Robert Johnson, who was commanding one of the new regiments, was placed under house arrest for enticing 125 men away from Edwards' regiment. In January 1863, Edwards and his regiment were ordered to Nashville. Here, they engaged primarily in drilling and performing scouting operations. To avoid confusion with an infantry division that had previously been promised conversion to cavalry as soon as horses became available, the First East Tennessee was redesignated the Fourth Tennessee Volunteer Cavalry.\nOn July 6, 1863, Edwards resigned his command of the Fourth Tennessee. Several factors had converged to force his resignation. First, he had yet to take the oath of allegiance, which required Union Army officers to swear they had never served in the Confederate government (Edwards had taken the Confederate oath in order to take his seat in the state legislature in late 1861). Furthermore, several Union Army commanders had grown skeptical of Edwards after he endorsed a speech by New York congressman Sunset Cox that criticized President Abraham Lincoln's war policy. Finally, Edwards' ability to command was questioned after he became embroiled in an internal quarrel with a regimental surgeon. After resigning, Edwards continued to recruit men, hoping at some point to reassume command of the Fourth.\nPostwar politics\nDuring the years following the Civil War, Edwards supported the allies of President Andrew Johnson—commonly called \"Conservatives\"—who sought more lenient measures toward former Confederates. He spoke out against the policies of Tennessee's Radical Republican postwar governor, William G. Brownlow, specifically Brownlow's \"franchise\" laws aimed at preventing former Confederates from voting. At a Conservative rally in Athens, Tennessee, in March 1867, Edwards called for armed resistance to the franchise laws, and was arrested for making \"insurrectionary and treasonable speech.\" He was convicted of using seditious language and barred from holding public office for three years, though the conviction was overturned on appeal in April 1868. Following the enaction of the new state constitution in 1870, Edwards ran for district attorney general, but was defeated by A.J. Trewhitt.\nIn 1878, Edwards ran for governor on the populist Greenback ticket. During this period, the dominant issue in state politics was over how to manage the state's out-of-control debt, much of which had been accrued due to railroad construction. Edwards blamed railroad bondholders for the debt, going so far as to accuse them of plundering the state treasury, and calling for the state to invalidate railroad bonds. A Knoxville Chronicle reporter who interviewed Edwards during this period noted, \"he chews the stump of his cigar as if he had a bondholder between his teeth, or a railroad magnate, and wished to crush every bit of life out of them.\" In the election, he placed a distant third, winning just 15,155 votes to 89,958 for the victorious Democratic candidate, Albert S. Marks, and 42,284 for the Republican, Eli M. Wight.\nEdwards once again ran for governor on the Greenback ticket in 1880. He expressed disappointment over how Marks had managed the debt issue, and accused Marks of allowing the state's workers to be \"plundered by soulless corporations.\" He managed to win just 3,459 votes, however, well behind the Republican candidate, Alvin Hawkins (103,964 votes), the \"state credit\" Democrat, John V. Wright (73,783), and the \"low tax\" Democrat, S.F. Wilson (57,080). Edwards opted against a third bid for governor in 1882, instead endorsing the Democratic candidate, William B. Bate.\nLater life\nEdwards spent his later years writing stories and memoirs for newspapers and other publications. These included a multipart series on his Mexican–American War experiences, which appeared in the Knoxville Tribune in the mid-1890s, and has since been edited and republished as a book, Down the Tennessee: The Mexican War Reminisciences of an East Tennessee Volunteer, by historian Stewart Lillard. Edwards also wrote the chapter, \"Bradley County and the Town of Cleveland, Tennessee,\" for the 1893 book, East Tennessee: Historical and Biographical.\nEdwards died at the Soldiers' Home in Johnson City, Tennessee, on January 19, 1907. He was interred in Fort Hill Cemetery in Cleveland.\nSee also\n*Daniel C. Trewhitt\nReferences\nExternal links\n*\"[https://books.google.com/books?id=i-4xAQAAMAAJ&dq=%22r.+m.+edwards%22+cleveland+tn&pg=PA355 Bradley County and the Town of Cleveland, Tennessee]\" &mdash; chapter written by Edwards for the 1893 book, East Tennessee: Historical and Biographical"
    }
  ]
}