{
  "content": [
    {
      "type": "text",
      "text": "# Richard Griffiths (historian, born 1935)\n\n| birth_place        = Barry, Vale of Glamorgan, Wales\n| death_date         =\n| death_place        =\n| death_cause        =\n| nationality        =\n| citizenship        =\n| other_names        =\n| occupation         =\n| period             =\n| known_for          =\n| title              =\n| boards             =\n| spouse             =\n| partner            =\n| children           =\n| parents            =\n| relatives          =\n| awards             = Knight of the Ordre des Arts et des Lettres (1988)Freeman of the City of London (1992)Officer of the Ordre des Palmes académiques (1998)\n| website            =\n| education          = King's College, Cambridge (BA, PhD)\n| alma_mater         =\n| thesis_title       = The dramatic technique of Antoine de Montchrestien\n| thesis_url         =\n| thesis_year        = 1960\n| school_tradition   =\n| doctoral_advisor   = Donald Beves\n| academic_advisors  = Robert Bolgar\n| influences         =\n| era                =\n| discipline         = Modern historyHistory of literature\n| sub_discipline     = History of fascism and the far rightHistory of Catholic literature\n| workplaces         = Selwyn College, Cambridge (1960–66)Brasenose College, Oxford (1966–74)University College, Cardiff (1974–87)King's College London (1990–2000)Diocese of Oxford (1997–2000)Diocese of Llandaff (2000–2010)\n| doctoral_students  =\n| notable_students   =\n| main_interests     =\n| notable_works      = Fellow Travellers of the Right: British Enthusiasts for Nazi Germany 1933–9 (1980)\n| notable_ideas      =\n| influenced         =\n| signature          =\n| signature_alt      =\n| signature_size     =\n| footnotes          =\n}}\nRichard Mathias Griffiths (born 21 June 1935) is a Welsh historian and literary scholar, specialising in the history of the European extreme Right and the history of Catholic literature, and an Anglican priest in the Church of Wales. He is Emeritus Professor of French Literature at King's College London and a former professor of the University College, Cardiff.\nBiography\nHe was born in Barry, Glamorgan, as a great-grandson of William Henry Mathias (1845–1922), a railway contractor and coal mine owner in Rhondda. He was educated at Lickey Hills Preparatory School at Hillscourt House in Lickey (1944–48) and at Lancing College in West Sussex (1948–53). He took his BA in Modern Languages at King's College, Cambridge and completed his PhD in French on \"The dramatic technique of Antoine de Montchrestien\" at the University of Cambridge in 1961.\nHe began his academic career as a fellow of Selwyn College, Cambridge (1960–66) and then of Brasenose College, Oxford (1966–74), holding a Common University Fund lectureship at the University of Oxford from 1967 to 1974. He was a councillor and vice-chairman on the Oxford City Council (1968–1972), serving on its central area redevelopment committee.\nHe was the Chair of French at University College, Cardiff from 1974 to 1987. At Cardiff, he headed the Department of French (1974–87) and acted as the Deputy Principal for Humanities and Social Sciences (1982–85). He sat on the Arts Council of Wales (1980–1988) and was president of the Society for French Studies from 1984 to 1986.\nHe served on the General Advisory Council of the BBC (which advised the Board of Governors of the BBC) between 1986 and 1990.\nHe then moved to King's College London, where he was Professor of French from 1990 to 2000, Head of the Department of French (1990–98) and Director of the Research Centre for Twentieth-Century Cultural Studies (1992–2000). He was elected vice-president of the Institute of Linguists (1990–1995). From 1992 to 1994, he also held the positions of a vice-principal of King's College London (during the tenure of Arthur Lucas), and of a director of KCL Enterprises Limited. He also chaired a committee of the Higher Education Funding Council for Wales (1992–1997) and the board of trustees of the Cambridge House charity (1994–1996).\nTowards the end of his academic career he was ordained as a priest of the Anglican Church in Oxford and in 1997 became a non-stipendiary minister in the Diocese of Oxford, serving as a curate in the parishes of West Woodhay with Enborne, Hamstead Marshall, Inkpen and Combe. He moved to the Diocese of Llandaff in 2000, exercising pastoral duties first in the parish of Llantrisant, Miskin and Beddau until 2004 and then in Penarth and Llandough until 2010. He was a director of the Penarth Arts and Crafts Limited from 2003 to 2010. In 2007, he became the chairman of the Penarth Cytûn. He received a permission to officiate within the same diocese in 2010.\nHe is a member of the editorial board of the University of Wales Press and a member of Literature Wales since 1985.\nWork\nHe has written studies on the history of the far right and antisemitism in Britain and France, on the Catholic literary revival, French Renaissance literature, and Welsh business history. He has been concerned with what a reviewer of his book has called \"the general tendency of European Catholicism to favour political movements which later became identified with fascism\". His first book had gained him the reputation of \"the man who had read more appalling French novels than anyone known\" among his French students. In the preface to that book, he described himself as \"not a Roman Catholic, though … extremely sympathetic to that religion\".\nPublications\nAuthored\n* [https://archive.org/details/reactionaryrevol1966grif The Reactionary Revolution: The Catholic Revival in French Literature, 1870–1914] (London: Constable, 1966)\n** updated French edition: Révolution à rebours&nbsp;: le renouveau catholique dans la littérature française (1870-1914) (Paris: Classiques Garnier, 2020) [1st edn. 1971]\n* [https://archive.org/details/dramatictechniqu0000unse_s9a7 The Dramatic Technique of Antoine de Montchrestien: Rhetoric and Style in French Renaissance Tragedy] (Oxford: Clarendon Press, 1970)\n* [https://archive.org/details/marshalpetain0000grif Marshal Pétain] (London, Constable, 1970; reprinted 1994)\n* [https://archive.org/details/fellowtravellers0000grif Fellow Travellers of the Right: British Enthusiasts for Nazi Germany 1933–9] (London: Constable, 1980; reprinted by Oxford University Press, 1983)\n* Garnier: Les juifves (London: Grant & Cutler, 1986) [a critical guide to Robert Garnier's play]\n* [https://archive.org/details/useofabusepolemi0000grif The Use of Abuse: The Polemics of the Dreyfus Affair and its Aftermath] (New York: Berg, 1991)\n* Le singe de Dieu&nbsp;: François Mauriac entre le \"roman catholique\" et la littérature contemporaine, 1913-1930 (Le Bouscat: L'Esprit du temps, 1996)\n* [https://archive.org/details/patriotismperver0000grif/page/n5/mode/2up Patriotism Perverted: Captain Ramsay, the Right Club and British Anti-Semitism, 1939–40] (London: Constable, 1998)\n* ''[https://archive.org/details/intelligentperso0000grif/ An Intelligent Person's Guide to Fascism] (London: Duckworth, 2000; reprinted as [https://archive.org/details/fascism0000grif_u3h1/ Fascism], London: Continuum, 2005)\n* Poetry and Prayer (London: Continuum, 2005)\n* The Pen and the Cross: Catholicism and English Literature, 1850–2000 (London: Continuum, 2010)\n* The Entrepreneurial Society of the Rhondda Valleys, 1840–1920: Power and Influence in the Porth-Pontypridd Region (Cardiff: University of Wales Press, 2010)\n* What Did You Do During the War? The Last Throes of the British Pro-Nazi Right, 1940–45 (London: Routledge, 2015)\n* Essais sur la littérature catholique (1870-1940): Pèlerins de l'absolu (Paris: Classiques Garnier, 2018)\n* France's Purveyors of Hatred: Aspects of the French Extreme Right and its Influence, 1918–1945 (London: Routledge, 2021)\nEdited or translated\n* (ed. and trans.) Joris-Karl Huysmans, Parisian Sketches: A Translation of Croquis parisiens (London: Fortune Press, 1960)\n* (ed.) [https://archive.org/details/claudelreapprais0000unse/ Claudel: A Reappraisal], (London: Rapp & Whiting, 1968)\n* (ed.) Henry de Montherlant, Port-Royal (Oxford: Basil Blackwell, 1976)\n* (ed.) Raymond Radiguet, Le diable au corps (Oxford: Blackwell, 1983)\n* (ed.) Étienne Jodelle, Les amours (London: Institute of Romance Studies, 1994)\n* (ed., with Vanessa Davies) The Literature of Colonialism'' (London: King's College Centre for Twentieth-century Cultural Studies, 1996)\n* (ed.) The Bible in the Renaissance: Essays on Biblical Commentary and Translation in the Fifteenth and Sixteenth Centuries (Aldershot: Ashgate, 2001)\nHonours and awards\nHe has been received as an Officer into the French Ordre des Palmes académiques (1998) and as a Knight into the Ordre des Arts et des Lettres (1988).\nPrivate life\nGriffiths is married to Patricia.\nReferences\n#"
    }
  ]
}