{
  "content": [
    {
      "type": "text",
      "text": "# Richard Kingsland\n\n| birth_place   = Moree, New South Wales\n| death_date    =\n| death_place   = Canberra, Australian Capital Territory\n| placeofburial =\n| allegiance    = Australia\n| branch        = Royal Australian Air Force\n| serviceyears  = 1935–1948\n| rank          = Group Captain\n| servicenumber =\n| unit          =\n| commands      = RAAF Base RathminesNo. 11 Squadron RAAF\n| battles       =\n* Second World War\n** Battle of the Atlantic\n** South West Pacific theatre\n| awards        = Knight BachelorOfficer of the Order of AustraliaCommander of the Order of the British EmpireDistinguished Flying Cross\n| relations     =\n| laterwork     =\n}}\nSir Richard Kingsland,  (19 October 1916 – 27 August 2012) was an Australian RAAF pilot known for being the youngest Australian group captain at age 29. He later became a senior public servant, heading the Departments of the Interior, Repatriation, and Veterans' Affairs.\nBiography\nJulius Allan Cohen was born in 1916.  He later changed his name to Richard Kingsland, to avoid anti-semitism.\nKingsland flew a Short Sunderland to Morocco in 1940 with two of Britain's senior WWII leaders, Duff Cooper and John Vereker, 6th Viscount Gort, who were attempting to make a diplomatic agreement with French leaders in North Africa. When negotiations failed, Kingsland evacuated the VIPs with pistol drawn. He then managed a difficult take off from a river estuary, while being harassed by a French police boat.\nFor his invaluable service, he was awarded the Distinguished Flying Cross (DFC) in September 1940. Later in the war he served in the Pacific, flying the PBY Catalina to bomb a major Japanese headquarters in Rabaul, New Guinea.\nIn June 2010, he published his autobiography, Into the Midst of Things''.\nPublic service\nDuring his public service career, rising to become Secretary of the Departments of Interior, Repatriation, and Veterans' Affairs, Kingsland served 12 ministers and built a reputation as a trusted and experienced departmental head.\nAwards and honours\nRichard Kingsland was appointed a Commander of the Order of the British Empire (CBE) in 1967. He was knighted in 1978, and appointed an Officer of the Order of Australia in 1989.\nIn 2013, a street in the Canberra suburb of Casey was named Kingsland Parade in Richard Kingsland's honour.\nDeath\nRichard Kingsland died in August 2012, aged 95.  He was survived by his wife of 68 years, Kathleen Kingsland, two daughters and a son.\nReferences"
    }
  ]
}