{
  "content": [
    {
      "type": "text",
      "text": "# Richard Rouse (Australian colonial settler)\n\n| birth_place   = Oxfordshire, England\n| death_date    =\n| death_place   = New South Wales, Australia\n| nationality   = Anglo-Australian\n| other_names   =\n| spouse        = Elizabeth Adams\n| occupation    = Public servant; Colonial superintendent of works\n| years_active  =\n| known_for     =\n| notable_works = |Parramatta Hospital|Old Government House, Parramatta }}\n}}\nRichard Rouse (26 February 177410 May 1852) was an Anglo-Australian public servant who was active during the Colonial development of New South Wales as the Superintendent of Public Works and Convicts at Parramatta under the direction of NSW Governors William Bligh and Lachlan Macquarie. He is attributed as the designer of Rouse Hill House in , that was his family home from 1819 until his death in 1852.\nBiography\nRouse was born in Oxfordshire, England in 1774. He arrived in Sydney in December 1801 as a free settler with his wife, Elizabeth Adams, and their two young children. In March 1802 Governor Philip Gidley King granted Rouse  and he established on a farm at  on the Hawkesbury River. In July 1805 he was appointed superintendent of lumberyard at Parramatta.\nIn 1806 Rouse welcomed Governor Bligh against the despotism of the New South Wales Corps and was one of the governor's staunchest supporters. After sympathizing with Bligh, he was named by Bligh as one of the witnesses he wished to take to England. However, the trip did not eventuate as Bligh changed his mind. Rouse his position as a public servant. On 14 January 1810 he was appointed superintendent of carpenters by Governor Macquarie and in October 1814 was appointed auctioneer at Parramatta. He superintended the construction of many buildings, tollhouses and turnpikes in the vicinity of Parramatta,  and , including the renovation of Old Government House, Parramatta, in 1815 and the erection of the Parramatta Hospital in 1818.\nOn 8 October 1816 Rouse was granted  near the site of the Castle Hill convict rebellion; at the suggestion of Macquarie the grant was named Rouse Hill. The actual possession of the land had taken place a few years previously, as the Sydney Gazette had first mentioned Rouse Hill on 27 November 1813, and the homestead was begun soon afterwards. It took a few years to build and was a two-storey, twenty-two room house, which has been occupied by members of the Rouse family ever since.\nIn 1822 Rouse sent his sons in search of good pasturage in the area north-west of the Blue Mountains; and in 1825 they took up land for him  north of  on the Cudgegong River near . This grant of  was gradually increased, and became two stations, Guntawang and Biraganbil, which were inherited by his sons Edwin and George. Both properties prospered and the Rouses were connected with progressive movements in the towns of Mudgee and Gulgong for many years. Rouse also acquired Ewenmar on the Castlereagh River, Gillendoon near , Cobborah near  and other land at Bathurst as well as the properties at  and . By 1828 he possessed about , but by then he had retired to Rouse Hill. There he devoted his time to the raising of sheep and cattle, the breeding of thoroughbred horses and the management of his various properties. He became well known for the quality of his stock, which he improved from time to time with imported sires.\nRouse was a devoted family man, a loyal member of the Church of England, a hard-working and honest public servant and a very efficient grazier. His many properties ensured the future of his three sons and four daughters who survived childhood, including Mary, the eldest, who married Jonathan, son of the missionary Rowland Hassall; Jane who married Alfred Kennerley, premier of Tasmania in 1873-76; Eleanor who married first John Terry of , son of Samuel Terry and after his death, Major Thomas Wingate; George, one of the first boys enrolled at The King's School, Parramatta, when it opened in 1832; and Elizabeth Henrietta who married Robert, son of Richard Fitzgerald of Windsor.\nElizabeth Rouse died in December 1849 and Richard Rouse died on 10 May 1852. He was buried in a vault at St Peter's Church, Richmond.\nOne of his grandsons was Richard Rouse who served as the Member for Mudgee between 1876 and 1877; and in 1879.\nSee also\n}}\n*History of Sydney\n*Rouse Hill House\nReferences"
    }
  ]
}