{
  "content": [
    {
      "type": "text",
      "text": "# Richard Warner (botanist)\n\nRichard Warner (c. 1711-13 – 11 April 1775) was an English botanist and literary scholar.\nLife\nWarner was born in London, probably in 1713, the third son of John Warner, a goldsmith and banker, in business in The Strand near Temple Bar. John Warner, sheriff of London in 1640, and lord mayor in 1648, in which year he was knighted, was probably Richard Warner's great-grandfather. John Warner, Richard's father, was a friend of Gilbert Burnet; he and his son Robert, a barrister, purchased property in Clerkenwell, comprising what was afterwards Little Warner Street, Cold Bath Square, Great and Little Bath Streets, etc. John Warner seems to have died about 1721 or 1722, and his widow then purchased Harts, an estate at Woodford, Essex, which, on her death in 1743, she left to her son Richard.\nRichard Warner entered Wadham College, Oxford, in July 1730, and graduated B.A. in 1734. He had chambers in Lincoln's Inn; but lived mainly at Woodford where he maintained a botanical garden, and cultivated exotic plants.\nIn 1748 Warner received a visit from Pehr Kalm, the disciple of Linnæus, then on his way to North America. Warner took Kalm to London, to Peter Collinson's garden at Peckham, to visit Philip Miller in Chelsea, and to see the aging Sir Hans Sloane. Warner then received from the Cape of Good Hope the so-called Cape jasmine (Gardenia jasminoides), which flowered in his hothouse. John Ellis in a letter to Linnæus dated 21 July 1758, proposed should be called Warneria; Warner, however, objected, and it was named Gardenia. Miller dedicated a genus to him in 1760, but it had been given the name Hydrastis by Linnæus in the previous year.\nWarner died unmarried on 11 April 1775, at Harts, and was buried on the 20th in Woodford churchyard, more probably, as stated in the register, aged 62, rather than, as stated on his tomb, sixty-four.\nWorks\nWarner made collections for a new edition of Shakespeare, but gave up the project when George Steevens began in the field. In 1768 Warner published a letter to David Garrick Concerning a Glossary to the Plays of Shakespeare. Papers concerning the glossary came to the Garrick Collection. Manuscripts for this glossary, including one in fifty-one quarto volumes, and another in twenty octavo volumes, are in the British Library (Add MSS 10464–10543).\nWarner also translated several plays of Plautus into prose, and the Captives into verse, before the announcement of Bonnell Thornton's version. In the preface to his two volumes published in 1766 Thornton wrote of Warner's help, and his translating the life of Plautus from Petrus Crinitus. After Thornton's death in May 1768, Warner issued a revised edition of the two volumes (1769), and then continued the work, translating fourteen plays and issuing them in three additional volumes, two published in 1772, and the last in 1774, the continuation being dedicated to Garrick.\nMeanwhile, he had, in 1771, printed his botanical work, Plantæ Woodfordienses: Catalogue of … Plants growing spontaneously about Woodford. This little book had its origin in the ‘herborisations’ of the Apothecaries' Company, to the master, wardens, and court of assistants of which it is dedicated. An index of Linnæan names is added. Though somewhat inaccurate, the Plantæ Woodfordienses served as a model for Edward Jacob's Plantæ Favershamienses (1777), and in 1784 Thomas Furly Forster printed some Additions.\nLegacy\nWarner bequeathed the bulk of his property to Jervoise Clark, the widower of his niece Kitty, only child of his brother Robert. A director of the East India Company in 1760, he left money to their hospital at Poplar, to David Garrick, and to fund for decayed actors. His books and drawings relating to botany and natural history went to Wadham College, with money to found a botanical exhibition at the college tenable for seven years by the presentation of fifty dried plants and a certificate.\nAt Idsworth, Hampshire, the seat of the Jervoise family, there was a portrait of Richard Warner.\nReferences\n*\n;Attribution"
    }
  ]
}