{
  "content": [
    {
      "type": "text",
      "text": "# Richard F. Ward\n\nRichard Finley Ward (born September 19, 1951) is an American storyteller and the Fred B. Craddock Professor of Preaching at Phillips Theological Seminary.\nEducation\nWard was born in Conway, South Carolina to Rev. Dalton L. Ward and Dr. Marjory Goldfinch Ward. He graduated from Colonial Heights High School in 1969 and in  1973 graduated magna cum laude from Oklahoma Baptist University with a B.A. in speech and drama. He went on to get an M.F.A. in drama at Trinity University. He worked in various theatrical productions, and also  graduated summa cum laude from Christian Theological Seminary in 1980 with  an M.A.  In 1987 he became a doctor of philosophy  from Northwestern University in the school of speech with a Ph.D. in Performance Studies. After serving in Methodist churches,  In 1989 he became an ordained minister in the United Church of Christ.\nActivism\nLately Ward has stirred up controversy in his community by showing his support of the LGBT acceptance movement.\nTeaching career\n*1987-1993 Candler School of Theology-Assistant Professor of Speech Communication\n*1993-1999 Yale Divinity School- holder of the Clement-Muehl chair Communication Arts, Associate Professor\n*1999-2000 Iliff School of Theology- Visiting professor and Director of the Doctor of Ministry program\n*2005-2007 Iliff School of Theology-director of the Doctor of Ministry program\n*2000-2010 Iliff School of Theology- Associate Professor of Preaching and Performance Studies\n*2010-     Phillips Theological Seminary-  Fred B. Craddock chair, -Associate Professor of Preaching and Worship and Director of Ministerial Formation for the United Church of Christ.\nStorytelling\nHe is a member of the Academy of Homiletics and the International Network of Storytelling. In his book, Speaking of the Holy, he walks his readers through the process of performing a biblical text and shows how to view the sermon as an act of communication and art. While at the Iliff School of Theology in Denver, Colorado, he gave storytelling workshops and classes. The storytelling workshops were sometimes offered free of charge in order to give the broader Denver community a chance to experience the art of storytelling in an exciting and affordable way. Working also with the  Swallow Hill Music Association in Denver, he became a strong advocate for storytelling both locally and nationally. He is also known for working in his love of ornithology into his stories, often using extended metaphor and simile.\nHe made two guest appearances on the Chicago Sunday Evening Club's show 30 Good Minutes. 30 Good Minutes is a weekly broadcast on WTTW Channel 11 (PBS Chicago) and in syndication in other U.S. cities. On this show he preached his sermon, \"In Memory of Her\" and \"Go Deeper? Are you Serious, Jesus?\"\nHe has travelled  across the country delivering sermons, telling stories and leading workshops.\nBooks\n;Writer\n*Doing the Text: Exploring the New Testament Through Performance Studies Co-authored with David Trobisch (in progress).\n*Speaking of the Holy: The Art of Communication in Preaching (Chalice Press, December 2001).\n*Speaking from the Heart: Preaching with Passion, (Abingdon Press, May 1992).\n;Editor\n*Feasting on the Word: Preaching the Revised Common Lectionary, Series editor and contributor (Westminster John Knox Press, 2008).\n*Craddock Stories, co-edited with Fred Craddock and Michael Graves, (Chalice Press, May 2001).\nReferences\nExternal links\n* [http://www.richardfward.com/   Home Page of Richard Ward]\n* [http://www.chalicepress.com/Author.aspx?AuthorID=1024/ author page Chalice Press Publishing Company]"
    }
  ]
}