{
  "content": [
    {
      "type": "text",
      "text": "# Richard Warren (physician)\n\n]]\nRichard Warren (1731–1797) was an English physician and society doctor.\nEarly life\nBorn at Cavendish, Suffolk on 4 December 1731, he was the third son of Dr. Richard Warren (1681–1748), archdeacon of Suffolk and rector of Cavendish, by his wife Priscilla (died 1774), daughter of John Fenner; he was the younger brother of John Warren the bishop. He was educated at Bury St. Edmunds grammar school.\nEducation\nWarren entered Jesus College, Cambridge in 1748, shortly after the death of his father. There he graduated B.A. as fourth wrangler in 1752, and was elected a fellow of the college. He proceeded M.A. in 1755 and M.D. on 3 July 1762.\nOn obtaining a fellowship his inclination directed him to the law, chance made him a physician. At Jesus he was tutor to the son of Peter Shaw, physician in ordinary to George II and George III, and in 1763 succeeded to the practice of Shaw, by then his father-in-law.\nCareer\nOn 5 August 1756, having at that time a license ad practicandum from the university of Cambridge, Warren was elected a physician to the Middlesex Hospital, and on 21 January 1760 he became physician to St. George's Hospital. The former appointment he resigned in November 1758, the latter in May 1766.\nWarren was admitted a candidate of the Royal College of Physicians on 30 September 1762. Sir Edward Wilmot, then physician to the court, recommended Warren to assist him in attending on Princess Amelia. When Wilmot retired, Warren continued to act as physician to the princess, and then by her influence he was appointed physician to the king on the resignation of Shaw. He was elected a Fellow of the College of Physicians on 3 March 1763. He delivered the Gulstonian lectures at the College in 1764 and the Harveian oration in 1768. He acted as censor in 1764, 1776, and 1782. On 9 August 1784 he was named an elect. He became a Fellow of the Royal Society in 1764.\nIn 1787 Warren was appointed physician to the Prince of Wales, who sent him to attend the king during his first period of 'madness' in 1788–89. His medical career then brought financial rewards not previously seen in England. He died at his house in Dover Street on 22 June 1797. He was buried in Kensington parish church on 30 June 1797. Elizabeth Inchbald composed mourning verses to his memory.\nWorks\nWarren's paper on bronchial polypus, and an essay on the Colica Pictonum, were published in the Transactions of the College of Physicians. His Latin Harveian oration was also published, in 1769.\nPersonal life\nWarren married Elizabeth Shaw, daughter of Peter Shaw, in 1759. He died leaving her as widow, eight sons, and two daughters. The sons included Vice Admiral Frederick Warren and Pelham Warren the physician. Warren bequeathed to his family over £150,000.\nNotes\n;Attribution"
    }
  ]
}