{
  "content": [
    {
      "type": "text",
      "text": "# Richard Edwards (Royal Navy officer, died 1773)\n\n-->\n|nickname      =\n|birth_name    =\n|allegiance    =\n|branch        =\n|serviceyears  =\n|rank          =Rear-Admiral\n|servicenumber =\n|unit          =\n|commands      =\n*\n*HMS Princess Mary\n*HMS Princess Amelia\n}}\n|battles       =\n*War of the Austrian Succession\n**Siege of Louisbourg\n|battles_label =\n|awards        =\n|relations     =\n|laterwork     =\n|signature     =\n}}\nRichard Edwards (died 16 June 1773) was an officer of the Royal Navy who served for a brief time as Commodore Governor of Newfoundland.\nCareer\nEdwards entered the navy and rose through the rank. He received a promotion to the rank of post captain on 4 November 1740 and given command of the 24-gun . He commanded her until 1742, during which time he captured a 10-gun Spanish privateer named Justa Resina. He next commanded , and by early 1746 was in command of HMS Princess Mary. He was appointed governor of Newfoundland that year, but was ordered to go to North America and place himself under the command of Commodore Peter Warren at Louisbourg, where he was besieging the fort.\nEdwards arrived on 11 July, bringing with him two other ships,  and . Louisbourg surrendered four days later, and Edwards sailed to Newfoundland to take up his original post. On its conclusion, he returned to England, and had little further active service, though he may have commanded a yacht. He was refused a promotion to flag rank, unless he resumed his active service at the rank of captain. He secured the command of HMS Princess Amelia, but only for a short period. He was given the rank and pay of a rear-admiral from 3 June 1757 and was placed on the superannuated list. He died in England on 16 June 1773.\nNotes\na. The position of governor of the colony temporarily lapsed after Edwards's departure, and therefore the next commodore, James Douglas, was not a governor of the island. Also, no commodore or governor was sent in 1747, the next governor was Charles Watson in 1748.\nCitations\nReferences\n*\n*"
    }
  ]
}