{
  "content": [
    {
      "type": "text",
      "text": "# Richard King (traveller)\n\nRichard King (1811?–1876) was an English surgeon, Arctic traveller, and early ethnological writer.\nEarly life\nKing was born circa 1811, the son of Richard King, a Londoner.  He was educated at St Paul's School, London, and then was apprenticed to an apothecary in 1824. He also trained at Guy's Hospital and St Thomas's Hospital in London. He studied at Guy's under Thomas Hodgkin, later to be a colleague in the development of ethnology.\nKing became M.R.C.S. on 29 June and L.S.A. on 16 August 1832, and obtained the honorary degree of M.D. of New York in 1833. He was subsequently made a member of the court of examiners of the Apothecaries' Society in London.\nArctic travels\nShortly after qualifying as a medical man King obtained the post of surgeon and naturalist in the expedition led by Captain George Back, to the mouth of the Great Fish River (now known as the Back River) between 1833 and 1835, in search of Captain John Ross. He took a prominent part in the expedition and is frequently mentioned in Back's Narrative (1836), to which he contributed botanical and meteorological appendices.\nLater life\nOn 20 July 1842, King issued the prospectus which originated the Ethnological Society of London. In 1844, he published an address to the society, of which he was the first secretary.\nIn 1850, King was appointed assistant-surgeon aboard , in the expedition sent out to search for Franklin under Captain Horatio Austin, and in 1857 King received the Arctic Medal for his services. In 1870, when the Ethnological Society of London and its successor, the Anthropological Society, merged in the Anthropological Institute of Great Britain, King became a member of the council of the institute. He was also a member of the general council of the British Association.\nDeath\nKing died at his residence in Blandford Street, Manchester Square, London, on 4 February 1876.\nWorks\nKing published an independent account of the expedition under George Back, entitled Narrative of a Journey to the Shore of the Arctic Ocean under command of Captain Back (1836), 2 vols. In it he took a more sanguine view than his commander of the value of the Back River as a base for future arctic exploration. In 1855, he drew up a summary of his correspondence with the Admiralty, entitled The Franklin Expedition from first to last, in which he criticised the government.\nKing was a contributor to the Journals of the Ethnological Society, the Statistical Society, the Medical Times (of which he was for some time editor), and other periodicals. With two medical books on the cause of death in still-born infants he published:\n* The Physical and Intellectual Character and Industrial Arts of the Esquimaux (1844)\n* ''The Natives of Vancouver's Island and British Columbia (1869)\n* The Manx of the Isle of Man (1870)\n* The Laplanders'' (1871)\nControversy and reputation\nKing's reputation as argumentative is well-established, but he is now better thought of than by many of his influential contemporaries. His view of the Back expedition as having missed opportunities and implicit argument for recognition of his own contribution are accepted by the Oxford Dictionary of National Biography. He received sympathy in his grievances from the newspapers of the time, but his perceived eccentricity told against him. The Dictionary of National Biography in its first edition spoke of his dying \"in obscurity\".\nWhen in 1845 the Admiralty proposed the Franklin expedition, King wrote very strongly to Lord Stanley, then Secretary of State for War and the Colonies, recommending, instead of the polar sea journey, a land journey by the Great Fish River, and offering his services. The Admiralty gave a deaf ear both to this project and to those which King would have substituted for the measures proposed for the relief of John Franklin in 1849. King's May 1847 article in The Athenæum (a letter to Lord Grey the Colonial Secretary) was answered by Charles Richard Weld, who countered King's perceived alarmist tone with reassurance about the expedition's food supplies. In the same periodical Alexander Kennedy Isbister took a practical tone: conceding that King's speculations on the longitude of the Franklin party might be correct, he argued that King's preferred land expedition of relief could not carry enough supplies.\nOpinions still differ as to whether or not King's proposal would have, in fact, saved lives.\nFurther reading\n*\nReferences\n;Attribution"
    }
  ]
}