{
  "content": [
    {
      "type": "text",
      "text": "# Richard Ward (actor)\n\n|birth_place = Glenside, Pennsylvania, U.S.\n|death_date =\n|death_place = Coxsackie, New York, U.S.\n|occupation = Actor\n|years_active = 1949&ndash;1979\n}}\nRichard Ward (March 15, 1915 – July 1, 1979) was an American actor on the stage, television, and in films, from 1949 until his death.\nThough best known through his television appearances late in life, both in sitcoms and police procedurals, Ward also had an extensive film resume and a distinguished stage career, one of the highlights of the latter being his portrayal of Willy Loman in the 1972 production of Death of a Salesman, staged in Baltimore's Center Stage (the first African American production of Arthur Miller's signature opus, produced with the playwright's blessing). Ward's own favorite among his theatrical vehicles was Ceremonies in Dark Old Men.\nLife and career\nWard was born in Glenside, Pennsylvania on March 15, 1915. He worked as a New York City police detective for ten years before beginning his acting career.\nAn Actors Studio alumnus, Ward belatedly made his television debut in 1950 on the Perry Como Show, later appearing on dramatic anthology series such as Playhouse 90, Studio One, and Hallmark Hall of Fame, before becoming a familiar face on seventies sitcoms like Mary Hartman, Mary Hartman, All in the Family and The Jeffersons.\nWard made three guest appearances on Good Times as James's dad Henry (the name that James was known by on Maude), who had walked out on James' mom and siblings when he was younger. The first episode he appeared on, Henry was discovered by Thelma at a ship port where he was working and she brought him home to surprise James for his birthday. At first, James didn't want to see him, but after a deep conversation, Henry was welcomed by his son to join the celebration. James wished he could have 100 more years with his dad. The other two episodes Henry appeared on were after James' death.\nOn Sanford and Son, Ward appeared in the episode \"The Stung\" (1975); in it, Fred asks a professional gambler (played by Ward) to teach Lamont and his friends a lesson. In the pilot film for the cop show, Starsky & Hutch, Ward played Captain Dobey, though in the series itself that role was played by Bernie Hamilton. Ward did appear as a different character in one episode in the final series, shortly before his death due to a heart attack. He was married to Peggy Ward.\nFilmography\n{| class=\"wikitable\"\n|-\n! Year\n! Title\n! Role\n! Notes\n|-\n|1957|| Carib Gold || Lechock ||\n|-\n|rowspan=3| 1964|| The Cool World || Street Speaker ||\n|-\n| Black Like Me\n| Burt Wilson\n|\n|-\n| Nothing But a Man\n|Mill Hand\n|-\n|1969|| The Learning Tree || Booker Savage ||\n|-\n|1971|| Brother John || Frank ||\n|-\n|1972|| Across 110th Street || Doc Johnson ||\n|-\n|1973|| Cops and Robbers || Paul Jones ||\n|-\n| rowspan=3|1974\n| ''For Pete's Sake || Bernie ||\n|-\n| Petrocelli||Charlie Bobo\n|\n|-\n| Sty of the Blind Pig\n|Blind Jordan\n|\n|-\n|1975|| Mandingo || Agamemnon ||\n|-\n|1976|| The Death Collector || Gunsmith ||\n|-\n|1979|| The Jerk || Father || Posthumous release\n|-\n|1980|| Brubaker'' || Abraham Cook || Posthumous release (final film role)\n|}\nReferences\nExternal links\n*\n*\n*\n*[http://archives.nypl.org/the/21270 Richard Ward papers, 1949–1980], held by the Billy Rose Theatre Division, New York Public Library for the Performing Arts"
    }
  ]
}