{
  "content": [
    {
      "type": "text",
      "text": "# Ricochet (software)\n\n| latest release date =\n| latest preview version =\n| latest preview date =\n| operating system = Windows, OS X, Linux, FreeBSD\n| license = BSD-3-Clause\n| website =\n}}\nRicochet or Ricochet IM is a free software, multi-platform, instant messaging software project originally developed by John Brooks and later adopted as the official instant messaging client project of the Invisible.im group. A goal of the Invisible.im group is to help people maintain privacy by developing a \"metadata free\" instant messaging client.\nHistory\nOriginally called Torsion IM, Ricochet was renamed in June 2014. Ricochet is a modern alternative to TorChat, which hasn't been updated in several years, and to Tor Messenger, which is discontinued. On September 17, 2014, it was announced that the Invisible.im group would be working with Brooks on further development of Ricochet in a Wired article by Kim Zetter. Zetter also wrote that Ricochet's future plans included a protocol redesign and file-transfer capabilities. The protocol redesign was implemented in April 2015.\nIn February 2016, Ricochet's developers made public a security audit that had been sponsored by the Open Technology Fund and carried out by the NCC Group in November 2015. The results of the audit were \"reasonably positive\". The audit identified \"multiple areas of improvement\" and one vulnerability that could be used to deanonymize users. According to Brooks, the vulnerability has been fixed as of 2016.\nTechnology\nRicochet is a decentralized instant messenger, meaning there is no server to connect to and share metadata with. Further, using Tor, Ricochet starts a Tor hidden service locally on a person's computer and can communicate only with other Ricochet users who are also running their own Ricochet-created Tor hidden services. This way, Ricochet communication never leaves the Tor network. A user screen name (example: ) is auto-generated upon first starting Ricochet; the first half of the screen name is the word \"ricochet\", with the second half being the address of the Tor hidden service. Before two Ricochet users can talk, at least one of them must privately or publicly share their unique screen name in some way.\nPrivacy benefits\n* Ricochet does not reveal user IP addresses or physical locations because it uses Tor.\n* Message content is cryptographically authenticated and private.\n* There is no need to register anywhere in order to use Ricochet, particularly with a fixed server.\n* Contact list information is stored locally, and it would be very difficult for passive surveillance techniques to determine whom the user is chatting with.\n* Ricochet does not save chat history. When the user closes a conversation, the chat log is not recoverable.\n* The use of Tor hidden services prevents network traffic from ever leaving the Tor network, thereby preserving anonymity and complicating passive network surveillance.\n* Ricochet is a portable application, users do not need to install any software to use Ricochet. Ricochet connects to the Tor network automatically.\nCorrelation attack\nFrom 2019 to 2021, Ricochet was used by the admins (as well as an undercover investigator) of the child porn onion site Boystown. To identify the perpetrators, German police used a correlation analysis attack. By sending Ricochet messages to perpetrators and monitoring several hundred Tor nodes for simultaneous traffic of the correct size, authorities were able to identify intermediate Tor nodes and then also the perpetrator's entry nodes, revealing the perpetrators' IP addresses.\nSee also\n* Comparison of instant messaging clients\n* Jami\n* Tox (protocol)\nReferences\nExternal links\n*\n*\n*https://www.ricochetrefresh.net"
    }
  ]
}