{
  "content": [
    {
      "type": "text",
      "text": "# Right to Exist: A Moral Defense of Israel's Wars__disambig_1\n\n'Right to Exist: A Moral Defense of Israel's Wars' is a book by German-born Israeli historian Yaacov Lozowick, the director of archives at the Holocaust Martyrs' and Heroes' Remembrance Authority.\nIn the book, Lozowick draws on just war theory, and particularly on Michael Walzer's work Just and Unjust Wars, in an attempt to evaluate Israel's wars in the light of moral philosophy.\nEthan Bronner, in the New York Times, found the book a largely persuasive defence of Israel's positions morally and politically, but disputed the statement that there is no \"cycle of violence\", and that there is only one-sided aggression since Israel simply fights back against \"Palestinian terrorists\". He felt this ignored the daily aggression that the 36-year occupation entails—the roadblocks, the searches, the confiscated land.\nAccording to Chad Alan Goldberg writing in Contemporary Sociology, Lozowick develops the following thesis: \"What I found in my review of Israel's wars, was that Zionism has mostly tried to be moral. Sometimes it made mistakes, from which it generally (but not always) learned. While being continuously at war, it was surprisingly successful at all sorts of other projects, such as the building of a reasonably healthy society out of diverse communities.\" According to Goldberg, Lozowick concludes that all of Israel’s wars except the 1982 invasion of Lebanon have met the test of jus ad bellum.\nGoldberg writes that \"One of Lozowick's most important contributions is to refute the pernicious claim that Zionism is a form of European colonialism\", and that another important contribution is the refutation of the charge that Israel is a racist state.\nAccording to David Harsanyi, Lozowick argues that  \"Israelis have generally learned from their blunders, constantly reappraising their policies and their place in the world. Despite this self-criticism, Zionism is frequently rejected by classification regardless of its tangible policies, actions, or attempts at peace.\"\nDaniel Mandel writes that Lozowick “concludes that ‘the will to murder Jews was never the result of oppression and can never be resolved by removing it,’ summarizing his view that the conflict between Arab and Jew is not the product of grievances that Israeli policy can assuage.\"[http://www.meforum.org/article/1624 Review of Right to Exist: A Moral Defense of Israel's Wars - Middle East Quarterly]\nReferences"
    }
  ]
}