{
  "content": [
    {
      "type": "text",
      "text": "# Ringerike (traditional district)\n\nRingerike}}\nRingerike is a traditional district in Norway, commonly consisting of the municipalities Hole and Ringerike in Buskerud county. In older times, Ringerike had a larger range which went westward to the municipalities of Krødsherad, Modum, and Sigdal, also in Buskerud county.\nRingerike has a rich history that is connected with one of the most notable kings in the history of Norway, the father of King Harald Fairhair Halfdan the Black, who subdued Gandalf Alfgeirsson, King of Alfheim and half of Vingulmork, and the Dagling clan. Gandalf was possibly the last king of Ringerike, whose name is given to the eponymous King Hring, son of Raum the Old (cf. Romerike), son of Nór (the eponymous ancestor of Norwegians), according to the Sagas of the ancient Northernlands, better known as the Orkneyinga saga. It is possible that this, as the name suggests, was the legendary heartland of the House of Sigurd Hring and Ivar the Wide-Fathoming. There are also many archaeological remains in the area, dating to the medieval period and earlier.\nEtymology\n| caption = Terrain map highlighting the rivers Ådalselva and Randselva that form Storelva, which runs into Tyrifjorden.\n}}\nThe district was known in Old Norse as  which means the reich of the Rings. The initial H was dropped sometime in the 13th century. The etymology of the district has been, however, contested among philologists.\nHalvdan Koht suggested in 1921 that the first settlers of Ringerike settled around Tyrifjorden in a ring, though this theory is outdated to many.\nIt is suggested that Ringerike was named in a similar fashion to Romerike, which was named after the old name for Glomma, Rauma. Eivind Vågslid suggested in 1959 that Ringa was the old name of the river Storelva, because it meanders in a ring-shaped form.\nHistory\n.]]\nTraditionally, Ringerike referred to the area around the northern and northwestern part of Tyrifjord and the lowlands along the rivers Randselva, Ådalselva and Sokna, i.e. the municipalities of Hole, Krødsherad, Modum, Ringerike, and Sigdal in Buskerud county.\nToday, \"Ringerike\" may refer to solely Ringerike Municipality or to both Hole Municipality and Ringerike Municipality. Ringerike Municipality, Hole Municipality, and Jevnaker Municipality (in Akershus county), together form the Council for the Ringerike Region (),. The old Ringerike District Court used to be based in Ringerike as well.\nRingerike style, a historic Scandinavian animal style, was first discovered on runestones in Ringerike. One of these was the Alstad stone, a runestone found in 1913 on the farm Nedre Alstad in the nearby Østre Toten Municipality. Both Ulvøya and Ringerike are mentioned in the text.\nOld Norse:\nEnglish translation:\nJórunnr raised this stone in memory of\nwho owned her (i.e. was her husband),\nand (she) brought (it) out of Hringaríki,\nfrom Ulfey.\nAnd the picture-stone venerates them.\nThe Dynna stone, a runestone from Hadeland, is of the same type of red sandstone typical for Ringerike.\nKings of Ringerike\nRingerike was founded by its eponymous ruler Hring, who was the son of Raum the Old. One of the more significant historic people who have lived in Ringerike, was the king Halfdan the Black, father of Harald Fairhair, who united Norway into a single kingdom. In the early Viking Age before Harald Fairhair became the first king of Norway, Ringerike was a petty kingdom. Dagling was a legendary clan of Ringerike.\n.]]\nIn the Ynglinga saga, Snorri Sturluson writes that the clan was descended from Dag the Great whose daughter Dageid married the Swedish king Alaric and was the mother of Yngvi and Alf, both legendary Swedish kings of the House of Yngling. One of the sons of Dag the Great was Óli, who was the father of Dag, Óleif, Hring (the old king Ring of ''Frithiof's Saga''), Olaf, Helgi, and Sigurd Hjört, who was a petty king of Ringerike.\nSigurd Hjört was the father of Ragnhild Sigurdsdotter, the mother of Harald Fairhair. Following Harald's consolidation of Norway in the late 9th century, the kingdom appears to have been ruled by a series of local jarls and client kings. A later sub-king of Ringerike, Sigurd Syr, was the father of Harald Hardråde and the stepfather of Olav King Haraldson, the saint, both kings of Norway. When King Olaf Tryggvason came to Ringerike to spread the novel Roman Catholic religion of the new feudal empire of Charlemagne, Sigurd Syr and his wife allowed themselves to be baptized. Forced conversion to Christendom was a novelty, put into legal code by Charlemagne.\nAdministrative history\nRingerike was, in its beginnings, the southwesternmost district of the historical Uplands. In  1320, it was together with Hadeland, Land, and Toten, a part of the county (or syssel) Haðafylki. Ringerike was in  1640 grouped with Hallingdal in the district . In 1866, the district was divided into the Buskerud district, which included Krødsherad Municipality, Modum Municipality, and Sigdal Municipality, along with Lower Buskerud, excluding Kongsberg Municipality. The rest of Ringerike remained the same as it commonly is today.\nMunicipalities\n{| class=\"wikitable sortable\"\n!class=\"unsortable\"|Map\n!Name\n!Adm.center\n!Areakm²\n!Language\n|----\n|align=\"center\"|\n|  Ringerike Municipality\n|align=\"center\"|Hønefoss\n|align=\"right\"|\n|align=\"center\"|Bokmål\n|----\n|align=\"center\"|\n|  Hole Municipality\n|align=\"center\"|Vik\n|align=\"right\"|\n|align=\"center\"|Bokmål\n|----\n|align=\"center\"|\n|  Sigdal Municipality\n|align=\"center\"|Prestfoss\n|align=\"right\"|\n|align=\"center\"|Bokmål\n|----\n|align=\"center\"|\n|  Krødsherad Municipality\n|align=\"center\"|Noresund\n|align=\"right\"|\n|align=\"center\"|Neutral\n|----\n|align=\"center\"|\n|  Modum Municipality\n|align=\"center\"|Vikersund\n|align=\"right\"|\n|align=\"center\"|Bokmål\n|}\nReferences\nLiterature\n*\n*\n*\n*"
    }
  ]
}