{
  "content": [
    {
      "type": "text",
      "text": "# Riograndense Republic\n\n| conventional_long_name  = Riograndense Republic\n| common_name             = Riograndense Republic\n| status                  = Unrecognized state\n| date_start              = 11 September\n| year_start              = 1836\n| event_start             = Independence of Empire of Brazil\n| date_end                = 1 March\n| year_end                = 1845\n| event_end               = Ponche Verde Treaty\n| image_flag              = Flag of Piratini Republic.svg\n| flag                    = Bandeira do Rio Grande do Sul\n| image_coat              = Brasão do Rio Grande do Sul.svg\n| image_map               = Rio-Grandense-Republic-Map.jpg\n| image_map_caption       = The Riograndense Republic corresponded with the current Brazilian state of Rio Grande do Sul\n| symbol_type             = Coat of arms\n| symbol_type_article     = Coat of arms of Rio Grande do Sul\n| p1                      = Empire of Brazil\n| flag_p1                 = Flag of Empire of Brazil (1822-1870).svg\n| p2                      = São Pedro do Rio Grande do Sul Province\n| flag_p2                 = Bandeira Província de São Pedro do Rio Grande do Sul.svg\n| s1                      = Empire of Brazil\n| flag_s1                 = Flag of Empire of Brazil (1870-1889).svg\n| s2                      = São Pedro do Rio Grande do Sul Province\n| flag_s2                 = Bandeira Província de São Pedro do Rio Grande do Sul.svg\n| national_motto         =\n| englishmotto = Liberty, Equality, Humanity\n| capital                 = Piratini\n| common_languages        = Portuguese\n| government_type         = Unitary presidential republic\n| title_leader            = President\n| leader1                 = Bento Gonçalves\n| leader2                 = Gomes Jardim\n| year_leader1            = 1836&ndash;1841\n| year_leader2            = 1841&ndash;1845\n| event1                  = Confederation with Juliana Republic\n| date_event1             = 24 July 1839\n| event2                  = Constitution adopted\n| date_event2             = 8 February 1843\n| era                     = 19th Century\n| currency                = Brazilian Real\n| today                   = Brazil\n}}\n.]]\nThe Riograndense Republic, often called the Piratini Republic ( or ), was a de facto state that seceded from the Empire of Brazil and roughly coincided with the present state of Rio Grande do Sul. It was proclaimed on 11 September 1836 by general Antônio de Sousa Neto as a direct consequence of the victory obtained by gaúcho oligarchic forces at the  (1836) during the Ragamuffin War (1835–1845). It had a constitution adopted in 1843 and was recognised only by the United Kingdom, France, and Uruguay.\nIn 1839, the Riograndense Republic formed a confederation with the short-lived Juliana Republic () which proclaimed its independence in the same year. November 1839, however, saw the war result in the defeat and disappearance of the Juliana Republic. The Riograndense Republic had five capitals during its nearly nine years of existence: the cities of Piratini (for which it is often called Piratini Republic), Alegrete, Caçapava do Sul (official capitals), Bagé (for only two weeks), and São Borja. The war between the Gaúchos and the Brazilian Empire was ended by the Ponche Verde Treaty.\nHistory\nBackground\nThe economy of the then Province of São Pedro of Rio Grande do Sul of the Empire of Brazil was mainly focused on the production of jerky and leather. The province depended entirely on the domestic market, but the overvalued exchange rate and the tariff benefits then offered meant that imported beef was cheaper. Thus, the estancieiros of the region, among them the famous Bento Gonçalves, began a rebellion against the Imperial Government. After a meeting, it was decided that armed militias would be formed under the leadership of Gonçalves inside the province to take over the provincial government.\nThe initial objective to take over the province's government was successfully achieved, the rebels then planned to enter into negotiations with the imperial regent Diogo Antônio Feijó to demand a new provincial government acceptable to the regional elite. Meanwhile, the newly appointed Imperial Governor of the Province, José de Araújo Ribeiro, completely rejected by that elite, took office nevertheless. This was seen by the landowners as a declaration of war. Araújo Ribeiro then began gathering his soldiers who had been scattered since October, and hunting down Farroupilhos. He ordered the Provincial Assembly to be closed and removed Bento Gonçalves from the command of the National Guard. In Rio de Janeiro the imperial government closed the customs house in the provincial capital Porto Alegre for as long as the city was in the hands of the rebels, restricting the arrival of ships. Soon open conflict began, as imperial forces secured the city and rebels fought back against them.\nIndependence\nWith the overwhelming victory of the rebels, led by Antônio de Sousa Neto, the separatist idea took shape.\nAt night ideological questions were revised and Lucas de Oliveira and Joaquim Pedro, ardent republicans, convinced Neto, arguing that there was no other way out but to embark on the path of independence and that there was no other popular desire but desire of freedom, of abolition of slavery and of democracy under the republican system. Neto came to sympathize with the idea but resisted before a probable disapproval of his peers. He thought that such a proclamation of a new Republic should come from Bento Gonçalves, the great commander of the rebelled. They contended that Bento had already decided on the republic, that \"rigid hierarchy was a custom of the empire, and that the republican system was centered on the people, their wants and needs, and not on the governing elite\".\nFinally, with the acquiescence of Colonel Neto, they began to write the Proclamation of the Riograndense Republic that he would read out before his assembled troops, on 11 September 1836. Bento Gonçalves was informed of this and was later proclaimed President.\nHere is the text read by General Antônio de Sousa Neto in front of his ranks:\nproclaimed the Riograndense Republic.]]\n''Brave comrades of the 1st Cavalry Brigade! Yesterday you obtained the most complete triumph over the slaves of the Court of Rio de Janeiro, which, envious of the local advantages of our province, makes mercilessly pour the blood of our compatriots, in order to make her prey to her ambitious sights. Miserable! Whenever their satellites have appeared before the free forces, they have succumbed, without this fatal disappointment making them give up their infernal plans. There are countless injustices made by the Government. Its despotism is the most atrocious. And shall we suffer so much shame? No, comrades, the Rio Grande is willing, like us, not to suffer for the longer time the arrogance of a tyrannical, arbitrary, and cruel government like the present one. In every corner of the province there is no other echo than that of independence, republic, freedom or death. This echo, majestic, which they constantly repeat, as a part of this soil of free men, makes me declare that we proclaim our provincial independence, for which our work for liberty and the triumph we obtained yesterday, over these miserable slaves of absolute power. Comrades! We who are the 1st Brigade of the Liberal Army, must be the first to proclaim, as we proclaim, the independence of this province, which is disconnected from the rest of the Empire, and forms a free and independent state, with the title of Riograndense Republic, and whose manifesto to the civilized nations will be done competently. Comrades! Let's shout for the first time: Long live the Riograndense Republic! Long live the independence! Long live the Republican Army of Rio Grande!\nCampo dos Menezes, 11 September 1836 – Antônio de Sousa Neto, colonel-commander of the 1st cavalry brigade.\nThe other Brazilian provinces were called to unite as federated entities in the republican system. A national anthem was adopted, along with a flag, still used by the State of Rio Grande do Sul. The capital was also established in the small city of Piratini, from which came a new nickname, the Republic of Piratini.\nFrom this moment on, the immediate end of the Ragammuffin Revolution occurred and the Ragamuffin War began.\nConfederation\n.]]\nAs the war progressed with successive ragamuffin victories, the Riograndense Navy led by the Italian revolutionary Giuseppe Garibaldi and the gaucho David Canabarro advanced to the Province of Santa Catarina to attack the city of Laguna. Laguna was taken, with the help of the Laguna people themselves, on 22 July 1839. On 29 July the Juliana Republic was proclaimed an independent country, linked to the Riograndense Republic by ties of confederalism, and David Canabarro became its first President.\nWith the capture of Laguna, half of the imperial province was in the hands of the republican separatists, however, the rampage was contained by entrenched imperial troops. Shortly afterwards the empire reacted with full force, destroying the Riograndense Navy and advancing rapidly on the rebels in Santa Catarina. The retaking of Laguna on 1 November 1839 put an end to the Juliana Republic.\nDissolution\nUntil the year 1840, the rebels were arguably in the ascent, with several victories in the military field. After this period, there was a decline their fortunes, beginning with the fall of Laguna. With the Imperials controlling the key cities, the rebels were limited to the interior, and soon internal quarrels began.\nannouncing the end of the Ragamuffin War, in 1845.]]\nBento Gonçalves, still in the year 1840, due to the failures, waved to the empire with the possibility of an agreement. Bento asked the imperials for safeguards so that his comrades could cross with impunity the places conquered by the empire, in order to settle with the imperial chiefs the details of a collective surrender of the ragamuffin rebels. They actually carried a letter of this design. But there was another oral message to be given to those leaders, which could not be written. The maneuver, however, was so well thought out and executed that it would fool even his fellow combatants, and motivated a letter of disapproval written by Domingos José de Almeida, then vice-president and Minister of Finance of the Riograndense Republic. The fighting continued on several fronts. Meanwhile, a Constituent Assembly had been called on 10 February 1840, but maneuvers of Bento Gonçalves, who did not want to lose power, led to the promulgation only in 1842 of the Constitution of the Republic.\nFacing internal conflicts, economic and military problems against the forces of the Empire, the Republic was forced to start the peace negotiations. In 1844, Fructuoso Rivera proposed to broker peace between legalists and republicans. Manuel Luís Osório was sent to the camp of Rivera, where he met with Antônio Vicente da Fontoura, to inform that the Duke of Caxias, leader of the imperial forces, rejected the proposal of peace, but that there could be negotiations with the government without third parties. Vicente da Fontoura was sent to court to discuss peace.\nCaxias received instructions from the empire, which feared the advance of Juan Manuel de Rosas in the disputed territory, to propose honorable conditions to the rebels, such as an amnesty of officers and men, incorporating them into the Imperial Brazilian Army with their ranks preserved, allowing the Governor of the Province to be elected by the Provincial Assembly, and raising taxes on meat imported into Brazil from the Platine region.\nHowever, one question remained unanswerable, that of slaves freed by the Republic to serve in the Republican army. For the Empire of Brazil, it was unacceptable to recognize the freedom of slaves given by a sedition, although it did annihilate the leaders of the same revolt.\nFinally, on 1 March 1845, peace was signed: the Ponche Verde Treaty, after almost ten years of war. Among its main conditions were the complete amnesty to the rebels, the liberation of the slaves who fought in the Republican Army and the election of a new provincial president by the ragamuffins. Partial or full compliance with the treaty still raises discussions to this day. The impossibility of a regionally restricted abolition of slavery, the persistence of animosity between local leaders and other administrative and operational factors may have at least hindered, if not prevented, full compliance with it. Such discussion is referred to in the main article of this subject. The Riograndense Republic was reincorporated into the Brazilian Empire.\nFlag\nThe official flag of the Riograndense Republic was green, yellow and red. There were differing accounts for its design: one version indicated that the colors-symbols of Brazil, yellow-green and red, symbolized the republic, intersecting them; another that the green represented the forest of the pampas, the red, the revolutionary ideal, and the yellow the riches of the gaucho territory; another still that it combined the green of the Portuguese flag and the yellow of the Spanish flag (respectively, the most important and second most important colonizers of the territory of the state of Rio Grande do Sul), interspersed by the vertical red stripe symbolising federation in the platine region from the time of Jose Gervasio Artigas (1764–1850). However, green would only be added to the Portuguese flag in 1910, 65 years after the end of the Farroupilha Revolution, which discards this latest version. Likewise, the current flag of the state of Rio Grande do Sul comes to have the same colors, having been added the coat of arms of the Riograndense Republic in the middle of the flag.\nGovernment\n, first President of the Riograndense Republic.]]\nThe Riograndense Republic was created as a constitutional presidentialist republic. Its first President, Bento Gonçalves, was appointed by the Ragamuffin Assembly and took office on 6 November 1836, along with 4 vice presidents:\n*Antônio Paulino da Fontoura\n*José Mariano de Matos\n*Domingos José de Almeida\n*Inácio José de Oliveira Guimarães\nIn 1841 Bento Gonçalves was imprisoned by the imperial forces in Bahia, far away from his army, and it a new president, José Gomes de Vasconcelos Jardim, was elected and immediately appointed the new ministry of the republic:\n*Domingos José de Almeida – Minister of Interior and Finance\n*José Pinheiro de Ulhoa Cintra – Minister of Justice and Foreign Relations\n*José Mariano de Matos – Minister of War and Navy\nThroughout the war they were named generals of the republic:\n*João Manuel de Lima e Silva\n*Bento Gonçalves\n*Antônio de Sousa Neto\n*Bento Manuel Ribeiro\n*Davi Canabarro\n*João Antônio da Silveira\nThe Constitution of the Riograndense Republic was completed in 1843, after seven years of independence from the Brazilian Empire. It was signed, \"by the very fist of all the deputies\" in Alegrete (when it was still a town), on 8 February 1843. The document includes the names of José Pinheiro de Uchôa Cintra, Francisco de Sá Brito, José Mariano de Matos, Serafim dos Anjos France, Domingos José de Almeida.\nAmong its articles was written:\nDetached the Riograndense people of the Brazilian communion, resumes all the rights of primitive freedom, makes use of these imprescriptible rights constituting an independent Republic, takes in the extensive scale of the sovereign states the place that is responsible for the sufficiency of their resources, civilization and natural riches that assure you the full and complete exercise of your independence, eminent sovereignty and dominion, without objection to the sacrifice of the smallest part of this same independence or sovereignty to another nation, government or any strange power.\nPiratini, 29 August 1838\nThis legacy of ragamuffin, came to be considered as the legitimate cradle of Brazilian Republican law.\nArmed forces\n.]]\nThe Imperial Brazilian Navy controlled the main communications media of the province, the Patos Lagoon, between Porto Alegre, Pelotas and Rio Grande, and most of the navigable rivers. In spite of this, it was constantly attacked by ragamuffins, when near the ravines of the rivers. On 1 February 1838, a troop of two thousand rags and a battery of artillery were able to attack two gunboats and a barge on the Caí River, killing almost all the sailors, imprisoning one of the commanders and capturing their ships, thus beginning the creation of the Riograndense Navy.\nIn 1838 Giuseppe Garibaldi had known Bento Gonçalves still in his prison, in Rio de Janeiro, and gave him a corso letter to imprison imperial ships. On 1 September 1838, Garibaldi was appointed captain-lieutenant, commander of the Riograndense navy.\nA shipyard was set up next to a weapons and ammunition factory in Camaquã, at the resort of Ana Gonçalves, sister of Bento Gonçalves. There Garibaldi coordinated the construction and armament of two war-craft. At the same time, Luigi Rossetti went to Montevideo, seeking the help of Luigi Carniglia and other indispensable professionals. After a few weeks, the equipment of masters and workers was complete. Some sailors came from Montevideo and others were recruited around.\n\"), a formation of former and freed slaves, which served the Riograndense Republic as lancers.]]\nAfter the construction of the boats and launched into the water, they captured some merchant ships, but there was not much success against the powerful imperial navy. The Riograndense Navy was completely destroyed in 1839 after their defeat in Santa Catarina.\nInternational recognition\nThe United Provinces of the Río de la Plata at the time were being unified by the dictator Juan Manuel de Rosas and tried to recover the Uruguayan territory (Platine War), not excluding also the possibility of aid to the Riograndense separatists. Juan Manuel de Rosas, the Argentine dictator, offered support so that David Canabarro continued the fight. Juan Manuel de Rosas was removed from power in Argentina in a confrontation involving Brazilian troops.\nAlongside the de facto recognition by the Argentine Confederation, Uruguay started to recognize the independence and sovereignty of the Riograndense Republic, but the diplomatic process was not completed. The United Kingdom and France recognised the new republic under the condition that its port would be open to French and British ships.\nReligious schism\narchive, Porto Alegre.]]\nThe parishes of Rio Grande do Sul were linked to the bishopric of Rio de Janeiro, which brought several obstacles to the Riograndense Republic. To break with the Empire of Brazil, the farroupilhas'' separated completely from the court. On 22 June 1838, they named Father Chagas as apostolic vicar, denying obedience to the bishop of Rio de Janeiro, creating a schism in the Catholic Church of the then Province of St. Peter of Rio Grande do Sul. The apostolic vicar had true religious authority: and appointed priests and dispensed marriages. Father Chagas was excommunicated and his acts were declared unlawful by the bishop of Rio de Janeiro - the maximum authority of the Catholic Church in Brazil. Likewise, most of the Gaucho clergy adhered to the new ecclesiastical authority.\nThe situation lasted until the end of the Ragamuffin Revolution (1835–45). With the defeat, the priest Chagas sought a reconciliation with the bishop of Rio de Janeiro, having been secretary of the new bishop of Porto Alegre.\nAfter the end of the revolution, Father Fidêncio José Ortiz was entrusted by the bishop of Rio de Janeiro to review all the acts practiced and other documents.\nLegacy\nwith the Riograndense Republica coat of arms on its centre]]\nThe Riograndense Republic is symbolically perennial in the flag and coat of arms of the state of Rio Grande do Sul, just as other Brazilian states maintained in their civic symbols evocations of relevant deeds. Its territory derived from the partial split of the Province of São Pedro do Rio Grande do Sul, which had its limits totally defined in relation to Uruguay only after the end of the Ragamuffin War (1835–45). After the proclamation of the Brazilian Republic (1889), the whole territory of the Province became one of the federal units of Brazil, the state of Rio Grande do Sul.\nQuestion about document of the Ponche Verde Treaty\nIn a hypothesis of invalidity of the Ponche Verde Treaty, because of the lack of formalities or incompetence of the signatories, the Republic remaining in the following days would lack sovereignty since it did not have the requisites that legitimize it:\n*It did not hold the monopoly of force since it no longer had its own army: it hosted the Southern Military Command of the Imperial Brazilian Army.\n*Its administration was not independent of the Imperial Government, within the Brazilian unitary state, and was there no subsequent nomination or election of another national president of the republic other than Bento Gonçalves and Gomes Jardim.\n*Finally, the inhabitants of the territory declared themselves Brazilian and participated in Brazilian political life, thus lacking the third fundamental element for the legitimate existence of any national state.\nAmong the many understandings about what is a state, at Convention of Montevideo on 26 December 1933, Brazil was one of the signatories. In the convention, the definition of a state included the following:\n*Government\n*Permanent population\n*Defined territory\n*Ability to relate to other nation-states\nNotes\nReferences\n* Varela, Alfredo. História da Grande Revolução. 6v. Ed. Instituto Histórico e Geográfico do Rio Grande do Sul. Porto Alegre, 1933. [http://Telecharger http://www.pampalivre.info/alfredovarela/historia_da_grande_revolucao__alfredo_varela.htm]\n* http://www.brazil.org.uk/events/machadodeassis_assets/openingaddressvilaca.pdf &nbsp;– Opening address of Dr Marcos Vinicius Vilaça, President of the Brazilian Academy of Letters."
    }
  ]
}