{
  "content": [
    {
      "type": "text",
      "text": "# Ritu Maheshwari\n\n| birth_place       = Punjab, India\n| nationality       = Indian\n| occupation        = IAS officer, Civil servant\n| education         =\n| alma_mater        =\n| spouse            = Mayur Maheshwar\n| father            = C.D. Singla\n| mother            = Saroj Singla\n| office            = Secretary of Medical Education, Health and Family Welfare Government of Uttar Pradesh\n| term_start        = February 2025\n| predecessor       =\n| office1           = Divisional Commissioner of Agra Division\n| term_start1       = July 2023\n| term_end1         = August 2025\n| predecessor1      = Amit Gupta\n| successor1        =\n| office2           = Chief Executive Officer of Noida Authority\n| term_start2       = 2019\n| term_end2         = July 2023\n| successor2        = Lokesh M\n}}\nRitu Maheshwari is an Indian Administrative Service officer serving as the Secretary of Medical Education, Health and Family Welfare for the Government of Uttar Pradesh since August 2025. She previously served as the Divisional Commissioner of Agra, Uttar Pradesh and as the chief executive officer of the New Okhla Industrial Development Authority She has also been the managing director of Noida Metro Rail Corporation.\nEarly life\nRitu Maheshwari was born on 14 July 1978 in Punjab, India, to a Hindu family of C.D. Singla and Saroj Singla. She married Mayur Maheshwari, an IAS officer of the Uttar Pradesh cadre.\nEducation\nRitu Maheshwari is from Punjab and completed her primary education at DAV Public School, Amritsar. She attended Punjab Engineering College and earned a Bachelor of Engineering in Electrical Engineering. Later, she joined pursued a Master of Business Administration in Executive Development from Amity University, Noida. Ritu comes from a family with a business background and is the first member of her family to join the civil services.\nCareer\nRitu Maheshwari is a 2003 batch IAS officer. She started her career as a Joint Magistrate and Collector of Lucknow in 2005. In 2007, she held the post of District Magistrate and Collector of Ghazipur.\nRitu has also served as a chief executive officer of Noida and Greater Noida. Presently, she is serving as Divisional Commissioner of Agra.\nShe also served as the Divisional Commissioner of Agra Division from July 2023 to August 2025. During her tenure as the CEO of the Noida Authority, generated a record revenue of ₹7,000 crore in the financial year 2022-23 the highest in the preceding 12 years.\nIn February 2025 Ritu Maheshwari was appointed as the Secretary of Medical Education, Health and Family Welfare in the Government of Uttar Pradesh.\nBiographical film\nKatiyabaaz (Electricity Thief) movie is based on Ritu Maheshwari's life when she worked in Kanpur as the managing director of Kanpur Electricity Supply Company.\nAwards and recognition\n* Gfiles Excellent Contribution Award.\nReferences"
    }
  ]
}