{
  "content": [
    {
      "type": "text",
      "text": "# Riverside (software)\n\n| founded       =\n| founders      = Nadav Keyson  Gideon Keyson\n| area_served   = Worldwide\n| key_people    = Nadav Keyson (CEO)  Gideon Keyson (CTO)\n| website       =\n}}\nRiverside is an online software for remote audio and video recording, editing, and production.\nHistory\nRiverside was founded in 2020 by brothers Gideon and Nadav Keyson, originally from the Netherlands, as a platform for remote audio and video recording. It was released in March 2020, shortly before global lockdowns forced many content creators and broadcasters to work remotely due to the COVID-19 pandemic. Later, Riverside was used by Hillary Clinton, Bill Gates, Michelle Obama, Kara Swisher, and Mark Zuckerberg.\nIn April 2021, Riverside completed a $9.5 million Series A funding round led by Alexis Ohanian’s Seven Seven Six, with participation from Casey Neistat, Marques Brownlee, Guy Raz, and Elad Gil, following earlier seed funding from Zeev Ventures. In August 2021, Riverside released its app for the iPhone.\nIn April 2022, Riverside raised $35 million in a Series B round, led by Zeev Ventures. By 2022, Riverside had offices in New York and Amsterdam as well.\nIn February 2024, Riverside and Spotify formed a partnership; as a result, Riverside’s software features were embedded into Spotify for Podcasters as an optional workflow, and Spotify discontinued its Music + Talk, Record with Friends, and Voice Message features. In December 2024, Riverside received an additional $30 million in Series C funding, again led by Zeev Ventures.\nPlatform\nRiverside is a cloud-based software for remote audio and video recording, editing, and production. It allows users to initiate sessions, invite participants, and capture recordings remotely.\nRiverside records locally, saving audio and video directly on users' devices before uploading them to the cloud, to avoid Internet disruptions. It captures separate tracks for each user with up to 4K video and uncompressed WAV audio.\nRiverside uses artificial intelligence (AI) to assist with editing and noise management. Its Editor uses AI to automatically detect speaking segments and transitions between speakers. Other features include automated transcription and text-based editing, which let users make text edits that simultaneously adjust the corresponding audio and video segments. Additionally, the \"Magic Clips\" feature automatically generates shorter clips from full-length recordings for social media. Riverside also supports live streaming of shows and online radio broadcasts.\nRiverside is accessible through web and mobile applications.\nReferences\nExternal links\n*"
    }
  ]
}