{
  "content": [
    {
      "type": "text",
      "text": "# Riverside (Cardiff electoral ward)\n\n| os_grid_reference           =\n| post_town                   = CARDIFF\n| postcode_area               = CF\n| postcode_district           = CF11\n| dial_code                   = +44-29\n| constituency_westminster    = Cardiff West\n| unitary_wales               = Cardiff\n| constituency_welsh_assembly = Cardiff West\n| CASCode                     =\n| councillors                 = 3\n| hide_services               = yes\n}}\nThe Riverside electoral ward of Cardiff covers the Riverside and Pontcanna areas of the city, electing three councillors to Cardiff Council. The ward was originally created in 1890, as a ward to Cardiff County Borough Council.\nDescription\nThe Riverside ward includes the communities of Riverside and Pontcanna, which are located immediately west of Cardiff city centre and the River Taff. According to the 2011 census the population of the ward was 13,771.\nThe boundary of the electoral ward initially matched that of the Riverside community. However, Pontcanna saw itself as distinctly different, with its smart Victorian houses and villas surrounding Cathedral Road despite these existing in other, 'less desirable', parts of Riverside like Fitzhamon Embankment or Lower Cathedral Road. In November 2016 the northern two-thirds of the ward became a separate Pontcanna community.\nRiverside is bounded by the wards of Cathays to the east, Grangetown to the south; Canton and Llandaff to the west. There is no community council for the area.\nIt is located in the parliamentary constituency of Cardiff West and the Senedd constituency of the same name.\nRepresentatives\n2017\n}}\n2015 by-election\nLabour councillor Cecilia Love resigned her seat in August 2015 for family reasons causing a by-election, which was won on 7 October 2015 by Labour candidate Caro Wild.\n2012\nAfter a \"bitter\" campaign Plaid Cymru lost their remaining two ward seats to the Labour Party, with sitting Labour councillor Iona Gordon topping the poll.\n}}\n2011 by-election\nPlaid Cymru councillor Gwenllian Lansdown resigned her seat in January 2011 after six years representing Riverside, because she had moved from Cardiff to live in Powys. The resulting by-election took place on 3 March 2011, which was won unexpectedly by the Labour candidate, Iona Gordon. The turnout was 39.8%.\n2008\n}}\nWard creation\nIn July 1890, following the creation of Cardiff County Borough Council, Riverside was the name of one of the ten new electoral wards created in the county borough. It was briefly known as \"Canton South\", having been split from the existing Canton ward, which had been growing rapidly. Each of the three councillors took turns to stand for re-election, on a three-yearly cycle.\n1890\nThe first election on 1 November 1890 was unusual because there were contests to elect two councillors rather than one. This was because sitting Conservative Cllr Smith had recently died and an election was needed to elect a replacement. Both elections saw the Liberal Party gain seats from the Conservatives, by small majorities. Noah Rees won Cllr Smith's seat and Dr James defeated sitting councillor, Mr R. Price.\n= sitting councillor prior to the election\nReferences"
    }
  ]
}