{
  "content": [
    {
      "type": "text",
      "text": "# Riverhills, Queensland\n\n| local_map           = yes\n| zoom                = 12\n| pop                 = 4121\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4074\n| area                = 2.3\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 19.5\n| dir1                = SW\n| location1           = Brisbane CBD\n| dist2               =\n| dir2                =\n| location2           =\n| dist3               =\n| dir3                =\n| location3           =\n| dist4               =\n| dir4                =\n| location4           =\n| lga                 = City of Brisbane(Jamboree Ward)\n| stategov            = Mount Ommaney\n| fedgov              = Oxley\n| near-n              = Westlake\n| near-ne             = Middle Park\n| near-e              = Sumner\n| near-se             = Wacol\n| near-s              = Wacol\n| near-sw             = Moggill\n| near-w              = Bellbowrie\n| near-nw             = Bellbowrie\n}}\nRiverhills is a south-western suburb in the City of Brisbane, Queensland, Australia. It is one of the Centenary suburbs. In the , Riverhills had a population of 4,121 people.\nGeography\nRiverhills is  by road south-west of the Brisbane CBD.\nRiverhills is bounded to the west by the Brisbane River, to the south by Wolston Creek, and to the south-east by Wacol Station Road.\nThe land use is predominantly residential. The terrain is hilly rising from below  above sea level beside the river to over  on the northern bank of Wolston Creek.\nHistory\nThe western part of the original land holdings that became the Centenary Suburbs were part of the Wolston Estate, consisting of 54 farms on an area of 3000 acres, offered for auction at Centennial Hall, Brisbane, on 16 October 1901. Wolston Estate is the property of M. B. Goggs, whose father obtained the land forty years previously in the 1860s and after whom Goggs Road is named. Only three of the farms sold at the original auction.\nIn 1879, the local government area of Yeerongpilly Division was created. In 1891, parts of Yeerongpilly Division were excised to create Sherwood Division becoming a Shire in 1903 which contained the area of the Wolston Estate. In 1925, the Shire of Sherwood was amalgamated into the City of Brisbane.\nRiverhills, along with surrounding suburbs, was developed in 1959 as part of the Hooker Centenary Project in 1959. The 'Centenary Project' and the area is now more commonly referred to as the Centenary Suburbs.\nOn 8 January 1973, the suburb was officially named by Queensland Place Names Board using the name suggested in 1972 by the developer based on the geographic characteristics of the area.\nIn the 2011 Brisbane floods, there was flooding in the lower-lying areas around the creeks.\nDemographics\nIn the , Riverhills had a population of 4,042 people, 50.6% female and 49.4% male. The median age of the Riverhills population was 34 years, 4 years below the Australian median. 66.7% of people living in Riverhills were born in Australia, compared to the national average of 66.7%; the next most common countries of birth were England 4.6%, New Zealand 4.4%, South Africa 1.7%, Vietnam 1.6%, Scotland 1.0%. 80.6% of people spoke only English at home; the next most common languages were 2.0% Vietnamese, 1.6% Mandarin, 1.1% Persian, 1.0% Arabic, 0.8% Spanish.\nIn the , Riverhills had a population of 4,121 people.\nEducation\nThere are no schools in Riverhills. The nearest government primary school is Middle Park State School in Middle Park to the west. The nearest government secondary school is Centenary State High School in Jindalee to the north.\nAmenities\nThe Riverhills Plaza is a shopping centre on Bogong Street (). In 2011 one of its stores, Just Poppy's, was named Brisbane's Best Burgers in a contest run by the Brisbane Times.\nThere are a number of parks in the suburb with various sporting and recreational facilities. There are also less developed areas around a number of creeks and gullies flowing down to the river for those wishing to enjoy nature.\nThere is a boat launching area into the river for non-motorised craft at Newcomb Park at 529 Sumners Road (). The Centenary Rowing Club and Lakers Dragon Boat Club operate from that park. A floating pontoon assists with getting in and out of watercraft. It was damaged in the 2022 Brisbane flood, but have been rebuilt.\nTransport\nRiverhills is accessible via the Centenary Highway. Some bus routes service the suburb, namely:\n* 450 - CityXpress via Cultural Centre, Toowong, Indooroopilly, Jindalee, Mount Ommaney, Middle Park and Westlake (weekends) (BT)\n* 454 - CityXpress via Cultural Centre, Toowong, Indooroopilly and Riverhills (weekdays) (BT)\n* 455 - Rocket via Milton, and the Western Freeway (Weekdays - peak hours only) (BT)\n* 457 - City Precincts via Milton, Coronation Drive, Western Freeway, Jindalee, Mount Ommaney, Middle Park and Westlake (weekdays - peak hours only) (BT)\n* 459 - City Precincts via Milton, Coronation Drive, Western Freeway and Mount Ommaney. (weekdays - peak hours only) (BT)\nRiverhills is a short distance from Darra train station.\nPolitics\nThe people of Riverhills are represented by Sarah Hutton, LNP Councillor for the Jamboree Ward, in the local council, by Jess Pugh, the Labor Member for Mount Ommaney in the Queensland Parliament and by Milton Dick in the federal division of Oxley.\nReferences\nExternal links\n*\n* [http://www.ourbrisbane.com/living/suburbs/riverhills/home/ ourbrisbane.com website, Riverhills section]\n* [https://cshsoc.org.au/ Centenary Suburbs Historical Society Inc.]"
    }
  ]
}