{
  "content": [
    {
      "type": "text",
      "text": "# Rizal Archaeological Site\n\n| location = Rizal, Kalinga, Philippines\n| region = Cordillera\n| type =\n| part_of =\n| length =\n| width =\n| area =\n| height =\n| depth =\n| builder =\n| material =\n| built =\n| abandoned =\n| epochs =\n| cultures =\n| dependency_of =\n| occupants =\n| event =\n| excavations =\n| archaeologists =\n| condition =\n| ownership =\n| management =\n| public_access =\n| website =\n| notes =\n}}\nThe Rizal Archaeological Site is an archaeological area situated in Rizal, Kalinga, Philippines.\nThe first fossils were discovered on the archaeological site in 1935. On 1977, President Ferdinand Marcos Sr. declared the site as an archaeological reserve.\nArchaeological findings\nThe site is located in the municipality of Rizal in Kalinga province, Luzon island. In 2018, a French-Filipino team of archeologists led by Thomas Ingicco discovered 57 stone tools directly associated with the fossil of a butchered rhinoceros, the extinct Nesorhinus philippinensis. The discovery pushed the first known hominin activity in the Philippines back to  709,000 ± 68,000 years ago (709 ± 68 ka), during the Chibanian or Middle Pleistocene age. Prior to the excavation, the oldest fossil discovered in the country was a foot bone found in 2010 in Callao Cave, Cagayan Valley. The bone was dated at least 67,000 years old.\nThe recovered artifacts consisted of flake tools, lithic cores, and hammerstones. Flakes were sourced from dacite (a volcanic rock) as well as various siliceous rocks like chert, flint, jasper, and quartzite. The rhinoceros skeleton was found from a clay-rich bone bed; it was discovered as 75% complete, although the bones were separated at the joints. Cut marks on 13 of the bones indicated that hominins used stone tools to remove the carcass's flesh. They likely intended to smash the bones for marrow extraction as well, as shown by percussion marks on both humeri.\nTo date the fossil and its associated tools, electron spin resonance methods were performed on tooth enamel and quartz rock samples. Argon–argon dating was applied on plagioclase grains.\nReferences\nCitations\nWorks cited\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*"
    }
  ]
}