{
  "content": [
    {
      "type": "text",
      "text": "# Rjukan–Notodden Industrial Heritage Site\n\n(ii), (iv)\n| ID            = 1486\n| coordinates   =\n| year          = 2015\n| area          =\n| buffer_zone   =\n| locmapin      = Norway\n| map_caption   =\n|WHS=|Criteria=}}\nThe Rjukan–Notodden Industrial Heritage Site is a World Heritage Site in Telemark county, Norway, created to protect the industrial landscape around Lake Heddalsvatnet and Vestfjorddalen valley. The landscape is centered on the plant built by the Norsk Hydro company to produce calcium nitrate fertilizer from atmospheric nitrogen using the Birkeland–Eyde process. The complex also includes hydroelectric power plants, railways, transmission lines, factories, and workers' accommodation and social institutions in the towns of Notodden and Rjukan.\nThis site, along with the Odda–Tyssedal Industrial Heritage Site, was placed on the tentative World Heritage list on 19 June 2009. On 5 July 2015, it was placed on the World Heritage list under Criteria II and IV with the following description of the Outstanding Universal Value:\nScope\nThe Rjukan–Notodden site stretches from Møsvatn lake to Notodden, encompassing 97 discrete structures considered to be culturally significant. Notable examples of such structures are the Rjukan Line and the Tinnoset Line, two railways with corresponding train ferries. Factory towns built by Tinfos and Norsk Hydro, including homes and other town buildings.\nHistory\nThe Birkeland–Eyde process\nIn the early 1900s, Norway was able to leverage the geographical availability of cheap hydroelectric power to begin industrial development. The sparsely populated Telemark region made the transition from a primarily agricultural zone to a center of industry, which required strong industrial development. In order to support agricultural expansion, Norway required large quantities of fertilizer. The common solution was sodium nitrate, which was extracted through mining.\nThe main industrial component of the Rjukan–Notodden site is the facilities created for producing fertilizer through nitrogen fixation. The Birkeland-Eyde process, named for scientist Kristian Birkeland (1867-1917) and industry tycoon Sam Eyde (1866-1940), allowed for nitrate intended for fertilizer to be produced on an industrial scale. It used electric arc to create nitric oxide through heat. The process was initially tested at The Royal Frederick University, now named the University of Oslo.\nProcess development\nWhen the power production capability of The Royal Frederick University proved insufficient, the experiments were moved offsite to a warehouse in Kristiania. In October 1903, the experiments were again moved to Ankerløkken Testing Station in Maridalen, where they could be powered directly by the Hammeren Hydroelectric Power Station. The final relocation of the experimental phase was to Vassmoen, near Arendal, where the first industry-capable arc furnaces were developed. After its completion, the process was presented by Otto Nikolaus Witt at Technische Universität Berlin on 18 November 1905. On 5 December 1905, Kristian Birkeland gave a lecture about the process at the Norwegian Academy of Science and Letters, while Sam Eyde gave a lecture at the Norwegian Polytechnic Society.\nThe move to Notodden\n, Norway.|alt=]]\nAfter creating an adequate process, Birkeland and Eyde founded the Norsk Hydro-Elektrisk Kvælstofaktieselskab (lit. Norwegian Hydroelectric Nitrogen Share-Company) to commercialize it. This undertaking was partially financed by the Wallenbergs, an influential Swedish family. Norsk Hydro also entered into an agreement with Banque de Paris et des Pays-Bas S.A. in 1905.\nBy the time Norsk Hydro secured financing, some of Birkeland's arc furnaces were already present in the Notodden facility, powered by the Tinfos I Hydroelectric Power Station. This station was leased from the company Tinfos AS.  The researchers moved the arc furnace at Vassmoen to the Notodden site in order to test the effect of electric power on fertilizer yield. After determining what type of furnace was the best choice for mass production, Eyde's previous company Elkem was placed in control of the factory.\nSvælgfos I and II\n, Norway]]\nBetween 1906 and 1907, preparations were made to expand production, which necessitated more energy. Norsk Hydro was by then able to construct their own power plant at the Svelgfossen waterfall, known as Svælgfos I. Excess available water flow allowed for the construction of a backup plant, Svælgfos II. Svælgfos I was the second-largest hydroelectric power station in the world at the time, following Edward Dean Adams Power Plant at Niagara Falls. In the plant's first few years, plant shutdowns were common due to burnt-out generators. Consequently, electrical engineers with experience working on generators in Paris, Hamburg, and Mexico were consulted. These individuals were some of the only ones in the world who had experience with power plants of comparative size. It was determined that the problems experienced by the Svælgfos plants were due to insulation materials burning at high temperatures caused by a manufacturing error. A lightning arrester was constructed to remediate this fault. Svælgfos I and II, along with Lienfoss Power Plant, were later merged into a power plant that is still in service as of May 2020.\nVemork\nThe Vemork Hydroelectric Power Station was designed by Olaf Nordhagen, influenced by traditional Norwegian architecture. Upon its completion in 1911, it was the largest hydroelectric power plant in the world. Vemork is most famous for its proximity to the events of Operation Gunnerside, in which the nearby hydrogen plant is known as Vannstoffen (lit. Hydrogen) was sabotaged (due to its production of heavy water used in atomic experimentation) by a group of Norwegian partisans who had initially fled Nazi-occupied Norway. Today, the Vemork power plant building houses the Norwegian Industrial Workers Museum, where the hydroelectric generators are still visible.\nRole in world fertilizer development\nIn 1909, Fritz Haber discovered a new process to produce nitrogen-based fertilizer. In cooperation with the German chemical company BASF, Carl Bosch was tasked with implementing this process on a commercial scale. In 1913, Norsk Hydro had an option to license the Haber-Bosch process, but elected not to. Norsk Hydro was approached again in 1920 to use the Haber-Bosch process; this time by the French government, who had gained it as part of a settlement following World War I. Instead, Norsk Hydro attempted to develop a viable alternative to the Haber-Bosch method that would use a lower pressure to produce ammonia. This attempt failed, and the project was mothballed in 1924. Norsk Hydro did eventually switch to the Haber-Bosch process in 1927, in collaboration with IG Farben. The plants were again redirected to the Odda Process in the 1930s.\nReferences\nExternal links\n*[https://artsandculture.google.com/exhibit/rjukan-notodden-industrial-heritage-site/zwLyiZuERTZZKg Explore Rjukan-Notodden Industrial Heritage Site in the UNESCO collection on Google Arts and Culture]"
    }
  ]
}