{
  "content": [
    {
      "type": "text",
      "text": "# RNAS Kingsnorth\n\nRAF Kingsnorth}}\n| gridref =\n| pushpin_map = Kent#UK\n| pushpin_map_caption = Shown within Kent\n| pushpin_label = RNAS Kingsnorth\n| pushpin_label_position =\n| ownership = Admiralty\n| operator = Royal Naval Air ServiceRoyal Air Force\n| controlledby =\n| open_to_public =\n| site_other_label =\n| site_other =\n| site_area =\n| code =\n| built = /14\n| used = April 1914 - August\n| builder =\n| fate =\n| condition =\n| battles =\n| events =\n| past_commanders = Commander Neville Usborne RNVR\n| garrison =\n| occupants =\n| designations =\n| website =\n| footnotes =\n| IATA =\n| ICAO =\n| LID =\n| GPS =\n| WMO =\n| elevation =\n| r1-number =\n| r1-length =\n| r1-surface =\n| r2-number =\n| r2-length =\n| r2-surface =\n| r3-number =\n| r3-length =\n| r3-surface =\n| h1-number =\n| h1-length =\n| h1-surface =\n| airfield_other_label =\n| airfield_other =\n}}\nRNAS Kingsnorth was a First World War Royal Navy air station for airships, initially operating as an experimental and training station, it later moved on to large scale production of airships. It also provided anti-submarine patrols. A number of experimental and prototype blimps were designed and tested there and until 1916, it was the lead airship training establishment in the Royal Naval Air Service.\nIt was located at the southeastern coast of the Hoo Peninsula in Kent.\nIt is not to be confused with RAF Kingsnorth, a separate airfield near Ashford in southern Kent under RAF control before and during World War II.\nBeginnings\nIn 1912 an airship station was procured by the Admiralty to test and evaluate airships with Kingsnorth farm (later RNAS Kingsnorth) chosen as the location in 1913. Miskin, the landowner agreed to surrender his lease on Kingsnorth Farm so that an airship test hangar could be built. A further 81 and a half acres were later purchased from Miskin (Barton Farm) to allow the unrestricted manoeuvring of airships in the test phase.\nThe air station initially received a German built Parseval PL-18 airship and undertook evaluations, where it received the service designation Naval Airship No. 4 (NA4). Kingsnorth also received an Astra Torres airship. Experiments were carried out including an unsuccessful attempt to launch a fighter aircraft from a non-rigid balloon.\nRoyal Naval Air Service (1914-1918)\nRNAS Kingsnorth was commissioned in April 1914 under the control of the Admiralty, first through the Naval Airship Branch, then through the Royal Naval Air Service when the Royal Navy reformed its air branch in July 1914. The RNAS took over the base's two huge airship sheds and its development and training functions.\nFlying Units\nRNAS Kingsnorth initially used the first two airships: Astra Torres No. 3 and Parseval No.4, to escort troopships carrying the British Expeditionary Force to France in the summer of 1914.\nRNAS Kingsnorth was involved in the development and flight testing of non-rigid airships, with the SS-class airship (Submarine Scout) being the first type to operate from there, providing anti-submarine defences to the Thames Estuary and southeast coast. The C-Class airship (Coastal Class) type followed, with aircrews trained at the site until the then-named RNAS Cranwell took over this role mid-war.\nBy the start of 1915, there were less than 100 British airmen who could actually fly an airship. It was then decided that RNAS Kingsnorth would be used as a flying training station. Students who had completed the free ballooning courses and ground instruction at RNAS Wormwood Scrubs, would then be passed on to RNAS Kingsnorth for instruction at an operational airship station.\nIntensive training was given to the pupils, and due to the operational requirements for qualified pilots, the initial stage was omitted and student aircrew found themselves on the immediate instruction course on an operational airship. Training was given in both theory and practice, with students completing courses in aeronautics, navigation, metrology, engineering, and practical flying. Instruction was given in Submarine Scout ships which were perfectly suited as they had a two-seater configured fuselage.\nTesting of the NS-class airship (North Sea) also took place at RNAS Kingsnorth, with successful flight trials first completed in February 1917.\nAviation Support Units\nBy 1914, RNAS Kingsnorth was also home to a newly formed Naval Met Service, which provided weather information to airships operating locally over the North Sea.\nRoyal Air Force (1918-1921)\nOn 1 April 1918 the Royal Flying Corps and the RNAS combined to form the Royal Air Force (RAF) and the station became known as RAF Kingsnorth before decommissioning in 1921.\nThe site was occupied by Kingsnorth Power Station until it was decommissioned in 2012. A new development, called MedwayOne, is planned to include storage, a data centre, lorry park, and manufacturing space.\nSee also\n*RNAS Calshot\n*RAF Eastchurch another air station providing flying training to the Royal Navy at this time.\n*RAF Kingsnorth (A separate airfield operated under RAF control during WWII)\n*RNAS Lee-on-Solent (HMS Daedalus)\n*List of flying boats and floatplanes\n*List of air stations of the Royal Navy\n*List of former Royal Air Force stations\nReferences"
    }
  ]
}