{
  "content": [
    {
      "type": "text",
      "text": "# Roadside Heritage\n\nRoadside Heritage is a program designed to document and publicize the history, culture, and scientific background of the Eastern Sierra Nevada and the Owens Valley in the United States. It uses schoolchildren to interview scientists, Native Americans, and others and to record the interviews. These result in \"audio stories\" which can be downloaded from the website for use by travelers and others interested in the area.\nRoadside Heritage is based in Bishop, California. It is a program of ESICE, the Eastern Sierra Institute for Collaborative education, a nonprofit organization incorporated in 1997. It is designed to connect rural youth with media professionals to create interpretive programs for scenic byway travelers, enriching the visitor's experience with a greater appreciation of the landscape and history along U.S. Route 395 in California.\nThrough after-school programs, middle school students interview a range of experts from knowledgeable citizens to scientific researchers, gathering material with the support of distant universities. Selections of the interviews are used to create traveling companion programs that explain the features of the landscape in the context of its human and natural history.\nHistory\nRoadside Heritage was launched by ESICE in 2004 with support from the Local Transportation Commissions of Inyo and Mono counties. The program and partnership broadened in 2005 with the inclusion of the University of California, Berkeley’s Lawrence Hall of Science and the University of Nevada, Reno’s Academy for the Environment. This collaboration resulted in a $2.6 million grant from the National Science Foundation for a three-year initiative to investigate the legacy of scientific exploration and discovery in the region, and to explore adaptation to the environmental extremes.\nMission\nTo help both regional travelers and rural communities discover the cultural and scientific heritage of the Eastern Sierra, Roadside Heritage provides local youth the means and opportunity to act as reporters and interpreters, recording audio interviews with area experts, scholars and scientists; providing travelers with unique access to enriching information about the natural and cultural history of the region they are traveling through and the contributions the region continues to make to our national legacy in science, technology, engineering and math (STEM).\nAlong the way, all Roadside Heritage participants discover, through the power of storytelling, the richness of culture and history in the communities of the Eastern Sierra. The recordings, crafted by media professionals, are used to create audio programs on CD and on the Internet that can be enjoyed by motorists who travel the 220 mile Eastern Sierra Scenic Byway along US 395 at the base of the eastern escarpment of California's Sierra Nevada Mountains.\nAbout the stories\nMost travelers, focused on reaching their destination, hurry through scenic and dramatic Eastern Sierra unaware of the breadth of history hidden in the landscape where some of the most colorful stories in the tales of the American Western took place. Engaging authentic stories from one of the most beautiful areas of the western United States, California’s Eastern Sierra, are told by those who live here and those that have been here to study its unique environment. Tales of Paiute trading routes, geologic forces, adaptations of plants and animals, heroic pioneer settlers, and railroad barons, are available for download the Roadside Heritage' website.\nThe first CD, Paiute, Prospectors & Pioneers, was produced in 2006 and received the 2008 Silver Medal Award for interpretive audio programming from the National Association for Interpretation.  The second CD released in 2009 was Traditions, Travelers & Tales of Mono County.  The third CD, Exploring Extreme Environments in the Eastern Sierra, was released in spring of 2010. These CDs are available free of charge at various visitor locations and can be downloaded from the Roadside Heritage website. Shorter 7-minute \"episodes\" on specific topics of geology and history can be seen on television station websites and at the Roadside Heritage site. Titles include Obsidian, Volcanology, Alpine Flora, Weather and Climate, Mountain Building, Mineralogy, Alpine Fauna, Desert Terminal Lakes, Mining and Minerals, Extreme Life Forms, and Mono Lake.\nRecognition\nThe program has been recognized by television and newspaper publications in California and Nevada for its innovative presentations of the local history and culture along the 220 mile US 395 scenic byway.\nAcknowledgments\nRoadside Heritage  is a project made possible by historians, scientists, interpreters, foundations, advisory committees, students, audio and graphic experts, and others with integrity, humor, and respect for everyone involved.\nFunders\n*The H.N. and Frances C. Berger Foundation\n*The National Science Foundation\n*Inyo County Local Transportation Commission / Inyo County Public Works Dept.\n*Mono County Local Transportation Commission / Mono Community Dev. Dept\n*California Department of Transportation\nSponsors/Partners\n*Inyo National Forest\n*Los Angeles Department of Water and Power\n*Audio Landscapes\n*Eastern California Museum\nReferences\nExternal links\n* [https://web.archive.org/web/20110928031520/http://yubanet.com/regional/University-of-Nevada-Reno-researchers-shed-light-on-Eastern-Sierra-395-corridor.php Yubanet article]"
    }
  ]
}