{
  "content": [
    {
      "type": "text",
      "text": "# Roads in the United Kingdom\n\nThe United Kingdom has a well developed and extensive network of roads totalling about . Road distances are shown in miles or yards and UK speed limits are indicated in miles per hour (mph) or by the use of the national speed limit (NSL) symbol. Some vehicle categories have various lower maximum limits enforced by speed limiters. A unified numbering system is in place for Great Britain, whilst in Northern Ireland, there is no available explanation for the allocation of road numbers.\nis an example of an urban motorway.]]\nThe earliest specifically engineered roads were built during the prehistoric British Iron Age. The road network was expanded during the Roman occupation. Some of these roads still remain to this day. New roads were added in the Middle Ages and from the 17th century onwards.  Whilst control has been transferred between local and central bodies, current management and development of the road network is shared between local authorities, the devolved administrations of Scotland, Wales and Northern Ireland, and National Highways in England. Certain aspects of the legal framework remain under the control of the United Kingdom parliament.\nAlthough some roads have much older origins, the network was heavily developed from the 1950s to the mid-1990s to meet the demands of modern traffic. Construction of roads has become increasingly problematic with various opposition groups such as direct action campaigns and environmentalists. There are various ongoing and planned road building projects.\nIn the UK, road safety policy is part of transport policy. \"Transport 2010; The 10 Year Plan\" states that the basic principle is that \"people travel safely and feel secure whether they are on foot or bicycle, in a car, on a train, or bus, at sea or on a plane\".\nRoad network\nThe UK has a road network totalling about  of paved roads— in Great Britain (England, Scotland and Wales), and  in Northern Ireland.\nAdministration\nResponsibility for the road network differs between trunk and non-trunk routes.  Trunk roads, which are the most important roads, are administered by National Highways in England, Transport Scotland in Scotland, the North and Mid Wales Trunk Road Agent, and South Wales Trunk Road Agent in Wales. England's  of trunk roads account for 33% of all road travel and 50% of lorry travel. Scotland has , about 7% of the total roads in Scotland, accounting for 35% of all road journeys and over 50% of lorry movements.\nWales has  of trunk roads. In London, Transport for London is responsible for all trunk roads and other major roads, which are part of the Transport for London Road Network. All other roads are the responsibility of the relevant county council or unitary authority. In Northern Ireland, DfI Roads is responsible for all  roads. The pan-UK total is .\nWhilst generally they are trunk roads, some motorways are the responsibility of local authorities, for example the M275.\nSince 2008, location marker posts have appeared on motorways and major A roads in England, situated generally at intervals of 500metres, though the units are not given. These repeat the information given on the co-sited surveyors' marker post which, since the 1960s, have reported distances on such roads in kilometres from a datum—usually the start of the road, or the planned start-point of the road.\nClassification\nNumbered roads in the UK are signed as M (Motorway), A, or B roads (legal \"classification\" varies between countries), as well as various categories of more minor roads: for internal purposes, local authorities may also use C, D and U (the letter standing for \"Unclassified\"); use of C and U numbers on signs is unusual but examples can be found in all four countries in the UK.\nEach road is given a number which is combined with the prefix, for example M40, A40 and B1110, although their informal or traditional names may still be used or heard occasionally: for instance, the Great North Road (now part of the A1) and the Great Cambridge Road (modern A10). These numbers follow a zonal system. There is no available explanation for the allocation of road numbers in Northern Ireland.\nThe majority of the major inter-urban routes are motorways, and are designed to carry long-distance traffic. The next category is the primary route network, formed from parts of the A-road network. A primary route is defined as:\nIn Scotland, the Scottish Government has confirmed that Primary Routes should be defined by and be consistent with the trunk road network.\nIn April 2015, a new standard was set to designate certain high-quality routes as Expressways. Whether this will result in any existing road classifications changing is unclear.\nPrimary destinations\nPrimary destinations are usually cities and large towns, to which, as a result of their size, a high volume of traffic is expected to go. However, in rural areas, smaller towns or villages may be given primary status if located at junctions of significant roads: for example, Llangurig in Wales and Crianlarich in Scotland. As a further example, Scotch Corner in northern England is not even a village—merely a hotel and a few other buildings—yet has the status of a primary destination due to its location at the interchange of the A1 and A66 roads. For similar reasons, certain airports, sea ports, bridges and tunnels have been designated as primary destinations. Conversely, some towns with a population of over 50,000 are not primary destinations, including Woking, Chatham and Cumbernauld.\nThe status of both primary destinations and roads is maintained by the Department for Transport in combination with National Highways (for England), the Scottish Government and the Welsh Government. The concept of primary roads was introduced in the 1960s as part of a national reclassification of roads.\nRegional destinations\nwith South Wales, the Midlands and London in capitals. London is a not a regional destination, therefore should not be in capitals]]\nRegional destinations are commonly used on long-distance routes throughout the country alongside primary destinations. They are displayed on signs in capitals to distinguish them from towns and cities. The boundaries of these regional destinations are not specifically defined and apply to generalised areas. The regions are: Mid Wales, North Wales, Scotland, South Wales, The East, The Lakes, The Dales, The Midlands, The North, The North East, The North West, The South, The South West and The West.\nSignage\nSignage on the UK network conforms broadly to European norms, though a number of signs are unique to Britain and direction signs omit European route numbers. All length distances are shown in miles or yards, speed is in miles per hour whilst height and width restrictions are required to be shown in feet and inches, though the metric measurements may optionally also appear. In September 2007 the European Commission ruled that the United Kingdom would never be required by them to convert signs to metric.\nThe signage system currently in use was developed in the late 1950s and the early 1960s by the Anderson Committee, which established the motorway signing system, and by the Worboys Committee, which reformed signing for existing all-purpose (non-motorway) roads.  It was introduced in 1965 and is governed by the Traffic Signs Regulations and General Directions. Signs may be of an informative, warning or instructional nature.\nInstructional signs are generally circular. Warnings are triangular. Informative signs are rectangular or square.  Motorway informative signs use white text on a blue background. Primary routes are indicated by green directional and distance signs with yellow text. Secondary roads use black text on a white background.\nElectronic signage\nOn 27 March 1972, the first motorway computer-controlled warning lights in the UK, with 59 miles on the M6 from Broughton, Lancashire to Barthomley, on the Cheshire boundary, and 26 miles on the M62 east of Whitefield, was switched on by Michael Heseltine and Charles Legh Shuldham Cornwall-Legh, 5th Baron Grey of Codnor at the headquarters of Cheshire Constabulary on Nuns Road.\nIt was centred at a police computer centre at Westhoughton, that connected to police stations in Preston and Chester. The Chester site was soon be connected to the M53 and M57. Four other regional computer centres would be opened at Perry Barr near the M6, Scratchwood near the M1, at Hook near the M3, and at Almondsbury near the M4. Most British motorways would be covered by 1975. The system was designed by GEC and had taken five years to design.\nDriving\nIn the UK, vehicles are normally driven or ridden on the left and required to keep to the left except when overtaking, turning right or passing pedestrians, parked vehicles and other obstructions in the road. In Great Britain, the Highway Code applies. In Northern Ireland, the Highway Code for Northern Ireland applies.\nUK speed limits apply only to motor vehicles and are shown in mph. With a few exceptions, they are in multiples of 10, ranging from  to . Unless a lower speed limit is posted on a road, the national speed limit applies, which varies between class of vehicles and the type of road. In a built-up area (usually indicated by street lights), unless signs indicate otherwise, a limit of  applies.  Other limits are shown in the table.\n{| class=\"wikitable\"\n|+ National speed limits on roads in the UK\n! rowspan=\"3\" colspan=2|Type of vehicle\n! colspan=6 | Speed limit\n|-\n! colspan=2 | Single carriageway\n! colspan=2 | Dual carriageway\n! colspan=2 | Motorway\n|- style=\"text-align:center;\"\n|  style=\"width:8%; \"| mph\n|  style=\"width:8%; \"| km/h\n|  style=\"width:8%; \"| mph\n|  style=\"width:8%; \"| km/h\n|  style=\"width:8%; \"| mph\n|  style=\"width:8%; \"| km/h\n|-\n|colspan=2|Car/motorcycle, car-derived vans up to 2 tonnes\n|bgcolor=\"#ffffcc\"\n|bgcolor=\"#ffcccc\"\n|bgcolor=\"#ffcccc\"\n|-\n|colspan=2|Car with caravan or trailer\n|bgcolor=\"#ccffcc\"\n|bgcolor=\"#ffffcc\"\n|bgcolor=\"#ffffcc\"\n|-\n|colspan=2|Bus, Minibus or coach up to 12 metres long\n|bgcolor=\"#ccffcc\"\n|bgcolor=\"#ffffcc\"\n|bgcolor=\"#ffcccc\"\n|-\n|colspan=\"2\"|Bus, Minibus or coach 12 metres or longer\n|bgcolor=\"#ccffcc\"\n|bgcolor=\"#ffffcc\"\n|bgcolor=\"#ffffcc\"\n|-\n|colspan=2|Goods vehicle below 7.5 tonnes\n|bgcolor=\"#ccffcc\"\n|bgcolor=\"#ffffcc\"\n|bgcolor=\"#ffcccc\"\n|-\n|rowspan=3|Goods vehicle over 7.5 tonnes\n|England and Wales\n|bgcolor=\"#ccffcc\"\n|bgcolor=\"#ffffcc\"\n|bgcolor=\"#ffffcc\"\n|-\n|Scotland except A9 between Perth and Inverness\n|bgcolor=\"#ccccff\"\n|bgcolor=\"#ccffcc\"\n|bgcolor=\"#ffffcc\"\n|-\n|A9 between Perth and Inverness\n|bgcolor=\"#ccffcc\"\n|bgcolor=\"#ccffcc\"\n|N/A\n|N/A\n|}\nFor a road to be classed as a dual carriageway, the two directions of traffic flow must be physically separated by a central reservation.\nEnforcement of UK road speed limits increasingly uses speed guns, automated in-vehicle systems and automated roadside traffic cameras.\nTaxes and charges\nMotoring taxation\non the M6 Toll at Great Wyrley]]\nAfter the end of the Turnpike trusts, roads have been funded from taxation. Two new vehicle duties were introduced—the locomotive duty and the trade cart duty in the 1888 budget. Since 1910, the proceeds of road vehicle excise duties were dedicated to fund the building and maintenance of the road system. From 1920 to 1937, most roads in the United Kingdom were funded from the Road Fund using taxes raised from fuel duty and Vehicle Excise Duty. Since 1937, roads have been funded from general taxation with all motoring duties, including VAT, being paid directly to the Treasury.\nTolls and congestion charges\nTolls or congestion charges are used for some major bridges and tunnels, for example the Dartford Crossing has a congestion charge. The M6 Toll, originally the Birmingham Northern Relief Road, is designed to relieve the M6 through Birmingham, which is one of the most heavily used roads in the country. There were two public toll roads (Roydon Road in Stanstead Abbots and College Road in Dulwich) and about five private toll roads.\nSince 2006, congestion charging has been in operation in London and in Durham.\nBefore December 2018, the M4's Second Severn Crossing, officially 'The Prince of Wales Bridge', included tolls. After being closed for toll removal for three days, the bridge opened up again. Toll payment was scrapped and it marked history as it is believed to be the first time in 400 years that the crossing will be free.\nSince the abolition of tolls on the Forth and Tay Road Bridges in 2008, there are no longer any toll roads in Scotland.\nRoad traffic safety\nIn June 2008, the Road Safety Foundation reported that 30 per cent of the primary route network in Great Britain failed to rate as safe, and a quarter of all motorways were outside the safest risk band.\nIn 2006, the  Cat and Fiddle Road between Macclesfield and Buxton was named as Britain's most dangerous road. The single-carriageway road has been the scene of 43 fatal or serious collisions since 2001, nearly three-quarters of them involving motorcyclists. When collisions involving motorcyclists are removed from the analysis, the A61 between Barnsley and Wakefield was found to be the most dangerous road in Britain.\nBetween 2003 and 2006, the most improved safety record was for the A453 from the A38 to Tamworth in Staffordshire. This rural single carriageway saw an 88 per cent drop in the number of fatal or serious collisions in the last six years, taking it from a medium risk road to one of the safest. According to the Foundation, this has been achieved by introducing traffic lights, speed limit reductions and village pedestrian facilities.\nResearch undertaken in July 2008 has shown that investment in a safe road infrastructure programme could yield a one-third reduction in road deaths, saving as much as £6billion per year. A consortium of 13 major road safety stakeholders have formed the Campaign for Safe Road Design, which is calling on the UK Government to make safe road design a national transport priority.\nIn 2019, in England, 60% of travels are performed on 4 star road, 35 on 3 star, and 5% on 2 star. For motorways, the breakdown is 70% 4 star and 30% three star. For dual carriage way A roads, 32% 4 star, 65% 3 star and 5% 2 star. For single carriage way A roads, 4% 4 star, 36% 3 star, 58% 2 star and 2% one star.\nHistory\nIron Age\nThe earliest evidence of engineered roads dates back to the 1st century BC. A metalled and cambered road, 1.5 metres high and six metres wide, was unearthed at Bayston Hill quarry, near Shrewsbury. A timber road was preserved in peat in Geldeston, Norfolk, with tree rings suggesting a date of 75 BC, probably built by the Iceni tribe.\nRoman Britain\nRoads built in the first phase of Roman occupation (43&ndash;68AD) connected London with the ports used in the invasion (Chichester and Richborough), and with the earlier legionary bases at Colchester (Camulodunum), Lincoln (Lindum), Wroxeter (Viroconium), Gloucester and Exeter.\nAs Roman influence expanded, so did the network, until around 180AD when the known network was complete.\nFew Roman roads extended into Scotland due to their inability to subjugate the local population. Part of the Scottish Lowlands came under Roman control in 142AD, and the Antonine Wall was constructed on the northern boundary. The Roman legions withdrew in 164AD to their former northern boundary, Hadrian's Wall.\nThe primary function of Roman roads was to allow the rapid movement of troops and military supplies, and provided vital infrastructure for trade and the transport of goods. The roads were paved, a first for the island, and could carry heavy goods in all weathers. Following the Roman withdrawal from Britain, road maintenance became a very ad hoc activity.\nMedieval roads\nA network of roadways was developed in Britain in the Middle Ages to supplement the use of rivers as a system of transportation. Many of these roadways were developed as a result of trading of goods and services, such as wool, sheep, cattle and salt. They linked together market towns, towns with bridges, harbours and ports. Other roadways developed to meet the needs of pilgrims visiting shrines, such as Walsingham, and for transporting corpses from isolated communities to local graveyards.\nThe \"Four Highways\" of medieval England\nThe Icknield Way was one of four highways that appear in the literature of the 1130s. Henry of Huntingdon wrote that the Ermine Street, Fosse Way, Watling Street and Icknield Way had been constructed by royal authority.\nEarly modern era\nA parliamentary enclosure road near Lazonby in Cumbria. The roads were made as straight as possible, and the boundaries much wider than a cart width to reduce the ground damage of driving sheep and cattle.\nThe first legislated control in England was introduced under the Highways Act 1555. Road rates were introduced in England and Wales in the 17th century. The first turnpike road, whereby travellers paid tolls to be used for road upkeep, was authorised by the Highways Act 1663 for a section of the Great North Road in Hertfordshire. The first turnpike trust was established by the Parliament of England through a Turnpike Act in 1706. Scotland continued to maintain its own Parliament until the Acts of Union 1707, when the two parliaments merged to form the Kingdom of Great Britain.\nIn the second half of the 18th century, turnpike trusts became numerous, with trusts also set up in Wales and lowland Scotland. This expansion was facilitated by the ability to use mortgages to fund the work. By 1821 there were  of turnpike roads in England, with 1,000 trusts by 1845.\nAlso, in England, the process of land owners enclosing land had been happening since medieval times. During the 17th century a practice developed of obtaining authorisation by Act of Parliament. The statutory process included the appointment of enclosure commissioners.  Commissioners were given authorisation to replace old roads and country lanes with new roads that were wider and straighter than those they replaced. Straight roads of early origin, if not Roman were probably enclosure roads. They were established in the period between 1750 and 1850.\nThe high cost of tolls, on the turnpikes, caused social unrest in Wales. A protest against the tolls that became known as the Rebecca Riots took place, in Wales, between 1839 and 1843. The riots ceased after some ringleaders, John Jones (Shoni Sguborfawr) and David Davies (Dai'r Cantwr), were convicted and transported to Australia. Following several attempts at reform, detrunking began in the 1860s, with the last trust ending in 1885. The protests prompted several reforms, including a royal commission into the question of toll roads.\nThe growing popularity of cycling also prompted calls for road improvements, with the Cyclists' Touring Club and National Cyclists' Union pooling resources to form the Roads Improvement Association in October 1886. This focused on producing technical literature distributed to highways boards and surveyors to promote improved construction and maintenance methods. The Local Government Act 1888 created borough and county councils with responsibility for maintaining the major roads.\nIn 1870, after complaints about the first tram companies damaging the road surface, Parliament introduced the Tramways Act 1870 (33 & 34 Vict. c. 78), making tram companies responsible for the maintenance of the shared surface of the tramway and several feet either side, as a condition of being granted a licence. This was a popular move as maintenance was removed from the public purse. The local authority could also purchase the whole line at a later date at a discount, or force the tram company to reinstate the road.\n1900–1950\nThe Roads Act 1920 brought in the Road Fund, with the government receiving revenue from excise duty on road vehicles and from the sale of licences for horse-drawn carriages and driving licences. As road traffic began to grow, the condition of the road network became an issue, with most of it in a poor state of repair. The new Ministry of Transport created a classification system for the important routes connecting large population centres or for through traffic, with the definitive list being published in 1922/3 and revised in 1926/7.\nHigh unemployment after the end of World War I led the Minister of Transport to provide grant funding to the county councils to improve roads, particularly where labour was recruited from areas of high unemployment and adjoining areas, and men with dependants. Two unemployment relief programmes were run, the first from 1920 to 1925 and the second from 1929 to 1930. Government grants were limited to trunk roads and bridges, with the money coming from the Road Fund. Some  of bypasses were built by 1935, about half of what was originally planned at the start of the programmes. In 1930, responsibility for all roads was vested in the county councils. The first inter-urban new road built in the UK was the East Lancs Road, which was built between 1929 and 1934 at a cost of £8&nbsp;million.\nFor the first time since the Roman occupation, the Ministry of Transport took direct control of the core road network through the Trunk Roads Act 1936. During the 1930s, both the Institution of Highway Engineers and The County Surveyors' Society had published plans for a network of high-speed roads, whilst the Minister of Transport, Leslie Burgin, also visited the autobahn under construction in Germany. Lancashire County Council proposed a new scheme for a motorway and it was agreed to go ahead.  This was, however, postponed due to the start of World War II.\nDuring World War II, government plans were drawn up to create a new network of high-speed routes across the country. The passing of the Special Roads Act 1949 gave the government legal powers to build roads that were not automatically rights of way for certain types of user.\n1950–1979\nIn 1958, the first motorway was opened as the Preston Bypass, now part of the M6 motorway. The first major motorway to open was the M1 between Crick and Berrygrove.\nIn 1963, a report on urban transport planning policy, Traffic in Towns, was produced for the UK Department of Transport by a team headed by the architect, civil engineer and planner Colin Buchanan. While it advocated the construction and reorganisation of towns to accommodate the motor car and lorry, it stressed that this would have to be balanced with restrictions, in accordance with local needs. It highlighted the urgency of the problem of dealing with the expected massive growth in road traffic, the damage it could cause to our towns and cities if unplanned, the eventual need for demand management but with implications of restricting the mass of the population from doing something they didn't see as wrong, and of the inevitable need for a change in policy as the social costs increased.\nIn 1966, a revision of design standards was proposed which would, it was stated, save \"acres of land\" and £22,000 per mile in construction costs.   The revision involved reducing from  to  the width of roadside grass verges on newly constructed \"rural\" motorways, and removing  of the width of the \"marginal strips\" that separated each carriageway from the central reservation.\nThe 19681969 Ministry of Transport report Roads in England planned to complement the new interurban routes with £1billion of new urban trunk roads outside London in order to \"alleviate traffic congestion\", complemented by parking controls, traffic management and public transport.\nThe first  of motorway had been built by 1972, followed by more motorways opened into the 1980s.\nRoads outside urban areas continued to be built throughout the 1970s, but the urban routes soon ran into opposition. Plans by the Greater London Council for a series of ringways were cancelled following extensive protests headed by Homes before Roads and a rise in costs. Plans to widen the Archway Road in London were also hit by determined opposition over a 20-year period from the 1970s.\nWork on planning motorways in Northern Ireland had begun before the Second World War, but the legal authority for motorways was not provided for until the Special Roads Act (Northern Ireland) 1963, similar to that in the 1949 Act. The first motorway to open was the M1 motorway in 1962, though did so under temporary powers until the Special Roads Act had been passed. Work on the motorways continued until the 1970s, when the oil crisis and The Troubles both intervened, causing the abandonment of many schemes.\n1979–1997\nThe Conservative government of Margaret Thatcher from 1979 adopted a pro-roads policy. During this period, numerous road upgrades were built and the M25 motorway was completed. In 1989, it announced a large-scale roads programme (stated to be the largest since the Romans) in the Roads for Prosperity White Paper. It proposed 500 road schemes at a cost of £23 billion and predicted an increase of road traffic of 142% by 2025. It would have involved the doubling of the trunk road capacity with around 150 bypasses being built, caricatured in later years as predict and provide, whereby the government predicted the required capacity in forthcoming years and built roads to match. From 1985 to 1995, the road network expanded by .\ncutting at Twyford Down]]\nThis road building programme continued into the start of the premiership of John Major. In the early-1990s, the government decided to complete the M3 motorway by building a six-lane road in a cutting through Twyford Down. This attracted the first direct action protests against a major road in the country. Building work was delayed considerably, and anti-roads protesters gained large amounts of publicity. The Newbury bypass saw some of the largest protests against a road in the UK. Proposed originally in the 1980s, the bypass was subject to strong support and opposition. Also in this time frame, the M11 link road protest saw protracted disturbance during the upgrading of a section of the A12 through East London. Costs increased rapidly, the Newbury bypass being 50% over budget and many other schemes showed increases of 100%.\nThe Standing Advisory Committee on Trunk Road Assessment had also concluded in 1994 that building new roads simply generated more traffic, and was therefore largely self-defeating. By 1994, following the recession of the early 1990s, a significant number of remaining schemes were cancelled, although the government still intended to continue with others using private financing. The Secretary for state for transport, Dr Brian Mawhinney launched a \"Great Debate\" about the future direction for transport in the UK and the required level of road building stating that the road network was \"broadly complete\".\nIn October 1994, a major Royal Commission report, \"Transport and the Environment\", was published to highlight the serious environmental consequences of UK's transport system in response to which the New Scientist commented \"Rarely, if ever, can a ministry have emerged so badly from an official report as John MacGregor's old department\" in an article titled \"Head-on collision over transport: The British government has received its sternest warning yet that its unflagging support for the car is seriously at odds with its own green principles\".\nIn 1994, the last new motorway in the United Kingdom opened, the M3 motorway in Northern Ireland. In 1996, the total length of motorways reached .\n1997–present day\nAfter the election of the Labour government in 1997, most remaining road schemes were cancelled and problem areas of the road network subject to multi-modal studies to investigate non-road alternatives, following the introduction of the A New Deal for Trunk Roads in England White Paper.\nIn 1998, it was proposed to transfer parts of the English trunk road network to local councils, retaining central control for the network connecting major population centres, ports, airports, key cross-border links and the Trans-European Road Network. Around 40% of the network was transferred to local authorities.\nIn 2002, the government proposed a new major road building program with  of the strategic road network to be widened, 80 major new trunk road schemes to improve safety and 100 new bypasses on trunk and local roads. The protesters reformed.\nIn 2004, the Government announced in the Queen's speech a major new funding source from transport schemes, the Transport Innovation Fund (TIF).\nIn 2007, a new Planning Bill was introduced to parliament which would speed up the process of approving new roads and other transport infrastructure but which has raised concerns that it may erode democracy\nand be a \"developer's charter\".\nTraffic increased by 80% between 1980 and 2005, while road capacity increased by 10%.\nScotland's trunk roads are organised as a single trunk road network overseen by Transport Scotland. In 2011, Transport Scotland proposed a plan to dual the A9 between Perth and Inverness with construction to start in September 2015, and to finish in 2035. Another plan is underway to do the same to the A96 between Aberdeen and Inverness.\nIn June 2018, a change in the law meant that learner drivers, who had previously been banned from driving on motorways, were allowed to use them when accompanied by a driving instructor in a car with dual controls. As motorway driving is not offered as part of the practical driving test in the United Kingdom, these measures were put in place in an effort to teach motorway safety.\nIn the 2020s, there was a policy shift away from \"predict and provide\" to \"decide and provide\" in which transport planning aims to achieve a desired level of road use, rather than unconstrained growth as before, also aiming to secure Net Zero. This concept was developed by the TRICS Consortium; Oxfordshire County Council was the first local authority to adopt it formally as Council policy.\nNaming\nRoad names have traditional conventions in the UK.\nSee also\n*Transport in the United Kingdom\n*List of motorways in the United Kingdom\n*Roads in Northern Ireland\nReferences\nFurther reading\n* Benson, Bruce L. The Rise and Fall of Non-Government Roads in the United Kingdom in STREET Competition, Entrepreneurship, and the Future of Roads SMART  (Routledge, 2017). [https://www.taylorfrancis.com/chapters/edit/10.4324/9781315130330-14/rise-fall-non-government-roads-united-kingdom-bruce-benson abstract]\n* Bishop, M. C. The Secret History of the Roman Roads of Britain: And their Impact on Military History (Pen and Sword, 2014). [https://books.google.com/books?id=wOuwBAAAQBAJ&dq=HISTORY+ROADS+England+Britain+UK++&pg=PP1 online]\n* Bogart, Dan. \"The turnpike roads of England and Wales.\" in The online historical atlas of transport, urbanization and economic development in England and Wales (2017) pp:1680-1911. [http://www.campop.geog.cam.ac.uk/research/projects/transport/onlineatlas/britishturnpiketrusts.pdf online]\n*  Charlesworth, George. A History of British Motorways (Thomas Telford, 1984).\n* Fuller, G. Joan. \"The Development of Roads in the Surrey. Sussex Weald and Coastlands between 1700 and 1900.\" Transactions and Papers (Institute of British Geographers) 19 (1953): 37-49. [https://www.jstor.org/stable/621226 online]\n* Ishaque, Muhammad M., and Robert B. Noland. \"Making roads safe for pedestrians or keeping them out of the way? An historical perspective on pedestrian policies in Britain.\" Journal of Transport History 27.1 (2006): 115-137. [https://www.camcycle.org.uk/images/blog/Ishaque_2006_Making_roads_safer_for_pedestrians_or_getting_them_out_of_the_way.pdf online]\n* Mackie, Peter, and Nigel Smith. \"Financing roads in great Britain.\" Research in Transportation Economics 15 (2005): 215-229. [http://ndl.ethernet.edu.et/bitstream/123456789/1676/1/4.pdf.pdf#page=232 online]\n* Moran, Joe. On roads: a hidden history (Profile Books, 2010). [https://books.google.com/books?id=bGIgduj1cUEC&dq=HISTORY+ROADS+England+Britain+UK++&pg=PA1 online]\n* Moran, Joe. \"Crossing the road in Britain, 1931–1976.\" The Historical Journal 49.2 (2006): 477-496. [https://www.academia.edu/download/56761455/crossing_the_road.pdf online]\n* Rolt, L.T. C. Thomas Telford (1958) [https://archive.org/details/dli.ernet.527142/page/n5/mode/1up online]\n* Rosevear, Alan, Dan Bogart, and Leigh Shaw-Taylor. \"Government, trusts, and the making of better roads in early nineteenth century England and Wales.\" European Review of Economic History (2023)  https://doi.org/10.1093/ereh/head030\n* Smiles, Samuel. The Life of Thomas Telford, Civil Engineer: With an Introductory History of Roads and Travelling in Great Britain (J. Murray, 1867) [https://books.google.com/books?id=bgg0klBixUUC&dq=HISTORY+ROADS+England+Britain+UK++&pg=PR23 online].\n* West, Graham. The Technical development of roads in Britain (Routledge, 2019).\nExternal links\n*[https://www.gov.uk/government/uploads/system/uploads/attachment_data/file/524170/s150003_Network_Management_interim_update.pdf Highways England network map]\n*[http://www.transport.gov.scot/road/maintenance/key-facts-about-trunk-road-network-scotland#map Map of Scottish Trunk Roads]\n*[https://archive.today/20130616152118/http://transportreview.co.uk/road/road-traffic-map Interactive Map of Average Daily Traffic for every major UK Road] (2013)"
    }
  ]
}