{
  "content": [
    {
      "type": "text",
      "text": "# Robert E. Kingston\n\n-->\n| birth_place       =\n| death_date        =\n| death_place       =\n| death_cause       =\n| resting_place     =\n| resting_place_coordinates =\n| other_names       =\n| siglum            =\n| pronounce         =\n| citizenship       =\n| nationality       =\n| fields            =\n| workplaces        = Massachusetts General Hospital\n| patrons           =\n| education         =\n| alma_mater        =  Harvard College, University of California, Berkeley\n| thesis_title      =\n| thesis_url        =\n| thesis_year       =\n| doctoral_advisor  = Michael Chamberlin\n| academic_advisors = Phillip Sharp\n| doctoral_students =\n| notable_students  = Geeta Narlikar\n| known_for         = Nucleosome biology\n| influences        =\n| influenced        =\n| awards            =\n| author_abbrev_bot =\n| author_abbrev_zoo =\n| spouse            =\n| partner           =\n| children          =\n| parents           =\n| father            =\n| mother            =\n| relatives         =\n| signature         =\n| signature_type    =\n| signature_alt     =\n| website           =\n| footnotes         =\n}}\nRobert E. Kingston (born in 1954) is an American biochemist and geneticist who studies the functional and regulatory role nucleosomes play in gene expression, specifically during early development. After receiving his PhD in 1981 and completing post-doctoral research, Kingston became an assistant professor at Massachusetts General Hospital in 1985, where he started a research laboratory focused on understanding chromatin structure with regards to transcriptional regulation.\nKingston was head of Harvard College's Biological and Biomedical Sciences PhD program from 2004 to 2007, chair of the molecular biology department at Massachusetts General Hospital from 2005 to 2023, vice-chair of the department of genetics at Harvard Medical School, and the chair of the executive committee on research at Massachusetts General Hospital from 2012 to 2015.  In November 2022, he was appointed as the inaugural Chief Academic Officer and Senior Vice President for Research and Education for Massachusetts General Hospital effective January 2023. In addition to being a professor of genetics at Harvard Medical School, Kingston frequently organizes conferences and performs editorials on his research interests. In 2016, he was elected by his peers to be a member of the National Academy of Sciences.\nEducation\nKingston graduated from Harvard College in 1976. Four years later, he completed his PhD on bacterial regulatory mechanisms at the University of California, Berkeley, under the mentorship of Michael Chamberlin. He then performed postdoctoral research on mammalian post-transcriptional mechanisms at the Massachusetts Institute of Technology under the supervision of Philip Sharp.\nResearch\nKingston's research continues to have a significant impact on developmental biology and epigenetics, as it focuses on an important feature of eukaryotic gene expression: chromatin remodeling. His research can be applied to the field of gene therapy, specifically principles surrounding chromatin regulation.\nnusA protein\nIn 1981, Kingston received his PhD after working on a number of research initiatives surrounding genome regulation and expression. Through an in vitro study that mapped termination sites dependent on the nusA protein, he discovered that in vivo rRNA transcription is regulated by turnstile attenuation, a mechanism that terminates rrnB chains in the leader region. He found that this happens because of the specific presence and location of pause sites, located 90 and 91 bases from the P1 promoter, which are sensitive to the presence of nusA protein and the concentration of the regulatory nucleotide guanosine tetraphosphate.\nHeat shock protein 70 (HSP70)\nAfter recognizing that the myc gene was involved with tumor formation, Kingston drew a parallel between the presence of the myc gene and the increased genomic expression of HSP70. He also found that expression of HSP70 is dependent on physiological stresses. Analyzing the gene sequences showed that heat shock, cadmium induction, and metallothionein II responsiveness are needed for HSP70 gene expression during the primary level of transcription. He observed that while the physiological factors have a role on one domain (distal) of the HSP70 promoter, the other domain (proximal) is more responsive to serum stimulation. After conducting in vitro transcription experiments, Kingston found that there is a heat-shock transcription factor (HSTF) that allows the interactions with the heat shock element (HSE), and that the HSP70 gene promoter also depends on a CCAAT-box-binding transcription factor (CTF) for CCAAT-box-dependent transcription. In vitro cell-free systems that have heat-induced activation of human heat-shock factor (HSF) were used to determine that at 43&nbsp;°C, HSF undergoes post-translational modification which then allows it to bind to a specific DNA sequence, HSE.\nSWI/SNF subunits of chromatin remodeling\nKingston's primary research interests surround chromatin remodeling, and his breakthroughs within the field began when he discovered the functional subunit responsibilities of SWI/SNF, a chromatin remodeling complex that causes specific transcription factors to bind to nucleosomal DNA. He discovered that two SWI/SNF subunits, BRG1 and BAF155, along with EKLF zinc-finger DNA-binding domains (DBDs) can be used to remodel chromatin, meaning that these specific domains of SWI/SNF have an effect on transcription factor-directed nucleosome remodeling. He was also able to conclude that different domains of transcription factors target SWI/SNF complexes to chromatin in a gene-selective way. His work on nucleosomal DNA extends to his findings on TATA-binding protein (TPB), specifically how dynamic remodeling of chromatin can allow TPB to bind to the TATA sequence. His work on SWI/SNF led him to conclude that these two subunits are responsible for an “activation” function related to transcription. This is because a purified human SWI/SNF complex mediated the ATP-dependent disruption of a nucleosomal barrier, resulting in SWI/SNF activators (GAL4-VP16 and GAL 4-AH) binding onto the nucleosome core. Since the TATA sequence is inside a nucleosome, adding ATP will cause human SWI/SNF to recognize its chromatin structure and alter the nucleosomal DNA sequence so that the TPB can be accessed and bind to it. From a broader perspective, this allows for more eukaryotic gene expression, since a variety of eukaryotic promoters will be regulated.\nAdvancements in biotechnology\nBecause Polycomb repressive complex 1 (PRC1) contains a number of proteins that work together to repress SWI/SNF complex chromatin remodeling, Kingston refined a method to reconstitute a stable complex of proteins that together form a “chromatin structure” that excludes human SWI/SNF. Kingston found that in order to form the complex that silences chromatin remodeling, it must be stable and compact. Through electron microscopy, he found that the components of PRC1 induce compaction of nucleosomal arrays. The compaction of chromatin occurs within the presence of three nucleosomes and a region of Posterior Sex Combs together. His work with Polycomb proteins also helped develop a RIP-sequence method to capture the Polycomb repressive complex 2 (PRC2) transcriptome in embryonic stem cells. Noting that Polycomb proteins factor into stem cell renewal and the formation of diseases, Kingston's discovery of direct interactions (Ezh2 subunit) and PRC2 cofactors (Gtl2 RNA) contributed to identifying the function of Polycomb proteins within the genome. Kingston's interest in chromatin remodeling has also shown through his research regarding purifying the proteins associated with chromatin remodeling. He established a protocol, Proteomics of Isolated Chromatin Segments (PICh), in which a specific nucleic acid probe is used to isolate genomic DNA with regards to the quantity and purity of associated proteins. The PICh protocol was then used on telomeric chromatin to identify telomeric factors and resulted in finding a number of novel associations. Kingston's advancements within the field of biotechnology extend into developing eukaryotic cell transfection protocols, for he also developed two methods of calcium phosphate transfection for transient and stable transfections. These two methods use a precipitate to introduce plasmid DNA into monolayer cell cultures. The difference between them is that one uses a HEPES-buffered solution while the other uses a BES-buffered system, but both form a precipitate over the cells and allow for similar levels of transient expression.\nMacromolecular interaction in chromatin remodeling\nKingston's research surrounding chromatin remodeling dwells on understanding how long non-coding RNAs (lncRNAs) play a role in determining chromatin binding sites. He was able to genome map NEAT1 and MALAT (both lncRNAs) and found that they localize overactive genes. His research also suggests that NEAT1 and MALAT interact with complementary proteins. He found that underlying DNA sequences are not responsible for targeting NEAT1 to chromatin, but it is rather transcriptional sequences that allow it to bind to chromatin sites. Kingston also discovered that DIGIT interacts with the Bromodomain-containing protein 3 (BRD3) to regulate endoderm differentiation transcriptionally.\nKingston found another breakthrough: that a protein-protein interaction affects chromatin remodeling in the lymphoid system. He discovered that the Ikaros-NuRD complex is able to target chromatin remodeling and histone deacetylation complexes in vivo. This allowed him to conclude that chromatin remodeling affects lymphocyte differentiation.\nAdvances in structural and functional biochemistry\nOne of the biggest discoveries that Robert Kingston has made is that the nucleosome structure can be arranged into different conformations so that different biophysical properties can result, including mechanisms of transcription. Specifically, multiprotein complexes that were used for transcriptional regulation were found to variably acetylate or deacetylate nucleosomes, or alter nucleosome structure when ATP is present. These alterations would essentially be a major way to regulate eukaryotic gene expression. Kingston furthered this and discovered the novel nucleosome remodelling and deacetylating (NuRD) complex. Through in vitro studies with CHD3 and CHD4 proteins with ATPase domains found in chromatin remodelling factors, Kingston established that there is a functional and physical link between nucleosome remodeling proteins and histone deacetylases’ chromatin-modifying features.\nSelected review publications\n* [https://link.springer.com/article/10.1007/s12038-019-9972-5 The CBX family of proteins in transcriptional repression and memory]\n* [https://www.sciencedirect.com/science/article/pii/S0092867402006542 Cooperation between complexes that regulate chromatin structure and transcription]\n* [https://www.nature.com/articles/nrm2763 Mechanisms of polycomb gene silencing: knowns and unknowns]\n* [https://www.sciencedirect.com/science/article/pii/S109727651300141X Occupying chromatin: Polycomb mechanisms for getting to genomic targets, stopping transcriptional traffic, and staying put]\n* [http://genesdev.cshlp.org/content/13/18/2339.short ATP-dependent remodeling and acetylation as regulators of chromatin fluidity]\n* [https://www.science.org/doi/abs/10.1126/science.1130164 Characterization of the piRNA complex from rat testes]\n* [https://www.nature.com/articles/nature13415 Comparative analysis of metazoan chromatin organization]\nReferences"
    }
  ]
}