{
  "content": [
    {
      "type": "text",
      "text": "# Robert Pakington\n\n| children     = Sir Thomas Pakington\n| birth_place  = Stanford-on-Teme\n| death_date   = 13 November\n| death_place  = London\n| burial_place =\n}}\nRobert Pakington (c. 1489 – 13 November 1536) was a London merchant and Member of Parliament. He was murdered with a handgun in London in 1536, likely the first such killing in the city. His murder was later interpreted as martyrdom, and recounted in John Foxe's Acts and Monuments. He was the grandfather of Queen Elizabeth I's favourite, Sir John \"Lusty\" Pakington.\nFamily\nRobert Pakington, born about 1489 at Stanford-on-Teme, Worcestershire, was a younger son of John Pakington and Elizabeth Washborne, the daughter of Thomas Washborne. He had three brothers, John, Augustine, and Humphrey.\nLife\nBy 1510 Pakington had completed an apprenticeship with the Mercers' Company, one of the twelve great livery companies of London, and was exporting cloth and importing various wares. In 1523, and again in 1529, he and others were chosen to draw up articles on behalf of the Mercers for presentation to Parliament. According to Peter Marshall, one of the articles drawn up in 1529 was \"sharply anti-clerical\". In 1527-8 Pakington was elected Warden of the .\nHe was elected to Parliament in a by-election in October 1533, and was re-elected in 1536. The chronicler Edward Hall records that in Parliament Pakington again revealed anti-clerical sentiments, \"speaking somewhat against the covetousness and cruelty of the clergy\".\nIn the final years of his life, Pakington reported to Thomas Cromwell on matters in Flanders at the behest of Cromwell's man of business, Stephen Vaughan, who held strongly Protestant sympathies.\nOn the morning of 13 November 1536, while crossing the street from his home in Cheapside to attend Mercers' Chapel located opposite, Pakington was shot with a gun and killed:\nHis murder was likely the first committed with a handgun in London. His murderer was never found, despite the \"gret rewarde\" which was offered for information.\nPakington's murder was interpreted by Protestant reformers as martyrdom, and became a source of religious controversy. In 1545 the Protestant reformer John Bale suggested that \"conservative bishops\" were behind the murder. A similar suggestion was made in 1548 by Hall, who also attributed Pakington's death to the Catholic clergy. John Foxe, too, held the clergy responsible, but in the process of doing so proposed contradictory theories of the crime. In 1559 Foxe claimed that John Stokesley, a former Bishop of London \"had paid a priest sixty gold coins to carry out the murder\". However, in the 1563 edition of the Actes and Monuments Foxe stated that John Incent, a former Dean of St Paul's, had made a deathbed confession in which he admitted arranging for Pakington's murder. The Catholic apologist Nicholas Harpsfield accused Foxe of slandering Incent, and in the 1570 edition of the Actes and Monuments Foxe produced yet another theory, claiming that Pakington's murderer was an Italian. In their accounts of Pakington's death the chroniclers John Stow, Richard Grafton and Raphael Holinshed did not repeat Foxe's allegations, and Holinshed put forward an entirely different version of events, claiming that a felon hanged at Banbury had confessed on the gallows to Pakington's murder.\nBy the time of his death, Pakington was a \"man of substance\". He had been assessed at 500 marks in the 1534 subsidy, and in 1535 had exported some 250 cloths to Antwerp. The cash bequests in his will amounted to over £300. According to Marshall, the wording of the will, which Pakington drew up on 23 November 1535, provides additional evidence of his sympathy for the Protestant Reformation. Moreover, the sermon at his funeral on 16 November was preached by the \"Lutheran activist\", Robert Barnes.\nPakington was buried in St Pancras Church in Soper Lane, which was destroyed in the Great Fire of London in 1666 and not rebuilt. Stow states that a monument was erected there to his memory. According to the custom of the City of London his children became orphans in the care of the city; on 20 November 1537 the court of aldermen entrusted Pakington's son and heir, Thomas Pakington, to the custody of his grandfather, Sir John Baldwin.\nMarriages and issue\nPakington married firstly Agnes Baldwin, the daughter of Sir John Baldwin, Chief Justice of the Common Pleas, by whom he had two sons and three daughters:\n* Sir Thomas Pakington (d. 2 June 1571), who married Dorothy, the daughter of Sir Thomas Kitson by his second wife, Margaret (d. 12 January 1561), the only child of John Donnington (d.1544) of Stoke Newington. Their eldest son, Sir John Pakington, was for a time a favourite of Queen Elizabeth I, who invited him to court after he had been presented to her during her visit to Worcester in 1572.\n* John Pakington, of whom nothing further is known.\n* Elizabeth Pakington, who married firstly John Lane (died 12 September 1557) of Walgrave, Northamptonshire, and secondly Sir Richard Malory, Alderman of London and Lord Mayor in 1564.\n* Anne Pakington, who married Richard Cupper, esquire, of Glympton, Oxfordshire.\n* Margaret Pakington, who married firstly Benedict Lee (d.1559), esquire of Burston, Buckinghamshire, half-brother of Sir Anthony Lee, and a henchman to King Henry VIII, and secondly Thomas Scott, esquire, of Yorkshire.\nBetween 1533 and November 1535, Pakington married secondly Katherine Dallam (d.1563), the daughter of Thomas Dallam, a member of the Worshipful Company of Skinners and the  Warden in 1497. At the time of the marriage, Katherine was the widow of her first husband, Richard Collier (d.1533), by whom she had a son and daughter, George and Dorothy.\nOn 21 August 1539, Katherine Pakington took as her third husband Sir Michael Dormer (d. 20 September 1545), the son of Geoffrey Dormer (d. 9 March 1503) of West Wycombe, Buckinghamshire, by his second wife, Alice Collingridge. Dormer was a wealthy Mercer, and Lord Mayor of London in 1541. Katherine's two children by her marriage to Richard Collier died about the time of her marriage to Dormer.\nSee also\n*List of unsolved murders (before 1900)\nNotes\nReferences\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\nFurther reading\n*\n*\n*\n*\n* [http://discovery.nationalarchives.gov.uk/SearchUI/Details?uri=D978833 Will of Sir John Baldwin, Chief Justice of the Common Pleas, of Aylesbury, Buckinghamshire, proved 27 October 1545, National Archives] Retrieved 29 April 2013\n* [http://discovery.nationalarchives.gov.uk/SearchUI/Details?uri=D977686 Will of Robert Pakington, Mercer of London, proved 24 April 1537, National Archives] Retrieved 29 April 2013\n* [http://discovery.nationalarchives.gov.uk/SearchUI/Details?uri=D978816 Will of Sir Michael Dormer, Alderman and Mercer of London, proved 2 October 1545, National Archives] Retrieved 7 May 2013\n* [http://discovery.nationalarchives.gov.uk/SearchUI/Details?uri=D955503 Will of Dame Katherine Dormer, widow, of London, proved 26 January 1563, National Archives] Retrieved 7 May 2013\n* [http://discovery.nationalarchives.gov.uk/SearchUI/Details?uri=D949325 Will of Richard Collier, Mercer, of Saint Pancras, London, proved 12 March 1533, National Archives] Retrieved 7 May 2013\n* [http://www.historyofparliamentonline.org/volume/1509-1558/member/cupper-%28couper%29-richard-1519-8384 Cupper (Couper), Richard (by 1519-83/84), of London, Powick and Worcester, History of Parliament] Retrieved 12 May 2013\n* [http://discovery.nationalarchives.gov.uk/SearchUI/Details?uri=D921192 Will of Richard Cupper of Powick, Worcestershire, proved 15 October 1584, PROB 11/67/341, National Archives] Retrieved 12 May 2013"
    }
  ]
}