{
  "content": [
    {
      "type": "text",
      "text": "# Robert F. Kennedy 1968 presidential campaign\n\n| affiliation  = Democratic Party\n| status       = Announced: March 16, 1968Suspension due to assassination: June 6, 1968\n| formed       =\n| announced    =\n| launched     =\n| suspended    =\n| headquarters =\n| key_people   = Joseph Gargan, chairman\n| receipts     =\n| fec_date     = 2008-01-31\n| slogan       =\n| themesong    =\n| chant        =\n| website      =\n}}\nThe Robert F. Kennedy presidential campaign began on March 16, 1968, when Kennedy, a United States Senator from New York, mounted an unlikely challenge to incumbent Democratic United States President Lyndon B. Johnson. Following a near-upset in the New Hampshire primary, Johnson announced on March 31 that he would not seek re-election to a second full term. Kennedy still faced two rival candidates for the Democratic Party's presidential nomination: the leading challenger United States Senator Eugene McCarthy and Vice President Hubert Humphrey. Humphrey had entered the race after Johnson's withdrawal, but Kennedy and McCarthy remained the main challengers to the policies of the Johnson administration. During the spring of 1968, Kennedy led a leading campaign in presidential primary elections throughout the United States. Kennedy's campaign was especially active in Indiana, Nebraska, Oregon, South Dakota, California, and Washington, D.C. After declaring victory in the California primary on June 4, 1968, Kennedy was assassinated at the Ambassador Hotel in Los Angeles.  He died on June 6, 1968 at Good Samaritan Hospital. Had Kennedy been elected president, he would have been the first brother of a former U.S. president (John F. Kennedy) to win the presidency himself.\nBackground\nWhen President John F. Kennedy was assassinated on November 22, 1963; Vice President Lyndon B. Johnson succeeded him with tremendous national popularity amid a wave of mourning and sympathy. Robert F. Kennedy remained in the cabinet (as United States attorney general) for several months amid what Johnson staffers began to refer to as \"the Bobby problem\": despite the personal hatred between the two, Democratic voters overwhelmingly favored Kennedy as Johnson's running mate in the 1964 election. Kennedy began to  plan for a nationwide campaign, and in the informal New Hampshire vice-presidential primary, Kennedy defeated Hubert H. Humphrey in a landslide. In July 1964, Johnson issued an official statement ruling out any cabinet member for the vice presidency. In search of a way out of the dilemma, Kennedy asked speechwriter Milton Gwirtzman to write a memo comparing two offices: 1) governor of Massachusetts and 2) U.S. senator from New York, and \"which would be a better place from which to make a run for the presidency in future years?\" The Massachusetts governorship offered one important advantage: isolation from President Johnson. However, the state was hobbled by debt and an unruly legislature. Gwirtzman informed Kennedy that \"you are going to receive invitations to attend dedications and speak around the country and abroad and to undertake other activities in connection with President Kennedy\"...and that \"it would seem easier to do this as a U.S. senator based in Washington, D.C. than as a governor based in Boston.\"\nIn August, Kennedy made up his mind to run for the United States Senate from New York; defeating Republican incumbent Kenneth Keating who attempted to portray Kennedy as a \"carpetbagger\" from Massachusetts. His opponents accused Kennedy of merely using the state as a convenient launching‐pad for the presidency. In an interview with PBS, political journalist Midge Decter stated that \"nobody, for one minute, expected that he was going into the Senate to stay there. It was understood that it was the next move on the way to reclaiming what was rightfully the Kennedys, namely, the White House.\"\nAnnouncement\nKennedy was a late entry in making a campaign announcement for the primary race in the Democratic Party's presidential nomination in 1968. His political advisors had been pressuring him to make a decision, fearing Kennedy was running out of time to announce his candidacy. Although Kennedy and his advisors knew it would not be easy to beat the incumbent president, Lyndon B. Johnson, Kennedy had not ruled out entering the race. His younger brother Ted Kennedy was the leading voice against a bid for the presidency. He felt that his brother ought to wait until 1972, after Johnson’s tenure was finished. If RFK ran in 1968 and lost in the primaries to a sitting president, Ted felt that it would destroy his brother's chances later. U.S. Senator Eugene McCarthy of Minnesota had announced his intention to run against Johnson for the Democratic nomination on November 30, 1967. Following McCarthy's announcement, Kennedy remarked to U.S. Senator George McGovern of South Dakota that he was, \"worried about [McGovern] and other people making early commitments to [McCarthy].\" At a breakfast with reporters at the National Press Club on January 30, 1968, Kennedy once again indicated that he had no plans to run, but a few weeks later he had changed his mind about entering the race.\nIn early February 1968, after the Tet Offensive in Vietnam, Kennedy received an anguished letter from writer Pete Hamill, noting that poor people in the Watts area of Los Angeles had hung pictures of Kennedy's brother, President John F. Kennedy, in their homes. Hamill's letter reminded Robert Kennedy that he had an \"obligation of staying true to whatever it was that put those pictures on those walls.\" There were other factors that influenced Kennedy's decision to enter the presidential primary race. On February 29, 1968, the Kerner Commission issued a report on the racial unrest that had affected American cities during the previous summer. The Kerner Commission blamed \"white racism\" for the violence, but its findings were largely dismissed by the Johnson administration. Concerned about President Johnson's policies and actions, Kennedy asked his advisor, historian Arthur Schlesinger Jr.: \"How can we possibly survive five more years of Lyndon Johnson?\" Disagreement amongst Kennedy's friends, political advisors, and family members further complicated his decision to launch a primary challenge against the incumbent Johnson. Kennedy's wife Ethel supported the idea, but his brother Ted had been opposed to the candidacy. Ted did lend his support once Kennedy entered the race.\nBy late February or early March 1968, Kennedy had finally made the decision to enter the race for president. On March 10, Kennedy traveled to Delano, California, to meet with civil rights activist César Chávez, at the end of a 25-day hunger strike. En route to California, Kennedy told his aide, Peter Edelman, that he had decided to run and had to \"figure out how to get McCarthy out of it.\" The weekend before the New Hampshire primary, Kennedy told several aides that he would run if he could persuade McCarthy to withdraw from the presidential race. Kennedy agreed to McCarthy's request to delay an announcement of his intentions until after the New Hampshire primary. On March 12, when Johnson won an astonishingly narrow victory in the New Hampshire primary against McCarthy, who polled 42 percent of the vote, Kennedy knew it would be unlikely that the Minnesota senator would agree to withdraw. He moved forward with his plans to announce his candidacy.\nOn March 16, Kennedy declared, \"I am today announcing my candidacy for the presidency of the United States. I do not run for the presidency merely to oppose any man, but to propose new policies. I run because I am convinced that this country is on a perilous course and because I have such strong feelings about what must be done, and I feel that I'm obliged to do all I can.\" Kennedy made this announcement from the same spot in the Caucus Room of the Russell Senate Office Building where John F. Kennedy had announced his presidential candidacy in January 1960. McCarthy supporters angrily denounced Kennedy as an opportunist. With Kennedy joining the race, liberal Democrats thought that votes among supporters of the anti-war movement would now be split between McCarthy and Kennedy.\nOn March 17, Kennedy made his first campaign appearances by marching in the St. Patrick's Day Parades in Boston and New York City. The following day, he delivered his first campaign speech at Kansas State University, where he had previously agreed to give a lecture honoring former Kansas governor and Republican Alfred Landon. At Kansas State, Kennedy drew a \"record-setting crowd of 14,500 students\" for his Landon Lecture. In his speech, Kennedy apologized for early mistakes and attacked President Johnson's Vietnam policy saying, \"I was involved in many of the early decisions on Vietnam, decisions which helped set us on our present path.\" He further acknowledged that \"past error is not excuse for its own perpetration.\" Later that day at the University of Kansas, Kennedy spoke to an audience of 19,000—one of the largest in the university's history. During that speech he said, \"I don't think that we have to shoot each other, to beat each other, to curse each other and criticize each other, I think that we can do better in this country. And that is why I run for President of the United States.\" From Kansas, Kennedy went on to campaign in the Democratic primaries in Indiana, Washington, D.C., Nebraska, Oregon, South Dakota, and California.\nOn March 31, President Johnson stunned the nation by dropping out of the presidential race. He withdrew from the election during a televised speech, where he also announced a partial halt to the bombing of Vietnam and proposed peace negotiations with the North Vietnamese. Vice President Hubert Humphrey, long a champion of labor unions and civil rights, entered the race on April 27. Although he was a write-in candidate in some of the contests, Humphrey had announced his candidacy too late to be a formal candidate in most of the primaries. Despite late entry into the primary race, Humphrey had the support of the president and many Democratic insiders, which gave him a better chance at gaining convention delegates in the non-primary states. In contrast, Kennedy, like his brother before him, had planned to win the nomination through popular support in the primaries. Because Democratic party leaders would influence delegate selection and convention votes, Kennedy's strategy was to influence the decision-makers with crucial wins in the primary elections. This strategy had worked for John F. Kennedy in 1960, when he defeated Humphrey in the Wisconsin and West Virginia primaries.\nPolicy positions\nKennedy ran on a platform of racial equality, economic justice, non-aggression in foreign policy, decentralization of power, and social improvement. A crucial element of his campaign was youth engagement. \"You are the people,\" Kennedy said, \"who have the least ties to the present and the greatest stake in the future.\"\nAccording to Schlesinger, Kennedy's presidential campaign generated \"wild enthusiasm\" as well as deep anger. He visited numerous small towns and made himself available to the masses by participating in long motorcades and street-corner stump speeches, often in inner cities. Kennedy's candidacy faced opposition from Southern Democrats, leaders of organized labor, and the business community, where he was viewed as a fiscal liability.  At one of his university speeches (Indiana University Medical School), he was asked, \"Where are we going to get the money to pay for all these new programs you're proposing?\" He replied to the medical students, about to enter lucrative careers, \"From you.\"\nVietnam War\nKennedy did not support an immediate withdrawal of U.S. military personnel from Vietnam or an immediate end to the war. He sought to end the conflict by strengthening the South Vietnamese military and reducing corruption within the South Vietnamese government. He supported a peace settlement between North and South Vietnam.\nJob opportunities and welfare reform\nKennedy argued that increased government cooperation with private enterprise would reduce housing and employment woes in the United States.  He also argued that the focus of welfare spending should be shifted more towards improving credit and income for farmers.\nLaw and order\nIn 1968, Kennedy expressed his strong willingness to support a bill that was under consideration for the abolition of the death penalty.  He argued that rising crime rates could be countered with more job and educational opportunities.  However, Kennedy was also known for his focus on law and order, stating “I was the chief law-enforcement officer of the United States. I promise if elected, I will do all in my power to bring an end to this violence,” while Richard Nixon remarked \"Do you know a lot of these people think Bobby is more a law-and-order man than I am!\"\nGun control\nKennedy supported laws that would reduce casual firearm purchases. He said he believed in keeping firearms away from \"people who have no business\" with them—specifying criminals, individuals with mental health issues, and minors as classes of persons who should be prevented from purchasing firearms.\nTax reform\nKennedy argued for legislation, which would reform flagrant tax loopholes.\nCampaign\nOpinion polling\nA Gallup poll conducted in the fall of 1965 showed 72% of respondents believed RFK wanted to become the president, and 40% of independents and 56% of Democrats stated their support for a possible bid.\nHarris and Gallup polls released in August 1966 showed RFK being favored over President Johnson for the nomination by 2% among Democrats and 14% by independents.\nA late March Gallup poll released shortly before RFK's entry into the primary showed him leading President Johnson by three points at 44% to 41%. A poll released in the early part of April featured Kennedy with a 26-point lead over McCarthy in the Indiana primary, at 46% to 19%. Another April poll in Indiana, the Oliver Quayle survey, showed Kennedy with a three-to-one lead over McCarthy and the state's governor Roger D. Branigin; Schmitt noted the poll featured a large portion of respondents refuting the label that RFK was not trustworthy along with being \"too tough and ruthless.\" An April 28 Gallup poll showed Kennedy at 28% support by Democratic voters, Humphrey behind by three points and McCarthy ahead by five. A May 26 Associated Press (AP) poll showed RFK behind Humphrey among Pennsylvania national convention delegates, 1 to 27. A June 2 Gallup poll showed Kennedy at 19% support among Democratic county chairmen, Humphrey at 67% and McCarthy at 6%. A June 3 poll showed Kennedy leading McCarthy by nine points in the California primary, at 39% to 30%.\nPrimaries\nApril: Wisconsin, Pennsylvania, and Massachusetts\nAfter President Johnson's withdrawal, the Wisconsin primary on April 2 was effectively uncontested. Senator Eugene McCarthy won 56–35%; Kennedy received 6 percent as a write-in candidate. Kennedy was ineligible for the ballot because he entered the race following the filing deadline. McCarthy easily won the uncontested Pennsylvania primary on April 23 and the Massachusetts primary on April 30. Vice President Hubert Humphrey announced his candidacy on April 27, and some analysts viewed Humphrey's unexpectedly strong showing in the Massachusetts primary (44,156 write-in votes, or 18 percent of the total) as a clear victory over Kennedy, a Brookline, Massachusetts native, who polled a meager 28 percent write-in vote.\nMay 7: Indiana\nOn March 27, 1968, Kennedy announced his intention to run against McCarthy in the Indiana primary. His aides told him that a race in Indiana would be an extremely tight race and advised him against it. Despite the concerns of his advisors, Kennedy traveled to Indianapolis the following day and filed to run in the Indiana primary. At the Indiana Statehouse, Kennedy told a cheering crowd that the state was important to his campaign: \"If we can win in Indiana, we can win in every other state, and win when we go to the convention in August.\"\nOn April 4, 1968, Kennedy made his first campaign stop in Indiana at the University of Notre Dame in South Bend, followed by a speech at Ball State University in Muncie. In his speech at Ball State, Kennedy suggested that the 1968 election would \"determine the direction that the United States is going to move\" and that the American people should \"examine everything. Not take anything for granted.\" In addition, Kennedy enumerated his concerns about poverty and hunger, lawlessness and violence, jobs and economic development, and foreign policy. He emphasized that Americans had a \"moral obligation\" and should \"make an honest effort to understand one another and move forward together.\"\nBefore boarding a plane to attend campaign rallies in Indianapolis, Kennedy learned that Martin Luther King Jr. had been shot in Memphis. Upon arrival, Kennedy was informed that King had died. Despite fears of riots and concerns for his safety, Kennedy went ahead with plans to attend a rally at 7th and Broadway—an African American neighborhood near the north side of Indianapolis. That evening he addressed the crowd, many of whom had not heard about King's assassination. Instead of the rousing campaign speech they expected, Kennedy offered brief, impassioned remarks for peace. That night, riots erupted in over 100 cities (but not Indianapolis); 43 people were killed and over 3,000 were injured.\nThe following day, Kennedy addressed the City Club of Cleveland at the Sheraton-Cleveland Hotel in Ohio; delivering the famous \"On the Mindless Menace of Violence\" speech. After attending King's funeral in Atlanta, Kennedy turned his attention back to the primary campaign. He drew huge crowds at campaign stops across the country. Kennedy's Indiana campaign resumed on April 10.\nKennedy's campaign advisor, John Bartlow Martin, urged the candidate to speak out against violence and rioting, emphasize his \"law enforcement experience\" as former U.S. attorney general, and promote the idea that the federal government and the private sector should work together to solve domestic issues. Martin also urged Kennedy to speak out on the war in Vietnam—support for the cessation of hostilities and reallocating war funds to domestic programs were ideas which \"always got applause.\" To appeal to Indiana's more-conservative voters, Kennedy \"toned down his rhetoric\" as well.\nKennedy delivered a speech before the Indianapolis real estate board on May 2, advocating for reliance on private enterprise instead of the federal government. During this speech, Kennedy argued that the national economy would be \"restored\" by the Vietnam War's conclusion.\nThe Indiana primary was held on May 7: Kennedy won with 42 percent of the vote; Governor Roger D. Branigin (a \"favorite son candidate\" and stand-in for Johnson) was second with 31 percent of the vote; and McCarthy, earning 27 percent, came in third.\nMay 7: Washington, D.C.\nOn May 7, Kennedy won the Washington, D.C. primary with 62.5 percent of the vote; Humphrey received 37.5 percent. Two-thirds of Washington's 810,000 residents were African American, and Kennedy's campaign staff successfully geared its efforts to win their support. \"But here a light turnout and Mr. Humphrey's inaction,\" reported the Washington Post, \"makes this only mildly interesting as a test for popularity.\"\nMay 14: Nebraska\nCampaigning vigorously in Nebraska, Kennedy hoped for a big win to give him momentum going into the California primary, in which McCarthy held a strong presence. While McCarthy made only one visit to Nebraska, Kennedy made numerous appearances. Kennedy's advisors had been worried about his chances in Nebraska, given RFK's lack of experience with the issues of ranching and agriculture—subjects of high importance to Nebraskans—and the short amount of time to campaign in the state after the Indiana primary.\nKennedy won the Nebraska primary on May 14, with 51.4 percent of the vote to McCarthy's 31 percent. Kennedy won 24 of the 25 counties that he visited ahead of the vote; of those, Mills noted that the sole county he lost harbored the University of Nebraska, where a plurality of students favored McCarthy, and that Kennedy had been defeated by \"precisely two votes.\" After the results, Kennedy declared that he and McCarthy, both anti-war candidates, had collectively managed to earn over 80 percent of the vote. He described this as \"a smashing repudiation\" of the Johnson-Humphrey administration.\nMay 28: Oregon\non his whistle-stop tour through Oregon's Willamette Valley]]\nIn contrast to Nebraska, the Oregon primary posed several challenges to Kennedy's campaign. His campaign organization, run by U.S. Congresswoman Edith Green, was not strong and his platform emphasizing poverty, hunger, and minority issues did not resonate with Oregon voters. Mills wrote the following about Kennedy's calls for unity amongst Americans: \"As far as Oregonians were concerned, America had not fallen apart.\" The Kennedy campaign circulated material on McCarthy's record; McCarthy had voted against a minimum wage law and repeal of the poll tax in the Voting Rights Act of 1965. The McCarthy campaign responded with charges that Kennedy illegally taped Martin Luther King Jr. as U.S. attorney general. Kennedy admitted these mentions of McCarthy's record did not bother his supporters.\nTen days ahead of the primary, Kennedy recognized the uphill battle he faced in winning the primary: \"This state is like one giant suburb. I appeal best to people who have problems.\" During a speech he gave in California, Kennedy said, \"I think that if I get beaten in any primary, I am not a very viable candidate.\" The comment further intensified the importance of the Oregon primary. Kennedy realized that losing the Oregon primary would pose a risk to his credibility and  began what Dary G. Richardson dubbed an \"Olympian-like pace\". He campaigned for sixteen hours a day; in the weeks before the election, his campaign canvased 50,000 homes. During a May 27 campaign stop in Roseburg, Oregon, Kennedy made an impassioned appeal for federal gun control legislation. \"At the present moment, a person who is insane, a man with a long criminal record of killing a dozen people, can go in and buy a rifle,\" Kennedy remarked.\nOn May 28, McCarthy won the Oregon primary with 44.7 percent; Kennedy received 38.8 percent of votes. After Kennedy's loss was confirmed, Kennedy sent a congratulatory message to McCarthy in which he asserted that he would remain in the race.\nJune 4: California and South Dakota\nKennedy began campaigning in California before the Oregon primary; after his loss in Oregon, California's winner-take-all primary became crucial to both his and McCarthy's campaigns. In South Dakota, he also hoped to simultaneously pull off an upset victory over McCarthy and Humphrey, both from neighboring Minnesota. For Kennedy, a defeat could have ended his hopes of securing the nomination.\nOn June 1, Kennedy and McCarthy met in a televised debate on ABC's \"Issues and Answers\", which observers generally considered a draw. \"It was a conversation rather than a debate,\" said The New York Times, \"and it demonstrated that the two rivals are in substantial agreement on every major issue.\" Though Kennedy considered the debate \"indecisive and disappointing,\" subsequent polling showed that undecided voters favored his performance by a margin of two-to-one.\nOn June 3, Kennedy made a \"final dash\" through the state's major urban centers, San Francisco, Los Angeles, and San Diego; along with suburban Long Beach, in a single day. As his motorcade moved slowly through cheering crowds in San Francisco's Chinatown, gun shots appeared to ring out. However, it was just the sound of celebratory firecrackers. The campaign entourage and traveling press were all \"scared to death,\" recalled Bill Eppridge, a Life magazine photographer in the car just ahead of the Kennedys. Polls by CBS showed Kennedy leading McCarthy by 7 percent. On June 4, Kennedy won the California primary with 46 percent of the vote to McCarthy's 42 percent. Author Joseph Palermo referred to the victory as Kennedy's \"greatest.\" Kennedy also won the South Dakota primary, winning approximately 50 percent of the vote. He was now in second place with 393 total delegates, against Humphrey's 561 delegates. Around midnight on June 5, Kennedy addressed supporters at the Ambassador Hotel in Los Angeles, confidently promising to heal the many divisions within the country. At approximately 12:10&nbsp;a.m., concluding his victory speech, Kennedy said: \"So my thanks to all of you and on to Chicago and let's win there.\"\nAssassination\nAfter addressing his supporters during the early morning hours of June 5, Kennedy left the Ambassador Hotel's ballroom through a service area to greet kitchen workers. In a crowded kitchen passageway, Sirhan Sirhan, a 24-year-old Palestinian-born Jordanian, opened fire with a .22 caliber revolver and mortally wounded Kennedy. Following the shooting, Kennedy was rushed to Central Receiving Hospital and then transferred to The Good Samaritan Hospital, where he died early in the morning on June 6.\n]]\nKennedy's body was returned to New York City, where he lay in repose at St. Patrick's Cathedral for several days before the Requiem Mass was held there on June 8. His younger brother, U.S. Senator Edward \"Ted\" Kennedy, eulogized him with the words:\nJFK Library |url=https://www.jfklibrary.org/learn/about-jfk/the-kennedy-family/edward-m-kennedy/edward-m-kennedy-speeches/tribute-to-robert-f-kennedy-st-patricks-cathedral-new-york-city-june-8-1968 |website=www.jfklibrary.org |language=en |date=21 July 2021}}}}\nKennedy concluded the eulogy by paraphrasing George Bernard Shaw, \"As he said many times, in many parts of this nation, to those he touched and who sought to touch him: 'Some men see things as they are and say why? I dream things that never were and say why not? Later that day, a funeral train carried Kennedy's body from New York's Penn Station to Washington, D.C.'s Union Station, where he was laid to rest at Arlington National Cemetery.\nKennedy's death continues to be the subject of much historical analysis, in addition to multiple conspiracy theories.\nRelationships with groups and people\nBlack communities\nKennedy had been a supporter of the civil rights movement. During the campaign, there were signs in black neighborhoods that read \"Kennedy white but alright /  The one before, he opened the door.\" In the Indiana primary, Kennedy secured 86% of the black vote. His performance was strongest in cities with the largest black populations. Richardson noted that Kennedy was appealing to low-earning black voters. Kennedy had received support from black people by \"an overwhelming margin.\" Support amongst black voters was one of the key factors in Kennedy's victory in Indiana, where he gave a notable speech on the assassination of Martin Luther King Jr. in Indianapolis days before the primary took place. Samuel Lubell argued that the victory was partially inspired by Kennedy's support for corporate attempts to hire blacks; he wrote that Kennedy had largely won \"the Negro wards.\" However, Indianapolis Star journalist Will Higgins noted that Kennedy got a boost from the King assassination speech, which, unlike many other American cities, aided Indianapolis in being spared of riots. Higgins also noted that the crowd which Kennedy spoke with that evening was estimated to be only 2,500 people.\nIn the Nebraska primary, Kennedy ended his campaigning in the state with a speech in a black neighborhood in Omaha. While a late May poll showed that only 40% of overall respondents believed Kennedy embodied \"many of the same outstanding qualities\" of the late President Kennedy, 94% of black respondents agreed with the comparison. When McCarthy revealed that Kennedy had agreed to limited surveillance of Martin Luther King Jr. back in 1963, blacks in California considered switching their support to McCarthy. In Oakland, Kennedy met with Black Panthers amid other minority activists in a midnight session days before the California primary concluded. When he was shouted at, Kennedy prevented a black aide from intervening: \"They need to tell people off. They need to tell me off.\" Kennedy won 90% of the black vote in the California primary. Author Larry Tye later said: \"By the time of his death in June 1968, Bobby was the most trusted white man in black America.\" On the other hand, Michael A. Cohen noted that Kennedy's popularity with blacks had a negative effect on his appeal to the remainder of the electorate: \"Rather than create an espirit de corps between the races, his close relationship to the black community turned many whites off.\"\nWorking class whites\nKennedy had broad support among blue-collar white voters during the campaign.\nSchmitt observed that \"It was the allure of Kennedy as a bare knuckles advocate for their interests that led some of these same white voters to support the insurgent candidacy of George Wallace in the fall of 1968.\" An internal memo released during the Indiana primary showed that Kennedy-backing voters had favorable opinions of Wallace. Samuel Lubell, though noting Kennedy's support among blacks, stated that he \"had also carried the racially sensitive low-income white workers who come in from rural areas to settle in east Omaha.\"\nFarmworkers\nKennedy endeared himself to farmworkers through his support of the Delano grape strike and subsequent communications with Cesar Chavez, who told students in California that Kennedy was the candidate for farmworkers. Tye wrote that Kennedy became a hero to farmworkers by questioning local law enforcement methods. Kennedy visited Delano during the campaign to display an endorsement for the grape strike, prompting Chavez to convince the United Farm Workers (UFW) to begin voter turnout and registration campaigns. Marshall Ganz had arranged for Kennedy to speak to farmworkers after his victory speech in the California primary. Roger A. Bruns wrote the following about Kennedy's assassination: \"For the country and especially for the farm workers community, the killing of Robert Kennedy was a profoundly tragic loss.\"\nHispanics\nCesar Chavez claimed there were fifty Hispanics supporting the Kennedy campaign for every one that had backed his brother's campaign eight years prior. In the California primary, 95% of voting Hispanics supported Kennedy and he won 100% in several precincts. By the time of the primary, he had become \"the leading candidate among Latinos in California.\" Hispanic input heavily impacted Kennedy's victory.\nLyndon B. Johnson\nEven before Kennedy announced his candidacy, President Lyndon B. Johnson was convinced that Kennedy wanted to challenge him. Johnson was convinced that his presidency would be \"trapped forever between the two Kennedys\" administrations. Jeff Shesol wrote that Johnson took the prospect of a contentious primary seriously, after having underestimated the political skillfulness of John F. Kennedy in 1960. During a December 19, 1967 press conference, Johnson said the following about what he called the Kennedy-McCarthy movement: \"I don't know what the effect of the Kennedy-McCarthy movement is having in the country ...I am not privileged to all of the conversations that have taken place ...I do know of the interest of both of them in the Presidency and the ambition of both of them.\" Prior to Kennedy's announcement of his intentions to run, close friend Arthur Schlesinger Jr. wrote in a journal that he'd never seen Kennedy \"so torn about anything...I think that he cannot bear the thought of consigning the country to four more years of LBJ, without having done something to avert this.\"\nKennedy announced his candidacy after Johnson almost lost the New Hampshire primary. The day after announcing his candidacy, Kennedy predicted that Johnson would lose the general election if he was the party's nominee, if  he continued to \"follow the same policies we are following at the moment.\" Kennedy told reporters during a flight to Kansas City: \"I didn't want to run for President. But when [Johnson] made it clear the war would go on, and that nothing was going to change, I had no choice.\" Clarke wrote that Kennedy was conveying he had a moral obligation to do everything in his power to prevent a prolonging of the policies he opposed. In mid-March, during an appearance at Vanderbilt University in Nashville, Kennedy charged Johnson's leadership with leading to the divisiveness of the U.S.: \"They are the ones, the President of the United States, President Johnson, they are the ones who divide us.\" In late March, three days before Johnson announced that he would not be seeking the Democratic Party's nomination, James H. Rowe sent Johnson a memorandum charging that Kennedy's backers had said \"the president would not run and that the best course for the Democrats was to 'Stay loose and stay committed. A late-March Gallup poll showed Kennedy defeating President Johnson in a national election.\nKennedy was at his apartment in the United Nations Plaza the night President Johnson announced his withdrawal from the primary, though unlike his supporters he was not optimistic about the news. He reportedly said, \"The joy is premature.\" Smith observed that Johnson's withdrawal meant Kennedy would have to shift the focus of his critiques from the administration's policies on the Vietnam War. Shesol wrote that Kennedy moved to a praising tone of Johnson, crediting Johnson with fulfillment of \"the policies of thirty years\" during an April 1 appearance in New Jersey. While in Philadelphia, he called Johnson's withdrawal an \"act of leadership and sacrifice.\" On April 3, 1968, three days after President Johnson announced that he would not seek the nomination, Kennedy and the president met at the White House. When asked about his intentions for the primary, Johnson replied: \"Stay out of it.\" Although Johnson's withdrawal from the race meant Vice-President Humphrey would enter, Kennedy had gained the president's declaration of neutrality. In comments to Henry Ford II and Gregory Peck, Johnson concluded that Kennedy won his June debate with McCarthy.\nEugene McCarthy\nAfter the primaries, Senator Eugene McCarthy claimed that Kennedy had promised in November 1967 that he would not run. Prior to entering the race, Kennedy worried McCarthy lacked a platform, as the latter had rarely spoken about domestic issues. In mid-March, Ted Kennedy attempted to broker \"a political deal\" where his brother would remain out of the race, if McCarthy spoke out on domestic problems. McCarthy declined and the refusal propelled Schlesinger's unsuccessful suggestion that Kennedy endorse McCarthy. The day before Kennedy announced his entry into the primary, he told reporters Hayne Johnson and Jack Newfield: \"I can't be a hypocrite anymore. I just don't believe Gene McCarthy would be a good president. If it had been George McGovern who had run in New Hampshire, I wouldn't have gotten into it. But what has McCarthy ever done for the ghettos or for the poor?\"\nThe day Kennedy announced his entry into the primary, McCarthy reversed his decision to not enter the Indiana primary; he didn't want to help Kennedy's chances of winning any primaries. According to Dominic Sandbrook, Kennedy's entry into the primary caused a shift in McCarthy's campaign—McCarthy was forced to further develop his own platform, instead of merely being antagonistic to the Johnson administration's policies. Walter LaFeber believed that animosity between the Kennedy and McCarthy campaigns had grown by the end of March. Following President Johnson's withdrawal from the primary, McCarthy said: \"Up to now Bobby was Jack running against Lyndon. Now Bobby has to run against Jack.\" Mills wrote that Kennedy's focus on providing assistance for the poor and powerless during the Indiana primary was meant to highlight an issue that the McCarthy campaign had neglected. After his Nebraska victory, Kennedy said that McCarthy supporters should support him to prevent the nomination of Humphrey at the Democratic National Convention. McCarthy rebuked Kennedy's proposals about fixing cities during a late May speech at University of California, Davis. The McCarthy campaign believed that if Kennedy did well enough to survive the California primary, it would lead to a fractured Democratic National Convention where McCarthy would be the alternative for those opposed to both Kennedy and Humphrey. After Kennedy's assassination, some Kennedy advisors joined the McCarthy campaign with plans for supporting it toward gaining the nomination.\nHubert Humphrey\nTwo days after Kennedy announced his candidacy, Vice President Hubert Humphrey said that RFK had supported the JFK administration's policies on the Vietnam conflict. Humphrey's office produced a statement from Kennedy, written six years prior, saying the U.S. would win in Vietnam.\nKennedy was in Nebraska when Humphrey entered the race on April 27. Kennedy welcomed Humphrey into the race, saying Humphrey's candidacy offered \"clear alternatives\" between the Johnson administration's policies and those of the primary candidates.\nLaFeber wrote that Humphrey's entry seemed to be hinged entirely on President Johnson's distaste at the idea of Kennedy being the party's nominee in the general election. Kennedy took direct aim at Humphrey's \"politics of joy\" line during his announcement speech while campaigning in Indiana: \"It is easy to say this is the politics of happiness—but if you see children starving in the Delta of Mississippi and despair on the Indian reservations, then you know that everybody in America is not satisfied.\"\nThe morning after his Oregon loss, Kennedy hosted a Los Angeles airport press conference in which he critiqued Humphrey for what he called an inability \"to present his views to the voters of a single state.\" Kennedy also emphasized that there would be no anti-war presidential candidate, if Humphrey were the Democratic nominee in the general election against Republican Richard Nixon. After winning the California primary, Kennedy said that he intended to follow Humphrey \"all over the country\" in pursuit of the nomination.\nReflecting on Kennedy's assassination, Humphrey said: \"I was doing everything I could to get the nomination, but God knows I didn't want it that way.\" Humphrey went on to become the Democratic Party's nominee in the general election.\nRichard J. Daley\nShortly before entering the race, on February 8, 1968, Kennedy met with Chicago Mayor Richard J. Daley about the chances of usurping the nomination from the incumbent President Lyndon Johnson. Kennedy wanted Daley to use his influence to sway delegates and the Democratic National Convention in his favor toward nomination. Daley stated that he would remain committed to Johnson. Savage wrote that Daley was worried about a Kennedy presidency because he had, as U.S. attorney general, prosecuted Democratic machine politicians in several states.\nRichard Nixon\nAfter President Johnson withdrew from the primary, Nixon commented that Kennedy seemed favored for the nomination. When Richard Nixon heard that Kennedy had announced his candidacy, Nixon reportedly said, \"We've just seen some very terrible forces unleashed. Something bad is going to come out of this.\" However, Nixon was relieved by Kennedy's entry into the Democratic primary—he believed the divisions created by Kennedy's candidacy would be an advantage for Republicans. In April, Nixon proposed a debate between Kennedy and himself. Nixon, who during his own campaign for the presidency spoke about federal power to the states and economic empowerment for blacks in a late May speech, said: \"Bobby and I have been sounding pretty much alike.\" Kennedy tied with Nixon in polls conducted in the latter part of 1967. When Kennedy was announced the winner of the California primary, Nixon told his family: \"It sure looks like we'll be going against Bobby.\"\nKennedy family\nKennedy's wife, Ethel, regularly joined Kennedy when he was campaigning. His brother Ted and brother-in-law Steve Smith, were involved in the campaign as informal advisors. His sisters Jean Kennedy Smith and Patricia Kennedy Lawford were in the entourage of the Kennedy campaign at the Ambassador Hotel after Kennedy won the California primary. Kennedy met with his father, Joseph P. Kennedy Sr., ahead of making the announcement; the elder Kennedy dropped his head \"to his chest in regret.\" Bzdek wrote, \"He no longer wished to see three sons as president; he only wished to see the last two alive.\"\nSee also\n* Robert F. Kennedy Jr. 2024 presidential campaign\nNotes\nBibliography\n*\n*\n*"
    }
  ]
}