{
  "content": [
    {
      "type": "text",
      "text": "# Robert Cumming (art historian)\n\nRobert Alexander Cumming (born May 1945) is professor of the history of art at Boston University. He worked for the Tate Gallery, London, before moving to Christie's auction house where he founded the education department. After he retired from Christie's he joined Boston University. Cumming is a prolific author of art history books aimed at young people and beginners. His edited edition of the letters between Bernard Berenson and Kenneth Clark is published by Yale University Press.\nEarly life\nRobert Cumming was born in May 1945. He received his advanced education at Trinity Hall, Cambridge, where he studied law. He qualified as a barrister and began to practice but returned to Trinity Hall to study art history.\nCareer\nCumming worked in the education department of the Tate Gallery, London, before moving to Christie's auction house in 1978 where he founded Christie's Education which continues to offer graduate programmes in London and New York, and non-degree programmes in London, Paris, New York and Melbourne. He retired from Christie's in 2000, after which he was responsible for the Boston University Study Abroad London Centre from 2004 to 2012 before becoming professor of art history with the university.\nWriting\nCumming is a prolific author and is particularly known for his association with Dorling Kindersley for whom he has written many introductory level and explanatory works of art history. First inspired by his interactions with novices and young people during his time at the Tate Gallery. His subsequent experience in teaching adults and students of all ages has resulted in over a dozen books.  His books have been translated into over 20 languages, have sold over one million copies, and been awarded literary prizes in the UK, Holland and Italy.\nHis knowledge of connoisseurship came to the fore in his 2015 edited edition of the correspondence between Bernard Berenson and Kenneth Clark, published by Yale University Press, which was positively reviewed.\nPersonal life\nCumming lives in Buckinghamshire and is married to Carolyn. The couple have two daughters, Chloe and Phoebe.\nSelected publications\n*Just look: A book about paintings. Kestrel, Harmondsworth, 1979.\n*Just imagine: Ideas in painting. Kestrel, Harmondsworth, 1982.\n*''Christie's guide to collecting. Phaidon, Oxford, 1984. (Editor)\n*Discovering Turner. Tate Publishing, London, 1990.\n*Annotated art. Dorling Kindersley, London, 1995.\n*Great artists. Dorling Kindersley, London, 1998.\n*ART: The no-nonsense guide to art and artists. Everyman, London, 2001.\n*Art. Dorling Kindersley, London, 2005. (Eyewitness Companions series)\n*Great artists explained. Dorling Kindersley, London, 2007.\n*Art explained: The world's greatest paintings explored and explained. Dorling Kindersley, London, 2008.\n*Art: A visual history. Dorling Kindersley, 2015.\n*My Dear BB ...: The letters of Bernard Berenson and Kenneth Clark, 1925-1959''. Yale University Press, New Haven, 2015.\nReferences\nExternal links\n*http://www.robertcumming.net"
    }
  ]
}