{
  "content": [
    {
      "type": "text",
      "text": "# Robert Award for Best Visual Effects\n\nThe Robert Award for Best Visual Effects () is one of the merit awards presented by the Danish Film Academy at the annual Robert Awards ceremony. The award has been handed out since 1984, although numerous years in the 1980s and 1990s saw no honorees. Between 1984 and 2013 the award was given as the Robert Award for Best Special Effects (Robert Prisen for årets special effects), and since 2014 as the Robert Award for Best Visual Effects (Robert Prisen for årets visuelle effekter).\nHonorees\n1980s\n* 1984: Eg Norre –\n* 1985:  – The Element of Crime\n* 1986: Peter Høimark and  –\n* 1987: Stig Sparre-Ulrich and Niels Arnt Torp – Barndommens gade\n* 1988: Not awarded\n* 1989: Not awarded\n1990s\n* 1990: Not awarded\n* 1991: Not awarded\n* 1992: Hummer Højmark, Morten Jacobsen and Kaj Grönberg – Europa\n* 1993: Not awarded\n* 1994: Not awarded\n* 1995: Not awarded\n* 1996: Not awarded\n* 1997: Not awarded\n* 1998: Not awarded\n* 1999: Hans Peter Ludvigsen –\n2000s\n* 2000: Hummer Højmark – I Kina spiser de hunde\n* 2001: Thomas Borch Nielsen – '\n* 2002: Hummer Højmark, Steen Lyders, and Kris Kolodziejski – '\n* 2003: Jonas Wagner, Morten Lynge, Niels Valentin Dal and Hummer Højmark – Klatretøsen\n* 2004: Peter Hjorth – ''It's All About Love\n* 2005: Daniel Silwerfeldt and Thomas Borch Nielsen –\n* 2006: Peter Hjort, Hummer Højmark, and Lars K. Andersen – Adam's Apples\n* 2007: Thomas Dyg – Tempelriddernes skat\n* 2008: Hummer Højmark and Jeppe Nygaard Christensen – Island of Lost Souls\n* 2009: Hummer Højmark, Jonas Drehn, and Thomas Busk – Flammen og Citronen\n2010s\n* 2010: Peter Hjorth and Ota Bares – Antichrist\n* 2011: Morten Jacobsen and Thomas Foldberg – R\n* 2012: Hummer Højmark and Peter Hjort – Melancholia\n* 2013: Jeppe Nygaard Christensen, Esben Syberg, and Rikke Hovgaard Jørgensen – En kongelig affære\n* 2014: Hummer Højmark, Rikke Gjerløv Hansen, Thomas Øhlenschlæger, and Jeppe Nygaard Christensen –\n* 2015: Peter Hjorth – Nymphomaniac Director's Cut''\nReferences\nExternal links\n*"
    }
  ]
}