{
  "content": [
    {
      "type": "text",
      "text": "# Robert W. Campbell Award\n\n}}\nThe international Robert W. Campbell Award honors companies that achieve business excellence by integrating EHS (Environment, Health, and Safety) management into their business operations. Built upon scientific evaluation, the Campbell Award uses an evidence-based case study approach to transform the landscape of EHS worldwide. To promote integrated management systems and educate leaders across national and cultural borders, Campbell Awards are shared through the twenty-two Global Partner network.\nThe goal of the Campbell Award is to educate leaders about the value of EHS to the triple bottom line through evidence-based case studies.\nHistory and mission\nThe award is named after Robert W. Campbell, an early 20th-century pioneer in the safety movement of the United States and the first president of the National Safety Council. Campbell recognized the humanitarian benefit of safety, but realized that there were also economic benefits of EHS. He believed that striking a balance between these would convince a larger audience of how safety serves as the basis for the ideals of the Campbell Award.\nThe award seeks to \"collect and highlight the best examples of safety, health, and environmental management in successful business management worldwide.\"\nThe award's official website lists the following mission and goals:\nMission\n* Identify and provide evidence-based studies that enable business leaders to advance business vitality through the promotion of environmental, health, and safety management.\nGoals\n* Recognize businesses that uphold EHS as a key business value and link measurable achievement in EHS performance to productivity and profitability.\n* Establish a validated process by which industries can measure the performance of their EHS operations system against well-tested and internationally accepted key performance indicators.\n* Use a systematic review process to capture and evaluate the successes and lessons learned.\n* Share leading edge EHS management systems and best practices for educational purposes worldwide.\nAward qualifications and criteria\nAward submission criteria\nThe Robert W. Campbell Award honors a business, enterprise, or entity that employs a management system in which EHS is well integrated and recognized as a key business value. Publicly or privately held organizations are encouraged to apply. Additionally, \"stand alone\" subunits or divisions of larger organizations may apply. These subunits must have business operations that are self-contained, report financial performance at least annually, and have independently – auditable EHS and business performance measurements. The subunits must be answerable to a board of directors or other singular top level entity which could range from an independent board to a proprietorship.\nThe submitting organization or subunit must:\n*  Demonstrate that a well-integrated EHS management system leads to proven success in EHS practices and enhances the business's productivity.\n*  Show consistent improvement or sustained leading performance in EHS for a minimum of five years. Performance measurements must be established through recognized industry, national, and/or international metrics.\n*  Show sustained sound financial management, including: at least five consecutive years of profitability or outstanding financial performance within relevant industries at the time of Award application; if a company has rated public debt, it must carry an investment grade rating.\nSubmitting organizations fall into two categories based on the number of employees. Organizations compete for the Award within their size category. Subunits are classified dependent on the number of employees in their parent organization, regardless of the size of the subunit.\n* Category I – Organizations with more than 1,000 employees and subunits of such organizations.\n* Category II – Organizations with 1,000 or fewer employees and subunits of such organizations.\nReview process\nAll applications for the Campbell Award are evaluated by a panel of reviewers consisting of experts representing management, labor, academic, and government perspectives, nominated and approved by the Award's Global Partners.\nBased on reviewer evaluations, award finalists are selected. On-site assessments at finalists' headquarters and operations sites are then conducted by a team of assessors, and after further evaluation, winner(s) are named. Objective and confidential feedback is provided to each applicant.\nWinners of the Robert W. Campbell Award are announced at the annual National Safety Council Congress & Expo. Winning submittals are showcased by Award Global Partners at EHS, business, and leadership conferences and events around the world.\nCampbell Award Business Case Studies\nWinning companies work with Campbell Award administrators and business schools to develop university-level case studies based on their submittals. These case studies have been utilized in business and engineering schools worldwide. Currently, two Robert W. Campbell Award Business Case Studies have been produced and five are in development.  The two finished Case Studies are:\n* Noble Corporation – Project Windmill (Campbell Award Business Case I)\n* Alcan, Inc. – Leadership Challenges in Cross-Culture Ventures (Campbell Award Business Case III)\nAward winners\n* 2020: The Mosaic Company\n* 2019: Parson's Corporation\n* 2018: The Boeing Company\n* 2016: USG Corporation\n* 2015: Honeywell Aerospace\n* 2014: Cummins\n* 2013: DuPont\n* 2012: Firmenich\n* 2011: UTC Fire & Security\n* 2010: The Dow Chemical Company\n* 2009: Schneider Electric North America\n* 2008: Fluor Hanford (Category I)\n* 2008: [http://www.gpic.com/ Gulf Petrochemical Industries Co. ](Category II)\n* 2007: The Bahrain Petroleum Company (BAPCO)\n* 2006: Alcan Inc. (Category I)\n* 2006: DynMcDermott Petroleum Operations (Category II)\n* 2005: Johnson & Johnson\n* 2004: Noble Corporation\nSee also\n* List of occupational health and safety awards\n* National Safety Council\n* Campbell Award\nNotes"
    }
  ]
}