{
  "content": [
    {
      "type": "text",
      "text": "# Robert Rich, 2nd Earl of Warwick\n\n| party            =\n| spouse           = Frances Hatton (m. 1605)  Susan Rowe (m. )  Eleanor Wortley (m. 1646)\n| children         = 5, including Anne, Robert and  Charles\n| parents          = Robert Rich, 1st Earl of Warwick  Penelope Devereux\n| alma_mater       = Emmanuel College, Cambridge\n| branch           = Royal Navy\n| serviceyears     =\n| rank             = Admiral\n| unit             =\n| commands         =\n| battles          = Wars of the Three Kingdoms\n}}\nRobert Rich, 2nd Earl of Warwick (May/June 158719 April 1658) was an English naval officer, politician, and peer who commanded the Parliamentarian navy during the Wars of the Three Kingdoms. A Puritan, he was also lord of the Manor of Hunningham.\nPersonal details\nRich was the eldest son and third of seven children born to Robert Rich, 1st Earl of Warwick (1559–1619) and his first wife Penelope (1563–1607). His parents separated soon after his brother Henry's birth, although they did not formally divorce until 1605, when Penelope married her long-time partner, Charles Blount, 8th Baron Mountjoy (1563-1606). Penelope was a sister of Robert Devereux, 2nd Earl of Essex, executed for treason in 1601, making Rich a cousin of future Parliamentarian general Robert Devereux, 3rd Earl of Essex.\nRich had two sisters, Essex (1585-1658) and Lettice (1587-1619) and a younger brother Henry Rich, 1st Earl of Holland (1590–1649). He also had a number of half-brothers and sisters, including Penelope (1592-?), Isabella, Mountjoy Blount, 1st Earl of Newport (1597-1666), and Charles (1605-1627). Almost certainly fathered by Charles Mountjoy, these children were brought up within the Rich family and appear in its pedigree, with the exception of Mountjoy, who was legitimised after his father's death.\nRich married three times, first in February 1605 to Frances Hatton (1590–1623) Lady of the Manor of Hunningham, daughter and heiress of William Hatton (1560–1597) Lord of the Manor of Hunningham, formerly \"Newport\", the granddaughter of Francis Gawdy. Their children included Anne (1604–1642), Robert (1611–1659), Lucy (1615–after 1635), Frances (1621–1692) and Charles (1623?–1673). Sometime before January 1626, he married Susan Rowe (1582–1646), a daughter of Henry Rowe, Lord Mayor of London, and widow of William Holliday (c.1565–1624), Alderman of London, a wealthy London merchant and chairman of the East India Company. In March 1646, he made his third and last marriage to Eleanor Wortley (died 1667); neither of these produced children.\nCareer\n1624 map of Bermuda, showing Warwick Parish (3) and contemporary fortifications, including at Castle Harbour (originally \"Southampton Port\") where the ship Warwick was lost in 1619]]\nRich succeeded to his father's title as Earl of Warwick in 1619. Early developing interest in colonial ventures, he joined the Guinea, New England, and Virginia companies, as well as the Virginia Company's offspring, the Somers Isles Company (the Somers Isles, or Bermuda, was at first the more secure of the Virginia Company's two settlements, being impossible to attack overland and almost impregnable against attack from the ocean due to its encircling reef, and was attractive as a base of operations for Warwick's privateers, though his ship the Warwick was lost at Castle Harbour in November 1619).\nRich was also instrumental in the establishment of the ill-fated Providence Island colony in the West Indies (which was also linked with his privateering activities). Warwick's enterprises involved him in disputes with the East India Company (1617) and with the Virginia Company, which in 1624 was suppressed as a result of his action. In August 1619, the White Lion, a privateer ship sponsored by him and operating under a Dutch letter of marque, attacked the Portuguese slave ship São João Bautista and captured approximately 20 African slaves. The White Lion proceeded to sail to Old Point Comfort in the English colony of Virginia, where its crew sold the Africans to the colony's settlers, including Governor George Yeardley. This event is considered by historians to be a major event in slavery in the colonial history of the United States. In 1627, he commanded an unsuccessful privateering expedition against the Spanish. He sat as a Member of Parliament for Maldon for 1604 to 1611 and for Essex in the short-lived Addled Parliament of 1614.\nColonial ventures\n]]\nWarwick's Puritan connections and sympathies gradually estranged him from the court but promoted his association with the New England colonies. In 1628, he indirectly procured the patent for the Massachusetts Bay Colony, and in 1631 he was granted the \"Saybrook\" patent in Connecticut. Forced to resign the presidency of the Council for New England in the same year, he continued to manage the Somers Isles Company (the Somers Isles being one of the colonies that sided with the Crown) and Providence Island Company, the latter of which, founded in 1630, administered Old Providence on the Mosquito Coast. Meanwhile, in England, Warwick opposed the forced loan of 1626, the payment of ship money, and Laud's church policy.\nWarwick's Richneck Plantation was located in what is now the independent city of Newport News, Virginia. The Warwick River, Warwick Towne, Warwick River Shire, and Warwick County, Virginia are all believed named for him, as are Warwick, Rhode Island and Warwick Parish in Bermuda (alias The Somers Isles). The oldest school in Bermuda, Warwick Academy, was built on land in Warwick Parish given by the Earl of Warwick; the school was begun in the 1650s (its early records were lost with those of the Warwick Vestry in a twentieth-century shipwreck), though the school places its founding officially in 1662.\nThe Long Parliament\nBy the summer of 1640, Warwick had emerged as the centre of the resistance to Charles I.  This was the result of decades of resisting actions, including opposing Charles I's compulsory loans during the 1620s and in January 1637 – 12 years into Charles I’s personal rule – personally presenting the case for a new parliament to the king.\nIn September 1640, Warwick signed the Petition of Twelve to Charles I, asking the king to summon another parliament.\nOver the early part of the new parliament, Warwick led one wing of the opposition to Charles I. The Warwick House group pushed for further reform than the more conciliatory Bedford House group, and in particular urged the need for the execution of the Earl of Strafford.\nCivil War period\nIn 1642, following the dismissal of the Earl of Northumberland as Lord High Admiral, Warwick was appointed commander of the fleet by Parliament. In 1643, he was appointed head of a commission for the government of the colonies, which the next year incorporated Providence Plantations, afterwards Rhode Island, and in this capacity, he exerted himself to secure religious liberty.\nAs commander of the fleet, in 1648, Warwick retook the 'Castles of the Downs' (at Walmer, Deal, and Sandown) for Parliament, and became Deal Castle's captain 1648–53. The subject was criticized for not recapturing the royalist fleet in 1648 when Prince Rupert suffered mutiny and disarray in Hellevoetsluis. However, he was dismissed from office on the abolition of the House of Lords in 1649. He retired from national public life, but was intimately associated with the Lord Protector Oliver Cromwell, whose daughter Francis married his grandson and heir, also Robert Rich, in 1657 (the marriage was a short one as the grandson died the following year).\nReferences\nSources\n*\n*\n*\n*\n*\n*\nExternal links\n*\n|-"
    }
  ]
}