{
  "content": [
    {
      "type": "text",
      "text": "# Robert E. and Barbara Schwartz House\n\n| locmapin =\n| built =\n| architect = Robert E. Schwartz\n| architecture =Modern Movement\n| added = September 26, 2013\n| area = less than one acre\n| refnum = 13000799\n}}\nThe Robert E. and Barbara Schwartz House is a single-family home located at 3201 West Sugnet Road in Midland, Michigan. It was listed on the National Register of Historic Places in 2013.\nHistory\nRobert E. Schwartz was born in Midland in 1928. He attended the University of Michigan, where he received a degree in architectural design in 1954. In his senior year, Schwartz participated in a special project led by Buckminster Fuller to design a dome shelter of cardboard, a project which influenced his later design for this house. After graduation, Schwartz returned to Midland and apprenticed in the offices of Bob Goodall and Glen Beach, both proteges of Alden B. Dow. Schwartz received his license in 1958, and in the early 1960s opened his own firm with partner Charles Blacklock.\nIn 1964, Schwartz began working on a domed design for his own home. He was contacted by the Dow Chemical Company, which was developing building materials of Styrofoam, and offered to furnish Schwartz with building materials and equipment in exchange for access to the house to inspect the design and lead tour groups through. Schwartz accepted, and the exterior dome was constructed in 1964. The interior took considerably longer, and the Schwartz family moved into the house in 1966. He added an exterior storage shed in 1979 and a carport in 1992. Robert Schwartz lived in the house until his death in 2010.\nDescription\nThe Schwartz House is a three-story, thin-shell, white-painted hemispherical dome structure, constructed with a circular plan. The dome is constructed of layers of 2 inch by 4 inch by 10 foot extruded Styrofoam boards bonded together. The Styrofoam dome is covered with approximately 3 inches of spray-applied concrete over  reinforcing steel. Three large arched openings holding windows are cut out of the dome. A tall concrete block wall on one side hides a two-car open carport from the street. At the top of the dome is a large skylight that provides ventilation to the interior and light to the third floor.\nOn the interior, the house contains approximately 4,300 square feet of living space. The second and third floors are not supported by the dome, but instead float within the larger volume of the structure.\nReferences"
    }
  ]
}