{
  "content": [
    {
      "type": "text",
      "text": "# Robert Wilson and the Civil Wars\n\n| runtime        = 90 minutes\n| country        = United StatesGermanyUnited Kingdom\n| language       = English\n}}\nRobert Wilson and the Civil Wars is a 1985 documentary by Howard Brookner about Robert Wilson's ambitious attempt to stage an epic, twelve-hour, multinational opera for the 1984 Summer Olympics.\nSynopsis\nRobert Wilson and the Civil Wars is an in-depth documentation of Robert Wilson's ambitious attempt to stage an epic, twelve-hour, multinational opera for the 1984 Summer Olympics. Filmmaker Howard Brookner follows the avant-garde theatre director as he confronts a hectic work schedule, funding difficulties and relentless international travel in attempt to complete his preparations.\nThe film examines Wilson’s unique theatrical style during The Civil Wars: A Tree Is Best Measured When It Is Down, which involves the continual creation of evocative stage sets, owing to a unique juxtaposition of movement, sound, text and image. Known for his precise, painterly images Wilson’s work derives more from visual art than the orthodox literary traditions of theatre. As a result, Wilson often challenges actors to perform in a boldly minimalist style, as well as collaborating with non-actors, such as young autistic poet Christopher Knowles in Einstein on the Beach.\nCast\n* Robert Wilson\n* Philip Glass\n* Heiner Müller\n* Lucinda Childs\n* Sheryl Sutton\n* Ingrid Andree\n* Bénédicte Pesle\n* Gavin Bryars\n* Michel Guy\n* Isabel Eberstadt\n* Christopher Knowles\nProduction\nLike Howard Brookner’s earlier film Burroughs, Robert Wilson and the Civil Wars features unique access to its subject, as well as an impressive host of interviewees, including Wilson’s long-term composer Philip Glass, Heiner Müller, Lucinda Childs, Sheryl Sutton, Ingrid Andree, Bénédicte Pesle, Gavin Bryars, Michel Guy, Isabel Eberstadt and Christopher Knowles. Howard Brookner also narrates part of the film himself, which he shot on 16mm in Minneapolis, Rome, Rotterdam, Cologne, Tokyo and Marseille.\nRelease\nThe film originally screened in avant-garde and cinema festivals, as well as on public television in the US, on the BBC in the UK and on November 25, 1985, on ZDF in Germany. Although several of the film elements were lost to Hurricane Sandy a decade prior, a restored version was shown at the New York Film Festival on September 29, 2025; the 12-year restoration project was helmed by Howard Brookner's nephew, Aaron.\nReferences\nExternal links\n*\n* [http://mubi.com/films/robert-wilson-and-the-civil-wars Robert Wilson and the Civil Wars] at [http://mubi.com/home Mubi]"
    }
  ]
}