{
  "content": [
    {
      "type": "text",
      "text": "# Robert Marcellus Stewart\n\n|death_place  = Saint Joseph, Missouri, U.S.\n|party        = Democratic\n|spouse       =\n|children     =\n|residence    =\n|alma_mater   =\n}}\nRobert Marcellus Stewart (March 12, 1815 &ndash; September 21, 1871) was the 14th Governor of Missouri from 1857 to 1861, during the critical years just prior to the American Civil War.\nEarly years\nStewart was born in Truxton, New York, but moved to Kentucky with his parents when he was a boy. In 1838, Stewart moved to Buchanan County, Missouri. He made a fortune as a land speculator in the Platte Purchase area of Missouri, then settled in St. Joseph, Missouri and opened a law practice.\nStewart was a delegate to the state constitutional convention in 1845, and served as a member of the state senate for ten years.\nIn 1856 Trusten Polk was elected as governor; and then U.S. Senator at the beginning of 1857. Polk opted for the Senate, and Stewart then ran for the governorship. He won the August election and was installed as governor in October 1857.\nGovernor\nGovernor Stewart championed the founding of the Hannibal & St. Joseph Railroad in northern Missouri, which resulted in the creation of the Pony Express and the rise of Kansas City, Missouri as a metropolitan region. He also had to deal with the Bloody Kansas border skirmishes of that time.\nWhen Stewart left office in January 1861, he urged Missouri to adopt an armed neutrality in the impending Civil War and not to provide men or arms to either side though his own preference was for preserving the Union. In his final message as governor, he said:\n: As matters are at present Missouri will stand by her lot, and hold to the Union as long as it is worth an effort to preserve it... In the mean time Missouri will hold herself in readiness, at any moment, to defend her soil from pollution and her property from plunder by fanatics and marauders, come from what quarter they may... She is able to take care of herself, and will be neither forced nor flattered, driven nor coaxed, into a course of action that must end in her own destruction.\nLater years\nStewart's successor as governor, Claiborne Jackson, claimed to support the armed neutrality stance though he also stated that be believed Missouri's course was tied to the other slave states of the Confederacy.  When Missouri was forced to take sides after Governor Jackson was removed from office by the Missouri State Convention in July 1861, Stewart attempted to join the Union army. However, his failing health kept him from any active service.\nOn September 3, 1861, between 17 and 20 passengers died and 100 were injured when the Hannibal and St. Joseph Railroad bridge over the Platte River (Missouri River) was sabotaged in the Platte Bridge Railroad Tragedy.  Those responsible allegedly were attempting to assassinate Stewart.\nStewart remained a bachelor all his life and was considered quite eccentric, including a famous instance of riding his horse into the governor's mansion. He died in St. Joseph in 1871 and is interred in Mount Mora Cemetery.\nExternal links\n*[https://web.archive.org/web/20060720164401/http://www.usgennet.org/usa/mo/county/stlouis/cj/campjack.htm USGennet]\n*[http://www.sos.mo.gov/archives/resources/civilwar/2.asp Missouri Government archives]\n*"
    }
  ]
}