{
  "content": [
    {
      "type": "text",
      "text": "# Robert Edward Chambliss\n\n| birth_place       = Pratt City, Alabama, U.S.\n| death_date        =\n| death_place       = Birmingham, Alabama, U.S.\n| death_cause       =\n| resting_place     = Elmwood Cemetery (Birmingham, Alabama)\n| residence         =\n| nationality       = American\n| other_names       = \"Dynamite Bob\"\n| occupation        =\n| known_for         = Participant in the 16th Street Baptist Church bombing\n| penalty           = Life imprisonment\n| spouse            =\n| children          =\n| parents           =\n| allegiance        =\n| motive            = White supremacy\n| conviction        = First degree murder\n| reward_amount     =\n| wanted_by         =\n| partners          =\n| wanted_since      =\n| time_at_large     =\n| escaped           =\n| escape_end        =\n| comments          =\n| apprehended       =\n| imprisoned        =\n| footnotes         =\n| criminal_status   = Deceased\n}}\nRobert Edward Chambliss (January 14, 1904 – October 29, 1985), also known as \"Dynamite Bob\", was a white supremacist terrorist convicted in 1977 of murder for his role as conspirator in the 16th Street Baptist Church bombing in 1963. A member of the United Klans of America, Chambliss also firebombed the houses of several African American families in Alabama.\nInvestigation and conviction\nA May 13, 1965, memo to Federal Bureau of Investigation (FBI) director J. Edgar Hoover identified Chambliss, Bobby Frank Cherry, Herman Frank Cash and Thomas Edwin Blanton Jr. as suspects in the 16th Street Baptist Church bombing that killed four young African-American girls.\nThe investigation was originally closed in 1968; no charges were filed. Years later it was found that the FBI had accumulated evidence against the named suspects that had not been revealed to the prosecutors by order of J. Edgar Hoover. Edgar Hoover stopped and shut down the investigation in 1968. The files were used by Alabama attorney general Bill Baxley to reopen the case in 1971. In 1977, Chambliss was convicted of first degree murder for the bombing in the death of Carol Denise McNair. He was sentenced to life imprisonment. Chambliss died in Lloyd Noland Hospital and Health Center in Birmingham on October 29, 1985, still proclaiming his innocence. He was 81.\nChambliss served his sentence in the St. Clair Correctional Facility near Springville, Alabama.\nGary Rowe\nChambliss claimed that it was Gary Thomas Rowe Jr., an FBI Informant  who had planted the dynamite at the church\nInvestigative records show that Rowe, who was no stranger to dynamite, had twice failed polygraph tests when questioned as to his possible involvement in the bombing. Because of this, the FBI and Alabama Attorney General prosecutor Bill Baxley did not use Rowe as a witness in Chambliss's trial.\nSee also\n*African-American history\n*Civil Rights Movement\n*Birmingham campaign\n*Mass racial violence in the United States\nReferences\nFurther reading\n*"
    }
  ]
}