{
  "content": [
    {
      "type": "text",
      "text": "# Robert Edward Edmondson\n\nRobert Edward Edmondson (1872 in Dayton, Ohio &ndash; April 12, 1959, Bend, Oregon) was an antisemitic, isolationist pamphleteer and journalist.  Edmondson was known for being a vocal America First activist and a defendant in the Great Sedition Trial of 1944. He was also an organizer of the Pan-Aryan Anti-Jewish Union, an international antisemitism conference based in Erfurt. He saw himself as a nonpartisan patriot and referred to himself as being \"pro-Constitution, pro-national, anti-international and anti-Communist\".\nCareer\nEdmondson had a 40-year career as a reporter, editor, author and publisher on economics. He began his career as a journalist in Cincinnati, Ohio working as a reporter for the Cincinnati Post. Later he moved to New York City and became a financial reporter for the New York Herald and the New York Mail and Express. While in New York he became aware of what he came to believe was the Jewish manipulation of America's economy and started an independent financial news outlet, the Edmondson Economic Service. At this time he also became friendly with Nazi propagandist Ulrich Fleischhauer and was a participant in the latter's Welt-Dienst/World-Service anti-Jewish news service.\nEdmondson believed President Franklin D. Roosevelt to be Jewish and published the flier ''[https://digital.library.temple.edu/digital/collection/p16002coll31/id/251/ Roosevelt's Jewish Ancestry—\"He Is Not One Of Us!\"] to make his case. His attacks on Roosevelt during the 1936 election campaign suggested that the President was under the control of Jews such as Bernard Baruch, Felix Frankfurter and Louis Brandeis. Contemporary Nazi German caricatures of Roosevelt also depicted him as Jewish.\nIn a series of essays called American Vigilante Bulletins which eventually numbered over 400, Edmondson in the 1930s and 1940s documented what he saw as the Jewish control of America in banking, the press and the media. His research was the forerunner to Who Rules America? written and distributed decades later by Dr. William L. Pierce. In 1953 he republished some of his bulletins in a book, I Testify.\nEdmondson was also a strong anti-communist and much of his writing centered around the idea that fluoride in water was part of a communist conspiracy, as well as other plots attributed to communists.\nTrials\nOn June 11, 1936, Edmondson was indicted by a Grand Jury in New York City and charged with \"libeling all persons of the Jewish Religion.\" In preparing his defense Edmondson subpoenaed some of the most prominent Jews of the time, including: Bernard Buruch, Henry Morgenthau, Rabbi Wise, Samuel Untermeyer, Mayor LaGuardia, James P. Warburg, Walter Lippmann and Justice Samuel Rosenman. In response, the American Jewish Committee petitioned the court to drop the charges against Edmondson. On May 10, 1938, the judge dismissed all indictments, ruling that there is no group libel law.\nIn the early 1940s Edmondson was again indicted for his anti-Semitism along with 29 others on charges of sedition. The Great Sedition Trial of 1944, as it became known, was eventually declared a mistrial and the charges were later dismissed. He was widely believed by U.S. intelligence to have been an agent for Nazi Germany.\nFrom New York City Edmondson moved to Stoddartsville, Pennsylvania and later to Grass Valley, California.\nEdmondson on the Jews\nThe following quote expresses his ideology:\nI am not against Jews because of their religion, as a race, a people or as individuals, but because Jewish leadership [i.e., the bankers] is actively anti-American, is attempting to jettison the American political philosophy and take over the Country, and that I would continue to be anti-Jewish until Jewry repudiated such subversion. Were the offender any other than the Jewish minority, my attitude would be precisely the same. This problem is the biggest and most acute thing in the world today ...\nKnowing that pitiless publicity is the only cure for public evils, in 1934 I started on a campaign to expose Jewish Anti-Americanism and Talmudic Communism which has been called the \"Code of Hell\": a \"Rabbi Racket\" that victimizes its own followers; an international \"Satanic System\" subverting France, Britain, Germany and Russia, causing the present depression and moving to take over the United States through the Jewish Radical administration [of FDR.]\nPost-death controversy\nEdmondson died aged 86 in 1959. Following his death his local paper, The Bend Bulletin, was at the center of controversy amongst his followers who launched a concerted letter writing and pamphleteering campaign as far right leaders attacked the paper for an editorial that was highly critical of Edmondson.\nIn 2021, the Hoover Institution acquired Edmondson's propaganda archive collection, consisting of approximately 375 handbills, broadsides, flyers, and newsletters.\nBooks\n*I Testify: Amazing memoir-exposure of international secret war-plotting. Bend, OR: Author, 1953. First printing\n*The rape of the press; American free speech subversion unmasked. Democracy propaganda fraud \"exploded\". Bend, OR: Author, 1954. 39 p.\n* Is Your Name on \"the Red Death List? \" the Vigilantes May Know Who is to Be \"Liquidated\" First By Communist Shock Troops, Now Ready to Act-\"Liberty\" Warns, 1939.\n* \"Anti- Semitic\" causes of today: A politico-economic, not a religious or racial problem, 1937.\n* Why twenty Oregon cities rejected fluoridation in 1956, 1957.\n* Vengeance versus justice;: [report on the \"mass sedition case\", a communistic prosecution of anti-Communists, 1945.\n* A church promissory \"manifesto to the Jews\": (with misleading statistics) entangles ministers : Rev. Keith Brooks of Los Angeles, with orther ... is politico-economic instead of religious, Sons of Liberty, 1981.\n* The damning parallels of the Protocol \"forgeries\" as adopted and fulfilled in the United States by Jewish-radical leadership: A diabolical capitalist-communist alliance unmasked\n* A church promissory \"manifesto to the Jews\": (with misleading statistics) entangles ministers : Rev. Keith Brooks of Los Angeles, with orther ... is politico-economic instead of religious, Sons of Liberty, 1981.\n* The greatest war in history now on! International Jewish system against national patriotism, avec Henry Hamilton Beamish et  Adrien Arcand, New York, 1937.\n* The Jewish system indicted by the documentary record, 1937.\n* The National Citizen Force Bill (Mr. Will Thorne, M.P.): An appreciation & explanation, Twentieth Century Press (1908)\n* ''John Bull's army from within: Facts, figures, and a human document from one who has been \"through the mill\"'', Unwin, (1907)\nReferences\nExternal links\n*[http://digital-library.csun.edu/cdm4/results.php?CISOOP1=exact&CISOFIELD1=CISOSEARCHALL&CISOROOT=/InOurOwnBackyard&CISOBOX1=Edmondson%2C+Robert+Edward%2C+b.+1872 Fliers printed by Edmondson]"
    }
  ]
}