{
  "content": [
    {
      "type": "text",
      "text": "# Robert Gray's Columbia River expedition\n\nIn May 1792, American merchant sea captain Robert Gray sailed into the Columbia River, becoming the first recorded American to navigate into it. The voyage, conducted on the privately owned , was eventually used as a basis for the United States' claim on the Pacific Northwest, although its relevance to the claim was disputed by the British.  As a result of the outcome the river was afterwards named after the ship. Gray spent nine days on the river trading fur pelts before sailing out of the river.\nVoyage\nCaptain Gray was a merchant ship captain born in Rhode Island, who circumnavigated the globe between 1787 and 1790 on , a trading voyage out of Boston, Massachusetts. He traveled first to the north Pacific coast of North America, to trade for furs, and then to China, to trade the pelts for tea and other Chinese goods.\nAfter his return from that expedition, Gray set sail for the northwest coast again on September 28, 1790, reaching his destination in 1792.\nDuring his first voyage to the northwest coast, Gray was second-in-command of Columbia Rediviva under Captain John Kendrick, who remained in the Pacific, in command of . On the journey north along the coast to Nootka Sound, Gray encountered a strong outflow near 46'16\". He spent nine days trying to enter the river without success before abandoning the effort and sailing north for Nootka. Gray rejoined Kendrick for a time after Gray's return to the region. In October Columbia Rediviva and crew began building Fort Defiance and a small craft called  as they prepared to ride out the winter in harbor. After wintering on Vancouver Island, Gray set sail again on April 2, 1792, when he left the American trading post of Clayoquot on Vancouver Island. On this journey aboard Columbia Rediviva Gray noticed muddy waters flowing from shore and decided to investigate his belief that it might be the \"Great River of the West\". While waiting for favorable weather, Gray spotted a ship and exchanged greetings with her on April 29. This ship was  commanded by British naval captain George Vancouver, who doubted that Gray had found a navigable river-mouth.\nGray informed Vancouver at this chance meeting that he had located a large river at the latitude of 46'10\" but had been unable to enter it due to the outflow. However, Vancouver still doubted any river existed there:\nSo Gray informed Vancouver that he would further investigate that area, and then sailed south after several more days near the Strait of Juan de Fuca.\nEntering the Columbia\nThe treacherous and shifting sand bar at the mouth of the Columbia River Estuary presented a challenge to any ship that attempted to enter the river. In April, Gray attempted to enter the mouth of the river, but bad weather forced him to give up.\nAfter sailing north, meeting Vancouver, and spending a time in Grays Harbor, as it was later named, Gray returned to the river. This time he ordered a small sailboat launched to attempt to find a safe passage across the sand bars in the process known as sounding. Finally in the evening of May 11, 1792, Gray's men found a safe channel, and so ship and crew sailed into the estuary of the Columbia River.\nOnce there they sailed upriver and Gray named this large river Columbia after his ship. The natives called the river Wimahl which translated to Big River. In addition to naming the river, Gray also named other landmarks such as Adams Point and Cape Hancock. However, many of these places have since been renamed. The farthest point Gray explored upriver is now known as Grays Bay, and the river that flows into it Grays River. These names were not given by Gray, but by William Broughton, George Vancouver's lieutenant, who explored the Columbia in October 1792. Robert Gray had made a chart of the bay and the mouth of the river, a copy of which was acquired by Vancouver.\nOnce entering the Columbia's estuary, according to the ship's log, they were met by many natives in their canoes, while the crew prepared to take on fresh water.\nTrading with the locals consisted mainly of exchanging nails and other small iron products for pelts, salmon, and animal meat such as deer and moose. During the nine-day trip on the river, the ship continued to trade amongst the natives on an almost daily basis while performing various repairs and maintenance on the ship. Trading with these natives led to a collection of over 450 animal pelts to be traded in China.\nOn May 14, the ship reached its furthest point inland, approximately  upriver. At this point the vessel ran aground briefly and the crew realized they had taken the wrong channel when sounding demonstrated the channel they were in had ended. Columbia Redivia then started slowly to return downriver towards the mouth. Then the next day Captain Gray went ashore with his first mate Mr. Hoskins aboard a jolly-boat to view the country. Gray \"landed on the north riverbank, raised the American flag, planted some coins under a large pine tree, and claimed possession for the United States.\" By May 18, the ship was about  from the bar. On May 19 the ship was anchored off the native village Chinoak, led by the chief Polack. On this day is when Gray officially named the river Columbia and bestowed other landmarks with names:\nThen on May 20, Gray and crew took up anchor around 1 pm to sail for the ocean. Around 2 pm they had sailed over the bar, and by 5&nbsp;pm Columbia Redivia had left the river and reached the open sea sailing north along the coast. The next day they passed by Grays Harbor on their journey north to rendezvous with their sloop Adventure before setting sail for China. However, before Gray and his crew sailed for China, they returned to Nootka Sound where he passed along news of his discovery to the Spanish commandant there, Quadra. Gray left with Quadra a chart and description of the river's mouth that Captain Vancouver obtained a copy of in September. Upon leaving Nootka, the ship sailed for the China market.\nAftermath\nA short time after entering the Columbia River and trading with the natives, ship and crew sailed to China to sell the pelts before returning to Boston in July 1793. Gray's entering of the Columbia was later used, during the Oregon boundary dispute, to support the American claim to the Oregon Country, against the claim of Britain. The American and British diplomats raised many points in addition to Gray's voyage to support their cases. Neither side could agree that the other had established a clear and exclusive right of sovereignty. The British raised several points questioning whether Gray's voyage up the Columbia River had any value in establishing sovereignty. The Americans raised counter-points. No agreement was reached on this and many other points about the right to the Oregon Country. In the end the dispute was resolved by compromise in the Oregon Treaty of 1846. Upon Gray's return, though, little was thought of his discovery. He did not publish it, and the long-term consequences to which it contributed were unforeseen.\nGrays Harbor, somewhat north along the coast from Columbia's mouth, is named for Robert Gray. Present day Astoria, Oregon, where John Jacob Astor would establish his trading post less than 20 years after Gray's discovery, is situated on the south shore of the Columbia estuary.\nDue to Gray's naming the river for his ship, the name Columbia has been attached to several names in the Pacific Northwest such as Columbia County, Oregon; British Columbia; Columbia Street in Portland, Oregon; and Columbia City, Oregon.\nCrew of Columbia Redivia\nThe following is a list of those on board Columbia Rediviva when it sailed from Boston:\nCaptain Gray, Robert Haswell (Chief Mate), Joshua Caswell (second mate), Owing Smith (third mate), Abraham Waters (Fourth Mate), John Boit (Fifth Mate), John Hoskins, Samuel Homer, Jack atoe, Benjamin Harding/Harden, Samuel Yendell, Nahtan Dweley, John Emes, Popkins, Bart peas, Tom (the cook), Joseph Barnes, John Butler, Bryant Winle, Anteny Lows, Joseph Folger, Andrew Newhil, Elsworth, Weks, Obediar Weston, Isack, Ginnings, Sheperd, George Davidson (painter), Nickels (tailor), and Nathaniel Wooward.\nCaswell, Barnes, and Folger were killed on August 12, 1791, by natives. Harding died March 21, 1792, of dysentery. On March 24, 1792, Haswell took command of the sloop Adventure with Waters and ten others and thus were not part of the discovery of the river.\nPrevious explorations\nIn 1775, Spaniard Bruno de Heceta (also spelled Hezeta) was exploring the northwest coast of North America with the vessels Santiago and Sonora under his command. On his return journey south, with only the Santiago and a reduced crew, Heceta discovered a large bay penetrating far inland. He tried to sail in but the strong currents prevented it, even under a full press of sails. His crew was so reduced that they could not handle the anchor so he could not easily wait for better conditions. He wrote that the seething currents led him to believe it was the mouth of a great river or a passage to another sea. He named the bay Bahia de la Asunciõn and produced a map of what he could discern from outside the Columbia bar. Later Spanish maps often showed the Columbia River's estuary with the name Entrada de Hezeta, Rio de San Roque, and similar variants.\nCaptain John Meares, during his 1788 exploration of the Pacific Northwest, had on board a copy of a Spanish map made by Francisco Antonio Mourelle and Juan Francisco de la Bodega y Quadra which showed the Columbia River's mouth as Entrada descubierta por Dn Bruno Hezeta. On July 6, aboard the 230-ton snow Felice Adventurer, Meares sailed off the mouth of the river at the latitude indicated on the Spanish map, but was unable to find the mouth. He did see the cape on the north side of the entrance and named it Cape Disappointment, reflecting his failure to find the river's mouth. This led Meares to write in his log: \"We can now with safety assert, that no such river as that of St. Roc exists, as laid down in the Spanish charts.\"\nThe last known attempt on the Columbia River before Gray's successful entering of the river was Captain Vancouver's visit in April 1792.\nSee also\n* Nootka Crisis\n* Vancouver Expedition\nReferences\nExternal links\n* [http://www.washington.edu/uwired/outreach/cspn/Website/Classroom%20Materials/Reading%20the%20Region/Discovering%20the%20Region/Texts/8.html \"Official Log of the Columbia\" (1792)]"
    }
  ]
}