{
  "content": [
    {
      "type": "text",
      "text": "# Robert Stewart (priest)\n\n| death_place        = Kucheng, China\n| occupation         = Missionary to China\n| children           = Arthur Dudley StewartEvan George Stewart\n| religion           = Christianity\n}}\nRev. Robert Warren Stewart  (9 March 1850 – 1 August 1895) was an Irish missionary of the Church Missionary Society, London, stationed at different times in  Australia, India.  and Fuzhou, China, where he was martyred.\nLife\nRobert Warren Stewart was born in March 1850 at Gortleitragh House, Dublin, son of James Robert Stewart, a wealthy land agent, and Martha Elinor Warren, daughter of the leading barrister Richard Benson Warren, and granddaughter of Sir Robert Warren, 1st Baronet, the head of a prominent landowning family from County Cork. George Francis Stewart, Governor of the Bank of Ireland, was his younger brother. He was educated at Marlborough College (in England) and at Trinity College, Dublin. After graduation, he studied law in London, but the spiritual crisis of his conversion occurred at Richmond, Surrey when he was just about to become a lawyer. He became a member of the Church Missionary Society in 1875, and after a year's training at Islington he was ordained at St. Paul's Cathedral on Trinity Sunday 1876, together with Rev. Llewellyn Lloyd. Shortly afterwards Robert Stewart married Louisa Katherine Smyly and the couple set out for China with Rev. Ll. Lloyd in September and arrived in Fuzhou on 14 November.\n, Sydney, 1892]]\nMr. Stewart's first years in China were spent in training the native schoolmasters and catechists, and his wife was put in charge of a school to train native Biblewomen. Their educational work, however, was interrupted by the Wu-shih-shan Case of 1878, which resulted in the burning down of the Theological College and the expulsion of the English Mission from the city proper.\nStewart suffered severely from dysentery in China. In 1891 he went home for a furlough and was redeployed by the C.M.S. Committee to accompany Eugene Stock on his Australian tour, after which he visited India and returned to China via Canada fully restored in the autumn of 1893.\nOn 1 August 1895, he was brutally murdered in Kucheng Hwasang by a sect known as the Vegetarians during the Kucheng Massacre, together with his wife and two children and seven other missionaries connected with the Church Missionary Society or the Church of England Zenana Missionary Society.\nSee also\n* Church Missionary Society in China\n* Kucheng massacre\nReferences"
    }
  ]
}