{
  "content": [
    {
      "type": "text",
      "text": "# Robert Greenblatt (anti war activist)\n\nRobert Greenblatt (May 14, 1938 – October 21, 2009) was an assistant professor at Cornell University and was an early opponent of America's military involvement in Vietnam and the founding co-chairman and national coordinator of the National Mobilization Committee to End the War in Vietnam.\nEarly life and Family\nGreenblatt was born in Debrecen, Hungary into an Orthodox Jewish family. At six years of age he was deported to Nazi concentration camps in Austria (Strasshof and Floridsdorf), together with his mother and siblings. He was liberated by Russian troops in the spring of 1945. He moved to the United States with his parents Julius and Pessie in 1949.\nGreenblatt was the first cousin, once removed, of Trump advisor Jason Greenblatt and Canadian religious leader and Holocaust educator Eli Rubenstein.\nEducation\nGreenblatt studied at Yeshiva Chaim Berlin, then attended Brooklyn College, then Yale, where he received his PhD in mathematics in 1963, at the age of 25, under American mathematician William Schumacher Massey.\nActivism\nGreenblatt became an assistant professor of mathematics at Cornell University where he met Bruce Dancis, the first student to tear up his draft card and send it back to the draft board. In 1966, Greenblatt became very involved in the anti war movement and organized a series of teach-ins in order to \"educate Americans about the tragic errors of our Vietnam policies.\" He was also vice president of their sponsoring organization, the Inter-University Committee for Debate on Foreign Policy. A large part of his focus was encouraging all white college students to drop-out of school so as not to be a part of draft deferments which discriminate against African Americans who are too poor to get a higher education. He left his post at the university to devote himself full time to the cause. He said \"I am a former professor of mathematics, that was before I became a drop-out.\" He instructed white students saying, \"Take a few courses, but not enough to qualify as a full-time student and be deferred. You have better things to do.\"\nIn June 1966, Greenblatt was ordered to jail for his activities but was released soon after. He was one of the chief organizers of the Spring Mobilization to End the War in Vietnam, scheduled for both New York City and San Francisco on April 15, 1967. Organizers had expected only 150,000 but estimates showed between 300,000 and 400,000 attended. On October 21, Greenblatt was an organizer of a march on The Pentagon. It was purposely arranged for a weekend because \"We checked that out and found that 25,000 people work in the Pentagon during the week. But most of these are secretarial and clerical personnel. The 7,000 who work on week-ends are the people we want to reach. They are the decision-making military men, and for them, war-making is a 24-hour-a-day, 7-day-a-week occupation.\"\nIn 1968, Greenblatt and another academic went to Hanoi with another academic and author Susan Sontag. She wrote a journal of the trip for Esquire Magazine.\nHouse Un-American Activities Committee\nIn 1969 Greenblatt was subpoenaed by The House Un-American Activities Committee, who seized a large quantity of documents and forced him to testify. Charges were eventually dropped \"but not before HUAC's autumnal carnival\" the Village Voice reported.\nGreenblatt's cross examination was led by Richard Howard Ichord Jr., last chairman of the House Un-American Activities Committee. Greenblatt was defended by prominent civil rights lawyer Sanford M. Katz.\nGreenblatt was quite combative with the committee, arguing that their actions were reminiscent of the fascist tendencies he had escaped from in Nazi occupied Europe.\n\"I will tell you when I came to this country. After spending several years in ghettos, in repressive institutions in Hungary and Germany, I spent several years in ghettos in Hungary. I spent years in concentration camps in Germany under the most blatant kind of Fascist rule — which again, and at that time, was justified, in the name of protecting the security of the countries then involved. It was at that time justified as a way of separating out the people that were endangering the security of that country, and I may remind the Chair that ultimately the people who were so described were exterminated.\"\n\"I came to the United States when I had had enough of that kind of fascism and thought I could meet with a different kind of condition in this country. The country is the country of Hungary, at a time when fascism was rising in Hungary and at a time when this kind of intimidation was at approximately the same stage as it seems to be in the events surrounding these hearings.\"\n\"There are many millions of people in this country who are opposed to this Government policy, that this country not be labeled in the eyes of all the world as simply a repetition of other countries, the names of which, when I mentioned them the other day, for some reason the chairman became very concerned about, that there is not hopefully a repetition of Germany of the 1940s and not simply a repetition of Hungary in the 1930's and 1940s's, which is still possible in this country, and with the people in this country who will fight this kind of genocidal war in Vietnam\".\nHe also expressed concern for his own physical safety and that of fellow activists, including Abbie Hoffman, who was arrested entering the House of Representatives after being subpoenaed, even refusing to testify until he could be assured of Hoffman's well-being.\nMr. Greenblatt: \"Mr. Chairman, I want to make it absolutely clear that I came to Washington, I came to these committee hearings, despite reservations and the very strong feeling that I have about them, as I indicated earlier, with the full intention of testifying and responding to any questions that may be put to me about my own actions, about my own activities, although I do feel and feel very strongly that I am not legally, morally, and constitutionally under an obligation to do so for reasons that have been cited by counsel and that I have tried to cite myself. I am still willing, perfectly willing, to go forward with this attempt to testify, although I will not be willing to testify about actions and activities of other people. I will be willing to testify about my own actions and my own activities because I am proud of them. However, as I tried to indicate earlier, I am very concerned about the general atmosphere in which these hearings are being conducted, both inside and outside this hearing room. I am very concerned about the kind of actions that the committee and law enforcement officers, or people who should be enforcing the law, have taken against myself, attorneys, other witnesses, colleagues of mine that have appeared or tried to appear before this committee…….. And I must say at this time, specifically, that the greatest outrage was reached in the last few days when, in fact, one of my colleagues, one of my brothers, was physically assaulted outside this committee. Until I know the whereabouts and the well-being (Cut off by Chairman…)\nIt is difficult for me to answer the question when one of these seven people who have been subpoenaed to this hearing was arrested for trying to walk into the hearing room and trying to walk into the building in which this hearing room is located. I find it very difficult, indeed, to be responsive under those kinds of circumstances of intimidation and of use of force.\nMr. Ichord. And you are going to refuse to answer on those grounds?\nMr. Greenblatt. I am unwilling to testify until I know that these kinds of tactics will no longer be employed, until I have some kind of assurance as to the well-being of Mr. Hoffman.\nLater life\nIn later life, Greenblatt became the president of the Brooklyn chapter of Hillel: The Foundation for Jewish Campus Life.\nOne of his children, Brooklyn artist Jeremiah Grunblatt, died in a car crash on his honeymoon in October 2015, three days after his wedding.\nReferences"
    }
  ]
}