{
  "content": [
    {
      "type": "text",
      "text": "# Robert O. Waring\n\nRobert Olaf Waring (November 26, 1919 – June 16, 1976) was a U.S. diplomat assassinated in Beirut, Lebanon, in 1976.\nEarly life\nWaring was born in Long Island City, New York, on November 26, 1919, and attended Fordham University, where he graduated with a Bachelor of Arts and Masters of Arts degree. During World War II, he served two years at the War Department from 1943 until 1944. In the latter year, he joined State Department as a clerk.\nDiplomatic career\nHe served in administrative posts as a Foreign Service officer in various locations including Casablanca, Rabat, Thessaloniki, Athens, West Berlin and London. He then became an Economic Officer and served in Vienna from 1961 to 1966 and then in Berlin until 1971, when he returned to Washington, D.C. In June 1972, he and his family were posted to Beirut, Lebanon, where he had good business and political contacts including the future president, Elias Sarkis.\nDeath\nAt 10:40am on 16 June 1976, in Beirut, Francis E. Meloy, Jr., the incoming U.S. Ambassador to Lebanon, accompanied by Waring, the U.S. Economic Counselor, were on their way to present Meloy's credentials to the new Lebanese President-elect Elias Sarkis. Meloy, Waring and their driver, Zuhair Mohammed Moghrabi, were kidnapped by Popular Front for the Liberation of Palestine members as they crossed the Green Line, the division between Beirut's Christian and Muslim sectors. Meloy had been in the country a month, but not presented his credentials to the old president Suleiman Franjieh, who had taken refuge outside Beirut and refused to step down.\nBy 9:30pm, Lebanese television announced their bullet-riddled bodies had been found on a garbage dump near the beach in Ramlet al-Baida. He was survived by his wife Irene Pollack and four children.\nSee also\n*List of kidnappings\n*List of solved missing person cases\nReferences\nExternal links\n*[http://www.arlingtoncemetery.net/rowaring.htm Arlington National Cemetery]\n*[http://www.presidency.ucsb.edu/ws/index.php?pid=60472 Presidential Proclamation honoring Ambassador Meloy & Counselor Waring]"
    }
  ]
}