{
  "content": [
    {
      "type": "text",
      "text": "# Robert Howard Schnacke\n\n| birth_place   = San Francisco, California\n| death_date    =\n| death_place   =\n| death_cause   =\n| resting_place =\n| resting_place_coordinates =\n| citizenship   =\n| nationality   =\n| party         =\n| otherparty    =\n| height        =\n| spouse        =\n| partner       =\n| relations     =\n| children      =\n| parents       =\n| mother        =\n| father        =\n| relatives     =\n| residence     =\n| education     = College of the Law (LL.B.)\n| alma_mater    =\n| occupation    =\n| profession    =\n| known_for     =\n| salary        =\n| net_worth     =\n| cabinet       =\n| committees    =\n| portfolio     =\n| religion      =\n| awards        =\n| signature     =\n| signature_alt =\n| website       =\n| footnotes     =\n}}\nRobert Howard Schnacke (October 8, 1913 – June 5, 1994) was a United States district judge of the United States District Court for the Northern District of California.\nEducation and career\nHe was born in San Francisco, California and graduated from Lowell High School in 1930. He received a Bachelor of Laws from the University of California, Hastings College of the Law in 1938. He was in private practice in San Francisco from 1938 to 1942. He was in the United States Army as a special agent of the Counterintelligence Corps from 1942 to 1946, and entered as a private. He was in private practice in San Francisco in 1946. He was deputy commissioner of the Division of Corporations for the State of California from 1947 to 1951. He was in private practice in San Francisco from 1951 to 1953. He was an Assistant United States Attorney and chief of criminal division of the Northern District of California from 1953 to 1958. He was the United States Attorney for the Northern District of California from 1958 to 1959. He was in private practice in San Francisco from 1959 to 1968. He was a judge of the Superior Court of California from 1968 to 1970.\nFederal judicial service\nSchnacke was nominated by President Richard Nixon on September 10, 1970, to a seat on the United States District Court for the Northern District of California vacated by Judge George Bernard Harris. He was confirmed by the United States Senate on October 13, 1970, and received his commission on October 15, 1970. He assumed senior status on December 31, 1983. Schnacke served in that capacity until his death on June 5, 1994.\nReferences\nSources\n*\n|years=1970–1983}}"
    }
  ]
}