{
  "content": [
    {
      "type": "text",
      "text": "# Robert Ashton (historian)\n\n| death_place        =\n| nationality        = British\n| alma_mater         = University College, Southampton  London School of Economics\n| title              = Professor of English History (1963–1987)  Dean of the School of English Studies (1964–1967)\n| notable_works      =\n| awards             = Fellow of the Royal Historical Society (FRHistS)\n}}\n'''Robert 'Bob' Ashton', FRHistS (21 July 19249 February 2013) was a British historian specialising in early modern England. A leading authority on the House of Stuart, he was Professor of English history at the University of East Anglia. In addition, at various points in his academic career, he lectured at the University of Nottingham, University of California, Berkeley, and the University of Oxford.\nEarly life\nAshton was born on 21 July 1924. He was educated at Magdalen College School, Oxford, an all boys private school in Oxford. He joined the Royal Air Force in 1943. After the end of World War II, he left the RAF in 1946. He attended University College, Southampton the predecessor to the University of Southampton. He graduated with a first class Bachelor of Arts (BA) in History. He went on to study at the London School of Economics under R. H. Tawney. His doctoral thesis was on the subject of the early Stuart Monarchs.\nAcademic career\nIn 1953, Ashton joined the University of Nottingham where he lectured in economic history. His first book The Crown and the money market, 1603–1640'', concerning borrowing under the first two monarchs of the House of Stuart, James I of England and Charles I of England, was published in 1960. In 1962, he was awarded a visiting chair at the University of California, Berkeley.\nWhen the University of East Anglia opened in 1963, he was appointed the founding Professor of English history. He was appointed Dean of the School of English Studies in 1964, after Ian Watt moved on, serving until 1967. Under his direction, American studies was added to the school as part of his commitment to interdisciplinary study. His was twice awarded a visiting fellowship at All Souls College, Oxford. He gave the Ford Lectures at the University of Oxford in 1982. He retired in 1988.\nHe was president of the Norfolk and Norwich Branch of the Historical Association. He served three times on the Council of the Royal Historical Society, on the last occasion as its vice-president.\nLater life\nFollowing his retirement, Ashton remained active as a scholar. He published his last book in 1994 and gave his final lecture in 2002 at the Norfolk and Norwich branch of the Historical Association.\nHe died on 9 February 2013. His funeral service was held at St Michael's Church, Braydeston, on 20 February 2013.\nPersonal life\nAshton was a devout Christian and member of the Church of England. He served as churchwarden at Braydeston Church, Norfolk for more than 30 years.\nHe lived at the Manor House, Brundall, where coincidentally the English Historian Lord Blake was born.\nHe married Margaret Alice Sedgwick in 1946. Together they had two daughters, Rosalind and Celia. His wife predeceased him, dying in 2010.\nHonours\nIn 1960, Ashton was elected a Fellow of the Royal Historical Society (FRHistS).\nReferences\nExternal links\n*[https://www.independent.co.uk/news/obituaries/professor-robert-ashton-historian-of-early-modern-england-8533191.html Obituary – The Independent]\n*[https://www.thetimes.com/travel/destinations/uk-travel/england/london-travel/professor-robert-ashton-jr7k2brqq6m Obituary – The Times]"
    }
  ]
}