{
  "content": [
    {
      "type": "text",
      "text": "# Robin King\n\nRobin Andrew King, (born 7 July 1966) is a Northern Irish loyalist paramilitary leader who served as the commander of the Ulster Protestant Loyalist Volunteer Force (LVF). A close friend of the organisation's founder Billy Wright, King took over as leader following the death of Mark \"Swinger\" Fulton, who had succeeded Wright when he was assassinated by the Irish National Liberation Army (INLA) in December 1997.\nEarly years\nKing was born in Lurgan, County Armagh, on 7 July 1966. Despite being born a Catholic, King became involved in Ulster loyalism in his teenage years. As a member of the Ulster Volunteer Force (UVF) which he had joined in the late 1980s, King was close to Billy Wright with whom he shares a birthday. Wright took over as leader of the UVF Mid-Ulster Brigade during the early 1990s upon the retirement of its commander Robin Jackson. King served as the Mid-Ulster Brigade's Director of Operations.\nImprisonment\nIn 1994, King was given a 16-year prison sentence for conspiracy to murder and sent to the Maze Prison. He was released after serving four and a half years of the sentence. Meanwhile, in 1996 Wright formed the breakaway Loyalist Volunteer Force (LVF) after he and his Portadown unit were stood down by the UVF leadership following the unauthorised killing of taxi driver Michael McGoldrick by Wright's men while the UVF were on ceasefire. King switched his allegiance to Wright's new organisation. When Wright was gunned down inside the Maze by members of the Irish National Liberation Army (INLA), King assumed the role of Officer Commanding (OC) the LVF prisoners.\nDuring King's imprisonment, another member of the LVF, David Keys, was killed in the jail on 15 March 1998. Keys, a 23-year-old living in Banbridge who had served with the Royal Irish Regiment and who had been shot and injured by the UVF in 1996 in his native Cregagh area of Belfast, was on remand for killing two friends in Poyntzpass. Initially treated as a suicide (Keys was found hanging with his wrists slashed), a post mortem revealed that he had been beaten severely about the body and injured on his hands and feet before being killed. Police speculated that Keys had been killed after the LVF became suspicious that he was co-operating with the police in their inquiries into the double murder. King was arrested and tried for Keys' murder but acquitted in 2000.\nLVF leader\nAccording to the Daily Mirror King was the main rival to the leadership of Mark \"Swinger\" Fulton and just before the latter's prison suicide King was preparing to wrest control of the LVF from him. King controlled the LVF in Lurgan whilst the Fultons dominated the movement in its traditional stronghold of Portadown. However, King felt that control should rest with the Lurgan faction and a loyalist feud broke out. As a result Gary Fulton, a cousin of Mark and William James Fulton and himself an important figure in the Portadown LVF, was attacked and savagely beaten by members of the Lurgan group in early 2002, being left with a broken leg as a result of the incident. It was reported that the attack had been in response to Gary Fulton attacking a Lurgan member who had been involved in the murder of journalist Martin O'Hagan.\nFollowing Mark Fulton's death, King took over as leader of the LVF. One of his first acts was to end the group's relationship with Johnny Adair, a former Ulster Defence Association (UDA) leader who had recently been forced out of Northern Ireland by his former UDA comrades. It was reported that the UDA had been putting pressure on the UVF to crush the LVF as they had done to the renegade West Belfast Brigade, whilst it was claimed that Adair had ordered King to stay away from his former west Belfast stronghold after King's allies had attempted to take over UDA-controlled rackets in Dromore, County Down. King and his close ally Neil Hyde, who were dubbed the \"Mourneview Mafia\" after their home estate in Lurgan, became heavily involved in racketeering, running a series of protection rackets and even demanding a luxury apartment for King from a local property developer. The Mourneview Mafia were also linked to a racist attack on an Asian family on the estate, with their house attacked and graffiti painted on their windows reading \"Paki Get Out Now - Combat 18 National Front\". Possessed of a volatile temper and a \"fearsome reputation\", King was described by one LVF member as \"more ruthless than Billy Wright\".\nIn 2003 King was the subject of a death threat from the UVF.\nTrial\nIn 2008 he was brought to trial on charges of his involvement in the murder of Martin O'Hagan. Whilst Neil Hyde and fellow Lurgan LVF member Nigel William Leckey were charged with the murder itself, King faced charges of perverting the course of justice by disposing of or concealing the getaway car that had been used in the killing. In July 2010, however, charges against King and his co-defendants were withdrawn, after the evidence of a key prosecution witness was brought into question.\nPersonal life\nIn 2007, during heightening tensions between members of the LVF and leading Belfast dissident loyalist Jackie Mahood, King announced that he had become a born-again Christian and stated that he was distancing himself from his LVF colleagues. It was the second time in three years that King had claimed to have embraced Christianity.\nKing lives in a modest terraced house in the Mourneview area of Lurgan and is the father of two children.\nThere were allegations in 2004 that he had carried on an affair with a female prison warder.\nReferences"
    }
  ]
}