{
  "content": [
    {
      "type": "text",
      "text": "# Robin Leigh-Pemberton, Baron Kingsdown\n\n| image               = Image:Lord Kingsdown.jpg\n| caption             = Lord Kingsdown in the robes of a Knight Companion of the Order of the Garter\n| office              = Governor of the Bank of England\n| term_start          = 1 July 1983\n| term_end            = 30 June 1993\n| predecessor         = Gordon Richardson\n| successor           = Edward George\n| birth_date          =\n| birth_place         =\n| death_date          =\n| death_place         =\n| nationality         = British\n| spouse              =\n| children            = Hon. James Leigh-Pemberton\n| alma_mater          = Trinity College, Oxford\n| profession          = Economist\n| residence           =\n| religion            =\n| signature           =\n| website             =\n| footnotes           =\n| module              =\n| branch              =\n| rank                =\n| serviceyears        = 1945–1948\n| unit                = Grenadier Guards\n}}\n| appointer           = Nigel Lawson\n}}\nRobert \"Robin\" Leigh-Pemberton, Baron Kingsdown (5 January 1927 – 24 November 2013) was a British life peer and banker, who served as Governor of the Bank of England from 1983 to 1993.\nEducation and career\nLeigh-Pemberton was educated at St Peter's Court, then at Eton College. He attended Trinity College, Oxford, graduating in 1950. In 1954, he was called to the Bar, and he practised law for several years before returning to Kent to manage the family estate of Torry Hill. He served as a Justice of the Peace and as Leader of Kent County Council. He eventually became chairman of the National Westminster Bank, then Governor of the Bank of England from 1983 until 1993.\nHonours\nHe was appointed to the Privy Council in 1987, and created a life peer on 14 July 1993, as Baron Kingsdown, of Pemberton in the County of Lancashire. He became a Knight Companion of the Order of the Garter in 1994, and was also the Lord Lieutenant of Kent from 1982 to 2002. Between 1979 and 1992, he served as Honorary Colonel of the Kent and Sharpshooters Yeomanry and between 1977 and 1984 he served as Pro-chancellor of the University of Kent. He also served on the board of directors of the Bank of International Settlements\nPersonal life\nHis family has a long association with Kingsdown and Torry Hill, near Doddington, Kent, where he rebuilt the family mansion in the 1960s. It features a striking view north towards the Isle of Sheppey, the Swale and the Thames estuary. On the grounds of the estate, there is also what is believed to be the only Eton Fives court attached to a private dwelling; it was built in 1925. Lord Kingsdown's father also built a private miniature railway in the 1930s. This still runs for several miles on his estate.\nOne of his sons, James Leigh-Pemberton, continues the family's association with the Duchy of Cornwall (beginning with its Chancellor, the 1st Baron Kingsdown) as Receiver-General. His brother Jeremy Leigh-Pemberton is a Deputy Lieutenant of Kent and is the parish chairman for the neighbouring parish of Wormshill.\nHis younger brother is the opera singer Nigel Douglas.\nArms\nSee also\n* Kingsdown and Torry Hill\n* Delors Committee\nReferences"
    }
  ]
}