{
  "content": [
    {
      "type": "text",
      "text": "# Robotech: Battlecry\n\n|AU|December 16, 2002|EU|February 14, 2003}}GameCube|EU|March 21, 2003}}\n| genre = Third-person shooter\n| modes = Single-player, multiplayer\n| platforms = PlayStation 2, Xbox, GameCube\n}}\nRobotech: Battlecry is a 2002 video game set in the Robotech universe, the first video game successfully released for the franchise. It was developed by Vicious Cycle Software and published by the now-defunct TDK Mediactive, in association with Harmony Gold USA. With a story focused on new characters created for the game and with guest appearances of main characters Rick Hunter, Roy Fokker, Lisa Hayes and a part of one in-game mission directly centered on Lynn Minmei, it somewhat follows the Robotech continuum.\nPlot\nThis game follows this story of aviator ace pilot Jack Archer. After serving as a mercenary in the Global Civil War, flying both with and against Roy Fokker impressed him enough to recommend Jack for the RDF. The early stages of the game cover Jack's final training and his fighting during the Battle of Macross Island, Jack not being close enough to the SDF-1 when it space folds to Pluto and being left behind on Earth, rejoining his friends upon their initial return home. The majority of the game is set in the Post-Rain of Death era and involves Jack and his Wolf Squadron defending various human outposts against Malcontent Zentraedi forces led by the warlord Zeraal.\nThe final mission has Jack going up against Zeraal at his base, which is a crashed Zentraedi Carrier. However, the ship makes a spacefold jump with him on it, and it leads him to a distant region of space. Out of contact with the RDF, he seemingly dies from a lack of energy.\nRelease\nRobotech: Battlecry was released in a stand-alone game version and a more expensive Collectors Edition. The latter came in a silver box with the game and included a packet of 3\" X 5\" cards of character concept art from the game drawn by Tommy Yune, a lenticular card depicting a Veritech fighter in action, a Battlecry T-shirt vacuum packed into a disc-shaped tin with card RDF logo on top, the game's soundtrack on CD and a specially numbered Jack Archer dogtag.\nReception\n| Edge_XBOX = 7/10\n| EGM_PS2 = 8/10\n| EGM_XBOX = 8/10\n| GI_NGC = 8.5/10\n| GI_PS2 = 8.5/10\n| GI_XBOX = 8.5/10\n| GamePro_NGC =\n| GamePro_PS2 =\n| GamePro_XBOX =\n| GSpot_NGC = 6.8/10\n| GSpot_PS2 = 6.8/10\n| GSpot_XBOX = 6.8/10\n| GSpy_NGC =\n| GSpy_PS2 =\n| GSpy_XBOX =\n| GameZone_XBOX = 8.3/10\n| IGN_NGC = 7.8/10\n| IGN_PS2 = 8.2/10\n| IGN_XBOX = 8/10\n| NP_NGC = 3.7/5\n| OPM_PS2 =\n| OXM_XBOX = 8.6/10\n| MC_NGC = 74/100\n| MC_PS2 = 72/100\n| MC_XBOX = 74/100\n}}\nRobotech: Battlecry received \"average\" reviews on all platforms according to the review aggregation website Metacritic. Electronic Gaming Monthly said of the Xbox version, \"It does an incredible job of re-creating the show's fast-paced mech combat by combining slick animation and spot-on controls.\" GameSpot said \"the game suffers from a number of problems that even the most ardent fans of the series will have a hard time overlooking, not the least of which are repetitive missions, sluggish controls, and empty levels.\"\nReferences\nExternal links\n*"
    }
  ]
}