{
  "content": [
    {
      "type": "text",
      "text": "# Robyn Ward\n\n| notable_works      =\n| style              =\n| height             =\n| height_cm          =\n| height_ft          =\n| height_in          =\n| television         =\n| title              =\n| term               =\n| predecessor        =\n| successor          =\n| party              =\n| otherparty         =\n| movement           =\n| opponents          =\n| boards             =\n| criminal_charges   =\n| criminal_penalty   =\n| criminal_status    =\n| spouse             =\n| partner            =\n| children           =\n| parents            =\n| mother             =\n| father             =\n| relatives          =\n| family             =\n| callsign           =\n| awards             =\n| honours            =\n| website            =\n| module             =\n| module2            =\n| module3            =\n| module4            =\n| module5            =\n| module6            =\n| signature          =\n| signature_size     =\n| signature_alt      =\n| footnotes          =\n| image_upright      =\n| landscape          =\n| burial_place       =\n| burial_coordinates =\n}}\nRobyn Ward is an Irish contemporary artist. He uses mixed media on canvas and combines abstract and realist approaches. He is based in Mexico City.\nEarly life and education\nWard was born on 3 October 1982 in Dublin, where he lived for five years before moving to Belfast. In 2019, Ward claimed that Campbell College expelled him aged fifteen and that he spent his teenage years skateboarding and painting graffiti on derelict buildings before adopting a nomadic lifestyle.\nWard left Belfast at age 18 and went on to work in studios in Bangkok, Shanghai, Amsterdam and Mexico City.\nCareer\nWard paints on canvas, using a multi-layered style. He uses a mixed media of acrylics, inks, watercolours, Oil paint and spray paint.\nWard cites Jackson Pollock, Banksy, and Hieronymus Bosch as inspiration for his work. His subject matter comprises personal reflections and socio-political commentary. This has included messages about sustainability, racism and bigotry, and the conflict in Ireland.\nWard has worked under several pseudonym and collectives, but in 2016, he broke his anonymity and has since worked under his birth name.\nIn 2018, the Art Attack Exhibition at the Royal Monceau Gallery in Paris featured Ward's work. In the same year, Ward displayed his artwork in six other exhibitions and solo shows. His solo exhibition 'Once Upon a Time', held in May 2018 at the House of Fine Art in London, combined images of popular children's cartoon characters with reflections on racism and bigotry. For example, one piece depicted Bugs Bunny with a picket sign reading 'no Blacks, no dogs, and no Irish'.\nWard has exhibited at Moniker Art Fair in 2018 and 2019 and as part of the 10th anniversary fair in 2019, he auctioned his work to help fund charities working to preserve endangered species.\nIn 2019, Ward exhibited a series of artworks entitled 'Plastic Nation' that aimed to draw attention to the global environmental crisis. The pieces focused on the impact of the world's consumption of single-use plastics. Ward auctioned some of the artworks from 'Plastic Nation' to raise funds for a non-profit animal welfare charity.\nWard's 2021 exhibition 'Fucked at Birth' depicted destruction, violence, and societal breakdown as a continuation of ‘Plastic Nation’. The exhibition was first held in Mexico City in October 2021, followed by New York, London, Los Angeles and São Paulo.\nIn May 2023, Ward debuted his first solo exhibition in the US, ‘Walking in the Dark,’ at 82 Gansevoort Street in New York.  The exhibition was curated by Shai Baitel, the artistic director of the Modern Art Museum Shanghai (MAM) and featured twenty-two abstract paintings and six freestanding sculptures in a darkened room. This series of works was based on the themes of migration and trauma, inspired by ‘Ward's nomadic lifestyle’.\nAhead of London’s Frieze Art Fair week in October 2023, Ward exhibited ‘Walking in the Dark’ at the Old Sessions House in collaboration with musical artist and member of The Big Pink, Robbie Furze. The exhibition included Ward’s twenty-two abstract paintings and six freestanding sculptures alongside an original composition created by Furze in response to the artworks.\nThe week before the exhibition opened to the public, Ward and Furze hosted a private dinner, auction, and private viewing to raise money for Cancer Research UK.\nWard’s ‘Walking in the Dark’ is currently on display at the Modern Art Museum Shanghai (MAM) from March 2024 as part of their 2024 programme, which includes work from David Hockney and Marina Abramović. The exhibition will remain on view to the public until the end of May 2024.\n‘Walking in the Dark’ is scheduled to be exhibited at Gallery Rosenfeld in Fitzrovia, London, in September 2024 and at The Yarn, a new arts and cultural centre in County Antrim, Northern Ireland, in 2025.\nReferences"
    }
  ]
}