{
  "content": [
    {
      "type": "text",
      "text": "# Rockingham Township, Scott County, Iowa\n\n|subdivision_type1        = State\n|subdivision_name1        =\n|subdivision_type2        = County\n|subdivision_name2        = Scott\n|government_footnotes     =\n|government_type          =\n|leader_title             =\n|leader_name              =\n|leader_title1            =\n|leader_name1             =\n|established_title        =\n|established_date         =\n|area_footnotes           =\n|area_magnitude           =\n|area_total_km2           =\n|area_land_km2            =\n|area_water_km2           =\n|unit_pref                =\n|area_total_sq_mi         =\n|area_land_sq_mi          =\n|area_water_sq_mi         =\n|area_water_percent       =\n|population_as_of         =\n|population_footnotes     =\n|population_total         =\n|population_density_km2   =\n|population_density_sq_mi =\n|timezone                 =\n|utc_offset               =\n|timezone_DST             =\n|utc_offset_DST           =\n|elevation_footnotes      =\n|elevation_m              = 168\n|elevation_ft             = 551\n|coordinates              =\n|postal_code_type         =\n|postal_code              =\n|area_code                =\n|blank_name               =\n|blank_info               =\n|website                  =\n|footnotes                =\n}}\nRockingham Township is a former civil township in Iowa which was laid out in 1836 in Section 8 of Scott County, Iowa, United States, about four miles below the business section of Davenport. The first government surveyors of 1837 note the existence of a town named Rockingham. It was a rival of its eastern neighbor, Davenport, for several years and contested for the county seat.\nThe  of the Township were annexed by, and became a part of, the City of Davenport on January 22, 1958.\nHistory\nThe voters of Scott County were responsible for choosing the county seat in the election of 1838. The newly incorporated city of Rockingham, along with neighboring Davenport, were the competitors. After Davenport had seemingly won, cries of fraud were raised following the election, so another election was held in August. This time Davenport, Rockingham and Winfield (Scott) were the competitors. Davenport, however, offered more land, buildings and cash donations than the other two towns and eventually won by default.\nThe Rockingham Post Office was opened March 11, 1837 and discontinued December 16, 1847 (the same year that the town itself ceased to exist).\nCounty seat dilemma\nIn 1837, shortly after Scott County was formed Rockingham, and rival neighbor Davenport both campaigned to become the county seat. As stated by the Iowa Territory, the city with the most votes at the February 1838 election, would become the county seat. On the eve of the election, Davenporters secured the temporary service of Dubuque laborers so that they could vote in the election. Davenport won the election. Rockingham supporters however, did not like this. They protested the elections to the territorial Governor. The Governor of the territory refused to certify the results of the election. A second election was scheduled for the following August. To avoid another import of voters, the Governor set a sixty-day residency requirement. Both cities proved to be corrupt as the second election drew near. Davenport, was again the victor, by only two votes. A third election was set by the Territorial Legislature for the summer of 1840. As the August election drew nearer, Rockinghamers grew tired of the county seat cause. Antoine LeClaire's $3,000 contribution, and the efforts of other Davenporters were difficult to challenge. Davenport easily won the third election.  To ensure the question of county seat would not arise again, Davenport built the first county courthouse.\nInteresting information\nRockingham Township may have been annexed, but a road in Southwest Davenport (the area where the former township once was) carries its name to this day: Rockingham Road.\nGeography\nThe former Township was located in what is now the far Southwestern portion of Davenport, in the \"corner\" of Interstate 280 and the Rock River.\nDemographics\n|1854| 250\n|1860| 204\n|1870| 281\n|1880| 369\n|1890| 201\n|1895| 350\n|1900| 403\n|1905| 527\n|1910| 833\n|1920| 1416\n|1930| 343\n|1940| 620\n}}\nSee also\nNotes\nBook References\n* Huebinger, Melchior. Atlas of Scott County, Iowa. Davenport, Iowa: Huebinger Pub. Co, 1919. Print.\n* Huebinger, Melchior. Atlas of Scott County, Iowa: Containing Also Maps of the Three Cities Davenport, Rock Island, and Moline, Rock Island Arsenal, Rock Island Rapids and the Hennepin Canal. Davenport, Iowa: Huebinger Pub. Co, 1894. Print.\n*Svendsen, Marlys, \"Davenport A Pictorial History\", (1987) G. Bradley Publishing, INC,\nFurther reading\n* [http://digital.lib.uiowa.edu/cdm/compoundobject/collection/hixson/id/1555/rec/1 Plat book of Scott County, Iowa] on the \"University of Iowa.  Iowa Digital Library\".\n* [http://digital.lib.uiowa.edu/cdm/compoundobject/collection/atlases/show/8861/id/8989 Rockingham Township & Additional Plats] on the \"University of Iowa.  Iowa Digital Library\".\n* [http://digital.lib.uiowa.edu/cdm/compoundobject/collection/atlases/show/6142/id/6182 Rockingham Township] on the \"University of Iowa.  Iowa Digital Library\".\n* [http://digital.lib.uiowa.edu/cdm/compoundobject/collection/atlases/id/8989/rec/13 Rockingham Township & Additional Plats] on the \"University of Iowa.  Iowa Digital Library\".\n* [http://www.statelibraryofiowa.org/cgi-bin/patents/browse/patents.cgi?county_id=163&place_id=2007 Iowa Inventors Database] on the \"State Library of Iowa\".\n* [http://iagenweb.org/scott/rockinghamdir1905.htm Directory of the Leading Farmers of Scott County, Iowa-1905 - Rockingham Township] Scott Co, Iowa USGenWeb Project\n* [http://blogs.davenportlibrary.com/sc/tag/rockingham-township/ Davenport Library blog with Rockingham Township tagged] Davenport Public Library Special Collections blog"
    }
  ]
}