{
  "content": [
    {
      "type": "text",
      "text": "# Rockingham (1785 EIC ship)\n\n{|\n|Ship owner=*EIC voyages 1-2: Sir Richard Hotham\n*EIC voyage 3: Walter Powell\n*EIC voyages 4-7: Robert Wigram.\n|Ship laid down=\n|Ship launched=2 November 1785\n|Ship acquired=\n|Ship commissioned=\n|Ship decommissioned=\n|Ship in service=\n|Ship out of service=\n|Ship renamed=\n|Ship struck=\n|Ship reinstated=\n|Ship honours=\n|Ship captured=\n|Ship fate=Sold 1802\n|Ship notes=\n}}\n}}\n(bm)\n|Ship length=*Overall:\n*Keel: (keel)\n|Ship beam=\n|Ship draught=\n|Ship hold depth=\n|Ship sail plan=Full-rigged ship\n|Ship propulsion=\n|Ship complement=*1794:99\n*1798:99\n*1800:72\n|Ship armament=*1794: 26 × 9&4-pounder guns\n*1798:26 × 9&4-pounder guns\n*1800:26 × 9&4-pounder guns\n|Ship notes=Three decks\n}}\n|}\nRockingham was launched as an East Indiaman in 1785. She made seven voyages for the British East India Company (EIC) between 1786 and 1802 before she was sold for breaking up.\nCareer\nEIC voyage #1 (1786-1787)\nCaptain John Atkinson Blanshard sailed from The Downs on 13 March 1786, bound for Bombay. Rockingham reached São Tiago on 13 April and arrived at Bombay on 19 July. She visited Surat on 27 October, returned to Bombay on 8 November, visited Tellicherry on 26 November, and returned to Bombay on 7 December. She was expected to return to England on 18 February 1787. On her way home she reached St Helena on 8 June and arrived at The Downs on 12 August.\nEIC voyage #2 (1789-1790)\nCaptain Blanshard sailed from The Downs on 3 January 1789, bound for Madras and China. Rockingham reached São Tiago on 27 January, and Madras on 2 June.  She was at Penang on 9 August and arrived at Whampoa Anchorage on 22 September.  Homeward bound, she crossed the Second Bar on 3 January 1790, reached St Helena on 15 March, and arrived at The Downs on 21 May.\nEIC voyage #3 (1792-1793)\nCaptain Blanshard sailed from the Downs on 2 January 1792, bound for Bombay and China. Rockingham reached Bombay on 23 May, and arrived at Whampoa on 21 September. She crossed the Second Bar on 26 November, reached St Helena on 24 March 1793, and arrived at the Portsmouth on 9 June.\nEIC voyage #4 (1794-1795)\nWar with France had broken out in 1793. Captain the Honourable Hugh Lindsay acquired a letter of marque on 3 January 1794.\nThe British government held Rockingham at Portsmouth, together with a number of other Indiamen in anticipation of using them as transports for an attack on Île de France (Mauritius). It gave up the plan and released the vessels in May 1794. It paid £2,687 10s for having delayed her departure by 129 days.\nCaptain Lindsay sailed from Portsmouth on 2 May, bound for Madras and Bengal. Rockingham reached Madras on 3 September, and arrived at Diamond Harbour on 22 September. Homeward bound, she was at Saugor on 28 January 1795, Madras on 26 March, and St Helena on 13 August. On 3 September she sailed from St Helena. She sailed together with , , and , and a number of other vessels, all under the escort of . Rockingham arrived at Portsmouth on 19 November.\nEIC voyage #5 (1796-1797)\nCaptain Lindsay sailed from Portsmouth on 27 June 1796, bound for Madras. Rockingham reached the Cape of Good Hope on 19 September and arrived at Madras on 9 January 1797. Homeward bound, she was at Trincomalee on 11 April and Simons Bay on 12 July. She reached St Helena on 11 September and arrived at The Downs on 14 December.\nEIC voyage #6 (1798-1799)\nCaptain Edward Harriman acquired a letter of marque on 23 March 1798. He sailed from Portsmouth on 8 June, bound for Bombay, which he reached on 21 September. Rockingham visited Cannanore on 13 November, before returning to  Bombay on 30 December. On her homeward voyage she was at Sr Helena on 1 May 1799 and arrived at The Downs on 13 July.\nEIC voyage #7 (1800-1802)\nCaptain Thomas Butler (or Butter) acquired a letter of marque on 10 April 1800. He sailed from Torbay on 27 May, bound for Madras and Bombay. Rockingham arrived at Madras on 5 December, and Bombay on 2 April 1801. In Bombay, the Government engaged Rockingham'' as a storeship supporting Major-General Sir David Baird's expedition to the Red Sea and then Egypt to help General Ralph Abercromby expel the French there.\nBy 16 May Rockingham was at Mokha. At 8pm on 8 June, Rockingham grounded on a shoal in the Red Sea. The shoal was about 11 leagues —  — from the coast and its southern point was at ; the British thereafter called the shoal \"Rockingham Shoal\". Rockingham received great damage, had to be towed off, and by 22 June she was at Jiddah, which is about  north-northwest of the shoal. A letter from Jeddah dated 24 June reported that Rockingham had struck on a sunken rock and would have to return to Bombay for repairs. She returned to Mokha on 14 August.\nRockingham left Bombay on 15 November bound for Anjengo and Mahé. She was in company with several other Indiamen: Fort William, Worcester, , Lord Hawkesbury, and . Rockingham reached Tellicherry on 23 November and Cochin by 31 December. By 4 January 1802 Rockingham was at Anjengo. She reached St Helena by 5 April and The Downs by 8 June.\nFate\nAfter her return, Rockingham was sold for breaking up.\nCitations\nReferences\n*\n*Horsburgh, James (1836) India Directory, Or, Directions for Sailing to and from the East Indies, China, Australia, Cape of Good Hope, Brazil, and the Interjacent Ports''. (W. H. Allen)."
    }
  ]
}