{
  "content": [
    {
      "type": "text",
      "text": "# Rockingham County, North Carolina\n\n| population_density_sq_mi = 161.05\n| coordinates          =\n| web                  = www.rockinghamcountync.gov\n| district             = 5th\n| time zone            = Eastern\n| motto                = \"You're in a good place\"\n| logo                 = Rockingham County Logo.png\n| nickname             = North Carolina's North Star\n}}\nRockingham County is a county located in the U.S. state of North Carolina. As of the 2020 census, the population was 91,096. Its county seat is Wentworth. The county is known as \"North Carolina's North Star\".\nHistory\nSettling and founding\nsurveyed the eventual county and dubbed the area the \"Land of Eden\".]]\nPrior to European colonization, the area eventually comprising Rockingham County was inhabited by Cheraw/Saura Native Americans. In the 1600s they inhabited several small settlements along the Dan River, though around 1710 they migrated towards South Carolina. Between 1728 and 1733, the Dan River Valley in the Granville District was surveyed by William Byrd II as part of efforts to delineate the North Carolina-Virginia border. He soon thereafter purchased 20,000 acres of the land, which he described as the \"Land of Eden\" to attract prospective farmers. The region's first white settlers came from Pennsylvania, New Jersey, Maryland, and Virginia and were of German, English, Scottish, and Irish descent. Some had wealthy backgrounds, but most were poor. Some local white men served in militias during the American Revolutionary War. American troops under General Nathanael Greene and British troops under General Charles Cornwallis moved through the area around the time of the Battle of Guilford Court House in 1781.\nThe North Carolina General Assembly created Rockingham County from a northern portion of Guilford County on December 29, 1785. It was named for Charles Watson-Wentworth, 2nd Marquess of Rockingham, British Prime Minister from 1765 to 1766 and again in 1782. Rockingham's administration was dominated by the American issue. Rockingham wished for repeal of the Stamp Act 1765 and won a Commons vote on the repeal resolution by 275 to 167 in 1766. Settlement, mostly by Scotch-Irish Americans, continued from 1785 up until 1800.\nRockingham County's first court session was convened near Eagle Falls south of the Dan River in February 1786. The following year a wooden courthouse was erected near the center of the county and the community of Rockingham Courthouse was established. The community was renamed Wentworth in 1798, and county court sessions was held there beginning the following May. A new brick courthouse was built in 1824. Wentworth remained a poor and sparse community well into the early 1800s, sustained only by business related to governmental affairs. Leaksville was established in 1795 in an attempt to build a trading community near the confluence of the Dan and Smith rivers.\nAntebellum and Civil War\nBy the early 1800s, economic activity in Rockingham County was largely centered around small farms in hilly areas and a handful of plantations near the rivers. Most farmers were engaged in subsistence operations, with tobacco planted as the area's primary cash crop. The economy began to diversify after 1812. In 1813, John Motley Morehead erected the county's first cotton mill at the confluence of the Dan and Smith rivers in Leaksville. In 1818 the town of Madison was platted and the trading post of Jackson was established at Eagle Falls. By 1831, Leaksville hosted an oil mill, sawmill, and cotton gin. Nevertheless, throughout most of the 1800s, tobacco was the main source of economic activity in Rockingham County, with the towns of Madison, Leaksville, and Reidsville serving as market towns for the crop. Following the passage of public school legislation, in 1840 the first public school in North Carolina opened in Rockingham County. A tobacco manufacturing facility was opened in Reidsville in 1856, and by 1859, Madison was home to several industries. That year Leaksville was linked with Danville, Virginia by railroad, the first such line in the county. Slavery grew gradually in the county with the expansion of tobacco operations and, by the 1860s, 37 percent of the population were enslaved.\nAt the outbreak of the American Civil War in 1861, some county men enlisted in the Confederate States Army. Rockingham men eventually formed three companies in North Carolina's 13th Regiment, one in the 14th Regiment, one in the 21st Regiment, six in the 45th Regiment, one in the 63rd Regiment/5th Cavalry, and some reserves, to serve in the war. Rockingham men also formed the 22nd Battalion of the Confederate Home Guard, which was tasked with maintaining order in the county. The local Searcy & Moore gun factory supplied Confederate forces with weapons during the conflict. Some Confederate deserters hid out in the sparse northwestern section of the county during the war, two of whom were found and executed by the Home Guard. At the initiative of the Confederate government, a railroad was built to connect Reidsville with Danville and Greensboro, being completed in May 1864. The war ended in the defeat of the Confederacy in 1865.\nReconstruction and industrialization\nBy the end of the Civil War, the economy of Rockingham County and the Southern United States as a whole was greatly diminished. Cattle were scarce, and the emancipation of slaves severely harmed the prospects of large planters. A New York journalist traveling through Rockingham County in September 1865 reported food and lodging scarce in the area. In the 1868 elections, Republicans gained control of the county government and a black man was elected to the county commission. The white supremacist Ku Klux Klan became active in 1868 and 1869, and 20 alleged Klansmen were arrested and tried for crimes in the county court, though none were convicted. Following investigations by the federal government and a denunciation from David Settle Reid, a widely respected Rockingham Democrat and former governor, Klan activity diminished in 1870.\nIn the years after the war, Reidsville rapidly grew as a tobacco manufacturing center with the industry benefitting from the railway completed during the war. Leaksville, having grown to include 7,500 residents, was incorporated in 1874. The town of Stoneville grew from a mercantile crossroads in the west and was incorporated in 1877. Rail service was extended to Madison in the 1880s. Stoneville and Madison largely remained mercantile towns with a few tobacco manufacturers.\nThe manufacturing sector, particularly in textiles, increased in the late 1800s, driving urbanization and growth in the county's towns. At the initiative of railroad executive Francis Henry Fries, in 1895 the Mayo Mills were built in the western portion of the county, near Madison. A community quickly grew around the facility and was incorporated as the town of Mayodan in 1899. That year, another mill was erected in what became the town of Avalon in 1899. At the time of its construction, the Avalon Mill was the largest textile manufacturing plant in the state. The Avalon Mill burned down in 1911, and the rest of the community was integrated into Mayodan. By 1920, the textile operations in the area had consolidated in the latter town as the Washington Mills, making Mayodan the center of western Rockingham's textile industry.\nMeanwhile, James Turner Morehead inherited John Motley Morehead's holdings in Leaksville in 1866. He focused on expanding industry in the area, creating the Spray Water Power and Land Company to develop his mills, and supporting the laying of new railroads. By the 1890s, Morehead had grouped his textile holdings into two companies, the Leaksville Cotton and Woolen Mill Company and the Spray Water Power and Land Company, and turned them over to his son-in-law, Frank Mebane. Under Mebane's direction and with the backing of northern investors, the Spray Water Power and Land Company, between 1898 and 1906, built six new cotton mills and created a warehouse company. The expansion of the textile industry led to the growth of two new mill communities in the vicinity of Leaksville, Spray and Draper. The three communities collectively became known as the \"Tri-Cities\". One of Mebane's holdings, the Spray Cotton Mills company, was sold to a private owner in 1897. Most of the rest were taken over by Marshall Field & Company in 1911 and 1912 after Mebane overextended his credit.\n20th century\nplant in Reidsville c. 1937]]\nIn October 1906, the county courthouse in Wentworth was destroyed in a fire. The conflagration occurred during a years-long dispute between the citizens of Reidsville, who wanted to move the county seat to their city, and residents from other areas of the county, who were opposed to its relocation. The debate continued for several months until the county commission voted to rebuild the courthouse in Wentworth. The new building was completed in 1908. Economic differences between the tobacco-heavy Reidsville area and the textile-based Leaksville-Draper-Spray area also created political fault lines during the early 20th century. Social, political, and economic rivalries also emerged between Reidsville, Leaksville-Draper-Spray, and the western Rockingham towns of Madison, Mayodan, and Stoneville.\nThe Penn Brothers Tobacco Company plant in Reidsville came under the control of the American Tobacco Company in 1911. Under American Tobacco's control, the factory quickly rose to become Reidsville's most significant industry and the county's largest taxpayer. Offering high wages to workers, in the 1940s and 1950s it served as its corporate owner's flagship facility and peaked with the employment of 2,000 workers. Draper was incorporated in 1949, followed by Spray two years later. In 1953, Marshall Field & Company transferred its Rockingham textile holdings to a new company, Fieldcrest. In September 1967, the towns of Leaksville, Draper, Spray were consolidated into the new city of Eden. The consolidation led Eden to surpass Reidsville as the county's largest city. In 1978, Miller Brewing Company invested millions in opening a brewery in Eden, and it quickly became a major, high-paying employer.\nEconomic decline\nThe textile industry struggled nationally in the 1980s and 1990s. Fieldcrest Cannon, the successor to Fieldcrest, was acquired by Pillowtex in the late 1990s and laid off hundreds of corporate staff in Eden. Stoneville's major employer, a furniture factory, filed for bankruptcy in 1990. In March 1998, an EF3 tornado occurred in Rockingham County, the strongest storm on-record to ever impact the area. The tornado damaged homes and a textile mill in Mayodan, destroyed several buildings in Stoneville's main business district, and killed two people. In 1999, the former Washington Mills plant in Mayodan closed. Pluma closed its Eden plant in 1999, Spray Cotton Mills closed its yarn mill in 2001, and Pillowtex collapsed in 2003. Some former workers moved to larger cities outside the county in search of jobs.\nThe decline of textiles left Miller's facility Eden's flagship industry, but it announced its closure in 2015. The loss of the brewery and the textile mills had a knock-off effect on local retail stores, many of which closed due to the loss of customers and competition from national chains such as Walmart. The American Tobacco Company plant in Reidsville underwent ownership changes and layoffs in the 1990s before closing in early 2020.\n21st century\nIn 2011, a new courthouse, the Rockingham County Justice Center, was opened in Wentworth, while the former courthouse was transformed into a museum and historical archive.\nIn February 2014, a coal ash pond in Eden at Duke Power's Dan River Steam Station spilled into the Dan River.\nGeography\nAccording to the U.S. Census Bureau, the county has a total area of , of which  is land and  (1.24%) is water. It is bordered by the North Carolina counties of Caswell, Alamance, Guilford, Forsyth, and Stokes, and the Virginia counties of Henry and Pittsylvania. Much of the soil in the county is sandy loam.\nRockingham County is situated in the foothills of the Blue Ridge Mountains in the Piedmont Triad region.\nRockingham County is crossed by four major rivers. The Dan, Mayo, and Smith Rivers are concentrated in the northwestern portion of the county and feed into the Roanoke River drainage basin. The Haw River in the southeastern portion feeds into the Cape Fear River basin. The county also hosts several creeks, including Matrimony, Cascade, Hogans, County Line, Troublesome, and Little Troublesome. There are also two major lakes, Belews Lake and Lake Reidsville.\nState and local protected areas\n* Courtland Park and Bird Sanctuary\n* Dan River Game Land\n* Haw River State Park (part)\n* Knight Brown Nature Preserve\n* Mayo River State Park\n* Woodland Community Park\nDemographics\n2020 census\n{| class=\"wikitable\" style=\"text-align:right\"\n|+Rockingham County racial composition\n!scope=\"col\"| Race\n!scope=\"col\"| Number\n!scope=\"col\"| Percentage\n|-\n!scope=\"row\"| White (non-Hispanic)\n| 64,218\n| 70.49%\n|-\n!scope=\"row\"| Black or African American (non-Hispanic)\n| 16,611\n| 18.23%\n|-\n!scope=\"row\"| Native American\n| 282\n| 0.31%\n|-\n!scope=\"row\"| Asian\n| 493\n| 0.54%\n|-\n!scope=\"row\"| Pacific Islander\n| 29\n| 0.03%\n|-\n!scope=\"row\"| Other/Mixed\n| 3,377\n| 3.71%\n|-\n!scope=\"row\"| Hispanic or Latino\n| 6,086\n| 6.68%\n|}\nAs of the 2020 census, there were 91,096 people,\n|align-fn=center\n|footnote=U.S. Decennial Census1790–1960 1900–19901990–2000 2010 2020\n}}\n|}\nThe county's population has been stagnant since the 1980s. According to Woods & Poole Economics, the county's population is expected to increase at a slower rate than the rest of the state in future decades.\nGovernment and politics\nGovernment\nRockingham County is governed by a five-member board of commissioners, each elected to four-year terms. The board elects a chairman and vice-chairman from its members and appoints a county manager. County voters also elect a register of deeds.\nRockingham County is a member of the Piedmont Triad Council of Governments, a regional voluntary association of 12 counties, and the Piedmont Triad Regional Partnership, a regional economic development organization. The county also has its own Soil and Water Conservation District led by an elected supervisor. Rockingham County is located in North Carolina's 6th congressional district, the North Carolina Senate's 26th district, and the North Carolina House of Representatives' 65th district.\nLaw enforcement and judicial system\nRockingham County lies within the bounds of North Carolina's 22nd Prosecutorial District, the 17A Superior Court District, and the 17A District Court District. County voters elect a clerk of Superior Court and a sheriff.\nPolitics\n{| role=\"presentation\"\n|\n|-\n| }}\n|}\nIn the early 1990s, Rockingham was a swing county. Politically, the area is conservative. In recent years, voters in most of the county have favored Republicans, though Democrats retain some electoral strength in the city of Reidsville. As of November 2022, the county hosted over 61,684 registered voters. Republicans won all county elections in 2022.\nEconomy\nHistorically, Rockingham County's economy was largely based around textiles and tobacco. Textiles was largely based in the north of the county around Eden, while tobacco was centered in the south, particularly around Reidsville. The decline of these heritage industries in the 1990s hurt the county's economy. The county has experienced growth in recent years in tourism, manufacturing, and the creation of additional small businesses. Major employers in the county include the government, healthcare facilities, textile manufacturers such as Unifi and Gildan Yarns, firearms manufacturer Sturm, Ruger & Co., and Walmart.\nRockingham has a poverty rate of 18 percent, above state and national averages. According to the American Community Survey, from 2017 to 2021 the estimated median household income was $46,993. For 2023, the North Carolina Department of Commerce rated the county as economically distressed. In December 2023, the county reported an unemployment rate of 3.5 percent.\nTransportation\nRockingham County is traversed by several major highways which constitute local transportation corridors: U.S. Route 220/Interstate 73, U.S. Route 158, U.S. Route 29/Interstate 785, and U.S. Route 311. Active rail lines serve Eden, Reidsville, Stoneville, Madison, and Mayodan. Airplane facilities are provided by the Rockingham County NC Shiloh Airport.\nMajor highways\n*  (small designated section from Exit 123 to the Guilford County line)\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\nEducation\nPublic education is provided by Rockingham County Schools, which operates 12 elementary schools, four middle schools, four high schools, an early college high school, and an alternative school. The system is led by a school board elected in partisan contests. There is one post-primary institution, Rockingham Community College, located in Wentworth. According to the 2021 American Community Survey, an estimated 14.5 percent of county residents have attained a bachelor's degree or higher level of education.\nHealthcare\nRockingham County is served by two hospitals, Annie Penn Hospital in Reidsville and UNC Rockingham Health Care in Eden. According to the 2021 American Community Survey, an estimated 11.2 percent of county residents lack healthcare coverage. The 2023 University of Wisconsin Population Health Institute's County Health Rankings report found that Rockingham was less healthy than most of the state, with higher average instances of adult smoking, adult obesity, excessive drinking, and several chronic medical conditions.\nCulture\nAttractions in Rockingham County include the state parks of the Dan and Mayo rivers, near Mayodan; the historic downtown areas of Leaksville, Draper and Spray in Eden; the Chinqua-Penn Plantation in Reidsville; the Deep Springs Plantation in Stoneville,\nHigh Rock Farm in Williamsburg, Mulberry Island Plantation in Stoneville, and the historic Penn House, located in Reidsville. One of the most famous attractions of the Reidsville area is Lake Reidsville. Various historic shops are found in the county, as well.\nThe Museum & Archives of Rockingham County ([http://www.themarconline.org the MARC]) is the only county historical museum and is located in the Rockingham County Courthouse in Wentworth, the county seat since 1787. The museum features exhibits and artifacts related to Rockingham County history as well as including the restored historic 1816 Wright Tavern (also historically known as Reid House or Reid Hotel) opposite the museum and 1910 Old Jail next door.\nIn the early 20th century, Rockingham's mill workers produced a substantial amount of old-time music. Hunting has long been popular in the county.\nCommunities\nCities\n* Eden (largest community)\n* Reidsville\nTowns\n* Madison\n* Mayodan\n* Stokesdale (mostly in Guilford County)\n* Stoneville\n* Wentworth (county seat)\nTownships\n* Huntsville\n* Leaksville\n* Madison\n* Mayo\n* New Bethel\n* Price\n* Reidsville\n* Ruffin\n* Simpsonville\n* Stoneville\n* Wentworth\n* Williamsburg\nCensus-designated place\n* Ruffin\nUnincorporated communities\n* Bethany\n* Monroeton\n* Oregon Hill\n* Price\n* Providence\nSee also\n* List of counties in North Carolina\n* National Register of Historic Places listings in Rockingham County, North Carolina\n* Haw River Valley AVA, wine region partially located in the county\nReferences\nWorks cited\n*\n*\n*\n* }}\n*\n*\n*\n*\n*\n*\nExternal links\n*\n*\n* [http://www.ncgenweb.us/rockingham/ NCGenWeb Rockingham County], genealogy resources for the county"
    }
  ]
}