{
  "content": [
    {
      "type": "text",
      "text": "# Rod Macqueen__disambig_1\n\n}}\n| fullname        = Roderick Ian Macqueen\n| birth_date      =\n| birth_place     = Sydney\n| height          =\n| weight          =\n| ru_position     =\n| amatyears1      =\n| amatteam1       =\n| years1          =\n| clubs1          =\n| apps1           =\n| points1         =\n| superyears1     =\n| super1          =\n| superapps1      =\n| superpoints1    =\n| provinceyears1  =\n| province1       =\n| provinceapps1   =\n| provincepoints1 =\n| repyears1       =\n| repteam1        =\n| repcaps1        =\n| reppoints1      =\n| repsevensyears1 =\n| repsevensteam1  =\n| repsevenscomp1  =\n| coachyears1     = 1997-2001\n| coachyears2     = 1991-1992\n| coachyears3     =\n| coachyears4     = 2010-2011\n| coachteams1     = Australia\n| coachteams2     = Waratahs\n| coachteams3     = Brumbies\n| coachteams4     = Rebels\n}}\nRoderick Ian Macqueen, AM is an Australian former rugby union coach. He coached Australia at the Rugby World Cup, and the Waratahs, Brumbies and Rebels in the Super Rugby competition.\nCareer\nOne of Macqueen's first major coaching positions was at the Waratahs, where he was present from 1991 to 1992. In 1992 he was also a selector for the Australian team. He went on to coach the Australian XV in 1995 and again acted as a selector 1994–95. Following the inception of Super 12, Macqueen became the coach of the Brumbies.\nMacqueen was appointed the head coach of the Wallabies in September 1997, and would coach them until 2001. He led the Wallabies to victory at the 1999 Rugby World Cup in Wales, where they defeated France in the final, becoming the first nation to ever win the World Cup twice. The following year Australia won the Tri Nations Series for the first time.\nHe retired from the game after guiding the Wallabies to a victory over the highly rated 2001 Lions side captained by Martin Johnson. He finished his career as the Australian coach with a test match winning record of just below 80%.\nMelbourne Rebels\nIn 2010 Macqueen came out of retirement and was presented as the first coach and director of rugby to the newly formed Melbourne Rebels, the fifteenth team in the expanded Super Rugby competition. He stepped aside at the end of the 2011 Super Rugby season, and was succeeded by his former assistant Damien Hill.\nHonours\nMacqueen received an Australian Sports Medal in 2000, was inducted into the Sport Australia Hall of Fame in 2001. and was made a Member of the Order of Australia (AM) in the 2003 Australia Day Honours \"for service to sport, particularly Rugby Union football as coach of the Australian Wallabies.\" In 2004 he was awarded the Joe French Award, which recognizes outstanding service to the Australian Rugby Union. Macqueen was inducted into the IRB Hall of Fame in October 2011, alongside all other Rugby World Cup-winning head coaches and captains through the 2007 edition.\nReferences\nExternal links\n*\nBernard Laporte|years=2001}}"
    }
  ]
}