{
  "content": [
    {
      "type": "text",
      "text": "# Rodovia Presidente Dutra\n\n|direction_a    = East\n|terminus_a     = Avenida Brasil in Vista Alegre, Rio de Janeiro, RJ\n|direction_b    = West\n|terminus_b     = Marginal Tietê in Vila Maria, São Paulo, SP\n|system         =\n|previous_route =\n|browse         =\n|previous_type  =\n|browse_route   =\n|next_type      =\n|next_route     =\n|previous_dab   =\n|next_dab       =\n}}\nThe Rodovia Presidente Dutra, (BR-116 &ndash; or SP-060 in the state of São Paulo), colloquially known as Via Dutra is a federal highway which runs through the eastern part of the state of São Paulo and southwestern region of the state of Rio de Janeiro. It is the part of the route BR-116 connecting the city of São Paulo to the city of Rio de Janeiro.\nMajor cities connected by this part of the BR-116 are the city of São Paulo, Jacareí, São José dos Campos, Taubaté, Caçapava, Pindamonhangaba, Guaratinguetá, Resende, Barra Mansa, Volta Redonda and the city of Rio de Janeiro.\nIt covers a total distance of , starting at the Trevo das Margaridas in Rio de Janeiro and ending at the junction with Marginal Tietê in São Paulo. It merges with Rodovia Ayrton Senna in the county of Guararema and has junctions with the Rodovia Fernão Dias, the BR-354 and the BR-459. The highway largely follows the Paraíba do Sul river valley.\nThe Via Dutra is considered the most important Brazilian highway since it connects the two biggest and most important cities of Brazil and runs through one of the richest regions of the country, the Paraíba Valley. It is also the most important connection between the Southern Region and the Northeast Region. It is named after former Brazilian president Eurico Gaspar Dutra, who inaugurated the highway.\nHistory\nThe first road between the city of São Paulo and the city of Rio de Janeiro was built by the Washington Luis government and inaugurated on Saturday, 5 May 1928.\nAt the end of the 1940s industrialization and the necessity of a faster, safer and more efficient and modern road connection of the two biggest Brazilian cities led to the construction of the Rodovia Presidente Dutra as it is known today. It was inaugurated on Friday, 19 January 1951, by the President Eurico Gaspar Dutra and called BR-2. It was a two-lane road with exception of the stretches between São Paulo and Guarulhos and in the Baixada Fluminense where it was a four-lane dual carriageway.\nIn the 1960s it had various stretches converted to four-lane divided road. In 1967 it was fully converted to four-lane highway status.\nIn the 1970s traffic has been eased on the Via Dutra due to the construction of the Rodovia dos Trabalhadores, now called Rodovia Ayrton Senna and its part built in the 1990s called Rodovia Governador Carvalho Pinto leading up to Taubaté.\nThe highway is managed and maintained by a state concession to the private company NovaDutra S/A since March 1996, and therefore is a toll road. From that transfer of ownership up to today it has largely improved in road quality and safety.\nSee also\n* Highway system of São Paulo\n* Brazilian Highway System\nReferences\nExternal links\n* [http://www.novadutra.com.br/concessionaria/home/ NovaDutra S/A]"
    }
  ]
}