{
  "content": [
    {
      "type": "text",
      "text": "# Roger Pulwarty\n\nin 2019]]\nRoger S. Pulwarty (born March 14, 1960) is a U.S. scientist of Trinidad and Tobago origin and has contributed to major national and international scientific assessments including the Intergovernmental Panel on Climate Change (IPCC). Pulwarty is the Senior Scientist in the National Oceanic and Atmospheric Administration (NOAA) Physical Sciences Laboratory in Boulder, Colorado.\nRoger Pulwarty earned a B.S. degree (Hons.) in Atmospheric Sciences from York University in Toronto in 1986 and a Ph.D. in Climatology from the University of Colorado at Boulder in 1994, where he worked under Professors Roger Barry and Herbert Riehl. His research and publications focus on weather, water, and climate science, and impacts and adaptation in the U.S., Latin America and the Caribbean. In addition, he has helped design and lead landmark interdisciplinary programs addressing science, applications, and services including the NOAA Regional Integrated Sciences and Assessments (RISA), the U.S. National Integrated Drought Information System (NIDIS), and the Inter-American Institute Collaborative Research Network on Eastern Pacific Boundary Currents. He is the co-editor of Hurricanes: Climate and Socio-economic Impacts” (Springer, reissued 2012), “Drought and Water Crises” (CRC Press 2017), and “Droughts: from Risk to Resilience” (UN Press, 2021). Pulwarty is Professor Adjunct at the University of Colorado at Boulder and the University of the West Indies.\nPulwarty served as a convening lead author on the 2014 IPCC Working Group II on Impacts, Adaptation and Vulnerability, lead author on the 2007 IPCC Working Group II, on the IPCC 2008 Technical Report on Climate Change and Water and the 2012 Special Report on Extremes. He has also served on the UN Office for Disaster Risk Reduction Global Assessment Reports (2011;2019;2021;2023;2024) including co-leading the landmark UNDRR Special Report on Drought, the UN Convention to Combat Desertification, and on National Assessments of the US Global Research Program. Pulwarty serves on Committees of the U.S. National Academy of Sciences, the International Science Council, and the World Meteorological Organization, among others. He has provided testimonies before the U.S. Congress on weather and climate extremes, water resources and adaptation, and invited keynotes before the President of the UN General Assembly, the World Water Forum, the Adaptation Forum, and the Pontifical Sciences Academy, among others. Pulwarty acts in advisory roles on extreme event science (such as for droughts, hurricanes, and floods), early warning information systems, and disaster risk management to several U.S. and international interests including the Western Governors Association, the Mississippi River Cities and Towns Initiative, State and Federal Agencies, the Red Cross/Red Crescent, the CARICOM (Caribbean Economic Community), the Organization of American States, the UNDP and the World and InterAmerican Development Banks. He is a Fellow of the American Meteorological Society (AMS), the American Geophysical Union (AGU), and an Honorary Diplomate of the European Academy of Water Resources Engineers and Scientists. Pulwarty's contributions on integrating science into decisionmaking, have been featured in several media communications, including the Atlantic, the BBC, and Forbes, among others. In addition, his work has been awarded for its exceptional scientific and societal impact by NOAA, the Department of Commerce, with the AGU Gilbert F. White and the Science Ambassador Awards, the U.S. Presidential Rank Award, and the Trinidad and Tobago National Institute for Higher Education Research, Science, and Technology Gold Medal.\nReferences\nExternal links\n* [https://www.psl.noaa.gov/people/roger.pulwarty/ Roger Pulwarty: NOAA Physical Sciences Laboratory]"
    }
  ]
}