{
  "content": [
    {
      "type": "text",
      "text": "# Roger B. Taney Monument (Annapolis)\n\n-->\n| completion_date    =\n| catalogue          =\n| medium             =\n| movement           =\n| subject            =\n| height_metric      =\n| width_metric       =\n| length_metric      =\n| diameter_metric    =\n| height_imperial    =\n| width_imperial     =\n| length_imperial    =\n| diameter_imperial  =\n| dimensions         =\n| dimensions_ref     =\n| metric_unit        = cm\n| imperial_unit      = in\n| weight             =\n| designation        =\n| condition          =\n| museum             =\n| city               =\n| coordinates        =\n| mapframe           = yes\n| mapframe-zoom      = 13\n| owner              =\n| accession          =\n| preceded_by        =\n| followed_by        =\n| module             =\n| website            =\n}}\nThe Roger B. Taney Monument is a statue of Roger Brooke Taney (1777–1864),  fifth Chief Justice of the United States, that formerly stood on the grounds of the Maryland State House in Annapolis. Mounting opposition to the monument, as a commemoration of the author of the Dred Scott decision supporting slavery and denying citizenship to African Americans, led to the statue's removal in 2017.\nDescription and history\nTaney's memorial statue was installed in Annapolis, Maryland, on the east front / original side of the historic Maryland State House grounds surrounded by State Circle. The sculpture was created by William Henry Rinehart (1825-1874), who died only two years after completing the work. It was unveiled on December 10, 1872, eight years after Chief Justice Taney's death in 1864. The sculpture, made of bronze on a granite stone pedestal, was commissioned by the state legislature, the General Assembly of Maryland.\nRemoval from State House grounds\nOpposition mounted to the presence of the monument commemorating the author of the U.S. Supreme Court's Dred Scott decision, which upheld slavery and found that African Americans could not be citizens. In August 2017, the Speaker of the Maryland House of Delegates, Michael E. Busch, a Democrat, and the Governor of Maryland, Larry Hogan, a Republican, each called for the statue's removal, after 142 years, from the State House grounds. On August 16, 2017, a majority of the members of the Maryland State House Trust voted to move the statue from the State House grounds to storage.\nThe statue was removed on August 18, 2017. It was placed in the Maryland State Archives' Rolling Run storage facility.\nSee also\n* Roger B. Taney Monument (Baltimore)\nReferences"
    }
  ]
}