{
  "content": [
    {
      "type": "text",
      "text": "# ROH/NJPW War of the Worlds (2018)\n\nNight 2:Toronto, Ontario, CanadaNight 3:Royal Oak, Michigan, U.S.Night 4:Villa Park, Illinois, U.S.\n|lastevent= Supercard of Honor XII\n|nextevent= Best in the World\n|event      = War of the Worlds\n|lastevent2 = War of the Worlds UK\n|nextevent2 = 2019\n}}\nWar of the Worlds Tour was a professional wrestling tour that was co-produced by Ring of Honor (ROH) and New Japan Pro-Wrestling (NJPW).\nProduction\n{| class=wikitable style=\"font-size:90%; margin: 0.5em 0 0.5em 1em; float: right; clear: right;\"\n|+Other on-screen personnel\n|-\n!Role:\n!Name:\n|-\n|rowspan=3|Commentators\n|Kevin Kelly\n|-\n|Steve Corino\n|-\n|Nigel McGuinness\n|-\n|rowspan=1|Ring announcers\n|Bobby Cruise\n|-\n|rowspan=5|Referees\n|Brian Gorie\n|-\n|Marty Asami\n|-\n|Paul Turner\n|-\n|Tiger Hattori\n|-\n|Todd Sinclair\n|-\n|}\nBackground\nIn 2014, NJPW and ROH formally forged a relationship, which saw them present the first War of the Worlds show on May 17, 2014, at the Hammerstein Ballroom in New York City, New York. The following year, War of the Worlds was held over two days at the 2300 Arena in Philadelphia, Pennsylvania, and in 2016 it was expanded to a three-show tour with shows taking place in Dearborn, Michigan, Toronto, Ontario, and New York City. The 2017 War of the Worlds tour was held from May 7 to 14.\nIn February 2018,  NJPW and ROH announced War of the Worlds Tour, a four-show collaborative tour taking place in Lowell, Massachusetts, Toronto, Ontario, Royal Oak, Michigan, and Villa Park, Illinois.\nStorylines\nWar of the Worlds Tour will feature professional wrestling matches that involve different wrestlers from pre-existing scripted feuds and storylines. Wrestlers will portray villains, heroes, or less distinguishable characters in the scripted events that will build tension and culminate in a wrestling match or a series of matches.\nResults\nNight 1\n|match1= The Briscoes (Jay Briscoe and Mark Briscoe) defeated Flip Gordon and Jushin Thunder Liger\n|stip1= Tag team match\n|time1= 11:55\n|match2= Tenille Dashwood and Sumie Sakai defeated Deonna Purrazzo and Skylar\n|stip2= Tag team match\n|time2= 7:59\n|match3= Coast 2 Coast (LSG and Shaheem Ali) defeated The Kingdom (T. K. O'Ryan and Vinny Marseglia) (with Matt Taven)\n|stip3= Tag team match\n|time3= 8:36\n|match4= Cheeseburger defeated Bully Ray via countout\n|stip4= Singles match\n|time4= 5:04\n|match5= Bullet Club (Cody, Hangman Page and Marty Scurll) defeated Roppongi 3K (Rocky Romero, Sho and Yoh)\n|stip5= Six-man tag team match\n|time5= 14:37\n|match6= Los Ingobernables de Japón (Tetsuya Naito, Evil and Sanada) defeated Silas Young, Beer City Bruiser and Brian Milonas\n|stip6= Six-man tag team match\n|time6= 9:09\n|match7= Chuckie T. defeated Jay Lethal and Jay White\n|stip7= Three-way match\n|time7= 10:41\n|match8= The Kingdom (Matt Taven, T. K. O'Ryan and Vinny Marseglia) defeated SoCal Uncensored (Christopher Daniels, Frankie Kazarian and Scorpio Sky) (c)\n|stip8= Six-man tag team match for the ROH World Six-Man Tag Team Championship\n|time8= 14:29\n|match9= The Young Bucks (Matt Jackson and Nick Jackson) defeated Los Ingobernables de Japón (Bushi and Hiromu Takahashi)\n|stip9= Tag team match\n|time9= 15:22\n}}\nNight 2\n|note1  = dark\n|match1= The Dawgs (Rhett Titus and Will Ferrara) defeated The Boys (Boy 1 and Boy 2)\n|stip1= Tag team match\n|time1= 5:13\n|match2= Jay White (c) defeated Punishment Martinez\n|stip2= Singles match for the IWGP United States Heavyweight Championship\n|time2= 11:00\n|match3= Cheeseburger defeated Bully Ray by disqualification\n|stip3= Singles match\n|time3= 3:16\n|match4= Tetsuya Naito defeated Beer City Bruiser\n|stip4= Singles match\n|time4= 12:35\n|match5= The Young Bucks (Matt Jackson and Nick Jackson) defeated Super Smash Bros. (Evil Uno and Stu Grayson)\n|stip5= Tag team match\n|time5= 17:26\n|match6= Tenille Dashwood and Jenny Rose defeated Alexia Nicole and Xandra Bale\n|stip6= Tag team match\n|time6= 6:28\n|match7= SoCal Uncensored (Christopher Daniels, Frankie Kazarian and Scorpio Sky) defeated Roppongi 3K (Rocky Romero, Sho and Yoh)\n|stip7= Six-man tag team match\n|time7= 9:15\n|match8= Silas Young (c) defeated Hangman Page\n|stip8= Singles match for the ROH World Television Championship\n|time8= 7:32\n|match9= Cody defeated Jushin Thunder Liger\n|stip9= Singles match\n|time9= 12:06\n|match10= Los Ingobernables de Japón (Evil, Hiromu Takahashi and Sanada) defeated Jay Lethal, Kenny King and Colt Cabana\n|stip10= Six-man tag team match\n|time10= 22:44\n}}\nNight 3\nNight 4\nSee also\n*Professional wrestling in Canada\n*2018 in professional wrestling\nReferences\nExternal links\n*[http://www.njpw.co.jp/ Official New Japan Pro-Wrestling website]\n*[http://rohwrestling.com/ Official Ring of Honor website]"
    }
  ]
}