{
  "content": [
    {
      "type": "text",
      "text": "# Rohwer War Relocation Center\n\n| locmapin             = Arkansas#USA\n| area                 =\n| architect            = Kaneo Fujioka and Kay Horisawa\n| designated_nrhp_type = July 6, 1992\n| added                = July 06, 1992\n| refnum               = 92001882\n}}\nThe Rohwer War Relocation Center was a World War II Japanese American concentration camp located in rural southeastern Arkansas, in Desha County. It was in operation from September 18, 1942, until November 30, 1945, and held as many as 8,475 Japanese Americans forcibly evacuated from California. Among the inmates, the notation \"\" was sometimes applied. The Rohwer War Relocation Center Cemetery is located here, and was declared a National Historic Landmark in 1992.\nHistory\nThe  of land on which Rohwer was built had been purchased by the Farm Security Administration from tax-delinquent landowners in the 1930s. It remained largely abandoned until the War Relocation Authority, which oversaw the World War II incarceration program, took it over in 1942. It planned to use this facility to incarcerate ethnic Japanese, including American citizens from West Coast areas considered strategic to the war effort. Governor Homer Adkins initially opposed the WRA's proposal to build Rohwer and its neighbor, Jerome, in Arkansas, but relented after being assured that the Japanese American detainees would be controlled by armed white guards at these facilities and they would be removed from the state at the end of the war.\nThe Linebarger-Senne Construction Company was contracted to build the camp at a cost of $4.8 million; it worked under the supervision of the Army Corps of Engineers. The land was heavily forested and swampy due to its proximity to the Mississippi River  to the east. Extensive clearing and draining was necessary, making construction at the site a difficult and slow-going task. The camp was still under construction when the first inmates began to arrive. Ultimately the camp held administrative offices, schools, a hospital, and 36 residential blocks, each with twelve  barracks divided into several \"apartments\", as well as communal dining and sanitary facilities, all contained within a guarded barbed-wire fence.\nThe architect of the camp was Edward F. Neild of Shreveport, Louisiana, who also designed the camp at Jerome.\nRohwer opened on September 18, 1942, and reached a peak population of 8,475 by March 1943. Most detainees had been forced out of their homes and businesses in Los Angeles or the San Joaquin Valley in California. A large portion of Rohwer inmates were school-age children, most born in the US. About 2,000 students attended the camp's schools, which were opened on November 9, 1942, after some delay. Adults took jobs with the administration, hospital, schools, and mess halls, in addition to agricultural work or labor details outside camp. As  of the site used for residences and other buildings, officials used the remainder of Rohwer's land to grow more than 100 agricultural products. These were used to supplement the inmates' food rations (kept to a bare minimum of 37 cents a day per inmate to avoid rumors that the WRA was \"coddling\" Japanese Americans).\nIn 1943, the WRA required all adults in Rohwer and the other camps to submit to a series of questions. Officially, it was presented as the registration process to obtain clearance to leave camp for work or schooland it was initially distributed only to the citizen Nisei who were eligible for leave, before being extended to the first-generation Isseibut administrators soon began to focus instead on assessing the \"loyalty\" of imprisoned Japanese Americans.\nThe \"loyalty questionnaire,\" as it came to be known, created anger and confusion because of two questions: one asked Japanese Americans if they were willing to volunteer for military service (despite their mistreatment by the government and the army) and the other if they would \"forswear their allegiance to the Emperor of Japan\" (although many had never held such allegiance in the first place). The set-up of the questions was confusing and internees were suspicious of their true purpose.\nThe loyalty questionnaire and subsequent recruitment efforts proved especially unpopular in the Jerome camp, located  south of Rohwer. Only 2 percent of eligible men in Jerome (and in Rohwer) enlisted. Some 2,147 others, a quarter of Jerome's population, were classified as \"disloyal\" after giving unfavorable responses to the questionnaire. They were transferred to the \"segregation center\" at Tule Lake, California. The decline in population, combined with earlier unrest over poor working conditions in the camp, resulted in authorities closing the Jerome camp at the end of June 1944. A significant number of former Jerome inmates were transferred to Rohwer.\nTogether with the Tule Lake Segregation Center, Rohwer was the last WRA camp to close, on November 30, 1945.\nRohwer today\nThe largest remaining structure is the high school gymnasium/auditorium, which was added to and was in service with the local school before it closed in July 2004. The tallest structure is the smokestack from the hospital incinerator. Neither of these is marked in any way to indicate historical significance. The rail line used to bring internees and supplies to the camp remains, though it is apparently abandoned. Some of the rails date back to World War II and before.  This rail line also served the Jerome War Relocation Center, which was located  southwest of Rohwer.\nVarious building foundations, walkways, culverts and other improvements are still visible and some are still in use by the local residents. Trees planted by residents have grown tall.\nThe camp cemetery survives as the only site still identified as having been part of the internment center. It was listed as a National Historic Landmark in 1992. It has a monument to Japanese American war dead from the camp, and also a monument to those who died at the camp. The camp site was listed on the National Register of Historic Places in 1974. A tank-shaped memorial, made of reinforced concrete, guards the cemetery, commemorating Japanese Americans who fought for their country during World War II. 581 men joined the U.S. Army from this camp, either volunteering or accepting their conscription into the legendary 100th Infantry Battalion, the famed 442nd RCT and MIS. Thirty-one who came from Rohwer died in action, and their names are inscribed on the memorial, as well as a later memorial raised nearby.\nIn its National Historic Landmark summary on the Rohwer Relocation Center Cemetery, the National Park Service writes:\nRohwer Relocation Camp was constructed in the late summer and early fall of 1942 as a result of Executive Order 9066 (February 19, 1942). Under this order, over 110,000 Japanese Americans and their immigrant parents were forcibly removed from the three Pacific Coast States&mdash;California, Oregon, and Washington. In all, ten camps were established in desolate sites, all chosen for their distance from the Pacific Coast. Over 10,000 evacuees passed through Rohwer during its existence, and over two thirds of these were American citizens. The monuments found within the camp's cemetery are perhaps the most poignant record of this time.\"\nIn its summary on the Rohwer Relocation Center Cemetery, the National Park Service indicates that the cemetery's condition is threatened due to deterioration of the grave markers and monuments, but that ownership of the site is unclear. Deterioration is visible in photographs of the site. Deterioration is discussed in a report from the National Park Service to the President.\nThe cemetery is located  west of State Route 1, approximately  northeast of McGehee, Arkansas. Signs identify the graded road which goes from the highway to the cemetery, where there is room to park automobiles.\nHeritage site\nThe Rohwer War Relocation Center site is now an Arkansas State University Heritage Site, and features a memorial, the camp cemetery, interpretive panels and audio kiosks.\nThe Japanese American Internment Museum opened in nearby McGehee, Arkansas in 2013 and serves as the history museum and unofficial visitor center for the Rohwer War Relocation Center. Exhibits include a film, oral histories, photographs and personal artifacts of the internees.\nShooting of residents by a civilian\nIn 1942, M.C. Brown, a tenant farmer on horseback on his way home from deer hunting, came across some Japanese Americans from the Rohwer camp, on a work detail in the woods. He fired his gun, and one of the Japanese American men was struck in the hip by a pellet while another was wounded in the calf of the leg. The Japanese Americans were working in the woods under the supervision of a government engineer when the shooting occurred.\nNotable internees\n*Ruth Asawa (1926–2013), Japanese American sculptor\n*Takayo Fischer (born 1932), American stage, film and TV actress; also interned at Jerome\n*Aiko Herzig-Yoshinaga (1924–2018), political activist; also interned at Manzanar and Jerome\n*Eddie Imazu (1897–1979), an art director and production designer. Also interned at Jerome\n*Sumako Hamaguchi (1918–2023), a kabuki dancer\n*Jim Ishida (born 1943), actor best known for his role as T. Fujitsu, Marty McFly's future boss in Back to the Future Part II in 1989\n*Janice Mirikitani (1941–2021), poet laureate of San Francisco; co-founded with her husband, the Rev. Cecil Williams, the Glide Foundation (Glide Memorial Church is featured in the Will Smith film The Pursuit of Happiness). Glide empowers San Francisco's disadvantaged members of society through extensive outreach and advocacy efforts.\n*Wataru Nakamura (1921–1951), Korean War Medal of Honor recipient\n*Rose Ochi (1938–2020), Japanese American attorney and civil rights activist\n*Haruko Sugi (1915–2012), a language translator\n*Henry Sugimoto (1900–1990), Japanese-born artist; also interned at Jerome\n*George Takei (born 1937), activist, author, and actor best known as Lieutenant Hikaru Sulu from Star Trek (1966–69). Since his parents refused to take a vow and did not \"pass\" the loyalty questionnaire, the family was later transferred to Tule Lake War Relocation Center.\n*Henry H. Takei (b. 1939), Prof. of Periodontics, UCLA School of Dentistry; brother of above.\n*Michiko Toyama (1908–2000), a composer\n*Taitetsu Unno (1929–2014), Buddhist scholar, lecturer, and author; also interned at the Tule Lake War Relocation Center\n*Grayce Uyehara (1919–2014), Japanese-American social worker and activist\nSee also\n*Japanese American Internment\n*Japanese American Internment Museum\n*Other camps:\n**Gila River War Relocation Center\n**Granada War Relocation Center\n**Heart Mountain War Relocation Center\n**Jerome War Relocation Center\n**Manzanar National Historic Site\n**Minidoka National Historic Site\n**Poston War Relocation Center\n**Topaz War Relocation Center\n**Tule Lake War Relocation Center\n*List of National Historic Landmarks in Arkansas\n*National Register of Historic Places listings in Desha County, Arkansas\nReferences\nNotes\n*[http://encyclopediaofarkansas.net/encyclopedia/entry-detail.aspx?entryID=369 Encyclopedia of Arkansas History & Culture]\nExternal links\n*[http://rohwer.astate.edu/ Rohwer War Relocation Center] - official site\n*John Howard, \"[http://southernspaces.org/2008/john-yoshida-arkansas-1943 John Yoshido in Arkansas, 1943].\" Southern Spaces, 2 October 2008. http://southernspaces.org/2008/john-yoshida-arkansas-1943\n* | title = National Register of Historic Places Registration | date = 1991-06-25 | access-date = 2008-07-09 | publisher = National Park Service | format = PDF}} – Rohwer Relocation Center Memorial Cemetery—Accompanying 54 photos of camp ruins, memorial, and cemetery from 1990\n*\n*Brian Niiya. \"[http://encyclopedia.densho.org/Rohwer/ Rohwer],\" Densho Encyclopedia, 2014.\n*Patricia Wakida. \"[http://encyclopedia.densho.org/Rohwer%20Outpost%20%28newspaper%29/ Rohwer Outpost (newspaper)],\" Densho Encyclopedia, 2014.\n*[https://scholarlycommons.pacific.edu/yoshikawa/ Yoshikawa Family Collection] available at [https://www.pacific.edu/university-libraries/find/holt-atherton-special-collections.html Holt-Atherton Special Collections.]"
    }
  ]
}