{
  "content": [
    {
      "type": "text",
      "text": "# Roman–Sasanian War of 421–422\n\n)\n|territory  = status quo ante bellum\n|combatant1 = Eastern Roman Empire\n|combatant2 = Sasanian EmpireLakhmids\n|commander1 = ArdaburAnatolius\n|commander2 = Bahram VMehr NarsehAl-Mundhir I\n|strength1=\n|strength2=\n|casualties1=\n|casualties2=\n|}}\nThe Roman–Sasanian war of 421–422 was a conflict between the Eastern Roman Empire and the Sasanians. The casus belli was the persecution of Christians by the Sasanian king Bahram V, which had come as a response to attacks by Christians against Zoroastrian temples;}} the Christian Eastern Roman Emperor Theodosius II declared war and obtained some victories, but in the end, the two powers agreed to sign a peace on the status quo ante.\nBackground\nIn 421, Bahram V succeeded his father Yazdegerd I, who shortly before he had been killed, began a persecution of Christians as reprisal for attacks against Zoroastrian temples by Christians during his reign; Bahram continued this persecution, during which many died. Among them was James Intercisus, a political counsellor of Yazdegerd's, who had converted to Zoroastrianism but then converted back to Christianity.\nThe persecuted Christians fled to Roman territory and were welcomed by the bishop of Constantinople, Atticus, who informed the Emperor of the persecution. The Eastern Roman Emperor Theodosius II was at the time deeply influenced by his religious sister Pulcheria, and had become more and more interested in Christianity.\nThe Roman-Sasanian relationship already had some friction. The Persians had hired some Roman gold-diggers, but now refused to send them back; furthermore, the Sasanians seized the properties of Roman merchants.\nFor these reasons, when the Persian ambassadors reached the Roman court to demand the return of the fugitives, Theodosius chose to break the peace and declare war, rather than giving them back.\nConflict\nThe commander-in-chief of the Roman army was Ardabur, who, incidentally, came from the Iranian tribe of the Alans. Ardabur needed to collect many troops for his campaign. Theodosius, therefore, allowed some Pannonian Ostrogoths to settle in Thracia, to defend the province from the Huns while the Thracian Roman troops were sent to the East.\nArdabur sent Anatolius to Persarmenia, where he joined the rebels, while Ardabur entered Persian territory and devastated Arzanene. The general of the Sasanian army, Narses, engaged Ardabur in battle, but was defeated and forced to retreat. Narses planned to attack Mesopotamia, a Roman province that had been left unguarded, and moved there, but Ardabur foresaw his enemy's plan and intercepted him there.\nArdabur received reinforcements and put the fortress of Nisibis under siege. Bahram allied with the Lakhmid Arabs of Alamundarus (Al-Mundhir I of Hirah), who, however, were dispersed by the Romans. In the meantime, the King of the Huns, Rua, had attacked the dioceses of Dacia and Thracia and had even menaced Constantinople; at the same time, a large Persian army moved towards Nisibis. To avoid a war on two fronts, Theodosius then recalled Ardabur.\nSiege of Theodosiopolis\nAccording to a Roman ecclesiastical source, the Sasanian besieged Theodosiopolis for 30 days, with thousands of soldiers and even siege engines (that the source calls helepolis). According to this source, the Romans did not try to aid the besieged, but the Sasanians were convinced to lift the siege when the bishop of the city, Eunomius, had a stone-thrower, named after Thomas the Apostle, kill a lesser king of the Sasanian army.\nDespite the evident religious theme of this account, the passage is important as it testifies to an unsuccessful Sasanian attack on Theodosiopolis. This could be the Theodosiopolis in Armenia, and in this case the siege should be dated to 421, while Narses was in Mesopotamia, or Theodosiopolis in Osroene, and in this case the attack should be dated after the Roman retreat from Nisibis.\nAftermath\nThe peace treaty that ended the war (422) was negotiated by the magister officiorum Helio. It returned everything to the situation before the war (status quo ante bellum). Both parties agreed to reject Arab defectors of the other party, as well as to guarantee liberty of religion in their territories.\nThe war has been called a Roman victory by Michael J. Decker, while other historians call the war a stalemate.\nIt is related that Acacius, bishop of Amida, had the consecrated gold and silver plate of his church melted down, to procure a sum sufficient to buy 7,000 Persian captives who had wound up in the slave market in consequence of the war, whom he then sent back in freedom to their homeland, as a gesture of Christian generosity to the Persian persecutors. If the story is true, Gibbon remarks, this will have facilitated the conclusion of peace.\nNotes\nReferences\nBibliography\n*page 135.\n*\n*\n*\n*\nPrimary sources\nThe most complete account of the war is preserved in Socrates Scholasticus, Historia Ecclesiastica VII.18, but some passages are included by Theodoret in his Historia Ecclesiastica. English translations of these sections are present in:\n*"
    }
  ]
}