{
  "content": [
    {
      "type": "text",
      "text": "# Romania–United Kingdom relations__disambig_1\n\nMarcel Ciolacu with British Prime Minister Keir Starmer in 10 Downing Street, November 2024.]]\nBritish–Romanian relations encompass the diplomatic, economic, and historical interactions between Romania and the United Kingdom of Great Britain and Northern Ireland. Following the independence of Romania, both countries established diplomatic relations on 20 February 1880.\nBoth countries share common membership of the Council of Europe, the International Criminal Court, NATO, OSCE, and the World Trade Organization. Bilaterally the two countries have a Defence Cooperation Agreement, and a Double Taxation Convention.\nHistory\nIn 1588, Petru Șchiopul, the Prince of Moldavia, concluded a trade treaty with Elizabeth I of England. Through the treaty, English merchants were allowed to conduct free trade in the country while paying only a 3% customs tax on the value of goods, as opposed to the 12% tax imposed on other merchants.\nAt the Congress of Berlin 1877 to 1878, Great Britain worked to assist Romania's goal of breaking away from the Ottoman Empire. The British and Russian delegations negotiated a deal whereby Romania obtained its independence, with conditions. While Britain was unable to gain all that it wanted, it did manage to prevent Russian expansion into the Mediterranean. The result was good relations between Britain and Romania, with diplomatic relations starting on 20 February 1880 after the British recognized Romania's independence.\nPrincess Marie of Edinburgh, a British Princess as granddaughter of Queen Victoria of the United Kingdom, married Crown Prince Ferdinand of Romania, the couple later became King Ferdinand I and Queen Marie.\nIn recent years relations between Britain and Romania have soured due to what some hold to be xenophobic reports in the British press.\nIn June 2023, King Charles III visited Bucharest in a first visit by any reigning British monarch to the country.\nEconomic relations\nTrade between the United Kingdom and Romania is governed by the EU–UK Trade and Cooperation Agreement since 1 January 2021.\nCompanies\nRoyal Bank of Scotland operated in Romania between 15 October 2008 and 31 December 2015.\nThe Romanian subsidiary of the British company Vodafone is the second largest mobile network operator in the country.\nOne of the best known Romanian brands in the United Kingdom is Dacia. It has a wide spread network of dealers throughout the country.\nResident diplomatic missions\n* Romania maintains an embassy in London, and consulate generals in Edinburgh and Manchester. Romania also maintains honorary consulates in Hirwaun, Leeds, Morpeth-Newcastle and Southampton.\n* The United Kingdom is accredited to Romania through its embassy in Bucharest.\nSee also\n* Foreign relations of Romania\n* Foreign relations of United Kingdom\n* Romanians in the United Kingdom\n* Britishs in Romania\n* British Romanian Educational Exchange\n* United Kingdom–European Union relations\nReferences\nExternal links\n* [http://www.fco.gov.uk/servlet/Front?pagename=OpenMarket/Xcelerate/ShowPage&c=Page&cid=1007029394365&a=KCountryProfile&aid=1019744931956  British Foreign and Commonwealth Office about relations with Romania]\n* [http://www.britishembassy.gov.uk/servlet/Front?pagename=OpenMarket/Xcelerate/ShowPage&c=Page&cid=1048078505896  British embassy in Bucharest]\n* [http://londra.mae.ro/index.php?lang=en  Romanian embassy in London]"
    }
  ]
}