{
  "content": [
    {
      "type": "text",
      "text": "# Roman–Parthian Wars__disambig_1\n\n()\n| place             = Armenia, South-east Roman frontier (Osroene, Syria, Judea, Mesopotamia)\n| result            = Stalemate\n| territory         = Rome and Parthia became joint masters of the Kingdom of Armenia, with the ruler being a Parthian prince who had to be approved by Rome.\n| combatant1        = Roman Republic, succeeded by Roman Empire and client states\n| combatant2        = Parthian Empire and clients\n| commander1        = Crassus  Mark Antony  Publius Ventidius Bassus  Gnaeus Domitius Corbulo  Trajan  Lucius Verus  Statius Priscus  Avidius Cassius  Septimius Severus  Julia Domna  Caracalla  Macrinus\n| commander2        = Surena  Orodes II  Pacorus I  Phraates IV  Artabanus III  Vologases I  Tiridates I of Armenia  Osroes I  Sinatruces II Vologases IV\n| strength1         =\n| strength2         =\n| casualties1       =\n| casualties2       =\n}}\nThe Roman–Parthian Wars (54 BC&nbsp;– 217 AD) were a series of conflicts between the Parthian Empire and the Roman Republic and Roman Empire. It was the first series of conflicts in what would be 682 years of Roman–Persian Wars.\nBattles between the Parthian Empire and the Roman Republic began in 54&nbsp;BC. This first incursion against Parthia was repulsed, notably at the Battle of Carrhae (53 BC). During the Roman Liberators' civil war of the 1st century BC, the Parthians actively supported Brutus and Cassius, invading Syria, and gaining territories in the Levant.  However, the conclusion of the second Roman civil war brought a revival of Roman strength in Western Asia.\nIn 113&nbsp;AD, the Roman Emperor Trajan made eastern conquests and the defeat of Parthia a strategic priority, and successfully overran the Parthian capital, Ctesiphon, installing Parthamaspates of Parthia as a client ruler. However, he was later repulsed from the region by rebellions. Hadrian, Trajan's successor, reversed his predecessor's policy, intending to re-establish the Euphrates as the limit of Roman control. However, in the 2nd century, war over Armenia broke out again in 161, when Vologases IV defeated the Romans there.  A Roman counter-attack under Statius Priscus defeated the Parthians in Armenia and installed a favored candidate on the Armenian throne, and an invasion of Mesopotamia culminated in the sack of Ctesiphon in 165.\nIn 195, another Roman invasion of Mesopotamia began under the Emperor Septimius Severus, who occupied Seleucia and Babylon, however he was unable to take Hatra. Parthia ultimately was taken by a Persian rebellion led by Ardashir I, who entered Ctesiphon in 226.  Under Ardashir and his successors, Persian-Roman conflict continued between the Sassanid Empire and Rome.\nParthia's western ambitions\nAfter triumphing in the Seleucid–Parthian Wars and annexing large amounts of the Seleucid Empire, the Parthians began to look west for more territory to expand into. Parthian enterprise in the West began in the time of Mithridates I; during his reign, the Arsacids succeeded in extending their rule into Armenia and Mesopotamia. This was the beginning of an \"international role\" for the Parthian empire, a phase that also entailed contacts with Rome.  Mithridates II conducted unsuccessful negotiations with Sulla for a Roman–Parthian alliance ().Plutarch, Sulla, 5. [https://penelope.uchicago.edu/Thayer/E/Roman/Texts/Plutarch/Lives/Sulla*.html 3–6]  * Sherwin-White (1994), 262\nBy the same time the Parthians started their rise, they established eponymous branches in the Caucasus, namely the Arsacid dynasty of Armenia, the Arsacid dynasty of Iberia, and the Arsacid dynasty of Caucasian Albania.\nAfter 90 BC, the Parthian power was diminished by dynastic feuds, while at the same time, Roman power in Anatolia collapsed.  Roman–Parthian contact was restored when Lucullus invaded Southern Armenia and defeated Tigranes in 69&nbsp;BC, however, again no definite agreement was made.\nRoman Republic vs Parthia\nwearing a Hellenistic-style helmet, from the Parthian royal residence and necropolis of Nisa, Turkmenistan, 2nd century BC]]\nWhen Pompey took charge of the war in the East, he re-opened negotiations with Phraates III; they came to an agreement and Roman–Parthian troops invaded Armenia in 66/65&nbsp;BC, but soon a dispute arose over Euphrates boundary between Rome and Parthia. Pompey refused to recognize the title of \"King of Kings\" for Phraates, and offered arbitration between Tigranes and the Parthian king over Corduene. Finally, Phraates asserted his control over Mesopotamia, except for the western district of Osroene, which became a Roman dependency.\nBattle of Carrhae (53 BC)\nIn 53&nbsp;BC, Crassus led an invasion of Mesopotamia, with catastrophic results; at the Battle of Carrhae, Crassus and his son Publius were defeated and killed by a Parthian army under General Surena. The bulk of his force was either killed or captured; of 42,000 men, about half died, a quarter made it back to Syria, and the remainder became prisoners of war. Rome was humiliated by this defeat, and this was made even worse by the fact that the Parthians had captured several Legionary Eagles. It is also mentioned by Plutarch that the Parthians found the Roman prisoner of war that resembled Crassus the most, dressed him as a woman and paraded him through Parthia for all to see. This, however, could easily be Roman propaganda. Orodes II, with the rest of the Parthian Army, defeated the Armenians and captured their country. However, Surena's victory invoked the jealousy of the Parthian king, and he ordered Surena's execution. Following Surena's death, Orodes II himself took command of the Parthian army and led an unsuccessful military campaign into Syria. The Battle of Carrhae was one of the first major battles between the Romans and Parthians.\nThe following year, the Parthians launched raids into Syria, and in 51&nbsp;BC mounted a major invasion led by the crown prince Pacorus and the general Osaces; they besieged Cassius in Antioch, and caused considerable alarm in the Roman provinces in Asia. Cicero, who had been chosen governor of adjacent Cilicia for that year, marched with two legions to lift the siege. Pacorus fell back, but was ambushed in his retreat by Cassius near Antigonea and Osaces was killed.\nCaesar's plans (45–44 BC)\nDuring Caesar's civil war the Parthians made no move, but maintained relations with Pompey. After his defeat and death, a force under Pacorus came to the aid of the Pompeian general Caecilius Bassus, who was besieged at Apamea Valley by the Caesarian forces. With the civil war over, Julius Caesar elaborated plans for a campaign against Parthia, but his assassination averted the war. During the ensuing Liberators' civil war, the Parthians actively supported Brutus and Cassius, sending a contingent which fought with them at the Battle of Philippi in 42&nbsp;BC.\nPompeian–Parthian invasion (40–38 BC)\nAfter that defeat, the Parthians under Pacorus invaded Roman territory in 40&nbsp;BC in conjunction with Quintus Labienus, a Roman erstwhile supporter of Brutus and Cassius. They swiftly overran Syria, and defeated Roman forces in the province; all the cities of the coast, with the exception of Tyre admitted the Parthians. Pacorus then advanced into Hasmonean Judea, overthrowing the Roman client Hyrcanus II and installing his nephew Antigonus (40–37 BC) in his place. For a moment, the whole of the Roman East was captured by the Parthians. The conclusion of the second Roman civil war was soon to bring about a revival of Roman strength in Western Asia.\nAntony's Atropatene campaign (36 BC)\nMeanwhile, Mark Antony had already sent Ventidius to oppose Labienus who had invaded Anatolia. Soon Labienius was driven back to Syria by Roman forces, and, though his Parthian allies came to his support, he was defeated, taken prisoner and then put to death. After suffering a further defeat near the Syrian Gates, the Parthians withdrew from Syria. They returned in 38&nbsp;BC, but were decisively defeated by Ventidius and Pacorus was killed. In Judea, Antigonus was ousted with Roman help by the Idumean Herod in 37&nbsp;BC.\nWith Roman control of Syria and Judaea restored, Mark Antony led a huge army into Caucasian Albania (just east of Armenia), but his siege train and its escort were isolated and wiped out, while his Armenian allies deserted. Failing to make progress against Parthian positions, the Romans withdrew with heavy casualties. In 33&nbsp;BC Antony was again in Armenia, contracting an alliance with the Median king against both Octavian, and the Parthians, but other preoccupations obliged him to withdraw, and the whole region passed under Parthian control.Cassius Dio, Roman History, XLIX, [https://penelope.uchicago.edu/Thayer/E/Roman/Texts/Cassius_Dio/49*.html 27–33]  * Bivar (1968), 58–65\nRoman Empire vs Parthia\nTensions over Armenia\nUnder the threat of an impending war between the two powers, Gaius Caesar and Phraataces worked out a rough compromise between the two powers in 1&nbsp;AD. According to the agreement, Parthia undertook to withdraw its forces from Armenia, and to recognize a de facto Roman protectorate over the country. Nonetheless, Roman-Parthian rivalry over control and influence in Armenia continued unabated for the next several decades.\nThe decision of the Parthian king Artabanus II to place his son, Arsaces, on the vacant Armenian throne nearly led to a war with Rome in 36&nbsp;AD. Artabanus III reached an understanding with the Roman general, Lucius Vitellius, renouncing Parthian claims to a sphere of influence in Armenia.\nWar of the Armenian Succession (58–63)\nA new crisis was triggered in 58, when the Romans invaded Armenia after the Parthian king Vologases I forcibly installed his brother Tiridates on the throne there. Roman forces under Corbulo overthrew Tiridates and replaced him with a Cappadocian prince. This prompted Parthian retaliation and an inconclusive series of campaigns in Armenia ensued. The war came to an end in 63, when the Romans agreed to allow Tiridates and his descendants to rule Armenia on condition that they received the kingship from the Roman emperor.\nArmenia would henceforth be ruled by a Parthian dynasty, and despite its nominal allegiance to Rome, it would come under increasing Parthian influence. In the judgment of later generations, \"Romans had lost Armenia\",  and although the Peace of Rhandeia ushered in a period of relatively peaceful relations that would last for 50 years, Armenia would continue to be a constant bone of contention between the Romans, the Parthians, and their Sassanid successors.\nAs for Corbulo, he was honored by Nero as the man who had brought this \"triumph\" to be, but his popularity and influence with the army made him a potential rival. Together with the involvement of his son-in-law Lucius Annius Vinicianus in a foiled plot against Nero in 66, Corbulo became suspect in the eyes of the emperor.  In 67, while journeying in Greece, Nero ordered him to be executed; upon hearing of this, Corbulo committed suicide.\nTrajan's Parthian campaign (115–117)\nissued by the Roman Senate in 116 to commemorate Trajan's Parthian campaign]]\nA new series of wars began in the 2nd century, during which the Romans consistently held the upper hand over Parthia. In 113, the Roman Emperor Trajan decided that the moment was ripe to resolve the \"eastern question\" once and for all time by the decisive defeat of Parthia and the annexation of Armenia; his conquests marked a deliberate change of Roman policy towards Parthia, and a shift of emphasis in the \"grand strategy\" of the empire.\nIn 114, Trajan invaded Armenia, annexed it as a Roman province, and killed Parthamasiris who was placed on the Armenian throne by his relative, the king of Parthia, Osroes I. In 115, the Roman emperor overran northern Mesopotamia and annexed it to Rome as well; its conquest was deemed necessary, since otherwise the Armenian salient could be cut off by the Parthians from the south. The Romans then captured the Parthian capital, Ctesiphon, before sailing downriver to the Persian Gulf. However, in that year revolts erupted in Eastern Mediterranean, North Africa and northern Mesopotamia, while a major Jewish revolt broke out in Roman territory, severely stretching Roman military resources. Trajan failed to take Hatra, the capital of the Kingdom of Hatra, which avoided total Parthian defeat. Parthian forces attacked key Roman positions and Roman garrisons at Seleucia, Nisibis and Edessa were evicted by the local populaces. Trajan subdued the rebels in Mesopotamia, installed the Parthian prince Parthamaspates as a client ruler, and withdrew to Syria. Trajan died in 117, before he could renew the war. Trajan's Parthian campaign is considered, in different ways, the climax of \"two centuries of political posturing and bitter rivalry.\" Trajan was the first emperor to carry out a successful invasion of Mesopotamia. His grand scheme for Armenia and Mesopotamia were ultimately \"cut short by circumstances created by an incorrect understanding of the strategic realities of eastern conquest and an underestimation of what insurgency can do.\"\nHadrian's policy and later wars\nTrajan's successor, Hadrian, promptly reversed his predecessor's policy. He decided that it was in Rome's interest to re-establish the Euphrates as the limit of its direct control, and willingly returned to the status quo ante, surrendering the territories of Armenia, Mesopotamia, and Adiabene back to their previous rulers and client-kings. Once again, at least for another half century, Rome was to avoid active intervention east of the Euphrates.\nWar over Armenia broke out again in 161, when Vologases IV defeated the Romans there, captured Edessa and ravaged Syria. In 163, a Roman counter-attack under Statius Priscus defeated the Parthians in Armenia and installed a favored candidate on the Armenian throne. The following year Avidius Cassius began an invasion of Mesopotamia, winning battles at Dura-Europos and Seleucia and sacking Ctesiphon in 165. An epidemic, possibly of smallpox, which was sweeping Parthia at the time now spread to the Roman army, leading to their withdrawal.\n, Rome]]\nIn 195, another Roman invasion of Mesopotamia began under the Emperor Septimius Severus, who occupied Seleucia and Babylon, and then sacked Ctesiphon yet again in 197. These wars led to the Roman acquisition of northern Mesopotamia, as far as the areas around Nisibis and Singara.  A final war against the Parthians was launched by the emperor Caracalla, who sacked Arbela in 216, but after his assassination, his successor Macrinus lost a battle against the Parthians at Nisibis and was forced to pay tribute to Parthia, that was the last engagement of the Parthian Wars.\nRise of the Sassanids\nParthia was finally destroyed by Ardashir&nbsp;I when he entered Ctesiphon in 226. The Sassanids were more centralized than the Parthian dynasties.\nUntil the Sassanids came to power, the Romans were mostly the aggressors. However, the Sassanids, being Persians, were determined to reconquer lands that the Achaemenid dynasty had once held and now lost. Their restorationist zeal made them much more aggressive foes of the Romans than the Parthians ever were. For more information, see Byzantine-Sassanid Wars.\nSee also\n* List of Parthian kings\n* List of Roman consuls\nCitations\nReferences\nPrimary Sources\n* Cassius Dio, Roman History. Book LXXX. Translated by [https://penelope.uchicago.edu/Thayer/E/Roman/Texts/Cassius_Dio/home.html Earnest Cary].\n*  Plutarch, Sulla. Translated by John Dryden.\nSecondary sources\n*\n*\n*\n*\n*\n*\n*\n*\nExternal links\n* [https://web.archive.org/web/20160429192410/http://www.academia.edu/6339870/The_Battle_of_Nisibis_AD_217 The Battle of Nisibis, AD 217]\n* [http://www.allempires.com/article/index.php?q=war_roman_parthian allempires.com]\n* [http://riversfromeden.wordpress.com/2011/11/22/parthians-at-philippi/ Parthians at Philippi: A Case Study in an Ancient Proxy War]"
    }
  ]
}