{
  "content": [
    {
      "type": "text",
      "text": "# Roman Dmowski Monument, Warsaw\n\n|begin         =\n|complete      = 10 November 2006\n|open          =\n|dedicated_to  =Roman Dmowski\n|map_image     =\n|map_caption   =\n|map_width     =\n|coordinates   =\n|extra         =\n}}\nThe Roman Dmowski Monument in Warsaw () is a bronze statue, 5 meters (16 feet) tall, of Polish politician Roman Dmowski in Warsaw, on Na Rozdrożu Square at the intersection of Szuch and Ujazdów Avenues. It was unveiled on 10 November 2006. The statue holds a copy of the Treaty of Versailles and carries a quotation from Dmowski's book: I am a Pole, so I have Polish duties... (\"Jestem Polakiem więc mam obowiązki polskie...\"). The monument has been  controversial.\nIts construction was the result of an initiative supported by politicians Maciej Giertych, Bogusław Kowalski, and Jędrzej Dmowski. The monument, sponsored by the Warsaw municipal council, cost the Polish government about 500,000 zlotys. The unveiling ceremony was attended by some 200 people, including politicians Maciej Giertych, Artur Zawisza, and Wojciech Wierzejski, and by Father Henryk Jankowski, who consecrated the monument.\nThe monument's location, near the offices of the Polish Ministry of Foreign Affairs on Szuch Avenue, relates to Dmowski's 1923 three-month tenure as Poland's minister of foreign affairs.\nDmowski was the chief ideologue of Polish national democracy and has been called \"the father of modern Polish nationalism.\" He is seen as a principal figure in the restoration of Polish independence after World War I, and was a signatory of the Treaty of Versailles.\nThe monument has been called \"one of the most controversial monuments in Warsaw\" and has led to protests from organisations which see Dmowski as a fascist opponent of tolerance; conversely, it has been a rallying icon for Polish national democrats (Endecy). Due to the controversies and protests, plans to raise statues or memorials to Dmowski elsewhere have generally been deferred. Prominent critics of the monument have included Marek Edelman, a leader of the 1943 Warsaw Ghetto uprising; literary critic and theoretician Professor Maria Janion; and historian and sociologist Alina Cała. Its notable defenders have included historian Jan Żaryn and historian and politician Tomasz Nałęcz, who have emphasized Dmowski's important role in restoring Poland's independence.\n}}"
    }
  ]
}