{
  "content": [
    {
      "type": "text",
      "text": "# Roman Catholic Diocese of Lodwar\n\n|bishop           = John Mbinda, C.S.S.P.\n|coadjutor        =\n|auxiliary_bishops=\n|emeritus_bishops = Patrick Joseph Harrington\n|local=|coat=|flag=|territory=|headquarters=|denomination=Catholic|parishes=|churches=|sui_iuris_church=|established=|founded=|dissolved=|patron=|language=}}\nThe Roman Catholic Diocese of Lodwar () is a diocese located in the city of Lodwar in the ecclesiastical province of Kisumu in Kenya.\nHistory\n* January 11, 1968: Established as Apostolic Prefecture of Lodwar from the Diocese of Eldoret\n* January 30, 1978: Promoted as Diocese of Lodwar\nThe Diocese of Lodwar separated from the Diocese of Eldoret in 1968.  The Diocese of Lodwar borders local and international borders. Turkana is bounded on the northern side by South Sudan and on the West by Uganda. Its Eastern wall is formed by Lake Turkana and on the southern side and it is blocked off from the rest of Kenya by the Cherangani Hills and the high mountain of West Pokot” - James Good, Mission to the Turkana\nLodwar is bordering seven other dioceses, these include, Diocese of Kitale, Diocese of Nakuru and Diocese of Maralal in Kenya and the Diocese of Torit in South Sudan, Diocese of Kotido and Diocese of Moroto in Uganda and the Diocese of Jimmabonga in Ethiopia.\nOn 2012-12-8 the Diocese celebrated it 50 years since the first missionary arrived. Today it counts 30 Parishes with 16 local priests, 42 missionary priests, 19 religious brothers and 92 religious sisters. The diocese has been at the forefront in services provided to the community, to the poor, and the most neglected in Turkana.\nBishops\n* Prefects Apostolic of Lodwar (Latin Church)\n** John Christopher Mahon, S.P.S. (16 Jan 1968  – 30 Jan 1978); see below\n* Bishops of Lodwar (Latin Church)\n** John Christopher Mahon, S.P.S. (30 Jan 1978  – 17 Feb 2000); see above\n** Patrick Joseph Harrington, S.M.A. (17 Feb 2000  – 5 Mar 2011)\n** Dominic Kimengich (5 Mar 2011 – 16 Nov 2019), appointed Bishop of Eldoret\n** John Mbinda, C.S.Sp. (4 Apr 2022 – present)\nOther priest of this diocese who became bishop\n* Norman Kingoo Wambua was a priest of this diocese from 22 May 1988 to 27 June 1998 before being appointed as  Bishop of the diocese of Bungoma and Bishop of the Diocese of Machakos\nReferences\nSee also\n* Roman Catholicism in Kenya\n* [http://www.gcatholic.org/dioceses/diocese/lodw0.htm GCatholic.org]\n* [http://www.catholic-hierarchy.org/diocese/dlodw.html Catholic Hierarchy]\n*Kenya Conference of Catholic Bishops [http://www.kccb.or.ke/]\n*Diocese of Lodwar [http://lodwar.catholic.or.ke/about-us/2763/]"
    }
  ]
}