{
  "content": [
    {
      "type": "text",
      "text": "# Ron Paul 1988 presidential campaign\n\nThe Ron Paul presidential campaign of 1988 began in early 1987 when former Congressman Ron Paul of Texas announced his candidacy for the 1988 presidential nomination of the Libertarian Party. He joined the third party after leaving the Republican Party over the Reagan administration's handling of the federal budget. He ran on a platform that included non-interventionism in foreign conflicts, decriminalization of illegal drugs on a federal level, a return to the gold standard, the abolition of the Federal Reserve and a reduction in all government spending.\nPaul defeated Native American activist Russell Means at the Libertarian Party's National Convention in Seattle to win the party's presidential nomination. Former Alaska State representative Andre Marrou was selected as his running mate. After over a year of campaigning as the Libertarian Party nominee, Paul received very little media coverage and was excluded from presidential debates. On Election Day, he was on the ballot in 46 states and the District of Columbia, and finished in third place with approximately 0.5% of the vote, behind Democratic candidate Michael Dukakis and the winner Vice President George H. W. Bush.\nBackground\nPaul was elected to Texas's 22nd congressional district as a Republican during a special election early in 1976, and he supported Ronald Reagan's presidential bid that year. Paul lost his bid for re-election in late 1976, but was elected back to the seat in 1978. During his time in office, Paul followed the political and economic principles of laissez-faire advocate Ludwig von Mises, and gained a reputation as Dr. No, voting against legislation he felt was unconstitutional. He also advanced legislation establishing term limits for Congressmen, and opposed any implementation of a military draft.\nAfter serving four terms in the U.S. House of Representatives, Paul vied for the 1984 Republican Party Senatorial nomination in Texas and gained a reputation as an adept fundraiser. He was defeated in the primary and returned to his practice of obstetrics and gynecology.\nIn January 1987, Paul officially left the Republican Party to run for the Libertarian Party nomination after becoming disillusioned by the spending policies of the Reagan administration and presumptive Republican presidential nominee George H.W. Bush. On leaving the party, Paul remarked: \"Ronald Reagan has given us a deficit ten times greater than what we had with the Democrats. It didn't take more than a month after 1981, to realize there would be no changes.\" The Libertarian Party had courted Paul for the previous six years.\nCampaign developments\nLibertarian Party nomination campaign\nRon Paul announced his candidacy for the Libertarian Party's presidential nomination on February 16, 1987 during a party luncheon in San Francisco, California. During his announcement speech, Paul commented that \"Big government is running away with our freedom and our money, and the Republicans are just as much to blame as the Democrats.\" He later proclaimed himself as \"a choice for freedom.\" According to Paul, Libertarian Party leaders notified him that there would be little opposition to his run at the party's September 1987 National convention.\nPaul campaigned for the nomination for the most part of 1987, traveling to numerous state conventions. He visited Pennsylvania in April to discuss the Libertarian Party's platform with students from Penn State. Native American activist, and challenger to Paul, Russell Means of South Dakota also appeared at the event. Means had officially announced his Libertarian presidential nomination candidacy a day before Paul. While Means received heightened media attention for his comments regarding Native Americans and militancy, reports in the news media circulated that highlighted Paul's calls for the nation to return to the Gold Standard, and diminish the power of the Federal Reserve. Paul and Means were described as members of the right and left wing of the Libertarian Party, respectively.\nBy June, Paul was appearing at speaking events with Libertarian vice presidential candidate Andre Marrou. Marrou had previously served as a Libertarian member of the Alaska House of Representatives. The pair campaigned side-by-side in Idaho where Paul remarked \"that a Libertarian can win the White House in the not-too-distant future.\" After that, Paul traveled west to address Libertarian Party officials in Washington and Oregon. By the end of the month, Paul had raised $200,000 for his campaign. As the convention approached, Paul was one of seven candidates vying for the party's nomination. However, he and Means were the only candidates mentioned in the press. Speculation that Marrou could be chosen as a compromise candidate also surrounded the event, at which 800 attendees were expected.\nLibertarian National Convention\nThe Libertarian National Convention, formally called the Culture of Freedom Conference and Presidential Nominating Convention, was held from September 2–6 at the Sheraton Hotel in Seattle, Washington. His candidacy was seen as problematic because of the party's long support for freedom of choice on abortions. One of his opponents, Native American activist Russell Means, emphasized that he was pro-choice on the abortion issue. In a forum held prior to the nomination,  Means dismissed the greater funds raised by Paul's campaign, commenting that Means was receiving \"10 times more press\" than the former Congressman and was therefore \"100 times more effective.\" Another candidate expressed his desire to \"put handcuffs on all IRS agents.\"\nPaul was nominated on the first ballot with 196 of the 368 votes cast, with his closest opponent, Means, receiving 120 votes. He accepted the nomination and thanked the delegates with his wife, Carol, by his side. Alaska state legislator Andre Marrou, one of the party's few elected officeholders, was chosen as the vice presidential nominee.\nGeneral election campaign\nPaul returned to the campaign trail and entered the General election stretch of the campaign a year ahead of the nominees for the two major parties. He traveled to universities, held press conferences, and filmed an eight-minute television advertisement, to be shown in small states and on cable television, to help spread his message. He focused on gaining enough support to win a place in the League of Women Voters-sponsored presidential debates.\nSpreading the message\nPaul held one of his numerous press conferences in Helena, Montana, where he pushed for the Reagan administration to balance the budget and cut spending and taxes. He argued that Reagan had reneged on his 1980 campaign promise to balance the budget, resulting in voter dissatisfaction. Paul stated that Treasury Secretary James Baker should be removed from his office (impeached and removed) for the administration's monetary policy.\nPaul was featured in the November 1987 issue of Texas Monthly. The article compared the campaign to that of former U.S. Senator Eugene McCarthy, and made note of Paul's opposition to the CIA's assistance of the Contras in Nicaragua. Journalist Tom Curtis described Paul's supporters as \"a ragtag coalition of antiabortion activists, tax rebels, anti-war types, gold bugs and other anti-establishment, single issue voters.\" Curtis noted that Paul's monthly newsletter, The Ron Paul Investment Letter had 12,000 subscribers who paid an annual fee of $99.\nPaul traveled to Rome, Georgia and appeared at the downtown Holiday Inn in November 1987. During the appearance, he railed against the policies of Washington D.C., commenting that there was no difference between the two major parties, and that both supported \"intervention overseas,&nbsp;... in our personal lives&nbsp;... [and] in the marketplace.\" Paul went on to compare his Libertarian ideology to the mindset of the Founding Fathers of the United States. The next month, vice presidential nominee Andre Marrou traveled to Texas and discussed the Paul campaign's prospects. He opined that the ticket could possibly win 2 to 12 million votes in the following year's election, and that Paul might win if Jesse Jackson and Pat Robertson were selected as the Democratic and Republican presidential nominees, respectively. He explained that America did not want a preacher as president. Since the chance that either of those candidates would be named as their party's representative seemed unlikely, by this point in the election one of the campaign's priorities was securing a place on the ballot, which they had done in 20 of the 50 states.\nIn a 1988 interview with Alternative Views, Paul described in detail his views on the Council on Foreign Relations, Trilateral Commission, Federal Reserve system, and the American power structure.\n\"Kamikaze\" campaign\nPaul arrived in North Florida for a campaign event in early January 1988, with ten months still remaining until the election. The event was chronicled by a journalist for the Ocala Star-Banner, who compared Paul to a kamikaze and remarked that he never gives up even though his \"chance of becoming president\" was no greater than that for the journalist himself. Paul was described as \"slim, attractive, graying, immaculately attired and most articulate,\" but as a candidate who was dismissed by the media for his political positions such as support of the decriminalization of hard drugs. Paul visited the University of Florida during his trip, and gave a campaign speech in front of 200 students in the auditorium in Turlington Hall. Later in the month, he left Florida and campaigned in Iowa, where he spoke at Drake University and the University of Iowa. In February, he received the endorsement of Former Congressman Pete McCloskey (R-Calif.). He was also endorsed by comedian and talk-show host David Letterman, as well as psychologist and counterculture icon Timothy Leary, who held a fundraiser for Paul.\nPaul had received little media attention during the early stages of the Democratic and Republican primary contests. But as Vice President George H. W. Bush and Massachusetts Governor Michael Dukakis secured their respective parties' nominations, mentions of Paul increased. It was noted that if Bush became unacceptable to conservatives, they would not turn to Dukakis, but would most likely vote for Paul as a protest. During this time, publications also started to discuss Paul's tax policy. It called for a flat income tax rate of 10% on all earnings over $10,000 annually. Paul sold his tax plan while campaigning in Utah. In front of 250 people in Kane County, he hailed California's 1978 passage of Proposition 13 as starting the \"tax revolt and [sending] a message across the country. The next big message for this country should be the overwhelming passage of the tax initiatives&nbsp;... in November.\" Paul was also part of C-SPAN's program Road to the White House, which followed different candidates on the campaign trail. In June, they aired Paul's address to the National Organization for the Reform of Marijuana Laws.\nDuring a July press conference in Spokane, Washington, while lobbying for ballot access, Paul promised that as president he would veto spending increases for both domestic programs and the military. He asked in reference to the portrayal of his party's plank, \"what's extreme about a balanced budget?\" Paul conceded that he would not win the election but explained that votes for his ticket would give a bigger voice to Libertarian issues in American politics, and that he would only be disappointed if he did not receive at least 5% of the vote in the state. A few weeks later, The New York Times discovered that many former members of the Pat Robertson campaign were helping Ron Paul's candidacy. They found that the campaign workers were disseminating literature in Michigan that criticized Bush, and stated that Paul would \"carry the standard\" of the free market. Paul commented in a San Diego Union interview that he \"identif[ied]with Robertson\" although \"he's not a libertarian.\" Paul spent the beginning of August, campaigning in his home state of Texas.\nFinal stages\nIn August, Republicans began to argue that a vote for Paul would equate to a vote for Dukakis. Later in the month, Republicans grew weary of Dan Quayle as the party's vice presidential nominee. Paul commented that \"we like Dan Quayle. We also like George Bush and Mike Dukakis. They have been the best recruiters we have.\" He explained that the Libertarian Party was receiving around 100 calls a day from people interested in the party because \"a large number of Americans are disenchanted with the choice they have.\" Paul held a rally in Salt Lake City that drew 200 supporters, and proclaimed that he \"wouldn't be surprised if we got 20% of the vote in Utah.\"\nBy October 1988, the campaign had secured ballot access in 46 states and the District of Columbia, and newspapers across the nation began running editorials and letters supporting Paul's run, and criticizing the low volume of media coverage. The New York Times chronicled Paul's campaign in late October. Paul's 25-year-old son, Rand Paul who served as the aide-de-camp, was interviewed and explained that Paul had raised $2 million, $500,000 of which was spent on ballot access. Paul had spent $40,000 a month on traveling expenses. Just prior to Election Day, Paul predicted a low voter turnout.\nResults\nPaul finished in third place on Election Day, far behind Dukakis and the victorious George H.W. Bush. He received 431,750 votes, which made up 0.5% of the overall vote. He received 203,639 more votes than the Bergland/Lewis ticket four years prior. The largest percentage won by Paul came in Alaska, where he received 2.7%. In Washington, he missed his goal of 5% with a 0.9% showing. In Utah, Paul received 1.2%.\nAftermath\n2008 presidential run]]\nAfter the election, Paul was speculated to run for president in 1992 but opted instead to work on the campaign for Pat Buchanan. That year, Marrou received the Libertarian presidential nomination. Paul later returned to the Republican Party and was re-elected to his seat in Congress in 1996, without much support from establishment Republicans, who supported the party-switching Democratic incumbent of the seat. Back in Congress, Paul regained his nickname of Dr. No, favoring a free market and advocating a reduction in the size of the federal government. He was drafted to challenge President George W. Bush in the 2004 Republican primaries, but chose not to run. He ran for president again in 2008 and 2012 as a Republican, attracting a large amount of grassroots support.\nSee also\n*Rand Paul 2016 presidential campaign\nReferences"
    }
  ]
}