{
  "content": [
    {
      "type": "text",
      "text": "# Ronald Reagan 1980 presidential campaign\n\n| logo_size    =\n| logo_alt     =\n| campaign     =\n| candidate    =\n| affiliation  = Republican Party\n| status       =\n| formed       =\n| announced    =\n| launched     =\n| suspended    =\n| headquarters =\n| key_people   =\n| receipts     =\n| fec_date     =\n| slogan       = }}\n| themesong    =\n| chant        =\n| website      =\n}}\nThe 1980 presidential campaign of Ronald Reagan was a successful election campaign for President of the United States in 1980 by former California governor Ronald Reagan, and former CIA director George H. W. Bush. Reagan and Bush, defeated incumbent President Jimmy Carter and incumbent Vice President Walter Mondale. Reagan, a Republican who had also tried to seek the Republican nomination in 1976, launched his 1980 presidential bid on November 13, 1979, and secured nomination for his election on July 17, 1980. On November 4th, 1980, Reagan and Bush defeated Carter and Mondale in an electoral college landslide, winning 489 electoral votes compared to Carter and Mondale’s 49 electoral votes.\nReagan, a Republican and former governor of California, announced his third presidential bid in a nationally televised speech from New York City in 1979. He campaigned extensively for the primaries after losing the Iowa caucus to former congressman and director of the Central Intelligence Agency Bush. In the primaries, he won 44 states and 59.8 percent of the vote. He decided initially to nominate former president Gerald Ford as his running mate, but Ford wanted such extended powers as vice president, especially over foreign policy, that their ticket would effectively amount to a \"co-presidency\". As a result, negotiations to form a ReaganFord ticket ceased. Reagan then selected Bush as his vice-presidential running mate.\nAt the 1980 Republican National Convention, Reagan garnered the required delegates to be the official nominee. With Carter declining approval ratings and popularity, U.S. senator Ted Kennedy challenged him at the Democratic primaries, but Carter was re-nominated. John B. Anderson, who was a presidential candidate for the Republican Party, left the party and entered the race as an independent candidate. On July 19, Reagan opened his campaign with a tumultuous rally in Texas. There he proclaimed the campaign slogan, \"We Can Make America Great Again.\" He called for a drastic cut in \"big government\" and pledged to deliver a balanced budget for the first time since 1969. At a rally in New York on August 5, Reagan proposed a youth differential in the minimum wage law, for encouraging businesses to hire unskilled and unemployed black youths. Appealing to black voters, he said, \"What I want for America is ... pretty much what the overwhelming majority of black Americans also want.\"\nTwo presidential debates were conducted, but Carter refused to take part if Anderson was included; the first debate was between only Reagan and Anderson. A week before election day, another debate was organized between President Carter and Reagan; Anderson was not invited. On election day, Reagan won the election by a landslide winning 51 percent of the popular vote with 489 electoral votes to Carter's 49 electoral votes. At 69 years old, Reagan was then the oldest non-incumbent presidential candidate to win a presidential election. He was inaugurated on January&nbsp;20, 1981.\nBackground\nin 1976]]\nRonald Reagan was born in Tampico, Illinois, in 1911. After graduating from Eureka College in 1932, he worked as a radio commentator and later became a Hollywood movie actor and union leader. Initially a Democrat, he became a Republican in 1962. While endorsing the Republican presidential nominee Barry Goldwater, he gave his famous \"A Time for Choosing\" speech, which earned him national attention as a new conservative spokesman. In late 1965, he announced his campaign for governor of California in the 1966 gubernatorial election. He won the election, becoming the 33rd governor of California. He was a presidential candidate in the 1968 Republican presidential primaries, but lost to former vice president Richard Nixon in the delegate count, despite winning the popular vote. He was re-elected as governor in 1970 with almost 53 percent of the vote.\nAfter leaving office in 1975, he began his 1976 presidential campaign against the incumbent President Gerald Ford. They were neck and neck in the primaries, but in the end, Ford won more primary delegates than Reagan, but he did not have enough (1,130) delegates to secure the nomination. Both campaigns relied on votes from un-pledged delegates to secure the nomination. Shortly before the 1976 Republican National Convention, Reagan announced Senator Richard Schweiker as his running mate, hoping to pry loose some delegates from Schweiker home state of Pennsylvania; Ford ultimately won the nomination with 1,187 delegates to Reagan's 1,070. He considered Reagan as his possible running mate, but after Reagan told a caucus of the Kansas delegation that he would not accept the vice-presidential nomination, Ford selected Bob Dole. Ford later lost the election to Democratic nominee Jimmy Carter. However, in Washington state, a faithless elector gave Reagan one electoral vote instead of Ford, believing that Ford's stance on abortion was unclear.\nGaining the nomination\nPreparing for a run\nOn November&nbsp;13, 1979, Reagan announced his third presidential bid in a nationally televised speech from New York City, the tenth Republican to do so. His campaign capitalized on his acting skills, showing Reagan speaking in a presidential-looking room. During the speech, he never directly mentioned President Carter but called the current administration's energy policies an \"utter fiasco\" and blamed government spending and deficits for high inflation. He borrowed the phrase \"rendezvous with destiny\" from Franklin D. Roosevelt 1936 acceptance speech. He said:\n}}\nIn a press conference the same day, Reagan named a young U.S. representative, Jack Kemp, as one of his chief campaign spokespersons. This likely helped him counteract the issue of his age. After the speech, Reagan went on a five-day campaign trip to visit 12 cities. He repeated his 1976 proposal to shift some functions of government away from Washington, but his press secretary, James Lake, said that, unlike the earlier version, the new proposal was general and did not spell out programs that would be transferred. He was the front-runner candidate when he announced his campaign.\nRepublican presidential primaries\nThe primary elections and caucuses were held for all 50 states and the Washington, D.C. from January&nbsp;21 to June&nbsp;3, 1980. In addition to Reagan, the major candidates were George H. W. Bush, John Anderson, Howard Baker, John Connally, and Bob Dole. There was speculation about the potential candidacy of former President Gerald Ford, but he declined to run against Reagan. In an upset defeat in the Iowa caucus held on January&nbsp;21, Reagan narrowly lost to Bush. After the win, Bush said his campaign was full of momentum, or \"the Big Mo\", and they would perform even better in the New Hampshire primary.\nThree days before the New Hampshire primary, the Reagan and Bush campaigns agreed to a one-on-one debate sponsored by The Telegraph at Nashua, New Hampshire, but hours before the debate, the Reagan campaign invited other candidates including Dole, Anderson, Baker and Phil Crane. Debate moderator Jon Breen denied seats to the other candidates, asserting that The Telegraph would violate federal campaign contribution laws if it sponsored the debate and changed the ground rules hours before the debate. As a result, the Reagan campaign agreed to pay for the debate. Reagan said that as he was funding the debate, he could decide who would debate. During the debate, when Breen was laying out the ground rules and attempting to ask the first question, Reagan interrupted in protest to make an introductory statement and wanted other candidates to be included before the debate began. The moderator asked Bob Malloy, the volume operator, to mute Reagan's microphone. After Malloy repeated his demand to Malloy, Reagan furiously replied, \"I am paying for this microphone, Mr. Green! [sic]\".}} This turned out to be the turning point of the debate and the primary race. Ultimately, the four additional candidates left, and the debate continued between Reagan and Bush. Reagan's polling numbers improved, and he won the New Hampshire primary by more than 39,000 votes.\nBush defeated Anderson and won the Massachusetts primary with a margin of 0.34 percent, although both received equal numbers of delegates. With the South Carolina primary approaching, political operative Lee Atwater leaked a story to Lee Bandy, a writer for The State newspaper that John Connally had tried to buy the black vote, which nearly destroyed Connally's campaign. Reagan swept to victory in South Carolina, defeating Connally by 14 percent. The next day, Connally formally withdrew from the campaign and endorsed Reagan. With the Illinois primary approaching, the League of Women Voters sponsored a debate between Reagan, Bush, Anderson, and Crane. The candidates criticized Anderson for signing a fund-raising letterseeking supports for liberal Democratic senators, and Reagan questioned whether Anderson was really running as a Republican. Reagan won the Illinois primary with 48 percent of the votes to Anderson's 37 percent.\nReagan continued to win many other primaries and caucuses, although Bush won states like Connecticut, Maine, Pennsylvania, and Michigan. After the Pennsylvania primary, Anderson withdrew from the Republican race and re-entered the race as an independent candidate. On May&nbsp;20, 1980, after the Michigan and Oregon primaries, Reagan secured enough delegates to clinch the nomination for the Republican Party. Reagan said he would always be grateful to the people of Iowa for giving him \"the kick in the pants\" he needed. On May 26, Bush; Reagan's remaining opponent for the Republican nomination conceded defeat and urged his supporters to support Reagan. On June&nbsp;3 (Super Tuesday), Reagan won all nine primaries. With the end of the primaries, Reagan had won 59.8 percent votes to Bush's 23.8 percent and Anderson's 12.2 percent.\nRepublican National Convention\nWith the Republican National Convention approaching, Reagan prepared to select his running mate. Columnist Jack Germond and Jules Witcover wrote in their book Blue Smoke & Mirrors that Reagan's vice-presidential selection began as early as May 1980. His choice for vice presidential running mate included former president Gerald Ford, who revealed it in a CBS interview with Walter Cronkite, saying he was seriously considering the vice presidency. In late May and early June, Dick Wirthlin conducted polls showing that in each category tested Ford rated ahead of all other Republicans being mentioned as possible running mates. Ford's representatives in these negotiations reportedly included Henry Kissinger, Alan Greenspan, and Dick Cheney, who had been Ford's White House chief of staff.\nHowever, after Ford suggested the possibility of a \"co-presidency\" and also insisted that Kissinger be re-appointed as Secretary of State with Alan Greenspan to be appointed as Secretary of the Treasury, negotiations to form a Reagan-Ford ticket ceased. Reagan's other prospects were Bush, Howard Baker, William Simon, Donald Rumsfeld, Richard Lugar, Jack Kemp, Guy Vander Jagt, and Paul Laxalt. Less than twenty-four hours before Reagan had formally accepted the Republican nomination, he telephoned Bush to inform him of his intention to nominate him. On the following day, July&nbsp;17, the final day of the Republican National Convention, Reagan officially announced Bush as his running mate.\nThe 1980 Republican National Convention convened at Joe Louis Arena in Detroit, Michigan.  Notable speakers included Guy Vander Jagt, former treasury secretary William E. Simon, former defense secretary Donald Rumsfeld and former president Gerald Ford. In the roll call vote, Reagan received 1,939 delegates to Anderson's 37 and Bush's 13. Anne Armstrong received one vote. Bush was nominated as the vice-presidential candidate. Reagan accepted the Republican nomination on the final day of the convention. He said:\n}}\nOpponents\nJimmy Carter's first term began with a high approval rating reaching 66 percent, but it soon began to fall; his lowest approval rating was 28 percent. This likely helped other Democrats like Massachusetts senator Ted Kennedy (Former President John F. Kennedy's brother), and Governor Jerry Brown seek the nomination against an incumbent president in the Democratic presidential primaries. Kennedy launched his campaign in late 1979. Momentum built for Kennedy after the attempt to rescue 52 embassy staff held captive at the Embassy of the United States in Tehran on April 25 ended in disaster and increased skepticism of Carter's leadership ability. Although Carter won 32 state primaries including the early states like Iowa and New Hampshire, Kennedy’s 12 victories included some crucial states like Massachusetts, New York and California. Kennedy did not concede to Carter until August&nbsp;11, 1980, at the Democratic National Convention in New York City.\nAnderson was a presidential candidate from the Republican party, but after the Pennsylvania primary, he withdrew from the race and re-entered it as an independent candidate. In a 1992 interview, he recalled the biggest obstacle he faced as an independent candidate was having to qualify for ballot access in 50 states and the District of Columbia. He selected former Wisconsin Governor Patrick Lucey as his running mate. In April 1980, he was polling at 21 percent, which was relatively high for an independent candidate. This remained constant, with little fluctuation, until late July 1980, after which his ratings began to drop. Anderson received endorsements from various newspapers including the Minneapolis Star Tribune, The Boston Globe, the Hartford Courant, the San Jose Mercury News, the Austin American-Statesman, and Florida's largest newspaper the Miami Herald. Most of Anderson's support came from Liberal Republicans who were suspicious of, or even hostile to Reagan's conservative supporters. In late August, he was polling just 14 percent, which later continued to drop to eight percent just before election day.\nCampaign\nInitial developments\nReagan remembered that Franklin D. Roosevelt won the 1932 presidential election because he successfully proved he was not Herbert Hoover. Reagan guessed he would similarly benefit from not being Jimmy Carter. He began his campaign with a tumultuous rally in Texas on July&nbsp;19 with Bush, where he proclaimed the campaign slogan, \"We can make America great again.\" The Carter campaign attempted to deny the Reagan campaign $29.4 million () in federal campaign funds, the legal limit for campaign spending. They claimed he was ineligible for the cash as independent groups with well-known Republican members had donated up to $60 million () for Reagan's campaign. The Federal Election Commission unanimously rejected the plea and approved the payment. At the same time, late July, President Carter's brother, Billy Carter, was being investigated for receiving funds from Libya. In late June and in July, Reagan began to lead Carter in polls. In early August, his lead polling numbers reached 45 percent to Carter's 39 percent and Anderson's 14 percent. On July&nbsp;30, 1980, a Senate committee concluded that Billy had lied to justice examiners, but ultimately found no evidence that he had influenced American policy.\nReagan promised a restoration of the nation's military strength at a time when 60 percent of Americans polled felt defense spending was too low. Reagan also promised an end to \"trust me government\", and to restore economic health by implementing a supply-side economic policy. At a rally in New York on August&nbsp;5, Reagan proposed a youth differential in the minimum wage law to encourage businesses to hire unskilled and unemployed black youths. Appealing to black voters, he said, \"What I want for America is, I think, pretty much what the overwhelming majority of black Americans also want.\"\nThe 1980 campaign has been used as an example of dog-whistle rhetoric. While giving a speech at the Neshoba County Fair in early August, Reagan used the term 'state's rights', and also referred to 'Cadillac-driving welfare queens' and 'strapping young bucks buying T-bone steaks with food stamps'. Some also saw these actions as an extension of the \"southern strategy\" developed by President Richard Nixon to garner white support for Republican candidates. According to the historian Joseph Crespino, the speech was pre-written, and Reagan's visit to the Neshoba County was designed to reach out to the voters inclined toward segregationist George Wallace. Reagan's supporters, however, have pointed out their belief that this was his typical anti-big government rhetoric, with no racial context or intent. C-SPAN|width=250px}}\nAdvertising his campaign was crucial for Reagan. Polls showed that almost 40 percent of the voters knew very little about him or what he stood for. He campaigned extensively, and his political advertisements were broadcast on various television channels. Reagan was an adherent of supply-side economics, which argues that economic growth can be most effectively created using incentives for people to produce (supply) goods and services, such as adjusting income tax and capital gains tax rates. Accordingly, Reagan promised an economic revival that would affect all sectors of the population.\nRallies and debates; the final days\nReagan called for a drastic cut in \"big government\" and pledged to deliver a balanced budget. In the primaries, Bush famously called Reagan's economic policy \"voodoo economics\" because it promised to lower taxes and increase revenues at the same time. In his campaign speeches, Reagan presented his economic proposals as a return to free enterprise principles, a free market economy that had been in favor before the Great Depression and Franklin Roosevelt's New Deal policies. At the same time, he attracted a following from the supply-side economics movement, which formed in opposition to Keynesian demand-stimulus economics. This movement produced some of the strongest Reagan supporters of the campaign.\nThe League of Women Voters announced they would sponsor three presidential debates and one vice presidential debate. They specified John Anderson would be included if he attained an average of 15 percent support in the major national opinion polls. Carter and his advisers were adamant in their refusal to allow Anderson to take part. Although the poll figures were ambiguous, they seemed to suggest that Anderson would cut more deeply into Carter's votes than into Reagan's. Carter's campaign went through the motions of sending a team of negotiators led by Bob Strauss to discuss the debate, but the bottom line remained that there would be no three-way debate. \"We just can't do it,\" Strauss said. \"Whatever it costs, we'll have to take it.\"\n{| class=\"box\" style=\"float:left; margin-right:15px; text-align:left; border:1px solid #aaa; padding:1px; font-size:85%; width:275px;\"\n| bgcolor=\"#DCDCDC\" |\n* Chicago Tribune in Chicago, Illinois\n* New York Post in New York City\n* Albany Democrat-Herald in Albany, Oregon\n* San Diego Union Tribune in San Diego, California\n* Norfolk Virginian-Pilot in Norfolk, Virginia\n* The Detroit News in Detroit, Michigan\n* San Antonio Express-News in San Antonio, Texas\n* Grand Rapids Press in Grand Rapids, Michigan\n* The Telegraph in Alton, Illinois\n* El Paso Times in El Paso, Texas\n* Ada Evening News in Ada, Oklahoma\n* The Plain Dealer in Cleveland, Ohio\n* Alexandria Gazette in Alexandria, Virginia\n* Atlantic News-Telegraph in Atlantic, Iowa\n* Farmington Daily Times in Farmington, New Mexico\n|}\nMeanwhile, the Reagan campaign refused to debate without Carter, while Anderson himself said, \"As far as I'm concerned, any debate is better than no debate.\" After months of negotiations, the league held a debate between Reagan and Anderson, as Carter still refused to participate. On September&nbsp;21, 1980, Reagan and Anderson participated in a presidential debate moderated by Bill Moyers in Maryland. During the debate, Anderson started by criticizing Carter and saying, \"Governor Reagan is not responsible for what has happened over the last four years, nor am I. The man who should be here tonight to respond to those charges chose not to attend.\" Reagan added: \"It's a shame now that there are only two of us here debating, because the two that are here are in more agreement than disagreement.\" Reagan repeated his pledge to balance the federal budget, saying he believed that \"the budget can be balanced by 1982 or 1983\".}}\nBoth candidates strongly disagreed on abortion, with Reagan memorably saying, \"I've noticed that everyone who is for abortion has already been born.\" In the first post-debate survey by ABCHarris, 36 percent of the viewers thought Anderson had performed better, 30 percent favored Reagan and 17 percent thought they were equally effective. CBS took a survey just before the debate; the results were Carter 40 percent, Reagan 36 percent, and Anderson nine percent. Just after the debate, its poll found Reagan at 40 percent, Carter at 35 percent, and Anderson unchanged at nine percent. On October&nbsp;14, Wirthlin concluded from his polls that Carter had moved ahead of Ronald Reagan by two percent for the first time. Reagan himself sensed that his bid for the presidency now seemed to be winding down. While traveling during his campaign in South Dakota, Reagan told his press secretary Lyn Nofziger, \"I think it's about time we consider a debate.\"\nThree weeks before the election, Yankelovich, Skelly and White produced a survey of 1,632 registered voters showing the race almost dead even, as did a private survey by Caddell. Two weeks later, a survey by CBS News and The New York Times showed a similar situation. Although some pollsters reported a slight Reagan lead, ABCHarris surveys consistently gave Reagan a lead of a few points until the last week of October. Thereafter, Reagan trailed Carter in most polls. In the Gallup poll on October&nbsp;26, Jimmy Carter was at 47 percent and Ronald Reagan at 39 percent. On October&nbsp;31, Reagan campaigned in four states – Pennsylvania, Illinois, Wisconsin, and Michigan, which were properly considered \"battleground\" states. A week before election day, the League of Women Voters organized a debate between President Carter and Reagan. John Anderson was not invited because his polling numbers were below 15 percent. Howard K. Smith moderated the debate, and the showdown resulted in among the highest ratings of any television program in the previous decade. Debate topics included the Iranian hostage crisis, and nuclear arms treaties and proliferation. As the debate continued, Carter repeatedly pressed Reagan to explain his earlier statements opposing Social Security. When Carter accurately pointed out that Reagan \"began his career campaigning around this nation against Medicare,\" Reagan looked over at him and said, \"There you go again\" intending to disarm Carter. It emerged as the defining moment of the 1980 presidential election.\nIn his closing remarks, Reagan asked viewers:\n}}\nCNN attempted to include Anderson in the debate from the Constitution Hall in Washington, D.C. CNN Daniel Schorr read the same questions to Anderson. They then aired Anderson's live responses along with a tape delay of Carter and Reagan's responses, despite technical difficulties. Following his solo debate with President Carter on October 28, Reagan overcame the largest deficit since Gallup polling began in 1936. Within one week, the Associated Press reported that the race was \"too close to call\". No vice presidential debates were conducted.\nIn his Election Eve Address \"A Vision for America\" a day before the election day, Reagan said:\n... a shining city on a hill.}}\nElection day\nOn November&nbsp;4, Ronald Reagan and George H. W. Bush defeated Jimmy Carter and Walter Mondale in a landslide victory. Reagan received 489 electoral votes to Carter's 49; the popular vote was approximately 51 percent to 41 percent. Reagan won every state except Georgia (Carter's home state), Maryland, Minnesota (Mondale's home state), Hawaii, West Virginia, Rhode Island, and the District of Columbia. John Anderson won 6.6 percent of the popular vote but won no state outright. Republicans also gained control of the Senate on Reagan's coattails for the first time since 1952.\nCarter's loss was the worst performance by an incumbent president since Herbert Hoover lost to Franklin D. Roosevelt by a margin of 18 percent in 1932, and his 49 electoral college votes were the fewest won by an incumbent since William Howard Taft won only eight in 1912. At 69 years old, Ronald Reagan was the oldest non-incumbent presidential candidate to win a presidential election. Thirty-six years later, in 2016, this record was surpassed by Donald Trump at 70 years old. It was surpassed again by Joe Biden who was elected at 77 years old in 2020, and again by Trump who was elected at 78 years old in 2024. Jimmy Carter conceded to Reagan and said:\n}}\nResults\n*Source (popular vote):\n*Source (electoral vote):\nAftermath and legacy\nmeets with outgoing President Jimmy Carter.]]\nAfter his defeat in the election, President Carter proclaimed his desire for a smooth transition between his outgoing and the incoming administrations. The Reagan transition team was led by Edwin Meese and was headquartered in Washington, D.C. The transition team worked closely with conservative organizations such as the Heritage Foundation, the American Enterprise Institute, and the Hoover Institution, which provided the Reagan transition team with extensive plans for the new administration. President Carter hosted Reagan at the White House on November 20, two months before his inauguration.\nReagan was inaugurated on January&nbsp;20, 1981. Later, it was discovered that the Reagan campaign had acquired President Carter's briefing documents. This leak of campaign papers was not divulged to the public until late June 1983. Carter said that he remained \"completely aloof\" from the investigation within the Reagan administration, while Reagan claimed he had no knowledge of any involvement in any transactions involving materials produced for President Carter. The matter was never resolved as both the FBI and a congressional subcommittee reporting in May 1984 failed to determine how or through whom the briefing book came to the Reagan campaign. The Justice Department, in closing its investigation, cited \"the professed lack of memory or knowledge on the part of those in possession of the documents\".\nReagan was re-elected in 1984 with an overwhelming majority winning every state except Minnesota and the District of Columbia, which were won by his opponent, Walter Mondale. During his term as president, Reagan pursued policies that reflected his personal belief in individual freedom, brought economic changes, expanded the military, and contributed to the end of the Cold War. Termed the \"Reagan Revolution\", his presidency would boost American morale, reinvigorate the U.S. economy and reduce reliance upon government.\nGeorge H. W. Bush, his vice president, was elected as president in 1988, and became the first incumbent vice president to be elected president since Martin Van Buren in 1836. One of the legacies of the campaign was the auditory skills of Ronald Reagan, which earned him the title \"The Great Communicator\". In 2008, the Associated Press wrote, \"Reagan was a master at capturing a debate moment that everyone will remember. His 'there you go again' line defused his opponent's attack.\" David Broder, a political reporter and columnist for The Washington Post, summed up the result of the Nashua debate in a campaign song \"Joshua Fit the Battle\". He wrote:\n}}The campaign slogan popularized by him – \"Let's Make America Great Again\" was subsequently used by candidates such as Bill Clinton in his 1992 campaign and Donald Trump as \"Make America Great Again\" in his 2016 and 2024 presidential campaigns, each of which proved successful.\nSee also\n*1980 Republican Party presidential primaries\n*1980 Republican Party vice presidential candidate selection\n*1980 Republican National Convention\n*1980 United States presidential election\n*Presidential transition of Ronald Reagan\n*First inauguration of Ronald Reagan\n*Jimmy Carter 1980 presidential campaign\n*Ronald Reagan 1984 presidential campaign\nNotes and references\nNotes\nReferences\nWorks cited\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*  Prospect Theory in American Foreign Policy|publisher=University of Michigan Press|year=2001|isbn=978-0-472-08787-7|chapter=The Iranian Hostage Rescue Mission}}\n*\n*\n*\n*\n}}\n*}}\nExternal links\n*[http://www.4president.org/speeches/1980/reagan1980announcement.htm Ronald Reagan announcement speech]\n*[http://www.4president.org/speeches/1980/reagan1980acceptance.htm Ronald Reagan acceptance speech]"
    }
  ]
}