{
  "content": [
    {
      "type": "text",
      "text": "# Rondo Hatton Classic Horror Awards\n\n| coverage         =\n| network          =\n| runtime          =\n| viewership       =\n| producer         =\n| director         =\n| image2           =\n| image2_size      =\n| alt2             =\n| caption2         =\n| precedence_label =\n| higher           =\n| same             =\n| individual       =\n| lower            =\n| related          =\n| module           =\n| previous         =\n| main             =\n| next             =\n}}\nThe Rondo Hatton Classic Horror Awards, often called the Rondo Award, is an annual award founded in 2002 that honors journalism, scholarship and film preservation in the horror genre, particularly of classic horror film and their modern-day counterparts.\nNamed in honor of actor Rondo Hatton, it originated at the Classic Horror Film Board and subsequently moved to a dedicated website. Nominees are chosen by a committee that takes suggestions on the website, with the awards selected via an open vote by generally thousands of participants. The Rondo Award was created by journalist David Colton and artist/illustrator Kerry Gammill, and since its inception has been coordinated by Colton, who serves as their presenter annually at the fantasy/horror convention WonderFest.\nHistory\nThe Rondo Awards began in 2002, after members of the online Classic Horror Film Board, moderated by journalist David Colton, became aware of a growing body of under-recognized journalism covering the horror genre. The awards took their name from the character actor Rondo Hatton, a cult-classic figure in low-budget horror films.\nComic book artist and illustrator Kerry Gammill designed the sculpt for the award, a bust of Hatton's character from the movie House of Horrors (1946).\nThe initial year attracted 168 voters. The following year brought 600, and the third year 2,000. As of 2018, the number of voters is generally between 3,000 and 3,700. Co-founder Colton presents the awards annually at the fantasy/horror convention WonderFest.\nAs Colton describes, \"We don't have Best Actor, we don't have Best Actress, we don't even have Best Director. It's more about the magazines and the books and the independent films and the documentaries.... It's a little highbrow in that way.\"\nSignificance\nEntertainment Weekly likened The Rondo Award to a \"horror Oscar\". The Award is a \"coveted\" prize in the horror community. One PBS station wrote,\nWCFE-TV (Mountain Lake PBS, Plattsburgh, New York)}}\nHorror magazines and websites, including Dread Central, regularly report on the nominations and awards lists.\nThe awards have been mentioned in such outlets as The Hollywood Reporter, The Austin Chronicle, Famous Monsters of Filmland, Movieweb, MeTV, the UK's Horror Channel, and the Tampa Bay Times, as well as scholarly journals including Psychology and Education, and textbooks including Recovering 1940s Horror Cinema: Traces of a Lost Decade.\nMonster Kid Hall of Fame annual awards\nIn their second year, the Rondo Classic Horror Film Awards created the Monster Kid Hall of Fame, with four to nine, but generally six, living or dead inductees. Also created was another honorary award, Monster Kid of the Year, given to individuals with some important achievement in the field that year.\n2003\n* Forrest J Ackerman and James Warren for Famous Monsters of Filmland magazine\n* Movie props and makeup preservationists Bob and Kathy Burns\n* TV horror hosts Zacherley (John Zacherle) and Vampira (Maila Nurmi)\nMonster Kid of the Year: Arnold Kunert, who successfully campaigned for special effects artist Ray Harryhausen to have a star on the Hollywood Walk of Fame\n2004\n* Special effects artist Ray Harryhausen\n* Author Ray Bradbury\n* Special effects makeup artist Rick Baker\n* Historian William K. Everson (posthumously)\n* Brother filmmakers Richard Gordon and (posthumously) Alex Gordon\nMonster Kid of the Year: The Lost Skeleton of Cadavra writer, director, and star Larry Blamire\n2005\n* Artists Basil Gogos and James Bama\n* Filmmaker Roger Corman\n* Musician Bobby \"Boris\" Pickett\n* Midnight Marquee publishers and independent film producers Gary and Sue Svehla\n* Little Shoppe of Horrors magazine publisher Richard Klemensen\nMonster Kid of the Year: Monster Kid Home Movies producer Joe Busam\n2006\n* Married special effects artists Paul and Jackie Blaisdell (posthumously)\n* Writer and filmmaker Donald F. Glut\n* Artist Jack Davis\n* Filmmaker Joe Dante\n* Actor German Robles\n* Painter Frank Frazetta\nMonster Kid of the Year: Toy collector Ray Castile\n2007\n* Museum curators Cortlandt Hull and Dennis Vincent\n* Artist Bernie Wrightson\n* Artist Ed \"Big Daddy\" Roth\n* Writer-editor Archie Goodwin (posthumously)\n* TV horror host Ghoulardi\n* Actor Ben Chapman\nMonster Kid of the Year: Sony Pictures executive Michael Schlesinger\n2008\n* Actor Paul Naschy\n* Married Monsters from the Vault publishers Jim and Marian Clatterbaugh\n* Painter Ken Kelly\n* Castle of Frankenstein publisher Calvin Beck (posthumously)\n* Musician Lux Interior (posthumously)\n* TV horror host Bob Wilkins\nMonster Kid of the Year: Producer and Forrest J Ackerman friend, adviser, and caregiver Joe Moe\n2009\n* Aurora model-kit sculptors Bill Lemon and Ray Meyer (posthumously)\n* Scary Monsters Magazine publisher Dennis Druktenis\n* Historian, critic, and author Bill Warren\n* TV horror host Sammy Terry\n* Cinefantastique publisher Frederick S. Clarke (posthumously)\nMonster Kid of the Year: Monsterpalooza convention organizer Eliot Brodsky\n2010\n* Video Watchdog publisher Tim Lucas and his wife and business partner, Donna Lucas\n* Historian Tom Weaver\n* Fantasy artist William Stout\n* Poster collector and historian Ron Borst\n* Filmmaker George A. Romero\n* Mask maker Verne Langdon (posthumously)\nMonster Kids of the Year: Historian and writer Gary Gerani; screenwriter, author, and The Twilight Zone archivist Marc Scott Zicree\n2011\n* Filmfax editor Michael Stein\n* Photon fanzine editor Mark Frank\n* Actor George Stover\n* Horror scholar David J. Skal\n* Actress Julie Adams\n* Horror host Morgus the Magnificent\nMonster Kid of the Year: Vincentennial fan festival organizer Tom Stockman\n2012\n* G-Fan editor & publisher J.D. Lees\n* Horror host Count Gore de Vol\n* Film researcher and documentary maker Ted Newsom\n* Artist Stephen R. Bissette\n* Scarlet Street/Mondo Cult publisher/editor Jessie Lilley\n* Writer Gary Dorst (posthumously)\nMonster Kid of the Year: Simon Rowson, for discovering lost footage cut from original release of Hammer Studios' Dracula (1958)\n2013\n* Monster-mask maker Don Post Studios\n* Historian Gregory William Mank\n* Horror bookstore owners Del and Sue Howison\n* Castle of Frankenstein writer & editor Bhob Stewart (posthumously)\n* Artist & publisher Larry Ivie (posthumously)\n* Something Weird Video founder Mike Vraney (posthumously)\nMonster Kid of the Year: Paul Larson, for discovering lost Vincent Price PBS footage\n2014\n* Psychotronic editor-publisher Michael Weldon\n* Bela Lugosi historian Gary D. Rhodes\n* Sara Karloff, daughter of actor Boris Karloff\n* Actor José Mojica Marins, a.k.a. the movie character and TV horror host Coffin Joe\nMonster Kid of the Year: Frank J. Dello Stritto, author of memoir I Saw What I Saw When I Saw It\n2015\n* Edgar Allan Poe scholar, preservationist and portrayer Mark Redfield\n* Historian and author Steve Vertlieb\n* Journalist, historian and commentator David Del Valle\n* Horror host Bill \"Chilly Billy\" Cardille\nMonster Kid of the Year: Victoria Price, daughter of actor Vincent Price, \"for her tireless work preserving her late father's legacy in film.\"\n2016\n* Film preservationist Bob Furmanek\n* Writer and horror host John Stanley\n* Writer, critic, and DVD commentator Richard Harland Smith\n* Podcaster Vince Rotolo\n* Historian Mark Miller (posthumously)\nMonster Kids of the Year: Married couple Don and Vicki Smeraldi, new publishers of Scary Monsters Magazine\n2017\n* Horror host Cassandra Peterson (Elvira, Mistress of the Dark)\n* Producer, director and special makeup effects supervisor Greg Nicotero\n* Film memorabilia collector Robert Taylor\n* Film creature sculptor Mike Hill\n* Actor Haruo Nakajima (posthumously)\n* Voice actor June Foray (posthumously)\nMonster Kid of the Year: Cohen Media Group executive Tim Lanza\n2018\n* Memorabilia collector Wes Shank  (posthumously)\n* Author Lucy Chase Williams\n* Horror hosts Charles \"Big Chuck\" Schodowski and \"Lil' John\" Rinaldi\n* Filmmaker and underwater cinematographer/stuntman Ricou Browning\n* Convention organizer Ron Adams\n* Actresses Martine Beswicke, Veronica Carlson and Caroline Munro\nMonster Kid of the Year: Writer, film critic, TV host and actor John Irving Bloom a.k.a. Joe Bob Briggs\n2019\n* Author Robert Bloch\n* Historian Jonathan Rigby\n* Author, editor, podcaster and film commentator Kat Ellinger\n* Filmmaker/Blu-ray producer/film historian Constantine Nasr\n* Sinister Cinema founder Greg Luce\n* Writer George Chastain\n* Author Matthew Hays\n* Horror hosts Ron Sweed (The Ghoul) (posthumously) and Keven Scarpino (Son of Ghoul)\n* Gadfly David \"The Rock\" Nelson\nMonster Kid of the Year: Filmmaker Jordan Peele\n2020\n* Blogger Stacie Ponder\n* Podcaster Derek M. Koch\n* Publisher and critic Joe Kane a.k.a. the Phantom of the Movies (posthumously)\n* Author Michael Robert 'Bobb' Cotter (posthumously)\n* Horror host Rich Koz a.k.a. Svengoolie\nMonster Kid of the Year: UCLA film archivist Scott MacQueen\n2021\n* Comedian Gilbert Gottfried (posthumously)\n* French film historian Jean-Claude Michel, the first foreign correspondent for Famous Monsters of Filmland\n* Attorney and California Celebrities Rights Act instigator Bela G. Lugosi, son of the late horror star Bela Lugosi\n* Artist and director Frank Dietz\n* Film journalist and preservationist Laura Wagner\n* Horror host Erik Lobo a.k.a. Mr. Lobo\n* Cultural critic Maitland McDonagh\nMonster Kid of the Year: Monster Channel horror host Evan Davis a.k.a. Halloween Jack\n2022\n* Cult Movies magazine founder-publisher Buddy Barnett\n* Writer Frank J. Dello Stritto\n* TV historian Amanda Reyes\n* Writer-director-producer Dan Curtis (posthumously)\n* Horror host Penny Dreadful (Danielle Gelehrter)\n* Writer, film critic, TV host and actor John Irving Bloom a.k.a. Joe Bob Briggs. Honorable mention to sidekick Diana Prince a.k.a. Darcy the Mail Girl. Briggs had been named 2018 Monster Kid of the Year.\nMonster Kid of the Year: Documentarian Antonia Carlotta\n2023\n* Convention organizer Anthony Taylor\n* Scary Monsters and Castle of Frankenstein editors-publishers Don and Vicki Smeraldi\n* Actress Barbara Crampton\n* Film historians Walt Lee (posthumously) and Donald C. Willis\n* Writer David J. Schow\nMonster Kid of the Year: Online influencer Bobby Zier\n2024\n* Film Nosferatu (2024 film)\n* Magazine (modern) Fangoria\n* Independent film Late Night with the Devil\n* Website Bloody Disgusting\n* Horror host Svengoolie\n* Writer Alexandra Heller-Nicholas\n*Special Recognition: Lawrie Brewster for reviving Amicus Productions and contributions to independent horror\n* Special Recognition: Staff of We Belong Dead for two-issue retrospective on Japanese horror\nMonster Kid of the Year: Film Preservationist and Blogger Eric Grayson\nReferences\nExternal links\n*[https://rondoaward.com/ The Rondo Hatton Classic Horror Awards official website]\n*[https://www.tapatalk.com/groups/monsterkidclassichorrorforum/rondo-hatton-classic-horror-awards-f100/ The Classic Horror Film Board]\n*\n*"
    }
  ]
}