{
  "content": [
    {
      "type": "text",
      "text": "# Ronnie Edwards (politician)\n\nRodnette Bethley Edwards, known as Ronnie Edwards (July 20, 1952 &ndash; February 24, 2016), was an African-American Democratic member of the Louisiana House of Representatives for District 29 in West and East Baton Rouge Parish, Louisiana. She served for 44 days but did not actually assume the duties of her office because she was in the final stages of a two-year struggle with  pancreatic cancer.\nBackground\nEdwards was born to the late James Bethley and Gladys D. Hammond, her surviving mother, in Woodville in Wilkinson County in southwestern Mississippi. Her House predecessor, Regina Barrow, is also a native of Wilkinson County. Edwards and her husband, Oliver Gene Edwards, Sr. (born July 1950), have two surviving children, Chanel Gene Edwards Ward and husband, Ronald, of New Orleans and Cody Jerome Edwards and wife, Nicole, of Baton Rouge, and two step-children from her husband's prior marriage, Oliver Edwards, Jr., and wife, Priscilla, and Cody Jerome Edwards and wife, Nicole, all of Baton Rouge.\nPolitical life\nEdwards won a runoff election on November 21, 2015 over her fellow Democrat, Edmond Jordan (born June 1971), also of Baton Rouge, 6,887 (59.1 percent) to 4,768 (40.9 percent). She was elected to succeed Representative Regina Barrow, who in turn followed Sharon Weston Broome in the Louisiana State Senate. Both Barrow and Broome are also African-American Democrats. Edwards like Barrow formerly worked for Broome. Gary Chambers of The Rouge Collection wrote that voters should know the candidates' \"plan for the future in specifics, Edwards didn't answer any of [our] questions. Her opponent [Jordan], however, showed up and answered questions. Honestly, in the white community, this would never have happened. We as blacks blindly vote for people, based on name recognition, and we must change this pattern.\" In 2016, Broome was elected as the Baton Rouge Mayor-President.\nEdwards qualified for state representative by proxy in 2015 while she was confined to Baton Rouge General Hospital undergoing treatment. She had earlier undergone treatment from Cancer Treatment Centers of America at the facility in Atlanta, Georgia. Edwards ran for the House hoping that she would survive the cancer and could work to improve health care for the disadvantaged. Freshman State Representative C. Denise Marcelle called Edwards \"a fighter\". Edwards and Marcelle were colleagues on the Baton Rouge Metro Council; Edwards served on the council for six years. Both women were elected to the state House from districts in predominantly black North Baton Rouge.\nKip Holden, Broome's predecessor as Baton Rouge Mayor-President, said that Edwards \"had a key concern for her constituents. She would listen to them and work to improve their quality of life.\"\nEdwards is interred at Heavenly Gates Mausoleum in Baton Rouge. She was succeeded in the House by her former intra-party opponent, Edmond Jordan.\nReferences"
    }
  ]
}