{
  "content": [
    {
      "type": "text",
      "text": "# Ronnie Schwartz\n\n| birth_date =\n| birth_place = Aalborg, Denmark\n| height = 1.83 m\n| position = Forward\n| currentclub =\n| youthyears1 = | youthclubs1 = Ulsted Boldklub\n| youthyears2 = | youthclubs2 = AaB\n| years1 = 2006–2011 | clubs1 = AaB                           | caps1 = 46 | goals1 = 9\n| years2 = 2011–2014 | clubs2 = Randers                        | caps2 = 79 | goals2 = 37\n| years3 = 2014–2016 | clubs3 = Guingamp                | caps3 = 14 | goals3 = 2\n| years4 = 2015–2016 | clubs4 = Guingamp B              | caps4 = 3  | goals4 = 2\n| years5 = 2015      | clubs5 = → Brøndby (loan)               | caps5 = 16 | goals5 = 4\n| years6 = 2016      | clubs6 = → Esbjerg (loan)               | caps6 = 12 | goals6 = 4\n| years7 = 2016–2018 | clubs7 = Waasland-Beveren                          | caps7 = 12 | goals7 = 1\n| years8 = 2018      | clubs8 = Sarpsborg 08              | caps8 = 15 | goals8 = 5\n| years9 = 2018–2020 | clubs9 = Silkeborg                    | caps9 = 47 | goals9 = 37\n| years10 = 2020–2021 | clubs10 = Midtjylland                | caps10 = 15 | goals10 = 6\n| years11 = 2021      | clubs11 = Charlton Athletic  | caps11 = 16 | goals11 = 1\n| years12 = 2022–2023 | clubs12 = Vendsyssel                  | caps12 = 18 | goals12 = 1\n| years13 = 2023      | clubs13 = Hobro                            | caps13 = 11 | goals13 = 0\n| years14 = 2024      | clubs14 = Fredericia                  | caps14 = 10 | goals14 = 0\n| totalcaps = 314 |totalgoals = 109\n| nationalyears1 = 2005\n| nationalteam1 = Denmark U16\n| nationalcaps1 = 3\n| nationalgoals1 = 0\n| nationalyears2 = 2005–2006\n| nationalteam2 = Denmark U17\n| nationalcaps2 = 8\n| nationalgoals2 = 1\n| nationalyears3 = 2006–2007\n| nationalteam3 = Denmark U18\n| nationalcaps3 = 4\n| nationalgoals3 = 2\n| nationalyears4 = 2007–2008\n| nationalteam4 = Denmark U19\n| nationalcaps4 = 6\n| nationalgoals4 = 0\n| nationalyears5 = 2009–2010\n| nationalteam5 = Denmark U21\n| nationalcaps5 = 6\n| nationalgoals5 = 1\n}}\nRonnie “Plaffeministeren” Schwartz Nielsen (born 29 August 1989) is a Danish former professional footballer who played as a striker. He made a total of 27 appearances for various Danish national youth teams, scoring four goals.\nCareer\nAaB\nComing through the youth ranks of AaB, Schwartz signed his first professional contract with the club in January 2006, being described as the future goalscorer for the club. Two years and two first team league appearances later, he signed a new contract that was set to expire in the summer of 2011.\nDespite being marked as a talent, for the remainder of his AaB time, he never managed to establish himself as a regular in the starting eleven. When his contract expired, he decided to leave AaB and join Randers in the Danish 1st Division, who had just been relegated the previous season, signing a three-year contract.\nRanders\nFollowing a good season in the 1st Division, Randers and Schwartz were yet again promoted to the Danish Superliga, finished only behind Esbjerg fB.\nIn his first top flight season for Randers, Schwartz became the top goal scorer with a total of 14 league goals, finishing 5th overall in the league top scorer table. Thus Schwartz ended up playing an integral part of the Randers side that finished 3rd in the league and 2nd in the Danish Cup. His good efforts were rewarded with a new contract, that was set to expire in the summer of 2016.\nagainst Viborg FF in April 2012.]]\nAt the end of the 2012–13 Danish Superliga, Randers achieved qualification for the 2013–14 UEFA Europa League. On 1 August 2013, he thus played his first match in European club competitions, being used as a starter in the 1–2 home defeat to Russian club Rubin Kazan.\nDuring his stint at Randers, Schwartz was lovingly referred to by fans as Plaffeministeren (\"The Minister of Shooting\") for his many shots on target from long distance and tight angles. The term Plaffeministeren has since been used about other players, and even in other sports to refer to someone, who scores many goals; often on hard strikes.\nGuingamp\nOn 11 June 2014, Guingamp announced that they had bought Schwartz from Randers FC. He was their third Danish signing in the summer of 2014, after Lars Jacobsen and Jonas Lössl. He made his debut for the club in the 2014 Trophée des Champions, losing 2–0 to Paris Saint-Germain. On 9 August, he played his first match in Ligue 1, replacing Claudio Beauvue in the 0–2 defeat against Saint-Étienne. On 18 October, he scored his first league goal, in the 1–2 victory away against Lille. He remained in the Guingamp first team for only one season, alternating appearances with the reserve side.\nLoan to Brøndby\nOn 27 July 2015, Schwartz signed a one-season loan deal with Brøndby IF. He made his debut on 30 July in a UEFA Europa League qualifier against Omonia Nicosia as a second half substitute, in a match finishing 0–0. In his first derby against Copenhagen on 27 September, he immediately made an impact in the fourth minute by injuring opposing defender Tom Høgli. After six months at the club, he left halfway through his loan deal after failing to gain a place in the starting lineup of Brøndby.\nLoan to Esbjerg\nOn 29 January 2016, after terminating his loan deal with Brøndby, Schwartz joined Danish club Esbjerg on a six month loan deal. He made his debut for the club on 28 February in a 2–1 away loss to FC Copenhagen, coming on as a substitute in the 64th minute for Mick van Buren. In his following game for the club, he scored his first goal to secure a 1–0 home win over his former club Randers FC, after also making his first start. He made 12 league appearances for Esbjerg, in which he managed to score 4 goals, including a brace against Hobro IK on 23 April. Esbjerg finished 11th in the league table in the 2015–16 season, securing another season in the Superliga by a wide margin. He left the club after his loan ended in June 2016, as a permanent transfer was deemed \"unrealistic\" due to financial limitations by Esbjerg fB staff member Niels Erik Søndergaard.\nOn 12 August 2016, Guingamp announced that they had terminated Schwartz's contract.\nWaasland-Beveren\nOn 24 August 2016, free agent Schwartz signed with Belgian club Waasland-Beveren. He reportedly agreed to a two-year contract. On 27 August, he made his debut as a half-time substitution for Floriano Vanzo in the Belgian First Division A, in the 2–1 loss away against Oostende. On 15 October, he scored his first goal, the 1–0 matchwinner over Eupen. He remained in the team until January 2018, playing a total of 14 games in all competitions, with one goal to his name.\nSarpsborg 08\nSchwartz was officially announced as a new player of Sarpsborg 08 FF on 22 January 2018, signing a two-year contract with the Norwegian club. He made his Eliteserien debut on 11 March, replacing compatriot Mikkel Agger in a 1–0 win over Rosenborg.\nOn 17 March, he scored his first goal in a 2–2 draw at Lillestrøm. He scored a hat-trick on 2 May as Sarpsborg advanced in the Norwegian Football Cup by beating Ørn Horten 6–0.\nSilkeborg\nOn 30 August 2018, it was announced that Silkeborg IF had signed Schwartz on a two-year contract, marking his return to Danish football. Schwartz had a strong first season where he ended up winning the second-tier Danish 1st Division with 25 goals to his name. Silkeborg IF finished in first place in the 1st Division and thus secured promotion to the Danish Superliga for the 2019–20 season.\nMidtjylland\nAfter a number of impressive performances with Silkeborg, including 37 goals in 47 league games, Schwartz was signed by FC Midtjylland in January 2020 on a two-and-a-half-year contract.\nHe made his debut for the club on 17 February, coming on as a substitute in the 61st minute for Lasse Vibe against Lyngby BK, as Midtjylland won 2–0.\nHis first goal for the club came in the following league game against Hobro IK, after having come on at half-time for Vibe once again. He provided the assist to the first goal by Anders Dreyer and scored the second after an assist by Dreyer.\nMostly a substitute at Midtjylland, Schwartz was part of the title-winning team of 2019–20, as he also won the top goalscorers title with 18 goals – the majority of them scored for Silkeborg in the fall.\nCharlton Athletic\nOn 4 January 2021, Schwartz joined Charlton Athletic on a two-and-a-half-year deal. In doing so, Schwartz became the club's first signing of the January 2021 transfer window.\nOn 8 January, he made his debut for Charlton as a substitute for Paul Smyth in a 0–2 home league defeat against Accrington Stanley. A few days later, he bagged his first goal for Charlton, scoring the equaliser in a 4–4 draw against Rochdale.\nOn 6 March 2021, Schwartz missed a 93rd minute penalty with the last kick of the game which would have won the points for Charlton against Oxford United. The game finished 0–0 and left Schwartz with a disappointing return of one goal in 14 games for his new club.\nIn preparation for the 2021–22 season under new manager Nigel Adkins who had joined in March 2021, Schwartz had been demoted to practice with the U23 team in order for him to progress to his level of fitness.\nOn 12 October 2021, it was announced that Schwartz had left Charlton following the termination of his contract by mutual consent.\nVendsyssel FF\nOn 21 October 2021, Danish 1st Division club Vendsyssel FF confirmed, that Schwartz had signed a deal with the club from 1 January 2022. However, he would train with the club until then.\nOn 31 January 2023 Vendsyssel confirmed, that Schwartz' contract had been terminated.\nHobro IK\nOn 8 February 2023, Schwartz signed for Danish 1st Division club Hobro IK on a short-term contract until the end of the season. He left the club again at the end of the season.\nFC Fredericia\nAfter being out of contract since July 2023, FC Fredericia confirmed on 27 March 2024 that the club had signed Schwartz on a short-term deal until the end of the season. After less than two months at the club, Schwartz left Fredericia again at the end of the season.\nStyle of play\nDescribed as a \"natural goalscorer\", Charlton manager Lee Bowyer stated upon his signing in January 2021: \"His finishing is very good, I witnessed it first hand in training today. To see him finishing the way he does and know that he is going to improve is a big plus.\" He continued: \"Strikers tend win you games, once we create chances he is a fox in the box. His work rate is good, his movement is good and he's very clever.\"\nCareer statistics\n{| class=\"wikitable\" style=\"text-align:center\"\n|+ Appearances and goals by club, season and competition\n|-\n!rowspan=\"2\"|Club\n!rowspan=\"2\"|Season\n!colspan=\"3\"|League\n!colspan=\"2\"|Cup\n!colspan=\"2\"|Continental\n!colspan=\"2\"|Other\n!colspan=\"2\"|Total\n|-\n!Division!!Apps!!Goals!!Apps!!Goals!!Apps!!Goals!!Apps!!Goals!!Apps!!Goals\n|-\n|rowspan=\"5\"|AaB\n|2007–08\n|Danish Superliga\n|3||0||2||0||0||0||colspan=\"2\"|—||5||0\n|-\n|2008–09\n|Danish Superliga\n|6||0||1||0||0||0||colspan=\"2\"|—||7||0\n|-\n|2009–10\n|Danish Superliga\n|22||5||2||1||0||0||colspan=\"2\"|—||24||6\n|-\n|2010–11\n|Danish Superliga\n|15||4||4||0||colspan=\"2\"|—||colspan=\"2\"|—||19||4\n|-\n!colspan=\"2\"|Total\n!46!!9!!9!!1!!0!!0!!0!!0!!55!!10\n|-\n|rowspan=\"4\"|Randers\n|2011–12\n|Danish 1st Division\n|22||8||2||2||colspan=\"2\"|—||colspan=\"2\"|—||30||10\n|-\n|2012–13\n|Danish Superliga\n|31||14||5||2||colspan=\"2\"|—||colspan=\"2\"|—||36||16\n|-\n|2013–14\n|Danish Superliga\n|26||15||4||3||2||0||colspan=\"2\"|—||32||18\n|-\n!colspan=\"2\"|Total\n!79!!37!!11!!7!!2!!0!!0!!0!!92!!44\n|-\n|Guingamp\n|2014–15\n|Ligue 1\n|14||2||2||0||2||0||colspan=\"2\"|—||18||2\n|-\n|Brøndby (loan)\n|2015–16\n|Danish Superliga\n|16||4||0||0||3||0||colspan=\"2\"|—||19||4\n|-\n|Esbjerg (loan)\n|2015–16\n|Danish Superliga\n|12||4||0||0||0||0||colspan=\"2\"|—||12||4\n|-\n|Waasland-Beveren\n|2016–17\n|Belgian Pro League\n|12||1||0||0||0||0||colspan=\"2\"|—||12||1\n|-\n|Sarpsborg 08\n|2018\n|Eliteserien\n|15||5||2||3||0||0||colspan=\"2\"|—||17||8\n|-\n|rowspan=\"3\"|Silkeborg\n|2018–19\n|Danish 1st Division\n|27||25||2||1||0||0||colspan=\"2\"|—||29||26\n|-\n|2019–20\n|Danish Superliga\n|20||12||1||2||0||0||colspan=\"2\"|—||21||14\n|-\n!colspan=\"2\"|Total\n!47!!37!!3!!3!!0!!0!!0!!0!!50!!40\n|-\n|rowspan=\"3\"|Midtjylland\n|2019–20\n|Danish Superliga\n|15||6||0||0||0||0||colspan=\"2\"|—||15||6\n|-\n|2020–21\n|Danish Superliga\n|0||0||1||0||0||0||colspan=\"2\"|—||1||0\n|-\n!colspan=\"2\"|Total\n!15!!6!!1!!0!!0!!0!!0!!0!!16!!6\n|-\n|rowspan=\"3\"|Charlton Athletic\n|2020–21\n|League One\n|16||1||colspan=2|—||colspan=2|—||colspan=2|—||16||1\n|-\n|2021–22\n|League One\n|0||0||0||0||colspan=\"2\"|—||0||0||0||0\n|-\n!colspan=\"2\"|Total\n!16!!1!!0!!0!!0!!0!!0!!0!!16!!1\n|-\n|rowspan=\"3\"|Vendsyssel\n|2021–22\n|Danish 1st Division\n|13||1||0||0||colspan=\"2\"|—||colspan=\"2\"|—||13||1\n|-\n|2022–23\n|Danish 1st Division\n|5||0||2||2||colspan=\"2\"|—||colspan=\"2\"|—||7||2\n|-\n!colspan=\"2\"|Total\n!18!!1!!2!!2!!0!!0!!0!!0!!20!!3\n|-\n!colspan=\"3\"|Career total\n!290!!107!!30!!16!!7!!0!!0!!0!!327!!123\n|}\nHonours\nAaB\n*Danish Superliga: 2007–08\nSilkeborg\n*Danish 1st Division: 2018–19\nMidtjylland\n*Danish Superliga: 2019–20\nIndividual\n*Danish 1st Division top scorer: 2018–19 (25 goals)\n*Danish Superliga top scorer: 2019–20 (18 goals)\nReferences\nExternal links\n*"
    }
  ]
}