{
  "content": [
    {
      "type": "text",
      "text": "# Ronold W. P. King\n\n| birth_place       = Williamstown, Massachusetts, U.S.\n| death_date        =\n| death_place       =\n| death_cause       =\n| resting_place     =\n| resting_place_coordinates =\n| other_names       =\n| siglum            =\n| pronounce         =\n| citizenship       =\n| nationality       =\n| fields            =\n| workplaces        =\n| patrons           =\n| education         =\n| alma_mater        =\n| thesis_title      = Characteristics of Vacuum Tube Circuits Having Distributed Constants at Ultra-Radio Frequencies\n| thesis_url        = https://www.proquest.com/docview/301815999/\n| thesis_year       = 1932\n| doctoral_advisor  = Edward Bennett\n| academic_advisors =\n| doctoral_students =\n| notable_students  =\n| known_for         =\n| awards            =\n| author_abbrev_bot =\n| author_abbrev_zoo =\n| spouse            =\n| partner           =\n| children          =\n| parents           =\n| father            =\n| mother            =\n| relatives         =\n| signature         =\n| signature_type    =\n| signature_alt     =\n| website           =\n| footnotes         =\n}}\nRonold Wyeth Percival King (September 19, 1905 – April 10, 2006) was an American applied physicist and electrical engineer, known for his contributions to the theory and application of microwave antennas. He published twelve books and over three hundred articles in his area, as well as mentoring one hundred doctoral dissertations.\nLife\nBorn in Williamstown, Massachusetts, he moved to Rochester, New York, where his father worked as a professor of German. His mother, Edith Seyerlen, was originally from Stuttgart. He earned an A.B. (1927) and S.M. (1929) degree in physics from the University of Rochester. He was an exchange student at the University of Munich (1928–29) and attended Cornell University (1929–30), before completing his graduate studies at University of Wisconsin–Madison (1932) where he obtained a Ph.D. on the thesis Characteristics of Vacuum Tube Circuits Having Distributed Constants at Ultra-Radio Frequencies advised by Edward Bennett and subsequently was a research assistant (1932–34).\nKing was an instructor and assistant professor in physics at Lafayette College (1934–37), and a Guggenheim Fellow overseas (1937, 1958). He joined Harvard University as an instructor (1938), as assistant professor (1939), associate (1942), and as Gordon McKay Professor of Applied Physics (1946–72, taken over by his former student Tai Tsun Wu), and professor emeritus (1972). He resided at Winchester, Massachusetts, and wrote the autobiography A Man of the Twentieth Century.\nHis research group at Harvard spent the 1940s and 1950s developing the theory of antenna, using the cylindrical antenna as a boundary value problem subject to Maxwell's equations. Also, scattering and diffraction of electromagnetic waves from spheres, cylinders, strips, and disks, conducted within earth, under water or in tissue.  King is responsible for the inverted-F antenna, the most widely used antenna in mobile phones.  However, he did not develop this antenna for that purpose.  Rather the intended use was missile telemetry.\nBooks\n* King RWP, Tables of Antenna Characteristics, IFI/Plenum Data Corporation, 1971.\n* King RWP, The Theory of Linear Antennas: With Charts and Tables for Practical Applications, Harvard University, 1956.\n* King RWP, Transmission-Line Theory, Dover, 1965.\n* King RWP, Fikioris GJ, Mack RB, Cylindrical Antennas and Arrays, 2nd ed, Cambridge University, 2002.First edition were published as:Arrays of Cylindrical Dipoles\n* King RWP, Harrison CW, Antennas and Waves: A Modern Approach, MIT, 1969.\n* King RWP, Mimno HR, Wing AH, Transmission Lines, Antennas and Wave Guides, McGraw Hill, 1945.\n* King RWP, Owens M, Wu TT, Lateral Electromagnetic Waves: Theory and Applications to Communications, Geophysical Exploration, and Remote Sensing, Springer, 1992.\n* King RWP, Prasad S, Fundamental Electromagnetic Theory and Applications, Prentice Hall, 1986.Earlier editions were published as:Fundamental Electromagnetic TheoryElectromagnetic Engineering\n* King RWP, Smith GS, Owens M, Wu TT, Antennas in Matter: Fundamentals, Theory, and Applications, MIT, 1981.\n* King RWP, Wu TT, The Scattering and Diffraction of Waves, Oxford University, 1959.\nAwards\n*IEEE Fellow, Life fellow\n*Fellow of the American Physical Society (1941)\n*Fellow of the American Academy of Arts and Sciences\n*Distinguished Service Award from the University of Wisconsin (1973)\n*1983 Prize Paper Award from the IEEE Transactions on Electromagnetic Compatibility\n*Centennial Medal of the Institute of Electrical and Electronics Engineers (1985)\n*Harold Pender Award from The Moore School of Electrical Engineering of the University of Pennsylvania (1986)\n*Distinguished Achievement Award of the Electrical and Electronics Engineers (1997)\n*IEEE Graduate Teaching Award from the Institute of Electrical and Electronics Engineers (1997)\n*Chen-To Tai Distinguished Educator Award from the IEEE Antennas and Propagation Society (2001).\n*Professor R.W.P. King Education Fund (1972)\nNotes\nReferences"
    }
  ]
}