{
  "content": [
    {
      "type": "text",
      "text": "# Ropshitz (Hasidic dynasty)\n\nRopshitz (}},}} }}) is the name of a Hasidic dynasty, or rabbinical family and group, who are descendants of Rabbi Naftali Zvi of Ropshitz (1760–1827). Ropshitz is the name of a town in southern Poland, known in Polish as Ropczyce.\nSeveral contemporary rebbes are styled \"Ropshitzer Rebbe\", in reference to the Ropshitz dynasty: Rebbe Chaim Rubin, Ropshitzer Rebbe of Borough Park, Brooklyn, New York (see Ropshitz branch below), and others.\nLineage\nRebbe Menachem Mendel of Linsk\nRabbi Menachem Mendel Rubin of Linsk (Lesko) (&nbsp;–&nbsp;1803 [23 Tishri 5564]) is often considered the first rebbe of the Ropshitz dynasty. His father, Rabbi Yaakov, was the rabbi of Linsk. He married Beila, daughter of Rabbi Yizchak Halevi Horowitz (called Reb Itzikl Hamburger), the rabbi of \"Ahu\"|he|3=אה\"ו}} (the triple Jewish community of Altona, Hamburg, and Wandsbek). He was a disciple of the Hasidic rebbes Yechiel Michel, the maggid of Zlotshov, and Elimelech of Lizhensk. He was the rabbi of Leshnov (Leshniv); then, , he became the rabbi of Horodenka. In  [], after the death of his father, he inherited the latter's position as the rabbi of Linsk. His descendants continued the rabbinical dynasty of Linsk until the Holocaust. A collection of his writings was published by his descendant Yehoshua Rubin of Baligród as Liḳuṭe Maharam (), appended to his son, Rebbe Naftali of Ropshitz' Ayalah sheluḥah ()&lrm;.\nRebbe Naftali Tzvi of Ropshitz\nRebbe Naftali Tzvi Horowitz of Ropshitz (1760–1827), son of Rabbi Mendl of Linsk. Subsequently rebbe and rabbi of Ropshitz, he succeeded his father as the rabbi of Linsk, and was the rabbi of Strzyżów (Strizhov) as well. His children were Rebbe Avraham Chaim of Linsk, Rebbe Yaakov of Melitz,}} Rebbe Eliezer of Dzhikov, and Ratza, wife of Rebbe Asher Yeshaya Rubin of Ropshitz.}}), son of Rebbe Naftali Tzvi. His father appointed him as the rabbi of Kolbasov (Kolbuszowa). In about 1810, he was chosen by the Jews of Melitz (Mielec) to be the town's rabbi and was smuggled out of Kolbasov (as he was beloved by the townsfolk of Kolbasov, and they did not allow him to leave). In Melitz he began to officiate as a rebbe. His teachings were published from manuscript in  [5754] as Zeraʻ Yaʻaḳov (). Selected portions of this manuscript had been published previously.\nLinsk branch\n* Rebbe Avraham Chaim Horowitz of Linsk ( or &nbsp;–&nbsp;1831), son of Rebbe Naftali Tzvi. He briefly succeeded his father as rabbi of Linsk, but died soon after.\n** Rebbe Menachem Mendel Horowitz of Linsk (died 1868), son of Rebbe Avraham Chaim\n*** Rebbe Avraham Chaim Horowitz (the second) of Linsk ( or &nbsp;–&nbsp;1904), son of Rebbe Menachem Mendel.\n*** Rabbi Yisrael Horowitz of Veislitz (Wiślica), son of Rebbe Menachem Mendel. Rabbi of Veislitz.\nDzhikov branch\n* Rebbe Eliezer Horowitz of Dzhikov (died October 19, 1860 [3 Cheshvan 5621]), son of Rebbe Naftali Tzvi\n** Rebbe Meir Horowitz of Dzhikov (died June 19, 1877 [8 Tammuz 5637]), son of Rebbe Eliezer. Rabbi of Tarnobrzeg (Dzhikov) concurrently with his father's being rebbe there. He succeeded his father as rebbe also. He died in Karlsbad. His teachings were published in ''Imre No'am'' () (Jarosław, 1907).\n*** Rebbe Naftali Chaim Horowitz of Dzhikov (died 1894), son of Rebbe Meir and son-in-law of Rebbe Moshe Unger of the Dombrov dynasty, son-in-law of Rebbe Chaim Halberstam of Sanz. He settled in Safed and later in Jerusalem, and after his father's death refused to return to Poland to lead his father's followers. He was renowned for his mysterious behavior. Author of Minḥah ḥadashah () (Jerusalem, 1880).\n**** Rebbe Betzalel Horowitz of Pilzno (&nbsp;–&nbsp;), son of Rebbe Naftali Chaim. He married Gitele, the eldest daughter of his great-uncle, Rebbe Reuven Horowitz of Dembitz, and was one of his successors as the rebbe of Dembitz, and a contender for the rabbinate of Dembitz. He was the rabbi of Pilzno. He died young.\n***** Rebbe Menashe Horowitz of Pilzno, son of Rebbe Betzalel. He succeeded his father as the rabbi of Pilzno, and died in the Holocaust.\n**** Rebbe Eliezer Nisan Horowitz of Safed (died 1916), son of Rebbe Naftali Chaim. He married Miriam, daughter of Rabbi Yaakov Kahane, the rabbi of Chutzi-Emer (, Ivano-Frankivsk Oblast, Ukraine). After his premature death, she married Rebbe Yisrael Hager of the Vizhnitz dynasty in his second marriage, who raised her three daughters.\n***** Rebbe Mordechai Yehuda Adler, a descendant of the Lelov dynasty and son-in-law of Rebbe Eliezer Nisan Horowitz. After his premature death, his wife, Tzirel, daughter of Rebbe Eliezer, married her step-brother Rebbe Baruch Hager, the Rebbe of Seret of the Vizhnitz dynasty (son of Rebbe Yisrael), who raised her children from her first marriage.\n****** Rebbe Naftali Chaim Adler (1909 or 1914&nbsp;–&nbsp;1995), Dzhikover Rebbe of Netanya, son of Rebbe Mordechai Yehuda and son-in-law of Rebbe Chaim Meir Hager of Vizhnitz\n******* Rabbi Mordechai (\"Motel\") Adler (1952–1989), son of Rebbe Naftali Chaim. He married the granddaughter of the Temeshvarer–Biksader Rebbe. He was the rabbi and rosh hakolel of the Mincha Chadasha synagogue in Borough Park, Brooklyn. He died in a car accident when he was 38 years old.\n******* Rebbe Yisrael Eliezer Adler, Dzhikover Rebbe of Rehovot, son of Rebbe Naftali Chaim and son-in-law of his uncle, Rabbi Moshe Ernster (whose wife was Rebbe Chaim Meir Hager's daughter). In 2012, shortly after the death of his uncle, Rebbe Moshe Yehoshua Hager, he was proclaimed by Rebbe Moshe Yehoshua's successors as \"Dzhikover Rebbe\".\n**** Rebbe Eliyahu Horowitz of Zholin (Żołynia), son of Rebbe Naftali Chaim\n***** Rabbi Menashe Horowitz of Zholin (died 1972), son of Rebbe Eliyahu. He married Matel, daughter of Rebbe Yehuda Unger of Sokolov of the Dombrov dynasty. He was the rabbi of Zholin after his father. His wife and their children died in the Holocaust. He survived and was the unoffical rabbi of the Rayim Ahuvim synagogue of Brownsville, Brooklyn, New York. He was the only wearer of a Shtrimel in the schul, and was widley resepcted for his torah knowlege.\n*** Rebbe Yehoshua Horowitz of Dzhikov (1848–1912), son of Rebbe Meir\n**** Rebbe Alter Yechezkel Eliyahu Horowitz of Dzhikov, son of Rebbe Yehoshua and son-in-law of his uncle, Rebbe Yisroel Hager of Vizhnitz, whose wife was Rebbe Meir Horowitz's daughter\n***** Rebbe Chaim Menachem David Horowitz of Dzhikov (died 1944), son of Rebbe Alter. Last rabbi of Tarnobrzeg.\n***** Rebbe Meir Horowitz, son of Rebbe Alter\n****** Rebbe Yehoshua Horowitz (died 2013), Dzhikover Rebbe of New York, son of Rebbe Meir\n***** Rebbe Yehuda Horowitz of Dzhikov, Jerusalem and London, son of Rebbe AlterAlfasi and Vunder agree that he fled to Vienna in World War I, and thus was still alive in 1914. Vunder writes that he died around 5678 (). Similarly, Alfasi writes that he died before 5680 (). Vunder also cites as mistaken (with no explanation) the date given by Shem ha-gedolim ha-shelishi, 5647 (—as in Dor va-dor ve-dorshav). However, Rebbe Tovia is mentioned as deceased as early as 1899 (Dor va-dor ve-dorshav) and again in 1905 (Gezaʻ Tarshishim). In addition, in accordance with Ashkenazi customs, he must have died before the birth, in , of his grandson of the same given name, Rebbe Tovia Horowitz of Sunik.}}), son of Rebbe Meir. He married the daughter of Rebbe David Spira of Dinov, of the Dinov dynasty. He was the rabbi of Madin, pronounced (and often spelled)  Madin in Southern Yiddish.}} (Majdan Królewski).\n**** Rebbe Bentzion Horowitz of Madin (&nbsp;–&nbsp;), son of Rebbe Tovia. Orphaned at a young age, he was raised by his uncle, Rebbe Yehoshua of Dzhikov. He married Golda Leah, daughter of Rebbe Pinchas Rabinowitz of Kintzk (Końskie) of the Pshischa dynasty. He succeeded his father as the rabbi of Madin, perhaps as early as 1899. During World War I, he lived in Vienna with his son, Rebbe Tovia of Sunik. He died during the Holocaust in a hospital in Rzeszów in  [5700].\n***** Rebbe Tovia Horowitz of Sunik (Sanok) (&nbsp;–&nbsp;), son of Rebbe Bentzion. He married the daughter of his cousin, Rebbe Yehoshua Spira of Ribotitsh of the Dinov dynasty, whose grandfather was Rebbe David of Dinov. He was an active member of the Agudath Israel movement, and one of the founders of the Bais Yaakov movement of Orthodox girls' education, started by Sarah Schenirer.\n*** Rebbe Yechiel Horowitz of Pokshivnitz (Koprzywnica), son of Rebbe Meir and son-in-law of Rebbe David Halberstam of Kshanov (Chrzanów) of the Sanz dynasty. He was the rabbi of Pokshivnitz, directly across the Vistula (then the Galician–Polish border) from Dzhikov. He was later expelled as an Austria-Hungarian national by the government of Congress Poland and he settled in Tarnów.\n*** Rebbe Aharon Horowitz of Beitsh (Biecz), son of Rebbe Meir and son-in-law of Rebbe Chaim Halberstam of Sanz\n**** Rebbe Alter Eliezer Horowitz of Beitsh, son of Rebbe Aharon and son-in-law of Rebbe Moshe Leib Spira of Strizhov of the Dinov dynasty.\n***** Rebbe Chaim Shlomo Horowitz, Strizhover Rebbe of New York. Before the Holocaust, he was the rabbi of Zalizha (, Zakarpattia Oblast, Ukraine).\n*** Rebbe Asher), Przemyśl, 1888), and in his facsimile autograph signature, he signs his name as \"Asher\" only.}} Horowitz of Rimanov (Rymanów) (&nbsp;–&nbsp;1934), son of Rebbe Meir. He was orphaned as a child and was raised by his brother Rebbe Yehoshua of Dzhikov. In his first marriage, he married Malka, daughter of Rebbe Yosef Friedman, rebbe of Rimanov of the Rimanov dynasty, and was a rabbi there. Later he lived in Kraków.\n**** Rebbe Tzvi Chaim Horowitz of Rimanov (died 1939), son of Rebbe Asher. He married Sarah, daughter of his uncle, Rebbe Yisrael Hager of Vizhnitz. He became the rabbi of Rimanov after World War I, when his father settled in Kraków, and succeeded the latter and his maternal grandfather as the rebbe of Rimanov in 1935. His health was frail. He fell ill in 1937, and died two years later. In 1966, he was reinterred in the ohel of his father-in-law in Bnei Brak.\n***** Rebbe (Alter) Moshe Eliezer Horowitz of Rimanov (died ), son of Rebbe Tzvi Chaim and the last Rebbe of Rimanov. He married Chaya Hinda, daughter of his relative Rebbe Naftali Horowitz of Melitz. He succeeded his father first as the rabbi of Rimanov in 1935 and later as rebbe after his father's death in 1939. After escaping the Holocaust for some time in Grosswardein (Oradea), he and his family were deported to Auschwitz and murdered in .\n***** Rebbe Chaim Yaakov Frankel, great-grandson of Rebbe Tzvi Chaim, whose mother, Chava, was Rebbe Tzvi Chaim's daughter.}} one of several contemporary Rimanover rebbes. His wife is the daughter of the Komarner Rebbe of Jerusalem.\n** Rabbi Yisrael Horowitz of Baranov (&nbsp;–&nbsp;1870), son of Rebbe Eliezer. In his first marriage he married Yocheved, daughter of Rebbe David Hager of Zablotov (Zabolotiv) of the Kosov dynasty. Later he married his cousin Beila, daughter of his uncle Rebbe Avraham Chaim Horowitz, the rebbe of Linsk. He was the first rabbi of  Baranov (Baranów Sandomierski), and refused to officiate as a rebbe.\n***Rebbe Avraham Simcha Horowitz of Baranov (1845–1916), son of Rebbe Yisrael. In 1909, after about forty years of being the rabbi — as his father's successor — and rebbe of Baranov, he left Poland and settled in Jerusalem, where he had a synagogue.\n** Rebbe Reuven Horowitz of Dembitz, son of Rebbe Eliezer. Rabbi and rebbe of Dębica (Dembitz). He had no children with his first wife, daughter of his cousin, Rebbe Menashe Rubin of Ropshitz (see Ropshitz branch below). His second wife was the daughter of a son of Rabbi Isser, the rabbi of Rozvadov (Rozwadów). After her death, he married her wealthy uncle's adoptive daughter, with whom he had his other children.\n*** Rebbe Alter Yeshaya Horowitz of Dembitz (&nbsp;–&nbsp;1895), son of Rebbe Reuven (his only son from his second marriage). He succeeded his father as the rabbi and rebbe of Dembitz. He had no children.\n*** Rebbe Shmuel Horowitz of Dembitz (&nbsp;–&nbsp;1921), son of Rebbe Reuven (from his third marriage). He married the daughter of Rabbi Yechiel Wagschal, the rabbi of Frysztak, a descendant of Rebbe Elimelech of Lizhensk. He succeeded his brother Rebbe Alter's positions in Dembitz.\n** Rebbe Moshe Horowitz of Rozvadov (died 1894), son of Rebbe Eliezer and son-in-law of Rebbe Yekusiel Yehuda Teitelbaum\n*** Rebbe Tzvi Hersh Horowitz of Rozvadov, son of Rebbe Moshe\n*** Rebbe Avraham Chaim Horowitz of Plontsh, son of Rebbe Moshe\n*** Rebbe Yitzchak Horowitz (''R. 'Itzikel' Stitshiner) of Szczucin (Stitshin in Yiddish) and Tarnów, son of Rebbe Moshe\n**** Rebbe Yehuda Horowitz (Reb 'Yidele' Stitshiner) of Stitshin and later the Stitshiner Rav in Brooklyn (died 1981), son of Rebbe Yitzchak and son-in-law of Rebbe Yehoshua Spira of Rybotycze of the Dinov dynasty.\n*****Rebbe Eliezer Yehoshua Yudkovsky, grandson of Rebbe Yehuda, current Stitshiner Rov\nRopshitz branch\n* Rebbe Asher Yeshaya Rubin of Ropshitz (&nbsp;–&nbsp;1845), son-in-law of Rebbe Naftali Tzvi, known as Reb Osher'l. He succeeded his father-in-law as rabbi and rebbe of Ropshitz. His teachings were published in Or yeshaʻ () (Lviv, 1876).\n** Rebbe Menashe Rubin of Ropshitz (died 1861), son of Rebbe Asher Yeshaya. His teachings were published in Leḥem Shemena () (Lviv, 1876).\n*** Rebbe Yitzchak Mariles of Ropshitz, son-in-law of Rebbe Menashe\n**** Rebbe Menachem Mendel Mariles of Ropshitz and Dibetzk, son of Rebbe Yitzchak\n***** Rebbe Menashe Mariles of Ropshitz and Dibetzk, son of Rebbe Mendel\n** Rebbe Aharon Rubin of Rymanów (died 1857), son of Rebbe Asher Yeshaya\n*** Rebbe Yaakov Rubin of Baranów (died 1905), son of Rebbe Aharon. He was a rebbe in Baranów, later in Tarnów. He had no children. His stepson, Rabbi Moshe Isser Glantz (son of his wife, Malka) published his writings in Toldot Yaʻaḳov () (Mukachevo, 1908).}} and son-in-law of Rebbe Avraham Reinman, Rabbi of Narol of the Narol dynasty.\n*** Rebbe Shmuel Rubin of Kortshin, son of Rebbe Aharon. He married Yocheved, daughter of Rebbe Elazar Weissblum, son of Rebbe Naftali Weissblum of the Lizhensk dynasty. He succeeded (the unrelated) Rabbi Shmuel Aharon Rubin as the rabbi of Korczyna.\n**** Rabbi Naftali Rubin of Vishnitza (&nbsp;–&nbsp;1938), son of Rebbe Shmuel. He married Chana Malka, daughter of Rebbe Yechezkel Shraga Halberstam of Shineva of the Sanz dynasty. He was the rabbi of Kalvaria (Kalwaria Zebrzydowska), then dayan of Vishnitza (Nowy Wiśnicz), and later the rabbi of the same. He was not a rebbe''.\n***** Rabbi Chaim Baruch Rubin of Vishnitza (&nbsp;–&nbsp;1943), son of Rabbi Naftali. He married the daughter of his cousin, Rabbi Tzvi Yosef Rubin the rabbi of Yaslo. He succeeded his father's position in Vishnitza. He died in the Holocaust.\n***** Rebbe Yona Rubin, the Vishnitzer Rebbe of Nisk (Nisko), son of Rabbi Naftali. He married his cousin, Chana Beila, daughter of his uncle Rabbi Asher Rubin, the rabbi of Kortshin.\n**** Rabbi Asher (Reuven) Rubin of Kortshin, son of Rabbi Shmuel. He was the rabbi of Kortshin.\n** Rebbe Elimelech Rubin of Sokoliv (died ),}} son of Rebbe Asher Yeshaya\n**** Rebbe Shmuel Shmelke Rubin of Seret (died 1901), son of Rebbe Yitzchak (see Seret (Hasidic dynasty))\n**** Rebbe Naftali Tzvi Rubin of Radichov (Radekhiv), son of Rebbe Yitzchak. His wife, Tamar, was the daughter of Rebbe Aryeh Leibush Neuhaus of Tomaszów Lubelski of the Chelm dynasty.\n***** Rebbe Asher Yeshaya Rubin of Zholkiv (Zhovkva) (died 1916), son of Rebbe Naftali Tzvi. His wife was Malka Freida, daughter of Rabbi Chaim Eliyahu Lieberman, the rabbi of Zholkiv. He was a rebbe in Zholkiv, and later the Zholkiver Rebbe in Kshanov (Chrzanów).\n**** Rebbe Elimelech Rubin (known by his epithet , \"Sage Nahor\" - \"the Blind\") of Yavrov (died 1904), son of Rebbe Yitzchak. He was a follower of the rebbes of Belz.\n*** Rebbe Avraham Yehoshua Heshil Rubin of Yaslo (Jasło) (died 1908), son of Rebbe Elimelech. He was the rabbi of Sokołów Małopolski. Later, he was appointed as the first rabbi of Jasło. He later settled in Safed where he was the rabbi of the Galician Jewish community. He died in Safed.\n**** Rebbe Tzvi (Hersh) Yosef Rubin of Yaslo (&nbsp;–&nbsp;), son of Rebbe Avraham Yehoshua Heshil. He succeeded his father as the rabbi of Yaslo after the latter settled in Israel.\n*** Rebbe Alter (Elimelech) Rubin of Sokołów (1847&nbsp;–&nbsp;after 1928), son of Rebbe Elimelech. He succeeded his father and his brother as the rabbi of Sokołów Małopolski.\n** Rebbe Menachem Mendel Rubin of Glogiv (&nbsp;–&nbsp;1873), son of Rebbe Asher Yeshaya. He married Chava Ester, daughter of Rebbe Meir Rothenberg of Apt (\"the Or la-Shamayim\"). In his second marriage, he married his first wife's niece (her brother's daughter).\n*** Rebbe Meir Rubin of Glogiv (1829–1897), son of Rebbe Mendel. His wife was Mirel Gola, daughter of Rebbe Yosef Unger of Dombrov.\n**** Rebbe Chaim Yechiel Rubin of Dombrov (1854&nbsp;–&nbsp;), son of Rebbe Meir. His wife was Devora, daughter of Rebbe Sender Lipa Eichenstein of Zidichov. He was the rabbi of Limna. Later, he was succeeded his maternal grandfather as the rebbe of Dombrov. He died in Berlin.\n*****Grand Rabbi Yissachar Berish Rubin of Dombrova. Rebbe in Berlin, and later in Washington Heights, New York.\n******Grand Rabbi Esriel Rubin of Dombrova, son in law of Rebbe Yisachar Ber Shapiro of Kechneye, Nadvorna Dynasty\n*******Grand Rabbi Naftoli Tzvi Rubin of Dombrova-Monsey, son of Rabbi Esriel of Dombrova[1]\n**** Rebbe Shalom Rubin of Reisha-Ruskaviesh (Ruska Wieś|pl|3=Ruska Wieś (Rzeszów)}}, Rzeszów) (1856&nbsp;–), son of Rebbe Meir. His wife was Chana Mindel, daughter of Rebbe Simcha Spira, son of Rebbe Elazar Spira of Lantzhut of the Dinov dynasty.\n**** Rebbe Yitzchak Tovia Rubin of Sanz (1858–1927), son of Rebbe Meir. His wife, Nechama was the daughter of Rebbe Chaim Halberstam of Sanz. He was a rebbe in Nowy Sącz (Sanz) after his father-in-law's death.\n***** Rebbe Arye Leibish Rubin of Tomaszów Lubelski and Cieszanów (died 1942), son of Rebbe Yitzchak Tovia and son-in-law of his cousin, Rebbe Simcha Yissachar Ber Halberstam of Cieszanów, son of Rebbe Yechezkel Shraga Halberstam of Sieniawa.\n****** Rebbe Shalom Yechezkel Shraga Rubin (died 1986), Tsheshanover Rebbe in New York, son of Rebbe Arye Leibish.\n****** Rebbe Simcha Yissachar Ber Rubin,  Tsheshanover Rebbe in New York, son of Rebbe Arye Leibish and son-in-law of Rebbe Yehoshua Eichenstein of Grosswardein of the Zidichov dynasty.\n**** Rebbe Baruch Rubin of Brezdovitz (, Lviv Oblast, Ukraine) and Gherla (then called Szamosújvár) (1864–1935), son of Rebbe Meir. He married Sara Shlomzti, daughter of Rebbe Menachem Mendel Eichenstein of Zidichov. (She survived him and settled in Jerusalem, where she was a rebbe.) He was the rabbi of the community of his father-in-law's followers in Berezdivtsi, where he adopted the customs and style of prayer (nusach) of the Zidichov dynasty. Later he was a rebbe in Kolomyia. During World War I, he fled from Kolomyia to Dej. After a brief stay in Dej, he settled in nearby Gherla. His writings were published as ''She'erit Barukh () (Jerusalem, 1973).His son-in-law Rebbe Moshe Frisherman of the Tomashov dynasty (husband of his daughter Mindel) succeeded him as the rebbe of Gherla until the Holocaust, in which his first wife and their children died. (Later he was known simple as the rebbe of Tomashov.)Another son-in-law of Rebbe Baruch, Rebbe Tzvi Hersh Kahane, was the ancestor of the Kahane branch of the Spinka dynasty.\n***** Rebbe Yaakov Yisrael veYeshurun Rubin of Sulitz and Sasregen (30 Kislev 5645 [December 18, 1884], Zhydachiv,&nbsp;–&nbsp;15 Sivan 5704 [June 6, 1944]), son of Rebbe Baruch. His first wife, Rechil, was the daughter of Rabbi Mordechai Yosef Moshe Moskowitz, rebbe of Suliţa (Sulitz), through whose influence he was appointed as the rabbi of Sulitz in approximately 1909. After her death, he married Alte Nechama Malka, daughter of Rabbi Chaim Dachner of Seret, a descendant of the Kosov and Belz Hasidic dynasties (see Seret (Hasidic dynasty)). They both died in the Holocaust.\n****** Rebbe Menachem Mendel Rubin (&nbsp;–&nbsp;2007), Muzhayer Rebbe, son of Rebbe Yaakov Yisrael veYeshurun and son-in-law of Rebbe Chaim Meir Yechiel Horowitz of Raniżów (see Melitz branch above). He succeeded his father-in-law as the rebbe of Selish (Vynohradiv) and officiated as the rabbi of Muzhay (, Zakarpattia Oblast, Ukraine). Rabbi of the Khal Yeshurun Ropshitz congregation of Ocean Parkway, Brooklyn, New York.\n******* Rebbe Chaim (Meir Yechiel Moshe) Rubin, Ropshitzer Rebbe of Borough Park, Brooklyn, son of Rebbe Menachem Mendel and son-in-law of his uncle, Rebbe Shmuel Shmelka Rubin, the Sulitzer Rebbe. He is a disciple of his maternal great-uncle, Rebbe Yoel Teitelbaum, the Satmarer Rebbe. His great-uncle appointed him as the Rosh ha-Kolel (dean of a kollel) of his Kolel in Kiryas Joel, New York, in around 1977. Later, at the Rebbe'' of Satmar's suggestion, he settled in the \"Ropshitz\" neighborhood of Kiryas Joel and founded a synagogue called \"Kedushas Yom Tov\". Later he settled in Borough Park, Brooklyn, where his synagogue, Cong. Zera Kodesh Kedushas Yom Tov D'Ropshitz, is located, and is now known as the Ropshitzer Rebbe Also  cousin with Spinka Rebbe of Jerusalem .\n****** Rebbe Shmuel Shmelka Rubin (1925&ndash;2013 [http://www.jdn.co.il/news/235313]), Sulitzer Rebbe, son of Rebbe Yaakov Yisrael veYeshurun and son-in-law of Rebbe Yissachar Ber Rosenbaum of Stroznitz. Rabbi of the Sulitz congregation of Far Rockaway, Queens, New York.\n****** Rebbe Mordechai David Rubin, Sasregener Rebbe, son of Rebbe Yaakov Yisrael veYeshurun and son-in-law of Rebbe Yehoshua Eichenstein of Grosswardein of the Zidichov dynasty. Rabbi of K'hal Sasregen congregation in the Midwood neighborhood of Brooklyn, New York.\n******* Rabbi Yaakov Yisrael veYeshurun Rubin, Brizdovitzer Rov of Borough Park, Brooklyn—rabbi of the Brizdovitz congregation.\n***** Rebbe Meir Yosef Rubin of Kerestir (Bodrogkeresztúr) (died 1944), son of Rebbe Baruch. He married Rivka Tzirel, daughter of Rebbe Avraham Steiner, the Rebbe of Kerestir. He succeeded his father-in-law's position in Kerestir. He died in the Holocaust.\n****** Rebbe Yissachar Berish Rubin, Kerestirer Rebbe of New York, son of Rebbe Meir Yosef. He was for a rebbe for a while after the Holocaust in the town of Kerestir; later he emigrated to the United States.}}), son of Rebbe Mendel. His first wife was his cousin, daughter of Rebbe Leibush Neuhaus of Tomaszów Lubelski of the Chelm dynasty, whose wife was his mother's sister. In his second marriage, he married Hesa, daughter of Rebbe Elazar Hopstein of Kozhnitz of the Kozhnitz dynasty. His father appointed him as the rabbi of Glogov in his stead.\n**** Rebbe Alter Moshe Chaim Rubin of Raniżów and Glogov (&nbsp;–&nbsp;), son of Rebbe Yaakov Yosef. In his first marriage, he married Yehudis, daughter of Rebbe David Spira, Rebbe of Dinov (Dynow) of the Dinov dynasty. He was the rabbi of Raniżów, later of Glogów in his father's place (some 25 years after the latter's death). His second wife was Pearle (née Freilich), daughter of R' Menachem Yakov Freilich.\n**** Rebbe Elazar Rubin (&nbsp;–&nbsp;1933), Sasover Rebbe of New York, son of Rebbe Yaakov Yosef (from his second marriage). After his father's premature death, Rebbe Chaim Halberstam of Sanz raised him. In his first marriage, he married the daughter of Rebbe Uri Langner of Rohatyn of the Stretin dynasty. In his second marriage, he married Rechel, daughter of Rebbe Shlomo Mayer, Rebbe of Sasov (Sasiv, Ukraine) of the Alesk dynasty (his children were from his second marriage). He was first a rebbe in Glogov. Then, in around 1919, he was asked by the American followers of the Sasov dynasty to settle in the United States to be their Rebbe, to which he acquiesced. He wrote Zikhron Elʻazar () (Lviv, 1930), with an introduction describing his family and personal history. He died in New York.His daughter (from his second marriage), Chava Sara (died in childbirth, 1916), was the mother of Rebbe Yaakov Yosef Weisz of the Spinka dynasty, ancestor of the extant Weiss branch of the Spinka dynasty.\n***** Rebbe Chanoch Henich Dov Rubin, Sasover Rebbe of London, England, son of Rebbe Elazar (from his second marriage).\n***** Rebbe Yosef David Rubin (&nbsp;–&nbsp;1983), Sasover Rebbe of New York, son of Rebbe Elazar (from his second marriage). His first wife was the daughter of Rebbe Yisrael Horowitz of Melitz. furthermore, Sosha, her husband and children died in the Holocaust, while Rebbe Yosef David Rubin died in 1983, as mentioned above.}} His second wife was the daughter of Rebbe Shalom Reuven Rosenfeld of the Kaminka dynasty, grandson of Rebbe Chaim Halberstam of Sanz.\n*** Rebbe Asher Yeshaya Rubin of Stashov (died 1936), son of Rebbe Mendel (from his second marriage). His wife was Sheindel, daughter of Rebbe Avraham Yitzchak Weissblum of Stashov of the Lizhensk dynasty. He settled in Cologne after World War I.\n**** Rebbe Avraham Yitzchak Rubin of Chirov, son of Rebbe Asher Yeshaya. Even Vunder mentions Rebbe Yehoshua only in reference to his son, Rebbe Avraham Yitzchak, the rebbe of Chirov, who died in the Holocaust. In his later works, however, Vunder writes (citing Rebbe Avraham Yitzchak's descendants) that Rebbe Avraham Yitzchak of Chirov was the son of Rebbe Asher Yeshaya of Stashov. (So too in the pages of testimony submitted by his descendants to Yad Vashem.) Thus, unless there were two rebbes in Chirov named Avraham Yitzchak Rubin who died in the Holocaust, \"Rebbe Yehoshua of Chirov\" did not exist.}} He was a rebbe in Chirov. He died in the Holocaust.\n** Rebbe Yechiel Rubin of Kolbasov (&nbsp;–&nbsp;1860), son of Rebbe Asher Yeshaya. Rabbi of Kolbuszowa (Kolbasov) from . He was succeeded by his son-in-law, Rebbe Avraham Aharon Teitelbaum of the Siget dynasty.\n*** Rebbe Asher Yeshaya Rubin of Kolbasov (&nbsp;–&nbsp;1914), son of Rebbe Yechiel. His wife, Chana Shifra, was the daughter of Rebbe Sender Safrin, the eldest son of Rebbe Yitzchak Eisik Yechiel Yehuda Safrin of Komarno, founder of the Komarno dynasty.\nNotes\nReferences\n*\n::Alfasi's system divides Ropshitz into two dynasties: Ropshitz proper (p. 268), comprising the Linsk, Melitz, and Dzhikov branches, and Ropshitz II (p. 335), comprising the Ropshitz branch.\n*\n*\n*\nFurther reading\nGeneral\n*\nDzhikov branch references\n*\n*\n*\nRopshitz branch references\n* (in Or yeshaʻ () by Rebbe Asher Yeshaya of Ropshitz)\n* This edition includes:\n**Liḳuṭe Maharmam () by his son Rebbe Menachem Mendel of Glogiv (in Or yeshaʻ)\n**Liḳuṭe Maharam () by his son Rebbe Meir of Glogiv (in Or yeshaʻ)\n**Facsimiles (including annotated transcriptions) of manuscripts by and about members of the Ropshitz dynasty\n**Sheʼerit Barukh () by his son Rebbe Baruch of Brezdovitz\n**Gilyone yosher (), by his son Rebbe Yaakov Yisrael veYeshurun of Sulitza\n**Zeraʻ ḳodesh matsavtah (), a genealogical treatise by his son Rabbi Asher Yeshaya (who died in the Holocaust).\nExternal links\n*[http://mfile3.akamai.com/14123/wm2/muze.download.akamai.com/2890/us/uswm2/_!/298/311298_1_15.asx?auth=daEasaucna9dEaIbxbSdycVdSbea3dZadaO-beBGds-Ci-idadf&aifp=1234&obj=v10207 Meditative Tune from Ropshitz]\n*[http://mfile3.akamai.com/14123/wm2/muze.download.akamai.com/2890/us/uswm2/_!/298/311298_1_16.asx?auth=daEbWaldWbqcudvbWbSc2dhbAdHalb.bqd5-beBGds-Ci-idbek&aifp=1234&obj=v10207 \"Mazel Tov\" Tune from Ropshitz]\n*[http://mfile3.akamai.com/14123/wm2/muze.download.akamai.com/2890/us/uswm2/_!/298/311298_1_17.asx?auth=daEdSaEdqcjcdbIbwbUbGaucPadahbyc_af-beBGds-Ci-edaei&aifp=1234&obj=v10207 Dance Tune from Ropshitz]\n*[http://www.jewishstore.com/music/ra/acc14-7.ram Waltz from Ropshitz - played by Andy Statman]"
    }
  ]
}