{
  "content": [
    {
      "type": "text",
      "text": "# Rosebud Battlefield State Park\n\n| locmapin             = Montana#USA\n| area                 =\n| built                = 1876\n| website = [https://fwp.mt.gov/stateparks/rosebud-battlefield Official website]\n| architect            =\n| architecture         =\n| designated_nrhp_type = August 19, 2008\n| added                = August 21, 1972\n| refnum               = 72000735\n}}\nRosebud Battlefield State Park in Big Horn County, Montana preserves a large portion of the battlefield of the Battle of the Rosebud, fought on June 17, 1876.  The battle is known by various other names such as The Battle Where the Girl Saved Her Brother by the Northern Cheyenne, and '''Crook's Fight on the Rosebud'''.  A National Historic Landmark, the park is a day use facility offering hiking, hunting, picnicking and wildlife viewing.  It is located  south of Kirby, Montana on Montana Highway 314.\nSetting\nView of the battlefield, undated NPS photo\nRosebud Battlefield State Park is located in a rural setting of Big Horn County, Montana, southeast of Billings and just east of the Northern Cheyenne Indian Reservation. It is located west of Montana Highway 314, in an area of rolling prairie characterized by numerous ridges.  Immediately to the south of the battlefield is a mesa, below which Rosebud Creek meanders in a generally easterly direction.\nThe park has an information kiosk and vault toilet at its entrance, and a rough gravel road traverses around the main battlefield area, but is otherwise undeveloped.\nHistory\nMap showing the battle movements\nThe Battle of the Rosebud, fought on June 17, 1876, marked a turning point in the Great Sioux War of 1876, in which the United States sought to force Native American tribes in the region onto reservations.  United States Army forces under the command of General George Crook were attacked here by a mixed force of Lakota Sioux and Cheyenne commanded by Crazy Horse, stopping an advance that was part of an intended three-pronged movement against Native villages in Bighorn area.  Over a six-hour period, the battle extended across a nearly  area along Rosebud Creek.  It was tactically a stalemate, but Crook failed to make the planned rendezvous and withdrew from the theater of war, ultimately leaving General George Armstrong Custer exposed to defeat at the Battle of the Little Bighorn a week later.\n}}\nExternal links\n*[https://fwp.mt.gov/stateparks/rosebud-battlefield/ Rosebud Battlefield State Park] Montana Fish, Wildlife & Parks\n*[https://fwp.mt.gov/binaries/content/assets/fwp/pdfs/stateparks/parkmaps/rosebud-battlefield-park-map.pdf Rosebud Battlefield State Park Map] Montana Fish, Wildlife & Parks"
    }
  ]
}