{
  "content": [
    {
      "type": "text",
      "text": "# Ross King (academic)\n\n| discipline = Linguistics of Korean\n| workplaces = University of British Columbia\n}}\nJulian Ross Paul King (born 25 February 1961), commonly Ross King, is a Canadian linguist and Koreanist. He is a Professor of Korean Language and Literature at the University of British Columbia. Previously, he was head of the Department of Asian Studies there from 1 July 2008 to 30 June 2020.\nEducation\nKing's parents emigrated from England to the United States in 1957. He grew up in Wisconsin. King attended the Concordia Language Villages from ages 10 to 18. He graduated from Phillips Exeter Academy in 1979. King first became interested in the Korean language during his second year of undergraduate studies at Yale University. He first visited South Korea in 1981. King claims to be self-taught in the language; at the time, there was a lack of good textbooks on Korean and Yale did not offer Korean language courses. He received his Bachelor of Arts in Linguistics and Political Science from Yale in 1983. He received his Master of Arts and PhD in Linguistics from Harvard University in 1986 and 1991 respectively.\nCareer\nKing is a researcher in Korean historical linguistics, Korean dialectology (especially Koryo-mar, the dialect of Koryo-saram), and literary culture in the Sinographic Sphere. In 2022, he spent a year as a visiting scholar at Sungkyunkwan University in South Korea.\nKing is also a vocal advocate for greater South Korean private and public investment in international language learning of Korean, in order to capitalize on and sustain the success of the Korean Wave. In 1999, he established Sup sogŭi Hosu, or the Korean Language Village, in Minnesota, United States, to encourage Korean language immersion. In 2015, he and John Duncan jointly established the Inter-University Center for Korean Language Studies (IUC; ) at Sungkyunkwan University in Seoul, South Korea. The program is partnered a number of universities, such as Harvard and the University of California, Los Angeles, and provides training and resources for Korea-related academic research. In 2018, he took over as editor-in-chief of the Sungkyun Journal of East Asian Studies from Boudewijn Walraven.\nKing has received a number of awards for his contributions to the linguistics of Korean and Korean language education. In 2000, he received a commendation from the Prime Minister of South Korea. In 2022, he was given the Oesol Award (), which was named for the Korean linguist Choe Hyeon-bae (whose art name was Oesol). In 2025, he and his former PhD student Dafna Zur jointly received the Manhae Prize.\nPersonal life\nKing has studied and academically written about a number of different languages. Besides English, he has studied French, German, Russian, Spanish, Japanese, Chinese, and Korean. He is married to a South Korean woman, whom he met at Harvard.\nReferences"
    }
  ]
}