{
  "content": [
    {
      "type": "text",
      "text": "# Ross River (Queensland)\n\nRoss River}}\nsettler\n| image              = Ross River and Aplins Weir.jpg\n| image_size         = 280\n| image_caption      = Ross River as it runs through Townsville suburbs, with Aplins Weir visible on right\n| map                =\n| map_size           =\n| map_caption        =\n| pushpin_map        = Australia Queensland\n| pushpin_map_size   =\n| pushpin_map_caption= Location of Ross River river mouth in Queensland\n| subdivision_type1  = Country\n| subdivision_name1  = Australia\n| subdivision_type2  = State\n| subdivision_name2  = Queensland\n| subdivision_type3  = Region\n| subdivision_name3  = North Queensland\n| subdivision_type4  =\n| subdivision_name4  =\n| subdivision_type5  = City\n| subdivision_name5  = Townsville\n| length             =\n| width_min          =\n| width_avg          =\n| width_max          =\n| depth_min          =\n| depth_avg          =\n| depth_max          =\n| discharge1_location= Near mouth\n| discharge1_min     =\n| discharge1_avg     =\n| discharge1_max     =\n| source1            = Hervey Range\n| source1_location   = below Pepper Pot Mountain\n| source1_coordinates=\n| source1_elevation  =\n| mouth              = Coral Sea\n| mouth_location     = South Townsville\n| mouth_coordinates  =\n| mouth_elevation    =\n| progression        =\n| river_system       =\n| basin_size         =  to\n| tributaries_left   = Ross Creek, Goondi Creek\n| tributaries_right  = Stuart Creek\n| custom_label       = Reservoirs\n| custom_data        = Black Weir; Gleeson's Weir;  Aplin's Weir; Ross River Dam\n| extra              =\n}}\nThe Ross River is a river in North Queensland, Australia. The  long river flows through the city of Townsville and empties into the Coral Sea.   It is the major waterway flowing through Townsville and the city's main source of drinking water.\nThe river is named in 1864 after William Alfred Ross (-1887), first publican of the settlement who later became a mayor of Townsville in 1868.\nCourse and features\nThe river rises in the Hervey Range below Pepper Pot Mountain and flows generally north through Lake Ross, across a flat coastal plain and east around  into Townsville city. The Ross River flows across the Townsville suburbs of , , , , ,  and . The river is joined by three minor tributaries including Ross Creek, before reaching its mouth south east of Townsville. This area is currently being developed into a marina precinct. Flow rates in the river are controlled by the Ross River Dam, the largest dam in the catchment. There are seven crossings over the river and three weirs exist along the river. The river has a catchment area of  of which an area of  is composed of estuarine wetlands.\nRoss River Parkway\nThe Ross River Parkway is a series of parks, community facilities and pedestrian bridges which stretch from The Vickers Bridge (formerly the Twin Cities Bridge), Douglas to Rooney's Bridge, Railway Estate which are interlinked by more than  of shared use pathways. The parkway is used for recreation by many people who exercise or play in the parkland or along the network of paths, but was also designed to provide a safe network of paths to link the Townsville central business district to outlying suburbs. The parkway was developed over a series of years with funding from the Townsville City Council and Queensland Government and linked a series of existing parks, paths and bridges together. Notable facilities in the Ross River Parkway include Riverway, Tony Ireland Stadium, Riverside Lodge, Rossiter Park, The Palmetum, Aplin's Weir Rotary Park, Bicentennial Park and Black, Gleeson's and Aplin's Weirs.\nWeirs\nBlack Weir\nBlack Weir, formerly Black School Weir, is the most upstream weir of those on Ross River. Built in the early 1930s, Black Weir is a hollow buttress weir with an ogee shaped face on the downstream side, a sloped face on the upstream face and stone pitched abutments. The weir's name is derived from the name of Black School that abutted Ross River near the location of weir when it was constructed. Following damage to the weir due to flooding, the weir underwent major renovations in 1934. These renovations included the addition of a second pump well, the addition of further buttresses and the underpinning of the original structure. It took until 1936 to fill the reservoir behind the weir, but only provided a few years water supply. During World War II the large influxes of population as a result of Townsville's heavy military presence necessitated the provision of more water. In 1940 a galvanized iron wall was erected atop Black Weir to provide additional storage capacity to supplement the town's water supply. This continued for many years in order to provide additional water which could be pumped from the weir.\nGleeson's Weir\nGleeson's Weir crosses the Ross River between the Townsville suburbs of Cranbrook and Douglas. It was the first built of three weirs in the Ross River. Built downstream of Gleeson's Farm, its namesake, the weir was completed in 1908 as part of the damming process to secure and stabilise water supply for local residents. This weir could potentially store  of water. However, water was not pumped from the reservoir above Gleeson's Weir until approximately 1923 due to the necessity to release water to downstream aquifers.\nAplin's Weir\nAplin's Weir lies downstream of Gleeson's Weir and is the last weir before the mouth of the river. Aplin's Weir started out as small stop weir, built in 1927 to prevent incursion of salt water into the water supplies pumped from the upstream Top River wells, located at the end of Thompson Street, Mundingburra. The original stop weir consisted of a curtain of sheet steel which was driven into the sand to the clay bed. This stop weir protruded approximately  above the sand level, with a concrete overflow section and also prevented water, released from the upstream Gleeson's Weir, which had previously percolated downstream, from doing so.\nIn October 1943 the construction of a permanent concrete weir at this location began. This was completed and began use in January 1944 and became known as Aplin's Weir. The weir consisted of a hollow buttress weir with sloped walls on both sides of the weir and concrete abutments. repairs occurred several times during the 1950s after flood damage. The downstream slope of Aplin's Weir has in recent years deteriorated and much of the concrete slope has collapsed exposing the buttresses. The weir received a significant upgrade in 2011(??).\nIn the late 1990s a bridge connecting the suburbs of Mundingburra and Annandale was built, using the footings of Aplin's Weir for support. In February 2019 the bridge was swept away in floods waters. This was caused by too much water coming out of the Ross River Dam due to 1 in a 100-year rain.\nThe area of water stored between Gleeson's Weir and Aplin's Weir is primarily used for recreational activities with the Townsville & JCU Rowing Club, a dragon boat club, kayakers and stand up paddle-boarders all using the river. This section of the river is used for local rowing regattas, especially the 1000m racing course above the Barton bridge.\nEvery year the Townsville Open Water Association holds the Liz Birch memorial King and Queen of the river swim. This is a  swim that starts at Aplins weir and proceeds to the Barton bridge and back to Rossiter park pontoon. The oldest person to undertake this swim is 79-year-old Thelma Burke. Aquatic weed issues in the river in recent years seem to have prevented this event from occurring as regularly as in the past (at least in this location).\nRoss River fever\nRoss River fever is a serious, though generally not life-threatening, tropical disease caused by infection by the Ross River virus, a mosquito-borne alphavirus. In 1959, an Aedes vigilax mosquito sampled from the banks of the Ross River was used to isolate the virus. The virus and fever were named after Ross River. However, Ross River fever is not isolated to the Ross River and surrounding areas. There have been major outbreaks of the disease in all Australian states through mosquito-borne infection with Ross River virus.\nEcology\nThe Ross River has two distinctly different ecosystems. Above the Aplin's Weir is a freshwater environment, and below the weir there is a tidal brackish/saltwater environment.\nFreshwater crocodiles can be found above Aplin's Weir, whilst Saltwater crocodiles live in the tidal area downstream\nSee also\n}}\n*\nReferences\nExternal links\n* [https://www.townsville.qld.gov.au/__data/assets/pdf_file/0005/21011/HERITAGE-INFO-SHEET-6-Ross-River-Weirs.pdf Ross River Weirs Heritage Info from Townsville City Council]\n*\n*\n*"
    }
  ]
}