{
  "content": [
    {
      "type": "text",
      "text": "# Roughly Speaking (film)\n\n| writer         = Louise Randall Pierson (screenplay)Catherine Turney (uncredited)\n| narrator       =\n| starring       = Rosalind RussellJack Carson\n| music          = Leo F. Forbstein\n| cinematography = Joseph Walker\n| editing        = David Weisbart\n| studio         = Warner Bros.\n| distributor    = Warner Bros.\n| released       =\n| runtime        = 117 minutes\n| country        = United States\n| language       = English\n| budget         = $2,156,000\n| gross          = $2,578,000\n}}\nRoughly Speaking is a 1945 American romantic comedy film directed by Michael Curtiz and starring Rosalind Russell and Jack Carson. The plot involves a strong-minded mother keeping her family afloat through World War I and the Great Depression. The film was based on the autobiography of the same name, published in 1943, by Louise Randall Pierson.\nPlot\nLouise Randall Pierson (Rosalind Russell) does not have an easy life. When she is a teenager, her beloved father dies, leaving her, her mother, and her sister in financial difficulty. However, heeding her father's advice to shoot for the stars, she remains undaunted. She goes to college and learns typing and shorthand; on her first (temporary) job, she overcomes the prejudice of her new boss, Lew Morton (Alan Hale, Sr.), against women workers.\nThen, although they have very different ideas about a woman's place, she marries Rodney Crane (Donald Woods), who goes to work in the banking industry. Four children are born in rapid succession. Louise nurses her brood through a bout of infantile paralysis; one is left somewhat lame. After 10 years though, Rodney tires of her self-reliance and divorces her to marry a younger woman with a traditional idea of what a wife should be.\nA year later, Louise meets Harold C. Pierson (Jack Carson), who is less driven, but just as unconventional. After only a few hours acquaintance, he asks her to marry him, and she (somewhat to her own surprise) accepts. They have a son. Louise inspires Harold to venture into his family's business and take a loan to build greenhouses for growing roses. They are just about to clear the last $30,000 of their debt when the market collapses due to oversupply. They have to sell most of their possessions and take to the road.\nThey then encounter Svend Olsen (John Qualen), an aircraft builder in need of financing. Harold and the children overcome her resistance, and they commit their time and money to the venture. However, once again, their timing is bad. The day after the aircraft prototype is completed and shown to enthusiastic potential backers, the stock market crashes. The family is uprooted once more.\nTwo sons go to Yale University, and one of the daughters gets married. The rest of the family manages to survive with various jobs, including selling vacuum cleaners and parking cars at the 1939 New York World's Fair. Then, on Louise's birthday, Germany invades Poland and starts World War II. Soon, all three sons enlist; the youngest is only 17, but gets his mother's reluctant consent to join the United States Army Reserve. As he eagerly rushes to the recruitment center, Louise laments to her husband about her failure to provide their children with a stable, prosperous life. He assures her that her indomitable example, undaunted by failure after failure, is all they need, that they may be down from time to time, but never will be out. The two start to discuss their next project, which is buying a farm.\nCast\n* Rosalind Russell as Louise Randall Pierson\n* Jack Carson as Harold C. Pierson\n* Robert Hutton as John Crane, ages 20–28\n* Jean Sullivan as Louise Jr., ages 18–26\n* Donald Woods as Rodney Crane\n* Alan Hale, Sr. as Lew Morton\n* Andrea King as Barbara, ages 21–29\n* Mona Freeman as Barbara, ages 15–20\n* Robert Arthur as Frankie at 17\n* Ray Collins as John Chase Randall\n* John Qualen as Svend Olsen\n* Kathleen Lockhart as Henrietta Louise Randall\n* Ann E. Todd as Louise Randall as a child (as Ann Todd)\n* Ann Doran as Alice Abbott\nProduction\nWarner Bros. purchased the film rights to the autobiography Roughly Speaking, based on the life of Louise Randall Pierson, for $35,000. Principal photography for Roughly Speaking took place from late April to mid-July 1944.\nRosalind Russell and Jack Carson reprised their roles in Roughly Speaking for Lux Radio Theatre on October 8, 1945.\nReception\nThe story connecting a long timeline of a half-century, resulting in Roughly Speaking emerging as a 150-minute feature, that after previews, was cut back to 117 minutes. The detailed plot was noticeable and although the film was generally well received by audiences, was an aspect of the film that many reviewers noted. Bosley Crowther of The New York Times gave the film a favorable review. \"The charmingly giddy life story of Louise Randall Pierson, which that lady quite frankly told with considerable gusto and good humor in\nRoughly Speaking a couple of years ago, has now been used to peg a picture which follows, roughly, the same general line ...\"\nBox office\nAccording to records at Warner Bros., the film earned $1,850,000 in the U.S. and $728,000 in other markets.\nSee also\n* Frank Pierson, American screenwriter and film director who was a son of author Louise Randall Pierson.\nNotes\nReferences\nBibliography\n* Aylesworth, Thomas G. The Best of Warner Bros. London: Bison Books, 1986. .\nExternal links\n*\n*\n*"
    }
  ]
}