{
  "content": [
    {
      "type": "text",
      "text": "# Round University Ranking\n\n}}\n| issn =\n}}\nRound University Ranking (RUR Ranking) is a Moscow, Russia-based world university ranking, assessing effectiveness of 700 leading world universities based on 20 indicators distributed among 4 key dimension areas: teaching, research, international diversity, and financial sustainability.\nThe Round University Ranking has been published since 2010. 700 universities were evaluated in the RUR 2016 edition, including 91 higher education institutions of the BRICS economies.\nMethodology\nThe RUR rankings are based entirely on InCites, the evaluation and benchmarking engine from Thomson Reuters for scientific research. The raw data for RUR Ranking is provided within a special annual survey run by Thomson Reuters - Global Institutional Profiles Project (GIPP). The data for GIPP is collected annually in April - May. Altogether there are 20 indicators divided into four groups: teaching, research, international diversity and financial sustainability. The first two groups obtain 40 percent each, the second ones get 10 percent. The final methodology also includes the weight of each of the 20 indicators and is shown below\nApart from the main Overall Ranking, which is calculated based upon 20 indicators in accordance with the methodology described above, the RUR system also demonstrates 4 additional rankings which echo the main groups of rating groups of indicators:\n* Teaching Ranking\n* Research Ranking\n* International Diversity Ranking\n* Financial Sustainability Ranking\nRound University Rankings contain all of the indicators used in the Times Higher Education (THE) world rankings, except for the \"industry innovation: income\" indicator. The rankings also include some additions such as national and international measures of teaching reputation, citations per academic and research staff, papers per academic and research staff, papers per research income and normalized citations impact.\n{| class=\"wikitable\"\n|-\n!Teaching\n!40 %\n!Research\n!40 %\n|-\n|Academic staff per students\n|8 %\n|Citations per academic and research staff\n|8 %\n|-\n|Academic staff per bachelor's degrees awarded\n|8 %\n|Doctoral degrees awarded per admitted PhD\n|8 %\n|-\n|Doctoral degrees awarded per academic staff\n|8 %\n|Normalized citation impact\n|8 %\n|-\n|Doctoral degrees awarded per bachelor's degrees awarded\n|8 %\n|Papers per academic and research staff\n|8 %\n|-\n|World teaching reputation\n|8 %\n|World research reputation\n|8 %\n|-\n!International Diversity\n!10 %\n!Financial Sustainability\n!10 %\n|-\n|Share of international academic staff\n|2 %\n|Institutional income per academic staff\n|2 %\n|-\n|Share of international students\n|2 %\n|Institutional income per students\n|2 %\n|-\n|Share of international co-authored papers\n|2 %\n|Papers per research income\n|2 %\n|-\n|Reputation outside region\n|2 %\n|Research income per academic and research staff\n|2 %\n|-\n|International level\n|2 %\n|Research income per institutional income\n|2 %\n|}\nCurrent rankings\n{| class=\"wikitable\"\n!#\n!World university rankings\n|-\n|1\n| Harvard University\n|-\n|2\n| California Institute of Technology (Caltech)\n|-\n|3\n| Stanford University\n|-\n|4\n| Massachusetts Institute of Technology (MIT)\n|-\n|5\n| Imperial College London\n|-\n|6\n| University of Pennsylvania (UPenn)\n|-\n|7\n| Peking University (PKU)\n|-\n|8\n| Yale University\n|-\n|9\n| University of Oxford\n|-\n|10\n| University of Chicago (UChi)\n|-\n|11\n| University of Cambridge\n|-\n|12\n| Northwestern University\n|-\n|13\n| ETH Zurich (Swiss Federal Institute of Technology)\n|-\n|14\n| Princeton University\n|-\n|15\n| Columbia University\n|-\n|16\n| Washington University in St. Louis\n|-\n|17\n| Tsinghua University\n|-\n|18\n| Cornell University\n|-\n|19\n| École Polytechnique Fédérale de Lausanne (EPFL)\n|-\n|20\n| University College London (UCL)\n|}\nNotes\n* The data used in the RUR ranking has a 3-year delay to the year of publication of the rankings. For example, RUR Ranking 2015 is based on 2012 year data.\n* Reputational data (indicators 5, 10, 14) is collected through a special survey which is annually conducted by Thomson Reuters in the GIPP project via Academic Reputation Survey. Each year 10,000 scientists, who are pre-selected by Web of Science Core Collection are involved in the survey. Respondents indicate their subject area and can select up to 16 best universities in the field of both teaching and research.\n* Bibliometrical indicators are calculated via InCites analytical system. They are calculated for the following types of documents: articles, reviews, notes.\n* Period of annual publications counting (indicators 9, 13). For the Normalized Citation Impact indicator 5-year publications and citations period is used. Other publications are used with a 3-year lag.\n* Period for counting citations from the year of accounting publications and ending date of the last update InCites system at the time of discharge. On average, it is 2½–3 years. It is important to note that regardless of the accounting period, citations, comparable data, as number of citations increases in proportion to the period under consideration for all publications.\n* The period of registration of publications for the Normalized Citation Impact: 5 years (e.g., 2008-2012 rankings for 2015 RUR). Period accounting citation - before the last update InCites. On average, it 6-6½ years.\nReferences\nExternal links\n* [https://web.archive.org/web/20160304130924/http://www.rur-agency.com/ RUR Agency]\n* [https://roundranking.com/ Round University Ranking]"
    }
  ]
}