{
  "content": [
    {
      "type": "text",
      "text": "# Rowing at the 1938 British Empire Games\n\nAt the 1938 British Empire Games, the rowing competition featured four events for men  with only four nations competing and all four events having only three starters.\nThe sport had not been included at the 1934 British Empire Games in London but returned in 1938 with events being held 50 kilometres to the west in Penrith, where a one and a quarter mile stretch of the Nepean River was selected. Because of the location being so far away from the athletes village at the Sydney Showground, the rowers were accommodated at the Lapstone Hill Hotel (a former mansion called Logie).\nAustralia topped the rowing medal table with three gold medals.\nMedal table\n}}\nMedal winners\nThe double sculls competition was an invitation event and originally no medals were awarded but they are counted in the medal table today.\n{|\n|-\n|Single sculls\n|\n|\n|\n|-\n|Double sculls\n||\n||\n||\n|-\n|Coxed four\n|\n|\n|\n|-\n|Eights\n|\n|\n|\n|}\nResults\nSingle sculls\n{|class=\"wikitable\" style=\"font-size: 100%\"\n|-\n!width=20| Pos\n!width=250|Athlete\n!width=150|Time\n|-align=center\n|1 || align=\"left\"| Herb Turner  || 8:24\n|-align=center\n|2 || align=\"left\"| Peter Jackson  || 5 lengths\n|-align=center\n|3 || align=\"left\"| Robert Smith || 4 lengths\n|}\nDouble sculls\n{|class=\"wikitable\" style=\"font-size: 100%\"\n|-\n!width=20| Pos\n!width=350|Athlete\n!width=150|Time\n|-align=center\n|1 || align=\"left\"| Cecil Pearce & William Bradley  || 7:29.4\n|-align=center\n|2 || align=\"left\"| Jack Offer & Dick Offer  || 9 lengths\n|-align=center\n|3 || align=\"left\"| Gus Jackson & Robert Smith  || 10 lengths\n|}\nCoxed four\n{|class=\"wikitable\" style=\"font-size: 100%\"\n|-\n!width=20| Pos\n!width=600|Athlete\n!width=150|Time\n|-align=center\n|1 || align=\"left\"| Don Fraser, Gordon Freeth, Jack Fisher, Stewart Elder, Harry Kerr (cox)  || 7:16.8\n|-align=center\n|2 || align=\"left\"| Albert Hope,  John Rigby, Ken Boswell, Jim Clayton, George Burns (cox) ||+1.25 lgths\n|-align=center\n|3 || align=\"left\"| Donald Davis, James Temple, James MacDonald, Max Winkler, Kenneth Jaggard (cox)   || +0.75 lgths\n|}\nEights\nTim Turner was included in the England eight which caused controversy because he lived in Australia and was only selected in the team because he was born on England and was formerly a member of the London Rowing Club which the rest of the team belonged to. London RC member Roger Harman vacated the seat to allow Turner to compete in the crew.\n{|class=\"wikitable\" style=\"font-size: 100%\"\n|-\n!width=20| Pos\n!width=650|Athlete\n!width=150|Time\n|-align=center\n|1 || align=\"left\"| Basil Beazley, Desmond Kingsford, John Sturrock, John Burrough, John Turnbull, Peter Jackson, Rhodes Hambridge, Tim Turner, William Reeve (cox)||6:29\n|-align=center\n|2 || align=\"left\"| Joe Gould, Alfred J. Gregory, Ted Bromley, Francis A W le Souef, Gordon H Yewers, Richard L. Paramor, William Godfrey Thomas, Bill Dixon, Doug Bowden (cox)  || +0.75 lgths\n|-align=center\n|3 || align=\"left\"| Gus Jackson, Cyril Stiles, Rangi Thompson, Howard Benge, John Charters, Les Pithie, Oswald Denison, James Gould, William Stodart (cox) ||+2 lgths\n|}\nReferences"
    }
  ]
}