{
  "content": [
    {
      "type": "text",
      "text": "# Roxas (Kingdom Hearts)\n\nis a character from Square Enix's video game franchise Kingdom Hearts, who first appears in Another Side, Another Story, a bonus trailer found in Kingdom Hearts, and later as a cameo during the final scenes of Kingdom Hearts: Chain of Memories, before making his first full appearance in Kingdom Hearts II. He is a Nobody, born from series protagonist Sora after he briefly lost his heart during the events of the first game. Kingdom Hearts II reveals that Roxas is a member of Organization XIII, a group of Nobodies who recruit him for his ability to wield the Keyblade, a weapon that allows him to capture hearts. As a member of Organization XIII, Roxas bears the title . He is also the protagonist of the video game Kingdom Hearts 358/2 Days, which focuses on his time in Organization XIII. Roxas is voiced by Koki Uchiyama in Japanese and Jesse McCartney in English.\nDirector Tetsuya Nomura has stated that Roxas is an important character in the series, and that Kingdom Hearts 358/2 Days was created to expand on his backstory. Since his introduction in Kingdom Hearts II, Roxas has received positive critical response from video game publications, who praised his development in 358/2 Days. Various merchandise based on Roxas has been produced.\nCreation and development\nAfter his cameo at the end of Kingdom Hearts: Chain of Memories, the series' director, Tetsuya Nomura, was questioned about the character. However, he refrained from revealing too much about him, stating that he would become an important, playable character for the franchise. The developers wrote Roxas' story in Kingdom Hearts II to add mixed feelings to the game in a short time frame; after receiving a positive fan response to Roxas' scenario, Nomura concluded that it was well-executed. He also stated that Roxas' merging with Sora in the game was one of the most memorable scenes in the series for him. Nomura later commented that Roxas was one of the first characters created for Organization XIII and was always intended to be its thirteenth member. The meaning of Roxas' name was meant to be revealed in a scene in Kingdom Hearts II that shows the letters in the word \"Sora\" rearranged with the \"X\" added to expand the connection between the characters. However, this scene was omitted since Nomura found it difficult to implement time-wise. Since his debut in Kingdom Hearts II, Roxas has been voiced by Koki Uchiyama in Japanese and Jesse McCartney in English.\nis the voice of Roxas in English.]]\nAfter the release of Kingdom Hearts II Final Mix, Nomura wanted to expand Roxas' role in the series to explain the events between his birth and his disappearance from Organization XIII. For Kingdom Hearts 358/2 Days, the staff thought that Roxas' role as a member of the group would be a suitable theme for the plot. Roxas was chosen as the game's protagonist since the staff felt that having a protagonist other than Sora would help to introduce gamers to the series' first Nintendo DS title. Co-director Tomohiro Hasegawa explained that Roxas was originally shorter, and the staff decided he should grow taller as the game continued to develop. Nomura wanted to portray Roxas' activities differently from Sora's, since Sora is on a journey around the world while Roxas always returns to Organization XIII after each mission. The staff constructed Roxas' interactions with the Disney characters differently from Sora's, as Organization XIII was meant to be secret in the game's story. Nomura told the writers that he wanted Roxas to learn something or have something to think about from each of his missions. Nomura later clarified that Roxas' personality was different from how he was portrayed in Kingdom Hearts II, as he does not actively attempt to come into contact with other characters. With 358/2 Days, Nomura wanted to reveal why Roxas left Organization XIII, and although he found it to be a sad story, he considered Zack Fair's fate in Crisis Core: Final Fantasy VII to be more tragic. Nomura felt that Roxas' last words in the game were also its most significant, as he wanted them to connect to Kingdom Hearts IIs first scene, which is the same scene. Uchiyama expressed sadness when the game's development ended, as he would not play the character for a long time.\nKingdom Hearts II Final Mixs secret ending features the character Ventus, who resembles Roxas; Nomura commented that, despite their similarities, Roxas and Ventus are not the same character. He also said that when playing Kingdom Hearts Birth by Sleep, players will be able to distinguish Roxas from Ventus. In another interview, Nomura implied that the characters were related, specifically to Sora, but wanted fans to imagine reasons for such a connection. He also stated that in Kingdom Hearts III, there was a possibility of Roxas being revived despite Sora being alive at the same time, which would be explained by the fact that Xehanort's Heartless and Nobody, Ansem and Xemnas, exist at the same time as he does. Originally, Roxas was not meant to return, but positive response to his character led to his inclusion.\nCharacteristics\nPhysically, Roxas resembles Ventus due to him being present in Sora's heart when Roxas was born. Due to his nature as a Nobody, he is an \"empty shell\" of Sora, created after he sacrifices his heart and becomes a Heartless during the events of Kingdom Hearts. As a result, despite his teenage appearance, Roxas is one day short of a year old when he rejoins Sora in Kingdom Hearts II. As a civilian, he wears a white jacket over a black jacket as well as white trousers. As a member of Organization XIII, he wears a hooded black coat that covers most of his body. His weapon is the Keyblade known as the , which resembles a skeleton key with a silver keychain extending from the hilt and a Mickey Mouse token on the end of it. In 358/2 Days, the player can modify Roxas' Keyblade using the game's panel system. Roxas gains the ability to dual wield Keyblades after leaving Organization XIII, and exclusively uses the weapon's  and  forms for each.\nRoxas' personality changes significantly across the series because, when he is first introduced, he has fake memories that make him believe he is a normal teenager and spends most of his time with his friends. After learning that he is Sora's Nobody and remembering his past, Roxas gives up his existence so that Sora can continue to exist, but expresses happiness for his fate. Unlike other Nobodies, Roxas lacks the memories of his human counterpart, causing his personality to develop separately from Sora.\nAppearances\nRoxas first appears in Another Side, Another Story, a bonus trailer found in Kingdom Hearts, and in the ending of Kingdom Hearts: Chain of Memories. In Kingdom Hearts II, Roxas is introduced as a boy living in a computer simulation of Twilight Town. Unaware of the virtual nature of the city, Roxas begins to dream about the adventures of Sora. He later encounters Axel, a member of Organization XIII under orders to extract him from the simulation, and Naminé, a Nobody who informs him that he is Sora's Nobody. Shortly after meeting DiZ, the creator of the virtual world, Roxas learns the true nature of Twilight Town and that DiZ altered his memory and personality to mislead his pursuers from Organization XIII until he can merge with Sora. DiZ leads Roxas to an old mansion where he rejoins with a sleeping Sora, allowing him to awaken. Sora later learns that Roxas is his Nobody, born during the events of the first game after he briefly became a Heartless, and was inducted into Organization XIII for his ability to capture hearts with the Keyblade. However, Roxas later betrayed Organization XIII and encountered Riku, who captured him to restore Sora. Roxas makes two appearances near the end of the game, first in a mental battle with Sora in a cutscene, and second alongside Naminé, who has merged with Kairi. In the re-released version, Kingdom Hearts II Final Mix, Roxas' fight against Sora is expanded, making him a boss character. The battle was meant to be interactive in Kingdom Hearts II, but time constraints imposed by creating fights for the other Organization XIII members prevented its inclusion. With the opportunity to include the fight, Nomura's team worked hard to make it entertaining for players. Additional scenes about Roxas' past were included in the game to add to the mystery surrounding him.\nKingdom Hearts 358/2 Days, a prequel to Kingdom Hearts II, reveals Roxas' life with Organization XIII. Unlike the other Organization members, he lacks memories of his previous life. Roxas is placed under Axel's watch and the two become friends. After Axel is sent to Castle Oblivion, Roxas is partnered with Xion, Organization XIII's fourteenth member and another Keyblade wielder, whom he befriends. Roxas reacts to the restoration of Sora's memories and starts questioning why he uses the Keyblade, causing him to doubt Organization XIII's motives. Upon discovering that Xion is a replica created by Xemnas from Sora's memories, Roxas is compelled to defect from Organization XIII to find answers and meet Sora. He is confronted by Xion, who Xemnas repurposed to absorb him so that she can become a complete replica; after she sacrifices herself by allowing Roxas to kill her so that Sora can regain his memories, she entrusts Roxas with freeing the hearts the Organization captured before returning to Sora's heart. While heading to confront Xemnas, Riku confronts Roxas and knocks him unconscious to help DiZ and Naminé wake Sora.\nA virtual representation of Roxas appears as a boss in the mobile game Kingdom Hearts Coded, in which he confronts a virtual representation of Sora. He later appears in the ending as one of the people connected to Sora's heart who may return one day. Roxas makes a cameo appearance at the end of Kingdom Hearts Birth by Sleep, where he is shown with Xion and Axel eating sea-salt ice cream in Twilight Town, as well as in Kingdom Hearts 3D: Dream Drop Distance, where he contacts Axel and Sora through dreams. Roxas also appears in Shiro Amano's manga and Tomoko Kanemaki's novels, where he reprises his role from the video games. The book Kingdom Hearts: Another Report includes the novel Roxas–Somewhere in Time, which retells Roxas' days in Organization XIII, with the exception of his befriending Xion.\nIn Kingdom Hearts III, Roxas, Xion, and Naminé are resurrected after Ienzo, Vexen, and Demyx transfer their hearts into replica bodies, with Roxas joining the Guardians of Light in defeating Xehanort and closing Kingdom Hearts. Roxas and Xion join Lea on Twilight Town's clock tower, along with Isa, Hayner, Pence, and Olette, and eat ice cream together. They are then brought to Destiny Islands to celebrate their victory, where Roxas races with Riku and Terra on the beach.\nRoxas also appears in Super Smash Bros. Ultimate as a spirit.\nReception\nEver since his first cameo in the secret endings of the first Kingdom Hearts game, Roxas has been a popular character to GameSpy for the fighting skills he shows in The World That Never Was, fighting multiple Heartless while wielding two Keyblades until his clash with Riku. In a collaboration between Square Enix and Japanese fashion brand SuperGroupies, his image was used to create clothing. Roxas' character has received a positive critical response from both fans ranking twenty-eighth in a Famitsu poll featuring the most popular video game characters from Japan. In another poll, Roxas was voted the second most popular Kingdom Hearts character, with his fight against Sora ranked as the best scene from the series. Roxas' popularity also led to the inclusion of a fanmade mod that replaces Sora in Super Smash Bros. Ultimate. During his the character's official debut, IGN and Eurogamer said that Roxas was a likable kid with a sense of mystery. Game Informer emphasized his role as a \"troubled boy,\" calling his story arc \"an amazing chain of events,\" particularly noting that the revelation of his nature as a Nobody creates a \"devilish yet remarkable plot twist\" which may impact the player in a way that he \"may not want Sora back\".\nIn \"Playing God: An Analysis of Video Game Religion\", Roxas's existence and is given parallels to Christianity due to the importance of him being the 13th member of Organization XIII as number 13 is important in Christianity, 13 is considered unlucky in reference to the Last Supper before Jesus' death. The sacrifice of the thirteen Nobodies in the franchise to revive the antagonist Xehanort is compared to the devil while Roxas' death also causes the revival of Sora, who is presented similar to Jesus. The queer subtext in Roxas' relationships were also analyzed by Anime Feminist. In the case of Xion, the character is a replica of Sora who befriends Roxas who sees the new partner as a female companion rather than Sora. When Roxas is forced to kill Xion in 358/2 Days, Xion obtains happiness that Roxas still sees her as her own rather than another Sora. However, whether a romantic relationship possible was not explored by the narrative. Roxas' relationship with Axel was also seen as potential queer subtext due to the kindess but never developed. In \"Kingdom Hearts II Is Full Of Bad Romances And Rad Bromances\", Kotaku Roxas and Axel have a strong relationship in Kingdom Hearts II comparable to Cloud Strife and Zack Fair from Final Fantasy VII as well as Auron and Jecht in Final Fantasy X. This is especially supported when Axel tries to revive Sora as he confesses he was the only person he liked in his life and Sora brought him the same feelings.\nIn \"Kingdom Hearts II: Boss Fight Book\", Alexa Ray Corriea commented that the first hours of the game were the most boring, not only due to the common activities in Twilight Town, but also because Roxas lacks the appeal that makes Sora an entertaining character. Before Kingdom Hearts 358/2 Days was released, 1UP.com featured Roxas at the top of their \"Why You Should Care About Kingdom Hearts 358/2 Days\" feature, calling him \"The darling of fanfiction and doujinshi writers everywhere,\" and commenting on what he does during his year within Organization XIII.\nDue to his resemblance to Ventus, video game publications initially thought that Roxas would be one of the protagonists in Kingdom Hearts Birth by Sleep. However, when it was revealed that the two were different, publications still discussed their similarities and if there was a connection between them. In retrospect, Paste Magazine found Sora's story and links with his two similar other selves, Roxas and Ventus, to be confusing more than Solid Snake's relationships with his other rivals who were cloned from Big Boss in Metal Gear.   While GameRant noted people were happy with his return in Kingdom Hearts III after several sad installments exploring his relationship with Organization XIII, MeriStation felt it Roxas' revival appeared to have not properly explored to the point of calling it a plothole. Nevethteless, his reunion with Axel and Xion following their split has been called by RPGFan to be one of the most emotional moments in RPGS in 25 years.\nExistencial crisis\nRoxas' identity crisis and connections with other being is explored in \"Memoria: A Rhetorical Analysis Of Sticking To And Spreading From JRPG’s And Their Fandoms\" as Roxas also befriends Sora's replica Xion and both suffer their own crisis in Kingdom Hearts 358/2 Days. The writer sees Roxas, Xion and Axel as \"Sea Salt Trio\" for their obsession to rest together nearly every day in Kingdom Hearts while eating ice cream. The trio are able to express their own emotions despite the Nobody dilemma which is done thanks to their friendships and origins. Axel in particular becomes more sensitive when interacting with Roxas but have problems with Xion's identity as Sora's replica. The narrative delves into relationship with the\ncharacters and, subsequently, the players. Although Roxas only appears in coded as a data copy and such game is regarded as the worst game by The Gamer, the writer regarded the encounter between him and Sora's data to be one of the best moments in the series thanks to how they show their morals during Data Roxas' test; Across Roxas' test, although Sora expresses pain over losing people, he still claims he will keep living with the pain of having known his friends which is exactly what Roxas wanted to hear, eventually reaching the real Roxas' pain of missing his friends. In \"Comparative Analysis of Storytelling Technique in Kingdom Hearts II (2005) and Persona 3 Portable (2009)\", and Shazwin Bt. Sahmir and Norlela Ismail from University Teknologi Mara, Roxas is seen as a less conventional character due to wanting to live his life, but being forced to merge with Sora and stop existing to let him continue his journey. While Sora does not undergo a notable character arc despite the game being a sequel, there are signs of Roxas having undergone one himself, as \"In the end, after confronting Sora in his Heart Station, he gives in to\nthe truth and become one with his true self.\"\nIn \"17 years ago, Square Enix delivered the most astonishing RPG prologue ever\", Hayes Madsen from Inverse aclaimed Roxas' prologue from Kingdom Hearts II for introducing him to the player as a normal school student who is enjoying his vacation with his friends happily until several abnormal beings attack him, eventually revealing him to be connected to Sora's character. This making a highly impactful change in the character when it is revealed he is a Nobody who was just living a simulation until his eventual merge with Sora. The early segments in Kingdom Hearts II where Roxas is told that his existence is a mistake was related by Trevor Richardson from AIPT with his personal crisis as a queer. This makes Roxas' decision to give up on his existence to revive Sora heartbreaking to the writer especially when revisiting his past in 358/2 Days. As a result, he demanded a happy ending for the character in Kingdom Hearts III.\nIn \"May your heart be your guiding key”: A Educação Estética de Kingdom Hearts\", Tiago Clariano from Faculdade de Letras da Universidade de Lisboa said the series the constant references to hearts as analogies for sensibilities also involve some form of self-determination, take Roxas' phrase \"My heart is mine, no one else's\" as an example of an person trying to be his own individual. As a result of being Sora's alterego, Roxas seeks to be himself but he is unable to escape from returning to the original self in Kingdom Hearts II due to the nature of his kind, the Nobodies. Nobodies are supposed not to have emotions that define them but Roxas proves to be an exception. In \"School's Out Forever For Roxas In Kingdom Hearts\", Madeline Blondeau from the AV Club, Roxas' arc across II and 358/2 Days as he grows up in Organization XIII and eventually merges with Sora is analyzed as accepting to grow up rather than see his merge with Sora as death. When Roxas challenges Sora in a fight within themselves, the latter's victory comes across as a \"psychological and spiritual victory\" as the former properly accepts to be merged with Sora. In Kingdom Hearts III the opposite happens, as it is Sora the one who dies while Roxas revives with the apparent freedom neeeded to become a normal teenager as seen in the ending.\nReferences\nja:XIII機関#メンバー"
    }
  ]
}