{
  "content": [
    {
      "type": "text",
      "text": "# Roy Edward Dodds\n\n|death_date    =\n|birth_place   =Buffalo, New York, United States\n|death_place   =Detroit, Michigan, USA\n|placeofburial =\n|placeofburial_label =\n|placeofburial_coordinates =\n|nickname      =\n|birth_name    =\n| allegiance    =\n| branch        = Royal Air Force (United Kingdom)\n|serviceyears  =1916–1918\n|rank          =Captain\n|servicenumber =\n| unit          = Royal Air Force\n* No. 106 Squadron RAF\n* No. 103 Squadron RAF\n|commands      =\n| battles       = &nbsp;World War I\n|battles_label =\n|awards        =British Distinguished Flying Cross\n|relations     =\n|laterwork     =\n|signature     =\n|website       =\n}}\nCaptain Roy Edward Dodds (July 19, 1893 – April 2, 1965) was a World War I flying ace credited with seven aerial victories.\nBiography\nBorn in Buffalo, New York, Dodds went to Canada in 1916 to enlist in the Royal Flying Corps.  Trained in the Toronto area, he was deployed to France and assigned to 103 Squadron on 26 May 1918.  In combat, he downed 7 enemy aircraft flying a Dehavilland DH-9. He was awarded the British Distinguished Flying Cross.\nAfter the war, Dodds returned to the United States and sold automobiles in Detroit, Michigan. He served as a pilot instructor with the Royal Canadian Air Force during World War II. Plagued by ill health, with no family and little income, Dodds died alone in a boarding house room in Detroit, Michigan. He was 72. When no one claimed his body at the local morgue, the Canadian Legion of Detroit stepped forward and had arranged for his burial.\nHonors and awards\n* Distinguished Flying Cross (United Kingdom) Supplement to the London Gazette, 8 February 1919\n: An officer who possesses high courage combined with great power of leadership. He has taken part in sixty bombing raids far over enemy territory, a large number of which he has led. In addition, he has carried out a number of successful photographic reconnaissances, frequently meeting and overcoming strong hostile aerial resistance. In the course of these nights he has destroyed four enemy machines, and his observer has accounted for three others. A fine achievement, for the machine he flies is designed for heavy bombing and long reconnaissance rather than for aerial combats.\nSee also\n* List of World War I flying aces from the United States\nReferences"
    }
  ]
}