{
  "content": [
    {
      "type": "text",
      "text": "# Royal Commission into Drug Trafficking\n\n1979\n| venue =\n| location = Sydney, Australia\n| also_known_as = Woodward Royal Commission\n| blank_label = Commissioner\n| blank_data = Justice Philip Morgan Woodward\n| blank1_label = Counsel Assisting\n| blank1_data =\n| blank2_label = Consultants\n| blank2_data =\n}}\nThe Royal Commission into Drug Trafficking (1977&ndash;1979) or Woodward Royal Commission was a royal commission initiated by the New South Wales Government to investigate drug trafficking in New South Wales (NSW), Australia, especially links between the Mafia and New South Wales Police and the disappearance of anti-marijuana campaigner Donald Mackay.\nThe commission was a penetrating investigation of organised crime, revealing for the first time the power and influence of the Calabrian mafia in Australia. According to a book published in 2009 co-authored by former NSW police assistant commissioner, Clive Small:\n:\nBackground and terms of reference\nDiscoveries of marijuana plantations in several places in New South Wales, allegations that a criminal organisation existed based in the production and distribution of drugs and the sudden unexplained accumulation of wealth, especially in the town of Griffith lead to lobbying for a Royal Commission into the drug trafficking business. The pressure culminated after 15 July 1977 when the disappearance of Donald Bruce Mackay, an activist against the drug trade, was believed to have been engineered by drug trafficking interests.\nThe commission was proclaimed in NSW Government Gazette on 5 August 1977 when Philip Morgan Woodward was appointed sole commissioner to:\n:\"enquire into and report upon\n::1. The cultivation, production, manufacture, distribution, supply, possession and use of:\n:::(a) drugs that are, for the time being drugs of addiction or prohibited drugs within the meaning of the Poisons Act, 1966; and\n:::(b) other drugs (other than tobacco or alcohol) that are drugs of dependence or of dependence potential\n::2. the identity of persons involved in:\n:::(a) the cultivation, production, manufacture, distribution or supply, where contrary to the laws of the State, of drugs of the kind referred to in paragraph 1, or in the possession or use by others, when contrary to those laws, of those drugs; or illegal or improper activities in connection with the matters referred to in subparagraph (a); and\n::3. whether, in the light of the findings of the Commission on the above matters, changes are desirable in:\n:::(a) the manner in which the laws of the State relating to the cultivation, production, manufacture, distribution, supply, possession and use of drugs of the kinds referred to in paragraph 1 are administered by the authorities of the State, whether acting alone or in co-operation with the authorities of other States or the Commonwealth; or\n:::(b) those laws referred to in subparagraph (a)\nCommission term, proceedings, recommendations and report\nThe Royal Commission was originally appointed for a period of six months. The term was subsequently extended twice and the final report of the commission was submitted to the governor on 31 October 1979. The commissioner's terms of reference were restricted to the legal aspects of drug trafficking rather than medical or social aspects.\nHearings commenced on 10 August 1977 and the commissioner conducted public hearings on 175 days and in camera hearings on 146 days. Evidence was given by 565 witnesses and 1000 summonses were issued for the production of documents or the attendance of witnesses. The commissioner gathered information in North America and other overseas countries in 1978.\nThe Royal Commissioner studied, examined and reported upon the following drugs - cannabis; narcotics; heroin; amphetamines, cocaine and hallucinogens. For each drug he reported upon the nature, history, use, reported seizures, and the nature of the trade. In addition, the commissioner studied seizures which had occurred in various places in the State including The Riverina, Colleambally, Euston, Wollongong, Sutherland and St George and Byron Bay, and the operation of known importers and distributors. The commissioner reported on the treatment of drug offenders and the current statutory provision for dealing with drug offenses.\nThe report of the Commission concluded with a total of 89 recommendations in the general areas of statutory, legal administration and law enforcement reform, identification of drug users, promotion of programs to discourage drug use, information sharing amongst various agencies concerned with drug trade (health, drug regulation, communications and law enforcement); co-operation with other Australian jurisdictions, other countries and international agencies in obtaining information about and dealing with the drug problem; and improved treatment of drug addicts.\nThe Royal Commission concluded on 31 October, when the report was handed to the governor in the Premier's Office.\nSee also\n* Royal Commission of Inquiry into Drug Trafficking (Stewart Royal Commission), 1981–1983\n* Robert Trimbole\nReferences\nExternal links\n* [http://www.smh.com.au/news/national/pillar-who-put-dark-past-behind-him/2006/08/29/1156816901045.html \"Pillar who put dark past behind him\"] in The Sydney Morning Herald\n* [http://www.theage.com.au/national/men-of-influence-20090222-8eob.html \"Men of influence\"] in The Age"
    }
  ]
}