{
  "content": [
    {
      "type": "text",
      "text": "# Royal Botanical Expedition to New Spain\n\nThe Royal Botanical Expedition to New Spain () was a scientific expedition to survey the flora and fauna of the territories of New Spain between 1787 and 1803 and to establish a botanical garden. It was sponsored by King Charles III of Spain and headed by physician Martín Sessé y Lacasta, who led a team of botanists that included José Mariano Mociño and is part of the crown's general program of economic revitalization, known as the Bourbon Reforms. The expedition, commonly referred to by botanists as the Sessé and Mociño expedition, identified many species new to science and brought back a large trove of valuable botanical illustrations. The expedition was \"an undertaking that was to signal Spain's reassertion of its colonial might and of its relevance to the Enlightenment.\"\nBackground\nMartín Sessé, a Spanish physician employed by the Royal Botanical Garden of Madrid already established in Mexico, conceived of the expedition. He wrote to the Spanish botanist Casimiro Gómez Ortega suggesting a botanical expedition that would serve two purposes: first to classify the natural resources of the Viceroyalty of New Spain, and second to implement new health-related procedures in the colonial territories.\nCoincidentally, around the same time, cosmographer Juan Bautista Muñoz found in the library of the Colegio Imperial de Madrid parts of the original manuscripts from an earlier botanical expedition, the Francisco Hernández Expedition of 1570–1577. Gómez Ortega was then charged with updating and publishing those manuscripts, and this combination of circumstances seems to have convinced the king to support a new expedition. On March 20, 1787, he issued a royal decree authorizing the expedition and providing the funds needed.\nPreparations\n]]\nPreparation for the expedition began in 1787 with a series of trips by Sessé to Santo Domingo, Puerto Rico, and Cuba, where earlier expeditions had taken place, in order to gather information from the experiences of other scientific teams. He also collaborated on some of the studies being carried out in those places, such as research in Cuba on treatment of a parasitic illness.\nOnce he returned to the Mexican mainland, Sessé was joined by a team of Spanish scientists and botanists chosen by the director of the Royal Botanical Garden of Madrid. This select group included Vicente Cervantes, a botany professor in New Spain; José Longinos Martínez from the Museum of Natural History; the pharmacist and botanist Juan Diego del Castillo; and botanists José Maldonado and José Mariano Mociño. Among the painters and illustrators who joined the expedition were two young Mexican artists, Juan de Dios Vicente de la Cerda and Atanasio Echeverría, who later had the genus Echeveria named after him; about the third artist, Pedro Oliver, not much is known.\nEstablishment of the Royal Botanical Garden\nThe project was envisioned to be multifaceted. A large garden of 56.25 hectares was to be established in central Mexico City to cultivate and propagate plants of New Spain that were of economic interest to the crown. Another component was to be a school to train doctors and pharmacists. A third aspect was to analyze and publicize New Spain's botanical riches. Although there was considerable indigenous knowledge of plants and their medicinal uses, the expedition did not draw on it, but rather imposed the system of classification of Carolus Linnæus.\nTravels outside the capital\nDuring the first year the members of the expedition only made short journeys into the countryside, besides assisting in the creation of Mexico's Botanical Garden, which opened on March 27, 1788. In May of the same year, the team began exploring the areas of Cuernavaca, Tixtla, Chilpanzingo, and Acapulco, among others.\nDuring 1790, the team explored large areas of the territories that comprised New Spain, crossing Michoacán, Sonora, and Apatzingan. When they reached Guadalajara, the group split in two, with Mociño, del Castillo, and Echeverría heading for Aguas Calientes, via Álamos and Tarahumara, while Sessé traveled to the same destination via an alternative route crossing Sinaloa. When they regrouped in Aguas Calientes in 1792, they were made aware of a royal provision ordering them to travel to Nootka Island, which at the time was under litigation between Spain and Great Britain. All explorers set route for the northwest coast, except Juan del Castillo, who died of scurvy in 1793, shortly after having finished his book Plantas descritas en el viaje de Acapulco.\nAfter returning from Nootka, expedition members focused their efforts on the southern territories. They split into two teams, one led by Mociño that explored Mixteca and the Tabasco coast, and the other led by Sessé that headed for Jalapa and Guaztuco. The two groups reunited in Córdoba, continued to Veracruz, and returned to Mexico City via Tehuantepec and Tabasco.\nIn March 1794, Sessé was granted permission to extend the expedition in order to further explore Central America, specially Guatemala, Cuba, Santo Domingo, and Puerto Rico. The expedition again split into two teams, with Sessé and Echeverría going to Cuba, while Mociño, de la Cerda, del Villar, and others went to Guatemala.\nSessé was finally ordered to conclude their studies and return to Spain, but it took another two years to compile and classify all the material collected during the different explorations. The team ultimately brought back some 3500 species, including 200 new genera and more than 1000 species new to science. They also created several thousand drawings and watercolors, mostly of botanical subjects, and including in many cases duplicate sets. These appear to be largely the work of Echeverría (the best of the expedition artists) and de la Cerda, though most are unsigned. The members of the exploration team finally returned to Spain at different times during 1803.\nAftermath and legacy\nBoth Sessé and Mociño were honored for their work by being promoted to the Royal Academy of Medicine in Madrid in 1805.\nDuring the years following their return to Spain, Sessé and Mociño published a few medical works, such as Sessé's writings on the eradication of yellow fever, which was prevalent in southern Spain in 1804. Sessé underlined the importance of environmental and hygiene conditions that had been disregarded until then.\nSessé died on October 4, 1808, after which Mocinõ—who had proven to be one of the most active of the expedition's botanists—tried to keep interest in the project alive. However, due to his Bonapartist sympathies he was forced to flee from Spain in 1812, taking refuge in Montpellier, France. He entrusted some of the manuscripts and drawings related to the expedition to the Swiss botanist Augustin de Candolle, who had some 1200 of the illustrations copied by local artists in Geneva in early 1817 before giving the originals back to Mociño. In that same year, Mociño was finally able to return to Spain, but his health had deteriorated, and he died on May 19, 1820. Thereafter, the collection of expedition illustrations appears to have passed through many hands, beginning with Mociño's last doctor, before eventually winding up in the hands of a Catalan family from which Carnegie-Mellon University was able to acquire the collection in 1981. During the intervening century and a half, the whereabouts of the original illustrations was uncertain, so many publications about the expedition's work had to rely on the Geneva copies.\nAfter Sessé and Mociño died, other botanists like Gómez Ortega, de Candolle, and Mariano Lagasca published new species based on their plants and drawings. But due largely to various political upheavals in Spain throughout the century, the bulk of the expedition's work was not published until the 1880s, nearly a century after the expedition set out. Some manuscripts from the expedition were published in Mexico in different editions between 1887 and 1894. The volume titled Plantae Novae Hispaniae focuses on plants of Mexico, while the misleadingly titled Flora Mexicana is a miscellany of species from all parts of the New World visited by the expedition. By the time any of these publications appeared, the expedition's work had been substantially superseded by the appearance, starting in 1815, of the monumental Nova Genera et Species by the German botanist Carl Sigismund Kunth.\nMany of the collected plants and seeds, as well as engravings and some duplicate copies of drawings and watercolors, ended up in the Royal Botanical Garden of Madrid, where today they share space with plants collected during other Spanish scientific expeditions. The set of copies made under de Candolle's oversight remains in Geneva. Tracings have been made from the Geneva set from time to time, and these have found their way into collections around the world.\nIn 1981, the Hunt Institute for Botanical Documentation at Carnegie-Mellon University acquired many of the original botanical illustrations made during these expeditions from the nephews of a Catalan historian named Lorenzo Torner Casas. Now called the Torner Collection of Sessé and Mociño Biological Illustrations, it comprises some 2000 drawings by Echeverría, de la Cerda, and  Oliver. Of these, 1800 are botanical subjects while the rest range across mammals, birds, reptiles, fish, and insects.\n}}\nExternal links\n*[http://www.rjb.csic.es/jardinbotanico/jardin/index.php?Cab=109&Pag=189&Pag=411&Pag=190&Pag=191&Pag=194&Pag=195&len=en&Pag=195#sesse Sessé and Mociño Herbarium] at the Royal Botanical Garden of Madrid"
    }
  ]
}