{
  "content": [
    {
      "type": "text",
      "text": "# Royal Botanical Expedition to New Granada\n\nThe Royal Botanical Expedition to New Granada () took place between 1783 and 1816 in the territories of New Granada, covering present-day Colombia, Ecuador, Panama, Venezuela, Peru and northern Brazil and western Guyana.\nThe project was rejected twice before being finally approved in 1783 by King Charles III of Spain, and was headed by José Celestino Mutis, a Spanish priest, who was also a botanist, mathematician and teacher.\nBackground\n]]\nBefore the King sanctioned the expedition, Mutis had already proposed it on two occasions, in 1763 and 1764 respectively, but he had been ignored. However, years later, after he retired to live in Mariquita, he met Archbishop and Viceroy Antonio Caballero y Góngora, who made a third proposal on his behalf that was finally accepted by the King, who named Mutis first botanist and astronomer of the botanical expedition.\nPreparations\nSince the first failed proposals Mutis had maintained regular contacts with European scientists, among which was Carl Linnaeus. When it was known that the expedition was finally under way it aroused the interest of the European scientific community at the time. On 1784 Mutis was appointed member of the Royal Swedish Academy of Sciences, and a member of the Royal Academy of Medicine. His news about American plants were eagerly awaited by botanists in Europe, keen on learning about the new species of plants. On his \"Memorial Instructivo y Curioso de la Corte de Madrid\" he had reported his conclusions on the medicinal uses of certain plant species of New Granada, and informed the Spanish Crown about the possibility of trading with tea leaves coming from Bogotá, whose properties he praised.\nExpedition\nOn April 29, 1783 the expedition was formally launched with a team composed by botanists Eloy Valenzuela and Fray Diego García, geographers Bruno Landete and Jose Camblor, painters Pablo Antonio Garcia del Campo, Francisco Javier Matís, Anthony and Nicholas Cortez, Vicente Sánchez, Antonio Barrionuevo, Vicente Silva, his assistant Salvador Rizo Blanco, foreman Roque Gutierrez, several collectors and a messenger.\nIn 1790 they moved to Santafe de Bogotá (Bogotá) where exploration activities would continue until 1816. Mutis recruited new members, such as the botanist Francisco Antonio Zea, his nephew Sinforoso Mutis, geographer Francisco José de Caldas and chemist and zoologist Jorge Tadeo Lozano. José Antonio Candamo was hired to look after the Herbarium. In Santa Fe Mutis funded a free public School of Drawing, and following Linnaeus criteria began classifying the flora of New Granada under orders of the King who had commissioned him with the writing of the Flora de Bogota. He also created an Astronomical Observatory, considered to be the first high-learning scientific institution of Colombia.\nSeveral smaller expeditions were sent to extend geographical coverage. Among them was the one led by Francisco José de Caldas, who explored the present lands of Ecuador during four years, returning to Santa Fe in 1808 bringing a very extensive herbarium. Another member, Fray Diego Garcia, explored the Upper Magdalena Valley, between La Palma and Timana, reaching the Andaquíes area and collecting many animal and geological samples. Additionally, Eloy Valenzuela, who had been deputy director of the expedition during its first year, was commissioned to Santander, although he had to prematurely retire to Bucaramanga due to health problems.\nOn 1801 Alexander von Humboldt visited Mutis during his expedition to America, sharing quarters with him for over two months. He expressed his admiration for Mutis work and praised his botanical collection.\nAll together Mutis led the expedition for over 25 years during which they explored some 8,000 km2. He developed a meticulous methodology that included harvesting of the samples in the field together with detailed descriptions, including data about the surrounding environment of each species and their medical or industrial uses. Mutis died on September 11, 1808, and was replaced by his nephew Sinforoso, who led the expedition until 1816.\n6,000 new species were discovered and described during the expedition. As a result, 6717 drawings and 20,000 plates with 2,738 different taxa were produced.\nPublications\nBetween 1793 and 1794 one of Mutis works, Arcanum of Quina, where he describes seven new species with medical and therapeutic uses, was published in a Santa Fe newspaper. 306 of Mutis's taxa were published by Linnaeus, Linneo fil., Humboldt & Bonpland, Cavanilles and certain botanists of the 20th century. On 1932 E. P. Killip, curator of the Smithsonian Institution in Washington, started to study the Herbarium. In 1937 on the occasion of the bicentennial celebrations of Mutis birth, the governments of Spain and Colombia jointly produced the publication of the Flora de la Real Expedición Botánica del Nuevo Reino de Granada. In 1952 began the publication of the enormous work in its entirety, that is still not completed and is expected to need more than sixty volumes, with the added requirement of having to identify the plants under the drawings according to the current nomenclature and creating a meaningful descriptive text adapted to modern times.\n]]\nAftermath\nAll plates, maps, correspondence, notes and manuscripts, and all the material from Mutis museum composed of more than 24,000 dried plants, 5,000 drawings of plants by his pupils, and a collection of woods, shells, resins, minerals, and skins, were sent to Spain and was inventoried and classified on arrival to Madrid, ending up at the Royal Botanical Garden of Madrid where they have remained since, except for a small part that was sent in 1889 to the Real Academia de la Historia.\nSee also\n*Botanical Expedition to the Viceroyalty of Peru\n*Royal Botanical Expedition to New Spain\nReferences\nExternal links\n*[http://www.rjb.csic.es/jardinbotanico/jardin/index.php?Cab=109&Pag=189&Pag=411&Pag=190&Pag=191&Pag=194&Pag=195&len=en&Pag=195#mutis Mutis Herbarium] at the Royal Botanical Garden of Madrid"
    }
  ]
}