{
  "content": [
    {
      "type": "text",
      "text": "# Rozan (owarai)__disambig_1\n\n| active = 1996&ndash;(formed in Osaka)\n| employer = Yoshimoto Kōgyō\n| current_members =\n* Hirofumi Suga\n}}\n|footnotes= Same year/generation as:LicenseHachimitsu TsukiteiDandy SakanoHanawaDrunk DragonKoji Abe\n| pseudonym =\n| website =\n}}\nis a Japanese comedy (manzai) duo (kombi) from Osaka consisting of  as boke and  as tsukkomi under the entertainment agency, Yoshimoto Kogyo. Formed in 1996, they are best known for their stand-up acts and TV tarento activities in variety and quiz shows. Ujihara is known as one of the most competitive quiz show contestants.\nHaving attended highly ranked public universities, the two are broadly recognized as \"highly educated comedians\". However, Suga eventually dropped out of Osaka Prefecture University while Ujihara graduated from Kyoto University spending 9 years to earn satisfactory credits to graduate.\nAs the boke, Suga is prone to strange comments, while Ujihara is the more reasonable of the two, often criticizing Suga's remarks. As their talk material, they often use current affairs and items that Japanese students learn in high school and middle school. Suga writes almost all their material while Ujihara types them out since Suga cannot touch-type.\nIn Yoshimoto Kogyo's annual \"Most Handsome Yoshimoto Kogyo Entertainer\" awards, Suga won 7th place and Ujihara won 14th in 2009 (8th and 20th in 2008 respectively).\nBiography\nThe comedians first met through basketball club activities when they were students at Osaka Kyoiku University - Tennoji high school. Though never in the same class, they were always together at lunch and commuting time. As Suga wanted to be with Ujihara all through his life, he asked Ujihara to be his manzai partner. Suga also recommended Ujihara to take the entrance exam of Kyoto University, one of the top-tier universities in Japan, for the school name would be a help when they become comedians. Ujihara accepted the offer, and after both of them became university students, they formed Rozan in 1996. While attending university, they went to manzai auditions and failed 12 times in a row. After nearly a year and a half, they finally passed one and made their debut in February 1998 at a manzai live \"WaChaCha LIVE Jr.\".\nMembers\n;\n* Date of Birth:\n* Birthplace: Takaishi, Osaka\n* Manzai Role: Boke\n;\n* Date of Birth:\n* Birthplace: Shijonawate, Osaka\n* Manzai Role: Tsukkomi\nMedia\nTV\nRegular\n*Quiz! Shinsuke-kun (クイズ!紳助くん)--Asahi Broadcasting Corp. (ABC TV) *Every other Monday\n*Chichin-puipui (ちちんぷいぷい) -- Mainichi Broadcasting Sys., Inc. (MBS TV)\n**Every Tuesday, with the segment \"Michiannai sho!\", using Suga's limited English to guide foreign tourists to their destinations around Osaka Station\n*Gokigen Life Style Yo-i-don! (ごきげんライフスタイル よ〜いドン!) -- Kansai TV *Every Friday\nSemi Regular\n*Asapara! (あさパラ!) -- Yomiuri TV\nIrregular\n*Ima-chan no \"Jitsu-wa...\" (今ちゃんの「実は…」) -- ABC TV\n*Owarai Wide Show Marco Porori! (お笑いワイドショー マルコポロリ!) -- Kansai TV\n*Nambo DE Nambo (ナンボDEなんぼ) -- Kansai TV\n*Maki's Magic Restaurant (水野真紀の魔法のレストラン) -- MBS TV\n*Bijo Saiban - Renai Saibanin Seido (美女裁判〜恋愛裁判員制度〜) -- ABC TV\nRadio\n*GAKU-Shock -- TBS Radio, ABC Radio\nExternal links\n*[https://web.archive.org/web/20090324033722/http://www.fandango.co.jp/talent_prf/action/TalentProfileDetailSearchAction?unitId=10150&talentId=0 Rozan official website provided by Yoshimoto Kogyo]"
    }
  ]
}