{
  "content": [
    {
      "type": "text",
      "text": "# Ru ware\n\n]]\n]]\n]]\nRu ware, Ju ware, or \"Ru official ware\" () is a famous and extremely rare type of Chinese pottery from the Song dynasty, produced for the imperial court for a brief period around 1100.  Fewer than 100 complete pieces survive, though there are later imitations which do not entirely match the originals. Most have a distinctive pale \"duck-egg\" blue glaze, \"like the blue of the sky in a clearing amongst the clouds after rain\" according to a medieval connoisseur, and are otherwise undecorated, though their colours vary and reach into a celadon green. The shapes include dishes, probably used as brush-washers, cups, wine bottles (carafes in modern terms), small vases, and censers and incense-burners.  They can be considered as a particular form of celadon wares.\nRu ware represents one of the Five Great Kilns identified by later Chinese writers. The wares were reserved for the Imperial court, with according to one contemporary source only those they rejected reaching a wider market. The source, Zhou Hui, also says the glaze contained agate, and when the kiln site was located in recent decades it was indeed very close to a site for mining agate, which is very largely composed of silica, a usual component of ceramic glazes. However, experts now discount any influence of agate in achieving the Ru glaze colour. The bluish colour may be due to dissolved iron oxide with a very low amount of titanium dioxide.\nRu ware is perhaps the first \"official ware\" specifically commissioned by the imperial court. Their normal practice seems to have been to review the large quantities of \"tributary ware\" given to them by the provinces making ceramics, effectively as a form of tax.  The court kept what they wanted and redistributed the remainder as part of their lavish gifts to officials, temples, and foreign rulers, and perhaps also selling some.  Production ended when, or shortly before, the kilns were occupied by the invaders who overthrew the Northern Song dynasty in the 1120s, but the wares remained famous and highly sought after.\nOn 3 October 2017, a Ru ware brush-washer dish, 13&nbsp;cm (5&nbsp;in) across, set a new record auction price for Chinese ceramics at Sotheby's Hong Kong, fetching HK$294.3 million, nearly US$38 million.\nCharacteristics\n]]\nThe pieces are mostly fairly small, for drinking, use at a scholar's desk, incense burning, or as small containers.  There are a few oval \"narcissus vases\", which is to say planters for daffodils. Many pieces have a subtle crazed or crackled glaze, though there is some evidence that the most admired are those without this, and the effect was not deliberate.  Those shapes that are not simple pottery forms show derivation from other media such as metalwork or lacquer, for example the bottomless cup-stand, which is a common shape in both. Most shapes have a \"clearly defined, slightly splayed foot-rim\".  A very few pieces have decoration, with a \"lightly impressed floral design\".\nThe glaze, applied in several layers,  continues over the rims at top and bottom of the pieces, in contrast to the rival porcelain Ding ware, fired upturned and so with a rough unglazed rim, often covered with a band of metal.  Instead Ru ware was kept off the kiln stack surface by being supported on three or five small spurs or prongs, presumably of metal, which left little unglazed oval spots called \"sesame seeds\" on the underside.  The colours vary, and have been classified by Chinese authorities as \"sky-blue\", \"pale-blue\" and \"egg-blue\", in each case using the Chinese word , which can cover both blue and green.\nThis \"all-over\" glazing technique seems to have been invented at the Ru kilns, and increased the resemblance of the wares to jade, always the most prestigious material in Chinese art. Another element in this resemblance was the \"thick unctuous glaze texture\", which has been described as \"like lard dissolving not flowing\",  The most admired type of jade was known as \"mutton fat\".\n]]\nExamination of excavated fragments shows the fired clay body is a light grey colour, sometimes compared to the colour of incense ash. Although stoneware by Western criteria (not a category recognised in traditional Chinese thinking), the wares are fired at a relatively low temperature, and are far from fully vitrified, absorbing water at a \"fairly high\" rate. Nor is the body free from flaws when examined under magnification. Since it was almost entirely covered by glaze, these issues did not detract from the wares.  Some authorities note that the body might really be considered earthenware, though it is always classified by Western writers as stoneware, because of the other Northern Celadons it relates to, and in Chinese terms as \"high-fired\", usually translated as  porcelain.\nThe 87 pieces listed by Regina Krahl in 2017 are set out by 20 different shapes. The most numerous of these is round brush-washer bowls (33), with all brush-washers totalling 38. There are 25 dishes and 5 bottles (or vases) of various shapes, 6 narcissus basins, with stands and other pieces making up the rest.\nKiln site\nA group of over 15 kilns at the village of Qingliangsi, Baofeng County, Henan have been identified as the site manufacturing Ru ware. They were first identified in 1950, and in 1977 the ceramic art historian Ye Zhemin found a sherd on the site which when analysed proved identical to a Ru ware sample in Beijing.  This was confirmed as the site was excavated, beginning in 1987, with the main \"official ware\" kiln and workshop area being uncovered in 2000 in the sixth phase of excavation.\nAltogether the site covers 250,000 square metres, \"with kilns densely distributed throughout\".  As they were excavated it became clear that they had also produced large amounts of other, lesser wares, including black and three-colour wares, and also \"a significant quantity of carved and incised Ru wares of inferior quality,\" which is not represented among surviving pieces.  Apart from the last, these other styles would not normally be called \"Ru ware\", and fall within the range of other contemporary northern ceramics.\nThe excavations also found sherds of \"official\" quality, but in more elaborate shapes than found among the surviving whole pieces. These may have been test pieces that were not put into production.  There are also pieces decorated in conventional celadon techniques, also not found in the complete survivals.\nDating\n.]]\n. This type is normally described as a brush-washer.  Note the 5 \"sesame-seed\" marks on the upturned base.]]\nIn 2012 a Sotheby's catalogue note said \"Although the exact time of the production of Ru ware is still under debate, all scholars agree that it was made for an extremely short period only. Generally a space of some twenty years is proposed, from 1086 to 1106, although some scholars have argued for a slightly longer period.\"  Earlier Jessica Rawson thought the period was \"c.1107 to 1125\".  Shelagh Vainker says the period was \"about 40 years\".  The British Museum says \"twenty or perhaps forty years between 1086 and 1106 or 1125\". It was only produced during the reigns of the Huizong Emperor (r. 1100–1125) and perhaps his predecessor, Zhezong (r. 1085–1100).  Huizong seems to have taken a close personal interest in the ware.\nShortly after Huizong abdicated the Northern Song period was ended by invaders from the north, and Huizong and his successor were captured in the disastrous Jin-Song wars of the 1120s.  A younger son of Huizong fled to the south and established the Southern Song as the Gaozong Emperor (1127–1163), but the Ru kiln was now in enemy territory, and production of Ru ware ceased, if it had not already done so.  The kilns were abandoned, and the workers dispersed.  A gift of 16 itemized pieces to Gaozong in 1151 is recorded; a rather tiny quantity by imperial standards, suggestive of their rarity.  The same source records that when in 1179 the aged retired emperor visited a garden, a Ru vase was placed there for him to admire.  In the south a form of official Guan ware, more green than blue, seems to have acted as a rather inadequate substitute for the court.\nThe dates of production were long confused by a fake test disk in the Percival David Collection. This is a flat circular ring with an inscription claiming that it was the \"first test piece\", produced under the supervision of a \"Vice-Minister of the Imperial Household\" on 9 April 1107.  Always regarded with great suspicion by many scholars, it is now generally agreed to be a fake, probably 20th-century.\nCollecting and imitation\nThe wares seem to have been very rare even during the time they were produced, and remained so, as various Chinese writers say. The Qianlong Emperor (r. 1736–95), a keen collector who must have owned at least half of the surviving examples, describes it in a poem \"as rare as stars at dawn\".  As they receded in time, their reputation became almost legendary, although many of the writers praising them may never have glimpsed examples.\nHowever, after Guan ware there do not seem to have been serious attempts to imitate them in China until the 18th century, when under the Yongzheng Emperor (r. 1723–35) they were copied in imperial Jingdezhen ware, with examples from the imperial collection being sent to Jingdezhen to copy.  These are known as \"Ru-type\" ware. The Qianlong Emperor wrote poems on several pieces – in both senses, as he had them engraved on the bases.  One of these pieces was actually a recent imitation made for his father.  A special favourite was a  planter for daffodils without crackle, now in Taipei, where the undispersed holdings of the Imperial collection are today, illustrated above.\nImitation in Korean ceramics began shortly after Ru ware was produced, and Korean pieces were for long often confused with Chinese originals.\nCollections\nIn 2012, Sotheby's identified 79 individual complete survivals, and a revised list by Regina Krahl for Sotheby's next Ru sale in 2017 increased this to 87; The National Palace Museum issued a list in 2015 totalling 90 pieces in various collections around the world, including some damaged in a fire in 1923; Krahl added and subtracted some pieces from this.  There are now also many sherds found at the kiln site.\nThe largest collections, per Krahl and Sotheby's 2017 list, were:\n*21 pieces in the National Palace Museum, Taipei\n*17 in the British Museum, London (including the Percival David Collection)\n*17 in the Palace Museum, Beijing\n*9 in the Shanghai Museum\n*2 in the National Museum of China, Beijing\n*2 in the Röhsska Museum, Gothenburg, Sweden\n*with single pieces in Tianjin Municipal Art Museum; Museum of Oriental Ceramics, Osaka; Hong Kong Museum of Art; Cleveland Museum of Art, Philadelphia Museum of Art; St. Louis Art Museum; Victoria and Albert Museum, and the Ashmolean Museum, Oxford.\n]]\nThe number of pieces recognised has expanded considerably since the early 20th century, more as pieces in collections are identified than as unknown examples emerge. Gompertz gave a list totalling 31 pieces outside China in his first edition of 1958, but revised this to 61 pieces including those in China in his second edition of 1980; even among the museums the cast and numbers are somewhat different to the list Sotheby's gives in 2012.  This is based on a list by Degawa Tetsurō in an exhibition catalogue in 2009, with a few additions.  Agreement on pieces can remain incomplete; one piece that seems to appear on neither list was identified as \"Ru ware\" by the Cincinnati Art Museum in 2016.  The Henan Museum has a vase with decoration that it says was excavated in 1987 at the kiln site at Qingliangsi. A research project at the Dresden State Art Collections led to the identification a Ru bowl among the porcelain collection in 2021.\nOn 4 April 2012 Sotheby's in Hong Kong sold a brush-washer bowl, 13.6&nbsp;cm across and the pair of one in the British Museum, for 207,860,000 Hong Kong Dollars ($US 26.7 million), then an auction record for Song ceramics.  It had been in a Japanese collection, after belonging to the collection of Mr & Mrs Alfred Clark in London.  This price was exceeded by the sale in 2017 described above.\nIn 2014 it was claimed that a Ru bowl had been identified in the collection of the Princessehof Ceramics Museum in Leeuwarden, The Netherlands.  This piece is included in Regina Krahl's 2017 list.\nIn 2016 an exhibition at the Beijing Palace Museum included 29 complete pieces, plus four reconstructed ones from a tomb, and many fragments from excavation. 30 later \"Ru-type\" pieces were also exhibited. The National Palace Museum in Taipei had an exhibition in 2006–07.  Both included loans from the British Museum and other museums, but to date the Taipei and Beijing collections have not shared an exhibition.\nFile:北宋汝窯青瓷膽瓶.jpg|Vase from National Palace Museum\nFile:Ru ware, Percival David Collection DSCF3051.jpg|Percival David Collection, British Museum\nFile:Ru ware, Percival David Collection DSCF3056.jpg|Percival David Collection, British Museum\nFile:Ru ware, Percival David Collection DSCF3060.jpg|Percival David Collection, British Museum\nFile:Tripod vessel, Ru ware, China, Northern Song Dynasty, late 11th or early 12 century, stoneware - Cincinnati Art Museum - DSC03179.JPG|Tripod vessel,  Northern Song Dynasty, Cincinnati Art Museum See text.\nFile:景德镇窑仿汝瓶.JPG|\"Ru-type\" vase, an imitation in Jingdezhen ware, from several centuries later, Yongzheng Emperor.\nNotes\nReferences\n*Gompertz, G.St.G.M., Chinese Celadon Wares, 1980 (2nd edn.), Faber & Faber,\n*Medley, Margaret, The Chinese Potter: A Practical History of Chinese Ceramics, 3rd edition, 1989, Phaidon,\n*Rawson, Jessica (ed). The British Museum Book of Chinese Art, 2007 (2nd edn), British Museum Press,\n*\"Sotheby's (2012)\": [http://www.sothebys.com/en/auctions/2012/ru-hk0367.html Sotheby's, Hong Kong], Sale \"Ru – From a Japanese Collection\", only lot, 4 April 2012\n*\"Sotheby's (2017)\": [http://www.sothebys.com/en/auctions/ecatalogue/2017/song-important-chinese-ceramics-from-le-cong-tang-collection-hk0747/lot.5.html Lot 5, \"A HIGHLY IMPORTANT AND EXTREMELY RARE RU GUANYAO BRUSH WASHER\"], \"Song – Important Chinese Ceramics from the Le Cong Tang Collection\", 3 October 2017, Hong Kong, [http://www.sothebys.com/en/auctions/ecatalogue/2017/song-important-chinese-ceramics-from-le-cong-tang-collection-hk0747/lot.5.html Lot notice by Regina Krahl et al.]\n*Sun, Xinmin, [https://web.archive.org/web/20150408012547/http://exhibition.ceramics.ntpc.gov.tw/celadon/en/b_products_00-3.html \"Appreciating Ru ware\"], National Palace Museum, Taipei\n*Vainker, S.J., Chinese Pottery and Porcelain, 1991, British Museum Press, 9780714114705\n*Valenstein, S. (1998). [http://libmma.contentdm.oclc.org/cdm/compoundobject/collection/p15324coll10/id/38422/rec/3 A handbook of Chinese ceramics], Metropolitan Museum of Art, New York.\nExternal links\n*[http://theme.npm.edu.tw/exh104/Celadons/en/page-2.html Three zoomable photos] of pieces in the National Palace Museum.\n*[http://www.britishmuseum.org/research/collection_online/search.aspx?searchText=%22Ru+ware%22 British Museum collection database search], 23 results"
    }
  ]
}