{
  "content": [
    {
      "type": "text",
      "text": "# Rubbish, King of the Jumble\n\n| narrated             =\n| theme_music_composer =\n| opentheme            =\n| endtheme             =\n| composer             = Andre Jacquemin, Dave Howman\n| country              = United Kingdom\n| language             = English\n| num_seasons          = 2\n| num_episodes         = 26\n| list_episodes        =\n| executive_producer   =\n| producer             =\n| editor               =\n| location             =\n| cinematography       =\n| camera               =\n| runtime              = 10 minutes\n| company              = A Productions, HTV\n| channel              = ITV (CITV)\n| first_aired          =\n| last_aired           =\n| related              =\n}}\nRubbish King of the Jumble is a children's animated television series on CITV created by Mark Taylor and featured the voice of Alexei Sayle. It was also produced by A Productions for HTV from 29 June 1993 to 2 September 1994.\nSeries\nIn this name being a play of \"King of the Jungle\", the series focused on an overfed cat named Rubbish who lives in the junk-filled attic of an old house. He tries and gets a quest to take food by using different disguises and schemes. But they get backfired by many of his enemies like the birds, the mice and a ferocious guard dog named Dinsdale who does nothing but chasing Rubbish and biting him on the tail.\nTrivia\n* The episodes were written by American writers Pamela Hickey and Dennys McCoy who also wrote episodes for other cartoon series like Butt-Ugly Martians, Tiny Toon Adventures, The Real Ghostbusters, Growing Up Creepie, ToddWorld, Beetlejuice and DuckTales.\n* The background music and the theme tune was composed by Andre Jacquemin and Dave Howman who composed the music for Boo! and BB3B and the song from The Meaning of Life Every Sperm is Sacred.\n* The show also aired on ABC in Australia.\n* The show later reran on British digital television on the former digital television channel for children Carlton Kids.\n* The English version of the show was also broadcast in Germany and West Germany on BFBS on their children's block as part of Children's SSVC.\nReferences\nExternal links\n*[http://www.aproductions.co.uk A Productions website]\n*"
    }
  ]
}