{
  "content": [
    {
      "type": "text",
      "text": "# Rudolf Warnecke\n\nRudolf Warnecke (4 September 1905, in Bautzen &ndash; 12 October 1994, in Ravenstein Merchingen) was a German artist, printmaker and wood engraver.\nAs the son of an architect Warnecke visited 1918 the Art Institute of the Weigang Brothers in Bautzen. In 1923 he founded, together with the painter Karl W. Schmidt a commercial art studio in Zittau, Germany. One year later he served as a newspaper cartoonist in the Ostsachsendienst.\nIn 1926 he studied engravings in the class of Alois Kolb at the Academy of Graphic Arts in Leipzig (Akademie für graphische Künste Leipzig).\nExhibitions followed in 1936 with purchases of graphical cabinets Bautzen, Dresden, Leipzig, Görlitz and the National Museum in Stockholm. The Nazi government engrossed his artistic work in 1940 with a graphics exhibition in Leipzig with Arthur Kampf and Karl Truppe.\nDue to his refusal to join the NSDAP he lost his position at the City Museum Bautzen and was drafted for military service.\nAfter being held as a prisoner of war by the American army 1945 in camp in Heilbronn, he became a resident of Dinkelsbuehl. 1946 was followed by portraits of prominent personalities : Apostolic Nuncio Aloysius Muench, Marshal of the Mil Int. Trib. Nuremberg, Robert H. Jackson, Matthias Wiemann, Marianne Hoppe, , , Victor von Gostomski and others.\nRudolf Warnecke married Friedlinde, his wife, in 1966, with whom he had a daughter. He settled in 1969 in Ravenstein, Merchingen. 1975-77 was followed by several exhibitions in Munich and Crailsheim and a special exhibition in Rothenburg ob der Tauber. In 1980 the work book \" With Geißfuß and prick through an artist's life - 100 woodcuts from 6 decades. \", Published by the Galerie Ravenstein 1981–1982 undertook Warnecke study tours to Greece, Italy and California, followed by a joint exhibition in Paso Robles, California at the home of Ray A. Pielop, CPA (USA), Berlin and Munich, together with Frans Masereel, A. Paul Weber and Josef Hegenbarth. The following year, he created the 36m high wall painting \" Peasants' War \" in an idol's castle, Ravenstein. The 1985 anniversary exhibitions took place in Munich, Bautzen, Dinkelsbühl, Mölln, and Kronach. In the same year, he was made an honorary citizen of the city of Ravenstein. In 1989, he created a portrait of the space pioneer Hermann Oberth.\nA few years before his death, Warnecke used artistically again his native city Bautzen and created with \"old Bautzen \" 20 large- scale oil painting \" Budissin'sches mosaic \" with 50 illustrations on the history of Bautzen, their myths and Originals (Lusatia -Verlag, Bautzen), and a new edition of 20 woodcuts of the medieval city of Bautzen appeared (published by the Galerie Ravenstein) on the occasion of the celebrations of the millennial city.\nRudolf Warnecke died in 1994 at the age of 89&nbsp;years in Merchingen.\nReferences\n*\"Der Holzschneider Rudolf Warnecke Dohlen-Verlag, 1956\n*\"Laderhosn und Pelzweste. Gereimtes und Ungereimtes in Oberlausitzer Mundart. (Stimmen der Landschaft. Band 19)von Emil Eichhorn.\n*\"Mit Geissfuss und Stichel durch ein Künstlerleben. 100 Holzschnitte aus 6 Jahrzehnten\", 1980\n*Erich Klausnitzer, Rudolf Warnecke: Budissinische Sagen. 3. überarbeitete und stark erweiterte Auflag. Lausitzer Druckhaus, Bautzen 1991, (Lausitzer Land 1).\nExternal links\n*\n*[http://www.rudolf-warnecke.de Portrait des Künstlers Rudolf Warnecke 1905-1994]\n*[http://www.rudolf-warnecke.de/view/flipcard Werkübersicht Rudolf Warnecke]"
    }
  ]
}