{
  "content": [
    {
      "type": "text",
      "text": "# Rudreswar Temple\n\n|map_type               = India Assam#India#Asia\n|map_size               = 200\n|coordinates            =\n|elevation_m            =\n| architecture_type     = Hindu Temple\n| architecture_style    =\n| creator               =\n| established           =\n}}\nThe Rudreswar Temple or Devaloya is a temple dedicated to Lord Shiva in the village of Rudreswar, under Sila Sindhurighopa Mouza (revenue circle), on northern bank of the river Brahmaputra, in North Guwahati. Built in 1749 CE by Ahom king Pramatta Singha, in memory of his father Swargadeo Rudra Singha, the temple is a fine example of a mixed style of Ahom-Mughal architecture.\nHistory\nIn the latter part of his reign, Swargadeo Rudra Singha announced his desire to expand Assam westward as far as the river Karatoya in present-day West Bengal and Bangladesh, which was considered the frontier of the ancient Kamarupa kingdom. Some sources also indicate that his ambition was to include a portion of the sacred Ganga river within his domain. Since Bengal was under the rule of the Mughals, he began to prepare for a massive military expedition against the Mughal Empire. An army of approximately 400,000 soldiers gathered in Guwahati, in which various tribes from the hills and plains came together, including the king of Cachar and the king of Jaintia from present day Meghalaya. His efforts were in vain. Before his preparations were completed he was seized with a mortal illness and died in August 1714 in his camp at Guwahati. His body was taken to Charaideo, in present-day Sivasagar District, for burial as per ancient Tai-Ahom custom. According to some sources, Rudra Singha was cremated according to Hindu customs in North Guwahati, while some denote only one of his small fingers was burnt in this way. His second son, Pramatta Singha, after ascending to the throne, decided to construct in Guwahati a temple to Lord Shiva in memory of his father. The site of his father's death was selected for the construction of the temple.\nThe temple was completed in 1749. After the completion of the temple, Pramatta Singha established a Shiva Linga in the temple and named it Rudreswar Shiva Linga, after his father Swargadeo Rudra Singha. The temple was named Rudreswar Devalaya and hence the village on which the temple was constructed is also known as Rudreswar. The king made arrangements for priests and people to maintain the temple and a donated large area of land in the name of the temple.\nDesign and structure\nThe temple was constructed using the architectural design of both Ahom and Mughals. The design of the temple is an imitation of the Mughal mausoleum. The temple has underground chambers whose entrances are present at the front side of the temple. It is not known precisely why these underground chambers were constructed, but, one can assume it was constructed for storing foods and other necessary items required for daily functioning of the temple. The Manikut (literally the jewel hut) or the chamber where the Shiva linga was present, is constructed above the underground chambers. Drainage system along with air ventilation system can also be seen in the structure of the temple. The temple was surrounded by a brick wall from all sides. The wall had two stone inscriptions of Ahom period which are presently preserved in museum.\nThere is pond near the temple which is known as Konwari pukhuri or pond for the princess (Konwari in Assamese language refers to princess or queens of the kings). According to local people, the pond was used for bathing by the queens and princesses of Ahom king Rudra Singha when he was camping here for the military expedition of Bengal and hence the pond got its name. Towards east from Konwari Pukhuri, another pair of ponds existed known as Hiloidari Pukhuri or the ponds of the artillery-men and musketeers(Hiloidari in Assamese language means musketeers or soldiers engaged in artillery).\nPresent day\nAfter the fall of Ahom Kingdom and establishment of British rule in Assam, the temple lost much of its lands and other privileges. It suffered greatly in the 1897 Assam and 1950 Assam–Tibet earthquakes. The temple's upper structure suffered tremendous damages. The local people, in a bid to preserve the temple, constructed the Manikut or the chamber where main religious function is held, roughly by woods and tins, to continue their religious functions. Later the temple came under the preservation of Archaeological Society of India (ASI) and the Government of Assam is also taking several steps for the restoration of the temple but still the construction is not yet complete.\nReferences"
    }
  ]
}