{
  "content": [
    {
      "type": "text",
      "text": "# Rufus King Jr.\n\n|death_date=\n|placeofburial=\n|placeofburial_label= Place of burial\n|image= Rufus King, Jr.jpg\n|caption=King after the American Civil War\n|nickname=\n|birth_place= New York City, New York\n|death_place= New York City\n|allegiance= United States of AmericaUnion\n|branch= United States ArmyUnion Army\n|serviceyears=1861 - 1871\n|rank=  Brevet Major\n|unit=  7th New York Militia 4th U.S. Light Artillery, Battery A 4th U.S. Infantry Regiment\n|commands=\n|battles=American Civil War\n|awards=Medal of Honor\n|relations=\n|laterwork=\n}}\nRufus King Jr. (March 21, 1838 &ndash; March 18, 1900) was an artillery officer in the Union Army during the American Civil War, and a Medal of Honor recipient.\nFamily\nBorn in New York City, Rufus King Jr. was the son of Rufus King, a graduate of the United States Military Academy, Class of 1833, and brigadier general during the Civil War, and the brother of Charles King, who was a military commander in the Philippine–American War. His great-grandfather was Rufus King, who was one of the signers of the United States Constitution.\nMilitary career\nThe younger King entered the army as a private in Company F, 7th New York Militia, serving a three-month enlistment from April to June 1861. He acquired a direct commission as a first lieutenant in the regular U.S. Army, and was assigned to the 4th U.S. Artillery, on August 5, 1861. He served in the Army of the Potomac throughout the war, eventually commanding (from 1864) 4th U.S. Light Artillery, Battery A, in the famed U.S. Horse Artillery Brigade. Lieutenant King was awarded one brevet promotion (to captain) for his bravery during the Seven Days Battles, in actions at the Battle of White Oak Swamp, on June 30, 1862. During that fight, King ranked only as a section chief, took command of combined Batteries A & C, 4th U.S. Artillery, when his commander was wounded.\nAt the end of the war, King was brevetted major for conduct during the war, but would have to wait until 1869 to receive his permanent promotion to captain.  He was honorably mustered out of the Army on January 1, 1871.\nRufus King has been incorrectly credited with designing a disappearing gun carriage known as King's Depression Carriage in the late 1860s. This carriage was, in fact, designed by William Rice King, of the Army Corps of Engineers. This used a counterweight to allow a 15-inch (381&nbsp;mm) Rodman gun to be moved up and down a swiveling ramp, so the weapon could be reloaded, elevated, and traversed behind cover. It was not adopted. Part of a test installation at Fort Foote, Maryland remains.\nKing was a Veteran companion of the Military Order of the Loyal Legion of the United States and an hereditary companion of the Military Order of Foreign Wars.\nMajor King died in New York on March 18, 1900. He was buried at the Evergreen Cemetery and Crematory, Hillside, Union County, New Jersey, Plot: 42-Lawn Plot, Map 5.\nThe Medal of Honor\nOn March 22, 1898, the United States Army finally awarded King the Medal of Honor for his actions at White Oak Swamp.\nRank and organization: First Lieutenant, 4th U.S. Artillery. Place and date: At White Oak Swamp Bridge, Va., June 30, 1862. Entered service at: New York. Birth: New York. Date of issue: April 2, 1898.\nCitation:\nThis officer, when his captain was wounded, succeeded to the command of two batteries while engaged against a superior force of the enemy and fought his guns most gallantly until compelled to retire.\nSee also\n*List of Medal of Honor recipients\n*List of American Civil War Medal of Honor recipients: G–L\nNotes\nReferences\n*\n*Heitman, Francis B. Historical Register and Dictionary of the United States Army, From its Organization, September 29, 1789 to March 2, 1903. Washington, D.C.: Government Printing Office, 1903.\n*U.S. War Department. The War of the Rebellion: A Compilation of the Official Records of the Union and Confederate Armies. Washington, D.C.: Government Printing Office, 1894.\nExternal links\n*\n*"
    }
  ]
}