{
  "content": [
    {
      "type": "text",
      "text": "# Rumiñawi (Inca warrior)__disambig_1\n\nRumiñawi}}\n| birth_place    = Quito, Kingdom of Quito (present-day Ecuador)\n| death_date     =\n| death_place    = Ecuador\n| allegiance     = Inca Empire\n| branch         = Inca Army\n| rank           = General\n| battles        = Spanish conquest of the Inca Empire\n| awards         =\n| nickname       =\n| serviceyears   =\n| commands       = Northern Inca armies\n| laterwork      =\n| native_name    =\n| native_name_lang = qu\n| known_for      = Leader of the resistance against the Spanish conquest in Quito\n}}\nRumiñawi, born late 15th century in present-day Ecuador, died June 25, 1535, was a general during the Inca Civil War. Hispanicized spellings of his name include Rumiaoui, Ruminavi, Ruminagui, Rumiñagui, and Rumiñahui. After the death of  Emperor Atahualpa, he led an uprising in 1533 against the Spanish in the northern part of the Inca Empire (modern-day Ecuador). According to tradition he ordered the city's treasure to be hidden and the city burned. Although captured and tortured, he never revealed the treasure. Since 1985, 1 December has been celebrated as a day of commemoration of his acts.\nLife\nBorn in Pillaro in modern Tungurahua Province in Ecuador, his given name was Ati II Pillahuaso. Inca historians tend to believe that he was Atahualpa's half-brother, born from a native noble woman.\nLater in life, after becoming an important warrior and military leader, he was called Rumiñawi (Kichwa rumi meaning stone, rock; ñawi meaning eye, face, \"stone eye\", \"stone face\", \"rock eye\" or \"rock face\").\nWhen Francisco Pizarro imprisoned Atahualpa and held him in the Ransom Room, Rumiñawi took forces to Cajamarca to deliver a huge amount of gold for his release.\nAfter the Spaniards executed Atahualpa, Rumiñawi returned to Quito.  He is believed to have ordered the Treasure of the Llanganatis thrown into a lake or buried in snow.\nSebastián de Benalcázar headed to Quito, intent on any treasure he could recover. The forces of Rumiñawi and Benalcázar met at the Battle of Mount Chimborazo, where Rumiñawi was defeated. However, before the Spanish forces captured Quito, its treasures were secreted away.\nRumiñawi had ordered the ancient city of Quito to be burned. He also ordered the principal ladies of the temples who refused to flee to be killed to prevent their being captured by the foreign soldiers. Rumiñahui was eventually captured by the Spanish, who tortured and killed him, enraged at his barbarity. They also wanted the treasure. But he never revealed the location of the treasure.\nLegacy\n*In 1985 the Ecuadorian Congress made December 1st an annual day of remembrance for Rumiñawi, as an indigenous hero and defender of the Kingdom of Quito.\n*Rumiñahui's portrait was the prominent image on the front of the 1,000 Ecuadorian sucre note.\nReferences\nFurther reading\n*Moya Espinoza, Reynaldo. La conquista en Piura."
    }
  ]
}