{
  "content": [
    {
      "type": "text",
      "text": "# Running Creek, Queensland\n\n| pop                 = 146\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4287\n| area                = 112.4\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 14.2\n| dir1                = SSE\n| location1           = Rathdowney\n| dist2               = 42.7\n| dir2                = SSW\n| location2           = Beaudesert\n| dist3               = 111\n| dir3                = SSW\n| location3           = Brisbane\n| dist4               =\n| dir4                =\n| location4           =\n| lga                 = Scenic Rim Region\n| stategov            = Scenic Rim\n| fedgov              = Wright\n| near-n              = Innisplain\n| near-ne             = Oaky Creek\n| near-e              = Chinghee CreekMount Gipps\n| near-se             = Cougal (NSW)\n| near-s              = Gradys Creek (NSW)Findon Creek (NSW)\n| near-sw             = Palen Creek\n| near-w              = Palen Creek\n| near-nw             = Rathdowney\n}}\nRunning Creek is a rural locality in the Scenic Rim Region, Queensland, Australia. In the , Running Creek had a population of 146 people. It borders New South Wales.\nGeography\nThe locality is bounded to the south by the ridgeline of the McPherson Range (which defines the Queensland border with New South Wales). The watercourse Running Creek (from which the locality takes its name) rises in Lamington on the northern slopes of the McPherson Range and enters the locality from the south-west (Mount Gipps) and then flows north through the locality exiting to the north-west (Rathdowney), where it immediately becomes a tributary of the Logan River ().\nRunning Creek has the following mountains:\n* Grass Tree Knob ()\n* Lawn Hill ()\n* Mount Chinghee ()\nRunning Creek has the following mountain passes:\n* Gradys Gap Gate ()\n* Richmond Gap ()\nThere are a number of neighbourhoods in Running Creek:\n* Dulbolla ()\n* Glenapp ()\n* Waiweer ()\n, 2016|left]]Mount Chinghee and Mount Chinghee National Park () are located in the south east of Running Creek.  The national park has no walking tracks or visitor facilities. It aims to protect remnant rainforest and preserve habitat.\nThe Sydney–Brisbane rail corridor traverses the length of the north south axis of Running Creek.  At the border the railway enters a tunnel and then traverses the Cougal Spiral.\nNearby the Lions Road passes through Richmond Gap on the McPherson Range and links to Cougal in northern New South Wales.\nThe terrain is generally hilly with elevations rising in the south to well above 600&nbsp;metres along the McPherson Range.  It covers the area roughly equivalent to the catchment formed by Running Creek, with the exception of its most upper parts which lie in Mount Gipps and Southern Lamington.  Running Creek, itself a tributary of the Logan River, has a number of tributaries including New Year Creek and Camp Creek.  Vegetation has been cleared in many parts for primary production purposes.\nHistory\n, 1900]]\nTimber was an important early industry in the area. There were sawmills at Running Creek and Glenapp. These sawmills no longer exist.\nGlenapp Provisional School opened on 19 August 1901. On 1 January 1909 it became Glenapp State School. It closed on 9 December 1960. It was located on the eastern side of Running Creek Road south of the junction with Spring Creek Road ().\nThe Beaudesert Shire Tramway operated between Beaudesert to Rathdowney and Lamington from 1903 to 1944. It had a stop in Running Creek called Dulbolla station ().\nThe Glenapp railway signal box is located on the eastern side of the Brisbane-to-Sydney railway line at Running Creek (). The hut was established in 1930 and is only one of a few remaining intact in the country. Having been made redundant due to automation, it was proposed to demolish the Glenapp signal box in 2007. However, the \"Glenapp boys\" Den and Rob Sibson, who had grown up in the Glenapp community, decided to rescue and restore the signal box as a small museum. The Glenapp railway siding was relocated to the Rathdowney Historical Museum.\nTelemon Environment Park which later became known as Mount Chinghee National Park was first gazetted in 1994.\nDemographics\nIn the , Running Creek and surrounding localities had a population of 463 people.\nIn the , Running Creek had a population of 147 people.\nIn the , Running Creek had a population of 146 people.\nEducation\nThere are no schools in Running Creek. The nearest government primary school is Rathdowney State School in neighbouring Rathdowney to the north-west. The nearest government secondary school is Beaudesert State High School in Beaudesert.\nSee also\n* List of tramways in Queensland\nReferences\nFurther reading\n*\nExternal links"
    }
  ]
}