{
  "content": [
    {
      "type": "text",
      "text": "# Rural Municipality of Kingsley No. 124\n\ndivision]]\n|subdivision_name4      = 1\n|subdivision_type5      = Federal riding\n|subdivision_name5      = Souris—Moose Mountain\n|subdivision_type6      = Provincial riding\n|subdivision_name6      = Moosomin\n|government_footnotes   =\n|leader_title           = Reeve\n|leader_name            = Gordon Sproat\n|leader_title1          = Governing&nbsp;body\n|leader_name1           = RM of Kingsley No. 124 Council\n|leader_title2          = Administrator\n|leader_name2           = Holly Heikkila\n|leader_title3          = Office location\n|leader_name3           = Kipling\n|leader_title4          =\n|leader_name4           =\n|established_title      = Formed ()\n|established_date       =\n|established_title2     = Formed\n|established_date2      = December 12, 1910\n|established_title3     = Name change\n|established_date3      =\n|established_title4     = Name change\n|established_date4      =\n|established_title5     = Amalgamated\n|established_date5      =\n|area_footnotes         = &nbsp;(2016)\n|area_land_km2          = 844.06\n|population_as_of       = 2016\n|population_footnotes   =\n|population_total       = 444\n|population_density_km2 = 0.5\n|timezone               = CST\n|timezone_DST           = CST\n|coordinates            =\n|postal_code_type       = Postal code\n|postal_code            = S0G 2S0\n|area_codes              = 306 and 639\n|blank_name             = Highway(s)\n|blank_info             =\n|blank1_name            = Railway(s)\n|blank1_info            =\n|blank2_name            = Waterway(s)\n|blank2_info            =\n|website                =\n|footnotes              =\n}}\nThe Rural Municipality of Kingsley No. 124 (2016 population: ) is a rural municipality (RM) in the Canadian province of Saskatchewan within Census Division No. 5 and  Division No. 1. It is located in the southeast portion of the province.\nHistory\nThe RM of Kingsley No. 124 incorporated as a rural municipality on December 12, 1910.\n;Heritage properties\nThere are three historical properties located within the RM.\n*Coronation Community Cairn - This commemorative monument built in 1978 recognizes the early pioneers in the region who helped build the one-room Coronation School in 1913.  The monument is located nine kilometers northeast of Windthorst.\n*Highland Baptist Church (previously called the Swedish Baptist Church) - This church was constructed in 1924 by early Swedish immigrants.  Regular services were held from 1924 until 1970.  The church still holds the occasional special service or event.  The church also has a cemetery on the property.  The building is located twelve kilometers north of the Town of Kipling.\n*Poplar Grove United Church - This church was constructed in 1902, and is located ten kilometers southeast of the Town of  Broadview.   The church is constructed of field stone and has nine stained-glass windows.  Regular services were held from 1902 until 1970.  The cemetery dates back to 1887.  Today the site is used for public events and the occasional special service.\n*Zion Lutheran Church - This country church was constructed in 1926, and is located  eight kilometers north of Windthorst.\nGeography\nCommunities and localities\nThe following urban municipalities are surrounded by the RM.\n;Towns\n* Kipling\nThe following unincorporated communities are within the RM.\n;Localities\n* Bender\n* Inchkeith\n* Neelby\nDemographics\n|1981|683\n|1986|694\n|1991|584\n|1996|524\n|2001|491\n|2006|439\n|2011|421\n|2016|444\n}}\n}}\nIn the 2021 Census of Population conducted by Statistics Canada, the RM of Kingsley No. 124 had a population of  living in  of its  total private dwellings, a change of |444|1}} from its 2016 population of . With a land area of , it had a population density of  in 2021.\nIn the 2016 Census of Population, the RM of Kingsley No. 124 recorded a population of  living in  of its  total private dwellings, a |421|1}} change from its 2011 population of . With a land area of , it had a population density of  in 2016.\nGovernment\nThe RM of Kingsley No. 124 is governed by an elected municipal council and an appointed administrator that meets on the second Tuesday of every month. The reeve of the RM is Gordon Sproat while its administrator is Holly Heikkila. The RM's office is located in Kipling.\nTransportation\nKipling Airport is located within the rural municipality.\nReferences"
    }
  ]
}