{
  "content": [
    {
      "type": "text",
      "text": "# Russian conquest of the Astrakhan Khanate\n\n- 9 of July of 1554 Second Campaign: April of 1556 - May of 1556\n| place       = Astrakhan Khanate\n| coordinates =\n| map_type    =\n| map_relief  =\n| map_size    =\n| map_marksize =\n| map_caption =\n| map_label   =\n| territory   =\n| result      = Russian Victory Russian vassalization of Astrakhan in the First Campaign Russian Annexation of the Khanate in the Second Campaign\n| status      =\n| combatants_header =\n| combatant1  =  Izmail loyalists (1554)\n| combatant2  = Astrakhan Khanate Yusufloyalists (1554)  Crimean Khanate(Diplomatic Support in the First Campaign)(Military Support in the Second Campaign)\n| combatant3  =\n| commander1  = Ivan IV1554:  Izmail Yuri Pronsky Alexander Vyazemsky Dervish Ali1556: Ivan Cheremisinov Ivan Semenovich Timofey Teterin Governor Pisemsky Mikhail Kolupaev Lyapun Filimonov\n| commander2  =  Devlet I Giray1554:Yamghurchi of Astrakhan Yusuf1556:Dervish Ali\n| commander3  =\n| units1      = 1554: 3 regiments with 10,000 soldiers (30,000 soldiers) under the command of Yuri Pronsky2,500 soldiers under the command of Alexander Vyazemsky1556:Unknown\n| units2      = Astrakhan Khanate Army:1554:Unknown1556:UnknownCrimean Tatar Army:700Crimean Tartars300 Janissars\n| units3      =\n| strength1   = 1554:32,500 soldiers1556:3,000 soldiers\n| strength2   = Astrakhan Khanate Army:1554:Unknown1556:UnknownCrimean Tatar Army:1556:1,000\n| strength3   =\n| casualties1 =\n| casualties2 =\n| casualties3 =\n| notes       =\n| campaignbox =\n}}\nThe Russian Invasion of the Astrakhan Khanate, which took place in 1554 and 1556, marked an important expansionist advance by the Tsardom of Moscow over the Tatar peoples of the Volga region. Motivated by the interest in controlling the trade routes that linked Europe to the East and consolidating Russian influence in the Caucasus, the Russian campaign had two decisive moments. The first attack in 1554 resulted in the victory over Khan Yamghurchi, who opposed the tsarism, allowing the imposition of a puppet ruler, Dervish Ali. However, local dissatisfaction culminated in a new rebellion, forcing Moscow to carry out a second campaign in 1556, which resulted in the definitive destruction of the khanate. The fall of Astrakhan not only consolidated Russian control over the strategic Volga corridor, but also paved the way for subsequent expansion towards Siberia and the Caucasus.\nPrelude\nSince the war between Tokhtamysh and Timur from 1386 to 1395, the Golden Horde had weakened considerably, paving the way for the emergence of rump states. Among them the Crimean Khanate and the Kazan Khanate. The State of the Great Horde succeeded the Khanate of the Golden Horde, but it ceased to exist after the Crimean Khanate sacked and burned the horde's capital, Sarai in 1502. Before that, the Khanate of Astrakhan, a successor state to the Great Horde, was established in the south. From this moment on, Astrakhan actively collaborated with its Tatar allies in the destruction of the growing Muscovite power, which was more present at the time when the Russians managed to unify and deliver powerful blows against their enemies Lithuanians, Livonians and Swedes.\nWith the defeat of the Kazanians in 1552, Astrakhan became the newest target of Ivan Grozny to acquire full access to the Volga River and the Caspian Sea and secure new access routes to the Caucasus, Central Asia and Siberia. Yamghurchi of Astrakhan, the penultimate Khan of the Khanate of Astrakhan, initially wanted to become a vassal of Ivan the Terrible, but ended up betraying the Tsar by allying himself with the Ottoman Sultan, after the Muscovite capture of Kazan. Yamghurchi joined forces with Devlet Giray of Crimea and Yusuf Nogai, Prince of the Nogais, who had a great hatred for Russia due to the captivity of his daughter and grandson after the conquest of the Khanate of Kazan. The Russian ambassador in Astrakhan was dishonored and imprisoned on the Khan's orders, which gave the Russian tsar the pretext to intervene. According to scribes of the time, Ivan IV justified the invasion as a recovery of lands that belonged to Russia, believing that Astrakhan was the ancient city of Tmutarakan, a territory that had once been ruled by Mstislav, son of Vladimir I. The Nogai Murzas, including Izmail, allies of Russia and enemies of Yusuf, supported the idea of restoring Dervish to the throne of Astrakhan, as he had been the rightful ruler before Yamgurchi and Ismail sought to dethrone Yusuf from command of the Nogai Horde.\nFirst Russian Campaign (1554)\nIn the spring of 1554, three regiments with 10,000 soldiers (30,000 Russian soldiers) under the command of Prince Yury Ivanovich Pronsky set out on ships down the Volga River towards Astrakhan. Troops from Vyatka, led by Prince Alexander Ivanovich Glukhoy Vyazemsky, were also sent. On 29 August, while Tsar Ivan IV was celebrating his birthday in Kolomenskoye, a messenger from Prince Pronsky arrived with news of the capture of Astrakhan. Pronsky reported that on June 29 they had reached Perevoloka, between the Volga River and the Don River, and sent ahead Prince Alexander Ivanovich Vyazemsky and Danilo Chulkov with Cossacks and boyar sons to capture Astrakhan spies. Vyazemsky defeated a group of enemies near a nearby island, killing them all. The captured prisoners revealed that they had been sent by Yamgurchei to investigate the Moscow army, and that Yamgurchei himself was camped five miles south of Astrakhan, with the city virtually deserted. Pronsky, leaving the larger ships behind, advanced rapidly towards Astrakhan. He sent Vyazemsky to attack Yamgurchi's camp, while he himself headed for the city. Arriving on 2 July, the Russian forces landed at two points and took the fortress without resistance, as the defenders fled upon sighting them. Vyazemsky also found Yamgurchei's camp empty, as he had fled to Azov. Numerous nobles and family members of Yamgurchi's court were captured or killed, while he himself managed to escape to the Crimean Khanate.\nOn July 7, the Russians surprised the fleeing inhabitants, killing some, capturing others, and freeing many Russian slaves. The remaining inhabitants of Astrakhan begged for mercy, offering to serve the Russian tsar and the new khan Dervish. The Russian governors agreed on the condition that all Russian slaves be freed, regardless of which horde they belonged to. After installing Dervish as ruler of the khanate, Pronsky negotiated a treaty on July 9, 1554, under which Astrakhan was to pay annual tributes of 40,000 altyns (1,200 rubles of silver), 3,000 fish and 3,000 sturgeon per fathom (up to 2.5 m) to the Tsar of Moscow. Furthermore, Russian fishermen were allowed to fish freely on the Volga from Kazan to the Caspian Sea without taxes or registration, while local fishermen could do the same without interference. Should Dervish die, the inhabitants of Astrakhan would be obliged to accept the new ruler appointed by the Russian tsar. With these agreements in place, the Russian governors returned to Moscow, taking with them Yamguchi's five daughters, their children, and the freed Russian slaves.\nAstrakhan Civil War (1555)\nHowever, the spring of 1555 was not peaceful for Dervish Ali, as Astrakhan faced another civil war, this time against the sons of Yusuf and Yamgurchi himself, who, after regaining strength in allied territories and securing the support of the Crimean Khanate and the Ottomans, organized a new campaign against the city with an army that included not only Astrakhan and Nogai warriors, but also Turkish janissaries. He attacked and besieged Astrakhan twice, but only after concluding an agreement with the sons of Yusuf and making them return to the east with great spoils and securing the support of the Russian armies in April 1555, Dervish defeated and killed Yamgurchi, thus installing Dervish as de facto Ruler of the Khanate.\nDervish's Treason (1555)\nAlso in 1555, Dervish asked Devlet I Giray for help, to send him a contingent with the aim of restoring the independence of the Khanate, expelling a Russian army stationed in Astrakhan and reestablishing relations between Crimea and Astrakhan. Unfortunately for the Russians, Dervish restored the independence of the Khanate temporarily and defeated the Russian forces stationed in Astrakhan.\nSecond Russian Campaign (1556)\nAs a punitive action for Dervish's betrayal, Ivan IV organized a new expedition against the traitor. The Russian troops were led by Ivan Cheremisinov. The Russian army included the Streltsy orders of Ivan Cheremisinov and Timofey Teterin, the Vyatka army of the governor Pisemsky, and the Cossack detachments of Mikhail Kolupaev and the Volga ataman Lyapun Filimonov. In total, only about 3.000 soldiers were sent in the second campaign, which demonstrates the purely punitive nature of the campaign and the military weakness of the Astrakhan Khanate. The detachments were sent out in the spring of 1556, each from its own location, independently of each other, and then united near Astrakhan.\nFilimonov's Cossack detachment was the first to suddenly approach the city. The Khan's warriors did not even have time to lock themselves in the fortress. The Cossacks defeated the Astrakhan army and stormed the city. The Streltsy and Dom Cossacks who arrived in time consolidated the success. After several skirmishes, Dervish fled to Azov, hoping to gather a new detachment and recapture the city when the Russians withdrew their main forces. However, Dervish was betrayed by his own men, and he never again had the chance to regain his domains.\nThe Aftermath and the Integration of Astrakhan into the Russian State\nAfter this victory, the Astrakhan Khanate was liquidated. Moscow no longer entrusted the throne to a chosen khan but instituted direct administration. In 1559, as an result of the increase in the Russian presence in the region, the princes of Pyatigorsk and Cherkassk asked Ivan the Terrible to send a detachment to protect them from Crimean Tatar attacks, along with priests to support their faith.\nThe title of Tsar of Astrakhan began to be used by Russian tsars in 1557. Voivodes were appointed to govern Astrakhan, and its residents swore allegiance to the Russian state, ensuring a peaceful nomadic life and profitable trade. Soon, envoys from Urgench, Shemakha, and Derbent arrived in Astrakhan to establish friendship, peace, and trade. Thus, control of the Volga trade route from Kazan to Astrakhan was secured, marking a significant foreign policy success for the Russian state. Moscow understood Astrakhan's critical role as a main transit hub for trade with East Asian states.\nImmediately after this conquest, the Ottoman Empire and the Crimean Khanate, alarmed by the Russian conquest of Islamic territories, began the Russo-Turkish War (1568–1570), which was a major defensive victory for the Russians.\nA new stage in the history of Astrakhan began. The city became an important trade and border center of Russia. In order to keep the city under control so that no nomadic groups could reclaim it, a fortress was built on the island of Sain (Shaban-bugr), which the Russians called Hare. Ivan Cheremisinov, who was appointed as the new governor of Astrakhan, asked permission to begin construction of a fortress city on the chosen site and sent the tsar drawings of “what the city should look like”. The project was approved, and ships and convoys with people, food, ammunition and various goods set out from central Russia. The first fortress was made of wood and fortified with earthen ramparts. In 1558, a new governor arrived, Ivan Grigorievich Vyrodkov, who became famous for the “Kazan affair” (the blowing up of the walls of the Kazan Kremlin). In Astrakhan, he began to build powerful defensive fortifications capable of protecting the state's borders and ensuring the safety of its residents. Thus, Astrakhan became a strong Russian fortress on the southern borders. Subsequent attempts by the Crimean-Turkish troops to take Astrakhan were unsuccessful. Later, Astrakhan was further fortified. In the 80s of the 15th century, the stone Astrakhan Kremlin is being built on the site of wooden and earthen structures. It was built \"on the model of the Moscow Kremlin\". This Kremlin was an example of Russian defensive architecture and was on a par with the strongest fortresses of medieval Russia.\nGradually, Astrakhan became the largest center of trade with the Eastern countries. Khiva merchants were engaged in large-scale trade. Since the 17th century guest houses of Persians, Armenians and Indians appeared in Astrakhan, and trading companies were established. In the same century, the Astrakhan region was intensively populated. For many years after the annexation of the Astrakhan Khanate to Russia, Astrakhan was the only large settlement from Kazan to the Caspian Sea. It was only in the late 1620s that the first fortified cities appeared in the Astrakhan region. In 1627, a small fortress, Cherny Yar, was built, located 400 kilometers north of Astrakhan, between 1665 and 1667. To protect Astrakhan and guard the fishing industry in the east, the Krasny Yar fortress was built.\nReferences\nSources\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n* \"CHEREMISINOV,\" \"Encyclopedic Reference Dictionary,\" vol. XII, St. Petersburg, 1847, p.&nbsp;125. — Karamzin, \"History of the Russian State.\" — Soloviev, \"History of Russia.\" Available at: [https://dic.academic.ru/dic.nsf/enc_biography/16049/%D0%A7%D0%B5%D1%80%D0%B5%D0%BC%D0%B8%D1%81%D0%B8%D0%BD%D0%BE%D0%B2 Черемисинов-Караулов, Иван Семенович | Кто такой Черемисинов-Караулов, Иван Семенович?]\n*\n*\n*\n*\n*\n*\n* N. M. Karamzin. Istoriya gosudarstva Rossiyskogo. SPb. 1842. Book 2, Vol. 8, p.&nbsp;136.\n* I. V. Zaytsev. Astrakhanskoye khanstvo. Moscow: Vostochnaya literatura, 2004. .\n* P. L. Karabushchenko. Astrakhanskoye khanstvo. Astrakhan: Astrakhan University, 2009.\n* Razryadnaya kniga 1475–1605, Vol. I, Part III, Moscow: Institute of History USSR, 1978.\n* Bolshaya Rossiyskaya Entsiklopediya 2004–2017. .\n* I. V. Zaytsev. Ukaznye sochineniya. pp.&nbsp;161, 162, 166.\n* [https://ru.wikisource.org/wiki/%D0%A0%D0%91%D0%A1/%D0%92%D0%A2/%D0%9F%D1%80%D0%BE%D0%BD%D1%81%D0%BA%D0%B8%D0%B9-%D0%A8%D0%B5%D0%BC%D1%8F%D0%BA%D0%B8%D0%BD,_%D0%AE%D1%80%D0%B8%D0%B9_%D0%98%D0%B2%D0%B0%D0%BD%D0%BE%D0%B2%D0%B8%D1%87 Yuri Ivanovich Pronsky-Shemyakin] – from Russian Biographical Dictionary, Wikisource (in Russian)\n* M. G. Spiridov. Abridged Description of the Services of Noble Russian Nobles, Arranged by Their Families, Indicating From Whom These Families Originated or From Where Their Founders Came M. Univ. Press, 1810. Part 1. 1810. Vyazemsky Alexander Ivanovich. p.&nbsp;115, 116.\n* PhD D. M. Volodikhin. Governors of Ivan the Terrible. Collection of Biographical Sketches. — M.: Veche, 2009. — (Mysteries of the Russian Land). — p.&nbsp;282. Appendix No. 3. Registry of Oprichnina Governors. p.&nbsp;285. — .\n* Prince P. V. Dolgorukov. Russian Genealogy Book. SPB. Typ. K. Vingeber. 1854. Vol. 1. Vyazemsky Alexander Ivanovich. p.&nbsp;150.\n*\n* Great Russian Encyclopedia 2004—2017 //Peace of Astrakhan\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*"
    }
  ]
}