{
  "content": [
    {
      "type": "text",
      "text": "# Russian Expeditionary Force in France\n\nRussian Republic\n| allegiance                    =  Emperor of Russia Provisional Council of the Russian Republic\n| branch                        =\n| command_structure             =\n| type                          = Expeditionary Force\n| role                          = Cold-weather warfareCombined armsExpeditionary warfareTrench warfare\n| size                          =\n| current_commander             =\n| garrison                      =\n| nickname                      =\n| equipment                     =\n| motto                         =\n| colors                        =\n| march                         =\n| mascot                        =\n| battles                       = World War I\n* Western Front\n** Second Battle of the Aisne\n** Second Battle of the Marne (Légion d’Honneur Russe)\n* Macedonian front\n** Battle of Monastir (1916)\n** Battle of Monastir (1917)\n| notable_commanders            =\n| anniversaries                 =\n| identification_symbol         = Corps Expéditionnaire Russe en France\n| identification_symbol_label   =\n| identification_symbol_2       = Légion d’Honneur Russe\n| identification_symbol_2_label =\n}}\nThe Russian Expeditionary Force [REF] (, ) was a World War I military force sent to France and Greece by the Russian Empire. In 1915, the French requested that Russian troops be sent to fight alongside their own army on the Western Front. Initially they asked for 300,000 men, an unrealistically high figure, probably based on assumptions about Russia's 'unlimited' reserves. General Mikhail Alekseev, the Imperial Chief of Staff, was opposed to sending any Russian troops, although Nicholas II finally agreed to send a unit of brigade strength. The first Russian brigade finally landed at Marseille in April 1916.\nA second brigade was also sent to serve alongside other Allied formations on the Salonika front in northern Greece. In France, the First Brigade participated in the Nivelle Offensive; with news of the Russian Revolution affecting morale within the French Army following the failure of that offensive, the 1st and 3rd Brigades participated in the wave of mutinies spreading across France. The First Brigade was disbanded before the end of the year. The Honorary Russian Legion () of the 1st Moroccan Division continued to maintain a Russian presence in the west and in the First World War, until the Armistice of 11 November 1918.\nBefore March 1917\nRoute of the Russian Expeditionary Force to the Western Front\nRussian troops arriving in Marseille on the steamship Himalaya\nChampagne.]]\nIn December 1915 the French politician, Paul Doumer while on a visit to Russia, proposed that 300,000 Russian troops be sent to fight in France in exchange for French munitions. While the Russian High Command showed little enthusiasm for this proposal, Tsar Nicholas II supported it. General Alexeyev, the Russian chief of staff from August 1915, made an offer to send Russian troops to France, as long as they remained under Russian officers (while operating under the French High Command). Another requirement was that the French Navy transport them.\nThe 1st Russian Brigade formed in January, 1916 under the command of General Nikolai Aleksandrovich Lokhvitsky. It did not consist of regiments already in existence but was made up mostly of drafts from various reserve units incorporated into the newly formed 1st and 2nd Regiments, from Moscow and Samara respectively. The 1st Regiment's troops were mainly conscripted factory workers while the 2nd's were generally drawn from rural areas. The brigade totaled 8,942 men. It left Moscow on February 3, 1916, and arrived in Marseille on April 16 of the same year.\nThe regiments were divided into three battalions of four companies each.  Each regiment also had a liaison and a service section. The reserve battalion had six companies.  The First Brigade was commanded by General Lokhvitsky, and was composed of 180 officers and 8762 enlisted men. Each brigade had a double supply of clothing and a kitchen on wheels. The French Navy and Army undertook to provide shipping, supplies, and equipment.\nThe 3rd, 4th and 5th Brigades soon followed. The 2nd and 4th Brigades arrived on the Salonika front in August and November 1916. The 3rd Brigade comprised serving soldiers plus reserve units formed in Yekaterinburg and Chelyabinsk under the command of Fyodor Fyodorovich Palitzin; it left for France in August 1916.\nGeneral Aleksei Brusilov, commander of the Russian Southwest Front from March 1916, was responsible for the four brigades, which contributed a total of 44,319 men to the Entente effort in western and southern Europe. The 6th, 7th and 8th Brigades were never formed due to the outbreak of the Russian Revolution.\nApproximately 450 Estonian troops also served with the REF, mostly in the 1st and 3rd Brigades. After February 1917 these troops wore small Estonian flags to distinguish themselves from their Russian counterparts.\nThe Russians in action\nOrder of battle\nIn January 1916, the 1st Infantry Brigade of the Russian expeditionary Force (REF) was formed and included two regiments, the 1st under Colonel Mikhaïl Netchvolodov, and the 2nd under Colonel Dyakonov, each of 3 battalions in strength. The brigade was under the overall command of Major-General Nikolai Aleksandrovich Lokhvitsky. Transported by rail, 8,942 men reached Dalian, on the Korea Bay of the Korean peninsula and embarked on French naval vessels (including the transports Amiral Latouche-Tréville and Himalaya). The 1st Brigade reached Marseille on April 16, 1916.\nIn July 1916, the 2nd Infantry Brigade, commanded by General Mikhail Dieterichs, was sent via France to the Salonika Front. It arrived there, in parts, between August 1 and September 16, 1916. It was formed of the 3rd and 4th Infantry Regiments, of 3 battalions each, for a total of 9560 men.\nThe 3rd Infantry Brigade, formed of the 5th and 6th regiments, under, respectively, Colonels Narbout and Simonov, was formed in June 1916, and was sent to France in August via Arkhangelsk. This brigade was commanded by General Vladimir Marouchevski.\nThe 4th Infantry Brigade, formed of the 7th and 8th regiments, was commanded by Major-General . It was part of the Expédition de Salonique, stopping first at Brest aboard the ocean liner La Lorraine and finally arriving at Thessaloniki in October 1916, and at the front in November.\nIn July 1917, the two brigades operating on the Macedonian front were grouped together to form the 2nd Infantry Division. This formation was dissolved in January 1918,Les armées françaises dans la Grande guerre, Volume VIII/3, p. 525. due to the men and officers being greatly troubled by events on the Russian home front and the Allied commanders similarly fearful of the effect of communist propaganda on the troops, and reports of fraternisation with the Bulgarians on the front. The Russians were relieved of duty on the frontline between January 2 and January 20. Of the remaining soldiers, 784 volunteered to join the Russian Legion in France in March, while 2196 men, formed into two battalions, remained available for work. Over 17500 others refused either position, and were sent away to Bizerte and then further on.Les armées françaises dans la Grande guerre, Volume VIII/2, p. 565-567.\nFormations\nReadying and equipping was done with the French Army in Camp de Mailly, France. The Russian brigades also found themselves engaged in combat in the Balkans; where British, French, Italian, Albanian, Greek, Portuguese and Serbian forces were already serving together.\nBattle fronts\nIn France the Russian brigade prepared in camp de Mailly, in Champagne and was sent between Suippes and Aubérive on the Western Front. Russian units held the front of Champagne while French units were fighting the Battle of Verdun. Russians occupied the Fort de la Pompelle near Reims.\nFollowing heavy losses during the offensive of April 1917 (Second Battle of the Aisne, also known as bataille du Chemin des Dames) for the taking of Courcy and the Fort of Brimot, the 1st and 3rd Russian Brigades which had been placed under the French 7th Army Corps (General Georges de Bazelaire), were both cited at the orders of armed forces and paused at camp de La Courtine. Both Russian infantry brigades became the Russian Division, commanded by Lokhvitski.\nIn Macedonia, Russian troops participated in the invasion of Serbia during two battles, the Battle of Monastir (1916) and the Battle of Monastir of 1917 respectively.\nOn 11 March the 1st Russian Brigade relieved the 152nd French brigade in the Courcy sector, just to the north of Reims They were part of Mazel's Fifth Army and took their place in the frontline, where they suffered casualties in the run up to the Nivelle Offensive. On 15 April, on the eve of the Second Battle of the Aisne, the Russian soldiers received news of the February Revolution in Russia. They formed a soviet and debated whether to participate in the battle the next day, agreeing to do so by a small majority. Thus the next day, 16 April 1917, the 1st Brigade took part in the battle and took Courcy, just to the north of Rheims. On 23 April the 1st Infantry Brigade transferred to the Châlons-sur-Marne area, overseen by général Henri Gouraud of the French Fourth Army. French President Raymond Poincaré, impressed by the state of the Russian camp, awarded General Lokhvitsky the Commander of the Legion of Honor. The 1st Brigade was then re-deployed further east up the Marne valley between Suippes and Auberive at the end of June 1916.\nThe 3rd Brigade was also involved in the Second Battle of the Aisne and took Mount Spin. The casualties for the two brigades amounted to 4,542 men killed, wounded or missing in action.\nMutiny\nNews of the February Revolution started to reach the Russian soldiers in France during April 1917. At first these reports were kept secret by their officers but by 12 April the news became official. Four days later the  2nd Brigade lost over 4,000 casualties killed and wounded. Following the example of their comrades at home, soldiers of the Expeditionary Force based in the camp of La Courtine rejected their officers and elected soldier committees. At one meeting the committee representatives made an appeal to their fellow soldiers to refuse to drill, since they would not continue fighting.\nThe rebellious units, considered a dangerous revolutionary influence, were ordered to Salonika. They refused, demanding to be sent home to Russia. With this the military representatives of the Provisional Government on 25 August 1917 ordered loyal troops to vacate the camp of Courtine, leaving only those soldiers who said they would submit 'conditionally' to the Provisional Government, if allowed to return to Russia.\nOn 14 September 1917 French and Russian commanders isolated the rebel camp, placing the occupants on half-rations, and lining the surrounding roads with a mixture of French and reliable Russian troops and guns. On 15 September 1917, the remaining revolutionary soldiers, numbering around 2,000, were ordered to lay down their arms by 10 A.M. 16 September 1917 or be destroyed. The rebels refused and at 10 A.M. 16 September 1917 the encircling force fired upon the camp with a French artillery piece. After light fire had reduced their numbers, the majority of the Russian soldiers surrendered and were arrested. By 09:00 on September 16 the camp was completely occupied by French forces and the mutineers were disarmed. The casualties had been exclusively among the Russian mutineers, comprising 9 killed, and 49 wounded.\nThe Russians were at first sent to prison camps in North Africa and France. After some months many were sent back to Russia, while others were integrated into French society.\nIn January 2014  the Association pour la mémoire de la mutinerie des soldats russes à La Courtine en 1917 (Association for the memory of the mutiny  of Russian Soldiers at La Courtine 1917) was established.\nLégion d’Honneur Russe\nRussian Legion Battalion\nA loyal remnant of Russian troops, under Colonel Georgy Semyonovich Gotua, demanded that they be allowed to continue to fight. They were incorporated into either the French Foreign Legion; units of the Polish Army in France which was already serving on the Western Front; or the Russian Volunteer Legion (), also designated as the Russian Legion of Honour (). The Russian Legion was attached to the French 1st Moroccan Division commanded by Général Daugan on December 13, 1917. It continued to see active service (notably during the Second Battle of the Marne ()) until the end of the war, before being disbanded at the end of 1918.\nThe Russian and French units fought around Amiens in March 1918 and along the road from Soissons to Paris in May 1918. Losses during this fighting amounted to nearly 85% of the Russian Legion's numbers.\nIn July and August additional Russian volunteers, mainly veterans of the former Expeditionary Force, enabled the Russian Legion to become first a brigade and then a regiment with a total of 2 infantry companies as well as a mortar unit. The unit was assigned to the vicinity of Laffaux.  On September 12 the regiment penetrated three lines of fortifications despite heavy losses and were awarded a special flag by the Commander of the French Army, Marshal Ferdinand Foch as well as attracting more volunteers. By November 1, 1918, the regiment had 564 men comprising a machine gun company and three infantry companies.\nAfter the German withdrawal to the border the Moroccan Division, including the Russian Regiment, advanced towards Moyeuvre. This operation was halted by the signing of the Armistice on November 11. Near the end of 1918 the entire Russian Regiment was demobilized. Some Russians chose to remain in France, while others returned to revolutionary Russia. Among the latter was Rodion Malinovsky, the future Soviet Minister of Defence.\nBattalion Regimental Commander\n* Colonel Gothoua.\n* Chef de bataillon Tramuset. From August 11, 1918, to September 3, 1918 (killed)\n* Chef de bataillon Durand. From September 4, 1918, to December 25, 1918.\nDecorations\n* 2 citations at the orders of the armed forces. The Russian Legion Battalion bears the Fourragere with ruban colors of the Croix de guerre 1914-1918 bestowed December 19, 1918.\nMonuments\nMonument to the Russian Expeditionary Force in Paris.\nThe following monuments have been dedicated to the memory of the Russian Expeditionary Force:\n* on June 21, 2011, a Russian Expeditionary Force Monument was dedicated, in Paris;\n* in the Marne a monument at the Fort de la Pompelle on September 4, 2010, at the Russian cemetery of Saint-Hilaire-le-Grand. This is an ensemble memorial compromising a chapel and a column;\n* on June 12, 2011, a monument at Courcy commemorating all the sacrifices of the Russian brigades on the Western front.\n* a column dedicated in 2012 at the cemetery of La Courtine. The column is in memory of the mutineers of the summer of 1917, and proclaims in Russian  « à bas la guerre » (долой войну!). The Lacourtine 1917 Association is dedicated to that memory;\n* on July 15, 2016, a Russian Expeditionary Force monument was dedicated at Brest in France in the place of général de Gaulle,;\n* on May 12, 2016, at Marseille, the Consulate of the Russian Federation in France dedicated a plaque commemorating the 100th anniversary of the arrival of the 1st Brigade of the Russian Expeditionary Corps formed in Moscow and Samara.\nThere are also two Imperial Russian war graves in the Gouzeaucourt New British Cemetery, near Cambrai.\nRussian Expeditionary Force in France - Gallery\nFile:Monument troupes russes 12293.JPG|Memorial of the 1st and 3rd Infantry Brigades at Fort de la Pompelle\nVladimir Medinsky 05928 voyage en France Courcy.jpg|Courcy, Marne\nFile:Russian Monument Zeitenlik.jpg|Russian Monument at Zeitenlik Allied military cemetery, Thessaloniki\nFile:Bundesarchiv Bild 146-1976-007-32, Champagne, russische Soldaten mit Gasmaske.jpg|Russian soldiers on the Front of Champagne,Russian uniform and boots, and French helmets and gas masks\nFile:ЧМиОвФ - 89 - примерка касок.jpg| Trial of steel helmets\nNotable members of the REF in France\n* Nikolai Aleksandrovich Lokhvitsky (1867–1933), Lieutenant-General commandant of the Russian Expeditionary Force in France, immigrated to France and rests at Cimetière Russe de Sainte-Geneviève-des-Bois.\n* Rodion Malinovsky (1898–1967), Marshal of the Soviet Union, Soviet Minister of Defence and wounded on numerous occasions. He joined the Moroccan Division at the corps of the Russian Legion Battalion and took part in the most important combats of 1918. He also served in the Battle of Stalingrad and the Battle of Budapest.\nSee also\n* Canadian National Vimy Memorial\n* Givenchy-en-Gohelle\n* Moroccan Division\n** 2nd Marching Regiment of the 1st Foreign Regiment\n** 2nd Marching Regiment of the 2nd Foreign Regiment\n* Marching Regiment of the Foreign Legion\n* Belgian Expeditionary Corps in Russia\n* Russian Expeditionary Forces in France and the Balkans electoral district (Russian Constituent Assembly election, 1917)\nNotes\nReferences\nBibliographies\n* Remi Adam, Histoire des soldats russes en France 1915-1920 : Les damnés de la guerre, L'Harmattan, 1996.\n* Gérard Gorokhoff, Andrei Korliakov, Le Corps Expéditionnaire Russe en France et à Salonique 1916-1918, édition YMCA-PRESS, Paris, 2003 - 656  illustrations.\n* Cockfield, Jamie H. [https://books.google.com/books?id=Bz-h6IDlzeIC With Snow on Their Boots: The Tragic Odyssey of the Russian Expeditionary Force in France During World War I], 1997,\n* Gilbert Cahen : « Le temps retrouvé du soldat russe Anissim Ilitch Otmakhov - France 1916-1920 », , 288 pages, 30 photos, 2 cartes. Auto-édition Gilbert Cahen Versailles, mars 2013.\nFurther reading\n* Cockfield, Jamie H. With Snow on Their Boots: The Tragic Odyssey of the Russian Expeditionary Force in France During World War I. .\n* Poitevin, Pierre, \"La Mutinerie de la Courtine. Les régiments russes revoltés en 1917 au centre de la France\", Payot Ed., Paris, 1938.\nExternal links\n* [http://www.ascerf.com ASCERF.com - Site de l'association du Corps Expédtionnaire Russe en France (Mourmelon)]\n* [http://www.lacourtine1917.org/ www.lacourtine1917]"
    }
  ]
}