{
  "content": [
    {
      "type": "text",
      "text": "# Russel Ward\n\n| birth_place = Adelaide, South Australia\n| death_date =\n| death_place = Texas, Queensland\n| era =\n| region =\n| workplaces = University of New England\n| alma_mater = University of Adelaide (BA [Hons], MA)Australian National University (PhD)\n| thesis_title = The ethos and influence of the Australian pastoral worker\n| thesis_url = https://digitalcollections.anu.edu.au/handle/1885/9584\n| thesis_year = 1956\n| doctoral_advisor =\n| doctoral_students =\n| notable_students =\n| school_tradition =\n| main_interests = Australian culture and identity\n| principal_ideas =\n| major_works = The Australian Legend (1958)\n| awards = Ernest Scott Prize (1958)Member of the Order of Australia (1986)\n| influences =\n| influenced =\n}}\nRussel Braddock Ward AM (9 November 1914 – 13 August 1995) was an Australian historian. He is best known for The Australian Legend (1958), an examination of the development of the \"Australian character\", which was awarded the Ernest Scott Prize.\nEarly life and education\nHis parents were Florence Winifred Ward, née Braddock and John Frederick Ward, a teacher. Russel attended three schools at which his father worked. In the early 1920s, his father joined the staff of Thornburgh College, in Charters Towers, Queensland. In 1923, J.&nbsp;F. Ward was appointed founding headmaster of Wesley College, Perth. Russel completed his schooling at Prince Alfred College (PAC), Adelaide after his father became headmaster there in the early 1930s. At PAC Ward was a busy student, serving as prefect and on numerous committees including debating, rowing, christian union, cadets and historical society of which he was president.\nEarly career\nWard studied English at the University of Adelaide and taught at Geelong and Sydney Grammar Schools. During World War II he served in an army psychological unit. Ward's membership of the Communist Party of Australia (1941 to 1949) brought him to the attention of ASIO; and, in 1984, he appeared before the Hope Royal Commission on Australia's security and intelligence agencies stating that ASIO had harassed him for 40 years.\nAcademic career\nWard was at the University of New England as a lecturer in the 1950s and deputy chancellor for eight years.\nIn his book, The Australian Legend, Ward argued that the Australian bush was egalitarian and that this influenced Australian culture. Ward's book was both influential and controversial and is grouped among the classic historical references on Australia history. In the 40 years since its first publication, there were three editions and it has been reprinted 15 times.\nHis thesis in Legend was later challenged by Humphrey McQueen in 1970. It would influence the development of the Australian New Left.\nIn the 1986 Queen's Birthday honours Ward was made a Member of the Order of Australia (AM) for \"service to literature, particularly in the field of Australian history\".\nWard died in Texas, Queensland on August 13, 1995, at the home of his partner, Jeané Upjohn.\nLegacy\nThe Russel Ward Annual Lecture was established in his honour by the University of New England in 1986.\nBibliography\n* Man Makes History (1952) Shakespeare Head Press, Sydney\n* Felons and Folksongs (1955) Canberra University College, Canberra\n* The Australian Legend (1958) Oxford University Press, Melbourne\n* Australia (1967) Ure Smith, Sydney\n* A Nation for a Continent: The History of Australia, 1901–1975 (1977) Heinemann Educational Australia, Richmond\n* Australia Since the Coming of Man (1982) Lansdowne Press, Sydney\n* Finding Australia: The History of Australia to 1821 (1987) Heinemann Educational Australia, Richmond\n* A Radical Life: The Autobiography of Russel Ward (1988) Macmillan, South Melbourne\nSee also\n*ANZAC spirit & Mateship\n*Culture of Australia\n*History wars\nReferences"
    }
  ]
}