{
  "content": [
    {
      "type": "text",
      "text": "# Russian battleship Evstafi\n\n{|\n| Ship name= Evstafi\n| Ship renamed=Revoliutsiia (Revolution), 6 July 1921\n| Ship namesake= Saint Eustace\n| Ship ordered=\n| Ship builder=Nikolayev Admiralty Shipyard, Nikolayev\n| Ship laid down= 13 November 1904\n| Ship launched= 3 November 1906\n| Ship struck=21 November 1925\n| Ship in service=28 May 1911\n| Ship out of service=March 1918\n| Ship fate= Scrapped, 1922\n}}\npre-dreadnought battleship\n|Ship displacement=\n|Ship length=\n|Ship beam=\n|Ship draught=\n|Ship propulsion=2 shafts, 2 triple-expansion steam engines\n|Ship speed=\n|Ship range= at\n|Ship complement=928\n|Ship power=*22 Belleville boilers\n*\n|Ship armament=*2 × twin  guns\n*4 × single  guns\n*12 × single  guns\n*14 × single  guns\n*2 × single  torpedo tubes\n|Ship armour=*Krupp armour\n*Belt:\n*Deck:\n*Turrets:\n*Barbettes:\n*Conning tower:\n*Bulkheads:\n|Ship notes=\n}}\n|}\nEvstafi () was the lead ship of her class of two pre-dreadnought battleship of the Imperial Russian Navy's Black Sea Fleet. She was built before World War I and her completion was greatly delayed by changes made to reflect the lessons of the Russo-Japanese War of 1905.\nShe and her sister ship  were the most modern ships in the Black Sea Fleet when World War I began and formed the core of the fleet for the first year of the war, before the dreadnoughts entered service. They forced the German battlecruiser  to disengage during the Battle of Cape Sarych shortly after Russia declared war on the Ottoman Empire in late 1914. She covered several bombardments of the Bosphorus fortifications in early 1915, including one where she was attacked by Goeben, but Evstafi, together with the other Russian pre-dreadnoughts, managed to drive her off. Evstafi was relegated to secondary roles after the first dreadnought entered service in late 1915 and reduced to reserve in 1918 in Sevastopol.\nEvstafi was captured when the Germans took the city in May 1918 and was turned over to the Allies after the Armistice in November 1918. Her engines were destroyed in 1919 by the British when they withdrew from Sevastopol to prevent the advancing Bolsheviks from using them against the White Russians. She was abandoned when the Whites evacuated the Crimea in 1920 and was scrapped by the Soviets in 1922–23.\nDescription\nEvstafi was  long at the waterline and  long overall. She had a beam of  and a maximum draft of . Her displacement was  as designed.\nShe had two 3-cylinder vertical triple expansion steam engines driving two propellers. 22 Belleville water-tube boilers provided steam to the engines. The engines had a total designed output of  and gave a top speed of . At full load she carried  of coal that provided her a range of  at a speed of .\nEvstafis Obukhovskii 12-inch Pattern 1895 40-calibre guns were mounted in two twin-gun turrets, one each fore and aft. Each turret had a firing arc of 260°. All four  50-calibre Pattern 1905 guns were mounted in the corners of the superstructure in armoured casemates. These guns had a firing arc of 120° and could fire straight ahead or astern. The dozen  Canet Pattern 1892 45-calibre guns were mounted in the lower casemates. The anti-torpedo boat armament consisted of 14  Canet Pattern 1892 50-calibre guns mounted in sponsons on the upper deck, protected by gun shields. She carried two  torpedo tubes on the broadside aft.\nWartime modifications\nEvstafi was fitted with anti-aircraft guns on top of each of her turrets during 1915 and screens were added on top of her funnels to keep out light bombs. She first received three 75&nbsp;mm guns, but these were later replaced by two  guns and a pair of  guns.\nService history\nConstruction of Evstafi began on 13 July 1904, well before the formal keel-laying ceremony on 23 November 1904. Progress was relatively quick, despite the disruptions caused by the 1905 Revolution, and she was launched on 3 November 1906. Fitting-out, however, was considerably delayed by a number of changes made as the navy digested the lessons of the Russo-Japanese War and she was not completed until 28 May 1911. Shortly after completion she ran aground off the Romanian port of Constanţa in October 1911, but was only slightly damaged.\nWorld War I\nEvstafi, as the newest ship in the Black Sea Fleet, was the flagship of Vice Admiral Andrei Eberhardt, commanding the fleet, for the first year or so of World War I. Two weeks after the Russian declaration of war on the Ottoman Empire on 2 November 1914, the Black Sea Fleet, comprising the pre-dreadnoughts Evstafi, , , , , and three cruisers were escorted by three destroyers and 11 torpedo boats set out on 15 November to bombard Trebizond. They did this successfully on the morning of 17 November and they turned west to hunt for Turkish shipping along the Anatolian coast before setting course for Sevastopol later that afternoon. They were intercepted by the Turkish battlecruiser Yavuz Sultan Selim and the light cruiser Midilli the following day in what came to be known as the Battle of Cape Sarych. Despite the noon hour the conditions were foggy and the capital ships initially did not spot each other. The Black Sea Fleet had experimented on concentrating fire from several ships under the control of a \"master ship\" before the war and Evstafi held her fire until Ioann Zlatoust, the master ship, could see Yavuz. When the gunnery commands were finally received they showed a range over  in excess of Evstafis own estimate of , so Evstafi opened fire using her own data before Yavuz turned to unmask its broadside. She scored a hit with her first salvo as a 12-inch shell partially penetrated the armor casemate protecting one of Yavuzs  secondary guns. It detonated some of the ready-use ammunition, starting a fire that burnt out the casemate and killed its crew.\nYavuz returned fire shortly afterwards and hit Evstafi in the middle funnel; the shell detonated after it passed through the funnel and destroyed the antenna for the fire-control radio, which meant that Evstafi could not correct Ioann Zlatousts inaccurate range data. Yavuz hit Evstafi four more times. although one shell failed to detonate, before Rear Admiral Wilhelm Souchon decided to turn away and break contact after fourteen minutes of combat. Evstafi suffered 34 killed and 24 wounded from those hits. Evstafi only fired between 12 and 16 12-inch shells as well as 14 eight-inch and 19 six-inch shells.\nSeveral armour plates on Evstafi required replacement after the battle and they were taken from the old pre-dreadnought  so that the repairs were completed by 29 November. On 9 January 1915 Midilli and the  encountered the Russian fleet while returning from a mission in the eastern part of the Black Sea. Midilli hit Evstafis forward turret with a  shell, temporarily putting it out of action, and the two cruisers escaped using their superior speed.\nEvstafi and Ioann Zlatoust served as the covering force for several bombardment missions of the Bosphorus between 18 March and 9 May 1915. The two earlier bombardments were uneventful, but the 9 May bombardment provoked a reaction as Yavuz intercepted the Russian battleships after they'd been spotted by the . Both forces turned on parallel courses and opened fire at the range of . Neither side scored a hit although Yavuz had multiple near-misses on Evstafi. Admiral Eberhardt ordered his ships to make only  while Yavuz was making . Yavuz was unable to cross the T of the Russian ships, despite its superior speed, as they were continually turning. This manoeuvre bought enough time that Tri Sviatitelia and Pantelimon were able to rejoin the other two ships before they could start shelling the Ottoman forts. Pantelimon  hit Yavuz twice before the German ship broke contact after 22 minutes of firing. With the fleet assembled Admiral Eberhardt attempted to pursue the enemy battlecruiser, but was unsuccessful.\nOn 1 August 1915 she, and all the other pre-dreadnoughts, were transferred to the 2nd Battleship Brigade, after the dreadnought  had entered service. On 1 October the new dreadnought provided cover while Ioann Zlatoust and Pantelimon bombarded Zonguldak and Evstafi shelled the nearby town of Kozlu. Both Evstafi-class ships participated in the second bombardment of Varna in May 1916.\nEvstafi and Ioann Zlatoust were reduced to reserve in March 1918 in Sevastopol. Immobile, they were captured there by the Germans in May 1918 and Evstafi was subsequently used by them as an accommodation hulk. Both ships were handed over to the Allies the following December. The British wrecked both ships' engines on 22–24 April 1919 when they left the Crimea to prevent the advancing Bolsheviks from using them against the White Russians. They were captured by both sides during the Russian Civil War, but were abandoned by the White Russians when they evacuated the Crimea in November 1920. Evstafi was renamed Revoliutsiia (Revolution) on 6 July 1921. The ships were scrapped in 1922–23, although they were not removed from the Navy List until 21 November 1925.\nNotes\nFootnotes\nBibliography\n*\n*\n*\n*\nExternal links\n*\n* [http://flot.sevastopol.info/ship/brone/evstafiy.htm ship history on Black Sea Fleet]\n* [http://www.uarmy.com.ua/ALMANAH/ALMANAH03/article12/art12.html КОРАБЛІ УКРАЇНСЬКОЇ ФЛОТИ (1917&nbsp;– 1918 рр.)&nbsp;– Ukrainian Navy (1917–1918)]\n* [http://rusnavy.com/history/interesting/ukranianfleet.htm?print=Y Ukrainian Navy: ferial excursions into the past and present]"
    }
  ]
}