{
  "content": [
    {
      "type": "text",
      "text": "# Russia Billie Jean King Cup team\n\nThe Russia Billie Jean King Cup team represented Russia in Billie Jean King Cup tennis competition and are governed by the Russian Tennis Federation. They compete in the World Group. Following the 2020 ban of Russia by  the World Anti-Doping Agency (WADA) and the Court of Arbitration for Sport (CAS), it competed and won the 2020–21 Billie Jean King Cup under the RTF flag and name. After the Russian invasion of Ukraine, the International Tennis Federation suspended Russia from Billie Jean King Cup competitions.\nFrom 1968 until 1991, the team represented the Soviet Union. With the dissolution of that country, it started to represent the Commonwealth of Independent States in 1992 until 1995, when it started to represent the Russian Federation.\nCurrent team\n{| class=\"wikitable sortable\" style=font-size:97%\n|- align=\"center\"\n! rowspan=\"2\"| Name\n! rowspan=\"2\"| DOB\n! rowspan=\"2\"| First\n! rowspan=\"2\"| Last\n! rowspan=\"2\"| Ties\n! class=\"unsortable\" colspan=\"3\"| Win/Loss\n! class=\"unsortable\" colspan=\"2\"| Ranks\n|-\n! Sin\n! Dou\n! Tot\n! Sin\n! Dou\n|-\n|\n|\n| 2009\n| 2021\n| 17\n| 11–10\n| 5–2\n| 16–12\n|align=center|12\n|align=center|108\n|-\n|\n|\n| 2016\n| 2021\n| 7\n| 5–1\n| 2–2\n| 7–3\n|align=center|26\n|align=center|281\n|-\n|\n|\n| 2014\n| 2021\n| 6\n| 0–3\n| 3–1\n| 3–4\n|align=center|32\n|align=center|16\n|-\n|\n|\n| 2020\n| 2021\n| 2\n| 2–1\n| —\n| 2–1\n|align=center|30\n|align=center|146\n|-\n|\n|\n| 2021\n| 2021\n| 4\n| 2–0\n| 3–0\n| 5–0\n|align=center|40\n|align=center|1329\n|-\n|}\nFile:Nastia Pavlyuchenkova (2023 US Open) 19 (cropped).jpg|Anastasia Pavlyuchenkova\nFile:Daria Kasatkina (2024 DC Open) 07.jpg|Daria Kasatkina\nFile:Veronika Kudermetova (2023 US Open) 30 (cropped).jpg|Veronika Kudermetova\nFile:Ekaterina Alexandrova BJK Cup 2020-21 (cropped) (cropped).png|Ekaterina Alexandrova\nFile:Liudmila Samsonova (2023 US Open) 08 (cropped).jpg|Liudmila Samsonova\nHistory\nRussia competed in its first Fed Cup in 1968, as the Soviet Union.  They won the Cup in 2004, 2005, 2007 and 2008, and have finished as runners-up seven times.\nPrior to 1992, Russian players represented the Soviet Union. In 1992, eleven  countries which had previously been part of the Soviet Union played as the Commonwealth of Independent States, with Evgenia Manyukova and Elena Makarova, who both played in following years for Russia, and Elena Pogorelova, who played one doubles match in the Fed Cup.\nRussia in the Fed Cup since 1995\n2004–2008: Zenith\nIn 2008, the player staff was revised to include debut Maria Sharapova. Dinara Safina replaced Svetlana Kuznetsova, who asked Tarpishchev not to include her as she wanted to fight for the top ranking with Amélie Mauresmo. Anna Chakvetadze, Elena Vesnina and alternate Elena Likhovtseva were also announced for the first round against Israel. As a result of the 4–1 win, the distance between the top-ranked Russian team and the second-placed team Italy increased to 12,847 points.\nIn the semifinals against the United States, Sharapova was replaced by Kuznetsova. Captain Tarpishchev explained, that they came to an agreement to switch the two players, so that both can concentrate on their tennis schedule. Likhovtseva was removed from the alternate position. Vera Zvonareva now took participation for the next match in the Luzhniki Stadium. Team Russia defeated the Americans without the Williams sisters, Lindsay Davenport and Ashley Harkleroad, 3–2.\nThe final took place in Madrid against Spain. Safina and Elena Dementieva decided not to participate this time. Ekaterina Makarova made her debut in the doubles dead rubber match with Vesnina. Russia defeated the Spaniards, 4–0. Carla Suárez-Navarro after her loss in the second rubber called Russia the Queen of Tennis.\n2009–2013: Out of top ranking\nThe 2009 Fed Cup season started against Team China. Alisa Kleybanova, who previously defeated the 5th-seeded Ana Ivanovic in the third round of the Australian Open, debuted in this season. Zvonareva decided to skip this match for Pattaya, where she would win the tournament. Dementieva headed the Russian team, the other players being Kuznetsova, Chakvetadze and Kleybanova. Russia crushed the Chinese, 5–0. The last rubber was the only one to be played in three sets.\nIn the semifinals, Russia met Italy. The team was announced on 15 April; it consisted of Zvonareva, Kuznetsova, Petrova and Chakvetadze. Zvonareva could not participate due to ankle injury. Debutants Pavlyuchenkova and Kleybanova were nominated as alternates for Zvonareva, as at most four players could be called. One hour before the draw, the alternate was still not determined, but Kleybanova has been eventually removed. Russia lost four out of five rubbers, with Kuznetsova winning the only rubber. Sports commentator Anna Dmitrieva said, that nominating Chakvetadze was an error. Notwithstanding the loss, Russia stayed in the top rankings for now, but after the Italians defeat of the Americans in the final, they replaced Russia from the throne.\nTeam Russia in the upcoming match of the new season against Serbia was not made up of the leading tennis players Safina, Kuznetsova, Dementieva and Zvonareva, with the last two having injuries. Tarpishchev announced the new team consisting of Kleybanova, Pavlyuchenkova, Dushevina and Makarova. A few days before the start, Kuznetsova jumped in. Team Russia consisting only of Kleybanova and Kuznetsova defeated Serbia in Belgrade, after coming back from 1–2.\nIn April, Russia was to play against the United States. The fact that the match would be played in the United States introduced visa problems for the captain. Pavluychenkova, Zvonareva and Kleybanova could not participate due to injuries. Dementieva and Makarova were ready to play for the team. Due to volcanic dust, the draw was expected to be moved two days later, but the situation has been stabilized. In the deciding doubles rubber, Russia lost to the Americans, 2–3.\n2014–2015: New coaching staff\nThe 2014 season saw a change in the team leadership. Tarpishchev as an IOC member assisted in the upcoming 2014 Winter Olympic Games in Sochi, and so could not continue heading the Russian team. Anastasia Myskina was elected new captain of the Fed Cup team, after alternate Larisa Savchenko's Latvian citizenship became an obstacle.\nThe new squad against Australia was announced on 30 January 2014. Those were Victoria Kan, Irina Khromacheva, Valeria Solovyeva and Veronika Kudermetova. Russia lost in the quarterfinal, 4–0.\nSochi became the hosting city of the play-off game against Argentina. Most of the players of the previous team were replaced by Vesnina and Makarova, only Solovyeva was kept for the doubles rubber. Injured Sharapova and Zvonareva could not compete for Russia. The Russians won 4–0, ensuring them a place in the World Group.\nDefeating Argentina in the play-offs, Russia returned to the World Group in 2015. Team Russia, consisting of Kuznetsova, Sharapova and the doubles team Vitalia Diatchenko and Anastasia Pavlyuchenkova, faced the winner of the Fed Cup World Group Play-off Poland in the first round, and won 4–0. After losing three matches in a row, Poland decided to cancel the singles match, and played the dead rubber between Fed Cup debut Diatchenko and Pavlyuchenkova and doubles specialists Klaudia Jans-Ignacik and Alicja Rosolska.\nRussia's next opponent was Germany, who superseded team Russia in the world ranking after its first round win over Australia. Now Russia competed with Kuznetsova, Pavlyuchenkova and the duo Zvonareva / Vesnina, after Sharapova and Makarova decided not to participate in the semifinals. Sharapova cited her foot injury, and Makarova was too exhausted and unready, according to Makarova's coach Manyukova. Kuznetsova and Pavlyuchenkova won the first two rubbers, but then Germany levelled after winning the other two matches in straight sets. In the deciding doubles match, where Pavlyuchenkova partnered with Vesnina, team Russia overcame the Germans and moved to the finals, which took place in the Czech Republic. There Sharapova won two matches against Kvitová and Plíšková, as against Pavlyuchenkova who lost both of her matches. The deciding doubles match Pavlyuchenkova/Vesnina against Strýcová/Plíšková ended in a three set loss. This is the third time the Russians lost to the Czechs in a Fed Cup final.\n2016–19: Out of World Group\nIn the 2016 season, the Russians consisting of Kuznetsova, Makarova and newcomer Daria Kasatkina lost to the Dutch team, 3–1. Sharapova while being member of the team decided not to play for it. The second rubber game, Kuznetsova against Hogenkamp, became the longest singles match in the history of the Fed Cup, lasting 4 hours and resulting 6–7(4–7), 7–5, 8–10.\nCaptain Myskina after the loss put the youngsters Kasatkina, Gasparyan and Kulichkova forward against Belarus team. Kasatkina won the first rubber against Aliaksandra Sasnovich, but the following three rubbers were lost. Vesnina and Kasatkina, who replaced Kulichkova, won the dead rubber. For the first time since 1999, Russia left the World Group.\nIn the 2017 season, Russia was drawn against Chinese Taipei for the first time in the post-Soviet era (USSR team played against Chinese Taipei in 1985, 3:0). Captain Myskina called Ekaterina Makarova and three Fed Cub debuts Natalia Vikhlyantseva, Anna Blinkova and Anna Kalinskaya. Russia won 4–1. Russia, led by Vesnina, Pavlyuchenkova, Kasatkina and Blinkova, were strong favorites playing at home in Moscow against Belgium in the play-offs as Belgium was without their leading ladies Yanina Wickmayer and Kirsten Flipkens. They however lost 2–3 mainly due to a strong performance from Elise Mertens, the highest ranked Belgian at place 66.\nThe 2018 marked a new low for Russia with their demotion to the Zonal Groups for the first time in two decades, after consecutive losses to Slovakia and Latvia.\nRussia got out of the Europe\\Africa Zone in 2019 season losing only one match following a Pool draw against Poland and Denmark, followed by a play-off with Sweden. Afterwards there came the Group II play-offs, where a victory against Italy returned Russia to the World Group Qualifiers.\n2020–21: fifth title under RTF flag\nIn the rechristened Billie Jean King Cup, Russia entered the qualifying round visiting Romania in Cluj, where Veronika Kudermetova lost her singles matches, but Blinkova, Kalinskaya and Ekaterina Alexandrova helped Russia return to the Finals for the first time since 2016. The COVID-19 pandemic postponed the tournament conclusion to 2021, where the Russian athletes wound up having to compete under the Russian Tennis Federation name and flag due to a December 2020 decision by the Court of Arbitration for Sport (CAS) not allowing the use of the Russian name, flag, or anthem.\nIn a group stage against Canada and France, the Russians won all but one of their matches. A semifinal against the United States had newcomer Liudmila Samsonova beating Sloane Stephens and Pavlyuchenkova losing to Danielle Collins, and then Kudermetova and Samsonovoa won the tiebreaker to return the Russians to the decisive game after 6 years. Against Switzerland, Kasatkina defeated Jil Teichmann, and Samsonova came back from losing the first round to Belinda Bencic to get the Russians their fifth title, the first since 1999.\nSince 2022: Suspension\nAfter the Russian invasion of Ukraine, the International Tennis Federation suspended Russia and Belarus from Billie Jean King Cup competitions.\nResults\n{|class=wikitable style=text-align:center;font-size:80%\n!Tournament!!1968!!1969!!1970!!1971!!1972!!1973!!1974!!1975!!1976!!1977!!1978!!1979!!1980!!1981!!1982!!1983!!1984!!1985!!1986!!1987!!1988!!1989!!1990!!1991!!1992!!1993!!1994!!W–L\n|-\n|colspan=40 align=left|Federation Cup\n|-\n|align=left|World Group\n|bgcolor=ffebcd|QF\n|A\n|A\n|A\n|A\n|A\n|A\n|A\n|bgcolor=afeeee|1R\n|A\n|bgcolor=yellow|SF\n|bgcolor=yellow|SF\n|bgcolor=ffebcd|QF\n|bgcolor=ffebcd|QF\n|bgcolor=ffebcd|QF\n|bgcolor=afeeee|1R\n|bgcolor=afeeee|2R\n|bgcolor=afeeee|1R\n|bgcolor=afeeee|1R\n|bgcolor=afeeee|2R\n|bgcolor=thistle|F\n|bgcolor=ffebcd|QF\n|bgcolor=thistle|F\n|bgcolor=afeeee|2R\n|bgcolor=afeeee|2R\n|A\n|A\n|28–16\n|-\n|align=left|Europe/Africa Zone\n|colspan=24 style=color:#ccc|NH\n|A\n|bgcolor=afeeee|PO\n|bgcolor=yellow|SF\n|4–4\n|-\n|align=left|Consolation rounds\n|style=color:#ccc|NH\n|A\n|A\n|A\n|A\n|A\n|style=color:#ccc|NH\n|A\n|bgcolor=afeeee|1R\n|A\n|style=color:#ccc|NH\n|A\n|A\n|A\n|A\n|bgcolor=lime|W\n|A\n|bgcolor=lime|W\n|bgcolor=thistle|F\n|A\n|A\n|A\n|A\n|A\n|A\n|A\n|style=color:#ccc|NH\n|12–1\n|-\n!style=text-align:left|Win–loss\n!2–1\n!—\n!—\n!—\n!—\n!—\n!—\n!—\n!0–0*\n!—\n!3–1\n!3–1\n!2–1\n!2–1\n!2–1\n!4–1\n!1–1\n!5–1\n!3–2\n!1–1\n!4–1\n!2–1\n!4–1\n!1–1\n!1–1\n!3–2\n!1–2\n!44–21\n|-\n|}\n{|class=wikitable style=text-align:center;font-size:80%\n!Tournament!!1995!!1996!!1997!!1998!!1999!!2000!!2001!!2002!!2003!!2004!!2005!!2006!!2007!!2008!!2009!!2010!!2011!!2012!!2013!!2014!!2015!!2016!!2017!!2018!!2019!!2020–21!!W–L\n|-\n|colspan=40 align=left|Fed Cup\n|-\n|align=left|World Group/Finals\n|A\n|A\n|A\n|A\n|bgcolor=thistle|F\n|bgcolor=afeeee|8th\n|bgcolor=thistle|F\n|bgcolor=afeeee|1R\n|bgcolor=yellow|SF\n|bgcolor=lime|W\n|bgcolor=lime|W\n|bgcolor=afeeee|1R\n|bgcolor=lime|W\n|bgcolor=lime|W\n|bgcolor=yellow|SF\n|bgcolor=yellow|SF\n|bgcolor=thistle|F\n|bgcolor=yellow|SF\n|bgcolor=thistle|F\n|bgcolor=afeeee|1R\n|bgcolor=thistle|F\n|bgcolor=afeeee|1R\n|A\n|A\n|A\n|bgcolor=lime|W\n|40–17\n|-\n|align=left|World Group play-offs/Qualifying Round\n|A\n|A\n|A\n|bgcolor=lime|W\n|A\n|style=color:#ccc|NH\n|bgcolor=lime|W\n|bgcolor=lime|W\n|A\n|A\n|A\n|bgcolor=lime|W\n|A\n|A\n|A\n|A\n|A\n|A\n|A\n|bgcolor=lime|W\n|A\n|bgcolor=thistle|L\n|bgcolor=thistle|L\n|A\n|A\n|bgcolor=lime|W\n|6–2\n|-\n|align=left|World Group II\n|A\n|A\n|A\n|bgcolor=lime|W\n|A\n|colspan=5 rowspan=2 style=color:#ccc|Not Held\n|A\n|A\n|A\n|A\n|A\n|A\n|A\n|A\n|A\n|A\n|A\n|A\n|bgcolor=lime|W\n|bgcolor=thistle|L\n|A\n|A\n|2–1\n|-\n|align=left|World Group II play-offs\n|A\n|A\n|bgcolor=lime|W\n|A\n|A\n|A\n|A\n|A\n|A\n|A\n|A\n|A\n|A\n|A\n|A\n|A\n|A\n|A\n|bgcolor=thistle|L\n|bgcolor=lime|W\n|A\n|2–1\n|-\n|align=left|Europe/Africa Group I\n|bgcolor=yellow|SF\n|bgcolor=thistle|F\n|bgcolor=lime|W\n|A\n|A\n|A\n|A\n|A\n|A\n|A\n|A\n|A\n|A\n|A\n|A\n|A\n|A\n|A\n|A\n|A\n|A\n|A\n|A\n|A\n|bgcolor=lime|W\n|A\n|12–4\n|-\n!style=text-align:left|Win–loss\n!2–2\n!3–2\n!5–0\n!2–0\n!2–1\n!1–2\n!4–1\n!1–1\n!2–1\n!4–0\n!4–0\n!1–1\n!3–0\n!3–0\n!1–1\n!1–1\n!2–1\n!1–1\n!2–1\n!1–1\n!2–1\n!0–2\n!1–1\n!0–2\n!4–0\n!13–4\n!65–27\n|-\n!style=text-align:left|Year End Ranking\n|colspan=7 style=color:#ccc|\n|bgcolor=EEE8AA|5\n|bgcolor=EEE8AA|6\n|bgcolor=thistle|2\n|bgcolor=lime|1\n|bgcolor=lime|1\n|bgcolor=lime|1\n|bgcolor=lime|1\n|bgcolor=thistle|2\n|bgcolor=99CCFF|3\n|bgcolor=99CCFF|3\n|bgcolor=99CCFF|3\n|bgcolor=99CCFF|3\n|bgcolor=99CCFF|3\n|bgcolor=thistle|2\n|bgcolor=EEE8AA|4\n|bgcolor=EEE8AA|8\n|bgcolor=EEE8AA|11\n|\n|\n|\n|}\n* Soviet Union team failed to show up.\nRecords\nLongest winning streak\n{| class=\"wikitable\"\n|-\n! width=\"50\"| Year\n! width=\"225\"| Competition\n! width=\"150\"| Date\n! width=\"175\"| Location\n! width=\"150\"| Opponent\n! width=\"50\"| Score\n! width=\"60\"| Result\n|-\n| align=\"center\" rowspan=\"5\"| 1997\n| Europe/Africa Zone, Group I\n| align=\"center\"| 22 April\n| align=\"center\" rowspan=\"4\"|\n|\n| align=\"center\"| 3–0\n| align=\"center\" bgcolor=\"#98FB98\"| Won\n|-\n| Europe/Africa Zone, Group I\n| align=\"center\"| 23 April\n|\n| align=\"center\"| 2–1\n| align=\"center\" bgcolor=\"#98FB98\"| Won\n|-\n| Europe/Africa Zone, Semifinals\n| align=\"center\"| 25 April\n|\n| align=\"center\"| 2–1\n| align=\"center\" bgcolor=\"#98FB98\"| Won\n|-\n| Europe/Africa Zone, Final\n| align=\"center\"| 26 April\n|\n| align=\"center\"| 3–0\n| align=\"center\" bgcolor=\"#98FB98\"| Won\n|-\n| World Group II Play-off\n| align=\"center\"| 12–13 July\n| align=\"center\"| Seoul (KOR)\n|\n| align=\"center\"| 4–1\n| align=\"center\" bgcolor=\"#98FB98\"| Won\n|-\n| align=\"center\" rowspan=\"2\"| 1998\n| World Group II\n| align=\"center\"| 18–19 April\n| align=\"center\"| Perth (AUS)\n|\n| align=\"center\"| 3–2\n| align=\"center\" bgcolor=\"#98FB98\"| Won\n|-\n| World Group Play-off\n| align=\"center\"| 25–26 July\n| align=\"center\" rowspan=\"3\"| Moscow (RUS)\n|\n| align=\"center\"| 4–1\n| align=\"center\" bgcolor=\"#98FB98\"| Won\n|-\n| align=\"center\" rowspan=\"3\"| 1999\n| World Group, First Round\n| align=\"center\"|\n|\n| align=\"center\"| 3–2\n| align=\"center\" bgcolor=\"#98FB98\"| Won\n|-\n| World Group, Semifinals\n| align=\"center\"|\n|\n| align=\"center\"| 3–2\n| align=\"center\" bgcolor=\"#98FB98\"| Won\n|-\n| World Group, Final\n| align=\"center\"|\n| align=\"center\"| Stanford (United States)\n|\n| align=\"center\"| 1–4\n| align=\"center\" bgcolor=\"#FFA07A\"| Lost\n|}\nFinals: 12 (5 titles, 7 runners-up)\n{|class=\"sortable wikitable\" style=font-size:97%;background:#EBC2AF\n!Outcome\n!Year\n!width=300|Venue\n!Surface\n!width=130|Team\n!width=100|Opponents\n!width=140|Opposing Team\n!width=30|Score\n|-bgcolor=FFFFCC\n|bgcolor=FFA07A|Runner-up||1988||Flinders Park, Melbourne, Australia||?||Larisa SavchenkoNatalia Zvereva||||Jana NovotnáJana PospíšilováRadka ZrubákováHelena Suková||1–2\n|-bgcolor=FFFFCC\n|bgcolor=FFA07A|Runner-up||1990||Peachtree W.O.T., Atlanta, United States||Hard||Elena BrioukhovetsNatasha ZverevaLarisa SavchenkoLeila Meskhi||||Jennifer CapriatiZina GarrisonGigi FernándezPatty Fendick||1–2\n|-bgcolor=FFFFCC\n|bgcolor=FFA07A|Runner-up||1999||Taube Tennis Stadium, Stanford, United States||Hard||Elena MakarovaElena LikhovtsevaElena Dementieva||||Lindsay DavenportVenus WilliamsSerena WilliamsMonica Seles||1–4\n|-\n|bgcolor=FFA07A|Runner-up||2001||Parque Ferial Juan Carlos 1, Madrid, Spain||Clay (i)||Elena LikhovtsevaElena BovinaElena DementievaNadia Petrova||||Laurence CourtoisEls CallensJustine HeninKim Clijsters||1–2\n|-bgcolor=FFFFCC\n|bgcolor=98FB98|Winner||2004||Ice Stadium Krylatskoe, Moscow, Russia||Carpet (i)||Anastasia MyskinaVera ZvonarevaSvetlana KuznetsovaElena Likhovtseva||||Nathalie DechyTatiana GolovinÉmilie LoitMarion Bartoli||3–2\n|-\n|bgcolor=98FB98|Winner||2005||Court Philippe Chatrier, Paris, France||Clay||Elena DementievaAnastasia MyskinaDinara SafinaVera Dushevina||||Amélie MauresmoMary PierceNathalie DechyTatiana Golovin||3–2\n|-bgcolor=FFFFCC\n|bgcolor=98FB98|Winner||2007||Luzhniki Palace of Sports, Moscow, Russia||Hard (i)||Svetlana KuznetsovaAnna ChakvetadzeNadia PetrovaElena Vesnina||||Francesca SchiavoneMara SantangeloRoberta VinciFlavia Pennetta||4–0\n|-\n|bgcolor=98FB98|Winner||2008||Club de Campo Villa de Madrid, Madrid, Spain||Clay||Svetlana KuznetsovaVera ZvonarevaElena VesninaEkaterina Makarova||||Anabel Medina GarriguesCarla Suárez NavarroNuria Llagostera VivesVirginia Ruano Pascual||4–0\n|-bgcolor=FFFFCC\n|bgcolor=FFA07A|Runner-up||2011||Olympic Stadium, Moscow, Russia||Hard (i)||Anastasia PavlyuchenkovaSvetlana KuznetsovaMaria KirilenkoElena Vesnina||||Petra KvitováLucie ŠafářováLucie HradeckáKvěta Peschke||2–3\n|-\n|bgcolor=FFA07A|Runner-up||2013||Tennis Club Cagliari, Cagliari, Italy||Red clay||Alexandra PanovaAlisa KleybanovaIrina KhromachevaMargarita Gasparyan||||Sara ErraniRoberta VinciFlavia PennettaKarin Knapp||0–4\n|-bgcolor=FFFFCC\n|bgcolor=FFA07A|Runner-up||2015||O2 Arena, Prague, Czech Republic||Hard (i)||Maria SharapovaAnastasia PavlyuchenkovaElena Vesnina||||Petra KvitováKarolína PlíškováBarbora Strýcová||2–3\n|-\n|bgcolor=98FB98|Winner||2020–21||O2 Arena, Prague, Czech Republic||Hard (i)||Anastasia PavlyuchenkovaDaria KasatkinaVeronika KudermetovaEkaterina AlexandrovaLiudmila Samsonova||||Jil TeichmannBelinda BencicViktorija GolubicStefanie Vögele||2–0\n|}\nAwards\n*The Russian Cup in the nomination Team of the Year (2004, 2005, 2007, 2008, 2015)\nSee also\n*\nReferences\nExternal links\n*"
    }
  ]
}