{
  "content": [
    {
      "type": "text",
      "text": "# Ruth Hayward\n\n| birth_place = Chula Vista, California, U.S.\n| occupation = Engineer, sculptor, photographer, philanthropist\n}}\nRuth Hayward (born July 29, 1934), is an engineer, sculptor, and philanthropist. She is also known for her sculptures of public figures in San Diego. A lifelong resident of San Diego, in 1987 she was honored with a Tribute to Women & Industry (TWIN) award by the YWCA for her work as an engineer at General Dynamics/Electronics and as a volunteer at Rachel's Women's Center for the homeless.\nEngineer\nHayward became an engineer in the 1960s while working for General Dynamics. At that time, very few women entered the field. During her 38 years at General Dynamics she was involved in a project that located radio emitters to aid in pinpointing enemy locations. The high point of her career involved work on underground detection of explosives, work that probably saved hundreds of lives.\nArtist\nAfter retiring from General Dynamics Hayward studied sculpture with T.J. Dixon, specializing in the human form. The accuracy of her work reflects her engineering skills, and her love of photography and the human form.\nFour of her life-sized bronze works of influential San Diegans are displayed in San Diego's Balboa Park.  \"Founders' Plaza\" in the park contains her full size sculptures of George Marston 1946), known as San Diego's first citizen, Ephraim Weed Morse (1823–1906), and Alonzo Horton (1813–1909), \"Father of San Diego\". Hayward's sculpture of the \"Mother of San Diego,\" botanist, horticulturist and landscape architect Kate Sessions, stands separately. Other public sculptures in San Diego by Hayward include a bust of Ellen Browning-Scripps at Scripps Green Hospital, a bust of Lily Tomlin at Rachel's Women's Center in downtown San Diego, a bronze bust at the Timken Gallery, Balboa Park of its Founding Director Walter Ames, and a bust of Margaret Sellers, at the U.S. Postal Service's Margaret L. Sellers Processing and Distribution Center, on Rancho Carmel Road. Privately held works include a bas-relief of the San Diego Opera's resident conductor, Karen Keltner, and a life-size sculpture of physician Barbara Levy of Seattle.\nHayward's wildlife and nature photographs have been used by the San Diego River Conservancy and other local organizations. She has traveled to all seven continents and takes photographs wherever she goes.\nRuth Hayward was honored by the La Jolla Historical Society on September 15, 2011, for her work as an artist, and for the donation of her bust of Ellen Browning Scripps. [http://www.lajollalight.com/2011/09/21/la-jolla-historical-society-says-thank-you-to-sculptor-ruth-hayward/].\nThe San Diego Museum of Art Artists Guild acknowledged Hayward's art by choosing her as one of 100 extraordinary San Diego artists in its Centennial Project.  Her work was part of an exhibit at the Oceanside Museum of Art entitled \"100 Artists 100 Years\" April 18 – July 26, 2015.,\nPhilanthropy and charity work\nHayward supports San Diego charities, including City Beautiful of San Diego, the San Diego River Park Foundation and the San Diego Opera. She has twenty years of service on the board of Rachael's Women's Center, a women's homeless shelter, of which she was a founding member. She is the past president of Project Wildlife, a San Diego group which rehabilitates injured mammals and birds.\nReferences"
    }
  ]
}