{
  "content": [
    {
      "type": "text",
      "text": "# Rutherford B. Hayes Presidential Center\n\n| inauguration_date = Dedicated on 1916\n| namesake = Rutherford B. Hayes\n| construction_start_date = 1912\n| completion_date =\n| cost =\n| size =\n| management = Hayes Presidential Center, Inc.\n| architect =\n| website =\n}}\nThe Rutherford B. Hayes Presidential Center is a complex comprising several buildings related to the life and presidency of Rutherford B. Hayes. It is one of the first presidential libraries, built in 1916.\nHistory\nLocated in Fremont, Ohio, the Rutherford B. Hayes Presidential Center comprises the Rutherford B. Hayes Museum and Library and Spiegel Grove, an estate encompassing the Hayes home, residence to several generations of the Hayes family. Opened in 1916, the Rutherford B. Hayes Center Library was one of the first presidential libraries.  The center is supported by the private foundations, the Ohio Historical Society and Hayes Presidential Center Inc.\nThe library holds the 12,000 volume personal library of Rutherford B. Hayes, as well as materials relating to his military and political career, particularly of his presidency from 1877 to 1881. It also contains 70,000 volumes plus newspapers and journals from the time of the Civil War to the eve of World War I.\nThe library was built by the state of Ohio in 1916, and was expanded in 1922 and in 1968. As of 2020, two descendants of President Hayes were serving on the board of trustees.\nFocus\nThe library has continued its special interest in Rutherford B. Hayes and concentrates on the history of the U.S. from 1850 to 1917, especially the Civil War, Reconstruction, the Spanish–American War, railroad, education, black history and Indian/government relations. Second, the history of Ohio and the Sandusky River Valley and the Northwest are of interest. There is a large genealogical collection. The library contains history books on nearly every county of Ohio, but also on counties of many other states of the United States\nSee also\n* Presidential memorials in the United States\nReferences\nExternal links\n* [https://www.rbhayes.org/ Rutherford B. Hayes Presidential Center]\n* [http://hanbanphotos.com/rutherford-b-hayes-presidential-center-photo-gallery/ Rutherford B. Hayes Presidential Center Photo Gallery]\n*[http://www.c-span.org/video/?150637-1/life-portrait-rutherford-b-hayes \"Life Portrait of Rutherford B. Hayes\"], from C-SPAN's American Presidents: Life Portraits, broadcast from the Rutherford B. Hayes Presidential Center, July 19, 1999"
    }
  ]
}