{
  "content": [
    {
      "type": "text",
      "text": "# Ruzhin (Hasidic dynasty)\n\nRuzhin (or Rizhin) is the name of a Hasidic dynasty founded by Rabbi Yisroel Friedman (1796&ndash;1850) in the town of Ruzhyn, Ukraine, today an urban-type settlement in Zhytomyr Oblast, Ukraine.\nFriedman was the first and only Ruzhiner Rebbe. However, his sons and grandsons founded their own dynasties which are collectively known as the \"House of Ruzhin\". These dynasties, which follow many of the traditions of the Ruzhiner Rebbe, are Bohush, Boyan, Chortkov, Husiatyn, Sadigura, and Shtefanesht. The dynasties of Vizhnitz and Vasloi are related to the Ruzhiner Rebbe through his daughters.\nHistory\nRabbi Yisroel Friedman was a direct descendant through the male line of Rabbi Dov Ber, the Maggid of Mezritch (1704-1772), the main disciple of the Baal Shem Tov. Friedman's father, Rabbi Sholom Shachne of Prohobisht (1769-1802), died when he was six years old. His older brother, Avrohom (1787&ndash;1812), became Rebbe of their father's Hasidim upon their father's death. When Rabbi Avrohom died without issue in 1812, Rabbi Yisroel became Rebbe first in Skvyra and then in Ruzhyn, where he attracted thousands of followers.\nThe Ruzhiner Rebbe set a regal tone for his court, living in a palatial home with splendid furnishings; riding in a silver-handled carriage drawn by four white horses; being accompanied by an entourage of attendants; and wearing a golden yarmulke and stylish clothing with solid-gold buttons. In addition to his thousands of Hasidim, he wielded significant influence in Southwestern Russian Empire and Volhynia through the marriages of his six sons and four daughters, who married into other Hasidic rabbinical courts as well as wealthy banking families.\nThe Rebbe's extravagant lifestyle and prestige aroused the suspicion of Tsar Nicholas I and the ire of the Jewish maskilim (members of the Jewish Enlightenment movement); the latter continually plotted to bring about the Rebbe's downfall. In 1838, at the height of a two-year investigation of the murder of two Jewish informers, the Rebbe was accused of complicity in the murders and jailed by the Tsar. He was released after 22 months and put under police surveillance, since the Tsar still believed he was fomenting opposition to the government. The Rebbe fled to Austria, which granted him citizenship and protection from extradition.\nThe Tiferes Yisrael Synagogue in [[Jerusalem was named after the Ruzhiner Rebbe, who instigated its construction.]]\nThe Rebbe re-established his court in Sadigura, Bukovina, Austria (Carpathian Mountains), where he built another palatial home and synagogue and drew thousands of followers from throughout Galicia, Russian Empire and Romania. All the Jews in Sadigura became Ruzhiner Hasidim. He was also active in Israel as president of Kollel Vohlin, raising and distributing the money to support the Hasidic community in the Land of Israel, and initiated the construction of Tiferet Yisrael Synagogue in the Old City of Jerusalem, which was completed by his son, Rabbi Avrohom Yaakov Friedman, in 1872.\nThe Rebbe spent his last decade in Sadigura, where he died at the age of 54 on 9 October 1850. His gravesite in Sadigura, which eventually became the burial place of two of his sons, Avraham Yaakov of Sadigura and Dov Ber of Leova, and other family members, became a shrine for Ruzhiner Hasidim. His gravestone was destroyed during World War I and afterwards replaced by a large white concrete slab.\nThe Ruzhiner Rebbe's eldest son, Rabbi Sholom Yosef Friedman (1813&ndash;1851), led his father's Hasidim until his untimely death less than a year later. The Ruzhiner's second son, Rabbi Avrohom Yaakov Friedman (1820&ndash;1883) then became the first Sadigura Rebbe and the other sons founded their own Hasidic courts in other locales.\nRuzhin traditions\nTo this day, the Rebbes of the House of Ruzhin conduct their courts regally, claiming descent from the royal lineage of King David. Among the traditions practiced by Rebbes of the House of Ruzhin are:\n*Spending most of their day apart from their Hasidim, praying and learning in a room attached to the main beis medrash, called the daven shtiebel (prayer room).\n*Conducting their tish with calmness and self-discipline. (The second Husiatyner Rebbe, Rabbi Yisroel Friedman, reportedly conducted his tish in total silence)\n*Treating mealtimes as a devotion similar to prayer. Ruzhiner Rebbes meditate during their meals, do not eat much meat, and liberally salt their food in remembrance of the salt offered with the Temple sacrifices.\nLineage\n* Rebbe Dov Ber of Rovne and Mezritsh, Volhynia (1704–1772)\n** Rebbe Avrohom \"HaMalach\" (1740–1777), son of Rebbe Dov Ber\n*** Rebbe Sholom Shachna of Prhobisht (1769-1802), son of Rebbe Avrohom\n**** Rebbe Avrohom Friedman of Prhobisht (1787–1813), son of Rebbe Sholom Shachna\n**** Rebbe Yisroel Friedman of Ruzhyn (1796–1850), son of Rebbe Sholom Shachna, first Ruzhiner Rebbe\n***** Rebbe Sholom Yosef Friedman of Sadiger (1813–1851), son and successor to Rebbe Yisroel\n****** Rabbi Yitzchok Friedman of Bohush, son of Rebbe Sholom Yosef, first Bohusher Rebbe\n***** Rebbe Avrohom Yaakov Friedman of Sadiger (1820-1883), son of Rebbe Yisroel, first Sadigerer Rebbe\n****** Rebbe Yitzchok Friedman of Boyan (1850–1917), son of Rebbe Avrohom Yaakov Friedman, first Boyaner Rebbe\n****** Rebbe Yisroel Friedman of Sadiger (1852–1907), son of Rebbe Avrohom Yaakov Friedman, second Sadigerer Rebbe\n***** Menachem Nochum Friedman of Shtefanesht (1823–1868), son of the Ruzhiner Rebbe, first Shtefaneshter Rebbe\n***** Rebbe Dovid Moshe Friedman of Chortkov (1827–1903), son of R' Yisroel Friedman of Ruzhyn, first Chortkover Rebbe\n***** Rebbe Mordechai Shraga Feivish Friedman of Husiatyn (1835–1894), first Rebbe of Husiatyn\nReferences"
    }
  ]
}