{
  "content": [
    {
      "type": "text",
      "text": "# Ryan Warsofsky\n\n| birth_place = Marshfield, Massachusetts, U.S.\n| height_ft = 5\n| height_in = 9\n| weight_lb = 185\n| position = Defense\n| shoots = Left\n| played_for = White Caps TurnhoutRio Grande Valley Killer BeesCape Cod Bluefins\n| league_coach = NHL\n| team_coach = San Jose Sharks\n| draft = Undrafted\n| career_start = 2011\n| career_end = 2012\n| career_start_coach = 2012\n| career_end_coach =\n}}\nRyan Warsofsky (born October 26, 1987) is an American professional ice hockey coach and former player who is the head coach for the San Jose Sharks of the National Hockey League (NHL). Following a brief playing career, he entered coaching in 2012. He has previously served as a coach with the Curry Colonels, South Carolina Stingrays, Charlotte Checkers and Chicago Wolves.\nEarly life\nWarsofsky was born in Marshfield, Massachusetts, to Dawn and Mark Warsofsky, and is Jewish. He is the older brother of defenseman David Warsofsky, who has played in the NHL for the Boston Bruins, Colorado Avalanche, New Jersey Devils, and Pittsburgh Penguins. Warsofsky and his wife have one child.\nPlaying career\nWarsofsky played ice hockey as a defenseman at Marshfield High School in Massachusetts, where he was team captain and was named All-Scholastic by The Patriot Ledger. After four years at Marshfield, he transferred and attended Cushing Academy, in Ashburnham, Massachusetts, for one year. He then played for Sacred Heart University in Connecticut for two seasons, playing 20 games with one goal and an assist in the 2008–09 season and then recording two assists in seven games in the 2009–10 season.\nWarsofsky transferred to Curry College and played two seasons for the Curry Colonels, scoring 16 points in his first season. In his second year, he played 27 games and recorded a team-leading 27 points, with nine goals and 18 assists. He was the team's assistant captain as a senior and was chosen the school's Male Athlete of the Year, first-team All-ECAC Northeast and to the Division II/III All-Start Team by the New England Hockey Writers Association. He graduated with a degree in management in 2011.\nWarsofsky played one season professionally, splitting the 2011–12 season with the Belgian White Caps Turnhout of the North Sea Cup, the Rio Grande Valley Killer Bees of the Central Hockey League (CHL) and the Cape Cod Bluefins of the Federal Hockey League (FHL). He appeared in 14 games for the White Caps, recording six goals and eight assists for 14 points, three games for the Killer Bees, and one game for the Bluefins. After the season, he decided to enter coaching.\nCoaching career\nWarsofsky began his coaching career at his alma mater, Curry, serving as assistant coach for the 2012–13 season. He then joined the South Carolina Stingrays of the ECHL in 2013, being named assistant coach and manager of hockey operations. Working with the defense and special teams, he helped the Stingrays have some of their most successful seasons in the ECHL, including a league-record 23-consecutive wins with a Kelly Cup appearance in the 2014–15 season. He was promoted to head coach and director of hockey operations in 2016, becoming, at age 28, the youngest active coach in the ECHL and the fifth-youngest in history. He served two years in the position and led them to the Kelly Cup Finals in the 2016–17 season, while compiling an overall record of 88–44–10–2 with the Stingrays. He was the second-youngest coach ever to lead his team to the Kelly Cup.\nIn 2018, Warsofsky became an assistant coach for the Charlotte Checkers of the American Hockey League (AHL). In his first season, he helped the team's defense place second in the AHL in goals allowed per game while winning the Calder Cup in 2019. The following year, he was announced as the new head coach to succeed Mike Vellucci, becoming the youngest AHL head coach since Bill Armstrong in 2000 as well as the youngest in Checkers history. As head coach in the 2019–20 season, he led them to a record of 34–22–5–0, while the Checkers were top three in the AHL for both power-play and penalty kill percentage.\nFollowing his single season as head coach of the Checkers, Warsofsky became the head coach for the AHL's Chicago Wolves. He led the team to a 21–9–1–2 record, third-best in the league, in the 2020–21 season, before the playoffs were canceled due to the COVID-19 pandemic. The Wolves then had a league-best 50–16–5–5 record in 2021–22 and won the Calder Cup.\nIn 2022, Warsofsky became an assistant coach for the San Jose Sharks of the National Hockey League (NHL). He worked with the defense and penalty kill, helping defenseman Erik Karlsson win the James Norris Memorial Trophy in the 2022–23 season. Across two years with Warsofsky as assistant coach, the Sharks ranked 18th in the NHL in penalty kill.\nOn June 13, 2024, he was promoted as Sharks' head coach, becoming the youngest in the NHL at 36 years. He also became the first Jewish NHL head coach since Bob Plager coached the St. Louis Blues in the 1992–93 season. After the end of the Sharks' season, Warsofsky was named as the head coach of the United States for the 2025 IIHF World Championship. The US won the tournament after defeating Switzerland 1-0 in overtime in the gold medal game, giving Warsofsky his first international honor as a coach.\nHead coaching record\n{| class=\"wikitable\" style=\"font-size: 95%; text-align:center;\"\n|-\n! rowspan=\"2\"|Team !! rowspan=\"2\"|Year !! colspan=\"6\"|Regular season !! colspan=\"4\"|Postseason\n|-\n! G !! W !! L !! OTL !! Pts !! Finish !! W !! L !! Win % !! Result\n|-\n! SJS !! 2024–25\n| 82 || 20 || 50 || 12 || 52 || 8th in Pacific || — || — || — || Missed playoffs\n|-\n! colspan=\"2\"|Total !! 82 !! 20 !! 50 !! 12 !! &nbsp; !! &nbsp; !! — !! — !! — !! &nbsp;\n|}\nSee also\n* List of select Jewish ice hockey players\nReferences\nExternal links\n*"
    }
  ]
}