{
  "content": [
    {
      "type": "text",
      "text": "# Ryland King\n\n}}\n| birth_place        = Pacifica, California, U.S.\n| image              =\n| nationality        =\n| known_for          = Sprout Up, non-profit\n| occupation         = Founder, executive director\n}}\nRyland King (born February 15, 1990) is the founder and executive director of Sprout Up, a 501(c)(3) non-profit organization with the mission to bring supplementary youth-to-youth environmental education programs to the public school system completely free of charge, building more sustainable communities from the youngest members of society up.\nBackground\nKing was born in Pacifica, California, and currently resides in Goleta, California, which is home to the Sprout Up headquarters. In the summer of 2009, King worked as a camp Instructor at Surf Camp Pacifica. During the following academic school year, King became involved with an environmental club on campus. He combined his passions for the outdoors with the recognition of a need for progression in environmental sustainability, which fueled the idea behind his non-profit organization.\nKing graduated from the University of California, Santa Barbara in 2012 with a degree in environmental studies and professional writing.\nCareer\nSprout Up\nKing attributes the beginning of Sprout Up, founded in 2009, to not one, but two big \"thank you's.\" The first came from two parents, who were astonished to see their developmentally disabled son overcome his fear of waves at a summer surf camp because of King. The second unforgettable \"thank you\" came from an inspired 2nd grade girl, for whom the highlight of each school week was King's science lesson, especially when she got to \"dance\" like a bumblebee or nurture her own seed to grow tall and strong.\nOver the past four years, Sprout Up, formerly known as Environmental Education for the Next Generation (EENG), has expanded from 25 college students at UCSB in five different classrooms, to five other chapters: San Luis Obispo, Santa Cruz, San Francisco, New York City,  and Davis.\nThe curriculum aligns closely with the California Department of Education's content standards  and uses a system of teaching called \"flow learning\" which engages the four types of 4MAT system learners. Lessons cover topics like water conservation, habitats, seed cultivation, ecosystems, sustainability, composting, and soil science, covering a broad range of environmental issues.\nKing received $100,000 in 2011 for his work  and was in the running to receive $1,000,000  in December, 2012. Yet, he still prides himself in his favorite activities—surfing, hiking, and teaching.\nSurf Trip List\nIn 2018, King founded Surf Trip List, a non-profit involving surfing camp memberships.\nStackbit\nKing is the \"Chief\" at Stackbit, a tech company, which was acquired by Netlify in 2023.\nAwards in relation to King's involvement with Sprout Up\n2013\n*[https://web.archive.org/web/20130112063853/http://www.nbc.com/americangivingawards/ Chase Community Giving Awards Finalist]\n2012\n*[https://web.archive.org/web/20130112063853/http://www.nbc.com/americangivingawards/ Chase Community Giving Awards] ($20,000)\n*[http://www.wildandscenicfilmfestival.org/brower-youth-awards-ryland-king/ Brower Youth Award] ($3,000)\n*[http://www.dosomething.org/blog/meet-do-something-awards-semi-finalist-ryland-king VH1’s Do Something Finalist]\n2011\n*Dockers Wear the Pants Contest Grant ($100,000)\n:Chosen from a nation-wide pool of over 3,300 entries to live your life’s passion.\n*[https://web.archive.org/web/20121022030907/http://www.levistrauss.com/blogs/changing-world-one-student-time Donald A. Strauss Scholarship Award] ($10,000)\n:Awarded to 12 California college students to undertake a high-impact, sustainable, social change project in their senior year.\n*[http://cab.as.ucsb.edu/funding/cab-foundation/ Community Affairs Board Foundation Grant] ($10,000)\n*Williams Corrbett Foundation Award ($10,000)\n2010\n*[http://www.fundforsantabarbara.org/youth.php The Fund for Santa Barbara’s Youth Making Change Grant] ($2,300)\n*[http://www.as.ucsb.edu/about-us/awards/ UCSB Associated Students 2010 Project of the Year]\n*[http://es.ucsb.edu/about/awards#TomRogers Tom Roger’s Scholarship Award] ($5,000)\n:For a project that embodies the ideals of civic responsibility and environmental stewardship.\n*Yolanda Garcia Scholarship Award ($1,000)\n:Awarded for outstanding community service and social justice.\nReferences"
    }
  ]
}