{
  "content": [
    {
      "type": "text",
      "text": "# Ryukyuan culture\n\nRyukyuan culture () are the cultural elements of the indigenous Ryukyuan people, an ethnic group native to Okinawa Prefecture and parts of Kagoshima Prefecture in southwestern Japan.\nThe cultural elements of the Ryukyuans are far from a unified entity, with different islands having their own distinct subculture and practices. Furthermore, the inhabitants of the Tokara and Ōsumi Islands are of Yamato Japanese descent, akin to the inhabitants of mainland Japan.\nMusic\nThere are many styles of music exclusive to the Ryukyu Islands. The most popular one is arguably the genre of eisa from the Okinawa Islands. It typically incorporates dancing, taiko drums and the three-stringed sanshin (Okinawan shamisen). In the Amami Islands of Kagoshima, a musical style known as shima-uta has gained recent popularity in mainland Japan as a result of its usage by contemporary singers.\nBesides eisa and shima-uta, there are many more traditional styles of Ryukyuan music, many of which cannot be found in mainland Japan. The musical culture also differs heavily between each island group. For example, eisa is not popularized in most of the Amami Islands (with the exception of Yoron and Okinoerabu). The Amami Islands also have their own version of the Okinawan sanshin, differing in both material and sound.\nToday, traditional Ryukyuan music still maintains a heavy presence in the Nansei Islands. New genres have also been created by mixing folk music with modern instruments and techniques.\nLanguages\nTraditionally, the Ryukyuan people spoke the Ryukyuan languages, a sub-branch of the Japonic language family. Conservatively, there are six Ryukyuan varieties in total: the Okinawan, Kunigami, Miyakoan, Yaeyama, Yonaguni and Amami languages. They are not mutually intelligible with Japanese, nor with each other for the most part.\nOrigins\nWhen the Yayoi people migrated to the Japanese archipelago from Korea, they likely brought over the Proto-Japonic language. Between the 2nd and 9th centuries, Japonic speakers inhabited the Ryukyu Islands. While the exact time frame is unknown, the Proto-Japonic language split into Old Japanese and Proto-Ryukyuan during the first millennium AD. There are two theories regarding the origins of Proto-Ryukyuan:\n# Proto-Ryukyuan was already diverging as a distinct entity from Proto-Japonic even before its speakers arrived in the Ryukyu Islands.\n# Proto-Ryukyuan diverged from Proto-Japonic after Yayoi migrants arrived in the Ryukyu Islands.\nRegardless of theory, the speech of the Ryukyuans continued to develop separately from that of the Japanese mainland.\nUsage\nWhen the Ryukyu Kingdom was an independent nation, the Ryukyuan languages were widely spoken among its people. However, after the Ryūkyū Disposition occurred in the 1870s, the kingdom was annexed into the Empire of Japan. From there, the Ryukyuan languages saw a steady decline as a result of assimilation policies. These policies were often aggressive, with dialect cards (方言札, hōgen-fuda) being issued to students who spoke Ryukyuan rather than Standard Japanese. During World War II, the discrimination against the Ryukyuan languages heightened. Thousands of Okinawan speakers were killed for \"spying\", as the Japanese soldiers were unable to understand them and thus were suspicious.\nThe Ryukyuan languages continued to decline even after the Battle of Okinawa and into the American occupation period. Today, Ryukyuan languages mainly persist among elderly inhabitants, with the majority of younger Ryukyuans being monolingual in Japanese. As a result of language mixing between Standard Japanese and a Ryukyuan substrate, new varieties of Japanese have arisen in the Ryukyu Islands. In Okinawa, this is known as Uchinaa-Yamatoguchi (Okinawan Japanese). In Amami Ōshima, it's called Ton-futsūgo (Amami Japanese).\nIn 2009, UNESCO included the Ryukyuan languages in its atlas. The Yaeyama and Yonaguni languages are classified as \"severely endangered\", whereas the other 4 Ryukyuan varieties are \"definitely endangered\".\nCuisine\nThe cuisine of the Ryukyu Islands are a diverse collection of regional foods, and have been influenced by other cuisines as a result of trade during the time of the Ryukyu Kingdom. There have also been recent additions to local Ryukyuan cuisine as a result of American military presence. Popular dishes include goya champuru, rafute and taco rice. In the Amami Islands, a chicken-based soup known as keihan rice is popular throughout Kagoshima Prefecture. The historical staple food of the Ryukyu Islands was the sweet potato.\nReligion\nThe traditional beliefs of the Ryukyu Islands are known as the Ryukyuan religion, an animistic faith with influences from Shinto, Buddhism and other eastern religions. Practices are mainly centered around deity and ancestor worship, with different rituals being performed. These rituals are generally performed by women, as they are believed to be spiritually stronger than men. This can be reflected in the hierarchy of the Ryukyu Kingdom, where priestesses held considerable power.\nIn the Ryukyuan religion, it's said that the Ryukyu Islands were formed by creation goddess Amamikyu, who bore three children. The first son became the king, the first daughter became the head priestess and the third child became the first farmer. These 3 children are said to be the ancestors of the Ryukyuan people. In addition to Amamikyu, there are many other gods for specific actions or objects.\nMuch like Shinto in mainland Japan, Ryukyuan beliefs still maintain a ceremonial presence in the region.\nFestivals and observances\nArchitecture\nPottery\nSee also\n* Ryukyu Islands\n* Ryukyuan people\n* Culture of Japan\n* Chinese culture\nReferences"
    }
  ]
}