{
  "content": [
    {
      "type": "text",
      "text": "# Ryukyuan lacquerware\n\nRyukyuan lacquerware is one of the chief artistic products of the Ryukyu Islands (today Okinawa Prefecture of Japan), and represents a form and style of lacquerware which is distinct from that of the surrounding cultures. Though distinct in its own ways, it is strongly influenced by Chinese, Japanese, and Southeast Asian modes.\nRyukyuan lacquerware is distinguished by the use of inlaid seashells and various native Ryukyuan artistic motifs, and a strong tendency towards red lacquer, which is rather less common in the rest of Japan.\nHistory\nAs the lacquer tree is not native to Okinawa, the key material needed to produce lacquerware could only be obtained by the Ryukyuans through trade. Though the islands were involved with trade with Japan and the Asian mainland for many centuries, it is generally believed that the presence and production of lacquerware in Ryukyu only began to any significant extent in the late 14th or early 15th centuries.\nAn office to supervise lacquerware craftsmen was established as  . According to \"\", or the Official Chorography of Ryūkyū published in 1713, it was during the 17th century that Kaizuribugyōsho focused on introducing technology from China and Satsuma. Since 1686 entries of lacquer trees cultivation as well as harvest of lacquer juice was recorded in , with evidence on mairi tsukawashijō. Thus the Ryūkyū government managed and encouraged lacquerware production from lacquer juice harvest It was during the 1800s when Kaizuri Bugyōsho supervised export of Ryukyuan lacquerware with tsuishu suikin techniques.\nFormal tributary relations with China began in 1372, and in 1427, the Xuande Emperor famously bestowed upon Hashi, King of Ryukyu, the honorary family name Shō (Shang), along with a lacquer tablet inscribed with the characters for Chūzan, and a number of other lavish gifts, including lacquerwares and formal court robes. This famous lacquer tablet was installed over the entrance to Shuri Castle, where it remained until the mid-20th century.\nRyukyu enjoyed a booming trade with Southeast Asia and Korea, and traded many goods from these countries with China, either as tributary gifts or as regular trade goods. Beginning in 1609, when Ryukyu was invaded by Japan's Satsuma Domain, its trade with Southeast Asia and Korea all but came to an end, replaced by commerce with Satsuma. For roughly five hundred years, from 1372 until the mid-19th century, a small number of Ryukyuans resided in Fuzhou and Beijing at any given time, studying academic classics and various arts as well. The community of scholars in Kumemura, on Okinawa, also included a number of skilled artists and craftsmen. Thus, given the changes in Ryukyu's relationships with foreign countries over its history, it is easy to see why Ryukyuan lacquer prior to the 17th century shows strong Chinese, Korean and Southeast Asian influences, while objects produced after the Japanese invasion evidence far stronger Japanese influences.\nDevelopments of the 1860s–70s, chiefly results of the Meiji Restoration, brought the end of the feudal system, and of tributary relations to both China and Satsuma. Thus, the state monopoly on foreign trade similarly came to an end, and regular Japanese citizens were given the opportunity to purchase Ryukyuan lacquers for the first time. A national industrial promotion exposition in Tokyo in 1881 provided, for many people, their first exposure to Ryukyuan arts.\nFollowing World War II and the extensive destruction incurred in the islands during the battle of Okinawa, a number of surveys have been undertaken to learn more about Ryukyuan lacquer (and a great many other cultural and historical subjects), and to discover and collect objects displaced during and following that struggle.\nMotifs and style\nCabinet with red lacquer, mother-of-pearl inlay. Ryukyu Islands (18th century)\nRyukyuan lacquer, like lacquerwares from other parts of East and Southeast Asia, comes in a number of standard categories: painted lacquer, carved, incised and filled in with gold, painted with gold, and inlaid with mother-of-pearl. The use of mother-of-pearl in particular is a common feature of Ryukyuan lacquers, as is the use of particular shades of red, especially as a background. However, it is generally said that the primary distinguishing feature of Ryukyuan lacquers is simply that they \"appear to be neither purely Chinese on the one hand nor purely Japanese on the other.\"\nThe distinctive red color often seen in Ryukyuan lacquer is of a \"deeper, more vibrant tone than that from China or ... Japan\".  It is obtained by mixing raw lacquer with red pigment in roughly equal amounts, a mixture which turns blood-red in the sunlight.\nThough the styles and techniques of producing lacquerware were originally introduced to Ryukyu by China, native motifs gradually came to be incorporated into the islands' lacquerwares. Mother-of-pearl inlay is similarly not originally a Ryukyuan element, but it came to be used to depict papaya, plantain, palm trees, tomoe, and other motifs of the sub-tropical islands. Other designs, such as images of hibiscus and coral, were introduced in the latter half of the 20th century as part of the artificial cultural production of tourism goods. Traditionally, the use of yellow, green, and other colored lacquers to create designs against the red background is another distinctive Ryukyuan method.\nFinally, there is a technique known as tsuikin (lit. piled brocade) which is especially distinctive for Ryukyuan lacquers. Lacquer is mixed with pigments to create a sort of clay or putty, which is shaped and carved and then applied onto the object, in order to create textured three-dimensional effects.\nDespite these decorative particularities, the basic process of producing lacquerwares differs little between Ryukyu, Japan, and the mainland of Asia. However, Ryukyu does enjoy a number of native woods growing on its islands, including that of the deigo coral tree (Erythrina variegata). Deigo wood does not grow in mainland Japan, and is light and extremely porous with a very fine grain; given its high porosity it is particularly suitable for producing objects free from distortion or warping due to changeable climatic conditions and humidity levels, such as are common in the Ryukyu Islands.\nSome traditional processes also involve the use of raw pig's blood or sea sands as part of the undercoat. The use of pig's blood takes advantage of its coagulative  properties; blood is mixed with jinoko, a clay powder, as a base coat, and on top of this is applied a mixture of blood and tonoko, another form of pulverized whetstone or clay. The blood is used instead of typical lacquer throughout the base-coating process. Once dried, the pig's blood becomes insoluble in water and the lacquer topcoat is able to adhere without flaking or lifting off.\nFile:Chest with Cartouche Showing Figures on Donkeys in a Landscape, Magnolias, Plum Blossoms, Peonies, Birds, and Butterflies LACMA M.80.153.jpg|Chest with cartouche, about 1750–1800\nFile:Dish with Two Dragons Chasing a Flaming Pearl LACMA M.74.121.jpg|Dish with mother-of-pearl inlay, about 1700–1800\nFile:Tray on a High Foot with Birds, Flowers, and Grapevines LACMA M.81.189.jpg|Footed tray, about 1700–1800\nFile:Foliated Box with Cartouches Showing Figures in Landscapes LACMA M.79.181.1a-b.jpg|Foliated box, about 1750–1850\nFile:Food_Box,_view_1,_Ryukyu,_Second_Sho_Dynasty,_Ryukyu_Kingdom,_18th_century,_lacquered_wood_with_bird_and_flower_design_in_mother-of-pearl_inlay_-_Tokyo_National_Museum_-_DSC05425.JPG|Food box, 18th century\nReferences\nExternal links\n* [http://www.rekishi-archive.city.naha.okinawa.jp/en/ Naha City Museum of History]\n* [http://www.mingeikan.or.jp/english/collection/#j6 The Japan Folk Crafts Museum]\n* [http://museum.city.urasoe.lg.jp/categories/tenji/session/ Urasoe Art Museum – permanent collection]"
    }
  ]
}