{
  "content": [
    {
      "type": "text",
      "text": "# S. Edward Hall House\n\n| locmapin = Minnesota#USA\n| area =\n| built = 1906\n| architect =\n| architecture =\n| added = April 16, 1991\n| delisted = May 23, 2016\n| refnum = 91000440\n}}\nThe S. Edward Hall House in Saint Paul, Minnesota, United States, was the home of S. Edward Hall (1878-1975), an African American businessman and founder of the Saint Paul chapter of the NAACP. It was listed on the National Register of Historic Places from 1991 to 2016.\nThe house was listed on the National Register for its association with its owner, Stephen Edward Hall, who moved from Springfield, Illinois to St. Paul in 1900 to join his brother, Orrie C. Hall, as a barber.  By 1906, S. Edward Hall had married and bought the house, and the two brothers established a barber shop in the Germania Bank Building (then known as the Pittsburgh Building).  African Americans found good employment as barbers, because it was one of the few occupations where Blacks had been able to enter and dominate.  During that time, one-fourth of barbers in St. Paul were Black men, and it ranked as the third-largest occupation for Blacks behind porters and waiters.  In addition, Black barbers who catered to a White clientele could make economic gains, job connections, and influence for fellow Blacks.\nS. Edward Hall put these connections to work to aid fellow African Americans.  When other African Americans were looking for work, Hall would inquire with his patrons about job openings.  A weekly bulletin entitled The Helper referenced his shop, and this scheme became somewhat of a system, where other \"tipsters\" would inform \"helpers\" of job vacancies.  The local African Methodist Episcopal church organized the Helper Movement and Hall served as its vice president.  This employment referral system did not fully satisfy the job shortage among African Americans, though, and it wasn't effective for jobs outside the service sector.  In 1923, Ed Hall became one of the founding members of the St. Paul branch of the National Urban League, which promised more support for job seekers and would be assisted by donations from the Community Chest.  Hall remained active with the organization for many years, and at the time of his death in 1975, he was an honorary board member and President Emeritus.  Hall also continued to provide employment connections through his barber shop, such as assisting with the Ford Twin Cities Assembly Plant's agreement to hire a fair quota of Black employees in 1925.\nAlthough S. Edward Hall was first interested in expanding employment opportunities for African Americans, he was also interested in dealing with the need for adjustment and for social networking.  In 1908, Hall joined with the Mars Lodge of the Oddfellows to organize Union Hall, which opened in 1914.  Later, around 1928, the Colored branch of the YWCA on Central Avenue was closed after a series of events, and the Urban League identified the need for a community facility for educational, social welfare, and recreational activities.  The Great Depression also was eroding the fragile economy for the African American population.  Ed Hall arranged the transfer of the Central Avenue YMCA location to the Hallie Q. Brown Center, which became its own entity separate from the Urban League in 1930.  By 1934, one-third of the residents of Ramsey County, Minnesota were on relief, and in the neighborhood around the center, at Kent Street and Aurora Avenue, nine out of ten people were on relief. Jobs for African Americans were sparse because railroads and packing plants had been laying off many employees.  The Hallie Q. Brown Center provided nursery services for children whose mothers were seeking service jobs.  S. Edward Hall was a lifelong member of the Center and was a President Emeritus at his death.\nThe house was demolished by the City of Saint Paul in June 2011; an error at the Minnesota Historical Preservation Office failed to identify the house as a listed property on the National Register of Historic Places before its demolition. The property was de-listed in May 2016.\nReferences"
    }
  ]
}