{
  "content": [
    {
      "type": "text",
      "text": "# S. M. Anwara Begum\n\nS. M. Anwara Begum is a Bangladeshi academic, retired professor of political science, and veteran of the Bangladesh Liberation War. She served as a faculty member at Jagannath University (JnU) in Dhaka, Bangladesh, where she was the chairwoman of the Department of Political Science and dean of the Faculty of Social Sciences.\nEarly life\nBegum was born on 12 February 1956. Her mother was Sona Banu and her father was Sharif Hossain Sardar. She completed her bachelor's and master's in political science at the University of Dhaka. She completed her PhD at Jahangir University.\nCareer\nIn 1971, during the Bangladesh Liberation War, Begum fought under Sector 9 of the Mukti Bahini.\nIn 1979, Begum worked as a research assistant in a project funded by the World Bank. She then worked as a research officer at Rapport Bangladesh Limited. She joined the education branch of the Bangladesh Civil Service in 1983 and was appointed as a lecturer at Jhalakathi Government College. She worked for the Govt. Haraganga College, Munshiganj from 1984 to 1987. After which, she joined Jagannath University as an Assistant Professor. In 2006, she was appointed chairman of the Department of Political Science at Jagannath University.\nFrom May 2013 to May 2018, Begum served as a member of the Bangladesh Public Service Commission. She retired in 2021.\nLegal issues\nAfter the fall of the Sheikh Hasina-led Awami League government, Begum was arrested in May 2025 in connection with an attempted murder case related to an attack on protesters during the July uprising in the previous year. The arrest occurred in the afternoon near the Jagannath University campus, as confirmed by Sutrapur Police Station Officer-in-Charge Saiful Islam. The case was filed by Sujon Molla, the former general secretary of the university's unit of Jatiyatabadi Chhatra Dal, the student wing of the Bangladesh Nationalist Party, who was shot in the eye during an anti-discrimination student protest. The case names 193 individuals, including prominent political figures such as former Prime Minister Sheikh Hasina, Awami League General Secretary Obaidul Quader, and other Jagannath University teachers and administrative officials, alongside 94 Chhatra League activists. She was sent to jail by Dhaka Metropolitan Magistrate Md Mostafizur Rahman.\nAccording to Prothom Alo, actress Nusrat Faria received swift bail after her arrest in an attempted murder case, following public outcry. In contrast, retired Begum, accused in a similar case, was denied bail and remained in jail. The report raised concerns over unequal judicial treatment and the influence of social media and public sentiment. It questioned whether justice is becoming increasingly selective and shaped by political and societal pressures. She was granted bail on 2 June by Dhaka Metropolitan Magistrate Md Minhazur Rahman.\nPersonal life\nBengum is married to Dr. Md. Mahmudur Rahman, a retired additional secretary of the Bangladesh Civil Service.\nReferences"
    }
  ]
}