{
  "content": [
    {
      "type": "text",
      "text": "# S. Ward Casscells\n\nS. Ward \"Trip\" Casscells (March 18, 1952 – October 14, 2012) was an American cardiologist who served with the U.S. Army in Iraq and later was Assistant Secretary of Defense for Health Affairs. Among other honors, he was the recipient of the Distinguished Public Service Medal,  the Army's Order of Military Medical Merit, and the General Maxwell Thurman Award.\nBiography\nSamuel Ward Casscells III was born in Wilmington, Delaware and graduated from Tower Hill School in 1970. He then graduated cum laude from Yale College with a B.S. degree in 1974 and magna cum laude from Harvard Medical School with his M.D. degree in 1979. Casscells was board certified in internal medicine after completing his residency at Beth Israel Hospital from 1979 to 1983. He was then board certified in cardiology after completing a fellowship at Massachusetts General Hospital from 1982 to 1985.\nStarting in 1992, he was employed by the University of Texas Health Science Center at Houston. He also served in the Army Reserve, receiving the Meritorious Service Medal and retiring as a colonel.\nPersonal\nCasscells was the son of S. Ward Casscells (November 15, 1915 – February 8, 1996) and Sarah Oleda (Dyson) Casscells (January 5, 1921 – August 18, 2002). His father was an orthopedic surgeon who had helped invent arthroscopic surgery and had served in the Army Medical Corps as a trauma surgeon with the Eighth Evacuation Hospital during World War II, retiring from service as a captain. His parents were married in a civil ceremony in Chesterfield County, South Carolina on December 22, 1948 while his mother was completing her law degree at the University of Virginia and again in an Episcopal ceremony in Fairfax, Virginia on June 11, 1949 after her graduation.\nAfter his death from prostate cancer at his home in Washington, D.C., the younger Casscells was interred next to his parents in Arlington National Cemetery on July 19, 2013.\nReferences\nExternal links\n*[http://www.defenselink.mil/bios/biographydetail.aspx?biographyid=125 Defenselink.mil: S. Ward Casscells Biography]\n*[https://web.archive.org/web/20110722192102/http://www.health.mil/bioDetail.aspx?ID=1 Health.mil: S. Ward Casscells Biography]\nArticles\n* [https://www.washingtonpost.com/local/obituaries/s-ward-casscells-iii-dies-at-60-cardiologist-and-army-reservist-served-in-iraq-pentagon/2012/10/16/0ce3ec2c-170b-11e2-8792-cf5305eddf60_story.html \"S. Ward Casscells III dies at 60; cardiologist and Army reservist served in Iraq and Pentagon\" by Emily Langer, Washington Post Oct 16, 2012.]\n*[https://web.archive.org/web/20090224091555/http://whatsbrewin.nextgov.com/2009/02/casting_the_net_for_a_replacem.php \"Casting the 'Net for a Replacement\", by Bob Brewin, NextGov. February 19, 2009.]\n*[http://www.isn.ethz.ch/isn/Current-Affairs/Security-Watch/Detail/?lng=en&id=95415 “Soft Power with Guns”, by Peter Buxbaum, International Relations and Security Network- Security Watch. January 16, 2009.]\n*[https://web.archive.org/web/20110606132804/http://www.govexec.com/story_page.cfm?filepath=%2Fdailyfed%2F0109%2F011209wb.htm “Culture War”, by Bob Brewin. Government Executive Magazine. January 12, 2009.]\n*[https://web.archive.org/web/20090328123720/http://www.armymedicine.army.mil/news/mercury/09-01/healthchief.cfm \"Health Chief Discusses AHLTA, Other Issues\", by Jerry Harben - Mercury News. January 2009.]\n*[http://www.military-medical-technology.com/military-medical-cbrn-technology/28-mmt-2008-volume-12-issue-1/179-health-care-champion.html \"Health Care Champion: An Interview with S. Ward Casscells, M.D. Assistant Secretary of Defense for Health Affairs\", by Chaz Vossburg - Military Medical Technology. December 2008.]\n*[https://web.archive.org/web/20100821112958/http://www.healthcaredesignmagazine.com/ME2/dirmod.asp?sid=&nm=&type=Publishing&mod=Publications%3A%3AArticle&mid=8F3A7027421841978F18BE895F87F791&tier=4&id=D2C6E7066F1745F8B35002C855C2ED5C “Healing Environments for America’s Heroes”, by Michelle Ossmann, Clay Boenecke, Barbara Dellinger. Healthcare Design Magazine. November 2008.]\n*[http://www.govexec.com/story_page.cfm?filepath=/features/0908-01/0908-01na3.htm “Walking the Deck”, by Bob Brewin. Government Executive Magazine. September 2008.]\n*[https://web.archive.org/web/20110711055543/http://www.futurehealthcareus.com/?mc=engine&page=cs-viewarticle “Engine of Innovation: US Healthcare from Military to Private Sector\", by Divya Sood. Future Healthcare Magazine. 3Q 2008.]\n*[http://www.washingtontimes.com/news/2008/jun/05/agencies-dispatch-health-care-workers/ “Agencies Dispatch Health Care Workers; Mission Responds To PTSD” Audrey Hudson. The Washington Times. June 5, 2008.]\n*[http://www.newsweek.com/id/71338/output/print \"A Lion in Autumn: How a middle-aged doctor wound up on the battlefield in Iraq\", by Evan Thomas. Newsweek. November 19, 2007.]\n* [https://web.archive.org/web/20120927034639/http://www.stripes.com/blogs/stripes-central/stripes-central-1.8040/try-advil-instead-defense-department-bans-aspirin-1.8143 \"Try Advil instead - Department of Defense bans aspirin\" by Leo Shane, Stripes Central April 29, 2009.]\n*“Delaware Native Comes To Military Career Late But Ascends To Top”, By Nicole Gaudiano. Gannett News Service. March 28, 2007.\n*“Swiftly Confirm: Wartime Pentagon Needs A Top Health Official, and Houston's Ward Casscells Is Right Man for the Job” (Editorial). Houston Chronicle. March 27, 2007.\n*“Delaware Native On Call For Veterans Health Crisis” By Nicole Gaudiano. Gannett News Service\n*“Bush To Nominate Houston Doctor To Defense Health Affairs Post” By Todd Ackerman.  The Houston Chronicle. February 24, 2007.\n*[https://www.washingtonpost.com/wp-dyn/content/article/2007/02/22/AR2007022201649.html “Walter Reed Stories Factual But Unfair, Medical Chief Says” Steve Vogel. Washington Post. February 23, 2007.]\n*[https://www.reuters.com/article/latestCrisis/idUSN17189361 “U.S. Aims To Grow Ears, Skin For War Wounds” Kristin Roberts. Reuters. April 18, 2008.]\n*“Departments Of Defense And Veterans Affairs Working Together” The Montgomery Advertiser. December 27, 2007.\n*“State Gears Up To Screen Combat Stress” Philip Dine. The Pantagraph. December 26, 2007.\n*[http://www.washingtontimes.com/news/2007/sep/26/faux-candidate-ranks-high-in-poll/ “Faux Candidate Ranks High In Poll” Ralph Z. Hallow. The Washington Times. September 26, 2007.]\n*[http://www.theheart.org/article/768659.do “Casscells Returns from Tour of Duty”, Heart Wire. February 1, 2007.]\n*[http://www.stripes.com/article.asp?section=125&article=43120 “Mourning a doctor who improved Iraq” by Col. S. Ward Casscells, Stars and Stripes Mideast edition. January 27, 2007.]\n*“Pentagon Official Praises Staff For Hospital's Recovery” Wire Reports. Fort Worth Star-Telegram\n*\"A Parable to Help Make Sense of Iraq\" Col. S. Ward Casscells. Houston Chronicle. November 26, 2006.\n*[http://www.stripes.com/article.asp?section=125&article=41466 \"Iraq: The Old Chevy\" Col. S. Ward Casscells. Stars and Stripes. November 7, 2006.]\n*[https://web.archive.org/web/20090117004742/http://www4.army.mil/ocpa/read.php?story_id_key=8558 \"World Renowned Doctor Trades Lab Coat for Uniform\", by Elaine Wilson. Army News Service. February 8, 2006.]"
    }
  ]
}