{
  "content": [
    {
      "type": "text",
      "text": "# Sabaneta, Dominican Republic\n\n|subdivision_type        =Country\n|subdivision_name        =\n|subdivision_type1       =Province\n|subdivision_name1       =Santiago Rodríguez\n|established_title       =Founded\n|established_date        =1844\n|established_title2      =Municipality since\n|established_date2       =1858\n|area_total_km2          =804.47\n|area_footnotes          =\n|elevation_m             =124\n|elevation_footnotes     =\n|population_total        =98453\n|population_as_of        =2012\n|total_type              =Total\n|population_density_km2  =auto\n|population_blank1_title =\n|population_blank1       =\n|population_footnotes    =\n|blank_name              =Distance to&nbsp;– Santo Domingo\n|blank_info              =245 km\n|blank1_name             =Municipal Districts\n|blank1_info             =0\n}}\nSan Ignacio de Sabaneta is the capital and a municipality of Santiago Rodriguez in the northwestern part of the Dominican Republic. It is usually called only Sabaneta or Santiago Rodríguez.\nHistory\nThe town was founded in 1844 by Santiago Rodríguez and the brothers, Alejandro and José Bueno. The city laid in the centre of a small savanna, in Spanish, Sabaneta. In 1854, the town was elevated to the category of Military Post and in 1858 it was incorporated into a municipality of the Santiago province.\nSabaneta was the centre of the fight against the Spanish soldiers during the Restoration War (1863–1865).\nWhen 1879 Monte Cristi became a province, San Ignacio de Sabaneta was made a municipality of that new province. When the new province of Santiago Rodríguez was created in 1948, San Ignacio de Sabaneta was made the head municipality of the province.\nClimate\n}}\nEconomy\nThe main economic activities of the municipality are tobacco, hides and milk.\nNotable people from Sabaneta\n* Fefita la Grande Dominican Musician who composed Merengue \"Tipico\" and is known for her Perico Ripiao\n* Diógenes Díaz Torres destacado poeta, con un sin número de verso escritos en su libro Sin Cesarea\nReferences"
    }
  ]
}