{
  "content": [
    {
      "type": "text",
      "text": "# Sabine Hall (Warsaw, Virginia)\n\n| designated_other1_number = 079-0015\n| designated_other1_num_position = bottom\n| image = Sabine Hall (Richmond, Virginia).jpg\n| caption = Sabine Hall, HABS Photo\n| location = Sabine Hall Rd., near Warsaw, Virginia\n| coordinates =\n| locmapin = Virginia#USA\n| mapframe         = yes\n| mapframe-marker  = building\n| mapframe-zoom    = 12\n| mapframe-caption = Interactive map showing the location of Sabine Hall\n| area =\n| built =\n| architect =\n| architecture = Georgian\n| designated_nrhp_type = April 15, 1970\n| added = November 12, 1969\n| refnum = 69000277\n}}\nSabine Hall is a historic house located near Warsaw in Richmond County, Virginia. Built about 1734 by noted planter, burgess and patriot Landon Carter (1710–1778), it is one of Virginia's finest Georgian brick manor houses. Numerous descendants served in the Virginia General Assembly. It was added to the National Register of Historic Places in 1969, and declared a National Historic Landmark in 1970. At the time of its National Register listing, it was still owned by Carter / Wellford descendants.\nDescription\nSabine Hall is located in a rural setting south of Warsaw, Virginia, on a ridge overlooking the Rappahannock River to the south. The plantation property on which it stands extends as far east as Jugs Creek, and north and west to United States Route 360. The main plantation house is a two-story, brick and stone, Georgian style manor house. It is flanked by later -story brick wings. The center of its main facade is dominated by a two-story four-column portico with pedimented gable. The interior features a fully paneled central hall measuring , and an ornate carved walnut stairway that has been described as one of the finest in the nation. The house overlooks six gardened terraces descending to the river.\nThe central core of the plantation house was built by noted planter Landon Carter (1710–1778) in about 1730. In 1764 the house was enlarged to join the kitchen outbuilding (since demolished) via a covered passage. One of the wings was added at an unknown date; the other was added in 1929 to give the building visual symmetry.\nHistory\nLandon Carter's firstborn son and heir Robert Wormeley Carter, who would be the first owner to serve in the Virginia House of Delegates finished or remodeled parts of the interior, purchasing cabinetry and other items from William Buckland who built the neighboring Mount Airy for Col. John Tayloe II. His son, another Landon Carter, would marry Tayloe's daughter Catharine Tayloe. His grandson, Robert W. Carter, who would serve in both the Virginia House of Delegates and Virginia Senate before dying at Sabine Hall in October 1861, also remodeled the property in the 1840s and 1850s. His only surviving child, a daughter, married Dr. Armistead Wellford of Fredericksburg, who received a federal pardon at the war's end. Their son, R. Carter Wellford (1853-1919) would inherit Sabine Hall and also serve in the Virginia House of Delegates.\nSee also\n* List of National Historic Landmarks in Virginia\n* National Register of Historic Places listings in Richmond County, Virginia\nReferences\nExternal links\n*\n* [http://encyclopediavirginia.org/media_player?mets_filename=evm00002905mets.xml Encyclopedia Virginia: Sabine Hall]"
    }
  ]
}