{
  "content": [
    {
      "type": "text",
      "text": "# Sachin Tanwar\n\n| birth_place = Jhunjhunu, Rajasthan\n| death_date =\n| death_place =\n| residence =\n| education =\n| alma_mater =\n| occupation = Kabbadi Player\n| years_active =\n| employer =\n| agent =\n| height =\n| weight =\n| spouse =\n| life_partner =\n| other_interests =\n| website =\n| country = India\n| sport = Kabaddi\n| position = Raider\n| event =\n| league = Pro Kabaddi League\n| league_type =\n| club = Tamil Thalaivas\n| team =\n| turnedpro =\n| coach =\n| retired =\n| worlds =\n| regionals =\n| nationals =\n| highestranking =\n| medaltemplates =\n}}\n}}\nSachin Tanwar (born 19 July 1999) is an Indian kabaddi player who played for the Patna Pirates till 2023-24 and   currently plays  in Tamil Thalaivas since 2024 in the Pro Kabaddi League and the Indian national team. He was among the top 10 raid point scorers in the league in his first two seasons. He made his debut for the Indian kabaddi team in 2017. He was part of the Indian team that won the gold at the 2022 Asian Games kabaddi competitions. India beat Iran 33-29 in a controversial final.\nEarly life\nSachin hails from Badhbar village of Jhunjhunu district, Rajasthan. He comes from a sports family where his elder brother Deepak and Uncle Rakesh also played kabaddi. Sachin played in the under-14 and under-16 tournaments that helped him to go for the Senior India National selection trials.\nCareer\nIn 2017, he made his debut for senior India at the Asian Kabaddi Championships.\nPro-Kabaddi League\nSachin made his debut in the fifth season of Pro kabbadi league and was the highest raid point scorer for Gujarat Giants finishing with 159 raid points. He made his debut the 26–20 victory over Dabang Delhi in Hyderabad and scored three raid points. He scored eight points in the 20–32 loss against Haryana Steelers in Nagpur. He scored his first career Super 10 in the 29–19 victory over Telugu Titans in Ahmedabad. He finished the campaign with seven Super 10s and two Super Raids at a strike rate of 53.89.\nSachin registered his first Super 10 in the fourth match of sixth season against the Haryana Steelers in the 36–25 victory in Patna. He scored his second in the subsequent game against Puneri Paltan in a 37–27 win for the Fortunegiants. Sachin bettered his raid point tally from the previous campaign and finished with 190 in 23 matches. He scored seven Super 10s and finished among the top 10 raid point scorer for the second season running.\nInternational\nHe was part of the Indian team that won gold in the Asian Kabaddi Championship 2017.\nRecords and achievements\n* Gold at 2017 Southeast Asian Games\n* Gold at 2017 Asian Beach Games\n* Pro Kabaddi league runner up (2016)\nReferences"
    }
  ]
}