{
  "content": [
    {
      "type": "text",
      "text": "# Sacred tradition__disambig_1\n\n, volumes of writings from the Church Fathers]]\nSacred tradition, also called holy tradition, Anno Domini tradition, or apostolic tradition, is a theological term used in Christian theology. According to this theological position, sacred Tradition and Scripture form one deposit, so sacred Tradition is a foundation of the doctrinal and spiritual authority of Christianity and of the Bible. Thus, the Bible must be interpreted within the context of sacred Tradition (and vice versa) and within the community of the denomination. The denominations that ascribe to this position are the Catholic, Eastern Orthodox, and Oriental Orthodox churches, and the Assyrian churches (the Ancient Church of the East and the Assyrian Church of the East).\nThe Anglican and Methodist churches regard tradition, reason, and experience as sources of authority but as subordinate to scripture – a position known as prima scriptura. That is in contrast to the Lutheran and Reformed traditions, which teach that the Bible alone is a sufficient/infallible basis for all Christian teaching – a position known as sola scriptura. In Lutheranism, tradition is subordinate to Scripture and is cherished for its role in the proclamation of the Gospel.\nFor many denominations of Christianity, the writings of the Ante-Nicene Fathers, Nicene Fathers and Post-Nicene Fathers are included in sacred Tradition.\nOrigin of the term\nThe word tradition is taken from the Latin , meaning \"to hand over\".\nIt is often treated as a proper noun and thus capitalized as \"Sacred Tradition\"  or \"sacred Tradition\".\nHistory\nAmong the earliest examples of the theological invocation of Tradition is the response of early orthodox Christianity to Gnosticism, a movement that used some Christian scripture as the basis for its teachings. Irenaeus of Lyons held that the 'rule of faith' ('κανών της πίστης') is preserved by a church through its historical continuity (of interpretation and teaching) with the Apostles. Tertullian argued that although interpretations founded on a reading of all Holy Scripture are not prone to error, Tradition is the proper guide.\nIn the modern era, scholars such as Craig A. Evans, James A. Sanders, and Stanley E. Porter have studied how sacred Tradition in the Hebrew Bible was understood and used by New Testament writers to describe Jesus Christ.\nTeaching by Christian denomination\nCatholic Church\nAccording to Catholic theology, Paul the Apostle exhorted  the faithful to \"stand firm and hold fast to the traditions that you were taught by us, either by word of mouth or by our letter\" (2 Thessalonians 2:15). The Pauline epistles form part of sacred scripture; what he passed on by \"word of mouth\" is part of sacred Tradition, handed down from the apostles. Both are the inspired word of God; the latter helps to inform understanding of the former. Sacred Tradition can never be in conflict with sacred scripture.\nThose in the Catholic faith believe that the teachings of Jesus and the Apostles were preserved in the scriptures as well as by word of mouth. This perpetual handing on of the tradition is called the \"Living Tradition\"; it is believed to be the faithful and constant transmission of the teachings of the Apostles from one generation to the next. That \"includes everything which contributes towards the sanctity of life and increase in faith of the People of God; and so the Church, in her teaching, life and worship [the Creeds, the Sacraments, the Magisterium, and the Holy Sacrifice of the Mass], perpetuates and hands on to all generations all that she herself is, all that she believes.\" The Deposit of Faith () refers to the entirety of divine revelation. According to Roman Catholic theology, two sources of revelation constitute a single \"Deposit of Faith\", meaning that the entirety of divine revelation and the Deposit of Faith is transmitted to successive generations in Scripture and sacred Tradition through the teaching authority and interpretation of the church's Magisterium, which consists of the church's bishops, in union with the Pope, typically proceeding synods and ecumenical councils.\nThus sacred Tradition should be distinguished from general tradition, folklore, traditionalism or conservatism which do not have an apostolic, patristic or universal pedigree.\nThe Catholic Church views Tradition in much the same terms, as a passing down of that same apostolic faith, but, in a critical difference from the Eastern Orthodox position, Catholicism holds that the faith once delivered, the understanding of it continues to deepen and mature over time through the action of the Holy Spirit in the history of the church and in the understanding of that faith by Christians, all the while staying identical in essence and substance: the development of doctrine.\nIn the area of moral theology, Mark D. Jordan said that medieval texts appeared to be inconsistent. According to Giovanni Cappelli, prior to the sixth century, the church's teachings on morality were incoherent. According to John T. Noonan, \"history cannot leave a principle or a teaching untouched; every application to a situation affects our understanding of the principle itself\".\nDei Verbum\nChapter 2 of the Second Vatican Council's Dogmatic Constitution on Divine Revelation, \"Dei verbum\" sets out the Catholic Church's teaching on sacred tradition, Sacred Scripture and the teaching authority of the Church (the \"magisterium\"):}}\nThus, all of the teachings of the Catholic Church come from either Tradition or Scripture, or from the Magisterium interpreting Tradition and Scripture. These two sources, Tradition and Scripture, are viewed and treated as one source of Divine Revelation, which includes both the deeds of God and the words of God:\n}}\nThe Magisterium has a role in deciding authoritatively which truths are a part of sacred Tradition.\nEastern Orthodox Church\nIn the Eastern Orthodox Church, there is one Tradition, the tradition of the church, incorporating the scriptures and the teaching of the Church Fathers. As explained by Athanasius of Alexandria (First Letter to Serapion, 28): \"Let us look at the very tradition, teaching, and faith of the catholic Church from the very beginning, which the Logos gave (edoken), the Apostles preached (ekeryxan), and the Fathers preserved (ephylaxan). Upon this the Church is founded (tethemeliotai)\".\nSacred Tradition for the Eastern Orthodox Church is the deposit of faith given by Jesus to the Apostles and passed on in the Church from one generation to the next without addition, alteration, or subtraction. Vladimir Lossky described tradition as \"the life of the Holy Spirit in the Church\".\nGeorges Florovsky wrote:\nLutheran Churches\nthe host during the Mass at Alsike Church, Sweden]]\nThe Lutheran tradition of Christianity holds that the Bible alone is the source for Christian doctrine. This position does not deny that Jesus or the apostles preached in person, that their stories and teachings were transmitted orally during the early Christian era, or that truth exists outside of the Bible. In Lutheranism, tradition is subordinate to Scripture and is cherished for its role in the proclamation of the Gospel. The Lutheran divines held that \"Scripture was still to be read within a living ecclesial Tradition, and especially though the writings of the Church Fathers\". Furthermore, the Lutheran Churches teach \"Scripture as ‘the norm which norms (but which is not itself normed)’ (norma normans or norma normans non normata) and Tradition, especially the ecumenical creeds, as ‘the norms which are normed’ (norma normata).\" As such, Lutherans hold that \"Although Scripture cannot be normed by Tradition (norma normans non normata), it can be, and is, interpreted through Tradition. Tradition is still a norm (norma normata).\"\nIn the Lutheran Churches, tradition is revered in the sense of the \"transmission of the Scriptures from one generation to the next\", the Ecumenical Creeds, \"the true exposition and understanding of Scripture received from the apostles and handed down to future generations\", \"Christian doctrines not explicitly stated in Scripture but drawn from clear Scripture on the basis of sound reason\", \"the teachings of the early church fathers as they taught Scripture\", \"ceremonies as they serve the preaching of the gospel\" such as \"making the sign of the cross, turning to the east in prayer, [and] the renunciation of Satan in Baptism\". The Book of Concord is seen as being a part of tradition. Within the Book of Concord, the Augsburg Confession appeals to Nicene Creed and the Chalcedon Creed as sources of authority, being part of Lutheran tradition.}}\nWith regard to tradition, Martin Luther \"held the Church Fathers in high esteem, and thereby placed the primitive Church and its theology on a level below the Bible\" but above medieval innovations. Early Christian texts such as the Didache and Apostolic Tradition therefore are an important part of tradition in Lutheranism. As Lutheranism emerged, it did reject what it sees as Roman Catholic traditions that \"have no foundation in Scripture, and are used as sources of doctrines—placed on the same level as the doctrines clearly taught in Scripture.\"\nIn Lutheranism, while Scripture possesses magisterial authority, tradition has ministerial authority:}}\nIn Lutheran Christianity, the power of the keys is given by Christ to the Church for the binding and loosing of sins. \"The Office of the Keys is the special authority which Christ has given to His Church on earth: to forgive the sins of the penitent sinners, but to retain the sins of the impenitent as long as they do not repent.\" Lutheran doctrine cites  as the basis for the sacrament of Confession and Absolution. Bishops, as well as priests (pastors), exercise authority given to them by Christ, and are thus responsible \"to teach (1 Tim. 3:2; 5:17; Eph. 4:11), lead (1 Tim. 3:5; 5:17), pray (especially for the sick, James 5:13–16), and shepherd (1 Pet. 5:1–4).\"\nReformed Christianity\nThe Reformed tradition (Continental Reformed, Presbyterian, Reformed Anglican and Congregationalist denominations) teach that the Bible alone is the source for Christian doctrine. For sola scriptura Christians today, however, these teachings are preserved in the Bible as the only inspired medium. Since in the opinion of sola scriptura Christians, other forms of tradition do not exist in a fixed form that remains constant in its transmission from one generation to the next and cannot be referenced or cited in its pure form, there is no way to verify which parts of the \"tradition\" are authentic and which are not.\nAnglicanism and Methodism\nPrima scriptura is upheld by the Anglican and Methodist traditions of Christianity, which suggest that scripture is the primary source for Christian doctrine, but that \"tradition, experience, and reason\" can nurture the Christian religion as long as they are in harmony with the Bible.\nThe Anglican Church does to some extent accept Apostolic tradition, which can be found in the writings of the early Church Fathers, the decrees of the seven Ecumenical Councils, the Creeds, and the liturgical worship of the church.\nSee also\n* Christian tradition\n* Oral Torah\nReferences\nFurther reading\n*\n*\n* Petley, D.A., ed. (1993). Tradition: Received and Handed on: [papers presented at] a Theological Conference held at the [Anglican] Cathedral Church of St. Peter, Charlottetown, P.E.I., 27 June–1st July 1993. Charlottetown, P.E.I.: St. Peter Publications.\nExternal links\n* WELS Topical Q&A: [https://web.archive.org/web/20050930223227/http://www.wels.net/cgi-bin/site.pl?1518&cuTopic_topicID=39&cuItem_itemID=8174 Tradition Apostolic] (a Confessional Lutheran perspective)\n* [https://www.9marks.org/article/two-views-on-church-authority-protestant-vs-roman-catholic/ Two Views on Church Authority: Protestant vs. Roman Catholic] by Gregg R. Allison"
    }
  ]
}