{
  "content": [
    {
      "type": "text",
      "text": "# Sadowara Station\n\n| owned               =\n| operator            =\n| line                =   Nippō Main Line\n| distance            = 326.7 km from\n| platforms           = 1 side + 1 island platforms\n| tracks              = 3 + 1 passing loop and 1 siding\n| structure           = At grade\n| parking             =\n| bicycle             =\n| accessible            = No - island platformed accessed by footbridge\n| code                =\n| status              = Staffed ticket window (outsourced)\n| website             =\n| opened              =\n| former              = Hirose (until 1 July 1965)\n| closed              =\n| rebuilt             =\n| passengers          = 1,075 daily\n| pass_year           = FY2016\n| pass_rank           = 155th (among JR Kyushu stations)\n| services =\n| map_type = Japan Miyazaki Prefecture#Japan\n| map_dot_label = Sadowara Station\n|mapframe = yes\n| mapframe-zoom = 17\n}}\nis a passenger railway station located in Miyazaki City, Miyazaki Prefecture, Japan. It is operated by JR Kyushu and is on the Nippō Main Line, and until 1984, was a junction for the now closed Tsuma Line. It is also a freight depot for JR Freight.\nLines\nThe station is served by the Nippō Main Line and is located 326.7&nbsp;km from the starting point of the line at .\nLayout\nThe station consists of a side platform and an island platform serving three tracks at grade. Track/platform 1, directly access from the station building, is a dead-end siding that only serves trains heading to/from the direction of Miyazaki to the south. The island platform with tracks 2 and 3 is accessed by a footbridge. A passing loop runs between tracks 1 and 2. The station building is a modern flat-roofed concrete structure which houses a waiting area, a staffed ticket window, an automatic ticket vending machine, and SUGOCA card reader and charge machine. Adjacent to the station building and beside track 1 is a container terminer, formerly served by rail but now part of the Sadowara ORS (off-rail station) which only uses trucks.\nManagement of the passenger facilities at the station has been outsourced to the JR Kyushu Tetsudou Eigyou Co., a wholly owned subsidiary of JR Kyushu specialising in station services. It staffs the ticket booth which is equipped with a POS machine but does not have a Midori no Madoguchi facility.\nPlatforms\nNippō Main Line|dir=for  and }}\nNippō Main Line|dir=for  and }}\nHistory\nIn 1913, the  had opened a line from  northwards to Hirose and by 1914, to Tsuma. After the Miyazaki Prefectural Railway was nationalized on 21 September 1917, Japanese Government Railways (JGR) undertook the subsequent extension of the track. In the first phase of expansion, the track was forked northwest and north. The track heading northwest to Tsuma was sectioned off and designated as the . A new track was laid heading north from  to  which opened on 11 September 1920. This new stretch and the rest of the track south to  Miyazaki became part of the Miyazaki Main Line. On the same day, Hirose on the Tsuma Line track was closed and this station was opened at the junction of the Tsuma and Miyazaki Main Line. It took on the name  but was renamed Sadowara on 1 July 1965. Expanding north from Takanabe in phases and joining up with other networks, the track eventually reached  and the entire stretch from Kokura through Hirose to Miyakonojō was redesignated as the Nippō Main Line on 15 December 1923. Freight operations were discontinued in 1984 and on 1 December 1984, the Tsuma Line was closed, leaving the Nippō Main Line as the only line to serve Sadowara. With the privatization of Japanese National Railways (JNR), the successor of JGR, on 1 April 1987, the station came under the control of JR Kyushu. Freight operations were resumed on 31 July 1991 under JR Freight, but freight train services were discontinued again on 3 October 1998 and replaced by an off-rail service using trucks.\nPassenger statistics\nIn fiscal 2016, the station was used by an average of 1,075 passengers daily (boarding passengers only), and it ranked 155th among the busiest stations of JR Kyushu.\nSadowara Off-Rail Station\nThe Sadowara Off-Rail Station (abbreviation: Sadowara ORS) is a fright container collection and delivery base that belongs to JR Freight and is located on the north side of the station building. It handles container cargo (12-foot containers only), and truck services, which replace freight trains, operate twice a day between here and Nobeoka Station.\nSurrounding area\n*Miyazaki City Hall Sadowara General Branch (former Sadowara Town Hall)\n*Miyazaki City Hirose Elementary School\n*Miyazaki City Hirose Junior High School\nSee also\n*List of railway stations in Japan\nReferences\nExternal links\n*[http://www.jrkyushu.co.jp/railway/station/1191600_1601.html Sadowara (JR Kyushu)]"
    }
  ]
}