{
  "content": [
    {
      "type": "text",
      "text": "# Safe parking programs\n\nSafe parking programs provide parking sites where people experiencing homelessness can legally park and stay in their cars overnight.\nSome safe parking programs provide support services and hire private security guards to make the facility more safe.\nCompared with those living in tents and shelters, the so-called mobile homeless are more likely to have jobs or to be actively looking for work, a UCLA study found. Many lost their homes after being unable to afford rent or their mortgage. But living in a car comes with risks — of burglary, harassment and more. That has led to the creation of safe parking programs, designated places for people living in their vehicles to stay overnight.\nDozens of such lots, often outside of religious centers, have opened across the nation in the past five years, a testament to the severity of the homelessness crisis. California has more safe parking lots than any other state, with more than two dozen from Santa Rosa to San Diego.\nCalifornia\nSanta Barbara County\nSanta Barbara’s New Beginnings organization has operated a Safe Parking Program since 2004 in cooperation with local churches, governmental and non-profit agencies, and businesses. This Safe Parking Shelter and Rapid Rehousing Program provides safe overnight parking to individuals and families living in their vehicle.\nThe program currently manages over 200 spaces in 27 parking lots throughout the cities of Santa Barbara, Goleta, and the neighboring unincorporated areas of the county, according to a report from Kristine Schwarz, New Beginnings's Executive Director. The program now also connects the chronically homeless to shelters and services.\nSan Diego County\nIn 2009, the nonprofit organization Dreams for Change established the first congregate-model Safe Parking Program in San Diego, CA. Founder Teresa Smith started Dreams for Change to address the rise in first-time homelessness occurring primarily as a result of the Great Recession. Dreams for Change’s Safe Parking programs offer on-site restrooms, charging stations, and case management services. Each individual or household also receives access to workforce training programs, resources to find employment, and support with developing a housing plan.\nDreams for Change has since worked with multiple cities and municipalities across the United States that are looking to replicate Safe Parking in their cities.\nIn October 2016, Dreams for Change signed the first lease agreement with Jewish Family Services to lease JFS’s main Kearny Mesa campus parking lot to operate a safe parking program at night. In addition to the outdoor safe parking program, Dreams for Change provided case management sessions inside rooms provided by JFS.\nIn the fall of 2017, in response to the Hepatitis A outbreak happening among the unsheltered people living on the streets, Mayor Kevin Faulconer (R) approached Dreams for Change to expand the Safe Parking Program to the first city-owned site, on Aero Drive in Murphy Canyon.  That same year, Dreams for Change and Jewish Family Services entered a partnership with JFS being the fiscal agent of the City Funding and DFC being the sole operator.\nIn October 2018, Jewish Family Services of San Diego entered a new agreement with San Diego's Mayor Kevin Faulconer to be the city’s partner operator of Safe Parking sites, using the Dreams for Change model.\nDreams for Change still manages multiple Safe Parking sites in San Diego County, including a safe parking location on Imperial Ave, where they began to pilot the first San Diego hybrid program to include RVs. In 2022, the Dreams For Change safe parking sites served 494 people in 286 vehicles.\nParking spaces in San Diego’s Safe Parking lots are assigned by referral only. Referrals can be direct, through the City of San Diego’s coordinated entry, or through the County’s Homeless Solutions and Equitable Communities outreach teams.\nLos Angeles County\nIn 2017, the Los Angeles Homeless Services Authority (LAHSA) started a safe parking program that by 2019 had 12 lots with 130 spots, and provides services like portable toilets, food, and social workers, at a cost to the county of $35 per spot per night.\nIn 2019, when the latest poll showed that 16,500 people were living in their vehicle, the Authority attempted to scale up its program to 300 spots, with requirements that any new lot provide security guards, at least 25 spots, have an empty space between each car, and that each lot be at least 95% capacity every night, for less than $30 per spot per night. The Authority pays about $30 per bed per night for homeless shelters. Churches and community organizations stated that the funding is too low to allow them to cover the costs of the required services, and stated that while $30 per night houses one individual, entire families often live together in one vehicle. This was contrasted to San Diego's program which spends $10 per car per night, but does not employ security guards, and puts vehicles closer together in each lot.\nFounded in 2017, Safe Parking LA is now the largest safe parking program in Los Angeles and is the only provider of safe lots exclusively focused on vehicular homelessness. Safe Parking LA operates in San Fernando Valley, Hollywood, Downtown Los Angeles, and West Los Angeles including a program on the Veterans Administration campus.\nOther Safe Parking service providers under the LAHSA program umbrella are located across the city as well.\nMountain View\nMountain View operates the largest safe parking program in Santa Clara County  in partnership with operator MOVE MV, which manages 7 different parking lots within the Safe Parking Program.  MOVE MV began as a small pilot program in 2018. Two churches in Mountain View offered up three spaces in their lots for people living in their RVs and cars. Since then, the program has expanded to a network of nine sites that also includes Palo Alto, with about 130 safe parking spaces available for vehicle dwellers.\nSacramento\nIn March 2021, Sacramento opened its first two city-sanctioned safe grounds, which offer people experiencing homelessness a place to legally sleep outside in vehicles or tents. The safe parking and safe camping program is called SafeGround and is operated by First Step Communities in partnership with the City of Sacramento.\nOther regions\nCurrently, the congregate model of safe parking (developed by Teresa Smith, founder of Dreams for Change) is being used in numerous city programs across the country, contributing to the expansion of safe parking options for those in need. Dozens of such sites have opened in the last five years, with new ones across the country opening every few months.\nBeaverton, OR\nThe organization Just Compassion operates a Safe Parking program that launched in 2019.\nDenver, CO\nThe Colorado Safe Parking Initiative was the first metro area safe parking pilot site. It opened in spring 2020, and there were 13 SafeLots in 5 Metro Denver area counties. In December of 2024, the program ended due to lack of funds.\nGreensboro, NC\nGreensboro’s “Safe Parking Site,” opened in 2023, is the first free lot in the state for people living in their cars. It has a security guard and it’s directly behind the Interactive Resource Center where anyone can shower, do laundry and meet with caseworkers.\nGreen Bay, WI\nWise Women Gathering Place offers a Safe Place Parking program that provides a place to park overnight for people living in their vehicles.\nDuluth, MN\nSafe Bay is a secure overnight space for people living in their vehicles. The program was begun in 2023 and is open nightly from April to November. Safe Bay is a collaboration between Chum and Damiano Center, with support from HDC street outreach workers.\nSee also\n* Social services\n* Social welfare\nReferences"
    }
  ]
}