{
  "content": [
    {
      "type": "text",
      "text": "# Sahara India Pariwar\n\n(Gorakhpur, India)\n| founder = Subrata Roy\n| defunct =\n| location_city = Lucknow, Uttar Pradesh\n| location_country = India\n| locations =\n| area_served = Worldwide\n| key_people =\n| industry = Conglomerate\n| products = Financial servicesConstructionMass media and entertainmentReal EstateSportsPowerManufacturingDigital educationE-commerceElectric vehicleHospitalHospitalityLife insuranceArtificial intelligenceCo-operative societyRetailIT and outsourcing\n| services =\n| revenue =\n| operating_income =\n| net_income =\n| aum =\n| assets =\n| equity =\n| owner =\n| num_employees =\n| parent =\n| divisions =\n| subsid =\n| homepage =\n| footnotes =\n}}\nSahara India Pariwar (pariwar being Hindi for \"family\") is an Indian conglomerate headquartered in Lucknow, Uttar Pradesh, India. The group operates in numerous business sectors.\nLong accused of shady business practices including money laundering and running ponzi schemes, the group has been also referred to as \"India's Swiss Bank\". The group is currently embroiled in Sahara India Pariwar investor fraud case.\nBusinesses\nSahara India Pariwar was founded by Subrata Roy Sahara in 1978. In 2004, Sahara group was termed by the Time magazine as 'the second largest employer in India' after the state-owned Indian Railways. As of 2013, the  group operated more than 5,000 establishments across India with the employee strength around 1.2 million (both field and office) under the Sahara India umbrella.\nThe group has been also called \"the Swiss Bank of India\" where  \"the high and mighty keep their unaccounted money\".\nThe group has operated numerous business sectors such as finance, infrastructure & housing, real estate, sports, power, manufacturing, media & entertainment, health care, life insurance, educational institute, offline online education (edunguru), retail, E-commerce (online/offline shopping), electrical vehicle (Sahara evols), hospital, artificial intelligence, hospitality, and co-operative society. The group has been a major promoter of sports in India and was the title sponsor of the Indian national cricket team, Indian national hockey team, Bangladesh national cricket team, and Force India Formula One team among others.\nReal estate\nSahara India Real Estate Company and the Sahara Housing Investment Corporation are subsidiaries of the conglomerate. They buy and develop land for residential housing projects across India. The company has its projects spread almost all over India. Sahara has a collaboration with Turner Construction, an American building company, in some of its projects.\nElectric vehicles\nSahara India Pariwar announced the launch of Electric Vehicles under the brand name Sahara Evols in June 2019. The product line of Sahara Evols initially consists of motorbikes, scooters, e-rickshaws and 3-wheeler cargo vehicles, charging stations and EV batteries.\nSports\nSahara owns several professional sports teams in India in a variety of sports. In badminton, it owns the Awadhe Warriors of Lucknow, one of the eight teams in the Indian Badminton League. It owned the Pune Warriors India, a franchise cricket team that played in the Indian Premier League (IPL). They were also the sponsors for the indian cricket team.\nThe company launched the Sahara Warriors Polo Team in 2012. From 2005 to 2014 Calcutta Football League was sponsored by Sahara.\nIn July 2012, Sahara India Pariwar picked up the Lucknow franchise of the Hockey India League, the Uttar Pradesh Wizards. It was also the sponsor of the Bangladesh Cricket Team from 2012 to 2015.\nMedia and entertainment\nChannels\n{|class=\"wikitable sortable\"\n!Channel\n!Launched\n!Language\n!Category\n!SD/HD availability\n!Notes\n|-\n|Sahara One\n|2000\n|rowspan=\"7\"|Hindi\n|rowspan=\"2\"|General Entertainment\n|rowspan=\"9\"|SD\n|Formerly known as Sahara TV In 2000 and Sahara Manoranjan till 2003 to 2004\n|-\n|Firangi\n|2008\n|\n|-\n|Filmy\n|2006\n|Movies\n|\n|-\n|Sahara Samay\n|2003\n|rowspan=\"6\"|News\n|\n|-\n|Sahara Samay Bihar Jharkhand\n|rowspan=\"3\"|2005\n|\n|-\n|Sahara Samay Uttar Pradesh Uttarakhand\n|\n|-\n|Sahara Samay Madhya Pradesh Chhattisgarh\n|\n|-\n|Aalami Samay\n|2010\n|Urdu\n|\n|-\n|Sahara Samay Rajasthan\n|2013\n|Hindi\n|Replaced by Sahara Samay NCR\n|}\nThe group owns the national Hindi news channel Jain TV.\nThe group owns Headend-in-the-sky Platform Jainhits.\nHotels\n, 1920s postcard illustration]]\nSahara owned a controlling stake in New York's Plaza Hotel and Dream Downtown Hotel, New York. Sahara sold the hotel to Katara Hospitality in July 2018.\nIn India, the group owns the \"Sahara Star\" hotel near Mumbai's Chhatrapati Shivaji International Airport.\nFinance\nSahara has interests in insurance and asset management. Sahara India Life Insurance Company Ltd.- has been granted licence by the insurance regulator – the IRDAI on 6 February 2004. With this approval, Sahara India Life Insurance Company Ltd. becomes the first 100% wholly and purely Indian company, without any foreign collaboration to enter the Indian Life insurance market. The launch is with an initial paid-up capital of ₹157 crores. Sahara India Life Insurance Company Ltd. (SILICA) is a life insurance company in the private sector, Sahara Asset Management Company Pvt. Ltd. manages 16 equity and debt mutual funds. Sahara Banking & Financial Services Fund has been adjudged the Best Performing Banking Sector Fund over a three-year performance by the international agency \"Lippers\" in 2012.\nRetail\nOn 13 August 2012, Sahara India announced the opening of its retail FMCG business named 'Q shop' (Quality shop) with an initial investment of ₹3,000 crores. Sahara also announced hiring 6,00,000 sales personnel and 3,000 customer care executives. At its launch, Subrata Roy said that Sahara had been planning for this venture for the last two years and was opening 'Q shops' in major cities across the country to provide adulteration-free consumer merchandise including processed food and beverages to buyers. The group said it would set up 305 warehouses in 285 cities in a phased manner.\nSahara India Pariwar's Sahara Q Shop entered into the Guinness World Records when it opened 315 outlets in 10 states of India, at once on 1 April 2013.\nHealth care\nThe group owns a hospital in Lucknow by the name Sahara Hospital. This hospital became operational in February 2009 and is currently operating with approximately 350 beds, including 120 bed Critical Care Infrastructure which is expandable to 554 beds. Anil Vikram Singh, Sr. Advisor, Sahara India Pariwar, currently heads the hospital.\nInformation technology\nUnder the name \"Sahara Next\", the company offers information technology consulting services in banking, finance, media and entertainment, chemicals, and CRM.\nSubrata Roy has been planning to foray into online education in India, which is targeted at small towns and villages. He has put in place a team that consists of members from top universities and colleges across India and abroad. The route map of the program has been prepared, and 14,000 hours of lectures have been prepared for this. The group also announced on 1 July 2018, that it is entering into new businesses which are at different levels of development, and will be launched one after another in the year.\nFormer\nThe group owned an airline, Air Sahara, which it sold to Jet Airways in 2007.\nIn October 2011, Sahara purchased 42.5% of the Force India Formula One team. The team finished as best 4th in the constructors championship in 2016 and 2017.\ndriving the Force India VJM05 carrying Sahara branding]]\nThe team went into administration in mid-2018 and was later sold and renamed Racing Point Force India F1 Team.\nThe group runs a school in Pune, the International School Aamby – Aamby Valley.\nLegal issues\nBeing a largely unlisted company Sahara India Parivar's activities have come under criticism largely because of legal issues it is facing.\nSince 1990s, the Income Tax Department (IT) asserted that Sahara India Parivar is a money laundering operation. During their investigation, IT officials found many of the names and addresses of the depositors were fictitious. When IT officials asked Sahara to produce 62 depositors, the group could produce only 12 depositors. On 8 February 1997, IT department stated Sahara did not deny that leading politicians deposited their black money with it.\nOn 26 February 2014, the Supreme Court of India had issued warrants to summon Subrata Roy, Managing Worker, chairman and founder of Sahara India Pariwar, on a litigation on the Optionally Fully Convertible Debentures issued by the two companies of Sahara India Pariwar to which Securities and Exchange Board of India had claimed its jurisdiction and objected on why Sahara has not taken permission from it. Sahara has claimed that the said bonds are hybrid product, thus does not come under the jurisdiction of SEBI, instead is governed by Registrar of Companies (ROC) under Ministry of Corporate Affairs, from which the two companies of Sahara has already taken permission and submitted the red herring prospectus with ROC before issuing the bonds.\nSEBI in return ordered Sahara's two companies to stop issuing the said bonds and return money to investors. Sahara contested the case in various courts which eventually came to Supreme Court of India. On 14 June 2012, (during the final hearing of the case), the group had provided details of its financials up to 30 April 2012. While the court reserved its order, Sahara claims that it has already paid to 95% of the investors and discharged its OFCD liability to the tune of  and only around  are left against which Sahara has already deposited more than  which has with interest swelled to . By 31 August 2012 the date of Supreme Court order, the group repaid majority of its OFCD investors between May the last date of hearing and by 30 August 2012 the final order. Since these repayments have not been taken into consideration, Sahara maintains that any money paid now will obviously mean a double payment towards one liability.\nIt is also been reported that Sahara has paid  as TDS (tax deducted at source) to the Income Tax Departments on the interest which along with investment was repaid to 95 percent of the investors, between 2009–10 and 2012–13. The income tax authorities had found that the beneficiary investors were existent and accordingly confirmed the repayments made in those particular years. One of Sahara's arguments in the apex court revolves around the fact that if one government body has found investors, why can't the other.\nThe case itself comprises big numbers such as collection of over  from three crore individuals, while once in 2013 Sahara sent 127 trucks containing 31,669 cartons full of over three crore application forms and two crore redemption vouchers to SEBI office. Apparently, this had resulted into a huge traffic jam on outskirts of Mumbai, where the regulator is headquartered. SEBI on the other hand because the trucks reached after office hours SEBI rejected the second batch of files, which as per Sahara contained 25% of the investor information.\nFurthermore, the market regulator SEBI advertised four times in more than 144 newspapers to ask the investors of Sahara to refund the money. And since August 2012 Sebi has only refunded  to the investors while it has  from Sahara. In October 2014, a shocking revelation was made when only around 4,600 investors in two Sahara group companies had come forward to claim refunds from the Securities and Exchange Board of India (SEBI), which had asked those who had purchased bonds issued by the entities to claim their money. This gave a valid point to Sahara's argument before courts that it had repaid most of the investors who had come forward to claim the investment which they had made in bonds issued by two group companies.\nHe was granted interim bail by the Supreme Court on 26 March 2014 on the condition that he would deposit the huge bail amount of . Subrata was eventually taken into judicial custody and sent to Tihar jail, along with two other Sahara directors, on 4 March 2014 for failing to deposit  with SEBI. In Tihar jail, Subrata unsuccessfully tried to sell some of his hotel properties to raise  for his bail bond. He remained in Tihar jail for more than two years, and was released on parole in May 2016 to attend the last rites of his deceased mother.\nRoy rejected allegations of misconduct and accused the Indian National Congress of a witch hunt due to his opposition to Sonia Gandhi becoming the country's prime minister.\nIn January 2017, Income Tax Settlement Commission (ITSC) granted Sahara immunity from prosecution and penalty after the raids it carried out on November 2014 during which the Sahara-Birla Papers listing alleged bribes to politicians were recovered. Rahul Gandhi criticised this Prime minister Narendra Modi over this move and asked, \"Immunity for Sahara or immunity for Modiji?\"\nOn 1 July 2018, the group revealed that majority of  of Sahara's money (including the interest) which is with SEBI will be refunded back to Sahara India as the group had already made majority of the payments to its investors. The group also stated that SEBI will be directed to start the verification of the documents of Sahara's investors, which are already provided to them by Sahara India Pariwar. Despite the double payment for single liability, Sahara India has been continuously depositing money of around ₹20,000 crore (including interest earned) in Sahara-Sebi account.\nCharitable work\nThe Sahara Welfare Foundation, the social development unit of Sahara India Pariwar, runs social welfare projects. The company assisted the families of Indian soldiers killed in the Kargil War with a commitment of ₹50 crore (US$10.65 million )\nThe company claims to have assisted families whose homes were damaged in the 2006 Gujarat earthquake. Other welfare activities include water purification systems and education resource systems in Indian villages.\nIn 2013, Sahara contributed to the relief efforts in flood-hit Uttarakhand region wherein 100,000 bottles of drinking water, juice bottles and food packets along with candles and match boxes were said to be provided by them. There were 25 medical health unit vans equipped with doctors and free medicines made available and It was said by the group that, they will contribute to the rehabilitation program by constructing 10,000 pre-fabricated houses.\nWorking towards eradicating hunger and malnutrition in India, Sahara India Pariwar's Hotel Sahara Star based in Mumbai joined hands with Feeding India to provide food to the underprivileged communities.\nGuinness World Records\n* Sahara holds the record for the most people singing a national anthem simultaneously. 121,653 employees of the company sang India's national anthem on 6 May 2013 in Lucknow, India.\n* Sahara India Pariwar's Sahara Q Shop entered into the Guinness World Records when it opened record 315 outlets in 10 states of India, all at once on 1 April 2013.\nReferences\nExternal links\n*"
    }
  ]
}