{
  "content": [
    {
      "type": "text",
      "text": "# Sahl Swarz\n\n| birth_place        = New York City, U.S.\n| death_date         =\n| death_place        = Pietrasanta, Lucca, Italy\n| education          = SculptureCenter, Art Students League of New York\n| occupation         = Sculptor, arts educator\n| spouse             = Naoco Kumasaka (m. 1978–2004)\n}}\nSahl Swarz (May 4, 1912 – October 24, 2004) was an American sculptor and arts educator. His preferred materials were steel and bronze.\nBiography\n(1952), Colonial Circle, Buffalo, New York|alt=Bidwell statue in Buffalo (1952)]]\nSahl Swarz was born on May 4, 1912, in New York City, to Jewish Jewish emigrants from the Austrian part of partitioned Poland.\nHe studied under the instruction of Dorothea H. Denslow of The Clay Club (now known as SculptureCenter), of which Swarz was assistant director from 1936–1948, where he also headed the welded sculpture department for years. One of his students was sculptor Barbara Lekberg. He also studied at the Art Students League of New York.\nHe taught sculpture at the University of Wisconsin and Columbia University. He received the Arts and Letters Awards in art (1955), and twice Guggenheim Fellowship recipient (1955, 1958).\nIn 1978, he married sculptor , and they moved to live in Japan and later in Verona, in the province of Lucca, Italy. In 1998, he moved to Pietrasanta, in province of Lucca, Italy.\nSwarz died on October 24, 2004, in Pietrasanta, Italy.\nPublic works\n*Freemen Prosper and Defend Freedom (1948), two wooden sculptures, U.S. Post Office and Federal Building, Statesville, North Carolina\n*Statue of Gen. Daniel Davidson Bidwell (1952), Colonial Circle, Buffalo, New York; see image\n*The Guardian (1937), Brookgreen Gardens, Murrells Inlet, South Carolina; depicting a young male standing with a long bow and a dog sitting at his feet\n*Fountain, Pittsfield, Massachusetts; removed in 1980 due to maintenance issues\nPublications\n*\n*\n*Sahl Swarz 1912 -2004: Retrospective of His Life Work, Museum of Contemporary Sculpture, Tokyo, 2007\nReferences"
    }
  ]
}