{
  "content": [
    {
      "type": "text",
      "text": "# Saint-Gaudens National Historical Park\n\n| mapframe = yes\n| area =  federal\n| built = 1817 (main house)\n| builder = Augustus Saint-Gaudens\n| designated_nrhp_type = August 31, 1964\n| designated_nrhp_type2 = June 13, 1962\n| added = October 15, 1966\n| visitation_num = 26,943\n| visitation_year = 2005\n| website =\n| refnum = 66000120\n| increase = October 2, 2013\n| increase_refnum = 13000802\n}}\nSaint-Gaudens National Historical Park in Cornish, New Hampshire, preserves the home, gardens, and studios of Augustus Saint-Gaudens (1848–1907), one of America's foremost sculptors. The house and grounds of the National Historic Site served as his summer residence from 1885 to 1897, his permanent home from 1900 until his death in 1907, and the center of the Cornish Art Colony. There are three hiking trails that explore the park's natural areas. Original sculptures are on exhibit, along with reproductions of his greatest masterpieces. It is located on Saint-Gaudens Road in Cornish,  off New Hampshire Route 12A.\nHistory\nSaint-Gaudens purchased the property in 1885 at the urging of Charles Cotesworth Beaman Jr., a friend and New York City lawyer, who had purchased the nearby Blow-Me-Down Farm (now also part of the historic site) and established it as a summer residence. Saint-Gaudens called his retreat \"Aspet\", after the town of his father's birth in France. Saint-Gaudens established a studio, and produced work here every summer, and lived here year-round from 1900 until his death in 1907.  After the death of Saint-Gaudens' wife Augusta in 1926, Aspet was transferred to the Saint-Gaudens Memorial, a non-profit organization, established by Augusta Saint-Gaudens in 1919. The Memorial ran the property as a museum from 1927 until it was transferred to the National Park Service (NPS) in 1965. The Trustees of the Memorial continue to support the preservation and development of the park and to provide public programming.\nThe estate was declared a National Historic Landmark in 1962 and administratively listed on the National Register of Historic Places on October 15, 1966. The Saint-Gaudens National Historic Site was authorized by Congress on August 31, 1964, and established on May 30, 1977. Besides a portion of the Appalachian National Scenic Trail, this is the only NPS site in New Hampshire. The NPS later acquired two adjacent properties associated with Saint-Gaudens and the Cornish Art Colony, which were formally incorporated in the National Historic Site in 2000. In 2010, an adjacent property known as \"Blow-Me-Down-Farm\", formerly owned by Charles Cotesworth Beaman Jr., was donated to the NPS by the Saint-Gaudens Memorial, a non-profit operating partner of the Saint-Gaudens National Historical Park. The John D. Dingell Jr. Conservation, Management, and Recreation Act, signed into law March 12, 2019, redesignated the national historic site as a national historical park.\nDescription\nThe centerpieces of Aspet are its main house, built 1816–17 with Federal styling, which underwent a series of alterations by Saint-Gaudens, with design work by George Fletcher Babb, and the Little Studio, also designed by Babb and built in 1903–04 to replace earlier studios. The grounds are landscaped with hedges and terraced gardens, in which reproductions of works by Saint-Gaudens are displayed. The gardens were designed by Saint-Gaudens and landscape architect Ellen Shipman. The grounds also include an outdoor room, the Pan Grove, a collaborative design of Babb and Saint-Gaudens, featuring an 8-foot by 4-foot green marble pool set in a birch grove with a statue of the Greek god Pan.\nArtists-in-residence\nSaint-Gaudens has had a sculptor-in-residence since 1969, the oldest continuous artist residency in the National Park Service.\nAmerican sculptor Lawrence Nowlan was an artist-in-residence at Saint-Gaudens for five summers from 1995 to 1997 and again from 2001 to 2002. He received his first major commission to design the Wildland Firefighters National Monument while working and studying at Saint-Gaudens.\nThe 2023-2024 Sculptor-in-Residence is Davis Fandiño.\nSee also\n*List of National Historic Landmarks in New Hampshire\n*List of single-artist museums\n*National Register of Historic Places listings in Sullivan County, New Hampshire\nReferences\n* The National Parks: Index 2001–2003. Washington: U.S. Department of the Interior.\nExternal links\n* [https://www.nps.gov/saga/index.htm Official website]\n* [http://www.sgnhs.org/ Trustees of the Saint-Gaudens Memorial]\n* [https://web.archive.org/web/20070817134849/http://www.nps.gov/history/nr/twhp/wwwlps/lessons/48GAUDENS/48GAUDENS.htm Saint-Gaudens National Historic Site: Home of a Gilded Age Icon, a National Park Service Teaching with Historic Places (TwHP) lesson plan]\n*[http://libmma.contentdm.oclc.org/cdm/compoundobject/collection/p15324coll10/id/34389/rec/62 Augustus Saint-Gaudens, Master Sculptor], exhibition catalog fully online as PDF from The Metropolitan Museum of Art"
    }
  ]
}