{
  "content": [
    {
      "type": "text",
      "text": "# Saint Edward's School\n\nSt Edward's School}}\n| mapframe = yes\n| established =\n| us_nces_school_id =\n| opened =\n| accreditation = NAIS, FCIS, NAES\n| type = Independent, college-prep\n| grades = Pre-K–12\n| head_of_school = Stuart Hirstein\n| enrollment = 583, including 20 preschool students\n| enrollment_as_of = 2019-20\n| teaching_staff = 55.1\n| ratio = 10.1\n| campus = Midsize suburb\n| campus_size =\n| team_name = Pirates\n| newspaper =\n| yearbook = The Crow's Nest\n| gender = co-ed\n| religious_affiliation = Episcopal\n| colors = Blue and white\n| website =\n| footnotes =\n}}\n'''Saint Edward's School''' is a coeducational independent college-preparatory school in Vero Beach, Florida, United States. It enrolls children grades pre-K through 12.\nHistory\nThe school was incorporated in 1964 and opened on September 22, 1965, to 31 students in grades five through eight.  It is affiliated with the Episcopal Church. Dale Sorensen served as the second head of the school and stabilized the finances at the fledgling school.\nThe school expanded aggressively in the 90s with an enrollment of over 900 students. Multiple construction projects in 1999, combined with a sagging economy, triggered severe financial problems and school accrued a large debt by the early 2000s. Michael Mersky, who was appointed the 7th head of the school in 2009, launched an ambitious fund raising effort for the Pirate Fund and by mid-2010, school announced that it has successfully gotten rid of the debt. Part of the school restructuring necessitated selling the lower school campus, which was then situated in Riomar country club.\nIn the year 2010, the campus was changed to a \"one campus school\", eliminating the lower school campus, and bringing everyone onto the middle and upper school campus.\nAcademics\nA total of 27 AP classes were offered in the 2015–2016 school year.\nFacilities\nThe 26-acre campus is located on the Indian River Lagoon. School facilities include an 800-seat theater, a water complex, two gyms, two libraries, fine arts center with music and arts studios, athletic playing fields, and eight science labs. The school library is named for Peter Benedict who served as the head of the school from 1971 to 1995.\nThe school operates the Waxlax Center for the Performing Arts, an 800 seat proscenium theater. It opened in May 2000 and was renovated in 2008.\nNotable alumni\n*Lake Bell, actress, writer and director\n* Prince Fielder, professional baseball player\n*Punam Patel, actress\n*Tom Segura, comedian\nReferences\nExternal links\n*"
    }
  ]
}