{
  "content": [
    {
      "type": "text",
      "text": "# Sakhi Sarwar (saint)\n\n| titles          =\n| birth_date      = 1128\n| birth_place     = Shahkot, Jhang, Punjab\n| death_date      = 1174\n| death_place     = Sakhi Sarwar, Dera Ghazi Khan, Punjab\n| venerated_in    = Sufism\n| major_shrine =\n| spiritual_master      =\n| disciples      =\n}}\nSakhi Sarwar was a Punjabi Muslim Sufi saint who is believed to have lived in the Punjab region during the 12th century.\nIn the colonial Punjab, the shrine of Sakhi Sarwar attracted Muslim, Hindu and Sikh devotees alike and held special significance for Sikhs of Punjab. He features prominently in the Punjabi Sufism.\nBiography\nIn spite of the popularity of the Sarwar cult in Punjab, especially during the 19th and 20th centuries, there is no reliable biographical account about Sakhi Sarwar. It is difficult to ascertain whether he was a historical or a mythical personality.\nAccording to a myth prevalent in the 19th century Punjab, he was born to Syed Zain-ul-Abidin in 1128 at Shahkot in Jhang. His real name was Syed Ahmad Sultan, and his mother was a daughter of a Khokhar herdsman from a neighbouring village. Due to a feud with his family, he left for Baghdad and later travelled to various parts of Punjab. He shifted to the village of Nigaha in the Dera Ghazi Khan, where he was killed by his relatives in 1174. According to another myth, he was killed due to enmity with Jats and Pathans when he married a daughter of an Afghan chief.\nShrines\nDera Ghazi Khan\nSakhi Sarwar is also known by various other appellations such as Sultan (king), Lakhdata (bestower of millions), Lalanvala (master of rubies), Nigahia Pir (the saint of Nigaha) and Rohianvala (lord of the forests). His followers are known as Sultanias or Sarwarias. Sakhi Sarwar's shrine was originally built during the reign of Mughal emperor Aurangzeb, and was later reparated by two non-Muslims Lakhpat Rai and Jaspat Rai in 1730. Before independence of Pakistan in 1947, devotees from Jalandhar, Hoshiarpur and Gurdaspur areas would come to his main shrine  to seek spiritual blessings.\nNigaha\nThe saint selected the town of Nigaha to settle down and live there. It is known as the ‘last place’ because of the hostile geographical and climatic condition. According to Rose (1970), the buildings of the shrine consist of Sakhi Sarwar's tomb on the west and a shrine associated with Guru Nanak Dev Ji on the north-west. On the east is an apartment containing a stool and spinning wheel of Mai Ayesha, Sakhi Sarwar's mother. Nearby is Thakurdwara, and in another apartment is an image of Bhairava.\nWithin the enclosures of the shrine are the tombs of Sakhi Sarwar, his wife, known as Bibi Bai, and of the jinn he was said to have held in his power and who was reportedly credited with making many miracles happen for him.\nNear the shrine at Nigaha, there are two other holy spots called Chom and Moza, both associated with Murtaza, the son-in-law of Sakhi Sarwar. At Chom, an impression of the former's hand was said to have been imprinted when he prevented a mountain from collapsing over the cave in which he had taken shelter.\nTo the west of the outhouses and within the shrine enclosure are two dead trees said to have sprung from the pegs which were used for the head and heel ropes of Kaki, the saint's mare.\nOther places\nOther shrines in his honor are situated at Dhaunkal in Wazirabad district, and also in Peshawar and Lahore.\nThere are numerous shrines in the Indian Punjab where they are known as Nigaha. At some places, Sakhi Sarwar is worshiped along with Gugga and their common shrines along with other deities are known as Panj Pirs or Nigahas.\nThe shrine of Baba Lakhdata at district Una in Himachal Pradesh is known as Chotta (minor/small) Nigaha where a large fair is organised every year.\nFollowers\nHis followers who visit  the Pir's shrine at Nigaha are known as sang who refer to each other as bharais. The drumbeating bards who act as professional guides and priests at local shrines are called pirkhanas. Members of a sang address each other as pirbhaior and pirbahin (brother or sister in faith respectively).\nTheir halting points on the routes are known as chaukis (posts) where the pilgrims traditionally slept on the ground. Devotees unable to undertake the pilgrimage to Nigaha would attend at least one of the chaukis. If they could not, they went to any other village on the route for a night. Those who could not go anywhere at all slept on the ground at home for at least one night in a year.\nThis ritual of sleeping on the ground instead of on a cot is called chauki bharna.\nFairs\nVarious fairs are held in the Punjab region. The shrine at Nigaha holds a week-long Baisakhi fair in the month of April.  Fairs are also held at Dhaunkal in Gujranwala district during June/July, at Jhandon Wala Mela (fair of the flags) at Peshawar, and Qadmon Wala Mela (fair of the feet) at Lahore.\nA common ritual which is traditionally observed is to offer a raut, (a huge loaf prepared from 18 kilograms of wheat flour sweetened with jaggery weighing half that quantity) once a year on a Friday.\nThe raut is traditionally prepared by a Bharai, who take one fourth of the rotas offering, the remaining being consumed by the donor family and distributed among fellow Sultanias (followers of Sakhi Sarwar).\nA famous fair known as \"Chaunkian da Mela\" is held in Mukandpur to commemorate Sakhi Sarwar's visit Balachaur, starting his journey from Rattewal and reaching Mukandpur where Sakhi Sarwar reportedly stayed for nine days. Since then, this fair is held in Mukandpur and lasts for nine days. A \"Saang\" starts from Rattewal and reaches Mukandpur. The leader of the \"Saang\" holds a flag which is called a \"Togh\".\nReferences\nExternal links"
    }
  ]
}