{
  "content": [
    {
      "type": "text",
      "text": "# Sakura Wars 2: Thou Shalt Not Die\n\n}}\n| publisher =\n| producer = Noriyoshi Ohba\n| director =\n| designer = Chie Yoshida\n| programmer = Yuichi Matsuoka\n| artist =\n| writer = Satoru Akahori\n| composer = Kohei Tanaka\n| series = Sakura Wars\n| platforms = Sega Saturn, Dreamcast, Windows, PlayStation Portable\n| released = |\nSaturn Dreamcast Windows PlayStation Portable}}\n| genre = Tactical role-playing, dating sim, visual novel\n| modes = Single-player\n}}\nis a cross-genre video game developed by Red Company and Sega, and published by Sega for the Sega Saturn. The second installment in the main Sakura Wars series, it was released in April 1998 and later ported to other systems, including to the Dreamcast in September 2000. Defined as a \"dramatic adventure\" game, Sakura Wars 2 combines overlapping tactical role-playing, dating sim and visual novel gameplay elements.\nTaking place one year after the events of the original Sakura Wars, the game follows the protagonist, Imperial Japanese Navy Ensign Ichiro Ogami, and the all-female Flower Division of the Imperial Combat Revue as they fight against new supernatural entities in Tokyo as well as hostile political forces led by Keigo Kyogoku, the story's main antagonist.\nDevelopment of Sakura Wars 2 began following the critical and commercial success of the first game. The game was directed by Akira Nishino and Hirotada Hashimoto, written by Satoru Akahori and produced by veteran Sega designer Noriyoshi Ohba. The characters were designed by Kōsuke Fujishima and Hidenori Matsubara, the anime FMV sequences were produced by Production I.G, and the music was composed by Kohei Tanaka. The game's subtitle was taken from a famous war poem by Japanese writer Akiko Yosano. The game went on to become the best-selling entry in the series, and was positively reviewed by critics. A direct sequel, Sakura Wars 3: Is Paris Burning?, was released for the Dreamcast in 2001. An English-language fan translation was released in 2025.\nGameplay\nSakura Wars 2: Thou Shalt Not Die is a cross-genre video game in which the player controls Ichiro Ogami and the all-female \"Flower Division\" of the Imperial Combat Revue, whose objective is to stop Keigo Kyogoku from conquering Japan. Dubbed a \"dramatic adventure\" game and taking place across 13 episodes, the gameplay segments incorporate tactical role-playing, dating sim and visual novel elements. Gameplay is divided between periods where Ogami navigates the Grand Imperial Theater and interacts with various characters, and combat sequences governed by a turn-based battle system upon a tilted grid-based battlefield.\nDuring the social sections between battles, Ogami navigates the theater. During interactions with both the Flower Division and supporting characters within the Imperial Combat Revue, conversations relies on the series' LIPS (Live & Interactive Picture System) system, in this game dubbed \"Double LIPS\". When faced with critical choices in the course of a conversation, dialogue options are displayed with a time limit for the player to select a response. Depending on the type of response, the character may respond positively or negatively, impacting their relationship with Ogami and future interactions. The strength of each character's bond with Ogami is represented by a bar below the dialogue box. In addition to normal LIPS segments, Ogami can engage in conversations with multiple characters, the result of which also impacts character relationships, and new responses appearing mid-conversation depending on earlier choices. Other actions within LIPS include holding the cursor over parts of a character's portrait to trigger internal monologues and varying responses from the characters. Each main heroine has different personality quirks that must be taken into consideration while talking with them.\nDuring combat segments, the Flower Division fight using machines called Kobus. Each unit has their own turn, with each turn allowing two actions. These actions include \"Attack\", \"Defend\", \"Move\", \"Deathblow\" (a critical strike that kills an enemy in one hit), Charge (store energy for a more powerful action during the next turn), and Heal (which restores health points to a chosen unit). Different units specialize in different skills, such as support actions, melee attacks, or distance attacks—along with their range of movement, each unit also has an independent range in which they can perform actions. Each unit's critical strike is accompanied by a dedicated cinematic. The player can also issue Commands in battle to make the Flower Division take specific battle formations, and two units can pair up for a powerful attack on a single enemy. Actions taken during LIPS sequences with members of the Flower Division directly impact battles; skillful performances during LIPS segments raise a character's Trust, granting status increases and improving combat ability.\nSynopsis\nIn 1925, Imperial Navy Ensign Ichiro Ogami returns from training overseas and reunites with his companions in the Imperial Combat Revue's Flower Division, a section of the Imperial Army who use their spiritual power to defend Tokyo from supernatural threats while also performing as a theater troop. Soon after Ogami's return, the Flower Division are confronted by a group of black magicians dubbed the Black Demons, led by their earlier nemesis Shinnosuke Yamazaki. The group defeat Yamazaki, who is then killed by the Black Demons' true leader, a masked man dubbed the Demon King. The Flower Division recruit two new members during their fight—the aristocratic Japanese-Italian Orihime Soletta, and the emotionally-distant German Reni Milchstrasse.\nDuring their continued efforts against the Black Demons, Yoneda is shot by a sniper and incapacitated. While he recuperates, Yoneda is replaced by Kaede Fujieda, the sister of Ayame Fujieda. With its position weakened, the Imperial Combat Revue come under political pressure from a military faction opposed to their existence. The faction is led by Keigo Kyogoku, a former Imperial Army officer turned formidable and callous politician. Kyogoku is revealed as the secret leader of the Black Demons, and the Flower Division are forced into hiding when Kyogoku launches a military coup d'état against Tokyo's government and the group's theater base.\nAs the Imperial Combat Revue continue to fight against the Black Demons, they learn that Kyogoku has orchestrated events to reactivate Musashi, a dormant magical weapon, and rule as Japan's emperor. The Flower Division, supported by Yoneda and Kaede leading the remains of the Imperial Combat Revue, launch an assault on Musashi using their ship, the Mikasa. Sakura faces off against the Demon King himself—his defeat reveals him to be Sakura's resurrected father Kazuma Shinguji, who is dealt a fatal blow protecting Sakura from Kyogoku. The combined power of Sakura and Ogami disables Musashi, and the Imperial Combat Revue then kills Kyogoku, causing Musashi to collapse as a result. Following a promotion to Lieutenant in honour of his actions, Ogami is dispatched to Paris to train a new Combat Revue there.\nDevelopment\nThe original Sakura Wars was considered an ambitious project, and many of its core staff did not think would be a commercial success. Upon release, however, it was both a critical and commercial success. In response to the game's success, Sega and Red Company (now Red Entertainment) began expanding Sakura Wars into a franchise, which included producing a sequel. The game was co-developed by Red Company and Sega's CS Research & Development No. 2 division, who had produced the original game. Series creator Oji Hiroi returned as general producer, Tomoyuki Ito as chief director, Satoru Akahori as writer, Hidenori Matsubara and Kōsuke Fujishima as the character designers, and Kohei Tanaka as composer. Takaharu Terada, who would later work on the PlayStation 2 remake of Sakura Wars, acted as battle designer.\nThe development team used the basic work done for Sakura Wars while expanding and improving existing battle and dialogue functions, in addition to taking player feedback into consideration while making alterations. The amount of added content resulted in the number of discs increasing from two to three. The main storyline was darker than that of Sakura Wars, featuring political elements and more tragic scenarios related to the main cast. Kyogoku's attempted coup was based upon the February 26 Incident. The game's subtitle was taken from the title of a famous anti-war poem written by Japanese author and poet Akiko Yosano, tying into the game's themes and story. The animated cutscenes were directed by Shinji Takagi and produced by Production I.G. Sakura Wars 2 was their first work on the Sakura Wars series. The studio were brought aboard the project after Hiroi saw their film Ghost in the Shell, but nearly refused as the game was halfway through development.\nAudio\nTanaka returned as sole composer and musical director. While there are some live tracks, most are synthesised music using the Saturn's sound chip. For Sakura Wars 2, Tanaka aimed to create a sound to surpass the original game. He wanted the synthesised music to be as close as possible to live music within the Saturn's hardware restrictions.\nThe main cast reprised their roles from the first game. This included Ai Orikasa, who had voiced the character Ayame Fujieda—who died during the events of the first game—and returned playing Ayame's twin sister Kaede. After finishing recording Ayame's part for Sakura Wars, Orikasa assumed she would not be used for future games, but she was surprised when asked to return. Two new cast members were added in the form of Orihime and Reni, voiced respectively by Maya Okamoto and Kazue Ikura. Ikura received an audition paper for the role asking for someone who could play a boy's role, perform songs and read musical notation.\nSpeaking about the songs, Tanaka described them as being themed around the characters' inner thoughts and what they would sing. Tanaka enjoyed writing Iris's new song, but Hiroi had trouble writing lyrics for it. Orihime's song was set to a waltz, with the tone being to show the character as different from Sumire though both fitted the Japanese \"tsudere\" archetype. Leni's theme was a subdued piece, with Tanaka writing in the key of D-flat to suit Ikura's voice without thinking of Reni's character. The opening theme was a new version of the first game's opening \"Geki! Teikoku Kagekidan\", performed by Chisa Yokoyama, Urara Takano, Michie Tomizawa, Kumiko Nishihara, Yuriko Fuchizaki, Mayumi Tanaka, Okamoto and Ikura. The ending theme, \"Continuation of the Dream\", was performed by Yokoyama, Takano, Tomizawa, Nishihara, Fuchizaki, Tanaka, Okamoto, Ikura and Ai Orikasa. \"Continuation of the Dream\" remains Tanaka's favorite theme.\nRelease\nSakura Wars 2 was first announced in October 1997. The game was released for the Sega Saturn on April 4, 1998. A later port for the Dreamcast released on September 21, 2000. It was later ported to Microsoft Windows personal computers (PC). It was released for Windows 95, Windows 98, Windows ME and Windows 2000 systems on March 1, 2001; and for Windows XP on March 20, 2003. Due to the game's size, these versions were released on multiple CD-ROMs. A DVD-ROM version was released for Windows 2000, Windows XP and Windows Vista on January 25, 2007. It was ported with the original game to the PlayStation Portable (PSP) and released on March 9, 2006.\nWider localization efforts for the series were prevented due to Sega's uncertainty as to whether the game's blend of genres would find a profitable audience outside Japan. An attempt to localize the game's PSP port by an unspecified company were halted when Sony refused to approve the project. The PC version was twice licensed for release outside Japan; a Chinese version was released in Taiwan and mainland China by Dysin Interactive on August 17, 2001 and a Russian translation was published by Akella on December 24, 2008. The Chinese launch of Sakura Wars 2 was intended as a springboard for Sega to bring Sakura Wars to North America and Europe.\nAn English-language fan translation of the Saturn version of the game was released in April 2025, produced by a group of translators who had previously released an unofficial localization of the first game in 2019. The project entered development in 2021 and took four years to complete.\nReception\nDuring its first week on sale, Sakura Wars 2 sold 500,000 units. According to Weekly Famitsu, Japan bought 501,066 units of Sakura Wars 2 during the first half of 1998, which made it the country's eighth-best-selling game for the period. Its total sales by August 1998 reached 577,000 units in Japan, where it became the fifth best-selling Saturn title of all time. The Dreamcast port sold over 63,000 units in its first week on sale, selling through nearly 70% of its shipments. The port eventually sold a total of 154,837 units. As of 2008, Sakura Wars 2 is the best-selling video game in the Sakura Wars series. The game sold a combined |}} units across the Saturn and Dreamcast in Japan.\nJapanese gaming magazine Famitsu gave the game a score of 33/40, with the title generally receiving praise for its polished mechanics and storyline despite a lack of innovation. Due to its Japanese exclusivity, some of the English-language reviews for Sakura Wars 2 were published years after the initial release. RPGFan felt that Sakura Wars 2 surpassed the original in terms of gameplay polish and story, praising the revamped character design while noting lagging during gameplay. At the 1998 Animation Kobe event, Sakura Wars 2 was awarded in the \"Packaged Work\" category alongside the original video animation (OVA) series Sakura Wars: The Gorgeous Blooming Cherry Blossoms.\nLegacy\nAn OVA series titled Sakura Wars: The Radiant Gorgeous Blooming Cherry Blossoms was released between 1999 and 2000, produced by Radix Ace Entertainment and supervised by Red Company. Set during the ending of Sakura Wars 2 when Ogami prepares to leave for Paris, the six-episode OVA tells side stories about the Flower Division during the events of both Sakura Wars and Sakura Wars 2.\nSakura Wars 2 was the last entry in the series developed for the Saturn, as the next entry—Sakura Wars 3: Is Paris Burning?—was developed for the Dreamcast, releasing in 2001. Ogami's foreign travels portrayed in Sakura Wars 3 were intended to continue into the next entry, but due to the discontinuation of the Dreamcast, the concept was reworked and Sakura Wars 4: Fall in Love, Maidens released in 2002 as the culmination of the series on Sega consoles. The original plans for Sakura Wars 4 were carried over to the next entry for the PlayStation 2, released overseas as Sakura Wars: So Long, My Love.\n}}\nExternal links\n*   (Dreamcast)"
    }
  ]
}