{
  "content": [
    {
      "type": "text",
      "text": "# Salaverry-Santa Cruz War\n\nPeruvian Civil War|and|Peruvian–Bolivian War (disambiguation)Peruvian–Bolivian War}}\nOrbegosistas   Crucistas\nSupported by:   France  Republic of Iquicha  Pipiolos\n| image             = Peru (1835–1836).svg\n| image_size        = 350px\n| caption           = Map of the Bolivian campaign during the conflict.\n| combatant2        = Anti-Confederation:(Conservatives)  Salaverristas   Gamarristas\nSupported by:  Argentina  Chile  Spain   Limeños and Arequipeños\n| commander1        =  Luis Jose de Orbegoso Andres de Santa Cruz José Miguel de Velasco José Trinidad Morán Anselmo Quiroz Francisco Anglada Blas Cerdeña José Ballivián Otto Philipp Braun Francisco Burdett O'Connor\n| commander2        =  Felipe Salaverry  José Quiroga Juan Bautista Eléspuru Juan Pablo Fernandini Manuel Ignacio de Vivanco Manuel de Mendiburu Carlos del Postigo Agustín Gamarra\n| strength1         = 5,000\n| strength2         = 3,500 (Salaverry's forces)12,000 (Gamarra's forces)\n| conflict          =\n}}\nThe Salaverry-Santa Cruz War, sometimes called the Peruvian Civil War of 1835–1836, was an internal conflict in Peru with the involvement of the Bolivian army of Andres de Santa Cruz. It ended with the defeat and execution of Felipe Santiago Salaverry and the creation of the Peru-Bolivian Confederation.\nContext\nIn 1834, a civil war had been fought between Pedro Pablo Bermúdez and Agustín Gamarra on the one hand against Luis José de Orbegoso and Felipe Salaverry on the other hand. The war was won by the constitutional President Luis José de Orbegoso.\nIn 1835, while President Luis Orbegoso was travelling to the south, his former ally General Felipe Salaverry proclaimed himself Supreme Head of the Republic on 23 February 1835, deposing Orbegoso. Orbegoso fled to Bolivia and asked Andrés de Santa Cruz, president of Bolivia, for his support to overthrow the Salaverry government.\nSanta Cruz was alarmed by Salaverry's coup, who also received the support of his former enemy General Agustín Gamarra.\nSanta Cruz agreed to invade Peru to overthrow them, since Orbegoso would not be able to confront Salaverry and Gamarra alone.\nBattles\nThere were 4 major battles in this war:\n*The Battle of Yanacocha (13 August 1835), where Santa Cruz defeated Agustín Gamarra and Santa Cruz's army lost 211 men and 71 wounded, while Gamarra's army lost 400 men and 985 taken prisoner.\n*At Cobija on 24 September, where Felipe Salaverry conquered the Bolivian port.\n*The Battle of Uchumayo (Arequipa) on 4 February 1836, where Salaverry defeated Santa Cruz and Santa Cruz's army lost 315 men.Basadre, Jorge (1961). Historia de la República del Perú. Tomo I. Lima: Ediciones Historia, pp. 304. En 1828 a la espera de firmarse un tratado de paz se estimaba que el ejército peruano era de unos 8.000 hombres y su contraparte boliviano de 4.000, ambos de firmar deberían reducirse a la mitad. Basadre, Jorge (2002) [1929]. La iniciación de la república: contribución al estudio de la evolución política y social del Perú. Tomo I. Lima: UNMSM, pp. 205. . Finalmente, según el Tratado de Tiquina (25 de agosto de 1831) Perú y Bolivia acordaron reducirlos a 5.000 y 3.000 hombres respectivamente, aunque cuando el 8 de noviembre en Arequipa acordaron dejarlos en solo 3.000 y 1.600 unidades.\n*At Socabaya (Arequipa) on 7 February 1836, where Santa Cruz defeated Salaverry in one of the bloodiest battles in the history of Peru. In this battle Salaverry, self-proclaimed President of Peru, was taken prisoner and shot in the plaza of Arequipa.\nConsequences\nAfter the civil war was won, Santa Cruz and Orbegoso merged their two countries into the Peru–Bolivian Confederation. This alarmed neighboring countries Chile and Argentina and led to the War of the Confederation and Tarija War. After defeat in War of the Confederation and growing internal resistance by  Conservative factions in Peru, the Peru–Bolivian Confederation was dissolved in 1839.\nReferences\nBibliography\n* [https://books.google.com/books?id=evYHjRMVOD8C&dq=Coleccion+de+documentos+y+de+sucesos+notables+en+las+campanas+de+la+...&pg=PA203 Colección de documentos y de sucessos notables en las campañas de pacificación del Perú]\n* Historia de Bolivia, 5º edición, editorial Gisbert.\n* http://www.cervantesvirtual.com/servlet/SirveObras/01316119700682055644802/p0000003.htm\n* Basadre, Jorge. [http://sisbib.unmsm.edu.pe/Bibvirtual/libros/Historia/Iniciacion_Republica/tomo1/Lib2_Cap5_4.htm La Iniciación de la república: contribución al estudio de la evolución política y social del Perú]. Lima: UNMSM, Fondo Editorial, 2002.\n* Basadre, Jorge: Historia de la República del Perú. 1822 - 1933, Octava Edición, corregida y aumentada. Tomos 1 y 2. Editada por el Diario \"La República\" de Lima y la Universidad \"Ricardo Palma\". Impreso en Santiago de Chile, 1998."
    }
  ]
}