{
  "content": [
    {
      "type": "text",
      "text": "# Salaries of members of the United Kingdom Parliament__disambig_1\n\nThe basic annual salary of a Member of Parliament (MP) in the House of Commons is £93,904, plus expenses, since April 2025. In addition, MPs are able to claim allowances to cover the costs of running an office and employing staff, and maintaining a constituency residence or a residence in London. Additional salary is paid for appointments or additional duties, such as ministerial appointments, being a whip, chairing a select committee or chairing a Public Bill committee.\nThe Independent Parliamentary Standards Authority was introduced in response to the parliamentary expenses scandal that broke in 2009.\nIntroduction of MP salaries\nIn the medieval House of Commons, constituents sometimes paid their MPs or covered their expenses, but this custom died out by the late 17th century. Members of Parliament were unpaid until 1911, as it was assumed they had independent means. This effectively restricted membership of Parliament to persons who were well-off. The Chartist movement proposed salaries for MPs in 1838, and the issue was debated five times in Parliament between 1870 and 1895. The Liberal Party called for salaries for MPs in 1891, and the rise of the  Labour Party in the early 20th century led to the introduction of salaries.  The early Labour Party MPs were financially supported by trade unions, but in the Osborne case in December 1909, the Law Lords blocked this. MP salaries were approved in 1911 on a 265&ndash;173 vote.\nSalary and benefits: Commons\nBasic salary\nThe basic annual salary of an MP in the House of Commons has been £93,904 since April 2025. This is a £2,558 increase from the year before. It continues to be paid after the  dissolution of Parliament up to and including polling day.\nHistorical salaries\nThe first regular salary was £400 per year, introduced in 1911. For comparison, average annual earnings were £70 in 1908. Salaries were reduced 10% in the 1930s, during the Great Depression. Some subsequent salary levels were £1,000 in 1946, £3,250 in 1964, £11,750 in 1980, and £26,701 in 1990. The increases in MPs' basic salaries since 1996 have been:\n{| class=\"wikitable\" style=\"border: none;\"\n! Increase date !! Basic salary !! rowspan=\"21\" style=\"border: none;\" |\n! Increase date !! Basic salary !! rowspan=\"21\" style=\"border: none;\" |\n! Increase date !! Basic salary !! rowspan=\"21\" style=\"border: none;\" |\n! Increase date !! Basic salary\n|-\n| Jan 1996 || £34,085 || Apr 2003 || £56,358 2.2% || Apr 2011 || £65,738 || Apr 2020 || £81,932 3.1%\n|-\n| Jul 1996 || £43,000 26.2% || Apr 2004 || £57,485 2.0% || Apr 2012 || £65,738 || Apr 2021 || £81,932\n|-\n| Apr 1997 || £43,860  2.0% || Apr 2005 || £59,095 2.8% || Apr 2013 || £66,396 1.0% || Apr 2022 || £84,144 2.7%\n|-\n| Apr 1998 || £45,066  2.8% || Apr 2006 || £59,686 1.0% || Apr 2014 || £67,060 1.0%  || Apr 2023 || £86,584 2.9%\n|-\n| Apr 1999 || £47,008  4.3% || Nov 2006 || £60,277 1.0% || May 2015 || £74,000 10.3% || Apr 2024 || £91,346 5.5%\n|-\n| Apr 2000 || £48,371  2.9% || Apr 2007 || £61,181 1.5% || Apr 2016 || £74,962 1.3% || Apr 2025 || £93,904 2.8%\n|-\n| Apr 2001 || £49,822  3.0% || Nov 2007 || £61,820 1.0% || Apr 2017 || £76,011 1.4% || ||\n|-\n| Jun 2001 || £51,822  4.0% || Apr 2009 || £64,766 4.8% || Apr 2018 || £77,379 1.8%|| ||\n|-\n|Apr 2002\n|£55,118  6.4%\n|Apr 2010\n|£65,738 1.5%\n|Apr 2019\n|£79,468 2.7%\n|\n|\n|}\nIn December 2013, the Independent Parliamentary Standards Authority recommended that pay be increased to £74,000 per annum, linked \"to the pay of the people they represent\". At the same time, pension benefits would be reduced, resettlement payments scrapped and expenses tightened. In July 2015, this was implemented (backdated to 8 May 2015, the day after the general election), with annual changes now linked to changes in \"average earnings in the public sector using Office for National Statistics (ONS) figures\".\nAdditional salary\nMany MPs (the Prime Minister, ministers, the Speaker, senior opposition leaders, opposition chief whip, etc.) receive a supplementary salary for their specific responsibilities. As of 15 December 2022, these additional entitlements on top of the basic salary for an MP ranged from £20,261 for government whips and assistant whips to £80,807 for the Prime Minister. On 24 May 2015 David Cameron announced that he intended to freeze ministerial pay for the next five years.\nSalary of the Prime Minister\nThe Prime Minister does not always claim the total amount entitled to in legislation. The Prime Minister is entitled to other benefits, including the use of the Prime Minister's apartment at 10 Downing Street, the country house Chequers, and other official residences, and car and air transport.\n{| class=\"wikitable\"\n|-\n! width=\"120pt\" | Date !! width=\"100pt\" | Entitlement !! width=\"140pt\" | Modern equivalent !! width=\"800pt\" | Notes\n|-\n| April 1937 || £10,000|| £|0}} || Set by Ministers of the Crown Act 1937\n|-\n| April 1965 || £14,000 || £|0}} || Set by Ministerial Salaries Consolidation Act 1965\n|-\n| April 1972 || £20,000 || £|0}} || Set by Ministerial and Other Salaries Act 1972\n|-\n| 31 July 1978 || £22,000 || £|0}} || Set by The Ministerial and other Salaries Order 1978 (SI 1978/1102)\n|-\n| July 1979 || £33,000 || £|0}} ||\n|-\n| July 1980 || £34,650 || £|0}} ||\n|-\n| July 1981 || £36,725 || £|0}} ||\n|-\n| June 1982 || £38,200 || £|0}} ||\n|-\n| July 1983 || £38,987 || £|0}} ||\n|-\n| January 1984 || £40,424 || £|0}} ||\n|-\n| January 1985 || £41,891 || £|0}} ||\n|-\n| January 1986 || £41,891 || £|0}} ||\n|-\n| January 1987 || £44,775 || £|0}} ||\n|-\n| January 1988 || £45,787 || £|0}} ||\n|-\n| January 1989 || £46,109 || £|0}} ||\n|-\n| January 1990 || £46,750 || £|0}} ||\n|-\n| January 1991 || £50,724 || £|0}} ||\n|-\n| January 1992 || £53,007 || £|0}} ||\n|-\n| January 1994 || £54,438 || £|0}} ||\n|}\nThe Prime Minister's salary figures below include the salary for being an MP.\n{| class=\"wikitable\"\n|-\n! width=\"120pt\" | Date !! width=\"100pt\" | Entitlement !! width=\"100pt\" | Claimed !! width=\"140pt\" | Modern equivalent !! width=\"800pt\" | Notes\n|-\n| 1 Apr 2008 || || rowspan=\"3\" | £193,885 || || rowspan=\"3\" |\n|-\n| 1 Apr 2009 || ||\n|-\n| 1 Apr 2010 || rowspan=\"3\" | £198,661 || rowspan=\"3\" | £|0}}\n|-\n| April 2010 || £150,000 || Prime Minister Gordon Brown revealed on 20 April 2010, days before the 2010 General Election, that he had taken a voluntary cut. It is not clear when from, though on 1 April he was drawing the previous rate.\n|-\n| 13 May 2010 || rowspan=\"6\" | £142,500 || A Coalition Cabinet meeting on 13 May agreed a further 5% cut, and freeze until the 2015 General Election.\n|-\n| 1 Apr 2011 || || || rowspan=\"5\" |\n|-\n| 1 Apr 2012 || ||\n|-\n| 1 Apr 2013 || ||\n|-\n| 1 Apr 2014 || ||\n|-\n| 1 Apr 2015 || ||\n|-\n| 8 May 2015 || || £149,440 || || On 31 July 2015, increases were announced that would be backdated to 8 May, the day after the 2015 General Election.\n|-\n| 1 Apr 2016 || £152,532 || £150,402 || || rowspan=\"4\" |\n|-\n| 1 Apr 2017 || £153,907 || £151,451 ||\n|-\n| 1 Apr 2018 || £155,602 || £152,819 ||\n|-\n| 1 Apr 2019 || £158,754 || £154,908 ||\n|-\n| 1 Apr 2020 || £161,866 || £157,372 ||\n|-\n| 1 Apr 2021 || £161,866 || £157,372 ||\n|-\n| 1 Apr 2022 || £164,951 || £159,584 ||\n|-\n|}\nPension\nMPs normally receive a pension of either 1/40th or 1/50th of their final pensionable salary for each year of pensionable service depending on the contribution rate they chose. Members who made contributions of 13.75% of their salary gain an accrual rate of 1/40th.\nIf an MP stands down during the course of a Parliament due to ill health, an ill health retirement grant is payable, calculated in the same way as the Resettlement Grant (as well as an immediate pension based on the service the MP would have accrued if they had continued to serve until age 65).\nResettlement Grant and Winding-up Allowance\nOn leaving the House of Commons, an MP will be entitled to what is essentially severance pay.\nResettlement Grant\nThe Resettlement Grant is the name given to MPs' severance pay package. It may be claimed to help former MPs with the costs of adjusting to life outside parliament. It is payable to any Member who ceases to be an MP at a general election. The amount is based on age and length of service, and varies between 50% and 100% of the annual salary payable to a Member of Parliament at the time of the dissolution.\nIn the UK the first £30,000 of severance pay is tax-free. As stated above, the amount retiring MPs, or those who lose their seats, receive depends on how old they are and how long they have served in the House. For example, an MP who stays in office for one term (five years) and then leaves office will currently receive tax-free severance pay of 50% of their current salary, or £32,383 at 2009 rates – equivalent to an annual salary increment of more than £12,000 at current tax rates and pay scales.\nFrom the start of the 2015 Parliament, a \"Loss of Office Payment\", at double the statutory redundancy payment, was introduced. \"For the 'average' MP, who leaves office with 11 years' service, this may lead to a payment of around £14,850.\"\nWinding-up Allowance\nAn allowance is available (up to £46,000 as of July 2011) to pay for winding up staff contracts and office rent. An allowance of up to one third of the annual Office Costs Allowance was paid for the reimbursement of the cost of any work on parliamentary business undertaken on behalf of a deceased, defeated or retiring member after the date of cessation of membership. On 5 July 2001 the House agreed to change the allowance to one third of the sum of the staffing provision and Incidental Expenses Allowance in force at the time of cessation of membership.\nSummer recess\nParliament takes a break of around 45 days for the summer. This is not only for holiday, but so that MPs can spend more time away from Parliament in their constituencies to do work there.\nExpenses\nIn addition to the above benefits, MPs can claim for the reimbursement of expenses incurred as a result of their duties.\nOffice expenses\n*Office running costs\n*Staffing costs\n*Travel for staff\n*Centrally purchased stationery\n*Postage costs\n*Central IT costs\n*Communications allowance\nMPs are entitled to claim £9,000 a year for postage and stationery (financial year 2015–16).  This amount is in addition to any stationery and postage costs which Members may have reimbursed under the Independent Parliamentary Standards Authority's expenses Scheme.\nDuring the COVID-19 pandemic MPs were able to claim additional expenses of up to £10,000 to support the costs of them and their staff working from home.\nHousing, second home, and travel\nMPs receive allowances towards having somewhere to live in London and in their constituency, and travelling between Parliament and their constituency.\nSalary and benefits: House of Lords\nMembers of the House of Lords are  not salaried. They can opt to receive a £361  per day attendance allowance, plus travel expenses and subsidised restaurant facilities. Peers may also choose to receive a reduced attendance allowance of £180 per day instead. These amounts were increased from £342 and £171 respectively on in April 2024.\nScrutiny and audit process of claims\nIn 2010, following the parliamentary expenses scandal, the payment of MPs' salaries and allowances, and many staff, were moved from the Fees Office, which was effectively self-policing by MPs of their expenses, to a more autonomous body, the Independent Parliamentary Standards Authority. In 2010 the IPSA was also given the responsibility of setting MPs' salary levels. It is accountable to the Speaker's Committee for the IPSA, consisting of the Speaker, the Leader of the House, committee chairs, representatives from the main parties, and three lay members chosen through an open recruitment process.\nThe National Audit Office, another independent parliamentary body, reviews IPSA's accounts twice a year and publishes reports detailing their findings on their website.\nSee also\n* ''The Green Book: A Guide to Members' Allowances''\n* List of heads of state and government salaries\n* Ministerial and Other Salaries Act 1975\nReferences\nExternal links\n* [https://commonslibrary.parliament.uk/research-briefings/cbp-8839/ Members’ pay and expenses and ministerial salaries 2019/20]"
    }
  ]
}