{
  "content": [
    {
      "type": "text",
      "text": "# Salawati Kingdom\n\n}}\nThe Salawati Kingdom is the Islamic kingdom that once stood in Salawati Island, Raja Ampat Regency, Southwest Papua. The center of the Salawati kingdom was located in the Samate village which is currently located in the North Salawati district.\nHistory\nThe Salawati Kingdom was founded by a king who came from Waigeo namely Fun Malaban or Fun Tusan who is the ancestor of gelet (small clan) Arfan. Salawati is also a vassal kingdom of the Sultanate of Tidore. Although even before the fun arrival from Waigeo, there were already rulers in Salawati with the title of rejao or jaja which meant \"landlord\" in Ma'ya language. They decided to have a fasyukul pampon (eating contest), which was won by the fun from Waigeo, hence the local rulers submitted to him.\nAccording to Abdullah Arfan's family story, the ancestor of the Arfan dynasty Kalewan, married muballighah Siti Hawa Farouk who came from Cirebon, and changed his name to Bayajid. He is believed to be the first Muslim from Papua and it is estimated that this incident occurred in the 16th century.\nSalawati kingdom was one of the tributaries or vassals of Sultan of Tidore. As mentioned the king of Salawati descended from rulers from Waigeo, whose ancestor Gurabesi had a tributary relationship with Tidore Sultanate. King of Salawati being one of the strongest in the Raja Ampat archipelago was also trusted to collect tributes as leader of Hongi expeditions on behalf of Sultan of Tidore on northern Papua as far as Cendrawasih Bay as noted in 1705. In the same year the king of Salawati was also noted to be in the vicinity of Manokwari in Doreri Bay (Dore).\nActivities of the kingdoms in Raja Ampat islands include raiding and trading. In 1653, Salawati and Waigeo raided Tanah Hitu Kingdom, on the northern coast of Ambon, for gold and slaves with an expedition consisted of 15 ships. Although Salawati was in turn experienced raiding of its own in 1710 when the king of Salawati was in Cendrawasih Bay, pirates from Tidore captured his wife and 150 of his subjects. They were only freed after the king paid 104 slaves.\nSalawati's role in the spread of Islam in Misool\nThe arrival of Islam in Misool Island and the Raja Ampat Islands in general cannot be separated from the role of the Salawati Kingdom. According to oral history, the king of Salawati held an event and invited all residents, including residents of Misool, who at that time had not embraced Islam. After the event was over, all residents returned to their respective villages, but one Misool resident at that time fell asleep and was left behind, this person woke up when the people of Salawati were cleaning their beds by pouring water. He later told his friends of what happened. After hearing the story, some of them were angry and wanted to attack the King of Salawati because they thought he considered them dirty, and so had to clean their former beds with water, but others were intrigued and instead sought to learn his practices. After discussion, it was agreed that all the Misool residents who took part in the event would go to Banda to learn the teachings of the king of Salawati.\nA few days later the group departed for Banda by boat, they were determined to learn the teachings of King of Salawati; arriving in Banda at dawn, the group found a hut. From a distance, they heard the sound of a call to prayer from inside a hut. Slowly the group approached the hut and took a peek at what the people in the hut were doing. They saw a husband and wife who were praying, and noticed the similar practices to the king of Salawati. After they finished praying, the group entered the house and surrounded the two of them. This group then kidnapped the couple and brought them to Misool to be the teacher of Misool residents. Evidence of the couple's existence was the presence of two graves inside Tifale Cave, which are believed to be theirs.\nTerritory\nThe territory of the Kingdom of Salawati covers the territory which is partly located in the coastal areas of the tanah besar (Papua), Salawati Island the northern part between Walian Village to Kawal Village, east of Batanta Island from the Suy River to Dayan Island, and surrounding small islands such as Doom Island, Jefman Island, and Senapan Island. Some areas on Waigeo Island west of Kampung Wawiyai to Kampung Salyo are also part of the territory of the king of Salawati. In tanah besar, the power of the Kingdom of Salawati covered the area Asbaken, Makbon in the west to the coast of Katimin located south of Sorong.\nList of rulers\nThe following is a list of rulers (fun, king) of the Kingdom of Salawati; to remember their ancestor the name Gurabesi is also used as a title.\n{| class=\"wikitable\"\n|+List of Fun (Gurabesi)\n! No.\n! Monarch\n! Reign\n|-\n! 1\n| Tusan\n| ? – ?\n|-\n! 2\n| ?\n| ? – ?\n|-\n! 3\n| ?\n| ? – ?\n|-\n! 4\n| Bayajid Kalewan\n| 16th century\n|-\n! 5\n| Muhammad Amin\n| ? – ?\n|-\n! 6\n| Umar Faruk\n| ? – ?\n|-\n! 7\n| Abdul Muid\n| before 1868 – 1873\n|-\n! 8\n| Abdul Al-Kasim\n| 1873 – 1890\n|-\n! 9\n| Muhammad Aminuddin Arfan\n| 1900 – 1918\n|-\n! 10\n| Bahar Ad-Din Arfan\n| 1918 – 1935\n|-\n! 11\n| Abu Al-Kasim Arfan\n| 1935 – 1958 }}\n|-\n! ?\n| Umar Arfan\n| ? – ?\n|-\n! ?\n| Mohammad Ali Arfan\n| ? – ?\n|-\n! 20\n| Abdullah Arfan\n| ? – ?\n|-\n! ?\n| Mohammad Taher Arfan\n| 2001 – ?\n|-\n! ?\n| Herry Arfan\n| 2019 – present\n|}\nNotes\nReferences"
    }
  ]
}