{
  "content": [
    {
      "type": "text",
      "text": "# Sally Warner\n\nSally Warner is a writer of fiction for children and young adults and of books on creativity. She made the Lily series and Emma series for children's books. Sally Warner was born in New York City and grew up in Connecticut and California, where her family moved when she was eight years old. [1]\nSchools\nShe attended public schools in Pasadena (Noyes Elementary School, Eliot Junior High School, and Pasadena High School). She then received her B.A. degree from Scripps College in Claremont, California, and her B.F.A. and M.F.A. degrees in fine arts from Otis Art Institute in Los Angeles.[1]\nBibliography\nBooks on art\n*Encouraging the Artist in Your Child\n*Encouraging the Artist in Yourself\n*Making Room For Art\nYounger children\n*Not-So-Weird Emma\n*Only Emma\n*Best Friend Emma\n*Super Emma\n*Excellent Emma\n*Happily ever Emma\n*Smart About the First Ladies\n*Sweet and Sour Lily\n*Leftover Lily\n*Private Lily\n*Accidental Lily\n*EllRay Jakes is not a chicken (2011) \"Warner's clever plotting brings an unexpected and rewarding ending. ... and Harper's [illustrator] cartoons, incorporated throughout, further enliven the story.\"\n*EllRay Jakes Stands Tall\n*EllRay Jakes the Recess King\n*EllRay Jakes Rocks the Holidays!\n*EllRay Jakes is Magic\n*EllRay Jakes and the Beanstalk\n*EllRay Jakes the Dragon Slayer\n*EllRay Jakes Walks the Plank\n*EllRay Jakes is a Rock Star\nOlder children and young adults\n*Twilight Child\n*A Long Time Ago Today\n*''This Isn't About The Money \"Warner (Sort of Forever) relays another moving story of loss and healing.\"\n*Sister Split\n*Sort of Forever \"Warner has previously explored the themes of friendship and change, but never more powerfully or affectingly.\"\n*How to Be a Real Person (in just one day) \"Warner has shaped a haunting, ultimately hopeful story, whose heroine is indisputably real.\"\n*Finding Hattie'' \"Even with its period setting, this atmospheric tale portrays the timeless teenage struggle to find one's own way.\"\n*Bad Girl Blues\n*Totally Confidential \"Those willing to look past the improbable premise will find this an otherwise tight and well-told story, full of empathy for kids' anxieties and concerns.\"\n*Dog Years \"...Warner makes her children's book debut with this intermittently poignant novel.\"\n*Some Friend \"Effective characterization, credible dialogue and recurrent imagery neatly integrated into an affecting plot add up to choice middle-grade fiction.\"\n*Ellie and the Bunheads \"The expansive storytelling and comic exaggeration produce high kid appeal...\"\n*''It's Only Temporary\n*Lala Land''\nReferences\nExternal links\n* http://www.sallywarnerbooks.com/ - author's website"
    }
  ]
}