{
  "content": [
    {
      "type": "text",
      "text": "# Sallie Ward\n\n| birth_place  = Scott County, Kentucky, U.S.\n| death_date   =\n| death_place  = Louisville, Kentucky, U.S.\n| restingplace = Cave Hill CemeteryLouisville, Kentucky, U.S.\n| spouse       =\n*\n* Vene P. Armstrong\n*\n}}\n| children     = 3\n| relatives    = Richard Mentor Johnson (paternal great-great-uncle)Abbott Lawrence (father-in-law)\n| other_names  = Sallie Ward\n}}\nSally Ward Lawrence Hunt Armstrong Downs, also known as Sallie Ward, (September 29, 1827July 8, 1896) was a \"Southern belle.\" Born into the Southern aristocracy of Kentucky in the Antebellum South, she married four times. After a failed marriage into the Boston Brahmin elite, she married three more times and became a socialite in New Orleans and Louisville, Kentucky. She was one of the first women in the United States to wear cosmetics, and she wore daring outfits. She embodied \"an old Kentucky way of life.\"\nEarly life\nSally Ward was born on September 29, 1827, in Scott County, Kentucky. Her father, Col. Robert Johnson Ward, was a planter and lawyer who served as the Speaker of the Assembly of Kentucky. Her mother, Emily Flournoy, was a native of Georgetown, Kentucky.\nHer paternal grandfather, William Ward, married Sally Johnson, a sister of Vice President Richard Mentor Johnson. Her paternal uncle, Junius Richard Ward, resided at Ward Hall in Georgetown, Kentucky, as well as the Junius R. Ward House in Erwin, Mississippi. On her maternal side, she was of Huguenot descent. Her maternal grandfather, Major Matthew Flournoy, served in the American Revolutionary War.\nWard grew up in Louisville, Kentucky, with her seven siblings. She was educated in a French finishing school in Philadelphia, Pennsylvania, graduating in 1844.\nAdult life\nWard was a Southern belle and socialite. She spoke French and played several instruments. She became one of the first women in the United States to wear cosmetics and wore daring outfits. She organized one of the first proper-style dress balls in Kentucky. She paved the way for wearing several types of dresses during a given society ball. She married several times, a trend which later became widespread.\nWard married her first husband, Timothy Bigelow Lawrence, the son of Abbott Lawrence, on December 5, 1849. The wedding was attended by governors Robert P. Letcher, John J. Crittenden and Lazarus W. Powell, as well as George D. Prentice, the editor of the Louisville Journal. They resided in Boston, Massachusetts, where she attended society balls. They divorced in 1850 due to cultural differences. In one last incident, she wore a dress resembling Amelia Bloomer's outfit at a ball in jest; but, her in-laws were not amused.\nWard married Dr Robert P. Hunt, a Kentucky native, in 1852. They resided in New Orleans, Louisiana, where they threw parties at the French Opera House. They had two sons, Robert and John Wesley, and one daughter, Emily. Their son John Wesley survived to adulthood. Meanwhile, her husband served in the Confederate States Army during the American Civil War, and he was killed in combat. They separated when he joined the army, as she supported Abraham Lincoln.\nWard married Vene P. Armstrong, a merchant, in the postbellum era. After his death, she married her fourth husband, Major George F. Downs, a Kentucky native. They resided at the Galt House, a hotel in Louisville.\nHer portrait was done by George Peter Alexander Healy. It is now at the Speed Art Museum in Louisville, Kentucky.\nDeath\nWard died of a ruptured stomach ulcer on July 8, 1896, at the Galt House Hotel in Louisville, Kentucky. She was buried at the Cave Hill Cemetery. Her son, John Wesley Hunt, worked as the night editor of the New York World.\nSee also\n* Murder of William Butler – an 1853 shooting involving Ward's brothers\nReferences\nExternal links\n*"
    }
  ]
}