{
  "content": [
    {
      "type": "text",
      "text": "# Salomón–Lozano Treaty__disambig_1\n\n|image           = Se firma el acta de entrega de Leticia 1930.jpg\n|image_width     = 250px\n|caption         = The act of transfer of Leticia and other territories exchanged for the treaty in 1930 is signed.\n|type            = Border treaty\n|date_drafted    = 20 December 1927\n|date_signed     = 24 March 1922\n|location_signed = Lima, Peru\n|date_sealed     =\n|date_effective  = 19 March 1928\n|signatories     =\n*Fabio Lozano\n*Alberto Salomón\n| parties        =\n*\n*\n|wikisource      = es:Tratado Salomón-Lozano\n}}\nThe Salomón–Lozano Treaty was signed in July 1922 by the representatives Fabio Lozano Torrijos of Colombia and Alberto Salomón Osorio of Peru. The fourth in a succession of treaties on the Colombian-Peruvian disputes over land in the Upper Amazon region, it was intended to be a comprehensive settlement of the long border dispute between the two countries.\nBackground\nThe United States, which wanted to compensate Colombia over the loss of Panama, pressured Peru to accept a treaty that was unpopular. Peruvian President Augusto B. Leguía forwarded the document to the Preuvian Congress, which was approved on December 20, 1927. It had been signed on March 24, 1922.\nAccording to Colombian historiography, the treaty required Colombia to cede to Peru the area between the Putumayo River and the Napo and Amazon rivers, an area that belonged to Colombia by the uti possidetis iure of 1810, as confirmed by various treaties signed with Ecuador: the Treaty of Pasto of 1832, the Treaty of 1856, and the Muñoz Vernaza-Suárez Treaty of 1916.\nAccording to Peruvian historiography, the treaty had Peru cede to Colombia the entire strip between the Caquetá and Putumayo Rivers and lose around 100,000 square kilometers of territory that belonged to it from the uti possidetis iure of 1810. There, Peruvian settlements existed in the ports of Tarapacá and Puerto Arica, which had been founded by Peruvian settlers from former Peruvian territories of the same name that had been lost during the 1879-1883 War of the Pacific. The treaty included the town of Leticia and the valuable portion between Putumayo and the Amazon known as the Amazon Trapeze for the sole purpose of granting Colombia its own access to the Amazon. Losing the area made Peru lose valuable control over the Amazon, which it shared with Brazil.\nTreaty content and signing\nArticle 1 of the treaty states:\nAs a result of a Peruvian attack on the river town of Puerto Córdoba, the treaty made both countries to scale back the number of troops in the region. It essentially created a border between both nations along the Putumayo River. Also, Colombia recognized Peruvian territorial claims to the Amazon east of Ecuador, including a new enclave granted by the treaty.\nSee also\n*Foreign relations of Colombia\n*Foreign relations of Peru\n*Colombia-Peru War\nReferences\nExternal links\n* [http://es.wikisource.org/wiki/Tratado_Salom%C3%B3n-Lozano Text of the Treaty (in Spanish)]"
    }
  ]
}