{
  "content": [
    {
      "type": "text",
      "text": "# Salt in the American Civil War\n\nSalt was a crucial resource during the American Civil War. It not only preserved food in the days before refrigeration, but was also vital in the curing of leather. Union General William Tecumseh Sherman once said that \"salt is eminently contraband\", as an army that has salt can adequately feed its men.\nThe most important saltworks for the Confederacy were at Saltville, Virginia. In late 1864, the Union army twice advanced to capture the saltworks, as it was the last prominent source of salt for the eastern Confederate states. The October 1864 First Battle of Saltville saw the Confederate able to repulse the charge, but the next December in the Second Battle of Saltville Union forces under George Stoneman managed to destroy the vital saltworks. Two months later the salt works were back to work for the Confederacy, although the destroyed railroad system around the area hampered its distribution.\nIn Georgia, the price of salt depended on one's family circumstances. Heads of families could purchase a half-bushel of salt for $2.50. If a widow had a son in the Confederate army, the price was only $1.00. But if the widow's husband had served his nation, the price was free. Local court clerks sent salt requests to the state government, which in turn allotted salt to the counties as requested. One way Southern families acquired salt was to boil the dirt in areas where they had previously cured meats.\nFlorida's greatest contribution to the Confederate war effort was in producing salt. With a total investment of $10 million, Florida salt plants worked 24 hours a day boiling salt from sea water, mostly in the area between Saint Andrews Bay and St. Marks, Florida. Occasionally, Union forces came ashore just to destroy the boilers. Confederate law exempted salt makers from the draft, which rendered saltmaking a popular profession in wartime Florida. The estimated workforce involved in saltmaking there numbered 5,000.\nAvery Island, three miles inland from the Louisiana coast, gave the Confederacy a huge supply of rock salt until the Union captured it. It was not realized at the time that there were structures similar to the Avery Island salt dome all along the Louisiana and Texas coasts of the Gulf of Mexico which could have provided an additional source of salt.\nSee also\n* Kanawha saltworks\nReferences"
    }
  ]
}