{
  "content": [
    {
      "type": "text",
      "text": "# Saludo al presidente\n\n| completion_date    =\n| medium             = Oil on canvas\n| subject            =\n| height_metric      = 161\n| width_metric       =\n| length_metric      = 259\n| museum             = Museum of the Central Reserve Bank of Peru\n| city               = Lima\n}}\nSaludo al presidente, also known as Saludo al presidente Leguía, is a 1921 oil on canvas painting by Peruvian artist Daniel Hernández Morillo. It is part of the collection of the Museum of the Central Reserve Bank of Peru in Lima. Its dimensions are 161 cm high and 259&nbsp;cm wide.\nOverview\nThe painting represents a moment from the reception ceremony of the foreign delegations at the Government Palace for the celebrations of the Centennial of the Independence of Peru. The characters that appear in the painting are:\n*Centre: greeting of General Charles Marie Emmanuel Mangin, French hero of the First World War, wearing the Legion of Honour, shaking hands with Peruvian President Augusto B. Leguía in evening dress and with the presidential sash.\n*Monsignor Luis DuPrat, plenipotentiary minister of the Argentine Republic.\n*General José Ramón Pizarro, hero of the Battle of Pisagua.\n*Marshal Andrés Avelino Cáceres, hero of the Breña campaign, former president of Peru, and political ally of Leguía.\n*Then mayor of Lima, Pedro José Rada y Gamio.\n*The Minister of Finance .\n*Minister of Foreign Affairs, Alberto Salomón Osorio.\n*The person in charge of the protocol, .\n*Colombian diplomat, Fabio Lozano Torrijos.\n*The ambassador of the Kingdom of Spain, Cipriano Muñoz, 2nd Count of la Viñaza.\n*Archbishop Carlo Pietropaoli, apostolic nuncio of Pope Benedict XV.\n*Other members of the 34 delegations who attended the commemorative events.\nIn reality it is an idealized picture, because no such event existed, the delegations attended President Leguía's house separately, and Charles Manguin did not arrive in time to join the French delegation during the presentations.\nReferences"
    }
  ]
}