{
  "content": [
    {
      "type": "text",
      "text": "# Samara culture\n\nThe Samara culture is an Eneolithic (Copper Age) culture dating to the turn of the 5th millennium BCE, at the Samara Bend of the Volga River (modern Russia). The Samara culture is regarded as related to contemporaneous or subsequent prehistoric cultures of the Pontic–Caspian steppe, such as the Khvalynsk, Repin and Yamna (or Yamnaya) cultures.\nPlace and time\nThe Samara culture is an Eneolithic culture of the early 5th millennium BCE, dates Samara culture at cal. C-14 5200–4500 BCE, with possible continuation into first half of 5th millennium, while the Khvalynsk culture is dated at ca. 4600–3900 BCE. These data are based on synchronisation, not radiocarbon dating or dendrochronology of Samara culture sites itself. The synchronisation to the west: Samara equal to Mariupol equal to Tripolie A equal to Vinča - Turdas (Vinča B, C); Khvalinskaya equal to Sredni Stog 1 equal to Tripolie B1 equal to Pre-Cucuteni equal to Gumelnita; Maykop equal to Yamna equal to Sredni Stog II equal to Tripolie B2 equal to Cerna Voda I equal to Salcuta IV equal to Bodrogkeresztur.\n* Mallory and Adams, Encyclopedia of Indo-European Culture, gives the bare date \"fifth millennium BCE\", while the Khvalynsk culture, its reported successor, is dated at 4900–3500 BCE.}} at the Samara bend region of the middle Volga, at the northern edge of the steppe zone. It was discovered during archaeological excavations in 1973 near the village of Syezzheye (Съезжее) near Bogatoye. Related sites are Varfolomeyevka on the Russian-Kazakh border (5500 BCE), which has parallels in , settlement in Kalmykia, Russia, and Mykol'ske, Ukraine, on the Dnieper. The later stages of the Samara culture are contemporaneous with its successor culture in the region, the early Khvalynsk culture (4700–3800 BCE), while the archaeological findings seem related to those of the Dniepr-Donets II culture (5200/5000–4400/4200 BCE).\nThe valley of the Samara river contains sites from earlier cultures as well (including the Elshanka culture), which are descriptively termed \"Samara cultures\" or \"Samara valley cultures\". Some of these sites are currently under excavation. \"The Samara culture\" as a proper name, however, is reserved for the early eneolithic of the region.\nArtifacts\nPottery\nPottery consists mainly of egg-shaped beakers with pronounced rims. They were not able to stand on a flat surface, suggesting that some method of supporting or carrying must have been in use, perhaps basketry or slings, for which the rims would have been a useful point of support. The carrier slung the pots over the shoulder or onto an animal.\nDecoration consists of circumferential motifs: lines, bands, zig-zags or wavy lines, incised, stabbed or impressed with a comb. These patterns are best understood when seen from the top. They appear then to be a solar motif, with the mouth of the pot as the sun. Later developments of this theme show that in fact the sun is being represented.\nSacrificial objects\nThe culture is characterized by the remains of animal sacrifice, which occur over most of the sites. There is no indisputable evidence of riding, but there were horse burials, the earliest in the Old World. Typically the head and hooves of cattle, sheep, and horses are placed in shallow bowls over the human grave, smothered with ochre. Some have seen the beginning of the horse sacrifice in these remains, but this interpretation has not been more definitely substantiated. It is known that the Indo-Europeans sacrificed both animals and people, like many other cultures.\nGraves\nat the Samara bend of the Volga]]\nThe graves found are shallow pits for single individuals, but two or three individuals might be placed there.\nSome of the graves are covered with a stone cairn or a low earthen mound, the very first predecessor of the kurgan. The later, fully developed kurgan was a hill on which the deceased chief might ascend to the sky god, but whether these early mounds had that significance is doubtful.\nGrave offerings included ornaments depicting horses. The graves also had an overburden of horse remains; it cannot yet be determined decisively if these horses were domesticated and ridden or not, but they were certainly used as a meat-animal. Most controversial are bone plaques of horses or double oxen heads, which were pierced.\nThe graves yield well-made daggers of flint and bone, placed at the arm or head of the deceased, one in the grave of a small boy. Weapons in the graves of children are common later. Other weapons are bone spearheads and flint arrowheads.\nOther carved bone figurines and pendants were found in the graves.\nMiddle Volga culture\nThe Samara culture was preceded by the Middle Volga culture that flourished in the 6th millennium BCE.\nArchaeogenetics\nGenetic analyses of a male buried at Lebyazhinka, radiocarbon dated to 5640-5555 BCE, found that he belonged to a population often referred to as \"Samara hunter-gatherers\", a group closely associated with Eastern Hunter-Gatherers. The male sample carried Y-haplogroup R1b1a1a and mitochondrial haplogroup U5a1d.\nNotes\nReferences\nSources\n*\n* Marija Gimbutas, \"The Civilization of the Goddess\", HarperSanFrancisco, 1991,  or\n* J. P. Mallory, \"Samara Culture\", Encyclopedia of Indo-European Culture, Fitzroy Dearborn, 1997.\n*\n*\nExternal links\n*\n* [http://users.hartwick.edu/iaes/horseback/horse.html The Horse in Mortuary Symbolism...]\n* [http://www.pnas.org/cgi/content/full/99/16/10905 Mitochondrial DNA and the origins of the domestic horse]\n* [http://www.sciencemag.org/cgi/content/abstract/291/5503/474?ijkey=ee6b658a7e39e6054958efcf7f95ef0c57496273&keytype2=tf_ipsecsha Widespread Origins of Domestic Horse Lineages]\n* [http://povolzie.archeologia.ru/16.htm Factual archaeological description of Samara culture (in Russian)]"
    }
  ]
}