{
  "content": [
    {
      "type": "text",
      "text": "# Sambas expeditions\n\n| date              =\n| result            = First expedition: Sambas victorySecond expedition: British victory\n| combatant1        =  Sultanate of Sambas\n| combatant2        =  United Kingdom\n| commander1        =  Abu Bakar Taj ud-din I Pangeran Anom\n| commander2        = }}\n| strength1         =  1,000\n| strength2         = First expedition:1 frigate, 2 sloops~100 troopsSecond expedition:4 frigates, 10 sloops1,300–1,400 troops\n| casualties1       = 150 killed (2nd expedition)67 guns captured\n| casualties2       = 7-8 killed (2nd expedition)59 wounded\n| campaignbox       =\n| partof            = French and British interregnum in the Dutch East Indies and French Revolutionary and Napoleonic Wars\n}}\nIn 1812 and 1813, the British colonial government in Java sent two military expeditions against the Sultanate of Sambas in modern West Borneo, with the first expedition being forced to retreat while the second expedition succeeded in capturing the town of Sambas. The expeditions were launched with the intent of suppressing pirate activity operating from Sambas, led by son of the sultan Pangeran Anom. Although defeated, the Sultan of Sambas would reach a settlement with the British shortly after, with the Sultanate retaining its status. Pangeran Anom would also be pardoned by the British and later became Sultan.\nBackground\nFollowing the 1811 British invasion of Java, the status of Dutch colonies in the East Indies became tenuous. While the British militarily occupied Java, other islands were not under immediate control, including the island of Borneo. Shortly after Java's fall, British colonial authorities there had begun communication with the sultanates of Borneo, starting with Banjarmasin in the south. In West Borneo, the primary polities were the Sultanates of Pontianak and Sambas, with the Dutch having reduced their presence in the region since the late eighteenth century.\nWhile Pontianak's sultan welcomed British protection and invited the British to station a garrison in Pontianak, Sambas did not reciprocate. Sambas at the time was a centre of pirate activity, with government being run largely by Pangeran (Prince) Anom, son of the old Sultan of Sambas Abubakar Tadjuddin I. Anom was active in piracy, with British sources describing him as \"having out-heroded Herod in his atrocities\". The British estimated that Sambas was able to muster a force of ten to twelve proa with seventy to eighty armed men each. In 1812, Anom captured the Portuguese merchant vessel Coromandel and nine crewmembers of the British sloop Hecate, which led the British to prepare a military expedition against Sambas.\nExpeditions\nFirst expedition\n. Sambas used similar cannons in 1812.]]\nThe first expedition to Sambas was launched in October 1812, led by Captain J. Bowen aboard the frigate HMS Phoenix along with the sloops-of-war Procris and Barracouta. The ships also carried around 100 soldiers of the 78th Regiment. The force was tasked with destroying the town of Sambas, but British leadership assumed that the attacking force would be sufficient to intimidate the defenders into capitulating. Upon arrival at Sambas, the defenders did not capitulate, and the Barracouta came under fire from both pirate ships and from shore-bound guns which inflicted some casualties. Unable to flank the defenders and lacking men for an amphibious assault, Bowen retreated and returned to Java.\nThe failed expedition caused significant embarrassment to British authorities in Java, but due to a lack of available resources, there were no immediate follow-up expeditions in 1812. The Bombay Marine sloop-of-war HCS Aurora blockaded the Sambas River after the failed expedition to prevent raiding in the meantime. The blame for the failure generally fell on Bowen, and officials generally covered up details of the failure. Bowen fell ill and died not long after his return from the expedition.\nSecond expedition\n, which was part of the second expedition.]]\nTo \"vindicate the honour of the British flag\", the British planned and prepared for a second expedition throughout early 1813, with a much larger force. The naval contingent consisted of Royal Navy frigates Leda, Hussar, Malacca, and Volage, sloops Hecate and Procris, East India Company warships Aurora, Malabar, Teignmouth, and five other gunboats plus two transport ships. The squadron's senior officer was Captain George Sayer aboard Leda. The land force consisted of between 700 and 800 British troops of the 14th Regiment under Colonel James Watson and 600 Sepoy troops of the Bengal Army. The force embarked on 23 June and arrived at the mouth of the Sambas River on 25 June. The troops sailed up the river, disembarked on 26 June, and divided into three columns.\nThe town of Sambas was defended by a number of cannon-armed emplacements, and at 3 AM on 28 June the British commenced their attack. After a half-hour battle, the emplacements were taken and the defenders were in retreat, with Pangeran Anom managing to escape the town into the interior of Borneo. According to British sources, the attacking force suffered 7 or 8 killed, with 59 wounded. The British estimated Sambas' losses at 150 killed including a brother of Sambas' sultan and a son of Pangeran Anom, with 31 brass cannons and 36 iron cannons also captured. The Coromandel was also taken by the British along with the fleet of pirate vessels at Sambas. Sambas was occupied by the British without further resistance.\nAftermath\nWhile the British did not suffer many casualties in combat, tropical diseases inflicted significant losses on soldiers stationed at Sambas and to marine crews. Two-thirds of the 75 European crewmen of the sloop Teignmouth, for instance, died of fever during the expedition and occupation. In September 1813, the British announced an amnesty and restoration for the Sultan of Sambas conditional on the acceptance of a British resident, which was accepted and a treaty between Sambas and the British was signed on 24 October 1813. The Sultan also agreed to cease sheltering pirates within Sambas. Another pardon was issued to Pangeran Anom in August 1814, and he would succeed as Sultan Muhamad Ali Sjafiudin of Sambas after his father's death in 1815.\nReferences"
    }
  ]
}