{
  "content": [
    {
      "type": "text",
      "text": "# Sammy Stewart\n\n|birth_place=Asheville, North Carolina, U.S.\n|death_date=\n|death_place=Hendersonville, North Carolina, U.S.\n|bats=Right\n|throws=Right\n|debutleague = MLB\n|debutdate=September 1\n|debutyear=1978\n|debutteam=Baltimore Orioles\n|finalleague = MLB\n|finaldate=October 3\n|finalyear=1987\n|finalteam=Cleveland Indians\n|statleague = MLB\n|stat1label=Win&ndash;loss record\n|stat1value=59–48\n|stat2label=Earned run average\n|stat2value=3.59\n|stat3label=Strikeouts\n|stat3value=586\n|teams=\n* Baltimore Orioles (–)\n* Boston Red Sox ()\n* Cleveland Indians ()\n|highlights=\n* World Series champion ()\n* AL ERA leader (1981)\n}}\nSamuel Lee Stewart (October 28, 1954 – March 2, 2018) was an American professional baseball player. He pitched in Major League Baseball (MLB) from 1978 to 1987. Stewart had the best earned run average (ERA) in the American League (AL) in 1981 and he pitched in the postseason in 1979 and 1983. He won the American League championship in 1979 and the World Series championship in 1983, both with the Baltimore Orioles. He became addicted to crack after he retired from baseball; this led to a prison term that ran from 2006 to 2013.\nEarly life\nStewart was born in Asheville, North Carolina. He attended Charles D. Owen High School in Black Mountain, North Carolina, and Montreat College, and signed his first pro contract with the Baltimore Orioles in 1975.\nCareer\nStewart established a new record for most consecutive strikeouts in an MLB debut with seven in the Orioles' 9&ndash;3 victory over the Chicago White Sox in the second game of a twi-night doubleheader at Memorial Stadium on September 1, 1978. His performance surpassed the milestone established by Karl Spooner in 1954.\nStewart appeared in one game of the 1979 World Series. In  innings, he gave up four hits but did not surrender a run.\nStewart's 2.32 earned run average (ERA) led the American League in 1981.\nIn the 1983 American League Championship Series and the 1983 World Series, he pitched a combined  innings over five games, did not give up any runs, struck out eight batters. He earned an ALCS save on October 7. He had been placed on 18 months probation the day before, stemming from a July arrest for driving while intoxicated. His attorney announced that Stewart was undergoing treatment for alcohol problems. He went 51&ndash;45 with 42 saves and a 3.47 ERA in eight seasons with the Orioles.\nIn a December 17, 1985 trade that sent Jackie Gutiérrez to the Orioles, Stewart was acquired by the Boston Red Sox in a move to strengthen its bullpen. Upon hearing reports that Gutiérrez was released by two winter ball teams in the Dominican Republic and Venezuela because of erratic behavior which involved frequent fights, the Orioles attempted to have the transaction restructured or voided, alleging that the Red Sox had prior knowledge of any such issues. Stewart said that he had already settled in Boston and would fight any attempts to return him to Baltimore. American League president Bobby Brown upheld the deal on March 11, 1986, ruling that it was made in \"good faith, with neither club knowingly misrepresenting the facts\" and that \"the Orioles' request to rescind the trade has been denied.\"\nYears after his retirement, Stewart blamed Boston's 1986 World Series loss on the team's manager, John McNamara. He said that he had not been on good terms with McNamara since he narrowly missed a team bus after visiting his son in the hospital. A confrontation ensued between Stewart and the team's traveling secretary. Stewart said that McNamara held a grudge from the incident which led to Stewart not appearing in the World Series.\nHe pitched in 359 major league games, finishing with a 59–48 record, 45 saves, and a 3.59 earned run average (ERA).\nPersonal life\nThe year after he retired from baseball, Stewart became addicted to crack cocaine. He said that the drug helped him not to feel the absence of baseball in his life. Several attempts at rehabilitation were unsuccessful; he slept under bridges in the Asheville area for a while.\nBetween 1989 and 2006, Stewart was arrested 26 times and spent several stints in prison. Following a string of domestic disturbances with his wife Peggy, he was charged with kidnapping in 1989 after she said he beat her and held her against her will overnight. They separated in 1994.\nIn October 2006, he was sentenced to 80 to 105 months in the Buncombe Correctional Center on drug possession charges after accepting a plea bargain as a habitual felon. He was released in January 2013, then moved to Hendersonville, North Carolina, to live with his girlfriend Cherie (married in 2015 until his death). He began teaching pitching lessons to local youth baseball players.\nStewart had a son and a daughter with Peggy; both children had cystic fibrosis. His son died in 1991 at age 11, and his daughter received a double lung transplant, before dying in 2016.  He also had two sons from another relationship.\nStewart was found dead in his Hendersonville home on March 2, 2018. An autopsy report released by the Henderson County medical examiner seven months later on October 1 disclosed that the causes of death were hypertension and atherosclerotic cardiovascular disease.\nSee also\n* List of Major League Baseball ERA champions\nReferences\nExternal links\n*"
    }
  ]
}