{
  "content": [
    {
      "type": "text",
      "text": "# Samuel Okwaraji\n\n| birth_place         = Orlu, Nigeria\n| death_date          =\n| death_place         = Lagos, Nigeria\n| height              =\n| position            = Midfielder\n| youthyears1 = 1984–1985\n| youthclubs1 = AS Roma\n| years1 = 1985–1986\n| years2 = 1986–1987\n| years3 = 1987–1989\n| years4 = 1987–1988\n| years5 = 1989\n| clubs1 = Dinamo Zagreb\n| clubs2 = Austria Klagenfurt\n| clubs3 = VfB Stuttgart\n| clubs4 = → SSV Ulm (loan)\n| clubs5 = K. Berchem Sport\n| caps1 = 1\n| caps2 = 14\n| caps3 = 0\n| caps4 = 28\n| goals1 = 0\n| goals2 = 0\n| goals3 = 0\n| goals4 = 5\n| nationalyears1 = 1988\n| nationalteam1 = Nigeria Olympic\n| nationalcaps1 = 4\n| nationalgoals1 = 0\n| nationalyears2 = 1988–1989\n| nationalteam2 = Nigeria\n| nationalcaps2 = 8\n| nationalgoals2 = 1\n}}\nSamuel Sochukwuma Okwaraji (19 May 1964 – 12 August 1989) was a professional footballer who played internationally for Nigeria.  He was also a qualified lawyer who had a masters in international law from the Pontifical Lateran University of Rome. He collapsed and died of congestive heart failure in the 77th minute of a World Cup qualification match against Angola at the Lagos National Stadium in Surulere, Lagos State on 12 August 1989.\nCareer\nSam Okwaraji left Nigeria in 1982 to study international law in Italy (Rome). It is there that the Italian first division side, AS Roma (1984–1985), signed him at the age of 20. As an unknown player, it was difficult to force a breakthrough at the mighty Rome, so he moved to Dinamo Zagreb (1985–1986) in Yugoslavia and then on to Klagenfurt (1986–1987) in Austria. At both clubs, he struggled to get sufficient game time to further his development, but the talent was always undeniable. He was a tricky dribbler, with a knack for the incisive creativity that all teams crave.\nIt was at Klagenfurt that German Stuttgart  (1987–1989) signed him.  Okwaraji was one of the first African football players Germany signing a professional contract at the highest level of German football. Not long into the contract, he was loaned to a second division SSV-ULM 1848 (1985–1986). His star blossomed at ULM to point that the club did not play without him. “No Okwaraji, no ULM” was the popular slogan then.\nAfter 1 season with Ulm, he returned to Stuttgart (1987–1988). After that season he signed with Belgian side K. Berchem Sport (1988–1989) on the 1st of July 1988. 1 year later, on 12 August, he died during a world cup qualification game against Angola, at the age of 25.\nInternational career\nSam Okwaraji aspired to become Nigeria's Michel Platini and brazilian Falcao who were both his soccer role models. At fc ULM he was able to play regularly. It was at that time that he started writing many letters to the Nigerian Football Association urging them to try him. None were answered until the Nigeria Football Association chairman, John Obakpolor, agreed with the coaches Manfred Höner and Paul Hamilton to bring him into the training camp when the Nigerian national team was on a tour in West Germany.\nHe started training with the national team on Monday, 5 days later (Saturday) he was in the starting eleven against Algeria for an Olympic qualifier, and was the subject of favourable newspaper reports. He later started in  all of Nigeria's matches.\nHe went on to play for the national team at the 1988 Africa Cup of Nations in Morocco, playing a key role throughout Nigeria's run to the final. He scored one of the fastest goals in the history of the championship against the Indomitable Lions of Cameroon.\nHe played until the final match, where the Eagles lost to their perennial rivals Cameroon by 0 to 1. Okwaraji, who made the Green Eagles squad in 1988 at the African Nations Cup in Morocco, scored one of the fastest goals in the history of African football against Nigeria's perennial rivals, the Indomitable Lions of Cameroon, and was twice named man of the match.\nHe also went to the 1988 Olympics in Seoul, though Nigeria disappointed. Okwaraji remained central to the squad as it began the process of building towards their ultimate aim of a place at the 1990 World Cup. He was a key player as the campaign drew towards its conclusion and that fateful match with Angola.\nLast game and death\nOkwaraji collapsed ten minutes from the end of the 1990 World Cup qualifier against Angola in Lagos. He died from possible complications of hypertrophic cardiomyopathy as an autopsy showed that the 25-year-old had an enlarged heart and high blood pressure.\nLegacy\nSamuel Okwaraji is known as a legend nowadays, a patriot who gave his life to the nation out of love and passion for football. All of a sudden he started playing for the national team of Nigeria where he became a vital key player after his first game. He came to the team as an unknown player showing that with hard work and dedication, you can manifest your dreams. Despite the poor game time at club levels AS Roma, Dinamo Zagreb and Klagenfurt; he kept searching for football clubs urging them to give him a trial. His attitude of persistence and self-belief led to his signing at Stuttgart. He was loaned to SSV-ULM where his career finally began to flourish. When being faced with obstacles and disappointments, he kept the faith.\nThough he only played for 1 year for the national team (8 games to be precise), Okwaraji had won the hearts of the Nigerian nation by his highly energetic, skillful and precise style of play. Apart from him being an extraordinary talent, he was also very humble. Any time he was called up for the national team, he would pay his flight tickets by himself. He clearly saw it as an honour to represent his country, even when his place at his club was at stake. Nobody could prevent him from representing his country.\nWhen Sam Okwaraji started playing for the national team, the Nigerian Football Association asked permission from SSV-ULM 1846, which his club was only willing to accept after having been paid a sum of $45,000. After negotiations the amount came down to $15,000. Sam Okwaraji, a master's degree holder in law, was very upset when hearing this and made it very clear to his club with the following words:\n\"You cannot stop me playing for my country and let me tell you, I am going to represent my country in the World Cup in Italy whether you like it or not\".\nOkwaraji's passion for the game, his sacrifice on the pitch and his humble attitude turned him into an example for everyone who is passionate about football and in general all persons dedicated to manifesting their dreams.\n20 years after his death, as an act of honour and remembrance, the Nigerian government set up a statue of Sam Okwaraji in front of the stadium where he died.  On 19 May 2019, on what would have been his 55th birthday, he was honoured with a Google Doodle. In 2024 a national football tournament will be launched in name of him. Sam Okwaraji Memorial Football Competition is a project financed by the government with the aim to discover promising Nigerian football talents.\nFamily\nSam Okwaraji was born and raised in a family of 7 children. His father, David Okwaraji, died when he was in primary school. The son of Sam Okwaraji's youngest brother has caught the eye of Nigerian football association which led to his eligibility for Nigerian national team U23 in 2021. He, being the cousin of a football legend, has great expectations to fulfill. He has been named after his uncle: Sam Okwaraji Chinedu Junior. There is hope that a new Sam Okwaraji will rise up soon and continue the short but memorable career of his uncle, who died on the pitch at the age of only 25.\nHonours\n;Nigeria\n*African Cup of Nations: 1988\nSee also\n*List of association footballers who died while playing\nReferences\nExternal links\n# [https://web.archive.org/web/20060528144431/http://cybereagles.com/images/sam.jpg Sam Okwaraji's Bust]\n# [https://archive.today/20130222115040/http://www.tribune.com.ng/13082007/news/sports4.html Okwaraji: Thumbs down for FG, NFA]\nExternal sources\n*\n* [https://web.archive.org/web/20170109184420/https://playerhistory.com/player/95172/ Samuel Okwaraji] at Playerhistory\n}}"
    }
  ]
}