{
  "content": [
    {
      "type": "text",
      "text": "# Samurai Warriors 2\n\n|PlayStation 2|EU|September 22, 2006|AUS|September 28, 2006}}PlayStation Network Xbox 360|NA|September 19, 2006|EU|September 22, 2006|AUS|September 28, 2006}}WindowsPlayStation 3, PlayStation Vita}}\n}}\n| genre = Hack and slash\n| modes = Single-player, multiplayer\n}}\nis a sequel to the original Samurai Warriors, created by Koei and Omega Force. The game was released in 2006 for the PlayStation 2 and Xbox 360, and ported to Microsoft Windows in 2008. Like the Dynasty Warriors series, an Empires expansion was released as well, and an Xtreme Legends expansion followed on in August 2007, in Japan. The game, alongside its two expansions, Xtreme Legends and Empires also receive a HD-enhanced port for PlayStation 3 and PlayStation Vita under the name Sengoku Musō 2 with Mōshōden & Empires: HD Version.\nSamurai Warriors 3, the third game in the series, was released in December 2009 for the Wii.\nGameplay\nThe gameplay of Samurai Warriors 2 builds on the first Samurai Warriors by adding new characters and new features, such as the removal of the traditional range attacks in favor of the addition of two unique special abilities that differ from character to character. For example, Oichi can either summon new soldiers to the battlefield or improve the combat abilities of nearby allies, Yukimura Sanada can either whistle to call his mount to his side or perform a flaming charge, and Ginchiyo Tachibana can either increase the strength of her weapon or summon lightning to stun nearby enemy soldiers. In addition, characters movesets can evolve in a larger variety as they level up, elaborating on either their combo, charge or special attacks, with the progression of each character being different from the next. This leads to the characters having 1 of 3 different button combos.\nA returning element from Samurai Warriors is the Survival Mode (Infinite Castle in Sengoku Musō 2). In this mode, the player chooses a character and fights through an endless castle. After choosing the character, four random missions will be given to the player to choose from. To choose a mission the player must pay a fee to perform the mission, though there are certain missions that do not require a fee. After that, the player enters the castle, and a mission will be triggered. After succeeding in the mission, the stairway to the next floor opens, and the player will be able to proceed to the next floor where there will be another mission to complete in order to proceed to the next floor, and so on.\nPlayable characters in the game (except for Ranmaru Mori and Okuni) have their own stories. Each story contains five stages (except for Ieyasu Tokugawa and Mitsunari Ishida, who both have six stages), plus a \"Dream Stage\" or \"Gaiden\" (Side Quest) in the Japanese version, that effectively asks \"what if\". For example, Yukimura Sanada's Dream/Gaiden stage (Battle of Sekigahara) puts him into a battle that took place historically between his fourth and fifth stages (Ueda Castle and Osaka Castle respectively). Correspondingly, since Mitsuhide Akechi and Nobunaga Oda both have endings where they won their historically final battles and survived, their Dream stages have them mopping up their gathered opposition.\nThis game also contains a Sugoroku mini-game as an additional feature. Up to four players can participate in this mode, and each player has to choose a character. The game's goal is to collect the requested amount of gold (depending on the player's settings). At the beginning of the game, three flags for each player will be divided in the map, and players can earn gold and raise their ranks by collecting their respective flags and returning to their home square. Additionally, a player can buy territories on the map, or challenge another player for the control of a territory. There are six types of challenges in the game: Annihilate (requires the players to defeat as many enemies as possible), Chase (requires the players to defeat as many fleeing Fire Ninjas as possible), Destroy (requires the players to destroy as many boulders as possible), Race (requires the players to break through the doors to reach the end before the opponent does), Reveal (requires the players to uncover as many Sky Ninjas as possible), and Steal (requires the players to collect as much gold as possible).\nThe New Officer mode from Samurai Warriors has been removed, but it was reintroduced in Samurai Warriors 2: Empires.\nCharacters\nThe game features a total of 26 characters, 16 returning and 10 new, some of them former unique NPCs from previous game. Almost all characters from previous game (including Xtreme Legends additions) return with the exception of Goemon Ishikawa, Kunoichi, and Yoshimoto Imagawa, although the new character Nene seems to be a replacement for Kunoichi due to similarities in combat characteristics and skills. Two returning characters, Okuni and Ranmaru Mori do not have their own story mode, but they still can be played in Free Mode, Survival Mode and Sugoroku (Including Mercenary Mode). Similar to previous games, the game also features two unique NPCs: Katsuie Shibata and Kojiro Sasaki that can be unlocked as unplayable special bodyguards.\nStarting characters\n* Yukimura Sanada\n* Mitsuhide Akechi\n* Oichi\n* Ieyasu Tokugawa\n* Mitsunari Ishida\n* Ginchiyo Tachibana\n* Kotaro Fuma\nUnlockable characters\n* Keiji Maeda\n* Nobunaga Oda\n* Kenshin Uesugi\n* Okuni\n* Magoichi Saika\n* Shingen Takeda\n* Masamune Date\n* Nō\n* Hanzo Hattori\n* Ranmaru Mori\n* Hideyoshi Toyotomi\n* Tadakatsu Honda\n* Ina\n* Nagamasa Azai\n* Sakon Shima\n* Yoshihiro Shimazu\n* Kanetsugu Naoe\n* Nene\n* Musashi Miyamoto\nAvailable in Empires and Xtreme Legends\n* Kojiro Sasaki\n* Katsuie Shibata\nOnly available in Xtreme Legends\n* Yoshimoto Imagawa\n* Toshiie Maeda\n* Motochika Chosokabe\n* Gracia\nRemoved characters\n* Kunoichi\n* Kennyo Honganji\n* Goemon Ishikawa\nExpansions\nSamurai Warriors 2: Empires\n|NA|February 28, 2007|EU|March 16, 2007}}Xbox 360PlayStation 3 & PlayStation Vita\n| genre       = Hack and slash\n| modes       = 1–2 players\n| platforms   = PlayStation 2, Xbox 360, PlayStation 3, PlayStation Vita\n}}\nSamurai Warriors 2: Empires (戦国無双2: Empires) is an expansion to the original Samurai Warriors 2 and the third Empires expansion by Koei (the first was Dynasty Warriors 4: Empires, and the second was Dynasty Warriors 5: Empires), available for PlayStation 2 and Xbox 360, as well as PlayStation 3 and PlayStation Vita in a compilation with the original and Xtreme Legends. The game was first released in Japan on November 16, 2006. Similar to both Dynasty Warriors 4: Empires and Dynasty Warriors 5: Empires, the game features the strategic and tactical Empire Mode that combines the gameplay of Samurai Warriors and several turn-based strategy elements from ''Nobunaga's Ambition and Romance of the Three Kingdoms''. The Empire mode allows the player to select from some of Japan's greatest battles such as the battle of Kawanakajima, the battle of Anegawa, the incident at Honnōji and the battle of Sekigahara. In the New Officer Mode, the options are limited to 13 models with 10 color patterns each, as well as four different voices. In addition, a new feature is added to the mix: the ability to use movesets of certain playable characters.\nUnlike Samurai Warriors: Xtreme Legends, the game does not feature new characters for the series, but Kojirō Sasaki and Katsuie Shibata, who were unplayable special NPCs and bodyguards in Samurai Warriors 2, are now playable characters in Samurai Warriors 2: Empires with special movesets derived from other characters.\nSamurai Warriors 2: Xtreme Legends\n|EU|March 28, 2008}}Xbox 360}}\nPlayStation 3 & PlayStation Vita\n| genre       = Hack and slash\n| modes       = 1–2 players\n| platforms   = PlayStation 2, Xbox 360, PlayStation 3, PlayStation Vita\n}}\nSamurai Warriors 2: Xtreme Legends (戦国無双2: 猛将伝 Sengoku Musō 2: Mōshōden) was first released on August 23, 2007, in Japan for the PlayStation 2. It is the fifth Xtreme Legends expansion by Koei, and also the first (and only) Xtreme Legends expansion since Dynasty Warriors 4: Xtreme Legends to be released after Samurai Warriors 2: Empires (other Xtreme Legends expansions are released shortly after the release of the original game). It shares the same achievements with the parent game on the Xbox 360. The expansion introduced new characters to the series, including Toshiie Maeda, Gracia and Motochika Chosokabe. Yoshimoto Imagawa from Samurai Warriors: Xtreme Legends returned in the expansion with an updated character design, Katsuie Shibata and Kojirō Sasaki from Samurai Warriors 2: Empires are also playable and have new weapons. Katsuie Shibata wields two hand axes, while Kojirō Sasaki still carries a nodachi, but can now summon an ex-dimensional sword during battle. Because Yoshimoto Imagawa was put back into the game, the previously omitted battle of Okehazama is brought back, and Hideyoshi's Shikoku campaign against Motochika Chosokabe is also included.\nA new mode known as Mercenary Mode is in the game. It resembles Xtreme Mode from Dynasty Warriors 5: Xtreme Legends. Playable characters can now be upgraded to level 70; in the original the highest level was 50. Bodyguards can also level up to 30, when in the original 20 was the highest level. Fifth weapons are present in the game, but unlike the first game, the weapons have the same attack base as the original (before, the fifth weapon would have a higher attack base). Some considered it as an \"alternative fourth weapon\". In Samurai Warriors 2, the highest upgrade is fourth weapons.\nIn order to play the full functionality of this game the original is required. \"Import\" selected on the main menu will guide the players though a disk switching process. Xbox 360 players had to download the expansion via the Xbox Marketplace as there is no stand alone disc available in stores. As for the PlayStation 3 and PlayStation Vita players, the game is bundled along with the two other versions of this game (the original and Empires), thus the players are no longer required to use the \"Import\" feature.\nThere is a cutscene in the game (Toshiie Maeda's ending) that was censored and different in the Xbox 360 version because it was considered too violent, so the original ending can only be viewed in the PS2 version.\nReception\nSamurai Warriors 2\n| EGM_X360 = 4.5/10\n| EuroG_X360 = 7/10\n| Fam_PS2 = 36/40\n| GI_PS2 = 6/10\n| GI_X360 = 6/10\n| GameRev_PS2 = D−\n| GameRev_X360 = D−\n| GSpot_PS2 = 6/10\n| GSpot_X360 = 5.4/10\n| GSpy_PS2 =\n| GameZone_PS2 = 6.8/10\n| GameZone_X360 = 5.3/10\n| IGN_PS2 = 5.8/10\n| IGN_X360 = 5.5/10\n| OPM_PS2 = 5/10\n| OXM_X360 = 6.5/10\n| PCGUK_PC = 47%\n| rev1 = The A.V. Club\n| rev1_PS2 = C\n| rev1_X360 = C\n| rev2 = The Times\n| rev2_PS2 =\n| rev2_X360 =\n| GR_PC = 49%\n| GR_PS2 = 61.97%\n| GR_X360 = 55.89%\n| MC_PC = 43/100\n| MC_PS2 = 58/100\n| MC_X360 = 52/100\n}}\nReviews of Samurai Warriors 2 ranged from mixed to negative. GameRankings and Metacritic gave it a score of 62% and 58 out of 100 for the PlayStation 2 version; 56% and 52 out of 100 for the Xbox 360 version; and 49% and 43 out of 100 for the PC version. The only positive review came from Famitsu, which gave the PS2 version a score of 36 out of 40.\n| GI_X360 = 4.75/10\n| GamePro_PS2 =\n| GSpot_PS2 = 6.3/10\n| GSpot_X360 = 6/10\n| GSpy_PS2 =\n| GSpy_X360 =\n| GRadar_PS2 =\n| GRadar_X360 =\n| GameZone_PS2 = 5/10\n| GameZone_X360 = 5.5/10\n| IGN_PS2 = 5.5/10\n| IGN_X360 = 5.5/10\n| OXM_X360 = 6/10\n| XPlay_X360 =\n| rev1 = The A.V. Club\n| rev1_PS2 = C\n| rev1_X360 = C\n| GR_PS2 = 57.19%\n| GR_X360 = 55.05%\n| MC_PS2 = 55/100\n| MC_X360 = 53/100\n}}\nEmpires was met with a mixed reception. GameRankings and Metacritic gave it a score of 57% and 55 out of 100 for the PS2 version, and 55% and 53 out of 100 for the X360 version.\n| GSpot_PS2 = 5/10\n| GRadar_PS2 =\n| GRadar_X360 =\n| IGN_PS2 = 5.3/10\n| IGN_X360 = 5/10\n| OPMUK_PS2 = 5/10\n| PSM3_PS2 = 44%\n| GR_PS2 = 53%\n| GR_X360 = 52.50%\n| MC_PS2 = 50/100\n| MC_X360 = 42/100\n}}\nXtreme Legends was met with mixed to negative reception. GameRankings and Metacritic gave it a score of 53% and 50 out of 100 for the PS2 version, and 53% and 42 out of 100 for the X360 version.\nReferences\nExternal links\n* [http://www.koei.com Koei's official site]\n* [http://www.gamecity.ne.jp/sengoku2/ Samurai Warriors 2] at [http://www.gamecity.ne.jp/ Gamecity]\n* [https://web.archive.org/web/20070202010013/http://www.koei.com/launch/samurai_warriors2/main.htm Official Samurai Warriors 2 minisite]\n* [https://archive.today/20130111042641/http://www.koei.com/sw2e/ Official Samurai Warriors 2 Empires minisite]\n* [http://www.koei.com/sw2xl/ Official Samurai Warriors 2 Xtreme Legends minisite]\n* [http://www.agilesound.com Agile Sound's official site]\n* [http://www.totalcasting.ca Total Casting's official site]\n* [http://www.samuraiwarriors2xl.co.uk/ Official Samurai Warriors 2 Xtreme Legends European minisite]\n* [http://www.gamecity.ne.jp/sengoku2m/ Samurai Warriors 2 Xtreme Legends] at Gamecity\n* [http://www.gamecity.ne.jp/sengoku2e/ Samurai Warriors 2 Empires] at Gamecity\n*\n*\n*"
    }
  ]
}