{
  "content": [
    {
      "type": "text",
      "text": "# Samurai Warrior: The Battles of Usagi Yojimbo\n\n|designer =\n|engine =\n|released =\n|genre = Adventure\n|modes = Single-player\n|platforms = Commodore 64  Amstrad CPC  ZX Spectrum\n}}\nSamurai Warrior: The Battles of Usagi Yojimbo is a video game released for the Commodore 64, ZX Spectrum and Amstrad CPC platforms in 1988, by the now-defunct label Firebird. It is based on the comic book Usagi Yojimbo, which featured the adventures of an anthropomorphic samurai rabbit. The game closely follows some of the themes of the comic. The package artwork comes from the cover of the comic book Anything Goes #6.\nThe game was released in the United States under the title Usagi Yojimbo as part of the Thunder Mountain Action Pack, Vol. 1. It was contained on Disk 1, Side 1 along with the games Great Escape, Paradroid, and (on Side 2) Implosion. The packaging for this version used artwork from the cover of Usagi Yojimbo Volume 1, #17 along with images from the other games included in the set.\nThe game was designed and programmed by Doug Palmer, Paul Kidd and Russel Comte. Neil Brennan wrote the music.\nGameplay\nUsagi fighting with a bandit.\nThe game is a sideways-scrolling adventure, where Miyamoto Usagi has to defeat opponents in sword fights, and also have encounters with other characters (also anthropomorphic animals), for example priests, who usually carry a cane and utter Zen Buddhist kōans, such as \"if you see the Buddha on the path, kill him\". Usagi is often attacked by bandits and enemy ninja. These opponents frequently disguise themselves as harmless peasants, villagers or priests.\nAlthough progress is always left-to-right, there are branches along the way that allow some gameplay liberty. There is also a sword training level, with bales of hay instead of enemies.\nThe scoring system is based on karma; doing good deeds raises Usagi's karma, and doing bad deeds reduces it. If Usagi's karma drops to zero, he will perform seppuku. Good deeds include killing armed opponents and donating money to peasants and priests. Conversely, attacking priests or unarmed characters or even drawing his sword in front of them reduces it (besides turning them hostile).\nTo earn money, Usagi can gamble at inns along the path and collect coins from slain enemies. The money can be spent on food, which in turn increases his energy.\nPlanned content\nThe game was originally envisioned as a much larger, open world experience, but due to the hardware and memory limitations of the Commodore 64, for which it was originally developed, numerous features had to be cut from the final product.\nPaul Kidd and Russel Comte originally wrote a much larger script for the game, which would see Usagi be able to traverse through many multiple paths and lead to entirely different adventures and endings. In the design documents for the game, characters and situations are detailed such as mole ninjas surfacing out of the soil, a side quest rescuing an innocent villager being dragged by a stampeding horse and numerous activities such as gambling and dialogue sequences in the town sections of the game.\nLikewise, the karma system was downscaled into a simplistic numeric system which acted as an onscreen counter that led Usagi to commit suicide if it fell under 0. In the original game design documents, karma was envisioned as a more fulfilled reputation system, which would affect the NPCs' views and actions towards Usagi.\nReception\nZzap!64 enjoyed the game, describing it as \"an excellent adaptation of the oriental beat 'em up theme, and a good conversion from the comic\". It was awarded an overall rating of 91%.\nReferences\nExternal links\n* [http://www.hardcoregaming101.net/samurai-warrior-the-battles-of-usagi-yojimbo-commodore-64-amstrad-cpc-zx-spectrum-1988samurai-warrior-remakes/Samurai Warrior: The Battles of Usagi Yojimbo at Hardcore Gaming 101]\n*\n*"
    }
  ]
}