{
  "content": [
    {
      "type": "text",
      "text": "# Sangley Rebellion (1603)\n\n| date              = October 1603\n| place             = Manila, Luzon, Spanish Philippines\n| result            = Spanish repression and massacre of Sangley Chinese\n| status            =\n| combatant1        =  Spanish Empire\n*  Spanish Philippines\n* Japanese residents of Spanish Philippines\n| combatant2        = * Sangley Chinese residents of Spanish Philippines\n| commander1        =  Luis Pérez Dasmariñas\n| commander2        = Encang / Eng Kang (Juan Bautista de Vera)\n| units1            =\n| units2            =\n| strength1         =\n| strength2         =\n| casualties1       = 128 Spanish soldiers and Tagalog militiamenUnknown number of allied Japanese residents\n| casualties2       = 15,000–25,000 killed\n}}\nThe Sangley Rebellion was a series of armed confrontations between overseas Chinese, known as the Sangley, and the Spanish and their allied forces in Manila under the Captaincy General of the Philippines, in October 1603. The local ethnic Chinese residents dominated trade and outnumbered Spanish residents in Manila by a five-to-one ratio, although both were minorities to the indigenous Tagalog population. The ruling Spaniards feared and resented the rival Chinese minority. Policies of persecution were enacted against the local Chinese residents and they were expelled from the city to an undesirable swamp area in 1586, which the local Chinese turned into a thriving town (modern-day Binondo). The local Chinese planned a strike due to worsening relations, but it resulted in the execution of their mayor (cabecilla / Capitan chino / alcalde), and became a rebellion. It ended in the massacre of more than 20,000 ethnic Chinese in Manila at the hands of the Spaniards, local Japanese (residing in Dilao), and indigenous Tagalog forces.\nBackground\n(Modern-day Intramuros) with Parián above and Binondo (Manila Chinatown) on the left via the Velarde map, 1734]]\nChinese settlement\nfrom Southern Fujian to Manila during the early 1600s]]\nChinese merchants had been making trading voyages to Manila well before the Spanish arrival. Chinese traders were noted in the first Spanish records of the area made by Ferdinand Magellan in 1521 and García Jofre de Loaísa in 1527. In 1570, Spanish soldiers led by conquistador Martín de Goiti conquered Manila. The local Tagalog people had only recently developed a nominal Muslim rulership under Rajah Sulayman against the rival older Tondo state; they did not raise sustained opposition to Spanish occupation after the then small town of Maynila was destroyed and conquered. The local Chinese merchants had settled at Parián by the Pasig River just outside of Manila (modern-day Intramuros) in an area granted to them by the former local rulers. They were initially friendly to the arriving Spaniards, who rescued a disabled Chinese ship off Mindoro in 1571. Some of the rescued visited Manila in 1572 with large cargo shipments. In 1573 the first cargo of Chinese goods was shipped across the Pacific Ocean to Acapulco in New Spain. Trade with the Chinese merchants continued until the Sangley Chinese dominated nearly all the trade to the Americas from Manila via the Manila Galleons to Acapulco.\nSpanish control\n's 1574 wokou pirate attack of Manila from La Illustración Filipina, 1894]]\nArmed conflict first erupted between initially wokou pirates (composed of both Chinese and Japanese members) capturing a Chinese merchant ship from Southern Fujian engaged in trade with the Spaniards from Manila, later spreading to local Chinese residents of Manila, who were mostly Hokkien as evidenced in the Hokkien writing in the Boxer Codex (circa 1590s), since the Spaniards were wary of any and all Chinese pirates and did not know the difference between Chinese ethnolinguistic groups, could not tell apart friend from foe so simply generalized all ethnic Chinese no matter the profession or ethnolinguistic group. In 1574, the Teochew pirate, Lim A-hong, envious of the profits of the Hokkien Chinese merchant trade routes to Manila attempted to take over Manila himself with his force of wokou pirates, composed of a fleet of 62–70 ships, 3000 wokou Chinese pirates, and 400 wakō Japanese ronin, on November 29 and December 2, 1574, and was repelled both times. He withdrew to Pangasinan, from where he was ejected in March 1575 by a force of local Pangasinense soldiers led by the Spanish authorities. An officer from the Ming dynasty, Wang Wanggao, who had been sent to track down Lim A-hong, was received cordially in Manila. He returned to Fujian with two Spanish envoys and two priests hoping to gain permission to proselytize in China. Although the initial reception of the Spanish in China was positive, the negotiations soon floundered, and the relationship between the Chinese of mainland China and visiting Spaniards became more violent.\nBy 1586, the Spanish became concerned with the profit the Chinese merchants were making from trade. They were also concerned about being far outnumbered by the local resident Chinese, who totaled an estimated 10,000 in Manila, compared to around 2,000 resident Spaniards. The Spanish forced the local Chinese residents out of the city (present-day Intramuros) to a swampy area northeast of the city walls (present-day Parián de Arroceros). Despite this setback, the local Chinese residents soon developed a thriving town with a pond in its center. By 1590, in addition to trade, the local Chinese residents dominated industries such as bread-making, book-binding, tavern-keeping, and stone-masonry.\nIn 1587, the Dominicans built a church to proselytize to the local Chinese residents. Their letters back to their order from 1589 and 1590 claim that there was considerable interest from the local Chinese residents to convert and adapt their local culture to the Spanish model. By 1603 the Spanish colonial authorities made it an established practice to appoint a Christian Chinese person as mayor (cabecilla / Capitan chino / alcalde) over the local Chinese residents. At the same time, the Spanish sought to restrict local Chinese enterprises.\nAround 1600 the Spanish started to sell a limited number of residence permits, only 4,000, to the local resident Chinese at 2 reals each. The Spanish also tried to restrict Chinese trade. A decree in 1589 made prices of all Chinese imports uniform and agreed-upon prior to the trading season. In 1593 the Spanish closed Peru to Chinese imports and prohibited Spanish voyages to China. Only certain Spaniards were allowed to trade Chinese goods.\nArmed conflict\nIn 1593, Governor Gómez Pérez Dasmariñas was killed in a mutiny by his local Chinese rowers. The rowers fled to Vietnam, where most of them stayed. Some returned to China, where their leader was punished. Fearing an attack by the resident local Chinese in Manila, the Spanish forced them to relocate to the north side of the Pasig river around present-day Binondo. In 1596, 12,000 local Chinese residents were denied residency and deported from Manila back to China. In 1603, Spanish fear of the local resident Chinese and dependence on their merchants and the China trade, coupled with the effects of continued immigration, led to efforts to suppress them, and the massacre of over 20,000 local Chinese residents.\nIncident\nBackground\n]]\nTwo Fujian adventurers, Yan Yinglong and Zhang Yi, told Gao Cai, a eunuch tax and mines commissioner in Fujian, that there was a mountain of gold on the Cavite Peninsula in Manila Bay. A plan was made to send a naval expedition to open a gold mine and obtain said gold by landing in Manila and supposedly securing the reported area, but several censors protested this. Provincial authorities did not believe there was gold where Zhang Yi described but felt they had to send some kind of expedition, if only to prove Zhang wrong. So an assistant county magistrate, Wang Shihe, and a company commander, Yu Yicheng, were sent to confirm the story, along with Zhang in chains.\nThe Ming delegation arrived in March 1603 and was received by governor Pedro Bravo de Acuña. They were well treated, but when they tried to administer justice in the Chinese community, they were ordered to stop. In May they made it clear to the governor that they did not believe there was a mountain of gold but were obliged to obey their orders.\nThe governor allowed them to go to Cavite, where they took a basket of dirt, then left for China. The Spanish did not believe the expedition had been sent only to search for gold. Archbishop of Manila Miguel de Benavides, O. P. suspected that they had been a probe sent in advance of a major Chinese invasion. The Spanish feared that the local Chinese would cooperate with an invasion. Spanish, Tagalog, and even local Japanese residents (residing in Dilao) began to threaten the local Sangley Chinese residents.\nRebellion\ninhabitants of the Philippines]]\nA large group of local Chinese residents planned a strike. The Chinese mayor (Capitan chino), Juan Bautista de Vera, a wealthy Catholic, tried to dissuade them but found that his own adopted son was the leader. They tried to persuade him to become their leader, but he refused and reported them to the Spanish authorities. The authorities arrested him after finding gunpowder in his house and eventually executed him.\nAlerted to the unrest among the local Chinese residents, the Spanish soldiers shut the city gates on the night of October 3. One resident Spanish family was murdered north of the Pasig, while an attack on the church in Tondo was repelled by Spanish soldiers, whose commander, Luis Pérez Dasmariñas, overconfident of Spanish strength, pursued the local Chinese rebels. When cautioned against attacking by his fellow officers, he derided them as cowards and retorted that \"twenty five Spaniards were enough to conquer the whole of China\". The Spanish soldiers followed the local Chinese rebels into a swamp, where they were surrounded and cut down.\nOn October 6, local Chinese resident rebels crossed the Pasig river and attacked the city walls with ladders and siege towers. While they had obtained some firearms from the Spanish soldiers they had defeated, they did not have enough to overcome the artillery on the walls. Their assault was defeated and their ladders and towers demolished by cannon shots. After a day or two, Spanish and local resident Japanese soldiers sortied out and attacked the local Chinese resident rebels with support from Tagalog auxiliaries. The rebels fled and were pursued through the countryside in the following weeks. Those who were captured were killed. An estimated 15,000 to 25,000 local Chinese residents deemed as rebels were slaughtered.\nAftermath\nAfter the slaughter, the Spanish realized that they could not survive without Chinese trade and industry. They assured the remaining local Chinese merchants that normal trade would be restored and continue as usual. Spanish officials sent letters to Fujian and Guangdong authorities explaining what had happened. Fujian officials blamed most of what had occurred on Zhang Yi, but replied that the Spanish should not have killed the local Chinese, and that widows and orphans should be sent back to China. No further action was taken.\nBecause the local Chinese town had been devastated, Chinese merchants visiting Manila in 1604 were given fine lodging inside the walled city instead. Trade quickly returned to normal, with 1606–1610 averaging over three million pesos per year, the highest five-year average in history.\nThe surviving local Chinese residents continued to live under Spanish rule. Although they were exempt from the labour and dues required of indigenous Filipinos (such as Tagalogs), the resident Chinese had to pay a license fee of eight pesos a year, and often suffering additional extortion and harassment from sellers. They were also subject to population control, with the Spanish establishing a limit of 6,000 resident Chinese in Manila. But the ethnic Chinese population in the 1620s and 1630s ranged from 15,000 to 21,000. The local Chinese residents petitioned the king of Spain for self-government, but this proposal was rejected in 1630.\nAs the local Chinese population continued to swell, reaching 33,000–45,000 by 1639, they entered other industries such as farming. They were laborers on their own in outlying areas, employed on estates of religious orders, or used as farm labor in forced settlement projects. This large rural resident Chinese population rebelled again in 1639, and suffered another massacre.\nArt history\nThe Museo Bello in Puebla, Mexico has a wooden chest in its collection adorned with what is believed to be the oldest image of Manila. Its dating was determined by the details, said to reflect Manila just prior to the October massacre. \"The most important visual clue that can be found in the painting is the group of figures in the Parián.\" This scene depicts three Chinese officials mounted on horseback, accompanied by three stewards, in a deserted marketplace, which otherwise would have been teeming. The three officials have been identified as the three visitors arriving to determine the validity of the story of the mountain of gold in Cavite.\nSee also\n* Sino-Spanish conflicts\n* Battle of Manila\nNotes\nReferences\n*  ([http://homepage.ntu.edu.tw/~borao/2Profesores/massacre.pdf Online version])\n*\n*\n*\n*"
    }
  ]
}