{
  "content": [
    {
      "type": "text",
      "text": "# Sanjaya dynasty__disambig_1\n\ntemple complex, a legacy of the Sañjaya dynasty]]\nThe Sanjaya dynasty () was a Javanese dynasty which ruled the Mataram kingdom in Java during the first millennium CE. The dynasty promoted Hinduism on the island.\nOrigin\nAccording to the Canggal inscription, the dynasty was founded in 732 by Sanjaya of Mataram. The inscription was discovered in the village of Canggal, southwest of Magelang. This inscription was written in the Pallava script and describes the erection of a linga (a symbol of Shiva) on the hill in the Kunjarakunja area. According to the inscription, the area is on an island known as Yawadwipa (Java) which contained much rice and gold. Yawadwipa was ruled by King Sanna, whose long reign was characterized by wisdom and virtue. After Sanna died, the kingdom fell into chaos and confusion. At this time, Sanjaya of Mataram ascended to the throne. He was the son of Sannaha, Sanna's sister. Sanjaya mastered the scriptures and the martial arts and military arts. He conquered neighboring areas, and his wise reign led to peace and prosperity.\nAccording to Carita Parahyangan (a later text which primarily describes the history of the Sunda Kingdom), Sanjaya was the son of Sanna and Sannaha . This relationship, between King Sanna and Sanjaya, was not provided in the Canggal inscription. The Carita Parahyangan also says that King Sanna was defeated by his cousin, King Purbasora of Galuh, and retreated to Mount Merapi. Sanjaya later reclaimed Sanna's kingdom and ruled West Java, Central Java, East Java, and Bali. He was also involved in battle with the Malayu and Kalingga Kingdoms. Except for minor differences, Carita Parahyangan aligns with the Canggal inscription.\nRelations with Shailendra\nThe Sanjaya–Shailendra relationship has been uncertain. Poerbatjaraka theorized that there was no distinct Sanjaya dynasty and one dynasty, Shailendra, ruled central Java. The kingdom was called Mataram (Javanese: ), with its capital in the Mataram area. Sanjaya and his offspring belonged to the Shailendra family, who were initially Shaivist.\nAnother theory suggests that the Sanjaya dynasty was forced into northern Java by the Shailendra dynasty, which emerged around 778. Evidence for this event is based on the Kalasan inscription. The Sanjaya and Shailendra dynasties co-existed during this period in central Java, which was characterized by peace and cooperation.\nThe association of Shailendra with Mahayana Buddhism began after the conversion of Raja Sankhara (Rakai Panaraban or Panangkaran) to Buddhism. Later Shailendran kings, successors of Panangkaran, also became followers of Mahayana Buddhism and gave it royal patronage in Java until the end of Samaratungga's reign. This theory is based on the Raja Sankhara inscription (now missing), the Sojomerto inscription, and the Carita Parahyangan manuscript. Shaivism regained royal patronage again from the reign of Pikatan to the end of the Mataram Kingdom.\nThe Shailendra family used the Old Malay language in some of their inscriptions, which suggests the dynasty's origin in Sumatra and their connections with Srivijaya. This theory posits that the Shailendras, with their strong connections to Srivijaya, gained control of central Java and ruled the rakais (local Javanese lords); this included the Sanjaya, incorporating the dynasty's kings into their bureaucracy. The dynastic court was apparently in the southern Kedu Plain, near Magelang (north of Yogyakarta).\nRelations with Champa\nThe Javanese kingdoms maintained a close relationship with the Champa polities of mainland Southeast Asia as early as the Sanjaya dynasty. Like the Javanese, the Chams are an Austronesian people. An example of their relationship can be seen in the architecture of Cham temples, which share a number of similarities with temples in central Java built during the Sanjaya dynasty.\nRuler of central Java\nCrown prince Rakai Pikatan married Pramodhawardhani (833–856), a daughter of the Shailendra king Samaratungga. The influence of the Hindu Sanjaya began to replace the Buddhist Shailendra in Mataram. Rakai Pikatan overthrew King Balaputra, son of Samaratungga and the brother of Pramodhawardhani. In 850, the Sanjaya dynasty became the sole ruler in Mataram. This ended the Shailendra presence in central Java and Balaputra retreated to rule in Srivijaya, Sumatra.\nInformation about the Sanjaya dynasty is also found in the 907 Balitung inscription; when a ruler died, he assumed a divine form. From this inscription, scholars estimated the sequence of the Sanjaya kings:\n* Sanjaya (732–760)\n* Panangkaran (760–780)\n* Panungalan (780–800)\n* Samaragrawira (Rakai Warak) (800–819)\n* Rakai Garung (819–838)\n* Rakai Pikatan (838–850)\n* Rakai Kayuwangi (850–898), also known as Lokapala\n* Balitung (898–910)\nDuring the Sanjaya dynasty, classic Javanese literature blossomed. Translations and adaptations of classic Hindu literature into Old Javanese were produced, such as the Kakawin Ramayana. Around the 850s, Pikatan began construction of the Prambanan temple in central Java; it was later completed and expanded by King Balitung. The Prambanan temple complex is one of the largest Hindu temple complexes in Southeast Asia, rivaling Borobudur (the world's largest Buddhist temple).\nSanjaya kings after Balitung were:\n* Daksa (910–919)\n* Tulodong (919–924)\n* Wawa (924–929)\n* Mpu Sindok (929–947)\nDecline\nIn 929, Mpu Sindok moved the Mataram court from central Java to eastern Java for unclear reasons. Possible causes include an eruption of the Merapi volcano, a power struggle, or political pressure from the Shailendra dynasty in the Srivijaya Empire.\nThe move to eastern Java marked the end of the Sanjaya dynasty, and it was followed by the Isyana dynasty.\nSee also\n* Candi of Indonesia\n* List of monarchs of Java\nReferences\nExternal links\n* [http://www.indonesia-tourism.com/central-java/klaten/prambanan/us.html About Prambanan Temple Indonesia]"
    }
  ]
}