{
  "content": [
    {
      "type": "text",
      "text": "# Santhal rebellion__disambig_1\n\n| coordinates2  =\n| map_type      = India\n| map_size      =\n| map_caption   = Location of the rebellion\n| map_label     = Santhal Pargana\n| map_label2    =\n| planned       =\n| planned_by    =\n| commanded_by  = Sidhu and Kanhu Murmu\n| objective     = Removal of the zamindari system\n| target        =\n| date          = ()\n| time          =\n| time-begin    =\n| time-end      =\n| timezone      =\n| executed_by   =\n| outcome       = *Creation of Santal Parganas district, viz. The Sonthal Parganas Act, Act 37 of 1855\n* Land protection regulations, viz. The Santhal Parganas Tenancy Act, 1876\n| casualties    = 10,000-15,000 deaths, many displaced\n| fatalities    =\n| injuries      =\n}}\nThe Sonthal Rebellion, also known as the Santhal Rebellion, Santal Rebellion, or Santhal Hool, was a rebellion in present-day Jharkhand against the East India Company (EIC) and zamindari system by the Santals. It started on 30 June 1855, and on 10 November  1855, martial law was proclaimed by the East India Company which lasted until 3 January 1856, when martial law was suspended and the rebellion was eventually suppressed by the presidency armies.\nThe rebellion was led by the four sibling brothers, Sidhu, Kanhu, Chand and Bhairav who was the main leader of the Santhal Tribe and their two sisters Phoolo and Jhano, who were killed in the cause.\nBackground\nThe rebellion of the Santhals began as a reaction to end the revenue system of the East India Company (EIC), usury practices, and the zamindari system in India; in the tribal belt of what was then known as the Bengal Presidency. It was a revolt against the oppression of the colonial rule propagated through a distorted revenue system, enforced by the local zamindars, the police and the courts of the legal system set up by the British East India Company.\narea before  arrival of the Santhal people. Damin-i-koh region labeled as \"Country Unexplored by Europeans\" (1776 map by James Rennell).]]\nThe Santals lived in a territory that stretched from Hazaribagh to Medinipur, spanning the Subarnarekha River, along with other Munda ethnolinguistic tribals, and they engaged on agriculture. Those areas were greatly affected by the 1770 Bengal famine, thus creating a need for virgin land.\nIn 1832, the EIC demarcated the Damin-i-koh region in present-day Jharkhand and encouraged the pre-existed Paharia tribe of the Rajmahal hills to clear forests and practice agriculture. However, the Paharia tribe declined the offer, leading the company to invite the Santals to settle in the region. Due to promises of land and economic amenities a large numbers of Santals came to settle from Dhalbhum, Manbhum, Hazaribagh, Midnapore, and other surrounding areas. Soon, their population increased significantly; for instance, within a 13-year timeframe, they grew from 3,000 in 1838 to 82,790 in 1851. The wave of migration started in the late 1790s and continued till the beginning of the rebellion, as The Illustrated London News reported on 23 February 1856 that around  Santals had settled in the area. This growth in the number of agriculturists resulted in a 22-fold increase in Company revenue from the area. Subsequently, Mahajans and Zamindars, acting as money lenders, tax collectors, and other intermediaries employed by the EIC, came to dominate the local economy, governance, and administration with the effect of Permanent Settlement Act of 1793. Many Santals became victims of corrupt money lending practices. They were lent money at exorbitant rates. When they were unable to repay the loan, their lands were forcibly taken and they were forced into bonded labour. Numerous petitions were made by disgruntled Santal leaders to the administration against these activities, but these were largely ignored. This sparked the Santals to mobilise against the intermediaries, eventually leading to a rebellion against the EIC and the establishment of self-governance.\nIn the lead up to the rebellion, the EIC recorded numerous instances of dacoits who were especially targeting Bengali zamindars. One was Bir Singh Manjhi, a Santal who led a gang of robbers and who claimed to have received support from a god who had whispered a secret mantra into his ear. Many other leaders like him promoted a mix of anti-state activity mixed with millenarian fervour, making the Santals ripe for rebellion. Simultaneously, a chieftain called Margo Raja began cultivating a network of secret disciples throughout the Damin-i-koh, aiming to unite all Santals into a single body. In addition, several calamitous portents arrived in the Damin-i-koh that frightened the Santals:\n* The appearance of Lag Lagin snakes\n* Women with equal numbers of children exchanging vows of friendship\n* Buffalo calves were resting in front of houses, during which time the occupants would die\n* A golden boat in the Ganga sank after a Dom touched it\n* A child born to an unmarried girl was a suba (short for Subedar, identifying an official leader)\n* People were coming to kill the dikkus (non-tribals) and to identify themselves Santals should hang a buffalo hide and pair of flutes at the end of the village street\nThe tales of these various calamities made the Santals more fearful, and the rumours of them spread from village to village and made them alert for anyone promising to save them.\nRebellion\n| width=360\n| height=280\n| zoom = 8\n| mark-coord =\n| caption = Locations associated with the Santhal rebellion\n| label = Bhognadih\n| label-pos = right\n| mark-title = Bhognadih\n| mark = RedDot.svg\n| mark-size= 8\n| mark-description=Village of Sidhu and Kanhu Murmu\n| mark-coord1 =\n| label1 = Maheshpur\n| label-pos1 = left\n| mark1 = RedDot.svg\n| mark-size1 = 8\n| mark-title1 = Maheshpur\n| mark-description1 = Conflict on 24 July 1855\n| mark-coord2 =\n| label2 = Barhait\n| label-pos2 = left\n| mark-size2 = 8\n| mark-title2 = Barhait\n| mark-description2 =\n| mark-coord3 =\n| label3 = Suri\n| label-pos3 = top\n| mark-size3 = 8\n| mark-title3 = Suri\n| mark-description3 =\n| mark-coord4 =\n| label4 = Narayanpur\n| label-pos4 = right\n| mark-size4 = 8\n| mark-title4 = Narayanpur\n| mark-description4 =\n| mark-coord5 =\n| label5 = Kumrabad\n| label-pos5 = right\n| mark-size5 = 8\n| mark-title5 = Kumrabad\n| mark-description5 =\n| mark-coord6 =\n| label6 = Pakur\n| label-pos6 = left\n| mark-size6 = 8\n| mark-title6 = Pakur\n| mark-description6 =\n| mark-coord7 =\n| label7 = Rajmahal\n| label-pos7 = right\n| mark-size7 = 8\n| mark-title7 = Rajmahal\n| mark-description7 =\n| mark-coord8 =\n| label8 = Jangipur\n| label-pos8 = right\n| mark-size8 = 8\n| mark-title8 = Jangipur\n| mark-description8 =\n| mark-coord9 =\n| label9 = Murshidabad\n| label-pos9 = left\n| mark-size9 = 8\n| mark-title9 = Murshidabad\n| mark-description9 =\n| mark-coord10 =\n| label10 = Samserganj\n| label-pos10 = right\n| mark-size10 = 8\n| mark-title10 = Samserganj\n| mark-description10 =\n}}\nOn 30 June 1855, two Santal brother, Sidhu and Kanhu Murmu, gathered about ten thousands of Santhal people, claiming that they had been visited by Thakur Bonga (the great spirit), who had instructed them to drive out outsiders—including mahajans, zamindars, and the British—and establish Santhal rule in the region. Kanhu, Sidhu, and their two brothers Chand and Bhairav each asumed the position of suba (leader), marking the start on the rebellion.\nThe Santal Rebellion quickly escalated after the declaration of war, with Santals attacking zamindars, moneylenders, and Company officials. During the rebellion, Sidhu Murmu ran a Santal government in order to collect taxes by making and enforcing his own laws. The scale of the uprising caught the East India Company (EIC) by surprise, as reports of armed Santal mobilization flooded in. On 9 July 1855, the District Magistrate of Bhagalpur reported that 1,000 Santals were ready, with 4,000–5,000 more awaiting orders. The District Magistrate of Aurangabad, A. Eden, relying on intelligence from zamindars and a former Santal court scribe, reported that 9,000 Santals were gathering in Murdapur with plans to attack Pakur Raj, Samserganj, and then return to Rajmahal and Bhagalpur after ritualistically dipping in the Ganges. By 10 July, an estimated 10,000–12,000 Santals were assembling near Jangipur, and the Aurangabad magistrate later claimed they had occupied railway houses. Reports from Birbhum suggested another 13,000 rebels were burning railway bungalows and threatening Pakur. Rumors spread that Santals from Bankura and Singhbhum were joining the fight, and even non-Santal groups like the Mal Paharias participated. Meanwhile, Sidhu and Kanhu Murmu sent letters to zamindars, attempting to persuade or intimidate them into supporting the rebellion.\nThe precise number of fighters under Sidhu and Kanhu remained uncertain. On 9 July, a non-Santal witness under oath estimated their force at 7,000 men, while a later report suggested they commanded 30,000 rebels, with 12,000 set to attack Rajmahal and the rest moving along the railway line to Jangipur and Murshidabad. By 11 July, news of the rebellion reached Bhagalpur, where 20,000 armed Santals were said to be marching westward and threatening non-Santals. The rebels advanced with 1,000-man attack squads, reaching Colgong (modern Kahalgaon) by 11 July and severing road and rail connections to Bhagalpur by 17 July. Declaring Company rule over, they proclaimed the rule of their suba (leaders). A British proclamation on 15 July urging them to surrender and promising to examine their grievances was ignored. The Santals then routed a company of Paharia Rangers and inflicted a humiliating defeat on EIC troops at Narayanpur, killing several Indian officers and 25 sepoys. The British weapons malfunctioned due to wet gun caps, fueling superstitions that Sidhu and Kanhu had divine protection, as they had earlier claimed EIC guns would turn to water. To prevent panic, the EIC worked to reassure its soldiers that the failure was purely mechanical rather than supernatural.\nThe Santal victory at Narayanpur boosted morale, with the Santals looting and burning villages along the Rajmahal to Palassour road by 21 July 1855. Many zamindars took refuge in Rajmahal, but were prohibited from attacking the rebels. The city was poorly defended with only a small force of police, 12 Europeans, and 160 sepoys. Meanwhile, 12,000 Santals were marching towards the city. The Bhagalpur Commissioner was ordered to redistribute troops, leaving Rajmahal vulnerable. The Santals, led by Sidhu and Kanhu Murmu, moved towards Pakur, Maheshpur, and Samserganj, with forces growing to 20,000 by mid-July.\nThey captured and burned Rampurhat and Pulsa. Sidhu and Kanhu organized their forces, granting titles like suba thakur and nazir to followers, forming a more structured leadership. They aimed to establish a fairer land system, charging lower rents for Bhumij and Bengali peasants, contrasting with the exploitative EIC policies. Their leadership provided unity and purpose, strengthening the rebellion.\nEast India Company initial response\nTo coordinate the suppression of the Santal Rebellion, the East India Company (EIC) appointed A.C. Bidwell as the \"Special Commissioner for the Suppression of the Sonthal Insurrection.\" Bidwell, already in Kolkata, was tasked with overseeing civil affairs in the affected districts while each district retained the right to call for military aid independently. The Governor’s Council authorized full-scale military action, deploying troops from Barrackpore to Raniganj and reinforcing key positions such as railway stations and the Grand Trunk Road. The plan was to secure strategic locations near the Ganges, restrict Santal movement north of the road, and block their retreat into the hills. On 10 July 1855, Major Burroughs led 160 men from Bhagalpur, while others were sent to protect villages in Samserganj thana. Local zamindars, including the Nawab of Murshidabad, were asked to provide elephants, with 30 sent by the Nawab alone. Despite recommendations from the Divisional Commissioner of Burdwan to send 1,500 troops, the Lieutenant Governor refused, considering the uprising a local insurrection that did not require excessive reinforcements.\nThe turning point of the rebellion came on 24 July, when 50 EIC troops under Commissioner Toogood, supported by 200 soldiers from the Nawab of Murshidabad and 30 elephants, confronted 5,000 Santals near Maheshpur. The battle lasted just 10 minutes, with 100 Santals killed before the rest fled, leaving behind their belongings. Both Sidhu and Kanhu Murmu were reportedly wounded in this battle. However, the EIC forces hesitated to advance toward Bhagnadi, fearing an estimated 20,000 to 30,000 Santals in the area. Meanwhile, Kanhu personally led an attack on Barhait, where the EIC fired shots but failed to hit the rebels. Rumors soon spread that Kanhu had been killed, leading Sidhu, Chand, and Bhairab to retreat into the hills with looted property. In Birbhum, the conflict remained fluid, with the EIC winning direct confrontations but struggling to prevent Santals from regrouping. On 17 July, 8,000 Santals attempted to cross the Mor River to attack Suri, but high water delayed them. In an engagement on 22 July, Lieutenant Toulmain's 106 troops were ambushed by 8,000 Santals, resulting in Toulmain's death and the loss of 13 British soldiers, while the Santals suffered 300 casualties. Another battle at Nangolia saw the EIC pushing the Santals back across the river, causing 200 more Santal casualties, demonstrating the brutality and resilience of the conflict.\nHowever maintaining control over the territory recaptured was often difficult for the EIC commanders. In some cases civilians accompanying the EIC troops burned Santhal villages in revenge.\nRegrouping\nTowards the end of July, both the British and Santals reorganised their forces. The ECI brought in Major General G. W. A. Lloyd from Dinajpur district, who took control of the troops from Bidwell, and gathered even more forces for the full suppression of the rebellion. At the time his command was established, he had 5 regiments of local infantry, Hill Rangers, some European troops, and cavalry, in addition to the various soldiers sent by the many Zamindars who were aiding the EIC.\nAfter his retreat from Bhagnadi Sidhu had regrouped with Ram Manjhi, a suboordinate near Birbhum, who became the new leader of the rebellion, along with other suba thakurs.\nResumption of guerilla warfare\nEventually the East India Company resumed its attacks. Captain Sherwill, who had passed through the hills several times, had come to offer his advice in Rajmahal. The EIC troops in Rajmahal began moving into the country, splitting up Santal forces and turning the villagers into refugees. The District Magistrate of Munger had armed some of the ghatwals and discharged sipahis, and sent them to block the passes into the plains in early August. Later some 4,000 Santals who had intended to move into Munger's plains had found the passes blocked and moved further south. On 10 August, a steamer carrying General Lloyd learned in Cologong that the Santhals had been driven out the northern part of the hills and most of Bhagalpur.\nThe Santals now resorted to a policy of hit-and-run attacks on the EIC troops. These attacks generally resumed in August 1855, although it is unclear whether these attacks were organised by the central leadership of the rebellion or whether thakurs were acting on their own in what they saw as the best interests of the rebellion.\nDeclaration of Martial Law\nrecovering property stolen by Santals after burning a Santal village]]\nDuring the period of guerrilla attacks by the Santals, the East India Company (EIC) debated whether to impose martial law to suppress the rebellion. On 23 August 1855, the Bhagalpur Commissioner issued an Urdu proclamation permitting the killing of Santals found in armed groups but prohibiting harm to women and children. Some officials, like the magistrate in Rajmahal, even urged the EIC to exterminate the entire Santal tribe. While the EIC initially refused to declare martial law, officers in the field continued burning villages, claiming they harbored insurgents. On 23 July, Bidwell argued that capturing prisoners and avoiding the plunder of insurgents was impractical, urging the government to permit executions and village burnings. Eventually, the Lieutenant Governor pressed the Governor-General of India to declare martial law, citing difficulties in suppressing the rebellion under civil law. Though initially reluctant, the Governor-General declared martial law on 8 November 1855, applying it from Bhagalpur to Murshidabad. This allowed for the immediate execution of any armed Santals, though the government advised minimizing bloodshed.\nTo dismantle the rebellion, the Bhagalpur Commissioner initially offered large bounties for the capture of Sidhu and Kanhu Murmu, but the rewards were later revoked. In August 1855, the EIC urged commanders to pardon surrendered insurgents, except key leaders. As the uprising weakened, the British promised rent annulments and grace periods to those who surrendered, provided they gave up weapons and rebel leaders. However, field commanders often ignored these distinctions, punishing civilians alongside rebels. Surrendering villages were forced to betray insurgents, leading to the capture of Sidhu in August or early October by Santals and a Bengali informer. Kanhu, Chand, and Bhairab initially hid in the hills but were reported to have thousands of armed followers south of the Mor River in November 1855. However, by early December, they were captured by Paharia rangers while disguised as peasants, effectively ending the rebellion.\nResidual conflict\nIn January 1856, marital law was revoked and military operations ended the following month.\nOutcome\nDuring the rebellion, the Santal leader was able to mobilise roughly 60,000 Santhal forming groups, with 1500 to 2000 people forming a group. The rebellion was supported by poor tribals and non-tribals like Gowalas and Lohars (who were milkmen and blacksmiths) in the form of providing information and weapons. Ranabir Samaddar argues that apart from Santhals, other aboriginal inhabitants of the region like Kamars, Bagdis, Bagals and others also participated in the rebellion. In this course of rebellion, over 15,000 were killed, tens of villages were destroyed, and many were displaced.\nThe Santal uprising of 1855-56 exposed the oppression faced by the Santals, prompting British reforms. The  Parganas Act, Act 37 of 1855, created Santal Parganas district, encompassing the Santal-concentrated area affected by the uprising, as a separate non-regulation district under Bhagalpur’s jurisdiction. It was administered by a Deputy Commissioner in Dumka, assisted by other officials. This administrative structure was modeled after the South-West Frontier Agency of Chota Nagpur. Covering , the district was bordered by Bhagalpur, Purnea, Malda, Murshidabad, Birbhum, Bardwan, Manbhum, Hazaribagh, and Monghyr. The district aimed to address Santal grievances while reinforcing British control. Subsequently, the British enacted the Santhal Parganas Tenancy Act of 1876 in the district to safeguard tribal land rights and prevent their alienation to non-tribals.\nLegacy\nEnglish author Charles Dickens, in Household Words, wrote the following passage on the rebellion:\nThere seems also to be a sentiment of honor among them; for it is said that they use poisoned arrows in hunting, but never against their foes. If this be the case and we hear nothing of the poisoned arrows in the recent conflicts, they are infinitely more respectable than our civilized enemy, the Russians, who would most likely consider such forbearance as foolish, and declare that is not war.\"''\n* Mrinal Sen's film Mrigayaa (1976) is set during the Santhal rebellion.\n* Karl Marx commented on this rebellion as India's first organised 'mass revolution' in his book Notes on Indian History.\n* 30 June is commemorated as Hul Diwas in Jharkhand to honor the beginning of the Santhal Rebellion, led by Sido and Kanhu.\nGallery\nFile:Santhals and Engineers Fight.jpg|A residual skirmish between British railway engineers and Santal people\nFile:The Sketch Map Showing Provincial and District Divisions to Accompany the Administration Report, 1872–73 (Cropped to Bihar, Chota Nagpur, and Odisha).jpg|Santal Parganas district and its railway line as depicted in the 1872 map\nFile:Sontalvillage.jpg|A Santhal hamlet in the Rajmahal Hills, illustrating houses, elephant deities, and sacrificial head trophies, Louis Rousselet ( observation; pub. 1875).\nSee also\n* Sidhu and Kanhu Murmu\n* Kol uprising\n* Bastar rebellion\nReferences\nBibliography\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\nFurther reading\n*\nExternal links\n*"
    }
  ]
}