{
  "content": [
    {
      "type": "text",
      "text": "# Santo Domingo Dominican Republic Temple\n\nThe Santo Domingo Dominican Republic Temple is a temple of the Church of Jesus Christ of Latter-day Saints (LDS Church) in Santo Domingo, Dominican Republic. It was the first temple to be built in the church's Caribbean Area and its 99th worldwide. Announced on November 16, 1993, a groundbreaking took place on August 18, 1996, on a 6.42-acre site along Avenida Bolívar. Designed by the Scott Partnership and using Regina white granite on its exterior, the temple is about 67,000 square feet with a single entrance tower with statue of the angel Moroni on its top. When construction was completed, a public open house from August 26 to September 9, 2000 drew about 39,520 visitors. The temple was dedicated on September 17, 2000, by church president Gordon B. Hinckley.\nHistory\nSanto Domingo is the Dominican Republic's capital city. Founded in 1496, it is the oldest European settlement existing in the New World. In 1978, the Dominican Republic was opened to LDS Church missionaries. By 1986, the church reported that membership had grown to eleven thousand and sixty thousand in 1998. Before this temple was built, church members traveled to Peru, Guatemala, or the U.S. state of Florida to attend a temple.\nThe intent to build the temple was announced on November 16, 1993 by the church's First Presidency. A groundbreaking ceremony was held on August 18, 1996, on a 6.42-acre (≈2.60 ha) site at Avenida Bolívar #825 in Santo Domingo. The event was presided over by Richard G. Scott, of the Quorum of the Twelve Apostles, and attended by thousands from the Dominican Republic, Puerto Rico, and Haiti.\nDuring construction, workers encountered hard coral rock, requiring months of heavy excavation before laying the foundation. Setting the angel Moroni statue on top of the tower required the tallest crane available in the region, with a worker accompanying it to ensure precision.\nFollowing completion, a public open house was held from August 26 to September 9, 2000, with about 39,520 visitors attending. The temple was dedicated on September 17, 2000, by church president Gordon B. Hinckley in four sessions. On September 11, 2004, to commemorate the fourth anniversary of the temple, 1,200 members attended the temple and set a record-breaking 5,500 ordinances.\nPreviously, a missionary training center was adjacent to the temple, but it closed in January 2019 as part of a church-wide adjustment to training facilities.\nControversy\nIn 2012, a researcher reported that Anne Frank had been baptized for the dead in the Santo Domingo Dominican Republic Temple, in violation of a 1995 agreement between the LDS Church and Jewish groups that the church would no longer posthumously baptize Holocaust victims. In response, the church stated that the member that submitted the name for baptism would lose their submission privileges and that other disciplinary action would be considered.\nDesign and architecture\nThe temple has a single tower above the entrance and uses a classic modern style, with a regina white Granite exterior.The building has about 67,000 square feet of interior space.\nLocated on a 6.42-acre elevated plot in western Santo Domingo, the site includes landscaping with palm trees and facilities for visiting members, including patron housing. The temple’s placement on a rise allows a view toward the Caribbean Sea.\nThe temple has tall arched windows and a square-based central tower, with an angel Moroni statue on top. The interior includes four endowment rooms, four sealing rooms, and the baptistry. The temple's exterior is Regina white granite with a classic modern temple design.\nLanguage services\nTemple workers can provide services in the following languages commonly spoken in the area:\n* Dutch\n* English\n* French\n* Haitian Creole\n* Spanish\nTemple leadership and admittance\nThe church's temples are directed by a temple president and matron, each typically serving for a term of three years. The president and matron oversee the administration of temple operations and provide guidance and training for both temple patrons and staff. Serving from 2000 to 2004, Arthur F. Coombs Jr. was the first president, with Mignon P. Coombs serving as matron. As of 2025, Francisco J. María is the president, with Adelaida Reynosa de Tejada being the matron.\nAfter construction was completed, a public open house was held from August 26 to September 9, 2000. Like all the church's temples, it is not used for Sunday worship services. To members of the church, temples are regarded as sacred houses of the Lord. Once dedicated, only church members with a current temple recommend can enter for worship.\nSee also\n{| class=\"wikitable floatright\" style=\"font-size: 85%;\"\n|-\n|\nTemples in the Caribbean ()\n= Operating\n= Under construction\n= Announced\n= Temporarily Closed\n|}\n* Comparison of temples of The Church of Jesus Christ of Latter-day Saints\n* List of temples of The Church of Jesus Christ of Latter-day Saints\n* List of temples of The Church of Jesus Christ of Latter-day Saints by geographic region\n* Temple architecture (Latter-day Saints)\n* The Church of Jesus Christ of Latter-day Saints in the Dominican Republic\nNotes\nReferences\n*\n*\n*\n*\n*\n*\nExternal links\n*\n* [https://www.churchofjesuschrist.org/temples/list?lang=eng Official Santo Domingo Dominican Republic Temple page]\n* [https://churchofjesuschristtemples.org/santo-domingo-dominican-republic-temple/ Santo Domingo Dominican Republic Temple page]"
    }
  ]
}