{
  "content": [
    {
      "type": "text",
      "text": "# Sapieha Palace, Warsaw\n\n|location_town=Warsaw\n|location_country=Poland\n|architect=Johann Sigmund Deybel\n|client=\n|engineer=\n|construction_start_date=1731\n|completion_date=1746\n|date_demolished=1944\n|cost=\n|structural_system=\n|style=Rococo\n|footnotes=\n}}}}\nSapieha Palace () is one of the palaces in Warsaw New Town district of Warsaw, Poland. Started by the powerful Sapieha family who gave the name to the building, it currently houses the Environmental Protection School Complex.\nHistory\nSt. Mary's Church, detail of a painting by Bernardo Bellotto, 1770.]]\n18th century\nThe palace, commissioned by Jan Fryderyk Sapieha, Chancellor of the Grand Duchy of Lithuania, was built in Rococo style in 1731-1746 by Johann Sigmund Deybel. It was constructed as a French-style city palace, so-called Hôtel particulier. At that time it consisted of five-axial main buildings (corps de logis) and two outbuildings between the palace and a street. Between 1741 and 1742 the existing one-story outbuilding was connected with the main outbuilding of the palace complex, and between 1771 and 1790 another wing was erected to connect the inhabited corps de logis with the second outbuilding.\n19th century\nIn 1818–1820 the palace was converted into the Sapieha Barracks (Koszary sapieżyńskie) for the use of the army. The Neo-Classical remodelling in the early 19th century was the work of Wilhelm Henryk Minter. During the November Uprising of 1830–1831 it served as the barracks for the famous Polish 4th Infantry Regiment (Czwartacy).\n20th century\nDestroyed in 1944 by German occupying forces, it was rebuilt in the 1950s by Maria Zachwatowiczowa.\nFile:Warszawa Pałac Sapiehów 01.jpg|The explanatory plaque on the façade (in Polish)\nFile:Warszawa sapiehow palais.jpg|Former garden elevation\nFile:Nm16DSC 1274.jpg|A close-up of the coat of arms at the roof above the entrance\nFile:WiKi_SapiehaPalaceWarsaw20110712.jpg|The front of the Palace at dusk - July 2011\nReferences\n::In-line:\nSee also\n* Sapieha Palace, Lviv\n* Sapieha Palace, Vilnius"
    }
  ]
}