{
  "content": [
    {
      "type": "text",
      "text": "# Sara Howard (speech therapist)\n\n| image              =\n| image_size         =\n| alt                =\n| caption            =\n| birth_name         =\n| birth_date         =\n| birth_place        =\n| death_date         =\n| death_place        =\n| death_cause        =\n| occupation         =\n| awards             =\n| alma_mater         = University of Sheffield\n| thesis_year        =\n| discipline         =\n| sub_discipline     =\n| workplaces         =\n}}\nSara Howard  is a British speech therapist and Professor Emerita of Clinical Phonetics at the University of Sheffield.\nCareer\nHoward earned a BA in English and an MA in Linguistics at the University of Leeds before receiving a BSc in Speech & Language Therapy at Leeds Metropolitan University and a PhD in Clinical Phonetics at the University of Sheffield. She works in the area of the phonetics/phonology interface in developmental speech impairments (especially cleft lip and palate).\nBetween 2010 and 2012 Howard completed an ESRC Research Fellowship on \"Connected speech and word juncture in typical and atypical speech development\".\nHoward was elected a Fellow of the Royal College of Speech and Language Therapists in 2015, and as a life member of the International Clinical Phonetics and Linguistics Association in 2016 of which she was president from 2006 to 2014.\nSelect publications\n*Howard, S. J. 2013. 'A phonetic investigation of single word versus connected speech production in children with persisting speech difficulties relating to cleft palate'. Cleft Palate – Craniofacial Journal, 50(2): 207-223.\n*Howard, S. J. & Lohmander, A. (eds) 2011. Cleft Palate Speech: Assessment and Intervention. Chichester: Wiley-Blackwell.\n*Howard, S. J. & Heselwood, B. C. 2011. 'Instrumental and perceptual phonetic analysis: The case for two-tier transcriptions'. Clinical Linguistics & Phonetics, 25(11-12), 940-948.\n*Ball, M. J., Perkins, M. R., Mueller, N, & Howard, S. J. (eds) 2008. The Handbook of Clinical Linguistics. Oxford: Blackwell.\n*Howard, S. J. 2007. 'The interplay between articulation and prosody in children with impaired speech: observations from electropalatography and perceptual analysis'. Advances in Speech-Language Pathology, 9(1), 20-35.\nReferences"
    }
  ]
}