{
  "content": [
    {
      "type": "text",
      "text": "# Sarathy Korwar\n\nSarathy Korwar is a US-born, Indian-raised, London-based drummer, percussionist, composer and bandleader. He works predominantly in a jazz and Indo jazz field but also incorporates elements of hip-hop,  and other fusions.\nBackground\nBorn in the US, Korwar grew up in Chennai and Ahmedabad in India and began studying tabla aged 10. He later moved to Pune to study Geology at Fergusson College before making the decision to dedicate his time to music, continuing to study tabla with Rajeev Devasthali as well as  translating his skills to the western drum kit and playing as a session musician. He then moved to London and continued his studies with Sanju Sahai at SOAS.\nCareer\nIn 2016 Korwar released the album Day To Day on the Ninja Tune label. This record incorporated field recordings of the Siddi people of Southern India blended with his own compositions drawing from contemporary jazz and electronic music.\nHe leads the UPAJ Collective, a collective of Eastern and Western musicians formed play a residency at London's Jazz Cafe. The group recorded the live album My East Is Your West at London's Church Of Sound, released on Gearbox Records on 9 November 2018. The group performed compositions by jazz musicians Alice Coltrane, Pharoah Sanders and Joe Henderson as well as Indian classical music and Indo jazz.\nIn 2016 Korwar was selected for the Steve Reid Foundation's mentorship programme, a charitable foundation set up by Gilles Peterson.\nOn 26 July 2019 Korwar released his second studio album, More Arriving through The Leaf Label. Recorded over three years in Mumbai and London, the album incorporates rappers from Mumbai and New Delhi with spoken word and his own Indian classical influence and jazz instrumentation. The album featured the Jamaican-Indian rapper Delhi Sultanate, the London poet Zia Ahmed and the Abu Dhabi writer Deepak Unnikrishnan among others. Korwar describes the album as a protest record and said: \"This is what Indian music sounds like to me right now, and that means incorporating multiple brown voices. If anyone has a problem with that, they should be questioning what they think Indian music should be.\" The album won Best Independent Album at The AIM Awards in 2020.\nOtherland was released for Record Store Day 2020 and limited to 1,000 copies on transparent green vinyl. Featuring Kushal Gaya (Melt Yourself Down), Zia Ahmed, Mirande and Mumbai hip-hop collective Swadesi, the EP continues to explore the theme of Indian diaspora that was at the core of More Arriving.\nIn August 2022, Korwar announced his third studio album KALAK and released the single \"Utopia Is A Colonial Project\". The \"polyrhythmic anthem\" was accompanied by a music video choreographed by Elliott Gonzo and starring award-winning dancer Botis Seva. Speaking about the title of the single, Korwar says: \"ideas of utopia are intrinsically linked to the mindset of settler colonialism. It comes from seeing the natural world as an inanimate resource rather than a living, sentient being. We need to be anti-utopian, and anti-dystopian. We need to be able to imagine futures drastically different to the kind of ‘utopias’ that are being sold by right-wing populist politicians in South Asia and beyond\".\nThe album KALAK was recorded at Real World Studios with acclaimed New York electronic musician, DJ and producer Photay and was released on 11 November 2022. The record features The Comet Is Coming's Danalogue on synths, Tamar Osborn on baritone sax, Al MacSween on keys, Magnus Mehta on percussion and vocalist Kushal Gaya of Melt Yourself Down. Korwar describes the album as \"Indo-futurism\" and much of the music on the album is written on cyclical rhythmic concepts, which Korwar connects to how many people in \"South Asia envisage [their] relationship to the future and the past in ideas of cyclicality\". The Guardian awarded KALAK 5/5 stars, named it \"Global Album of the Month\" and described it as \"a deft, warming album.\nKorwar has also collaborated with Shabaka Hutchings, clarinettist Arun Ghosh and producer Hieroglyphic Being, as well as groups Penya and Ill Considered. He has toured with Kamasi Washington, Yussef Kamaal and Moses Boyd.\nDiscography\nStudio albums\n*  Day to Day (Ninja Tune, 2016)\n*  More Arriving  (The Leaf Label, 2019)\n* KALAK (The Leaf Label, 2022)\nEPs\n*  Otherland (The Leaf Label, 2020)\nLive albums\n*  My East Is Your West  (Gearbox Records, 2018)\nSingles\n* \"Earth\" (2018)\n* \"Hajj\" (2018)\n* \"Mumbay\" (2019)\n* \"Bol\" (2019)\n* \"Utopia Is A Colonial Project\" (2022)\nReferences\nExternal links\n*[http://www.sarathykorwar.com Website]"
    }
  ]
}