{
  "content": [
    {
      "type": "text",
      "text": "# Saru (Star Trek: Discovery)\n\n| occupation = Science officer (USS Shenzhou; pre-2256), First Officer (2256–2257), Acting Captain (2257–2258), Captain (2258–3189), Federation ambassador (3189 onward), Admiral (3191 onward)\n| caption     = Saru\n| species     = Kelpien\n| lbl21       = Planet\n| lbl22       = Affiliation\n| data22      = United Federation of Planets, Starfleet, Kaminar, USS Shenzhou, USS Discovery\n| portrayer   = Doug Jones, Kamal Ajimal (young)\n| family      = Siranna (sister)\n| significant_others = T'Rina (partner)\n| lbl31       = Languages\n| data31      = 94 total\n| lbl32       = Abilities\n| data32      = Enhanced strength and agility, superior visual acuity, prey/predator instincts\n| lbl33       = Notable facts\n| data33      = First Kelpien in Starfleet, Starfleet Medal of Honor, underwent ''vahar'ai, helped reunify Kaminar\n}}\nSaru is a fictional character in the Star Trek franchise, portrayed by Doug Jones throughout five seasons of the television series Star Trek: Discovery. A Kelpien, Saru is both the first member of a pre-warp civilization and of his people to serve in Starfleet. He evolves from a fearful, reluctant officer to a bold, principled leader after surviving a rite of passage unique to his species. Saru later serves as captain of the United Federation of Planets starship USS Discovery''.\nKnown for his history of prosthetic-based performance in film, Saru was the first major role created specifically for Jones. He embraced the role despite planning to retire from such work. Saru's elongated gait and distinct silhouette were due to his costume design, which included hoofed footwear. Critics and fans compared Saru to non-human characters such as Spock, Data, and Odo, noting that he is the first alien to captain a title ship in the franchise.\nJones's performance received critical acclaim, earning him two Saturn Awards for Best Supporting Actor. The role of Saru is often cited as the defining part of his career. Critics and scholars have praised Saru's characterization for challenging archetypes of the non-human \"other\" in Star Trek, instead showing layered depictions of fear, resilience, and leadership. His storyline has been interpreted through themes of globalization, post-colonial identity, gender egalitarianism, and trauma recovery, as he balances Federation duties with personal relationships and the needs of his homeworld.\nDesign and performance\nA year before the first season of Star Trek: Discovery aired, in November 2016, actor Doug Jones was cast as Saru, an alien known as a Kelpien, a newly created species for the Star Trek universe. Bryan Fuller offered creature actor Doug Jones the role of Saru, telling Jones \"he was the one the show needed,\" which made Jones feel that his career was \"back on.\" Prior to being offered the role of Saru, Jones considered moving away from his prosthetics acting work after decades in the make-up chair.\nJones said that throughout his long career, Saru was the first role he was ever offered as first choice with no audition. \"I have waited, all my life, for the moment to happen, where a big role in a big series was just being offered to me, based on reputation alone, and it was humbling,\" he said. Jones was honored by the fact that Saru is the first-ever \"alien\" captain of a \"title\" Star Trek ship, noting that he was pleased to join a \"very exclusive, lovely club\" of actors who played Starfleet captains on signature ships.\nThe producers pitched Saru as the Spock or Data of Star Trek: Discovery, a characterization Jones embraced. Jones described Saru as \"kind of the Spock of this particular iteration,\" the bridge officer who \"looks different, sounds different, walks different.\" After having appeared in every Star Trek: Discovery episode from seasons one through four, Saru only featured in five of the ten episodes in the finale season. Season four took nearly a year to film due to\nCOVID-19 delays and interruptions.  After that experience, Jones was eager to spend more time with his family. He also worked on other films at the time, including Disney's Hocus Pocus 2. Had Star Trek: Discovery continued for additional seasons, Jones was prepared to return as often as asked. Jones said that playing Saru became the most immersive role of his career, offering an emotional complexity that deepened across seasons.\nJones's body language and movements were crucial to his performance as Saru. His costume made him approximately , a pronounced height Jones said gave him a \"gazelle-like\" appearance. Saru's unique walking gait came naturally from his elevated hoof boots, forcing Jones to balance on the balls of his feet. Bauston Camilleri was Jones's stunt double throughout all five seasons of Star Trek: Discovery, having also worked with him on the film The Shape of Water, directed by frequent Jones collaborator Guillermo del Toro,  and the television series What We Do in the Shadows. To maintain consistency among Kelpiens, Jones started a \"Kelpien school\", an informal training regimen for other performers to focus on physicality and movement.\nSaru's elaborate Kelpien prosthetics initially took four hours to apply, but was later reduced to two. \"Very fast for prosthetics,\" according to Jones. Fuller initially envisioned a \"ten-eyed Saru\", but this was later changed after makeup tests hindered Jones's performance. As a main cast member on Star Trek: Discovery, Jones sometimes spent 15 to 17 hours a day in full costume and prosthetics, including Saru's large blue contact lenses. Jones said that two of his most challenging moments as Saru were when he was required to sing in full prosthetics and in the Kelpien language for scenes involving a funeral and a lullaby. Star Trek captains traditionally adopt signature catchphrases, such as \"make it so\" for Jean-Luc Picard;  Saru's became \"carry on\".\nIn one episode of Star Trek: Discovery, Saru wore a holographic \"human disguise\", allowing Jones to briefly act as himself without Kelpien prosthetics. Jones wore a wig and purposely made the look \"a little bit more off-putting\" to cue viewers that something was wrong. Without the silicone mask, he could display facial expressions that were normally hidden.\nCharacterization\nEarly in Star Trek: Discovery, Saru is limited by the natural traits of his people, with his life governed by a constant innate sense of fear and nervousness. Julia Alexander of Polygon compared Saru to L. Frank Baum's Cowardly Lion, contrasting him with crewmate and friend Michael Burnham (Sonequa Martin-Green), who more readily takes risks. Saru and Burnham have a relationship like that of a brother and sister that matures over time. The relationship of Sylvia Tilly (Mary Wiseman) and Saru also evolves, with Jones viewing her as a daughter figure. Saru trusts in Tilly's leadership, appointing her as acting first officer at one point.\nWriting in The Verge, Devon Maloney draws contrasts between Saru, the characters Data and Worf on Star Trek: The Next Generation, and the shape-changing Odo from Star Trek: Deep Space Nine. Maloney notes that non-human officers, despite their qualifications, are often dismissed or sidelined by Starfleet. Saru's cautious leadership style is depicted as a contrast to the reckless impulsivity often rewarded in his human counterparts.\nIn the pilot episode, \"The Vulcan Hello\", human captain Philippa Georgiou (Michelle Yeoh) reduces Saru's species to a stereotype, joking that \"Saru is Kelpien. He thinks everything is malicious.\" Along these same lines, Burnham undercuts Saru's proposals in front of their subordinates as his then-superior officer aboard the USS Shenzhou. Burnham's early conflicts with Saru undermined his ability to command. Despite her poor treatment, Saru defended Burnham's judgment when they found themselves in a dangerous situation. Maloney notes that Saru had an \"apparent lack of ego\".\nSaru's species undergoes a physical and mental transformation later in life known as ''vahar'ai, an event central to several Star Trek: Discovery storylines. Prior to their change, Kelpiens exhibit involuntary fear responses characteristic of prey species; after the transformation, fear dissipates and assertiveness emerges. Kelpien vision is described as exceeding human visual acuity, as it can detect both visible and ultraviolet light. This heightened sensory capacity plays a key role in the episode \"An Obol for Charon\", where Saru detects an alien signal whose complexity overwhelms his system and prematurely triggers the onset of the vahar'ai. In \"The Sound of Thunder\", Saru, having undergone the vahar'ai, destroys combat drones with his bare hands, while his pre-vahar'ai sister recoils in fear, demonstrating that vahar'ai affects behavior, not ability. After undergoing vahar'ai, Saru earns the nickname \"Action Saru\" and is portrayed with stronger leadership and boldness in later seasons.\nStory and appearances\nIn the Star Trek: Short Treks'' episode \"The Brightest Star\", Saru's origin story is shown. He flees his homeworld to join the United Federation of Planets, knowing that joining Starfleet may prevent him from ever returning to his pre–first contact home. Saru comes from a planet where Kelpiens are a prey species hunted by a dominant predator; his species evolved heightened survival instincts. Saru remained deeply connected to his homeworld of Kaminar; after learning that Kelpiens joined the Federation in the future, he felt \"hopeful there's a place to go home to.\" Saru's story explores the conflicts between his duty to the Federation and his obligations to Kaminar. The storyline echoes real world questions about balancing cultural or ethnic identities with national belonging and responsibilities, a challenge U.S. citizens from diverse backgrounds may face. In one episode, Saru reflects: \"Somewhere along the way, I lost who I was...\"\nIn the second season, Saru learns that his Kelpien biological process known as the ''vahar'ai'' was not the imminent death he was raised to believe, but instead a new developmental stage that allows his people to overcome their innate fear. The species oppressing Saru's people on Kaminar were historically preyed upon by the Kelpiens thousands of years in the past, nearly to the point of extinction. This uniquely challenges the Federation's Prime Directive, as he and his sister disclose the historical lie that his species has been sacrificing themselves needlessly, believing their deaths necessary for their society's existence. This revelation forces both species towards overcoming mutual prejudice and fear. Having started the peace process on Kaminar, Saru departs, confident that he has left his sister \"in good hands\". Kaminar introduces a gender equality theme to Saru's story. Following the death of their father, Saru's sister assumes leadership without controversy, illustrating an egalitarian society devoid of gender bias, with no distinctions drawn between male and female Kelpiens in terms of height, physical appearance, strength, and capabilities.\nSaru is depicted as a moral character. In the Mirror Universe, an alternate version of Saru is enslaved by Emperor Georgiou, serving as a bath servant and personal attendant. His relationship with Georgiou reflects typical power dynamics of Terran society, yet Saru's presence is critical in her eventual moral redemption. Through Saru, Georgiou confronts her oppressive tendencies to experience compassion and remorse. Saru is her moral catalyst, whose subjugation helps initiate Georgiou's journey from authoritarian cruelty toward empathy and self-reflection.\nIn the first season of Discovery, Saru's narrative arc is personal, as he struggles with his complex relationship with Burnham and his career. By the end of the premiere season and the storyline of a Federation and Klingon Empire war, Saru is forced to give command decisions in moments of crisis. In season two, Saru returns at last to Kaminar. This unfolded alongside investigations of galaxy-wide celestial phenomena and efforts to stop a rogue artificial intelligence system from destroying all life. To prevent the catastrophe, Burnham and Saru lead Discovery on a mission involving time travel into the 32nd century, where the series remains until its conclusion. In that future setting, Saru becomes captain of the Discovery, and later serves as a Federation ambassador.\nIn the third season, prior to their arrival, Starfleet was nearly destroyed and the Federation was weakened by a galactic event that simultaneously destroyed thousands of ships. Saru played the decisive role in peacefully resolving the crisis, which was caused by an orphaned Kelpien child exposed to extreme cosmic forces. In the wake of these events, Saru returns home to live on Kaminar, itself at last a Federation member. He returns to Discovery as they attempt to make first contact with the first-ever discovered extragalactic sentient life. Afterward, the Federation President asks Saru to become an ambassador, and he accepted, resigning from Starfleet to serve in a diplomatic role. In the final season, Saru's diplomatic efforts are instrumental in both averting war with the Breen and uncovering the last surviving remnant of the ancient Progenitors, first introduced in the Star Trek: The Next Generation episode \"The Chase\". At the conclusion of the series, Saru becomes an admiral and marries the leader of the now-unified Vulcan and Romulan cultures, T'Rina, continuing a romance that began in season four.\nJones said he was \"satisfied\" with the conclusion of Saru's story, characterizing it as a happy ending. Whitney Seibold of SlashFilm described it as an unprecedented example of upward mobility in the Star Trek franchise, as Saru rose through the ranks to the highest levels in a very short period of time.\nReception and analysis\nJones received Saturn Awards for his portrayal of Saru, noting the role has brought him the most recognition of his career. He won the Saturn Award for Best Supporting Actor in Streaming Presentation in both 2019 and 2021. The Star Trek: Discovery makeup team's work on Saru and other aliens won the 2019 Primetime Emmy Award for Outstanding Prosthetic Makeup, honoring artists Glenn Hetrick, James MacKinnon and his team.\nAs the final season concluded, Jones said that viewers had shared their personal stories with him about how Saru's portrayal helped them confront their own fears and navigate their struggles with anxiety and depression. Petra Filipová, in Space: The Final Frontier of Gender and Globalization, wrote that Saru's narrative reflects themes of globalization, particularly the tension between local identity and global commitments. She suggested that Saru's story offers a nuanced perspective on colonialism and imperialism, reflected in Starfleet's interactions with local traditions.\n}}\nExternal links"
    }
  ]
}