{
  "content": [
    {
      "type": "text",
      "text": "# Sarwar Hossain\n\n| birth_place   = Dacca, East Pakistan, Pakistan\n| allegiance    =\n| branch        =\n| rank          =  Major General\n| serviceyears  = 1986–2020\n| unit          = East Bengal Regiment\n| commands      =* CO of 4th East Bengal Regiment\n* Commander of 305th Infantry Brigade\n* Director of CTIB\n* Military Secretary to President\n| battles       = UNIKOMONUCI\n| awards        =\n| service years =\n}}\nSarwar Hossain (; born 16 January 1966) is a retired Bangladeshi major general who was former Military Secretary to the President of Bangladesh.\nEarly life and education\nHossain studied at BAF Shaheen College Kurmitola and Adamjee Cantonment College. Hossain enlisted to Bangladesh Military Academy on 1984 and was commissioned  with 15 BMA Long Course in East Bengal Regiment on December 1986. He completed his master's degree in Management from the University of Hyderabad. Hossain furthermore has completed his PhD in Bangladesh Liberation War from the University of Dhaka in 2018.\nMilitary career\nHossain commanded one infantry company, one infantry battalion and one infantry brigade in Rangamati. He was also the principal of Military Collegiate School Khulna in 2014.\nHossain served as Director of Internal affairs bureau of DGFI till 2016. In November 2016, he succeeded Major General Abul Hossain as Military Secretary to the President. Hossain's writing career started with his first book, titled Random Thoughts, and  was an emphasis collection of several articles on diverse issues. He also authored the 1971: Resistance, Resilience, and Redemption, a work on the liberation war of Bangladesh, published in 2019. On November 2020, he was sent to mandatory retirement due to a motion of disrepute and was succeeded by Major General S. M. Salahuddin Islam in 3 December 2020. In his post military career, Hossain was appointed an Independent Director of Simtex Industries Limited on 17 August 2022. Currently he is serving as the chairman of AFC Health Limited, a private hospital conglomerate and also an adjunct faculty member at North South University.\nControversies\nIn September 2024, a complaint was filed with the International Crimes Tribunal of Bangladesh, accusing him, along with former chief of army staff General Shafiuddin Ahmed and Lieutenant General  Mohammad Akbar Hossain in involvement of enforced disappearances and extrajudicial killings.\nThe complaint was submitted by a retired Major in alias named M Sarwar Hassan and a Supreme Court lawyer. Hassan was alleged that in 2016, he was subjected to an attempted enforced disappearance orchestrated by the Directorate General of Forces Intelligence. Hassan also claimed that during his tenure as CTIB director, Hossain ordered enforced disappearances, killings, and convicted in multiple human rights violations during Third Hasina ministry. These allegations have sparked significant controversy, prompting calls for thorough investigations to ensure accountability and uphold human rights in Bangladesh.\nReferences"
    }
  ]
}