{
  "content": [
    {
      "type": "text",
      "text": "# SAS President Steyn\n\n{|\n|Ship name=President Steyn\n|Ship namesake=Martinus Theunis Steyn\n|Ship ordered=18 September 1957\n|Ship awarded=\n|Ship builder=Alexander Stephens and Sons, Linthouse, Glasgow\n|Ship original cost=\n|Ship yard number=\n|Ship way number=\n|Ship laid down=20 May 1960\n|Ship launched=23 November 1961\n|Ship sponsor=\n|Ship christened=\n|Ship completed=\n|Ship commissioned=8 April 1963\n|Ship recommissioned=\n|Ship decommissioned=\n|Ship in service=\n|Ship out of service=\n|Ship reclassified=\n|Ship refit=\n|Ship struck=\n|Ship reinstated=\n|Ship identification=Pennant number: F147\n|Ship motto=\n|Ship nickname='PS'\n|Ship honours=\n|Ship honors=\n|Ship fate=Sunk as target, 29 April 1991\n|Ship notes=\n|Ship badge=\n}}\n(standard load)\n*  (deep load)\n|Ship length=\n|Ship beam=\n|Ship draught= (deep load)\n|Ship power=*2 Babcock & Wilcox boilers\n*\n|Ship propulsion=*2 × shafts\n* 2 × geared steam turbines\n|Ship speed=\n|Ship range= at\n|Ship complement=214\n|Ship sensors=*Type 162, 170, 177M sonars\n* Type 293Q surface-search radar\n* Type 262 and 275 gunnery radars\n* Type 277Q height-finding radar\n* Type 978 navigation radar\n|Ship armament=*2 × triple Limbo anti-submarine mortars\n* 1 × twin 4.5-inch (114&nbsp;mm) dual-purpose gun\n* 1 × twin  Bofors AA gun\n|Ship notes=\n}}\n|}\n'SAS President Steyn' was the second of three President-class Type 12 frigates built in the United Kingdom for the South African Navy (SAN) to use during the 1960s. The ship spent most of her career training and made many visits to foreign ports in Africa, Western Europe and Australia. In the late 1960s, she was modernized and equipped to operate a helicopter. In the mid-1970s, President Steyn played a minor role in the Angolan Civil War as a part of South African operations against the communists. The ship was withdrawn from service in 1980 and was sunk as a target in 1991. This happened after financial problems prevented her from being reactivated.\nDescription\nThe President-class ships displaced  at standard load and  at deep load. They had an overall length of , a beam of  and a mean deep draught of . The ships were powered by a pair of English Electric geared steam turbines, each driving one propeller shaft, using steam provided by two Babcock & Wilcox boilers. The turbines developed a total of  which gave a maximum speed of . They carried  of fuel oil that gave them a range of  at . Their crew numbered 14 officers and 200 ratings.\nThe Presidents were armed with one twin-gun mount for QF 4.5-inch (114&nbsp;mm) Mk V dual-purpose guns forward and one twin mount for  Bofors anti-aircraft guns. For anti-submarine work, the ships were fitted with Type 162, 170, and 177M sonars for the pair of triple-barrelled Mk 10 Limbo anti-submarine mortars. They were equipped with a Type 293Q surface-search radar, Type 262 and 275 gunnery radars, Type 277Q height-finding radar and a Type 978 navigation radar.\nBy the mid-1960s, it was obvious that the sonars of the President class were capable of detecting submarines well outside the range of the Limbo anti-submarine mortars and the South Africans decided to follow the lead of the Royal Navy (RN) in giving them the ability to operate helicopters that could carry anti-submarine torpedoes or depth charges to a considerable distance from the ships. Therefore, the forward Limbo mortar was removed and its space was plated over to form a small flight deck. The Bofors mount, its director and the aft superstructure was replaced by a hangar for a Westland Wasp helicopter. Two single Bofors guns were positioned on the hangar roof and provisions were made for four  Browning machine guns. A pair of American  Mk 32 triple-barrelled anti-submarine torpedo tubes were added amidships and their electronics were upgraded, including the addition of a Thomson-CSF Jupiter early-warning radar atop a new mainmast and a Selenia Orion fire-control system.\nConstruction and career\nThree President-class frigates were ordered by the South African Navy in the late 1950s following the Simonstown Agreement with the RN. President Steyn was the second ship of the three sister ships and was ordered from Alexander Stephens and Sons on 18 September 1957 with the name President Kruger. The government wanted the first ship to be completed to receive the name of the first president of South Africa and a strike at the Alexander Stephens shipyard delayed the laying of the ship's keel. So she exchanged names with the first ship built by Yarrow which had already been laid down and became President Steyn, named after Martinus Theunis Steyn, last president of the Orange Free State. She was laid down at their shipyard in Linthouse, Glasgow on 20 May 1960. The ship was launched on 23 November 1961 and commissioned on 8 April 1963, with Captain John Fairbairn in command. Completion was slightly delayed by a fire aboard the ship on 3 July 1962 that required holes to be cut in the hull and decks to rescue the workmen trapped aboard.\nPresident Steyn arrived in Simon's Town on 13 September and all three of the Presidents were assigned to the 10th Frigate Flotilla. They participated in Capex&nbsp;63 training exercise with British and French warships in July–August 1963, but only President Steyn and her sister  participated in Capex&nbsp;64 the following year. In 1965 the Royal Navy decided to reduce Capex to a weapons training period with only RN and SAN units participating, presumably to reduce the profile of cooperating with the apartheid government of South Africa. On 7 October 1968, the 10th Frigate Flotilla, now consisting of President Steyn, President Pretorius and the replenishment oiler , departed Simon's Town for Australia and arrived in Fremantle on the 23rd. They continued onwards to Sydney and then participated in the Remembrance Day ceremony in Melbourne on 11 November. The flotilla departed three days later, bound for home, but they were forced to put into Freemantle when a pump in President Pretorius burnt out en route. The ships finally reached home on 3 December. President Steyn began her modernisation the following year on 5 August 1969 and was recommissioned in May 1971.\nSeveral months later, the ship departed Simon's Town on 1 September to escort the newly completed, French-built submarine  to South Africa. En route, she visited ports in Portugal, West Germany, England, and Spain. While visiting Luanda, Portuguese Angola, the ship's helicopter needed to make a test flight after replacing the main rotorhead and was lost with all hands on 25 November. President Steyn and Emily Hobhouse arrived on 10 December and the frigate made another voyage to Toulon the following year to escort the submarine  home from France. This time, the trip was much more direct and the two ships arrived on 19 June 1972. Shortly afterwards, President Steyn sailed to Gough Island to pick up a seriously ill weatherman for treatment. In 1973, the ship, together with President Kruger and Johanna van der Merwe, visited Lourenco Marques (now Maputo) in Portuguese Mozambique from 29 March to 7 April. Despite downplaying the exercises with the South Africans, the Royal Navy continued to do so until the British government abrogated the Simonstown Agreement on 16 June 1975.\nPresident Steyn played a minor role in Operation Savannah, the South African covert intervention in the Angolan Civil War, most notably when she rescued 26 advisors to the National Liberation Front of Angola who had been cut off after a failed attack on Luanda on 28 November. To provide manpower for the French corvettes under construction, the ship was placed in reserve in early 1977. The United Nations arms embargo imposed later that year put paid to that plan and she was recommissioned the following year. Shortly before President Kruger was recommissioned on 15 August 1980, President Steyn was permanently decommissioned on 1 August, after the navy decided to only keep two of the sisters active.\nShe briefly served as a barracks ship before all of the useful equipment and machinery was stripped from her and the navy planned to use her as a target for Skerpioen missiles in 1982. However, the accidental sinking of her sister  in February 1982 gave the ship a reprieve as she was placed in reserve in case the navy decided to restore her to operational service. Plans to do so were made later in the 1980s, but shortages of money prevent them from being realized. President Steyn was towed from Simon's Town on 29 April 1991 and sunk by a combination of missile hits and gunfire from the five  involved in the exercise.\nReferences\nExternal links\n* [https://en.wikivoyage.org/wiki/Diving_the_Cape_Peninsula_and_False_Bay/SAS_Bloemfontein Guide to the wreck site on Wikivoyage]"
    }
  ]
}