{
  "content": [
    {
      "type": "text",
      "text": "# Saturday's Warrior\n\n| country     = United States\n| language    = English\n| music       = Lex de Azevedo\n}}\n'Saturday's Warrior' is a religious-themed musical written by Douglass Stewart and Lex de Azevedo about a family who are members of the Church of Jesus Christ of Latter-day Saints (LDS Church). The musical tells the story of a group of children that are born into a Latter-day Saint family after making various promises in the premortal life. Two of the children, Jimmy and Julie, encounter personal struggles that help them rediscover and fulfill their foreordained missions in life. Although no explicit time frame is given in the dialogue, certain contextual clues (in particular, a song that references the Zero population growth movement) suggest that the story takes place in the then-current and then-recent period of the late 1960s or early '70s, similar to other religious musicals such as Godspell and Jesus Christ Superstar.\nThe musical explores the Latter-day Saint doctrines and views on the plan of salvation, premortal life, foreordination, and eternal marriage. It depicts abortion and birth control as being contrary to the divine plan of salvation.\n''Saturday's Warrior'' was first performed in California in 1973 as a college project. In early spring 1974, the play was performed at Brigham Young University's (BYU) Spring Arts Festival by a cast of BYU students.  Bob Williams made a video version of the musical in 1989, setting it on a stage as opposed to giving the movie a more naturalistic look. It is among the first popular LDS films to not be made or sponsored by the LDS Church or BYU. Stewart wrote two sequels, Star Child (music by Gaye Beeson) which debuted in 1981, and The White Star (music by Janice Kapp Perry) which debuted in 2007. In 2016, de Azevedo and Stewart produced another filmed remake with a more naturalized look.\nPlot\nWhile waiting in the pre-mortal Life to be born, a family of eight children promise each other that they will always be there for each other (\"Pullin' Together\"). The youngest, Emily, is afraid that when her turn to be born comes around, their parents will be tired of having kids, and she won't be born into their family. The oldest, Jimmy, promises Emily he will personally see to it she will be born into their family. Julie—the second-oldest daughter—and Tod—another spirit in the pre-mortal life—promise each other that, while on earth, they will somehow find each other and get married (\"Circle of Our Love\").\nHowever, finding themselves on Earth and living a mortal life, no one remembers the promises they made before they were born. Julie finds herself desperately in love with Wally Kestler, who is now leaving to serve a two-year mission. Julie promises she'll wait for him (\"Will I Wait For You?\"). Jimmy is a typical confused teenager, influenced by peer pressure and rebellious against his parents. He finds himself in the company of other teenagers who are critical of his parents for having such a large family and advocate philosophies such as zero population growth and legalized abortion (\"Zero Population\"). Because of their influence, he becomes upset when he learns his parents are going to have another baby (Emily). Pam, Jimmy's twin sister, who has medical problems and can't walk, talks to Jimmy and tries to help him sort things out (\"Line Upon Line\"). Jimmy is still confused and leaves home to live with his friends. But when Jimmy has a chance encounter and conversation with a non-Mormon named Tod Richards (\"Voices\") and then gets a phone call from his family telling him Pam has died, he begins some serious personal reflection (\"Brace Me Up\"). He decides to return to his family.\nMeanwhile, Julie gets engaged to another man, Peter, and writes a \"Dear John letter\" to Wally while he's still on his mission (\"He's Just a Friend/Dear John\"). Wally is devastated, but his companion, Elder Green, convinces him to \"shape up\" and keep preaching the Gospel (\"Humble Way\"). Though the two companions have not had much success proselyting, they find Tod, who has been searching for answers (\"Paper Dream\") and teach him by the Spirit. Julie decides she doesn't want to marry Peter after all, but when Wally comes home from his mission, he brings Tod with him, and Julie realizes he's the man she's been searching for all her life (\"Feelings of Forever\"). At the climax of the movie, Pam dies and meets Emily in Heaven. They joyously reunite, then say goodbye as Pam must ascend into the afterlife at the same time as Emily must descend from the pre-life into her new mortal body as she is born. The main title song, \"Saturday's Warrior\", is played as a finale.\nProduction history\n''Saturday's Warrior was first produced at BYU in the spring of 1974 with Stewart, de Azevedo, and Harold Oaks, of the BYU theatrical department, being the moving forces behind the production. Azevedo was only lightly involved with the BYU production but later in 1974 staged a production in Los Angeles that was billed as having the original cast.\nA 1975 run in Salt Lake City and Spanish Fork, Utah was very successful.\nCast\n* Erik Hickenlooper as Jimmy\n* Cori Jacobsen as Julie\n* Davison Cheney as Tod\n* Bart Hickenlooper as Wally\n* D.L. Walker as Harold Greene\n* Marianne Thompson as Pam\n* Marvin Payne as Dad\n* Gay Parvis as Mom\n* Mary Greenwood as Shelly\n* Jared Christensen as Benjy\n* Kelsi Osborn as Alice\n* Matthew Lewis as Ernie\n* Rebecca Tate as Emily\n* Michelle Schaertl as Baby Emily\n* Judy Hibbert as Matron\n* Travis Tanner as Mack\n* Judy Gubler as Angel\nMusical numbers\nMusical Numbers, as included in the original play soundtrack:[https://archive.today/20120716000506/http://deseretbook.com/store/product?sku=1916301 DeseretBook.com - Saturday's Warrior: Original Play Soundtrack]\n*\"Saturday's Warrior\"\n*\"Circle of Our Love\"\n*\"Pullin' Together\"\n*\"Humble Way\"\n*\"Sailing On\"\n*\"Will I Wait For You?\"\n*\"Daddy's Nose\"\n*\"Zero Population\"\n*\"Didn't We Love Him?\"\n*\"Line Upon Line\"\n*\"He's Just a Friend/Dear John\"\n*\"Paper Dream\"\n*\"Paper Dream\" (Julie version) (FV)\n*\"Circle of Our Love Reprise I\" (FV)\n*\"Summer of Fair Weather\"\n*\"Saturday's Warrior Reprise\" (SV)\n*\"Line Upon Line Reprise\" (FV)\n*\"Voices\" (SV)\n*\"Brace Me Up\"\n*\"Brace Me Up Production Number\"\n*\"Paper Dream Reprise\"\n*\"Humble Way Reprise\" (FV)\n*\"Feelings of Forever\"\n*\"Circle of Our Love Reprise II\" (FV)\n*\"Saturday's Warrior Finale\"\n*\"Saturday's Warrior Theme\" (FV)\n(SV) Stage Version only(FV) Film Version only\nReception\n''Saturday's Warrior is not well known outside the LDS Church. The themes of Saturday's Warrior'', however, resound with many church members, especially regarding \"the last days\".\nThe Los Angeles Times reviewer described the production as \"pleasant lively and well-sung,... with an emphasis on close family ties.\"\n2016 film\nAfter resisting the idea for many years, de Azevedo and Stewart decided to make a film version of the musical, which opened in 2016.  The film is directed by Michael Buster, who co-wrote the script with Heather Ravarino.\nde Azevedo wrote three new songs for the movie version.\nProduction\nThe force behind this production largely came from de Azevedo's daughters, Emilie and Rachel. It has been criticized as having very poor production quality. Others have felt it was a well-produced work that truly moved the stage production into the realm of film.\nCast\n* Kenny Holland as Jimmy Flinders\n* Jacob Buster as Ernie Flinders\n* Monica Moore Smith as Julie Flinders\n* Mason D. Davis as Tod Richards\n* Bailee M. Johnson as Shelley Flinders\n* Caroline Labrum as Alice Flinders\n* Pete Day as Mr. Kestler\n* Katie E. Curran as Flight Attendant\n* Grace Hallows as Grace\n* Carlton Bluford as Mack\n* Chelsea Jurkiewicz as Bus Girl\n* Alex Boyé as The Heavenly Guide\n* Anna Daines as Pam Flinders\n* Brian Clark as Adam Flinders\n* Alison Akin Clark as Terri Flinders\n* Morgan Gunter as Elder Greene\n* Clint Pulver as Elder Kestler\n* James Bounous as Peter\nCameo\n* The Piano Guys\nCrew\n* Michael Buster (Director/Writer)\n* Lex de Azevedo (Writer/Executive Producer/Producer)\n* Heather Ravarino (Writer)\n* Duane Andersen (co-producer)\n* Emilie de Azevedo Brown (Executive Producer)\n* Rachel Coleman (Executive Producer)\n* Jarrod Phillips (Producer)\n* Bonnie Story (Choreographer)\nSoundtrack\n{| class=\"wikitable\" style=\"font-size: 100%\"\n! align=\"center\" |#\n! align=\"center\" |Title\n! align=\"center\" |Performer(s)\n! align=\"center\" |Music by\n! align=\"center\" |Lyric by\n! align=\"center\" |Length\n|-\n|1\n|\"Blink of an Eye\"\n|Alex Boyé and Gospel Choir\n|Lex de Azevedo\n|Lex de Azevedo, Heather Ravarino, and Doug Stewart\n|4:28\n|-\n|2\n|\"The Circle of Our Love\"\n|Christeena Michelle Riggs, Justin Williams, and Millennium Choir\n|Lex de Azevedo\n|Doug Stewart\n|3:11\n|-\n|3\n|\"Pullin' Together\"\n|Brian Neal Clark, Alison Akin Clark, Kenny Holland, Anna Daines, Monica Moore Smith, Bailee Johnson, Caroline Labrum, Ethan Mouser, Jacob Buster, and Chloe Ravarino\n|Lex de Azevedo\n|Doug Stewart\n|3:11\n|-\n|4\n|\"Humble Way\"\n|Dallin Major, Aaron de Azevedo, Alex Boyé, Tim Drisdom, and Gospel Choir\n|Lex de Azevedo\n|Doug Stewart\n|2:54\n|-\n|5\n|\"Sailing On\"\n|Kenny Holland and Millennium Choir\n|Lex de Azevedo\n|Doug Stewart\n|5:08\n|-\n|6\n|\"Zero Population\"\n|Kenny Holland, Carleton Bluford, Jenny Frogley, Aaron de Azevedo, Dallin Major, and Talmage Egan\n|Lex de Azevedo\n|Doug Stewart\n|2:59\n|-\n|7\n|\"Didn't We Love Him?\"\n|Alison Akin Clark, Brian Neal Clark, Kenny Holland, and Millennium Choir\n|Lex de Azevedo\n|Doug Stewart\n|1:53\n|-\n|8\n|\"Line Upon Line\"\n|Kenny Holland, Anna Daines, and Millennium Choir\n|Lex de Azevedo\n|Doug Stewart\n|3:35\n|-\n|9\n|\"Paper Dream\"\n|Justin Williams and Millennium Choir\n|Lex de Azevedo\n|Doug Stewart\n|2:53\n|-\n|10\n|\"Summer of Fair Weather\"\n|Kenny Holland, Carleton Bluford, Jenny Frogley, Aaron de Azevedo, Dallin Major, and Talmage Egan\n|Lex de Azevedo\n|Doug Stewart\n|2:22\n|-\n|11\n|\"Never Enough\"\n|Kenny Holland, Carleton Bluford, Jenny Frogley, Aaron de Azevedo, Dallin Major, and Talmage Egan\n|Lex de Azevedo\n|Lex de Azevedo and Heather Ravarino\n|3:44\n|-\n|12\n|\"There's Got to Be More\"\n|Justin Williams, Chloe Ravarino, Zachary Brown, Emilie de Azevedo Brown, C.J. Drisdom, Timothy Drisdom, and Gospel Choir\n|Lex de Azevedo\n|Lex de Azevedo and Heather Ravarino\n|4:59\n|-\n|13\n|\"Feelings of Forever\"\n|Christeena Michelle Riggs, Justin Williams, and Millennium Choir\n|Lex de Azevedo\n|Doug Stewart\n|2:46\n|-\n|14\n|\"Brace Me Up\"\n|Kenny Holland\n|Lex de Azevedo\n|Doug Stewart\n|5:20\n|-\n|15\n|\"Saturday's Warrior\"\n|Kenny Holland, Anna Daines, and Millennium Choir\n|Lex de Azevedo\n|Doug Stewart\n|3:46\n|-\n|16\n|\"More to This Life\"\n|Kenny Holland\n|Lex de Azevedo and Kenny Holland\n|Lex de Azevedo, Kenny Holland, and Mason D. Davis\n|3:44\n|-\n|17\n|\"I Will Find You\"\n|\n|Lex de Azevedo\n|\n|1:13\n|-\n|18\n|\"Promise, Jimmy?\"\n|\n|Lex de Azevedo\n|\n|1:08\n|-\n|19\n|\"Julie & Mom\"\n|\n|Lex de Azevedo\n|\n|2:03\n|-\n|20\n|\"Loss\"\n|\n|Lex de Azevedo\n|\n|1:12\n|-\n|21\n|\"Tod's Conversion\"\n|\n|Lex de Azevedo\n|\n|1:07\n|-\n|22\n|\"Journey Home\"\n|\n|Lex de Azevedo\n|\n|2:16\n|-\n|23\n|\"The Prodigal Son Returns\"\n|\n|Lex de Azevedo\n|\n|1:24\n|-\n|24\n|\"I Choose Emily\"\n|\n|Lex de Azevedo\n|\n|1:36\n|-\n|25\n|\"I've Seen That Smile\"\n|\n|Lex de Azevedo\n|\n|1:45\n|-\n|26\n|\"Pam's Letter\"\n|\n|Lex de Azevedo\n|\n|1:21\n|-\n|}\nSee also\n* Added Upon\nReferences\n*[http://associationmormonletters.org/blog/2016/04/saturdays-warrior-movie-reviews/ Association for Mormon letters composite of articles on Saturday's Warrior]\nExternal links\n*"
    }
  ]
}