{
  "content": [
    {
      "type": "text",
      "text": "# Saurian Expedition of 1905\n\nThe Saurian Expedition of 1905 was a paleontological research mission in northern Nevada in the United States. The expedition recovered many of the most well-preserved specimens of ichthyosaur ever found. Information on the key contributors, details on the expedition itself and its findings can be found below.\nKey contributors\nAnnie Montague Alexander, \"a wealthy heiress to a sugar fortune,\" was a woman that stood out from others of the same status. She always found herself to be drawn to anything outdoors and did not want to abide by the \"expectations\" of woman in her social class. In way of doing this, she began studying paleontology at the University of California at Berkeley. It was here that she began going on scientific expeditions, such as the Saurian Expedition of 1905.\nThe expedition was led by Eustace Furlong, an assistant at the Geology Department at Berkeley, under the guidance of one of Annie's professors John C. Merriam, of the University of California. The expedition was financed by Annie Alexander. Alexander was an active participant and collector during the expedition along with Edna Wemple, also a student of Merriam and the first woman to earn a Master's degree in paleontology at Berkeley. Most all written documentation and photographs were taken by Alexander. William Boynton, another Berkeley student, joined the Nevada crew during the expedition, and went on to graduate the following year. He would return to Berkeley at least one summer later to help with preparing the specimens they uncovered from the expedition. Malcolm Goddard, or the so-called, \"dentist-adventurer-hunter,\" was also another student at the time who accompanied the crew to Nevada. Unlike Edna, William, and Malcolm, James P. Smith was not a student of Berkeley during the time of the expedition. Rather, he graduated from the University of Göttigen with his Ph.D. and was teaching Paleontology at Stanford University. He also joined the crew to Nevada during the expedition.\nThe Expedition\nThe expedition, which took place during May and June of 1905, covered just 2 square miles. The focus of their work was located in the West Humboldt Range in Nevada. More specifically, these 2 square miles lay within the area that separates the American Cañon from Troy Cañon. The purpose of this trip was uncover fossils by way of examining Triassic limestones located along the pathway. The crew was in search of fossil evidence of ichthyosaurs, large marine reptiles that existed during Mesozoic era and again during the Early Triassic epoch, until being replaced another marine reptilian group, Plesiosauria. The purpose of their expedition would be described by Annie as such,\n\"''Our particular privilege was to unearth swimming reptiles of some ten million years' standing, no light task considering the grip in which they were held.''\"\nThey hoped to bring any specimens found back to Berkeley, where they could be analyzed further and later be put on display by the university's museum.\nThroughout the duration of the trip, they found themselves setting up basecamps in abandoned mining shacks. They used tools such as shovels, picks, and dynamite to uncover these fossils and release them from the bedrock. Horses were utilized to carry these specimens along the trip.\nFindings\nAs stated above, the expedition examined Triassic limestones in the West Humboldt Range northeast of Reno. Some of the specimens were returned to Berkeley and became part of the collection of the University of California Museum of Paleontology, which Alexander helped found and underwrite.\nBy the end of the expedition, some portions of twenty-five ichthyosaurs had been collected. These uncovered relics were some of the largest and most complete fossils of this species to ever be found (thus far at the time). One of the specimens worth noting was found on Saurian Hill and was said to be twenty-five feet long.\nReferences"
    }
  ]
}