{
  "content": [
    {
      "type": "text",
      "text": "# Sausage making__disambig_1\n\nAdvertisement for a sausage making machine, London, 1894\nItaly 2008]]\nItaly 2008]]\nSmall-scale industrial manufacturing in Russia\nMeat ready for sausage making\nIntestine for sausage making\nSausage making originally developed as a means to preserve and transport meat. The origins of meat preservation are lost to the ages but probably began when humans began to realize the preservative value of salt. Primitive societies learned that dried berries and spices could be added to dried meat. The procedure of stuffing meat into casings remains basically the same today, but sausage recipes have been greatly refined and sausage making has become a highly respected culinary art.\nSausages come in two main types: fresh and cured. Cured sausages may be either cooked or dried. Many cured sausages are smoked, but this is not mandatory. The curing process itself changes the meat and imparts its own flavors. An example is the difference in taste between a pork roast and a ham.\nAll smoked sausages are cured. The reason is the threat of botulism. The bacterium responsible, Clostridium botulinum, is ubiquitous in the environment, grows in the anaerobic conditions created in the interior of the sausage, and thrives in the  to  temperature range common in the smoke house and subsequent ambient storage. Thus, for safety reasons, sausages are cured before smoking.\nTypes of sausages and their storage\n{| class=\"wikitable\"\n|+ Sausage Classifications\n! Classification !! Examples !! Storage and Handling\n|-\n| Fresh sausage || Fresh pork sausage || Keep refrigerated. Cook bratwurst, bockwurst thoroughly before eating. Consume within 3 days or freeze\n|-\n| Uncooked smoked sausage || Smoked, country style, mettwurst, keilbasa. || Keep refrigerated. Cook thoroughly before eating. Consume within 7 days or freeze.\n|-\n| Cooked smoked sausage || Frankfurter, bologna, cotto salami || Keep refrigerated. Consume within 7 days of opening vacuum package\n|-\n| Dry sausage || Genoa salami, pepperoni || Does not require refrigeration.\n|-\n| Semidry sausage || Lebanon bologna, cervelot, summer sausage, thuringer || For best quality, keep refrigerated.\n|-\n| Cooked meat specialties || Loaves, head cheese, scrapple || Keep refrigerated. Consume within 3 days after opening vacuum package\n|}\nFresh sausages\nFresh sausages are simply seasoned ground meats that are cooked before serving. Fresh sausages normally do not use cure (Prague powder #1) although cure can be used if desired. In addition fresh sausages typically do not use smoke flavors, although liquid smoke can be used. Fresh sausages are never smoked in a cold smoker because of the danger of botulism.\nThe primary seasoning agents in fresh sausages are salt and sugar along with various savory herbs and spices, and often vegetables, including onion and garlic.\nA British fresh sausage typically contains around 10% butcher's rusk, 10% water, 2.5% seasoning, and 77.5% meat. At the point of sale, British sausages will often be labelled as \"actual meat content X%\". As meat can be fatty or lean, the X% is calculated using reference tables with the intention to give a fairer representation of the \"visual lean\" meat content.\nCured cooked sausages\nCured sausages differ from fresh sausages by including 2 teaspoons of cure (Prague powder #1) per 10&nbsp;pounds of finished product. This is usually interpreted per 10&nbsp;pounds of meat. This works out to 4&nbsp;ounces of cure for 100&nbsp;pounds of sausage.\nNext the product is typically hot smoked. However, similar effects can be achieved by incorporating liquid smoke in the recipe. Smoking temperatures vary and are typically less than . At a temperature of 152&nbsp;°F (67&nbsp;°C) these sausages are fully cooked.\nIn some cases cold smoke is used. If so, then the sausage may have been previously cooked in a water bath held at the proper temperature. An example of this process is the preparation of Braunschweiger. In this style of sausage, after stuffing into  to  hog buns or fiberous casings, the sausage is submerged in  water for 2 to  hours until the internal temperature reaches . At this point the sausage should be chilled in ice water, then cold smoked at a temperature of  for 2–3 hours.\nCured dry sausages\nCured dry sausages are prepared in a fashion similar to cured cooked sausages. The major difference is that Prague powder #2 will be used in place of Prague powder #1. In addition, certified meats must be used. Since these products are never heated to a temperature that can kill trichinella parasites, it is necessary to accomplish this by other methods. The usual method is via freezing. Pork may be rendered acceptable for use in dry sausages by freezing it using the following guidelines:\n*  20–30 days\n*  10–20 days\n*  6–12 days\nThe specific regulations are quite complex. They depend on the thickness of the cuts of meat, the packaging method, and other factors. In addition there are very specific requirements as to the times in the drying rooms and the temperatures in the smoke rooms.\nWhile it is quite feasible for the small sausage kitchen or hobbyist to produce excellent cured dry sausages, a great deal of technical information is required. Alternatively, certified pork can be simply purchased.\nEquipment\nTraditional sausage making in Hungary\nEquipment depends on scale, a small home grinder and some basic measuring tools may be all that is required. In a larger scale commercial operation, more high volume equipment will be required.\nRegarded as the three most important pieces of equipment, regardless of the amount of sausage being made are an accurate thermometer, a calibrated scale, and a meat grinder. Smoked or smoke/cooked sausages require a smoker (small batches) or a commercial smokehouse. Emulsion-type cooked sausages, such as frankfurters or bologna, use a bowl chopper to make finely ground meat batter that is put into casings and cooked or smoked.\nMeats and other ingredients\nA variety of fresh meats may be used for making sausage, the most common are from beef, pork, lamb, chicken, turkey, and game.  Meat should be fresh, high quality, have the proper lean-to-fat ratio and good binding qualities. The meat should not be contaminated with bacteria or other microorganisms. Combining spices and seasonings in amounts that complement each other is important.\nCuring salts\nMaking dry sausages involves curing salts, which contain sodium nitrite and sodium nitrate. Nitrites are used for all types of sausages and are the most common. Nitrates are used only in the preparation of the cured dry style of sausages. Over a period of time the nitrates are converted into nitrites by endogenous or added bacteria. Nitrite is commonly added to sausages to speed up the curing of meat and also impart an attractive colour while having no effect on the growth of the Clostridium botulinum bacteria which causes botulism. Some traditional and artisanal producers avoid nitrites.\nThe human digestive system manufactures nitrites, which is thought to be what prevents botulism, which would thrive in the anaerobic conditions and temperature range of the digestive system (gut).\nCured meat products typically contain less than 40 ppm nitrites.\nPotassium nitrite and potassium nitrate additions allow the production of sausages with lower levels of sodium. When using the potassium form, it is necessary to include other ingredients to mask the bitter flavours it imparts. Old recipes use saltpetre which is not recommended. The primary reason is that often these old recipes contain many times more curing ingredients than are appropriate. Modern techniques are readily available and do a much better job.\nIn the sausage industry the nitrites and nitrates are pre-formulated into products called Prague powder #1 and Prague powder #2. Prague powder #1 contains 6.25% sodium nitrite and 93.75% sodium chloride and is used for the preparation of all cured meats and sausages other than the dry type.  Prague powder #2 contains 1&nbsp;ounce of sodium nitrite (6.25%) and 0.64&nbsp;ounces sodium nitrate (4.0%) per pound of finished product (the remaining 14.36&nbsp;ounces is sodium chloride) and is used for the preparation of cured dry sausages. Prague powder #2 should never be used on any product that will be fried at high temperature (e.g. bacon) because of the resulting formation of nitrosamines.\nWhen using cure, it is very important to never exceed the recommended amount of 2.5&nbsp;grams of Prague powder #1 in 1 kilogram of meat (4 ounces/100 pounds). Equivalently this is 10 mL for 4.5&nbsp;kg (2 teaspoons for 10&nbsp;pounds). Note that the maximum allowable amount of sodium nitrite and potassium nitrite is governed by regulations and is limited to 7&nbsp;grams per 45&nbsp;kg (0.25&nbsp;ounces per 100&nbsp;pounds) of chopped meat. Since Prague powder #1 is a 1:15 dilution (in 0.45&nbsp;kg of Prague powder #1 30&nbsp;grams is sodium nitrite and 425&nbsp;grams are common table salt), we get the proper amount at a rate of 114&nbsp;grams added to  of meat.\nSodium nitrate and potassium nitrate are limited to 1.7&nbsp;gram per kilogram (2.75 ounces per 100 pounds).\nSodium and potassium nitrite are quite toxic to humans with the lethal dose being about 4&nbsp;grams. As little as 22&nbsp;mg/kg of body weight can cause death. This is about 2.2&nbsp;grams for a body mass of 100&nbsp;kg. Thus, there is enough sodium nitrite in 2&nbsp;ounces of Prague powder #1 to kill a person.\nMorton's Tenderquick is the brand name of another formulation of sodium nitrite, with salt and sugars added. It is not the same concentration as either \"Prague powder #1 or #2\". Since certainty about the amount of nitrite present in a recipe is essential for safety, one cannot take a recipe designed for Prague powder and simply substitute like amounts of such products as Morton's Tenderquick. To do so would invite the risk of botulism poisoning. Similarly, one cannot just substitute Prague powder #1 in place of Morton's Tenderquick. For any such substitutions, one must calculate the exact amount of nitrite required and make the proper adjustments.\nSpices\n{| class=\"wikitable\" style=\"text-align:center;\"\n|+ Spices Used in Processed Meats\n! Common name\n! Form\n! Volume/Weight ml/g (teaspoons/ounce)\n! Usage\n|-\n| Allspice\n| Whole, Ground\n| 2.43 (14)\n| Bologna, pickled pigs feet, head cheese\n|-\n| Anise\n| Seed\n| 2.52 (14.5)\n| Dry sausages, mortadella, pepperoni\n|-\n| Basil\n| Leaves\n| 6.09 (35)\n| Pickled and jellied meats\n|-\n| Bay\n| Leaves\n| 5 (136) leaves (approx.)\n| Pickle for pigs feet, lamb tongue\n|-\n| Caraway\n| Seed\n| 1.65 (9.5)\n| Semi-dry sausages, meat loaves, luncheon meat\n|-\n| Cardamom\n| Seed-whole Ground\n| 2.52 (14.5)\n| Frankfurters, liver sausage, head cheese, semi-dry sausages\n|-\n| Cassia\n| N/A\n| N/A\n| Bologna, blood sausage\n|-\n| Celery\n| Seeds, flakes, salt\n| 2.43 (14)\n| Pork sausage, frankfurters, bologna, meat loaves, lunch meats\n|-\n| Cinnamon\n| Stick, Ground\n| 3.04 (17.5)\n| Bologna, head cheese\n|-\n| Cloves\n| Whole, Ground\n| 2.52 (14.5)\n| Bologna, liver sausage, head cheese\n|-\n| Coriander\n| Seed, Ground\n| 2.43 (14)\n| Frankfurters, bologna, Polish sausage, luncheon specialties\n|-\n| Cumin\n| Seed, Ground\n| 2.43 (14)\n| Curry powder\n|-\n| Fennel\n| Seed\n| 2.43 (14)\n| Italian sausage\n|-\n| Garlic\n| Powder, Salt, Minced\n| 2.43 (14)\n| Polish sausage, many smoked sausage types\n|-\n| Ginger\n| Whole, ground\n| 2.43 (14)\n| Pork sausage, frankfurters, corned beef\n|-\n| Mace\n| Ground\n| 2.43 (14)\n| Veal sausage, liver sausage, frankfurters\n|-\n| Marjoram\n| Leaves\n| 3.39 (19.5)\n| Liver sausage, Polish sausage, head cheese\n|-\n| Mustard\n| Seed, powdered\n| 2.52 (14.5)\n| Good in almost any sausage\n|-\n| Nutmeg\n| Whole ground\n| 2.22 (12.75)\n| Veal sausage, bologna, frankfurters, liver sausage, head cheese\n|-\n| Onion\n| Chopped, Powdered, Salt, flakes, granulated\n| N/A\n| Liver sausage, head cheese, baked loaves\n|-\n| Oregano\n| Leaves, ground\n| 4.52 (26)\n| Frankfurters, bologna, meat loaves, luncheon\n|-\n| Paprika\n| Ground\n| 2.35 (13.5)\n| Frankfurters, Mexican sausage, dry sausage\n|-\n| Pepper (black, white)\n| Whole, ground (fine, coarse)\n| 2.65, 2.30 (15.25, 13.25)\n| Most sausage Products\n|-\n| Pimento\n| N/A\n| N/A\n| Baked loaves\n|-\n| Rosemary\n| Leaves\n| 6.09 (35)\n| Liver sausage\n|-\n| Sage\n| Leaves, rubbed, ground\n| 3.82 (22)\n| Pork sausage, baked loaves\n|-\n| Savory\n| Leaves, ground\n| 3.26 (18.75)\n| Good in almost any sausage\n|-\n| Thyme\n| Leaves, Ground\n| 3.52 (20.25)\n| Good in almost any sausage\n|-\n| Turmeric\n| Ground\n| 2.09 (12)\n| Good in almost any sausage\n|}\nNote: The volume-to-weight ratio applies to the herbs and spices only. This in no way indicates the particular amount for a given recipe.\nCulture\nSausage making is sometimes looked at for being messy in the broader culture. There are common sayings such as \"how the sausage gets made\" to refer to a process that someone might rather not know all the gory details. This line of quotation stems from American poet John Godfrey Saxe, who said \"Laws, like sausages, cease to inspire respect in proportion as we know how they are made\" (1869).\nSee also\n* List of dried foods\n* List of sausages\n* List of smoked foods\nReferences\nExternal links\n* [https://www.ag.ndsu.edu/pubs/yf/foods/fn176.pdf The Art and Practice of Sausage Making]"
    }
  ]
}