{
  "content": [
    {
      "type": "text",
      "text": "# Savage: The Battle for Newerth__disambig_2\n\n|EU|February 27, 2004}}|Mac OS X}}}}\n| genre = Real-time strategy, first-person shooter\n| modes = Multiplayer\n| platforms =\n| publisher = iGames\n| series = Savage\n}}\nSavage: The Battle for Newerth is a 2003 video game combining aspects of the real-time strategy and first-person shooter  genres, developed by S2 Games. It takes place in a science fantasy distant future when mankind has rebuilt society after the apocalypse, but is threatened by intelligent beasts led by a sorceress.\nGameplay\nSavage is a solely online game, as it does not include a single-player mode. Each match takes place on a map of varying size. A single match has two or more teams, which can be either human or beasts (most maps have one human team and one beast team, but any configuration is possible). The goal of the game is to destroy the primary enemy structure — the \"Stronghold\" for the human race, or the \"Lair\" for the beast race. Each team has one commander, who plays the game like a real-time strategy (RTS), and additional players, who play the game like a first / third person shooter / hack and slash. The human team is better at defense and ranged combat, while the beast team is better at offense and melee combat. A lot of gameplay is based on melee combat, which is notoriously hard to master and different from most games.\nA commander is responsible for directing his team, constructing buildings and researching technology. The commander is capable of creating a maximum of ten workers, which are NPCs that are fully controlled by the commander. These workers can be commanded to construct and repair buildings, mine resources and even attack other players or NPCs. Commanders can also issue these commands to the players on their team, allowing the commander to coordinate team movements and attacks. Players can also receive buffs from the commander once the technology tree has been sufficiently developed. When a match starts, players may request to act as the commander. Depending on the game server's settings, they may either be promoted immediately, or the team must vote on the request. A match cannot start until both teams have a commander, although commanders may quit the game after the match has started.\nThe other 1 to 127 players on the team are the field players, that receive orders from the commander, which appear as visual waypoints. They can be ordered to attack enemies, mine resources, or construct buildings, although there is no penalty for ignoring orders. Some players can be promoted to the rank of \"Officer\" by their commander, which allows them to issue similar orders to other players on the team. Officers also grant a passive healing bonus to teammates around them. When a field player is killed, they are presented with the option to purchase units and weapons before spawning. The units and weapons that are available are determined by the commander's development of the technology tree and the amount of gold the player has (although players can request items from the commander if they don't have enough gold). Gold is obtained by killing players, NPCs, and damaging enemy buildings.\nRelease\nThe game was released in 2003, was turned freeware on September 1, 2006, and its source code was made available to the public. S2 Games have discontinued the game since, but its community continued developing it.\nDeveloped by a team at Newerth.com with S2 Games' support, XR was the most widely used continuation of Savage. It includes all improvements contributed by the Savage Full Enhancement mod, and adds better player models, new animations, new music, an additional 500 props for map designers, a reworked GUI and better support for mods, among other features. Unlike the original Savage, XR is not open-source due to concerns about cheating, which has been a problem in the past for open-sourced versions of the game.\nThe official Savage XR website, Newerth.com, was closed down in 2022 but the community continues developing the game.\nReception\n| MC = 75/100\n| EuroG = 8/10\n| IGN = 8.7/10\n| GSpot = 7.1/10\n}}\nEurogamer awarded Savage 8 out of 10, criticizing technical glitches and the lack of any introductory tutorials, but highlighting the RTS-style gameplay aspects, accommodation for a wide range of player styles and good looking graphics.\nIt won the 2004 Seumas McNally Grand Prize for best indie game.\nSee also\n* Savage 2: A Tortured Soul\n* Heroes of Newerth\nNotes\nReferences\nExternal links\n* [http://www.newerth.com/ Official Savage XR website]"
    }
  ]
}