{
  "content": [
    {
      "type": "text",
      "text": "# Save A Warrior\n\nSave A Warrior (SAW), also known as the Warrior Meditation Foundation, is a U.S.-based nonprofit 501(c)(3) organization headquartered in Columbus, Ohio. It provides intensive, multi-day retreat programs followed by long-term support for active-duty service members, veterans, and first responders experiencing psychological stress such as post-traumatic stress disorder and suicidal ideation.\nHistory\nSave A Warrior was launched in 2012 by the former police detective and FBI special agent Jake (“Ronald Jake”) Clark in Malibu, California.\nThe core offering consists of Integrated/Integrative Intensive Retreats (IIRs) - short, highly structured, typically weeklong in-person group programs. These combine elements such as warrior meditation, peer support, experiential and nature-based formats (including high-ropes courses), equine-assisted learning, and psychoeducational modules (for example, work with \"Adverse Childhood Experiences\" and PTSD education). The curriculum is holistically ritualised.\nThe organization explicitly targets service members, veterans, and first responders.\nIn 2013, after the organization had established itself, Charity Navigator, a non-profit and independent rating platform that evaluates charitable organizations in terms of transparency, financial responsibility and effectiveness, awarded the Save a Warrior Foundation a 4-star rating.\nAs the program expanded in 2018, SAW shifted its main operations to Ohio and established the so-called Warrior Village to increase participant capacity. It serves as the central site for the IIR program.\nClark moved his organization to the Midwest and began building this infrastructure.\nProgram\nThe program begins with a 72-hour intensive phase at Warrior Village, followed by long-term aftercare, including mentoring and community support, which spans a structured plan lasting many months.\nAfter the 72-hour intensive phase, Save a Warrior develops an individual, structured 500-day plan for each participant.\nSave a Warrior also maintains a confidential peer network for ongoing support and crisis assistance.\nOrganization and Finances\nIn 2023, SAW reported income of approximately 3.97 million US dollars, expenditure of 2.54 million US dollars and assets of 11.57 million US dollars. The foundation has grown exponentially since 2017.\nSAW is primarily funded by donations and foundation grants. Grants totalling 50,000 US dollars were received from the Infinite Hero Foundation for 2018 and 2019, and veterans-focused foundations such as the DAV Charitable Service Trust have also announced contributions.\nImpact and Reception\nThe program is highly sought-after and runs several cohorts per year (30 cohorts and 323 participants in 2023). According to participants, SAW's approach is immersive and community-based.\nFormer members particularly emphasise the combination of evidence-based methods, ritual work and mutual support. Participants report a perceived improvement in their PTSD symptoms and a stronger sense of connection.\nFounder\nJake (Ronald Jake) Clark is the founder and president of Save a Warrior and grew up in California. He served in the U.S. Army National Guard and took part in peacekeeping missions in the Balkans, including Bosnia and Kosovo. His experiences during these missions later shaped his work in the field of mental health for veterans.\nHe studied at the University of Phoenix, where he was later honoured as an alumnus.\nBefore founding the Save a Warrior Foundation, Clark worked as a police officer in Los Angeles and as a special agent for the FBI.\nAfter his time in public service, he became increasingly involved in veteran support and trauma work. His own experiences with post-traumatic stress led him to develop a holistic support model for veterans and first responders.\nAwards and recognition\nClark has received the following awards for his commitment to helping veterans:\n* WebMD Health Hero Award (2015)\n* Eagle Rare Life Award (2018)\nHe has also been honoured as an outstanding graduate by the University of Phoenix and has spoken on numerous occasions on topics such as post-traumatic stress, resilience and veteran integration.\nReferences"
    }
  ]
}