{
  "content": [
    {
      "type": "text",
      "text": "# Scene Queen__disambig_2\n\n| birth_place  = New York, U.S.\n| occupation   =\n| years_active = 2020–present\n| genre        =\n| label        = Hopeless\n}}\nHannah Rose Collins (born May 6, 1997), professionally known as Scene Queen and formerly RØSÉ, is an American singer signed to Hopeless Records. She is known for coining the style \"bimbocore\", a subgenre of metalcore with feminist themes. She rose to fame on the social media platform TikTok, where she has garnered over 618,000 followers as of September 2023. Her debut EP Bimbocore was released in April 2022. A follow-up EP, Bimbocore Vol. 2, was released in November of that year. Her debut studio album, Hot Singles in Your Area, was released in 2024.\nEarly life and career\nHannah Collins grew up in Upstate New York and has lived in Alabama, Ohio, and currently lives in Los Angeles, California. Growing up, she and her older sister listened to emo bands such as My Chemical Romance and Brand New. In middle school, she ran a Tumblr blog and was a fan of scene bands such as Sleeping With Sirens, Pierce The Veil and indie-pop bands such as The Ready Set. She originally intended to work on the administrative side of the music industry, hoping to land a job at Hopeless Records but decided against it. She left the scene movement in 2015 after feeling it had become misogynistic, focusing her songwriting on Pop, Hip-hop and Latin world but returned to the Alt movement where she encompassed all these genres into her music. She applied for internships at Hopeless Records 3 times.\nShe self-released the single \"Are You Tired?\" in 2020, and signed with Hopeless Records in 2021. On March 3, 2022, Scene Queen released the song \"Pink Rover\", a song about the objectification of women and street harassment. Her debut EP Bimbocore was released on April 29, 2022, alongside the single \"Pink Panther\".\nOf her creative process, she said \"Before writing Bimbocore I felt like if I wasn’t exactly the way the rock industry wanted me to be I would never make it. It’s through this project that I’ve been able to pull myself out of that space and be unapologetically myself. I wrote this EP to be hyper-feminine and over the top because women have spent far too long making themselves small for other people's comfort. I realized that the louder I am and the more out of the box I get, the bigger the box gets, and the more room there is for other women to get inside it.\"\nOn July 15, 2022, Scene Queen released the lead single from her second EP, \"Pink G-String\". The EP's second single, \"Barbie & Ken\", is a collaboration with American punk band Set It Off. The song was released on August 25, 2022. Scene Queen's second EP, titled Bimbocore Vol. 2, was released on November 10, 2022, along with the single \"Pink Hotel\".\nIn March 2023, Scene Queen released the lead single from her debut studio album, \"18+\". She spoke about the purpose of the song, which calls out sexual misconduct and predatory behavior in the alternative scene, stating, \"Having people arguing over which band I might be upset with, arguing over security measures taken place in the scene, or even arguing whether the lyrics are good or just borderline unsettling is the exact point of the song: to get people talking about what we've refused to talk about in the scene the last ten years.\" In September 2023, Scene Queen released another single, \"Pink Push-Up Bra\" ahead of her tour dates in the United Kingdom. Her follow-up single, \"MILF\", blends country and metal in an effort to be \"a conservative person's worst nightmare\". The song, which was released in November 2023, was shortly followed by the announcement of Scene Queen's first full-length album, titled Hot Singles in Your Area; the album was released on June 28, 2024.\nScene Queen released her next single \"Finger\" in March 2024, ahead of her tour with Pvris. The following month, she released a MySpace-era inspired song, \"Stuck\", featuring 6arelyhuman. In May 2024, she released another single from the album, \"Whips & Chains\". Scene Queen played Download Festival in June, and donated her fee to charities supporting Palestine.\nIn July and August 2024, Scene Queen co-headlined the Idobi Radio Summer School Tour, alongside Stand Atlantic, The Home Team, and Magnolia Park, with support from Honey Revenge and Letdown. Scene Queen began a headline tour in September 2025, with events in the UK, France, Belgium, Netherlands, and Germany.\nMusical style\nScene Queen defines her music as \"bimbocore\", a \"hyperfeminine offshoot of metalcore\" that \"blends the reclaimed hyperfeminine aesthetics and vocal distortions of genres like pop with metalcore-inspired breakdowns\". Her music has been described by Kerrang! as \"a jagged jigsaw of clashing sounds, combining ferocious walls of djent guitar, and thumping trap beats that come together to create a seething harshness that will draw in fans of everyone from Ghostemane to Ashnikko and Kesha.\"\nHer song \"Pretty in Pink\" blends screamo vocals with nursery rhyme melodies, while \"Pink Panther\" is an alt-pop track that samples \"The Pink Panther Theme\" with lyrics about lesbian sex. Her fashion style is inspired by Y2K fashion style icons like Paris Hilton and Nicole Richie, with blonde hair and hot pink clothes.\nPersonal life\nCollins has ADHD and bipolar disorder. She has also been diagnosed with postural orthostatic tachycardia syndrome. She is bisexual and has said that her song \"Pink Panther\", which features themes of attraction to women, helped her come out.\nCollins has been in a relationship with In Her Own Words vocalist Joey Fleming since August 2023.\nDiscography\nAll credits adapted from Apple Music and Spotify.\nAlbums\n{| class=\"wikitable plainrowheaders\" style=\"text-align:center;\"\n! scope=\"col\" style=\"width:18em;\" | Title\n! scope=\"col\" style=\"width:16em;\" | Details\n|-\n|-\n! scope=\"row\"|Hot Singles in Your Area\n|\n*Released: June 28, 2024\n*Label: Hopeless\n*Format: CD, vinyl, digital download, streaming\n|-\n|}\nExtended plays\n{| class=\"wikitable plainrowheaders\" style=\"text-align:center;\" border=\"1\"\n! scope=\"col\" rowspan=\"2\" style=\"width:12em;\"| Title\n! scope=\"col\" rowspan=\"2\" style=\"width:16em;\"| Details\n! colspan=\"1\" scope=\"col\" | Peak chart positions\n|-\n! scope=\"col\" style=\"width:3em;font-size:85%;\"| UKDL\n|-\n! scope=\"row\"|Bimbocore\n|\n*Released: April 29, 2022\n*Label: Hopeless\n*Format: Vinyl, digital download, streaming\n|98\n|-\n! scope=\"row\"|Bimbocore Vol. 2\n|\n*Released: November 10, 2022\n*Label: Hopeless\n*Format: Digital download, streaming\n|–\n|}\nSingles\n{| class=\"wikitable plainrowheaders\" style=\"text-align:center;\" border=\"1\"\n! scope=\"col\" style=\"width:12em;\"| Title\n! scope=\"col\" style=\"width:4em;\"| Year\n! scope=\"col\" style=\"width:16em;\"| Album\n!Writer(s)\n!Producer(s)\n|-\n!scope=\"row\"|\"Are You Tired?\"\n|2020\n|\n|Hannah Collins\n|\n|-\n!scope=\"row\"|\"Pretty in Pink\"\n|rowspan=\"2\"|2021\n|rowspan=\"4\"|Bimbocore\n| rowspan=\"4\" |Hannah Collins, Zach Jones, Ronald Ish\n| rowspan=\"7\" |Zach Jones\n|-\n!scope=\"row\"|\"Pink Bubblegum\"\n|-\n!scope=\"row\"|\"Pink Rover\"\n|rowspan=\"5\"|2022\n|-\n!scope=\"row\"|\"Pink Panther\"\n|-\n!scope=\"row\"|\"Pink G-String\"\n|rowspan=\"3\"| Bimbocore, Vol. 2\n|Hannah Collins, Zach Jones, Rachel Kanner\n|-\n!scope=\"row\"|\"Barbie & Ken\"\n|Hannah Collins, Zach Jones, Ronnie Ish, Cody Carson\n|-\n!scope=\"row\"|\"Pink Hotel\"\n|Hannah Collins, Zach Jones, Rachel Kanner, Ryan Oakes, Cody Carson\n|-\n!scope=\"row\"|\"18+\"\n|rowspan=\"3\"|2023\n| rowspan=\"7\" | Hot Singles in Your Area\n|Hannah Collins, Zach Jones, Rachel Kanner, Jason Aalon\n|Zach Jones, Jason Aalon\n|-\n!scope=\"row\"|\"Pink Push-Up Bra\"\n| rowspan=\"2\" |Hannah Collins, Zach Jones, Rachel Kanner, KJ Strock\n| rowspan=\"3\" |Zach Jones\n|-\n!scope=\"row\"|\"MILF\"\n|-\n!scope=\"row\"|\"Finger\"\n| rowspan=\"5\" |2024\n|Hannah Collins, Zach Jones, Maize Olinger, Curtis Peoples\n|-\n!scope=\"row\"|\"Stuck\"\n|Hannah Collins, Zach Jones, Rob Nelson, Toby Hamilton\n|Zach Jones, Inverness\n|-\n!scope=\"row\"|\"Whips & Chains\"\n|Hannah Collins, Zach Jones, Chris Freeman, Curtis Peoples\n| rowspan=\"3\" |Zach Jones\n|-\n!scope=\"row\"|\"Girls Gone Wild\"\n|Hannah Collins, Zach Jones, Rachel Hastings, Rachel Kanner\n|-\n!scope=\"row\"|\"The Best Thing (That Never Happened)\"\n|Hopelessly Devoted To You: 30th Anniversary\n|Cameron Humphrey, John Feldmann, Jordan Eckes, Michael Ferri, Robert Chianelli, Taylor Jardine, Tommy English\n|-\n!scope=\"row\"|\"L-Shaped Couch\"\n| rowspan=\"2\" |2025\n| rowspan=\"2\"\n|Hannah Collins, Zach Jones, Nick Smith, John Kenneth Strock\n|Zach Jones, Nick Smith, KJ Strock\n|-\n!scope=\"row\"|\"Platform Shoes\"\n|Hannah Collins, Rob Nelson, John Kenneth Strock, Nick Smith, Zach Jones\n|Zach Jones, Nick Smith, Inverness\n|}\nAs featured artist\n{| class=\"wikitable plainrowheaders\" style=\"text-align:center;\" border=\"1\"\n! scope=\"col\" style=\"width:12em;\"| Title\n! scope=\"col\" style=\"width:4em;\"| Year\n! scope=\"col\" style=\"width:16em;\"| Album\n|-\n!scope=\"row\"|\"Win Win\"\n|2023\n|\n|}\nMusic videos\n{| class=\"wikitable plainrowheaders\" style=\"text-align:center;\" border=\"1\"\n! scope=\"col\" style=\"width:12em;\"| Title\n! scope=\"col\" style=\"width:4em;\"| Year\n! scope=\"col\" style=\"width:16em;\"| Director\n|-\n!scope=\"row\"|\"Pretty in Pink\"\n|rowspan=\"2\"|2021\n|rowspan=\"2\"|Hannah Collins\n|-\n!scope=\"row\"|\"Pink Bubblegum\"\n|-\n!scope=\"row\"|\"Pink Rover\"\n|rowspan=\"5\"|2022\n|Alex Bemis and Hannah Collins\n|-\n!scope=\"row\"|\"Pink Panther\"\n|rowspan=\"3\"|Danin Jacquay\n|-\n!scope=\"row\"|\"Pink G-String\"\n|-\n!scope=\"row\"|\"Barbie & Ken\"\n|-\n!scope=\"row\"|\"Pink Hotel\"\n|rowspan=\"3\"|Angelica Valente and Pseudo\n|-\n!scope=\"row\"|\"18+\"\n|rowspan=\"3\"|2023\n|-\n!scope=\"row\"|\"Pink Push-Up Bra\"\n|-\n!scope=\"row\"|\"MILF\"\n|Taylor Fauntleroy\n|-\n!scope=\"row\"|\"Finger\"\n|rowspan=\"3\"|2024\n|rowspan=\"3\"|Angelica Valente and Pseudo\n|-\n!scope=\"row\"|\"Stuck\"\n|-\n!scope=\"row\"|\"Climax\"\n|}\nReferences\nExternal links"
    }
  ]
}