{
  "content": [
    {
      "type": "text",
      "text": "# School violence in the United Kingdom\n\nA government inquiry into school violence in 1989 found that 2 percent of teachers had reported facing physical aggression.  In 2007 a survey of 6,000 teachers by the teachers' trade union NASUWT found that over 16% claimed to have been physically assaulted by students in the previous two years. On the basis of police statistics found through a Freedom of Information request, in 2007 there were more than 7,000 cases of the police being called to deal with violence in schools in England.\nIn April 2009 another teachers' union, the Association of Teachers and Lecturers, released details of a survey of over 1,000 of its members which found that nearly one quarter of them had been on the receiving end of physical violence by a student.\nIn Wales, a 2009 survey found that two-fifths of teachers reported having been assaulted in the classroom. 49% had been threatened with assault.\nAccording to the latest survey of more than 1,500 teachers from 2014 on pupil behaviour by the Association of Teachers and Lecturers (ATL), [http://www.atl.org.uk/media-office/media-archive/Half-of-education-staff-have-faced-aggression-from-students-in-the-last-year.asp? more than half of teachers in state schools have faced aggression] from pupils in the last year, and more than a quarter have experienced it from parents or carers.\nPositive handling\nThe objective of prevention and intervention techniques is to prevent school violence from occurring. Support for staff is the key to handling student aggression in schools.\nTo support it, the staff requires training, which is also a legal obligation of teaching institutions.\nOne of the most efficient method of training on how to control a disruptive pupil whilst protecting them, and remaining compliant with legislation is Positive handling. It refers to a graduated approach that moves towards the control of extreme behavior by adopting the least intrusive intervention for the shortest period of time to achieve the aim.\nSee also\n*School violence in the United States\nReferences"
    }
  ]
}