{
  "content": [
    {
      "type": "text",
      "text": "# Schwarzwälder Hochwald__disambig_1\n\n]]\nThe Schwarzwälder Hochwald (; literally 'Black Forest High Forest'), not to be confused with the High Black Forest, is the high south-western part of the Hunsrück in the German states of Saarland and Rhineland-Palatinate. The mountains are up to 816.32&nbsp;m high.\nGeography\nLocation\nThe Schwarzwälder Hochwald lies within the Saar-Hunsrück Nature Park, running roughly from Mettlach in the Saarland to the Erbeskopf  in Rhineland-Palatinate. It lies northwest of Losheim, Weiskirchen, Wadern and Nonnweiler in the Saarland and between Hermeskeil and Birkenfeld and between Thalfang and Idar-Oberstein in Rhineland-Palatinate.\nNorth of the Schwarzwälder Hochwald lies the Osburger Hochwald; both forested mountain ranges are known simply as the Hochwald (\"High Forest\"). The southeastern part of the Schwarzwälder Hochwald is called the Dollberge.\nTo the northeast of the Schwarzwälder Hochwald is the Idar Forest.\nMountains\nThe mountains and hills of the Schwarzwälder Hochwald include the following – sorted by their elevation in metres (m) above sea level (Normalnull unless otherwise stated ):\n* Erbeskopf (816.32&nbsp;m), near Thalfang, highest mountain in the Hunsrück and in Rhineland-Palatinate\n* Ruppelstein (762.7&nbsp;m), near Börfink, county of Birkenfeld, Rhineland-Palatinate\n* Sandkopf (757.4&nbsp;m), near Neuhütten-Muhl, highest mountain in the county of Trier-Saarburg, Rhineland-Palatinate\n* Friedrichskopf (707.4&nbsp;m), near Brücken, Birkenfeld, Rhineland-Palatinate\n* Dollberg (695.4&nbsp;m), between Neuhütten (Rhineland-Palatinate) and Eisen (Saarland), highest mountain of the Saarland; on the border with Rhineland-Palatinate\n* Teufelskopf (695.0&nbsp;m), near Waldweiler, in the Irrwald, Rhineland-Palatinate\n* Schimmelkopf (Weiskircher Höhe; 694.8&nbsp;m), between Mandern (Rhineland-Palatinate) and Weiskirchen (Saarland), second highest mountain of the Saarland; on the border with Rhineland-Palatinate\n* Mückenbornberg (), near Waldweiler, in the Irrwald, Rhineland-Palatinate\nReferences\nExternal links\n* [http://swb.bsz-bw.de/DB=2.306/REL?PPN=241257360 Literature about the Schwarzwälder Hochwald] in the Saarland Bibliography"
    }
  ]
}