{
  "content": [
    {
      "type": "text",
      "text": "# Schwartz–Bruhat function\n\nIn mathematics, a Schwartz–Bruhat function, named after Laurent Schwartz and François Bruhat, is a complex valued function on a locally compact abelian group, such as the adeles, that generalizes a Schwartz function on a real vector space. A tempered distribution is defined as a continuous linear functional on the space of Schwartz–Bruhat functions.\nDefinitions\n*On a real vector space \\mathbb{R}^n, the Schwartz–Bruhat functions are just the usual Schwartz functions (all derivatives rapidly decreasing) and form the space \\mathcal{S}(\\mathbb{R}^n).\n*On a torus, the Schwartz–Bruhat functions are the smooth functions.\n*On a sum of copies of the integers, the Schwartz–Bruhat functions are the rapidly decreasing functions.\n*On an elementary group (i.e., an abelian locally compact group that is a product of copies of the reals, the integers, the circle group, and finite groups), the Schwartz–Bruhat functions are the smooth functions all of whose derivatives are rapidly decreasing.\n*On a general locally compact abelian group G, let A be a compactly generated subgroup, and B a compact subgroup of A such that A/B is elementary. Then the pullback of a Schwartz–Bruhat function on A/B is a Schwartz–Bruhat function on G, and all Schwartz–Bruhat functions on G are obtained like this for suitable A and B. (The space of Schwartz–Bruhat functions on G is endowed with the inductive limit topology.)\n*On a non-archimedean local field K, a Schwartz–Bruhat function is a locally constant function of compact support.\n*In particular, on the ring of adeles \\mathbb{A}_K over a global field K, the Schwartz–Bruhat functions f are finite linear combinations of the products \\prod_v f_v over each place v of K, where each f_v is a Schwartz–Bruhat function on a local field K_v and f_v = \\mathbf{1}_{\\mathcal{O}_v} is the characteristic function on the ring of integers \\mathcal{O}_v for all but finitely many v. (For the archimedean places of K, the f_v are just the usual Schwartz functions on \\mathbb{R}^n, while for the non-archimedean places the f_v are the Schwartz–Bruhat functions of non-archimedean local fields.)\n* The space of Schwartz–Bruhat functions on the adeles \\mathbb{A}_K is defined to be the restricted tensor product \\bigotimes_v'\\mathcal{S}(K_v) := \\varinjlim_{E}\\left(\\bigotimes_{v \\in E}\\mathcal{S}(K_v) \\right)  of Schwartz–Bruhat spaces \\mathcal{S}(K_v) of local fields, where E is a finite set of places of K. The elements of this space are of the form f = \\otimes_vf_v, where f_v \\in \\mathcal{S}(K_v) for all v and f_v|_{\\mathcal{O}_v}=1 for all but finitely many v. For each x = (x_v)_v \\in \\mathbb{A}_K we can write f(x) = \\prod_vf_v(x_v), which is finite and thus is well defined.\nExamples\n*Every Schwartz–Bruhat function f \\in \\mathcal{S}(\\mathbb{Q}_p) can be written as  f = \\sum_{i = 1}^n c_i \\mathbf{1}_{a_i + p^{k_i}\\mathbb{Z}_p} , where each  a_i \\in \\mathbb{Q}_p , k_i \\in \\mathbb{Z} , and  c_i \\in \\mathbb{C} . This can be seen by observing that  \\mathbb{Q}_p  being a local field implies that  f  by definition has compact support, i.e.,  \\operatorname{supp}(f)  has a finite subcover. Since every open set in  \\mathbb{Q}_p  can be expressed as a disjoint union of open balls of the form  a + p^k \\mathbb{Z}_p  (for some   a \\in \\mathbb{Q}_p  and  k \\in \\mathbb{Z} ) we have\n:  \\operatorname{supp}(f) = \\coprod_{i = 1}^n (a_i + p^{k_i}\\mathbb{Z}_p) . The function  f  must also be locally constant, so  f |_{a_i + p^{k_i}\\mathbb{Z}_p} = c_i \\mathbf{1}_{a_i + p^{k_i}\\mathbb{Z}_p}  for some  c_i \\in \\mathbb{C} . (As for  f  evaluated at zero,  f(0)\\mathbf{1}_{\\mathbb{Z}_p}  is always included as a term.)\n*On the rational adeles  \\mathbb{A}_{\\mathbb{Q}}  all functions in the Schwartz–Bruhat space \\mathcal{S}(\\mathbb{A}_{\\mathbb{Q}})  are finite linear combinations of  \\prod_{p \\le \\infty} f_p = f_\\infty \\times \\prod_{p  over all rational primes  p , where  f_\\infty \\in \\mathcal{S}(\\mathbb{R}) ,  f_p \\in \\mathcal{S}(\\mathbb{Q}_p) , and  f_p = \\mathbf{1}_{\\mathbb{Z}_p}  for all but finitely many  p . The sets  \\mathbb{Q}_p  and  \\mathbb{Z}_p  are the field of p-adic numbers and ring of p-adic integers respectively.\nProperties\nThe Fourier transform of a Schwartz–Bruhat function on a locally compact abelian group is a Schwartz–Bruhat function on the Pontryagin dual group. Consequently, the Fourier transform takes tempered distributions on such a group to tempered distributions on the dual group. Given the (additive) Haar measure on \\mathbb{A}_K the Schwartz–Bruhat space \\mathcal{S}(\\mathbb{A}_K) is dense in the space L^2(\\mathbb{A}_K, dx).\nApplications\nIn algebraic number theory, the Schwartz–Bruhat functions on the adeles can be used to give an adelic version of the Poisson summation formula from analysis, i.e., for every  f \\in \\mathcal{S}(\\mathbb{A}_K)  one has  \\sum_{x \\in K} f(ax) = \\frac{1}{|a|}\\sum_{x \\in K} \\hat{f}(a^{-1}x) , where  a \\in \\mathbb{A}_K^{\\times} . John Tate developed this formula in his doctoral thesis to prove a more general version of the functional equation for the Riemann zeta function. This involves giving the zeta function of a number field an integral representation in which the integral of a Schwartz–Bruhat function, chosen as a test function, is twisted by a certain character and is integrated over \\mathbb{A}_K^{\\times} with respect to the multiplicative Haar measure of this group. This allows one to apply analytic methods to study zeta functions through these zeta integrals.\nReferences\n*\n*\n*\n*\n*\n*"
    }
  ]
}