{
  "content": [
    {
      "type": "text",
      "text": "# Schwarzenburg Castle\n\n|map_size =\n|map_alt =\n|map_caption =\n|type =\n|battles =\n|built = 1573-76\n|builder =\n|materials =\n|height =\n|ownership = Schloss Schwarzenburg foundation\n|open_to_public = yes\n}}\nSchwarzenburg Castle () is a castle in the municipality of Schwarzenburg of the Canton of Bern in Switzerland.  It is a Swiss heritage site of national significance.\nHistory\nThe castle was built in 1573–76 to replace the increasingly expensive to maintain Grasburg Castle.  From the beginning it was built as an administrative center for the Grasburg district and as a home for the governor.  Grasburg was a shared condominium between the Cantons of Bern and Fribourg so the governor was appointed by each Canton in turn.  Following the 1798 French invasion, Schwarzenburg Castle and the district became part of Bern permanently.  The castle remained the administrative center of the Schwarzenburg District until the District was dissolved in 2010 as part of a major reorganization in the Canton.  The castle was no longer needed and was one of twelve that the Canton offered for sale.  It was the first of that group that sold, when the Canton accepted the offer of the Schwarzenburg Castle foundation (Stiftung Schloss Schwarzenburg) before the reorganization was complete.  Today the castle is used for art exhibits and can be rented for celebrations and meetings.\nConstruction\nThe castle was built as an administrative center and manor house rather than as a pure defensive structure.  The main building is a three-story rectangular building with a half-hipped roof.  An octagonal staircase tower topped with a pointed roof links the levels together.  An enclosed courtyard links the main building to a gatehouse and the granary.  However, the walls, towers and gatehouse were built to make it into an impressive government building, not for defensive purposes.  Many of the rooms still feature the original coffered ceilings from 1575.  The main entrance moved to the north side in the 18th century.  The new entrance was decorated in the Louis XVI style and a fountain topped with an obelisk.  The attached granary was rebuilt in the mid-18th century and again in 1983.\nSee also\n* List of castles in Switzerland\nReferences"
    }
  ]
}