{
  "content": [
    {
      "type": "text",
      "text": "# Scientific Working Group – Bloodstain Pattern Analysis\n\nThe Scientific Working Group on Bloodstain Pattern Analysis (SWGSTAIN) was created in March 2002 at a meeting held by the FBI Laboratory at the FBI Academy in Quantico, Virginia. It was decided that there was enough interest in bloodstain pattern analysis (BPA) to warrant the creation of the Scientific Working Group (SWG).  According to the guidelines for organizing a SWG, the Scientific Working Group on Bloodstain Pattern Analysis (SWGSTAIN) generated and ratified a set of bylaws in accordance to the Scientific Working Groups published in Forensic Science Communications (July 2002).\nSWGSTAIN has nationally and internationally recognized bloodstain pattern analysts, several of whom are members of the International Association of Bloodstain Pattern Analysts (IABPA).  The experts come from various areas including law enforcement, federal, state and local laboratories, the private sector, and academia. They also come from various countries including United States, Canada, England, and the Netherlands.\nIn 2004, the various sub-committees were discussing and drafting proposals in the following areas:\n:* Terminology\n:* Quality Assurance\n:* Legal\n:* Ethics\n:* Education and Training\nSWGSTAIN meets twice a year at the FBI Academy in Quantico.  They have an American Society of Crime Laboratory Directors (ASCLD) representative.\nMission statement\n:To Promote and enhance the development of quality forensic bloodstain pattern (BSP) practices through the collaborative efforts of government forensic laboratories, law enforcement, private industry, and academia.\nObjectives\n# To discuss, share and compare stain pattern analysis methods, protocols, and research for the enhancement of forensic bloodstain pattern analysis (BPA) techniques, and\n# To design and encourage the implementation by practitioners of a quality assurance program in bloodstain pattern analysis and to advise the forensic bloodstain pattern analysis community of emerging quality assurance issues, and\n# To discuss and share strategies for presenting bloodstain pattern information to meet Frye, Daubert, or other jurisdictional admissibility challenges, and\n# To address the development and/or validation of forensic bloodstain pattern analysis methods, and\n# To design and encourage the adoption of guidelines to ensure the quality of specialized training in the field of bloodstain pattern analysis.\nExecutive board\nThe SWGSTAIN Executive Board consists of eight members:\n:* Chair\n:* Vice-Chair (must be a non-FBI SWGSTAIN member, appointed by the Chair)\n:* Executive Secretary (appointed by the Chair, no voting privileges)\n:* Five Regular Members\nReferences\nSources\n:*Federal Bureau of Investigation (FBI). Forensic Science Communications (July 2002). Bylaws of the Scientific Working Group on Bloodstain Pattern Analysis (SWGSTAIN). Retrieved 11 October 2005 from: http://www.fbi.gov/hq/lab/fsc/backissu/july2002/swgstain.htm\nExternal links\n:*[https://www.fbi.gov/hq/lab/labhome.htm/ FBI Laboratory]\n:*[https://www.fbi.gov/hq/lab/fsc/backissu/july2002/swgstain.htm/ SWGSTAIN Bylaws]\n:*[http://www.iabpa.org/ IABPA]"
    }
  ]
}