{
  "content": [
    {
      "type": "text",
      "text": "# Scooby-Doo! and the Goblin King__disambig_1\n\n| writer         = Joe Sichta\n| director       = Joe Sichta\n| starring       =\n| country        = United States\n| language       = English\n| producer       = Joe Sichta\n| editing        = Joe Gall\n| music          = Thomas Chase\n| runtime        = 74 minutes\n| studio         = Warner PremiereWarner Bros. Animation\n| distributor    = Warner Home Video\n| budget         =\n| released       =\n}}\nScooby-Doo! and the Goblin King is a 2008 American animated comedy horror musical film, and the twelfth in the series of Scooby-Doo direct-to-video films produced by Warner Bros. Animation (though it used a Hanna-Barbera logo at the end of the film). It was dedicated to Paulette Oates, who helped resurrect Warner Bros. Animation in the late 1980s. The DVD was released on September 23, 2008. This is the first Scooby cartoon produced entirely without either one of the original producers, William Hanna and Joseph Barbera.\nThis film calls back to the shared premise of The Boo Brothers, The Ghoul School, and The Reluctant Werewolf films from the late 1980s, where the fantastical elements of the story are genuine, and Scooby and Shaggy alone discover and befriend an entire society of supernatural beings.\nPlot\nMystery Inc. attends the annual Coolsville Halloween carnival, where they encounter a magician called \"The Amazing Krudsky\". After he refuses to let Scooby-Doo see his latest show for causing an accident, Scooby and Shaggy Rogers retaliate by publicly exposing Krudsky as a fraud, causing him to swear revenge while the gang are thrown out of the carnival. Nonetheless, they decide to go trick-or-treating.\nMeanwhile, Fairy Princess Willow enters Krudsky's tent and accidentally reveals the existence of a powerful artifact called the Goblin Scepter. When he decides to find it and use it to take over the world, Willow tries to stop him, but knocks herself out, allowing Krudsky to capture her and absorb her magic to become a real magician.\nWhile trick-or-treating, Shaggy and Scooby discover a \"genuine magic shoppe\". The proprietor, Mr. Gibbles, reveals to them that magic is real before Krudsky interrupts them while recapturing Willow. He then turns Gibbles into a rabbit and steals his magical equipment before leaving. Realizing Krudsky's plot, Gibbles urges Shaggy and Scooby to stop him. Gibbles grants the duo monstrous disguises, sends them on a train to the spirit world, and warns them to return before sunrise or they will be trapped there forever.\nUpon their arrival, Shaggy and Scooby struggle to find the Goblin Scepter's owner, the Goblin King. They eventually encounter Jack O'Lantern, who leads them to the Grand Witch. She loans them her flying broomstick \"Broomy\" to reach the Goblin King's castle, but are shot down by the monarch's bumbling henchmen, Glob and Glum. Crash-landing in a fairy village in the woods outside the castle, Shaggy and Scooby encounter fairies who help them reach the entrance. They use a potion the Grand Witch gave them to assume new disguises and infiltrate the castle, but they wear off, leading to them being captured and sent to the dungeon, though they are saved by Jack, the fairies, and Broomy.\nMeanwhile, the rest of Mystery Inc. discover Krudsky conversing with the Goblin King, who reluctantly agrees to exchange his scepter for Willow at midnight. As Krudsky engages in supernatural chaos, the rationally-minded Velma Dinkley struggles to comprehend the events while Fred Jones and Daphne Blake formulate a plan to stop the trade. They eventually locate Krudsky and the Goblin King, but only succeed in capturing the latter before Krudsky obtains the scepter and leads an army of goblins in taking over the world and turning people into monsters, including Velma, Fred, and Daphne. Soon enough, Shaggy, Scooby, Jack, and Broomy arrive, with Jack sacrificing himself to defeat Krudsky. Scooby grabs the scepter and breaks Krudsky's spells before returning it to the Goblin King. Afterward, the Goblin King grounds Willow for causing the mayhem; helps Gibbles resurrect Jack; takes Krudsky prisoner; returns his army, Willow, Jack, Broomy and Gibbles to the spirit world; and erases Fred, Daphne, and Velma's memories to keep his world safe, though he allows Shaggy and Scooby to keep theirs since they proved their courage.\nVoice cast\nThe cast for the movie is shown below:\n* Frank Welker as Scooby-Doo, Fred and Afterworld Express Conductor\n* Casey Kasem as Shaggy\n* Mindy Cohn as Velma\n* Grey DeLisle as Daphne, Cat Witch and Honeybee\n* Hayden Panettiere as Fairy Princess Willow\n* Wayne Knight as Amazing Krudsky\n* Wallace Shawn as Mr. Gibbles\n* Jay Leno as Jack O'Lantern\n* Tim Curry as Goblin King and Werewolf\n* James Belushi as Glob\n* Larry Joe Campbell as Glum\n* Lauren Bacall as Grand Witch\n* Thom Adcox as Sparkplug\n* Russi Taylor as Owl Witch and Tiddlywink\nOriginal Songs\n* \"Who's at the Door?\" - Sung by Wallace Shawn\n* \"Bump in the Night\" - Sung by the Halloween Monsters\n* \"Goblin Oogie Boogie\" - Sung by Jim Belushi\nSee also\n* List of films set around Halloween\nReferences\nExternal links\n* [https://web.archive.org/web/20080924021449/http://www.reuters.com/article/pressRelease/idUS235401+31-Jul-2008+BW20080731 Reuters]\n*"
    }
  ]
}