{
  "content": [
    {
      "type": "text",
      "text": "# Scoring A Century\n\nScoring A Century is an opera with music by English composer David Blake. The libretto was written by Opera Director Keith Warner. It is described as a 'low entertainment for highbrows, or vice versa'. It tells the history of Mr and Mrs Jedermann, who travel through the events, politics and social change of the twentieth century, never ageing. It is a modern Singspiel, a review of a century in nineteen panels.\nAlthough its premiere was not reviewed in the press, a 2019 revival received widespread attention where the piece was heavily criticised.\nPerformance history\nScoring a Century was originally conceived as part of the millennium celebrations. Scenes from the work were premiered by the University of York Music Department in November 1999 whilst the complete work was being lined up to debut at Portland Opera, Oregon. Just as plans were beginning to finalise, however, the US suffered the 9/11 terrorist attacks. “After 9/11, American opera houses immediately lost their budgets and Portland Opera decided to do Bohèmes and Magic Flutes instead,” Blake says. “It was a big disappointment.”\nOn March 4, 2010 the opera received its premiere at the Crescent Theatre, Birmingham, by students from the Birmingham Conservatoire vocal department, directed by Warner and conducted by Lionel Friend.\nThe opera was revived in 2019 by British Youth Opera at the Peacock Theatre in London, again with Warner directing and Friend conducting.\nReception\nDespite a strong cast that performed with 'more gusto than the piece deserves' the opera was widely panned, receiving just two stars in both the Times and the Guardian, and was described as 'unwieldy, overlong and stylistically diffuse'. Warner came in for particular criticism, for 'stilted dialogue [that] trips over some embarrassingly bad jokes' and a 'piece that he might have profitably revised even further'.\nReferences\nExternal links\n* [https://web.archive.org/web/20120924135849/http://www.birminghampost.net/life-leisure-birmingham-guide/birmingham-culture/music-in-birmingham/2010/03/12/review-scoring-a-century-at-crescent-theatre-birmingham-65233-26012725/ Review by Chris Morley in Birmingham Post]\n* [http://www.musicweb-international.com/SandH/2010/Jan-Jun10/Scoring_a_Century_0503.htm Review by Geoff Read] at [http://www.musicweb-international.com Musicweb-international.com]"
    }
  ]
}