{
  "content": [
    {
      "type": "text",
      "text": "# Scotland (Liverpool ward)\n\n| population               =\n| metropolitan_borough     = City of Liverpool\n| metropolitan_county      = Merseyside\n| region                   = North West England\n| constituency_westminster =\n| post_town                = LIVERPOOL\n| postcode_area            = L\n| postcode_district        =\n| dial_code                = 0151\n| os_grid_reference        = SJ349909\n| london_distance_mi       = 178\n| london_direction         = SSE\n| static_image_name        =\n| static_image_caption     =\n}}\nScotland was a former electoral ward in Liverpool, England. It existed in various forms during the 19th and early 20th centuries, before being reorganised and abolished with changes to local government boundaries.\nHistory\nScotland Ward was one of the original wards created under the Municipal Corporations Act 1835. It elected three councillors. It was part of Liverpool’s early division into wards; some records show it as Scotland Ward among the list of first wards from 1835 to 1895. Later on, as the city expanded, integers of wards and population shifted; after 1895, the “Scotland” name appears to split into North Scotland and South Scotland wards.\nOverview\nScotland Ward was located in the northern parts of Liverpool, around Scotland Road, a major thoroughfare in the city. It served a densely populated area with many terraced streets and courts. As originally formed, Scotland Ward returned three councillors to the Liverpool City Council. It was an important residential ward; Scotland Road is often mentioned in historical and social accounts of Liverpool as a large working-class area with high population density and strong local identity.\nElections\n1835\nThe Polling place was Mr. Horner's at the corner of Eccles-street and Vauxhall-road.\n1836\n34}}%}}\n28}}%||Reformer}}\n1837\n1838\n{| class=\"wikitable\"\n! rowspan=\"2\" |Time\n! colspan=\"2\" |Isaac Holmes\n! colspan=\"2\" |Samuel L\n|-\n!Votes\n!%\n!Votes\n!%\n|-\n|10:00\n|57\n|48%\n|63\n|53%\n|-\n|11:00\n|86\n|57%\n|64\n|43%\n|-\n|12:00\n|106\n|53%\n|93\n|47%\n|-\n|13:00\n|133\n|53%\n|116\n|47%\n|-\n|14:00\n|158\n|53%\n|141\n|47%\n|-\n|15:00\n|185\n|53%\n|166\n|47%\n|-\n|16:00\n|\n|\n|196\n|\n|-\n|}\n1839\n1840\n{| class=\"wikitable\"\n! rowspan=\"2\" |Time\n! colspan=\"2\" |William Thornhill\n! colspan=\"2\" |Thomas Murray Gladstone\n|-\n!Votes\n!%\n!Votes\n!%\n|-\n|10:00\n|33\n|45%\n|40\n|55%\n|-\n|11:00\n|79\n|48%\n|85\n|52%\n|-\n|12:00\n|104\n|48%\n|112\n|52%\n|-\n|13:00\n|121\n|48%\n|129\n|52%\n|-\n|14:00\n|166\n|52%\n|155\n|48%\n|-\n|15:00\n|182\n|49.7%\n|184\n|50.3%\n|-\n|16:00\n|215\n|51.1%\n|214\n|49.9%\n|-\n|}\n1841\n1842\n1843\nPolling Place : The House, No. 61, on the south side of Burlington Street, near Limekiln-lane occupied by Mrs. Bell.\n1844\n1845\n1846\n1847\n1848\nPolling Place : The House No. 64, on the north side of Burlington-street, near Limekiln-lane, occupied by Mr. Joseph Jones.\nJames Thomson advocated the rating of the Corporate and Dock estates.\n1849\nJohn Bingham was opposed to the Rivington Pike water scheme, but James Holme was in favour.\nThere were two cases of Personation. John Jones of Cazneau-street, who intended to vote for Mr. Bingham, discovered that he had been personated by someone who had voted for James Holme. David Starke of Waterloo-road discovered that someone else had voted for Mr. Bingham in his name.\nJohn Holmes of Dryden-street, gave in his voting paper for Mr. Bingham, but as he walked away before his name was recorded, his vote was lost.\n1850\n1851\n1852\n1853\n1854\n1855\n1856\n1857\n1858\nPolling place : The House, No. 237, on the north side of Burlington Street, occupied by Mr. Des?er.\nRichard Sheil was the first Catholic elected to Liverpool Town Council.\n1859\nCaused by the election of Councillor John Woodruff (Liberal, Scotland, elected 1 November 1859) as an alderman by the Council on 9 November 1859 and prounounced  on18 November 1859.\n1860\n1861\n1862\n1863\n1864\n1865\n1866\n1867\n1868\n1869\n1870\n1871\n1872\n1873\n1874\n1875\n1876\n1877\n1878\n1879\n1880\n1881\n1882\n1883\n1884\n1885\n1886\n1887\n1888\n1889\n1890\n1891\n1892\n1893\n1894\n1895\nOld Scotland ward was abolished and its boundaries were rearranged, making the old Scotland ward to be redistributed into North Scotland and South Scotland wards.\nReferences"
    }
  ]
}