{
  "content": [
    {
      "type": "text",
      "text": "# Scotland in the Wars of the Three Kingdoms__disambig_1\n\n}}\nRoyalists  Irish Confederation\n| combatant2        =  Covenanters\n* Engagers\n* Kirk Party\n| combatant3        =   English Parliament\n| commander1        =  Marquis of Montrose Alasdair Mac Colla Maghnus Ó Catháin Charles II\n| commander2        =  Marquis of Argyll (Kirk Party)| Alexander Leslie (Kirk Party)| David Leslie| Duke of Hamilton (Engagers)}}\n| commander3        =  Oliver Cromwell| George Monck}}\n| strength1         = Fluctuating, 2,000–4,000 troops at any one time\n| strength2         = Over 30,000 troops, but many based in England and Ireland\n| strength3         =\n| casualties4       = Total of 28,000 battlefield deaths on both sides, more soldiers die from disease, c. 45,000 civilian deaths, both from disease and deliberate targeting\n| campaignbox       =  |\n}}\nBetween 1639 and 1652, Scotland was involved in the Wars of the Three Kingdoms, a series of conflicts which included the Bishops' Wars, the Irish Rebellion of 1641, the English Civil War, the Irish Confederate Wars and finally the conquest of Ireland and the subjugation of Scotland by the English New Model Army.\nWithin Scotland, from 1644 to 1645 a Scottish civil war was fought between Scottish Royalists—supporters of Charles I under James Graham, 1st Marquess of Montrose—and the Covenanters, who had controlled Scotland since 1639 and who were allied with English Parliamentarians.  The Scottish Royalists, aided by Irish troops, had a rapid series of victories in 1644–45, but were eventually defeated by the Covenanters.\nThe Covenanters then found themselves at odds with the English Parliament, so they crowned Charles II at Scone and thus stated their intention to place him on the thrones of England and Ireland as well. In 1650, Scotland was invaded and occupied by the New Model Army under Oliver Cromwell.\nOrigins of the war – wars in three kingdoms\nThe war originated in Scottish opposition to religious reforms imposed on the Church of Scotland (the Kirk) by Charles I. This culminated in February 1638 when representatives from all sections of Scottish society agreed a National Covenant, pledging resistance to liturgical 'innovations.' An important factor in the political contest with Charles was the Covenanter belief they were preserving an established and divinely ordained form of religion which he was seeking to alter. The Covenant also expressed wider dissatisfaction with the sidelining of Scotland since the Stuart kings became monarchs of England in 1603, while the Kirk was viewed as a symbol of Scottish independence.\nin Greyfriars Churchyard, 1638 by William Hole]]\nVictory in the 1639 and 1640 Bishops Wars left the Covenanters firmly in control of Scotland but also destabilised Ireland and England. Widespread opposition to Crown policies meant the Parliament of England refused to fund war against the Scots, leading Charles to consider raising an army of Irish Catholics in return for abolishing the penal laws against them. This prospect alarmed his enemies in both England and Scotland; when the Covenanters threatened to provide military support for their co-religionists in Ulster, it sparked the Irish Rebellion of 1641, which quickly degenerated into massacres of Protestant settlers in Ireland.\nThe Covenanters responded in April 1642 by sending an army to Ulster led by Robert Monro, which engaged in equally bloody reprisals against Catholics. Although both Charles and Parliament supported raising troops to suppress the rebellion in Ireland, neither side trusted the other with their control. A struggle for control of military resources ultimately led to the outbreak of the First English Civil War in August 1642.\nScottish Royalists and Covenanters\n; a Covenanter general in 1639 and 1640 who became leader of the Royalist campaign 1644–1645]]\nThe Scottish Reformation established a kirk that was Presbyterian in structure and  Calvinist in doctrine. By 1640, less than 2% of Scots were Catholics, concentrated in places like South Uist, controlled by Clanranald, but despite its minority status, fear of popery remained widespread. Since Calvinists believed a 'well-ordered' monarchy was part of God's plan, the Covenanters committed to \"defend the king's person and authority with our goods, bodies, and lives\" and the idea of government without a king was inconceivable.\nThis meant that unlike England, throughout the war all Scots agreed the institution of monarchy itself was divinely ordered and hence why the Covenanters supported the restoration of Charles I in the Second English Civil War, then his son in the Third. Where Covenanters and Scottish Royalists disagreed was the nature and extent of Royal authority versus that of the people, including through the popularly governed Presbyterian church; the relative narrowness of this distinction meant Montrose was not unusual in fighting on both sides.\nRoyalism was most prominent in the Scottish Highlands and Aberdeenshire, due to a mix of religious, cultural and political reasons; Montrose switched sides because he distrusted Argyll's ambition, fearing he would eventually dominate Scotland and possibly depose the King. Furthermore, the Gàidhealtachd was a distinct cultural, political and economic region of Scotland. It was Gaelic in language and customs and at this time was largely outside of the control of the Scottish government. Some Highland clans preferred the more distant authority of King Charles to the powerful and well-organised Lowlands based government of the Covenanters.\nClan politics and feuds also played a role; when the Presbyterian Campbell, led by their chief, Archibald Campbell, 1st Marquess of Argyll, sided with the Covenanters, their rivals automatically took the opposing side. It should be said some of these factors overlap that spanned the Irish Sea: for instance, the MacDonalds were Catholics, were sworn enemies of the Campbells, and had a strong Gaelic identity. Historian David Stevenson writes: \"It is a moot point whether one should call the MacDonnells of Antrim Scots or Irish... To the MacDonnells themselves the question was largely irrelevant, they had more in common with native Irish and Scots Highlanders, with whom they shared a common Gaelic language and culture than with those who ruled them\".\nThe Irish intervention\nMontrose had already tried and failed to lead a Royalist uprising by 1644 when he was presented with a ready-made Royalist army. The Irish Confederates, who were loosely aligned with the Royalists, agreed in that year to send an expedition to Scotland. From their point of view, this would tie up Scottish Covenanter troops who would otherwise be used in Ireland or England. The Irish sent 1500 men to Scotland under the command of Alasdair MacColla MacDonald, a MacDonald clansman from the Western Isles of Scotland. They included Manus O'Cahan (an Irish cousin to MacColla) and his 500-man regiment. Shortly after landing, the Irish linked up with Montrose at Blair Atholl and proceeded to raise forces from the MacDonalds and other anti-Campbell Highland clans.\nThe new Royalist army led by Montrose and MacColla was in some respects very formidable. Its Irish and Highland troops were extremely mobile, marching quickly over long distances – even over the rugged Highland terrain – and were capable of enduring very harsh conditions and poor rations. They did not fight in the massed pike and musket formations that dominated continental Europe at the time, but fired their muskets in loose order before closing with swords and half-pikes. This tactic was effective in such a wilderness and swept away the poorly trained Covenanter militias that were sent against them. These locally raised levies frequently ran away when faced with a terrifying Highland charge, and were slaughtered as they ran.\nHowever, the Royalist army also had major problems: the clans from the west of Scotland could not be persuaded to fight for long away from their homes – seeing their principal enemy as the Campbells rather than the Covenanters, which resulted in fluctuating membership – and the Royalists also lacked cavalry, leaving them vulnerable in open country. Montrose overcame some of these disadvantages through his leadership and by taking advantage of the forbidding Highland mountains. Keeping his enemies guessing where he would strike next, Montrose would sally out to attack lowland garrisons and withdraw to the Highlands when threatened by the more numerous enemy. In the safety of the mountains, he could fight on terrain familiar to his army, or lead the Covenanters on wild goose chases.\nThe year of Royalist triumph and collapse\nFrom 1644 to 1645 Montrose led the Royalists to six famous victories, defeating covenanting armies larger than his own of roughly 2000 men (except at Kilsyth, where he led approximately 5,000).\nIn the Autumn of 1644, the Royalists marched across the Highlands to Perth, where they smashed a Covenanter force at the Battle of Tippermuir on 1 September. Shortly afterwards, another Covenanter militia met a similar fate outside Aberdeen on 13 September. Unwisely, Montrose let his men pillage Perth and Aberdeen after taking them, leading to hostility to his forces in an area where Royalist sympathies had been strong.\nFollowing these victories, MacColla insisted on pursuing the MacDonald's war against the Campbells in Argyll in western Scotland. In December 1644, the Royalists rampaged through the Campbells' country. During the clan warfare Inveraray was torched and all armed men were put to the sword; approximately 900 Campbells were killed.\nIn response to the attack on his clansmen, Archibald Campbell, 1st Marquess of Argyll assembled the Campbell clansmen to repel the invaders. Montrose, finding himself trapped in the Great Glen between Argyll and Covenanters advancing from Inverness, decided on a flanking march through the wintry mountains of Lochaber and surprised Argyll at the Battle of Inverlochy (2 February 1645). The Covenanters and Campbells were crushed, with losses of 1,500.\nMontrose's famous march was acclaimed as \"one of the great exploits in the history of British arms\" by John Buchan and C. V. Wedgwood. The victory at Inverlochy gave the Royalists control over the western Highlands and attracted other clans and noblemen to their cause. The most important of these were the Gordons, who provided the Royalists with cavalry for the first time.\nInverlochy was an important strategic victory for the Royalists, because the Scottish Covenanter army in England was ordered to send a proportion of their force north to help bolster the Covenanter forces in Scotland. This significantly weakened the Scottish army in England and it was only the lack of Royalist infantry and artillery in the north of England that prevented Prince Rupert from attacking them. In April 1645, to hinder the northwards movement of English Royalist field artillery, Oliver Cromwell led a cavalry raid into the English Midlands. The raid was the first active operation carried out by the newly formed New Model Army.\n, Lord General of the Covenanter Army]]\nIn April Montrose was surprised by General William Baillie after a raid on Dundee, but eluded capture by having his troops double back on the coast road and fleeing inland in a corkscrew retreat. Another Covenanter army under John Urry was hastily assembled and sent against the Royalists. At Auldearn, near Nairn, Montrose placed Macdonald and most of the infantry in view of the enemy and concealed the cavalry and remaining infantry. Despite Macdonald attacking prematurely, the ruse worked, and Urry was defeated on 9 May.\nAnother cat-and-mouse game between Bailie and Montrose led to the Battle of Alford on 2 July. Montrose confronted the Covenanters after the latter had forded the Don, forcing them to fight with the river at their back and on uneven ground. The Royalists triumphed and advanced into the lowlands. Bailie went in pursuit and Montrose waited for him at Kilsyth. During the ensuing battle the Royalists were inadvertently aided by Argyll and other members of the \"Committee of Estates,\" who ordered Bailie to make a flank march across the front of the Royalist army, which pounced on them and triumphed.\nAfter Kilsyth (15 August), Montrose seemed to have won control of all Scotland: In late 1645, such prominent towns as Dundee and Glasgow fell to his forces. The Covenanting government had temporarily collapsed, paying for its over-confidence in defeating Royalist resistance. As the royally commissioned lieutenant-governor and captain-general of Scotland, Montrose used his powers to summon parliament to meet in Glasgow, but the limitations of his triumph soon became clear. King Charles was in no position to join the Royalists in Scotland, and though Montrose wanted to further Royalist objectives by raising troops in the southeast of Scotland and marching on England, MacColla showed that his priorities lay with the war of the MacDonalds against the Campbells and occupied Argyll. The Gordons also returned home, to defend their own lands in the northeast.\nDuring his campaign, Montrose had been unable to attract many lowland royalists to his cause. Even after Kilsyth few joined him, having been alienated by his use of Irish Catholic troops, who were \"regarded as barbarians as well as enemies of true religion.\" Additionally, his covenanting past \"left lingering mistrust among royalists.\"\nMontrose, his forces having split up, was surprised and defeated by the Covenanters, led by David Leslie, at the Battle of Philiphaugh. Approximately 100 Irish prisoners, having surrendered upon promise of quarter, were executed, and 300 of the Royalist army's camp followers – mostly women and children – were killed in cold blood. MacColla retreated to Kintyre, where he held out until the following year. In September 1646 Montrose fled to Norway. The Royalist victories in Scotland had evaporated almost overnight owing to the disunited nature of their forces.\nThe end of the civil war in Scotland\nThe First English Civil War had ended in May 1646, when Charles I surrendered to the Scottish Covenanter army in England. After failing to persuade the King to take the Covenant, the Scots finally handed him over to the commissioners of the English Parliament (the \"Long Parliament\") in early 1647. At the same time they received part payment for the service of their army in England, which then returned north. In 1646, Montrose left for Norway, while MacColla returned to Ireland with his remaining Irish and Highland troops to re-join the Confederates. Those who had fought for Montrose, particularly the Irish, were massacred by the Covenanters whenever they were captured, in reprisal for the atrocities the Royalists had committed in Argyll.\nScotland and the Second Civil War\n. When the Covenanters' alliance with the English Parliament broke down, Cromwell invaded Scotland and conquered the country]]\nIronically, no sooner had the Covenanters defeated the Royalists at home than they were negotiating with Charles I against the English Parliament. The Covenanters could not get their erstwhile allies to agree on a political and religious settlement to the wars, failing to get Presbyterianism established as the official religion in the Three Kingdoms and fearing that the Parliamentarians would threaten Scottish independence. Many Covenanters feared that under Parliament, \"our poor country should be made a province of England.\" A faction of the Covenanters known as the Engagers, led by the Duke of Hamilton, therefore sent an army to England to try to restore Charles I in 1648. However, it was routed by Oliver Cromwell's New Model Army at the Battle of Preston and annihilated at the Battle of Winwick. This intervention on behalf of the King caused a brief civil war within the Covenanting movement. The most hardline Presbyterians under the Earl of Argyll rebelled against the main Scottish army under David Leslie. The two factions came to blows at the Battle of Stirling in September 1648, before a peace was hastily negotiated.\nCharles was executed by the Rump Parliament in 1649, and Hamilton, who had been captured after Preston, was executed soon after. This left the extreme Covenanters, still led by Argyll, as the main force in the Kingdom.\nMontrose's defeat and death\nIn June 1649, Montrose was restored by the exiled Charles II to the now nominal lieutenancy of Scotland. Charles also opened negotiations with the Covenanters, now dominated by Argyll's radical Presbyterian Kirk Party. Because Montrose had very little support in the lowlands, Charles was willing to disavow his most consistent supporter to become a king on terms dictated by the Covenanters. In March 1650 Montrose landed in Orkney to take the command of a small force, composed mainly of continental mercenaries, which he had sent on before him. Crossing to the mainland, Montrose tried in vain to raise the clans, and on 27 April he was surprised and routed at the Battle of Carbisdale in Ross-shire. After wandering for some time he was surrendered by Neil Macleod of Assynt, to whose protection, in ignorance of Macleod's political enmity, he had entrusted himself. He was brought a prisoner to Edinburgh, and on 20 May sentenced to death by the Parliament. He was hanged on the 21st, with Wishart's laudatory biography of him put round his neck. To the last, he protested that he was a real Covenanter and a loyal subject.\nAnglo-Scottish war, 1650–1652\nDespite their conflict with the Scottish Royalists, the Covenanters then committed themselves to the cause of Charles II, signing the Treaty of Breda (1650) with him in the hope of securing an independent Presbyterian Scotland free of Parliamentarian interference. Charles landed in Scotland at Garmouth in Moray on 23 June 1650 and signed the 1638 Covenant and the 1643 Solemn League immediately after coming ashore.\nThe threat posed by King Charles II with his new Covenanter allies was considered to be the greatest facing the new English Republic, and Oliver Cromwell left some of his subordinates in Ireland to continue their conquest of the island and returned to England in May. He arrived in Scotland on 22 July 1650, advancing along the east coast towards Edinburgh. By the end of August, his army was reduced by disease and running out of supplies, so he was forced to order a retreat towards his base at the port of Dunbar. A Scottish Covenanter army under the command of David Leslie had been shadowing his progress. Seeing some of Cromwell's sick troops being taken on board the waiting ships, Leslie made ready to attack what he believed was a weakened remnant (though some historians report that he was ordered to fight against his better judgment by the Covenanter General Assembly). Cromwell seized the opportunity, and the New Model Army inflicted a crushing defeat on the Scots at the subsequent Battle of Dunbar on 3 September. Leslie's army, which had strong ideological ties to the radical Kirk Party, was destroyed, losing over 14,000 men killed, wounded and taken prisoner. Cromwell's army then took Edinburgh and by the end of the year his army had occupied much of southern Scotland.\n'', by Andrew Carrick Gow. The Battle of Dunbar was a crushing defeat for the Covenanters]]\nThis military disaster discredited the radical Covenanters known as the Kirk Party and caused the Covenanters and Scottish Royalists to bury their differences (at least temporarily) to try to repel Cromwell's invasion of Scotland. The Scottish Parliament passed the Act of Levy in December 1650, requiring every burgh and shire to raise a quota of soldiers. A new round of conscription was undertaken, both in the Highlands and the Lowlands, to form a truly national army named the Army of the Kingdom, that was put under the command of Charles II himself. Although this was the largest force put into the field by the Scots during the Wars, it was badly trained and its morale was low as many of its constituent Royalist and Covenanter parts had until recently been fighting each other.\nIn July 1651, under the command of General John Lambert, part of Cromwell's force crossed the Firth of Forth into Fife and defeated the Scots at the Battle of Inverkeithing. The New Model Army advanced towards the royal base at Perth. In danger of being outflanked, Charles ordered his army south into England in a desperate last-ditch attempt to evade Cromwell and spark a Royalist uprising there. Cromwell followed Charles into England leaving George Monck to finish the campaign in Scotland. Meanwhile, Monck took Stirling on 14 August and Dundee on 1 September, reportedly killing up to 2,000 of its 12,000 population and destroying every ship in the city's harbour, 60 in total.\nThe Scottish Army of the Kingdom marched towards the west of England because it was in that area that English Royalist sympathies were strongest. However, although some English Royalists joined the army, they came in far fewer numbers than Charles and his Scottish supporters had hoped. Cromwell finally engaged the new king at Worcester on 3 September 1651, and beat him – in the process all but wiping out his army, killing 3,000 and taking 10,000 prisoners. Many of the Scottish prisoners taken by Cromwell were sold into indentured labour in the West Indies, Virginia and Berwick, Maine. This defeat marked the real end of the Scottish war effort. Charles escaped to the European continent and with his flight, the Covenanters' hopes for resisting Cromwell's invasion were dashed.\nFrom occupation to Restoration\nBetween 1651 and 1654, a Royalist rising took place in Scotland. Dunnottar Castle was the last stronghold to fall to Parliamentarian troops in May 1652. Under the terms of the Tender of Union, the Scots were given 30 seats in a united Parliament in London, with General Monck appointed as the military governor of Scotland. His troops continued to garrison Scotland for the rest of the Interregnum. Sporadic Royalist rebellions continued throughout the Commonwealth period in Scotland, particularly in the western Highlands, where Alasdair MacColla had raised his forces in the 1640s. The northwest Highlands was the scene of another pro-Royalist uprising in 1653–55, which was only put down with the deployment of 6,000 New Model Army troops there. Monck garrisoned forts all over the Highlands – for example at Inverness, and finally put an end to Royalist resistance when he began deporting prisoners to the West Indies as indentured labourers. However, lawlessness remained a problem, with bandits known as mosstroopers, very often former Royalist or Covenanter soldiers, attacking both Parliamentarian troops and Scottish civilians.\nAfter the death of Oliver Cromwell in 1658, the factions and divisions which had struggled for supremacy during the early years of the interregnum reemerged. Monck, who had served Cromwell and the English Parliament throughout the civil wars, judged that his best interests and those of his country lay in the Restoration of Charles II. In 1660, he marched his troops south from Scotland to ensure the monarchy's reinstatement. Scotland's Parliament and legislative autonomy were restored under The Restoration though many issues that had led to the wars; religion, Scotland's form of government and the status of the Highlands, remained unresolved. After the Glorious Revolution of 1688, many more Scots would die over the same disputes in Jacobite rebellions.\nThe cost\nIt is estimated that roughly 28,000 men were killed in combat in Scotland itself during the Wars of the Three Kingdoms. More soldiers usually died of disease than in action at this time (the ratio was often 3–1), so it is reasonable to speculate that the true military death toll is higher than this figure. In addition, it is estimated that around 15,000 civilians died as a direct result of the war – either through massacres or by disease. More indirectly, another 30,000 people died of the plague in Scotland between 1645 and 1649, a disease that was partly spread by the movement of armies throughout the country. If we also take into account the thousands of Scottish troops who died in the civil wars in England and Ireland (another 20,000 soldiers at least), the Wars of the Three Kingdoms certainly represent one of the bloodiest episodes in Scottish history.\nTimeline\nScottish factions\nLabels applied to the various Scottish factions differ among sources. This timeline labels factions as follows. Bold cell entries indicate the faction in control of the Scottish government during most of that period.\n{| class=\"wikitable\" style=\"text-align: center;\"\n|-\n! rowspan=\"3\" | Period\n! rowspan=\"3\" | Years\n! rowspan=\"3\" |\n! colspan=\"3\" |\n|-\n! rowspan=\"2\" |\n! colspan=\"2\" |\n|-\n!\n!\n|-\n| Union of the Crowns\n| 1603–1639\n| style=\"border-style: solid solid none solid\" | pro-King\n| colspan=\"3\" style=\"border-style: solid solid dotted solid\" | anti-King\n|-\n| Bishops' Wars\n| 1639–1640\n| rowspan=\"7\" style=\"border-style: dotted solid\" | pro-King\n| colspan=\"3\" style=\"border-style: none solid\" | anti-King\n|-\n| 1st English Civil War\n| 1642–1646\n| rowspan=\"2\" style=\"border-style: solid solid none solid\" | pro-King\n| rowspan=\"2\" colspan=\"2\" style=\"border-style: dotted solid\" | anti-King\n|-\n| rowspan=\"2\" | 2nd English Civil War\n|-\n| 1648\n| style=\"border-style: dotted solid\" | pro-King\n| colspan=\"2\" style=\"border-style: dotted solid\" | anti-King\n|-\n| Anglo-Scottish war (1650–1652)\n| 1650–1651\n| rowspan=\"3\" style=\"border-style: none solid solid solid\" | pro-King\n| style=\"border-style: solid solid none solid\" | pro-King\n| style=\"border-style: dotted solid\" | anti-King\n|-\n| Interregnum\n| 1651–1660\n| style=\"border-style: dotted solid\" | pro-King\n| style=\"border-style: dotted solid\" | anti-King\n|-\n| rowspan=\"2\" | Restoration\n| 1660–1661\n| style=\"border-style: none solid solid solid\" | pro-King\n| style=\"border-style: none solid\" | anti-King\n|-\n| 1661–1689\n| style=\"border-style: none solid solid solid\" | pro-King\n| colspan=\"3\" style=\"border-style: none solid solid solid\" | anti-King\n|}\nTimeline of Scotland in the Wars of the Three Kingdoms\n{| class=\"wikitable\"\n|-\n!Date!!Event!!Effect!!\n|-\n|colspan=4 style=\"text-align:center;\"|Background\n|-\n|16th century||English & Scottish nobles settled parts of Ireland||Generated resentment from Irish Catholics||\n|-\n|1581||National Covenant of the Church of Scotland||The Kirk rejected Roman Catholicism||\n|-\n|24 March 1603||Union of the Crowns||James VI and I became King of England and Scotland||Royalists\n|-\n|27 March 1625||Charles I succeeded James VI and I||||\n|-\n|1625 October||Act of Revocation||Charles I revoked all gifts of land to Scot nobility||\n|-\n|1636||Book of Canons imposed on Scottish church||||\n|-\n|1637||Book of Common Prayer imposed on Scottish church||Sparked riots||\n|-\n|1638 February 28||National Covenant (Presbyterian)||The Kirk rejected the Church of England||Covenanters\n|-\n|1638 December||||Bishops expelled from the Kirk||\n|-\n|colspan=4 style=\"text-align:center;\"|'''First Bishops' War (1639)\n|-\n|1639 June 19||Treaty of Berwick||Charles I conceded to CovenantersEnd of First Bishops' War||\n|-\n|colspan=4 style=\"text-align:center;\"|(Interlude)\n|-\n|1640 June||Commission of Fire & Sword||Covenanters persecuted Royalists||\n|-\n|colspan=4 style=\"text-align:center;\"|Second Bishops' War\n|-\n|1640 August 28||Battle of Newburn||Decisive Covenanter victory||\n|-\n|1640 October 26||Treaty of Ripon||Charles I forced to pay for Scottish army||\n|-\n|1640 August||Cumbernauld Bond||Pact foreshadowed Scottish Civil War (1644) and Engagement (1647)||\n|-\n|10 August 1641||Treaty of London||Charles I conceded to CovenantersEnd of Bishops' Wars||\n|-\n|colspan=4 style=\"text-align:center;\"|(Interlude)\n|-\n|12 October 1641||The Incident||Failed attempted kidnapping by Royalists||\n|-\n|1642||Covenanters landed army in Ulster||Defended settlers from Irish Confederates||\n|-\n|colspan=4 style=\"text-align:center;\"|First English Civil War\n|-\n|25 September 1643||Solemn League and Covenant||Roundheads–Covenanters alliance||Kirk Party\n|-\n|16 February 1644||Committee of Both Kingdoms||Roundheads–Covenanters joint government||\n|-\n|colspan=4 style=\"text-align:center;\"|Scottish Civil War\n|-\n|1 September 1644||Battle of Tippermuir||Victory for future Engagers||\n|-\n|2 February 1645||Battle of Inverlochy||Engager victory||\n|-\n|22 February 1645||Failed Uxbridge Treaty||King-Roundhead-Covenanter negotiations||\n|-\n|15 August 1645||Battle of Kilsyth||Short-lived triumph for future Engagers||Engagers\n|-\n|13 September 1645||Battle of Philiphaugh||Main Covenanter army returned from England||Kirk Party\n|-\n|5 May 1646||Charles I surrendered to Covenanters||End of First English Civil War, Scottish Civil War||\n|-\n|colspan=4 style=\"text-align:center;\"|Second English Civil War\n|-\n|26 December 1647||Charles I agreed to the Engagement||Many in Kirk Party refused to serve||Engagers\n|-\n|17 August 1648||Battle of Preston||New Model Army (Roundheads) routed Engagers||\n|-\n|style=\"white-space:nowrap;\"|27 September 1648||Treaty of Stirling||Engagers withdrew from government||Kirk Party\n|-\n|23 January 1649||Act of Classes||Royalists and Engagers barred from public office, including army||\n|-\n|30 January 1649||Charles I executed in London||Universal horror against RoundheadsEnd of Second English Civil War||\n|-\n|colspan=4 style=\"text-align:center;\"|(Interlude)\n|-\n|5 February 1649||Scots proclaimed Charles II as King||Kirk Party sided with Charles II||Resolutioners'''\n|-\n|17 February 1649||English Council of State established||Renounced Scottish alliance||\n|-\n|1 May 1650||Treaty of Breda, Netherlands||rowspan=2|Charles II renounced Irish Catholic connections,endeavored to make Presbyterianism national religion,granted civil authority to the Kirk's General Assembly||rowspan=2|\n|-\n|23 June 1650||Charles II signed Solemn League and Covenant\n|-\n|13 August 1650||Act of Classes rescinded||Future Resolutioners sought to increase size of army||\n|-\n|22 October 1650||Western Remonstrance presented||Future Protesters declared against Charles II||\n|-\n|colspan=4 style=\"text-align:center;\"|Anglo-Scottish war (1650–1652)\n|-\n|3 September 1650||Battle of Dunbar||Major Roundhead victory over Resolutioners||\n|-\n|1 January 1651||Charles II crowned by Resolutioners||Raised new army||\n|-\n|3 September 1651||Battle of Worcester||Decisive Roundhead victoryEnd of English Civil Wars ||Protesters\n|-\n|colspan=4 style=\"text-align:center;\"|Interregnum\n|-\n|28 October 1651||Tender of Union||Scottish Parliament dissolved, given 30 seats in English Parliament||\n|-\n|1653 August||Start of Glencairn's rising by Resolutioners||||\n|-\n|5 May 1654||Act of Pardon and Grace||Cromwell pardoned Engagers, with many exceptions||\n|-\n|19 July 1654||Battle of Dalnaspidal||End of Glencairn's rising||\n|-\n|26 June 1657||Act of Union||Ratification of Tender of Union (1651)||\n|-\n|colspan=4 style=\"text-align:center;\"|Restoration (1660–1689)\n|-\n|14 May 1660||Charles II proclaimed king in Edinburgh||||Resolutioners\n|-\n|28 March 1661||Rescissory Act||Rescinded all acts of Parliament since 1633||\n|-\n|6 September 1661||||Episcopacy restored||\n|-\n|1662||||All office holders required to renounce the Covenant (1638)||Royalists\n|-\n|9 September 1662||Act of indemnity and oblivion||General pardon, many exceptions||\n|}\nSee also\n* Chronology of the Wars of the Three Kingdoms\n* History of Scotland\n* Timeline of the Wars of the Three Kingdoms\nReferences\nSources\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\nFurther reading\n*\n*\n*Stewart, Laura. 2019. Rethinking the Scottish Revolution: Covenanted Scotland, 1637–1651. Oxford University Press.\nExternal links\n* [http://www.british-civil-wars.co.uk/military/1644-5-montrose-scotland.htm The Campaigns of 1644–45]\n* [http://www.british-civil-wars.co.uk/military/1650-carbisdale.htm Montrose's Defeat]\n* [http://www.british-civil-wars.co.uk/military/1650-dunbar.htm Cromwell's victory at Dunbar]\n* [http://www.british-civil-wars.co.uk/glossary/settlement-scotland.htm The settlement of Scotland]\n* [https://web.archive.org/web/20051202031625/http://www.scotwars.com/html/home.htm Portal to all things relevant to the military history of Scotland]"
    }
  ]
}