{
  "content": [
    {
      "type": "text",
      "text": "# Scotchy Pocket, Queensland\n\n| pop                 = 55\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4570\n| area                = 41.4\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 30.4\n| dir1                = NNW\n| location1           = Gympie\n| dist2               = 61.7\n| dir2                = SSW\n| location2           = Maryborough\n| dist3               = 209\n| dir3                = N\n| location3           = Brisbane\n| dist4               =\n| dir4                =\n| location4           =\n| lga                 = Gympie Region\n| stategov            = Gympie\n| fedgov              = Wide Bay\n| near-n              = Theebine\n| near-ne             = Gunalda\n| near-e              = Gunalda\n| near-se             = Curra\n| near-s              = Curra\n| near-sw             = Sexton\n| near-w              = Sexton\n| near-nw             = Miva\n}}\nScotchy Pocket is a rural locality in the Gympie Region, Queensland, Australia. In the , Scotchy Pocket had a population of 55 people.\nGeography\nThe locality is bounded to the west by the Mary River and to the south by Curra Creek, a tributary of the Mary River.\nThe terrain ranges from  above sea level. Scotchy Pocket has the following two mountains, both in the south-east of the locality:\n* Mount Booker ()\n* Mount Scotchy ()\nAlthough not within the locality, the Bruce Highway and North Coast railway line run close to the south-east boundary of the locality. For many years, Scotchy Pocket was served by Kadina railway station (), but it was eliminated during a 1990s realignment to reduce curves and increase speeds.\nThe land use is predominantly grazing on native vegetation with some crop growing (mostly near the Mary River).\nHistory\nScotchy Pocket Provisional School opened in 1900. On 1 January 1909, it became Scotchy Pocket State School. The school closed in 1920 due to low student numbers. It reopened in 1938 and finally closed circa 1944. In 1921, it was on a  land parcel on an unnamed road off Scotchy Pocket Road (). In 1941, it was located on the western side of Scotchy Pocket Road (approx ).\nDemographics\nIn the , Scotchy Pocket had a population of 74 people.\nIn the , Scotchy Pocket had a population of 55 people.\nEducation\nThere are no schools in Scotchy Pocket. The nearest government primary schools are Gunalda State School in neighbouring Gunalda to the east and Theebine State School in neighbouring Theebine to the north. The nearest government secondary school is James Nash State High School in Gympie to the south-west.\nReferences"
    }
  ]
}