{
  "content": [
    {
      "type": "text",
      "text": "# Scott V. Edwards\n\n| birth_place       = Honolulu, Hawaii, US\n| fields            = Ornithology, evolutionary biology\n| workplaces        = Harvard University\n| alma_mater        = Harvard UniversityUniversity of California, Berkeley\n| academic_advisors =\n| doctoral_students =\n| notable_students  =\n| known_for         =\n| influences        =\n| influenced        =\n| awards            =\n}}\nScott Vernon Edwards is the Alexander Agassiz Professor of Organismal and Evolutionary Biology at Harvard University and the Curator of Ornithology at Harvard's associated museum, the Museum of Comparative Zoology.\nEarly life and education\nEdwards was born in Honolulu, Hawaii, on July 7, 1963, and raised in the Riverdale area of the Bronx in New York City, where he worked for the local public horticultural institution Wave Hill. He attended Harvard University as an undergraduate and received his bachelor's degree in biology in 1986. He received his Ph.D. in zoology from University of California, Berkeley in 1992 and then spent two years as a postdoctoral scholar at the University of Florida working with Wayne Potts and Ward Wakeland on molecular evolution in wild bird populations.\nCareer\nEdwards became an assistant professor of zoology at the University of Washington and curator at the Burke Museum of Natural History and Culture in 1994. In 2003 he moved to Harvard University to join the Department of Organismal and Evolutionary Biology and become the Curator of Ornithology at the Museum of Comparative Zoology. In 2013 he was appointed to a two-year position as the Director of the Division of Biological Infrastructure at the National Science Foundation.\nEdwards was elected a fellow of the American Ornithologists' Union in 2006, of the American Academy of Arts and Sciences and the American Association for the Advancement of Science in 2009, and of the United States National Academy of Sciences in 2015. According to The Journal of Blacks in Higher Education, Edwards is one of only two black scientists out of the 84 chosen that year.\nHe has cited early mentorship as a positive influence in developing his research interests and works actively to increase representation of minorities in his field, particularly through offering research experiences to undergraduates. He was elected to the United States National Academy of Sciences in 2015 and to the American Philosophical Society in 2020.\nResearch\nEdwards' research focuses on the molecular evolution of birds. Several papers from his group describe the evolution of birds from dinosaurs; for example, genetic evidence was reported for the evolution of genes involved in feather formation much earlier than the common ancestor of modern birds, supporting the hypothesis that non-avian dinosaurs had feathers. Comparative genomics analyses published by the group suggest that dinosaurs have small genomes like modern birds. Edwards has advocated for modernizing methods in phylogenomics by incorporating advancements in sequencing technologies and by using coalescent models that incorporate incomplete lineage sorting (which is widespread among birds).\nOutside of the laboratory, Edwards has carried out fieldwork in Australia and New Guinea, and more recently in central Mongolia and the Gobi Desert.\nEdwards' group was also involved in the Avian Phylogenomics Consortium, which in 2014 published a large series of papers on avian phylogenomics. His lab is currently involved in the Earth BioGenome Project.\nEdwards has published on the importance of natural history collections for undergraduate education, and he co-developed a program called AIM-UP, which incorporated museum collections into educational programming for undergraduates. He has also edited a book republishing rare early drawings by John Audubon.\nReferences\nExternal links\n* [https://edwards.oeb.harvard.edu/ Edwards laboratory website]\n*"
    }
  ]
}