{
  "content": [
    {
      "type": "text",
      "text": "# Scott Woodward (athletic director)\n\nScott Woodward is an American university sports administrator who was most recently the athletics director at Louisiana State University (LSU) from 2019 to 2025. Woodward was previously director of athletics at the University of Washington from 2008 to 2016 and at Texas A&M University from 2016 to 2019.\nEarly life, education and career\nWoodward is from Baton Rouge, Louisiana and is a 1981 alumnus of Catholic High School in Baton Rouge. He attended college at Louisiana State University earning a bachelor's degree in political science in 1985. After graduating from LSU, Woodward was a co-owner of a government and public relations firm in Baton Rouge that provided strategic policy direction to Fortune 500 corporations.\nIn 2000, Woodward was hired by LSU Chancellor Mark Emmert to serve as the director of external affairs at Louisiana State University. The position entailed being a liaison between LSU and government and corporate officials and acting as an advisor to Chancellor Emmert on policy and government appropriations. At LSU, Woodward also served as the Chancellor's Representative to the Athletic Department. He held these positions at LSU until leaving for the University of Washington in 2004. Woodward was hired by the new president of the University of Washington, Mark Emmert, for the position of Vice President of External Affairs. He served in this role until 2008.\nAthletic director career\nWashington\nIn January 2008, Woodward was named the full-time director of athletics at the University of Washington. He had been both acting director of athletics and Vice President of External Affairs since the previous director of athletics, Todd Turner, resigned in December 2007.\nIn Woodward's first year at Washington, the athletic department budget faced a $2.8 million shortfall causing the elimination of both men's and women's swimming programs. Also during his first year, the football team went 0–12 and Woodward fired head coach Tyrone Willingham in October 2008.\nWoodward's tenure with Washington will be noted for hiring head football coach Steve Sarkisian and later luring Chris Petersen from Boise State along with a $282 million reconstruction of Husky Stadium that was completed in 2013. Washington's athletic budget stabilized during his tenure with revenues boosted in part by the Pac-12 Conference's television-rights deals and by naming-rights deals the athletic department signed with Alaska Airlines. In addition, contributions to the athletic department more than doubled, from about $12.6 million in 2008 to $26.6 million by 2013.\nDuring Woodward's tenure at Washington, the Huskies won seven national championships in the sports of men's and women's crew, women's cross country and softball.\nTexas A&M\nIn January 2016, Woodward was named director of athletics at Texas A&M. During his tenure, Woodward helped build the profile of Texas A&M. He hired two high-profile coaches in Jimbo Fisher from Florida State to be the Aggies’ football coach in December 2017 and he hired Buzz Williams from Virginia Tech to be Texas A&M's new men's basketball coach on April 3, 2019. In addition, a new track and field stadium and softball stadium were built.\nDuring Woodward's tenure at Texas A&M, every sports team participated in postseason play. The Aggies won nine SEC titles including baseball, men's basketball, soccer, women's swimming and diving (three times), men's tennis (twice) and men's outdoor track and field.\nLSU\nOn April 18, 2019, LSU alumnus Woodward was named LSU athletics director, replacing Joe Alleva. In 2021, he hired former Baylor head women's basketball coach Kim Mulkey. He then hired the up and comer coach Jay Johnson from Arizona to coach the Tiger baseball team. Following the departure of Ed Orgeron as head football coach, Woodward led the search that led to the hiring of Brian Kelly from the University of Notre Dame after the 2021 season.\nOn October 26, 2025, Woodward fired Kelly after a 49–25 loss to Texas A&M dropped the Tigers to 5–3 on the season. Kelly's record in four seasons with the Tigers was 34–14 overall and 19–10 in the SEC. However, Woodward cited the Tigers' inability to challenge for conference championships and national championships as a primary reason for Kelly's firing. In Kelly's first season in 2022, LSU finished tied for first in the SEC West with Alabama and claimed a spot in the SEC Championship Game via a head-to-head tiebreak. However, it made no College Football Playoff appearances during his tenure.\nOn October 29, 2025, Louisiana governor Jeff Landry announced at a press conference that Woodward would not hire LSU's head coach, stating that LSU's Board of Supervisors would instead \"(form) a committee\" to identify Kelly's successor. Landry expressed concern with Woodward's firing of Kelly despite Kelly being in the midst of a 10-year contract, noting that as athletics director at Texas A&M University, Woodward had hired Jimbo Fisher away from Florida State in 2017 before his successor, Ross Bjork, fired him with two games remaining in his sixth season despite him being owed a $77.5 million buyout. Kelly was originally set to be owed a $54 million buyout before reportedly settling with LSU officials for around half that amount.\nOn October 30, 2025, Woodward was relieved of his duties as LSU athletics director.\nPersonal life\nWoodward is married to Nanette Dicharry and has two stepsons, Michael and Josh Evans.\nReferences\nExternal links\n* [http://www.lsusports.net/ViewArticle.dbml?DB_OEM_ID=5200&ATCLID=211800367 LSU bio]\n}}"
    }
  ]
}