{
  "content": [
    {
      "type": "text",
      "text": "# Scouting in Delaware__disambig_1\n\nScouting in Delaware has a long history, from the 1910s to the present day, serving thousands of youth in programs that suit the environment in which they live.\nBoy Scouts of America\nThe Wilmington Council (#081) was formed in 1914. In 1931, that council changed names to the Wilmington Area Council, which was still numbered 081. In 1923, the Eastern Shore Council (#221) was formed. In 1924, the Eastern Shore Council merged with the Wilmington Area Council. In 1936, this new Wilmington Area Council was renamed the Del-Mar-Va Council, which was still numbered 081. Today, all Boy Scout units in Delaware are a part of the Del-Mar-Va Council which serves Scouts in Delaware, Maryland and Virginia.\nOrganization\nDel-Mar-Va Council is divided into districts. The eight districts listed below are being consolidated into four as yet unnamed districts in 2025.\n*Cecil District\n*Choptank District\n*Powder Mill\n*Iron Hill\n*Sussex District\n*Tri-County District\n*Two Bays District\n*Virginia District\nCamps\nDel-Mar-Va Council operates three Boy Scout camps:\n* Rodney Scout Reservation, also known as Camp Rodney or RSR, located in North East, Maryland -\n* Henson Scout Reservation, also known as Camp Nanticoke or HSR, near Galestown, Maryland -\n* Akridge Scout Reservation, located in Dover, Delaware -\nOrder of the Arrow Nentego Lodge #20\nOn July 29, 1925, a charter was granted to Unalachtico Lodge of the Del-Mar-Va Council. The lodge totem was the turkey. By the late 1930s, the lodge had become inactive and was disbanded. Through the efforts of the Delmont Lodge #43 of the Valley Forge Council, Lodge #20 was reorganized on June 22, 1957. The new name chosen by the membership was Nentego, a derivation of the name of one of the major Delaware Tribes, which means, \"People from across the water.\" Delmont Lodge inducted two youth from each district and the council professional staff to provide the initial core of Nentego Lodge. The Lodge totem is the Rockfish, which can be found in the Chesapeake Bay. The lodge colors are blue, for the water of the Chesapeake, and grey, for the Rockfish. The first lodge flap appeared in 1957, and its basic design remains in use today.\nGirl Scouts of the USA\n}}\nThe first troop in Delaware was established in 1915 at Mount Zion Lutheran Church in Wilmington, Delaware. In 1962, Wilmington Area Girl Scout Council and Peninsula Girl Scout Council combined to form Girl Scouts of the Chesapeake Bay Council. Today the only Girl Scout council in Delaware is the Girl Scouts of the Chesapeake Bay Council which serves the entire state of Delaware as well as portions of Maryland and Virginia that make up the Delmarva Peninsula.\nCamps\n*Camp Todd near Denton, Maryland\n*Country Center in Hockessin, Delaware\n*Grove Point is  near Earleville, Maryland\n*Sandy Pines is  near Fruitland, Maryland\nReferences"
    }
  ]
}