{
  "content": [
    {
      "type": "text",
      "text": "# Scouter's Key Award\n\nThe '''Scouter's Key Award''' is an adult recognition of Scouting America.  This award is available across several different program areas and can be earned more than once.\nHistory\nIn 1927 the Boy Scouts of America began to recognize adult leaders who completed specific training and performance goals over a five-year period of service with the Scoutmaster's Key. In 1948, the award was renamed the Scouter's Key Award and the tenure requirement was changed from five years of service to three years.  The award could now be earned by Cubmasters, Scoutmasters, Senior Scout Advisors and commissioners. The Skipper's Key, created in 1939, was discontinued in 1948 and replaced with the Scouter's Key. The medal emblem was changed from the First Class emblem to the universal emblem. The Skipper's Key was reinstated as a separate award in 2001 using the original medal and knot designs.\nAward\nThe medal is a pendant suspended from a green, white and green ribbon. The current pendant is a Tenderfoot emblem on a keystone, all in a gold colored metal.  Earlier versions had the keystone and emblem created in 10 or 14 karat gold; and with the First Class emblem as opposed to the Tenderfoot emblem. There is a matching certificate, signed by the Chief Scout Executive with spaces for it to be countersigned by the local Council's president and Scout Executive. The cloth square knot insignia is an embroidered green and white square knot on a cloth khaki patch. Multiple awards are denoted by the wear of program devices, worn on the square knot award and the ribbon of the award medal.\nRequirements\nRequirements vary, depending on position, but all requirements basically amount to creation and/or maintenance of a quality Scouting program, while serving for a period of three years. The award may be earned as a Boy Scout Scoutmaster, Varsity Scout Coach, Venturing Advisor, roundtable commissioner, district commissioner, assistant district commissioner, unit commissioners, council commissioner, assistant council commissioner, district committee chairman, or district committee member.\n;Cubmaster's Key\n* Complete at least three years of registered tenure as a Cubmaster within a five-year period\n* Complete basic training for Cubmasters\n* Complete This is Scouting training\n* Attend a pow wow or University of Scouting (or equivalent), or attend at least four roundtables (or equivalent) during each year of the tenure used for the award\n* Achieve at least the Silver level of Journey to Excellence for at least two years (Quality Unit Award is acceptable if the tenure used is prior to 2011)\n* Earn the National Summertime Pack Award at least once\n* Conduct an annual Pack planning session and have a published Pack meeting/activity schedule of the Pack's parents in each year.\n* Participate in one supplemental or advanced training course either at a council, area, region, or national level\n;Scoutmaster's Key\n* Complete Boy Scout Leader Fast Start Training\n* Complete New Leader Essentials\n* Complete Scoutmaster and Assistant Scoutmaster Specific Training\n* Complete Youth Protection Training\n* Complete Introduction to Outdoor Leader Skills\n* Earn the Boy Scout Leader's Training Award\n* Conduct troop youth leader training three times\n* Participate in one supplemental training course either at a local council or national level\n* Participate as an adult in youth leader training by either serving on the staff or attending the Scoutmaster orientation session of the national youth leader training conference\n* Complete at least three years of registered tenure as a Scoutmaster within a five-year period\n* Earn the Boy Scout Troop National Quality Unit Award two times during the three-year period\n;Varsity Scout Coach's Key\n* Complete Varsity Scout Fast Start Training\n* Complete New Leader Essentials\n* Complete Varsity Coach Leader Specific Training\n* Complete Introduction to Outdoor Leader Skills\n* Conduct youth leader introduction to leadership training twice\n* Participate twice in a team leader seminar\n* Participate in one training course beyond Varsity Scout Leader Specific Training (local council or national level experience)\n* Complete at least three years of tenure registered as a Varsity Scout Coach within a five-year period\n* At least twice during the three-year period, serve as Coach of a Varsity Scout team that earns the National Quality Unit Award\n;Venturing Advisor's Key\n* Complete Venturing Fast Start\n* Complete Venturing Leader Basic Training\n* Conduct crew officers’ seminars each year for three years\n* Conduct at least one Venturing Leadership Skills Course\n* Earn the Venturing Leader Training Award\n* Complete three years of registered tenure as a Venturing crew Advisor within a five-year period\n* Earn the Venturing Crew National Quality Unit Award two times\n* Have a crew parents’ night each year\n;Skipper's Key\n* Complete at least three years of registered tenure as a Skipper within a five-year period\n* Complete Sea Scout Adult Leader Basic Training\n* Complete a NASBLA approved boater safety course\n* Attend a university of Scouting (or equivalent), or attend at least four roundtables (or equivalent) during each year of the tenure used for this award\n* Achieve at least the Silver level of Journey to Excellence for at least two years\n* Conduct annual quarterdeck training and have a published meeting/activity schedule for the ship in each year\n* Participate in at least one additional supplemental or advanced training event at the council, area, region, or national level\n;Unit Commissioner Key\n* Complete the three-session training program outlined in the Commissioner Basic Training Manual: \"Why Commissioners?\", \"First Visitation\", \"Units: The Commissioner’s Greatest Priority\", \"Second Visitation\", \"Third visitation\" and \"How to Help a Unit\"\n* Complete personal coaching orientation including orientation projects\n* Complete 3 years as a registered commissioner within a five-year period\n* Earn the Arrowhead Honor Award\n# Complete Basic Training\n# Visit each assigned unit eight or more times throughout the year\n# Fill in and follow up on unit commissioner work sheets or self-assessment forms for each assigned unit\n# Conduct membership and leadership inventories in each assigned unit\n# Attend six district commissioner staff meetings and provide the training topic for one meeting\n# Participate in a charter renewal meeting that results in on-time unit reregistration\n# Participate in a charter presentation\n# Attend a council commissioner conference or planning conference, or actively participate in a major council event\n# Help a unit resolve a specific problem or improve some aspect of their unit operation\n;Roundtable Commissioner Key\n* Complete basic training for Cub Scout, Boy Scout, Venturing roundtable commissioners.\n* Complete the three session training program outlined in Commissioner Basic Training Manual.\n* Attend a council commissioner conference or planning conference with a majority of your staff.\n* Complete personal coaching assignments.\n* Complete three years as a registered commissioner within a five-year period\n* Earn the Arrowhead Honor Award.\n# Review all material in the current Venturing Roundtable Guide, current Boy Scout Roundtable Planning Guide, current Cub Scout Roundtable Planning Guide, or the current Varsity Scout Roundtable Guide.\n# Review all material in the Troop Program Features, Cub Scout Program Helps, Varsity Scout Game Plan or Venturing Leader Manual\n# Recruit a roundtable staff\n# Lead staff in preparing a one-year roundtable outline\n# Supervise the staff in conducting these roundtables\n# With the district commissioner and district executive, develop and use an attendance promotion plan\n# Attend a council commissioner conference, roundtable, or planning conference\n;District Commissioner Key\n* Complete Commissioner Basic Training\n* Complete three years as a registered commissioner within a five-year period\n* Earn the Arrowhead Honor Award\n# Work with the district executive to evaluate all district commissioners\n# Achieve a ratio of one unit commissioner for every three units in the district or service area\n# Develop and put into action a suitable recruiting plan\n# Chair or take part actively in six district commissioner staff meetings\n# Attend six district committee meetings\n# Attend a council commissioner conference or planning conference with a majority of the commissioner staff\n# Provide personal coaching for the district commissioners\n# Develop and implement a plan to track and hold unit commissioners accountable for monthly unit visits\n;Council Commissioner Key\n* Complete the three session training program outlined in Commissioner Basic Training Manual\n* Complete personal coaching orientation including the orientation projects\n* Complete three years as a registered commissioner within a five-year period\n* Earn the Arrowhead Honor Award\n# Work with the Scout executive or other staff adviser and evaluate all district commissioners in the council\n# Have an active, effective district commissioner in every district of the council\n# Develop and put into action a suitable recruiting plan throughout the council\n# Achieve a ratio in the council of one unit commissioner for every three units\n# Chair or actively take part in six council commissioner meetings\n# Give leadership to a council commissioner conference\n# In consultation with the Scout executive, select and carry out a major project in the council\nDistrict Committee Key may still be earned under the old requirements if the Scouter has already started working on it and will have requirements completed by December 31, 2014  These requirements are:\n* The district must earn the Quality District Award at least once within a three-year period.\n* Take part actively in six district committee meetings.\n* Help give leadership to eight projects of the operating committee or other projects as approved by the district executive\n* Review the district manual and the highlight book for the committee position held; discuss the role of the district and the position with the committee chairman or district executive\n* Complete the District Committee Training Workshop\n* Complete three years as a district committee member within a five-year period\nNew requirements are as follows:\n* Complete three years as a district committee member within a five-year period\n* Complete the District Committee Training Workshop, Staffing the District Committee and This is Scouting\n* Serve in a district achieving, at a minimum, the bronze level of Journey to Excellence\n* Take part in 12 district committee meetings\n* Give primary leadership in meeting at least the silver level in one district Journey to Excellence goal in each year\n* Participate in one additional training on the council, area, region, or national level.\nSee also\n* Advancement and recognition in the Boy Scouts of America\n* Scouter's Training Award\nReferences"
    }
  ]
}