{
  "content": [
    {
      "type": "text",
      "text": "# Screen Actors Guild Award for Outstanding Performance by a Cast in a Motion Picture__disambig_1\n\n}}\nThe Screen Actors Guild Award for Outstanding Performance by a Cast (or Ensemble) in a Motion Picture is an award given by the Screen Actors Guild to honor the finest acting achievements in film. It is the final award presented during the ceremony.\nWinners and nominees\n:\n1990s\n{| class=\"wikitable\" width=\"100%\" cellpadding=\"5\"\n|-\n! width=\"7%\"| Year\n! width=\"31%\"| Film\n! width=\"62%\"| Cast members\n|-\n| rowspan=\"5\" align=\"center\"| 1995\n(2nd)\n| style=\"background:#FAEB86;\"| Apollo 13\n| style=\"background:#FAEB86;\"| Kevin Bacon, Tom Hanks, Ed Harris, Bill Paxton, Kathleen Quinlan, Gary Sinise\n|-\n| Get Shorty\n| Danny DeVito, Dennis Farina, James Gandolfini, Gene Hackman, Delroy Lindo, David Paymer, Rene Russo, John Travolta\n|-\n| How to Make an American Quilt\n| Maya Angelou, Anne Bancroft, Ellen Burstyn, Samantha Mathis, Kate Nelligan, Winona Ryder, Jean Simmons, Lois Smith, Alfre Woodard\n|-\n| Nixon\n| Joan Allen, Brian Bedford, Powers Boothe, Kevin Dunn, Fyvush Finkel, Annabeth Gish, Tony Goldwyn, Larry Hagman, Ed Harris, Edward Herrmann, Anthony Hopkins, Bob Hoskins, Madeline Kahn, E. G. Marshall, David Paymer, David Hyde Pierce, Paul Sorvino, Mary Steenburgen, J. T. Walsh, James Woods\n|-\n| Sense and Sensibility\n| Hugh Grant, Alan Rickman, Emma Thompson, Kate Winslet\n|-\n| rowspan=\"5\" align=\"center\"| 1996\n(3rd)\n| style=\"background:#FAEB86;\"| The Birdcage\n| style=\"background:#FAEB86;\"| Hank Azaria, Christine Baranski, Dan Futterman, Gene Hackman, Nathan Lane, Dianne Wiest, Robin Williams\n|-\n| The English Patient\n| Naveen Andrews, Juliette Binoche, Willem Dafoe, Ralph Fiennes, Colin Firth, Jürgen Prochnow, Kristin Scott Thomas, Julian Wadham\n|-\n| ''Marvin's Room\n| Hume Cronyn, Robert De Niro, Leonardo DiCaprio, Dan Hedaya, Diane Keaton, Hal Scardino, Meryl Streep, Gwen Verdon\n|-\n| Shine\n| John Gielgud, Armin Mueller-Stahl, Lynn Redgrave, Geoffrey Rush, Noah Taylor, Googie Withers\n|-\n| Sling Blade\n| Lucas Black, Natalie Canerday, Robert Duvall, James Hampton, John Ritter, Billy Bob Thornton, J. T. Walsh, Dwight Yoakam\n|-\n| rowspan=\"5\" align=\"center\"| 1997\n(4th)\n| style=\"background:#FAEB86;\"| The Full Monty\n| style=\"background:#FAEB86;\"| Mark Addy, Paul Barber, Robert Carlyle, Deirdre Costello, Steve Huison, Bruce Jones, Lesley Sharp, William Snape, Hugo Speer, Tom Wilkinson, Emily Woof\n|-\n| Boogie Nights\n| Don Cheadle, Heather Graham, Luis Guzmán, Philip Baker Hall, Philip Seymour Hoffman, Thomas Jane, Ricky Jay, William H. Macy, Alfred Molina, Julianne Moore, Nicole Ari Parker, John C. Reilly, Burt Reynolds, Robert Ridgely, Mark Wahlberg, Melora Walters\n|-\n| Good Will Hunting\n| Ben Affleck, Matt Damon, Minnie Driver, Stellan Skarsgård, Robin Williams\n|-\n| L.A. Confidential\n| Kim Basinger, James Cromwell, Russell Crowe, Danny DeVito, Guy Pearce, Kevin Spacey, David Strathairn\n|-\n| Titanic\n| Suzy Amis, Kathy Bates, Leonardo DiCaprio, Frances Fisher, Bernard Fox, Victor Garber, Bernard Hill, Jonathan Hyde, Danny Nucci, Bill Paxton, Gloria Stuart, David Warner, Kate Winslet, Billy Zane\n|-\n| rowspan=\"5\" align=\"center\"| 1998\n(5th)\n| style=\"background:#FAEB86;\"| Shakespeare in Love\n| style=\"background:#FAEB86;\"| Ben Affleck, Simon Callow, Jim Carter, Martin Clunes, Judi Dench, Joseph Fiennes, Colin Firth, Gwyneth Paltrow, Geoffrey Rush, Antony Sher, Imelda Staunton, Tom Wilkinson\n|-\n| Life Is Beautiful (La vita è bella)\n| Roberto Benigni, Nicoletta Braschi, Horst Buchholz, Sergio Bini Bustric, Giorgio Cantarini, Giustino Durano, Amerigo Fontani, Giuliana Lojodice, Marisa Paredes\n|-\n| Little Voice\n| Annette Badland, Brenda Blethyn, Jim Broadbent, Michael Caine, Jane Horrocks, Philip Jackson, Ewan McGregor\n|-\n| Saving Private Ryan\n| Edward Burns, Matt Damon, Jeremy Davies, Vin Diesel, Adam Goldberg, Tom Hanks, Barry Pepper, Giovanni Ribisi, Tom Sizemore\n|-\n| Waking Ned\n| Ian Bannen, Fionnula Flanagan, David Kelly, Susan Lynch, James Nesbitt\n|-\n| rowspan=\"5\" align=\"center\"| 1999\n(6th)\n| style=\"background:#FAEB86;\"| American Beauty\n| style=\"background:#FAEB86;\"| Annette Bening, Wes Bentley, Thora Birch, Chris Cooper, Peter Gallagher, Allison Janney, Kevin Spacey, Mena Suvari\n|-\n| Being John Malkovich\n| Orson Bean, John Cusack, Cameron Diaz, Catherine Keener, John Malkovich, Mary Kay Place, Charlie Sheen\n|-\n| The Cider House Rules\n| Jane Alexander, Erykah Badu, Kathy Baker, Michael Caine, Delroy Lindo, Tobey Maguire, Kate Nelligan, Paul Rudd, Charlize Theron\n|-\n| The Green Mile\n| Patricia Clarkson, James Cromwell, Jeffrey DeMunn, Michael Clarke Duncan, Graham Greene, Tom Hanks, Bonnie Hunt, Doug Hutchison, Michael Jeter, David Morse, Barry Pepper, Sam Rockwell, Harry Dean Stanton\n|-\n| Magnolia\n| Jeremy Blackman, Tom Cruise, Melinda Dillon, April Grace, Luis Guzmán, Philip Baker Hall, Philip Seymour Hoffman, Ricky Jay, William H. Macy, Alfred Molina, Julianne Moore, John C. Reilly, Jason Robards, Melora Walters\n|}\n2000s\n{| class=\"wikitable\" width=\"100%\" cellpadding=\"5\"\n|-\n! width=\"7%\"| Year\n! width=\"31%\"| Film\n! width=\"62%\"| Cast members\n|-\n| rowspan=\"5\" align=\"center\"| 2000\n(7th)\n| style=\"background:#FAEB86;\"| Traffic\n| style=\"background:#FAEB86;\"| Steven Bauer, Benjamin Bratt, James Brolin, Don Cheadle, Erika Christensen, Clifton Collins Jr., Michael Douglas, Miguel Ferrer, Albert Finney, Topher Grace, Luis Guzmán, Amy Irving, Tomas Milian, D. W. Moffett, Dennis Quaid, Peter Riegert, Benicio del Toro, Jacob Vargas, Catherine Zeta-Jones\n|-\n| Almost Famous\n| Fairuza Balk, Billy Crudup, Patrick Fugit, Philip Seymour Hoffman, Kate Hudson, Jason Lee, Frances McDormand, Anna Paquin, Noah Taylor\n|-\n| Billy Elliot\n| Jamie Bell, Jamie Draven, Gary Lewis, Julie Walters\n|-\n| Chocolat''\n| Juliette Binoche, Leslie Caron, Judi Dench, Johnny Depp, Alfred Molina, Carrie-Anne Moss, Hugh O'Conor, Lena Olin, Peter Stormare, John Wood\n|-\n| Gladiator\n| Russell Crowe, Richard Harris, Djimon Hounsou, Derek Jacobi, Connie Nielsen, Joaquin Phoenix, Oliver Reed\n|-\n| rowspan=\"5\" align=\"center\"| 2001\n(8th)\n| style=\"background:#FAEB86;\"| Gosford Park\n| style=\"background:#FAEB86;\"| Eileen Atkins, Bob Balaban, Alan Bates, Charles Dance, Stephen Fry, Michael Gambon, Richard E. Grant, Tom Hollander, Derek Jacobi, Kelly Macdonald, Helen Mirren, Jeremy Northam, Clive Owen, Ryan Phillippe, Maggie Smith, Geraldine Somerville, Kristin Scott Thomas, Sophie Thompson, Emily Watson, James Wilby\n|-\n| A Beautiful Mind\n| Paul Bettany, Jennifer Connelly, Russell Crowe, Adam Goldberg, Jason Gray-Stanford, Ed Harris, Judd Hirsch, Josh Lucas, Austin Pendleton, Christopher Plummer, Anthony Rapp\n|-\n| In the Bedroom\n| William Mapother, Sissy Spacek, Nick Stahl, Marisa Tomei, Celia Weston, Tom Wilkinson, William Wise\n|-\n| The Lord of the Rings: The Fellowship of the Ring\n| Sean Astin, Sean Bean, Cate Blanchett, Orlando Bloom, Billy Boyd, Ian Holm, Christopher Lee, Ian McKellen, Dominic Monaghan, Viggo Mortensen, John Rhys-Davies, Andy Serkis, Liv Tyler, Hugo Weaving, Elijah Wood\n|-\n| Moulin Rouge!\n| Jim Broadbent, Nicole Kidman, John Leguizamo, Ewan McGregor, Richard Roxburgh\n|-\n| rowspan=\"5\" align=\"center\"| 2002\n(9th)\n| style=\"background:#FAEB86;\"| Chicago\n| style=\"background:#FAEB86;\"| Christine Baranski, Ekaterina Chtchelkanova, Taye Diggs, Denise Faye, Colm Feore, Richard Gere, Deidre Goodwin, Queen Latifah, Lucy Liu, Susan Misner, Mýa, John C. Reilly, Dominic West, Renée Zellweger, Catherine Zeta-Jones\n|-\n| Adaptation.\n| Nicolas Cage, Chris Cooper, Brian Cox, Cara Seymour, Meryl Streep, Tilda Swinton\n|-\n| The Hours\n| Toni Collette, Claire Danes, Jeff Daniels, Stephen Dillane, Ed Harris, Allison Janney, Nicole Kidman, Julianne Moore, John C. Reilly, Miranda Richardson, Meryl Streep\n|-\n| The Lord of the Rings: The Two Towers\n| Sean Astin, Cate Blanchett, Orlando Bloom, Billy Boyd, Brad Dourif, Bernard Hill, Christopher Lee, Ian McKellen, Dominic Monaghan, Viggo Mortensen, Miranda Otto, John Rhys-Davies, Andy Serkis, Liv Tyler, Karl Urban, Hugo Weaving, David Wenham, Elijah Wood\n|-\n| My Big Fat Greek Wedding\n| Gia Carides, Michael Constantine, John Corbett, Joey Fatone, Lainie Kazan, Andrea Martin, Nia Vardalos\n|-\n| rowspan=\"5\" align=\"center\"| 2003\n(10th)\n| style=\"background:#FAEB86;\"| The Lord of the Rings: The Return of the King\n| style=\"background:#FAEB86;\"| Sean Astin, Sean Bean, Cate Blanchett, Orlando Bloom, Billy Boyd, Bernard Hill, Ian Holm, Ian McKellen, Dominic Monaghan, Viggo Mortensen, John Noble, Miranda Otto, John Rhys-Davies, Andy Serkis, Liv Tyler, Karl Urban, Hugo Weaving, David Wenham, Elijah Wood\n|-\n| In America\n| Emma Bolger, Sarah Bolger, Paddy Considine, Djimon Hounsou, Samantha Morton\n|-\n| Mystic River\n| Kevin Bacon, Laurence Fishburne, Marcia Gay Harden, Laura Linney, Sean Penn, Tim Robbins\n|-\n| Seabiscuit\n| Elizabeth Banks, Jeff Bridges, Chris Cooper, William H. Macy, Tobey Maguire, Gary Stevens\n|-\n| The Station Agent\n| Paul Benjamin, Bobby Cannavale, Patricia Clarkson, Peter Dinklage, Raven Goodwin, Michelle Williams\n|-\n| rowspan=\"6\" align=\"center\"| 2004\n(11th)\n| style=\"background:#FAEB86;\"| Sideways\n| style=\"background:#FAEB86;\"| Thomas Haden Church, Paul Giamatti, Virginia Madsen, Sandra Oh\n|-\n| The Aviator\n| Alan Alda, Alec Baldwin, Kate Beckinsale, Cate Blanchett, Leonardo DiCaprio, Ian Holm, Danny Huston, Jude Law, John C. Reilly, Gwen Stefani\n|-\n| Finding Neverland\n| Julie Christie, Johnny Depp, Freddie Highmore, Dustin Hoffman, Radha Mitchell, Joe Prospero, Nick Roud, Luke Spill, Kate Winslet\n|-\n| Hotel Rwanda\n| Don Cheadle, Nick Nolte, Sophie Okonedo, Joaquin Phoenix\n|-\n| Million Dollar Baby\n| Clint Eastwood, Morgan Freeman, Hilary Swank\n|-\n| Ray\n| Aunjanue Ellis-Taylor, Jamie Foxx, Terrence Howard, Regina King, Harry J. Lennix, Clifton Powell, Larenz Tate, Kerry Washington\n|-\n| rowspan=\"5\" align=\"center\"| 2005\n(12th)\n| style=\"background:#FAEB86;\"| Crash\n| style=\"background:#FAEB86;\"| Chris \"Ludacris\" Bridges, Sandra Bullock, Don Cheadle, Matt Dillon, Jennifer Esposito, William Fichtner, Brendan Fraser, Terrence Howard, Thandie Newton, Ryan Phillippe, Larenz Tate\n|-\n| Brokeback Mountain\n| Linda Cardellini, Anna Faris, Jake Gyllenhaal, Anne Hathaway, Heath Ledger, Randy Quaid, Michelle Williams\n|-\n| Capote\n| Bob Balaban, Marshall Bell, Clifton Collins Jr., Chris Cooper, Bruce Greenwood, Philip Seymour Hoffman, Catherine Keener, Mark Pellegrino\n|-\n| Good Night, and Good Luck.\n| Rose Abdoo, Alex Borstein, Robert John Burke, Patricia Clarkson, George Clooney, Jeff Daniels, Reed Diamond, Tate Donovan, Robert Downey Jr., Grant Heslov, Peter Jacobson, Frank Langella, Tom McCarthy, Dianne Reeves, Matt Ross, David Strathairn, Ray Wise\n|-\n| Hustle & Flow\n| Anthony Anderson, Christopher \"Ludacris\" Bridges, Isaac Hayes, Taraji P. Henson, Terrence Howard, Taryn Manning, Elise Neal, Paula Jai Parker, DJ Qualls\n|-\n| rowspan=\"5\" align=\"center\"| 2006\n(13th)\n| style=\"background:#FAEB86;\"| Little Miss Sunshine\n| style=\"background:#FAEB86;\"| Alan Arkin, Abigail Breslin, Steve Carell, Toni Collette, Paul Dano, Greg Kinnear\n|-\n| Babel\n| Adriana Barraza, Gael García Bernal, Cate Blanchett, Rinko Kikuchi, Brad Pitt, Kōji Yakusho\n|-\n| Bobby\n| Harry Belafonte, Joy Bryant, Nick Cannon, Emilio Estevez, Laurence Fishburne, Brian Geraghty, Heather Graham, Anthony Hopkins, Helen Hunt, Joshua Jackson, David Krumholtz, Ashton Kutcher, Shia LaBeouf, Lindsay Lohan, William H. Macy, Svetlana Metkina, Demi Moore, Freddy Rodriguez, Martin Sheen, Christian Slater, Sharon Stone, Jacob Vargas, Mary Elizabeth Winstead, Elijah Wood\n|-\n| The Departed\n| Anthony Anderson, Alec Baldwin, Matt Damon, Leonardo DiCaprio, Vera Farmiga, Jack Nicholson, Martin Sheen, Mark Wahlberg, Ray Winstone\n|-\n| Dreamgirls\n| Hinton Battle, Jamie Foxx, Danny Glover, Jennifer Hudson, Beyoncé, Sharon Leal, Eddie Murphy, Keith Robinson, Anika Noni Rose\n|-\n| rowspan=\"5\" align=\"center\"| 2007\n(14th)\n| style=\"background:#FAEB86;\"| No Country for Old Men\n| style=\"background:#FAEB86;\"| Javier Bardem, Josh Brolin, Garret Dillahunt, Tess Harper, Woody Harrelson, Tommy Lee Jones, Kelly Macdonald\n|-\n| 3:10 to Yuma\n| Christian Bale, Russell Crowe, Peter Fonda, Ben Foster, Logan Lerman, Gretchen Mol, Dallas Roberts, Vinessa Shaw, Alan Tudyk\n|-\n| American Gangster\n| Armand Assante, Josh Brolin, Russell Crowe, Ruby Dee, Chiwetel Ejiofor, Idris Elba, Cuba Gooding Jr., Carla Gugino, John Hawkes, Ted Levine, Joe Morton, Lymari Nadal, John Ortiz, RZA, Yul Vazquez, Denzel Washington\n|-\n| Hairspray\n| Nikki Blonsky, Amanda Bynes, Paul Dooley, Zac Efron, Allison Janney, Elijah Kelley, Queen Latifah, James Marsden, Michelle Pfeiffer, Brittany Snow, Jerry Stiller, John Travolta, Christopher Walken\n|-\n| Into the Wild\n| Brian H. Dierker, Marcia Gay Harden, Emile Hirsch, Hal Holbrook, William Hurt, Catherine Keener, Jena Malone, Kristen Stewart, Vince Vaughn\n|-\n| rowspan=\"5\" align=\"center\"| 2008\n(15th)\n| style=\"background:#FAEB86;\"| Slumdog Millionaire\n| style=\"background:#FAEB86;\"| Rubina Ali, Tanay Hemant Chheda, Ashutosh Lobo Gajiwala, Azharuddin Mohammed Ismail, Anil Kapoor, Irrfan Khan, Ayush Mahesh Khedekar, Tanvi Ganesh Lonkar, Madhur Mittal, Dev Patel, Freida Pinto\n|-\n| The Curious Case of Benjamin Button\n| Mahershala Ali, Cate Blanchett, Jason Flemyng, Jared Harris, Taraji P. Henson, Elias Koteas, Julia Ormond, Brad Pitt, Phyllis Somerville, Tilda Swinton\n|-\n| Doubt\n| Amy Adams, Viola Davis, Philip Seymour Hoffman, Meryl Streep\n|-\n| Frost/Nixon\n| Kevin Bacon, Rebecca Hall, Toby Jones, Frank Langella, Matthew Macfadyen, Oliver Platt, Sam Rockwell, Michael Sheen\n|-\n| Milk\n| Josh Brolin, Joseph Cross, James Franco, Victor Garber, Emile Hirsch, Diego Luna, Denis O'Hare, Sean Penn, Alison Pill\n|-\n| rowspan=\"5\" align=\"center\"| 2009\n(16th)\n| style=\"background:#FAEB86;\"| Inglourious Basterds\n| style=\"background:#FAEB86;\"| Daniel Brühl, August Diehl, Julie Dreyfus, Michael Fassbender, Sylvester Groth, Jacky Ido, Diane Kruger, Mélanie Laurent, Denis Menochet, Mike Myers, Brad Pitt, Eli Roth, Til Schweiger, Rod Taylor, Christoph Waltz, Martin Wuttke\n|-\n| An Education\n| Dominic Cooper, Alfred Molina, Carey Mulligan, Rosamund Pike, Peter Sarsgaard, Emma Thompson, Olivia Williams\n|-\n| The Hurt Locker\n| Christian Camargo, Brian Geraghty, Evangeline Lilly, Anthony Mackie, Jeremy Renner\n|-\n| Nine\n| Marion Cotillard, Penélope Cruz, Daniel Day-Lewis, Judi Dench, Fergie, Kate Hudson, Nicole Kidman, Sophia Loren\n|-\n| Precious\n| Mariah Carey, Lenny Kravitz, Mo'Nique, Paula Patton, Sherri Shepherd, Gabourey Sidibe\n|}\n2010s\n{| class=\"wikitable\" width=\"100%\" cellpadding=\"5\"\n|-\n! width=\"7%\"| Year\n! width=\"31%\"| Film\n! width=\"62%\"| Cast members\n|-\n| rowspan=\"5\" align=\"center\"| 2010\n(17th)\n| style=\"background:#FAEB86;\"| 'The King's Speech\n| style=\"background:#FAEB86;\"| Anthony Andrews, Helena Bonham Carter, Jennifer Ehle, Colin Firth, Michael Gambon, Derek Jacobi, Guy Pearce, Geoffrey Rush, Timothy Spall'\n|-\n| Black Swan\n| Vincent Cassel, Barbara Hershey, Mila Kunis, Natalie Portman, Winona Ryder\n|-\n| The Fighter\n| Amy Adams, Christian Bale, Melissa Leo, Jack McGee, Mark Wahlberg\n|-\n| The Kids Are All Right\n| Annette Bening, Josh Hutcherson, Julianne Moore, Mark Ruffalo, Mia Wasikowska\n|-\n| The Social Network\n| Jesse Eisenberg, Andrew Garfield, Armie Hammer, Max Minghella, Josh Pence, Justin Timberlake\n|-\n| rowspan=\"5\" align=\"center\"| 2011\n(18th)\n| style=\"background:#FAEB86;\"| The Help\n| style=\"background:#FAEB86;\"| '''Jessica Chastain, Viola Davis, Bryce Dallas Howard, Allison Janney, Chris Lowell, Ahna O'Reilly, Sissy Spacek, Octavia Spencer, Mary Steenburgen, Emma Stone, Cicely Tyson, Mike Vogel'\n|-\n| The Artist\n| Bérénice Bejo, James Cromwell, Jean Dujardin, John Goodman, Penelope Ann Miller\n|-\n| Bridesmaids''\n| Rose Byrne, Jill Clayburgh, Ellie Kemper, Matt Lucas, Melissa McCarthy, Wendi McLendon-Covey, Chris O'Dowd, Maya Rudolph, Rebel Wilson, Kristen Wiig\n|-\n| The Descendants\n| Beau Bridges, George Clooney, Robert Forster, Judy Greer, Matthew Lillard, Shailene Woodley\n|-\n| Midnight in Paris\n| Kathy Bates, Adrien Brody, Carla Bruni, Marion Cotillard, Rachel McAdams, Michael Sheen, Owen Wilson\n|-\n| rowspan=\"5\" align=\"center\"| 2012\n(19th)\n| style=\"background:#FAEB86;\"| Argo\n| style=\"background:#FAEB86;\"| Ben Affleck, Alan Arkin, Kerry Bishé, Kyle Chandler, Rory Cochrane, Bryan Cranston, Christopher Denham, Tate Donovan, Clea DuVall, Victor Garber, John Goodman, Scoot McNairy, Chris Messina\n|-\n| The Best Exotic Marigold Hotel\n| Judi Dench, Celia Imrie, Bill Nighy, Dev Patel, Ronald Pickup, Maggie Smith, Tom Wilkinson, Penelope Wilton\n|-\n| Les Misérables\n| Isabelle Allen, Samantha Barks, Sacha Baron Cohen, Helena Bonham Carter, Russell Crowe, Anne Hathaway, Daniel Huttlestone, Hugh Jackman, Eddie Redmayne, Amanda Seyfried, Aaron Tveit, Colm Wilkinson\n|-\n| Lincoln\n| Daniel Day-Lewis, Sally Field, Joseph Gordon-Levitt, Hal Holbrook, Tommy Lee Jones, James Spader, David Strathairn\n|-\n| Silver Linings Playbook\n| Bradley Cooper, Robert De Niro, Anupam Kher, Jennifer Lawrence, Chris Tucker, Jacki Weaver\n|-\n| rowspan=\"5\" align=\"center\"| 2013\n(20th)\n| style=\"background:#FAEB86;\"| American Hustle\n| style=\"background:#FAEB86;\"| Amy Adams, Christian Bale, Louis C.K., Bradley Cooper, Paul Herman, Jack Huston, Jennifer Lawrence, Alessandro Nivola, Michael Peña, Jeremy Renner, Elisabeth Röhm, Shea Whigham\n|-\n| 12 Years a Slave\n| Benedict Cumberbatch, Paul Dano, Garret Dillahunt, Chiwetel Ejiofor, Michael Fassbender, Paul Giamatti, Scoot McNairy, Lupita Nyong'o, Adepero Oduye, Sarah Paulson, Brad Pitt, Michael Kenneth Williams, Alfre Woodard\n|-\n| August: Osage County\n| Abigail Breslin, Chris Cooper, Benedict Cumberbatch, Juliette Lewis, Margo Martindale, Ewan McGregor, Dermot Mulroney, Julianne Nicholson, Julia Roberts, Sam Shepard, Meryl Streep, Misty Upham\n|-\n| The Butler\n| Mariah Carey, John Cusack, Jane Fonda, Cuba Gooding Jr., Terrence Howard, Lenny Kravitz, James Marsden, David Oyelowo, Alex Pettyfer, Vanessa Redgrave, Alan Rickman, Liev Schreiber, Forest Whitaker, Robin Williams, Oprah Winfrey\n|-\n| Dallas Buyers Club\n| Jennifer Garner, Jared Leto, Matthew McConaughey, Denis O'Hare, Dallas Roberts, Steve Zahn\n|-\n| rowspan=\"5\" align=\"center\"| 2014\n(21st)\n| style=\"background:#FAEB86;\"| Birdman\n| style=\"background:#FAEB86;\"| Zach Galifianakis, Michael Keaton, Edward Norton, Andrea Riseborough, Amy Ryan, Emma Stone, Naomi Watts\n|-\n| Boyhood\n| Patricia Arquette, Ellar Coltrane, Ethan Hawke, Lorelei Linklater\n|-\n| The Grand Budapest Hotel\n| F. Murray Abraham, Mathieu Amalric, Adrien Brody, Willem Dafoe, Ralph Fiennes, Jeff Goldblum, Harvey Keitel, Jude Law, Bill Murray, Edward Norton, Tony Revolori, Saoirse Ronan, Jason Schwartzman, Léa Seydoux, Tilda Swinton, Tom Wilkinson, Owen Wilson\n|-\n| The Imitation Game\n| Matthew Beard, Benedict Cumberbatch, Charles Dance, Matthew Goode, Rory Kinnear, Keira Knightley, Allen Leech, Mark Strong\n|-\n| The Theory of Everything\n| Charlie Cox, Felicity Jones, Simon McBurney, Eddie Redmayne, David Thewlis, Emily Watson\n|-\n| rowspan=\"5\" align=\"center\"| 2015\n(22nd)\n| style=\"background:#FAEB86;\"| Spotlight\n| style=\"background:#FAEB86;\"| '''Billy Crudup, Brian d'Arcy James, Michael Keaton, Rachel McAdams, Mark Ruffalo, Liev Schreiber, John Slattery, Stanley Tucci'\n|-\n| Beasts of No Nation\n| Abraham Attah, Kurt Egyiawan, Idris Elba\n|-\n| The Big Short\n| Christian Bale, Steve Carell, Ryan Gosling, Melissa Leo, Hamish Linklater, John Magaro, Brad Pitt, Rafe Spall, Jeremy Strong, Marisa Tomei, Finn Wittrock\n|-\n| Straight Outta Compton''\n| Neil Brown Jr., Paul Giamatti, Corey Hawkins, Aldis Hodge, O'Shea Jackson Jr., Jason Mitchell\n|-\n| Trumbo\n| Adewale Akinnuoye-Agbaje, Louis C.K., Bryan Cranston, David James Elliott, Elle Fanning, John Goodman, Diane Lane, Helen Mirren, Michael Stuhlbarg, Alan Tudyk\n|-\n| rowspan=\"5\" align=\"center\"| 2016\n(23rd)\n| style=\"background:#FAEB86;\"| Hidden Figures\n| style=\"background:#FAEB86;\"| Mahershala Ali, Kevin Costner, Kirsten Dunst, Taraji P. Henson, Aldis Hodge, Janelle Monáe, Jim Parsons, Glen Powell, Octavia Spencer\n|-\n| Captain Fantastic\n| Annalise Basso, Shree Crooks, Ann Dowd, Kathryn Hahn, Nicholas Hamilton, Samantha Isler, Frank Langella, George MacKay, Erin Moriarty, Viggo Mortensen, Missi Pyle, Charlie Shotwell, Steve Zahn\n|-\n| Fences\n| Jovan Adepo, Viola Davis, Stephen McKinley Henderson, Russell Hornsby, Saniyya Sidney, Denzel Washington, Mykelti Williamson\n|-\n| Manchester by the Sea\n| Casey Affleck, Matthew Broderick, Kyle Chandler, Lucas Hedges, Gretchen Mol, Michelle Williams\n|-\n| Moonlight\n| Mahershala Ali, Naomie Harris, André Holland, Jharrel Jerome, Janelle Monáe, Trevante Rhodes, Ashton Sanders\n|-\n| rowspan=\"5\" align=\"center\"| 2017\n(24th)\n| style=\"background:#FAEB86;\"| Three Billboards Outside Ebbing, Missouri\n| style=\"background:#FAEB86;\"| Abbie Cornish, Peter Dinklage, Woody Harrelson, John Hawkes, Lucas Hedges, Željko Ivanek, Caleb Landry Jones, Frances McDormand, Clarke Peters, Sam Rockwell, Samara Weaving\n|-\n| The Big Sick\n| Adeel Akhtar, Holly Hunter, Zoe Kazan, Anupam Kher, Kumail Nanjiani, Ray Romano, Zenobia Shroff\n|-\n| Get Out\n| Caleb Landry Jones, Daniel Kaluuya, Catherine Keener, Stephen Root, Lakeith Stanfield, Bradley Whitford, Allison Williams\n|-\n| Lady Bird\n| Timothée Chalamet, Beanie Feldstein, Lucas Hedges, Tracy Letts, Stephen McKinley Henderson, Laurie Metcalf, Jordan Rodrigues, Saoirse Ronan, Odeya Rush, Marielle Scott, Lois Smith\n|-\n| Mudbound\n| Jonathan Banks, Mary J. Blige, Jason Clarke, Garrett Hedlund, Jason Mitchell, Rob Morgan, Carey Mulligan\n|-\n| rowspan=\"5\" align=\"center\"| 2018\n(25th)\n| style=\"background:#FAEB86;\"|Black Panther\n| style=\"background:#FAEB86;\"|'''Angela Bassett, Chadwick Boseman, Sterling K. Brown, Winston Duke, Martin Freeman, Danai Gurira, Michael B. Jordan, Daniel Kaluuya, Lupita Nyong'o, Andy Serkis, Forest Whitaker, Letitia Wright'\n|-\n| BlacKkKlansman\n| Harry Belafonte, Adam Driver, Topher Grace, Laura Harrier, Corey Hawkins, John David Washington\n|-\n| Bohemian Rhapsody\n| Lucy Boynton, Aidan Gillen, Ben Hardy, Tom Hollander, Gwilym Lee, Allen Leech, Rami Malek, Joe Mazzello, Mike Myers\n|-\n| Crazy Rich Asians\n| Awkwafina, Gemma Chan, Henry Golding, Ken Jeong, Lisa Lu, Harry Shum Jr., Constance Wu, Michelle Yeoh\n|-\n| A Star Is Born\n| Dave Chappelle, Andrew Dice Clay, Bradley Cooper, Sam Elliott, Rafi Gavron, Lady Gaga, Anthony Ramos\n|-\n| rowspan=\"5\" align=\"center\"| 2019\n(26th)\n| style=\"background:#FAEB86;\"| Parasite  (기생충)\n| style=\"background:#FAEB86;\"| Cho Yeo-jeong, Choi Woo-shik, Jang Hye-jin, Jung Hyun-joon, Jung Ziso, Lee Jung-eun, Lee Sun-kyun, Park Myung-hoon, Park So-dam, Song Kang-ho\n|-\n| Bombshell\n| Connie Britton, Allison Janney, Nicole Kidman, John Lithgow, Malcolm McDowell, Kate McKinnon, Margot Robbie, Charlize Theron\n|-\n| The Irishman\n| Bobby Cannavale, Robert De Niro, Stephen Graham, Harvey Keitel, Al Pacino, Anna Paquin, Joe Pesci, Ray Romano\n|-\n| Jojo Rabbit\n| Alfie Allen, Roman Griffin Davis, Scarlett Johansson, Thomasin McKenzie, Stephen Merchant, Sam Rockwell, Taika Waititi, Rebel Wilson\n|-\n| Once Upon a Time in Hollywood\n| Austin Butler, Julia Butters, Bruce Dern, Leonardo DiCaprio, Dakota Fanning, Emile Hirsch, Damian Lewis, Mike Moh, Timothy Olyphant, Al Pacino, Luke Perry, Brad Pitt, Margaret Qualley, Margot Robbie\n|}\n2020s\n{| class=\"wikitable\" width=\"100%\" cellpadding=\"5\"\n|-\n! width=\"7%\"| Year\n! width=\"31%\"| Film\n! width=\"62%\"| Cast members\n|-\n| rowspan=\"5\" align=\"center\"| 2020\n(27th)\n| style=\"background:#FAEB86;\"| The Trial of the Chicago 7\n| style=\"background:#FAEB86;\"| Yahya Abdul-Mateen II, Sacha Baron Cohen, Joseph Gordon-Levitt, Kelvin Harrison Jr., Michael Keaton, Frank Langella, John Carroll Lynch, Eddie Redmayne, Mark Rylance, Alex Sharp, Jeremy Strong\n|-\n| Da 5 Bloods\n| Chadwick Boseman, Paul Walter Hauser, Nguyễn Ngọc Lâm, Lê Y Lan, Norm Lewis, Delroy Lindo, Jonathan Majors, Van Veronica Ngo, Johnny Trí Nguyễn, Jasper Pääkkönen, Clarke Peters, Sandy Hương Phạm, Jean Reno, Mélanie Thierry, Isiah Whitlock Jr.\n|-\n| Ma Rainey's Black Bottom\n| Chadwick Boseman, Jonny Coyne, Viola Davis, Colman Domingo, Michael Potts, Glynn Turman\n|-\n| Minari\n| Noel Kate Cho, Han Ye-ri, Scott Haze, Alan Kim, Will Patton, Steven Yeun, Youn Yuh-jung\n|-\n| One Night in Miami...\n| Kingsley Ben-Adir, Beau Bridges, Lawrence Gilliard Jr., Eli Goree, Aldis Hodge, Michael Imperioli, Joaquina Kalukango, Leslie Odom Jr., Lance Reddick, Nicolette Robinson\n|-\n| rowspan=\"5\" align=\"center\"| 2021\n(28th)\n| style=\"background:#FAEB86;\" | CODA\n| style=\"background:#FAEB86;\" | Eugenio Derbez, Daniel Durant, Emilia Jones, Troy Kotsur, Marlee Matlin, Ferdia Walsh-Peelo\n|-\n| Belfast\n| Caitríona Balfe, Judi Dench, Jamie Dornan, Jude Hill, Ciarán Hinds, Colin Morgan\n|-\n| Don't Look Up\n| Cate Blanchett, Timothée Chalamet, Leonardo DiCaprio, Ariana Grande, Jonah Hill, Jennifer Lawrence, Melanie Lynskey, Scott Mescudi, Rob Morgan, Himesh Patel, Ron Perlman, Tyler Perry, Mark Rylance, Meryl Streep\n|-\n| House of Gucci\n| Adam Driver, Lady Gaga, Salma Hayek, Jack Huston, Jeremy Irons, Jared Leto, Al Pacino\n|-\n| King Richard\n| Jon Bernthal, Aunjanue Ellis-Taylor, Tony Goldwyn, Saniyya Sidney, Demi Singleton, Will Smith\n|-\n| rowspan=\"5\" align=\"center\"| 2022\n(29th)\n| style=\"background:#FAEB86;\" | Everything Everywhere All at Once\n| style=\"background:#FAEB86;\" | Jamie Lee Curtis, James Hong, Stephanie Hsu, Ke Huy Quan, Harry Shum Jr., Jenny Slate, Michelle Yeoh\n|-\n| Babylon\n| Jovan Adepo, P.J. Byrne, Diego Calva, Lukas Haas, Olivia Hamilton, Li Jun Li, Tobey Maguire, Max Minghella, Brad Pitt, Margot Robbie, Rory Scovel, Jean Smart, Katherine Waterston\n|-\n| The Banshees of Inisherin\n| Kerry Condon, Colin Farrell, Brendan Gleeson, Barry Keoghan\n|-\n| The Fabelmans\n| Jeannie Berlin, Paul Dano, Judd Hirsch, Gabriel LaBelle, David Lynch, Seth Rogen, Michelle Williams\n|-\n| Women Talking\n| Jessie Buckley, Claire Foy, Kate Hallett, Judith Ivey, Rooney Mara, Sheila McCarthy, Frances McDormand, Michelle McLeod, Liv McNeil, Ben Whishaw, August Winter\n|-\n| rowspan=\"5\" align=\"center\"| 2023\n(30th)\n| style=\"background:#FAEB86;\" | Oppenheimer\n| style=\"background:#FAEB86;\" | Casey Affleck, Emily Blunt, Kenneth Branagh, Matt Damon, Robert Downey Jr., Josh Hartnett, Rami Malek, Cillian Murphy, Florence Pugh\n|-\n| American Fiction\n| Erika Alexander, Adam Brody, Sterling K. Brown, Keith David, John Ortiz, Issa Rae, Tracee Ellis Ross, Leslie Uggams, Jeffrey Wright\n|-\n| Barbie\n| Michael Cera, Will Ferrell, America Ferrera, Ryan Gosling, Ariana Greenblatt, Kate McKinnon, Helen Mirren, Rhea Perlman, Issa Rae, Margot Robbie\n|-\n| The Color Purple\n| Halle Bailey, Fantasia Barrino, Jon Batiste, Danielle Brooks, Ciara, Colman Domingo, Aunjanue Ellis-Taylor, Louis Gossett Jr., Corey Hawkins, Taraji P. Henson, Phylicia Pearl Mpasi, Gabriella Wilson \"H.E.R.\"\n|-\n| Killers of the Flower Moon\n| Tantoo Cardinal, Robert De Niro, Leonardo DiCaprio, Brendan Fraser, Lily Gladstone, John Lithgow, Jesse Plemons\n|-\n| rowspan=\"5\" align=\"center\"| 2024\n(31st)\n| style=\"background:#FAEB86;\" |Conclave\n| style=\"background:#FAEB86;\" |Sergio Castellitto, Ralph Fiennes, John Lithgow, Lucian Msamati, Isabella Rossellini, Stanley Tucci\n|-\n| Anora\n| Yura Borisov, Mark Eydelshteyn, Karren Karagulian, Mikey Madison, Aleksei Serebryakov, Vache Tovmasyan\n|-\n| A Complete Unknown\n| Monica Barbaro, Norbert Leo Butz, Timothée Chalamet, Elle Fanning, Dan Fogler, Will Harrison, Eriko Hatsune, Boyd Holbrook, Scoot McNairy, Big Bill Morganfield, Edward Norton\n|-\n| Emilia Pérez\n| Karla Sofía Gascón, Selena Gomez, Adriana Paz, Zoe Saldaña\n|-\n| Wicked\n| Jonathan Bailey, Marissa Bode, Peter Dinklage, Cynthia Erivo, Jeff Goldblum, Ariana Grande, Ethan Slater, Bowen Yang, Michelle Yeoh\n|}\nTrivia\nGeneral\n* The award was not given at the 1st Screen Actors Guild Awards.\nFilms\n* The Full Monty, The Lord of the Rings: The Return of the King, and Parasite are the only winning films not to be nominated in any other category.\n* Gosford Park has the largest winning cast (20 credited actors).\n* Bobby has the largest nominated cast (24 credited actors).\n* Sideways has the smallest winning cast (4 credited actors).\n* Million Dollar Baby and Beasts of No Nation have the smallest nominated cast (3 credited actors).\n* Parasite is the first non-English language film to win the award.\n* The Birdcage is the only winning film not to be nominated for the Academy Award for Best Picture.\n* Braveheart, The Shape of Water, Green Book, and Nomadland are the only films not to be nominated for the award and still go on to win the Academy Award for Best Picture.\n* Out of the 30 winning films, 15 went on to win the Academy Award for Best Picture:\n** Shakespeare in Love\n** American Beauty\n** Chicago\n** The Lord of the Rings: The Return of the King\n** Crash\n** No Country for Old Men\n** Slumdog Millionaire\n** The King's Speech\n** Argo\n** Birdman\n** Spotlight\n** Parasite\n** CODA\n** Everything Everywhere All at Once\n** Oppenheimer\n* Three non-English language films have been nominated:\n** Life Is Beautiful\n** Parasite\n** Emilia Pérez\n* Eighteen nominated films were not nominated in any other category:\n** 3:10 to Yuma\n** Babylon\n** Bobby\n** Crazy Rich Asians\n** Don't Look Up\n** The Full Monty\n** Get Shorty\n** Hairspray\n** How to Make an American Quilt\n** Hustle & Flow\n** In America\n** The Lord of the Rings: The Return of the King\n** The Lord of the Rings: The Two Towers\n** Midnight in Paris\n** Moulin Rouge!\n** My Big Fat Greek Wedding\n** Parasite\n** Straight Outta Compton\n** Women Talking\nActors with the most nominations\n;7 nominations\n* Cate Blanchett\n* Leonardo DiCaprio\n* Brad Pitt\n;6 nominations\n* Russell Crowe\n* Meryl Streep\n;5 nominations\n* Chris Cooper\n* Judi Dench\n* Philip Seymour Hoffman\n* Allison Janney\n* John C. Reilly\n* Tom Wilkinson\nNote:\n* Cate Blanchett has the most consecutive nominations (four, from 2001 to 2004).\n* Leonardo DiCaprio has the most nominations without ever winning (seven).\nActors with double nominations in one year\n* Ed Harris (1995, won for Apollo 13)\n* David Paymer (1995)\n* John C. Reilly (2002, won for Chicago)\n* Meryl Streep (2002)\n* Christopher \"Ludacris\" Bridges (2005, won for Crash)\n* Terrence Howard (2005, won for Crash)\n* Martin Sheen (2006)\n* Josh Brolin (2007, won for No Country for Old Men)\n* Russell Crowe (2007)\n* Benedict Cumberbatch (2013)\n* Edward Norton (2014, won for Birdman)\n* Mahershala Ali (2016, won for Hidden Figures)\n* Janelle Monáe (2016, won for Hidden Figures)\n* Lucas Hedges (2017, won for Three Billboards Outside Ebbing, Missouri)\n* Caleb Landry Jones (2017, won for Three Billboards Outside Ebbing, Missouri)\n* Al Pacino (2019)\n* Margot Robbie (2019)\n* Chadwick Boseman (2020)\n* Issa Rae (2023)\nActors with multiple wins\n;3 wins\n* Michael Keaton: Birdman (2014), Spotlight (2015),  The Trial of the Chicago 7 (2020)\n;2 wins\n* Ben Affleck: Shakespeare in Love (1998), Argo (2012)\n* Alan Arkin: Little Miss Sunshine (2006), Argo (2012)\n* Christine Baranski: The Birdcage (1996), Chicago (2002)\n* Don Cheadle: Traffic (2000), Crash (2005)\n* Colin Firth: Shakespeare in Love (1998), The King's Speech (2010)\n* Michael Gambon: Gosford Park (2001), The King's Speech (2010)\n* Woody Harrelson: No Country for Old Men (2007), Three Billboards Outside Ebbing, Missouri (2017)\n* Derek Jacobi: Gosford Park (2001), The King's Speech (2010)\n* Allison Janney: American Beauty (1999), The Help (2011)\n* Kelly Macdonald: Gosford Park (2001), No Country for Old Men (2007)\n* Ryan Phillippe: Gosford Park (2001), Crash (2005)\n* Geoffrey Rush: Shakespeare in Love (1998), The King's Speech (2010)\n* Andy Serkis: The Lord of the Rings: The Return of the King (2003), Black Panther (2018)\n* Octavia Spencer: The Help (2011), Hidden Figures (2016)\n* Emma Stone: The Help (2011), Birdman (2014)\n* Stanley Tucci: Spotlight (2015), Conclave (2024)\n* Tom Wilkinson: The Full Monty (1997), Shakespeare in Love (1998)\n* Catherine Zeta-Jones: Traffic (2000), Chicago'' (2002)\nSee also\n* Academy Award for Best Picture\n* Golden Globe Award for Best Motion Picture – Drama\n* Golden Globe Award for Best Motion Picture – Musical or Comedy\n* BAFTA Award for Best Film\n* Critics' Choice Movie Award for Best Acting Ensemble\n* Critics' Choice Movie Award for Best Picture\n* Independent Spirit Award for Best Film\nReferences\nExternal links\n* [http://www.sagawards.org SAG Awards official site]"
    }
  ]
}