{
  "content": [
    {
      "type": "text",
      "text": "# Scriba (ancient Rome)\n\nIn ancient Rome, the scriba (Latin; : scribae) was a public notary or clerk (see also scrivener). The public scribes were the highest in rank of the four prestigious occupational grades (decuriae) among the apparitores, the attendants of the magistrates who were paid from the state treasury. The word scriba might also refer to a man who was a private secretary, but should be distinguished from a copyist (who might be called a \"scribe\" in English) or bookseller (librarius).\nIn Rome the scribae worked out of the aerarium, the state treasury and government archive. They received a good salary, but could earn additional commissions for collecting and recording state revenues, and making official copies of government documents and decrees. The Roman posting was such a lucrative assignment that the scribae worked in rotations, serving one year in Rome and two in the provinces. Those who became scribes might be freedmen (libertini) and their sons; literary or educated men who advanced to the job through patronage; or even men of the equestrian order.\nAmong the scribe's duties was the recording of sworn oaths on public tablets. As a magistrate's attendant, he might also assist in religious rituals; for instance, since the exact wording of a prescribed prayer was considered vital to its success, a scribe might prompt the presiding magistrate by reading it out as recorded on official tablets.\nBy the end of the 4th century BC, the office evidently afforded several advantages, including a knowledge of Roman law that was traditionally the privilege of the elite, and the ability to trade favors that could be translated into political capital. In 305 BC, the public scribe Gnaeus Flavius, the son of a freedman, shocked the Roman upper classes by winning election as curule aedile for the following year. Though not the first plebeian to hold the office, his victory, made possible by the growing number of freedmen and those of libertine descent among the urban population, prompted the censors of 304 BC to adopt voter registration policies that curtailed the political power of the lower orders.\nGaius Cicereius, a former scriba of Scipio Africanus, was elected praetor in 173 BC, and enjoyed greater popularity than Scipio's own son. Certainly by the late Republic, the scribae had become a well-organized group who had achieved or were near to equestrian status.\nThe scriba Sextus Cloelius kept a high profile as an agent of the popularist Clodius Pulcher. At the beginning of Clodius's year in office as tribune of the plebs in 58 BC, Cloelius organized ludi compitalicii, neighborhood new-year festivities that had been banned as promoting unrest and political subversion. Cloelius also led the people in riots when Clodius was murdered a few years later, taking his body to the senate house and turning it into the popular leader's funeral pyre.\nThe Augustan poet Horace introduced himself in his first published book as the son of a freedman and as a civil servant, specifically a scriba quaestorius, or clerk to the quaestors who were in charge of the public treasury.\nFurther reading\n* E. Badian, \"The scribae of the Roman Republic,\" Klio 7 (1989) 582–603.\nReferences"
    }
  ]
}