{
  "content": [
    {
      "type": "text",
      "text": "# Seadragon Software\n\nSeadragon Software was a team within the Microsoft Live Labs. Its product, Seadragon, is a web optimized visualization technology that allows graphics and photos to be smoothly browsed, regardless of their size.  Seadragon is the technology powering Microsoft's Silverlight, Pivot, Photosynth and the standalone cross-platform Seadragon application for iPhone and iPad.\nSeadragon technology allows one to view extremely large and high resolution images without the loading time or latency typically associated with large images.  The developers behind Seadragon also allow users to upload photos and create their own Seadragon style image to be viewed online.\nHistory\nFounded in 2003, the company that would eventually become Seadragon Software was originally named Sand Codex.  Based in Princeton, New Jersey, Sand Codex moved to Seattle in 2004 to accommodate founder Blaise Agüera y Arcas's wife's new role at the University of Washington.\nIn 2005 Sand Codex received $4 million in  angel and venture capital funding, including $2 million from the Madrona Venture Group.  It was after this injection of capital that the company changed its name to Seadragon Software.\nIn early 2006, Seadragon Software was acquired by Microsoft and organized within the newly formed Live Labs, a midpoint between Microsoft's online product groups and MSR, under Gary William Flake.\nSilverlight 2 released in 2008 with the Deep Zoom feature.  This marked the first publicly shipped Seadragon software.  Seadragon made further contributions in Silverlight 3 and announced others for Silverlight 4.\nPhotosynth launched the summer of 2008; almost 2 years after its Community Technology Preview, the public can now create and view synths. The Photosynth team officially broke off from Seadragon to join MSN.\nImplementations\nSeadragon Ajax is a pure JavaScript implementation of the Seadragon technology, released by Microsoft as an open-source library. It is now under active development as OpenSeadragon.\nThe Deep Zoom feature of Microsoft's Silverlight technology is an adaptation of Seadragon technology.\nSeadragon Mobile was an iPhone app (no longer available) created from Seadragon technology.\nHow Seadragon works\nSeadragon technology is based around two distinct platforms, one being Asynchronous JavaScript and XML, the other being Microsoft’s Silverlight with DeepZoom application. Using the Silverlight version requires that the user downloads the Microsoft Silverlight application. Alternatively, the AJAX version requires only the standard JavaScript web plug-ins available in most browsers and portable devices.  AJAX technology has allowed for the increased interaction and rich user experiences which are typically characteristic of Web 2.0 enabled websites.\nFor the creation of Seadragon style content and images, when one uploads a picture, it is converted into a number of Deep Zoom Image (DZI) format files.  These can be combined to make up a Deep Zoom Collection (DZC). These Deep Zoom Images create a digital tiled mosaic, of small (256x256) images, with each tile representing a portion or layer or set of pixels of the image at one specific resolution.  This Deep Zoom format allows for only the pixels needed for a particular view on the screen to be loaded at one particular time&nbsp;– this results in a more effective use of bandwidth and computer resources.  This also means that the amount of data needing to be transferred at any one time is proportional to the number of pixels on the screen. This is an alternative to loading all the pixels (data) of an image all at once with standard image formats.  The figurative “secret sauce” behind Seadragon is the technology that allows for the seamlessly smooth transition between the tiles and layers amongst the DeepZoom collection (DZC) files that make up an image.\nFile format\nAll current implementations of Seadragon technology make use of the Deep Zoom Images, consisting of either a single Deep Zoom Image or a Deep Zoom Collection.\nExamples\n* Photosynth uses Seadragon for its D3D viewer and Silverlight for its default viewer.\n* Pivot uses a combination of Seadragon and WPF to render images and collections.\n* ChronoZoom is a timeline for Big History being developed for the International Big History Association by Microsoft Research and originally by the University of California, Berkeley and Microsoft Live Labs\n*  is the Bing search app for the iPhone.  The mapping experience is built on top of the Seadragon Mobile.\n* SimpleDL uses Ajax Seadragon for its image display.\nReferences\nExternal links\n*\n*[http://gallery.expression.microsoft.com/SeadragonAjax Seadragon Ajax]\n*[https://openseadragon.github.io/ OpenSeadragon]\n*[https://zoomable.ca/ Zoomable] - conversion tool, API available\n*[http://seadragon.com/showcase The Seadragon Showcase page] lists a number of examples live on the web."
    }
  ]
}