{
  "content": [
    {
      "type": "text",
      "text": "# Seagull Monument__disambig_1\n\nThe Seagull Monument is a historic monument situated immediately east of the Salt Lake Assembly Hall on Temple Square, in Salt Lake City, Utah. Created by artist Mahonri Young, the monument commemorates an 1848 event in which seagulls were observed to devour crop-destroying Mormon crickets, following prayers for divine intervention against the insects. This event is referred to as the miracle of the gulls in the culture of the Church of Jesus Christ of Latter-day Saints (LDS Church).\nThe work was placed on Temple Square in 1913 and is believed to be the first monument dedicated to birds in the United States.\nMiracle of the gulls\nIn 1848, the Mormon pioneers planted crops during their first spring season living in the Salt Lake Valley. As the crops matured, Mormon crickets descended upon the farms and consumed entire fields. The harvest was saved when the pioneer settlers offered prayers to God for assistance, which prayers were believed to be answered when flocks of native seagulls devoured the crickets. This event, popularly called the \"miracle of the gulls,\" is remembered by Latter-day Saints as a miracle.\nHistory\nCreation\nThe idea for a monument commemorating the miracle came from George E. Carpenter, an editor at the Deseret News, and was inspired by a request he made for Young to create seagull drawings for the 1907 Christmas Edition of the newspaper. After the monument had been conceived of in July 1907, Young had its basic design completed within ten days. During that fall's Utah State Fair, a model of the monument was exhibited.\nInitially, Young tried to get the church to finance the project, but funds were not available. While the monument was being pitched, there were a number of locations proposed for its placement, including both Temple Square and Liberty Park. The local Manufacturers and Merchants' Association was very interested in getting the monument erected, and started, in 1908, a subscription list to support its creation. Young made another request to church leadership after he had completed the statues of Joseph and Hyrum Smith for Temple Square in 1909, but the church was constructing the Hotel Utah and again could not support the monument's creation. A few years later, and desperate for work, Young approached church leadership once more and pleaded with them to fund the project. This time his request was approved, and in July 1912, the church, represented by Presiding Bishop Charles W. Nibley, signed the contract providing for the creation of the monument, with its placement to be on Temple Square.\nThe site initially proposed for the monument, just south of the Salt Lake Temple, was not satisfactory to Young, who felt the monument would be dwarfed by the large building. Instead he selected a spot near the Assembly Hall, where the open sky could provide a better background for the monument, and church leaders approved. Excavation for the monument's foundation began in April 1913, with the original plan being to dedicate the completed work on July 24 (Pioneer Day in Utah). Eight pieces of granite stone, which made up the base, shaft, and capital of the monument were put in place in June. The granite pieces came from a quarry in Mount Airy, North Carolina and weighed . Towards the end of September, Young arrived with the bronze pieces which were then placed on the monument.\nDedication\nOn October 1, 1913, the monument was dedicated in a ceremony presided over by Bishop Nibley and attended by an estimated 5,000 persons. Prior to the unveiling, three American flags concealed the gulls atop the monument and bronze panels on the pedestal. At 10:50 am, Emmeline B. Wells, president of the church's Relief Society, pulled the cords to release the flags, revealing the works of art to the gathered crowd. Wells had witnessed the 1848 miracle as a 21-year-old woman, and she spoke briefly following the unveiling. William W. Riter then gave a history of the miracle, after which the band played The Star-Spangled Banner. The artist was then introduced to the crowd, and thereafter church President Joseph F. Smith addressed the crowd and gave the dedicatory prayer. The Mormon Tabernacle Choir then sang Utah, We Love Thee and Francis M. Lyman closed the ceremony with a benediction.\nLater history\nWhen first placed on Temple Square, the monument was surrounded by a pool of water which contained water lilies and goldfish. The goldfish, confined in the pool, became easy food for live seagulls. The birds regularly cleared the water of the fish, so in 1944 they were replaced with larger rainbow trout. The trout were fed poisoned wheat by an unknown perpetrator, or perpetrators, on multiple occasions, and eventually fish were removed entirely from the pool.\nThe pool saw several alterations throughout the years. In 1968, circular fountains were added within the pool. For many years, coins tossed into the water were periodically collected and donated by the church to nearby Primary Children's Hospital. In 2008, the pool was replaced with a cascading water feature. In early 2024, the entire monument was temporarily removed from Temple Square, to allow for new landscaping as part of the multi-year renovation of the square and the Salt Lake Temple. When it was returned later that year, the pool had been replaced with flower beds and the gold leafing on the seagull sculpture atop the monument had been removed.\nThe monument is featured in the 1940 film, Brigham Young.\nDesign\n]]\nThe monument consists of a granite pedestal with a column topped by a large granite ball. Atop the ball is a bronze sculpture of two seagulls, which measure  from wing tip to wing tip. When the monument was first placed on the square, the two seagulls were gilded with gold leaf and a circular pool of water,  in diameter and filled with water lilies and goldfish, surrounded the pedestal.\nAround the monument's pedestal are four bronze relief panels, telling the story of the miracle of the gulls. The first panel, titled The Founding of the Commonwealth, depicts the early cultivation and settlement of Salt Lake Valley. It contains a scene with two oxen pulling a plow and behind follows the sower, to the right of the plowing is a woman preparing food near a temporary wagon-box home. Mount Olympus and the Twin Peaks are visible in the background and in the foreground is a seated Native American. The second panel, titled The Arrival of the Sea Gulls, features a disheartened pioneer man stooping down, while a woman, holding the hand of a child, looks towards the coming seagulls with hope; the northern end of the Oquirrh Mountains is visible in the background. The third panel, titled The First Harvest, depicts the harvesting of the miraculously-preserved crops. A man with a scythe is visible, while there are others binding the sheaves. In the foreground is a nursing mother, with a child and dog at her feet, while the background shows the first home built in the valley, with Ensign Peak above. The fourth panel contains a dedicatory inscription.\n/ The Plowing\n| image2            = Seagull Monument at Temple Square - Bronze Panel 2, 'The Arrival of the Sea Gulls' - 18 April 2025 (cropped).jpg\n| caption2          = The Arrival of the Sea Gulls / Deliverance\n| image3            = Seagull Monument at Temple Square - Bronze Panel 3, 'The First Harvest' - 12 April 2020.jpg\n| caption3          = The First Harvest / The Harvesting\n| image4            = Seagull Monument at Temple Square - Bronze Panel 4, 'Inscription' - 12 April 2020.jpg\n| caption4          = Monument inscription\n}}\nReferences\nBibliography\n*\n*\nFurther reading\n*\nExternal links\n*\n*[https://ensignpeakfoundation.org/seagull-monument/ Seagull Monument], Ensign Peak Foundation website\n*[https://web.archive.org/web/20130403114357/http://www.allaboutmormons.com/ENG_templesquare.php?info=._TempleSquare_SouthCorridor_2a.dat An on-line tour of Temple Square] from allaboutmormons.com"
    }
  ]
}