{
  "content": [
    {
      "type": "text",
      "text": "# Seasons of War__disambig_1\n\nSeasons of War is the first film directed by Seda Eğridere. The script was written by Eğridere and Mark Harley. Production for Seasons of War took place in Sarajevo in July 2014, and the film was scheduled to premiere at the 2015 Sarajevo Film Festival.\nCast\n* Adnan Novo (as Damir)\n* Sanja Popovic (as Jelena)\n* Seda Eğridere\n* Dina Ganic\n* Sara Stambol\n* Sacha Ferer Gonzales\nBackground\nWork on Seasons of War commenced in 2014. The film's plot was conceived by director Seda Eğridere while she was traveling in the Balkans and Bulgaria to research the history of her family during the 1950s through 1970s. Drawing parallels between her family experience and the experiences of local Sarajevans in Bosnia and Herzegovina, Seda Eğridere wrote the script for Seasons of War with writing partner Mark Harley. The script is based on true events of the Bosnian War.\nProduction\nProduction took place in Sarajevo over the course of three weeks in July 2014. Eğridere cast only actors from the former Yugoslavia, most of whom had lived through the war and were therefore able to incorporate their experiences into their performances. Film production was delayed due to the 2014 Southeast Europe floods. In response to the tragedy, Eğridere called on fans via Twitter and Facebook to aid in flood relief by donating funds through the film's Indiegogo campaign. Before production started, comparisons were drawn between Seasons of War and Angelina Jolie's directorial debut, In the Land of Blood and Honey. In response to these comparisons, Eğridere conveyed that she respected Jolie's film and her work as both a director and scriptwriter, but stressed that Seasons of War was a completely different story; not a war film, but rather a film about a couple and the difficult choices they were forced to make.\nSoundtrack\nThe complete soundtrack of Seasons of War was arranged by Yasin Aydın and Kemal Eren of the Turkish rock band PUL, with which Eğridere had collaborated on a music video in 2012.\nReferences\nExternal links\n*"
    }
  ]
}