{
  "content": [
    {
      "type": "text",
      "text": "# SECA Art Award\n\nThe SECA Art Award is a contemporary art award program that has been organized by the San Francisco Museum of Modern Art (SFMOMA) and supported by its auxiliary SECA (Society for the Encouragement of Contemporary Art) since 1967 to honor San Francisco Bay Area artists. It includes an SFMoMA exhibition, an accompanying catalogue, and a modest cash prize. The SECA Art Award distinguishes “artists working independently at a high level of artistic maturity whose work has not, at the time of recommendation, received substantial recognition.\"\nCurrently, the SECA Art Award exhibition occurs biennially. Two SFMoMA assistant curators make the selection of finalists and award winners and co-organize the SECA Art Award exhibition.\nThe high-profile, ongoing exhibition series often provides artists with their first major exposure at a large institution. A number of past Art Award recipients and finalists are represented in SFMoMA's permanent collection and have been included in collection-based presentations.\nAbout\nSECA (also known as, the Society for the Encouragement of Contemporary Art) group was originally founded in 1961 as an auxiliary of the San Francisco Museum of Modern Art in order to find young artists. The art interest group brings together collectors, curators, arts professionals, and artists through a variety of events that strengthen members' knowledge of contemporary art and appreciation of the local art community. By 1976, the SECA group began awarding prizes. Winning the award gives professional recognition to San Francisco Bay Area artists and allows them to secure funds for a new commission and an exhibition at SFMOMA.\nSECA Art Award history\n* The SECA group was founded in 1961 as an auxiliary of SFMOMA by a group of 75 male artists, and originally the group was only for men.\n*By 1966, the SECA Art Award started to allow women to join the group.\n*In 1976, SECA began awarding prizes to individual Bay Area artists. Initially bestowed upon individuals, the awards evolved into awards combined with small group shows.\n* Studio visits were introduced in 1981 as part of the art award selection process.\n* Beginning in 1988, recommendations solicited from Bay Area art professionals and SECA members are introduced to the search process.\n* In 1995, the evaluation process involving the selection of the finalists and the choice of award recipients was modified to include greater input from SFMOMA's Department of Painting and Sculpture. The selection of award finalists and award recipients would be made by two SFMOMA curators rather than the SECA membership.\n* A Film award was introduced in 1973 and was held irregularly until its last occurrence in 1998. A Photography award was added in 1976 and last held in 1982. A Video award was added in 1988 and was last held in 1992. An Electronic Media award was held once in 1996, and an Architecture and Design award was also held once in 2001.\n* On the occasion of the Museum's 75th anniversary, The Anniversary Show exhibition dedicates the SECA and The Mission School gallery to artworks from the collection by a selection of past SECA winners (1996–2006).\n* In 2010, the application language was modified to accept artworks in all media.\n* On the occasion of the fiftieth anniversary of SECA in December 2011, SFMOMA published a comprehensive book on the history of the award program at SFMOMA Fifty Years of Bay Area Art: The SECA Awards.\n* The 2012 SECA Art Award cycle coincided with SFMOMA's temporary building closure for expansion construction. For this unique offsite iteration of the award exhibition, SFMOMA commissioned all four recipients to create new work and to present it outside of the traditional gallery context. Encompassing a wide range of media, these diverse projects were installed in various non-art spaces of the artists’ choosing in San Francisco and Oakland.\nList of SECA Art Award winners\n*1967: Mel Henderson\n*1968: Peter Zecher;\n*1969: William Allan;\n*1970: James Reineking;\n*1971: Wayne E. Campbell;\n*1973: David Anderson, Special Recognition: David Jones, Jim Pomeroy;\n*1974: Charles Garoian, Jerome Johnson, David Jones, Bryan Rogers, and Mary Snowden;\n*1975: Cheryl Bowers (Ciel Bergman), Lucian Octavius Pompili, and Cornelia Schulz;\n*1976: David Maclay;\n*1977: David Best, Michael Cooper, Glenn Jampol, and Miklos Pogany;\n*1978: Milton Komisar;\n*1980: Squeak Carnwath, Suzanne Hanson, and Seth Seiderman;\n*1981: Marc Katano, George Lawson, and Margaret Rinkovsky;\n*1982: Lynda Frese;\n*1983: Clay Jensen;\n*1984: Larry Thomas;\n*1985: Richard Overstreet and Rick Soss;\n*1986: Ev Thomas;\n*1987: Anna Valentina Murch;\n*1988: Susan Marie Dopp;\n*1990: Nayland Blake and John Meyer;\n*1992 – 25th Anniversary: Hung Liu, John Beech (artist), and Maria Porges;\n*1994: Toi Hoang;\n*1996: D-L Alvarez, Anne Appleby, and Barry McGee;\n*1998: Chris Finley, Gay Outlaw, Laurie Reid, and Rigo 23 (Rigo 98);\n*2000: Rachael Neubauer and Kathryn VanDyke;\n*2002: John Bankston, Andrea Higgins, Chris Johanson, Will Rogan;\n*2004: Josephine Taylor, Shaun O’Dell, Simon Evans, Rosana Castrillo Diaz;\n*2006: Sarah Cain, Kota Ezawa, Amy Franceschini, Mitzi Pederson, Leslie Shows;\n*2008: Tauba Auerbach, Desiree Holman, Jordan Kantor, Trevor Paglen;\n*2010: Mauricio Ancalmo, Colter Jacobsen, Ruth Laskey, Kamau Amu Patton;\n*2012: Zarouhie Abdalian, Josh Faught, Jonn Herschend, David Wilson;\n*2017: Alicia McCarthy, Lindsey White, Liam Everett, K.R.M. Mooney, Sean McFarland\n*2019: Kenyatta A.C. Hinkle, Sahar Khoury, Marlon Mullen\n*2022: Binta Ayofemi, Maria Guzmán Capron, Cathy Lu, Marcel Pardo Ariza, Gregory Rick\nReferences\nExternal links\n*[https://web.archive.org/web/20081202123416/http://www.sfmoma.org/pages/seca_art_award Official site]"
    }
  ]
}