{
  "content": [
    {
      "type": "text",
      "text": "# Seckington\n\n|os_grid_reference= SK2607\n|label_position= top\n|population= 59\n|population_ref= (2001 Census)\n|civil_parish= Seckington\n|shire_district= North Warwickshire\n|shire_county= Warwickshire\n|region= West Midlands\n|country= England\n|post_town= Tamworth\n|postcode_district= B79\n|postcode_area= B\n|dial_code= 01827\n|constituency_westminster= North Warwickshire\n|website=\n}}\nSeckington is a village and civil parish in North Warwickshire, about  northeast of Tamworth. The B5493 road between Tamworth and Appleby Magna runs through the parish, passing about  north of the village. Seckington shares a parish council with Newton Regis and No Man's Heath. Forming part of the border with Staffordshire, it is the second most northerly settlement in Warwickshire, with only No Man's Heath situated further north, and is only 3.5 miles due south of the Derbyshire border.\nEarly history\nof Seckington Castle]]\nIn 757 King Æthelbald of Mercia was assassinated at Secandune (Seckington). Continuations of the Historia ecclesiastica gentis Anglorum say he \"was treacherously and miserably murdered, in the night, by his own guards\". The Domesday Book of 1086 records Secintone as a vill with a manor of five hides.\nCastle\nSeckington Castle is a motte-and-bailey castle believed to have been built in the late 11th century for either Roger de Beaumont, Earl of Meulan or his son Robert de Beaumont. In the late 17th century the antiquary Sir William Dugdale (1605–86) described, measured and recorded the castle in detail. Since 1923 the castle has been protected as a scheduled monument. The motte is now about  high and its diameter is about  at the base. The bailey is south and east of the motte. The castle is surrounded on three sides by traces of ridge and furrow cultivation.\nParish church\nThe Church of England parish church of All Saints is probably mid- to late-13th century in origin, but was significantly altered in a late 19th-century Victorian restoration. The west tower and spire were rebuilt in 1883, re-using much of the original material. The bell-openings are Early English, the ogeed west window is Decorated Gothic and the parapet and spire are Perpendicular Gothic. The spire has two sets of lucarnes. The nave and chancel are Decorated Gothic with 14th-century windows. The chancel east window has five lights and intersecting tracery, and is said to have been widened in the restoration.\nThere is extensive use of ogees. As well as in the west window of the nave, ogees feature in two south windows of the nave, one south and two north doorways and a double piscina in the chancel. All Saints had a rood screen and rood loft, traces of which are visible in the east wall of the nave on both sides of the chancel arch. Outside, on the south wall of the nave east of the porch is a scratched mass dial. All Saints' church monuments include a defaced recumbent effigy of a lady in early 14th-century dress, and a Jacobean wall-mounted monument to Robert Burdett, who died in 1603. He is an ancestor of the Burdett baronets. His monument is of veined marble, with Corinthian columns flanking kneeling figures of his family.\nThe west tower has a ring of four bells. Robert Mellours of Nottingham cast the treble bell in about 1520; it is inscribed with the name IESUS. Hugh II Watts of Leicester cast the tenor bell in about 1640. John Taylor & Co of Loughborough cast or re-cast the second and third bells in 1886 for the rebuilt tower. The ring is unusual in that the third bell, not the tenor, has the largest diameter. All Saints has been a Grade II* listed building since 1953. All Saints is now part of the Benefice of All Souls, which also includes the former parishes of St Nicholas, Austrey; St Mary the Virgin, Newton Regis; St Matthew, Shuttington and Holy Trinity, Warton.\nOther listed buildings\nSeckington has four Grade II listed buildings. Rock Farmhouse is partly 17th century, with late 18th century additions. Old Hall Farmhouse is late 17th or early 18th century, with late 18th and early 19th century additions. The Old Rectory was 18th century but was largely rebuilt in about 1870. Church Farmhouse is late 18th or early 19th century.\nReferences\nSources\n*\n*\n*"
    }
  ]
}