{
  "content": [
    {
      "type": "text",
      "text": "# Second Convocation of the State Duma of the Russian Empire\n\n*Russian Social Democratic Labour Party\n*Trudoviks\n*All-Russian Peasant Union\n*Socialist Revolutionary Party\n*Constitutional Democratic Party\n*Party of Democratic Reform\n*Nonpartisan\n*Polish Kolo and other unions\n*Union of October 17 and moderates\n*Right-wing deputies\n| body                  = State Duma of the Russian Empire\n| meeting_place         =\n| jurisdiction          =\n| election              =\n| government            =\n| opposition            =\n| term_start            = February 20\n| term_end              = June 3, 1907\n| before                = 1st convocation\n| after                 = 3rd convocation\n| website               =\n| chamber1              =\n| chamber1_image        =\n| chamber1_image_size   =\n| chamber1_alt          =\n| membership1           = 518 deputies\n| control1              = Trudoviks (104 deputies)\n| chamber1_leader1_type = Chairman of the State Duma\n| chamber1_leader1      = Fyodor Golovin\n| chamber1_leader2_type =\n| chamber1_leader2      =\n| chamber1_leader3_type =\n| chamber1_leader3      =\n| chamber1_leader4_type =\n| chamber1_leader4      =\n| chamber2              =\n| chamber2_image        =\n| chamber2_image_size   =\n| chamber2_alt          =\n| membership2           =\n| control2              =\n| chamber2_leader1_type =\n| chamber2_leader1      =\n| chamber2_leader2_type =\n| chamber2_leader2      =\n| chamber2_leader3_type =\n| chamber2_leader3      =\n| chamber2_leader4_type =\n| chamber2_leader4      =\n| session1_start        =\n| session1_end          =\n}}\nThe State Duma of the Russian Empire of the Second Convocation was a representative legislative body of the Russian Empire (State Duma of the Russian Empire), convened after the early dissolution of the State Duma of the 1st convocation. It was elected according to the same rules as the previous Duma and also entered into a sharp confrontation with the Council of Ministers, and also held only one session, from February 20 to June 3, 1907, when it was dissolved (Coup of June 1907). After that, the electoral legislation was changed. The State Duma of the 2nd convocation worked for 102 days.\nElections\nThe Second State Duma of the Russian Empire existed from February 20 to June 2, 1907. Elections to the Second Duma were held according to the same rules as in the First Duma (multi-stage elections for curia). At the same time, the election campaign itself took place against the background of a fading but continuing revolution: \"agrarian soil riots\" in July 1906 covered 32 provinces of Russia, and in August 1906 50% of counties in European Russia were involved in peasant unrest.\nWithin 8 months the revolution was suppressed. According to the Law of October 5, 1906, the peasants were equal in rights with the rest of the population of the country. The Second Land Law of November 9, 1906 allowed any peasant at any time to demand the share of communal land due to him. According to the \"Senate clarifications\" of the electoral law (January–February 1907), part of the workers and small landowners was excluded from the elections to the Duma.\nThe government in any way sought to ensure an acceptable Duma composition: peasants who were not householders were excluded from the elections, workers could not be elected in the city curia, even if they had the apartment requirement required by law, etc. On the initiative of Pyotr Stolypin, the question of changing the electoral legislation (July 8 and September 7, 1906) was discussed twice in the Council of Ministers, but government members came to the conclusion that such a step was not appropriate because it was associated with a violation of the Fundamental Laws and could lead to an aggravation of the revolutionary struggle.\nThis time, representatives of the entire party spectrum, including the extreme left, participated in the elections. In general, four currents fought: the right-wing politicians, standing for the strengthening of autocracy; Octobrists who adopted the Stolypin program; cadets; the left bloc that united the Social Democrats, the Social Revolutionaries and other socialist groups. Many noisy pre-election meetings were held with \"disputes\" between the Cadets, the Socialists and the Octobrists. And yet the election campaign was different in nature than in the previous elections to the Duma. Then nobody defended the government. Now the struggle was within the society between the electoral blocs of the parties.\nA solemn prayer service in honor of the opening of the Second State Duma and the first meeting took place on February 20, 1907.\nComposition\nA total of 518 deputies were elected. Deputies were distributed as follows:\n*by age: up to 30 years – 72 people, 30–40 years old – 123 people, 40–50 years old – 175 people, 50–60 years old – 140 people, over 60 years old – 8 people.\n*by education level: 38% of deputies had higher education, 21% – secondary, 32% – lowest, 8% – home-based, 1% – illiterate.\n*by occupation: 169 peasants, 32 workers, 20 priests, 25 zemsky city and noblemen servants, 10 small private servants, 1 poet, 24 civil servants (including 8 from the judiciary), 3 officers, 10 professors and associate professors, 28 other teachers, 19 journalists, 33 lawyers (advocacy), 17 merchants, 57 noble landowners, 6 industrialists and factory directors.\nOnly 32 members of the Duma (6%) were deputies of the first Duma. Such a small percentage was explained by the fact that after the dissolution of the First Duma, 180 deputies signed the Vyborg Manifesto, for which they were deprived of voting rights and could not participate in the new elections.\nThe participation in elections of a greater number of political forces led to a greater diversity of political forces in comparison with the previous Duma. According to party factions, they were distributed as follows: the labor peasant faction – 104 deputies, which consisted of the actual Trudoviks – members of the Labor Group (71 people), members of the All-Russian Peasant Union (14 people) and sympathizers (19), Cadets – 98, Social Democratic fraction – 65, non-party – 50, Polish Kolo – 46, the Octobrist faction and the moderate group – 44, the Revolutionary Socialists – 37, the Muslim faction – 30, the Cossack group – 17, the Popular Socialists – 16, the right-wing monarchists – 10, one deputy belonged to the Party of Democratic Reform.\nThe right cadet Fyodor Aleksandrovich Golovin elected from the Moscow Province became the chairman of the Duma. Nikolai Poznansky (non-party left) and Mikhail Berezin (the Trudovik) became deputy chairmen. The secretary was Mikhail Chelnokov (cadet).\nWork of the Duma\nwith Joseph Hessen. At the table, dropping the ministerial uniform, sits Nikolai Kutler; in front of him are deputies Alexander Kizevetter and Semen Nechitailo; behind his back is Grigory Aleksinsky. In the burka – companion chairman Nikolai Poznansky. Among others, the deputy Ivan Pyanykh and others.]]\nThe Duma continued the struggle for influence on the activities of the government, which led to numerous conflicts and was one of the reasons for the short period of its activities. In general, the Second Duma turned out to be even more radical than its predecessor. Deputies changed tactics, deciding to act within the bounds of the rule of law. Guided by the norms of Articles 5 and 6 of the Statute on the approval of the State Duma of February 20, 1906, deputies formed departments and commissions for the preliminary preparation of cases to be considered in the Duma. The created commissions have started the development of numerous bills. The main issue remained the agrarian question, according to which each faction presented its own project. In addition, the Second Duma actively considered the food question, discussed the State budget for 1907, the question of calling for new recruits, about the abolition of field-military courts, etc. During the consideration of questions, the cadets showed flexibility, calling for \"taking care of the Duma\" and not giving the government a reason for its dissolution.\nThe main subject of debate in the Duma in the spring of 1907 was the question of taking extraordinary measures against revolutionaries. On May 17, 1907 Duma voted against the \"illegal actions\" of the police. Such disobedience did not suit the government. The Office of the Ministry of the Interior has prepared a draft of the new electoral law secretly from the Duma. On June 1, 1907, Pyotr Stolypin demanded the removal of 55 Social Democrats from participation in Duma meetings and depriving 16 of them of parliamentary immunity, accusing them of preparing for the \"overthrow of the state system\" and conspiracy against the royal family.\nOn the basis of this, Nicholas II, on June 3, 1907, announced the dissolution of the Second Duma and the amendment of the electoral law. Deputies of the Second Duma went home. As Peter Stolypin expected, there was no revolutionary flash. It is generally accepted that the act of June 3, 1907 (Coup of June 1907) signified the completion of the Russian revolution of 1905–07.\nResults\nIn general, the legislative activity of the second Duma for 102 days, as in the case of the first State Duma, bore traces of political confrontation with the authorities.\n287 government bills were submitted to parliament (including the budget for 1907, the bill on the reform of the local court, the responsibility of officials, the agrarian reform, etc.). The Duma approved only 20 bills. Of these, only 3 received the force of law (on the establishment of a contingent of recruits and two projects to help victims of crop failure).\nInteresting facts\n*Vladimir Lenin in 1907 acted without success as a candidate for the 2nd State Duma in St. Petersburg.\n*On March 2, 1907, a ceiling collapsed in the Duma meeting room. It happened in the early morning, so none of the deputies was hurt.\n*The deputy of the Second State Duma, Aleksey Kuznetsov, later became famous for being a gunner in a criminal group that committed a series of robberies, including robbery of the Stroganov Palace.\nFile:Bessarab 2 Duma.jpg|Bessarabian Province\nFile:Vitebsk Duma2.jpg|Vitebsk Province\nFile:Vladimir 2 Duma.jpg|Vladimir Province\nFile:Вологодская 2дума.jpg|Vologda Province\nFile:2nd Duma Volynskaya.jpg|Volyn Province\nFile:Vyatka D2.jpg|Vyatka Province\nFile:Donskaya 2D.jpg|Region of the Don Army\nFile:Kazanskaya 2D.jpg|Kazan Province\nFile:LietuviaiIIRD.jpg|Kovno and Suvalk Provinces\nFile:Kostromskya.jpg|Kostroma Province\nFile:Kursk D2.jpg|Kursk Province\nFile:Novgorod.jpg|Novgorod Province\nFile:Члены 2 Государственной думы от Пермской губернии 1907.jpg|Perm Province\nFile:Samara 2 Duma.jpg|Samara Province\nFile:Tobol Guberniya D2.jpg|Tobolsk Province\nFile:Chernigov D2.jpg|Chernigov Province\nFile:Депутаты II Думы от Харкьковской губернии.jpg|Kharkov Province\nFile:Yaroslavl Guberniya 2 D.jpg|Yaroslavl Province\nFile:Deputats II Duma muslim fraction.jpg|Muslim faction\nFile:Групповой портрет политической фракции кадетов во II Думе (1907).jpg|Cadet faction\nFile:Трудовая группа 2-й Государственной Думы на совещании фракции (Таврический дворец, Санкт-Петербург, 1907).jpg|Labor group\nFile:Фракция эсеров II Государственной Думы (1907).jpg|Socialist Revolutionary faction\nReferences\nOfficial documents of the Duma\n*[http://primo.nlr.ru/primo-explore/fulldisplay?vid=07NLR_VU1&docid=07NLR_LMS005274922&context=L&search_scope=default_scope&lang=ru_RU Stenographic reports. Meetings 1-30: (from February 20 to April 30)]\n*[http://primo.nlr.ru/primo-explore/fulldisplay?vid=07NLR_VU1&docid=07NLR_LMS010152749&context=L&search_scope=default_scope&lang=ru_RU Index to the verbatim records: meetings 1–53: (February 20 – June 2, 1907). State Duma, second convocation, 1907, second session]\n*\nSources\n*\n* Arshak Zurabov [http://elib.shpl.ru/ru/nodes/14460-zurabov-a-g-vtoraya-gosudarstvennaya-duma-vpechatleniya-spb-1908#page/1/mode/grid/zoom/1 Second State Duma: impressions] — St. Petersburg, 1908. — 181 p.\n*\nExternal links\n* [http://on-island.net/History/DumaII/DumaIIindex.htm Transcripts of the State Duma of the 2nd convocation]\n* [http://dlib.rsl.ru/viewer/01003732207 Members of the State Duma: portraits and biographies. Second convocation, 1907-1912] / compiled by Milan Bojevich. - Moscow: Typography of the partnership Ivan Sytin, 1907.\n*"
    }
  ]
}