{
  "content": [
    {
      "type": "text",
      "text": "# Second Battle of Mons\n\n| combatant2  =\n| commander1  =  Sir Arthur Currie\n| commander2  =  Unknown\n| strength1   = 6-8 Divisions\n| strength2   = 3-4 Divisions\n| casualties1 = 280 killed, wounded, or missing\n| casualties2 = Unknown\n| notes       =\n| campaignbox =\n}}\nThe Second Battle of Mons was a First World War military engagement fought between 9–11 November 1918, in which Canadian forces captured the Belgian town of Mons, re-capturing an area that had been under German occupation since 1914.  The capture was completed before the general armistice at 11:00 am.\nBackground\nBritain declared war on Germany on 4 August 1914 and on 9 August, the BEF began embarking for France.  The first Battle of Mons was undertaken by the British Expeditionary Force (BEF) on 23 August 1914, a subsidiary action of the Battle of the Frontiers.  With the first Victoria Cross of the war awarded, the British fighting retreat into France lasted two weeks.\nAfter the failure of the German spring offensive (21 March – 18 July 1918) and the Allied success at the Battle of Amiens (8–12 August 1918), the Entente began an aggressive series of offensives on the Western Front which would come to be known as the Hundred Days Offensive. The Germans were forced into a full retreat eastward. The Canadian Corps closed on Mons. A city of huge symbolic value to the Entente. British troops had staged a fighting retreat in the early days of the war, delaying the Germans in their advance towards Paris but suffering heavy casualties in the process. Mons had also been under German occupation for the entirety of the war and had been used as a critical logistical centre. Now, the Canadians had a chance to recapture Mons on the last day of the war. The Imperial German Army, though badly beaten, fought a fierce rear-guard action as it retreated towards Mons. In early November, Canadian troops had taken the French city of Valenciennes after a costly battle.\nThe battle\nBy 9 November, Canadian forces were already on the outskirts of Mons.  Canadian Lieutenant-General Sir Arthur Currie, in charge of Canadian forces, wanted to take it to break German morale and to ensure that the Germans did not think they had any pieces for negotiation. While Currie's senior officers did not protest, the men on the ground were less pleased, but trusted their commanding officer and obeyed the order nonetheless. The plan to capture Mons was an encircling manoeuvre, with the 2nd Canadian Division attacking from the south and south-east, and the 3rd Canadian Division attacking from the east. On 10 November, the Canadians pushed into the outskirts of the city, engaging with German patrols in skirmishes but no large-scale assaults on dug-in German positions. There was no artillery bombardment of the city following orders from higher command not to bombard Mons with artillery in order to capture the city without destroying it. On the night of 10 November at around 11:00&nbsp;pm, platoons from the 42nd Battalion and the Royal Canadian Regiment made it through the southern defences of the city. From the west, other companies crossed into the city over bridges. By the early morning of 11 November, after heavy street fighting, Canadian forces had captured most of Mons without the use of heavy shelling. Bagpipes played and the town's inhabitants welcomed the Canadians as liberators.\nAftermath\nThe Canadians had lost 280 men killed, wounded, or missing.\nCanada is traditionally assigned the tragic distinction of having suffered the last fatality among British Commonwealth forces during the First World War. Private George Price was hit in the chest by a sniper shot in the town of Ville-sur-Haine near Mons. He died at 10:58&nbsp;am, two minutes before the armistice went into effect.  A bridge and school in the town now bear Price's name.\nThe Second Battle of Mons was the last battle before the end of World War 1.\nIn June 1927, the city of Mons erected a plaque commemorating its liberation by the Canadian Corps.\nControversy\nThe news of the Armistice on 11 November 1918 was ill-received by former Canadian Minister of Militia and Defence Sam Hughes, who felt Currie had stolen the glory of victory that was rightfully his. In December 1918, Currie learned from friends in Canada that Hughes was telling anybody who would listen that Currie was \"a murderer, a coward, a drunkard and almost everything else that is bad and vile\". In a letter to his sister, Currie wrote \"Sam Hughes is a vindictive and bitterly disappointed man, and so is his son Garnet Hughes\". Arthur and Garnet were friends and Currie was most likely speaking out of anger toward Sam Hughes. Arthur and Garnet had helped each other form the 50th Regiment (Gordon Highlanders) and took the Militia Staff Course together. In fact, it was Garnet Hughes who encouraged him to reconsider and accept the position of commanding officer of the regiment after he initially declined. On 4 March 1919, in a speech before the House of Commons, Sam Hughes accused Currie of \"needlessly sacrificing the lives of Canadian soldiers\". Specifically, Sam Hughes claimed Currie had only launched the Second Battle of Mons in order to have the Canadian Corps end the war for the British Empire where it began (the British Expeditionary Force fought its first battle at Mons in August 1914). Canadian Prime Minister Robert Borden defended Currie saying, “No criticism could be more unjust.”\nReferences\nSources\n*\n*\n*\n|series=History of the Great War Based on Official Documents By Direction of the Historical Section of the Committee of Imperial Defence |title=Military Operations France and Belgium, 1918 May–July: The German Diversion Offensives and the First Allied Counter-Offensive |volume=III |last=Edmonds |first=J. E. |author-link=James Edward Edmonds |year=1994 |orig-year=1939 |publisher=Macmillan |location=London |edition=Imperial War Museum & Battery Press |isbn=978-0-89839-211-1}}\n*"
    }
  ]
}