{
  "content": [
    {
      "type": "text",
      "text": "# Second battle of Solskjel\n\n870\n| place       = Solskjell, Nordmøre\n| result      = Vestfold victory\n| combatant1  = Kingdom of Vestfold\n| combatant2  = Kingdom of SunnmøreKingdom of Firda\n| commander1  = Harald Fairhair\n| commander2  = Arnvid †Audbjorn †\n}}\nThe second battle of Solskjell was an engagement in Harald Fairhair's conquest of Norway.\nAfter the First Battle of Solskjel,  Solve Klove, son of Huntiof, King of Nordmøre, set himself up as a pirate and spent that winter raiding and plundering King Harald's men and possessions on the Møre coast. King Harald himself had left to spend the winter in Trondheim. Solve had also spent time at the court of King Arnvid of Sunnmøre, and they had gathered together a large group of people who had been dispossessed by Harald's conquest.\nThe following summer Harald again gathered an army and sailed south. On hearing news of Harald's intentions' Solve traveled to King Audbjorn in Fjordane and convinced him to join forces against Harald. The force sailed north to meet Harald by Solskjel. Here both kings Arnvid and Audbjorn fell, but Solve again escaped. Heimskringla tells that Harald's men, Asgaut and Asbjorn as well as  Grjotgard and Herlaug, the sons of earl Håkon Grjotgardsson, were all killed in battle. Solve subsequently resumed his pirate raids and caused much trouble to Harald in several years after. King Harald took possession of Sunnmøre and made Rognvald Eysteinsson the founding jarl of the Jarls of Møre.\nSee also\n*First battle of Solskjel\n*Glymdrápa\nReferences\nPrimary source\n* Sturluson, Snorri. [https://books.google.com/books?id=qHpwje7-wNkC&q=Heimskringla:+History+of+the+Kings+of+Norway Heimskringla: History of the Kings of Norway], translated Lee M. Hollander. Reprinted University of Texas Press, Austin, 1992.\nOther sources\n*Finlay, Alison (editor and translator) Fagrskinna, a Catalogue of the Kings of Norway (Brill Academic. 2004)\n*Hermannsson, Halldór  (2009) Bibliography of the sagas of the kings of Norway (BiblioBazaar)\n*Jones, Gwyn (1984) A History of the Vikings (Oxford University Press. 2nd ed) .\nRelated reading\n(In Norwegian)\n* Krag, Claus (2000) Norges historie fram til 1319 (Universitetsforlaget)"
    }
  ]
}