{
  "content": [
    {
      "type": "text",
      "text": "# Second Battle of Petrozsény\n\n| combatant2  =\n| combatant3  =\n| commander1  =  Ioan Culcer\n| commander2  =  Erich von Falkenhayn Ludwig Berger\n| commander3  =\n| units1      = 1st Army\n*11th Division\n| units2      = 9th Army\n*144th Austro-Hungarian Infantry Brigade\n*2 Bavarian Jäger battalions\n**2 batteries\n| units3      =\n| strength1   =\n| strength2   =\n| strength3   =\n| casualties1 = Unknown\n| casualties2 = Hundreds of prisoners\n*80 German prisoners killed\n7 machine-guns captured\n| casualties3 =\n| notes       =\n| campaignbox =\n}}\nThe Second Battle of Petrozsény was a World War I military engagement between Romanian forces on one side and Central Powers forces (Austria-Hungary and Germany) on the other side. It was part of the wider Battle of Transylvania and resulted in a Romanian victory.\nBackground\nRomania declared war on the Central Powers on 27 August 1916, and proceeded to invade the region of Transylvania. On 29 August, the Romanian I Corps of the 1st Army (General Ioan Culcer) defeated the Hungarian coal miner battalions defending the vital Transylvanian coal mining center at Petrozsény (Petroșani), inflicting heavy losses, and occupied the town. Given that this was a region of valuable coal mines which were vital for the Hungarian railways, this was the area where the first Central Powers counterattack against the Romanian invasion of Transylvania was launched. Taking place on 8 September, it was also the first military engagement during the Battle of Transylvania to involve German forces, three days after the first German unit to arrive in Transylvania unloaded at Marosillye (Ilia) on 5 September. Despite German support, the Austro-Hungarian commander of the 144th Infantry Brigade, Colonel Ludwig Berger, \"inexplicably\" ordered a retreat. Thus, the Romanians had little difficulty repulsing the first Central Powers counterattack against their invasion of Transylvania.\nGerman General Hermann von Staabs, the commander of the XXXIX Corps which had assumed responsibility on 8 September for operations in the southern region of Transylvania, reacted quickly to the Austrian withdrawal. Aside from the Austro-Hungarian 144th Infantry Brigade and the German 187th Regiment of the German 187th Infantry Division (the first German unit to enter Transylvania), von Staabs also sent to Puj the 189th Regiment, the artillery belonging to the 187th Division, as well as the Bavarian light infantry regiment of the Alpenkorps (the first unit of the Alpenkorps to arrive in Transylvania). This force, commanded by Major General Edwin Sunkel (the commander of the German 187th Infantry Division), began its advance on 14 September. Meantime the Romanian forces in the area were severely reduced. At the beginning of September, the Romanian units in the area comprised the bulk of General Culcer's 1st Army: the 2nd, 11th and 12th Divisions. However, following the Romanian defeat in the Dobruja, the 2nd and 12th divisions were transferred to the south. The transfer of Culcer's two divisions started before 9 September. On the 9th, Major Radu R. Rosetti from the Romanian headquarters stated to General Andrei Zayonchkovski - the Russian commander in Dobruja - that the 2nd and 12th Divisions \"were coming from Transylvania\". The remaining 11th Division in the Petrozsény sector was commanded by General Ioan Muică. Culcer also involved himself more directly in local operations by sending the command of the I Corps - the group of Romanian 1st Army divisions operating in Transylvania - to Nagytalmács (Tălmaciu/Talmesch), to direct the operations of the two divisions located there. Initially, the I Corps directed operations in both the area around Petrozsény (Jiu Valley) and the area around Nagytalmács (Olt Valley). General Ioan Popovici, commander of the I Corps, arrived in Nagytalmács along with his staff on 16 September.\nThe three divisions of the German 9th Army concentrating at Szászsebes (Sebeș/Mühlbach) could be enveloped by the Romanians from the region of the two mountain passes, and - according to German planning - this was the possibility to be dealt with first. The German-led Central Powers force disposed of an exceedingly strong concentration of howitzers and mountain guns, amounting to an overwhelming superiority in artillery. The task of throwing back the Romanian forces in the area over the frontier was accomplished between 14 and 22 September (Battle of Nagybár and First Battle of Petrozsény). On 21 September, a Berlin dispatch announced that the Vulcan Pass was taken by German forces. However, on the following day, the Romanians were still fighting at this point. On 22 September, the two German battalions remaining in the area stormed the Vulcan Pass. The remainder of the German forces were shifted to another sector of the Transylvanian front. This shifting of forces began during the night of 22-23 September, as the Germans appeared to have imagined that they had finished off their opponents. The Central Powers force left behind to mask the Vulcan and Szurdok passes thus remained mostly Austro-Hungarian, consisting of the 144th Brigade reinforced by two German battalions and two batteries. However, sympathetic ethnic-Romanians living in the region immediately made General Culcer's headquarters aware that the bulk of the Germans had pulled out of the area. The Romanian general promptly took advantage of this development, launching his counterattack on 25 September. Culcer personally directed operations.\nOn 19 September, Erich von Falkenhayn assumed command of the German 9th Army. Based on General Edwin Sunkel's reports, von Falkenhayn decided that Nagyszeben (Sibiu/Hermannstadt) was the only location suitable for a decisive victory. Consequently, he swiftly began moving his forces into position for the attack on Nagyszeben. Falkenhayn could not deploy all of the German units for this assault, however. On 22 September, two battalions of Bavarian Jägers conquered the Vulkan Pass. After taking the Vulkan Pass, Falkenhayn wanted to move these two battalions to Nagyszeben as well, however this was out of the question. Along with these two battalions, von Falkenhayn left Colonel Berger's 144th Austro-Hungarian Infantry Brigade in command at Petrozsény.\nBattle\nOn 25 September, the Romanian 11th Division attacked, by the end of the day managing to regain not only Petrozsény, but the two mountain passes (Szurdok and Vulcan) as well. A successful Romanian encircling movement rendered untenable the position of the Central Powers in the passes. To avoid being cut off in the defiles south of Petrozsény, the Germans hastily retreated. Colonel Berger, the local Austro-Hungarian commander, at first thought his forces could hold, but the exhausted miners collapsed, allowing the Romanians to reenter Petrozsény on the 25th. Berlin and Vienna acknowledged the evacuation of the Szurdok and Vulcan passes on 26 September. The Romanians completely regained the Vulcan Pass on 26 September. On 27 September, the Central Powers continued their retreat north and northwest under further Romanian attacks. Also on 27 September, the Romanian occupation of Transylvania extended to one third of the region. By 28 September, the Romanians had recovered ten miles of lost ground within the Hungarian frontier, driving the Austro-Hungarians and the Germans before them. The Romanians encountered and overcame a formidable opposition on the part of the Germans. The Central Powers were driven back to Merisor. The Romanians captured several hundred prisoners and seven machine-guns. Fighting for Petrozsény itself only took place on 25 September. Much more disputed was the nearby Mount Oboroca, where fighting took place from 25 to 27 September. By Culcer's own admission, after taking Merisor, his troops massacred 80 German prisoners and several officers.\nAftermath\nCertain sources appear to be surprised by the Romanian success, that - after being overwhelmed by the artillery used against his forces during what was at the time General Falknehayn's main blow - Culcer was \"even able\" to make some headway against his opponents.\nThe Germans sent the newly-formed 301st Division to take charge at Petrozsény. This division had no units other than a headquarters staff, its function being to provide an additional control element. From Bosnia, the Austro-Hungarians brought the 2nd Mountain Brigade, with five battalions. Although largely Austro-Hungarian in composition, it was a German general who was in command of this enlarged Central Powers force in the region. The Central Powers attack began on 30 September, starting the third and final battle for Petrozsény.\nReferences"
    }
  ]
}