{
  "content": [
    {
      "type": "text",
      "text": "# Second Battle of Dragoon Springs\n\nConfederate States\n|commander1=CochiseFrancisco\n|commander2=Unknown\n|strength1=\n|strength2=\n|casualties1=5 killed\n|casualties2=None\n}}\nThe Second Battle of Dragoon Springs was one of two skirmishes involving  Apache warriors and Confederate soldiers in Arizona. It was fought during the American Civil War on May 9, 1862, and was a response to the First Battle of Dragoon Springs in which Confederate forces were defeated. Four men were killed in the first skirmish and several heads of livestock were captured. The rebel commander Captain Sherod Hunter, ordered his foraging squad to take back the livestock from Cochise's warriors, during which five Apaches were killed. There were no Confederate casualties.\nSee also\n* American Indian Wars\n* Apache Wars\nReferences\n* Finch, L. Boyd. Confederate Pathway to the Pacific: Major Sherod Hunter and the Arizona Territory, C.S.A. Tucson, Arizona: Arizona Historical Society Press, 1996.\n* Horn, Calvin P., and William S. Wallace, Editors. [https://hdl.handle.net/2027/mdp.39015016756911 Confederate Victories in the Southwest: Prelude to Defeat.]  Albuquerque, New Mexico: Horn and Wallace, 1961.\n* Kerby, Robert Lee. The Confederate Invasion of New Mexico and Arizona, 1861–1862. Tucson, Arizona: Westernlore Press, 1958.\n* Rodgers, Robert L. \"The Confederate States Organized Arizona in 1862.\" Southern Historical Society Papers, Volume 28 (1900).\n* Sonnichsen, Charles Leland. Tucson: The Life and Times of an American City. Norman, Oklahoma: University of Oklahoma Press, 1982.\n* Sweeney, Edwin R. Cochise: Chiricahua Apache Chief. Norman, Oklahoma: University of Oklahoma Press, 1995.\n* Walker, Charles S. \"Confederate Government in Dona Ana County As Shown in the Records of the Probate Court, 1861–1862, New Mexico Historical Review, Vol. VI (1931), pp 253–302.\nExternal links\n* [http://www.mycivilwar.com/battles/620505d.htm MyCivilWar: The Battle of Dragoon Springs]"
    }
  ]
}