{
  "content": [
    {
      "type": "text",
      "text": "# Second Battle of Dernancourt\n\n| map_type    = France\n| map_relief  = 200\n| map_caption =\n| map_label   =\n| territory   =\n| result      = Australian victory\n| status      =\n| combatants_header =\n| combatant1  =  Australia\n| combatant2  =  German Empire\n| combatant3  =\n| commander1  =\n| commander2  =\n| commander3  =\n| units1      =  4th Division 10th Brigade (3rd Division)\n| units2      =  XXIII Reserve Corps\n| units3      =\n| strength1   =\n| strength2   =\n| strength3   =\n| casualties1 =\n| casualties2 =\n| casualties3 =\n| notes       =\n| campaignbox =\n}}\nThe Second Battle of Dernancourt, known to the Germans as Unternehmen Sonnenschein (Operation Sunshine), was fought on 5 April 1918 near Dernancourt in northern France during World War I. It involved a German Army force attacking an Australian defending force, and resulted in the German capture of much of the forward sector of the Australian front line which ran along a railway line between Albert and Dernancourt. The Australian 4th Division had been sent south to help stem the tide of the German spring offensive towards Amiens, and held a line west and north of the Ancre river. The main German assault force was the XXIII Reserve Corps, which concentrated its assault on the line between Albert and Dernancourt. Their attack at the boundary between the Australian 12th and 13th Brigades overwhelmed the Australian front line troops near Dernancourt and captured some support trenches. An Australian counter-attack in the afternoon wrested the initiative from the Germans and their attack petered out, leaving the Australians still in possession of most of the high ground northwest of Dernancourt, barring the way to Amiens.\nBackground\nAfter the Third Battle of Ypres petered out in late 1917, the Western Front fell into its usual lull over the winter months. In early 1918, it became apparent to the Allies that a large German offensive was pending on the Western Front. This German spring offensive commenced on 21 March 1918, with over one million men in three German armies striking hard near the junction between the French and British armies. The main effort of this offensive hit the British Fifth Army, which formed the right flank of the British front line. Struck a staggering blow, it began a rapid and at times panicked withdrawal. The key railway junction at Amiens was soon threatened.\nShortly after the Spring Offensive began, the Australian 3rd and 4th Divisions were deployed south in stages from rest areas in the Flanders region of Belgium to the Somme river valley in France to help stem the initial German success in the Fifth Army's sector. On their way south, the 4th Brigade was detached from the 4th Division to help halt the Germans near Hébuterne in the Third Army sector. Travelling by train, bus and marching on foot, the remaining two brigades of the 4th Division, the 12th and 13th Brigades, concentrated in the area west of Dernancourt, under the command of the VII Corps led by Lieutenant General Walter Congreve. The commander of the 4th Division, Major General Ewen Sinclair-Maclagan was ordered to support and then relieve remnants of the 9th (Scottish) Division which was holding the front line along a railway between Albert and Dernancourt, west of the Ancre river. This task was given to the 12th Brigade, under the command of Brigadier General John Gellibrand. The 13th Brigade, commanded by Brigadier General William Glasgow, was held in support positions between Bresle and Ribemont-sur-Ancre. To the right of the 12th Brigade was the British 35th Division between Dernancourt and Buire-sur-l'Ancre, and commanded by Brigadier General Arthur Marindin.}} The 3rd Division, commanded by Major General John Monash, was deployed further to the south, between the Ancre and the Somme around Morlancourt, where it fought a brief action on 28–30 March, with its 10th Brigade to the right of the 35th Division.\nThe First Battle of Dernancourt was fought on 28 March 1918 and resulted in a complete defeat of the German assault. The main German attacking force was the 50th Reserve Division of the XXIII Reserve Corps, which concentrated its assault on the line between Albert and Dernancourt, attacking off the line of march with weak artillery preparation. Other than one small penetration by a German company in the early morning which was quickly repelled, nowhere were the Germans able to break through the VII Corps defences. In the following week, the village of Dernancourt was heavily shelled in an attempt to reduce the protection it provided to the Germans, and they made two more unsuccessful attempts to advance in the sector. After First Dernancourt, the 13th Brigade relieved the 35th Division between Dernancourt and Buire-sur-l'Ancre, and the 4th Division became responsible for the whole of the front line between Albert and Buire-sur-l'Ancre.\nPreparations\nVII Corps dispositions\nThe front line of the 4th Division was held by the 12th Brigade on the left, between Albert and Dernancourt, and the 13th Brigade on the right, between Dernancourt and Buire-sur-l'Ancre. The forward positions of the salient held by the 4th Division were along the railway line, which ran along a series of embankments and cuttings, including a railway bridge immediately northwest of Dernancourt where the Dernancourt–Laviéville road passed under the railway. A mushroom-shaped feature known as the Laviéville Heights overlooked the railway line, which curved around its foot. The foot of feature consisted of a number of gentle spurs and re-entrants, which hindered observation along the front line in both directions. This was difficult ground to defend, particularly where the railway line curved and skirted the northwestern corner of Dernancourt, as if the line there was overrun, the enemy would be able to fire into the rear of the troops lined out along the railway in both directions. Despite this, the Australian commanders considered it important to hold the railway line since, if it was not garrisoned, the enemy could assemble in the dead ground behind the embankment. A further difficulty arose from the fact that if an attack occurred during daylight, it would be almost impossible to move troops down the exposed slopes to reinforce the railway line without crippling losses, and troops withdrawing from the railway line would be similarly exposed. To afford them some protection along the railway line, the forward posts dug one-man niches in the near side of the embankment, but the only way for them to fire was to climb up and lie on top of the embankment, thus exposing themselves to enemy fire. To mitigate this problem, parties of the 4th Pioneer Battalion had been tasked to tunnel through the embankment, then dig out small T-shaped trenches on the far side. This work was still ongoing on the night of 4/5 April.\nAfter a rotation conducted on the night of 3/4 April, the 12th Brigade front line consisted of widely spaced platoon posts, garrisoned by the 48th Battalion on the left and the 47th Battalion on the right, largely as they had been for the First Battle of Dernancourt. In the 13th Brigade area, the 52nd Battalion held the front line. On the left flank of the 4th Division were British troops of the 7th (Service) Battalion of the Suffolk Regiment, which was part of the 35th Brigade, 12th (Eastern) Division, V Corps. On the 4th Division's right flank, in the village of Buire-sur-l'Ancre itself, was a company of the 3rd Pioneer Battalion, belonging to the 3rd Division, which was holding the front line west of Buire-sur-l'Ancre. On 4 April, as a result of consolidation of the forward positions of the division, MacLagan ordered that the main line of resistance was to be the railway line rather than the positions half-way up the hill. In doing so, MacLagan was concerned that the 12th (Eastern) Division on his left might be driven in, and specified that if this occurred, his forward commanders could withdraw to the former main line up the hill to the rear. This order had a significant impact on the coming battle, as it is doubtful that this order was received by the 52nd Battalion. Throughout that day, the troops of the 4th Division could hear the artillery fire associated with the renewal of the German offensive further south. Late that afternoon, a prisoner-of-war captured by the 3rd Division stated that an attack was pending north of the Somme, and the troops that would be mounting it were already assembled. In the Official History, Charles Bean noted that the Australian troops were in \"bouncing spirits\", despite the rain of the previous few days.\n12th Brigade\nThe left flank of the 48th Battalion had been extended about  further north than the sector it had held during First Dernancourt, taking up ground previously held by the 12th (Eastern) Division, including responsibility for the Albert–Amiens road. The battalion frontage now measured . The commanding officer of the 48th Battalion, Lieutenant Colonel Raymond Leane, usually highly reticent to crowd forward areas with troops, requested and was granted authority from Gellibrand to hold his front line with three companies. This reflected the reduced manpower available to him after the casualties incurred during First Dernancourt. As the railway line near Albert was not in friendly hands, one company of the 48th Battalion was deployed in posts on either side of a grassy ravine alongside the Albert–Amiens road, and two held the railway line running south towards Dernancourt. Leane's fourth company was kept in support positions in an entrenchment known as Pioneer Trench, which had been dug by the 4th Pioneer Battalion on the Laviéville Heights some  to the rear of the front line on the railway. This company occupied a section of Pioneer Trench that stretched north of the Albert–Amiens road. Leane had been allocated a company of the 46th Battalion, which he held in reserve in trenches near his headquarters on the high ground alongside the Albert–Amiens road.\nThe 47th Battalion held the railway line from the bend to just short of the railway bridge with two companies. The left forward company (B Company) was positioned behind the embankment, and the right forward company (A Company) held a cutting where the railway line turned southwest, as well as the steep railway embankment near the bridge. The two platoons on the left of A Company were positioned forward of the cutting, with the two platoons on the right deployed behind the embankment. Behind and slightly up the slope from the boundary between the two forward companies was an old prisoner-of-war (POW) cage. The commanding officer of the 47th Battalion, Lieutenant Colonel Alexander Imlay, held his two remaining companies in support, garrisoning an old and overgrown French \"practice trench\" located  uphill from the railway line along the edge of a sunken road that circled the hillside, sometimes coinciding with the road itself. This was a poor entrenchment, being far too wide and lacking traverses. On the right of this trench, where the Dernancourt–Laviéville road ran through it, a knuckle of the slope blocked its field of view towards the railway line. About  forward of the right support company (C Company) and  back from the railway embankment was a quarry alongside the Dernancourt–Laviéville road. D Company was the left support company. Imlay had been allocated a company of the 45th Battalion, which was held in reserve in that section of Pioneer Trench that stretched south of the Albert–Amiens road. His headquarters was co-located with Leane's.\nThe balance of the 45th and 46th Battalions were held in a reserve line of posts northeast of Laviéville near Gellibrand's headquarters. Within the 12th Brigade forward area were deployed the Vickers machine guns of the 24th Machine Gun Company. Half of their guns were grouped into two batteries, each of four guns. One battery was located in the quarry forward of the 47th Battalion support trench, and the other was distributed along a trench which was located about  northeast of the quarry. Due to their exposed locations, the crews of these two batteries were ordered not to show themselves or mount the guns in firing positions during daylight. If the infantry fired the S.O.S. signal}} or fell back from the railway line, they were to mount the guns regardless. The artillery of the 4th Division was in support of the 12th Brigade, consisting of the 10th and 11th Australian Field Artillery (AFA) Brigades, located in a valley northwest of Laviéville. The inter-brigade boundary ran along the Dernancourt–Laviéville road.\n13th Brigade\nAfter it relieved the 35th Division, the 13th Brigade held its  front line with the 52nd Battalion, with three companies holding the railway line between Dernancourt and Buire-sur-l'Ancre. Its left forward company, which held the railway bridge northwest of Dernancourt, had a Lewis machine gun post thrust out on the far side of the bridge. The 52nd Battalion's fourth company was located in a valley north of Buire-sur-l'Ancre near battalion headquarters, but the 4th Pioneer Battalion had dug a series of support posts along the lower slope, about  behind the railway line. These posts ran through an abandoned casualty clearing station (CCS), but did not reach as far as the cemetery west of the Dernancourt–Laviéville road. Being on an exposed slope, these posts were unoccupied during the day, but the fourth company had orders to occupy them in case of attack. If this occurred, the commanding officer of the 52nd Battalion, Lieutenant Colonel John Whitham, had been given a company of the 51st Battalion, which was to automatically replace the fourth company of the 52nd Battalion in the valley north of Buire-sur-l'Ancre as soon as it moved forward. In the 13th Brigade area was another unoccupied trench, located at the top of the slope, about  to the right rear of the 47th Battalion's support line, which had been dug prior to First Dernancourt. Two pairs of Vickers guns of the 13th Machine Gun Company were deployed on the slope  above the railway embankment, with a third pair in the area of the left forward company, and several others further west. Whitham had also been given the rest of the 51st Battalion to use as reinforcements if necessary. In the meantime, the balance of the 51st Battalion was deployed along a line running south of and parallel to the Albert–Amiens road, north and northwest of Buire-sur-l'Ancre.\nThe remaining battalions of the 13th Brigade, the 49th and 50th Battalions, were held as the divisional reserve in a line well to the rear, west of the village of Bresle. The 13th Brigade had substantial British artillery support available, comprising the 95th Royal Field Artillery (RFA) Brigade, belonging to the 21st Division, as well as the 65th and 150th RFA Brigades, which were Army-level assets. These artillery units were deployed on the eastern outskirts of Bresle.\nGerman plan of attack\nThe German attack against the 4th Division, known as Unternehmen Sonnenschein (Operation Sunshine), was to be delivered by the XXIII Reserve Corps using three divisions. In the north, the 79th Reserve Division would assault the sector held by the 48th Battalion, as well as the neighbouring sector of the 12th (Eastern) Division. It was to attack with two regiments, the 261st Reserve Infantry Regiment (RIR) assaulting where the Albert-Amiens road ran out of Albert with the objective of capturing that portion of Pioneer Trench that extended north of the Albert-Amiens road, and occupied by the supporting company of the 48th Battalion. The 262nd RIR was to attack the railway embankment further south, and the 263rd RIR was held in reserve. It was likely considered that the Australian defences along this sector would be overrun with \"little difficulty\", especially given that the main effort of the corps assault further south near Dernancourt would threaten the rear of this sector.\nThe XXIII Reserve Corps main effort was with the 50th Reserve Division, which had also been the primary assault formation used during First Dernancourt. Despite significant casualties suffered during that battle, it had rested for much of the following week, and its morale remained high. It was to attack on both sides of Dernancourt. The most critical task of the division was allocated to the 230th RIR, which was to assemble in the cellars of Dernancourt then assault the sector near the railway bridge. Its II Battalion was to lead the assault on the embankment, pushing on to capture the 47th Battalion's support trench and the portion of Pioneer Trench south of the Albert-Amiens road that was occupied by the company of the 45th Battalion that had been allocated to the 47th Battalion. II/230th RIR was to be followed by III and I Battalions in that order. The 229th RIR was tasked to exploit the gains achieved by the 230th RIR. The 231st RIR was to assault immediately north of the cutting at the bend in the railway line, near the boundary between the forward companies of the 47th Battalion. Once these initial objectives had been achieved, the whole 50th Reserve Division was to wheel to the left as the 79th Reserve Division drew level with it north of the Albert-Amiens road, and with the 13th Division on its left flank, the corps would push on towards Amiens. The artillery supporting the 50th Reserve Division had been allocated 16,000 gas shells for the preliminary bombardment of the British and Australian artillery batteries, which was to be heaviest between 08:30 and 09:00. The 50th Reserve Division was reinforced by one storm company of the 3rd Jäger Battalion, equipped with four machine guns, two trench-mortars and two field guns, with a further storm company of that battalion attached to 230th RIR for \"certain enterprises\" along the railway line.\nBetween Dernancourt and Buire-sur-l'Ancre, the assault would be launched by the 13th Division, which would attack with all three regiments. On the right, the 15th Infantry Regiment (IR) was to attack the railway line held by the 52nd Battalion from the woods near Ville-sur-Ancre. In the centre, the 55th IR was to assault the line held by the 10th Brigade of the 3rd Division, between Treux and Marrett Wood. On the left, the 13th IR would also attack the 10th Brigade line south of Marrett Wood.\nBattle\nLate in the evening of 4 April, a report was received, apparently from a reliable French spy, that converging attacks would be made on Amiens the following day, launched from Albert, and Roye further south. In response, Congreve ordered the field artillery of the 3rd and 4th Divisions, augmented by some heavy guns, to shell all likely assembly areas commencing at 07:30. If a German bombardment descended before that time, the British and Australian artillery were to direct their fire onto the German battery positions. The warning of the pending attack reached the brigade commanders of the 4th Division before midnight, and they ordered out special patrols to search for signs of assembling German troops.\nWhen the warning was received by Whitham, he immediately ordered his support company, under Captain Kennedy, to move from the valley north of Buire-sur-l'Ancre into the series of posts that ran through the CCS. He visited all three of his companies along the railway line and explained to each company commander that if they were driven from the front line, they were to withdraw to Kennedy's support line and make their last stand there. By the time Whitham returned to his headquarters, Kennedy's company had taken up its positions in the support line, although it was only occupying the posts west of the CCS. When the warning was received, a working party of the 4th Pioneer Battalion, numbering one officer and 27 men, were digging tunnels through the embankment in the right forward company sector of the 47th Battalion near the railway bridge. They stood to arms with the rest, reinforcing the two platoons nearest the railway bridge.\nThe patrols of all three front line battalions observed German troops in large numbers on the approaches to the railway line, and patrols of the 52nd Battalion reported that footbridges had been placed across the Ancre between Dernancourt and Buire-sur-l'Ancre. When Gellibrand received this news at 05:00, he arranged for the artillery to fire on S.O.S. lines at a slow rate, and ordered his forward battalions to send out Lewis guns to fire on the enemy that had been detected. He also ordered the main body of the 45th Battalion, under Major Arthur Samuel Allen, to move from its position near Laviéville and dig in near the co-located headquarters of the 47th and 48th Battalions on the high ground alongside the Albert–Amiens road. The balance of the 46th Battalion moved up and took over the 45th Battalion's former position. About 05:30, Captain Fraser, the commander of the left forward company of the 52nd Battalion at the railway bridge, became aware of Germans assembling to his front, and arranged for two Stokes mortars located in the small cemetery a short distance behind the front line to shell them. After 80 bombs had been fired, he ordered them to cease fire and had them register on an area closer to the embankment. At 06:20, both forward battalions of the 12th Brigade reported that no Germans were visible. Its supporting artillery was therefore lifted to shell the Albert–Bapaume road, on which German troops could be heard. After first light, a thick mist descended over the Ancre valley, obscuring the front line from the support positions further up the hill, and reducing visibility down to .\nPreliminary operations\nOther than the distant fall of shells on the Albert–Bapaume road, all was quiet along the front line when at 07:00, an intense German artillery bombardment fell on the whole of the area of the 4th Division, including rear areas as far as Congreve's headquarters in Montigny-sur-l'Hallue. Although it initially fell only lightly along most of the front line, in the brigade rear area the shelling was, according to Leane, \"the heaviest since Pozières\", two years earlier. The artillery were hard hit with both gas and high explosive shells, suffering significant casualties in men and guns. The sudden barrage also caught the tail of the 45th Battalion as they arrived in their new positions near Leane's and Imlay's headquarters, causing 44 casualties before they could dig in.\nCommencing between 06:55 and 07:00, heavy German minenwerfer (trench-mortar) fire was concentrated in the area of the railway bridge held by Fraser's company, and the area immediately east of it held by the right forward company of the 47th Battalion, commanded by Captain Hurd. Soon after this barrage commenced, troops along the embankment could see Germans of II/230 RIR approaching from the direction of the Ancre, and down the main street of Dernancourt that led towards the railway bridge. It is likely that this operation was intended to secure the battalion's assembly area in the village itself. The isolated Lewis gun post of Fraser's company on the far side of the bridge was soon engaged in a fierce fight with the advancing Germans, who were working their way towards the railway line under cover of the houses and back gardens of the village. With another Lewis gun on the railway line protecting their right flank, the fighting soon closed to hand grenade range and became desperate.\nThe first assault wave was held off, but a German minenwerfer bomb soon blew up the isolated Lewis gun post, and a second Lewis gun on the bridge itself was committed to the defence as the Germans renewed their attack. Machine guns of the 13th Machine Gun Company on the railway line further west and Stokes mortars of the 13th Light Trench Mortar Battery laid down intense fire on the approaches to the bridge. By 07:30, German infantry movement near the bridge had ceased, although the shelling continued unabated. Fraser had fired his S.O.S. flares when the attack began, but the morning mist obscured them from observers further to the rear. The supporting field guns had laid down a barrage on the S.O.S. lines in response to the German bombardment, with the heavy guns shelling likely assembly areas with gas, but without observation they were effectively firing blind. Fraser sent a runner to Whitham asking for immediate artillery support onto Dernancourt, including heavy guns, but the message did not reach Whitham until 10:25. Bereft of targeting information, the guns gradually eased their fire to occasional shelling on S.O.S. lines. About the same time as the preliminary attack on Fraser's company ceased, there was a movement of two bodies of German troops far to the north near Albert, opposite the left forward company of the 48th Battalion. About 07:25, these troops crossed the railway line, which was in their hands in this sector, and assembled in dead ground in the lower parts of the ravine around which Australian posts were dotted. Soon after, the movement of German infantry right across the front largely ceased, although the heavy shelling continued.\nMain attack\nAbout 08:45, an intense minenwerfer barrage began to fall on the front held by the right forward company of the 47th Battalion, just east of the railway bridge. Simultaneously, lines of German infantry of the 15th IR were seen emerging from the village of Ville-sur-Ancre, advancing towards the railway embankment held by the 52nd Battalion. This triggered a fusillade from the Australian defenders which was heard by battalion headquarters further up the hill, although the front line remained swathed in mist and only the front line troops could see the advancing Germans, who continued approaching the embankment in short rushes.\nAt 09:00, the heavy German artillery barrage on the support trenches lifted, and the main German attack developed right along the line held by the 4th Division. The German 79th Reserve Division attacked along the whole sector of the 48th Battalion south of Albert. Elements of the 261st RIR attacked the post in a farmhouse on the north side of the ravine alongside the Albert–Amiens road. Other Germans of the 261st RIR who had assembled in the dead ground at the bottom of the ravine near the Albert–Amiens road immediately began assaulting up the ravine and against the post of the left forward company of the battalion that held the angle of the gully and the railway embankment. And the 262nd RIR launched its own attack along the rest of the front line held by the 48th Battalion. But despite the concerted German assault, the entire line of the 48th Battalion held, beating back wave after wave of attackers with their rifles and Lewis guns. By 10:00, the surviving Germans of the 261st RIR were digging in as best they could near the mouth of the ravine, still under fire. Further south, the 262nd RIR had fallen back to its jumping off line.\nIn the sectors held by the 47th and 52nd Battalions on either side of Dernancourt, the Germans of the 230th RIR also launched their main attack at 09:00. The minenwerfer barrage lifted from the embankment itself and fell on the 52nd Battalion's support line that ran through the CCS  to the rear, although it did not hit any of the occupied posts there and mainly began the destruction of the tents and huts in the CCS itself. Many German machine guns, including one apparently mounted in the Dernancourt church tower, played over the heads of the assaulting troops and concentrated their fire on the edge of the embankment and on the positions of the 24th Machine Gun Company in the quarry and adjacent trench on the slope behind. The combined fire of Vickers guns, Stokes mortars, Lewis guns and rifles beat off the first wave of Germans. Some of the assaulting troops, unable to reach the embankment, began to dig in on the flats between it and the Ancre. They were hard hit by the pair of 13th Machine Gun Company guns farther west, which caused them further casualties. The crews of these same guns could observe Germans streaming out of Dernancourt towards the railway bridge and embankment, and cut down many of them. When a hand grenade fight began at the embankment soon after this it became clear that some of the assaulting troops had got through. In their first rush, Germans managed to penetrate the embankment between two posts on the right of the 47th Battalion, but they were soon ejected. Along the rest of the front line, the Australian troops held fast, repelling a second wave of Germans. In the right forward company of the 47th Battalion, the commander of one of the platoons nearest the railway bridge had been killed, and the other seriously wounded. The pioneer officer had also been seriously wounded. Between 09:15 and 09:30, an observer at the quarry saw hand grenades bursting at the embankment, but the officers in charge did not order the guns to be mounted in firing positions.\nAbout 09:30, the morning fog began to lift rapidly, although visibility was still limited by the smoke that lingered from the German barrage. The pressure on the front of the 52nd Battalion eased, but soon after 09:30 a party of soldiers of the 47th Battalion approached the platoon post at the railway bridge and claimed that the right forward company of their battalion had been \"blotted out\". On Fraser's orders, a sergeant took them back along the embankment some distance, but they were unable to locate any living garrison. Fraser incorporated these 47th Battalion men into the post at the bridge. To cover his flank in case of a German breakthrough on his left, he posted a Lewis gun at the cemetery slightly up the slope to his rear. Following Whitham's instructions, he sent a runner with a message for the commander of the centre company, Captain Williams, advising him to withdraw to the support line, and promising to hold on for as long as possible to cover their movement.\nBetween 09:50 and 10:00, a third assault by II/230th RIR struck the troops holding the embankment near Dernancourt, overrunning and killing, wounding and/or capturing most of what remained of the right forward company of the 47th Battalion. Some on the left of that company held on or withdrew to the support trenches, but of the right two platoons of this company and the co-located pioneers, not one man made it back. Soon after, Fraser's troops observed Germans near the old POW cage on the slope to the rear of the forward companies of the same battalion. Taking fire from where the 47th Battalion front line was supposed to be, and running out of hand grenades, Fraser's men at the bridge broke and ran, and he ordered the rest of his company to withdraw to the support line running through the CCS. Pausing to destroy his codes, Fraser was soon pinned down by machine gun fire and captured by the Germans. Once II/230th RIR had breached the embankment, they worked their way to the right along the railway line towards the left company of the 47th Battalion, and deployed into lines of skirmishers and advanced up the hill towards the 47th Battalion support trenches.\nAt 10:15, an observer of the machine gun battery at the quarry noticed half-a-dozen men coming up the road from the direction of the railway bridge. Both he and his officer took them for Australians, but shortly thereafter he saw about 50 Germans approaching the quarry from the left rear, only  away. He then saw 300–400 Germans near the old POW cage advancing up the hill. The officers ordered the guns to be mounted, but before a shot could be fired, the battery was completely surrounded and forced to surrender. The second battery further east was captured by a similar German outflanking manoeuvre.\nWithdrawal\nCounter-attack\nAftermath\nNotes\nFootnotes\nReferences\n*\n*\n*\n*\n*\n*\n*\n*"
    }
  ]
}