{
  "content": [
    {
      "type": "text",
      "text": "# Second round of voting in the 2008 Zimbabwean presidential election\n\nround)  2,150,269  ( round)\n| percentage1 = 43.2%  ( round)  85.5%  ( round)\n| image2 =\n| candidate2 = Morgan Tsvangirai\n| party2 = Movement for Democratic Change – Tsvangirai\n| popular_vote2 = 1,195,562  ( round)  233,000  ( round)\n| percentage2 = 47.9%  ( round)  9.3%  ( round)\n| image3 =\n| candidate3 = Simba Makoni\n| party3 = Independent (politician)\n| popular_vote3 = 207,470  ( round)\n| percentage3 = 8.3%  ( round)\n| title = President\n| before_election = Robert Mugabe\n| before_party = Zimbabwe African National Union – Patriotic Front\n| after_election = Robert Mugabe\n| after_party = Zimbabwe African National Union – Patriotic Front\n}}\nThe second round of voting in the Zimbabwean presidential election of 2008 was held between Robert Mugabe and Morgan Tsvangirai after the first round failed to produce a 50% majority for either candidate. The election process was marred by violence against and intimidation of voters and party workers, which eventually led to the withdrawal of Tsvangirai from the poll. This left Mugabe as the winner of, effectively, a one-candidate election.\nStart of the second round\nThe Herald reported on 21 May that the ZANU-PF run-off campaign would be launched by Mugabe on 25 May at the party's national headquarters in Harare. According to Justice Minister Patrick Chinamasa, 2,000 people would be invited to attend this main launch, although other launches would be held in wards across the country. Speaking at a police recruit graduation ceremony on 21 May, Mugabe again blamed the MDC for the violence, saying that it was \"on an evil crusade of dividing our people along political lines\".\nTsvangirai announced on 22 May that he planned to return to Zimbabwe on 24 May. Tsvangirai accordingly arrived from South Africa at the airport in Harare on 24 May. Speaking at a press conference later that day, Tsvangirai said that he did not think a national unity government was possible. He also expressed certainty in victory and described meeting with people who had been injured in the violence. Meanwhile, a truck carrying 60,000 copies of The Zimbabwean newspaper into Zimbabwe from South Africa was hijacked and burned, destroying the newspapers on board.\nAt the ZANU-PF official campaign launch on 25 May, Mugabe stressed Tsvangirai's Western backing, stating that the UK and US were joyful over the result of the first round and that some Zimbabweans wanted to \"sell [their] country for candy, like children\"; he said that Zimbabweans should instead \"unite as a family against outsiders\". In response to US Ambassador McGee's earlier call for Tsvangirai to return, he threatened to expel McGee from Zimbabwe, and he derided the MDC's claim of an assassination plot against Tsvangirai.\nOn 25 May, Tsvangirai attended the funeral of MDC activist Tonderai Ndira, who was, according to the MDC, killed on 14 May for political reasons after putting up posters. The MDC alleged that, out of 20 people who put up posters, three had been killed and five were missing, while four had been arrested and the remainder had gone into hiding. Meanwhile, in the Sunday Mail, Chinamasa emphasised the critical nature of the second round for ZANU-PF, saying that \"we are fighting with our backs to the wall\". It was reported on the same day that the Pan African Parliament would send 30 observers, due to arrive on 13 June, with an advance team preceding them on 10 June.\nIn an article published in The Herald on 26 May, Mnangagwa expressed confidence that Mugabe would win, but said that Mugabe would \"be the first one to go on national television to acknowledge the result to the people\" if he lost. Angolan Foreign Minister João Bernardo de Miranda said on the same day that SADC would increase the number of observers it was sending for the second round \"so as to assure greater transparency and trust in the process\". The MDC had requested more observers; on 26 May, Chamisa said that the MDC wanted\n\"full coverage of all the polling stations\", and he said that it was particularly important that the observers have a strong presence in rural areas, as the MDC believed that problems were more likely to occur there. He also requested that SADC send a security monitoring team.\nOn 27 May, Tsvangirai and Chamisa said that more than 50 supporters had been killed in the violence up to that point. According to Chamisa, important members of the MDC were being abducted and their bodies were being found a few days later. He also said that the MDC was given no access to the state media and that it was \"almost impossible\" for the party to hold rallies, with permission for the MDC's previous two rallies being given only after it appealed to the High Court. However, he said that the difficulties the party was facing were merely \"birth pangs\" marking the transition to a new Zimbabwe, noting that the codename for the MDC's campaign was \"Let's Finish It\". On the same day, three people, including two South Africans, were arrested in Bulawayo after police found broadcasting and computer equipment belonging to Sky TV, a British television network, hidden in a factory. According to state radio, the equipment had been there since 23 March; it also said that the arrested individuals had attempted to bribe the police with 25,000 rand.\nAnglican Archbishop of Canterbury Rowan Williams and Anglican Archbishop of Cape Town Thabo Makgoba expressed their concern regarding violence against worshippers to UN Secretary-General Ban Ki-moon on 28 May. According to Williams and Makgoba, on 18 May security forces beat worshippers at churches in Harare and prevented them from attending church services.\nRather than endorse a candidate, Makoni called for the cancellation of the second round and the formation of a national unity government at a press conference on 29 May 2008, saying that this was urgently needed to prevent further violence. According to Makoni, there was evidence that some MDC supporters were engaging in retaliatory attacks against ZANU-PF. He said that a national unity government should exist on a transitional basis for two to five years, during which time healing and reconstruction would take place. He would not reveal whether he intended to ultimately support Tsvangirai, saying that if a second round could not be prevented, he and his Mavambo Kusile Dawn movement would \"take a clear stand at the time\".\nAlso on 29 May, Mugabe and his wife Grace visited the site of an alleged attack by MDC supporters at Shamva, in which a homestead was burned down. He said that they were deeply affected by seeing the destruction and warned the MDC that they should \"stop immediately this barbaric campaign of burning and destroying people's homes\". On this occasion, Grace told ZANU-PF supporters that, even if Tsvangirai won the second round, he would not be allowed to take office; she said that her husband would only leave office if he was succeeded by a member of ZANU-PF.\nMeanwhile, it was reported by Michael Gerson, a columnist for The Washington Post, a US newspaper, that Mbeki had sent a letter to Bush in April complaining about the US attitude towards Zimbabwe and its involvement in the situation.\nOn 30 May, Tsvangirai told the members of the MDC parliamentary caucus that, for the sake of healing, unity, and \"moving the country forward\", the MDC should try to co-operate with \"those peaceful members of Zanu-PF whose eyes are open to the disastrous state of our nation\", but he rejected any co-operation with ZANU-PF's \"violent hawks\". In this speech, which Tsvangirai described as a state of the nation address, he said that Zimbabwe was in \"a state of despair\" and was \"an unmitigated embarrassment to the African continent\" due to its economic situation; he also said that those engaging in political violence would receive no amnesty from his government. Tsvangirai said that the MDC's legislative program would be \"based on the return of fundamental freedoms to the people of Zimbabwe\". A new \"people-driven constitution\" would follow within 18 months, according to Tsvangirai, and a \"truth and justice commission\" would be established; the army would \"defend our borders, not attack our people\", while the prisons would \"hold only criminals, not innocent people\". He pledged that the party would introduce a new strategy combining \"demand and supply-side measures\" to bring inflation under control. Tsvangirai also promised the revival of agriculture, saying that the issue would be \"completely depoliticized\" and that there would be measures to \"compensate or reintegrate\" farmers who lost their land as part of land reform.\nChinamasa said in South Africa on 30 May that Tsvangirai was anti-Zimbabwean and that a victory for Tsvangirai would be disastrous and \"destabilising\". However, he expressed confidence in a victory for Mugabe, attributing Mugabe's failure to win in the first round to \"complacency and overconfidence\" among ZANU-PF supporters who neglected to vote. He said that the party was encouraging those supporters to vote in the second round. Regarding the violence, Chinamasa accused the US and British governments of encouraging it. Chinamasa also claimed that US Ambassador McGee was taking victims of the violence to the hospital and paying for their treatment, but that he was doing so only for MDC supporters; furthermore, he said that McGee was \"moving round with journalists and photographers in places where there had been no violence\", intending to \"foment the violence in order to take pictures\".\nState media reported on 31 May that two ZANU-PF supporters had been killed by assailants believed to be MDC supporters. The MDC had planned to hold rallies in Hwange and Victoria Falls on the same day, but it was unable to do so because the police did not allow its supporters into the venues, according to Chamisa. He said that the police were obstructing the MDC on instructions from ZANU-PF. Eric Matinenga, the newly elected MDC MP for Buhera West, was arrested on 31 May for allegedly paying MDC supporters to attack war veterans; the MDC said that his arrest occurred when he went to visit MDC supporters who had already been arrested.\nContinued campaigning, incidents\nEarly on 1 June, Mutambara was arrested at his home in Harare. According to his lawyer, the arrest was due to an article he wrote in The Standard in April, which allegedly included \"falsehoods\" and \"contempt of court\"; in the article, Mutambara blamed Mugabe for the state of the economy and accused the security forces of committing abuses. The editor of The Standard was previously arrested in May due to this article. On 3 June, Mutambara was released on a bail of 20 million Zimbabwean dollars, with the next court date being set for 17 June. After the hearing on 3 June, he described his own suffering as minor compared to that of the people, saying that Mugabe's \"human rights violations\" would fail to accomplish their goals and vowing that \"we will triumph over evil\".\nThe Herald reported on 2 June that over 70 people had been arrested in connection with an attack on war veterans and ZANU-PF officials that occurred in Buhera district in the previous week; six people were injured in this violence. On 3 June, Tsvangirai declared in Bulawayo that he would continue campaigning even though Mugabe was \"determined to turn the whole country into a war zone\".\nCARE International, a prominent international aid agency, said on 3 June that Minister of Labour and Social Welfare Nicholas Goche had ordered CARE to immediately suspend its activities at a meeting with the group on 30 May. This decision was based on allegations that members of CARE actively supported Tsvangirai, distributing literature in support of him and threatening to deny food to supporters of ZANU-PF; the suspension was to be followed by an investigation. CARE insisted that it had \"a very strict policy against political activity\", while the US government condemned the suspension. At the UN food summit in Rome, Mugabe said on 3 June that non-governmental organisations funded by the West \"use food as a political weapon\". Aside from CARE, two other NGOs, Save the Children and ASAP-Africa, said that they had been required to partially halt their activities.\nThe three arrested South Africans working for Sky News were sentenced to six months imprisonment on 3 June for illegal possession of broadcasting equipment. South African Foreign Minister Nkosazana Dlamini-Zuma described the first round as \"free and fair\" on 3 June and expressed the hope that the second round would be held under similar conditions. The Herald reported on 4 June that SADC had again increased the number of observers it planned to send for the second round to between 300 and 400.\nTsvangirai was detained near Lupane on 4 June, along with his security team and other top MDC officials, such as Thokozani Khupe and Lovemore Moyo. A lawyer for the MDC said that Tsvangirai was alleged to have addressed a rally near Lupane without permission. His vehicle was stopped by police at a roadblock and his motorcade was searched; after two hours, he was taken to a police station. The MDC described this as \"part of a determined and well-orchestrated effort to derail our campaign programme\", while the US government called the incident \"deeply disturbing\" and the German government demanded his release; Amnesty International said that it was \"part of a sudden, sharp and dangerous crackdown on political opposition in the run-up to the elections\". Tsvangirai was released later on the same day after nine hours. Bvudzijena, the police spokesman, rejected any suggestion that the police were trying to interfere in Tsvangirai's campaign; he explained the detention by saying that the police had wanted to determine whether a vehicle in Tsvangirai's motorcade had valid registration. According to Bvudzijena, the police had wanted to take only the driver of this vehicle to the police station to review the relevant documents, but that Tsvangirai and the rest of his entourage insisted on coming as well. Although the MDC said that Tsvangirai was released only after being charged with \"attracting a large number of people\", Bvudzijena said that he had not been charged. In a statement on 5 June, Tsvangirai vowed to persevere, and the MDC said that he was continuing his campaign.\nAccording to rights activists, ZANU-PF supporters bombed an MDC office in Masvingo Province on 4 June; they said that at least two MDC officials were killed in the blast.\nOn 5 June 2008, diplomats and local embassy staff from the US and UK investigating political violence were detained at a roadblock in the town of Bindura,  from Harare, by police and military officers. It was claimed by those in the convoy that they were forced off the road at gunpoint after refusing to go to a police station. They reported that tyres on the vehicles were slashed and a Zimbabwean driver was attacked. None of the diplomats was harmed. A police spokesman claimed the officials were being rescued from a dangerous mob. The US government said the attack was \"absolutely outrageous\" and, along with the UK government, asked for an explanation of the incident. The Zimbabwean ambassador in London was summoned for an explanation.\nSubsequently, Deputy Information Minister Matonga gave the government's account of the incident: he said that the diplomats had addressed a gathering at the home of an MDC member and that police arrived at the scene due to commotion. According to Matonga, the diplomats then fled the home but were stopped by the police at a roadblock; after they \"refused to disembark\", police \"deflated the tyres of one of the vehicles\". Matonga also expressed the government's outrage at the way the British and Americans were behaving, accusing them of provocations intended to elicit a government response that would \"play into their hands\". US State Department spokesperson Sean McCormack said that the US would not forget the incident and that it intended to complain at the UN Security Council.\nAlso on 5 June, the United Nations announced that it was sending UN Assistant Secretary-General for Political Affairs Haile Menkerios to Zimbabwe to discuss how the UN could assist in the electoral process. At the UN food summit in Rome a few days earlier, Ban Ki-moon had suggested to Mugabe the idea of sending Menkerios to Zimbabwe, and Mugabe agreed; Ban also stressed to Mugabe \"the need to stop the violence and to deploy neutral international observers\".\nAfter meeting with Mbeki at the World Economic Forum Africa conference on 5 June, Kenyan Prime Minister Raila Odinga said that Mbeki told him that both Mugabe and Tsvangirai recognised the need for a national unity government, but that they disagreed on the timing: Tsvangirai wanted it to be formed before the run-off was scheduled to be held, while Mugabe wanted it to be formed only after the run-off. Odinga also described Tsvangirai's detention as \"detestable\" and said that the crisis could only be resolved if South Africa took \"a firm stand on the issue\".\nAlso on 5 June, the government banned all international non-governmental organisations from working in Zimbabwe; Social Welfare Minister Goche informed the National Association of Non-Governmental Organisations that their activities were banned because they had been violating the terms of those of activities. The ban on NGO activities followed accusations that the agencies were supporting the MDC. They denied these accusations, and the administrator of one of them, the United States Agency for International Development (USAID), criticised the suspension as \"a direct threat to the lives and well-being of tens of thousands of innocent people in Zimbabwe\".\nFollowing the incident involving the diplomats, Biti said at the World Economic Forum conference on 6 June that \"it is almost as if the regime is sending out a message to the region, to the international community that it doesn't care, that it has no respect for life, it has no respect for the rule of law.\" On the same day, the US embassy said that McGee would formally complain to the Zimbabwean Foreign Ministry. Meanwhile, Bvudzijena said that the diplomats had brought the problem on themselves by failing to identify themselves to the police.\nThe police refused to allow the MDC to hold rallies in Glen Norah, Kambuzuma, Mufakose, and Chitungwiza, on the grounds that the MDC had expressed fears that its leaders could be assassinated; according to the police, it was necessary to prevent the rallies so that the lives of MDC leaders would not be endangered by their appearances at the rallies. The MDC, rejecting this decision, took the matter to the High Court on 6 June, and Judge Alphas Chitakunye ruled on 7 June that the rallies should be allowed to take place without police interference.\nHaving been released on 5 June, MDC elected MP Eric Matinenga was arrested again early on 7 June and charged with incitement to public violence. Although the charge of incitement was dismissed and Matinenga's release was ordered, police continued to keep Matinenga in custody; his lawyers argued that Augustine Chihuri, the police commissioner, was guilty of contempt of court for failing to release him, and they sought to have Chihuri arrested for this. The Herald also reported on 7 June that 28 MDC supporters and eight ZANU-PF supporters had been arrested in Buhera following the discovery of a variety of weapons.\nChamisa alleged on 8 June that ZANU-PF supporters had prevented the MDC from holding one of the three rallies it planned to have in Harare that day, despite the court ruling allowing the rallies to proceed. Tsvangirai was campaigning in Bulawayo at this time. On the same day, a court ordered that Matinenga be released. Meanwhile, according to The Herald, MDC supporters killed a war veteran and wounded four other ZANU-PF supporters in an attack in Bikita district.\nOn 9 June, Deputy Attorney-General Johannes Tomana said in The Herald that anyone arrested for involvement in the violence would not be granted bail. Chamisa was critical of this, saying that the purpose of it was to keep MDC supporters in jail and predicting that it would not be applied to ZANU-PF supporters.\nThe South African newspaper Business Day reported on 10 June that representatives of ZANU-PF and the MDC (Chinamasa and Goche for ZANU-PF, Biti and Elton Mangoma for the MDC) had participated in a late May meeting in South Africa, chaired by South African Minister of Local Government Sydney Mufamadi, at which options for resolving the situation were discussed. Among the possibilities reportedly discussed was a national unity government in which Mugabe would remain President while Tsvangirai would take up a newly created post of prime minister, similar to the arrangement devised to resolve the Kenyan crisis earlier in 2008. Chamisa denied the existence of this meeting in South Africa. In Johannesburg, Makoni reiterated his opposition to holding the run-off and said that negotiations between the two parties on the formation of a unity government were underway. According to Makoni, both Mugabe and Tsvangirai had agreed to a unity government, but that an agreement had not been reached on who would be the \"top person\" under such an arrangement.\nAlso on 10 June, according to the MDC, ZANU-PF supporters threw rocks at the home of elected MDC Senator Empire Makamure and burned his car, in addition to setting ablaze two lorries belonging to a businessman thought to support the MDC. Tsvangirai said on the same day that there had been a \"de facto coup d'état\" and that Zimbabwe was \"effectively now run by a military junta\", but he vowed to continue his campaign. He said that Mugabe was ultimately to blame for what he described as \"state-sponsored violence\". According to Tsvangirai, 66 MDC supporters had been killed up to that point, in addition to 200 missing and 3,000 hospitalised. Furthermore, he said that if Mugabe was declared the winner of the election, that would only confirm \"the illegitimacy of this regime\". Tsvangirai was dismissive regarding speculation about a national unity government.\nA new campaign bus for the MDC was debuted in Harare on 11 June. According to Chamisa, this 80-seat bus—painted with the MDC's colours and featuring Tsvangirai's image—was \"a new concept to ensure we remain visible under circumstances of violence\". Tsvangirai said that the party would go to \"every town, village, to meet the people of Zimbabwe\".\nIn Masvingo, ZANU-PF officials said on 11 June that they were sending war veterans to campaign for Mugabe and work against the MDC in the province. On the same day, the government announced that it was lowering taxes for low-wage workers. Meanwhile, the MDC claimed that the government was making people remove satellite dishes so that they would lack access to foreign television, but Minister of Information Sikhanyiso Ndlovu said that in fact only one war veteran had tried to make people take down the dishes and that the government had stopped him.\nBiti returned to Zimbabwe on 12 June and was immediately arrested at the airport in Harare. Before his departure from Johannesburg, Biti said that he had already learned that he would be arrested, but maintained that his only crime was \"fighting for democracy\". Furthermore, he said that it was necessary for him to return to participate in the MDC's struggle, despite describing it as \"a stupid decision\" for him to do so. Biti also said on this occasion that talks on a national unity government had collapsed because the MDC insisted on having Tsvangirai as President and excluding Mugabe from the arrangement, while ZANU-PF insisted on Mugabe remaining President. He also expressed disappointment with regional efforts to resolve the situation and doubted that the UN would be able to resolve it, saying that Zimbabweans were \"on their own – and the sooner we realise it, the better\".\nFollowing Biti's arrest, Bvudzijena, the police spokesman, said that he would be charged with treason, based on an MDC document about changing the government. Bvudzijena said that Biti would additionally be charged with making false statements \"prejudicial to the state\" due to his announcement of election results prior to their release by the Electoral Commission. US Ambassador McGee expressed deep concern on behalf of the US government, saying that the document in question was an unobjectionable statement of the MDC's plans and goals; according to McGee, another, more extreme version of the document existed, but it was forged. He called on SADC to send \"three or four times\" as many observers as the 400 it planned to send. McGee also alleged that 20 tons of US food aid had been confiscated and distributed to ZANU-PF supporters, contrary to its intended use, in the previous week. McGee said that he had complained about this misappropriation of food aid but that he had received no response: \"The bottom line is, they don't care\".\nWhile campaigning on 12 June, Tsvangirai was detained twice; after being first detained in Kwekwe for about two hours, he was detained in Gweru, along with about 20 other MDC officials, for about four hours before being released.\nAt a ZANU-PF rally on 12 June, Mugabe said that war veterans had asked him after the first round if they could \"take up arms\". According to Mugabe, he replied that he did not want war, but he also vowed that the MDC would never take power, saying that the MDC would forfeit the gains of the liberation struggle and give Zimbabwe \"back to our former oppressors, the whites\".\nOn 13 June, Biti's lawyers said that they had not been allowed to meet with him, and they filed an urgent application with the High Court on the same day. The MDC said that it was \"deeply worried\" about Biti's welfare and that it had sent a team to police stations across Harare, hoping to determine where he was being held. Meanwhile, two MDC campaign buses were impounded by the police. The South African Litigation Centre said on the same day that a number of domestic non-governmental organisations in Zimbabwe had been ordered to cease operations by the police, while South African Deputy Minister of Foreign Affairs Aziz Pahad gave an assurance that his country would work to prevent a civil war from developing in Zimbabwe.\nIn an open letter on 13 June 39 prominent figures in Africa—including Kofi Annan, former heads of state, and civic leaders—called for a free and fair election, stressing that this was \"crucial for the interests of both Zimbabwe and Africa\".\nMugabe said at a rally on 14 June that he was willing to step aside at some point in favour of someone else from ZANU-PF, although he did not name the successor he envisioned or the time he planned for this to happen. He remarked, however, that he would \"not grow old\" \"as long as the British still want to come here\" and \"until we know we no longer have sellouts among us\". At a rally on 15 June, Mugabe said that the aid agencies had been suspended for exploiting the need for food aid by encouraging people who received the aid to vote for the MDC. Speaking at Silobela in Midlands Province, he said that \"a mere X\" (a vote) could not overturn the liberation struggle. In The Herald on 17 June, he again accused the MDC of orchestrating the violence and said that MDC leaders would soon be held responsible for violence committed by their supporters under a law regarding \"vicarious responsibility and liability\". He also said that hunger and the absence of commodities were not problems worth \"selling the country\" over.\nIn the March election, the MDC won 45 of the 46 local council seats in Harare, and Emmanuel Chiroto of the MDC was elected as Mayor of Harare by the councillors on 15 June. Ignatius Chombo, the Minister of Local Government, has not sworn in the new local administrations, and because the elected Harare councillors were not allowed to meet at Harare's Town House, they met elsewhere to elect Chiroto. On the night of 16 June, Chiroto's house in the suburb of Hatcliffe was attacked and destroyed by ZANU-PF supporters; Chiroto believed that petrol bombs were used. Chiroto's wife and son were taken away by the attackers, although his son was delivered to a police station on 16 June. His wife was subsequently found dead, and Chiroto went into hiding.\nOn 16 June, UN diplomat Menkerios arrived in Harare; he met with Mugabe on 17 June \"to discuss the technical requirements for holding the election, to see what the UN can do to help build capacity for a free and fair election\". On the same day, the Nelson Mandela Foundation announced that it had signed the open letter in support of a free and fair election, while Kenyan Prime Minister Odinga, speaking in Washington, DC, described Zimbabwe as \"an eyesore on the African continent\" and said that he was saddened by the silence of many African leaders regarding the situation. He also criticised the second round as a \"complete sham\". UN High Commissioner for Human Rights Louise Arbour said on 18 June that a member of her staff, who had arrived in Zimbabwe on 15 June, had been expelled from the country on 17 June. Also on 18 June, it was reported that Mbeki was visiting Zimbabwe, cancelling a trip to Sudan to do so. On that day, he and Mugabe met in Bulawayo. It was reported that they discussed Biti's arrest and the possibility of Mugabe meeting with Tsvangirai, but this was not confirmed. Mbeki met with Tsvangirai as well on 18 June. Mbeki reportedly wanted the second round to be cancelled in favour of a national unity government, believing that the second round would not resolve the situation. This attempt was reportedly unsuccessful, however.\nBan Ki-moon said on 18 June that he was alarmed by conditions in the period leading up to the election and that, if the situation did not improve, \"the legitimacy of the election outcomes would be in question\". Meanwhile, Gordon Brown described the Zimbabwean government as a \"criminal cabal\" and denied the possibility of a free and fair election under the existing circumstances, saying that international observers needed to be freely admitted. Rwandan President Paul Kagame was also critical, condemning the suggestions from ZANU-PF that it might not relinquish power if defeated, while Jacob Zuma also doubted that the election would be free and fair.\nAlso on 18 June, another elected MDC MP, Shuwa Mudiwa, was arrested in Harare for allegedly kidnapping a girl, while six other elected MDC MPs were declared to be wanted for allegedly engaging in violence. 11 MDC activists, accused of taking down posters of Mugabe and defacing them, were also arrested in Chinhoyi on the same day.\nBiti was charged on 19 June. He faced four charges: \"treason, communicating falsehoods prejudicial to the State, insulting President Mugabe and causing disaffection among the defence forces\".. Prosecutors argued against granting bail to Biti, noting that the charges against him were so serious that he could be executed. The defence submitted an application to have the charges thrown out, but on 20 June magistrate Mishrod Guvamombe dismissed this application, saying that he believed there was \"reasonable suspicion that the accused committed the said offence\". Biti's next court appearance was set for 7 July, and Guvamombe ordered that he remain in custody until then.\nWith state media refusing to print or broadcast the MDC's campaign material, Chamisa said on 19 June that the party had applied to the High Court seeking an order to ensure that the MDC could have its campaign material in state media. The party also challenged the police ban on MDC rallies, as well as the practice of having members of the security forces vote early by postal ballot while their superior officers were present. Zimbabwe Broadcasting Holdings (ZBH) said that it did not broadcast the MDC's advertisements because it objected to the assertions of some of these advertisements that Tsvangirai had already won the election in the first round. It also objected to what it described as \"hate language\" used in some of the advertisements, while noting that other advertisements which did not include these things were acceptable. Chamisa also said that four MDC activists, allegedly abducted by ZANU-PF supporters on 17 June, had been found dead in Chitungwiza, near Harare; he placed the party's death toll up to that point at \"about 70\".\nAlso on 19 June, Tanzanian Foreign Minister Bernard Membe, speaking for SADC, said that there was \"every sign that these elections will never be free nor fair\". According to Membe, this evaluation was based on what 211 observers already present in Zimbabwe had seen; he said that the observers witnessed two people being shot and killed on 17 June.\nMeanwhile, Mugabe, campaigning in Matabeleland North, said in reference to land reform that he would be ready to retire when he believed that \"this legacy is truly in your hands [and] people are empowered\"; he said that he treasured all Zimbabwean soil and could not allow it to be given back to the British. At a rally in Bulawayo on 20 June, Mugabe said that he was appointed by God and that he could only be removed from office by God. He also said that the MDC claimed its supporters were being victimised only so that it could use this as a basis for allegations that the election was not free and fair.\nPolice Commissioner-General Augustine Chihuri said on 20 June that the MDC was primarily responsible for the violence, alleging that the party was using its Democratic Resistance Committees to intimidate voters in an effort \"to influence the outcome of the elections\". Chihuri stressed that the police would not tolerate any violence and said that they were enforcing the law fairly and without regard for political affiliation, despite the MDC's claims to the contrary. According to Chihuri, 390 MDC supporters had been arrested for political violence since the first round, along with 156 ZANU-PF supporters. On the same day, Chamisa suggested that the MDC might withdraw from the election, saying that there was \"a huge avalanche of calls and pressure from supporters across the country, especially in the rural areas\", expressing opposition to taking part in the run-off under the circumstances. Meanwhile, in a draft statement on 20 June, the EU said that it was prepared \"to take additional measures against those responsible for violence\", which was viewed as a threat to impose stronger sanctions on Zimbabwe.\nTsvangirai's withdrawal\nAfter a planned MDC rally in Harare on 22 June was prevented by ZANU-PF supporters, Tsvangirai announced at a press conference on the same day that he was withdrawing from the election due to the violence. He said that his supporters faced being killed if they voted for him and that under such circumstances he could not ask them to do so. According to Tsvangirai, a free and fair election was impossible for eight basic reasons: \"state-sponsored violence\" (\"The police have been reduced to bystanders while Zanu PF militia commit crimes against humanity varying from rape, torture, murder, arson, abductions and other atrocities.\"); interference with the MDC's campaign, including its inability to hold rallies; the arrests of many members of the MDC, including important figures, thereby disrupting the party's organizational ability to campaign; Electoral Commission \"partisanship\" (although he said that the Electoral Commission was not really in control); media censorship, harassment of journalists, and the exclusion of foreign journalists; Mugabe's attitude and his suggestions that he would not accept defeat; and the existence of \"an elaborate and decisive plan by Zanu PF to rig the elections\", which included extensive intimidation, obstruction of MDC election agents, and ballot stuffing in the Mashonaland provinces. Tsvangirai said that the MDC would ultimately prevail and that its victory \"can only be delayed\".\nDespite Tsvangirai's withdrawal, Information Minister Sikhanyiso Ndlovu said that the second round would nevertheless be held: \"The constitution does not say that if somebody drops out or decides to chicken out the runoff will not be held\". Chinamasa dismissed the MDC's decision as \"threats\", noting that it had not been formalised; he also said that it was too late to withdraw, and that any withdrawal should have occurred at least 21 days before the first round was held. Furthermore, he said that ZANU-PF would continue its campaign and \"romp to victory\". According to Chinamasa, Tsvangirai had only been prepared for a \"sprint\", not a \"marathon\", and by leaving the country for a substantial period—\"globe-trotting and gallivanting in Europe\"—he had enabled ZANU-PF to take the advantage in campaigning. Chinamasa stated that Tsvangirai realised, after returning to Zimbabwe, that he had lost the advantage, and preferred withdrawal to suffering defeat. Additionally, Chinamasa claimed that Tsvangirai had promised 1,000 United States dollars to each of his polling agents after the first round, but had failed to pay this amount to many of them, leading them to abandon him; he also alleged that MDC supporters were wearing ZANU-PF symbols while attacking people.\nAccording to Dutch Foreign Minister Maxime Verhagen, Tsvangirai took refuge at the embassy of The Netherlands in Harare late on 22 June. The police again raided Harvest House, the MDC headquarters in Harare, on 23 June; according to MDC spokesman Luke Tamborinyoka, many of those who were in Harvest House had fled the building during the raid, but he said that police took away about 40 people. Bvudzijena, the police spokesman, said that the police had taken 39 people from the building for health reasons.\nMugabe said on 24 June that ZANU-PF was \"open to discussion\", but that the second round must be held first. He rejected any attempts at foreign interference or judgements from those with \"ulterior motives\", and he asserted that the election was a sovereign matter, with the decision belonging to the people alone. He noted that some other African elections had seen hundreds of deaths, but these elections had not received as much criticism from the West; Mugabe attributed this disparity to the West's alleged control of the MDC. He also derided Tsvangirai for taking refuge in the Dutch Embassy, saying that no one wanted to attack him and that he went to the Embassy due to anxiety about losing the election.\nThe MDC formally submitted Tsvangirai's withdrawal to the Electoral Commission on 24 June, but the Electoral Commission did not accept the withdrawal because it considered the withdrawal to have been filed too late. Also on 24 June, according to the MDC, its Senator-elect for Chimanimani, Mayemureyi Munhuri, was taken from her home at gunpoint along with her husband; the party said that about 30 other MDC activists were also abducted on that day. MDC MP-elect Pishai Muchauraya alleged that such abductions were becoming more common following Tsvangirai's withdrawal, and he accused the government of trying to prevent the withdrawal from becoming more widely known so that the second round would appear more legitimate.\nTsvangirai said in an interview with the British newspaper The Times on 26 June that if Mugabe went ahead with the election, there would be no further possibility of negotiations and he would \"not speak to an illegitimate president\". He also indicated that he did not anticipate leaving the Dutch Embassy in the near future, saying that he was \"the prime target\" and would not \"take chances\" regarding his safety; he claimed that the rule of law did not exist in Zimbabwe. Meanwhile, Tsvangirai stressed in another statement that he did not favour military intervention.\nBiti was released on bail on 26 June.\nInternational reaction\nFollowing Tsvangarai's withdrawal from the election, the UN Secretary General Ban Ki-moon said on 23 June that the election should be postponed as Tsvangarai's decision to withdraw was understandable because of the scale of violence against his supporters. He said that the \"people of Zimbabwe have the right to choose their own leader.\" He has also talked to other African leaders (especially South Africa) on this issue and said that the elections should take place only when the conditions are conducive to a free and fair vote, adding that the situation in Zimbabwe at the moment was the \"single greatest challenge to regional stability.\"\nAfrican Union Chairman of the Commission Jean Ping described the events as \"a matter of grave concern\". On 25 June, SADC called for the election to be delayed and for \"meaningful talks\" to take place between ZANU-PF and the MDC, stating that \"the people of Zimbabwe can solve their own problems\".\nRepresentatives of South Africa's ruling African National Congress party rejected the idea of foreign intervention into Zimbabwean affairs, especially by the former colonial powers.\nZimbabwean Government reaction\nZimbabwean officials hailed the decision by the United Nations Security Council to block efforts by the United Kingdom, the United States, and France to halt the run-off. The key role was played by South Africa's Ambassador to the UN, Dumisani Khumalo.\nSecond round voting and aftermath\nThe second round was held as planned on 27 June, and Tsvangirai's name remained on the ballot. Voting took place over the course of 12 hours, ending at 7&nbsp;pm. Mugabe and his wife Grace voted in Highfield Township, near Harare, and he said that he was \"optimistic [and] upbeat\". Tsvangirai denounced the vote, describing it as \"an exercise in mass intimidation\", and called on other countries to not recognise the results, saying that to do so would mean \"denying the will of the Zimbabwean people and standing in the way of a transition that will deliver peace and prosperity\".\nAccording to official media, turnout was high and the MDC's call for a boycott was not followed. The Herald described turnout as \"massive\". There were reports that some people were pressured or forced to vote, as well as reports that voter secrecy was not respected in some places.\nThe spokesman of the Pan-African Parliament (PAP) observer mission, Khalid A. Dahab, said that there was \"a lot of tension\" and the situation was \"not normal\". The PAP observer mission also said that there were a substantial number of spoiled ballots and that turnout was \"very, very low\". The BBC reported that ZANU-PF militias went to homes in townships near Harare to pressure people into voting. According to the Zimbabwe Election Support Network, people were forced to vote in rural areas.\nAlthough results were expected on 28 June, the Electoral Commission announced on that day that they would be delayed so that the collation of votes from some rural areas could be completed. Also on 28 June, Mugabe declared that trends from the results showed him winning overwhelmingly; he said that he had won in all 26 of the constituencies in Harare, despite the MDC's victory there in the first round. Chamisa said on the same day that the election was \"an unbelievable sham\" and \"a farce\", and he criticised Mbeki for \"acting as a shield for a rogue regime\".\nHuman Rights Watch (HRW) said in a statement on 29 June that in two Harare neighbourhoods ZANU-PF supporters inflicted beatings on people who did not vote; non-voters were reportedly identified either by the absence of indelible ink on their fingers or by their absence from a list of those who had voted. HRW is part of a network of organisations associated with George Soros, which also includes the Open Society Initiative for Southern Africa and Zimbabwe Congress of Trade Unions, parent organisation of the MDC.\nThe Electoral Commission announced results on 29 June, showing Mugabe with 2,150,269 votes against 233,000 for Tsvangirai, or 85.51% of the vote; turnout was placed at 42.37%, and 131,481 ballots were spoiled. Mugabe was promptly sworn in for another term as president by Chief Justice Godfrey Chidyausiku at State House about an hour after the announcement of results.\nSpeaking immediately after being sworn in, Mugabe called for \"serious dialogue\" between political parties to promote greater \"unity and cooperation\". He also praised Mbeki's role in the situation, saying that the country was \"indebted to his untiring efforts to promote harmony and peace\", and he thanked \"many African states, members of the Non-Aligned Movement, allies and friends in the United Nations Security Council and other progressive movements ... for their unwavering solidarity with us as we continue to face the vicious onslaught by Britain and its allies\". Mugabe said that he was \"honoured and humbled\" by his re-election and pledged that his government would concentrate on empowering the people in all sectors of the economy as part of efforts to \"improve the economy and living standards.\" Furthermore, he expressed satisfaction that, in his view, the electoral process had met \"all constitutional requirements\". He then left Zimbabwe later on the same day to attend an AU summit in Egypt.\nTsvangirai was invited to Mugabe's swearing in ceremony, but he refused to attend. According to a presidential spokesman, George Charamba, this invitation was extended to Tsvangirai \"in the spirit of the president's wish to reach out\" and that it was \"a major step towards political engagement\". The spokesman of the MDC-Mutambara faction, Gabriel Chaibva, attended the ceremony, saying that he expected to be criticised for his presence but that he felt it was necessary to look forward and embrace dialogue.\nBiti rejected the possibility of power-sharing on 1 July, saying that by holding the election ZANU-PF had \"totally and completely exterminated any prospect of a negotiated settlement\". The government also dismissed the possibility on the same day, saying that Zimbabwe could solve its political issues in its own way, without copying the Kenyan power-sharing model.\nAfter the AU called for dialogue between ZANU-PF and the MDC, Mbeki said on 2 July that Mugabe was agreeable to this and expressed his commitment to dialogue. Information Minister Ndlovu also expressed the government's commitment to dialogue and said that the AU's resolution was in line with Mugabe's statements at his inauguration. Tsvangirai, however, rejected dialogue, saying that violence and \"persecution\" must stop first. He also said that dialogue should lead to the establishment of a transitional government, the creation of a new constitution, and then a new election, rather than merely a national unity government.\nOn 2 July, CNN reported that 220 Zimbabweans fled to the US Embassy in Harare, seeking refuge from election-related violence. Many of the refugees are supporters of MDC.\nAlthough the AU summit called for dialogue and a national unity government, it declined to adopt the kind of tough measures against Zimbabwe that were favoured by Western countries. Mugabe returned to Zimbabwe on 4 July and was welcomed by a celebratory crowd of about 4,000 at the airport in Harare. Speaking at the airport, he said that dialogue would only be possible if the opposition acknowledged his victory, declaring that the votes of his supporters would \"never be thrown away\". Chamisa said on the same day that this condition was unacceptable.\nNegotiations between the MDC and ZANU-PF regarding the formation of a national unity government began later in July. Human Rights Watch released a report on 12 August 2008 in which it said that at least 163 people had been killed by ZANU-PF supporters throughout the election period and up to the time of the report; 32 of these deaths, according to the report, occurred after the second round, and two of them had occurred after the start of negotiations. The report also said that 5,000 people had been beaten and tortured, and it described criminal charges against 12 elected MDC members of parliament as \"politically motivated\".\nIn early August, the Supreme Court ruled that the Electoral Commission's refusal to accept the nomination papers of Zimbabwe People's Party leader Justine Chiota was unlawful. Chiota followed this up by applying to the Supreme Court for the election to be nullified.\nInternational reaction to the second round\nTalks between parties\nPreliminary talks to set up conditions for official negotiations began between leading negotiators from both parties on 10 July, and on 22 July, the three party leaders met for the first time in Harare to express their support for a negotiated settlement of disputes arising out of the presidential and parliamentary elections. Negotiations between the parties officially began on 25 July and are currently proceeding with very few details released from the negotiation teams in Pretoria, as coverage by the media is barred from the premises where the negotiations are taking place. The talks were mediated by South African President Thabo Mbeki.\nA final deal was reached on 11 September 2008, possibly with Tsvangirai chairing the council of ministers and Mugabe chairing a new national security council.\nResult of the election\n{| class=wikitable style=text-align:right\n!rowspan=2|Candidate\n!rowspan=2|Party\n!colspan=2|First round\n!colspan=2|Second round\n|-\n!Votes\n!%\n!Votes\n!%\n|-\n|align=left|Morgan Tsvangirai||align=left|Movement for Democratic Change – Tsvangirai||1,195,562||47.9||233,000||9.3\n|-\n|align=left|Robert Mugabe||align=left|ZANU–PF||1,079,730||43.2||2,150,269||85.5\n|-\n|align=left|Simba Makoni||align=left|Mavambo/Kusile/Dawn||207,470||8.3||colspan=2 rowspan=2|\n|-\n|align=left|Langton Towungana||align=left|Independent||14,503||0.6\n|-\n|align=left colspan=2|Invalid/blank votes||39,975||–||131,481||–\n|-\n|align=left colspan=2|Total||2,537,240||100||2,514,750||100\n|-\n|align=left colspan=2|Registered voters/turnout||5,934,768||42.8||5,934,768||42.4\n|-\n|align=left colspan=6|Source: [http://africanelections.tripod.com/zw.html African Elections Database]\n|}\nReferences"
    }
  ]
}