{
  "content": [
    {
      "type": "text",
      "text": "# Second Battle of Swat\n\n)\n| place             = Swat Valley, Khyber-Pakhtunkhwa Province\n| coordinates       =\n| map_type          =\n| latitude          =\n| longitude         =\n| map_size          =\n| map_caption       =\n| map_label         =\n| territory         =\n| result            = Pakistani victory\n* Swat returned to government control\n* Many Tehrik-i-Taliban Pakistan commanders captured or killed\n| combatant1        =\n* Pakistan Army\n* Pakistan Air Force\n| combatant2        =   TTP\n* TNSM\nAl-Qaeda Lashkar-e-Islam\n| combatant3        =\n| commander1        =  ACM Rao Suleman LTG Masood Aslam AM Hifazat Khan LTG Ishfaq Nadeem Ahmad   MGen. Haroon Aslam MG Sajjad Ghani BRIG Muhammad Habib Ur Rehman\n| commander2        =  Maulana Fazlullah  Abu Saeed Misbah ud-Din Sultan Khan Shah Dauran Maulana Shahid  Qari Quraish Naseeb Rehman Muslim Khan Sher Muhammad Qusab Abu Faraj Nisar Ahmed\n| commander3        =\n| units1            =\n*  19th Infantry Division\n*  Special Service Group Airborne Division\n*  No. 11 Squadron Arrows\n*  No. 25 Squadron Night Strike Eagles\nFCKP(N)\n----\nLocal tribesmen\n| units2            =   TTP\n* TNSM\nAl-Qaeda Lashkar-e-Islam\n| units3            =\n| strength1         = 15,000–45,000 Regular Infantry, Frontier Corps and Airborne Forces\n| strength2         = 2,500 (approx.)\n| casualties1       = 168 killed, 454 wounded\n| strength3         =\n| casualties2       = 2,088 killed\n| casualties3       = 2 million civilians displaced\n| notes             =\n}}\nThe Second Battle of Swat, also known as Operation Rah-e-Rast, was a sub-operation of Operation Black Thunderstorm which began in May 2009 and involved the Pakistan Army and Tehrik-i-Taliban Pakistan militants in a fight for control of the Swat district of Pakistan. The First Battle of Swat had ended with a peace agreement, that the government had signed with the Tehrik-i-Taliban Pakistan in February 2009.\nHowever, by late April 2009 TTP violated majority of the terms of the agreement, and as a result government troops and the Tehrik-i-Taliban Pakistan began to clash once again, and in April the government launched a military offensive code-named Operation Black Thunderstorm throughout the Northern parts of Khyber-Pakhtunkhwa (then North-Western Frontier Province) including districts Swat, Buner, Dir, Shangla.\nSwat then being a strongest hold of TTP required specific campaign and efforts by the Pakistani Armed Forces to free it from clutches of TTP once for all. This campaign which itself was part of larger military Operation Black Thunderstorm, came to be known as \"Operation Rah-e-Rast\", whereby Pakistan Armed Forces successfully flushed out Tehrik-i-Taliban Pakistan from Swat.\nContext\nThe conflict between the Pakistani Army and Islamist insurgents is accepted to have begun on 16 March 2004 in the Battle of Wanna. Over the next number of years, different peace agreements were signed, despite the persistence of militant groups in Khyber Pakhtunkhwa. The groups' support came primarily from Pashtun tribal elements.\nIn 2007, the conflict was renewed after the attack on Lal Masjid in Islamabad. After the attack, confrontations and suicide attacks saw an uptick. On 21 August 2008, an attack on military production facilities in Wah left 70 dead and, on 20 September of that year, the Islamabad Marriott Hotel bombing left 54 dead. On the 27th of October, the Pakistani government reacted with the First Battle of Swat to retake the valley from occupying militias, the Tehreek-e-Nifaz-e-Shariat-e-Mohammadi and the Tehrik-e-Taliban Pakistan.\nBattle for Mingora City\nFighting commenced in the largest and main city of the district, Mingora, between elite Pakistani commandos and about 300 Taliban militants positioned in deserted buildings and continued until 23 May 2009, when a major Pakistani offensive retook much of the city. Amid heavy street fighting, the Pakistani Army captured large parts of the city, including several key intersections and squares.\nOn 24 May, the Pakistani Army announced it had retaken large parts of Mingora. Major-General Athar Abbas, the Army's chief military spokesman, announced that \"we want to eliminate the entire [Taliban] leadership\". Pakistani soldiers continued to engage the Taliban in street fighting and search buildings for Taliban fighters. Pakistani troops also retook several nearby towns previously under Taliban control.\nOn 30 May, the Pakistani military announced that it had regained control of all of Mingora, though small pockets of resistance still remained in the city's outskirts. Fighting between Pakistani forces and Taliban militants continued in other areas. The Pakistani army claimed the death toll to be 1,200 Taliban fighters and 90 Pakistani soldiers.\nThere were believed to be 200,000 people in Mingora as recently as a week prior to the eruption of hostilities. Following the lifting of a curfew, as of 23 May a large exodus left what was believed to be only 10,000–20,000 civilians in the town.\nExpansion of operation\nAfter retaking the town of Mingora, the military moved on to Malam Jabba and Qamabr Bazar, taking those towns and killing the TNSM leaders of those towns. On May 29, the Army cleared Aman Kot and the Technical Institute College on the Mingora-Kokarai road in Mingora. On the same day, the village of Peochar in the Peochar Valley, as well as the town of Bahrain in the north of Swat, had been taken by the military. Sporadic fighting went on in the rest of Swat and in the Shangla district.\nCapture of Taliban commanders\nOn June 4, 2009, it was reported that Sufi Muhammad, the founder of Tehreek-e-Nafaz-e-Shariat-e-Mohammadi or TNSM, was arrested in Amandarra along with other militant leaders. In the coming days there was confusion over this claim since the Taliban themselves said that Muhammad was missing. However, several days later it was confirmed that Sufi Muhammad was not captured and was in hiding, while two of his aides were captured by the Army. Those two aides, Muhammad Maulana Alam and Ameer Izzat Khan, were killed when militants attacked the prison transport they were in on June 7.\nOn June 6, the Taliban attacked Gul Jabba Checkpoint. This attack was repulsed, but cost the life of Captain Fiaz Ahmad Ghunian of the 72nd Punjab Regiment Pakistan Army.\nOn June 12, in response to a bomb explosion at a mosque that killed 38 civilians, local Pakistani militia numbering between 1,000 and 1,500 surrounded almost 300 militants. The Pakistani army sent Helicopter Gunships to provide air support to militia fighting in the villages of Shatkas and Ghazi Gai, where the fiercest fighting took place. Pakistani paramilitaries also set up mortar positions on the high ground overlooking the villages. 20 homes suspected of housing Taliban fighters were destroyed. 11 Taliban militants were killed in the fighting. On June 12, the Pakistani army captured the town of Chuprial in a fierce battle. 39 Taliban fighters and 10 Pakistani soldiers were killed. On June 14, Pakistani soldiers began to clear the last pockets of resistance. On July 15, clashes throughout the Swat valley left 11 Taliban militants and 1 Pakistani soldier dead, with the heaviest fighting taking place in the town of Kabal. The refugees that had fled their homes also began to return on July 15.\nFinal assault\nOn September 11, 2009, the Pakistan Army announced that Muslim Khan and four other senior TNSM commanders were captured near Mingora.  Maulana Fazlullah was actually hit in two air strikes and was critically wounded and stranded for some time in Imam Dehri without any access to medical assistance.\nSuccess of operations\nBy August 22, 2009, 1.6 million of 2.2 million refugees returned home, as per UN estimates. On January 11, 2010, Hayatullah Hamyo one of the TTP commanders in Swat was captured in Orangi Town in Karachi where he was keeping a low profile by working for PTCL (Pakistan Telecommunication Company Ltd).\nSee also\n* 2009 refugee crisis in Pakistan\n* First Battle of Swat\n* Operation Black Thunderstorm\n* War in North-West Pakistan\nReferences"
    }
  ]
}