{
  "content": [
    {
      "type": "text",
      "text": "# Second Shō dynasty__disambig_1\n\n|titles         = )|Shuri-ten-ganashi ()|King of Ryukyu}}\n|current head   = Mamoru Shō\n|founded  = 1469\n|founder        = Shō En\n|deposition     = 1879\n|final_ruler    = Shō Tai\n|cadet branches =\n}}\nThe |第二尚氏王朝|daini Shō-shi ōchō}} was the last dynasty of the Ryukyu Kingdom from 1469 to 1879, ruled by the |第二尚氏|daini Shō-shi}} under the title of King of Chūzan. This family took the family name from the earlier rulers of the kingdom, the first Shō family, even though the new royal family has no blood relation to the previous one. Until the abolition of Japanese peerage in 1947, the head of the family was given the rank of marquess while several cadet branches held the title of baron.\nKings of Chūzan\nThe second Shō family claims Izena Island to be its ancestral home. Born on the small island lying off the northwestern coast of Okinawa Island, its founder Kanemaru traveled to Shuri in 1441, and became a retainer of Prince Shō Taikyū. He was appointed as the treasurer after Shō Taikyū became the king. After a coup d'état in 1469, Kanemaru set aside King Shō Toku's family and ascended to the throne. Assuming the family name of Shō, he pretended to be the crown prince of Shō Toku, which resulted in his reign being accepted by the Ming dynasty in 1471. The kingdom reached its peak during the reign of the third king Shō Shin.\nWith the approval of the Tokugawa shogunate, the Satsuma Domain conquered Ryūkyū in 1609. The Tokugawa shogunate decided to keep the small polity as a separate entity, with intent to make it work as a broker in the shogunate's failed attempt to establish diplomatic relations with China. After several twists and turns, Ryūkyū's position within the shogunate was finalized in 1634. Ryūkyū, with its kokudaka assessed as 123,700 koku, was recognized as part of the Satsuma Domain, though it was excluded from the . In 1635, Satsuma Domain ordered Ryūkyū's rulers to use the title of  instead of \"king\". After that, the Ryukyuan ruler signed \"Ryūkyū kokushi\" in the diplomatic letter to Japan. However, the rulers during this period were referred to  in their  () inscriptions in the family mausoleum Tamaudun. The title King of Chūzan was also remained in the diplomatic letter to China, concealing its vassalage to Satsuma. In 1712, Satsuma changed the policy and allowed the ruler to style himself King of Chūzan.\nIn 1872, the Meiji government recognized the Ryūkyū Kingdom as a han and renamed it , Shō Tai was appointed as . In 1879, the Meiji government abolished the Ryūkyū Domain, and the last king Shō Tai abdicated.\nPeerage\nAfter the establishment of Japanese peerage, the last king Shō Tai was given the rank of marquess. Shō Tai's three close relatives were given the rank of baron. The son of the last regent Ie Chōchoku, who was from a cadet branch of the Shō family, was also given the rank of baron.\n* Marquess Shō Tai (1885–1901), the last king\n** Marquess Shō Ten (1901–1920), the eldest son of Shō Tai\n*** Marquess Shō Shō (1920–1923), the eldest son of Shō Ten\n**** Marquess Shō Hiroshi (1923–1947), the eldest son of Shō Shō\n* Baron Shō In (1896–1905), the second son of Shō Tai\n** Baron Shō Rin (1905–1947), the eldest son of Shō In\n* Baron Shō Jun (1896–1945), the fourth son of Shō Tai\n** Baron Shō Sei (1945–1947), the second son of Shō Jun\n* Baron Nakijin Chōfu (1890–1915), a younger brother of the last king\n** Baron Nakijin Chōei (1916–1943), a grandson of Nakijin Chōfu\n*** Baron Nakijin Chōshū (1943–1945), the eldest son of Nakijin Chōei\n* Baron Ie Chōei (1890–1904), the eldest son of Ie Chōchoku, the last regent\n** Baron Ie Chōshin (1905–1921), the eldest son of Ie Chōei\n*** Baron Ie Chōjo (1921–1947), the eldest son of Ie Chōshin\nNames\nThe Chinese-style surname (sei) was used for diplomatic relations with China. The second Shō family took the surname Shō from the first Shō family only to disguise the coup d'état as a normal succession. Domestically, direct references to the king's personal name were avoided because they were considered rude.\nThe royal surname was managed in a rather Japanese-like manner. With some exceptions, only the immediate family members of the king were allowed to take the surname Shō (尚). Cadet branches used different surnames. In 1691, the king ordered all the cadet branches to assume the surname Shō (向), no matter how distant they were from the king. This new surname was pronounced the same as the king's one but had a different kanji with fewer strokes (an example of a Naming taboo).\nIn Ryūkyū's administrative documents and in relation to Satsuma, the Shō family's male members except the king used Japanese-style names, which consisted of kamei (house name), ikai (rank), and nanori (given name). A kamei referred to a land in which the samurai was enfeoffed by the king. Because the Shō family members occupied a large portion of high-ranking positions, they often changed their kamei during the course of their career. A nanori, which was given when the person reached adulthood, consisted of two kanji. The first character, called nanori-gashira, was shared by all the male members of a lineage. In other words, the \"given name\", not the \"house name\", effectively indicated the person's lineage. The king's order of 1691, mentioned above, also designated Chō (朝) as the Shō family's nanori-gashira. The character Chō (朝) was chosen to indicate an affinity to Minamoto no Tametomo (源為朝), who by that time had been considered to be the father of Shunten, the legendary king of Chūzan. While the Chūzan Seikan (1650) only presented a wishful speculation that Shō En's father might have descended from a former king, Sai On's edition of the Chūzan Seifu (1725) explicitly referred to Gihon as a possible ancestor, connecting the second Shō family to the Minamoto clan through Shunten.\nUnder the modern Japanese naming regulation, a person has only two name components, a family name and a given name. Only the last king Shō Tai and his children chose the Chinese-style surname Shō (and accordingly, Chinese-style given names for males). The other members of the family chose the combinations of kamei and nanori. Hence, the king's younger brother is referred to as Nakijin Chōfu, not Shō Hitsu.\nFamily crest\nThe second Shō family adopted as its mon or family crest the mitsudomoe, which is otherwise closely associated with the Shinto deity Hachiman and Hachiman shrines in Japan. It was called  in Okinawa. Since it was the royal family's crest, its usage was once severely restricted in Okinawa. Because of this, Okinawans who visited Japan shortly after the annexation of the kingdom were surprised that mitsudomoe banners were flown everywhere.\nThe adoption of the Hidari Gomon is attested to the last ruler of Okinawa's First Shō Dynasty, King Shō Toku. The King, possibly inspired by Japanese pirates who worshipped the Japanese god of war, Hachiman, adopted Hachiman's symbol and led an invasion of Kikai Island in 1467, later building the Asato Hachimangū shrine and taking the divine name of Hachiman-aji in response to his victory. Corroborating this was the discovery of a wooden coffin inscribed with a mitsudomoe and the year 1500 found in the Momojana tombs in Northern Okinawa.\nFamily tree\n| Tei=Shō Tei| Gen2=Shō Gen 尚元b.1528–d.1572; r.1556–15725| boxstyle_Gen2=border-width:2px| Yos=Shō YōsōKatsuren Chōsō| Kan=Shō Kanshin| Kan2=Shō KanChatan Chōri| Han=Shō HangokuKochinda Chōten| Sok=Shō SōkenIe Chōgi| Kot=Shō KōtokuYomitan Chōbyō}}\n| boxstyle_Bok=border-width:2px| Wa=Shō WaYomitan Chōken}}\nReferences"
    }
  ]
}