{
  "content": [
    {
      "type": "text",
      "text": "# Second Battle of Vác (1849)\n\n| combatant2        =\n| commander1        =\n| commander2        =\n| strength1         = Total: 27,834 men (48 1/2 cavalry companies = 4,832 men) - I. corps: 8,726 - III. corps: 9,277 - VII. corps: 8,631 - Detachment of Ármin Görgey: 800 - 13. Hussar regiment: 400 147 cannons\n| strength2         = 52,831 men (88 cavalry companies) - II. infantry corps: 24,733 - III. infantry corps: 28,098 234 cannons\n| casualties1       = ~1,400\n| casualties2       = 452\n}}\nThe Battle of Vác, fought between 15 and 17 July 1849, was one of two important battles which took place in Vác during the Hungarian War of Independence. This battle, fought between the Russian Empire's intervention forces led by Field Marshal Ivan Paskevichand and the Hungarian Army of the Upper Danube led by General Artúr Görgei, was part of the Summer Campaign. After the lost battle of Komárom from 11 July 1849, Görgei tried to lead his army to the planned concentration point of the Hungarian troops around Szeged, but the Russians cut his road at Vác. In the battle, the still convalescent Görgei (who was suffering from a head injury suffered in the battle of Komárom fought on 2 July) managed to capture Vác from the Russians, repulse the Russian attacks, then to retreat towards North-East, as much superior Russian forces arrived. Fearing that Görgei will cut their supply lines, after the battle, the four times bigger Russian army, instead of marching towards Szeged in order to unite with the Austrian main army of Field Marshal Julius Jacob von Haynau, and to crush the much weaker Hungarian forces which were gathering there, followed Görgei's retreating troops, enabling them to arrive to the Hungarian concentration point with several days in front of them, creating the condition to unite with the Southern Hungarian troops, and crush the Austrian army of Haynau before the Russians arrived (it was not Görgei's fault that this opportunity failed, but mainly Henryk Dembiński's who, as the Hungarian commander of the Southern main forces, instead of North, he marched towards South, and met Haynau alone in the Battle of Temesvár). Considering the fact that the actual plan of Görgei was to arrive to the concentration point before the Russians, and, as a result of the battle of Vác from 15 to 17 July, he managed to achieve this, this battle is considered a strategic victory for the Hungarians.\nBackground\nAfter the Hungarian defeat at Third Battle of Komárom (11 July), it had become clear for Görgei's, that his plan, expressed by him, in front of his officers, during the deliberations from 6 July, to remain, with his troops in Western Hungary, operating independently, and defying Governor Lajos Kossuth's orders to move with the Army of the Upper Dunabe to the concentration point of all the Hungarian armies to Szeged, could not be fulfilled. This situation left him only two options: one was to remain at Komárom, but this could threaten him to be locked inside the fortress, and, in case of a Russian advance in that direction, to be besieged there, and the second option was to fulfill Kossuth's order, and march with the bulk of his army on the left (Northern) bank of the Danube, which was still from the Austrian troops, which occupied the whole right side after their victory from 11 July. The war council held in the evening of the battle decided the second option, but left General György Klapka with the II. and VIII. corps (around 20,000 soldiers: 22 infantry battalions, 12 cavalry companies, and, besides the fortress guns, 48 field cannons) to defend Komárom.\nThe Russian main troops entered in Hungary on the middle of June through the Northern Carpathian Mountains. On 15 June the III. corps led by Cavalry General Friedrich von Rüdiger entered Hungary at Ófalu, on 17–19 June the main army corps (the II. and the IV.) led by Field Marshal Ivan Paskevich entered in Hungary in four smaller columns and a reserve column. On 19 June there were already 100,000 Russian troops between Lubló and Ladomérmező, and started their advance towards Eperjes and Kassa. On 17 June the Russian independent detachment, numbering 18,000 soldiers, led by Lieutenant General Pavel Grabbe entered in Hungary at Alsókubin, defeating on 22 June the 3,500 soldiers of Ármin Görgey (Artúr Görgei's brother) at Túrócszentmárton, and occupied the mining towns from Northern Hungary (Besztercebánya, Körmöcbánya, Igló, Selmecbánya, etc.). The Hungarian troops facing the main Russian army led by Paskevich, were the IX. corps under the commandership of General Józef Wysocki, comprising 4 brigades, and the independent Kazinczy division, but the latter, being positioned in the Ung, Bereg and Máramaros counties, where in the next two months almost no military activity occurred, except one single battle (28 July at Klimec), his troops numbering 7,000 soldiers, were left outside the military actions. So Wysocki's 9,600 soldiers and 23 guns had to face alone the more than ten times bigger Russian armies. In this situation the Polish general could apply only one reasonable tactic: to delay the Russian advance. From time to time he stopped, deployed his troops, forcing the Russians to do the same, and although every time suffered defeats (on 20 June at Lófalu and Héthárs, and on 23 June at Somos), but he managed to delay their advance. Despite this the Russian troops reached at 23 June Eperjes and on 24 Kassa. On 28 June the Russian troops reached Miskolc and Tokaj, where, after a successful battle, they took control over the crossing point over the river Tisza. At Miskolc the Russian army had to stop difficulties because of the cholera epidemic which swept through the country and also the difficulties of the food supply, Paskevich sending Lieutenant General Tscheodayev with a corps across the Tisza to occupy Debrecen to gather food there, then to return from there, and meet with the main troops at Tiszafüred at 9 July. Tscheodayev accomplished his task, arriving back to Tisza at Tokaj at 9 July, and met again with Paskevich at Miskolc in the same day. Now having food supplies for 25 days, Paskevich started his march against Pest through  Kápolna, Mezőkövesd, Gyöngyös and Hatvan.\nPrelude\nOn 12 July evening, Görgei marched out of Komárom towards the East on the Northern shore of the Danube. Görgei had at his disposal the I., III., and VII. corps and the column of Ármin Görgey, in total around 27,000 men (35 infantry battalions, 45 cavalry companies, and 140 cannons). At 7.00 p.m. the column of Ármin Görgey left the first the fortress, then at 9 the I. corps, while the III. and the VII. corps left Komárom after midnight. The march was organized in such a way that the troops could enter in battle formation if they were attacked, leaving their luggage behind them, and the distance between the marching corps was short enough to be able to support each other's if they were attacked. On the 13th Artúr Görgei was still very ill as a result of his serious wounding in the battle of Komárom on 2 July, and because of this he could not lead his troops from horseback but followed them in a light carriage.\nDuring the night of 14 to 15 July, at Hatvan, Paskevich heard that Görgei's troops started their march towards Vác. Upon this Paskevich sent the II. and the III.corps towards Vác, to cut Görgei's route to the South, towards Szeged, and he sent the IV. corps led by Tscheodayev to Miskolc, considering the eventuality that Görgei wanted to march in that direction to cut off the Russians supply routes.\nOpposing forces\nCommander in chief: General Artúr Görgei;\n226 ½ infantry companies, 48 ½\tcavalry companies, 147 cannons,\t27,834 soldiers.\n{| class=\"wikitable\"\n! width=20% | Corps\n! width=20% | Division\n! width=5% | Infantry company\n! width=5% | Cavalry company\n! width=5% | Saddled horse\n! width=5% | Traction horse\n! width=5% | Cannon\n! width=5% | Number\n|-\n| rowspan=6 |\nI. Corps\n&nbsp;&nbsp;\nGeneral József Nagysándor\n|-\n|\nMáriássy infantry division\n&nbsp;\nColonel János Máriássy\n| 30\n| -\n| 29\n| 228\n| 17\n| 3,541\n|-\n|\nBobich infantry division\n&nbsp;\nColonel János Bobich\n| 36\n| -\n| 27\n| 172\n| 20\n| 3,231\n|-\n|\nMesterházy cavalry division\n&nbsp;\nColonel István Mesterházy\n| -\n| 12\n| 1,133\n| 96\n| 6\n| 1,297\n|-\n|\nSappers and guerillas\n| 7\n| -\n| -\n| -\n| -\n| 684\n|-\n| Total\n| 73\n| 12\n| 1,189\n| 496\n| 43\n| 8,726\n|-\n| rowspan=6 |\nIII. Corps\n&nbsp;&nbsp;\nGeneral Károly Leiningen-Westerburg\n|-\n|\nCzillich infantry division\n&nbsp;\nColonel Ede Czillich\n| 35\n| -\n| 20\n| 199\n| 16\n| 3,664\n|-\n|\nFöldváry infantry division\n&nbsp;\nLieutenant Colonel Károly Földváry\n| 36\n| -\n| 16\n| 93\n| 10\n| 3,519\n|-\n|\nPuchly cavalry division\n&nbsp;\nLieutenant Colonel János Puchly\n| -\n| 16\n| 1692\n| 106\n| 6\n| 1,801\n|-\n|\nArtillery reserve\n| -\n| -\n| 21\n| 237\n| 14\n| 293\n|-\n| Total\n| 71\n| 16\n| 1,749\n| 635\n| 46\n| 9,277\n|-\n| rowspan=6 |\nVII. Corps\n&nbsp;&nbsp;\nGeneral Ernő Poeltenberg\n|-\n|\nPosta infantry division\n&nbsp;\nMajor Ferenc Posta\n| 32\n| -\n| -\n| 95\n| 8\n| 2,750\n|-\n|\nLiptay infantry division\n&nbsp;\nLieutenant Colonel Ferenc Liptay\n| 34\n| -\n| -\n| 96\n| 6\n| 3,025\n|-\n|\nBerzsenyi cavalry division\n&nbsp;\nColonel Lénárd Berzsenyi\n| -\n| 16\n| 1,408\n| 312\n| 23\n| 1,766\n|-\n|\nColumn of Lieutenant Colonel Johann Weissl\n| 11\n| -\n| -\n| 273\n| 11\n| 1,090\n|-\n| Total\n| 77\n| 16\n| 1,408\n| 776\n| 48\n| 8,631\n|-\n| rowspan=2 |\n|\nDetachment of Lieutenant Colonel Ármin Görgey\n| 5 ½\n| ½\n| 86\n| 85\n| 10\n| 800\n|-\n| rowspan=1 |\n13. Hussar Regiment\n| -\n| 4\n| 400\n| -\n| -\n| 400\n|-\n| Grand total\n|\n| 226 ½\n| 48 ½\n| 4,832\n| 1,992\n| 147\n| 27,834\n|}\nCommander in chief: Field Marshal Ivan Paskevich;\n237 infantry companies, 88\tcavalry companies, 234 cannons,\t52,831 soldiers.\n{| class=\"wikitable\"\n! width=30% | Corps\n! width=30% | Division\n! width=10% | Infantry company\n! width=10% | Cavalry company\n! width=10% | Cannon\n! width=10% | Number\n|-\n| rowspan=8 |\nII. Infantry Corps\n&nbsp;&nbsp;\nLieutenant General Pavel Jakovlevich Kupriyanov\n|-\n|\n2. light cavalry division\n&nbsp;\nLieutenant General\n| -\n| 27\n| -\n| 3,360\n|-\n|\n4. infantry division\n&nbsp;\nLieutenant General Anton Mihaylovics Karlovich\n| 48\n| -\n| -\n| 7,296\n|-\n|\n5. infantry division\n&nbsp;\nLieutenant General Anton Mihaylovics Karlovich\n| 56\n| -\n| -\n| 9,127\n|-\n|\nOther infantry units\n| 5\n| -\n| -\n| 895\n|-\n|\n2. artillery division\n&nbsp;\nLieutenant General Adam Yosipovich Serjputovskiy\n| -\n| -\n| 114\n| 3,176\n|-\n|\nOther units\n| -\n| 6\n| -\n| 897\n|-\n| Total\n| 109\n| 33\n| 114\n| 24,733\n|-\n| rowspan=8 |\nIII. Infantry Corps\n&nbsp;&nbsp;\nLieutenant General Friedrich von Rüdiger\n|-\n|\n3. light cavalry division\n&nbsp;\nLieutenant General Ivan Petrovich Offenberg\n| -\n| 32\n| -\n| 3,829\n|-\n|\nCossack regiments\n| -\n| 12\n| -\n| 1,296\n|-\n|\n7. infantry division\n&nbsp;\nLieutenant General Petr Fydorovich von Kaufman\n| 64\n| -\n| -\n| 9,583\n|-\n|\n8. infantry division\n&nbsp;\nLieutenant General Anton Grigoryevich Lisetskiy\n| 40\n| -\n| -\n| 5,855\n|-\n|\n9. infantry division\n| 24\n| -\n| -\n| 3,432\n|-\n|\n3. artillery division\n&nbsp;\nMajor General Ivan Petrovics Miller\n| -\n| -\n| 120\n| 3,053\n|-\n|\nOther units\n| -\n| 11\n| -\n| 1,050\n|-\n|\n| Total\n| 128\n| 55\n| 120\n| 28,098\n|-\n| Grand total\n|\n| 237\n| 88\n| 234\n| 52,831\n|}\nBattle\n15 July\nOn the morning of 15 July, the Hungarian vanguard formed by the detachment of Ármin Görgey approaching Vác found the Transcaucasian Muslim cavalry led by prince Colonel David Osipovich Bebutov at Nagymaros and Verőce, and in the fight which followed, they chased them out of these localities and also from Vác, pursuing them until Újfalu. At 10 a.m. the I. Hungarian corps arrived in Vác and occupied their defensive positions in front of the Seven Chapels hill (Hétkápolna domb), between the Gombás creek and the Danube. Hearing about this, General Rüdiger at 9 a.m. ordered Lieutenant General Offenberg to ride with his own cavalry division and the 1. brigade of the 2. cavalry division to ride to Vác from the direction of Kisújfalu, and to General Grigory Zass, who was leading the Russian vanguard, to join with his cavalry and cavalry artillery Bebutov, but leave his infantry back at Gödöllő, hoping that in this way they can avoid to enter in battle with the Hungarians before the rest of the Russian troops arrived. But Zass did not followed Rüdiger's plan, advancing with all his troops to Vác, arriving at noon to Sződ.\nBeing informed about Zass's troops arrival in the vicinity of Sződ by the vanguards installed on the Duka hill, the commander of the Hungarian I. corps, József Nagysándor sent the detachment of Ármin Görgey from their positions along the Gombás creek, to occupy the Duka hill and the wineyards from Sződ before the Russians. But General Grigory Zass advanced with all his combat arms before Ármin Görgey's detachments could arrive, his Cossacks pushing out of the wineyards of Sződ and the hills of Csörög the vanguards, then also the detachment of Ármin Görgei, which arrived a little later there. Ármin Görgey's detachment retreated in continuous fighting with the advancing Russians towards the railway embankment where the I. corps artillery was placed, which started to shoot in the advancing Russians, stopping them. Although suffering heavy losses because of the Hungarian artilleries fire, after being reinforced by the infantry, Zass's cavalry, started again to advance on the plain fields from South of Vác, but the Hungarian artillery, now reinforced also with the artillery of the newly arrived III. corps, which tried to encircle the Russians right, stopped them, and forced Zass to retreat. At 3,45 p.m. the Russian 3. light cavalry division and the 1. brigade of the 2. cavalry division led by Lieutenant General Offenberg arrived before Vác, then he sent a part of his cavalry against the Hungarian right wing. Nagysándor to stop the Cossacks, sent against them the 1. (Imperial) Hussar Regiment, but they were pushed back by the much superior Russians, but soon the crossfire of the well hidden Hungarian artillery forced the Russian cavalry to retreat. Around 4,30 p.m. the commander of the III. corps, General Rüdiger too arrived on the battlefield, reinforcing the Russian right wing with a cavalry regiment and a cavalry battery, and the left wing with two cavalry batteries. Rüdiger despite feeling that the Hungarians were superior, he did not wanted to renounce immediately to the already occupied positions, thinking that this would have a negative effect on his troops morale, and the Hungarians can attack and crush the retreating Russian troops. So he ordered to his artillery to continue its duel with the Hungarian arrtillery, which inflicted further losses on the Russians. Finally Rüdiger, seeing that his artillery is inferior to the Hungarians, he retreated his troops, leaving only small vanguards on the Duka hill and in the wineyards from Sződ. Paskevich, who now was approaching Vác, heard about the starting of the battle, and urged the II. and the III. corps march and deployment on the battlefield, in order to start a decisive attack against Görgei's troops. In this day the Russian losses were 80 dead soldiers and 120 wounded, and half of the batteries damaged. The Hungarian losses are unknown.\nThe Hungarian VII. corps arrived in the late hours to Vác. Now, having all his troops at his disposal, Görgei thought that he has two possibilities. One was to march away with his army, before the Russian attack expected in the next day, to Gödöllő, and to try to enter in contact with the Hungarian troops from the South, or to remain, and to face the Russians attack. Actually he had a third option too: to return to Komárom, but he did not even wanted to think about this. Seeing that his army is too tired to continue its march, he decided to remain, and rest at Vác.\n16 July\nPaskevich was angered when he heard that Zass, defying Rüdiger's order, took also his infantry on his march towards Vác, believing that this decision could put his troops in danger of annihilation. So he sent on 15 July the II. and the III. corps towards Vác, designing them to meet at Kishartyán. The Russian troops march was slow, so the last units of them reached Kishartyán only in the next day around 2,30 p.m. So on 16 July the Russians were preoccupied with deploying their troops. Although Paskevich came to Kishartyán around the dawn, hoping for all his troops to arrive there early enough to send them to attack against the Hungarians at 4 p.m., seeing their late arrivings, and fatigue, he was forced to postpone the attack to 17 July. The wrong reports about the strength of the Hungarians (40,000 soldiers and 160 cannons, which were in reality only about 27,000 soldiers and 147 cannons), also strengthened his decision to keep his troops away from a battle.\n: Görgei and his general staff after he was wounded in the Battle of Komárom at 2 July 1849, wearing, an Arabic style headscarf to protect his wound]]\nOn the morning of this day Görgei's medic, Lajos Markusovszky noticed that the headwound of the Hungarian commander became festered, so he had to open his wound, clean it, and sew it back. During this operation on his skull, Görgei was on his feet, leaning to the bowl used by the physician for the surgery. Soon after the surgery ended, at 11.00 a.m., Görgei was on horse, inspecting the Russians movements. Hoping to continue his march towards South, by breaking through the enemies lines, but being unsure about the Russian troops strength, Görgei decided a reconnaissance-in-force, in order to learn more about the enemy forces strength. He planned to send at 4 p.m. Ármin Görgey to do this task by advancing towards Hartyán, but shortly before that it was reported to him that Russian columns advance in compact order through the wineyards from Sződ and on the Duka hill, hearing also some rumours about the approach of an Austrian corps from Pest towards Vác, which convinced him that he faces from South and South-East much superior enemy forces, and against them a break through towards South is impossible. So he decided to avoid the confrontation with the much superior enemy, bypassing them by marching towards North-East through Rétság, Balassagyarmat, Losonc and Rimaszombat to Miskolc, and to cross the Tisza river there. Another circumstance which urged Görgey's retreat from Vác was the approach from the North-West, from the direction of Garamszentbenedek of the 18,000 strong Russian detachment of General Pavel Grabbe, which threatened his troops of being totally encircled and annihilated. Although the plan of the retreat towards Miskolc was risky, but it could make the Russian main forces to follow him, instead of marching Southwards against the Hungarian troops from Szeged, enabling the latters to face only Haynau's Austrian troops, instead of fighting against the united Austrian and Russian armies in a hopeless battle, which could result undoubtedly the annihilation of the Hungarian resistance.\n17 July\nThe VII. corps, with the military train had to depart at 9 p.m. on 16 July, the I. corps at 10 p.m., the detachment of Ármin Görgey at midnight, while the III. corps had to start its march before dawn. In order to hide the Hungarian retreat from the enemies eyes, the vanguards of the VII. and I. corps and the cavalry vanguards of Ármin Görgey's detachment had to remain on their places until dawn. The leader of the rearguard was designed through drawing lots General Károly Leiningen-Westerburg, to cover the retreat 24 hours. The retreat was disturbed by two problems. One was the large column of chariots of the fleeing civilians, which tried to find safe with the army. During the earlier days Artúr Görgei, in order not to disturb his armies actions during the battle, placed earlier the huge number of refugees with their chariots, at Toronya.  Feeling that this huge number of civilian chariots will cause problems for his armies retreat, Görgei wanted to send them in front of the army towards Vadkert. On 16 July a rumour started among these civilians that the Austrians crossed the Danube at Esztergom, and are heading towards them, so they invaded Vác's streets. Starting with the afternoon of 16 July these chariots occupied the roads of the town, making the march of the army impossible. This delayed the departure of the army, so until the midnight only the VII. corps and a part of the I. corps could leave Vác. Görgei and his officers responded in a harsh way to this problem, turning over these chariots, opening in this way the road for the troops.\nThe second problem was even more serious. Forgetting about Görgei's order to leave their vanguards on their positions until the withdrawal from Vác was completed, the commander of the I. corps József Nagysándor retreated his outposts from the entrance of the city. At 4 a.m. a Russian  lancer regiment and several Cossack companies sent to gather information, observed that a portion of the city is unprotected, so they charged, attacking from sides and back the vanguards from the detachment of Ármin Görgey, which were still on their positions These started to rout through the streets of the city and in the area between the city and the railway embankment, creating a huge panic. Ármin Görgey stopped his retreating soldiers, and positioning them at Hétkápolna (the Southern entrance of Vác), shooting with his artillery in the Russian cavalry. Hearing about the Russian attack, Leiningen, the commander of the III. corps which already started its march to leave Vác, ordered to his troops to return, sending a portion of from the direction of the Calvary hill (North to Vác), to advance towards Duka, while the other part of his corps, under his personal lead, headed towards South-East (Hétkápolna) in order to help Ármin Görgey. Unfortunately the retreating vanguards of the Görgey detachment, seeing the approaching units of the III corps, thinking that they were Russians who want to encircle them, started to rout towards the Southern main street of Vác, creating panic among the cavalry and the artillery units which they encountered, dragging these with them. Left alone, Ármin Görgey too was forced to retreat his infantry from Hétkápolna on the area between the city and the Danube. Profiting from this situation, the Russian cavalry captured four cannons, killing the commander of the battery.\nThe situation was saved by a battalion of the III. corps and a part of Ármin Görgey's detachments infantry, who counterattacked, entering from north in the city pushing out the enemy from the town, and took back three cannons. In the meanwhile half of Leiningen's corps pushed back the Russian cavalry to the vineyards of Sződ, while the other half of the corps attacked the vanguard of the Russian III. corps around Duka and the Duka hill, sent by Paskevich to pursue the Hungarians after he learned from the Russian cavalry units which entered Vác, that the enemy are retreating.\nArtúr Görgei and the commander of the III. corps General Leiningen-Westerburg reestablished the order among their troops confused by the Russian attack, enabling them to continue their retreat. Leiningen led his corps in its fight against the superior Russian army, retreating through heavy fights until the Gombás creek, giving enough time to Artúr Görgei to organize the ordered retreat of the military train and the last units of the I corps to retreat from the city. This was very useful indeed, because Paskevich sent all the troops at his disposal to attack the town, then at 7 a.m. the Russian III. corps too joined the attack. Leaving the III. corps, which continued to fight against the Russian attack behind, Ármin Görgey retreated with his unit to the Vác (Kis Hermán) mountain, occupying a good defensive position on the South-Eastern slope of the mountain, then waiting the III. corps to arrive there. Leiningen's III. corps repulsed the Russian attacks for a long time, assuring the safe retreat of the other corps and the civilian convoy from Vác. The fights were especially harsh at the wooden bridge from the North-Westers end of Vác at the Buki inn, attacked by the Russians which bypassed Vác from North. Here, under heavy Russian volleys, Artúr Görgei led personally the crossing of his troops on the bridge, then supervised its disassembling, then retreating towards North, passing by Ármin Görgey's defensive positions at the Kis Hermán mountain. When the continuously fighting Leiningen's corps arrived to the Kis Hermán mountain, half of it took defensive positions around the Görgey detachment on the both sides of the road, while the other half continued its retreat towards Rétság, where it took a new good defensive position. The Hungarian army, under the lead of Artúr Görgei, retreated towards Vadkert under continuous pressure from the troops of the cavalry general Rüdiger, who after reassembling the bridge, sent a battalion flanked from the both sides by two cavalry regiments, and two infantry battalions as second line against Ármin Görgey's and Leiningen's positions from the Kis Hermán mountain. Ármin Görgey's detachment and the half of the III. corps held back the Russians for a long time, then retreated in continuous fighting towards North, in the direction of Rétság. From the commander, who, because of the tremendous mental and physical effort he had to take in his serious health condition, lost his conscience, General Ernő Poeltenberg took over the defensive, taking a good position around the triple junction from Rétság, repulsing the attacks of Rüdiger's pursiung Russian troops until the midnight, when the Russians finally gave up the pursuit. In the meantime General Artúr Görgei led the retreat of his troops and the civilian convoys towards Vadkert, setting up camp at the Kormos inn between the two localities. After passing Rétság, General József Nagysándor replaced Poeltenberg in the lead of the rearguard. During the retreat on the bridge over the Ipoly at Ráros, a false alarm broke out, which disturbed the whole army, causing unrest among the soldiers and civilians. Luckily the Russian pursuit stopped earlier at Rétság, so, except from a scare, nothing serious happened to the Hungarian troops, which could continue their march until Losonc, where they were finally reorganized.\nOn the Russian side the soldiers of the III corps spent their night at Rétság, while those of the II. corps at Vác.\nOutcome\nTo see who won the battle of Vác from 15 to 17 July 1849, it is important to see what were the plans of the two commanders, how they managed to accomplish their objectives, and what were the consequences of its outcome, regarding the fate of the Hungarian Freedom War?\nOn the one hand Paskevich accomplished his plan to prevent Görgei to lead his troops towards Szeged, using the shortest rout through the Danube–Tisza Interfluve. But in the case if Görgei accomplished this task, breaking through the Russian lines, he would have had the four times bigger Russian army following him closely, plus Haynau's twice bigger main army following as well his troops from a very close distance, resulting the joining of the forces of the two main enemy commanders against the remaining Hungarian forces in a decisive battle, with almost no chance for the Hungarians to win. Such a defeat would have ended the Hungarian revolution in that moment, before the end of July. Ironically the success of Paskevich in preventing Görgei to fulfil his initial plan of marching through Vác in Southern Hungary, thwarted his main plan to join with Haynau's army, and to crush the Hungarians in Southern Hungary in a decisive battle. With the retreat of Görgei towards North-East, he suddenly became worried that his supply routs will be cut off, so he turned his armies to chase the Army of the Upper Danube, trying, without success, to encircle, and defeat it, thus doing what Görgei wanted him to do. Regarding the plans and opportunities used in the battle, the Russians did not prevailed. The plan of Paskevich to make the Hungarians to believe that they face inferior troops, luring them in a trap South from Vác, and attacking them with his whole army, failed because of Görgei's caution, as a result of the fights from 15 July. The slow Russian deployment from the morning of 17 July prevented them to take advantage of the confusion among the retreating Hungarian troops, although with the concentrated attack of superior forces, the whole enemy army could have been annihilated. If Paskevich could have used these opportunities, he could have joined Haynau, and end the Hungarian resistance in a few days, but because of the unsuccess, the war continued another several weeks. Considering the initial Russian plans and intentions during the battle, this battle was a unanimous failure for Paskevich.\nOn the other hand, although Görgei had to march South through Vác, this plan was not his, but Kossuth's order of concentrating all Hungarian troops in Southern Hungary, considered by Görgei a wrong and harmful strategy, which he tried to avoid so much before the two battles of Komárom from July, being only forced to accept it by the governors pressure and threats. After seeing that he cannot accomplish Kossuth's order to march South through Vác, his plan became to head North-West to the Tisza river, and after crossing it, he wanted to turn towards Southern Hungary, luring the four times bigger Russian army after him, winning in this way time for the Hungarian main army from South to deal, in the meantime, with Haynau's Austrian troops of approximately similar size.\nAftermath\nThe Hungarian army arrived to Losonc on 19 July, and from there its march towards East became calmer, because the attention of Paskevich was suddenly caught by the Hungarian cavalry troops, coming from Southern Hungary, which being led by General Mór Perczel, Lieutenant General Lázár Mészáros and Lieutenant General Henryk Dembiński, started to advance towards Gödöllő.\nPaskevich on 17 July established his headquarters at Vác. During the battle of Vác the luggage of the Russian army was at Hatvan, but when he heard about Perczel's advance, he sent it to Pest. In order to prevent the troops of Görgei and Perczel from uniting, he decided to move with the II. and III. corps towards Gyöngyös between the two Hungarian commanders troops. He wanted to have superior troops at his disposal in order to be able to defeat both Görgei and Perczel, he kept the bulk of his army together, sending only three cavalry companies and two cavalry guns, under general Chrulov, to pursue Görgei, ordering to General Grabbe to support Chrulov, with his 18,000 soldiers, by marching from Szentkereszt to Losonc. But knowing that the detachment of Grabbe will arrive only after a couple of days, Paskevich sent Lieutenant General Zass in support of Chrulov with three cavalry regiment and 8 guns.\nGrabbe who in 7 July to Szentkereszt, where he received reinforcements, after hearing about the retreat of Görgei from Vác, leaving garrisons in the important towns occupied by him, headed to Balassagyarmat. On 19 July he reached Szuhány, where he heard that Balassagyarmat is already in Russian hands, and Görgei marched from there to Losonc. Hearing about this Grabbe marched back to Zólyom, in order to attack Görgei at Vámosfalva, but because of the long detour, he was late again, and he received order from Paskevich to unite with Zass's troops and pursue Görgei towards Miskolc. Paskevich ordered also the IV. corps to support Grabbe, but this, for now, marched from Kápolna to Mezőkövesd, sending only a stronger cavalry vanguard, to observe the Hungarian armies movements.\nPaskevich did not know which was the direction of the Hungarian troops: towards Kassa towards North, or towards Miskolc, to cross the Tisza to its left side, so he sent troops in both directions. He sent order to General Selvan to be aware of an eventual attack of the Hungarian troops towards Kassa: if Görgei would send only smaller units in that direction, to repulse them, but in the case of an attack with his all army, then to retreat, and wait for Dmitri Osten-Sacken to come in his support from Galicia. To the commander of the IV. corps, General Mikhail Ivanovich Cheodayev he ordered to attack Görgei with all of his troops if he would march towards North to Kassa, but if Görgei marched towards Miksolc and Tokaj, Paskevich advised his general to send one of his units to pursue the Hungarians, while the bulk of his forces had to remain in Miskolc, waiting for new orders.\nReferences\nSources\n*\n*\n*\n*\n*\n*\n*\n*"
    }
  ]
}