{
  "content": [
    {
      "type": "text",
      "text": "# Second Lebanese Republic\n\n(Arabic)}}\n| image_flag             = Flag of Lebanon.svg\n| image_coat             = Coat of arms of Lebanon.svg\n| national_anthem        = Koullouna lilouataan lil oula lil alam ()\n| image_map              = File:Lebanon_(orthographic_projection).svg\n| capital                = Beirut\n| coordinates            =\n| largest_city           = Beirut\n| official_languages     = Arabic\n| languages_type         = Local vernacular\n| languages              = Lebanese Arabic\n| demonym                = Lebanese\n| government_type        = Unitary confessionalist parliamentary republic\n| leader_title1          = President\n| leader_name1           = Joseph Aoun\n| leader_title2          = Prime Minister\n| leader_name2           = Nawaf Salam\n| leader_title3          = Speaker of the Parliament\n| leader_name3           = Nabih Berri\n| legislature            = Parliament\n| established_event1     = Taif Agreement\n| established_date1      = 22 October 1989\n| area_km2               = 10452\n| currency               = Lebanese pound\n| currency_code          = LBP\n| calling_code           = +961\n| cctld                  = .lb\n| image_map_caption      = Location of Lebanon (in green)\n| recognised_languages   = French, English\n}}\nThe Second Republic () is Lebanon's current republican system of government. It was established on 22 October 1989 by Lebanese political leaders and business people under the Taif Agreement.\nThe Second Republic emerged from the slow erosion of the Lebanese Civil War and ratification of the National Reconciliation Accord, replacing the disproportional representation of the religious sects in Lebanon from  55:45 to 1:1 proportional representation of Christians and Muslims in parliament and political powers of Muslim-reserved prime ministerial position strengthened over Christian-reserved presidency position. This agreement, however, was put into practice on 24 December 1990. René Moawad was the first head of state to have been elected under this republic.\nBackground\nTaif Agreement\nThe agreement covered political reform, the ending of the Lebanese Civil War, the establishment of special relations between Lebanon and Syria, and a framework for the beginning of complete Syrian withdrawal from Lebanon. Since Rafik Hariri was a former Saudi diplomatic representative, he played a significant role in constructing the Taif Agreement. It is also argued that the Taif Accord reoriented Lebanon toward the Arab world, especially Syria. In other words, the Taif Accord positioned Lebanon as a country with \"an Arab identity and belonging.\" The agreement was finalized and confirmed only after the development of an anti-Saddam Hussein international alliance. The alliance included Saudi Arabia, Egypt, Syria, France, Iran and the United States.\nThe agreement contained multiple constitutional amendments, which came into force following President Hrawi's signature in September 1990. Among the most major changes:\n* The ratio of Christians to Muslims in Parliament was reduced from 6:5 to 1:1.\n* The term length of the Speaker of the House was increased from one to four years. (Article 44 of the constitution).\n* Article 17 of the constitution was amended from \"the executive power is vested in the President of the Republic, who exercises with the assistance of his ministers\" to \"the executive power is vested in the Council of Ministers, who exercise it according to the dispositions of this constitution\".\n* Presidential prerogatives were somewhat curtailed.  Among the powers lost were:\n** Require parliamentary consultations before nominating the Prime Minister.\n** Cannot dismiss or appoint individual ministers at will (requires approval of the Council).\n** Introduce laws in Parliament.  Instead, he introduces them to the Cabinet, who then vote to transmit it to Parliament.\n** Nominate or dismiss state employees, which became the Council's duty.  In reality, this had little impact in political life as civil servants were generally nominated by ministers and then voted on in cabinet, before being appointed by the President.\nDevelopment\nSince the election of Michel Aoun as president in 2016 and the formation of a new Government headed by Prime Minister Saad Hariri, there were two sides, the March 14 alliance which supported the election of Michel Aoun but only if mainly the Lebanese Forces having 7/20 of the governmental seats. Michel Aoun and Samir Geagea signed the \"Maarab Agreement\" and it was considered a historical peace between two rival and old political parties. Michel Aoun ended up not fiving the required seats to the Lebanese forces but Samir Geagea did not seem to complain until after the \"17 October revolution\" in Lebanon which Samir Geagea tried his best in trying to impress but to no avail. Namely sides that were against the election of Michel Aoun as president in the 2016 elections, consisted of traditional, though non-sectarian, parties such as the Kataeb party and the National Liberal Party. Since then, the political scene has been witnessing the emergence of new non-sectarian political groups such as Lihaqqi and Citizens in a State (MMFD), in addition to many civil society groups who were loosely allied during the last parliamentary elections. Although they share a common goal to replace what they consider a failed political model, that was introduced following the end of the civil war leading to the 2020 economic crisis, they are not unified in order to assimilate and conquer the prevailing government. The then-elected government has failed its duties as a government and the Prime Minister, Saad Hariri, attempted to resign while he was in Saudi Arabia in 2017, but it was ruled unconstitutional. Later on, during the October protests he resigned as Prime Minister. Moreover, he was later designated in October, 2020 and once again as Prime Minister nevertheless his attempt at creating a government did not take place.\nDuring the quorum for electing the 2 Secretaries of the Parliament in 2022, it was decided that the secretaries would be attributed to one Maronite Christian and one Druze which was not constitutionally required. The election process of the 2 deputies had large debate particularly by opposition MPs. It was suggested that each MP votes for both preferences in the same ballot. However, it was decided that voting would take place on the basis of one name per ballot. As a result of this Firas Hamdan, an opposition MP, who was one of few candidates for the Druze secretary, withdrew his candidacy in protest of  the sectarian electoral procedure.\nThe fall of Assad’s regime in Syria was said to start a new chapter in Lebanon without the interference of the Syrian Baathist regime. On 9 January 2025, Lebanon elected a president for the first time without the Syrian Baathist regime in power since 1958, meaning the first time in decades that a president did not need to be approved by Syria. Lebanese security institutions became able to function without direct or indirect interference by Syria’s now defunct regime. In 2025, Lebanon got both a new president (Joseph Aoun) and a new prime minister (Nawaf Salam).\nPresidents of the Second Republic\n{| class=\"wikitable\" style=\"text-align:center\"\n! rowspan=\"2\" |No.\n! rowspan=\"2\" |Name\n! rowspan=\"2\" |Lived\n! colspan=\"2\" |Term of office\n! colspan=\"2\" rowspan=\"2\" |Political party\n|-\n!Took office\n!Left office\n|-\n|1\n|René Moawad -\n|1925–1989\n|5 November 1989\n|22 November 1989\n! style=\"background-color:red;\" |\n|Independence Movement\n|- style=\"background-color:#E6E6AA\"\n|—\n|Selim Hoss -\n|1929–2024\n|22 November 1989\n|24 November 1989\n|\n|Independent\n|-\n|2\n|Elias Hrawi -\n|1926–2006\n|24 November 1989\n|24 November 1998\n|\n|Independent\n|-\n|3\n|Émile Lahoud -\n|1936–\n|24 November 1998\n|24 November 2007\n|\n|Independent\n|- style=\"background-color:#E6E6AA\"\n| colspan=\"7\" |Vacant\n|-\n|4\n|Michel Suleiman -\n|1948–\n|25 May 2008\n|25 May 2014\n|\n|Independent\n|- style=\"background-color:#E6E6AA\"\n| colspan=\"7\" |Vacant\n|-\n|5\n|Michel Aoun -\n|1933–\n|31 October 2016\n|31 October 2022\n! style=\"background-color:;\" |\n|Free Patriotic Movement\n|- style=\"background-color:#E6E6AA\"\n| colspan=\"7\" |Vacant\n|-\n|6\n|Joseph Aoun -\n|1964–\n|9 January 2025\n|Incumbent\n|\n|Independent\n|}\nPresident image gallery\nFile:René Moawad - 1988.jpg|alt=|René Moawad(1925-1989)Served 1989\nFile:Salim el-Hoss Axis for Peace 2005-11-17.jpg|alt=|Selim Hoss(1929-2024)Served 1989 acting\nFile:Elias Hraoui President.jpg|alt=|Elias Hrawi(1926-2006)Served 1989-1998\nFile:Lahoud in Brasil 2.jpg|alt=|Emile Lahoud(1936-)Served 1998-2008\nFile:Michel Suleiman 2012.jpeg|alt=|Michel Suleiman(1948-)Served 2008-2014\nFile:Sergio Mattarella e Michel Aoun al Quirinale nel 2022 (6) (cropped).jpg|alt=|Michel Aoun(1933-)Served 2016-2022\nFile:Nikos Christodoulides meets with Joseph Aoun (cropped).jpg|alt=|Joseph Aoun(1964-)Serving 2025-\nPrime ministers of the Second Republic\n, of the Azm Movement]]\n{| class=\"wikitable\" style=\"text-align:center\"\n! rowspan=\"2\" |No.\n! rowspan=\"2\" |Name\n! rowspan=\"2\" |Lived\n! colspan=\"2\" |Term of office\n! colspan=\"2\" rowspan=\"2\" |Political party\n|-\n!Took office\n!Left office\n|-\n|1\n|Selim Hoss -\n|1929–2024\n|2 June 1987\n|24 December 1990\n|\n|Independent\n|- style=\"background-color:#E6E6AA\"\n|–\n|Michel Aoun -\n|1933–\n|22 September 1988\n|13 October 1990\n! style=\"background-color:;\" |\n|Military\n|-\n|2\n|Omar Karami -\n|1934–2015\n|24 December 1990\n|16 May 1992\n|\n|Independent\n|-\n|3\n|Rachid Solh -\n|1926–2014\n|16 May 1992\n|31 October 1992\n|\n|Independent\n|-\n|4\n|Rafic Hariri -\n|1944–2005\n|31 October 1992\n|4 December 1998\n! style=\"background-color:;\" |\n|Future Movement\n|-\n|(1)\n|Selim Hoss -\n|1929–2024\n|4 December 1998\n|26 October 2000\n|\n|Independent\n|-\n|(4)\n|Rafic Hariri -\n|1944–2005\n|26 October 2000\n|26 October 2004\n! style=\"background-color:;\" |\n|Future Movement\n|-\n|7\n|Omar Karami -\n|1934–2015\n|26 October 2004\n|19 April 2005\n! style=\"background-color:green;\" |\n|Arab Liberation Party\n|-\n|8\n|Najib Mikati -\n|1955–\n|19 April 2005\n|19 July 2005\n! style=\"background-color:#93308F;\" |\n|Azm Movement\n|-\n|9\n|Fouad Siniora -\n|1943–\n|19 July 2005\n|9 November 2009\n! style=\"background-color:;\" |\n|Future Movement\n|-\n|10\n|Saad Hariri -\n|1970–\n|9 November 2009\n|13 June 2011\n! style=\"background-color:;\" |\n|Future Movement\n|-\n|(8)\n|Najib Mikati -\n|1955–\n|13 June 2011\n|15 February 2014\n! style=\"background-color:#93308F;\" |\n|Azm Movement\n|-\n|12\n|Tammam Salam -\n|1945–\n|15 February 2014\n|18 December 2016\n! style=\"background-color:;\" |\n|Future Movement\n|-\n|(10)\n|Saad Hariri -\n|1970–\n|18 December 2016\n|21 January 2020\n! style=\"background-color:;\" |\n|Future Movement\n|-\n|14\n|Hassan Diab -\n|1959–\n|21 January 2020\n|10 September 2021\n|\n|Independent\n|-\n|\n|Najib Mikati -\n|1955–\n|10 September 2021\n|8 February 2025\n! style=\"background-color:#93308F;\" |\n|Azm Movement\n|-\n|16\n|Nawaf Salam -\n|1953–\n|8 February 2025\n|Incumbent\n|\n|Independent\n|}\nReferences\nFurther reading\n*   |jstor=41858040 }}"
    }
  ]
}