{
  "content": [
    {
      "type": "text",
      "text": "# Second Dragoon Expedition\n\nMap accompanying Colonel Henry Dodge's 1835 report to the U.S. Congress about the expedition\nThe Second Dragoon Expedition  of 1835 (also called the Dodge Expedition) left Fort Leavenworth, unorganized territory May 29, 1835, charged with contacting the Indian tribes across the Central Plains to the Rockies as far west as the Mexican border.\nHistory\nTraveling first up the Platte River they made contact with the Otoe, Omaha, Grand Pawnee, and Arickaree tribes. Continuing south along the front range of the Rockies, they reached Bent's Fort on August 6. At Bent's Fort the expedition held councils with the Arapahoes, Cheyennes, Black Feet, Gros Ventres, and others.  On August 12, 1835 the Dragoons began the return march from Bent's Fort, following the Santa Fe Trail eastward.  They arrived at Council Grove, Kansas the evening of September 8, 1835.\nBetween Council Grove and Hundred and Ten Mile Creek the expedition experienced its only loss, the death of 23 year old, Private Samuel Hunt on September 11, 1835. In Colonel Dodge's Journal he wrote, \"On the 11th a man of company “A” died—the first death that has occurred on our whole march, and the only severe sickness. The colonel directed him to be buried on a high prairie ridge, and a stone placed at the head of the grave, with his name and regiment engraved thereon. Continued the march; crossed the Hundred-and ten-mile creek, and entered upon the dividing ridge between the Kansas and Osage rivers; passed Round and Elm Groves, and arrived at the crossing of the Kansas, at Dunlap's Ferry, on the 15th; crossed the river, and on the 16th arrived at Fort Leavenworth.\"\nSee also\n*First Dragoon Expedition\n*United States Regiment of Dragoons\nReferences\n*Dodge, Henry. Journal of the March of a Detachment of Dragoons, Under the Command of Colonel Henry Dodge, During the Summer of 1835. American State Papers. Class V. Military Affairs. Volume VI. 24th Cong, 1st Session, H. Doc., 138. (Serial Set 21). 1836.\n*\nNotes\nExternal links\n*[http://www.ksgenweb.com/archives/1912/d/dodges_expedition.html Dodge's Expedition]\n*[https://npgallery.nps.gov/AssetDetail/NRIS/95000586 Samuel Hunt Grave (National Register of Historic Places)]"
    }
  ]
}