{
  "content": [
    {
      "type": "text",
      "text": "# Second Revolution (Bangladesh)\n\n()\n|Result     =\n* Presidential form of government\n* Formation of BAKSAL and installation of one-party system\n* Reorganized administrative structure\n* Compulsory multipurpose village level cooperatives\n* Controlled civil liberties\n* 15 August 1975 Bangladesh coup d'état\n* Assassination of Sheikh Mujibur Rahman\n* Abolition of the BAKSAL\n* End of the revolution\n* Empowerment of Khondaker Mostaq Ahmed and relation improvement with US and China\n}}\nSecond Revolution () was a political hypothesis presented by then President Sheikh Mujibur Rahman. The hypothesis included a series of reforms in the three pillars of a state: administrative, judiciary and legislative systems. The reforms were enacted through the fourth amendment to the constitution of Bangladesh. BaKSAL was formed as the decision making council to carry out the revolution. The 'revolution', as it was called by the Awami League leadership, ended with the assassination of Sheikh Mujibur Rahman during the 15 August 1975 Bangladesh coup d'état.\nHistory\nBackground\nWith the emergence of Bangladesh as an independent nation in 1971, Bangladesh became a people's republic which enabled both democracy and socialism as state policies, with Bengali nationalism and secularism.\nBangladesh introduced a parliamentary democracy as the legislative system with 300 constituencies, where every member of parliaments needed to be elected by direct vote by qualified voters. In the 1973 general election, the Awami League emerged as the single largest party of the country to govern the nation, winning 293 seats out of 300.\nAmid political success, Bangladesh was facing difficulties with the condition of its economy after independence. In the 1974–75 fiscal year, after three years of independence, Bangladesh hardly registered a 2% growth in Gross Domestic Product (GDP) while the population grew by 3%, embarrassing statistics for a government. Almost all private ventures were nationalised according to the state policy and private entrepreneurship was discouraged. Though Bangladesh was seemingly advocating socialist ideologies, one of the prime priorities- the land reforms- seemed a far cry.\nThe slower progress in economy, dysfunctional production system, smuggling of goods through the border and syndication among the traders who had been enjoying substantial support, including licenses from the ruling Awami League, since independence led the country to a famine in 1974 that claimed at least 1.5&nbsp;million lives. Estimates from some notable economists, including Dr. Amartya Sen however, suggest the death toll was much higher. A sudden flood in the same year made the situation much worse leaving hundreds to die of starvation.\nWith these failures, the government started receiving criticism from opposition parties and newspapers. The government had decided to deal the political opposition harshly. Political figures like Siraj Sikder, Mosharraf Hossain, Badal Khan and almost thirty thousand political activists were either extrajudicially killed, or disappeared in three years due to Jatiya Rakkhi Bahini () excesses and police actions. Opposition parties started protesting government repression and some of them opted for armed struggle to defend themselves. At least four members of parliament got killed.\nThe later events suggest that the government, due to the failures in the first three years of independence and the worsening law and order situation of the country, was convinced that democracy was no more the salient theme to put the country in order and a series of reforms was needed.\nOrigin\nWhen considering the Bangladesh Liberation War in 1971 as the 'first revolution', the term 'Second Revolution' was first used in the 24 September 1974 edition of the Daily Banglar Bani newspaper which had Sheikh Fazlul Haque Mani as the editor-in-chief. Mani was the nephew of Prime Minister Mujibur Rahman,.\nMani advocated the idea of a one-party state with his uncle Mujibur as the head of state, in a series of public meetings of the Bangladesh Awami Jubo League (Jubo League), the youth wing of the Bangladesh Awami League.\nIn October 1974, he addressed several meetings of the League and began publicly advocating the view that the parliamentary system had failed in Bangladesh and another \"revolution\" was inevitable.}}\nPrime Minister Mujibur Rahman first  pronounced the \"Second Revolution\" in his parliamentary speech after the Fourth Amendment on 25 January 1975.\nEnactment\nThe second revolution began with the enactment of the fourth amendment of the constitution on 25 January 1975.\nAfter the fourth amendment of the constitution was passed by majority vote in the parliament Sheikh Mujibur Rahman addressed the parliament members. He said:\n}}\nIdeology\nThough the Second Revolution was a step forward to a Socialist Bangladesh with formidable economic and administrative reforms, it was much different than the other socialist revolutions of the contemporary world. It was more aimed at achieving some reformist goals than a social change.\nIn his emotional speech on 25 January 1975, Mujibur Rahman explaining the revolution, said:\n}}\nIn a meeting with two pioneers of the communist movement in Bangladesh, Rashed Khan Menon and Haider Akbar Khan Rano on 20 February 1975, Mujibur said,\n}}\nNoted political scientist Rounaq Jahan pointed out the idea of the Second Revolution this way:\n}}\nHowever, Mujibur later mentioned that parliamentary democracy was degenerating into a \"free style\", free-for-all democracy and he had to put a stop to it.\nIn a public meeting after the declaration of the constitution of BaKSAL, he said:\nThe remarks of Mujibur indicate that he was irked by the criticism of the opposition parties which he believed was taking place due to the 'free-style' of democracy, and one of the reasons of the Second Revolution was putting an end to it.\nComponents\nThe Second Revolution, according to Mujibur Rahman, was a reformation of the government and the whole system.\nObjectives\nMujibur spelled out four objectives of his Second Revolution on 26 March 1975 at the public meeting held at Suhrawardy Udyan. He said,\n}}\nThe clearly stated four objectives to create a society free from exploitation through Second Revolution were:\n* To weed out corruption\n* To increase production in agriculture and industry\n* To control population growth\n* To foster national unity\nFeatures\nThe basic concept of the reformation included certain features as indicated by the Fourth Amendment of the constitution and the subsequent government orders were:\nPresidential form of government\nWith the Fourth Amendment of the constitution, through which the revolution had begun in January 1975, Bangladesh converted into a Presidential form of government from a Parliamentary system .\nIn the Fourth Amendment, the entire Chapter I relating to the president, and Chapter II relating to the prime minister, and the Cabinet under Part IV were replaced by new provisions. The new system vested executive power in the President, who was to be directly elected.\nOne-party system\nOn 24 February 1975 Mujibur announced the formation of the only legal political party of the country the Bangladesh Krishak Sramik Awami League (BaKSAL). The announcement automatically abolished all other political parties of the country, eventually made the other parties that did not join BaKSAL outlawed.\nThe constitution of the new party was declared on 6 June of the same year by Mujibur. The formation of the party was a follow-up of the Fourth Amendment that gave all the power to the President to form the party through his executive order. It was also provided that the government servant would be qualified to be a member of the national party according to Article 117A(4) of the constitution.\nReorganized administrative structure\nAccording to the theories of the Second Revolution, the sub-divisions were to become districts with a new administrative council composed of representatives from BaKSAL, members of parliament and government officials. Each administrative council would be headed by a governor who would run the local administration.\nOn&nbsp;21 June 1975, by a Presidential Ordinance, Mujibur created 61 districts from the existing 19. The governor-designates for the districts were declared on 16 July of the same year.\nAn administrative council was announced to be formed for each thana, composed of the local youth, women, workers, farmers and BaKSAL members.\nCompulsory multipurpose village level cooperatives\nMujibur, at the Bangladeshi Independence Day rally on 26 March 1975, declared that there should be compulsory multi-purpose co-operatives in every village of the country. The co-operatives would be formed in phases, under 5-years plans all 65,000 village would have such cooperatives. Each cooperative would comprise 500–1,000 families. These cooperatives would be considered as the economic units of the nation.\nControlled civil liberties\nThe Second Revolution imposed a greater control over civil liberties, including the basic rights of political activity, freedom of speech and the judiciary.\nThe judiciary was made subservient to the President. Contrary to the previous system, the President was given full authority to appoint judges other than those on the Supreme Court, and to remove any judge including the Chief Justice simply by an order on the grounds of 'misbehavior and incapacity'.\nOn 16 June 1975, around 20 daily newspapers in the four major cities were closed down and only four survived: The Bangladesh Observer, The Bangladesh Times, Dainik Bangla, and Ittefaq.\nThe government took over the four newspapers and appointed the editors as well. Anwar Hossain Manju the editor of Ittefaq, which was one of the most popular dailies of the country, was substituted with Nurul Islam Patwari. Sheikh Fazlul Haque Mani, the nephew of Mujibur  was appointed as the Editor of The Bangladesh Times.\nOutcomes\nWith the reforms under the revolutionary program, Sheikh Mujibur Rahman was made the President for an indefinite time since the possible ways to impeach a President were made much harder. The minimum number of votes required to impeach a president was increased to three-fourths from two-thirds of the total number of the members of parliament.\nThough the revolution was thwarted before putting it in operation, it had infuriated a huge population of the country. Bangladeshis amid their sorrow due to an ongoing famine could not accept it.\nMany journalists became unemployed due to the sudden closure of almost all the newspapers, though the government arranged a token stipend for some of them.\nPolitical parties like Jatiyo Samajtantrik Dal, National Awami Party, United People's Party and some other parties had to go underground in the changed system. Ganabahini, the armed section of Jatiyo Samajtantrik Dal was made more active after the party opted for going underground.\nThough the chief of the Bangladesh Army was made a member of the central committee of BaKSAL, a section of the force was agitated by the reforms. In a pre-dawn coup d'état in August 1975, Mujibur the President of the country and the leader of the revolution, was assassinated by a group of military personnel of the Bangladesh Army.\nLegacy\nSecond Revolution is generally criticized by the political thinkers and historians of Bangladesh. Political scientist Rounaq Jahan questioned the goals of the revolution, writing: \"It is hard to explain why one would need a revolution to achieve such reformist goals!\". According to Jahan, Sheikh Mujib's political plan was to replicate in Bangladesh India's variant of the Westminster model—a \"one-dominant party\" parliamentary democracy. She also argued that the 'second revolution” did not bring any radical change as the new model was no better than 'putting old wine into new bottle' by means of 'keeping the same old leadership with the same factional cleavages and the same style'.\nThough the revolution was aimed to foster national unity, Mujibur has been criticised for not making any visible step to achieve the objective. Only eight out of hundred fifteen posts of the central committee was given to the leaders of those parties who joined the platform of national unity, BaKSAL. In the highest decision making council of BaKSAL there was no participation of any parties other than the Awami League.\nA. F. Salahuddin Ahmed, a historian, termed the revolution as in truth a political death for Bangladesh.\nTimeline\n* 24 September 1974:\nSheikh Mani first used the term Second Revolution in his Bengali language. daily Banglar Bani.\n* 11 October 1974:\nMani used the term in a public meeting of the Jubo League and professed that the revolution is inevitable.\n* 28 December 1974:\nThe President of Bangladesh declared a state of emergency in Bangladesh.\n* 6 January 1975:\nPublic meetings, strikes and any similar activities were declared illegal under the emergency rule.\n* 21 January 1975:\nThe parliamentary committee of the Awami League gave Prime Minister Sheikh Mujibur Rahman absolute authority to take any step necessary for the national interest.\n* 25 January 1975:\nThe Fourth Amendment bill was passed by the Parliament and Mujibur, in his speech about the Amendment of the Constitution, claimed that this is his Second Revolution.\n* 24 February 1975:\nMujibur announced the formation of the new national party BaKSAL and therefore banned all other political parties and organisation.\n* 8 March 1975:\nAbdul Hamid Khan Bhashani expressed his support of the Second Revolution in a joint declaration with Mujibur at Tangail, although he refrained from joining BaKSAL\n* 26 March 1975:\nMujibur detailed his Second Revolution plan, spelled out the four objectives of the revolution, and declared intentions to form multi-purpose co-operatives as economic units.\n* 25 April 1975:\nPro-Pakistan politician and opposition leader Ataur Rahman Khan joined BaKSAL and pledged to be a part of the revolution.\n* 6 June 1975:\nMujibur declared the constitution and the five fronts of national party.\n* 16 June 1975:\nAll but four newspapers declared banned.\n* 21 June 1975:\n61 sub-divisions were promoted to districts.\n* 16 July 1975:\nNames of 61 Governor-designates were released, a month-long political training for the governors was yet to begin and end by 16 August of the same year.\n* 15 August 1975:\nSheikh Mujibur Rahman was assassinated, along with most of his family members, during a military coup d'état by a group of Bangladesh Army personnel. With the death of its leader, the revolution failed.\nSee also\n* 1972–1975 Bangladesh insurgency\n* Bangladesh Krishak Sramik Awami League\n* Assassination of Sheikh Mujibur Rahman\nReferences"
    }
  ]
}