{
  "content": [
    {
      "type": "text",
      "text": "# Second Yemenite War\n\nYemeni War}}\n)\n| place             = North–South Yemeni borders\n| coordinates       =\n| map_type          =\n| map_relief        =\n| map_size          =\n| map_marksize      =\n| map_caption       =\n| map_label         =\n| result            = South Yemeni victory\n| status            =\n| combatants_header =\n| combatant1        =\n| combatant2        =\n| commander1        = Abdul Fattah Ismail\n| commander2        = Ali Abdullah Saleh\n| units1            = 3 South Yemeni Army divisions 1 Air Force Tactical Regiment (4 MiG-21 and Su-22 Squadrons – 32 aircraft)\n| units2            = 1 North Yemeni Army Division 1 Air Defence Brigade 2 Air Force squadrons – 18 aircraft 1 Mechanised Brigade (late entry)\n| strength1         = 120,000 total45,000 in theater600 tanks total 300 tanks in theater\n| strength2         = 300,000 total 1900 tanks in total350 tanks in theater\n| casualties1       =\n* 537 killed or captured\n** 412 ground troops killed\n** 125 captured\n* 12 T-55 tanks destroyed\n* 2 Su-22s downed in combat\n| casualties2       =\n* 2,296 killed or captured\n** 672 ground troops killed\n** 1,624 captured\n* 20 aircraft destroyed\n** 14 destroyed on ground\n*** 6 MiG-17s\n*** 3 MiG-21s\n*** 5 Mi-17s\n** 6 shot down\n*** 4 MiG-17s\n*** 2 MiG-21s\n** 4 pilots captured\n*  40 radars destroyed\n** 34 P-15 radars\n**  6 P-12 radars destroyed\n* 16 SA-3 launchers destroyed\n* 46 T-55 and T-34 tanks destroyed\n| casualties3       =\n| notes             =\n| campaignbox       =\n}}\nThe Second Yemenite War was a short military conflict between the Yemen Arab Republic (YAR; North Yemen) and the People's Democratic Republic of Yemen (PDRY; South Yemen). The war developed out of a breakdown in relations between the two countries after the president of North Yemen, Ahmad al-Ghashmi, was killed on 24 June 1978, and Salim Rubai Ali, a Maoist who had been working on a proposed merger between the two Yemens, was murdered two days later. The hostility of the rhetoric from the new leadership of both countries escalated, leading to small-scale border fighting, which then in turn escalated into a full-blown war in February 1979.\nNorth Yemen appeared on the edge of a decisive defeat after a three-front invasion by a South Yemeni combined arms formation, however this was prevented by a successful mediation in the form of the Kuwait Agreement of 1979, which resulted in Arab League peacekeeping forces being deployed to patrol the North–South border. An agreement to unite both countries was also signed, although it was not implemented.\nConflict\nThe Marxist government of South Yemen was alleged to be supplying aid to rebels in the north through the National Democratic Front and crossing the border.\nOn 24 February, forces from North and South Yemen began firing at each other across the border. Forces from North Yemen, led by some radical army officers, crossed the border into South Yemen and attacked a number of villages. The PDRY, with support from the Soviet Union, Cuba, and East Germany, responded by invading the north using 3 regular divisions and a Tactical Air Force regiment. The PDRY was also supported by the NDF, who were in the midst of fighting their own rebellion against the government of North Yemen. Within 3 days of the invasion, the numerically smaller South Yemeni forces had established complete air superiority over the theater, thus forcing the North Yemeni ground forces on the back foot for the rest of the War.\nThe South Yemeni attack carried the advantage of surprise and was spearheaded by an artillery barrage and groups of sappers, who were effectively able to blow up the early warning air defences and radars and thus help the Air Force establish air superiority within days over much of Taiz and Dhale Governorates and parts of Al Bayda Governorate, after a dogfight that downed most of the North Yemeni planes. After the initial Air Force attack, a South Yemeni armoured division composed of T-55 and T-62 Tanks spearheaded the ground assault on a North Yemeni Armoured Division stationed near Taiz city, followed by an Infantry Division covered by an artillery brigade providing fire support with BM-21 Grad rockets and M-46 field howitzers.\nThis was soon followed by the Soviet-trained South Yemeni Air Force further destroying several North Yemeni MiG-17 and MiG-21 fighter jets and helicopters on the ground in airfields and airbases in Dhamar, thus preventing any chance of a Northern aerial counter-attack. The attack was coordinated by the Deputy Chief of the Air Force, Brigadier Sa'ad Hesham al Din, formerly of the Aden Protectorate Levies since 1959 who had trained as a pilot in the United Kingdom and Soviet Union from 1969–1972. Brigadier Sa'ad himself led the aerial sorties, flying in an Su-22. The Fighter Group was led by Colonel Khaled Omar, of the ALP since 1964, who had trained in India in 1971–73. He led the combat air patrols in a MiG-21. On the ground and in the air in a couple of Il-38, Soviet combat controllers directed the fire control and battlespace and operated the Early Warning systems. The war dragged on for nearly a month, with North Yemen being unable to send reinforcement units from Sanaa down to Taiz due to the constant Southern airstrikes and aggressive air patrolling hitting reinforcement convoys on difficult and winding mountain roads as far north as Dhamar. Although Northern forces vastly outnumbered Southern forces overall, they were outnumbered and overwhelmed within the theater of operations in and around Taiz and Dhale, since a single Division had to face an attack from three enemy divisions without any reinforcement or close air support due to the Southern air patrolling and airstrikes on Northern roads throughout the month.\nOn 8 March, the South Yemeni Air Force managed to carry out an attack on Sanaa, with 3 Su-22 and 3 Su-7 bombers with 5 MiG-21 fighters flying top cover, dropping 500-pound bombs on an artillery base and strafing the Judges' Court and Central Prison, causing mass panic among civilians. North Yemeni Air Defences operating the SA-3 engaged and managed to shoot down one of the Su-7 bombers and one MiG-21, capturing the pilots. Another deep raid on 10 March saw 4 South Yemeni MiG-21s and 3 Su-22s strafe an airbase and the seaport near Hodeidah, sinking a civilian Egyptian cargo ship. With losses escalating, Northern forces appearing on the verge of exhaustion, Southern forces capturing a wide range of Northern territory and besieging Taiz and Al Bayda, Saudi Arabia and the United States rushed arms to bolster the government of North Yemen by 9-10 March. On 11 March, North Yemeni forces fired 8 Frog-7 missiles on a South Yemeni combined infantry brigade and tank battalion north of Ibb, killing at least 100 South Yemeni soldiers. The introduction of Frog-7 missiles by North Yemen forced South Yemen to cease further advances.\nOn 13 March, South Yemen fired two Scud-B missiles at Sanaa, destroying a Republican Guard barracks and killing 19 soldiers and 15 civilians. Citing the alleged Soviet-backed PDRY aggression against the YAR, and the threat this could pose to U.S. ally Saudi Arabia, the United States greatly stepped up military assistance to the YAR government. As part of this aid, the U.S. shipped 18 F-5E planes to the YAR in order to strengthen the government. However, there were no YAR pilots trained in flying the F-5E, and as a result the U.S. and Saudi Arabia arranged to have 80 Taiwanese pilots plus ground crew and Iraqi anti-air defense units sent to North Yemen. A U.S. Navy task force was also sent to the Arabian Sea in response to the escalating violence. In addition to US aid, the North Yemeni regime has recruited tribal militias into the war, and the war has reached a stalemate.\nThe war showed the weakness of the North Yemeni military training and equipment, and soon its allies - led by Egypt, Iraq and Saudi Arabia - started an aggressive re-armament and training programme to enable it to regain strategic balance against PDRY forces. By 1983–84, the North had regained its military strength.\nAftermath\nKuwait Agreement of 1979\nOn 20 March the leaders of North and South Yemen called a bilateral ceasefire met in Kuwait for a reconciliation summit, in part at the strong insistence of Iraq. The talks were mediated by the Arab League. Under the Kuwait Agreement, both parties reaffirmed their commitment to the goal and process of Yemeni unification, as had been spelled out in the Cairo Agreement of 1972. This agreement to unify was particularly the result of pressure from Iraq, Syria, and Kuwait, all of whom advocated for a unified Arab world in order to best respond to the issues arising from the Camp David Accords and the Iranian Revolution. POWs were exchanged within the next two months, and work for a draft constitution for a united Yemen proceeded over the next two years, however, most attempts to implement the spirit and letter of the agreement were put on hold until 1982, and the end of the rebellion by the South Yemen supported National Democratic Front.\nSee also\n*Yemenite War of 1972\n*Modern history of Yemen\n*List of wars involving Yemen\nReferences"
    }
  ]
}