{
  "content": [
    {
      "type": "text",
      "text": "# Second Battle of Mora\n\n| combatant2  =  Mexico\n| commander1  =  Jesse I. Morin\n| commander2  =  Unknown militia leaders\n| strength1   = ~200, plus artillery\n| strength2   = ~200\n| casualties1 = None\n| casualties2 = Several killed17 captured\n| notes       =\n| campaignbox =\n}}\nThe Second Battle of Mora was a February 1, 1847, military engagement during the Taos Revolt of the Mexican–American War in and around the village of Mora in US-occupied northern New Mexico. Seeking revenge for United States Army's January 24 defeat at the hands of a Mexican-national militia of Hispanos (acting as Mexican nationals) and their Puebloan allies at First Battle of Mora, Capt. Jesse I. Morin and his men destroyed the village the next week, with the insurgents fleeing into the mountains.\nBattle\nOn February 1, approximately 200 United States troops led by Captain Jesse I. Morin marched to Mora armed with one or possibly two howitzer cannons, the week after a failed January 24, 1847, expedition by Capt. Israel R. Hendley – who was killed in First Battle of Mora, having marched against superior enemy numbers and without artillery. Hendley had gone to Mora in response to a series of insurrectionist assassinations of American government employees and traders in Taos and Mora, around 20 to 25 killings in total.\nThe two forces of the Second Battle of Mora were this time about the same strength of numbers; they exchanged fire with no sign of the insurgents being willing to yield. The Americans brought up their cannon (triggering many noncombatants to flee Mora for the mountains) and initiated a short but devastating barrage on the old fort protecting the town. The Americans then attacked on foot; the battle was short, marked by skirmishing in the dirt streets of Mora, but the rebels did not give up until the town was in ruins, despite having little defense – or effect. No American casualties were reported at the Second Battle of Mora, while the Mexicans and their indigenous allies suffered several dead or wounded, and 17 men were captured for trial as traitors (being nominally American subjects under the US provisional government of New Mexico and the Kearny Code).\nA February 15, 1847, US government proclamation wrote that the US Army had burned the Upper and Lower Mora (misspelled \"Moro\") to the ground, This battle marked the end of one campaign of the Taos Revolt.\nAftermath\nAmerican soldiers were directed by Morin to pursue the fleeing New Mexicans, and he ordered the complete destruction of Mora (at that time consisting of two actual settlements, Upper and Lower Mora). Federal troops killed stragglers, and looted and burned the villages, the nearby ranches, and the wheat fields and other crops surrounding the settlements. Others chased after the New Mexicans through Mora Valley, as the surviving insurgents and other inhabitants fled up and over the surrounding mountains, to other villages of northern New Mexico.  They stayed in these other hamlets for some time, due to crop and livestock destruction by Morin's men leaving them no food source. Meanwhile, the bodies of the American casualties of the January battle in Mora were returned to the garrison at Las Vegas and buried there.  The New Mexican civilians eventually returned to Mora and rebuilt.\nMorin later justified his \"scorched earth\" actions by stating that he fought the New Mexicans in such a manner as revenge for their killing of Capt. Hendley at Mora just a week earlier.  There was a feeling on the American side that the Mexican-and-Indian militia had acted without provocation, despite the advancement of armed US troops on their homesteads, and certainly that the killings of American civilian traders in Mora (perhaps by different insurgents) had been outright murder.  The original Taos Revolt insurrectionists, including leader \"Montojo\" Pablo Montoya, had been executed immediately in Taos, while at least 28 more were later captured and tried for murder and treason – by courts and juries made up of friends, family, and business partners of the American victims – then hanged, the first known executions by this method in Taos Valley. The American reaction to this was not universally positive (and one treason conviction was posthumously overturned by the US Supreme Court a year later). Eyewitness Lewis Hector Garrard wrote in 1850 of the trial:\nMorin would go on to fight the final engagement of the Taos Revolt, at the Battle of Cienega Creek near Taos, on July 9, 1847.\nSee also\n* Battles of the Mexican–American War\n* List of battles fought in New Mexico\nReferences\n*\n*\n*\n*"
    }
  ]
}