{
  "content": [
    {
      "type": "text",
      "text": "# Second Spanish Republic__disambig_2\n\n}}\n| conventional_long_name = Spanish Republic\n| era                    = Interwar period\n| government_type        = Unitary semi-presidential republic\n| event_start            = Proclamation\n| year_start             = 1931\n| date_start             = 14 April\n| event1                 =\n| date_event1            = 9 December 1931\n| event2                 =\n| date_event2            = 5–19 October 1934\n| event3                 = Spanish Civil War\n| date_event3            = 17 July 1936\n| event_end              = Fall of the Republic\n| year_end               = 1939\n| date_end               = 1 April\n| p1                     = Restoration (Spain)Kingdom of Spain\n| flag_p1                = Flag of Spain (1785-1873 and 1875-1931).svg\n| s1                     = Francoist SpainSpanish State\n| flag_s1                = Flag of Spain under Franco 1938 1945.svg\n| s2                     = Spanish Republican government in exile\n| flag_s2                = Flag of Spain (1931–1939).svg\n| image_flag             = Flag of Spain (1931–1939).svg\n| flag                   = Flag of the Second Spanish Republic\n| image_coat             = Coat of Arms of Spain (1931-1939).svg\n| symbol                 = Coat of arms of the Second Spanish Republic\n| image_map              = Spanish Republic (1936).svg\n| image_map_caption      = European borders of the Second Spanish Republic in addition to its African colonies\n| capital                = Madrid\n| largest_city           = capital\n| national_motto         =  (Latin)Further Beyond\n| national_anthem        = Himno de RiegoAnthem of Riego\n| official_languages     = Spanish\n| regional_languages     = Catalan, Basque\n| religion               = Secular stateRoman Catholic (majority)\n| title_leader           = President\n| leader1                =\n| year_leader1           = 1931–1936\n| leader2                = Diego Martínez Barrio\n| year_leader2           = 1936 (interim)\n| leader3                = Manuel Azaña\n| year_leader3           = 1936–1939\n| title_deputy           = Prime Minister\n| deputy1                = Niceto Alcalá-Zamora\n| year_deputy1           = 1931 (first)\n| deputy2                = Juan Negrín\n| year_deputy2           = 1937–1939 (last)\n| legislature            = Cortes Republicanas\n| stat_year1             =\n| stat_area1             =\n| stat_pop1              =\n| currency               = Spanish peseta\n| footnotes              =\n| demonym                = Spanish, Spaniard\n}}\nThe Spanish Republic (), commonly known as the Second Spanish Republic (), was the democratic government of Spain from 1931 to 1939. The Republic was proclaimed on 14 April 1931 after the deposition of King Alfonso XIII. It was dissolved on 1 April 1939 after surrendering in the Spanish Civil War to the Nationalists led by General Francisco Franco.\nAfter the proclamation of the Republic, a provisional government was established until December 1931, at which time the 1931 Constitution was approved. Over the next two years of constitutional government, known as the Reformist Biennium, Prime Minister Manuel Azaña initiated numerous reforms. In 1932, religious orders were forbidden control of schools, while the government began a large-scale school-building project. A moderate agrarian reform was carried out. Home rule was granted to Catalonia, with a parliament and a president of its own.\nSoon, Azaña lost parliamentary support and President Alcalá-Zamora forced his resignation in September 1933. The subsequent 1933 election was won by the Spanish Confederation of the Autonomous Right (CEDA). However the President declined to invite its leader, Gil Robles, to form a government, fearing CEDA's monarchist sympathies. Instead, he invited the Radical Republican Party's Alejandro Lerroux to do so. In October 1934, CEDA was finally successful in forcing the acceptance of three ministries. The Socialists triggered an insurrection that they had been preparing for nine months. A general strike was called by the Unión General de Trabajadores (UGT) and the Spanish Socialist Workers' Party (PSOE). The rebellion developed into a bloody revolutionary uprising, aiming to overthrow the Republican government. In the occupied areas, the rebels officially declared a proletarian revolution and abolished regular money. The rebellion was crushed by the Spanish Navy and the Spanish Republican Army, the latter using mainly Moorish colonial troops from Spanish Morocco.\nIn 1935, after a series of crises and corruption scandals, President Alcalá-Zamora, who had always been hostile to the government, called for new elections, instead of inviting CEDA, the party with most seats in the parliament, to form a new government. The Popular Front won the 1936 general election with a narrow victory. The Right accelerated its preparations for a coup, which had been months in the planning.\nAmidst the wave of political violence that broke out after the triumph of the Popular Front in the February 1936 elections, a group of Guardia de Asalto and other leftist militiamen mortally shot José Calvo Sotelo, one of the leaders of the opposition,  on 12 July 1936. This assassination convinced many military officers to back the planned coup. Three days later (17 July), the revolt began with an army uprising in Spanish Morocco, followed by military takeovers in many cities in Spain. Military rebels intended to seize power immediately, but they were met with serious resistance as most of the main cities remained loyal to the Republic. An estimated total of half a million people would die in the war that followed.\nDuring the Spanish Civil War, there were three Republican governments. The first was led by left-wing republican José Giral (from July to September 1936); a revolution inspired mostly by libertarian socialist, anarchist and communist principles broke out in its territory. The second government was led by the PSOE's Francisco Largo Caballero. The UGT, along with the National Confederation of Workers (CNT), were the main forces behind the social revolution. The third government was led by socialist Juan Negrín, who led the Republic until the military coup of Segismundo Casado, which ended republican resistance and ultimately led to the victory of the Nationalists. The Republican government survived in exile and retained an embassy in Mexico City until 1976. After the restoration of democracy in Spain, the government-in-exile formally dissolved the following year.\nHistory\n1931–1933, the Reformist Biennium\nOn 28 January 1930, the military dictatorship of General Miguel Primo de Rivera (who had been in power since September 1923) was overthrown. This led various republican factions from a wide variety of backgrounds (including conservatives, socialists and Catalan nationalists) to join forces. The Pact of San Sebastián was the key to the transition from monarchy to republic. Republicans of all tendencies were committed to the Pact of San Sebastian in overthrowing the monarchy and establishing a republic. The restoration of the royal Bourbons was rejected by large sectors of the populace who vehemently opposed the King. The pact, signed by representatives of the main Republican forces, allowed a joint anti-monarchy political campaign. The 12 April 1931 municipal elections led to a landslide victory for republicans. Two days later, the Second Republic was proclaimed, and King Alfonso XIII went into exile. The king's departure led to a provisional government of the young republic under Niceto Alcalá-Zamora. Catholic churches and establishments in cities like Madrid and Sevilla were set ablaze on 11 May.\n1931 Constitution\nIn June 1931 a Constituent Cortes was elected to draft a new constitution, which came into force in December.\nThe new constitution established freedom of speech and freedom of association, extended suffrage to women in 1933, allowed divorce, and stripped the Spanish nobility of any special legal status. It also ended Catholicism’s status as the state religion and imposed strict limits on the activities of religious orders, including prohibiting them from teaching; these anticlerical provisions were moderated slightly during the constitutional debates later that year. Its controversial articles 26 and 27 imposed stringent controls on Church property and barred religious orders from the ranks of educators. Scholars have described the constitution as hostile to religion, with one scholar characterising it as one of the most hostile of the 20th century. José Ortega y Gasset stated, \"the article in which the Constitution legislates the actions of the Church seems highly improper to me.\" Pope Pius XI condemned the Spanish government's deprivation of the civil liberties of Catholics in the encyclical Dilectissima Nobis.\nThe legislative branch was changed to a single chamber called the Congress of Deputies.  The constitution established legal procedures for the nationalisation of public services and land, banks, and railways. The constitution provided generally accorded civil liberties and representation.\nThe Republican Constitution also changed the country's national symbols. The Himno de Riego was established as the national anthem, and the Tricolor, with three horizontal red-yellow-purple fields, became the new flag of Spain. Under the new Constitution, all of Spain's regions had the right to autonomy. Catalonia (1932), the Basque Country (1936) and Galicia (although the Galician Statute of Autonomy could not come into effect due to the war) exercised this right, with Aragon, Andalusia and Valencia, engaged in negotiations with the government before the outbreak of the Civil War. The Constitution guaranteed a wide range of civil liberties, but it opposed key beliefs of the right wing, which was very rooted in rural areas, and desires of the hierarchy of the Roman Catholic Church, which was stripped of schools and public subsidies.\nThe 1931 Constitution was formally effective from 1931 until 1939. In the summer of 1936, after the outbreak of the Spanish Civil War, it became largely irrelevant after the authority of the Republic was superseded in many places by revolutionary socialists and anarchists on one side, and Nationalists on the other.\nAzaña government\nWith the new constitution approved in December 1931, once the constituent assembly had fulfilled its mandate of approving a new constitution, it should have arranged for regular parliamentary elections and adjourned. However, fearing the increasing popular opposition, the Radicals and Socialist majority postponed the regular elections, therefore prolonging their way in power for two more years. This way the republican government of Manuel Azaña initiated numerous reforms to what in their view would \"modernize\" the country.\nLandowners were expropriated. Autonomy was granted to Catalonia, with a local parliament and a president of said parliament. Catholic churches in major cities were again subject to arson in 1932, and a revolutionary strike action was seen in Málaga the same year. A Catholic church in Zaragoza was burnt down in 1933.\nIn November 1932, Miguel de Unamuno, one of the most respected Spanish intellectuals, rector of the University of Salamanca, and himself a Republican, publicly raised his voice to protest. In a speech delivered on 27 November 1932, at the Madrid Ateneo, he protested: \"Even the Inquisition was limited by certain legal guarantees. But now we have something worse: a police force which is grounded only on a general sense of panic and on the invention of non-existent dangers to cover up this over-stepping of the law.\"\nIn 1933, all remaining religious congregations were obliged to pay taxes and banned from industry, trade and educational activities. This ban was forced with strict police severity and widespread mob violence.\n1933–1935 period, the “Black Biennium” and miners' uprising\n]]\nThe majority vote in the 1933 elections was won by the Spanish Confederation of the Autonomous Right (CEDA). In face of CEDA's electoral victory, president Alcalá-Zamora declined to invite its leader, Gil Robles, to form a government. Instead he invited the Radical Republican Party's Alejandro Lerroux to do so. Despite receiving the most votes, CEDA was denied cabinet positions for nearly a year. After a year of intense pressure, CEDA, the largest party in the congress, was finally successful in forcing the acceptance of three ministries. However the entrance of CEDA in the government, although being normal in a parliamentary democracy, was not well accepted by the left.  The Socialists triggered an insurrection that they had been preparing for nine months. A general strike was called by the UGT and the PSOE in the name of the Alianza Obrera. The issue was that the Left Republicans identified the Republic not with democracy or constitutional law but with a specific set of left-wing policies and politicians. Any deviation, even if democratic, was seen as treasonous.\nThe inclusion of three CEDA ministers in the government that took office on 1 October 1934 led to a country wide revolt. A \"Catalan State\" was proclaimed by Catalan nationalist leader Lluis Companys, but it lasted just ten hours. Despite an attempt at a general stoppage in Madrid, other strikes did not endure. This left Asturian strikers to fight alone. Miners in Asturias occupied the capital, Oviedo, killing officials and clergymen. Fifty eight religious buildings including churches, convents and part of the university at Oviedo were burned and destroyed. The miners proceeded to occupy several other towns, most notably the large industrial centre of La Felguera, and set up town assemblies, or \"revolutionary committees\", to govern the towns that they controlled. Thirty thousand workers were mobilized for battle within ten days. In the occupied areas the rebels officially declared the proletarian revolution and abolished regular money. The revolutionary soviets set up by the miners attempted to impose order on the areas under their control, and the moderate socialist leadership of Ramón González Peña and Belarmino Tomás took measures to restrain violence. However, a number of captured priests, businessmen and civil guards were summarily executed by the revolutionaries in Mieres and Sama. This rebellion lasted for two weeks until it was crushed by the army, led by General Eduardo López Ochoa. This operation earned López Ochoa the nickname \"Butcher of Asturias\". Another rebellion by the autonomous government of Catalonia, led by its president Lluís Companys, was also suppressed and was followed by mass arrests and trials.\nWith this rebellion against an established political legitimate authority, the Socialists showed identical repudiation of representative institutional system that anarchists had practiced. The Spanish historian Salvador de Madariaga, an Azaña supporter and an exiled vocal opponent of Francisco Franco, is the author of a sharp critical reflection against the participation of the left in the revolt: \"The uprising of 1934 is unforgivable. The argument that Mr Gil Robles tried to destroy the Constitution to establish fascism was, at once, hypocritical and false. With the rebellion of 1934, the Spanish left lost even the shadow of moral authority to condemn the rebellion of 1936.\"\nThe suspension of the land reforms that had been attempted by the previous government, and the failure of the Asturias miners' uprising, led to a more radical turn by the parties of the left, especially in the PSOE (Socialist Party), where the moderate Indalecio Prieto lost ground to Francisco Largo Caballero, who advocated a socialist revolution. At the same time, the involvement of the Centrist government party in the Straperlo and Nombela scandals deeply weakened it, further polarising political differences between right and left. These differences became evident in the 1936 elections.\n1936 elections\nOn 7 January 1936, new elections were called. Despite significant rivalries and disagreements, the socialists, Communists, and the Catalan-and-Madrid-based left-wing Republicans decided to work together under the name Popular Front. The Popular Front won the election on 16 February with 263 MPs against 156 right-wing MPs, grouped within a coalition of the National Front with CEDA, Carlists, and Monarchists. The moderate centre parties virtually disappeared; between the elections, Lerroux's group fell from the 104 representatives it had in 1934 to just 9.\nAmerican historian Stanley G. Payne thinks that there was major electoral fraud in the process, with widespread violation of the laws and the constitution. In line with Payne's point of view, in 2017, two Spanish scholars, Manuel Álvarez Tardío and Roberto Villa García, published the result of a research where they concluded that the 1936 elections were rigged. This view has been criticised by Eduardo Calleja and Francisco Pérez, who question the charges of electoral irregularity and argue that the Popular Front would still have won a slight electoral majority even if all of the charges were true.\nIn the thirty-six hours following the election, sixteen people were killed and thirty-nine were seriously injured, while fifty churches and seventy right wing political centres were attacked or set ablaze. The right had firmly believed, at all levels, that they would win. Almost immediately after the results were known, a group of monarchists asked Robles to lead a coup, but he refused. He did, however, ask prime minister Manuel Portela Valladares to declare a state of war before the revolutionary masses rushed into the streets. Franco also approached Valladares to propose the declaration of martial law and calling out of the army. This was not a coup attempt, but more of a \"police action\" akin to Asturias, as Franco believed the post-election environment could become violent and was trying to quell the perceived leftist threat. Valladares resigned, even before a new government could be formed. However, the Popular Front, which had proved an effective election tool, did not translate into a Popular Front government. Largo Caballero and other elements of the political left were not prepared to work with the republicans, although they did agree to support many of the proposed reforms. Manuel Azaña was called upon to form a government before the electoral process had come to an end, and he would shortly replace Zamora as president, taking advantage of a constitutional loophole: the Constitution allowed the Cortes to remove the President from office after two early dissolutions, and while the first (1933) dissolution had been partially justified because of the fulfillment of the Constitutional mission of the first legislature, the second one had been a simple bid to trigger early elections.\nThe right reacted as if radical communists had taken control, despite the new cabinet's moderate composition; they were shocked by the revolutionary masses taking to the streets and the release of prisoners. Convinced that the left was no longer willing to follow the rule of law and that its vision of Spain was under threat, the right abandoned the parliamentary option and began to conspire as to how to best overthrow the republic, rather than taking control of it.\nThis helped the development of the fascist-inspired Falange Española, a National party led by José Antonio Primo de Rivera, the son of the former dictator, Miguel Primo de Rivera, although it only received 0.7 percent of the votes in the election. By July 1936, the Falange had a mere  40,000 members among millions of Spaniards.\nThe country quickly moved towards anarchy. Even the socialist Indalecio Prieto, at a party rally in Cuenca in May 1936, complained: \"we have never seen so tragic a panorama or so great a collapse as in Spain at this moment. Abroad Spain is classified as insolvent. This is not the road to socialism or communism but to desperate anarchism without even the advantage of liberty.\"\nIn June 1936, Miguel de Unamuno, disenchanted with the unfolding of the events, told a reporter who published his statement in El Adelanto that President Manuel Azaña should commit suicide as a patriotic act.\nAssassinations of political leaders and beginning of the war\nOn 12 July 1936, Lieutenant José Castillo, an important member of the anti-fascist military organisation Unión Militar Republicana Antifascista (UMRA), was shot by Falangist gunmen.\nIn response, a group of Guardia de Asalto and other leftist militiamen led by Civil Guard Fernando Condés, after getting the approval of the minister of interior to illegally arrest a list of members of parliament, went to right-wing opposition leader  José Calvo Sotelo's house in the early hours of 13 July on a revenge mission. Sotelo was arrested and later shot dead in a police truck. His body was dropped at the entrance of one of the city's cemeteries. According to all later investigations, the perpetrator of the murder was a socialist gunman, Luis Cuenca, who was known as the bodyguard of PSOE leader Indalecio Prieto. Calvo Sotelo was one of the most prominent Spanish monarchists who, describing the government's actions as Bolshevist and anarchist, had been exhorting the army to intervene, declaring that Spanish soldiers would save the country from communism if \"there are no politicians capable of doing so\".\nProminent rightists blamed the government for Calvo Sotelo's assassination. They claimed that the authorities did not properly investigate it and promoted those involved in the murder whilst censoring those who cried out about it and shutting down the headquarters of right-wing parties and arresting right-wing party members, often on \"flimsy charges\". The event is often considered the catalyst for the further political polarisation that ensued. The Falange and other right-wing individuals, including Juan de la Cierva, had already been conspiring to launch a military coup d'état against the government, to be led by senior army officers.\nWhen the antifascist Castillo and the anti-socialist Calvo Sotelo were buried on the same day in the same Madrid cemetery, fighting between the Police Assault Guard and fascist militias broke out in the surrounding streets, resulting in four more deaths.\nThe killing of Calvo Sotelo with police involvement aroused suspicions and strong reactions among the government's opponents on the right. Although the nationalist generals were already planning an uprising, the event was a catalyst and a public justification for a coup. Stanley Payne claims that before these events, the idea of rebellion by army officers against the government had weakened; Mola had estimated that only 12% of officers reliably supported the coup and at one point considered fleeing the country for fear he was already compromised, and had to be convinced to remain by his co-conspirators. However, the kidnapping and murder of Sotelo transformed the \"limping conspiracy\" into a revolt that could trigger a civil war. The involvement of forces of public order and a lack of action against the attackers hurt public opinion of the government. No effective action was taken; Payne points to a possible veto by socialists within the government who shielded the killers who had been drawn from their ranks. The murder of a parliamentary leader by state police was unprecedented, and the belief that the state had ceased to be neutral and effective in its duties encouraged important sectors of the right to join the rebellion. Within hours of learning of the murder and the reaction, Franco, who until then had not been involved in the conspiracies, changed his mind on rebellion and dispatched a message to Mola to display his firm commitment.\nThree days later (17 July), the coup d'état began more or less as it had been planned, with an army uprising in Spanish Morocco, which then spread to several regions of the country.\nThe revolt was remarkably devoid of any particular ideology. The major goal was to put an end to anarchical disorder. Mola's plan for the new regime was envisioned as a \"republican dictatorship\", modelled after Salazar's Portugal and as a semi-pluralist authoritarian regime rather than a totalitarian fascist dictatorship. The initial government would be an all-military \"Directory\", which would create a \"strong and disciplined state.\" General Sanjurjo would be the head of this new regime, due to being widely liked and respected within the military, though his position would be a largely symbolic due to his lack of political talent. The 1931 Constitution would be suspended, replaced by a new \"constituent parliament\" which would be chosen by a new politically purged electorate, who would vote on the issue of republic versus monarchy. Certain liberal elements would remain, such as separation of church and state as well as freedom of religion. Agrarian issues would be solved by regional commissioners on the basis of smallholdings, but collective cultivation would be permitted in some circumstances. Legislation prior to February 1936 would be respected. Violence would be required to destroy opposition to the coup, though it seems Mola did not envision the mass atrocities and repression that would ultimately manifest during the civil war. Of particular importance to Mola was ensuring the revolt was at its core an Army affair, one that would not be subject to special interests and that the coup would make the armed forces the basis for the new state. However, the separation of church and state was forgotten once the conflict assumed the dimension of a war of religion, and military authorities increasingly deferred to the Church and to the expression of Catholic sentiment. However, Mola's program was vague and only a rough sketch, and there were disagreements among coupists about their vision for Spain.\nFranco's move was intended to seize power immediately, but his army uprising met with serious resistance, and great swathes of Spain, including most of the main cities, remained loyal to the Republic of Spain. The leaders of the coup (Franco was not commander-in-chief yet) did not lose heart with the stalemate and apparent failure of the coup. Instead, they initiated a slow and determined war of attrition against the Republican government in Madrid.\nAs a result, an estimated total of half a million people would die in the war that followed; the number of casualties is actually disputed, as some have suggested that as many as a million people died. Over the years, historians kept lowering the death figures, and modern research concluded that 500,000 deaths were the correct figure.\nTabular summary: 8 prime ministers, 19 cabinets\n{| class=\"wikitable\"\n! scope=\"col\" style=\"width: 150px;\" | prime minister\n! scope=\"col\" style=\"width: 100px;\" | from to\n! scope=\"col\" style=\"width: 50px;\" | duration (days)\n! scope=\"col\" style=\"width: 360px;\" | composed of/supported by\n! scope=\"col\" style=\"width: 500px;\" | why ended\n! scope=\"col\" style=\"width: 150px;\" | other\n|----\n| Niceto Alcalá Zamora || 14-04-1931 to 14-10-1931  || 193 || DLR, PSOE, PRR, PRRS, AR, ORGA, ACR|| resigned due to internal controversy over religious issues ||\n|----\n| Manuel Azaña || 14-10-1931 to 12-09-1933 || 699 || PSOE, AR, PRRS, ORGA (periodically ACR, PRR, ERC, PRDF) || resigned due to withdrawal of presidential support and internal controversy over social policy || formally 3 cabinets\n|----\n| Alejandro Lerroux || 12-09-1933 to 09-10-1933 || 27 || PRR, PRRS, IRS, AR, PRG, ERC, PURA || failed the confidence motion ||\n|----\n| Diego Martínez Barrio || 09-10-1933 to 16-12-1933 || 68 || PRR, PRRS, IRS, AR, PRG, ERC, PRP || intended as transitory; resigned following new elections ||\n|----\n| Alejandro Lerroux || 16-12-1933 to 28-04-1934 || 133 || PRR, PRG, PRLD, PRP, PURA (supported by CEDA) || resigned due to controversy with president over amnesty legislation || formally 2 cabinets\n|----\n| Ricardo Samper || 28-04-1934 to 04-10-1934 || 159 || PRR, PRLD, PRP, PAE (supported by CEDA) || resigned due to pressure by CEDA ||\n|----\n| Alejandro Lerroux  || 04-10-1934 to 25-09-1935 || 356 || PRR, CEDA, PRLD, PAE || resigned due to withdrawal of presidential support and internal controversy over 1936 budget || formally 3 cabinets\n|----\n| Joaquín Chapaprieta  || 25-09-1935 to 14-12-1935 || 80 || PRR, CEDA, LR, PAE || resigned due to internal controversy over 1936 budget and financial scandals|| formally 2 cabinets\n|----\n| Manuel Portela  || 14-12-1935 to 19-02-1936 || 67 || PAE, PRLD, PRR, PRP, LR (periodically PCD) || intended as transitory; resigned following new elections || formally 2 cabinets\n|----\n| Manuel Azaña  || 19-02-1936 to 10-05-1936 || 81 || IR, UR (supported by PSOE) || Azaña elected president of the republic || formally 2 cabinets\n|----\n| Santiago Casares  || 13-05-1936 to 19-07-1936 || 67 || IR, UR, ERC (supported by PSOE) || resigned due to military coup unfolding ||\n|}\nCivil War\ncommitted by the Republicans. The Republicans committed many acts of torture, murder, and war crimes throughout the war known as the Red Terror (Spain).]]\nNationalists at the beginning of the Spanish Civil War, between August and September 1936. This mass grave was placed at the small town named Estépar, in Burgos, northern Spain. The excavation occurred in July–August 2014.]]\nvolunteered on the side of the Republic. The photo shows members of the XI International Brigade on a T-26 tank during the Battle of Belchite (August–September 1937).]]\n'' in Paris during the World Expo in 1937 (Agfacolor).]]\nOn 17 July 1936, General Franco led the Spanish Army of Africa from Morocco to attack the mainland, while another force from the north under General Emilio Mola moved south from Navarre. Military units were also mobilised elsewhere to take over government institutions. Before long the professional Army of Africa had much of the south and west under the control of the rebels and by October 1936, Time Magazine declared that \"façade of the Spanish Republic was crumbling\". Bloody purges followed in each piece of captured \"Nationalist\" territory in order to consolidate Franco's future regime.\nAlthough both sides received foreign military aid, the help that Fascist Italy, Nazi Germany (as part of the Italian military intervention in Spain and the German involvement in the Spanish Civil War), and neighbouring Portugal gave the rebels was much greater and more effective than the assistance that the Republicans received from the USSR, Mexico, and volunteers of the International Brigades. While the Axis powers wholeheartedly assisted General Franco's military campaign, the governments of France, Britain, and other European powers pursued a policy of non-interventionism, as exemplified by the actions of the Non-Intervention Committee. Imposed in the name of neutrality, the international isolation of the Spanish Republic ended up favouring the interests of the future Axis powers.\nThe Siege of the Alcázar at Toledo early in the war resulted in the rebels winning after a long siege. The Republicans managed to hold out in Madrid, despite a Nationalist assault in November 1936, and frustrated subsequent offensives against the capital at Jarama and Guadalajara in 1937. Soon, though, the rebels began to erode their territory, starving Madrid and making inroads into the east. The north, including the Basque country, fell in late 1937, and the Aragon front collapsed shortly afterward. The bombing of Guernica was probably the most infamous event of the war and inspired Picasso's painting. It was used as a testing ground for the German Luftwaffe's Condor Legion. The Battle of the Ebro in July–November 1938 was the final desperate attempt by the Republicans to turn the tide. When this failed and Barcelona fell to the rebels in early 1939, it was clear the war was over. The remaining Republican fronts collapsed, and Madrid fell in March 1939.\nEconomy\nThe Second Spanish Republic's economy was mostly agrarian, and many historians call Spain during this time a \"backward nation\". Major industries of the Second Spanish Republic were located in the Basque region (due to it having Europe's best high-grade non-phosphoric ore) and Catalonia. This greatly contributed to Spain's economic hardships, as their center of industry was located on the opposite side of the country from their resource reserves, resulting in immense transportation costs due to the mountainous Spanish terrain. Compounding economic woes was Spain's low export rate and heavily domestic manufacturing industry. High levels of poverty left many Spaniards open to extremist political parties in search of a solution.\nSee also\n* Spanish Republican Armed Forces\n* Spanish Republican government in exile\n* Flag of the Second Spanish Republic\n* Coat of arms of the Second Spanish Republic\n* Order of the Spanish Republic\n* LAPE (Líneas Aéreas Postales Españolas), the Spanish Republican Airline\n* Catholicism in the Second Spanish Republic\n* Sanjurjada\n* Electoral Carlism (Second Republic)\n* Reign of Alfonso XIII\nNotes\nReferences\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\nFurther reading\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n* Raymond Carr, ed. The Republic and the Civil War in Spain (1971)\n* Raymond Carr, Spain 1808–1975 (2nd ed. 1982)\nExternal links\n* [https://web.archive.org/web/20051120095512/http://www.ateneo.unam.mx/textoconstitucion.htm Constitución de la República Española (1931)]\n* [https://www.scribd.com/document/123469543/Constitution-of-the-Republic-of-Spain-1931 English Translation of the Constitution of the Spanish Republic (1931)]\n*\n*"
    }
  ]
}