{
  "content": [
    {
      "type": "text",
      "text": "# Second Battle of Sarvandik'ar\n\nKingdom of Cilician Armenia\n* Ilkhanate\n| combatant2        =  Mamluk Sultanate\n| commander1        = Sempad the ConstableKing Leo II\n| commander2        = Unknown\n| strength1         = Several hundred Armenian knights and their retinues\n| strength2         = Unknown but superior to Armenian forces, including 1,000 Mamluk horsemen\n| casualties1       = Unknown, including 300 Armenian knights\n| casualties2       = Unknown but reportedly heavy|\n}}\nThe '''Second Battle of Sarvandik'ar''' was fought in 1276 A.D. between an army of the Mamluks of Egypt and a unit of Cilician Armenians, in a mountain pass that separates Eastern Cilicia and Northern Syria. The battle was part of the Armenian war effort against a much larger and better trained army that habitually raided the Cilician Plain and threatened to annihilate the Armenian Kingdom of Cilicia.\nPreceding events and discussion\nThe Cilician Armenian Princes were the most important local Christian fighting force before the arrival of the Crusaders in Outremer in the late 1090s and they became the most natural regional allies of the Crusaders. Many Armenian mercenaries also became available in the early 12th Century. Together, allies or mercenaries, they served as cavalry and as highly regarded infantry archers in the Crusader armies, often organized in large units and sometimes under their own princes. At times, their numbers in the Latin Crusader States rose to 4,000 horsemen and 10,000 infantry. The feudalization of Cilician Armenia in the 12th and 13th century made it even easier for Armenian warriors to fit in the armies of the Crusader States. Thanks to his military and diplomatic prowess and with the support given by the Holy Roman Emperors (Frederick Barbarossa and his son, Henry VI), prince Levon Rupenian was able to elevate the status of his principality to a kingdom. The newly reformed Cilician Armenian monarchy sought to model itself on the Norman feudal system.\nThe important role played by Cilician Armenia in the military history of the Crusaders has rarely been recognised though it was well understood by both the Crusaders and their Muslim foes. The Cilician Armenians were not reduced to feeble numbers, as the Franks were. They counted up to 100,000 troops, according to the contemporary sources, of which a third were horsemen and it is of note that the Armenian heavy cavalry was very similar to that of the Franks. In fact, their general equipment resembled more and more that of the Latins. A network of fortresses had been raised in Cilician Armenia in order to protect the country and the defense of the borders was entrusted to knights of the military orders.  Castle in Cilicia, viewed from the S-E.]]\nWhen the Mongols appeared near the Mediterranean in the 13th century, King Hethum I accepted to become a Mongol vassal. The foundations of a military collaboration were laid and this brought the Armenians in direct conflict with the Mamluk Sultanate.\nSome modern historians, notably Angus Donal Stewart, who relies heavily on Muslim sources, has reservations that Armenian armies of the time could pose serious problems to the Mamluks, given the latter's reputation as an elite force of the 13th century Muslim world. He argues that the Mamluk column of 1276 was largely consisting of Turkmen invading from the direction of Marash and that Marius Canard found no Arab source which mentions this raid, concluding that it had merely local significance. Indeed, the only knowledge of it comes from Bar-Hebraeus the Syriac Orthodox catholicos and chronicle author.\n's sons (fallen, right) and capturing another (the future king Leo II, middle). They then ravaged the land of Cilician Armenia. The manuscript depicts the Mamluks in accurate Islamic garb and the Armenian nobles in European heavy cavalry armor.]]\nAfter the Mamluk victory over the Mongol Ilkhanate at Ain Jalut in 1260, where a force of reportedly 500 Armenian knights and their retinues also participated, the Mamluk armies started a series of devastating raids against the Kingdom of Cilician Armenia, an ally of the Ilkhanate and a prosperous Christian state bordering the Eastern Mediterranean. Notably, in 1266, in the absence of the Mongol allies and of King Hethum I who was traveling to Karakorum to summon help, the Armenians suffered a crushing defeat while taken by surprise by the Mamluk army at Mari, near Darbsak. In 1275, the Mamluk Sultan Baibars invaded Cilician Armenia, sacked its capital Sis (but not the citadel) and demolished the royal palace. His marauding troops massacred inhabitants of the mountain valleys and took large quantities of booty. The port city of Ayas was destroyed and burned by a Mamluk column and some 2000 Frankish and Armenian inhabitants drowned while attempting to take refuge on the ships in the harbor. The Cilician Plain was laid waste and its inhabitants put to the sword or carried as prisoners. According to eyewitnesses, only those who took refuge in fortified places escaped the carnage. The city of Tarsus was also ruined. In this context, Armenian nobility, mostly safe in its mountain strongholds, rallied around King Leo II (the son of Hethum I) and Constable Sempad.\nThe battle\nIn 1276, Sempad the Constable marched with several hundred knights and a force of Armenian infantrymen to meet a column of about 1000 Mamluk cavalrymen and a \"great strength\" of Turkmen auxiliaries approaching from the side of Marash. He ambushed them in the Northern Amanus mountains, in a pass near the fortress of Sarvandik'ar while King Leo II of Armenia undertook a detour to strike the enemy in the rear and block its retreat. The Christian ambush was reportedly so successful and the Mamluk losses so heavy that \"the bodies of the dead impeded the flight of the survivors\". While more detailed accounts of the battle are lacking due to the paucity of sources, the Cilician Armenians emerged as clear victors and followed the enemy in pursuit to the proximity of Marash, before stopping.\nThe victory, however, cost the Armenians very dearly. They lost 300 knights and an unknown but important number of infantrymen. Their seasoned warrior, chronicler and Supreme Court judge, Sempad the Constable, died accidentally during the pursuit of the Muslim force, after being hurled against a tree by his own horse. The chronicle also mentions the Lord of Kharbizag Castle and thirteen other high born men, among the Armenian losses.\nAftermath\nEnraged by the audacity of the Armenian attack, sultan Baibars was reportedly about to launch a new expedition when he died in 1277 from a wound inflicted, according to some chroniclers, by an Armenian archer. According to other sources he died by accidentally drinking poisoned kumis intended to kill someone else. The Mongol Khan commended King Leo for the valor of the Armenians knights during the clash and sent him a beautifully crafted sword, offering to make him ruler of all the lands conquered by the Mongol armies in Mesopotamia. Leo II however, declined the offer, pleading justly that the responsibility of defending just one kingdom in the given conditions was already too difficult.\ns of Cyprus]]\nThe battle had shown that Cilician Armenia, though isolated from Europe and repeatedly raided, was not in complete defeat. The Kingdom of Cilician Armenia outlived, in fact, the Franks of Syria and Palestine and the Mongol Ilkhans. After the second clash of Sarvandik'ar, Cilician Armenia enjoyed a breathing spell of nearly 4 years. Hostilities between Mamluks and Mongols, and the latter's Armenian allies, soon broke out again, culminating in 1281 with the Second Battle of Homs that had renewed disastrous consequences for the Kingdom of Cilician Armenia. The struggle against the odds continued for nearly another century and the Armenians, ever fewer and continuously weakened by invasion, still succeeded in a few military encounters with the powerful Mamluk armies. Hethum II of Armenia and Leo IV of Armenia soundly defeated a Mamluk raiding force in the pass of Bagras in 1305.\nNevertheless, Cilician Armenia was eventually left an isolated Christian island in a sea of Muslim states. Amidst failed Armenian pleas for help from Europe, the fall of Sis to the Mamluks in 1374 and the conquest of the fortress of Gaban (modern Geben) in 1375, where the last king King Levon V had taken refuge, put an end to the kingdom.\nReferences\n*Vahan Kurkjian (1958). \"Chapter XXX: The Kingdom of Cilician Armenia — Mongol Invasion\". History of Armenia. United States of America: Armenian General Benevolent Union of America. pp.&nbsp;248–250. [http://penelope.uchicago.edu/Thayer/E/Gazetteer/Places/Asia/Armenia/_Texts/KURARM/30*.html].\n*Claude Mutafian. Le Royaume Armenien de Cilicie (2002), p.&nbsp;61. CNRS Editions, .\n*David Nicolle. The Crusades (2001), p.&nbsp;20. Osprey Publishing, .\n*Angus Donal Stewart. The Armenian Kingdom and the Mamluks (2001), p.&nbsp;51. BRILL, .\nExternal links\n* [http://maxime.goepp.free.fr/site.php?site=servantikar]\n* [http://www.histoire-fr.com/croisades_armenie_1.htm]\n* [http://www.persee.fr/web/revues/home/prescript/article/syria_0039-7946_1937_num_18_4_4009]\n* [http://www.syriacstudies.com/AFSS/Syriac_Articles_in_English/Entries/2009/9/29_-XI-_Concerning_the_Taking_of_Antioch._Bar_Hebraeus_Chronography.html]\nNotes"
    }
  ]
}