{
  "content": [
    {
      "type": "text",
      "text": "# Second Bone War\n\nDutch East Indies\n| combatant2        =  Sultanate of Bone\n| commander1        = Lieutenant Colonel J. B. Wolterbeek\nGovernor-General Godert van der Capellen\n| commander2        = Arung Palakka\nArumpone La Tenritatta To Tenriru Riabbe\n}}\nThe Second Bone War was fought from 20 February 1859 until 20 January 1860 between the forces of the Dutch East Indies and the Kingdom of Bone.\nOn 16 February 1858, the king of Bone, Ahmad Saleh, died and was succeeded by his widow, Basse Arung Kajuara. The new queen ordered Bone ships to fly the Dutch flag upside down, an act of deliberate provocation. The Dutch mounted a punitive expedition in response under General C.P. C. Steinmetz. Command of Bone troops was entrusted to Ahmad Singkarru Rukka Aru Palakka, the estranged brother-in-law of the late king. The Dutch sent a fleet from Java to Makassar to embark troops, which were then landed at Bajoe. On 19 February 1859, a small squadron detached from the main fleet to reconnoiter the Cenrana river, the northern boundary of Bone, and punish the villages along its banks. At the same time, against heavy resistance, the Dutch troops marched inland and seized the capital, Watampone. The queen fled. Following an outbreak of cholera, the Dutch withdrew in April, leaving only a small garrison behind.\nIn the aftermath, Ahmad Singkarru Rukka was accused of treason for an insufficiently robust defence and fled to Barru. There he made a deal with the Dutch to raise an army of Bugis from Sinjai to attack Bone. In return, he would receive Kajang and Sinjai as fiefs from the Dutch after the war. Since their garrison had been decimated by disease, the Dutch landed a second larger expedition under General Jan van Swieten on 28 November 1859. They quickly seized the coastal forts and marched on Watampone, joined by Rukka's native contingent 1500 strong. Again the queen fled to Soppeng, but this time Bone representatives surrendered on 20 January 1860. The war had resulted in about 500 deaths on each side. The Dutch installed Ahmad Singkarru Rukka as the new king with the throne name Ahmad Idris. He signed a new treaty on 13 February that reduced Bone from a sovereign state allied with the Netherlands to a feudatory and turned over Sinjai, Kajang and Bulukumba.\nA Buginese named  Daeng ri Aja from the village of Pampanua wrote a poem about the war, Toloqna Musuq Bone (\"Poem on the Bone War\"), shortly after the events. It was published at Makassar in 1862 by Benjamin Frederik Matthes of the Dutch Bible Society, who described it as a \"Bugis heroic poem on the first Bone expedition of 1859\". It specifically deals with the Cenrana expedition of 1859.\nNotes\nFurther reading\n*Menka de Groot, [https://www.nederlandsekrijgsmacht.nl/index.php/kl/142-koninklijk-nederlandsch-indisch-leger/expedities-van-het-knil/knil-expedities-tussen-1830-en-1873/1127-boni-expedities-van-1850-1860 Boni-expedities van 1859–1860], De Nederlandse Krijgsmacht (18 July 2015).\n*J. W. F. Herfkens, [https://www.delpher.nl/nl/boeken/view?coll=boeken&identifier=MMUBL07%3A000003727%3A00001 De expeditiën naar Boni 1859–1860] (Militaire Academie, 1900).\n*M. T. H. Perelaer, [https://archive.org/details/debonischeexped00peregoog De Bonische expeditiën, krijgsgebeurtenissen op Celebes in 1859 en 1860] (Kolff, 1872)."
    }
  ]
}