{
  "content": [
    {
      "type": "text",
      "text": "# Second Battle of Ménaka__disambig_1\n\nBattle of Menaka}}\n| caption           =\n| date              = 19–20 November 2012\n| place             = Vicinity of Ménaka, Mali\n| territory         =\n| result            = Islamist victory\n* Dissolution of the State of Azawad\n* Northern Mali falls to Ansar Dine, AQIM and MOJWA\n| combatant1        =\n* MNLA\n* Tuareg volunteers\n| combatant2        =  Islamist coalition\n* AQIM\n* MOJWA\n| commander1        =  Alwabihat Ag Machkanani Ag Balla Sidi Ag Moulya Alwabégat Ag Salakatou Bajan Ag Hamatou\n| commander2        =  Omar Ould Hamaha Abu Walid Sahraoui Mokhtar Belmokhtar\n| units1            =\n| units2            =\n| strength1         = 500 (two brigades)60–70 volunteers60 technicals\n| strength2         = 800–1,000 militants41 technicals\n| casualties1       = 13 killed40 wounded15 captured1 technical destroyed\n| casualties2       = 23 killed26 wounded6 technicals destroyed\n| casualties3       =\n| notes             =\n| campaignbox       =\n}}\nThe Second Battle of Ménaka was the last battle fought by the state of Azawad, as they were defeated by an Islamist coalition.\nBackground\nOn 16 November 2012, during the MNLA (Movement for the National Liberation of Azawad) failed offensive to reclaim its former city-base of Gao recently taken by Islamists groups, Islamists launch a counter-attack of their own targeted at the MNLA stronghold of Ménaka, north of Gao, the last bastion under MNLA control. At approximately 11 A.M, two brigades under the command of MNLA Deputy Chief of Staff Machkanani Ag Balla and Colonel Sidi Ag Moulya Molla ambushed a squadron of MOJWA rebels en route to Ménaka. The ambush took place in Tagarangabotte, on the road between Ansongo and Ménaka. The column of vehicles destined for Ménaka is temporarily subdued in fierce fighting with MNLA troops. The Islamists column is forced to turn back however proves insufficient in stopping their offensive. Overall casualties were deplored at nine MNLA troops' wounded some with serious injuries, including Colonel Ag Mechkanine a deputy Staff. MOJWA casualties were 13 dead, 17 injured and three technicals disabled. The same day another battle between the MNLA and Islamists elements occurs in the village of Idelimane 80 kilometers from Ménaka. The MNLA which apparently occupied Idelimane was attacked by two combat forces of MOJWA, the Osama Bin Laden brigade led by Abu Walid Sahraoui and the Al-Mouthalimin (the turbaned) brigade led by Mokhtar Belmokhtar. Both brigades amounted to over 300 men and 16 technicals many equipped with heavy artillery. Heavy fighting in the area is reported throughout the day. On 17 November, Islamists (AQIM) reinforcements arrive from Gao raising the number to well over 1,000 versus 500 per MNLA. On 18 November, MNLA forces are routed. Casualties included 1 MNLA member killed, four others injured. MOJWA casualties amounted to 3 dead, six others injured.\nBattle\nOn 19 November, following its victory against the MNLA at the Battle of Idelimane, MUJAO continues its push and attacks the city of Menaka. As the Malian army was no longer present in Menaka, the city was defended by a militia of 60 to 70 Tuaregs of the tribe of the Oulimeden. In its press releases, the MNLA asserts that the city was defended by its troops, and MUJAO considered to have fought the MNLA in Menaka. However, these statements are contradicted by Bajan Ag Hamatou, deputy of the city and chief of the tribe of the Oulimeden: \"the MNLA can say what it wants. I know that those who faced MUJAO did not do so on behalf of the MNLA. They did it because they see it as their duty to their country and their families.\" According to him, the defenders were young Tuaregs of the National Guard. Contacted by RFI, he indicates that the defenders of Menaka are inhabitants of the city, who were \"associated with the MNLA lately\".\nFaced with unequal forces, Tuareg militiamen decided to call in support MNLA fighters who had 60 vehicles in the area. When contacted, the MLNA promised reinforcements. The local Tuareg militia set up their line of defense on a large dune, in front of the entrance to the city, near the Guards Camp. The attackers were numbered at 300 led by Omar Ould Hamaha, leader of MOJWA. The attack begins at 11am, with a column of 26 vehicles who are exposed and engaged in a confrontation with militiamen. Three Islamists technicals are disabled. Reinforcements help relieve tension amidst the column and bombard the MNLA defenses with rocket launchers, mortars, and heavy weaponry.\nFighting lasted all day until 10pm, the battle in a deadlock. Six MNLA members are killed during fighting in mid-day, and six others are wounded. The dead included two prominent MNLA Colonels. Ag Alwadihat chairman of the Ménaka township and Alwabégat Ag Salakatou a political leader in the region worsening aspects of morale among the Movement. Fifteen to fifty Islamists were reportedly transported and hospitalized in Gao. A significant portion of the civilian population flees. Fighting resumes the next morning on 20 November, with Islamists penetrating MNLA defenses and substantially gaining ground.\nThe MNLA was routed leaving the local militia to fend for themselves. The MOJWA claims Victory a few hours later. In the final assessment 7 Tuareg militiamen are killed along with 3 MNLA members, 33 others are wounded, and 15 are taken as prisoner. In addition large numbers of the militia defected to Ansar Dine.\nAftermath\nOn 21 November, in an official statement issued by Moussa Ag Assarid, the MNLA states that the fighting in Menaka is 6 dead and 6 wounded for its troops, compared with 36 killed by the MUJAO and AQIM forces. A member of MUJAO also stated: \"After several days of fighting, MUJAO, supported by elements of al-Qaeda in the Islamic Maghreb, chased the MNLA from Menaka. And we were able to count on the field the bodies of about 70 MNLA fighters\". The jihadist commander Omar Ould Hamaha, for his part, says he does not know \"the exact number of dead in the ranks of the MNLA\" but adds: \"our elements have counted more than a hundred. We have a lot of prisoners with us too. They will all be subjected to sharia. According to Human Rights Watch sources in Gao, MUJAO took 6 to 15 prisoners in Menaka. In early December 2012, hundreds of fighters from the tribe of the Ulysseden, furious to have been abandoned by the MNLA in Menaka, decided to join Ansar Dine.\"\nReferences"
    }
  ]
}