{
  "content": [
    {
      "type": "text",
      "text": "# Secretary of the Air Force Distinguished Public Service Award\n\n|eligibility=Non-Employee Civilians  \"who have personally made a profound contribution on the National Level, and which represents substantial progress to the AF mission.  The service performed must be of major significance that other forms of public service recognition may be inadequate.\"\n|higher= None\n|lower= Chief of Staff of the Air Force Award for Exceptional Public Service\n|related= Navy Distinguished Public Service Award  Commander's Award for Public Service\n|image2=USA - AF Distinguished Public Service Award.png\n|image2_size=110px\n|caption2=Ribbon bar of the medal\n}}\nThe '''Department of the Air Force Commander's Public Service Award''' is the highest level award granted by the Secretary of the Air Force to a non-employee civilian. It consists of a cased medal, ribbon, mess dress or miniature medal, lapel button, and a citation certificate.\nThe award was created in 2006 following the creation of the Commander's Award for Public Service to further supplement the U.S. Department of the Air Force's awards for non-employees.\nThe medal is gold in color and suspended on a ribbon which is largely dark blue with symmetrical stripes in light blue, yellow, and white.\nEligibility\nAccording to Department guidelines \"[t]he Secretary of the Air Force Distinguished Public Service award is awarded to private citizens not employed by the USAF, and who have personally made a profound contribution on the National Level, and which represents substantial progress to the AF mission.  The service performed must be of major significance that other forms of public service recognition may be inadequate.\"\nAs a result of this award's high-level criteria many who receive it are U.S Congressional Members or else major defense contractors.\nCriteria and process of awarding\nAgain according to the Department guidelines for the award:  \"Documentation of factual evidence that a highly significant service has been provided to the AF shall be forwarded with each nomination.  A biographical sketch and cover letter, signed by the MAJCOM Commander or equivalent, must contain comments that the services cited were voluntary, performed as a public service, or motivated by patriotism with no implication or remuneration, and that the person recommended had no commercial or profit- making relationship with the AF.  It must contain the individual’s permanent home address, previous US decorations, if any, authority for the decoration, and inclusive service dates.  The nomination package must also include a one-page written recommendation describing specific accomplishments, with an attached citation.  Nomination may be submitted at any time, but must be received by SAF/MRBP or SAF/AA at least 90 calendar days before presentation.\"\nNotable recipients\n* U.S. Sen. Orrin Hatch - For \"42 years of public service & commitment to the Department of Defense and Hill Air Force Base\"\n* U.S. Sen. John Boozman - For \"the addition of a cyber training mission school at Little Rock Air Force Base, Arkansas. \"\n* U.S. Rep. Madeleine Bordallo - For whose advocating \"enabled the award of a $21 billion contract for development of the B-21 Raider.\"\n* U.S. Sen. Sherrod Brown - For introducing \"legislation in the Veteran’s First Act to ensure Airmen –past, present and future – receive the care and benefits.\"\n* Mrs. Sally Haas - For acting as Pittsburgh Airport Area Chamber of Commerce president specifically earning the award \"for her advocacy of Air Force issues.\"\n* U.S. Sen. John Hoeven - For introducing \"legislation that set up six remotely piloted vehicle test sites, including one at Grand Forks Air Force Base, North Dakota.\"\n* U.S. Rep. Sam Johnson - For being \"the driving force behind opening Plano’s Veterans Affairs Community-Based Outpatient Clinic.\"\n* Mr. Merrell Lane - For acting as \"President of the Niagara Military Affairs Council (NIMAC).\"\n* U.S. Rep. Nikki Tsongas - For acting as \"a member of the Air Force Academy Board of Visitors,\" and helping \"ensure cadets were given the resources and instruction to be future Air Force leaders.\"\n* Ms. Lynda L. Weatherman - For \"distinguished public service as a member of the Air and Space Forces Civic Leader program, serving as an Air Force advocate, connecting regional and professional communities to the Air Force and Space Force through her expertise in military operations and civilian socioeconomic issues.\"\nSee also\n*Awards and decorations of the United States government\nReferences"
    }
  ]
}