{
  "content": [
    {
      "type": "text",
      "text": "# Secret Treaty of Vienna\n\nTalleyrand  Metternich   Castlereagh\n| parties              =\n| ratifiers            =\n| depositor            =\n| depositories         =\n| citations            =\n| language             =\n| languages            =\n| wikisource           =\n| wikisource1          =\n| footnotes            =\n}}\nThe Secret Treaty of Vienna was a defensive alliance signed on 3 January 1815 by France, the Austrian Empire and Great Britain. It took place during the Congress of Vienna, negotiations on the future of Europe following Napoleon's defeat in the War of the Sixth Coalition.\nThe long-serving French representative, Charles Maurice de Talleyrand-Périgord, wanted to end France's diplomatic isolation and reassure other powers it had renounced any revolutionary intentions. He was provided an opportunity to do so through the Polish-Saxon crisis, caused by Prussia attempting to annex much of Saxony, and Russia doing the same for Poland.\nSince such proposals were opposed by Britain and Austria, it allowed France to position itself as a supporter of legality, and divide the Four Powers. Talleyrand proposed the treaty to Lord Castlereagh and Klemens von Metternich, as a means of warning off Prussia and Russia. The three powers signed on 3 January 1815, agreeing to respond to an attack on any party with a field army of at least 120,000 infantry and 30,000 cavalry.\nHowever, the signatories had no real intention of going to war, and details of the treaty were deliberately leaked. As a result, Alexander I accepted the creation of a semi-independent Polish state; in February, Prussia agreed to a reduced allocation of 40% of Saxony. After the defeat of Napoleon, the Prussian contribution to the campaign was recognised by increasing this to 60%.\nBackground\n]]\nThe Congress of Vienna brought together the European great powers in Austria to discuss the future of Europe following the defeat of France in the 1813-14 War of the Sixth Coalition. The principal allies of the Sixth Coalition, Britain, Austria, Prussia, Russia together with representatives from minor nations and the defeated power, France (now under the Bourbon Restoration) sat from September 1814.  Among their decisions was the redrawing of national borders and spheres of influence; the creation of free navigation rights on international rivers and the establishment of diplomatic precedence.\nDisagreements between the Powers over the fate of the Kingdom of Saxony and the Duchy of Warsaw led to the so-called Polish-Saxon crisis. Prussia and Russia presented a joint plan to improve their position: Austria and Prussia would renounce any claims to Polish territory, with a new state established under Russian influence. In return, Prussia would receive most of Saxony.\nThis was opposed by Austria and Britain, together with some of the minor powers, since they viewed this expansion as a threat to the balance of power. Charles Maurice de Talleyrand-Périgord was concerned at the creation of a Prussia whose size would threaten both France and Austria, but also saw an opportunity to end French diplomatic isolation. It allowed him to position France as a supporter of legitimacy by claiming that ignoring the sovereign rights of Frederick Augustus I of Saxony would create a dangerous precedent.\nIn November 1814, Alexander's brother Grand Duke Konstantin left Vienna for Warsaw, Prussian generals returned to Berlin, while Austria moved troops into Galicia. Soon after, the Russian military commander in Saxony, Nikolai Repnin-Volkonsky, handed the Prussians control of the civil administration, incorrectly claiming it had been approved by Austria and Britain.\nTreaty\nPrussia threatened to take the Saxon territory by force if negotiations did not grant it to them, despite the powers being formally part of the Quadruple Alliance. Talleyrand proposed to the British and Austrian representatives, Lord Castlereagh and Klemens von Metternich, that a defensive alliance should be signed to deter any Prussian aggression.  It would also strengthen the negotiations against Russia's plan for Poland.  Castlereagh and Metternich agreed and a formal treaty to this effect was signed on 3 January 1815.  In signing, Castlereagh exceeded his mandate from the British cabinet, which required him to avoid any further war, but he did not expect it to end in conflict.\nThe three signatories agreed to invite Bavaria, Hanover and the Netherlands to join if needed, as well as Hesse and Sardinia. In the event, this proved unnecessary, since news of the agreement forced Russia and Prussia to come to terms. Its provisions compelled France, Britain and Austria to come to one another's aid within six weeks of any attack, and provide  a joint army of 120,000 infantry and 30,000 cavalry. With its small standing army, Britain was allowed to supply foreign troops in lieu, or subsidise any deficit by £20 per infantryman or £30 per cavalryman per year. All parties agreed not to make a separate peace treaty.\nOnce agreed, news of the treaty was deliberately leaked to Tsar Alexander I of Russia as a form of intimidation. With the nation badly affected by years of war he relented and accepted the establishment of the semi-independent state of Congress Poland.  Later, in February, Prussia also relented and accepted a reduced claim of 40% of the territory of Saxony.  Austria was granted significant influence in Germany as head of the Federal Convention of the German Confederation. Having achieved its aims, the treaty was annulled on 8 February.\nWaterloo and later\nWhilst the Congress was ongoing, on 1 March Napoleon returned to France from exile, won the French Army to his cause and deposed the Bourbon king, Louis XVIII. The great powers mobilised armies against him, including an Anglo-Dutch force under the Duke of Wellington and a Prussian Army under Gebhard Leberecht von Blücher. In the Waterloo Campaign, Napoleon sought to defeat these two armies before reinforcements could arrive from Austria and Russia.\nBlücher's chief of staff, August Neidhardt von Gneisenau, was deeply suspicious of Wellington, and particularly worried his perceived pro-Bourbon bias might jeopardise their primary responsibility to defend Prussia. Aware of this, Napoleon tried to increase tensions by sending him a complete copy of the secret treaty, although its existence and contents were already public knowledge. Wellington reassured the Prussians that if defeated, he would retreat eastwards towards Prussia, not the sea; backed up by sending Henry Hardinge as liaison officer, this seems to have resolved differences between the two parties.\nAnother concern for Blücher was the reliability of his army, which included 16,000 Saxons who had previously served Napoleon. Following orders from Berlin, on 1–2 May they were split into those who would remain Saxon post-annexation, with the rest integrated into the Prussian Army. They refused to parade, chanting support for Frederick Augustus and Napoleon; at one point, Blücher was chased from his headquarters by a mob of Saxon grenadiers. The Saxons asked to serve under British command but Wellington refused, claiming he had enough problems dealing with the Belgians. After a Saxon regiment refused to salute him, Blücher ordered a number shot, disarmed the others and sent them home.\nThe return of Napoleon restored cooperation between the members of the Quadruple Alliance.  War had, in any case, been unlikely with Britain and Austria wary of allowing a French army to operate in Central Europe so soon after Napoleon's troops had conquered swathes of territory there.  After the coalition victory at Waterloo the Prussian negotiating hand was strengthened and they pressed for a larger share of Saxony. It received some 60% of the territory, as well as the territories of the Rhineland, Swedish Pomerania, Posen and Thorn.\nIn many ways, the Secret Treaty was a triumph for Talleyrand, who had ended French diplomatic isolation and divided the Quadruple Alliance. He also limited Prussian gains to areas of Saxony that were largely Catholic and thus harder for the Lutheran state to assimilate, or not contiguous to Prussia, such as the Rhineland. His support of Saxony, based on the principle of legitimacy and equilibrium, guaranteed French security while reinstating it as a key player in ensuring the balance of power.\nPrussia strengthened its position by signing the Holy Alliance with Russia and Austria on 26 September.  Afterwards Metternich attempted to reinstate the Secret Treaty, Castlereagh considered this would cause a permanent division in Europe and refused.  In November Castlereagh positioned the Quadruple alliance as a guarantor of the terms of the Congress, with ongoing conferences to ensure the \"repose and prosperity of nations\".  The national boundaries set by the Congress,  created a successful balance of power - the so-called Concert of Europe, and would remain more or less unchanged for the next 40 years.\nReferences\nSources\n*\n*"
    }
  ]
}