{
  "content": [
    {
      "type": "text",
      "text": "# Secret Warriors (Team White)\n\n}}\nSecret Warriors is an alias for the fictional group Team White created by Nick Fury, a team of superpowered agents appearing in American comic books published by Marvel Comics. The name \"secret warriors\" also refers to the members of other hidden groups in the comics series Secret Warriors and its related titles. Team White was the main team led by Nick Fury from 2009 to 2011. First appearance was in \"The Mighty Avengers\" #13 (July 2008).\nPublication history\nCreated by Brian Michael Bendis and Alex Maleev, the characters were introduced in Mighty Avengers #13, and debuted as a team in Secret Invasion #3, both published in 2008.\nThe team was introduced in the Secret Invasion tie-in issues of Mighty Avengers and then featured in their own ongoing series. This series was co-plotted by Bendis with Jonathan Hickman writing. and was one of the titles launching as part of the Dark Reign storyline. The series was promoted by a series of passwords and clues given in solicitations for upcoming issues. A Marvel spokesman stated that further passwords would be released for the website later on.\nFictional team biography\nThe Team White entered battle for the first time during the Skrulls' invasion of Earth. Manhattan became a warzone with Super-Skrulls devastating the city. The arrival of the Nick Fury-led team turned the tide of battle enough to rescue the combined forces of the Initiative and the Young Avengers from being killed by the Skrulls. Fury rallied all the other heroes together with his agents and began a series of hit and run attacks on the Skrull forces throughout the city. It took all of them just to take out a few Super Skrulls at a time. A better chance at defeating the Skrull invasion came at the sight of Thor's lightning calling them all to Central Park. There, the team gathered with all of the other assembled heroes and repelled the Skrull invasion. In the immediate aftermath of the heroes' victory, Fury and his agents quickly took their leave and went back underground.\nDuring the Dark Reign storyline and the Nick Fury, Agent of Nothing arc, Nick Fury revealed his true agenda to the team. Hydra was bigger and more far reaching than he ever realized. It even had its tentacles in S.H.I.E.L.D. while he ran it. However, the Skrull attack and the dismantling of S.H.I.E.L.D. hit Hydra hard, giving Fury an opportunity to prepare for a new war against them while they reorganized.\nWith S.H.I.E.L.D. being replaced by H.A.M.M.E.R., Hydra was moving to claim as many assets as it could before the U.S. government could, and the agents knew that Hydra would go after the Red Worm psy-ops facility next. The team needed to get there first to prevent Hydra from claiming such an asset. Hydra moved too quickly and the team arrived to witness Kraken and Gorgon personally overseeing the facility's evacuation. When they were in the process of executing two telepaths who were brain damaged by the rushed process of being awakened, Daisy Johnson ordered her team to move in. Kraken teleported away with the remaining telepaths, and Gorgon stayed behind to fight. He severely wounded Yo-Yo by chopping off both of her hands.\nJohnson traveled to the Australian outback along with Druid to meet with Eden Fesi, who was another name on Fury's list of Caterpillars. He readily agreed to join, with Gateway's permission. Fury reached out to Dum-Dum Dugan for help. Dugan and many former S.H.I.E.L.D. agents had gone private in the wake of H.A.M.M.E.R.'s takeover and formed a Howling Commandos private military company.\nFury led the Howling Commandos on a raid of the Dock, another former S.H.I.E.L.D. base that housed the helicarriers. While the Howling Commandos and H.A.M.M.E.R. fought, Hydra intervened to prevent Fury from taking the helicarriers. Team White arrived to back Fury up and turn the tide, making the raid on the Dock a success. Hydra forces retreated, the Howling Commandos made off with three helicarriers, and Fury recruited 3,000 H.A.M.M.E.R. agents over to his side.\nDespite saving the day, Fury kept Team White in the dark about many things. Even the team leader, Johnson, did not get the full story when she asked. It turned out that Fury was not the one who hit the panic button to call them into action at the Dock, but Fury would not provide any answers about that mystery. Similarly, it was implied by Gateway that Fury was running other Caterpillar teams, and for the time being, Fury was staying quiet about that as well.\nFury needed financing for his secret war and got it from using Team White to rob a bank covertly being run by Hydra. This act, coupled with Hydra's defeat at the Dock, made Fury too much of a nuisance for Baron Strucker to ignore. However, Strucker still had much do, so he reached out to Norman Osborn to solve his Fury problem.\nOsborn lured J.T. James, Alexander Aaron and Eden Fesi into a trap using Black Widow as bait. Phobos went in using a Nick Fury Life Model Decoy as a disguise, getting caught in the trap and exposed. James and Eden came to the rescue, but it was Ares who gave the three the opportunity to get away. Aaron was Ares's son, and Ares was impressed with the way his son stood up to Osborn. This was only enough for them to get a brief moment before Osborn sent Ares, Hawkeye (Bullseye) and agents of H.A.M.M.E.R. after them. Eden tried to teleport only them back to the secret base, but Ares forced the portal open to allow Osborn's forces to follow. Team White, including Yo-Yo with her new bionic arms, found themselves fighting H.A.M.M.E.R., Iron Patriot, Ares and Hawkeye (Bullseye) in their own base, which was going through an automated self-destruct countdown triggered by the intrusion. Team White held off Osborn's forces and escaped through another one of Eden's portal before the base exploded.\nMeanwhile, Fury reached out to his old friend John Garrett. Together, they conned Osborn into helping them uncover an active agent of the long thought dormant agency of Leviathan.\nThe return of Leviathan complicated Fury's plans, but it also provided some opportunities. Hydra and Leviathan quickly went to war, giving Fury extra room and time to maneuver his own forces. Johnson discovered that her team was not the only team of special agents at Fury's disposal. Two others were active and operating outside of Fury's direct control: the Black team run by Alexander Pierce, composed of the more dangerous Caterpillars from Fury's list and tasked with watching Hydra; and Gray team run by Fury's own son, Mikel Fury, was tasked with looking into Leviathan, which had been a seemingly dead end assignment until recently. Johnson's Team White, was apparently meant as Fury's fist.\nFury was preparing his forces to go operational when both Hydra and Leviathan were at their weakest. He decided Druid was the weak link of the team and cut him from the roster against the wishes of Johnson and the rest of the team. Meanwhile, James had been compromised by Hydra and was being blackmailed by Baron Strucker.\nDuring the Siege of Asgard, Fury's agenda was interrupted by Norman Osborn's sudden attack on Asgard and Steve Rogers' call for aid. He and Team White answered the call. They allied with the assembled New Avengers and Young Avengers and came to the defense of the Asgardians. However, Phobos was left out of the battle and struck out on his own mission after seeing that his father had been killed by the Sentry.\nOsborn's forces fell, and when the full power of the Sentry's madness was unleashed, he was put down by the assembled heroes. What remained of Asgard was saved. The president turned against Osborn and H.A.M.M.E.R. for their actions, putting an end to the Dark Reign. But Fury and Team White did not stick around for the aftermath. Once all was said and done, they returned to their secret war against Hydra and Leviathan.\nThe time came for the major offensive against Hydra that Fury had been building toward. The target was Hell's Heaven, a secret Hydra base deep inside the borders of China. Fury sent Team Black, led by Alexander Pierce, and two helicarriers full of Howling Commandos personnel, led by Dum Dum Dugan, to carry out the assault. Hydra's forces were overwhelmed by the attack. Team Black breached the facility's security along with a small unit of Howling Commandos and planted an explosive right in the heart of Hell's Heaven. Everyone exfiltrated back to the helicarrers as the base was destroyed.\nUpon completing the objective, Pierce left with Team Black aboard a small aircraft, separating from the Howling Commandos to make their own way out of China and to their next destination. They were not present for what happened next.\nBefore making it out of China, the two helicarriers were intercepted by a superior Hydra force led by the Gorgon. One helicarrier, the Argonaut, was shot down almost immediately. Dugan, commanding the other helicarrier, turned to fight rather than abandon the lost helicarrier by taking an opportunity to escape. However, they were still outgunned. Dugan's helicarrier also fell to Hydra but not before Hydra took some losses as well. The battle immediately resumed on the ground in the wreckage of fallen warships. An explosive injured Dugan, and Jasper Sitwell left the battle to get him to safety. Those who remained to fight Hydra, including Gabriel Jones and Eric Koenig, were killed in action.\nWith the devastating battle in China, Fury's secret war had truly begun and the following six months only saw things take a turn for the worse on all sides. The Howling Commandos were eliminated, and now, Hydra came after Team White. Fury's European command center was destroyed in an attack that also destroyed three city blocks of Paris. Their secret base in London was lost next due to a biological attack that claimed 12,000 civilian lives. Team White was effectively crippled within two months. Once they were sidelined, the conflict between Hydra and Leviathan escalated with both sides taking major losses. There was an attempt to call a cease-fire, but this resulted only in the assassination of Magadan, one of the three leaders of Leviathan. In retaliation, Leviathan destroyed Hydra's new recruitment center in Seattle. This attack was so severe it devastated much of the American city and provoked Fury to find a way to get Team White off the sidelines.\nFury planned a simultaneous assault on both Hydra and Leviathan. Team Black and Team Gray were to target two remaining major Leviathan bases while he and Team White went straight after Gehenna in New Zealand, Hydra's principle base. The operation was meant to be quick and surgical. They would teleport in via Eden's power, plant the bomb and have Eden get them out all in under a minute. The mission did not go as planned. Baron Strucker, the Gorgon and Viper were expecting Team White, and Eden was badly injured before he could teleport them out. Team White fought rather than surrender, and Alexander Aaron used his prophetic knowledge to lead them to the escape path they were supposed to take. A bridge collapse left Alexander and Fury separated from the rest of the team and on the side with Hydra. Fury shot a line across so both of them could cross the chasm, but Alexander forced him to go alone. The son of war stood his ground and fought the Gorgon alone because that was how it was supposed to be. He then died at the Gorgon's hands, because that was also how it was supposed to be.\nAfter bearing witness to Alexander' death, Team White continued their escape. Time was limited. The mountain-breaker bomb they had deployed in Gehenna was armed and would soon explode. Finally, they found access to the surface, but Hydra soldiers were closing in. Fury took the rear to provide cover and prevent them from being swarmed trying to board the aircraft waiting for them. The sheer numbers were against him, though. He was being overwhelmed until Hellfire came back for him. Together, they held Hydra at bay until the bomb detonated.\nAs the mountain broke apart all around them, J.T. James lost his footing and began to fall into a chasm. Fury caught him just in time. Fury said that he knew James was the one who had tipped Hydra off. He knew about the secret meetings with Hydra agents. James explained that Hydra had found him through the money they stole from that bank months back. They had backed him into a corner, and he was doing all he could to make sure that at least Daisy Johnson survived. Fury said that he believed James and that the love between James and Johnson was real. But then, he released James' arm and let the man fall.  Catching up to Team White, Fury said only that James did not make it.\nUpon the aircraft, Team White meets John Garrett and Druid. It is revealed that after being forced off the Team, Druid was trained by Garrett, getting in shape and learning to better control his magical abilities. With his help, Garrett was able to kill Magadan, while making it look like the work of Hydra. After Team White returns to their base, Fury disbands the Team.\nVisiting a graveyard, Fury reminisces about the recruitment of his son Mikel and the rest of Team Gray. It is shown that the whole team died while attacking the base of Hive, with Mikel saying a final goodbye to his father over the radio before detonating explosives that eradicate Hive's base. While Nick Fury grieves over Mikel's grave, he is taken prisoner by Kraken.\nIn 1961, Fury along with his Brother Jake, Dum-Dum Dugan, John Garrett, Baron Strucker, Shoji Soma of the Hand, Cornelius van Lunt, scientist Thomas Davidson and the men who would become Kraken, Magadan and Leviathan's leader, Orion, meet up with a man who calls himself Aries, secretly being Leonardo da Vinci. He assigns each of them a sign of the Zodiac and sends groups of them around the world to gather various artifacts from different locations. Fury's group comes back empty-handed, however, the other artifacts are hooked up to chambers that will empower and rejuvenate people. The group is subsequently betrayed by Magadan and Orion, who take the technology for themselves and create Leviathan. A short time later, Shoji Soma and Strucker attack their base, steal one of the artifacts and injure Orion gravely. After giving the artifact to the Yashida clan for safeguarding, Soma is killed by Leviathan.\nIn the present, Strucker and Nick Fury are both captives of Kraken. They reminisce about their battles, before Kraken reveals that he is, in fact, Jake Fury, having killed the original Kraken a long time ago. In 1961, Fury's team did in fact discover technology to create robotic duplicates, later to be known as LMDs. With these duplicates, Jake's undercover identity was kept secret, while a duplicate of Thomas Davidson was used to make Strucker believe he had access to S.H.I.E.L.D. technology. Baron Strucker realizes that instead of Fury working for him, he worked for Fury all along. Fury then shoots him in the head.\nS.H.I.E.L.D. is soon restarted as a joint effort by the UN. Daisy Johnson is chosen to be the first director, with the remnants of Team White, Team Black and the Howling Commandos as her agents.\nRoster\n; Nick Fury\n: Founder and leader of Team White.\n; Daisy Johnson\n: Codename: Quake, the daughter of Mister Hyde. She possesses the power to create earthquake-like vibrations.\n; Alexander Aaron\n: Codename: Phobos, son of Ares. He possesses the power to instill fear in others, and has limited pre-cognition. As a member of the Olympian race born of a mortal woman, he has the potential for far greater \"god-like\" powers not unlike his uncle Hercules, but his \"mortal\" body must die first. This occurs when he is stabbed through the chest and killed by Gorgon.\n; Sebastian Druid\n: Codename: Druid, the son of Doctor Druid who has inherited some of his father's skill with magic. He is soon seen as a liability, and Fury dismisses him from the team.  It is later shown that Fury in fact put Druid through \"Boot Camp\", assigning John Garrett to get him in shape and boost his confidence.\n; Yo-Yo Rodriguez\n: Codename: Slingshot, the daughter of the Griffin. She can run at superhuman speed and bounces back to the point where she began running. She was recently injured severely, with both of her arms severed by the Gorgon, and was temporarily unable to remain active with the team. However, both arms have now been replaced with technologically advanced prosthetics that afford her some superhuman strength in her hands and she has returned to active duty. During combat she is often seen fighting with a retractable javelin.\n; J.T. Slade\n: Codename: Hellfire, born James Taylor Slade, the grandson of the Phantom Rider, is able to charge items (notably a chain) with fire and unleash a devastating attack. During New Avengers, J.T. is shown as one of the possible replacements for the title of Sorcerer Supreme, showing great magical potential. In issue 16, J.T. is discovered to be a double agent with Hydra, directly with Baron von Strucker. During the fall of Gehenna, Nick Fury tells J.T. that he knows he is a traitor and lets him fall to his death, avenging Alexander.\n; Jerry Sledge\n: Codename: Stonewall, who has been bailed out of jail by Daisy Johnson, where he was being held for hitting a police officer. He possesses superhuman strength and an ability to increase his size, while his skin appears to take an appearance resembling stone. In issue 9, he demonstrated the ability to change the composition of his skin, by turning it into metal after getting Ares' axe swung into his chest. Very little had so far been revealed about the character but, in issue 12, it was revealed that his father is Carl \"Crusher\" Creel, The Absorbing Man. He tries to tell Reed Richards his real name at one point, but is cut off after saying \"Henry\".\n; Eden Fesi\n: A reality warping young man previously under the care and training of the mutant Gateway. Nick Fury initially attempted to recruit him to another one of his \"Caterpillar\" teams, but Gateway refused. As of the MARVEL NOW! relaunch, he has joined the Avengers under the name of Manifold.\nOther \"Caterpillar\" teams\nWithin the Secret Warriors series the featured team is referred to as being one of three other caterpillar teams. While the main team of the series is led by Daisy and overseen by Nick Fury, Fury also oversees two other teams.\nAlexander Pierce's Team Black\n* Alexander Pierce – S.H.I.E.L.D. agent.\n* Aaron Downing – In possession of a \"Shadow Machine\". Both his arms appear to be replaced by technological prosthetics. He has demonstrated the ability to make \"shadowlike constructs\" extend from his prosthetic hands.\n* Lauren Wolfe – A polymorph, the limits of which have yet to be revealed. However, during combat she has been shown to change her hands into spiked mace.\n* Ahmed Noor – A living atom smasher; able to disintegrate matter and cause explosions.\n* Ben Huth – Only known super power is his ability to fly.\n* Bobby Gamorra – Owner of an item referred to as the \"Amulet of Abbadon\", a mystical artifact that grants him magical powers, which so far have been revealed to include the opening of teleportation portals.\n* Cornell Grey – Possess a parasitic brain that allows him to draw information from people's minds upon contact with special mouth-like openings on his palms. The result is that his victims are left brain dead.\n* Ellis Love – A telekinetic and telepath, the extent of which has yet to be revealed, but has been seen using telekinetic energy offensively in combat.\nMikel Fury's Team Gray\nThe leader of the other team is Mikel Fury and the names of the members have been revealed:\n* Sandra Murphy - Mace of Aeshma\n* Brian Cole - Cybernetic Organism\n* Carlos Ayala - Telekinetic\n* Red Webo - Creation Engine\n* Jenny Monroe - Temporal Control\n* Malcolm Monroe - Temporal Control\n* Lynn Richards - Power Leech\n* Robert Martin - Organic Builder\nThe Heavenly Wheel\n* Jake Fury – Scorpio\n* Vasili Dassiev – Capricorn\n* John Garrett – Aquarius\n* Baron Strucker – Sagittarius\n* Dum Dum Dugan – Libra\n* Thomas Davidson – Virgo\n* Shoji Soma – Pisces\n* Cornelius Van Lunt – Taurus\n* Nick Fury – Gemini\n* Daniel Whitehall – Leo\n* Viktor Uvarov – Cancer\n* Leonardo da Vinci – Aries\nIn other media\n* The Secret Warriors appear in ''The Avengers: Earth's Mightiest Heroes'', led by Nick Fury, and consisting of Quake, Black Widow, and Mockingbird. As in the comics, the Secret Warriors are formed in response to the Skrulls' impending invasion. However, Mockingbird was secretly captured and replaced by the Skrull Queen Veranke.\n* The Secret Warriors appear in the Agents of S.H.I.E.L.D. episode, \"The Team\", led by Daisy Johnson and consisting of Elena \"Yo-Yo\" Rodriguez, Lincoln Campbell, and Joey Gutierrez. This version of the team is formed by S.H.I.E.L.D. to combat Gideon Malick and Hydra. However, the team is quickly disbanded after S.H.I.E.L.D. discovers Johnson was brainwashed by Hive.\nBibliography\n* Mighty Avengers #13, 18, 35\n* Avengers: The Initiative #16-18\n* Secret Warriors #1-28\n* Dark Reign: The List – Secret Warriors #1\n* Siege: Secret Warriors #1\n* Secret Invasion #3-8\n* Dark Reign: New Nation #1\n* Siege #2-4\n* Siege: Embedded #4\n* New Avengers #62\n* New Avengers Vol. 2 #1\n* Secret Invasion: Front Line #3\n* Dark Avengers #9\nLegacy\nDuring the Secret Empire storyline, Daisy Johnson established a new incarnation of the team, this time actually named \"Secret Warriors\" to help fight the Hydra takeover of Manhattan. It consists of Ms. Marvel, Devil Dinosaur, Moon Girl, Inferno, and Karnak.\nReferences\nExternal links\n*\n* [http://www.marvel.com/news/comicstories.4009.Secret_Invasion_Illumination~colon~_Secret_Warriors Marvel profile on the Secret Warriors]\n* [http://www.agentofnothing.com/ Promotional agentofnothing website] (Password:eagleeye)"
    }
  ]
}