{
  "content": [
    {
      "type": "text",
      "text": "# Sedgeford, Queensland\n\n| pop           = 0\n| pop_year      =\n| pop_footnotes =\n| established   =\n| postcode      = 4724\n| area          = 1877.2\n| timezone      = AEST\n| utc           = +10:00\n| dist1         = 50.4\n| dir1          = S\n| location1     = Alpha\n| dist2         = 191\n| dir2          = ESE\n| location2     = Barcaldine\n| dist3         = 217\n| dir3          = WSW\n| location3     = Emerald\n| dist4         = 476\n| dir4          = W\n| location4     = Rockhampton\n| dist5         = 1049\n| dir5          = NW\n| location5     = Brisbane\n| lga           = Barcaldine Region\n| stategov      = Gregory\n| fedgov        = Maranoa\n| near-n        = Beaufort\n| near-ne       = Beaufort\n| near-e        = Port Wine\n| near-se       = Lochington\n| near-s        = Mantuan Downs\n| near-sw       = Drummondslope\n| near-w        = Drummondslope\n| near-nw       = Alpha\n}}\nSedgeford is a former rural locality in the Barcaldine Region, Queensland, Australia. In the , Sedgeford had a population of 0 people.\nOn 22 November 2019, the Queensland Government decided to amalgamate the localities in the Barcaldine Region, resulting in five expanded localities based on the larger towns: Alpha, Aramac, Barcaldine, Jericho and Muttaburra. Sedgeford was incorporated into Alpha.\nGeography\nThe Central Western railway line and, to its immediate south, the Capricorn Highway form the northern boundary of the locality. The Mamboo railway station () services the locality and Beaufort to the north.\nNative Companion Creek rises in the south of the locality near Troopers Bluff (elevation ) and flows north exiting the locality to the north-west (Alpha). The creek eventually becomes a tributary of the Belyando River.\nThe predominant land use is grazing on native vegetation.\nHistory\nThe origin of the name is unclear but it appears to have been a pastoral run name since 1884.\nMamboo railway station was established in 1954. Queensland Railways Department assigned the name Mamboo on 5 July 1954. It is an Aboriginal word in the  Kabi language, meaning dogwood tree. However this is not an Indigenous language used in the area.\nIn 1912 Sedgeford pastoral station was sold by Mr Donaldson to Messrs Clark & Whiting.\nEducation\nThere are no schools in Sedgeford. Neighbouring Alpha has a primary and secondary school (to Year 10). The nearest secondary schools including Years 11 and 12 are in Barcaldine and Emerald. Boarding schools and distance education are other options.\nReferences"
    }
  ]
}