{
  "content": [
    {
      "type": "text",
      "text": "# Self-managed social centres in the United Kingdom\n\nMap of social centres in the UK and Ireland in 2006\nSelf-managed social centres in the United Kingdom can be found in squatted, rented, mortgaged and fully owned buildings. These self-managed social centres differ from community centres in that they are self-organised under anti-authoritarian principles and volunteer-run, without any assistance from the state. The largest number have occurred in London from the 1980s onwards, although projects exist in most cities across the UK, linked in a network. Squatted social centres tend to be quickly evicted and therefore some projects deliberately choose a short-term existence, such as A-Spire in Leeds or the Okasional Café in Manchester. Longer term social centres include the 1 in 12 Club in Bradford, the Cowley Club in Brighton and the Sumac Centre in Nottingham, which are co-operatively owned.\nThe projects draw influences from self-managed centres in Italy, working men's clubs, and anarchist clubs such as the Rose Street Club. Each individual social centre's activities are determined by its participants. Activities will often include some of the following: bar, bicycle repair workshop, café, cinema, concert venue, exhibition space, free shop, infoshop, language classes, meeting space, migrant support and radical library.\nHistory\nSelf-managed social centres in the United Kingdom can trace their direct roots back to networking between the autonomy centres of the 1980s and early 1990s such as 121 Centre, Centro Iberico,  Wapping Autonomy Centre, Warzone and the still extant 1 in 12 Club in Bradford. Other influences include the Diggers, working men's clubs, the Landless Workers' Movement (MST) in Brazil, the self-managed social centre movement of Italy, and the occupied factories of Argentina. In addition to being inspired by European squatter movements, social centres follow in the tradition of anarchist clubs such as the Rose Street Club and the utopian socialist communities set up by Charles Fourier and Robert Owen in the 19th century.\nA wave of social centres were opened in the 1990s, centred around a period of social movement activity which involved protesting against the Criminal Justice Bill, the Poll Tax and the government's road building plans. Likewise, places established in the 2000s were inspired by Peoples' Global Action meetings and the anti-globalization movement.\nThe fledgling social centre network was profiled in 2008, in the pamphlet ''What's This Place?'' which was produced as part of the academic project Autonomous Geographies (funded by the ESRC). In 27 articles, different social centres presented their projects and reflected upon their successes and failures. Slightly earlier in the 2000s, there was also a debate about whether rented and owned spaces are a useful anti-capitalist tactic, or not. One view asserted that buying a social centre meant activists got bogged down by mundane activities such as business plans and mortgage applications. The counter-view stated the advantages to owning a place were longevity and stability.\nActivities\nWhat links these social centre projects together is the anarchist principle of self-management, which means they are self-organised and self-funding. They are anti-authoritarian and aim to show an alternative to capitalist modes of behaviour. However, there is no single type of social centre. The aims and policies of individual projects are determined by those running them and shaped by local contexts. This means that whilst every place is unique, functions will include some of the following: bar, bicycle repair workshop, café, concert venue, exhibition space, free shop, infoshop,  language classes, meeting space, migrant support, radical library.\nThe centres are connected in multiple ways. Sociologist Anita Lacey writes that \"Actions, plans, ideas, and contacts are circulated via zines, at infoshops and stalls, and in social centres. Networks of activism develop and do not spontaneously emerge on the day of any given action; they emerge from the interaction of activists, in shared physical and/or emotional spaces.\" Further, as well as being linked together, the centres provide concrete physical spaces for activists to meet and organise events and campaigns. Geographers Paul Chatterton and Stuart Hodkinson view social centres as part of the \"broader 'autonomous movement,'\" playing an \"important role in the re-thinking and re-making 'citizenship' by bringing people together in spaces whose very reason for existence is to question and confront the rampant individualism of everyday life.\"\nSome social centres are co-operatively owned, such as the 1 in 12 Club, Sumac Centre in Nottingham and the Cowley Club in Brighton. The latter two are members of Radical Routes. An advantage of ownership is that those projects have a longer lifetime than squatted or rented projects.\nAround the UK\nThe Initiative Factory (CASA), Liverpool\nIn Belfast, the Warzone Collective formed in 1984, running an anarchopunk social centre between 1986 and 2003, and again between 2011 and 2018. The centre began with a café, a screen printing room and rehearsal spaces for bands. In the 2010s, it hosted gigs and still had a vegan café.\nIn Birmingham there was the squatted Aardvark Centre in the 1990s. Bradford has the long-running 1 in 12 Club. Over several floors it has a bar, café, library, recording studio and venue. In Brighton, the Cowley Club was founded in 2002 and has a bar, bookshop, café, infoshop, library, meeting space and music venue. Above it there is a housing co-operative. There have also been many squatted projects in Brighton such as Medina House and the Sabotaj squat, which was a protest against supermarket expansion.\nBASE (Base for Anarchy & Solidarity in Easton), formerly Kebele, was squatted Easton, Bristol in 1995, initially as housing for homeless people before it became a social centre. A housing co-operative was formed to run the building and the mortgage was paid off in 2005. In 2008, a community co-operative took over the building and the name was changed. The centre contains a radical library, art room, apothecary and bike space.\nThe Red and Black Umbrella collective occupied the Tredegar Hotel pub in Cardiff in 2011. The building had stood empty since 2006, when it had its licence revoked and was shut down by the council. The social centre existed until 2015. In 2019, a community arts space called Gentileza was founded on Duke Street.\nThe George's X Chalkboard project ran in Glasgow from September 2005 to September 2006 and since 2016, there is the Glasgow Autonomous Space. Also in Scotland, the Autonomous Centre of Edinburgh (ACE) was founded in 1997 and the Forest Café was set up in 2000. In 2000, ACE provided meeting space for these groups: Autonomous Women of Edinburgh, Angry Youth, Edinburgh Animal Rights, Youth Solidarity Group, the Mutiny Collective and Prisoners’ Support, May Day Edinburgh, activists opposing the Terrorism Act 2000.\nThe still extant Initiative Factory (also known as CASA) was set up in Liverpool following the dockers' strike in order to provide free community services. It was estimated in 2015 that the group had supplied advice to the value of £15 million. A spokesperson said in 2008 \"the guiding principles are that we’ve never shirked the fact that we’re a socialist organisation, our principles are founded out of the struggle of workers. So that will never change. It’s to help people in poverty, promote education for workers and for people in need.\" Liverpool also has the News from Nowhere, a radical and community bookshop, with the Next to Nowhere social centre in a basement underneath it.\nThe Partisan collective acquired a building on Cheetham Hill Road in Manchester as a social space and concert venue in 2017. Partisan follows in the tradition of the Basement (2005–2008) and Subrosa (2013–15).\nThe Star and Shadow community cinema began in Stepney Bank in Newcastle in 2006 and since 2018 is based on Warwick Street. It is run by volunteers and screens a variety of films. It aims to support self-organised activities and there is a vegetarian café every Sunday. The Sumac Centre building was bought in June 2001 in Forest Fields, Nottingham. Formed out of a previous project called the Rainbow Centre, the Sumac provides a meeting space for groups and a base for Veggies catering, which is run as a non-profit workers co-operative.\nLondon\nThe Camberwell centre, London, evicted 2007\nThe Wapping Autonomy Centre was an early social centre experiment. It was located in a warehouse which was rented between 1981 and 1983 by anarchist punks. Bands such as Crass, Zounds and Flux of Pink Indians played there. Examples of long-term squatted and now evicted projects include the 491 Gallery, RampART and the Spike Surplus Scheme. The 121 Centre was first squatted by Olive Morris and existed as a social centre for 18 years in Brixton, before being evicted in 1999. There was a bookshop, café, gig and rehearsal space, printing facility, office and meeting space. It also provided space for groups such as the radical women's magazine Bad Attitude, AnarQuist (the anarcho-queer group), Brixton Squatters' Aid and the prisoner support group Anarchist Black Cross. The Rainbow Centre was a squatted church in Kentish Town and there was also the Hackney Squatters Centre. The still extant infoshop at 56A Crampton Street in Elephant & Castle began in 1991, inspired by both European infoshops and local squatting movement in Southwark.\nThere are also many examples of squatted projects which did not last very long, since the owner quickly regained possession, for example the Bloomsbury social centre and the Bank of Ideas, which was connected to Occupy London. In the 2000s, there was a series of projects squatted by people connected to Reclaim the Streets and the WOMBLES, such as the Radical Dairy, Grand Banks and Institute for Autonomy. The Really Free School occupied four buildings in central London in 2011, including a Fitzrovia mansion owned by Guy Ritchie. They put on free workshops and lectures.\nSince both buying a property and squatting a place have become more difficult in the 2010s, as a result of gentrification and the criminalisation of squatting in residential buildings under the 2012 Legal Aid, Sentencing and Punishment of Offenders Act, some projects have decided to rent a space, for example DIY Space For London. A spokesperson said “We need a friendly landlord and about 2,000 ground-floor square feet, near to accessible transport, which is a tall order given the crazy cost of renting in London.” Currently in 2024, alongside the 56A Infoshop and the London Action Resource Centre, active London projects include Pelican House in Bethnal Green, DeCentre at Freedom in Whitechapel and the Mayday Rooms on Fleet Street.\nOccasional centres\nThere are also groups which choose to do short-term squatted events lasting a fixed time so as to mitigate the difficulties of long term occupation. Such groups may exist for years and do a series of events, for example: A-Spire (Leeds), Temporary Autonomous Arts (London, Sheffield, Brighton, Bristol, Manchester, Edinburgh, Cardiff), Anarchist Teapot (Brighton) or the OKasional Café (Manchester). The Okasional café did a number of events in the late 1990s and early 2000s, reforming for two weeks in 2010. Focus E15 occupied flats on the Carpenters Estate in east London for several weeks in 2014 and used one flat as a social centre.\nList of current projects\nThis sortable list of notable current social centres in the United Kingdom was last updated in November 2023.\n{| class=\"wikitable sortable\" style=\"width: 100%;\"\n|-\n! Name !! Location !! Established !! Reference\n|-\n| 1 in 12 Club || Bradford || 1988 ||\n|-\n| 56a Infoshop || London|| 1991 ||\n|-\n| Aberdeen Social Centre || Aberdeen|| 2019||\n|-\n| Autonomous Centre of Edinburgh || Edinburgh|| 1997 ||\n|-\n| BASE || Bristol || 1995 (squatted), 2006 (owned) ||\n|-\n|  Blackcurrent Centre || Northampton || 1989 ||\n|-\n| Casa || Liverpool || 2000 ||\n|-\n| Cowley Club || Brighton|| 2002 ||\n|-\n| DeCentre at Freedom Press|| London || 2016 ||\n|-\n| Feminist Library || London || 1975 ||\n|-\n| Field || London || 2010s ||\n|-\n| Focus E15 Sylvia's Corner || London || 2010s ||\n|-\n| Glasgow Autonomous Space|| Glasgow|| 2016 ||\n|-\n| Ground|| Hull|| 2010s ||\n|-\n| London Action Resource Centre || London || 1999 bought, 2002 opened ||\n|-\n| Next to Nowhere|| Liverpool || 2010s ||\n|-\n| Oxford Action Resource Centre|| Oxford|| 2005 ||\n|-\n| Partisan || Manchester|| 2017||\n|-\n| Star and Shadow|| Newcastle upon Tyne ||2006, new location 2018 ||\n|-\n| Sumac Centre|| Nottingham || Current building since 2001 ||\n|-\n| Warehouse Café ||  Birmingham || 2010s ||\n|-\n| Wharf Chambers  ||  Leeds || 2010 ||\n|}\nList of former projects\nThis sortable list of notable former social centres in the United Kingdom was last updated in November 2023.\n{| class=\"wikitable sortable\" style=\"width: 100%;\"\n|-\n! Name !! Location !! Established !! Reference\n|-\n| 121 Centre || London || 1989–1999 ||\n|-\n| 491 Gallery || London || 2001–2013 ||\n|-\n| Aardvark Centre|| Birmingham || 1990s ||\n|-\n| Bank of Ideas || London || 2011–2012 ||\n|-\n|Basement|| Manchester || 2005– ||\n|-\n|BIT|| London || 1968 – 1970s  ||\n|-\n| Bloomsbury Social Centre || London || 2011–2011 ||\n|-\n| Button Factory  || London || ?–2001 ||\n|-\n| Centro Iberico || London || 1982–? ||\n|-\n| Common House  || London || 2013-2021 ||\n|-\n| DIY Space For London || London || 2015–2020 ||\n|-\n| Ex-Grand Banks || London || 2004–2004 ||\n|-\n| Focus E15 Open House || London || 2014–2014||\n|-\n|Gentileza\n|Cardiff\n|2019–2021\n|\n|-\n| George's X Chalkboard  || Glasgow|| 1990s ||\n|-\n| Heartcure || Sheffield|| 2018–2019 ||\n|-\n| Hive|| London || 2015–2017 ||\n|-\n| London Queer Social Centre || London || 2012–2014 (four locations) ||\n|-\n| Medina House || Brighton || 2001–2006, 2007–2007 ||\n|-\n| Radical Dairy || London || 2001–2003 ||\n|-\n| rampART || London || 2004-2009 ||\n|-\n| Red and Black Umbrella|| Cardiff || 2011–2015 ||\n|-\n| Really Free School || London || 2011–2011 ||\n|-\n| Sabotaj || Brighton || 2011–2011||\n|-\n| Spike Surplus Scheme || London || 1999–2009 ||\n|-\n| Square || London || 2000s ||\n|-\n| Subrosa || Manchester || 2013 ||\n|-\n| Wapping Autonomy Centre || London || 1981–1982  ||\n|-\n| Warzone Centre || Belfast || 1986–2003, 2011–2018  ||\n|}\nNetworks\nLondon Social Centres Network\nThe London social centres network existed in the 2000s with a discussion list and newsletter. This then continued until 2011 with the Autonomous London blog.\nSocial Centre Network UK/WISE\nThere was a gathering of social centres at the 1 in 12 Club in January 2007. After several years of inactivity, the Sumac Centre in Nottingham hosted a relaunch of the UK Social Centre Network in November 2014. The network met again in April 2015 at the Next to Nowhere social centre in Liverpool and became known as the \"Social Centre Network of UK and Ireland.\" Another gathering of the Social Centre Network was held in September 2018 at GAS in Glasgow. The network is now known as the Social Centre Network of Wales, Ireland, Scotland, England.\nSee also\n* Advisory Service for Squatters\n* Ecovillages\n* Self-managed social centres in Italy\n* List of self-managed social centres\nReferences\nFurther reading\n* Atton, Chris (2010) Alternative Media Sage\n* Franks, Benjamin (2006) Rebel Alliances: The Means and Ends of British Anarchisms AK Press\n* Meltzer, Albert (1996) ''I Couldn't Paint Golden Angels: Sixty Years of Commonplace Life and Anarchist Agitation'' AK Press\nExternal links\n*[https://lists.riseup.net/www/info/socialcentrenetwork Current social centre network e-list]\n*[https://socialcentrenetwork.weebly.com Current social centre network website]\n*[https://socialcentresnetwork.wordpress.com/ Defunct social centre network website]\n*[http://organisemagazine.org.uk/social-centres/ Organise! Magazine map of UK social centres]\n*[https://radar.squat.net/en/events/country/GB Radical events agenda]"
    }
  ]
}