{
  "content": [
    {
      "type": "text",
      "text": "# Selhurst, North Ward\n\n| location = 24 Cleveland Terrace, North Ward, City of Townsville, Queensland, Australia\n| beginning_label = Design period\n| beginning_date = 1914 - 1919 (World War I)\n| built = 1919\n| built_for =\n| demolished =\n| architect =\n| architecture =\n| owner =\n| designation1 = Queensland Heritage Register\n| designation1_offname = Selhurst\n| designation1_type = state heritage (built)\n| designation1_date = 30 May 2003\n| delisted1_date =\n| designation1_partof =\n| designation1_number = 601247\n| designation1_free1name = Significant period\n| designation1_free1value = 1919 (fabric, historical)\n| designation1_free2name = Significant components\n| designation1_free2value = residential accommodation - manager's house/quarters, ballroom, roof/ridge ventilator/s / fleche/s, views to, fence/wall - perimeter, garden/grounds, views from\n| designation1_free3name = Builders\n| designation1_free3value =\n}}\nSelhurst is a heritage-listed detached house at 24 Cleveland Terrace, North Ward, City of Townsville, Queensland, Australia. It was built in 1919. It was added to the Queensland Heritage Register on 30 May 2003.\nHistory\nSelhurst, built in 1919 was probably designed by Townsville architect Walter Hunt. The house was commissioned by John Alexander Carpenter, Townsville manager for the Burns Philp Company, as his private residence.\nJames Burns established his general business in Townsville in 1872 after several years of working on stations in southern Queensland and as an assistant and later partner in his brother John's grocery business, branches of which were located in Brisbane and Gympie. The Townsville store, opened in 1871, was established as a wholesale business to supply goods to the recently established gold field of Charters Towers and to Cape River, Ravenswood and later the Etheridge, Palmer and Hodgkinson River gold fields. Burns also provided a wholesale and retail service for the isolated stations in the interior.\nRobert Philp, hired by Burns in 1874, became a partner in the business in 1876, prior to Burns moving to Sydney to open a branch of the company.\nThe company, incorporated in April 1883 as Burns, Philp and Company Limited, came to dominate trade in North Queensland and the Pacific through its land and sea interests. Its success was bound up in the booms in the mining, pastoral and sugar industries in North Queensland.\nDuring the early to mid 1880s the Burns Philp Company was involved in the Pacific Islander labour trade. Pacific islanders were imported as cheap indentured labour to work mainly on sugar plantations. In 1882 Philp, together with Burdekin plantation owner Colin Munro and other investors, formed the Townsville Shipping Co.Ltd. as a cover for recruiting South Sea Islander labourers. After the establishment of the company Burns Philp ships were openly dispatched on recruiting voyages. During 1883–1884 the company had five ships working in the trade, however, they dropped out of the trade after two crew from a company ship Hopeful were found guilty of murder and the captain and crew were found guilty of kidnapping in 1884.\nDespite the loss of the Pacific labour trade, by the 1890s there were branches of the business at Cairns, Charters Towers, Cooktown, Normanton, Burketown, Brisbane, Sydney and in the Pacific. At the same time Burns became a shipping agent for companies such as the Queensland Steam Shipping Company which had the mail contract from London via Singapore, Batavia, Thursday Island, Townsville to Sydney.\nDuring his years in Townsville, Robert Philp developed an interest in politics through his involvement in the campaign to expand the railway to the west and through his participation in the movement to create a separate north Queensland state. He was elected to the Queensland Legislative Assembly in 1886 as the member for Musgrave, a constituency north of Townsville. Philp became member for Townsville in 1888, Premier in December 1899 and Premier again in 1907–1908. He remained in politics until 1915.\nManagement of the Townsville Branch of the firm passed to several managers after Philp entered politics. John Alexander Carpenter, who later transferred to Townsville, was a very successful manager of the Cairns Branch from 1907 to 1914. The Cairns Branch, during Carpenter's time, became the biggest net earner of any branch in Australia. However, due to poor management and aggressive competition from firms such as Samuel Allen and Cummins & Campbell, the Townsville Branch slumped and John Alexander Carpenter was transferred to the Townsville office in June 1914. Carpenter purchased land on Melton Hill in North Ward on 22 October 1914. The property was transferred to his wife on 18 December 1916 and a year later the original house was destroyed by fire. The second house, Selhurst, was built in 1919 after the fire. While it is not known who designed and constructed the building it is possible that Townsville architect Walter Hunt was the architect. The house was sold to the Burns Philp Company, as a manager's residence, after Alexander Carpenter was transferred to New Zealand as General Manager in 1919.\nThe house continued as the manager's residence until 1976 when Burns Philp sold its Townsville office.\nIt is important to note that from early settlement Melton Hill has been the location for residences for managerial staff, lawyers and doctors. The first house was built by John Melton Black, manager for Robert Towns c 1865. The Commonwealth Bank and Bank of New South Wales also built managers' houses on the hill, as did several insurance companies and the Shell Oil Company. Jacob Leu of the law firm Roberts & Leu also constructed Warringa as his residence next door to Selhurst.\nApart from Selhurst, a number of significant villa residences from the nineteenth and early to mid twentieth century survive along Cleveland Terrace. These places include The Rocks - 1888, former McMahon House - , Mandalay - , Illawarra - 1911, Warringa - 1912, Duncragan - 1917, the former Shell Company manager's house - , and Former North house - 1940.\nDescription\nSituated almost atop Melton Hill, Selhurst faces east towards the Pacific Ocean and is placed close to the front of the block of land, on Cleveland Terrace.\nSelhurst is a low set single storey residence with verandahs on three sides. The corrugated iron roof has a ventilated raised ridge capping with louvred screens at each end to assist internal cooling.\nThe house has a timber balustrade and a timber \"skirt\" down to the foundation. There are panelled doors at the front of Selhurst. The house has a central hall with rooms opening to either side and a small ballroom at the rear of the house which has been converted to a family room.\nThe house is constructed on a platform cut into the hillside. At the rear of the block, in the southeast corner, the land rises to a second level. The house is surrounded by gardens and includes a large rock wall and ivy hedge along the front of the yard. This wall is believed to be a remnant of an 1865 rock wall constructed by South Sea Island labourers as part of an enclosure which surrounded John Melton Black's property on Melton Hill.\nPalm trees are scattered around the house giving it a tropical look. A white paling fence encloses the swimming pool and several ferns are intermingled with the palms and lawns in this area. Plans are in place to restore the rear garden. Selhurst is one of only three houses of a similar design remaining in Townsville. It is the only one of this specific design to have survived.\nHeritage listing\nSelhurst was listed on the Queensland Heritage Register on 30 May 2003 having satisfied the following criteria.\n'''The place is important in demonstrating the evolution or pattern of Queensland's history.'''\nSelhurst, constructed in 1919 as the manager's residence for Queensland shipping firm Burns Philp, is an important component of early North Queensland commercial history and is indicative of the significant contribution made by the company to the economic development of Queensland.\nThe place is important because of its aesthetic significance.\nAs an early North Queensland vernacular style residence, Selhurst is one of a number of significant villa residences along Cleveland Terrace. Together with Warringa and St James Cathedral, Selhurst makes a significant aesthetic contribution, through form, scale and materials to the Melton Hill streetscape.\n'''The place has a special association with the life or work of a particular person, group or organisation of importance in Queensland's history.'''\nThe house, which served as the managers' residence for the Burns Philp Company for fifty-seven years, is thought to be an example of the work of Townsville architect Walter Hunt.\nReferences\nAttribution"
    }
  ]
}