{
  "content": [
    {
      "type": "text",
      "text": "# Selly Oak (ward)\n\n| area_total_km2 =\n| area_footnotes =\n| hide_services = yes\n}}\nThe Selly Oak local council ward was one of the 40 electoral wards for the City of Birmingham, England prior to 2018.  It was also one of the four wards that make up the local council constituency of Selly Oak, the other three being the wards of Billesley, Bournville and Brandwood.\nDescription\nThe Selly Oak ward covered an area of south Birmingham, and includes not only the suburb of Selly Oak but also the adjoining districts of Bournbrook, Selly Park and Ten Acres, together with a small part of the Stirchley area. It was replaced by Weoley and Selly Oak ward and Bournbrook and Selly Park ward both created in 2018.\nDemographics (from the census of 2001)\nThe 2001 Population Census recorded that 25,792 people were living in the Selly Oak ward, with a population density of 4,236 people per km2 compared with 3,649 people per km2 for Birmingham. The ward has a below-average percentage of ethnic minorities, with only 15.9% of the population consisting of ethnic minorities compared with 29.6% for Birmingham in general.\nHistory\nThe Ward came into existence in 1911 when the boundaries of the City of Birmingham were extended as a result of the Greater Birmingham Act, and when the number of electoral wards in the city was extended from 18 to 30. At that stage, three councillors were elected for the Ward, whereas in subsequent years there have been single elections.  The area had previously been part of the Parish of Northfield, and originally in north Worcestershire.  It was created by the union of two former electoral wards of the King's Norton and Northfield urban district, namely the Selly Oak (East) Ward, covering the districts of Bournbrook, Selly Park and Ten Acres, and the Selly Oak (West) Ward, covering Selly Oak itself and part of the district of Bournville).\nParliamentary representation\nUnder the Representation of the People Act 1918 the wards of Selly Oak and Northfield, together with that \"part of King's Norton Ward which is not included in the Moseley Division\" were to form the Parliamentary constituency of King's Norton. Selly Oak ward remained within the King's Norton constituency until boundary alterations were provided in the 1948 Representation of the People Act, and the Northfield ward was placed in the newly constituted Parliamentary constituency of Northfield in 1950. Further boundary changes led to the creation of a distinct Selly Oak Parliamentary constituency in 1955, in which the ward of Selly Oak has since remained.\nBirmingham electoral wards were changed in 2018, when the existing Selly Oak ward was divided between new Bournbrook and Selly Park, Bournville, and Selly Oak and Weoley wards.\nPolitics\nThe elected Birmingham City Council members prior to the wards dissolution were:  Karen McCarthy, Brigid Jones and Changese Khan of the Labour Party. At the time Brigid Jones was also Birmingham City Council's Cabinet Member for Children and Family Services.\nElection results\n2010s\n9.3\n}}\n3.9\n}}\n3.3\n}}\n2.9\n}}\n0.4\n}}\nElectorate }}\n12\n}}\n1\n}}\n7\n}}\n1\n}}\n6\n}}\n}}\n7\n}}\n6\n}}\n3\n}}\n1\n}}\nElectorate 19,167 }}\n1\n}}\n4\n}}\n3\n}}\n5\n}}\nElectorate 19,037 }}\n}}\n2\n}}\n1\n}}\n3\n}}\n2\n}}\n2000s\nElectorate 18,470 }}\n, Local Elections Handbook 2003, p. 22.\nElectorate 21,876 }}\n, Local Elections Handbook 2002, p. 61.\nElectorate 21,967 }}\n1990s\n1980s\n1970s\n1960s\n, Birmingham Votes: 1911–2000, p. 87.\nElectorate 18,918 }}\n, Birmingham Votes: 1911–2000, p. 84.\nElectorate 19,019 }}\n, Birmingham Votes: 1911–2000, p. 82.\nElectorate 19,172 }}\n, Birmingham Votes: 1911–2000, p. 79.\nElectorate 19,349 }}\n, Birmingham Votes: 1911–2000, p. 77.\nElectorate 21,111 }}\n, Birmingham Votes: 1911–2000, p. 74.\nElectorate 21,177 }}\n1950s\n, Birmingham Votes: 1911–2000, p. 72.\nElectorate 21,369 }}\n, Birmingham Votes: 1911–2000, p. 70.\nElectorate 21,387 }}\n, Birmingham Votes: 1911–2000, p. 68.\nElectorate 21,769 }}\n, Birmingham Votes: 1911–2000, p. 65.\nElectorate 22,139 }}\n, Birmingham Votes: 1911–2000, p. 63.\nElectorate 22,372 }}\n, Birmingham Votes: 1911–2000, p. 61.\nElectorate 22,529 }}\n, Birmingham Votes: 1911–2000, p. 59.\nElectorate 22,857 }}\n, Birmingham Votes: 1911–2000, p. 57.\nElectorate 23,048 }}\n, Birmingham Votes: 1911–2000, p. 55.\nElectorate 23,192 }}\n, Birmingham Votes: 1911–2000, p. 53.\nElectorate 23,261 }}\n1940s\n, Birmingham Votes: 1911–2000, p. 50.\nElectorate 24,393 }}\n, Birmingham Votes: 1911–2000, p. 48.\nElectorate 24,460 }}\n, Birmingham Votes: 1911–2000, p. 46.\nElectorate 24,002 }}\n, Birmingham Votes: 1911–2000, p. 43.\nElectorate 23,148 }}\n, Birmingham Votes: 1911–2000, p. 43.\nElectorate 23,148 }}\nSee also\n*Birmingham City Council elections\nReferences\nNotes\nBibliography\n*\n*\n*\nExternal links\n*[http://www.birmingham.gov.uk/sellyoakward Birmingham City Council's Selly Oak Ward]\n*[http://www.birmingham.gov.uk/sellyoak Birmingham City Council's Selly Oak Constituency]"
    }
  ]
}