{
  "content": [
    {
      "type": "text",
      "text": "# Senate Investigation into Motion Picture War Propaganda\n\nThe Senate Investigation into Motion Picture War Propaganda was a 1941 investigation by a group of isolationist United States Senators which set out to find evidence that the United States movie industry was agitating for the United States to join World War II on the side of the Allies.__NOTOC__\nBackground\nDuring the 1930s, Hollywood produced few films about the Nazi rise to power or the political situation in Europe. That began to change at the end of the decade as American sentiments against Nazism began to harden. Films such as Confessions of a Nazi Spy (1939), The Mortal Storm (1940), Foreign Correspondent (1940), The Great Dictator (1940), and A Yank in the RAF (1941) were openly critical of Germany, which alarmed American isolationists. Several of those films would be discussed during the hearings. However, only five percent of Hollywood films in 1940 dealt with Nazism at all.\nInvestigation\nOn 1 August 1941, US Senator Gerald Nye gave a speech in Saint Louis, Missouri, to an audience of 2,600 supporters and charged that Hollywood studios had become \"the most gigantic engines of propaganda in existence.\" During the speech, he read a list of names of men who he said controlled the film industry. Critics noted that the list consisted mostly of Jewish names, which gave rise to perceptions of antisemitism.\nThe investigation was to be authorized by Senate Resolution 152, drafted by John T. Flynn, the chairman of America First Committee's New York branch. Although the resolution did not pass, the subcommittee formed anyway and subpoenaed witnesses from the film industry. The subcommittee consisted of D. Worth Clark, a Democratic Party senator from Idaho who served as chair; the Democrats Homer T. Bone (Washington) and Ernest McFarland (Arizona), and the Republicans Charles W. Tobey (New Hampshire) and C. Wayland Brooks (Illinois). All except McFarland had declared their support for isolationism. The industry hired Wendell Willkie, a pro-interventionist Republican and unsuccessful candidate in the 1940 United States presidential election, to represent it.\nHearings commenced on 9 September, when Nye testified about the alleged propaganda in the motion-picture industry. In a break with protocol, Wilkie was not allowed to cross-examine or to summon witnesses for the defense. Instead, McFarland cross-examined Nye, pressing him to define \"propaganda\" and specify what he wanted the Senate to do to combat it.\nThe hearings ended on 26 September. By late September, the investigation had run out of funds. Additional funds were never likely to be approved as the Audit and Control Committee was chaired by Scott Lucas, a supporter of US President Franklin Roosevelt.\nReception\nThe investigation received widespread mostly-critical press coverage while it was ongoing. Critics alleged that the senators wanted to suppress freedom of expression. According to one survey, only nine percent of Americans approved of the investigation: at the same time Sergeant York and The Great Dictator were the highest-grossing films of 1941. The investigation had little impact on the film industry, and was later mostly forgotten because it was overshadowed by the Pearl Harbor attack on 7 December 1941 and the United States' entry into the war. Unlike the 1947 and 1952 investigations by the House Un-American Activities Committee into Hollywood figures, it did not define the targets' careers.\nReferences\nSources\n*\n*\n*\nExternal links\n*[https://books.google.com/books?id=NDQVAAAAMAAJ&q=Senate+Investigation+into+Motion+Picture+War+Propaganda Propaganda in Motion Pictures: Hearings Before a Subcommittee of the Committee on Interstate Commerce, United States Senate, Seventy-seventh Congress, First Session, on S. Res.152, a Resolution Authorizing an Investigation of War Propaganda Disseminated by the Motion Picture Industry and of Any Monopoly in the Production, Distribution Or Exhibition of Motion Pictures; Sept.9-26, 1941]"
    }
  ]
}