{
  "content": [
    {
      "type": "text",
      "text": "# Senna stowardii\n\n|synonyms_ref =\n|synonyms =\n* Cassia stowardii S.Moore\n* Senna cardiosperma subsp. stowardii (S.Moore) Randell\n}}\nSenna stowardii is a species of flowering plant in the family Fabaceae and is endemic to inland, southern Western Australia. It is an erect, dense shrub with pinnate leaves, usually with nine to fourteen pairs of linear to narrowly elliptic leaflets, and yellow flowers arranged in groups of three to five, with ten fertile stamens in each flower.\nDescription\nSenna stowardii is an erect, dense shrub that typically grows to a height of . Its leaves are  long on a petiole  long. The leaves are pinnate, usually with nine to fourteen pairs of linear to narrowly elliptic leaflets  long and  wide spaced  apart. The flowers are yellow and arranged in groups of three to five in upper leaf axils on a peduncle  long, each flower on a pedicel  long. The petals are  long and there are ten fertile stamens in each flower, the anthers  long and of different lengths. Flowering occurs in winter and spring, and the fruit is a flat, straight pod  long and  wide.\nTaxonomy\nThis species was first formally described in 1920 by Spencer Le Marchant Moore who gave it the name Cassia stowardii in the Journal of the Linnean Society, Botany, from specimens collected at Mount Marshall by Frederick Stoward. In 1998, Barbara Rae Randell transferred the species to Senna as S. stowardii in the Flora of Australia. The specific epithet (stowardii) honours the collector of the type specimens.\nDistribution and habitat\nSenna stowardii grows in arid places on the slopes of breakaways, near salt lakes and on sand dunes in the Avon Wheatbelt, Coolgardie, Gascoyne, Murchison and Yalgoo bioregions of southern inland Western Australia.\nConservation status\nSenna stowardii is listed as \"not threatened\" by the Government of Western Australia Department of Biodiversity, Conservation and Attractions.\nReferences"
    }
  ]
}