{
  "content": [
    {
      "type": "text",
      "text": "# Seoul Queer Culture Festival\n\n}}\nSeoul Queer Culture Festival (SQCF; ), formerly Korea Queer Culture Festival (KQCF; ), is an annual modern Korean festival on LGBT rights. It includes a pride parade and film festival events. The festival lasts for a week or two, and usually takes place in late May to early June. As it was the only queer culture festival in Korea until 2009, when Daegu Queer Culture Festival began, it was also commonly called Korea Queer Festival or Queer Culture Festival., translating directly as \"Queer Culture Festival\" and not including the adjective \"Korean\".}} The event is Korea's largest LGBT festival.\nHistory\nparticipants of the Korea Queer Culture Festival (2014)]]\nThe festival first took place in the year 2000. The pride parade that year took place in the Daehangno area and reportedly had 50 attendees; some onlookers \"cursed and yelled aggressively\".\nSince 2001 the festival has included a film festival, Korea Queer Film Festival (KQFF).\nThe 9th edition in 2009 around  the Cheonggye cheon area had a much larger number of participants and a more peaceful atmosphere.\nThe 10th edition of the festival in 2010 was held in the Jongno area of Seoul. The event was also attended by representatives of a number of Korean NGOs, including Baram Sory, the Korean Gay Men's Human Rights Group, the Korean Lesbian Foundation, the Lesbian Counseling Center in South Korea, Korean Womenlink, Outeen, Unninetwork and Project Butchway 2010 film studio.\nIn 2011, the 12th edition of the festival was held in the Hanbit Media Park, Cheonggyecheon area of Seoul. Churches and political parties were among that year's festival participants.\nThe 14th edition of the festival took place in the Hongdae area of Seoul and gathered about 10,000 attendants, a record number. Like most editions it featured a pride parade and a film festival. Notable attendees included Korean LGBT celebrities Harisu and Kim Jho Kwang-soo.\nThe 15th edition of the festival, taking place in early June 2014 in the Sinchon area of Seoul, near Yonsei University, declared its goal as protesting against \"the oppression of LGBT people in Russia and Korea, and show support and solidarity within the LGBT community\". The 2014 festival lasts over a week, and events include a pride parade and a film festival. The 2014 edition received official support from Google. The festival organizers have reported that days before the festival was about to start, the government withdrew permission from them, declaring it \"inappropriate\" in light of the recent Sinking of the MV Sewol tragedy; but the organizers have stated that they believe this is a pretext used by unfriendly Christian groups trying to sabotage the festival by sending numerous complaints to the government. The organizers were prepared to disobey the authorities and hold the event even without official permission. The festival drew an estimated 10,000-15,000 attendees. The government officials did not prevent the festival from taking place, but also issued permission to conservative, religious anti-LGBT rights groups to hold rallies at the same time and location. This led to a number of disruptions and delays.\nThe parade was banned in 2015. This has attracted international attention to the event, with most of it being critical of the progress made regarding LGBT rights in South Korea. Human Rights Watch has expressed concern in a public online letter to the President of Korea.\nThe event was held again in 2016, 2017, 2018 2019 and 2022.\nIn May 2023, Seoul’s city government blocked South Korea’s annual LGBT festival from taking place outside city hall and granted a permit for anti-LGBT Christian concert instead.\nIn June 2024, a protest against the Queer Culture Festival was held in central Seoul. Thousands of participants held blue flags and signs with phrases such as \"No to homosexuality\".\nPolitical endorsements\nThe event attracts support from small Korean political parties, the Democratic Labor Party and New Progressive Party; more conservative members of Korean government take a neutral stance towards the event. The festival receives no significant support from the government. In 2017, the National Human Rights Commission of Korea participated in the festival for the first time as a government agency.\nPrivacy concerns\nUnlike many other similar events worldwide, this Korean festival actively limits the ability of attendees to take pictures or videos. Until 2010 the organizers issued no-photography stickers, ribbons and bands; since then they require registration for all photographers and video recorders and are asking photo-takers to blur participants' faces before publishing pictures online. In 2012 face masks and sunglasses, obscuring participants' features, were reported as common. This is done in order to reduce the chance of accidental outing of participants, who still face significant discrimination in Korean society. Anti-gay protesters have been known to take pictures of participants and distribute them in order to embarrass the attendees.\nSee also\n*LGBT rights in South Korea\n*Daegu Queer Culture Festival\nNotes\nReferences\nExternal links\n*"
    }
  ]
}