{
  "content": [
    {
      "type": "text",
      "text": "# Seppo Evwaraye\n\n| birth_place    = Vaasa, Finland\n| death_date     =\n| death_place    =\n| height_ft      = 6\n| height_in      = 5\n| weight_lbs     = 320\n| high_school    =\n| college        = Nebraska\n| cis            =\n| undraftedyear  = 2006\n| pastteams      =\n* Carolina Panthers (2006)*\n* Cologne Centurions (2007)\n* Minnesota Vikings (2007)*\n* Porvoo Butchers (2008–2010)\n| pastcoaching   =\n* Wasa Royals (2013–2016)Head coach\n* Finland U-15 (2017–present)Head coach/OL coach\n*Wasa Royals (2018) Interim head coach\n| pastexecutive  =\n* Wasa Royals (2013–present)General Manager\n| pastadmin      =\n| status         =\n| cflstatus      =\n| highlights     = As a player\n* 2× Maple Bowl champion (2009, 2010)\nAs a head coach:\n* Iron Bowl (Finland) champion (2013)\n* 2× Spaghetti Bowl champion (2014, 2015)\n| regular_record =\n| playoff_record =\n| overall_record =\n| pfr            =\n| pfrcoach       =\n| cfl            =\n| afl            =\n| HOF            =\n| CollegeHOF     =\n}}\nSeppo Evwaraye (born June 1, 1982) is a Finnish former offensive guard in American football and former general manager and interim head coach of Finnish team Wasa Royals of Maple league. Evwaraye was first signed by Carolina Panthers as a free agent in 2006, and also played for Minnesota Vikings as an international practice squad member.\nCareer\nPlaying career\nEvwaraye started playing football in his home city of Vaasa, Finland. During his year as an exchange student in Nebraska, Evwaraye received an offer to play for University of Nebraska. He redshirted as a freshman. Evwaraye played as a defensive tackle during his freshman and sophomore year, but turned to right tackle as a junior.\nEvwaraye had been signed by the Carolina Panthers as a free agent in 2006, however he was unable to make the team due to problems with his work permit. Evwaraye played during the 2007 spring in NFL Europa for Cologne Centurions as a guard. After the season, he joined the Vikings as an International Practice Squad Program member.\nEvwaraye retired in September 2010 after winning his second consecutive Finnish Championship with the Porvoo Butchers.\nCoaching career\nEvwaraye has been the head coach and general manager of Finnish team Wasa Royals since 2013 season. In his first season as head coach Royals achieved promotion to Finnish first division. In his second season, Royals won the Finnish first division championship, Spaghetti Bowl. In 2015 Royals again won the Spaghetti Bowl and achieved promotion to Finland's top tier, Vaahteraliiga. Royals finished fourth in the regular season with a record of 6–6 and were defeated by Seinäjoki Crocodiles in the semi-finals.\nAt the end of 2016 season Evwaraye left his position as head coach and became a full-time general manager of the team.\nEvwaraye is currently the head coach and offensive line coach of Finland's under-15's national team.\nEvwaraye took over as interim head coach of Royals when the team fired Dan Grass after week one of 2018 Maple league.\nPersonal life\nEvwaraye's mother is Finnish and father Nigerian. He has two football playing brothers, Ari and Efe, who both are Finnish champions and Finnish National Team players. All three brothers joined forces for the 2009 season and played for Porvoo Butchers championship winning team.\nSeppo was inducted to the Finnish American Football Hall of Fame in 2016.\nReferences\nExternal links\n*[http://www.justsportsstats.com/footballstatsindex.php?player_id=evwarsep001 Stats Crew]"
    }
  ]
}