{
  "content": [
    {
      "type": "text",
      "text": "# September 1982 Lebanese presidential election\n\n| before_party = Chehabism\n| after_election = Amine Gemayel\n| after_party = Kataeb Party\n}}\nAn indirect presidential election was held in the Parliament of Lebanon on 21 September 1982, resulting in Kataeb politician Amine Gemayel being elected President of the Lebanese Republic.\nBy convention, the presidency is always attributed to a Maronite Christian. Under the article 49 of the Lebanese Constitution, a qualified majority of two-thirds of the members of the then 99-seat Lebanese Parliament is required to elect the president in the first round. After the second round of election, the president is elected by an absolute majority of the total number of deputies in office.\nBackground\nLebanese Civil War\nIsrael invaded and the PLO were expelled from Lebanon in August 1982. During the invasion, the Israelis wanted the Lebanese Forces to assist the Israeli Army militarily by fighting the PLO and allied groups in West Beirut; however, Gemayel refused, stating that his forces would not assist an invading army. By then, Gemayel had announced his candidacy for president. He was backed by the United States, who sent peacekeeping troops to oversee the withdrawal of the PLO from Lebanon. Gemayel had requested that they stay longer to keep Lebanon stable until he could reunite it, but his request was denied. Israel's Mossad intelligence agency also contributed to his presidency. On 23 August 1982, being the only one to declare candidacy, Gemayel was elected president, as he prevailed over the National Movement.\nBachir Gemayel election\nIn 1982, Bachir Gemayel, Amine Gemayel's brother, was elected to presidency, but was assassinated before taking office. Endorsed by the United States and Israel, he was elected on 23 September as the eighth president. At the age of 34 years, he was the youngest president to take office.\nResults\nThe parliament had 80 of the 99 MPs present for the elections. Amine Gemayel was elected during the first round of voting. 77 votes for Amine Gemayel and 3 blank ballots.\nAftermath\nGemayel never promised the Israelis anything in order to be elected president, but he promised that he would follow the path of his brother Bashir whatever that path was. He left his post in the Kataeb Party after being elected president. Once elected, he refused to meet any Israeli official. With foreign armies occupying two-thirds of the country (Syria in the north and east, Israel in the south), and private armies independent of government control occupying most of the rest, Gemayel's government lacked any real power. His efforts to reach a peace settlement with Israel were stymied by Syria and by Muslim politicians at home. His government found itself largely unable to collect income tax, as warlords controlling the ports and major cities pocketed the tax take themselves. Many criticized Gemayel for not moving decisively enough to assert the authority of the government, but others have pointed out that with most of the country under foreign occupation, there was little that he could do. He managed to keep a semblance of constitutional order.\nNotes\nReferences"
    }
  ]
}