{
  "content": [
    {
      "type": "text",
      "text": "# Sequoia and Kings Canyon National Parks\n\nThe Sequoia and Kings Canyon National Parks is the consolidated management structure for Sequoia National Park and Kings Canyon National Park in California. Both parks have been jointly administered since 1943. They have a combined size of .  It was designated the UNESCO Sequoia-Kings Canyon Biosphere Reserve in 1976.\nIt is open 24 hours a day, every day of the year. The Parks feature a wide variety of animals that include over 200 species of birds, gregarious slender salamander, western toad, western spadefoot toad, rainbow trout, coyote, Mexican free-tailed bat, rubber boa, common kingsnake, and many more.\nHistory\nThe area now occupied by the parks was originally inhabited by Native Americans. The Monache tribes, for example, would use the mountain passes as trade routes. As European settlers explored and settled in California, the indigenous population decreased rapidly due to the spread of foreign diseases such as smallpox. Preserving the area was not a priority for the settlers, who saw the area as a place for plentiful resources, particularly the sequoia trees (Sequoiadendron giganteum), as they were extremely plentiful and easily accessible. The Native Americans living there found themselves losing their only means of survival, and as a result of their desperation, they turned toward theft and crimes against the Spanish settlers in order to survive.\nThe Parks were separately founded by two different acts of Congress before being joined in 1943. Sequoia National Park was first preserved as land set aside for recreation through a bill, Sept. 25, 1890, ch. 926, ยง1, 26 Stat. 478, passed by Congress and signed by President Benjamin Harrison on September 5, 1890, largely due to the efforts of Colonel George W. Stewart, who is known as the \"Father of Sequoia National Park\". The land was set aside to protect the sequoia trees from logging companies in order to keep the pristine beauty of the land for years to come. It wasn't until a few months after the bill had passed that the park was given the National Park name by the Secretary of the Interior, John Willock Noble. Stewart also collaborated with John Muir, who was known for his efforts to preserve Kings Canyon National Park, in order to achieve the formation of the National Park Service. Sequoia was expanded in 1926.\nAfter establishing Sequoia National Park, General Grant National Park was also established. General Grant National Park was later abolished by President Roosevelt and created into Kings Canyon National Park, on the same land. Due to their proximity and similarities, the administration of each park was combined in 1943.\nBefore John Muir visited the area now known as Kings Canyon National Park, the area did not receive much attention, despite some settlers having moved there. Harold Ickes, the U.S. Secretary of the Interior was the one fighting for the formation of the Kings Canyon National Park. Before the area became an official park there were threats to the area. In 1920, the major threat was to create a reservoir in a part of the park known as the Cedar Grove Area. It was not until 1940 when the park was officially formed that the threats were dismissed.\nSuperintendent history\nSequoia and Kings Canyon National Park\n{| class=\"wikitable\"\n|John R. White, Supt. 2\n|10/01/1943\n|\n|10/10/1947\n|-\n|Eivind T. Scoyen, Supt.\n|11/23/1947\n|\n|1/15/1956\n|-\n|George A. Walker, Act'g. Supt.\n|1/16/1956\n|\n|5/05/1956\n|-\n|Thomas J. Allen, Supt.\n|5/06/1956\n|\n|10/31/1959\n|-\n|John M. Davis, Supt.\n|11/01/1959\n|\n|2/27/1966\n|-\n|Frank F. Kowski, Supt. 3\n|3/13/1966\n|\n|9/23/1967\n|-\n|John S. McLaughlin, Supt.\n|10/08/1967\n|\n|11/25/1972\n|-\n|Henry G. Schmidt, Supt.\n|11/26/1972\n|\n|7/31/1975\n|-\n|Gene V. Daugherty, Act'g. Supt.\n|8/01/1975\n|\n|10/25/1975\n|-\n|Stanley T. Albright, Supt.\n|10/26/1975\n|\n|9/10/1977\n|-\n|David D. Thompson Jr., Supt.\n|10/23/1977\n|\n|3/31/1980\n|-\n|James L. McLaughlin, Act'g. Supt.\n|4/01/1980\n|\n|8/09/1980\n|-\n|Quincy B. Evison, Supt.\n|8/10/1980\n|\n|8/03/1985\n|-\n|John H. Davis, Supt.\n|9/29/1985\n|\n|1/14/1989\n|-\n|John T. Ritter, Supt.\n|1/15/1989\n|\n|\n|}\nKings Canyon National Park (prior to joint administration)\n{| class=\"wikitable\"\n|Guy Hopping, Act'g. Supt.\n|3/04/1940\n|\n|3/15/1940\n|-\n|Eivind T. Scoyen, Supt. 2\n|7/16/1941\n|\n|9/30/1943\n|}\nReference:\nGeology\nSequoia National Park and Kings Canyon National Park house various natural spectacles. The parks are a large part of the Sierra Nevada Mountain Range. Its entirety, Sequoia and Kings Canyon National Park has been regionally affiliated with the Western region of National Park Service units. The two adjacent parks extend from the foothills of the San Joaquin Valley to the crest of the Sierra Nevada and contain the highest parts of that range. Pleistocene glaciers left an abrupt topography of granite carved canyons and domes and hundreds of glacial lakes. Among the peaks is Mount Whitney which, at 14,491 feet, is one of the tallest mountains in the United States. Other mountains range from elevation of 12,000 feet to 14,000 feet. Sequoia National Park and Kings Canyon National Park house about 200 marble caves combined. The National Park Service is committed to keeping its units operational and while preserving the beauty of the park. Although, the NPS needs to provide necessary accommodations to growing visitors to the park. The Sequoia and Kings Canyon National Park needs to undergo approximately $160 million in renovations to current facilities.\nEcosystems\nThe most notable vegetation is forests of giant sequoia (Sequoiadendron giganteum). Oak woodland (blue oak, interior live oak) and chaparral with chamise and manzanita characterize the lower elevations. Mixed conifer forest with Colorado white fir, red fir,  western yellow pine (ponderosa pine), sugar pine and lodgepole pine forests and montane meadows occupy the middle elevations. Subalpine forests with foxtail pine, whitebark pine and meadows, krummholz, and alpine ecosystems typify the higher elevations.\nCultural impacts\nIn addition to their natural diversity, the parks also host a unique cultural and historical record. Archaeological sites date back at least five thousand years, indicating the presence of Native American peoples throughout the Sierra Nevada. Past herding of sheep (1850-1900) and cattle (1850-1940) has resulted in significant changes in the species composition and extent of upland and foothill vegetation. Wildfire suppression during the 20th century has interrupted successional patterns. Air pollution from outside the biosphere reserve affects several prominent tree species. Recreational impact is locally acute. Both parks have been jointly managed by the National Park Service as the Sequoia and Kings Canyon National Parks since 1943, and Sequoia National Park contains a number of visitor centers, campsites and supply facilities.\nIn Sequoia and Kings Canyon National Park, recent times have brought new public safety issues to its park. A big threat to its environment is forest fires. Park administration conducts a number of controlled burns each year to prevent and reduce future forest fires. In addition, illegal marijuana grow sites have been found throughout the park. The drug trafficking organizations have had adverse effects on the environment. The growers clear-cut vegetation, reroute waterways, utilize illegal fertilizer and pesticides, and alter the natural landscape.\nSee also\n* National parks in California\n* Protected areas of the Sierra Nevada\nReferences"
    }
  ]
}