{
  "content": [
    {
      "type": "text",
      "text": "# Sergiusz Pinkwart\n\n| birth_place        = Warsaw, Poland\n| occupation         =\n| website            =\n}}\nSergiusz Pinkwart (born 22 May 1973 in Warsaw) is a Polish writer, traveler, journalist and classical musician. He is the author of novels, books for children and travel guides, and is also a television, radio and press journalist and TV personality.\nCareer\nHe made his literary debut in 1987 with the collection of stories Fairy Tales from The Tatra Mountains. He graduated from the Fryderyk Chopin University in Warsaw, a musical conservatorium and academy, he professionally plays the violin and viola. From 1994, for several years he combined his musical career as a violist in the Polish Radio Symphony Orchestra and on \"Polish Broadway\" – ROMA Musical Theater, with journalistic work as the head of the foreign departments in magazines: Viva!, Gala, and PANI Magazine. He was specialized in interviews with world famous actors, musicians, filmmakers and politicians, he conducted interviews with Woody Allen, Hillary Clinton, Madeleine Allbright, Harrisson Ford, Angelina Jolie, Brad Pitt, Hugh Grant, Catherine Zeta-Jones and hundreds more. For many years he was accredited as an official Polish journalist representative in Hollywood and by the Cannes Film Festival. He was a music consultant of the Polish edition of the autobiography of the Oscar winner Burt Bacharach. He writes books for children and adults. Theatre plays for children were based on his books Zaczarowana Wigilia (Magic Christmas Eve) and Podróże z fantazją. Bajka muzyczna (Traveling with Fantasy. Musical fairy tale). Columnist for Read & Fly Magazine and in English for The First News. After completing his musical career, he collaborates with the ROMA Musical Theater as a writer and a specialist of the history of this cultural institution. He runs the travel program Baby on Board on the Polish National Radio. As a TV personality he takes part in public debates in mainstream media. His book Gambia. The Smiling Coast, published by National Geographic, was awarded the main Magellan Award for the best illustrated guide. From 2018 he is the host of the yearly gala concert of the Great Orchestra of Christmas Charity in Liverpool.  In 2021 he received another Magellan Award for The Faroe Islands First-Hand Guide. A Practical Travel Guide. Since 2024, he has been working as a correspondent from Great Britain for TVP Polonia – channel of Telewizja Polska, a public service broadcaster in Poland, the oldest and largest Polish television network.\nPersonal life\nHe is the son of Maciej Pinkwart, a writer and historian from Zakopane and brother of the journalist and TV correspondent Joanna Pinkwart. In 2015 he left Poland and moved to Liverpool, United Kingdom. Lives in Bootle. He is active in the Merseyside County Polish charity organisations and associations, and Polish émigré press. Married to journalist and travel writer Magdalena Pinkwart, father of four children: Wiktor, Liwia, Wilhelm and Lara.\nWorks\n* Bajki Tatrzańskie, PTTK Kraj Publishing, 1987\n* Nagrania Stefana Kamasy w Archiwum Polskiego Radia, Chopin University of Music, 1997\n* Cień Kilimandżaro, Albatros Publishing, 2010\n* Les Miserables. Narodziny sztuki, Wydawnictwo Teatru Muzycznego ROMA, 2011\n* Podróże z fantazją. Bajka muzyczna, Akapit-Press Publishing, 2011\n* Zaczarowana Wigilia, Akapit-Press Publishing, 2011\n* Tata reporter, Wydawnictwo Akapit-Press Publishing, 2011\n* Klub Racjonalistek, Albatros Publishing, 2013\n* Tutaj drzwi trzeba otwierać powoli, Stowarzyszenie Szkoła Liderów Publishing, 2013\n* Gambia. Kraina uśmiechu, National Geographic Publishing, 2014\n* Drakulcio ma kłopoty. Urodzinowa katastrofa, Akapit-Press Publishing, 2015\n* Drakulcio ma kłopoty. Mecz stulecia, Akapit-Press Publishing, 2015\n* Kulinarne podróże po Chorwacji, National Geographic Publishing, 2015 (co-author with Anna Olej-Kobus, Krzysztof Kobus, Magdalena Pinkwart)\n* Drakulcio ma kłopoty. Klątwa faraona, Akapit-Press Publishing, 2016\n* Gdańsk. Przewodnik Turystyczny, Urząd Miejski w Gdańsku, Gdańska Organizacja Turystyczna, 2017\n* Drakulcio ma kłopoty. Mistrz jazdy na krechę, Akapit-Press Publishing, 2017\n* Drakulcio ma kłopoty. Włoska awantura, Akapit-Press Publishing, 2017\n* Straszliwa historia w obrazkach, Akapit-Press Publishing, 2017\n* Maria Czubaszek. Ostatni dymek, Czerwone i Czarne Publishing, 2017\n* Pati i Jędrek mali strażnicy Tatr. Na górskim szlaku, Tatrzański Park Narodowy Publishing, 2017\n* Mikołaj i dziewczyna z gwiazd, Akapit-Press Publishing, 2017\n* Drakulcio ma kłopoty. Jak zjeść francuską żabę, Akapit-Press Publishing, 2018\n* Warto marzyć, Wydawnictwo Teatru Muzycznego ROMA, 2019\n* Wyspy Owcze z pierwszej ręki. Praktyczny przewodnik turystyczny, Lara Books Publishing, 2020\nFilmography\n* Romeo i Julia, 2004\n* Supermarket, 2012\n* Big Love, 2012\nAwards\n* 2014 Magellan Award for the Best Illustrated Guide for the book The Gambia. The Smiling Coast, National Geographic Publishing House\n* 2019 Award of the Association of The Polish Journalists Travellers Globtroter for the Best Travel Publications of the Year\n* 2021 Magellan Award for the Best Illustrated Guide for the book Faroe Islands at First Hand, Lara Books Publishing House\nExternal links\n*\n* [http://www.filmpolski.pl/fp/index.php?osoba=1175836 Sergiusz Pinkwart] on Filmpolski.pl (pol.)\n* [https://kurier365.pl/kultura/15068-trzy-pytania-do-sergiusza-pinkwarta.html Interview with Sergiusz Pinkwart] Kurier365.pl, 13 October 2013\n* [https://www.thefirstnews.com/category/why-so-serious Sergiusz Pinkwart's columns] The First News, 2019–2020\n* [https://dzieckowdrodze.com Travel blog by Sergiusz Pinkwart] Keep Calm and Travel, 2013–2020\n* [https://www.polskieradio.pl/18/4629 Travel broadcast by Sergiusz Pinkwart] Polish National Radio, 2015–2020\n* [https://magazynvip.pl/sergiusz-pinkwart-wyspy-owcze-to-lakomy-kasek-dla-obiezyswiatow/ Interview with Sergiusz Pinkwart. The Faroe Islands are a tasty morsel for globetrotters] VIP Magazyn, 24 May 2020\nReferences"
    }
  ]
}