{
  "content": [
    {
      "type": "text",
      "text": "# Service discovery__disambig_1\n\n}}\nService discovery is the process of automatically detecting devices and services on a computer network. It aims to reduce the manual configuration effort required from users and administrators. A service discovery protocol (SDP) is a network protocol that helps accomplish service discovery.\nService discovery requires a common language to allow software agents to make use of one another's services without the need for continuous user intervention.\nProtocols\nThere are many service discovery protocols, including:\n* Bluetooth Service Discovery Protocol (SDP)\n* Bonjour, e.g., Apple AirPrint\n* DNS Service Discovery (DNS-SD), a component of zero-configuration networking\n* DNS, as used for example in Kubernetes\n* Dynamic Host Configuration Protocol (DHCP); its classification as a service discovery protocol is controversial\n* Internet Storage Name Service (iSNS)\n* Jini for Java objects.\n* Lightweight Service Discovery (LSD), for mobile ad hoc networks\n* Link Layer Discovery Protocol (LLDP) standards-based neighbor discovery protocol similar to vendor-specific protocols which find each other by advertising to vendor-specific broadcast addresses (versus all-1's), such Cabletron (Enterasys) and Cisco Discovery Protocol (both referred to as CDP but different formats).\n* Local Peer Discovery, or Local Service Discovery\n* Multicast Source Discovery Protocol (MSDP), usually used for unicast exchange of multicast source information between anycast Rendez-Vous Points (RPs) to service mcast clients.\n* Service Advertising Protocol used in Novell NetWare networks with IPX\n* Service Location Protocol (SLP)\n* Session Announcement Protocol (SAP) used to discover RTP sessions\n* Simple Service Discovery Protocol (SSDP), a component of Universal Plug and Play (UPnP)\n* Universal Description Discovery and Integration (UDDI) for web services\n* [https://docs.google.com/document/d/e/2PACX-1vQb5HnWikiVb11xlP0DXFnweMltdBdAwrwJbaRNuNVojECiolOEGAO7SesCfURLjXM1DHnylT4n5AUm/pub Universal Service Discovery Protocol] (USDP)\n* Web Proxy Autodiscovery Protocol (WPAD)\n* WS-Discovery (Web Services Dynamic Discovery)\n* XMPP Service Discovery ([http://xmpp.org/extensions/xep-0030.html XEP-0030])\n* XRDS (eXtensible Resource Descriptor Sequence) used by XRI, OpenID, OAuth, etc.\nSee also\n* Discoverability\n* Semantic web\nReferences\nExternal links\n* [http://www.s-cube-network.eu/km/terms/s/service-discovery Service Discovery] S-Cube Knowledge Model\n* Dong, H., Hussain, F.K., Chang, E.: [https://www.researchgate.net/publication/260329617_Semantic_Web_Service_matchmakers_State_of_the_art_and_challenges Semantic Web Service matchmakers: State of the art and challenges][Online]. Concurrency and Computation: Practice and Experience 25(7) (May 2013) pp. 961–988. Accessed on June 16, 2015.\n* Sun, L., Dong, H., Hussain, F.K., Hussain, O.K., Chang, E.: [https://www.researchgate.net/publication/265169908_Cloud_service_selection_State-of-the-art_and_future_research_directions Cloud service selection: State-of-the-art and future research directions. Journal of Network and Computer Applications][Online] 45 (October 2014) pp. 134–150. Date accessed: 16 June 2015."
    }
  ]
}