{
  "content": [
    {
      "type": "text",
      "text": "# Serverware Group\n\nright\nServerware Group plc was a software company formed in November 1983 following a management buyout of Information Systems Group plc.\nEarly history\nThe company was formed by Peter Seldon (father of journalist Myma Seldon) and Selim Kohen to develop systems management software.  Initially the software focus was on Unix and Pick software, but in the mid-1990s the company moved into Windows NT software development.  While the core business was software development, the company also resold products developed by other manufacturers (such as Diskeeper, FAXmaker, Octopus, Quota Manager and Remotely Possible) to help with the funding of their own software.\nSeNTry\nThe first NT product to be developed by the company was SeNTry.  This allowed administrators to monitor the Event Logs of multiple Windows NT computers from a central location.  The list of product features grew as development continued until, in June 1998 the intellectual property rights were bought by Mission Critical Software, Inc., who renamed the product Enterprise Event Manager.  They later merged with NetIQ,. No code from SeNTry was part of the Mission Critical-developed product Operations Manager which was later licensed to Microsoft.\nEnterprise Configuration Manager\nFollowing the successful sale of SeNTry, Serverware began development of a new management tool.  Originally named eNTts (or enhanced NT tool set) the product allowed administrators to manage and control Windows NT services, DLLs and user passwords on remote Windows NT computers.  Later versions increased the feature count by adding registry monitoring, Emergency Repair Disk creation and more.\nIn 1999 the rights to the product (by this time named Enterprise Configuration Manager or ECM) was sold to a company named Configuresoft, Inc., which was founded for this purpose.  Serverware took a stake in the new start-up as part of the deal.\nServerware after Selim Kohen\nIn 2000 Technical Director Selim Kohen died, aged 50.  As he had been the driving force behind the development of new products the company scaled back their development work, and continued operating primarily as a reseller, and the UK distributor for ECM and Aftama IETP technology.\nIn 2008 Serverware group formed a subsidiary of the main company that specialised in the needs of Government in the UK and Europe they appointed a new CEO to run this operation and develop the core offerings of Serverware Group going forward.\nThe company was dissolved on 27 April 2017.\nReferences\nExternal links\n* [http://www.serverware.com Company website]"
    }
  ]
}