{
  "content": [
    {
      "type": "text",
      "text": "# Seth A. Howard\n\n| birth_place        = Cheverly, Maryland, U.S.\n| party              = Republican\n| spouse             =\n| children           = 1\n| education          =\n| branch             = United States Marine Corps\n| serviceyears       = 1994–1998\n| commands           =\n}}\nSeth Adam Howard (born March 17, 1974) is an American politician who has served as a member of the Maryland House of Delegates from District 30B since 2015.\nEarly life and career\nHoward was born in Cheverly, Maryland on March 17, 1974. He graduated Glenelg High School, and afterwards served in the United States Marine Corps from 1994 to 1998, and in the Maryland Army National Guard from 1999 to 2003. Since 2004, Howard has owned the Broadleaf Tobacco and Smoke Shop in Severna Park, Maryland.\nHoward ran for the Maryland House of Delegates in 2014, seeking to succeed delegate Robert A. Costa, who announced his intent to retire after redistricting moved him to District 33B. During the primary, the NRA Political Victory Fund endorsed his campaign with an 'AQ' rating. He defeated Anne Arundel County police lieutenant Jim Fredericks in the primary election, receiving 52 percent of the vote, and later defeated Democratic challenger Mitchelle Stephenson in the general election with 63.3 percent of the vote.\nIn the legislature\n, 2015]]\nHoward was sworn into the House of Delegates on January 14, 2015, and has served as a member of the Economic Matters Committee during his entire tenure. In January 2020, the American Conservative Union gave Howard a score of 63 percent, making him the lowest-scoring Republican in the Maryland House of Delegates.\nHoward has served as the Deputy Minority Whip for the Maryland House Republican Caucus since 2021, filling a vacancy left by the election of Delegate Christopher T. Adams to serve as the House Minority Whip. In February 2021, Howard was appointed as the chairman of the Maryland House Republican Caucus' Business and Economic Committee.\nIn 2020, Howard was an alternate delegate for the Republican Party National Convention.\nPolitical positions\nBusiness\nIn February 2017, Howard voted against a bill providing workers with up to seven days of paid sick leave a year, criticizing it as a burden for small businesses. During the 2018 legislative session, he introduced a bill that would require internet service providers to notify customers when their personal information is stolen in data breaches.\nGun policy\nDuring the 2016 legislative session, Howard introduced legislation to reduce the county's archery safety zone to 50 yards.\nIn March 2018, during debate on a bill to ban bump stocks following the 2017 Las Vegas shooting, Howard introduced an amendment that would grandfather in already purchased bump stocks.\nMinimum wage\nDuring the 2016 legislative session, Howard voted against a bill banning wage discrimination on the basis of gender identity, pointing to existing federal protections against sex-based wage discrimination, including the Equal Pay Act of 1963 and the Lilly Ledbetter Fair Pay Act of 2009.\nSocial issues\nIn April 2018, after Meagan Simonaire delivered a speech on the House floor to support a bill banning conversion therapy for LGBT teens, Howard was one of four Anne Arundel County delegates to abstain from voting on the bill.\nTaxes\nDuring the 2021 legislative session, Howard voted against a bill that would allow the Anne Arundel County Council to pass a real estate transfer tax.\nPersonal life\nHoward is married and has a child.\n}}\n}}\n}}\n}}\nReferences"
    }
  ]
}