{
  "content": [
    {
      "type": "text",
      "text": "# Seth King\n\n| birth_place = Penistone, England\n| death_date  =\n| death_place = Leigh, England\n| height      =\n| position = Defender\n| youthyears1 =\n| youthclubs1 = Penistone Church\n| years1 = 1919–1920\n| clubs1 = Huddersfield Town\n| caps1  = 0\n| goals1 = 0\n| years2 = 1920\n| clubs2 = Penistone Church F.C.\n| years3 = 1920–1929\n| clubs3 = Sheffield United\n| caps3  = 107\n| goals3 = 0\n| years4 = 1929–1932\n| clubs4 = Oldham Athletic\n| caps4  = 91\n| goals4 = 0\n| years5 = 1932–1934\n| clubs5 = Denaby United\n|medaltemplates =\n}}\nSeth King (14 February 1897 – 8 February 1958) was an English footballer who played as a defender in The Football League. Born in Penistone, West Riding of Yorkshire, England, he began his career as an amateur playing for his local church team. After a spell in Huddersfield Town's reserves, he signed as a professional for Sheffield United, for whom he played over 100 times and won an FA Cup winners medal in 1925. He later had spells at Oldham Athletic and Denaby United before retiring.\nCareer\nKing had been spotted by Huddersfield Town in 1919, playing as an amateur for his local church side. He spent a season in Town's reserves but was not offered a long-term contract and returned to his local club.  He was again spotted by a league side, and this time Sheffield United agreed to sign him for £10 in November 1920.\nKing made a slow start to his United career, spending two seasons in the reserves and not making his first team debut until 1922, after which he played intermittently for the following two seasons as cover when first team regulars were injured.  It was not until established centre back Jimmy Waugh suffered a serious injury in December 1924 that King was given the opportunity to make regular starts. King became a mainstay of the defence for the next three years and played for United at Wembley when they won the 1925 FA Cup Final.\nLike many other defenders King found the changes to the offside law for the 1925–26 season difficult to adapt to, but retained his place until 1927 when the club signed Vince Matthews.  King was sold to Oldham Athletic for £400 in May 1929 where he made 91 league appearances before his contract was cancelled in February 1932 following an injury.  Although intending to retire, King later spent some time playing as an amateur for Denaby United.\nPersonal life\nAfter leaving Oldham Athletic, King took over the tenancy of the Castle Inn in Hillsborough in Sheffield.  At the time of his death he was running a newsagents in Leigh in Greater Manchester.\nHonours\nClub\n;Sheffield United\n*FA Cup: Winner – 1925\nReferences"
    }
  ]
}