{
  "content": [
    {
      "type": "text",
      "text": "# Seto ware__disambig_1\n\n. Tokyo National Museum]]\nwith wood-ash and iron glazes, Edo period, early 19th century]]\nis a type of Japanese pottery, stoneware, and ceramics produced in and around the city of Seto in Aichi Prefecture, Japan. The Japanese term for it, setomono, is also used as a generic term for all pottery. Seto was the location of one of the Six Ancient Kilns of Japan.\nHistory\nPottery made in Seto dates back to the 13th century. Katō Shirōzaemon is credited as the first to produce wares in the town. In the 1220s he studied the art of pottery in China. After several failed attempts in various locations, Shirōzaemon founded a successful kiln at Seto. Other potters followed thereafter and Seto became a renowned center for ceramic production.\nPotters drew inspiration from Chinese ceramics, including green celadon porcelains and dark brown tenmoku wares. The earliest Seto ceramics may have evolved from failed attempts to reproduce Chinese celadons. During the Kamakura period, wares produced in Seto imitated the pottery of the Song dynasty in China. Later, in the Muromachi period (1337–1573), Seto glazes were refined and the styles developed there spread to other areas in Japan such as modern Gifu Prefecture.\nLater Seto works were given a brown iron glaze and fired at high temperatures to create glossy surfaces.\nDuring the Kan'ei era (1624–44), the first daimyō of Owari Domain Tokugawa Yoshinao (1601–1650) had a kiln constructed at the corner of the Ofuke enceinte (Ofukemaru) of Nagoya Castle and invited potters from Seto to make pottery there.\nThe Aichi Prefectural Ceramic Museum in Seto has a large and exemplary collection of Seto ware.\nCharacteristics\n.]]\nThe most distinctive feature of Seto ware is its use of a wide variety of glazes, and during the Kamakura period, Seto was the location in Japan that made use of glazes. This glazed pottery, or  impacted the development of bowls used for the Japanese tea ceremony. The clay available in Seto is a high-quality kaolin and porcelain stone which turns white when fired and helps produce colored glazes.\nThe different types and glazes of Seto ware are:\n* Kiseto (黄瀬戸), a yellow glaze\n* Setoguro (瀬戸黒), a black glaze\n* Shino ware (志野)\n* Oribe ware (織部)\n* Tetsuaka (鉄赤), an iron red glaze\n* Haigusuri (灰釉), ash glaze\nSee also\n* Tokoname ware\nReferences\nFurther reading\n* Shosaku Furukawa. Kiseto and Setoguro. Famous Ceramics of Japan. Kodansha Amer. 1983.\nExternal links\n*[http://libmma.contentdm.oclc.org/cdm/compoundobject/collection/p15324coll10/id/84980/rec/1 Momoyama, Japanese Art in the Age of Grandeur], an exhibition catalog from The Metropolitan Museum of Art (fully available online as PDF), which contains material on Seto ware\n* [http://www.setoyakishinkokyokai.jp/ Homepage of the Seto ware Sinkokyokai]"
    }
  ]
}