{
  "content": [
    {
      "type": "text",
      "text": "# Seventh Avenue, Newark\n\nSeventh Avenue,  formerly known as the First Ward, is a neighborhood in the city of Newark in Essex County, in the U.S. state of New Jersey. Settled by Italian immigrants beginning in 1870, the First Ward was once known as Newark's Little Italy.\nIn its heyday, Seventh Avenue had a population of 30,000, including 11,000 children, in an area of less than a square mile. The center of life in the neighborhood was St. Lucy's Church, founded by Italian immigrants in 1891. Throughout the year, St. Lucy's and other churches sponsored processions in honor of saints that became community events. The most famous procession is the Feast of St. Gerard.\nJoe DiMaggio loved the restaurants of Seventh Avenue so much that he would take the New York Yankees to Newark to show them \"real Italian food.\" Frank Sinatra had bread from Giordano's Bakery sent to him every week until his death, no matter where in the world he was.\n]]\nOne of the nation's largest Italian newspapers, The Italian Tribune, was founded on Seventh Avenue. Frankie Valli of the Four Seasons and Congressman Peter Rodino, Chairman of the House Judiciary Committee during its impeachment proceedings against Richard Nixon, were natives of the First Ward.\nBeginning in 1953, the working class and poor Italian-American Seventh Avenue neighborhood was subjected to urban renewal efforts. Eighth Avenue was removed, scattering its Italian-American residents to make way for the construction of the Christopher Columbus Homes housing project and Interstate 280. The area experienced one of the highest crime rates in the city during the 1970s and suffered major destruction from arson fires. The neighborhood was largely rebuilt by the erection of townhouses, although the Italian community and most of its businesses never recovered. The last of the Christopher Columbus Homes was demolished in 1996.\nSee also\n*Pavilion and Colonnade Apartments\nReferences"
    }
  ]
}