{
  "content": [
    {
      "type": "text",
      "text": "# Seward Statesmen\n\nThe Seward Statesmen were a minor league baseball team based in Seward, Nebraska. From 1910 to 1913, the Statesmen teams played exclusively as members of the Class D level Nebraska State League, hosting home games at Fairgrounds Park. During their final 1913 season, the franchise was relocated to Beatrice, Nebraska after a tornado struck the city of Seward.\nHistory\nIn 1910, minor league baseball began in Seward, Nebraska. The Seward \"Statesmen\" became charter members of the eight–team Class D level Nebraska State League. The Columbus Discoverers, Fremont Pathfinders, Grand Island Collegians, Hastings Brickmakers, Kearney Kapitalists, Red Cloud and Superior Brickmakers joined Seward in beginning league play on May 14, 1910. The 1910 Nebraska State League set a salary limit of $900.00, with a roster limit of 12 players.\nSunday laws were in place in the region in the era. A meeting at the Congregational Church in Columbus, Nebraska reportedly occurred on April 29, 1910, to discuss the issue. With about 50 men attending the meeting, it was reported that about 15 were against Sunday baseball and the rest were in favor of playing Sunday baseball. The local newspaper referred to the Seward team as the \"White Sox.\"\nIn their first season of minor league play, the 1910 Seward Statesmen placed sixth in the final eight–team Nebraska State League standings. The Statesmen ended the season with a record of 50–62, playing under manager John Fink. The Statesmen finished the season 16.0 games behind the first place Fremont Pathfinders in the final standings of the league.\nReportedly, Seward drew 600 on their home opening day, May 14, 1910. Seward defeated the Red Cloud team by a score of 7 to 6.\nIn July, 1910, due to Sunday laws, Justice Gladwish reportedly had the Red Cloud and Seward teams arrested for playing a baseball game on Sunday. Red Cloud and Seward played the Sunday game in Staplehurst, Nebraska a city which did not enforce the Sunday baseball laws. However, the Judge decided to prosecute the case against the teams.\nThe Seward Statesmen continued play in the 1911 Class D level Nebraska State League. The Seward Statesmen ended the 1911 season with a record of 53–57 to place fourth in the standings, playing under returning manager John Fink. Seward finished 17.0 games behind the first place Superior Brickmakers in the final standings of the eight–team league.\nThe 1912 Seward Statesmen placed fifth in the eight–team Nebraska State League standings. With a record of 53–59, playing under manager Bill Zink, the Statesmen finished 15.5 games behind the first place Hastings Brickmakers. Player/manager Bill Zink led the Nebraska State League with 139 total hits.\nThe Seward Statesmen played their final season in 1913. The franchise reportedly relocated during the season after a tornado struck Seward, Nebraska on May 14, 1913, affecting attendance during the subsequent reconstruction. Reportedly 10 were killed and over 30 injured in the tornado, which struck a residential area in western Seward. On July 21, 1913, the Seward franchise moved to Beatrice, Nebraska with a 27–37 record, finishing the season as the Beatrice Milkskimmers. The Beatrice franchise became open with the demise of the Missouri-Iowa-Nebraska-Kansas League, of which the Milkskimmers had been a member. The 1913 team compiled a 25–23 record while based in Beatrice to finish with an overall record of 52–60, placing seventh in the eight–team Nebraska State League. Playing under returning under manager Bill Zink, the Seward/Beatrice team finished 15.0 games behind the first place Kearney Kapitalists in the final Nebraska State League standings. Reportedly, the York Prohibitionists played several 1913 games in Seward after the Statesmen relocated.\nSeward, Nebraska has not hosted another minor league team.\nThe ballpark\nThe Seward Statesmen were reported to have played minor league home games at Fairgrounds Park. The Fairgrounds Park ballpark was noted to have been located within the fairgrounds, located at Bradford Street & North 14th Street, Seward, Nebraska. Today, the Seward County Fairgrounds are still in use, having hosted over 150 county fairs.\nTimeline\n{| class=\"wikitable\" style=\"text-align:center; font-size: 95%;\"\n! Year(s) !! # Yrs.  !! Team !! Level !! League!!Ballpark\n|-\n|1910–1913|| 4 || Seward Statesmen||Class D|| Nebraska State League||Fairgrounds Park\n|-\n|}\nYear–by–year records\n{| class=\"wikitable\"\n|- style=\"background: #F2F2F2;\"\n! Year !! Record !! Finish !! Manager !! Playoffs/notes\n|- align=center\n| 1910 || 50–62 || 6th || John Fink || No playoffs held\n|- align=center\n| 1911 || 53–57 || 4th || John Fink || No playoffs held\n|- align=center\n| 1912 || 53–59 || 5th || Bill Zink || No playoffs held\n|- align=center\n| 1913 || 52–60 || 7th || Bill Zink || Team (27–37) moved to Beatrice July 21\n|- align=center\n|}\nNotable alumni\n*Jim Stanley (1911)\nSee also\n*Seward Statesmen players\nReferences\nExternal links\n*[https://www.baseball-reference.com/register/team.cgi?city=Seward&state=NE&country=US Seward - Baseball Reference]\n*[http://www.gendisasters.com/nebraska/7431/seward-ne-tornado-may-1913 1913 Tornado Photos]"
    }
  ]
}