{
  "content": [
    {
      "type": "text",
      "text": "# Seward, Minneapolis\n\n|population_as_of       = 2020\n|population_total       = 7,516\n|population_density_sq_mi = auto\n|population_footnotes=\n|timezone= CST\n|utc_offset= -6\n|timezone_DST= CDT\n|utc_offset_DST= -5\n|coordinates            =\n|elevation_m=\n|elevation_ft=\n|postal_code_type       = ZIP code\n|postal_code            = 55404, 55406\n|area_code              = 612\n|website                =\n|demographics           =\n}}\nSeward is a neighborhood in the Longfellow community of Minneapolis, Minnesota, located geographically southeast of downtown. It consists of the land bordered by the Hiawatha Avenue industrial district to the west, Minneapolis Midtown Greenway (between E. 27th St. and E. 28th St.) to the south, the Mississippi River to the east, and Interstate 94 to the north.\nSeward's bordering neighborhoods are Cooper to the southeast, Longfellow to the south, East Phillips to the southwest, Ventura Village to the west, Cedar-Riverside to the north, and Prospect Park/East River Road across the Mississippi River to the east. Seward was named after former New York senator, governor, and US Secretary of State William H. Seward.\nThe neighborhood includes a number of local businesses along Franklin Avenue including two cooperatives, [http://seward.coop/ Seward Co-op] (a grocery store) and Seward Community Cafe. The neighborhood is also home to the Milwaukee Avenue Historic District, [http://www.northernclaycenter.org/index.php Northern Clay Center], [http://www.articulture.org/ ArtiCulture] and The Playwrights' Center.\nCivic information\nSeward is split between City Council Wards 2 and 6, represented by Robin Wonsley and Jamal Osman respectively. Politically, Seward is progressive-left, with the Democratic-Farmer-Labor Party and Green Party having political dominance. The [http://sng.org/ Seward Neighborhood Group] is the area's neighborhood organization.\nSchools\nSeward Montessori School, a public magnet school using the Montessori method to teach pre-K to grade 5, is located in Seward. Attached to the school is Matthews Park and Recreation Center. Anne Sullivan Communication Center (emphasizing programs for the deaf and visually impaired)  is located just across the Midtown Greenway in the Longfellow neighborhood.  Students from Seward Neighborhood can walk to both these schools. The neighborhood resides in the official service area for Dowling Elementary School, Andersen United Middle School, and South High School.\nPopulation\nThe population of Seward in the 2010 U.S. census was 7,308. Median household income in 1999 was $30,209 and it was $71,004 in 2022. Approximately 18 percent of the population lived below poverty level in 1999, including 13 percent of families. The median house value in 2000 was $112,000.\nSee also\n*Neighborhoods of Minneapolis\nReferences\nExternal links\n*[http://sng.org/ Seward Neighborhood Group]\n*[http://e-democracy.org/seward Seward Neighbors Forum]"
    }
  ]
}