{
  "content": [
    {
      "type": "text",
      "text": "# Sex Wars (game show)\n\n}}\nSex Wars is an American television game show that pits two teams, one consisting of men and one consisting of women, against each other; hence, the show's name was derived from that.\nSex Wars premiered on October 2, 2000, and aired its final episode on February 27, 2001. The show was co-hosted by Jennifer Cole and J.D. Roth.\nThe show was produced by Lighthearted Entertainment and distributed by MGM Television and was recorded at CBS Television City in Studio 46.\nPremise\nRoth and Cole, in their role as co-hosts, asked questions to their respective gender teams. The men's team was blue, the women's team was pink, and both teams consisted of three members.  The audience was also divided appropriately; one side entirely had women sitting on it, while the other side had men.\nLandmine\nThe first round consisted of questions with four possible answers, three of which were correct. The wrong answer was called the \"Land Mine\". For each correct answer a team uncovered, they received five points. If they managed to come up with all three correct answers, a bonus five points was awarded for a total of 20 for that question. If the Land Mine was picked by any team, their turn ended and five points for each remaining correct answer was given to the opponents. Two questions per side were played.\nThe List\nThe second round was referred to as \"The List\". The show's website conducted a series of surveys for both men and women, with up to ten answers displayed. The two teams alternated back and forth declaring how many answers of the ten they could give. This continued until one team challenged the other or until one of them bid the maximum number of answers.\nOne at a time, the team members would give an answer. Giving a correct answer was worth ten points and moved play to the next player in line. Giving an incorrect answer or running out of time locked that player out of the rest of the survey. If all three players were locked out, the opposing team could steal the points with giving one of the remaining answers. If the opponents did not, the points went to the team in control. Two categories, with one list each, were played. On some episodes, if there was extra time, one more list would be played with fewer answers.\nMen Or Women?\nThe third round was a toss-up question round called \"Men or Women?\". Each player was equipped with a buzzer that made strange noises when it was pressed.\nRoth and Cole would alternate asking questions based on scientific data regarding men and women, with the teams trying to determine who was more likely to do a certain thing. Buzzing in and answering correctly won the points for the team, but buzzing in and answering incorrectly awarded the points to the opponents. Questions were worth ten points up until the final question, which was worth twenty-five. On the earliest taped episode, all questions were worth 20 points.\nFinal Two Questions\nThe Final Round saw the teams each trying to answer one more question. The catch was that the men had to answer a question from a category chosen by the women while the women had to do the same thing from a category chosen by the men (there are three categories to choose from for each question).\nBoth teams were required to wager at least half of their scores on the final question. Answering it correctly added the amount of the wager, while answering it incorrectly deducted it. The team leading after the final question won the game. In the event of a tie, one Men or Women question was asked was played in a sudden-death situation; a correct answer won that team the game, while an incorrect answer would automatically give the other team the win by default. In the event of a 0-0 tie, the question would be worth 50 points.\nMembers of the winning team split a cash prize, with their total score multiplied by ten and converted into dollars. The top prize, however, was well below what most game shows were offering at that time (Sex Wars offered less than $5,000 cash) and many episodes saw a winning team walk away with less than $100.\nLink\n[https://web.archive.org/web/20001017185631/http://www.sexwars.com/ Official Website]\nReferences"
    }
  ]
}