{
  "content": [
    {
      "type": "text",
      "text": "# Sexual revolution in 1960s United States\n\nDuring the 1960s, the United States underwent a sexual revolution. The revolution was a social and cultural movement that resulted in liberalized attitudes toward sex and morality. Social norms were changing as sex became more widely discussed in society. Erotic media, such as films, magazines, and books, became more popular and gained widespread attention nationally. Sex was entering the public domain.\nThroughout history, the United States has undergone waves of feminism, in response to their needs and wants during the time. The introduction of the pill and second-wave feminism, allowed women to take control over their bodies and sexuality. Women using the pill could engage in sex with a lower risk of pregnancy.  The revolution allowed women to rediscover their traditional and sex roles ascribed to them.  Women's liberation movements sought to free women from social and moral confines.\nWhile women were rediscovering themselves, the gay rights movement was gaining the public eye. Public demonstrations and protests to challenge discrimination against sexuality occurred. While the movement did not begin to soar until the Stonewall riots of 1969, many still celebrate homosexuality during this time.\nChanges in social norms\nIn the United States, a dramatic shift in traditional ideas about sex and sexuality arose from numerous social changes. Films set during the 1880s contained sexual images and some pornographic content were filmed in the 1920s. In 1969, Blue Movie, directed by Andy Warhol, premiered. Blue Movie was the first erotic film to gain wide theatrical release. The film introduced \"porno chic\" and the Golden Age of Porn (1969–1984). Pornography became a publicly discussed topic that was taken seriously by critics.\nMagazines depicting erotic and nude content increased in circulation. Magazine company Playboy was founded in 1953, and was selling 1.1 million copies by 1960.  By 1970, it was circulating 5.4 million copies worldwide, and it peaked production in 1972 with 7.16 million copies and \"a quarter of all American male college students reportedly reading it in the 1970s.\"  The first Playboy Club opened in Chicago in 1960, and members were by Playboy Bunnies. Clubs were later opened in 23 other U.S. cities. The company was aimed at the male gaze. Writer and prominent feminist of the time, Gloria Steinem, went undercover at a Playboy Club in 1963 and found that women were often mistreated and exploited.\nIn the 1960s, bans on erotic novels were challenged. In Grove Press, Inc. v. Gerstein (1964), the Grove Press published Henry Miller's novel Tropic of Cancer, which was banned in the United States. The U.S. Supreme Court rejected the ban on the novel in a 5–4 vote. It was decided it had literary merit and was not \"utterly without redeeming social value.\"  In a similar case, Memoirs v. Massachusetts (1966), the Massachusetts Supreme Judicial Court decided that John Cleland's The Life and Adventures of Miss Fanny Hill was obscene. The U.S. Supreme Court overturned that ruling in a 6–3 vote and stated that this book was also not \"utterly without redeeming social value.\"  This ruling made banning books with sexual content more difficult because any books with literary merit or social importance could no longer be considered obscene in the United States.\nDuring the changing norms, several studied sex rates to identify trends. Several researched and presented different answers. Daniel Scott Smith discovered an increase in sex rates within certain groups between 1940 and 1967. As John Levi Martin explains, \"[Scott] concludes that members of the upper classes, whom the female-college-student surveys tend to study, change later than the rest of the population, and it is when they finally rejoin their lower-class counterparts in sexual mores and behavior that we suddenly believe a sexual revolution is upon us. This argument is supported by historical work that suggests that premarital sex – and not simply sex with a fiancé – was by no means uncommon among urban working-class women before the 1920s.\"\nIn addition, Phillips Cutright examined data about the age of first menses in the Western population and illegitimacy levels from 1940 to 1968. He discovered that no significant changes of revolutionary proportions occurred. The only \"substantial increases\" were among young whites with their future husbands. He determined that the age of the first menses in women decreased from 1940 to 1968 likely due to better nutrition, which suggests that earlier \"low illegitimacy rates among young girls were due to biological factors as well as to the social controls depressing sexual activity.\" He suggests that \"the myth of an abstinent past and promiscuous present is highly exaggerated.\"\nThe Pill\nBeginning in 1960, \"The Pill\" provided many women with an affordable way to decrease pregnancy. Prior to the introduction of the pill many women did not seek long-term jobs. During pregnancy, women would need to leave the job market, as they were seen as fragile and to care for their future offspring.  Abortion was illegal and presented many health risks if performed. With the introduction of the Pill, the percentage of graduating women increased. Women's school success allowed for greater professional career opportunities.\nWomen could safely control their sexuality and fertility with the new contraception. Previous methods of birth control included herbal remedies and early condoms, both were less protective and not legalized.  The pill \"was female-controlled, simple to use, highly effective, and most revolutionary of all, it separated reproduction and contraception from the sexual act.\" While critics claimed that the pill would lead to immorality, it allowed women to gain freedom in body's decision making.\nThe pill was originally endorsed by the government. Its intent was to control overpopulation.President Lyndon Johnson's social reform policy, The Great Society, aimed to eliminate poverty and racial injustice.  By 1960, the Food and Drug Administration had licensed the drug. 'The Pill', as it came to be known, was extraordinarily popular, and despite worries over possible side effects. By 1962, it was estimated that 1,187,000 women were utilizing the new form of birth control. In 1964, eight states declared the pill illegal to use, including Connecticut and New York.\nThe pill was easier to obtain for married women, especially after Griswold v. Connecticut (1965). The U.S. Supreme Court sided with Estelle Griswold, the executive director of the Planned Parenthood League of Connecticut, and stated that the right to privacy for married couples was granted in the U.S. Constitution.  While this ruling made it easier for married women to obtain birth control, unmarried women who requested gynecological exams and oral contraceptives were often denied or lectured on sexual morality. Those women who were denied access to the pill often had to visit several doctors before one would prescribe it to them.  In 1972, the Supreme Court extended these rights to unmarried couples in Eisenstadt v. Baird.\nCriticisms of the Pill\nCriticisms of the pill developed among certain groups, Black populations in particular. The origin of the pill as a form of population control for those living in poverty created distrust among groups that were systematically impoverished. Robert Chrisman argued that birth control could now be used as genocide with racist motives, saying \"contraception, abortion, sterilization are now major weapons in the arsenal of the U.S.' Agency for International Development.\"  Attendees at the Black Power Conference in Newark, New Jersey also argued against birth control and feared it was a tool to limit Black power.\nThese fears about the pill continued to develop through the decade, and even into the 1970s. The United States, especially the South, had a history of controlling Black fertility, first under slavery and later through sterilization. In Dick Gregory's cover story for the October 1971 edition of Ebony magazine, he wrote, \"back in the days of slavery, Black folks couldn't grow kids fast enough for white folks to harvest. Now that we've got a little taste of power, white folks want to call a moratorium on having children.\" Still, a number of Black women chose to take the pill because they desired control over their fertility.\nIn 1969, journalist Barbara Seaman published ''The Doctors' Case Against the Pill'', which outlined several side effects. She provided evidence for \"the risk of blood clots, heart attack, stroke, depression, weight gain, and loss of libido.\" Her book would lead to congressional hearings about the safety of the pill in the 1970s.\nThe Women's Movement\nSecond-wave feminism developed in the 1960s and 1970s, demanding equal opportunities and rights for women. The feminist and women's liberation movements helped change ideas about women and their sexuality. In The Feminine Mystique, Betty Friedan discussed the domestic role of women in 1960s America and the feeling of dissatisfaction with that role. Friedan suggested that women should not conform to this popularized view of the feminine as \"The Housewife\" and that they should participate in and enjoy the act of sex.\nAfter the publishing of the Feminine Mystique in 1963, Betty Friedan continued on to form the National Organization for Women (NOW) in 1966. Similarly to first-wave feminists, NOW focused their feminist efforts on legal and legislative change. They sought women's equality through lobbying and political activism, inspired by the work of groups like the National Association for the Advancement of Colored People (NAACP). Examples of this legislative change include NOW's lobbying of the Equal Employment Opportunity Commission for the recognition of sex discrimination in the workplace throughout the 1960s. Another, younger, and more radical group of women's liberationists formed in the 1960s simultaneously with NOW, inspired by grassroots civil rights and New Left movements of the 1960s.\nThe women's liberation movement also criticized the sexualization of women through beauty standards of sexuality in the 1960s. The New York Radical Women, a radical civil rights, New Left, and antiwar group, protested against the Miss America beauty pageant in Atlantic City, New Jersey. These women threw their bras, copies of Playboy, high heels, and other objects of beauty into a \"Freedom Trash Can.\"  Later feminists argued that sexual liberation allowed the patriarchy to hypersexualize women and gave men \"free access\" to women.\nFeminists extended this criticism of beauty standards in the 1960s through their appearances and outfits. They protested the traditionally feminine by cutting their hair short and refusing to wear women's clothing or makeup. Feminist activists took this approach to challenge the social construct of gender and the perceived differences between men and women. By wearing men's clothes and rejecting traditional femininity, activists drew mainstream attention and questioned the defining features of a woman into society. Many members of this more radical branch of the movement throughout the 1960s argued that feminine clothing and beauty standards were a method of oppression imposed by the patriarchy.\nLesbian feminist groups contributed to this questioning of the social definition of women through dress and theory. One of the most popular works by a lesbian feminist group was the Radicalesbian's 1970 manifesto \"The Woman Identified Woman\", in which they assert that the role of women is defined in relativity to men, rather than as an independent person. They argued that women's liberation would occur when women were able to separate from the patriarchal concept of femininity and thus be sexually and socially separate from men. Manifestos and essays like \"The Woman Identified Woman\" were commonly distributed among the women's liberation movement members. Oftentimes these writings were not traditionally published, but spread at conferences and meetings; they were written critiques of the patriarchy, femininity, and other issues central to the women's movement. An example of an essay distributed in this way is Pat Mainardi's \"The Politics of Housework\" from 1970, in which she writes satirically of her husband's negligence of the housework and criticizes the inherent division of domestic labor within the home.\nHowever, despite second-wave feminists sometimes being considered \"anti-sex,\" many women were interested in liberating women from certain sexual constraints. The women's liberation movement prioritized \"its cultural challenge not to unjust laws but to the very definitions of female and male, the entire system then called 'sex roles' by sociologists.\"\nGay Rights and the \"Undocumented\" Sexual Revolution\nHomosexuality was still considered a developmental maladjustment by medical establishments throughout the 1950s and 1960s. Prejudices against homosexual behavior were cloaked in the language of medical authority, and homosexuals were unable to argue for the same legal and social rights.\nHomosexuals were sometimes characterized as dangerous and predatory deviants. For example, the Florida Legislative Investigation Committee, between 1956 and 1965, sought out these 'deviants' within the public system, with a particular focus on teachers. The persecution of gay teachers was driven by the popular belief that homosexuals could prey on vulnerable young people and recruit them into homosexuality. In addition, male homosexuals were often seen as inherently more dangerous (particularly to children) than lesbians, due to stereotypes and societal prejudices.\nIn addition, most states had sodomy laws, which made anal sex a crime. It was punishable by up to 10 years in prison.  There were also restrictions on the portrayal of homosexuality in film and television, like the 1934 Hays Film Code, which banned any homosexual characters or acts in film until 1961. However, by 1971, the first gay pornographic feature film, Boys in the Sand, was shown at the 55th Street Playhouse in New York City. With this movie, the gay community was launched into the sexual revolution and the porn industry.  Earlier homoerotic films existed, especially in Europe, as early as 1908. These films were underground and sold in discreet channels.\nThe gay rights movement was less popular in the 1960s than later decades, but it still engaged in public protest and an attitude \"celebratory about the homosexual lifestyle.\" The Mattachine Society in Washington, D.C. and New York staged demonstrations that protested discrimination against homosexuals. These groups argued \"that the closing of gay bars was a denial of the right to free assembly and that the criminalization of homosexuality was a denial of the 'right to the pursuit of happiness.'\" In 1969, the United States had fifty gay and lesbian organizations that engaged in public protest.\nThese gay rights groups also challenged traditional gender roles, similar to feminist movements of the time. The Mattachine leaders emphasized that homosexual oppression required strict definitions of gender behavior. Social roles equated \"male, masculine, man only with husband and father\" and equated \"female, feminine, women only with wife and mother.\" These activists saw homosexual women and men as victims of a \"language and culture that did not admit the existence of a homosexual minority.\" The homophile movement and gay rights activists fought for an expansion of rights based on similar theories that drove some heterosexual women to reject traditional sexual norms.\nLesbian rights movements in the 1960s tended to be combined with the greater Women's Liberation Movement, though they still faced ostracization and oppression from some feminist groups. Notably, in 1969, NOW leader Betty Friedan claimed that the lesbians within the women's liberation movement were a \"lavender menace\" that would halt the validity of the women's movement.  Despite this ostracization, lesbian communities began to grow in the 1960s similarly to those of gay men. One way awareness of the community was able to spread was because of the rise of butch-femme fashion and outward expression of lesbianism after the Second World War. Lesbian and queer groups were targeted for gender ambiguity and dress through three-article clothing laws, which required persons to be wearing at least three pieces of clothing that correlated to their gender assigned at birth. Many butch lesbians were able to adhere to these laws by wearing women's underwear and socks, or \"men's cut\" shirts and slimmer skirts instead of slacks. The rise of butch-femme dress allowed for visibility to the lesbian communities, and many women were able to find queer spaces simply by following butch women. Another way lesbian community was able to spread was through the popularization of lesbian pulp novels throughout the 1950s and 1960s. Though pulp novels were often formulaic, troupe-filled, and intended more for a male voyeuristic audience than queer women, they allowed women to find representation and queer identity in media, which had been heavily restricted until the 1960s.\nThe Stonewall Riots, 1969\nIn the early morning of June 28, 1969, police raided the Stonewall Inn, the most popular gay bar in New York City, located in the city's Greenwich Village neighborhood. The police asked for identification from patrons of the bar; asked to verify the sex of cross-dressers, drag queens and trans people; and assaulted lesbian women when frisking them. As they took people out of the club, a scuffle began between a woman and police officers, and it quickly dissolved into a riot. Protests continued into the next day. The Stonewall riots are considered a defining moment in the gay rights movement and have become a \"'year zero' in public consciousness and historical memory.\"\nThe Stonewall riots of 1969 marked an increase in public awareness of gay rights campaigns, and it increased the willingness of homosexuals across America to join groups and campaign for rights. However, it would be misleading to conclude that resistance to homosexual oppression began or ended with Stonewall. David Allyn argues that numerous acts of small-scale resistance are necessary for large political movements, and the years preceding Stonewall played a role in creating the gay liberation movement.\nThe Stonewall riots are a pivotal moment in gay rights history because they enabled many members of the gay community to identify with the struggle for gay rights.  Gay life after Stonewall was just as varied and complex as it was before. Still, the development of the Gay Liberation Front in 1969 sought \"to create new 'social form and relations' that would be based on 'brotherhood, cooperation, human love, and uninhibited sexuality.\"\nSee also\n* Birth control movement in the United States\n* Blue Movie\n* 55th Street Playhouse\n* Helen Singer Kaplan\n* Masters and Johnson\n* Make Love, Not War: The Sexual Revolution: An Unfettered History, 2001 book\n* New Andy Warhol Garrick Theatre\n* Reproductive rights\n* Sex in the American Civil War\n* Timeline of reproductive rights legislation\nReferences"
    }
  ]
}