{
  "content": [
    {
      "type": "text",
      "text": "# SFRA Pioneer Award\n\nThe Pioneer Award is given by the Science Fiction Research Association to the writer or writers of the best critical essay-length work of the year. In 2019 it was renamed the SFRA Innovative Research Award.\nWinners:\n*1990: Veronica Hollinger, \"The Vampire and the Alien: Variations on the Outsider\"\n*1991: H. Bruce Franklin, \"The Vietnam War as American Science Fiction and Fantasy\"\n*1992: Istvan Csiscery-Ronay Jr., \"The SF of Theory: Baudrillard and Haraway\"\n*1993: No Award\n*1994: Larry McCaffery and Takayuki Tatsumi, \"Towards the Theoretical Frontiers of Fiction: From Metafiction and Cyberpunk through Avant-Pop\"\n*1995: Roger Luckhurst, \"The Many Deaths of Science Fiction: A Polemic\"\n*1996: Brian Stableford, \"How Should a Science Fiction Story End?\"\n*1997: John Moore, \"Shifting Frontiers: Cyberpunk and the American South\"\n*1998: I. F. Clarke, \"Future—War Fiction: The First Main Phase, 1871-1900\"\n*1999: Carl Freedman, \"Kubrick's 2001 and the Possibility of a Science-Fiction Cinema\"\n*2000: Wendy Pearson, \"Alien Cryptographies: The View from Queer,\" published in the March 1999 issue of Science Fiction Studies.\n*2001: De Witt Douglas Kilgore, \"Changing Regimes: Vonda N. McIntyre's Parodic Astrofuturism,\" published in the July 2000 issue of Science Fiction Studies.\n*2002: Judith Berman, \"Science Fiction Without the Future,\" published in the May 2001 issue of The New York Review of Science Fiction\n*2003: Lance Olsen, \"Omniphage,\" from the Edging into the Future collection\n*2004: Andrew M. Butler, \"Thirteen Ways of Looking at the British Boom,\" published in the November 2003 issue of Science Fiction Studies.\n*2005: Lisa Yaszek, \"The Women History Doesn't See: Recovering Midcentury Women's SF as a Literature of Social Critique,\" published in Extrapolation 45(1): 34-51.\n*2006: Maria DeRose, \"Redefining Women's Power Through Science Fiction,\" published in Extrapolation 46(1):  66-89.\n*2007: Amy J. Ransom, \"Oppositional Postcolonialism in Québécois Science Fiction,\" published in Science-Fiction Studies 33(2):  291-312.\n*2008: Sherryl Vint, \"Speciesism and Species Being in Do Androids Dream of Electric Sheep?,\" published in Mosaic:  a Journal for the Interdisciplinary Study of Literature 40(1):  111-126.\n*2009: Neil Easterbrook for \"Giving an Account of Oneself: Ethics, Alterity, Air\"\n*2010: Allison de Fren, “The Anatomical Gaze in Tomorrow’s Eve,” published in Science Fiction Studies No. 108, Vol. 36 (2), July 2009: 235-265).\n*2011: John Rieder, \"On Defining SF, or Not,\" published in Science Fiction Studies 37.2 (July 2010)\n*2012: David M. Higgins, “Towards a Cosmopolitan Science Fiction,” American Literature 83.2 (June 2011): 331-54.\n*2013: Lysa Rivera, “Future Histories and Cyborg Labor: Reading Borderlands Science Fiction after NAFTA,” Science Fiction Studies 39.3 (November 2012): 415-36.\n::Honorable Mention: Hugh C. O’Connell, “Mutating toward the Future: The Convergence of Utopianism, Postcolonial SF, and the Postcontemporary Longing for Form in Amitav Ghosh’s The Calcutta Chromosome,” MFS: Modern Fiction Studies 58.4 (Winter 2012): 773-95.\n*2014: Jaak Tomberg, “On the Double Vision of Realism and SF Estrangement in Gibson’s Bigend Trilogy,” Science Fiction Studies 40.2 (July 2013): 263-85.\n*2015: Graeme MacDonald, “Improbability Drives: The Energy of SF,” Paradoxa 26: “SF Now” (2015): 111-144.\n*2016: Scott Selisker, “‘Shutter-Stop Flash-Bulb Strange’: GMOs and the Aesthetics of Scale in Paolo Bacigalupi’s The Windup Girl,” Science Fiction Studies 42.3 (November 2015): 500-18.\n*2017: Lindsay Thomas, “Forms of Duration: Preparedness, the Mars Trilogy, and the Management of Climate Change,” American Literature 88.1 (March 2016): 159-184.\n*2018: Thomas Strychacz, “The Political Economy of Potato Farming in Andy Weir’s The Martian,” Science Fiction Studies 44.1 (March 2017): 1-20.\n*2019: Jed Mayer, “The Weird Ecologies of Mary Shelley’s Frankenstein,” Science Fiction Studies 45.2 (2018): 229-43.\n*2020: Susan Ang, “Triangulating the Dyad: Seen (Orciny) Unseen,” Foundation 48.132 (2019): 5-21.\n::Honorable Mention: Raino Isto, “‘I Will Speak in Their Own Language’: Yugoslav Socialist Monuments and Science Fiction,” Extrapolation 60.3 (2019): 299-324.\n*2021: Jesse S. Cohn, “The Fantastic from Counterpublic to Public Imaginary: The Darkest Timeline?”, Science Fiction Studies 47.3 (2020): 448-463.\n::Honorable Mention: Adriana Knouf, “Xenological Temporalities in the Search for Extraterrestrial Intelligence, Lovecraft, and Transgender Experiences,” Studies in the Fantastic 9 (2020): 23-43.\n*2022: Amy Butt, “The Present as Past: Science Fiction and the Museum,” Open Library of Humanities 7.1 (2021): 1-18.\n::Honorable Mention: Katherine Buse, “Genesis Effects: Growing Planets in 1980s Computer Graphics,” Configurations 29 (2021): 201-230.\n*2023: Pawel Frelik, “Power Games: Towards the Rhetoric of Energy in Speculative Video Games,” Er(r)go. Teoria – Literatura – Kultura 44 (2022): 75-94.\n::Honorable Mention: Nora Castle, “In Vitro Meat: Contemporary Narratives of Cultured Flesh,” Extrapolation 63.2 (2022): 149-179.\nReferences\nScience Fiction Research Association [http://www.sfra.org website]"
    }
  ]
}