{
  "content": [
    {
      "type": "text",
      "text": "# Shachibato! President, It's Time for Battle!\n\n}}\n\"'President, It's Time for Battle!\"|lead=yes}}, or simply Shachibato!', is an online free-to-play role-playing game created by Kadokawa, Deluxe Games, and Preapp Partners. It was released in Japan on October 17, 2019 for Android and iOS devices. An anime television series adaptation by C2C aired from April 5 to June 28, 2020. The game ended service on October 31, 2020.\nCharacters\nKibou Company\n;\n:}}\n:The new president of Kibou Company and the main protagonist.\n;\n:\n:The secretary of Kibou Company and Minato's childhood friend.\n;\n:\n:A warrior who works for Kibou Company. She is Makoto's older sister.\n;\n:\n:A monk and botanist who works for Kibou Company. He is Akari's younger brother.\n;\n:\n:A longtime employee of Kibou Company who is in charge of deskwork. She has been with the company since it was founded 15 years ago by Minato's father.\n;\n:\n:A self-proclaimed genius wizard who becomes a new employee of Kibou Company.\n;\n:\n:A maju that can speak human language and a new employee of Kibou Company. She was an outcast among her tribe and was recruited by Makoto to join.\nOther characters\n;\n:\n:President of the startup company Cyedge. While a skilled adventurer himself, his arrogance often gets him into trouble.\n;\n:\n:An employee of Cyedge.\n;\n:\n:A knight working for Imperial, one of the top companies in the world.\n;\n:\n:\nAnime\nAn anime television series adaptation was announced on December 1, 2019. The series is animated by C2C and directed by Hiroki Ikeshita, with Kenta Ihara handling series composition, Keisuke Watanabe designing the characters, and Yukari Hashimoto composing the series' music. Azumi Waki performs the opening theme song \"Hurry Love\", while Kana Ichinose performs the ending theme song . It aired from April 5 to June 28, 2020. Episode 11 was set to originally air on June 14, 2020, but had been delayed a week later to June 21, 2020 due to production problems.\n{|class=\"plainrowheaders wikitable\" style=\"width:98%; margin:auto; background:#FFF;\"\n|- style=\"border-bottom: 3px solid #CCF;\"\n!\n! Title\n!Original air date\n|-\n| ShortSummary        = Minato is introduced to the Kibou Company by the company's secretary and childhood friend Yutoria, and is provisionally named the new president of the company to succeed his father. Minato is introduced to the other employees in the warrior Akari, the plant-loving monk Makoto, and the deskwork handler Guide, who are all skeptical about him running the company. Minato is tested needing to navigate through an open field to find a special letter. Along the way, he takes a job from the adventurer Thomas to grab a flower, and then defeats a powerful wolf maju before arriving at the letter. Having passed the test, Minato is officially named the president and he lets Yutoria know that he sees being the president as challenging, but rewarding. The next day, Minato is informed that Kibou Company has gone bankrupt.\n}}\n| ShortSummary        = Looking for a way to get out of bankruptcy, Minato decides to fund the company through his father's inheritance. However, to acquire his inheritance the company needs to pay a steep inheritance tax. Looking for ways to quickly get the money to pay the tax, they participate in a contest for young adventurers with the prize money enough to cover the tax. Among the competitors is Rivar, the president of the successful startup company Cyedge, and Akari's former classmate that she has since forgotten about. As the contest progresses with the objective being to take the letter at the end of the dungeon, Rivar's team makes several blunders along the way while Minato's team makes steady progress.\n}}\n| ShortSummary        = The contest continues with Rivar and his secretary Valmi reaching the dungeon boss, a three-headed maju, first and Rivar struggles. Minato's team arrives and together they defeat the boss by tricking two of the maju's heads into fighting each other. However, the letter was already claimed by Subaru from the Imperial Company, who had snuck around the maju while it was sleeping to retrieve the letter without fighting it. Despite the contest ending in failure, the company's morale improved and they got some money for slaying the boss maju. Some time later, Yutoria arrives having made a \"juicy\" discovery.\n}}\n| ShortSummary        = Yutoria reveals that the \"juicy\" discovery is a treasure map found by her acquaintance, the self-proclaimed genius wizard Marika. With the rest of the company busy with other matters, Minato, Yutoria, and Marika go treasure hunting, with the three meeting Thomas again to help them out. The map leads to clues that sends the party into a haunted house, revealed to be a mansion formerly owned by Marika's late grandfather. The treasure is a letter by Marika's grandfather telling her that friendship is the greatest treasure, and to make her see that, he arranged this treasure hunt in a way so that it could only be completed through making friends.\n}}\n| ShortSummary        = Having helped Marika realize the value of friendship, she returns the favor by sharing with the company the profits from selling a bunch of bracelets she had been collecting by defeating majus. While fetching a form at Marika's house, Minato and Marika are transported to the city's underground where they encounter a bunch of really strong majus protecting the highly valuable rare earth minerals. The two escape the dungeon and hear that Rivar was seriously injured battling those majus. The Kibou Company employees pay a visit to Cyedge to learn about the majus from Rivar to prepare for them.\n}}\n| ShortSummary        = Marika is hired as a new employee of Kibou. After dodging a bunch of traps, the company encounters the boss of the majus. Noticing that the subordinates keep on fighting despite being knocked down, the company defeats the boss by using healing magic on the subordinates, who are not used to having time off. Using the money earned from the rare earth harvested from the quest, the inheritance tax is paid off to bring Kibou out of bankruptcy. Among the inherited items is a message from Minato's father, who arranged this inheritance tax to be a test of Minato's worthiness to be Kibou's president, as well as to tell him that he went beyond the Big Gate.\n}}\n| ShortSummary        = With Kibou's finances stabilized, the employees go off on their own adventures with Minato and Guide staying behind to handle the growing amount of paperwork. While Minato struggles with the paperwork, Guide makes fast progress on it. Guide tells Minato that she had been handling mountains of paperwork for the company for 15 years and remembers how he was like when they first met. Meanwhile, a scammer arrives claiming that they hold a valuable weapon that was never given to them. While Minato freaks out, Guide uses her experience to get him to leave. Later that day, Akari returns and goes on a date with Minato wanting to go on a shopping spree having gotten a bonus. Minato encounters the scammer again when Akari sees some merchandise she wants, but Minato knew the merchandise was bootleg. The date ends with Akari telling Minato that while she still cannot trust him to run the company, she is proud to be working for him.\n}}\n| ShortSummary        =\n}}\n| ShortSummary        =\n}}\n| ShortSummary        =\n}}\n| ShortSummary        =\n}}\n| ShortSummary        =\n}}\n|}\nReferences\nExternal links\n*\n*\n*"
    }
  ]
}