{
  "content": [
    {
      "type": "text",
      "text": "# Shadow Warrior 2\n\n| composer  =\n| series    = Shadow Warrior\n| engine    = Road Hog Engine\n| platforms =\n| released  =\n| genre     = First-person shooter\n| modes     = Single-player, multiplayer\n}}\nShadow Warrior 2 is a 2016 first-person shooter game developed by Flying Wild Hog and published by Devolver Digital. The game is the sequel to 2013's Shadow Warrior, the reboot of the 1997 original. It was released for Windows in October 2016, and for PlayStation 4 and Xbox One in May 2017. It received generally positive reviews from critics. A sequel, Shadow Warrior 3, was released in March 2022.\nGameplay\nShadow Warrior 2 can be played in single-player mode, or in a new 4-player co-op mode. In co-op mode, each player experiences the narrative as Lo Wang but sees other players as various anonymous ninjas.\nThe level environments are more open and nonlinear than in the previous title. New traversal mechanics have been added, such as climbing walls and double jumping to allow for more exploration. The mission structure in Shadow Warrior 2 is less restricted than its predecessor, and players can now revisit earlier missions to re-engage past enemies in order to upgrade Wang's skills. The game features a hub area where the player can acquire quests and upgrade their abilities before beginning a mission. Every mission, except for story-specific events, features a randomly generated level design and content that includes randomized map layouts, enemy positions, terrain, buildings, and weather conditions. The game utilizes a procedural damage system that allows players to cut and blow off enemy limbs and body parts.\nThe game features over 70 different weapons, varying between firearms and blades. Killing enemies will level up weapons and reward the player with gems to augment their equipment with elemental properties and buffs.\nPlot\nLo Wang is given a task from the Yakuza to retrieve an ancient trinket from the Temple of Longing. Wang accepts the task, and travels to the temple where he retrieves the artifact. After speaking to Mamushi, the second in command of the Yakuza, he is given a new task to rescue Kamiko, the daughter of the Yakuza's leader, from Zilla's labs. He finds Kamiko tied to a table with the Kyokagami Twins inside the room and Zilla watching her through a monitor. The Twins inject Kamiko with a substance known as Compound 61, and she begins to hallucinate. Wang reveals his presence and the Twins run off to catch him, while hordes of ZillaCorps' soldier's attacks Wang. Eventually, Wang reaches Kamiko and brings her to Smith. Smith decides to temporarily transfer Kamiko's soul into Wang's body until he devises a way to completely heal her. Lo Wang then retrieves the ingredients needed to make the cure and then delivers them to Smith.\nMeanwhile, Mamushi Helka tasks Lo Wang with finding the source of a black ooze that is spreading in the wildlands. She gives Wang the coordinates to the location of the supposed source. The source for the black ooze turns out to be the Outer Gates, but which are locked by Mezu's armour. Wang finds Mezu still guarding the gates as before. He is then contacted by Master Smith asking him to go back to the mountain as ZillaCorps' soldiers have attacked their hideout.\nLo Wang is transported to the wildlands and tries to reach Dragon Mountain, encountering large numbers of ZillaCorps' soldiers. When Wang reaches the mountain, he finds Smith gravely injured. Smith reveals that he has finished making the cure. In his dying moments, Smith puts his soul in a Soul Well. As Wang goes to administer the cure to Kamiko's body, the body attacks him, now in a horribly mutated form. After a tough fight, the corrupted body escapes. Suddenly, Ameonna contacts him and urges Wang to meet her in the Shadow Hills. He meets Gozu guarding the entrance to the temple, who lets him in. When Wang meets Ameonna, he asks her to reverse the soul binding, but Ameonna tells him that he must retrieve Kamiko's body and return it to its original form before the soul exchange can take place.\nIn order to perform the soul joining ritual, Ameonna needs Ancestral Chi, which can be found in a weapon that belonged to Kamiko's father. Kamiko reveals that Mamushi Helka carries around a wakizashi given to him by her father. With this information, Wang seeks out Mamushi. After a brief talk, Mamushi takes her own life and Wang brings the ceremonial dagger to Ameonna.\nGozu informs Lo Wang that they have located Kamiko's body and marks the last known whereabouts. Wang travels to the top of Devil Mountain, where the body has been feeding on Black Rain and has mutated even more. After a tough fight, the body again tries to escape but is captured by ZillaCorps. Wang then returns to Gozu to inform him about the situation.\nAmeonna reveals that Kamiko's father should be in the vicinity of Outer Gates. Lo Wang travels there and finds Mezu. Mezu reveals himself to be the Oyabun, leader of the Yakuza and father of Kamiko. He then travels to Mamushi's former office, while Wang returns to Ameonna. Ameonna reveals to have known about Oyabun's identity and was setting everything up so Kamiko would die. She then orders Gozu to kill Wang, but Wang evades the attack and then fights the Acolytes. During the fight, Gozu and Ameonna escape. Wang returns to Dragon Mountain and speaks with Mezu. Mezu says that he wanted to use Kamiko to seal back the Outer Gates and Wang reveals that her soul is inside his body. Together, they form a temporary alliance.\nMezu says that Xing will help them to locate Kamiko's body, but Lo Wang must meet him in person. After Wang reaches Xing, he reveals the story behind the Outer Gates. Eons ago, Ancients raged war with chaos. Eventually, demon armies led by Xing managed to push the chaos into the void. Hoji then constructed a set of gates to keep them out of the Shadow Realm, while Mezu used Ameonna's soul to seal the gates. Unfortunately, they still needed the power that derived from chaos, so they used Ameonna to channel it, through her tears. For centuries, Enra, Mezu and Hoji used the power for their own desires and then isolated her as to protect the flow of energy. Loneliness and sorrow slowly drove Ameonna mad. Enra's and Hoji's deaths were the last straws for her sanity. Xing then gives the location of Kamiko's body to Wang.\nWith the location of Kamiko's body, Lo Wang breaks into Zilla's HQ. He then confronts Zilla, and after a brief chat, Zilla gets inside a mech and attacks Wang. Wang manages to get the upper hand in the fight and defeats Zilla. Suddenly, Ameonna appears and steals Kamiko's body. Zilla gives Wang a weapon and they come together in order to stop Ameonna.\nLo Wang meets with Mezu, who reveals that Gozu had already transferred Ameonna's soul into Kamiko's body. This made the situation even worse as the body mutated even more. Wang then faces off against Ameonna, knocks her out and injects Smith's antidote in the body. Mezu comes, but before he can extract Ameonna's soul, Lo Wang kills her. Seconds later, Xing and Zilla arrive on the scene. Kamiko decides to seal the Outer Gates open using her living soul and rectify the two worlds. She then flies to the gates, shattering them. Out of the gates, a giant dragon emerges (implied to be Kamiko) and then attacks Lo Wang.\nDevelopment\nShadow Warrior 2 was developed by Flying Wild Hog, the studio that previously developed the 2013 reboot of the 1997 original, using their in-house Road Hog Engine. On 11 June 2015, publisher Devolver Digital officially announced the title. The game was released for Microsoft Windows on 13 October 2016, and for PlayStation 4 and Xbox One in May 2017.\nReception\n(PS4) 72/100(XONE) 78/100\n| Destruct = 7/10\n| GI = 6.75/10\n| GameRev =\n| GSpot = 8/10\n| IGN = 8.6/10\n| PCGUS = 78/100\n| Poly = 5/10\n}}\nShadow Warrior 2 received \"generally favorable\" reviews from critics, while the PS4 version received \"mixed or average\" reviews, according to review aggregator website Metacritic.\nZack Furniss's score of 7/10 on Destructoid described the game as: \"Solid and definitely has an audience. There could be some hard-to-ignore faults, but the experience is fun.\"\nJonathan Leack of Game Revolution awarded it 4 out of 5 stars saying that \"Shadow Warrior 2 is in position to become Fall 2016's premier sleeper hit as not many gamers are talking about it, and there certainly isn't much in the way of a marketing campaign. Even then, its gameplay dynamics are so well executed that it could walk among this year's biggest games. If you're looking for a fun online co-op game to play with friends, this might just be the game for you. Just don't go in expecting a satisfying story.\"\nIGN's Leif Johnson gave the game a score of 8.6/10 with the consensus \"Wang's stupid wisecracks kept me smiling from start to finish, and the variety of melee and ranged combat and the loot that dropped from it was satisfying enough that I came back with friends for more. It's great fun in solo or in co-op, and its small degree of randomization is enough to keep the action fresh for at least a few runs.\"\n78/100 was James Davenport's score on PC Gamer and said \"Shadow Warrior 2’s combat is gleefully expressive and varied but undermined by tired, dated humor.\"\nCarli Velocci's 5/10 score on Polygon stated that \"Shadow Warrior 2 is a game about slicing and shooting through hordes of monsters and soldiers. It’s about as classic a setup as the shooter genre has in that regard. A player itching to hack up some demons could do a lot worse. But everything else about Shadow Warrior 2 feels hollow. The characters are lifeless, the jokes aren’t funny, the story is worthless, and the levels are repetitive. There might be a place for a 1997-style game in 2016 — something simple with a narrow focus that plays on many of the boring, sexist, and lazy traditions that gaming has left behind — but Shadow Warrior 2 isn’t nearly enough.\nSales\nFlying Wild Hog announced that Shadow Warrior 2 quadrupled its sales launch compared to 2013's Shadow Warrior reboot, saying \"We could not be happier with the reception of Shadow Warrior 2. [...] That our fans and critics have largely applauded our efforts means the absolute world to us\".\nReferences\nExternal links\n*"
    }
  ]
}