{
  "content": [
    {
      "type": "text",
      "text": "# Shad (software)\n\n| logo = Shad logo.png\n| logo size = 64px\n| screenshot =\n| screenshot size = 220px\n| caption =\n| collapsible = no\n| developer = Ministry of Education  Mobile Telecommunication Company of Iran\n| released = 2020 September 9\n| ver layout = simple\n| programming language =\n| platform = Android, Web service\n| language count =\n| language footnote =\n| language = Persian\n| genre = Educational social media, Learning management system, IPTV, video conferences, Instant messaging\n| license =\n| alexa =\n| website =\n}}\nThe  students education network (), with acronym Shad () That in addition to the abbreviation of the full name of the program, it refers to the word Shaad meaning happy, is a communication and educational software that was launched following the spread of the coronavirus due to the absence of students in schools in Iran. The software is owned by the Ministry of Education of Iran, and students, teachers and headmasters are the people who use this software.\nAt first, on 2020 April 4, Shaad Software was run only on messaging apps, and principals, teachers, and students needed to install one of the Bale, Soroush, Gap, iGap, and Rubika, but on 2020 April 9, the Ministry of Education presented the software without needing to have those messengers. About 70% of Iranian students are members of this social network. Due to the emphasis of education on the installation and use of this software, a significant number of students were activated in this student network, which is estimated to be more than 17 million people. According to Mohammad Mehdi Nooripour, chairman of the Student Organization Assembly, Shad software has about 800,000 daily visits. 13 percent of Iranian students never had an electronic device for application setup.\nHistory\nDuring the pandemic Shad development was delayed, and it was replaced by online TV teachers, but it has so many problems.\nIt was called Social network of students.\nProducts and services\n* shaadbin.ir (\"children  search engine\"- by Zarebin.ir)\n* Student real life identity authentication (15 million students)\n* Temporary free Internet bandwidth (mobile data-some designated Iranian mobile network corporations offered SIMs)\n* External APIs for Iranian mobile apps\nUse\nPrivate schools educators are not required to install the app.\nReception\nSimultaneously with the unveiling of the software, many students and teachers criticized the software. They claimed that the software had low quality and could not compensate for the training for students. In the view of some, its inefficiency is due to the fact that some students live in deprived areas and lack facilities such as computers, laptops, smartphones, and even high-speed or regular Internet. On the other hand, Mohammad Mehdi Nooripour and Majid Najafizadeh, Representatives of students and teachers of Iran thanked the Minister of Education for setting up this network at a meeting of Student Organization. Recently, in an update, new features have been added and the performance of Shad has been improved.\nSee also\n* COVID-19 pandemic in Iran\nReferences\nExternal links\n* https://shad.ir/\n*[https://shad.medu.ir/ Official website]"
    }
  ]
}