{
  "content": [
    {
      "type": "text",
      "text": "# Shaheed Bir Uttam Lt. Anwar Girls College\n\n| type                    = School & College\n| established             =\n| school_board            = Board of Intermediate and Secondary Education, Dhaka\n| authority               = Bangladesh Army\n| principal               = Colonel S M Moniruzzaman\n| grades                  = I-XII\n| years                   = 12\n| gender_label            =\n| gender                  = Female\n| language                = Bengali and English\n| campus_size             =\n| campus_type             = Urban\n| website                 =\n}}\n'''Shaheed Bir Uttam Lt. Anwar Girls' College''' (Bengali: শহিদ বীর-উত্তম লে. আনোয়ার গার্লস কলেজ) is an educational institution in Dhaka Cantonment, Dhaka, Bangladesh. It is managed by the Bangladesh Army and primarily for the female children of army personnel. But female students from the civilian section also can study in this college.\nHistory\nIn January 1957, the school was established under Dhaka Cantonment Board as a primary school for the children of defence personnel. The school was renamed to Cantonment Girls School and upgraded to a high school.\nThe school was renamed after Lt. Md Anwar Hossain, who was killed in action in Jessore Cantonment during the Bangladesh Liberation War and received Bir Uttam gallantry award, in 1972. It was upgraded to a college in 1990.\nIn April 2012, Concord Group awarded scholarships to students from the top ten schools in Dhaka including Shaheed Bir Uttam Lt. Anwar Girls School & College.\nThe school started taekwondo classes in 2013 in partnership with the Bangladesh Taekwondo Federation.\nThe school participated in the National Debate Festival '14 and the IGNITE competition organized by The Daily Star and Grameenphone.\nIn January 2016, after the government of Bangladesh increased the fees of some public schools in Dhaka including Shaheed Bir Uttam Lt. Anwar Girls School & College the parents protested in the street. The government subsequently stopped the fee hike.\nIn Higher Secondary School Certificate examination, the educational institution had a 99.86 per cent pass rate in 2017 and 99.52 per cent in 2018, one of the highest.\nIn 2022, Shaheed Anwar Girls College won the Inter-cantonment English Debate Competition in the college category and were runners-up in the school category.\nAlumni\n* Nusraat Faria\n* Azmeri Haque Badhon\n* Nishat Majumdar\nReferences"
    }
  ]
}