{
  "content": [
    {
      "type": "text",
      "text": "# Shaka Heyward\n\n| birth_place         = Dacula, Georgia, U.S.\n| death_date          =\n| death_place         =\n| height_ft           = 6\n| height_in           = 3\n| weight_lb           = 238\n| high_school         = Mill Creek(Hoschton, Georgia)\n| college             = Duke (2018–2022)\n| undraftedyear       = 2023\n| pastteams           =\n* Cincinnati Bengals (–present)\n| status              = Injured reserve\n| highlights          =\n| statseason          = 2024\n| statweek            =\n| statlabel1          = Total tackles\n| statvalue1          = 9\n| statlabel2          =\n| statvalue2          =\n| pfr                 = HeywSh00\n}}\nShaka Heyward (born April 19, 2000) is an American professional football linebacker for the Cincinnati Bengals of the National Football League (NFL). He played college football for the Duke Blue Devils.\nEarly life\nHeyward was born on April 19, 2000. He comes from an athletic family: his cousins, Cameron and Connor Heyward, both play for the Pittsburgh Steelers, while another cousin, Corey, played college basketball, another, Craig Jr., played college football for Middle Tennessee, and Craig Jr.'s father Craig Heyward also played in the NFL. He attended Mill Creek High School in Georgia where he played football as a linebacker. In his last two seasons, he totaled 168 tackles. A three-star prospect, he committed to play college football for the Duke Blue Devils and one of the top-60 ranked outside linebackers nationally.\nCollege career\nHeyward redshirted as a freshman at Duke in 2018, appearing in four games. The following year, he appeared in all 12 games, six as a starter, totaling 68 tackles and 6.5 tackles-for-loss (TFLs); he was third for Atlantic Coast Conference (ACC) freshmen in the former while he placed sixth in the latter category. In 2020, he started all 11 games and posted a team-leading 80 tackles with 8.5 TFLs and 3.0 sacks. That year, he received the Vincent Rey Award for best Duke linebacker and the Sonny Falcone Award, \"given annually to offensive, defensive, and developmental members for their year-round commitment to strength and conditioning.\"\nIn 2021, Heyward was named third-team All-ACC after having started all 12 games and recording a team-leading 98 tackles and 11.5 TFLs. He received the Vincent Rey Award for a second time and also won an award for playing the most snaps for Duke that year. As a senior in 2022, he served as team captain and started all 12 games, recording 93 tackles, six pass breakups and 6.0 TFLs, being named honorable mention All-ACC and the Duke defensive MVP. He concluded his collegiate career having started 41 games, tallying 340 tackles, 32.5 TFLs and 11.5 sacks.\n}}\nAfter going unselected in the 2023 NFL draft, Heyward signed with the Cincinnati Bengals as an undrafted free agent. He was waived on August 29, 2023, then re-signed to the practice squad the following day. He signed a reserve/future contract after the season on January 8, 2024. He was waived again on August 27, 2024, then re-signed to the practice squad the following day. He was elevated to the active roster for the team's Week 11 game against the Los Angeles Chargers and made his NFL debut in the game, appearing on 24 special teams snaps. He was signed to the active roster on December 2.\nReferences\nExternal links\n*[https://www.bengals.com/team/players-roster/shaka-heyward/ Cincinnati Bengals bio]\n*[https://goduke.com/sports/football/roster/shaka-heyward/18074 Duke Blue Devils bio]"
    }
  ]
}