{
  "content": [
    {
      "type": "text",
      "text": "# Shaking the Tree (song)\n\n| recorded      =\n| studio        =\n| genre         =\n| length        = 5:38\n| label         = Virgin\n| writer        = Youssou N'Dour, Peter Gabriel\n| producer      =\n| chronology = Youssou N'Dour\n| prev_title = Shango Affair\n| prev_year  = 1988\n| next_title = 7 Seconds\n| next_year  = 1994\n| misc       =\n}}\n\"'''Shakin' the Tree'''\" is a 1989 song by Youssou N'Dour and Peter Gabriel from the Youssou N'Dour album The Lion. Released as a single, it reached number 61 on the UK official singles chart on 17 June 1989.\nThe following year, Gabriel released a new version on his greatest hits album Shaking the Tree, altering the title slightly and recording a new vocal take. This version was released as a double A-side single with \"Solsbury Hill\", which reached number 57 on the UK official singles chart on 29 December 1990.\nBackground and composition\nGabriel first encountered N'Dour in 1983 at one of his performances in Paris. He was impressed with N'Dour's vocals, saying that it was \"one of the best I'd heard in my life.\" Gabriel and N'Dour later became acquainted, with their first performance together occurring in 1985 for the song \"Biko\", which N'Dour \"had a great affinity for.\" N'Dour sang on \"In Your Eyes\" on Gabriel's So album that same year and also contributed vocals to his 1989 Passion soundtrack album.\nN'Dour had encouraged Gabriel to write a song about women's emancipation, which was a shared goal of theirs. Gabriel said that he wanted the song to encourage women to \"shake up the male establishment\" in African and American institutions. N'Dour agreed with those sentiments, saying that \"a woman shouldn't be tied up to the house. She should be free to go out and work if she wants. The tree and the shaker are symbols of work, of achieving something.\" He also expressed his belief that religious doctrines should not be weaponized to undermine women's emancipation. \"Shaking the Tree\" follows a verse-chorus structure, with some of the vocals being sung in N'Dour's native Wolof language.\nThe recording sessions for \"Shaking the Tree\" took place at Gabriel's Real World Studios with George Acogny serving as the producer with Hugh Padgham, who also mixed the song. Two days were originally allotted to complete the song, although work was still ongoing one month after the sessions began. Acogny and Padgham encountered phase shifting with the horns during the song's vamp section, which was the result of issues with stereo sampling from a WaveFrame workstation.\nRelease and versions\nTo promote the song, an accompanying music video was filmed in Senegal by Isaac Julien over the course of two days. The original mix of the song from N'Dour's The Lion was released as a single in May 1989, reaching No. 69 in the UK. A remixed version was included on Gabriel's Shaking the Tree: Sixteen Golden Greats compilation album and issued as a double A-side with \"Solsbury Hill\", this time peaking at No. 57 in the UK.\nDuring the 1993–1994 Secret World Tour, an eight-foot tree designed by Gabriel and Robert Lepage emerged from the middle of a circular stage. A live recording from this tour was included on Gabriel's Secret World Live album in 1994.\nDavid Bottrill was commissioned to remix the song as a B-side for Gabriel's 1993 \"Kiss that Frog\" single. Versions with additional vocals by Shaggy appeared on the soundtracks to Jungle 2 Jungle (1997) and The Wild Thornberrys Movie (2002). The Bottril and Jungle 2 Jungle remixes were included on Gabriel's 2019 Flotsam and Jetsam compilation album.\nLegacy\nGhanaian writer Meri Nana-Ama Danquah highlighted the song in her book, Shaking the Tree, saying that she drew \"a lot of inspiration from the lyrics, which encourage women to challenge the status quo, to be the architects of our future.\"\nTrack listing\n; 7-inch single (1989)\n# Youssou N'Dour & Peter Gabriel: \"Shakin' the Tree\" – 5:38\n# Youssou N'Dour: \"Old Tucson\" – 4:20\n; CD/12-inch single (1989)\n# Youssou N'Dour & Peter Gabriel: \"Shakin' the Tree\" – 7:13\n# Youssou N'Dour: \"Old Tucson\" – 4:20\n# Youssou N'Dour: \"Sweeping the Leaves\" – 4:53\nPersonnel\n* Youssou N’Dour – lead and backing vocals\n* Peter Gabriel – lead and backing vocals, Yamaha CP-80, Prophet, Roland D-50\n* George Acogny – CMI percussion sequencing, guitars, backing vocals\n* Guy Barker – trumpet\n* John Barclay – trumpet\n* Pete Beachill – trumpet\n* Roger Bolton – drum programming\n* Simon Clark – organ, piano, keyboard bass\n* Habib Faye – guitar, bass\n* Manu Katché – drums\n* David Rhodes – electric and acoustic guitars\n* Phil Todd – saxophones\nReferences"
    }
  ]
}