{
  "content": [
    {
      "type": "text",
      "text": "# Shankheshwar Jain Temple\n\n| location = Shankheshwar, Gujarat, India\n| deity = Parshva\n| festivals = Posh Dashami, }} Mahavir Janma Kalyanak, Diwali\n| creator = Sajjan Shah\n| established = 1098 CE\n| website =\n}}\nThe Shankheshwar Jain Temple is located in the center of Shankheshwar town of Patan district, Gujarat, India. The temple is dedicated to Parshwanath and is an important place of pilgrimage for the followers of Jainism.\nJain legend\nIn ancient scriptures, this Tirtha (pilgrimage site) is referred to as Shankhapur. The story is that Ashadhi Shravak became depressed, and began to ask questions about nirvana, liberation, and salvation. Answering all these questions, Damodar Swami, the ninth Tirthankar, said \"Parshvanath will be the twenty-third Tirthankar in the Avasarpinikala (the descending half of the wheel of time). You will be his Ganadhar (prime disciple) named Aryaghosha and attain salvation there\". Shravak then became fully absorbed in praying to Bhagawan Parshvanath and worshipping his idol, which went on to be worshipped in the worlds of gods, demons, and on earth.\nHistory\nIn the year 1155 VS (1098 CE), Sajjan Shah re-built/ renovated the Shankheshwar Parshwanath Jain Temple on the banks of the Rupen river. In Vikram Samvat 1286 (1229 CE), Vastupala—Tejpal renovated this temple under the instructions of Vardhamansuri. There were 52 idols in the temple. In VS 1302, king Durjansalya, awed by the idol and inspired by Uktasuri, renovated the temple substantially. In the fourteenth century VS, the temple was destroyed by Alauddin Khalji. In the sixteenth century VS, under the inspiration of Vijaysensuri, a new temple with 52 idols was built. In VS 1760 (1703 CE), the sangha built the new temple and got the idol reinstalled. Besides the original sanctuary, the temple has an open square, a decorated square, a vast square and two assembly halls. The current temple was built in 1811.\nAbout temples\nThe mulnayak, the main idol, nearly  high, is a white-coloured idol of Parshvanatha in the Padmasana posture. In the Shvetambara tradition, idols tend to derive their name from a geographical region, the Shankheshwar Parshvanatha is one of 108 prominent idols of Parshvanath idols. There are dozen of replica temples and icons of Shankheshwar Parshvanatha. }} The idol of Bhidbhanjan Parshvanath is in a small temple to the right of the main idol, and the idol of Ajitnatha is in a small temple to the left of the main idol. The idols of Dharanendra, Padmavati, Parshva and Chakreshwari are also in the temple. On the tenth day of the month of Posh, the tenth day of the dark half of the month of Magasar, and during the Diwali days, thousands of pilgrims come to observe a two-day-long fast.\nShankheshwar is considered one of the most important Jain . Shankheshwar Parshvanath Stavan, a hymn dedicated to Shankheshwar Parshvanath, is one of the most performed Jain prayer. Sankhesvara Stotram is another hymn to Shankheshwar Parshvanatha compiled by Mahopadhyaya Yashovijaya.\nAt present, the temple complex is under renovation. The doors of the small temples on the passage for going around the temple are being enlarged, and the height of their summits will be raised.\nOther Jain temples\nBesides this temple, there are several other Jain temples - the Agam Mandir, the modern sprawling complex of 108 Parshvanath and Padmavati (108 Parshwanath Bhaktivihar Tirth), Rajendrasuri Navkar Mandir, Kalapurnam Smriti Mandir, the Gurumandir, and Dadawadi are important.\nThere is a temple dedicated to Bhaktamara Stotra built by Jain Acharya Surendrasuri. The temple houses 84 yantra.\nShruth tirth is located two kilometres southerly of Sankeshwar on Sankheswar-Viramgam Highway. Further four kilometre south, there is Pavapuri Jalmandir at Ratanpura.\nThus Shankeshwar tirth ranks next only to those on Mount Shatrunjaya in Palitana, (Gujarat) in terms of importance to the Swetambara Jains.\nGallery\nFile:Shankheswarji (20).jpg|Sculptures and Shikharas at Shankheswar Jain Temple\nFile:Shankheswarji (10).jpg|Ornate carvings on wall\nFile:108 Parshwanath (cropped).jpg|The passage to the main shrine\nOther buildings\nThere are an upashray, an ayambilshala, a bhandar, a pathshala, and a hall where food is given to pilgrims for their journeys.\nSee also\n* Panchasara Jain temple\n* Nagarparkar Jain Temples\nNotes\nReferences\nCitation\nSources\n*  |access-date=27 August 2016|year=1876|publisher=India Museum|location=London|archive-url=https://web.archive.org/web/20160829062000/http://www.dli.ernet.in/handle/2015/106940|archive-date=29 August 2016|pages=187–217}}\n*  |year=2001 |publisher=Oxford University Press |isbn=978-0-19-803037-9 }}\n*\n*  |publisher=University of Chester |year=2019 |isbn=9781908258984 }}\n*  |publisher=University of Chicago Press | year=2021 |isbn=9780226767062 }}\n*\n*  |publisher=Routledge | year=2013 |isbn=9780415448512 }}\n*  | volume=1 |date=1987 |publisher=Abhinav Publications |isbn=978-81-7017-208-6 }}\n*  |publisher=Springer | year=2017 |isbn=9783319550992 }}\n*  | title=Sankhesvara Stotram | first=Acharya Kalyanbodhi |last=Suriji | publisher= Multy Graphics |date=2013 }}\n*  |publisher=SUNY Press | year=1992 |isbn=9780791407967 }}"
    }
  ]
}