{
  "content": [
    {
      "type": "text",
      "text": "# Shared historical authority\n\nShared historical authority is a current trend in museums and historical institutions which aims to open the interpretation of history to the public.\nDefinition\nThe concept of shared historical authority is defined by the premise that traditional institutions of historical authority, such as museums and historical societies, are increasingly inviting non-professionals (the general public) to share their historical viewpoints and experiences with the public. It is argued that this trend toward sharing authority is changing the nature of public historical experience in significant ways. Shared authority removes the hierarchy commonly practiced within cultural institutions. Moving away from a top down approach, shared authority is geared towards collaboration that includes dialogue, and participatory engagement.\nTypical examples of shared historical authority include:\n* A museum inviting a community artist to create and install a work of historically inspired public art on their site.\n* A historical society providing gallery space for community groups to display their own exhibitions.\n* Web-based projects that invite and display user-generated components.\n* Using oral and written histories contributed by individuals outside the strictly academic community in conjunction with more traditional scholarly essays, text panels or exhibit labels.\n* A historic house tour where visitors are encouraged to explore on their own and draw their own conclusions.\n* Community curation - \"crowdsourcing\" related content from subaltern groups\nIn each case the institution serves as a catalyst for non-traditional participants to contribute to a body of information presented to the public.  The institution uses its resources - e.g. staff expertise, collections, public space - to help non-traditional participants share their contributions in publicly accessible and engaging ways.  At its most basic, shared authority turns people who would otherwise be historical consumers (visitors and audiences) into participants and co-generators of historical content for public display. Museums who coordinate programs that share historical authority often wish to imbue a sense of democratization to the historical narrative, in contrast to the top-down historical narratives that sometimes emerge in museums. In addition, shared authority projects frequently try to involve communities who have traditionally been disenfranchised or underrepresented in historical narratives and institutions, providing a platform for alternative voices to engage in a public historical dialogue. The role of shared historical authority continues to be debated in the field of public history.\nHistory of the idea\nThe need for museums and other historical institutions to \"share authority\" with their audiences and surrounding communities is rooted in the ideologies of New Social History and social constructivism.  Both paradigms reject the concept of a \"master narrative\" for describing historical events, finding it an inadequate method for representing the multiple experiences and perspectives of individuals involved.  Arising from the work of folklorists such as John Lomax and Alan Lomax, New Deal-era Works Progress Administration (WPA) programs such as the Federal Writers' Project and the work of Studs Terkel, the social history movement of the 1960s placed new academic emphasis on the experiences of people not represented in traditional or \"official\" historical narratives, and gave further impetus to projects focused on collecting and sharing those experiences.\nMichael Frisch, a professor at the University at Buffalo, The State University of New York, popularized the term \"shared authority\" in his 1990 book A Shared Authority: Essays on the Craft and Meaning of Oral and Public History. In recent years, Frisch has distinguished between \"sharing authority\" and \"a shared authority.\" The former suggests that historians possess authority and have a responsibility to share it, reinforcing a traditional, top-down view of history. \"A shared authority\", by contrast, recognizes that traditional historical authorities and the public share in the interpretive and meaning-making process \"by definition.\"\nBeginning in the early 2000s, the proliferation of Web 2.0 technologies that allow users to easily create and share content on digital platforms offered historical institutions a variety of new tools to facilitate public participation.\nCase studies\nin New York's Manhattan district is a good example of how an urban museum can share historical authority]]\nOther examples of shared historical authority include StoryCorps, the City of Memory, and Philaplace, an internet-based neighborhood history project produced by the Historical Society of Philadelphia that combines scholarly essays with stories from anyone who cares to submit one.  Staff members then curate the submitted stories. Dennis Severs House is a historic townhouse in London (18 Folgate St.) that was restored by Dennis Severs.  The house is filled with historic objects alongside modern touches, sound clips of carriages and crying babies, and plates of real food set out each day by the staff.  Visitors are encouraged to roam the house on their own, sit down on the furniture, interact with other visitors, and draw their own conclusions. The experience is meant to blur the lines between art and history.\nThe Lower East Side Tenement Museum is the first museum to focus on the lives of urban, immigrant tenement dwellers.  It shares authority by inviting the families of former residents to contribute objects, photographs, documents, interviews, and oral histories to the museum tours.  Part of the museum's mission is to address today's immigrant issues. This provides another avenue for sharing authority through public programs that connect speakers with varied backgrounds to public audiences. The museum invites sharing on one of its tours, Sweatshop Workers, with the words:\n: \"Spend extended time inside the Levine and Rogarshevsky apartments and join in a discussion about themes arising from the tour. Share your experiences, thoughts, and family histories with your educator and fellow visitors.\"\nOpen House: If These Walls Could Talk is an exhibition that was produced by the Minnesota Historical Society in 2006. The exhibition traced the stories of families in a single house in St. Paul, Minnesota between 1888 and 2006.  The curators did not want to show patterns or people as part of aggregate groups.  Instead, they chose to emphasize singularity and individuality.  To accomplish this, the Minnesota Historical Society built a house for visitors to walk through.  Instead of reading large panels of wall texts, visitors had to interact with objects to hear, read, or see the information.  Unlike projects in which the content is produced in conjunction with a group of community members, here authority was shared at the level of narrative creation.  Curators controlled the objects in the house, recordings of former residents, and the setup of the space.  Without an overarching structure, visitors could wander through at random, co-creating their own narratives. There was no clear beginning and end beyond entering and exiting the house.\nThe Black Bottom Performance Project is a partnership between the University of Pennsylvania and residents of Black Bottom, a historically black neighborhood destroyed by urban renewal policies and the University of Pennsylvania's expansion in the 1960s.  Billy Yalowitz, a theater professor working at the university, invited Penn students as well as student and teacher partners from University City High School—a school built in the former Black Bottom neighborhood—and former residents of the neighborhood to work together on the telling of the neighborhood's history, ultimately creating \"Black Bottom Sketches\" in 1998.\nThe Wing Luke Museum is an example of a museum in which shared authority is a core component of its programming policies.\nThe Humanities Truck is an experimental mobile platform for collecting, exhibiting, preserving, and expanding the dialogue around the humanities in and around the Washington, D.C. area. The project, which is sponsored by American University and is initially funded through a generous grant from the Henry Luce Foundation, enables partnerships with local organizations to collect people’s stories on critical issues, such as immigration and homelessness. The truck is fitted with a recording studio, mobile workshop space, and a gallery for pop-up exhibits that features built-in speakers, a flat-screen television, a roll-down screen and projector, and even an outside exhibit wall. Humanities Truck project fellows share historical authority with the communities with which they work.\nCriticism\nDespite the interest and affirmation that sharing authority is currently receiving in museum and public humanities circles, there are scholars and practitioners who criticize the practice.  Generally, these criticisms are aimed at one of two levels.  First, some scholars suggest that the phrase itself is wrong. \"Sharing authority\" implies that the process is something museums/archives do rather than something that just \"is.\"  In his essay for Letting Go?, Michael Frisch suggests that a more appropriate formulation of the concept is \"a shared authority.\"\n:\"a shared authority\"... suggests something that 'is'-- that in the nature of oral and public history, we are not the sole interpreters.  Rather, the interpretive and meaning-making process is in fact shared by definition-- it is inherent in the dialogic nature of an interview, and in how audiences receive and respond to exhibitions and public history interchanges in general.\nScholars and artists also worry that sharing authority devalues the hard-won expertise of professionals. The artist Fred Wilson, whose 1992-1993 exhibit \"Mining the Museum\" at the Maryland Historical Society is considered a landmark moment in museums' assessments of their role as historical arbiters, has expressed, \"I don't think people should share authority to the degree that you devalue your own scholarship, your own knowledge. That's not sharing anything. You're not giving what you have. That is highly problematic. You have to be realistic about your years of experience, what you can give, and what others can give.\"\nFurther reading\n* Adair, Bill, Benjamin Filene and Laura Koloski. Letting Go?: Sharing Historical Authority in a User Generated World. Philadelphia: The Pew Center for Arts & Heritage, 2011. See \"Pew Center for Arts & Heritage.\"\n*Bishop, Claire. \"[http://cam.usf.edu/CAM/exhibitions/2008_8_Torolab/Readings/The_Social_Turn_CBishop.pdf The Social Turn: Collaboration and Its Discontents].\" ARTFORUM.Feb. 2006.\n*Lubar, Steven. [https://www.scribd.com/document/76261769/Curator-Review-of-Letting-Go \"Books: Letting Go? Sharing Historical Authority in a User-Generated World.\"] Curator 55:2 (2012). 233-236.\n*Simon, Nina. The Participatory Museum. Santa Cruz: MUSEUM 2.0, 2010. Online version: http://www.participatorymuseum.org/read/\nReferences\nExternal links\n* [https://web.archive.org/web/20120425122951/http://www.phf.upenn.edu/99-00/hn-hr/philly.htm Black Bottom Performance Project]\n* [http://www.cityofmemory.org City of Memory]\n* [http://www.dennissevershouse.co.uk/ Dennis Severs' House]\n* [http://www.tenement.org/ Lower East Side Tenement Museum]\n* [http://www.mnhs.org/exhibits/openhouse Open House: If These Walls Could Talk]\n* [http://www.philaplace.org Philaplace]"
    }
  ]
}