{
  "content": [
    {
      "type": "text",
      "text": "# Shashikala Siriwardene\n\n|        birth_place = Colombo, Sri Lanka\n|            batting = Right-handed\n|            bowling = Right arm off spin\n|               role = All-rounder\n|      international = true\n|  internationalspan = 2003–2020\n|            country = Sri Lanka\n|       odidebutdate = 13 March\n|       odidebutyear = 2003\n|    odidebutagainst = West Indies\n|             odicap = 27\n|        lastodidate = 9 October\n|        lastodiyear = 2019\n|     lastodiagainst = Australia\n|           odishirt = 14\n|      T20Idebutdate = 21 April\n|      T20Idebutyear = 2010\n|   T20Idebutagainst = West Indies\n|            T20Icap = 17\n|       lastT20Idate = 2 March\n|       lastT20Iyear = 2020\n|    lastT20Iagainst = Bangladesh\n|              club1 = Slimline Sport Club Women\n|              year1 = 2003–\n|              club2 = Marians Ladies\n|              year2 = 2010–\n|              club3 = Sri Lanka Navy\n|              year3 = 2011–\n|              club4 = Supernovas\n|              year4 = 2020\n| columns            = 2\n| column1            = WODI\n| column2            = WT20I\n| matches1           = 118\n| matches2           = 81\n| runs1              = 2029\n| runs2              = 1097\n| bat avg1           = 18.44\n| bat avg2           = 17.14\n| 100s/50s1          = 0/7\n| 100s/50s2          = 0/1\n| top score1         = 68\n| top score2         = 52\n| hidedeliveries =\n| deliveries1        = 5449\n| deliveries2        = 1653\n| wickets1           = 124\n| wickets2           = 77\n| bowl avg1          = 28.84\n| bowl avg2          = 20.75\n| fivefor1           = 0\n| fivefor2           = 0\n| tenfor1            = 0\n| tenfor2            = 0\n| best bowling1      = 4/11\n| best bowling2      = 4/16\n| catches/stumpings1 = 41/–\n| catches/stumpings2 = 16/–\n| source             = [http://content-www.cricinfo.com/srilanka/content/player/54850.html ESPNcricinfo]\n| date               = 21 June 2021\n| medaltemplates = }}\n}}\nHettimulla Appuhamilage Shashikala Dedunu Siriwardene (born 14 February 1985 in Colombo, Sri Lanka), known as Shashikala Siriwardene, is a Sri Lankan former cricketer who captained the Sri Lankan women's cricket team in WODIs. She is Sri Lanka's only woman cricketer to take 100 wickets in WODIs, and the only female Sri Lankan to combine this with 1,000+ runs. She is also the all-time leading wicket taker for Sri Lanka in WT20I with 77 scalps. She played for Sri Lanka internationally in a career spanning 17 years, from 2003 to 2020.\nShe is also the longest serving member of the Sri Lankan women's cricket team and is also widely regarded as the mother figure of Sri Lankan women's cricket. She has captained Sri Lanka in two Women's Cricket World Cup campaigns, in 2009 and in 2013. She is a former student of President's College, Sri Jayawardenapura Kotte. Injury concerns kept her sidelined from international cricket towards the end of her career. In addition to her cricketing career, she has also worked as a human resource assistant for clothing firm Slimline. She is also attached with Sri Lanka Navy since 2011 and also represents Sri Lanka Navy in domestic circuit.\nEarly life\nShe started playing cricket at the age of nine at her residence in Kotikawatta where she was born and her father provided enormous support and guidance to take up the sport to the highest level. It was revealed she took interest in the sport after watching her brother playing street cricket with his friends in the streets. She was introduced to Palink Sports Club by her father's personal friend and played for the club until the age of 12.\nShe later joined the Slimline Sports Club in 2003. She joined the MAS Holdings in 2006 and served in the mercantile sector for two years. She also regularly featured in MAS Holdings team in annual mercantile cricket tournaments. She was graduated from the President's College, Sri Jayawardenapura Kotte where she also pursued athletics as there was no women's cricket team attached with the educational institute.\nPersonal life\nShe married Sri Lankan first-class cricketer Namal Seneviratne in 2013 at the age of 28. Initially both Siriwardane and Seneviratne were regarded as friends as they became good friends when they met for the first time in 2006/07 Mercantile Cricket Tournament when Siriwardane was representing MAS Holdings while Seneviratne was the assistant coach at the Mercantile Cricket Association. She also indicated that she was thoughtful about retiring from international cricket in 2013 after her marriage but her husband convinced her to continue to play for Sri Lanka.\nInternational career\nSiriwardene made her ODI debut against West Indies at Kingstown, St. Vincent in March 2003 at the age of 18 after being selected to the national pool in 2002. She took 2–20 and also scored a brisk 29 in that match, which was ultimately won by the Sri Lankans. Her international debut came at a time when women's cricket in Sri Lanka was not under the control of Sri Lanka Cricket Board until 2006.\nShe was part of the Sri Lankan side which became runners-up to India in the inaugural edition of the Women's Asia Cup in 2004. Her best bowling figures of 4–11 was recorded against Pakistan in the 2005–06 Women's Asia Cup in Karachi. Other notable performances include her 4–34 also against Pakistan in the 2006–07 Women's Asia Cup.\nShe made her debut World Cup appearance during the 2005 Women's Cricket World Cup. She was first appointed as the captain of the national team in December 2005. She made her captaincy debut at the age of 20 years in a group stage match against Pakistan as part of the 2005–06 Women's Asia Cup at Karachi which Sri Lanka eventually won by 14 runs. At the age of 20 years and 317 days, she became the youngest ever captain of Sri Lanka women's cricket team in WODIs as well as became the third youngest captain in Women's One Day Internationals.\nShe went onto captain the national team from 2005 to 2009 and then she pursued her second captaincy stint from 2010 to 2014. Under her captaincy, Sri Lanka emerged as runners-up in 2005–06 Women's Asia Cup, 2006 Women's Asia Cup, 2008 Women's Asia Cup to India in the finals.\nShe captained the side at the 2009 Women's Cricket World Cup where Sri Lanka failed to win a single game and was knocked out of the tournament. She was controversially axed from the Sri Lankan side for the 2009 ICC Women's World Twenty20 due to below par performances under her captaincy at the 2009 50 over World Cup. However, she was reinstated as captain of the Sri Lankan side after the 2009 ICC T20 World Cup and led the Sri Lankan side at the home T20 World Cup in 2012. She made her WT20I debut against West Indies in Caribbean on 21 April 2010.\nShe captained the Sri Lankan side at the 2013 Women's Cricket World Cup which was held in India. Under her captaincy, Sri Lanka qualified to Super Sixes stage for the first time ever in a Women's World Cup tournament whereas Sri Lanka sprung surprises with shocking upset victories over much fancied England and India sides during the group stage of the 2013 World Cup campaign. It also turned out to be the most successful Women's Cricket World Cup campaign for Sri Lanka. Her significant leadership was also instrumental in Sri Lanka's progress in women's cricket and was awarded the Women's Cricketer of the Year for 2013 at the annual Sri Lanka Cricket Awards.\nShe was ranked world's top women all-rounder in WT20Is in 2014. She was also selected to play for first ever Rest of the World XI women's team against the Marylebone Cricket Club women's team in a match which was held at Lord's on 19 May 2014. She was also part of the Sri Lankan team which secured bronze medal at the 2014 Asian Games after defeating China by 4 wickets in the bronze medal match. It was also her maiden appearance at an Asian Games event.\nSiriwardene has captained Sri Lanka Women in 49 WODI matches with 18 wins, 29 losses and 2 no results, and she is the Sri Lankan women cricketer to have captained internationally for most number of times. Despite her 38.29% winning percentage as captain, she is regarded as the best woman cricketer to play the game for Sri Lanka. Andrew Fidel Fernando who is a Sri Lankan correspondent to ESPNcricinfo website cited Siriwardane as Sri Lanka's first real woman cricketing star.\nShashikala is the second highest WODI run scorer for Sri Lanka with 2029 runs in 118 matches. This includes 7 WODI fifties as well, but she ended her career without a century. She is the highest WODI wicket taker for Sri Lanka as well, with 124 wickets including 6 four-wicket hauls. With this feat, Siriwardene is the first and only Sri Lankan women cricketer to get 100 wickets in WODI history.\nIn Women T20 Internationals, Siriwardene is second only to former captain Chamari Atapattu in most runs for Sri Lanka women. She has scored 1097 runs in 81 matches with a highest score of unbeaten 52 runs. In the bowling department, there is no one to match her, where she is top-ranked with 77 WT20I wickets with an average of 19.29. Siriwardene has captained T20I side as well with record of 31 matches. Sri Lanka have won 9 of them and lost 20 however with winning percentage of 31.03%.\nIn 2015, she was reappointed as the skipper of the Sri Lankan team and commenced her third stint as captain who resigned from the position in 2014 citing administration issues and hurdles. In 2015, she underwent rehabilitation for a period of four weeks after sustaining a thumb fracture injury during the third WODI between Sri Lanka and New Zealand and was subsequently replaced by her deputy Chamari Atapattu as the temporary captain of Sri Lankan team.\nOn 1 December 2016, she won the Sri Lanka Cricket awards for the Women's ODI all rounder of the Year 2016. She faced major injury scare ahead of the 2016 ICC Women's World Twenty20 tournament after sustaining an hamstring injury in a warmup match against India prior to the start of the tournament. However, she was available for team selection and captained the Sri Lankan side at the 2016 Women's T20 World Cup except for the final group stage match against South Africa after recovering from injuries. She was replaced by Chamari Atapattu as the stand-in captain for Sri Lanka in their last group stage match against South Africa which Sri Lanka won by 10 runs.\nIn August 2016, Siriwardane also met with an accident in Colombo after returning to cricket three and half months following the left hamstring injury which she sustained during the 2016 Women's T20 World Cup. She was diagnosed with bacterial infection after tearing her posterior anterior cruciate ligament. It was reported that she was riding her own bike which collided with a three-wheeler and the bike reportedly fell on her right knee after sliding towards a wall in the street. She underwent surgery in order to reconstruct her ACL and therefore missed out on to play against Australia and New Zealand in home bilateral international series as part of the ICC Women's Championship which began in 2017.\nDuring the 2017 ICC Women's Cricket World Cup she set the milestone for becoming the first woman cricketer to play in 100 WODI matches for Sri Lanka. The 2017 World Cup was the fourth and final World Cup appearance for Shashikala.\nIn October 2018, she was named in Sri Lanka's squad for the 2018 ICC Women's World Twenty20 tournament in the West Indies. Ahead of the tournament, she was named as one of the players to watch. She was the joint-leading wicket-taker for Sri Lanka in the tournament, with four dismissals in three matches. Following the conclusion of the tournament, she was named as the standout player in the team by the International Cricket Council (ICC). She captained the Sri Lankan team at the 2018 Women's T20 Asia Cup. She was named as best bowler and best allrounder in WT20Is at the 2019 Sri Lanka Cricket Annual Awards. In 2019, Sri Lanka Cricket offered her Group A contract following notable performances at international level.\nIn January 2020, she was named in Sri Lanka's squad for the 2020 ICC Women's T20 World Cup in Australia. On 2 March 2020, she announced that she would be retiring from international cricket following the T20 World Cup. She was the leading wicket-taker for Sri Lanka in the tournament, with seven dismissals in four matches. During the 2020 T20 World Cup, Indian women's team felicitated Shashikala with a signed jersey after the end of the group stage match between India and Sri Lanka. In the last group stage match against Bangladesh in the tournament she starred with the ball taking 4/16 in a winning cause and also received player of the match award for her performance which was also turned out to be her last international appearance. Prior to the 2020 ICC T20 World Cup, she was ranked at 6th position in ICC rankings for allrounders in WT20Is.\nFranchise career\nIn November 2020, she along with Chamari Atapattu played together for Supernovas in the 2020 Women's T20 Challenge which was held in Sharjah.\nCoaching career\nShe became a Level 1 coach with Sri Lanka Cricket after completing the Level 1 coaching program conducted by Sri Lanka Cricket and also had a brief stint of three years coaching cricket techniques to young schools girls at the Devi Balika Vidyalaya in Colombo.\nIncidents\nIn 2008, she along with four other Sri Lankan national women cricketers who were having central contracts with Sri Lanka Cricket claimed to have lost their day jobs at a clothing company called Slimline where all five of them reportedly worked at the same workplace. It was revealed that the company had threatened them to choose between job and cricket career.\nIn 2011, Shashikala told to BBC that the women cricketers might be recruited by Sri Lankan security forces including herself after Sri Lanka Cricket failed to find and secure sponsors for the women's cricket team. She then eventually joined the Sri Lankan Navy in the same year.\nIn 2018, former Sri Lankan women's cricket team head coach Hemantha Devapriya upon his resignation revealed that the increase in conflicts among senior players like Shashikala and Chamari led to the downfall of women's cricket in Sri Lanka.\nIn March 2021, she criticised the Sri Lanka cricket selectors for being incompetent about making policies and strategies towards taking women's cricket to next stage and admitted the fact that the selectors are not convinced with her continue to play for Sri Lanka Navy club in women's inter-club limited overs competition.\nReferences\nExternal links\n*\n*\n}}"
    }
  ]
}