{
  "content": [
    {
      "type": "text",
      "text": "# Shaun Edwards\n\n|birth_place         = Wigan, Lancashire, England\n|death_date          =\n|death_place         =\n|height              =\n|weight              =\n|retired             = yes\n|position            =\n|club1               = Wigan\n|year1start          = 1983\n|year1end            = 97\n|appearances1        = 466\n|tries1              = 274\n|goals1              = 23\n|fieldgoals1         = 4\n|points1             = 1146\n|club2               =\n|year2start          = 1989\n|year2end            =\n|appearances2        = 12\n|tries2              = 1\n|goals2              = 0\n|fieldgoals2         = 0\n|points2             = 4\n|club3               = London Broncos\n|year3start          = 1997\n|year3end            =\n|appearances3        = 24\n|tries3              = 13\n|goals3              = 0\n|fieldgoals3         = 0\n|points3             = 52\n|club4               =\n|year4start          = 1998\n|year4end            =\n|appearances4        = 12\n|tries4              = 5\n|goals4              = 0\n|fieldgoals4         = 0\n|points4             = 20\n|club5               =\n|year5start          = 1999\n|year5end            = 00\n|appearances5        = 28\n|tries5              = 10\n|goals5              = 1\n|fieldgoals5         = 0\n|points5             = 42\n|teamA               =\n|yearAstart          = 1985\n|yearAend            = 94\n|appearancesA        = 36\n|triesA              = 15\n|goalsA              = 0\n|fieldgoalsA         = 0\n|pointsA             = 60\n|teamB               = Lancashire\n|yearBstart          = 1985\n|yearBend            = 91\n|appearancesB        = 3+1\n|triesB              = 2\n|goalsB              = 0\n|fieldgoalsB         = 0\n|pointsB             = 8\n|teamC               = England\n|yearCstart          = 1995\n|yearCend            = 96\n|appearancesC        = 3\n|triesC              = 1\n|goalsC              = 0\n|fieldgoalsC         = 0\n|pointsC             = 4\n|teamD               = Ireland\n|yearDstart          = 1998\n|yearDend            =\n|appearancesD        = 1\n|triesD              = 2\n|goalsD              = 0\n|fieldgoalsD         = 0\n|pointsD             = 8\n|ru_coachteam1       =\n|ru_coachyear1start  = 2001\n|ru_coachyear1end    = 11\n|ru_coachteamA       = Wales (defence)\n|ru_coachyearAstart  = 2008\n|ru_coachyearAend    = 19\n|ru_coachteamB       = France (defence)\n|ru_coachyearBstart  = 2020\n|ru_coachyearBend    = present\n|source              =\n|updated             = 7 March 2021\n| module       =\n}}\nShaun Edwards, OBE (born 17 October 1966) is an English rugby union coach and former rugby league player, who is the defence coach for the France national team. A  or , Edwards is the most decorated player in rugby league history, with 37 winner's medals. In 2015, he was the 25th person inducted into the Rugby League Hall of Fame.\nAt schoolboy level, he captained England in both rugby league and rugby union. He played for Wigan in the Championship and Super League between 1983 and 1997, and also had spells with Balmain Tigers, London Broncos (twice) and Bradford Bulls. Playing for Wigan, Edwards won a record eight championships, and a record nine Challenge Cups. In total he played in eleven Challenge Cup finals, also a record. He was voted Man of Steel in 1990 and is an inductee of the Wigan Hall of Fame.\nEdwards played 36 times for Great Britain, as well as for England in 1995 and 1996 and Ireland in 1998. In all, he appeared in three Rugby League World Cups.\nAfter retiring from playing he joined London Wasps in rugby union as assistant coach in 2001, and was head coach from 2005 to 2011. During his time at the club, they won two Heineken Cups, four Premiership titles, an Anglo-Welsh trophy and the European Challenge Cup.\nIn 2008, he became Wales' defence coach, and won four Six Nations championships, including three Grand Slams. He was also defence coach for the British & Irish Lions on their tour of South Africa in 2009. He joined France in 2020 and won the Grand Slam in 2022 and the Six Nations title in 2025.\nEarly life\nEdwards was born in Wigan, Lancashire, England. His father, Jackie Edwards, played for Warrington from 1955 to 1964, as a  or , until a severe spinal injury ended his career prematurely at age 24. His uncle Bobby Edwards played one match for Warrington in the halves against New Zealand at Wilderspool Stadium on Saturday 23 September 1961.\nEdwards was England schoolboy captain at both rugby league and rugby union, and had been pursued by several clubs.\nHis younger brother, Billy-Joe, also played rugby league for Wigan until his death, in a car crash, in 2003. His son James was an academy player at Wasps and played at scrum-half. Edwards is a Roman Catholic, and his uncle, Fr John Johnson, was the sub-dean of Wigan and the parish priest of St John's and St Mary's churches in the town until he retired in 2023.\nPlaying career\nEdwards signed for Wigan in a blaze of media coverage on his seventeenth birthday; for a fee of £35,000, the largest in history for a schoolboy player. He made his début for the club at  in their 30–13 home victory over York on 6 November 1983, 20 days after signing for Wigan. Later in the season Wigan reached the final of the 1984 Challenge Cup, and Edwards played at fullback in their loss to Widnes.\nIn the 1984–85 season, Wigan reached the 1985 Challenge Cup Final and Edwards played at , scoring a try in his side's victory.\nEdwards played in Wigan's 1987 World Club Challenge victory over Sydney's Manly-Warringah Sea Eagles. Edwards played for Sydney club the Balmain Tigers when they reached the 1989 NSWRL season's grand final, for which he was selected on the interchange bench.\nIn 1990, Edwards received the Man of Steel Award after he played most of the Challenge Cup Final against Warrington with a broken cheekbone and eye socket, after receiving a high, off the ball tackle in the 10th minute. He refused to be substituted and played on to set up three of Wigan's tries. Despite his performance, the Man Of The Match award went to his half back partner Andy Gregory. He played in Wigan's 1991 World Club Challenge victory over Sydney's Penrith Panthers.\nEdwards finished the 1991–92 season as the league's leading try scorer with a total of 40. He matched Wigan's record for most tries in a single match (10) in the 78–0 rout of Swinton in the Lancashire Cup 2nd round in September 1992. It was a County Cup record and record for a non-winger in any game. In addition, he scored four tries in a game on four occasions and hat-tricks seven times. During the 1992–93 season, Edwards played at scrum half for defending RFL champions Wigan in the 1992 World Club Challenge against the visiting Brisbane Broncos. He played in Wigan's 1994 World Club Challenge win over the Brisbane Broncos in Australia which attracted a World Club Challenge record attendance of 54,220 and also played in the first game of the 1996 cross-code challenge series against Bath.\nEdwards played in every round of Wigan's eight consecutive Challenge Cup wins. Altogether he made 452 appearances for Wigan, he played his last game for the club against St. Helens in the Challenge Cup defeat at Knowsley Road in 1997. Edwards left Wigan that year to move near his son James, signing for the London Broncos. He fell out with new coach Eric Hughes, who refused Edwards permission to miss the first training session of each week, in order for him to spend time with his son in London. The decision to allow Edwards to leave the club led to multiple complaints from Wigan fans.\nAfter just a season in London, Edwards moved to Bradford Bulls but after only a few months returned to London, where he led the London Broncos to the 1999 Challenge Cup final at Wembley. He retired in 2000.\nInternational\nEdwards was the youngest ever player to play for Great Britain when he played against France in 1985. His political views meant that on a Great Britain Lions tour, Edwards taped over the British Coal logo on his jersey in support of the miners' strike. He was selected to go on the 1988 Great Britain Lions tour, but injured his knee in the first game of the tour against Papua New Guinea, and took no further part. He captained Great Britain for the first time in 1990, and was also selected to go on the 1992 Great Britain Lions tour.\nHe was sent off for a high tackle on Bradley Clyde in the first Ashes test match of 1994 at Wembley. He played for Great Britain 36 times, starting 32 games with a further four from the substitutes bench, and scored 16 tries.\nEdwards was England's captain for the 1995 World Cup tournament, but ruled himself out of the final against Australia with an infected knee.\nCoaching career\nIn 2001, Edwards joined London Wasps in rugby union as a defence and backs coach, taking over as head coach in 2005 after Warren Gatland returned to New Zealand. Wasps won the English Rugby Union Championship three times in succession, in 2003, 2004 and 2005, and the Heineken Cup in 2004. During his reign as Head Coach, London Wasps won the Anglo-Welsh Cup in 2006, the Heineken Cup in 2007 and the English Rugby Union Championship in 2008.\nEdwards teamed up with Gatland again, after the latter was appointed head coach of : Edwards had been offered the job of coaching England's second-tier side, England Saxons, but preferred the assistant coach position with Wales. Former  player Matt Dawson stated that it was \"a crime\" that England lost him to Wales and described him as \"the best coach in the world\". Edwards left his position at London Wasps in November 2011.\nSince joining the Wales coaching team, Edwards has helped the nation to Grand Slam wins in 2008, 2012 and 2019 as well the Six Nations title in 2013. Wales also reached the last four of the 2011 Rugby World Cup in New Zealand. In Edwards' first Six Nations Wales, he conceded just two tries on their way to the title and in 2013–14 Wales went more than 400 minutes in the tournament without conceding a try. He was named Rugby World International Coach of the Year in 2008.\nHe was defence coach for the British & Irish Lions on their tour of South Africa in 2009.\nOn 8 August 2018, it was announced that Edwards would return to rugby league to coach his former club Wigan Warriors in 2020, after completing his commitments with Wales. He described it as an opportunity too special to turn down. However, in March 2019, he stated that he had not signed a contract with Wigan, despite already posing for press photographs and conducting interviews at Wigan's ground about this role, instead signing up as France defence coach early 2020. His decision not to take the role at the Warriors was not popular with fans, and Edwards himself acknowledged it had affected his legacy at the club.\nPersonal life\nEdwards had a long-term relationship with M People singer Heather Small, with whom he has a son, Labour Party councillor and London Assembly member James Small-Edwards. Although no longer together, a key factor in his moving to the south was that he could be close to his son. When offered the job of coaching the Great Britain rugby league team, he turned it down because it would mean being in the north a lot of the time, away from his family.\nHe is the patron of Looseheadz, a charity raising awareness for mental health.\nHonours\nClub\nWigan\n*World Club Challenge (3): 1987, 1991, 1994\n*Championship (8): 1986–87, 1989–90, 1990–91, 1991–92, 1992–93, 1993–94, 1994–95, 1995–96\n*Challenge Cup (9): 1985, 1988, 1989, 1990, 1991, 1992, 1993, 1994, 1995\n*Lancashire Cup (5): 1985–86, 1986–87, 1987–88, 1988–89, 1992–93\n*Premiership (5): 1986–87, 1991–92, 1993–94, 1994–95, 1996\n*League Cup (7): 1985–86, 1986–87, 1988–89, 1989–90, 1992–93, 1994–95, 1995–96\nAs head coach\n;Wasps\n*Heineken Cup (1)\n*Premiership (1)\n*European Challenge Cup (1)\nAs assistant coach\n;Wasps\n*Heineken Cup (1)\n*Premiership (3)\n;Wales\n*Six Nations (4)\n;France\n*Six Nations (2)\nIndividual\n*Man of Steel: 1989–90\nOrders and awards\n*Officer of the Order of the British Empire OBE\n*Wigan Warriors Hall of Fame\n*Rugby League Hall of Fame\nReferences\nExternal links\n*\n*[http://wigan.rlfans.com/readarticle.php?article_id=361 Statistics at wigan.rlfans.com]\n*(archived by web.archive.org) [https://web.archive.org/web/20110605082632/http://www.wasps.co.uk/PlayerDisplay.ink?skip=2&season=07/08&squadno=6681&seasonl=2007/2008&Playertype=C Wasps profile]\n*(archived by web.archive.org) [https://web.archive.org/web/20080211120320/http://www.wru.co.uk/2634_16474.php Wales profile]\n*(archived by web.archive.org) [https://web.archive.org/web/20080117031650/http://www.wasps.co.uk/newspage.ink?nid=28851 Edwards takes Wales job]\n*(archived by web.archive.org) [https://web.archive.org/web/20100114184857/http://totalrl.com/features/content.php?feat_id=276&featcat_id=32 Crooks in trouble]\n*(archived by web.archive.org) [https://web.archive.org/web/20100114184847/http://totalrl.com/features/content.php?feat_id=270&featcat_id=32 When Britain defeated the Aussies]\n}}"
    }
  ]
}