{
  "content": [
    {
      "type": "text",
      "text": "# Sheffield War Memorial\n\nThe Sheffield War Memorial also known as Sheffield Cenotaph, is a Grade II* listed war memorial located at Barker's Pool, Sheffield, standing to the south of Sheffield City Hall, which is also Grade II* listed.\nBackground\nThere was much debate about the appropriate location and format for a war memorial in Sheffield after the First World War.  A committee considered fourteen serious suggestions, including an obelisk at the junction of Bow Street and Church Street.  Eventually a decision was made for a memorial to be constructed in Barker's Pool, with the demolition of shops to the north of Barker's Pool to create a suitable location.  A design competition was opened to architects working in Sheffield, which was won by Charles Denny Carus-Wilson, then head of the School of Architecture at the University of Sheffield.  He had served with the Middlesex Yeomanry and was awarded the Military Cross; the memorial was his first significant public project.  The £5,435 cost of the memorial was raised from public donations.\nDescription\nThe memorial is made up of a cenotaph with a  high flagpole. The central flagpole is a ship's mast, made of mild steel by Earle's Shipbuilding of Hull.  It is painted white, and topped by a gilded ball and crown.\nThe pole is supported by a  bronze base by sculptor George Alexander, cast by the Parlanti foundry.  It includes four statues of soldiers, standing with heads bowed and rifles reversed, above an octagonal section.  The base also shows four emblems - the British Army, the Royal Navy, the Royal Air Force, and the coat of arms of the city of Sheffield - facing the cardinal directions, and also the badges of the eight army units: the Queen's Own Yorkshire Dragoons, the Royal Artillery, the Royal Engineers, the Machine Gun Corps, the Tank Corps, the York and Lancaster Regiment, the Royal Army Medical Corps, and the Royal Army Service Corps.  The bronze base stands on an octagonal plinth of Derbyshire Hopton Wood stone, surrounded by circular paving to form a traffic island. The original design featured four female figures between the male figures, but they were left out to reduce the cost.\nThe memorial was unveiled on 28 October 1925 by General Sir Charles Harington, GOC Northern Command, and it was dedicated by the Bishop of Sheffield Leonard Burrows.\nThe memorial suffered shrapnel damage from bombing in the Second World War, which was left unrepaired.  Further dates were added around the plinth after the Second World War.  It became a listed building in 1983, upgraded to Grade II* in 2016.\nThe memorial was restored after Barkers Pool was closed to traffic in 1989. Further restoration work took place in 2005, and the flag raising mechanism was replaced.\nIncidents\nIn October 2009, a drunken Sheffield Hallam University student was photographed urinating on the memorial, during a night of heavy drinking organised for students by Carnage UK. The photograph was published by the Daily Mail's website, generating widespread public anger, and the student identified as 19-year old Philip Laing of Macclesfield, Cheshire. He was subsequently charged by police, and admitted to outraging public decency. Laing had been warned of the possibility of a jail sentence; however, in court, a judge sentenced him to 250 hours' community service. He was also ordered to pay costs of £185.\nOther memorials\nOther war memorials in central Sheffield include a War Memorial Hall which opened at Sheffield City Hall in 1932 with a Roll of honour recording 5,000 names, and the York and Lancaster Regiment War Memorial in Weston Park.\nThe Sheffield City Battalion Memorial, commemorating the Sheffield Pals of the 12th Service Battalion, York and Lancaster Regiment, is located in Serre-lès-Puisieux in the French Pas-de-Calais, between Albert, in the Somme, and Arras.\nSee also\n*Grade II* listed war memorials in England\nReferences\nExternal links\n* [http://sheffieldww1memorials.co.uk/Memorial/Sheffield_War_Memorial.html Sheffield War Memorial]\n* [https://rupertharris.com/products/the-cenotaph-sheffield The Cenotaph, Sheffield], Rupert Harris Conservation\n* [http://www.iwm.org.uk/memorials/item/memorial/2220 Sheffield City Hall - WW1], Imperial War Museums\n* [https://www.warmemorialsonline.org.uk/memorial/120351 Sheffield], War Memorials Online\n* [http://www.warmemorials.org/search-grants/?gID=597 Sheffield (Barker's Pool)], War Memorials Trust"
    }
  ]
}