{
  "content": [
    {
      "type": "text",
      "text": "# Sheikh Anwarul Haq\n\n| successor2          = Wasim Sajjad\n| office3             = Senior Justice of the Supreme Court of Pakistan\n| term_start3         = 16 October 1972\n| term_end3           = 23 September 1977\n| nominator3          = Zulfikar Ali Bhutto\n| appointer3          =\n| predecessor3        =\n| successor3          =\n| pronunciation       =\n| birth_name          = Sheikh Anwarul Haq\n| birth_date          =\n| birth_place         = Jullundur, Punjab, British India\n| death_date          =\n| death_place         = Lahore, Punjab, Pakistan\n| alma_mater          = Punjab University\n| occupation          =\n| profession          = Jurist\n| religion            =\n| native_name         =\n}}\nSheikh Anwarul Haq (Punjabi and }}&lrm;; 11 May 1917 – 3 March 1995), was a Pakistani jurist and an academic who served as the 9th Chief Justice of Pakistan from 23 September 1977 until resigning on 25 March 1981. He signed the death warrant for former Prime Minister Zulfikar Ali Bhutto in a controversial murder case. Bhutto was executed on 4 April 1979.\nEducated as an economist at the DAV College and the Punjab University in Lahore, he served as a civil servant of the Indian Civil Service as an appointee to lead the municipal governance in the British India in 1944. He continued serving in the civil service after the independence of Pakistan as a result of partition of British India in 1947 and subsequently elevated as a judge in the Sindh High Court in 1957. In 1962, Haq was nominated to serve on the Supreme Court and later appointed as Chief Justice of Lahore High Court in 1970 before his reappointment as a Senior Justice of the Supreme Court of Pakistan in 1971. He 1972, he earned public and international notability when he co-chaired the War Enquiry Commission with Chief Justice Hamoodur Rahman to investigate the economic and military collapse of Pakistan in a war against India in 1971 that led to the separation of East Pakistan as Bangladesh.\nHaq was known for his judicial conservative philosophical leanings and is noted in country's political history for providing legality for the martial law upheld by chief of army staff General Zia-ul-Haq to restore law and order, in light of doctrine of necessity, as part of his conservative leanings. He also heard the case of Zulfikar Ali Bhutto as Chief Justice of the Supreme Court of Pakistan and constituted a 7-member (7 supreme court judges) bench to decide on the appeal of the capital sentence by the Lahore High Court for authorizing the death sentence of the ex-Prime Minister of Pakistan.\nAfter the death sentence of Zulfiqar Ali Bhutto, who was convicted of murdering through proxy  the father of one of his political opponents, Anwarul Haq took up the case against General Zia-ul-Haq's breaking his promise of holding elections. General Zia-ul-Haq introduced the PCO to legitimise his rule to by-pass the issues presented with this case and asked all the judges to sign an agreement accepting the PCO. Haq refused to take an oath under the imposed PCO, resigning on conscientious grounds. Anwarul Haq mobilised other like minded judges in the Supreme Court and High Courts to reject the proposed PCO by not signing the PCO. He was removed as Chief Justice of the Supreme Court of Pakistan due to his refusal to sign the PCO.\nBiography\nEarly life and public service\nSheikh Anwarul Haq was born in Jullunder, Punjab, British India on 11 May 1917, to a Punjabi family. He earned early education from Jullunder and Wazirabad, passing his matriculation from Jullunder in 1932. He stood first in matriculation that earned him a scholarship to attend the DAV College in 1932. In 1936, he earned BA in Economics and Political science and went on to attend the D.A.V. College, Lahore of Punjab University, where he earned an MA in Economics in 1938. He ranked first in MA in Economics examination at the Punjab University, setting a new record in that subject. He also did his LLB from there.\nDuring his time at the Punjab University, Haq participated in a large number of declamation contests and prize debates and was often judged as the best speaker. From 1936 to 1938, he was an activist of All-India Muslim League and was a student advocate of the assertion of the separate identity of the Muslims of India. He attended the All-India Muslim League meeting in Calcutta in December 1937 as a student delegate.\nIn 1939, he was selected and joined the Indian Civil Service and went to United Kingdom to be educated in Oxford. Upon returning in 1940, he was appointed Assistant Commissioner at Ferozepur and later appointed as Undersecretary of Punjab and the North-West Frontier from 1942 until 1944. In 1944, he was appointed as Sub Divisional Magistrate at the Dalhousie, India and heard various cases involving the civil lawsuits. During the same time, he was sent to Gurdaspur and was appointed as Deputy Commissioner and later elevated as Session Judge as well as Assistant Commissioner in 1946. For a short brief of time, he served as the deputy commissioner of Hissar (in East Punjab) in 1946, before joining the Cabinet Mission to be served as its Secretary to the Partition Steering Committee for the Punjab in 1947.\nAfter the establishment of Pakistan as a result of partition of British India, Haq opted for Pakistan and was appointed as deputy commissioner of Rawalpindi, Punjab, Pakistan. During this time, he worked towards managing the Indian emigrants settling in Pakistan. From 1948 to 1952, he served in the bureaucracy as deputy commissioner of Montgomery and Sialkot.\nIn 1952, he joined the Ministry of Defence (MoD) as its deputy secretary until 1954 when he left for the United Kingdom to attend the Imperial Defence College in London. In 1956, he earned the degree and secured his graduation from the Imperial Defence College and subsequently returned to Pakistan. He was appointed as joint secretary in MoD but later moved to Ministry of Law and Justice (MoLJ) to pursue career as federal judge.\nSupreme court and chief justice\nIn 1957, he was elevated as district-session judge in Sindh High Court but later moved to Lahore High Court in Punjab in 1958. In 1959, he was appointed as a judge in the West Pakistan High Court[now Just Pakistan] and moved on to the Supreme Court as a senior justice in 1962. In 1965, he was appointed as the deputy leader of the Pakistan Delegation to the Third Commonwealth and Empire Law Conference held at Sydney, Australia in 1965. In 1967, he was appointed as a member of the Law Reform Commission led by Chief Justice Alvin Robert Cornelius that conducted the various case studies on land reforms in Pakistan.\nIn 1969, he was selected to lead a Legal Expert Delegation to Somalia to provide expertise in overviewing the constitutional crises in Somalia. In 1970, he was elevated as Chief Justice of the Lahore High Court by President Yahya Khan who issued the decree, the LFO No. 1970 that dissolved the status of West Pakistan. He witnessed the war between India and Pakistan which resulted in the liberation of Bangladesh.\nOn 26 December 1971, he was named as a member of the War Enquiry Commission (WEC) along with Chief Justice Hamoodur Rahman, and the chief justices of the Sindh, Balochistan, and Punjab High Court, formed by the Chief Justice Rahman on the request of then-President Zulfikar Ali Bhutto. On 1 January 1972, he was re-elevated as the senior justice at the Supreme Court.\n{| class=\"wikitable\" style=\"width:100%;\"\n! span=col style=\"width:7%;\" | Temporal Order\n! span=col style=\"width:57%;\" | Name of Post\n! span=col style=\"width:18%;\" | From\n! span=col style=\"width:18%;\" | To\n|-\n|1||Secretary to the Punjab and North-West Frontier Province Public Service Commission. Secretary to Government of Punjab, Pakistan, Medical & Local Government Department||22 February 1944||29 February 1944\n|-\n|2||Under-Secretary to Government of Punjab, Pakistan Revenue Department, Lahore||1 March 1944||1 May 1944\n|-\n|3||Sub-Divisional Magistrate, Dalhousie, India||2 May 1944||\n|-\n|4||Special Sub-Judge at Lahore for Judicial training||9 November 1944||\n|-\n|5||Sub-Divisional Magistrate, Dalhousie||28 May 1945||\n|-\n|6||Deputy Commissioner, Gurdaspur, India||June 1945||July 1945\n|-\n|7||District and Sessions Judge, Gurdaspur||3 November 1945||\n|-\n|8||Assistant Commissioner, Gurdaspur||23 February 1946||\n|-\n|9||Deputy Commissioner, Hisar, India||27 March 1946||\n|-\n|10||Secretary to the Partition Steering Committee for Punjab, Pakistan||9 July 1947||\n|-\n|11||Deputy Commissioner, Rawalpindi, Pakistan||8 August 1947||\n|-\n|12||Deputy Commissioner, Montgomery (now Sahiwal), Pakistan||October 1948||\n|-\n|13||Deputy Commissioner, Sialkot||April 1950||\n|-\n|14||Deputy Secretary, Ministry of Defence, Government of Pakistan, Rawalpindi||January 1952||December 1954\n|-\n|15||Training at Imperial Defence College (IDC), London||January 1955||December 1955\n|-\n|16||Deputy Secretary, Ministry of Defence, Government of Pakistan, Karachi||August 1956||\n|-\n|17||Joint Secretary, Ministry of Defence, Government of Pakistan, Karachi||August 1956||\n|-\n|18||District and Sessions Judge, Karachi||February 1957||\n|-\n|19||District and Sessions Judge, Lahore||June 1958||\n|-\n|20||Additional Judge, High Court of West Pakistan, Lahore||24 October 1959||\n|-\n|21||Permanent Judge, High Court of West Pakistan, Lahore||24 October 1962||\n|-\n|22||Member of the Law Reforms Commission||May 1967||\n|-\n|23||Acting leader of the legal expert delegation to the Republic of Somalia||July 1969||\n|-\n|24||Chief Justice Lahore High Court, Lahore, on dismemberment of One Unit||1 July 1970||\n|-\n|25||Judge, Supreme Court of Pakistan||16 October 1972||\n|-\n|26||Chief Justice of Pakistan||23 September 1977||25 March 1981\n|-\n|27||11th President of Pakistan||20 April 1978||7 May 1978\n|}\nOther\nHaq attended the Third Commonwealth and Empire Law Conference in Sydney, Australia in August–September 1965 as leader of the Pakistan delegation. He was interested in academic and educational activities and had been a member of the Syndicates of:\n* Punjab University\n* University of Engineering and Technology, Lahore\n* University of Agriculture, Faisalabad in Lyallpur (now called Faisalabad)\n* Allama Iqbal Open University, Islamabad\nSee also\n*Chief Justice of Pakistan\n*Supreme Court of Pakistan\n*List of Pakistanis\nReferences"
    }
  ]
}