{
  "content": [
    {
      "type": "text",
      "text": "# Shelfield, Warwickshire\n\n| civil_parish = Aston Cantlow\n| shire_county = Warwickshire\n}}\nShelfield (Medieval Latin: Scelfeld, Old English: Scylfhyll, Middle English: Shelfhull) is a hamlet in the parish of Aston Cantlow, Warwickshire. While a small hamlet today, Shelfield was its own manor throughout the 14th and 15th centuries. Containing about a dozen cottages, Shelfield today is best known for its culture of equestrianism, its handful of Grade II listed buildings, and until 2013 it was also a home to the Baron Kilmaine. The name Shelfield has its linguistic roots in Old English words scylf and hyll, which translate as 'shelf' and 'hill' respectively, and so the name could be translated as 'shelf hill' or 'hill with a plateau.' While this Shelfield in Warwickshire is not listed in the Domesday Book, another Shelfield in Staffordshire is mentioned as containing a hide of waste belonging to the Manor of Walsall.\nTransliterating the Domesday Book Latin the entry reads: In Scelfeld est hida vasta pertinens eidem Manerio. In English: In Shelfield there is one hide of waste appertaining to the said Manor. This interpretation is further justified by a 1469 quitclaim in Walsall which records a witness named Richard Scelfelde; implying 'Scelfelde' is the ablative form of Scelfeld denoting \"Richard of Shelfield.\" As such, we see the name Shelfield not only in Old English, but also now in Latin.\nHistory of Shelfield\nShelfield had constituted a part of the larger manor of Aston Cantlow in its earliest history, but it was regarded as its own manor throughout the 14th and 15th centuries. It is not a manor listed in the Domesday Book, however historians believe it was originally the woodland referred to in the Domesday Book entry for Aston Cantlow. It would seem, however, that Shelfield had at one point also contained what is now Shelfield Park. There was some land in Shelfield which \"was already imparked by the middle of the 13th century, when the second William de Cantilupe granted to Studley Priory all his assets without the park there as bounded by the road from Spernall to Aston Cantlow.\" Today, several historic buildings remain standing. Shelfield Lodge is said to be the old manor house, likely built by the Skinner family circa 1600. Then there is Shelfield House which was likely also built by the Skinner family, although it was built circa 1700.\nLordship of Shelfield\nThe Manor of Shelfield has a more obscure history than most. Although, few records survive that explicitly document the descent of the manor and the lordship of Shelfield, it is clear that it initially devolved from the chief manor of Alston sometime around 2 July 1314 when William le Walsse is first recorded as holding a plot called \"Shelfhull.\" It's these Inquisitions which record that \"Shelfhull\" (i.e. Shelfield) comprised a sixth of a knight's fee, held by William le Walsse (alius le Walsh) in 1314 and 1325, and again by a William Walsh in 1376. William held Shelfield from John de Hastings. As such, the de Hastings family owned the manor of Shelfield, and by 1376 it was eventually passed to John Hastings widow, Anne Hastings. Anne Hastings's only son was John de Hasings, who died childless. As such, he was succeeded by his first cousin once removed, William de Beauchamp, in 1390.\nThen the last official public record documenting the manor of Shelfield was upon the death of Joan Beauchamp, (the wife of William de Beauchamp, and the daughter of Richard Fitzalan), on 14 November 1435. She was recorded as holding the manor of Shelfield. Yet, according to Thomas Horsfield, Shelfield seems to have then passed to Edward Neville. Unofficial private records suggest the last Lord of the Manor was a Robert Skinner, who died in 1530. Robert's daughter, Katherine Skinner, married a Sir Nicholas Fortescue (appointed Keeper of the Park of Malwyke in 1537), and this is recorded in the Fortescue family history, noting that Robert was \"Lord of the Manor of Shelfield.\" Robert's age is unknown so we cannot know for sure when he came to acquire the title. But as the manorial lands remained in the Neville family until the 19th century, if Robert Skinner was in fact the Lord of Shelfield, then this would suggest that the lordship title itself had been detached from the manor when it passed to Robert; where Robert kept the title, and Lord Bergavenny kept the land.\nAlthough only extent in Thomas Fortescue's book, this was the last time the title had been used. Further evidence that the lordship of Shelfield was detached from the manor of Shelfield is found in the fact that Lord Bergavenny was the Lord of Great Wilmcote, while part of the Shelfield lands then passed to George Gibbs of Wilmcote and Adam Palmer of Aston Cantlow, who jointly held the manor of Great Wilmcote since 1561. Then in 1742 the open fields of Shelfield were inclosed by an Act of Parliament – creating a legal right to private ownership of once common lands. However, the title to the Lordship of Shelfield was successfully restored to the 9th Lord of the Manor, and a descendant of the aforementioned Gibbs family. As a wedding gift he subsequently gave the title to his fiancé, who is now the sua jure 10th Lady of the Manor of Shelfield.\nReferences"
    }
  ]
}