{
  "content": [
    {
      "type": "text",
      "text": "# Shelly Beach, Queensland (Sunshine Coast)\n\n| pop                 = 925\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4551\n| area                = 0.5\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 2.6\n| dir1                = NE\n| location1           = Caloundra CBD\n| dist2               = 111\n| dir2                = NNE\n| location2           = Brisbane CBD\n| dist3               =\n| dir3                =\n| location3           =\n| dist4               =\n| dir4                =\n| location4           =\n| lga                 = Sunshine Coast Region\n| county              = Canning\n| parish              = Bribie\n| stategov            = Caloundra\n| fedgov              = Fisher\n| near-n              = Moffat Beach\n| near-ne             = Coral Sea\n| near-e              = Coral Sea\n| near-se             = Coral Sea\n| near-s              = Kings Beach\n| near-sw             = Kings Beach\n| near-w              = Moffat Beach\n| near-nw             = Moffat Beach\n}}\nShelly Beach is a coastal suburb of Caloundra in the Sunshine Coast Region, Queensland, Australia. In the , Shelly Beach had a population of 925 people.\nGeography\nThe suburb presumably takes its name from the beach known as Shelly Beach () along the suburb's coastline.\nHistory\nOur Lady of the Rosary Catholic School opened on 29 January 1980 by the Sisters of St Joseph, but is now under lay leadership.\nDemographics\nIn the , Shelly Beach had a population of 854 people.\nIn the , Shelly Beach had a population of 925 people.\nEducation\nOur Lady of the Rosary School is a Catholic primary (Prep–6) school for boys and girls at 63 Edmund Street (corner of Alfred Street, ). In 2017, the school had an enrolment of 313 students with 22 teachers (19 full-time equivalent) and 14 non-teaching staff (8 full-time equivalent).  In 2018, the school had an enrolment of 334 students with 23 teachers (20 full-time equivalent) and 15 non-teaching staff (10 full-time equivalent). In 2022, the school had 348 students with 24 teachers (19.1 full-time equivalent) and 17 non-teaching staff (12.8 full-time equivalent).\nThere are no government schools in Shelly Beach. The nearest government primary and secondary schools are Caloundra State School and Caloundra State High School, both in Caloundra CBD to the west.\nReferences\nExternal links\n*"
    }
  ]
}