{
  "content": [
    {
      "type": "text",
      "text": "# Shelsley Kings\n\n| os_grid_reference    =\n| post_town            = Worcester\n| postcode_area        = WR\n| postcode_district    = WR6\n| dial_code            =\n| shire_district       = Malvern Hills\n| shire_county         = Worcestershire\n| hide_services        = Yes\n| population           = 189\n| population_ref       = (Parish, 2021)\n}}\nShelsley Kings is a civil parish in the Malvern Hills district of Worcestershire, England. The parish is rural, containing several small hamlets and farms, but no village. It lies  north-west of Worcester. At the 2021 census the parish had a population of 189. It shares a grouped parish council with the neighbouring parishes of Shelsley Beauchamp and Shelsley Walsh, which are collectively known as the Shelsleys.\nHistory\nThe Domesday Book of 1086 lists two manors at Shelsley, which was in the Doddingtree hundred of Worcestershire. By the early 13th century, these two manors were owned by the Beauchamp family and the Walsh family, and so became known as Shelsley Beauchamp (or Great Shelsley) east of the River Teme, and Shelsley Walsh (or Little Shelsley) west of the Teme.\nThe Shelsley Kings area was not part of either of the Shelsley manors, but instead formed a detached part of the manor of Martley, which was owned directly by the king at the time of the Domesday Book and remained in royal ownership until 1196.\nIn terms of parishes, the Shelsley area was anciently part of the parish of Martley. There was a chapel of ease at Shelsley Beauchamp by 1194, when the lord of the manor, Simon Beauchamp, managed to get the chapel raised to the status of a parish church, making Shelsley Beauchamp a separate parish from Martley. There were disputes for many years afterwards about whether the parish of Shelsley Beauchamp only covered the manor, or whether it also included the Shelsley Kings area to the north. An agreement was eventually reached in 1420, which confirmed that the Shelsley Kings area was part of the parish of Shelsley Beauchamp, but that two thirds of the tithes collected from Shelsley Kings should be paid to the rector of Martley and only one third paid to the rector of Shelsley Beauchamp.\nThe pattern of treating Shelsley Kings differently from the rest of Shelsley Beauchamp parish continued when parishes were given various civil functions under the poor laws from the 17th century onwards. Poor law functions were administered separately for Shelsley Kings and the rest of Shelsley Beauchamp parish. As such, Shelsley Kings became a separate civil parish in 1866 when the legal definition of 'parish' was changed to be the areas used for administering the poor laws. Despite becoming a separate civil parish, Shelsley Kings remained part of the ecclesiastical parish of Shelsley Beauchamp after 1866.\nGovernance\nThere are three tiers of local government covering Shelsley Kings, at parish, district and county level: The Shelsleys Parish Council, Malvern Hills District Council, and Worcestershire County Council. The parish council is a grouped parish council, also covering the neighbouring civil parishes of Shelsley Beauchamp and Shelsley Walsh.\nReferences"
    }
  ]
}