{
  "content": [
    {
      "type": "text",
      "text": "# Sherbrooke War Memorial\n\n}}\nThe Sherbrooke War Memorial is a cenotaph erected in 1926, on King Street, in Sherbrooke, Quebec, Canada, to commemorate Sherbrooke residents who fought in World War I. This piece of cultural heritage has become emblematic of the city of Sherbrooke, which counts it among its ten main \"points of interest\". The monument was designed by George William Hill, one of the foremost Canadian sculptors of the first half of the 20th century.\nDescription\nThe monument represents an angel with outspread wings (the goddess of victory) flying over three Canadian soldiers standing in a trench. The four bronze figures were cast in Belgium. The pedestal, made of granite, comes from Stanstead, the \"granite capital of Canada\".\nThe monument was built following the request of a committee of residents, on May 21, 1923. Later that year, the city council set aside $25,000 for the design of the monument, and launched a competition to find the artist that will design the monument. The drawing submitted by Hill won.\nIn November 1925, Colonel Arthur Huffman McGreer, Principal of Bishop's University, suggested including the list of Sherbrooke soldiers who fell during World War I. The final list, engraved on a bronze plate, comprises 248 names, published in La Tribune the day before the monument was inaugurated. Hill affixed the plate on the pedestal of the statue, accompanied by the following bilingual epitaph: ''\"Devant ses fils tombés ou survivants qui se sont illustrés au champ d'honneur Sherbrooke s'incline / 1914–1918 / To the men and women of Sherbrooke who fought and fell for their country and their god\".\nOn 7 November 1926, eight years after the end of the war, the monument was officially opened by the Mayor of Sherbrooke at the time, James Keith Edwards, before more than 20,000 people. During the ceremony, the family members of the soldiers, Sherbrooke personalities and other dignitaries settled in the stands. To watch the event, many of the estimated 15 000 spectators made to mount environments: they climb trees, climb on the roofs of buildings or access to the balconies of buildings and bell tower of the Church of St. Patrick. The newspapers of the time show that the crowd remained calmed  with the intensity of the moment and the beauty of the statue, when the white sheet covering was removed.\nOn November 7, 1948, another plate, on which is written \"Leur souvenir vivra éternellement\"'' (\"May their memories be eternal\") was added, in memory of the soldiers who fought during World War II.\nThe statue was restored during the summer of 2009 by the Centre de conservation du Québec at a cost of $60 300, shared between the Restoration Program Cenotaph and Memorial Veterans Affairs Canada (the federal government ) and the Ville de Sherbrooke. In 2009, the value of the installation was estimated at $900,000 Canadian.\nReferences"
    }
  ]
}