{
  "content": [
    {
      "type": "text",
      "text": "# Shigaraki ware\n\n(1573–1615)]]\nShigaraki ware (信楽焼) is a type of stoneware pottery made in Shigaraki area, Japan.  The kiln is one of the Six Ancient Kilns in Japan. Although figures representing the tanuki are a popular product included as Shigaraki ware, the kiln and local pottery tradition has a long history.\nHistory\nThe development of kilns during the medieval period are thought to have taken place through the transformation of Sue ware technology.  In the later half of the Heian period, Sue ware production came to an abrupt decline, with production now centralizing in the Owari, Mino, Bizen, and Omi provinces.  Political collapse in the Heian period caused Sue ware potters to begin producing inexpensive wares such as tsubo (jars), kame (wide mouthed bowls), and suribachi (mortars or grinding).  The Sue ware workshops began producing in characteristic regional blocks.  All these led to the development of kilns in the region known as the ‘Six Old Kilns’.  The regional blocks consisted of Seto, Echizen, Tokoname, Bizen, Tamba, and Shigaraki.\nThe name Shigaraki describes a collective group of ceramic products made in a similar geographic area.  Shigaraki ware is said to have begun when tiles were constructed for the Emperor Shōmu’s Shigaraki-no-miya Palace in 742.  However, evidence has shown old kiln remains in the ruins of Shigaraki village dating back to the Kamakura period and early in the Muromachi period. It is suggested that Bizen potters traveled to Shigaraki and began producing works there because early Shigaraki wares appear to have been influenced by Bizen wares.  It is often hard to distinguish wares from both the Kamakura and Muromachi periods because of the embedded granules of feldspar that give both wares their striking appearance.\nThe town of Shigaraki was formed up of eighteen independent communities along the Daido River in the valley in the most southern tip of Shiga prefecture.  Three of the earliest kiln sites may date back to 1278.  The communities were Kamagatani, Minami Matsuo in Nagano, and Goinoki in Koyama.  These sites are suggested to have been the center of the Shigaraki industry in the old days.\nShigaraki kilns were used for private enterprises.  Evidence was found that the wares were first produced to meet the demands of farmers, making mortars, water urns, bottles, and deep dishes.  Fragments of such wares were found in the ruins of the old kiln sites.  Simple, incised, and geometric lines are also evidence that the wares were produced for everyday agricultural pursuits.\nTea ceremony\nTea drinking was common in Japan since early times.  The general public drank tea out of wooden bowls at fairs and markets, and the upper classes made a guessing game with the drink.  It was not until a tea master by the name of Murata Juko wrote a letter discussing the disciples of the tea ceremony that Shigaraki wares were produced for the specific ceremony.  Influenced by Zen Buddhist traditions, Juko reestablished that the tea ceremony should reflect the concept of wabi-sabi, the belief of emphasizing simplicity, humility, and intense appreciation of the immediate experience.  The natural appearance of this pottery helped reflect these principles and fit into the aesthetic of the tea ceremony atmosphere.  The tea ceremony transformed the manner in which the Japanese viewed objects, including ceramic ware.\nBeginning in 1520, after Juko’s statement of tea ceremony principles, other tea masters began ordering the production of certain styles of ceramic wares for the ceremonies.  Takeno Sho-o was attracted to the Shigaraki ware and ordered ware with red glazes that ran into green and brown glazes to be produced.  Towards the end of the sixteenth century, the tea master Rikyu also patronized a certain appearance of wares, called Rikyu Shigaraki.  These wares were made with a grey faience that imitated Korean wares.  The Todo family came to power in 1635 and employed a tea master by the name of Kobori Enshu to supervise what would be later called Enshu Shigaraki ware.\nDescription\nThe local sandy clay from the bed of Lake Biwa has a warm orange color, and makes very durable pottery.  This clay characterizes Shigaraki ware.  The ceramics have irregular contours and an archaic flavor.  Firing technique shifted from reduction to oxidation firing, which allows free admission of air during the firing rather than limited air admission into the kiln.  This allows iron oxides to be used as part of the coloring process.  The allowance of free air is due to the type of ancient kiln, called an anagama kiln, which is used to fire Shigaraki ware.  The term anagama is a Japanese term meaning \"cave kiln\", as these kilns were usually constructed into the side of hills.  They are single chambered structures with a sloping tunnel shape.  The wood fuel must be constantly supplied in order to achieve temperatures high enough to fire the clay.  Using this type of kiln also achieves the mineral glaze surface so popular with Shigaraki wares.\nDepending on the placement of the piece, the resulting coat of ash and minerals will vary.  An oatmeal appearance is usually the result, with a greyish to a reddish-brown colorizing the body.  Small impurities protrude, caused by embedded quartz partially fired.  Covered with a thin layer of overrun yellowish-brown to a peach blossom red color glaze that crackles when fired is also characteristic of the fired stoneware.  A light, transparent, or almost glass-like glaze with a bluish-green tint also appears on some Shigaraki wares.  The glazes were dribbled, sprayed or spattered over the ceramic surface.  Unless allowed to gather in small pools, the glaze appears near invisible in most lighting, only becoming visible when the piece is held and turned in the hand.  The ware also reflects geta okoshi, the clog marks, where the clay rested on supports inside the kiln before firing.  Another characteristic of Shigaraki ware is fingerprints left behind by potters in the construction process.\nListed below are some characteristic examples of Shigaraki ware:\n;Kame (wide mouthed jars)\nThis particular vessel has paddled marks about the shoulder seam.  The shoulder is then carefully scraped horizontally, while the lower body scraped vertically.  It has a gray, fine-grained core and a purplish-brown glossy surface.  On the shoulder, the purplish-brown color is fused with yellow ash to create an olive-green glaze.\n;Tsubo (jars)\nThis vessel has a \"well curb\" mark in the shape of a number sign (#) in two places on the shoulder.  The neck and rim are carefully defined.  The body is scraped horizontally overall.  The surface has an orange color, but has no glaze finish.\nThis example has a chevron in two places on the shoulder.  The shoulder and neck are smoothed horizontally with a diagonal scraping at the shoulder line.  The lower body is scraped horizontally and vertically.  Fingerprints left behind from the potters occupy the base, along with two scars caused by sticks.  The core is gray near the base and orange at the shoulder with a golden-orange surface.\nThis piece is smoothed horizontally all over with a trimmed edge.  It has a light gray core with a red-brown surface.  A thick coat of green glaze once occupied the surface, but has now decomposed.\nThis ware has a mark of three (san) lines on two places of the shoulder, that which is smoothed horizontally in a random manner.  The lower body is scraped vertically and has an untrimmed edge.  It has a light-gray core with an unglazed pinkish-beige surface.\nThis vessel has a mark with two (ni) lines in two places upon the shoulder.  The shoulder is smoothed horizontally with diagonal scratching at the seam.  The lower body is scraped horizontally and vertically with an untrimmed edge.  The surface is a shiny rose-red color fused with yellow ash.\nThis piece has a mark similar to a plus sign representing the number ten (ju) in two places on the shoulder.  It is smoothed both on the interior and the exterior.  It also has a low edge trim.  The surface is fine-grained with a red-orange color and has almost no ash on the exterior.\nThis particular vessel has a neck in which is smoothed horizontally and the body smoothed diagonally.  There is scraping just above the base.  The core is gray-white and fine-grained.  The surface is decomposed with a gray-white color and bubbly ash-glaze.\nThis ware has a rim that is turned outward.  The shoulder has been smoothed horizontally.  The surface contains many small stones and is orange in color.\n;Sake flask\nThe flask has been smoothed horizontally on both the interior and the exterior.  The lower edge is scraped.  The core is a brick-red and contains many small stones.  The surface is golden-beige in color.\nSee also\n*Japanese pottery and porcelain\n*Japanese Tea Ceremony\n*Miho Museum\n*List of Traditional Crafts of Japan\nFurther reading\n*Fired with passion: contemporary Japanese ceramics.  Lurie, Samuel J.  New York: Eagle Art Pub., 2006.\n*The clay art of Adrian Saxe.  Lynn, Martha Drexler.  Los Angeles: Los Angeles County Museum of Art, c1993.\nReferences\n*Cort, Louise Allison. Shigaraki, Potters' Valley. Tokyo, New York, San Francisco: Kodansha International Ltd.  1979.\n*Jenyns, Soame. Japanese Pottery. New York, Washington: Praeger Publishers, 1971.\n*Miller, Roy Andrew. Japanese Ceramics. Tokyo: Toto Shuppan Company, Limited, 1960.\n*Grove Dictionary of Art\nExternal links\n*[https://www.sccp.jp/e/as-to-shigaraki/history/ The Shigaraki Ceramic Cultural Park]\n*[http://www.japanpotterynet.com/en/user_data/ceramics190.php JAPAN POTTERY NET]\n*[http://www.e-yakimono.net/html/shigaraki-er.html Shigaraki Exhibition]\n*[http://www.miho.or.jp/en/ Miho.jp]\n*[http://libmma.contentdm.oclc.org/cdm/compoundobject/collection/p15324coll10/id/84980/rec/1 Momoyama, Japanese Art in the Age of Grandeur], an exhibition catalog from The Metropolitan Museum of Art (fully available online as PDF), which contains material on Shigaraki ware"
    }
  ]
}