{
  "content": [
    {
      "type": "text",
      "text": "# Shire of Flinders (Queensland)\n\n| pop_footnotes =\n| area     = 41200\n| area_footnotes =\n| mayor    = Jane McNamara\n| seat     = Hughenden\n| region   = North West Queensland\n| stategov = Traeger\n| fedgov   = Kennedy\n| logo     = Shire of Flinders Logo.jpg\n| url      = http://www.flinders.qld.gov.au/\n| near-n   = Etheridge\n| near-ne  = Charters Towers\n| near-e   = Charters Towers\n| near-se  = Charters Towers\n| near-s   = Barcaldine\n| near-sw  = Winton\n| near-w   = Richmond\n| near-nw  = Etheridge\n| est      = 1882\n}}\nThe Shire of Flinders is a local government area in north-western Queensland, Australia.\n]]\nIt covers an area of , and has existed as a local government entity since 1882. The Shire, named for the Flinders River, is predominantly a grazing area with cattle in the north of the shire and mixed grazing to the south in  the black soil area.\nIn the , the Shire of Flinders had a population of 1,500 people.\nHistory\nJirandali (also known as Yirandali, Warungu, Yirandhali) is an Australian Aboriginal language of North-West Queensland, particularly the Hughenden area. The language region includes the local government area of the Shire of Flinders, including Dutton River, Flinders River, Mount Sturgeon, Caledonia, Richmond, Corfield, Winton, Torrens, Tower Hill, Landsborough Creek, Lammermoor Station, Hughenden, and Tangorin.\nThe Hughenden Division was established on 20 July 1882 under the Divisional Boards Act 1879. On 20 April 1887, the Borough of Hughenden was constituted separately as a municipality for the emerging town of Hughenden.\nOn 31 March  1903, the Hughenden Division became the Shire of Hughenden and the Borough of Hughenden became the Town of Hughenden under the Local Authorities Act 1902. On 5 September of the same year, the Shire of Hughenden was renamed Shire of Flinders.\nThe western part of the Shire was separately incorporated as the Shire of Wyangarie (later Shire of Richmond) on 23 October 1915. On 1 January 1930, part of the Shire of Flinders was annexed to the Shire of Dalrymple.\nIn 1958, the Town of Hughenden amalgamated with the Shire of Flinders.\nPrior to 19 November 2021, the town of Marathon was within the locality of Stamford. However, this arrangement caused confusion, so on 19 November 2021, a new locality of Marathon was created around the town, excising the land from the localities of Dutton River and Stamford.\nTowns and localities\nThe Shire of Flinders includes the following settlements:\n* Hughenden\n* Dutton River\n* Marathon\n* Porcupine\n* Prairie\n* Stamford\n* Tangorin\n* Torrens Creek\nAmenities\nThe Flinders Shire Council operate the Flinders Shire Library at 39 Gray Street, Hughenden.\nDemographics\n{| class=\"wikitable\"\n|-\n! Year\n! Population\n! Notes\n|-\n| 1933 || 3,426‡ ||\n|-\n| 1947 || 3,310‡ ||\n|-\n| 1954 || 3,293‡ ||\n|-\n| 1961 || 3,953 ||\n|-\n| 1966 || 3,716 ||\n|-\n| 1971 || 3,019 ||\n|-\n| 1976 || 2,875 ||\n|-\n| 1981 || 2,740 ||\n|-\n| 1986 || 2,804 ||\n|-\n| 1991 || 2,491 ||\n|-\n| 1996 || 2,232 ||\n|-\n|  || 2,151 ||\n|-\n|  || 1,792 ||\n|-\n|  || 1,791 ||\n|-\n|  || 1,536 ||\n|-\n|  || 1,500 ||\n|}\n* ‡&nbsp;– includes then-separate Town.\nChairmen and mayors\n* 1897: D. Simson\n* 1927: E. M. Geary\n* 2008–2012: Brendan McNamara (elected unopposed)\n* 2012–2016: Greg Jones (elected unopposed)\n* 2016–2020: Jane Beatrice McNamara\nReferences\nExternal links\n*\n* [https://ehive.com/collections/4002/flinders-shire-historical-photographic-project Flinders Shire historical photo project]"
    }
  ]
}