{
  "content": [
    {
      "type": "text",
      "text": "# Shoal Point, Queensland\n\n| local_map           = yes\n| zoom                = 11\n| pop                 = 1104\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4750\n| area                = 6.1\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 6.3\n| dir1                = N\n| location1           = Rural View\n| dist2               = 17.8\n| dir2                = N\n| location2           = Mackay\n| dist3               = 987\n| dir3                = NNW\n| location3           = Brisbane\n| dist4               =\n| dir4                =\n| location4           =\n| lga                 = Mackay Region\n| stategov            = Whitsunday\n| fedgov              = Dawson\n| near-n              =Coral Sea\n| near-ne             =Coral Sea\n| near-e              =Coral Sea\n| near-se             =Bucasia\n| near-s              =Bucasia\n| near-sw             =Habana\n| near-w              =Habana\n| near-nw             =Coral Sea\n}}\nShoal Point is a coastal suburb in the Mackay Region, Queensland, Australia. In the , Shoal Point had a population of 1,104 people.\nGeography\nShoal Point is a headland at the north-east of the locality ().\nThe waters and inlets of the Coral Sea form the eastern and northern boundaries, and most of the western boundary. The Coral Sea coast is a long sandy beach.\nThe land in the west of the suburb along the inlet is most marshland. The land use along the Coral Sea coast is predominantly surburan housing. Further inland the land use is a mixture of grazing on native vegetation and growing sugarcane and other tropical crops.\nDemographics\nIn the , Shoal Point had a population of 977 people.\nIn the , Shoal Point had a population of 1,104 people.\nEducation\nThere are no schools in Shoal Point. The nearest government primary school is Bucasia State School in neighbouring Bucasia to the south-east. The nearest government secondary school is Mackay Northern Beaches State High School in Rural View to the south.\nAmenities\nThe Mackay Regional Council operates a mobile library service on a fortnightly schedule at O'Brien Esplanade.\nThere is a boat ramp at the northern end of the O'Brien Esplanade ().\nThere are a number of parks in the area (from north to south):\n* Hodges Road Park ()\n* Cone Street Park ()\n* Nautilus Park ()\n* Dolphins Park ()\nReferences\nExternal links\n*"
    }
  ]
}