{
  "content": [
    {
      "type": "text",
      "text": "# Shōfuku-ji (Odawara)__disambig_1\n\n| religious_affiliation = Buddhist\n| rite = Shingon-shū Tōji-ha\n| deity =   Jūichimen Kannon Bosatsu\n| country =  Japan\n| functional_status = functional\n| website =\n| founded_by = c.Dōkyō\n| year_completed = c.770?\n| footnotes          = }}}\n}}\nis a Buddhist temple located in the Iizumi neighborhood of the city of Odawara, Kanagawa Prefecture, Japan. It belongs to the Shingon-shū Tōji-ha school of Japanese Buddhism and its honzon is a statue of Jūichimen Kannon Bosatsu.  The temple's full name is Iizumi-san Shōfuku-ji (飯泉山 勝福寺).The temple is the 5th stop on the Bandō Sanjūsankasho pilgrimage route.\nOverview\nThe foundation of this temple is uncertain. According to the temple's legend, the priest Jianzhen from Tang China gifted an image of Kannon Bosatsu to Empress Kōken, who in turn gave it to the priest Dōkyō. After Dōkyō's failed attempt the seize the throne, he was exiled to the Shimotsuke Yakushi-ji, and en route, had this statue enshrined in a small chapel in a hamlet in the Ashigaru Mountains of western Sagami Province. The chapel was named Yuge-ji, and was intended to be the bodaiji of his Yuge clan. The statue was relocated to its present location in 830. During the early Kamakura period, the Soga brothers of the Soga Monogatari prayed at this temple for success in their vendetta. The temple was renamed Shōfuku-ji in the Muromachi period and was supported by the Late Hōjō clan of Odawara.  The temple also claims that when Ninomiya Sontoku visited this temple at the age of 14, he received enlightenment upon hearing the Kannon Sutra recited by a traveling monk.\nThe temple is located a 25-minute walk from Kamonomiya Station on the JR East Tōkaidō Main Line.\nCultural Properties\nKanagawa Prefecture Tangible Cultural Properties\n*; The current main hall is a 5 x 4 bay building with a ridge plate that shows that it was built in 1706 by Okubo Tadamasu, the daimyō of Odawara Domain.\n*; Although it follows the style of the Heian period, with a gentle face, rounded body, and narrow torso, this 101.0-cm wooden statue has a large head compared to the body. The carving techniques are simple, so it is thought to have been built in the region in the latter half of the 12th century, at the end of the Heian period.\nOdawara City Tangible Cultural Properties\n*; This gate was built in 1758.\n*; This bronze bell was cast in 1629 by Aoki Gen'eimon. Odawara was a center for the bronze casting industry in the Edo period, and the Aoki clan was one of several noted bell master craftsmen in the city.\n*; This bronze water trough has the shape of a dragon-headed boat, with a realistic dragon head in the bow and  a seated statue of Jūichimen Kannon at the stern. There are numerous inscriptions engraved throughout, including poems about the temple and the Bandō pilgrimage, as well as the names of the caster, date (1704), and names of people who donated it.\n*; This 176 x 70.7 cm hanging scroll is an example of a style called Myōzawa-sama Fudō because it was created by Ryushu Shutaku (Myōzawa, 1308-1388), the 15th abbot of Tenryū-ji. The scroll is dated 1433.\nReferences\nExternal links\n*[https://bandou.gr.jp/temple/飯泉山-勝福寺（飯泉観音）/ Bando 33 Kannon pilgrimage home page]"
    }
  ]
}