{
  "content": [
    {
      "type": "text",
      "text": "# Shotwell (software)\n\nJens Georg\n| released               =\n| platform               = GNOME\n| size                   =\n| language               = Multilingual\n| genre                  = Image organizer\n| license                = LGPL-2.1-or-later\n| latest_release_version =\n| latest_release_date    = }}\n| latest_preview_version = 0.31.7\n| latest_preview_date    =\n| programming_language   = Vala (GTK+)\n| operating_system       = Linux\n}}\nShotwell is an image organizer designed to provide personal photo management for the GNOME desktop environment. In 2010, it replaced F-Spot as the standard image tool for several GNOME-based Linux distributions, including Fedora in version 13 and Ubuntu in its 10.10 Maverick Meerkat release.\nIn 2019, Shotwell was the target of a predatory lawsuit by Rothschild Patent Imaging against the GNOME Foundation claiming a patent infringement related to the use of WiFi to transfer photographic images.  The case was resolved through agreement in 2020 and the patent itself invalidated in 2022 following a legal challenge from the open source development community.252}}\nFeatures\nShotwell can import photos and videos from a digital camera directly. Shotwell automatically groups photos and videos by date, and supports tagging. Its image editing features allow users to straighten, crop, eliminate red eye, and adjust levels and color balance. It also features an auto \"enhance\" option that will attempt to guess appropriate levels for the image.\nShotwell allows users to publish their images and videos to Flickr, Piwigo, and YouTube. Shotwell can also set the desktop wallpaper.\nTechnical information\nThe Yorba Foundation wrote Shotwell in the Vala programming language. It imports photos using the libgphoto2 library, similar to other image-organizers such as F-Spot and gThumb.\nSee also\n* digiKam&nbsp;– digital photo manager by KDE\n* gThumb\n* Comparison of image viewers\nReferences\nExternal links\n*"
    }
  ]
}