{
  "content": [
    {
      "type": "text",
      "text": "# Shri Venkateswara (Balaji) Temple\n\nThe Shri Venkateswara (Balaji) Temple () is a large functioning Hindu temple in the United Kingdom, Europe. It is dedicated in the Vaishnava tradition to a form of the supreme Hindu god Maha Vishnu, who is believed to be the preserver and protector of the universe. The temple is located in Tividale, West Midlands, England between the suburbs of Tipton and Oldbury, northwest of Birmingham city. The temple was designed with inspiration from the Tirupati Venkateswara Temple in Andhra Pradesh, India. The temple was consecrated and opened to the general public in August 2006.\nThe primary deity worshiped at this temple is Venkateswara, a well known manifestation of the supreme lord Maha Vishnu (He is one of the three supreme gods in the Hindu triumvirate, along with Brahma and Shiva, who are responsible for the creation, maintenance, and destruction of the world). Within the main temple complex are also shrines to his consort Padmavati (Alamelu). The temple also houses shrines to other major Hindu deities such as Hanuman, Shiva, Karthikeya, Ganesh, Ayappan and the Navagraha.\nThe temple runs the Balaji School for Culture & Education which provides spiritual and cultural foundation for children and arranges classes on Veda (Hindu scriptures), music etc. The temple has a large Community Hall. The temple also provides free Matrimonial service by helps one find a suitable marriage partner.\nOn site facilities include a large community centre, a gatehouse and a Gandhi Peace Centre. The temple operates annadhanam services, providing free meals for visitors funded by donations. Seeing up to 1500 visitors during the weekdays and 2500 visitors in the weekends, the temple does not only cater to the religious and spiritual requirements of Hindus. It receives over one hundred visits from special interest groups all across the UK and Europe, while playing an active role in supporting the community by welcoming school trips, hosting various cultural events and holding classes and teaching sessions in Vedic studies and Sanskrit for young people.\nThe temple is a non-profit organisation and is a recognized charity in the UK.\nReferences\nExternal links\n* [http://www.venkateswara.org.uk/ Shri Venkateswara (Balaji) Temple official site]"
    }
  ]
}