{
  "content": [
    {
      "type": "text",
      "text": "# Shtefanesht (Hasidic dynasty)\n\n, the second Shtefaneshter Rebbe]]\nShtefanesht () was a Hasidic dynasty named for the town of Ștefănești, Romania. It was one of the branches of the Ruzhiner dynasty, together with Bohush, Boyan, Chortkov, Husiatyn, and Sadigura. The dynasty lasted from 1851 to 1933 and had only two Rebbes: Rabbi Menachem Nochum Friedman, a son of the Ruzhiner Rebbe, and Rabbi Avrohom Mattisyohu Friedman, the only son of Rabbi Menachem Nochum. During the latter's reign, Ștefănești became one of the most important Hasidic centers in Eastern Europe.\nRabbinic leadership\nRabbi Menachem Nochum Friedman, First Shtefaneshter Rebbe\nFollowing the death of Rabbi Yisrael Friedman of Ruzhin on 9 October 1850, his six sons established their own courts in different towns. His fourth son, Rabbi Menachem Nochum Friedman (1823&ndash;1869), moved to the town of Ștefănești in Romania.\nUnlike the Jews of Poland and Galicia who were well-versed in Torah study and included many Torah scholars in their midst, the Jews of Romania were simple and uneducated peasants. The Shtefaneshter Rebbes therefore engaged their flock by generously dispensing blessings and openly displaying their powers as baalei mofsim (miracle-workers). While the Shtefaneshter Rebbes were well-versed in Kabbalah, they did not say divrei Torah in public. Their private avodas Hashem (Divine service) was fervent and intense.\nLike his father, the Ruzhiner, the first Shtefaneshter Rebbe was a regal figure. Dr. Menachem Mendel Brayer, father of the Boyaner Rebbe, saw the Rebbe during his youth in Ștefănești; according to Brayer, the Rebbe was characterized by \"the light jest, the smile, the delicacy, the good cheer, the ability to penetrate without piercing and the ability to touch one point without touching the boundary. Like his father before him, he liked to tell stories of action, but did not have his father's gift for symbolic abstraction\". The Rebbe built a palatial house with a large garden in Ștefănești and conducted himself like a king, including the riding of horses. After his death in 1869, the first Shtefaneshter Rebbe was buried in Iași. The area of the former graveyard was later replaced by a public park, and there is no memorial to the first Rebbe.\nRabbi Avrohom Mattisyohu Friedman, Second Shtefaneshter Rebbe\nRabbi Menachem Nochum's only son and successor, Rabbi Avrohom Mattisyohu, was born on the eighth day of Hanukkah 1847 in Sadigura. At his brit milah, his grandfather, the Ruzhiner Rebbe, gave him the second name Mattisyohu after Mattathias Maccabee the High Priest. In 1862 he married the daughter of Reb Yitzchok Reich of Reisha, but they divorced after 11 years without children. He then remarried his cousin Sarah Zipporah, a daughter of Reb Yosef Mansohn of Berdychiv, who had been widowed by her husband Reb Aharon Schorr of Berdychiv. Rabbi Avrohom Mattisyohu adopted her three children; they did not have children of their own.\nRabbi Avrohom Mattisyohu was 21 years old when his father, Rabbi Menachem Nochum, died in 1869. After much pleading and the approval of his uncle, Rabbi Avrohom Yaakov Friedman, the first Rebbe of Sadigura, Rabbi Avrohom Mattisyahu agreed to fill his father's position, a role he held for 64 years.\nThe second Stefaneshter Rebbe was considered to be one of the hidden tzaddikim of his generation. Many stories were told about the miracles he effected.\nOn one occasion a Hasid came to the Rebbe, crying that his daughter had fallen ill with typhus and was in a desperate condition. Her hours were numbered and only a miracle could save her. The Rebbe gave the Hasid his personal spoon which he used every morning to eat breakfast, and a piece of his bread, and told the Hasid to feed the bread to his daughter with the spoon. Although the girl couldn't swallow and hadn't eaten anything in days, she readily consumed the Rebbe's shirayim [leftovers from a Rebbe's meal] and a few days later she was back to herself and lived to a ripe old age. The spoon, handed down from generation to generation, is until today a family heirloom.\nHis influence over Romanian Jewry was immense and his following numbered in the thousands. He was revered by Jews and Christians alike. On his annual visit to Bucharest, all the shops were closed in his honor and tens of thousands of people came out to welcome him. The presence of his court turned Ștefănești into one of the most important Hasidic centers in Eastern Europe. He never spoke at his tish, but \"created an atmosphere of profound meditation and awe\" by his presence alone.\nThree of the ten synagogues in the town were located in the Rebbe's courtyard. The Rebbe also looked after the welfare of many devout Hasidim who cut themselves off from the outside world in order to pursue their Divine service. Among those who stayed for months or even years in his court were Rabbi Chaim Zanvl Abramowitz, the Ribnitzer Rebbe, and Rabbi Eliezer Zusia Portugal, the first Skulener Rebbe.\nThe second Shtefaneshter Rebbe died on July 15, 1933 (21 Tammuz 5693). His funeral, held in the town of Iaşi, attracted 50,000 mourners. As he was never blessed with offspring, he had invited his sister's son, Rabbi Menachem Nochum of Itskani, to Ștefănești in order to succeed him. However, Rabbi Menachem Nochum died a month before the Rebbe did. The grave of the second Shtefaneshter Rebbe became a hallowed pilgrimage site for Jews and Christians alike, attracting thousands of visitors on his yahrtzeit and the depositing of thousands of prayer notes written in Hebrew, Yiddish, and Romanian in his ohel.\nIn 1968 Dr. Joseph Brayer, former av beis din (head of the rabbinical court) of Shtefanesht and as of 2006 rabbi in the Tiferet Avraham Matitiahu Synagogue in The Bronx, New York, initiated a plan to reinter the Rebbe's remains in Israel. The body was exhumed under the direction of Dr. Moses Rosen, Chief Rabbi of Romania, and reinterred in the Ruzhin plot in the Nahalat Yitzhak Cemetery in Giv'atayim, Israel. This new gravesite also became a shrine for people in need of blessings and salvation, with thousands of visitors each year on the Rebbe's yahrtzeit. Back in Romania, Orthodox Christian peasants continued to light candles and leave prayer notes in the Rebbe's empty ohel in the hope that the Rebbe would still intercede on their behalf.\nShtefanesht yeshiva\nAfter the second Shtefaneshter Rebbe's death, a yeshiva named Beis Avrohom was established in the courtyard of the Rebbe's house in his memory. Its rosh yeshiva (dean) was Rabbi Joseph Brayer. By 1936, nearly 60 students were learning there. The curriculum included both Talmudic studies and state gymnasium learning; students were tested on the latter twice yearly by the government boards of Botoșani and Iași. The yeshiva disbanded in June 1941 when the Romanian authorities evicted the town's Jews.\nToras Emes Institute\nIn 1993 the Torah Emes Institute was founded in Bnei Brak by Rabbi Avraham Yaakov Solomon to preserve the legacy of the Shtefanesht dynasty.\nReferences\nFurther reading\n*Ner Yisrael, vol. 6, (Chaim Dov Stern), Bnei Brak, 1994.\n*Encyclopedia Lechasidut, (Yitzchak Alfasi), Mossad Harav Kook, Jerusalem, 2005\nExternal links\n*[https://shtefenesht.org/ Shtefenesht.org]"
    }
  ]
}