{
  "content": [
    {
      "type": "text",
      "text": "# Siege of Warsaw (1656)\n\nPolish–Lithuanian Commonwealth\n| commander1        = Arvid Wittenberg\n| commander2        =  John II Casimir Vasa\n| strength1         =\n| strength2         =\n| casualties1       =\n| casualties2       =\n}}\nThe siege of Warsaw took place between April 24 and July 1, 1656. Swedish Empire forces had occupied the Polish capital without fighting in early September 1655 (see deluge). In late April 1656, Poles and Lithuanians began the siege, with the purpose of recapturing their capital. They were successful, but later lost the city for a second time after a battle held on July 28–30, 1656 (see Battle of Warsaw (1656)).\nIntroduction\nThe Swedish army entered Warsaw on September 8, 1655. The city immediately became administrative center of Swedish administration of occupied Poland. The first months of Swedish rule were not marked by any atrocities, but after some time, when it became clear that Sweden would not be able to control Poland for a longer period of time, the invaders began looting Warsaw. The city was robbed of everything that was of value, including window frames, marble fireplaces, floors, tiles, columns and stairs. All goods were loaded on boats and transported along the Vistula to the Baltic Sea.\nBy the spring of 1656, residents of Warsaw suffered from hunger and epidemic diseases. All shops had been robbed by the Swedes, and due to dangerous situation in the countryside, food was not delivered to the city.\nBeginning of the siege\nIn early spring of 1656, the army of Charles X Gustav was surrounded at the confluence of the Vistula and San river. Swedes managed to escape total annihilation, and after a daring manoeuver, they headed northwards, back to Warsaw. They were chased by slow-moving Lithuanian Army under Pawel Jan Sapieha, which reached Lublin on April 20. Meanwhile, Charles X Gustav, after a short rest, left Warsaw (April 17), and marched with his soldiers to Greater Poland, to fight local anti-Swedish insurrection and Polish armies of Stefan Czarniecki and Jerzy Lubomirski. Charles left in Warsaw a garrison of some 2,500, under Arvid Wittenberg.\nOn April 24, Sapieha’s army of some 6,000 reached Warsaw’s suburb of Praga, located on the right bank of the Vistula. The Lithuanians built a pontoon bridge, through which they transferred several units on the left bank of the river (April 30). To prevent this, Arvid Wittenberg sent a unit of reiters, which was annihilated after a short skirmish. In late May 1656, another Lithuanian army, under Hetman Wincenty Korwin Gosiewski, joined Sapieha’s forces.\nSwedish preparations\nIn mid April 1656, Swedish garrison of some 2,500 began preparing for the siege. Several buildings in Warsaw were fortified, including the Dominican Abbey, the Holy Spirit Church, Palace of Bishops of Kraków and Kraków Gate. Along city walls, trenches were dug and obstacles for cavalry were placed. Since Swedish forces were inadequate to man whole wall, the defenders concentrated their forces in a complex of large buildings, with the Holy Spirit Church in the middle, which prevented entry into the heart of the city. Swedish commandant, Arvid Wittenberg, located his headquarters in the Royal Castle.\nOn May 6, Wittenberg ordered to burn several houses located in Krakowskie Przedmieście, and along Dluga and Senatorska Streets. On May 7, the Swedes burned a number of buildings on Freta and Mostowa Streets. At the same time, Swedish engineers turned monasteries, palaces and churches along Krakowskie Przedmieście into fortified strongholds.\nArrival of Polish army\nOn April 26, 1656, King Jan Kazimierz left Lwow, and together with Polish Army headed northwards. On May 12, the Poles reached Zamość, and in mid-May, first infantry regiments, together with artillery, joined the Lithuanians. First, ill-prepared attack took place on May 17, but after six hours it failed. On the next day, a Swedish unit under Colonel Forgell left Warsaw and in a surprise attack, captured two cannons, killing a number of soldiers.\nKing Jan Kazimierz arrived together with his Hetmans and main forces on May 30. On the same day, Polish infantry crossed the Vistula, on a pontoon bridge built by Lithuanians, taking positions in Ujazdów. The King himself resided in the Ujazdów Castle. On June 2, Jan Kazimierz ordered his Chancellor Stefan Korycinski, to contact Arvid Wittenberg with a generous offer of surrender. The Swedes rejected this, despite mediation of Austrian envoy, Franz Paul de Lisola.\nSoon afterwards, Polish forces were strengthened by the divisions of Jerzy Lubomirski and Stefan Czarniecki, which arrived on June 9. Altogether, Polish-Lithuanian Army consisted of some 29,000 soldiers (22,000 Poles, 7,000 Lithuanians), 18,000 pospolite ruszenie, and several thousand peasants. The Lithuanians remained in Praga, on the right bank of the Vistula, while Poles occupied positions on the left bank.\nSwedish garrison of Arvid Wittenberg had some 2,500 soldiers - 1,300 infantry, 300 dragoons and 900 reiters. Apart from Wittenberg, several notable Swedes were present in Warsaw, including Bengt Gabrielsson Oxenstierna.\nFirst major assault\nDuring a meeting of Polish-Lithuanian commanders, Krzysztof Grodzicki suggested an assault from north, west and south. The main Polish effort was concentrated in southwest, especially in the fortified buildings of Krakowskie Przedmiescie, whose capture opened the way to the Royal Palace. Polish leaders hoped that after capture of external Swedish positions, Wittenberg would come to the conclusion that his situation was hopeless and capitulate.\nThe assault was preceded by a barrage of Grodzicki’s artillery (June 3). In return, Wittenberg sent 200 infantry and two cavalry regiments for a surprise attack, which was repelled with heavy losses on both sides. Swedish commandant was aware of the fact that reinforcements, sent by Charles X Gustav were on the way.\nMain assault of the Commonwealth forces began in the morning of June 8, with some 10,000 armed peasants. After initial success, the Poles were forced to retreat. The attack was not a complete failure, as Polish forces captured the Palace of Bishops of Kraków, which became a convenient spot for the artillery. Another attack took place on June 11, and again it was fought off by the defenders. After this, Polish commandants realized that without heavy guns, which were kept in Zamość, capture of Warsaw was impossible.\nSwedish reinforcements\nOn June 13, Swedish division under Adolph John I, Count Palatine of Kleeburg, sent by Charles Gustav from Royal Prussia, reached Modlin, where it camped, preparing for crossing of the Narew. Another Swedish division, under Robert Douglas, Count of Skenninge, camped near the village of Pomiechowo. These units were blocked by the Lithuanians, supported by Hetman Jerzy Lubomirski, who joined them in the night of June 16/17. Swedish positions at the confluence of the Vistula and the Narwobug were well-fortified, and protected by both rivers. At the same time, however, with 6,000 men, they were not strong enough to risk a frontal attack on the Commonwealth forces, so on June 23, most Polish forces returned to Warsaw, while Polish engineers built a second pontoon bridge over the Vistula.\nSecond major assault\nIn the course of the time, the situation of besieged Swedish soldiers deteriorated. Food supplies were low, and many deserted to the Polish side. At the same time, the Poles were reinforced with a division of Crimean Tatars, under Subchan Gazi Agi, which was sent to Warsaw by Vizier Sefer Gazi Aga.\nOn June 26, while awaiting heavy artillery from Zamość, Jan Kazimierz urged Wittenberg to capitulate, but again was refused. On the next day, heavy cannons arrived, together with ammunition and infantry from Lwow. Artillery barrage immediately began, followed by an assault (June 28), in which mostly armed peasants took place. Polish king did not use his first-rate foreign mercenaries, as he wanted to save them for the future. Polish forces entered Warsaw as far as the Bernardine Abbey and Kazanowski Palace. Swedish defenders managed to keep their positions, but their situation was hopeless. Under the circumstances, Wittenberg asked Jan Kazimierz for permission to send a message to his king (June 29). This was rejected and Polish king demanded unconditional surrender.\nThird and fourth major assaults\nIn the night of June 29/30, thousands of armed peasants began the attack. After several hours of heavy fighting, Poles and Lithuanians managed to capture several fortified buildings. On June 30, at 9:00&nbsp;a.m., Wittenberg asked for a two-hour truce to discuss the capitulation. During the negotiations, which took place in the Ossolinski Palace, Swedish side presented several demands, while Poles insisted on unconditional surrender. Finally, the negotiations broke, and the fourth assault began in the morning of July 1. This attack was successful, and Poles entered the heart of Warsaw. Wittenberg, realizing that his situation was hopeless, agreed to capitulate.\nThe conditions of surrender, which consisted of fifteen points, were very mild, which angered Polish-Lithuanian soldiers. Swedish commanders, including Wittenberg and Oxenstierna were to be released back to their king, while their soldiers were to return to the Swedish Army, provided that they would not re-enter service for four months.\nOn July 1, the 1,200 Swedish soldiers began to leave Warsaw. Wives and families of Swedish officers were loaded on boats and sent towards Toruń. Before that happened, Swedish dames were inspected, as many of them broke conditions of capitulation, and hid stolen valuables under their clothes. Since Polish rank and file vehemently protested against too mild conditions, King Jan Kazimierz decided to change them, and sent Swedish officers, together with Wittenberg, to a dungeon in Zamość.\nSee also\n* Patrick Gordon, Scottish mercenary who served under Wittenberg and was taken prisoner by Brandenburgers in July of the siege\nReferences"
    }
  ]
}