{
  "content": [
    {
      "type": "text",
      "text": "# Sigfred (Danish king 812)\n\nSigfred was a competitor for the Danish throne in 812. His brief appearance inaugurated a period of throne struggles in Denmark which lasted until 827.\nCompeting royal lineages\nIn the early 9th century King Gudfred had made Denmark into an expansive power which threatened the Carolingian positions in Frisia, Saxony and the Slavic lands. However, the kingdom was not strictly hereditary since rulers were taken by assemblies of chiefs and peasants. Apart from the House of Gudfred, another lineage strove for power. The members based their claim on kinship with a former King Harald who might have ruled in the 8th century. Since the Houses of Gudfred and Harald often bore the same names (such as Gudfred and Hemming) they were probably related.\nSuccession crisis\nGudfred's nephew and successor Hemming had a short and peaceful reign and died in 812. He is known to have had two brothers called Håkon and Angantyr, but we do not hear more about them. Another nephew of Gudfred, Sigfred, aspired to succeed him. He was, however, challenged by another claimant called Anulo (Ale), who was a grandson or nephew (nepos) of Harald and probably the son of the chief Halfdan who submitted to Charlemagne in 807. The two rival kings summoned their followers and met in a huge battle which, according to the Frankish annals, cost the lives 10,940 men on both sides. If correct this would have meant a very considerable loss of manpower for this era. Both Sigfred and Anulo were killed in the melée. However, Anulo's side won, and his brothers Harald Klak and Ragnfred were made kings of the Danish realm. The new rulers sought friendship with the Carolingian Empire. However, they were soon challenged by the five sons of Gudfred and were expelled in the following year.\nLater historiography\nSigfred and Anulo are mentioned by the historian Adam of Bremen in c. 1075 who believed that they were both nephews of Gudfred. Adam's Gesta Hammaburgensis Ecclesiae Pontificum was known to some High medieval Norse writers who elaborated on his data. Thus the unusual name Anulo was misinterpreted as Hring (Latin annulus meaning \"ring\") while Sigfred was equated with the common medieval name Sigurd. Various king lists such as the Gesta Danorum of Saxo Grammaticus (c. 1200) combine the names as Sigurd Hring and present this figure as the father and predecessor of the renowned Viking ruler Ragnar Lodbrok, conflated with historical Ragnfred.\nReferences"
    }
  ]
}