{
  "content": [
    {
      "type": "text",
      "text": "# Sikorsky CH-53K King Stallion\n\n| developed_from = Sikorsky CH-53E Super Stallion\n| variants =\n}}\nThe Sikorsky CH-53K King Stallion (Sikorsky S-95) is a heavy-transport helicopter designed and produced by Sikorsky Aircraft. The King Stallion is an evolution of the long-running CH-53 series of helicopters that has been in continuous service since 1966, and features three up-rated  engines, new composite rotor blades, and a wider aircraft cabin than its predecessors. It is the largest and heaviest helicopter in the U.S. military.\nThe United States Marine Corps made plans to receive 200 helicopters at a total cost of $25 billion. Ground-test vehicle  testing started in April 2014; flight testing began with the maiden flight on 27 October 2015. In May 2018, the first CH-53K was delivered to the Marine Corps. On 22 April 2022, it was declared to have passed initial operational capability. Israel has also reportedly ordered the type; other potential export customers include Japan.\nDevelopment\nH-53 background\nThe Sikorsky CH-53 Sea Stallion came out of the US Marine Corps' (USMC) \"Heavy Helicopter Experimental\" (HH(X)) competition begun in 1962. Sikorsky's S-65 was selected over Boeing Vertol's modified CH-47 Chinook version. The prototype YCH-53A first flew on 14 October 1964. It was designated CH-53A Sea Stallion, delivery of production helicopters began in 1966. The CH-53A was equipped with two T64-GE-6 turboshaft engines and had a maximum gross weight of .\nVariants of the original CH-53A Sea Stallion include the RH-53A/D, HH-53B/C, CH-53D, CH-53G, and MH-53H /J/M. The RH-53A and RH-53D were used by the United States Navy for minesweeping. The CH-53D had a more powerful version of the General Electric T64 engine, used in all H-53 variants, and external fuel tanks. The US Air Force's HH-53B/C Super Jolly Green Giant were for special operations and combat rescue. The Air Force's MH-53H/J/M Pave Low were the final twin-engined H-53s, and had extensive avionics upgrades for all-weather operation.\nIn October 1967, the USMC issued a requirement for a helicopter with a lifting capacity 1.8 times that of the CH-53D, that could fit on amphibious assault ships. Before this, Sikorsky had been working on an enhancement to the CH-53D, under the company designation \"S-80\", featuring a third turboshaft engine and a more powerful rotor system. Sikorsky proposed the S-80 design to the Marines in 1968. The Marines considered this a good, quick solution, and funded development of a testbed helicopter. Changes on the CH-53E also included a stronger transmission and a fuselage stretched . The main rotor blades' material was changed to a titanium-fiberglass composite.  A new automatic flight-control system was added. The vertical tail was also enlarged, with the tail rotor tilted upwards slightly to provide some lift in hover.\nThe initial YCH-53E first flew in 1974. Following successful testing, the initial production contract was awarded in 1978, and service introduction followed in February 1981. The US Navy acquired the CH-53E in small numbers for shipboard resupply. The Marines and Navy acquired a total of 177. For the airborne mine countermeasures role, the Navy obtained a CH-53E variant, designated MH-53E Sea Dragon, with enlarged sponsons and fuel tanks for greater fuel storage, in the 1980s. The Navy obtained 46 Sea Dragons.\nCH-53K\nThe USMC had planned upgrades to retain most CH-53Es, but this effort stalled. Sikorsky proposed a new model, originally designated \"CH-53X\"; in April 2006, the USMC signed a $18.8 billion contract for 156 \"CH-53K\" helicopters, with deliveries to be completed by 2021. The USMC was to begin retiring CH-53Es in 2009, and needed replacements as rotorcraft reached their structural life limits in 2011–12. CH-53K flight testing was expected to begin in 2011. In August 2007, the USMC increased the order from 156 to 227. By that time, the first flight was planned for November 2011 with initial operating capability  by 2015. The CH-53K will be the USMC's heavy lift helicopter with the MV-22 (medium lift) and UH-1Y (light lift). A 2007 RAND report on seabasing found that a higher ratio of CH-53Ks to MV-22s would reduce ship-based deployment times.\nIn 2008, design work was well underway, along with weight-reduction efforts to meet operational requirements; increased engine performance and rotor blade improvements are options to help meet requirements if needed. The rotor mast tilt was decreased and components shifted to ensure the center of gravity does not shift too far rearward as fuel is burned. Design requirements were frozen in 2009–10. On 22 January 2010, Sikorsky opened a $20 million Precision Components Technology Center in Stratford, Connecticut, for producing CH-53K parts, such as the rotating and stationary swashplates, main and tail rotor hubs, and main rotor sleeves. On 3 August 2010, the CH-53K passed its Critical Design Review, reading it for test production. However, the IOC fielding date was deferred to 2018. Sikorsky proposed building four pre-production aircraft for evaluation.\nOn 4 December 2012, Sikorsky delivered the first CH-53K, a ground-test vehicle (GTV) airframe. Early tests included fuel system calibration and attaching test sensors across the airframe to record temperature, aerodynamic load, pressure, and vibration. Two additional static GTVs underwent structural testing at the firm's Stratford manufacturing plant. In January 2013, the program had an estimated cost of US$23.17 billion (~$}} in ) after procurement of the planned 200 CH-53Ks. In April 2013, the U.S. Navy program manager stated that work had gone well and it may become operational ahead of schedule. On 31 May 2013, the Navy awarded Sikorsky a $435 million (~$}} in ) contract to deliver four prototype CH-53Ks for evaluation and mission testing; The first two prototypes focused on structural flight loads while the third and fourth validated general performance, propulsion and avionics.\nMajor subcontractors include Aurora Flight Sciences (main rotor pylon), Exelis Aerostructures (tail rotor pylon and sponsons), Onboard Systems International (external cargo hook), Rockwell Collins (avionics management system), Sanmina-SCI Corporation (communications), and Spirit AeroSystems (cockpit and cabin). The Aft Transition was originally built by GKN Aerospace, but in February 2022 the aft transition was awarded to Albany International Corp. (NYSE: AIN) for a ten year period.  In October 2013, Sikorsky gave Kratos Defense & Security Solutions a $8.5 million contract for CH-53K maintenance training aids, such as the Maintenance Training Device Suite (MTDS) and Helicopter Emulation Maintenance Trainer (HEMT). The MTDS is a realistic training and evaluation environment for various avionics, electrical, and hydraulic subsystems. The HEMT is a 3D simulation of multiple scenarios, such as functional test, troubleshoot, fault isolation, removal and installation of 27 subsystems.\nOn 24 January 2014, the CH-53K GTV ignited its engines, spinning the rotor head without rotors attached. Low-rate production is planned to proceed from 2015 to 2017. Initial operating capability (IOC) was set to occur in 2019, with full-rate production commencing between then and 2022. The USMC intends to have eight active squadrons, one training squadron, and one reserve squadron. In April 2014, testing with blades attached began, system integration followed. Flight testing was set to start in late 2014, each test aircraft flying approximately 500 hours over three years. The maiden flight was delayed, due to issues with the titanium quill shafts in the transmission and gear box.\nOn 5 May 2014, General James F. Amos announced during the official roll-out that it will be called the \"King Stallion\". On 27 October 2015, the CH-53K took its first flight. On 7 March 2018, one lifted a payload of , the maximum weight on the single center-point cargo hook. The first CH-53K was delivered to the USMC on 16 May 2018; at the time, 18 additional helicopters were in production, and the second was planned for delivery in early 2019.\nIn December 2018, the CH-53K was projected to not be combat ready as expected in late 2019, due to delivery delays caused by technical flaws found in testing, which resulted in a major program restructuring. Flaws included the engine reingesting exhaust gas, limited service life for the rotor gear boxes, late deliveries of redesigned parts, and deficiencies with the tail rotor and driveshaft. It is estimated that the delay will push back delivery of combat-ready CH-53Ks until May 2020.\nIn 2023, an order was placed with Sikorsky Helicopters for 35 CH-53K helicopters for US$2.77 billion, as production ramped up at the manufacturing facility to fill orders.\nDesign\nThe CH-53K King Stallion is a heavy-lift helicopter, being a general redesign of the preceding CH-53E, with the main improvements being the new engines and cockpit layout. It has over twice the lift capacity and radius of action of the CH-53E, and a wider cargo hold to allow it to carry a Humvee internally. A new composite rotor blade system is also used, featuring technology similar to that of the UH-60 Black Hawk helicopter. The CH-53K is powered by the General Electric GE38-1B engine, which was selected over the Pratt and Whitney Canada PW150 and a variant of the Rolls-Royce AE 1107C-Liberty used on the V-22 Osprey. Each of the three T408 engines is rated at , and gives the CH-53K the ability to fly  faster than its CH-53E predecessor.\nduring a demonstration, 2018]]\nThe CH-53K features a new digital glass cockpit with fly-by-wire controls and haptic feedback, health and usage monitoring systems, a new elastomeric hub system, and composite rotor blades to improve \"hot and high\" performance. The split torque gearbox with quill shafts started development around 2007.  The gearbox assembly including rotor hub and rotating control system weighs around . The split torque gearbox weighs . For comparison, the twin-engine Mil Mi-26's split torque gearbox weighs .\nThe CH-53K has an improved external cargo handling system, survivability enhancements, and improvements to extend service life.  The cabin will be  long by  wide by  tall. Its cabin will be  wider and 15% larger, but will have new shorter composite sponsons. The CH-53K can carry two 463L master pallets, eliminating the need to break apart pallets between airlifter and helicopter.\nThe CH-53K is to surpass the capability of its predecessor by carrying nearly 30% more than the CH-53E's external payload of  over the same radius of .  The CH-53K's payload reaches a maximum of .  The CH-53K's maximum gross weight will be , which is increased over the CH-53E's . The CH-53K will keep approximately the same footprint as the CH-53E. To this end, it has redesigned composite sponsons that cut overall width for a narrower footprint, which is better for shipboard service.\nOperational history\nUnited States Marine Corps\nIn May 2018, the first CH-53K King Stallion was delivered to the USMC.\nThe U.S. Marine Corps received its first CH-53K simulator at Marine Corps Air Station New River in Jacksonville, North Carolina on 1 May 2020. It is a Containerized Flight Training Device (CFTD) built by Lockheed Martin, Sikorsky's parent company.\nOn 22 April 2022, Lt. General Mark R. Wise, Deputy Commandant for Aviation, declared initial operational capability for the CH-53K.\nIsrael\nIn 2009, the Israeli Air Force (IAF) said it would evaluate the new variant after it flies. In August 2015, it formalized a requirement for the CH-53K, listing the type as a \"very high priority\" item to enable the service to perform missions only the platform is capable of. Israel's current CH-53 \"Yasur\" fleet is to remain operational until 2025.\nThe CH-53K competed with the Boeing CH-47F Chinook for an order of approximately 20 helicopters to replace the CH-53 Yasur. In February 2021, the Israeli Ministry of Defense announced the CH-53K's selection. On 31 December 2021, it was announced that Israel had signed a deal to buy 12 CH-53Ks.\nUS Navy\nIn August 2023, Sikorsky announced they had been awarded a contract by the US Navy for 35 helicopters at a total cost of $2.77 billion, including eight aircraft for Israel.\nPotential operators\nJapan has reportedly shown interest in the CH-53K.\nIndia may procure the CH-53K/CH-47 as part of its Landing Platform Dock acquisition program.\nFailed bids\nIn February 2018, Sikorsky signed an agreement valued at around €4 billion with Rheinmetall to team up for the German Air Force's CH-53G heavy lift helicopter replacement program, in which the CH-53K competed against the Boeing CH-47 Chinook. The German Federal Ministry of Defence was expected to issue an official request for information in late 2018, to award a contract in 2020, and for deliveries to begin in 2023 for an expected order of around 40 helicopters.\nOn 29 September 2020, the German Ministry of Defense cancelled the \"Schwerer Transporthubschrauber\" (STH) heavy-lifting helicopter program, it having been judged to be too expensive; instead, the CH-53Gs are still to be replaced after reexamining the project. In 2022, Germany decided to procure the CH-47F Chinook instead, citing interoperability advantages with other European NATO countries—especially the Netherlands—as well as the lower unit cost compared to the CH-53K, which would allow the purchase of more helicopters for the same budget.\nOperators\n;\n*United States Marine Corps\n**VMX-1\n**HMH-461\n**HMHT-302\nFuture operators\n;\n*Israeli Air Force GE38-1B data, and Flightglobal.com\n|prime units?=kts\n|crew=4\n|capacity=30 passengers or troops, 24 casualty litters, or  payload\n:*Centre external load hook rating –\n:*Fore and aft external load hooks rating –\n|length ft=99\n|length in=\n|length note=rotor and tail un-folded\n|width ft=17\n|width in=6\n|width note=fuselage\n|height ft=28\n|height in=4.9\n|height note=rotor and tail un-folded\n*Cabin length:\n*Cabin width:\n*Cabin height:\n|empty weight lb=43878\n|empty weight note=\n|gross weight lb=\n|gross weight note=\n|max takeoff weight lb=88000\n|max takeoff weight note=with external load\n:::: with maximum internal load\n|fuel capacity= internal in two cells per sponson ()\n|  auxiliary internal in three cabin tanks ()\n}}\n|more general=\n|eng1 number=3\n|eng1 name=General Electric T408 (GE38-1B)\n|eng1 type=turboshaft engines\n|eng1 shp=7500\n|eng1 note=\n|rot number=1\n|rot dia ft=\n|rot dia in=\n|rot area sqft=\n|rot area note=\n*Blade section: - root: NACA ; tip: NACA -->\n|max speed kts=\n|max speed note=\n|cruise speed kts=170\n|cruise speed note=\n|never exceed speed kts=\n|never exceed speed note=\n|range nmi=460\n|range note=\n|combat range nmi=110\n|combat range note=\n|ferry range nmi=\n|ferry range note=\n|endurance=\n|ceiling ft=16000\n|ceiling note=ISA\n:::: ISA +\n|climb rate ftmin=\n|climb rate note=\n|time to altitude=\n|disk loading lb/sqft=\n|disk loading note=\n|fuel consumption lb/mi=\n|power/mass=\n|more performance=\n|armament=\n|guns=\n|bombs=\n|rockets=\n|missiles=\n|hardpoints=\n|hardpoint capacity=\n|hardpoint rockets=\n|hardpoint missiles=\n|hardpoint bombs=\n|hardpoint other=\n|avionics=\n}}\nSee also\n*\n*\n|lists=\n* List of active United States military aircraft\n* List of rotorcraft\n}}\nReferences\nExternal links\n* [https://www.lockheedmartin.com/en-us/products/sikorsky-ch-53k-helicopter.html Sikorsky CH-53K page on Sikorsky/Lockheed Martin]\n** [https://www.youtube.com/watch?v=rgRD1OLshd0&list=PLqa9423Jd9Mq3blpTF08c2LZDJbRvPpMQ&t=1s The Sikorsky CH-53K King Stallion - Lockheed Martin]\n* [https://web.archive.org/web/20070624104233/http://acquisition.navy.mil/programs/air/ch_53k Department of the Navy CH-53K acquisition page]\n* [http://www.defenseindustrydaily.com/ch53k-the-us-marines-hlr-helicopter-program-updated-01724 CH-53K information on DefenseIndustryDaily.com]\n* [http://rand.org/pubs/monograph_reports/MR1713/MR1713.ch2.pdf Assessment of Existing Rotorcraft Technology/Cost]\n* [http://www.flightglobal.com/articles/2008/02/12/221497/ge-cuts-metal-for-engine-to-power-sikorskys-ch-53k.html \"GE cuts metal for engine to power Sikorsky's CH-53K\"]. Flightglobal.com, 12 February 2008."
    }
  ]
}