{
  "content": [
    {
      "type": "text",
      "text": "# Silla–Tang War\n\n| territory         = Silla recaptured the territory south of Taedong River, while Tang held control over former Goguryeo territory north of Taedong River.\n| combatant1        = SillaGoguryeo loyalistsBaekje loyalists\n| combatant2        = Tang dynasty\n| commander1        = Munmu of SillaKim YushinGeom MojamKim WonsulGo Yeonmu\n| commander2        = Xue RenguiGao KanBuyeo YungLi Jinxing\n| strength1         =\n| strength2         =\n}}\nThe Silla–Tang War (670–676) occurred between the Silla kingdom of Korea (joined by Goguryeo and Baekje loyalists) and the Tang dynasty of China. It began in the geopolitical context immediately following the conquest of Goguryeo and Baekje by the joint forces of Silla and Tang.\nDue to the internal political situation in both Silla and Tang, the conflict ended in a truce and Tang withdrawal from the Korean Peninsula south of the Taedong River. The subsequent territorial line between Tang and Unified Silla extended from the mouth of the Taedong River in the west to the East Korea Bay.\nContext\nAfter the Goguryeo-Tang War ended in 668, the Korean kingdoms of Baekje and Goguryeo were occupied by the Silla–Tang alliance. A substantial number of people in the territories of the two former kingdoms were forcibly resettled by the Tang. Emperor Gaozong of Tang created the office of Protectorate General to Pacify the East to administer the conquered territories. Goguryeo's territory was divided into 9 commanderies, 42 prefectures, and 100 counties. The protectorate was based in Pyongyang.\nKing Munmu of Silla assembled an army incorporating not just Sillan people but also the remnants of the Baekje and Goguryeo military in a coalition against the Tang army. The Sillan army engaged Tang forces in combat to eject them from the Korean Peninsula (particularly the entirety of what was formerly Baekje and some of the southern portions of what was formerly Goguryeo) and prevent any Tang attempts to control Silla.\nCourse\nSilla's efforts were aided by revolts/uprisings in the territories of the former Korean kingdoms, notably Goguryeo; the first revolt of the people of Goguryeo took place in 669. Revolts in the former territories of Goguryeo took place for several subsequent years, the last of which endured for four years.\nFrom 670 to 673 the rebels launched an uprising every year, the last of which lasted for four years. In 671, Silla drove Tang forces out of most of Baekje's former territory. Silla was angered by Emperor Gaozong of Tang. Originally Emperor Taizong of Tang promised to exchange Baekje and the lands south of Pyongyang in return for Silla's military cooperation. However Taizong died before the conquest of Goguryeo was completed, and his successor Gaozong reneged on the promise.\nIn 675 the Tang attacked Silla and defeated them in Gyeonggi. In response Munmu of Silla dispatched a tributary mission to Tang with apologies. Gaozong accepted Munmu's apologies and withdrew Tang troops to deal with the Tibetan threat in the west. Seeing the Tang's strategic weakness, Silla renewed the advance on Tang territory.\nIn 676, Xue Rengui crossed the Yellow Sea to fight against Silla, but was unsuccessful. Tang forces were defeated by a Sillan army at the Maeso fortress, in or near present-day Yeoncheon. Silla took all the territory south of the Taedong River in a series of battles in 676. The Tang were forced to relocate the seat of the Protectorate General to Pacify the East to the more easily defensible city of Liaoyang.\nAftermath\nThe Tang government's relocation of the seat/capital of the Protectorate General to Pacify the East to Liaodong was effectively the end of Tang designs on Sillan territory. Although the Tang forces were expelled from territories south of Taedong River, Silla failed to regain the former Goguryeo territories north of the Taedong River, which were now under Tang dominion. The Tang empire took control of the Liaodong Peninsula while Silla controlled most of the Korean Peninsula. Later, most of the land north of the Taedong River went to Balhae. Relations between Tang and Silla ceased until the early 8th century, when King Seongdeok of Silla (702–737) and Emperor Xuanzong of Tang (712–755) reestablished diplomatic ties and initiated a reconciliation between the states. A formal Tang recognition of Sillan sovereignty over the Korean Peninsula south of the Taedong River occurred in 736.\nSee also\n*Baekje–Tang War\n*Goguryeo–Tang War\n*Battle of Maeso\n*Protectorate General to Pacify the East\nReferences\nBibliography\n*\n*"
    }
  ]
}