{
  "content": [
    {
      "type": "text",
      "text": "# Silver War Badge\n\nThe Silver War Badge was issued in the United Kingdom and the British Empire to service personnel who had been honourably discharged due to wounds, sickness, or age, from military service in the First World War.\nHistory\nThe badge, sometimes known as the \"Discharge Badge\", the \"Wound Badge\" or \"Services Rendered Badge\", was first issued in September 1916, along with an official certificate of entitlement.  If a person served in an active war zone then a King's Certificate of Discharge stating that they \"Served with honour\" would accompany the badge.\nThe large sterling silver lapel badge was intended to be worn on civilian clothes. The decoration was introduced as an award of \"King's silver\" for having received wounds or injury during loyal war service to the Crown's authority. A secondary causation for its introduction was that a practice had developed in the early years of the war in the United Kingdom where some women publicly embarrassed men of fighting age who were not in military uniform, by ostentatiously presenting them with white feathers, as a suggestion of cowardice. As the war had developed substantial numbers of servicemen who had been discharged from His Majesty's Forces with wounds that rendered them unfit for war service, but which were not obvious from their outward appearance, found themselves being harassed in such a manner and the badge, to be worn on the right breast while in civilian dress, was a means of discouraging such incidents being directed at ex-forces' personnel.\nThe badge bears the royal cypher \"GRI\" (for Georgius Rex Imperator; George, King and Emperor) and around the rim \"For King and Empire - Services Rendered\".\nEach badge was uniquely numbered on the reverse. The War Office maintained registers recording the soldier and each badge number issued in the United Kingdom.\nEach badge issued by the War Office was accompanied by a form W5149\nThe accompanying War Badge and Certificate No. _______ are forwarded herewith to _____________________ in respect of ____ service as a soldier of His Majesty's forces.\nThe Badge will be worn on the right breast or on the right lapel of the jacket, but not in Naval or Military uniform. Duplicates of the Badge and Certificate cannot be issued under any circumstances.\nReceipt of the same should be acknowledged hereon.\nThe War Office made it known that it would not replace Silver War Badges if they were lost, however if one was handed into a police station then it would be returned to the War Office, which would seek to return it using its records to its recipient.\nThe military authorities of Canada, New Zealand, Australia, South Africa and Rhodesia maintained their own registers of issue (which were copied to the War Office in London to provide it with an Imperial master-record). This Master List was administratively destroyed by the Ministry of Defence later in the 20th Century, only a few pages of it are extant at The National Archives, in Kew, Surrey.\nThose personnel of HM Forces discharged after 31 December 1919 were no longer eligible for the badge.\nA similar award called the King's Badge was issued in the Second World War. Although each was issued with a certificate, unlike its First World War counterpart it was not individually numbered.\nSilver War Badge - Medal Cards and Rolls\nBritish Army\nSilver War Badge listed on a normal Medal Card\nThe \"SWB List\" when mentioned on a medal card refers to a single folio list, multiples of which are in medal rolls. Whilst these rolls are physically kept in The National Archives, these rolls can be consulted online via a genealogy service provider. and  and  and  }} There are two different types of cards on which the List can be mentioned.\n*The SWB can be shown on a normal medal card index as in the adjacent picture.\n*It can also be recorded on a new medal card issued for the purpose, called a Silver War Badge Card.\nThere should be a reference on the card to a Silver War Badge Roll, for example in the picture above it says \"SWB List TH/345\" this refers to the War Office roll in which the man is mentioned. The medal roll itself would cover a range of lists, for instance \"TH 1 - 400\". These alphabetical prefixes relate to the regional record office which administered the badge issuance. On the Silver War Badge roll it should mention at the very least the number of the badge, the date of issue, unit at discharge, the official reason and date of his discharge, along with enlistment date. The more recent roll entries record the age of the recipient.\nOthers\nRoyal Navy\nTwo sets of records were kept. One set is a list of unique numbers, in sequence. The other is several books of surnames in alphabetical groupings. These can be accessed online via .\nRoyal Air Force\nIf an airman was in receipt of a badge, this is recorded on the reverse of their service record (AM Form 175). There are neither comprehensive rolls of silver war badge recipients, nor comprehensive rolls of First World War campaign medals that have survived and been passed on from the Air Ministry.\nAustralian Imperial Force\nThe first 500 issued to the AIF are on a War Office roll. Of the subsequent issues, there are 18 \"Register of GRI Imperial Silver War Badge\" ledgers. }}\nNew Zealand Expeditionary Force\nThe first 200 issued to the NZEF are on a War Office roll. Of the subsequent issues, circa 40,000, the associated documentation has not come to light.\nCanadian Expeditionary Force\nA portion of the registers have survived, and are kept in the archives at Ottawa.\nKing's Regulations For Discharge from the British Army\nThere were 29 different reasons for which a soldier could have been discharged under the King's Regulations. On a Silver War Badge Card, it could say KR (xxi) as it does on the example SWB card. This stands for King's Regulations, section 21. The different regulations were:\n* (i)         References on enlistment being unsatisfactory.\n* (ii)        Having been irregularly enlisted.\n* (iii)       Not likely to become an efficient soldier.\n* (iv)       Having been claimed as an apprentice.\n* (v)        Having claimed it on payment of ยฃ10 within three months of his attestation.\n* (vi)       Having made a mis-statement as to age on enlistment.\n* (vii)      Having been claimed for wife desertion.\n* (viii)     Having made a false answer on attestation.\n* (ix)       Unfitted for the duties of the corps.\n* (x)        Having been convicted by the civil power of_____, or of an offence committed before enlistment.\n* (xi)       For misconduct.\n* (xii)      Having been sentenced to penal servitude.\n* (xiii)     Having been sentenced to be discharged with ignominy.\n* (xiv)     At his own request, on payment of _____ under Article 1130 (i), Pay Warrant.\n* (xv)      Free, after ____ years' service under Article 1130 (ii), Pay Warrant.\n* (xvi)     No longer physically fit for war service.\n* (xvii)    Surplus to military requirements (having suffered impairment since entry into the service).\n* (xviii)   At his own request after 18 years' service (with a view to pension under the Pay Warrant).\n* (xix)     For the benefit of the public service after 18 years' service (with a view to pension under the Pay Warrant).\n* (xx)      Inefficiency after 18 years' service (with a view to pension under the Pay Warrant).\n* (xxi)     The termination of his ____ period of engagement.\n* (xxii)    With less than 21 years' service towards engagement, but with 21 or more years' service towards pension.\n* (xxiii)   Having claimed discharge after three months' notice.\n* (xxiv)   Having reached the age for discharge.\n* (xxv)    His services being no longer required.\n* (xxvi)   Surplus to military requirements (Not having suffered impairment since entry into the service).\n* (xxvii)  At his own request after 21 (or more) years' service (with a view to pension under the Pay Warrant).\n* (xxviii) After 21 (or more) years' qualifying service for pension, and with 5 (or more) years' service as warrant officer (with a view to pension under the Pay Warrant).\n* (xxviv) On demobilization.\nIn addition, further conditions of discharge were announced by Army Order 265 dated 10 August 1917. This, in turn, was superseded by Army Order 291 of October 1918. That too, in turn, was superseded by Army Order 29 of January 1919, following the cessation of hostilities which permitted the issuance of badges for the rest of 1919. The Cessation of issue to soldiers was announced by Army Order 43 dated 20 February 1920.\nIssued numbers\nApproximately 1,150,000 badges were issued, which had to be claimed and then approved, generally covered by ยง(xvi) above.\nBritish Army\nWilliamson observed that in 1992 Steve Brookes had undertaken an analysis of the number ranges issued to soldiers by the War Office. The following was deduced:\n*Between September 1916 and March 1918, they were issued with just a number and were better quality than most stampings. Around 360,000 of these were issued.\n*Between March 1918 and September 1918, the subsequent 90,000 were the second series. This took the number of badges issued up to 450,000.\n*Between September 1918 and December 1919, they had a 'B' prefix before the number. Around 350,000 of these were issued.\n*Between December 1919 and January 1920, they had a 'O' prefix, around 5,000 of these were issued.\n*Between January 1920 and March 1922, they went back to ordinary numbers again. Around 75,500 badges were issued.\nOthers\n* The Royal Navy had a separate prefix, which was 'RN', there were 48,600 badges issued.\n* Badges issued by the Mercantile Marine had the 'MS' prefix. 158 badges were issued by the Board of Trade.\n* Badges issued to South African Soldiers have the 'SA' prefix and to Canadians have a 'C' prefix }}\n* Badges issued in Newfoundland have the 'N' prefix\n* Badges issued to AIF soldiers have the 'A' prefix, and to New Zealanders have a 'NZ' prefix\n* Badges to the Indian Army have the 'I' prefix.\n*After April 1918 there were several changes;\n**After this date it became possible for servicemen, civilians who served in the RAMC, female nurses, VADs, QMAAC staff, etc. to get awarded the silver war badge by the War Office.\n**RAF men were issued with badges prefixed with 'RAF', over 11,000 badges were issued.\nReferences\nNotes\nBibliography\n*\n*\n*\n*\n*\n*\n*\n*"
    }
  ]
}