{
  "content": [
    {
      "type": "text",
      "text": "# Silvio Santos 1989 presidential campaign\n\n(vice)\n| affiliation =\n| status =\n| headquarters =\n| key_people =\n| receipts =\n| slogan =\n| chant =\n| website =\n}}\nBrazilian TV presenter '''Silvio Santos' candidacy for the presidency''' was made official on October 31, 1989, by the Brazilian Municipalist Party, after a meeting with his running mate Marcondes Gadelha and other senators from the party. At the meeting, the candidate Armando Corrêa agreed to be replaced by Silvio, who was already known on Brazilian television and had run for mayor of São Paulo the previous year. Before the meeting Silvio had also tried to run for the Liberal Front Party and the Liberal Party.\nThe announcement of his candidacy had great repercussion and was criticized by several candidates, appearing in international newspapers. Electoral polls showed Silvio outperforming the candidate who until then had been in the lead, Fernando Collor. From then on, there were requests to impeach the candidacy, as well as demands for Silvio's party to be disqualified. On November 9, 1989, the Superior Electoral Court unanimously considered the party illegal and Silvio's candidacy invalid.\nCollor ended up winning the 1989 election. Silvio ran for mayor of São Paulo in 1992, but the party was also considered illegal. In 2005, the presenter was sought out for a new attempt at running for president, but he rejected it. Gadelha wrote about the candidacy in the book Sonho sequestrado: Silvio Santos e a campanha presidencial de 1989 (2020), where he defends that the PMB's cassation was a political conspiracy.\nBackground and first attempts\nSenor Abravanel, who adopted the stage name Silvio Santos, was \"one of the greatest names in the history of Brazilian TV\". According to , who would become the presenter's vice-presidential candidate, Brazil's 1989 presidential election was the first directly held since 1960, needed \"a center pole, someone with popular strength,\" because it was too polarized. The year before, Silvio had declared: \"I don't want to be a politician and I won't nominate anyone for president of the Republic\".|align=left |width=22em}}\nGadelha was invited by Senator Edison Lobão, of the Liberal Front Party (PFL), in mid-October 1989, to come to his office. Also present was Hugo Napoleão, the party's president. They commented that Aureliano Chaves, the party's candidate for the presidency, was showing very low numbers in the electoral polls, and they were considering putting Silvio in his place. Aureliano received the information on the 18th, initially without ruling it out. On October 22, 1989, the presenter spoke for an hour on Sistema Brasileiro de Televisão (SBT) about the possible candidacy, saying that the decision was in Aureliano's hands. However, he eventually rejected the idea and remained a candidate. Gadelha said that the candidacy was not possible for the PFL due to \"unconfidences\" and \"leaking to the press\".\nSilvio also tried to run for the Liberal Party (PL), replacing Guilherme Afif Domingos, but the latter declared he would only accept Silvio as his vice-president. Even so, Silvio continued to affirm that he would run for the election. To Jornal do Brasil, on October 29, about the short time left for the first round (17 days; it would occur on November 15), he said: \"A name like mine doesn't need support or time to win an election. The public knows me\".\nCandidacy\nReunion\nOn October 30, 1989, seven days before the deadline to formalize his candidacy, in an apartment at the , Silvio, Armando Corrêa, and senators Marcondes Gadelha, Edison Lobão and Hugo Napoleão held a meeting, which started around midnight, about the presenter's candidacy. Corrêa, who was a candidate for the Brazilian Municipalist Party (PMB), agreed there with the replacement of his candidacy with Silvio's, but said that it was still necessary to contact his \"bases\". According to Gadelha, that would be a moment to be \"disloyal\" with the press and avoid them at all costs, since many were against Silvio's candidacy, and also to avoid information leakage, as it happened with the PFL candidacy attempt. , from Estado de S. Paulo, was also waiting on the spot, representing a \"warning sign\".\nGadelha asked Senator  to distract Catanhêde, so that Silvio and Gadelha could go downstairs to his car, avoiding approaches. As he left with him, Gadelha ran into Tereza Cardoso from Jornal do Brasil, and other journalists with filming equipment, but he sped away from the scene at high speed. He took a shortcut to the house of the minister João Alves Filho, whose two gates were open, and went to the house of his childhood friend Manoel Gonçalves de Abrantes, where Gadelha and Silvio talked about the candidacy. There, Silvio commented to Gadelha that the short time remaining for the election - fifteen days - would not be an impediment, since he knew \"the people\", and that he did not want to discuss government plans, but the government itself.\nSilvio said that there was already a concrete course for the government and it would be \"surrounded by good men\" who could operate with \"honesty, sensibility and justice\". The main themes would be health, education and housing, as they were linked \"to the formation of efficient human capital\" that would help develop the country. About the economy, he said he would like to \"liquidate inflation\"; Gadelha commented that this was one of the main factors in the presenter's candidacy. His life story, going from a small salesman to the owner of the second largest television network in the country, was also used.\nRepercussion\nStill at Manoel's house, supporters and phone calls began to arrive. There, a \"fairly large group\" was formed and they went to the Senate for the public act of affiliation to PMB. There, according to Gadelha, \"the turmoil had already been established\". Silvio's candidacy, with Gadelha as his vice-president, was made official on October 31, with the right to five minutes of daily radio and television advertisements. On that day, the candidacy was \"by far the most important fact in the entire national political landscape,\" and it also appeared in international newspapers, such as The New York Times.\nWith this announcement, the impact on the electoral dispute was \"remarkable and immediate\" and caused \"intense polemics\", confronting political positions from both the right and the left. It was feared, on the one hand, that the fact would take votes away from candidate Fernando Collor, increasing the chances that Leonel Brizola or Luiz Inácio Lula da Silva would reach the second round. On the other hand, the left feared that the pressure on the judgment of the Superior Electoral Court (TSE) could constitute an antidemocratic maneuver, making it possible to rig the elections. Several candidates were against Silvio's candidacy, with some criticizing President José Sarney for making it possible.\nThe first electoral poll with Silvio, done by Gallup and published on November 2, \"hurt[ed] all competitors\", as noted by Estado de S. Paulo. Without Silvio, Collor was in the lead with 27.5%; with Silvio, Collor went to second place with 18.6%, and Silvio got 29%. The presenter has also been invited to the last debate of the first round, to be held on November 5 on television. However, contrary to what was announced by PMB, Corrêa's original vice-presidential candidate, state deputy Agostinho Linhares, denied that he had agreed to resign; he commented that he would have liked to be Silvio's vice-president. Later, he would eventually resign.\nElectoral Propaganda\nOne of the problems with the candidacy was that, at the time, voting was done on a paper ballot made by the TSE. This meant that the ballot showed Corrêa's name with the number 26, despite being replaced by Silvio. The task would be to show that by voting for Corrêa, one was actually voting for Silvio. The free electoral schedule was the only way to spread this information. Besides putting together a jingle, Silvio was shown explaining the voting situation on the ballot. The advertisements were recorded at SBT's studio in two hours, consisting of eight programs. The advertisements began airing on television and radio on November 2.\nIn the early evening of November 3, however, based on a representation of the Democratic Labor Party (PDT), the TSE suspended PMB's advertisements for quoting a candidate who was not officially registered (which, in this case, would be Corrêa). Other parties' advertisements that mentioned Silvio Santos were also suspended. On the following day, the Estado de S. Paulo mentioned that Celio Silva, from the National Reconstruction Party (PRN), the same as that of candidate Collor, would ask on the 6th for the PMB's extinction to the TSE.\nDefense attempt and annulment\nOn November 4, Silvio Santos' candidacy application was filed and, in the afternoon, a visit by the candidates to Minister Francisco Rezek, TSE's president, was scheduled. However, with the appearance of impugnation requests,  was called to the defense, as indicated by his son. The minister initially accepted the idea, but said it was an \"expensive lawyer\". However, after they got the money, Oscar ended up not accepting the case, but suggested Pedro Gordilho. Gordilho also rejected the idea and suggested looking for Xavier de Albuquerque, who also declined. The latter, in turn, suggested Rafael Mayer, who ended up saying the same thing.\nSeveral factors considered the candidacy or the party to be invalid. , from the Electoral Attorney General's Office, based his opinion on Complementary Law 5/70, which considered ineligible candidates for President and Vice-President of the Republic who had held, in the six months prior to the election, a position or function of direction, administration or representation in concessionary or concessionary public service companies or companies subject to their control. According to Gadelha, this was not true, because Silvio had not participated in administrative positions at SBT since 1988. In addition, Eduardo Cunha, from Collor's \"shock squad,\" filed a request for impeachment noting that the party needed to have held regional conventions in at least nine states, while the PMB had done so in only four.\nThe TSE session that would impeach the candidacy took place on November 9. Broadcasters tried to broadcast it live, but were not authorized to do so. The \"not very long\" session\" declared the effects of PMB's provisional registration extinct, which constituted an obstacle to the intended candidacy. The argument of the Electoral Attorney General's Office was also considered, and Silvio was considered the director of a national television network and, therefore, ineligible. Unanimously, by seven votes to zero, PMB was considered illegal and Silvio's candidacy was invalidated.\nLegacy\nSurveys at the time showed a 30% approval rating for Silvio. However, with the rejection of the PMB candidates' application for registration, the dispute returned to the previous level, with Fernando Collor leading, also with 30%, followed by Lula and Brizola, both with around 15%. The winner of the first round was Collor, with 30.47% of the votes, followed by Lula, with 17.18%. Corrêa had 0.01% of the votes. Collor won the second round with 53.03%, and Lula got 46.97%.\nGadelha wrote about the candidacy in the book \"Sonho sequestrado: Silvio Santos e a campanha presidencial de 1989\". In it, the author argues that the PMB's cassation was a political conspiracy, because it was feared that Silvio could be elected right in the first round. He declared that the presenter could have \"saved Brazil\" from the political crisis instigated with Collor's victory: \"He would have been revolutionary in government\". After the failed candidacy, Silvio ran for mayor of São Paulo in 1992, but the party was also deemed illegal. Gadelha declared that, in 2005, he sought the presenter to try to make him run for the presidency again, but Silvio denied it, answering: \"Come to my hotel in Guarujá. We will talk about everything in the world. But politics never again\".\nReferences\nBibliography\n*"
    }
  ]
}