{
  "content": [
    {
      "type": "text",
      "text": "# Silver King (baseball)\n\n|birth_place=St. Louis, Missouri, U.S.\n|death_date=\n|death_place=St. Louis, Missouri, U.S.\n|bats=Right\n|throws=Right\n|debutleague = MLB\n|debutdate=September 28\n|debutyear=1886\n|debutteam=Kansas City Cowboys\n|finalleague = MLB\n|finaldate=August 19\n|finalyear=1897\n|finalteam=Washington Senators\n|statleague = MLB\n|stat1label=Win–loss record\n|stat1value=203–152\n|stat2label=Earned run average\n|stat2value=3.18\n|stat3label=Strikeouts\n|stat3value=1,222\n|teams=\n*Kansas City Cowboys ()\n*St. Louis Browns (–)\n*Chicago Pirates ()\n*Pittsburgh Pirates ()\n*New York Giants (–)\n*Cincinnati Reds ()\n*Washington Senators (–)\n|highlights=\n*American Association wins champion (1888)\n*American Association ERA champion (1888)\n*Player's League ERA champion (1890)}}\nSilver King (January 11, 1868 – May 21, 1938), born Charles Frederick Koenig, was an American Major League Baseball player from 1886 through 1897. During his ten-year career, spent primarily as a pitcher, King played for the Kansas City Cowboys (1886), St. Louis Browns (1887–1889), Chicago Pirates (1890), Pittsburgh Pirates (1891), New York Giants (1892–93), Cincinnati Reds (1893), and Washington Senators (1896–97).\nNewspapers in St. Louis, Missouri, gave him the nickname Silver King, referring to his prematurely gray hair and shortening his German surname.\nEarly life\nA native of St. Louis, Koenig broke into baseball at age 18, playing for St. Joseph in the Western League.\nCareer\nKing was an unusual pitcher for his time. Gripping the ball with unusually large hands, he delivered the ball without a windup. He was also one of the first pitchers in major league history to employ a sidearm delivery. The unconventional methods worked, as he went on to pitch 3,190 innings, winning 203 games with 1229 strikeouts and a 3.18 earned run average in 397 games. His strong fastball enabled him to become a notable strikeout artist; he finished among the league's top 10 in that category six times.\nKing's best season came in 1888, when he led the Browns to their fourth consecutive American Association championship. That year, King led the league with 585 innings pitched in 66 games, 45 wins, and a 1.64 ERA. In 1890, he jumped to Chicago of the Players' League and added another ERA title while winning 30 games. On June 21, 1890, King threw a no-hitter for Chicago, the only one in the league's one-year history. (King lost 1–0, and pitched only [https://web.archive.org/web/20080526075129/http://www.baseballlibrary.com/chronology/byyear.php?year=1890 eight innings] in the loss, so this game is not officially recognized by MLB as a no-hitter.)\nPersonal life and death\nAfter baseball, King returned to St. Louis. and went to work for his father's business.\nHe died in 1938, at age 70, and was buried at New St. Marcus Cemetery in St. Louis.\nSee also\n*List of Major League Baseball career wins leaders\n*List of Major League Baseball annual wins leaders\n*List of Major League Baseball annual ERA leaders\n*List of Major League Baseball annual shutout leaders\n*List of St. Louis Cardinals team records\nReferences\nExternal links\n, or [http://www.baseball-almanac.com/players/player.php?p=kingsi01 Baseball Almanac]\n*"
    }
  ]
}