{
  "content": [
    {
      "type": "text",
      "text": "# Simple Groupware\n\n|operating_system = Linux, Windows, Mac OS X, etc.\n|genre = Groupware\n|license = GPL\n}}\nSimple Groupware is a groupware package written in PHP. It uses the MySQL database (version 4 or higher). It contains a calendar system, an email client, an inventory system, and a number of other features. Simple Groupware is free software released under the GNU General Public License.\nThe software contains about 30,000 lines of code and uses about 150,000 lines of code from other free projects. It has modules for managing calendars, contacts, tasks, projects, and inventories of equipment. External data can be integrated using IMAP, RSS, iCal, vCard, CSV or XML files. Firefox bookmark files are also supported. Data can be exported in the CSV, XML, HTML, RSS, and iCal formats.\nThe modules consist of traditional PHP code which is responsible for reading data from the data source into an array. The presentation (displaying, sorting, filtering, linking, editing, etc.) is specified in \"sgsML\" (Simple Groupware Solutions Markup Language). sgsML allows web applications to be implemented faster and with less work than would be possible in, for example, PHP. By reducing the amount of code, applications can be changed quickly and be more readily checked for bugs and consistency.\nThe first release was published on December 13, 2004, at SourceForge.\nReferences\n*[https://sourceforge.net/blog/simple-groupware-enterprise-ready/ Simple Groupware, enterprise-ready], SourceForge.net, February 2010.\n*[https://web.archive.org/web/20081120032542/http://www.linux-magazine.com/w3/issue/82/Web_based_Groupware_Review.pdf GROUP DYNAMICS: exploring web-based groupware tools], Linux Magazine, September 2007.\n*[https://web.archive.org/web/20081001195017/http://www.linux.com/feature/57134 DIY document management system with Simple Groupware], Linux.com, September 2006.\n*[http://www.networkworld.com/columnists/2007/091807gearhead.html PHP, WAMP and XAMPP, oh my], Network World, 18 September 2007.\nExternal links\n*"
    }
  ]
}