{
  "content": [
    {
      "type": "text",
      "text": "# Sinatra Sings Days of Wine and Roses, Moon River, and Other Academy Award Winners\n\n| producer   = Sonny Burke\n| prev_title = Reprise Musical Repertory Theatre\n| prev_year  = 1963\n| next_title = America, I Hear You Singing\n| next_year  = 1964\n}}\nSinatra Sings Days of Wine and Roses, Moon River, and Other Academy Award Winners (or simply Academy Award Winners) is a 1964 album by Frank Sinatra, focusing on songs that won the Academy Award for Best Song. The orchestra is arranged and conducted by Nelson Riddle.\nReception\n| rev2      = Record Mirror\n| rev2Score =\n}}\nStephen Thomas Erlewine writing for Allmusic.com gave the album a lukewarm review, describing it as a 'professional and stylish album' but saying that it 'only yields a handful of true gems'. Erlewine found neither Sinatra or Riddle at fault, but said that the record plays as 'a series of individual moments, not as a cohesive collection'. Erlewine praises \"The Way You Look Tonight\" as one of Sinatra's 'classic performances', and rates \"Three Coins in the Fountain\" and \"All the Way\" highly.\nTrack listing\n#\"Days of Wine and Roses\" (Henry Mancini, Johnny Mercer) – 2:16\n#\"Moon River\" (Mancini, Mercer) – 3:20\n#\"The Way You Look Tonight\" (Jerome Kern, Dorothy Fields) – 3:22\n#\"Three Coins in the Fountain\" (Sammy Cahn, Jule Styne) – 3:46\n#\"In the Cool, Cool, Cool of the Evening\" (Mercer, Hoagy Carmichael) – 1:51\n#\"Secret Love\" (Paul Francis Webster, Sammy Fain) – 3:54\n#\"Swinging on a Star\" (Johnny Burke, Jimmy Van Heusen) – 2:53\n#\"It Might As Well Be Spring\" (Richard Rodgers, Oscar Hammerstein II) – 3:26\n#\"The Continental\" (Herb Magidson, Con Conrad) – 3:14\n#\"Love Is a Many-Splendored Thing\" (Webster, Fain) – 3:22\n#\"All the Way\" (Cahn, Van Heusen) – 3:27\nPersonnel\n*Frank Sinatra – vocals\n*Nelson Riddle – arrangements, conductor\nTracks 1, 2, 6, 8, 10:\n28-January-1964 (Tuesday) – Hollywood. United Recording (from 8 to 11 P.M.).\nConrad Gozzo, Shorty Sherock, Don Fagerquist, Cappy Lewis (tpt); Tommy Pederson, Dick Noel, Tom Shepard (tbn); George Roberts (b-tbn); Richard Perissi, William Hinshaw (fr-h); Willie Schwartz, Harry Klee, Champ Webb, Justin Gordon, Joe Koch (wwd); Israel Baker, Jacques Gasselin, Marshall Sosson, Victor Amo, Gerald Vinci, Bonnie Douglas, Alex Beller, Victor Bay, Joe Stepansky (vln); Louis Kievman, Paul Robyn (via); Nino Rosso, Kurt Reher, David Pratt (vlc); Kathryn Julye (g); Bill Miller (p); Al Viola, Laurindo Almeida (g); Ralph Pena (b); Irving Cottler (d); Emil Richards (perc).\nTracks 3, 4, 5, 7, 9:\n27-January-1964 (Monday) – Hollywood.\nConte Candoli, Cappy Lewis, Don Fagerquist, Shorty Sherock (tpt); Tom Shepard, Dick Noel, Tommy Pederson (tbn); George Roberts (b-tbn); Vincent DeRosa, William Hinshaw (fr-h); Willie Schwartz, Harry Klee (alt/fl); Justin Gordon (sax/clt); Joe Koch (sax/clt/b-clt); Champ Webb (sax/fl/clt/oboe); Emo Neufeld, Victor Amo, Marshall Sasson, Paul Shure, Gerald Vinci, Carl LaMag- na, Jacques Gasselin, Alex Beller, Victor Bay (vln); Stanley Harris, Paul Robyn (via); Eleanor Slatkin, Kurt Reher, Nino Rosso (vlc); Kathryn Julye (harp); Bill Miller (p); Al Viola (g); Ralph Pena (b); Irving Cottler (d/bells); Emil Richards (perc/tymp).\nTrack 11:\n29-April-1963 (Monday) – Hollywood. United Recording (from 8 to 11 P.M.).\nShorty Sherock, Don Fagerquist, Irving Bush, Mickey Mangano (tpt); Tommy Pederson, Dick Noel, Ed Kusby (tbn); Ken Shroyer (b-tbn); Vincent DeRosa, Richard Perissi, James Decker (fr-h); Willie Schwartz (alt/fl/clt); Harry Klee (sax/fl/clt); Plas Johnson (sax/fl/clt); Champ Webb (oboe/clt); Joe Koch (cit/ b-clt); Emo Neufeld, Anatol Kaminsky, Israel Baker, Gerald Vinci, James Getzoff, Victor Amo, Paul Shure, Jacques Gasselin, Nathan Ross,· Alex Beller, Joe Stepansky, Alex Murray (vln); Paul Robyn, Virginia Majewski, Allan Harshman, Stanley Harris (via); Edgar Lustgarten, Ray Kramer, Nino Rosso, Eleanor Slatkin (vlc); Kathryn Julye (harp); Bill Miller (p); Al Viola (g); Eddie Gilbert (b); Irving Cottler (d); Emil Richards (perc).\nCharts\n{| class=\"wikitable sortable plainrowheaders\" style=\"text-align:center\"\n! scope=\"col\"| Chart (1964)\n! scope=\"col\"| Peakposition\n|-\n|}\nReferences"
    }
  ]
}