{
  "content": [
    {
      "type": "text",
      "text": "# Single-line working\n\nOn a railway, single-line working refers to the practice where,  when one line out of the two lines is blocked, trains are able to use the other in either direction. This is usually when a line is out of use for maintenance, or because of damage, obstruction or train failure.\ncrews are working on two tracks (left) of a three-track line in the Czech Republic while a passenger train passes on the third track (right) in 2011.]]\nCircumstances\nLines that are equipped with bi-directional signalling can operate normally since the signalling equipment is already in place to permit trains to run in either direction over the single line. However, when a section of line which is not normally bi-directional has to be used in both directions, special procedures are needed to ensure safe operation. In single-line working, signals are usually provided for the right-direction of travel but not in the wrong-direction. The worst safety risk is a head-on collision between two trains travelling in opposite directions, but there is also the risk of a rear-end collision if two trains travel simultaneously over the line in the unsignalled direction.\nSingle line working in the United Kingdom\nPilot working\nA pilot will be appointed to take local control of the single line. Liaising with the signaller, they will authorise all movements. Every driver must be given an RT 3193 Single-line working ticket, unless they are going into the single line to:\n* assist a failed train\n* evacuate passengers from a failed train\n* remove a portion of a divided train\n* remove a train or vehicles that have proceeded without authority\nThe Pilot must travel on every train, unless there is a second train to follow. They must ride with the train if the movement is towards an obstruction or if that is the last train to move in that direction.\nA complication arises with this system if the next train is positioned at the other end of the section from the Pilot. In this instance the pilotman will to have to walk to the other end, or if it is a considerable distance be conveyed by road. This can lead to long delays.\nProcedure for making the Right-direction movement\nBecause signals are provided for travel in this direction, the Pilot has only to explain to the driver what is taking place. They must state which line is being used for single line working, and between which crossovers it is taking place. If there is an Automatic half-barrier (AHB) crossing under local control on the route, the driver may only pass over it if there is a handsignaller displaying a green flag or lamp to them.\nOnce they are in possession of the Single line working ticket and has received authority to move from the Pilot, the driver must obey the signals and may proceed at linespeed if conditions allow.\nProcedure for making the Wrong-direction movement\nSince no signals are provided and the train may have to make reversing movements, the driver must be informed of:\n* Which line is in use\n* Between which crossovers the working is taking place\n* Location and action to be taken at level crossings\n* The location of intermediate handsignallers\n* If a main aspect signal is provided for movement back onto the \"proper\" line\n* The location of the handsignaller for movements back onto the \"proper\" line\n* Which crossovers and points will be encountered and a reminder that there is a maximum 15&nbsp;mph speed over them\nThe train may have to be authorised to pass a signal at danger in order to begin the movement. When this has been done, the driver may proceed through the single line section at no more than 50&nbsp;mph.\nCancelling the Single line ticket\nOn returning to normal working, the driver must cancel the ticket by writing \"CANCELLED\" across it. If the Pilot has accompanied them over the single line they must hand it to them, otherwise they must hand it in at the end of his shift.\nFurther reading\nRolt, L. T. C. (1986) Red for Danger, a history of railway accidents and railway safety, London: Pan Books.\n(4th edition revised and with additional material by Geoffrey Kichenside.) (Chapter 6: single-line collisions)\nReferences"
    }
  ]
}