{
  "content": [
    {
      "type": "text",
      "text": "# Singeing the King of Spain's Beard__disambig_1\n\nBattle of Cádiz}}\n| result      = English victory\n| combatant1  =  Habsburg Spain\n*  Portugal under Philip of Spain\n| combatant2  =  Elizabethan England\n| commander1  =\n| commander2  = Francis Drake\n| strength1   =\n| strength2   =\n| strength3   =\n| casualties1 =  100 smaller vessels lost}}\n| casualties2 = Unknown number to disease\n| casualties3 =\n| campaignbox =\n}}\n'''Singeing the King of Spain's Beard''' is the derisive name given to a series of attacks by the English privateer Francis Drake against the Spanish in the summer of 1587, beginning in April with a raid on Cádiz. This was an attack on the Spanish naval forces assembling in the Bay of Cádiz in preparation for the planned expedition against England. Much of the Spanish fleet was destroyed, and substantial supplies were destroyed or captured. There followed a series of raiding parties against several forts along the Portuguese coast. A Spanish treasure ship, returning from the Indies, was also captured. The damage caused by the English delayed Spanish preparations for the Armada by at least a year.\nBackground\nIn the second half of the 16th century a series of economic, political, and religious circumstances created tensions in the relations between England and Spain. Protestant England came into direct confrontation with Catholic Spain; Elizabeth I of England had been excommunicated by Pope Pius V in 1570, whilst in 1584 Philip II of Spain had signed the Treaty of Joinville with the French Catholic League, with the aim of eradicating Protestantism.\nThe constant raids by English privateers against Spanish territories in the West Indies and against the Spanish treasure fleet, which carried the wealth that supported Madrid's finances, were considered by the Spanish as a threat to their economic interests. The support of the English for the United Provinces, who were at this time fighting against Spain for their independence, was sealed by the Treaty of Nonsuch in 1585, whereby it was agreed to form an Anglo-Dutch military alliance against Spain. The English support for the pretender to the Portuguese throne, Dom António, was another source of contention.\nThe increasing power of the Spanish Empire, which in 1580 had entered a dynastic union with the Kingdom of Portugal and its empire under Philip of Spain, was expanding in the Americas, and had the support of the Catholic German Habsburgs as well as the Italian princes, was regarded by the English as a major threat to their security.\nIn 1585, the tension between the two countries erupted into the Anglo-Spanish War of 1585–1604. Philip II ordered the arming of a great military fleet, which was to become known as the Invincible Armada, and it was hastily assembled in the Spanish port of Cádiz and in the Portuguese port of Lisbon, with the objective of invading England.\nDrake's expedition\nPreparations\nQueen Elizabeth gave the English privateer Sir Francis Drake, an outstanding leader of previous naval expeditions, the command of a fleet whose mission was to inspect the Spanish military preparations, intercept their supplies, attack the fleet and if possible the Spanish ports. To that end, the Queen put at Drake's disposal four Royal Naval galleons: the Elizabeth Bonaventure, which was under Drake's own command; Golden Lion, captained by William Borough; Rainbow, under Captain Bellingham; and Dreadnought under Captain Thomas Fenner. A further twenty merchantmen and armed pinnaces joined forces with the expedition. The cost of these boats was met by a group of London merchants, whose profits were to be calculated in the same proportions as their investment in the fleet; the Queen, as owner of the four Royal Naval vessels, was to receive 50% of the profits.\nOn 12 April 1587 the English fleet set sail from Plymouth. Seven days after their departure, the Queen sent a counter-command to Drake with instructions not to commence hostilities against the Spanish Fleet or ports. Drake never received this order as the boat carrying it was forced back into port by headwinds before it was able to reach him. Queen Elizabeth had in fact never intended for this note to reach Drake in time and was part of the usual process in which Elizabeth could have plausible deniability over Drake's actions should they not go exactly to plan.\nRaid on Cádiz\nThe fleet was dispersed off the coast of Galicia by a storm that lasted several days, during which one of the pinnaces foundered. After the fleet regrouped, they met two Dutch ships from Middelburg, Zeeland, who informed them that plans were in readiness to sail a huge Spanish war fleet from Cádiz to Lisbon.\nAt dusk on 19 April the English fleet entered the Bay of Cádiz. There were at that moment sixty carracks (naos) and various smaller boats in the port. Further sightings revealed twenty French ships present in the bay, and other smaller vessels were seeking refuge in Puerto Real and El Puerto de Santa María, which were protected by sand banks that the larger carracks could not cross. Juan de Vega, Mayor of Cádiz, sent word to Alonso Pérez de Guzmán, who arrived from Sanlúcar de Barrameda that night to take over the defence of the main square. The Spanish galleons, which, in the absence of the Governor of Castile, were under the command of Pedro de Acuña, sailed out to meet the English fleet but were forced to retire back to Cádiz before the superiority of the English. Gun positions on the shore opened fire, shelling the English fleet from the coast with little effect, but they managed to repulse an attempted landing by launches at El Puntal. During the night of the 29th and all the following day and night the battle raged in the bay. At dawn on 1 May, the English withdrew having destroyed 27 or 37 Spanish ships, with a combined capacity of 10,000 tons. Furthermore, they had captured four other ships, laden with provisions.\nPortugal\nAfter leaving Cádiz, Drake's fleet set course along the south-west coast of Spain and Portugal, destroying all the shipping they encountered, including fishing vessels. On 14 May, 1,000 men disembarked at Lagos in the Algarve and stormed the fortresses of Sagres, Baleeira, Beliche, and Cape St. Vincent. From there the fleet sailed towards Lisbon where Álvaro de Bazán, 1st Marquis of Santa Cruz, was supervising the preparations of the fleet that was to join the Cádiz fleet for the invasion of England. The English fleet stopped in Cascais, from where they proposed to Alvaro de Bazán an exchange of prisoners. Bazán responded that he was neither holding any English subject nor was he preparing for any action against England. There was an exchange of artillery fire between the English fleet and the Spanish-Portuguese shore batteries, producing minor damage and no casualties. Drake gave the order to weigh anchor and return to Sagres, where the English troops were supplied with water, whilst confronting the Spanish caravels that had pursued them from Cádiz. On 2 June the English sick and wounded were evacuated back to England. That same night a storm broke which prevented further sailing for three days.\nBorough, Drake's second in command, considered the decision to land in the Algarve as dangerous and unnecessary. Drake's plans to sail to the Isle of Terceira drove Borough to contradict Drake's orders, prompting Drake to relieve him of his command and place him under arrest. Borough was sent back to England, leaving Drake with only nine ships.\nCapture of São Filipe off the Azores\ns unload cargo in Lisbon. Original engraving by Theodor de Bry, 1593, coloured at a later date.]]\nOn 8 June, Drake's fleet sighted  a Portuguese carrack, the São Filipe, twenty leagues from the Island of São Miguel, returning from the Indies laden with treasure. After a brief exchange of fire it was captured, the first ship to be so on the return run from the Indies. Its enormous fortune of gold, spices, and silk was valued at £108,000 (), of which 10% was to go to Drake. Following this, the fleet returned to England, arriving on 6 July.\nAftermath\nThe expedition led by Francis Drake was a resounding military success: over one hundred Spanish vessels of different tonnages were destroyed or captured during the expedition. Economic and material losses caused to the Spanish fleet by the English attack ensured that Spanish plans for the invasion of England had to be postponed for over a year. It was not until August 1588 that the Armada was ready to leave for the British Isles.\nDocuments seized by the English with the São Filipe, which had details of the East Indies maritime traffic and the lucrative trade in the area, would years later be used as the basis for the founding of the East India Company.Christian Isobel Johnstone: [https://archive.org/details/livesvoyagesofdr00johnuoft/page/110  Live and voyages of Drake], 1837.\n''Singeing the King of Spain's beard\nDrake had already embarrassed King Philip with his actions in the West Indies, taking towns and ships at will from the pre-eminent naval power of the time. With this expedition, he had taken that affront to Philip's doorstep, raiding along the very coast of Spain, and laying up with impunity for three days in Spain's premier Atlantic port while he burned ships and stores. These actions gave heart to Spain's enemies and dismayed her friends. Drake compounded the insult by publicly boasting that he had \"singed the King of Spain's beard\"; yet privately he realized that his actions had only delayed a Spanish invasion, not prevented it altogether, and he wrote to Elizabeth urging her to \"Prepare in England strongly, and mostly by sea. Stop him now and stop him forever.\"\nSherry\nDuring the raid Drake also brought back 2,900 barrels of sherry that had been waiting to be loaded for ships to South America. The wine that Drake brought back to England increased the esteem and thirst for the drink. As Drake had 'sacked' Cadiz, the name sack stuck as the name for sherry for some time. William Shakespeare characterized the English's love for \"sack\" with his character of Sir John Falstaff who most famously noted in Henry IV, Part 2 that \"If I had a thousand sons, the first humane principle I would teach them should be, to forswear thin potations and to addict themselves to sack.\"\nReferences"
    }
  ]
}