{
  "content": [
    {
      "type": "text",
      "text": "# Sinking of USS Housatonic\n\n|place=Charleston Harbor, Charleston, South Carolina\n|coordinates=\n|result= Confederate victory\n|combatant1=  United States (Union)\n|combatant2= CSA (Confederacy)\n|commander1=  Charles W. Pickering\n|commander2=  George E. Dixon\n|strength1=Sloop-of-war\n|strength2=Submarine\n|casualties1=5 killedHousatonic sunk\n|casualties2=8 killedH.L. Hunley sunk\n}}\nThe 'Sinking of USS Housatonic' on 17 February 1864 during the American Civil War was an important turning point in naval warfare. The Confederate States Army submarine,  made her first and only attack on a Union Navy warship when she staged a clandestine night attack on  in Charleston harbor. H.L. Hunley approached just under the surface, avoiding detection until the last moments, then embedded and remotely detonated a spar torpedo that rapidly sank the  sloop-of-war with the loss of five Union sailors. H.L. Hunley became renowned as the first submarine to successfully sink an enemy vessel in combat, and was the direct progenitor of what would eventually become international submarine warfare, although the victory was Pyrrhic and short-lived, since the submarine did not survive the attack and was lost with all eight Confederate crewmen.\nSinking\nOn the evening of 17 February 1864,  made her first mission against an enemy vessel during the American Civil War. Armed with a spar torpedo, mounted to a rod extending out from her bow, H.L. Hunleys mission was to lift the blockade of Charleston, South Carolina by destroying the sloop-of-war USS Housatonic in Charleston Harbor.\nHousatonic was a  vessel with an armament of twelve large cannons, stationed at the entrance of Charleston Harbor roughly  off the coast. Housatonic was commanded by Captain Charles W. Pickering and had a crew of 150 men. H.L. Hunley began her approach at about 8:45 pm, commanded by First Lieutenant George E. Dixon and crewed by seven volunteers.\n]]\nAccounts differ about the initial approach; what is known is that H.L. Hunley was spotted just before embedding her torpedo into Housatonics hull. Official accounts say Housatonic was unable to fire a broadside at H.L. Hunley, and only hit her with small arms fire. H.L. Hunley attached her explosive to Housatonics side before reversing and setting a course for home.\nA few moments later the torpedo detonated and sank the sloop-of-war. First-hand reports say no explosion was heard by the crew of Housatonic, who immediately began climbing the rigging or entering life boats as the sloop began to sink stern first and list to port. Within five minutes, Housatonic was partially underwater. H.L. Hunley thus achieved the first sinking of a warship in combat via submarine.\nAftermath\nFive men – two officers and three crewmen – went down with their ship while an unknown number of Union Navy sailors were injured. The survivors were later rescued by other elements of the Charleston blockading force. The first ship on the scene was . H.L. Hunley won her first victory, but was lost at sea the same night while returning home to Sullivan's Island.\nIt was originally thought that H.L. Hunley was sunk as the result of her own torpedo exploding, but some claim that she survived as long as an hour after destroying Housatonic. Support for the argument of H.L. Hunleys brief survival is a report by the commander of Fort Moultrie on Sullivan's Island that prearranged signals from the sub were observed, and answered; he did not say what the signal was. Further support comes from the testimony of a lookout on the sunken Housatonic, who reported seeing a \"blue light\" from his perch in the sunken ship's rigging. There was also a post-war claim that two \"blue lights\" were the prearranged signal between the sub and Fort Moultrie.  \"Blue light\" at the time of the Civil War was a pyrotechnic signal in long use by the US Navy. Modern claims in published literature on H.L. Hunley have repeatedly and mistakenly been that the \"blue light\" was a blue lantern, when in fact no blue lantern was found on the recovered H.L. Hunley, and period dictionaries and military manuals confirm the 1864 use and meaning of \"blue light.\"\nThis was the last time H.L. Hunley was heard from, until her recovery from the waters off Charleston, South Carolina. While returning to her naval station H.L. Hunley sank for unknown reasons. However, a team of historians managed to examine the submarine's remains, and theorized that a crewman on Housatonic was able to fire a rifle round into one of H.L. Hunleys viewing ports. A film entitled The Hunley was made about the story of H.L. Hunley and the sinking of the submarine H.L. Hunley.\nNew evidence announced by archaeologists in 2013 indicates that H.L. Hunley was less than  away from the point of detonation – much closer than previously realized – and thus the explosion probably damaged the submarine as well as its target, although it was impossible to tell at the time due to concretion covering the hull. Later studies showed that the crew was probably instantly killed through blast injury caused by the close proximity of the torpedo, though this remains disputed.\nSee also\n*\n* SS Georgia (1890), later named SS Housatonic and sunk in 1917 by a German U-boat\nReferences\nExternal links\n*\n* Shipwrecks of the Civil War : Charleston, South Carolina, 1861–1865 map by E. Lee Spence (Sullivan's Island, S.C., 1984) [http://www.worldcatlibraries.org/oclc/11214217&referer=brief_results OCLC 11214217]\n*\n* [https://web.archive.org/web/20041030065502/http://www.history.navy.mil/danfs/h8/housatonic-i.htm]\n*\n* Trip Atlas, \"Events of 1970\"\n* Cover Story: Time Capsule From The Sea – U.S. News & World Report, 2–9 July 2007\n* [https://texashistory.unt.edu/ark:/67531/metapth192839/ Official Record of the Union and Confederate Navies during the War of the Rebellion Series I Volume 15   see page p.328 for List of USS Housatonic fatalities]"
    }
  ]
}