{
  "content": [
    {
      "type": "text",
      "text": "# Sinking of MV Marina Baru 2B\n\n| time                     = 13:30 – 16:30 (UTC+8)\n| place                    =  from Siwa Harbor, Bone Bay, South Sulawesi, Indonesia\n| coordinates              =\n| cause                    =\n| blank1_label             = Passengers and crews\n| blank1_data              = 112\n| participants             =\n| outcome                  =\n| blank2_label             = Survivors\n| blank2_data              = 45\n| reported injuries        =\n| reported death(s)        = 65 confirmed\n| reported missing         = 12 (presumed dead)\n| reported property damage =\n| burial                   =\n| inquiries                =\n| inquest                  =\n| coroner                  =\n| suspects                 =\n| charges                  =\n| verdict                  =\n| convictions              =\n| publication bans         =\n| litigation               =\n| awards                   =\n| url                      =\n| website                  =\n| notes                    =\n}}\nThe 'sinking of MV Marina Baru 2B' occurred just after noon on 19 December 2015. The high speed vessel carrying 112 passengers and crew sank off the coast of Bone, South Sulawesi in inclement weather conditions. A nine-day search and rescue operation, conducted by authorities, successfully rescued 45 survivors and recovered 65 bodies from the sea. Twelve people were declared missing and presumed dead.\nThe sinking was the deadliest shipwreck of 2015 in Indonesia and one of the worst in South Sulawesi. Multiple survivors stated that rough waves managed to damage the ferry's hull and flooded the vessel.\nOn 8 March 2018, the Indonesian National Transportation Safety Committee published the final report. They blamed bad weather as the main cause of the disaster, producing waves higher than the safe limit height for the ferry, which is . Due to this, a massive amount of water quickly flooded the ferry. Contributing to the disaster were design flaws in the ferry's structure and the poor handling of the emergency by the crew.\nSinking\nThe ferry, MV Marina Baru 2B, was used for regularly scheduled domestic ferry service from North Kolaka Regency, Southeast Sulawesi to Wajo Regency, South Sulawesi. The service usually took about three hours. The ferry had a capacity of 184 passengers and crew members. On 19 December 2015, at 11:00 local time (UTC+8), the ferry departed Kolaka Harbor. Video footage taken by onlookers during the departure showed that the weather at the time was in good condition.\nAs the ferry passed Lambasina Island, the captain increased speed to around . At approximately 12:30 local time, the ferry was in Bone Bay.\nThe weather in the area started to deteriorate about 30 minutes later. Waves began to reach  and the wind became intense. Windspeeds at the time was recorded to be around . The captain chose to continue to Siwa and to decrease the speed of the ferry by . The ferry was repeatedly hit by rough waves and high winds causing the ship to roll violently. The captain struggled to maintain the control of the ferry and asked the crew to be on alert and to prepare the passengers for an emergency.\nAt 13:30 local time, the crew heard a loud crack from the bow and the bulwark of the ferry started to separate. Moments later, the bulwark along with several objects on the forecastle deck broke free of the vessel. The captain then ordered the crew to check on the lower decks and assessment the situation at the bow.\nThe crew quickly realised that water had flooded the passenger area of the lower deck and that passengers had already begun to panic. Quick examination revealed that water was entering the ferry through the bow door and the side passenger door. There were arguments between the crew on whether they should return to Kolaka or continue on to Wajo. The captain finally decided to return to Kolaka. As he was struggling for the controls, large amounts of water continued to enter and the ferry began taking on a heavy list.  Passengers recalled that the ferry reached an angle of approximately 30 degrees. Several passengers tried in vain to bail the water out by hand but were later overwhelmed by the amount of water.\nThe ferry, overwhelmed by wind, waves, and water egress, was finally stopped by the captain and the order given to abandon ship. At 14:20 local time, a distress transmission was sent to ground officers stating that the ferry was sinking and asking for immediate assistance. This was the last transmission from the ferry. The crew recalled that as they were evacuating the passengers, they only managed to inflate one life raft, while the other four were unusable. As a result, many passengers jumped into the sea without life vests and were swept away by the rough waves.\nAt 16:30 local time, approximately 3 hours after the start of the sinking, the ferry was completely submerged.\nSearch and rescue\nThe ground officers immediately contacted the Indonesian National Search and Rescue Agency at 14:20 local time. Multiple government agencies were also contacted. In response to the emergency, officials in Siwa Harbor dispatched MV Marina Express 3 to the area. However, due to the rough waves and windy condition in the area, officials postponed the rescue operation. The captain of the vessel decided to return to Tobakul/Lasusua.\nOfficials later contacted the crew of MV New Camellia to observe the situation near the area where last contact had been made by MV Marina Baru 2B. However, the captain was unable to do so due to bad weather condition in the area. The search and rescue operation had to be called off by authorities due to the deteriorating weather condition.\nThe search and rescue operation was resumed on 20 December. A crisis center was set up in Siwa. Multiple ships and helicopters were dispatched to search survivors and victims. The Indonesian Armed Forces stated that they would participate in the rescue operation. On 06:00 local time, the crew of MV Marina Express 3 managed to rescue 20 survivors. Two bodies were also recovered. Four survivors were later found by a local fisherman nearby. On 09:00 local time, a group of 14 survivors were rescued while a body was retrieved from the sea. The search and rescue operation was hampered by bad weather. During the operation, a search and rescue ship was damaged by rough waves.\nOn 21 December, Indonesian Search and Rescue Agency shifted the search area to the waters in North Kolaka and Kolaka, as the sea current would likely drift the passengers to the area. Most survivors were found in the area. The head of the Indonesian National Search and Rescue Agency, Air Marshal (Ret.) Felicianus Henry Bambang Sulistyo, stated that he would observe the rescue effort and would visit the survivors and the relatives of the victims in the hospital. One survivor was found and was immediately evacuated to Djafar Harun Hospital. In the evening, authorities announced that three bodies, including one child and one infant, had been recovered and 70 people were still missing.\nOn 22 December, the search area was widened to Palopo. At least 783 search and rescue personnel were dispatched. The captain of the ferry was found to have survived the sinking. He claimed that initially, he was with another five people. However, they were later separated due to the strong waves. Another survivor was found on flotsam.  The rescue operation was called off due to high waves. Authorities announced that four bodies had been recovered.\nOn 23 December, local fishermen recovered seven bodies in Bulu Puloe. Another nine bodies were recovered by search and rescue personnel. On 24 December, 36 bodies were found. From 25 – 26 December, only one victim was recovered. Three victims were transported to Makassar for further identification. Authorities stated that 12 were still missing. The search and rescue effort was extended for three days. On 29 December 2015, the search and rescue operation was officially ended. 45 survivors were rescued, 65 bodies were recovered, and 12 people were never found.\nPassengers and crews\nThere were conflicting reports on the actual number of passengers and crews who boarded the ferry. Several media stated that around 118–125 people were on board. Officials later confirmed that there were 108 passengers and four crew on board. Among the dead were government officials from Konawe Regency, Southeast Sulawesi and Pinrang Regency, South Sulawesi.\nInvestigation\nHigh waves\nMost survivors stated that MV Marina Baru 2B sank due to the enormous height of the waves, which were as high as .\nIndonesian Meteorological Agency stated that they had warned the crews on the possibilities of high waves, with wind speed reaching as high as . They later added that officials who worked in the harbor where the ferry departed should have cancelled the trip. Examination on the radar data suggested that waves as high as  might have been formed due to the storm system throughout Bone Bay.\nInterviews on the survivors confirmed that the waves managed to enter the ferry through the bow door and the side passenger door. The water then managed to travel to the engine compartment. The pumps, which were responsible for taking the water out from the ferry, were overwhelmed by the massive amount of water. The engine compartment was flooded and the engine abruptly stopped.\nThe water then managed to move to the backup engine, which was located directly behind the main engine compartment. Water easily went through the door and flooded the backup engine. Both compartments were located at the back of the ferry, so the stern started to sink. The sinking of the stern caused more water to enter, which caused the last compartment, located behind the backup engine, to be flooded as well. As three compartments were flooded by water, the ferry was unable to float.\nDesign flaws\nTestimonies gathered from the survivors revealed that water entered the ferry through the bow door. Additional testimonies were given by the crews, who claimed that before the sinking they heard a crack near the bridge. The investigation revealed that there was a divider in the structure of the bow. This divider was responsible to prevent any water from entering the passenger area. Nearby, there was an access door to the forecastle deck. Investigators noted that the seal and the locking mechanism on the door was poor. The force of the wave was propelled by the captain's decision to move directly against the waves. Thus, the waves managed to tear open the access door, which was located on the forecastle deck of the ferry. The divider was proven to be not waterproof, thus allowing water to enter the passenger area.\nInvestigation revealed that most doors on MV Marina Baru 2B were not waterproof. The doors should've been equipped with waterproof seals. Additionally, the investigation team found that there was a window in the engine compartment. The no-glass window was located at a close proximity with the waterline. Investigators noted that any openings were prohibited in the engine compartment. The ventilation on the engine compartment was also located at a near proximity with the waterline. During the sinking, MV Marina Baru 2B rolled several times. Investigators noted that there was a high chance that water managed to enter the ferry through the openings.\nCrew error and poor maintenance\nInterviews from the survivors revealed that the survivors had to take their own initiatives to save the sinking ferry. Survivors claimed that instead of the crews, it was the passengers who managed the emergency, such as removing water from the ferry. There was no crowd control during the sinking, thus panic was not contained.\nThe investigation also noted that several life-rafts and life-jackets were unusable during the sinking. It was revealed that there was minimum maintenance and observation on the reliability of the life-saving equipment on board the ferry.\nAftermath\nNational Transportation Safety Committee issued ten recommendations in response to the accident. The Ministry of Transportation stated that they would evaluate all ferry services in Kolaka. Jasa Raharja stated that they would compensate the victims and the survivors of the disaster.\nSee also\n* Sinking of MV Dumai Express 10\n*Sinking of MV Sinar Bangun\nReferences"
    }
  ]
}