{
  "content": [
    {
      "type": "text",
      "text": "# Sinking of HMS Peacock\n\nUnited States\n|combatant2= United Kingdom\n|commander1=James Lawrence\n|commander2=William Peake\n|strength1=Sloop-of-war 165 Marines and Sailors\n|strength2=Brig-sloop 122 Marines and Sailors\n|casualties1=5 killed (3 drowned) 4 wounded (1 mortally)\n|casualties2=Peacock sunk17 killed (9 drowned)33 wounded (3 mortally)\n}}\nThe 'sinking of HMS Peacock ' was a naval action fought off the mouth of the Demerara River, Guyana on 24 February 1813, between the sloop of war  and the  . After an exchange of broadsides, Hornet was able to rake Peacock, forcing her to strike. Peacock was so badly damaged that she sank shortly after surrendering.\nPrelude\nOn 26 October 1812, the frigate  and sloop Hornet sortied from Boston, Massachusetts. (The frigate  was supposed to accompany them but was undergoing repairs. Several rendezvous were assigned for Essex to meet the other two ships, but the arrangements miscarried.)\nOn 13 December, the two American ships arrived off Salvador, Bahia on the coast of Brazil, where they found the British sloop of war . Commodore William Bainbridge, commanding Constitution, sent a letter to the captain of Bonne Citoyenne, challenging him to fight Hornet. The British captain refused, as his ship was carrying a valuable cargo of bullion. Bainbridge left Hornet to blockade Bonne Citoyenne and cruised to the south, looking for other prizes. Eventually he found and sank the frigate .\nAboard Hornet, Master Commandant James Lawrence was aware from Portuguese sources that a British ship of the line was expected. On 24 January 1813,  appeared and Lawrence retreated into Portuguese territorial waters. After dark, he headed north along the South American coast. On 14 February, Hornet encountered and captured the British packet brig Resolution, which was carrying twenty thousand dollars in gold and silver.\nBattle\nOn 24 February, Lawrence pursued a British merchant brig into the mouth of the Demerara River. As evening drew on, Lawrence then noted a British brig-sloop, , at anchor in the river, and another, Peacock, approaching from seaward.\nHornet beat to windward and gained the advantage of the windward position. Lawrence then tacked, and as Hornet and Peacock passed each other on opposite tacks they exchanged broadsides at \"half pistol shot\". Even at this close range, the British fire went high. Some American sailors were killed and wounded at the mastheads. Peacock suffered heavy damage to the hull.\nCaptain Peake of Peacock turned downwind to bring his opposite battery to bear, but Lawrence had carried out the same maneuver more rapidly. The starboard bow of Hornet came up against the stern of Peacock from where the British could bring no guns to bear, and from this position, Hornets gunners shattered Peacock in a mere four minutes. Peake was killed, and his First lieutenant surrendered and almost immediately made a distress signal.\nAlthough Espiegle was in sight throughout the engagement, it made no attempt to intervene, and Espiegles captain later claimed that he was not aware of the action.\nCasualties\nThe British lost 5 men killed and 33 wounded (three mortally); the Americans lost only one man killed and four wounded (one mortally), most to Peacocks first broadside.\nAftermath\nBoth vessels anchored. (Peacocks main mast fell at this point.) An American prize crew went aboard Peacock and tried to plug the holes below the waterline and throw the guns overboard to lighten the brig, but Peacock sank suddenly. Three American and nine British sailors were trapped below deck and drowned. Peacock sank in only  of water, and four British sailors saved themselves by climbing the foremast, the top of which remained above the water. Four others escaped to the shore in a boat in the confusion.\nThe survivors of Peacock were taken aboard Hornet, where they joined some other prisoners from captured British merchant vessels. Together with some American sailors from a recaptured prize, Hornet was now carrying 277 people. Hornet made for Martha's Vineyard, the nearest point of the American coast known not to be watched by the Royal Navy. Even so, all on board were suffering severely from shortage of water when they arrived on 19 March. The surviving officers of Peacock nevertheless testified to the generosity of Hornets crew. Eventually, Peacocks surviving officers and crew were put on a cartel on which they reached Britain in June.\nAlthough Peacock was more lightly armed than Hornet, mounting eighteen 24-pounder carronades to Hornets eighteen 32-pounder carronades, the overwhelming defeat was more probably due to poor training and lack of practice at the guns. It was said that Captain Peake had concentrated on the appearance of his command rather than its fighting efficiency.\nCommemoration\nin Distress, which is now in the collection of the Yale University Art Gallery.\n]]\nThe sinking was rapidly celebrated in the United States in pictures and in song.\nEngraver Amos Doolittle created the etching The Hornet and Peacock, Or, John Bull in Distress'', which was published on 1813-03-27. It shows a half-bull half-peacock being stung through the neck by a hornet. The hornet is saying \"Free Trade and Sailor's Rights you old rascal!\".\nHis brother, Eliakim Doolittle, at the same time composed a song, whose first verse is:\n|text=\nYe Demo's attend and ye Federalists too,\nI'll sing you a song that you all know is new,\nConcerning a Hornet, true stuff, I'll be bailed,\nThat tickled the Peacock and lowered his tail,\n}}\nA political cartoon John Bull stung to agony by the Wasp and Hornet, similarly carrying the slogan ″Huzza for ′Free Trade and Sailor's Rights′\" and referring to the victories of The Wasp as well, was published on 1813-03-01 and is now in the collection of the Historical Society of Pennsylvania amongst others.\nNotes\n;Footnotes\n;Citations\nPrinted sources\n*  ()\n*Forester, C.S. (1970)[1957] The Age of Fighting Sail. (New English Library).\n*\n* |publisher=Historical Society of Pennsylvania|title=John Bull Stung to Agony by Insects political cartoon, 1813|url=https://digitallibrary.hsp.org/index.php/Detail/objects/12391}}\n*\n*Roosevelt, Theodore: The Naval War of 1812, Modern Library, New York,\n* |url=http://www.teachushistory.org/node/397|title=John Bull Stung to Agony by the Wasp and Hornet|work=TeachUSHistory}}\n* |url=https://artgallery.yale.edu/collections/objects/11442|publisher=Yale University Art Gallery|title=The Hornet and Peacock, Or, John Bull in Distress|id=1955.44.20}}\nExternal links\n*[https://web.archive.org/web/20070927034552/http://www.mywarof1812.com/battles/130224.htm The War of 1812: USS Hornet vs. HMS Peacock]\n*[https://web.archive.org/web/20050914213200/http://www.history.navy.mil/photos/events/war1812/atsea/hnt-peck.htm Naval Historical Center: USS Hornet sinks HMS Peacock, 24 February 1813]"
    }
  ]
}