{
  "content": [
    {
      "type": "text",
      "text": "# Sinking Creek Valley Cluster\n\n| coords_ref      =\n| length          =\n| length_mi       =\n| length_km       =\n| width           =\n| width_mi        =\n| width_km        =\n| area_ref        =\n| elevation       =\n| elevation_avg   =\n| elevation_min   =\n| elevation_max   =\n| dimensions      =\n| designation     =\n| authorized      =\n| created         =\n| designated      =\n| established     =\n| named_for       =\n| visitation_num  =\n| visitation_year =\n| visitation_ref  =\n| governing_body  =\n| administrator   = U.S. Forest Service\n| operator        =\n| owner           =\n| website         =\n| embedded        =\n}}\nThe Sinking Creek Valley Cluster is a region in the Jefferson National Forest recognized by The Wilderness Society for its unique recreational and scenic values as well as the importance of its watershed protection for Johns Creek and Craig Creek.  Sinking Creek Valley is one of the most scenic valleys in Virginia.\nDescription\nThe Sinking Creek Valley Cluster contains wildlands recognized by the Wilderness Society as “Mountain Treasures”, areas that are worthy of protection from logging and road construction.\nThe areas in the cluster are:\n*Sinking Creek Mountain\n*Johns Creek Mountain\nLocation and access\nThe cluster is about six miles north of  Newport Virginia.   Roads and trails in the cluster are shown on National Geographic Map 788 (Covington, Alleghany Highlands.  A great variety of information, including topographic maps, aerial views, satellite data and weather information, is obtained by selecting the link with the wild land’s coordinates  in the upper right of this page.\nBiological significance\nThe land form, climate, soils and geology of the Appalachian highlands, as well as its evolutionary history, have created one of the most diverse collection of plants and animals in the deciduous forests of the temperate world.\nAmong the fauna found in the region are many salamander species, possibly the most diverse in North America.   The biological composition of the area has changed with the disappearance of chestnut, changes in timber harvesting practices, and the decline of land used for agriculture.  The biological diversity of the area will diminish with the loss of habitat.\nGeologic history\nExtending along the western boundary of Virginia, the Ridge and Valley province is composed of long, relatively level-crested, ridges with highest elevations reaching over 3600 feet. The province marks the eastern boundary in the Paleozoic era of an older land surface on the east.  It was uplifted and eroded during the Paleozoic with extensive folding and thrust-faulting.  Resistant quartzite, conglomerates and sandstones form the ridge caps while less resistant shales and limestones eroded to form the intervening valleys.\nThe area was once part of the  New River drainage, making Johns Creek, Sinking Creek, and Craig Creek tributaries of the New River.  However, as much as a million years ago, the James River, with a lower route to the ocean, eroded the hills and captured Johns Creek and Craig Creek. Sinking Creek, on a higher plateau, remained a tributary of the New  River.   The ridges of Johns  Creek Mountain and Sinking Creek Mountain form part of the continental boundary.  Streams on the western side of Johns Creek Mountain flow into Johns Creek and onto the Atlantic Ocean. Likewise, streams on the eastern side of Sinking Creek Mountain flow into Craig Creek and eventually flow into the Atlantic Ocean.   Water on the eastern side of Johns Creek Mountain and the western side of Sinking Creek Mountain flow into Sinking Creek, then onto the New River,  the Ohio River, the Mississippi River and finally into the Gulf of Mexico.\nSinking Creek\nBeginning at the northern end of Sinking Creek Valley and flanked by Sinking Creek Mountain and Johns Creek Mountain, Sinking Creek flows through a narrow valley of farms and pastures.  With a moderate current, and access from several crossing roads, the stream offers an easy paddle for canoeists until it nears the town of Newport where it turns north and encounters an 11-foot mill dam and the beginning of a series of rapids.  As it nears the New River during low water levels, it disappears underground. The stream is crossed by three  covered bridges, a remnant of earlier times when wooden bridges were covered to protect them from the weather.\nCultural history\nRoute 42, the principal road through the valley, once served as an important route for commerce moving into southwest Virginia. Now called the Cumberland Gap Road, it passes along Sinking Creek Valley from  New Castle to Newport.  As it goes southwest from New Castle, the route climbs 1200 feet in a short distance to reach a gap between Sinking Creek Mountain and Johns Creek Mountain.  It then enters the head of Sinking Creek Valley and continues along the valley passing through  Newport.  The road, once called the Fincastle Turnpike, was used by travelers going from Fincastle to Tazewell and other communities in far southwest Virginia.  At Newport it intersected with the Salt Sulphur Turnpike which ran from Christiansburg, Virginia to the present Union, West Virginia, passing by Mountain Lake.\nOther clusters\nOther clusters of the Wilderness Society's \"Mountain Treasures\" in the Jefferson National Forest (north to south):\n*Glenwood Cluster\n*Craig Creek Cluster\n*Barbours Creek-Shawvers Run Cluster\n*Mountain Lake Wilderness Cluster\n*Angels Rest Cluster\n*Walker Mountain Cluster\n*Kimberling Creek Cluster\n*Garden Mountain Cluster\n*Mount Rogers Cluster\n*Clinch Ranger District Cluster\nSee also\n*New Castle Historic District (New Castle, Virginia)\n*Greater Newport Rural Historic District\n*Huffman House (Newport, Virginia)\n*[http://www.wildernessroad-virginia.com/routes/fincastle-turnpike/ Fincastle Turnpike]\nReferences\nFurther reading\n* Stephenson, Steven L., A Natural History of the Central Appalachians, 2013, West Virginia University Press, West Virginia, .\n* Davis, Donald Edward, Where There Are Mountains, An Environmental History of the Southern Appalachians, 2000, University of Georgia Press, Athens, Georgia. .\nExternal links\n* [http://www.fs.usda.gov/r08/gwj George Washington and Jefferson National Forests]\n* [https://wilderness.org/ Wilderness Society]\n* [http://www.radford.edu/jtso/GeolVAHome.html Geology of Virginia]"
    }
  ]
}