{
  "content": [
    {
      "type": "text",
      "text": "# Sinking of Chian-der 3\n\nThe 'sinking of Chian-der 3' was an incident that occurred on 28 May 1986, when the Taiwanese-flagged trawler Chian-der 3 was detected, tracked, fired upon, set on fire and eventually sunk by the   of the Prefectura Naval Argentina, at a location  outside the United Kingdom's Total Exclusion Zone, which covers a circle of  from the centre of the Falklands Islands. Two Taiwanese fishermen were killed; four others were injured.\nBackground\nThe overlapping of the exclusive economic zone of the Argentine mainland and the Falkland Islands and the British exclusion zone for Argentine ships is used by fishing fleets in order to fish without permission, said the Argentine government.\nAccording to an Argentine statement the trawler Chi-Fu 6 was detected fishing in the Argentine zone at 11:45, but she took refuge in the British zone. At 18:25 the trawler Chian-der 3 was spotted again within the Argentine zone of . Despite requests to stop and warning shots being fired by Prefecto Derbes, the trawler escaped and was chased. At 21:05 the Argentine commander stated that he saw that the trawler stopped and emitting smoke from the engine room. He ordered the rescue of the trawler's crew. According to official sources, the trawler was hit by non-explosive rounds. As a result of the incident, one Taiwanese fisherman was killed and four others wounded. Another member of the crew became missing.\nThe Taiwan fishermen's union called it a \"barbaric act\" and the British government condemned it as \"unjustifiable and excessive\".\nReferences\nExternal links\n* Article [http://www.elpais.com/articulo/internacional/TAIWAN/ARGENTINA/Argentina/culpa/capitan/pesquero/taiwanes/Londres/suceso/Atlántico/elpepiint/19860531elpepiint_14/Tes/ \"Argentina culpa al capitán del pesquero taiwanés y a Londres por el suceso del Atlántico\"]. El País (31 May 1986)\n* Article [http://www.elpais.com/articulo/internacional/TAIWAN/ARGENTINA/guardacostas/argentino/hunde/pesquero/Taiwan/aguas/reclamadas/Buenos/Aires/elpepiint/19860530elpepiint_24/Tes/ \"Un guardacostas argentino hunde un pesquero de Taiwan en aguas reclamadas por Buenos Aires\"]. El País (30 May 1986)"
    }
  ]
}