{
  "content": [
    {
      "type": "text",
      "text": "# Sinking of MV Miraj-4\n\n| time                     =\n| place                    = Bangladesh\n| coordinates              =\n| also known as            =\n| cause                    =\n| outcome                  =\n| reported deaths          = 54\n| reported injuries        =\n| reported missing         = 25–75\n| reported property damage =\n| burial                   =\n| inquiries                =\n| inquest                  =\n| charges                  =\n| verdict                  =\n| convictions              =\n| notes                    =\n}}\nOn 15 May 2014, the double-decker ferry 'MV Miraj-4' capsized in the Meghna River,  southeast of Dhaka, Bangladesh.  Between 150 and 200 people were on board at the time, of whom about 75 survived.  As of 17 May, the official death toll stood at 54 with an unknown number of people missing.\nBackground\nFerry travel is common in Bangladesh as the country has many waterways.  Enforcement of safety standards is poor – an estimated 95% of small and medium-sized boats do not meet minimum code – and accidents are common.  Overcrowding and poor maintenance are often a contributing factor to accidents and the government has regularly vowed to strengthen enforcement of safety standards after fatal accidents.  The difficulty of predicting storms, known locally as Kalboishakhi, often causes incidents in the months of April and May.  In 2012,  sank at roughly the same spot as the MV Miraj-4, killing at least 145 people.\nAccident\nOn 15 May 2014, the  double-decker ferry MV Miraj-4 was hit by a large wave as it traveled in the Meghna River,  southeast of Dhaka, Bangladesh.  Survivors said the captain had refused to take cover as a storm began to make the waters rough. \"The sky became black and dozens of us pleaded with [the captain] to take the ship to the nearest shore as we saw the storm coming\", remarked a survivor. \"The storm unleashed three huge waves. The ferry survived the first two, but the third tilted and then sank the vessel within minutes.\"\nAfter the accident, about 40 passengers swam to the shore.  An additional 35 were rescued by fishing boats shortly after the accident.  On 17 May, the wreckage of the boat was recovered and searched for bodies, bringing the official death toll to 54 when search of the wreckage was called off.  Efforts to find further bodies in the river were ongoing. Miraj-4 had a listed capacity of 122 people.  However, eyewitnesses said the actual number on board was close to double that.  No log was kept, so the exact number of passengers is unknown.  Initial reports said as many as 350 were on board, but, as of 17 May, the government estimated between 150 and 200 people had been on the ship at the time of the accident.\nRescue efforts and aftermath\nThe Bangladesh Inland Water Transport Authority (BIWTA) led rescue efforts, overseeing navy, coast guard, and police resources.  An official investigation was launched to determine the cause of the accident.  Initial reports said the surviving crew may have fled the scene after the disaster.  BIWTA chief Shamsuddoha Khandaker said charges against the boat's captain would likely be filed.\nRelatives of the accident victims gathered on the beaches of the Meghna where victims were laid for identification.  As rescue efforts drew on without success, the crowd grew angry, chanting slogans against the BIWTA.  Some members of the crowd attempted to attack the salvage vessels when the search of the wreckage was called off.  Compensation of 20,000 taka (~US$256) was offered to families of the dead.\nReferences"
    }
  ]
}