{
  "content": [
    {
      "type": "text",
      "text": "# Sinking of the SS City of Benares\n\nrescues survivors from a lifeboat from City of Benares which had been adrift for eight days.\n| date =\n| time = 10:03 PM - 10:34 PM\n| duration = 31 minutes\n| place = North Atlantic Ocean\n| coordinates =\n| type = Maritime disaster\n| cause = Torpedo\n| reported deaths = 258\n}}\nThe , a British steam passenger ship, sank on 17 September 1940. The ship was en route to Montreal, Canada, then to Quebec City, and later to New York City. She was carrying 406 people—209 crew, 6 convoy representatives, and 191 passengers, of whom 100 were children ages 2 to 15. Most of the passengers were British, Australian, or Canadian, though twenty-three were from other countries, while most of the crew was Indian (of whom 23 were under the age of 16). The ship was discovered by a German submarine, and in the middle of the night she was torpedoed and sunk, killing nearly all on board.\nSignificance\nThe sinking was one of the worst maritime disasters in the Second World War, and one of the worst maritime disasters in history involving a children's ship. While only 54 of 112 children of the  died, 98 of 123 children on the City of Benares were lost. On the  94 children were lost. The percentage of survival was even worse than that of the Lusitania, with the Lusitanias survival rate being roughly 39 per cent, while the City of Benares survival rate being roughly 36 percent.\nSailing\nThe Benares, as the ship was known, was provided to the British Government in the summer of 1940 by her owners—Ellerman City & Hall Lines—for use as an evacuation ship for children, accompanied by the  and the . The three ships were outfitted and inspected for use and stated as serviceable for the Children's Overseas Reception Board (CORB) scheme. The City of Paris set sail with 45 CORB children on 10 September 1940, the Benares with 90 CORB children on the 13th, and the City of Simla with 37 CORB children a few days later.\nOn Friday, 13 September 1940, the Benares set sail from Liverpool, England, on her first Atlantic crossing, with 209 crew (181 men, 5 women, and 23 boys aged 15 and under), 6 convoy staff members (made up of 4 signalmen, a telegraphist, and the commodore, all male), 90 CORB children (46 boys and 44 girls, ages 5 to 15), their 10 escorts (3 men, 7 women), and 91 fare-paying passengers (37 men, 44 women, and 10 children: 4 boys and 6 girls). The weather was rough on the first night, but for the next few days the wind was light and the sun shone down on the Benares' sweeping promenades.\nAlthough the Benares was an Ellerman passenger liner, all CORB voyages were operated by Cunard-White Star Line, though the crew remained an Ellerman crew. Oddly, if anything were to go wrong during the voyage, Ellerman City & Hall Lines would get the blame, as it was their crew in control of the ship.\nThere was some controversy over the sailing date. The Benares was supposed to sail on 12 September, but mines dropped into the Mersey by the Luftwaffe had prevented this. She had left her berth on the 12th, sailed past the Dockers Clock, but no further, as she awaited the mines to be cleared out. The sailors did not want the liner to sail on the 13th. Many people considered 13 an unlucky number, and it was considered unlucky for any ship to sail on Friday. Many of the crew were worried, as they knew the final deck plan for the SS City of Benares was known as the \"thirteenth plan\". But the Benares' escort ships had a deadline—they needed to escort the incoming convoy of HX71, so they could only protect the Benares for so long—making departure on the 13th necessary.\nThe Benares was in a convoy of 19 merchant vessels (Convoy OB 213) being escorted by the destroyer  and two corvettes,  and . In the early hours of 17 September 1940, the escorts left, leaving the convoy unprotected. On this same day another CORB liner, SS Diomed, set sail with another batch CORB children.\nOn board the Benares, Captain Landles Nicoll argued with Admiral Edmund Mackinnon, the commodore, over whether the convoy should disperse yet. John (Johnny) Mayhew, a nineteen-year-old signalman was ordered by his superior, Bartlett, the Chief Yeoman of Signals, to fetch a coat from the chart room (located on the bridge, the deck above the boat deck, just aft of the wheelhouse). When Mayhew opened the door to the chart room, he heard the voices of the two men arguing. Nicoll wanted the convoy to disperse now. He believed that once they were free and clear of the convoy, they could go full speed to Canada. This would protect them from U-boats, as most U-boats couldn't catch up with a ship as fast as the City of Benares. during her sea trials, while the convoy was moving at a speed of roughly .}} He was probably right, but Mackinnon wanted the convoy to stay together; he believed there was safety in numbers. Besides this, he argued, the ship was currently plowing through a Force 6 gale, and most U-boats had never been able to torpedo a ship in conditions like this. Mayhew returned to the bridge wing and told what he had heard to Bartlett. Bartlett seemed to agree with Nicoll, but he told Mayhew to keep what he had heard to himself. Another man, Second Engineer John McGlashan, believed the ship should be moving faster too. \"Why don't we cut and run for it?\" he asked the Chief Engineer, Alex Macauley, who shrugged. It seemed the smarter thing to do.\nWith the weather worsening, Captain Nicoll ordered that passengers stay inside and had the Indian crew inform the escorts that the CORB children's usual after-dinner deck games were canceled. The children, however, were quite happy, even though it was a miserable day. Now that the convoy was out of the believed U-boat sailing range, the safety orders on board had been relaxed. The children originally had to sleep in their daytime clothes and wear the kapok life vests provided for them, while they had to keep the bulky shipboard life belts nearby (only the CORB children had kapok life vests). The passengers still would have had a daily lifeboat drill, but this was canceled as well, due to the weather.\nIn the distance, German U-boat U-48 had spotted Convoy OB 213. The crew decided they would attack the lead ship first, but they would wait until the cover of darkness to do it. They had no idea what the ship was or what its name was. It was the City of Benares, carrying 155 women and children.\n{| class=\"wikitable sortable\"\n|+Nationality Figures on SS City of Benares\n!Nationality\n!Deaths\n!Survivors\n!Total\n|-\n|England and Scotland\n|127\n|67\n|195\n|-\n|India and Portuguese Goa\n|101\n|65\n|166\n|-\n|Wales\n|12\n|0\n|12\n|-\n|Germany\n|4\n|4\n|8\n|-\n|Canada\n|4\n|4\n|8\n|-\n|Australia\n|1\n|3\n|4\n|-\n|Hungary\n|2\n|1\n|3\n|-\n|Poland\n|1\n|1\n|2\n|-\n|Netherlands\n|2\n|0\n|2\n|-\n|Iran\n|1\n|0\n|1\n|-\n|Switzerland\n|1\n|0\n|1\n|-\n|Czechoslovakia\n|1\n|0\n|1\n|-\n|France\n|0\n|1\n|1\n|-\n|Ireland\n|0\n|1\n|1\n|-\n|United States\n|1\n|0\n|1\n|}\nBarbados\n1\nAttack and sinking\nThe attack\nU-48 had no idea there were women and children on board the Benares. The ship had been painted grey, instead of her normal peacetime bright colors. This caused the crew of U-48 to believe she was a cargo ship carrying goods for the USA (Trade).  .\nThe CORB children had been put to bed at 8:00 PM, but some of their escorts were still awake. Mary Cornish (age 41), an accomplished pianist and piano teacher, went back to the dining room for her own dinner. There, she lingered over a cup of coffee, chatting with the chief escort, Marjorie Day (age 53). There was a lull in the storm and the two went up on deck to take a stroll. Cornish had only a thin skirt, blouse, and sleeveless jacket, so the walk on deck was quite chilly. Another escort, Sybil Gilliat-Smith, a twenty-five-year-old artist and preschool teacher, soon joined them and the three women sang songs on the deck. The women began to sing Christmas carols, despite the fact that the holiday was nearly one hundred days away. At about 9:50 PM, the three women separated (the storm was picking back up again) and went their own ways.\nHeinrich Bleichrodt, the commander of U-48, watched the liner plowing through the waves. He had angled the submarine forward from the Benares, so she was sailing towards him. He ordered two torpedoes fired at approximately 10:00 PM, but he had overestimated his angle on the bow, and both torpedoes sped past the Benares. None of the lookouts in the convoy noticed the torpedo tracks.\nOn board another ship in the convoy, the Richard de Larrinaga, an officer noticed that the gale had increased to a Force 10 (the highest measurement of an ocean gale). This meant that the wind was blowing at fifty-five miles per hour. The officer noted in the log: \"Wind W.N.W. Force 10. Barometer 29.76. Whole Gale. High precipitous seas. Shipping heavy seas fore and aft. Laboring heavily. Fierce Squalls.\"\nBack on U-48, Heinrich Bleichrodt decided not to give up on his massive target. At 10:01 PM, Bleichrodt ordered another torpedo sent towards the ship. It sped towards the liner unsuspected, and 119 seconds after being fired, slammed into the Benares' side. The torpedo made contact on the port stern, exploding just beneath the children's quarters. By approximately 10:03 PM it had obliterated the children's bathrooms and the No. 5.\nCaptain Nicoll was in his cabin with Mackinnon discussing when the convoy should disperse and how it should be carried out. Although his cabin was just one deck beneath the bridge, at the forward part of the ship on the Boat Deck (where ten of twelve lifeboats were), and the torpedo had struck in the stern, he felt the faint tremor of the blast. He quickly made his way to the bridge. His first decision was to turn on the alarm gongs, which would ring throughout the ship. However, due to electrical damage, the alarms rang for only a few minutes in the fare-paying passengers' quarters.\nEvacuation\nBess Walder (age 15) was one of forty-four girls that were asleep on the port side of the ship. She was immediately awakened by the explosion. Climbing down from her bunk, she shook the girl sleeping in the lower bunk, Ailsa Murphy (age 10). The other girl, Patricia Allen, who had survived the recent U-boat attack on the Volendam, was already awake. The girl felt a sense of deja vu, and is quoted to have said, \"Fancy! It's happened again!\"\nWalder put on her bulky shipboard life-belt (in the rush, many of the children couldn't find their kapok life-vests, or their warm clothes), found her mac coat, and helped the girls into their own life-belts. She opened the door and led one of the girls, Patricia Allen, to the staircase. Then Walder went back for Murphy only to discover the door had jammed. She grabbed something and made a hole in the door big enough for her to crawl through. She found Murphy on the floor, bleeding profusely. The girl had fallen over debris, and Walder was afraid she was bleeding to death. Just as she got to the door with Murphy wrapped in her mac, the furniture in the cabin shifted, and a wardrobe slid in front of the door, blocking the only exit. They were trapped in the room, which was quickly filling with water. She called out, but it seemed that no one would hear her over the ringing alarm gongs, breaking glass, and screaming people.\nWalder's best friend, Beth Cummings (age 14), was in the adjacent cabin. She had been awakened by the blast, sitting upright in her bunk, still half-asleep and unaware of the strike. She called for her escort, Mrs. Maud Hillman, who was presumably gathering the other children. Cummings found that the light switch was not working, and the lights in the children's quarters had failed. Stepping out of her bunk, she found herself in a gathering pool of water.\nCummings called to her two cabinmates, Joan Irving (age 15) and Betty Unwin (12). She heard a groan from Unwin, but Irving was silent. Cummings found her bulky cork life-belt, and so did Unwin. In the rush, Cummings realized that Irving was being left behind. The girls climbed back towards the bunk and discovered that Irving was hurt, though she had no visible wounds. Unwin and Cummings dragged Irving out of the cabin and into the crowded corridor, which was filling with water.\nBess Walder was still trapped in her cabin, calling for help. A crew member heard her cries and began hacking at the wall with a hatchet. Walder could hear the faint knocking slowly growing louder, and the man told her to step back. The plaster fell away and as an arm punched through the wall, creating a hole. Walder grabbed the arm and was pulled out of the cabin. \"There's one more in there\", she said, referring to Ailsa Murphy.\nThe man pulled out the injured Ailsa Murphy, who still had Walder's coat draped over her shoulders. Walder handed the girl off into the arms of an escort and joined with Cummings. When they turned the corridor, they discovered wreckage was blocking the way to the main staircase. The girls turned around walking the opposite way (forward) to the other main staircase. But just as they reached this stairwell, it collapsed.\nThey found another staircase and just as they reached the top, the stairs collapsed behind them again. Cummings told the group to wait where they were so she could inspect their muster station, the children's playroom. She found that a jagged line ran across the deck of the massive room, indicating the torpedo had passed just below. The children moved to the embarkation deck, where they would board lifeboats.\nMary Cornish had found another staircase to the deck below. Walking along the hall, she found a wall of debris blocking her way (this was the same wreckage that had stopped Bess Walder and Beth Cummings). With a crewman, she began to tear away pieces of wreckage, ripping her skin in the process, making a hole big enough for her to crawl through. On the other side she found Reserve Escort Lillian Towns (age 30), who had been thrown to the floor by the blast. Upon hearing children screaming, she began to tell them everything was all right. She had managed to gather at least 10 of Mary Cornish's fifteen girls. Cornish saw the Grimmond sisters, with Gussie (the oldest) leading them.\nCornish and Towns led the girls, several of whom were not from Cornish's group, up to the promenade deck to the station for Lifeboat 10. Another group of girls waited to board Lifeboat 8 just forward of theirs, and four of Cornish's girls—Gussie, Connie, and Violet Grimmond, with a seven-year-old girl named Marion Thorne—migrated to this boat. Towns went off to help other children into boats, but Cornish noticed that three of her girls were missing (she had no idea that two of them, Jean Forster and Maureen Dixon, were at the station for Lifeboat 11). She headed back towards the staircase, but an officer stopped her. \"Right miss, time to go\", he said, pointing Cornish back to her boat. The ship was listing further to port every few seconds and Cornish knew the window of escape from the decks below was closing fast. She walked back to the stairwell and descended the stairs. This time, no one stopped her.\nFred Steels was another one of the CORB children. His cabin, being a boy, was on the starboard side, and though the explosion was on the port side (where the CORB girls were situated) his cabin suffered damage. Steels was awoken by an armoire crashing into the wall of his cabin, and the subsequent collapse of the unoccupied bunk above him. The boy struggled beneath the heavy wooden planks, calling to his cabinmates. He heard one of the boys crying, searching for his glasses, but the other boy was silent. It was Paul Shearing (age 11), from Bournemouth. Fred soon realized he was soaked. The pipes had burst, spraying water into the room. Fred pushed aside some planks and was able to crawl out of the bunk bed wreckage. The third boy found his glasses and they stepped into the crowded hallway.\nBess Walder and Beth Cummings found their lifeboat station, Lifeboat 5. Their escort, Maud Hillman, was here with 10 other children besides Bess Walder, Beth Cummings, Betty Unwin, Joan Irving, or Ailsa Murphy. James and Joan Spencer, ages 5 and 9, also stood by. While waiting for rescue, Ailsa Murphy, succumbed to her wounds, \"which mercifully came while she was unconscious\". The escort holding Ailsa, lowered the dead girl into the sea and said a prayer for her.\nThe chief escort, Marjorie Day (age 53), not unlike Mary Cornish, had been only steps away from her cabin when the ship shuddered. She quickly entered her cabin (which was already filling with water), grabbing her coat and vital identification papers, and other papers for the CORB programme. She managed to find the list of all 90 CORB children and which groups they were in, then the escort crawled out of her wrecked cabin, finding water coursing through the hallways and corridors. She heard screams from nearby cabins. \"Get up! Up you go, now!\" she shouted banging on doors and pulling children from rubble. Most of the children were wearing not their kapok vests, but, as a survivor later put it, the \"perfectly horrible\" life-belts. She was relieved that the children had paid attention to the drills. She found the doctor, Margaret Zeal (age 30), who began helping Day to pull children (mostly girls) from the damaged cabins. As they were doing this, one of the four nurses/stewardesses employed by Purser John Anderson, came by and told them that a boy on the starboard side had been killed in the explosion. Miss Day, Dr. Zeal, and the nurse, plus about fifteen girls and boys, made their way to the promenade deck.\nNotes\nReferences"
    }
  ]
}