{
  "content": [
    {
      "type": "text",
      "text": "# Sinking of the ARA General Belgrano\n\n| map_type          = Argentina\n| map_mark          = ButtonRed.svg\n| map_marksize      = 8\n| result            = British victory\n| combatant1        =\n| combatant2        =  Argentina\n| commander1        =\n| commander2        =\n}}\n| units1            = *1 nuclear submarine\n| units2            =\n| casualties1       = None\n| casualties2       =\n| partof            = the Falklands War\n| date              = May 2, 1982\n| image             = ARA General Belgrano underway.jpg\n| caption           = Light cruiser ARA General Belgrano.\n| image_size        = 300\n| campaignbox       =\n}}\nThe Argentine cruiser  was sunk on May 2, 1982, by the British nuclear submarine  during the Falklands War. The sinking led to the death of 323Argentine sailors, almost half of all Argentine casualties during the conflict, and sparked controversy, as the attack occurred outside the exclusion zone established by the British government around the islands. In the UK, some commentators have suggested that the action may have been motivated by political considerations, such as undermining peace talks or bolstering Prime Minister Margaret Thatcher's popularity among the British public. In Argentina, some critics have characterized the sinking of the cruiser as a contentious act, with some even suggesting it could constitute a war crime, though this interpretation is debated and has not been legally substantiated. Some analyses argue that, from a military perspective, the sinking contributed to British naval superiority, which may have influenced the outcome of the conflict. However, this perspective remains part of broader debates about the strategic and ethical implications of the event.\nThe sinking of the General Belgrano is the only case of a warship being torpedoed and sunk in action by a nuclear submarine, and one of only two cases of a warship being sunk by any type of submarine since the end of the Second World War., sunk by the Pakistani submarine  during the 1971 Indo-Pakistani War.\n}}\nBackground\nArgentina\nIn March 1982, diplomatic relations between Argentina and the United Kingdom became increasingly strained following stalled negotiations over the sovereignty of the Falkland Islands, South Georgia, and South Sandwich Islands. An incident on South Georgia Island on March 19, when a group of workers from an Argentine company contracted to dismantle old whaling facilities on the island landed in Port Leith and hoisted an Argentine flag, was interpreted by the British as a provocation and led to an escalation of tension between the two countries, with the Argentine fleet anchored in Port Belgrano going on alert and secretly beginning its preparations, which, according to later accounts, were aimed at asserting Argentina's claim over the islands through a military operation. Commander , captain of the , later commented about the first notification received from the Argentine Navy's General Staff about the war action to be taken in the Falkland Islands, stating: \"We were asked for total and absolute secrecy regarding this decision since the surprise factor would be a priority in this maneuver.\"\nThe Argentine fleet set sail from Port Belgrano on March 28, becoming Task Force 40 (FT 40) under the command of Rear Admiral Walter Allara, with the Argentine forces landing on the Falkland Islands on April 2 and South Georgia the following day, asserting their claim to sovereignty over the territories. The General Belgrano was the only Argentine warship that did not take part in the operation, as its annual maintenance and repairs were still underway and could not be expedited in time for the mission. The Argentine fleet only returned to Port Belgrano on April 6; in its absence, the repair teams' efforts could be concentrated on the cruiser, and its repairs were completed after the first week of April. In addition, an Alouette III helicopter from the Argentine Naval Aviation was embarked, thus increasing the ship's surveillance capacity. After the repairs were completed, the focus shifted to training the recruits, which was emphasized as an essential aspect of the ship's readiness. The ship's medical department was also reinforced to address potential wartime needs. In peacetime the crew was 30% smaller than in wartime, but on this occasion, the Belgrano had 1,093 men, including 408 recruits and two civilians. The ship then adopted three rotating guard shifts as long as the ship was not in combat, with each crew member working an eight-hour shift each day. In this way, the ship aimed to remain operational and prepared to respond promptly with all systems and services, according to the protocols established at the time.\nWith the British expeditionary force moving toward the South Atlantic, and given the lack of progress at the diplomatic level towards a peaceful resolution of the conflict, the ships of the Argentine Navy became \"Task Force 79\" (FT 79) under the command of Rear Admiral Walter Allara, and its main ships were distributed into three task groups: Task Group 79.1 (GT 79. 1), made up of the aircraft carrier , three corvettes, a destroyer and a tanker; Task Group 79.2 (GT 79.2), made up of five destroyers and a tanker; and Task Group 79.3 (GT 79.3), made up of the ARA General Belgrano. In distributing the forces across the theater of operations, strategic emphasis was placed on the area to the north of the islands, where \"GT 79.1\" and \"GT 79.2\" were deployed, while \"GT 79.3\" was positioned in the southern area. the cruiser's presence in the region also served as a deterrent against possible Chilean intervention.}}\n# Avoid tactical contact with enemy units armed with anti-ship missiles;\n# If necessary, and depending on the situation, refuel at Ushuaia Naval Base.\nAfter postponing its departure twice, the cruiser set sail from Port Belgrano on April 16, arriving at Isla de los Estados on April 19. After patrolling the area for a few days and carrying out live-fire exercises off the island's southern coast, the General Belgrano docked at Ushuaia Naval Base at 18:30 on April 22, to refuel and exchange a batch of defective ammunition. The members of its crew used this stop to send letters to their families and friends, which were dispatched before the ship resumed its mission. The cruiser left Ushuaia at 8:30&nbsp;a.m. on April 24, having received a communication that afternoon transmitting the reorganization of \"FT 79\" and new orders; two destroyers and a tanker had been assigned to \"GT 79.3\", which, with the Belgrano as its flagship, was tasked with operating in the area between the meridians of Isla de los Estados and Burdwood Bank. The ARA Piedra Buena and the ARA Hipólito Bouchard then separated from GT 79.2 and headed south to join GT 79.3, meeting up with the General Belgrano and the tanker YPF  north of Isla de los Estados on April 28, with joint exercises being held that afternoon between the cruiser and the destroyers to practice tactical maneuvers and improve communication between the ships. The destroyers' mission was to protect the Belgrano from surface enemies, air attacks, and submarines, forming a curtain of protection.\nDuring the afternoon of April 29, two communications were received, one ordering the GT 79.3 to head east towards the area south of the Falkland Islands on May 1, and the other authorizing the use of weapons against targets identified as enemy, subject to operational discretion. One of the measures to prepare for departure was the refueling of the ships by the YPF Puerto Rosales, which was scheduled for the following day.\nDuring the morning of April 30, the refueling of the two destroyers was completed; the refueling of the cruiser began at 4 p.m. but was interrupted an hour later due to worsening weather conditions. That afternoon, the Argentine government issued Communiqué 37, stating that any British ship or aircraft within  of the Argentine coast, including the mainland and the Falkland Islands, South Georgia, and South Sandwich, would be considered a potential threat. The refueling of the General Belgrano was completed during the morning of May 1, and GT 79.3 began sailing east at around noon, leaving the Puerto Rosales anchored off the island of Estados. That day, the Argentine government issued Communiqué 40, broadening the scope of the declaration to include all British ships in the South Atlantic that were heading for the theater of operations or perceived as posing a threat to national security.\nOn May 1, British forces began naval bombardments and air raids against military targets in the Falkland Islands, and their persistence and intensity, along with the approach of a significant portion of the British fleet to the eastern coast of the archipelago, led the Argentine military leadership to assess that a landing was likely imminent. The Argentine Air Force responded to the offensive but faced resistance from the Sea Harriers launched from the aircraft carriers  and , with the Argentine Navy receiving urgent communication shortly after 8 p.m. with new orders for the task groups, which were instructed to position themselves to potentially engage the British fleet, assessing its operational focus as a factor that could limit its flexibility.\nThe operation planned by the Argentine Navy General Staff consisted of a pincer maneuver around the islands, with GT 79.1 led by the aircraft carrier ARA Veinticinco de Mayo positioning itself to engage from the north and GT 79.3 led by the General Belgrano attacking from the south. However, in 2000, Captain Nestor Cenci, the General Belgranos logistics officer, revealed that the ship's carpenters had constructed mock anti-ship missile launchers from wood in an attempt to deceive the British.}} The scenarios evaluated by Commander Héctor Bonzo and his staff included entering the Total Exclusion Zone (TEZ) decreed by the British around the islands, tactical contact with enemy ships, repelling air attacks and attack by nuclear submarines. The British nuclear submarines were considered highly effective due to their speed and extended ability to remain submerged, providing a significant tactical advantage over the resources available to the Argentinians; The cruiser lacked dedicated anti-submarine systems, while the destroyers were equipped with systems offering moderate capability against conventional submarines.\nThe new orders indicated that at 05:30 on May 2, GT 79.3 should head towards the British task force, which was inside the TEZ. However, a malfunction in one of the engines of the Veinticinco de Mayo and unfavorable weather conditions for the operation of its planes led to the postponement of the start time of the attack, the element of surprise was compromised when GT 79.1 was detected by a British plane at around 00:00. A report received at 01:00 suggested a possible cancellation of the operation, as the British fleet had ceased its air attacks on Stanley and the aircraft carriers had repositioned themselves away from the islands, increasing their operational flexibility. The order to definitively cancel the attack came at 05:00, with GT 79. 3 to head west and remain on standby between the Ignacio and Julián tactical zones, around  east of Isla de los Estados and   south of the TEZ. So, at 05:11 the Belgrano headed west, arriving at the indicated standby zone at around 15:20, noting a worsening of weather conditions throughout the day, indicating the likelihood of an approaching storm.\nUnited Kingdom\nFollowing the deployment of Argentine forces to the Falkland Islands, South Georgia, and South Sandwich on April 2, 1982, the United Kingdom sent two British Royal Navy task forces totaling 109 vessels and 15 air squadrons to the South Atlantic, with the stated objective of asserting sovereignty over the islands: Task Force 324 (TF 324), commanded directly from the Strategic Command in Northwood by Admiral John Fieldhouse, composed of the nuclear submarines (, , ,  and ); and Task Force 317 (TF 317), under the operational command of Rear Admiral Sandy Woodward, made up of aircraft carriers (HMS Hermes and HMS Invincible), destroyers, frigates, transport ships and other auxiliary vessels. On April 12, with the fleet in full swing, the UK established a 200-nautical mile Maritime Exclusion Zone (MEZ) around the Falkland Islands, within which Argentine military vessels were subject to attack, with the objective of limiting the reinforcement of Argentine positions on the islands. On April 23, the British government sent a message to the Argentine government via the Swiss embassy in Buenos Aires, stating that, irrespective of the establishment of the MEZ, any Argentine vessel or aircraft perceived as a threat to British forces could be engaged. The most relevant units of the British expeditionary force arrived at the MEZ on April 29; having established its presence in the area, on April 30 the United Kingdom established a Total Exclusion Zone (TEZ) with the same area as the MEZ, within which any vessel or aircraft could be attacked without warning.\nThe nuclear submarine HMS Conqueror, commanded by Christopher Wreford-Brown, set sail from Her Majesty's Naval Base (HMNB) Clyde in Scotland for the South Atlantic on April 4, arriving in the theater of operations on April 11 and began patrolling the area around South Georgia Island. In addition to its normal crew, the submarine carried a group of personnel from the Special Boat Service (SBS), who landed on the north coast of the island on April 19, in preparation for Operation Paraquet. The Conqueror continued its patrol mission until April 23, when it received a report that an Argentine submarine (the ) heading towards the island and initiated a search operation. However, despite the initial setbacks, British forces took control of the island on April 25.\nConqueror continued to patrol the area around South Georgia Island until April 28, when it received orders to sail west with the mission of searching for enemy ships, after receiving reports suggesting the presence of Argentine ships north of the Isla de los Estados.s presence when it refueled in Ushuaia by Chilean observers, who may have passed this information on to the British.}} It reached its destination on April 30, having picked up the sound of propellers that same night using its sonar. On the morning of the following day (May 1), Commander Wreford-Brown spotted GT 79. 3 in the middle of refueling, but as the Argentine ships were outside the TEZ, Conqueror did not engage in accordance with the rules of engagement of TF 324, which permitted attacks outside the TEZ only on the aircraft carrier Veinticinco de Mayo. The submarine therefore monitored GT 79.3 as it headed east towards the area south of the Falkland Islands, relaying its position to the Strategic Command in Northwood.\nOn May 1, British forces began naval bombardments and air strikes against military targets in the Falkland Islands. The Argentine Air Force reacted to the offensive, engaging in combat with the Sea Harriers from Hermes and Invincible, while the Argentine Navy positioned itself to attack the British fleet, which faced operational constraints due to its commitment to the operation. Rear Admiral Sandy Woodward was informed by Conqueror about the movement of the Belgrano task group and reports suggesting that the Veinticinco de Mayo task group was approaching from the north.\nAssessing the possibility of the Argentines' intention to carry out a pincer maneuver around the islands, with the aircraft carrier attacking from the north and the cruiser from the south, Woodward ordered his forces to take up more defensive positions. Woodward opted for defensive positions, as his forces were not positioned to act against the Argentine warships; the Veinticinco de Mayo was the biggest threat and the preferred target, but the exact location of the Argentine aircraft carrier remained uncertain; as for the General Belgrano, it was being followed by the Conqueror, whose restrictive rules of engagement did not allow it to attack the cruiser outside the TEZ. Despite the General Belgranos older design, Woodward considered its group a credible threat due to the destroyers' anti-ship missiles and the cruiser's armour, which provided significant protection against modern shells, bombs, and missiles, posing a challenge for the available resources of \"TF 317\". Unable to order Conqueror to attack the General Belgrano under the existing rules of engagement, and concerned that formally requesting authorization from the Strategic Command in Northwood could cause delays, Woodward issued a direct order for the submarine to engage the Argentine cruiser, anticipating that his order would be relayed to Northwood and understood by his superiors as an indication of the urgency of the situation.\nAdmiral John Fieldhouse and the Chief of the Defence Staff, Admiral Terence Lewin, went to the country residence of Chequers, on the outskirts of London, seeking political support for changing the rules of engagement of TF 324, in order to allow nuclear submarines to attack Argentine warships outside the TEZ, a move that represented a shift from the previously established defensive guidelines. The War Cabinet led by Prime Minister Margaret Thatcher decided to relax the rules of engagement for TF 324, authorizing nuclear submarines to attack any Argentine warship that posed a danger to British forces, whether or not it was inside the TEZ. Thatcher later wrote, \"It was clear to me what had to be done to protect our Forces\", while the then Secretary of State for Defence, John Nott, described it as \"one of the easiest decisions of the whole war\", reflecting their perspectives on the decision, but the head of the British delegation to the UN expressed concern about the potential impact of this decision on the organization's perception of the UK's role in the conflict.\nSinking\nAt 1:30&nbsp;p.m. on May 2, the Strategic Command in Northwood authorized Conqueror to attack the General Belgrano. At around 4:00&nbsp;p.m., after requesting confirmation of the order and positioning itself for the attack, the British submarine fired three Mark VIII torpedoes from a distance of approximately . The Conqueror was equipped with Mark 24 Tigerfish guided torpedoes, but Commander Wreford-Brown chose to use 21-inch Mark VIIIs, armed with a  torpex explosive charge, which were deemed more effective against the cruiser's armoured sides.\nGT 79.3 was reportedly unaware of the imminent attack. At 16:01, while the gunners on watch on the General Belgrano were testing equipment and moving turret II in search of possible targets on the horizon, the ship experienced a significant explosion, followed by a power outage and loss of lighting, and the cruiser immediately began to heel to port. The torpedo hit the ship in the area of the aft engine rooms, just beyond the edge of the side armour, penetrating the hull before exploding inside. The explosion destroyed the electrical system, interrupting the motive power and rendering the emergency electrical generator useless, with a fireball passing through the ship's decks and causing structural damage, including a hole approximately  wide in the deck. A few seconds later, a second torpedo hit the General Belgranos bow between turret I and the capstan, outside the area protected by the ship's side armour or internal anti-torpedo bulge, causing an explosion that resulted in the separation of approximately  of the ship's bow. It is estimated that 272 men lost their lives due to the immediate impact of the torpedo explosion or subsequent events. The third torpedo fired by the Conqueror missed its target and exploded next to the hull of the ARA Hipólito Bouchard, without causing any major damage. However, in 2000, the captain of the ARA Hipólito Bouchard, Washington Barcena, stated that the torpedo did explode, but near the hull rather than upon direct contact with it. This claim could support the theory that the damage resulted from shock waves caused by the torpedo self-destructing after missing its target.}}\nOnly the autonomous telephone network linking the command bridge to the Damage Control Center remained active, and the damage control teams assessed that their stations were in a critical condition and that the damage exceeded the capacity of the available resources to manage. The watertight doors leading to the main deck were then opened to speed up the evacuation of the crew from the lower decks, which, due to the lack of lighting, relied on individual flashlights for visibility. The evacuation process was further complicated by the inoperability of the loudspeaker network and the accumulation of smoke and oil in the areas affected by the torpedo explosions. Crew members who reached the main deck assembled at the pre-defined evacuation stations, following orders transmitted via portable loudspeakers.\nAt 4.10 p.m., the ship was already heeled over at a 10º list and the inclination was increasing at a rate of 1º per minute, with the cruiser starting to submerge at the stern as water entered through the breach caused by the first torpedo explosion, which could not be pumped out due to the power failure. The risk of the turrets exploding was heightened by the fires that had started inside the ship - especially in turret IV, located close to where the first torpedo hit - and the helicopter's fuel tanks were thrown overboard for fear that they would explode.}} and smoke inhalation. The ship's medical team coordinated the evacuation of the wounded and checked the cabins on the lower decks for the wounded, heading for the main deck when there were no wounded left in the infirmary. Several crew members descended to the lower decks to assist their companions, with some succumbing during the effort. Other crew members, lacking proper clothing for the weather conditions, reached the main deck where improvised ponchos were made using wool blankets from the beds.}}\nCommander Héctor Bonzo postponed the order to abandon the ship, considering the adverse weather conditions in the South Atlantic, decreasing to approximately half that speed during the ship's abandonment. The wind chill factor was , and the seawater temperature was . Under these conditions, survival time in the water is estimated to be approximately 5 minutes.}} and aiming to allow more crew members to escape from inside the vessel, but at 4.23 p.m., with the ship heeled over at 20º, he finally gave the order to abandon ship. Boarding the port lifeboats was facilitated by their alignment with the ship's side due to the heel and favorable wind, while on the starboard side, the higher position of the ship's side and opposing wind complicated boarding and separation. One of the General Belgranos two outboard motor inflatable boats was used to separate lifeboats stuck near the hull. Some lifeboats were maneuvered to the bow of the cruiser, where one sank after being struck by the falling anchor chain and another was damaged upon hitting twisted metal from the second torpedo explosion, prompting its occupants to swim to other lifeboats. The rough waves hindered visibility and communication between lifeboats, resulting in some being overcrowded with more than thirty people while others had as few as three. At 4.40 p.m. the evacuation of the ship was complete, and shortly after, Commander Héctor Bonzo and a petty officer entered the water and swam to the lifeboats. At 4.50 p.m., the 60º heel foreshadowed the sinking, and ten minutes later the cruiser was swallowed up by the waters of the Atlantic.\nRescue operation\n{| class=\"toccolours\" cellspacing=\"0\" cellpadding=\"4\" align=\"right\" style=\"margin:0 0 1em 1em; font-size: 95%;\"\n! colspan=\"4\" align=\"center\" bgcolor=\"#ccccff\" |Results of the rescue operation\n|-\n!Ship\n!Survivors\n!Dead\n!Total\n|-\n|ARA Francisco de Gurruchaga (A-3)\n|363\n|2\n|365\n|-\n|ARA Bahía Paraíso (B-1)\n|70\n|18\n|88\n|-\n|ARA Hipólito Bouchard (D-26)\n|64\n|0\n|64\n|-\n|ARA Piedra Buena (D-29)\n|273\n|0\n|273\n|-\n|Belokamensk\n|0\n|3\n|3\n|-\n|TOTAL\n|770\n|23\n|793\n|}\nThe Piedra Buena and the Hipólito Bouchard did not detect the situation on the General Belgrano due to a power failure caused by the first torpedo explosion, which disabled radio communication, and poor visibility conditions that obscured the cruiser's lights. Additionally, evidence suggested that the group had been attacked by a submarine, as the Hipólito Bouchard reported an impact consistent with a torpedo explosion. However, the ships were unable to detect Conqueror with their sonars, likely due to the technological capabilities of the British submarine. As Conqueror executed evasive maneuvers and distanced itself from the site of the attack, the two destroyers initially moved towards the mainland,s boilers detonating.}} delaying their realization of the incident involving the General Belgrano. At 17:00, the cruiser's radar echo disappeared from the screens, signaling a likely sinking. Upon receiving the information, the command of FT 79 directed the Piedra Buena to return to the last known position of the General Belgrano, while the Hipólito Bouchard maintained a position at a distance. Additionally, the ARA Francisco de Gurruchaga was dispatched to the operations area.\nIn the meantime, it had become dark and the weather conditions had worsened. Several life rafts were tied together with moorings to improve radar visibility and provide mutual support. However, the movement caused by the waves led to the detachment of the mooring hooks, which posed a risk of damaging the rafts' floats. As a result, the decision was made to cut the moorings, causing the life rafts to scatter. The wind broke the locks on the life rafts' canvas doors, allowing water to enter and lowering the temperature inside the rafts to below . The storm reached its peak at 9 p.m. and continued into the night, with waves reaching nearly  in height and winds of . The ocean currents were outweighed by the storm, causing the life rafts to drift southeast towards the Antarctic Circle. The storm also hampered the progress of the search vessels, limiting their speed to . The Piedra Buena was the first ship to reach the point of contact but found no evidence of the General Belgrano or the life rafts. In the early hours of May 3, the weather conditions and the state of the sea improved somewhat and two P-2 Neptune aircraft from the Argentine Naval Aviation joined the search operation. At 09:00, the Neptune 2-P-111, commanded by Captain Pérez Roca, spotted a large oil slick in the sea, but there was still no sign of the lifeboats. At around 1 p.m., Petty Officer Ramón Leiva made visual contact with a large number of life rafts spread over an area approximately  long, about  southeast of the contact point. The plane communicated with the survivors in the life rafts and transmitted its position to the ships involved in the search, which then converged on the indicated area.\nAt around 3 p.m., some twenty-two hours after the sinking, the work of rescuing the survivors finally began, made more difficult by the state of the sea and winds of more than  caused by the storm that continued to batter the region. In the lifeboats with only four or five men, some were found dead; in lifeboats with more men, the shared space helped improve survival chances, but flooding, combined with the lack of movement and low temperatures, led to circulation problems and frostbite, particularly in the legs. By nightfall, several lifeboats remained to be collected, so the rescue operations continued overnight. At 4 a.m. on May 4, the ARA Francisco de Gurruchaga rescued Commander Héctor Bonzo and headed for the mainland around 5.30 am. The destroyers continued the rescue operation until the ARA Bahía Paraíso arrived at 07:15 am, at which point it began rescuing the remaining lifeboats after its helicopter had transferred the injured rescued by the other two ships. However, the weather conditions improved, facilitating the rescue operations, and at 1 p.m., the Piedra Buena headed for the mainland, followed by the Hipólito Bouchard at around 4 p.m.. The Bahía Paraíso remained in the area to ensure there were no further survivors to be rescued with the help of an L-188 Electra aircraft. The naval search operation ended, and the ship headed for the mainland at 10:30&nbsp;p.m. on May 7. Air operations continued until May 9, when it was determined that there were no more survivors in the area.\nThe Piedra Buena, Francisco de Gurruchaga, and Hipólito Bouchard arrived at the Ushuaia Naval Base between 05:30 and 14:00 on May 5. The survivors were then given new clothes and food, and the wounded were transported to the hospital. Given the circumstances, neither the public nor the press were allowed access to the naval base, and the survivors were not permitted contact with the outside world. Once the identification process was complete, the survivors were airlifted to Port Belgrano, where they were received by family members and others. A large number of press representatives had also gathered there, seeking information about the sinking and the survivors. The Argentine Navy decided that a press conference would be an effective way to address the requests and provide information, so at 4 p.m. on May 7, Commander Héctor Bonzo held a press conference in front of 400 representatives of the national and international press, where he reported on the ship's operations, the attack, the time spent in the lifeboats, and the rescue. At 1 a.m. on May 9, the Bahía Paraíso arrived at the Ushuaia Naval Base with the last survivors on board. Later, the Soviet fishing vessel Belokamensk }} unloaded three bodies at the port of Mar del Plata that had been recovered from the sea several days earlier. In total, 793 crew members were rescued, and 323 were confirmed deceased.\nConsequences\nPolitically, the sinking of the General Belgrano had significant consequences for the UK, as the attack was perceived by some as disproportionate and the circumstances raised questions about whether the British followed their own rules. Furthermore, the sinking occurred fourteen hours after Peruvian President Fernando Belaúnde Terry had presented a proposed peace plan and called for regional unity. However, Margaret Thatcher stated that she had not received the plan before the attack took place. The diplomatic consequences of the attack prompted the United Kingdom to engage more actively in peace initiatives, leading to the acceptance of the Peruvian peace plan proposal on May 5. However, the Argentine government rejected it the following day. The British continued to present ceasefire proposals until June 1, but all were rejected by the Argentine government.\nRegardless of the political and diplomatic consequences of the sinking, from a military perspective, the attack ended the immediate threat posed by the Argentine pincer maneuver against the British task force. More importantly, the presence of British nuclear submarines contributed to the decision of the Argentine Navy (except for the submarine ARA San Luis) to return to port, where they remained for the duration of the conflict. According to the then Chief of the US Atlantic Command, Admiral Harry Train, \"With the arrival of the British nuclear submarines, there is no longer any place for the Argentine Navy on the seas.\" British nuclear submarines continued to operate in the waters between the Argentine coast and the Falkland Islands until the end of the conflict, performing reconnaissance tasks and providing TF 317 with early warning of potential Argentine air attacks. The reduced role of the Argentine Navy during the remainder of the conflict impacted its operational effectiveness and its influence within the Argentine government.\nWith the warships out of the conflict, the main role in defending the islands fell to the Argentine Air Force and Argentine Navy aircraft operating from the mainland. Despite the heavy losses inflicted on the British force, the withdrawal of the Argentine Navy following the sinking of the General Belgrano allowed the British Royal Navy to establish control over the seas, which played a significant role in the subsequent British operations. \"That virtually ended the war\", said Harry Shlaudeman, the US ambassador in Buenos Aires at the time. \"With the Argentine Navy out of the conflict, how could they supply their troops? Impossible\".\nControversy over the sinking\nThe sinking of the General Belgrano generated a great deal of controversy. The death of 323 Argentine sailors as a result of the attack drew criticism from some sectors of the international community, including opponents of the war, and became a cause célèbre for opponents of the war, with the sinking of the cruiser described by critics as a disproportionate use of force on a ship carrying a large number of crew members, many of whom were conscripts. Critics argue that the ship posed no threat to the British fleet and that its sinking was unnecessary, citing its location outside the Total Exclusion Zone (TEZ) and its movement away from the Falkland Islands at the time of the attack. Supporters of the action, however, argue that the exclusion zone was not the sole determinant of legitimate targets and that the cruiser posed a potential threat. In the UK, some, such as Labour MP Tam Dalyell, have suggested that the action was carried out to undermine peace talks and bolster Margaret Thatcher's popularity with the British public, while others defend the decision as a necessary military action during wartime. In Argentina, some view the sinking of the cruiser as a potential war crime, a perspective that remains contested in international discourse.\nLegal status\nThe debate over the legitimacy of the attack began when a map prepared by US intelligence was revealed, showing the General Belgranos last recorded position slightly south of the boundary of the TEZ. Historically, exclusion zones have been declared for various reasons, including the protection of neutral vessels, because under international law, during a war, a belligerent vessel can generally be attacked anywhere outside the territorial waters of non-belligerent countries, but neither the United Kingdom nor Argentina declared war during the conflict. It has been suggested that the British established the TEZ to simplify decision-making regarding potential threats posed by ships or aircraft in the zone. Supporters of this approach argue it was a practical measure for self-defence during the conflict, but this concept represented an innovation under international law, as the United Nations Convention on the Law of the Sea does not explicitly address the establishment of such zones. The legality of the TEZ's establishment was contested by Argentina and the Soviet Union. However, the zone was largely respected by non-belligerent countries.\nAlthough the ship was outside the exclusion zone, evidence suggests that both sides may have understood that this was not necessarily the limit of British action. On April 23, the British government sent a message to the Argentine government clarifying that, regardless of the establishment of the exclusion zone, any Argentine vessel or aircraft that posed a threat to British forces would be attacked. Interviews carried out by Martin Middlebrook for his book, The Fight for the Malvinas, suggest that some Argentine naval officers interpreted the message as a clarification that Argentine vessels and aircraft operating near the exclusion zone could be attacked. \"After the April 23rd message, the entire South Atlantic became an operational scenario for both sides. We, as professionals, just said what a shame it was that we lost the Belgrano,\" said Rear Admiral Walter Allara, who was in charge of the task force of which the General Belgrano was a part. On the British side, Rear Admiral Sandy Woodward, operational commander of TF 317, justified the action by arguing that they could not allow an Argentine warship to remain near the exclusion zone and potentially launch an attack from that position. In his book, One Hundred Days: The Memoirs of the Falklands Battle Group Commander, Woodward states that he perceived the General Belgrano, as part of the southern arm of a pincer maneuver around the islands targeting the British task force, as a threat that needed to be neutralized.\nIn 1994, the Argentine government formally recognized the sinking of the General Belgrano as a legitimate act of war. However, in March 2012, then Argentine president Cristina Kirchner referred to the sinking as a war crime during her speech to open the legislative year, renewing discussions about the event. The thesis that the sinking of the cruiser constituted a war crime has not been endorsed by the Argentine Navy, which maintains that the cruiser was 'where it should have been' and engaged in \"a combat action\". Several Argentine officers involved in the conflict have also publicly expressed views supporting the action of the submarine HMS Conqueror; Admiral Enrique Molina Pico, former Chief of Staff of the Argentine Navy, argued in a letter published in the Argentine newspaper La Nación on May 2, 2005, that the General Belgrano was part of an operation that posed a real threat to the British task force, was staying away for tactical reasons, and that its location outside the TEZ was irrelevant because it was a warship on a tactical mission; Commander Héctor Bonzo, captain of the General Belgrano, in an interview in May 2003, admitted that the move to withdraw from the British task force was temporary, and that the cruiser's mission was to attack; and frigate captain Pedro Galazi, second-in-command of the General Belgrano, stated in interviews with the Argentine newspapers Clarín and La Capital in October 2005, that in his view, the two countries were at war and that it was unreasonable to argue that the British should not attack because the cruiser was outside the exclusion zone. \"The exclusion zone is an important geographical diagram in blockade situations, but not in a war,\" he explained.\nShip's course\nThe British government's first official communiqués on the sinking stated that the General Belgranos task group was heading towards the British fleet when it was attacked. This claim was contested by the Argentine government, which provided contradictory information, contributing to the controversy surrounding the sinking.\nBritish historian Lawrence Freedman argued in the second volume of his work, Official History of the Falklands, that the military and political leaders were not informed of the General Belgranos change of course before the ship was attacked. Freedman claims that this information was sent by HMS Conqueror to Strategic Command in Northwood four hours before the attack but asserts that it was not passed on to Rear Admiral Sandy Woodward or Margaret Thatcher's government. Freedman notes that tactical information, such as the course and speed of enemy ships, is typically not included in reports for the political leadership. According to Woodward, strategic decisions are based on position and capability rather than on rapidly changing variables like speed and direction. As Woodward explained, \"The speed and direction of an enemy ship may be irrelevant, as both can change rapidly. What counts is its position, its capability and what I believe to be its intent\", emphasizing the dynamic nature of tactical considerations.\nChanging the rules of engagement\nAs part of TF 324, HMS Conqueror operated under different rules of engagement than the surface vessels of TF 317. While Woodward was authorized to attack any Argentine ship or aircraft that posed a threat to TF 317, the nuclear submarines in TF 324 were subject to stricter rules of engagement. Another factor contributing to the debate over the sinking was the adjustment of the rules of engagement for TF 324 to permit Conqueror to attack the General Belgrano outside the TEZ.\nThis was not the first instance of changes to TF 324's rules of engagement during the conflict. Initially, TF 324 was authorized to attack Argentine vessels only within the Maritime Exclusion Zone (MEZ). By April 30, military leaders had persuaded Margaret Thatcher's War Cabinet to amend the rules, allowing nuclear submarines to target the aircraft carrier ARA Veinticinco de Mayo outside the TEZ because the range of its aircraft posed a threat to British ships.\nLifting the Jolly Roger\nHMS Conquerors decision to hoist the Jolly Roger (a black flag featuring a white skull and two crossed torpedoes) upon returning to its base at Faslane drew criticism in the Argentinian media. The British Royal Navy later clarified that for its submarines, this act is a historical tradition symbolizing the sinking of enemy ships. When asked about the incident, Commander Christopher Wreford-Brown stated, \"The Royal Navy spent thirteen years preparing me for such an occasion. It would have been considered extremely dreary if I had missed it.\"\n\"Gotcha\"\nThe Sun tabloid's May 4, 1982, headline, \"Gotcha\" is among the most notable and widely discussed headlines in a British newspaper about the sinking of the General Belgrano. The Suns editor, Kelvin MacKenzie, reportedly drew inspiration for the headline from an off-the-cuff exclamation by managing editor Wendy Henry upon hearing initial reports that an Argentine cruiser had been sunk by a British submarine. After the first editions were printed, reports suggested that all the crew might have died, prompting MacKenzie to alter the headline in later editions to \"Did 1,200 Argies drown?\". This change was made despite opposition from Rupert Murdoch, owner of The Sun.\nThe original headline was seen by relatively few readers in the UK, as it was used only in early editions in the north of the country; later editions in the north and all editions in the south carried the modified version. Nevertheless, MacKenzie faced criticism from some commentators who argued that the headline glorified war. The original headline also sparked controversy and protests. MacKenzie later defended his choice, stating: \"Gotcha was mine, and I'm very proud of it. For me, the fact that the enemy had died was a good thing, and I never lost any sleep over it.\"\nPolitical controversy in the UK\nThe economic policy of Thatcher's government had diminished the Conservative Party's popularity before the war began, and it seemed likely that the party would be overtaken in the 1983 elections by the Labour Party or the Liberal Party and its allies. The decision to launch a large-scale military operation after the Argentine invasion of the islands was risky, but victory in the conflict had a significant impact on British public opinion and played a key role in Thatcher's re-election. The Conservative Party's use of the war's outcome to its advantage during these elections contributed to the politicization of the controversy surrounding the sinking of the Belgrano. Opponents of the government claimed that the attack had been ordered by Thatcher to derail the peace talks and boost her popularity with the British public.\nWhen news of the sinking reached the UK, British Secretary of State for Defence John Nott quickly announced it to the House of Commons, including several pieces of erroneous information in his hastily prepared speech, notably that the General Belgranos task group was heading toward the British fleet when it was attacked. These errors gained political significance, given the British government's policy of defending all ministerial statements, even when they were mistaken. The government faced pressure from an inquiry conducted by the House of Commons Foreign Affairs Committee and from Labour MP Tam Dalyell, who suspected ulterior motives behind the sinking of the cruiser, including the undermining of peace talks and the escalation of the conflict.\nIn July 1984, Clive Ponting, a British Ministry of Defence official, provided Tam Dalyell with documents detailing the incident, which suggested that the government had withheld relevant information from parliament. As a result, Ponting was charged under laws protecting state secrets and official information, but he was acquitted by a jury, which deemed his actions to be in the public interest. Despite the acquittal, his career as a civil servant came to an end.\nIn May 1983, Thatcher appeared live on a program on the British television channel BBC One, where Diana Gould, a geography teacher from Gloucestershire, persistently questioned her about the sinking of the General Belgrano. Gould argued that the ship posed no threat to the British fleet and that it had been attacked while heading away from the islands. She also claimed that the government should have been aware of the peace plan proposed by Peruvian President Fernando Belaúnde Terry, which had been presented fourteen hours before the attack, and that the escalation of the conflict could have been avoided. Thatcher responded by asserting that the cruiser posed a threat to British ships and denied that the Peruvian peace plan had reached her before the attack. \"I think that only in the United Kingdom can a prime minister be accused of sinking an enemy ship when my main motivation was to protect our sailors. That was my main motivation, and I'm very proud of that,\" Thatcher declared during the interview. After the programme ended, Thatcher's husband, Denis, criticized the program's producer, alleging that his wife had been \"stitched up by bloody BBC poofs and Trots.\"\nLegal action\nIn 1993, the sinking of the ARA General Belgrano was denounced by the relatives of the victims to the Comisión Investigadora de las Violaciones a los Derechos Humanos, under the Ministry of Defence of the Argentine Republic, as an unnecessary war crime. The Commission decided that the sinking of the General Belgrano would not be investigated, which caused considerable controversy, as Ministerial Resolution No. 220 of June 2, 1993, is categorical in stating that the Investigating Commission \"is intended to investigate the possible existence of acts in violation of current human rights standards, during and after the war episodes that took place in the Malvinas and the South Atlantic from April 2, 1982.\"\nOn July 2, 2000, Luisa Diamantina Romero de Ibanez and Roberto Guillermo Rojasos, relatives of two victims of the sinking of the cruiser, filed complaints against the British government with the European Court of Human Rights, claiming that the attack on the ARA General Belgrano violated their children's \"right to life\" under Article 2 of the European Convention on Human Rights. The complaints were dismissed on July 19, 2000, based on the arguments that they were filed too late and that the plaintiffs had not exhausted the legal remedies available to them in the British courts. However, Argentine war veterans' associations continued to pressure their government to take the case to the International Court of Justice and accuse former British Prime Minister Margaret Thatcher of war crimes.\nExpedition to the sinking site\nIn March 2003, explorer Curt Newport led a National Geographic Society maritime expedition to the South Atlantic to locate the General Belgrano using sonar and deploy a remotely operated underwater vehicle (ROV), the Magellan, to document the wreck. The expedition was conducted in collaboration with the Argentine Navy, which provided a support vessel, the Seacor Lenga, to accompany the National Geographic ship. The expedition team included four veterans of the sinking: two Argentine and two British, including the General Belgranos second-in-command, Frigate Captain .\nThe search focused on an area of approximately , located about  east of Tierra del Fuego, where the ship was believed to be located, at a depth of approximately . After two weeks at sea, encountering waves up to  high and winds of up to , the expedition abandoned the search without locating the General Belgrano. The adverse weather conditions and the ocean depth presented significant obstacles, preventing the deployment of the ROV Magellan.\nDuring the expedition, a ceremony, organized by the Argentine Navy, was held in the area of the sinking to commemorate those who died during the Falklands conflict. The voyage and its events were documented in a two-hour National Geographic Channel documentary, which included excerpts from interviews with twenty Argentine and British veterans of the Falklands War.\nExpedition's controversy\nThe expedition prompted debate among groups representing Argentine war veterans and relatives of those who died in the sinking of the General Belgrano. Some viewed the initiative as a potential disrespect to the memory of the deceased, while others hoped it would uncover evidence relevant to the argument that the sinking constituted a violation of international law.\nThe two largest Argentine Falklands War veterans' groups expressed dissatisfaction at not being consulted about the expedition. They also alleged that the Argentine Navy had disregarded the legislation designating the General Belgrano wreck as a national historic site and war grave. Rubén Rada, president of the Federation of Argentine War Veterans, requested assurances that the expedition would not remove any artifacts from the General Belgrano for display. John Bredar, executive producer of the documentary, addressed these concerns, stating that there was no intention to recover any objects. He affirmed adherence to Argentine law regarding the site, acknowledging its status as a maritime grave.\nThe inclusion of two veterans of HMS Conqueror in the expedition also drew objections from Argentine veterans' groups. Rubén Rada stated that including members of the submarine's crew that sank the General Belgrano was disrespectful to the memory of the deceased. John Bredar responded that the aim was to personalize the General Belgranos story for a wider audience, which he argued required including perspectives from both sides.\nTributes\nEvery year, on May 2, various religious ceremonies and events are held in Argentina to honor the memory of the 323 men who lost their lives following the sinking of the General Belgrano, attended by survivors and relatives of the victims. In 1998, a trip was made to the area of the sinking, where relatives and survivors threw flowers and letters into the sea to pay tribute to the deceased, and in 1999, Admiral Michael Boyce, then First Sea Lord of the British Royal Navy, visited the Port Belgrano Naval Base and paid tribute to the fallen. On May 3, 2001, during a ceremony held in the Congress of the Argentine Nation, diplomas were presented to the survivors and relatives of the victims, and the site of the sinking was declared a national historic site and war grave.\nMany solemnities and tributes to the ship and its deceased crew have been held by the Asociación Amigos del Crucero General Belgrano, which, since 1987, has brought together members and families of the ship's crews throughout its service in Argentina, as well as individuals and institutions who wish to preserve the memory of the cruiser and support those affected by the sinking. In addition to helping found the association, Commander Héctor Bonzo wrote his memories of the sinking in the book 1093 Tripulantes del Crucero ARA General Belgrano, published in 1991.\nBy December 2014, ninety-six schools bore the name of the cruiser or its crew members, and prominent landmarks of the orography and coastline of Isla de los Estados that had not yet been named were assigned the surnames of each of the crew members who died following the sinking.\nDecrees and laws\n* Municipal Ordinance No. 51,481/97, of August 21, 1997: establishes that on May 2 the flag should be flown at half-mast in honor of those killed in the sinking of the cruiser ARA General Belgrano, in all schools dependent on the Government of the city of Buenos Aires.\n* National Decree No. 745/98, of June 26, 1998: declares May 2 as \"National Day of the Cruiser ARA General Belgrano\" in memory of all the crew members who died as a result of the attack suffered by this Argentine Navy ship during the South Atlantic war conflict.\n* Law No. 586/01, of May 18, 2001: declares May 2 as \"Day of the Crew of the ARA General Belgrano\" in all government schools in the city of Buenos Aires. It also establishes the inclusion in the school calendar of activities commemorating the sinking of the ship and that the flag be hoisted at half-mast on that day in honor of those killed in the sinking of the ship.\n* National Law No. 25,546/02, of November 27, 2001: declares the area where the wreckage of the ARA General Belgrano is located to be a national historic site and war grave.\nDistinctions\n* National Commendation \"Honor al Valor en Combate\"; Awarded to the cruiser ARA General Belgrano, which after suffering an attack without any chance of reaction lived up to its motto, \"to sink rather than surrender its flag\", its crew having demonstrated the training and discipline befitting a warrior lineage and courage in combat.\n* \"Al Esfuerzo y la Abnegación\" award; Awarded to the survivors of the sinking, who, while abandoning ship and remaining in the life rafts for almost two days under severe environmental conditions, demonstrated a high level of spirit of sacrifice, discipline, courage, subordination and human solidarity.\n* \"La Nación Argentina al Herido en Combate\" award; awarded to survivors of the sinking who sustained serious injuries in the aftermath.\n* \"La Nación Argentina al Muerto en Combate\" award; given to the 323 who died in the sinking, and presented to their families.\n* Distinction \"Operaciones en Malvinas\"; Awarded to personnel belonging to the permanent staff of the Argentine Navy who took part in actions in contact with the enemy.\n* \"Malvinas\" badge of the Argentine Navy; awarded to conscripts and civilians, who were not permanent members of the Argentine Navy, who took part in actions in contact with the enemy.\nMonuments\n* 1982, Buenos Aires: Navy Monument to the Sailors Fallen in the Events of 1982; Corner of Avenida del Libertador and Avenida Comodoro Martín Rivadavia.\n* 1983, Port Belgrano: Navy Monument to the Cruiser ARA General Belgrano and its 323 Heroes; In front of the Naval Base's Sea Fleet Command, next to the anchorage usually used by the cruiser for thirty years.\n* 1990, Buenos Aires: National Monument to the Fallen in the Falkland Islands and South Atlantic Events; Plaza San Martín.\n* 1991, Buenos Aires: Monument to the Fallen in the Sinking of the Cruiser ARA General Belgrano; Centenario Park.\n* 1993, Rosario (Santa Fe): 1st commemorative monument of the Asociación Amigos del Crucero ARA General Belgrano; A la Bandera National Park.\n* 1995, Adrogué (Almirante Brown): 2nd commemorative monument of the Asociación Amigos del Crucero ARA General Belgrano; Plaza Almirante Brown.\n* 1997, Paraná (Entre Ríos): 3rd commemorative monument of the Asociación Amigos del Crucero ARA General Belgrano; Corner of Guemes Street and Moreno Street.\n* 1997, Ushuaia (Tierra del Fuego): 4th commemorative monument of the Asociación Amigos del Crucero ARA General Belgrano; Islas Malvinas Square.\n* 1997, Posadas (Misiones): 5th commemorative monument of the Asociación Amigos del Crucero ARA General Belgrano; Avenida Guacurarí, between Colón Street and Félix de Azara Street.\n* 1998, Santa Rosa (La Pampa): 6th commemorative monument of the Asociación Amigos del Crucero ARA General Belgrano; Corner of Alsina Street and Antártida Street.\n* 1999, Puerto Madryn (Chubut): 7th commemorative monument of the Asociación Amigos del Crucero ARA General Belgrano; Plaza Almirante Brown, on Avenida Costanera.\n* 2000, Gualeguay (Entre Ríos): 8th commemorative monument of the Asociación Amigos del Crucero ARA General Belgrano; Next to the bus terminal.\n* 2001, Santa Fe (Santa Fe): 9th commemorative monument of the Asociación Amigos del Crucero ARA General Belgrano; Avenida Almirante Brown.\n* 2002, Port Belgrano: Monument by the Navy to its Veterans of the Falklands Conflict; Centenario Park, at the Naval Base.\n* 2005, Río Gallegos (Santa Cruz): 10th commemorative monument of the Asociación Amigos del Crucero ARA General Belgrano.\n* 2013, Miramar (Buenos Aires): 11th commemorative monument of the Asociación Amigos del Crucero ARA General Belgrano; Plaza Cruzador ARA General Belgrano.\n* 2013, Olavarría (Buenos Aires): 12th commemorative monument of the Asociación Amigos del Crucero ARA General Belgrano; Plaza del Barrio CECO, between Santa Cruz and 12 Bis streets.\n* 2014, Mar del Plata (Buenos Aires): 13th commemorative monument of the Asociación Amigos del Crucero ARA General Belgrano.\n* 2014, General Alvear (Mendoza): 14th commemorative monument of the Asociación Amigos del Crucero ARA General Belgrano; Parque Lua.\n* 2015, San Cristóbal (Santa Fe): 15th commemorative monument of the Asociación Amigos del Crucero ARA General Belgrano.\n* 2017, El Talar de Moye (San Luis): 16th commemorative monument of the Asociación Amigos del Crucero ARA General Belgrano; in the building of the first school to be named after the cruiser.\n* 2017, Famailla (Tucumán): 17th commemorative monument of the Asociación Amigos del Crucero ARA General Belgrano.\n* 2017, Bella Vista (Buenos Aires): 18th commemorative monument of the Asociación Amigos del Crucero ARA General Belgrano; Plaza Cruzador General Belgrano, located at the intersection of Cruz del Sur and Aristóbulo del Valle streets, in the Trujui neighborhood.\n* 2018, Yerba Buena (Tucumán): 19th commemorative monument of the Asociación Amigos del Crucero ARA General Belgrano.\n* 2018, San Fernando del Valle de Catamarca (Catamarca): 20th commemorative monument of the Asociación Amigos del Crucero ARA General Belgrano.\n* 2018, Tostado (Santa Fe): 21st Asociación Amigos del Crucero ARA General Belgrano commemorative monument; Heroes of the Falklands traffic circle.\n* 2021, Carcarañá (Santa Fe): 23rd commemorative monument of the Asociación Amigos del Crucero ARA General Belgrano.\n* 2021, Sunchales (Santa Fe): 24th commemorative monument of the Asociación Amigos del Crucero ARA General Belgrano.\nCultural impact\n* In 1986, British playwright Steven Berkoff wrote the satirical play Sink the Belgrano!, which was highly critical of the British decision to go to war and the sinking of the General Belgrano.\n* In 1983, the garage rock band Thee Milkshakes, founded by Billy Childish, recorded an instrumental song entitled \"General Belgrano\" for their fourth album, The Men With The Golden Guitars. The song begins with the sound of a submarine's sonar.\n* In 1983, Pink Floyd dedicated part of their concept album The Final Cut, written by Roger Waters, to the Falklands conflict, the lyrics of which are highly critical of the UK's participation in the war.\nNotes\nReferences\nBibliography\n*\n*\n*\n*\n*\n*\n*\n*\n*"
    }
  ]
}