{
  "content": [
    {
      "type": "text",
      "text": "# Sinking of Japan\n\n| narrator       =\n| starring       = Tsuyoshi Kusanagi Kou Shibasaki Etsushi Toyokawa Mao Daichi Mitsuhiro Oikawa\n| music          = Tarō Iwashiro\n| cinematography = Taro Kawazu\n| editing        =\n| studio         = Sedic International\n| distributor    = Toho\n| released       =\n| runtime        = 135 minutes\n| country        = Japan\n| language       = Japanese\n| budget         =\n| gross          =\n}}\n}} is a 2006 Japanese tokusatsu disaster film directed by Shinji Higuchi. It is an adaptation of the novel Japan Sinks and a remake of its earlier film adaptation Submersion of Japan, both released in the year 1973. It stars Tsuyoshi Kusanagi, Kou Shibasaki, Etsushi Toyokawa and Mao Daichi.\nPlot\nSubmersible pilot Toshio Onodera wakes up pinned inside his car in Numazu following an earthquake. As an aftershock triggers an explosion, a rescue helicopter led by Reiko Abe saves him and a young girl named Misaki while a nearby volcano erupts. Reiko's family takes in Misaki as her injured mother dies.\nFollowing the earthquake, a scientist warns the Japanese government that the nation will sink within 40 years. Geoscientist Yusuke Tadokoro doubts the prediction and analyzes rocks in Kyushu, Hokkaido, and Mangaia in the Cook Islands, where he hypothesizes that the rock came from the ancient continent of Japan after it split from Pangaea. Tadokoro realizes Japan will sink in 338.54 days instead and reports his theory to the Cabinet, recommending immediate action, but none of the ministers are convinced. He is ejected from the chamber, but not before he angrily explains to everyone how Japan will sink, with the destruction of the Fossa Magna and the eruption of Mount Fuji as the climax.\nThe next day, Prime Minister Yamamoto flies to China to make arrangements for the impending resettlement of Japanese refugees and appoints a close colleague, Tadakoro's ex-wife, Saori Takamori, as disaster management minister. Tadokoro's predictions come to light as the Daisetsuzan Volcanic Group in Hokkaido erupts, followed by Mount Aso in Kyushu. The eruption of Aso destroys Kumamoto and shoots Yamamoto's plane out of the sky, killing him.\nOver the following months, volcanic eruptions, earthquakes, and tsunamis devastate Japan. When the economy collapses, the government declares a state of emergency but acting Prime Minister Kyosuke Nozaki announces that the nation will take five years to sink. Because of Nozaki's indifference to the situation, Takamori runs to Tadokoro's laboratory, where he proposes using experimental \"N2\" explosives drilled into the crust to separate the land from the megalith pulling it down. The minister calls for help from drillships around the world, with Chikyū being selected as the vessel of choice.\nMisaki, Reiko's family, and the rest of Tokyo's residents are evacuated. In the Chūbu region, they narrowly survive a massive landslide while heading through a mountain pass in the Japanese Alps towards a refugee center, but are left stranded after a crowded bridge collapses ahead of them. Another massive earthquake hits Tokyo, sinking multiple wards and prompting Takamori to recommend the Imperial Family's evacuation.\nYuki Tatsuya, Onodera's fellow submersible pilot, dies in an attempt to activate the warheads from a central module. Onodera takes his place using an old submersible brought out of museum storage and spends a night with Reiko before the operation, during which they express each other's love. Although he locates the detonation module, a sudden landslide damages his submersible to the point that it is running on emergency power. Onodera uses all the remaining power to move into position and install the detonator. Onodera succeeds in his task and calmly awaits his death. The warheads explode, creating a chain of explosions along the seafloor, which fractures the tectonic plate pulling Japan towards the subduction zone. At Mount Fuji, scientists monitoring its unrest are relieved after it calms down, confirming that Japan has been spared from total destruction.\nThe success of the mission reaches Takamori aboard the amphibious carrier Shimokita, which has been converted into the Japanese government's temporary headquarters. Takamori is selected by her colleagues to address the nation and the Japanese diaspora, citing her leadership during the crisis. She announces that people can finally return and holds a moment of silence in honor of Tatsuya and Onodera's sacrifice. In Fukushima Prefecture, Toshio's mother, who insists on staying behind until the end, is overjoyed when she sees birds return, a sign of his success. Reiko rescues her family as they look towards a bright sunrise before the credits start rolling, showing a drastically altered Japan.\nCast\n* Tsuyoshi Kusanagi – Toshio Onodera, a submersible pilot working for Tadokoro\n* Kou Shibasaki – Reiko Abe, a member of the Tokyo Hyper–Rescue team\n* Etsushi Toyokawa – Yusuke Tadokoro, geologist\n* Mao Daichi – Saori Takamori, science and disaster management minister\n* Mitsuhiro Oikawa – Yuki Tatsuya, submersible pilot\n* Mayuko Fukuda – Misaki Kuraki, young child found in Numazu\n* Jun Kunimura – acting Prime Minister Kyosuke Nozaki\n* Kazuo Kitamura - Minister of Justice\n* Koji Ishizaka – Prime Minister Yamamoto\n* Aiko Nagayama – Toshio Onodera's Mother\nTetsuro Tamba, who played Prime Minister Yamamoto in the 1973 movie, made a cameo appearance as Reiko's grandfather. It would be his final film role before dying on September 24, 2006. Gundam creator Yoshiyuki Tomino appeared as one of the refugees boarding a transport plane and as a Buddhist monk in Kyoto praying over a shipment of national treasures being sent abroad.\nReleases\nHome media\nPrior to the release of the film, TBS released The Encyclopedia of Sinking of Japan, a special one-hour DVD featuring interviews with the cast and crew. A \"Standard Version\" was released on January 19, 2007.\nScale models\nTakara Tomy released two batches of gashapon miniatures depicting various vehicles from the film in August 2006. The company followed it up in January 2007 with a 1/700 pre-assembled model of the Shimokita, which was released under its Microworld DX line.\nCritical reception\nThe film garnered mixed reviews. Derek Elley of Variety lauded the visual effects, but regarded the drama elements as thin. Nix of Beyond Hollywood.com noted the ending as akin to Bruce Willis' character's sacrifice in Armageddon and the lines of some characters are practically the same as in Western disaster movies. Mark Schilling, a film reviewer for the Japan Times, stated the movie was all business in terms of the Hollywood-style effects graphically showing the devastation. He also took notice of Shibasaki's casting as Reiko Abe and the short conversation scenes as different from the 1973 movie, plus the \"soft nationalism\" of some characters opting to die in the chaos rather than leave the country.\nSee also\n* Nihon Igai Zenbu Chinbotsu,  a parody of this film, released the same year\nReferences\nExternal links\n* [https://web.archive.org/web/20070927041050/http://www.dreamlogic.net/archives/movie-review-nihon-chinbotsu-aka-japan-sinks Review of the film] at Dreamlogic.net\n*\n*\nfr:Sinking of Japan\nja:日本沈没\nzh:日本沉沒"
    }
  ]
}