{
  "content": [
    {
      "type": "text",
      "text": "# Sir Arthur Wardour\n\nSir Arthur Wardour of Knockwinnock Castle is a character in Walter Scott's 1816 novel The Antiquary, a Scottish Tory baronet who is vain of his ancient family but short of money.  He is a friend and neighbour of Jonathan Oldbuck, the novel's title-character.\nWardour's role in the novel\nHe first appears when he and his daughter Isabella are invited to Oldbuck's house to meet his new friend Lovel.  Wardour, we are told, is a former Jacobite who has become reconciled to the House of Hanover, and is interested in antiquarian research.  As they have dinner together they fall out over the question of the Pictish language, Wardour thinking it Celtic and Oldbuck Germanic.  Things get so heated that the Wardours call the dinner-party short and walk homeward over the sands of the intervening bay, but the incoming tide cuts them off and threatens to drown them.  They are rescued by the combined efforts of their neighbours, and Wardour is bundled off home in a state of exhaustion.  When Oldbuck and Lovel next day visit Wardour they find him semi-invalid.  It becomes apparent, firstly that there is a romance between Isabella and Lovel which must seemingly be frustrated since Lovel is believed to be illegitimate, and secondly that Wardour hopes to recoup his diminished fortune by prospecting for a lead mine, being encouraged in this project by a suspicious German character called Herman Dousterswivel.  Wardour later invites Oldbuck and Lovel to join him in a trip to the ruins of St. Ruth's Priory, and when the day comes the conversation turns to a treasure rumoured to be buried there.  One night shortly afterwards Wardour and Dousterswivel are discovered excavating in the grounds of the Priory, the baronet having been persuaded by his companion that he had discovered the site of the treasure by alchemical means, and a small bag of old coins is duly found.  Wardour next tries to persuade Oldbuck to invest in a larger-scale excavation.  Oldbuck turns down the chance, but persuades him to try the search without making the payments to Dousterswivel that the German insists are necessary.  A quantity of silver bullion is uncovered, delighting Wardour and dumbfounding Dousterswivel.  After an interval we learn that Wardour has been squandering his new-found money unwisely, while most of his debts remain unpaid.  His main creditor institutes bankruptcy proceedings and sends in the bailiffs, but just as Sir Arthur is facing the prospect of a debtors' prison a letter arrives from his son enclosing enough money to pay off the main debt.  Isabella's lover is discovered to be the long-lost legitimate son of a wealthy earl, and the two are speedily married, putting Sir Arthur out of all financial danger.\nHis character\nSir Arthur Wardour has a deep and lasting, though stormy, friendship with his neighbour Jonathan Oldbuck, which is based on their common interests; they both conduct historical research, though Sir Arthur is a dilettante compared to his friend.  Their approach to the past is not that of a scientific historian, deducing hypotheses from solid evidence, but that of an antiquary, forming opinions first and justifying them with whatever evidence comes to hand afterwards.  Sir Arthur's particular interest is in the history of the Wardour family and of the kings of Scotland, this pursuit being motivated by his need to bolster his own feelings of social superiority over those around him, including the middle-class Oldbuck.  He does not feel at home in the present, but he demonstrates the impossibility of living in the past by his ridiculous bluster and insufferable snobbishness.  He is altogether a futile figure with many faults: he is shown as being financially extravagant, self-centred, weak, gullible, and tyrannical over his daughter Isabella, who tries to protect him from the results of his stupidity.  His greed makes him an easy dupe for the swindler Dousterswivel, so that the reader may feel that his near-ruin is an appropriate fate.\nThe originals of Wardour\nSir Arthur was said by Scott's acquaintance Allan Cunningham to have been modelled on Sir John Whitefoord, 3rd Bt., though it has also been claimed that he was based on Sir John Sinclair, 1st Bt., a Caithness landowner who was taken in by a fraudulent geologist, Rudolf Erich Raspe.  According to one commentator, \"Scott detested Sir John Sinclair, and probably got some pleasure from representing him as Sir Arthur Wardour\".  Similarities have also been noted between Sir Arthur and the fictional Sir Epicure Mammon, the gullible nobleman in Ben Jonson's play The Alchemist.  Yet another claim is that Wardour is a portrait of his own author as a true-blue Tory supporter of the claims of the established aristocratic order;  A. N. Wilson was also struck by the similarity Sir Arthur displays to Scott's behaviour in later years, \"duped by hare-brained financial schemes and folie de grandeur\", and, when his fortune is restored, talking of buying contiguous estates that would stretch from shore to shore.\nLater appearance\nSir Arthur Wardour later appeared in the fictional Laurence Templeton's Introduction (or \"Dedicatory Epistle\") to Scott's Ivanhoe.  There Templeton, the ostensible author of the novel, tells us he has based \"his\" story of Ivanhoe on a medieval manuscript owned by Sir Arthur, who guards it jealously while being unable to read a syllable of it, and who insists on Templeton referring to it in pompous Blackletter type as \\mathfrak{The}\\,\\mathfrak{Wardour}\\,\\mathfrak{Manuscript}.  As the novel progresses Templeton several times refers back to this manuscript.\nCritical assessment\nThere is no critical consensus as to whether Sir Arthur is a successful fictional creation.  W. S. Crockett thought he was \"an eminently silly type of aristocrat – a foolish old Tory with whom we lose all patience\".  Edgar Johnson found him exaggeratedly credulous and insufficiently realized for us to care about the final clearing up of all his troubles, and complained that though we are told he has in the end learned greater wisdom we are not shown it.  On the other hand, Andrew Lang found him \"perennially delightful\", and A. N. Wilson thought him one of the comic portraits that makes The Antiquary great.\nFootnotes\nReferences\n*\n*\n*\n*\n*\n*"
    }
  ]
}