{
  "content": [
    {
      "type": "text",
      "text": "# Sir Edward Ernle, 3rd Baronet\n\nSir Edward Ernle, 3rd Baronet (c. 1673 – 1729) of Charborough in Dorset, of Brimslade Park and  Etchilhampton, both in Wiltshire, was an English Whig politician who sat in the English and British House of Commons between 1695 and 1729. He had mixed fortunes in finding or holding a seat and often depended on his father-in-law to bring him into his own seat at Wareham when a vacancy arose.\nEarly life\nErnle was a younger son of Edward Ernle of Ashlington and Etchilhampton in Wiltshire (the eldest son and heir apparent of Sir Walter Ernle, 1st Baronet (–1682)) and his wife Anne Ashe, a daughter of Edward Ashe, MP, of Heytesbury, Wiltshire. Both his grandfathers were Members of Parliament. In 1690, he succeeded his brother, Walter, in the baronetcy. He married Frances Erle, the daughter and sole-heiress of General Thomas Erle (1650–1720), MP, of Charborough House, Dorset, by 1698 when he became a Whig.\nCareer\nAt the 1695 English general election,  Ernle was returned as Member of Parliament for Devizes on his own interest. At the 1698 English general election he was returned unopposed as  Whig MP for  Wiltshire.  He did not stand at the first general election of 1701, but it became a practice for him to be returned by his father in law as MP  for Wareham at by-elections, and he was returned there for the first time  on  5 March 1701. At the second general election on 1701, he was returned unopposed as MP  for Heytesbury. He failed to find a seat at the 1702 English general election but was returned as MP  for  Wareham  at a by-election on  22 February 1704. At the  1705 English general election he stood again for Wiltshire, but was defeated and no further opportunity at Wareham occurred. He was invited to stand  for  Marlborough at the 1708 British general election, but was dropped before the poll. He was then returned there as MP  there at a contested by-election on 10 December 1708. He voted for naturalizing the Palatines in 1709 and  for the impeachment of Dr Sacheverell in 1710.  He could not find a seat in 1710, but was returned as MP  for  Wareham  at a by-election on   13 December 1710.  He did not stand at the 1713 British general election.\nAt the 1715 British general election Ernle was returned by his father-in-law as MP  for Portsmouth. He  voted for the septennial bill in 1716, but went into opposition with Walpole in 1717. He voted against the repeal of the Occasional Conformity and Schism Acts and the Peerage Bill in 1719. In 1720, on the death of his father-in-law, he inherited the electoral interest at Wareham, and returned himself as MP for Wareham in  1722 and 1727.\nDeath and succession\nErnle died on 31 January 1729, leaving two daughters. Without male progeny, he was succeeded in the baronetcy by his kinsman Sir Walter Ernle, 4th Baronet (1676–1732) of Chirton, Wiltshire.\nExternal links\nA portrait of Ernle exists.\nReferences"
    }
  ]
}