{
  "content": [
    {
      "type": "text",
      "text": "# Sir John Dashwood-King, 4th Baronet\n\nSir John Dashwood-King, 4th Baronet (1765 – 22 October 1849) was a British Tory politician and country gentleman.\nThe son of Sir John Dashwood-King, 3rd Baronet and half-nephew of Francis Dashwood, 11th Baron le Despencer, he shared little of their cultured and hedonistic ways and was a pious churchgoer. He was educated at the Middle Temple and Christ Church, Oxford.\nOn 29 August 1789, he married Mary Anne Broadhead (d. 19 January 1844), the great-granddaughter of Theodore, Baron Brinckman; they had seven children:\n*Sir George Dashwood, 5th Baronet\n*Francis Dashwood (d. May 1817)\n*Sir John Dashwood, 6th Baronet (1792–1863)\n*Captain Edwin Sandys Dashwood (d. 1846). An officer of the Royal Horse Guards, he married Emily Hare in 1821, but became an alcoholic and died of delirium tremens in Paris. He left a son:\n**Sir Edwin Dashwood, 7th Baronet (1825–1882)\n*Rev. Henry Dashwood (d. 6 February 1846), married on 19 September 1826) Anne Leader and had issue. Vicar of West Wycombe in 1832, but lost his post due to indiscreet romantic entanglements.\n*Mary Dashwood, married in 1815 Augustus Fitzhardinge Berkeley, natural son of Frederick Berkeley, 5th Earl of Berkeley\n*Elizabeth Dashwood (d. 29 August 1846), married in 1821 Harrison Walke Sober, married on 28 April 1827 Anthony St. Leger and had issue.\nAn unfortunate incident ensued in 1800, when he suspected his wife of being overly intimate with the Prince of Wales and made her leave London for Bourton.\nIn 1793, he inherited the baronetcy and West Wycombe Park, and stood unsuccessfully as the Parliamentary candidate for the borough of Wycombe. He was elected in 1796, holding the seat until 1831, playing an active role in local politics as well. An independent Tory, he was mobbed in Wycombe for his opposition to the Reform Bill in 1831, and left Parliament in 1831, preferring not to contest the election of 1832.\nMuch given to country life, he established the Bourton Hunt, a pack of harriers, at his Bourton estate in Gloucestershire and was also considered an excellent judge of horses. He disliked his country seat at West Wycombe as unsuitable for hunting and too expensive to maintain and attempted to sell it to the Duke of Somerset, but was unable to do so. He preferred to live in Halton House, near Aylesbury.\nDue to heavy investment in land in Buckinghamshire, he died burdened by poverty and crushing debt and was succeeded in the baronetcy by George Henry, who was Liberal Member for Buckinghamshire and for Wycombe until his death in 1862, when it passed briefly to George Henry's brother John Richard and then to the son of his other brother Edwin.\nReferences\n*\nExternal links\n* [http://www.stirnet.com/HTML/genie/british/dd/dashwood01.htm Dashwood genealogy]\n*"
    }
  ]
}