{
  "content": [
    {
      "type": "text",
      "text": "# Sir James Campbell, 2nd Baronet, of Ardkinglass\n\nSir James Campbell, 2nd Baronet of Ardkinglass, ( 1666 – 5 July 1752) was a British Army officer and Scottish politician who sat in the Parliament of Scotland from 1703 to 1707 and in the British House of Commons from 1707 to 1741.\nEarly life\nCampbell was the son of Sir Colin Campbell, 1st Baronet, of Ardkinglass and his wife Helen Maxwell, daughter of Patrick Maxwell, of Newark, Renfrew who was MP in the Parliament of Scotland. The family seat was Ardkinglas Castle, which stood on the shore of Loch Fyne, Argyllshire, Scotland. The castle was built in the form of a quadrangle around an inner courtyard measuring 98&nbsp;ft in each direction. There were large turrets on three of the corners and to the front was a large gate tower with two flanking defensive turrets. It was surrounded by beautiful gardens and parkland and the vast Ardkinglas estate.\nBy 1697, Campbell had married Margaret Campbell, daughter of Adam Campbell of Gargunnock, Stirling and, around 1700, acquired Dunderave Castle and estate. His wife who inherited the Gargunnock estate in 1704.\nPolitical and military careers\nCampbell was a commissioner justiciary for the Highlands in 1701 and 1702. In the Scottish election of 1702 he succeeded his father in the Parliament of Scotland as Commissioner for Argyllshire. In 1704 he became a burgess of Edinburgh and also joined the British Army as a lieutenant in the Life Guards. After the Act of Union he was chosen as one of the 60 Scottish representatives to serve for Scotland in the 1707 Parliament. He was one of dependants of the Duke of Argyll and supported the bill to complete the Union, which other Campbells opposed. He was promoted to captain in March 1708 and guidon and major in June 1708. At the 1708 general election he was returned unopposed as Member of Parliament for Argyllshire. In 1709 he succeeded to the estates and baronetcy on the death of his father. In Parliament he was on the drafting committee for the East Tarbert harbour bill and voted for the impeachment of Dr Sacheverell. He was returned unopposed for Argyllshire again in the 1710 British general election, and became major in 1710 and lieutenant-colonel from 1711. His affiliations were unclear but was a Whig when returned again for Argyllshire at the 1713 British general election. He voted against the expulsion of Richard Steele on 18 March 1714, and spoke in the debate on the succession, but was generally more concerned with Scottish business.\nIn 1715, Campbell left the army on being appointed the first deputy Governor of Stirling Castle and held the post until March 1717. He was returned for Argyllshire in the 1715, 1722 and 1727 general elections. He made a second marriage on 21 November 1732 to Anne Callander, the daughter of John Callander, Laird of Craigforth, and widow of Colonel John Blackadder who had succeeded him as Deputy Governor of Stirling Castle. At the 1734 general election he was returned as MP for Stirlingshire. Also in 1734 he was appointed Muster Master of Scotland. He did not stand at the 1741 general election and resigned or was dismissed from his post as Muster Master probably in 1742.\nDeath and legacy\nCampbell died on 5 July 1752, aged 86. He and his first wife Margaret had a son and eight daughters, but their only son drowned and the baronetcy became extinct.  Their eldest daughter, Helen Campbell, married Sir James Livingston, 2nd Baronet of Glentirran and Dalderse. The Ardkinglas estate passed to their son Lt.Col. Sir James Campbell, 3rd Baronet, formerly James Livingstone. The Callander of Craigforth family later succeeded to the Ardkinglas estate.\nReferences"
    }
  ]
}