{
  "content": [
    {
      "type": "text",
      "text": "# Sir Edward Hales, 3rd Baronet\n\nSir Edward Hales, 3rd Baronet (28 September 1645 – October 1695) was an English politician who sat in the House of Commons of England from 1679 to 1681. He became a Catholic and supported King James II at the time of the Glorious Revolution.\nBackground and early life\nHales was the only son of Sir Edward Hales, 2nd Baronet, of Tunstall, Kent, a Royalist, by his wife Anne Wotton, the youngest of the four daughters and coheirs of Thomas Wotton, 2nd Baron Wotton. He was a descendant of John Hales, baron of the exchequer. He was educated at University College, and his tutor Obadiah Walker influenced him in the direction of Roman Catholicism.\nCareer under Charles II\nOn 28 November 1673 Hales was admitted to the rank of colonel of a foot regiment at Hackington, Kent.  He purchased Hales Place (the mansion and estate of St. Stephen's parish, near Canterbury), where his descendants afterwards resided. He was elected Member of Parliament for Canterbury in 1679 and held the seat until 1681. He succeeded to the baronetcy on the death of his father in 1684.\nCatholicism\nHales declared himself a Catholic on the accession of James II and was formally reconciled to the Catholic Church on 11 November 1685. He had not received the sacrament according to the rites of the Church of England within three months of his commission in 1673, contrary to the statute 25 Charles II and had not taken the oaths of allegiance and supremacy. James II now gave him a dispensation from these obligations by letters patent under the Great Seal. In order to determine the legality of the exercise of his dispensing power in such cases, a test action was arranged. Arthur Godden, Sir Edward's coachman, was instructed to bring a qui tam action against his master for the penalty of £500, due to the informer under the act of Charles II. Hales was indicted and convicted at the assizes held at Rochester 28 March 1686. He pleaded the king's dispensation, and on appeal the question was argued at length in the court of king's bench before Sir Edward Herbert, Lord Chief Justice of England. On 21 June 1686, Herbert, after consulting his colleagues on the bench, delivered judgment in favour of Hales, and asserted the dispensing power to be part of the king's prerogative. The dispensing power was effectively outlawed by the Bill of Rights in 1689.\nCareer under James II\nHales was sworn into the privy council, and appointed one of the lords of the admiralty, deputy-warden of the Cinque ports, and lieutenant of Dover Castle, and in June 1687 Lieutenant of the Tower of London. Narcissus Luttrell mentions, in June 1688, a rumour that he was about to have a Catholic chapel in the Tower. When the seven bishops were discharged from his custody he demanded fees of them; but they refused, on the ground that their detention and Hales's commission were both illegal. The lieutenant hinted that if they came into his hands again they should feel his power.\nFlight and exile\nHales was dismissed from his post at the Tower in November 1688. James II, with Hales as one of his three companions, and disguised as Hales's servant, left Whitehall on 11 December, in the hope of escaping to France. The boat carrying them was discovered the next day as it lay in the river off Faversham, and the king and his three attendants were brought on shore. Hales was recognised, and kept prisoner at the courthouse at Faversham. Immediately after the king's departure for London he was conveyed to Maidstone gaol, and afterwards to the Tower, where he remained for a year and a half. On 26 October 1689 he was brought up to the bar of the House of Commons, and ordered to be charged with high treason in being reconciled to the church of Rome. On 31 January 1690 he and Obadiah Walker were brought by habeas corpus from the Tower to the bar of the king's bench, and were bailed on good security; but both were excepted out of the act of pardon dated 23 May following. Eventually Hales obtained his discharge on 2 June 1690.\nHales went in October 1690 to St. Germain-en-Laye, but he was little employed by James II other than as friend. James rewarded his services by creating him Earl of Tenterden in Kent, Viscount Tunstall, and Baron Hales of Emley, in the Jacobite peerage by patent 3 May 1692. Edward Hasted wrote that Hales's son and successor in the baronetcy, Sir John Hales, was offered a peerage by George I, but the matter dropped, because Sir John insisted on his right to his father's titles, and to precedence according to that creation.\nFinal years\nIn 1694, Hales applied to the Earl of Shrewsbury for a licence to return to England, but he died, without obtaining it, in 1695, and was buried in the Église Saint-Sulpice, Paris. By the schedule to his will, dated July 1695, he bequeathed £5,000, to be disposed of according to his instructions by Bonaventure Giffard and Dr. Thomas Witham. Hales left in manuscript a journal of his life, which Charles Dodd used in his Church History.\nFamily\nHales married Frances Windebank, daughter of Sir Francis Windebank of Oxfordshire and had five sons and seven daughters. Edward, his eldest son, was killed in the service of James II at the Battle of the Boyne, and John, the second son (died 1744), accordingly succeeded to the baronetcy, which became extinct on the death of the sixth baronet, Sir Edward Hales, without issue, on 15 March 1829.\nReferences\n;Attribution"
    }
  ]
}