{
  "content": [
    {
      "type": "text",
      "text": "# Sir Francis Edwards, 1st Baronet\n\nSir Francis Edwards, 1st Baronet (28 April 1852 – 10 May 1927), commonly known as Frank Edwards, was a British Liberal Party politician.\nSir Francis, the fourth son of Edward Edwards of Llangollen, was educated at Shrewsbury School and Jesus College, Oxford (graduated 1875). He was married in 1880 to Catherine, daughter of David Davis of Aberdare; the couple had one daughter.\nHe was elected Liberal Member of Parliament for Radnorshire in 1892. Edwards was a determined Liberal and a supporter of the Disestablishment of the Church in Wales, of which he was a member. In 1894, Edwards joined with David Lloyd George, David Alfred Thomas, and Herbert Lewis in resigning the Liberal Whip in protest at the delay of the Government of Lord Rosebery in introducing a Welsh Disestablishment measure. He was a relative of A. G. Edwards, Bishop of St Asaph and first Archbishop of Wales.\nDefeated in 1895, Edwards was to play no part in the struggle to unite Welsh Liberalism under the auspices of Cymru Fydd. Edwards appears to have been viewed as under the 'baleful' influence of David Alfred Thomas by Lloyd George and Herbert Lewis.\nIn 1898, he was High Sheriff of the county.\nIn 1900, Edwards fought Radnorshire on a platform of opposition to the Boer War and returned to parliament.\nHe was created baronet of Knighton in the County of Radnor on 25 July 1907.\nEdwards published a volume of Welsh poetry entitled 'Translations from the Welsh' in 1913. He did not stand in 1918, the Radnorshire Constituency having been amalgamated with Brecon.\nHe served as Justice of the Peace and Deputy Lieutenant for Radnorshire.\nElection results\nReferences\n* National Library of Wales: Lloyd George Papers\n* National Library of Wales: Herbert Lewis Papers\n* Dr Gerard Charmley: Frank Edwards (1852-1927) : 'the debonair and popular member for Radnorshire', Transactions of the Radnorshire Society, vols. 82–3.\n* Dictionary of Welsh Biography.\n*\n*"
    }
  ]
}