{
  "content": [
    {
      "type": "text",
      "text": "# Sir Edward Seymour, 1st Baronet\n\nSir Edward Seymour, 1st Baronet (c. 1563 – 10 April 1613) of Berry Pomeroy, Devon,  was Member of Parliament for Devon, twice High Sheriff of Devon and an Army Colonel.\nOrigins\nBorn at Berry Pomeroy Castle, Devon, of a family greatly influential in the Western counties, he was the son and heir of Lord Edward Seymour (died 1593), by his wife Margaret Walsh. He was the grandson of Edward Seymour, 1st Duke of Somerset (c.&nbsp;1500 – 1552), Lord Protector, in the elder but lower-ranking line of his descendants. Because of the alleged adultery of the Duke's first wife Catherine Fillol, the Dukedom had been entailed with preference to his sons by his second marriage.\nCareer\nAged 20 he was appointed Deputy Vice-Admiral of Devon. In 1586 he was Vice-Admiral of Cornwall. In the late 16th century, there was concern at the threat of a Spanish invasion, and he received a commission as a colonel in 1595, in charge of 1,600 men,\nand responsible for an area of the south Devon coast from Dartmouth to Plymouth. He was appointed High Sheriff of Devon in 1595 and 1605 and returned as Member of Parliament for Devon in 1593 and between 1601 and 1611.\nHe spent a large sum extending Berry Pomeroy Castle, over £20,000 according to John Prince in his Worthies of Devon, 1697, particularly in the building of the north range in about 1600. In 1604 he tried to claim part of his grandfather the Duke of Somerset's estate, but was opposed by his half-uncle Edward Seymour, 1st Earl of Hertford and was unsuccessful.\nFrom around 1611, as a result of the large expenditure on his home, the cost of supporting his eight children and legal expenses, he was apparently short of money. Despite his financial problems on 29 June 1611 he was created Baronet Seymour, of Berry Pomeroy, the patent for which cost him £1,095.\nMarriage and children\nAt the age of 13 on 19 September 1576 he married Elizabeth Champernowne, having been betrothed to her for about ten years. She was a daughter of Sir Arthur Champernowne (died 1578) of Dartington, Devon, Vice-Admiral of the West under Queen Elizabeth I. With her Seymour had children including:\nSons\n*Sir Edward Seymour, 2nd Baronet (c. 1580 – 1659)\n*William Seymour (died 1622), married Joan Young, daughter of John Young\n*Richard Seymour (died 1655)\nDaughters\n*Mary Seymour, married Sir George Farewell.\n*Elizabeth Seymour, married George Cary of Cockington.\n*Bridget Seymour (b. 1577), married Sir John Bruin.\n*Anna Seymour (died 1639), married Edmond II Parker (1592–1649) of North Molton and Boringdon Hall, Plympton St Mary, ancestor of the Earl of Morley.\nDeath and burial\nHe died in 1613 and was buried in St Mary's Church, Berry Pomeroy, where there survives a well-preserved  monument to him, termed by Nikolaus Pevsner as \"astonishingly naive\". He was succeeded by his eldest son Sir Edward Seymour, 2nd Baronet (c. 1580 – 1659).\nSources\n*\nReferences"
    }
  ]
}