{
  "content": [
    {
      "type": "text",
      "text": "# Sir Edward Vavasour, 1st Baronet\n\nThe Honourable Sir Edward Marmaduke Joseph Vavasour, 1st Baronet DL (formerly Edward Marmaduke Joseph Stourton; 6 May 1786 – 16 March 1847) was an English landowner and baronet.\nEarly life\nVavasour was born on 6 May 1786 as Edward Marmaduke Joseph Stourton. He was the son of Charles Stourton, 17th Baron Stourton and Hon. Mary Langdale. His elder brother was William Stourton, 18th Baron Stourton and his younger brother was Charles Langdale, the Whig MP for Beverley and Knaresborough.\nHis paternal grandparents were William Stourton, 16th Baron Stourton and Winifred Howard (a leading Roman Catholic who was a great-granddaughter of the 6th Duke of Norfolk). His mother was a daughter of Marmaduke, 5th Baron Langdale and his wife, Constantia Smythe (a sister of Walter Smythe and, therefore, an aunt of Maria Anne Smythe, who, following her second marriage became known as Mrs. Fitzherbert, the longtime companion of George, Prince of Wales, later King George IV).\nCareer\nHe gained the rank of Captain between 1817 and 1824 in the Yorkshire Hussars. On 27 February 1826 his name was legally changed to Edward Marmaduke Joseph Vavasour by Royal Licence, after inheriting the Vavasour estates of his maternal cousin, Sir Thomas Vavasour, the seventh and last Vavasour Baronet of the 1628 creation. He was created 1st Baronet Vavasour, of Hazelwood, in the Baronetage of the United Kingdom on 14 February 1828.\nHe served as a Deputy Lieutenant of Yorkshire.\nPersonal life\nOn 6 August 1813, he married Marcia Bridget Lane-Fox, daughter of James Fox-Lane, MP for Horsham, and Hon. Marcia Lucy Pitt (daughter of British diplomat and politician George Pitt, 1st Baron Rivers). Together, they were the parents of:\n* Sir Edward Marmaduke Joseph Vavasour, 2nd Baronet (1815–1885), who died unmarried.\n* Marcia Mary Vavasour (1816–1883), who married William Constable-Maxwell, 10th Lord Herries of Terregles in 1835\n* Charles Joseph Vavasour (1817–1846), who died unmarried.\n* William Joseph Vavasour (1822–1860), who married Hon. Mary Constantia Clifford, daughter of Hugh Clifford, 7th Baron Clifford of Chudleigh, in 1846.\n* George Joseph Vavasour (1824–1895), who married  Amalia Ernestina Elizabatha Bell, daughter of Carl Theodor Bell, in 1850. After her death in 1861, he married Anne Heppenstall, daughter of John Heppenstall, in 1880. They divorced in 1889.\n* Philip Joseph Vavasour (1826–1887), a Roman Catholic priest who was Canon of the Chapter of the Diocese of Leeds.\nSir Edward died on 16 March 1847 near Dijon in Burgundy, while on a pilgrimage to Rome. As his eldest son Edward died unmarried in 1885, the baronetcy passed to his grandson, William, a son of his third son, William.\nReferences"
    }
  ]
}