{
  "content": [
    {
      "type": "text",
      "text": "# Sir Peter Ustinov Television Scriptwriting Award\n\nThe Sir Peter Ustinov Television Scriptwriting Award is a prestigious television writing award bestowed annually by the International Academy of Television Arts and Sciences upon non-American novice writers under the age of 30.\nSir Peter Ustinov gave his name to the International Academy for its Foundation's television scriptwriting award. The competition is designed to motivate novice writers worldwide, and offer them the recognition and encouragement that might lead to a successful career in television scriptwriting.\nThe successful screenwriter is presented with the award in November at the International Emmy Awards Gala in New York City. The award winner also receives US $2,500, is given a staged reading of their script by professional actors, and is offered the opportunity to work with an established writer as a mentor.\nSir Peter Ustinov Television Scriptwriting Award Winners\n*2025 - Indigo Hinton (United Kingdom) Rat Kings\n*2024 - Ornella Ohayon (France) ''Each Other's Keepers\n*2023 - Omar Khan (United Kingdom) Pocket Man\n*2022 - Gina Song (Australia) Miss Underworld\n*2021 - Jack Robson (United Kingdom) The Corpse That Went To War\n*2020 - Hannah Westall (United Kingdom) Mind The Gap\n*2019 - Violet MacDonald (United Kingdom) The Wolf\n*2018 - Lexi Savoy (Canada) Who Killed Heather McAdams?\n*2017 - Joe Brukner (Australia) Judas\n*2016 - C.S. McMullen (Australia) Living Metal\n*2015 – Gabriel Bergmoser (Australia) Windmills\n*2014 – Caitlin D. Fryers (Canada) Fealty\n*2013 – Rosy Deacon (United Kingdom) Shards\n*2012 – Sophie Petzal (United Kingdom) Sanctioned\n*2011 – Robert Goldsbrough (United Kingdom) The Forge\n*2010 – Jason Spencer (Australia) Spirits of the Past\n*2009 – Claire Tonkin (Australia) Me and Mine\n*2008 – Jez Freedman (United Kingdom) The Storyteller\n*2007 – Felicity Carpenter (Australia) Touching People\n*2006 – Nimer Rashed (United Kingdom) The Great McGinty\n*2005 – John Allison (United Kingdom) Distant Relatives\n*2004 – Caroline Doherty (South Africa) Passion Gap\n*2003 – Jo Kasch  (Australia) Upstream\n*2002 – Howard Hunt (United Kingdom) Lie of the Land\n*2001 – Colm Maher (Ireland) True Story\n*2000 – Sylke Rene Meyer (Germany) Who is Anna Walentynowicz?\n*1999 – Glenn Weller (Australia) Beautiful Music\n*1997 – Tatyana Murzakova (Russia) Smile of the King''\nExternal links\n*[http://www.iemmys.tv/foundation.aspx Official site of the Sir Peter Ustinov Television Scriptwriting Award]"
    }
  ]
}