{
  "content": [
    {
      "type": "text",
      "text": "# SIU Edwardsville Cougars wrestling\n\nThe SIU Edwardsville Cougars wrestling team represents Southern Illinois University Edwardsville (SIUE) as an associate member of the Mid-American Conference of NCAA Division I wrestling (SIUE's primary conference, the Ohio Valley Conference, does not sponsor wrestling). The Cougars host their home matches at the Sam M. Vadalabene Center on the university's campus in Edwardsville, Illinois, United States. The Cougars current head coach is Jeremy Spates who took over the program in 2013.\nHistory\nLarry Kristoff, a two-time NCAA College Division (now Division II) champion at Southern Illinois University Carbondale and member of the U.S. National and Olympic wrestling teams was hired in 1969 to start the SIUE wrestling program. To accomplish this, he had no athletic facilities, no scholarships, and almost no budget. Practices were held in hallways of the Peck Classroom Building (now known as Peck Hall) and the University Center (now known as the Morris University Center). Home meets were held in the Meridian Ballroom in the University Center. Despite these drawbacks, by the time the SIU Board of Trustees authorized the awarding of athletic scholarships in 1973, Kristoff's teams had built a dual meet record of 25–7–2, and two wrestlers had won All-American status.\nWith the arrival of athletic scholarships, Kristoff's wrestlers won 5 All-American citations and finished in third place at the 1974 NCAA Division II championships. That was the start of a run of 19 years (1974–92) that the Cougars finished no lower than the eleventh place at the Division II championships. In 1984, 1985, and 1986, the SIUE Cougars were the NCAA Division II National Champions. During this period, forty-one wrestlers won ninety-seven Division II and eleven Division I All-American citations, and twelve won eighteen Division II Individual Championships.\nDespite the program's success, its status as a non-revenue producing sport and an overall reduction in athletics funding by the university saw its budget shrink with each passing year, and the program went into decline. From 1993 through Kristoff's retirement in 1999, his wrestlers won only one individual championship, nine earned eleven All-American awards, and many of his student-athletes were better athletes than students, since SIUE was no longer a school of preference for the better students and despite his emphasis on academics. In his thirty-year career as the Cougars coach, through good years and bad, Kristoff compiled a dual meet record of 210–201–12.\nWhen Kristoff retired, he was succeeded by Cougar alumnus Booker Benford, who had been a two time NCAA Champion and an All-American four times in Division II and twice in Division I. While Benford was able to raise the academic standards of the team, it won no dual matches in his first two season. A third season saw some improvement to four wins, but in 2002–03, the Cougars managed a record of only 2–17, and the university administration decreed that the continued futility did not justify the expenses of operating the program, and it would be discontinued. In spite of eleven consecutive losing seasons, the program had maintained a small, but highly dedicated fan base, which immediately rallied support for Benford and his wrestlers. This support was seconded by local and national sportswriters, and the supporters and the SIUE administration worked to find a solution. The main result was the founding of the Friends of Wrestling organization which has, since that time, raised funding from outside the institution to pay for the program.  Another result was that the head coaching position became a part-time job. After the program was saved, Benford departed after his fifth season, which at 7–13 was his most competitively successful.\nBenford was followed by Khris Whelan, a local high school coach who had been an Illinois high school champion, a two-time All-American at Missouri, a four-time national amateur champion, U.S National team member, former British National coach, and former Missouri assistant coach. During Whelan's tenure, the program had little competitive success but returned to academic and financial stability. As the SIUE athletic program prepared to transition to Division I, Whelan stepped down, stating that the program needed a full-time coach, and that his high school teaching position would not allow him to be that person.\nPat McNamara, a Missouri assistant coach who had been a three-time All-American and Big Ten champion at Michigan was hired as the Cougars' fourth coach and led them through their last season in Division II. At the end of the season, however, McNamara resigned to pursue other opportunities.\nAfter a nationwide search, David Ray, former head coach of four-time NAIA champion Montana State University–Northern who had won Division I and II All-American citations at Clarion University of Pennsylvania was named to lead the Cougars into Division I. After four final seasons as an independent, Ray took SIUE into the Southern Conference in 2012–13 before the university tapped him for other duties in the school's administration.\nAnother nationwide search brought Jeremy Spates to SIUE as the Cougars' sixth head coach in 2013. In the 2013–14 season, heavyweight David Devine became SIUE's first individual conference champion and the program's first NCAA qualifier since the school moved to Division I.\nIn the 2014–15 season, Jake Residori became SIUE's first top seed at the SoCon Finals.  Residori was upset in the semifinals by the eventual champion and came back to place third in the 174 pound class. Connor McMahon at 165 pounds and Jake Tindle at 197 pounds won multiple upsets en route to the championships in their classes and advancement to the NCAA Championships. McMahon, after entering the competition as the #5 seed, was named the tournament's Most Outstanding Wrestler. In winning his first match at the NCAA Finals in St. Louis, Tindle scored SIUE's first championship point as a Division I program.\nIn the 2015–16 season, Freddie Rodriguez (125) and John Fahy (149) won SoCon championships. Rodriguez then won two matches at the NCAA Championships. in St. Louis, the first Cougar to do so at the Division I level.\nAt the 2017 SoCon championships, Freddie Rodriguez (125), Jake Residori (174), and Jake Tindle (197) won their division titles. At the NCAA National Championships in St. Louis, Rodriguez advanced to the quarterfinals before falling, and Residori placed 8th, becoming the first Cougar to earn Division I All-American status since 1987 and the first since SIUE moved up to Division I in 2012–13 (Division II finalists earned entry into the Division I tournament until 1989). As a team, SIUE finished 29th of the 69 schools that sent wrestlers to the championships.\nIn 2019, the Cougars joined the Mid-American Conference. Since joining they have qualified six wrestlers for the NCAA Tournament. Justin Ruffin (157) (2019,2020,2021), Dan McKiernan (285) (2019), Tyshawn Williams (149) (2020), Saul Ervin (141) (2021).\nCoaches\nThe Cougars' current head coach is Jeremy Spates, a graduate of the University of Missouri, where he was an All-American in 2004 and was captain of the wrestling team for three years.  Spates previously was an assistant at Oklahoma and Cornell. His staff includes Associate Head Coach Daryl Thomas, Volunteer Assistant Coach Logun Taylor, and Graduate Assistant  Jake McKiernan.\nIndividual national champions\nThirteen Cougar wrestlers won nineteen NCAA Individual Championships during the school's Division II years.\n*1977 Jerry Washington, 190 pounds\n*1979 Mark Hattendorf, 177 pounds\n*1983 Don Stevens, 126 pounds\n*1984 Tim Wright, 118 pounds\n*1984 Don Stevens, 126 pounds\n*1984 Booker Benford, 177 pounds\n*1984 Ernie Badger, 190 pounds\n*1985 Tim Wright, 118 pounds\n*1985 Alan Grammer, 134 pounds\n*1985 Booker Benford, 177 pounds\n*1986 Tim Wright, 118 pounds\n*1986 Alan Grammer, 126 pounds\n*1986 Steve Stearns, 134 pounds\n*1987 Tim Wright, 118 pounds\n*1987 Kip Kristoff, 150 pounds\n*1988 Mark Kristoff, 167 pounds\n*1991 Phil Johns, 126 pounds\n*1992 Trevor Clark, 190 pounds\n*1993 Titus Taylor, 165 pounds\nAll-Americans\nFifty-four Cougars have earned 12 Division I and 111 Division II wrestling All-American citations.\n'''SIUE's NCAA Division I All-Americans'\nNOTE: Through 1989, the Division II finalists advanced to the Division I championships, held the following week, where these Cougar wrestlers were able to achieve All-American status in two classes.\n*Mark Hattendorf\t1978 – 177 pounds (8th), 1979 – 177 pounds (8th)\n*Tom Reed\t1980 – 118 pounds (4th)\n*Don Stevens\t1983 – 126 pounds (7th), 1984 – 126 pounds (8th)\n*Booker Benford\t1984 – 177 pounds (3rd), 1985 – 177 pounds (3rd)\n*Alan Grammer\t1985 – 134 pounds (3rd), 1986 – 134 pounds (5th)\n*Al Sears\t1985 – Heavyweight (8th)\n*Tim Wright\t1987 – 118 pounds (3rd)\n*Jake Residori  2017 – 174 pounds (8th)\n'SIUE's NCAA Division II All-Americans'''\n*Phil Janetas\t1971 – 126 (6th)\n*Barry Walsh\t1973 – Heavyweight (5th)\n*Larry Pruitt\t1974 – 134 (3rd), 1975 – 134 (2nd)\n*Frank Savegnago\t1974 – 177 (4th), 1975 – 190 (2nd), 1976 – 190 (2nd)\n*Mike Taylor\t1974 – 150 (3rd), 1975 – 150 (3rd)\n*Jerry Washington\t1974 – 190 (2nd), 1977 – 190 (1st)\n*Dennis Byrne\t1974 – 167 (5th), 1975 – 167 (5th)\n*Terry Mulrenin\t1975 – 126 (4th), 1977 – 126 (6th), 1979 – 126 (5th)\n*Dave Byrne\t1976 – 158 (6th), 1977 – 167 (3rd)\n*Mark Hattendorf\t1976 – 167 (5th), 1977 – 177 (3rd), 1978 – 177 (2nd), 1979 – 177 (2nd)\n*Dave Robinson\t1976 – 134 (2nd), 1978 – 134 (5th)\n*Dru Meshes\t1977 – 142 (5th), 1978 – 142 (2nd), 1979 – 142 (7th)\n*Tom Reed\t1978 – 118 (4th), 1979 – 118 (3rd), 1980 – 118 (3rd), 1981 – 118 (2nd)\n*Tim Ervin\t1979 – 134 (5th), 1980 – 142 (3rd), 1981 – 142 (2nd)\n*Norm Mitchell\t1979 – 190 (3rd), 1980 – 177 (3rd)\n*Tim Napier\t1979 – 150 (2nd)\n*Brett Means\t1980 – 126 (6th)\n*Don Stevens\t1982 – 126 (2nd), 1983 – 126 (1st), 1984 – 126 (1st)\n*Booker Benford\t1982 – 167 (5th), 1983 – 177 (2nd), 1984 – 177 (1st), 1985 – 177 (1st)\n*Joe Glasder\t1982 – 190 (4th), 1983 – 190 (3rd)\n*Al Sears\t1982 – Heavyweight (2nd), 1983 – Hwt. (7th), 1984 – Hwt. (4th), 1985 – Hwt. (2nd)\n*Ray Garcia\t1983 – 118 (6th)\n*Steve Stearns\t1983 – 134 (3rd), 1985 – 126 (3rd), 1986 – 134 (1st)\n*Mark Kristoff\t1983 – 150 (3rd), 1984 – 150 (2nd), 1986 – 167 (2nd), 1988 – 167 (1st)\n*Tim Wright\t1984 – 118 (1st), 1985 – 118 (1st), 1986 – 118 (1st), 1987 – 118 (1st)\n*Alan Grammer\t1984 – 134 (3rd), 1985 – 134 (1st), 1986 – 126 (1st)\n*Maurice Brown\t1984 – 142 (2nd), 1985 – 142 (2nd)\n*Ernie Badger\t1984 – 190 (1st), 1985 – 190 (2nd), 1986 – 190 (5th)\n*Dan McGinnis\t1985 -158 (8th)\n*Brian McTague\t1985 – 150 (4th), 1986 – 150 (2nd), 1987 – 150 (2nd)\n*Kip Kristoff\t1986 – 142 (7th), 1987 – 150 (1st), 1988 – 150 (2nd), 1990 – 158 (2nd)\n*Bob Dahm\t1986 (5th), 1987 (3rd)\n*Phillip Johns\t1988 – 126 (4th), 1989 – 126 (5th), 1990 – 126  (2nd), 1991 – 126 (1st)\n*Eric Morgan\t1988 – 142 (6th)\n*Steve Harmon\t1988 – 158 (5th), 1989 – 158 (4th)\n*Dwight Downs\t1988 – 177 (5th)\n*Russ Witzig\t1988 – 190 (8th), 1989 – 177 (4th), 1990 – 177 (6th)\n*Kurt Bednar\t1988 – Heavyweight (6th)\n*Tom Blaha\t1989 – 150 (8th), 1992 – 158 (5th)\n*Eric Roberson\t1991 – 142 (5th), 1992 – 142 (4th)\n*Kris Hayward\t1992 – 118 (7th), 1994 – 126 (5th)\n*Chad Humphrey\t1992 – 177 (7th)\n*Trevor Clark\t1992 – 190 (1st)\n*Tom Chernich\t1993 – 190 (7th)\n*Harley Roesler\t1994 – Heavyweight (8th)\n*Ben Foust\t1995 – 126 (7th)\n*Jayson Querciagrossa\t1996 – 142 (8th)\n*Mike Rogers\t1997 – Heavyweight (7th)\n*Jason Carter\t1997 – 1990 (5th)\n*Brian Anderson\t1996 – 126 (8th), 1997 – 126 (4th)\n*Jessie Montez\t1998 – 126 (6th)\n*Titus Taylor\t1998 – 158 (4th), 2000 – 165 (1st)\n*Zach Stephens\t2003 – 174 (4th)\nConference champions\nSIUE was an independent before joining the Southern Conference (SoCon) prior to the 2012–13 season.\n*2014 David Devine, 285\n*2015 Connor McMahon, 165\n*2015 Jake Tindle, 197\n*2016 Freddie Rodriguez, 125\n*2016 John Fahy, 149\n*2017 Freddie Rodriguez, 125\n*2017 Jake Residori, 174\n*2017 Jake Tindle, 197\n*2018 John Muldoon, 133\n*2018 Tyshaun Williams, 149\n*2018 Nate Higgins, 165\nConference Postseason awards\nAll-SoCon Team\n*2015 Jake Residori  (174)\n*2017 Jake Residori  (174)\n*2018  John Muldoon (133)\n*2018 Nate Higgins (165)\nSoCon All-Freshman Team\n*2013 Jake Residori\n*2015 Angelo Silvestro\n*2016 Nate Higgens\nNCWA 2009–12\nWhile SIUE was making the transition from Division II to Division I, the Cougars competed in the National Collegiate Wrestling Association (NCWA) championships in 2009–12, placing 20th, 3rd, 4th, and 7th. Cougar wrestlers earned 17 NCWA All-American awards, and three won NCWA National Championships:\n*2010 David Devine, 285 pounds\n*2011 Michael Dace, 174 pounds\n*2012 Brendan Murphy, 133 pounds\nAcademic success\nSince the NCAA initiated the Academic Progress Rate in 2003, SIUE athletics in general have performed extremely well. Wrestling in particular has been cited several times for its strong showing.\nIn the team's first year of eligibility for the honor, four Cougars (Jake Residori, Derek Nagel, Jake Tindle, and Chris Johnson) were among the 22 wrestlers named to the 2014–15 Winter Academic All-Southern Conference Team. At the end of the school year, nine Cougar wrestlers, Nathan Day, Trevor Feagans, Chris Johnson, Derek Nagel, John Petrov, Jake Residori, Angelo Silvestro, Jake Tindle, and Karsten Van Velsor were named to the SoCon academic honor roll for 2014–15.\nWhen the National Wrestling Coaches Association  (NWCA) issued its 2015 listing of the nation's top 30 Division I All-Academic teams, SIUE made its debut on the list at #9. NWCA Executive Director Mike Moyer commented, \"As you might expect, some of our nation's finest academic institutions, like the Ivy League schools for example, are represented very well, but when you see schools like Eastern Michigan, SIU Edwardsville, and South Dakota State, it goes to show the nation that great educations and great educational resources can be found everywhere. These schools know they have top-notch academics and we're glad to be able to have our student-athletes showcase it through wrestling.\" Of the 77 Division I wrestling programs, 56 teams had at least one representative among the 118 members of the All-Academic Team, including Cougars Jake Residori and Jake Tindle.\nReferences\nExternal links\n*"
    }
  ]
}