{
  "content": [
    {
      "type": "text",
      "text": "# Six of One (Battlestar Galactica)\n\n| production     =\n| writer         = Michael Angeli\n| director       = Anthony Hemingway\n| guests         = *Matthew Bennett as Aaron Doral\n*Callum Keith Rennie as Leoben Conoy\n*Rekha Sharma as Tory Foster\n*Rick Worthy as Simon\n*Dean Stockwell as John Cavil\n*Bodie Olmos as Hot Dog\n| season_article = Battlestar Galactica season 4\n| episode_list   = List of Battlestar Galactica (2004 TV series) episodes\n| prev           = He That Believeth in Me\n| next           = The Ties That Bind\n| image          =\n| alt            =\n| caption        =\n| editor         =\n| release_date   =\n| length         =\n}}\n\"Six of One\" is the second episode of the fourth season of the reimagined science fiction television series Battlestar Galactica. The episode first aired on SCI FI and Space in the United States and Canada respectively on April 11, 2008, and aired on Sky 1 in the United Kingdom on April 15, along with \"He That Believeth in Me\". The episode's name appears to be a play off the idiom \"six of one, half a dozen of the other\" meaning two presented choices are equal and it does not matter which is chosen. The episode was nominated for an Emmy Award.\nThe episode begins directly after the cliffhanger of the previous episode, where Kara Thrace holds Laura Roslin at gunpoint to stop her from going to what she thinks is the wrong way to Earth. Meanwhile, some of the Humanoid Cylon models wish to lobotomize the Raiders to make them destroy the fleet, regardless if the final five are among the fleet. However, the other Cylon models, particularly Natalie (a Six model) wish to stop them by any means necessary. The survivor count shown in the title sequence is 39,676.\nPlot\nKara Thrace holds President Laura Roslin at gunpoint and reminds her she once followed orders from Roslin to find Earth. Now that Starbuck thinks she knows where Earth is, Roslin rejects it.\nFeeling betrayed, Starbuck tells Roslin to take the gun and shoot her if she can't trust her. Roslin does pick up the gun and just as security arrives, fires but misses.\nStarbuck is quickly taken to the brig but urges everyone to change course. She fears she will lose her directions to Earth forever if they make one more jump. Admiral Adama confronts her, telling her she has lost all hope of anyone helping her. After Starbuck accuses Adama of ignoring her on purpose, Adama furiously slams her to the deck then leaves in disgust. Later, the fleet makes another jump, and Starbuck loses her direction of Earth.\nMeanwhile, the Cylons realize that the Raiders' retreat was due to them discovering the Final Five among the Colonial Fleet. The Cylon models prepare to lobotomise the Raiders to forget about the Final Five as their identities are forbidden by their programming, but, after objections to this are raised by several Cylon models, a vote is agreed to mediate the issue.\nBut, the vote ends in a draw (Numbers One, Four and Five votes for, and Numbers Two, Six and Eight voting against). Boomer is the only Eight model to vote for the lobotomising.\nTo prevent this from happening, one of the Six models (known as Natalie) removes the higher brain inhibitors from the Centurions which gives them free will. They proceed to kill all of the One, Four and Five models in the room.\nLee Adama leaves Galactica to start his new political career, but not before telling Starbuck he believes her.\nThe four Cylons (Colonel Tigh, Tory Foster, Samuel Anders, and Galen Tyrol) meet in secret to discuss who they think is the fifth Cylon. Since they believe Gaius Baltar may know, Tory visits him.\nAt first, Baltar believes she is spying on him. After having a vision of his virtual self, he and Tory talk, and later sleep together. Afterward, Tory says she could be a Cylon, but Baltar tells her not to be afraid and that he has learned from his time amongst them that Cylons do have feelings. He says while humans may have created the Cylons, it was the one true God who gave them souls.\nAdama and Roslin discuss what to do with Starbuck. Though Roslin has objections, Adama eventually decides to let Starbuck go. In the end, she is taken to a hangar, where to her surprise, she is given a ship, the Demetrius and a team including Helo, Athena, Anders and Gaeta to find Earth.\nProduction\nAccording to Rekha Sharma during the 2009 Comic Con in New York, the writers originally did not create a backstory for her character, Tory Foster, besides her job, but after talking with Ronald D. Moore, Sharma collaborated in creating the backstory. Michael Angeli was responsible for the crying after the sex scene, where Angeli was apparently inspired by hearing someone he knew in a similar situation.\nReception\nTotal viewership for \"Six of One\" dropped 16 percent from the season premiere, falling to 1.8 million viewers from 2.1 million the week before, according to the Nielsen ratings. The show received a 1.1 household rating and 2 percent share. In the critical 18-to-49-year-old demographic, viewership fell by even more—19 percent—to just 900,000 viewers (a 0.9 household rating and 3 percent share). It was estimated that fewer than 500,000 additional viewers watch the show on DVRs, because the Nielsen rating estimates for DVR watching (calculated over the seven days following the episode's initial airing) do not count shows with fewer than 500,000 viewers.\nRegardless, Sci-Fi selected \"Six of One\" as its official 2008 Emmy Awards submission for Outstanding Writing for a Drama Series and the episode was nominated in the category.[http://cdn.emmys.tv/awards/2008pte/60thpte_noms.php Academy of Television Arts & Sciences]  \"Six of One\" was also chosen as the official entry screening for Katee Sackhoff (who plays Kara/Starbuck) as best supporting actress in a dramatic series. Dan Compora of SyFy Portal received the episode well. The scenes involving the Centurions, Starbuck's scenes in the brig, and the departure of Lee Adama from the military were praised, but the apparent lack of action and the scene with Baltar & 'Head Baltar' were criticised. IGN gave the episode a \"great\" rating of 8.8 out of 10. The episode was praised for its return of Brother Cavil, stating \"the veteran TV actor is always a welcome presence, and does a great job as the rather cynical Cylon.\" Other positive points also include the introduction of the Cylon rebellion and the conversation between Adama and Roslin.\nReferences\nExternal links\n* \"Six of One\" at the Battlestar Wiki\n*"
    }
  ]
}