{
  "content": [
    {
      "type": "text",
      "text": "# Sixth Fleet (wargame)\n\n#48, which contained Sixth Fleet as a pull-out game]]\nSixth Fleet, subtitled \"US/Soviet Naval Warfare in the Mediterranean in the 1970s\", is a board wargame published by Simulations Publications Inc. (SPI) in 1975 that simulates a hypothetical attack against NATO forces in the Mediterranean Sea by naval forces of the Soviet Union. The game did not sell well, and several critics found that the tactics used in the game more closely resembled Napoleonic land battles rather than naval warfare in the 1970s.\nDescription\nSixth Fleet is a two-player board wargame designed at the height of the Cold War in which the Soviet Union targets a naval attack in the eastern Mediterranean against NATO forces, particularly American naval assets. The game has been characterized as moderately complex, but critic Jon Freeman believed that it was the wide range of possible courses of actions faced by the players on each turn that added difficulty rather than a complex rules system: \"Despite a certain complexity — largely a matter of the number of choices that a player must make from a very large number of options — Sixth Fleet is relatively simple to play.\"\nGameplay\nThe game uses an alternating \"I Go, You Go\" series of turns, but in an unusual twist, players engage in combat first and then move, the opposite of most wargames of the time.  Because of this change, a player must move their unit next to an enemy unit on one turn, but cannot attack them until the next turn, giving the enemy unit an opportunity to either attack first or to retreat before combat.\nThe game uses both land-based and carrier-based aircraft, as well as surface ships and submarines.\nIt is impossible to eliminate an enemy unit unless it is completely surrounded, so players instead must attempt to force their opponent to retreat and give up geographical territory.\nScenarios\nThe game comes with two scenarios, a 10-turn game which only involves American and Soviet forces; and a twenty-turn game in which a Franco-British fleet may enter from the west, while a second Soviet fleet may sail in from the Black Sea.\nPublication history\nSixth Fleet'' was designed by Jim Dunnigan, and appeared as a free pull-out game in Issue 48 of SPI's house magazine Strategy & Tactics (January–February 1975). The game was also offered as a boxed set. The game did not sell well, and in a 1976 poll conducted by SPI to determine the most popular board wargames in North America, Sixth Fleet only placed 80th out of 202 games.\nReception\nIn the October 1975 edition of Airfix Magazine, Bruce Quarrie noted \"To a large extent Sixth Fleet is an abstract game. Ships and aircraft can be neither damaged nor destroyed. but are instead retreated when up against a superior force.\" Quarrie called the \"combat and then movement\" rule \"the most novel feature ... This calls for a great deal of forethought and planning and makes the game every bit as challenging as chess.\" Quarrie concluded by calling it \"altogether an intriguing game\".\nIn Issue 53 of the British magazine Games & Puzzles, Nicky Palmer noted that \"The game is filled with imaginative and occasionally eccentric touches giving it a highly individual flavour.\" However, Palmer questioned the reality of the game, noting that having to surround a submarine in order to eliminate it \"is excessively reminiscent, for the experienced player at least, of land tactics. One is used to surrounding the 5th Panzer Division to destroy it — but surely the tactics for sinking a Russian submarine would be a little different!\" Palmer also noted that the various alliances of NATO and neutral countries portrayed in the game was somewhat out of date only 18 months after the game's release. Palmer concluded by giving the game an Excitement Level of 4 out of 5, but warned that the game rules were complex, saying, \"It's often tense, sometimes infuriating, and always fun. Not, however, for newcomers to wargaming.\" In his 1977 book The Comprehensive Guide to Board Wargaming, Palmer added, \"Fairly complex, with unusual game techniques: experienced players often find it hard to adjust to combat coming before movement.\"\nIn The Guide to Simulations/Games for Education and Training, Martin Campion noted that \"The game starts out with plenty of action and then tends to run down into a stalemate.\" Campion called it \"a lively game but the game system forces the opposing units into competing battlelines and makes their operations look more like land operations than sea-air operations. This gives the players a strange feeling of unreality.\"\nIn the 1980 book The Complete Book of Wargames, game designer Jon Freeman was of two minds about this game, calling it \"an enjoyable and interesting game that is nonetheless quite peculiar in its assumptions.\" Like other critics, Freeman commented that \"The tactics required would be more at home in a Napoleonic game than in a modern naval simulation.\" Freeman also noted that one misplaced unit can cause the loss of the game, warning, \"Not only does this slow play considerably, but it also forces the players to take extreme care about something that has no basis in reality.\" Freeman gave this game an Overall Evaluation of \"Fair to Good\", concluding, \"Sixth Fleet misses being quite a good game by a small amount on a lot of points.\"\nOther reviews and commentary\n*Jagdpanther #10 & #15\n* Moves #20\n* Paper Wars #49\n* Fire & Movement #3\n* Outposts #5 & #10\n* Pursuit & Destroy Vol.1 #1\n* Bushwacker #5\n* Phoenix #12\nReferences"
    }
  ]
}