{
  "content": [
    {
      "type": "text",
      "text": "# Slackware\n\nclass=skin-invert\n| screenshot = Slackware 15.0 screenshot.png\n| caption = Slackware 15.0 with KDE Plasma 5 as the desktop environment\n| developer = Patrick Volkerding\n| family = Linux (Unix-like) (based on Softlanding Linux System)\n| released =\n| language = Multilingual\n| userland = GNU\n| ui = CLI\n| license = GNU General Public License\n| website =\n| source_model = Open source\n| working_state = Current\n| latest release version =\n| latest release date = }}\n| kernel_type = Monolithic (Linux)\n| supported_platforms = IA-32, x86-64, ARM\n| updatemodel = pkgtool, slackpkg\n| package_manager = pkgtool, slackpkg\n}}\nSlackware is a Linux distribution created by Patrick Volkerding in 1993. Originally based on Softlanding Linux System (SLS), Slackware has been the basis for many other Linux distributions, most notably the first versions of SUSE Linux distributions, and is the oldest distribution that is still maintained.\nSlackware aims for design stability and simplicity and to be the most \"Unix-like\" Linux distribution. It makes as few modifications as possible to software packages from upstream and tries not to anticipate use cases or preclude user decisions. In contrast to most modern Linux distributions, Slackware provides no graphical installation procedure and no automatic dependency resolution of software packages. It uses plain text files and only a small set of shell scripts for configuration and administration. Without further modification, it boots into a command-line interface environment. Because of its many conservative and simplistic features, Slackware is often considered to be most suitable for advanced and technically inclined Linux users.\nSlackware is available for the IA-32 and x86_64 architectures, with a port to the ARM architecture. While Slackware is mostly free and open-source software, it does not have a formal bug-tracking facility or public code repository, with releases periodically announced by Volkerding. No formal membership procedure exists for developers, and Volkerding is the primary contributor to releases.\nName\nThe name \"Slackware\" stems from the fact that the distribution started as a private side project with no intended commitment. To prevent it from being taken too seriously at first, Volkerding gave it a humorous name, which stuck even after Slackware became a serious project.\nSlackware refers to the \"pursuit of Slack\", a tenet of the Church of the SubGenius, a parody religion. Certain aspects of Slackware graphics reflect this, e.g. the pipe that Tux is smoking, as influenced by the image of J. R. \"Bob\" Dobbs' head.\nA humorous reference to the Church of the SubGenius can be found in many versions of the install.end text files, which indicate the end of a software series to the setup program. In recent versions, including Slackware release 14.1, the text is ROT13 obfuscated.\nHistory\nBirth\nSlackware was originally derived from the Softlanding Linux System (SLS), the most popular of the original Linux distributions and the first to offer a comprehensive software collection that comprised more than just the kernel and basic utilities, including an X11 graphical interface, TCP/IP, UUCP networking, and GNU Emacs.\nPatrick Volkerding started with SLS after needing a LISP interpreter for a school project at the then-named Moorhead State University (MSU). He found CLISP was available for Linux and downloaded SLS to run it. A few weeks later, Volkerding was asked by his artificial intelligence professor at MSU to show him how to install Linux at home and on some of the computers at school. Volkerding had made notes describing fixes to issues he found after installing SLS, and his professor and he went through and applied those changes to a new installation. This took almost as long as it took to just install SLS, though, so the professor asked if the install disks could be adjusted so the fixes could be applied during installation. This was the start of Slackware. Volkerding continued making improvements to SLS - fixing bugs, upgrading software, automatic installation of shared libraries and the kernel image, fixing file permissions, and more. In a short time, Volkerding had upgraded around half the packages beyond what SLS had available.\nVolkerding had no intentions to provide his modified SLS version for the public. His friends at MSU urged him to put his SLS modifications onto an FTP server, but Volkerding assumed that \"SLS would be putting out a new version that included these things soon enough\", so he held off for a few weeks. During that time, many SLS users on the internet were asking SLS for a new release, so eventually Volkerding made a post titled \"Anyone want an SLS-like 0.99pl11A system?\", to which he received many positive responses. After a discussion with the local system administrator at MSU, Volkerding obtained permission to upload Slackware to the university's FTP server. This first Slackware release, version 1.00, was distributed on July 17, 1993, at 00:16:36 (UTC), and was supplied as twenty-four \" floppy disk images. After the announcement was made, Volkerding watched as the flood of FTP connections continually crashed the server. Soon afterwards, Walnut Creek CDROM offered additional archive space on their FTP servers.\nDevelopment\nThe size of Slackware quickly increased with the addition of included software, and by version 2.1, released October 1994, it had more than tripled to comprise 73 1.44&nbsp;MB floppy disk images.\nIn 1999, Slackware had its version jump from 4 to 7. Slackware version numbers were lagging behind other distributions, and this led many users to believe it was out of date, though the bundled software versions were similar. Volkerding made the decision to bump the version as a marketing effort to show that Slackware was as up-to-date as other Linux distributions, many of which had release numbers of 6 at the time. He chose 7, estimating that most other distributions would soon be at this release number.\nIn April 2004, Patrick Volkerding added X.Org Server packages into the testing/ directory of -current as a replacement for the XFree86 packages currently being used, with a request for comments on what the future of the X Window System in Slackware should be. A month later, he switched from XFree86 to X.Org Server after stating that the opinions were more than four to one in favor of using the X.org release as the default version of X. He stated the decision was primarily a technical one, as XFree86 was proving to cause compatibility problems. Slackware 10.0 was the first release with X.Org Server.\nIn March 2005, Patrick Volkerding announced the removal of the GNOME desktop environment in the development ChangeLog. He stated this had been under consideration for more than four years, and that other projects already provided a more complete version of GNOME for Slackware than what Slackware itself provided. Volkerding stated future GNOME support would rely on the community. The community responded and as of October 2016, several active GNOME (and GNOME fork) projects were available for Slackware, including Cinnamon, Dlackware, Dropline GNOME, MATE, and SlackMATE. The removal was deemed significant by some in the Linux community due to the prevalence of GNOME in many distributions.\nIn May 2009, Patrick Volkerding announced the public (development) release of an official x86_64 variant, called Slackware64, maintained in parallel with the IA-32 distribution. Slackware64 is a pure 64-bit distribution in that it does not support running or compiling 32-bit programs, but it was designed as \"multilib-ready\". Eric Hameleers, one of the core Slackware team members, maintains a multilib repository that contains the necessary packages to convert Slackware64 to multilib to enable running of 32-bit software. Hameleers started the 64-bit port as a diversion from the pain of recovering from surgery in September 2008. Volkerding tested the port in December 2008, and was impressed when he saw speed increases between 20 and 40% for some benchmarks compared to the 32-bit version. To minimize the extra effort of maintaining both versions in parallel, Slackware's build scripts, called SlackBuilds, were slowly transitioned to supporting either architecture, allowing for one set of sources for both versions. Slackware64 saw its first stable release with version 13.0.\nBetween the November 2013 release of 14.1 and June 2016, Slackware had a 31-month gap between releases, marking the longest span in release history. During this time, the development branch went without updates for 47 days. On April 21, 2015, though, Patrick Volkerding apologized on the ChangeLog for the absence of updates and stated that the development team used the time to get \"some good work done\". Over 700 program changes were listed on that ChangeLog entry, including many major library upgrades. In January 2016, Volkerding announced the reluctant addition of PulseAudio, primarily due to BlueZ dropping direct ALSA support in v5.x. while various other projects were, in turn, dropping support for BlueZ v4.x. Knowing some users would not be happy with the change, he stated, \"Bug reports, complaints, and threats can go to me.\" These changes culminated in the release of Slackware 14.2 in June 2016.\nHistorical documentation\nDavid Cantrell worked as a core member of the Slackware team between 1999 and 2001, and described that period on the Slackware ARM Vlog. Patrick Volkerding provided further information about the time period in two interviews.\nDesign philosophy\nThe design philosophy of Slackware is oriented toward simplicity, software purity, and a core design that emphasizes lack of change to upstream sources. Many design choices in Slackware can be seen as a heritage of the simplicity of traditional Unix systems and as examples of the KISS principle. In this context, \"simple\" refers to the simplicity in system design, rather than system usage. Thus, ease of use may vary between users; those lacking knowledge of command-line interfaces and classic Unix tools may experience a steep learning curve using Slackware, whereas users with a Unix background may benefit from a less-abstract system environment. In keeping with Slackware's design philosophy and its spirit of purity, most software in Slackware uses the original configuration mechanisms supplied by the software's authors; for some administrative tasks, though, distribution-specific configuration tools are delivered.\nDevelopment model\nNo formal issue tracking system and no official procedure is needed to become a code contributor or developer. The project does not maintain a public code repository. Bug reports and contributions, while being essential to the project, are managed in an informal way. All the final decisions about what is going to be included in a Slackware release strictly remain with Slackware's benevolent dictator for life, Patrick Volkerding.\nThe first versions of Slackware were developed by Patrick Volkerding alone. Beginning with version 4.0, the official Slackware announce files list David Cantrell and Logan Johnson as part of the \"Slackware team\". Later announce statements, up to release version 8.1, include Chris Lumens. Lumens, Johnson and Cantrell are also the authors of the first edition of \"Slackware Linux Essentials\", the official guide to Slackware Linux. The Slackware website mentions Chris Lumens and David Cantrell as being \"Slackware Alumni\", who \"worked full-time on the Slackware project for several years.\" In his release notes for Slackware 10.0 and 10.1 Volkerding thanks Eric Hameleers for \"his work on supporting USB, PCI, and Cardbus wireless cards\". Starting with version 12.0 there is, for a second time, a team building around Volkerding. According to the release notes of 12.2, the development team consists of seven people. Future versions added people. Since version 13.0, the Slackware team seems to have core members. Eric Hameleers gives an insight into the core team with his essay on the \"History of Slackware Development\", written on October 3–4, 2009 (shortly after the release of version 13.0).\nPackages\nManagement\nsmoking a pipe]]\nSlackware's package management system, collectively known as pkgtools, can administer (), install (), upgrade (), and remove () packages from local sources. It can also uncompress () and create () packages. The official tool to update Slackware over a network or the internet is . It was originally developed by Piter Punk as an unofficial way to keep Slackware up-to-date. It was officially included in the main tree in Slackware 12.2, having been included in  since Slackware 9.1. When a package is upgraded, it will install the new package over the old one and then remove any files that no longer exist in the new package. Once a package has been installed with  it can be managed with  or other package management commands. When running , it only confirms that the version numbers are :different\", thus allowing downgrading the package if desired.\nSlackware packages are tarballs compressed using various methods. Starting with 13.0, most packages are compressed using xz (based on the LZMA compression algorithm), using the  filename extension. Prior to 13.0, packages were compressed using gzip (based on the DEFLATE compression algorithm), using the  extension. Support for bzip2 and lzip compression was also added, using the filename extensions  and , respectively, although these are not commonly used.\nPackages contain all the files for that program, as well as additional metadata files used by the package manager. The package tarball contains the full directory structure of the files and is meant to be extracted in the system's root directory during installation. The additional metadata files, located under the special  directory within the tarball, usually include a  file, which is a specifically formatted text file that is read by the package manager to provide users with a description of the packaged software, as well as a  file, which is a post-unpacking shell script allowing creation of symbolic links, preserving permissions on startup files, proper handling of new configuration files, and any other aspects of installation that can not be implemented via the package's directory structure. During the development of 15.0, Volkerding introduced support for a  uninstall script that can be launched when removing or upgrading a package. This allows package maintainers to run commands when a package is uninstalled.\nThe package manager maintains a local database on the computer, stored in multiple folders. On 14.2 and older systems, the main database of installed packages was maintained in , however, during the development of 15.0, Volkerding moved two of the directories to a dedicated location under  to prevent accidental deletion when clearing system logs. Each Slackware installation will contain a  and  directory in the main database location. The former is where each package installed will have a corresponding install log file (based on the package name, version, arch, and build) that contains the package size, both compressed and uncompressed, the software description, and the full path of all files that were installed. If the package contained an optional  post-installation script, the contents of that script will be added to a file in the  directory matching the filename of the corresponding package in the  directory, allowing the administrator to view the post-installation script at a future point. When a package is removed or upgraded, the old install logs and scripts found under  and  are moved to  and , making it possible to review any previous packages and see when they were removed. These directories can be found in  on 14.2 and earlier, but were moved to  during the development of 15.0. On systems supporting the  uninstall script, those scripts will be stored in the  directory while the package is installed. Once removed, the  script will be moved to .\nDependency resolution\nThe package management system does not track or manage dependencies; however, when performing the recommended full install, all dependencies of the stock packages are met. For custom installations or 3rd-party packages, Slackware relies on the user to ensure that the system has all the supporting system libraries and programs required by the program. Since no official lists of dependencies for stock packages are provided, if users decide to install a custom installation or install 3rd-party software, they will need to work through any possible missing dependencies themselves. Since the package manager doesn't manage dependencies, it will install any and all packages, whether or not dependencies are met. A user may find out that dependencies are missing only when attempting to use the software.\nWhile Slackware itself does not incorporate official tools to resolve dependencies, some unofficial, community-supported software tools do provide this function, similar to the way APT does for Debian-based distributions and yum does for Red Hat-based distributions. They include\n* slapt-get is a command line utility that functions in a similar way to APT. While slapt-get does provide a framework for dependency resolution, it does not provide dependency resolution for packages included within the Slackware distribution. However, several community package sources and Slackware based distributions take advantage of this functionality. Gslapt is a graphical interface to slapt-get.\n* Swaret is a package management tool featuring dependency resolution. It was originally included in Slackware version 9.1 as an optional package, but did not contain dependency resolution at that time. It was removed from the distribution with Slackware 10.0 and turned over to the community. It eventually added dependency resolution and roll-back functionality; however, as of May 2014, there are no active developers.\n* NetBSD's pkgsrc provides support for Slackware, among other Unix-like operating systems. pkgsrc provides dependency resolution for both binary and source packages.\nRepositories\nThere are no official repositories for Slackware. The only official packages Slackware provides are available on the installation media. However, there are many third-party repositories for Slackware; some are standalone repositories and others are for distributions that are Slackware-based but retain package compatibility with Slackware. Many of these can be searched at once using pkgs.org, which is a Linux package search engine. However, mixing and matching dependencies from multiple repositories can lead to two or more packages that require different versions of the same dependency, which is a form of dependency hell. Slackware itself won't provide any dependency resolution for these packages, however some projects will provide a list of dependencies that are not included with Slackware with the files for the package, commonly with a  extension.\nDue to the possibility of dependency issues, many users choose to compile their own programs using community-provided SlackBuilds. SlackBuilds are shell scripts that will create an installable Slackware package from a provided software tarball. Since SlackBuilds are scripts, they aren't limited to just compiling a program's source; they can also be used to repackage pre-compiled binaries provided by projects or other distributions' repositories into proper Slackware packages. SlackBuilds that compile sources have several advantages over pre-built packages: since they build from the original author's source code, the user does not have to trust a third-party packager; furthermore the local compilation process allows for machine-specific optimization. In comparison to manual compilation and installation of software, SlackBuilds provide cleaner integration to the system by utilizing Slackware's package manager. Some SlackBuilds will come with an additional file with metadata that allows automated tools to download the source, verify the source is not corrupt, and calculate additional dependencies that are not part of Slackware. Some repositories will include both SlackBuilds and the resulting Slackware packages, allowing users to either build their own or install a pre-built package.\nThe only officially endorsed SlackBuilds repository is SlackBuilds.org, commonly referred to as SBo. This is a community-supported project offering SlackBuilds for building software not included with Slackware. Users are able to submit new SlackBuilds for software to the site and, once approved, they become the \"package maintainer\". They are then responsible for providing updates to the SlackBuild, either to fix issues or to build newer versions provided by upstream. To ensure all programs can be compiled and used, any required dependencies of the software not included with Slackware are required to be documented and be available on the site. All submissions are tested by the site's administrators before being added to the repository. The administrators intend for the build process to be nearly identical to the way Slackware's official packages are built, mainly to ensure Volkerding was \"sympathetic of our cause\". This allows SlackBuilds that Volkerding deems worthy to be pulled into regular Slackware with minimal changes to the script. It also prevent users from suggesting Volkerding to change his scripts to match SBo's. SBo provides templates for SlackBuilds and the additional metadata files and they encourage package maintainers to not deviate unless necessary.\nTwo Slackware team members, Eric Hameleers and Robby Workman each have their own repository of pre-compiled packages along with the SlackBuilds and source files used to create the packages. While most packages are just additional software not included in Slackware that they felt was worth their time to maintain, some packages are used as a testbed for future upgrades to Slackware, most notably, Hameleers provides \"Ktown\" packages for newer versions of KDE. He also maintains Slackware's \"multilib\" repository, enabling Slackware64 to run and compile 32-bit packages.\nReleases\nDefine $dx = 25 # shift text to right side of bar\nDefine $dy = -3 # shift text to right side of bar\nDefine $now = 01/07/2022\nDefine $start = 16/07/1993\nImageSize  = width:120 height:800\nPlotArea   = width:50 height:790 left:50 bottom:10\nDateFormat = dd/mm/yyyy\nPeriod     = from:$start till:$now\nTimeAxis   = orientation:vertical\nScaleMajor = unit:year increment:1 start:1994\nPlotData=\nbar:Leaders color:red width:30 mark:(line,white) align:left fontsize:S\nfrom:16/07/1993 till:$now\nfrom:16/07/1993 till:16/07/1993 shift:($dx,$dy) fontsize:S text:1.0\nfrom:05/11/1993 till:05/11/1993 shift:($dx,$dy) fontsize:S text:1.1.0\nfrom:05/02/1994 till:05/02/1994 shift:($dx,$dy) fontsize:S text:1.1.2\nfrom:02/07/1994 till:02/07/1994 shift:($dx,$dy) fontsize:S text:2.0\nfrom:31/10/1994 till:31/10/1994 shift:($dx,$dy) fontsize:S text:2.1\nfrom:30/03/1995 till:30/03/1995 shift:($dx,-4) fontsize:S text:2.2\nfrom:24/05/1995 till:24/05/1995 shift:($dx,-2) fontsize:S text:2.3\nfrom:30/11/1995 till:30/11/1995 shift:($dx,$dy) fontsize:S text:3.0\nfrom:03/07/1996 till:03/07/1996 shift:($dx,$dy) fontsize:S text:3.1\nfrom:17/02/1997 till:17/02/1997 shift:($dx,$dy) fontsize:S text:3.2\nfrom:11/06/1997 till:11/06/1997 shift:($dx,$dy) fontsize:S text:3.3\nfrom:14/10/1997 till:14/10/1997 shift:($dx,$dy) fontsize:S text:3.4\nfrom:09/06/1998 till:09/06/1998 shift:($dx,$dy) fontsize:S text:3.5\nfrom:28/10/1998 till:28/10/1998 shift:($dx,$dy) fontsize:S text:3.6\nfrom:10/05/1999 till:10/05/1999 shift:($dx,$dy) fontsize:S text:3.9\nfrom:17/05/1999 till:17/05/1999 shift:(40,$dy) fontsize:S text:4.0\nfrom:25/10/1999 till:25/10/1999 shift:($dx,$dy) fontsize:S text:7.0\nfrom:22/06/2000 till:22/06/2000 shift:($dx,$dy) fontsize:S text:7.1\nfrom:01/07/2001 till:01/07/2001 shift:($dx,$dy) fontsize:S text:8.0\nfrom:18/06/2002 till:18/06/2002 shift:($dx,$dy) fontsize:S text:8.1\nfrom:19/03/2003 till:19/03/2003 shift:($dx,$dy) fontsize:S text:9.0\nfrom:26/09/2003 till:26/09/2003 shift:($dx,$dy) fontsize:S text:9.1\nfrom:23/06/2004 till:23/06/2004 shift:($dx,$dy) fontsize:S text:10.0\nfrom:02/02/2005 till:02/02/2005 shift:($dx,$dy) fontsize:S text:10.1\nfrom:14/09/2005 till:14/09/2005 shift:($dx,$dy) fontsize:S text:10.2\nfrom:02/10/2006 till:02/10/2006 shift:($dx,$dy) fontsize:S text:11.0\nfrom:01/07/2007 till:01/07/2007 shift:($dx,$dy) fontsize:S text:12.0\nfrom:02/05/2008 till:02/05/2008 shift:($dx,$dy) fontsize:S text:12.1\nfrom:10/12/2008 till:10/12/2008 shift:($dx,$dy) fontsize:S text:12.2\nfrom:26/08/2009 till:26/08/2009 shift:($dx,$dy) fontsize:S text:13.0\nfrom:24/05/2010 till:24/05/2010 shift:($dx,$dy) fontsize:S text:13.1\nfrom:27/04/2011 till:27/04/2011 shift:($dx,$dy) fontsize:S text:13.37\nfrom:28/09/2012 till:28/09/2012 shift:($dx,$dy) fontsize:S text:14.0\nfrom:04/11/2013 till:04/11/2013 shift:($dx,$dy) fontsize:S text:14.1\nfrom:30/06/2016 till:30/06/2016 shift:($dx,$dy) fontsize:S text:14.2\nfrom:02/02/2022 till:02/02/2022 shift:($dx,$dy) fontsize:S text:15.0\nSlackware's release policy follows a feature and stability based release cycle, in contrast to the time-bound (e.g., Ubuntu) or rolling release (e.g., Gentoo Linux) schemes of other Linux distributions. This means there is no set time on when to expect a release. Volkerding will release the next version after he feels a suitable number of changes from the previous version have been made and those changes lead to a stable environment. As stated by Patrick Volkerding, \"It's usually our policy not to speculate on release dates, since that's what it is&nbsp;– pure speculation. It's not always possible to know how long it will take to make the upgrades needed and tie up all the related loose ends. As things are built for the upcoming release, they'll be uploaded into the -current tree.\"\nThroughout Slackware's history, they generally tried to deliver up-to-date software on at least an annual basis. From its inception until 2014, Slackware had at least one release per year. Release activity peaked in 1994, 1995, 1997 and 1999, with three releases each year. Starting with version 7.1 (June 22, 2000) the release progression became more stable and typically occurred once per year. After that point, the only years with two releases were 2003, 2005 and 2008. However, since the release of Slackware 14.1 in 2013, new releases have slowed down drastically. There was a more than 2-year gap between 14.1 and 14.2 and over a 5-year gap to 15.0. Upon the release of 15.0, Volkerding stated that Slackware 15.1 will hopefully have a far shorter development cycle since the \"tricky parts\" were resolved during the development of 15.0.\nSlackware's latest 32-bit x86 and 64-bit x86_64 stable releases are at version 15.0 (released on February 2, 2022), which include support for Linux 5.15.19.\nVolkerding also maintains a testing/developmental version of Slackware called \"-current\" that can be used for a more bleeding edge configuration. This version will eventually become the next stable release, at which point Volkerding will start a new -current to start developing for the next release of Slackware. While this version is generally known to be stable, it is possible for things to break, so -current tends to not be recommended for production systems.\n{| class=\"wikitable\" style=\"text-align:center\"\n|+ Release history\n! Version !! Release date !! End-of-life date !! Kernel version !! Notable changes\n|-\n|\n| style=\"white-space: nowrap;\" | 1993-07-17\n| No EOL specified\n| 0.99.11 Alpha\n|\n|-\n|\n| 1993-11-05\n| No EOL specified\n| 0.99.13\n|\n|-\n|\n| 1994-03-19\n| No EOL specified\n| 1.0.8\n|\n|-\n|\n| 1994-07-02\n| No EOL specified\n| 1.0.9\n|\n|-\n|\n| 1994-10-31\n| No EOL specified\n| 1.1.59\n|\n|-\n|\n| 1995-03-30\n| No EOL specified\n| 1.2.1\n|\n|-\n|\n| 1995-05-24\n| No EOL specified\n| 1.2.8\n|\n|-\n|\n| 1995-11-30\n| No EOL specified\n| 1.2.13\n|style=\"text-align:left\" | Transitioned from a.out to Executable and Linkable Format (ELF); first release to be offered on CD-ROM\n|-\n|\n| 1996-06-03\n| No EOL specified\n| 2.0.0\n|style=\"text-align:left\" | Named \"Slackware 96\", an allusion to Windows 95\n|-\n|\n| 1997-02-17\n| No EOL specified\n| 2.0.29\n|\n|-\n|\n| 1997-07-11\n| No EOL specified\n| 2.0.30\n|\n|-\n|\n| 1997-10-14\n| No EOL specified\n| 2.0.30\n|style=\"text-align:left\" | Introduced ZipSlack\n|-\n|\n| 1998-06-09\n| No EOL specified\n| 2.0.34\n|\n|-\n|\n| 1998-10-28\n| No EOL specified\n| 2.0.35\n|\n|-\n|\n| 1999-05-10\n| No EOL specified\n| 2.0.37pre10\n|\n|-\n|\n| 1999-05-17\n| No EOL specified\n| 2.2.6\n|style=\"text-align:left\" | First release to require 1&nbsp;GB of space for full install and added KDE\n|-\n|\n| 1999-10-25\n| No EOL specified\n| 2.2.13\n|\n|-\n|\n| 2000-06-22\n| No EOL specified\n| 2.2.16\n|style=\"text-align:left\" | Added GNOME\n|-\n|\n| 2001-07-01\n| No EOL specified\n| 2.2.19\n|style=\"text-align:left\" | Added Mozilla Browser and optional Linux 2.4\n|-\n|\n| 2002-06-18\n| 2012-08-01\n| 2.4.18\n|style=\"text-align:left\" | Switched package naming from 8.3 to name-version-arch-build.tgz and evolved hdsetup to pkgtools\n|-\n|\n| 2003-03-19\n| 2012-08-01\n| 2.4.20(patched to 2.4.21)\n|style=\"text-align:left\" |\n|-\n|\n| 2003-09-26\n| 2012-08-01\n| 2.4.22(patched to 2.4.26)\n|style=\"text-align:left\" | Switched from OSS to ALSA\n|-\n|\n| 2004-06-23\n| 2012-08-01\n| 2.4.26\n|style=\"text-align:left\" | Switched from XFree86 to X.org Server\n|-\n|\n| 2005-02-02\n| 2012-08-01\n| 2.4.29\n|style=\"text-align:left\" |\n|-\n|\n| 2005-09-14\n| 2012-08-01\n| 2.4.31\n|style=\"text-align:left\" | Removed GNOME desktop environment\n|-\n|\n| 2006-10-02\n| 2012-08-01\n| 2.4.33.3\n|style=\"text-align:left\" | First release offered on DVD\n|-\n|\n| 2007-07-01\n| 2012-08-01\n| 2.6.21.5\n|style=\"text-align:left\" | Switched from Linux 2.4 to 2.6, added support for HAL and removed floppy disk installation support (except for PXE)\n|-\n|\n| 2008-05-02\n| 2013-12-09\n| 2.6.24.5\n|style=\"text-align:left\" |\n|-\n|\n| 2008-12-10\n| 2013-12-09\n| style=\"white-space: nowrap;\" | 2.6.27.7(patched to 2.6.27.31)\n|style=\"text-align:left\" |\n|-\n|\n| 2009-08-26\n| 2018-07-05\n| 2.6.29.6\n|style=\"text-align:left\" | Added 64-bit version, switched from KDE 3.5 to 4.x and switched from gzip to xz compressed packages\n|-\n|\n| 2010-05-24\n| 2018-07-05\n| 2.6.33.4\n|style=\"text-align:left\" | Added PolicyKit and ConsoleKit and switched to the libata subsystem\n|-\n|\n| 2011-04-27\n| 2018-07-05\n| 2.6.37.6\n|style=\"text-align:left\" | Added support for GPT and utilities for the Btrfs filesystem\n|-\n|\n| 2012-09-28\n| 2024-01-01\n| 3.2.29(patched to 3.2.98)\n|style=\"text-align:left\" | Added NetworkManager and removed HAL as its functionality was merged into udev\n|-\n|\n| 2013-11-04\n| 2024-01-01\n| 3.10.17(patched to 3.10.107)\n|style=\"text-align:left\" | Added support for UEFI hardware and switched from MySQL to MariaDB.\n|-\n|\n| 2016-06-30\n| style=\"white-space: nowrap;\" | 2024-01-01\n| 4.4.14(patched to 4.4.301)\n|style=\"text-align:left\" | Added PulseAudio and VDPAU and switched from udev to eudev and from ConsoleKit to ConsoleKit2\n|-\n|\n| 2022-02-02\n| No EOL announced\n| 5.15.19(patched to 5.15.187)\n|style=\"text-align:left\" | Switched default encoding from ASCII to UTF-8, ConsoleKit2 to elogind, and KDE4 to Plasma5; migrated to Python 3; moved package database from  to ; added lame, vulkansdk, SDL2, FFmpeg, PAM, and Wayland to core system\n|-\n|\n| development\n|\n| 6.12.25\n|\n|-\n| colspan=\"5\" |\n|}\nSupport\nCurrently, Slackware has no officially stated support term policy. However, on June 14, 2012, notices appeared in the changelogs for versions 8.1, 9.0, 9.1, 10.0, 10.1, 10.2, 11.0, and 12.0 stating that, effective August 1, 2012, security patches would no longer be provided for these versions. The oldest release, version 8.1, was released on June 18, 2002, and had over 10 years of support before reaching EOL. Later, on August 30, 2013, announcements were made on the changelogs of 12.1 and 12.2 stating their EOL on December 9, 2013. It was stated in the changelog entries that they had at least 5 years of support. On April 6, 2018, versions of 13.0, 13.1 and 13.37 were declared reaching their EOL on July 5, 2018. It was stated in the changelog entries that they had at least 7 years of support (13.0 had been supported almost 9 years). On October 9, 2023, the changelog for 14.2 stated that 14.0, 14.1 and 14.2 will be EOL effective January 1, 2024.\nWhile there have been no official announcements for versions prior to 8.1, they are no longer maintained and are effectively EOL.\nHardware architectures\nHistorically, Slackware concentrated solely on the IA-32 architecture and releases were available as 32-bit only. However, starting with Slackware 13.0, a 64-bit x86_64 variant is available and officially supported in symmetrical development with the 32-bit platform. Prior to the release of Slackware64 users wanting 64-bit were required to use unofficial ports such as slamd64.\nSlackware is also available for the IBM S/390 architecture in the form of Slack/390 and for the ARM architecture under Slackware ARM (originally known as 'ARMedslack'). Both ports have been declared \"official\" by Patrick Volkerding. However, the S/390 port is still at version 10.0 for the stable version and 11.0 for the testing/developmental version, and has had no updates since 2009. Also, on May 7, 2016, the developer of Slackware ARM announced 14.1 will be EOL on September 1, 2016, and development of -current will cease with the release of 14.2, however support for 14.2 will be maintained for the foreseeable future. The EOL announcement for 14.1 was added to the changelog on June 25, 2016, and the EOL announcement for 14.2 was added to the changelog on December 21, 2022.\nIn July 2016, the developer of Slackware ARM announced that the development and build tools had been enhanced to reduce the manual effort involved in maintaining the ARM port, and proceeded to announce that a 32-bit hardware floating port was in development.  The port was released in August 2016 in \"current\" form.\nOn 28 December 2020 work began on porting Slackware to the 64-bit ARM architecture (known as 'AArch64'), with the initial Hardware Model targets being the PINE64's RockPro64 and Pinebook Pro.  It was functionally complete by May 2021, and has many improvements over the original design and implementation of the ARM port - particularly in regards to the management and enablement of new Hardware Models by the Slackware ARM community. Additionally, the boot and installation processes were improved significantly - making the installation process far easier and more streamlined.\nOn March 29, 2022 Slackware AArch64 was publicly released in -current (development) form with support for the RockPro64, Pinebook Pro and Raspberry Pi 3 & 4, with online installation documentation and video installation guides. Also the unofficial slarm64 project has a port for AArch64, and an additional port for riscv64 architecture.\nIn March 2022 official development of the ARM 32-bit port of Slackware ceased, with future development concentrated solely on the AArch64/ARM64 port. This was because the 32-bit hardware was unable to keep pace with the development of Slackware and was inhibiting development, and the limitations of the hardware became a blocker to the adoption of the latest technologies. Additionally since most of the other mainstream distributions ceased support for 32-bit ARM, some of the applications failed to build and were no longer supportable. There is however the unofficial Slackware port BonSlack that provide both soft (ARMv5) and hard float (ARMv7) ports for 32-bit ARM, with development and updates (from 14.2) aligned with official Slackware. This project also provides ports for Aarch64 (ARM64), Alpha, HPPA (PA-RISC 1.1), LoongArch (64 bit), MIPS (32/64-bit), OpenRISC, PowerPC (32/64-bit), RISC-V (64-bit), S/390x, SH-4, SPARC (32/64-bit), and x86 (32-bit with 64-bit ) architectures.\nOn December 21, 2022, Slackware ARM 14.2 had its EOL (End of Life) declared as 1 March 2023.\nSlackintosh is a port of Slackware Linux for the Macintosh New World ROM PowerPC architecture, used by Apple's Power Macintosh, PowerBook, iMac, iBook, and Xserve lines from 1994 until 2006. The last version of Slackintosh was 12.1, released on Jun 7, 2008. Slackintosh's website is still active and version 12.1 is available for download for those who have older PowerPC Macintosh computers. The project developers announced in February 2012 that development was frozen and 12.1 would be able to receive security patches for one month.\nThe next month, it was announced that the stable release is frozen and won't receive any further updates unless someone else decides to take over.\nThis never happened and Volkerding officially declared the project dead in July 2021.\nDistribution\nSlackware 14.2 CD sets, single DVDs, and merchandise were available from the third-party-controlled Slackware store, but due to underpayment, Patrick Volkerding, \"told them to take it down or I'd suspend the DNS for the store\".\nSlackware ISO images (2.6 GB) for installation can be downloaded for free at the Slackware website via BitTorrent, FTP mirrors, and HTTP mirrors.\nSlackware port for IBM S/390 (EOL: 2009) can be downloaded, and installs from a DOS Partition or from floppy disk.\nSlackware port for ARM\narchitecture can be downloaded, and installed via a network, using Das U-Boot and a TFTP boot server or from a mini-root filesystem.\nSlackware ARM can also be installed on a PC running QEMU\nusing the same technique.\nSlackware AArch64 (ARM64) is installed directly from SD card images in a similar fashion to installing Slackware x86 off a DVD.  It's also available as a generic bootable EFI ISO.\nReferences\nExternal links\n*\n*"
    }
  ]
}