{
  "content": [
    {
      "type": "text",
      "text": "# SLAS Discovery\n\nSLAS Discovery (Advancing the Science of Drug Discovery) is a peer-reviewed scientific journal published by the Society for Laboratory Automation and Screening (SLAS) in partnership with SAGE Publications. The editor-in-chief is Robert M. Campbell, Ph.D. (Eli Lilly and Company). The journal explores how scientists develop and utilize novel technologies and/or approaches to provide and characterize chemical and biological tools to understand and treat human disease. This includes scientific and technical advances in target identification/validation; biomarker discovery; assay development; virtual, medium- or high-throughput screening; lead generation/optimization; chemical biology; and informatics. The journal was published from 1996 through 2016 with the title Journal of Biomolecular Screening. Its name changed in 2017 to more accurately reflect the evolution of its editorial scope.[1]\nAbstracting and indexing\nSLAS Discovery is abstracted and indexed in:\n* Elsevier BIOBASE\n* Biomolecular Interaction Network Database\n* Biotechnology Citation Index\n* Chemical Abstracts\n* Current Contents/Life Sciences\n* EMBASE\n* EMBiology\n* Index Medicus\n* MEDLINE\n* Science Citation Index Expanded\n* Scopus\nAccording to the Journal Citation Reports, the journal's 2016 impact factor is 2.444, ranking it 31 out of 76 journals in the \"Chemistry, Analytical\" category,[2] 67 out of 158 journals in the \"Biotechnology & Applied Microbiology\" category;[3] and 39 out of 77 journals in the \"Biochemical Research Methods\" category.[4]\nReferences\n1. Eglen, Richard (July 19, 2016). \"Coming in the New Year: SLAS Discovery and SLAS Technology\". Society for Laboratory Automation and Screening.\n2.  \"Journals Ranked by Impact: Medical Laboratory Technology.\" 2017 Journal Citation Reports. Web of Science (Sciences ed.). Clarivate Analytics. 2017.\n3.  \"Journals Ranked by Impact: Chemistry, Analytical.\" 2017 Journal Citation Reports. Web of Science (Sciences ed.). Clarivate Analytics. 2017.\n4.  \"Journals Ranked by Impact: Biochemical Research Methods.\" 2017 Journal Citation Reports. Web of Science (Sciences ed.). Clarivate Analytics. 2017.\nExternal links\n*\n* [http://www.slas.org/ Society for Laboratory Automation and Screening]"
    }
  ]
}