{
  "content": [
    {
      "type": "text",
      "text": "# Sleep Safe and Warm\n\n| released   = July 1968\n| recorded   = 12 June 1968\n| studio     = Annex Recording Studio, Hollywood, California\n| genre      =\n* Lullaby\n* pop\n* psychedelia\n* waltz\n* easy listening\n| length     =\n| label      = Dot Records\n| composer   = Krzysztof Komeda\n| producer   = Tom Mack\n}}\n\"Sleep Safe and Warm\", originally known as \"'Lullaby from Rosemary's Baby'\", is a musical composition by Krzysztof Komeda, written for Roman Polanski's 1968 psychological horror film ''Rosemary's Baby''. Appearing in the movie as a wordless theme song sung by Mia Farrow, it was turned over to Larry Kusik and Eddie Snyder, who wrote the lyrics for it the same year.\n\"Lullaby\" is the main theme of the film's score which was nominated to the Golden Globe Award for Best Original Score in 1969. Released as a single, it reached No. 33 on the American Easy Listening chart. Recorded by numerous, especially Polish jazz artists, the composition is sometimes considered a jazz standard.\nBackground\nKrzysztof Komeda, though still relatively unknown in the United States at the time, was already regarded as one of the most important jazz musicians and film music composers in Europe, scoring films such as Andrzej Wajda's Innocent Sorcerers (1960), Henning Carlsen's Hunger (1966) and most of Polanski's previous works, most notably Knife in the Water (1962) and The Fearless Vampire Killers (1967). Being his regular collaborator, Komeda was once again asked by the director to score his first American-produced film in December 1967.\n(pictured) performed the original version of the lullaby.]]\nThe composer wrote lullaby for ''Rosemary's Baby'' in the early 1968 in Sunset Marquis, a hotel he was staying in. Komeda composed seven themes for possible use in the score before choosing the melody that would be used as the film's main theme. According to Polanski though, he composed only two different melodies, one of which was more commercial, the other less so. Since the director was unable to help him decide which one was better, it is unclear which of them was ultimately used. When the composition was completed, it was shown to the fellow Polish composer living in Los Angeles – Henry Vars, who gave Komeda some unspecified instructions regarding it. Krzysztof Komeda orchestrated his score with Dick Hazard, and with Jack Hayes conducting, it was recorded in April 1968 at Samuel Goldwyn Studios in Los Angeles, California.\nPolanski had the idea of asking Mia Farrow to perform the wordless melody over the opening and closing titles:\nTo my surprise and delight, she proved able to hum quite well, and there's no mistaking the owner of the voice that accompanies the opening credits. Not for the first time, a film of mine had derived an added dimension from Komeda's wonderfully imaginative music.\nWhen ''Rosemary's Baby'' became an instant hit, Komeda's score earned its share of the critical praise, with Cue calling it \"excellent\" and Weekly Variety terming it \"appropriately eerie\". Komeda received a Golden Globe nomination and followed ''Rosemary's Baby with another project for producer William Castle, the prison drama Riot'' (1969), but it proved to be the final film of the composer, who died on April 23, 1969.\nRelease\nDifferent versions\nExcluding many variations, two main versions of the composition can be found on the original soundtrack album. Both of them serves as an opener of their respective sides of the record and both of them features Mia Farrow singing the lead part. The first version is a George Tipton’s easy listening arrangement called \"Lullaby, Part 1\", released later (along with \"Lullaby, Part 2\" on the B-side) as a single record, while the second one is the film arrangement, named there \"Main Title\".\nGeorge Tipton's version with Farrow's vocals reached No. 33 on the American Billboard Easy Listening chart.\nLyrics\nAlthough not existing at the time of recording the film's score, the lyrics to the song were written by Larry Kusik and Eddie Snyder and were released along with the official sheet music. Claudine Longet is among very few artists to record a version including them. The lyrics for the composition run as follow:\nSleep safe and warm.\nFrom my arms no power can take you.\nSleep safe and warm.\nTill my morning kisses awake you.\nIn the softness of the night,\nLike a silver colored kite,\nAll your fears will fly and disappear\nBy morning's light.\nLoving you as I love you,\nEv'ry night your whole life through,\nI'll be gently watching over you\nSleep safe and warm.\nNotable renditions\nThe \"Lullaby from ''Rosemary's Baby\" has been recorded by many artists, including Stan Kenton, Duke Pearson, Chet Atkins, Tomasz Stańko and Jan Lundgren. The composition is especially popular among jazz musicians.\n* Arif Mardin and his Orchestra – \"Lullaby from Rosemary's Baby\" (single, 1968)\n* Stan Kenton – Finian's Rainbow (1968)\n* Floyd Cramer – Plays MacArthur Park (1968)\n* Gerald Wilson Orchestra – California Soul (1968)\n* Chet Atkins – Solid Gold '68 (1968)\n* Billy Vaughn – A Current Set Of Standards (1968)\n* The Brass Ring – Only Love (1968)\n* Hugo Winterhalter and his Orchestra, Eddie Heywood – Classical Gas (1968)\n* Doc Severinsen – Doc Severinsen & Strings (1968)\n* Charlie Byrd – The Great Byrd (1968)\n* Claudine Longet – \"Sleep Safe and Warm\" (single, 1968)\n* Roger Williams – Happy Heart (1969)\n* Hugo Montenegro – Good Vibrations (1969)\n* Harvey Averne – The Harvey Averne Dozen (1969)\n* Tomasz Stańko – Jazz Studio Orchestra of the Polish Radio (1969)\n* Marek and Vacek – Concert Hits (1973)\n* Michał Urbaniak, Tomasz Stańko, Attila Zoller, Urszula Dudziak – We'll Remember Komeda (1973)\n* Fania All-Stars – Delicate and Jumpy (1976)\n* Simple Acoustic Trio – Komeda (1995)\n* Jarek Śmietana – Songs and Other Ballads (1997)\n* Duke Pearson – I Don't Care Who Knows It (1998)\n* Anna Maria Jopek – Szeptem (1998)\n* Morte Macabre – Symphonic Holocaust (1998)\n* Ian Svenonius – Play Power (2001)\n* Fantômas – The Director's Cut (2001)\n* Jan Ptaszyn Wróblewski – Real Jazz (2005)\n* Jan Lundgren – European Standards'' (2008)\n* Jasper van 't Hof, Bob Malach – Pseudopodia (2008)\n* Adam Pierończyk – Komeda. The Innocent Sorcerer (2010)\n* Peter Erskine, Bob Mintzer, Darek Oles, Alan Pasqua – Movie Music (2010)\n* Leszek Możdżer – Komeda (2011)\nCharts\n{|class=\"wikitable sortable\"\n!Chart (1968)\n!Peakposition\n|-\n|US Billboard Easy Listening\n|align=\"center\"|33\n|}\nSee also\n*''Rosemary's Baby''\n*Polish jazz\nReferences"
    }
  ]
}