{
  "content": [
    {
      "type": "text",
      "text": "# Sleepwalking (Magnum album)\n\n}}\n}}\nSleepwalking is the ninth studio album by the English rock band Magnum, released in 1992.\nFollowing the decision to leave Polydor, Sleepwalking was recorded within six months, and is the first self-produced album by Magnum since The Eleventh Hour. Tony Clarkin was much happier acting as producer, following his working relationship with Keith Olsen on Goodnight L.A.. Learning from Olsen, Clarkin had enough experience to produce Magnum's records on his own, this also being the best option to cut production costs for future albums. Clarkin and Bob Catley commented that Sleepwalking represented a return to the classic Magnum style, as opposed to the previous album Goodnight L.A., which was produced with the American market in mind. The album got a mixed reception, with critics writing that the band was moving in the direction of pop rock.\n\"Only in America\" was released as a single, but following poor sales figures, the second single, \"You're the One\", was cancelled.\nTrack listing\nCover sleeve\nThe cover art was designed by Rodney Matthews.\n\"In true Magnum tradition, Tony Clarkin sketched out the essence of what he wanted for the Sleepwalking album, and in true Matthews tradition I made a few additions. The mirror shows Tony shaven headed as he is now, besides a wig to remind people of how he used to look. The suggestion that he ever did wear a wig is purely my own little joke. Other of my inclusions are the jets from The Eleventh Hour, the bag and stick from ''On A Storyteller's Night'', certain book titles, the Lord's Prayer scroll, Birmingham City football socks and the nose boil ointment as used by Bob Catley when we discussed the cover (sorry Bob).\n\"I seem to remember this illustration taking me twenty-six days and, while this is not typical of my style of illustration, it was a challenge I enjoyed. Also enjoyable were the several trips made to the Magnum studio where I was able to hear some of the tracks being laid down. This and the Aqua album [by Asia] were among the last of my designs to appear on the LP format.\" — Rodney Matthews\n\"Until the eleventh hour the Sleepwalking album was to be called Nightwatch, which was the title given it in my calendar in 1993. A section of the design was isolated for the single Only In America, my favourite track on the album.\" — Rodney Matthews\nSingles\nOnly in America 7\" (1992)\n# \"Only in America\" [LP version] — 4:01\n# \"Sleepwalking\" [LP version] — 5:39\nOnly in America 12\" (1992)\n# \"Only in America\" [LP version] — 4:01\n# \"Sleepwalking\" [LP version] — 5:39\n# \"Just a Little Bit\" [B-side] — 3:59\n# \"Caught in Love\" [B-side] — 3:50\nOnly in America CD (1992)\n# \"Only in America\" [LP version] — 4:01\n# \"Sleepwalking\" [LP version] — 5:39\n# \"Just a Little Bit\" [B-side] — 3:59\n# \"Caught in Love\" [B-side] — 3:50\nPersonnel\n*Tony Clarkin – guitar\n*Bob Catley – vocals\n*Wally Lowe – bass guitar\n*Mark Stanway – keyboards\n*Mickey Barker – drums\nAdditional musicians\n*York Gibson – keyboard programming\n*Wesley Magoogan – saxophone on \"Every Woman, Every Man\" and \"The Long Ride\"\n*Pritam Singh – tabla on \"Prayer for a Stranger\"\n*Gary Sanders – harmonica on \"The Long Ride\"\nCharts\n{| class=\"wikitable sortable plainrowheaders\"\n|-\n! Chart (1992)\n! Peakposition\n|-\n|-\n|-\n|}\nReferences\nExternal links\n* [http://www.magnumonline.co.uk/ www.magnumonline.co.uk] — Official Magnum site"
    }
  ]
}