{
  "content": [
    {
      "type": "text",
      "text": "# Sleepwalking (Shameless)\n\n| length         = 57 minutes\n| director       = John Wells\n| writer         = John Wells\n| story          =\n| teleplay       =\n| photographer   = Kevin McKnight\n| music          =\n| editor         = Mark Strand\n| production     =\n| guests         = * Richard Flood as Ford Kellogg (special guest star)\n* Sharon Lawrence as Margo Mierzejewski\n* Becca Blackwell as Father Murphy\n* Scott Michael Campbell as Brad\n* Laura Cerón as Celia Delgado\n* Elliot Fletcher as Trevor\n* Sammi Hanratty as Kassidi\n* Ruby Modine as Sierra Morton\n* Maggie Wheeler as Fiona's Lawyer\n* Juliette Angelo as Geneva\n* Jim Hoffmaster as Kermit\n* Michael Patrick McGill as Tommy\n* Chet Hanks as Charlie\n* Christian Isaiah as Liam Gallagher\n* Tina Ivlev as Freelania Alexeyevich\n* Stacey Oristano as Trina\n* James Shanklin as Rupert Jr.\n| prev           = A Gallagher Pedicure\n| next           = Are You There Shim? It's Me, Ian\n| season_article = Shameless season 8\n| episode_list   = List of Shameless (American TV series) episodes\n}}\n\"Sleepwalking\" is the twelfth episode and season finale of the eighth season of the American television comedy drama Shameless, an adaptation of the British series of the same name. It is the 96th overall episode of the series and was written and directed by series developer John Wells. It originally aired on Showtime on January 28, 2018.\nThe series is set on the South Side of Chicago, Illinois, and depicts the poor, dysfunctional family of Frank Gallagher, a neglectful single father of six: Fiona, Phillip, Ian, Debbie, Carl, and Liam. He spends his days drunk, high, or in search of money, while his children need to learn to take care of themselves. In the episode, Fiona makes a final offer to Rodney's family, while Frank enlists Liam in robbing his friend's house. Meanwhile, Ian is wanted by the police, while Lip questions his future with Sierra. The episode marked the final appearance of Isidora Goreshter in the series.\nAccording to Nielsen Media Research, the episode was seen by an estimated 1.73 million household viewers and gained a 0.60 ratings share among adults aged 18–49. The episode received mixed reviews from critics, who were left unsatisfied with the lack of resolution for the storylines. For the episode, William H. Macy received a nomination for Outstanding Lead Actor in a Comedy Series at the 70th Primetime Emmy Awards.\nPlot\nAt breakfast, Frank (William H. Macy) tells Liam (Christian Isaiah) that they will rob his friend's house, justifying it by claiming the kid's father is a scammer that loves destroying people's lives. While hesitant, Liam helps Frank in gaining access through the security cameras.\nSvetlana (Isidora Goreshter) has taken Freelania (Tina Ivlev) hostage, alarming Kevin (Steve Howey) and Veronica (Shanola Hampton). Svetlana intends to pose as Freelania during the wedding, as the groom cannot diffentiate them. However, Freelanie's mother is coming over for the wedding, complicating the plan. Kevin and Veronica solve it by picking her up at the airport, and then drugging her in the Alibi. Ian (Cameron Monaghan) goes into hiding, while the police issue an arrest warrant for him. Trevor (Elliot Fletcher) meets him and scolds him for making the movement center around him instead of focusing in the youth center, telling him that he should surrender himself if he wants to do the right thing.\nFiona (Emmy Rossum) is informed by her lawyer (Maggie Wheeler) that Rodney's family is willing to drop the settlement to $3 million if she hands over the property and Rusty. The lawyer suggests Fiona could file for bankruptcy, but Fiona instead sells it to Margo (Sharon Lawrence). She also finally gets Rodney's family to leave by offering them a small sum of money, claiming they will not win the lawsuit. While promising Kassidi (Sammi Hanratty) to stay, Carl (Ethan Cutkosky) plans to leave for military school anyway. She spies on him and handcuffs him to his bed, preventing him from reaching the dateline. Debbie (Emma Kenney) visits Derek (Luca Oriel), who has enlisted in the Army and is engaged to his new girlfriend. Derek wants joint custody of Franny and is willing to pay child support, and Debbie considers the offer.\nKevin and Veronica manage to get Svetlana in time for the wedding, with Kevin walking her down the aisle. After Charlie (Chet Hanks) fails to convince Sierra (Ruby Modine) about his actions, Lip (Jeremy Allen White) asks her to give him a chance, using himself as an example of someone who struggled with alcohol. Instead, Sierra asks him to leave. Liam releases Carl from the handcuffs while Kassidi sleeps, allowing him to reach the bus for military school. He also abandons Frank during the heist, forcing him to steal as many items as possible before security arrives. Eddie runs away and abandons her niece, Xan, at the bike shop. Lip invites Xan into the Gallagher home. Ian leads another protest with his followers, and is subsequently arrested; with the family watching his arrest from TV.\nProduction\nDevelopment\nThe episode was written and directed by series developer John Wells. It was Wells' 17th writing credit and seventh directing credit.\nReception\nViewers\nIn its original American broadcast, \"Sleepwalking\" was seen by an estimated 1.73 million household viewers with a 0.60 in the 18–49 demographics. This means that 0.60 percent of all households with televisions watched the episode. This was a 13% increase in viewership from the previous episode, which was seen by an estimated 1.52 million household viewers with a 0.55 in the 18–49 demographics.\nCritical reviews\n\"Sleepwalking\" received mixed reviews from critics. Myles McNutt of The A.V. Club gave the episode a \"C\" grade and wrote, \"as much as I might be able to forgive Shameless for some of its choices with regards to its past, there is no forgiving how little I care about its future. “Sleepwalking” concludes a season that managed to generate zero forward momentum, largely ignoring the show's history but never managing to use that clean slate to say anything meaningful or create any stories to interest me in what next season brings. The stories that are resolved are done so poorly, and the stories that are left unresolved have offered no reason to feel like their resolution will rescue them from poor story decisions. Even the season's best storyline could not escape “Sleepwalking” unscathed, leaving behind a show that failed to capitalize on its history, struggled to articulate its present, and seems entirely disinterested in investing me in its future.\"\nDerek Lawrence of Entertainment Weekly wrote \"The season ends with the Gallagher kids (at least the ones who aren't at military school or in jail) watching the news coverage of Ian's big protest. Their attention shifts elsewhere when Papa Smurf, a.k.a Frank, now fresh from the Porta Potty and covered in blue, walks in, declaring, \"Not a f—ing word.\"\"\nDavid Crow of Den of Geek gave the episode a 3 star rating out of 5 and wrote \"the season feels unfinished. Central conflicts were abandoned or postponed, and several major storylines concluded with a largely perfunctory quality. There were some affecting moments, as well as some hilarious ones, but as a whole season 8 didn’t bring all its pieces into a grand sum total. Overall that matters little when compared to the weekly enjoyment had from Gallagher debauchery. But when grading the finale? It leaves us wanting a lot more than this.\" Paul Dailly of TV Fanatic gave the episode a 4 star rating out of 5, and wrote, \"\"Sleepwalking\" was a solid hour of this Showtime drama series. These characters are at exciting stages, and I cannot wait to see what the future has in store for them.\"\nAccolades\nWilliam H. Macy submitted the episode to support his nomination for Outstanding Lead Actor in a Comedy Series at the 70th Primetime Emmy Awards. He would lose to Bill Hader for Barry.\nReferences\nExternal links\n*"
    }
  ]
}