{
  "content": [
    {
      "type": "text",
      "text": "# Sleep tracking\n\nAlta HR, a wearable device capable of monitoring a person's sleep.]]\nSleep tracking is the process of monitoring a person's sleep, most commonly through measuring inactivity and movement. A device that tracks a person's sleep is called a sleep tracker. Sleep tracking may be beneficial in diagnosing sleep disorders. As sleep abnormalities are also symptoms of mental illness or relapsing psychotic disorders, it may also be beneficial in diagnosing mental disorders and psychotic disorders as well.\nPolysomnography, the \"gold standard\" method for sleep tracking that requires attaching electrodes and monitors to the patient as they sleep, was developed in the late 1950s. It is considered by sleep researchers as providing the most accurate sleep data, however, it is an expensive, often uncomfortable experience for patients with findings that may be skewed due to the \"first night effect\". The actigraphy, a sleep-tracking device that is worn on one's wrist, was developed in the early 1970s and uses motion sensors. It is considered the \"silver standard\" method of sleep tracking, is comparably less expensive than a polysomnograph, and easier to incorporate into a patient's every day schedule as it looks and feels like a wrist-watch. However, it cannot track sleep-staging, is still generally expensive, and still requires a specialist to analyze the data it collects.\nSleep trackers are now available to consumers in many different forms such as smartphones, smartwatches, fitness trackers, and other wearable devices. Compared to a polysomonograph or an actigraph, consumer sleep-tracking devices are already incorporated into the day-to-day lives of patients and are the most cost-effective sleep-tracking method for patients. However, consumer sleep-tracking devices as they currently are, do not provide reliable sleep data for consumers or healthcare professionals. Additionally, consumer sleep tracking devices do not share their sleep tracking methods or algorithms with the public and may unintentionally undermine the sleep recommendations of health professionals or the need to seek professional help regarding improving sleep quality.\nDevices and methods\nDeveloped in the late 1950s, a polysomnograph, also known as a polysomnogram or a 'sleep study', is a test used to diagnose sleep disorders and is considered as the best and most reliable method to collect sleep data from individuals. A person can undergo a polysomnograph during an overnight stay in either a hospital or in a sleep center (a laboratory). Prior to the start of the polysomnograph, electrodes are attached to the individual's scalp, chin, and outer eyelids to record signals and monitors are attached to the individual's chest to record their heart rate and track their breathing as they sleep. As the individual sleeps, they are monitored by a polysomnograph technologist who will take notes on things such as changes in heart rate and breathing. Sometimes, there is also a video camera recording an individual's movement as they sleep.\nDeveloped in the early 1970s, an actigraphy device is one of the earliest devices used to track the stages of a person's sleep and identify sleep disorders. It is a non-invasive wearable device shaped like a wristwatch that tracks the movement of your body with accelerometers, small motion sensors. This device can collect data over an extended period of time, such as a few weeks or months. Actigraphy devices then uses the collected data to determine if the patient is asleep or awake and can also track the individual's other sleep behaviors such as wake time.\nSleep tracking is now possible through consumer wearable devices such as smartwatches and fitness trackers and applications on smartphones. The features that these consumer sleep-tracking devices offer can vary depending on the device, model, and version. Some sleep-tracking devices are capable of tracking the stages of a person's sleep (light sleep, deep sleep, REM sleep), the length/duration of a person's sleep, the quality of a person's sleep, and the consistency of a person's sleep. Other features offered by sleep-tracking devices may include \"sleep scores\" that rank how well a person slept, \"smart alarms\" that wake a person up within a set period of time based on the circumstances of the person's sleep, and the ability to track the amount of light and/or the temperature in the person's bedroom. Unlike university sleep labs, which have made their sleep algorithms public for many years, the algorithms and methods of data collection used in consumer sleep-tracking devices have not been made public as they are proprietary and can also change at any point in time without notification to the users.\nUtilization and effectiveness\nSleep tracking can be used to track sleep abnormalities and the sleep quality of people and help healthcare providers diagnose their patients with sleep disorders. Sleep tracking can also be used for tracking sleep abnormalities that are symptoms of mental illness. For example, repeated sleep disturbances have been associated with increased risks of suicide, the development of mood disorders such as depression and anxiety, and relapse of psychotic disorders.\nPolysomnography\nPolysomnographies are considered the \"gold standard\" for sleep data collection. However, polysomnographies do not create an environment that is conducive to sleep for most patients, especially patients who already struggle with sleep abnormalities. They are typically inaccessible to the average patient and inconvenient, as they require patients to have wires clipped to their face and monitors strapped to their body, they may need to sleep outside of their typical sleeping environment, they may be uncomfortable with knowing that as they sleep they are being monitored by the polysomongraph technologist, and the test is too expensive to obtain sleep tracking data from one patient for an extended period of time. One night of sleep tracking using a polysomnograph and a polysomnograph technologist can cost up to $2,000. There is the \"one night effect\" where patients will experience more difficulties with sleeping (reflected in decreased REM sleep, decreased sleep efficiency, and increased sleep latency) during their first night of sleep tracking via polysomnography due to the sleep tracking equipment and unusual sleeping circumstances. Additionally, the data collected during a polysomnography can also be subjected to human error.\nActigraphy\nActigraphies are considered the \"silver standard\" for sleep data collection but when compared to polysomnographies are more affordable and accessible to patients. Because of their compact design, actigraphs collect sleep tracking data over a longer period of time from patients without requiring their patients to make major changes to their day-to-day routine or their sleeping environment. The downsides of actigraphs are that they cannot track sleep staging, the storage of data collected on the device is limited, actigraphy devices are still expensive (around $1,000), and a specialist still needs to analyze the data collected from the devices to determine if there are any issues with the device's data collection.\nConsumer devices\nPeople can track their sleep through smartphones with consumer sleep-tracking apps, wearable devices, or a combination or both consumer sleep-tracking apps and wearable devices. Consumer sleep-tracking devices such as smartphones and activity trackers were developed primarily for the use of consumers, not for clinical use or research.\nIn contrast to polysomonographies and actigraphies, smartphones may be easier for people to utilize for sleep tracking purposes as they may already use smartphones in their day-to-day lives. Smartphones also have built-in motion-sensing accelerometers and microphone features and cloud storage. Wearable consumer-sleep tracking devices have been noted to have issues with lost or unusable data due to technical or software issues.\nThe utilization of consumer sleep-tracking devices for clinical data collection has become more widely accepted by healthcare providers because these devices are more affordable and practical compared to polysomnographies and actigraphies. However, consumer sleep-tracking devices still have a long way to go before they produce accurate and reliable sleep-tracking information for the utilization of sleep disorder and mental illness treatment, research, and diagnoses. The motion sensors in smartphones and smartwatches are not medical-grade, smartphone data alone is not enough to capture the full picture of a patient's sleep staging, and data collected from consumer sleep-tracking devices are not reliable enough as monitoring tools as they tended to over or under-estimate data such as total sleep time.\nThere is also a concern among health professionals that consumer sleep-tracking devices and applications may encourage consumers to self-diagnose in reaction to the results of their sleep grade, quality of sleep, or recorded hours of sleep from their consumer sleep-tracking device. Even though the average adult needs between seven and nine hours of sleep, a consumer sleep-tracking device may encourage all of their consumers to strive for eight hours of sleep in order to get a good sleep grade. This can result in consumers feeling anxious over the amount of sleep they get each night and cause them to change their sleeping behaviors in order to improve their sleep according to the consumer sleep-tracking device's algorithm. Additionally, consumers may feel content with the findings of their consumer sleep-tracking devices and forgo seeking professional help.\nIn one study conducted by Rush University Medical College and Northwestern University's Feinberg School of Medicine, three patients who reported having unsatisfying sleep or experiencing sleep abnormalities were utilizing consumer sleep-tracking devices before seeking professional help from sleep therapists. In the study, two patients were not satisfied with the findings or recommendations of the sleep therapists and did not return for a follow-up visit, citing that the recommendations of the sleep therapists did not correspond with the findings of the consumer sleep-tracking device. The one patient who did return for follow-up visits and followed the recommendations of the sleep therapists, which included switching his device from sensitive mode to normal mode and decreasing his hypnotic medication, was reportedly pleased with the progress made in his sleep quality.\nSee also\n* Actigraphy\n* Activity tracker\n* Polysomnography\nReferences"
    }
  ]
}