{
  "content": [
    {
      "type": "text",
      "text": "# Slovak–Hungarian War order of battle: Slovakia\n\nThe following is the Slovak order of battle in 1939 during the Slovak–Hungarian War.\nOverview\nThe Slovak Army was newly born from the disorganized remnants of the former and well-equipped Czechoslovak Army and Air Force. Such was Slovakia's lack of preparedness, that the motorised Hungarian columns initially met almost no resistance, reportedly surprising two companies of Slovaks in their beds.\nThe situation of the Slovak Army\nLieutenant General Augustín Malár was responsible for the defence of the eastern border with Ruthenia (Carpatho-Ukraine). VI Corps, which he had inherited from the Czecho-Slovak Army, had already been seriously disrupted the previous autumn by the First Vienna Award, which had obliged it to abandon its border fortifications and remove its headquarters from Košice to Prešov. The Hungarian occupation of Ruthenia, where the garrison, the 12th Division, had come under VI Corps' jurisdiction, had further undermined it. As VI Corps had largely been based among unreliable Hungarians and Ruthenes, it had a very high proportion of Czechs in its ranks. The 12th Infantry Division was involved in a fighting retreat back into eastern Slovakia over the period of March 14-18, but it then dissolved itself virtually completely as its Czech officers and men headed for home.\nSimilarly, the regiments of the VI Corps' Slovak-based 11th and 17th Divisions, which should have had 2,000-3,000 men each, were only left with between 70 and 400 Slovaks apiece once all their Czechs had gone home. This left the eastern border virtually undefended. Therefore, Malár began to fill out his skeleton units with the reservists called up on March 15.\nAt the same time, Generals Jurech and Imro, in the west of the country began to form units to support Malár as Slovak officers and conscripts began to return from Bohemia and Moravia, but their move to the east was delayed because roads and railways became crowded with Czech troops being repatriated in the opposite direction. The whole repatriation and reinforcement operation had to be organised by the various inexperienced and desperately overstretched Slovak staffs, especially that of Malár in Prešov. There was often bad feelings on both sides. One Slovak artillery officer detraining from Moravia was dismayed to be roundly abused at the station by a Slovak officer, who assumed from his rank that he must be a Czech. Some Czech troops sabotaged their equipment rather than let the Slovaks have it. Malár did manage to persuade a number of Czech officers to stay on temporarily to help Slovakia against the Hungarians, but the general confusion could not be adequately sorted out during the very brief period of hostilities with Hungary.\nThese factors also prevented the remains of the Czechoslovak 3rd Rapid Division, which was based in the far west of the country from being deployed to good effect in the east. Its 3rd Tank Regiment was left with only 10 out of 60 officers and 222 out of 821 other ranks when all the Czech soldiers went home.\nThis was a decisive disadvantage, because the regiment's 70 (out of an establishment of 98) LT vz. 34 (18) and LT vz. 35 (52) light tanks, 30 ČKD/Praga Tančik vz. 33 tankettes, 3 OA vz. 27 and 10 OA vz. 30 armoured cars were more than a match for the five obsolete Fiat 3000B light tanks, 70 Ansaldo 35M tankettes and 3 Crossley 29M armoured cars of the Hungarian invasion force. The only armour Malár had available in Eastern Slovakia were the 9 (10 - 1 destroyed) Gendarmerie OA vz. 30 armoured cars - sold/given by Czech military after the 1938 Munich Agreement rendered them surplus-to-requirements - and nine LT vz. 34 light tanks which the Czechs had evacuated from Carpatho-Ukraine to Humenné and Prešov.\nHowever, once in Slovakia their embittered Czech crews had sabotaged all of them. As a result, none of them were immediately available when the fighting started on the 23 March.\nVI Corps\nCommander-in-Chief: Lieutenant-General Augustín Malár\n:* 16th Infantry Regiment (partially)\n:* 20th Infantry Regiment\n:* 37th Infantry Regiment (partially)\n:* 12th Artillery Regiment (partially)\n:* 112th Artillery Regiment (partially)\n:* Armoured Car Platoon (9 OA vz. 30 armoured cars)\n:* Tank Platoon (3 LT vz. 35 light tanks)\nAir Force\n:* 45th Flight (based in Spišská Nová Ves with 10 Avia B-534 fighter aircraft)\n:* 49th Flight (based in Spišská Nová Ves with 10 Avia B-534 fighter aircraft)\n:* 12th Flight (based in Spišská Nová Ves with 10 Letov Š-28 tactical reconnaissance aircraft and Aero AP-32 tactical reconnaissance aircraft)\n:* 13th Flight (based in Spišská Nová Ves with 10 Letov Š-28 tactical reconnaissance aircraft and AP-32 tactical reconnaissance aircraft)\nNotes\nSources\n* Axworthy, Mark W.A. ''Axis Slovakia - Hitler's Slavic Wedge, 1938-1945'', Bayside, N.Y. : Axis Europa Books, 2002,"
    }
  ]
}