{
  "content": [
    {
      "type": "text",
      "text": "# Slum clearance in the United Kingdom__disambig_2\n\nSlum clearance in the United Kingdom has been used as an urban renewal strategy to transform low-income settlements with poor reputation into another type of development or housing. Early mass clearances took place in the country's northern cities. Starting from 1930, councils were expected to prepare plans to clear slum dwellings, although progress stalled upon the onset of World War II.\nClearance of slum areas resumed and increased after the war, while the 1960s saw the largest number of house renewal schemes pursued by local authorities, particularly in Manchester where it was reported around 27% 'may' have been unfit for human habitation, although the majority were well built solid structures that could have been renovated or repurposed. Housing, churches, schools and pubs that formed close-knit communities were devastated, with families dispersed across other areas. Towards the end of the decade, a housing act in 1969 provided financial encouragement for authorities and landlords to improve existing housing stock and extend the life of many older properties. By 1985, England and Wales had seen over 1.5 million houses declared unfit or demolished over a 30-year period, displacing over 3.6 million people.\nThe Labour government in 2002 launched the Housing Market Renewal Initiative scheme, with the primary objective to demolish housing considered undesirable and replace with new developments. Also known as the Pathfinder programme, the scheme ended in 2011, due to the Conservative austerity program.\nBackground\nFrom the late 19th century up to the 1970s, clearance of slum housing was seen as an expensive undertaking with numerous problems, although generally considered a necessity to achieve a higher standard of living. In the years following World War II, areas affected by slum clearance were usually replaced by social housing, while many of the newer houses had priority allocation given to those who had lost their previous home through demolition. Throughout Britain and other developed countries, historical housing literature suggests that slum clearance and housing renewal policies have had the opposite effect on the poorest people, whom they aimed to support, from that intended: new housing built to replace demolished slum dwellings was often too costly to rent for poorer families, who had lost their homes to make way for newer developments; these typically became occupied instead by the upper working class.\nIn the period following the 1970s, opinions started to change towards the view that clearance was less than effective and too costly, both fiscally and in terms of the break-up of communities. Demolition programmes throughout the 20th century were successful in removing the worst of the country's housing stock and helped improve the quality of homes available for the poor and working class. Generally, no account of the incident or impact of housing clearance was taken before the 2000s.\nEarly 20th century\n, surveying slum clearance areas during a visit by the Minister of Health, 16 October 1925]]\nBetween 1895 and 1918, Liverpool engaged in wide-scale slum clearances, and constructed more homes than any authority outside of London. New housing was intended for tenants displaced by demolition of their old home, although not everyone displaced was re-homed, and only those who could pay the rent were offered a new home. In Leeds, where many slum clearances were of back-to-back houses, the land they occupied was very small and usually incapable of supporting any new profitable developments; this impacted upon site-value compensation.\nWhile new council housing had been built, little had been done to resolve the problem of inner-city slums. Clearance strategies were used predominantly during the early 20th century for redeveloping urban communities, such as in relation to the Housing Act 1930 (also known as the Greenwood Act), which required councils to prepare slum clearance plans, and some progress was made before the start of the World War II. Up to February 1932, 394 clearance areas were declared in England and Wales, affecting 64,000 people. Estimates in 1933 by local authorities in Scotland suggested that nearly 62,000 new homes needed to be built to replace demolished slum housing, of which around 90% were expected to be built within a five-year period. Secretary of State for Scotland Godfrey Collins believed that one could visualise the end of Scottish slums by the end of 1938.\nToward the end of 1936 throughout the United Kingdom, around 25,000 people living in slum housing were being rehoused each month, which had totalled around 450,000 by August 1936. Upon the outbreak of World War II, there were around 1,300 proposed slum clearance orders, of which 103 had been confirmed by January 1940, but virtually no slum housing was cleared during the 15 years following the outbreak of war.\nMid-20th century\nThe drive to clear slum houses resumed in 1955, particularly in Manchester where 68,000 were deemed to be unfit. By 1957, slum clearances were well under way according to Henry Brooke, the Minister of Housing and Local Government, who stated that houses condemned or demolished had gone up from 20,000 in 1954 to 35,000 by 1956, while rehousing over 200,000 people during the mid-1950s. In 1960, 50 local authority clearance figures suggested long-term problems in addressing slums. Through the period 1955–1960, of the estimated 416,706 dwellings deemed unfit, only 62,372 had been cleared by 1960. The authority with the highest number of unfit homes was Liverpool with around 88,000, closely followed by Manchester. By March 1963, Liverpool had only cleared around 10% of the houses deemed unfit in 1955 and was one of 38 local authorities classed as having clearance problems requiring special attention. From 1964 to 1969, 385,270 houses in England were demolished or condemned during slum-clearance schemes. Slum clearance accelerated during the 1960s: 10,000 more slum houses were demolished during 1968 than in 1963.\nIn a speech in the House of Commons in 1965, Alf Morris noted that 20% of the country's poorest dwellings were in the North West region. In Manchester, many dwellings were considered uninhabitable, with an estimated 54,700 dwellings, representing 27.1% of the total, being unfit for habitation. Around three-quarters of the region's poorest residences were located in a belt of land dominated by Manchester and Liverpool. The decline of the region was noted in comparison to comments made by antiquary John Leland, who in 1538 described the town of Manchester as \"the fairest, best builded\" town he had seen. Morris considered that Manchester had shown \"more vigour courage and compassion\" than other cities in tackling the slum housing problem, with 4,000 houses demolished both in 1963 and in 1964, in line with set targets. When comparing slum clearances undertaken by Manchester, Leeds, Birmingham, Liverpool, Sheffield and Bristol, figures suggested that for the five years ending June 1965, Manchester was ahead of the other cities in the number of houses either demolished or compulsory purchased with a view to demolition.\nTowards the end of the 1960s, slum clearances and the consequent destruction of communities were causing concerns for the government. The Housing Act 1969 was introduced to help authorities overcome problems with slum clearances by introducing the concept of general improvement areas, where improvement grants were available. It was estimated in 1970 that around 5 million people lived in condemned houses.\nThe criteria to determine the type of house that could be defined as a slum were amended in the 1969 housing act, typically being applied to houses unfit for habitation and those beyond reasonable repair cost. In some cases, a slum clearance area could be declared without swift action, such as in South Kilburn where 342 unfit houses were identified in 1965 yet only 22 had been demolished by 1970, with local MP Laurence Pavitt commenting that the housing problem was of the most importance to his constituents. In September 1971, the National House Condition Survey estimated that there were around 1.2 million unfit properties in England and Wales, of which 700,000 (58%) fell within existing or proposed areas for clearance. By the early 1970s, new housing estates were mostly occupied by residents who had been displaced by slum clearance or those who were deemed in greatest need. However that was not always the case. The construction of the Byker Wall in Newcastle upon Tyne was intended to provide modern social housing for the residents of Byker, an area of run-down back-to-back housing. Although the new development won many awards, fewer than 20% of the original 1,700 Byker residents were eventually housed there by 1976.\nAftermath\nData from the Ministry of Housing and Local Government suggests that clearances between 1955 and 1985 resulted in around 1.5 million properties demolished and affected about 3.7 million people, although this does not account for people who left the area of their own choice. Few comprehensive studies were conducted at the time on the effect on communities being broken up and resettled.\nPathfinder programme\nIn 2002, the Labour government launched the Housing Market Renewal Initiative scheme, aiming to demolish, refurbish or construct new housing, which ran until 2011. Known as the Pathfinder programme, areas of housing were demolished and replaced with new houses that were aimed towards aspirational tenants, rather than for residents that had formerly lived in the area. Areas in Liverpool, such as the Welsh Streets and the Granby Streets, were threatened with demolition under the scheme but were saved and have since been regenerated and modernised.\nNotes\nReferences\n*\n*\n*\n*\n*\n*\n* }}"
    }
  ]
}