{
  "content": [
    {
      "type": "text",
      "text": "# Small Craft Warnings\n\n) ]]\nSmall Craft Warnings is a two-act play by Tennessee Williams, written in late 1971 and early 1972. Williams expanded his two-scene play Confessional (1970), which had been published in his 1970 compilation Dragon Country, into this full-length play that centers on a motley group of people gathered in a seedy coastal bar in  Southern California.\nOverview\nThe characters include lusty, needy beautician Leona Dawson, an embittered middle-aged woman who repeatedly plays Jascha Heifetz's recording of Tchaikovsky's Serenade Melancholique on the jukebox; her ne'er-do-well live-in lover Bill McCorkle; Doc, an alcoholic who lost his license to practice medicine but still does; Violet, who risks becoming the target of Leona's wrath when she flirts with Bill; Steve, the middle-aged short order cook who is resigned to his fate slinging hash in a waterfront dive; Monk, the congenial bartender; and two gay men&nbsp;– Quentin, a washed-up screenwriter, and Bobby, a young man bicycling from Iowa to Mexico that Quentin picked up on the road.\nAn article about a 2015 regional production noted that Williams wrote: \" 'It is the responsibility of the writer to put his experience as a being into work that refines it and elevates it' to make an audience feel the truth of that work.\" That article analyzes the play, stating that \"there is no single dramatic arc... Interspersed throughout are \"confessional\" moments, monologues of observation and revelation from the individual characters.\"\nThe play is a \"kaleidoscopic ... of monologues... as the action... becomes frozen and muted.\"\nIn Act 1, Leona tells Violet to \"forget the whole enchilada,\" one of the first published examples of the phrase prior to its appearance in the Nixon White House tapes.\nProductions\nThe play premiered on April 2, 1972, at the Off-Broadway Truck and Warehouse Theatre and later moved to the New Theatre on the upper East Side. Richard Altman directed a cast that included Helena Carroll as Leona and William Hickey as Steve. During the course of the run, Irish actor Patrick Bedford assumed the role of Quentin, James Seymour appeared as Bobby, and Tennessee Williams himself took over the role of Doc. Candy Darling, a trans woman from the Warhol stable of \"superstars,\" played the role of Violet, a bewitching, trampy girl whom most of the male characters desire.\nThe play was produced in the West End at the Comedy Theatre in 1973, with Elaine Stritch, Peter Jones, George Pravda, Edward Judd, Frances de la Tour, James Berwick, Tony Beckley, Eric Deacon, and J M Bay.\nThe play was produced Off-Broadway at the Tribeca Playhouse in June to July 19, 1999, directed by Jeff Cohen.\nThe play was presented Off-Broadway in 2001 by the Jean Cocteau Repertory, directed by Scott Shattuck.\nThe Off-Broadway Studio Theatre produced the play in February 2011, directed by Austin Pendleton, who also played Quentin.\nCritical reception\nIn his review in The New York Times, Clive Barnes wrote: \"This is almost a dramatic essay rather than a play, a temperature reading of a time and a place . . . This is perhaps best regarded as a play in waiting, a pleasurable and rewarding exercise of style . . . This is not a major Tennessee Williams play, but it will certainly do until the next one comes along, and I suspect it may survive better than some of the much touted products of his salad years.\"\nThe CurtainUp reviewer of an Off-Broadway 2011 production wrote: \"Even in a better production, the episodes and characters of this play often come across as either too calculated or overly sentimental. Indeed the characters seem to be mere tokens of those found in the playwright's earlier (and better) dramas.\"\nReferences\nExternal links"
    }
  ]
}