{
  "content": [
    {
      "type": "text",
      "text": "# SmartBear Software\n\n| founder = Jason Cohen\n| hq_location_city = Somerville, Massachusetts\n| hq_location_country = U.S.\n| key_people = Dan Faulkner (CEO)\n| num_employees = 1000+\n| website =\n}}\nSmartBear Software is an American privately-held information technology company that delivers tools for application performance monitoring (APM), software development, software testing, API testing and API management. The company is based in Assembly Square in Somerville in the Greater Boston Area. The company was founded in 2009 when SmartBear, AutomatedQA and Pragmatic Software were acquired by Insight Venture Partners.\nHistory and founding\nThe original Smart Bear company was founded by Jason Cohen in 2003. Insight Venture Partners acquired three companies, Smart Bear, AutomatedQA and Pragmatic Software, between 2007 and early 2009. These companies operated as AQA Holdings until being rebranded as SmartBear Software in 2010.\nAfter the rebranding, the company acquired Eviware in 2011, leading to API promoter and SoapUI's founder, Ole Lensmar, joining the company. He later served as chief technology officer (CTO) of SmartBear. That same year, the company acquired APM vendor AlertSite.\nIn 2013 SmartBear acquired Spanish APM vendor Lucierna. SmartBear then acquired the Open-Source Community Swagger in 2015 and its founder, Tony Tam, joined the company as head of products for Swagger and the commercial version of Swagger, SwaggerHub. In 2016, SmartBear acquired CrossBrowserTesting.com (CBT) and Ken Hamric, founder of CBT, joined the company as general manager of CrossBrowserTesting.com.\nIn 2017, Francisco Partners acquired a majority stake in SmartBear Software.\nAutomatedQA\nAutomatedQA Corporation specialized in automated software testing tools and developer tools. It was founded in 1999 in Las Vegas, Nevada. The company's first product was AQtime, a binary instrumentation profiler to help optimize performance for applications developed with Microsoft and Borland compilers. It was released on November 12, 1999. The first version of TestComplete, AutomatedQA's automated software testing tool, was released in December 2000. In 2004, AutomatedQA released Automated Build Studio, an automated build management and continuous integration application. AQtrace, a new product by AutomatedQA, was released in June 2008. AutomatedQA had received an SD Times 100 award three times, including the most recent SD Times 100 list for 2008.  The SD Times 100 award honors the top 100 leaders and innovators in the software development industry as judged by SD Times magazine.\nAutomatedQA remained an independent subsidiary of SmartBear from 2007 to 2010 until being merged into SmartBear Software.\nCompany\nSmartBear is based in the Greater Boston Area and has U.S. offices in Tennessee, and Florida. SmartBear also has offices and development centers in Ireland, India, Finland, Poland, Melbourne, and Sweden. Frank Roe became chief executive in March 2020.\nSmartBear Software offers products in the following categories: API lifecycle, automated testing, behaviour-driven development (BDD), test management, performance testing, mobile testing, monitoring, code review, and three open-source tools.\nReferences\nExternal links\n*"
    }
  ]
}