{
  "content": [
    {
      "type": "text",
      "text": "# Smoggie Queens\n\nSmoggie Queens is a British television sitcom set in Middlesbrough focusing on the chosen family and lives of  a group of LGBTQ friends. It premiered at Middlesbrough Town Hall and was first broadcast on BBC Three on 28 November 2024 and BBC iPlayer. Smoggie in the title is a demonym for people from Middlesbrough.\nThere are a number of cameos including Michelle Visage and Steph McGovern. The series is produced by Hat Trick Productions, and has funding support by North East Screen Industries Partnership delivered by North East Screen. The worldwide distribution is by Hat Trick International.\nOn 24 March 2025, the BBC announced that Smoggie Queens has been recommissioned for a second series.\nCast and crew\nSources:\n{| class=\"wikitable\"\n|Phil Dunning\n|Dickie\n|-\n|Mark Benton\n|Mam\n|-\n|Alexandra Mardell\n|Lucinda\n|-\n|Elijah Young\n|Stewart\n|-\n|Patsy Lowe\n|Sal\n|-\n|Neil Grainger\n|Neil\n|-\n|Charlotte Riley\n|Danni\n|-\n|Peter McPherson\n|Harrison\n|-\n|Michael Mather\n|Bobby\n|-\n|Ashley Artus\n|Victor Starbright\n|-\n|Lauryn Redding\n|Mel\n|}\n{| class=\"wikitable\"\n|+Writer\n|Phil Dunning\n|Writer\n|}\n{| class=\"wikitable\"\n|+Crew\n|Andrew Chaplin\n|Director\n|-\n|Chris Jones\n|Producer\n|-\n|Jimmy Mulville\n|Executive Producer\n|-\n|Jessica Sharkey\n|Executive Producer\n|-\n|Gregor Sharp\n|Executive Producer\n|-\n|Charlotte Wolff\n|Line Producer\n|-\n|Charlie Fawcett\n|Editor\n|-\n|Andy Kinnear\n|Editor\n|-\n|Alex Nikolaidou\n|Production Designer\n|-\n|Sam Claypole\n|Casting Director\n|-\n|Ryan Hooper\n|Costume Designer\n|-\n|Matt Wicks\n|Director of Photography\n|-\n|Jessica Richardson\n|Make-up Designer\n|-\n|Kim Sellwood\n|Graphics\n|-\n|La' Toyah McDonald\n|1st Assistant Director\n|}\nReviews\nRachel Aroesti of The Guardian gave the series as 3 out of 5 stars \"This series about a tight-knit queer community joyfully celebrates British camp culture – from deadpan humour to loving Lorraine Kelly. What a shame it’s not more funny.\"\nYvonne Wancke of North East Bylines said \"I watched BBC's Smoggie Queens over the Christmas break and what a delight! It's funny, charming, delightful, and moving – all at once. The writing is awesome and the cast are truly splendid. A must watch in my opinion.\"\nNick Levine of The i Paper gave 4 out of 5 stars  \"Smoggie Queens is a reminder that queer people form chosen families all over the country, not just in big cities like London and Manchester that are traditionally seen as more accepting. It might be packed with daft laughs, but it's also thoroughly comforting – no mean feat for a show that drops the word “gooch” in its opening scene.\"\nAwards\n{| class=\"wikitable\"\n|+\n!Year\n!Award\n!Category\n!Nominee\n!Result\n!Citation\n|-\n|2025\n|Royal Television Society RTS North East and the Border Awards\n|Comedy Award\n|Smoggie Queens\n|Won\n|\n|-\n|2025\n|Royal Television Society RTS North East and the Border Awards\n|Best Newcomer\n|Phil Dunning\n|Won\n|\n|-\n|2025\n|Comedy.co.uk Awards\n|Best New Sitcom\n|Smoggie Queens\n|Result pending\n|\n|}\nReferences\nExternal links\n*\n*\n*"
    }
  ]
}