{
  "content": [
    {
      "type": "text",
      "text": "# Smoking in Taiwan\n\n]]\nSmoking in Taiwan is regulated by the Tobacco Hazards Prevention Act (Taiwan). Tobacco advertising is banned, and smoking is banned in all indoor public places. Taiwan was the second Asian country to institute an indoor smoking ban, after Bhutan. The Government of Taiwan (Republic of China) is planning to extend the smoking ban to cars, motorbikes, and pedestrians.\nPrevalence\nOf Taiwan's population of 23 million, about 5 million people smoke. Within Taipei, Taiwan's capital city, the prevalence rate decreased to 15.3% in 2009. 2010 was Taipei's Anti-smoking year.\nHowever, in 2013 Taiwan recorded 18% of adult smoking rate, the lowest since 1990. This was the result of the government efforts to discourage smoking since the enactment of the Tobacco Hazards Prevention Act in 1997. Studies have shown that the smoke-free legislation has had a positive effect on the rate of quitting attempts and annual cessation rates in Taiwan.\nLaw\nSmoking is prohibited in the following places:\n* schools under the level of senior high school and other places in which the main purpose is to provide education or a venue for activities to children and teenagers\n* the indoor places of colleges or universities, libraries, museums, art galleries, and other institutions for cultural or social education\n* the places of medical treatment centers, nursing institutions, other medical institutions, and social welfare organizations, with the exception of the indoor smoking rooms of welfare organizations for the elderly with independent ventilation systems and that are completely separated from the non-smoking areas (rooms), or the outdoor places of said social welfare organizations for the elderly\n* the indoor places of governmental agencies and state-owned enterprises\n* mass transportation vehicles, taxicabs, tour buses, the MRT system, stations, and traveler waiting areas\n* places where flammable or explosive articles are manufactured, stored, or sold\n* business places of financial institutions, post offices, and telecommunication enterprises\n* places providing indoor physical training, sports, or body fitness\n* inside classrooms, reading rooms, laboratories, performance halls and auditoriums, exhibition halls, conference halls (rooms) and elevators\n* the indoor places of opera houses, movie theaters, audiovisual singing businesses, information leisure businesses, and other public leisure entertainment places\n* the indoor places of hotels, shopping malls, dining and drinking establishments, and other places for public consumption, except for those places with indoor smoking rooms that have independent ventilation systems and that are completely separated from the non-smoking areas (rooms), semi-open-air restaurants and places that provide drinks, cigar bars, and pubs and audiovisual singing businesses that open business after 9:00pm and are restricted to those 18 years of age or older\n* indoor workplaces shared by more than three persons\n* other indoor places for public use and places or transportation vehicles designated by the competent authorities at each level.\nConspicuous non-smoking signs shall be placed at all entrances of the places prescribed in the preceding paragraph. No smoking paraphernalia shall be supplied or displayed therein.\nGuidelines for related measures of space, equipment and establishment of the indoor smoking rooms prescribed in the preceding Subparagraph 3 of Paragraph 1 and the provision of the preceding Subparagraph 11 of Paragraph 1 shall be enacted by the central competent authority in charge.\nAs per the authorization of the Tobacco Hazards Prevention Act (“the Act” hereafter) promulgated on 11 July 2007, the guidelines for related measures of space, equipment and establishment of the indoor smoking rooms (“the room” hereafter) prescribed in the Act’s Subparagraph 3 of Paragraph 1 in Article 15 and the provision of the Act’s Subparagraph 11 of Paragraph 1 in Article 15 were enacted by Department of Health, Executive Yuan, and are summarized as follows:\n* The area shall be above 6 m2 and below 35 m2. It may occupy at most 20% of the total floor space of the establishment.\n* No services other than smoking, cleaning or maintenance shall be provided.\n* The room shall be fully separated with physical barriers from other areas of the building.\n* The entrance shall be sliding door type with automatic closing mechanism. It shall remain closed except when people enter or leave the room.\n* The requirements of the independent air-conditioning and ventilation systems of the room are as follows:\n** equipped with fresh air and exhaust ductwork directly connecting to outdoor area and independent to any other indoor spaces, air-conditioning or ventilation systems;\n** negative pressure of 8 Pa;\n** ventilation rate of 30 m3/hour per m2 of floor area of the room and replaces the full volume of air 10 times per hour;\n** distance between the exhaust vent of the room and the entrance of the building or any other buildings or nonsmoking areas shall be above 5 m.\n* The room shall not be in operation 1 hour before and after the cleaning or maintenance work and the independent air-conditioning and ventilation system shall remain on during this period.\nEnforcement\nFines have been issued to both individuals and businesses for violations. The government created a hotline (0800-531-531) and offers a monetary reward for citizens who submit photos of violations.\nReferences\nExternal links\n*[https://web.archive.org/web/20100511132128/http://briandavidphillips.typepad.com/brian/2009/01/no-smoking-taiw.html No Smoking: Taiwan's Tobacco Hazard Prevention and Control Act]\n*[https://web.archive.org/web/20120305104753/http://www.topnews.asia/content/2187-tobacco-hazards-prevention-act-implemented-taiwan Tobacco Hazards Prevention Act implemented in Taiwan]\n*[https://web.archive.org/web/20110727233846/http://www.globalink.org/tobacco/docs/ap-docs/legislation/law-tw.html Taiwan - Tobacco Hazards Control Act]\n*[http://www.tobacco.org/news/275209.html Tobacco Hazard Prevention Act takes effect in Taiwan]"
    }
  ]
}