{
  "content": [
    {
      "type": "text",
      "text": "# Smoking in Russia\n\ncigarettes found in Russia and other post-Soviet states]]\nPer capita tobacco smoking rates in Russia have historically ranked among the highest in the world, making it a prized market for tobacco companies facing declining growth in the heavily-regulated Western world. Russia was the fourth-largest consumer of cigarettes with an annual consumption of about 400 billion cigarettes. In 2012, approximately 44 million Russians were smokers, or about 40% of the population (60% were men and 22% were women). Since then, however, the smoking rates have fallen significantly, mostly in part due to aggressive tobacco control reforms implemented by the Putin administration in the early 2010s. As of 2024, 18.6% of the current population are daily smokers.\nAccording to the Public Chamber of Russia, smoking kills around 400,000 Russians per year. These smoking-related deaths cost the Russian economy about 3% of its annual GDP, amounting to $36 billion.\nSmoking in the Russian Empire\nEnglish merchants first introduced tobacco to Russia in the 1560s. In 1634 the patriarch of Russia condemned smoking and snuff as a mortal sin, and the Tsar criminalized its use. Offenders risked whippings and nose slitting, or even the death penalty. The ban was not well enforced; Tobacco steadily became more popular in elite circles. In the 1690s Peter the Great reversed course, allowed usage, and sold monopoly rights to an English company to import and sell Virginia tobacco. The imperial court now hailed smoking as a welcome sign of development and Westernization.\nRussians smoked the papirosa, a hollow cardboard tube, extended by a thin paper tube which the user fills with tobacco. The cardboard tube acts as a holder. Tobacco consumption expanded thanks to the reforms of Tsar Alexander II in the 1860s and 1870s, especially the emancipation of the serfs and the modernization of the military. Thereby tobacco went from a minor product of occasional use to become a mainstay of Russian identity by 1914, when the average urban male smoked a pack of papirosa a day. This happened despite the hostility of the established church, which taught that smoking contradicted Russian Orthodox traditions. Peasants in Ukraine grew tobacco on their small plots. Very harsh working conditions for the women and children who worked in the papirosa factories sparked labor unrest in 1905 and 1917.\nSmoking in the Soviet Union\nAlthough the Soviet regime condemned tobacco, smoking continued to grow and spread in the country. More women took up smoking. The unique style of papirosa smoking flourished and had broad cultural, social, and gendered consequences. According to Tricia A. Starks, the Soviet Union in the 1920s launched an antismoking campaign carried out by the Communist party on a national scale. It was led by Nikolai Semashko in his role as Commissar of Public Health. The program sought with little success to reduce tobacco cultivation and production. However it did launch an intense propaganda attack against tobacco. The campaign was highly innovative in its approach to antismoking propaganda and treatment programs. These initiatives involved the mass distribution of antismoking materials such as posters, pamphlets, articles, plays, and films, alongside the implementation of special state-sponsored smoking cessation programs that claimed high success rates.\nSmoking in the Russian Federation\n]]\n]]\nDuring and after the collapse of the Soviet Union in the early 1990s, there was a summer-long cigarette shortage which led to public outrage and protests in major cities. In Moscow, the city council decided to ration cigarette purchases to half a pack of cigarettes per day. The shortage was caused when half of all cigarette factories in the country were closed for repair, and imports from Bulgaria plunged. President Gorbachev pleaded with Washington for help, and the largest American tobacco companies hurriedly made plans to ship 34 billion cigarettes to Russia, at a dollar a pack.  The crisis eased and a new opportunity emerged. As Communism collapsed in Eastern Europe and the USSR, 1989-1991, Philip Morris, R.J. Reynolds and Reemtsma (the main German firm) moved in and bought out 75% of the old tobacco industry. Marlboro and the other Western brands replaced the old papirosa, with a plentiful supply and massive advertising. They were welcomed as \"liberators.\"\nAs of 2025, the regions with the highest rates of smoking are in the Far Eastern Federal District—with the highest in the Jewish Autonomous Oblast at 34.4%, followed by the Amur Oblast at 28.8%, Buryatia at 27.7%, Tuva at 27.1%, and the Altai Republic at 26.9%. The regions with the lowest smoking rates are primarily in the North Caucasian Federal District—with the lowest in Chechnya at 0.2%, followed by Ingushetia at 6.2%, Kabardino–Balkaria at 10.3%, and Karachay–Cherkessia at 11.2%.\n2013 smoking bans\nIn 2013 the government imposed bans on smoking in public places. According to the World Health Organization, per-capita smoking in Russia fell 20% between 2000 and 2020.\nSee also\n* Alcohol in Russia\n* Apollo-Soyuz (cigarette), a brand of cigarette\n* Belomorkanal (Russian: Беломорканал) is a brand of cigarette\n* Donskoy Tabak, Russia's fourth-largest cigarette manufacturer\n* Java (cigarette), a brand of cigarette\n* Jin Ling, a brand of cigarette\n* Laika (cigarette), a brand of cigarette\n* Prima, a brand of cigarette\nReferences\nFurther reading\n* Corti, Count. A history of smoking (Bracken 1996 reprint; 1931) [https://archive.org/details/historyofsmoking0000cort online]\n* Frederiksen, O. J. \"Virginia Tobacco in Russia under Peter the Great.\" Slavonic and East European Review. American Series 2#1 (1943), pp.&nbsp;40–56. [https://www.jstor.org/stable/3020133 online]\n* Gately, Iain. Tobacco: a cultural history of how an exotic plant seduced civilization (Open Road+ Grove/Atlantic, 2007) [https://books.google.com/books?id=x41jVocj05EC&dq=Tobacco:+A+Cultural+History+of+How+an+Exotic+Plant+Seduced+Civilization&pg=PA1 online].\n* Gilmore, Anna B., and Martin McKee. \"Moving East: how the transnational tobacco industry gained entry to the emerging markets of the former Soviet Union—part I: establishing cigarette imports.\" Tobacco control 13.2 (2004): 143-150. [https://scholar.google.com/scholar?output=instlink&q=info:Y5hsPegwhmYJ:scholar.google.com/&hl=en&as_sdt=0,27&scillfp=1875114605206423465&oi=lle online]\n* Gedvilaitė, Vaida, et al. \"Lung Cancer in Lithuania.\" Journal of Thoracic Oncology 15.9 (2020): 1401–1405.\n* Goodman, Jordan, ed. Tobacco in History and Culture: An Encyclopedia (2 vol, Gale, 2005) ISBN 0-684-31405-3\n* Lillard, Dean R., and Z. L. A. T. A. Dorofeeva. \"Smoking in Russia and Ukraine before, during, and after the Soviet Union.\" in Life-course smoking behavior: Patterns and National Context in ten countries (2015): 117–140.\n* Romaniello, Matthew P., and Tricia Starks, eds. Tobacco in Russian History and Culture From the Seventeenth Century to the Present (2011) [https://books.google.com/books?id=CuWPAgAAQBAJ&dq=+Tricia+Starks&pg=PP1 online]\n* Rupert, James, and Glen Frankel. \"In ex-Soviet markets, US brands took on role of capitalist liberator.\" Washington Post (19 November 1996)\n* Shkolnikov, Vladimir M.; et al. \"Time trends in smoking in Russia in the light of recent tobacco control measures: synthesis of evidence from multiple sources\". BMC Public Health (2020). 20:378. doi:10.1186/s12889-020-08464-4. PMC 7092419. PMID 32293365.\n* Sinelnikov, Leonid. Smoke and Mirrors: From the Soviet Union to Russia, the Pipedream Meets Reality (Unicorn Publishing, 2020).\n* Starks, Tricia. Smoking under the Tsars: A History of Tobacco in Imperial Russia (Cornell University Press, 2018) [https://books.google.com/books?id=rkBQDwAAQBAJ&dq=Starks,+Tricia+A.&pg=PT6 online].\n* Starks, Tricia. Cigarettes and Soviets: Smoking in the USSR (Cornell University Press, 2022). [https://books.google.com/books?id=2QZLEAAAQBAJ&pg=PR7 online]\n* Starks, Tricia. \"Tobacco Product Design, Marketing, and Smoking in the USSR.\" in Consumption and Advertising in Eastern Europe and Russia in the Twentieth Century (Cham: Springer International Publishing, 2023) pp.&nbsp;243–264.\n* Starks, Tricia. \"Red Star/Black Lungs: Anti-Tobacco Campaigns in Twentieth-Century Russia,\" Journal of the Social History of Alcohol and Drugs 21:1 (2006): 50–68.\n* Starks, Tricia A. \"A revolutionary attack on tobacco: Bolshevik antismoking campaigns in the 1920s.\" American journal of public health 107.11 (2017): 1711–1717. [https://ajph.aphapublications.org/doi/pdf/10.2105/AJPH.2017.304048?download=true online] doi: 10.2105/AJPH.2017.304048\n* Žvirblys, Atas. \"The Oldest clay tobacco pipes from Vilnius, Lithuania: the interpretation of origin, chronology and social context.\" Eesti Arheoloogia Ajakiri 25.2 (2021): 93–112. [https://vb.ku.lt/object/elaba:100151300/100151300.pdf online]\nExternal links\n* [https://www.bing.com/videos/search?q=smoking+in+russia&docid=603531415809762291&mid=9F7939CB0876772B86AE9F7939CB0876772B86AE&view=detail&FORM=VIRE Russia imposes bans on smoking in public places, 2013]\n*  [https://www.google.com/search?rlz=1C1ONGR_enUS1013US1013&sxsrf=AB5stBgy6SmYKCzyWwbom7UmiVcJ_whoFg:1691188328617&q=papirosa&tbm=isch&source=lnms&sa=X&ved=2ahUKEwjZ_sy8h8SAAxW1AzQIHQCMDdUQ0pQJegQIDRAB&biw=1366&bih=611&dpr=1 illustrations of papirosa.]"
    }
  ]
}