{
  "content": [
    {
      "type": "text",
      "text": "# Snehasikta Swarnakar\n\n| workplaces        =\n| alma_mater        =\n| doctoral_advisor  =\n| doctoral_students =\n| known_for         = Studies on gastric, ovarian, head and neck cancers\n| awards            =\n}}\nSnehasikta Swarnakar (born 1963) is an Indian chemical biologist and the senior principal scientist at the Division of Cancer Biology and Inflammatory Disorder of the Indian Institute of Chemical Biology. Known for her studies in the field of gastric, ovarian, head and neck cancers, Swarnakar is an elected fellow of the National Academy of Sciences, India and the West Bengal Academy of Science and Technology. The Department of Biotechnology of the Government of India awarded her the National Bioscience Award for Career Development, one of the highest Indian science awards, for her contributions to biosciences in 2007.\nBiography\n.]]\nSnehasikta Swarnakar, born in 1963 in the Indian state of West Bengal, secured a PhD in 1993 from Jadavpur University for her thesis, Studies on a sialic acid-binding lectin from albumin gland of apple snail Pila globosa, working on junior and senior research fellowships from the Council of Scientific and Industrial Research and moved to the US for her post-doctoral work which she completed at the University of California, Davis and Marine Biological Laboratory during 1994–97. She started her career in 1997 as a research scientist at the Stony Brook University where she worked until 2001 and on her return to India, she joined the Division of Cancer Biology and Inflammatory Disorder of the Indian Institute of Chemical Biology where she holds the position of a senior principal scientist. In between, she had two stints as a visiting scientist abroad; first at the Scripps Research Institute in 2002 and then at the University of Connecticut in 2007. She is also a visiting professor at the Department of Environmental Science of the University of Calcutta.\nSwarnakar resides along Lake Road in Kolkata.\nLegacy\nSwarnakar's research is focused on cancer biology and she is known to have conducted basic and translational research on various types of cancers such as lung, brain, oral, breast, pancreatic, blood and cervical cancers.\nShe led a team of scientists who worked on the therapeutic properties of turmeric and they identified that the controlled dosage of curcumin, an ingredient of turmeric which gave the rhizome its yellow color, acted as a therapeutic agent for gastric inflammation and ulceration. They demonstrated that curcumin increased MMP2 enzyme level while deceasing the MMP9 enzyme, thus ensured balance of the two enzymes which acted in opposite ways in the formation of new blood vessels. They also proposed a treatment protocol for gastric ulcers with the use of  nanocapsules and antioxidants where quercetin, an antioxidant present in apples, tomatoes and onions is administered through nanocapsules to treat ethanol-induced gastric ulcers. Her studies have been documented by way of a number of articles and ResearchGate, an online repository of scientific articles has listed 103 of them. Besides, she has contributed chapters to books edited by others. She has also delivered invited or plenary speeches at science conferences and has mentored several scholars in their post-graduate and doctoral studies.\nSwarnakar is member of the governing body of the ANB Memorial Foundation, a trust in memory of Amar Nath Bhaduri, the noted chemical biologist she was the secretary of the organizing committee of the 2nd International Meet on Advanced Studies on Cell Signaling Network (CeSiN 2014) held in Kolkata. She is the treasurer of the West Bengal Academy of Science and Technology and sits in the council of the Chemical Biology Society. She is also a life member of the Indian Science Congress Association, the Biotech Research Society, India, the Society for Free Radical Research, the International Society for Computational Biology and the Society of Biological Chemists, India.\nAwards and honors\nThe Department of Biotechnology of the Government of India awarded her the National Bioscience Award for Career Development, one of the highest Indian science awards in 2007. She was elected as a fellow by the National Academy of Sciences, India in 2012 and was one of the team members of Anirban Bandyopadhyay who won the Palo Alto Longevity Prize in 2013. She is also an elected fellow of the West Bengal Academy of Science and Technology.\nSelected bibliography\nChapters\n*\n*\nArticles\n*\n*\n*\nSee also\n* Causes of cancer\n* Cancer syndrome\nNotes\nReferences\nFurther reading\n*\nExternal links\n*"
    }
  ]
}