{
  "content": [
    {
      "type": "text",
      "text": "# Social class in ancient Rome__disambig_1\n\nSocial class in ancient Rome was hierarchical, with multiple and overlapping social hierarchies. An individual's relative position in one might be higher or lower than in another, which complicated the social composition of Rome.\nThe status of freeborn Romans during the Republic was established by:\n* Ancestry (patrician or plebeian).\n* Census rank (ordo) based on wealth and political privilege, with the senatorial and equestrian ranks elevated above the ordinary citizen.\n* Gender.\n* Citizenship, of which there were varying types\n* The commoners and slaves were in the lower class\nPatricians and Plebeians\nTraditionally, patrician refers to members of the upper-class, while Plebeian refers to lower-class. Economic differentiation saw a small number of families accumulate most of the wealth in Rome, thus giving way to the creation of the patrician and plebeian classes. After this initial distinction, however, the divide between patrician and plebeian families was strictly hereditary, based on social status.\nand calceus, shown here on a statue restored with the head of Nerva, was the distinctive garb of Roman male citizens.]]\nThe plebeians constituted the majority of Roman citizens after a series of political conflicts and equalization. Although patricians are often represented as rich and powerful families who managed to secure power over the less-fortunate plebeian families, plebeians and patricians among the senatorial class were often equally wealthy. As civil rights for plebeians increased during the middle and late Roman Republic, many plebeian families had attained wealth and power while some traditionally patrician families had fallen into poverty and obscurity. Regardless of how rich a plebeian family became, they would not rise to be included in the ranks of the patricians. By the second century BC, the divide between patricians and plebeians had lost most of its distinction and began to merge into one class.\nPatrician\nPatricians were considered the upper class in early Roman society. They controlled the best land and made up the majority of the Roman senate. It was rare—if not impossible—for a plebeian to be a senator until 444 BC. In appearance, they were chiefly distinguished from the plebs by their dyed and ornamented shoes (). A common type of social relation in ancient Rome was the  system that involved a patron and client(s) that performed services for one another and who were engaged in strong business-like relationships. Patricians were most often the patrons, and they would often have multiple plebeian clients. Patrons provided many services to their clients in exchange for a promise of support if the patron went to war. This patronage system was one of the class relations that most tightly bound Roman society together, while also protecting patrician social privileges.  continued into the late Roman society, spanning almost the entirety of the existence of ancient Rome. Patricians also exclusively controlled the office of the censor, which controlled the census, appointed senators, and oversaw other aspects of social and political life. Through the censors, patricians were able to maintain their status over the plebeians.\nPlebeians\nPlebeians were the lower class of Rome, laborers and farmers who mostly worked land owned by the patricians. Some plebeians owned small plots of land, but this was rare until the second century BC. Plebeians were tied to patricians through the  system of patronage that saw plebeians assisting their patrician patrons in war, augmenting their social status, and raising dowries or ransoms. Plebeians were barred from marrying patricians in 450 BC but this law was annulled five years later in 445 BC by a tribune of the plebs. In 444 BC, the office of military tribune with consular powers was created. The plebeians who filled this office were then entitled to join the senate after their one-year term was completed. For the most part, however, plebeians remained dependent on those of higher social class for the entirety of the existence of ancient Rome.\nProperty-based classes\nRoman society was also divided based on property in the Centuriate Assembly, and later on in the republic, membership of the senatorial class was also based on property. The senatorial class had the highest property threshold. The Centuriate Assembly was responsible for declaring war, for electing magistrates with imperium, and for trying select cases. from 176 AD. This statue is believed to be from the Capitoline Hill in Rome, and is the only equestrian statue that survives.]]\nOnly Romans who were wealthy enough to afford their own armour were allowed to serve in the army, which consisted of both patricians and plebeians. As long as a citizen could afford armour, he was able to be a soldier. The Centuriate Assembly was divided into groups based on how wealthy one was and one’s ability to provide his armour and weapons.\n{| class=\"wikitable\"\n|+Centuriate Assembly\n!Class\n!Centuries / Votes\n!Census property\n!Equipment\n|-\n|Equestrians\n|18\n|\n|Horse, full armour, various weapons\n|-\n|Class I\n|80\n|100,000 As\n|Full armour, some weapons\n|-\n|Class II\n|20\n|75,000 As\n|Almost full armour, some weapons\n|-\n|Class III\n|20\n|50,000 As\n|Some armour, few weapons\n|-\n|Class IV\n|20\n|25,000 As\n|Little armour, few weapons\n|-\n|Class V\n|30\n|11,000 As\n|No armour, single weapon\n|-\n|Proletariate\n|5\n|\n|None\n|-\n|Total centuries / votes\n|193\n|\n|\n|}\nThe Equestrians and Class I held 98 votes between them, thus they could outvote the combined lower classes who only had 95 votes. This was a means for the wealthier classes to maintain control over the army and social life.\nGender-based classes\nPaterfamilias\nRoman society was patriarchal in the purest sense; the male head of household was the paterfamilias, he held special legal powers and privileges that gave him jurisdiction (patria potestas) over all the members of his familia. Fathers were in charge of educating their sons. Additionally, adult sons would often marry and continue to live in the family household under their paterfamilias until their father died and they took over the responsibility of paterfamilias. The paterfamilias could also perform an emancipatio (emancipation) rituala process that set the son free, three times in a rowto grant the son his own legal authority, free from the paterfamilias.\n, the ideal Roman woman from the Roman tale, The Death of Lucretia.]]\nWomen\nFree-born women in ancient Rome were citizens (cives), but could not vote or hold political office. Women were under exclusive control of their paterfamilias, which was either their father, husband, or sometimes their eldest brother. Women, and their children, took on the social status of their paterfamilias. Women were not included in the political sphere, and they had little influence outside the home. However, women of wealthier families had more political power than poorer women as they were able to exert their influence behind the scenes of public, political actions.\nThere were three early forms of marriage that transferred Roman women from one paterfamilias to another. The first, coemptio, represented the purchase of the bride. This oldest form of marriage required five witnesses and an official, and was treated as a business transaction. The second, usus, occurred after one year of intimacy between a man and a woman. If the woman did not leave the man for three nights following the year, she became the man's possession and he became her paterfamilias. If the woman left before the three nights were over, she would return to her family. The relationship would still be valid, but the man would not become her paterfamilias. The last form of marriage, confarreatio, was the closest to modern marriage. Confarreatio was a religious ceremony that consisted of the bride and groom sharing bread in front of religious officials and other witnesses.\nBy the end of the second century AD, marriages sine manu were the standard form of marriage. Through a marriage sine manu, women did not fall under the legal jurisdictions of their new husbands or their fathers. They controlled their own property (usually their dowry) after the death of their father. Men still had to sign any paperwork on behalf of their women, but there were now two economic units in the marriage. Moreover, divorce could be initiated by either man or woman, often by saying \"I divorce you\" three times while in front of witnesses.\nThe legal status of a mother as a citizen affected her son's citizenship. The phrase ex duobus civibus Romanis natos (\"children born of two Roman citizens\") indicates that a Roman woman was regarded as having citizen status, in specific contrast to a peregrina.\nSlavery and freedmen\nSlaves\nSlaves (servi) were not citizens, and lacked even the legal standing accorded free-born foreigners. Slaves were seen as property, and they were bought and sold like any other good in Rome. For the most part, slaves descended from debtors and from prisoners of war, especially women and children captured during sieges and other military campaigns in Greece, Italy, Spain, and Carthage. In the later years of the Republic and into the Empire, more slaves came from newly conquered areas of Gaul, Britain, North Africa, and Asia Minor. Many slaves were created as the result of Rome's conquest of Greece, but Greek culture was considered in some respects superior to that of Rome: hence Horace's famous remark Graecia capta ferum victorem cepit (\"Captured Greece took her savage conqueror captive\"). The Roman playwright Terence is thought to have been brought to Rome as a slave. Thus slavery was regarded as a circumstance of birth, misfortune, or war; it was defined in terms of legal status, or rather the lack thereof, and was neither limited to or defined by ethnicity or race, nor regarded as an inescapably permanent condition. Slavery was more prominent in Roman antiquity than anywhere else in the ancient world, save for Greece.\nSlaves who lacked skills or education performed agricultural or other forms of manual labor. More slaves were tasked with agricultural labour than any other form of work. Those who were violent or disobedient, or who for whatever reason were considered a danger to society, might be sentenced to labor in the mines, where they suffered under inhumane conditions. Slave owners were allowed to return their slaves for their money back if they were found to be defective, or if the seller had concealed anything that would affect the slave's productivity. Slaves that were found to be sick or defective would often be sold for very little, if anything. Masters would occasionally manumit sick or elderly slaves as a way to save money if they would not fetch enough money from their sale because it was cheaper than feeding and housing a useless slave. Since slaves were legally property, they could be disposed of by their owners at any time.\nAll children born to female slaves were slaves. Slaves who had the education or skills to earn a living were often manumitted upon the death of their owner as a condition of his will. Slaves who conducted business for their masters were also permitted to earn and save money for themselves, and some might be able to buy their own freedom, while still others were granted their freedom by their owners, though this was rare.\nFreedmen\nFreedmen (liberti) were freed slaves who, once freed, became full Roman citizens, however they were not considered equal to other citizens because of their former status as slaves or their descent from former slaves, thus they joined the ranks of the lower-class plebeians. Only after a few generations would the descendants of former slaves be able to rise through the ranks of the classes (sometimes becoming equites or senators). The status of liberti developed throughout the Republic as their number increased. Through their military service, and through other endeavours such as craftsmanship and business ventures, freedmen often accumulated vast fortunes in the later Republic. Despite the fortunes of these many liberti, throughout ancient Rome the majority of freedmen were plebeians and worked as farmers or tradesmen.\nNon-Roman citizens\n, c. 100 BC, an Etrusco-Roman bronze sculpture depicting Aule Metele (Latin: Aulus Metellus), an Etruscan man wearing a Roman toga while engaged in rhetoric; the statue features an inscription in the Etruscan alphabet|alt=|331x331px]]\nLatin rights\nLatin rights () were the rights given to Latin allies and Latin colonies of Rome.\nOld Latin rights\nLatin allies were given the right to intermarry, conduct business, and enter into contracts with full Roman citizens, and the right to move from an allied Latin city to Rome (or vice versa). Children of full Roman citizens and Latin mothers could inherit the Roman property and citizenship of their fathers through the Latin League, before 338 BC. Those with Latin rights had a privileged status above other Roman allies who were not full Roman citizens.\nLatin rights post-338 BC\nThe citizens of 5 Latin towns (Aricia, Lanuvium, Pedum, Nomentum, and Antium) were given full Roman citizenship in 338 BC, after the end of the Latin War. The rest of the Latin allies were given limited Roman citizenship, receiving the privileges of the Old Latin Rights, but not being granted the right to vote or obtain Roman property unless they relocated permanently to the city of Rome.\nPeregrini\nFree-born foreign subjects were known as peregrini.'' Peregrini operated under the laws that were in effect in their provinces when they were captured by Rome.  Augustus (27 B.C. – 14 AD) instituted laws that allowed peregrini to become citizens through serving in the Roman army or on a city council. Citizen rights were inherited, so children of peregrini who had become citizens were also citizens upon birth. Distinctions between Roman citizens and peregrini continued until 212 AD, when Caracalla (211 AD – 217 AD) extended full Roman citizenship to all free-born men in the empire with the declaration of the Antonine Constitution.\nReferences\nExternal links\n*"
    }
  ]
}