{
  "content": [
    {
      "type": "text",
      "text": "# Society of the kingdom of Mysore__disambig_1\n\nThe kingdom of Mysore (; 1399 - 1947 CE) was a kingdom in southern India founded in 1399 by Yaduraya in the region of the modern city of Mysore, the Karnataka state. The Wodeyar dynasty ruled the Southern Karnataka region until Indian independence in 1947, when the kingdom was merged with the Union of India.\nSociety\n]]\nThe society in the kingdom followed age old and deeply established norms of social interaction between people in the centuries prior to the 18th century. In the 18th century, fundamental changes occurred due to the struggle between native and foreign powers. Wars between Hindu kingdoms and Sultanates continued, though the battles between native rulers (including Muslims) and the new foreigners, the British, took centre stage. Social reforms in the 19th century ushered in a more flexible society which granted people of lower castes access to schools, public office and courts. The spread of English education, the introduction of the printing press, and the criticism of the prevailing social system by Christian missionaries also had a positive influence. Literature became more secular, while the fine arts such as music, drama, dance and painting saw a renaissance. The rise of modern nationalism all over India had its impact on Mysore as well. This manifested itself in two ways - a longing to preserve all that was good in past tradition and an acceptance of western influence.\nFor centuries, primary education was imparted in Agraharas and Pathashalas where Sanskrit and the local vernacular was the medium of instruction. With the arrival of Islam, instruction to Muslims in the Arabic language was given in Madrasas. With the rise of British power, the English education gained prominence. These changes were orchestrated by Lord Elphinstone, the governor of the Madras Presidency. He developed his own method which had considerable influence on the status of education in the presidency. His plan became the constitution of the central collegiate institution or University Board, which gained fruition in 1841. Accordingly, a high school department of the university was established. For imparting education in the interior regions, schools were raised in principal towns which eventually were elevated to college level, with each college becoming central to many Zilla schools (local schools). The language of instruction in these schools was English. The earliest English medium schools appeared in 1833 in Mysore and spread across the region. In 1858, the department of education was founded in Mysore and it is estimated that by 1881, there may have been 2087 English medium schools in the Mysore kingdom. Higher education became available with the formation of Bangalore Central College (1870) and Maharajas college in Mysore (1879). The Maharanis college in Mysore (1901) and the St. Agnes college in Mangalore (1921) served women. The Mysore University was founded in 1916.\nSocial reforms aimed at practices such as sati, untouchability and emancipation of the lower classes swept across India and had their positive influence on Mysore territory as well. Welfare organisations that were founded in Bangalore and Mangalore were the Brahmo Samaj (1866 and 1870), the Theosophical society (1886 and 1901) and the Arya Samaj (1894 and 1919). In 1894, the Mysore kingdom passed laws to abolish marriage of girls below the age of eight and in 1923 provided women the right to franchise. Re-marriage of widowed women and marriage of destitute women was encouraged by enlightened men and women of Mysore. There were uprisings against British authority in India and in the Mysore region. The first unsuccessful revolt, aided by the French, came in the Malnad region in early 1800 by a Maratha called Dhondiya Wagh who was eventually killed. This event was followed by a revolt of a Zamindar Virappa in Koppal (1819), the rebellion of brave queen Rani Chennamma of Kittur in 1824, by her trusted aide Sangolli Rayanna in 1829. In october 1831, the British took over the government of Mysore. They issued a proclamation severely warning the rebels against their continued operations. Then, while some insurgents surrendered and others carried on their defiant activities for some time more up to 1833. Raja Sarjappa Nayaka of the family of the old Tarikere Nayaka Chiefs, who tried to continue the fight, was captured about the same time in Kanara which had been annexed by the British. Then the Kodagu uprising in 1835 (after the British dethroned the local ruler Chikkaviraraja) and the Kanara uprising of 1837.\nThe era of printing heralded by the Christian missionaries resulted in the first Kannada book publication in 1817, followed by a Kannada Bible in 1820, an English-Kannada dictionary in 1824, a Kannada-English dictionary in 1832 and the first Kannada newspaper called Mangaluru Samachara in 1843 (later renamed Kannada Samachara). The Mysore Amba Vilas palace opened a press in 1840 followed by a government press in Bangalore (1842). Eighty six Kannada printing presses were operating by the end of 19th century. This popularised the publication of ancient Kannada classics such as Pampa Bharata by Adikavi Pampa in 1891, the Jaimini Bharata by Lakshmisa in 1848 and the Basavapurana in 1850. On the same lines as the English language historicals published by British and Indian historians recording the achievements of Karnataka Empires, Alur Venkata Rao published a consolidated Kannada version called Karnataka Gatha Vaibhava rekindling Kannada nationalism.\nModern Kannada stage was popularised by the Yakshagana, the founding of a stage in Chandrasala Totti in the Mysore palace and a drama troupe in 1881. Classical English and Sanskrit plays influenced Kannada stage and produced famous dramatists such as Shirahatti Venkoba Rao and Gubbi Veeranna. The public began to enjoy Carnatic music through its broadcast on public address systems set up in the palace grounds. Mysore paintings were inspired by the Bengal Renaissance paintings and produced such well-known artists as Sundarayya, Tanjavur Kondayya, Ala Singarayya, B.Venkatappa, the Raju brothers, Keshavayya and others. Female poets such as Cheluvambe (the queen of Krishnaraja Wodeyar I), Haridasa Helavanakatte Giriyamma, Sri Rangamma (1685) and Sanchi Honnamma (author of Hadibadeya Dharma) wrote classics in Kannada language. The devadasi system that had existed in India for centuries was abolished in 1909, though a unique form of temple dancing was lost.\nNotes\nReferences\n*\n*\n*"
    }
  ]
}