{
  "content": [
    {
      "type": "text",
      "text": "# Society of King Charles the Martyr\n\n|headquarters =United Kingdom\n|type         = Anglo-Catholic, Devotional\n|website      = [http://skcm.org/ skcm.org]\n}}\nThe Society of King Charles the Martyr is an Anglican devotional society dedicated to the cult of Saint Charles the Martyr, a title of Charles I of England (1600–1649).  It is a member of the Catholic Societies of the Church of England, an Anglo-Catholic umbrella group. It is also active in the Scottish Episcopal Church and North America, and has international members elsewhere.\nHistory\nAfter Charles I was executed in 1649, it was said that the Puritans had offered to spare his life if he would abolish episcopacy in the Church of England. On the basis that his refusal led to his death, high church supporters of episcopacy viewed his death as a martyrdom. After the 1660 Restoration of his son Charles II to the throne, observance of 30 January, the date of Charles I's execution, was added to the Church of England's liturgical calendar, with a special service in the Book of Common Prayer and special sermons preached.\nThe Anniversary Days Observance Act 1859 removed the service, along with those of Gunpowder Plot and the Restoration, as being of political rather than religious character. The liberal influence which led to the 1859 change also produced a Tractarian reaction, which developed into Anglo-Catholicism and encouraged a renewal of high church practices. The Society of King Charles the Martyr was founded in 1894 with the stated purpose of \"intercessory prayer for the defence of the Church of England against the attacks of her enemies.\" Since then, the objectives have extended to religious devotion in keeping with the traditions of Anglo-Catholicism.\nIn England\nToday, the society's stated objectives are the following:\n* Intercessory prayer for the Church of England and Churches in communion therewith.\n* Promotion of a wider and better observance of the feast day of St Charles, 30 January.\n* Work for the reinstatement of the Feast of St Charles in the calendar of The Prayer Book from which it was removed in 1859 without the due consent of the Church as expressed in Convocation; the Feast was restored to the calendar in the Alternative Service Book of 1980 and a new collect composed for Common Worship in 2000.\n* The propagation of the true knowledge about the life and times of St Charles, and winning general recognition of the great debt the Church of England owes to him for his faithfulness unto death in defence of the Church and her apostolic ministry.\n* The support of efforts to build and equip churches dedicated under the patronage of St Charles the Martyr (both at home and overseas).\nThe patrons of the society are Lord Nicholas Windsor and Arthur Middleton, a former canon of Durham.\nOutside England\nOutside England, the objectives vary slightly, especially in regard to the Feast of St Charles, which is widely observed by the church in some places and not in others.\nIn the United States and Canada, the society is independently constituted as the American Region. The society's activities in the United States can be traced back to 1895, within a year of the society's foundation in 1894 in London. The American Region is incorporated under the General Laws of the State of Maryland as a not-for-profit corporation, the \"Society of King Charles the Martyr, Inc.\", and is tax-exempt under Section 501(c)(3) of the IRS code, both effective as of 8 April 2008. The American Region is governed by a Board of Trustees, and holds a Solemn Mass of the Feast of St Charles Martyr on a Saturday close to January 30. In addition, the American Region confers an honour on some members through membership in the Order of Blessed William Laud.\nAs of 2017, the American Region has more than 400 members. Keith Ackerman serves as episcopal patron.\nA Catholic chapter of the society also exists within the Personal Ordinariate of the Chair of Saint Peter with the approval of Bishop Steven J. Lopes.\nSee also\n*Royal Martyr Church Union\n*Jacobitism\n*Ritualism\n*Anglo-Catholicism\nReferences\nExternal links\n* [http://www.skcm.org/ The Website of the Society of King Charles the Martyr in England]\n* [http://www.skcm-usa.org/ The Website of the American Region of the Society of King Charles the Martyr]"
    }
  ]
}