{
  "content": [
    {
      "type": "text",
      "text": "# Social class in 18th-century Spain\n\nThe social structure of Spain in the 18th century continued to be based upon nobility and peasantry. However, the period also saw the growth of a middle class, centred upon the growing bureaucracy associated with Bourbon rule, and upon a limited development of commerce and industry.\nNobles and lords\nIn Spain at this period there were a large number of nobles. Some of them were rich while others were poor workers. Although their number decreased during the second half of the century, they continued to be numerous, due in part to the large number of hidalgos in the north of Spain.  In Santander, an economic survey known as the Catastro of Ensenada showed that almost all the registered residents were nobles, despite being peasants or working as masons, blacksmiths and other trades (Lynch, p. 226). Elsewhere the number of nobles was lower and many owned substantial property and wealth, being distinguished by their wealth more than by ancient concepts of estate.\nIn Spain the distinction between the social classes diminished in the 18th century. The military justification of the nobles diminished with the appearance of a national army. The Bourbons opposed the political pretensions of the nobility, decreased its number, restricted its fiscal exemptions by indirect taxes, and decreed that work was compatible with noble status (Lynch, p. 226). The nobility was not an exclusive social class: those possessing sufficient money could enter it, irrespective of lineage. For the most part, however, possession of lands was what conferred social status and facilitated access to the local elite. Spain was divided between those who owned the land and those who worked on it, between those who lived on rents and those who performed social functions. In 1797 more than 65% of the active population were working in agriculture, compared to 22% in the service sector and 12% in the industrial sector (Lynch, p. 227). Those who ruled rural Spain were uppermost in a society of classes in which the most important people were the nobility and the clergy, who owned the best lands and in total were the owners of more than the half of the cultivated land. Under them, there were the peasants, artisans and the bourgeois. This stratification was present in all regions of Spain.\nSome nobles and monasteries wielded considerable power in their locality, administering justice, levying fees, collecting taxes, and imposing feudal rights and services, from which they obtained rents and products from the land and, in general,  dominated the lives of their vassals. A minority of the lords were enlightened leaders of their communities and invested in agriculture, industry and popular education, but in general there was insufficient productive investment, causing stagnation in both agriculture and industry.\nThe lavish expenditure of the nobles surprised foreign visitors. In their travels around the peninsula, the nobles with the highest position travelled with a retinue of five or six carriages: one for their personal use, others with many cooks and servants. Many nobles had thousands of servants. Although the nobility had lost a lot of power and importance as a social class, they retained their rental income, social position and influence as a class.\nThe bourgeoisie\nDuring the 18th century the high nobility and the clergy formed the highest class. In contrast, most of the low nobility started to lose money and influence. As hidalgos were losing influence relative to peasants, merchants and artisans, they gathered into a new social class, the bourgeoisie. The wish for escaping from the social class which they belonged to by becoming noblemen was understandable, as agriculture was a good way of investing money and did not necessarily compel them to abandon their profession.\nIn 1800, Spain was a society more complex than a century ago, with the emergence of a middle class between the nobles and the peasants (Lynch, p. 235). The development of the middle class was caused by the increase in the bureaucracy and the economy. The new groups, without the possibility of changing the social structure, could exert influence in politics and  commerce. But there was no direct causal connection between economic growth and the social changes (Lynch, p. 234). The bourgeoisie was a very powerful group. They were semi-official groups ruled by nobles and not by the industrial merchants.\nPeasantry\nThe century of the Enlightenment was a very bad time for peasants and workers. Of the two groups, the second enjoyed better conditions (Lynch, p. 235-6). The increase of population, the expansion of the service sector and the general economic development contributed to improved employment opportunities for the artisans and workers in cities. However, the rural classes continued to be preponderant in the national population. In the centre of Spain, peasants comprised 80% of the active population (Lynch, p. 236), and most of them were poor and malnourished. The standard of living of the common people continued being very low due to maldistribution of resources. Much of what they could earn was taken in rent, other payments to the landowners, and debt payments (Lynch, p. 5). The worst living conditions for peasants were found in Andalucía, which contained the highest proportion of landless rural labourers (jornaleros). Here, the labourers survived only by the work of women and children, by searching for discarded food, and with the aid of charity.\nReferences\n*"
    }
  ]
}