{
  "content": [
    {
      "type": "text",
      "text": "# Software Process simulation\n\nSoftware process simulation modelling: Like any simulation, software process simulation (SPS) is the numerical evaluation of a mathematical model that imitates the behavior of the software development process being modeled. SPS has the ability to model the dynamic nature of software development and handle the uncertainty and randomness inherent in it.\nUses of software process simulation\nFollowing main purposes have been proposed for SPS:\n* Support in operational project management (estimation, planning and control)\n* Support for strategic management\n* Tool for training and education for software project management and software development lifecycle (cf. and).\n* Process improvement and technology adoption\nHow to do software process simulation\nSoftware process simulation starts with identifying a question that we want to answer. The question could be, for example, related to assessment of an alternative, incorporating a new practice in the software development process. Introducing such changes in the actual development process will be expensive and if the consequences of change are not positive the implications can be dire for the organization. Thus, through the use of simulation we attempt to get an initial assessment of such changes on the model instead of an active development project.\nBased on this problem description an appropriate scope of the process is chosen. A simulation approach is chosen to model the development process. Such a model is then calibrated using empirical data and then used to conduct simulation based investigations. A detailed description of each step in general can be found in Balci's work, and in particular for software process simulation a comprehensive overview can be found in Ali et al.\nIn a recent initiative, by ACM special interest group on software engineering ([https://www.sigsoft.org/index.html SIGSOFT]), a standard for assessing simulation-based scientific studies has been proposed.\nExamples of using software process simulation for practical issues in industrial settings\n* Process assessment: Enabling dynamic analysis in value stream mapping in industrial settings\n* Software Testing: Deciding when to automate software testing\nKey venues\nSoftware process simulation has been an active research area for many decades some of the key venues include the International Conference on Software and Systems Process and its predecessor Workshop on Software Process Simulation Modeling (ProSim) from 1998-2004.\nReferences"
    }
  ]
}