{
  "content": [
    {
      "type": "text",
      "text": "# Software requirements specification__disambig_1\n\nA software requirements specification (SRS) is a description of a software system to be  developed. It is modeled after the business requirements specification (CONOPS). The software requirements specification lays out functional and non-functional requirements, and it may include a set of use cases that describe user interactions that the software must provide to the user for perfect interaction.\nSoftware requirements specifications establish the basis for an agreement between customers and contractors or suppliers on how the software product should function (in a market-driven project, these roles may be played by the marketing and development divisions). Software requirements specification is a rigorous assessment of requirements before the more specific system design stages, and its goal is to reduce later redesign. It should also provide a realistic basis for estimating product costs, risks, and schedules. Used appropriately, software  requirements specifications can help prevent software project failure.\nThe software requirements specification document lists sufficient and necessary requirements for the project development. To derive the requirements, the developer needs to have a clear and thorough understanding of the products under development. This is achieved through detailed and continuous communications with the project team and customer throughout the software development process.\nThe SRS may be one of a contract's deliverable data item descriptions or have other forms of organizationally-mandated content.\nTypically a SRS is written by a technical writer, a systems architect, or a software programmer.\nHistory\nSoftware requirement specifications are already used in software development processes as early as 1975.\nThe purpose and content of software requirement specifications was formalised in 1983 by the IEEE.  The standard was published in 1984 as IEEE-830-1984 and approved by ANSI. It was revised in 1993 and 1998, before being superseded by an international standard.  This standard aimed at providing criteria for a good SRS, and recommendations about its content. It recognised the benefits of prototyping for the requirement engineering.  It propose an example of structure and several variants.\nThe ISO/IEC/IEEE 29148 standard \"Systems and software engineering —Life cycle processes — Requirements engineering\" superseded IEEE 830 in 2011.  The current revision is from 2018.  This standard is broader as it covers also requirement quality criteria, requirement management processes, and business requirement specification (BRS), as well as stakeholder requirement specification (StRS).  It proposes a slightly changed example structure.\nStructure\nAn example organization of an SRS is as follows:\n#Purpose\n##Definitions\n##Background\n##System overview\n##References\n#Overall description\n##Product perspective\n###System Interfaces\n###User interfaces\n###Hardware interfaces\n###Software interfaces\n###Communication Interfaces\n###Memory constraints\n##Design constraints\n###Operations\n###Site adaptation requirements\n##Product functions\n##User characteristics\n##Constraints, assumptions and dependencies\n#Specific requirements\n##External interface requirements\n##Performance requirements\n##Logical database requirement\n##Software system attributes\n###Reliability\n###Availability\n###Security\n###Maintainability\n###Portability\n##Functional requirements\n###Functional partitioning\n###Functional description\n###Control description\n##Environment characteristics\n###Hardware\n###Peripherals\n###Users\n##Other\nIt would be recommended to address also verification approaches planned to qualify the software against the requirements, for example with a specific section with a structure that mirrors the section on specific requirements.\nRequirement quality\nRequirements should strictly be about what is needed, independently of the system design, and not how the software should do it. Individual requirements shall hence be necessary, appropriate, and unambiguous. A set of requirements shall moreover be complete, consistent, feasible, and comprehensible.\nFollowing the idea of code smells, the notion of requirements smell has been proposed to describe issues in requirements specification where the requirement is not necessarily wrong but could be problematic. Examples of requirements smells are subjective language, ambiguous adverbs and adjectives, superlatives and negative statements. Comparative phrases, non-verifiable terms or terms implying totality should also be avoided.\nSee also\n*System requirements specification\n*Concept of operations\n*Requirements engineering\n*Software Engineering Body of Knowledge (SWEBOK)\n*Design specification\n*Specification (technical standard)\n*Formal specification\n*Abstract type\nReferences\nExternal links\n*\n*\n*\n* (\"This standard replaces IEEE 830-1998, IEEE 1233-1998, IEEE 1362-1998 - [https://web.archive.org/web/20120721124049/http://standards.ieee.org/findstds/standard/29148-2011.html]\")\n*\n*\n*\n*\n*[https://simtechdev.com/blog/how-to-write-a-specification-to-save-costs/ How to Write a Software Requirement Specification to Save Costs?]"
    }
  ]
}