{
  "content": [
    {
      "type": "text",
      "text": "# Softwarp\n\nSoftwarp is a software technique to warp an image so that it can be projected on a curved screen. This can be done in real time by inserting the softwarp as a last step in the rendering cycle. The problem is to know how the image should be warped to look correct on the curved screen. There are several techniques to auto calibrate the warping by projecting a pattern and using cameras and/or sensors. The information from the sensors is sent to the software so that it can analyze the data and calculate the curvature of the projection screen.\nUsage\nThe softwarp can be used to project virtual views on curved walls and domes. These are usually used in vehicle simulators, for instance boat-, car- and airplane simulators. To make it possible to cover a dome with a 360 degree view you need to use several projectors. A problem with using several projectors on the same screen is that the edges between the projected images get about twice the amount of light. This is solved by using a technique called edge blending. With this technique a “filter” is inserted on the edge that fades the image from 100% light strength (luminance) to 0% (the lowest luminance depends on the contrast ratio of the projector).\nHistory\nThe first warping technologies used a hardware image processing unit to warp the image. This processing unit was inserted between the graphics card and the projector. The problem with this technique is that it depends on the type of signal and the quality of the signal from the graphics card to warp it correctly. The process unit also needs several lines of image information before it can start sending out the warped image. This adds a latency to the display system that could be a problem in simulators that need fast response time, for instance fighter jet simulators. Softwarping eliminates the latency.\nSee also\n* Warpalizer\nExternal links\n* [http://www2.imm.dtu.dk/pubdb/views/edoc_download.php/130/pdf/imm130.pdf Image Warping by Mikkel B. Stegmann]\n* [http://fly.elise-ng.net Fly Elise-ng]\n* [http://www.univisual.se Warpalizer, software using this technique]\n* [http://www.showlogix.com/ContentPage.aspx?id=108 SHOWLOGIX software that warps input from capture cards]\n* [http://www.cursive-simulation.com/warp/ Cursive-simulation.com: display manipulation for serious games] (link does not work)\n* [http://pixelwix.com/warp-and-blend-software/10-pixelwarp-evo-wide-screen-warper.html Pixelwarp Evo Wide Screen Warper]\n* [http://www.immersaview.com/products/warp ImmersaView Warp]"
    }
  ]
}