{
  "content": [
    {
      "type": "text",
      "text": "# Solar Century Holdings Ltd v Secretary of State for Energy and Climate Change\n\nSolar Century Holdings Ltd v SS for Energy and Climate Change [2016] [http://www.bailii.org/ew/cases/EWCA/Civ/2016/117.html EWCA Civ 117] is a UK enterprise law case, on electricity generation by solar power. It held that the Secretary of State could stop scheme supporting renewable electricity, without breaching legitimate expectations, misusing power, or unfairness in a judicial review claim.\nFacts\nSolar Century Ltd claimed the SS breached legitimate expectations, misused power, and acted unfairly by stopping the ‘renewables obligation’ for larger projects. Solar Century Ltd installed large solar photovoltaic systems (solar farms). It benefited from the renewables obligation scheme that started in 2002. In 2011, the renewables obligation was replaced with a ‘contracts for difference’ scheme. The government capped spending for energy and climate change. The Energy Act 2013, inserting Electricity Act 1989 ss 32LA-LB, gave the Secretary of State power to close the renewables obligation to new capacity. This was initially proposed for 31 March 2017 for solar PV capacity over 5MW. A government statement said it would be ‘maintaining support levels for ... existing investments’. The SS then decided to close it on 1 April 2015, with the Renewables Obligation Closure (Amendment) Order 2015, saying takeup was higher than expected and its cap would be exceeded. It had a grace period to protect people who could demonstrate a significant financial commitment to projects at the consultation date. Solar Century argued they had a legitimate expectation from clear representations by government that the scheme would be open until 2017, the 2015 Order was ultra vires the Electricity Act 1989 ss 32LA-LB, and it was unfair to specify a date in the past as one for identifying a significant financial commitment.\nThe government's decision, to be put into the Renewables Obligation Closure (Amendment) Order 2015, and the subject of the challenge was extracted by Floyd LJ:\nJudgment\nFloyd LJ held that the government could change its policy where there were rational grounds, unless it amounted to abuse of power. No legitimate expectations were created that the date might not change. The Electricity Act 1989 section 32LA was wide enough to allow the SS to put forward the closure of the renewables obligation scheme. The grace period was not unfair, because if it were lawful to close the whole scheme in 2015 it was hard to see how giving some exceptions would be a bad thing.\nTomlinson LJ and Treacy LJ agreed.\nSee also\n*United Kingdom enterprise law\n*Solar power in the United Kingdom\nNotes\nReferences\n*"
    }
  ]
}