{
  "content": [
    {
      "type": "text",
      "text": "# Solid State Warrior\n\n| length     =\n| label      = Weedshare\n| producer   = Roger Joseph Manning Jr.\n| prev_title = Logan's Sanctuary\n| prev_year  = 2000\n| next_title = Catnip Dynamite\n| next_year  = 2008\n| misc       =\n}}\nSolid State Warrior is the debut solo record by American musician Roger Joseph Manning Jr., released on March 5, 2005 through the (now defunct) Weedshare music distribution service. In 2006, the album was rereleased internationally under the title The Land of Pure Imagination, with three different tracks.\nBackground and release\nBefore beginning his solo career, Manning was best known for his work with Jellyfish, Imperial Drag and the Moog Cookbook. He also did session work with acts including Blink-182, Fiona Apple, Jamiroquai, and Beck.\nSome of the material on the album was written several years earlier. \"Wish It Would Rain\" was written for the Beach Boys' Brian Wilson. In the early 1990s, Manning presented the song to Wilson, who came up with a bridge section. Manning rewrote Wilson's contribution as he felt it was \"just a bit average, even for him\".\nThe album was originally released on the now defunct peer-to-peer service Weedshare instead of receiving a traditional retail release. Neither the album or service were commercially successful. A year later, the record was released exclusively in Japan by Pony Canyon.\nLater in 2006, the album was re-released internationally under the title The Land of Pure Imagination on Cordless Recordings with three different tracks. \"What You Don't Know About The Girl\", \"Sleep Children\" and \"'Til We Meet Again\" were replaced with \"Pray for the Many\", \"In the Name of Romance\" and \"Appleby\".\nCritical reception\n}}\n|rev2 = Blender\n|rev2score =\n|rev3 = Blogcritics\n|rev3score = ?\n|rev4 = Power Of Pop\n|rev4Score = A+\n}}\nIn his review for AllMusic, Joseph McCombs called Solid State Warrior a \"solid\" sunshine pop album. While he describes the songs \"Sleep Children\" and \"'Til We Meet Again\" as \"forgettable lullaby ditties\", he says the song \"What You Don't Know About the Girl\" a \"bona fide candy-coated delight\". To summarize he notes that the album \"continues in the sunny power pop mold; it doesn't tip over into exceedingly twee or baroque territory, but rather emphasizes bright melodies and playful arrangements.\"\nPower of Pop gave The Land of Pure Imagination an A+, saying it \"deserves to be in the collection of every fan of great pop music...\" and suggests that it should \"be spoken of in the same hushed tones as that Jellyfish masterpiece, Spilt Milk\".\nTrack listing\nAll songs written and composed by Roger Joseph Manning Jr.\nSolid State Warrior\n#\"The Land Of Pure Imagination\" – 6:01\n#\"Too Late For Us Now\" – 3:23\n#\"Wish It Would Rain\" – 5:42\n#\"The Loser\" – 3:36\n#\"Sandman\" – 3:35\n#\"What You Don't Know About The Girl\" – 2:49\n#\"Dragonfly\" – 5:20\n#\"Creeple People\" – 5:28\n#\"Sleep Children\" – 2:47\n#\"You Were Right\" – 5:42\n#\"'Til We Meet Again\" – 3:44\nThe Land of Pure Imagination\n#\"The Land of Pure Imagination\" – 6:01\n#\"Too Late for Us Now\" – 3:23\n#\"Wish It Would Rain\" – 5:42\n#\"The Loser\" – 3:36\n#\"Sandman\" – 3:37\n#\"Pray for the Many\" – 3:02\n#\"Dragonfly\" – 5:19\n#\"Creeple People\" – 5:31\n#\"In the Name of Romance\" – 5:26\n#\"You Were Right\" – 5:43\n#\"Appleby\" – 5:30\nPersonnel\nMusicians\n*Roger Joseph Manning, Jr. – vocals, keyboards, guitar, bass, drums\n*Mike McGuffy – trumpet on \"Sleep Children\" and \"In the Name of Romance\"\nProduction\n*Produced by Roger Joseph Manning Jr.\n* Mixed and mastered by John Paterno\nReferences\nExternal links\n*[https://www.discogs.com/Roger-Joseph-Manning-Jr-Solid-State-Warrior/release/3514781 Solid State Warrior] at Discogs (list of releases)\n*[http://streamos.rhino.com/download/rhino/podcasts/rogermanning-extended.mp3 Roger Joseph Manning Jr. talks to Rhino.com about The Land of Pure Imagination]"
    }
  ]
}