{
  "content": [
    {
      "type": "text",
      "text": "# Solomon, King of Hungary\n\nSolomon, also Salomon (; 1053–1087) was King of Hungary from 1063. Being the elder son of Andrew I, he was crowned king in his father's lifetime in 1057 or 1058. However, he was forced to flee from Hungary after his uncle, Béla I, dethroned Andrew in 1060. Assisted by German troops, Solomon returned and was again crowned king in 1063. On this occasion he married Judith, sister of Henry IV, Holy Roman Emperor. In the following year he reached an agreement with his cousins, the three sons of Béla I. Géza, Ladislaus and Lampert acknowledged Solomon's rule, but in exchange received one-third of the kingdom as a separate duchy.\nIn the following years, Solomon and his cousins jointly fought against the Czechs, the Cumans and other enemies of the kingdom. Their relationship deteriorated in the early 1070s and Géza rebelled against him. Solomon could only maintain his rule in a small zone along the western frontiers of Hungary after his defeat in the Battle of Mogyoród on 14 March 1074. He officially abdicated in 1081, but was arrested for conspiring against Géza's brother and successor, Ladislaus.\nSolomon was set free during the canonization process of the first king of Hungary, Stephen I, in 1083. In an attempt to regain his crown, Solomon allied with the Pechenegs, but King Ladislaus defeated their invading troops. According to a nearly contemporaneous source, Solomon died on a plundering raid in the Byzantine Empire. Later legends say that he survived and died as a saintly hermit in Pula (Croatia).\nEarly life\nSolomon was a son of King Andrew I of Hungary and his wife, Anastasia of Kiev. His parents were married in about 1038. He was born in 1053 as his parents' second child and eldest son.\nHis father had him crowned king in 1057 or 1058. Solomon's coronation was a fundamental condition of his engagement to Judith, a sister of King Henry IV of Germany. Their engagement put an end to the more than ten-year-long period of armed conflicts between Hungary and the Holy Roman Empire. However, Solomon's coronation provoked his uncle, Béla, who had until that time held a strong claim to succeed his brother Andrew according to the traditional principle of seniority. Béla had, since around 1048, administered the so-called ducatus or duchy, which encompassed one-third of the kingdom.\ndepicted in the Illuminated Chronicle: the paralyzed King Andrew forces Duke Béla to choose between the crown and the sword.]]\nis crowned king (from the Illuminated Chronicle).]]\nAccording to the Hungarian Illuminated Chronicle, a 14th-century chronicle:\nAccording to the Illuminated Chronicle, in order to secure Solomon's succession, his father arranged a meeting with Duke Béla at the royal manor in Tiszavárkony. The king proposed that his brother choose between a crown and a sword (which were the symbols of royal and ducal power, respectively), but had previously commanded his men to murder the duke if Béla picked the crown.\nThe duke, whom a courtier had informed of the king's plan, chose the sword, then left Hungary after the meeting. He sought the assistance of Duke Boleslaus the Bold of Poland and returned with Polish reinforcements. Béla emerged the victor in the ensuing civil war, during which Solomon's father was mortally injured in a battle. Solomon and his mother fled to the Holy Roman Empire and settled in Melk in Austria.\nBéla was crowned king on 6 December 1060, but the young German king's advisors, who were staunch supporters of Solomon (the fiancé of their monarch's sister), refused to conclude a peace treaty with him. In the summer of 1063, the assembly of the German princes decided to invade Hungary in order to restore Solomon. Solomon's uncle died in an accident on 11 September, before the imperial army arrived. His three sonsGéza, Ladislaus and Lampertleft for Poland.\nReign\n, returns to Hungary (from the Illuminated Chronicle).]]\nAccompanied back to Hungary by German troops, Solomon entered Székesfehérvár without resistance. He was ceremoniously \"crowned king with the consent and acclamation of all Hungary\" in September 1063, according to the Illuminated Chronicle. The same source adds that the German monarch \"seated\" Solomon \"upon his father's throne\", but did not require him to take an oath of fealty. Solomon's marriage with Henry IV's sister, Judithwho was six years older than her future husbandalso took place on this occasion. Judith, along with her mother-in-law Anastasia, became one of her young husband's principal advisors.\nSolomon's three cousins - Géza and his brothers - returned after the German troops had been withdrawn from Hungary. They arrived with Polish reinforcements and Solomon sought refuge in the fortress of Moson at the western border of his kingdom. The Hungarian prelates began to mediate between them in order to avoid a new civil war.\nSolomon and his cousins eventually reached an agreement, which was signed in Győr on 20 January 1064. Géza and his brothers acknowledged Solomon as lawful king, and Solomon granted them their father's one-time ducatus. As a token of their reconciliation, Duke Géza put a crown on Solomon's head in the cathedral of Pécs on Easter Sunday. Their relationship remained tense; when the cathedral burned down during the following night, they initially accused each other of arson. The episode is described in the Hungarian Illuminated Chronicle as follows:\nThe king and his cousins closely cooperated in the period between 1064 and 1071. Both Solomon and Géza were, in 1065 or 1066, present at the consecration of the Benedictine Zselicszentjakab Abbey, established by Palatine Otto of the Győr clan, a partisan of the king. They invaded Bohemia together after the Czechs had plundered the region of Trencsén (present-day Trenčín, Slovakia) in 1067. During the following year, nomadic tribes broke into Transylvania and plundered the regions, but Solomon and his cousins routed them at Kerlés (present-day Chiraleş, Romania). The identification of the marauders is uncertain: the Annales Posonienses and Simon of Kéza write of Pechenegs, the 14th-century Hungarian chronicles refer to Cumans, and a Russian chronicle mentions the Cumans and the Vlachs.\nincites Solomon against Duke Géza who receives the Byzantine envoys in the background (from the Illuminated Chronicle).]]\nreceive gifts from the locals at Niš (from the Illuminated Chronicle).]]\nPecheneg troops pillaged Syrmia (now in Serbia) in 1071. As the king and the duke suspected that the soldiers of the Byzantine garrison at Belgrade incited the marauders against Hungary, they decided to attack the fortress. The Hungarian army crossed the river Sava, although the Byzantines \"blew sulphurous fires by means of machines\" against their boats. The Hungarians took Belgrade after a siege of three months. However, the Byzantine commander, Niketas, surrendered the fortress to Duke Géza instead of the king; he knew that Solomon \"was a hard man and that in all things he listened to the vile counsels of Count Vid, who was detestable in the eyes both of God and men\", according to the Illuminated Chronicle.\nDivision of the war-booty caused a new conflict between Solomon and his cousin, because the king granted only a quarter of the booty to the duke, who claimed its third part. Thereafter the duke negotiated with the Byzantine Emperor's envoys and set all the Byzantine captives free without the king's consent. The conflict was further sharpened by Count Vid; the Illuminated Chronicle narrates how the count incited the young monarch against his cousins by saying that as \"two sharp swords cannot be kept in the same scabbard\", so the king and the duke \"cannot reign together in the same kingdom\".\nThe Byzantines reoccupied Belgrade in the next year. Solomon decided to invade the Byzantine Empire and ordered his cousins to accompany him. Only Géza joined the king; his brother, Ladislaus, remained with half of their troops in the Nyírség. Solomon and Géza marched along the valley of the river Great Morava as far as Niš. Here the locals made them \"rich gifts of gold and silver and precious cloaks\" and Solomon seized the arm of Saint Procopius of Scythopolis. He donated the relic to the Orthodox monastery of Syrmium (present-day Sremska Mitrovica, Serbia).\nAfter their return from the campaign, both Solomon and Géza began to make preparations for their inevitable conflict and were seeking assistance from abroad. They concluded a truce, which was to last \"from the feast of St Martin until the feast of St George\", from 11 November 1073 until 24 April 1074. However, Solomon chose to attack his cousin as soon as the German troops sent by his brother-in-law arrived in Hungary. The royal army crossed the river Tisza and routed the troops of Géza, who had been abandoned by many of his nobles before the battle, at Kemej on 26 February 1074.\nA strong army soon arrived in Hungary, headed by Géza's brother-in-law, Duke Otto I of Olomouc. In the decisive battle, which was fought at Mogyoród on 14 March 1074, Solomon was defeated and forced to flee from the battlefield.\nAbdication\n.]]\nfor help (from the Illuminated Chronicle).]]\nAfter the battle of Mogyoród, Duke Géza's soldiers pursued Solomon and his men \"from dawn to dusk\", but they managed to take refuge in Moson, where his mother and wife had been staying. According to the Illuminated Chronicle, the queen mother blamed her son for the defeat, which filled Solomon with so much anger that he wanted to \"strike his mother in the face\". His wife held him back by catching his hand.\nThereafter, Solomon preserved only Moson and the nearby Pressburg (Bratislava, Slovakia). Other parts of the kingdom accepted the rule of Géza, who had been proclaimed king after his victory.\nSolomon sent his envoys to Henry IV and promised \"six of the strongest fortified cities in Hungary\" if his brother-in-law would help him to depose Géza. He was even ready to accept the German monarch's suzerainty.\nHenry IV invaded Hungary in August. He marched as far as Vác, but soon withdrew from Hungary without defeating Géza. Nevertheless, the German invasion strengthened Solomon's rule in the region of his two fortresses, where he continued to exercise all royal prerogatives, including coinage. His mother and wife left him and followed Henry IV to Germany. According to Berthold of Reichenau's Chronicle:\nSolomon attempted to convince Pope Gregory VII to support him against Géza. However, the pope condemned him for having accepted his kingdom \"as a fief from the king of the Germans\" and claimed suzerainty over Hungary. Thereafter it was Henry IV's support which enabled Solomon to resist Géza's all attempts at taking Moson and Pressburg. The German monarch even sent one of his main opponents, Bishop Burchard II of Halberstadt, into exile to Solomon in June 1076. Solomon's wife, Queen Judith, who was about to return to her husband, undertook to take the imprisoned bishop to Hungary, but the prelate managed to escape.\nGéza decided to start new negotiations with Solomon. However, he died on 25 April 1077 and his partisans proclaimed his brother, Ladislaus, king. The new king occupied Moson in 1079, thus Solomon could preserve only Pressburg. In 1080 or 1081, the two cousins concluded a treaty, according to which Solomon acknowledged Ladislaus as king in exchange for \"revenues sufficient to bear the expenses of a king\".\nLater life\nSolomon did not give up his ambitions even after his abdication. He was arrested for plotting against his cousin, then held in captivity in Visegrád. He was released \"on the occasion of the canonization of King St. Stephen and the blessed Emeric the confessor\" around 17 August 1083. According to Hartvik's Legend of King Saint Stephen, King Ladislaus ordered Solomon's release, because nobody could open the grave of the saintly king while Solomon was held in captivity.\nHaving been liberated, Solomon first visited his wife in Regensburg, \"although she was not grateful for this\", according to the nearly contemporaneous Bernold of St Blasien. From Germany, Solomon fled to the \"Cumans\"in fact Pechenegs, according to the historians Gyula Kristó and Pál Engelwho were dwelling in the regions east of the Carpathian Mountains and north of the Lower Danube. Solomon promised one of their chiefs, Kutesk, that \"he would give him the right of possession over the province of Transylvania and would take his daughter as wife\" if Kutesk and his people would help him to regain his throne. They invaded the regions along the Upper Tisza \"with a great multitude\" of the \"Cumans\", but King Ladislaus routed and forced them to withdraw from Hungary.\nAt the head of \"a large contingent of Dacians\" (Hungarians), Solomon joined a huge army of Cumans and Pechenegs who invaded the Byzantine Empire in 1087. The Byzantines routed the invaders in the mountains of Bulgaria. Solomon seems to have died fighting in the battlefield, because Bernold of St. Blasien narrates that he \"died courageously after an incredible slaughter of the enemy after he bravely undertook an enterprise against the King of the Greeks\" in 1087.\nReports of later sources prove that Solomon became the subject of popular legends. For instance, the Illuminated Chronicle writes that Solomon \"repented of his sins, so far as human understanding may reach\" after the battle, and passed the last years of his life \"in pilgrimage and prayer, in fastings and watchings, in labour and contrition\". According to these sources, Solomon died in Pula on the Istrian Peninsula where he was venerated as a saint. However, he was never officially canonized. His alleged tombstone is now in a local museum. Simon of Kéza wrote in his Gesta Hunnorum et Hungarorum:\nFamily\n|boxstyle_1=background-color: #fcc;\n|boxstyle_2=background-color: #fb9;\n|boxstyle_3=background-color: #ffc;\n|boxstyle_4=background-color: #bfc;\n|boxstyle_5=background-color: #9fe;\n|1= 1. Solomon of Hungary\n|2= 2. Andrew I of Hungary\n|3= 3. Anastasia of Kiev\n|4= 4. Vazul\n|5= 5. A lady of the Tátony clan\n|6= 6. Yaroslav I of Kiev\n|7= 7. Ingegerd of Sweden\n|8= 8. Michael\n|12= 12. Vladimir I of Kiev\n|13= 13. Rogneda of Polotsk\n|14= 14. Olof of Sweden\n|15=\n|16= 16. Taksony of Hungary\n|17= 17. A \"Cuman\" lady\n|24= 24. Sviatoslav I of Kiev\n|25= 25. Malusha\n|26= 26. Rogvolod of Polotsk\n|28= 28. Eric of Sweden\n}}\nSolomon's wife, Judith, who was born in 1048, was the third daughter of Henry III, Holy Roman Emperor and his second wife, Agnes de Poitou. Their wedding took place in Székesfehérvár in June 1063. The marriage remained childless. They first separated from each other around 1075. According to Bernold of St. Blasien, neither Solomon nor his wife had \"kept the marriage contract: on the contrary, they had not been afraid, in opposition to the apostle, to defraud each other.\" Having been informed of Solomon's death, Judith married Duke Władysław I Herman of Poland in 1088. In contrast with all contemporaneous sources, the late 13th-century Simon of Kéza writes that Judith \"spurned all suitors\" after her husband's death, although \"many princes in Germany sought her hand\".\nThe following family tree presents Solomon's ancestors and some of his relatives who are mentioned in the article.\nSee also\n*Kingdom of Hungary (1000–1526)\nReferences\nSources\nPrimary sources\n*Anna Comnena: The Alexiad (Translated by E. R. A. Sewter) (1969). Penguin Books. .\n*\"Bernold of St Blasien, Chronicle\" (2008). In Robinson, I. S. Eleventh-Century Germany: The Swabian Chronicles. Manchaster University Press. pp.&nbsp;245–337. .\n*\"Berthold of Reichenau, Chronicle: Second Version\" (2008). In Robinson, I. S. Eleventh-Century Germany: The Swabian Chronicles. Manchaster University Press. pp.&nbsp;108–244. .\n*\"Pope Gregory VII's letter to King Solomon of Hungary, claiming suzerainty over that kingdom\". In The Correspondence of Pope Gregory: Selected Letters from the Registrum (Translated with and Introduction and Notes by Ephraim Emerton). Columbia University Press. pp.&nbsp;48–49. .\n*Simon of Kéza: The Deeds of the Hungarians (Edited and translated by László Veszprémy and Frank Schaer with a study by Jenő Szűcs) (1999). CEU Press. .\n*The Hungarian Illuminated Chronicle: Chronica de Gestis Hungarorum (Edited by Dezső Dercsényi) (1970). Corvina, Taplinger Publishing. .\nSecondary sources\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n|-"
    }
  ]
}