{
  "content": [
    {
      "type": "text",
      "text": "# Somali Revolutionary Socialist Party\n\n| name             = Somali Revolutionary Socialist Party\n| lang1            = Somali\n| name_lang1       =\n| lang2            = Arabic\n| name_lang2       =\n| abbreviation     = SRSP (English) (Somali) (Italian)-->\n| logo             = Emblem of Somali Revolutionary Socialist Party.svg\n| leader1_title    = General Secretary\n| leader1_name     = Siad Barre\n| founder          = Abdulrahman Dhabdhable\n| foundation       = 26 June 1976()1 July 1976()\n| dissolution      = 26 January 1991()\n| headquarters     = Mogadishu\n| membership_year  =\n| position         = Far-left\n| membership       = 20,000\n| ideology         = CommunismMarxism–LeninismScientific socialismIslamic socialismSomali nationalism\n| flag             = Flag of the Somali Revolutionary Socialist Party.png\n| colours          =  |border=darkgray}} Blue and red\n| country          = Somalia\n}}\nThe Somali Revolutionary Socialist Party (SRSP, , XHKS, , ) was the ruling party of the Somali Democratic Republic from 1976 to 1991.\nHistory\nas part of Greater Somalia]]\nSRSP was created by the military regime of Siad Barre under Soviet guidance. A founding congress was held in June 1976. The congress elected a Central Committee, with Barre as the party general secretary. A five-member politburo, consisting of Barre, Lt. General Mohammad Ali Samatar (vice president), Major General Hussein Kulmiye Afrah (2nd vice president), Brig. Ahmad Sulaymaan Abdullah and Brig. Ismail Ali Abukor (who was later replaced by Brig. Ahmad Mahamuud Faarah) was constituted. Party cadres also included prominent socialists such as Abdi Hashi Abdullahi, Abdulrahman Aidiid, Mohamed F. Weyrah and (a well known socialist economist) and Abukar Sh. M Hussien.\nDuring a brief period, prior to the escalation of conflict with Ethiopia in 1977, the SRSP developed relations with foreign communist parties, such as the Communist Party of the Soviet Union (CPSU) and Socialist Unity Party of Germany (SED). CPSU initiated a programme of assistance for the SRSP party school. After relations with the Eastern Bloc were ruptured, a group including SRSP CC member broke away to form splinter groups. This was even further accelerated by the failed military coup of April 9, 1978, popularly known as \"Nova Aprile\". In 1981 dissident factions would emerge as the Democratic Front for Salvation of Somalia.\nWhen Barre's regime fell in 1991, the SRSP dissolved. In the same year the Somali National Front was organized by Barre loyalists.\nOrganisation\nThe SRSP was supposed to function as a political force transcending clan lines, but in reality there was little change in political practice. Power was concentrated to three clans. The party developed an intelligence branch, Baadhista xisbiga, which worked parallel to state intelligence and paramilitary groups. At most SRSP had around 20,000 members. The SRSP held its 3rd Congress in November 1986. A major reshuffle of the Central Committee took place.\nRole in Somali government\nThe Seventh Article of the 1979 constitution of the Somali Democratic Republic clarified the role of the SRSP:\nCongresses\n{| class=\"wikitable\"\n! No.\n! Date\n! Location\n|-\n| 1st\n| 27 June–3 July 1976\n| rowspan=4|Mogadishu\n|-\n| Extraordinary Congress\n| January 1979\n|-\n| 2nd\n| August 1982\n|-\n| 3rd\n| November 1986\n|}\nElectoral history\nPresidential elections\n{| class=\"wikitable\" style=\"text-align:center\"\n!Election\n!Party candidate\n!Votes\n!%\n!Result\n|-\n|1980\n|rowspan=2|Siad Barre\n|171\n|100%\n|Elected\n|-\n|1986\n|4,887,592\n|99.97%\n|Elected\n|}\nNote\nAfter the 1979 election, the People's Assembly elected Barre President on 26 January 1980.\nPeople's Assembly elections\n{| class=\"wikitable\" style=\"text-align:center\"\n!Election\n!Party leader\n!Votes\n!%\n!Seats\n!+/–\n!Position\n!Result\n|-\n|1979\n|rowspan=2|Siad Barre\n|3,982,532\n|99.95%\n|}}\n| 171\n| 1st\n|\n|-\n|1984\n|4,207,977\n|99.89%\n|}}\n|\n| 1st\n|\n|}\nSee also\n* List of Islamic political parties\nNotes\nReferences\nCitations\nBibliography\n* [http://www.britannica.com/EBchecked/topic/553871/Somali-Revolutionary-Socialist-Party Encyclopædia Britannica]"
    }
  ]
}