{
  "content": [
    {
      "type": "text",
      "text": "# Some Angry Angel: A Mid-Century Faerie Tale\n\n| media_type    = Print\n| pages         = 275\n| preceded_by   =\n| followed_by   =\n}}\nSome Angry Angel: A Mid-Century Faerie Tale was Richard Condon's third novel and gave impetus to the growing, though relatively short-lived \"Condon cult\" of that era. Published in 1960, it is written with all the panache, stylistic tricks, and mannerisms that characterize Condon's works.  It was not, however, one of his more typical political thrillers, such as its immediate predecessor, the far better-known The Manchurian Candidate.  While Condon is remembered today for a number of more action-oriented books such as Candidate, Winter Kills, and the Prizzi series, Some Angry Angel is largely forgotten.\nPlot\nThe story, which spans nearly 60 years, is that of a barely literate New York slum boy, Dan Tiamat, who first claws his way up through the newspaper ranks to become America's most famous and most powerful gossip columnist.  The role is clearly modeled on the 1930s and 1940s Walter Winchell, who fell from the heights because of his own character failings.  Tiamat does likewise, and spends the rest of his life as a semi-paralyzed, pseudonymous Lonelyhearts columnist named Miss Friendship.\nAlthough written with Condon's usual panache and mannerisms and laced with moments of black humor, it is also filled with moments of sudden shocking violence and death, generally apparently gratuitous and not invoked by character faults of the victims.\nAlthough Tiamat is the son of Irish immigrants with a purportedly Irish name, as a character tells him midway through the book, \"Tiamat was the Mesopotamian mother of the gods who was destroyed by the king of the gods, and from whose body the heavens and earth were created. Tiamat is the personification of chaos.\"  And, in this strange, bitter novel, Dan Tiamat does indeed leave a trail of death, unhappiness, and chaos in his wake as he makes his way through life.\nTitle\nThe title, as is the case in six of Condon's first seven books, is derived from the first line of a typical bit of Condonian doggerel that supposedly comes from a fictitious ''Keener's Manual mentioned in many of his earlier novels:\nThe verse is found in two places: as an epigraph on a blank page five pages after the title page and two pages before the beginning of the text; and, on page 275, as the closing words or coda of the book.\nReferences"
    }
  ]
}