{
  "content": [
    {
      "type": "text",
      "text": "# Someshvara (13th-century poet)\n\nSomeshvara (IAST: Someśvara) was a 13th-century hereditary priest and Sanskrit poet in the Chaulukya and Vaghela courts of present-day Gujarat, India. He was a close friend of the minister Vastupala, and there are several legendary prabandha anecdotes about the two men.\nEarly life\nSomeshvara, also known as Someshvara-deva, lived in the 13th century, but the exact year of his birth is not known. The last canto of his Surathotsava Mahakavya provides information about him and several of his ancestors.\nSomeshvara came from a Brahmin family of Vasishtha gotra and Gulecha kula. His ancestors lived at the town of Nagara (present-day Vadnagar). King Mularaja, the founder of the Chaulukya dynasty, appointed his ancestor Sola-sharman as a priest (purohita). Sola-sharman's descendants also served the Chaulukya kings as priests: Lalla-sharman (king Chamunda-raja), Munja (king Durlabha-raja), Soma, Ama-sharman (king Karna), Kumara (king Jayasimha Siddharaja), Sarva-deva, Amiga, and Kumara II (kings Ajayapala and Mularaja II). Someshvara was the son of Kumara II and his wife Lakshmi.\nAccording to Someshvara, his father Kumara was proficient in both scriptures (śāstra) and weapons (śastra). He credits Kumara with several achievements, including healing the battle wounds of king Ajayapala by prayers to Shiva, convincing king Mularaja II to provide tax breaks during a famine, serving as a counselor to Pratapa-malla of Rashtrakuta clan, defeating the Paramara king Vindhya as a military commander, donating the wealth obtained from the Paramara kingdom at a shraddha ceremony at Gaya, and defeating a mlechchha (foreign) army near Rajni-sara (or Rani-sara). Muni-chandra-suri's Amama-charita (1199 CE) suggests that Kumara also held the post of chief accountant (Nrpa-ksapataladhyaksha) for some time.\nSomeshvara had two brothers: Mahadeva the elder, and Vijaya, the younger.\nCareer\nSomeshvara was a hereditary priest of the Chaulukya king Bhima II. He wielded great influence at the Chaulukya court, as well as the court of their successors, the Vaghelas. He was a close friend of the minister Vastupala, who was also his patron. Someshvara met Vastupala and his brother Tejapala at the Vaghela capital Dhavalakka, when the two brothers halted their on way back from a pilgrimage to Shatrunjaya, and a friendship developed between the two men. All three served at the Chaulukya court, so it is possible that they had previously met at the Chaulukya capital Anahilavada. According to Someshvara's Kirti-kaumudi, he suggested the appointment of Vastupala and his brother Tejapala as ministers to the Vaghela rulers Lavana-prasada and Vira-dhavala.\nAccording to Someshvara's Surathotsava Mahakavya, once he highly entertained Bhima's court by composing a poem and a play within one and a half hour. Contemporary poets such as Harihara and Subhata appreciated his poetry. Someshvara and Vastupala composed verses praising each other. According to prabandha anecdotes (from Prabandha Kosha, Vastupala Charita and Vividha Tirtha Kalpa), king Visala-deva harassed Vastupala and Tejapala. Someshvara composed a verse shaming the king for his ingratitude.\nSomeshvara was well-versed with the Vedas, and followed the Shaivite and the Shakta faiths. Nevertheless, he also composed prashastis for Jain shrines; and composed work with Vaishnavite themes, such as a poem and a play praising Rama.\nAccording to a Puratana Prabandha Sangraha anecdote, after the death of Vastupala, Someshvara abandoned his priestly duties (Vyasa-vidya), and refused to recite the Puranas. King Visala-deva failed to convince him to resume his duties, and appointed another man named Ganapati Vyasa in his place. This legend may have some historical basis, as Ganapati Vyasa is known to be a historical person who served Visala-deva. Ganpati was the writer of the second 1272 CE Nanaka prashasti, in which he also mentions himself as the writer of Dharadhvamsa, a text commemorating Visala-deva's victory over Malava.\nSomeshvara lived at least until 1255 CE, when he composed the Vaidyanatha prashasti, but the exact year of his death is not known. M. Srinivasachariar estimates his flourit as 1179-1262 CE.\nWorks\nSomeshvara wrote several Sanskrit-language works: except the inscriptions, all of these are undated.\n* Surathotsava Mahākāvya, also known as Kavi-Prashasti-Varnana, based on the Devi Mahatmya of the Markandeya Purana. This work is written in the Gaudi style. It describes the misfortunes of and regaining of power by a mythical king named Suratha; according to scholar Bhogilal Sandesara, the work seems to be an allegory of the career of the Chaulukya king Bhima II, who temporarily lost power to a usurper named Jayanta-simha. The work was probably written to commemorate Bhima's regaining of power, sometime around 1227 CE.\n* Kīrti-kaumudī Mahākāvya, a panegyric glorifying the deeds of Vastupala, including his construction of temples at Shatrunjaya. It is written in Vaidarbhi style, and seems to follow the model of Kalidasa. According to an analysis by Kathavate, it was written after 1232 CE.\n* Ullāgharāghava Nāṭaka, a play based on the life of Rama. Someshvara wrote the play at the request of his son Bhalla-sharman. The play was performed at a temple in Dvaraka on the occasion of Prabodhini Ekadasi.\n* Karṇāmṛta-prapā, an anthology of didactic verses\n* Rāma-śataka, a 100-verse hymn about Rama. Ekanatha and an unknown author wrote commentaries on this poem, and it is known from several manuscripts (five of them at BORI), which suggests that it was quite popular.\n* 1231 CE (1287 VS) Abu prashasti inscription, which records the installation of an image of Neminatha in a temple\n* Metrical portions of the two Girnar inscriptions of Vastupala.\n* 1255 CE (1311 VS) Vaidyanatha prashasti inscription, which records king Visala-deva's reparations to the Vaidyanatha temple at Darbhavati\n* A 108-verse prashasti inscription, recording king Viradhavala's construction of Vira-narayana Prasada (likely a temple of Narayana) at Dhavalakka; now lost\nSeveral prabandha stories quote verses for which Vastupala rewarded Someshvara. These anecdotes are legendary, but may have some historical basis:\n* According to Raja-shekhara's Pabandha Kosha and Jina-harsha's Vastupala Charita, once Vastupala challenged Someshvara to complete a verse (samasya-purti) in the port town of Stambha-tirtha, and rewarded him with 16 imported horses for successfully completing the task.\n* According to Pabandha Kosha and Vastupala Charita, once a challenge to complete a seemingly irrelevant verse was posed in a literary circle, in the presence of Vastupala and Tejapala. Someshvara successfully completed the challenge, for which Vastupala gave him 16,000 drammas (coins).\n* According to Meru-tunga's Prabandha Chintamani and Ratna-mandira Gani's Upadesha Taramgini, once Someshvara visited the mansion of Vastupala, and refused to occupy a seat that he was offered. When asked for the reason, he replied with a verse, and Vastupala rewarded him with 9,000 drammas.\n* According to Prabandha Kosha and Upadesha Taramgini, once a large crowd of supplicants ran towards Vastupala when he worshipping the Jina during a samgha-yatra (pilgrimage) to Shatrunjaya. Someshvara spoke a verse to the crowd, for which Vastupala gifted him a large sum of money.\nThe prabandha texts attributed several other extempore verses to Someshvara. For example, Someshvara is said to have composed verses:\n* to celebrate Vastupala's return from a successful military campaign against Shamkha (Puratana Prabandha Sangraha).\n* in praise of Tejapala, when he returned after defeating Ghughula (Puratana Prabandha Sangraha and Vastupala Charita).\n* to describe Lalita-sara, a lake built by Vastupala at Palitana and named after his wife (Puratana Prabandha Sangraha, Vastupala Charita, Prabandha Chintamani, and Upadesha Taramgini).\n* in praise of Vastupala during the samgha-yatra to Shatrunjaya (Vastupala Charita and Upadesha Taramgini).\n* in praise of Viradhavala at a court held after a military victory (Vastupala Charita).\nThe Sukti-muktavali contains two verses from Someshvara's Vaidyanatha prashasti. The text also attributes four other verses to Someshvara-deva, who was most probably the same person. Vasanta Vilasa, a 15th-century Old Gujarati phagu quotes a verse from Someshvara's Kirti-kaumudi.\nSome authors have also attributed the authorship of Kavya-darsha, a commentary on Kavya-prakasha, to Someshvara. However, the author of Kavya-darsha was a different person with same name: he was the son of Devaka, and belonged to the Bharadvaja gotra.\nReferences\nBibliography\n*\n*\n*"
    }
  ]
}