{
  "content": [
    {
      "type": "text",
      "text": "# Someone's Knocking at the Door\n\n| writer =\n| starring =\n| music =\n| cinematography = Niklas Larsson\n| editing =\n| production_companies =\n| distributor = Vicious Circle Films\n| released =\n| runtime = 80 minutes\n| country = United States\n| language = English\n}}\n'Someone's Knocking at the Door' is a 2009 American comedy horror film co-written, directed and produced by Chad Ferrin. The film stars Noah Segan, Andrea Rueda, Ezra Buzzington, Jon Budinoff, Silvia Spross, Elina Madison, Ricardo Gray, Lew Temple, Vernon Wells, and Timothy Muskatell. The film follows a group of drug-addled medical school students, Justin, Meg, Sebastian, and Joe, who are targeted by John and Wilma Hopper, a married sexually sadistic serial killer couple from the 1970s who rape their victims to death.\nPlot\nRay Harris (Jordan Lawson), a med student, sits in his dorm, watching stag films and shooting what at first appears to be heroin but is later revealed to be an experimental drug called \"Taldon\". He hears a knock on his door and answers it. He is greeted with the sight of a fully nude woman, who makes sexual advances towards him. He reciprocates, only for the woman to metamorphose into a grotesque man with a freakishly large penis. The man attacks Ray, and it is strongly implied (and later confirmed) that the man rapes and kills him.\nRay's friends Meg, Joe and Annie learn of Ray's death. Another consort of Ray's, Sebastian, suspects Joe of killing Ray in a bizarre sex game, as Joe was the last person to be seen with Ray. Justin joins the four of them at Ray's funeral. Meanwhile, police are baffled to learn that Ray died after a phallus, fifteen inches in length and four inches in diameter, pulverized his colon. The five remaining students come under suspicion and are interrogated. However, no evidence implicating them in the crime exists and they are allowed to leave. A flashback shows the six friends using Taldon, the drug found at the scene of Ray's murder, and reading the case files of John and Wilma Hopper, a serial killer couple that was the subject of an intensive study at the school when it was still a mental hospital. They hypothesize that the Hoppers, long thought to be dead, have returned via astral projection.\nSebastian and Annie park at a secluded place in the woods to make out. Annie grows annoyed by Sebastian's aggressive sexual behavior and is dropped off. Shortly thereafter, she comes face to face with a demonic Wilma Hopper, who uses her genitalia to asphyxiate Annie. Back at the hospital, a detective reading information about the Hoppers is attacked by the reanimated John Hopper, who forces the detective to perform fellatio on him. Meg, after sharing a romantic evening with Justin, research Taldon. It is revealed that the drug is a hallucinogen that stimulates the central nervous system to dangerous proportions. Her research is cut short when she is attacked by the now-undead detective from earlier, who chases her down the halls of the hospital before being gunned down. John Hopper, taking the form of Annie, seduces and kills Sebastian by anally raping him to death.\nMeg, who had earlier passed out after her encounter with the possessed detective, lies on a hospital bed, recovering. She is joined in the same room by Justin. Justin, believing himself to be trapped in an artificial reality, guns down Joe and another detective before committing suicide. Everything that has happened is revealed to be Justin's dying hallucination; he and his friends had overdosed on Taldon the night they first read about the Hopper spree. Justin is at first believed to have died with his friends (with the exception of Meg, who had sworn off drugs) but miraculously survives.\nCast\nProduction\nThis was the first film that Ferrin directed based on someone else's screenplay.  Ferrin contacted Seagan for input on the script, and Segan eventually came on board as a producer.  He also took a role that had been created during rewrites.  The film was shot in eleven days.\nRelease\n''Someone's Knocking at the Door'' had its world premiere at the Imagine Film Festival in Amsterdam on April 16, 2009, and was subsequently screened at the Another Hole in the Head film festival on June 13, 2009. The film did not receive a wide release. In the United States, it played in Los Angeles on May 7, 2010, and in Las Vegas on July 24, 2010. The DVD was released in the US on May 25, 2010, and in the UK on March 7, 2011.\nReception\nBloody Disgusting rated it 2.5/5 stars and wrote that \"there is a meaning behind it all\", but \"the third act feels a little cheap and on-the-nose, at odds with the deceptively off-the-cuff invention that brings us to that point\".  Steve Barton of Dread Central rated it 4/5 stars and called it \"a love letter\" to transgressive 1970s grindhouse cinema.  Shock Till You Drop wrote, \"It was too coherent at the start to be able to claim the moniker of '70s drug movie.\"  Andrew Mack of Twitch Film called the ending \"too tidy, too after school special and preachy\".  Stephanie Scaife of Brutal as Hell wrote, \"It's not absolutely dreadful and it is pretty much no-holds-barred in its approach to the rather outlandish subject matter.\"  Tyler Foster of DVD Talk rated it 3/5 stars and wrote, \"It's not great, but it's an interesting and memorable misfire\".\nReferences\nExternal links\n*\n*"
    }
  ]
}