{
  "content": [
    {
      "type": "text",
      "text": "# Song Yi (Qin dynasty)__disambig_1\n\nSong Yi}}\nSong Yi (; died 207 BC) was a Chinese rebel who participated in the rebellions to overthrow the Qin dynasty between 209 and 207 BC. He served as an adviser to King Huai II, the nominal leader of the rebel group seeking to restore the Chu state of the Warring States period, and was appointed as a general. In 207 BC, prior to the Battle of Julu, he was accused of treason and killed by Xiang Yu, who took control of the Chu rebel group's armed forces from him.\nLife\nAround 209 BC, when rebellions broke out throughout China to overthrow the Qin dynasty, Song Yi joined the rebel group led by Xiang Liang, who was seeking to restore the Chu state of the Warring States period. Xiang Liang heeded his adviser Fan Zeng's suggestion to search for Xiong Xin, a descendant of the Chu royal family, and installed him on the throne as King Huai II. Although Xiang Liang and his followers paid nominal allegiance to King Huai II, the king was merely a figurehead as Xiang Liang had control over the rebel group's armed forces.\nAfter scoring some initial victories against Qin forces in battle, Xiang Liang started growing complacent despite Song Yi's warnings that his overconfidence and his men's lack of discipline could lead to defeat. At the time, the Lord of Gaoling (), an envoy from the Qi rebel group, was on his way to meet King Huai II when he encountered Song Yi, who told him that he foresaw Xiang Liang's downfall and that there was no need to rush to see the king. Song Yi turned out to be right; Xiang Liang was killed in battle at Dingtao against Qin forces led by Zhang Han.\nWhen the Lord of Gaoling met King Huai II later, he told the king that Song Yi \"may indeed be said to understand the art of warfare.\" The king then summoned Song Yi to discuss strategic matters with him, appointed him as a general, and put him in charge of the Chu rebel group's armed forces, which had been leaderless since Xiang Liang's death. Xiang Liang's nephew Xiang Yu and another adviser Fan Zeng were appointed as Song Yi's deputies. After that, King Huai II ordered Song Yi to lead their troops to assist the Zhao rebel group, which was under attack by Qin forces.\nIn 207 BC, Song Yi and the Chu forces reached Anyang (; southeast of present-day Cao County, Shandong), where they stopped and waited for 46 days without making further movement. As the Zhao capital Handan was under siege by Qin forces, Xiang Yu suggested they cross the Yellow River immediately to attack the Qin forces, but Song Yi ignored him, preferring to move after Zhao and Qin forces were exhausted from fighting each other. Song Yi then gave an order that any man who was \"fierce as a tiger, recalcitrant as a ram, greedy as a wolf, so headstrong that they would not submit to orders\" should be decapitated, hinting that he had the authority to execute Xiang Yu if the latter refused to obey him. After that, he sent his son Song Xiang () as an envoy to meet the Qi rebel group, and they attended a drinking party at Wuyan (; east of present-day Dongping County, Shandong).\nXiang Yu was so furious with Song Yi that he gave a speech to the other Chu officers, decrying Song Yi's extravagance and lacklustre attitude towards war. The next morning, when Xiang Yu was meeting Song Yi to deliver a routine morning report, he took the latter by surprise, killed him, and seized command of the Chu forces. Xiang Yu then posthumously accused Song Yi of committing treason, saying that the latter had been plotting with the Qi rebel group to take over the Chu rebel group, and that Song Yi's execution had been approved by King Huai II.\nReferences"
    }
  ]
}