{
  "content": [
    {
      "type": "text",
      "text": "# Sopot culture__disambig_1\n\n|typesite    = Sopot\n|majorsites  =\n|extra       =\n|precededby  = Starčevo culture, Vinča culture\n|followedby  =\n}}\nThe Sopot culture is a Neolithic archaeological culture that was first identified in eastern Slavonia in modern-day Croatia, and was since also found in several sites in Hungary. It was a continuation of the Starčevo culture and strongly influenced by the Vinča culture. Some of the archeological sites where artifacts of it were found include Samatovci, Vinkovci–Sopot, Otok, Privlaka, Vinkovci–Ervenica, Osijek, Bapska, Županja, Klokočevik. It spread into northern Bosnia from its original area to the west to northwestern Croatia and to the north to Hungarian Transdanubia, where it helped Lengyel culture start. The culture dates to around 5000 BC. Settlements were raised on the river banks (most noticeably on the banks of Bosut, around the area of the modern city of Vinkovci). Houses were square and made of wood using interlace technique, sometimes separated into multiple rooms. Artefacts include many weapons made of bone, flint, obsidian, and ironed volcanic rocks and some ceramic pottery of various sizes (biconical pots with two handles, conic bowls, pots, and s-shaped pots) decorated by carvings or light stabbings and painting.\nThe eponym site is Sopot, an archeological site near Vinkovci, which was dated to 5480–3790 BC. The culture was first identified in 1949 by Vladimir Milojčić, and first named after this site in 1968 by Stojan Dimitrijević, and has been generally referred to as such since 1971.\nGenetics\nIn a 2017 genetic study published in Nature, the remains of six individuals ascribed to the Sopot culture in Hungary were analyzed. Of the four samples of Y-DNA extracted, two belonged to G2a2b-L30 or various subclades of it, one belonged to I2-L596, and one belonged to J2. mtDNA extracted were various subclades of U8b1b, H, T2c1, K1a, and HV0a.\nStudies by Mathieson et al. 2018 and Patterson et al. 2022 analyzed two female samples from Croatia, mtDNA haplogroups found were N1a1a and T2b. The seven samples analyzed until then according to ADMIXTURE analysis had approximately 87-98% Early European Farmers, 2-12% Western Hunter-Gatherer, and 0-4% Western Steppe Herders-related ancestry.\nA 2021 study by Freilich and colleagues published in Nature tested the genomes of 19 individuals from the Sopot culture in Croatia. Out of the seven Y-DNA samples retrieved, three belonged to haplogroups G2a2, two to I2a2a-M223, one to J, and one to C1a2b-Z38888. The mtDNA haplogroups fell under various subclades of H, J2b1, K1a, K2b, N1a1a1, T2b, T2c1, T2f, U5b2, and U8b1.\nSee also\n* Old Europe (archaeology)\nReferences\nSources\n*\n*\n*\n*\n*\n*\n*"
    }
  ]
}