{
  "content": [
    {
      "type": "text",
      "text": "# Sorry for Party Rocking (song)__disambig_1\n\n| recorded   = 2011\n| studio     =\n| genre      =\n| length     = 3:23\n| label      = Interscope\n| writer     =\n| producer   = Redfoo\n| chronology = LMFAO\n| prev_title = Livin' My Love\n| prev_year  = 2012\n| next_title = Give Me All Your Luvin' (Party Rock Remix)\n| next_year  = 2012\n| misc       =\n}}\n}}\n\"Sorry for Party Rocking\" is a song by American duo LMFAO from their second studio album of the same name. It was released as the fourth and final single from the album on January 17, 2012, and was the group's last output before their indefinite hiatus in September 2012. The song was written and produced by Redfoo and Erin Beck.\nMusic video\nBackground\nIn an interview with the Irish channel TG4, Redfoo stated that they are working on the video for the song. Before this song was released as a single, Redfoo also said that \"Sorry for Party Rocking\" was a crowd favorite. The official video was uploaded to VEVO on February 21, 2012. The video was directed by Mickey Finnegan, and is the prequel to \"Party Rock Anthem\".\nSynopsis\nThe video begins when an old man named Rufus (played by SkyBlu in extensive makeup) is complaining to his wife, Agnes (played by Redfoo, also in makeup), that LMFAO and the Party Rock Crew are partying too much next door of their house, as Rufus and Agnes are getting ready for bed for the night. Rufus decides to go over next door to tell them to stop. Rufus scolds RedFoo and the Party Rock Crew, and when he asks them to explain about their behavior, RedFoo and the Party Rock Crew reply to Rufus with the title song and then continue dancing as Rufus immediately calls the police.\nPolice and other emergency services are seen driving through the city in cardboard cars, receive the call, and immediately head for the party. SkyBlu is also seen driving through the city with Chelsea Korka and the other women. The video returns to RedFoo and the Party Rock Crew still partying in the 'Party Rock' house. The police arrive at the house to arrest RedFoo, but also come in and start partying instead. Rufus then enters the Party Rock Crew's residence, but angrily leaves after seeing Agnes partying in the crowd. Agnes then performs the song's bridge. As the party continues, RedFoo gets drunk, is rushed to the hospital, and accidentally drops his iPhone. A man wearing a turtle-backpack finds RedFoo's iPhone, connects it with his headphones, and begins shuffling to \"Party Rock Anthem\". According to the opening caption of \"Party Rock Anthem\", it is revealed that RedFoo and SkyBlu slipped into comas due to excessive party rocking. The video ends with RedFoo and SkyBlu in the deserted hospital, where \"Party Rock Anthem\" will begin.\nTrack listing\n#\"Sorry for Party Rocking\" (album version) – 3:24\n#\"Sorry for Party Rocking\" (D'anconia Remix) – 3:31\n#\"Sorry for Party Rocking\" (Gigi Barocco Remix) – 4:39\n#\"Sorry for Party Rocking\" (Nash & Slicox Remix) – 5:04\n#\"Sorry for Party Rocking\" (R3hab Remix) – 5:12\n#\"Sorry for Party Rocking\" (Ricky Luna Remix) – 5:08\n#\"Sorry for Party Rocking\" (Wolfgang Gartner Remix) – 5:37\nCredits and personnel\n*Lead vocals&nbsp;– LMFAO\n*Producers&nbsp;– Redfoo\n*Lyrics&nbsp;– Stefan Kendal Gordy, Skyler Austen Gordy, Erin Beck\n*Label: Interscope\nCharts and certifications\nWeekly charts\n{| class=\"wikitable sortable\"\n|-\n! Chart (2012)\n! Peakposition\n|-\n|-\n|align=\"left\"|Australia Dance (ARIA)\n|style=\"text-align:center;\"|5\n|-\n|-\n|-\n|-\n|-\n|-\n|-\n|-\n|-\n|-\n| Honduras (Honduras Top 50)\n| style=\"text-align:center;\"|7\n|-\n|-\n|-\n|Luxembourg (Billboard)\n|style=\"text-align:center;\"|6\n|-\n|Netherlands (Mega Dance Top 30)\n|align=center|6\n|-\n|-\n|-\n|-\n|-\n|South Korea International Singles (Gaon)\n| style=\"text-align:center;\"| 19\n|-\n|-\n|-\n|-\n|-\n|-\n|-\n|-\n|-\n|}\nYear-end charts\n{| class=\"wikitable sortable\"\n|-\n!scope=\"col\"|Chart (2012)\n!scope=\"col\"|Position\n|-\n|Australia Dance (ARIA)\n| style=\"text-align:center;\"|25\n|-\n|Belgium (Ultratop 50 Flanders)\n| style=\"text-align:center;\"|82\n|-\n|Belgium Dance (Ultratop Flanders)\n| style=\"text-align:center;\"|48\n|-\n|Belgium (Ultratop 50 Wallonia)\n| style=\"text-align:center;\"|65\n|-\n|Belgium Dance (Ultratop Wallonia)\n| style=\"text-align:center;\"|26\n|-\n|Canada (Canadian Hot 100)\n| style=\"text-align:center;\"|91\n|-\n|France (SNEP)\n| style=\"text-align:center;\"|100\n|-\n|UK Singles (OCC)\n| style=\"text-align:center;\"|164\n|}\nCertifications\nReferences\nExternal links\n*[https://myspace.com/lmfao LMFAO] on Myspace\n*[https://www.youtube.com/watch?v=SkTt9k4Y-a8  Music video] on YouTube"
    }
  ]
}