{
  "content": [
    {
      "type": "text",
      "text": "# Sortes (ancient Rome)\n\nSortes (Latin singular: sors) were a frequent method of divination among the ancient Romans.  The method involved the drawing of lots (sortes) to obtain knowledge of future events: in many of the ancient Italian temples, the will of the gods was consulted in this way, as at Praeneste and Caere.\nThese sortes or lots were usually little tablets or counters made of wood or other materials and were commonly thrown into a sitella or urn, filled with water. The lots were sometimes thrown like dice.  The name of \"sortes\" was in fact given to anything used to determine chances, and was also applied to any verbal response of an oracle.\nVarious things were written upon the lots according to circumstances, as for instance the names of the persons using them. It seems to have been a favorite practice in later times to write the verses of illustrious poets upon little tablets and to draw them out of the urn like other lots; the verses which a person thus obtained being supposed to be applicable to him (see Sortes Homericae and Sortes Vergilianae, lots created from verses of Homer and Virgil).\nIn the Biblical account of the prophet Jonah, he is thrown into the sea and swallowed by the fish after the sailors on the ship cast lots to determine the guilty one who had brought about the storm. It was also the practice to consult the poets in the same way as Muslims do the Quran and Hafiz, and many Christians the Bible, namely, by opening the book at random and applying the first passage that struck the eye to a person's own immediate circumstances.  This practice was common among the early Christians, who substituted the Bible and the Psalter for Homer and Virgil. Many church councils repeatedly condemned these Sortes Sanctorum (sacred lots), as they were called.\nThe Sibylline Books were probably also consulted in this way.  Those who foretold future events by lots were called Sortilegi.\nThe sortes convivales were sealed tablets, which were sold at entertainments, and upon being opened or unsealed entitled the purchaser to things of very unequal value. They were, therefore, a kind of raffle.\nSee also\n*Sortes Astrampsychi\n*Cleromancy\n*Bibliomancy\n*Rhapsodomancy\nReferences"
    }
  ]
}