{
  "content": [
    {
      "type": "text",
      "text": "# Soundbreaking__disambig_1\n\n| starring     = George Martin, Dr. Dre\n| narrated     = Dermot Mulroney\n| country      = United States\n| num_episodes = 8\n| company      =\n| budget       =\n| network      = Public Broadcasting Service\n| first_aired  =\n| last_aired   =\n}}\nSoundbreaking: Stories from the Cutting Edge of Recorded Music is an eight-part documentary series exploring the art of sound recording and music production, charting a century's worth of innovation and experimentation in the creation of recorded music. The final project of Sir George Martin, legendary producer of the Beatles, the series chronicles the influence and evolution of recorded music on the 20th century, and its lasting impact on how we create and relate to music. The series combines rare archival footage from celebrated recording studios (often used as an instrument) and features an extensive, wide-ranging soundtrack illuminating the stories of many artists, producers, and audio engineering innovators.\nSoundbreaking includes more than 150 original interviews with artists: Paul McCartney, Ringo Starr, Joni Mitchell, Roger Waters, Jeff Beck, Roger Daltrey, Linda Perry, Barry Gibb, Elton John, Debbie Harry, Quincy Jones, B.B. King, Annie Lennox, Dave Stewart, Mark Knopfler, Tom Petty, Willie Nelson, Bonnie Raitt, Lindsey Buckingham, Rosanne Cash, Don Was, Steven Van Zandt, Sheila E, Questlove, Ben Harper, Billy Idol, Beck, Imogen Heap, Darryl McDaniels, RZA, Bon Iver, Nile Rodgers, Nigel Godrich, Q-Tip, Brian Eno, St. Vincent, Mark Ronson, Rick Rubin, Tony Visconti, and others.\nRelease\nFollowing previews at SXSW in March 2016, Soundbreaking was first broadcast in the US on PBS in November. Distributed internationally by FremantleMedia, Soundbreaking has aired in over 30 countries.\nEpisodes\n# The Art of Recording\n# Painting with Sound\n# The Human Instrument\n# Going Electric\n# Four on the Floor\n# The World is Yours\n# Sound and Vision\n# I Am My Music\nReception\nThe series is filled with \"revelatory moments\" according to The Hollywood Reporter, which later ranked Soundbreaking in the top five of its review of the best programs of 2016, the highest-ranked\ntelevision documentary on that list.  In September 2017 the publication recommended Soundbreaking as among the \"greatest music documentaries of all time.\"\nNominations\n* 60th Annual Grammy Awards — Best Music Film\n* 2018 Guild of Music Supervisors Awards — Best Music Supervision in a Television Limited Series or Movie\n* 2017 News & Documentary Emmy Award — Outstanding Music and Sound\n* 2016 Critics' Choice Documentary Award — Best Limited Documentary Series\n* 2017 RealScreen Award — Non-Fiction Arts & Culture\n* 2017 Webby Awards — Honoree in Social Content and Marketing: Music\nHome media\nSoundbreaking was released on DVD in Australia by Fremantle Media International and Roadshow Entertainment as a three-disc package. (Region 4 PAL, dual-layer, 16:9, Dolby sound).\nReferences\nExternal links\n*"
    }
  ]
}