{
  "content": [
    {
      "type": "text",
      "text": "# Southbrook, Queensland\n\n| pop                 = 626\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4363\n| area                = 65.8\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 9.8\n| dir1                = NE\n| location1           = Pittsworth\n| dist2               = 30.4\n| dir2                = SW\n| location2           = Toowoomba\n| dist3               = 162\n| dir3                = W\n| location3           = Brisbane\n| dist4               =\n| dir4                =\n| location4           =\n| lga                 = Toowoomba Region\n| stategov            = Condamine\n| fedgov              = Groom\n| elevation           = 543\n| maxtemp             =\n| mintemp             =\n| rainfall            =\n| near-n              = Biddeston\n| near-ne             = Athol\n| near-e              = Umbiran\n| near-se             = Cambooya\n| near-s              = Felton\n| near-sw             = Broxburn\n| near-w              = Linthorpe\n| near-nw             = Linthorpe\n}}\nSouthbrook is a rural town and locality in the Toowoomba Region, Queensland, Australia. In the , the locality of Southbrook had a population of 626 people.\nGeography\nSouthbrook is north-east of Pittsworth on the Darling Downs. The Gore Highway passes through the north of the town.\nHistory\nPreviously under a pastoral run of Eton Vale, the area was further developed in the 1880s when it was used for dairying and cropping.  The name has been attributed to be self-explanatory: a running brook or stream.\nSouthbrook later became a stop on the Millmerran railway line.\nEton Vale State School opened on 5 August 1878. In 1888, it was renamed Umbirom State School. In 1909, it was renamed Harelmar State School. It closed on 14 December 1962. It was at 29 Old School Lane ().\nSouthbrook Provisional School opened on 11 September 1882.   The first head teacher was George Henry Cooke, from 1 September 1882 to 10 August 1884.  On 15 February 1886, it became the Southbrook State School. Whilst celebrating their fifty years golden jubilee with 22 students, the school was closed in 1948. It was on Jimna Springs Road ().\nCirca 1902, the town had a store, a hotel, and two cheese factories.\nSt Mary’s Anglican Church was dedicated on 30 July 1904 by Venerable A.E. David, Archdeacon of Brisbane. It closed on 12 May 1996. Its closure was approved by Assistant Bishop Wood.\nHarrow State School opened on 24 June 1909. It closed in 1927. It was on the western corner of Umbiram Banchory Road and Cambooya Felton Road (approx ).\nElville State School opened on 31 October 1910 with an initial 35 students. The school was named after the site it was built on. Circa 1916, it was renamed Southbrook Central State School. In 2010, the school celebrated its centenary.\nBeauaraba Provisional School opened on 1 January 1919. On 1 October 1920, it became Beauaraba State School. It closed on 24 March 1940.\nSouthbrook was connected to the National Broadband Network in 2014.\nDemographics\nIn the , the locality of Southbrook had a population of 599 people.\nIn the , the locality of Southbrook had a population of 626 people.\nEducation\nSouthbrook Central State School is a government primary (Prep-6) school for boys and girls at 1 School Road (). In 2017, the school had an enrolment of 67 students with 5 teachers (4 full-time equivalent) and 8 non-teaching staff (3 full-time equivalent). In 2018, the school had an enrolment of 64 students with 6 teachers (4 full-time equivalent) and 8 non-teaching staff (3 full-time equivalent).\nThere are no secondary schools in Southbrook. The nearest government secondary school is Pittsworth State High School in Pittsworth to the south-west.\nReferences\nExternal links\n*\n* [https://gisservices.information.qld.gov.au/arcgis/rest/directories/historicalscans/cad_scans/cad-map-town-southbrook-1984.jpg Town map of Southbrook, 1984]"
    }
  ]
}