{
  "content": [
    {
      "type": "text",
      "text": "# South (Cardiff electoral ward)\n\nSouth was the name of an original electoral ward in the south of the town and (from 1905) city of Cardiff, Wales. It elected representatives to Cardiff Town Council, Cardiff County Borough Council and the post-1974 Cardiff City Council. The ward ceased to exist in 1983.\nDescription and background\nA \"South\" ward was created (one of four) in Cardiff at the end of the eighteenth century, to elect constables for the town. Two wards, \"North\" and \"South\", elected councillors to the first Cardiff Borough Council, on 31 December 1835. (the wards would have related to the town's two parishes, of St John's and St Mary's). Before the electoral reforms of the 20th century, councillors were elected by burgesses i.e. ratepaying property owners in the ward.\nThe South ward covered the southern part of Cardiff, including Butetown and Cardiff Docks. When the new ward boundaries for the County Borough Council were being agreed in 1890, it was proposed the ward was renamed \"Exchange\", after the Exchange Building in the heart of the business district. However, this was rejected and the name \"South\" retained. After 1890 the ward was bordered to the north by the Great Western Railway line (and the Central ward), to the east by the Bute West Dock (and the Adamsdown ward), to the west was the River Taff (and Grangetown).\nAfter World War II the ward was altered to include the southern part of Grangetown.\nCardiff City Council 1973-1983\nIn 1973 elections were held for the new Cardiff City Council district authority. The South ward elected three councillors to the authority, in 1973, 1976 and 1979, before ward boundary (and name) changes brought the South ward's existence to an end in 1983. The South ward elected three councillors, all Labour. In 1983, two of the South councillors, Bowen and Smith, were elected as councillors in the neighbouring Grangetown ward.\nCardiff South was the comparable ward to South Glamorgan County Council between 1973 and 1985. In 1985 Cardiff South's councillor, Peter Perkins, was elected to represent the new ward of The Marl.\nBoth the South and Cardiff South wards were represented by Labour Party councillors. Cllr Philip Dunleavy, who led Cardiff City Council during the 1970s, was a representative for both wards.\nSouth was replaced by the Butetown ward.\nCardiff County Borough Council 1889-1974\nIn July 1890, following the creation of Cardiff County Borough Council, South remained as one of the ten new electoral wards created in the county borough.\nA by-election, took place on 23 September 1889 in the South ward to replace Mr J. A. le Boulanger, who had died. The by-election was only five weeks before the first full council election of the new county borough. John Jenkins, president of Cardiff Trades Council was put up as a Liberal-Labour candidate, against the Conservative contender, James Tucker. The polling station was at the South Church Street Boards School in Butetown. Tucker won the election with 52% of the vote, the first Conservative representation in the ward since before 1886.\nBy 1890, the ward's three councillors were Mr Tucker and two Liberals, Mr F. J. Beavan and Mr T. Morel. At the 1890 Cardiff elections Cllr Beavan lost to the Conservative, Mr J. H. Cory (a ship-owner). Cory left immediately after the results without making a speech. The Cardiff Times described how Beavan, \"one of the most industrious servants of the ratepayers\", had secured the working class vote but has sustained a \"determined attack\" from the Conservatives and the non-resident voters of the ward (entitled to vote because of ownership of offices and businesses in the area).\nCardiff Town Council 1836-1889\n\"South\" was one of two Cardiff wards to the new elected council in 1836. Councillors took turns to 'retire' for re-election, on a three-yearly cycle.\nBy the 1870s there were four wards in the town (North, South, East and West). The November 1873 elections saw the two 'retiring' councillors, Mr Thompson and Mr North, not stand for re-election. They had been councillors for three years and were agents of Cardiff's major landowner, Lord Bute. They had been elected in \"the most  Municipal contest on record\", with ratepayers being given no alternative but to vote for their master's candidates. There was a feeling this tactic wouldn't work again. The subsequent election was won by Mr J. Winstone Snr and Mr Rees Jones.\nReferences"
    }
  ]
}