{
  "content": [
    {
      "type": "text",
      "text": "# South Pacific air ferry route in World War II\n\nThe South Pacific air ferry route was initially established in the 1920s to ferry United States Army Air Service aircraft to the Philippines. As the Japanese threat in the Far East increased in 1940, General Douglas MacArthur planned that in the event of war, the United States Army Air Corps would play a major role in defending the Philippines. The reinforcement by the Air Corps of forces in the Philippines, and later Allied forces in Australia, became the basis for developing the South Pacific air ferry route used during World War II.\nOverview\nAfter the Pearl Harbor Attack in December 1941, the US Air Transport Command pioneered and established scheduled air service to virtually all areas of the Pacific. The islands of the Japanese South Seas Mandate – formerly unfamiliar to the outside world and islands rarely visited before the war – became important air terminals and way stations along the ATC routes in the Pacific.\nAfter the United States' entry into the Pacific War, the only air service to the Orient was operated by Pan American Airways, while normal shipping lanes were cut off by the Japanese. This necessitated the establishment of new routes, which would skirt the area west of the Hawaiian Islands and north of Australia. In response to this need, ATC inaugurated a trans-Pacific cargo and passenger service through Canton Island, the Fiji Islands, and New Caledonia to Australia. As the war progressed with forward movements of the allied forces transport service was expanded to support the combat operations. New routes were established to include the Solomon Islands, New Guinea, the Gilbert and Marshall Islands, the Marianas, the Philippines, and the Ryukyu island chain. Eventually ATC routes operated into Occupied Japan and connected to the ATC India-China Wing at Kunming Airport, China.\nPre-World War II Pacific transport routes\nFerrying of aircraft to the Philippines from the United States began in 1916 when the First Company, 2d Aero Squadron, was activated at Fort William McKinley, Luzon, on 3 February 1916. This pre-World War I unit was a training school, operating Martin S Hydro seaplanes, first produced in the United States in 1915. These aircraft were sent to the Philippines by ship, with the planes loaded at the port of San Francisco. Stops were made in Hawaii, and then Manila where the aircraft were offloaded.\nPan American Airways inaugurated the first regularly scheduled air mail service from San Francisco to Hawaii and Manila on 22 November 1935. Passenger and cargo service was subsequently added. In April 1937, Pan American extended its service from Manila to Hong Kong, and to Singapore on 2 May 1941. On 12 July 1940, Trans-Pacific service by Pan American was extended from Hawaii, south to Auckland, New Zealand.\nThe first US Army mass flight from the United States mainland to the Pacific area was accomplished when crews of the 19th Bombardment Group (H) and the 38th Reconnaissance Squadron, both of the 1st Bombardment Wing, Fourth Air Force, ferried twenty-one B-17D Flying Fortress aircraft from Hamilton Field, California to Hickam Field Hawaii on 13 May 1941. The aircrews returned to Hamilton by ship on 28 May.\nA second flight by the 19th Bombardment Group, consisting of twenty-six B-17D aircraft moved from Hamilton Field, California, to Clark Field, Philippines, via Hickam Field, Midway Island, Wake Island, Port Moresby, New Guinea and Darwin, Northern Territory in the first permanent change of station air movement from the United States to the Philippines. The movement was completed on 6 November 1941.\n{| class=\"wikitable\"\n|-\n|+ Pre-World War II Pacific Transport Airfields\n|-\n!  Name\n! Location\n! Coordinates\n! Notes\n|- valign=\"top\"\n| Hamilton Field\n| California\n|\n| ATC moved 23rd Ferrying (later Transport) Group to Fairfield-Suisun Army Air Base on 29 May 1943. Placed under jurisdiction of 1503d AAFBU, West Coast Wing, Pacific Division, ATC. Ferrying of new aircraft to Hickam Field from aircraft manufacturing plants in Southern California utilized Long Beach Army Airfield and San Diego Municipal Airport was conducted under jurisdiction of 1572d AAFBU.\n|- valign=\"top\"\n| Hickam Field\n| Hawaii Territory\n|\n|  from Hamilton Field. 1500th AAFBU.  Headquarters, Pacific Division, Air Transport Command (ATC). Hickam was also the location of Air Technical Service Command (ATSC) Hawaiian Air Depot, performed required tropical modifications on all ATC ferried aircraft prior to deployment to Pacific Theater.\n|- valign=\"top\"\n| East Island Airfield\n| Midway Island\n|\n|  from Hickam Field. Use by AAC Ferrying Command ended in December 1941.\n|- valign=\"top\"\n| Pan American Airport\n| Wake Island\n|\n|  from Midway Island. Seized by Japanese Navy, December 1941. Under Japanese control until September 1945.\n|- valign=\"top\"\n| Pan American Airport\n| Guam\n|\n|  from Wake Island. Seized by Japanese Navy, December 1941. Not used by ATC after liberation of Guam in August 1944.\n|- valign=\"top\"\n| Clark Field\n| Philippines\n|\n|  from Guam. Seized by Japanese Army, January 1942. Not used by ATC after liberation of airfield in January 1945.\n|-\n|-\n|colspan=\"4\" |  Hamilton Field  Clark Field\n|-\n|}\nMacArthur believed, as many others did, that the Japanese would not launch any attacks until the end of the 1942 monsoon season. The ensuing months would provide enough time for the Air Corps to ferry additional B-17 Flying Fortresses from the United States to the Philippines. The bombers would fly the route until December 1941. However, this central route, which passed close to the Japanese League of Nations mandate which consisted of several groups of islands (modern-day Palau, Northern Mariana Islands, Federated States of Micronesia, and Marshall Islands), became more vulnerable; as tension grew between the United States and Japan.\nSouth Pacific Route (1942)\nTo provide a safer air ferry route, the Army Corps of Engineers Honolulu District created a new southern route to the Philippines in the fall of 1941 starting at Hickam Field, Hawaii Territory.\n{| class=\"wikitable\"\n|-\n|+ South Pacific Route #1\n|-\n!  Name\n!  Location\n! Coordinates\n! Notes\n|-\n! colspan=\"4\" | Originated: Hickam Field, Hawaii Territory\n|- valign=\"top\"\n| Christmas Island Airfield\n| Line Islands\n|\n|  from Hickam Field. Established as \"Station 8\" AAC Ferrying Command, later 1525th AAFBU, ATC. Ferrying/transport facility closed, December 1944. Airfield was used by USAF until the late 1950s as an Air Weather Service station under MATS.\n|- valign=\"top\"\n| Canton Island Airfield\n| Phoenix Islands\n|\n|  from Christmas Island. Established as \"Station 7\" AAC Ferrying Command, Later 1531st AAFBU, ATC.  Closed May 1945.   Later became part of USAF Western Test Range.\n|- valign=\"top\"\n| Nandi Air Base\n| Fiji Islands\n|\n|  from Canton Island.  Established as \"Station 15\" AAC Ferrying Command, later 1530th AAFBU, ATC.  Also operated ferrying route only also to Auckland Airport, New Zealand.\n|- valign=\"top\"\n| Plaine Des Gaiacs Airfield\n| New Caledonia\n|\n|  from Canton Island.  Detachment, 1551st AAFBU, ATC.  Occasional use by ATC, main base on New Caledonia being Tontouta.  Also used by Thirteenth Air Force, closed 1945.  Today abandoned and overgrown with vegetation, many small traces of the USAAF use remain.\n|- valign=\"top\"\n| Tontouta Airfield\n| New Caledonia\n|\n|  from Nadi Airfield. Established as \"Station 34\" AAC Ferrying Command, later Detachment, 1551st AAFBU, ATC. Air Technical Service Command maintenance and supply depot for South Pacific Area.   Also operated transport route only also to Auckland Airport, New Zealand.\n|- valign=\"top\"\n| RAAF Base Townsville\n| Queensland, Australia\n|\n|  from Tontouta.   ATC ferrying facilities moved to Archerfield Airport, Brisbane  in spring 1942.  Established as \"Station 25\" AAC Ferrying Command, later 1558th AAFBU, ATC remained as a transport support unit.\n|-\n| colspan=\"4\" |   Hickam Field  RAAF Base Townsville Hickam Field  Brisbane\n|- valign=\"top\"\n| RAAF Base Darwin\n| Northern Territory, Australia\n|\n|  from Townsville.   7th Bombardment Group was planned to stage B-17s though Darwin then proceed to Del Monte Field in early December 1941.   Deteriorating situation in the Philippines led the group to divert to Brisbane from Tontouta and did not engage in combat in the Philippines.  Detachment of ATC 1562d AAFBU operated transport facility for combat support in Papua New Guinea.\n|- valign=\"top\"\n| Del Monte Field\n| Mindanao, Philippines\n|\n|  from Darwin,  from Clark Field.   Was planned as a staging/dispersal field for B-17s.   Planned, but never was used as a ferrying airfield by ATC.   B-17 survivors of 19th Bombardment Group at Clark Field withdrew to Del Monte and carried out limited combat operations through the end of December 1941 then withdrew from the Philippines though Darwin to Batchelor Airfield, Queensland, Australia where group was reformed.    Del Monte supported limited fighter operations by remnants of 24th Pursuit Group until collapse of United States organized resistance in the Philippines, March 1942.\n|-\n|-\n|}\nThe Japanese, however, did not wait for the monsoon season to pass. After their air attack on Pearl Harbor, Japanese ground forces quickly occupied the Philippines and began advancing through the Southwest Pacific threatening the newly constructed southern air ferry route. To counter this threat, the engineers constructed an easterly alternate route farther removed from Japanese advances by flying south from Christmas Island Airfield .\n{| class=\"wikitable\"\n|-\n|+ South Pacific Route #2\n|-\n!  Name\n!  Location\n! Coordinates\n! Notes\n|-\n! colspan=\"4\" | Originated: Hickam Field, Hawaii Territory\n|- valign=\"top\"\n| Penrhyn Atoll Airfield\n| Cook Islands\n|\n|  from Hickam Field. Established as \"Station 16\" AAC Ferrying Command, later 1526th AAFBU, ATC.\n|- valign=\"top\"\n| Aitutaki Airfield\n| Cook Islands\n|\n|  from Penrhyn.  1528th AAFBU, ATC.\n|- valign=\"top\"\n| Tongatapu Airfield\n| Tonga Islands\n|\n|  from Aitutaki.\n|- valign=\"top\"\n| Norfolk Airfield\n| Norfolk Island\n|\n|  from Tongatapu.  ATC facilities operated by Royal New Zealand Air Force.\n|- valign=\"top\"\n| Sydney Airport\n| New South Wales, Australia\n|\n|  from Norfolk.  ATC facilities moved to Archerfield Airport, Brisbane in mid 1942.  Detachment of 1557th AAFBU, ATC remained to support transport operations.\n|-\n| colspan=\"4\" |   Hickam Field  Sydney Hickam Field  Brisbane\n|-\n|-\n|}\nCentral Pacific Route 1945\n{| class=\"wikitable\"\n|-\n|+ Central Pacific Route 1945\n|-\n!  Name\n!  Location\n! Coordinates\n! Notes\n|-\n! colspan=\"4\" | Originated: Hickam Field, Hawaii Territory\n|- valign=\"top\"\n| Naval Air Station Johnston Island\n| Johnston Atoll\n|\n|  from Hickam Field.\n|- valign=\"top\"\n| Kwajalein Atoll Airfield\n| Kwajalein Atoll, Marshall Islands\n|\n|  from Johnston Island.\n|- valign=\"top\"\n| Harmon Field\n| Guam, Marianas Islands\n|\n|  from Kwajalein.\n|- valign=\"top\"\n| Kadena Airfield\n| Okinawa\n|\n|  May 1945 link from Harmon Field, Guam\n|- valign=\"top\"\n| Tachikawa Airfield\n| Tokyo, Japan\n|\n|  Postwar link from Harmon Field, Guam, after September 1945\n|-\n| colspan=\"4\" | Hickam Field  Harmon Field Harmon Field  Nielson Field, Manila, Philippines.\n|-\n|}\nSouthwest Pacific Route 1945\n{| class=\"wikitable\"\n|-\n|+ Southwest Pacific Route 1945\n|-\n! Name\n! Location\n! Coordinates\n! Notes\n|-\n! colspan=\"4\" | Originated: Johnston Atoll Airfield\n|- valign=\"top\"\n| Hawkins Field\n| Tarawa, Gilbert Islands\n|\n|  from Johnston Atoll.\n|- valign=\"top\"\n| Momote Airfield\n| Manus, Admiralty Islands\n|\n|  from Tarawa.\n|- valign=\"top\"\n| Mokmer Airfield\n| Biak, Papua New Guinea\n|\n|  from Momote Airfield.   Also Transport only route to Archerfield Airport, Brisbane, Queensland, Australia.\n|- valign=\"top\"\n| Dulag Airfield\n| Leyte, Philippines\n|\n|  from Biak.\n|- valign=\"top\"\n| Nielson Field\n| Manila, Luzon, Philippines\n|\n|  from Leyte.\n|-\n|colspan=\"4\"|  Johnston Atoll Airfield  Nielson Field\n|- valign=\"top\"\n| Kunming Airport\n| China\n|\n|  from Manila. Postwar connected with India-China Division after September 1945.\n|-\n|}\nSoutheast Pacific Route 1945\n{| class=\"wikitable\"\n|-\n|+ Southeast Pacific Route 1945\n|-\n!  Name\n!  Location\n!  Coordinates\n! Notes\n|-\n! colspan=\"4\" | Originated: Mokmer Airfield, Biak, Papua New Guinea\n|- valign=\"top\"\n| Hollandia Airfield\n| Hollandia, Indonesia\n|\n|  from Biak.\n|- valign=\"top\"\n| Finschhafen Airfield\n| New Guinea\n|\n|  from Hollandia.\n|- valign=\"top\"\n| Henderson Field\n| Guadalcanal, Solomon Islands\n|\n|  from Finschhafen.\n|- valign=\"top\"\n| Luganville Airfield\n| Espiritu Santo, New Hebrides\n|\n|  from Henderson Field.\n|-\n| colspan=\"4\" |  to Tontouta Airfield, Nouméa, New Caledonia  Biak  New Caledonia\n|-\n|}\nSee also\n* North Atlantic air ferry route in World War II\n* Northwest Staging Route\n* West Coast Wing (Air Transport Command route to Alaska)\n* Crimson Route\n* United States Army Air Forces in the South Pacific Area\nReferences\n* Thompson, Erwin, (1981), Pacific Ocean Engineers: History of the U.S. Army Corps of Engineers in the Pacific, 1905–1980. U.S. Army Corps of Engineers, Pacific Ocean Division. ASIN: B0006EJBO6\n* Franzwa, Gregory (1978), Legacy, the Sverdrup story, Sverdrup Corporation.  ASIN: B001N1Y5BK\n* [http://www.ibiblio.org/hyperwar/AAF/VII/AAF-VII-1.html Army Air forces in World War II: The Air Transport Command, VII Services Around the World]"
    }
  ]
}