{
  "content": [
    {
      "type": "text",
      "text": "# Southwest Township, Warren County, Pennsylvania\n\n| area_total_sq_mi       = 34.04\n| area_land_sq_mi        = 34.04\n| area_water_sq_mi       = 0.00\n| area_urban_sq_mi       =\n| area_rural_sq_mi       =\n| area_metro_sq_mi       =\n| area_water_percent     =\n| area_note              =\n| elevation_footnotes     =\n| elevation_m             =\n| elevation_ft            =\n| elevation_point         =\n| elevation_max_footnotes =\n| elevation_max_m         =\n| elevation_max_ft        = 1,762\n| elevation_max_point     = northeast corner of township, about 0.5 miles west of Excelsior Corners, PA\n| elevation_max_rank      =\n| elevation_min_footnotes =\n| elevation_min_m         =\n| elevation_min_ft        = 1,195\n| elevation_min_point     = Pine Creek, where it flows out of township in southwest corner\n| elevation_min_rank      =\n| population_footnotes   =\n| population_total       = 425\n| population_as_of       = 2020\n| population_density_sq_mi = 14.78\n| population_demonym     =\n| population_note        =\n| timezone1              = EST\n| utc_offset1            = -4\n| timezone1_DST          = EDT\n| utc_offset1_DST        = -5\n| postal_code_type       = Postal code\n| postal_code            =\n| area_code_type         =\n| area_code              = 814\n| blank_name_sec1        =\n| blank_info_sec1        =\n| website                =\n|pop_est_as_of = 2023\n|pop_est_footnotes =\n|population_est = 414\n|blank_name = FIPS code\n|blank_info = 42-123-72600\n|area_total_km2 = 88.16\n|area_land_km2 = 88.16\n|area_water_km2 = 0.00\n|population_density_km2 = 5.71\n}}\nSouthwest Township is a township in Warren County, Pennsylvania, United States. The population was 425 at the 2020 census, down from 527 at the 2010 census. 561 at the 2000 census.\nGeography\nAccording to the United States Census Bureau, the township has a total area of , all land.\nNatural features\nSouthwest Township is located in the southwestern corner of Warren County in the Pittsburgh High Plateau. The township is drained by Pine Creek, a major tributary of Oil Creek, a south-flowing tributary of the Allegheny River, and Caldwell Creek, a major tributary of Pine Creek. Tributaries of Pine Creek in Southwest Township include Dunham Run, Golby Run, and Campbell Creek. Tributaries to Caldwell Creek within Southwest Township include Stony Hollow Run and West Branch Caldwell Creek. The lowest elevation in Southwest Township is , where Pine Creek flows west out of the township. The highest elevation is  at the northeastern part of the township, approximately 0.5 mile west of Excelsior Corners, Pennsylvania.\n}}\nAs of the census of 2000, there were 561 people, 220 households, and 159 families residing in the township. The population density was . There were 332 housing units at an average density of . The racial makeup of the township was 99.11% White, 0.36% African American, 0.18% Asian, and 0.36% from two or more races. Hispanic or Latino of any race were 0.18% of the population.\nThere were 220 households, out of which 30.5% had children under the age of 18 living with them, 59.1% were married couples living together, 6.8% had a female householder with no husband present, and 27.7% were non-families. 23.2% of all households were made up of individuals, and 6.8% had someone living alone who was 65 years of age or older. The average household size was 2.55 and the average family size was 2.96.\nIn the township the population was spread out, with 26.0% under the age of 18, 7.1% from 18 to 24, 28.0% from 25 to 44, 26.7% from 45 to 64, and 12.1% who were 65 years of age or older. The median age was 39 years. For every 100 females, there were 109.3 males. For every 100 females age 18 and over, there were 101.5 males.\nThe median income for a household in the township was $27,237, and the median income for a family was $29,063. Males had a median income of $27,054 versus $17,639 for females. The per capita income for the township was $15,281. About 13.6% of families and 18.7% of the population were below the poverty line, including 33.6% of those under age 18 and 6.8% of those age 65 or over.\nReferences"
    }
  ]
}