{
  "content": [
    {
      "type": "text",
      "text": "# South East Queensland\n\n| est                 = 1824\n| area                = 35248\n| lga                 = City of Brisbane, City of Gold Coast, Somerset Region, Sunshine Coast Region, City of Moreton Bay, Redland City, Logan City, Shire of Noosa, Scenic Rim Region, City of Ipswich, Lockyer Valley Region, Toowoomba Region\n| stategov            =\n| fedgov              =\n| logo                =\n| url                 =\n| near-n              = Wide Bay–Burnett\n| near-ne             = South Pacific Ocean\n| near-e              = South Pacific Ocean\n| near-se             = South Pacific Ocean\n| near-s              = New South Wales North Coast\n| near-sw             = Darling Downs\n| near-w              = Darling Downs\n| near-nw             = Darling Downs\n}}\nSouth East Queensland (SEQ) is a bio-geographical, metropolitan and statistical region of the state of Queensland in Australia, with a population of approximately 4.0 million people out of the state's population of 5.5 million. The area covered by South East Queensland varies, depending on the definition of the region, though it tends to include Queensland's three largest cities: the capital city Brisbane; the Gold Coast; and the Sunshine Coast. Its most common use is for political purposes, and covers  and incorporates 11 local government areas, extending  from Noosa in the north to the Gold Coast and New South Wales border in the south (some sources include Tweed Heads, New South Wales which is contiguous as a conurbation with Brisbane/Gold Coast), and  west to Toowoomba (which is simultaneously considered part of the Darling Downs region). It is the third largest urban area in Australia by population.\nSouth East Queensland was the first part of Queensland to be settled and explored by Europeans. Settlements initially arose in the Brisbane and Ipswich areas with activity by European immigrants spreading in all directions from there.  Various industries such as timber cutting and agriculture quickly developed at locations around the region from the 1840s onwards.  Transport links have been shaped by the range of terrain found in South East Queensland.\nThe economy of South East Queensland supports and relies on a wide diversity of agricultural manufacturing industries, commerce and tourism. The region has an integrated public transport system, Translink. The gross domestic product is $170 billion.\nDefinitions\nThe term South East Queensland has no equivalent political representation. The area covers many lower house seats at the federal and state levels. As Queensland has no upper house, there are no Legislative Council provinces or regions to bear the name either.\nSouth Eastern Queensland, as an interim Australian bioregion, comprises  and includes the Moreton Basin, South Burnett, and the Scenic Rim along with ten other biogeographic subregions. It extends as far north as Gladstone, and south into north-eastern New South Wales.\nHistory\nto Ipswich, 1865]]\nSouth East Queensland was home to around 20,000 Aboriginals prior to British occupation.  The local tribes of the area were the Yugarapul of the Central Brisbane area; the Yugambeh people whose traditional lands ranged from South of the Logan River, down to the Tweed River and west to the McPherson Ranges; the Quandamooka people whose traditional lands encompassed the Moreton Bay Islands to the mouth of the Brisbane River to Tingalpa and south to the Logan River; and the Gubbi Gubbi people whose traditional lands were known to exist north of the Pine River, to Burrum River in the north, and west to the Conondale Range.  According to history researchers the Aboriginal population declined to around 10,000 over the next 60 years.\nEarly explorers in the area including Matthew Flinders, Allan Cunningham, John Oxley and Patrick Logan. Around 1839, European settlers were able to move into the region. Logging was the first industry to develop.  The first railway built in Queensland linked Grandchester to Ipswich in 1865 along a narrow 1067 mm gauge.\nSouth East Queensland became the scene of war against the coalition of Aboriginal tribes from 1843 to 1855.\nMajor floods were experienced in 1893, 1974, 2011 and 2022. In 2005, the region suffered its worst drought in recorded history.  A rare tropical cyclone called Alfred threatened the region in March 2025.\nGeography\nQueensland's fifth highest peak, Mount Superbus, is located in the south of the region. The Cunningham Highway passes southwest to the Darling Downs via Cunninghams Gap. Several highways including the Bruce Highway, Warrego Highway and the Pacific Motorway link to the adjoining regions.\nwas opened in 2011]]\nThe region is mountainous. McPherson Range, Teviot Range, D'Aguilar Range, Little Liverpool Range, Blackall Range as well as the Springbrook Plateau and Tamborine Mountain Plateau.  Isolated volcanic peaks are found at Moogerah Peaks and the Glass House Mountains.  Along the coast are several large islands including Bribie Island, Moreton Island and North Stradbroke Island with many smaller islands in Moreton Bay.  Several major water supply and flood mitigation dams have been constructed here. The SEQ Water Grid, Western Corridor Recycled Water Scheme and Gold Coast Desalination Plant were built to counter the effects of drought in South East Queensland. Just over half the land is used for grazing.  South East Queensland is flood-prone.  The coastal dunes of South East Queensland represent one of the world’s oldest, largest and continuous systems of coastal dunes.\nLocal government areas\nSouth East Queensland includes 11 adjoining local government areas (LGAs) in their entirety, and one partially (urban extent of the Toowoomba Region).\n{| class=\"wikitable\"\n! class=\"col\" | Local governmentarea\n! class=\"col\" |Subcategory\n! class=\"col\" | Population (2018)\n! class=\"col\" | Area  km2\n! class=\"col\" | Density  per km2\n| rowspan=\"13\" |\n|-\n| City of Brisbane\n| rowspan=\"5\" |Greater Brisbane\n|align=\"right\"| 1,231,605\n|align=\"right\"| 1,343&nbsp;\n|align=\"right\"| 917\n|-\n| City of Moreton Bay\n|align=\"right\"| 459,585\n|align=\"right\"| 2,042&nbsp;\n|align=\"right\"| 225\n|-\n| City of Logan\n|align=\"right\"| 326,615\n|align=\"right\"| 958&nbsp;\n|align=\"right\"| 341\n|-\n| City of Ipswich\n|align=\"right\"| 213,638\n|align=\"right\"| 1,094&nbsp;\n|align=\"right\"| 195\n|-\n| Redland City\n|align=\"right\"| 156,863\n|align=\"right\"| 537&nbsp;\n|align=\"right\"| 292\n|-\n| Scenic Rim Region\n| rowspan=\"7\"\n|align=\"right\"| 42,583\n|align=\"right\"| 4,243&nbsp;\n|align=\"right\"| 10\n|-\n| Somerset Region\n|align=\"right\"| 25,887\n|align=\"right\"| 5,373&nbsp;\n|align=\"right\"| 5\n|-\n| Lockyer Valley Region\n|align=\"right\"| 41,011\n|align=\"right\"| 2,269&nbsp;\n|align=\"right\"| 18\n|-\n| City of Gold Coast\n|align=\"right\"| 606,774\n|align=\"right\"| 1,334&nbsp;\n|align=\"right\"| 455\n|-\n| Sunshine Coast Region\n|align=\"right\"| 319,922\n|align=\"right\"| 2,254&nbsp;\n|align=\"right\"| 142\n|-\n| Toowoomba Region (urban extent)\n|align=\"right\"| 170,356\n|align=\"right\"| 12,957&nbsp;\n|align=\"right\"| 13\n|-\n| Shire of Noosa\n|align=\"right\"| 55,369\n|align=\"right\"| 870&nbsp;\n|align=\"right\"| 63\n|}\nMajor cities\nThe region is a complex, regional hybrid linking the Brisbane metropolitan area with several surrounding cities.  South East Queensland includes the following cities:\n* Brisbane, Queensland's capital and largest city. Brisbane's metropolitan area includes the following local government areas:\n**City of Brisbane, the most populous local government area in the nation\n**City of Ipswich, home to Queensland's oldest provincial city and industrial centre, in the south-west\n**City of Logan, a largely residential and light industrial area in the south-east\n**City of Moreton Bay, a largely residential area to the north, which includes the Redcliffe Peninsula\n**Redland City, a residential and acreage area in the coastal south-east\n* Gold Coast, Queensland's premier tourist destination and surfing mecca to the south of Brisbane.\n* Sunshine Coast, another major tourist area to the north of Brisbane.\n* Toowoomba, nicknamed 'The Garden City', the most populous inland city in the country after the national capital, Canberra.\nNew developments are currently underway at Springfield, Ecco Ripley, Yarrabilba and Flagstone. Some geographers suggest several more master-planned communities will be needed to cater for the expected population growth rates.\nAirports\n* Brisbane Airport – The major international gateway to the region offering services direct to North America, Asia, Oceania and the Middle East.\n* Gold Coast Airport – The second major gateway is one of Australia's fastest growing airport offering services to New Zealand, and Indonesia.\n* Sunshine Coast Airport – An airport offering services to Sydney, Melbourne and Adelaide, with international flights to New Zealand during the peak summer season.\n* Toowoomba Wellcamp Airport – The first privately funded major airport in the country. Services the Toowoomba and surrounding Darling Downs region, with a view to becoming a major international freight hub.\n* Archerfield Airport – a general aviation airport located approximately  south of the Brisbane CBD.\n* Redcliffe Airport – a general aviation airport located on the Redcliffe Peninsula approximately  from the Brisbane CBD.\n* RAAF Base Amberley – the largest operational base of the air force in Australia located in south-western Ipswich approximately  from the Brisbane CBD.\nIndustry\n, 1907]]\n, 1935]]\nThe region exports a number of crop products including broccoli, onion, Chinese cabbage, sweet corn and celery.  A sizeable vegetable industry is established in the Lockyer Valley. Timber cutting, mining and a range of agricultural pursuits including dairying were once prominent in South East Queensland.  Tourism, in part due to Brisbane serving as major transport and export hub and destinations such as the Gold Coast and the availability of land for industry, has grown in recent decades together with specialised skills in professional services and manufacturing.\nCar dependency has a risen when the location of jobs in areas such as health and education are at distance from where the majority live.  Road transport in Brisbane relies on the car as the dominant form of transport.\nDemographics\nAs of 2014, the population of South East Queensland is estimated to be approximately 3.4 million, meaning that between one in six and one in seven Australians call the region home. The regional population is heavily urbanised and concentrated along the coast. The three largest population centres of Brisbane, Gold Coast and the Sunshine Coast account for 90 per cent of the region's population. In the year to June 2020, the City of Ipswich was the fastest growing local government area in Queensland.\nImmigration and population growth\nSouth East Queensland is one of the fastest-growing regions in Australia. Growth in the state is fuelled principally by migration from the southern states and overseas.  In 2010, South East Queensland's population grew by an average of about 1,200 new residents each week.\nBetween 1991 and 2016 the population rose from 1.9 million residents to 3.3 million. South East Queensland is expected to be home to 4.4 million by 2031.[https://web.archive.org/web/20080406003846/http://www.dip.qld.gov.au/seq South East Queensland – Department of Infrastructure and Planning] A 2010 report concluded that the region will reach 5.5 million people by 2051.\nThe population growth rate in SEQ was more than twice the rate of the rest of Queensland over the past two decades. More than 80% of population growth in the state between 1999-2019 occurred in SEQ.\nPopulation growth was putting pressure on schools and hospitals in the region in 2021.\nRegional planning\nSouth East Queensland's future development will be heavily based on the South East Queensland Regional Plan, released by the Queensland state government in 2005. The regional plan covers the period from 2009–2031 and focuses on slowing development along the coast, in order to prevent creating a 200 km city, and instead aim for growth in the west, in particular around Springfield and Beaudesert.  Infrastructure planning in South East Queensland is almost exclusively designed to facilitate trans-metropolitan travel and reduce traffic congestion.\nThe region's big picture planning document was updated for the third time in 2017 with the release of South East Queensland Regional Plan, Shaping SEQ. Shaping SEQ was reviewed in 2023 because of rapid population growth in South East Queensland.\nEnvironment\n, 2008]]\nPredominantly rural landscapes lie to the west of the urbanised coastal centres. The Lockyer Valley, a major agricultural area referred to as \"South East Queensland's Salad Bowl\", lies outside Brisbane. Many World Heritage listed rainforests are located along the region's southern border ranges, an area known as the Scenic Rim, such as Lamington National Park and Main Range National Park.\nWithin the region, the koala is listed as vulnerable.  In 2025, the region was estimated to have 16,000 koalas in the wild.  In South East Queensland the koala is threatened by habitat loss, disease such as chlamydiosis and increased mortality due to domestic animals and motor vehicles.  The Australian Koala Foundation says the animal is threatened by mining and land development. Numbers in Redland City have seen a dramatic decline in recent years. The state government launched the Koala Conservation Plan in 2006. The plan involved the rehabilitation of cleared areas, domestic dogs containment and koala signage. Another initiative was launched in 2010 to protect and rehabilitate koala habitats by tree planting and the construction of koala friendly fencing.\nAccording to the Intergovernmental Panel on Climate Change SEQ is one of Australia's regions most vulnerable to climate change.  After many years of water restrictions due to severe drought, the Government of Queensland lifted restrictions across the whole of South East Queensland on 1 January 2013.\nA fire ant outbreak is underway in South East Queensland. In 2022, 60 new suburbs around Brisbane, Moreton Bay, and the Scenic Rim were added to the biosecurity zone as part of a national fire ant eradication program.\nAttractions\nroller coaster at Dreamworld, 2013]]\nThe region features several major theme parks, including the largest in the country, Dreamworld at Coomera. WhiteWater World is next door and in nearby Oxenford is Warner Bros. Movie World. Sea World is located at Main Beach and opened in 1971. Lone Pine Koala Sanctuary was established in 1927 at Fig Tree Pocket.  David Fleay Wildlife Park is at Tallebudgera and Currumbin Wildlife Sanctuary was founded in 1947 at Currumbin.  Australia Zoo was established in 1970.\nQ1 at Surfers Paradise is the tallest building in Australia.  Brisbane Skytower, the sixth tallest building in Australia, is located in Brisbane.  A casino is located at Queen's Wharf and another called The Star Gold Coast is located at Broadbeach.\nThe Ekka was established in 1876. Riverfire began in 1998.\nSee also\n* Australian rules football in South East Queensland\n* Daylight Saving for South East Queensland\n* Railways in South East Queensland\n* Shopping Centres in South East Queensland\nReferences\nExternal links\n* South East Queensland Wikibook\n*[http://www.seqmayors.qld.gov.au South East Queensland Council of Mayors]\n*[https://dilgpprd.blob.core.windows.net/general/shapingseq.pdf Shaping SEQ: South East Queensland Regional Plan 2017], Queensland Government\n*[https://onesearch.slq.qld.gov.au/permalink/61SLQ_INST/tqqf2h/alma99184014785302061 Peter Fischmann photographs of Brisbane and South-East Queensland], State Library of Queensland"
    }
  ]
}