{
  "content": [
    {
      "type": "text",
      "text": "# South Western railway line, Queensland\n\non the Dirranbandi Mail bound for Toowoomba in November 1987]]\n, April 1907]]\nThe South Western line is a narrow-gauge railway line in the southern part of the state of Queensland, Australia. It junctions from the Southern line immediately south of Warwick station and proceeded westwards for a distance of 413&nbsp;km to the town of Dirranbandi. A western extension to Boomie in New South Wales, approved by the Queensland Parliament in 1914, was never constructed. The Thallon-to-Dirranbandi section was closed on 2 September 2010.\nIt services the small towns of Inglewood (junction of the now closed Texas branch) and Goondiwindi as well as the villages of Yelarbon and Thallon among others.\nHistory\nThe South Western line opened as far as Thane on 1 July 1904 and was completed to Dirranbandi on 21 May 1913. A further extension of the line west of Dirranbandi was approved by Parliament in 1914 but never constructed.\nBonathorne station, in Dirranbandi (), prior to 28 June 1917 known as Kundilam, is now abandoned.\nServices\nThe South Western Mail was introduced as a twice weekly service in 1910. Upon the opening of the line to Dirranbandi, the train departed Brisbane at 20:45, arrived at Warwick 04:00, Goondiwindi 10:00 and Dirranbandi 16:30. The return service departed 11.30, arrived Goondiwindi 17.35, Warwick 23.35 and Brisbane 07.10 the following morning.\nThe South Western line was the last railway in Australia to be serviced by mail trains. The last Dirranbandi Mail ran on 11 February 1993, and the line was subsequently taken out of regular use, with only the occasional rail tour operating on the line.  In 2010–11 the line was extensively damaged by flooding, and the line from Thallon to Dirranbandi was officially closed, as it was damaged beyond repair.  The rest of the line was rebuilt, and in recent years Watco began operating grain trains on the line from Thallon to the Port of Brisbane.  These operations have taken large amounts of trucks off the state’s highway network.\nCurrent line standards\nThe section from Warwick to Goodiwindi is laid with 30, 41 & 47&nbsp;kg/m rail, 25–50% steel sleepers, a maximum axle load of 15.75 tonnes and a line speed of 80&nbsp;km/h. The steepest grade on the section is 1 in 44 (~2.3%), and the minimum radius curve is 200m.\nThe next section to Thallon has similar rail, a 70&nbsp;km/h line speed to Toobeah, 60&nbsp;km/h beyond, a maximum grade of 1 in 50 (2%) and minimum 400m radius curves.\nPrior to closure, the last section to Dirranbandi had 20&nbsp;kg/m rail, a 10 tonne axle load and 40&nbsp;km/h line speed.\nConsistent with the rest of the Queensland regional railways, the line is narrow gauge ().\nGallery\nReferences\nExternal links\n*[http://www.qhatlas.com.au/map/extent-queensland-railway-network-1925/ 1925 map of the Queensland railway system]"
    }
  ]
}