{
  "content": [
    {
      "type": "text",
      "text": "# South Waratah Colliery\n\n| place = Kotara South\n| subdivision_type = State\n| state/province = New South Wales\n| country = Australia\n| owner = Waratah Coal Company\n| official website =\n| acquisition year =\n| stock_exchange =\n| stock_code =\n| products = Coal\n| financial year =\n| amount =\n| opening year = 1873\n| closing year = 1961\n}}\nThe South Waratah Colliery (later just Waratah Colliery) was a coal mine located at Charlestown, in New South Wales Australia.\nHistory\nThe Waratah Coal was formed in 1862 to work a tunnel colliery at Waratah, which was served by a privately owned railway line running to the Hunter River at a location that was to be known as Port Waratah. By 1873 the coal reserves at the tunnel mine at Waratah were becoming exhausted so the Waratah Coal Company purchased an area of land near what would be known as Charlestown. Sinking of a shaft on this land soon commenced, with this shaft being initially known as the Raspberry Gully Pit and latter known as ''Charles' Pit''. To serve this new colliery a colliery branch line, known as the Gully Line or Raspberry Gully Line was laid from the existing line to the Waratah tunnel mines near the crossing of the Scottish Australian Coal Mining Company's Lambton Colliery line, to the colliery. Construction of this new line commenced in January 1874 and an Act of Parliament was obtained to allow the construction of railway branch lines to the new shaft at Raspberry Gully and a new tunnel mine at Waratah.\nBy March 1874 the Raspberry Gully shaft had yet to strike the aimed for Borehole Seam of coal, so the directors of the Waratah Coal Company decided to sink a shaft closer to existing working collieries where the seam was known to exist and was being worked. This shaft was adjacent to the route of the railway line being constructed to the Raspberry Gully mine, and was known as ''Stuart's Pit. Work on this colliery stopped soon after the Borehole seam was struck as the coal seam was only 0.431m thick.\nWith the failure of Stuart's Pit all the plant from this mine was relocated to the Raspberry Gully mine. By July 1876 the railway line had reached the boundary of the mine. The Borehole seam had finally been struck at the Raspberry Gully mine but had also been proven to be too thin, with the seam being only 0.838m thick at the shafts. During sinking a 3.2m thick seam of coal had been struck at a depth of 81.3m, a decision was made to work this seam which as known as the Gully Seam'' instead.\nA town grew from the influx of miners from the mine to the south and was named after Charles Smith, the manager of the Waratah Coal Company in the 1870s, and became known as Charlestown.\nIn 1886 the main shaft was sunk to the Borehole seam and another shaft was also sunk to the Borehole seam at Flaggy Creek which was located approximately 1 mile to the east. The Borehole seam at Flaggy Creek was 10&nbsp;ft thick, however due to unsuitable ground conditions at the surface the Waratah Coal Company was unable to construct railway sidings & loading facilities at this site so a 2120 yard long tunnel was driven between the Flaggy Creek shaft & Charles' Pit. Soon after this Charles' Pit was officially opened with a special train being run to the colliery on 25 November 1887.\nDuring a strike at the mine in 1888, eight houses were built in Charlestown for strike breakers. The houses became known as Scab Row. During a confrontation with strike breakers, Alfred Edden, President of the Waratah Colliery Miners' Lodge was arrested. He later became Member of the Legislative Assembly (MLA) for the electoral district of Kahibah in 1894.\nDue to the high cost of driving the tunnel between Charles' Pit & the Flaggy Creek shaft due to the coal being too thin to work for two thirds of its length caused the Waratah Coal Company to have financial difficulties and in October 1893 the Waratah Coal Company was placed into liquidation. A new company, The Waratah Coal Company Limited, was formed to take over the operations of the original Waratah company. However, by 1897 this new company was taken over by the Caledonian Coal Company Limited.\nIn 1901 mining recommenced on the Victoria Tunnel seam which was located above the Borehole seam. Both the Borehole & Victoria Tunnel seams were then worked until 1906 when working of the Borehole seam ceased. The Borehole seam workings were abandoned in 1912 and the fan at the Flaggy Creek shaft was stopped as this shaft only served the Borehole seam workings.\nIn 1952 a drift was sunk to the Wavehill seam in a hill to the west of the existing shafts. This drift was known as Waratah Colliery No.2 drift and was a mechanised mine using Mavour & Coulson coal cutters, Joy 14BU loaders & Joy battery operated shuttle cars. The shuttle cars loaded the coal onto a conveyor belt which transported the coal to a new set of screens & loading point close to the original screens. No.2 drift was closed on 19 May 1961 after working out all economic coal reserves.\nIn 1956 a drift was sunk to the Victoria Tunnel seam to the north of the existing shafts. This drift was known as Waratah North Colliery (No.3 drift). Similar to No.2 drift this was a mechanised mine & was worked using similar equipment. The coal won from this drift was moved by a conveyor belt to a newly constructed screens & loading point. With the opening of Waratah North coal haulage from the shafts ceased & the shafts were then only used for ventilation & a second means of egress from the mine. Waratah North closed on 20 June 1960.\nIn 1959 a 'Acco Jig' coal preparation plant was constructed to wash the coal produced at Waratah Colliery. The coal from Nos.2 & 3 drifts was loaded into railway coal wagons at their screens & then ran to a dump hopper at the preparation plant where the coal was emptied & ran through the preparation plant. The coal was then reloaded into wagons for transport.\nIn 1959 a drift was sunk to South West of the existing shafts, this drift was known as Waratah Colliery No.4 Drift. This drift was driven to the Wave Hill seam above the existing Victoria Tunnel seam workings, and once it had passed the previously mined section of the Victoria Tunnel seam a drift was then sunk to the virgin area of the Victoria Tunnel seam. No.4 Drift was a mechanised mine similar to Nos.2 & 3 drifts & was worked using similar equipment. The coal was delivered directly by conveyor belt to the new coal preparation plant where it was loaded into wagons after washing.\nThe Colliery Today\nThe colliery was closed in 1961 and after standing idle and intact was finally demolished in 1969. There are some remnants of the colliery such as Stuart's Pit, which is now filled with water, heavily vegetated and in the grounds of St Pius X High School, Adamstown.\nLake Macquarie City Council has created a short heritage trail depicting a brief history of the former Waratah Colliery and rail corridor which carried coal from the mine to Port Waratah, with interpretative signage located along a multi-use pathway.\nReferences\n* Looking Up the Gully Line - A History of the Waratah Colliery 1993\n* City of Lake Macquarie Heritage Study\n*"
    }
  ]
}