{
  "content": [
    {
      "type": "text",
      "text": "# Southwestern Pennsylvania Heritage Preservation Commission\n\nThe Southwestern Pennsylvania Heritage Preservation Commission was a federal commission established within the United States Department of the Interior to oversee the America's Industrial Heritage Project. It was created in 1988 as a means for \"recognizing, preserving, promoting, and interpreting the cultural heritage of the 9-county region in southwestern Pennsylvania associated with the three basic industries of iron and steel, coal, and transportation. The Commission sunset on November 18, 2008.\nProjects\nAmerica's Industrial Heritage Project (AIHP)\nThe purpose of America's Industrial Heritage Project was twofold, according to \"Action Plan: America's Industrial Heritage Project\", an August 1987 publication of the Heritage Preservation Commission. \"First, there will be an examination of the significant contribution of the region's iron, steel, coal, and transportation industries, which helped fuel and move America's industrial growth and development and establish its standing among the nations of the world.\" Many of the region's cultural resources related not only to its heritage but to the present and future as well. \"Second, in addition to the historic sites, the project will use sites within Johnstown and Altoona as focal points for a nine-county tourism promotion program.\" Tourism development efforts were to take advantage of the region's scenic, natural, and recreational areas and will include these resources as integral to the planning process. Much of the project's background was based in a 1985 National Park Service (NPS) study of the region entitled Reconnaissance Survey of Western Pennsylvania Roads and Sites. The NPS study identified the cultural resources at Johnstown and Altoona as focal points for new tourism initiatives.\nEast Broad Top Railroad National Historic Landmark\nEarly in AIHP planning, Altoona was identified as the focal point around which the story of rail transportation could revolve. Others in the nine-county area included the Allegheny Portage Railroad National Historic Site, a unit of the Park Service; and Horseshoe Curve, a national historic landmark. A third was the privately owned East Broad Top Railroad and Coal Company, which related to the \"secondary theme of support industries, including refractory industries, timber, and iron ore production.\"\nThe AIHP declared the East Broad Top Railroad National Historic Landmark \"the best remaining example in the nation of a regional narrow-gauge railroad system\" and \"probably the only opportunity in the nation to tell a comprehensive railroad industry story.\" But the landmark was \"seriously threatened through deterioration, lack of operating capital, and legal threats to the right-of-way.\" Efforts to preserve the landmark were unavailing before the Commission closed in 2008.\nPublished works\nThe Commission worked with the National Park service on projects such as:\n[https://archive.org/details/studyofalternati00btop pdf]\n* '''America's Industrial Heritage Project (AIHP), 1987 [https://archive.org/details/americasindustri00nat3 Accessed] on September 18, 2021.\n* Special History Study: Pennsylvania Railroad Shops and Works in Altoona, Pennsylvania, 1989. [https://archive.org/details/specialhistoryst00nati Accessed] on October 8, 2017.\n* Revitalization Plan: Windber and Scalp Level: America's Industrial Heritage Project, Southwestern Pennsylvania. 1989 [https://archive.org/details/revitalizationpl00nati Accessed] on October 8, 2017.\n* Study of Alternatives: East Broad Top Railroad: America's Industrial Heritage Project, Southwestern Pennsylvania: draft, 1990 National Park Service [https://archive.org/details/studyofalternati00btop Accessed] on October 8, 2017.\n* Reconnaissance survey: Juniata River corridor : America's Industrial Heritage Project, southwestern Pennsylvania. National Park Service, ., United States. Dept. of the Interior. Southwestern Pennsylvania Heritage Preservation Commission., . (1991). [Denver, Colo.?]: The Service. [https://babel.hathitrust.org/cgi/pt?id=umn.31951d006215117;view=2up;seq=2 Accessed] on October 8, 2017.\n* America's Industrial Heritage: Southwestern Pennsylvania, 1991. [https://archive.org/details/americasindustri00nati Accessed] on October 8, 2017.\n* Huntingdon County, Pennsylvania: An Inventory of Historic Engineering and Industrial Sites''', Historic American Buildings Survey/Historic American Engineering Record, America's Industrial Heritage Project, National Park Service, U.S. Department of the Interior, Washington, D.C., 1991. [https://www.dot7.state.pa.us/CRGIS_Attachments/Survey/1991-H001-061.pdf Accessed] on October 8, 2017.\n* '''Recommendations of the Large Industrial Artifact Advisory Panel: America's Industrial Heritage Project, Pennsylvania [https://archive.org/details/recommendationso00nati Accessed] on October 8, 2017.\n* Comprehensive management plan for the Southwestern Pennsylvania Heritage Preservation Commission, 1992, Dept. of the Interior. Southwestern Pennsylvania Heritage Preservation Commission., National Park Service. Denver Service Center., . (1992). [Denver, Colo.]: U.S. Dept. of the Interior. [https://babel.hathitrust.org/cgi/pt?id=umn.31951d01010300t;view=2up;seq=2 Accessed] on October 8, 2017.\n* America's Industrial Heritage Project: seldom seen mine, Southwestern Pennsylvania Heritage Preservation Commission, (1993). [Washington, D.C.?]: U.S. Dept. of the Interior, Southwestern Pennsylvania Heritage Commission, National Park Service [https://babel.hathitrust.org/cgi/pt?id=umn.31951d010354096;view=2up;seq=2 Accessed] on October 8, 2017.\n* Special History Study: The Evolution of Transportation in Western Pennsylvania, 1994 [https://archive.org/details/specialhistoryst00penn Accessed] on October 8, 2017.\n* Study of Alternatives: Western Pennsylvania Region: Its Landscape, People, and Industry. 1994 [https://archive.org/details/studyofalternati00western Accessed] on October 8, 2017.\n* Concept Plan: Southwestern Pennsylvania Industrial Heritage Route'''. (Bedford, Blair, Cambria, Fayette, Fulton, Huntingdon, Indiana, Somerset, Westmoreland Counties), Pennsylvania. 1994. [https://archive.org/details/conceptplansouth00nati Accessed] on October 8, 2017.\nSee also\n*Westsylvania\nExternal links\n*[https://web.archive.org/web/20060205010454/https://westsylvania.org/ Westsylvania Heritage Corporation]\n*[https://web.archive.org/web/20150912021423/http://libs0500.library.iup.edu/depts/speccol/All%20Finding%20Aids/Finding%20aids/MG%20or%20Col/MG75SPHPC.pdf Finding Aid, Southwestern Pennsylvania Heritage Preservation Commission Manuscript Collection 75] at Indiana University of Pennsylvania.\n* [http://digital.library.pitt.edu/cgi-bin/f/findaid/findaid-idx?c=ascead;cc=ascead;type=simple;rgn=Entire%20Finding%20Aid;view=reslist;subview=standard;sort=occur;start=1;size=25;didno=US-PPiU-ais201004;focusrgn=C02;byte=41182914 The John P. Murtha Congressional Papers] on the America's Industrial Heritage Project at the University of Pittsburgh, Archives & Special Collections (A&SC).\n* [https://www.archives.gov/files/records-mgmt/rcs/schedules/departments/department-of-the-interior/rg-0048/n1-048-09-014_sf115.pdf Records of the Southwestern Pennsylvania Heritage Preservation Commission] at the National Archives.\n* [https://www.gao.gov/products/rced-93-134 Report], \"Scope and Cost of America's Industrial Heritage Project Need to be Defined.\" United States General Accounting Office. (1993).\n* National Park Service: Report to the chairman, Subcommittee on National Parks, Forests, and Public Lands, Committee on Natural Resources, House of Representatives. Washington, D.C.\n* [https://babel.hathitrust.org/cgi/pt?id=uiug.30112033997021;view=2up;seq=1] Coal Culture Timeline\nReferences"
    }
  ]
}