{
  "content": [
    {
      "type": "text",
      "text": "# Sovereign Islands, Queensland\n\n| lga      = City of Gold Coast\n| postcode = 4216\n| est      =\n| pop      =\n| pop_year =\n| pop_footnotes =\n| area     =\n| stategov = Broadwater\n| fedgov   = Fadden\n| dist1    = 16.3\n| dir1     = N\n| location1= Surfers Paradise\n| dist2    = 68.5\n| dir2     = SE\n| location2= Brisbane\n}}\nThe Sovereign Islands are an island group in the Southport Broadwater next to South Stradbroke Island within the suburb of Paradise Point in the City of Gold Coast,  Queensland, Australia. They were formed by a canal real estate development of the former Andys Island and Griffin Island.\nGeography\nSovereign Islands are six interconnected islands located toward the northern end of the Southport Broadwater. A bridge connects Paradise Point's island group to the mainland. The islands is protected from the Pacific Ocean by South Stradbroke Island which lies to the east.\nHistory\nCommencing in 1988, two low mangrove islands, Andys Island and Griffin Island, were redeveloped by Lewis Land Corporation to create a six-island group for a gated community of canal home sites with deepwater moorings and direct access to Moreton Bay.  of sand was pumped to create the islands and their navigable waterways. Andys Island and Griffin Island were thought to be named after local oystermen. The names of the former islands were replaced with the name Sovereign Islands in the official place names of Queensland on 16 February 1987, despite one objection to the loss of the historic names.\nSovereign Islands is one of the most expensive areas in the country with some homes in excess of 20 million dollars. Many houses do not slide under the two million dollar mark. The 2008 financial crisis impacted on real estate prices on the Sovereign Islands. In 2011 several properties sold well below prices recorded in previous years.\nAmenities\nSovereign Islands Is freehold property, however, the residents pay a gate levy fee of approximately $2600 per annum for security and parks. The roads are paved with brick, and street lights and palm trees line the expansive street scapes.\nReferences\nExternal links\n*  — shows Andy's Island and Griffin Island in the context of the proposed development"
    }
  ]
}