{
  "content": [
    {
      "type": "text",
      "text": "# Soviet prisoners of war in Finland\n\ncamp near Rukajärvi road in the Muyezersky District.]]\nSoviet prisoners of war in Finland during World War II were captured in two Soviet-Finnish conflicts of that period: the Winter War and the Continuation War. The Finns took about 5,700 POWs during the Winter War, and due to the short length of the war they survived relatively well. However, during the Continuation War the Finns took 64,000 POWs, of whom almost 30 percent died.\nWinter War\nsoldiers in Lemetti, Ladoga Karelia.]]\ninterrogates a camouflaged Soviet prisoner of war in the Pryazhinsky District.]]\nThe number of Soviet prisoners of war during the Winter War (1939–1940) was 5,700, of whom 135 died. Most of them were captured in Finnish pockets (motti) north of Lake Ladoga. The war lasted only 105 days and most of the deceased POWs were either seriously wounded or sick. Some of the POWs, at least 152 men, enlisted in the so-called Russian Liberation Army in Finland. They were not allowed to take part in combat. After the war, some members of the Liberation Army managed to escape to a third country.\nAfter the Winter War, the Soviet POWs were returned to the USSR in accordance with the Moscow Peace Treaty. They were transported under heavy guard by the NKVD to special camps as suspected traitors. Prisoners were interrogated by 50 person research teams. After lengthy investigations 414 were found to be \"active in traitorous activities while in captivity\" out of which 334 criminal cases were transferred to the Supreme Court of the Soviet Union, which sentenced 232 people to death. 450 prisoners were released, but most of them, 4,354 men, were sentenced to three to ten years in labour camps (gulag). This would lead to the later death of some of the prisoners due to harsh camp conditions.\nContinuation War\nThe number of Soviet prisoners of war during the Continuation War (1941–1944) was about 64,000. Most of them were captured in 1941 (56,000 persons). The first Soviet POWs were taken in June 1941 and were transferred to reserve prisons in Karvia, Köyliö, Huittinen and Pelso (a village in modern-day municipality of Vaala). Soon Finnish administration realized that the number of POWs was much greater than initially estimated, and established 32 new prison camps in 1941–1944. However, not all of them were used at the same time as POWs were used as a labour force in different projects around the country.\nThe Finns did not pay much attention to the living conditions of the Soviet POWs at the beginning of the war, as the war was expected to be of short duration. The quantity and quality of camp personnel was very low, as the more qualified men were at the front. It was not until the middle of 1942 that the quantity and quality of camp personnel was improved. There was a shortage of labour in Finland and authorities assigned POWs to forest and agricultural work, as well as the construction of fortification lines. Some Soviet officers cooperated with the Finnish authorities and were released from prison by the end of the war.\nFinnic prisoners who were captured on the fronts or transferred by Germany were separated from other Soviet POWs. At the end of 1942 volunteers could join the Finnish battalion Heimopataljoona 3, which consisted of Baltic Finns such as Karelians, Ingrian Finns, Votians and Veps.\nPrisoner exchange with Germany\nAbout 2,600–2,800 Soviet prisoners of war were handed over to the Germans in exchange for roughly 2,200 Finnic prisoners of war held by the Germans. In November 2003, the Simon Wiesenthal Center submitted an official request to Finnish President Tarja Halonen for a full-scale investigation by the Finnish authorities of the prisoner exchange. In the subsequent study by Professor Heikki Ylikangas it turned out that about 2,000 of the exchanged prisoners joined the Russian Liberation Army. The rest, mostly army and political officers, (among them a name-based estimate of 74 Jews), most likely perished in Nazi concentration camps.\nDeaths\nMost of the deaths among Soviet POWs, 16,136, occurred in the ten-month period from December 1941 to September 1942. Prisoners died due to bad camp conditions and the poor supply of food, shelter, clothing, and health care. About a thousand POWs, 5 percent of total fatalities, were shot, primarily in escape attempts. Punishment for escape attempts or serious violations of camp rules included solitary confinement and execution. Out of 64,188 Soviet POWs, from 18,318 to 19,085 died in Finnish prisoner of war camps.\nHostilities between Finland and the Soviet Union ceased in September 1944, and the first Soviet POWs were handed over to the Soviet Union on 15 October 1944. The transfer was complete by the next month. Some of the POWs escaped during the transportation, and some of them were unwilling to return to the Soviet Union. Furthermore, Finland handed over 2,546 German POWs from the Lapland War to the Soviet Union.\nTrials in Finland\nHostilities between Finland and the Allied powers of the United Kingdom and the Soviet Union were suspended following the Moscow Armistice. This agreement (whose execution was specifically delegated to the Soviet High Command on behalf of the Allied powers) further stipulated the conditions necessary for Finland to conclude a final peace treaty. Among these conditions, the Finns were to try those who were responsible for the war and those who had committed war crimes. The Soviet Union allowed Finland to try its own war criminals, unlike other losing countries of the Second World War. The Finnish parliament had to create ex post facto laws for the trials, though in the case of war crimes the country had already signed the Hague IV Convention. In short, Finland had to simultaneously arrange its own independent investigations and trials, and report them for verification to the Soviet Union.\nCriminal charges were filed against 1,381 Finnish POW camp staff members, resulting in 723 convictions and 658 acquittals. They were accused of 42 murders and 342 other homicides. Nine persons were sentenced to life sentences, 17 to imprisonment for 10–15 years, 57 to imprisonment for five to ten years, and 447 to imprisonment varying from one month to five years. Fines or disciplinary corrections were levied out in 124 cases. Although the criminal charges were highly politicized, some war crime charges were filed already during the Continuation War. However, most of them were not processed during wartime.\nReturning the Soviet POWs\nAfter the Continuation War, Finland handed over all Soviet and German prisoners of war in accordance with the 10th article of the Moscow Armistice. Furthermore, the article also stipulated the return of all Soviet nationals who were deported to Finland during the Continuation War. This meant that Finland also had to hand over all those who moved to Finland voluntarily, as well as those who fought in the ranks of the Finnish army against the Soviet union, though some had Finnish citizenship. The return to the Soviet Union was in many cases fatal for these people, as some of them were executed as traitors at the Soviet train station at Vyborg and some died in harsh camp conditions in Siberia. After the collapse of the Soviet Union the survivors were allowed to return to Finland.\nSome of the Soviet prisoners of war co-operated with the Finns during the war. Before the end of the war all related Finnish archives, including interrogation documents relating to co-operating prisoners, were destroyed; and these POWs' destinations after the war are uncertain. Some of them were secretly transported by Finnish army personnel to Sweden and some continued on as far as the United States. The highest ranking Soviet prisoner of war was Major General Vladimir Kirpichnikov, who returned to the Soviet Union. He was tried, convicted of high treason, and executed in 1950.\nLegal position of Soviet POWs\nFinland had signed the 1907 Hague IV Convention in 1922 that covered the treatment of prisoners of war in detail. However, Finland announced that it could not completely obey the convention as the Soviet Union had not signed the same convention. The convention required ratification by both parties to the hostilities before going into effect. Finland did not sign the updated 1929 Third Geneva Convention, because it conflicted with some clauses of Finnish criminal law. Although the Soviet Union had not signed the Hague IV Convention, the reality was unclear and ambiguous. Soviet law specified that a Soviet soldier's surrender constituted treason which was punishable by death or imprisonment and seizure of the soldier's property.\nSee also\n* Finnish prisoners of war in the Soviet Union\n* East Karelian concentration camps\n* Prisoners of war in World War II\n* War children § Soviet prisoners of war\nNotes\nReferences\nCitations\nBibliography\n*\n*\n*\n*"
    }
  ]
}