{
  "content": [
    {
      "type": "text",
      "text": "# Soviet Antarctic Expedition\n\nThe Soviet Antarctic Expedition (SAE or SovAE) (, Sovetskaya antarkticheskaya ekspeditsiya) was a Soviet research institute.  It was succeeded by the Russian Antarctic Expedition.\nGovernance and history\nThe Soviet Union's Ministry of Sea Transport was responsible for the administration, logistics and supply of the expeditions. The Soviet Antarctic Expedition was part of the Arctic and Antarctic Research Institute of the Soviet Committee on Antarctic Research of the Academy of Sciences of the USSR.\nThe first Soviet contact with Antarctica was in January 1947, when the Slava whaling flotilla began whaling in Antarctic waters.\nSAE was succeeded by the Russian Antarctic Expedition.\nExpeditions\n10 Years of Soviet Research in Antarctica, 1966 USSR stamp block\nThe Soviet Union engaged in expeditions to Antarctica from 1955 to its dissolution. After this, the Soviet Antarctic stations were taken over by Russia.\nStations\nThe first Soviet Antarctic station, Mirny, was established near the coast on February 13, 1956. In December 1957 another station, Vostok, was built inland near the South geomagnetic pole.\nYear-round stations\n* Mirny (established February 13, 1956)\n* Vostok (established December 16, 1957)\n* Novolazarevskaya (established January 18, 1961)\n* Molodyozhnaya (established January 14, 1963)\n* Bellingshausen (established February 22, 1968)\n* Leningradskaya (established February 25, 1971)\n* Russkaya (established March 9, 1980)\n* Progress (established April 1, 1988)\nSummer stations\n*Komsomolskaya (established November 6, 1957)\n*Pionerskaya (established May 27, 1956)\n*Druzhnaya I (on the Filchner Ice Shelf in the Weddell Sea)\n*Druzhnaya II (on the Weddell Sea)\nIGY stations\nList of stations in use during the International Geophysical Year.\n*Sovetskaya\n*Pole of inaccessibility station\nSee also\n* Arctic and Antarctic Research Institute\n* List of Antarctic expeditions\n* Soviet and Russian manned drifting ice stations\n* List of Russian explorers\n* Zapadnoye Lake\nReferences\n*\n* Voronin, V. I. (1948) \"The first Antarctic whaling expedition of the Slava flotilla\" in Proceedings of the Soviet Geographical Society, 80(3):213–222\n*\n* Gan, I, Towards the great unknown: the Soviets prepare for their thrust into the Antarctic interior, National and transnational agendas in Antarctic Research from the 1950s and beyond. Proceedings of the 3rd Workshop of the SCAR Action Group on the History of Antarctic Research, BPRC Technical report no. 2011-01, Byrd Polar Research Centre, Columbus, Ohio, pp.&nbsp;116–130. (2012) [Conference Edited]\n*\n*\n*\n*\n* Gan, I, The Soviet Preparation for the IGY Antarctic Program and the Australian Response: Politics and Science, Boletín Antártico Chileno 2nd SCAR Workshop on the History of Antarctic Research, 22–22 September 2006, Santiago, Chile, pp.&nbsp;60–70. (2009) [Non Refereed Conference Paper]\n* Gan, I, The Soviet Preparation for the IGY Antarctic Program and the Australian Response: Politics and Science, 2nd SCAR Workshop on the History of Antarctic Research, 21–22 September 2006, Santiago, Chile, pp.&nbsp;11–15. (2006) [Conference Extract]\n* Gan, I, There was no cold war in Antarctica. Soviet-Australian contacts in 1950s, Russia in Antarctica Conference proceedings, April 2006, Saint Petersburg, pp.&nbsp;77–78. (2006) [Conference Extract]\nExternal links\n*[https://www.arcgis.com/home/item.html?id=e7b1728df0744c2296a4082ffe3dea05 Map of biological data from the Soviet Antarctic Expedition (1955–1958)]"
    }
  ]
}