{
  "content": [
    {
      "type": "text",
      "text": "# Space Wars__disambig_1\n\nSpacewar}}\n|JP|Taito|DE|Vectorbeam}}\n| programmer = Larry Rosenthal|JP|July 1978|EU|1978}}\n| genre = Multidirectional shooter\n| modes = Multiplayer\n| arcade system =\n}}\nSpace Wars is a 1977 multidirectional shooter video game developed and published by Cinematronics for arcades. Like the PDP-1 program Spacewar! (1962), which it is based on, it uses black and white vector graphics for the visuals. The hardware developed for Space Wars became the platform for most of the vector-based arcade games from Cinematronics. It was released in Japan by Taito in 1978, and a Vectrex port was released in 1982.\nGameplay\nTwo players controlled different ships. One button rotated the ship left, another rotated the ship right, one engaged thrust, one fired a shell, and one entered hyperspace (which causes the ship to disappear and reappear elsewhere on the playfield at random).\nThe game offered a number of gameplay options, including the presence or absence of a star in the middle of the playfield (which exerted a positive or negative gravitational pull), whether the edges of the playfield wrapped around to their opposite sides, and whether shells bounced. The game had three particular features: First, the game could not be played in \"one player\" mode; a human opponent was required. Second, the player's ship could take a glancing hit without dying, but would suffer damage; a cloud of loose ship fragments would break off and float away, after which the ship would be visibly damaged on screen and would turn and accelerate more slowly. Third and most memorable was that the duration of play for any contest was solely governed by the amount of money deposited; each quarter bought a minute and a half of play. A dollar bought six minutes, and for a ten dollar roll of quarters two players could play non-stop for an hour.\nDevelopment\nLarry Rosenthal was an MIT graduate who was fascinated with the original Spacewar! and developed his own custom hardware and software so that he could play the game. Cinematronics worked with Rosenthal to produce the Space Wars system.\nReception\nSpace Wars  sold 10,000 arcade cabinets in 1978. It was the highest-earning arcade video game of 1978 in the United States. It was later the sixth highest-earning arcade video game of 1979 in the United States.\nElectronic Fun with Computers & Games magazine gave the Atari VCS version a C rating in 1982.\nLegacy\nSpace Wars formed the basis of the platform used by Cinematronics for their subsequent black-and-white vector games such as Star Castle and Tail Gunner.\nSee also\n* Space War for the Atari VCS (1978)\nReferences\n}}\nExternal links\n* [http://thedoteaters.com/?bitstory=bitstory-article-2/space-wars-and-cinematronics \"Space Wars and Cinematronics\"] at The Dot Eaters"
    }
  ]
}