{
  "content": [
    {
      "type": "text",
      "text": "# Space Exploration Alliance\n\nThe Space Exploration Alliance (SEA) is an umbrella organization formed by 13 United States space advocacy groups, industry associations, and space policy organizations. It was established on June 3, 2004. The SEA's primary objective is to support the refocus of NASA's human space activities toward exploration beyond low Earth orbit (LEO).\nThe initial effort, officially known as the Vision for Space Exploration (VSE), includes plans for return missions to the Moon with astronauts, and with the intent of establishing a permanent lunar base. Once such plans are attained, the focus will shift to missions on Mars and beyond. This plan was announced on January 15, 2004 by US President George W. Bush at the NASA Headquarters.\nThe organizations involved in supporting the Space Exploration Alliance include:\n*[https://www.exploremars.org/ Explore Mars Inc]\n*[https://www.galaxyexplorers.org/ Federation of Galaxy Explorers]\n*Moon Society\n*The Mars Society\n*National Society of Black Engineers\n*Buzz Aldrin's Human SpaceFlight Institute\n*Students for the Exploration and Development of Space\n*Department of Space\nHistory\nThe Space Exploration Alliance (SEA) initially aimed to gain widespread congressional support for the new national Vision for Space Exploration outside Low Earth orbit, which the SEA refers to as \"Moon, Mars and Beyond\". The SEA's efforts included a campaign on Capitol Hill in Washington, D.C. held from July 11 to July 13, 2004.\nMany signed petitions from National Space Society (NSS) members were presented during the congressional visits. The NSS members were able to secure their first-year funding for the Vision for Space Exploration initiative.\nA second campaign was held on May 17 through May 19, 2005, in conjunction with the NSS's annual International Space Development Conference.\nIn a press release issued on October 15, 2005, the Space Frontier Foundation announced its intent to leave the Alliance, citing \"philosophical differences\" and an unwillingness to become \"''a fan club for a status quo that has failed so miserably time after time in our nation's quest for space''.\"\nThe SEA holds an annual \"Legislative Blitz\" in Washington, D.C.\nSee also\n*Space colonization\n*Vision for Space Exploration\nReferences\nExternal links\n*[http://www.spaceexplorationalliance.org/ Official website]"
    }
  ]
}