{
  "content": [
    {
      "type": "text",
      "text": "# Space Empires 4X\n\nSpace Empires 4X is a 4X science fiction board wargame developed by Jim Krohn and published by GMT Games in 2011. It has received three expansions: Close Encounters (2012), Replicators (2018), and All Good Things (2025).\nGameplay\nIn Space Empires 4X, up to 4 players engage in space exploration, colonization and combat, while developing technologies to design new ships or improve their existing ones. The game is played on a hexagonal map of space, and ships are represented by cardboard chits. The size of the map, victory conditions, and starting resources depend on the number of players and on the scenario players choose at game start. In addition to seven scenarios for two players and scenarios for bigger groups, there are four single-player scenarios with two distinct opponent factions. Multiplayer scenarios can optionally be played in teams. Outside of these teams, there is no in-game cooperation or trade between players, ships and fleets of players who don't belong to the same team will fight whenever there is an encounter. Combat is resolved with dice rolling. As it is a wargame, almost all technologies are focused on improving the combat abilities of their ships, often in the form of modifiers to the dice rolls. The game includes the fog-of-war mechanic, as players usually cannot know the precise information about the forces of their opponents.\nReception\nCody Carlson, reviewing the game in 2013 for Deseret News, concluded that the game deserves a spot in his Top 5 list. Simon Kriese, reviewing from Spieletest, was also complimentary to the game, praising its strategy, simple rules, engagement, and solo variants, but criticised the component quality. As of 2023, since 2012, the game has also been consistently ranked in around top 50 war games at BoardGameGeek. It was also a nominee for the 2011 Golden Geek Best Wargame award, and the winner of the Charles S. Roberts Best Science-Fiction or Fantasy Board Wargame award.\nSee also\n* Galac-Tac\n* Starweb\nReferences\nExternal links\n*"
    }
  ]
}