{
  "content": [
    {
      "type": "text",
      "text": "# Spanish conquest of the Muisca\n\nConquistadorsof the Spanish Empire\n| combatant2  = Guecha warriorsof the Muisca\n| combatant3  =\n| commander1  = Gonzalo de QuesadaHernán de QuesadaGonzalo Suárez RendónBaltasar Maldonado\n| commander2  = TisquesusaSagipaEucanemeQuiminzaSugamuxiSaymoso\n| commander3  =\n| units1      = 162\n| units2      = >30,000\n| units3      =\n| strength1   =\n| strength2   =\n| strength3   =\n| casualties1 = Unknown\n| casualties2 = Unknown\n| casualties3 =\n| notes       =\n| campaignbox =\n}}\nof Colombia.The conquest expedition led by De Quesada followed its course south on the right bank (east) from Tamalameque (where the river curves west) to Barrancabermeja ascending towards Muisca territory]]\nThe Spanish conquest of the Muisca took place from 1537 to 1540. The Muisca were the inhabitants of the central Andean highlands of Colombia before the arrival of the Spanish conquistadors. They were organised in a loose confederation of different rulers; the psihipqua of Muyquytá, with his headquarters in Funza, the hoa of Hunza, the iraca of the sacred City of the Sun Sugamuxi, the Tundama of Tundama, and several other independent caciques. The most important rulers at the time of the conquest were psihipqua Tisquesusa, hoa Eucaneme, iraca Sugamuxi and Tundama in the northernmost portion of their territories. The Muisca were organised in small communities of circular enclosures (ca in their language Muysccubbun; literally \"language of the people\"), with a central square where the bohío of the cacique was located. They were called \"Salt People\" because of their extraction of salt in various locations throughout their territories, mainly in Zipaquirá, Nemocón, and Tausa. For the main part self-sufficient in their well-organised economy, the Muisca traded with the European conquistadors valuable products as gold, tumbaga (a copper-silver-gold alloy), and emeralds with their neighbouring indigenous groups. In the Tenza Valley, to the east of the Altiplano Cundiboyacense where the majority of the Muisca lived, they extracted emeralds in Chivor and Somondoco. The economy of the Muisca was rooted in their agriculture with main products maize, yuca, potatoes, and various other cultivations elaborated on elevated fields (in their language called tá). Agriculture had started around 3000 BCE on the Altiplano, following the preceramic Herrera Period and a long epoch of hunter-gatherers since the late Pleistocene. The earliest archaeological evidence of inhabitation in Colombia, and one of the oldest in South America, has been found in El Abra, dating to around 12,500 years BP.\nThe main part of the Muisca civilisation was concentrated on the Bogotá savanna, a flat high plain in the Eastern Ranges of the Andes, far away from the Caribbean coast. The savanna was an ancient lake, that existed until the latest Pleistocene and formed a highly fertile soil for their agriculture. The Muisca were a deeply religious civilisation with a polytheistic society and an advanced astronomical knowledge, which was represented in their complex lunisolar calendar. Men and women had specific and different tasks in their relatively egalitarian society; while the women took care of the sowing, preparation of food, the extraction of salt, and the elaboration of mantles and pottery, the men were assigned to harvesting, warfare, and hunting. The guecha warriors were tasked with the defence of the Muisca territories, mainly against their western neighbours; the Muzo (\"Emerald People\") and the bellicose Panche. To impress their enemies, the Muisca warriors wore mummies of important ancestors on their backs, while fighting. In their battles, the men used spears, poisoned arrows, and golden knives.\nAlthough gold deposits were not abundant on the Altiplano, through trading the Muisca obtained large amounts of the precious metal which they elaborated into fine art, of which the Muisca raft and the many tunjos (offer pieces) were the most important. The Muisca raft pictures the initiation ritual of the new zipa, that took place in Lake Guatavita. When the Spanish who resided in the coastal city of Santa Marta, founded by Rodrigo de Bastidas in 1525, were informed about this legend, a large expedition in the quest for this El Dorado (city or man of gold) was organised in the spring of 1536.\nA delegation of more than 900 men left the tropical city of Santa Marta and went on a harsh expedition through the heartlands of Colombia in search of El Dorado and the civilisation that produced all this precious gold. The leader of the first and main expedition under Spanish flag was Gonzalo Jiménez de Quesada, with his brother Hernán second in command. Several other soldiers were participating in the journey, who would later become encomenderos and take part in the conquest of other parts of Colombia. Other contemporaneous expeditions into the unknown interior of the Andes, all searching for the mythical land of gold, were starting from later Venezuela, led by Bavarian and other German conquistadors and from the south, starting in the previously founded Kingdom of Quito in what is now Ecuador.\nThe conquest of the Muisca started in March 1537, when the greatly reduced troops of de Quesada entered Muisca territories in Chipatá, the first settlement they founded on March 8. The expedition went further inland and up the slopes of the Altiplano Cundiboyacense into later Boyacá and Cundinamarca. The towns of Moniquirá (Boyacá), Guachetá, and Lenguazaque (Cundinamarca) were founded before the conquistadors arrived at the northern edge of the Bogotá savanna in Suesca. En route towards the domain of zipa Tisquesusa, the Spanish founded Cajicá and Chía. In April 1537 they arrived at Funza, where Tisquesusa was beaten by the Spanish. This formed the onset for further expeditions, starting a month later towards the eastern Tenza Valley and the northern territories of zaque Quemuenchatocha. On August 20, 1537, the zaque was submitted in his bohío in Hunza. The Spanish continued their journey northeastward into the Iraka Valley, where the iraca Sugamuxi fell to the Spanish troops and the Sun Temple was accidentally burned by two soldiers of the army of de Quesada in early September.\nMeanwhile, other soldiers from the conquest expedition went south and conquered Pasca and other settlements. The Spanish leader returned with his men to the Bogotá savanna and planned new conquest expeditions executed in the second half of 1537 and first months of 1538. On August 6, 1538, Gonzalo Jiménez de Quesada founded Bogotá as the capital of the New Kingdom of Granada, named after his home region of Granada, Spain. That same month, on August 20, the zipa who succeeded his brother Tisquesusa upon his death; Sagipa, allied with the Spanish to fight the Panche, eternal enemies of the Muisca in the southwest. In the Battle of Tocarema, the allied forces claimed victory over the bellicose western neighbours. In late 1538, other conquest undertakings resulted in more founded settlements in the heart of the Andes. Two other expeditions that were taking place at the same time; of De Belalcázar from the south and Federmann from the east, reached the newly founded capital and the three leaders embarked in May 1539 on a ship on the Magdalena River that took them to Cartagena and from there back to Spain. Gonzalo Jiménez de Quesada had installed his younger brother Hernán as new governor of Bogotá and the latter organised new conquest campaigns in search of El Dorado during the second half of 1539 and 1540. His captain Gonzalo Suárez Rendón founded Tunja on August 6, 1539, and captain Baltasar Maldonado, who had served under de Belalcázar, defeated the cacique of Tundama at the end of 1539. The last zaque Aquiminzaque was decapitated in early 1540, establishing the new rule over the former Muisca Confederation.\nKnowledge of the conquest expeditions in Muisca territories has been provided and compiled by Gonzalo Jiménez de Quesada, main conquistador, and scholars Pedro de Aguado, Juan Rodríguez Freyle, Juan de Castellanos, Pedro Simón, Lucas Fernández de Piedrahita, Joaquín Acosta, Liborio Zerda, and Jorge Gamboa Mendoza.\nPre-Columbian history\nand pictographs]]\nof the Colombian Andes since 12,500 years BP, and the Ubaque and Tenza Valleys to the east]]\nor Inca, more akin to the Achaean League]]\n', representing the initiation ritual of the new zipa formed the basis of the legend of El Dorado, the main motive for the Spanish conquistadors to go on a decades long quest for the \"Land of Gold\"]]\nThe pre-Columbian history of the Altiplano Cundiboyacense started around 12,500 years BP with the oldest human evidence found at El Abra, near Zipaquirá. Other archaeological sites of the preceramic are Tequendama, Tibitó, Checua and Aguazuque. At the time of the arrival of the first hunter-gatherers, the area was still populated by Pleistocene megafauna, such as Cuvieronius, Haplomastodon and Equus amerhippus.\nHerrera Period\nDuring the Herrera Period, that is commonly defined as from 800 BCE to 800 CE, the agriculture that started before was further developed. Evidence for this has been uncovered in among others the Thomas van der Hammen Reserve, named after Dutch geologist and botanist Thomas van der Hammen. It was in the Herrera Period that pottery became widespread and from the 5th century CE onwards, the habit of mummification was common for the higher classes.\nArchaeological evidence of the Herrera Period has been found in numerous places on the Altiplano Cundiboyacense, among others in Sopó, Soacha, Usme, Iza, Gámeza, Facatativá (Piedras del Tunjo Archaeological Park), Moniquirá (El Infiernito), Chía, Chita, Chiscas, Soatá, Jericó, Sativasur, Covarachía, Sativanorte and El Cocuy.\nThe site in Soacha is one of the most important finds from the Herrera Period, dating from 400 BCE onwards, into the age of the Muisca. At the site, the remains of 2200 individual people, 274 complete ceramic pots, stone tools, seeds of cotton, maize, beans and curuba, 634 fragmented and intact spindles and 100 tunjos not used for offerings were found.\nMuisca Confederation\nThe Muisca Confederation is the accepted name for the territories inhabited by the Muisca on the Altiplano Cundiboyacense and neighbouring Tenza and Ubaque valleys to the east. The confederation of rulers, with as most important the zipa of Bacatá, zaque of Hunza, iraca of Sugamuxi and the Tundama of Tundama, among various independent caciques, covered an area of approximately . [https://taller5-histdiseno3b.wikispaces.com/file/view/INFORMACION+DISE%C3%91O+PRECOLOMBINO+MUISCA.pdf Muisca Confederation area almost 47,000 km2, page 12] Population estimates range from 300,000 to 2,000,000 inhabitants. The Muisca were mainly a society based on agriculture on the fertile soils of the valleys of the Altiplano, the result of Pleistocene lacustrine sediments. Called \"The Salt People\", they were also known as producing salt from halite brines extracted from salt mines in Zipaquirá, Nemocón and Tausa, an activity that was the task of the Muisca women exclusively and had started in the Herrera Period around 250 BCE. Trading of various raw products, such as cotton, that grew in lower altitude terrains to the north, east and west of the Altiplano, produced the basis for their art and cloth and ceramics production. The Muisca were unique in South American civilisations in their production of golden coins, called tejuelo.\nOther than the other great civilisations of pre-Columbian Americas, such as the Aztec, Maya and Inca, the people did not construct large stone architecture, yet built their bohíos and temples of clay, wooden poles and reed in small communities on artificially elevated areas. The Muisca adored various deities, of which the Moon (personalised by Chía) and her husband, the Sun (solar god Sué) were the most important. Two main temples were constructed to honour these deities; in Chía the Moon Temple and in sacred City of the Sun Sugamuxi the Sun Temple respectively. Both temples were built according to astronomical parameters. Most of the other sacred sites were natural in character; the many lakes that existed on the Altiplano; Iguaque, Suesca, Fúquene, Tota, the Siecha Lakes, and the most important; Lake Guatavita.\nIt was in this circular lake, located at an altitude of  within the boundaries of present-day municipality of Sesquilé, that the initiation ritual of the new zipa was performed. This ceremony, where the new zipa would cover himself in gold dust and from a raft would jump into the ice cold waters, is represented in the famous Muisca raft. The festivities of this ritual were surrounded with music, singing and dances and accompanied by large quantities of chicha, the indigenous alcoholic beverage made of fermented maize. Also during the construction of the houses, overseen by their god Nencatacoa, the people drank chicha. The golden ritual formed the basis for the -not so much- legend of El Dorado; the \"Man of Gold\", also interpreted as \"The City of Gold\". The specialised goldworking of the Muisca was known far outside the Confederation and many golden offer pieces (tunjos) have been found in various sites, making them the most common objects in museums around the world. The area of the Muisca did not contain many gold deposits and their gold was obtained mostly through trade with their neighbours at the frequent markets they organised in various settlements throughout the Altiplano.\nEmeralds were other precious pieces both extracted within the Confederation in the Tenza Valley and traded with their western neighbours, the Muzo, called \"The Emerald People\". The legend of El Dorado'', the fine goldworking, abundance of salt and emeralds, and the advanced status of the Muisca society formed the main motive for the Spanish conquistadors to leave the relative safety of Santa Marta and commence the strenuous expedition inland.\nSpanish exploration\n, the country named after him, although he never saw the present territories of the Colombian republic]]\non board, was the first journey to Colombian lands]]\nThe first time the mainland of the continent of South America was sighted by European eyes, was at the third voyage of Christopher Columbus in August 1498. During the first half of the month, he explored the Paria Peninsula, presently part of eastern Venezuela. On this voyage, Columbus saw the mouth of the Orinoco River, which water mass he rightly interpreted as a sign the continent must be large. The Orinoco River drainage basin extends to the west into the terrain of the Muisca, via the rivers Meta and its tributaries Lengupá, Upía and Cusiana. Although the country of Colombia is named after Columbus, he never saw the land pertaining to present-day Colombia, while on his fourth and final voyage, he landed in Panama that until 1903 was part of the current republic.\nThe second time the Orinoco was spotted, was by Amerigo Vespucci who took part in the first expedition that landed on Colombian soil, that of Alonso de Ojeda. Vespucci, as part of a Portuguese expedition, went east and south from the Orinoco and De Ojeda with three ships went west. The first Colombian landmass sighted by De Ojeda was the peninsula of La Guajira in late August 1499. De Ojeda misinterpreted this part of later Colombia as an island, that he called Coquivacoa (currently known as Cabo de la Vela; \"Cape of Sails\").\nDe Ojeda's second voyage commenced in January 1502 and following the same route as his first, he landed on the Colombian mainland on May 3, 1502, founding the first colony in South America; Santa Cruz today part of Bahia Honda. The colony didn't last more than three months due to various factors. The indigenous Wayuu resisted ferociously and the Spanish explorers couldn't find enough food and fresh water in the barren desert region to maintain the colony. De Ojeda set sail towards Santo Domingo in Hispaniola. His failure to establish a colony for the Spanish Crown condemned him to pay large sums upon arrival in Hispaniola. This made it impossible for him to perform new expeditions for some years.\nWhile De Ojeda was underway to Colombia, his rival Christopher Columbus started his fourth voyage, with thirty ships from Cádiz on May 11, 1502. Columbus landed on the previously unknown island of Martinique on June 15 and he continued his journey northwestward to reach Santo Domingo on June 29. As he was denied port in the Caribbean capital, Columbus sailed in the direction of Jamaica and from there to Guanaja, one of the Bay Islands off the coast of later Honduras, arriving one month later. On August 14, 1502, he landed as first European on the mainland of Central America, at a settlement that would later be called Puerto Castilla. Over the course of the next two months, Columbus explored the Caribbean Mosquito Coast of later Honduras, Nicaragua and Costa Rica, reaching the bay of Almirante on October 16. In this region, currently known as Bocas del Toro, he made first contact with the Chibcha-speaking Ngäbe people, learning about the resources of gold. After getting in conflict with the cacique of the area, El Quibían, Columbus and his men had to flee the region and set sail back to Hispaniola on April 16, 1503. After sighting the Cayman Islands on May 10, he arrived in Jamaica on June 25.\nNicolás de Ovando y Cáceres, who had sailed to the New World on February 13, 1502, with 32 ships, the biggest fleet of the time, had become governor of Hispaniola. A distant relative of him, the 19-year young Hernán Cortés from Medellín, Spain, left for Hispaniola in 1504. He would later become famous as the conquistador who brought down the Aztec Empire. Cortés's mother (Catalina Pizarro Altamirano) was related to the family of Francisco Pizarro, the later conquistador of the Inca Empire.\nThe first cities\nwere the first settlements established in Colombia, by Rodrigo de Bastidas in 1525]]\n| image2 = Pedro de Heredia.jpg\n| width2 = 178\n| alt2 = Pedro de Heredia\n| link2 = Pedro de Heredia\n| caption2 =\n| footer = After two unsuccessful attempts; Santa Cruz (La Guajira) and San Sebastián de Urabá (Antioquia), the third foundation by Alonso de Ojeda' in Tierra Firme resulted in Turbaco.The founder of Cartagena de Indias in 1533 was Pedro de Heredia\n}}\nAfter unsuccessful attempts to establish Spanish settlements in La Guajira and San Sebastián de Urabá (close to the present municipality Necoclí) on January 20, 1510, the first remaining settlement was Turbaco, founded on December 8, 1510. The first cities founded on Colombian soil that still exist today, were Santa Marta (and its northern corregimiento Taganga) on July 29, 1525, by Rodrigo de Bastidas and Cartagena, then called San Sebastián de Cartagena by Pedro de Heredia on June 1, 1533. Shortly before Cartagena, Mahates was founded on April 17, 1533. Malambo, Atlántico was discovered in 1529 by Jerónimo de Melo and Silos, Norte de Santander by Ambrosius Ehinger in 1530. In 1535, Tolú and Sincelejo, Sucre were founded by Alonso de Heredia on July 25, and Antonio de la Torre y Miranda on October 4 respectively. In the south of what is now Colombia, Yumbo, Valle del Cauca was founded in 1536 by Miguel Muñoz and in the same year Cali (July 25) by Sebastián de Belalcázar. The latter also founded Popayán in December of the same year. Jamundí, south of Cali, was founded on March 23 by Juan de Ampudia and Pedro de Añasco.\nColombian settlements founded before the main conquest\n{| class=\"wikitable sortable mw-collapsible\" style=\"text-align:center\"\n! scope=\"col\" | Settlement\n! scope=\"col\" | Department\n! scope=\"col\" | Date\n! scope=\"col\" | Year\n! scope=\"col\" | Founder(s)\n! scope=\"col\" | Notes\n! scope=\"col\" | Map\n|-\n| Santa Cruz(Bahía Honda)\n| La Guajira\n| 3 May\n| 1502\n| Alonso de Ojeda\n|\n|\n|-\n| San Sebastiánde Urabá(Necoclí)\n| Antioquia\n| 20 January\n| 1510\n| Alonso de Ojeda\n|\n|\n|-\n| Santa Maríala Antiguadel Darién(Unguía)\n| Chocó\n| September\n| 1510\n| Vasco Núñez de Balboa\n|\n|\n|-\n| Turbaco\n| Bolívar\n| 8 December\n| 1510\n| Alonso de OjedaJuan de la CosaDiego de Niquesa\n|\n|\n|-\n| Santa Marta\n| Magdalena\n| 29 July\n| 1525\n| Rodrigo de Bastidas\n|\n|\n|-\n| Mahates\n| Bolívar\n| 17 April\n| 1533\n| Pedro de Heredia\n|\n|\n|-\n| Cartagena\n| Bolívar\n| 1 June\n| 1533\n| Pedro de Heredia\n|\n|\n|-\n| Tolú\n| Sucre\n| 25 July\n| 1535\n| Alonso de Heredia\n|\n|\n|-\n| Sincelejo\n| Sucre\n| 4 October\n| 1535\n| Alonso de Heredia\n|\n|\n|-\n| Jamundí\n| Valle del Cauca\n| 23 March\n| 1536\n| Juan de AmpudiaPedro de Añasco\n|\n|\n|-\n|}\nConquest of the Muisca\n&nbsp;&nbsp;&nbsp;&nbsp;]]\n&nbsp;]]}}Foundation of Santa MartaRodrigo de Bastidas First conquest expedition' &nbsp;]]}}]]}}&nbsp;&nbsp;]]}}]]}}&nbsp;&nbsp;]]}}&nbsp;&nbsp;]]}}]]}}]]}}]]}}]]}}Expedition from the east &nbsp;]]}}Quest for El Dorado I &nbsp;]]}}&nbsp;]]}}Quest for El Dorado II &nbsp;]]}}]]}}Legend:• Leader – ]]\nThe first expedition into the terrains controlled by the Muisca started on April 6, 1536. The army of conquistadors was led by marrano Gonzalo Jiménez de Quesada with his brother Hernán Pérez de Quesada second in command. Other notable captains and soldiers were Gonzalo Suárez Rendón, Juan de San Martín, Lázaro Fonte (who would become the lover of Zoratama), Martín Galeano, Bartolomé Camacho Zambrano, Ortún Velázquez de Velasco, Antonio de Lebrija, Gonzalo Macías, Juan de Céspedes, and Juan Maldonado. Historians usually divide the journey, filled with difficulty in two stages: the first from Santa Marta to Barrancabermeja, and the second from Barranca to the Muisca territory.\nExpedition from Santa Marta to Muisca territories\nSoldiers of the first expedition\nAround 800 soldiers left Santa Marta on April 5, 1536, of whom only 173 survived when the troops reached Muisca territory, 11 months later. Expedition from the east and southwest were undertaken simultaneously.\n{| class=\"wikitable sortable mw-collapsible mw-collapsed\" style=\"text-align:center\"\n! scope=\"col\" | Name\n! scope=\"col\" | Nationality\n! scope=\"col\" | Yearsactive\n! scope=\"col\" | Natives encountered\n! scope=\"col\" | Yearofdeath\n! scope=\"col\" | Image\n! scope=\"col\" | Notes\n|-\n| Gonzalo Jiménezde Quesada\n| Granadian\n| 1536–391569–72\n| zipazaque\n| 1579\n|\n|\n|-\n| style=\"font-size:85%\" | Juan Maldonado\n| style=\"font-size:85%\" | Castilian\n| style=\"font-size:85%\" | 1536–391569–72\n| style=\"font-size:85%\" | Tairona, Chimila (2), Muisca, Panche, Pijao (2)\n| style=\"font-size:85%\" |\n|\n|\n|-\n| Gonzalo Macías\n| Castilian\n| 1536–391569–71\n| Muisca\n| 1571~\n|\n|\n|-\n| Hernán Pérezde Quesada\n| Granadian\n| 1536–391540–42\n| Muisca\n| 1544\n|\n|\n|-\n| Gonzalo Suárez Rendón\n| Castilian\n| 1536–39\n| zipa, zaque\n| 1590\n|\n|\n|-\n| Martín Galeano\n| Castilian\n| 1536–391540–45\n| Muisca\n| 1554~\n|\n|\n|-\n| Lázaro Fonte\n| Castilian\n| 1536–391540–42\n| Muisca}}\n| 1542\n|\n|\n|-\n| Juan de Céspedes\n| Castilian\n| 1525–43\n| Muisca\n| 1573 or 1576\n|\n|\n|-\n| Juan de San Martín\n| Castilian\n| 1536–391540–45\n| Muisca\n|\n|\n|\n|-\n| style=\"font-size:85%\" | Antonio de Lebrija\n| style=\"font-size:85%\" | Castilian\n| style=\"font-size:85%\" | 1536–39\n| style=\"font-size:85%\" | Muisca\n| style=\"font-size:85%\" | 1540\n|\n|\n|-\n| Ortún Velázquez de Velasco\n| Castilian\n| 1536–39\n| Muisca\n| 1584\n|\n|\n|-\n| Bartolomé Camacho Zambrano\n| Castilian\n| 1536–39\n| Muisca\n|\n|\n|\n|-\n| style=\"font-size:85%\" | Antonio Díaz de Cardoso\n| style=\"font-size:85%\" | Castilian\n| style=\"font-size:85%\" | 1536–39\n| style=\"font-size:85%\" | Muisca\n|\n|\n|\n|-\n| Pedro Fernández de Valenzuela\n| Castilian\n| 1536–39\n| Muisca\n|\n|\n|\n|-\n| 640+ conquistadors\n| style=\"font-size:85%\" | mostly Castilian\n| style=\"font-size:85%\" | April 1536-April 1537\n| Diseases, jaguars, crocodiles, climate,various indigenous warfare\n| 15361537\n|\n|\n|-\n|}\n1535–1539 – years of joint expeditions from three sides\nIn the years around the main expedition of the de Quesadas, two other major exploration routes into the heart of Colombia were followed; one under German order, headed by Federmann from the northeast, and one led by de Belalcázar from the south.\nLeaders and soldiers of De Belalcázar and Federmann\n{| class=\"wikitable sortable mw-collapsible mw-collapsed\" style=\"text-align:center\"\n! scope=\"col\" | Name\n! scope=\"col\" | Nationality\n! scope=\"col\" | Yearsactive\n! scope=\"col\" | Natives encountered\n! scope=\"col\" | Yearofdeath\n! scope=\"col\" | Image\n! scope=\"col\" | Notes\n|-\n| Sebastián de Belalcázar\n| Castilian\n| 1514–39\n| Muisca\n| 1551\n|\n|\n|-\n| Baltasar Maldonado\n| Castilian\n| 1534–52\n| Conquest of Tundama\n| 1552\n|\n|\n|-\n| Nikolaus Federmann\n| Bavarian\n| 1535–39\n| Muisca\n| 1542\n|\n|\n|-\n| Miguel Holguín y Figueroa\n| Castilian\n| 1535–39\n| Muisca\n| 1576>\n|\n|\n|-\n|}\n1536 – the harsh expedition towards Muisca territory\n, the city to the northwest of the triangular Sierra Nevada de Santa Marta, the expedition first went east along the Caribbean coast and then followed the valley of the Ranchería River southwest towards the Magdalena]]\nalong the Opón and Súarez rivers]]\nfrom Chipatá towards the territories of zipa Tisquesusa]]\nThe first indigenous group that submitted to the Spanish Crown were the Tairona, who inhabited the area around Santa Marta, with their descendants presently living on the slopes of the Sierra Nevada de Santa Marta and in Tayrona National Park. On April 6, 1536, triggered by the stories of the mythical \"City of Gold\" El Dorado, Gonzalo Jiménez de Quesada organised two groups of conquistadors to set foot towards the inner highlands of the Colombian Andes, as first European explorers. The army with the brothers de Quesada and more than 700 soldiers and 80 horses went first east and then south passing the Sierra Nevada de Santa Marta on their right hand over land and another, of more than 200 men, embarked in boats and ascended the Magdalena River from Ciénaga, in search of its origin. The list of the soldiers that eventually made it to Funza has been compiled by Juan Florez de Ocáriz (1612–1692). The land army was led by Gonzalo with Hernán second in command. The first indigenous group encountered, were the Chimila. Continuing south, the troops had to cross inhospitable terrains full of creeks and part of their supplies and equipment was lost when crossing the Ariguaní River.\nThe difficulties of the expedition only increased when the conquerors went further inland. They reached the indigenous settlement of Chiriguaná, lost their indigenous guides brought from the coast and it took them eight days to reach the lakes of Tamalameque. The indigenous people there, who had suffered from the conquest expedition of Bavarian conquistador Ambrosius Ehinger six years earlier, revolted defending the local population. They were submitted to the rule of de Quesada. The troops rested in this area for a while and Gonzalo sent a delegation to the Magdalena River to see if the boats had arrived. The messengers returned with sad news; the majority of boats had shipwrecked in the mouth of the Magdalena and the soldiers who survived and made it onshore fell prey to the poisoned arrows of the indigenous groups and the crocodiles along the river. The remaining ships left for Cartagena de Indias. Ortún Velázquez de Velasco and Luis de Manjarrés made it back to Santa Marta where they obtained new boats. They joined the army of de Quesada at the banks of the Magdalena two months later.\nThe lower parts of the Magdalena River were inhabited by numerous indigenous groups who resisted the Spanish conquistadors with canoes, fighting using poisoned arrows. This held the Spanish troops back and the reduced army joined forces on land in Sompallón, where they had lost already 100 men. The two conquistadors who reached this area first were Juan de Sanct Martín and Juan de Céspedes. Many of the disgruntled soldiers wanted to return to the relative safety of Santa Marta, but father Juan Domingo de las Casas persuaded the soldiers to continue, at the risk of being called cowards if they refused. The expedition split in two again, with one part ascending further the Magdalena River and the main part through the thick forests of the right bank of the river. Here they encountered many natural dangers, such as jaguars, wild boar, snakes, mosquitoes, spiders, stinky grisons, and the many spines and poisonous plants in the forest. Even anteaters had attacked the troops and almost killed a horse. Pioneers with machetes were sent ahead to create pathways through the dense jungle, a task that could take up to 8 days for a path crossed by the army in hours. The troops took shelter from the heavy rains below trees and ate fruits and wild roots to survive. Many of the soldiers became ill and died due to snake bites and jaguar attacks. They crossed the many creeks and rivers tributary to the Magdalena swimming, where the caymans formed another risk. Apart from the natural hazards, also the indigenous people attacked the Spanish with their arrows, clubs and canoes. At night, when the soldiers were sleeping unprotected in their hammocks, the jaguars attacked and killed them, and in many cases the screams of the men were not heard because of the thunderstorms.\nAfter eight months of horrible jungle experience where they advanced just , the heavily reduced troops reached La Tora, now called Barrancabermeja. Easier to defend, the settlement was taken as a place of rest for about three months and to bury the 100 more dead soldiers of which many were thrown in the river to become food for the crocodiles. Plagued by the hot climate, mosquitos, and illnesses and conscious that the broad river extended upwards, the expedition continued south. Gonzalo Jiménez de Quesada was convinced they would reach the lands full of gold they heard about at the Caribbean coast and motivated his delegation of soldiers, that at this time had an average age of 27 years old, to walk on.\nFrom Barrancabermeja, the troops followed the course of the Opon River, but soon discovered it was not navigable anymore. Gonzalo decided to continue over land and they found a canoe with ceramic pots with salt and cloths. This was a sign they came closer to a great civilisation and it motivated the troops to march on. Gonzalo ordered 40 of his weakest men and 150 soldiers to return to Santa Marta. Those who returned fell into the hands of the indigenous groups along the way and few of them made the journey back to the Caribbean city. The brothers de Quesada marched on with 70 of the original horses and sent ahead the conquistadors Juan de Céspedes, Antonio de Lebrija and Alférez Anton de Olalla. They found a valley with scattered houses. Early 1537, after passing through Aguada, the expedition reached Chipatá, the first settlement of the Muisca, where father Juan Domingo de las Casas held his first sermon.\nThe climate of Chipatá, at  altitude, was much more pleasant than the hot lower valleys of the Opón River and Gonzalo decided to stay for five months in the town to allow his soldiers to rest and regain strength. The local Muisca of Chipatá brought the Spanish soldiers new mantles, as the ones taken from Santa Marta had worn down due to the harsh circumstances of their expedition. Some of the members of the expedition were already half-naked. In Chipatá, the Spanish for the first time learnt to drink chicha, the fermented alcoholic beverage of the Muisca. Using the enslaved indigenous people of the coast who understood forms of Chibcha, Gonzalo and Hernán were informed where the civilisation producing those fine mantles and salt was located.\n1536–1537 – route by the conquistadors\n{| class=\"wikitable sortable\" style=\"text-align:center\"\n! scope=\"col\" | Settlement\n! scope=\"col\" | Department\n! scope=\"col\" | Date\n! scope=\"col\" | Year\n! scope=\"col\" | Notes\n! scope=\"col\" | Map\n|-\n| Santa Marta\n| Magdalena\n| 6 April\n| 1536\n|\n|\n|-\n| Dibulla\n| La Guajira\n|\n| 1536\n|\n|\n|-\n| Riohacha\n| La Guajira\n|\n| 1536\n|\n|\n|-\n| San Juan del Cesar\n| La Guajira\n|\n| 1536\n|\n|\n|-\n| Villanueva\n| La Guajira\n|\n| 1536\n|\n|\n|-\n| Urumita\n| La Guajira\n|\n| 1536\n|\n|\n|-\n| La Jagua del Pilar\n| La Guajira\n|\n| 1536\n|\n|\n|-\n| La Paz\n| Cesar\n|\n| 1536\n|\n|\n|-\n| San Diego\n| Cesar\n|\n| 1536\n|\n|\n|-\n| Sompallón\n| Cesar\n|\n| 1536\n|\n|\n|-\n| Chiriguaná\n| Cesar\n|\n| 1536\n|\n|\n|-\n| Chimichagua\n| Cesar\n|\n| 1536\n|\n|\n|-\n| Tamalameque\n| Cesar\n|\n| 1536\n|\n|\n|-\n| La Gloria\n| Cesar\n|\n| 1536\n|\n|\n|-\n| Gamarra\n| Cesar\n|\n| 1536\n|\n|\n|-\n| Aguachica\n| Cesar\n|\n| 1536\n|\n|\n|-\n| San Martín\n| Cesar\n|\n| 1536\n|\n|\n|-\n| Rionegro\n| Santander\n|\n| 1536\n|\n|\n|-\n| Sabana de Torres\n| Santander\n|\n| 1536\n|\n|\n|-\n| Puerto Wilches\n| Santander\n|\n| 1536\n|\n|\n|-\n| Barrancabermeja\n| Santander\n| 12 October orearly December\n| 1536\n|\n|\n|-\n| Simacota\n| Santander\n| January–February\n| 1537\n|\n|\n|-\n| Vélez\n| Santander\n| January–February\n| 1537\n|\n|\n|-\n| Aguada\n| Santander\n| January–February\n| 1537\n|\n|\n|-\n| Chipatá\n| Santander\n| February–March\n| 1537\n|\n|\n|-\n|}\n1537 – the year of the Muisca conquest\nand Boyacá, here close to Santa Sofía, was crossed in March 1537 by the conquistadors]]\n, mythological figure in the Muisca society in the first founded settlement in Cundinamarca; Guachetá]]\nin the northwest]]\nin April 1537, they had a good view on the flat Bogotá savanna, terrain of the southern Muisca and ruled by zipa Tisquesusa]]\nChipatá was the first settlement of the later New Kingdom of Granada, founded by Gonzalo Jiménez de Quesada on March 8, 1537. Shortly after, the rested and reinforced troops set foot to higher terrains towards the south. Different from the scattered and unorganised indigenous groups they encountered before, advancing into the Muisca Confederation, they found a much better organised society and economy. The agriculture of the Muisca impressed the Spanish conquistadors and made them even more curious to find out who was the leader of the civilisation. While the Muisca regarded the European conquerors with distrust, they were also curious about them and where they came from.\nThe Spanish settlers, still around  away from the southern Muisca capital Bacatá, continued south and reached the Altiplano Cundiboyacense, where they marched through the Ubaté-Chiquinquirá Valley, passing through Barbosa, close to Saboyá. That town would later become the first encomienda of Pedro de Galeano, the brother of Martín Galeano, who were both taking part in the expedition. Saboyá means in Chibcha \"Taste of the mantles\", referring to the mantles that were elaborated by the Muisca from traded cotton. Following the course of the Suárez River, the army continued south towards Simijaca, the first settlement in the modern department of Cundinamarca. The troops stayed on the eastern bank of the Suárez River and reached Lake Fúquene, presently much smaller than in the 1530s. The water level estimated in the time of the expedition was  to  higher than today.\nThe caciques of the settlements Simijaca and, further along the route Fúquene and Tausa, were loyal to the zipa of Bacatá and the conquistadors were increasingly interested in the richness of that area. After Fúquene, they entered Guachetá and founded the modern town on March 12, continued to Lenguazaque that was founded the next day, and arrived in Suesca, founding that city on March 14. Suesca would become the seat of Gonzalo Jiménez and his place of death 42 years later. After Suesca, the expedition entered Nemocón, the second-most important salt-producing town in the Muisca Confederation. When the troops of de Quesada arrived in Nemocón, the local inhabitants brought them food like deer, pigeons, rabbits, guinea pigs, beans, tubers, and other aliments, new to the Spanish. When the troops of de Quesada were in Nemocón, they were first attacked by the Muisca guecha warriors of the zipa.\nThe Spanish soldiers beat the Muisca warriors and continued southwest across the Bogotá savanna towards Cajicá. Here they had an overview of the vast plains of the savanna, dotted with farmfields on elevated terraces. The intermontane valley was populated with numerous bohíos, circular houses with a conical roof made of reed. The climate of the high plains was pleasant for the Spanish troops and Gonzalo Jiménez de Quesada baptised the flatlands Valle de los Alcázares. The expedition halted in Chía where they spent the Holy Week. After that week in April 1537, de Quesada ordered his men towards Funza, the site of the domain of the zipa. Although the army of the brothers De Quesada was reduced to 170 men, the hundreds of guecha warriors couldn't resist the superior Spanish arms and were defeated. In the meantime, zipa Tisquesusa sent messengers to the caciques in the Muisca Confederation to inform them of the arrival of the light-skinned heavily armed men. The caciques considered the invaders sacred and didn't dare to attack them. Funza was conquered and founded on April 20, 1537. Of the more than 900 soldiers who left Santa Marta a year earlier, only 162 survived the harsh expedition.\n1537 – route and foundations\n{| class=\"wikitable sortable\" style=\"text-align:center\"\n! scope=\"col\" | Settlement\n! scope=\"col\" | Department\n! scope=\"col\" | Date\n! scope=\"col\" | Year\n! scope=\"col\" | Altitude (m)\n! scope=\"col\" | Notes\n! scope=\"col\" | Map\n|-\n| Chipatá\n| Santander\n| 8 March\n| 1537\n| 1820\n|\n|\n|-\n| Barbosa\n| Santander\n| March\n| 1537\n| 1610\n|\n|\n|-\n| Moniquirá\n| Boyacá\n| March\n| 1537\n| 1669\n|\n|\n|-\n| Santa Sofía\n| Boyacá\n| March\n| 1537\n| 2387\n|\n|\n|-\n| Sutamarchán\n| Boyacá\n| March\n| 1537\n| 1800\n|\n|\n|-\n| Ráquira\n| Boyacá\n| March\n| 1537\n| 2150\n|\n|\n|-\n| Simijaca\n| Cundinamarca\n| March\n| 1537\n| 2559\n|\n|\n|-\n| Susa\n| Cundinamarca\n| March\n| 1537\n| 2655\n|\n|\n|-\n| Fúquene\n| Cundinamarca\n| March\n| 1537\n| 2750\n|\n|\n|-\n| Guachetá\n| Cundinamarca\n| 12 March\n| 1537\n| 2688\n|\n|\n|-\n| Lenguazaque\n| Cundinamarca\n| 13 March\n| 1537\n| 2589\n|\n|\n|-\n| Cucunubá\n| Cundinamarca\n| 13–14 March\n| 1537\n| 2590\n|\n|\n|-\n| Suesca\n| Cundinamarca\n| 14 March\n| 1537\n| 2584\n|\n|\n|-\n| Nemocón\n| Cundinamarca\n| March\n| 1537\n| 2585\n|\n|\n|-\n| Zipaquirá\n| Cundinamarca\n| March\n| 1537\n| 2650\n|\n|\n|-\n| Cajicá\n| Cundinamarca\n| 23 March\n| 1537\n| 2558\n|\n|\n|-\n| Chía\n| Cundinamarca\n| 24 March\n| 1537\n| 2564\n|\n|\n|-\n| Cota\n| Cundinamarca\n| March–April\n| 1537\n| 2566\n|\n|\n|-\n| Funza\n| Cundinamarca\n| 20 April\n| 1537\n| 2548\n|\n|\n|-\n|}\nApril 1537 – conquest of Muyquytá\nwas Tisquesusa, who was killed by one of the soldiers of the conquest expedition, opening up the reign of the Spanish over the terrain and the foundation of Bogotá]]\nThe arrival of the Spanish conquerors was revealed to Tisquesusa by the mohan Popón, from the village of Ubaque. He told the Muisca ruler that foreigners were coming and Tisquesusa would die \"bathing in his own blood\". When Tisquesusa was informed of the advancing invasion of the Spanish soldiers, he sent a spy to Suesca to find out more about their army strength, weapons, and with how many warriors they could be beaten. The zipa left the capital Bacatá and took shelter in Nemocón which directed the Spanish troops to there, during this march attacked by more than 600 Muisca warriors.\nWhen Tisquesusa retreated in his fort in Cajicá he allegedly told his men he would not be able to combat against the strong Spanish army in possession of weapons that produced \"thunder and lightning\". He chose to return to Bacatá and ordered the capital to be evacuated, resulting in an abandoned site when the Spanish arrived. In search for the Muisca ruler the conquistadores went north to find Tisquesusa in the surroundings of Facatativá where they attacked him at night.\nTisquesusa was thrusted by the sword of one of de Quesada's soldiers but without knowing he was the zipa he let him go, after taking the expensive mantle of the ruler. Tisquesusa fled hurt into the mountains past Facatativá, in the west of the Bogotá savanna, and died of his wounds there. His body was only discovered a year later because of the black vultures circling over it. Upon the death of Tisquesusa, his son Hama and daughter Machinza hid the sister of the zipa, Usaca, in one of the settlements on the Bogotá savanna. When one of the conquistadors, Juan María Cortés, found out about this, his prepared a battle to gain control over the area. At that moment, Usaca appeared and resisted against the Spanish conqueror. Legend tells that he dropped his weapons and fell in love with her, eventually marrying the sister of Tisquesusa and they were baptised in Usaquén, meaning \"Land of the Sun\" in Muysccubun. This formed the start of the construction of a colonial village, today part of the capital and known for its colonial architecture and parks.\nMay–August 1537 – route towards Hunza through the Tenza Valley (Gonzalo)\nwas not there, though smaller lakes dotting the landscape and larger lakes than today existed on the Altiplano Cundiboyacense in the 16th century]]\n'. Although he didn't realise it and until in his 70s went searching for it]]\nof Hunza, the last ruler of the Muisca Confederation; Quemuenchatocha]]\n{| class=\"wikitable sortable mw-collapsible mw-uncollapsed\" style=\"text-align:center\"\n! scope=\"col\" | Settlement\n! scope=\"col\" | Department\n! scope=\"col\" | Date\n! scope=\"col\" | Year\n! scope=\"col\" | Notes\n! scope=\"col\" | Map\n|-\n| Engativá\n| Cundinamarca\n| 22 May\n| 1537\n|\n|\n|-\n| Suba\n| Cundinamarca\n| May\n| 1537\n|\n|\n|-\n| Chía\n| Cundinamarca\n| May\n| 1537\n|\n|\n|-\n| Cajicá\n| Cundinamarca\n| May\n| 1537\n|\n|\n|-\n| Tocancipá\n| Cundinamarca\n| May–June\n| 1537\n|\n|\n|-\n| Gachancipá\n| Cundinamarca\n| May–June\n| 1537\n|\n|\n|-\n| Guatavita\n| Cundinamarca\n| May–June\n| 1537\n|\n|\n|-\n| Sesquilé\n| Cundinamarca\n| May–June\n| 1537\n|\n|\n|-\n| Chocontá\n| Cundinamarca\n| 9 June\n| 1537\n|\n|\n|-\n| Machetá\n| Cundinamarca\n| June\n| 1537\n|\n|\n|-\n| Tibiritá\n| Cundinamarca\n| June\n| 1537\n|\n|\n|-\n| Guateque\n| Boyacá\n| June\n| 1537\n|\n|\n|-\n| Sutatenza\n| Boyacá\n| June\n| 1537\n|\n|\n|-\n| Tenza\n| Boyacá\n| 24 June\n| 1537\n|\n|\n|-\n| La Capilla\n| Boyacá\n| June–July\n| 1537\n|\n|\n|-\n| Chivor\n| Boyacá\n| July\n| 1537\n|\n|\n|-\n| Úmbita\n| Boyacá\n| July\n| 1537\n|\n|\n|-\n| Turmequé\n| Boyacá\n| 20 July\n| 1537\n|\n|\n|-\n| Boyacá\n| Boyacá\n| 8 August\n| 1537\n|\n|\n|-\n| Ciénega\n| Boyacá\n| August\n| 1537\n|\n|\n|-\n| Soracá\n| Boyacá\n| 20 August ~15:00\n| 1537\n|\n|\n|-\n| Hunza\n| Boyacá\n| 20 August\n| 1537\n|\n|\n|-\n|}\nAugust 1537 – conquest of Hunza\nwas the main shrine for the Muisca to honour their Sun god Sué.It was destroyed by fire from torches brought at night by two soldiers from the team of Gonzalo Jiménez de Quesada.A reconstruction has been built in the Archaeology Museum of Sogamoso]]\nWhen Gonzalo Jiménez de Quesada found out the caciques were conspiring against him, he sent out several expeditions of soldiers. His captain Juan de Céspedes went south to conquer Fusagasugá and to found Pasca on July 15, 1537. Hernán was sent north and Gonzalo himself went northeast, to search for the mythical Land of Gold El Dorado''. There he didn't find golden cities, but emeralds the Muisca were extracting in Chivor and Somondoco. First foundation was Engativá, presently a locality of Bogotá, on May 22, 1537. Passing through Suba, Chía, Cajicá, Tocancipá, Gachancipá, Guatavita, and Sesquilé, he arrived in Chocontá, founding the modern town on June 9. The journey went eastward into the Tenza Valley through Machetá, Tibiritá, Guateque, Sutatenza, and Tenza, founded on San Juan; June 24. On the same day, Hernán founded Sutatausa. Gonzalo continued northwest through La Capilla and Úmbita. He arrived in Turmequé that he founded on July 20.\nIn August 1537 Gonzalo Jiménez de Quesada entered the territories of the zaque, who ruled from Hunza. When the Spanish conquerors entered the outskirts of Hunza and found a hill with poles where bodies were dangling, they named it Cerro de la Horca (\"Gallow Hill\"). At the time of the conquest Quemuenchatocha was the zaque and he ordered his men to not submit to the European invaders or show them the way to his bohío. He sent messengers to the Spanish conquistadors with valuable peace offers. While this was happening, Quemuenchatocha had hidden his treasures from the Spanish. Hunza was located in a valley not as green as the Bogotá savanna. The advantage of the Spanish weaponry and the use of the horses quickly beat the Muisca warriors.\nWhen Gonzalo arrived at the main bohío of Quemuenchatocha, he found the Muisca ruler sitting in his throne and surrounded by his closest companions. All men were dressed in expensive mantles and adorned with golden crowns. On August 20, 1537, the Spanish beat the zaque and the big and strong Muisca ruler was taken captive to Suesca. There he was tortured and the Spanish soldiers hoped he would reveal where he hid his precious properties. The absence of Quemuenchatocha paved the route for his nephew Aquiminzaque to succeed him as ruler of the northern Muisca, a practice common in Muisca traditions. When Quemuenchatocha was finally released from captivity in Suesca, he fled to Ramiriquí, where he died shortly after. The Spanish soldiers found gold, emeralds, silver, mantles, and other valuables in Tunja. They were not able to take all the precious pieces and many were secretly taken away by the Muisca, using folded deer skins. They hid the valuables in nearby hills.\nSeptember 1537 – conquest of Sugamuxi\nAfter the victory of Gonzalo de Quesada of the important city of Hunza, with some of his men he continued to Suamox, the sacred City of the Sun, ruled by the iraca called Sugamuxi. The Temple of the Sun, built to worship the Sun god Sué, one of the two main deities in the Muisca religion, was a temple filled with gold, emeralds, cloths, and mummies. On his way to Suamox, presently called Sogamoso, the troops spent the night in Paipa. On August 25, 1537, other sources state a date in early September, the troops arrived in the Iraca Valley around Suamox. While Gonzalo Jiménez de Quesada ordered his men to leave the Sun Temple for the time being, two of his soldiers entered the temple at night and found the mummies sitting on elevated platforms inside. Their torches accidentally set the temple, made of wooden poles and clay, on fire. Before, the conquistadors had looted the temple and taken more than  of gold, worth 80,000 ducats at the time, not taking into account the emeralds, fine cloths, and other valuables.\n1537–38 – Bogotá savanna conquests\n; Bacatá, is the biggest city in the world at altitudes above ]]\nAt the start of 1538, when the troops were exhausted after almost two years in foreign terrain, the soldiers asked what was their payment for the conquest they had done. De Quesada divided the conquered treasures between his men; 40,000 pieces of fine gold, 562 emeralds, and tumbaga (gold-copper-silver alloys). Foot soldiers received 520 pieces each, horse riders double the amount, captains 2,080 pieces, generals 3,640, and some pieces were given as prizes for the most distinguished soldiers. Masses were organised to honour the many dead soldiers during the campaign and part of the treasure was given to Juan de las Casas. De Quesada was not pleased to hear about the advancement of another group of conquistadors in the east, led by Nikolaus Federmann, coming from later Venezuela across the Llanos Orientales. Another team of conquerors, commanded by Sebastián de Belalcázar, was coming from the south, originating from Quito. Gonzalo sent Hernán to meet the southern group who had traveled through the hot valley of Neiva.\n6 August 1538 – foundation of Santafé de Bogotá\nOne and a half-year after the victory of the conquistadors on Tisquesusa, in the area of Teusaquillo, the modern capital of Colombia was founded. Although some historians set the date at April 27, 1539, the common and celebrated date of foundation is August 6, 1538. The foundation was performed by the construction of 12 houses of reed, referring to the Twelve Apostles or to the twelve tribes of Judea, and the construction of a preliminary church, also of reed. Father Juan de las Casas held his first mass in the improvised church. The city was named Santafé de Bogotá, a combination of the Spanish city of Santafé and the Chibcha name of the southern Muisca capital Bacatá, meaning \"Enclosure outside of the farmfields\". The newly established country, part of the Spanish Empire was called New Kingdom of Granada, after the place of birth of the brothers de Quesada in Andalusia; Kingdom of Granada.\nLater conquest expeditions\n, 1890]]\n1538 – Battle of Tocarema and further conquest\ns of zipa Sagipa]]\nAfter the expeditions into the Muisca territories and to the north, submitting Hunza and Sugamuxi, and the foundation of Bogotá, various other journeys were organised. Gonzalo Jiménez de Quesada himself went west and submitted the Panche in the Battle of Tocarema, fought on August 20, 1538, in Tocarema, currently part of Cachipay. In this battle, the Spanish had allied with Sagipa, the new and last zipa. De Quesada with only 50 soldiers and Sagipa 12,000 to 20,000 guecha warriors strong beat the Panche on 20 August 1538 and celebrated the victory.\nSagipa was held by the new Spanish rulers on accusation of his illegal rule. The Spanish demanded the vast amounts of gold of the heritage of Tisquesusa. Initially Sagipa denied and went into hiding. When Sagipa saw the Muisca lost faith in his rule he surrendered to De Quesada. Outraged by his refusal to hand over the treasure Sagipa was tortured with iron bars. In early 1539 the last zipa died in the Spanish camp in Bosa as a result of the torments by the Spanish rulers.\n1538–1539 – further conquest and foundations by Gonzalo\n]]\ns]]\n{| class=\"wikitable sortable mw-collapsible mw-uncollapsed\" style=\"text-align:center\"\n! scope=\"col\" | Settlement\n! scope=\"col\" | Department\n! scope=\"col\" | Date\n! scope=\"col\" | Year\n! scope=\"col\" | Notes\n! scope=\"col\" | Map\n|-\n| Cachipay\n| Cundinamarca\n| 20 August\n| 1538\n|\n|\n|-\n| Anolaima\n| Cundinamarca\n|\n| 1538\n|\n|\n|-\n| Facatativá\n| Cundinamarca\n| 15 October\n| 1538\n|\n|\n|-\n| Bojacá\n| Cundinamarca\n| 16 October\n| 1538\n|\n|\n|-\n| Mosquera\n| Cundinamarca\n| October\n| 1538\n|\n|\n|-\n| Bosa\n| Cundinamarca\n|\n| 1538\n|\n|\n|-\n| Cerinza\n| Boyacá\n|\n| 1538\n|\n|\n|-\n| Paipa\n| Boyacá\n|\n| 1539\n|\n|\n|-\n| Tibasosa\n| Boyacá\n|\n| 1539\n|\n|\n|-\n| Garagoa\n| Boyacá\n|\n| 1539\n|\n|\n|-\n|}\nApril 1539 – return to Spain of Gonzalo, Sebastián and Nikolaus\nThe three leaders of the conquest expeditions; Gonzalo de Quesada, Nikolaus Federmann (in Spanish called De Federmán) and Sebastián de Belalcázar, met in Bosa and agreed to travel back to Spain to ask for compensation for their exploration for the Spanish Crown. Gonzalo assigned Hernán as interim governor of the New Kingdom and chose the first mayor and council for the capital. The chaplain of the team of Federmann, Juan Verdejo, was named priest. Most of the soldiers of the expeditions of Federmann and De Belalcázar decided to stay in Bogotá, reinforcing the reduced troops of De Quesada. Without having found El Dorado, three years after his departure from Santa Marta, in mid May 1539, Gonzalo Jiménez de Quesada returned to the Caribbean coast, to sail to Spain from Cartagena. After writing his book about the conquest, Epítome de la conquista del Nuevo Reino de Granada between 1548 and 1559, Gonzalo Jiménez de Quesada would return to the New Kingdom of Granada in the second half of the sixteenth century to continue his quest for El Dorado in the Llanos Orientales, Huila and Tolima. Gonzalo Jiménez de Quesada died in Mariquita in 1579.\nBefore embarking on a ship on the Magdalena River to take them to Cartagena, the three conquistadors founded their place of harbour; Panche settlement Guataquí on April 6, 1539.\n1539 – conquest of Tundama\n' appears above the city]]\nTundama, who ruled the northernmost part of the Muisca Confederation from an island in the former lake around Tundama, already got notice of the burning of the Sun Temple, two years earlier and the submission of the neighbouring indigenous groups, the Panche, Guane and others and told his guecha warriors not to bow for the Spanish invaders. When one of his warriors suggested surrender was the best option, Tundama cut off his ears and left hand. The cacique declared a \"death war\" against the Spanish and gathered an army of 10,000 guecha warriors.\nTo keep the conquistadores away, he sent a delegation of his people with emeralds, gold and mantles to offer the Spanish with the promise that Tundama would surrender bringing eight more of these. Gaining time, Tundama hid his treasures and prepared the defence of Tundama.\nOn December 15, 1539, another Spanish captain coming from the south after conquering Peru and the Kingdom of Quito as part of the expedition by De Belalcázar, Baltasar Maldonado, entered the territories of Tundama and offered him a peace proposal if he would surrender. Tundama, informed by the Spanish murders of zipa Tisquesusa and zaque Quemuenchatocha, did not accept and Maldonado attacked Tundama and his army on the island in Vargas Swamp, where 280 years later the Battle of Vargas Swamp by Simón Bolívar would be fought. Maldonado, enforced with 2000 yanakunas; indigenous prisoners of war from Peru and submitted people from Bacatá and Ramiriquí, was accompanied by the Muisca whose ears and hand had been cut off by Tundama. The Spanish conquistador with his superior weapons, cavalry and the inside knowledge of the earless Muisca killed 4000 guecha warriors of Tundama. Seeing this battle was fruitless, Tundama fled to Cerinza to ally with the cacique from there and prepared a new attack on the Spanish and indigenous troops, losing again. The caciques of northern Boyacá convinced Tundama to not fight anymore and Tundama surrendered to the Spanish troops. Maldonado demanded huge quantities of gold and emeralds to pay his loss to the Spanish. When handing over the valuables, Maldonado deemed the payments not enough and before the end of the year Maldonado killed Tundama with a large hammer.\nSpanish conquest in Muisca history\nEarly colonial period\nAfter the foundation of Bogotá and the installation of the new dependency of the Spanish Crown, several strategies were important to the Spanish conquerors. The rich mineral resources of the Altiplano had to be extracted, the agriculture was quickly reformed, a system of encomiendas was installed and a main concern of the Spanish was the evangelisation of the Muisca. On October 9, 1549, Carlos V sent a royal letter to the New Kingdom directed at the priests about the necessity of population reduction of the Muisca. The indigenous people were working in the encomiendas which limited their religious conversion. To speed up the process of submittance to the Spanish reign, the mobility of the indigenous people was prohibited and the people gathered in resguardos. The formerly celebrated festivities in their religion disappeared. Specific times for the catechesis were controlled by laws, as executed in royal dictates in 1537, 1538 and 1551. The first bishop of Santafé, Juan de los Barrios, ordered to destroy the temples of the Muisca and replace them with catholic churches. The last public religious ceremony of the Muisca was held in Ubaque on December 27, 1563. The second bishop of Santafé, Luis Zapata de Cárdenas, intensified the aggressive policies against the indigenous religious practices and ordered the burnings of their sacred sites. This formed the final nail in the coffin of the former polytheistic society.\nThe transition to a mixed agriculture with Old World crops was remarkably fast, mainly to do with the fertility of the lands of the Altiplano permitting European crops to grow there, while in the more tropical areas the soil was not so much suited for the foreign crops. In 1555, the Muisca of Toca were growing European crops as wheat and barley and sugarcane was grown in other areas. The previously self-sustaining economy was quickly transformed into one based on intensive agriculture and mining that produced changes in the landscape and culture of the Muisca.\nThe system of encomienda consisted of handing over terrains and indigenous people to the encomenderos. In 1553, 300 to 500 indigenous people were provided to the encomendero of Cota. The encomendero then had to pay tribute to the Spanish Crown.\nModern historical revisionism\nin Muisca society, especially their responsibility for the extraction of salt, giving the Muisca the name \"The Salt People\"]]\nIn modern anthropology studying the Muisca and the tales of the conquistadors, especially Gonzalo Jiménez de Quesada, whose writings are the only primary sources that survived, efforts have been made to revise the descriptions of the Muisca. The early Spanish chroniclers have written about cannibalism of various indigenous groups, stories that have later been refuted by experts. Also the idea that the Muisca were a war-like people has been revised in the modern age, pointing to their successful trading, that even the Spanish scholars, such as first bishop of Bogotá Juan de los Barrios, have praised in their writings. Various other researchers have taken caution in taking the early ethnographic accounts on the warfare status as unambiguously true. In early texts, the Muisca were described as having to pay tributes to the caciques, an idea explained to be misunderstood by anthropologist Carl Henrik Langebaek. All the conquistadors and later writers such as Pedro de Aguado, Pedro Simón, Juan Rodríguez Freyle, Juan de Castellanos and Lucas Fernández de Piedrahita were men, introducing sexism into the history books. Many modern archaeologists and anthropologists of the Muisca are female and have revised the role of the women in Muisca society, with Sylvia Broadbent, Ana María Groot, Marianne Cardale de Schrimpff and many others as notable examples. Also the description of the Muisca Confederation as a stratified empire has been revised, most notably by Jorge Gamboa Mendoza. The \"stone fortress\" that has been described in Cajicá by Spanish chroniclers may have been built after the conquest. Misunderstandings about the Muisca originated from the difficulties in language; the Spanish used indigenous translators taken captive on their route and brought along from the coast, introducing errors in the understanding of the Chibcha of the Muisca, that in many cases is very different from the other Chibchan languages. The word for \"one\" in Muysccubun is ata, while in the closest related Chibchan languages of Colombia \"one\" translates as úbistia (Uwa), intok (Barí) and ti-tasu or nyé (Chimila).\nAlso about the names of the zipa and zaque of the Muisca when the Spanish conquistadors arrived in Muisca territory; Tisquesusa and Quemuenchatocha respectively, doubts have risen after investigation in the 21st century. The names of the rulers have their origin in the work Elegías de varones ilustres de Indias written by poet Juan de Castellanos decades after the events of the conquest. The names of the rulers are possibly invented or modified by De Castellanos and taken over into later publications about the Muisca by authors such as Pedro Simón. Modern research, by Jorge Gamboa Mendoza among others, has revealed that when the Spanish troops were entering the territories of the Muisca, the Muisca frequently presented other individuals instead of the rulers to the invaders. This strategy was to protect the Muisca rulers and their valuables, of great interest to the Spanish who were in search of El Dorado. The modern anthropologists maintain that the names of the caciques were different; \"Bogotá\" for Tisquesusa and \"Eucaneme\" for Quemuenchatocha, whose nephew was called Quiminza.\nGamboa Mendoza mentions the omitting of information in the early Spanish chronicles about the participation of other indigenous groups and leaders in the conquest. What he describes as \"enemy\"; the cacique of Guatavita, allied with the Spanish to fight their own people.\nOne of the most important sources for the Spanish conquest of the Muisca, El Carnero, written by Juan Rodríguez Freyle, son of soldier Juan Freyle who served under conquistador Pedro de Ursúa, has been critically reviewed as a literary creative collection of stories, anecdotes and rumours, mixed with common opinions of the time.\nSee also\n*First American exploration\n*European colonisation\n:*Conquest of the Aztec\n::*Fall of Tenochtitlan\n:*Conquest of the Maya\n::*Guatemala, Petén\n::*Chiapas, Yucatán\n::*Honduras\n:*Colombia\n::*Chibchan Nations\n::*Muisca warfare\n::*Muisca toponyms\n:*Conquest of Peru\n:*Conquest of Chile\n:*Colonial Brazil\n* Viceroyalty of Peru\nNotes\nReferences\nBibliography\n*\n*\n*\n*\n*\n* Cobo Betancourt, Juan F. (2024). The Coming of the Kingdom: The Muisca, Catholic Reform, and Spanish Colonialism in the New Kingdom of Granada. Open access. Cambridge University Press.\n*\n*\n*\n*\n*Gamboa Mendoza, Jorge. Los muiscas y su incorporación a la monarquía castellana en el siglo XVI: Nuevas lecturas desde la Nueva Historia de la Conquista''. Tunja: Universidad Pedagógica y Tecnológica de Colombia.\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\nExternal links\n*  [https://www.youtube.com/watch?v=BDdtcYz_ME8 Animated video about the Spanish conquest of the southern Muisca]\n*  [https://www.youtube.com/watch?v=OtAsqL6KrSA Animated video about the Spanish conquest of Tundama]"
    }
  ]
}