{
  "content": [
    {
      "type": "text",
      "text": "# Spanish Republican Army\n\nThe Spanish Republican Army () was the main branch of the Armed Forces of the Second Spanish Republic between 1931 and 1939.\nIt became known as '''People's Army of the Republic' (Ejército Popular de la República'') after it was reorganized, following the disbandment of the voluntary militias that were formed in July 1936 at the beginning of the Spanish Civil War.\nHistory\nThe Spanish Republican Army went through two clear phases during its existence:\n* The pre-Civil War phase, before the coup of July 1936 that would fracture the Spanish military institution\n*The Civil War reorganization of the forces that remained loyal to the established republican government.\nBackground\nridiculing the Spanish Army that led to the attack of the Cu-Cut! head office]]\nFollowing the loss of Spain's last colonies, Cuba and Philippines, in 1898, the country's armed forces grew disgruntled and the public's view toward them worsened. Military leaders resented the attitude of the Spanish politicians and the public opinion who unjustly blamed the Spanish Military for the failures in the colonies. In November 1905 Spanish Army personnel stormed the offices of Catalan magazine Cu-Cut!, where En Patufet and La Veu de Catalunya were also located, for having published a caricature ridiculing the military.\nFollowing the attacks, the Captain generals of Sevilla, Barcelona and Madrid openly opposed the prosecution of those members of the military involved in the storming. This crisis led in 1906 to the approval of the Ley de Jurisdicciones (\"Law of Jurisdictions\"), which severely restricted freedom of expression in Spain by making speech against \"Spain and its symbols\"—the Spanish Armed Forces including themselves as one of the symbols— a criminal offence. According to renowned writer Salvador de Madariaga the Spanish Armed Forces became henceforward a \"State within the State\" that would interfere in civilian matters in an overbearing manner, becoming a major player in Spanish politics. Other Spanish intellectuals such as Miguel de Unamuno and Ramiro de Maeztu were seriously worried at the time about the future implications of the \"Law of Jurisdictions\". Unamuno openly expressed his concern that it would be left to the military to define what was correct regarding patriotism.\nThe \"Moroccan Question\" (), however, would be the main cause of the ensuing fractures in the political and social life in Spain. The disastrous wars in Morocco ended up bringing about severe social reactions in Spain that could no longer be silenced by means of the \"Law of Jurisdictions\". The Tragic Week protests in Barcelona in July 1909, which quickly turned anticlerical, were primarily the result of the unpopular Moroccan wars that \"merely satisfied the needs of the Military\" in the eyes of the public.\nThe consequence of such developments was that the division between the Spanish military and the Spanish people became deeper. The liberal traditions that the Spanish Army had spearheaded in the 19th century were replaced by a defensive, reactionary outlook. The mutual suspicion led to the creation of the Juntas de Defensa (Boards of Defence) during the 1917 Spanish crisis caused by the First World War. The Spanish military had an excess of officers, as much as 16,000 officers for 80,000 troops at one point and the economic crisis, coupled with a low pay, brought the problem of the economic hardships of military families to the fore. Allegedly the aim of the Juntas de Defensa was to defend the interests of Spanish military officers, but their intention to get involved in political issues was clear to the public. Finally on 13 September 1923, General Miguel Primo de Rivera made a successful coup d'etat. After overthrowing the parliamentary government he established himself as dictator with the tacit consent of King Alfonso XIII.\nThe General's dictatorship, however, did not solve the problems of the Spanish Armed Forces for the support of the military institution for General Primo de Rivera's move was not unanimous. Already in 1926 there was the first serious attempt of a coup, popularly known as La Sanjuanada (after St John), against the dictator in which four high-ranking generals —Valeriano Weyler, Domingo Batet, Francisco Aguilera and José Riquelme y López-Bago, as well as Colonel Segundo García and Lieutenant colonel Cristino Bermúdez de Castro— were involved. Besides the failed coup, the resistance of the Artillery branch of the Spanish Army to General Primo de Rivera's attempts to integrate and reorganize the Spanish military, created uneasiness within the ranks and in the face of the stubbornness of the Artillery officers in Pamplona, he had to declare Martial law (Estado de Guerra). Henceforward the Artillery officers would develop a pro-Republican stance.\nThe Second Spanish Republic was preceded by two pro-Republican coup attempts, the Jaca Uprising led by Fermín Galán and a rebellion of Air Force officers in Cuatro Vientos and Getafe air bases.\nThe first years of the Republic (1931–1936)\ntopped by the mural crown]]\nIn 1931, following the proclamation of the Second Spanish Republic, the armed forces of the Spanish Kingdom became the Spanish Republican Armed Forces. Admiral Aznar's casual comment: \"Do you think it was a little thing what happened yesterday, that Spain went to bed as a monarchy and rose as a republic\" became instantly famous, going quickly around Madrid and around Spain, making people accept the fact and setting a more relaxed mood. Republicans within the Spanish Armed forces were then a minority, but so were pro-monarchist reactionaries; the majority within the military were at first indifferent.\nWhat began to antagonize the Spanish Military against the new government were the reforms of the armed forces introduced by newly nominated Republican Minister of War Manuel Azaña within the first months of the newly installed republic. The officers of the Armed Forces resented that a man without a military background had been appointed to lead the War Ministry.\nLater in October the same year Azaña became Prime Minister and continued the reform of the bloated and old-fashioned military the Republic had inherited. This was seen as a necessary step with the goal to modernize the Spanish Military and cut down the expenses of the state in the aftermath of the Great Depression. In order to implement its reforms the Republican Government promoted to high posts military men that it perceived as loyal. As a result, it tended to display favoritism towards the branches of the Armed Forces more amenable to its reforms, the Air Force and, in a lesser degree, the Navy. Officers such as Gonzalo Queipo de Llano and Ramón Franco with a background in the pro-republican Jaca and Cuatro Vientos-Getafe uprisings during the monarchy rose to high posts for which they were not the most competent. In the same manner Spanish Republican Navy officers who displayed pro-republican fervor were rewarded with political posts.\nOn 10 August 1932 a pro-monarchist general, José Sanjurjo, staged a rebellion in Seville against the Republican Government. He led a group of officers opposed to the military reforms, as well as to the policy of granting autonomy to Catalonia and the Basque Country which they resented as an \"affront to the unity of Spain\". The rebellion failed and became popularly known as La Sanjurjada. General Sanjurjo was subsequently arrested and court-martialed. Initially he was condemned to death, but his sentence was later commuted to life imprisonment in Dueso. In March 1934 Sanjurjo was granted amnesty by the Lerroux government and went into exile in Estoril, Portugal.\nIn July 1936, five years after the proclamation of the republic, a section of the Spanish Republican Army in Spanish Morocco rebelled under the orders of General Franco. Although relatively more successful than the 1932 Sanjurjada, this rebellion succeeded only in fractioning Spain, with roughly half of the territory still loyal to the Republic. Instead of giving up or calling for a compromise, Franco began a bloody war of attrition, the Spanish Civil War.\nDuring the Civil War the part of the army loyal the Spanish republican government was forced to fight against the better equipped fraction of the army in revolt and their powerful Third Reich and Italian Fascist supporters.\nThe Civil War (1936–1939)\nAfter the partly successful coup of the pro-fascist generals in July 1936, militias were formed in many cities in Spain that had not sided with the rebellion lest the units of the Spanish Republican Army stationed in their territory be tempted to join the rebels. Finally in October the Republican government reorganized its armed forces around the military units that had remained loyal and the militias were merged with the new army.\nOctober 1936: First wartime reorganization\nThe government of the areas that had not joined the rebels, known as 'Victory Government' (Gobierno de la Victoria), quickly organized a 'Regular Popular Army' (Ejército Popular Regular) (EPR). Led by all the parties composing the Popular Front (Frente Popular), and by the trade unions Confederación Nacional del Trabajo (CNT) and Unión General de Trabajadores (UGT). The militias that had been hurriedly armed in the wake of General Franco's coup had been loosely coordinated by the Popular Front coalition. The new structure sought to impose a more effective coordination of the loyalist forces, for the Republican government had lost effective control of the armed units defending it.\nThe changes in the structure began on 16 October 1936, doing away with the War Ministry which was replaced by the 'National Defence Ministry' (Ministerio de la Defensa Nacional), led by the president of the republic, Largo Caballero. By means of this new structure, the Regular Popular Army unified all the branches of the military, including the Fifth Regiment, as well as all scattered militias, a process that was gradually implemented with the goal of completion by February 1937. By 30 October all Spanish males aged between 20 and 45 were being conscripted.\nThe restructuring of the Spanish Republican Army showed the Communist influence in the new discipline imposed by the Popular Front authorities. The new Republican People's Army instituted the Comisariado de Guerra by means of which political commissars were charged with the mission of lifting the morale of the troops and ensuring their cooperation with their high-rank officers in all units. The commissar had to overcome the mistrust of the troops towards the officers in order to achieve the necessary discipline for proper coordination.\nBased on a model that would replace the columns (columnas) and militias, the Mixed Brigade (Brigada mixta) was the basic military unit of the Republican People's Army. The first six Mixed Brigades were created on 18 October 1936. The first was led by Communist colonel Enrique Líster, the second by Jesús Martínez de Aragón, the third by José María Galán, the fourth by Eutiquiano Arellano, the fifth by Fernando Sabio and the sixth by Miguel Gallo Martínez. The reorganization included as well the XI and XII International Brigades joining the Republican People's Army in its combat. Anti-fascist volunteers from all over the world that joined the brigades were trained at Albacete.\nDevelopment of the war\nThe Spanish Republican Army units often lacked proper equipment. The situation improved somewhat by spring 1937, but a large proportion of units remained short of equipment and ammunition throughout the war.\nThe shortage of proper clothing, boots, weapons and ammunition was especially acute during the first months of the war, right after the reorganization. Priority, however, was given to ensure that the Republican troops received adequate food rations and that they received their salaries. Usually the latter were paid to the soldier's families in their homes.\nThe reorganization of the Spanish Republican Army was almost complete by mid-1937. Groups such as the Antifascist Worker and Peasant Militias, Milicias Antifascistas Obreras y Campesinas (MAOC), the militias of the Socialist Youth (Juventudes Socialistas Unificadas), the Communist Fifth Regiment, as well as the Anarchist militias were rallied under one banner and given proper military training. In places such as the Aragon Front, however, the Anarchist and minority Communist groups, such as the POUM, resisted what they saw as Communist-led \"militarization\". They distrusted the Communist leadership and perceived the move as an effort to force them to abandon their militia model, making them depend from a single central power, which was against their ideals.\nThe power and leadership of the Communists within the armed forces was promoted by the government of Juan Negrín and its Communist Party of Spain allies. The Soviet Union, profiting from the international isolation of the Spanish Republic imposed by the Non-intervention agreements, assisted the beleaguered Republican government chiefly by providing weapons. Despite the fact that the Soviet arms shipments were duly paid at high prices, the USSR used this opportunity to extend its power over the Spanish Republic. In April 1938 Socialist minister of defense Indalecio Prieto resigned in protest at the level of Soviet influence over the Spanish Republican Army.\nThe influence of the USSR was largely the consequence of the western democracies, like France, the United Kingdom and the United States not helping the young Spanish Republic. Fearing the \"Communist threat\", Neville Chamberlain and Léon Blum were ready to sacrifice Spain (as they later would sacrifice Czechoslovakia) in the belief that Adolf Hitler could be appeased. In the void thus created, only the Soviet Union helped the Spanish government effectively, but its assistance came at a high monetary cost. At the end of October 1936, three months after the rebels had been supplied with German and Italian weapons by Hitler and Mussolini, the first Soviet war supplies arrived to alleviate the lack of material in the loyalist side.\nThe People's Republican Army reached its highest level of organization in the Battle of the Ebro, during the last half of 1938, but it was also the battlefield where it was broken. Very young soldiers, averaging 17 and a half in age, whose unit was known as the 'Baby bottle conscription' (\"quinta del biberón\")  would be mobilized for this last big battle of the Civil War, the last one in which the International Brigades operated. These large war operations fulfilled the Communist propaganda goals promoted by Juan Negrín and his clique, but were disastrous and wasteful for the Spanish Republican Army, whose energy and organization would have been better employed in small-scale operations.\nFinal offensive and end of the war\nOpposed by high-ranking officers such as republican Catholic general Vicente Rojo Lluch, 'Stalinist' influence only abated right at the end of the Civil War with the creation of a National Defence Council (Consejo Nacional de Defensa) by Segismundo Casado, commander of the Central Army, and Julián Besteiro. But General Franco vehemently refused any compromise and wanted only total victory and the humiliation and disbandment of the Spanish Republic.\nThe Spanish Republican Army broke up towards the end of March 1939 when the Soldiers of the Republic surrendered their posts and weapons to the victorious Francoist armies. Many of them had to face immediately the firing squad, especially the professional officers and the volunteers, while the remainder were brought to concentration camps where some of them would be shot later, as their records would be checked. Among the members of the Republican Armed Forces who escaped, many were interned in concentration camps in Southern France, such as the Camp de concentration d'Argelès-sur-Mer which held about 100,000 defeated Spanish Republicans at a certain point in time. From there some managed to go into exile or went to join the armies of the Allies to fight against the Axis powers, while part of them ended up in Nazi concentration camps.\nFinally, there was a smaller group of men which scattered and hid in the mountainous areas of Spain, such as the Montes de Toledo, the Galician Massif, the Pyrenees and the cordilleras of the Iberian System. There they waged a guerrilla war with the Spanish Maquis, the last military units to fly the flag of the Spanish Republic, well into the 1960s.\nBattles of the Spanish Republican Army\n*Siege of Madrid\n*Battle of the Corunna Road\n*Battle of Jarama\n*Battle of Brunete\n*Battle of Guadalajara\n*Battle of Guadarrama\n*Battle of Mérida\n*Battle of Belchite\n*Battle of Teruel\n*Battle of Talavera\n*Battle of Badajoz\n*Battle of the Ebro\n*Battle of the Segre\n*Segovia Offensive\n*Siege of the Alcázar\n*Siege of Cuartel de la Montaña\n*Siege of Gijón\n*Aragon Offensive\n*Catalonia Campaign\nOrganization and structure during the Spanish Civil War\nFaced with a war situation the Republican Army based its organization in the mixed brigades (brigadas mixtas). Each of these was composed of four battalions. Every battalion included a number of companies. A regular brigada mixta would not exceed 3,000 men.\nAs the war unfolded, the Spanish Republican Army would include regiments, divisions, corps and field armies. Most of the foreign volunteer combatants would be part of the International Brigades' (Brigadas internacionales) own sections until they were asked to withdraw in order to satisfy the demands of the Non-Intervention Committee in the fall of 1938.\nMay 1937\nat the Tabar Museum in Navarra.]]\nIn May 1937 the Popular Army was structured in the following field armies in the territory that was still under its control:\n* Central Army (Ejército del Centro). It was the most well-disciplined and better equipped Army section of the Republican State. Hardened in the battles around Madrid, it had good supply lines.\n* Southern Army (Ejército del Sur). Located in the Andalusian and Extremaduran front. It was somewhat poorly organized and badly lacked in equipment and weapons. After the Battle of Málaga this front lost priority, which would give its troops a respite right up to the end of the war. It had about 60,000 troops.\n* Levantine Army (Ejército de Levante): Named after the Levante area. It included the frontline that went from the south of the Ebro till the border between Teruel and Guadalajara Provinces.\n* Eastern Army (Ejército del Este): A motley combination fighting in the Aragon front without specific loyalty to the Spanish Republican Government. Held together by their common Anti-fascist commitment, the Confederal Militias belonging to FAI and CNT, fought along with Catalan Nationalists and Communist militias belonging to the Unified Socialist Party of Catalonia and POUM. Their numbers were around 80,000 but they lacked coordination. George Orwell fought along the POUM Militias in this front, describing the mood of the place.\n* Northern Army (Ejército del Norte): It is difficult to establish that there was an actual Northern Army in the isolated northern zone of the republic. Technically it included the Basque Army Euzko Gudarostea of the Partido Nacionalista Vasco (PNV), as well as the so-called Asturian Army (Ejército de Asturias) and Cantabrian Army (Ejército de Cantabria), scattered units among which there were no links. To compound matters there were often internecine skirmishes between anarchist and socialist battalions, as well as against PNV soldiers. Even though the number of troops was relatively large, and despite their commitment to fight, the lack of equipment and the low quality of the available weapons hampered their effectiveness, which would lead them to be overwhelmed by the Nationalist armies before the end of the same year.\nDecember 1937\nTowards the end of 1937, after the loss of the Northern Zone, the structure of the People's Republican Army underwent some important changes, even though it kept the structure of the previous six months.\n* Central Army:\n* Extremaduran Army (Ejército de Extremadura):\n* Andalusian Army (Ejército de Andalucía):\n* Levantine Army:\n* Maneuver Army (Ejército de Maniobra): Designed to carry out the campaigns that had been planned by the Republican General Staff. It was a mobile army that was not specifically assigned to any front. It included the most loyal and experienced combat troops of the Republican Army, such as the V Army Corps led by Modesto.\n* Eastern Army:\nJuly–August 1938\n. 1938]]\nAfter the Spanish Republican territory was split in two in April 1938, there was an emergency reorganization of the military units that implied deep changes both in the structure as well as in the general distribution of the remaining battle-ready armies. Two army groups were formed:\nCentral Region Army Group\nThe Central Region Army Group, Grupo de Ejércitos de la Región Central (GERC), was an army group that gathered all the republican units that fought in the Republican Central Zone (zona centro). The GERC was led by Defence of Madrid hero, General José Miaja Menant. It was the most powerful section of the republican military that would endure until the 1939 surrender.\n{| class=\"wikitable\"\n! Army Corps !! Divisions !! Sectors\n|-\n| colspan=\"4\" style=\"background-color:#999;\" align=\"center\" | Central Army\n|-style=\"border-top:solid 3px #999;\"\n|-\n| I Army Corps || 1st, 2nd & 69th || Guadarrama – Somosierra\n|-\n| II Army Corps || 4th, 7th & 65th || Las Rozas – Usera – Carabanchel\n|-\n| III Army Corps || 9th, 15th & 18th || Jarama-Aranjuez\n|-\n| IV Army Corps || 12th, 17th & 33rd || Guadalajara – Montes Universales\n|-\n| VI Army Corps || 5th, 10th & 8th || Tajo – Jarama\n|-\n| Fourteenth Guerrilla Army Corps || – || Rear guard\n|-\n| colspan=\"4\" style=\"background-color:#999;\" align=\"center\" | Extremaduran Army\n|-style=\"border-top:solid 3px #999;\"\n|-\n| VII Army Corps || 36th & 37th || Algodor – Zújar\n|-\n| VIII Army Corps || 38th, 63rd & 51st || Zújar – Guadalmellato\n|-\n| colspan=\"4\" style=\"background-color:#999;\" align=\"center\" | Andalusian Army\n|-style=\"border-top:solid 3px #999;\"\n|-\n| IX Army Corps || 20th, 21st & 54th || Córdoba – Jaén\n|-\n| XXIII Army Corps || 23rd & 71st || Granada – Almería\n|-\n| colspan=\"4\" style=\"background-color:#999;\" align=\"center\" | Levantine Army\n|-style=\"border-top:solid 3px #999;\"\n|-\n| XIII Army Corps || 28th & 65th || Montes Universales – Albarracín\n|-\n| XVI Army Corps || 39th & 48th || Levante\n|-\n| XVII Army Corps || 19th, 40th & 25th || Levante\n|-\n| XIX Army Corps || 64th & 66th || Levante\n|-\n| XX Army Corps || 49th & 53rd & C || Levante\n|-\n| XXI Army Corps || 68th, 52nd & 6th || Espadán\n|-\n| XXII Army Corps || 47th, 70th & 41st || Levante\n|}\nEastern Region Army Group\nThe Eastern Region Army Group Grupo de Ejércitos de la Región Oriental (GERO), included the armies that were defending Catalonia that were still loyal to the Spanish Republic led by General Juan Hernández Saravia. It was more short-lived than the GERC, for this army group would be annihilated by the rebel forces during the Catalonia Campaign.\nIt was composed by the following armies:\n*Eastern Army, Ejército del Este.\n*Ebro Army, Ejército del Ebro. Built upon the  that had gathered all the Republican units that had become isolated north of the Ebro River when the republican territory was split in two. It fought the Battle of the Ebro\nThe following was the order of battle of the GERO in December 1938:\n{| class=\"wikitable\"\n! Army Corps !! Divisions !! Sectors\n|-\n| colspan=\"4\" style=\"background-color:#999;\" align=\"center\" | Eastern Army\n|-style=\"border-top:solid 3px #999;\"\n|-\n| X Army Corps || 30th, 31st, 34th || Balaguer-Segre\n|-\n| XI Army Corps || 26th, 32nd & 55th || Noguera Pallaresa\n|-\n| XVIII Army Corps || 27th, 60th & 72nd || General Reserve\n|-\n| colspan=\"4\" style=\"background-color:#999;\" align=\"center\" | Ebro Army\n|-style=\"border-top:solid 3px #999;\"\n|-\n| V Army Corps || 11th, 46th, 45th || Lower Ebro\n|-\n| XII Army Corps || 16th, 44th & 56th || General Reserve\n|-\n| XV Army Corps || 3rd, 35th &  42nd || Lower Ebro\n|-\n| XXIV Army Corps || 43rd & 62nd || General Reserve\n|}\nAeronáutica Militar\nbuilt for Aeronáutica Militar.]]\nThe Aeronáutica Militar was the aviation of the Spanish Republican Army. It had been established during the time of the monarchy through a Royal decree on 28 February 1913.\nAnother Royal decree published in the Gaceta de Madrid on 18 March 1920 led to the establishment of the first four air bases in Spain: the Getafe Air Base near Madrid, the Zaragoza Air Base, the Tablada Aerodrome near Seville and the León Military Aerodrome.\nOn 17 December 1913, during the war with Morocco, a Spanish expeditionary squadron of the Aeronáutica Militar led by Eduardo Barrón became the first organized military air unit to see combat during the first systematic bombing in history by dropping aerial bombs from a Lohner Flecha (Arrow) airplane on the plain of Ben Karrix in Morocco. During the years that followed, most of the warfare activity of the Aeronáutica Militar took place in Spanish Morocco.\nShortly thereafter the Aeronáutica Naval, the air branch of the Spanish Navy, already established through a Royal decree four years earlier, became functional in El Prat, in the same location as present-day Barcelona Airport.\nIn 1921, following the Spanish defeat at Annual, known as Desastre de Annual in Spain, the Zeluán Aerodrome was taken over by the Rif army and another aerodrome was built at Nador.\nLieutenant Colonel Kindelán was named Jefe Superior de Aeronáutica, becoming chief-commander of the Aeronáutica Militar in 1926, at the time when Spanish Morocco was retaken and the Rif War ended.\nIn 1930 a pro-Republican revolt in the Cuatro Vientos military aerodrome near Madrid was quashed. After the proclamation of the Second Spanish Republic in 1931, General Luis Lombarte Serrano replaced Kindelán as chief-commander of the Aeronáutica Militar, but he would be quickly succeeded by Commander Ramón Franco, younger brother of later dictator Francisco Franco. Captain Cipriano Rodríguez Díaz and Lieutenant Carlos de Haya González flew non-stop to Equatorial Guinea, then a Spanish colonial outpost.\nUnder Capitan Warlela cadastral surveys of Spain were carried out using modern methods of aerial photography in 1933 and the following year Commander Eduardo Sáenz de Buruaga became new chief-commander of the Aeronáutica Militar.\nFollowing a Government decree dated 2 October 1935, the Dirección General de Aeronáutica was placed under the authority of the War Ministry, Ministerio de la Guerra, instead of under the Presidencia del Gobierno, following which in 1936 the regional units became restructured. Accordingly, the Spanish Navy-based Escuadra model was replaced by Región Militar divisions which are still operative today.\nThe Aeronáutica Militar was merged with the air arm of the Spanish Republican Navy in September 1936, after the reorganization of the armed forces following the July 1936 coup, becoming part of the Spanish Republican Air Force.\nRanks\n]]\nIn the Civil War, and following the reorganization of the Spanish Republican Armed Forces, the five pointed red star became an insignia of Spanish Republican Army uniforms.\nThe new insignia mainly replaced the former eight-pointed and six-pointed silver stars that had been part of the Republican Army officers' uniforms between 1931 and 1936.\nOfficers\n{| style=\"border:1px solid #8888aa; background-color:#f7f8ff; padding:5px; font-size:95%; margin: 0px 12px 12px 0px;\"\n|- bgcolor=\"#CCCCCC\"\n|}\nUnit commander insignia\nThe republican forces of the Spanish Civil War used three-pointed stars were placed below the rank insignia of officers assigned to the command of units above the size of regiment. One star was used for a brigade, two for a division, three for a corps and four for the commander of an army.\nExamples:\n{| style=\"border:1px solid #8888aa; background-color:#f7f8ff; padding:5px; font-size:95%; margin: 0px 12px 12px 0px;\"\n|-\n|-\n|-\n|align=\"center\" rowspan=2| 50px\n(1936-1939)\n|align=\"center\" colspan=1|\n|align=\"center\" colspan=1|\n|align=\"center\" colspan=1|\n|align=\"center\" colspan=1|\n|- rowspan=\"2\"\n|align=\"center\" colspan=1|commander of a brigade\n|align=\"center\" colspan=1|commander of an army\n|align=\"center\" colspan=1|commander of a division\n|align=\"center\" colspan=1|commander of a corps\n|}\nOther ranks\n{| style=\"border:1px solid #8888aa; background-color:#f7f8ff; padding:5px; font-size:95%; margin: 0px 12px 12px 0px;\"\n|- bgcolor=\"#CCCCCC\"\n|}\nSee also\n* Abraham Lincoln Brigade\n* Background of the Spanish Civil War\n* Brigada mixta\n* Guardias de Asalto\n* Final offensive of the Spanish Civil War\n* La Retirada, Spanish refugees in France\n* Spanish Republican Armed Forces\n* Faustino Vázquez Carril\nBibliography\n*\n* Alpert, Michael. \"The Clash of Spanish Armies: Contrasting Ways of War in Spain, 1936–1939,\" War in History (1999) 6#3 pp 331–351.\n* Alpert, Michael.  The Republican Army in the Spanish Civil War, 1936–1939, University of Westminster, 2013,  (Spanish version available, published by Siglo XXI de España, Madrid, 1989 )\n*\n* Helen Graham, The Spanish Republic at War, 1936–1939, Cambridge University Press, 2002,\n* Jackson, Gabriel. Spanish Republic and the Civil War, 1931–1939 (1987)\n* Thomas, Hugh; The Spanish Civil War. Penguin Books. 2001. London\nSpanish\n* Michael Alpert, The Republican Army in the Spanish Civil War, 1936–1939, (Spanish version available, published by Siglo XXI de España, Madrid)\n* Bahamonde Magro, Ángel; Cervera Gil, Javier (2000). Así terminó la Guerra de España, Madrid: Marcial Pons, Ediciones de Historia. .\n*\n* Martínez Bande, J.M.; La lucha por la Victoria, Madrid : San Martín, 1990–1991, .\n* Martínez Bande, J.M.; Las Brigadas Internacionales, Plaza y Janés, Barcelona, 1973\n* Martínez Bande, J.M.; Por qué fuimos vencidos: Testimonios clave de la derrota del Ejército Popular de la República Coleccion Los Tres dados, Prensa Espanola, 1974.\n* Rojo Lluch, Vicente; Alerta a los pueblos. Editorial Ariel S.A., 1974 (1ª edición).  R\n* Rojo Lluch, Vicente; Así fue la defensa de Madrid. Editorial Asociación de Libreros Lance, Madrid, 2006.\n* Rojo Lluch, Vicente; España Heroica. Diez bocetos de la guerra española. Editorial Ariel, Barcelona, 1975\n* Salas Larrazábal, Ramón; Historia del Ejército Popular de la República. La Esfera de los Libros S.L.\n* Suero Roca, M. Teresa; Militares republicanos de la Guerra de España. Ediciones Península Ibérica, Barcelona, 1981.\nReferences\nExternal links\n*[https://4.bp.blogspot.com/_IxZRyJq15Sw/TJ-YOCGJX9I/AAAAAAAAC2g/9lGvG6UKe1s/s1600/img642.jpg Rank insignia of the Spanish Republican Army]\n*[https://1.bp.blogspot.com/_IxZRyJq15Sw/TK8wAW__Y3I/AAAAAAAADIk/SD7zgR0JGN8/s1600/img536.jpg Caps of the Spanish Republican Army]\n*[https://1.bp.blogspot.com/_IxZRyJq15Sw/TJ-apGrQwhI/AAAAAAAAC2w/L6LxagKJmjo/s1600/img644.jpg Sections of the Spanish Republican Army 1]\n*[https://1.bp.blogspot.com/_IxZRyJq15Sw/TJ-bLloan_I/AAAAAAAAC20/e0BNCBb0Sns/s1600/img645.jpg Sections of the Spanish Republican Army 2]\n*[http://www.armada.mde.es/ArmadaPortal/page/Portal/ArmadaEspannola/conocenos_historia/03_bandera_armada--10_republica_ii Armada Española – Segunda República (1931–1939)]\n* [http://www.guerracivil1936.galeon.com/ejrep.htm Spanish Civil War Website]\n* [http://www.militar.org.ua/militar/hm/historia-militar-espana-guerra-civil-brigada-ejercito-republicano.html Brigadas Mixtas of the People's Republican Army]\n* [http://www.robertopla.net/epr38/ Escalilla del Arma de Infantería Ejército Popular a 1 de julio de 1938]\n*[https://archive.today/20070515161306/http://www.terra.es/personal2/mas_jag/norte/ The Northern Front 1936 – 1937]\n*[https://memoriadealcublas.blogspot.com/2009/10/alas-rojas-sobre-alcublas.html Alas Rojas Sobre Alcublas]\n*[http://www.sbhac.net/Republica/Fuerzas/EPR/EPR.htm El Ejército Popular]\n*[http://sidbrint.ub.edu/ SIDBRINT: Sistema de Información Digital sobre las Brigadas Internacionales/Digital Information System on the International Brigades]"
    }
  ]
}