{
  "content": [
    {
      "type": "text",
      "text": "# Spanish–Taíno War of San Juan–Borikén\n\nAbeyAdelantado Camillas\"Alonso\"AymacoAymanioAymanio IIAzmiaCabuasCacimarCanóbana del CairabónCayeyComeríoCoxiguexGuamaníGuarianaGuarionexGuayaboaGuayamaGuayervasHuamayHuanicoyHumacaoJamaicaHayuyaLoquillo\"Luis\"MaboabantesMabodomocaOrocobixUrayoánYaucoYaureiboYogueras\n| strength1         = Several hundreds\n| strength2         = Several thousands\n| casualties1       = Hundreds\n| casualties2       = Unknown (most defeated Taínos were enslaved)\n}}\nThe Spanish and Taíno War of San Juan–Borikén, also known as the Taíno Rebellion of 1511, was the first major conflict to take place in Borikén, modern-day Puerto Rico, after the arrival of the Spaniards on November 19, 1493.\nAfter the death of Agüeybaná I, the Taíno high chief who struck the initial peace agreement with Spanish conquistador Juan Ponce de León in 1508, Agüeybaná II rose to power. Beginning his reign amidst native dissatisfaction with the encomiendas system and the acquisition of land territory that his predecessor allowed, the new leader soon formed a coalition that included several southern caciques, such as Urayoán, Coxiguex, Yauco, Jumacao, Loquillo, Orocobix, Guayama, and \"Luis\" among several others, and declared war on the European settlers. The first act of war carried out by the Taínos was the execution of Cristóbal de Sotomayor, a high-ranking Spanish officer, and the burning of his settlement. From this point onward, the conflict took place in stages, the first being an open confrontation where both sides clashed. Two such confrontations took place in 1511 with the Spaniards, led by Ponce de León, winning the initial confrontations despite the numeric advantage of the Taínos.\nThroughout 1512, Spanish commanders Juan Cerón and Miguel Díaz led a series of horseback incursions into the territory of the ruling Caciques, destroying their villages (known as yucayeques) and taking as many slaves as possible in the process. The ensuing Spanish counteroffensive was characterized by both political and economic motives, which would allow the mining of resources, such as gold, in their domains and the sale of natives as slaves. In March of that year, they focused on a cacique that they renamed \"Alonso\" in the central region of Otoao. During the following months, Humacao, Guayama, and Orocobix were targeted. On May 15, 1512, Juan Godínez led a new Spanish incursion against the Taíno. In total, the Spanish carried out 18 attacks against the Taíno during this year.\nIn early 1513, the conquistadores targeted the domains of Cociguex, Yauco, Abey, and the renamed \"Luis\", managing control of the region. The natives then employed guerrilla tactics, constantly moving throughout their offensives and moving in and out of Borikén/San Juan in canoes as necessary. The Taíno launched a counteroffensive from a base in the Daguao, in the eastern half of the main island, managing to burn down the Spanish capital of Caparra. In turn, Orocobix's domain was under siege for five consecutive months, from May to September. In September 1513, the conquistadores entered the domain of Hayuya twice. \"Alonso\" and Orocovis were also targeted. That same month, the Spanish made another incursion into Otoao. During that year, the local Spanish carried out 23 incursions against the natives, and viceroy Diego Colón ordered additional retaliatory attacks after the Taínos burned down the settlement of Caparra.\nBetween 1514 and 1515, the Spanish made advances into the Daguao, pushing the Taínos to seek refuge in the Lesser Antilles, with the presence of Agüeybana II being reported at Guadeloupe. The last report of a Taíno that could have been the High Chief was made in 1518, after which he disappears from the record. Attacks carried out by exiled Taínos and their associates from neighboring islands extended through the 1520s, finally stopping in 1529.\nBackground\nAgüeybana's domain\nThe royal family that ruled over most of Borikén, now known as Puerto Rico, during the pre-Columbian Taíno period used the honorific \"Agüeybana\" a title that was akin to \"High Chief\", which has been translated as the European concept of \"king\" in some English sources, and that also doubled as a family name. Although more common, Cayetano Coll y Toste's translation as \"The Great Sun\" is erroneous.}} The title itself carried notable sociological and communal connotations, with its holder being revered and given utmost respect among the population. The Agüeybana family lived in Cayabo, located in the southern region of the main island of Puerto Rico, an agriculturally fertile region, from which they coordinated military and political actions with the lesser caciques (in regions that ranged from the central area of Utuado and Orocovis to Arecibo, among others) scattered through the central, east, and west regions, as well as the islands of Vieques and St. Croix.\nThere were, however, signs that their domain was still in the consolidating stage despite being the oldest cacical alliance in the Caribbean (extending some 300–400 years before 1511) and the most important of Borikén, such as the presence of some independent caciques in the region. The caciques in the northeast had their own interests. Not counting political alliances and subordinate caciques, their personal domain extended from modern day began at the salt marshes at Ponce and extended through the mouth of the Jacaguas river and beyond, comprising the municipalities of Juana Díaz, Villalba, Coamo, Peñuelas, and Salinas. It is likely that their domain also covered a space left blank by the conquistadores when describing the political divisions of the southern coast, between the lands of caciques Abey and Yauco.\nEarly political relations\nAware of the events that had happened in the adjacent island of Hispaniola (previously named Kiseya by the native Tainos in the region) in the fifteen years since the Spanish first landed there, the caciques (a title akin to \"chiefs\") of Borikén tried different approaches. In 1508, Agüeybana I opted to welcome Juan Ponce de León warmly, after learning of the impending arrival from a group of caciques that had met the Spanish Conquistador in 1506. The negotiation process to meet the royal family took around a year and a half, with some caciques escorting him from Mona Island to the lands of Agüeybana, the Cayabo. Ponce de León found himself before the High Chief, his mother (and counselor) and her husband (actual relation to the cacique is unclear, but it could have been his father or stepfather), an uncle, two sisters, and a brother.\nAgüeybana offered to create a symbolic brotherhood with the Spanish through the ritual known as guaytiao, and joined Ponce de León along one of his sisters, while the other was bonded with nobleman Cristóbal de Sotomayor, who accompanied the Conquistador in this voyage. As part of the ceremony, this involved exchanged names and may have been the way in which the region would adopt the name of Ponce, while the cacique's mother became known as \"Ines\", his stepfather as \"Francisco\", while his uncle became known as \"Luis\". The Spanish in turn conferred the title of Don to all the men in Agüeybana's family. The royal family also agreed to collaborate with the Spanish on the encomienda system which allowed them authority of Taínos that were assigned to work for them (mostly members of the working naboría class, but also members of other classes under Agüeybana) while being introduced to Christianity, also allowing the Spanish to create Villa de Tavora within their domain. Acting as intermediary for the Spanish crown Ponce de León also asked, and was granted, a conuco (agricultural land and resources) to help sustain the settlers. In 1510, Agüeybana died and a process was executed immediately to transfer his powers to his younger sibling. In the 20th century, Salvador Brau erroneously asserted that the title of Agüeybana was the name of the older of the brothers, while the younger was named Güeybana.}} After the conucos were created, Ponce de León sold them to Sotomayor, who used the yuca to sustain Tavora.\nDespite being the one who inherited the rank of the chief cacique, Agüeybana II was not mentioned in the accounts where Ponce de León met the royal family, it remains unknown if this was due to already possessing the responsibilities of a cacique elsewhere or if it was because he opposed contact with the Spanish. He came to be known to the Spanish as \"Don Cristóbal\". His imposing figure was described by historian Juan de Castellanos, who noted that the entire island \"followed his voice\". Through his family connections, he joined a royal class that coordinated a political and economic web that extended to some parts of Hispaniola and some of the Lesser Antilles. The province of the cacique Cayacoa in Haiti was also known as \"Agüeybana\",  while the presence of another cacique that used the honorific was recorded at Saona (he was later renamed as \"Francisco\"), which along the use of distinctly Puerto Rican ceremonial clothing implies that part of the royalty in that island had been descended from the Borikén lineage during the Arawak expansion of the Antilles.\nChronology of the conflict\nDeclaration of war and early battles\nAlluding to a royal decree and at the demand of Juan Cerón, representative of viceroy Diego Colón, the newly crowned Agüeybana II was to be requested to assign 40 naboría Taínos to serve Sotomayor's Villa de Tavora. However, this initiative was complicated and instead, Taínos were brought from other islands, likely due to a refusal to comply or dismissal from the caciques. Nevertheless, unsatisfied with the fact that Ponce de León had been authorized a larger native workforce, Sotomayor ordered the intervention of the Spanish in settlements to bolster his workforce. The Taínos in these locations responded defensively, attacking the Spanish and causing them grievous injuries in the process. The caciques of the central zone were the first to hold reunions and to begin counter-attacks in the regions of Yahueca and Otoao, modern-day Adjuntas and Utuado.\nIn September 1509, Sotomayor bought Agüeybana's harvest following a campaign to gather gold. The Spaniard, considering the area designated by the elder Agüeybana to be too inhospitable, moved his settlement to the vicinity of a river. Sotomayor was named Chief Marshall by Ponce de León, and in late 1510 was informed by interpreter Juan González and Agüeybana II's sister that the Taínos had decided to declare war against him and that High Chief was personally tasked with carrying out his execution. The Spaniard opted to leave for Caparra and requested the assignment of guides and carriers from the royal family, marching northeast in parallel to Bucaná-Cerillos river. However, Agüeybana gathered a squadron of warriors and tracked Sotomayor, catching up to the Spanish and completing the task of executing him at Jauca river in modern-day Jayuya.\nSotomayor was succeeded by Juan Gil Calderón, right-hand man of Ponce de León, who was involved in the slave trade of Taínos and had received 150 natives from one of the lesser caciques under Aymaco, one of Agüeybana's subjects. The Spaniards then actively engaged the Taínos at Cayabo. It is assumed that the river now known as Descalabrado was the setting of the first battle of this campaign which took place in February 1511, where Ponce de León led nearly a hundred Spaniards in a battle where the Taíno retreated. On March 11, 1511, Ponce de León led another incursion into the domain of Urayoán at Yahuecas.\nOn March 23, 1511, Ponce de León wrote to the Monarchy informing them of his involvement in the battles of the first stages in the conflict. In July, Royal Secretary informed Juan Cerón and Miguel Diaz, who would replace Ponce de León political and military leaders of Puerto Rico, of the ongoing situation and issued a series of specific orders to try and qualm it. In it, the functionary orders them to take with them several well-armed and equipped men and to do what they considered necessary to suppress them, even applying Spanish laws in the trial of caciques and others involved in the conflict. The Spanish strategy also focused on eliminating the Taíno's means of transport and communication, taking away the existing canoes from the Taíno and being vigilant that no new ones were made.\nThe communication also notes that if the local population failed to surrender such as those of Hispaniola, the Spanish should declare an open war against them, offering the captured warriors mercy so that the others would be lured into a peace offering after which the native leaders would be sent to Hispaniola and converted into slaves in gold mines, where their servitude would serve as an example for future dissenters. The  Secretary concludes the communication urging the officials to replace the fallen caciques with more submissive ones so that the remaining Taínos would follow their lead. Royal letters addressed to Agüeybana II and 29 caciques, in which the Spanish Crown issued an ultimatum were transported in this voyage. At Hispaniola, viceroy Colón received orders to support Cerón and Díaz during this incursion.\nSpanish offensive\nDuring the months that followed, Ponce de León requested that a brigantine be built and brought from Hispaniola to counteract Carib canoes that were entering into Borikén/San Juan, marking the first mention of foreign natives becoming involved in the conflict. After receiving another report on the status of the ongoing conflict, he noted that only two caciques opted to accept a pardon offer made by the Spanish, with all of the others continuing their war effort. The Crown then addressed Cerón and Díaz, ordering them to take any belligerent Taíno as a slave but to keep them alive to meet their previous plan.\nOn January 12, 1512, viceroy Colón addressed the Catholic Church and noted that the ongoing war at Borikén/San Juan had obstructed the Spanish strategies due to a lack of volunteers. In this letter, the author also noted that some of the belligerent caciques had become more open to a peace process. The Taíno offensive frustrated the monarchy, who ordered Cerón and Díaz to rebuild a destroyed settlement at Añasco, from which they would carry out the mining of gold and resources from the Otoao. Ponce de León continued the offensive and its slaving effort, branding the captured ones in the forehead on behalf of the Crown before selling them.\nEmploying canoes, Agüeybana's faction was in constant communication with other Taínos in both Hispaniona and some of the Lesser Antilles, in particular the island of Ay-Ay, now known as St. Croix. Miguel Díaz found a group of them at Trinidad, while Ponce de León invaded St. Croix and Guadalupe to retrieve more. Locally, Guarionex and Aymaco, two prominent caciques of the Otoao region, died during an attack on Aguada. In the region, the conflict continued under the leadership of a cacique renamed as \"Alonso\" (also regarded as a Don by the Spanish) for the following two years. During this stage of the conflict, the southeastern half of Puerto Rico was not thoroughly occupied, allowing Taínos on the run an escape route.\nIn February 1512, Cerón ordered another incursion into the lands of \"Alonso\". Three months later, Hernando de la Torre targeted Orocobix. On June 10, 1512, Álvaro de Saavedra entered into the lands of Guayama. Two days later, the Spanish breached the domain of Agüeybana II, with Gil leading the horseback attack and carrying back a couple of natives who were sold as slaves. Later that week, Gil and Luis de Añasco led two horseback slave hunts in Agüeybana II's domain. Juan López did the same. The captured natives were then auctioned at Villa San Germán, whose residents had grown increasingly interested in the royal terrains. Juan Godínez and Antón Cansino led similar incursions during this time. Cerón concluded the month by entering the lands of Orocobix. In July, Gil attacked the domain of Agüeybana II. On August 10, 1512, he led another incursion into the terrains of Orocobix. This was followed by a hiatus that extended for half a year.\nTaíno counter-offensive\nThe arrival of 1513 registered an increase in the Spanish population, fueling the expansion of the nascent colonial government and its mining operations due to the discovery of new deposits in the terrains of Loquillo. However, the years of conflict abroad had diminished the quantity of working men available for the task, shifting the focus to ending the war and employing the Taíno as a workforce. In the process, the Spanish dropped the ecomienda system in practice, instead allowing an unsanctioned form of slave trading. The inhabitants of the Lesser Antilles were also targeted in these initiatives, under the premises that they were involved in the violence at Borikén/San Juan. On December 23 of that year, the Crown issued a decree legalizing the unbound slavery of local natives found in the Lesser Antilles under this classification, based on their alleged role in the death of Sotomayor. In the process, the caciques of the adjacent island of St. Croix, where a group of local Taínos had left for refuge, who had been under the service of Ponce de León before the conflict were re-classified as \"Caribs\" to circumvent the ecomienda and facilitate their capture as \"foreign\" natives.}} This also allowed for the importation of slaves from any of the other Lesser Antilles utilizing this as justification. Despite the assertions that the Caribs were heavily invested in the conflict, none of the caciques captured were identified with that particular ethnic group. Another Spanish initiative was the removal of the children of caciques citing religious reasons, but which disrupted the chain of succession.\nIn January 1513, the Spanish began a new offensive, targeting the caciques on the southwestern coast. Diego Guilarte de Salazar was then able to set camp at Guánica and the Spanish rebuilt San Germán and began processing mined gold, supplied with a large contingent of natives captured both locally and at the Lesser Antilles. On March 15, 1513, Guilarte de Salazar attacked Yauco and Coxiguex. The following month, Sancho de Arango captained an incursion against Coxiguex.\nIt was then presumed that the belligerence in the south and central regions had been silenced, with some caciques entering peace with the Spanish. However, the Taínos mounted a counter-offensive led by the High Chief, taking refuge at Daguao (the southeastern and coasts, comprising the municipalities that run from modern-day Humacao to Luquillo such as Fajardo, Ceiba, Río Grande, and Naguabo) which due to its inhospitable terrain complicated the incursions of the conquistadores. In one of the confrontations that ensued in this region, a Spaniard named Juan González, identified the presence of Agüeybana II and noted that he had left the battlefield safely. The colonial governor then ordered the assembling of 200 men to prepare an offensive in the region.\nAgüeybana II's faction, fortified with the arrival of caciques and natives from St. Croix and other Antilles, targeted the dispersed Spaniards that had ventured into the region in search of gold and work hands. The Taínos also attacked a female cacique known as \"Luisa\", who had allied with the Spanish and killed her along with two individuals identified as Garci Fernández and Pedro Mexía. The cacique Cacimar of Vieques was also killed in the exchange. A similar attack was carried out at Salinas, where the Spanish ally \"Isabel\" (Cayaguax) was targeted.\nAgüeybana II's coalition was still in command of some 2,000 Taínos. The belligerent caciques planned an attack against viceroy Colón while the functionary was on the move, but the idea was aborted after the Spanish learned of it at Manatí. The most damaging attack of the Taíno offensive during the first half of 1513 was against Caparra, then the Spanish capital of the main island. Vicente Murga estimated that the attack in question took place sometime during viceroy Colón's visit to San Germán, which began on June 2 and ended on July 31. Accountant Antonio Cedeño places the attack taking place inspiring.\nEight belligerent caciques led a force of around 350 men from their alliance and burned down the settlement, killing 18 Spaniards and took with them around 4,500 pesos worth of gold, while the remaining settlers fled into Ponce de León's residence. A group of Taínos that was captured after the attack confessed that Agüeybana II had led the attack from his base at the coast of Daguao and revealed that other caciques were tasked with burning the terrains of more Spanish and killing their livestock to damage their resources. This allowed the conquistadores to ambush the returning warriors while they celebrated in a camp near the northeastern coast. A Spaniard named Juan González noted the presence of Agüeybana II himself among these natives. In total, over 30 buildings were destroyed in the fire, including the Church (and the Bishop's house), a monastery, and a building where gold was processed.\nViceroy Colón reacted by sending additional reinforcements to Caparra, ordered the construction of a new settlement near the enemy headquarters, and led a widespread attack against the Taíno. In this offensive, the caciques Guayervas, Mabo, Yabey, Cayey, Guariana, Guayaboa, Guayama, Hayaurex, Baguanamey, and Yauco, were detained on suspicion of participating in the attack and sent to Hispaniola. The Spanish carried out executions and torture against other Taínos in Daguao and Virgen Gorda. In the retaliation that followed, Orocobix was heavily targeted, with his lands being attacked by Francisco Vaca on July 10 and Pedro Dávila on July 19. Within days, Juan Enríquez led an attack on the Daguao. Marcos de Ardón would continue the offensive on August 10, 1513, a week after Cerón had managed the capture of five natives. Diego Colón and Juan González also entered the lands of Guayaney. The second would be involved in incursions at Virgen Gorda and the modern-day Humacao and Luquillo rivers in August.\nOn September 2, 1513, Pedro de Espinosa attacked Orocobix. Within a week, Juan López entered the terrains of \"Alonso\". On September 13, 1513, Marcos de Ardón resumed the offensive against Orocobix. At the Otoao, the subjects of the caciques Bairex, Aymaco, and Guayervas were reassigned among the Spanish, who built a hacienda in the zone. On September 17, 1513, Alonso de Mendoza entered into the lands of Hayuya. Later that month, Luis de Añasco would continue the offensive. October began with another incursion against Hayuya, this time led by Alonso Niño. That same month, Cristóbal de Mendoza led an incursion that intended to eliminate the population of Vieques.\nDaguao and exile of the Taíno\nThe incursions continued into 1514, with the Spanish mining activity focused on the Cordillera Central, efforts continued to eliminate resistance in this region. The year began with an incursion led by Jerónimo de Merlo into lands prospected by the viceroy to create a settlement. On July 26, 1514, an attack by the belligerent natives came near Caparra, before being defeated and sentenced. Two months later, another attack by some 300 members of the coalition came near Caparra and later injured cacique Cacibona, a Spanish ally, at modern-day Loíza. During this timeframe, one of the belligerent caciques that had been charged with killing two Spaniards was pardoned and joined the Spanish. The stability of the main island was further compromised by the first insurrection of African slaves. The year closed with an increase of Spanish slaving ships bringing more workforce, as part of initiatives led by viceroy Colón.\nIn 1515, caciques Humacao, Daguao, and Loquillo led another offensive. A cacique identified a nephew of Agüeybana II, was involved in peace negotiations but after failing to meet the demands of the Spanish, was targeted as well. The contemporary reports placed the High Chief present in the domain of Humacao and Loquillo. During the events that unfolded this year, future Factor of Puerto Rico Baltasar de Castro was active, later noting that the forces of  Daguao and Agüeybana were aided by the arrival of some 150 natives in canoes, for a total force of around 400 that were confronted by the Spanish near the modern-day Luquillo river.\nIn March 1515, Gil noted in correspondence to Hispaniola that a slaving armada under his command had cornered Agüeybana II in the adjacent islands, likely as part of the local Taíno community that had moved to Guadeloupe. The High Chief disappeared from record shortly afterward. Two months later, Ponce de León led an incursion on the island, where the Spanish were ambushed by a contingent of natives and retreated. Towards the year's end, Humacao and Daguao led a final offensive, before surrendering in 1516. The Taíno continued exploiting the northeastern coasts to flee the Spanish and go into exile. Despite the advance of the mining operations in the former terrains of Loquillo and Humacao, reports of Spanish casualties continued into 1517, when the conquistadores noted that about a third of the natives were still belligerent. In 1518, the Spanish made an incursion to capture a high-ranking Taíno identified as \"Cristóbal\" in the Daguao, which may have been a reference to Agüeybana II himself, who had been known under that name before the conflict. The High Chief is not mentioned in further documentation, his fate is left unclear.\nThe associated attacks against the European settlements continued into the 1520s, with natives arriving by canoe, killing as many Spanish as possible, and leaving afterward with freed Taíno and African slaves. Such incursions were reported in 1520, 1526, and 1528, with one last attack recorded in the haciendas of Daguao in 1529. Then, after two decades had passed since the events that began the conflict, the offensive suddenly halted.\nHistorian accounts and narrative progression\nPonce de León's testimony\nThe Crónicas de Indias (Spanish for \"Chronicles of the Indies\"), which narrates the Spanish perspective of Agüeybana II's reign and the conflict contains several contradictory accounts. These accounts reflected the political tendencies of those involved and in the case of Gonzalo Fernández de Oviedo y Valdés, included accounts directly relied by Ponce de León and other individuals that were directly in conflict with the cacique. According to this author, during the insurrection all of the caciques killed the Spanish that were found within their lands. Guarionex, working under orders from Agüeybana II, burned the village of Sotomayor while the High Chief executed the conquistador himself. Fernández claims that at over 3,000 Taínos were drafted and that at least 80 Spaniards were killed, with survivors fleeing towards Caparra and other northern settlements. Ponce de León then sent Miguel del Toro and 40 men to recover Sotomayor's body, which had been buried with little respect under orders of Agüeybana II. The Spanish reburied the corpse and, according to Fernández, declared war on the Taínos. Consequently, Ponce de León organized three units of 30 men and assigned them to Toro, Diego de Salazar and Luis de Almansa.\nThe Spanish then led an incursion into the domain of Agüeybana II, being led by the colonial governor himself. Fernández does not specify if the High Chief was present in the battle or the classes of Taínos that were involved, but boasts that many were killed. Ponce de León then commanded his troops to return to Caparra and regroup. From there, the Spanish planned another incursion in the domain of Aimaco, one of Agüeybana II's subordinates, sending two captains in command of 50 men. However, the conquistador was confronted by cacique Mabodomoca and about 600 Taínos. According to Fernández, the Spanish led by Salazar won a battle held somewhere near modern-day Moca and San Sebastián, causing some 150 casualties on the native forces. In this battle, an unmanned cacique is said to have been killed in combat against two Spaniards, including a soldier named Juan de León. The following battles were carried out in the domain of Yahueca, where cacique Urayoán. It is here, that Fernández places the pivotal battle of the war, where Ponce de León led a group of 80 Spaniards in battle against more than 11,000 Taínos. According to the author, the tide if the conflict was not settled until a particular, yet unnamed, Taíno leader was killed in the crossfire, with all of the others losing their morale and retreating from combat. Fernández does not enter in more detail about the other battles held in the Puerto Rican mainland, only emphasizing the battle of Vieques after this point.\nDerivative reinterpretations\nAnother Spanish author, Juan de Castellanos, offers a romanticized version of the events, where both Ponce de León and Agüeybana II rallied their troops and portrays the Spaniards as heroes and the Taínos as villains in traditional dramatic format. This author, however, places Agüeybana II in the main battle and claims that an ambush by Ponce de León was responsible for the success. Castellanos raised the amount of Taínos present to 15,000 and granted Juan González a role in spying on the enemy. The author also recycles the figure of Juan de León, claiming that he was the one responsible with killing the mysterious cacique, which he identifies as Agüeybana II himself citing the reaction of the Taínos to his death. Castellanos concludes his account here, depicting Ponce de León as issuing an order not to pursue the retreating natives and claiming that this was the end of the war, omitting subsequent battles.\nFrancisco López de Gómara introduced the idea of an alliance between Taíno and Caribs in his Historia General de las Indias. The first royal historian tasked with gathering the history of the colony was Antonio de Herrera y Tordesillas, more than a century after the conflict. However, his own account is based on both Oviedo's estimates or locations (placing the battle at Yahueca) and Castellanos' narrative, giving widespread distribution and acceptance to the romanticized accounts of the events. In 1788, Fray Íñigo Abbad y Lasierra published the first revision of his History of Puerto Rico. However, the local distribution of this work suffered both political and intellectual hindrances, with a heavily edited third revision finally reaching the local historians during the late 19th century. Like his predecessor, Abbad y Lasierra depended heavily on the accounts of Oviedo, Castellanos and Herrera, repeating the claim that Juan de León had killed Agüeybana during a final battle.\n19th and 20th century historians\nIn 1827, American historian Thomas Southey wrote about the topic in Chronological History of the West Indies, being the first to note that Gil had cornered Agüeybana II at Guadeloupe. Following a renaissance of the local interest and accessibility in historic sources, the 19th featured several new works discussing the early history of Puerto Rico, beginning with 1854's Biblioteca Histórica de Puerto Rico. Authors like José Julián Acosta, Salvador Brau, Agustín Stahl, José María Nazario y Cancel, Cayetano Coll y Toste and Luis Llorens Torres published their own accounts of precolonial events while immersed in heavy censure by the colonial government. Brau in particular, disregarded both the impact of the conflict and the reputed bravery of the Taíno, noting his belief that they were \"unworthy of historic immortality\" and argued that the subsequent orders to counterattack the caciques were due to a communication delay because Agüeybana II was already dead. This author also noted his belief that there had been some sort of alliance between Taínos and Caribs. Brau also argued that the cacique known as \"Alonso\" by the Spanish had died in 1511, despite the chief being named in subsequent Spanish communiques. However, this also led to the creation of a narrative that mixed all of the previous authors in a derivative narrative, which perpetuated the claims surrounding the death of Agüeybana II and the resolution of the conflict for future historians.\nA parallel school led by Spanish-born historians opted instead to diminish the role of the Taínos in Puerto Rico while exalting Ponce de León, making sparse mentions of Agüeybana, mischaracterizing them as docile and instead giving more prominence to the Caribs in their narrative, also claiming that the belligerent army was mostly composed by them. Following the Spanish–American War, Brau's narrative of the events gained traction in the new colonial government due to his promotion as \"Official Historian of Porto Rico\" by appointed governor Hunt. This, in turn, led to the supposed early death of Agüeybana II and the purported docile nature of the Taínos being reprinted in H.A. Van Middleldyk's English-version of the history of Puerto Rico. Paul Miller, who wrote a similar book years later, instead claimed that Agüeybana II was \"blinded with rage\" and was easily gunned down in a reckless attack.\nDespite having more access to sources, mid-20th century historians continued the proliferation of a Spanish-centric narrative. This was in part due to the upcoming Fifth Century celebrations, but also likely due to a reactionary and conservative stance adopted by the government due to the Puerto Rican Nationalist Party revolts of the 1950s, which led to downgrading any narrative that may incite insurrection. Instead, the pacifist approach of Agüeybana I was promoted, while the role of Agüeybana II was reduced to that of a leader that died early in the campaign and costed the war to the Taíno. In this narrative, previously published by Salvador Brau, the other Taíno's were described as \"cowardly as the Aztecs that were killed by Cortés at Otumba\", and as surrendering as soon as their leader fell. Likewise, the Caribs were given prominence and the myth that they were cannibals was used to create a dichotomy.\nThis pattern transcended the political ideology of the historians involved during this time. The Institute of Puerto Rican Culture (ICP) was among the institutions that adopted the Brau-inspired narrative and aided in dispersing it in its work. During the 1950s and 1960s, Salvador Tío emerged as a dissenting figure and argued the importance of references made to Agüeybana II in Spanish documents that were dated after 1511. During this time, Veicente Murga also brought a series of documents from Spain, in which the attack at Caparra was revealed. He, along Ricardo Alegría and Álvaro Huerga, assumed that the attack was carried out by Carib forces, but eyewitness accounts, a Taíno confession and the testimony of those involved in the defense of Caparra, such as Francisco Juancho, blame the belligerent caciques. Towards the century's end, Francisco Moscoso published La Conquista Española y la Gran Rebelión de los Taínos after analyzing several documents at the University of Puerto Rico's Centro de Investigaciones Históricas (Spanish for Center of Historic Investigations), marking another departure from the common narrative.\nAftermath and legacy\nPolitical redistribution\nIn 1514, Ponce de León delineated the political division that he would recognize, which separated the main island of Puerto Rico in two and ignored the authority of the caciques, assigning the Cayabo to the jurisdiction of San Germán. The lands that once belonged to Agüeybana were reassigned to the Spanish high class of that villa. For some time after these events, the Cayabo retained its name, which was used in conjunction with Agüeybana's. It was systematically reduced and eventually, only a barrio of Ponce would preserve the name. El Cayabo was later transferred to Juana Díaz. The length and risks faced by the Spanish during this war were noted by veterans such as Martín Hernández of Caparra. Others, like accountant Antonio Sedeño, discussed how destroying the conucos at Otoa played a key role in limiting the resources of the belligerent caciques and diminishing their organization.\nThe violent interaction between Spanish and Taínos continued, with native women opting to commit suicide before giving birth to the children of rapists and cases of mass suicides being recorded in close groups. According to the Spanish, Agüeybana II reportedly earned a heroic reputation among the Taíno as the \"Christian killing ruler\". The exile continued, despite slaving incursions in the Lesser Antilles. Those that settled at Guadeloupe and carried further attacks against the Spanish went on to be classified as \"Caribs\". The Taínos that worked for the Spaniards at Mona Island were later involved in aiding French smugglers, costing the conquistadores economic losses in the region.\nWith the discovery of new mines in 1516, a large number of Spaniards relocated to the Daguao, where they also captured some of the remaining Taínos and escaped African slaves. In 1519, a Commission Judge was sent to certify the ethnical identities of the natives that had been sold as slaves under the classification of \"Caribs\", given the ambiguity in which they had been gathered and mixed. After Bartolomé de las Casas declined,  the office was given to Rodrigo de Figueroa. In 1992, Irvin Rouse revisited the issue and reclassified the pre-colonial inhabitants of St. Croix as oriental Taínos, noting that they were culturally part of the Puerto Rican circle.\nBetween 1529 and 1530, the local population, both Spanish and Taíno, were heavily impacted by the passing of at least three hurricanes. This, combined with a previous plague that the natives were unprepared to overcome, diminished their role in the colonization's heavy work, which was now progressing to plantations and moving away from mining, in favor of more African slaves. During the 1540s, the capture of natives of any locale was prohibited by the New Laws.\nSociocultural impact and commemorations\nDuring the 19th century, a campaign to diminish the impact of Agüeybana II's figure was carried out in official sources. A counterculture rose among the pro-independence literature, which identified the rural population as \"sons of Agüeybana El Bravo\" and urged them to reveal as he once did. A seminal example of this was Daniel Rivera's 1854 work Agüeybana, el bravo, the earliest example of a pro-independence poem recorded locally.  This turn of events converted the cacique into the first symbol used by the Puerto Rican independence movement.  This trend continued during the 20th century, with Luis Llorens Torres and Juan Antonio Corretjer continuing emphasizing the role of the cacique in their work as part of an attempt to bring it into the collective consciousness. However, this interest also led to the mythification of the figure being accepted as fact, with fictional accounts of his relationship with his sister or his motivations for attacking the Spanish becoming widely spread through the work of authors Alejandro Tapia and Cayetano Coll y Toste. An uncritical adoption of these fables led to this perception becoming widespread in the work of historians entering into the 20th century.\nOf those involved in the battle, the local authorities made efforts to recognize the fifth centenary of Ponce de León's birth in 1974. In 2011, the IPC organized a symposium to discuss the Fifth Centenary of the conflict, where academics exposed their various perspectives of the events. The Numismatics Society of Puerto Rico minted a medal commemorating the event, illustrating a cacique and several natives in combat which was based on the narrative of Ricardo Alegría. A number of the Taínos involved, have been homaged in monuments, including Agüeybana II who has a statue in his honor at Ponce.\nReferences\nNotes\nCitations\nBibliography\n*\n*\n*"
    }
  ]
}