{
  "content": [
    {
      "type": "text",
      "text": "# Spanish battleship Pelayo\n\n{|\n|Ship original cost=\n|Ship yard number=\n|Ship way number=\n|Ship laid down=April 1885 or February&nbsp;1886 (see&nbsp;text)\n|Ship launched=5 February 1887\n|Ship sponsor=\n|Ship christened=\n|Ship completed=3 June 1888\n|Ship commissioned=8 September 1888\n|Ship recommissioned=\n|Ship decommissioned=1 August 1924\n|Ship in service=\n|Ship out of service=\n|Ship renamed=\n|Ship reclassified=\n|Ship refit=\n|Ship struck=\n|Ship reinstated=\n|Ship homeport=\n|Ship identification=\n|Ship motto=\n|Ship nickname=Solitario (\"The Individualist,\" \"The Solitary One,\" or \"The Lonely One\")\n|Ship fate=Scrapped 1926\n|Ship notes=Disarmed 1923\n|Ship badge=\n}}\n(standard)\n* (full load)\n|Ship length=\n|Ship beam=\n|Ship depth=\n|Ship draft= maximum\n|Ship power=* (forced draft)\n* (natural draft) on trials\n|Ship propulsion=*As built:\n*Two vertical compound steam engines, 12 return-tube boilers, two shafts, 800 tons coal\n*1897–1898:\n* 16 Niclausse boilers\n|Ship sail plan=*As built:\n*(quickly removed)\n|Ship speed=*As built:\n* (forced draft)\n* (natural draft) on trials\n|Ship speed after reboilering (1898)=16 knots\n|Ship range=\n|Ship endurance=\n|Ship complement=520\n|Ship armament=*(1888 as built)\n* 2 ×  guns\n* 2 ×  guns\n* 1 ×  gun\n* 12 ×  guns\n* 5 × 6&nbsp;pounder (57-mm) Hotchkiss quick-firing guns\n* 14 × machine guns\n* 7 ×  torpedo tubes\n* (1898 as reconstructed)\n* 2 ×  guns\n* 2 ×  guns\n* 9 ×  guns\n* 5 × 6&nbsp;pounder quick-firing guns\n* 14 × machine guns\n* 6 ×  torpedo tubes\n*1910:\n*All torpedo tubes removed\n|Ship armor=*Creusot steel\n* Belt\n* Barbettes\n* Shields\n* Conning tower\n* Deck\n* Midships battery unarmored as built;  Harvey armor after 1897–1898 reconstruction\n|Ship notes\n}}\n|}\nPelayo was a Spanish Navy battleship in commission from 1888 to 1924. She was Spain's first battleship and the most powerful unit of the Spanish Navy at the time she entered service. As a capital ship of unique design and capabilities and the only Spanish battleship to enter service prior to the dreadnought  in 1914, Pelayo posed a problem for the Spanish Navy, which had difficulty finding a tactical role for her. In her early years, however, she gained great popularity as she played a significant role in representing the Spanish Navy at important naval and international events. She supported Spanish operations during the First Melillan campaign in 1893–1894. During the Spanish-American War in 1898, she took part in an abortive sortie to the Philippines, but returned to Spain without seeing action in the war. She later fired her guns in anger for the first time during the Second Melillan campaign in 1909, and she subsequently participated in the Kert campaign in 1911 and 1912 and in bombardments of the coast of Spanish Morocco in 1913.\nPelayo was named for Pelagius of Asturias (ca. 685–737), a nobleman who founded the Kingdom of Asturias and is credited with initiating the Reconquista, the Christian reconquest of the Iberian Peninsula from the Moors, traditionally dated to have begun with the Battle of Covadonga (c. 718 or 722).\nTechnical characteristics\nin&nbsp;1896.]]\nPelayo was a barbette ship, an ancestor of the modern battleship with the main battery mounted in open barbettes on armored rotating platforms, in contrast to heavy self-contained gun turrets. Her design was based on that of the French barbette ship , modified to give her a draft that was  shallower so that she could transit the Suez Canal at full-load displacement. She displaced 9,900 tons and was  in length,  in beam,  in depth, and  in draft. She had a crew of 630 men.\nPelayo′s main guns could be loaded in any position, and consisted of two Gonzalez Hontoria-built  Canet guns mounted fore and aft on the centerline and two Gonzalez Hontoria  guns, also in barbettes, with one mounted on either beam. Her lone  gun was a bow chaser. She also was armed with twelve  guns, six on each side, three 57-millimetre Hotchkiss quick-firing guns, thirteen 37-millimetre revolvers, four machine guns, and seven  torpedo tubes.\nPelayo had two funnels. Her propulsion system consisted of 12 boilers and two vertical compound steam engines driving two screws. On trials, she achieved  under forced draft and reached . She could carry 800 tons of coal. She originally was equipped with  of sails, but they were deleted soon after her completion and her rigging was replaced by two military masts.\nPelayo had Creusot steel armor. Her belt armor was  wide amidships and extended  above and almost  below the waterline; it ranged in thickness from . Her barbettes had from  of armor, while her gun shields had , her conning tower , and her deck . Internally, she had French-style cellular construction with 13 watertight bulkheads and a double bottom.\n)]]\nPelayo was originally intended to be the first of a new class of battleships, but a crisis with the German Empire in the Caroline Islands in 1890 led to the cancellation of these plans and the diversion of funds to the construction of the  armored cruisers. Pelayo was viewed as too slow and having too little steaming endurance for colonial service; moreover, battleship designers abandoned the barbette ship concept in the 1890s, and she ended up as the only member of her class.\nPelayo was the only battleship in the Spanish fleet until the entry into service of the dreadnought battleship  in 1914, and her unique design and capabilities made it difficult for the Spanish Navy to plan for her tactical employment, as she had no capital ships of similar capabilities with which to operate. During her operational life, the Spanish Navy made plans to organize a division made up of Pelayo and the old armored frigates  and , but the armored frigates were old and in poor condition, and the plans were dropped. After Spain began to commission her first dreadnoughts in 1914, the Spanish Navy planned to organize a division around Pelayo, but by then Pelayo herself was too old and in too poor of a condition, and these plans also were scrapped.  As a result of her unique design and the difficulty of operating her with other ships, the Spanish Navy nicknamed her \"Solitario\", meaning \"The Individualist,\" \"The Solitary One,\" or \"The Lonely One.\"\nPelayo was reconstructed at La Seyne-sur-Mer in 1897–1898, receiving armor for her midships battery and having her  guns replaced by  pieces, one mounted as a bow chaser and the rest on the broadside. However, the installation of these new guns was disrupted and delayed when she was rushed back into service after the Spanish–American War began. During a major refit in 1910, her torpedo tubes were removed.\nConstruction and commissioning\n, 1887)]]\nIn 1884 the Spanish Minister of the Navy, Contralmirante (Counter Admiral) Juan Bautista Antequera y Bobadilla, submitted a proposal for the construction of several battleships to the Cortes Generales, which authorized the construction of only one of them, the future Pelayo. During 1884, the Spanish government contacted several shipyards about constructing the ship. King Alfonso XII approved the construction on 23&nbsp;June 1884, and in Marseille, France, on 28&nbsp;June the Spanish government signed a contract for her construction with the French shipyard Forges et Chantiers de la Mediterranée. The order for her construction was placed on 12&nbsp;November 1884, and her keel was laid at La Seyne-sur-Mer, France, in either April 1885 or February 1886, according to different sources.\nPelayo was launched on 5&nbsp;February 1887 with Minister of the Navy Rafael Rodríguez de Arias Villavicencio, the Bishop of Toulon, and the Spanish Navy screw frigate Blanca'' in attendance. She was completed on 3&nbsp;June 1888 and handed over to the Spanish Navy at Toulon, France, on 8&nbsp;September 1888 in the presence of the Spanish Navy's Training Squadron, made up of the armoured frigate  and the unprotected cruisers  and . She entered service without her main guns.\nOperational history\n1888–1898\nUnder the command of \tCapitán de navío (Ship-of-the-Line Captain) Pascual Cervera y Topete, a future contralmirante (counter admiral) who had supervised her construction, Pelayo made her delivery voyage late in 1888. She received her battle ensign, donated by Asturias and embroidered in Gijón. She returned to Toulon in January 1889 for modifications and improvements. After their completion, she returned to Spain in September 1889 and was assigned to the Training Squadron.\nIn September 1889, clashes occurred between Spanish forces and Moroccans over attacks on and the capture of a number of warships and merchant ships in Moroccan waters. The Training Squadron departed Cádiz and proceeded to Al Hoceima on the coast of Morocco on 23&nbsp;September 1889, joining Isla de Luzón and the screw frigate  there. The Training Squadron′s commander, Contralmirante (Counter Admiral) Carranza, considered making Pelayo his flagship, but Pelayo′s commanding officer, Cervera, opposed it because he viewed Pelayo as unworthy of the role because she still lacked her main guns, so Carranza instead hoisted his flag aboard Gerona. The unprotected cruiser  arrived at Al Hoceima from Tangier with emissaries from Sultan Hassan I of Morocco to negotiate the release of prisoners from the captured fishing vessel Miguel y Teresa.\nIn December 1889, Pelayo encountered a severe storm in the Gulf of Lion which forced her to remain off Marseille without entering port. She finally put in at Mahón on Menorca in the Balearic Islands with minor damage. In April 1890, she returned to Toulon to have her main guns installed. The President of France, Sadi Carnot, visited her on 19&nbsp;April 1890 during her stay in Toulon.\nIn the spring of 1891, Pelayo was part of a Spanish Navy squadron which also included Isla de Luzón, the protected cruiser , and the torpedo gunboat  that visited Piraeus, Greece, and received a visit there from King George I and Queen Olga of Greece. On 1&nbsp;August 1891 the Spanish Minister of the Navy, José María Beránger Ruiz de Apodaca, visited Pelayo at Ferrol. On 12&nbsp;August 1891, Pelayo and other Spanish warships docked at San Sebastián, the summer resort of Spanish monarchs, where she received a visit by Queen Regent Maria Christina. Pelayo returned to Ferrol on 20&nbsp;August 1891.\n, Italy, in&nbsp;1892.]]\nIn 1892, Pelayo participated in events commemorating the 400th anniversary of Christopher Columbus′s discovery of the Americas, beginning with a visit to Genoa, Italy, on 4&nbsp;September 1892 as part of a Spanish squadron that also included Reina Regente, the unprotected cruiser , the armored frigate , and the torpedo gunboat . She was at Huelva, Spain, for the next event, in which Maria Christina and her son, King Alfonso XIII, boarded the unprotected cruiser  at Cádiz on 10&nbsp;October 1892 and, after arriving at Huelva, inspected a Spanish Navy squadron that positioned itself in two parallel lines, with Reina Regente and Vitoria among the ships to port of Conde de Venadito and Pelayo and Alfonso XII among those to starboard of her. After the inspection, the fleet proceeded to Cádiz.\nIn late August 1893, Pelayo joined Alfonso XII, Reina Regente, the unprotected cruiser , and the torpedo boats , , and  in conducting simulated torpedo-firing maneuvers off Santa Pola. More maneuvers began when the Training Squadron departed Cartagena on 15&nbsp;October and anchored at Santa Pola on 16&nbsp;October. Subsequently, the ships simulated a battle off Alicante, in which a division made up of Pelayo, Isla de Cuba, Barceló, Rigel, the unprotected cruiser , and the torpedo boat  opposed a division composed of Alfonso XII, Reina Regente, Destructor, and Habana and the torpedo boat , later joined by Conde de Venadito. The maneuvers, which also included other combat actions, an amphibious landing, and a final naval review, were scheduled to conclude on 22&nbsp;October 1893. However, in September 1893, Riffians in Morocco began attacks on Spanish positions near the Spanish enclave of Melilla on the coast of North Africa, beginning the First Melillan campaign. The Training Squadron interrupted its maneuvers to proceed to the North African coast and intervene. Several more warships reinforced the squadron in late November 1893, when the squadron's operations concluded with the arrival at Melilla of troops under General Arsenio Martínez Campos.\nIn 1895, Pelayo, the armored cruiser , and the unprotected cruiser  represented Spain at the inauguration of the Kiel Canal, which connected the North Sea with the Baltic Sea. Squadrons of several other countries also assembled at Kiel in the German Empire for the ceremonies, which took place on . After returning from Germany, Pelayo, Alfonso XII, Marqués de la Ensenada, and the armored cruiser  arrived at Tangier on 12&nbsp;July 1895 to place pressure on Sultan Abdelaziz to put an end to unrest in Morocco. Once the situation in Morocco had calmed, the ships returned to Spain, arriving at Algeciras on 17&nbsp;August 1895.\nIn 1896, Pelayo continued to operate as part of the Training Squadron, which in January also included Infanta María Teresa, Vizcaya, and the armored cruiser . She called at Barcelona from 17&nbsp;June to 19&nbsp;July. On 29&nbsp;November 1896 she arrived at La Seyne-sur-Mer, France, for a reconstruction which included replacement of her boilers with lighter and more efficient Niclausse boilers to give her a greater steaming range. Her  and  Hontoria guns were replaced with nine  Schneider-Canet quick-firing guns, one as a bow chaser and four on either beam. Her upper crow's nests were removed. The weight saved through the installation of her new boilers also allowed her previously unarmored secondary battery area to be armored with  of steel plate. She achieved  after the reconstruction.\nSpanish-American War\nAmid increasing tensions with the United States in early 1898, the Ministry of the Navy ordered Pelayo to return to Spain to avoid internment by neutral France in the event war broke out. Although her reconstruction was not yet complete — her old  guns had been removed but her new  guns had not yet been mounted — Pelayo got underway from La Seyne-sur-Mer on 7&nbsp;April 1898 and returned to Spain. The Spanish–American War broke out with the U.S. declaration of war on Spain on 25&nbsp;April 1898, the United States stipulating that the declaration was retroactive to 21&nbsp;April. Pelayo was rushed back into service despite her incomplete state and was assigned to the Reserve Squadron on 14 May 1898, making up a division of the squadron that also included the armored frigate  and the destroyers , , and . Although Minister of the Navy Ramón Auñón y Villalón envisioned a campaign in which the Reserve Squadron would attack the coast of the United States and interdict U.S. maritime traffic between Halifax, Nova Scotia, Canada, and Cape San Roque, Brazil, the squadron instead remained idle at Cádiz for a month with a nominal responsibility of guarding the Spanish coast against United States Navy raids while the Ministry of the Navy decided how best to employ it. She then was assigned to the 2nd Squadron, commanded by Contralmirante (Counter Admiral) Manuel de Cámara y Libermoore; Cámara was ordered to steam to the Philippines and defeat the U.S. Navy's Asiatic Squadron, which had controlled Philippine waters since destroying the Spanish Navy Pacific Squadron of Contralmirante (Counter Admiral) Patricio Montojo y Pasaron in the Battle of Manila Bay on 1&nbsp;May.\nsquadron in the Suez Canal in 1898. Pelayo is in the foreground.]]\nCámara's squadron — consisting of Pelayo, the new armored cruiser , the auxiliary cruisers Patriota and , the destroyers Audaz, Osado, and Proserpina, and the transports  and  — sortied from  Cádiz on 16&nbsp;June 1898 and passed Gibraltar on 17&nbsp;June 1898. It arrived at Port Said, Egypt — where the destroyers were scheduled to part company with the squadron and return to Spain — on 26&nbsp;June 1898 and requested permission to transship coal, which the British government, which controlled Egypt at the time, finally denied on 30&nbsp;June 1898 out of concern that it would violate British and Egyptian neutrality. Cámara's squadron began its southward transit of the Suez Canal on 4&nbsp;July, and by the time it arrived at Suez on 5&nbsp;July 1898, the squadron of Viceadmiral (Vice Admiral) Pascual Cervera y Topete had been annihilated in the Battle of Santiago de Cuba off southeastern Cuba on 3&nbsp;July, freeing up the U.S. Navy's heavy forces from the blockade of Santiago de Cuba. Fearful for the security of the Spanish coast, the Spanish Ministry of the Navy recalled Cámara's squadron as it steamed through the Red Sea on 7&nbsp;July 1898, and it returned to Spain, making stops at Mahón on Menorca in the Balearic Islands on 18&nbsp;July and at Cartagena on either , according to different sources, before arriving at Cadiz, where it was dissolved on 25&nbsp;July 1898.\nPelayo spent the last three weeks of the war in Spanish waters, and hostilities ended on 16&nbsp;August 1898 without her having a chance to see combat. Some historians have argued that had Pelayo and Emperador Carlos V participated directly in the conflict, the course of the war would have been altered dramatically and possibly led to a Spanish victory, thus retaining Spain's status as a colonial power.\n1899–1909\n, ca.&nbsp;1899)]]\nOn 12&nbsp;February 1899, Pelayo returned to La Seyne-sur-Mer to complete her reconstruction. After its completion in October 1899, she returned to Spain, where she underwent additional minor modifications and received new smaller-caliber guns in the form of twelve  Nordenfelt guns, five  Hotchkiss revolvers, and six  Maxim automatic guns.\nIn 1901, Pelayo resumed her representation missions, attending a naval review at Toulon. In 1902 she steamed to the Cantabrian Sea, transporting the Spanish royal family to Bilbao and remaining at San Sebastián during August 1902. In April 1903, she visited Lisbon, Portugal, for a naval review, and on 22&nbsp;June 1903 she was at Cartagena along with Emperador Carlos V, Audaz, the protected cruiser , the armored cruisers  and , and the coastal defense ship  to host the British and French fleets as they attended King Alfonso XIII during his visit to the city. In 1904, she was at Vigo during a meeting there between King Alfonso XIII and Emperor Wilhelm II of Germany in which they discussed the status of Morocco, among other things, and she took part in a naval review in Vigo Bay.\nIn April 1904, wireless telegraphy antennas manufactured by the German company Telefunken were installed experimentally aboard Pelayo, Extremadura, and the royal yacht Giralda and the ships conducted wireless tests in the Mediterranean Sea during the summer of 1904. These included an exchange between Pelayo and Extremadura at Mahón on 28&nbsp;July 1904 in which Pelayo sent the first radiogram.\nOn 13&nbsp;January 1905, Pelayo, Cardenal Cisneros, Emperador Carlos V, Princesa de Asturias, Extremadura, the protected cruiser , and the unprotected cruiser  formed a squadron at Cádiz to receive the Duke and Duchess of Connaught and Strathearn, Prince Arthur and Princess Louise Margaret, as they arrived there aboard the Royal Navy armoured cruiser . On the afternoon of 30&nbsp;November 1905, Pelayo anchored at Cartagena with the gunboat .\nAs part of the Training Squadron, Pelayo, Emperador Carlos V, Princesa de Asturias, and Río de la Plata departed Cartagena on 16&nbsp;March 1906 and steamed to Cádiz, where other ships of the squadron joined them. On 23&nbsp;March 1906 the Training Squadron got underway from Cádiz in two divisions — one consisting of Princesa de Asturias, Emperador Carlos V, and Osado and the other of Pelayo, Río de la Plata, and Extramadura. The squadron rendezvoused with Giralda and the Compañía Transatlántica Española passenger steamer Alfonso XII, the latter with the Spanish royal family and Minister of the Navy Víctor María Concas Palau aboard. They then escorted King Alfonso XIII on his visit to the Canary Islands, arriving at Tenerife on 26&nbsp;March, at Las Palmas on 30&nbsp;March, at Santa Cruz de la Palma on 3&nbsp;April, and at Hierro Island on 4&nbsp;April 1906. Alfonso XIII and the squadron returned to Cádiz on 7&nbsp;April 1906.\nOn 2&nbsp;November 1906 Pelayo, Emperador Carlos V, Princesa de Asturias, and the gunboat  arrived from Cádiz at Málaga, where they rendezvoused with Extremadura, Río de la Plata, and Osado. The ships were at Málaga for the visit there of King Alfonso XIII and Queen Victoria Eugenie on 3&nbsp;November.\nPelayo, Princesa de Asturias, Extremadura, Vitoria, and the protected cruiser  attended a meeting between King Alfonso XIII and King Edward VII of the United Kingdom, which took place in Cartagena's harbor from  1907 along with a simultaneous meeting between Minister of the Navy José Ferrándiz y Niño and British First Sea Lord John Fisher. In late June 1907, Pelayo participated in naval maneuvers off the coast of Galicia. After completing gunnery exercises, she anchored at Vigo, where she formed a division with Osado and Proserpina under the command of Pelayo′s commanding officer, and the division engaged in mock combat against Extremadura, Princesa de Asturias, and Rio de la Plata. In July 1907 she cruised in the Cantabrian Sea as part of the Training Squadron before returning to Ferrol in early September 1907. After loading coal, water, and provisions, Pelayo, Princesa de Asturias, and Proserpina got underway from Ferrol on 10&nbsp;September 1907, for Cádiz. They unloaded guns and supplies at Cádiz, then departed for the waters off Morocco. Pelayo subsequently made several voyages along the Moroccan coast before anchoring at Barcelona in mid-October 1908 with several ships from the Training Squadron. On 21&nbsp;October 1908, a French Navy squadron arrived there, and both squadrons remained in port during the stay at Barcelona of King Alfonso XIII and Queen Victoria Eugenie.\nThe Second Melillan campaign, which pitted Spanish forces against Rifians in northern Morocco, began in July 1909. Pelayo deployed to the Moroccan coast where she carried out patrols, supported Spanish Army operations ashore, and conducted bombardments of Rifian positions, the first time she had fired her guns in anger. The campaign came to a close in December 1909.\n1910–1924\nPelayo underwent a major refit in 1910 which included the removal of her torpedo tubes. After the Kert campaign began in Morocco in August 1911, Pelayo again deployed to Moroccan waters, departing Cádiz on 9&nbsp;September and stopping at Tangier before arriving at Melilla. She subsequently bombarded enemy positions near Al Hoceima. She visited Málaga to coal on 18&nbsp;September before anchoring at Melilla again on 23&nbsp;September. She again arrived at Málaga on 1&nbsp;October 1911 and embarked the Minister of War, Agustín de Luque y Coca, for a visit to the Chafarinas Islands. After a stopover at Melilla, she reached the Chafarinas Islands on 10&nbsp;October. She returned to Spain at Cádiz on 22&nbsp;October 1911. She returned to Moroccan waters and supported Spanish Army operations through the end of 1911, conducting several bombardments of enemy positions.\nOn 29&nbsp;January 1912, Pelayo left Cádiz in company with Emperador Carlos V, Audaz, and Osado bound for the Bay of Gibraltar. On 30&nbsp;January she proceeded to Gibraltar to greet the British monarchs — King George V and Queen Mary — on their return journey from India. On 5&nbsp;February 1912, she was at Ferrol with the same ships to attend the launching of the dreadnought battleship . As fighting in the Kert campaign intensified, Pelayo returned to operations off Morocco. She conducted a simulated amphibious landing in Melilla to distract the Kabyles, who were making heavy attacks against Spanish Army positions around Melilla. The Kert campaign concluded in May 1912.\nOn the night of  1912, Pelayo suffered serious damage when she ran aground due to a navigational error in Fonduko Bay near Mahón on Menorca in the Balearic Islands while arriving from Palma de Mallorca on Mallorca carrying ammunition. She proceeded to Cartagena, where she arrived on 28&nbsp;November for repairs.\nPelayo returned to the North African coast in 1913, where in June she joined Emperador Carlos V and the protected cruiser  in conducting shore bombardments along the coast of Spanish Morocco in the area between Ksar es-Seghir and Cape Malabata. In October 1913, Pelayo, España,  Princesa de Asturias, Reina Regente, Río de la Plata, Extremadura, Audaz, Osado, and Proserpina were at Cartagena during a meeting there between King Alfonso XIII and President of France Raymond Poincaré aboard the royal yacht Giralda. On 26&nbsp;December 1913 Pelayo, Extremadura, Proserpina, and the gunboat  stood by a British ship that was aground near Ceuta on the coast of North Africa to deter attacks on the ship.\non 24&nbsp;May&nbsp;1916.]]\nSpain remained neutral during World War I, which began late in July 1914 while Pelayo was stationed at Palma de Mallorca in the Balearic Islands with four torpedo boats. On 29&nbsp;June 1916, she joined the gunboats  and  in bombarding several enemy positions in Morocco. In January 1917 a French merchant ship collided with her and damaged her bow while she was visiting Tangier. Her commanding officer died of a heart attack on 28&nbsp;November 1917 while she was at Tangier.\nPelayo was detached from the Training Squadron in 1918, and from June 1919 she served as a school for apprentice sailors at Ferrol. She served as a gunnery training ship in 1920 and 1921. On 3&nbsp;August 1922 she was ordered decommissioned, but she remained in commission for two more years.\nFinal disposition\nPelayo was disarmed in 1923 and decommissioned on 1&nbsp;August 1924. She was sold to a company in the Netherlands for scrapping. She left Ferrol on 26&nbsp;April 1926 bound for Rotterdam, where she was scrapped.\nReferences\nBibliography\n* Cervera y Topete, Pascual. Office of Naval Intelligence War Notes No. VII: Information From Abroad: The Spanish–American War: A Collection of Documents Relative to the Squadron Operations in the West Indies, Translated From the Spanish. Washington, D.C.: Government Printing Office, 1899.\n* Gibbons, Tony. ''The Complete Encyclopedia of Battleships and Battlecruisers: A Technical Directory of All the World's Capital Ships From 1860 to the Present Day. London: Salamander Books, Ltd., 1983.\n* Gray, Randal, Ed. Conway's All The World's Fighting Ships 1906–1921. Annapolis, Maryland: Naval Institute Press, 1985. .\n* Nofi, Albert A. The Spanish–American War, 1898. Conshohocken, Pennsylvania:Combined Books, Inc., 1996. .\n*\n*\n*\nExternal links\n* [http://www.spanamwar.com/pelayo.htm The Spanish–American War Centennial Website: Pelayo'']"
    }
  ]
}