{
  "content": [
    {
      "type": "text",
      "text": "# Spanish reconquest of Santo Domingo\n\nJoseph de Barquier\n| strength1         =\n| strength2         =\n| campaignbox       =\n}}\nThe Spanish reconquest of Santo Domingo (Spanish: Reconquista Española de Santo Domingo) was a successful revolt against French rule in the Captaincy General of Santo Domingo which lasted from November 7, 1808, to July 9, 1809. In 1808, following Napoleon's invasion of Spain, the criollos of Santo Domingo revolted against the French, which caught the attention of British forces engaged in the Caribbean campaign of 1803–1810. The revolt culminated in 1809 with a return to the Spanish colonial rule for a period commonly termed España Boba.\nThe Treaty of Basel of 1795 stipulated that Spain would transfer Santo Domingo to France, which did not happen until 1801 when an army under Toussaint Louverture occupied the colony. In 1802, French forces intent on deposing Louverture occupied Santo Domingo. However, peninsular events that transpired in 1808 would shake the Dominican population to rise up in revolution against the French occupation.  Conspiracies arose within that same year, some of which had been instigated by the governments of Cuba, Puerto Rico and Haiti. Eventually, under the leadership of Juan Sánchez Ramírez, the Dominicans, with the help of a British fleet from Jamaica, would inflict a crushing defeat on the French forces, once again becoming part of the Spanish monarchy in 1809, ending the French period of Santo Domingo, and officially marking the end of French presence in Hispaniola.\nThough not a war of independence, this conflict represented one of the early Dominican struggles against European imperialism. This would serve as a context of the many conflicts that gave rise to the independence of what would later become the Dominican Republic.\nBackground\nTreaty of Basel\nThe war between Spain and the Convention ended with the cession of the eastern part of the island of Santo Domingo to France, in exchange for the return of the peninsular territories occupied by the French army, as stipulated in the Treaty of Basel, signed on July 22, 1795, between both countries. The situation of general chaos in which the French part of the island was immersed, due to the uprising of the slaves and the struggles unleashed between the various ethnic and social groups, caused the sine day postponement of the definitive handover of the colony by the Spanish authorities to the French ones. However, the consequences of the news were not long in coming, and a large number of Dominican families left the island bound for Puerto Rico, Cuba and Venezuela in a migration process that increased when soldiers commanded by Toussaint Louverture, a former slave who had become general of the French Republic, entered Santo Domingo almost without resistance, in 1801, to take possession of the territory that Spain had ceded to France. The expedition sent by Napoleon Bonaparte to the island in 1802, headed by General Charles Leclerc, did not manage to restore order, but rather lost control over the western part of the island, in which French rule was already more virtual than real, unlike what was happening in Santo Domingo, whose the population supported the new authorities as a safeguard against their neighbors to the west. After the proclamation of Haitian independence in 1804, the eastern part remained under the power of France.\nFrench occupation\n, governor of Santo Domingo from 1803 to 1809]]\nThe French defeat at Saint-Domingue at the end of 1803 with the capitulation of General Donatien Rochambeau, successor of Leclerc, provoked a crisis of authority for the French remnant on the island; particularly for the authority of Brigadier General François Kerverseau, chief for the former Spanish Santo Domingo, which was now in the hands of the French at that time by the Treaty of Basel of 1795. For some authors, Kerverseau's resignation was a matter of time. This explains the coup of command given by General Jean-Louis Ferrand, authority in the Department of Cibao, who with a hundred soldiers left from Monte Cristi, passing through Santiago and arrived in Santo Domingo, where on January 1, 1804, he displaced Kerverseau. Apparently, among Kerverseau's troops there was cause for discontent with their leader. On the contrary, the parties under Ferrand's command were faithful to him to the point of calling him an \"affectionately father.\" All this facilitated the adhesion of the French in Santo Domingo to the project of maintaining French dominion over the eastern part of the island. But now, Ferrand had to find a way to support the French Government on the island and promote the Napoleonic project. Proclamations were sent to different parts of the Caribbean calling on the dispersed French soldiers to regroup in Santo Domingo. Around three hundred soldiers responded to this call, and about five hundred Spanish guards joined them.\nFerrand promoted wood cutting and the development of coffee and sugar plantations. Regarding the Treaty of Basel, Spain and France had established agreements through which French privateers in the Caribbean could make captures on Spanish properties, as well as call at their ports. These privateers had their interest focused on attacking British merchant shipping. Ferrand took full advantage of the profuse privateering activity, issuing patents for finance his army, as well as the administration of the Eastern Part. The French privateers not targeted British shipping but also American ships, which from 1804 onwards traded with Haiti. Efforts to attract back settlers who had left the island as a result of political instability had been unsuccessful. Changing strategy, by the decree of January 22, 1804, Ferrand determined that \"all the properties of the inhabitants of the former Spanish Part who have embarked, or will embark without a passport, whether before either after the blockade of the city, will be confiscated by the government and will be a part of national assets for the entire duration of the kidnapping.\"  This measure was highly unpopular among the emigrated elites. According to Utrera, he stated in regards to the new degree: \"The embargo produced general disaffection towards the French, and disaffection caused, in fact, the Dominican uprising in 1808, which culminated in the French evacuation of Santo Domingo.\" Certainly, the embargo produced discontent in important sectors of Santo Domingo, but it also only affected a portion of the possessing population of seizable assets and that could migrate to other places.\nDiscontent with the French had other elements to take into account. Naturally, the French Government in Santo Domingo had deepened tensions with Haiti, prohibiting trade between both parties. The decree issued by Ferrand on January 6, 1805, not only ignored the existence of the neighboring State but also clearly established the need to \"annihilate the rebellion of the blacks in the colony of Santo Domingo\" through the reduction of its population, and particularly authorizing the capture of minors under 14 years of age to be sold as slaves. The French presence on the eastern side of the island represented a serious threat to the Haitians, which became the trigger for the failed invasion of Jean-Jacques Dessalines on February 22 of that same year. Another incursion was foreseeable if it had not been for the death of the emperor in October 1806 and the consequent division of Haiti into two States: In the North the regime of Henri Christophe and in the South the republic headed by Alexandre Pétion. The tensions between both sides relegated the problem of the French presence in the western part of the island to the background.\nBy prohibiting commercial exchange with the West, Ferrand was limiting the economic possibilities of the Dominicans from the Cibao and the South. These areas were already constrained by the difficulty of exporting wood, tobacco and sugar to the North American market due to the war between France and England, and the naval blockade that the latter had established on the island of Santo Domingo as a result of the breach of the Peace of Amiens in July 1803. Unlike the rest of the former Spanish Part, in Santo Domingo and its surroundings the French found their stronghold support. An important commercial dynamic was deployed there that favored the export of wood. Ferrand also developed a series of infrastructure projects, such as fortifications and repairs of existing works, which provided work and trade to an important group of artisans and specialized workers.\nThe French Government on the island applied a series of social policies that responded to the intention of Napoleon Bonaparte's regime to reestablish slavery, or, failing that, the subjugation of the population of Santo Domingo, to promote the plantation as a productive model. These measures were aimed especially at people of color, freedmen or slaves, for whom were very unpopular and threatening. On December 31, 1807, Ferrand ordered that all people of color show a \"title of freedom\" that proved their status as freedmen. Thousands of freedmen, recent and old, did not have these documents and had to appear before a notary in search of a title of freedom. French documents show these efforts to prove free status. Racial politics extended to other aspects of daily life such as trying to prevent marriages between whites and blacks or preventing the schooling of infants French blacks. French rule showed a contradiction. On one hand, it represented the establishment of a republican socio-political organization, with its institutions, its egalitarian discourse and the figure of the citizen as a subject of law. On the other hand, it intensified the long colonial tradition of the slave plantation as an axis of economic development. Another source of tension came from the influential men of the Church. The French imposed a secular State that led them to confront the practices traditional Spanish. Not only were there expropriations of rural property and ecclesiastical income, but they were also encouraged to ignore the payment of the tithe, which found sympathy in sectors of the property-owning class, but rejection in the priests, figures with great leadership among a population of deep-rooted Catholics. Throughout the anti-French conspiracy, religious figures appear assuming relevant roles. Added to this internal panorama was the international context and particularly the expansive plans of Napoleon Bonaparte.\nFrench invasion of Spain\nOn May 2, 1808, the people of Madrid revolted against the French authority that had been established in Spain since the end of 1807. Through the Treaty of Fontainebleau, signed in October 1807, Spain and France had reached an agreement that allowed Napoleon to cross Spanish territory to reach Portugal, an ally of the British. The crossing of Napoleonic troops ended in an occupation of the Iberian Peninsula. The spirit of rebellion was strengthened by the Bayonne abdications on May 5, the day on which King Charles IV successively renounced the throne, and who was to be his successor, Fernando VII, to give way to the reign of Napoleon's brother, Joseph Bonaparte. The riot stimulated the formation of provincial government boards that claimed loyalty to the Spanish Crown. These boards allowed the creation, in turn, of a Central Board as a form of autonomous government, but faithful to the Iberian monarchy, awaiting the return to power of Ferdinand VII. The events in Spain had its resonance in the American colonial world, in which the boards were replicated. From Spain the Central Board sent proclamations to all the territories in North America, and they arrived in Puerto Rico and Cuba in the month of July 1808, where the governors Toribio Montes, Salvador José de Muro (Marqués de Someruelos), respectively, assumed and disseminated them, so it only took days to reach Santo Domingo.\nAlthough Ferrand made great efforts to maintain the best possible relations with the authorities of Cuba and Puerto Rico, there was tension between Ferrand and Toribio Montes from the beginning. This tension had to do with the accusations of corruption that the former made about the management of the latter. Ferrand denounced what he considered \"intolerable abuses.\" Toribio Montes' unreceptive attitude made sense when in July 1808, he rebelled against the French authorities in Madrid and joined the Junta of Seville. Furthermore, Montes seized a French privateer ship that was in Puerto Rico. Its officers were sent on a ship under the command of Captain Bracetti, who took advantage of the trip to deliver anti-French propaganda and spoke publicly about the state of rebellion on the neighboring island. Bracetti called on Dominicans to take up arms \"against the enemy you have in your homes.\" Among the papers that circulated in Santo Domingo were the proclamations of Montes himself and the Marquis of Someruelos, as well as the Gazette of the Government of Puerto Rico, newspapers from Havana and a proclamation by Henri Christophe, instigating the rebellion against the French, but also to the reestablishment of commercial relations with the Cape.\nBy August 1808, rumors were spreading in the three Spanish-speaking colonies of the Caribbean about what was happening on the Peninsula. In the case of Santo Domingo, the agitation must have been greater, because it was the only one of the three islands occupied by French forces, so the rejection of France and the proclamations in favor of Ferdinand VII must have taken greater shape there. In this situation, both the locals and the colonial authorities of Cuba and Puerto Rico, ignoring the legal implications of the  Treaty of Basel, began to conspire to overthrow French rule in Santo Domingo. The escalation of tension between Spain and France hindered relations in Santo Domingo with Cuba and Puerto Rico. Once contact with Haiti was closed, the inhabitants of the former Spanish Part did not have many economic outlets left, and a break with France became imperative. Ferrand, clearly understanding the new scenario, expressed: \"The entry of Napoleon's troops into Spain will kill us all here.\" The Marquis of Someruelos showed an ambiguous attitude in Cuba, as he spread the proclamations and at the same time dedicated his energy to protecting the thousands of French emigrants who had been dispersed throughout the Caribbean since the time of the Saint-Domingue slave rebellion. In Cuba they represented a figure greater than 10,000 people, among them there were rich French planters highly valued by the colonial government. The captain general of Havana asked the Spanish to \"show unlimited tolerance towards so many hundreds of French people who, far from their homeland, lived dedicated to work under the protection of the Spanish pavilion\".\nDevelopment of the conflict\nEarly conspiracies in Santo Domingo\nApparently in Santo Domingo, more or less simultaneously, a series of conspiratorial movements against France took place, among which the efforts in Cuba by Leonardo Pichardo and Cereceda, those sent by the governor of Puerto Rico, Salvador Félix and Cristóbal Huber Franco, who added Ciriaco Ramírez, stood out, in addition to the activities headed by Antonio Rendón Sarmiento and Juan Sánchez Ramírez. Of these four, historiographical primacy rests on the fourth, for being the figure who managed to bring together the largest number of people, lead decisive actions and, above all, rally the support of Puerto Rico and Spain as leader of the process. The action of Leonardo Pichardo y Cereceda was limited to lobbying the Captain General of Havana to receive support that would allow him to return to Santo Domingo to expel the French, but this initiative failed to mobilize the Havana colonial government. A second conspirator of the that we know of was Antonio Rendón Sarmiento, who traveled to Puerto Rico to make contacts and find support. On July 29, 1808, Rendón was in Mayagüez, where he learned of events in Spain. He obtained several copies of the Seville Manifesto, the Diario de Valencia and other news to bring to Santo Domingo. On August 9, he landed in El Jobero, in the east of the island, where he took refuge in the house of Sánchez Ramírez, for whom he had a letter of recommendation from the priest Juan Pichardo in which he presented him \"as a subject who had a lot of knowledge in the Department of the North\" and \"to direct it under the protection of the neighbors who seem more on purpose.\"\nThe dates of Rendón's initial movements are not clear, but it is known that on September 1, 1808, he wrote to the vicar of Santiago of the Knights, Vicente Luna, updating him on his steps and affairs. The vicar responded on October 9, in a letter that shows that at that time Sánchez Ramírez was a recognized figure in the conspiracy against the French. Luna complained about \"the lack of correspondence that Don Juan Sánchez, who has taken charge of these matters, should send us.\" Even so, at all times the letter hints at the existence of two prominent and close figures: Sánchez and Rendón. \"And I charge you and Sánchez not to have us more time in confusion.\" The prelate explains that in Santiago they were only waiting for a signal to displace the French authorities. \"In this We are not careful about Santiago, since there are not even eight Frenchmen, and the Commander General seems to resist nothing: we are now putting in an express that is of our trust and well trained, so that you and Sánchez impose them on the things that happen here, which are all good.\" According to the Diario de la Reconquista, in Higüey, Juan Sánchez Ramírez found Rendón on September 5, learning that he had burned the letters he brought for fear of being apprehended with them. For Utrera, \"having changed the errands until he lost his pursuers with the loss of his flight, he finally found the darkest of all fortunes, because whoever saved his life, taking him to a remote place, took from him the flag of the foreign liberation of the Homeland.\" According to this approach, Juan Sánchez Ramírez retained Rendón Sarmiento in El Seibo and this caused his leadership to be broken, being the one who assumed the decisive command in the process. He used the contacts created by Rendón Sarmiento to receive and send information to Puerto Rico. Although it is known that since August, Sánchez Ramírez was moving in search of support for his cause, for Utrera he was the last to formally request Spanish help for the expulsion of the French.\nWhile the siege lasted, Rendón had roles of responsibility. For example, Sánchez Ramírez entrusted him with taking prisoners to Puerto Rico, which occurred on May 2, 1809. But at the end of that year, Rendón denounced Sánchez Ramírez for \"having been viewed with the greatest contempt, trying to obscure his merit that he has so notoriously acquired.\" Rendón fought for his primacy as leader of the Reconquista and revealed the tricks used by Sánchez Ramírez to displace him. Certainly, Sánchez Ramírez used the strategy of accusing his political opponents of intrigue—as he did with Ciriaco Ramírez and Cristóbal Huber—including Rendón in the investigations of the conspiracy of 1810, known as that of the Italians. (José Núñez de Cáceres would later dismiss the charges only after the death of Sánchez Ramírez).\nThe uprising of the south\nCristóbal Huber Franco and Salvador Félix, with the support of the governor of Puerto Rico, arrived on the coast of Barahona on September 23, 1808, and began the agitation of the South of the Spanish Part, where they established contact with Ciriaco Ramírez, a key figure of the Reconquista process. There are several elements of confusion about this faction. For example, historian José Gabriel García believed that only Félix was the one sent by Montes to Santo Domingo and that it was once on the island when he became involved with Huber Franco. Seemingly, Huber, a native of Madrid, did arrive from Puerto Rico, where he was a resident, working as a merchant and squad corporal in the Fixed Regiment there. His affiliation to the Dominican cause against the French was explained because his second intention was to be appointed, through Montes' efforts, private secretary in the Viceroyalty of Peru. But if there is someone with a dubious role in this situation, it was Salvador Félix, since he was not There is evidence that he was an agent of Montes, since the official documents of Puerto Rico do not mention him. As far as we know, Félix was one of the Dominicans who joined the conspiracy against the French in Puerto Rico and in that situation he associated himself with Huber and traveled to Santo Domingo.\nTwo days after his arrival, in Fundación, Neiba's jurisdiction, the rebellion began. Del Monte grants both characters that primacy and affirms that once the uprising was done, Ciriaco Ramírez and Manuel Jiménez joined them. Utrera criticized the proceed from the governor of Puerto Rico, Toribio Montes, because \"he undertook the undertaking without having foreseen the unity of action of well-known individuals familiar with the country, placing his trust in men absolutely unknown as Dominican patriots, such as Huber, who had never been in Santo Domingo, Salvador Félix, a resident without social quality, and Ciriaco Ramírez, a newcomer in the South dedicated to working in his farms.\" A week after the landing, the first contacts were established with Ciriaco Ramírez, landowner or commoner. He was described as a \"white, strong man, a native of Cádiz, a resident of Azua, married, farmer, 38 years old\" and owner of coffee plantations. There is evidence that in 1804 he appeared as a commander in Azua. On October 2, he accepted to join the rebellion \"and made disbursements to obtain weapons and ammunition in Haiti.\" Ramírez was a key piece, as he managed to recruit sectors from Cibao and the South, along with his brother-in-law Manuel Jiménez. As will be seen later, his figure was later eclipsed by the leadership by Sánchez Ramírez.\nLater, (as part of the case that was pursued against him in 1810 for his alleged involvement in the so-called Conspiracy of the Italians), Sánchez Ramírez described the process that led him to join the Reconquista struggle. He stated that he was contacted on September 30, 1808, by Antonio Félix with\na message from Cristóbal Huber and Salvador Félix informing him of the war between Spain and France and inviting him to \"get ready to break the war against the French.\" Ramírez responded that, as a landowner, he could not take that risk without certain data, so he was offered to present documents, which was fulfilled the next day when they brought him several \"forms from Seville relating to the revolution in Spain, a document that proved that a ship had been chartered to carry said Félix and others, a passport and an instruction in a copy of those given by the governor and captain general of Puerto Rico, Don Toribio Montes, and signed by Huber and Félix.\" Here the importance of information management becomes evident, since at that time, with little access to written documents, when the misinformation played a determining role. The sectors favorable to French domination circulated denials regarding what happened in Spain or simply resorted to intimidation. Ramírez pointed out that a series of people received letters in which they were persuaded to \"desist from the enterprise\" and to \"submit to the French Government, that what was said about Spain was false, that all things were compounded.\" Apparently, with the documents that Ciriaco Ramírez saw, he felt convinced that they were true and realized the magnitude of the matter. He had been persuaded with the power of the printed letter, which in that context was decisive, added to the project, Ramírez dedicated himself to looking for allies, he came into contact with other figures from Santiago such as Diego Polanco, Miguel Álvarez and Miguel de los Santos.\nOn October 5, Ciriaco Ramírez \"declared war, with no weapons other than eleven rifles and a blunderbuss and a hundred men, more or less, and on other days more than two hundred, remaining camped a league away from the town of Azua occupied by the enemies.\" Six days later, he met Huber for the first time, after the defeat of the French at Malpaso, and it was there that the alliance was formally established. According to Ramírez's own account, on October 19 he participated in a skirmish in which he had to retreat due to the superiority of the Gauls. Toribio Montes wrote on October 15 to Francisco Saavedra, president of the Central Board in Spain, to request help for the Dominicans. On October 18, the schooner Monserrate arrived on the island from Puerto Rico with the notice from Baltazar Paniagua and other emigrants that in a few days the requested aid would set sail for Santo Domingo. Since the end of September, Huber Matos had written to Alexandre Pétion requesting weapons and ammunition, supplies that were delivered to Manuel Jiménez. In addition to the collaboration of the Republic of Southern Haiti, the triumvirate (Huber, Ramírez and Félix) had had contact with the president of the Northern part, Henri Christophe, from whom they had also received a favorable response. Toribio Montes, however, expressed concern about this association. In a letter dated October 15, 1808 to Francisco Saavedra, president of the Central Board of Regency, Spanish Government in the absence of the king, explained Haiti's support for the cause of reconquest. \"The blacks who occupy the French part are addicted to the Spaniards, and they claim not to have the slightest mistrust of them.\" But Montes showed misgivings and ordered his agents \"not to admit or use their persons in any way.\"\nOn October 28, Montes wrote to Christophe in the following terms: \"[...] that as far as people are concerned to drive out and destroy the French, they have more than enough; but they are in the mood to admit the weapons and ammunition that they lack, which Your Excellency's generosity has offered them.\" Consequently, the orders were not to allow the involvement of Haitians but to receive weapons and ammunition. He later took credit for the success of obtaining the support of the Haitian rulers by saying: \"I availed myself through friendly messages and proclamations from the black general Henri Christophe, and from the mulatto general, Alexandre Pétion, and both of them not only answered me attentively, but due to my influence They franked some weapons, ammunition and other effects of war.\" The triumvirate faced the French in three important battles: Malpaso, Los Conucos and Sabana Mula. On October 23, Colonel Aussenac, attacked the rebels of Ciriaco Ramírez located in Sabana Mula with 150 men. This attack was successful for the French, as it forced the rebels to disperse. But having received aid in arms from the Haitian government of Pétion, through the efforts of Manuel Jiménez, the panorama changed. With this help, and managing to gather around a thousand men, including two hundred mounted, the Creoles were able to take over Tábara and forced the French to retreat to Sabanabuey. According to Ciriaco Ramírez, his troops prepared to attack the town of Azua. The French, informed by Agustín Batista of the upcoming attack, abandoned the town after burning 24 houses, so on November 5, Ramírez and Huber's troops were able to enter it.\nConspiracy of the east\nThe rebellion in the Eastern region was led by Juan Sánchez Ramírez, a native of Cotuí, but with economic interests in Samaná, El Seibo and Higüey. Antonio del Monte Tejada attributed him to having held important positions, including the role of magistrate of his native town, but Utrera ruled it out. It seems that he briefly held the position of commander of arms in his native Cotuí. Owner of land in the East, he is entitled to the title of landowner. Lemonnier-Delafosse called him a \"rich landowner.\" Defining him as a landowner would limit the diversity of roles he played according to documentation. He is shown buying and selling land and slaves, as an official of the Spanish colonial government and as a figure of local prestige. In December 1795 he appeared supervising the inventory of the jewelry of the church of Cotuí by appointment of Governor Joaquín García, regarding the cession to France.\nHe emigrated to Puerto Rico in 1803 and while there, in 1806, the military commander of Higüey appointed him to look after his affairs in Mayagüez. He returned to the island in 1807 and a year later, on the eve of initiating his conspiratorial actions, he appeared as an accountant in the will of Sebastián Rijo in Higüey. According to Del Monte and Tejada, in the context of the French Revolution and the slave rebellion in Saint-Domingue had already begun, Juan Sánchez Ramírez fought with the Spanish troops against the French together with the battalion of auxiliary blacks led by Jean François and Georges Biassou in which he was credited with being \"an astute, knowledgeable and brave guerrilla.\" The subsequent events were of great drama and complexity: the years of lack of definition, with a France that did not immediately occupy its newly obtained colony, the unilateral action of Toussaint Louverture in 1801, Leclerc's expedition in 1802 and the consequent second phase of the French Government. When referring to Juan Sánchez Ramírez, José Gabriel García described him as an \"honored natural owner of Cotuí, who, having emigrated in 1803, he had to return after four years, to recover from the losses he had experienced during his trip, working a wood cut that he had in Macao.\" While for García, Sánchez Ramírez's trip was related to the need to recover lost property, which can be interpreted from Sánchez's own words in the Diario, for Del Monte and Tejada the move to Puerto Rico was directly related to the subversive plans. This author attributes all the preponderance of the action to Sánchez Ramírez, putting him in contact with key figures in the process of Reconquista like Andrés Muñoz in Santiago, Ciriaco Ramírez in the South and \"a certain Sarmiento\" in El Seibo, whose relevance has already been described.\nThe events of Bayonne, in May 1808, generated a sudden Hispanic fervor among some sectors that contributed to strengthening support for the idea of removing the French from the Caribbean and made it easier to gain followers for the conspiracy. Between August and September 1808, Juan Sánchez Ramírez moved through Cotuí, La Vega, Santiago, Bayaguana, El Seibo and Higüey to motivate the uprising. Upon arriving in Santo Domingo on August 9, Ferrand invited him to a meeting. In the Diario, this meeting appeared as a lunch in which the French general sought to attract to its administration a man considered until then \"a friend of the French.\" Gilbert Guillermin, for his part, He described him as \"intriguing and audacious, he dared to sit at General Ferrand's table at the same time when he had just completed his crime and spread the ferment of rebellion in the Eastern part.\" And he was certainly very right. Sánchez Ramírez had been stirring up spirits in different towns, but Santo Domingo proved not to be the space with the greatest roots for the Reconquista movement: \"From eight to eleven I tried to fathom the spirits of some Spaniards who had influence in the city, with whom I insinuated myself, and, finding them too lukewarm, I forced them by representing my ideas to them.\"\nThat same day Ferrand made a proclamation to the Dominicans. In it, he sought to control the unrest or the \"hurricane\" that was already in the Caribbean. He recognized that Puerto Rico was in a \"political fermentation\" that, according to him, \"seems to be born from some movements of discord and disagreement between the French and Spanish in Europe.\" He supported the natural weaknesses of the circulation of information: \"The different relationships that have reached our news about those events, present so many contradictions of incoherence and implausibility that even their existence is still, for our eyes, full of darkness, almost impenetrable.\" In this way he sought to question the reliability of the existing information that could then be considered rumors. His proclamation appealed to unity: \"French and Spanish, all together we are nothing more than a single people of brothers and friends.\" He called on them to repudiate \"the instigations, whether from outside or from within, that would lead to sowing disastrous seeds of distrust, discord and disorder.\" In reality for this date, and through correspondence that Ferrand writes to Puerto Rico, everything seems to indicate that he was truly unaware of the latest events that occurred in Spain. As already noted, the governor of Puerto Rico had taken diligent activism, and sent to Santo Domingo, through Captain Bracetti, a proclamation addressed to its inhabitants in which he made a call to fight: \"Arm yourselves against our oppressors, join us, destroy for yourselves. Go away and break the chains that oppress you.\" According to Diario, in mid-August Sánchez Ramírez was looking for a way to communicate with Toribio Montes in Puerto Rico. After several failed attempts, it was around September 17 when he obtained a boat with which he was able to send a communication to the neighboring island. It is known that Sánchez Ramírez wrote to the governor and Mayagüez official Baltazar Paniagua. Only the second letter was preserved, in which light is shed on the state of the movement. Sánchez Ramírez expressed his dismay at his inability to communicate with the nearest Spanish authority, in this case Puerto Rico, \"because the correspondence that has come, some have been reported and burned before reaching my hands, and others intercepted by the Government itself.\"\nSánchez Ramírez complained, saying that \"lately they have not stopped, taking measures and pretending that they receive correspondence from Europe.\" Once again, the power of information to manage the political situation to one's advantage is perceived. Being credible often had to do with possess a written or, better yet, printed document. The schemers surely played a fundamental role in generating doubt, where the legitimizing did not appear. Sánchez Ramírez considered that the confirmation of Puerto Rico's support was essential to give strength to the movement and authority to his figure. He said: \"I have offered to those of this that we will obtain it, and if they do not see it verified, they will distrust, they will faint and the French deceptions will come to achieve the ruin of many.\" In the letter Sánchez Ramírez stated that based on information from José Moreno —captain of the boat with which he finally managed to write to Montes—that in the South \"the spirits are ready and measures are taken.\" He explained that he was heading there to unify the movement when he learned of the arrest warrant issued by Ferrand against Rendón Sarmiento, Manuel Carvajal and himself, so the meeting and unification with the southern conspirators could not be verified. This had medium-term consequences, generating tensions that were not fully resolved until the Bondillo Board. Despite that, he gave the Southerners his vote of confidence: \"I have never doubted those people.\" At this time, September 1808, the larger, stronger, and more unified movement it seemed would find supporters with more ease. He asked Puerto Rico to send 200 sabers, firearms, spark stones, among other resources. But he also requested troops and for them to come accompanied by their military commander. Perhaps understanding the social context and issues such as status, ranks and the rigid Spanish social ladder, he humbly stated:\nIt is notable that by the time Sánchez Ramírez managed to send the communication, there were only a few days left before the arrival of the envoys of Montes, Huber and Félix to the island. This meant that the governor of Puerto Rico was already determined to support the cause of the anti-French Creoles of Santo Domingo.\nLeadership of Juan Sánchez Ramírez\nFaced with a new rebel scenario in the East, Ferrand ordered his troops located in the South to concentrate on Santo Domingo. Without knowing it, the conditions were created to facilitate the siege that the Creoles could place on the capital, after the Battle of Palo Hincado, the next military challenge that the French had to take on, just a few days after the withdrawal from Azua. At first it seemed that the Southern group was the one leading the vanguard in the fight against the French. Their military actions precede which Sánchez Ramírez led in the East. Initially it was the South that had the strongest connections with the Spanish Government and that had enlisted the help of the two Haitian governments. But starting on October 26, the correlation of forces began to shift from the South to the East, where it began the offensive led by Sánchez Ramírez and a group of twenty-one men who entered El Seibo:\nThe next step was the arrest of the French representative, Lieutenant Colonel Manuel Peralta, carried out by Manuel Carvajal, an event that generated a confrontation between French and Creoles in Higüey. In El Seibo, Sánchez Ramírez gathered people from Neiba, Azua, San Juan and Las Matas, managing to bring together, according to José Gabriel García, six companies under the command by Vicente Mercedes. The figure is far from the thirty horsemen with whom Sánchez Ramírez entered El Seibo. The control over this town allowed him to establish a military point in San Gerónimo, on the outskirts of the capital, and from there cut off communication between Santo Domingo and Samaná, a key place for the French.\nFrom this moment, it was clear to the French that they faced two more or less well-defined rebel centers: in the South the triumvirate of Félix, Huber and Ramírez, and in the East the movement led by Juan Sánchez Ramírez. Then the strategic movements began that allowed the locals to triumph in Palo Hincado. The necessary baggage was prepared to transport aid from Puerto Rico from Yuma, which arrived on October 29. Four hundred rifles and cartridges were received, which came in four ships and a schooner that were to return loaded with mahogany. In those days Sánchez Ramírez wrote to other commanders of the towns of the South and the North, of which there was already news of small portions of Spaniards having revolted, demanding that they speed up the shipment of patriots.\nOn October 30, Ferrand made a new proclamation, with \"a thousand promises and as many threats.\" This was very different from the one he had made on August 9, which only sought to exhort tranquility. He lamented that, despite his exhortations, many were deaf to them and had joined the conspiracy. He used all kinds of expletives and accused those involved of being \"evil, vagabonds, lazy people, bandits;\" and he called those who had traveled from Puerto Rico a \"filthy mob of robbers who have vomited on our shores.\" Although no leader was mentioned in the document, there was recognition of the landing from Puerto Rico of 200 to 300 people, which made the magnitude of the movement evident to the entire population. Once again the misinformation card was played, under the argument that there would be no reintegration to Spain without an agreement between both powers, subtracting quality from the developing movement. He reported on the next march of the line troops and the National Guard, at the head of which he would personally go. They threatened the towns of the East, particularly El Seibo and Higüey, telling them that \"the days of clemency have passed\" since \"orders have been given for them to suffer a punishment that will serve as an example forever.\" Once the announcement was made, preparations began for the launch that took place a week later. As the vicar Vicente Luna had very well pointed out in September, regarding the little French presence in Santiago and the willingness of the people of Santiago to displace the authorities at the first sign, they did so. Del Monte y Tejada tells that they \"organized their columns, arrested Don Agustín Franco de Medina and in number of six hundred set off to meet Juan Sánchez in El Seibo.\"\nWar of Reconquest\nBattle of Palo Hincado\nThe Battle of Palo Hincado, on November 7, 1808, was the decisive confrontation of the Reconquista. The key to the resounding success of the native troops has had various interpretations. For Utrera, the reason for the triumph was not to be found in Sánchez Ramírez's capacity as a military strategist, nor in the weapons at the disposal of the Spanish, but rather in a fortuitous event: the rain the night before that had wet the gunpowder and rendered the rifles useless. This meant that the battle ended up being a hand-to-hand encounter, with the French bayoneting and the Dominicans using machete. Since the latter were skilled in its use, this determined the combat in favor of the Spanish troops. In this way, to a certain extent, Utrera disparaged the military skills of Juan Sánchez Ramírez. The French, in Lemonnier-Delafosse's story, explained their defeat by three factors: firstly, Ferrand's attitude of trying to lead the confrontation when, as leader, he had to protect his figure; secondly, the Dominican numerical superiority and, thirdly, and above all, due to the action of Tomás Ramírez, in charge of the National Guard, who at the same time front of two hundred cavalry, as soon as the fight began, he betrayed the French and went over to the Spanish troops. Emilio Cordero Michel agrees with the French on this last point, but presents two different elements: the appropriate choice of the place and the tactics of surround the French troops with cavalry and attack them with edged weapons.\nDel Monte y Tejada attributed the lack of tactical preparation for the encounter to Ferrand's arrogance: \"General Ferrand believing that his mere presence. That would be enough to command respect from the Dominicans, he left Santo Domingo with five hundred veteran men.\" Manuel Peralta was in the vanguard with the proclamation that must have intimidated the insurgents. Sánchez Ramírez's troops, ignoring the threats, arrested Peralta. According to Del Monte and Tejada, Ferrand simply did not pay attention to his opponents' military operations. For him, in numerical terms, the Dominicans had the advantage, since 1,200 men, lancers and infantry, and 600 cavalry showed up to the meeting.\nThe choice of Palo Hincado was not accidental. Sánchez Ramírez explained: \"having previously observed the advantages offered by situation of Palo Hincado, distant about half a league to the west of El Seibo, I immediately withdrew all my people to this place.\" The Army of the reconquestidors are as follows: Three hundred men in front of the royal road, infantry armed with rifles, under the command of Lieutenant Francisco Díaz; two hundred men on the right where the land forms a ravine, without firearms, to carry out an ambush under the command of the urban captain Pedro Reinoso; A piece of cavalry, armed with saber and lance, under the orders of the captain of dragons from El Seibo Vicente Mercedes, covered the flank of the right; Another piece of cavalry, equally armed, under the command of Antonio de Sosa, a native of Los Llanos, who covered the left flank; Thirty riflemen in a small ambush in the rear of the enemy, under the command of José de la Rosa, a native of Puerto Rico;  Twenty-five well-armed men on the road to Anamá; Sánchez Ramírez was placed as leader in the center of the army and ManuelCarvajal as his second. It also included Pedro Vásquez and Miguel Febles as senior assistants.\nAccording to the list, the presence of only 555 soldiers can be assured, since it is difficult to determine how many men formed a \"piece of cavalry.\" Sánchez Ramírez did not provide an exact number of the men under his guidance, but stated that they did not reach a thousand. In the work, Second Campaign of Santo Domingo, it was stated that the French troops were barely 620 soldiers, compared to a Dominican army that oscillated between 1,200, according to Agustín Franco, and 2,300 according to Captain Bosquet, who led an advance that reconnoitred the Dominican troops stationed in Palo Hincado. Cordero Michel spoke of 1,800 men, 600 from Cibao and 1,200 gathered by Sánchez Ramírez. It is appropriate to consider that it is possible that French sources overstated the number of troops in order to justify the defeat. On the other hand, on the opposite side, in Dominican sources, a smaller troop would accentuate the bravery of its men and the success of the battle; but a greater number of soldiers would show the collective commitment to the Reconquista. It can be considered that the Dominican troops were larger than the French.\nIt was just before the start of the combat when Sánchez Ramírez made a harangue, already famous historiographically: \"Panal of life to the one who returns the face back; penalty of life to the drum that will beat retreat; and life penalty to the officer who commands him, even if it is myself.\" In his description to the Spanish Central Board of November 28, 1808, Toribio Montes presented a less articulate but essentially the same phrase. He pointed out that Sánchez Ramírez had made his speech when General Ferrand was heard offering one hundred pesos for whoever would take the Spanish flag. In Diary, although he did not speak of this fact, Sánchez Ramírez confessed that he \"was suspicious\" that an act of cowardice or betrayal would occur among his subordinates. The change of sides of Tomás Ramírez, the third of this story, which has so much weight in the French story, was not reported by the Diario de Sánchez Ramírez. Utrera qualified the fact and considered this assertion as a fiction of the French. He spoke rather of the Spanish troops led by Ramírez \"withdrawing from the combat\" and accused Sánchez Ramírez of not wanting to recognize actions such as these because they minimized his leadership. The betrayal of Tomás Ramírez was described by Lemonnier-Delafosse like this:\nIt seems to be a consensus that the Battle of Palo Hincado was quickly decided in favor of the Creole forces. García said that it took minutes for it to turn into a \"field of death and desolation.\" Del Monte y Tejada described the Spanish triumph like this: \"but as soon as the column had just deployed to line up in battle, the Dominicans broke out a horrific fire that disordered the ranks, and, the cavalrymen charging from the flanks, were dismantled ratated.\" His story suggests the use of firearms and contradicts the thesis of rain and humidity that rendered the Spanish weapons useless. For any of the reasons argued—strategic location, number of Creole troops, carelessness on the part of the opposing party, climatological effects—the reality was that the defeat of the French forces quickly became evident:\nThe measure of Palo Hincado's triumph may be the fact that only 18 Frenchmen were able to return to Santo Domingo, among them was J.B Lemonnier-Delafosse, a survivor and one of the essential narrators of this conflict. The Spanish troops only suffered seven dead and 47 wounded, compared to an inaccurate figure of \"a field full of French corpses.\" According to Lemonnier-Delafosse, there were 100 prisoners and 315 French dead. Of the imposing initial army, only 40 (according to the French) or 18 (according to Sánchez Ramírez), but few from any perspective, were able to return to Santo Domingo. Aware of the resounding failure, Ferrand \"decided not to survive his defeat.\" The flight and suicide of the French leader constituted a fundamental story in the remembrance of this event. In retreat, Ferrand with a group of his men, having traveled for approximately an hour, separated from the soldiers who accompanied him and took off his life from a gunshot. Sánchez Ramírez speculated on the reasons that led the French general to make such a dramatic decision:\nThe soldiers who accompanied him barely covered his body with branches of trees and resumed their accelerated march towards Santo Domingo upon hearing the approach of the Spanish. This is how Colonel Pedro Santana found him, who was sent to follow him along with 50 soldiers. He proceeded to cut off his head, which was taken to Sánchez Ramírez as a trophy along with his horse. Lemonnier-Delafosse cataloged Santana's act as cruelty and barbarism: \"those monsters separated, they took his graceful head off the trunk to take her to the island of Puerto Rico where they displayed it on the tip of a pike in the city's public square.\" The action does not constitute an event foreign to the colonial sphere, in which violence and punishment had a primary place. The rebels were tortured in plain sight public and their heads displayed in the pillory that every town park had.\nFerrand was classified as a \"strategic weakling\" but also as a father figure for the Spanish whom \"he had showered with benefits, and even more, he had given them a second life.\" Brigadier General Joseph-David de Barquier became Ferrand's successor. Two days after Palo Hincado he issued a decree in which he declared a state of siege and referred to the death of his predecessor in the following terms: \"The general in chief has died; he perished as a victim of his blind trust.\" The defeat of the French, confirmed with the shocking act of Ferrand's suicide, contributed to the construction of an entire epic from which subsequent national imaginations were nourished. At the time, without a doubt, as García suggests, the victory of Palo Hincado generated an enthusiasm that allowed \"the generalization of the reconquering movement throughout the Spanish Part, whose command the victorious leader prepared to assume.\" Sánchez Ramírez did not hesitate to attribute the success of Palo Hincado to divine intervention and his person as the one chosen to carry it out.\nSiege on the capital and formation of \"Junta of Bondillo\"\nThe Siege of Santo Domingo (1808) began on November 15, 1808, and lasted for eight months, until July 15, 1809. This period can be divided into three moments: preparation of the siege by the Dominican-Spanish, organization to resist by the French and definition of authority by the Spanish Part; Spanish attempt to force French surrender and the French to break the siege; British intervention in favor of the Spanish, negotiations and French surrender. Once the victory was achieved against the French in Palo Hincado, according to the French vision, the Spanish troops became careless, so the few survivors were able to reach Santo Domingo and begin entrenching themselves behind its walls. \"The enemy, very busy, now in killing, now in dispossessing victims, sent only a few horsemen in pursuit.\" General Du Barquier was able to take advantage of the time to reorganize his troops and prepare for the inevitable siege. The French troops guarding inland towns under the command of Colonel Aussenac were called back to Santo Domingo. This action made it easier for the population of other places to join the reconquest process. Ciriaco Ramírez, despite the superiority of his forces, did not follow, except at a distance, Colonel Aussenac in his retreat. It was on November 15, eight days after Palo Hincado, when the site was formally established from Santo Domingo. The British were aware of the situation on the island and entered the scene when Ferrand's death became known. It was then that they temporarily blocked the port of Santo Domingo with the ship Polyprhemus led by Commodore Cumby. Meanwhile, the frigate La Franchise, Under the orders of Captain Charles Dashwood, on November 14 he took possession of Samaná, a strategic and significant point for the French.\nJuan Sánchez Ramírez arranged the organization of his troops in the siege as follows: A division under the command of Manuel Carvajal on the opposite bank of the Ozama River, with Miguel Febles as second; Pedro Vásquez at the western end of the plaza, which embraced the two roads that go north to Santiago and the one that goes south to Azua, leaving Emeterio Vilaseca in second place; All the outposts were placed within half a cannon shot of the plaza\nhaving the corresponding parapets raised; The castle of San Gerónimo was occupied by 350 men under the command of Captain José Álvarez. While Sánchez Ramírez had control of the eastern portion of the country, the rest of Santo Domingo was influenced by other Creoles, led by Félix, Huber and Ramírez. It was at the end of November when they arrived with their troops to reinforce the siege of Santo Domingo. Then, tensions arose that ended up defining Sánchez Ramírez as the undisputed leader of the process were evident. Although the triumph of Palo Hincado catapulted Sánchez Ramírez as the main figure of the movement, there was no absolute consensus. In Cibao and the South the triumvirate continued to have influence. It was after the siege of Santo Domingo that the Diario de Sánchez Ramírez showed the existing tensions between the sectors. Ciriaco Ramírez was systematically criticized by Sánchez Ramírez. The actions of the southern side in Neiba, San Juan and other towns were described as tumultuous and disorderly under the accusation of \"being those subjects known to be unruly, of bad conduct and without no antecedent representation that would make them respectable.\"\nSánchez Ramírez accused them of being the reason why the towns of Azua and Baní had not yet proclaimed themselves in favor of the Reconquista. And in fact he credited himself with having achieved it thanks to the sending of Antonio Ortiz, a native of that area, who with his efforts \"caused such a good effect that without when those two neighborhoods hesitated, they decided in favor of the common effort.\" Utrera qualified the anecdote, specifying the particular conditions of both towns: Azua with a French complement of 300 men and the burning of 34 houses that intimidated the population, and Baní with a significant number of French residents that made the initial expressions of solidarity with the Spanish cause insignificant. Since the siege began, Sánchez Ramírez called himself general-in-chief of the Reconquista. For his part, Ciriaco Ramírez constantly demanded the clear establishment of a figure of authority and began efforts to hold an assembly in which this would be defined. The Bondillo Board was the instrument that allowed Sánchez Ramírez to become the undisputed leader of the process. This was facilitated by the fact that it was carried out without the presence of Ciriaco Ramírez and Cristóbal Huber, resulting in their displacement as possible leaders of the movement. On December 12, 1808, met in the vicinity of Santo Domingo, in the place called Bondillo, eighteen people who, in addition to Sánchez Ramírez, proclaimed themselves representatives of the different jurisdictions of the Eastern Part of the island, under the name of deputies. Gathered there, in \"name of the people of the Spanish Part of the island of Santo Domingo,\" they agreed on the following points:\n* Recognize Fernando VII as king of Spain and the Supreme Junta Central of Madrid as the legitimate government.\n* \"In attention to the merit that has been acquired by being the leader and driving force of the glorious enterprise of freeing the people of Santo Domingo from the shameful yoke of the tyrant Napoleon... the Board appoints Mr. Juan Sánchez Ramírez as political and military governor and interim mayor, general commander of the Spanish Army in Santo Domingo.\"\n* The governor will henceforth convene the members of the Board whenever he sees fit and will be its president, with the understanding that it only has an advisory voice, and the decisive voice will only belong to the governor.\n* All the legal and administrative provisions that were in effect before the French occupation were confirmed, but it was agreed that the colony would later be organized as a Spanish province.\n* The governor will take an oath of fidelity before the Central Board of Madrid and obedience to Spanish laws.\nIn this way, Sánchez Ramírez managed to give legitimacy to his ascending authority and displace the figures of Ciriaco Ramírez and Cristóbal Huber, but also to a certain extent equate his powers with those of the governor of Puerto Rico, Toribio Montes, recognized as \"protector of the company.\" On December 12, without knowing what was happening in Santo Domingo, Montes wrote Sánchez Ramírez a letter in which he urged him to follow his orders and sent him instructions in which he conferred on him the rank of second commander and rank of lieutenant colonel. Without having yet received these communications, Sánchez Ramírez immediately wrote to Montes to inform and justify what happened in Bondillo. He considered his appointment a necessity due to \"the intrigues of some individuals with sinister purposes\" and the risk that the leader was not \"invested with the necessary authority.\" In the letter from the newly appointed interim political and military governor of Santo Domingo, he made sure to make clear his subordination to Montes by treating him as \"venerated sir\" and finish his message with \"I always remain at your orders, as I have previously meant, eager for the occasions in which to express my submission.\" The orders sent from Puerto Rico, when they finally reached their destination, found in Santo Domingo a situation irreversible. Even so, it took almost two months for Montes to formally recognize what was decided in the Board, which it eventually did on February 5, 1809.\nSome have cataloged Bondillo as \"the first parliament or constituent assembly in Dominican history.\" Without a doubt, there was a representation of the main towns of the colony and an autonomous action of local empowerment. According to Sánchez Ramírez, for the constitution of the Board, \"an individual from each town of all of this entire part was called Spanish that are in the Army, and that each one was chosen by the number of neighbors who have attended this meeting from each town.\" Observing its composition, the military presence was evident. Only the representatives of Neiba and Azua appear as inhabitants. These were precisely the areas of influence of Ciriaco Ramírez and Cristóbal Huber, figures absent from the Junta, so it is interpreted that it was them, and perhaps only them, who could appear as military representatives of said localities. Therefore, rather than a constituent assembly, one could speak of a military junta.\nBut, without a doubt, it was a real space of self-determination, constituting an unprecedented event in the history of Santo Domingo. Since Ciriaco Ramírez and his group did not participate in the Meeting, upon their arrival they found the fait accompli. \"Sánchez, more sagacious than his competitor, had arrived much earlier at the Bondillo meeting to strip him of his claims.\" As expected, Bondillo's results led Ramírez to retire to his home temporarily citing health problems. The tensions between both leaders did not stop there, with one month remaining until the end of the siege, Ciriaco Ramírez was accused of committing excesses in the towns of the South and causing the death of Commander Casillas. (He was sent prisoner to Puerto Rico, where he was tried and released, returning to Santo Domingo on July 17, 1810, just in time to be accused alongside Cristóbal Huber to participate in the conspiracy of \"the Italians\" in September of that same year, an accusation of which he was also discharged).\nAmong contemporary historians there is a current record that attributes Ciriaco Ramírez to belonging to an independence faction and that in Bondillo, the possibility of proclaiming colonial rupture was debated. There is no reference to this in any of the documentary sources contemporary to the Reconquista, nor in the reports and letters of Juan Sánchez Ramírez and Toribio Montes and the Diary of Sánchez Ramírez or the two basic French works of Lemonnier-Delafosse and Guillermin. The idea that the governor of Puerto Rico has supported agents who turned out to be propagators of the idea of independence and who provided weapons to an anti-monarchist and republican Ramírez is not supported. Del Monte y Tejada, in one of the first stories of Santo Domingo, does not refer to the existence of an independence party, but does speak of \"disagreements among Dominicans, the most noteworthy being a regular controversy held between  Don Bernardo Cidrón and Don Juan Sánchez on the legality of each other's procedures.\" The French priest wrote to Sánchez Ramírez three times to try to convince him of his erroneous political position against France. These disagreements boiled down to the Spain-France confrontation. Del Monte y Tejada's work was published in 1852, forty years after the events of the Reconquista, so it is perfectly possible that he may have heard or known about that \"tradition,\" but he does not mention it. Fifteen years later, in 1867, José Gabriel García published his version of the Compendium of the History of Santo Domingo. Determined to build national history, García would have spread, without a doubt, the existence of a nationalist faction within the war against French domination, but in his text there are no references to this support this. According to García, the Junta sought to end disagreements between the two main leaders, disagreements that could harm the unity necessary to achieve the surrender of the French. In Dominican historiography, the earliest reference that was found is that of Federico Henríquez y Carvajal, who at the beginning of the 20th century referred to the topic:\nAs can be seen, Henríquez y Carvajal emphasized the condition of \"vague\" and \"close to legend\" the thesis of the independence faction. In the XIX century, two Haitian historians spoke of the presence of this faction: Thomas Madiou in his work ''Histoire d'Haïti and Beaubrun Ardouin in Études sur l'histoire d'Haïti''. They were the ones who made explicit reference to the existence of two groups confronted: one favorable to the metropolis and the other pro-independence, the first associated with Juan Sánchez Ramírez and the second with Ciriaco Ramírez. But they did not present evidentiary elements to support such thesis either. This leads us to venture the hypothesis that the reading of Haitian historians contributed to giving rise to this \"tradition\" among Dominican historians of the 20th century.\nBritish involvement\n, were commissioned. ]]\nBritish Major General Hugh Lyle Carmichael departed Jamaica with the 2nd West Indian, 54th, 55th, and Royal Irish regiments to aid Britain's new found Spanish allies in reducing the isolated French garrison besieged in south-eastern Hispaniola. His convoy was escorted by Capt. William Price Cumby's HMS Polyphemus, Aurora, Tweed, Sparrow, Thrush, Griffin, , , , and . Carmichael disembarked at Palenque ( west of Santo Domingo) on 28 June, hastening ahead of his army to confer with his Spanish counterpart— General Juan Sánchez Ramírez, commander of a Puerto Rican regiment and numerous local guerrillas—who for the past eight months had been investing the 1,200-man French garrison commanded by Brig. Gen. Joseph-David de Barquier.\nDespite 400 of the 600 Spanish regulars being sick, they advanced on 30 June at Carmichael's behest to seize San Carlos Church on the outskirts of the capital and cut off communication between Santo Domingo and Fort San Jerónimo  west, while simultaneously securing a beach for Cumby's supporting squadron. The demoralized French defenders had already requested an armistice and been rebuffed, repeating the suggestion on 1 July as the first British troops arrived overland (hampered by torrential rains). As negotiations progressed Carmichael maintained pressure by installing heavy siege batteries around the city and massing his forces for an assault.\nFinal siege on the French\nOnce the siege was established, the Spanish strategy seemed to bet on French exhaustion. There were fewer skirmishes initiated by the Spanish side than there were French attempts to break the siege. On December 8, 1808, the latter unsuccessfully attacked the fort of San Gerónimo, a strong point of the Spanish, but with this action they managed to disorganize the advances from the Spanish forces and take certain provisions, such as livestock and provisions. On December 20, Sánchez Ramírez's troops received reinforcements sent from Puerto Rico through the port of Palenque. The beginning of the year 1809 found Santo Domingo fractured. The capital was still occupied by the French while the rest of the colony had joined the Reconquista but without formal authority. The French forces were concentrated in Santo Domingo, leaving the interior of the country in an ambiguous situation, without effective authority, other than that assumed autonomously by the different towns. Henri Christophe, ruler of the northern part of Haiti, took advantage of this situation to occupy the towns of San Rafael and San Miguel. This turned out to be a secondary problem for Sánchez Ramírez, who needed to seek support and reaffirm his authority as the legitimate ruler of Santo Domingo, so he proceeded early to contact the two Haitian governments existing at that time.\nOn December 23, 1808, he wrote to Christophe thanking him for the shipments of weapons and ammunition delivered by Brigadier José Campos Tavares. Pétion, for his part, responded to his letter of December 28, expressing his joy at his election by his compatriots and thanked the frankness of the relations between the two: \"You must be sure of the interest I have in the success of your operations against the French. You know to what extent the people of whom I am leader are enemies of that nation.\" In the same letter, to \"prevent all misinterpretation,\" he informed him that his soldiers would cross Las Caobas and Hincha to go and harass the \"oppressor of the North.\" Perhaps this clarification refers precisely to Christophe's occupation of San Rafael and San Miguel. Sánchez Ramírez maintained excellent relations with the Haiti and these lasted throughout the period of Spain Boba, but it was notorious that over time it took sides in favor of Christophe, with whom he developed an alliance.141\nFrench surrender\nOn 6 July the capitulation was finalized, de Barquier pointedly surrendering to the British rather than to the Spaniards. The next day British troops occupied the city and Fort San Jerónimo, the French defenders being transported directly to Port Royal, Jamaica without loss of life on either side.\nAftermath\nSanto Domingo would be de jure returned to Spain in the Treaty of Paris (1815).\nThe situation of shortage of the colonial treasury continued throughout the known period in Dominican historiography known as España Boba. Inefficient administrators for more than 10 straight years led Santo Domingo to a great social and economical dismemberment, but it will not be until 1821 when a revolt led by José Núñez de Cáceres declared the colony's independence from Spain. He tried to protect the new state by engaging it to Simon Bolívar's Gran Colombia to prevent a Haitian invasion, but to no avail. Simultaneously, the Haitian army of Jean Pierre Boyer invaded the new independent territory, starting an occupation period that extended for 22 years.\nIn 1830, Spain attempted to reclaim the former colony, but this proved unsuccessfully due to widespread rejection from the Dominicans. By the end of the decade, a revolutionary group called La Trinitaria was formed to challenge Haitian rule. This group would go on to defeat the Haitians occupants on February 27, 1844, which the birth of the Dominican Republic is declared.\nFor its part, Spain lost control of a territory whose great geostrategic importance, due to its proximity to Cuba and Puerto Rico, would have served Spain's greater interest as a metropolis. Spain will acknowledge the independence with the Treaty of Acknowledgement in 1855, but it will only be effective for 6 years since in 1861, General Pedro Santana will solicit its annexation to Spain. This adherence lasted until 1863, the starting point for a series of revolts that began the Dominican Restoration War, which end in 1865 with the instauration of the Second Dominican Republic and complete detachment of Spain.\nSee also\n* Era de Francia\n* España Boba\n* Juan Sánchez Ramírez\n* Jean-Louis Ferrand\n* Battle of Palo Hincado\nReferences\n* Delafosse, Lemonier; \"Second Campaign of Santo Domingo — Dominican-French War of 1808\" (translation of C. Armando Rodriguez); Editorial El Diario, Santiago (DR); 1946.\n* Guillermin, Gilbert; \"Journal History of the Spanish revolution of Santo Domingo\" (translation C. Armando Rodriguez); Dominican Academy of History; Imp editing PV Lafourcade, Philadelphia, U.S.; 1810.\n* Sánchez Ramírez, Juan; \" Journal of the Reconquista\"; Editor Montalvo, Santo Domingo (R.D.); 1957.\nBibliography\n*Marley, David. Wars of the Americas: A Chronology of Armed Conflict in the New World, 1492 to the PresentABC-CLIO (1998).\n*Guillermín, Gilbert: Historical Diary, Editor Santo Domingo, SA 1976\n*Moreau de Saint-Mery, Mery, Maderie Louis Elie: Description of the Spanish Part of Santo Domingo, Editor Montalvo 1944.\n*Sánchez Ramírez, Juan: Diario de la Reconquista, Editora Montalvo, Santo Domingo, DN 1957.\n*Sánchez Ramírez, Juan: 185\n*Peña Batlle, Manuel Arturo: Historical Essays, Printed in Workshop, Santo Domingo, RD 1989.\n*Utrera, Fray Cipriano.Proemio in the Diario de la Reconquista, Editor Montalvo, Santo Domingo, DN, 1957.\n*Rincón, Francisco A. Juan Sánchez Ramírez, Patriot and Nationalist (Historical criticism). Printed Edison, Cotuí, RD 2004.\n*Bosch, Juan; Historical Topics, Editor Alfa & Omega, Santo Domingo (R:); 1991."
    }
  ]
}