{
  "content": [
    {
      "type": "text",
      "text": "# Speaking in Strings\n\n| runtime = 73 minutes\n| country = United States\n| language = English\n| budget =\n| gross = $6,859\n}}\nSpeaking in Strings is a 1999 documentary film directed by Paola di Florio. The film is based on the life of Italian-born violinist Nadja Salerno-Sonnenberg, and it received a nomination for Best Feature Documentary Film at the 72nd Academy Awards.\nContent\nThe film is based on the life and career of Italian-born classical violinist Nadja Salerno-Sonnenberg, and provides an insight into the style of the artist - who is noted by critics for pouring her own emotions into her musical performances. The film started from Salerno-Sonnenberg's birth in Rome, and followed her story as she moved to United States at age 8 and was brought up by her mother in New Jersey. She grew up with her brother who is also a musician. The film concentrates on the violinist's difficult childhood as she had to experience scorn and laughter by her friends when she played a recording of Brahms in front of the class. This is among the incidents that caused the artist to develop her overly emotional performing style and personality as she became a professional violinist and rose to stardom. In the documentary, Salerno-Sonnenberg talks about periods of depression in her life and her suicide attempt; she also discusses her views on how music is connected to human emotions.\nProduction and release\nThe documentary was directed by Paola di Florio, a childhood friend of Salerno-Sonnenberg. Salerno-Sonnenberg appeared as herself in the film. Speaking in Strings was co-produced by two companies, Asphalt Films and CounterPoint Films.\nSpeaking in strings premiered at Sundance Film Festival in Park City, Utah in 1999. This same year, the documentary appeared in several film festivals, including Florida Film Festival, Mill Valley Film Festival, Newport International Film Festival, and Seattle International Film Festival. The film was released theatrically on October 29, 1999. A DVD version was released on June 26, 2001.[https://www.metacritic.com/video/titles/speakinginstrings?q=Speaking%20in%20Strings Speaking in Strings (1999): Reviews]\nReception\nBox office\nThe film earned $1,519 in its opening weekend in one theater, and went on to gross $6,859 domestically within two weeks from release.\nCritical reaction\nThe documentary received mixed response from critics. It got a score of 56 out of 100 based on 10 reviews at Metacritic, and 3.5 out of 4 stars at TV Guide.[https://www.tvguide.com/movies/speaking-strings/review/134311 Speaking In Strings Review | TVGuide.com] In general, critics agreed on the point that the film lacked information on the private life of Salerno-Sonnenberg, particularly her romance relationship which was mentioned during the documentary. Edward Guthmann of San Francisco Chronicle gave generally positive reviews, stating that the film \"takes us inside Salerno-Sonnenberg's experience, challenging us to respect a woman so naturally intense that she can't help wearing out friends and colleagues, and alienating members of her audience.\"\nMeanwhile, San Francisco Examiner 's critic Allan Ullrich criticised that, due to the musical excerpts used in the documentary, \"the movie can't help looking like a prolonged promotional video.\" Critic Robert Hilferty of Village Voice called the documentary \"a clumsy labor of love with unforgivable lapses\", and noted that it \"fails to show why Salerno-Sonnenberg's controversial interpretations are so original and valid.\" However, he added that it \"sometimes rises to a compelling portrait of a neurotic personality\". According to Hilferty, the documentary leaves an impression that music is the factor that \"ruined\" the life of the violinist.\nNominations and awards\nDespite the mixed reviews by critics, Speaking in Strings received a nomination for Best Feature Documentary at the 72nd Academy Awards. The film won a Jury Award for Documentary Competition at the Newport International Film Festival  and the same year, won a cable Ace Award.\nReferences\nExternal links\n*[https://www.imdb.com/title/tt0181835/ Speaking in strings] at Internet Movie Database\n*[http://thisiscounterpointfilms.com/projects/speaking-in-strings/ Speaking in Strings] at CounterPoint Films\n*[http://www.7thart.com/films/Speaking-in-Strings Speaking in Strings] at Seventh Art Releasing"
    }
  ]
}