{
  "content": [
    {
      "type": "text",
      "text": "# Speaking clock\n\nA speaking clock or talking clock is a live or recorded human voice service, usually accessed by telephone, that gives the correct time. The first telephone speaking clock service was introduced in France, in association with the Paris Observatory, on 14 February 1933.\nThe format of the service is similar to that of radio time signal services. At set intervals (e.g. ten seconds) a voice announces (for example) \"At the third stroke, the time will be twelve forty-six and ten seconds……\", with three beeps following. Some countries have sponsored time announcements and include the sponsor's name in the message.\nList by country\nAustralia\nIn Australia, the number 1194 was the speaking clock in all areas. The service started in 1953 by the Post Master General's Department, originally to access the talking clock on a rotary dial phone, callers would dial \"B074\", during the transition from a rotary dial to a DTMF based phone system, the talking clock number changed from \"B074\" to 1194.  It was always the current time from where the call originated, in part due to Telstra's special call routing systems. Landline, Payphone and Mobile customers who called the 1194 time service would receive the time. A male voice, often known by Australians as \"George\", would say \"At the third stroke, it will be (hours) (minutes) and (seconds) seconds/precisely. (three beeps)\" e.g. \"At the third stroke, it will be three thirty three and forty seconds\". The time announcement was announced in 10 second increments and the beep was 1 kHz.\n]]\nPrior to automatic systems, the subscriber rang an operator who would quote the time from a central clock in the exchange with a phrase such as \"The time by the exchange clock is ……\". This was not precise and the operator could not always answer when the subscriber wanted. In 1954, British-made systems were installed in Melbourne (1st floor, City West Exchange) and Sydney. The mechanical speaking clock used rotating glass discs where different parts of the time were recorded on the disc. A synchronous motor drove the disc with the driving source derived from a 5 MHz quartz oscillator via a multi stage valve divider. This was amplified to give sufficient impetus to drive the motor. Because of the low torque available, a hand wheel was used to spin the motor on start up. The voice for the original Australian speaking clock was provided by Gordon Gow. The units were designed for continuous operation. Both units in Melbourne and Sydney were run in tandem (primary and backup). For daylight saving time changes, one would be on line while the second was advanced or delayed by one hour and at the 02:00:00 Australian Eastern Standard time, would be switched over to the standby unit.\nIn addition to the speaking clocks, there was ancillary equipment to provide timing signals, 1 pulse per second, 8 pulses per minute and 8 pulses per hour. The Time and Frequency Standards Section in the PMG Research Laboratories at 59 Little Collins Street, Melbourne maintained the frequency checks to ensure that the system was \"on time\". From a maintenance point of view, the most important part of the mechanical clocks was to ensure that they were well oiled to minimise wear on the cams and to replace blown bulbs that shine through a lens arrangement and the glass recording disk, and finally into the optical pickups that convert the interrupted beam intensity into an electrical signal, and ultimately an audible voice. When Time & Frequency Standards moved from 59 Collins Street to Clayton Research Labs (3rd Flr. Building M5), the control signals were duplicated and a second bank of Caesium Beam Primary standards installed so the cutover was transparent with no loss of service.\n]]\nThis mechanical system was replaced with a digital system in 1990. Each speaking clock ensemble consisted of two announcing units (Zag 500), a supervisory unit (CCU 500), two phase-locked oscillators, two pulse distribution units, a Civil Time Receiver (plus a spare), and two or four Computime 1200 baud modems. The voice was provided by Richard Peach, a former ABC broadcaster. The various components were sent for commercial production after a working prototype was built in the Telstra Research Laboratory (TRL). Assmann Australia used a German announcing unit and built a supervisory unit to TRL specifications. Design 2000 incorporated TRL oscillators in the phase locked oscillator units designed at TRL and controlled by two tone from the Telstra Caesium beam frequency standards. Ged Company built civil time receivers. The civil time code generators and two tone generators were designed and built within TRL. The changeover occurred at 12 noon, September 12, 1990.\nEach state capital had a digital speaking clock for the local time of day with one access number for all Australia, 1194. In 2002 the Telstra 1194 service was migrated to Informatel (which uses its own digital technology, in conjunction with the National Measurement Institute&nbsp;— but kept the original voice of Richard Peach), whilst the other time services (e.g. hourly pips to radio stations) were retained as a service by Telstra. In May 2006 the remaining Telstra services were withdrawn and the digital hardware was decommissioned. Telstra ended the 1194 service on the midnight of October 1, 2019 and Australians no longer have access to this service. A web-based simulation of the 1194 service was created by musician Ryan Monro on the day of the original service's shutdown.\nIn 2024, the National Communication Museum opened in Melbourne. There is a restored 1954 speaking clock on display, featuring the original voice of Gordon Gow.  There is also an Assman Speaking Clock from 1990 on display.\nAustria\nIn Austria, the speaking clock (\"Zeitansage\", which literally means \"time announcement\") number is 0810/00-1503 (rate: 6¢/min.) since 2009. A recorded female voice says: \"Es wird mit dem Summerton 15 Uhr, 53 Minuten und 10 Sekunden\", meaning \"At the buzzing tone, the time will be 15 hours, 53 minutes and 10 seconds\", followed by a short pause and a 1&nbsp;kHz, 0.25 seconds long beep (even though the announcement \"buzzing tone\" suggests otherwise). The time is announced in 10 second intervals using the voice of radio host Angelika Lang.\nBefore 2009, the speaking clock was available at local call rates by dialing 1503. Until then, the voice was generated by an Assmann ZAG500 time announcement device. The announcements were voiced by former switchboard operator Renate Fuczik.\nTelephone time signals first became available in Vienna in 1929, with an automatic voice announcement being added in 1941.\nBelgium\nIn Belgium, the speaking clock used to be on the numbers 1200 (Dutch language), 1300 (French language), and 1400 (German language). Starting in September 2012, the service is only contactable on the numbers +32 78 05 12 00 (Dutch Language), +32 78 05 13 00 (French language) and +32 78 05 14 00 (German language). At the time of the number change, the service received 5,000 calls per day. The signal for the speaking clock came directly from the time service of the Royal Observatory of Belgium. First it came from a Zeiss clock, later from an atomic clock.\nCanada\nThe NRC provides a Telephone Talking Clock service; voice announcements of Eastern Time are made every 10 seconds, followed by a tone indicating the exact time.  This service is available to the general public by dialing +1 613 745-1576 for English service and +1 613 745-9426 for French service. Long-distance charges apply for those calling from outside the Ottawa/Gatineau area.  The voices of the time announcements are Harry Mannis in English and Simon Durivage in French.\nChina\nDialling 117 in any city connects to a speaking clock that tells the current time in China. Currently 12117. Despite China spanning five time zones, only one time is kept over the country, therefore only one zone related service is required and the same time would be announced regardless of where the call was made.  Rates are charged according to the ordinary local number, generally around 0.25 RMB/minute.\nFinland\nNeiti Aika (\"Mrs Time\", speaking clock) at Rupriikki Media Museum in [[Tampere, Finland]]\nIn Finland the speaking clock service is known as Neiti Aika in Finnish or Fröken Tid in Swedish, both of which mean \"Miss Time\". The first Neiti Aika service was started in 1936 and was the first automated phone service in Finland. The service is provided by regional phone companies by dialling 10061 from any part of the country. The voice of the speaking clock is male or female depending on the phone company service. Nowadays the use of the Neiti Aika service has decreased significantly, and the press officer of Auria, the regional phone company of Turku, stated in an article of the Turun Sanomat newspaper that when the company started the service in 1938 it was used 352,310 times in its starting year, compared to 1,300 times in September 2006.\nFrance\nIn France, the speaking clock (horloge parlante) was launched on 14 February 1933 and was the first service of its kind worldwide. It is available by dialing 3699 from within France, and was formerly available from overseas by dialing +33 8.36.99. - - . - -  (where the  - -  could be any number).  However, since September 2011, calls placed from outside France only work from some countries and networks. In May 2022, French telecom company Orange announced that the service will be discontinued on 1 July 2022, due to the \"steady and significant decrease\" of calls.\nIreland\nIn Ireland, the speaking clock () was first offered by P&T in 1970, and was accessed by dialling 1191. It announced the time in 24-hour format, in English only, at ten second intervals punctuated by a high pitched signal, as follows: “At the signal it will be HH:MM and …… seconds (signal). P&T operator Frances Donegan was the original voice. Antoinette Rocks, also a P&T/Telecom Éireann operator, provided the voice of the speaking clock when it was updated to digital technology in 1980. Her voice was selected as part of a competition on a radio phone-in show, RTÉ Radio 1‘s Morning Call with Mike Murphy. Listeners voted for one of 8 voices. At its peak, it received almost three million calls a year (about 8,000 a day). The Irish speaking clock service was permanently shut down by eir (P&T’s successor) on 27 August 2018 due to lack of use and reliance on ageing equipment.\nItaly\nIn Italy, the speaking clock service was established in the 1940s, under the name \"Ora esatta,\" and featured a mechanical female voice. It was originally accessed by dialing 16, later changed to 161. Currently, the number to call is 42161, operated by TIM, the national operator.\nNetherlands\nOn 1 October 1930, a system was installed in the Haarlem telephone exchange (automated in 1925) which indicated the time using a series of tones, accessed by the number 15290.\nIn 1934, electronic engineer and inventor F.H. Leeuwrik built a speaking clock for the municipal telephone service of The Hague using optically recorded speech, looping on a large drum. The female voice was provided by the then 24-year-old school teacher Cor Hoogendam, hence the machine was nicknamed Tante Cor (Aunt Cor).\nIn 1969, this system was replaced by a magnetic disk machine resembling a record player with three pick-up arms, telling the time at 10 second intervals followed by a beep. The text was spoken by actress Willie Brill. The service was now called over 130 million times a year.\nIn April 1992, the machinery was replaced by a digital device with no moving parts. The voice was provided by actress Joke Driessen and the clock's accuracy is maintained by linking it to the German longwave radio transmitter DCF77. To comply with international guidelines limiting double-zero to use as an international prefix, the 002 number was changed on 3 December 1990 to 06–8002, and later to 0900–8002. The service still receives approximately four million calls a year.\nNew Zealand\nThe speaking clock in New Zealand is run by the Measurement Standards Laboratory of New Zealand. The service is accessed by dialling 0800 MSLTIME (0800 675846). MSL has been running the service since 1989.\nPoland\nThe speaking clock in Poland is known as Zegarynka which means the clock girl. The service became first available in 1936, using a device invented and patented in Poland. It was speaking with the recorded voice of actress Lidia Wysocka. The first cities to be equipped with this device were Katowice, Warsaw (dialing number 05), Gdynia, Toruń and Kraków (July 1936).\nRussia\nIn 1935, Soviet Central Scientific Research Institute of Communications received a government order to design the \"Speaking Clock\" for Moscow City Telephone Network. \"Speaking Clock\" was constructed based on cinematic techniques and consists of discs with pulse-density modulation optical marks on photographic tapes, photocell with actuator, and audio tube amplifier. On May 14, 1937 \"speaking clock\" connected to Moscow City Telephone Network for test operation and it was contactable on the numbers  and . It was speaking with the recorded voice of Soviet actor and broadcaster Emmanuil Tobiash. In 1937, the first cities to be equipped with this devices were Moscow and Leningrad.\nIn 1969, the first Soviet \"Speaking Clock\" was replaced in Moscow City Telephone Network by a magnetic tape machine. Old ones were transferred to the Polytechnic Museum.\nTo hear the current time in Russia, either 100 or 060 can be dialed, depending on the city where this service is available. These calls are free if made from non-mobile phones. In Moscow, the Speaking Clock number is 100 if dialed from within the city, or +7-495-100-. . . .   from other countries (where . . . . can be any number). At one time in Moscow, there were advertisements before and after the announcement of the current time; this practice has since ceased.\nSpain\nThe speaking clock in Spain is run by the Spanish Navy from the Royal Observatory in San Fernando, and is accessed by dialling the number 956599429 free of charge.\nSweden\nThe speaking clock in Sweden is run by Telia and can be accessed by calling 90 510 from landline phones or 08-90 510 from mobile phones. The service is called Fröken Ur which means Miss Clock. It has been in use since 1934. Various voices have stated the time. Since 2000 the voice which states the time belongs to Johanna Hermann Lundberg. In 1977 the speaking clock in Sweden received 64 000 000 calls - which is the record for a year. In 2020 the number of calls was about 2 000 per day, meaning a total of a bit less than 1 000 000 calls annually.\nSouth Africa\nThe speaking clock in South Africa is run by Telkom, the country's national telecommunications provider, and can be contacted by dialling 1026 either from a fixed line or a cellular phone. The time is announced every 10 seconds and alternates between English and Afrikaans languages. An example of an English announcement of the time would be: \"When you hear the signal, it will be four hours, fifteen minutes and ten seconds\", followed by a short audible tone to signal the exact time previously announced. The voice of the announcements is that of broadcaster and voiceover artist Helen Naudé. Recorded in 1989, the same speaking clock announcements with Naudé's voice are still in use to the present day. Naudé also provided her voice talent to other Telkom services, such as 1023 directory enquiries, as well as the pre-recorded message \"The subscriber you have dialled does not exist\", which can be heard when dialling an invalid phone number.\nUkraine\nThe speaking clock in Ukraine is run in Odesa and is available by dialling +380-48-737 6060.\nUnited Kingdom\nUsage\nIn the United Kingdom, the speaking clock can be heard by dialling 123 on a BT phone line; the number may vary on other networks.  Every ten seconds, a voice announces:\nThe service was started in 1936 by the General Post Office (which handled telephones at that time) and was continued by BT after its formation in 1980 and privatisation in 1984. Between 1986 and 2008, the message included the phrase \"sponsored by Accurist\"; Accurist withdrew their sponsorship in 2008.  The \"from BT\" part was added, then removed at some point, then reinstated.\nFor times that are an exact minute, \"precisely\" is substituted for the seconds portion of the announcement.  Similarly, announcements for times between the hour and one minute past the hour substitute \"o'clock\" for the (zero) minutes.  Other operators run their own speaking clocks, with broadly similar formats, or redirect to BT's service.  Virgin Media have their own service available by dialling 123 from a Virgin Media line. Sky also have their own service accessible by dialling 123 from a Sky telephone line.  Dialling 123 from a few mobile services, such as O2, also obtains a speaking clock service. The Giffgaff network uses the same service as O2. The service is not available on the 3 mobile telephone network, as they use 123 as the number for their voicemail services.  It was also unavailable on the Orange network for the same reason.\nOn the occasion of a leap second, such as at 23:59:60 on December 31, 2005, there is an extra second pause between the second and third beeps, to keep the speaking clock synchronised with Coordinated Universal Time: \"At the third stroke, the time from BT will be, twelve o'clock precisely. Beep, Beep,  Beep.\" The current UK time source is the National Physical Laboratory, UK.\nIn 2011, the BBC reported that the service still receives 30 million calls each year.\nHistory\nA speaking clock service was first introduced in the United Kingdom on July 24, 1936. The mechanism used was an array of motors, glass discs, photocells and valves which took up the floorspace of a small room. The voice was that of London telephonist Ethel Jane Cain, who had won a prize of 10 guineas () in a competition to find the \"Golden Voice\". Cain's voice was recorded optically onto the glass disks in a similar way to a film soundtrack. The service was obtained by dialling the letters TIM (846) on a dial telephone, and hence the service was often colloquially referred to as \"Tim\". However this code was only used in the Director telephone system of the cities of London, Birmingham, Edinburgh, Glasgow, Liverpool and Manchester. Other areas initially dialled 952, but with the introduction of subscriber trunk dialling it was changed to 80 and later 8081 as more 'recorded services' were introduced. It was standardised to 123 by the early 1990s.\nThe time announcements were made by playing short, recorded phrases or words in the correct sequence. In an interview with Manchester Radio in 1957 Miss Cain said:\nRetrieved on 20 October 2008}}\nIn 1963, the original device was replaced by more modern recording technology using a magnetic drum, similar to the Audichron technology used in the United States. The company that manufactured the rotating magnetic drum part of the Speaking Clock was Roberts & Armstrong (Engineers) Ltd of North Wembley. They took on the licence from the British Post Office to manufacture complete clocks for the telecommunications authorities of Denmark, Sweden and the Republic of Ireland, and a third (spare) clock for the British Post Office. The latter was installed in Bow Street, London. The European clocks were modified for the 24-hour system by lengthening the drum and adding extra heads. Roberts & Armstrong subcontracted the electronic aspects to the Synchronome Company of Westbury. The clocks were designed to run non-stop for 20 years. This system gave way to the present digital system in 1984, which uses a built-in crystal oscillator and microprocessor logic control. The complete apparatus comprises solid-state microchips, occupies no more shelf space than a small suitcase and has no moving parts at all. The BT service is assured to be accurate to five-thousandths of a second.\nIn 1986, BT allowed Accurist to sponsor its franchise, the first time a sponsor had been used for the service. In the latter years of this sponsorship, it cost 30 pence to call the speaking clock. Accurist announced its withdrawal from the deal and the launch of an online \"British Real Time\" website on 24 August 2008.\nDuring the Cold War, the British Telecom speaking clock network was designed to be used in case of nuclear attack to broadcast messages from Strike Command at RAF High Wycombe to HANDEL units at regional police stations. From there, automatic warning sirens could be started and alerts sent to Royal Observer Corps monitoring posts and other civil defence volunteers equipped with manual warning devices. The rationale for using an existing rather than a dedicated system was that it was effectively under test at all times, rather than being activated (and possibly found to be faulty) only in the event of war. The signals to automatic sirens were sent down the wires of individual (unaware) subscribers for the same reason—a customer would report any fault as soon as it occurred, whereas a problem with a dedicated line would not be noticed until it was needed.\nA version of the speaking clock was also used on recordings of proceedings at the Houses of Parliament made by the BBC Parliament Unit, partly as a time reference and partly to prevent editing. On a stereo recording, one track was used for the sound and the other for an endless recording of the speaking clock—without the pips, as these were found to cause interference.\nBT \"Speaking Clock\" voices\nThere have been five permanent voices for the speaking clock.  Temporary voices have been used on special occasions, usually with BT donating the call fees collected to charity.\nPermanent voices\n# Ethel Jane Cain, first permanent voice: from 24 July 1936 to 1963\n# Pat Simmons, second permanent voice: from 1963 to 2 April 1985\n# Brian Cobby, third permanent voice: from 2 April 1985 to 2 April 2007\n# Sara Mendes da Costa, fourth permanent voice: from 2 April 2007 to 9 November 2016\n# Alan Steadman, fifth permanent voice: from 9 November 2016\nTemporary voices\n# Lenny Henry, comedian, temporary voice for Comic Relief: from 10 March to 23 March 2003\n# Alicia Roland, 12-year-old schoolgirl, temporary voice for the children's charity ChildLine, from October 13 to October 20, 2003, having won a BBC TV Newsround competition and stating, before announcing the time, \"It's time to listen to young people\"\n# Mae Whitman, temporary voice as part of a deal to promote the Disney production of Tinker Bell, for slightly more than three months, from 26 October 2008 to 2 February 2009\n# UK celebrities Kimberley Walsh, Cheryl Fernandez-Versini, Gary Barlow, Chris Moyles and Fearne Cotton for Comic Relief charity: from 3 February to 23 March 2009\n# UK celebrities David Walliams, Gary Barlow, Chris Moyles, Kimberley Walsh, Fearne Cotton and a mystery voice for Sport Relief charity from 7 March to 9 April 2012\n# Clare Balding temporary voice for Comic Relief from 12 February to 15 March 2013 (with the help of a barking dog, time announced as \"at the third woof\")\n# Davina McCall temporary voice for Sport Relief from 27 January to 23 March 2014\n# Ian McKellen temporary voice for Comic Relief from 24 February to 13 March 2015\n# Jo Brand temporary voice for Sport Relief from 22 January to 30 March 2016\nUnited States\nThe first automated time service in the United States began in Atlanta, Georgia in 1934 as a promotion for Tick Tock Ginger Ale. Company owner John Franklin modified Western Electric technology to create the machine that would become known as the Audichron. The Audichron Company became the chief supplier of talking clocks in the US, maintained by local businesses and, later, the regional Bell System companies.\nThe service became typically known as the \"Time of Day\" service, with the term \"speaking clock\" never being used.  Occasionally it would be called \"Time and Temperature\" or simply \"Time\".  However, the service has been phased out in most states (Nevada and Connecticut still maintain service). AT&T discontinued its California service in September 2007, citing the widespread availability of sources such as mobile phones and computers. , calling (202) 762-1401 from anywhere in the US will give a correct time from EST or UTC time.\nFor all area codes in Northern California, and on the West Coast generally, the reserved exchange was 767 which was often indicated by its phoneword, POPCORN; the service was discontinued in 2007. In other locations, different telephone exchanges are or were used for the speaking clock service.\nMany shortwave radio time signal services provide speaking clock services, such as WWV (voiced by John Doyle) and WWVH (voiced by Jane Barbe), operated by the National Institute of Standards and Technology from the United States of America. To avoid disruption with devices that rely on the accurate timings and placement of the service tones from the radio, the voice recording is \"notched\" clear of some of the tones.\nThe website Telephone World has recordings of past and present \"Time of Day\" services that also include temperature and weather announcements.\nSee also\n* :Category:Telephone voiceover talent\n* Greenwich Time Signal\nReferences\nExternal links\n*[https://collections.rmg.co.uk/collections/objects/254754.html Photograph of the Speaking clock announcer module (ZBA4264) built in 1955]\n*[https://www.britishtelephones.com/clocks/spkgclock.htm Website about the history of speaking clocks]\n*[http://www.audiovis.nac.gov.pl/obraz/88786/ & http://www.audiovis.nac.gov.pl/obraz/88783/ - Polish speaking clock device from 1936]\n* [https://www.nature.com/articles/139892a0 \"The Post Office Speaking Clock in Great Britain\"] - Nature, Volume 139, pp 892–893, published: 22 May 1937 (downloadable pdf)"
    }
  ]
}