{
  "content": [
    {
      "type": "text",
      "text": "# Speaking of the Weather\n\n| color_process     = Technicolor\n| runtime           = 7 minutes 24 seconds\n| language          = English\n}}\nSpeaking of the Weather is an animated cartoon short in the Merrie Melodies series produced by Leon Schlesinger for Warner Bros. Released to theaters on September 4, 1937, it was directed by Frank Tashlin and animated by Joe D'Igalo and Volney White.\nThe film centers around literary figures coming to life — a basic theme that Tashlin would later use in the subsequent shorts Have You Got Any Castles and ''You're an Education, both released in 1938. Collectively, the films are commonly referred to as the \"Tashlin Three.\"\nThe title is a pun on the idiomatic expression \"speak of the devil\".\nPlot\nIn a closed drugstore at midnight, the characters from all of the books and magazines are coming to life.\nAt the beginning of the film, \"Bob Boins\" (Bob Burns) introduces Ted Lewis (who according to Boins was once called \"Uncle Fudd\" back in Van Buren) who is seen playing Plenty of Money and You while various characters from magazines dance. After applause fades, a snake charmer on the cover of Asia plays and a hose from Better Homes & Gardens reacts. It sprays water as the scene segues into a caricature of orchestra conductor Leopold Stokowski leading the Storm movement from the William Tell Overture. After this, the title song is sung by a girl trio caricaturing the Boswell Sisters on the cover of Radioland magazine; all the while, Hugh Herbert is seen repeatedly smiling and adjusting his necktie.\nA bullish criminal on the cover of The Gang Magazine'', taking advantage of the distraction the sisters' performance provides, sneaks about and decides to use a blowtorch from the cover of Popular Mechanics to break into a safe on the cover of The Magazine of Wall Street. He is immediately arrested by detective \"Cholly Jam\" (Charlie Chan) and, after explaining himself to the police on the cover of True Confessions, he is tried, and sentenced to Life. However, he escapes through the cover of Liberty; but his escape does not go unnoticed by the columnist and radio personality Walter Winchell (here caricatured as \"Walter Snitchall\"). He reports it \"over the air\" which then leads to a wide variety of characters, including police officers, Boy Scouts, Tarzan, wild animals, and native Zulu tribesmen, joining the chase.\nThe Thin Man (a caricature of William Powell, who received an Academy Award nomination for playing the starring role in the film) uses Asta from the cover of Dog World to detect the criminal on the cover of Better Babies, and the criminal takes off in the carriage, only to be assailed by everyone from Navy battleships to Greta Garbo (who trips him with her large feet) and even Saint Nicholas. He ultimately ends up imprisoned behind the bars on the cover of Twenty Thousand Years in Sing Sing, and when Herbert laughs, the criminal uses a globe from the cover of a World Almanac to hit him in the head. At iris-out, it turns out he has stolen Herbert's laugh himself.\nReception\nMotion Picture Exhibitor (Aug 15, 1937): \"The pictures on the covers come to life. The Thug on the gang magazine cover robs the bank on Wall Street Magazine, is jailed on Life, breaks jail from Liberty, is pursued and captured by a mob of characters from other magazines. The ideas are funny, the color excellent, the pace fast. The take-offs on some popular characters are hilarious.\"\nMotion Picture Herald (Aug 21, 1937): \"This probably will be acclaimed as one of the finest jobs yet accomplished in the animated cartoon field. It will richly deserve this distinction for it is vastly entertaining and the product of a most fertile mind. All the action takes place in a magazine store, after hours. The magazines come to life, and the result is decidedly pleasing to watch.\"\nHome media\n* DVD - Gold Diggers of 1937 (USA 1995 Turner print added as a bonus)\n* LaserDisc - The Golden Age of Looney Tunes, Volume 1, Side 1\n* DVD - Looney Tunes Golden Collection: Volume 3, Disc 2 (With 1995 Turner Dubbed Version as the audio source.)\nReferences\nExternal links\n*\n* [https://archive.org/download/ClassicRareAndCensoredCartoons/090437SpeakingOfTheWeatherMmBr.mp4 Speaking of the Weather (Blue Ribbon) on the Internet Archive]\n* [http://www.supercartoons.net/cartoon/759/speaking-of-the-weather.html Watch Speaking of the Weather here]"
    }
  ]
}