{
  "content": [
    {
      "type": "text",
      "text": "# Special working group on parliamentary reform\n\nIn 2007 the President of the European Parliament, Hans-Gert Poettering, set up a special working group on parliamentary reform. It was chaired by Dagmar Roth-Behrendt MEP (member for Germany) and was to improve the efficiency and image of the European Parliament. Some ideas included livening up the plenary sessions and a State of the Union debate. It is due to produce a final report in July 2008, and put the recommendations into practice by the 2009 elections.\nFirst proposals\nOne of the group's key reform ideas, extra debates on topical issues, was rejected by MEPs (mainly from the centre-right) in July 2007 over fears it would disrupt committee work while attracting very few attendees. In response, ALDE leader Graham Watson MEP (member for South West England) withdrew from the group.\nMEPs did however back a proposal to use the European symbols more often in the Parliament. This comes after the European Council's agreement for the Treaty of Lisbon dropped the provisions of the Constitution which would have given the symbols official status. Jo Leinen MEP (member for Germany) suggested that the Parliament take the avant-garde in using the flag and anthem, the latter being rarely used in Parliament. The Parliament first adopted the European flag in 1983, three years before it was formally adopted by the Communities as a whole.\nInterim report\nAn interim report of the reform group was presented in September 2007. It proposes a number of changes to the house, including: Cutting down the debating time for texts with no legislative effect. In 2006, 92 \"own initiative\" reports (commenting rather than legislating) were tables and 22% of debating time was spent debating such reports, while only 18% was spent on legislative bills; it also proposed being more selective about inviting guest speakers to the house, the group stated that the new practice of inviting numerous heads of state to speak at the Parliament interrupted the normal legislative work of the house; a further idea to cap the number of amendments to documents was voted down.\nIt is hoped the changes will make the Parliament more political, however Graham Watson, who earlier left the group, stated that he doubts the grand coalition between PES and EPP-ED can get it approved due to opposition from conservative members who voted down the earlier proposals. Other members such as the co-chair of ID, Jens-Peter Bonde MEP (member for Denmark), wanted more radical proposals but Bonde did vote for the report stating that \"it is psychologically important to show that we want to become a more political parliament.\"\nFinal report\nThe final report, due to be voted on in the second week of July 2008, is being put forward by Richard Corbett MEP (PES member for Yorkshire and the Humber) who aims to gear Parliament's work towards areas where it actually has legislative powers. As described above, time on legislative bills would be increased at the expense of own initiative reports. These reports would be amended and voted on in the Committees with the plenary having a single vote on the document (plus a single vote for any alternative presented by group, but not line for line amendment).\nIn an effort to liven up debates and make the work more visible, the rapporteur for a legislative report would introduce, respond to and sum up a debate. There would also be new limits on written questions; at present, unlike other parliaments, there are no limits on the questions an MEP can ask the Commission during question time. The Commission has three weeks to respond to urgent questions and six for non-urgent questions but it often has to deal with a great number of questions that deal with issues outside its mandate (past examples include asking the Commission for information about the death of Osama bin Laden and whether Marks & Spencer uses weight distorting mirrors), sometimes to disrupt the working of the Commission. The new rules would make a question inadmissible if it: fell outside the remit of the European Union, contained offensive language or related to personal matters. If a question was already asked, the author would be informed but they could still maintain their question. This proposal faces opposition from some MEPs who consider it impinging upon their rights. The new rules on questions were approved in July 2008.\nReferences"
    }
  ]
}