{
  "content": [
    {
      "type": "text",
      "text": "# Spencer Park, Queensland\n\n| broke_ground =\n| built =\n| opened = 1963\n| renovated = 1981 (Gino Merlo Stand)\n| expanded =\n| closed =\n| demolished =\n| owner = Brisbane City Council\n| operator =\n| surface = Grass\n| scoreboard = Yes, next to clubhouse\n| construction_cost =\n| suites =\n| architect =\n| project_manager =\n| structural engineer =\n| services engineer =\n| general_contractor =\n| main_contractors =\n| capacity = 5,000 (2,500 grandstand)\n| record_attendance =\n| dimensions =\n| tenants = Brisbane City FC\nBrisbane Roar FC (women) (2025–Present)\n}}\nSpencer Park (currently known as Imperial Corp Stadium) is a football stadium located in the suburb of Newmarket, 4km north of the Brisbane CBD, Queensland, Australia. It is home to National Premier Leagues Queensland team Brisbane City FC.\nThe stadium, while officially holding 10,000, seats only 3,000 under the grandstand, the Gino Merlo Stand. The grandstand is mainly concrete steps with a small number of seats in the middle of the stand. There are also corporate boxes at the back of the grandstand.There are 4 entrances to the grandstand, 2 on each end and 2 in the middle, which are directly above the home and away changing room tunnels. The stadium entrances are controlled for some major events, where Brisbane City FC or Football Queensland typically charge for stadium entry at the gates, (e.g. $2 children, $5 adult, $10 family). There are also tables for seating outside the clubhouse.\nAt the clubhouse Brisbane City FC runs Wood-fired Pizza and Ribs events, where Italian foods are served cooked in two wood-fired pizza ovens built in 2023.\nHistory\nThe stadium opened in 1963 on the site of an old Brisbane City Council waste disposal site, and underwent a major renovation in 1981 with the construction of the Gino Merlo Stand. Since then there have been two sponsor based naming changes, with current naming rights given through Platinum-level sponsorship of Brisbane City FC by [https://www.imperialcoatings.com.au Imperial Corp].\n{| class=\"wikitable\"\n|+Names given to Spencer Park Football Field\n!Name\n!Duration\n|-\n|Imperial Corp Stadium\n|2022-present\n|-\n|Corporate Travel Management (CTM) Stadium\n|2015-2022\n|-\n|Spencer Park\n|1963-2014\n|}\nSpencer Park was selected by FIFA for the 2023 FIFA Women’s World Cup as a Training Site, with major renovations undertaken.\nIt used to be the location of La Rustica restaurant, where traditional Italian foods were served.\nIn September 2025, Brisbane Roar announced that the women's team would play at Spencer Park for the 2025–26 season.\nReferences"
    }
  ]
}