{
  "content": [
    {
      "type": "text",
      "text": "# Sperm Wars__disambig_1\n\n| illustrator      =\n| cover_artist     =\n| country          = United Kingdom\n| language         =\n| series           =\n| subjects         = Sperm competitionHuman sexualityEvolution\n| publisher        = Fourth Estate, London\n| pub_date         = 1996\n| english_pub_date =\n| media_type       = Print, Paperback\n| pages            = 384\n| isbn             = 978-1-85702-356-5\n| oclc             =\n| dewey            =\n| congress         =\n| preceded_by      =\n| followed_by      =\n}}\nSperm Wars is a popular science book by evolutionary biologist Robin Baker about sperm competition. Originally published in English in 1996, it has since appeared in 25 languages and in 2006 a 10th anniversary edition was published in the United States.\nDescription\nThrough a series of short fictional stories and discussion following them, Baker proposes evolutionary functions for sexual habits, mostly on the principle of competition between sperm of different men for a prized egg. The \"sperm wars\" include both literal battles between sperm inside a woman's reproductive tract, as well as figurative battles between men competing for the chance to mate.  The book is controversial, both because of its explanations of homosexuality, sexual assault, and prostitution, and because some critics have claimed that several of the hypotheses in the book are not supported by scientific research.\nOral sex is explained as an opportunity for partners to judge each other's reproductive health, and for mates to detect recent infidelity (also proposed by Kohl & Francoeur, 1995 \"The Scent of Eros\").  The shape of the penis and the thrusting during intercourse serve to remove other men's semen. Male masturbation is said to discard old, dying sperm, so that an ejaculate contains younger sperm that will stay active inside the cervix longer, with more of a chance of being present during the window of ovulation.  Baker also proposes that men adjust the amount of sperm they ejaculate based on the time their mate has spent away from them. Likewise, women are found to be more likely to engage in extra-pair copulation and retain larger amounts of sperm during their most fertile phase of the month, and more likely to have sex with their regular partner during the infertile phase.\nFocus\nA major focus of the book is sperm heteromorphism, in which not only are a variety of morphological types of sperm apparent in every normal human ejaculate, but also at any one time fewer than 1% seem capable of responding to and fertilizing an egg. A similarly low proportion of fertile sperm is found in the ejaculates of mice. Baker calls these fertile sperm \"egg-getters\", and claims that the rest of the sperm in the ejaculate are infertile \"kamikaze sperm\" or \"blockers\", whose primary purpose is to prevent other men's sperm from getting to the egg. He cites data suggesting that in Britain at least 4% of children (but perhaps as many as 6–12%) are conceived via sperm competition, and claims that this lower figure is consistent with the earlier finding that 10% of children have a biological father who is other than their supposed father. Baker describes in detail how \"killer sperm\" actively seek out rival sperm and kill them with poison from acrosomes to prevent them from getting to the egg.  This literal sperm warfare was not observed in a subsequent experiment, but Baker criticizes the protocol in this latter experiment.\nStudies\nBased on studies with a fiber optic endoscope attached to a man's penis during sex, Baker describes how the cervix behaves during sex and orgasm, dipping down \"like an elephant's trunk\" into the pool of semen so that the sperm can more easily swim into it, the so-called \"upsuck theory\" of female orgasm.  This has also come under some criticism; see Cervix#Function.  He theorizes about how the timing of orgasm can affect fertility, due to changes in the cervical mucus said to accompany orgasm, which then affect its ability to \"filter out\" sperm and prevent them from traveling into the cervix.  Other studies have found no connection to sperm transport or fertility.\nAlthough Baker draws a clear distinction between predatory rape and date rape, the book has drawn criticism for portraying date rape and \"rough-and-tumble intercourse\" as being on the same spectrum of behaviour: a test of the male's strength and ability. Despite Baker asserting that the two behaviours are at different (illegal and legal) ends of that spectrum, his statement that the drawing of the line between criminal and non-criminal behaviour is a job for the legal profession and not for the biologist has led some to interpret his words as meaning that he sees no real difference between the two:\nIn this context he makes comparison with the many examples of aggressively induced ovulation in mammals, including the extreme example of mink in which if the female does not experience physical trauma at the male's hands, she does not ovulate\nOrientation\nRegarding sexual orientation, he states that true homosexuals are rare; that only 6% of the male population engages in any sort of homosexual behavior in their lifetime, and that 80% of those also have sex with women, so he focuses on bisexuality.  \"It seems most likely that exclusive homosexuality is a genetic by-product of the reproductively advantageous characteristic of bisexuality.  If so, homosexual behaviour joins the ranks of a number of other human characteristics that are advantageous when a person has inherited a few of the relevant genes, but disadvantageous if they have inherited more.\"\nBisexuality in both men and women is explained as an adaptive trait because it provides earlier opportunities to gain sexual experience, and more opportunities to practice skills such as infidelity and interacting with people of different personalities.  Experience gained with a member of the same sex of a particular character type can help the bisexual to get the most out of a relationship with a member of the opposite sex of a similar character type.  Although studies show that by the age of 40 years bisexuals have fewer children than heterosexuals, he maintains that at low levels in the population bisexuality is still an evolutionary advantage since the children are typically conceived earlier in life; by age 20 years bisexuals have four times the reproductive success of heterosexuals, and by age 25 twice the success. Homophobia is then explained as a natural response to the threat of this reproductive advantage (despite the fact that true homosexuals are not in competition for females), as well as \"the bisexual's role in the spread of disease\".\nReferences\nExternal links\n*\n* [https://www.flatrock.org.nz/topics/men/sex_best_when_you_lose_your_head.htm Sex Is Best When You Lose Your Head] - on killer sperm and testicle size"
    }
  ]
}