{
  "content": [
    {
      "type": "text",
      "text": "# Spiny lobster culture in Vietnam\n\nWith a large coastal area of , and a 1 million km2 exclusive economic zone, Vietnam has the potential for a large mariculture.  One of the most valuable coastal aquaculture activities is raising spiny lobster species, especially the ornate lobster, Panulirus ornatus, a highly valued species in the seafood industry, especially in Asia, Europe, and America.  Spiny lobster farming in sea cages was first developed in Khánh Hòa Province of Vietnam in 1992, and has since expanded to 35,000 lobster cages in just over a decade, and has since become a US$100 million industry.\nBy production volume, spiny lobster production in Vietnam vastly exceeds that in any other country.\nVietnam's lobster culture technology and industry\nWild seedstock (juvenile) lobster collection\nSpiny lobster has a complex larval development, with many developmental stages making it extremely difficult to raise seeds for aquaculture in a hatchery. Consequently, spiny lobster seeds are collected from the wild using purse seines, specially designed collectors, traps and divers. The preferable size of the juveniles taken from the wild for aquaculture is 4–6&nbsp;cm. The size of harvested lobster is dependent on the time of the year and depth. Normally the best time to catch juvenile lobster is between May and November when the average size is 5–7&nbsp;cm, while at other times of the year they are smaller than 2&nbsp;cm. Large lobsters are commonly found in deeper waters and require divers to harvest them.\nCultivation in cages\nAfter the lobster seed is sold to farmers, they are normally placed into sea cages and grown to adult size for harvest at about 1&nbsp;kg. This takes about 18–24 months. Three methods of cage culture exist. The first farming method, is a floating cage, where a frame about 10 to 20 m2 in area is supported by buoys and holds the lobster cages, and is normally moored in waters 10-20m deep. Such cage method occurs most commonly on Nha Trang Bay. The second farming method is wooden fixed cages, made from 2.5m length by 10&nbsp;cm width wood with salt resistance, placed about 2 m apart so to create a square shape and normally have an area of 20–40 m2 up to 100–200 m2 with varying cage size. They are usually on or off seabed in areas with little wave activity. Normally such cage methods are found in Vân Phong Bay. The third cage farming method is the submerged cage method, made from iron mesh with meshing of 15–16&nbsp;mm, with an overall size of the cage ranging from 1–16 m2 and with a height of 1-1.5 m. These submerged cages, are most common around the Nha Phu Lagoon.\nFeeding\nAfter settling, young lobster are quite aggressive competing for habitat and food, but as they become juveniles and sub-adults they are generally gregarious in nature being attracted to each other by con-specific chemical cues and have a diverse diet. The wild seedstock normally used by farmers are past this early aggressive stage. When cultured in Vietnam, lobsters are normally fed trash fish, such as lizardfish, red bigeye, and ponyfish, that are caught as a by-product of fishing activities and fishery offal from the cleaning and processing of commercial fishery species. They are also fed mollusk such as sea snails, oysters, cockles etc.. These raw foods are given to the lobsters in the cages after being chopped into small pieces, and the mollusc shells are often removed for the younger lobsters.\nDisease\nMilky disease of lobsters developed in Vietnam in late 2006, and is assumed to be the result of poor quality lobster handling and rearing aquaculture techniques. The disease is likely to be induced by stress during handling and because of inadequate water quality conditions through long-distance transport from catching to farming locations. Similar symptoms are seen in other crustaceans such as cultured shrimp and are also induced by stress-related problems. Similar stress symptoms caused by low-quality water conditions are thought to trigger this disease as well as inducing a number of opportunistic pathogens due to the lobsters immune system being compromised by stress. However, milky hemolymph has been experimentally transmitted among lobsters by cohabitation and by infection of unfiltered haemolymph from diseased lobsters into healthy lobsters. Filtered haemolymph from a 0.45 μm filter is not infectious which probably indicates the involvement of a pathological entity transmitted by either water or food. Symptoms are commonly seen where there are too many lobster farming cages in one area. Milky disease caused a large decline in annual lobster production in Vietnam from 1,900 t in 2006 to 1,400 t in 2007. In a closed culture system, milky disease is seldom observed, but the lobsters can be infected by several other diseases, reducing survival rates. First, the shells of sick lobsters slowly change from a natural blue coloration to brown and finally dies without feeding for weeks. Second, at the base of the crawling leg as well as the abdominal segments, the orange colour comes out and one week later, the leg may be broken and lobsters die. It is also found that several lobsters of 10-30 g had special symptom in which the white rod shape look like frame of leaf on the abdominal segments and lobsters will die in mass very soon. These observation is reported from cultured lobster in recirculation system in Vietnam and unpublished.\nTransportation\nLobster seeds are first transported to farms, which on average takes up to 12 hours. Transport from the lobster farms, such as the ones located in Phú Yên, Khánh Hòa, Ninh Thuận, and Bình Thuận to trading centers in Hanoi or Ho Chi Minh City, occurs in open, aerated seawater tanks on trucks and normally takes anywhere from 7 to 20 hours. The live lobsters are then exported overseas once they are packaged in polystyrene boxes which are up to 20mm in thickness, together with plastic bags containing water and ice to help keep the lobsters cool. Small holes are also provided in the boxes for ventilation.\nMarkets\nSpiny lobster farming is a big industry in Vietnam, with the main markets in China and Taiwan, Vietnam competes in a market that is dominated by producers such as Australia, New Zealand, and Indonesia, who all together export up to 10,000 t annually, compared with the 1,500 t produced by Vietnam farms. However, farming lobsters allows for year-round supply and export that meets the high demand during off season, and thus Vietnam can sell at a higher market price.\nIndustry economics\nThis USD $100 million per annum lobster farming industry, has provided a source of income to over 400 families in Vietnam and created more than 100 employments a year, from lobster seed collectors to lobster farmers. However, being an industry that is highly dependent on wild lobster seed collection, it is highly unstable. Development of lobster seed hatcheries is needed to ensure a stable industry.\nReferences\nFurther reading\n* Jeffs, A. And Davis, M. (2007). \"The potential for harvesting seed of Panulirus argus (Caribbean spiny lobster).\" Australian Centre for International Agricultural Research (ACIAR) 132: 46–51.\n* Miller, C. L. O., C.L. And Creswell, L. (2007). \"Candidate Species for Florida Aquaculture: Caribbean Spiny Lobster, Panulirus argus.\" University of Florida IFAS Extension 147: 1–5.\n*Tuan, L.A. and Mao, N.D., 2004. Present status of lobster cage culture in Vietnam. Proceedings of the ACIAR lobster ecology workshop, p24-30. Institute of Oceanography, Nha Trang, Vietnam.\nExternal links\n* http://aciar.gov.au/project/FIS/2001/058\n* http://www.sitelevel.com//query.go?crid=12b04bdb4e1e26a7&query=spiny+lobster&B1=Search\n* http://siteresources.worldbank.org/INTVIETNAM/Resources/vn_fisheries-report-final.pdf\n*\n* http://www.enaca.org/modules/news/article.php?storyid=1765\n* http://www.shrimpnews.com/FreeNewsBackIssues/FreeNewsMay200718.html"
    }
  ]
}