{
  "content": [
    {
      "type": "text",
      "text": "# Split Archaeological Museum\n\n| type            = Archaeological museum\n| accreditation   =\n| key_holdings    = Greek colonization of the Adriatic, Roman Provincial and Early Christian era to the early Middle Ages.\n| collections     =\n| collection_size = 150,000\n| visitors        =\n| director        =\n| president       =\n| curator         =\n| owner           =\n| publictransit   =\n| car_park        =\n| website         = http://www.mdc.hr/split-arheoloski/nj/index.html Museum\n| network         =\n}}\nThe Split Archaeological Museum is the oldest museum in Croatia, established in 1820 by a decree of the Dalmatian government in Zadar. Some 150,000 artifacts cover prehistoric times, the period of Greek colonization of the Adriatic, Roman Provincial and Early Christian era to the early Middle Ages and the period of Croatian popular rulers. There is a collection of stone inscriptions from Salona and the collections of Graeco-Hellenistic ceramic objects, Roman glass, ancient clay lamps, bone, and metal articles, gems and coins.\nThe museum is housed at Zrinsko-Frankopanska 25 in Split. There is also a branch building in Solin (Salona and Tusculum ) and two regional centres at Vid near Metković (Narona Collection), and on the island of Vis.\nThe museum complex consists of a two-story main building, with the exhibition halls on the ground floor and the museum library and study rooms on the 1st floor. A row of arcades surrounding the main building house the lapidarium, and there is an attached garden.\nHistory\nAt the beginning of the 16th century, the Split humanist Dominik Papalic brought together a collection of ancient writing and picture tablets in his house, which he and poet Marko Marulić had found in the ruins of ancient Solin (Salona). In 1750 Papalic founded a museum.\nThe Split Archaeological Museum was founded in 1820 by the decree of the Dalmatian government in Zadar after a visit of Emperor Francis I to Dalmatia in 1818. The original museum building was erected in 1821 next to the eastern walls of Diocletian's Palace but this soon became too small to house the growing number of artifacts.\nThe Catholic priest, archaeologist, and historical researcher Frane Bulić was the museum director starting from 1884 for more than fifty years. He founded the first Croatian archaeological society in 1894 and developed the building of the second museum building from 1912 to 1914.  The new building was built according to the plans of the Viennese architects, August Kirstein and Friedrich Ohmann in the neo-Romanesque style.  The First World War delayed the opening of the new museum building, and the government only opened it to the public in early 1922.\nExhibits\nThe exhibits are mainly based on Split and Salona finds.\nA central part of the museum is a collection of stone inscriptions from Salona and Graeco-Hellenistic ceramic objects, Roman glass, ancient clay lamps, bone and metal articles, gems, medieval coins and an underwater archaeological collection.\nResearch\nThe museum does archaeological research in Salona, Issa, and Narona. The museum has two other collections in Vid near Metković and on the island of Vis.\nSince 1878, the Museum has published the first archaeological journal, entitled Bullettino di archeologia e storia dalmata ( Journal of Dalmatian Archeology and History ).\nCollections\nThe collections cover the entire history of Dalmatia from prehistory to the early Middle Ages. The museum also has an extensive collection of over 70,000 ancient and medieval coins and significant library and archive holdings.\nThe museum has eight collections:\n* Early Christian Collection on the Christian Archeology of Dalmatia\n* Old Croatian Collection on the Conquest of the Croats in the Balkans\n* epigraphic collection\n* Greek-Hellenistic collection on the Greek colonization of Dalmatia\n* Underwater archeology in the Adriatic Sea\n* Numismatic Collection\n* Roman Provincial Collection on the History of the Roman Province of Dalmatia\n* Prehistoric Collection on the history of the Illyrians\nSee also\n* List of museums in Croatia\nOther reading\n* Željko Rapanić, Zdenko Vinski et al. .: Archaeological Museum Split, Archaeological Museum in Split, Split 1990.\n* Dietrich Höllhuber: Croatian Adriatic Coast , DuMont Reiseverlag, Cologne 2009.\nExternal links\n* [http://www.mdc.hr/split-arheoloski/nj/index.html Museum] (Official site)\n* [https://www.armus.hr/muzej/virtualna-setnja Virtual tour of Museum]\n* [http://www.hrvatskoarheoloskodrustvo.hr/ Kroatische Archäologische Gesellschaft]\nReferences"
    }
  ]
}