{
  "content": [
    {
      "type": "text",
      "text": "# Spokane and Inland Empire Railroad\n\n| railroad_name=Spokane and Inland Empire Railroad\n| logo_filename=\n| logo_size=\n| system_map=Electric railway review (1906) (14572088359).jpg\n| map_size=270\n| map_caption=System map of the Spokane and Inland Empire Railway. (1906)\n| marks=S&IE\n| locale=Spokane, Washington to Coeur d'Alene, Idaho, and vicinity Palouse area\n| start_year=1904\n| end_year=1929\n| successor_line=Great Northern RailwaySpokane United Railways\n| hq_city=Spokane, Washington\n|image=Spokane and Inland Empire No. 8.jpg|image_caption=Spokane and Inland Empire Railway No. 8. near Coeur d'Alene. Built by J. G. Brill. (1910)}}\nThe Spokane and Inland Empire Railroad Company (S.&I.E.R.R.Co.) was an electrified interurban railway operating in Spokane, Washington and vicinity, extending into northern and central Idaho. The system originated in several predecessor roads beginning c. 1890, incorporated in 1904, and ran under its own name to 1929. It merged into the Great Northern Railway and later, the Burlington Northern Railroad, which operated some roads into the 1980s.\nHistory\nOne of the earliest components of Spokane's early interurban system was the Spokane and Montrose Street Railway, a narrow-gauge system with the distinction of being the first motorized street railway in Spokane.  Its owner, in 1893, was Francis H. Cook (1851–1920). Cook, embarrassed by the Panic of 1893, sold the line to a group of Spokane businessmen headed by Jay P. Graves (1859–1948) in 1902. Prior to this Graves and his partners had bought Cook's foreclosed land holdings in the Spokane area.\nGraves and partners from Portland, Oregon, reorganized the Spokane and Montrose as the Spokane Traction Company on February 1, 1903, incorporated it as the Spokane and Inland Empire Railroad Company in 1904, and rebuilt it as a standard gauge line. The routes were extended  through various areas of Spokane, including Corbin Park, Hillyard and Lincoln Heights. Initially, power for the line was purchased from the Washington Water Power Company. However, in 1909, Graves built a hydroelectric dam at Nine Mile Falls, Washington. This went on to power not only Spokane Traction and the Spokane and Inland Empire, but also sold surplus power locally.\nDuring this same period, Idaho Lumberman Frederick A. Blackwell (1852–1922) organized the Coeur d’Alene and Spokane Railway. Operating in conjunction with the Graves' lines in 1903 it formed a route between Spokane and Lake Coeur d'Alene in northern Idaho. Together, Graves and Blackwell developed properties along this line. \"To increase summer and holiday ridership,\" historian Laura Arksey notes, \"Graves and Blackwell opened beaches and amusement parks on Coeur d’Alene, Hayden, and Liberty lakes.\" The electric railway platform in Coeur d'Alene was built onto the docks to connect with steamboats on Lake Coeur d'Alene.\nBlackwell and Graves, together with James J. Hill of the Great Northern Railway, pushed the interurban lines to the south into the Palouse Country, eventually reaching Colfax, Washington, and Moscow, Idaho. This extension was operated under the name Spokane and Inland Empire. In 1908, Spokane Traction was sold to the Spokane and Inland Empire, but operated as a separate division. Hill purchased the Spokane and Inland Empire in 1909, retaining Graves as local president. Spokane and Inland Empire gradually reduced electric-powered passenger operations. In 1909, two Spokane and Inland Empire trains collided head on at Gibbs, Idaho (near Coeur d'Alene) killing 16 people and injuring over 100. This was the deadliest railroad accident in the state of Idaho.\nSpokane, Coeur d'Alene and Palouse\nAccording to the Spokane Spokesman-Review, the Spokane and Inland Empire was folded into the Great Northern Railway in 1929. Spokane Traction and its competing passenger lines operated by Washington Water Power were merged in 1922, forming Spokane United Railways. This company began a slow conversion to bus service, ending electric rail operations in 1936. The last electric line run to Moscow was recorded in April, 1939, and the last electric line run to Coeur d'Alene came in July, 1940.\nIn his history of the Spokane and Inland Empire, author Clive Carter asserts that although the interurban lines were financially unstable and expensive to operate, the outright purchase was warranted due to the large traffic the lines fed into the Great Northern system. This thinking led Hill to his purchase of the lines in 1909. However, following the Burlington Northern Railroad merger of 1970, the old interurban system was unprofitable and/or redundant (much of it was paralleled by routes of the former Northern Pacific Railway) and the Spokane and Inland Empire system was scrapped almost in its entirety between 1970 and 1985.\nPreservation\nis in background.]]\nThe only S&IE piece of equipment left is a lone boxcar at the Inland Northwest Rail Museum in Reardan, WA.\nRails to Trails\nSeveral Trails incorporate the Spokane and Inland Empire Railroad right-of-way:\n* The Centennial Trail between Coeur d'Alene and Spokane often follows the former Spokane and Inland Empire Railroad.\n* The Ben Burr Trail follows the Spokane and Inland Empire railway in the Palouse.\nPreserved Structures\nSeveral structures of the Spokane and Inland Empire Railroad still stand:\n* The frequency changing station on South Hill still stands and has been converted into condos.\n* The substation in Coeur d'Alene still stands and is now the Human Rights Education Center.\n* The car-barns in Spokane are occupied by the office of McKinstry Corp. today.\n* The Keisling, WA substation still stands as a private residence.\n* The Mt Hope, WA Substation stands as a private residence\n* The freight house in Rosalia, WA also still stands.\nSee also\n* Brill Motor Company\n* Frequency Changing Station\n* Great Northern Railway\n* Ohio Match Company Railway\n* Spokane, Portland and Seattle Railway\n* Westinghouse\nReferences\n* Arksey, Laura. \"Jay P. Graves (1858-1948).\" Web page, http://www.historylink.org/index.cfm?DisplayPage=output.cfm&file_id=7721. Accessed January 17, 2012.\n*\n* [http://www.spokesman.com/blogs/officehours/2010/jun/02/mckinstry-finds-way-restor-early-spokane-railway-history/ No author. \"McKinstry finds a way to restore early Spokane railway history.\" Spokane (Wash.) Spokesman-Review, June 2, 2010. Web page Accessed January 17, 2012.]\nExternal links\n*\n*"
    }
  ]
}