{
  "content": [
    {
      "type": "text",
      "text": "# Sport in Warsaw\n\n]]\nWarsaw is home to one major professional football club and a number of smaller clubs. The only one currently playing in the first division (Ekstraklasa) is Legia Warsaw.\nOverview\nOn 9 April 2008 the President of Warsaw, Hanna Gronkiewicz-Waltz, obtained from the mayor of Stuttgart Wolfgang Schuster a challenge award – a commemorative plaque awarded to Warsaw as the European Capital of Sport in 2008.\nThe Kazimierz Górski National Stadium, holds a capacity of 58,500 seat football (soccer) stadium, Warsaw's recently demolished 10th-Anniversary Stadium. The national stadium hosted the opening match, two group matches, a quarter-final, and a semi-final of UEFA Euro 2012, hosted jointly by Poland and Ukraine.\nat the Polish Army Stadium]]\nThere are many sports centres in the city as well. Most of these facilities are swimming pools and sports halls, many of them built by the municipality in the past several years. The main indoor venue is Hala Torwar, used for all kinds of indoor sports (it was a venue for the 2009 EuroBasket but it is also used as an indoor skating rink. There is also open-air skating rink (Stegny) and the horse racetrack (Służewiec).\nThe best of the city's swimming centres is at Wodny Park Warszawianka, 4&nbsp;km south of the centre at Merliniego Street, where there's an Olympic-sized pool as well as water slides and children's areas.\nFrom the Warsovian football teams, the most famous is Legia Warsaw – the army club with a nationwide following play at the Polish Army Stadium, just southeast of the centre at Łazienkowska Street. Established in 1916, they have won the country's championship fifteen times (most recently in 2021) and won the Polish Cup twenty times (most recently in 2023). In the 1995–96 UEFA Champions League season, they reached the quarter-finals, where they lost to Greek club Panathinaikos.\nTheir local rivals, Polonia Warsaw, have significantly fewer supporters, yet they managed to win Ekstraklasa Championship in 2000. They also won the country’s championship in 1946, and won the cup twice as well. Polonia's home venue is located at Konwiktorska Street, a ten-minute walk north from the Old Town.\nWarsaw was chosen as one of four Polish cities to host the UEFA Euro 2012 tournament alongside Ukraine. Its National Stadium hosted just under a sixth of the games in the competition. It hosted 3 group A matches (including the opening game), 1 quarter-final and 1 semi-final at the European tournament. Its city emblem (a mermaid) was chosen as the badge to symbolise the area. The city has also 4 teams who have their team base there or thereabouts: Russia, Croatia, Greece and of course, Poland. The stadium is fully equipped including a folding roof (largest cubic volume in Europe) and a 56,000 seater capacity. The host stadium was only completed in November 2011, under a year before the start of UEFA Euro 2012 and it has hosted 2/3 of Poland's group matches.\nMen's notable football clubs\n* Legia Warsaw\n* Polonia Warsaw\n* Ursus Warsaw\n* Gwardia Warsaw\n* Hutnik Warsaw\nBasketball notable teams\n* Dziki Warsaw\n* Legia Warsaw\n* Polonia Warsaw\nVolleyball notable teams\n* Projekt Warsaw\nStadiums and arenas\n* Stadion Narodowy\n* 10th-Anniversary Stadium\n* Polish Army Stadium\n* General Kazimierz Sosnkowski Stadium\n* Arena COS Torwar\n* Arena Ursynów\nOther\n* Cumann Warsaw – Gaelic Athletic club\n* Warsaw Eagles – American football club, 2006 and 2008 Polish American Football League champion\n* Warszawianka – sports club\n* Warsaw Marathon – annual marathon\nReferences"
    }
  ]
}