{
  "content": [
    {
      "type": "text",
      "text": "# Spring 2013 United Kingdom cold wave\n\nThe Spring 2013 United Kingdom cold wave was a period of unusually cold weather in the United Kingdom between 6March and early April 2013. The cold wave consisted of very low temperatures and significant snowfall. Freezing temperatures worsened due to the significant overcast and cloud covered skies. Extensive snowfall occurred on 11 and 12March in the South East, North and West of England and Wales. Most parts of England, north Wales and the Isle of Man also suffered heavy persistent snowfall on 22 and 23March 2013.\nOverview\nDuring the cold spell, the low temperatures were not extreme, yet they were notable because of the extended duration of below average temperatures. Official weather reports show that temperatures stayed below  for nine consecutive days. March 2013 was reported to be tied for the country's fourth-coldest March since 1910. Mean temperatures were  below-average from February to early April, and there was a continuous, strong, cold easterly wind.  31March was confirmed by the Met Office as the coldest Easter Day on record, with the lowest temperature reaching  in Braemar. The Central England Temperature, a long run of weather records dating back to 1659, reported its lowest March average since 1883. Furthermore, March was the coldest month of 2013 and the coldest month of the winter season of 2012–13.\nSnowfall\nThe snowfall on 11 March primarily affected Northern France but it also disrupted communities and roads in Kent and Sussex in Southeast England. On 22March, the UK saw another snowfall. It was described as the worst March snowfall in 30 years. Areas of Northwest England, North Wales, Southwest Scotland and Northern Ireland were affected the most. Up to  of snow was reported to have fallen with up to  snow drifts. There was a continuous covering of snow throughout the country from 11March to 1April.\nMoreover, from the 22 of March the Isle of Man recorded its heaviest snowfall since 1963. Strong winds and very heavy snowfall resulted in horrendous conditions with drifts up to 4-foot deep particularly across eastern half of the island. Consequently, roads on the island were extremely hazardous with blockages, hundreds of homes left without power and a significant loss of livestock.\nImpact\nThe cold weather caused several problems with electricity, agriculture and road networks. Some migratory birds such as the chiffchaff, sand martin, willow warbler, blackcap, and the little-ringed plover arrived late in 2013 as a result of the abnormally harsh weather. The spring germination and growth of plants was delayed, affecting nurserymen and market gardeners, and causing the daffodil flower crop to bloom too late for Mothering Sunday and Easter. There were also significant issues with livestock, especially mass deaths of sheep and newborn lambs.\nReferences\nFurther reading\n* [https://www.independent.co.uk/news/uk/home-news/the-10-worst-british-winters-ever-8945584.html \"The 10 Worst British Winters Ever\"] from The Independent\n* [https://www.bbc.com/news/uk-22718944 \"Spring will be coldest in 50 years, Met Office says\"] from BBC News"
    }
  ]
}