{
  "content": [
    {
      "type": "text",
      "text": "# Spring Creek, Queensland (Darling Downs)\n\n| pop                 = 195\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4361\n| area                = 71.8\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 54.6\n| dir1                = S\n| location1           = Toowoomba CBD\n| dist2               = 161\n| dir2                = SW\n| location2           = Brisbane\n| dist3               =\n| dir3                =\n| location3           =\n| dist4               =\n| dir4                =\n| location4           =\n| lga                 = Toowoomba Region\n| lga2                = Southern Downs Region\n| stategov            = Condamine\n| stategov2           = Southern Downs\n| fedgov              = Maranoa\n| near-n              = Headington Hill\n| near-ne             = Upper Pilton\n| near-e              = Upper Pilton\n| near-se             = Forest Springs\n| near-s              = Allora\n| near-sw             = Elphinstone\n| near-w              = Clifton\n| near-nw             = Headington Hill\n}}\nSpring Creek is a rural locality split between the Toowoomba Region and the Southern Downs Region, Queensland, Australia. In the , Spring Creek had a population of 195 people.\nGeography\nThe New England Highway runs through from north to south. Gatton–Clifton Road passes to the north-west.\nThe land use is predominantly cropping with some grazing on native vegetation.\nHistory\nSt Matthew's Anglican Church was dedicated on 8 March 1876 by Bishop Matthew Hale. It closed in 1969 through loss of its congregation to larger towns.\nSpring Creek State School opened on 15 August 1871 and closed on 8 May 1954. It was located at 616 Spring Creek Road ().\nStannum Provisional School opened on 16 August 1915. On 1 April 1920 it became Stannum State School. It closed circa 1924.\nSpring Creek Upper State School opened in early 1915 at Mrs Hill's before a school building opened on 7 July 1915. It had a temporary closed from August 1950 to February 1952. It closed finally in 1970. It was located at 318 Doyle Road ().\nTable Top State School opened on 29 January 1952 and closed on 30 January 1963. Tabletop parish () is to the immediate north of Allora in the vicinity of the present day locality of Spring Creek.\nDemographics\nIn the , Spring Creek had a population of 354 people.\nIn the , Spring Creek had a population of 194 people.\nIn the , Spring Creek had a population of 195 people.\nEducation\nThere are no schools in Spring Creek. The nearest government primary schools are Clifton State School in neighbouring Clifton to the west, Allora State School in neighbouring Allora to the south, and Pilton State School in Pilton to the north. The nearest government secondary schools are Allora State School (to Year 10 only) in neighbouring Allora to the south and Clifton State High School (to Year 12) in neighbouring Clifton to the west.\nReferences\nExternal links\n*"
    }
  ]
}