{
  "content": [
    {
      "type": "text",
      "text": "# Squid King\n\n| mapframe           = yes\n| mapframe-zoom      = 13\n| height_metric = 400\n| width_metric = 800\n| length_metric = 1300\n| weight = 5 tonnes\n}}\nis a statue of a Japanese flying squid in Noto, Ishikawa, Japan. Designed to promote tourism and the town's fishing industry, the statue attracted widespread criticism as its construction had mostly been paid for with  from the town's COVID-19 relief money. According to the town, the statue and resulting media coverage resulted in a boost to the town's tourism industry.\nDescription\nThe Squid King is a fibre-reinforced plastic lifelike statue of a \"giant\" pink and white Japanese flying squid (Todarodes pacificus). The statue is  long,  tall,  wide, and weighs around . It has long legs, \"goggling eyes\", and there is a hole in the statue located where a real squid's mouth would be, to allow people to look out from inside the squid. Squid King is located in front of  in Noto, Ishikawa's Noto Tsukumo Bay Tourism Exchange Center (), also known as the Squid Station Mall (). It was officially named Squid King () in June 2021 after a public contest; the town received 909 submissions for names. During the naming ceremony, the town installed a plaque by the statue. Squid King has an official X account.\nConstruction\nThe statue's construction cost , with 25 million coming from COVID-19 relief funds and grants given to Noto by the Japanese government and the rest coming from the town. Noto had been given  by the Japanese government to help it through the COVID-19 pandemic. According to Noto town, the Squid King was designed to aid the town by promoting tourism and the town's fishing industry. The theme of the statue was chosen so tourists could eat squid at the local shops and be \"eaten\" by a giant squid themselves. The town additionally planned to build a \"shop, restaurant, tourist information center and exhibition corner\", later the Noto Tsukumo Bay Tourism Exchange Centre, starring Squid King. The mall itself cost  to build.\nReception\nSquid King was revealed to the public in April 2021 and met with widespread criticism because it had been constructed with COVID-19 relief funds. Several residents felt that their money should have gone to healthcare workers or other causes more directly related to the COVID-19 virus. The resulting controversy was covered in non-Japanese media such as the BBC and The New York Times. After a while it gained a following, partially resulting from its international coverage. According to the Mainichi Shimbun, the statue had become \"symbolic\" of the town. A study published by Noto township in 2022 said that the town's economy had experienced a  boost from tourism and 45% of the 439 tourists they surveyed answered that they had come to Noto to see Squid King.\nThe statue survived the January 2024 Noto earthquake and resulting tsunami with little to no damage. In the immediate aftermath, the Squid King official Twitter account posted \"I didn't return to the sea.\" The statue's survival was seen by some residents, especially city officials, as a symbol of recovery and hope. However, others were more indifferent. Squid Station Mall, which was closed as a result of the earthquake, re-opened in April. In October 2024, the town made Squid King the honorary chairman of their Junior Police Officer program (), as part of a move to educate the children of Noto about crime prevention. In June 2025, the  sponsored a festival to commemorate the opening of the statue, with performances and demonstrations by local children.\nReferences\nExternal links\n*\n* [https://ikanoeki.com/ Squid Station Mall]"
    }
  ]
}