{
  "content": [
    {
      "type": "text",
      "text": "# Squire Francis War\n\nThe Squire Francis War (Dutch: Jonker Fransenoorlog) took place in the County of Holland between November 1488 and August 1490. It was the last outburst of the Hook and Cod wars. A Hook minority captured Rotterdam in early November 1488, and from there attempts were made to get towns and villages to become Hookist. This faction was led by Frans van Brederode (namesake of this war), a squire and descendant of an illustrious noble family. Frans revolted against the provincial administration of stadholder John III of Egmont dominated by the Cod.\nBackground\nWhen the Utrecht war of 1481–83 was settled in 1483, the Hook movement was in the minority. This decline in following started when William VI, Count of Holland died in 1417. The conservative-minded Hooks were mostly dominated by the Cods from 1484 onwards. The Hooks found refuge in places like Alphen, Montfoort, Zevenbergen and Sluis. The latter town became a place of refuge where Hooks and other exiles could settle. For example, the Hook nobles Jan van Naaldwijk, Jan and Zweder van Montfoort, Jan van Jaarsveld, Jan van Vliet, Walraven, Hendrik, Joris (the bastard), Anthonius van Brederode and Walraven (the bastard) van Brederode, Jacob van Alkemade and Floris van Alkemade, Jan van Tetrode, Otto van Botland, Dirk van Hodenpyl, Cornelis van Treslong and Reynier van Broeckhuysen were able to settle in Sluis.\nIn 1488, it was decided to set up a commission to appoint a new leader of the Hook because the Hook did not agree with the appointment of Maximilian of Austria as regent of the Netherlands on behalf of his son Philip the Handsome of Burgundy. The most important nobles among the Hook were mainly the Brederodes which made it not surprising that the new leader was elected from that family. There were also the Naaldwijks and the Montfoorts who were popular to a lesser extent. The three-member committee consisted of Walraven II of Brederode, Jan of Naaldwijk and Zweder of Montfoort. Walraven II was in an inner dilemma about taking up leadership himself and thought of his studying brother Frans. The latter was visited in Leuven and persuaded to travel with him to Sluis. There it was decided that Frans could lead the Hook.\nCampaigns\nOn November 13, 1488, a fleet of 43 cogs departed, with a number of battalions (about 800 to 1,000 men) on board. On November 15 they sailed up the Meuse and on November 16 they landed at Delfshaven, where a large group went ashore. On November 18, this group took the city of Rotterdam through the Schiedam Gate. From then on, piracy prevailed on the Maas and other rivers and the surrounding land around Rotterdam was plundered.\nIn mid-December 1488, a squadron of 700 men left for Schoonhoven. In mid-January this town was stormed several times, but these attempts at capture failed completely. The men commanded by Frans van Brederode set fire to Delfshaven and Schoonderloo during their plunder in 1488/1489, when they were threatened by their enemies. The Hooks took the castle IJsselmonde and the first skirmishes with the city of Schiedam took place. Jan III van Montfoort managed to capture the city of Woerden in the name of Frans van Brederode.\nMaximilian of Austria returned to Holland and made plans to lay siege to Rotterdam. The Hooks attempted to take Schiedam in February 1489. Around February 11, 1489, the Siege of Rotterdam was begun and the city got surrounded by closed waterways through Jan III of Egmont, who at some point had 25,000 troops at his disposal. However, the city was not taken and it took until the end of June before the city was transferred by “treaty.” The purpose of the siege was to close off the shipping lanes and make further looting impossible. Arson attacks took place in Crooswijk and Ouderschie (today's Overschie). 600 Hooks carried out an attack on the city of Delft, but it was prevented in time by the city guard during a man-on-man battle at the Schie (May 1489). During a raid by the Hooks, the battle on the Lek occurred in June. This involved the presence of about 200 Hooks' flags. After the defeat of the Hooks, 350 Hooks, led by Jan van Naaldwijk, managed to escape in time and took refuge in Montfoort. In July/August, Hooks carried out arson and looting raids in and around The Hague, Delfland, Vlaardingen and Maasland. Skirmishes and attacks took place in Leiden and Gouda. The house ter Poelgeest was taken by the Hooks. In June 1490, the Hooks suffered a heavy defeat after a smuggling campaign at the battle of Moordrecht, along and on the Hollandse IJssel. Meanwhile, the siege of Rotterdam worsened living conditions there.\nJan van Naaldwijk, captured at the Battle of Moordrecht, was released from Dordrecht in August/September. Van Naaldwijk had to persuade Rotterdam to surrender. Frans van Brederode decided to change course a month later and left Rotterdam with a considerably depleted fleet, shortly thereafter Woerden and Montfoort were also captured by Cods.\nVan Brederode held out near the islands of Zeeuwse and poached the islands there up to the worth of Zwijndrecht. Stadholder John III of Egmont decided to sail with a fleet toward Brouwershaven, and there the naval battle at the hole of Brouwershaven took place. Frans van Brederode was wounded, in the process he fell into the water and could be captured.\nWith the capture of Brederode and several other captains, the Jonker Frans War was over. Frans van Brederode was transferred to Dordrecht and imprisoned in the Puttox Tower pending trial. However, he died in his cell from his injuries sustained.\nAftermath\nAfter Frans was ousted and his war ended, it was evident in Rotterdam that daily life had come to a virtual standstill; for example, the herring fleet had been largely destroyed, and of the originally inhabited houses (1275), only 972 were now habitable. There were only 11 deployable ships at that time (1490). But compared to surrounding cities like Delft - this city had lost its entire fleet - and Gouda, which saw half of its homes burnt out, Rotterdam had a head start and would grow into the city it is today.\nThe Hook and Cod Wars were ended forever with the signing of a treaty in 1492.\nReferences"
    }
  ]
}