{
  "content": [
    {
      "type": "text",
      "text": "# Squirrel king\n\nA squirrel king is a collection of squirrels whose tails have tangled together, making them unable to separate themselves. It is similar to a phenomenon recorded in rats, the rat king. A squirrel king starts as a litter of young in the same nest, whose tails become knotted together by nesting materials and/or by tree sap gluing the tails together, particularly if the young squirrels have been gnawing bark of the tree that their nest is in, letting sap flow. If the squirrels are not separated, they may fall to the ground still joined to each other when they try to come out of their nest, and will invariably die unless separated through human intervention. Unlike the rat king, the squirrel king is not found in medieval European literature.\nList of naturally occurring incidents\n{| class=\"wikitable sortable\"\n|-\n! Occurrence\n! Quantity of squirrels\n! Location\n! Country\n! Description and outcome\n|-\n|September 1989\n|4\n|Easton, Pennsylvania\n|United States of America\n|They were severely injured and euthanized.\n|-\n|1991\n|5\n|Baltimore, Maryland\n|United States of America\n|They were tangled and glued together by tree sap. They were successfully separated. Of the 5, 2 were albino squirrels.\n|-\n|July 1997\n|5\n|Brantford, Ontario\n|Canada\n|They were tangled and glued together by tree sap. They were successfully separated.\n|-\n|June 2013\n|6\n|Regina, Saskatchewan\n|Canada\n|They were tangled and glued together by tree sap. They were successfully separated alive.\n|-\n|26 August 2013\n|5\n|Michigan City, Indiana\n|United States of America\n|Babies were almost euthanized after initial failures at separation. The day after disentanglement they returned to their mother.\n|-\n|November 2014\n|3\n|Maryland\n|United States of America\n|Glued together by tree sap.\n|-\n|29 April 2016\n|3\n|Beaver Falls, Pennsylvania\n|United States of America\n|Juveniles were successfully untangled.\n|-\n|May 2016\n|5\n|Winnipeg, Manitoba\n|Canada\n|Babies were successfully separated.\n|-\n|21 May 2017\n|4\n|Bangor, Maine\n|United States of America\n|Juveniles were successfully separated, then released that day to reunite with their mother.\n|-\n|mid-May 2018\n|6\n|Elkhorn, Nebraska\n|United States of America\n|8-week-olds were successfully untangled, and all lived.\n|-\n|Summer 2018\n|4\n|Nova Scotia\n|Canada\n|By the time the juveniles were discovered, 3 had died. To separate them, the tail of the survivor had to be amputated.\n|-\n|mid-September 2018\n|4\n|Loveland, Colorado\n|United States of America\n|Babies were successfully separated at the Larimer Humane Society.\n|-\n|23 September 2018\n|3\n|Boulder, Colorado\n|United States of America\n|They were successfully untangled.\n|-\n|September 2018\n|5\n|Wisconsin\n|United States of America\n|They were successfully untangled.\n|-\n|May 2019\n|4\n|Stockton on Tees, County Durham, England\n|United Kingdom\n|Babies were successfully separated.\n|-\n|19 September 2019\n|4\n|Beacon Falls, Connecticut\n|United States of America\n|Babies were successfully separated, however, part of 1 tail needed to be amputated.\n|-\n|10 September 2020\n|5\n|Multnomah Village, Oregon\n|United States of America\n|Babies were separated.\n|-\n|24 May 2021\n|5\n|Duluth, Minnesota\n|United States of America\n|Five young squirrels found in a compost pile stuck together by their tails. Gathered babies in a cardboard box to transport to local vet parking lot to free them. All babies were rescued and they ran away shortly after.\n|-\n|1 October 2021\n|7\n|Grand Blanc Township, Michigan\n|United States of America\n|Babies were successfully separated by police officers.\n|-\n|14 May 2022\n|7\n|Seaforth, ON\n|Canada\n|Babies were successfully separated.\n|-\n|September 2023\n|3\n|Eagan, Minnesota\n|United States of America\n|Three adolescent squirrels found in a brush pile with entangled tails. All three tails needed to be partially amputated. Food and water were provided; two of three survived and ran off.\n|-\n|11 September 2023\n|5\n|Norfolk, Massachusetts\n|United States of America\n|Five babies were rescued after falling out of their nest due to tails being stuck together with tree sap.\n|-\n|11 September 2024\n|5\n|Bend, Oregon\n|United States of America\n|Several squirrels were pictured stuck together and unstuck by a local wildlife organization.\n|-\n|30 September 2024\n|5\n|Erie, Colorado\n|United States of America\n|Five juvenile squirrels fell out of an ash tree. Overnighted in a cardboard box, in a garage, before being successfully separated by a local wildlife organization the next day. All were released, within 20 hours, back to the tree from which they fell.\n|-\n|6 June 2025\n|5\n|Dwight, Ontario\n|Canada\n|5 squirrels - 3 babies, 1 juvenile, and one adult - stuck together with sap, leaves, and a string. Adult squirrel pulled loose on its own, damaging tail. Juvenile and babies were successfully separated with soapy water.\n|}\nUnnatural incidents\nThere have been incidents of animal cruelty or taxidermic artwork, where humans tied the tails of squirrels together, making something resembling the natural squirrel king.\nIncidents of animal cruelty\n* On 19 September 2019, 4 squirrels were found knotted together and tied up, on railroad tracks in Berlin, Connecticut, USA. They survived to be separated, but needed some amputation. In order to tie them up, the person who performed the act had to break their tails.\nReferences\nFurther reading\n*\nExternal links\n*  |series= Wochit News |author= Wochit |air-date= 17 September 2018 }}\n*  |series= A Day |author= Andrew Day |air-date= 21 May 2017 }}\n*  |series= Geo Beats |date= 18 June 2013 }}"
    }
  ]
}