{
  "content": [
    {
      "type": "text",
      "text": "# Squier-Hall Award\n\nThe Squier-Hall Award for NASCAR Media Excellence is an award in the NASCAR Hall of Fame that is presented to a member of the media for their contributions to NASCAR. The award has been presented each year since 2013. It is named after Ken Squier and Barney Hall, who were the inaugural recipients of the award.\nRecipients\n{| class=\"wikitable\"\n! Year !! Person !! Image !! Role\n|-\n| 2013 || Ken Squier &  Barney Hall ||   (Hall)  (Squier not pictured) || Squier: NASCAR on CBS and NASCAR on TBS play-by-play announcer  Founder of and commentator for Motor Racing Network  Hall: Commentator for Motor Racing Network\n|-\n| 2014 || Chris Economaki ||  || NASCAR on CBS and NASCAR on ESPN/ABC commentator  Founder of National Auto Racing News (now Speed Sport)\n|-\n| 2015 || Tom Higgins || || NASCAR writer for The Charlotte Observer\n|-\n| 2016 || Steve Byrnes ||  || NASCAR on Fox pit reporter and NASCAR Race Hub host\n|-\n| 2017 || Benny Phillips || || NASCAR writer for the High Point Enterprise and Stock Car Racing Magazine  NASCAR on TBS reporter\n|-\n| 2018 || Norma \"Dusty\" Brandel || || NASCAR writer for the Hollywood Citizen-News\n|-\n| 2019 || Steve Waid || || NASCAR writer for the Martinsville Bulletin, Roanoke Times & World News, the Grand National Scene magazine, and NASCAR Illustrated\n|-\n| 2020 || Dick Berggren ||  || NASCAR on CBS, TNN, ESPN and Fox pit reporter  Editor of Speedway Illustrated\n|-\n| 2021 || Bob Jenkins ||  || NASCAR on ESPN play-by-play\n|-\n| colspan=4| The award was not given out in 2022 due to the COVID-19 pandemic postponing the induction ceremony of the 2021 recipient.\n|-\n| 2023 || T. Taylor Warren || || Photographer who took the picture of the 1959 Daytona 500 photo finish  Photographer for the first 50 Daytona 500's (1959–2008)\n|-\n| 2024 || Shav Glick || || NASCAR writer for the Los Angeles Times\n|-\n| 2025 || Mike Harris || || NASCAR writer for the Associated Press\n|-\n| 2026 || Deb Williams || || NASCAR writer for United Press International, NASCAR Winston Cup Scene, The Gaston Gazette, USA Today, Racing Today, ESPNW.com and Autoweek  One of the first female journalists to regularly cover NASCAR\n|}\nReferences\nExternal links"
    }
  ]
}