{
  "content": [
    {
      "type": "text",
      "text": "# Sri Venkateswara University College of Engineering\n\n| motto_lang             = Sanskrit\n| parent                 = Sri Venkateswara University\n}}\nThe Sri Venkateswara University College of Engineering (abbreviated SVUCE), Tirupati is a Constituent and Autonomous College of  Sri Venkateswara University. It is located in the Sri Venkateswara University campus at the foothills of Lord Sri Venkateswara Swamy in Tirupati, India. The college offers a four-year B.Tech degree program with a total intake of 396 students across six engineering departments, a two-year M.Tech degree program with nine specializations and an intake of 180 students, and Ph.D. programs in all engineering departments.\nThe admission into undergraduate programmes is through a state level common entrance test EAMCET. The admission into postgraduate programme is 70% of students through GATE or AP PGECET and 30% of Students through Self-finance Management Category .\nHistory\nSVUCE, a constituent and Autonomous College of Sri Venkateswara University, Tirupati, was established in 1959 and started functioning from 10 August 1959.\nThe foundation stone for the college Main Building was laid on 13 October 1959 by Pandit Jawaharlal Nehru, the first Prime Minister of India. It was declared open on 21 November 1968 by Sri. K Brahmananda Reddy, the then Chief Minister of Andhra Pradesh.\nFrom the year 1977–78, the names of BE and ME were changed as B.Tech. and M.Tech. The institution achieved autonomous status in 2005.\nDisciplines\nCurrently the college offers B.Tech. courses in:\n* Civil Engineering (from 1959 to 1960)\n* Electrical and Electronics Engineering (from 1959 to 1960)\n* Mechanical Engineering (from 1959 to 1960)\n* Electronics and Communication Engineering (from 1971 to 1972)\n* Chemical Engineering (from 1977 to 1978)\n* Computer Science and Engineering (from 1986 to 1987)\nAt first three conventional disciplines of Civil, Electrical and Mechanical Engineering were offered with an intake of 40 in each as part of Bachelor of Engineering (B.E) degree. Subsequently, new disciplines were introduced in tune with the emerging trends and needs - Electronics and Communication Engineering in 1971–72, Chemical Engineering in 1977-78 and Computer Science and Engineering in 1986–87.\nPart-time degree course for diploma holders and serving engineers was run for a number of years from 1973-74 until recently in three conventional disciplines of Civil, Mechanical, Electrical and Electronics, Electronics and Communications.\nPostgraduate courses (ME) in engineering branches were started in the year 1971–72 in Departments of Civil Engineering, Electrical and Electronics Engineering, Electronics and Communication Engineering. Subsequently, PG courses were introduced in Chemical Engineering and Computer Science and Engineering.\nEach discipline admits a maximum of 60 students in the bachelor's stream and a maximum of 24 students in each of the postgraduate specializations per academic year.\nExtracurricular activities\n* NCC - Air Wing\n* NSS\n* Ignite - Students Club\nPrincipals\n{| class=\"wikitable\"\n|-\n! Sl.No. !! Name !! During !! Sl.No. !! Name !! During\n|-\n| 1. || Prof. G. Ramakrishnan || 1959-77 || 16. || Prof. G. Ram Prasad || 2002–02\n|-\n|2.\n|Prof. B. Mohan Rao\n|1977-78\n|17.\n|Prof. B. Subramanyam\n|2002-04\n|-\n| 3. || Prof. K. Gopichand || 1978-81 || 18. || Prof. N. C. Eswara Reddy || 2004–06\n|-\n|4.\n|Prof. P. Subramanian\n|1981-82\n|19.\n|Prof. K. Ravindranath\n|2006-08\n|-\n| 5. || Prof. C. Venkataramaiah || 1982-83 || 20. || Prof. M. M. Naidu || 2008–10\n|-\n|6.\n|Prof. P. Pratapa Mouli\n|1983-85\n|21.\n|Prof. M. Muralidhar\n|2010-11\n|-\n| 7. || Prof. C. Raja Rao  || 1985-87 || 22. || Prof.  A. Prabhakar  || 2011–12\n|-\n|8.\n|Prof. D. R. Raju\n|1987-90\n|23.\n|Prof. A. Ramakrishna Rao\n|2012-13\n|-\n| 9. || Prof. T. Rangaswamy || 1990-91 || 24. || Prof. J. Karthikeyan  || 2013–15\n|-\n|10.\n|Prof. K. L. Narayana\n|1991-93\n|25.\n|Prof. P. Mallikarjuna\n|2015-17\n|-\n| 11. || Prof. M. Krishna Murthy  || 1993-95 || 26. || Prof. G. Padmanabhan  || 2017–18\n|-\n|12.\n|Prof. K. Ranganadha Babu\n|1995-97\n|27.\n|Prof. G. N. Pradeep Kumar\n|2018-19\n|-\n| 13. || Prof. T. Krishna Parandhama  || 1997-99 || 28. || Prof. S. Narayana Reddy  || 2019–22\n|-\n|14.\n|Prof. B. Swamy\n|1999-2000\n|29.\n|Prof. R. V. S. Satyanarayana\n|2022–Till date\n|-\n| 15. || Prof. D. Changal Raju  || 2000-02 || || ||\n|}\nAlumni\nNotable alumni\n* Raj & DK, filmmaker duo\nAlumni Association\nThe college alumni has presence all over the globe. The alumni association of SVUCE was started in 1965. It was formally registered in the year 2001. The association is currently presided by B. Gangi Reddy.\nThere are hundreds of SVUCE alumni based in western countries such as the US, Canada, Australia, and UK. This powerful alumni network has led to job opportunities for many graduates.\nThe official Alumni Network of SVU College of Engineering website is .\nReferences\nExternal links\n* [http://svuce.edu.in/ SVUCE website]\n* http://svuce.edu.in/Pages/About/History.aspx"
    }
  ]
}