{
  "content": [
    {
      "type": "text",
      "text": "# SS City of Peking\n\n{|\n|Ship name=City of Peking\n|Ship namesake=Beijing, China\n|Ship owner= Pacific Mail Steamship Company\n|Ship operator= Pacific Mail Steamship Company\n|Ship registry=New York\n|Ship route= San Francisco – Yokohama – Hong Kong\n|Ship ordered=\n|Ship awarded=\n|Ship builder=John Roach & Sons, Delaware River Iron Ship Building and Engine Works\n|Ship original cost=\n|Ship yard number=130\n|Ship way number=\n|Ship laid down=\n|Ship launched=March 19, 1874\n|Ship sponsor=\n|Ship christened=\n|Ship completed=\n|Ship acquired=\n|Ship commissioned=\n|Ship recommissioned=\n|Ship decommissioned=\n|Ship maiden voyage=February 1875\n|Ship in service=\n|Ship out of service=\n|Ship renamed=\n|Ship reclassified=\n|Ship refit=\n|Ship struck=\n|Ship reinstated=\n|Ship homeport=\n|Ship identification=\n|Ship motto=\n|Ship nickname=\n|Ship honors=\n|Ship captured=\n|Ship fate=Scrapped 1920\n|Ship notes=\n|Ship badge=\n}}\n|Ship displacement=\n|Ship tons burthen=\n|Ship length=\n|Ship beam=\n|Ship height=\n|Ship draft=\n|Ship depth=\n|Ship hold depth=\n|Ship decks=\n|Ship power= 5,000 horsepower\n|Ship propulsion= compound steam engine, screw propeller, auxiliary sails\n|Ship sail plan= 4-masted bark\n|Ship speed=\n|Ship range=\n|Ship endurance=\n|Ship boats=\n|Ship capacity=Passengers: 120 1st class, 250 2nd class, 1,000 steerage class\n|Ship troops=\n|Ship complement=\n|Ship crew=\n|Ship sensors=\n|Ship armament=\n|Ship armor=\n|Ship notes=\n}}\n|}\n'SS City of Peking' was an iron-hulled steamship built in 1874 by Delaware River Iron Ship Building and Engine Works, Chester, Pennsylvania for the Pacific Mail Steamship Company. City of Peking and her sister ship City of Tokio were at the time of construction the largest vessels ever built in the United States, and the second largest in the world behind the British leviathan .\nLike Great Eastern, construction of the two Pacific Mail ships was to be plagued with financial difficulties, which threatened to bankrupt the shipbuilder. Unlike Great Eastern, however, which was a commercial failure, City of Peking would go on to have a long and successful commercial career.\nIn addition to her cargoes, City of Peking brought many Chinese and Japanese immigrants to the United States, and later served as a troopship in the Spanish–American War.\nConstruction\nIn 1865 the Pacific Mail Steamship Company had obtained a $500,000 annual subsidy from the U.S. Congress to operate a steam packet between the United States, China and Japan. On June 1, 1872, Congress approved an additional $500,000 subsidy, raising the company's total subsidy to one million dollars annually. Under the terms of the statute, the new subsidy was contingent upon the company increasing its packet to a monthly service beginning on October 1, 1873 and continuing for a period of ten years. The statute also stipulated that the company must utilize iron ships of at least 4,000 tons for the service, built in the United States and suitable for conversion into naval auxiliaries in the event of war.\nWith the incentive of the new half million dollar subsidy, Pacific Mail decided to upgrade its entire fleet of aging wooden side-wheelers with new iron vessels. The company it chose to build its new fleet was John Roach and Sons, which had recently opened a state-of-the-art shipyard, the Delaware River Iron Ship Building and Engine Works, in Chester, Pennsylvania.\nPacific Mail ordered a total of nine iron ships from Roach, the first of which were to include the 4,000 ton sister ships City of Peking and City of Tokio. During construction however, rumors abounded that a newly established British company, China Transpacific, was building even larger ships in England for service on the same route. Pacific Mail concluded that it would require larger ships than originally envisaged to successfully compete, and submitted new specifications, which upgraded the two ships from 4,000 to 5,000 tons. The change required a complete redesign of the hull and machinery, and Roach, who had already laid the keels and constructed the frames to meet the original specification, was forced to start from scratch, delaying the ships' completion.\nFinancial crisis\npersuaded the U.S. Congress to rescind its Pacific Mail subsidy]]\nRoach had initially welcomed the Pacific Mail contracts, anticipating that they would help establish a sound financial foundation for his new company. Unfortunately, in the spring of 1873, eight months into construction of the new ships, Pacific Mail reported an inability to meet its payments. Pacific Mail's President, Alden B. Stockwell, had attempted to manipulate his firm's stock price with company funds, depleting cash reserves and borrowing money to meet the company's obligations. When the stock scheme fell through, Pacific Mail's cash reserves had effectively been substituted with debt. Stockwell and another company director, Richard B. Irwin, then pocketed a loan from Roach and misappropriated about $750,000 in company funds before fleeing the country.\nBut worse was to come. Before his flight, Stockwell had exchanged 20,000 company shares with the notorious stock speculator Jay Gould for the sum of a million dollars. Gould now had influence on the company board, but he had no interest in immediately reviving the company's fortunes. Instead, he hatched a scheme to drive the price of the company's stock down still  further, to a point where he and his co-conspirators could purchase the undervalued stock—and thus gain control of the company—at the lowest possible price. In order to realize this aim, Gould needed to somehow persuade shareholders that the company was facing financial ruin.\nWhen Pacific Mail proved unable to initiate its new packet service on the date stipulated in the June 1872 statute, Congress was obliged to decide whether or not to cancel the subsidy. Gould seized on this issue to further his scheme of damaging the company's reputation. He organized a lobbying campaign to persuade Congress to rescind the subsidy, while Roach, concerned that without the subsidy Pacific Mail might be unable to meet its debts, lobbied for retaining it. Unknown to Roach, his trusted friend and adviser, the lawyer William E. Chandler who was acting as Roach's main Washington lobbyist, also had Gould as a client, a conflict of interest that encouraged Chandler's reticence. As a result, Roach's lobbying was ineffective at combating Gould's attempt to portray Roach as an unethical raider of the public purse.\nGould's campaign was ultimately successful and Congress canceled the subsidy. Owed a million dollars by Pacific Mail, Roach was now in financial difficulty himself as nervous creditors began calling for immediate settlement of their debts. Roach bluffed his way out of the crisis by declaring his readiness to settle any debt within three days of receiving a detailed statement. But he now had to decide whether to foreclose on Pacific Mail in order to secure at least some of his investment in the ships, or to renegotiate the payment plan. He chose the latter, accepting Pacific Mail's old ships for their scrap value as part payment, and reducing its monthly payment obligation from $75,000 to $35,000. Roach was embittered by the affair, but ironically, his handling of the crisis increased his reputation as a businessman able to deal with adverse circumstances.\nService history\nEarly problems\nCity of Peking, the largest ship ever built in the United States at the time, was finally launched in March 1874 to great fanfare. Roach himself was honored with a testimonial dinner at which he was toasted—quite inaccurately, and to the chagrin of older, more established shipyards—as \"the father of iron shipbuilding in America\".\nHowever, City of Pekings first voyages proved troublesome. For her maiden voyage around Cape Horn to her operating port of San Francisco, she was heavily loaded with railroad iron fore and aft, while her coal was stored amidships. As the coal was consumed on the voyage, the increasingly uneven weight caused the vessel's hull to \"hog\" or strain excessively, loosening approximately 5,000 rivets, while some propeller blades were also lost. When she arrived in San Francisco, Roach found himself faced with a stiff $300,000 repair bill.\nOn her next voyage, which was also her first transpacific crossing, the problems recurred, and when she arrived in Hong Kong, Roach suffered the embarrassment of having his celebrated new vessel declared unseaworthy by the British authorities. Roach was forced to dispatch a team of workmen to effect on-the-spot repairs, and he now found himself denigrated in the American press as a builder of inferior ships. Even with the problems however, City of Peking had still managed to set a new speed record of 22 days on her first San Francisco to Hong Kong crossing.\nConcerns about the ship's quality ultimately proved groundless. The damage sustained on these two initial voyages was determined to be caused by improper loading of the ship combined with weakness of the wooden decks, which were subsequently  replaced with iron. After these repairs and modifications, City of Peking went on to establish an enviable record of reliability, suffering only one complete mechanical breakdown over the course of almost three decades of transpacific service. By 1879, American editorialists were again singing the praises of the great ship, while a period in drydock proved her still capable of attracting thousands of curious sightseers. City of Peking would eventually make a total of 116 round trips between San Francisco and Yokohama/Hong Kong in the period from 1875 to 1903.\nPassengers, cargo and crew\nAs a passenger-freighter, City of Peking was designed to carry either passengers or cargo, or both. She was outfitted to accommodate about 1,400 passengers—120 first class, 250 second class and 1,000 steerage. The ship brought many Chinese and Japanese immigrants to the United States, many of whom settled in Hawaii or California. Cost of passage was $150 between San Francisco and Yokohama or $200 between San Francisco and Hong Kong, although the passage for Asian immigrants was frequently subsidized by government or employers.\nCargoes exported to Asia by the vessel were mostly foodstuffs, but also included hardware items such as sewing machines, stoves, clocks, trunks, furniture, firearms, leather goods, candles etc. A large range of staple foods were transported, including barley, bran, bread, beans, oats and flour, as well as processed foods such as molasses, olive oil, butter, cheese, yeast powder and whiskey. For her voyage on May 15, 1875, for example, City of Peking carried 23,476 quarter sacks of flour, 2,193 packages of shrimp, plus meal, abalone, bread, codfish, salmon and mineral water in addition to a range of hardware items.\nCargoes imported typically included items such as silk, tea, sugar, rice, hemp, spices and opium, although again food tended to dominate. To pay for these goods, one of the ship's most valuable exports was \"treasure\", which could sometimes be as much as a million dollars or more in coins or bullion.\nAll the ships of Pacific Mail were manned by Chinese crews but commanded by American or European officers. Chinese employees were willing to work for half the wage of Westerners—$15 a month as opposed to $30—and they lacked union protection. However, their employment also meant language difficulties and it was not unusual for officers and crew to be forced to resort to communication by sign language.\nIncidents and accidents\nThe Chinese and Japanese immigrants brought to the United States on  the City of Peking came via the port of San Francisco, where they were obliged to undergo a period of quarantine before entering the country. The quarantine period was served on board aging, unseaworthy hulks in the harbor that were leased by the company, and this arrangement occasionally led to problems. On March 4, 1888, a violent gale blew up after passengers had been transferred from City of Peking to the hulk Alice Garrett, which then broke its moorings with the passengers still on board. Drifting helplessly in high waves, the hulk was swamped and quickly sank. Fortunately, there were no deaths, but the passengers lost all their belongings which went down with the ship. On an earlier occasion, in January 1880, Chinese immigrants from City of Peking'' were blamed for an outbreak of smallpox in the city, but a more likely cause was the fraternization of the ship's Caucasian officers—for whom quarantine restrictions were less diligently policed—with the local citizenry.\nAnother accident involving City of Peking occurred in Hong Kong on November 29, 1886, when the vessel rammed a French passenger ship, the Saghalien, causing severe damage. Both vessels survived the encounter.\nCity of Peking usually made the voyage from Yokohama to San Francisco in about sixteen days, but on one occasion the vessel took almost twice as long. The ship left the Port of Yokohama on January 10, 1893. After she was almost a week late in arriving, concern increased to the point that the steamship San Juan was dispatched to Honolulu with relief supplies, intending to trace the route of the missing vessel. However, City of Peking finally arrived unassisted, thirteen days late. It transpired that she had broken a propeller shaft and been forced to revert to her auxiliary sails, but since she had been carrying only enough sail for two of her four masts, progress had been unusually slow.\nSpanish–American War\nduring the Spanish–American War.]]\nheading for the Philippines]]\nWhen the Spanish–American War broke out in late April 1898, the U.S. government quickly moved to charter a number of commercial vessels for service as naval auxiliaries. On May 1, 1898, a few days after the declaration of war, City of Peking was chartered by the U.S. government for service as a troop transport, at the rate of $1,500 a day.\nOn May 13, the 49 officers and 979 men of the First California Volunteer Regiment boarded the City of Peking, on their way to Manila in the Spanish colony of the Philippines. The historic moment was captured by the Thomas A. Edison Company on one of the earliest surviving film reels. The ship was accompanied on her voyage by the City of Sydney and Australia, which jointly carried five companies of the regular 14th Infantry and 22 officers and 699 men of the 2nd Oregon Volunteer Infantry Regiment.\nAfter a stopover of several days at Honolulu, the small convoy was joined by the protected cruiser , which was to provide the armed escort to Manila. The Captain of Charleston, Henry Glass, had been ordered to take the surrender of Guam, which was achieved peacefully in late May. The convoy then proceeded on to Manila Bay, arriving 30 June.\nAfter disembarking the troops, the small convoy waited several weeks before returning to San Francisco via Nagasaki. City of Peking arrived back at San Francisco with ten sailors and some naval officers on 22 August. On September 1, the ship was handed back to Pacific Mail.\nOn her next voyage however, loaded with 3,000 barrels of beer intended for the Philippines' occupation troops, City of Peking suffered a mechanical breakdown off Lime Point, and for the only time was unable to complete a scheduled transpacific crossing. She was towed back to port and the problem eventually diagnosed as a broken piston follower.\nRetirement\nAfter repairs, City of Peking resumed service on her regular San Francisco-Hong Kong route, which continued for another five years. On 21 September 1903, the aging vessel was finally retired from transpacific service by Pacific Mail. The ship was eventually scrapped in 1920.\nFootnotes\nReferences\n* Swann, Leonard Alexander Jr. (1965): John Roach, Maritime Entrepreneur: the Years as Naval Contractor 1862–1886, United States Naval Institute (reprinted 1980 by Ayer Publishing, ).\n* Tate, E. Mowbray (1986): Transpacific Steam: The Story of Steam Navigation from the Pacific Coast of North America to the Far East and the Antipodes, 1867–1941, Associated University Presses, .\n* Tyler, David B. (1958): The American Clyde: A History of Iron and Steel Shipbuilding on the Delaware from 1840 to World War I, University of Delaware Press (reprinted 1992, )."
    }
  ]
}