{
  "content": [
    {
      "type": "text",
      "text": "# SS Empire Cowper\n\n{|\nLondon\n| Ship route               =\n| Ship ordered             =\n| Ship builder             = William Doxford & Sons Ltd\n| Ship original cost       =\n| Ship yard number         = 681\n| Ship way number          =\n| Ship laid down           =\n| Ship launched            = 23 September 1941\n| Ship completed           = December 1941\n| Ship commissioned        =\n| Ship decommissioned      =\n| Ship christened          =\n| Ship acquired            =\n| Ship maiden voyage       =\n| Ship in service          =\n| Ship out of service      = 11 April 1942\n| Ship identification      =*United Kingdom Official Number 169003\n*Code Letters BCTF\n*\n| Ship fate                = Bombed and sunk\n| Ship notes               =\n}}\n*10,173 DWT\n| Ship displacement        =\n| Ship length              =\n| Ship beam                =\n| Ship height              =\n| Ship draught             =\n| Ship depth               =\n| Ship decks               =\n| Ship deck clearance      =\n| Ship ramps               =\n| Ship ice class           =\n| Ship range               =\n| Ship power               =\n| Ship propulsion          = Triple expansion steam engine\n| Ship speed               =\n| Ship capacity            =\n| Ship crew                =\n| Ship notes               =\n| Ship complement          =\n| Ship armament            =\n}}\n|}\nEmpire Cowper was a  cargo ship that was built in 1941 by William Doxford & Sons Ltd, Sunderland, United Kingdom. She was built for the Ministry of War Transport. Empire Cowper was bombed and sunk on 11 April 1942 whilst a member of Convoy QP 10.\nDescription\nEmpire Cowper was built in 1941 by William Doxford & Sons Ltd, Sunderland. Yard number 682, she was launched on 23 September and completed in December,\nThe ship was  long, with a beam of . She had a depth of  and a draught of . She was assessed at , . Her DWT was 10,173.\nThe ship was propelled by a 511 nhp triple expansion steam engine, which had cylinders of ,  and  diameter by  stroke. The engine was built by John Brown & Co Ltd, Clydebank.-->\nHistory\nEmpire Cowper was completed in December 1941, and placed under the management of R Chapman & Son. The Official Number 169003 was allocated, as were the Code Letters BCTF.\nEmpire Cowper was a member of Convoy PQ 13, which departed Loch Ewe on 10 March 1942 and arrived at Murmansk, Soviet Union on 31 March. She arrived at Reykjavík, Iceland on 16 March and departed on 20 March to join the convoy.\nEmpire Cowper was a member of Convoy QP 10, which departed the Kola Inlet on 10 April and arrived at Reykjavík on 21 April. On 11 April, she was bombed by Junkers Ju 88 aircraft and sunk in the Barents Sea at , with the loss of nine of her crew. Those lost on Empire Cowper are commemorated at the Tower Hill Memorial, London.\nReferences"
    }
  ]
}