{
  "content": [
    {
      "type": "text",
      "text": "# SS Empire Dell\n\n{|\nGreenock, United Kingdom\n| Ship route               =\n| Ship ordered             =\n| Ship builder             = Lithgows Ltd\n| Ship original cost       =\n| Ship yard number         = 947\n| Ship way number          =\n| Ship laid down           =\n| Ship launched            = 26 May 1941\n| Ship completed           =\n| Ship commissioned        =\n| Ship decommissioned      =\n| Ship christened          =\n| Ship acquired            =\n| Ship maiden voyage       =\n| Ship in service          =\n| Ship out of service      = 11 May 1942\n| Ship identification      =*United Kingdom Official Number 167004\n*Code Letters BCMD\n*\n| Ship fate                = Torpedoed and sunk 12 May 1942\n| Ship notes               =\n}}\n*\n| Ship displacement        =\n| Ship length              =\n| Ship beam                =\n| Ship height              =\n| Ship draught             =\n| Ship depth               =\n| Ship decks               =\n| Ship deck clearance      =\n| Ship ramps               =\n| Ship ice class           =\n| Ship range               =\n| Ship power               =\n| Ship propulsion          = Triple expansion steam engine\n| Ship speed               =\n| Ship capacity            =\n| Ship crew                = 41, plus 7 RAF personnel\n| Ship notes               =\n| Ship armament            = 1 × Hawker Sea Hurricane\n}}\n|}\n'SS Empire Dell' was a  CAM ship that was built in 1941 by Lithgows Ltd, Port Glasgow, United Kingdom for the Ministry of War Transport (MoWT). She served until May 1942, when she was torpedoed and sunk by  whilst a member of Convoy ONS 92.\nDescription\nThe ship was built in 1941 by Lithgows Ltd, Port Glasgow. She was yard number 947.\nThe ship was  long, with a beam of . She had a depth of  and a draught of . She was assessed at , .-->\nThe ship was propelled by a  triple expansion steam engine, which had cylinders of ,  and  diameter by  stroke. The engine was built by Rankin & Blackmore Ltd, Greenock.-->\nShe could embark and operate a Hawker Sea Hurricane aircraft via a catapult. Her crew numbered 41, plus seven Royal Air Force (RAF) personnel.\nHistory\nEmpire Dell was built for the MoWT. She was launched on 26 May 1941. She was placed under the management of George Nisbet & Co Ltd, Glasgow. Empire Dell was allocated the United Kingdom Official Number 167004 and Code Letters BCMD. Her port of registry was Greenock.\nEmpire Dell departed from the Clyde on 11 July 1941 for the Belfast Lough, from where she sailed on 16 July to join Convoy OB 347, which departed from Liverpool, Lancashire that day and dispersed at sea on 31 July. she then sailed to Halifax, Nova Scotia, Canada, arriving on 2 August. Laden with grain, she departed from Halifax on 10 August as a member of Convoy HX 144, which arrived at Liverpool on 30 August. Empire Dell was transferred to Convoy SC 40, which had departed from Sydney, Cape Breton, Nova Scotia on 10 August and arrived at Liverpool on 29 August.\nEmpire Dell was a member of Convoy ON 16, which departed from Liverpool on 13 September and dispersed at sea on 27 September. She sailed to Halifax, arriving on 5 October. She departed from Halifax a week later and sailed to Sydney, arriving the next day. Laden with a cargo of wheat, Empire Dell was a member of Convoy SC 50, which departed from Sydney on 17 October and arrived at Liverpool on 4 November. She left the convoy at the Belfast Lough on 3 November to join Convoy BB 97, which departed on 6 November and arrived at Milford Haven, Pembrokeshire the next day. She sailed on to Avonmouth, Somerset, arriving on 8 November. She left four days later and sailed to Cardiff, Glamorgan, arriving on 13 November.\nEmpire Dell departed from Cardiff on 22 November and sailed to Liverpool, arriving on 24 November. She was a member of Convoy ON 40, which departed on 25 November and dispersed at sea on 4 December. She detached from the convoy and put into the Clyde, arriving on 27 November. She sailed from the Clyde the next day to join Convoy OG 77, which departed from Milford Haven on 24 November and arrived at Gibraltar on 13 December. She departed from Gibraltar on 29 December for Huelva, Spain, arriving the next day.\nEmpire Dell departed from Huelva on 7 January 1942 for Gibraltar, arriving the same day. Laden with a cargo of iron ore, she departed from Gibraltar on 11 January as a member of Convoy SL 97G, which arrived at Liverpool on 24 January. She sailed to the Clyde, arriving on 23 January. Empire Dell departed from the Clyde on 24 February to join Convoy OG 80, which departed from Milford Haven on 22 February and arrived at Gibraltar on 8 March. She left Gibraltar on 26 March, returning on 30 March. Carrying a cargo of iron ore, she departed from Gibraltar on 5 April as a member of Convoy HG 81, which arrived at Liverpool on 15 April.\nEmpire Dell was a member of Convoy ON 92, which departed from Liverpool on 6 May and arrived at Halifax on 21 May. At around 02:00 (German time) on 12 May, Empire Dell was hit by a torpedo fired by , which was under the command of Kapitänleutnant Johann Mohr. U-124 was operating as part of Wolf pack Hecht. She sank at . Two of her crew of 48, which included seven RAF personnel, were killed. Twenty-one survivors were rescued by the convoy rescue ship  and 25 were rescued by . They were landed at St John's, Newfoundland on 17 and 16 May respectively.  Those lost on Empire Dell are commemorated on the Tower Hill Memorial, London.\nReferences\nExternal links\n*[http://uboat.net/media/allies/merchants/br/empire_dell.jpg Photo of Empire Dell]"
    }
  ]
}