{
  "content": [
    {
      "type": "text",
      "text": "# SS Empire Defender\n\n{|\nBremen (1910–1914)\n* London (1914–1925)\n* Syra (1925–1928)\n* Naples (1928–1940)\n* London (1940–1941)\n| Ship route =\n| Ship ordered =\n| Ship builder = Joh. C. Tecklenborg, Geestemünde\n| Ship original cost =\n| Ship yard number = 237\n| Ship way number =\n| Ship laid down =\n| Ship launched = 20 September 1910\n| Ship completed = November 1910\n| Ship commissioned =\n| Ship decommissioned =\n| Ship christened =\n| Ship acquired =\n| Ship maiden voyage =\n| Ship in service =\n| Ship out of service = 14 November 1941\n| Ship identification = *code letters QJVC (1910–1914)\n*\n*code letters JLGB (1914–1925)\n*\n*code letters NPCL (1928–1933)\n*\n*call sign IBVL (1934–1940)\n*\n*call sign GPJG (1941–1941)\n*\n*UK official number 139043 (1914–1925, 1940–1941)\n| Ship fate = sunk by torpedo\n| Ship notes =\n}}\n(1910–1940)\n* (1940–1941)\n*\n*8,705 DWT (1910–1914)\n*9,113 DWT (1925)\n| Ship displacement =\n| Ship length =\n| Ship beam =\n| Ship height =\n| Ship draught =\n| Ship depth =\n| Ship decks =\n| Ship deck clearance =\n| Ship range =\n| Ship power =\n| Ship propulsion = Quadruple-expansion steam engine\n| Ship speed =\n| Ship capacity =\n| Ship crew =\n| Ship notes =\n| Ship complement = 69 (as Freienfels)\n| Ship armament =\n}}\n|}\ns wreck off Tunisia\n}}\nEmpire Defender was a  cargo steamship that was built in 1910 as Freienfels by Joh. C. Tecklenborg in Geestemünde, Germany. She was seized by the United Kingdom in 1914, passing to the Admiralty. In 1920, she was passed to the Secretary of State for India.\nShe was sold to Greek owners in 1925 and renamed Hadiotis. In 1928, she was sold to Italian owners and renamed Felce. In 1940, she was seized by the United Kingdom and passed to the Ministry of War Transport (MoWT). Renamed Empire Defender, she served until 14 November 1941, when she was sunk by torpedo. Her sinking killed four members of her crew.\nDescription\nThe ship was built in 1910 by Joh. C. Tecklenborg in Geestemünde. She was yard number 237.\nAs built, the ship was  long, with a beam of . She had a depth of  and a draught of . She was assessed at , . Her DWT was 8,705.\nThe ship had a  quadruple-expansion steam engine, with cylinders of 61&nbsp;cm (21 inches), 88&nbsp;cm (34 inches), 128&nbsp;cm (50 inches) and 189&nbsp;cm (74 inches) diameter by 137&nbsp;cm (53 inches) stroke. The engine was built by JC Tecklenborg, Wesermünde. It drove a screw propeller and could propel the ship at .\nHistory\nFreienfels was built for Deutsche Dampfschiffahrts-Gesellschaft \"Hansa\" (DDG Hansa), Bremen. She was launched on 20 September 1910 and delivered on 22 November. She was registered in Bremen and her code letters were QJVC. She had a crew of 63. On 5 August 1914, Freienfels was seized by the United Kingdom at Calcutta, India. She was requisitioned by the Admiralty and operated under the management of Grahams & Co Ltd. Her port of registry was changed to London and the code letters JLGB were allocated. Freienfels was allocated the official number 139043. In 1920, she was passed to the Secretary of State for India, operating under the management of the Director, India Office Shipping.\nFreienfels was one of five ships that were condemned to detention, but not declared to be prizes of war. The other ships were , ,  and . Under the terms of the Versailles Treaty, they were to be sold. On 2 March 1925, questions were asked in Parliament by Joseph Kenworthy, MP about the profitability and proposed sale of the ships to Greece, and what arrangements had been made for the continued employment of her British crew. In reply, Earl Winterton, then Under-Secretary of State for India, said that the five ships had made in excess of £1.7 million profit. The disposal of the ships was a matter for the Reparation Commission and the India Office had no say in the disposal of the ships. Frienfels was duly advertised for sale in June 1925. She would be available for inspection at Dunkirk, France from 6–18 June, and would then depart for Falmouth, Cornwall where she was to be laid up pending sale. She was described as , 9,112 DWT.\nFreienfels was sold to Pnevmaticos, Rethymnis & Yannaghas, Syra, Greece. She was renamed Hadiotis. In 1927, she was sold to Kassos Steam Navigation Co. Ltd, Syra and placed under the management of Pnevmaticos, Rethymnis & Yannaghas. In September 1928, Hadiotis was sold to Achille Lauro fu Giochine & Co, Naples, Italy and was renamed Felce. The code letters NPCL were allocated. On 1 January 1934, these were changed to IBVL. On 18 January 1937, Felce ran aground at Djibouti, French Somaliland. After her cargo was discharged, she was refloated with assistance from a tug. On 10 June 1940, Felce was in port at Haifa, Palestine. She was seized and passed to the MoWT. She was renamed Empire Defender. Her port of registry was changed to London and the code letters GPJG were allocated. She was placed under the management of the City Line Ltd. She was assessed as , and would have regained her previous official number 139043.\nEmpire Defenders movements over the next six months are not recorded. She departed from Suez, Egypt on 4 November 1940 as a member of Convoy BS 8, which dispersed off Aden on 12 November. She detached from the convoy before it dispersed and sailed to Port Sudan, Sudan, arriving on 8 November. She departed from Port Sudan on 22 November to join Convoy BS 9, which had departed from Suez on 18 November and dispersed on 26 November at . She sailed to Mombasa, Kenya, arriving on 8 December. Leaving Mombasa on 15 December, she sailed to Durban, South Africa, where she arrived on 26 December.\nDuring 1941, management of Empire Defender passed to the Stanhope Steamship Co Ltd. Empire Defender departed from Durban on 6 April 1941 for Cape Town, where she arrived on 11 April. Although she departed from Cape Town on 17 April, she returned two days later. She departed for a second time on 3 May for Freetown, Sierra Leone, arriving there on 22 May. Empire Defender departed from Freetown on 15 June for Saint Lucia, where she arrived on 5 July, departing five days later for the Hampton Roads, Virginia, United States, arriving on 21 July. She departed from the Hampton Roads on 10 August for Halifax, Nova Scotia, Canada, arriving four days later. She departed from Halifax on 16 August as a member of Convoy HX 156, which arrived at Liverpool, Lancashire, United Kingdom on 31 August. Empire Defender was carrying general cargo. She left the convoy at Loch Ewe on 30 August to join Convoy WN 175, which departed the next day and arrived at Methil, Fife on 3 September. She then joined Convoy FS 585, which arrived at Southend-on-Sea on 6 September.\nEmpire Defender departed from Southend on 27 September as a member of Convoy FN 524, which arrived at Methil on 29 September. The next day, she departed from Methil to join Convoy EC 79, which had departed from Southend on 28 September and arrived at Oban, Argyllshire on 3 October. She sailed on to the Clyde, arriving on 3 October. Empire Defender was ordered to sail from Glasgow to Malta laden with ammunition, as part of Operation Astrologer. On 20 October 1941, sixty lascar sailors refused to sail, claiming that the vessel was cursed and would be sunk before the next new moon. The authorities were unable to persuade them to sail by either threats or inducements. An equivalent number of white sailors were procured with a payment of £10 in cash each to accept the lascar accommodation. The ship had been repainted with a black hull, white topsides and a buff funnel, contrary to wartime regulations. All armament had been removed in an effort to make the ship appear as though it belonged to a neutral country. She departed from the Clyde on 29 October to join Convoy OG 76, which departed from Milford Haven, Pembrokeshire on 26 October and arrived at Gibraltar on 11 November. Empire Defender passed Gibraltar on 11 November, and headed for Malta. The flag of whichever nation's waters she was in at the time was painted on her hull, thus she was passed off as a French, Spanish and Italian ship. Operation Astrologer had probably been compromised following the loss of the merchantman  on 2 May 1941 and the subsequent interrogation of her crew who were interned in France. The progress of Empire Defender had probably been monitored from the Spanish coast. On 14 November 1941, she was attacked either by a Savoia-Marchetti SM.79 or a Savoia-Marchetti S.84 aircraft of the Regia Aeronautica, which dropped an aerial torpedo. Empire Defender was set on fire and her crew abandoned her. They had only just done this when she blew up and sank  south of the Galite Islands, Tunisia. Four of her crew were killed. The survivors became prisoners of war. Those lost on Empire Defender are commemorated on the Tower Hill Memorial, London.\nReferences\nBibliography\n*"
    }
  ]
}