{
  "content": [
    {
      "type": "text",
      "text": "# SS Empire Comfort\n\n{|\nUnited Kingdom\n| Ship in service          =\n| Ship out of service      = 1954-55\n| Ship struck              =\n| Ship reinstated          =\n| Ship honours             =\n| Ship fate                = Scrapped 1955\n| Ship notes               =\n}}\n| Ship displacement        =\n| Ship length              =\n| Ship beam                =\n| Ship draught             =\n| Ship draft               =\n| Ship power               = Quadruple expansion steam engine\n| Ship propulsion          = Screw propeller\n| Ship speed               =\n| Ship range               =\n| Ship complement          =\n| Ship sensors             =\n| Ship EW                  =\n| Ship armament            =\n| Ship armour              =\n| Ship armor               =\n| Ship aircraft            =\n| Ship aircraft facilities =\n| Ship notes               =\n}}\n|}\n'SS Empire Comfort was a  convoy rescue ship which was launched in 1944 as  HMS York Castle' a  corvette, but was renamed  Empire Castle and converted for merchant service before completion by Ferguson Brothers (Port Glasgow) Ltd., Port Glasgow as yard number 372. She was launched on 20 September 1944. The ship was  long, with a beam of  and a draught of .\nHistory\nThe ship was completed in December 1944 as Empire Comet for the Ministry of War Transport (MoWT). She was placed under the management of Ellerman City Line. Empire Comfort was a member of a number of convoys during the Second World War.\n;OS 113\nConvoy OS 113 departed the Clyde and The Downs on 25 February 1945. It dispersed at sea on 1 March 1945. Empire Comfort made her first voyage as a convoy rescue ship as a member of this convoy.\n;MKS 85G\nConvoy MKS 85G departed Gibraltar on 24 February 1945 bound for the United Kingdom. Empire Comfort was employed as a convoy rescue ship for this convoy.\n;OS 116\nConvoy OS 116 departed from the Clyde and The Downs on 12 March 1945. It dispersed at  on 17 March. Empire Comfort was a member of this convoy.\n;MKS 88G\nConvoy MKS 88G departed from Casablanca, Morocco on 11 March 1945 bound for the United Kingdom. Empire Comfort was employed as a convoy rescue ship for this convoy.\n;OS 121\nConvoy OS 121 departed from the Clyde on 7 April 1945 and dispersed at sea on 14 April. Empire Comfort was employed as a convoy rescue ship for this convoy.>\n;MKS 93G\nConvoy MKS 93G departed from Gibraltar on 5 April 1945 bound for the United Kingdom. Empire Comfort was employed as a convoy rescue ship for this convoy.\nIn 1948, Empire Comfort was in the Mediterranean where she was working under the control of the Middle East Command. Empire Comfort was used as a troopship between Port Said, Egypt and Famagusta, Cyprus and also between Port Said and Tobruk, Libya. She was used in this role from July 1948 to at least February 1949. In 1954, Empire Comfort was laid up at Falmouth, Cornwall. In June 1955, Empire Comfort, along with  and  were offered for sale \"as lying at Falmouth\". In July 1955, she was sold to Belgian buyers and towed to Antwerp. It was intended that she would be converted for service in the Belgian Congo, but she was scrapped in December 1955 at Ghent.\nReferences"
    }
  ]
}