{
  "content": [
    {
      "type": "text",
      "text": "# SS Empire Caicos\n\n{|\nWest Hartlepool (1945-46)\n* London (1946-57)\n* Melbourne (1957-62)\n* Hong Kong (1962-63)\n* Panama City (1963-67)\n| Ship route               =\n| Ship ordered             =\n| Ship builder             = William Gray & Co. Ltd.\n| Ship original cost       =\n| Ship yard number         =\n| Ship way number          =\n| Ship laid down           =\n| Ship launched            = 28 February 1945\n| Ship completed           = March 1945\n| Ship christened          =\n| Ship acquired            =\n| Ship maiden voyage       =\n| Ship in service          =\n| Ship out of service      =\n| Ship identification      =*United Kingdom Official Number 180082 (1945-57)\n*Code Letters GFDY (1945-50)\n*\n| Ship fate                = Scrapped 1967\n| Ship notes               =\n}}\n*\n| Ship displacement        =\n| Ship length              =\n| Ship beam                =\n| Ship height              =\n| Ship draught             =\n| Ship depth               =\n| Ship decks               =\n| Ship deck clearance      =\n| Ship ramps               =\n| Ship ice class           =\n| Ship sail plan           =\n| Ship power               = Triple expansion steam engine\n| Ship propulsion          = Screw propeller\n| Ship speed               =\n| Ship capacity            =\n| Ship crew                =\n| Ship notes               =\n}}\n|}\nEmpire Caicos was a  cargo ship which was built in 1945 for the Ministry of War Transport (MoWT). She was sold in 1946 and renamed Sugar Transporter. In 1957 she was sold and renamed Pattawilya. In 1962, she was sold and renamed Clovelly, serving until she was damaged in a storm in 1967 and then scrapped later that year.\nDescription\nEmpire Caicos was built by William Gray & Co. Ltd., West Hartlepool for the MoWT. She was launched on 28 February 1945 and completed in March.\nThe ship was  long, with a beam of  and a depth of }. She had a GRT of 3,533 and a NRT of 2,250. She was propelled by a triple expansion steam engine which had cylinders of ,  and  diameter by  stroke. The engine was built by the Central Marine Engineering Works, West Hartlepool. The engine could propel her at .\nHistory\nEmpire Caicos was allocated the United Kingdom Official Number 180082. She used the Code Letters GFDY. She was owned by the MoWT and operated under the management of H Hogarth & Sons Ltd. In 1946, management was transferred to the Rodney Steamship Co Ltd.\nIn 1950, Empire Caicos was sold to Silvertown Services Ltd and renamed Sugar Transporter. She was placed under the management of R S Dalgleish Ltd, Newcastle upon Tyne. In 1953, management was transferred to Kentships Ltd. In the aftermath of Hurricane Charlie, Sugar Transporter departed Rochester, Kent for Jamaica with a cargo of  of cement and over 100 parcels of clothes. In 1957, Sugar Transporter was sold to J Paterson & Co (Pty) Ltd, Melbourne, Australia and renamed Pattawilya. She was used to carry cargos of coal, gypsum and limestone, as well as general cargo to the coastal ports of Australia.\nIn 1961 she was sold to McIlwraith, McEacharn & Co. In 1962, Pattawilya was sold to Cronulla Shipping Co Ltd, Hong Kong and renamed Clovelly. In 1963, she was sold to the San Jeronimo Steamship Co Ltd, Panama. On 6 January 1967, Clovelly was damaged in a storm and was towed in to Sasebo, Japan. She was then sold for scrap, arriving at Uchiumi on 13 May 1967.\nReferences\nExternal links\n* [http://www.kombuispraat.com/viewtopic.php?f=1&t=2258&p=157816 Blog thread with photo of Sugar Transporter]"
    }
  ]
}