{
  "content": [
    {
      "type": "text",
      "text": "# SS Empire Gem\n\n|section2=\n*Official number: 168691\n|fate=Sunk 23 January 1942\n}}\n|section3=\n*\n*UDT 7,234\n|length=\n|beam=\n|hold_depth=\n|power=\n|propulsion=1 screw\n|complement=51\n|armament=*1 × BL 4-inch Mk VIII naval gun\n*1 × QF 12-pounder 12 cwt naval gun\n*6 × 0.30 in machine guns\n}}\n}}\n'SS Empire Gem' was a British motor tanker built in 1941 in Glasgow, Scotland. She had a very short career, only serving for around three months. The tanker was torpedoed and sunk by the  on 24 January 1942. Only two people aboard survived.\nConstruction\nEmpire Gem built in Glasgow, Scotland, by Harland and Wolff. Her keel was laid down in early 1941, and she was launched on 29 May 1941, as yard number 1045G. The former tanker was built under a special Lloyd's survey, where she was given an A1 vessel rating. After launching, Empire Gem was given the official number 168691 and the signal letters BCNV. She was registered in Glasgow, and owned by the British Tanker Company of London, England.\nSpecifications\nThe former tanker measured  long,  wide, and had a hold depth of . Her gross register tonnage was 8,139, her net tonnage was 4,743, and her underdeck tonnage was 7,234. The tanker had two heavy oil airless injection engines, powered by fuel oil stored in bunkers. Her engines each produced 502 nominal horsepower. She had several ballast tanks after and under the engines, and in the very front of the ship. All of the machinery was built in accordance with a special Lloyd's survey.\nEmpire Gem had one propeller and a cruiser stern. She had three separate superstructures—the poop deck on the stern, the bridge amidships, and the forecastle on the bow. Four longboats  in length were placed on the main deck to serve as lifeboats. She was also outfitted with several weapons for defense, the largest being a BL 4-inch Mk VIII naval gun mounted on a platform above the poop deck. Also on the stern was a QF 12-pounder 12 cwt naval gun. Placed elsewhere aboard the ship were six 0.30in caliber machine guns.\nConvoy service\nEmpire Gem entered service on 24 October 1941, operated by the Ministry of War Transport while still under the ownership of the British Tanker Company. She first departed on 26 October, joining convoy ON 30 heading to New York City. She traveled in ballast, arriving in Providence, Rhode Island, on 13 November. Just two days letter, Empire Gem joined convoy HX 161 in Halifax for the journey home. The vessels in the convoy carried an assorted mix of petroleum, diesel fuel, aviation gas, and lubricant. Empire Gem arrived in Avonmouth, England, on 15 December.\nThe tanker left Avonmouth in her second voyage on 19 December, joining convoy ON 48 en route to Mobile, Alabama. She arrived on 10 January 1942, spending four days in the port for drydock and repairs. She then traveled to the city of Port Arthur, Texas, where she arrived on 15 January.\nSinking\nEmpire Gem departed Port Arthur on 18 January, laden with 10,000 tons of kerosene. The tanker soon found herself sailing up the East Coast of the United States. At nighttime on 23 January, near the Diamond Shoals Lightbuoy, she passed the slower American merchant ship Venore, which was bound for Baltimore and carried iron ore.  Empire Gem was traveling with her lights dimmed. The ocean waves were moderate, and the wind traveled at a westwardly speed of 11.5 knots.\nThe German submarine U-66, commanded by Fregattenkapitän Richard Zapp, spotted both Empire Gem and Venore through its periscope. After Venore was only a mile or two from the British tanker, who was herself 18 miles away from the lightship, U-66 fired two torpedoes. Both struck Empire Arrow's aft starboard ballast tank at 19:45, which caused a large explosion and, subsequently, a fire. The third mate aboard Venore recalled the incident in the North Atlantic Naval Coastal Frontier War Diary:The Third Mate was waiting to relieve the watch when he was suddenly startled by the sound of a \"terrific explosion\" on the starboard quarter.  Turning, he saw, about a mile away, the burning hull of the Empire Gem silhouetted against the darkness by a fire that climbed five-hundred feet into the night air. As he watched, the black hull of a submarine came round the stern of the sinking ship and moved into the circle of light.The radio operators aboard Empire Gem immediately sent out an SOS, received by both Venore and the Fifth Naval District radio station. The crew of the British tanker attempted to lower the ship's four lifeboats, but found it nearly impossible due to the intense heat. Empire Gem continued to move for around three hours, the engines finally stopping shortly after midnight. The stern was engulfed in a violent fireball, and eventually sank after the tanker broke in two.\nThe remainder of Empire Gem's crew remained clinging to the bow, which had dropped anchor and remained in place, though one by one they lost their grip and fell into the burning water below. A Coast Guard boat from the Oacracoke Coast Guard Station arrived, around 2:00 on 24 January. Another Coast Guard boat arrived after a six-hour journey, deciding to wait until daylight to rescue the crew of Empire Gem. The sailors watched as more crew fell from the bow to their deaths, and by sunrise only three men remained clinging to the bow—the ship's captain and two radio operators.\nThe three men were ordered to jump in the water, where they would be picked up by the boats. They did so, and the captain and one of the radio operators were plucked from the water and hauled aboard. However, the second radio operator was reportedly sucked into a vortex of oil and vanished. The two survivors were taken to Hatteras Inlet on 25 January. A total of 49 people aboard Empire Gem had died.\nThe bow of Empire Gem remained afloat for multiple days. A red buoy was placed by the Coast Guard to warn passing vessels of the wreck. The tanker's eventually admitted to throwing classified material overboard in the panic after the initial explosions, though most of it had remained on the bridge. A man from the Fifth Naval District Intelligence Office was dispatched to the scene, though the bridge was underwater at that time. The bow of the tanker remained afloat as late as 7 April, remaining in its original location as Empire Gem was still at anchor.\nWreck\n}}\nEmpire Gem sits at a depth of , 12 miles south of Cape Hatteras. The wreck is  long and  wide. The ship is broken in two, and the bow is completely upside down although the stern is upright. Both portions remain largely intact. The wreck is home to a variety of fish, including red snappers, sand tiger sharks, black sea bass, tautogs, and amberjacks.\nThe stern is described as \"the most prominent feature\" of the wrecksite. The four-bladed propeller and rudder are partially buried in the sand, and most of the machinery in the stern is both intact and in its original positions. Two diesel engines and a boiler have been exposed to the elements as a result of the hull deteriorating.\nThe wreck and remains of Empire Gem were added to the National Register of Historic Places on 25 September 2013.\nNotes\nReferences"
    }
  ]
}