{
  "content": [
    {
      "type": "text",
      "text": "# SS Empire Ballad\n\n{|\nSunderland (1941-46)\n* UK (1946-51)\n* Rotterdam (1951-62)\n* Panama (1962-69)\n|Ship renamed=\n|Ship struck=\n|Ship reinstated=\n|Ship honours=\n|Ship captured=\n|Ship fate= Scrapped 1969\n|Ship identification=*Official Number 169013 (1941-51)\n*Code Letters BCXB (1941-46)\n*\n*Code Letters PHRL (1951-62)\n*\n*IMO number 5167815 ( -1969)\n|Ship notes=\n}}\n*\n*9,730 DWT\n|Ship displacement=\n|Ship length=\n|Ship beam=\n|Ship depth=\n|Ship draft=\n|Ship hold depth=\n|Ship propulsion= 1 x triple expansion steam engine (North East Marine Engine Co (1938) Ltd, Sunderland)\n|Ship sail plan=\n|Ship complement=\n|Ship armament=1 x 4\" gun, 2 x 3\" guns, 8 x machine guns, smoke generating apparatus (Empire Ballad)\n|Ship speed=\n|Ship notes=\n|Ship capacity=\n}}\n|}\nEmpire Ballad was a 6,640 ton cargo ship which was built by Bartram & Sons Ltd, Sunderland in 1941 for the Ministry of War Transport (MoWT). She was sold to Alexander Shipping Co Ltd in 1946 and renamed Bibury. In 1951 she was sold to Halcyon Lijn NV, Rotterdam, Netherlands and renamed Stad Maassluis. In 1962 she was sold to Compagnia Navigazione Jaguar, Panama and renamed Jaguar. In 1966 she was sold to Olamar SA, Panama and renamed Goldfield. In 1968 she was sold to Compagnia de Navigazione Sulemar, Panama and renamed Poseidon, serving until 1969 when she ran aground and was subsequently scrapped.\nHistory\nEmpire Ballad was built by Bartram & Sons Ltd, Sunderland as yard number 290. She was launched on 17 December 1941 and completed on 13 March 1942. She was initially operated under the management of Allan Black & Co Ltd. and then Capper, Alexander & Co.\nWar service\nEmpire Ballad was a member of a number of convoys during the Second World War\n;HX 254\nConvoy HX 254 sailed from New York on 27 August 1943 and arrived at Liverpool on 12 September. Empire Ballad was carrying a general cargo and was bound for Hull.\n;KMS 31\nConvoy KMS 31 sailed from Liverpool on 27 October 1943 and arrived at Gibraltar on 19 November. Empire Ballad was carrying a toxic cargo and was bound for Italy.\n;KMS 68\nConvoy KMS 68 sailed from Liverpool on 3 November 1944 and dispersed at Gibraltar on 14 November. Empire Ballad was armed with one 4\" gun, two 3\" guns and eight machine guns as well as being fitted with smoke generating apparatus. Empire Ballad was carrying a cargo of stores, vehicles and matches bound for the Naples area\nPostwar\nIn 1946, Empire Ballad was sold to the Alexander Shipping Co Ltd and renamed Bibury. She was operated under the management of Houlder Brothers Ltd and served with them for five years.\nIn 1951, Bibury was sold to Halcyon Lijn, Rotterdam and renamed Stad Maassluis after the town of Maassluis. She served with them until she was laid up in March 1958 at Rotterdam.\nIn 1962, Stad Maassluis was sold to Compagnia Navigazione Jaguar, Panama and renamed Jaguar. She was operated under the management of Palomba & Salvatori, Italy. She served with Cia. Nav. Jaguar for four years and was sold in 1966 to Olamar SA, Panama and renamed Goldfield, remaining under the management of Palomba & Salvatori. In 1968, Goldfield was sold to Compagnia de Navigazione Sulemar, Panama and renamed Poseidon. She was operated under the management of V Coccoli, Italy. In September 1969, Poseidon ran aground while on a voyage from Rouen, France to Alexandria, Egypt. She put into Naples, Italy. Her bottom was badly damaged and it was uneconomic to repair her. She arrived under tow on 21 November 1969 at Split, Yugoslavia where she was scrapped by Brodopas.\nOfficial number and code letters\nOfficial Numbers were a forerunner to IMO Numbers.\nEmpire Ballad had the UK Official Number 169522 and used the Code Letters BCXB. Stad Maassluis used the Code Letters PHRL.\nWhen IMO numbers were introduced in the late 1960s, the number 5167815 was allocated to the ship It would have been carried by Poseidon.\nReferences\nExternal links\n*[http://www.photoship.co.uk/JAlbum%20Ships/Old%20Ships%20B/slides/Bibury-02.html Photo of SS Bibury]\n*[http://www.photoship.co.uk/JAlbum%20Ships/Old%20Ships%20S/slides/Stad%20Maasluis-01.html Photo of SS Stad Maassluis]\n*[http://www.photoship.co.uk/JAlbum%20Ships/Old%20Ships%20P/slides/Poseidon-04.html Photo of SS Poseidon]"
    }
  ]
}