{
  "content": [
    {
      "type": "text",
      "text": "# SS Empire Advocate\n\n{|\nBremen (1913–1919)\n* Liverpool (1919–1932)\n* Naples (1932–1940)\n* London (1948–1955)\n|Ship ordered=\n|Ship builder= Joh. C. Tecklenborg AG, Wesermünde\n|Ship original cost=\n|Ship yard number= 255\n|Ship laid down=\n|Ship launched= 8 April 1913\n|Ship completed=\n|Ship acquired=\n|Ship commissioned=\n|Ship decommissioned=\n|Ship in service= 22 May 1913\n|Ship out of service=\n|Ship renamed=\n|Ship struck=\n|Ship reinstated=\n|Ship identification=*Italian official number 382 (1932–1940)\n*UK Official Number 143102 (1940–1945)\n*Code letters QKHB (1913–1919)\n*\n*Code letters JWQS (1919–1932)\n*\n*Code letters IBIB (1932)\n*\n*Code letters NDHU (1932–1940)\n*\n*Code letters GLYJ (1940–1945)\n*\n|Ship honours=\n|Ship captured=\n|Ship fate= Scrapped at Bo'ness, 1945\n|Ship notes=Sister ships: , , , , , .\n}}\n|Ship beam=\n|Ship draft=\n|Ship depth=\n|Ship hold depth=\n|Ship propulsion= 1 x triple expansion steam engine (Joh. C. Tecklenborg AG, Wesermünde)  NHP.\n|Ship sail plan=\n|Ship speed=\n|Ship complement= 73\n|Ship armament=\n|Ship notes=\n}}\n|}\n'SS Empire Advocate was a 5,787 ton steamship which was built in 1913 as the Solfels. She was taken as war reparations in 1919 and renamed Bowes Castle in 1920. In 1932, she was sold to Italy, renamed Angelina Lauro', seized in 1940, and renamed Empire Advocate. She was scrapped at Bo'ness in 1945.\nDescription\nThe ship was  long, with a beam of  and a depth of . She was propelled by a  NHP triple expansion steam engine which was made by Joh. C. Tecklenborg AG, Geestemünde, and which could propel her at . As built, she was 5,821 GRT, 3,641 GRT, and 8,800 DWT.\nHistory\nSolfels was built by Joh. C. Tecklenborg AG, Wesermünde as yard number 255 and launched on 8 April 1913, being completed the following month. She entered service with the Hansa Line, Bremen on 22 May 1913 and served with them for six years until taken as a war prize on 25 May 1919, passing to the British Shipping Controller under the management of H Hogarth & Sons. In 1920, Solfels was sold to the Lancashire Shipping Company, who renamed her Bowes Castle, under the management of Chambers & Co.\nIn August 1921, forty Mongolian stowaways were discovered aboard Bowes Castle in New York City. John Thomas, an engineer on Bowes Castle was charged with conspiracy to violate the United States immigration laws. On 20 October 1929, Bowes Castle struck a reef in the Macassar Strait, Indonesia. She was refloated several days later and proceeded to Surabaya for inspection before continuing her voyage to New York.\nBowes Castle was sold to Achille Lauro, Naples in October 1932, being renamed Angelina Lauro. On 23 September 1936,  collided with Angelina Lauro in the English Channel off Ouessant, France. E M Dalglas was severely damaged. Angelina Lauro was on a voyage from Gdynia, Poland to La Spezia, Italy. On 7 April 1937, Angelina Lauro collided with  at Port Said, Egypt. On 10 June 1940,  Angelina Lauro was interned at Liverpool and taken into Ministry of War Transport ownership on 23 July 1940 under the management of Galbraith, Pembroke & Company, London and renamed Empire Advocate. Part of the cargo she was carrying was 14 casks of red wine, which were sold at auction in London on 27 March 1941 by order of the Prize Court. She served for five years and was sold for scrapping on 16 February 1945 to P & W Maclellan Ltd, Bo'ness.\nConvoys\nEmpire Advocate was a member of a number of convoys.\n;SL 69\nEmpire Advocate was in Convoy SL 69 when it departed from Freetown bound for Liverpool on 23 March 1941, but was unable to maintain speed and proceeded to her destination independent of the main convoy.\n;ON 8\nConvoy ON 8 which Liverpool on 16 August and arrived at Reykjavík on 21 August, dispersing on 15 August. Empire Advocate was bound for Philadelphia.\n;ON 41\nConvoy ON 41 departed Liverpool on 9 December. She was carrying a cargo of ferrous metals and manganese and was bound for Baltimore.\n;SC 121\nConvoy SC 121 departed New York on 23 February 1943 and arrived at Liverpool on 14 March. Empire Advocate was carrying a general cargo.\n;ONS 5\nConvoy ONS 5 departed Liverpool on 21 April and arrived at Halifax on 12 May.\n;SC 135\nConvoy SC 135 departed Halifax on 27 June and arrived at Liverpool on 11 July. Empire Advocate was carrying a general cargo.\n;SC 147, SC 148\nEmpire Advocate was supposed to be a member of Convoy SC 147 which departed Halifax on 19 November  but did not sail with that convoy, sailing with Convoy SC 148 on 2 December bound for Liverpool. She was carrying a cargo of steel and pit props, and arrived at Liverpool on 16 December.\n;HX 291\nConvoy HX 291 departed New York on 19 May 1944, arriving at Liverpool on 27 May. Empire Advocate was carrying a general cargo.\nOfficial number and code letters\nOfficial Numbers were a forerunner to IMO Numbers. Angelina Lauro had the Official Number 382 on the Italian Register, and 143102 on Lloyd's Register. Solfels used the Code Letters QKHB. Solfels and Bowes Castle used the Code Letters JWQS. Angelina Lauro used the Code Letters IBIB, NDHU and GLYJ. Empire Advocate used the Code Letters GLYJ.\nReferences"
    }
  ]
}