{
  "content": [
    {
      "type": "text",
      "text": "# SS Empire Cobbett\n\n{|\nMiddlesbrough (1942–46);\n* London (1946–59)\n|Ship route          =\n|Ship ordered        =\n|Ship builder        = Furness Shipbuilding Co. Ltd.\n|Ship original cost  =\n|Ship yard number    = 350\n|Ship way number     =\n|Ship laid down      =\n|Ship launched       = 19 November 1942\n|Ship completed      = December 1942\n|Ship commissioned   =\n|Ship decommissioned =\n|Ship christened     =\n|Ship acquired       =\n|Ship maiden voyage  =\n|Ship in service     =\n|Ship out of service =\n|Ship identification =*Code Letters BFFN\n*\n*United Kingdom Official Number 164861\n|Ship fate           = Scrapped in 1959\n|Ship notes          =\n}}\n*\n|Ship displacement   =\n|Ship length         =\n|Ship beam           =\n|Ship height         =\n|Ship draught        =\n|Ship depth          =\n|Ship decks          =\n|Ship deck clearance =\n|Ship ice class      =\n|Ship power          = Triple expansion steam engine\n|Ship propulsion     = Screw propeller\n|Ship speed          =\n|Ship capacity       =\n|Ship crew           =\n|Ship notes          =\n|Ship armament       =\n}}\n|}\n'SS Empire Cobbett was a  tanker which was built in 1942 by Furness Shipbuilding Co Ltd, Haverton Hill-on-Tees for the Ministry of War Transport (MoWT). In 1946 she was sold into merchant service and renamed San Wilfrido'. She was scrapped in 1959.\nDescription\nThe ship was built by Furness Shipbuilding Co Ltd, Haverton Hill-on-Tees, as yard number 350. She was launched on 19 November 1942 and completed in December 1942.\nShe was  long, with a beam of  and a depth of . She had a GRT of 9,811 and a NRT of 5,779.\nThe ship was propelled by a triple expansion steam engine, which had cylinders of ,  and   diameter by  stroke. The engine was built by Richardsons, Westgart & Co Ltd, Hartlepool.\nHistory\nEmpire Cobbett was built for the MoWT, who placed her under the management of Eagle Oil and Shipping Company Ltd, Middlesbrough. Her port of registry was Middlesbrough. The Code Letters BFFN and United Kingdom Official Number 164861 were allocated.\nEmpire Cobbett was a member of a number of convoys during the Second World War.\n;HX 249\nConvoy HX 249 sailed from New York City on 23 July 1943 and reached Liverpool on 6 August. Empire Cobbett was bound for Avonmouth, Somerset.\n;HX 255\nConvoy HX 255 departed New York on 2 September 1943 and arrived at Liverpool on 16 September. Empire Cobbett was bound for Stanlow Refinery, Ellesmere Port.\n;HX 313\nConvoy HX 313 departed New York on 10 October 1944 and arrived at Liverpool on 24 October 1944. Empire Cobbett was due to have joined this convoy, bound for Milford Haven, Pembrokeshire.\nIn 1946 Empire Cobbett was sold to Eagle Oil & Shipping Co Ltd, London, who renamed her San Wilfrido and changed her port of registry to London. Her name came from an earlier , which had been launched for Eagle Oil in 1914 and sunk by a mine that same year.\nShe served until 1959, arriving on 10 November at Hong Kong for scrapping by Four Seasons Enterprises.\nReferences\nExternal links\n*[http://www.photoship.co.uk/JAlbum%20Ships/Old%20Ships%20E/slides/Empire%20Cobbett-01.html Photo of Empire Cobbett]"
    }
  ]
}