{
  "content": [
    {
      "type": "text",
      "text": "# SS Empire Balham\n\n{|\nGreenock (1945-46)\n* London (1946-58)\n* Ceylon (1958-72)\n|Ship renamed=\n|Ship struck=\n|Ship reinstated=\n|Ship honours=\n|Ship captured=\n|Ship fate=\n|Ship identification=*Official Number 169522 (1945-58)\n*Code Letters GDTL (1945-46)\n*\n|Ship notes=\n}}\n|Ship displacement=\n|Ship length=\n|Ship beam=\n|Ship depth=\n|Ship draft=\n|Ship hold depth=\n|Ship propulsion= 1 x triple expansion steam engine (Ramkin & Blackmore Ltd, Greenock)\n|Ship sail plan=\n|Ship complement=\n|Ship armament=\n|Ship speed=\n|Ship notes=\n|Ship capacity=\n}}\n|}\nEmpire Balham was a 1,061 ton cargo ship which was built by G Brown & Co (Marine) Ltd, Greenock in 1944 for the Ministry of War Transport (MoWT). She was sold to Queenship Navigation Ltd in 1946 and renamed Nordic Queen. In 1958 she was sold to the Maldavian National Shipping Corp (Ceylon) Ltd and renamed Maldive Star, serving for a further fourteen years until scrapped in 1967.\nHistory\nEmpire Balham was built by G Brown & Co (Marine) Ltd, Greenock as yard number 232. She was launched on 18 November 1944 and completed in December 1944. She was initially operated under the management of British Channel Islands Shipping Co Ltd.\nWar service\nEmpire Balham was a member of a number of convoys during the Second World War\n;COC 173\nConvoy COC 173 sailed from Falmouth, on 22 May 1945 and arrived at Granville, Manche on  23 May.\nPostwar\nIn 1946, Empire Balham was sold to Queenship Navigation Ltd, London and renamed Nordic Queen. In 1958, Nordic Queen was sold to the Maldavian National Shipping Corp (Ceylon) Ltd, and renamed Maldive Star. In June 1959, Ceylon sent a shipment of arms to the Maldives. Ibrahim Nasir led an expedition of hundreds of armed men aboard the Maldive Star to the Fua Mulaku and Huvadhu Atolls during the Suvadive Rebellion of 1963. Maldive Star served with Maldavian National for fourteen years. Maldive Star was scrapped in December 1972 at Gadani Beach, Karachi, Pakistan.\nOfficial number and code letters\nOfficial Numbers were a forerunner to IMO Numbers.\nEmpire Balham and Nordic Queen had the UK Official Number 169522. Empire Balham used the Code Letters GDTL.\nReferences\nExternal links\n* [http://www.photoship.co.uk/JAlbum%20Ships/Old%20Ships%20N/slides/Nordic%20Queen-01.html Photo of SS Nordic Queen]"
    }
  ]
}