{
  "content": [
    {
      "type": "text",
      "text": "# SS Howard M. Hanna Jr.\n\n{|\n|Ship operator=*Hanna Transit Company (1908-1915)\n*Canada Steamship Lines (1915-1962)\n*Algoma Central and Hudson Bay Railway Company (1962-1968)\n*Goderich Elevator Company (1968-1983)\n|Ship ordered=\n|Ship registry=\n|Ship builder=Cleveland Shipbuilding Company\n|Ship yard number=\n|Ship laid down=\n|Ship launched=28 April 1908\n|Ship completed=1908\n|Ship identification=U.S. Registry #205260\n|Ship acquired=\n|Ship in service=1908\n|Out of service=1983\n|Ship fate=Scrapped in 1983 as the Lionel Parsons\n|Ship notes=}}\n|Ship beam=\n|Ship height=\n|Ship draught=\n|Ship draft=\n|Ship ice glass=\n|Ship sail plan=\n|Ship power=2 x Scotch marine boilers\n|Ship propulsion=Triple expansion steam engine\n|Ship speed=10 knots\n|Ship capacity=9,200 tons\n|Ship crew=25\n|Ship notes=Owned by four companies\n}}\n|}\nHoward M. Hanna Jr. was a  Great Lakes freighter that had a lengthy, 75-year career on the Great Lakes of Canada and America. Hanna was a product of the Cleveland Shipbuilding Company of Cleveland, Ohio. The ship was commissioned by the Richardson Transportation Company to haul iron ore, coal and grain. She had a cargo capacity of 9,200 tons of bulk cargo, or 323,000 bushels of grain.\n1913 storm\nOn 8 November 1913 the Hanna was laden with a cargo of coal bound from Lorain, Ohio, to Fort William, entered Lake Huron in the early hours of November 9. The crew of Hanna had no idea that in a few hours, they would encounter the worst storm in Great Lakes history. While much larger ships sank, such as James Carruthers, the Hanna was caught in the trough of a large wave, rolled over, and was tossed ashore near Port Austin, Michigan. The Hanna sustained a lot of damage including smashed windows and various topside damage. The ship's hull cracked at the 17th hatch, was flooded aft, and the smokestack came crashing down over the aft deckhouse. All 25 crew members on board survived and were later rescued. The bad weather that winter made it impossible to refloat the ship until the following year.\nAfter the storm\nIn 1914 the Hanna was taken to Collingwood then to Midland for major repairs. She did not sail until 1915 when she was purchased by the Great Lakes Transit Company and resumed service as SS Glenshee. On 13 October 1916 the ship grounded in the St. Mary's River. On 1 October 1926 the ship joined the Canada Steamship Lines fleet and was renamed Marquette. The following spring the vessel was renamed Goderich, and she continued to haul bulk cargoes.\nCollisions\nOn 5 June 1943 Goderich had a collision with the  long American grain carrier  (the Armstrong was on her maiden voyage) in the St. Mary's River. Both ships were badly damaged and needed a lot of repairs. On 25 July 1945, Goderich collided with W.W. Holloway on Lake Superior.\nFinal years\nIn 1962 Goderich was tied up in Quebec awaiting scrapping in Europe. Eventually the Algoma Central and Hudson Bay Railway Company bought the ship and renamed her Agawa in April 1963. Agawa sailed until 1967, when she was laid up in Goderich full of grain. In 1968 Agawa was sold to the Goderich Elevator Company for use as a storage barge. Renamed Lionel Parsons, the ship was used for another 15 years until it was no longer needed. The tug W.J. Ivan Purvis escorted her from Goderich, to Thunder Bay, Ontario. She arrived in the scrapyard on 3 June 1983.\nReferences"
    }
  ]
}