{
  "content": [
    {
      "type": "text",
      "text": "# SS King Orry (1871)\n\n{|\n| Ship country             = Isle of Man\n| Ship name                = King Orry\n| Ship owner               = 1871–1912: IOMSPCo.\n| Ship operator            = 1871–1912: IOMSPCo.\n| Ship registry            = Douglas, Isle of Man\n| Ship route               =\n| Ship ordered             =\n| Ship builder             = R. Duncan & Co. Port Glasgow\n| Ship original cost       = £26,000\n| Ship yard number         =\n| Ship way number          =\n| Ship laid down           =\n| Ship launched            =27 March 1871\n| Ship completed           =\n| Ship christened          =\n| Ship acquired            =\n| Ship maiden voyage       =\n| Ship in service          = 1871\n| Ship out of service      = 1912\n| Ship identification      =*Official Number 45479\n*Code Letters P K J B\n*\n*\n| Ship fate                = Scrapped at Llanerchymor, 1912\n| Ship notes               =\n}}\nlater increased to\n| Ship displacement        =\n| Ship length              =  later increased to\n| Ship beam                =\n| Ship draught             =\n| Ship depth               =\n| Ship decks               =\n| Ship deck clearance      =\n| Ship ramps               =\n| Ship power               =\n| Ship propulsion          = Diagonal compound engines, working at , developing\n| Ship speed               =\n| Ship capacity            = 1104 passengers\n| Ship crew                = 47\n| Ship notes               =\n}}\n|}\n'SS (RMS) King Orry (II)' No. 45479 – the second vessel in the company's history to bear the name – was an iron paddle-steamer operated by the Isle of Man Steam Packet Company.\n.]]\nConstruction and dimensions\nKing Orry was built by R. Duncan & Co., at Port Glasgow in 1871, with engines by Rankin & Blackmore, and launched on Monday 27 March 1871.\nLength 260'; beam 29'4\"; depth 14'7\", King Orry had an original tonnage of , and this was later increased to 1,104. Her original speed was 15 knots.\n.]]\nIn 1888, King Orry was refitted by Fairfield & Co at a cost of £8,246.\nShe was lengthened by 30 feet, and at the same time she was reboilered by J. Jones & Co for £4,080.\nThis thorough refit gave her a new boiler pressure of , her diagonal compound engine now had a stroke of 78 inches with a high-pressure cylinder of 52 inches and low pressure 92. Consequently, her speed was now increased from  to .\nIn 1895 she was given a complete electric lighting installation costing £575.\nService life\nConsidered an exceptionally well appointed ship, King Orry saw service on the wide range of routes the Steam Packet Company then operated.\nA contemporary report of the time stated she had:-\nFor her operation the latest advancements in technology had been introduced. Part of this was the provision for telegraph communication with the engine room from both ends of the bridge, a speaking tube in the center and a third telegraph at the Captain's look-out house on the fore part of the hurricane deck.\nThe vessel could therefore either been steered from the hurricane deck or the aft part of the ship..]]\nAt the time King Orry entered service approximately 100,000 passengers were being conveyed by the Company, thanks in no small measure to the newly constructed low water landing pier at Douglas (now named the Victoria Pier), prior to the construction of which required passengers to disembark by boat.\nOn 1 September 1873, during a voyage from Liverpool to Douglas, an explosion in her magazine injured several people, one seriously. On 12 August 1878, she collided with Concordia, which was at anchor in the River Mersey. King Orry was undamaged and proceeded on her voyage to Douglas. On 19 June 1884, the King Orry was required to go to the assistance of the Mona’s Isle which had suffered a mechanical failure. Departing Liverpool at 13:05hrs with approximately 250 passengers embarked, Mona’s Isle cleared the Victoria Channel and set a course bound for Douglas. She passed the Tynwald, which was engaged in accompanying yachts racing in the Mersey, at 14:30hrs which reported her to be making good speed. When approximately mid-channel the mechanical failure to her machinery occurred, forcing her Master, Capt. McQueen, to come to anchor and await the arrival of assistance. As there was no wireless communication at that time, anxiety was caused in Douglas as the scheduled time of arrival of the Mona’s Isle passed, requiring the Isle of Man Steam Packet Company to contact their Liverpool office to ensure that she had departed on time. This was duly confirmed and the King Orry, under the command of Capt. Gill, was coaled and despatched in order to locate the Mona’s Isle and give assistance.\nAt 23:15hrs the Mona’s Isle was located by the King Orry, which then took her under tow and proceeded to Douglas. Passage was slow, and it was not until 05:00hrs the following morning that the two vessels arrived in Douglas; where many people had stayed on the Victoria Pier all night, anxious to receive news.\nWhilst out of commission, the King Orry replaced the Mona’s Isle on the Liverpool schedule, and in turn she was replaced on the Fleetwood schedule by the Fenella.\nDisposal\nAfter 41 years of service&nbsp;– the longest service record up until that time in the history of the Steam Packet Fleet&nbsp;– the decision was made to withdraw her. She was taken by Captain Quine to Llanerchymor for breaking, but before scrapping commenced she was opened for public inspection with the proceeds of this been donated to the Honeywell Cottage Hospital.\nKing Orry was broken up at Llanerchymor, Wales, in 1912.\nOfficial number and code letters\nOfficial numbers are issued by individual flag states. They should not be confused with IMO ship identification numbers. King Orry had the UK Official Number 45479 and used the Code Letters  P K J B .\nReferences\n;Bibliography\n* Chappell, Connery (1980). Island Lifeline T. Stephenson & Sons"
    }
  ]
}