{
  "content": [
    {
      "type": "text",
      "text": "# SS President Taylor\n\n{|\n|Ship name=\n|Ship owner=\n|Ship namesake=\n|Ship ordered=\n|Ship builder=New York Shipbuilding\n|Ship laid down=22 May 1919\n|Ship launched=31 July 1920\n|Ship acquired=7 March 1921\n|Ship commissioned=\n|Ship in service=\n|Ship honours=\n|Ship fate=Wrecked on Kanton Island, 14 February 1942\n|Ship notes=\n}}\n|Ship displacement=21,100 LT\n|Ship length=* LBP\n* LOA\n|Ship beam=\n|Ship draft=\n|Ship propulsion=Twin screw, two 4-cylinder triple expansion steam engines rated at 3500 HP each at 105 RPM. Six Scotch marine single-ended fire tube boilers, 220 PSI WP and 50 degrees fahrenheit superheat.\n|Ship speed=14 knots\n|Ship range=\n|Ship complement=\n|Ship sensors=\n|Ship EW=\n|Ship armament=\n|Ship notes=\n}}\n|}\nPresident Taylor was a cargo-liner, ex President Polk, ex Granite State, requisitioned for war service in December 1941 and allocated by the War Shipping Administration (WSA) to the U.S. Army and operating as a troopship in the Pacific Ocean in World War II when grounded and eventually lost on 14 February 1942.\nHistory\nDesign and construction\nGranite State was built by the New York Shipbuilding Corporation for the U.S. Shipping Board as hull 246, keel laid 22 May 1919, launched 31 July 1920. The ship was an Emergency Fleet Corporation Design 1095 passenger/cargo design more frequently known in the industry as the \"502\" type for the design length of  between perpendiculars. The design had been for troop transports until signing of the armistice ending World War I made completion as civilian passenger and cargo ships desirable. New York Shipbuilding had the contract for all seven of the \"502\" class and nine of the \"535\" class, an order requiring expansion and construction of the company's South Yard, that were to be delivered to the United States Shipping Board (USSB).\nThe ship was allocated and delivered 7 March 1921 to the Pacific Mail Steamship Company for operation from San Francisco to Honolulu, Manila, Saigon, Singapore, Calcutta and return.\nCivilian career\nThe ship arrived from the Atlantic in San Francisco to begin Pacific Mail's Indian Service on 4 April 1921. The ship was bought by Dollar Steamship Lines in 1923 for Round-the-World trade and renamed President Polk. The ship transferred in 1938 to American President Lines and was renamed President Taylor in 1940 accommodating 128 passengers.\nWorld War II\nPresident Taylor was requisitioned for war service with WSA 6 December 1941 with American President Lines as the operating agent and allocated to the United States Army requirements. She was re-fitted for use as a troop carrier in San Francisco in December 1941. Her initial voyage as a troopship was a round trip from San Francisco to Honolulu and back. The ship left San Francisco for the Philippines on 31 January 1942, under the command of Captain A. W. Aitken.\nWreck on Canton\nPresident Taylor, taking part in an effort to reinforce islands considered vital to protect communication lines with Australia, carried two companies of infantry and two battalions of coast artillery, about 1,100 men, for the Canton (Kanton) Island garrison. During that operation, possibly due to loss of an anchor while landing troops and equipment by means of shallow draft craft from outside the lagoon, the ship became firmly grounded on the coral reef. The ship was eventually a loss despite extensive efforts to re-float and save her.\nThe grounded ship was unloaded under difficult conditions, and salvage attempts made with first USCG Cutter Taney and fleet tug Seminole dispatched, later joined by fleet tug Navajo and by repair ship Argonne on 12 April 1942 with salvage expert LCDR Curtiss being flown to the island. Argonne, a large ship of 8,400 tons displacement, embarked salvage equipment along with supplies and munitions for the island, sent salvage crews aboard Taylor before leaving to return to Pearl Harbor 5 May 1942.\nAs of 22 February 1942, neither salvage nor offloading had been effective due to weather, and extra barges for offloading were not due for about two weeks. No progress had been made by 24 February 1942, and Robin was sent towing a large and three small lighters to assist in unloading with arrival noted on 5 March 1942 along with an estimate of three weeks to re-float Taylor. By 10 March 1942, some progress was reported but efforts to free the ship were unsuccessful and prospects to do so described as \"most unfavorable.\" By 22 March 1942, the salvage units had been ordered to return awaiting a decision emerging from a meeting with salvage specialists. After the meeting on 1 April 1942, an order from CinCPac to COMSERFORPAC 3 April 1942 directed an expedition to salvage Taylor. On 2 May 1942 the effort to salvage Taylor was abandoned with the effort seen as good experience and an indication to the vessel owners that the Navy would make the attempt.\nUnder terms of the supplemental vessels agreement WSA paid American President Lines $1,260,960 for the loss. On 9 March 1953 the remains of the ship were sold to North Coast Corporation for $5,220 with the requirement the hull be scrapped on or before 6 April 1955. Scrapping began in 1954.\nFootnotes\nReferences\nBibliography\n* |archive-date=1 October 2015 |archive-url=https://web.archive.org/web/20151001062358/http://www.shipbuildinghistory.com/history/shipyards/2large/inactive/newyorkship.htm |url-status=dead }}\n*\n* }}\n* }}\n* }}\n* }}\n* }}\n*\nExternal links\n* [http://www.shipscribe.com/mckellar/pix/1095.html EFC Design 1095: Illustrations] (Outboard profile, deck house plan, includes photo of Blue Hen State]\n* [http://wikimapia.org/11342122/Wreck-of-SS-President-Taylor-1942 Wreck of SS President Taylor (1942)]"
    }
  ]
}