{
  "content": [
    {
      "type": "text",
      "text": "# SS President Wilson\n\n{|\n|Ship name= SS President Wilson\n|Ship namesake=Woodrow Wilson\n|Ship owner=\n|Ship operator=*United States Maritime Commission (originally planned)\n*American President Lines (1948-1970)\n*Oceanic Cruise Development (1973-1984)\n|Ship registry=\n|Ship route=Trans-Pacific\n|Ship ordered=\n|Ship awarded=\n|Ship builder= Bethlehem Shipbuilding Corporation, Alameda, California\n|Ship original cost=\n|Ship yard number=9510\n|Ship way number=\n|Ship laid down= November 27, 1944\n|Ship launched= November 24, 1947\n|Ship sponsor=Mrs. E. Russell Lutz\n|Ship christened=\n|Ship completed= April 27, 1948\n|Ship acquired=\n|Ship maiden voyage=\n|Ship in service=until 1961\n|Ship out of service=\n|Ship renamed= Oriental Empress\n|Ship reclassified=\n|Ship refit=\n|Ship struck=\n|Ship reinstated=\n|Ship homeport=\n|Ship identification=*\n*Official number: 255039\n|Ship motto=\n|Ship nickname=\n|Ship honors=\n|Ship captured=\n|Ship fate=Scrapped, 1984\n|Ship notes=\n|Ship badge=}}\n*\n*\n|Ship displacement=\n|Ship length=* o/a\n* p/p\n|Ship beam=\n|Ship height=\n|Ship draft=\n|Ship depth=\n|Ship hold depth=\n|Ship decks=\n|Ship deck clearance=\n|Ship power=\n|Ship propulsion=*turbo-electric transmission;\n*twin screw\n|Ship speed=\n|Ship range=\n|Ship endurance=\n|Ship boats=\n|Ship capacity=*579 passengers (379 first class, 200 economy class)\n* cargo\n|Ship crew=\n|Ship notes= sister ship: }}\n|}\n'SS President Wilson' was an American passenger ship originally ordered by the United States Maritime Commission during World War II, as one of the Admiral W. S. Benson-class Type P2-SE2-R1 transport ships, and intended to be named 'USS Admiral F.B. Upham' (AP-129), but she was launched just after the war ended. in 1948, The ship was put into service for the American President Lines. The ship remained in service for the shipping company until 1973. She was sold to Oceanic Cruise Development before eventually, scrapped at Kaohsiung.\nBackground\nThe President Wilson and her sister ship the SS President Cleveland were originally planned to be commissioned by the United States Maritime Commission in a series of eight troopships of the type P2-SE2-R1 (Admirals) class ships. The class was designed to be used as a passenger ship which could be readily converted into a troop transport ships during wartime service. During construction, President Wilson and President Cleveland were canceled, so the ships were later converted into passenger liners.\nHistory\nThe President Wilson was laid down on November 27, 1944 at the Bethlehem Steel shipyard in Alameda, California, but was cancelled on December 16, 1944. The ship was finally launched on November 24, 1947, completed and delivered to the Maritime Commission on April 27, 1948. Under the name SS President Wilson, she was bareboat chartered by the Maritime Commission to American President Lines (APL). During its service with APL, President Wilson operated on a Pacific Ocean route, traveling from San Francisco to Los Angeles, Hawaii, or the far east before returning back to San Francisco. By the late 1950s, passenger liners were being eclipsed by jet airplanes as the preferred mode of trans-oceanic travel, but APL redirected its marketing efforts to pleasure travelers and continued its liner service well past the retirement of many of President Wilsons contemporaries. The ship remained in service until 1960 without major incidents. It was then modernized in San Francisco. In 1962 President Wilson moved from San Francisco to Yokohama. In 1970 the ship was decommissioned and sold due to falling passenger numbers.\nShe was sold to Orient Overseas Line on April 27, 1973, and renamed Oriental Empress. On December 7, 1973 it departed Los Angeles but upon arriving in Hong Kong, oil was unable to be sourced due to the 1973 oil crisis and it was promptly withdrawn and its passengers flown home. It briefly returned to service before being withdrawn in September 1975. It remained laid up at anchor until taken to  Kaohsiung, Taiwan for scrap in May 1984.\nReferences\n*"
    }
  ]
}