{
  "content": [
    {
      "type": "text",
      "text": "# SS Warrimoo\n\n{|\nLondon\n*1901:  Dunedin\n*1916:  Singapore\n|Ship route=\n|Ship ordered=\n|Ship builder= Swan, Hunter, Wallsend\n|Ship original cost=\n|Ship yard number= 175\n|Ship laid down=\n|Ship launched= 28 May 1892\n|Ship sponsor=\n|Ship completed= July 1892\n|Ship maiden voyage= 30 July 1892\n|Ship acquired=\n|Ship in service=\n|Ship out of service=\n|Ship identification= *UK official number 101901\n*code letters NKGW\n*\n|Ship fate= Sank after collision with\n|Ship notes=\n}}\n,\n|Ship displacement=\n|Ship length=  registered length\n|Ship beam=\n|Ship draught=\n|Ship depth=\n|Ship decks=\n|Ship power= 722 NHP\n|Ship propulsion= 3-cylinder triple-expansion engine\n|Ship speed=\n|Ship capacity=\n|Ship crew=\n|Ship armament=\n|Ship sensors=\n|Ship notes= sister ship:\n}}\n|}\n'SS Warrimoo' was a passenger and refrigerated cargo liner that was launched in 1892 in England for Australian owners, was later owned by two of New Zealand's foremost shipping companies, and finally belonged to a Singaporean company.\nWarrimoo was the subject of a claim that she crossed the intersection of the International Date Line and the Equator precisely at the turn of the year from 1899 to 1900 on a voyage from Vancouver to Sydney.\nWarrimoo was a troop ship in the First World War. In 1918 the  collided with Warrimoo in the Mediterranean. In the collision some of Catapultes depth charges broke loose and fell into the sea, where they detonated and sank both ships.\nBuilding\nSwan, Hunter built Warrimoo at Wallsend on the River Tyne, launching her on 28 May 1892 and completing her that July. Swan, Hunter also built a sister ship, , which was launched on 25 July and completed in October.\nService\nline Warrimoos deck before leaving New Zealand in February 1915]]\nJames Huddart ordered Warrimoo and Miowera for his New Zealand and Australian Steam Ship Company to run a Trans-Tasman service between New Zealand and Australia. However, Warrimoos maiden voyage was a cruise to the fjords of Norway before she was delivered to the Southern Hemisphere.\nIn 1893 Huddart created the Canadian-Australian Steam Ship Company to operate a liner service between Australia and Vancouver, British Columbia, and he transferred Warrimoo and Miowera to this new service.\nIn 1897 the New Zealand Shipping Company bought both Warrimoo and Miowera. In 1901 the Union Steamship Company of New Zealand, commonly called simply the \"Union Company\", bought Warrimoo.\nWarrimoo was a troop ship in the First World War. In February 1915 she took the Māori Pioneer Battalion overseas as part of the New Zealand Expeditionary Force.\nIn 1916 Khiam Yik & Co Ltd of Singapore, a company controlled by Tan Kah Kee, bought Warrimoo. She continued to carry troops.\nIn May 1918 Warrimoo was part of a convoy carrying troops from Bizerte (Tunisia) to Marseille (France). The destroyer Catapulte collided with her, some of Catapultes depth charges broke loose, fell into the sea and detonated, sinking both ships. 58 of Catapultes crew and one person aboard Warrimoo were killed.\nInternational Date Line claim\nIn January 1900 The Sydney Morning Herald reported that Warrimoo captained by J.D. Phillips, crossed the Equator on 30 December 1899.\nHowever, it was later claimed that Warrimoo reached the intersection of the International Date Line and the Equator at midnight on 31 December 1899. This would have placed her bow in the Southern Hemisphere in summer on 1 January 1900, her stern in the Northern Hemisphere in winter on 31 December 1899. She would therefore have been simultaneously in two different seasons (winter and summer), in two different hemispheres, on two different days, in two different months, in two different years, in two different decades, in two different centuries. (The \"centuries\" referred to by the writer would be the 1800s and the 1900s, rather than the customary 19th and 20th centuries.)\nThe story was still in popular print circulation in 1942,  was popularized by an article in the magazine Ships and the Sea in 1953, and was in online circulation on social media .  However, the navigational technology of the time was not accurate enough to have fixed her position so precisely. Whether Warrimoo ever achieved the feat claimed cannot be verified.\nReferences\nExternal links\n*"
    }
  ]
}