{
  "content": [
    {
      "type": "text",
      "text": "# SS Waroonga (1882)\n\n|section2= Glasgow\n*1889:  Brisbane\n*1900:  Glasgow\n*1913:  Kobe\n*1914:  Dairen\n*1917:  Kobe\n*1920:  Tsuruga\n|route=\n|ordered=\n|awarded=\n|builder= A. & J. Inglis Pointhouse, Glasgow\n|original_cost=\n|yard_number= 172\n|way_number=\n|laid_down=\n|launched= 25 December 1882\n|sponsor=\n|completed= 1883\n|acquired=\n|commissioned=\n|recommissioned=\n|decommissioned=\n|maiden_voyage= 26 March 1883\n|in_service=\n|out_of_service=\n|renamed=\n|refit=\n|struck=\n|identification= *UK official number 86749\n*code letters HGQW\n*\n|motto=\n|nickname=\n|honours=\n|fate=\n|notes=\n}}\n|section3=,\n|length=\n|beam=\n|height=\n|draught=\n|depth=\n|hold_depth=\n|decks=\n|power= 317 NHP\n|propulsion= *1 × compound steam engine\n*1 × screw\n|sail_plan= brigantine\n|speed=\n|range=\n|endurance=\n|test_depth=\n|boats=\n|capacity=\n|complement=\n|crew=\n|notes=\n}}\n}}\n'SS Waroonga was a steel-hulled passenger and cargo steamship that was launched in Scotland in 1882, renamed Bansei Maru' in 1913 and scrapped in Japan in 1926. Her career included periods in British, Australian and Japanese ownership.\nBuilding\nA. & J. Inglis built Waroonga in Glasgow for Edwyn S Dawes of Gray, Dawes & Co. Her registered length was , her beam was  and her depth was . Her tonnages were  and .\nWaroonga was screw-propelled, with an inverted two-cylinder compound steam engine also built by A & J Inglis. The engine had a  stroke, its high-pressure cylinder had a  bore and its low-pressure cylinder had a  bore. It was rated at 317 NHP.\nDawes registered Waroonga in Glasgow. Her UK official number was 86749 and her code letters were HGQW.\nMaiden voyage\nWaroongas maiden voyage started from London on 26 March 1883. She sailed to Brisbane via Suez and Batavia. On her maiden voyage she carried Harry \"Breaker\" Morant to Australia.\nChanges of ownership and registry\nIn 1885 British India Associated Steamers became Waroongas owners. In 1889 the Australasian United Steam Navigation Company bought her and registered her in Brisbane. In 1900 the British India Steam Navigation Company bought her back and registered her in Glasgow.\nIn 1913 bought Waroonga, renamed her Bansei Maru and registered her in Kobe. She then passed through a series of Japanese owners who registered her in various ports in Japan and Kwantung. She was scrapped in 1926.\nReferences"
    }
  ]
}