{
  "content": [
    {
      "type": "text",
      "text": "# St. Louis Swarm\n\n| sponsor         =\n| president       = Michael Mannion\n| vice-presidents =\n| manager         =\n| coach           = Bernie Bickerstaff\n| captain         =\n| ownership       = RiverCity Basketball\n| championships   = 2 2000, 2001\n| conf_champs     =\n| div_champs      =\n| website         = ]}}\n}}\nThe St. Louis Swarm was a professional basketball team based in St. Charles, Missouri from 1999 to 2001. They were members of the International Basketball League and won the league's only two championship series in 2000 and 2001. The Swarm played home games at Family Arena.\nHistory\nIn 1999, an ownership group with the name RiverCity Basketball announced their intentions to purchase an expansion franchise in the Continental Basketball Association (CBA), however, after the creation of the International Basketball League the ownership group announced they would be joining the fledgling league instead of the 53-year-old CBA. In response, CBA officials filed a lawsuit against RiverCity Basketball for breach of contract. As a condition of joining the IBL, the team would have to be named St. Louis, not St. Charles, which is where their home arena—Family Center—was located. In February 1999, the Swarm announced the hiring of Butch Beard as head coach. St. Louis University alumni Erwin Claggett was the first player signed by the Swarm as announced by team president Michael Mannion on February 16, 1999. The team's nickname \"Swarm\" was announced before an audience at the Regal Riverfront Hotel in Downtown St. Louis. The Swarm's logo was also unveiled and was described by the St. Louis Post-Dispatch as \"a bee grasping a basketball with its left hand as it prepares to slam the ball through the hoop in its right hand\".\nIn April 1999, the Swarm hired St. Louis native Lee Winfield as assistant coach. St. Louis held a try-out camp from May 21 to May 23, 1999 on the campus of Lindenwood University in St. Charles, Missouri. A $125 pre-registration fee was required. Twenty-four players form the tryout were recommended by the team for the IBL draft out of the 110 people who registered. The Swarm were awarded the second pick in the IBL draft. The IBL held a preliminary draft in early July 1999 for players who were selected in the second round of the National Basketball Association draft. The Swarm selected Chris Herren from Fresno State University, who was also selected by the Denver Nuggets in the 1999 NBA draft. They also selected St. Charles native Ryan Robertson, who was selected by the Sacramento Kings, and Antwain Smith, who was picked by the Vancouver Grizzlies. In July 1999, it was reported by the St. Louis Post-Dispatch that Swarm head coach Butch Beard was negotiating to join the Washington Wizards as an assistant coach to Gar Heard. Beard was hired by the Wizards in August 1999.\nDuring the IBL's territorial draft, the Swarm selected former University of Missouri basketball players Doug Smith and Derek Grimm. The team held a draft night party on July 19, 1999, which featured Swarm assistant coach Lee Winfield. The Swarm selected Robert Werdann in the first round of the draft. Their other picks were Kermit Holmes, Evric Gray, Jamal Robinson and Versile Shaw. After Butch Beard was hired by the Washington Wizards, the Swarm opened their search for a new head coach. Swarm president Michael Mannion announced the team was considering a bevy of candidates including Jack Haley, Kurt Rambis, Kiki Vandeweghe, Brian Winters and Brad Greenberg. On August 31, 1999 the Swarm announced that Bernie Bickerstaff was hired as head coach and general manager. Swarm president Michael Mannion told the St. Louis Post-Dispatch that Bickerstaff was not on the list of candidates, saying, \"Honestly, I didn't think someone like Bernie would be interested\". The announcement of Bickerstaff of coach was delayed as he finished his role as coaching advisor to the Harlem Globetrotters, an American barnstorming team. The Swarm also announced that former National Football League player John Outlaw had been hired as assistant coach.\nIn September 1999, the Swarm announced they had signed a contract with radio station KFNS-FM to broadcast live IBL games during the 1999–2000 season. The Swarm on-air broadcasting team consisted of Dave Greene doing play-by-play and former Saint Louis University basketball assistant coach Jay Spoonhour as the color commentator. The Swarm held an open house at Family Arena in October 1999 that featured three St. Louis players Erwin Claggett, Doug Smith and Versile Shaw in which 5,000 people attended, 3,000 more than the Swarm's anticipated attendance. The Swarm sold 200 ticket packages at the event, worth an aggregate of $40,000. Individual game tickets went on sale on October 18, 1999 and ranged from $7 to $25.\nAwards\n*2000 International Basketball League Champions\n*2001 International Basketball League Champions\n*1999–2000 IBL Coach of the Year — Bernie Bickerstaff\n*1999–2000 IBL Most Valuable Player — Doug Smith\n*1999–2000 IBL Defensive Player of the Year — Doug Smith\n*1999–2000 IBL Rookie of the Year — Danny Johnson\n*1999–2000 All-IBL First-Team — Danny Johnson (guard) and Doug Smith (center)\nSee also\n*Atlanta Hawks, formerly the St. Louis Hawks of the National Basketball Association\n*Spirits of St. Louis, St. Louis based American Basketball Association franchise\n*St. Louis Trotters, a semi-professional basketball team based in St. Louis\n*Missouri River Otters, a professional hockey team which shared a venue with the Swarm\nReferences\nExternal links\n*Riverfront Times — [https://www.riverfronttimes.com/stlouis/best-minor-league-team/BestOf?oid=2508311 \"Best of St. Louis 2001: Sports & Recreation; Best Minor-League Team: St. Louis Swarm\"]"
    }
  ]
}