{
  "content": [
    {
      "type": "text",
      "text": "# St. Edward, Nebraska\n\n|area_magnitude           =\n|area_total_km2           = 1.71\n|area_land_km2            = 1.71\n|area_water_km2           = 0.00\n|area_total_sq_mi         = 0.66\n|area_land_sq_mi          = 0.66\n|area_water_sq_mi         = 0.00\n|population_as_of         = 2020\n|population_est           =\n|pop_est_as_of            =\n|population_footnotes     =\n|population_total         = 725\n|population_density_km2   = 425.13\n|population_density_sq_mi = 1101.82\n|timezone                 = Central (CST)\n|utc_offset               = -6\n|timezone_DST             = CDT\n|utc_offset_DST           = -5\n|elevation_footnotes      =\n|elevation_ft             = 1667\n|coordinates              =\n| postal_code_type                = ZIP code\n| postal_code              = 68660\n| area_codes                       = 402 and 531\n|blank_name               = FIPS code\n|blank_info               = 31-43055\n|blank1_name              = GNIS feature ID\n|blank1_info              = 2396485\n|website                  = https://stedwardne.com/\n|footnotes                =\n|pop_est_footnotes =\n}}\nSt. Edward or Saint Edward is a city in Boone County, Nebraska, United States. The population was 725 at the 2020 census.\nHistory\nSt. Edward was founded in 1871. An early variant name was \"Waterville\". A post office called Waterville was established in 1874, and the name was changed to Saint Edward in 1877. The present name honors Edward Sorin, C.S.C., a Roman Catholic priest.\nGeography\nSt. Edward is located at  (41.571350, -97.861282).\nAccording to the United States Census Bureau, the city has a total area of , all land.\nDemographics\n}}\n2010 census\nAs of the census of 2010, there were 705 people, 292 households, and 181 families residing in the city. The population density was . There were 337 housing units at an average density of . The racial makeup of the city was 97.6% White, 1.4% African American, 0.1% Asian, 0.6% from other races, and 0.3% from two or more races. Hispanic or Latino people of any race were 1.4% of the population.\nThere were 292 households, of which 28.4% had children under the age of 18 living with them, 50.0% were married couples living together, 8.9% had a female householder with no husband present, 3.1% had a male householder with no wife present, and 38.0% were non-families. 34.6% of all households were made up of individuals, and 19.5% had someone living alone who was 65 years of age or older. The average household size was 2.29 and the average family size was 2.93.\nThe median age in the city was 46.3 years. 22.7% of residents were under the age of 18; 8.3% were between the ages of 18 and 24; 17.6% were from 25 to 44; 26.7% were from 45 to 64; and 24.7% were 65 years of age or older. The gender makeup of the city was 47.5% male and 52.5% female.\n2000 census\nAs of the census of 2000, there were 796 people, 315 households, and 206 families residing in the city. The population density was . There were 359 housing units at an average density of . The racial makeup of the city was 99.12% White, 0.38% African American, 0.13% Native American, and 0.38% from two or more races. Hispanic or Latino people of any race were 1.01% of the population.\nThere were 315 households, out of which 30.2% had children under the age of 18 living with them, 53.3% were married couples living together, 8.3% had a female householder with no husband present, and 34.6% were non-families. 32.1% of all households were made up of individuals, and 19.7% had someone living alone who was 65 years of age or older. The average household size was 2.37 and the average family size was 3.03.\nIn the city, the population was spread out, with 26.6% under the age of 18, 4.6% from 18 to 24, 22.0% from 25 to 44, 20.7% from 45 to 64, and 26.0% who were 65 years of age or older. The median age was 42 years. For every 100 females, there were 98.0 males. For every 100 females age 18 and over, there were 92.7 males.\nThe median income for a household in the city was $27,212, and the median income for a family was $33,750. Males had a median income of $28,500 versus $17,891 for females. The per capita income for the city was $13,973. About 13.6% of families and 15.0% of the population were below the poverty line, including 15.9% of those under age 18 and 20.8% of those age 65 or over.\nNotable people\n*Cletus Fischer, former National Football League (NFL) and Nebraska player.\n*Pat Fischer, former National Football League (NFL) and Nebraska player.\n*W. Ward Reynoldson, Chief Justice of the Iowa Supreme Court, was born in St. Edward.\n*Scott Shanle, former National Football League (NFL) and Nebraska player.\nReferences\nExternal links\n* [http://www.ci.saint-edward.ne.us/ City of Saint Edward, Nebraska]"
    }
  ]
}