{
  "content": [
    {
      "type": "text",
      "text": "# St. Thomas Church and Howard–Flaget House\n\n| address            = 870 Saint Thomas Lane  Bardstown, Kentucky, US\n| denomination       = Catholic Church\n| sui iuris church   = Latin Church\n| dedicated date     = August 15, 1816\n| designated date    = July 12, 1976\n| architect          = Maximilian Godefroy\n| architectural type = Neo-Gothic\n}}\n}}\nSt. Thomas Church is a Catholic parish church of the Archdiocese of Louisville located in Bardstown, Kentucky, United States. A seminary, the first Catholic seminary on the American frontier, moved to the Howard–Flaget House on the church property in 1795 and continued to operate there until 1869. The Sisters of Charity of Nazareth were founded at the church in 1812. The parish church was established in 1806, and the current Neo-Gothic brick church was completed in 1816. The present church was designed by Maximilian Godefroy and modeled off of St. Mary's Seminary Chapel in Baltimore, Maryland. The church and other historic buildings on the property were added to the National Register of Historic Places in 1976.\nHistory\nHoward family farm\nIn 1787, Edward Howard lead a group of Maryland Catholics who settled in the area of Bardstown, Kentucky, as part of a larger group who had begun moving to Kentucky in 1785. Howard settled on a property three miles south of the town of Bardstown. Following Edward's death, ownership of the property passed to Thomas and Ann Howard. In 1795, the couple built a log cabin on their 109 acres of property, and in 1806 it became the site of a public church named Saint Thomas, to alleviate overcrowding at the church that would become the Basilica of St. Joseph Proto-Cathedral. Having no children, Thomas Howard willed all of the property, then consisting of 400 acres of land valued at $5,000, to the Catholic Church through Stephen Badin and Charles Nerinckx upon his death in 1810.\nSaint Thomas Seminary\nApril 1808 the Diocese of Bardstown was created by Pope Pius VII, encompassing all of Kentucky as well as Tennessee, Ohio, and the Northwest Territory under the leadership of Bishop Benedict Flaget. Previously this territory had been administered by the Archdiocese of Baltimore. Bishop Flaget, along with Father John Baptist Mary David, accompanied by a handful of seminarians including Guy Ignatius Chabrat, set sail down the Ohio, forming the nucleus of the clergy of the still-young diocese. Flaget and David continued seminary formation aboard the flatboat, thus forming St. Thomas Seminary on May 22, 1811, the date the craft pushed off from Pittsburgh. During the two-week journey the Sulpician priests kept a strict routine of study and prayer for the students with them. Following their arrival in Kentucky, they initially lived with Stephen Badin at his property that served the mission of Holy Cross Church. This property, then known as \"St. Stephen's\" would eventually become the mother-house of the Sisters of Loretto in Nerinx, Kentucky. Badin's property, however, did not have enough space for both the seminarians and the priests, so soon after the death of Thomas Howard, the seminary moved to the Howard property in November 1811, and was named St. Thomas after Howard. Saint Thomas was the first Roman Catholic seminary on the American frontier.\nChabrat, having begun his clerical training in Europe and completed it in the United States, was the first graduate of the seminary to be ordained to the priesthood on December 21, 1811. By the following spring, the seminarians began building additional log dwellings to allow for a specialized dormitory for the seminarians.\nSisters of Charity of Nazareth\nIn 1812, two young women, Theresa Carrico and Elizabeth Wells came to John Baptist Mary David, seeking to form a religious community. David gave them a log cabin on the property. In January 1813 they were joined by Catherine Spalding and their community came to be the Sisters of Charity of Nazareth. The community moved to their current mother house in Nazareth, Kentucky in 1822.\nCurrent church\nIn July 1812, both seminarians and lay people began to work on making bricks to replace the log church. By the following July, Maximilian Godefroy was contracted to design the church, a reduced version of the Neo-Gothic St. Mary's Seminary Chapel in Baltimore. On August 15, 1816, the feast of the Assumption of Mary, the new chapel was consecrated by Flaget.\nThe prominence of Saint Thomas in the Diocese of Bardstown began to dwindle as work on St. Joseph Cathedral began. Flaget left to reside near the cathedral of Bardstown in 1819, taking David and the seminarians with him. The older seminarians, those in major seminary, also left for Bardstown in 1819. The site continued to be used as a minor seminary until 1869.\nSt. Thomas Orphanage\nThe parish grounds also housed an orphanage from 1850 to 1889, when its operations were moved to Bardstown, where it operated until 1984. The parish also ran an elementary school from 1914 to 1931, and again from 1957 to 1998.\nLog cabin and church restoration\nFollowing the closure of the parish school in 1998, the parish began to restore the original log cabin which Flaget and other Saint Thomas founders under the guidance of the Kentucky Heritage Council. Appeals were made to the 44 dioceses which had been originally part of the Diocese of Bardstown, with 37 of them contributing financially. The restored cabin was dedicated on September 10, 2006. The same year, a new altar and tabernacle stand were dedicated in the church, along with other renovations to the space.\nReferences\nExternal links\n*\n* [http://www.st-thomasparish.org/ Saint Thomas Parish website]"
    }
  ]
}