{
  "content": [
    {
      "type": "text",
      "text": "# St. Mary's High School (Independence, Missouri)\n\n| schoolnumber      =\n| schoolboard       =\n| district          =\n| authority         =\n| religion          = Roman Catholic\n| denomination      =\n| oversight         =\n| affiliation       =\n| superintendent    = Marlon de la Torre\n| trustee           =\n| founder           =\n| president         =\n| head of school    =\n| headteacher       =\n| head_label        =\n| head              =\n| chairperson       =\n| principal         = Jeff Lynch\n| viceprincipal     =\n| asst principal    =\n| dean              =\n| administrator     =\n| rector            =\n| chaplain          = Fr. Ron Verhaeghe\n| director          =\n| custodian         =\n| staff             =\n| ranking           =\n| faculty           =\n| teaching_staff    =\n| roll              =\n| MOE               =\n| ceeb              =\n| school code       =\n| LEA               =\n| ofsted            =\n| testaverage       =\n| testname          =\n| national_ranking  =\n| classes           =\n| classes offered   =\n| avg_class_size    =\n| ratio             =\n| SAT               =\n| ACT               =\n| type              = Private, Coeducational\n| system            =\n| fees              =\n| tuition           =\n| endowment         =\n| grades            = 9–12\n| campus            =\n| campus size       =\n| campus type       =\n| hours_in_day      =\n| athletics         =\n| conference        =\n| slogan            =\n| song              =\n| fightsong         =\n| motto             =\n| motto_translation =\n| accreditation     = North Central Association of Colleges and Schools\n| rival             =Van Horn High School\n| mascot            =Trojan\n| mascot image      =\n| sports            =\n| patron            =\n| team_name         = Trojans\n| nickname          =\n| colors            = Royal Blue and White\n| yearbook          =\n| publication       =\n| newspaper         =\n| established       =\n| status            =\n| closed            =\n| alumni            =\n| nobel_laureates   =\n| enrollment        =\n| enrollment_as_of  =\n| grade9            =\n| grade10           =\n| grade11           =\n| grade12           =\n| other_grade_label =\n| other             =\n| communities       =\n| feeders           =\n| free_label        =\n| free_text         =\n| free_label1       =\n| free_text1        =\n| free_label2       =\n| free_text2        =\n| free_label3       =\n| free_text3        =\n| free_label4       =\n| free_text4        =\n| free_label5       =\n| free_text5        =\n| footnotes         =\n| picture           =\n}}\n'''St. Mary's Bundschu Memorial High School''' was a private, Roman Catholic high school in Independence, Missouri. It was located in the Roman Catholic Diocese of Kansas City-Saint Joseph. Due to declining enrollment, the diocese announced the school would close at the end of the 2012&ndash;13 school year.\nThe team mascot of the school was the Trojan and the school colors were white and royal blue.\nHistory\nSt. Mary's Bundschu Memorial High School was established in 1853, making it one of earliest-established high schools west of the Mississippi River.\nBefore closing, St. Mary's had shifting sports rivalries. For at least 20 years, St. Mary's main sports rival was St. Pius X High School; that rivalry ended when St. Mary's expanded its enrollment. Another rival was Grain Valley High School; it ended when St. Mary's enrollment fell to 200 students. In 2010, Van Horn High School, joined the Independence School District and became a member of the Crossroads Conference. The two schools first met on the football field in September 2010 for the St. Mary's homecoming football game.\nEarly in 2012, the diocese announced the acquisition of an  tract of land in western Lee's Summit for the site of a new $30 million Catholic high school.  The acquisition was part of plan to replace both St. Mary's and Archbishop O'Hara High School. The new school, St. Michael the Archangel High School, opened in 2017.\nStudent life\nIn 2013, there were about one hundred students attending Saint Mary's. Students participate in Food For Thought (food drive) in the fall and the spring. Students also celebrated Homecoming and Courtwarming weeks with dress-up and spirit days.\nStudents participated in extracurricular activities such as Art Club, Pro-Life Club, National Honor Society, Spanish Club, Academic Team, Student Council, Science Club, Spirit Club and others.\nElectives included art classes such as pottery, mixed media, Art 2, and drawing; music and Cantori (choir); creative writing, newspaper, yearbook, office development, introduction to business, and others.\nSaint Mary's was in the Crossroads Conference. Students participated in football, volleyball, basketball (boys and girls), baseball, wrestling, soccer, cross country, and track and field.\nUniforms\nStudents were required to wear uniforms. Girls could wear navy, white, or maroon polos with a khaki, navy, gray plaid, or red and blue plaid skirt. Boys could wear navy, white, or maroon polos with khaki or navy pants or shorts. Girls were also allowed to wear pants and shorts.\nExternal links\n* [http://stmhs.org/ School website]\nNotes and references"
    }
  ]
}