{
  "content": [
    {
      "type": "text",
      "text": "# St. Thomas (electoral ward)\n\n| party1      = Labour\n|councillor2 = Hayley Gwilliam | party2      = Labour\n| population     = 7,187\n| population_ref = (2011 census)\n| area_total_km2 = 5.91\n| area_footnotes =\n| hide_services = yes\n}}\nSt. Thomas is an electoral ward of Swansea, Wales.\nThe electoral ward of St. Thomas consists of the following areas: Dan-y-graig, Port Tennant, St. Thomas, Kilvey Hill and the Grenfell Park Area, in the parliamentary constituency of Swansea East.  The ward is bounded by Neath Port Talbot to the east; Waterfront to the south; Bonymaen to the north; and Castle and Landore to the east.  The River Tawe forms part of the border between St. Thomas and the Castle ward.\nThe northern part of the ward is dominated by Kilvey Hill.  A residential belt lies in the central part of the ward.\nThe suburb of St. Thomas is a residential area located immediately east of Swansea city centre.  Port Tennant and Grenfell Park, further east of St. Thomas are small council estates comprising fairly run down housing stock.  Swansea's Fabian Way Park and Ride facility is located to the far east of the ward.\n2021 boundary review\nFollowing a decision in 2021 by the Local Democracy and Boundary Commission for Wales, the SA1 Swansea Waterfront and Swansea Docks areas were carved off from the St. Thomas ward, to become part of a new Waterfront ward. The change was effective from the 2022 local elections. All the same, St. Thomas retained two city councillors.\nLocal council elections\nFor the 2017 local council elections, the turnout in St. Thomas was 30.26%.  The results were:\n{| class=\"wikitable sortable\"\n!|Candidate\n!|Party\n!|Votes\n!|Status\n|-\n||Joe Hale ||Labour|| 1285 ||\n|-\n||Clive Lloyd ||Labour|| 1235||\n|-\n||Elizabeth Grace Thomas ||Conservative|| 253||\n|-\n||Owain James Thomas||Conservative|| 212||\n|-\n||Cliff Johnson ||UKIP || 151 ||\n|}\nReferences\nExternal links\n*[https://web.archive.org/web/20070930015043/http://www.swansea.gov.uk/media/pdf/st.%20thomas.pdf St. Thomas ward info]"
    }
  ]
}