{
  "content": [
    {
      "type": "text",
      "text": "# St. Bernward's Church, Hildesheim\n\n'''St. Bernward's Church' is a Catholic church in the city of Hildesheim in Lower Saxony, Germany. The name refers to the bishop Bernward of Hildesheim (960-1022) who was canonized by Pope Celestine III.\nHistory\nThe church was built by the architect Richard Herzig   from Hanover in 1905–1907, in a Romanesque Revival style. From 1895–1913, Herzig built 43 churches of this style in the diocese of Hildesheim. When St. Bernward's Church was built, the Romanesque westwork of St. Andrew's Church, Hildesheim and the Cathedral of Hildesheim served as examples. The church was consecrated by bishop Adolf Bertram on 3 November 1907.\nDuring World War II, St. Bernward's Church was heavily damaged by bombs on 22 February 1945 The windows were destroyed, the vault and the roof collapsed. The building could no longer be used for services. Then on 22 March 1945 the church was completely destroyed by incendiary bombs. Only a part of the tower and some walls remained standing.\nThe reconstruction was started as early as November 1948. When it was completed, St. Bernward's Church, the first destroyed church of Hildesheim to be rebuilt, was consecrated by bishop Joseph Godehard Machens in 1949.\nDescription\nSt. Bernward's Church is a basilica consisting of three naves, but unlike the other churches in Hildesheim, its apse and the altar are in the north of the building. The church facades to the south. The tower, which looks very similar to the tower of the Cathedral, is placed at the southern end.\nSt. Bernward's Church houses several sightworthy pieces of art. The Gothic retable showing various saints and the Coronation of the Virgin dates from 1430. It originally stood in Trinitatishospital, a hospital which was founded in 1230 and destroyed in 1945. There is also a remarkable statue representing Saint Bernward holding a Bernward Cross in his hand. The golden Bernward Cross which was made about 1130 is one of the most famous items in the museum of the Cathedral of Hildesheim.\nReferences"
    }
  ]
}