{
  "content": [
    {
      "type": "text",
      "text": "# St Andrew-by-the-Wardrobe\n\n| chaplain         =\n| vicar            =\n| deacon           =\n| abbot            =\n| minister         =\n| seniorpastor     =\n| pastor           =\n| location         = London,\n| country          = England\n| website          = https://www.standrewbythewardrobe.org/\n}}\nSt Andrew-by-the-Wardrobe is a Church of England church located on Queen Victoria Street, London in the City of London, near Blackfriars station. It is also the London headquarters for the Coptic Orthodox Church and the Coptic Orthodox Archbishop of London, Archbishop Anba Angaelos, as part of a church-sharing arrangement.\nHistory\nFirst mentioned around 1170, St Andrew-by-the-Wardrobe was almost certainly founded considerably earlier. During the 13th century the church was a part of Baynard's Castle, an ancient royal residence.  In 1361, Edward III moved his Royal Wardrobe (a storehouse for Royal accoutrements, housing arms and clothing among other personal items of the Crown) from the Tower of London to just north of the church. It was from this association that the church acquired its unique name.\nThe Wardrobe and the church, however, were both lost in the Great Fire of London in 1666. Of the 51 churches designed by Sir Christopher Wren after the Great Fire, St Andrew-by-the-Wardrobe is among the simplest of his designs; it was erected in 1695.\nThe church was again gutted during the London blitz by German bombing; only the tower and walls survived. It was rebuilt and rededicated in 1961.\nPresent day\nAs the parish of St Andrew-by-the-Wardrobe rejects the ordination of women, it receives alternative episcopal oversight from the Bishop of Fulham (currently Jonathan Baker).\nAdvowson\nThe advowson of St Andrew's was anciently held by the family of FitzWalter to which it probably came from the holding by Robert Fitzwalter (d.1235) of the office of Constable of Baynard's Castle. In 1417 it was held by Thomas de Berkeley, 5th Baron Berkeley (d.1417), as his charter dated 24 June 1417 appointing feoffees to his estate records. Berkeley's Inn, the town house of that family stood nearby, at the south end of Adle Street, against Puddle Wharf, as reported by John Stow in his \"Survey of London\" (1598)\nBuilding\nSt Andrew's is situated on a terrace overlooking the street, its plain red-brick exterior contrasting with the stone buildings on either side. The interior is aisled, with arcaded bays supported by piers rather than the usual columns. The original interior fittings were mostly destroyed during the war, and many of the church's features were procured from other destroyed Wren churches. The weathervane on the steeple comes from St Michael Bassishaw (which was demolished in 1900). A replacement pulpit came from the church of St Matthew, Friday Street. The font and cover also came from here. The royal arms, of the House of Stuart, came from St Olave Old Jewry (demolished, except for its tower, in 1887). There is a figure of St Andrew, dated around 1600, which stands on the north side of the sanctuary and an unusual figure of Saint Anne who is shown holding the Virgin Mary who in turn holds the Christ child. This statue, which is probably north Italian, dates to around 1500.\nWilliam Shakespeare was a member of this parish for about fifteen years while he was working at the Blackfriars Theatre nearby, and later he bought a house within the parish, in Ireland Yard. In his honour, a memorial was erected in the church.\nRegular Sunday services are conducted there by the St Gregorios congregation of the Indian Orthodox Church.\nThe church was designated a Grade I listed building on 4 January 1950.\nNotable clergy\n* Guy Treweek (husband of Rachel Treweek, the first female diocesan bishop in the Church of England), was priest-in-charge from 2011 to 2015\n* Luke Miller; rector since 2016, priest-in-charge from 2015 to 2016\nSee also\nSt Andrew-by-the-Wardrobe Interior\n* List of churches and cathedrals of London\n* List of Christopher Wren churches in London\nNotes\nExternal links\n*\n* [http://www.multimap.com/map/browse.cgi?client=public&db=pc&addr1=&client=public&addr2=&advanced=&addr3=&pc=EC4V5DE&quicksearch=EC4V+5DE&cidr_client=none Location map] (Multimap.com)\n* [http://in360degrees.co.uk/wrenchurches/data/001StAndrewWardrobe/  360° panorama inside St Andrew-by-the-Wardrobe]"
    }
  ]
}