{
  "content": [
    {
      "type": "text",
      "text": "# St Barnabas Church, Warrington\n\n| country                = New Zealand\n| denomination           = Anglican\n| membership             =\n| attendance             =\n| address                = 266 Coast Road, Warrington, Otago\n| website                =\n| status                 = Church\n| founded date           =\n| founder                =\n| dedication             = Saint Barnabas\n| dedicated date         = 11 November 1872\n| consecrated date       =\n| architect              =\n| architectural type     =\n| style                  =\n| years built            =\n| groundbreaking         =\n| completed date         =\n| construction cost      =\n| closed date            =\n| demolished date        =\n| capacity               =\n| length                 =\n| length nave            =\n| length choir           =\n| width                  =\n| width nave             =\n| width transepts        =\n| height                 =\n| height nave            =\n| height choir           =\n| floor count            =\n| floor area             =\n| spire height           =\n| materials              = Timber\n| parish                 =\n| archdeaconry           = Coastal Otago\n| diocese                = Dunedin\n| priestincharge         =\n| priest                 =\n| minister               =\n| seniorpastor           =\n| pastor                 =\n| chaplain               =\n| embedded    =\n}}\n'''St Barnabas' Church''' is a heritage listed Anglican church, located at 266 Coast Road, Warrington, Otago, New Zealand. The small wooden church was built in 1872.\nHistory\nAnglicans met at the Pitt residence in Warrington until Mrs Pitt donated  of land for a church. The building was built by Benjamin Smith, opening on 11 November 1872.\nThe church building and its community are named after St Barnabas, one of the first prophets and teachers of the Christian Church at Antioch. In 2018, St Barnabas' Church was in the Archdeaconry of Coastal Otago, part of the Anglican Diocese of Dunedin.\nBuilding\nThe church is set in woodland and is surrounded by a cemetery. Otago's first Anglican Bishop, Samuel Tarratt Nevill was buried here in 1921. A traditional lych gate marks the entrance from Coast Road. The church is built in board and batten with a wooden shingle roof and a small copper-tipped tower, fitted with a bell inside. The stained glass windows are unusually elaborate for such a small building. They depict among others St. Joan of Arc and Christ the Redeemer. They have been said to have been ordered for a Roman Catholic church in Brisbane but diverted to Dunedin following a waterfront dispute. However recent research has found this to be mythical, and the real story of their original destination is even more complicated and interesting.  The building is listed as a Category II Historic Place.\nGallery\nSt Barnabas west.jpg|German stained-glass windows at the 'west' end of the church\nstbarnint.jpg|Wooden interior of St Barnabas Church\nReferences\nFurther reading\n*\nExternal links\n*"
    }
  ]
}