{
  "content": [
    {
      "type": "text",
      "text": "# St Botolph's Church, Wardley\n\n| osgraw = SK 831 002| denomination = Anglican | churchmanship = | membership = | attendance = | website = [https://www.visitchurches.org.uk/visit/church-listing/st-botolph-wardley.html Churches Conservation Trust] | former name = | bull date = | founded date = | founder = | dedication = | dedicated date = | consecrated date = | cult = | relics = | events = | past bishop = | people = | status = Former parish church| functional status = Redundant| heritage designation = Grade II*| designated date = 10 November 1955 | architect = | architectural type = Church| style = Gothic | groundbreaking = 12th century | completed date =  | construction cost = | closed date = | demolished date = | capacity = | length = | width = | width nave = | height = | diameter = | other dimensions = | floor count = | floor area = | spire quantity = | spire height = | materials = Stone, Collyweston roof }}\n'''St Botolph's Church, Wardley''' is a redundant Anglican church in the small village of Wardley, Rutland, England.  It is recorded in the National Heritage List for England as a Grade&nbsp;II* listed building, and is under the care of the Churches Conservation Trust.\nHistory\nThe advowson was granted to Launde Priory by Richard Basset in the early 12th century. The church was built in the 12th century with the tower and spire built in the 14th century and clerestory being added in the 15th. A Victorian restoration in the 1870s included the rebuilding of the chancel.\nWardley's parish church was dedicated to the Anglo-Saxon Saint Botolph, patron saint of travellers. It stands on its raised churchyard above this hamlet in Rutland, south of the A47 and close to the border with Leicestershire. St Peter's Church in Allexton, the nearest village in Leicestershire, is also in the care of the CCT.\nAn inspection of the fabric of the building in 2000 identified serious defects in parts of the stonework. Public fundraising enabled work to be carried out and the church was rededicated in 2004.\nThe church was closed for regular worship in June 2010 and vested into the care of the Churches Conservation Trust in April 2016. The CCT undertook a significant programme of conservation work, including the re-roofing of the chancel with Collyweston slates, timber repairs and re-glazing. The church re-opened in December 2017.\nArchitecture\nThe church consists of a nave (without aisles), a chancel, a west tower with spire and a south porch. The oldest features of the church are the doorways, with the moulded south doorway with waterleaf carving on its capitals, dating c.1175 and enclosed in a 14th-century porch. The tower and broach spire date from the 14th century, while the chancel was rebuilt in 1871. Inside are clear glazing and whitewashed walls. The pointed tower arch to the west, with its carved mask corbels, is likely to be 14th century, while the simple oak nave roof is 15th century. Stone flags in the nave give way to Victorian encaustic tiles in the chancel. The three-stage tower is supported by buttresses and contains two bells.\nInside the church it retains a 19th-century barrel organ made by Bates of Ludgate Hill in London. The octagonal font is dated 1797. A parish chest contains parish documents from 1743 until the 20th century. The piscina is from the 13th century.\nSee also\n*Grade II* listed buildings in Rutland\n*List of churches preserved by the Churches Conservation Trust in the English Midlands\nReferences\nExternal links"
    }
  ]
}