{
  "content": [
    {
      "type": "text",
      "text": "# St Christopher's Chapel, Queensland\n\n| location = St Christopher's Chapel Road, Nerimbera, Shire of Livingstone, Queensland, Australia\n| beginning_label = Design period\n| beginning_date = 1939–1945 (World War II)\n| built = 1943–1959\n| built_for =\n| demolished =\n| architect =\n| architecture =\n| owner =\n| designation1 = Queensland Heritage Register\n| designation1_offname = St Christopher's Chapel\n| designation1_type = state heritage (built)\n| designation1_date = 21 October 1992\n| delisted1_date =\n| designation1_partof =\n| designation1_number = 600660\n| designation1_free1name = Significant period\n| designation1_free1value = 1943–45 (historical)\n| designation1_free2name = Significant components\n| designation1_free2value = memorial/monument, memorial – gate/s, fence/wall – perimeter, furniture/fittings, chapel\n| designation1_free3name = Builders\n| designation1_free3value =\n}}\n'''St Christopher's Chapel''' is a heritage-listed chapel at St Christopher's Chapel Road, Nerimbera, Shire of Livingstone, Queensland, Australia. It was built from 1943 to 1959. It was added to the Queensland Heritage Register on 21 October 1992.\nHistory\nSt Christopher's Chapel at Nerimbera was erected in 1943 by the American 542 Engineers, Ship and Shore Battalion. The timber and stone chapel was built on Harbour Board land made available to the U.S. Army by the Queensland Government. It reflects the presence of American troops in Queensland during the Second World War and stands as the only structure of its kind in Australia.\nThe area around the chapel had been used as a convalescent camp for American troops based around Rockhampton, and other U.S. units which had been sent to Rockhampton to rest after combat operations in the Pacific islands. During the peak time of American occupation more than 70 000 American soldiers from the 24th, 32nd and 41st U.S. Army combat divisions, and One Army Corps - \"1 Corps\", were stationed in the Rockhampton area.\nIn 1943 several army chaplains recognised the need for a non-denominational chapel, and approached the Corps Commander for assistance. The 542 Engineers Ship and Shore were given the task of constructing the chapel under the supervision of the chaplains. The timber roof trusses and the stones used in construction were collected from the surrounding area. When the work was completed late in 1943, the four chaplains (two Protestant, one Roman Catholic and one Jewish Rabbi) consecrated the chapel as a place of divine worship where non-denominational services could be held.\nAfter the United States troops left in February 1944 there was a gradual deterioration in the building until Henry Beak, whose grazing property adjoined the chapel, began to take care of it in July 1947. From mid 1955 the Livingstone Shire and Rockhampton City Councils assumed responsibility for the chapel.\nIn 1958, Master Sergeant Jack Bauman, U.S. Army, returned to Rockhampton and attempted to raise funds for the restoration of the chapel. Jack Bauman died before funds were raised but the 41st Division in America forwarded $130 to the American 41st Division Association in Rockhampton to paint the chapel. An octagonal band rotunda was erected in honour of Master Sergeant Bauman adjacent to the chapel.\nIn 1959 vandals destroyed a number of articles in the chapel which precipitated the formation of a committee and the appointment of trustees from the R.S.S.A.I.L.A. and the 41st Division Association to preserve and maintain the chapel. The committee established an annual service held on the Sunday closest to 4 July, American Independence Day.\nDuring the time the committee looked after the chapel the memorial fence was erected with each donor's name engraved on a stainless steel panel. The lower gates were donated by the R.S.S.A.I.L.A. Rockhampton Branch and the main gates were a gift from Henry Beak. The signs commemorating athletic events, which are located around the sides of the chapel, are mementos collected from a sports oval which was located near the chapel and used by the troops during their occupation. These signs were placed in the chapel by Henry Beak.\nIn 1986 the committee dissolved, at which time the R.S.L. was approached to be the new caretakers for the chapel. The chapel is now under the authority of the Livingstone Shire Council and is a public place.\nDescription\nSt Christopher's Chapel is located fronting St Christopher's Chapel Road, Nerimbera, to the southeast of Rockhampton. The site is located on the southeastern side of low hill, and the entrance to the chapel faces in an easterly direction.\nThe single storeyed open-sided chapel has a concrete base, and is constructed of undressed timber posts and beams supporting king post trusses with struts and a ribbed metal gable roof. The chapel is open at the front and to both sides, with a low random rubble stone wall to the perimeter. The low stone wall has a central opening at the front, and returns either side of concrete steps which provide access to the chapel from the entrance path. The gable end has fibrous cement sheeting with timber battens, and a cross of undressed timber at the apex. The entrance is flanked by two marble plaques; the southern plaque commemorates the maintenance of the chapel by the Returned Services League of Australia, and the northern plaque commemorates the erection of the chapel in 1943 by the United States 542nd Special Engineer Regiment.\nThe rear of the structure has a raised platform separated from the body of the chapel by timber altar rails. A random rubble stone wall to the underside of the roof trusses creates a recessed central altar with a door to either side accessing rear side rooms. The altar has a central rose window consisting of coloured glass in a fretwork frame, below which is a large shelf surmounting a marble cross set in the stone wall. A free-standing random rubble pulpit is located at the southern side of the altar. The rear side rooms are enclosed with fibrous cement sheeting, and each has a sash window at the rear and a door opening onto a recessed porch behind the altar. The northern room contains a commemorative plaque fixed to the side wall.\nThe chapel has a wide centre aisle with timber pews to either side. The struts to alternate roof trusses have been painted in red, white and blue, and the Australian and American coat of arms are depicted on panels fixed to the roof truss above the altar rails. Timber planks displaying American servicemen's athletic records have been attached to the upper section of both sides of the chapel.\nAn octagonal band rotunda is located on the northern side of the chapel. This structure has a concrete and random rubble stone base, and is constructed of undressed timber posts and rafters, with sawn cross members, supporting a pitched ribbed metal roof. The rotunda is open to each side, with concrete steps providing access from the eastern side. A low timber bench seat is located around the perimeter, and timber pews have been placed in the rotunda facing the adjacent chapel altar. A stone plaque fixed to the stone base commemorates the erection of the rotunda.\nThe entrance to the chapel is via commemorative metal gates and arch, with the name SAINT CHRISTOPHERS CHAPEL outlined in large metal lettering, fronting a parking area off St Christopher's Chapel Road. Similar gates are located at the southern end of the site. The entrance path is lined by a number of commemorative plaques fixed to stone cairns, and garden beds with stone borders are located adjacent. The site also includes many trees scattered around the vicinity of the chapel.\nHeritage listing\nSt Christopher's Chapel was listed on the Queensland Heritage Register on 21 October 1992 having satisfied the following criteria.\n'''The place is important in demonstrating the evolution or pattern of Queensland's history.'''\nSt Christopher's Chapel, erected in 1943, reflects the presence of American troops in Queensland during the Second World War. The area surrounding Rockhampton had sustained around 70 000 US soldiers who were fighting in the Pacific, and this non-denominational chapel was constructed to service the religious needs of those troops.\n'''The place demonstrates rare, uncommon or endangered aspects of Queensland's cultural heritage.\nAs the only structure of its kind in Queensland and Australia, the chapel is a rare and unique testament to the American presence throughout Australia.\nThe place is important because of its aesthetic significance.'''\nSt Christopher's Chapel is of aesthetic significance as a rustic open-air structure constructed of local natural materials, and the place makes a considerable aesthetic contribution to the surrounding landscape.\nThe place has a strong or special association with a particular community or cultural group for social, cultural or spiritual reasons.\nIt has special association with the American troops who used the chapel as a place of worship whilst resting or convalescing in Rockhampton.\nThe chapel has special association for the people of the surrounding communities as a local landmark and a place for worship and ceremony.\n'''The place has a special association with the life or work of a particular person, group or organisation of importance in Queensland's history.'''\nThe chapel is also a rare surviving example of the presence of American servicemen during the Second World War.\nReferences\nAttribution"
    }
  ]
}