{
  "content": [
    {
      "type": "text",
      "text": "# St Edward's Church, Kempley\n\n| osgraw                 =\n| osgridref              =\n| location               =\n| country                = England\n| denomination           = Church of England\n| previous denomination  =\n| churchmanship          = Broad Church\n| membership             =\n| attendance             =\n| website                =\n| former name            =\n| bull date              =\n| founded date           =\n| founder                =\n| dedication             =\n| dedicated date         =\n| consecrated date       =\n| cult                   =\n| relics                 =\n| events                 =\n| past bishop            =\n| people                 =\n| status                 = Active\n| functional status      = Parish church\n| heritage designation   = Grade II* listed\n| designated date        =\n| architect              =\n| architectural type     =\n| style                  =\n| years built            =\n| groundbreaking         =\n| completed date         =\n| construction cost      =\n| closed date            =\n| demolished date        =\n| capacity               =\n| length                 =\n| width                  =\n| width nave             =\n| height                 =\n| diameter               =\n| other dimensions       =\n| floor count            =\n| floor area             =\n| spire quantity         =\n| spire height           =\n| materials              =\n| bells                  =\n| bells hung             =\n| bell weight            =\n| parish                 = Kempley\n| deanery                = North Cotswold\n| archdeaconry           = Archdeaconry of Cheltenham\n| episcopalarea          =\n| diocese                = Diocese of Gloucester\n| province               =\n| bishop                 =\n| rector                 =\n| vicar                  =\n| priestincharge         =\n| priest                 =\n| asstpriest             =\n| honpriest              =\n| curate                 =\n| asstcurate             =\n| nonstipendiaryminister =\n| deacon                 =\n| reader                 =\n| student intern         =\n| organistdom            =\n| director               =\n| organist               =\n| organscholar           =\n| chapterclerk           =\n| laychapter             =\n| warden                 =\n}}\nThe Church of St Edward the Confessor in Kempley is a Church of England parish church in the Forest of Dean district of Gloucestershire, England, close to the border with Herefordshire.\nHistory\nThe church was built to the design of Randall Wells (1903-4) and is Grade II* listed. St Edward's was described by John Betjeman as \"a mini-cathedral of the Arts and Crafts movement\".\nThe church, dedicated to Edward the Confessor, was built as a chapel of ease by the Lord of the Manor and major landowner, William Lygon, 7th Earl Beauchamp, because St Mary's Church, Kempley was too far away from the main centres of population in the parish and liable to flooding. St Edward's became the parish church in 1975 following the redundancy of St Mary's.\nWells had acted as William Lethaby's resident architect at All Saints' Church, Brockhampton-by-Ross, (1901–02) where Lethaby's experimentation with the employment of direct labour under a site architect instead of a contractor under a formal building contract, and deliberately produced few drawings, gave Wells freedom to evolve the design as the building rose and to engage in the physical activity of building.\nSome of the foundations had already been put in before Wells was asked to design a church to fit upon them as nearly as possible, fulfilling requirements of Lord Beauchamp that there should be no east window, that most of the lighting should be from the west end and that the eaves should be kept low.\nThe small village of Kempley has two notable Anglican churches, the other, older, is dedicated to St Mary and is Grade I.\nExterior\nThe church was built from local materials by local labour. The red sandstone used was from the Forest of Dean quarries, about seven miles distant. The roof timbers were of unseasoned oak, cut on the Beauchamp estate. The church was roofed with local stone slates which remain on the lych gate; the church now has pantiles.\nInterior\nThe church has three sculpted stone reliefs designed by Wells: above the entrance Christ carved by Wells and a local carpenter Walter James; within the porch, a Virgin and Child by Laurence Turner; and on the East wall, the Crucifixion, again by James.\nThe rood, carved by David Gibb, originally from Glasgow and said to have been the last ship's figurehead carver in London, was painted by Wells and his brother Linley, through whom Wells had obtained the commission. The seating, the prayer desk, the rails and the altar were designed by the architect and made in English oak by Peter Waals at the Daneway Workshop, Sapperton, during the partnership of Ernest Gimson and Ernest Barnsley. The lectern was designed by Barnsley, the candelabra and a pair of iron candlesticks were made by Alfred Bucknell, supplied by Gimson, with other ironwork by the Kempley village blacksmith, George Smallman.\nThe parochial church council launched an appeal in March 2011 to raise £110,000 for repairs.\nReferences\nExternal links\n* [https://daffs.org.uk/stedwardschurch.html St Edward's Church] at daffs.org.uk\n* [https://churchdb.gukutils.org.uk/GLS710.php St Edward the Confessor's Church, Kempley] at churchdb.gukutils.org.uk\n* [http://db.theclergydatabase.org.uk/jsp/locations/DisplayLocation.jsp?locKey=9402 Parish (Church): Kempley] - list of clergy from before 1548 – 1822, at theclergydatabase.org.uk\nGallery\nFile:Kempley Church \"Jam Tart\" Window - geograph.org.uk - 550565.jpg|West window\nFile:Detail from St Edwards Church, Kempley - geograph.org.uk - 57966.jpg|Crucifixion relief on the east wall\nFile:Kempley church - geograph.org.uk - 957447.jpg|The rood\nFile:St. Edward the Confessor's church, Kempley - geograph.org.uk - 990144.jpg|St Edward's from the southeast\nFile:Church of St. Edward the Confessor, Kempley - geograph.org.uk - 730758.jpg|Through the lychgate\nFile:Kempley church - geograph.org.uk - 957365.jpg|The Christ above the entrance"
    }
  ]
}