{
  "content": [
    {
      "type": "text",
      "text": "# St Edward the Confessor Catholic Church, Romford\n\n| osgridref              =\n| location               = Romford\n| country                = England\n| denomination           = Catholic\n| website                = [https://www.stedwards-romford.org.uk/ StEdwards-Romford.org.uk]\n| former name            =\n| bull date              =\n| status                 = Parish church\n| founded date           = 1854\n| founder                = Baron William Petre\n| dedication             = Edward the Confessor\n| dedicated date         = May 1856\n| consecrated date       =\n| cult                   =\n| relics                 =\n| events                 =\n| past bishop            =\n| people                 =\n| functional status      = Active\n| heritage designation   = Grade II listed\n| designated date        = 23 February 2010\n| architect              = Daniel Cubitt Nichols\n| architectural type     =\n| style                  = Gothic Revival\n| years built            =\n| groundbreaking         =\n| completed date         = May 1856\n| construction cost      = £2,000\n| parish                 = Romford\n| deanery                = Havering\n| diocese            = Brentwood\n| province               = Westminster\n}}\nSt Edward the Confessor Church is a Catholic Parish church in Romford, Borough of Havering, London. It was built in 1856 in the Gothic Revival style. It was paid for by the William Petre, 12th Baron Petre and designed by Daniel Cubitt Nichols. It is located in the town centre on St Edward's Way, next to Romford Town Hall and Romford Central Library. It is a Grade II listed building and according to Historic England its design and architecture is reminiscent of Augustus Pugin.\nHistory\nFoundation\nBefore 1848, Catholics in Romford had to travel to St Mary Moorfields for Mass. From 1848, a priest would travel to Romford to minister to the Catholics there. That year, Mass was celebrated in a house in Romford, in a cottage on Church Lane. In 1852, a temporary church building was on the current site of the church. In 1854, a mission was started in Romford, with a priest being resident in the town. From the start of that mission, plans were drawn up for a permanent church to be built there.\nConstruction\nConstruction on the church finished in 1856. On 6 May 1856, the church was opened and dedicated by Cardinal Wiseman, the first Archbishop of Westminster. The land on which the church stands was donated by William Petre, 12th Baron Petre. The Petre were long-time supporters of the Catholic Church in England. William Petre also paid for the construction of Brentwood Cathedral. Of his twelve children, one became a priest and three became religious sisters. Baron Petre also paid for the building's construction, coming to £1,800, which, with the cost of the land, came to a total of £2,000. The church was designed by Daniel Cubitt Nichols. He also designed Holy Family Church in Witham, and the Clock Tower Of Little Ellingham Hall. The interior of the church was furnished by donation from Agnes Clifford, the sister of Baron Petre and wife of Charles Clifford, 8th Baron Clifford of Chudleigh. She donated the main altar, the reredos, various statues and stained-glass windows. The statues were made by Richard Lockwood Boulton, and the stained-glass windows by Hardman & Co. The church was dedicated to Edward the Confessor, because his summer house was located in nearby Havering-atte-Bower.\nParish\nIn 1918, the church was given its own parish. There is a parish centre. From 1890 to 1891, a small school was built. It closed in 1961, and the site became a social club and then the parish centre. The church is open from 8:30 am to 4:00 pm, Monday to Friday and it has three Sunday Masses at 6:30 pm on Saturday and at 9:30 am and 11:30 am on Sunday.\nSee also\n* Diocese of Brentwood\n* St Edward the Confessor Anglican Church, Romford\nReferences\nExternal links\n*"
    }
  ]
}