{
  "content": [
    {
      "type": "text",
      "text": "# St Olave's Church, Southwark\n\n, 1756]]\n'''St Olave's Church, Southwark''' was a church in Southwark, England which is believed to be mentioned in the Domesday Book of 1086. It was located on Tooley Street which is named after the church, i.e. 't'olous'. It became redundant in 1926 and was demolished. It is now the location of St Olaf House, which houses part of the London Bridge Hospital.\nDedication\nThe church was dedicated to Olav Haraldsson, an early King of Norway, who attempted to convert his people to Christianity and was martyred in 1030. Before this, in 1014, he was a prince and an ‘ally’ (i.e. mercenary) of King Æthelred the Unready, fighting the Danes. While they were occupying the wooden London Bridge, Olav is said to have tied his long-boats to the bridge supports and pulled it down. The church’s probable beginning is as a private chapel of Godwin, Earl of Wessex from at least 1018, and his Southwark interest was probably contemporary to this. He would probably have known Olav personally, so the dedication was quite apposite.\nWhatever the veracity of the story of London Bridge, Olav became a popular saint in England, and five churches in the City of London were dedicated to him, apart from the church at Southwark.\nDomesday Book\nSt Olave’s is presumed to be the church mentioned in the Southwark Domesday Book entry, from which it appears that it had royal patronage before the Norman Conquest of England in 1066.\nThe Domesday entry for Southwark has the following three statements relating to the interests of Odo, Bishop of Bayeux and Earl of Kent:\n*Qui ecclesiam habebat de rege tenebat. ‘[He] who had the church held [it] from the king’. This statement is suspiciously vague as to who ‘had’ the church and just which ‘king’ is being referred to. The royal connection was probably that of Godwin’s eldest son who succeeded to his Earldom, Harold II, the last Anglo-Saxon king of England.\n*Episcopus autem dedit aecclesiam & fluctum primum Adeloldo deinde Radulfo pro excambio unius domus. ‘The bishop gave the church & the tidal-stream at first to Adelold, then to Ralph in exchange for a house’. The ‘tidal stream’ is likely to have been the later ‘Watergate’ the small dock next to St Olave’s which was probably its endowment; this dock was progressively filled in from south-end to shore, effectively disappearing by 1747, although a ‘stairs’/ landing place survived well into the next century. However, there is no confirmation in Domesday that Odo had any legal interest in the church at all, for neither of the terms for ownership i.e. ‘has’/ habet or ‘holds’/ tenet are used.\n*This gives special weight to the third statement: Vicecomes quoque negat se preceptum uel sigillum regis de hac re unquam percepisse. ‘The sheriff also denies that he had ever received the king’s precept or seal concerning this matter’. This confirms the ‘king’s’ interest in the church and calls into question Odo’s action.\nBishop Odo, William the Conqueror’s half-brother who seems to have succeeded to the Godwin interest, had attempted to let out the church but he should have sought the king’s authority to do so. The earliest priests of the church were named Adelold (Athelwold) and then Ralph before 1086. The church is first mentioned by name in 1096 in relation to its priest ‘Peter de St Olavo’ being party to a land transaction involving Bermondsey Priory.\nEarly Medieval Period\n, formerly stood in the church. It bears the Bridge Mark (blue logo on right-hand side) of the Bridge House which was nearby.]]\nSometime between 1090 and 1121 the Warennes (successors to Odo) had given the church and neighbouring property to Lewes Priory. Although situated next to the old London Bridge, its parish took in the north-east end of the High Street and stretched out along to the east and to the south where it was limited by Bermondsey parish.\nThe Norman stone church, which replaced a Saxon structure which may have been built of timber, was so close to the river that when a terrible flood affected the banks of the Thames in 1327 it was reported that the water had damaged the church walls and washed away bodies from the churchyard.\nStuart and Georgian era\nPart of the Norman building collapsed through a combination of age, neglect, and river subsidence, in 1736. In 1737 this was replaced by a new church designed by Henry Flitcroft and built by Master Mason John Deval, which in turn was severely damaged in a major fire in Tooley Street in 1843. Sculptural work was by Christopher Horsnaile and John Deval.\nHenry Gauntlett was the church's organist from 1827 to 1846 and during those years designed a grand new organ which replaced an older one.\nThe civil parishes of Southwark St Olave, Southwark St John Horsleydown, and Southwark St Thomas, were administered by the St Olave District Board of Works from 1855. The parish also gave its name to the ''St Olave's Poor Law Union'' which included the parishes of Bermondsey and Rotherhithe, and in 1900 this combination became the Metropolitan Borough of Bermondsey.\nNotable people connected with the church\n*Paul Bayning, 1st Viscount Bayning, was baptized here in 1588\n*Thomas Bennet (1673–1728), lecturer\n*Reasonable Blackman (fl. 1579-1592), silk weaver, baptised one or two of his children at St Olave's\n* William Collier (colonist) of Plymouth Colony\n*William Cooper (1650s and 1660s), Puritan minister\n*Sarah Coysh (c. 1742–1801), heiress\n*Henry Gauntlett, organist at St Olave's, 1827 to 1846\n*Peter Monamy (1681–1749), painter\n*Ralph Venning (c. 1621–1674), lecturer\n*Sarah Walker Warren (1622–1700), daughter-in law of Richard Warren, Mayflower passenger. She married Nathaniel Warren, his son. Their daughter Mercy married into the Delano family: Lt Jonathan Delano was the son of Philippe de la Noye / Delano who arrived with Leiden Huguenot Separatists on the Mayflower's companion ship the Fortune. Her many notable descendants include Franklin Delano Roosevelt.\nDepopulation of the parish, redundancy and demolition of the church\nThe church was restored and was very much a Docklands church, but as the industrial expansion of the area led to population decline, so the church became less used. In 1926 it was declared redundant and the nave was demolished, leaving a forlorn tower, removed in 1928, when its capping turret was relocated to Tanner Street Park, Southwark, where it was converted into a drinking fountain. This still stands in the Park and in 1998 was designated by English Heritage as a Grade II listed structure.\nThe site of the church was sold and redeveloped with an Art Deco office building which became the headquarters of the Hay’s Wharf Company. This still stands on Lower Tooley Street and is now called St Olaf House; it bears a plaque giving information on the demolished St Olave's Church and its patron saint.\nLegacy\nThe parish church was the originator of St Olave's Grammar School for boys, in 1896 renamed the St Olave's and St Saviour's Grammar School, and from 1902 its foundation also funded the St Saviour's and St Olave's Church of England School for girls. A separate St Olave's Foundation Fund still supports local youth's educational and vocational aspirations through grants.\nThe St Olave's United Charities parochial foundation, based in nearby Druid Street, is one of the best endowed of the Southwark parish charities, providing for local poor and elderly. The endowment was supplemented until the mid-1990s by a 'parish rate' over the area.\nReferences"
    }
  ]
}