{
  "content": [
    {
      "type": "text",
      "text": "# St Philip Howard Catholic High School\n\n|mapframe-zoom =11\n| motto = Fiat voluntas domini\n| established = 1959\n| closed =\n| type = Academy\n| trust =BOSCO CATHOLIC EDUCATION TRUST UID= 16631\n| religious_affiliation = Roman Catholic\n| president =\n| head_label = Headteacher\n| head = Timothy Hulse\n| r_head_label =\n| r_head =\n| chair_label = Chair of Governors\n| chair = Richard Meredith\n| founder =\n| specialist = Humanities College\n| address = Elm Grove South\n| city = Barnham\n| county = West Sussex\n| country = England\n| postcode = PO22 0EN\n| local_authority = West Sussex\n| ofsted = yes\n| urn = 144243\n| staff =\n| enrolment = 1247\n|capacity = 1033\n| gender = Coeducational\n| lower_age = 11\n| upper_age = 18\n| houses = 7\n| colours = Gold, Maroon, Black\n| publication =\n| free_label_1 =\n| free_1 =\n| free_label_2 =\n| free_2 =\n| free_label_3 =\n| free_3 =\n| website = http://www.sphcs.co.uk\n}}\nSt Philip Howard Catholic School is an Ofsted rated \"outstanding' secondary school for 11-18 year olds located between Chichester and Arundel, in the village of Barnham, West Sussex, England. It supports a strong Catholic ethos, although is open to pupils of all faiths. Since 2017 it has held 'Specialist Humanities College' and 'Teaching School' status. In 2016 the school became an academy member of the BOSCO Catholic education trust.\nDescription\nThe Headteacher is Mr Tim Hulse and the Chair of Governors is Mr R Meredith.  There are 1050 pupils on roll\nThe school serves a wide area that includes but is not limited to Chichester, Arundel, Worthing, Midhurst, Bognor Regis and parts of Littlehampton. It has a sixth form of roughly 250 students, which is open to all faiths. It offers a wide range of subjects to study at A-level.\nThe sixth form is open for application to both internal students (students that studied at SPH), and external candidates (students that received their secondary education elsewhere). The sixth form does not have a uniform policy, however students must wear their ID card visibly at all times; which they use to enter the front gate.\nAll pupils are educated in the context of the Catholic tradition. School Church services are held in the sports hall, along with Days of Reflection, (where children go to a church to pray). They offer many subjects for secondary students; English, German, French, Spanish, Science, Maths, Religious Education, Physical Education, Citizenship, History, Geography, Drama, Dance, Music, Art, Computer Science, Media, Creative i/Media, Business Studies, Food Tech, Wood Tech, Graphics, Computer Graphics and Textiles.\nThe school has 7 houses;\nSaint Bernadette's - Pink,\nSaint Cuthman's - Red,\nSaint Dunstan's - Green,\nSaint Edmund's - Orange,\nSaint Richard's - Blue,\nSaint Teresa's - Purple,\nSaint Wilfred's - Yellow\nPastoral\nThis is run on a heads of year system. Older pupils  work with the teachers to look after younger students and head off emotional issues before they become problems. Sixth formers are trained to act as learning assistants, and work with the staff in Key Stage 3 classes.\nSchool council\nThe school runs a school junior leadership team made up of 25 students with five students coming from each year group. Senior prefects are chosen in Year 11 and Head Girl and Head Boy are chosen in Year 13. This system is displayed as good practice to visiting head teachers from partnership schools in  Rwanda, Uganda and Ethiopia. Students and teachers share experiences with ES Kagogo\nAcademics\nKey Stage 4\nStudents are required to study a core of :\nEnglish Language & Literature (worth two GCSEs),\nMathematics (1 GCSE),\nPhysical Education (not assessed),\nReligious Studies (1 GCSE),\nCombined (Double) Science (two GCSEs).\nIn addition, students are required to study three other subjects.\nTen academic GCSEs is not a suitable programme for every student but it is achieved by many often scoring a 7 or 8 in each.\nStatutory requirements for Citizenship are covered.\nAcademic Performance\nIn 2018 the school was rated the highest in West Sussex against the new 'Attainment 8' Key GCSE subject scores per pupil, including English, Maths, Sciences and Humanities at the end of key stage 4. 1st out of 92 secondary schools.\nThe last (2016) Ofsted report rated the school as uniformly \"outstanding\" across all metrics and the school was also graded 'outstanding' in a Section 48 inspectorate for its Catholic ethos and Christian character.\nExtra Curricular\nThe school offers a variety of clubs and sports including Rugby, Hockey, Basketball, Netball and Football; as well as foreign language clubs, dance and musical theatre and a debating society. The school also offers 3 levels of the Duke of Edinburgh programme and has an orchestra and school band.\nLocal youth politics\nThe school participates in the elections for the UK Youth Parliament and the West Sussex Youth Cabinet every year in March, often fielding several candidates.\nReferences\n* Philip Howard, 20th Earl of Arundel St Philip Howard.Who the school is named after.\nExternal links\n* [https://www.sphcs.co.uk/downloads/our_school/ofsted_report_2016/ofsted_full_report_2016.pdf] Ofsted Report\n* [http://www.st-philiphoward.w-sussex.sch.uk School website]\n* [http://www.edubase.gov.uk/EstablishmentView.aspx?EstablishmentID=26073 EduBase]\nNews items\n* [https://www.bognor.co.uk/news/people/a-level-results-st-philip-howard-school-in-barnham-sees-stunning-success-1-9036164] A level Success at Philip Howard 2019\n* [https://www.bognor.co.uk/news/people/hard-work-pays-off-at-st-philip-howard-in-barnham-1-8604145] Top A levels results for Philip Howard 2018"
    }
  ]
}