{
  "content": [
    {
      "type": "text",
      "text": "# St Werburgh's Church, Warburton\n\n| osgraw = SJ 696,896| denomination = Anglican | churchmanship = | membership = | attendance = | website = [https://www.visitchurches.org.uk/visit/church-listing/st-werburghs-warburton.html The Churches Conservation Trust] | former name = | bull date = | founded date = | founder = | dedication = Saint Werburgh| dedicated date = | consecrated date = | cult = | relics = | events = | past bishop = | people = | status = | functional status = Redundant| heritage designation = Grade I| designated date = 5 March 1959| architect = | architectural type = Church| style = | groundbreaking = | completed date = | construction cost = | closed date = | demolished date = | capacity = | length = | width = | width nave = | height = | diameter = | other dimensions = | floor count = | floor area = | materials = Timber framing, sandstone, brickRoof of Kerridge stone slabs }}\n'''St Werburgh's Church' is the name of two separate churches in the village of Warburton, Greater Manchester, England. The older church is located to the west of the village, and may date back as early as the middle of the 13th&nbsp;century. It is now a redundant church but services are held in the summer months. The church is recorded in the National Heritage List for England as a designated Grade&nbsp;I listed building. The authors of the Buildings of England series call this church \"a lovable muddle\".\nThe newer church was built in 1883–85 and is located to the southeast of the village on the A6144 road. It is a Grade&nbsp;II listed building. It is an active Anglican parish church in the diocese of Chester, the archdeaconry of Macclesfield and the deanery of Bowdon. Its benefice is combined with that of St&nbsp;Peter, Oughtrington.\nThe dedication is an unusual one, ordinarily local to Chester, where Werburgh is the patron saint. Werburgh, an Anglo-Saxon saint who has given her name to Warburgtune'', as Warburton was called in the Domesday survey (1086), was the daughter of Wulfhere, the first Christian king of Mercia. She died around AD&nbsp;700 as Abbess of Ely, with the care of several nunneries. Her relics were moved to the abbey of St&nbsp;Peter and St&nbsp;Paul in Chester, which was later rededicated to St&nbsp;Werburgh.\nOld church\nof the brick tower added to the east end in 1711]]\nHistory\nThere is evidence of a Saxon church on the site before the Norman Conquest. In 1187&ndash;90 Adam de Dutton founded a priory on the site for Norbertine canons but this was short-lived and there is now no trace of the priory. It is likely that the building of the present church began in the middle of the 13th century. Towards the end of the 16th century, the chancel area was remodelled and a pulpit, altar rails and communion table were installed. In 1645 the church was extensively altered and extended. The south and west walls of the nave were rebuilt and the roof of the nave was lowered. A small chapel and vestry with a stone foundation and timber framed wall were added to the south side of the chancel, while a stone extension was added to the north side. In 1711 the east end of the chancel was rebuilt and a brick tower was added at the east end of the church. In 1722 a gallery was built. Wooden floors were installed in 1813, the vestry was incorporated into the church and a new vestry was built onto the south side of the tower. In 1857 the chancel floor was tiled, the walls were painted with medieval designs and the timber supports and the chancel ceiling were plastered. Stained glass was added to windows and the gallery was removed. By 1880 the church needed major repairs, and because of this the new church was built and the old church ceased to be the parish church. Repairs were undertaken in 1894 for dry rot, in 1927 for death watch beetle and in 1958, again for death watch beetle. In 1971 the church passed into the care of the Redundant Churches Fund, the predecessor of the Churches Conservation Trust.\nIn October 2021, the church was one of 142 sites across England to receive part of a £35-million injection into the government's Culture Recovery Fund.\n| osgraw = SJ 705,892| denomination = Anglican | churchmanship = | membership = | attendance = | website = [http://www.achurchnearyou.com/warburton-st-werburgh/ St Werburgh, Warburton] | former name = | bull date = | founded date = | founder = | dedication = Saint Werburgh| dedicated date = | consecrated date = | cult = | relics = | events = | past bishop = | people = Rowland Egerton-Warburton| status = Parish church| functional status = Active| heritage designation = Grade II| designated date = 12 July 1985| architect = John Douglas| architectural type = Church| style = Gothic Revival| groundbreaking = 1882| completed date = 1885| construction cost = | closed date = | demolished date = | capacity = | length = | width = | width nave = | height = | diameter = | other dimensions = | floor count = | floor area = | spire quantity = | spire height = | materials = Red sandstone,Tiled roof| parish = Warburton| deanery = Bowdon| archdeaconry = Macclesfield| diocese = Chester| province = York| presbytery = | synod = | circuit = | district = | division = | subdivision = | archbishop = | bishop = | dean = | subdean = | provost = | provost-rector = | viceprovost = | canon = | canonpastor = | precentor = | archdeacon = | prebendary = | rector = Revd Michael Burgess| vicar = | curate = | priest = | asstpriest = | minister = | assistant = | honpriest = | deacon = | seniorpastor = | pastor = | abbot = | chaplain = | reader = | organistdom = | director = | organist = | organscholar = | chapterclerk = | laychapter = | warden = | flowerguild = | musicgroup = | parishadmin = | serversguild = | logo = | logosize = }}\nExterior\nThe church is built around a timber frame and some timber framing with wattle and daub infilling is retained in the north wall. The rest of the north wall and the south and west walls are built in sandstone. The chancel, south transept and vestry are brick, as is the tower which is placed, unusually, at the east end. It is roofed in Kerridge stone slabs. The roof of the chancel is some  lower than that of the nave. The tower has a pairs of semicircular-headed belfry windows on each face, a stone cornice and six sugar loaf pinnacles.\nInterior\nThe chancel is surrounded on three sides by a wooden half-screen. This screen, the altar table and the pulpit date from the 17th century. The pews date from 1813. The font is octagonal, the base being inscribed 1603 and the pyramidal cover 1595. In the church is a stone sarcophagus dating possibly from the early 12th century. One bell is present which is dated 1575. Parish registers start in 1611 but are complete only from 1634. The stained glass in the east window is by Wailes and the sanctuary floor has Minton tiles; both date from 1857.\nExternal features\nIn the churchyard is a stone sundial dated 1765 with a copper dial and gnomon. This is listed Grade&nbsp;II, as is the lych gate. This is dated 1887 and consists of a timber frame with a slate roof.\nNew church\nThis church was built between 1883 and 1885 to a design by the Chester architect John Douglas for Rowland Egerton-Warburton. It is built in red sandstone with a tile roof. The plan consists of a four-bay nave with a north aisle, a south porch, a three-bay chancel and a northeast tower. The tower is in three stages with diagonal buttresses. It has two two-light belfry openings in each face, castellations and corner pinnacles with crockets. It contains a font cover dated 1595 and an oak chest which was removed from the old church. There is a ring of eight bells cast in 1884 by John Taylor & Co.\nSee also\n*Grade I listed buildings in Greater Manchester\n*Grade I listed churches in Greater Manchester\n*Listed buildings in Warburton, Greater Manchester\n*List of churches in Greater Manchester\n*List of new churches by John Douglas\n*List of church restorations, amendments and furniture by John Douglas\n*List of churches preserved by the Churches Conservation Trust in Northern England\nReferences\nExternal links\n* [https://normysphotography.co.uk/warburton-1 Normy's Photography: Warburton – with several photographs of the old church, also of its interior]\nFurther reading\n*"
    }
  ]
}