{
  "content": [
    {
      "type": "text",
      "text": "# Stacey King\n\n| birth_place  = Lawton, Oklahoma, U.S.\n| high_school  = Lawton (Lawton, Oklahoma)\n| college      = Oklahoma (1985–1989)\n| draft_year   = 1989\n| draft_round  = 1\n| draft_pick   = 6\n| draft_team   = Chicago Bulls\n| career_start = 1989\n| career_end   = 1999\n| career_number   = 34, 21, 33\n| career_position = Power forward / center\n| years1          = –\n| team1           = Chicago Bulls\n| years2          = –\n| team2           = Minnesota Timberwolves\n| years3          =\n| team3           = Arese Basket\n| years4          =\n| team4           = Miami Heat\n| years5          = 1996–1997\n| team5           = Grand Rapids Hoops\n| years6          = 1997\n| team6           = Sioux Falls Skyforce\n| years7          =\n| team7           = Boston Celtics\n| years8          =\n| team8           = Dallas Mavericks\n| years9          = 1997–1998\n| team9           = Antalya Büyükşehir Belediyesi\n| years10         = 1998\n| team10          = Sioux Falls Skyforce\n| years11         = 1998–1999\n| team11          = Atenas de Córdoba\n| cyears1          = 2001–2002\n| cteam1           = Rockford Lightning\n| cyears2          = 2002–2003\n| cteam2           = Sioux Falls Skyforce\n| highlights   =\n* 3× NBA champion (1991–1993)\n* NBA All-Rookie Second Team (1990)\n* Sporting News College Player of the Year (1989)\n* Consensus first-team All-American (1989)\n* Big Eight Player of the Year (1989)\n*No. 33 honored by the University of Oklahoma\n| stats_league  = NBA\n| stat1label    = Points\n| stat1value    = 2,819 (6.4 ppg)\n| stat2label    = Rebounds\n| stat2value    = 1,460 (3.3 rpg)\n| stat3label    = Blocks\n| stat3value    = 210 (0.5 bpg)\n}}\nRonald Stacey King (born January 29, 1967) is an American sports announcer and former National Basketball Association (NBA) center who won three consecutive championships with the Chicago Bulls from 1991 to 1993 while playing next to Michael Jordan. King is the color commentator for Chicago Bulls television broadcasts.\nNBA career (1989–1999)\nAfter a stand-out career at the University of Oklahoma, King was selected by the Bulls in the 1989 NBA draft with the sixth pick. He was projected by many as a number one pick candidate heading into draft night, but slipped. He was one of three first-round picks by the Bulls in that draft (the other two were B. J. Armstrong and Jeff Sanders).  He played four and a half seasons in Chicago before being traded during the 1993–94 campaign to the Minnesota Timberwolves in exchange for 7'2\" Australian-born center Luc Longley. He was last active in the NBA during the 1996–97 season while playing a handful of games for both the Dallas Mavericks and Boston Celtics.\nPost-NBA career\nCoaching (2001–2003)\nKing was named the head coach of the CBA's Rockford Lightning in 2001. The team reached the CBA championship game in 2002 with King as coach.\nTV commentary (2006–present)\nKing began his career with CSN Chicago (later named NBC Sports Chicago) as a studio analyst for pre- and post-game shows for the Chicago Bulls. He filled in as a third commentator during the 2006 playoffs joining Johnny \"Red\" Kerr and Tom Dore. He was permanently added during the 2007 season. In 2008, Tom Dore was replaced by Neil Funk and Kerr's duties were significantly reduced, leading King to become the lead color commentator for the Bulls alongside Neil Funk. King continued in that role when Adam Amin replaced Funk in 2020, until the channel's closure in 2024. King is expected to transition to Chicago Sports Network and retain his role as lead color commentator.\nKing's popularity as an announcer has grown thanks to his great enthusiasm as well as his signature catch-phrases and nicknames. King has received a lot of attention in particular for his calls of highlight plays by Derrick Rose when he was with the Bulls.\nReferences\nExternal links\n*\n}}"
    }
  ]
}