{
  "content": [
    {
      "type": "text",
      "text": "# Stalingrad-class battlecruiser\n\n{|\n| Class before =\n| Class after =\n| Subclasses =\n| Built range = 1951–1953\n| Total ships planned = at least 4\n| Total ships cancelled = 4\n}}\n(standard)\n* (full load)\n| Ship length =\n| Ship beam =\n| Ship power =\n| Ship draught =\n| Ship propulsion = *4-shaft TV-4 geared steam turbines\n*12 water-tube boilers\n| Ship speed =\n| Ship range =\n| Ship endurance =  at\n| Ship complement = 1,712\n| Ship sensors = *Giuis-2 air-search radar\n*Rif-A surface-search radar\n*Iakor, Zalp, Fut-B fire-control radars\n*Grot and Shtag-B range-finding radars\n*Soltnse-1P infrared detectors\n*Gerkules sonar\n| Ship EW = Korall and Machta jammers\n| Ship armament = *3 × triple  guns\n*6 × twin  guns\n*6 × quadruple  guns\n*10 × quadruple  guns\n| Ship armor = *Waterline belt:\n*Upper deck:  each\n*Middle deck:\n*Turrets:\n*Barbettes:\n*Secondary turrets:\n*Conning tower:\n*Bulkheads:\n| Ship notes =\n}}\n|}\nThe 'Stalingrad-class battlecruiser, also known as Project 82' (), was a Soviet battlecruiser design from 1941. It was a smaller and less-expensive counterpart to the s of 1939. The original role was for a light, fast ship intended to break up attacks by British fast-cruiser forces that might attempt bombardment of Russia's northern ports. In keeping with the battlecruiser design concept, they would have been able to outgun any ship with similar speed, or outrun anything more heavily armed. Design work had just started when the German invasion of the Soviet Union opened and the design was put on hold.\nThe design was reimagined in 1944, intended to operate along with the s and proposed aircraft carriers to make up powerful task forces able to challenge the American fleet. In this role it would need to be a more powerful ship than the original design, taking over for the now-cancelled Kronstadts. They were intended to fend off enemy attacks and protect the carriers when bad weather prevented flying. A series of four were ordered, and Stalingrad finally began construction in 1951.\nSupported primarily by Joseph Stalin and opposed by a considerable part of the naval staff, the project came to an abrupt end with Stalin's death in 1953. By this time the second and third ships were under construction and abandoned on the slipway, while a fourth was never started. The partially completed Stalingrad ended as a target ship for testing anti-ship missiles, before being broken up around 1962.\nBackground and genesis\nThe roots of the Project 82-class began back in May 1941 when the Main Naval Staff approved tactical requirements (, OTZ) for a medium-sized cruiser between the light cruisers of the  and  classes, and the Kronshtadts. It was intended to fulfill the following roles:\n* Engage enemy cruisers armed with  guns\n* Destroy enemy light cruisers\n* Support its own light cruisers\n* Lay minefields\n* Suppress the enemy's medium-caliber coast defense batteries and support landing operations\n* Conduct operations against the enemy's maritime lines of communication\nTo accomplish these missions, the Navy desired a ship of  or smaller, armed with eight 203&nbsp;mm and twelve  guns, a dozen  anti-aircraft (AA) guns and one triple  torpedo mount. It was to be armored to withstand 203&nbsp;mm shells with a speed not less than , a range of  at  and able to carry four seaplanes launched by two catapults. Three preliminary designs were proposed in response, but only one, which displaced , was able to meet all of the requirements. However, the designers recommended an increase in the main armament caliber to , a strengthened anti-aircraft battery and reductions in the armor protection, speed, and range. The opening of Operation Barbarossa a month later rendered these plans moot as both the Project 82 and the Kronshtadt (Project 69) classes were put on hold.\nThe project was revived in 1943 with a new requirement issued on 15 September. This was basically identical to the original, but added one new requirement: \"Protect the operations of aircraft carriers and conduct joint operations with them.\" Estimated characteristics were a displacement between , nine main guns between , a secondary battery of a dozen  dual-purpose guns and thirty-two 37&nbsp;mm AA guns. The speed, range and aircraft requirements remained the same, although the torpedo tubes were dropped. Over a dozen preliminary designs had been proposed by May 1944, but none were acceptable.\nA new tactical requirement was issued in November 1944 that envisioned a more realistic displacement of  while the speed was dropped to  and the range to . Armament was also revised to nine 220&nbsp;mm guns, sixteen 130&nbsp;mm guns, thirty-two  and twenty  AA guns. These last weapons were changed to  in 1945.\nAdmiral Nikolai Kuznetsov believed that these ships could protect the planned Soviet aircraft carriers in bad weather from American cruisers and pushed to have them built, but the Shipbuilding Commissariat balked. It refused to begin detailed design work pleading the uncertainty of the post-war building situation and the already heavy workload of its design bureau. Undeterred, the Navy continued studying cruiser designs and planned a ten-year construction program for the period 1946–1955. This was based on defensive operations along the periphery of the Soviet Union against Anglo-American carrier groups while submarines would attack their lines of communication. Ten of these large cruisers were envisioned as part of this construction program. When the program was discussed by the Politburo on 29 September 1945 there was no great disagreement on the large cruisers, although Stalin favored increasing the size of their main guns to , but did not push the issue when Admiral Kuznetsov resisted.\nA bigger problem was the resistance of the Shipbuilding Commissariat which said it would be impossible to lay down any ships of new design until about 1950 and that only incremental changes could be made to the designs currently in production. The Navy saw no reason why new ships, reflecting wartime experience, could not be laid down beginning in 1948. To resolve the dispute a special commission was appointed, led by Lavrentiy Beria, which mostly sided with the Shipbuilding Commissariat in that most ships of the program would be improved versions of current designs. Four of the large cruisers were to begin construction, two each at Shipyard 402 in Molotovsk and Shipyard 444 at Nikolayev with another three planned to be laid down in 1953 and 1955. This compromise was approved on 27 November 1945 and detailed design work began in 1946 for designs equipped with both the 220&nbsp;mm and 305&nbsp;mm guns.\nThis was reaffirmed by a decree of the Council of Ministers on 28 January 1947. By August 1947, the Navy and the Shipbuilding Ministry had winnowed down design proposals to only three, one from each armed with 305&nbsp;mm guns and a joint design armed with 220&nbsp;mm guns. The latter's design was slightly smaller () than the Navy's  design, and had an armor belt  thinner, but was otherwise almost identical. The joint design was  smaller with a reduced secondary armament, but was about  faster. All proposals had a range of  at . These designs weren't reviewed until March 1948, probably because of the need to coordinate reaction to the American Marshall Plan, and Stalin approved the Navy's more heavily protected design. But even this was subject to more delays as the detailed specifications had to be approved and this didn't occur until 31 August 1948, likely delayed by the Tito–Stalin split and the start of the Berlin Blockade, both in June.\nWith the approval of the specifications, TsKB-17, the heavy-ship design bureau, began work on the sketch design to be submitted for approval to the Council of Ministers before the start of the technical design could begin. By March 1949, four alternatives had been completed, differing mainly in the arrangement of the 130&nbsp;mm guns and the boiler layout. The bureau preferred one layout and the Navy and the Shipbuilding Ministry concurred so the bureau began the technical design, without formal approval, in order to be ready to lay down the first two ships in the third quarter of 1950 as already scheduled. However, when Stalin reviewed the sketch design in September 1949, he rejected it, ordering a smaller, faster ship capable of . TsKB-17 was able to produce a preliminary technical design that met Stalin's demands by the end of the year, an amazingly fast amount of time for what should have been a very involved process. The most likely explanation is that the designers retained as much of their original work as possible and found room for the more powerful turbines and more numerous boilers necessary to attain Stalin's specified speed by deleting the two rear twin 130&nbsp;mm turrets, and their magazines, as revealed by a comparison of the 1949 and 1951 sketches.\nThe Navy didn't like the compromises made to reduce the displacement down to Stalin's  and to achieve the high speed demanded as revealed in a March 1950 meeting in the Kremlin where Stalin revealed critical points about his thoughts for these ships. When the admirals responded to his question about the purpose of these ships by saying that they were to fight the enemy's heavy cruisers, he contradicted them and said that their purpose was to fight light cruisers: \"It is necessary to increase its speed to 35 knots and create a cruiser that will cause panic among the enemy's light cruisers, disperse and destroy them.\" Furthermore, he believed that they would fight close to home, defending the coastal waters of Soviet Union. \"You cannot blindly copy the Americans and English, they face different conditions, their ships travel far over the ocean, out of touch with their bases. We are not considering conducting oceanic battles, but instead will fight close to our own shores, so we do not need a large ammunition supply on the ship.\" The admirals also did not like the reduction in the secondary armament made to accommodate the larger machinery and extra boilers needed to reach the speed desired by Stalin, but he reminded them that most aircraft would attack the battlecruiser at heights below  and the ceiling of the 130&nbsp;mm was far in excess of that. He also ordered a reduction in the light anti-aircraft guns believing that its escorts would defend it. This design was approved by the Council of Ministers on 25 March 1950.\nThis allowed the technical design process to begin and it was completed in December 1950. Reviews by the Navy and Shipbuilding Ministries in February 1951 led to some significant changes to the design in April. The original form of the bow was similar to that of the Chapayev-class light cruisers, but sea trials of the lead ship of that class in December 1950 – January 1951 proved that she was very wet forward, which hindered her seakeeping ability. The Stalingrads bow form was radically altered with a much more raked stem, its sheer and flare were greatly increased and the ship gained almost  in length, possibly in response to the Chapayevs problems. In addition the thickness of her belt armor was increased from , possibly in response to weight savings elsewhere. This final design was submitted for approval on 4 June 1951, but preparations for the working design drawings began before it was approved.\nDesign\nGeneral characteristics\nThe ships of the Stalingrad class were  long at the waterline, and  long overall. They had a beam of , a maximum draft of  forward,  aft, and displaced  at standard load and  at full load. They were the first large Soviet-built ships with a flush deck. The hull was completely welded to save weight and they used longitudinal framing throughout. Metacentric height was estimated at , presumably in the design load condition. The ships had a triple bottom underneath the armored citadel that had a height of  and 23 main watertight compartments. They had a crew of 1712 men plus space for 30 when acting as a flagship.\nThe cost for each ship was estimated at 1.168 billion rubles, almost four times the 322 million rubles for a Sverdlov-class cruiser. The ship was intended to be commanded by a rear admiral, with its executive officer, political officer and the heads of the gunnery and engineering divisions as captains 1st rank.\nPropulsion\nThe high speed demanded of the Stalingrads required four TV-4 geared steam turbines, each producing  and driving one propeller. They were powered by twelve water-tube boilers at a pressure of  at a temperature of . The machinery was arranged on the unit system so that one hit couldn't knock out all the boilers or all the turbines and immobilize the ship. Two boiler compartments, each with three boilers, were situated underneath the forward funnel, with a turbine compartment for the wing shafts immediately aft and this arrangement was repeated for the two center shafts.  of fuel oil were carried which gave a range of  at . Maximum speed was .\nEight  turbo-generators drove the 380V, 50&nbsp;Hz electrical system in addition to four  Diesel generators located outside each end of the armored citadel for a total capacity of 10,000&nbsp;kW.\nArmor\nThe armor scheme of the battlecruisers was quite complex with armor plates of no less than 25 different thicknesses used. Although designed to withstand only cruiser shellfire, no less than , or 29% of the total displacement was devoted to armor. The citadel armor was intended to provide an immunity zone against  armor-piercing shells at ranges between  and . The remainder of the armor was intended to resist  high explosive shells and  HE bombs.\nThe waterline belt armor was  thick and inclined outwards at an angle of 15° to maximize its effectiveness against both plunging and horizontal fire. It had a vertical height of ,  of which was below the design waterline. It covered approximately 60% of the ship's waterline or about .  of armor covered the hull side above the belt as protection from splinters. The forward end of the armored citadel was closed off by a  thick transverse bulkhead on the forward end and  aft. The deck armor in the citadel ranged in thickness, from  for the upper deck, a  middle deck—increased to  over the handling rooms for the  gun turrets—and a lower splinter deck of , which increased outboard to . The waterline forward of the citadel was protected by a  splinter belt all the way to the bow, with a similar extension aft to the steering gear compartment. The middle deck behind this splinter belt was  thick. The steering gear was protected by  of armor on the sides, a  deck and a  armored bulkhead aft.\nAdditional armored plates were fixed to the third bulkhead of the underwater protection system to protect against diving shells hitting below the level of the waterline belt. Their thicknesses varied depending on location and ranged oddly from  amidships to  over the 305&nbsp;mm magazines. The main battery turrets were protected by  of armor on the faces,  on the sides and  on the roofs. Their barbettes had a maximum of  on their forward faces and  on the after face. Below the main deck they were protected by only  of armor. The 130&nbsp;mm turrets were only protected by  of armor as splinter protection.\nThe forward conning tower had a forward face of  that thinned down to 225&nbsp;mm on the aft section with a  roof. Its controls and cable runs were protected by a 100&nbsp;mm tube and the lower part of the conning tower's supporting structure was protected with 20&nbsp;mm plates. Aft there was a lightly protected auxiliary control station with 50&nbsp;mm sides. Between the middle and lower decks the funnel uptakes were protected by 100&nbsp;mm of armor and  between the upper and middle decks. A 125&nbsp;mm upper and  lower grating protected the boilers from shells and fragments entering through the uptake openings.\nThe torpedo protection system was developed on the basis of model tests and full-scale trials using the incomplete hull of the prewar battlecruiser Kronshtadt and was expected to resist a torpedo warhead equivalent to  of TNT. It was made up of an external bulge with four longitudinal bulkheads. The first was  thick, the second was , the third was 50&nbsp;mm and the fourth . Presumably the thinner thicknesses were at the ends of the ships where the bulkheads were squeezed together. The outer space was left empty, but the two middle spaces were filled with oil that was intended to be exchanged with sea water as it was consumed, and the inner space was also to be left empty. One curious feature was that the first and second bulkheads were concave in profile. Apparently this was believed to improve their protective qualities, although there is no indication of how it did this. \"The total depth of the system was about  amidships, which seems rather shallow.\" The triple bottom underneath the armored citadel was believed to protect the ship against a charge equivalent to  of TNT  below the ship's hull.\nArmament\nRather than use the Tsarist-era  MK-3-12 gun as originally planned, or use the 305-mm/54 guns ordered for the Kronstadts, it was decided in 1947 to adopt a new and more powerful 61-caliber gun of the same size that was to use three newly designed triple SM-6 turrets. Each individual gun weighed  and the complete turret weighed . The guns could be depressed to −4° and elevated to 50° at a rate of 10° per second. Traverse speed was 4.5° per second and each turret was ordinarily remotely controlled from the More-82 main fire control director, but could be locally controlled if necessary. They fired  shells at a muzzle velocity of  to a maximum range of around  using  of propellant. Their rate of fire was 3.26 rounds per minute and 80 rounds were stowed aboard for each gun. One barrel was completed in December 1953 for evaluation purposes after the ships were canceled earlier that year.\nThe 130-mm 58-caliber guns were also a new design. They were to be fitted in a new twin-gun BL-109A dual-purpose mount. Each individual gun weighed  and the complete turret weighed . The guns in this mount could depress to −8° and elevate to 83° at a rate of 20° a second. Traverse speed was 20° per second. The guns fired  shells at a muzzle velocity of  to a maximum horizontal range of  using  of propellant. Their rate of fire was 15 rounds per minute and 200 rounds were stowed for each gun.\nTwenty-four  78-caliber light anti-aircraft guns were to be carried by the Stalingrads in six quadruple SM-20-ZIF power-driven, fully enclosed mounts. Two mounts were fitted on each side of the forward funnel and the last two were superimposed above the rear main gun turret. Each individual gun weighed  and the complete mount weighed . The guns in this mount could depress to −13° and elevate to 85° at a rate of 25° a second. Traverse speed was 30° per second. The gun fired  shells at a muzzle velocity of  to a maximum horizontal range of . Its rate of fire was 75 rounds per minute and 800 rounds were carried for each gun.\nForty  79-caliber AA guns were carried in ten quadruple powered BL-120 mounts. These were designed especially for the Stalingrads and were fully, if lightly, armored against splinters. Each individual gun weighed  and the complete mount weighed . The guns in this mount could depress to −5° and elevate to 90° at a rate of 25° a second. Traverse speed was 70° per second. The gun fired  shells at a muzzle velocity of  to a maximum effective range of . Its effective rate of fire was 240 rounds per minute and 1200 rounds were carried for each gun.\nElectronics\nTarget data for the More-82 director was derived from the Zalp (NATO designation Half Bow) fire-control radar and Grot rangefinding radars mounted on turrets Nos. 2 and 3. These were backed up by a single KDP-8-10 optical director mount fitted with  and  rangefinders. Some of the BL-109A mounts were to fitted for range-finding radars, probably Shtag-B (NATO designation Egg Cup), but they were ordinarily controlled by three SPN-500 directors, one for each pair of gun mounts.  The SPN-500s carried a  rangefinder as well as Yakor (NATO designation Sun Visor) fire-control radar. Air search capability was provided by the Fut-N (NATO designation Slim Net) radar with anti-aircraft fire control provided by Fut-B (NATO designation Hawk Screech) radars.\nThe main air-search radar was the Giuis-2 (NATO designation Cross Bird), a Soviet development of the wartime British Type 291 radar. It had a range of  against aerial targets and  against surface targets. The main surface-search radar was Rif-A (NATO designation Ball End) that had a range of  against surface targets. The Stalingrads also had Neptun and Nord navigational radars. Soviet electronics were still fairly primitive during this period and the trials of the light cruiser , which carried many of these systems, revealed that the effective range of the Rif-A surface-search radar was less than that of the Yakor and Zalp fire-control radars. There were also problems transferring data from the Giuis-2 air-search radar to the Yakor and Fut-B anti-aircraft fire-control radars, which was a serious problem when dealing with high-speed aircraft. The Giuis-2 also interfered with ultra-shortwave radio reception.\nKorall radar-jammers were mounted on either side of the mainmast as well as a Machta system on the foremast. Solentse-1P infrared detectors were carried on either side of the superstructure. Fakel-MO and Fakel-MZ antenna comprised the IFF system. A Gerkules sonar was also fitted in addition to various radio direction finders.\nMissile variant\nThe TsKB-17 design bureau proposed variants of the design with both cruise and ballistic missiles. The ballistic missiles would have been launched from vertical tubes replacing the forward turrets, and in one version, the entire main armament. The proposal was dropped because both types would have needed a fully stabilized launching platform to give them any chance of hitting their targets and that the ballistic missiles would need three hours of preparation time.\nConstruction\n{|class=\"wikitable plainrowheaders\"\n|+ Construction data\n! scope=\"col\" |Ship\n! scope=\"col\"| Hull number\n!scope=\"col\"| Builder\n!scope=\"col\"|Laid down (official)\n!scope=\"col\"|Launched\n!scope=\"col\"|Scheduled completion\n|-\n| scope=\"row\"| Stalingrad ()\n| 0–400\n| Marti Yard, Nikolayev\n|31 December 1951\n|16 March 1954\n|1954\n|-\n| scope=\"row\"| Moskva ()\n| 0–406\n| Baltic Yard, Leningrad\n|September 1952\n|n/a\n|1955\n|-\n| scope=\"row\"|Kronshtadt ()\n|0–401\n|Molotovsk\n|October 1952\n|n/a\n|?\n|}\nThe first sections of Stalingrad had been laid down in November 1951 in Slipway \"O\" of the Marti South Shipyard in Nikolayev where a , Sovetskaya Ukraina, had begun construction in 1938, but the slipway itself was in need of reconstruction and its lower end was occupied by the hull of the Sverdlov-class light cruiser  which was scheduled for launch at the end of 1952. Moskvas keel was laid down in September 1952 by the Baltic Works in Leningrad. The unnamed third ship was laid down at Yard 402, at Molotovsk around October 1952, Soviet sources refer to her proposed names as Kronshtadt or Arkhangelsk. A fourth ship was apparently ordered from Yard 402, but was never laid down.\nStalingrads formal keel-laying was on 31 December 1951 and it was hoped that she could be launched on 6 November 1953, the eve of the 36th anniversary of the October Revolution. But deliveries of steel, armor, machinery and other equipment were delayed or arrived out of sequence, despite extraordinary efforts by the Ministry of Shipbuilding, and slowed construction enough so that she fell about six months behind schedule and the same was more or less true for the other ships. By 1 January 1953 Stalingrad was intended to be 42.9% complete, but was actually only 18.8% done. Moskva was planned to be 11.5% finished, but was only 7.5% done. And the unnamed ship was intended to be 5.2% along, but was only 2.5% complete.\nThese ships were canceled on 18 April 1953, after Stalin's death on 5 March, by the Ministry of Transport and Heavy Machinery, and the hulls of Moskva and the third ship were scrapped on the slipways later that year. The Ministry ordered in June that Stalingrads hull, which was about 70% ready for launching, be used for weapons tests. Her hull was launched on 16 April 1954 and her stern, which was more or less complete, was dismantled—her bow hadn't been built when work was suspended a year earlier—and the central,  long, section was modified for her new role.\nCareer as a target hulk\nStalingrads hull was towed from Nikolayev on 19 May 1955 by three tugs, but was driven ashore by high winds on 23 May at the southern entrance to Sevastopol Bay. She grounded on a very rocky bottom in very shallow water only about  from shore. A number of the ordinary methods to refloat a ship couldn't be used because she was very nearly empty and so nothing could be off-loaded and the rocky bottom meant that it couldn't be excavated out from underneath her. The first attempt used brute force provided by the cruisers  and Kerch to unsuccessfully tow her off. Several other attempts were made using explosive charges to create shock waves that would pivot her stern into deeper water in combination with tugs attempting to pull her around, but these were counterproductive in that several holes were blown in her sides which flooded several compartments and grounded her that much more firmly. At this time a more detailed assessment was made of the situation and 259 steel projections were discovered on the underside of her hull, left over from her launching cradles. These ranged in length from  and totally invalidated all calculations about the amount of force required to free her.\nThe capsizing of the battleship Novorossiysk in Sevastopol harbor on 29 October 1955 delayed salvage operations on Stalingrad until the end of the year. The hull had to be patched, the water pumped out and all the projections removed to raise the stern slightly with pontoons, pivot into deeper water, then trim it down to elevate the bow off the bottom and pull it free. These preparations were very time-consuming and it wasn't until mid-July 1956 that it could be pulled off the rocks into Sevastopol harbor where she was given more permanent repairs. She was then moved to the Naval Firing Range between Yevpatoria and Sevastopol where it was used as a target for seven P-1 or KSS anti-ship missiles fired from the converted Sverdlov-class cruiser  in December 1956. The missiles penetrated the upper and main decks and devastated the upper hull, but there was no appreciable change in the ship's draught. Details are not known about other tests, although she reportedly served as a target for P-15 Termit (SS-N-2 Styx) missiles and a wide variety of armor-piercing munitions. By the early 1960s her usefulness had come to an end and she was scrapped, possibly in 1962.\nSee also\n*List of ships of the Soviet Navy\n*List of ships of Russia by project number\nNotes\nReferences\n*\n*\n*\n*\nExternal links\n*[https://web.archive.org/web/20090816163025/http://web.ukonline.co.uk/aj.cashmore/russia/battlecruisers/stalingrad/stalingrad.html Brief article]\n*[http://ship.bsu.by/main.asp?id=102894 Detailed article]"
    }
  ]
}