{
  "content": [
    {
      "type": "text",
      "text": "# Stamford Raffles Award\n\nThe Stamford Raffles Award is an award of the Zoological Society of London. It is \"For distinguished contributions to zoology by amateur zoologists or professional zoologists in recognition of contributions which are outside the scope of their professional activities.\" The first awards were sculptures by Henry Moore called 'Animal Form', followed later by sculptures called 'Young Hippo' by Anita Mandl.\nList of awardees\n20th century\n* Source: [https://www.zsl.org/sites/default/files/media/2018-06/Stamford%20Raffles%20Award%20Winners.pdf ZSL]\n*1961 Dr W. S. Bristowe for contributions to arachnology\n*1962 Dr. Reginald Ernest Moreau for contributions to ornithology\n*1963 Cyril Winthrop Mackworth Praed for contributions to ornithology\n*1964 Claud William Wright for contributions to palaeontology\n*1965 Dr Ernest Neal for contributions to mammalogy and entomology\n*1966 The Reverend Edward Allworthy Armstrong for contributions to ornithology\n*1967 Dr Maxwell Savage for contributions to knowledge of the amphibians\n*1968 Guy Mountfort for his contributions to the study of natural history\n*1969 Rex A. Jubb for contributions to southern African ichthyology\n*1970 Donovan Reginald Rosevear in recognition of contributions to knowledge of West African mammalian fauna\n*1971 Beryl Patricia Hall for work on the taxonomy and zoogeography of African birds\n*1972 Dr Lionel George Higgins for outstanding contributions to knowledge of Lepidoptera\n*1973 George Hazlewood \"Ted\" Locket for contributions to arachnology\n*1974 Arthur Erskine Ellis for contributions to the study of molluscs\n*1975 Lieutenant-Colonel John Nevill Eliot for distinguished taxonomic work on Lepidoptera, particularly the family Lycaenidae\n*1977 Stanley Cramp for contributions to ornithology\n*1978 Jonathan Kingdon for contributions to the study of East African mammals\n*1979 Stella Turk for contributions to the study of seahorse life and marine molluscs\n*1980 Dr Edward Holt Eason for distinguished work on the taxonomy of centipedes\n*1981 Lt.-Col. A. Maitland Emmet for work on Microlepidoptera\n*1982 Mr R. Moylan Gambles for distinguished work on Odonata\n*1983 Major Michael Gallagher for contributions to the ornithology of Arabia\n*1984 Dr Walter J. Le Quesne for distinguished contribution to the taxonomy and biology of Hemiptera\n*1985 Dr A. Frank Millidge for distinguished contributions to arachnology\n*1987 Miss Fiona Guiness for contributions to research on red deer in the British Isles\n*1988 Mr William Frank Harding Ansell for contribution to knowledge of the taxonomy and distribution of African mammals\n*1989 Major Kenneth W. England for contribution to the taxonomy of tropical sea-anemones\n*1990 Dr David L. Harrison for distinguished contribution to the study of mammals\n*1992 Dr J. Denis Summers-Smith for world-renowned work on sparrows\n*1993 Dr William R. P. Bourne for contribution to the study of seabirds\n*1994 Mrs J. Hall-Crags for long-standing contributions to the description of bird song\n*1996 Mrs Norma Chapman for outstanding contribution to the knowledge of deer in Britain\n*1998 Dr Clive Carefoot for outstanding research on plumage genetics\n*1999 Mr Edward Max Nicholson for lifelong contributions to conservation\n21st century\n*2001 Dr Norman Moore for research on the ecology and behaviour of dragonflies\n*2002 Thomas Jones Roberts for furthering our understanding of wildlife in Pakistan\n*2003 Christopher du Feu for contributions to ornithology\n*2005 Peter Grubb for contributions to mammalian systematics\n*2006 Peter Chandler for contributions to our knowledge of European Diptera\n*2007 Ted Benton for contributions to our knowledge on bees, butterflies and dragonflies\n*2009 Bob Swann for contributions to ornithology\n*2010 Richard Lewington for contributions for wildlife illustration\n*2011 Dan Danahar for contributions towards the advancement of biodiversity education\n*2012 Stephen Petty for significant long-term monitoring and data collection that has contributed to our understanding of the ecology of tawny owl populations, their vole prey and other raptors\n*2013 David Mallon for significant contributions to antelope conservation\n*2014 Elise Andrew for significant contributions to science communication\n*2015 Nick Tregenza for outstanding contributions to acoustic monitoring of cetaceans\n*2016 Malcolm Tait for outstanding contributions to the public appreciation of wildlife\n*2017 Paul Brock for outstanding contributions to entomology\nNotes\nSee also\n* List of biology awards\nReferences\nExternal links\n*[https://www.zsl.org/ Zoological Society of London]\n*[http://www.christies.com/lotfinder/sculptures-statues-figures/henry-moore-om-ch-animal-form-6007739-details.aspx Reginald Ernest Moreau's Stamford Raffles Award of 1962], sold for £50,000 in June 2016 (Christie's)"
    }
  ]
}