{
  "content": [
    {
      "type": "text",
      "text": "# Stanton, Delaware\n\n|postal_code_type = ZIP code\n|postal_code = 19804\n|area_code = 302\n|blank_name = GNIS feature ID\n|blank_info = 214687\n|blank1_name =\n|blank1_info =\n|website =\n|footnotes =\n}}\nStanton is an unincorporated community in New Castle County, Delaware, United States, near the confluence of the Red Clay and White Clay Creeks. It is located in the southern end of Mill Creek Hundred.\nIt was a distinct census-designated place for the 1990 U.S. census.\nHistory\nPrior to the arrival of European settlers, the area around Stanton was frequented by Native American peoples. A paleo-Indian archaeology site, referred to as the Clyde Farm site, is located southwest of the area.\nStanton is located near the Piedmont Fall Line along the banks of Red Clay Creek. First settled around 1679, it was the first settlement in Mill Creek Hundred. Many small watermills dotted the area, and a farm road from Chester County, Pennsylvania terminated on the banks of Red Clay Creek.\nThe village was originally known as \"Cuckoldstown\", perhaps for an inn that allegedly served as a meeting place for illicit rendezvous. The village was renamed after Stephen Stanton, a prominent landowner in the village.\nIn August 1777, George Washington erected fortifications in the area, expecting to confront British troops recently landed at Head of Elk, Maryland. Washington and his staff held a war council in the Hale-Byrnes House. The expected battle did not develop, though, as General Howe moved his army north towards Chester County, Pennsylvania.The Hale-Byrnes House, where George Washington met with his officers prior to The Battle of Brandywine\nSt. James Church was established in 1720 and the first public school in the area opened near the church in 1808.\nThe Kiamensi Woolen Mills operated on the banks of the Red Clay Creek at several locations in the area. The mill provided blankets and other material for the Union Army during the American Civil War and operated until the early 1900s.\nThe Hale-Byrnes House and St. James Episcopal Church are listed on the National Register of Historic Places.\nEducation\n]]\nStanton is part of the Red Clay Consolidated School District for public education. Students in grades K through 5 attend Forest Oak Elementary School west of Stanton or Anna P. Mote Elementary School in Marshallton. Stanton Middle School serves students in grades 6 through 8. Students living in Stanton in grades 9 through 12 attend John Dickinson High School near Pike Creek. Red Clay Consolidated School District also operates The Central School, an alternative education for grades 6 through 12, and James H. Groves Adult Education in Stanton. The Central School and James H. Groves Adult Education are housed in the same building, which used to be the Stanton Central Elementary School.\nStanton is home to the Main Campus of Delaware Technical Community College.\nTransportation\nHeavily traveled Delaware Route 4 (Ogletown Stanton Road) and Delaware Route 7 (Limestone Road) merge in Stanton and separate southwest of the area. DE 4 runs east to Wilmington and west to Newark while DE 7 runs north to Pike Creek and south to Christiana, where it provides access to Interstate 95 and Delaware Route 1.\nDART First State maintains Churchmans Crossing station (Fairplay Station) near the south entrance to Delaware Park Racetrack. Fairplay Station is a stop on SEPTA's Wilmington/Newark Line Regional Rail service with connections to Newark, Wilmington, Claymont, and Philadelphia. DART First State provides bus service to Stanton along Route 5, which runs between downtown Wilmington and the Christiana Mall via Newport, Stanton, and the Delaware Park Racetrack.\nRecreation\nDelaware Park Racetrack is located in Stanton. The facility opened in 1937 for thoroughbred horse racing. In 1995, video lottery machines (i.e., slot machines) were installed in the clubhouse. The site expanded to table games and sports betting in 2009.\nNotable people\n*L. Heisler Ball (1861–1932), physician and United States Senator\n*Joseph Hill Sinex (1819–1892), Pennsylvania State Representative and Civil War Union Officer\nReferences\nExternal links\n*"
    }
  ]
}