{
  "content": [
    {
      "type": "text",
      "text": "# Star Wars Gangsta Rap\n\n| runtime        = 3.5 min\n| language       = English\n| budget         =\n}}\nThe \"Star Wars Gangsta Rap\" is a parody song based on the original Star Wars trilogy. The song was later popularized as a Flash-animated music video and was the first winner of the Audience Choice Award in the Lucasfilm-sponsored Official Star Wars Fan Film Awards.\nHistory\nThe \"Star Wars Gangsta Rap\" started out as a song, written by Jason Brannon and Chris Crawford, with vocals by Brannon, drum machine by Crawford and Leonard, and keyboard by Brian Leonard. The group billed themselves as Bentframe.\nAnimator Thomas Lee discovered the rap in 2000 and used it as a basis to practice his developing Flash skills. This became the first (and most widely seen) version of the video. After showing the finished results to Bentframe, they together formed BentTV.\nThe song was the top video at Newgrounds for six months.\nDue to the project's success, BentTV later created an improved version, referred to as the Special Edition, which debuted at the 2004 Official Star Wars Fan Film Awards. The audio track was not changed, but the visuals were completely redrawn, with improved color and shading and more detailed motion, all while emulating the relevant scenes in the movies more closely and adding more. The improvement in animation is analogous to Industrial Light & Magic's 1997 Special Edition film touch-ups.\nSynopsis\nEmploying some of the elements of gangsta rap and hip hop music, stances and dancing, \"Star Wars Gangsta Rap\" loosely mixes plotlines from the first Star Wars feature and its sequel The Empire Strikes Back (and follow-up Return of the Jedi in the Special Edition), satirically recreating several of the more famous scenes and dialogue.\nThe music video starts out on the back of the Star Destroyer, then reveals the image of Emperor Palpatine who claims \"it's not the east or the west side.\" Darth Vader appears as a rapper sidekick or hypeman and replies \"No, it's not.\" This continues until the Emperor says \"it's the Dark Side\", at which point Vader says \"You are correct.\" The Emperor then threatens to blow up the planets of \"all you Vader haters out there.\"\nDarth Vader and the Emperor alternate rapping during the first verse, until Vader proclaims, \"He Luke Skywalker will join us or die. We've got Death Star\". Images of the Death Star appear in the background, and the line is repeated by Vader, while Stormtroopers dance in the background.\nThe next verse begins with Luke Skywalker's at his family's moisture farm on Tatooine, with his uncle Owen Lars issuing commands at him. Luke raps the second verse, with C-3PO and R2-D2 appearing in the background.\nIn the next verse, Obi-Wan Kenobi tells Luke to \"use the Force and run...\", whereupon Luke takes his X-wing fighter to Dagobah. Yoda appears next, and he and Luke trade raps, until Luke gets back in his X-wing. During a brief intermission, he enjoys \"a mighty good gin and tonic\", then flies to Cloud City and confronts Darth Vader. Vader and Luke engage in a lightsaber duel, whereupon Vader cuts off Luke's hand, then reveals that he is his father.\nHan Solo appears in the final verse repeating \"Knock him out the box, Luke, knock him out...\" This is an homage to the outro of the song \"Children's Story\" by rapper Slick Rick.\nAwards, legacies and sequels\n\"Star Wars Gangsta Rap\" is one of the most popular flash videos of all time, with more than 20 million online views. Editors of Time magazine listed it as the Best Online Comedy Movie of 2001.\nThe film won the Audience Choice at the inaugural Official Star Wars Fan Film Awards in 2002, and it was broadcast on the Sci Fi Channel special on the awards. Clips from \"Star Wars Gangsta Rap Special Edition\" appear in the VH1 special When Star Wars Ruled the World in 2004.\nIt has inspired other similar works and imitations, notably The Lords Of The Rhymes, done very much in the style of the Star Wars Gangsta Rap but instead parodying The Lord of the Rings trilogy.\nDirector Thomas Lee would later animate the video for \"Weird Al\" Yankovic's song \"I'll Sue Ya\" on his 2006 album \"Straight Outta Lynwood\". \"Star Wars Gangsta Rap\" was previously one of many parody songs commonly misattributed to Yankovic on peer-to-peer file sharing sites.\nIn November 2009, an official sequel, \"Star Wars Gangsta Rap: Chronicles\", was released on Atom.com.\nReferences\nExternal links\n* [http://www.newgrounds.com/portal/view/174837 \"Star Wars Gangsta Rap\" video]\n*\n* [https://web.archive.org/web/20050424085242/http://www.newgrounds.com/ngmag/devspot/spotlight/18 Interview with animator Thomas Lee], Newgrounds.com, August 2004"
    }
  ]
}