{
  "content": [
    {
      "type": "text",
      "text": "# Star Wars: Starfighter (video game)\n\n|PlayStation 2|EU|March 23, 2001}}Xbox (Special Edition)}}Windows|EU|February 8, 2002}}PlayStation 3\n}}\n| genre = Action\n| modes = Single-player, multiplayer\n}}\nStar Wars: Starfighter is a 2001 action game developed and published by LucasArts. It takes place right before the Battle of Naboo. The player unites alongside three starfighter pilots and is allowed to take control of several different spacecraft to help stop the invasion that threatens Naboo.\nStarfighter was revealed at E3 2001. Initially released for PlayStation 2, an Xbox version was later released as Star Wars: Starfighter: Special Edition. An additional port to Microsoft Windows followed in late January 2002, based on the PlayStation 2 version. Both ports were developed by Secret Level, Inc. In 2003, an arcade version was released on Tsunami Visual Technologies' motion-base platform. LucasArts re-released the game on the digital distribution platform Steam on July 8, 2009, and on the PlayStation 3 in the United States in 2015 via the PlayStation Store. A sequel was released in 2002, named Star Wars: Jedi Starfighter.\nGameplay\nIn the game, the player controls different starfighters from the Star Wars universe. The player is given full control over pitch, yaw and roll of the fighter. The player has information on ammunition and enemy targets displayed on their heads up display (HUD). The player can issue commands to their squadmates, which are displayed on the HUD. The game features 14 missions both in atmosphere and in space. Each mission revolves around protecting friendly ships and destroying enemy ships. Each mission also has one bonus and one hidden objective completing of which unlocks bonus missions, videos, and starfighters. Each are equipped with different weaponry which can be highly effective in certain missions.\nThe PlayStation 2 version includes two multiplayer modes. The Xbox Special Edition includes three additional missions, for a total of five. Capture the flag features two versions, one with a pair of flags, and a single-flag variant. Dogfight, is a typical deathmatch mode where scoring is based on kills. Tag selects one person as IT, and they must avoid the other player, who pursues them. Hunter/Hunted is a variant on tag. The game includes a cheat code system to unlock different features and additional content.\nPlot\nThe story begins by showing one of the four main characters, Rhys Dallows, a member of the Naboo Royal Space Fighter Corps (NRSFC), piloting an N-1 Naboo Starfighter. He manages to blast one droid starfighter out of the sky, but is subsequently shot by a second one. It is then revealed Rhys was just dreaming, as he is awakened by Essara Till, who trains him in basic maneuvering and combat. The two are then relegated to defending the Queen of Naboo as they meet with Trade Federation officials. The meeting is revealed to be a trap, as Rhys and Essara are then forced to defend the royal starship until it can escape. Essara is killed by an unidentified ship, while Rhys survives and is later rescued by the Toydarian Reti.\nThe story at this point shifts to the point of view of Vana Sage, a mercenary employed by the Trade Federation, as she helps test the Scarab starfighter. After she destroys a number of the fighters, her astromech droid, Mod-3, intercepts a transmission about the illegal invasion of Naboo. The Trade Federation subsequently terminates her contract and sends numerous \"Hunter-Killer\" droids, then a squad of mercenaries after her. She manages to defeat all of the mercenaries and destroy all but one of the droids, which leads her to a droid production factory on the volcanic planet of Eos. The factory tries to trap her within a large shield, but she escapes by destroying the generators. After investigating for a while, she returns to her base of operations, awaiting Reti and Rhys.\nNym, a Feeorin pirate whom Vana had managed to capture before the game takes place, had escaped and now threatened to kill Vana. She manages to buy him off by telling him about the droid factory she discovered on Eos, which he repays by trapping her in a locker and meeting back up with his pirate group above Lok. Disabling a freighter in orbit and managing to send it crashing to the surface, Nym's pirates steal valuable supplies from the crashed freighter and return to their base. The Trade Federation strikes back, overrunning Nym's pirates and forcing him to self-destruct the base as they return to Vana's home.\nAfter the meeting between Rhys, Vana, Nym and Reti, the four ally with each other in an attempt to stop the Trade Federation once and for all. The group conducts a guerrilla campaign against the Trade Federation as they destroy the droid factory on Eos, disable a Trade Federation freighter and steal supplies, deliver those supplies to Bravo Flight, rescue Trade Federation prisoners, and defend the Naboo Royal Guard's outpost. The final mission takes place around the Droid Control Ship Profiteer, as Bravo Flight destroys the receiver stations on the exterior of the ship. As they destroy all the droid starfighters currently deployed, the leader of the Trade Federation-hired mercenaries, the same ship that killed Essara Till, appears. The shield to one of the hangar bays opens; a landing craft leaves as the mercenary and Rhys enter. The shield closes again, trapping Rhys inside and the rest of Bravo Flight outside the Profiteer. A fierce battle throughout most of the ship ensues, with Rhys eventually destroying the mercenary.\nThe Profiteer begins falling apart as soon as the mercenary's ship is destroyed, which forces Rhys to blow a generator in the hangar bay. The shield is lowered, and Rhys escapes the doomed vessel. This takes place at the same time Anakin Skywalker is inside of the ship in a different bay, as numerous quotes reference Anakin's Starfighter destroying and leaving the ship. As Naboo celebrates the Trade Federation's defeat, Rhys, Vana, and Reti say farewell to Nym, who departs the planet on his ship.\nDevelopment and marketing\nAfter an unveiling at the 2001 E3, approximately ten months after the initial release on PlayStation 2, an Xbox version was released under the title Star Wars: Starfighter: Special Edition with enhanced graphics, improved multiplayer and several other upgrades, with an additional port to the PC following in late January 2002 - this time based on the original PS2 version. Both ports were performed by Secret Level, Inc.\nDuring Q3 2003, Tsunami Visual Technologies released the title on their TsuMo motion-base Arcade platform. LucasArts re-released the game on the digital distribution platform Steam on July 8, 2009, and on the PlayStation 3 in the US on April 28, 2015 and in Europe on May 4, 2015 via the online PlayStation Store.\nIn the Star Wars: Episode I – The Phantom Menace Two-Disc Special Edition DVD, the developers confirmed that a sequel of Star Wars: Starfighter would be developed, this time based on Star Wars: Episode II – Attack of the Clones and would incorporate Force powers in the gameplay. It was stated that this was due to the original game's success. Star Wars: Jedi Starfighter was released in 2002.\nA three-volume comic series based on the video game called Star Wars: Starfighter - Crossbones was published by Dark Horse Comics, which was republished by Marvel Comics under the Star Wars Legends brand.\n*Star Wars: Starfighter - Crossbones #1 (2002-01-09)\n*Star Wars: Starfighter - Crossbones #2 (2002-02-13)\n*Star Wars: Starfighter - Crossbones #3 (2002-03-13)\nReception\n| MC_PS2 = 84/100\n| MC_XBOX = 76/100\n| Allgame_PC =\n| Allgame_PS2 =\n| Allgame_XBOX =\n| CGW_PC =\n| EGM_PS2 = 7.33/10\n| EGM_XBOX = 5.5/10\n| EPD_PC = 6/10\n| EPD_XBOX = 7.5/10\n| EuroG_PS2 = 9/10\n| GI_PS2 = 9.25/10\n| GI_XBOX = 8/10\n| GameRev_PS2 = B+\n| GameRev_XBOX = B\n| GSpot_PC = 6.7/10\n| GSpot_PS2 = 7.8/10\n| GSpot_XBOX = 7.2/10\n| GSpy_PC = 71%\n| GSpy_PS2 = 79%\n| GSpy_XBOX = 73%\n| IGN_PC = 7.7/10\n| IGN_PS2 = 9/10\n| IGN_XBOX = 7.8/10\n| NGen_PS2 =\n| NGen_XBOX =\n| OPM_PS2 =\n| OXM_XBOX = 7/10\n| PCGUS_PC = 79%\n| rev1 = The Cincinnati Enquirer\n| rev1_PS2 =\n| rev2 = Maxim\n| rev2_PS2 = 8/10\n}}\nThe PlayStation 2 version and Special Edition received \"generally favorable reviews\", while the PC version received above-average reviews, according to the review aggregation website Metacritic. Jeff Lundrigan of NextGens April 2001 issue called the former console version \"The best Star Wars game in at least a couple of years.\" Nine issues later, the magazine said that the Special Edition \"has a storyline that matters not one jot and only lasts a scant 14 stages, but it's a blast to play while it lasts.\" In Japan, where the former console version was ported for release on October 4, 2001, Famitsu gave it a score of 30 out of 40.\nAir Hendrix of GamePros April 2001 issue said, \"The PS2 didn't live up to the circus of hype surrounding its launch, but Starfighter is one of those titles that helps you remember what all the fuss was about. It has its share of minor flaws, but Starfighter stands tall as one of the best PS2 titles in early 2001.\" Nine issues later, Pong Sifu said, \"The hook of the Xbox version is that the multiplayer missions are playable from the beginning, and new games like Tag and Detonator Drop have been added.\" Da bomb mom of GameZone gave the PS2 version a perfect ten, saying, \"this game is for everyone in our galaxy! May many, many hours of great gameplay be with you!\" Michael Lafferty later gave the Special Edition 9.4 out of 10, saying, \"This is what a flight sim should be. The first-person perspective is incredible, as are the graphics. Star Wars games on the PC were a joy to play – this platform merely adds to the legacy of fine games built on a wonderful universe.\" Robert Gerbino gave the PC version eight out of ten, calling it \"an action arcade game. It's not gonna blow you away, or keep you up very late while you desperately try to defeat that next level.  It is what it is. A fun romp through the Star Wars universe while we all wait for Attack of the Clones to be released.\"\nSee also\n*List of Star Wars video games\n*Star Wars video games\nNotes\nReferences\nExternal links\n*[https://web.archive.org/web/20060814001007/http://www.lucasarts.com/products/starwarsstarfighter/splash.htm LucasArts page]\n*[https://web.archive.org/web/20020206082131/http://www.secretlevel.com/main.php?page_type=product_pages&page=product_overview&product=10 Secret Level, Inc. page]\n*\n*"
    }
  ]
}