{
  "content": [
    {
      "type": "text",
      "text": "# Star Wars: Assault on Hoth\n\nStar Wars: Assault on Hoth is a two-player strategic board game produced by West End Games and designed by Paul Murphy that recreates the Battle of Hoth as depicted in Star Wars Episode V: The Empire Strikes Back.\nGameplay\nEach player takes the side of the Rebel Alliance or the Galactic Empire on a hex map that depicts the snowy terrain of Hoth as Imperial forces attempt to destroy the Echo Base shield generator before five Rebel transports escape. Cardboard counters represent the various Rebel and Imperial soldiers and vehicles that participated in the Battle of Hoth, including Rebel light and heavy infantry, Imperial snowtrooper light and heavy infantry, AT-ST and AT-AT walkers, laser towers, and snowspeeder aircraft.\nMovement is determined using a deck of 20 Action Cards that denotes which unit moves next and what actions is it allowed to perform. If an Action Card says to “Draw Event,” then a card is chosen from that deck that lists reinforcements, special unit bonuses, or a “Transport Away!” card.\nIn addition to hexes that determine unit placement and movement, Star Wars: Assault on Hoth incorporates “macro hexes” that are used to determine range between units engaged in combat. The game is played using two standard six-sided dice, as well as eight special six-sided dice that each have two blank sides, two Darth Vader sides, and two lightsaber sides. To determine hits, the Imperial player only counts Darth Vader results and the Rebel player only counts lightsaber results. In addition, there are three terrain types (clear, rough, and cliffs) that provide strategic advantages and impact unit movement.\nIn addition to units on the map, the Rebel player also secretly assigns Luke Skywalker to one of the snowspeeders and does not reveal his identity until the player is ready to use Luke's “Force Points” that allow him to boost his vehicle's armor or firepower, as well as reduce the impact of critical hits against his speeder.\nThe Imperial player wins if he destroys the shield generator before the fifth “Transport Away!” Event Card is drawn. The Imperial player may increase his likelihood of destroying the generator if he also destroys the Power Grid. The Rebel player wins once the fifth “Transport Away!” card is drawn or if he destroys all Imperial units on the map.\nPublication history\nReleased in 1988, Star Wars: Assault on Hoth was one of the first products published by West End Games when it first acquired the Star Wars license. (Other products included Star Wars: The Roleplaying Game and its supplement books, the Star Wars Miniatures Game, and additional board games such Star Wars: Star Warriors, Star Wars: Escape from the Death Star, and Star Wars: Battle for Endor.)\nReception\nIn Issue 37 of Challenge, Julia Martin called it \"an easy board game for two players which excitingly recreates the battle for Hoth.\" Martin liked the clarity of the rules, saying that once they had been read once, \"they really need not be referred to again because of the clear design of the game.\" The only thing she wished for was a mounted board rather than the paper map provided. Despite this, she concluded, \"The price is excellent for the value in fun that Assault on Hoth provides. I truly enjoyed this game.\"\nGames called Assault on Hoth \"exciting stuff, material for a wonderful game — if the game can recapture the speed and tension of the film. Happily, Assault on Hoth, designed by Paul Murphy, is a break-through game — fast, exciting, and with a novel system that preserves the feel of the battle while dispelling overcomplexity and fussy rules.\" The review concluded that the game \"is a wonderfully quick-playing simulation game.\"\nIn the November 1989 edition of Dragon, Jim Bambra called Assault on Hoth \"an exciting board game that uses an innovative move and action sequence to recreate the battle featured in the opening scenes of The Empire Strikes Back. The game moves at a fast pace and is easy to learn and play.\"\nReviews\n*''Isaac Asimov's Science Fiction Magazine v13 n9 (1989 09) (as \"Escape from Hoth\")\n*Casus Belli'' #50\nReferences"
    }
  ]
}