{
  "content": [
    {
      "type": "text",
      "text": "# Star Wars: Galactic Starcruiser\n\n| closedate   =\n| theme       = Star Wars\n| roomnumber  = 100\n| operator    = Disney Parks, Experiences and Products\n| website     =\n}}\n'Star Wars: Galactic Starcruiser' was a Star Wars-themed two-night live action role-playing/choose-your-own-adventure hotel experience operated by The Walt Disney Company from March 1, 2022, until September 30, 2023. It simulated a cruise in outer space within the Star Wars galaxy, and took place in a building located next to Disney's Hollywood Studios, in the Epcot Resort Area of the Walt Disney World Resort in Bay Lake, Florida. It was thematically linked to the Star Wars: Galaxy's Edge area in Disney's Hollywood Studios.\nHistory\nIn April 2017, Disney hired the website Swagbucks to survey its visitors to gauge interest in a possible Star Wars-themed hotel with a visitor experience based on the Star Wars storyline. Plans for the Star Wars hotel were announced at D23 Expo 2017 in Anaheim, California,  along with 22 other improvements and additions to Disney parks around the world. At D23 Expo 2019, it was revealed that the hotel would be called the Halcyon and would be a two-night immersive experience in which all guests arrive and depart together, similar to a cruise line.\nThe 2021 opening of the Star Wars hotel was delayed to March 1, 2022, by the COVID-19 pandemic.\nIn 2017, Disney's head of Parks and Resorts, Bob Chapek, said the Star Wars hotel would be the company's \"most experiential concept ever\" and a \"100% immersive\" experience that \"will culminate in a unique journey for every person who visits.\" Planned features included creatures and droids acting as hotel staff; guests wearing Star Wars costumes; and an ability to interact with features of the hotel as if visitors were really in the Star Wars universe. Marketing materials suggested that visitors would participate in lightsaber training and duels (an extension of the Jedi Training Academy in Disney's Hollywood Studios); explore and pilot Star Wars spacecraft; and go on \"secret missions\" personalized toward the visitors' experience. When the hotel opened, many of these activities were replaced by lightsaber training only, and \"Bridge Ops\" training instead of piloting the ship.\nOne writer for The Verge called the planned hotel a \"Westworld for Star Wars fans,\" noting the hotel amenities that would facilitate the immersive-hotel experience. Mic compared the planned hotel to Disney's Animal Kingdom Lodge and Universal Orlando's Cabana Bay Beach Resort, two hotels containing lesser-immersive experiences. Estimates of the cost to build the hotel varied, from as low as $350 million to as high as $1 billion.\nIn May 2023, Disney announced that the Galactic Starcruiser would have its last two-day voyage on September 28, and then close permanently. The Galactic Starcruiser officially closed at 10 a.m. on September 30, 2023. At the JP Morgan Technology, Media & Communications Conference in May 2023, Chairman Josh D'Amaro claimed that Disney was expecting \"about $100–150 million in accelerated depreciation” in the following two fiscal quarters -amounting to $200-300 million total- due to the closure. This number was later revised and confirmed by Interim CFO Kevin Lansberry to be $250 million.\nIn January 2025, it was reported that the building was being converted to the second office space for Walt Disney Imagineering's upcoming theme park projects, including the Disney Villains-themed land at Magic Kingdom, the Monsters, Inc.-themed land at Disney's Hollywood Studios and the Tropical Americas land at Disney's Animal Kingdom.\nDescription\nEarly renderings of the project in 2017 showed that the new hotel would be shaped like a Star Wars starship. Renderings also showed a lobby in the style of a Star Wars spaceship interior. On May 30, 2018, it was announced that the hotel would be located just south of Disney's Hollywood Studios, to the east of World Drive. Valet parking was available for guests arriving in personal vehicles (no self-parking), or guests could use other means, such as ride sharing or a taxi. A driveway connected the Starcruiser's main terminal to the Cast parking lot of Disney's Hollywood Studios.\nGuests would stay on the ship, named the Halcyon, for two days and two nights. The minimum room rate was $4,800 for two people. The guest rooms contained full-size bunk beds and a queen-sized bed; some rooms also had a pull-down to sleep a fifth guest in the style of Star Wars bunkers. The cost included the room, ongoing entertainment, food and drinks (excluding alcoholic beverages), admission and transportation to Hollywood Studios, lightning lanes for the ''Galaxy's Edge'' attractions, a quick-service meal credit for DHS, valet parking, and a MagicBand. Guests were able to leave the Starcruiser at any point throughout their stay. Visitors could choose to participate in a specific story line through the Play Disney Parks mobile app.\nThe Halcyon was described as containing 13 decks, with four being available to passengers: 4, 5, 6, and 7. Deck 4 contained the Crown of Corellia Dining Room, the Lightsaber Training Pod, the Climate Simulator, the Transport Dock to Batuu, the Cargo Hold, the Brig, and the Engineering Room. Deck 6 contained the Atrium, which led to the Bridge, the Sublight Lounge, the Chandrila Collection (souvenir shop), and the Passenger Services' Desk. Decks 4, 5, and 7 hosted the guest cabins. On their second day, guests at the hotel traveled to ''Star Wars: Galaxy's Edge by a \"shuttle-pod transportation system\"—a cargo box on a flatbed truck whose interior resembled a shuttle spacecraft. The shuttle-pod terminal in Galaxy's Edge'' was located next to the First Order ship in Docking Bay 9. The walkway that led to the shuttle-pod is still visible, though unavailable to guests.\nThe story followed the Halcyon crew and passengers as they celebrated the 275th anniversary of the starline. The ship's itinerary coincided with Resistance activity, which caused the First Order to board and investigate. Guests were able to choose which storyline they wanted to participate in: Resistance, Smuggler, or First Order.\nDeck 4:\nDining Room (52930541285).jpg|Crown of Corellia Dining Room\nStar Wars Galactic Starcruiser lightsaber experience-1.png|Lightsaber Training\nClimate Simulator (52935345902).jpg|Climate Simulator\nDeck 6:\nAtrium (52921676888).jpg|Atrium\nShop Interior (52936512294).jpg|The Chandrila Collection\nView of the Bridge (52936419229).jpg|Starcruiser Bridge\nSublight Lounge (52930205474).jpg|Sublight Lounge\nDeck 7:\nStar Wars Galactic Starcruiser Deck7 Corridor.png|Deck 7 corridor\nInside Cabin 5-212 (52915885211).jpg|Guestroom\nReception\nEarly photos of the Halcyon's small, windowless cabins went viral before the hotel opened to the public, with many commentators on Twitter complaining that they were not a suitable luxury accommodation. After the hotel's opening, the high price was still criticized. Esquire wrote that \"the real villain here is Galactic Starcruiser's Death Star-sized price tag\", and that the small rooms did not quite justify the high prices.  One commentator said its high prices had kept many from visiting, while the lone storyline offered to guests dissuaded them from visiting twice.\nIn an article written for Polygon, Charlie Hall wrote that despite the facility flaws and the high price point, the Starcruiser was \"something of a dream come true for a Star Wars fan\". He also described the overall story arc as the highlight of the stay, which made the guests \"an integral part\" of the Star Wars universe.\nIn November 2022, the Galactic Starcruiser won a Thea Award from the Themed Entertainment Association for outstanding achievement in brand experience.\nIn May 2024, a 4 hour long-form review of the Galactic Starcruiser by YouTuber Jenny Nicholson went viral. Nicholson detailed her own experience with the hotel, mainly noting problems with customer service and glitches in the app that prevented her from engaging with the story. In Nicholson's opinion, the Starcruiser experience failed to justify the hotel's high cost. Nicholson speculated that early reviews of the Starcruiser were based on a press tour that lasted four hours, where aspects such as the app were described by tour guides rather than experienced by the reviewers; this was confirmed by Polygon reviewer Charlie Hall, who noted he and others were never shown the app. Nicholson later revealed on Twitter that her video received copyright claims by Disney for the usage of \"the music playing in the background of the marketing clips\" that she used in the video.\nReferences\nExternal links\n*\n* [https://www.youtube.com/watch?v=T0CpOYZZZW4 \"The Spectacular Failure of the Star Wars Hotel\"] - video essay by Jenny Nicholson"
    }
  ]
}