{
  "content": [
    {
      "type": "text",
      "text": "# Star Heritage 1: The Black Cobra\n\nStar Inheritance 1: The Black Cobra is a 2005 Russian video game developed by Step Creative Group and published by 1C / Cenega. It is a remake of the company's 1995 title entitled Star Heritage.\nPlot and gameplay\nThe game concerns an Earthling secret agent, whose mission is to defend the planet against an alien invasion.\nThe game takes a cue from Myst, featuring a series of screens that the player navigates through from the first -person perspective, however instead of focusing on inventory puzzles, its gameplay mechanic rely on exploration and survival. The game features day/night cycles, and the plot deviates based on whether the player chooses to be good or bad. The game's mix of genres was, according to the developers, inspired by Hero Quest from Sierra, as well as  Legend Entertainment's Superhero League of Hoboken and Shannara.\nProduction\nIn 1995 the studio produced the game Star Heritage for the ZX Spectrum, which became popular in Russia. While they began creating new projects for the platform, they changed course when ZX Spectrums went out of fashion in favour of PCs and ultimately shut down. They were revived in 2003 by Yuri Matveev, one of the authors of the first \"Star Heritage\", and created the arcade game Deactivation (2003) and the arcade-adventure Alice's Adventures (2005) and the adventure Evenings On Farm Near Dikanka (2006). This remake was their next title. Five of the 1995 version's musical compositions were retained for the remake, recorded using modern processing. Meanwhile, the game also included twenty unique compositions. At the time the company was making this title, they had over 25 staff.\nAt the August 2004 Chaos Constructions festival, which took place in St. Petersburg, Step Creative first showed a working demo of the game to the public. On September 13, 2004, the company announced a deal with  St. Petersburg studio \"Strategic Music\" to create the game's soundtrack. On January 25, 2005 a demo trailer of the game was released. Beginning on February 25, 2005, \"The Fearless Diaries\" - a text-based prequel to the game - was periodically released on the developer's website. On March 3 it was announced that 1C would be the game's publisher in Russia. By March 2005, the company had plans to make a sequel entitled Star Heritage 2: On the Other Side of the Universe and had already created a short story; though they intended to cap the series off with two entries. In April, Strategic Music released three polyphonic ringtones thematically linked to the game. On August 15, the company announced a competition until October 20, 2005, where the winners would draw Star Heritage-related artworks to receive exclusive behind-the-scenes assets on the game's environment and history. On August 22 the voice acting for the project was completed, including many popular Russian actors; the protagonist was performed by Alexander Klukvin while the antagonist was played by Nikolai Lazarev. The developer's website was first updated with a dedicated section about the game on Sep 06, 2005. An English demo was to be released in early August. On November 24, 2005, it was announced the game would be released on December 2, 2005 as part of the two-disc 1C series TOYS COLLECTION. On December 21 the game's development staff held an online conference on their forum page (similar to a Reddit Ask me Anything). On December 30 they made 5 tracks available to the public. By January 2006, they had begun working on their next project entitled Inhabited Island: The Earthling.  By February 16, 2006, the game had not been published to European and American audiences. On February 21, 2006, Step Creative announced a new RPG project entitled Star Heritage 0: Ship of Ages to be released 4th quarter of 2006. The game was intended to have modern, three-dimensional graphics and realistic physics. Absolute Games felt the game details were reminiscent of System Shock 2. In April 2006, Star Heritage 1 was displayed at the Game Developers Conference, that year held in Moscow. On June 16, 2006, Step Creative announced they had signed a deal with NET Lizard LTD to develop a mobile version of the game to Russia and Commonwealth of Independent States, with the release date being unknown. On August 8, 2006, the game's award-winning soundtrack was released as the Star Legacy - 1: Black Cobra music collection. On July 20, 2008, it would be announced that the developer would be leaving the industry due to financial issues, and Star Heritage 0 was not released.\nThe game was planned to be released onto Steam in 2017, with the intention being to raise enough money to develop a new entry in the series. They noted \"There is still a long way ahead of adaptation and preparation for publication\". As of 2019, the game has not been released onto Steam.\nCritical reception\nAbsolute Gaming deemed it beautiful, interesting, and original. Gameru felt the backgrounds were plausible and beautiful. OGL felt it could be the first example of a local game that would demonstrate Russian games could compete with Western ones, and praised its graphics and music. Overclocked noted that at that point, original adventure games of that quality and budget had not yet been released in Russia. Adventure.eu felt the title demonstrated how Step Creative had the capacity to produce high-quality adventure title within Russia. Igray noted that it was not the most technologically advanced title, but that it was made with \"soul\". Playground felt that the game was reminiscent of monster hits like The Moment of Silence, Blade Runner, Syberia, but that the develop had a ways to go before it could reach that level. In 2016, Playground did a retrospective on the title where they noted it could appeal to different players, whether it be the atmosphere, gameplay, or plot. FCenter felt the game was \"unfairly short\". THG excused some aspects of the game due to it being intended as the introductory entry in the Star Heritage saga. Atlant appreciated the title's old-fashioned gameplay. Nestor praised the gigantic, interesting world. Gameplay noted that while the title had a few minor bugs, they were fixed in later patches. Country games noted that the transition between locations is a blast from the past, due to requiring theplayer to access the map rather than offering smooth transitions. PC Games felt it was obsolete upon arrival, though deemed it \"interesting\". Game World Navigator deemed it a \"short but exciting adventure\" that deserved a sequel. VR Games felt the world was intricately designed. Arena Quests felt it was a title by nostalgia-lovers for nostalgia-lovers. Ignormania felt that from 2017 standards it looked a little primitive. Overclcokers felt the game had many pros that would make it appealing to 2017 video gamers on Steam. KV noted it was not a perfect game.\nIn April 2006, the sound design was nominated for the 2006 Russian Game Developers Conference Award.\nReferences\nExternal links\n* [https://web.archive.org/web/20060223184123/http://www.theinventory.org/the.inventory.english/TheInventory.Issue.20.zip Preview in The Inventory]\n* [https://web.archive.org/web/20071025163818/http://www.stepgames.ru/files/poster/gurn.pdf Poster information]\n*The Best Computer Games\", No.4 2006 [https://web.archive.org/web/20071026195155/http://stepgames.ru/files/zvezdnie.pdf review]\n*[https://web.archive.org/web/20071027043949/http://stepgames.ru/files/xs_03(64)_made_in_russia.pdf Made in Russia article] (\"Hacker Special\", No. 3/64 March 2006)\n*[https://web.archive.org/web/20071026195625/http://stepgames.ru/files/sh.pdf Magazine review] Navigator of the game world\", No.1 (104) January 2006"
    }
  ]
}