{
  "content": [
    {
      "type": "text",
      "text": "# Star Wars: Lost Stars\n\n| media_type   = Print (hardcover)\n| pages        = 551\n| isbn         = 978-1-484-72498-9\n}}\nStar Wars: Lost Stars is a 2015 young adult science fiction novel by Claudia Gray set in the Star Wars universe. The book is set before, during, and after the events of the Star Wars original trilogy (A New Hope, The Empire Strikes Back and Return of the Jedi), in which the Galactic Empire has tightened its stranglehold on systems in the Outer Rim while the Rebel Alliance also grows in strength.\nThe novel depicts the story of two childhood friends, Ciena Ree and Thane Kyrell, who end up on opposite sides of the conflict: Thane defects to the Rebel Alliance, while Ciena stays in the Galactic Empire. While the two struggle to reconcile their loyalty to the organizations with their friendship with each other, a romance blossoms between the two.\nPlot\nAristocratic Second-Waver Thane Kyrell and villager First-Waver Ciena Ree reside on the Outer Rim planet of Jelucan, where the two bond over their shared love of flying and interest in enrolling at the Imperial Academy to become TIE fighter pilots. While enrolled at the Imperial Academy on Coruscant, they top their classes, often competing with each other for first in their class. They remain good friends until Thane's laser cannon project is sabotaged by the Academy itself, who frame Ciena for doing so. As punishment, both fail the assignment and lose the top spots of the class. When Thane proposes the theory that the Academy itself had framed Ciena for sabotaging Thane's project, Ciena accuses him of being disloyal to the Empire.\nThane and Ciena's relationship remains sabotaged until their graduation from the Imperial Academy, where they reconcile during the graduation ceremony, dancing together.\nAfter their graduation, Ciena is assigned to the Devastator, Darth Vader's Star Destroyer, while Thane is assigned to the Death Star as a TIE pilot. Both Thane and Ciena witness Alderaan being destroyed by the Death Star. Thane ultimately survives the Death Star's destruction, having been sent away on a search mission on Dantooine.\nAfter the destruction of the Death Star, Ciena is reunited with Thane on her Star Destroyer. However, later on, Thane deserts his service, becoming disillusioned with the Empire after seeing the atrocities committed by it. After deserting the Empire, Thane meets with Ciena on Jelucan, where she attempts to convince him to return to the Empire, to no avail. After professing their feelings for each other, they make love before bidding each other farewell.\nWedge Antilles recruits Thane to the Rebel Alliance, where he becomes an X-wing fighter pilot. After the Battle of Hoth, Ciena recognizes Thane's flying style from battle footage and realizes that Thane had joined the Rebellion. This causes a dilemma within Ciena, who still has feelings for Thane but is loyal to the Empire.\nLater on, Ciena's mother on Jelucan is charged with embezzlement. Ciena takes leave to support her mother alongside her father. No one comes to support them, as their tradition expected, except, to her surprise, Thane. The two decide to go flying together like they used to, realizing that almost nothing had changed between them except fighting for opposite sides. After an argument, Ciena and Thane make love a second time, though Thane fails to recruit Ciena to the rebellion. In the trial, Ciena's mother is found guilty and sentenced to hard labor, upsetting Ciena. The two part ways, believing it will be one of the last times they will meet.\nHowever, Thane and his squadron encounter Ciena and her team when they are sent to gather intelligence. Ciena blocks the other TIE fighters' line of fire while pretending to pursue him, allowing Thane to escape.\nAfter the destruction of the second Death Star, Ciena is badly injured and has to take long medical leave, but is believed by Thane to have perished, leading to Kyrell adopting the First-Waver ritualistic right of mourning in memory. When Ciena returns to duty over a year later, she has secretly grown disgusted with the Empire after seeing how its leaders were willing to tear each other and the Galactic Empire to shreds in their fight for power, but believes her binding oath of loyalty means she must remain. She is also promoted by her commanding officer, Grand Moff Randd, to the rank of Captain and is assigned command of a Star Destroyer, the Inflictor, which is then dispatched to join the grouping Imperial forces on Jakku. During the Battle of Jakku, Thane's team is tasked with infiltrating and capturing the Inflictor, unaware of its captain's identity, but is met with fierce resistance from the Star Destroyer's crew. When Ciena realizes that the ship has been infiltrated, she orders her crew to abandon ship (revealing her survival to Thane in the process) while intending to collide the ship into Jakku, making sure that the ship does not fall to the New Republic's hands whilst simultaneously allowing her to both escape the Empire's grip and still fulfill her oath. However, before she can follow through, Thane confronts Ciena on the ship's bridge. The two have an intense fight, though Thane emerges victorious and saves both of their lives, escaping in an escape pod.\nIn the end, Ciena is held as a prisoner of war. When Thane visits her, he assures her that she will be released soon, though Ciena still affirms her loyalty to the Empire, despite her views of the New Republic changing, as she refuses to break her oath. Nevertheless, she reconciles with Thane, who promises to wait however long it took so that they could be together. Meanwhile, Nash Windrider — Thane's former roommate at the Royal Imperial Academy and Ciena's close friend and fellow TIE pilot — believes her to be dead and vows to take revenge on her behalf, watching as the hidden ships of the fractured Galactic Empire ready themselves for an attack on the unsuspecting New Republic.\nRelease\nThe novel was released in conjunction with Star Wars: Aftermath on September 4, 2015, as a part of the Journey to Star Wars: The Force Awakens publishing initiative, in preparation for the December 18, 2015 release of the seventh installment in the film saga, Star Wars: The Force Awakens.\nThe Battle of Jakku, a battle that is first described in the last few chapters of the novel, can be experienced in the Star Wars Battlefront reboot video game, as free downloadable content that was released on December 8, 2015.\nOn May 4, 2017, LINE Corporation released an online manga adaptation of the novel exclusively in Japan. Yen Press announced during their Anime NYC panel that they licensed the manga for a North American release.\nReception\nSean Keane of the New York Daily News wrote \"'Lost Stars may be marketed as a Young Adult novel, but Gray crafts a well written, enthralling narrative that will appeal to Star Wars fans of all ages.\"\nGermain Lussier of Gizmodo wrote: \"Lost Stars is a must read for any Star Wars fan looking to get a fix either before The Force Awakens, or after.\"\nMegan Crouse of Den of Geek wrote \"Claudia Gray’s Star Wars book Lost Stars has been a hit among fans so far. Originally described as Romeo and Juliet meets Star Wars, it explores the Empire and Rebellion in-depth through the eyes of two young adventurers, Thane and Ciena.\"\nScreen Rant said that the novel is \"one of the most beloved entries into the expanded universe, Lost Stars is as epic as a Star Wars novel can get.\" They later wrote how the book \"would work perfectly for a Disney+ adaptation\".\nTheGamer called the novel \"very well written\" and the best prequel to The Force Awakens.\nReferences\nExternal links\n*\n* [http://books.disney.com/book/lost-stars/ Lost Stars] at Disney Publishing Worldwide"
    }
  ]
}