{
  "content": [
    {
      "type": "text",
      "text": "# Star Wars: Thrawn Ascendancy: Chaos Rising\n\n| isbn              = 9781787460645\n| congress          =\n| dewey             =\n| oclc              =\n| preceded_by       =\n| followed_by       = Star Wars: Thrawn Ascendancy: Greater Good, Star Wars: Thrawn Ascendancy: Lesser Evil\n| pub_date          = September 1, 2020\n}}\nStar Wars: Thrawn Ascendancy: Chaos Rising is a Star Wars canon novel by Timothy Zahn, published on September 1, 2020, by Del Rey Books.\nChaos Rising is the first book in the Star Wars: Thrawn Ascendancy Trilogy which explores Thrawn's early years in the Chiss territory before he joined the Galactic Empire. This novel takes place before the 2017-2019 Star Wars:Thrawn Trilogy.\nPlot\nThis origin story of Grand Admiral Thrawn lies beyond the Star Wars galaxy in the Unknown Regions. Within the Chiss Ascendancy, home to the Chiss people, Mitth'raw'nuruodo (Thrawn) rises to power quickly.  When the peace of the Ascendancy is disturbed by an attack on the Ascendancy's capital, Thrawn and his allies are dispatched to track down their attackers. As Thrawn investigates he discovers the dangers against the Ascendancy are not what they seem.\nReception\nBoth James Whitebrook of Gizmodo and Sean Keane of CNet gave overall positive reviews for the book.\nGoodreads reviews rate the novel as 4.26 out of 5 stars. With 44% of Goodreads' community ratings giving the book 5 stars, and 39% of the ratings giving the novel 4 stars. About 15% of ratings gave the novel 3 stars or less. Most of Goodreads' reviews for Chaos Rising are positive.\nThe Rogue Rebels blog express that the novel is fresh, includes a lot more Chiss and explanation of their culture, and is still full of Thrawn and his methodically cunning calculations.\nStar Wars News Net expressed that \"Chaos Rising is a triumph in Star Wars storytelling. First and foremost, it’s a great novel. There’s mystery, drama, action, and plenty of world-building to satisfy the most detail oriented fans.\"\nSequels\nThrawn Ascendancy: Greater Good\nThis sequel to Thrawn Ascendancy: Chaos Rising was released by Del Rey Books on April 27, 2021. Canonically, Thrawn Ascendancy: Greater Good takes place after the season finale of Star Wars Rebels: Season Three.\nThrawn Ascendancy: Lesser Evil\nThis novel is the third and last installment to the Thrawn Ascendancy Trilogy. It was published by Del Rey Books on November 16, 2021. Canonically, Thrawn Ascendancy: Lesser Evil takes place midway through Star Wars Rebels: Season Four.\nOther Thrawn Books\nThrawn Trilogy (2017-2019)\nThe Star Wars: Thrawn Trilogy starting with the novel Thrawn published in 2017 by Penguin Random House, occurs after the events of the Thrawn Ascendancy Trilogy. Star Wars: Thrawn and it's sequels Star Wars: Thrawn Alliances and Star Wars: Thrawn Treason are set during and around the events in  3D CGI animated television series Star Wars Rebels. Star Wars Rebels brought the character Grand Admiral Thrawn back into Star Wars Canon after his first trilogy was de-canonized by Disney.\nHeir to the Empire Trilogy (1991-1993)\nThe Heir to the Empire Trilogy, also known as the first Star Wars: Thrawn Trilogy, is no longer considered Star Wars Canon. The series starts with the book Heir to the Empire (published 1991), followed by the novels Dark Force Rising (1992), and The Last Command (1993). This trilogy introduced the character Grand Admiral Thrawn to the Star Wars Galaxy.\nSee also\n* List of Star Wars books, the list of novels published in the Star Wars series\nReferences"
    }
  ]
}