{
  "content": [
    {
      "type": "text",
      "text": "# Stary Browar\n\nShopping, Arts and Business Center \"Stary Browar\" is the center of commerce and art, built in November 2003, located in the center of Poznań, Poland at 42 Półwiejska Street.\nThe center is a combination of retail space and an art gallery. The shopping center is adjacent to a Class A high-rise office complex.  The total area of the center is around 130 000 m2. The Old Brewery is home to around 210 stores and restaurants. Underground the building there is a Tier III data center operated by Beyond.pl. The building was designed on the basis of a historic factory - the former Brewery Huggerów - by Studio ADS.  The investor was Fortis, a company owned by Grazyna Kulczyk. Since 2015 it belongs to Deutsche Asset & Wealth Management, which current name is Deutsche Asset Management. The décor was designed by stage designer Ryszard Kaja. It is notable for preserving the original architecture and style.\nHistory\nGrażyna Kulczyk's effort to build the Museum of Contemporary and Performance Arts at Stary Browar was rejected.\nAwards\n*2003 Gold Pencil in Architecture presented by Radio Merkury and Voice of Wielkopolska.\n*[http://www.icsc.org/ International Council of Shopping Centers] Best Shopping Center in the World in the  medium-sized commercial buildings category. Prize awarded on 9 December 2005 during a gala celebration in Phoenix in Arizona.\n*International Council of Shopping Centers award for the best shopping center in Europe in the category of medium-sized commercial buildings.\nExpansion of the Old Brewery\nThe new wing of the Old Brewery, similar size to the already existing portion opened March 11, 2007.  The new wing has six storeys including three underground levels. A parking lot for 1200 cars was built under the building. The courtyard between the two parts of the Old Brewery was enclosed, so that is also used in the winter.\nControversy\nIn March 2008 the district court found the Mayor of Poznań Ryszard Grobelny guilty of causing the city budget to lose over PLN 7 million as a result of the sale of the Old Brewery property. According to the Public Prosecutor's Office the site was worth more than PLN 13 million. Officials subject to the President sold the parcel of land as a park without registering it as a shopping center development. A sentence has been waived by the Court of Appeal on November 27, 2008.\nTadeusz Dziuba, Wielkopolska governor, argued that the new wing of the Old Brewery was built in breach of contract.\nGallery\nBrowar Huggerów 01.jpg|Hugger Brewery dating back to 1876 in 1930\nFile:Stary Browar 20-08-2011 (08).jpg|New wing of the Stary Browar\nFile:Stary Browar, (cropped).JPG|Main entrance to the Stary Browar\nFile:Stary Browar 08.jpg|The Stary Browar from Półwiejska Street\nPoznan 10-2013 img19 Old Brewery.jpg|Stary Browar, view from the south\nFile:Dabrowskiego Park Poznan.JPG|Dąbrowski Park near Stary Browar\nFile:Poznań, Browar (4).jpg|Stary Browar Clock Tower\nFile:Stary Browar w Poznaniu widziany z Uniwersytetu Ekonomicznego.jpg|A view of Stary Browar from the 13th floor of Collegium Altum of the University of Economics\nFile:Poznań - Stary Browar 02.jpg|Interior of Stary Browar\nFile:Stary Browar 04.jpg|Stary Browar, Interior\nReferences\nExternal links\n* [http://www.starybrowar.pl Official website (in Polish)]\n* [http://starybrowar5050.com/en/ Official website in English]"
    }
  ]
}