{
  "content": [
    {
      "type": "text",
      "text": "# Star Wars: Galaxy's Edge\n\n| status1 = Operating\n| opened1 =\n| closed1 =\n| replaced1 = Big Thunder Ranch  (Frontierland)\n| replacement1 =\n| park2 = Disney's Hollywood Studios\n| coordinates2 =\n| status2 = Operating\n| opened2 =\n| closed2 =\n| replaced2 = Streets of America\n| replacement2 =\n| homepage =\n}}\n'Star Wars'': Galaxy's Edge' is a themed area inspired by the Star Wars'' franchise in Disneyland at the Disneyland Resort in Anaheim, California, and Disney's Hollywood Studios at the Walt Disney World Resort in Orlando, Florida. It encompasses  at each park, and is set in the village of Black Spire Outpost, on the remote frontier planet of Batuu, featuring attractions, shops, restaurants and entertainment.\nThe lands were announced on August 15, 2015, and construction at both parks began on April 14, 2016. The Disneyland version opened May 31, 2019, and Disney's Hollywood Studios' version opened August 29, 2019. Walt Disney Imagineering executive Scott Trowbridge supervised development and construction at both parks.\nHistory\nIn the early 2010s, Walt Disney Imagineering (WDI) had initially developed plans for a Star Wars-themed land at Disney's Hollywood Studios in Florida. Based on characters and settings from the original trilogy of Star Wars films, including Tatooine and Endor, the area was to have encompassed the park's Echo Lake area, replacing the Indiana Jones Stunt Spectacular and Sounds Dangerous attractions and incorporating the existing Star Tours – The Adventures Continue.\nIn 2014, the Walt Disney Company CEO and chairman Bob Iger slowed all of WDI's development on Star Wars-themed projects, postponing any creative development until the release of the sequel trilogy and anthology films. Iger explained: \"I slowed it all down so what we come forward with will have a blend of the past, present, and maybe the future.\"\nOn August 15, 2015, after a creative shift in design, a Star Wars-themed land for both Disney's Hollywood Studios and Disneyland was finally publicly announced by Iger at the D23 Expo. According to Iger, the unnamed land would be \"occupied by many inhabitants: humanoids, aliens, and droids ... the attractions, the entertainment, everything we create will be part of our storytelling. Nothing will be out of character or stray from the mythology.\" Bob Chapek, then-chairman of Walt Disney Parks and Resorts, stated that the land would \"introduce you to a Star Wars planet you've never seen before – a gateway planet located on the outer rim, full of places and characters familiar and not so familiar.\"\nIn an interview for the winter 2015 issue of the official Disney fan club publication Disney twenty-three, senior creative leader Scott Trowbridge stated:\nIn March 2016, Iger announced that construction on both versions of the land would begin the following month, in April 2016. Construction began at both locations on April 14, 2016.\nIn February 2017, Iger stated that the lands were scheduled to open in 2019 at both Disneyland and Hollywood Studios.\nIn July 2017, at the D23 Expo, Chapek revealed that the themed lands would be called Star Wars: Galaxy's Edge. Chapek also announced that the Disneyland version would open first.\nIn November 2017, Trowbridge announced that the planet portrayed by the land is called Batuu, which appears in the 2018 novel Star Wars: Thrawn: Alliances.\nIn May 2018, Trowbridge revealed the village in which the land is set would be called Black Spire Outpost, a location briefly mentioned in the 2018 film Solo: A Star Wars Story. It was also announced that the Disneyland version of the land would open in summer 2019, followed by the Disney's Hollywood Studios version in late fall 2019. The names of the two new attractions at each location were announced in November 2018, during the D23 Destination D event held at Walt Disney World. A five-issue comic miniseries by Marvel Comics introduced the area's location in April 2019. Iger announced the opening dates for both locations on March 7, 2019.\nThe Disneyland version was dedicated on May 29, 2019. In attendance at the dedication ceremony were Iger, Star Wars creator George Lucas, and series actors Mark Hamill, Harrison Ford, and Billy Dee Williams. The Disneyland version opened to the public on May 31, and because of its high popularity, a virtual queuing system was implemented on June 24. The land at Disney's Hollywood Studios opened on August 29, 2019.\nDesign\nWalt Disney Imagineering (WDI) designed the project in collaboration with the Lucasfilm Story Group, with Imagineer Scott Trowbridge supervising the project, Asa Kalama and Chris Beatty serving as executive creative directors, Bryshere Casiano as the structural engineer, and Lucasfilm's Pablo Hidalgo and designer Doug Chiang of Industrial Light & Magic (ILM) involved as consultants. Together, the team decided to set the lands on a new planet, located within the Outer Rim of the Unknown Regions. Described as a \"remote frontier outpost\", the planet Batuu has not previously appeared in other media, although it has existed within canon \"for thousands and thousands of years.\" The team chose to create a newly designed world instead of using an existing planet from the films, such as Tatooine or Hoth, because those locations evoked a pre-existing familiarity with guests, with Trowbridge explaining, \"We wanted to build new Star Wars stories, new Star Wars destinations.\" He says of the new planet,\nfound within Galaxy's Edge, pictured at Disney's Hollywood Studios]]\nDok-Ondar (portrayed through Audio-Animatronics) can be found inside the shop Dok-Ondar's Den of Antiquities, pictured at the Disneyland location.]]\nThe development team drew inspiration from real-world locations, including Istanbul, Morocco, Jerusalem and Egypt and traveled there to study the architecture, culture, and weather. The team also cited Ralph McQuarrie's concept art for the original Star Wars trilogy as a basis for the architecture and aesthetic look of the land. The landscape of Galaxy's Edge features -tall spires standing among the rockwork that are intended to be the petrified remains of massive trees of an ancient forest; Imagineers based this landscape from the Petrified Forest National Park in Arizona. WDI used in-house virtual reality programs to realize where to use forced perspective and place thematic details in relation to sightlines to hide the park's show buildings from guest view. Disney consciously modified traditional theme park attributes throughout the lands—such as having signs written in the fictional Aurebesh language rather than English, and omitting attraction marquees and Star Wars-branded merchandise—as a way of maintaining the natural theming of the land. Being located in California and Florida, both iterations of Galaxy's Edge are situated at different latitudes and also face in separate cardinal directions; Disneyland has an east–west orientation and Disney's Hollywood Studios has a north–south orientation. This contrast in layout means both locations receive different amounts of sunlight at various angles throughout the seasonal year. As a result, both locations were designed with distinct shades of paint and color palettes in mind.\nAt the time of their openings, both locations of Star Wars: Galaxy's Edge had one attraction: Millennium Falcon: Smugglers Run, which allows riders to control the Falcon during a \"customized secret mission\". This would be followed by Star Wars: Rise of the Resistance, that places guests into the middle of a battle between the First Order and the Resistance. Concept art depicted a full-size Millennium Falcon situated among alien buildings built into tall cliffs. Rise of the Resistance is a 28-minute long experience with more than 300 animated objects; housed within one of the largest show buildings Disney has ever built for a dark ride. Film actors Daisy Ridley, Oscar Isaac, John Boyega, Adam Driver, Domhnall Gleeson, and Kipsang Rotich reprised their roles in the attraction as Rey, Poe Dameron, Finn, Kylo Ren, General Hux, and the voice of Nien Nunb, respectively. Frank Oz also reprised the role as the voice of Yoda, for a vocal cameo in Savi's Workshop.\nIn addition, the area features Oga's Cantina, which was the first location in Disneyland Park to sell alcoholic drinks to the public. The cantina's music is provided by R-3X, a droid that was first seen as RX-24 (Captain Rex) in Star Tours, and is now the cantina's DJ. Paul Reubens returned to voice the droid.\nThe Black Spire Outpost marketplace contains a toy stall run by a Toydarian, an alien species that was seen on Tatooine in Episode I – The Phantom Menace. There is also a creature stall. A TIE Echelon, where Kylo Ren makes his daily appearance, was developed by Colin Trevorrow during his work on Episode IX before being replaced as the film's director. The Coca-Cola Company provided Star Wars-themed iterations of Coke products such as Coca-Cola, Sprite, Diet Coke, Dasani, Powerade, and Minute-Maid to be served in the lands.\nNarrative\nThe main story events of the land are set between the films Episode VIII – The Last Jedi and Episode IX – The Rise of Skywalker, and depicts the presence of both the First Order and Resistance. However, guests also have the opportunity to meet Star Wars characters from other timelines such as The Mandalorian and Grogu. Lucasfilm's Matt Martin stated that these characters are \"visiting Batuu in the time that you know them from the series—or somewhere close to it—and you're getting to meet them [then and] there\" and that Walt Disney Imagineering \"has a pretty good way of ensuring that those characters don't intrude on each other.\"\nMusic\nLongtime Star Wars composer John Williams returned to compose the main musical theme for Galaxy's Edge. Williams' theme is interpolated and arranged diversely throughout the land as ambient music, instead of in its traditional symphonic format. William Ross, who conducted the symphonic recording of the theme with the London Symphony Orchestra (LSO) on Williams' behalf, was also responsible for arranging Williams' original composition in different musical contexts for use. Ross and the LSO recorded nearly an hour of musical material at Abbey Road Studios in November 2018. The musical score for Smugglers Run and Rise of the Resistance attractions feature reprisals of previous Star Wars themes written by Williams, adapted and conducted by Ross. A five-minute symphonic suite was released digitally by Walt Disney Records on May 3, 2019. The suite was first heard in its entirety at Star Wars Celebration Chicago in 2019. In addition to Williams's score, 29 original songs were commissioned to the music team for use as ambience as well. On September 6, 2019, ''Star Wars: Galaxy's Edge Oga's Cantina: R-3X's Playlist #1'' was released by Walt Disney Records, featuring eighteen tracks heard at Oga's Cantina inside Galaxy's Edge. Music from ''Star Wars: Galaxy's Edge Oga's Cantina: R-3X's Playlist #1 was publicly played for the first time at Star Wars Celebration Chicago 2019.\nWilliams won the Grammy Award for Best Instrumental Composition for the Star Wars: Galaxy's Edge Symphonic Suite''.\nLocations\nDisneyland\nAt Disneyland, Galaxy's Edge is located in the northwest portion of the park, with three entries from Frontierland, Bayou Country (formerly Critter Country), and Fantasyland. As a result of the expansion, Disney closed Big Thunder Ranch and adjacent backstage areas, and purchased nearby properties to relocate the office and warehouse space that was on the land.\nOne of the backstage areas thus closed was Circle D Ranch, a facility for training and exercising the park's horses.  To replace it, Disney purchased an existing ranch in Norco, California and renovated the facility into the new Circle D Ranch, which opened in June 2017.  Since then, the park's horses have commuted to Disneyland in special trailers in groups of four at a time.  Each group spends three or four days working in the park (and resting in a backstage barn), then the horses are driven back to the Norco ranch.\nThe construction of Galaxy's Edge required a reconfigured route for the Disneyland Railroad and Rivers of America. A first look at how these changes would impact the park was revealed in January 2016, when concept art was released depicting the northern bank of the river after construction was completed. On January 11, 2016, several attractions in Frontierland and Critter Country were closed. Big Thunder Ranch closed permanently, including the multifunction event space, barbecue restaurant and petting zoo. Other attractions closed temporarily, including the Disneyland Railroad and Rivers of America. Tom Sawyer Island reopened on June 16, 2017, Fantasmic! reopened on July 17, while the Disneyland Railroad, Mark Twain Riverboat, Sailing Ship Columbia, and Davy Crockett Explorer Canoes all reopened on July 29. The land opened on May 31, 2019.\nIn October 2023, Walt Disney Imagineering conducted a play test with roaming BD-X droids in Galaxy's Edge at Disneyland. In 2024, the BD-X droids began making scheduled daily appearances in Galaxy's Edge during the park's \"Season of the Force\" event from April 5 through June 2.\nFor the 2024 \"Season of the Force\" event at Disneyland, a new nighttime show debuted titled, Fire of the Rising Moons, which uses selections from composer John Williams' Star Wars film scores for the park's fireworks shows viewed from within Galaxy's Edge. Fire of the Rising Moons remained in Galaxy's Edge after \"Season of the Force\" ended. For the 2025 \"Season of the Force\" event at Disneyland, it was announced that a new nighttime projection show titled Shadows of Memory: A Skywalker Saga was debuted on March 28, 2025 in Galaxy's Edge. Shadows of Memory: A Skywalker Saga remained in Galaxy's Edge after \"Season of the Force\" ended, while the projection effects was added to the updated version of fireworks spectacular show.\nDisney's Hollywood Studios\nAt Disney's Hollywood Studios, Galaxy's Edge is located in the southwest portion of the park, with two entries from Grand Avenue and Toy Story Land. Galaxy's Edge replaced the majority of the park's former Streets of America area, including the Lights, Motors, Action! Extreme Stunt Show and Honey, I Shrunk the Kids: Movie Set Adventure attractions, which closed on April 2, 2016, as well as the surrounding New York-San Francisco backlot facades, restaurants, and shops.\nThe remaining operating portion of Streets of America, containing Muppet*Vision 3D, and a surviving block of the New York facades, was rethemed as Grand Avenue, a Los Angeles-themed street. An earthen berm with a Figueroa Street themed-tunnel was constructed between Galaxy's Edge and Grand Avenue to divide and connect the two lands. The land opened on August 29, 2019.\nGalaxy's Edge in Hollywood Studios was accompanied by the Star Wars: Galactic Starcruiser themed hotel, which operated between March 1, 2022, and September 30, 2023. In July 2025, it was announced that the BD-X droids would make appearances in Galaxy's Edge from July 16 to August 30, 2025.\nAttractions\n* Star Wars: Millennium Falcon – Smugglers Run – a simulator ride in which guests pilot the Millennium Falcon. The attraction opened at Disneyland on May 31, 2019, and at Disney's Hollywood Studios on August 29, 2019.\n* Star Wars: Rise of the Resistance – a dark ride in which guests are involved in a battle between the First Order and the Resistance. The attraction opened at Disney's Hollywood Studios on December 5, 2019, and at Disneyland on January 17, 2020.\nReception\nThe Disneyland version was named one of Time magazine's \"World's Greatest Places 2019\". While the themed area initially drew crowds to the point of leaving the rest of Disneyland relatively empty, a drop in attendance after the first few months led to the resignation of Catherine Powell, who oversaw the U.S. themed areas. However, in October 2019, some visitors reported that Disney's Hollywood Studios area was crowded during their visit.\nRelated media\n| books          = ''Star Wars: Galaxy's Edge: Black Spire\n| novels         = A Crash of Fate\n| short_stories  = Star Wars: Myths and Fables\n| comics         = 5 issue mini-series\n| graphic_novels =\n| strips         =\n| magazines      =\n| films          =\n| shorts         =\n| tv             =\n| wtv            =\n| atv            =\n| tv_specials    =\n| tv_shorts      =\n| tv_films       =\n| dtv            =\n| plays          =\n| musicals       =\n| games          =\n| rpgs           =\n| vgs            =\n| radio          =\n| soundtracks    =\n| music          = John Williams composition\n| toys           =\n| attractions    =\n| otherlabel1    = Theme parks (pending)\n| otherdata1     =\n| otherlabel2    =\n| otherdata2     =\n| otherlabel3    =\n| otherdata3     =\n| otherlabel4    =\n| otherdata4     =\n| otherlabel5    =\n| otherdata5     =\n| otherlabel6    =\n| otherdata6     =\n| otherlabel7    =\n| otherdata7     =\n| otherlabel8    =\n| otherdata8     =\n| otherlabel9    =\n| otherdata9     =\n| website        =\n| footnotes      =\n| sp             =\n}}\nComics\nThe Black Spire Outpost is the focus of the tie-in five-issue miniseries Star Wars: Galaxy's Edge, published by Marvel Comics. It was written by Ethan Sacks with art by Will Sliney, and was published from April 2019 onward.\nProse fiction\n*Star Wars: Galaxy's Edge: Black Spire (or in abbreviated form, Black Spire) (Del Rey, September 2019) by Delilah S. Dawson was a tie-in novel in which General Leia Organa dispatches a spy to Batuu to look for possible Resistance allies.\n*In A Crash of Fate'', a young adult novel (Disney Lucasfilm Press) by Zoraida Córdova; childhood friends are reunited as they are chased by the planet's smugglers.\n*In Star Wars: Myths and Fables, a middle grade collection published by Disney Lucasfilm Press and written by George Mann, with art by Grant Griffin; includes two stories based on Batuu.\nTelevision\n*A two-hour behind-the-scenes TV special, titled ''Star Wars: Galaxy's Edge – Adventure Awaits, premiered on September 29, 2019.\n*Star Wars: Young Jedi Adventures featured two episodes set on Batuu, \"The Tale of the Short Spire\" and \"Caves of Batuu\".\nVirtual reality\nStar Wars: Tales from the Galaxy's Edge is a virtual reality experience for Oculus and PlayStation VR2 platforms.\nSee also\n* Pandora – The World of Avatar'', a themed land at Disney's Animal Kingdom.\n* Avengers Campus, a Marvel Cinematic Universe themed land at Disney California Adventure, Walt Disney Studios Park, and known as Stark Expo at Hong Kong Disneyland.\n* World of Frozen, a Frozen themed land at Hong Kong Disneyland and Tokyo DisneySea.\nReferences\nExternal links\n*[https://disneyland.disney.go.com/destinations/disneyland/star-wars-galaxys-edge/ Official Disneyland website]\n*[https://disneyworld.disney.go.com/destinations/hollywood-studios/star-wars-galaxys-edge/ Official Disney's Hollywood Studios website]"
    }
  ]
}