{
  "content": [
    {
      "type": "text",
      "text": "# Star Wars: The Black Series\n\n}}\nStar Wars: The Black Series (TBS) is a Star Wars toy line produced by Hasbro. It includes action figures, vehicles, Force FX lightsabers, and collectable items.\nThe action figures are based on characters from the movies, shows, books, comics, and video games from both the Expanded Universe and canon.\nAnnouncement\nStar Wars TBS was first announced by Hasbro in January 2013 in an article in USA Today written by Brian Truitt. Although this was not Hasbro's first foray into collectible 6\" action figures (with the sculpt and articulation of the line inspired by the company's own Marvel Legends series) it is the most recent. The line of toys was released in response to the hype around the release of Star Wars: The Force Awakens.\nProducts\n6-inch action figures\nThe first wave of 6-inch figures was released on August 1, 2013 and included four characters: Luke Skywalker (X-Wing Pilot), Darth Maul, R2-D2, and a Sandtrooper (Squad Leader).\n2013–2014\nThis series featured packaging with orange design details. The figures were released in four waves.\n2014–2015\nThis series features redesigned packaging with blue design details. Numbering was restarted, and the figures were released in five waves.\n2015–2020\nThis series features redesigned packaging with red design details. Numbering was restarted to focus around the releases of new films in the sequel trilogy and standalone Anthology series. As of September 2017, the figures have been released in twelve waves with more planned.\n2020–\nThis series features redesigned packaging with different color design details.\nArchive 6-inch action figures\nAt San Diego Comic-Con 2018, Hasbro revealed a new 6-inch line-up of Star Wars figures for fans who missed out on the original release of the figures called the Archive line. These figures have updated face print and have a grey packaging design.\nCredit Collection 6-inch action figures\nThis distinctive collection is inspired by the end credit images from THE MANDALORIAN including a special Galactic Credit accessory. Figures are repackaged from their original release but are sold on traditional bubble style packaging nostalgic of the original Kenner line. The first figure was released in Q3 of 2020.\nDeluxe 6-inch action figures\nThese figures were released with a vehicle or animal companion set.\nDeluxe singular 6-inch action figures\nThese figures are for larger than average height characters and come in a larger box with a different numbering system than the regular line and more accessories.\nCenterpieces\nA series of dioramas designed to display 6\" action figures. Each diorama comes with a stationary statue in scale with the other figures in the Black Series, as well as lights and electronics.\nExclusive 6-inch action figures\nHasbro has partnered with many companies to provide exclusive 6\" TBS figures to collectors. Hasbro has also released a number of exclusive figures only available at events like San Diego Comic Con (SDCC) and Star Wars Celebration.\n40th anniversary 6-inch action figures\nIn celebration of the 40th anniversary of the release of Star Wars: A New Hope, Hasbro announced the 6-inch Black Series Legacy Editions at the New York City Toy Fair in February 2017. First released in 2017, the series mirrored the original Kenner toy releases, including throwback packaging with cardboard backing and a plastic bubble containing the figure. The series reissued previous figures in the Black Series rather than updated models.\nThe Legacy Pack includes a display stand for 12 figures with a reversible cardboard backdrop. It is an homage to the \"Early Bird Kit\" pre-order for Star Wars figures by Kenner in 1977. Production was not going to meet the holiday season, so the pre-order promotion offered a certificate that could be sent in to claim 4 of the 12 initial figures of the toy line when they became available: Luke Skywalker, Princess Leia Organa, Artoo-Detoo (R2-D2), and Chewbacca. The kit included a cardboard backdrop, sticker sheet, club membership card, and the certificate. Figures were shipped beginning in February 1978.\nThe Empire Strikes Back 40th anniversary 6-inch action figures\nIn celebration of the 40th anniversary of the release of Star Wars: The Empire Strikes Back, Hasbro announced the 6-inch Black Series Legacy Editions at the New York City Toy Fair in February 2020. The series mirrored the original Kenner toy releases, including throwback packaging with cardboard backing and a plastic bubble containing the figure. The series reissued previous figures in the Black Series rather than updated models.\n3-3/4-inch action figures\nThe 3-3/4-inch scale figures were released in conjunction with the 6-inch figures. However, on September 4, 2015 Wal-Mart was announced as the exclusive provider for the 3-3/4-inch scale action figures. The first wave of Wal-Mart exclusive action figures was available in stores beginning October 2015, with pre-orders available for upcoming releases available that same month. There are still a limited amount of exclusives that are available outside of the U.S. based retailer.\nForce FX lightsabers\nThe movie quality lightsaber toys have gone through many changes over the years. They were originally released as FX-Lightsabers by the company Master Replicas, however, the product line was taken over by Hasbro in 2008 where the name changed to Signature FX-Lightsaber. The name was changed a final time when they were released under The Black Series to Force FX Lightsabers. They are high quality reproductions that light up and create sound effects when powered-on, powered-off, and when they impact objects.\nReferences"
    }
  ]
}