{
  "content": [
    {
      "type": "text",
      "text": "# Star Wars Weekends\n\n|founded       = 1997\n|dates         = May to June\n|genre         = Science fiction\n|website       =\n}}\n'Star Wars Weekends' was a festival held annually at the Disney's Hollywood Studios theme park of the Walt Disney World Resort. Included with park admission, the event typically occurred on Friday, Saturday and Sunday for four consecutive weekends in May and June and featured appearances by cast and crew members from Disney's Star Wars franchise created by George Lucas. Many original Disney characters also appeared dressed as Star Wars characters, such as Jedi Mickey, Minnie as Leia, Donald as a stormtrooper, Goofy as Darth Vader and R2-MK (Mickey Mouse stylized astromech droid).  The festival began in 1997 and had been held in 2000, 2001, and annually from 2003 until 2015. In November 2015, Disney discontinued the event due to construction of Star Wars: Galaxy's Edge and the larger daily presence Star Wars will have in the park onwards.\nEvents\n*Jedi Training: Trials of the Temple — Live show at the Rebels stage. Based on the teachings and practices of the fictional Jedi Knights from the Star Wars films, the show depends heavily on audience participation, focusing on children. Each participant is given a lightsaber replica and Jedi robes and is taught a routine set of swordfighting moves.\n*Star Wars: A Galactic Spectacular — A large-scale fireworks show complemented with John Williams' original music, voice and sound clippings from the Star Wars saga.\n*'Star Wars Parade' — features the 501st Legion and the Rebel Alliance parading in Stormtrooper costumes, along with numerous other Star Wars characters.\n*'''Snig and Oopla's Hyperspace Hoopla''' — Live show also at the stage in front of the Sorcerer's Hat (since Star Wars Celebration V's \"Last Tour to Endor\" event in August 2010). It is a dance-off show featuring Star Wars characters competing in groups against each other in a dance competition. It originally was held at the Rebels Stage from 2008-2010.  The show has 'retired' in 2014. In one 2013 show, Emperor Palpatine hijacked the show and renamed it \"Emperor Palpatine's Hyperspace Hoopla\", leading to a massive dance-off.\n*Behind the Force — A live show at the Premier Theater hosted by Ashley Eckstein. Guests are given a behind-the-scenes making of the Clone Wars series and Star Wars Rebels.\n*Obi-Wan & Beyond — A live 30-minute talk show at the Theater for the Stars hosted by James Arnold Taylor. Taylor demonstrates nearly 150 voices that he provides for famous Hollywood stars who are not available for projects as well as characters for television shows, animated films and video games.\n*Carbon Freeze Me — Interactive attraction located at ABC Sound Studio, where guests are able to have their face scanned and reproduced in a prism of carbonite, which is then available for purchase.\nImperial Stormtroopers parade near the [[Sorcerer's Hat during Star Wars Weekends.]]\nJawa, Greedo, Chewbacca and a stormtrooper take on the roles of the famous 1970s disco group The Village People and lead the crowd in the \"YMCA\" dance.]]\nChewbacca and a Jawa compete in the contest with [[Bee Gees'-styled disco moves during Star Wars Weekends.]]\nWarwick Davis and Anthony Daniels greet the large crowd as pyrotechnics are fired from the Rebel Stage.\nAppearances\n{| class=\"wikitable sortable\"  style=\"margin:auto; margin:auto;\"\n|-\n! Guest\n! Role\n! Year\n|-\n|Amy Allen\n|Aayla Secura\n|2004–08 2015\n|-\n|Kenny Baker\n|R2-D2\n|2000–01, 2007\n|-\n|Ahmed Best\n|Jar Jar Binks\n|2014\n|-\n|Don Bies\n|R2-D2 Operator\n|2005\n|-\n|Jerome Blake\n|Mas Amedda, Rune Haako\n|2004–05\n|-\n|Steven Blum\n|Zeb Orrelios\n|2014–15\n|-\n|Dee Bradley Baker\n|Captain Rex, Commander Cody and all other clone troopers Star Wars: The Clone Wars\n|2010–14\n|-\n|Phil Brown\n|Owen Lars\n|2001\n|-\n|Michonne Bourriague\n|Aurra Sing\n|2003, 2012\n|-\n|Jeremy Bulloch\n|Boba Fett\n|2000–01, 2003–04, 2006–15\n|-\n|Silas Carson\n|Nute Gunray, Ki-Adi-Mundi\n|2012, 2015\n|-\n|Rob Coleman\n|Animation Supervisor\n|2005\n|-\n|Doug Chiang\n|Design Director\n|2001\n|-\n|Jim Cummings\n|Hondo Ohnaka\n|2013\n|-\n|Anthony Daniels\n|C-3PO\n|2003, 2004, 2007, 2011\n|-\n|Warwick Davis\n|Wicket W. Warrick the Ewok, Wald\n|1997, 2000–01, 2003–10, 2013–15\n|-\n|Troy Denning\n|Author of Star Wars expanded universe novels\n|2008\n|-\n|Ashley Eckstein\n|Ahsoka Tano\n|2009–15\n|-\n|Dave Filoni\n|Clone Wars Director\n|2008–12\n|-\n|Carrie Fisher\n|Princess Leia Organa\n|2000–01\n|-\n|Warren Fu\n|Concept Artist\n|2005\n|-\n|Nika Futterman\n|Asajj Ventress, Clone Wars\n|2012\n|-\n|Brian Gernand\n|Model Supervisor\n|2005\n|-\n|John Goodson\n|Concept Model Maker\n|2005\n|-\n|Mark Hamill\n|Luke Skywalker\n|2014\n|-\n|Tom Kane\n|Yoda, Star Wars: The Clone Wars\n|2010–13\n|-\n|Jay Laga'aia\n|Captain Typho\n|2006, 2009\n|-\n|Matt Lanter\n|Anakin Skywalker, Clone Wars\n|2009, 2011, 2014\n|-\n|Jake Lloyd\n|Young Anakin Skywalker\n|2000, 2004–2005, 2008, 2012\n|-\n|Daniel Logan\n|Young Boba Fett\n|2004–05, 2007–08, 2010–12, 2015\n|-\n|George Lucas\n|Creator of Star Wars\n|2011; Appeared for the Star Tours: The Adventures Continue opening ceremony\n|-\n|Vanessa Marshall\n|Hera Syndulla\n|2014–15\n|-\n|Peter Mayhew\n|Chewbacca\n|2001 2004–09, 2010–11, 2013–15\n|-\n| Iain McCaig\n|Illustrator and conceptual drawer\n|2000\n|-\n| Ian McDiarmid\n| Palpatine / Darth Sidious\n| 2015\n|-\n|Rick McCallum\n|Prequel trilogy producer\n|2006\n|-\n|Temuera Morrison\n|Jango Fett\n|2003, 2006, 2010\n|-\n|Frank Oz\n|Yoda, theatrical films and Star Wars Rebels\n|2015\n|-\n|Ray Park\n|Darth Maul\n|2007, 2009–15,\n|-\n|Lorne Peterson\n|Chief model maker\n|2010\n|-\n|Bonnie Piesse\n|Young Beru Lars\n|2007\n|-\n|David Prowse\n|Darth Vader\n|2000, 2008-09\n|-\n|Hugh Quarshie\n|Captain Panaka\n|2000\n|-\n|Mike Quinn\n|Nien Nunb\n|2001, 2004\n|-\n|John Ratzenberger\n|Major Derlin\n|2014\n|-\n|Tim Rose\n|Admiral Ackbar\n|2013\n|-\n|Steve Sansweet\n|Author/Fan Relations\n|2008, 2009\n|-\n|Andy Secombe\n|Watto\n|2004, 2012\n|-\n|Orli Shoshan\n|Shaak Ti\n|2006\n|-\n|Tiya Sircar\n|Sabine Wren\n|2014–15\n|-\n|Catherine Taber\n|Padmé Amidala, Clone Wars\n|2012, 2014\n|-\n|James Arnold Taylor\n|Obi-Wan Kenobi, Plo Koon, Clone Wars\n|2009–15\n|-\n|Billy Dee Williams\n|Lando Calrissian\n|2003, 2010, 2013–14\n|-\n|Ryder Windham\n|Author of Star Wars: The Ultimate Visual Guide\n| 2009\n|-\n|Sam Witwer\n|Galen Marek, Darth Maul, Clone Wars\n|2013\n|-\n|Matthew Wood\n|General Grievous, Bib Fortuna, Ody Mandrell, Seboca, Magaloof; Prequel Sound Supervising Sound Editor\n|2005–06, 2009–10\n|}\nAttractions\nJedi Training Academy\nJedi Training Academy originally was a part of Star Wars Weekend and only took place during it. However, in October 2006 it began appearing as a stand-alone show at Disneyland. In 2008, the Walt Disney World version began operating year-round.\nCharacter appearances\nIn addition to traditional Disney characters dressed in their Star Wars costumes, a number of Star Wars characters from the films and television series appear for photo opportunities and autograph signing.  Characters have included Clone Wars' Captain Rex, Ahsoka Tano, Queen Amidala, Aurra Sing, Boba Fett, Figrin D'an and the Modal Nodes, Princess Leia, Luke Skywalker, R2-D2, C-3PO, Chewbacca (often has a sack containing a busted C-3PO), Clonetroopers, Darth Maul, Darth Vader, Ewoks, Jango Fett, Jawas, Palpatine, Shaak Ti, Greedo, Stormtroopers, Tusken Raiders, Kit Fisto, Mace Windu, Anakin Skywalker, Boushh and Zam Wesell.  Most appearances are in preset locations in front of themed backdrops but some characters freely roam the parks and pose for photos with guests as well.\nSee also\n* Star Wars Celebration\n* Star Tours\n* Star Tours – The Adventures Continue\nReferences\nExternal links\n*"
    }
  ]
}