{
  "content": [
    {
      "type": "text",
      "text": "# StarHub TVB Awards\n\n}}\nThe StarHub TVB Awards () is an awards ceremony held every year to recognise the achievements by Hong Kong television dramas and artists in Singapore. The awards are presented by StarHub, VV Drama, and E City, and are given for TVB productions and performances. The inaugural StarHub TVB Awards were held on 29 January 2010.\nThe nominations for StarHub TVB Awards are jointly determined by StarHub and TVB for TVB programmes shown on VV Drama, E City, TVBJ and TVB First on Demand throughout the designated year. The final results are decided by online voting (70%) and a panel of professional judges (30%).\n2010\nThe StarHub TVB Awards 2010 were held on 29 January 2010 at The Ritz-Carlton Millenia Singapore. Singaporean radio presenter Wenhong Huang and 2001 Miss Hong Kong Pageant second runner-up Heidi Chu hosted the awards ceremony, presenting a total of 18 awards.. The ceremony aired on VV Drama on 14 February 2010.\n2011\nThe StarHub TVB Awards 2011 were held on 16 July 2011 at Marina Bay Sands in Singapore, hosted by Astrid Chan and King Kong Lee. The ceremony aired on VV Drama on 24 July 2011.\n2012\nThe StarHub TVB Awards 2012 were held on 18 August 2012 at Marina Bay Sands Expo and Convention Centre in Singapore, hosted by Astrid Chan and King Kong Lee. 30 awards from 19 categories were presented. The ceremony aired on VV Drama on 25 August 2012.\n2013\nThe StarHub TVB Awards 2013 were held on 28 September 2013 at Marina Bay Sands Grand Theatre in Singapore, hosted by King Kong Lee and Elaine Yiu. 20 categories were presented. The ceremony aired on TVB8 and StarHub's VV Drama on 5 October 2013.\n2014\nThe StarHub TVB Awards 2014 were held on 11 October 2014 at Marina Bay Sands in Singapore, hosted by Carol Cheng and Derek Li. 17 categories were presented. The ceremony was broadcast live on StarHub's VV Drama.\n2015\nThe StarHub TVB Awards 2015 were held on 24 October 2015 at Marina Bay Sands in Singapore, hosted by Carol Cheng, Derek Li, and Amigo Choi. The ceremony aired on TVB Jade on 1 November 2015.\n2016\nThe StarHub TVB Awards 2016 was held on 22 October 2016 at Marina Bay Sands in Singapore. It was hosted by Carol Cheng and FAMA\n2017\nThe StarHub TVB Awards 2017 was held on 21 October 2017 at Marina Bay Sands in Singapore. It was hosted by Lawrence Cheng and Mayenne Mak\nSee also\n* List of Asian television awards\nReferences\nExternal links\n*[https://web.archive.org/web/20160915143818/http://www.starhubtvbawards.com/ Official website]"
    }
  ]
}