{
  "content": [
    {
      "type": "text",
      "text": "# State-owned enterprises of the United Kingdom\n\nState-owned enterprises of the United Kingdom are organisations owned or controlled by the public sector that trade as market producers. In UK statistics, the Office for National Statistics (ONS) classifies market-producing entities under public control as public corporations, using control indicators and a \"50% market test\". Other publicly owned entities that are non-market are classified to central or local government. The statistical classification is distinct from legal form, which may be a Companies Act company, a statutory corporation or a body created by royal charter.\nState ownership exists at central, devolved and local levels in the United Kingdom. Centrally owned examples include broadcasters, investment vehicles and infrastructure bodies; devolved holdings include rail, water and transport undertakings in Scotland, Wales and Northern Ireland. Channel 4 remained publicly owned following a 2023 government review and reforms.\nAs of , the Department for Transport’s holding group, DfT Operator Limited (DFTO), manages seven train operating companies in England under operator of last resort arrangements in the Railways Act 1993. Recent transfers saw South Western Railway (25 May 2025), c2c (20 July 2025) and Greater Anglia (12 October 2025) join London North Eastern Railway (2018), Northern Trains (2020), Southeastern (2021) and TransPennine Express (2023). DFTO replaced the former DfT OLR Holdings name in December 2024 and runs services under time-limited Service Agreements rather than franchises.\nRecent changes include energy-system and nuclear-decommissioning reforms and the creation of new central investment bodies. The National Energy System Operator, a public corporation, took on system-operation functions on 1 October 2024; the Great British Energy Act 2025 established Great British Energy; the UK Infrastructure Bank was renamed National Wealth Fund Limited on 14 October 2024; and Magnox Ltd, a subsidiary of the Nuclear Decommissioning Authority, adopted the corporate name Nuclear Restoration Services in April 2024.\nTerminology and scope\nIn UK economic statistics, the Office for National Statistics (ONS) classifies units to the public sector where the public sector has control over an entity’s general policy or programme, assessed against a set of control indicators. Market-producing units under public control are classified as public corporations using a \"50% market test\" that compares sales with production costs. Non-market units are classified to central or local government. Statistical classification is distinct from legal form, which in the UK may be a Companies Act company, a statutory corporation or a body created by royal charter.\nAdministrative labels used in UK government, such as executive agencies and non-departmental public bodies, describe governance and accountability rather than sector classification. Such bodies are included here only where they also meet the statistical test for a market producer under public control. Most agencies and NDPBs are non-market and are therefore out of scope for this list.\nFor this article, inclusion covers four categories. First, ONS-classified public corporations. Second, central-government-owned companies and statutory or chartered corporations where ministers exercise control. Third, devolved equivalents controlled by devolved ministers. Fourth, local authority trading companies where a local or combined authority exercises control. Exclusions include public–private partnerships and joint ventures where government does not control general corporate policy, and cases where the state holds only a minority or special share without control. Such interests may be noted separately as strategic holdings.\nControl does not require day-to-day intervention or majority ownership. It may arise from rights such as appointing or removing directors, vetoes over key decisions or statutory powers. Minority shareholdings or special shares do not imply control in the absence of such indicators.\nHistory overview\nEarly public corporations and municipal undertakings (to 1945)\nPublic ownership in the UK took root through chartered bodies, statutory corporations and municipal enterprises that delivered utilities and transport. Local authorities developed electricity and tram undertakings, while central government used statutory boards in sectors such as broadcasting and transport. These models combined public accountability with trading income and provided the template for later nationalisations.\nPost-war nationalisation and sectoral consolidation (1945 to 1951)\nThe post-war government extended public ownership across banking, coal, inland transport, electricity, gas and steel. The Bank of England was nationalised in 1946 under the Bank of England Act 1946. Large statutory corporations were created to run the major utilities and transport systems with ministerial sponsorship and borrowing powers.\nRestructuring and a mixed ownership model (1951 to 1979)\nLater governments adjusted the scope and structures of state industries. There were reorganisations in transport and utilities and debates about performance and investment constraints. The period ended with case-by-case rescues in sectors under pressure, which prompted new instruments for public stakes.\nCrisis nationalisations and the National Enterprise Board (1970s)\nThe Industry Act 1975 established the National Enterprise Board to take and manage public shareholdings for industrial policy and rescues. Interventions included support for British Leyland and the creation of state groups in aircraft and shipbuilding under the Aircraft and Shipbuilding Industries Act 1977. The approach relied on company-law vehicles alongside statutory corporations and raised questions about stewardship and competition.\nPrivatisation and market reforms (1979 to 1997)\nFrom 1979 the government pursued a sustained programme of privatisation across telecoms, gas, electricity, airlines, steel, water and airports. Ownership moved to the private sector, while sector regulators and price controls replaced direct ministerial direction. The break-up of state conglomerates and utility restructuring set the framework for later market regulation.\nRail franchising and the public backstop (1990s to 2000s)\nThe Railways Act 1993 introduced franchising for passenger services and created a duty on the state to secure services if a franchise failed or ended. Infrastructure passed from British Rail to Railtrack, which entered railway administration in 2001. Network Rail took ownership in 2002. In 2013 the ONS decided that Network Rail would be classified to the public sector from 1 September 2014 under ESA 2010, which moved its debt onto the public balance sheet. The operator of last resort duty became the mechanism for continuity of service when contracts failed or expired.\nThe financial crisis and temporary bank ownership (2008 to 2012)\nThe state took temporary stakes in several banks to stabilise the system. Resolution actions covered Northern Rock and Bradford & Bingley, and the government took large holdings in Lloyds Banking Group and what is now NatWest Group. In 2008 the government created UK Financial Investments to manage these shareholdings, which later moved into UK Government Investments. Exits proceeded over subsequent years, with the final NatWest shares sold in May 2025.\nReclassification and new public bodies (2013 to 2020)\nSector boundaries shifted through statistical decisions and organisational reforms. English housing associations were classified to the public sector in 2015 then returned to the private sector in 2017 after governance changes. Royal Mail was floated in 2013 and the Post Office remained a state-owned company under the Postal Services Act 2011. Trading funds were reorganised into government-owned companies in some cases, including Ordnance Survey in 2015, and the strategic highways authority became National Highways in 2015 as a government-owned company under the Infrastructure Act 2015.\nNew instruments in the 2020s: development banks, system operators and targeted stakes\nNew entities focused on financing, infrastructure and system operation. The UK Infrastructure Bank was established in 2021 and was renamed National Wealth Fund Limited in October 2024. In the energy system the National Energy System Operator began operations as a public corporation on 1 October 2024. The Great British Energy programme gained statutory footing in 2025. The Department for Transport increased use of the operator of last resort and renamed its owning group DfT Operator Limited in December 2024.\nDevolution and divergence across the UK\nAfter devolution, ownership models diverged. Scottish Water remained in public ownership under the Water Industry (Scotland) Act 2002, while water and sewerage services in England and Wales were privatised under the Water Act 1989. In Northern Ireland, Northern Ireland Water was created as a government-owned company in 2007 and has been classified by the ONS to central government on a non-market basis. Rail operations in Scotland and Wales moved into devolved owning groups for public operation of passenger services.\nClassification shifts and control tests in practice\nAcross these periods, statistical treatment often changed without a conventional purchase or sale. The ONS applies control indicators and a market-producer test to decide whether an entity is a public corporation or part of central or local government. Decisions such as the 2014 reclassification of Network Rail and the 2015 to 2017 changes for English housing associations demonstrate how governance and revenue structures affect classification and the count of state-owned enterprises.\nCurrent state-owned enterprises (central government)\nThis section lists central government state-owned enterprises that meet the Office for National Statistics tests for public control and, where relevant, the market-producer test for public corporations, together with government-owned companies created under the Companies Act. It excludes devolved and local bodies, which appear later, and private operators under contract. Definitions are set out in Terminology and scope.\nBroadcasting and culture\n* British Broadcasting Corporation — statutory corporation established by Royal Charter, a public service broadcaster operating as a public corporation, sponsored by the Department for Culture, Media and Sport. As of , the Charter and Framework govern the BBC’s independence and funding arrangements.\n* Channel 4 — statutory corporation and public service broadcaster, remains in public ownership following the 2023 government review, sponsored by DCMS.\n* S4C — statutory corporation providing Welsh-language television, sponsored by DCMS with funding arrangements set out in its framework documents.\nFinance and investment\n* National Wealth Fund Limited — government-owned company headquartered in Leeds, formerly the UK Infrastructure Bank and renamed on 14 October 2024, shareholder functions sit with HM Treasury.\n* British Business Bank — government-owned public limited company providing finance programmes for smaller businesses, sponsored by the Department for Business and Trade.\n* British International Investment — government-owned public limited company and the UK’s development finance institution, shareholder is the Foreign, Commonwealth and Development Office.\n* UK Government Investments — government-owned company acting as the centre of government ownership expertise, shareholder is HM Treasury.\n* Reclaim Fund — public body company administering the Dormant Assets Scheme, owned by HM Treasury and regulated by the Financial Conduct Authority.\nEnergy and resources\n* National Energy System Operator — public corporation responsible for electricity and gas system operation in Great Britain, created by transfer from National Grid ESO on 1 October 2024 following Ofgem and DESNZ decisions.\n* Great British Energy — state-owned company established by the Great British Energy Act 2025 to invest in clean power projects, sponsored by DESNZ.\n* Great British Energy – Nuclear — government company leading civil new-build and fuel cycle projects, rebranded from Great British Nuclear in December 2024.\n* United Kingdom National Nuclear Laboratory — government-owned national laboratory for civil fission, classified as a public corporation and sponsored by DESNZ.\n* Nuclear Restoration Services — Nuclear Decommissioning Authority group company, formerly Magnox Ltd, responsible for decommissioning the Magnox fleet.\n* Nuclear Waste Services — NDA subsidiary providing radioactive waste management services, including delivery of the Geological Disposal Facility programme.\n* Sellafield Ltd — NDA subsidiary and site licence company managing the Sellafield site in Cumbria.\nTransport and infrastructure\n* Network Rail — company limited by guarantee responsible for railway infrastructure in Great Britain, reclassified to the public sector in 2014 and treated as part of central government by the ONS.\n* National Highways — government-owned company for England’s strategic roads, launched as Highways England on 1 April 2015 and renamed National Highways in 2021, sponsored by the Department for Transport.\n* High Speed Two (HS2) Ltd — government-owned company delivering elements of the high-speed rail programme, sponsored by the Department for Transport.\n* East West Railway Company — government-owned company developing the Oxford–Cambridge rail link, sponsored by the Department for Transport.\n* London & Continental Railways — government-owned property and regeneration company focused on rail-related assets, sponsored by the Department for Transport.\n* DfT Operator — the Department for Transport holding group for operator of last resort train companies, operates services under time-limited Service Agreements rather than franchises.\nRegisters and services\n* Ordnance Survey — government-owned company since 2015 providing national geospatial data, sponsored by the business department.\n* UK Hydrographic Office — trading fund supplying hydrographic and marine geospatial services, sponsored by the Ministry of Defence.\n* Met Office — the UK’s national meteorological service, classified as a public corporation and sponsored by the science department.\n* The Royal Mint — government-owned company producing UK coinage and operating commercial precious-metals businesses, shareholder functions are exercised by HM Treasury.\n* Student Loans Company — government-owned company administering student finance, sponsored by the Department for Education and devolved administrations.\n* Civil Aviation Authority — statutory regulator of civil aviation and a public corporation, sponsored by the Department for Transport.\n* Genomics England — company wholly owned by the Department of Health and Social Care providing genomic services for the NHS and research access to de-identified data.\n* NHS Professionals — company wholly owned by the Department of Health and Social Care providing temporary staffing and workforce services to the NHS.\n* Porton Biopharma — Department of Health and Social Care-owned biopharmaceutical company associated with UKHSA’s Porton site, status under review in 2025 reporting.\nOperator of Last Resort\nUnder section 30 of the Railways Act 1993, the Department for Transport (DfT) must ensure continuity of passenger services if a franchise or contract ends or is terminated. The DfT fulfils this duty through DfT Operator Limited (DFTO), a government-owned holding group that manages state-run operators under time-limited service agreements rather than franchises. DFTO was known as DfT OLR Holdings Limited until a name change recorded in December 2024.\nAs of , DFTO manages the following train operating companies, with the date each entered public operation:\n* London North Eastern Railway — 24 June 2018.\n* Northern Trains — 1 March 2020.\n* Southeastern — 17 October 2021.\n* TransPennine Trains — 28 May 2023.\n* South Western Railway — 25 May 2025.\n* C2c — 20 July 2025.\n* Greater Anglia — 12 October 2025.\nDevolved governments operate separate publicly owned arrangements outside DFTO. Scottish Rail Holdings took ScotRail into public ownership on 1 April 2022 and the Caledonian Sleeper on 25 June 2023. In Wales, Transport for Wales Rail took over the Wales and Borders services on 7 February 2021. These are covered in the devolved administrations section.\nNorthern Ireland Executive\nCurrent\n* Translink — trading brand of the state-owned Northern Ireland Transport Holding Company (NITHC), a statutory corporation sponsored by the Department for Infrastructure. NITHC owns the operating companies NI Railways, Ulsterbus and Citybus (Metro).\n** Metro (Belfast) — Belfast bus network operated by Citybus Ltd, a NITHC subsidiary.\n** Ulsterbus — regional bus operator under NITHC ownership.\n** NI Railways — passenger rail operator owned through NITHC.\n* Northern Ireland Water — government-owned company providing water and sewerage services across Northern Ireland, created in 2007 and classified to central government for budgeting and funding.\n* Belfast Harbour Commissioners — statutory public trust port for Belfast, with board appointments by the Department for Infrastructure.\n* Londonderry Port and Harbour Commissioners — statutory trust port for the River Foyle based at Lisahally.\n* Warrenpoint Harbour Authority — statutory trust port at Carlingford Lough.\n* Coleraine Harbour Commissioners — statutory trust port at the River Bann.\nFormer\n* ILEX Urban Regeneration Company — urban regeneration company for Derry~Londonderry established in 2003, dissolved on 13 October 2020.\nRelated bodies\n* Ulster Supported Employment — executive non-departmental public body and company limited by guarantee delivering supported employment services. Included here as a related body rather than a public corporation.\nScottish Government\nCurrent\n* Caledonian Maritime Assets — company wholly owned by the Scottish Ministers that owns ferries and harbour infrastructure used on the Clyde and Hebrides and Northern Isles networks; sponsored by Transport Scotland.\n* David MacBrayne — company wholly owned by the Scottish Ministers that owns operating subsidiaries providing lifeline ferry services under public service contracts let by Transport Scotland.\n** Caledonian MacBrayne — ferry operator trading as CalMac Ferries on the Clyde and Hebrides network, operated under contract to Transport Scotland through David MacBrayne subsidiaries.\n* Ferguson Marine — shipyard at Port Glasgow taken into public ownership in 2019 and retained by the Scottish Ministers through Ferguson Marine (Port Glasgow) Holdings Ltd.\n* Highlands and Islands Airports — company wholly owned by the Scottish Ministers that operates airports across the Highlands and Islands and at Dundee and Inverness.\n* Glasgow Prestwick Airport — airport owned by the Scottish Ministers through Prestwick Aviation Holdings Ltd since 2013.\n* Scottish Water — public corporation providing water and wastewater services in Scotland, established by the Water Industry (Scotland) Act 2002 and owned by the Scottish Ministers.\n* Scottish Canals — operating name of the British Waterways Board in Scotland, a Scottish public corporation managing canals and associated assets on behalf of the Scottish Ministers.\n* Scottish National Investment Bank — development bank established by the Scottish National Investment Bank Act 2020, wholly owned by the Scottish Ministers.\n* Scottish Rail Holdings — company wholly owned by the Scottish Ministers that owns the rail operating companies listed below.\n** ScotRail — passenger services brought into public ownership on 1 April 2022.\n** Caledonian Sleeper — overnight services brought into public ownership on 25 June 2023.\n* Crown Estate Scotland — statutory public corporation managing the Scottish Crown Estate assets, established by the Scottish Crown Estate Act 2019.\nFormer\n* BiFab — fabrication company in which the Scottish Government held an equity stake from 2017; the business entered administration in 2020 and its yards were subsequently sold in 2021.\nRelated bodies\n* Scottish Futures Trust — company limited by guarantee wholly owned by the Scottish Ministers that provides infrastructure investment and programme advisory services. It is a non-departmental public body and is not generally treated as a market public corporation.\nWelsh Government\nCurrent\n* Transport for Wales — company limited by guarantee wholly owned by the Welsh Ministers that plans and manages public transport services; it owns the Core Valley Lines rail infrastructure and lets operating contracts.\n** Transport for Wales Rail — government-owned operator of last resort that took over the Wales and Borders rail services on 7 February 2021.\n* Development Bank of Wales — development finance institution, a public limited company wholly owned by the Welsh Ministers, providing debt and equity to Welsh businesses.\n* WGC Holdco Ltd (Cardiff Airport) — holding company through which the Welsh Ministers have owned Cardiff Airport since 2013.\n* Global Centre of Rail Excellence — Welsh Government-owned company developing a rail testing and innovation facility in Powys and Neath Port Talbot.\n* Cwmni Egino — Welsh Government company established to support the delivery of nuclear development at Trawsfynydd.\n* Adnodd Cyf — national company created by the Welsh Government to commission high-quality bilingual educational resources for schools and colleges in Wales.\n* Careers Choices Dewis Gyrfa Ltd — Welsh Government-owned company delivering the all-age careers information, advice and guidance service in Wales.\n* Life Sciences Hub Wales — company limited by guarantee wholly owned by the Welsh Ministers to stimulate growth of the life sciences sector and support NHS innovation adoption.\n* Meat Promotion Wales — Welsh Ministers’ levy body for the red meat sector, operating as Hybu Cig Cymru under statutory orders.\n* Design Commission for Wales — arm’s-length company limited by guarantee promoting good design in the built environment, sponsored by the Welsh Government.\n*  Centre for Digital Public Services — company limited by guarantee established by the Welsh Government to improve digital capability across public services.\n* National Academy for Educational Leadership — company limited by guarantee funded by the Welsh Government to support leadership in education.\nFormer\n* none listed.\nRelated bodies\n* Trydan Gwyrdd Cymru — publicly owned renewable energy developer announced by the Welsh Government; company establishment and programme delivery are in progress, with details published through policy updates. Placeholders here pending operational status.\nLocal government companies\nMunicipal companies in the United Kingdom are \"local authority trading companies\" (LATCos) and other corporate vehicles wholly or jointly owned by local or combined authorities. They are typically established under the Local Authorities (Companies) Order 1995 and related powers, sometimes operating in-house under the procurement \"Teckal\" exemption. The lists below give notable examples by nation. Entries are limited to corporate entities. Transport authorities and branded networks that are not companies are listed separately as related bodies.\nCompanies owned by municipalities of England\n* Blackpool Transport – municipal bus operator (Blackpool Council).\n* Ipswich Buses – municipal bus operator (Ipswich Borough Council).\n* Nottingham City Transport – municipal bus operator (majority owned by Nottingham City Council).\n* Reading Buses – municipal bus operator (Reading Borough Council).\n* Warrington's Own Buses – municipal bus operator (Warrington Borough Council).\n* Manchester Airports Group – airports holding company (64.5% owned by the ten Greater Manchester councils via Manchester City Council and the other nine councils).\n* Newcastle International Airport – public-private partnership: 51% owned by seven North East local authorities (LA7) and 49% by the private partner.\n* Cornwall Airport Newquay – owned by Cornwall Council and operated by Cornwall Airport Limited (wholly council-owned).\n* Portsmouth International Port – municipally owned and operated port (Portsmouth City Council).\n* The Bottle Yard Studios – film and TV studios owned by Bristol City Council.\nRelated public bodies (not companies)\nThese are transport authorities, branded networks or systems rather than corporate LATCos.\n* Transport for Greater Manchester – combined authority transport executive; owns the Manchester Metrolink system and lets operating concessions.\n* Merseytravel – transport executive of the Liverpool City Region Combined Authority.\n* Transport for West Midlands – transport arm of the West Midlands Combined Authority; includes West Midlands Metro network brand.\n* West Yorkshire Metro – public transport brand of the West Yorkshire Combined Authority.\n* Nexus – Tyne and Wear transport executive (successor to the Tyne & Wear Passenger Transport Executive); administers the Tyne and Wear Metro.\n*  – independent charity/company that formerly ran council leisure venues under contract; operations transferred to a private operator in 2024.\n* South Yorkshire Passenger Transport Executive – abolished; transport functions integrated into the South Yorkshire Mayoral Combined Authority in 2023.\nGreater London Authority companies\n* Transport for London – GLA functional body; group parent for transport subsidiaries including London Underground.\n* GLA Land and Property – GLA subsidiary land and development company.\n* London Power – energy supplier brand/company wholly owned by the GLA and delivered in partnership with Octopus Energy.\nCompanies owned by municipalities of Scotland\n* Lothian Buses – municipal bus operator (majority owned by the City of Edinburgh Council; minority stakes held by Midlothian, East Lothian and West Lothian councils).\n* Transport for Edinburgh – council-owned holding/oversight company for buses and trams in Edinburgh.\n* Orkney Ferries – council-owned inter-island ferry company (Orkney Islands Council).\n* SIC Ferries – Shetland Islands Council ferries undertaking for inter-island services.\nRelated public bodies (not companies)\n* Strathclyde Partnership for Transport – statutory regional transport partnership; not a company.\n* Strathclyde Buses – former municipal bus company; acquired by FirstGroup in the 1990s (listed under \"Former\" if needed).\nCompanies owned by municipalities of Wales\n* Cardiff Bus – municipal bus operator (Cardiff Council).\n* Newport Bus – municipal bus operator (Newport City Council).\nCompanies owned by municipalities of Northern Ireland\n* City of Derry Airport – owned by Derry City and Strabane District Council.\nProposed bodies\nThis section lists central proposals that have formal government documentation. Entries remain here until legislation has passed and the body is operational.\n* Great British Railways — planned arm’s length public body intended to act as a single \"guiding mind\" for Great Britain’s railways by bringing together infrastructure management with most passenger services in England and by setting fares and timetables. The concept was set out in the Williams–Shapps plan and remains a live government programme. As of , the government has consulted on a Railways Bill, the 2024 King’s Speech confirmed legislation in this session, and ministers have stated that a bill to establish GBR will be introduced with the aim of the body becoming operational roughly twelve months after Royal Assent. The previous Great British Railways Transition Team ceased in March 2025 and preparatory work is now led from the Department for Transport and industry teams.\nFormer state-owned enterprises\nThis section summarises major United Kingdom state-owned enterprises that left the public sector through privatisation, restructuring or disposal. Entries are grouped by sector with brief status notes and dates, fuller histories are linked from each article.\nUtilities and communications\n* British Telecommunications — converted to a public limited company by the British Telecommunications Act 1984 and sold in stages from 1984 and 1991.\n* British Gas — transferred to private ownership under the Gas Act 1986, creating Centrica and related successor bodies over time.\n* Electricity industry (England and Wales) — generation and supply functions privatised under the Electricity Act 1989 with the break-up of the Central Electricity Generating Board and the flotation of regional electricity companies; transmission moved to the National Grid Company plc.\n* Water industry (England and Wales) — the ten water and sewerage authorities were transferred to private companies at flotation in 1989; Scotland retained public ownership via Scottish Water.\n* British Steel — corporatised and privatised under the British Steel Act 1988, later becoming part of Corus Group.\n* British Coal — mining operations wound up or transferred under the Coal Industry Act 1994 following earlier closures and sales of non-core activities.\nTransport\n* British Rail — restructured and assets transferred under the Railways Act 1993, with passenger services franchised to private operators, Railtrack created for infrastructure, and later replacement by Network Rail after Railtrack entered administration in 2001.\n* British Airways — transferred to British Airways plc by the British Airways Act 1983 and privatised by share sale in 1987.\n* BAA — airports authority corporatised and privatised under the Airports Act 1986; later Heathrow Airport Holdings.\n* National Bus Company — state holding company for bus undertakings in England and Wales, disposed of by a programme of sales in the late 1980s and early 1990s.\nPostal and mapping\n* Royal Mail — legislation in the Postal Services Act 2011 enabled an initial public offering in 2013 and subsequent sell-down of the government’s remaining stake.\nBanking and finance (temporary ownership)\n* Northern Rock and Bradford & Bingley — taken into temporary public ownership during the 2007–2009 banking crisis, with assets managed and sold down through government holding companies overseen by UK Financial Investments (later UK Government Investments).\n* Lloyds Banking Group and RBS/NatWest — large shareholdings acquired during the crisis and subsequently sold down over time, with the final NatWest exit completed in May 2025.\n}}"
    }
  ]
}