{
  "content": [
    {
      "type": "text",
      "text": "# State and official visits to the United Kingdom\n\nand Elena Ceaușescu with Queen Elizabeth II and Prince Philip, Duke of Edinburgh at Buckingham Palace during a visit in the UK, June 1978]]\nState and official visits to the United Kingdom are formal visits by a head of state of a country to the United Kingdom and are hosted by the British Sovereign. They are royal events using assets of the Civil Service, the Royal Household and the Household Division. Usually other members of the Royal Family participate, with activities centred on London. Formal invitations are sent by the Royal Household via the Foreign, Commonwealth and Development Office.\nThere are no formal State visits between the United Kingdom and the 14 other Commonwealth realms, as the realms all share a common monarch and head of state. Visits conducted by the monarch to another Commonwealth realm are also not considered state visits but rather royal visits. In addition, official visits to the United Kingdom by another Commonwealth realm are typically performed by their respective governor general, who in that capacity is usually in the country for an audience with the King.\nHistory\nin London]]\nOne of the more notable as well as earliest instances of a state visit to the British Isles is the Grand Embassy of Peter the Great, which was a diplomatic mission to Western Europe in 1697 and 1698 led by Peter the Great of the Russian Empire. The modern pomp and ceremonial came about in the early 19th century. Examples of this new protocol in action included the Allied sovereigns' visit to England in June 1814. Queen Victoria hosted Napoleon III for a state visit at Windsor Castle in 1855, although it consisted of more informal arrangements. Very few formal state visits to the country took place prior to the reign of Queen Elizabeth II in the 20th century. One of those few state visits included one by Kaiser Wilhelm II during the reign of his uncle Edward VII in 1907.\nOrder of events\nArrival\nHistorically, dignitaries would usually arrive at Gatwick Airport and take the Royal Train to Victoria station. The monarch, typically accompanied by other members of the Royal Family, would greet them here and then lead them by carriage to Buckingham Palace.\nToday, most dignitaries arrive at London Heathrow Airport, although there are cases of visitors arriving at London Stansted Airport instead. They are usually greeted on behalf of the King by a member of the Royal family and the UK Foreign Secretary.\nThe dignitary and the monarch then ride down The Mall in a state carriage (usually the 1902 State Landau) escorted by the Household Cavalry with street liners coming from battalions of the Foot Guards. Union Flags and the flags of the visiting country are usually draped on both sides of the road.\nArrival ceremony and guard of honour\n, 3 June 2019.]]\nAn arrival ceremony usually takes place on Horse Guards Parade (although there have also been some instances where it has taken place at Buckingham Palace,  Windsor Castle or the Palace of Holyroodhouse) with a Guard of Honour being provided by members of the King's Guard (usually found from one of the five regiments of foot guards: Grenadier Guards, Coldstream Guards, Scots Guards, Irish Guards, and the Welsh Guards). Prior to a welcoming ceremony at Windsor Castle, the state guest receives a welcome at Datchet railway station with the Household Cavalry Mounted Regiment and its mounted band. Following the performance of the national anthems, first of the visiting country and then God Save the King (although the former is the sole piece that played most of the time), the commander of the guard of honour formation, usually a junior officer, will always report to the dignitary in the language of the visitor, with the report being along the lines of the following:\n::'\"Your Excellency, the guard of honour, provided by the (states name of unit), is formed up, and ready for inspection.\"''\nAfter the report, the band plays a slow march while the formation of company size is inspected. If the sovereign is present, the State Colour from the regiment's 1st Battalion is dipped during the playing of the anthem.\nDepending on the area where the ceremony takes place, there will be a march past immediately after the inspection. If it takes place on Horse Guards Parade, then the foreign guest and the King travel to Buckingham Palace in a carriage procession escorted by a large number of mounted soldiers from the Household Cavalry. The welcome ceremony is accompanied by 21-gun salutes fired from Green Park and the Tower of London. Exceptions to this included Chinese leader Xi Jinping who was received with a 41-gun salute in Green Park and a simultaneous 62-gun salute at the Tower of London and City of London (103 guns in total).\nIn recent years, Windsor Castle has hosted arrival ceremonies from President Thabo Mbeki of South Africa, King Abdullah II of Jordan, President Barack Obama, Queen Margrethe II of Denmark and President Emmanuel Macron. During the Queen of Denmark's visit, the guard of honour was provided by the Princess of Wales's Royal Regiment, a unit of which she is Colonel in Chief. Guards of honour have also been accorded for visiting dignitaries who are in the country on official or even working visits, including Soviet leaders Nikita Khrushchev and Mikhail Gorbachev in 1956 and 1989 respectively as well as US President Donald Trump in 2018. Upon returning home from his visit, Trump falsely claimed that the Queen, who accompanied him during his inspection of the 1st Battalion, Coldstream Guards at Windsor Castle, \"reviewed her Honor Guard for the first time in 70 years\", although at the time she had only been sovereign for 65 years. The largest guard of honour to be formed up for a state visit was in 2003 during the visit of President George W. Bush and First Lady Laura Bush, when there was an arrival ceremony in the forecourt of Buckingham Palace, in which the Household Cavalry and the King's Troop were paraded in front of the visiting dignitaries.\nInformal events upon meeting the sovereign\n.]]\nDignitaries have an informal lunch with the King before viewing the Royal Collection's artefacts and exchanging gifts with the Royals.\nGovernment meetings\nHassan Mohamud with Prime Minister David Cameron during his visit to the United Kingdom in February 2013]]\nAfter all royal meetings are held, the visitor then engages in meetings with leaders of His Majesty's Government, beginning with the Prime Minister of the United Kingdom at 10 Downing Street. In many of these meetings, multi-million pound business agreements are settled upon. Meetings are also held with the Leader of the Opposition, the leaders of other parties represented in the House of Commons, and members of the British Cabinet. In June 1978, Nicolae Ceaușescu made a state visit to the UK where a £200m licensing agreement was signed between the Romanian government and British Aerospace for the production of more than eighty BAC One-Eleven aircraft, which was said to be at the time the biggest civil aircraft agreement between two countries.\nWestminster\nSpeech to Parliament\n.]]\nThe visiting head of state, upon the King's request, may also be given the chance to give an address to both chambers of the British Parliament assembled on the halls of the House of Lords in joint session. He/she addresses members of both chambers on the importance of political, military, economic and cultural ties shared by his/her home country with the millions of people of the United Kingdom. The joint speech is presided by the Speaker of the House of Commons in coordination with the Lord Speaker of the House of Lords. The first foreign dignitary to undertake such a reception was French President Albert Lebrun in March 1939 and most recently was under taken by Emmanuel Macron of France.\nWreath laying ceremony\nHeads of state from over 70 countries have laid wreaths at The Unknown Warrior during state visits.\nState dinner\nand Michelle Obama at Buckingham Palace in 2011]]\nand Prince Albert lead the guests into the Waterloo Chamber of Windsor Castle, c. 1844.]]\nState dinners are held at Buckingham Palace in London and on occasion at Windsor Castle in Berkshire, should the visitors stay there. Around 150 guests are invited to the white tie event at the ballroom in Buckingham Palace for the banquet; the room has a maximum capacity of 170 diners. Guests are typically members of the Royal Family, members of the visiting delegation, British politicians and notable figures from both countries. Preparations for the state dinner are the responsibility of the Master of the Household and begin months in advance. The seating chart for the event is confirmed both by the King and by the Foreign, Commonwealth and Development Office. During the dinner, honours and decorations of both heads of state are worn and both speeches are checked extensively by the FCDO.\nThe preparation of food begins closer to the start of the dinner to ensure the food is still fresh by the time it reaches the table. This also means that every dish is prepared by hand from scratch. The meal spans over four courses that include: fish, main course, pudding and dessert. Each place setting has six glasses (for water, red and white wine, dessert wine, champagne and port) and up to a dozen pieces of cutlery. The menu is chosen by the King from a choice of four presented by the royal kitchen. Alcoholic drinks come from the Government Wine Cellar, while the food is prepared by chefs of the Royal Household. Large silver-gilt dishes and vessels (neither of which are ever used during the ceremony) are arranged in tiers on the central table.\nVisits to Scotland\nThey are usually hosted by the either the King or the First Minister of Scotland on this visit. When hosted by the King, the visitor stays at the Palace of Holyroodhouse. When hosted by the Scottish Government, the visitor holds bilateral meetings at St Andrew's House.\nDuring the visit, a speech to the Scottish Parliament is given in the chamber, being broadcast on Parliament TV with the Presiding Officer of the Parliament being the host.\nPrevious visits to the parliament have included:\n*April 2018 –  Peter Mutharika – President of Malawi\n*June 2016 – Michael D. Higgins – President of Ireland\n*March 2016 – John Mahama – President of Ghana\n*March 2013 –  Joyce Banda – President of Malawi\n*October 2007 – Stjepan Mesić – President of Croatia\n*January 2007 – Ólafur Ragnar Grímsson – President of Iceland\n*November 2006 – Lech Kaczyński – President of Poland\n*July 2006 – Valdas Adamkus – President of Lithuania\n*July 2006 – Arnold Rüütel – President of Estonia\n*November 2005 – Bingu wa Mutharika – President of Malawi\n*January 2005 –  Svetozar Marović – President of Serbia and Montenegro\n*February 2002 – Jorge Sampaio – President of Portugal\n*June 2001 – Thabo Mbeki – President of South Africa\n*May 2000 – Bakili Muluzi – President of Malawi\n*September 2000 – Jerry Rawlings – President of Ghana\nin Westminster Abbey in 2014]]\nDonald Trump with Queen Elizabeth II during the review of the Coldstream Guards at Windsor Castle during the official visit of the former to the United Kingdom in 2018]]\nlands at Winfield House carrying Barack and Michelle Obama in 2009.]]\nwith Philip, Duke of Edinburgh and Tobeka Madiba-Zuma]]\nNumber of state visits\nduring Putin's official visit to the United Kingdom in 2003]]\nThe reigning monarch will usually host one or two state visits per year. Queen Elizabeth II hosted 113 state visits during her time as monarch from 1952 until her death in 2022. King Charles III has hosted six state visits since his accession in 2022\n{| class=\"sortable wikitable\"\n! rowspan=2|Countries\n! colspan=7|State visits hosted by\n|-\n! Victoria(1837–1901)\n! Edward VII(1901–1910)\n! George V(1910–1936)\n! George VI(1936–1952)\n! Elizabeth II(1952–2022)\n! Charles III(Since 2022)\n! Total (Since 1844)\n|-\n|\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| 1 (1928)\n| style=\"text-align:center;background:lightgrey;\"| none\n| 1 (1971)\n| style=\"text-align:center;background:lightgrey;\"| none\n| 2 (1928, 1971)\n|-\n|\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| 1 (1966)\n| style=\"text-align:center;background:lightgrey;\"| none\n| 1 (1966)\n|-\n|  Bahrain\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| 1 (1984)\n| style=\"text-align:center;background:lightgrey;\"| none\n| 1 (1984)\n|-\n|\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| 1 (1921)\n| 1 (1937)\n| 1 (1963)\n| style=\"text-align:center;background:lightgrey;\"| none\n| 3 (1921, 1937, 1963)\n|-\n|\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| 3 (1976, 1997, 2006)\n| style=\"text-align:center;background:lightgrey;\"| none\n| 3 (1976, 1997, 2006)\n|-\n|\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| 1 (1992)\n| style=\"text-align:center;background:lightgrey;\"| none\n| 1 (1992)\n|-\n|\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| 1 (1965)\n| style=\"text-align:center;background:lightgrey;\"| none\n| 1 (1965)\n|-\n|\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| 3 (1999, 2005, 2015)\n| style=\"text-align:center;background:lightgrey;\"| none\n| 3 (1999, 2005, 2015)\n|-\n|\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| 1 (2016)\n| style=\"text-align:center;background:lightgrey;\"| none\n| 1 (2016)\n|-\n|\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| 1 (1927)\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| 1 (1927)\n|-\n|\n| style=\"text-align:center;background:lightgrey;\"| none\n| 1 (1907)\n| style=\"text-align:center;background:lightgrey;\"| none\n| 1 (1951)\n| 2 (1974, 2000)\n| style=\"text-align:center;background:lightgrey;\"| none\n| 4 (1907, 1951, 1974, 2000)\n|-\n|\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| 1 (1954)\n| style=\"text-align:center;background:lightgrey;\"| none\n| 1 (1954)\n|-\n|\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| 2 (1969, 1995)\n| style=\"text-align:center;background:lightgrey;\"| none\n| 2 (1969, 1995)\n|-\n|\n| 2 (1844, 1855)\n| 2 (1903, 1908)\n| 3 (1913, 1919, 1927)\n| 2 (1939, 1950)\n| 5 (1960, 1976, 1984, 1996, 2008)\n| 1 (2025)\n| 15 (1844, 1855, 1903, 1908, 1913, 1919, 1927, 1939, 1950, 1960, 1976, 1984, 1996, 2008, 2025)\n|-\n|\n| 1 (1891)\n| 1 (1907)\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| 4 (1958, 1972, 1986, 1998)\n| style=\"text-align:center;background:lightgrey;\"| none\n| 6 (1891, 1907, 1958, 1972, 1986, 1998)\n|-\n|\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| 1 (2007)\n| style=\"text-align:center;background:lightgrey;\"| none\n| 1 (2007)\n|-\n|  Greece\n| style=\"text-align:center;background:lightgrey;\"| none\n| 1 (1905)\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| 1 (1963)\n| style=\"text-align:center;background:lightgrey;\"| none\n| 2 (1905, 1963)\n|-\n|\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| 1 (2010)\n| style=\"text-align:center;background:lightgrey;\"| none\n| 1 (2010)\n|-\n|\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| 1 (1999)\n| style=\"text-align:center;background:lightgrey;\"| none\n| 1 (1999)\n|-\n|\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| 3 (1963, 1990, 2009)\n| style=\"text-align:center;background:lightgrey;\"| none\n| 3 (1963, 1990, 2009)\n|-\n|\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| 2 (1979, 2012)\n| style=\"text-align:center;background:lightgrey;\"| none\n| 2 (1979, 2012)\n|-\n|\n| 2 (1873, 1889)\n| style=\"text-align:center;background:lightgrey;\"| none\n| 1 (1919)\n| style=\"text-align:center;background:lightgrey;\"| none\n| 1 (1959)\n| style=\"text-align:center;background:lightgrey;\"| none\n| 4 (1873, 1889, 1919, 1959)\n|-\n|\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| 1 (1933)\n| style=\"text-align:center;background:lightgrey;\"| none\n| 1 (1956)\n| style=\"text-align:center;background:lightgrey;\"| none\n| 2 (1933, 1956)\n|-\n|\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| 1 (2014)\n| style=\"text-align:center;background:lightgrey;\"| none\n| 1 (2014)\n|-\n|\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| 1 (1997)\n| style=\"text-align:center;background:lightgrey;\"| none\n| 1 (1997)\n|-\n|\n| style=\"text-align:center;background:lightgrey;\"| none\n| 1 (1903)\n| 1 (1924)\n| style=\"text-align:center;background:lightgrey;\"| none\n| 4 (1958, 1969, 1990, 2005)\n| style=\"text-align:center;background:lightgrey;\"| none\n| 6 (1903, 1924, 1958, 1969, 1990, 2005)\n|-\n|\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| 1 (1921)\n| style=\"text-align:center;background:lightgrey;\"| none\n| 2 (1971, 1998)\n| 1 (2024)\n| 4 (1921, 1971, 1998, 2024)\n|-\n|\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| 2 (1966, 2001)\n| style=\"text-align:center;background:lightgrey;\"| none\n| 2 (1966, 2001)\n|-\n|\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| 1 (1979)\n| style=\"text-align:center;background:lightgrey;\"| none\n| 1 (1979)\n|-\n|\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| 2 (1995, 2012)\n| style=\"text-align:center;background:lightgrey;\"| none\n| 2 (1995, 2012)\n|-\n|\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| 1 (1962)\n| style=\"text-align:center;background:lightgrey;\"| none\n| 1 (1962)\n|-\n|\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| 1 (1972)\n| style=\"text-align:center;background:lightgrey;\"| none\n| 1 (1972)\n|-\n|\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| 1 (1985)\n| style=\"text-align:center;background:lightgrey;\"| none\n| 1 (1985)\n|-\n|\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| 2 (1974, 1993)\n| style=\"text-align:center;background:lightgrey;\"| none\n| 2 (1974, 1993)\n|-\n|\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| 4 (1973, 1985, 2009, 2015)\n| style=\"text-align:center;background:lightgrey;\"| none\n| 4 (1973, 1985, 2009, 2015)\n|-\n|\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| 1 (1987)\n| style=\"text-align:center;background:lightgrey;\"| none\n| 1 (1987)\n|-\n|\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| 2 (1960, 1980)\n| style=\"text-align:center;background:lightgrey;\"| none\n| 2 (1960, 1980)\n|-\n|\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| 1 (1950)\n| 3 (1972, 1982, 2018)\n| style=\"text-align:center;background:lightgrey;\"| none\n| 4 (1950, 1972, 1982, 2018)\n|-\n|\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| 3 (1973, 1981, 1989)\n| style=\"text-align:center;background:lightgrey;\"| none\n| 3 (1973, 1981, 1989)\n|-\n|\n| style=\"text-align:center;background:lightgrey;\"| none\n| 1 (1906)\n| style=\"text-align:center;background:lightgrey;\"| none\n| 1 (1951)\n| 4 (1962, 1988, 1994, 2005)\n| style=\"text-align:center;background:lightgrey;\"| none\n| 6 (1906, 1951, 1962, 1988, 1994, 2005)\n|-\n|  Oman\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| 1 (1982)\n| style=\"text-align:center;background:lightgrey;\"| none\n| 1 (1982)\n|-\n|\n| 1 (1867)\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| 1 (1867)\n|-\n|\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| 1 (1966)\n| style=\"text-align:center;background:lightgrey;\"| none\n| 1 (1966)\n|-\n|\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| 2 (1991, 2004)\n| style=\"text-align:center;background:lightgrey;\"| none\n| 2 (1991, 2004)\n|-\n|\n| style=\"text-align:center;background:lightgrey;\"| none\n| 2 (1904, 1909)\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| 3 (1955, 1978, 1993)\n| style=\"text-align:center;background:lightgrey;\"| none\n| 5 (1904, 1909, 1955, 1978, 1993)\n|-\n|\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| 2 (1985, 2010)\n| 1 (2024)\n| 3 (1985, 2010, 2024)\n|-\n|\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| 1 (1924)\n| 1 (1938)\n| 1 (1978)\n| style=\"text-align:center;background:lightgrey;\"| none\n| 3 (1924, 1938, 1978)\n|-\n|\n| 1 (1874)\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| 1 (2003)\n| style=\"text-align:center;background:lightgrey;\"| none\n| 2 (1874, 2003)\n|-\n|  Sardinia\n| 1 (1855)\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| 1 (1855)\n|-\n|\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| 4 (1967, 1981, 1987, 2007)\n| style=\"text-align:center;background:lightgrey;\"| none\n| 4 (1967, 1981, 1987, 2007)\n|-\n|\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| 1 (1988)\n| style=\"text-align:center;background:lightgrey;\"| none\n| 1 (1988)\n|-\n|\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| 1 (2014)\n| style=\"text-align:center;background:lightgrey;\"| none\n| 1 (2014)\n|-\n|\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| 3 (1996, 2001, 2010)\n| 1 (2022)\n| 4 (1996, 2001, 2010, 2022)\n|-\n|\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| 2 (2004, 2013)\n| 1 (2023)\n| 3 (2004, 2013, 2023)\n|-\n|\n| style=\"text-align:center;background:lightgrey;\"| none\n| 1 (1905)\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| 2 (1986, 2017)\n| style=\"text-align:center;background:lightgrey;\"| none\n| 3 (1905, 1986, 2017)\n|-\n|  Sudan\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| 1 (1964)\n| style=\"text-align:center;background:lightgrey;\"| none\n| 1 (1964)\n|-\n|\n| style=\"text-align:center;background:lightgrey;\"| none\n| 1 (1908)\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| 2 (1954, 1975)\n| style=\"text-align:center;background:lightgrey;\"| none\n| 3 (1908, 1954, 1975)\n|-\n|\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| 1 (1975)\n| style=\"text-align:center;background:lightgrey;\"| none\n| 1 (1975)\n|-\n|\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| 1 (1960)\n| style=\"text-align:center;background:lightgrey;\"| none\n| 1 (1960)\n|-\n|\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| 3 (1967, 1988, 2011)\n| style=\"text-align:center;background:lightgrey;\"| none\n| 3 (1967, 1988, 2011)\n|-\n|\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| 2 (1989, 2013)\n| style=\"text-align:center;background:lightgrey;\"| none\n| 2 (1989, 2013)\n|-\n|\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| 3 (2003, 2011, 2019)\n| 1 (2025)\n| 4 (2003, 2011, 2019, 2025)\n|-\n|\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| 1 (1973)\n| style=\"text-align:center;background:lightgrey;\"| none\n| 1 (1973)\n|-\n|  Zambia\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| 1 (1983)\n| style=\"text-align:center;background:lightgrey;\"| none\n| 1 (1983)\n|-\n|\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| style=\"text-align:center;background:lightgrey;\"| none\n| 1 (1994)\n| style=\"text-align:center;background:lightgrey;\"| none\n| 1 (1994)\n|}\nControversies\nduring President Bush's visit to London, June 2008]]\nMany controversies have arisen from visits to the United Kingdom, particularly in relation to the human rights record of the visitor:\n* 1971 – Emperor Hirohito of Japan undertook a state visit to the UK during a time in which anti-Japanese sentiment was rampant, partially due to the emperor's wartime status as head of state. As a result, he was greeted by angry veterans and former British POWs, who notably protested through standing in silence as his open horse-drawn carriage passed through London. Thousands of protesters lined the route to Buckingham Palace, with some turning their back and wearing red gloves to symbolise the British war dead. Others whistled \"Colonel Bogey\" by Kenneth J. Alford, which was a popular march during the war. During Hirohito's visit, the satirical magazine Private Eye used a racist double entendre to refer to the emperor's visit (\"nasty Nip in the air\").\n* 1978 – Romanian President Nicolae Ceaușescu was the first communist head of state to visit the UK. Despite the Queen's public display of protocol, privately she had thought they had \"blood on their hands\". As a result, she took steps to avoid meeting the Ceaușescus, with royal author Robert Hardman reporting that: \"she decided the best course of action was to hide behind a bush rather than conduct polite conversation\". The Queen also received a call from French President Giscard d’Estaing warning her with an account of their recent stay in Paris, during which the Communist Romanian guests had looted their living quarters and had even hacked holes in the walls while searching for bugging devices. The day before Ceaușescu's execution, he was stripped of his honorary GCB (Knight Grand Cross of the Most Honourable Order of the Bath) status, and the insignia of the Order of the Star of the Socialist Republic of Romania that Ceaușescu had bestowed upon the Queen during the visit was returned.\n* 2003 – Protests occurred during the visit of President Vladimir Putin as human rights activists were against Russian involvement in the Second Chechen War. There were also outcries over Russian support for the Iranian nuclear programme. During Putin's visit to Edinburgh, a protester was arrested after he ran in front of the president's motorcade along the Royal Mile.\n* 2003 – November 2003 marked the state visit of George W. Bush to the UK, during which he was met by anti-war protests in London, attracting 100,000 to 200,000 people. The protests culminated in the toppling of an effigy of Bush in Trafalgar Square. One protester was arrested after attempting to throw an egg at the presidential motorcade. Up to £5 million was reportedly spent on beefing up security for the four-day visit, which included calls for both Bush and Prime Minister Tony Blair to resign over the Iraq conflict.\n* 2015 – A few days after the state visit by Xi Jinping to the United Kingdom, photographs produced by Amnesty UK showed cargo boxes that revealed \"that the Chinese embassy has been shipping in flags, hats, T-shirts and other pro-China merchandise as diplomatic baggage in order to put on a show of strength and support for the visiting President\". This was done to counter activists of Falun Gong and the Tibetan independence movement who convened to demonstrate against China's human rights abuses in Tibet Autonomous Region. In May 2016, Queen Elizabeth II was caught in camera making a remark that the Chinese \"were very rude to the ambassador\" during the visit and that it was \"bad luck\" for the Metropolitan police commander Lucy D'Orsi to be responsible for security during the event.\n* 2018 – There were protests during the visit of Saudi Crown Prince Mohammed bin Salman as human rights activists protested war crimes committed during the Saudi Arabian–led intervention in Yemen.\n* 2019 – There was a mass protest movement against the 2019 visit of US President Donald Trump. When the idea of a visit was first mooted there was a massive opposition response, including over 1.8m people signing a petition addressed to the UK government demanding that \"he should not be invited to make an official State Visit'. This is still amongst the largest ever petitions in the UK. After a visit was announced in 2018, protests were held with over 250,000 taking part in a march in London, and over 400,000 across the entirety of the UK, by people expressing their opposition and making clear that Trump was not welcome. A key feature of the protest was a giant inflatable Donald Trump baby balloon representing Trump as a baby in a nappy (diaper).  When the visit did finally take place there was another large protest march in London.  During the 2019 protest the Donald Trump baby balloon flew again, along with miniature versions, one of which was attacked by a pro-Trump supporter, who was arrested and charged.  The balloon subsequently went on tour, making several appearances in the United States and others in France, Argentina, Ireland and Denmark at protests also against Trump.\nIn popular culture\n*Guarding the Queen, a documentary published by the BBC, covered the actions of the troops of the Household Division, which included the preparations for the state visit of the President of Ghana John Kufuor in 2007.\nSee also\n* List of state visits received by Edward VII\n* List of state visits received by George V\n* List of state visits received by George VI\n* List of state visits received by Elizabeth II\n* List of state visits received by Charles III\n* List of state and official visits by Canada\n* United States presidential visits to the United Kingdom and Ireland\nNotes\nReferences\nExternal links\n*[https://m.youtube.com/watch?v=fp85zRg2cwg President Obama Addresses the British Parliament]\n*[https://m.youtube.com/watch?v=otkCfacn_Uw President Trump inspects the troops at Buckingham Palace | UK visit]\n*[https://m.youtube.com/watch?v=uKTUUtBarDg UK: WINDSOR CASTLE: DANISH QUEEN'S STATE VISIT]\n*[https://m.youtube.com/watch?v=D1v6kTKlRKc WRAP Bush and Royals arrive for ceremony at Buckingham Palace]\n*[https://www.youtube.com/watch?v=wCNhjpRbH34 Video of Trump State Banquet, 2019]"
    }
  ]
}