{
  "content": [
    {
      "type": "text",
      "text": "# Staten Island Republican Party\n\n| name             = Staten Island Republican Party\n| logo             = Staten Island Republican Logo.png\n| leader1_title    = Chairman\n| leader1_name     = Michael Tannousis\n| foundation       =\n| headquarters     = 2300 Richmond Road, Staten Island, NY 10306\n| ideology         = Conservatism\n| position         =\n| national         = Republican Party\n| regional         = New York Republican State Committee\n| student_wing     =\n| youth_wing       =\n| membership_year  =\n| membership       =\n| seats1_title     = New York State Assembly (Staten Island Seats)\n| seats1           = }}\n| seats2_title     = New York State Senate (Staten Island Seats)\n| seats2           = }}\n| seats3_title     = Citywide Executive Offices\n| seats3           = }}\n| seats4_title     = New York City Council (Staten Island Seats)\n| seats4           = }}\n| seats5_title     = United States House of Representatives (Staten Island Seats)\n| seats5           = }}\n| colors           = |border=darkgray}} Red\n| website          =\n| state            = New York\n| country_dab1     = Politics of New York City\n| elections_dab1  = Elections in New York City\n}}\nThe Staten Island Republican Party, abbreviated SIGOP, is a regional affiliate of the United States Republican Party for the borough of Staten Island in New York City, New York.\nLeadership\nAs with all county affiliates of the New York Republican State Committee, the Staten Island Republican Party is governed by the Richmond County Republican Committee, whose chairman is the chairman of the county's party and selected by members of the Committee. The current chairman is Michael Tannousis and his chief operating officer is former chairman Anthony Reinhart.\nHistory\nIn the 21st Century, Staten Island has stood apart from the other boroughs of New York City as a conservative and Republican stronghold in an otherwise liberal and progressive Democratic Party-dominated city. As such, the Island's Republican party has had success in borough-wide elections, and has nearly consistently won the island's congressional seat.\n2008 elections\nIn 2008 it was discovered that Vito Fossella, the Representative from New York's 13th congressional district and the only Republican representing New York City, was arrested for a DUI and had a second secret family in Virginia. Fossella declined to seek reelection in 2008. The Staten Island Republican Chairman John Friscia tapped Frank Powers to run for the seat and replace Fossella. However, Powers' son would actively campaign against him, and he would die on the campaign trail just months before the election. As such the party scrambled to nominate Robert A. Straniere, a member of the New York State Assembly, to run, but he would lose to Democrat Michael McMahon who got 60.9% of the vote.\n2010 elections\nIn 2010, Chairman Friscia shocked most of the party and Republican establishment in the city by trying to tap Fossella to run again. The move was opposed by almost every executive within the party, and the Brooklyn Republican Party, who also have a say in the candidate. Additionally, then mayor Rudy Giuliani opposed a Fossella comeback, endorsing Michael G. Grimm who would go on to win the party's primary after Fossella declined to run.\n2015 elections\nMichael G. Grimm, a former FBI agent that investigated fraud, was an incumbent United States Representative for the 11th District and was indicted of mail fraud and wire fraud for his part in a scheme running a fraudulent health food store. Grimm initially sought to retain his seat, and the Staten Island GOP was seemingly in favor of this, however, he ultimately decided to resign and a special election was called.\nThe 2015 special election saw Dan Donovan, the incumbent Staten Island District Attorney run unopposed in the Republican primaries. Donovan would defeat Vincent J. Gentile, a member of the New York City Council for the 43rd District (in Brooklyn) with 58.33% of the vote to his 40.11%.\nAnother special election, this time to replace Donovan as District Attorney saw Michael E. McMahon, a former congressmen who represented the 13th District from 2009 to 2011, seemingly win in the primaries, as the Borough's Republican party offered no candidate themselves. However, shortly before the deadline to become a candidate, Joan Illuzzi, a prosecutor known for the Etan Patz case, cold called the party's chairman to appear on the ballot, and then win the nomination unopposed. Illuzzi was seeking to become the first female district attorney of Staten Island, however, McMahon would win with 55% of the vote to Illuzzi's 45%, ending 11 years of Republican hold on the district attorney's office.\n2018 elections\nPrior to the elections in 2018, Brendan Lantry was named the new party chairman in April. Lantry was the chairman of the committees legal council, has been a Jewish community leader, and a longtime practicing lawyer.\nDuring the 2018 United States House of Representatives elections, the Staten Island Democratic Party launched a concerted effort to defeat Dan Donovan and flip New York's 11th congressional district, using the endorsement from then President Donald Trump, which he proudly flaunted, against him. They succeeded, electing Max Rose to the house with 53% of the vote.\n2019 elections\nThe Staten Island Republican Party chose not to contest Democratic District Attorney Michael E. McMahon, who would be re-elected unopposed to another 4-year term. The move upset many within the party's committee, however, the executive stated that they didn't run a candidate due to McMahon's reputation of being a moderate, and putting a challenge against him would result in the island's Democrats running more progressive candidates, and due to the simple fact that no suitable and qualified candidate could be found to challenge McMahon.\n2020 elections\nIn the 2020 United States presidential election, the Borough's margin in favor of the Republicans increased by 9,000 voters, cementing the borough's status as a conservative stronghold in the city. The party also earned the ire of the city's and state's establishment for loudly opposing the COVID-19 lockdowns imposed on the borough engaging in widespread civil disobedience and protests.\nThe 2020 race for district 11 between incumbent Democrat Max Rose and 10 year assemblywoman Nicole Malliotakis was particularly hard fought. Prior to which, Malliotakis handily defeated primary challenger John Matland with 78.31% of the vote. Rose raised $8.9 million compared to Malliotakis' $3 million, however, at the end of election day, Malliotakis was in the lead by 37,158 votes. Rose refused to concede, arguing that the 42,000 mail in ballots would be unanimously in his favor, he was wrong, and Malliotakis won with 155,608 votes to his 137,198, a 12.6% swing in favor of the Republicans since the last election. Malliotakis ran a tough on crime law and order campaign that also focused on Rose's support for COVID-19 lockdowns, while Rose focused on Malliotakis' backing from Donald Trump and touting himself as a moderate, not affiliated with the more progressive members of the Democratic party.\nFor the 22nd District of the State Senate, Republican Vito Bruno was leading incumbent freshmen Democrat Andrew Gounardes by 6,000 votes at midnight, however, of the 12,000 mail in ballots, 9,735 came back in favor of Gounardes allowing him to narrowly win.\n2021 elections\nPrior to the elections, Party chairman Brendan Lantry, resigned to pursue a judicial election, with committeewoman Mary Reilly serving as acting chair until the elections.\nIn the race for the Borough's president in 2021, the party had four candidates. The first was Vito Fossella, the second was Steven Matteo, the third was Leticia Remauro, and the fourth was Jhong Kim. Fossella was a former city councilmen and congressmen from New York's 13th congressional district from 1997 to 2009. However, his political career seemingly ended when he was not only charged with a DUI but also was discovered to have a secret second family. His campaign for the Borough presidency was seen as his political comeback after 12 years out of office, which was greatly aided with the endorsement of then President Donald Trump. He would go on to get 51.2% in the primaries, becoming the Republican candidate. Matteo, the city council's minority leader from 2015 to 2021, announced his campaign back in 2018 and raised over $126,000 in campaign finances. However, he was unable to overcome Fossella's endorsements and got 48.8% losing by 2%. Remauro served as chairwoman to the party from 1999 to 2002 but gained notoriety when she uploaded a video of herself comparing COVID-19 lockdowns to Nazi policies, and shouting Heil Hitler. She would lose in the primaries, getting only 12.7% of the vote, but would go on to win the Conservative primary and advance to the general election where she got 7.5% of the vote, a distant third place. Kim was a local business leader and received only 2.8% of the vote in the primary. Fossella would go on to face Democratic candidate Mark Murphy, and Remauro, winning with 60.7% of the vote.\nThe party's candidates, Ronald Castorina and Paul Marrone, for the 13th Judicial District of the New York Supreme Court had their candidacies declared invalid by the New York City Board of Elections. However this would be overruled by the 1st Department of the NY Supreme Court's Appellate Division and their names where restored to the ballot. Castorina won with 32.2% of the vote, while Marrone received 34.4%, they were the top two candidates and as such where sworn in in 2021.\nAdditionally, in the 2021 New York City Council election, the 50th District saw another contentious Republican primary, pitting the Richmond County Republican Committee backed David Carr face off against political outsider Marko Kepi. Carr branded himself as a political moderate, while Kepi branded himself as pro-Trump, and had the backing of Fossella. A manual recount had to be called, as the two where separated by just 45 votes. In the end Carr won with 3,618 votes to Kepi's 3,576.\n2023 elections\nThe Staten Island Republican party are running a tough on crime party line for the 2023 New York City Council election, hoping to issue judicial reforms if elected to roles in the city's judiciary and with further success in the city council, could attempt to work on a reform bill. Additionally, Republican enrollment in the Borough has dramatically risen in 2022.\nThe party has also hosted 2024 candidate for President Ron DeSantis to a speaking event. However, despite the events hefty price tag to organize, only 139 people showed up, and Donald Trump used the event to further ridicule DeSantis. Staten Island had been a stronghold for Trump in the 2016 primary, but many Republicans in the borough are open to another candidate running in 2024.\n2025 elections\nElected officials\nNew York City Council\n*David Carr has represented the 50th District since his election in 2021.\n*Joe Borelli has represented the 51st District since his election in 2015. Since 2021 he has been the minority leader of the council.\nNew York State Assembly\n*Michael Reilly  has represented the 62nd District since his election in 2018\n*Sam Pirozzolo has represented the 63rd District since his election in 2022.\n*Michael Tannousis has represented the 64th District since his election in 2020.\nNew York State Senate\n*Andrew Lanza has represented the 24th District since his election in 2006.\nStaten Island\n*Vito Fossella has been the Borough president since his election in 2021.\nUnited States House of Representatives\n*Nicole Malliotakis has represented New York's 11th congressional district which includes Staten Island and a portion of southern Brooklyn since her election in 2020.\nSee also\n*Kings County Republican Party\n*Queens County Republican Party\n*Bronx Republican Party\n*Manhattan Republican Party\n*New York Republican State Committee\nReferences"
    }
  ]
}