{
  "content": [
    {
      "type": "text",
      "text": "# Statues of Amun in the form of a ram protecting King Taharqa\n\nAt least three ancient Egyptian granitic gneiss statues of Amun in the form of a ram protecting King Taharqa were displayed at the Temple of Amun at Kawa in Nubia.  Construction of the stone temple was started in 683 BC by the pharaoh Taharqa. The ram is one of the animals sacred to Amun and several temples dedicated to Amun, including the one at Karnak, featured ram or ram-headed sphinx statues.\nDiscovery\nThe rams were found by Professor Francis Llewellyn Griffith during his excavations at the temple in 1930–1931. Two sets of paired sandstone bases, in front of the first and second pylons respectively, were found at the western approach to the stone temple, and figures of rams were found on two of them.  The pairing ram to the one at the British Museum is held at the Ashmolean Museum, Oxford, where many of the artefacts from the excavations at Kawa are held. The British Museum's example was acquired in 1933 from Professor Griffith's Oxford Excavations in Nubia.\nThe British Museum statue\nThe base of the statue is 1.63m long and 0.63m wide, and the statue is 1.06m high. The ram is lying on its stomach with its forelegs folded under it, and between them it protects a standing figure of King Taharqa. A hole in the top of the ram's head indicates where a gilded disk would originally have fitted. A hieroglyphic inscription runs round the sides of the plinth from front to back and proclaims Taharqa as the son of Amun and Mut, Lady of Heaven, 'who fully satisfies the heart of his father Amun'.\nThe Ashmolean statue\nThe Ashmolean statue is displayed in the redesigned Egyptian and Nubian galleries, opened in 2011.\nIn 2005, the then-writer-in-residence at the Ashmolean Museum, Chuma Nwokolo, Jr, wrote a poem inspired by the statue and other exhibits about Taharqa.\nFile:Shrine & Sphinx of Taharqa.jpg|Shrine and Sphinx of Taharqa. Taharqa appears between the legs of the Ram-Spinx, Ashmolean Museum\nFile:Ram-Sphinx of Amun-Ra.jpg|The Ram-Spinx and Taharqa\nFile:Egyptian display in Ashmolean - Flickr - gailhampshire.jpg|Close-up\nThe Khartoum statue\nThe third statue is displayed in the yard of the National Museum of Sudan, Khartoum.\nSee also\n*Sphinx of Taharqo\nReading\n*Mysliwiec, Karol Royal Portraiture of the Dynasties XXI-XXX, 1988, pp.&nbsp;33, 40.\n*Amenophis III, Le Pharaon-Soleil,(Catalogue de l'exposition de 1993 au Grand Palais, Paris 1993) Paris, 1993, p.&nbsp;184 [Fig.[31]a].\n*Paul T. Nicholson and Ian Shaw (eds), Ancient Egyptian Materials and Technology (Cambridge 2000), p.&nbsp;34\n*\"S. R. K. G.\", \"Granite Ram from the Sudan\" British Museum Quarterly 8, online at [https://archive.org/stream/britishmuseumqua08britlond/britishmuseumqua08britlond_djvu.txt]\nReferences\nExternal links\n*[https://www.britishmuseum.org/explore/highlights/highlight_objects/aes/g/granite_statue_of_amun_in_the.aspx British Museum page on the statue]\n*[https://www.britishmuseum.org/research/search_the_collection_database/search_object_details.aspx?objectid=8807&partid=1&searchText=taharqo+ram&fromADBC=ad&toADBC=ad&numpages=10&orig=%2fresearch%2fsearch_the_collection_database.aspx&currentPage=1 More detailed British Museum page]\n*[http://www.griffith.ox.ac.uk/gri/heathcote/image.php?i=38 Photograph of one of the statues arriving at Queen's College, Oxford]\n*[https://web.archive.org/web/20061018221207/http://www.ashmolean.org/cnwokolo/Two.html Chuma Nwokolo, Jr.'s poem \"Ram\" about the statue in the Ashmolean Museum. Via Internet Archive.]"
    }
  ]
}