{
  "content": [
    {
      "type": "text",
      "text": "# State visit by Xi Jinping to the United Kingdom\n\n(then Prince of Wales)]]\nThe 2015 Xi Jinping United Kingdom visit, from 19 to 23 October 2015, was the first state visit of Xi Jinping to the United Kingdom. It also was the Chinese paramount leader's first visit to the United Kingdom since 2005 and the second Chinese state leader to visit the UK after Chinese Premier Li Keqiang's visit between 16 and 19 June 2014. During the visit, Xi met Queen Elizabeth II and Prime Minister David Cameron, and also visited Manchester City F.C.\nBackground\nThe vice-director of the China Institutes of Contemporary International Relations, Feng Zhongping, said China–United Kingdom relations were warming rapidly. In March 2015, the United Kingdom joined the Asian Infrastructure Investment Bank. In September, Chancellor of the Exchequer George Osborne visited China. Feng said this visit would bring an improvement in Anglo-Chinese relations.\nThe increasingly warm relationship has led some political analysts to describe it as a \"special relationship\". An article by CNN analyst Katie Hunt posits that a key reason for the increase in relations is due in part to Britain's avoidance of raising sensitive political issues such as the Chinese claims in the South China Sea, although she noted that issues such as the Tibetan independence movement could still cause tensions between the two nations.\nProcess\n19 October: Arrival at London\nOn 19 October 2015 Xi Jinping and his wife, Peng Liyuan, arrived at Heathrow Airport and stepped off an Air China aircraft. They were greeted on behalf of the Queen by Viscount Hood and the UK Foreign Secretary Philip Hammond.\n20 October: Met Queen Elizabeth II, publish the speech and state dinner\n]]\nOn 20 October Queen Elizabeth II and the Duke of Edinburgh hosted the ceremony to welcome Xi Jinping and his wife Peng Liyuan at the Horse Guards Parade. The British welcomed Xi Jinping with a 41-gun salute in Green Park and a simultaneous 62-gun salute at the Tower of London and City of London (103 guns in total). During this visit, supporters of Xi – primarily Chinese students at British universities – waved flags and banners and carried a dragon spelling out the message \"Welcome Big Buddy Xi\". Photographs later produced by Amnesty UK showing diplomatic cargo boxes full of flags prior to the visit showed \"that the Chinese embassy has been shipping in flags, hats, T-shirts and other pro-China merchandise as diplomatic baggage in order to put on a show of strength and support for the visiting President\", according to a spokesperson for Amnesty International.\nChinese officials are believed to have wanted their security personnel to carry guns and for anti-Chinese protests to be banned completely. The Metropolitan Police refused on both accounts, and  activists of Falun Gong and the Free Tibet Campaign convened to demonstrate against China's human rights abuses and to call for the UK government to put human rights on the visit's agenda. Two Tibetan women were arrested under Section 5 of the Public Order Act 1986 and had their homes raided under Section 5 of the Public Order Act 1986 after flying a Tibetan flag near Xi's car, as well as computer equipment seized. Shao Jiang, a survivor of the Tiananmen Square massacre who also had her computer seized and home raided by police while in custody, said that the events reminded her of the repression she experienced in China prior to her exile. The Falun Gong followers called for former General Secretary of the Chinese Communist Party, Jiang Zemin, to be brought to justice for the persecution of its practitioners. Before this visit, the Labour leader Jeremy Corbyn promised to raise human rights issues, but China ambassador to the UK Liu Xiaoming said this visit would focus on partnership and cooperation between the two countries.\nXi and Peng had lunch with the Queen, viewed the Royal Collection's Chinese artefacts, and exchanged gifts with the Royals, giving them two albums of Peng Liyuan's music. In the afternoon, Xi Jinping made a speech at the Palace of Westminster. He focused on historic bi-national ties, law and order, and China's burgeoning economy in this speech. He also cited Shakespeare's The Tempest, that \"what's past is prologue\". Later Xi Jinping visited Clarence House, and had tea with Prince Charles and Camilla, Duchess of Cornwall. In the evening, Xi and Peng arrived for a state banquet at the Buckingham Palace, hosted by the Queen. Xi also met with the Labour leader Jeremy Corbyn. After the banquet, Xi and Peng stayed two nights at the palace in the Belgian Suite.\n21 October: Met David Cameron, business summit, and visiting events\nOn 21 October, Xi met with British Prime Minister David Cameron at 10 Downing Street, where they signed business agreements worth 40 billion pounds. The British government announced the UK will extend the standard Chinese visitor visas from six months to two years. Merlin Entertainments signed an agreement with China Media Capital to establish a Legoland in Shanghai. After the meeting, Xi and Cameron signed a cybersecurity pact at the press conference. They also talked about the issue of human rights.\nXi and Cameron attended the UK-China business summit at Mansion House, where the focus was on investment, infrastructure and innovation. Later Xi visited Imperial College London, Lancaster House and the London Office of Huawei, a leading Chinese telecommunications company. In the evening Xi attended the banquet hosted by the Lord Mayor of London Alan Yarrow at the City of London.\n22 October: Visiting events and meeting at Chequers\nXi and his wife Peng Liyuan bid farewell to the Queen and Prince Philip at Buckingham Palace. Xi then attended the opening ceremony of the annual conference of Confucius Institutes and Classrooms with Prince Andrew. He and Prince Andrew together unveiled the plaque of the 1000th Confucius Classroom at Hautlieu School, which was hosted by Hautlieu School of Jersey and Beijing Bayi High School.\nXi also visited Inmarsat with Prince Andrew and Liu Xiaoming. Peng Liyuan visited Royal Academy of Music with Prince William and his wife Catherine, Duchess of Cambridge. Peng also visited the Brussels Musical Instrument Museum.\nLater, Xi and Cameron held talks at Chequers. Cameron was expected to raise concerns over Hong Kong directly with Xi, but there was no mention of this in the statement. Cameron also took Xi to a traditional British pub for beers and fish and chips, the English traditional dish. Xi left London and arrived at Manchester at 10 pm.\n23 October: Manchester visit\nOn 23 October, Xi visited Manchester. He visited the National Graphene Institute of the University of Manchester with Professor Nancy Rothwell, President and Vice-Chancellor of the university, alongside George Osborne, Lord Jim O’Neill and the Minister for the Northern Powerhouse, James Wharton. Later Xi visited Manchester City F.C., Manchester City Football Academy and its exhibition of football history. He also witnessed former Manchester City defender Sun Jihai being inducted into the English Football Hall of Fame and took a selfie with Sergio Agüero.\nBefore Xi left, he visited the Airport City Manchester project. He announced that Hainan Airlines will launch non-stop flights between Beijing and Manchester.\nControversy\nThe British officials said that the China-UK business transactions were highly exaggerated and Britain would continue to tightly regulate the nuclear industry.\nAs future king, Prince Charles and his wife Camilla were absent from the state banquet. Charles also did not attend a state banquet for Chinese leader Jiang Zemin in 1999. His absence at that time was widely reported in the British media as being due to him being a great supporter of the exiled Tibetan leader, the Dalai Lama whom he viewed as being oppressed by the Chinese.\nIn May 2016, Queen Elizabeth II was filmed making an unguarded remark that the Chinese \"were very rude to the ambassador\", and that it was \"bad luck\" for the Metropolitan police commander Lucy D'Orsi that she had to be responsible for security during the state visit.\nSee also\n*China–United Kingdom relations\n*Foreign relations of China\n*Foreign relations of the United Kingdom\nReferences"
    }
  ]
}