{
  "content": [
    {
      "type": "text",
      "text": "# Staying Power (Queen song)\n\n}}\n| length     = * 4:10 (7\" album version)\n* 5:52 (12\" extended version)\n| label      = Elektra\n| writer     = Freddie Mercury\n| producer   =\n| prev_title = Calling All Girls\n| prev_year  = 1982\n| next_title = Back Chat\n| next_year  = 1982\n}}\n\"Staying Power\" is the first track on Queen's 1982 album Hot Space. It was written by lead singer Freddie Mercury and is notable as being the only Queen song to have a horn section, which was arranged by Arif Mardin. The song is driven by a funk-styled bass riff (played by Mercury) beginning in D minor and modulating to E minor throughout the song. John Deacon does not play bass guitar on this song—instead playing rhythm guitar on a Fender Telecaster. Roger Taylor programmed a Linn LM-1 drum machine for the track. Brian May is on his Red Special. In a Stylus review of the album, critic Anthony Miccio described the song's style as \"an electro-disco track with frenetic horns.\"\nThe song was released as a single in Japan.\nLive performances\nThis song was played throughout the Hot Space Tour and on The Works Tour. The live version of \"Staying Power\" is slightly different from the album version. Morgan Fisher took over the keyboard parts and replaced the Oberheim with a Roland Jupiter-8. Taylor replaced the drum machine with acoustic and electric drums. Also of note is that it was the only song played live in which Deacon played rhythm guitar, as the bass was performed via keyboard. With the electronics scaled back on the live version, the song is transformed into a funk rock song. The live version is on Queen on Fire: Live at the Bowl, Queen Greatest Video Hits 2 and on the Hot Space 2011 deluxe CD album.\nPersonnel\n;Queen\n*Freddie Mercury – lead and backing vocals, synthesizer, synth bass\n*Brian May – electric guitar\n*Roger Taylor – electronic drums, Linn LM-1\n*John Deacon – electric guitar\n;Additional\n*Arif Mardin – \"Hot and spacey\" horn arrangement\nReferences\nExternal links\n*\n* [http://www.queenonline.com/en/the-band/discography/hot-space/#lyrics Lyrics at Queen official website]"
    }
  ]
}