{
  "content": [
    {
      "type": "text",
      "text": "# Steamboat Rock (Dinosaur National Monument)\n\n| prominence_ft = 294\n| prominence_ref =\n| isolation_mi = 0.9\n| isolation_ref =\n| parent_peak = Jenny Lind Rock\n| location = Dinosaur National MonumentMoffat County, Colorado, US\n| map = Colorado#USA\n| map_caption = Location in Colorado\n| map_size = 230\n| label_position = right\n| coordinates =\n| range = Uinta Mountains\n|coordinates_ref =\n| topo = USGS Canyon of Lodore South\n| rock = Weber Sandstone\n| age = Permian-Pennsylvanian\n| first_ascent =\n| easiest_route =  climbing\n}}\nSteamboat Rock, reaching an elevation of 6,074 ft (1,851 m) is a promontory located in the eastern Uinta Mountains, in Moffat County of northwest Colorado, United States. This iconic landmark of  Dinosaur National Monument is situated at the confluence of the Green River and Yampa River. Precipitation runoff from this feature drains into the Green River. This geographical formation was originally named \"Echo Rock\" in John Wesley Powell's 1875 report, The Exploration of the Colorado River and Its Canyons. The Steamboat name first appeared on a 1941 United States Geological Survey map of Dinosaur National Monument. The area around it still retains the Echo Park name applied by Powell during the Powell Geographic Expedition of 1869.\nGeology\nSteamboat Rock is a mile-long, 1,000-ft high, slender peninsular ridge within a meander of the Green River. It is composed almost entirely of Permian-Pennsylvanian Weber Sandstone, with a thin layer of Park City Formation caprock. It is located where the river exits Lodore Canyon and enters Echo Park. The river drops 15 feet as it courses around Steamboat Rock.\nGallery\nFile:Dinosaur National Monument, Colorado.jpg|From the SSW\nFile:Dinosaur National Monument's Steamboat Rock.jpg|From the SSW\nFile:Dinosaur National Monument, Steamboat Rock.jpg|The south end of Steamboat Rock\nFile:Confluence of the Green and Yampa Rivers (17396238518).jpg|Confluence of the Green and Yampa Rivers below the east wall of Steamboat Rock\nFile:Steamboat Rock, Dinosaur.jpg|From the southwest\nFile:Green River Steamboat Rock NPS1.jpg|From the west\nView of the Green and Yampa River canyons from Harpers Corner, Dinosaur National Monument, 2009.jpg|Broad view from the west\nFile:Steamboat Rock 1871.jpg|Earliest known image of Steamboat Rock (1871)\nClimate\nSpring and fall are the most favorable seasons to visit Steamboat Rock. According to the Köppen climate classification system, it is located in a semi-arid climate zone, with temperatures averaging between 0 °F to 30 °F in January, and 50 °F to 100 °F in July. Typical of high deserts, summer temperatures can be exceedingly hot, while winter temperatures can be very cold. Snowfall is common, but the snow melts rapidly in the arid and sunny climate. Rainfall is very low, and the evaporation rate classifies the area as desert, even though the rainfall exceeds 10&nbsp;inches.\n|date=April 2011\n}}\nReferences\nExternal links\n* Steamboat Rock: [https://www.yr.no/en/forecast/daily-table/2-5582369/United%20States/Colorado/Moffat/Steamboat%20Rock Weather forecast]"
    }
  ]
}