{
  "content": [
    {
      "type": "text",
      "text": "# Stegny, Warsaw\n\n| coordinates_footnotes   =\n| subdivision_type        = Country\n| subdivision_name        =\n| subdivision_type1       = Voivodeship\n| subdivision_name1       = Masovian\n| subdivision_type2       = City and county\n| subdivision_name2       = Warsaw\n| subdivision_type3       = District\n| subdivision_name3       = Mokotów\n| established_title       =\n| established_date        =\n| parts_type              =\n| parts_style             =\n| p1                      =\n| government_footnotes    =\n| leader_party            =\n| leader_title            =\n| leader_name             =\n| unit_pref               = Metric\n| area_footnotes          =\n| area_total_km2          =\n| area_note               =\n| elevation_footnotes     =\n| elevation_m             =\n| population_footnotes    =\n| population_total        =\n| population_as_of        =\n| population_density_km2  =\n| population_note         =\n| timezone                = CET\n| utc_offset              = +1\n| timezone_DST            = CEST\n| utc_offset_DST          = +2\n| postal_code_type        =\n| postal_code             =\n| area_code               = +48 22\n| blank_name              =\n| blank_info              =\n| website                 =\n| footnotes             = }}\nStegny () is a neighbourhood, and an area of the City Information System, in Warsaw, Poland, within the district of Mokotów. It is a residential area dominated by the high-rise multifamily housing.\nIn the 15th century, in the area was founded the village of Szopy, which, in the 18th century began housing German settlers. The area was incorporated into Warsaw in 1916. In the 1970s, there was constructed a large high-rise neighbourhood of multifamily housing.\nHistory\nat Bocheńska Street.]]\nIn the 15th century, around current Puławska Street, to the south from Wierzbno, was founded the village of Szopy, originally owned by petty noble family of Szopski. Since the first half of the 17th century, it was owned by the order of Discalced Carmelites, and in 1795, as the area became part of the Kingdom of Prussia, it was nationalized. In the late 18th century, the Prussian government had placed German settlers in the western portion of the settlement to the west of Puławska Street. As such it became known as Szopy Niemieckie (German Szopy). The area inhabited by Polish population, in the eastern portion of the settlement, to the east of Puławska Street, became known as Szopy Polskie (Polish Szopy). To the north of Szopy Polskie, was also located Szopy Francuskie (French Szopy), settled by French population. A few remaining historical buildings of Szopy Polskie survive in the area of Bocheńska and Jaśminowa Streets.\nFollowing the abolition of serfdom in 1864, the area was incorporated into the municipality of Wilanów, and on 8 April 1916, it was incorporated into the city of Warsaw, becoming part of the district of Mokotów.\nIn the 1880s, at the current Idzikowskiego Street, the Russian Imperial Army built the Fort Che, as part of the Warsaw Fortress, a series of fortifications surrounding the city. After 1892, it began being used mostly as a warehouse, and in 1909, it was decommissioned. In the 1930s, the surrounding area was parcelled and sold for the construction of a neighbourhood of single-family housing. During the Second World War, soldiers of the Polish Land Forces defended themselves in the fort until its capture on 25 September 1939. It was again used during the Warsaw Uprising in 1944 by the Polish resistance before being captured on 15 September.\nIn 1959, at 3 Czerniowiecka Street, was opened a small ski jumping venue operated by the Warsaw Ski Club, with the construction point at 38&nbsp;m (124.67&nbsp; ft). It was mostly used as a training venue and occasionally hosted ski jumping competitions. It was modernized between 1975 and 1980. The last competition was hosted there in 1989, with it continuing to serve as a training venue until the early 1990s, after which it stopped being used. The ski jumping hill was deconstructed between 2010 and 2011.\nIn the 1970s beginning in 1971, in this area was constructed the residential neighbourhood of Stegny. Consisting of 4-, 11-, and 16-storey-tall multifamily residential buildings in an area of 75 ha, it became the first project in Warsaw built with the large panel system. The buildings were made from prefabricated components, manufactured in the Służewiec House Factory (). The neighbourhood was designed by Jadwiga Grębecka, Jan Szpakowicz, and Romuald Welder, with the project receiving the Minister of Constitution Award. In January 1975, in the building at 3 Marylska Street, was assigned the one-millionth public housing unit in the Polish People's Republic, which was also simultaneously the 150-thousandth unit in Warsaw. The event was commemorated with a plaque installed on the building's façade.\nIn 1973, at 5 Sobieskiego Street was opened the new building of the Institute of Psychiatry and Neurology.\nIn 1979, at 1 Inspektowa Street was opened the Stegny speed skating rink, with dimensions of 400 m × 11 m. Before this, between 1953 and 1977, in its place operated a natural ice rink.\nIn 1989, at 84 Przy Grobli Street was built a woden blacksmiths building, which was turned into the Museum of Blacksmithing in the late 1990s.\nBetween 1981 and 1993, at 9 Św. Bonifacego Street was constructed the Catholic Church of the Most Holy Virgin Mary the Mother of Divine Mercy, and between 1999 and 2003, at 15 Sobieskiego Street, was built the St. Anthony Maria Zaccaria Church.\nIn 1997, Mokotów was subdivided into twelve areas of the City Information System, a municipal standardized system of street signage, with Stegny becoming one of them.\nBetween 2006 and 2014, between Przy Grobli Street, Patkowskiego Street, and Wilanowska Avenue, was constructed Osiedle Ażurowych Okiennic, a neighbourhood consisting of 13 multifamily residential buildings, varying between 4 and 7 storeys, characterized by their wooden window blinds installed on their façades.\nOverview\nThe area is dominated by the residential neighborhood of Stegny, considering of high-rise multifamily residential buildings. Additionally, in the south, between Przy Grobli Street, Patkowskiego Street, and Wilanowska Avenue, is located Osiedle Ażurowych Okiennic, a neighbourhood consisting of 13 multifamily residential buildings, varying between 4 and 7 storeys, characterized by their wooden window blinds installed on their façades. In the west, in the area of Idzikowskiego Street is also located a neighbourhood with single-family housing. Additionally at Bocheńska are located a few houses of the historic neighbourhood of Szopy.\nAt 1 Inspektowa Street is placed the Stegny speed skating rink, with dimensions of 400 m × 11 m. Additionally, the neighbourhood also housed the Institute of Psychiatry and Neurology at 5 Sobieskiego Street, and Museum of Blacksmithing at 84 Przy Grobli Street. Stegny also has two Catholic churches. They are the Church of the Most Holy Virgin Mary the Mother of Divine Mercy at 9 Św. Bonifacego Street and St. Anthony Maria Zaccaria Church at 15 Sobieskiego Street.\nReferences"
    }
  ]
}