{
  "content": [
    {
      "type": "text",
      "text": "# Sten Sture's war against the Totts\n\n*  Sweden\n**  Sture faction\n| combatant2        =   Tott dynasty\n| commander1        =  Sten Sture the Elder      Knut Posse\n| commander2        =      Katarina Eriksdotter    Erland Kagge\n| strength1         = Large amount of men  15 ships\n| strength2         = Unknown\n| units1            = Unknown\n| units2            = Raseborg's garrison  Stegeborg's garrison  Borgholm's garrison  Visborg's garrison\n| casualties2       = Unknown\n| casualties1       = Unknown\n| campaignbox       =\n}}\n'''Sten Sture's war against the Totts' (Swedish: Sten Stures kamp mot Tottarna or the Fight between Sten Sture and Ivar Axelsson (Kampen mellan Sten Sture och Ivar Axelsson'') refers to a conflict between forces under Sten Sture the Elder and the Tott family in 1487.\nBackground\nTensions between the Totts and Sten Sture\nSince the mid-1450s, the powerful Tott family had controlled several provinces and estates around the Baltic Sea, with Ivar Axelsson Tott being the master of Gotland. The Tott's could act more independently than other lords at the time, which gradually caused tensions between Ivar Axelsson and Sten Sture to increase. Ivar had previously attempted to depose Sten Sture in 1483, but this attempt ended in failure. The tensions quickly broke into open conflict after Ivar refused to stop harassing Dutch ships, and when it erupted, the Tott's held Gotland, along with Visborg, Öland, along with Borgholm, as well as Stegeborg, Kalmar, and Raseborg.\nWar\nIn January 1487, Sten Sture began hostilities with Ivar Axelsson and began assembling a large army in Östergötland to move against the Tott's possessions. He quickly began marching towards Kalmar and went over the ice to Borgholm on Öland, where he initiated a siege of the fortress where Ivar was situated, he tried his best to defend the fortress, but when the ice melted and 15 Swedish ships began blocking the sea route to the fortress, Ivar decided to escape the fortress and managed to do so during nighttime. He left his wife to defend it, however, she surrendered after a few weeks of defending after she received a letter promising some privileges to her and her children.\nAt the same time, people from Östergötland under Knut Eskilsson Baner, moved towards Stegeborg, while Raseborg was besieged by Knut Posse. One by one, the fortresses under the Totts fall. Stegeborg was surrendered by Erland Kagge on May 24 while Borgholm was conquered by Knut Posse. When four ships under Knut Posse began to cruise outside of Visborg, Ivar Axelsson realized that he had lost. He decided to surrender Visborg and Gotland to Denmark in exchange for regaining the family's estates in Denmark, along with this, he was also forced to surrender Borgholm and Öland to Sten Sture with humiliating terms after pressure by the Danish king.\nAftermath\nAs a result of the war, the power that the Tott's held was crushed, with them never being able to regain it. Ivar Axelsson would later die the same year in his fortress Lillöhus, near modern-day Kristianstad.\nReferences"
    }
  ]
}