{
  "content": [
    {
      "type": "text",
      "text": "# Steps in the Scientific Tradition\n\nSteps in the Scientific Tradition: Readings in the History of Science is a 1968 anthology edited by Richard S. Westfall and Victor E. Thoren.\nSummary\nThe book is an anthology of primary source readings. The editors provide biographical sketches and commentary. Authors included are:\n*Aristotle\n*Ptolemy\n*Lucretius\n*Roger Bacon\n*Jean Buridan\n*Galileo Galilei\n*William Harvey\n*René Descartes\n*Isaac Newton\n*Benjamin Franklin\n*Antoine Lavoisier\n*John Playfair\n*Thomas Young\n*Sadi Carnot\n*Theodor Schwann\n*Charles Darwin\n*J. J. Thomson\n*Thomas Hunt Morgan\n*Irving Langmuir\nBackground and publication history\nRichard S. Westfall (1924–1996) was a historian of the scientific revolution. He wrote Never at Rest: A Biography of Isaac Newton (1980) and several other books. Victor E. Thoren (1935–1991) was a historian of astronomy and the author of The Lord of Uraniborg: A Biography of Tycho Brahe (1990). The two were colleagues in the department of History and Philosophy of Science at Indiana University.\nSteps in the Scientific Tradition was first published in 1968 by John Wiley & Sons, Inc.\nReception\nSteps in the Scientific Tradition received a positive review from Clifford Maier in Isis, a mixed review from Frank Greenaway in Nature, and a negative review from Science Books: A Quarterly Review.\nMaier wrote that, as a source book for an introductory course in the history of science, Steps in the Scientific Tradition \"has distinct advantages over most others readily available in English\": longer readings rather than short excerpts, presented in an order that \"may well provoke in a student a sense of the development of the changing scientific patterns of thought\".\nGreenaway reviewed Steps in the Scientific Tradition alongside The Science of Matter: a Historical Survey, edited by Maurice P. Crosland. He considered the Westfall and Thoren book less suitable than the Crosland book for use as a textbook. He wrote that, while it may be \"an excellent thing\" for a student to read historically important passages such as the thirty-first query in Newton's Opticks, the note introducing each passage \"only sketches lightly the intellectual situation in respect of one problem or contemporary question\". He suggested that the editors ought to have provided explanation for their choice of passages and other guidance to teachers.\nScience Books: A Quarterly Review rated the book \"Not Recommended\". The reviewer found the introductory notes \"superficial and perfunctory\" and the quality of the translations \"deplorable\". The reviewer wrote, \"It is wholly unnecessary that a student read Ptolemy or Descartes in cumbersome mid-19th century British English, as presented in this book.\"\nReferences\nSources\n*\n*\n*\n*\n* }}\n*\n*\n*"
    }
  ]
}