{
  "content": [
    {
      "type": "text",
      "text": "# Stepanakert Republican Stadium\n\n| built               = 1955–1956\n| opened              = 1956\n| renovated           = 2004–20052015\n2023\n| owner               =\n| operator            =\n| surface             = Artificial turf\n| tenants            = Qarabağ FKLernayin Artsakh FC (prior to 2023)\n| capacity            = 15,000\n| record_attendance   =\n| dimensions          = 110x70 meters\n| website             =\n}}\nStepanakert Republican Stadium () or Khankendi Stadium () is a stadium in Stepanakert, Nagorno-Karabakh, Azerbaijan.\nHistory\nThe stadium was unveiled in 1956 as Joseph Stalin Stadium. After the First Nagorno-Karabakh War, the name was changed to Stepan Shahumyan Central Stadium by the authorities of the breakaway Republic of Artsakh.\nThe stadium was entirely renovated in 2004–2005 and renamed Stepanakert Republican Stadium. During the renovation, the venue was turned into an all-seater stadium with a capacity of 12,000 spectators. In 2015, the natural grass was replaced with an artificial turf.\nSince the mid-1990s, football teams from Karabakh started taking part in some domestic competitions in Armenia. Lernayin Artsakh is the football club that represents the city of Stepanakert. The Artsakh football league was launched in 2009.\nThe Artsakh national football team was formed in 2012 and played their first competitive match against the Abkhazia national football team in Sokhumi, a match that ended with a result of 1–1 draw. The return match between the unrecognized teams took place at the stadium, on 21 October 2012, when the team of Nagorno-Karabakh defeated the Abkhaz team with a result of 3–0.\nAfter the 2023 Azerbaijani offensive in Nagorno-Karabakh, the stadium was refurbished by the Azerbaijani authorities. The stadium hosted a 2023–24 Azerbaijan Cup match between Qarabağ FK and MOIK Baku on 21 December 2023.\nEvents\nThe 6th Pan-Armenian Games football tournament, 7th Pan-Armenian Games opening ceremony and 2019 CONIFA European Football Cup was held in the stadium.\nGallery\nStepanakert Republican Stadium depuis l'escalier à Stepanakert (Artsakh) en juillet 2017.jpg|The entrance to the stadium\nStepanakert Stadium in 2017 (Artsakh).jpg|General view\nStepanakert Republican Stadium, Stepanakert (Artsakh), July 2017.jpg|The stadium in 2017\nReferences"
    }
  ]
}