{
  "content": [
    {
      "type": "text",
      "text": "# Stephen Stewart (rower)\n\n|birth_place= Sydney\n|death_date=\n|death_place=\n|education= Newington College\n|occupation=\n|title=\n|spouse=\n|parents=\n|children=\n|nationality= Australian\n|website=\n| medaltemplates =\n}}\n}}\nStephen John Stewart (born 7 March 1978) is an Australian former national representative rower, a national champion, dual Olympian and an Olympic medal winner.\nRowing brothers\nStephen's older twin brothers James Stewart and Geoff Stewart were three-time Olympians (1996, 2000, 2004) and each won two Olympic bronze medals. The trio of brothers became the first to represent Australia in rowing at the same Olympics when they all rowed together at Athens 2004 to a bronze medal in the men's eight. The brothers were all educated at Newington College (1984–1991), and took up rowing coached by Olympian and fellow Old Newingtonian Michael Morgan and deputy headmaster Robert Buntine.\nClub and state rowing\nStephan Stewart's senior club rowing was from the UTS Haberfield Rowing Club on Sydney's Iron Cove.\nStewart's first state representative selection for New South Wales came in 2001 in the men's senior eight who contested the King's Cup at the Interstate Regatta within the Australian Rowing Championships From 2001 to 2004 and in 2008 he rowed in New South Wales men's senior eights competing for the King's Cup at the Interstate Regatta. He stroked the 2003, 2004 and 2008 eight and saw King's Cup victories in 2004 and 2008.\nInternational representative rowing\nStewart made his Australian representative debut in 1995 aged eighteen, competing at the World Rowing U23 Championships in Groningen in the men's eight who finished in eighth place. That same year he rowed at the Junior World Rowing Championships in Poznan at which the Australian squad was negatively affected by food poisoning. Stewart was selected in the eight which was unable to move past the heat stage due to the effects of illness on the crew, but Stewart moved into the coxless four who were able to win the silver medal.\nHis next representative appearance was in 2000 and again at the World Rowing U23 Championships in a coxless four which won the silver medal. He also competed at a World Rowing Cup in Lucerne that year. In 2001 he was selected in to stroke the Australian men's eight. He raced at the World Rowing Cup IV in Munich and then at the 2001 World Rowing Championships where they missed the A final and placed seventh overall. Then in 2003 at the World Championships in Milan he stroked the Australian coxless four to a fourth-place finish.\nIn time for the 2004 Athens Stephen was back in the stroke seat of the Australian men's eight with his brothers Geoff and James at four and five. They raced well to a bronze medal. In the next Olympiad Steve Stewart didn't represent internationally at any World Championships or World Cups until his 2008 selection to again stroke the 2008 Australian men's eight. The eight competed at two World Rowing Cups in Europe before rowing at the 2008 Beijing Olympics to a sixth place in the final. It was Stephen Stewart's last Australian representative appearance.\nReferences\nExternal links\n*"
    }
  ]
}