{
  "content": [
    {
      "type": "text",
      "text": "# Stepanakert in the Republic of Artsakh\n\n| settlement_type                 = City\n| image_skyline                   = File:StepanakertCollage.jpg\n| imagesize                       = 300px\n| image_caption                   = From top left: Holy Mother of God Cathedral Renaissance Square&nbsp;• Downtown Stepanakert Stepanakert Airport&nbsp;•  Stepanakert skyline Park Hotel Artsakh &nbsp;• We Are Our Mountains Artsakh University\n&nbsp;• Stepanakert Memorial\n| image_flag                      = Flag of Stepanakert, Artsakh.svg\n| shield_size                     = 75px\n| map_caption                     = Location of Stepanakert in Artsakh, under its de facto borders from 2020 to 2023.\n| pushpin_map                     = Republic of Artsakh\n| subdivision_type                = Country\n| subdivision_name                = Artsakh\n| subdivision_type1               =  Province\n| subdivision_name1               = Stepanakert\n| government_type                 = Mayor–Council\n| governing_body                  = Stepanakert City Council\n| leader_title                    = Mayor\n| leader_name                     = David Sargsyan (2023)\n| established_title               = City status\n| established_date                = 1940\n| area_total_km2                  = 29.12\n| population_as_of                = 2021\n| population_total                = 75,000\n| population_footnotes            =\n| population_density_km2          = auto\n| timezone                        = GMT+4\n| utc_offset                      = +4\n| coordinates                     =\n| elevation_m                     = 813\n| area_code                       = +374 47\n| website                         =\n| footnotes                       = Sources: Stepanakert city area and population\n}}\nFrom the breakup of the Soviet Union in 1991 to the 2023 Azerbaijani offensive in Nagorno-Karabakh, the city of Stepanakert was the capital of the unrecognized breakaway Republic of Artsakh, while being internationally recognized as part of Azerbaijan.\nDuring this period, the city was a regional center of education and culture, being home to Artsakh University, musical schools, and a Palace of Culture. The economy was based on the service industry and had varied enterprises, food processing, wine making, and silk weaving being the most important. As of 2021, the population of Stepanakert was 75,000.\nPolitics and government\nDuring the period of the USSR, Stepanakert served as the capital of the Nagorno-Karabakh Autonomous Oblast within the Azerbaijani Soviet Socialist Republic, between 1923 and 1991. With the self-declared independence of Artsakh in 1991, Stepanakert continued with its status as the political and cultural centre of the newly established republic, being home to all the national institutions: the Government House, the National Assembly, the Presidential Palace, the Constitutional Court, all ministries, judicial bodies and other government organizations.\nArtsakh had been a presidential republic since the 2017 constitutional referendum. The post of prime minister was abolished and executive power from then on resided with the president, who was both the head of state and head of government. The president was directly elected for a maximum of two consecutive five-year terms. The final president was Samvel Shahramanyan, in 2023.\nThe National Assembly was a unicameral legislature. It had 33 members who are elected for five-year terms.\nThe city of Stepanakert was governed by the Stepanakert City Council and the mayor of Stepanakert. The last local elections took place in September 2019. The most recent mayor was Davit Sargsyan.\nGovernment buildings\n2014 Stepanakert, Plac Odrodzenia (02).jpg|The National Assembly\n2014 Stepanakert, Budynek Ministerstwa Spraw Zagranicznych Republiki Górskiego Karabachu (02).jpg|The Ministry of Foreign Affairs\n2014 Stepanakert, Budynek rządowy Republiki Górskiego Karabachu.jpg|Government building, 20 February Street\nReligion\nThe late-19th-century church of Vararakn was destroyed in the 1930s to build the Stepanakert Drama Theatre. Throughout the rest of the Soviet era, there were no traditional churches in Stepanakert, although most of the population of the city were members of the Armenian Apostolic Church.\nThe church of Surp Hakob (or Saint James) was opened in 2007; it remained the only open church in the city until 2019. The church was financed by Nerses Yepremian from Los Angeles. The church was consecrated on 9 May 2007, in honor of the 15th anniversary of the capture of Shusha by Armenian forces.\nThe construction of the Holy Mother of God Cathedral was launched on 19 July 2006. The cost of the project was expected to be around US$2&nbsp;million and the architect of the church is Gagik Yeranosyan. However, the construction process was slow due to a lack of financial resources. The inauguration of the church was expected to take place in September 2016. Construction finished and the church was opened in 2019.\nThere was small community of Armenian Evangelicals with around 500 members. The only Armenian evangelical church in Artsakh is located in Stepanakert. The Evangelical community supported many schools, hospitals and other institutions through the help of the Armenian Diaspora.\nTransport\n]]\nBus\nStepanakert was served by a number of regular minibus lines. Old Soviet-era buses had been replaced with new modern buses. Regular trips to other provinces of Nagorno-Karabakh were also operated from the city.\nAir\nStepanakert was served by the nearby Stepanakert Airport, north of the city near the village of Ivanyan. In 2009, facilities reconstruction and repair work began. Though originally scheduled to launch the first commercial flights on 9 May 2011, Karabakh officials postponed a new reopening date throughout the whole of 2011. In May 2012, the director of the NKR's Civil Aviation Administration, Tigran Gabrielyan, announced that the airport would begin operations in summer 2012. However, the airport still remains closed due to political reasons. The OSCE Minsk Group, which mediates the Nagorno-Karabakh conflict, stated that \"operation of [Stepanakert Airport] cannot be used to support any claim of a change in the status of Nagorno-Karabakh\" and \"urged the sides to act in accordance with international law and consistent with current practice for flights over their territory.\"\nEconomy\nThe city was a regional center of education and culture, being home to Artsakh University, musical schools, and a Palace of Culture. The economy was based on the service industry and had varied enterprises, food processing, wine making, and silk weaving being the most important. As of 2021, the population of Stepanakert was 75,000.\nStepanakert was the center of the economy of Artsakh. Prior to the First Nagorno-Karabakh War, the economy of Stepanakert was mainly based on food-processing industries, silk weaving and winemaking. Inhabitants also engaged in producing furniture and footwear. The economy was severely damaged due to the 1988 earthquake in Armenia and the First Nagorno Karabakh war. In the years following, the economy was developed further, mainly due to investments from the Armenian diaspora. However, following the 2020 Nagorno-Karabakh war, the economy once again experienced severe damage, particularly in the tourism sector.\nThe most developed sectors of Stepanakert and the rest of the Republic of Artsakh are tourism and services. Several hotels were opened by diasporan Armenians from Russia, the United States and Australia. Artsakhbank was the largest banking services provider in Artsakh, while Karabakh Telecom was the leading provider of mobile telecommunications and other communication services.\nStepanakert was also home to many large industrial firms, including Stepanakert Brandy Factory, Artsakh Berry food products and Artsakh Footwear Factory.\nConstruction was also one of the leading sectors in the city. Artsakh Hek was the leading construction firm, while Base Metals was the leader in mining and production of building materials.\nCulture\n]]\nThe Vahram Papazyan Drama Theater of Stepanakert was founded in 1932. In 1967, the monumental complex of Stepanakert known as We Are Our Mountains was erected to the north of Stepanakert, It is widely regarded as a symbol of the Armenian heritage of the historic Artsakh. After the independence of Armenia, many cultural and youth centres were reopened. The cultural palace of the city is named after Charles Aznavour.\nStepanakert was home to the Mesrop Mashtots Republican Library opened in 1924, Artsakh History Museum opened in 1939, Hovhannes Tumanyan Children's Library opened in 1947, Stepanakert National Gallery opened in 1982, and the Memorial Museum of the Martyred Liberators opened in 2002. A new cultural complex of the Armenian heritage of Artsakh was under construction.\nThe Artsakh State Museum, based in Stepanakert, had an important collection of ancient artifacts and Christian manuscripts.\nEducation\nStepanakert was the center of higher education in Artsakh. Five higher educational institutions operated in the city:\n* Artsakh State University, founded in 1969 as a branch of the Baku Pedagogical Institute. In 1973, it was renamed Stepanakert Pedagogical Institute and following the independence of Nagorno-Karabakh, in 1992, it received its current status. The university offered courses spread across seven departments and has 4,500 students.\n* Stepanakert campus of the Armenian National Agrarian University.\n* Grigor Narekatsi University (private).\n* Mesrop Mashtots University (private).\n* Gyurjyan Institute for Applied Arts (private).\nMany new schools in Stepanakert were opened from the late 1990s to 2010 with the help of the Armenian diaspora. Existing schools were also renovated with donations from the diaspora.\nThe Stepanakert branch of Tumo Center for Creative Technologies was opened in September 2015, as a result of continued cooperation between the Tumo Centre and the Armenian General Benevolent Union, with the support of mobile operator Karabakh Telecom.\nSport\n]]\nFootball is a popular sport in Nagorno-Karabakh and the city has a renovated football stadium. Since the mid-1990s, football teams from Karabakh started taking part in some domestic competitions in Armenia. Lernayin Artsakh is the football club that represents the city of Stepanakert. The Artsakh national football league was launched in 2009.\nThe non-FIFA affiliated Artsakh national football team was formed in 2012 and played their first competitive match against the unrecognized Abkhazia national football team in Sukhumi on 17 September 2012. The match ended with a 1–1 draw. The following month, on 21 October 2012, Artsakh played the return match at the Stepanakert Republican Stadium against Abkhazia, winning it with a result of 3–0.\nThere was also interest in other sports, including basketball and volleyball.\nArtsakh athletes also took part with the representing teams and athletes in the Pan-Armenian Games, organized in Armenia.\nAs an unrecognized entity, the athletes of Artsakh competed in international sports competitions under the flag of Armenia.\nTwin towns – sister cities\nStepanakert was twinned with:\n* Montebello, United States: On 25 September 2005, Montebello, California and Stepanakert became sister cities. This prompted a complaint by the ambassador of Azerbaijan to the United States, Hafiz Pashayev, who sent a letter to California leaders, stating that the decision jeopardized peace talks between his country and Armenia. The letter was sent to then-California governor Arnold Schwarzenegger, who deferred the letter to Montebello mayor Bill Molinari since it concerned a local, not a state, issue. Molinari responded to Pashayev that the city would go ahead with its plans to inaugurate Stepanakert under the sister city program. Stepanakert's relationship with Montebello is aimed at revitalizing the capital's economic infrastructure and building cultural and educational ties, as well as developing trade and health care between the two cities. Azerbaijan has described this as a contradictory foreign policy of the United States that supports the NKR government and Armenian aggression against Azerbaijan.\n* Mairiporã, Brazil: Since June 18, 2018, Law 3767/18 has made Eternal Armenia the name that declares Sister Cities the Municipalities of Mairiporã, State of São Paulo, and Stepanakert, capital of the self-declared Nagorno-Karabakh Republic which triggered an alert from Itamaraty, Brazilian Ministry of Foreign Affairs, on the attitude of the Municipality as Brazil does not recognize the independence of Nagorno-Karabakh.\nFriendship declarations\n* On 22 May 1998, Stepanakert and the commune of Villeurbanne in France signed a Friendship Declaration.\n* On 28 September 2012, Stepanakert and Yerevan, Armenia, the capitals of the two Armenian republics, became friends after signing a partnership agreement.\n* On 15 September 2014, San Sebastián, Spain, and Stepanakert signed a cooperation agreement.\n* On 17 May 2015, Stepanakert and the commune of Valence in France signed a Friendship Declaration.\n* On 3 February 2016, Stepanakert signed a Friendship Declaration with the municipality of Franco da Rocha, Brazil.\n* On 23 July 2019, Stepanakert signed a Friendship Declaration with the City of Ryde, Australia.\nNotes\nReferences\nBibliography\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\nExternal links\n* [http://stepanakert.am Stepanakert Municipality (hy)]\n* [http://360yerevan.com/en/viewer/#/!/stepanakert/ 360 Panoramic view of the City Center (en)]\n* [http://artsakh.travel/en/regions/stepanakert Artsakh tourism Office (en)]\n* [http://www.lonelyplanet.com/azerbaijan/nagorno-karabakh/stepanakert Stepanakert on Lonely Planet (en)]\n*\n}}"
    }
  ]
}