{
  "content": [
    {
      "type": "text",
      "text": "# Stephen Hawking: Master of the Universe\n\nStephen Hawking: Master of the Universe is a documentary television series produced by the television broadcaster Channel 4. The subject of the series is British theoretical physicist Stephen Hawking, known for his work on black holes, who is also the presenter of the series. The series includes interviews with astrophysicist Kim Weaver, Bernard Carr, a student of Hawking's, and three theoretical physicists: Michio Kaku, Edward Witten, known for his work on superstring theory, and Lisa Randall. The first episode premiered in 2008, twenty years after the publication of Hawking's bestselling popular science book A Brief History of Time. The title is derived from a Newsweek cover.\nThe series consisted of two episodes. The first describes Hawking's personal life, his challenges in overcoming his motor neurone disease, and his career in physics. It covers his childhood, education, marriage, family life, and his work on the Big Bang and black holes. The second episode discusses string theory and supersymmetry. Both episodes are 48 minutes long, and premiered as half-hour-long programmes. The series was released on CD by Channel 4 in the UK as a Region 2, one disc-DVD (B00140SGOM) on 18 March 2008.\nReception\nThe premiere of the first episode attracted 1.9&nbsp;million viewers, and was considered a success. The second episode had 1.7&nbsp;million viewers. James Walton of The Daily Telegraph wrote a positive review of the first episode, saying that it \"hadn't done a bad job of trying to explain advanced physics to the science novice,\" even if it was \"extremely difficult stuff.\" Philip Wakefield, a television critic for stuff.co.nz, listed the first episode in his \"Top TV picks\", calling it \"the neatest illustration of Einstein's theory of relativity I’ve ever seen.\" Sam Wollastan of The Guardian was more critical of the series, but did praise it for showing \"the little glimpses of Prof Hawking's private life, like sharing a takeaway curry with a group of adoring young disciples.\"\nReferences\nExternal links\n*"
    }
  ]
}