{
  "content": [
    {
      "type": "text",
      "text": "# Stephanie Millward\n\n| image = Stephanie millward (cropped).jpg\n| caption = Millward in 2012\n| fullname = Stephanie Millward\n| nationality = British\n| strokes =\n| club =\n| collegeteam =\n| birth_date =\n| birth_place = Jeddah, Saudi Arabia\n| death_date =\n| death_place =\n| height =\n| weight =\n| medaltemplates =\n}}\n}}\n}}\nStephanie Millward (born 20 September 1981) is a British former Paralympic swimmer.\nAt the age of 17 she was diagnosed with multiple sclerosis (MS). As a result, she competed in the S9 (classification) Paralympic classification. Since 12 June 2016, she competes in the S8 classification after her category change from the less impaired S9 category down to S8. She was reclassified at the Berlin Open.\nPersonal life\nMillward was born on 20 September 1981 in Jeddah, Saudi Arabia.\nShe was awarded the Freedom of the Town of Corsham on 2 March 2013.\nMillward is proud ambassador of Wiltshire and Bath Air Ambulance Charity.\nEducation\nMillward attended The Corsham School, Wiltshire.\nSwimming\nMillward was close to a place in the British international non-disabled team and, having broken the British record for the 100-metre backstroke at the age of 15, hoped to qualify for the 2000 Summer Olympics before she was diagnosed with MS.\nShe qualified for the 2008 Summer Paralympics held in Beijing, China where she entered four S9 events. She finished fourth in the 100-metre backstroke, fifth in the 100-metre freestyle, sixth in the 50-metre freestyle and thirteenth in the 100-metre butterfly.\nIn 2009 Millward won two medals at the British Disability Swimming Championships, taking a silver in the 100 freestyle and bronze in the 100-metre butterfly. At the International Paralympic Committee (IPC) European Swimming Championships held in Reykjavík, Iceland, she won three gold and two silver medals in individual events and added a further two gold medals in relays. At the 2009 IPC Swimming World Championships 25 m in Rio de Janeiro, Brazil she won two gold, three silver and a bronze in individual competitions and two gold medals in relay events.\nAt the 2010 IPC Swimming World Championships held in Eindhoven, the Netherlands, she won silver medals in the 100&nbsp;m freestyle, the 400&nbsp;m freestyle, the 100&nbsp;m backstroke, the 4×100&nbsp;m freestyle relay (34pts) and the 4×100&nbsp;m medley relay (34pts). She also won a bronze medal in the 100&nbsp;m butterfly. She represented England at the 2010 Commonwealth Games, where she won silver medals in the 100-metre butterfly S9 and the 100-metre freestyle S9 and a bronze medal in the 50-metre freestyle S9, finishing behind winner Natalie du Toit of South Africa on each occasion.\nAt the 2011 IPC European Championships in Berlin, Germany, Millward won three gold and two silver medals, including setting a world record time of four minutes, 52.40 seconds on the way to winning gold in the 4×100&nbsp;m medley relay (34pts) alongside Heather Frederiksen, Claire Cashmore and Louise Watkin.\nMillward was named as part of a 44-swimmer squad to compete for Great Britain at the 2012 Summer Paralympics in London, United Kingdom. At the Games she won her first Paralympic medal, a silver, in the 100&nbsp;m backstroke S9. This was followed by four further medals. She won bronze in the 4&nbsp;×&nbsp;100 &nbsp;m freestyle relay (34pts), swimming with Cashmore, Watkin and Susie Rodgers; a silver in 400&nbsp;m freestyle S9, finishing behind South African Natalie Du Toit; another silver came as she once again finished behind du Toit in the SM9 200&nbsp;m individual medley in a new European record time of four minutes, 4.40 seconds. Her fifth and final medal came in the 100-metre medley relay (34 pts) swimming with Frederiksen, Cashmore and Watkin. The British quartet were in fourth place heading into the final leg but Watkin came through to finish in second place, three hundredths of a second behind the winning team from Australia.\nAt the 2016 Rio Paralympics, Millward won her first Paralympic gold medals, in the 100m backstroke S8 and the women's  medley relay 34pts. At the same Games, she won silver in the 200m individual medley SM8 and bronze in the 400m freestyle S8 and 100m freestyle S8.\nHonours\nMillward was appointed Member of the Order of the British Empire (MBE) in the 2017 New Year Honours for services to swimming. In August 2021, she was appointed a deputy lieutenant of Wiltshire.\nReferences\nExternal links\n*\n*\n*\n*"
    }
  ]
}