{
  "content": [
    {
      "type": "text",
      "text": "# Stephanie Edwards (television personality)\n\nStephanie Edwards is an American television personality and actress.\nCareer\nBorn in Kenyon, Minnesota, Edwards began her career as an actress, and became widely known as an on-air personality in the 1970s. She co-hosted ABC-TV's AM America, the forerunner to Good Morning America, jointly with Bill Beutel, continuing with GMA as a frequent substitute for Joan Lunden. Previously, she had hosted a similar West Coast news and talk program in Southern California, AM Los Angeles along with Ralph Story.\nEdwards was nominated in 1979 for a Daytime Emmy Award as Outstanding Host or Hostess in a Talk, Service or Variety Series, for her show Everyday.\nTournament of Roses parade\nFrom 1978 to 2005, Edwards served in the main broadcast booth with former game show host Bob Eubanks as co-host of the Tournament of Roses Parade on Los Angeles television station KTLA Channel 5, then broadcast widely throughout the United States and Canada as a cable and satellite superstation.  After 28 continuous years in the position, Edwards was then replaced as Eubanks' main booth co-host by KTLA morning news co-anchor Michaela Pereira, with Edwards herself being reassigned as an on-the-street reporter, sometimes having to stand in the rain while giving periodic live updates. Although all three were equally billed as co-hosts, the move created a storm of controversy and was seen as insensitive by many of Edwards' fans, as well as by local TV critics.  Finally, in 2009, Edwards rejoined Eubanks as the main co-host of KTLA's Tournament of Roses Parade coverage, remaining continuously in the position again until 2016, following a September 25, 2015 announcement by Eubanks that the 2016 parade would be their last.\nEdwards was also the longtime commercial spokesperson for the California-based supermarket chain Lucky Stores from the mid-1980s until they merged with Albertsons (1998).\nFilmography\n{| class=\"wikitable\" style=\"font-size: 90%;\"\n! colspan=\"4\" style=\"background: LightSteelBlue;\" | Film\n|-\n! Year\n! Film\n! Role\n! Notes\n|-\n| 1973\n| Maurie\n| Carol\n| Alternative title: Big Mo\n|-\n| 1980\n| The Formula\n| Reporter\n|-\n|-\n! colspan=\"4\" style=\"background: LightSteelBlue;\" | Television\n|-\n! Year\n! Title\n! Role\n! Notes\n|-\n| 1971\n| Love, American Style\n|\n| 1 episode\n|-\n| 1972\n| Temperatures Rising\n| Reporter\n| 1 episode\n|-\n| rowspan=3|1973\n| Marcus Welby, M.D.\n| Judith Haines\n| 1 episode\n|-\n| The Christmas Visit\n| Alice Johnson\n| Television movie\n|-\n| Match Game 73\n| Herself\n| 5 episodes\n|-\n| 1973–1974\n| The Girl with Something Extra\n| Angela\n| 10 episodes\n|-\n| 1977\n| Police Story\n| Faye Ludwig\n| 1 episode\n|-\n| 1984\n| The Hoboken Chicken Emergency\n| Newscaster\n| Television movie\n|-\n| 1985\n| Lots of Luck\n|\n| Television movie\n|-\n| 1985\n| The Fall Guy\n| Self\n| 1 episode\n|}\nAward nominations\n{| class=\"wikitable\" style=\"font-size: 90%;\"\n|-\n! Year\n! Award\n! Result\n! Category\n! Series\n|-\n|1979\n|Daytime Emmy Award\n|Nominated\n|Outstanding Host or Hostess in a Talk, Service or Variety Series\n|Everyday\n|}\nReferences\nExternal links\n*"
    }
  ]
}