{
  "content": [
    {
      "type": "text",
      "text": "# Stethoscope Revolution\n\nThe Stethoscope Revolution (Morocco) was a protest movement in 2015 in Morocco by medical school students and other health professionals against a Moroccan Government plan to force them to work in rural areas for two year terms.\nThe movement saw vigils, national marches (23 July and 17 September 2015), boycotts of seven medical and dental faculties in Morocco and a strike on 1 October 2015.\nThe movement started when the Minister of Health, El Hossein El Ouardi started enforcing \"Compulsory Health Service\" project.\nCompulsory Health Service\nThe controversy started when El Ouardi proposed the Compulsory Health Service Law (or simply the \"Compulsory Service\") in order to solve health problems in Morocco. He stated that this service would provide the population on the rural areas the health care needed, and it would also help set a fair geographical distribution regarding working doctors. Statistics indicate that about 45% of doctors (in both the private and public sectors) worked in Rabat or Casablanca.  Medical professionals considered the plan a threat to their futures and an ineffective attempt to improve rural healthcare.\nIn September 2015, the Health Ministry posted on its website the Draft article on the Compulsory Health Service Law.  Dissenters note that its articles contradicted international agreements previously signed by the government. Many students and professionals worried about their careers after being forced to go away for two years.\nFurthermore, the first article of the law considers the health service is a \"national duty\" but excluded medical school students of a private newly opened medical faculty, raising claims of favoritism.\nActions\nMedical students, interns, residents and nurses waged vigils, national strikes, awareness campaigns and national marches against the law. There was a national boycott of the medical and dental schools.\nMedical and paramedical professionals joined the movement to improve their working conditions and provide adequate treatment for patients.\nDemands\nThe movement had the following demards:\n* Revocate of the Compulsory Health Service.\n* Increase the number of job positions offered for newly graduated doctors and medical specialists. (15 seats were offered in 2014 out of more than 2000 newly graduated doctors)\n* Increase the number of seats for the Internship and Residency and open it annually.\n* Increase the pay for health services and night shifts on public hospitals, which are estimated at 110 dirhams (11.43usd) per month.\n* Improve the medical conditions during the students training on the public hospitals.\nThere was opposition to the notion of equating a doctorate in medicine (8 years of studies) to any other national doctorate (7 years of studies), which would mean future doctors would study 8 years at least to end up with the same salary as a Master student (5 years of studies) which is estimated at 8700dhs (US$903.61).\nOutcome\nThe boycott eventually forced the Health Ministry to meet with the representatives in the national coordination of medical students and the National Committee of interns and residents in Morocco.\nReferences"
    }
  ]
}