{
  "content": [
    {
      "type": "text",
      "text": "# Steve Warren\n\n| birth_place = Lawton, Oklahoma, U.S.\n| height_ft    = 6\n| height_in    = 1\n| weight_lbs   = 298\n| high_school = Springfield (MO) Kickapoo\n| college     = Nebraska\n| draftyear   = 2000\n| draftround  = 3\n| draftpick   = 74\n| teams       =\n* Green Bay Packers (2000–2002)\n| highlights  =\n* National champion (1997)\n* First-team All-Big 12 (1999)\n| statlabel1  = Games played\n| statvalue1  = 25\n| statlabel2  = Sacks\n| statvalue2  = 1\n| pfr         = WarrSt20\n}}\nSteven Jerome Warren (born January 22, 1978) is an American former professional football player who was a defensive tackle for the Green Bay Packers of the National Football League (NFL) from 2000 to 2002.\nCollege career\nWarren played college football for the University of Nebraska–Lincoln.\nProfessional career\nWarren was selected in the third round of the 2000 NFL draft by the Green Bay Packers. He played a backup role behind Cletidus Hunt after starter Santana Dotson went out for the season with an injury. Warren was injured in a November contest against the Chicago Bears and missed the remainder of the season.\nAfter nursing his quadriceps injury all offseason, he was still not ready to go at the start of the season. He was placed on the Physically Unable to Perform (PUP) list on August 28, 2001. After his six weeks on the PUP list, he was quoted as saying he was \"Ready to go\", but the Packers decided he was not ready to go and would be out the remainder of the season.\nIn 2002, Warren practiced during mini-camp and played most of 2002 season. He was inactive for a few contests but filled in for injured DL Billy Lyon in the Packers Wild Card loss to the Michael Vick lead Atlanta Falcons.\nIn 2003, Warren was tendered a minimum contract. In July, Warren failed his physical for undisclosed reasons and was placed on the PUP list in late July with a back injury. On August 6, Warren was taken off the PUP list but he was released before the start of the regular season on August 26, 2003. The Kansas City Chiefs showed interest in signing Warren after his release from the Packers but they did not sign him.\nReferences"
    }
  ]
}