{
  "content": [
    {
      "type": "text",
      "text": "# Steve Warner\n\n| birth_place = Livonia, Michigan, U.S.\n| death_date =\n| death_place =\n| alma_mater = Washington University in St. Louis  University of Michigan\n| height = 190 cm\n| weight = 72 kg\n| website =\n| country = United States\n| sport = Rowing\n| event =\n| club = Princeton Training Centre\n| team =\n| turnedpro =\n| coach =\n| retired =\n| coaching =\n| worlds =\n| regionals =\n| nationals =\n| olympics =\n| medaltemplates = }}\n}}\nStephen J Warner (born May 24, 1978) is a retired American rower who won a world title in 2000 in the lightweight eights. He competed at the 2004 Summer Olympics, where his team placed ninth in the lightweight coxless four.\nWarner graduated from the University of Michigan with a bachelor of science degree in cellular and molecular biology. After that he abandoned his studies for four years to compete in rowing and work at Bristol-Myers Squibb as a research associate. He then retired from rowing and enrolled in a PhD program in cell biology and physiology at the Washington University in St. Louis.\nWarner is an Assistant Professor of Orthopedic Surgery at McGovern Medical School at The University of Texas Health Science Center at Houston (UTHealth). He is American Board of Orthopedic Surgery eligible and specializes in orthopedic trauma.\nWarner received his undergraduate degree from the University of Michigan in Ann Arbor, Michigan. He then worked for three years as a research associate for Bristol-Myers Squibb while also competing on the United States National and Olympic Rowing team. He attended medical school at Washington University in St. Louis, Missouri, where he also earned a PhD in molecular and cell biology. He completed his orthopedic surgery residency at the Hospital for Special Surgery and Weill Cornell Medical Center in New York, New York. He went on to complete a fellowship in orthopedic trauma at the University of Texas Health Science Center in Houston.\nWarner is a member of the American Association of Orthopedic Surgeons, AO Trauma North America, Orthopedic Research Society, and a candidate member of the Orthopedic Trauma Association.\nReferences\nExternal links\n*"
    }
  ]
}