{
  "content": [
    {
      "type": "text",
      "text": "# Steward Berroa\n\n|birth_place = Santo Domingo, Dominican Republic\n|bats        = Switch\n|throws      = Right\n|debutleague = MLB\n|debutdate   = June 23\n|debutyear   = 2024\n|debutteam   = Toronto Blue Jays\n|statleague  = MLB\n|statyear    = 2025 season\n|stat1label  = Batting average\n|stat1value  = .167\n|stat2label  = Home runs\n|stat2value  = 0\n|stat3label  = Runs batted in\n|stat3value  = 1\n|teams       =\n* Toronto Blue Jays ()\n* Milwaukee Brewers (–present)\n}}\nSteward Berroa (born June 5, 1999) is a Dominican professional baseball outfielder for the Milwaukee Brewers of Major League Baseball (MLB). He has previously played in MLB for the Toronto Blue Jays.\nCareer\nToronto Blue Jays\nBerroa signed with the Toronto Blue Jays as an international free agent on July 4, 2016. He made his professional debut in 2017 with the Dominican Summer League Blue Jays, hitting .261 over 54 appearances.\nBerroa played for the rookie–level Gulf Coast League Blue Jays in 2018, batting .282/.386/.359 with no home runs, 11 RBI, and 17 stolen bases. He spent the 2019 campaign with the rookie–level Bluefield Blue Jays, slashing .236/.349/.329 with two home runs, 13 RBI, and 14 stolen bases. Berroa did not play in a game in 2020 due to the cancellation of the minor league season because of the COVID-19 pandemic.\nBerroa returned to action in 2021 with the Single–A Dunedin Blue Jays and Double–A New Hampshire Fisher Cats. In 85 games between the two affiliates, he hit a cumulative .247/.358/.399 with career–highs in home runs (7), RBI (50), and stolen bases (48). In 2022, Berroa played in 82 games for New Hampshire and the High–A Vancouver Canadians, batting a combined .211/.315/.382 with seven home runs, 27 RBI, and 47 stolen bases. He split the 2023 campaign between New Hampshire and the Triple–A Buffalo Bisons, slashing .258/.368/.390 with seven home runs, 43 RBI, and 47 stolen bases across 125 total games.\nBerroa again began the 2024 season with Buffalo. On June 23, 2024, he was selected to the 40-man roster and promoted to the major leagues for the first time. His first major league hit was a double off Dane Dunning of the Texas Rangers on July 27. In 28 appearances for the Blue Jays during his rookie campaign, he batted .189/.333/.216 with one RBI and six stolen bases.\nBerroa was optioned to Triple-A Buffalo to begin the 2025 season. In 24 games for Buffalo, he hit .195/.267/.234 with four RBI and nine stolen bases. Berroa was designated for assignment by Toronto on May 7.\nLos Angeles Dodgers\nOn May 12, 2025, Berroa was traded to the Los Angeles Dodgers in exchange for cash considerations. He played in 27 games for the Triple-A Oklahoma City Comets, batting .330 with one home run, 11 RBI, and 11 stolen bases, before he was designated for assignment on July 3.\nMilwaukee Brewers\nOn July 9, 2025, Berroa was traded to the Milwaukee Brewers in exchange for cash.\nReferences\nExternal links"
    }
  ]
}