{
  "content": [
    {
      "type": "text",
      "text": "# Stewartry\n\nStewartry was a local government district in the Dumfries and Galloway region of south-west Scotland between 1975 and 1996. The district covered the greater part of the historic county of Kirkcudbrightshire, whose alternative name, the Stewartry of Kirkcudbright, provided the district’s title.\nFollowing the abolition of districts under the Local Government etc. (Scotland) Act 1994, the area became part of the unitary Dumfries and Galloway Council area in 1996. Under the name Stewartry of Kirkcudbright, the same area continues to be used as a lieutenancy area. Dumfries and Galloway Council maintains a Stewartry area committee whose jurisdiction broadly corresponds to the boundaries of the former district, although minor adjustments have been made where modern electoral ward boundaries differ from those in place prior to 1996.\nHistory\nStewartry district was created on 16 May 1975 under the Local Government (Scotland) Act 1973, which established a two-tier structure of local government across Scotland comprising upper-tier regions and lower-tier districts. Stewartry district was one of four districts created within the region of Dumfries and Galloway. The district covered the majority of the former administrative county of Kirkcudbrightshire, excluding the parishes of Kirkmabreck and Minnigaff on the western edge of the county, which went to Wigtown district, and the parishes of Kirkbean, Kirkpatrick Irongray, New Abbey, Terregles, and Troqueer on the eastern edge of the county, which went to Nithsdale. The district's name was derived from the alternative name for Kirkcudbrightshire as the \"Stewartry of Kirkcudbright\", referencing the fact that the area had previously been administered by a steward rather than a sheriff. The district's legal name was just \"Stewartry\", but in common usage the area is generally referred to as \"the Stewartry\".\nFor lieutenancy purposes, the last lord-lieutenant of the county of Kirkcudbrightshire was made lord-lieutenant for the new Stewartry district when it came into effect in 1975.\nFurther local government reform in 1996 under the Local Government etc. (Scotland) Act 1994 saw the four districts of Dumfries and Galloway abolished, with Dumfries and Galloway Council taking over their functions. The council continues to use the former Stewartry district as the basis of an area committee, alongside committees for the other three abolished districts of Annandale and Eskdale, Nithsdale, and Wigtown, subject to some adjustments of boundaries where ward boundaries no longer follow the pre-1996 district boundaries. The area of the former district also continues to be used for lieutenancy purposes as the Stewartry of Kirkcudbright lieutenancy area.\nPolitical control\nThe first election to the district council was held in 1974, initially operating as a shadow authority alongside the outgoing authorities until it came into its powers on 16 May 1975. Throughout the council's existence a majority of the seats were held by independents:\n{| class=\"wikitable\"\n|-\n!colspan=\"2\"|Party in control!!Years\n|-\n|  || 1975–1996\n|}\nPremises\n, 121–123 High Street, Kirkcudbright]]\nStewartry District Council was based at the former headquarters of the abolished Kirkcudbrightshire County Council, being a converted pair of late 18th century houses called the County Buildings at 121–123 High Street in Kirkcudbright, with a large extension built in 1952 to the rear facing Daar Road. Since the district council's abolition in 1996 the building has been an area office of Dumfries and Galloway Council.\nSee also\n*Subdivisions of Scotland\n*Lord Lieutenant of Kirkcudbright\nReferences\nExternal links\n*[http://www.castle-douglas.com Community website] listing community events in the Stewartry Region\n*[http://www.dalbeattie.org.uk/ Website about Dalbeattie, a town in the Stewartry]"
    }
  ]
}