{
  "content": [
    {
      "type": "text",
      "text": "# Stewart Kwoh\n\nStewart Kwoh (born September 16, 1948) is an American attorney, educator, and civil rights leader. Kwoh is the founding President and Executive Director of Asian Americans Advancing Justice - Los Angeles, formerly known as the Asian Pacific American Legal Center of Southern California (APALC).\nEarly life and education\nStewart Kwoh was born to American parents teaching in Nanjing, China, on September 16, 1948.  When Kwoh was two months old, his family moved to Shanghai, then back to America, settling in Los Angeles\nKwoh's mother, Beulah Kwoh ( Ong; stage name Beulah Quo), was a film and television actress whose trailblazing career spanned almost 50 years and included co-founding the Asian American theatre organization East West Players in 1965 as well as becoming the first Asian American woman to win a local Emmy.  Kwoh's father, Edwin Kwoh, was a businessman who was involved in a number of non-profits, including the Los Angeles chapter of Volunteers of America. Edwin Kwoh served as a local board member and helped develop the organization's China Project, which led to a number of U.S. volunteers training individuals in China on topics ranging from policing to accounting. Beulah died in 2002, and Edwin died in 2011.\nKwoh earned his Bachelor of Arts  from University of California, Los Angeles, and his Juris Doctor from the UCLA School of Law. He continues to have close ties with UCLA; he teaches at the university's Asian American Studies Department and has been an instructor at UCLA School of Law. He is a past expert in residence at UC Berkeley Boalt Hall School of Law, and has two honorary doctorates from Williams College and Suffolk School of Law.\nPersonal life\nKwoh is married to Pat Lee and has two sons, Steven and Nathan.\nAsian Pacific American Legal Center\nIn 1983, Kwoh co-founded the Asian Pacific American Legal Center, now the largest legal aid and civil rights organization serving the Asian American and Pacific Islander (AAPI) community in the United States. Under Kwoh's leadership, APALC has also opened a nonprofit center as a community resource, acts as a fiscal sponsor for several smaller nonprofit groups and has established a series of educational workshops aimed at nonprofit capacity building.\nOrganizations\nKwoh is active with foundations and other philanthropic organizations. He has been Chair of the Board of Directors of The California Endowment, which is the largest health foundation in California. He is one of the first Asian Americans to chair the board of a large foundation in the U.S. Kwoh has also been chair of the Methodist Urban Foundation, vice-chair of the California Wellness Foundation, and a trustee of the California Consumer Protection Foundation, The Tang Family Foundation, the Fannie Mae Foundation, and a former Leadership Council member of California Forward.\nHe serves on the boards of the United Way of Greater Los Angeles, Alliance for College-Ready Public Schools, KCET, and SCPR.\nPublications\nKwoh has co-authored two publications: ''Uncommon Common Group: Race and America's Future and Untold Civil Rights Stories''.\nAwards\nKwoh has been a recipient of numerous awards recognizing his efforts to build coalitions consisting of all communities of color. Associations that have honored Kwoh include: the L.A. City and County Human Relations Commissions, California Association of Human Relations Organizations, ACLU, Southern Christian Leadership Conference, Coalition for Humane Immigrant Rights of Los Angeles, the Los Angeles Urban League, the Martin Luther King Legacy Association and many other Asian American, civil rights, academic and legal organizations.\n*1998 MacArthur Fellows Program\n*2001 UCLA Law School Top Alumni of the Year for Public and Community Service\"\n*2007 California State Bar Loren Miller Legal Services Award\n*2010 Los Angeles Chamber of Commerce Civic Medal of Honor\nReferences"
    }
  ]
}