{
  "content": [
    {
      "type": "text",
      "text": "# Stewart Ainsworth\n\n|image          = Stewart Ainsworth (2007).jpg\n|image_size     = 200px\n|image_caption  =  Ainsworth during filming for Time Team, 2007\n|birth_name     = Stewart Ainsworth\n|birth_date     =\n|birth_place    = Morley, West Yorkshire, England\n|occupation     = Archaeological investigator\n|known_for      = Time Team\n}}\nStewart Ainsworth  (born 26 June 1951) is a British archaeological investigator who was regularly seen on Time Team, the Channel 4 archaeological television series he joined in 1995. He has since appeared in more than two hundred episodes.\nAfter reading, in his youth, a book about Horatio Nelson, 1st Viscount Nelson, and visiting the Tower of London, he formed an interest in the history of landscapes.\nHe trained as a surveyor before entering the archaeology section of the Ordnance Survey. He has worked on a number of archaeological sites in Britain and abroad. He joined the Royal Commission on the Historical Monuments of England (now part of English Heritage) in 1985, and was its Landscape Investigation Team based in York, England.\nHe was affectionately called Time Team's \"lumps and bumps\" man by Mick Aston, and works with the team alongside his day job, travelling the country surveying, recording and investigating archaeological sites. Regarding Time Team's potential return, which was realised in 2022 after an eight-year hiatus, Ainsworth said:\n}}\nAs of 2010, Ainsworth has been affiliated with the history and archaeology department at the University of Chester, where he is a visiting professor.\nHe is president of the Friends of Epiacum (also called Whitley Castle), the Roman fort on the southern edge of Northumberland, which he has surveyed and studied in depth.\nBibliography\n* High Park and Cow Close, Lancaster, and South Lakeland, Lancashire and Cumbria (1998) by Marcus Jecock and Stewart Ainsworth\n* Prehistoric embanked pit-alignments on Ebberston Low Moor, Ryedale, North Yorkshire (1999) by Stewart Ainsworth\n* Patterns of the past: essays in landscape archaeology for Christopher Taylor (1999) by Christopher Taylor, Paul Pattison, David Field, and Stewart Ainsworth\n* An Iron Age hillfort at Glead's Cleugh, Northumberland (2001) by Trevor Pearson and Stewart Ainsworth\n* An Iron Age hillfort and its environs on Castle Hill, Alnham, Northumberland (2001) by Trevor Pearson and Stewart Ainsworth\n* An Iron Age hillfort on Staw Hill, Northumberland (2002) by Stewart Ainsworth\n* An Iron Age hillfort and its environs on St Gregory's Hill, Northumberland (2002) by Alastair Oswald, David McOmish, and Stewart Ainsworth\n* Ring Chesters, Northumberland: an Iron Age hillfort and its environs (2002) by Alastair Oswald, Trevor Pearson, and Stewart Ainsworth\n* Stanton Moor, Derbyshire (2002) by Stewart Ainsworth\n* Where on earth are we?: the Global Positioning System (GPS) in archaeological field survey (2003) by Stewart Ainsworth and Bernard Thomason\n* Chester amphitheatre: from gladiators to gardens (2005) by Stewart Ainsworth and Tony Wilmott\n* The Roman amphitheatre at Chester: an interim account (2006) by Tony Wilmott, D. J. Garner, and Stewart Ainsworth\n* Craster, Northumberland: an archaeological investigation of a World War II radar station complex (2006) by Abby Hunt and Stewart Ainsworth\n* Understanding the archaeology of landscapes: a guide to good recording practice (2007) by Stewart Ainsworth\n* [https://archaeologydataservice.ac.uk/archives/view/eh_monographs_2014/contents.cfm?mono=1089039 Hillforts: prehistoric strongholds of Northumberland National Park] (2007) by Alastair Oswald, Stewart Ainsworth, Trevor Pearson, and Paul Frodsham.\n* Grassington lead mines, North Yorkshire: a rapid assessment of the threats posed by road management and erosion (2009) by Stewart Ainsworth and Andrew Burn\n* Whitley Castle, Tynedale, Northumberland: an archaeological investigation of the Roman fort and its setting (2009) by Dave Went and Stewart Ainsworth\n* Scordale, Cumbria: the archaeology of a North Pennine valley (2010) by Abby Hunt and Stewart Ainsworth\n* Osmington White Horse hill-figure, Dorset: a regal restoration (2013) by Stewart Ainsworth and Jon Horgan\nReferences"
    }
  ]
}