{
  "content": [
    {
      "type": "text",
      "text": "# Stewart Wood, Baron Wood of Anfield\n\n|birth_place =\n|death_date  =\n|death_place =\n|party       = Labour\n|alma_mater  = University College, Oxford (BA)Harvard University (PhD)\n}}\nStewart Martin Wood, Baron Wood of Anfield (born 25 March 1968) is a Labour life peer in the House of Lords. He is currently a Visiting Fellow  at the Blavatnik School of Government at the University of Oxford and a Senior Adviser to policy, economics and public affairs firm [https://bradshawadvisory.com/team/lord-stewart-wood Bradshaw Advisory].\nEarly life\nWood grew up in Tonbridge, Kent, and attended the Judd School. In 1986 he went to University College, Oxford, where he obtained a first-class degree in Philosophy, Politics and Economics. He then went to Harvard University as a Fulbright Scholar where he completed a PhD in government in 1996.\nProfessional career\nHe has taught at Oxford University since 1995. From 1996 to 2011 he was a Politics Tutor at Magdalen College, Oxford, where he is still an (unpaid) emeritus fellow.  In 2016 he was appointed a Fellow of Practice at the Blavatnik School of Government in Oxford.\nFrom 2001 to 2007 he was a member of the Chancellor of the Exchequer's Council of Economic Advisers, specialising in education policy, local government affairs & EU policy. He was part of the Treasury team that delivered the \"Five Tests\" assessment recommending that the UK not join the euro in 2003. From 2007 to 2010 he served as an adviser to Prime Minister Gordon Brown, covering foreign policy; Northern Ireland; and culture, media and sports policy. After the 2010 election he helped run Ed Miliband's campaign to become Leader of the Labour Party, and served as an adviser to Ed Miliband, the Labour party's leader, from 2010 to 2015.\nParliamentary career\nOn 15 January 2011, Wood was created a life peer with the title Baron Wood of Anfield, of Tonbridge in the County of Kent, and was introduced in the House of Lords on 18 January 2011, where he sits as a Labour peer. From 2011 to 2015 he served as a Shadow Minister without Portfolio.\nWriting\nWood's research and writing focuses on contemporary political economy in Europe, German politics, American politics, and public policy issues around industrial policy & the future of the welfare state. He worked with the think tank Policy Network on the concept of pre-distribution as a means to tackle what Ed Miliband has described as 'the growing crisis in living standards'. The announcement that pre-distribution would become a cornerstone of the UK Labour Party's economic policy was jokingly mocked by Prime Minister David Cameron during Prime Minister's Questions in the House of Commons.\nPositions\nIn July 2016 he succeeded Sir Jeremy Greenstock as Chair of the United Nations Association (UNA-UK). In the same month he was appointed to the Board of the Marshall Aid Commemoration Commission. He has been a board member of the Royal Court Theatre since 2006, and in 2017 he became a Director of Janus Henderson's Diversified Income Trust. In November 2018 he was appointed to the Board of the Good Law Project.\nPublications\n* S. Wood and A. Glyn, \"New Labour's Economic Policy\", in A. Glyn (ed), Social Democracy in Neoliberal Times, Oxford: Oxford University Press, 2001, pp.&nbsp;200–222.\n* \"Labour Market Regimes under Threat? Sources of Continuity in Germany, Britain, and Sweden,\" in P. Pierson (ed), The New Politics of the Welfare State, Oxford: Oxford University Press, 2001, pp.&nbsp;368–409.\n* \"Business, Government and Patterns of Labor Market Policy in Britain and the Federal Republic of Germany\", in P. Hall and D. Soskice (eds), Varieties of Capitalism: The Institutional Foundations of Comparative Advantage, Oxford: Oxford University Press, 2001, pp.&nbsp;247–274.\n* \"Education and Training\", in S. White (ed), New Labour: The Progressive Future? Basingstoke: Palgrave, 2001.\nReferences"
    }
  ]
}