{
  "content": [
    {
      "type": "text",
      "text": "# Stewart Pether\n\n|         death_place = Eynsham, Oxfordshire, England\n|            nickname =\n|              family =\n|             batting = Right-handed\n|             bowling = Right-arm medium-fast\n|                role =\n|               club1 = Oxfordshire\n|               year1 = 1936&ndash;1948\n|               club2 = Oxford University\n|               year2 = 1939\n|             columns = 1\n|             column1 = First-class\n|            matches1 = 10\n|               runs1 = 103\n|            bat avg1 = 8.58\n|           100s/50s1 = –/–\n|          top score1 = 20*\n|         deliveries1 = 1,532\n|            wickets1 = 31\n|           bowl avg1 = 20.06\n|            fivefor1 = 2\n|             tenfor1 = –\n|       best bowling1 = 5/7\n|  catches/stumpings1 = 3/–\n|                date = 24 June\n|                year = 2019\n|              source = http://www.espncricinfo.com/england/content/player/18915.html Cricinfo\n}}\nStewart Pether (15 October 1916 – 17 January 2010) was an English first-class cricketer, British Army officer and educator. Pether played first-class cricket before the Second World War for Oxford University, before serving in the war with the Gloucestershire Regiment. Following its conclusion he became a schoolteacher.\nEarly life and war service\nStewart Pether was born into an Oxfordshire farming family at Oxford in October 1916. He was educated in Oxford at Magdalen College School, before going up to St Peter's College, Oxford. He debuted in minor counties cricket for Oxfordshire in the 1936 Minor Counties Championship. While studying at Oxford he made his debut in first-class cricket for Oxford University against Yorkshire at Oxford in 1939, with him making nine further first-class appearances for Oxford in 1939. He scored 103 runs with a high score of 20 not out, while with the ball he took 31 wickets an average of 20.06, with best figures of 5 for 7, which came against Derbyshire.\nHe served in the British Army during the Second World War, enlisting in the Gloucestershire Regiment as a second lieutenant in August 1939. He was promoted to the rank of lieutenant in January 1941. He avoided being sent to Burma with the regiment when he was selected to play rugby union for the Army rugby team. He later took part in the Normandy landings in June 1944, during which his life was saved when a bullet his is brandy flask in his breast pocket. He was seriously wounded by a shell from a German 105mm artillery gun, which necessitated his evacuation to an American field hospital and repatriation back home. As a result of his injuries he resigned his commission from the army in August 1946, at which point he held the rank of captain.\nTeaching career and later life\nFollowing the war he resumed playing minor counties cricket for Oxfordshire, appearing in the Minor Counties Championship twice in 1948, having made 28 appearances in the competition since his debut in 1936. He began teaching geography at St Edward's School, Oxford, where became head of the geography department and a house master. He remained at the school until his retirement. Outside of teaching, Pether served as the long-time president of Oxford R.F.C. and volunteered for the Burford branch of The Royal British Legion. His wife, Daphne, with whom he had three children, predeceased him by some thirty years. Pether died at Eynsham in January 2010. He was survived by two of his three children, as well as his long-term partner of thirty years.\nReferences\nExternal links\n*"
    }
  ]
}