{
  "content": [
    {
      "type": "text",
      "text": "# Stewarton coat of arms\n\nThe Stewarton coat of arms represents Stewarton, in East Ayrshire, Scotland. It is described in the public Register of all Arms and Bearing in Scotland as follows:\nPer pale Or and Azure: a fess chequy per pale, dexter of the Second and Argent, sinister of the Third and Gules, surmounted of a shakefork, Sable overall, all between a bonnet of the second, with a round tassel of the Fourth, and an annulet of the First, stoned of the Fourth, in chief, and another similar bonnet and a mullet of the Third in base.\nAbove the Shield is placed a coronet a circlet richly chased from which are issuant four thistle leaves(one and two halves visible) and four pine cones(two visible) or, and in an Escrol below the same this Motto \"Knit Weel.\"\nBy demonstration of which Ensigns Armorial the Stewarton and District Community is, amongst all Nobles and in all Places of Honor, to be taken, numbered, accounted and received as an Incorporation Noble in the Noblesse of Scotland.\nOrigin of the arms\nThe roots of Stewarton go back to 1283, when the lands of Stewarton were put into a separate lordship and became the inheritance of James, High Stewart of Scotland. When the House of Stewart came to the throne of Scotland, Stewarton became property of the Crown.\nThe makeup of the arms has a long history, part of which is reputed to be due to an act which saved the life of Malcolm Canmore, who became King Malcolm III in 1058. While on the run from MacBeth's men, he was saved by a Stewarton farmer, named Cunninghame, who hid him under forked hay. Upon becoming king, he gave the farmer the Corsehill Estate.\nThe town of Stewarton developed around a church. After the Reformation the land belonging to the church passed into \"lay hands\", and Stewarton was administered by commissioners and magistrates, whose offices were not filled by free election, and their tenure has no fixed date. The act of Parliament of 1868 ended this autocratic rule and laid the foundations of democratic government. The town became a police burgh in 1868 and, like many other Scottish towns, had its coat of arms – a Stewarton Bonnet over a Shake Fork and inscribed motto \"Over Fork Over\".\nHowever, this coat of arms was not officially registered, and it was not until 1955 that the burgh obtained one. The legend of Malcolm Canmore and the Stewarton farmer was not accepted by Sir Thomas Innes of Learney, Lord Lyon King of Arms, and since he had the power of execution the town council had to accept his design.\nThe motto was changed to Knit Weel, a compliment to the towns ancient industry. The design includes part of the baronial arms of the Earls of Douglas, Earls of Arran, the Cunninghames of Corsehill, and the Montgomeries of Lainshaw. These prominent families had early association with the burgh, and their arms share a place with the bonnets, which represent the Town and Trade.\nFrom 1955 to 1975 the people of Stewarton were familiar with the coat of arms. The local government reorganisation enforced in 1975 meant that the existing burghs and their councils were abolished and the rights to use the coat of arms was lost.\nStewarton and District Community Council petitioned the Lord Lyon for the return of the Stewarton coat of arms. The re-granting of the arms ceremony, by the Lord Lyon King of Arms representative, took place prior to the Bonnet Guild's Crowning Ceremony for the Corsehill Queen on Saturday 15 June 2002.\nReferences\n* The public Heraldic Register.\n* Lyon Register Xli,8: February 1955"
    }
  ]
}