{
  "content": [
    {
      "type": "text",
      "text": "# Stewart Park, Middlesbrough\n\n| grid_ref_UK =\n| type = Urban Park\n| location = Marton-in-Cleveland, North Yorkshire\n| nearest_city = Middlesbrough\n| area =\n| elevation =\n| etymology = Named after Thomas Dormand Stewart\n| created =\n| opened =\n| designer =\n| operator =\n| visitation_num =\n| awards = Green Flag Award\n| hiking trails =\n| open = Open all year\n| website =\n| map =\n| map_width =\n| map_alt =\n| map_caption =\n}}\nStewart Park is a 120-acre public park in Middlesbrough, North Yorkshire, in the suburb and former village of Marton, England.\nIt holds a Green Flag Award from the Civic Trust.\nThe Middlesbrough campus of Askham Bryan College and the Captain Cook Birthplace Museum are within its grounds.\nHistory\nThe park was the estate of Henry Bolckow one of Middlesbrough's ironmasters and the borough's first mayor.\nBolckow landscaped the estate and in 1858 built Marton Hall in the estate.\nTo indicate the site of the cottage where Captain James Cook was born he had erected a pink granite vase still present today.\nThe estate was eventually bought by Councillor Thomas Dormand Stewart, in 1924, for the people of Middlesbrough.\nStewart intended it to be \"a public possession, open and accessible to all the people, at all times\".\nStewart's Park was officially opened to the public on 23 May 1928.\nPost war\nAfter the Second World War, Marton Hall stood empty for many years in a state of disrepair.\nIn January 1959, the Borough engineer, A Kenyon, stated in a report, \"The Hall....was of no wide historic or architectural value\" and that renovations would cost in the region of £25,000. The council decided to demolish the building.\nWork to demolish the Hall started in May 1960, but on 6 June a fire broke out and tore through the building.\nThe ten fire appliances sent to tackle fire were hampered by the lack of water supply in the area, and the building was destroyed. The hall's conservatory continued to be open to the public for a number of years, but was eventually demolished in the mid-1990s. A stone loggia next to the museum is all that is left of the hall. The remaining Victorian estate buildings were later utilised as park depot buildings and council offices.\nThe Captain Cook Birthplace Museum (opened October 1978) is also within the park, which was built over the eastern part of Marton. In September 1998, an archaeological survey showed evidence of this part of Marton. In 2003, the eastern part of Marton village (misleadingly called \"East Marton\" as if it was a separate village) was the subject of Channel 4's archaeological television programme Time Team, presented by Tony Robinson.\nToday\nThe park covers about  and consists mainly of mature woodland and arboretum on the south side, with open parkland on the northern side.\nThere are two lakes, which are the home to Canada and greylag geese, moorhens, coots and various types of duck.\nA pets' corner houses several types of domesticated animals: fallow deer, highland cattle, llamas, goats, peacocks, pheasants, rabbits and guinea pigs.\nPart of the Victorian estate complex is open to the public and includes a cafe, and visitor centre. Various nature, heritage, orienteering and tree trails are provided in the park. Play areas for children include a climbing frame named after HMS Endeavour, Captain James Cook's ship.\nThe Captain Cook Birthplace museum is situated in the middle of the park and is open to visitors from April to November.\nListed buildings\nThe temple folly, loggia, Captain Cook memorial and Victorian estate complex are all listed buildings.\nEvents\nCaptain Cook Museum\nThe Captain Cook Birthplace Museum holds regular events including school group visits alongside the regular visitor opening hours.\nParkrun\nA Parkrun takes place every Saturday morning at 9&nbsp;am. The run, one of 1,400 nationally, is a free event which encourages people to run a weekly 5&nbsp;km course to improve fitness.\nFarmers' Market\nOn the last Sunday of each month, Northern Dales Farmers' Market hold a monthly event in the park, including a craft fair.\nCleveland Show\nThe park also hosts larger events in the summer such as, fairgrounds and the annual agricultural showpiece, the Cleveland Show.  The Cleveland Show is the biggest one day agricultural show in the north east of England. It first took place in 1944 and is held annually on the fourth Saturday of July. The Show celebrated its 75th year in 2018.\nOther events\nIt has also been the venue for various BBC Radio 1 events including the 2019 edition of BBC Radio 1's Big Weekend, which saw the park welcome over 64,000 visitors during the course of the weekend festival and host performances from more than 50 artists, including Miley Cyrus, Billie Eilish, Stormzy, The 1975 and Little Mix.\nAskham Bryan College\nIn 2015, Askham Bryan College took over ownership of the Grade II listed Central Lodge building. The college runs courses in animal care and horticulture. In January 2017, the college began renovation work on the Central Lodge, with £3 million from the Heritage Lottery Fund. Renovation work included repairs to the roof and the general fabric of the building, the creation of lecture rooms, a science lab, animal handling areas, workshops and a reception area. It reopened to students in September 2017, and is Askham Bryan College's principal land-based education centre in the Tees Valley region.\nReferences"
    }
  ]
}