{
  "content": [
    {
      "type": "text",
      "text": "# Stewart Orr\n\nWilliam Stewart Orr (21 January 1872 – 1944) was a Scottish watercolour artist and book illustrator.\nBorn in Glasgow, the son of William Orr, a merchant there, the young Orr was educated at the Glasgow School of Art.\nIn 1907, The Studio reviewed his work and commented \"Stewart Orr, one of the younger men, is an artist with that rare quality, a sense of humour. This characteristic will be applicable in the role of book illustrator, in which the artist is actively engaged at the present time.\"\nOrr married Mary Stuart Douglas and was elected a member of the Royal Scottish Society of Painters in Watercolour in 1925.\nIn 1927, Who's Who in Art'' described him as \"water-colourist (chiefly), book illustrator occasionally\".\nAs an illustrator of children's books, Orr has been compared with his contemporary Harry B. Neilson. In  a book on Arthur Rackham, Fred Gettings says \"Along with Neilson, we may list Stewart Orr and Harry Rowntree... Neilson, and indeed a whole host of Victorian draughtsmen who told animal moralities and fairy stories, portray their animals in clothing... However, the important point is that, for all their human clothing, for all that they speak where necessary with human tongues, and point their morals with something verging on human gesture, these creatures always look like animals.\"\nSelected publications\n*John Brymer, Stewart Orr, Gammon and Spinach: Illustrations by Stewart Orr, Verses by John Brymer (London: Blackie & Son, 1902)\n*John Brymer, Stewart Orr, Two Merry Mariners: Illustrations by Stewart Orr, Verses by John Brymer (London: Blackie & Son, 1902)\n*Gladys M. Imlach, The Story of Christopher Columbus: by Gladys M. Imlach pictured by Stewart Orr (London: T. C. & E. C. Jack; New York: E. P. Dutton, 1906)\n*L. E. Tiddeman, ''Sahib's Birthday: Illustrated by Stewart Orr (London: Blackie & Son, 1909)\n*John Brymer, Stewart Orr, Two Jolly Mariners (London, Glasgow, Bombay: Blackie & Son, 1915)\n*Gustav Falke, Stewart Orr, Zwei lustige Zeeleute, Bilder von Stewart Orr, Verse von Gustav Falke (Cologne, 1905), German translation of Two Merry Mariners''\nNotes\nExternal links\n*[https://www.bonhams.com/auctions/20642/lot/198/ William Stewart Orr] at Bonhams"
    }
  ]
}