{
  "content": [
    {
      "type": "text",
      "text": "# Stewart Carmichael\n\n| birth_place = Dundee, Scotland\n| death_date =\n| death_place =\n| education =\nPeter D Lauder’s Central School of Art\nDundee School of Art\nArt Academy, Antwerp\nLieven Herremans' studio, Brussels\n| known_for = Celtic Revival, Symbolist, and historical scenes\n| notable_works =\n| style = Celtic Revival, Symbolist\n| movement = Celtic Revival\n| spouse = Marion (d. 1941)\n}}\nStewart Carmichael (8 February 1867 &ndash; 1950) was a Scottish painter known for his Celtic Revival, Symbolist and historical scenes. He has been described by the poet and academic Alan Riach as \"one of the first truly Modernist Scottish artists, a painter of real stature\".\nEarly life\nCarmichael was born in Heathfield Place, Dundee, on 8 February 1867. His first art training was at Peter D Lauder’s Central School of Art. In 1883, Carmichael began to train as an architect with James Hutton while taking evening art classes at Dundee School of Art, based at the High School. It was here that he met fellow artist John Duncan (1866–1945) – their careers would be closely linked for many years.\nEarly work\nIn 1887 he decided to give up on his work as an architect and try his hand as an illustrator in London, where he managed to get employment at the publishers Alexander Strachan & Co. John Duncan and fellow Dundee artist Alec Grieve (1864–1933) were also working in London at this time.\nIn 1888 Carmichael travelled to Antwerp to study at the Art Academy under Charles Verlat. Van Gogh had studied there just a few years before. From Antwerp, Carmichael moved on to Brussels to study under the more modern Lieven Herremans. He was back in Dundee in time to become one of the first recorded members of the Graphic Arts Association (now Dundee Art Society) in February 1890.\nInspired by the new style of art he had in seen on the Continent, Carmichael began working on symbolist paintings. In October 1890 he held his first solo exhibition. Shortly after this, Carmichael returned to London and from there embarked on a sketching tour of France and Italy (possibly with John Duncan), staging an exhibition at the Imperial Hotel on his return in March 1891.\nCarmichael’s introduction to French and Belgian symbolist painting clearly had a profound influence on him. In early 1891 he had painted a “decorative panel containing four heads representing Anarchy, Sorrow, Regret, and Mystery”. Later that year this idea was reworked into one of his most celebrated paintings, The Mysteries, featuring three portraits (Birth, Life and Death) in separate panels and a long landscape panel beneath them representing Eternity. In 1903, this would become the first of his paintings to enter Dundee’s permanent collection, after it was purchased from an exhibition of Carmichael’s work held by the GAA in his honour in 1902.\nCeltic Revival work\nIn the 1890s Carmichael was one of several Dundee artists who came together to occupy the city’s first shared artists’ studio at 15 Castle Street. In 1897, however, he moved to a new studio in 65 Nethergate, where he would remain for the rest of his life. He also continued his London connections, and that same year held a solo exhibition of oil paintings at Gray’s Inn.\nMost of Carmichael’s major works from this time were allegorical, but he also painted more naturalistic subjects. He also drew on Scottish literature and had a great love of traditional Highland music.\"\nDundee at this time was one of the centres of a Celtic Revival movement in Scotland that was closely related to a growing interest in Highland and Gaelic culture. One of the leading figures in this revival was Patrick Geddes, Professor of Botany at University College, Dundee. Geddes chose John Duncan as his principal collaborator on a series of Celtic Revival projects in Edinburgh, but in 1897 Duncan returned to Dundee keen to encourage other artists to adopt Celtic-style art and design. The most enthusiastic response came from Stewart Carmichael.\nPrior to Duncan’s return, Carmichael had not directly embraced subjects from Scottish history and legend, but in 1897 he produced a series of drawings inspired by dramatic incidents in Dundee’s history. They were exhibited at Thomas Murray’s gallery in Nethergate along with a decorative panel depicting Wallace, the Maker of Scotland. The following year Carmichael showed Geillis Duncan, A Dundee Witch, 1591AD at the GAA exhibition and would continue to draw on Scottish historical sources for the rest of his career.\nAs well as his exhibited paintings, Carmichael also undertook various public art commissions. Like Patrick Geddes, Carmichael believed that art should be seen and enjoyed everywhere, famously comparing it to “little green leaves that grow between the stones of the city.” In 1898 he was commissioned to paint a large panel for the Ward Chapel Mission Hall in Brown Street on the subject of Christ receiving little children. The finished work was well received by critics.\nDespite this success, Carmichael received only one further religious commission – for a large mural on the south wall of Rosebank Parish Church on Constitution Street, painted in 1904 as part of an overall redecoration of the church.\nPolitical work\nCarmichael’s most ambitious piece of public art in Dundee was political rather than religious in intent. In 1901 the Dundee Liberal Association unveiled in its new rooms at 51 Reform Street a massive mural entitled The Leaders of Scottish Liberty . The work had been acquired from Carmichael thanks to a subscription campaign. The painting was “intended to show the progress of Scottish liberty by typical figures selected from the history of the nation from early times to the present day... It shows the epoch-makers of Scottish nationality who led the way in war, in the Church, in literature, and in politics.” Its fourteen subjects covered nineteen centuries, including St Columba, William Wallace, John Knox, Robert Burns and Thomas Carlyle. The painting, executed on canvas and attached to the wall in the billiard room, was unveiled to considerable acclaim. As well as extensive local press coverage, the mural was publicised in the London Star and the Daily Chronicle, and was the subject of an illustrated feature in the Scottish Patriot.\nLike several of the Dundee artists, Carmichael was very active politically. In 1895, for example, Carmichael wrote to the Advertiser in reply to a scathing article on nationalism, saying: “Abolish this worship of land, gold and property by making them common property, as the streets of our towns, our parks, our museums are common property. Then the desire of such things will evaporate, and merge into the recognition of the idea that all things belong to one and all.” Carmichael’s ideal of socialism was “the development of man to his highest in his mental, moral, and physical nature, this only being possible by striving to give all men equal opportunities of development.” Art played an important role because “beautiful environment of life, home, and law will gradually efface from our earth mental and physical ugliness.”\nCarmichael was also a vocal advocate for women's rights. He followed his Leaders of Scottish Liberty mural design with one depicting The Scottish Heroines. It was exhibited by the GAA in 1902 and the Tayport Artists’ Circle (of which Carmichael was a founder member) in 1905, but was never turned into a full-size mural. The Advertiser described the piece: “he has grouped in an artistically decorative manner a succession of historical personages, beginning with St Margaret, Queen of Malcolm Canmore, and including many women who have made a name in Scottish history… [A]lthough exception might be taken to some of the characters selected by Mr Carmichael, the idea is excellent.” One of the selections the reviewer might have taken exception to was Carmichael’s decision to place 17th-century militant activist Jenny Geddes in the central position rather than the expected Mary Queen of Scots.\nLater work and death\nFrom the 1920s, Carmichael’s work was being championed by the poet C. M. Grieve (better known by his pen-name Hugh MacDiarmid). He claimed that “Carmichael’s studio in the Nethergate is like an oasis in the desert.”\nBy this time, the other Dundee artists who had embraced symbolism and the Celtic Revival had returned to a more conventional style. Carmichael, on the other hand, continued to paint Celtic and Highland subjects as part of a wider fascination for Scottish history and culture. During the 1910s he had become an active member of the Dundee Highland Society, and would later become one of its chieftains. He was also elected a member of the exclusive Piper’s Bairns, who honoured him with a complimentary dinner in 1928.\nOf his later Celtic paintings, the most noteworthy is his mural, The Gaelic Bards. The five-foot-long study was first exhibited in 1935 in one of his annual studio exhibitions. The full-scale mural seems never to have been commissioned, but the study attracted considerable interest at the Dundee Art Society exhibition in 1936, and that same year Carmichael loaned the painting to the Dundee Highland Society as an illustrative backdrop to a lecture he gave on the Gaelic Bards.\nCarmichael would return to Celtic subjects during the remainder of his life, while still continuing in still life and landscape painting. The death of his wife Marion in 1941 was a major blow to him and his workload reduced significantly, though he continued to support the Dundee Art Society and to serve as a governor at Dundee College of Art. He died in 1950 at the age of 83, the last of a prodigious generation of Dundee painters. A memorial exhibition was held the following year.\nReferences\nExternal links"
    }
  ]
}