{
  "content": [
    {
      "type": "text",
      "text": "# Stewart Stover\n\n| death_place   = Lafayette, Louisiana, U.S.\n| height_ft     = 6\n| height_in     = 0\n| weight_lbs    = 227\n| high_school   = Seminole (OK)\n| college       = Northeast Louisiana\n| undraftedyear = 1960\n| pastteams     =\n* Dallas Texans/Kansas City Chiefs (1960–1966)\n* Hamilton Tiger-Cats ()\n| highlights    =\n* Louisiana Monroe Hall Of Fame\n* 2× AFL Champion (1962, 1966)\n* Grey Cup Champion (1967)\n| statlabel1    = Games played\n| statvalue1    = 98\n| pfr           = S/StovSm20\n}}\nStewart Lynn \"Smokey\" Stover (August 24, 1938 – December 22, 2024) was an American football player. He played college football at Northeast Louisiana State College—now known as the University of Louisiana at Monroe—as a fullback and professionally in the American Football League (AFL) and the Canadian Football League (CFL) as a linebacker.\nStover was raised in Oilton, Oklahoma, and attended a military high school in Claremore, Oklahoma.  He played football at Murray State College in Tishomingo, Oklahoma, and at the University of Louisiana at Monroe, where he was later elected to first class of the school's hall of fame in 1978.\nWhen he was signed in 1960 as an original Dallas Texan in the American Football League, head coach Hank Stram converted him to a linebacker. He played for the Texans in their classic double-overtime victory over the two-time defending AFL Champion Houston Oilers in 1962 and for the Kansas City Chiefs when they won the 1966 AFL title, once again over a two-time defending AFL Champion, this time the Buffalo Bills. Stover then played in the first Super Bowl against the Green Bay Packers in 1967.  After leaving the Chiefs following the Super Bowl, Stover played for the Canadian Football League's Hamilton Tiger-Cats, winning the Grey Cup with them in 1967, making him the first pro football player to play in both events in a calendar year.\nAfter his football career, he moved to Lafayette, Louisiana and worked in the oil and petroleum industry.\nSee also\n* List of American Football League players\nReferences"
    }
  ]
}