{
  "content": [
    {
      "type": "text",
      "text": "# Stewart Cameron (nephrologist)\n\n| image = Stewart_Cameron_2018.jpg\n| caption = Cameron in 2018\n| birth_name = John Stewart Cameron\n| birth_date =\n| birth_place = Aberdeen, Scotland\n| death_date =\n| death_place =\n| death_cause =\n| resting_place =\n| resting_place_coordinates =\n| monuments =\n| nationality = British\n| other_names =\n| education =\n| alma_mater = Guy's Hospital\n| occupation = Nephrologist\n| employer = Guy's Hospital, King's College Medical School\n| organization =\n| known_for =\n| notable_works =\n| style =\n| television =\n| spouse =\n| partner =\n| children =\n| parents =\n| relatives =\n| awards =\n| website =\n}}\nJohn Stewart Cameron  (5 July 1934 – 30 July 2023) was a British nephrologist.\nBiography\nJohn Stewart Cameron was born in Aberdeen, Scotland on 5 July 1934. He undertook his medical training at Guy's Hospital and spent the large part of his career there and at King's College Medical School, into which it was merged. He eventually became professor of renal medicine.\nWhile at Cornell University in 1962, he became interested in dialysis. He also worked on kidney transplantation, and wrote on the history of nephrology. He was president of the European Society of Paediatric Nephrology from 1975 to 1998, the European Renal Association - European Dialysis and Transplant Association (ERA/EDTA) from 1984 to 1987, the UK Renal Association from 1992 to 1995, and the International Society of Nephrology (ISN) from 1993 to 1995. He retired from active clinical practice in 1996. He gave the Lumleian Lectures in 1997.\nCameron was made a Commander of the Order of the British Empire (CBE) in the 1998 New Year Honours, \"For services to Nephrology\", and was elected a Fellow of the Royal College of Physicians (FRCP). He was awarded the Jean Hamburger Award of the ISN in 2003, and the David M. Hume Award of the National Kidney Foundation (NKF) in 2004.\nCameron died on 30 July 2023, at the age of 89.\nReferences\nExternal links\n*"
    }
  ]
}