{
  "content": [
    {
      "type": "text",
      "text": "# Stewart Anderson (bowls)\n\n| birth_place      = Irvine, Ayrshire, Scotland\n| death_date       =\n| death_place      =\n| sport            = Lawn & indoor bowls\n| club             = Glasgow (indoors) Quarter Boolin Club (outdoors)\n| highestranking   = 1 (September 2024)\n| medaltemplates   =\n}}\n}}\nStewart Anderson (born 23 July 1985) is a Scottish international bowls player and a world champion indoors. He reached a career high ranking of world number 1 in September 2024.\nBowls career\nHe started bowling aged just 12 with Auchinleck Indoor Juniors and outdoor with Glaisnock Valley.\nHaving previously been a beaten finalist in the 2010 World Championships (where he lost out to Greg Harlow) Anderson beat Paul Foster in the final match that ended 10-10, 10-9 to secure the 2013 World indoor title.\nIn 2015 he won the triples gold medal at the Atlantic Bowls Championships. During the 2016 World Indoor Bowls Championship Anderson partnered up with Darren Burnett and the Scottish pair recorded their first Open Pairs title success.\nIn 2018 he won the Scottish International Open. Later that season, Anderson became a two-time World Open singles champion, winning the 2019 World Indoor Bowls Championship. He would defeat Simon Skelton in a tie-break in the final, where he would lose only one set in the championships.\nAnderson won the 2019 Scottish National Bowls Championships pairs title with Steven Shields for Eddlewood BC. In 2020 he won his fourth World indoor title by winning the mixed pairs with Julie Forrest and claimed a fifth when winning the open pairs for the second time with Darren Burnett in 2022.\nIn 2022, Anderson won the mixed pairs at the inaugural World Bowls Indoor Championships, partnering Alison Merrien MBE, they defeated Michael Stepney and Claire Anderson in the final. He also won the men's singles silver medal, losing to Michael Stepney in the final.\nIn 2022, he competed in the men's triples and the men's fours at the 2022 Commonwealth Games. In November 2022, he won the Scottish International Open for the second time.\nIn 2023, he won the mixed pairs final at the 2023 World Indoor Bowls Championship, with Ceri Ann Glen. He also successfully defended his Scottish International title in November. The good form continued as he won two all-Scottish finals at the 2024 World Indoor Bowls Championship, winning his third singles title and the pairs (partnering Darren Burnett again).\nAnderson reached number 1 in the world rankings in September 2024.\nPersonal life\nHe works for a joiners firm, and he married Scottish International bowler Claire Walker in April 2019. Stewart was previously engaged to fellow bowls international Kerry Packwood with whom he has a daughter, Emma Jayne.\nReferences\nExternal links\n* [https://worldbowlstour.tv/stewart-anderson/ Stewart Anderson] at World Bowls Tour ([https://web.archive.org/web/20150619073229/http://www.worldbowlstour.com/players/biography/stewart-anderson archive])\n*\n*\n*"
    }
  ]
}