{
  "content": [
    {
      "type": "text",
      "text": "# Stewarts Lane\n\n| grid_ref_UK = TQ289765\n| owner = DB Cargo UK, Govia Thameslink Railway\n| depotcode = SL (1973-)\n| type = Electric, EMU\n| opened = 1862\n| closed =\n| original = London Chatham and Dover Railway\n| pregrouping = South Eastern and Chatham Railway\n| postgrouping = Southern Railway\n| BR_region = Southern Region\n| former_depot_codes =\n}}\nmap of lines around Stewarts Lane]]\nStewarts Lane is a large railway-servicing facility in Battersea in London, England, founded by the London, Chatham and Dover Railway (LCDR) in 1862, to serve London Victoria railway station. It is sited in the midst of a maze of railway lines between 'Factory Junction' and 'Stewarts Lane Junction', adjacent to the site of the former Longhedge Railway Works and the Stewarts Lane Chord formerly used by Eurostar trains from the Kent freight lines to Waterloo International station. Prior to 1962 it was one of the largest motive power depots in the UK. Following the end of steam traction in the early 1960s it was converted into a traction maintenance depot which is currently operated by Govia Thameslink Railway.\nMotive power depot\nat Stewarts Lane. c. 1928.]]\nIn 1860, the London, Chatham and Dover Railway purchased  of land in Battersea, formerly part of the Long Hedge farm, to establish their locomotive works and the motive power depot, and to provide motive power for services from the new London Victoria railway station (then under construction). The depot was originally known as ‘Longhedge’. In February 1862, a semi-roundhouse running shed was opened with space for 26 locomotives. The site was expanded in 1875/6 with 40 tracks around the central turntable, although only half were under cover.\nThe original depot was demolished in 1880/1 and replaced by a larger 16-road through shed on the same site, which was officially known as Stewarts Lane – but usually referred to as ‘The Lane’ or ‘Longhedge’ by the men. A coaling stage, turntable and wheel drop were provided. The depot was re-organised and a large mechanical coaling plant was added to enable the depot to deal with an increased locomotive allocation after 1932, following the closure of the nearby London Brighton and South Coast Railway Battersea shed which is often confused with Stewarts Lane, but was a separate Roundhouse type shed on the other side of the LBSCR mainline from Stewarts Lane. Stewarts Lane was provided with an asbestos roof in 1934 It suffered bomb damage during the Second World War, some of which was never repaired. Otherwise it remained largely unchanged until closure to steam in 1963. Thereafter the tracks remained in use for stabling diesel locomotives, although much of the original building was destroyed by fire in 1967.\nTraction maintenance depot\nA new asbestos carriage shed was built adjacent to the running shed in the late 1950s and equipped with third rail electrification to enable it service both electric multiple units (EMUs) and electric locomotives. During the 1960s the former goods shed on the site was also converted to service diesel and electric locomotives, and both remain in use for the Stewarts Lane Traction Maintenance Depot. The depot currently operates as two separate facilities by both DB Cargo UK and Govia Thameslink Railway.\nShed codes\nUnder British Railways the depot had the code ‘73A’, then '75D', and is now ‘SL’.\nLocomotive allocation\nStewarts Lane was the largest depot of the former LCDR, providing express passenger locomotives from Victoria and Holborn Viaduct stations to Dover, Ramsgate and Ashford, and suburban trains to Bromley, Crystal Palace and Greenwich Park. After the formation of the South Eastern and Chatham Railway in 1899 the depot became the largest on the new system, with an allocation of well over 100 locomotives. The allocation declined in the early years of the Southern Railway after 1923, as more suburban lines were electrified, but then increased dramatically to more than 170 locomotives in 1934 after it took over from the former Battersea shed. 159 locomotives were allocated there in 1939 including large numbers of King Arthur and Lord Nelson classes.\nDuring the early 1950s, there were still 126 locomotives allocated and 700 men employed at Stewarts Lane, and the allocation included Pacific locomotives of the Merchant Navy, West Country and Battle of Britain classes and, for a short period, two Britannia class locomotives. The number of locomotives began to decline rapidly after 1959 following the electrification of the Chatham Main Line.\nPresent\nToday part of the depot is operated by DB Cargo UK, as a special trains operating unit. The 14-road main shed provides a home to the  electric units of the Gatwick Express, and the Pullman carriages of the Venice Simplon Orient Express (VSOE Southern Division), and is operated by Govia Thameslink Railway. It also acts as a servicing and staging point for steam locomotives operating both the VSOE, and some other special trains starting from the London area. Currently stabled steam locomotives include SR Merchant Navy Class 35028 Clan Line.\nIn 2019, the depot hosted an introduction to Episode 8 of the TV Show The Apprentice series 15 with participants hosting a service on the Belmond Pullman train.\nReferences\nSources\n*\n*\n*\n*\n*\nExternal links\nAn [http://maps.google.co.uk/?ie=UTF8&t=h&om=1&ll=51.473271,-0.141835&spn=0.00294,0.007231 overhead view] of the depot."
    }
  ]
}