{
  "content": [
    {
      "type": "text",
      "text": "# Stewart County High School (Georgia)\n\n| district                = Stewart County School District\n| principal               = LeTasha S. Lang\n| teaching_staff          = 11.60\n| ratio                   = 10.26\n| enrollment              = 119\n| enrollment_as_of        = 2022-2023\n| type                    = Public\n| us_nces_school_id       =\n| grades                  = 9 to 12\n| athletics_conference    =\n| motto                   =\n| mascot                  = Royal Knight\n| mascot_image            =\n| nickname                =\n| colors                  = Royal blue and gold\n| established             = 1973\n| homepage                =\n}}\nStewart County High School (formerly Stewart-Quitman High School), established in 1973, is located in Lumpkin, Georgia, United States. As of 2009, It serves the entirety of Stewart County, Georgia. In June 2018, construction was completed on an addition to Stewart County Elementary and Middle School which now serves as the High School.\nTies with Quitman County\nFollowing the burning of Georgetown High School in 1978, students from Quitman County attended Stewart County High School (then known as Stewart-Quitman High). In 2007 Quitman County approved the building of a new high school in Georgetown, Georgia, and in 2009; Quitman County High School opened.\nAthletics\nThe school has teams for football, men's and women's basketball, men's and women's track and field, women's volleyball, and baseball and currently play in Class A Public Region 5. Their mascot is the Royal Knight. While the basketball and volleyball teams play at the new school buildings' gymnasium, the baseball and football teams currently play at the old Stewart County High School Building which has since been repurposed into the Fountain B Wims Community Center.\nExtra-Curricular Activities\nThe School offers Dual-Enrollment Classes with Columbus Technical College, which offers certification credits in Nursing and Business. The school also offers several electives such as JROTC, CTAE(Career, Technical, and Agricultural Education), and Music Education Courses. The school also has an academic team that travels to academic competitions in the area, as well as a 4H Club.\nReferences\nExternal links\n*[http://schs.stewart.k12.ga.us/ School web page]"
    }
  ]
}