{
  "content": [
    {
      "type": "text",
      "text": "# Stewart Shining\n\nStewart Shining is a New York City-based photographer of contemporary actors, musicians, and models. His work has appeared in Vanity Fair, Mademoiselle, Interview, Vogue, Allure, GQ and Seventeen. He has worked on ad campaigns for Abercrombie & Fitch, Victoria's Secret, J. Crew, Ralph Lauren, Express, The Gap and Calvin Klein. In 2001, he photographed Elsa Benítez, Luján Fernández, Daniela Peštová, and Shakara Ledard for the Sports Illustrated Swimsuit Issue, and one of his photos of Benítez was selected for the cover.  He has continued to participate as a regular photographer for the annual Swimsuit Issue and shot for the \"body painting\" feature for 2011.\nBiography\nShining was born in 1964 to Streeter and Barbara Shining, and grew up in Rapid City, South Dakota. Shining said he started taking pictures when he was 12 years old after purchasing a second hand 35 mm camera. His parents encouraged his pursuit of photography by building him a darkroom in their home. He graduated in 1982 from Central High School in Rapid City, and received a bachelor of fine arts degree in photography from Parsons School of Design in 1986. After his graduation from Parsons, he worked as an assistant for Bill King and then Bruce Weber. Shining said he learned \"the art of photography\" from Weber, and King gave him a \"sensible business perspective\".\nCareer\nHis work has appeared in numerous publications, including: Vanity Fair, Mademoiselle, Interview, Vogue, Allure, GQ Seventeen, Out Magazine and has produced numerous covers for Rolling Stone magazine including covers in back to back months in 2002.  He has also had numerous cover shots for Lucky, Self and Glamour. He has shot a pre-teen Natalie Portman, and photographed Drew Barrymore when she was named People Magazine's 2007 \"World's Most Beautiful Person\". Other subjects he has worked with include: Evangeline Lilly, Pink, Bridget Hall, Keira Knightley, and Alessandra Ambrosio. In 2008, Shining took Alicia Keys' publicity shots for As I Am, and also in 2008 his photos of Rachel Bilson appeared in Lucky. In 2012, a photograph of Michelle Obama taken by Shining was featured on the cover of ''Essence's book A Salute to Michelle Obama, and in 2014 he photographed Hillary Clinton for a cover of People Magazine. In 2021, his first book was released, titled Alessandra by Stewart Shining'' which featured never before seen images of Alessandra Ambrosio. One of Shining's favorite photos occurred on assignment in Phuket, Thailand when a model jumped in the rain-pelted ocean.\nHe has worked on ad campaigns for Abercrombie & Fitch, Victoria's Secret, J. Crew, Ralph Lauren, Express, The Gap and Calvin Klein.\nShining serves on the Robert Mapplethorpe Foundation, and is the president of ACRIA.  He has volunteered to take photographs on behalf of the Heart Gallery of New Jersey to help children find adoptive parents.\n}}\nExternal links\n*[http://stewartshining.com/ Personal website]\n*[https://models.com/people/stewart-shining Stewart Shining] at Models.com"
    }
  ]
}