{
  "content": [
    {
      "type": "text",
      "text": "# Stockton, Warwickshire\n\n|civil_parish             = Stockton\n|population               = 1,505\n|population_ref           = (2021 Census)\n|shire_district           = Stratford-on-Avon\n|shire_county             = Warwickshire\n|region                   = West Midlands\n|constituency_westminster = Kenilworth and Southam\n|post_town                = SOUTHAM\n|postcode_district        = CV47\n|postcode_area            = CV\n|dial_code                = 01926\n|os_grid_reference        =\n|static_image_name        = High Street, Stockton - geograph.org.uk - 1314178.jpg\n|static_image_caption     = High Street, Stockton\n}}\nStockton is a village and civil parish in the Stratford-on-Avon district of Warwickshire, England, with a population of 1,505 at the 2021 Census. It is just east of the A426 road, 2 miles north-east of Southam and 8 miles south-west of Rugby. The name was first recorded in 1272 and means \"a fenced enclosure\". In the 19th century, it developed as an industrial village.\nEconomy\nToday Stockton is largely a commuter village.\nIndustry\nStockton has long been associated with the manufacture of lime and cement. The village is surrounded by areas of blue lias clay, a raw material used in cement manufacture. This is reflected in the name of a nearby pub, the 'Blue Lias', beside the Grand Union Canal on the road to Long Itchington (the title-deeds of the pub date back to 1809). As early as the 1850s workings in the area were extensive and the quarries in Stockton were among the first to be dug. By the early 20th century, Mssrs Charles Nelson and Co Ltd operated a large cement works half-a-mile north of the village which was closed and demolished in 1949. The extensive quarries remain and are known locally as the 'cally pits'.\nThe Nelson company was the biggest employer in the village and built the Nelson Club [https://web.archive.org/web/20121112211826/http://nelsonclubstockton.co.uk/] in May 1914, a working men's club, which is still thriving to this day. There are darts, pool and dominoes. A friendly atmosphere and cheaper drinks for members. Nelson's cement works was served by the ex-LNWR (later LMS) Weedon to Leamington railway line. The works was also connected to the Warwick and Napton Canal, later part of the Grand Union Canal by a short canal arm leading to a loading dock; much of the company's traffic was carried on the waterways. The arm, now truncated and silted, is still visible. There was a footbridge across the main line of the canal by the junction to give access to the cement works but no trace of the bridge remains.\nFor many years, Nelson operated its own fleet of narrowboats which in the early years of the 20th century included three steam-powered vessels named Jason, Janet and Jupiter. Another large cement works at Southam was operated by the Rugby Portland Cement Co Ltd and was situated two miles west of the village. This establishment operated until the 1990s and quarrying has continued there since manufacturing ceased. Southam was closed in 2000 when the cement works in nearby Rugby was expanded and modernised.\nTransport\nStockton Is located just off the A426 road, turning off it at the junction with the unclassified road that runs through the village takes you almost immediately into the village. It is the only road that runs through the village and thus there are only two ways in and out. There is a footpath from the park at the side of the village to the nearby town of Southam, the village is also served by the 63 bus that goes either to Leamington Spa or Rugby. Stockton was served by the former Weedon to Leamington railway line which crosses the northern edge of the parish. The station, which was a short walk from the village, was called Napton and Stockton and also served Napton-on-the-Hill about two miles away. The line closed to passengers in 1958 and to all traffic a few years later.\nAmenities\nThe village has a pub (The Crown Inn), with another two close by on the canal (The Boat Inn & The Blue Lias), a Working Men's Club (The Nelson Club) and a Football and Cricket Club, a Village Shop with a Post Office attached, a Village Hall, a Chinese takeaway, a cafe, and a Primary school. Stockton hosts an annual beer festival on the late Spring bank holiday (established 2013) and in 2016 it was held over 4 venues, The Crown, Football Club, Nelson Club and Boat Inn with its own campsite located at the Football Club.\nThe Quarry\nIn 1898 a large fossil of an Ichthyosaurus was found locally. It is now at the Natural History Museum in London; in recent years an image of an Ichthyosaurus has been used on the sign at the entrance to the village. Part of the disused quarries and the neighbouring railway cutting are now a nature reserve. The disused quarries known locally as Cally Pits (with \"Cally\" being short for \"California\" after the 1800s gold rush location) have been the subject of controversy in the area for many years. In the summer of 1995 it was invaded by New Age travellers. The night before they were due to be evicted they held an all-night rave which could be heard as far away as Long Itchington. The publicity surrounding this event caused an increase in trespass in the main larger quarries, which had long been fenced off, and this led to several accidents. Rugby Cement, who owned the site, built a substantial galvanised steel paling fence round a large part of the former quarries at a cost of roughly £70,000.\nSince this in 2009 two further unpopular fences at a cost of a further £70,000 have been erected around the two other pits locally known as; The Square Pit and the Long Pit, due to their shapes. The long pit is estimated to be 35 meters deep. As part of the wildlife preserve, which features rare Butterfly species, many changes have been undertaken at the site since 2008. This has caused a lot of upset to locals. In 2017 the canal siding for the old cement works has been unearthed and reinstated, this has also unearthed some remnants of the old cement works, a new bridge over the siding where the railway line used to cross it has also been erected.\nGallery of images\nImage:stockton-001.jpg|The sign on the road from Napton; note the image of an ichthyosaurus\nImage:StocktonPostOfficeWarwickshire.jpg|The post office in the centre of the village and, right, the village school\nReferences\n*Warwickshire Towns & Villages, Geoff Allen, 2000\nExternal links\n*[http://www.stockton-warks-pc.gov.uk/ Stockton Parish Council]"
    }
  ]
}