{
  "content": [
    {
      "type": "text",
      "text": "# Stockinger\n\nStockinger is an Austrian-made police television drama, with fourteen 45-minute episodes first aired from 1996 to 1997.\nThe series is a spin-off from the popular Austrian television drama Inspector Rex, and focuses on Ernst Stockinger, one of the original members of the homicide division or Mordkommission in German.\nStockinger (Karl Markovics) leaves the series to return to Salzburg where his wife (who did not appear in the original series) has inherited a dental practice from her late father. He is appointed as Bezirksinspektor (District Inspector) at the Landes Gendarmerie (provincial police force), sharing an office with District Inspector Antonella Simoni (Sandra Cervik).\nUnlike the members of the team in Rex, who appear to be self-directed and are seldom seen to answer to senior management, Stockinger reports to Dr Brunner (Herr Hofrat), a philosophising bureaucratic senior police inspector.\nStockinger is portrayed as a clumsy, almost Inspector Clouseau-like character, driving a clapped-out 1973 VW Variant, but single-minded when following up clues.\nThe series was first broadcast in Australia in February 2008 on SBS television. SBS was responsible for the English subtitles therefore bringing the series to a wider audience than simply those with a knowledge of the German language. SBS also provided the English subtitles for all the Inspector Rex series. The series has since been released in two parts on DVD.\nFirst Episode\n'Stocki' arrives at the height of the Salzburg Festival, receiving free tickets to the annual performance of Jedermann (which he misses). Coincidentally, this event will set the scene for his first case which involves the murder of one of the city's chocolatiers, Herr Fehling. His bitter business rival, Baldinger, is the obvious suspect but Stockinger is not prepared to jump to conclusions.\nList of episodes\n#Salzburger Balls\n#Fatal Night\n#Last Stop Hallstadt\n#Corpse in a Field of Daffodils\n#Innocent Lambs\n#Horror on the Traun\n#Murder Season at See-Hotel\n#The Secret of Krimmler Falls\n#The Power of The Dead\n#Living Targets\n#Arrows at Tennegau\n#Still Water\n#Clues to a Death\n#Death at Saalbach\nExternal links\n*[http://www.theage.com.au/news/tv-reviews/stockinger/2008/02/27/1203788419477.html review on The Age website]\n*[https://www.imdb.com/title/tt0112180/ Stockinger at The Internet Movie Database]\n*[http://www.tvsi.de/krimiserien/stockinger.php Episode Synopses] (in German)"
    }
  ]
}