{
  "content": [
    {
      "type": "text",
      "text": "# Stoddard King\n\nStoddard King (August 19, 1889 – June 13, 1933) was an American author and songwriter.\nBiography\nKing was born on August 19, 1889, Jackson, Wisconsin to Louis Andrew King and his wife, Clara Viola (Stoddard) King.  At a young age, King and his family moved to Spokane, Washington, where his father acted as a freight agent for the Spokane International Railway. In 1907, King began to work for The Spokesman-Review. The owner, William H. Cowles encouraged King to apply to Cowles alma mater, Yale University, and loaned the King family money for the tuition. While attending Yale, King was an editor of the Yale Record and managing editor of the Yale Daily News, and a member of the Elizabethan Club and Skull and Bones, while continuing to write for The Spokesman-Review. King became a very popular writer for magazines across the nation. Some of his best known pieces are “What the Queen Said” and “The Raspberry Tree”. People often liked King’s writing because of the humor he added to it. People also liked King because he was gentle, loving, sane, dignified, and friendly.\nDuring his time at Yale, King also helped write the song “There's a Long Long Trail A-Winding”. The song ended up being one of King’s best-known works and even became a World War I anthem. Not only could King write well, he was also very smart. He graduated from Yale as eighth in his class. After college, King began working for Harper’s Weekly as an associate editor. He also served in the National Guard during World War I. In 1914, King joined the American Society of Composers, Authors and Publishers (ASCAP), after he had worked with Alonzo Elliot and composed other songs such as “There’s A Wee Cottage On The Hillside” and “Enchanted River”. Although known for many things, King still preferred to be recognized as a columnist for The Spokesman-Review. He eventually returned to Spokane, where he died on June 13, 1933, at forty-three years of age.\nLiterature and literacy criticism\nKing was a poet, humorist and columnist. As a humorist, his work is uncommon because it comes from the West. His work can be categorized with other notable humorists such as Mark Twain and Eugene Field, although they came from Missouri.  Also, his style is unlike classic humorists of European literature, although he drew influence from them.\nKing’s poetry while writing daily as a columnist for the Spokane Spokesman-Review consistently reflects his comic sensibility. However, his work cannot be solely deemed humorous, for many of his poems have outstanding merit. An example are his volumes of poetry that were published in New York and written in rhyme and meter. Highly esteemed poet Vachel Lindsay confirms the quality of King’s poems, saying:\n“Stoddard, the King of the revels of Spokane, is a jester of royal descent. He is to be compared to Falstaff, in the taverns, to Touchstone in the Forest of Arden. He is the grave digger in Hamlet, the porter listening to the gate in Macbeth. He is like the jester in King Lear, faithful to Cordelia. He is like Ariel, in the Tempest. Ninety of the pieces in his book are royal wit, and nine of them are big poems.\"\nHis publicity agent Lee Keedick was another advocate for the undeniable quality of King’s work. Not only does he discuss his work but also his in-person presentation of it. “His appearance in a lecture tour will enable his hearers to get the best possible presentation of his carefully fashioned verses, for he reads his own poetry with the inimitable style of a born actor.”\nLiterature and songs\n: What the Queen Said, and Further Facetious Fragments (1924)\n: Ballad of the Spirit of Christmas (1926)\n: Grand Right and Left (1927)\n: Listen to the Mocking-Bird (1928)\n: The Raspberry Tree, and Other Poems of Sentiment and Reflection (1930)\n: Pioneer Daze (1930)\n: \"There’s a Long, Long Trail A-Winding\"\n: \"There’s a Wee Cottage on the Hillside\"\n: \"Enchanted River\"\n: \"Oh Oh Abdullah\"\n: \"Roll Along, Cowboy\"\n: \"Tiddedidee-o\"\nReferences"
    }
  ]
}