{
  "content": [
    {
      "type": "text",
      "text": "# Stoneware\n\ntea bowl with \"hare's fur\" glaze, southern Song dynasty, 12th century, Metropolitan Museum of Art (see below)]]\nStoneware is a broad class of pottery fired at a relatively high temperature, to be impervious to water. A modern definition is a vitreous or semi-vitreous ceramic made primarily from stoneware clay or non-refractory fire clay.\nThis definition excludes stone vessels that are carved from a solid chunk of stone. End applications of stoneware include tableware and decorative ware such as vases.\nStoneware is fired at between about  to . Historically, reaching such temperatures was a long-lasting challenge, and temperatures somewhat below these were used for a long time.\nIt was developed independently in different locations around the world, after earthenware and before porcelain. Stoneware is not recognised as a category in traditional East Asian terminology, and much Asian stoneware, such as Chinese Ding ware for example, is counted as porcelain by local definitions. Terms such as \"porcellaneous\" or \"near-porcelain\" may be used in such cases. Traditional East Asian thinking classifies pottery only into \"low-fired\" and \"high-fired\" wares, equating to earthenware and porcelain, without the intermediate European class of stoneware, and the many local types of stoneware were mostly classed as porcelain, though often not white and translucent.\nOne definition of stoneware is from the Combined Nomenclature of the European Communities, a European industry standard. It states:\nStoneware, which, though dense, impermeable and hard enough to resist scratching by a steel point, differs from porcelain because it is more opaque, and normally only partially vitrified. It may be vitreous or semi-vitreous. It is usually coloured grey or brownish because of impurities in the clay used for its manufacture, and is normally glazed.\nTypes\nFive basic categories of stoneware have been suggested:\n* Traditional stoneware: a dense and inexpensive body. It is opaque, can be of any colour and breaks with a conchoidal or stony fracture. Traditionally made of fine-grained secondary, plastic clays which can be used to shape very large pieces.\n* Fine stoneware: made from more carefully selected, prepared, and blended raw materials. It is used to produce tableware and art ware.\n* Chemical stoneware: used in the chemical industry, and when resistance to chemical attack is needed. Purer raw materials are used than for other stoneware bodies. Has largely been replaced by chemical porcelain.\n* Thermal shock resistant stoneware: has additions of certain materials to enhance the thermal shock resistance of the fired body.\n* Electrical stoneware: historically used for electrical insulators, although it has been replaced by electrical porcelain.\nAnother type, Flintless Stoneware, has also been identified. It is defined in the UK Pottery (Health and Welfare) Special Regulations of 1950 as: \"Stoneware, the body of which consists of natural clay to which no flint or quartz or other form of free silica has been added.\"\nProduction\njug with Albany slip glaze on the top, c. 1900, Red Wing, Minnesota]]\nMaterials\nThe compositions of stoneware bodies vary considerably, and include both prepared and 'as dug'; the former being by far the dominant type for studio and industry. Nevertheless, the vast majority will conform to: plastic fire clays, 0 to 100%; ball clays, 0 to 15%; quartz, 0%; feldspar and chamotte, 0 to 15%.\nThe key raw material is either naturally occurring stoneware clay or non-refractory fire clay. The mineral kaolinite is present but disordered, and although mica and quartz are present their particle size is very small. Stoneware clay is often accompanied by impurities such as iron or carbon, giving it a \"dirty\" look, and its plasticity can vary widely. Non-refractory fire clay may be another key raw material. Fire clays are generally considered refractory, because they withstand very high temperatures before melting or crumbling. Refractory fire clays have a high concentration of kaolinite, with lesser amounts of mica and quartz. Non-refractory fire clays, however, have larger amounts of mica and feldspar.\nstoneware plate from the 1850s with white glaze and transfer printed design. Visually this hardly differs from earthenware or porcelain equivalents.]]\nFiring\nStoneware can be once-fired or twice-fired. Maximum firing temperatures can vary significantly, from 1100&nbsp;°C to 1300&nbsp;°C depending on the flux content. Most commonly an oxidising kiln atmosphere is used. Typically, temperatures will be between 1180&nbsp;°C and 1280&nbsp;°C. To produce a better quality fired glaze finish, twice-firing can be used. This can be especially important for formulations composed of highly carbonaceous clays. For these, biscuit firing is around 900&nbsp;°C, and glost firing (the firing used to form the glaze over the ware) 1180–1280&nbsp;°C. After firing the Water absorption should be less than 1 per cent.\nHistory\nAsia\n, Qing dynasty, c. 1765–1835, with painted slip.]]\nThe Mature Indus Valley civilization (2600-1900 BC), produced stoneware bangles, within its urban centers.\nEarly examples of stoneware have been found in China, naturally as an extension of higher temperatures achieved from early development of reduction firing, with large quantities produced from the Han dynasty onwards.\nIn both medieval China and Japan, stoneware was very common, and several types became admired for their simple forms and subtle glaze effects. Japan did not make porcelain until about 1600, and north China (in contrast to the south) lacks the appropriate kaolin-rich clays for porcelain on a strict Western definition. Jian ware in the Song dynasty was mostly used for tea wares, and appealed to Buddhist monks.  Most Longquan celadon, a very important ware in medieval China, was stoneware. Ding ware comes very close to porcelain, and even modern Western sources are notably divided as to how to describe it, although it is not translucent and the body often grey rather than white.\nIn China, fine pottery largely consisted of porcelain by the Ming dynasty, and stoneware was mostly restricted to utilitarian wares and those for the poor. Exceptions to this include the unglazed Yixing clay teapot, made from a clay believed to suit tea especially well, and Shiwan ware, used for popular figures and architectural sculpture.\nIn Japan many traditional types of stoneware, for example Oribe ware and Shino ware, were preferred for chawan cups for the Japanese tea ceremony, and have been valued up to the present for this and other uses. From a combination of philosophical and nationalist reasons, the primitive or folk art aesthetic qualities of many Japanese village traditions, originally mostly made by farmers in slack periods in the agricultural calendar, have retained considerable prestige. Influential tea masters praised the rough, spontaneous, wabi-sabi, appearance of Japanese rural wares, mostly stoneware, over the perfection of Chinese-inspired porcelain made by highly skilled specialists.\nStoneware was also produced in Korean pottery, from at least the 5th century, and much of the finest Korean pottery might be so classified; like elsewhere the border with porcelain is imprecise.  Celadons and much underglaze blue and white pottery can be called stoneware.\nHistorical stoneware production sites in Thailand are Si Satchanalai and Sukhothai. The firing technology seems to have come from China.\nEurope\njasperware salt cellar with The Dancing Hours, 1780–1785]]\nIn contrast to Asia, stoneware could be produced in Europe only from the late Middle Ages, as European kilns were less efficient, and the right sorts of clay less common. Some ancient Roman pottery had approached being stoneware, but not as a consistent type of ware. Medieval stoneware remained a much-exported speciality of Germany, especially along the Rhine, until the Renaissance or later, typically used for large jugs, jars and beer-mugs.  \"Proto-stoneware\", such as Pingsdorf ware, and then \"near-stoneware\" was developed there by 1250, and fully vitrified wares were being produced on a large scale by 1325. The salt-glazed style that became typical was not perfected until the late 15th century.\nEngland became the most inventive and important European maker of fancy stoneware in the 18th and 19th centuries, but there is no clear evidence for native English stoneware production before the mid-17th century.  German imports were common from the early 16th century at least, and known as \"Cologne ware\", after the centre of shipping it rather than of making it. Some German potters were probably making stoneware in London in the 1640s, and a father and son Wooltus (or Woolters) were doing so in Southampton in the 1660s.\nIn the second half of the 18th century Wedgwood developed a number of ceramic bodies. One of these, Jasperware, is sometimes classified as stoneware although its raw materials differ considerably from all other stonewares; it remains in production. Other manufacturers produced their own types, including various ironstone china types, which some classified as earthenware.\nSignificant amounts of modern, commercial tableware and kitchenware use stoneware, and it is common in craft and studio pottery. The popular Japanese-inspired raku ware is normally stoneware.\nHistorical examples\n, England, 1875]]\n* Bartmann jug: A decorated stoneware form that was manufactured in Europe throughout the 16th and 17th centuries, especially in the Cologne region of Germany.\n*Redware: Unglazed stoneware with a terracotta red, initially imitating Chinese Yixing ware teapots. Mostly c. 1680–1750. The Dutch-German Elers brothers brought it to Staffordshire in the 1690s.\n* Böttger Ware: A dark red stoneware developed by Johann Friedrich Böttger by 1710, a superior form of redware. It is a very significant stage in the development of porcelain in Europe.\n* Cane Ware: An eighteenth-century English stoneware of a light brownish-yellow colour (like bamboo), developed by Josiah Wedgwood in the 1770s.  During the 19th and the earlier part of the 20th century, cane ware continued to be made in South Derbyshire and the Burton-on-Trent area as kitchen-ware and sanitary-ware. It had a fine-textured cane-coloured body with a white engobe on the inner surface often referred to as cane and white. lion at Twickenham Stadium]]\n* Crouch Ware, now often just called  Staffordshire: salt-glazed stoneware.  Light-coloured, developed in 1696 in Burslem. It is one of the earliest types of stoneware made in England.  The origin of the name has been disputed: on one theory, the ingredients included a clay from Crich, Derbyshire, the word \"crouch\" being a corruption.  On another, it comes from Creussen near Bayreuth in Bavaria, whose type of tall cruche jugs were called \"crouch\" when imported to England.\n* Jasperware: Another Wedgwood development, using tinted clay bodies in contrasting colours, unglazed.\n* Rosso Antico: A red, unglazed stoneware made in England during the 18th century by Josiah Wedgwood. It was a refinement of the redware previously made in North Staffordshire by the Elers brothers.\n* Coade stone: A type of artificial stone moulded into sculptures and architectural details, imitating marble. Developed in England around 1770.\n* Ironstone china – patented in 1813, often classed as earthenware, but very strong and vitreous, and popular for wares with heavy usage.\n* Stone china – made in Staffordshire, mainly in the first half of the 19th century.  Very hard, opaque, giving \"a clear ring when lightly tapped\". Typically brightly decorated by transfer printing, often with outlines that were finished in overglaze enamels by hand.\n* American stoneware: The predominant houseware of 19th century North America, where the alternatives were less developed.\nGallery\nFile:Tea caddy, Meissen, c. 1710, brown Bottger stoneware - Germanisches Nationalmuseum - Nuremberg, Germany - DSC02613.jpg|Brown Bottger tea caddy, ~1710\nFile:Teapot, 1779-1780, Caneware molded in the form of cut bamboo - Wedgwood Museum - Barlaston, Stoke-on-Trent, England - DSC09590.jpg|Caneware teapot in the form of cut bamboo, 1779-1780\nFile:Teapot, England, probably early 1700s, red stoneware - Germanisches Nationalmuseum - Nuremberg, Germany - DSC02617.jpg|English red stoneware, early 1700s\nFile:Jar, Han dynasty, stoneware with glaze, Honolulu Museum of Arts.JPG|Glazed Chinese stoneware storage jar from the Han dynasty\nFile:Bottle, ginger beer (AM 2007.100.1-1).jpg|Stoneware ginger beer bottle\nFile:Late Victorian Royal Doulton stoneware lavatory bowl (FindID 108869).jpg|Stoneware toilet bowl. Royal Doulton, 1898\nFile:Rohrmann Krauschwitz.jpg|Advertisement for Chemical stoneware, Germany 1888\nFile:-2019-12-18 Denby ΄Studio Grey΄ range, Norwich (2).JPG|Contemporary Denby stoneware for sale in Norwich, Norfolk\nCitations\nGeneral sources\n* Hughes, G. Bernard, The Country Life Pocket Book of China, 1965, Country Life Ltd\n* Wood, Frank L., The World of British Stoneware: Its History, Manufacture and Wares, 2014, Troubador Publishing Ltd, , 9781783063673\nExternal links\n* [https://web.archive.org/web/20090520072843/http://cf.hum.uva.nl/galle/avondster/beardman.html Beardman jugs from the Avondster site Photographs and history of early Rhenish stoneware vessels]\n* [http://www.asiasocietymuseum.org/region_results.asp?RegionID=6&CountryID=14&ChapterID=43 Japanese stoneware in the collection of the Asia Society]\nit:Ceramica#Il grès"
    }
  ]
}