{
  "content": [
    {
      "type": "text",
      "text": "# Stone quarries of ancient Egypt\n\nSilsileh quarrying site, near Aswan]]\nThe stone quarries of ancient Egypt once produced quality stone for the building of tombs and temples and for decorative monuments such as sarcophagi, stelae, and statues. These quarries are now recognised archaeological sites. Ancient quarry sites in the Nile valley accounted for much of the limestone and sandstone used as building stone for temples, monuments, and pyramids. Eighty percent of the ancient sites are located in the Nile valley; some of them have disappeared under the waters of Lake Nasser and some others were lost due to modern mining activity.\nSome of the sites are well identified and the chemical composition of their stones is also well known, allowing the geographical origin of most of the monuments to be traced using petrographic techniques, including neutron activation analysis.\nIn June 2006, the Supreme Council of Antiquities (SCA) of Egypt established a new department for conservation of ancient quarries and mines in Egypt. The new department was designed to work in close cooperation with the regional SCA offices, and special training programmes for Inspectors of Antiquities will be carried out to enable the regional authorities to tackle inventory, documentation, risk assessment and management of the ancient quarries and mines.\nThis article details some of the most important ancient quarry sites in Egypt, listing material type and known monuments using sourced material when known. Quarry sites are listed by location from North to South.\nAbu Rawash\nAbu Rawash is located 8 km (5 mi) north of Giza and is home to the pyramid of Djedefre and the ruins of the first pyramid of Lepsius. A necropolis is located at the site, sat on top of a small hill and contains twelve mastabas dated to the 1st dynasty.\nTypical materials known from this site are:\n* Limestone\nGebel el Ahmar\nare two massive statues made from blocks of quartzite quarried from Gabel el Ahmar.]]\nGebel el Ahmar is located near Cairo on the east bank of the Nile, near the suburb of Heliopolis. The name means Red Mountain. The site was in full production in the times of Amenhophis III, Akhenaton, Tutankhamon, and Ramses III. The quarry was directed by Huy, known as \"Chief of the King's Works\", and also by Hori. The quarry was active during the Pharonic period and is now largely destroyed in modern time.\nTypical materials known from this site are:\n* Red and brown silicified sandstone or quartzite\nSome of the monuments known to come from this site are:\n* The Colossi of Memnon\nMokattam Hills\nThe Mokattam hills are a site located near Memphis. The hills were quarried for limestone during the pharonic period.\nTypical materials known from this site are:\n* Mokattam limestone\nTura-Masara\nTura-Masara is located 12 km (7.5 mi) south of Cairo and spans 6 km (3.7 mi) of underground quarries along the eastern bank of the Nile. The Tura quarry and Masara quarry are often separated, viewed individually, but due to their proximity they are more appropriately recognized as one extended system. The quarries were active sometime during the Old Kingdom through the Late Period and remain partially destroyed in present day.\nquarry in Tura by Karl Richard Lepsius, a 19th century Prussian Egyptologist.]]\nTypical materials known from this site are:\n* High quality, fine-grained white limestone\nSome of the monuments known to use materials from this site are:\n* Casing stones for 4th-6th dynasty pyramids\n* Memphite necropolis in the 12th dynasty\nUmm es-Sawan\nUmm es-Sawan is located on Gevel el-Qatrani, Faiyum, 20 km (12.4 mi) north-east of Wide el-Faras in the landscape of the Northern Faiyum Desert. The white gypsum from this site occurs in near-vertical veins that cross-cut the other stratigraphy. The quarry was active during the Pharonic period and remains largely intact.\nTypical materials known from this site are:\n* Fine-grained white gypsum or alabaster\nWidan el-Faras\nWidan el-Faras is located on Gebel el-Qatrani, Faiyum, 60 km (37 mi) southwest of Cairo in the Western Desert and is one of the oldest preserved hard-stone quarries sites. Widen el-Faras, literarily translates to \"Ears of the Mare\" and is named for the twin peaks located east of the quarry site. The quarry landscape of the Northern Faiyum Desert comprise both the Umm es-Sawan and Widan el-Faras basalt quarries, both heavily exploited for hardstone during the Old Kingdom pyramid age due to their proximity to the Nile Valley. The quarry was active between the Old Kingdom and Late Period. The ancient quarries have since been partially destroyed but Widen el-Faras continues to be a site for modern quarrying through the 20th century.\nTypical materials known from this site are:\n* Dark gray to black basalt\n* Petrified wood\n* Gypsum\nSome of the monuments known to use materials from this site are:\n* 4th and 5th dynasty mortuary temple walls and floors\n* Blocks of basalt made up the floor of the funerary temple east of Khufu's Great Pyramid\n* 11.5 km long, paved quarry road connecting Widan el-Faras and Qasr el-Sagha used basalt fragments from the quarry along with other materials such as limestone, sandstone, and petrified wood.\nEl Amarna\nThe El Amarna site is located a short distance from El Amarna.\nTypical materials known from this site are:\n* Alabaster\nGabal Abu Dukhan\n, Germany. The font is made of purple porphyry quarried from Gabal Abu Dukhan.]]\nThe Gabal Abu Dukhan site, near modern Hurghada on Egypt's Red Sea coast, was particularly important for the Roman Empire. Pliny the Elder's Natural History stated that \"imperial porphyry\" was discovered at an isolated site in Egypt in 18 CE by a Roman legionary named Caius Cominius Leugas. The location of the site, known to the Romans as Mons Porphyrites, was lost for many centuries until rediscovered in the 19th century. It was the only source of imperial porphyry in antiquity. The quarry was active during the Greco-Roman period.\nTypical materials known from this site are:\n* Reddish-Purple porphyry with pale pink to white phenocrysts\n* Greenish-black porphyry with pale green to white phenocrysts\n* Black porphyry with pale green to mostly white phenocrysts\nSome of the monuments known to come from this site are:\n*The baptismal font in the Cathedral of Magdeburg, Germany.\n*The porphyry togas of the busts of Roman Emperors\n*Porphyry panels in the Pantheon\n*The Portrait of the Four Tetrarchs\nKoptos\nKoptos is located in Wadi Rohanu.\nTypical materials known from this site are:\n* Black slate\nWadi Hammamat\nWadi Hammamat is a quarrying area located in the Eastern Desert of Egypt. This site is noted because it is described in the first ancient topographic map known, the Turin Papyrus Map, describing a quarrying expedition prepared for Ramesses IV. Inscriptions found at Wadi Hammamat describe quarry workers breaking blocks from the mountain and using a ramp to lower them to the ground when a monument was requested by the King. Wadi Hammamat was active through the Pharonic period into the Greco-Roman period and remains largely intact in modern time.\nTypical materials known from this site are:\n* Basalt\n* Basanite\n* Metagraywacke and metaconglomerate\nQurna\nQurna is located near Thebes. It was an active site during the reign of Amenhotep III.\nTypical materials known from this site are:\n* Limestone\nEl-Dibabiya\nEl-Dibabiya was a limestone quarry site at the southern end of the Eastern Desert in Egypt along the Nile. The quarry was active during the Old Kingdom and remained active into the Greco-Roman period in Egypt. The site remains largely intact.\nTypical materials known from this site are:\n* Limestone\nEdfu\nThese quarries are located  north of Edfu.\nSome of the monuments known to come from this site are:\n* Stone blocks used by the engineers of Septimius Severus to reconstruct the north Colossus of Memnon.\nGebel el-Silsila\nGebel el-Silsila or Gebel Silsileh is  north of Aswan along the banks of the Nile. It was a very well known quarrying area throughout all of ancient Egypt due to the quality of the building stone quarried there.  The site is a rich archaeological area, with temples cut directly in the hills. Examples include the rock temple of Horemheb on the west bank. Many of the monuments here bear inscriptions of Hatshepsut, Amenhotep II, Ramesses II, Merenptah, and Ramesses III. The quarries and the stone temples here are visible from boats on the Nile. The quarry was active sometime during the Old Kingdom through the Late Period and remains largely intact in modern time.\nTypical materials known from this site are:\n* Sandstone\nSome of the monuments known to come from this site are:\n* Temple of Horemheb\nThe quarries of Aswan\nchamber within the Great Pyramid of Giza. Chamber is constructed of red granite blocks with the granite sarcophagus in the center.]]\nThe quarries of Aswan are located along the Nile near the city of Aswan. There are a number of well-known sites: Shellal, consisting of northern and southern quarries within an area of about 20 km2 (7.7 sq mi) on the west bank, and the islands of Elephantine and Seheil. One of the known directors of the Aswan sites was Hori during the reign of Ramses III. Great amounts of granite were quarried from Aswan at an extent only comparable to ancient Egypt's limestone and sandstone quarries. The quarry sites were active in the Old Kingdom through the Late Period, and continued to be active in the Greco-Roman period of Egypt. In the present days, the quarry area is to become an open-air museum.\nTypical materials known from this site are:\n* Coarse-grained pinkish to reddish granite\n* Coarse-grained gray to black granodiorite\n* Fined-grained pinkish to gray granite\n* Black Dolerite\nSome of the monuments known to come from this site are:\n* Cleopatra's Needle\n* The unfinished obelisk still on site, at the northern quarry\n* The unfinished partly worked obelisk base, discovered in 2005\n* The sarcophagus made from granite at the burial chambers of the Third Dynasty Pharaoh Djoser at Saqqara and the Fourth Dynasty Pharaoh Sneferu at Dahshur\n* The Grand Gallery and the King's Chamber within the pyramid of Khufu as well as his granite block sarcophagus\n* Sarcophagus and lowest layer of outer casing in the pyramid of Khafre at Giza, as well as a statue of Khafre all made of granite\n* Burial chamber and lower layers of outer casing in the pyramid of Menkaure at Giza made of granite\nIdahet\nThe site is located a few kilometres from Idahet, in barren desert terrain. It was abandoned during the Middle Kingdom.\nTypical materials known from this site are:\n* diorite\nOther sites\nOther important quarry sites include:\n* Alabaster quarries at Hatnub\n* Chephren's Gneiss Quarry\n* Limestone quarries north of Cairo\nReferences\nExternal links\n* [http://www.quarryscapes.no/egypt_aswa.php QuarryScapes project]\n* [http://www.aldokkan.com/art/stone.htm Stones of Ancient Egypt]\n* [http://www.cheops-pyramide.ch/khufu-pyramid/stone-quarries.html Quarries in Ancient Egypt]\n* [http://www.eeescience.utoledo.edu/Faculty/Harrell/Egypt/Quarries/Quarries_Menu.html Ancient Egyptian Quarries]\n* [http://www.reshafim.org.il/ad/egypt/timelines/topics/stonework.htm Ancient Egyptian resources: Stone]\n* [http://www.museumphotography.com/SILSILEH.HTM Photo gallery of Gebel Silsileh]"
    }
  ]
}