{
  "content": [
    {
      "type": "text",
      "text": "# Stormqueen!\n\nStormqueen! is a science fantasy novel by American writer Marion Zimmer Bradley, part of the Darkover series. Originally published in 1978, it was republished in 2002 as part of the Ages of Chaos omnibus.\nStormqueen! occurs two hundred years prior to Two To Conquer, in the period of Darkover's history known as the Ages of Chaos. The underlying theme of Stormqueen! is a breeding program, undertaken over centuries, to produce stronger laran gifts, resulting in individuals like Dorilys and Allart, whose gifts are potentially lethal.\nThough it is mentioned as an aside, this book contains the moment in the Darkovan timeline when the Ridenow of the Dry Towns overtake the Serrais domain, merging into Ridenow of Serrais.\nPlot summary\nLady Aliciane of Rockraven, barragana to Mikhail of Aldaran, dies giving birth to a daughter, Dorilys. In childhood, Dorilys is discovered to have weather-related laran, causing storms and lightning with her childish temper tantrums.\nAllart Hastur leaves Nevarsin Monastery, where he has lived for six years, learning to live with a form of laran that causes him to experience premonitions of multiple futures. He meets Cassandra Aillard, the woman his family intends him to marry. He believes that any children they might conceive will cause her death. To avoid this fate, they become celibate tower workers at Hali.\nLord Rakhal Aldaran of Scathfell arrives with his son at Castle Aldaran. Scathfell wishes ensure that his son Darren marries Dorilys, who is now eleven. At the handfasting, Darren judges her to be much older than he has been told, and attempts to force her into sexual relations. Dorilys' self-protective laran strikes Darren dead. Scathfell swears vengeance. Dorilys' half-brother Donal is sent to acquire assistance from Hali Tower for Dorilys.\nDamon-Rafael Hastur of Elhalyn, Allart's brother, arrives at Hali and asks him to undertake a diplomatic mission to Aldaran. Donal Delleray also arrives, asking assistance for Dorilys. Allart and Renata accompany Donal back to Aldaran.\nAfter working with Dorilys for a day, Renata warns Aldaran that while Donal has weather-related laran, Dorilys has the gift in a lethal form. She also asserts that Dorilys has already used her ability three times to kill someone she feared.\nRenata attempts to teach Dorilys control, over both her behavior and her laran abilities. She, Allart, Donal and Dorilys use gliders to reach the fire watch tower. Dorilys explains that she can see the past, present and future of the fire, and that Donal has the same ability with storms. Renata learns that Dorilys has the ability to draw power from the magnetic fields of planet.\nTo circumvent demands made by his brother, Lord Aldaran betroths his daughter, Dorilys to her half-brother, Donal. Donal, who has fallen in love with Renata, objects, but cannot alter his foster-father's will. Donal and Dorilys are married on Midwinter Night.\nAllart uses his gift of seeing multiple futures, but is overcome by visions of death and destruction. He teleports his wife, Cassandra, from Hali Tower, for her protection. He is warned by workers at Hali that Damon-Rafael, his brother, will march on Aldaran, to claim Cassandra for himself.\nAbout a week later, Rakhal of Scathfell, who has joined forces with Damon-Rafael Hastur, demands that Aldaran give over Dorilys to be married to one of Scathfell's sons. When Aldaran refuses, the castle is besieged with laran-based weapons, including clingfire. Dorilys is able to avert the attack. After several more attacks, Lord Aldaran decides to use Dorilys' powers at full force against the attacking army, despite the warnings of Allart and the others.\nAllart's brother Damon-Rafael sends word demanding that Allart hand over Cassandra. After attempting to reason with his brother, Allart telepathically shows him the future he will bring to Darkover if he steals Cassandra and crowns himself king. Rather than be the cause of such a future, Damon-Rafael kills himself.\nAt the feast following the victory, Dorilys realizes that Donal does not love her; rather he is in love with Renata. Acting out of temper, she blasts Donal, killing him instantly. Renata gets Dorilys under control and drugs her. Renata seeks Donal in the Overworld, but instead meets Dorilys as she might have been, self-controlled and emotionally mature. Dorilys tells Renata she must never again awaken, that her power is too dangerous. Renata leaves the Overworld and creates a force field around Dorilys. Her body is interred at Hali.\nIn a later Darkover novel, ''Sharra's Exile'', set some thousands of years later, a delegation that goes to retrieve the Sword of Aldones from Hali sees \"behind a rainbow of colors... a bier where lay a woman's body ... she had slept there or lain there in unchanging, incorruptible death for thousands of years\".\nCharacters\n* Mikhail, Lord Aldaran\n* Aliciane of Rockraven, mother of Donal and Dorylis\n* Donal Delleray, son of Aliciane and a younger Rockraven son\n* Dorilys, daughter of Mikhail and Aliciane\n* Allart Hastur of Elhayln\n* Cassandra Aillard, Allart's wife\n* Renata Leynier, a leronis\nPublication history\n* 1978, USA, DAW Books , pub date June 1978, paperback\n* 1979, Germany, Droemersche Verlagsanstalt , pub date 1979, in German as Herrin der Stürme\n* 1979, USA, Gregg Press , pub date 1979, hardcover\n* 1980, UK, Arrow Books , pub date 1980, paperback\n* 1981, France, Éditions Albin Michel , pub date 1981, in French as Reine des orages\n* 1988, Japan, Shogensha, pub date 1988, in Japanese\n* 1988, Brazil, Editora Imago , pub date 1988, in Portuguese as Rainha da Tempestade\n* 1989, Italy, Teadue, pub date 1989 , in Italian as La Signora delle tempeste\n* 1989, UK, Severn House , pub date October 1989, hardcover\n* 1997, Czech Republic, Knižní klub , pub date 1997, in Czech as Královna bouře\n* 2002, Netherlands, Uitgeverij , pub date 2002, in Dutch as Vrouwe der stormen\n* 2005, Croatia, Izvori, pub date 2005, in Croatian as Kraljica oluja\nReferences\nSources\n*\n*\n* [http://www.darkover.com/new/darkover/guide/books/stormqueen/summary.en.html Summary of the novel on Darkover.com]"
    }
  ]
}