{
  "content": [
    {
      "type": "text",
      "text": "# Storm Over Warlock\n\nStorm Over Warlock is a science fiction novel written by Andre Norton and published in 1960 by the World Publishing Company.  The story combines science fiction with fantasy, technology with witchcraft, in a way typical of Norton's works.  The sequels are Ordeal in Otherwhere and Forerunner Foray.\nPlot\nShann Lantee is lucky to be alive.  He had sneaked out of the small Terran base on the planet Warlock in the Circe system to track two escaped artificially evolved wolverines, Taggi and his mate Togi, and bring them back to the base before anyone notices that they are missing.  While he is gone a force of Throgs, implacably hostile insectoid aliens, attacks the base and kills all of its occupants.  Shann moves across country with the wolverines and sees a downed scoutship explode and destroy a Throg flying disc.\nA wounded Throg confronts Shann, but another man, Ragnar Thorvald, kills it. Together the two men leave the scene and begin living off the land as best they can.  Days later they make a night raid on the base, now occupied by Throgs, and they and the wolverines barely escape.  On a raft they head for the distant sea, where they expect to find refuge.\nAfter evading a Throg search party, they reach their goal.  Thorvald displays a coin-like disc that suddenly puts him into a trance and takes control of his mind.  Shann knocks the disc out of Thorvald's hand, and Thorvald recovers consciousness, but the disc leaves a compulsion in his mind: they must travel across water to a certain island.  They build a makeshift canoe and reach the island, but Thorvald's mind is again assaulted and he leaves the island, marooning Shann and the wolverines there.\nShann seeks to escape from the island, to return to the mainland with the wolverines.  But he finds that he is also vulnerable to telepathic mind-control; during his sleep he sabotages his own work.  He sets a trap, hoping to catch his telepathic assailant, and soon finds a small dragon-like humanoid caught in it.  The creature is physically delicate, but telepathically powerful.  It is also female.   She takes him to a cavern to meet three other Warlockians, who want to find out who and what he is.\nIn a fog-filled cavern Shann must confront old memories somehow made physically real as long as he believes in them.  He has to remain focused on what is true in order to survive.  During the ordeal he reunites with Thorvald, who refers to the natives as Wyverns.  Together the two men escape from the cavern and Shann saves a young Wyvern from a sea monster.\nNow the Wyverns give Shann a mission.  He must extract a wounded Throg from a cave in which it has taken refuge.  The Wyverns are unable to do this themselves, because the Throg's mind is so primitive that the Wyvern's mind-control techniques do not affect it.  Shann manages to get the wounded Throg out but is captured by a group of Throgs sent to rescue their wounded comrade.  The Throgs take Shann back to the Terran base and order him to call the colonization ship that is coming, to lure it down so that the Throgs can kill the passengers and crew.  Shann manages to warn the ship and to draw a Patrol cruiser to the base, dooming the Throgs.  Before the Throgs can begin torturing Shann to death, Thorvald and the Wyverns envelop them in a fog that realizes their worst fears and kills them.  Together the humans from the ship and the Wyverns defeat the Throg colonization force utterly.\nAfter his wounds have healed, Shann discovers that he and Thorvald are to form the core of an embassy established on Warlock to maintain contact with the Wyverns.\nPublication history\n*1960, USA, World Publishing Company (#WP260 & #2WP1160), Pub date 1960 Apr 04 & 1960 Nov, Hardback (251 pp)\n*1961, USA, Ace Books (#F-109), Paperback (192 pp)\n*1962, Germany, Moewig Verlag (Terra #241 & #242), Pub date Aug 1962, Paperback Digest (62 pp & 63 pp), as Die Hexen von Warlock (The Witches of Warlock)\n*1965, USA, Ace Books (#F-329), Paperback (192 pp)\n*1969, USA, Ace Books (#78741), Pub date Aug 1969, Paperback (192 pp)\n*1973, USA, Ace Books (#78742), Pub date Jul 1973, Paperback (201 pp)\n*1974, Germany, Ullstein Verlag (Ullstein 2000, series #82 (3097)), , Paperback (125 pp), as Sturm über Warlock (Storm Over Warlock)\n*1976, USA, Ace Books (#78743), Paperback (201 pp)\n*1980, USA, Gregg Press, , Hardback (251 pp)\n*1981, USA, Ace Books, , Pub date Aug 1981, Paperback (201 pp)\n*1982, USA, Ace Books, , Pub date Jul 1982, Paperback (201 pp)\n*1983, USA, Ace Books, , Pub date Apr & May 1983, Paperback (201 pp)\n*1985, USA, Ace Books, , Pub date Jan 1985, Paperback (201 pp)\nReviews\nIn the Kirkus Review issue of 1 April 1960  the reviewer wrote:\nReferences\nSources\n*Schlobin, Roger C. & Irene R. Harrison, Andre Norton, a Primary and Secondary Bibliography, NESFA Press (Framingham, Massachusetts), pg. 6, .\n*Tuck, Donald H. (1974). The Encyclopedia of Science Fiction and Fantasy. Chicago: Advent. pg. 332. .\nListings\nThe book is listed at\n*The Library of Congress as http://lccn.loc.gov/60007204\n*www.worldcat.org as\nExternal links\n*\n*\n*"
    }
  ]
}