{
  "content": [
    {
      "type": "text",
      "text": "# Storage Wars season 3\n\n| last_aired   =\n| prev_season  = Season 2\n| next_season  = Season 4\n| episode_list = List of Storage Wars episodes\n}}\nThe third season of the reality television show Storage Wars aired on A&E from June 5, 2012 to December 18, 2012. It consisted of 26 episodes, beginning with the episode \"Third Eye of the Tiger\" and ending with the episode \"Portrait of The Gambler\". This is the final season to feature all four original buyers.\nAll of the episodes this season were filmed at various self-storage facilities throughout Southern California, including Mini-U Storage,  Storage Outlet and Extra Storage.\nEpisode overview\n{|class=\"wikitable plainrowheaders\" style=\"width:100%; margin:auto; background:#fff;\"\n|-\n!  style=\"width:10%; background:#39acac; color:#fff;\"|No. inseries\n!  style=\"width:10%; background:#39acac; color:#fff;\"|No. inseason\n!  style=\"width:50%; background:#39acac; color:#fff;\"|Title\n!  style=\"width:20%; background:#39acac; color:#fff;\"|Location\n!  style=\"width:20%; background:#39acac; color:#fff;\"|Original air date\n|-\n| ShortSummary= As the auctions begin at the crack of dawn in La Verne, California; Barry trains himself in the hope of finding a classic collectable, he scores himself a $1,650 unit finding a grandfather clock and some other items.  Darrell shows up alone without Brandon is trip to Florida and quickly buying a $1,700 unit which has some hunting and fishing gear, and ends up detecting a find of his own. And Jarrod and Brandi start a new system, which buys them a unit for $400...but will it help them find zen?  Dave stars his usual tactics of bidding...then bidding people up, he finds bad units (in his opinion) and goes home empty handed.\n| LineColor=39acac\n}}\n| ShortSummary= The buyers attend a notorious vault auction in Chatsworth, California. Jarrod and Brandi spend $1,400, and they come across more noise than profit. Barry purchases a vault for $1,900 and uses \"the force\" to discover what he is looking for and hoping to make profit.  Darrell sneaks away and buys a vault for $650 and finds valuables that Brandon almost threw in the trash, and Dave's bark proves to be much worse than his bite.\n| LineColor=39acac\n}}\n| ShortSummary= The buyers head to the northern part of Southern California in the city of Oxnard. Barry buys a room with a view for $900 and finds some ice carving equipment that's worth $1,500. Dave purchases a unit for $4,100 containing several antiques and searches for gold and leaves him with something less than bronze. Jarrod battles Dave on a unit that he and Brandi want, along with a nasty cold. Darrell and Brandon get into a nasty fight that could spell the end of the \"Tank Top Twins\".\n| LineColor=39acac\n}}\n| ShortSummary= The techniques of buying erupt in Hawaiian Gardens, California. Barry decides to start thinking inside the box, and brings an inside man. Jarrod fills his thrift store, but empties his wallet. Dave helps the Dotson's commissions. And with the Sheets split, Brandon discovers just why people call his dad \"The Gambler\". Darrell spends $1,050 on a swimming protector. Darrell and Brandon bid separately for this episode.\n| LineColor=39acac\n}}\n| ShortSummary= The buyers make a trip to the City of Industry in California.  The Sheets make up, but that's not necessarily a good thing.  Dave gets industrial by purchasing a unit for $300 containing air conditioner units, and gets profitable. Barry buys a unit for $1,050 and finds a cat clock - he then visits the \"King of Kitsch,\" hoping to avoid a \"cat\"astrophe.  While Jarrod and Brandi both find something in their $2,150 unit, but which one will win the battle of the appraisals?\n| LineColor=39acac\n}}\n| ShortSummary= All the buyers are back in Long Beach, California and hoping for better outcomes on the units. Heavy bidder Mark Balelo returns with $50,000 of locker money, in a man purse. Darrell gets a unit dropped on him by Mark. Jarrod and Brandi try and reel in a score. And Barry buys on a tip, but will he get his motor running, or blow a gasket?\n| LineColor=39acac\n}}\n| ShortSummary= The buyers descend on another set of auctions in Laguna Niguel, California.  Jarrod and Brandi look to fill their shelves, and their pockets.  Barry slices up his competition.  Darrell brings a positive, stern, business attitude and not much else. new buyer, Jeff Jarred, on the scene, and he's all about fair play. Meanwhile, Dave is nowhere to be seen.\n| LineColor=39acac\n}}\n| ShortSummary= The buyers negotiate the desert winds of Lancaster, California. Jarrod arrives cocky, and it annoys Brandi. Darrell finds his feminine side with his $600 unit. New buyer Jeff Jarred is back, and he's keeping tabs on Barry. Jeff obtains a $350 unit with many containers and finds an African tiki statue and hopes it's valuable. And Barry drops the hammer on a $1,050 locker, but who will cross the finish line first? Once Again, Dave is gone and nowhere to be seen.\n| LineColor=39acac\n}}\n| ShortSummary= The buying takes root in Gardena, CA.  Jarrod and Brandi buy a $700 unit and find something that sets off sirens.  New buyer Jeff Jarred obtains a keepsake from the cold war in his $1,050 unit.  And Darrell makes a purchase of a $140 unit and uncovers some serious sole, and a tidy profit. Barry captains a ship, and almost goes down with it - he goes home without a unit. Meanwhile, Dave didn't show up to the auction.\n| LineColor=39acac\n}}\n| ShortSummary= Tempers flare in the storage aisles of Montebello, California. Barry loses a battle with a robot with his $1,800 unit. Darrell goes on a run with buying lockers and spends $3,000 on four lockers, and it's truly sweet and earns himself much profit. Dave went to a different auction in Costa Mesa and purchases a locker for $150 which he heads straight to the bank. Jarrod and Brandi endure a bad day at the auction.\n| LineColor=39acac\n}}\n| ShortSummary= The buyers, well most of them, head to Westminster, CA once again. Darrell and Brandon gamble on a unit and spend $155, and later meet a legend. Jarrod and Brandi do the right thing with some blankets in their $2,300 unit. Dave smells lame lockers and bags one somewhere else. And Barry buys a unit nobody else wants for $1.00 and finds a piece of folklore and sets a storage auction record, but is that a good thing?\n| LineColor=39acac\n}}\n| ShortSummary= The buyers travel behind \"The Orange Curtain\" to Irvine, CA. Jarrod and Brandi continue to be on fire, and buy a unit for $1,700 and hope to continue their hot streak. Barry, on the other hand, is off his game - and goes home with nothing. So much so that Brandon beats him on a locker that he bought for $275.  And Dave's been away for a while, is it about time for him to return? All signs point to YUUUP!\n| LineColor=39acac\n}}\n| ShortSummary= Garden Grove, California plays host to the buyers, and some international intrigue.  Dave may have raided King Tut's tomb with his $2,300 locker. Darrell may have formed a new business \"adventure\" in Germany. Jarrod and Brandi find something that makes them whinny in their $850 unit . And for once Barry is the architect, but will his plan come to fruition?\n| LineColor=39acac\n}}\n| ShortSummary= The buyers enter an auction marathon in Riverside, California where 25 units are all up for sale. Dave tries to use the heat to his advantage so he can get a unit, which works well for him because he gets an $800 unit.  Things get heated between Dave and Darrell's son Brandon. Too many choices and too much heat make it hard for Jarrod and Brandi to pick a good locker. Barry finds himself \"on the fence\" on a locker. And Barry and Dave make a bet on a couch because of its age, a very expensive bet.\n| LineColor=39acac\n}}\n| ShortSummary= The buyers roll in to Chino, California.  Darrell gives Brandon a chance to sit in the driver's seat but ends up going home without a locker.  Barry spends $800 bucks on a unit packed with clothes and a pigeon clock - but will it soar him to eagles, or flip the bird? Jarrod and Brandi buys a 'Big Boy' unit for $2,900, but will they make a big boy profit?  And Dave goes in bulk and spends $775 on a unit full on new and un-used office technology - which gives him a $16,200 haul.\n| LineColor=39acac\n}}\n| ShortSummary= The buyers return to San Bernardino, California.  Barry has a new plan - he tries to distract the crowd buy giving them breakfast burritos to eat during the sale of a unit he wins for $2,300, will he make a profit or not?  Darrell and Brandon spend $230 on a unit and find something that's truly old, all signs point to profit.  Dave spends $1,850 on a unit full of vintage furniture and some old, but nice dishes.  And Jarrod and Brandi go home with a bad attitude, also empty handed.\n| LineColor=39acac\n}}\n| ShortSummary= The buyers enter the auction in Lakewood, California. Darrell and Brandon buy a $3,500 locker that fits for a fiesta. Barry buys a $310 unit and then pays a price for his locker-buying addiction. Jarrod and Brandi go home empty handed and the Lakewood auction, so they go to another auction in Fullerton and buy an old unit at $1,700 unit full of furniture and old newspapers, will their newspapers be valuable or worthless? Dave acts like a bully to the other buyers by bidding them up, and ends up going home without a locker.\n| LineColor=39acac\n}}\n| ShortSummary= The bidders look for deals in an afternoon auction in Westminster, California. Jarrod and Brandi get a new truck for their store, they buy a unit for $750 - will their new truck give them better or new luck? Dave buys a unit for $1,550 and has discussions with the dead. Barry learns to stop worrying...and love of buying lockers. Darrell fails to buy a unit in his own territory, he goes home empty handed.\n| LineColor=39acac\n}}\n| ShortSummary= All the buyers blow in to Santa Ana, California.  Barry buys a unit for $595 because of an old train set - will he stay on the tracks or go off the rails?  Darrell buys a unit for $350 containing a money bag, but it doesn't have money in it, then he finds some rare Magic cards - are they as rare as he thinks?  Brandi is not happy with a unit Jarrod purchased for $3,400 containing a fancy guitar and hoping to make some money. Dave is out to make a killing, he ends up leaving with nothing.\n| LineColor=39acac\n}}\n| ShortSummary= The buyers are ready for another heated auction at Costa Mesa, California. Dave buys a $3,200 unit which contains some beer tap. Barry sneaks away and buys a $2,900 unit containing some furniture and some pottery equipment - will it have a great value? Darrell purchases a big unit for $7,250 containing much quality furniture, collectibles, knick-knacks, and common household items and ends up scoring big. Brandi is exhausted, Jarrod is happy and it costs them because they go home without a unit.\n| LineColor=35acac\n}}\n| ShortSummary= Everyone shows up at the auction held in Compton, California.  Barry gets too excited and drives the price up himself on a unit he buys for $3,500 which contains a few tool boxes, only to find no tools in any of the tool boxes.  Dave buys a unit filled with various household items for $825 and squeezes some profit out of it.  Jarrod and Brandi buy a unit for $1,400 and find a unique suit.  Darrell and Brandon get their lockers confused, and end up going home without a unit.\n| LineColor=35acac\n}}\n| ShortSummary= The buyers trek to the desert city of Murietta, California. Jarrod and Brandi put their reckless bidding strategy to work and it earns them a $1,900 locker and some good profit.  Jeff Jarred resurfaces, but that doesn't sit well with the Dotsons. Barry Weiss pays $2,200 and figures a couple things out.  Also, a new buyer named Mark Compers comes to bid, a fairly new bidder.  Dave doesn't work to get a unit, all the other bidders are doing the work for him.  Meanwhile, Darrell and Brandon are nowhere to be seen.\n| LineColor=35acac\n}}\n| ShortSummary= Most of the buyers head up to a storage facility in Mission Hills, California.  Dave starts his day at $500 in the hole because one of the tires on his trailer came off as he was driving.  He's hoping to make some profit on a unit he buys for $500 in Inglewood so he can pay for the repairs, where he also meets tank top twins Herb Brown and Mike Karlinger.  Jarrod and Brandi buy a locker for $700 with some furniture and finds some profit. Barry, the old dog, spends $900 and hoping to bark up some profit off of these fancy dog decorations.  Once again, Darrell and Brandon both are gone and nowhere to be seen.\n| LineColor=35acac\n}}\n| ShortSummary= The buyers make their way to Hollywood, California ready to buy. Nabila Haniss once again shows up to make the prices go up, but doesn't buy anything even though it's her backyard.  Darrell is finally back and he buys a unit that he got bid up on by Nabila for $2,400 with various technology including cameras and computers. Jarrod and Brandi buy their most expensive unit ever for $6,800 filled with very good quality household items and some other miscellaneous merchandise. Dave also doesn't buy anything either because of high prices on the units that were sold.\n| LineColor=35acac\n}}\n| ShortSummary= The bargain hunters roll into Tustin, California. Dave buys two units for a total cost of $5,100, one containing many boxes, calling it a \"mystery\" unit, and the other with household items and some bee equipment. Jeff Jarred makes a record profit and some good money on a low-price locker. Brandi tries reverse psychology on Jarrod so he doesn't overpay on a unit, it works too well - as a result they go home with nothing. Barry and Kenny create a plan and try to sideswipe Dave, but will it work? Darrell and Brandon didn't show up to the auction.\n| LineColor=35acac\n}}\n| ShortSummary= Jarrod and Brandi both are hoping for a different outcome when the bidders return to Montebello, California.  Barry bids with a blindfold on, because his Mom told him he would be better off doing it, and earns a unit for $1,800 and finds some candy-making device and is hoping to make some profit. Dave gets a unit dropped on him by Barry which costs him $2,850.  Darrell buys a unit for $3,600 and his find could be the biggest in the group's history.\n| LineColor=35acac\n|colspan=\"5\" style=\"background:#0086A7\"|\n|-\n}}\n|}\nEpisode statistics\n{|class=\"wikitable\" style=\"text-align: right;\"\n|-\n!rowspan = \"2\"|\n!rowspan = \"2\"|\n!rowspan = \"2\"|Title\n!rowspan = \"2\"|Air date\n!colspan = \"2\" style=\"background:#3343b0;\"|Dave Hester\n!colspan = \"2\" style=\"background:#38ba6f;\"|Jarrod Schulz/Brandi Passante\n!colspan = \"2\" style=\"background:#d22121;\"|Darrell Sheets/Brandon Sheets\n!colspan = \"2\" style=\"background:#F9F1A6;\"|Barry Weiss\n|-\n!  style=\"width:66px; font-size:85%;\"|Spent\n!  style=\"width:72px; font-size:85%;\"|Net profit/loss\n!  style=\"width:66px; font-size:85%;\"|Spent\n!  style=\"width:66px; font-size:85%;\"|Net profit/loss\n!  style=\"width:66px; font-size:85%;\"|Spent\n!  style=\"width:66px; font-size:85%;\"|Net profit/loss\n!  style=\"width:66px; font-size:85%;\"|Spent\n!  style=\"width:66px; font-size:85%;\"|Net profit/loss\n|- valign=\"top\"\n|53\n|01\n|align=\"left\"|\"Third Eye of the Tiger\"\n|align=\"left\"|June 5, 2012\n| style=\"text-align:center;\"|N/A\n| style=\"text-align:center;\"|N/A\n|$400.00\n|style=\"color:green;\"|$1,250.00\n|$1,700.00\n|style=\"color:green;\"|$290.00\n|$1,650.00\n|style=\"color:green;\"|$1,075.00\n|- valign=\"top\"\n|54\n|02\n|align=\"left\"|\"May The Vaults Be With You\"\n|align=\"left\"|June 5, 2012\n| style=\"text-align:center;\"|N/A\n| style=\"text-align:center;\"|N/A\n|$1,400.00\n|style=\"color:red;\"|–$155.00\n|$650.00\n|style=\"color:green;\"|$3,850.00\n|$1,900.00\n|style=\"color:green;\"|$1,395.00\n|- valign=\"top\"\n|55\n|03\n|align=\"left\"|\"The Iceman Carveth\"\n|align=\"left\"|June 12, 2012\n|$4,100.00\n|style=\"color:green;\"|$6,950.00\n|$1,800.00\n|style=\"color:green;\"|$2,630.00\n| style=\"text-align:center;\"|N/A\n| style=\"text-align:center;\"|N/A\n|$900.00\n|style=\"color:green;\"|$800.00\n|- valign=\"top\"\n| rowspan=\"2\"|56\n| rowspan=\"2\"|04\n|align=\"left\" rowspan=\"2\"|'''\"Here's Looking at You, Kenny\"\n|align=\"left\" rowspan=\"2\"|June 12, 2012\n| style=\"text-align:center;\" rowspan=\"2\"|N/A\n| style=\"text-align:center;\" rowspan=\"2\"|N/A\n| rowspan=\"2\"|$1,350.00\n| rowspan=\"2\" style=\"color:red;\"|–$120.00\n|$1,050.00 (Darrell)\n|style=\"color:green;\" |$3,180.00 (Darrell)\n| rowspan=\"2\"|$850.00\n| rowspan=\"2\" style=\"color:green;\"|$542.07\n|-\n| style=\"text-align:center;\"|N/A (Brandon)\n| style=\"text-align:center;\"|N/A (Brandon)\n|- valign=\"top\"\n|57\n|05\n|align=\"left\"|\"A Civil Accordion\"\n|align=\"left\"|June 19, 2012\n|$300.00\n|style=\"color:green;\"|$1,200.00\n|$2,150.00\n|style=\"color:green;\"|$3,100.00\n| style=\"text-align:center;\"|N/A\n| style=\"text-align:center;\"|N/A\n|$1,050.00\n|style=\"color:red;\"|–$725.00\n|- valign=\"top\"\n|58\n|06\n|align=\"left\"|\"...More Like, WRONG Beach\"\n|align=\"left\"|June 19, 2012\n| style=\"text-align:center;\"|————\n| style=\"text-align:center;\"|————\n|$800.00\n|style=\"color:green;\"|$100.00\n|$700.00\n|style=\"color:red;\"|–$545.00\n|$1,200.00\n|$0.00\n|- valign=\"top\"\n|59\n|07\n|align=\"left\"|\"All's Fair In Storage and Wars\"\n|align=\"left\"|June 26, 2012\n| style=\"text-align:center;\"|————\n| style=\"text-align:center;\"|————\n|$3,250.00\n|style=\"color:green;\"|$2,600.00\n| style=\"text-align:center;\"|N/A\n| style=\"text-align:center;\"|N/A\n|$6,000.00\n|style=\"color:green;\"|$6,660.00\n|- valign=\"top\"\n|60\n|08\n|align=\"left\"|\"The Fast and The Curious\"\n|align=\"left\"|June 26, 2012\n| style=\"text-align:center;\"|————\n| style=\"text-align:center;\"|————\n| style=\"text-align:center;\"|N/A\n| style=\"text-align:center;\"|N/A\n|$600.00\n|style=\"color:green;\"|$535.00\n|$1,050.00\n|style=\"color:green;\"|$2,275.00\n|- valign=\"top\"\n|61\n|09\n|align=\"left\"|\"From Russia With Chucks\"\n|align=\"left\"|July 10, 2012\n| style=\"text-align:center;\"|————\n| style=\"text-align:center;\"|————\n|$700.00\n|style=\"color:green;\"|$100.00\n|$140.00\n|style=\"color:green;\"|$860.00\n| style=\"text-align:center;\"|N/A\n|style=\"color:red;\"|-$500.001\n|- valign=\"top\"\n|62\n|10\n|align=\"left\"|\"The Full Monty-Bello\"\n|align=\"left\"|July 10, 2012\n|$150.002\n|style=\"color:green;\"|$1,185.00\n|$800.00\n|style=\"color:red;\"|-$300.00\n|$3,000.00\n|style=\"color:green\"|$21,700.00\n|$1,800.00\n|style=\"color:red;\"|-$950.00\n|- valign=\"top\"\n|63\n|11\n|align=\"left\"|\"Dial C For Chupacabra\"\n|align=\"left\"|July 17, 2012\n|$1,100.003\n|style=\"color:green;\"|$2,375.00\n|$2,300.00\n|style=\"color:red;\"|-$510.00\n|$155.00\n|style=\"color:green;\"|$1,345.00\n|$1.00\n|style=\"color:green;\"|$150.50\n|- valign=\"top\"\n|64\n|12\n|align=\"left\"|\"The Ship Just Hit The Sand\"\n|align=\"left\"|July 17, 2012\n|$275.00\n|style=\"color:green;\"|$730.00\n|$1,700.00\n|style=\"color:green;\"|$1,500.00\n|$275.004\n|style=\"color:green;\"|$3,410.00\n| style=\"text-align:center;\"|N/A\n| style=\"text-align:center;\"|N/A\n|- valign=\"top\"\n|65\n|13\n|align=\"left\"|\"Willkommen to the Dollhouse\"\n|align=\"left\"|July 24, 2012\n|$2,300.00\n|style=\"color:green;\"|$2,791.00\n|$850.00\n|style=\"color:green;\"|$190.00\n| style=\"text-align:center;\"|N/A\n| style=\"text-align:center;\"|N/A\n|$245.00\n|style=\"color:green;\"|$2,005.00\n|- valign=\"top\"\n|66\n|14\n|align=\"left\"|\"The YUUUP! Stops Here\"\n|align=\"left\"|July 24, 2012\n|$800.00\n|style=\"color:red;\"|-$5,500.005\n| style=\"text-align:center;\"|N/A\n| style=\"text-align:center;\"|N/A\n|$1,550.00\n|style=\"color:green;\"|$3,275.00\n|$1,100.00\n|style=\"color:green;\"|$5,350.005\n|- valign=\"top\"\n|67\n|15\n|align=\"left\"|\"Buy, Buy Birdie\"\n|align=\"left\"|August 7, 2012\n|$775.00\n|style=\"color:green;\"|$15,425.00\n|$2,900.00\n|style=\"color:green;\"|$325.00\n| style=\"text-align:center;\"|N/A\n| style=\"text-align:center;\"|N/A\n|$800.00\n|style=\"color:red;\"|-$220.00\n|- valign=\"top\"\n|68\n|16\n|align=\"left\"|\"The Return of San Burrito\"\n|align=\"left\"|August 7, 2012\n|$1,850.00\n|style=\"color:green;\"|$1,900.00\n| style=\"text-align:center;\"|N/A\n| style=\"text-align:center;\"|N/A\n|$230.00\n|style=\"color:green;\"|$2,150.00\n|$2,300.00\n|style=\"color:red;\"|-$1,475.00\n|- valign=\"top\"\n|69\n|17\n|align=\"left\"|\"There's Something About Barry\"\n|align=\"left\"|August 14, 2012\n| style=\"text-align:center;\"|N/A\n| style=\"text-align:center;\"|N/A\n|$1,700.00\n|style=\"color:green;\"|$1,825.00\n|$3,500.00\n|style=\"color:green;\"|$1,505.00\n|$310.00\n|style=\"color:red;\"|-$310.00\n|- valign=\"top\"\n|70\n|18\n|align=\"left\"|\"Dr. Strangebid\"\n|align=\"left\"|August 21, 2012\n|$1,550.00\n|style=\"color:green;\"|$705.00\n|$750.00\n|style=\"color:green;\"|$3,850.00\n| style=\"text-align:center;\"|N/A\n| style=\"text-align:center;\"|N/A\n|$900.00\n|style=\"color:red;\"|-$800.00\n|- valign=\"top\"\n|71\n|19\n|align=\"left\"|\"Sheets and Geeks\"\n|align=\"left\"|August 28, 2012\n| style=\"text-align:center;\"|N/A\n| style=\"text-align:center;\"|N/A\n|$3,400.00\n|style=\"color:red;\"|-$800.00\n|$350.00\n|style=\"color:green;\"|$2,935.00\n|$595.00\n|style=\"color:red;\"|-$5.00\n|- valign=\"top\"\n|72\n|20\n|align=\"left\"|\"No Bid for the Weary\"\n|align=\"left\"|August 28, 2012\n|$3,200.00\n|style=\"color:green;\"|$2,709.00\n| style=\"text-align:center;\"|N/A\n| style=\"text-align:center;\"|N/A\n|$7,250.00\n|style=\"color:green;\"|$3,075.00\n|$2,900.00\n|style=\"color:red;\"|-$370.00\n|- valign=\"top\"\n|73\n|21\n|align=\"left\"|\"Straight into Compton: Biddaz with Attitude\"\n|align=\"left\"|December 4, 2012\n|$825.00\n|style=\"color:green;\"|$1,170.00\n|$1,400.00\n|style=\"color:red;\"|-$140.00\n| style=\"text-align:center;\"|N/A\n| style=\"text-align:center;\"|N/A\n|$3,500.00\n|style=\"color:red;\"|-$1,995.00\n|- valign=\"top\"\n|74\n|22\n|align=\"left\"|\"The Young and the Reckless\"\n|align=\"left\"|December 4, 2012\n| style=\"text-align:center;\"|N/A\n| style=\"text-align:center;\"|N/A\n|$1,900.00\n|style=\"color:green;\"|$5,600.00\n| style=\"text-align:center;\"|————\n| style=\"text-align:center;\"|————\n|$2,200.00\n|style=\"color:green;\"|$3,700.00\n|- valign=\"top\"\n|75\n|23\n|align=\"left\"|\"Jurassic Bark\"\n|align=\"left\"|December 11, 2012\n|$500.00\n|style=\"color:green;\"|$290.006\n|$700.00\n|style=\"color:green;\"|$2,290.00\n| style=\"text-align:center;\"|————\n| style=\"text-align:center;\"|————\n|$900.00\n|style=\"color:green;\"|$540.00\n|- valign=\"top\"\n|76\n|24\n|align=\"left\"|\"A Tale of Two Jackets\"\n|align=\"left\"|December 11, 2012\n| style=\"text-align:center;\"|N/A\n| style=\"text-align:center;\"|N/A\n|$6,800.00\n|style=\"color:green;\"|$4,850.00\n|$2,400.00\n|style=\"color:green;\"|$890.00\n|$1,675.007\n|style=\"color:red;\"|-$400.00\n|- valign=\"top\"\n|77\n|25\n|align=\"left\"|\"Tustin, Bee Have a Problem\"\n|align=\"left\"|December 18, 2012\n|$5,100.00\n|style=\"color:green;\"|$6,280.00\n| style=\"text-align:center;\"|N/A\n| style=\"text-align:center;\"|N/A\n| style=\"text-align:center;\"|————\n| style=\"text-align:center;\"|————\n| style=\"text-align:center;\"|N/A\n| style=\"text-align:center;\"|N/A\n|- valign=\"top\"\n|78\n|26\n|align=\"left\"|\"Portrait of the Gambler\"\n|align=\"left\"|December 18, 2012\n|$2,850.00\n|style=\"color:red;\"|-$130.00\n| style=\"text-align:center;\"|N/A\n| style=\"text-align:center;\"|N/A\n|$3,600.00\n|style=\"color:green;\"|$299,820.00\n|$1,800.00\n|style=\"color:red;\"|-$1,140.00\n|- valign=\"top\"\n|colspan=\"2\"|\n| colspan=\"2\" style=\"text-align:left;\"|Totals:\n|$25,675.00\n|style=\"color:green;\"|$38,080.00\n|$34,355.00\n|style=\"color:green;\"|$28,185.00\n|$33,455.00\n|style=\"color:green;\"|$348,275.00\n|$23,326.00\n|style=\"color:green;\"|$15,602.57\n|- valign=\"top\"\n|colspan=\"2\"|\n| colspan=\"2\" style=\"text-align:left;\"|Profit earned per dollar spent:\n| colspan=\"2\" style=\"text-align:center;\"|$1.49\n| colspan=\"2\" style=\"text-align:center;\"|$1.38\n| colspan=\"2\" style=\"text-align:center;\"|$10.41\n| colspan=\"2\" style=\"text-align:center;\"|$0.92'''\n|}\nNotes\n* 1 Although he did not buy a unit, Barry ended up spending $500 after he bought a set of tools and sirens for an Indian motorcycle from Brandi and Jarrod.\n* 2 Dave did not attend the main auction in Montebello, but instead purchased a unit in Costa Mesa at a different self-storage facility.\n* 3 Dave did not attend the main auction in Westminster, but instead purchased a unit in Fontana at a different self-storage facility.\n* 4 This unit was purchased by Darrell's son Brandon Sheets.\n* 5 Barry only made $350 on the unit, but he made a further $5,000 on a bet with Dave over the age of a vintage sofa, a bet which Barry won.\n* 6 Since Dave had a broken axle on his trailer because a wheel came off, the profit of his locker decreased by $500 so he could pay for repairs and pulled Brandi and Jarrod's over as a prank.\n* 7 Although Barry bought a unit at the auction for $875, he spent another $800 on an antique box and some Halloween decorations that he bought from Brandi and Jarrod as they were going through their unit.\nOther notes\n* In \"...More, Like WRONG Beach\", Mark Balelo did not score a locker.\n* In \"All's Fair In Storage and Wars\", Jeff Jarred spent $2,700 and made a profit of $6,749.\n* In \"The Fast and The Curious\", Jeff Jarred spent $350 and made a profit of $900.\n* In \"From Russia with Chucks\", Jeff Jarred spent $1,050 and lost $420.\n* In \"The Young and The Reckless\", Jeff Jarred spent $2,700 and lost $700.\n* In \"A Tale Of Two Jackets\", Nabila Haniss did not score a locker.\n* In \"Tustin Bee Have a Problem\", Jeff Jarred spent $5 and made a profit of $1,930.\nReferences\nExternal links\n* [https://web.archive.org/web/20130315113615/http://tvlistings.zap2it.com/tv/storage-wars/episode-guide/EP01341345?aid=zap2it Storage Wars Zap2it Episode List]"
    }
  ]
}