{
  "content": [
    {
      "type": "text",
      "text": "# Storage Wars (franchise)\n\nStorage Wars is an American reality TV franchise on A&E. The original series, Storage Wars, debuted on December 1, 2010. Its success led to A&E commissioning a spin-off series, Storage Wars: Texas, which ran for three seasons, ending in 2014. Other spin-offs followed, including Storage Wars: New York, which ran for two seasons, ending in 2013. Thom Beers is the executive producer and narrator for all the shows, excluding Storage Wars Canada.\nOriginal series\nThe original Storage Wars premiered on December 1, 2010. The main setting is in the southern cities of California. It initially aired for 12 seasons, ending its run on January 30, 2019. A 13th season was later announced and is scheduled to premiere on April 20, 2021.\nSpin-offs\nVarious spin-off series were created, most of them airing on A&E.\nStorage Wars: Texas (2011–14)\nStorage Wars: Texas was the first spin-off show from the original series. It premiered on December 6, 2011, and ran for three seasons, ending on January 7, 2014. Mary Padian, one of the buyers on the show, would later become a buyer in the original Storage Wars series.\nStorage Wars: New York (2013)\nStorage Wars: New York was the second spin-off series. The show premiered on January 1, 2013. The series aired 26 episodes over two seasons, ending on November 8, 2013.\nStorage Wars Canada (2013–15)\nStorage Wars Canada was the first international spin-off. The series aired on OLN and premiered on August 29, 2013. The show was also seen locally on CITY-TV in Toronto. The show ran for 36 episodes and ended on June 22, 2015. Starting May 17, 2017, it was aired in the US as Storage Wars: Northern Treasures.\n''Barry'd Treasure (2014)\nBarry'd Treasure is a spin-off starring Barry Weiss, a buyer from the original series. It aired for eight episodes, from March 18 to May 6, 2014.\nBrandi & Jarrod: Married to the Job (2014)\nBrandi & Jarrod: Married to the Job is a spin-off that follows Brandi Passante and Jarrod Schulz, a couple who appeared on the original series as buyers. It aired for eight episodes, from August 12 to September 30, 2014.\nStorage Wars: Miami (2015)\nStorage Wars: Miami is a spin-off filmed in Miami, Florida. It received poor viewership ratings.\nStorage Wars: France (2015)\nStorage Wars: France'' is the second international version, produced in France and shot in French. The series aired on 6ter and premiered on November 21, 2015.\nSee also\n*\n*\nReferences"
    }
  ]
}