{
  "content": [
    {
      "type": "text",
      "text": "# Stratford, Queensland\n\n| local_map           = yes\n| zoom                = 13\n| pop                 = 1198\n| pop_year            =\n| pop_footnotes       =\n| established         = 1877\n| postcode            = 4870\n| area                = 1.9\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 7.2\n| dir1                = NNW\n| location1           = Cairns CBD\n| dist2               = 354\n| dir2                = NNW\n| location2           = Townsville\n| dist3               = 1685\n| dir3                = NNW\n| location3           = Brisbane\n| dist4               =\n| dir4                =\n| location4           =\n| lga                 = Cairns Region\n| county              = Nares\n| stategov            = Barron River\n| fedgov              = Leichhardt\n| elevation           = 5\n| elevation_footnotes =\n| maxtemp             = 29.0\n| maxtemp_footnotes   =\n| mintemp             = 20.1\n| mintemp_footnotes   =\n| rainfall            = 2222.9\n| rainfall_footnotes  =\n| near-n              = Machans Beach\n| near-ne             = Aeroglen\n| near-e              = Aeroglen\n| near-se             = Whitfield\n| near-s              = Whitfield\n| near-sw             = Brinsmead\n| near-w              = Freshwater\n| near-nw             = Barron\n}}\nStratford is a suburb of Cairns in the Cairns Region, Queensland, Australia. In the , Stratford had a population of 1,198 people.\nGeography\nStratford is  NNW of the Cairns CBD. It is bounded to the north by the Barron River. It is bounded to the east by the Captain Cook Highway. The northern part of the suburb is situated on the lower slopes (10–40 metres above sea level) of  Mount Whitfield and Lumley Hill and is used for residential housing. The southern part of the suburb is undeveloped dense bushland on the higher slopes rising to about 160 metres.\nThe Tablelands railway line enters the suburb from the south-east (Aeroglen) and exits to the north-west (Barron). The suburb was served by the now-abandoned Stratford railway station ().\nHistory\nStratford is in the traditional lands of the Yidiny people.\nEuropean occupation along the banks of the Barron River began in late 1876 when the Douglas Track and Smith's Track were established around Lumley Hill and Mount Whitfield, linking the new port of Cairns to the Hodgkinson goldfields. In early 1877, John Oldham built the Halfway House (also known as the Half-Way Hotel) on the bank of the Barron River. In 1878, Samuel Cochrane became the first farmer in the area when he purchased Lot 160, 110 acres on the southern bank of the Barron River. He built a homestead which he named 'Lily Bank' and grew maize, English potatoes, sweet potatoes and pumpkins.\nIn 1885, Parliament approved plans for the first section of the Cairns-Herberton railway from Cairns to Redlynch, and this led to increased interest in the area. Surveyor Thomas Behan purchased a 13-acre lease with water frontage on the Barron, where he built a steam-powered rice mill (now the site of the Stratford Bowls Club) and a house, Cochrane opened the Lilybank Hotel, Alexander Finlayson opened the Range Hotel and store nearby, and Martin & Sons built the Union Sawmill on the river-bank. The land adjacent to Lily Bank farm was subdivided into 50 five- and ten-acre blocks and auctioned off as the River-View Estate. Construction of the railway began in April 1886, with the lines laid to the Five-mile Siding by June 1887, and passenger services commencing on 8 October 1887. In December 1887, William Henry Boden rented Behan's house at the Five-mile and applied for a publican's license to run the premises to be known as Stratford Hotel. Around this time the Five-Mile railway siding was renamed Stratford railway station. Another station was opened further along the line at Lilybank.\nOn 19 July 1877, Constable Michael Dwyer of the Special Division of Escort, which guarded the transportation of gold from the Hodgkinson to Trinity Bay, was shooting scrub turkeys with a packer, William Guilfoyle, near the Halfway House Hotel, when Dwyer tripped and accidentally shot himself in the side. Badly wounded he was taken to the Hotel and Guilfoyle rode off to Old Smithfield township town to get help. He returned with George Rutherford, the local chemist, and shortly afterwards Dr Myers arrived from Cairns. Despite their best efforts, Dwyer died that evening and was buried built near the hotel. A headstone was erected, making this the first marked European grave in the Cairns area.\nIn 1878, Samuel Cochrane became the first farmer in the area when he purchased 'Lot 160', 110 acres on the southern bank of the Barron. He built a homestead which he named 'Lily Bank' and grew maize, English potatoes, sweet potatoes and pumpkins.\nIn 1901, the Stratford explosives magazine and detonator store were constructed beside the railway line at Stratford by the Queensland Government's Marine Department, which was the government authority then responsible for storing large quantity of explosives, whether government- or privately owned, being shipped into the port of Cairns. At that time, Cairns was receiving shipments of  explosives at the rate of 2,716 cases per annum and that the amount was increasing rapidly, due to demand from mining companies and merchants on the Atherton tinfields and Chillagoe copperfields. Also, explosives were used in the construction of the privately funded Mareeba-to-Chillagoe railway, which commenced operation in October 1900, opening up even more new mineral fields and plantations, and creating a greater demand for explosives, in the process. The Stratford explosives store could hold over 6,000 cases of explosives and the capacity was expanded over the years.\nAt the outbreak of the Second World War in September 1939, a military guard of 19 men was stationed at the Stratford magazine. By early 1940, the Government had made the decision to erect new magazine facilities, including caretaker's quarters, at Queerah, on the southern outskirts of Cairns. The Queerah magazine buildings were completed in October 1941, and by March 1942, all explosives from the Stratford store had been transferred there. From early June 1942 until mid May 1945, the Stratford store was occupied by the Australian Military Forces, who used the concrete buildings to store explosives.\nOn 28 October 1951, St Augustine's Catholic Church was officially opened and blessed by the Bishop of Cairns, Thomas Cahill.\nThe Stratford public library opened in 1956 and underwent a major refurbishment in 2008.\nCairns Rudolf Steiner School opened on 29 January 2002. It subsequently relocated to Kuranda and was renamed Cairns Hinterland Steiner School.\nDemographics\nIn the 2006 census, Stratford had a population of 1,178 people.\nIn the 2011 census, Stratford had a population of 1,109 people.\nIn the , Stratford had a population of 1,138 people.\nIn the , Stratford had a population of 1,198 people.\nEducation\nThere are no schools in Stratford. The nearest government primary school is Freshwater State School in neighbouring Freshwater to the west. The nearest government secondary schools are Redlynch State College in Redlynch to the south-west and Cairns State High School in Cairns North to the south-east.\nHeritage listings\nStratford has a number of heritage-listed sites, including:\n* former Explosives Magazine and Detonator Store, Magazine Street ()\nIn 2009 for the Q150 commemorations, the Stratford and Freshwater Community Association built a heritage trail, with 29 signposted sites in Stratford and 22 signposted sites in the neighbouring suburb of Freshwater.\nAmenities\nCairns Regional Council operate a public library at 11 Kamerunga Road ().\nStratford Community Hall is at 15 Kamerunga Road (adjacent to the library, ). It is capable of seating up to 50 people and is operated by the Stratford & Freshwater Community Association.\nSt Augustine's Catholic Church is at 23 Kamerunga Road (). It is within the Northern Beaches Parish of the Roman Catholic Diocese of Cairns.\nThere is a boat ramp and floating walkway at Greenbank West Road on the south bank of Barron River adjacent to the William Walter Mason Bridge (). It is managed by the Cairns Regional Council.\nReferences\nFurther reading\n* [https://www.cairns.qld.gov.au/__data/assets/pdf_file/0007/11113/StratfordTrailBrochure.pdf Stratford Heritage Trail brochure] by Cairns Regional Council\n* [https://www.cairns.qld.gov.au/__data/assets/pdf_file/0017/1943/Freshwater_Heritage_Trail.pdf Freshwater Heritage Trail brochure] by Cairns Regional Council\nExternal links\n*\n*"
    }
  ]
}