{
  "content": [
    {
      "type": "text",
      "text": "# Stratosphere: Conquest of the Skies\n\n|genre = Vehicular combat game, real-time strategy\n|modes = Single-player, multiplayer\n|platforms = Microsoft Windows\n}}\nStratosphere: Conquest of the Skies is a vehicular combat game and also a real-time strategy PC game, developed by Kodiak Interactive and published by Ripcord Games in 1998. Stratosphere focuses on floating island battles which players control.\nGameplay\nGameplay consist of the player controlling a single floating island which are called flying fortresses in the game. These fortresses float because they are built from 'floatstones' which can be collected from mountainsides and also from other fortresses after damaging them. There are three types of floatstones each used to build different structures on the fortress. Extra land can be added to the fortress but at a limit of its fortress size class.\nThrough the build view, fortresses can build structures that increases maneuverability such as thrusters for moving forwards and backwards, and side thrusters to rotate the fortress. The amount of these maneuverability structures determine the power. They can also build gun turrets and defensive structures such as walls and shields as well as energy generating structures and also some unique structures. Each requiring different amount of resources from three different types of floatstones.\nAll flying fortresses float at one altitude. Turrets are controlled with the mouse and can be fired at wanted direction after clicking on position that is in its firing range. Some turrets can also shoot at ground level, which is used during missions in the campaign to destroy turrets placed on the ground.\nDevelopment\nStratosphere was initially being developed by Sculptured Software; Kodiak Interactive, a company formed by several former Sculptured Software employees, inherited the project when they broke off from the original developer. Ripcord acquired the worldwide distribution and publishing rights to the game in January 1998.\nReception\nThe Sydney Morning Herald gave it a score of 3 out of 5.\n}}\nReferences\nExternal links\n* [http://www.mobygames.com/game/windows/stratosphere-conquest-of-the-skies Stratosphere: Conquest of the Skies] at MobyGames"
    }
  ]
}