{
  "content": [
    {
      "type": "text",
      "text": "# Street Corner Queen\n\nblack metal, thrash metal, reggae/rap, melodic death metal\n| length     = 54:58\n| label      = Little Rose Productions (1998)\n| producer   = Deuteronomium\n| prev_title = Tribal Eagle\n| prev_year  = 1996\n| next_title = Here to Stay\n| next_year  = 1999\n| misc       =\n}}\nStreet Corner Queen (LRCD-003, ML002) is the first studio album by the Finnish Christian death metal band Deuteronomium, recorded in Studio Watercastle, Jyväskylä and published by Little Rose Productions on May 20, 1998. A ground breaking release in its time, Street Corner Queen is notable for being probably the best known Christian metal album to come from Finland, and one of the most diverse albums in the whole Christian metal history.\nRecording history and overview\nAt this point of Deuteronomium's career, Johnny Pesonen and Jari Mantour were replaced by Kalle Paju (guitar) and Janne-Jussi Kontoniemi (drums). The songs on Street Corner Queen were written between many years before the band entered the Studio Watercastle in Jyväskylä, 1998. According to the band members, on Street Corner Queen they couldn't decide what style they wanted to focus on yet wanted to be pioneering and write lyrics that kept balance between artistic output and intelligible meaning. Their guitarist-vocalist Miika Partala was the main songwriter at this point and he experimented with more and more bizarre musical styles after another, combining these elements with extreme metal. Street Corner Queen eventually ended up being a mixture of a broad spectrum of different styles, the main focus being on melodic output of Scandinavian death metal in vein of old In Flames or Dark Tranquillity and groovy rock oriented aggression similar to later Entombed and 1990s Napalm Death material. Many of the songs incorporate death metal, black metal, punk rock, classic rock, jazz, rap, reggae and funk metal elements – a style they were known to call 'death and roll'. The vocalization of Miika Partala shifts between aggressive Killing Joke type punk shouting and high pitched black metal style shrieking.\nOne of the more peculiar tracks on the album include \"Bonsai People\", which is a Red Hot Chili Peppers type funk metal song. The lyrics compare childlike people to bonsai trees in a way that they are tiny (humble, God-fearing) but as a strong breed they can endure the rending of wind (temptation) since their roots are deeply entrenched into soil (word of God). \"Spell of Hell\" on the other hand is a dark, melodic black metal type song which begins with oppressive clean guitaring. With a haunting voice a person whispers the words \"Hell is a totally cool site, so let's get there, all right?\". This sentence is probably an attempt to describe the attitude of some of the black metal fans; the lyrics tell that those who say things like that are under the 'spell of hell' which the devil uses to mislead people. Consecutively, it can be said that \"Spell of Hell\" was Deuteronomium's way of expressing their stance on the black metal movement which had at that time become very popular, with Emperor and likes being played on the Finnish metal radio program 'Metalliliitto', as the band members recall in an interview. \"Spell of Hell\" became Deuteronomium's best known song. The songs \"III\" and \"Northern Praise\"  are also black metal influenced and present more worshipful lyrics, the forementioned is vocalized in Finnish and refers to the trinity of God. The latter is also a somewhat popular song as it is noted for being one of their best known songs. The self-titled song \"Street Corner Queen\" is a punk rock influenced death metal song about a prostitute, the lyrics tell that she sells love though deep inside she knows that it's not love at all, and that she seeks comfort from wrong ways. \"Druglord\" is another punk rock influenced death metal track. The lyrics are written from the perspective of a young person who suffers from drug addiction.\nReception and criticism\n}}\nStreet Corner Queen received mixed reception during the time it was released and the diversity of the album divided opinions: It has been called from \"unquestionably one of the best Christian-made metal albums ever\" to \"unfocused and unlistenable\". Most of the critics and fans wished Deuteronomium to play a more straightforward death/black metal influenced style as it was often said that it was the black metal type output that Deuteronomium played exceedingly well. Alex Cantwell of Chronicles of Chaos webzine wrote about the album that it is undeniably original but in his opinion the rap and reggae experiments didn't fit the entity of the album at all. He also criticized the album cover and the album title as not fitting for a death/black metal influenced release. Josh Spencer of The Phantom Tollbooth webzine complimented Street Corner Queen for being \"refreshing\" and wrote that the band's personal style draws the whole album together. Just like Cantwell, Spencer didn't appreciate the rap and reggae part of the song \"Human Nature\". He called the setting \"horrible\", claiming that it makes the lyrics' serious message about sexual purity sound unintendedly hilarious. Spencer also wrote that in his opinion Deuteronomium should have not incorporated clean vocals on songs like \"Empty Shell\", claiming that the band's European accent sounds awkward. Despite the controversy, Street Corner Queen made Deuteronomium known outside Finland, and after the release they began playing bigger venues.\nAlbum pressings\n2001 digipak reissue cover done by Michael \"Starbuck\" Majalahti.\nAt first, Little Rose Productions took a pressing of 500 copies of Street Corner Queen. The original cover art - in which a girl from Jyväskylä has illustrated her vision of the album title - went through plenty of printing errors. According to the band, the cover was supposed to have a copper tone but it was misprinted as gray. Soon another pressing of 500 copies were taken, that time colors ended up being blue. These pressings contained the bonustrack \"Blue Moment\" from the previous Tribal Eagle EP. In 2001 Little Rose Productions reissued and remastered the album and pressed 1500 copies of it. This version was published in digipak format with new cover art done by Michael Majalahti. The bonustracks included the whole Tribal Eagle EP and a cover of One Bad Pig hit song \"Red River\".\nIn 2006, when Deuteronomium played a one-off concert at OHM-Fest event, Maanalainen Levykauppa – The Underground Record Store re-released Street Corner Queen with different cover art and layout. The pressing was 500 copies.\nTrack listing\n{| style=\"width: 100%;\"\n|-\n| style=\"width: 50%; vertical-align: top;\" |\nOriginal release\n#\"Street Corner Queen\" (3:00)\n#\"Drug Lord\" (2:13)\n#\"Spell of Hell (4:14)\n#\"The Fall\" (5:27)\n#\"Empty Shell\" (4:54)\n#\"Human Nature\" (6:37)\n#\"Bonsai People\" (5:21)\n#\"Black Raven\" (3:19)\n#\"C.C.R\t. (4:09)\n#\"III\" (5:53)\n#\"Northern Praise\" (5:22)\nBonustracks:\n#\"Blue Moment\" (4:29)\n| style=\"width: 50%; vertical-align: top;\" |\n2001 and 2006 reissues\n#\"Street Corner Queen\" (3:00)\n#\"Drug Lord\" (2:13)\n#\"Spell of Hell (4:14)\n#\"The Fall\" (5:27)\n#\"Empty Shell\" (4:54)\n#\"Human Nature\" (6:37)\n#\"Bonsai People\" (5:21)\n#\"Black Raven\" (3:19)\n#\"C.C.R\t. (4:09)\n#\"III\" (5:53)\n#\"Northern Praise\" (5:22)\nBonustracks:\n#\"Crosshope\"\n#\"Thinking\"\n#\"Tribal Eagle\"\n#\"Blue Moment\"\n#\"Red River\" (One Bad Pig cover)\n|}\nPersonnel\n*Miika Partala – guitar and vocals\n*Manu Lehtinen – bass guitar and background vocals\n*Kalle Paju – guitar and background vocals\n*Janne-Jussi Kontoniemi – drums and background vocals\nGuest musicians\n*Eeva Vehniäinen – female vocals on \"Northern Praise\"\nReferences"
    }
  ]
}