{
  "content": [
    {
      "type": "text",
      "text": "# Strong Democracy\n\nStrong Democracy: Participatory Politics for a New Age by Benjamin R. Barber was published by the University of California Press in 1984 and republished in a twentieth anniversary edition in 2004. The book argues that representative or \"thin\" democracy is rooted in an individualistic \"rights\" perspective that diminishes the role of citizens in democratic governance. The work offers a theoretical critique of representative or liberal democracy and a foundation for participatory politics. The final chapter elucidates practical ways to apply the theory of strong democracy in large industrial societies.\nStrong democracy is also discussed in The Local Politics of Global Sustainability by Herman Daly, Thomas Prugh and Robert Costanza (2000), and is defined as \"Politics understood as the creation of a vision that can respond to and change with the changing world.\"  The authors go on to describe strong democracy thus:\nIn a strong democracy, people – citizens – govern themselves to the greatest extent possible rather than delegate their power and responsibility to representatives acting in their names.   Strong democracy does not mean politics as a way of life, as an all-consuming job, game, and avocation, as it is for so many professional politicians.  But it does mean politics (citizenship) as a way of living: an expected element of one's life.  It is a prominent and natural role, such as that of \"parent\" or \"neighbor\".\nBackground\nAdvocates for strengthening democratic institutions and practices in the United States were convened beginning in 2008 under the title of Strengthening Our Nation's Democracy (SOND). The convenings brought together advocates of electoral reform, campaign finance reform, civic engagement, deliberative democracy, open government, civil rights, collaborative governance, media reform, service and immigrant civic inclusion to identify how they could better collaborate with one another. Among the convening organizations of Strengthening Our Nation's Democracy were AmericaSpeaks, Demos, Everyday Democracy, and faculty from Harvard's Ash Center for Democratic Innovation and Governance. As a result of the convenings, the groups formed a coalition called the Campaign for Stronger Democracy.\nCritique of liberal \"thin\" democracy\n\"Liberal,\" \"thin,\" or \"representative\" democracy was criticized throughout the 19th century by leading anarchists, such as Proudhon, Bakunin, and Kropotkin. In fact, Kropotkin's essay \"Representative Government\" in Words of a Rebel, 1885, can be regarded as a locus classicus of such criticism.  Instead of a bottom-up democracy, with a direct democracy or local elections for only local offices, liberal democracy consists of huge masses of people voting for political offices.  Winning a mass election is normally a function of how much money is used for advertisement, and, thus, results in a rule by oligarchs, or plutocracy.\nBarber posits that the radical individualism that underpins liberal theory and practice actually fundamentally undermines democracy. This weak democracy produces less legitimate outcomes than under a stronger democratic structure. Barber also criticizes the liberal construction of the social contract, claiming that traditionalists influenced primarily by Hobbes view man and law as mere abstractions, which contributes to isolationism within society and a series of emergent pathologies.\nDispositions of liberal democracy\nBarber dissects liberalism into three main dispositions, each representing a certain posture towards conflict and the relationship between the individual and the state.\nAnarchist\n* Idealist democracy is a strong citizenship\n* Radical individualist\n* Conflict-denying\nRealist\n* Strong statist protection of individual rights\n* Conflict-suppressing\nMinimalist\n* Pluralist\n* Conflict-tolerating\nSee also\n*Participatory politics\n*Participatory democracy\nReferences"
    }
  ]
}