{
  "content": [
    {
      "type": "text",
      "text": "# Stub Stewart\n\nWalter Leslie \"Stub\" Stewart (1888 – August 15, 1974) was an American athlete and coach for the University of Iowa.  He earned nine athletic letters at Iowa in football, basketball, and baseball from 1907 to 1910.  Stewart later served as the head coach of Iowa's basketball and baseball teams from 1910 to 1912.\nPlaying career\nWalter \"Stub\" Stewart was born in Tecumseh, Nebraska, but he moved to Iowa at age seven.  He attended Des Moines West High School and won letters in football, baseball, and track from 1904 to 1906.  Since his high school did not yet support a basketball team, Stewart played basketball for the local Y.M.C.A. team, which went undefeated in his three years there.\nWalter Stewart was nicknamed \"Stub\" because he stood five feet, five inches tall and never weighed more than 130 pounds during his athletic career.  Still, he went to the University of Iowa and earned nine athletic letters in football, basketball, and baseball from 1907 to 1910.  Stewart was the second team All-Big Ten quarterback as a senior in 1909.  He was the captain of the baseball team as a second baseman in 1909 and captain of the basketball squad in 1910.\nCoaching career\nStub Stewart graduated from Iowa in 1910 and entered law school at the university.  During his two years attending law school, he served as Iowa's head basketball and baseball coach for two seasons.  Stewart's Iowa baseball team compiled a 16-12-1 record in 1911 and 1912.  His Hawkeye basketball team had a 9–4 record in his first season in 1910–1911.  However, in his second season, Iowa struggled to a 6–8 record, including a 0–4 record in the Big Ten.  It remains the only winless conference season Iowa basketball has ever had.  Stewart earned his law degree from Iowa in 1912.\nStub Stewart then moved to Des Moines and opened a law practice.  He also served as a member of the Board of Control of Athletics at the University of Iowa for decades.  In 1938, Stewart was the representative sent by the university to Boston to negotiate a coaching contract with Eddie Anderson to become the head football coach of the Hawkeyes.\nHonors\nStub Stewart was inducted into the Iowa Sports Hall of Fame in 1965.  He was also inducted into the University of Iowa Athletics Hall of Fame in 2000.\nReferences"
    }
  ]
}