{
  "content": [
    {
      "type": "text",
      "text": "# Subculture (professional wrestling)\n\n|image_size =\n|caption =\n|names  = SubcultureSouth Wales SubcultureFlash Morgan Webster and Mark Andrews\n|members = Mark AndrewsFlash Morgan WebsterDani Luna\n|heights=\n|weights=\n|debut = July 29, 2018\n|years_active = 2018–present\n}}\nSubculture (sometimes stylized in all caps) is a Welsh professional wrestling stable consisting of Mark Andrews, Flash Morgan Webster, and Dani Luna which competes in various promotions in the United Kingdom such as One Pro Wrestling (1PW) and Revolution Pro Wrestling (RevPro). In RevPro, Andrews and Webster are former Undisputed British Tag Team Champions, while Luna is the reigning former British Women's Champion in her One time. Luna is also the former All Wales Champion in her one time in New Wave Wrestling. Also Luna win DEADLOCK Pro-Wrestling Best Of The Battle Tournament wins in 2024 and where DPW Women's World's Championship for first time in February 02, 2025.\nAndrews and Webster started teaming together in 2018 for WWE's NXT UK brand. The team became a staple of NXT UK's tag team division, winning the NXT UK Tag Team Championship once. They began using the name \"South Wales Subculture\" for the team in 2019, before being repackaged as a trio with the addition of Dani Luna in 2021, with the team name shortened to \"Subculture\". After departing WWE in 2022, Subculture has performed in various British promotions and joined Impact Wrestling in 2023, where they won the World Tag Team Championship once.\nHistory\nWWE\nNXT UK Tag Team Champions (2018&ndash;2019)\nWebster and Andrews were first paired together in WWE on the November 7, 2018 episode of NXT UK, where they teamed with Ashton Smith against The Coffey Brothers (Joe Coffey and Mark Coffey) and Wolfgang in a six-man tag team match, which they lost. Webster and Andrews picked up their first win on the November 21 episode of NXT UK by defeating Joseph Conners and Saxon Huxley. Webster and Andrews initially found very little success as a team, losing most of their tag team matches, except for a win over 205 Live representatives Ariya Daivari and Mike Kanellis on the April 17, 2019 episode of Worlds Collide.\nWebster and Andrews entered the title picture on the August 7 episode of NXT UK by expressing their desire to challenge Grizzled Young Veterans (James Drake and Zack Gibson) for the NXT UK Tag Team Championship. Webster would defeat Gallus member Mark Coffey on the August 14 episode of NXT UK, and Andrews defeated Drake on the August 21 episode of NXT UK. As a result, the two were added into the triple threat match for the titles against Grizzled Young Veterans and Gallus (Mark Coffey and Wolfgang) at NXT UK TakeOver: Cardiff. Webster and Andrews defeated both teams to win the titles. They retained the titles against Grizzled Young Veterans on the September 11 episode of NXT UK, before losing the titles to Gallus on the October 17 episode of NXT UK. Shortly, after the title loss, the team made its first appearance on Raw on November 8 by losing to The Viking Raiders (Erik and Ivar).\nFormation of Subculture (2019&ndash;2022)\nIn October, Andrews and Webster began using the name \"South Wales Subculture\" due to both wrestlers hailing from South Wales. At NXT UK TakeOver: Blackpool II, South Wales Subculture unsuccessfully challenged Gallus for the NXT UK Tag Team Championship in a fatal four-way ladder match, also involving Grizzled Young Veterans and Imperium (Fabian Aichner and Marcel Barthel). Following that, the team participated in the 2020 Dusty Rhodes Tag Team Classic, representing NXT UK against the eventual winners The BroserWeights (Matt Riddle and Pete Dunne) in a losing effort in the opening round.\nAfter engaging in various matches throughout 2020, the team was joined by Dani Luna who became the teams female valet in the spring of 2021 and repackaged as \"Subculture\". The trio was hyped in several vignettes in which each member's unique looks and passions for music genres were featured. On the June 17 episode of NXT UK, Subculture debuted as a trio with Webster and Luna defeating Jinny and Joseph Conners in a mixed tag team match. On the July 22 episode of NXT UK, Subculture unsuccessfully challenged Pretty Deadly (Lewis Howley and Sam Stoker) for the NXT UK Tag Team Championship.\nOn August 18, 2022, Subculture was released by WWE, along with various other NXT UK wrestlers, due to the NXT UK brand being discontinued for a revamp as \"NXT Europe\" planned for 2023.\nIndependent circuit (2019&ndash;present)\nWhile competing in WWE, Webster and Andrews began competing in the British independent circuit, beginning with Dragon Pro Wrestling's Rising Tide event on September 8, 2019. They wrestled matches for Pro Wrestling Chaos and Mark Andrews' own promotion Attack! Pro Wrestling. They frequently began wrestling on the independent circuit after leaving WWE in 2022, making a few appearances for Over the Top Wrestling, where they challenged The Draw (Adam Maxted and Charlie Sterling) for the OTT Tag Team Championship, wrestling to a time-limit draw. In 2023, Andrews revived Attack!, with Subculture defeating Lykos Gym (Kid Lykos and Kid Lykos II) and Elijah in a six-person tag team match at Attack! is Back on April 2.\nOne Pro Wrestling (2023)\nIn April 2023, it was announced that Subculture would make their One Pro Wrestling debut at its All Or Nothing event on April 22, 2023, by participating in a four-way ladder match for the reactivated 1PW Tag Team Championship, against The Rascalz (Trey Miguel and Zachary Wentz), Boisterous Behaviour (Man Like DeReiss and Leon Slater), and Bullet Club (Ace Austin and Chris Bey). Boisterous Behaviour won the vacant titles. At the next event ''Devil's Due'', Subculture unsuccessfully challenged Boisterous Behaviour for the titles.\nTotal Nonstop Action Wrestling (2023&ndash;2024)\nIn May 2023, it was announced that Subculture would make its debut for Impact Wrestling at Under Siege by challenging ABC (Ace Austin and Chris Bey) for the Impact World Tag Team Championship, marking Andrews' return to Impact after six years and Luna and Webster's debut for the promotion. Subculture failed to win the titles. On the June 1 episode of Impact!, Luna lost her debut match against Jody Threat, while Andrews and Webster lost to The Motor City Machine Guns (Alex Shelley and Chris Sabin). It was later announced that Subculture would return to Impact to participate in a four-way match for the World Tag Team Championship against ABC, Brian Myers and Moose, and Rich Swann and Sami Callihan at Slammiversary. Subculture won the titles after interference by The Rascalz (Trey Miguel and Zachary Wentz). Subculture successfully defended the titles against ABC on the July 20 episode of Impact!, before losing the titles to The Rascalz at Emergence.\nRevolution Pro Wrestling (2023&ndash;present)\nSubculture made its Revolution Pro Wrestling debut at Live in London 75 on July 2, 2023, by defeating Lykos Gym. The following week, at Epic Encounter, Andrews and Webster defeated Greedy Souls (Brendan White and Danny Jones) to win the Undisputed British Tag Team Championship. They made their first successful title defense against Sunshine Machine (Chuck Mambo and TK Cooper) at Live in London 76. At Live at the Guildhall, the Subculture trio teamed together for the first time in RevPro as Luna, Webster and Andrews defeated Greedy Souls and Skye Smitson in a mixed six-person tag team match. At 11th Anniversary Show, Luna won a battle royal to become the #1 contender for the Undisputed British Women's Championship while Andrews and Webster retained the titles against The VeloCities (Jude London and Paris De Silva).\nChampionships and accomplishments\n*Impact Wrestling\n**Impact World Tag Team Championship (1 time) – Webster and Andrews\n** TNA Knockouts World Tag Team Championship (2 times) – Luna and Jody Threat\n*Deadlock Pro-Wrestling\n**DPW Women's World's Championship (1 time, current) – Luna\n**Battle Of The Best Tournament (2024) – Luna\n*New Wave Wrestling\n**All Wales Championship (1 time) - Luna\n*Riot Cabaret Pro Wrestling\n**Riot Cabaret World Championship (1 time, current)- Andrews\n*Revolution Pro Wrestling\n**Undisputed British Tag Team Championship) (1 time) – Webster and Andrews\n** RevPro British Women's Championship (1 time) - Luna\n** Southside Women's Championship (1 time) - Luna\n*WWE\n**NXT UK Tag Team Championship (1 time) – Webster and Andrews\nReferences\nExternal links\n*[https://impactwrestling.com/subculture/ Subculture profile] at Impact Wrestling"
    }
  ]
}