{
  "content": [
    {
      "type": "text",
      "text": "# Submarine warfare in the Black Sea campaigns (1943)\n\n|conflict=Submarine warfare in the Black Sea in World War II\n|partof= the Black Sea Campaigns of the Eastern Front of World War II\n|date= 1943\n|place=Western and Eastern Black Sea\n| result = Inconclusive\n* Limited Soviet success\n|combatant1=\n|combatant2=\n|commander1=  Unknown\n|commander2=  Unknown\n|strength1=  6 U-boats 5 midget-submarines Anti-submarine forces\n|strength2=  29 submarines Anti-submarine forces\n|casualties1=  4 merchants sunk 1 tanker sunk 6 barges sunk  1 damaged 1 tug sunk 1 merchant sunk 1 barge sunk 1 merchant sunk\n|casualties2=  3 submarines sunk  2 minesweeper sunk 1 damaged  2 patrol boat sunk 2 landing crafts sunk 1 merchant sunk  1 tanker lost\n|casualties3=  3 neutral Turkish vessels sunk\n}}\nSubmarine warfare in the Black Sea in World War II during 1943 involved engagements between submarines of the Soviet Black Sea Fleet attacking Axis merchantmen defended by Romanian and German naval warships, as well as and German U-boats attacking Soviet merchants on the eastern Black Sea. These engagements were a part of the Black Sea campaigns between Axis and Soviet naval forces.\nBackground\nAs during the first 1941 campaign and the following year campaign, the Soviet Navy sent submarines against the Axis supply lines along the western coast of the Black Sea. Once again, Axis defenses primarily consisted of Romanian-laid fields of mines. At the beginning of the year the Soviet navy had 18 operable submarines (and 11 on refit), and organized them into \"wolf packs\" of groups of 3 with an attempted coordination with aircraft (though reports were often late). At first Soviet results were reduced due to effective German interception and the shallow drafts of many targets, however better results were scored after the summer with introduction of new torpedo fuses.\nGerman U-boats of the 30th U-boat Flotilla operated on the eastern site of the Black Sea, attacking Soviet targets.\nEngagements\n* On 13 February, the German submarine U-24 was attacked by 4 aircraft off Gelendzhik. 2 depth charges caused minor damage.\n* On 31 March, the German submarine U-24 torpedoed and damaged the Soviet tanker \"Kreml'\" off Gagra.\n* On 20 April, the Soviet submarine S-33 torpedoed and sunk the Romanian merchant \"Suceava\" (6876 GRT).\n* On 23 May, the Soviet submarine L-4 damaged the German landing craft F-329 off Yalta with gunfire, but it later was repaired.\n* On 15 June, the German submarine U-24 torpedoed and sunk the Soviet minesweeper Tszcz-411 \"Zashchitnik\" (Fugas-class) off Sukhumi.\n* On 26 June, the German submarine U-20 attempted to attack a Soviet submarine chaser off Tuapse, but she received depth charges in return: further attacks by aircraft in the next four hours forced the submarine to stay submerged and eventually return to base after mechanical failures.\n* On 18 July, the Soviet submarine M-111 torpedoed and sunk the Romanian barge \"Dunarea-I\" (505 GRT) off Fedosiya.\n* On 22 July, the Soviet submarine L-4 sunk the Turkish sailing vessels \"Hudayi Bahri\" (29 GRT) and \"Tayyari\" (409 GRT) off the Bosporus with gunfire.\n* On 23 July, the Soviet submarine L-4 sunk the Turkish sailing vessel \"Gurpinar\" (100 GRT) off the Bosporus with gunfire.\n* On 30 July, the German submarine U-24 torpedoed (two hits) the Soviet tanker \"Emba\" (7886 GRT) while she was moored off Sukhumi Lighthouse as a stationary storeship (engine room was not operative after a previous Luftwaffe attack). The tanker was a total loss.\n* On 6 August, the Soviet submarine ShCh-216 torpedoed and damaged the German tanker \"Friederike\" (7327 GRT) off the Bosporus.\n* On 11 August, the Soviet submarine D-4 torpedoed and sunk the German merchant \"Boy Federsen\" (6686 GRT) off the Tarkhankut peninsula; the ship having already been torpedoed by aircraft on the previous day.\n* On 20 August, the Soviet submarine D-4 torpedoed and sunk the Bulgarian merchant \"Varna\" (2141 GRT) off the Tarkhankut peninsula.\n* On 22 August, the German submarine U-24 attacked the Soviet patrol boat SKA-0188 on surface with 20mm artillery. The patrol boat returned fire and dropped the lines of landing crafts DB-36 and DB-37 before escaping undamaged. U-24 sunk both the landing crafts with gunfire, hand grenades and demolition charges after taking 6 prisoners.\n* On 24 August, the German submarine U-23 sunk on surface action the Soviet patrol boat \"Shkval\" with hand grenades and explosive charges.\n* On 26 August, the Italian midget-submarine CB-4 torpedoed and sunk the Soviet submarine ShCh-203.\n* On 28 August, the Soviet submarine M-111 torpedoed and sunk the German tug \"Hainburg\" (400 GRT) off Cape Lukull.\n* On 29 August, the German submarine U-18 torpedoed and sunk Soviet minesweeper TSC-11 \"Dzhalita\" off Poti.\n* On 30 August, the German submarine U-18 attacked and damaged the Soviet patrol boat SKA-0132 with 20mm gunfire but was forced to leave after floodlight from shore. On the same day, Soviet submarine ShCh-215 torpedoed and sunk the German merchant \"Thisbé\" (1782 GRT) off Bosporus.\n* On 10 October, the Soviet submarine A-2 torpedoed and sunk the German barge F-474 off Yalta.\n* On 15 October, the German submarine U-23 torpedoed and damaged the Soviet minesweeper TSC-486 \"Sovetskaja Rossija\". The submarine had previously tried to attack a steamer that was part of the same convoy but was chased away by gunfire from the escort.\n* On 23 October, the German submarine U-23 torpedoed and sunk the Soviet merchant \"Tanais\" (372 GRT) at anchor off Poti.\n* On 25 October, the Soviet submarine M-112 torpedoed and sunk the German barge \"Tyra-5\" (1278 GRT) off Ak Mechet.\n* On 28 October, the Soviet submarine A-3 was sunk, most likely by German auxiliary anti-submarine ship Schiff 19 at Karkinit Bay\n* On 31 October, the German submarine U-24 torpedoed and sunk the Soviet patrol boat SKA-088 off Gagra.\n* On 2 November, the Soviet submarine M-35 torpedoed and sunk the German barge SNR-1293 off Ak Mechet.\n* On 12 November, the Soviet submarine M-111 torpedoed and sunk the German merchant \"Theoderich\" (3814 GRT) off Cape Burnas.\n* On 15 November, the Soviet submarine ShCh-215 torpedoed and sunk the German barge \"F-592\".\n* On 18 November, the German submarine U-18 torpedoed and damaged the Soviet tanker \"Josif Stalin\" (7745 GRT) off Sukhumi. The tanker was later moved to Batumi and repaired.\n* On 23 November, the Soviet submarine D-4 torpedoed and sunk the German merchant \"Santa Fè\" (4627 GRT) off Yevpatoriya. The ship was carrying materials for the German Army, including 12 StuG III assault guns.\n* On 25 November, the Soviet submarine L-6 torpedoed and sunk the German tanker \"Wolga-Don\" (965 GRT) off the Crimean coast.\n* On 29 November, the German submarine U-20 torpedoed the Soviet tanker \"Peredovik\" (1846 GRT) but the hit was a dud and the target suffered only a small hole in the hull.\n* After 1 December, the Soviet submarine D-4 was lost, most likely mined off the Crimea coast.\n* On 2 December, the Soviet submarine ShCh-209 torpedoed and sunk the German barge F-566 off Yevpatoriya.\n* On 9 December, the Soviet submarine S-31 torpedoed and sunk the German barge F-580 off Ak-Mechet.\nOutcome\nSoviet submarines have been estimated to have sunk 20 targets (34,000 GRT) while suffering less losses: a better result compared to the campaigns of 1941 and 1942. This improvement forced the Germans to create a proper anti-submarine warfare unit: the 1. Unterseebootsjagdflottille, operating since June 1943 with 18 converted trawlers supported by BV-138 flying boats.\nSee also\n* Black Sea campaigns (1941–1944)\n* Submarine warfare in the Black Sea campaigns (1941)\n* Submarine warfare in the Black Sea campaigns (1942)\n* Submarine warfare in the Black Sea campaigns (1944)\nReferences"
    }
  ]
}