{
  "content": [
    {
      "type": "text",
      "text": "# Submarine warfare in the Black Sea campaigns (1941)\n\n|combatant2=\n|commander1=  Unknown\n|commander2=  Unknown\n|strength1= 1 submarine (Delfinul)\n|strength2= 47 submarines\n|casualties1= 1 minelayer sunk 1 cargo ship sunk 1 minesweeper sunk 1 cargo ship sunk 2 tankers sunk 2 barges lost\n|casualties2= 7 submarines sunk 1 tanker sunk\n|casualties3=  2 neutral Turkish vessels sunk\n}}\nSubmarine warfare in the Black Sea in World War II during 1941 primarily involved engagements between submarines of the Soviet Black Sea Fleet attacking Axis merchantmen defended by Romanian and Bulgarian warships. These engagements were a part of the naval Black Sea campaigns between Axis and Soviet naval forces.\nBackground\nAt the beginning of the war the Soviet Navy enjoyed absolute superiority in terms of submarine warfare, possessing 47 active Submarines in the Black Sea against a single submarine operated by the Romanian Navy, the lonely Delfinul.\nEngagements\nOn 9 July, the Romanian gunboat Stihi Eugen informed the Romanian torpedo boat Năluca and motor torpedo boats Viscolul and Vijelia that the periscope of an enemy submarine was sighted near Mangalia. In the ensuing battle, the Soviet  Shchuka-class submarine Shch-206 was attacked by Năluca, at first with 20&nbsp;mm rounds and then with depth charges, eventually being sunk with all hands aboard. According to Romanian sources, a second submarine was also sunk by the two motor torpedo boats.\nOn 11 August, the Romanian submarine NMS Delfinul was unsuccessfully attacked by M-class submarine M-33 near Constanța.\nOn 15 August, the Romanian merchant Peles was torpedoed and sunk by the Soviet submarine ShCh-211 north east of Cape Emine, in Bulgarian waters, while the Italian tanker Superga was missed during the same attack.\nOn 16 August, the Soviet submarine ShCh-211 attacked once more close Cape Ermine, but missed Romanian merchant Ardeal.\nOn 14 September, the Bulgarian merchant Chipka sunk after running on a mine laid by Soviet submarine L-4, close Varna.\nOn 19 September, the Bulgarian auxiliary minesweeper W-2 sunk close Cape Galata due to a mine laid by Soviet submarine L-4 or L-5.\nOn 5 October, the Romanian destroyer Regina Maria was unsuccessfully attacked by Soviet submarine L-4 near Mangalia.\nOn 10 October, the Romanian auxiliary minelayer NMS Regele Carol I sunk close Cape Galata after running on a mine laid by Soviet submarine L-4 or L-5.\nBetween 17 and 21 October, the exact date being unclear, the Soviet submarine M-58 was lost; most likely having hit a mine in the Danube estuary area.\nOn 26 October, the Soviet small submarine M-35 attacked, on surface, a convoy of German barges with gunfire: SF-25 was sunk and SF-36 was heavily damaged and driven ashore off Sulina.\nOn 3 November, the Turkish sailing vessel Kaynakdere was sunk with gunfire by Soviet submarine Shch-214 close Cape Igneada. After this day, the Soviet submarine M-34 was lost on unclear date near Costanza.\nOn 5 November, the Italian tanker Torcello was torpedoed and sunk by Soviet submarine Shch-214 close Cape Igneada. On the same day, Romanian submarine Delfinul claimed the torpedoing and sinking of the Soviet tanker \"Uralles\" (1975 GRT) off Yalta, the only known successful torpedo attack from a Romanian submarine during the war. However the tanker was possibly sunk by the Luftwaffe on 29 October while other sources report it was probably attacked by the minelayer Ostrovsky\nOn 6 November, the Romanian destroyer Mărășești was unsuccessfully attacked by the Soviet S-class submarine S-33 near Mangalia.\nBetween 12 and 13 November it was likely sunk Soviet submarine S-34 on mines off Bulgarian coast.\nAfter 14 November, the Soviet submarine ShCh-211 was lost in the Romanian defensive mine field \"S-18\" south of Varna.\nOn 18 November, the Turkish merchant \"Yenice\" was torpedoed and sunk in Bulgarian waters by Soviet submarine ShCh-215.\nOn 29 November, the Soviet submarine ShCh-211 torpedoed and sunk the Italian tanker Superga close Cape Ermine.\nOn 6 December, the Soviet submarine Shch-204 was spotted by Bulgarian Arado Ar 196 reconnaissance aircraft near Varna. The Bulgarian submarine chasers Belomorets and Chernomorets, together with the aircraft, attacked and sunk the submarine with depth charges.  type.]]\nOn 17 December, near Jibrieni, the Soviet submarine M-59 attacked an Axis convoy consisting of the Hungarian cargo ships Kassa and Kolozsvár and the Bulgarian cargo ship Tzar Ferdinand, escorted by the Romanian Navy with the Regele Ferdinand-class destroyers Regele Ferdinand and Regina Maria, gunboats Stihi Eugen and Sublocotenent Ghiculescu, and torpedo boats Sborul and Smeul. The attack failed, with M-59 being depth-charged by Regele Ferdinand and sunk with all hands aboard. According other sources, M-59 was lost running on mines earlier in November.\nOutcome\nSoviet submarines are estimated to have sunk 10 targets (19,000 tons) of Axis shipping. Gunnery was favoured but many torpedoes were launched, even against shallow-draught targets who were often not hit.\nSee also\n* Romanian Navy during World War II\n* Black Sea campaigns (1941–44)\n* Submarine warfare in the Black Sea campaigns (1942)\n* Submarine warfare in the Black Sea campaigns (1943)\n* Submarine warfare in the Black Sea campaigns (1944)\n* List of battles of the Romanian Navy\nReferences\nExternal links\n* [http://www.ligamilitarilor.ro/arc-peste-timp/marina-militara-romana-in-timpul-celui-de-al-doilea-razboi-mondial/ Torpilorul NĂLUCA, spaima submarinelor sovietice]"
    }
  ]
}