{
  "content": [
    {
      "type": "text",
      "text": "# Suffocate (King Adora song)\n\n\"Suffocate\" is the fourth single by British glam rock band King Adora. The single was released on 19 February 2001 on Superior Quality Recordings and reached number 39 on the UK Singles Chart, becoming the band's first Top 40 single. The song would be included as the closing track on the band's debut album, Vibrate You and frequently closed their live shows.\nBackground\nWriting and recording\nSuffocate was written on a bunk bed in Sawmills Studios in Cornwall by Matt Browne and Martyn Nelson during recording sessions for their debut album Vibrate You in late 2000. Nelson revealed it was \"a special moment\" when Browne played the chords and Nelson came up with the song's opening riff. They quickly agreed that Suffocate would be \"a good song\". Suffocate was produced and mixed by John Cornfield. Like other songs recorded for Vibrate You, Suffocate contains programmed drum loops which made up a backing track for the recording and live performances.\nThemes\nBrowne called Suffocate \"an anti-love song, destruction of something beautiful\". He was inspired to write the song's lyrics after returning from a tour to find his then-girlfriend had died. Browne never had the chance to say he was sorry before her passing and the song became a way of conveying his emotions. On the band's 2012 Who Do You Love? | The King Adora Story documentary he revealed that \"things weren't well at all, most of it my fault, because I was too much caught up in the lifestyle of being on the road and ignoring what's real\".\nB-sides\nThree b-sides were released on the single, Aceface, Into Space and ''Drink Don't Think. All three songs were recorded at Woodbine Street Recording Studios in Royal Leamington Spa and were produced by the band and Dan Sprigg, with Sprigg and Jamie Travers mixing. Into Space featured the only use of trumpets on a King Adora song. Aceface'' would occasionally appear in the band's live sets during 2001 and was included as a bonus track on the Enhanced CD version of Vibrate You.\nVideo\nThe Suffocate release was accompanied by King Adora's third music video, directed by Dan Crouch. Crouch commented that in the video \"the band is taken over by an apparition that travels into the room through the chandelier\".\nReception\nIn a poor review, NME said \"it's only marginally sexier, in fact, than Darius off Popstars doing Britney\". Drowned in Sound were positive, rating the single 8/10 and commenting \"if they can produce more of this, they may not be as throwaway as they first appeared\".\n}}\nTrack listing\nEnhanced CD 1\n# \"Suffocate\"\n# \"Aceface\"\n# \"Smoulder\" (video)\nEnhanced CD 2\n# \"Suffocate\"\n# \"Into Space\"\n# \"Drink Don't Think\"\n# \"Suffocate\" (video)\n7\"\n# \"Smoulder\"\n# \"Aceface\"\nPersonnel\n* Matt Browne – vocals, rhythm guitar\n* Martyn Nelson – lead guitar\n* Robbie Grimmit – bass\n* Dan Dabrowski – drums\nProduction\n* Suffocate – Produced and mixed by John Cornfield\n* Aceface, Into Space, ''Drink Don't Think'' – Produced by King Adora and Dan Sprigg, mixed by Dan Sprigg and Jamie Travers\nReferences"
    }
  ]
}