{
  "content": [
    {
      "type": "text",
      "text": "# Sugden Award__disambig_1\n\nThe Sugden Award is an annual award for contributions to combustion research. The prize is awarded by the British Section of The Combustion Institute for the published paper with at least one British Section member as author, which makes the most significant contribution to combustion research. The prize is named after Sir Morris Sugden.\nThe aims of the award are threefold:\na) to recognise good work in combustion\nb) to encourage membership of the Combustion Institute\nc) to encourage combustion research and publication, especially by British institutions.\nSugden Award recipients\nSource: [https://www.combustion.org.uk/awards/previous-winners/ Combustion Institute]\n* 2016. X. Huang, F. Restuccia, M. Gramola, G. Rein, Experimental Study of the Formation and Collapse of an Overhang in the Surface Spread of Smouldering Peat Fires, Combustion and Flame 168, pp.&nbsp;393–402, (2016).\n* 2015. P. G. Aleiferis and M. K. Behringer \"Flame front analysis of ethanol, butanol, iso-octane and gasoline in a spark-ignition engine using laser tomography and integral length scale measurements\" Combustion and Flame, vol. 162, pages 4533–4552, (2015).\n* 2014. B. Williams, M. Edwards, R. Stone, J.  Williams and P. Ewart \"High precision in-cylinder gas thermometry using laser induced gratings: Quantitative measurement of evaporative cooling with gasoline/alcohol blends in a GDI optical engine\" Combustion and Flame, Vol. 161, pages 270–279, (2014).\n* 2013. R.S.M. Chrystie, I.S. Burns, C.F. Kaminski \"Temperature response of an acoustically-forced turbulent lean premixed flame: A quantitative experimental determination\", Combustion Science and Technology, vol. 185, pp.&nbsp;180–199, (2013).\n* 2012. G. Dixon-Lewis, P. Marshall, B. Ruscic, A. Burcat, E. Goos, A. Cuoci, A. Frassoldati, T. Faravelli, P. Glarborg \"Inhibition of hydrogen oxidation by HBr and Br2\" Combustion and Flame, vol. 159 (2012) pp.&nbsp;528–540.\n* 2011. N. Swaminathan, G. Xu, A. Dowling and R. Balachandran \"Heat release rate correlation and combustion noise in premixed flames\" Journal of Fluid Mechanics (2011), vol. 681, pp.&nbsp;80–115.\n* 2010. B. Williams, P. Ewart, X. Wang, R. Stone, H. Ma, H. Walmsley, R. Cracknell, R. Stevens, D. Richardson, H. Fu and S. Wallace \"Quantitative planar laser-induced fluorescence imaging of multi-component fuel/air mixing in a firing gasoline-direct-injection engine: Effects of residual exhaust gas on quantitative PLIF\" Combustion and Flame v. 157 (2010) pp.&nbsp;1866–1878.\n* 2009. D. Bradley and G. Kalghatgi \"Influence of autoignition delay time characteristics of different fuels on pressure waves and knock in reciprocating engines\" Combustion and Flame, 156 (2009) 2307–2318.\n* 2008. J.C.G. Andrae, T. Brinck and G.T. Kalghatgi, \"HCCI experiments with toluene reference fuels modeled by a semidetailed chemical kinetic model\" Combustion and Flame, 155, 696-712 (2008) .\n* 2007. W.P. Jones and S. Navarro-Martinez, \"Large eddy simulation of auto-Ignition with a sub-grid PDF method\" Combustion and Flame, 150, 170-187 (2007).\n* 2006. V R Savarianandam and C J Lawn, \"Burning velocity of premixed turbulent flames in the weakly wrinkled regime\" Combustion and Flame, 146, 1-18, 2006.\n* 2005. S. Navarro-Martinez, A. Kronenburg and F. Di Mare, \"Conditional moment closure for large eddy simulations\" Flow, Turbulence and Combustion 75: 2005, p 245-274 (2005).\n* 2004. A. Kronenburg, \"Double conditioning of reactive scalar transport equations in turbulent nonpremixed flames\" Physics of Fluids Vol 16, p 2640 (2004).\n* 2003. M. Balthasar and M. Kraft, \"A stochastic approach to calculate the particle size distribution function of soot particles in laminar premixed flames\" Combustion and Flame 133 289 (2003).\n* 2002. J.F.Griffiths and B.J.Whitaker, \"Thermokinetic Interactions Leading to Knock during Homogeneous Charge Compression Ignition\", Combustion and Flame 131 386-399 (2002).\n* 2001. K. N. C. Bray, M. Champion and P.A. Libby, \"Pre-mixed flames in stagnation turbulence. Part V - Evaluation of Models for the chemical source term\" Combustion and Flame, 127 2023 (2001).\n* 2000. G M Abu-Orf and R S Cant, \"A Turbulent Reaction Rate Model for Premixed Turbulent Combustion in Spark-Ignition Engines\" Combustion & Flame, 122 233-252 (2000).\n* 1999. K H Luo, \"Combustion Effects on Turbulence in a Partially Premixed Supersonic Diffusion Flame\" Combustion and Flame, 119 417-435 (1999).\n* 1998. G.M.Makhviladze, J.P. Roberts and S.E. Yakhush, \"Numerical Modelling of Fireballs from Vertical Releases of Fuel Gases\" Combustion Science and Technology, 132 129-223 (1998).\n* 1997. N. Syred, W. Fick, T. O'Doherty and A.J. Griffiths, \"The Effect of the Precessing Vortex Core on Combustion in a Swirl Burner\" Combustion Science and Technology, 125 139-157 (1997).\n* 1996. G. Dixon-Lewis, \"Laminar premixed flame extinction limits\" Proceedings of the Royal Society A452 1857-1884 (1996).\n* 1995. K.M. Leung and R.P. Lindstedt, \"Detailed modelling of C1-C3 alkane diffusion flames\" Combustion and Flame 102 129-160 (1995).\n* 1994. D. Bradley, P.H. Gaskell and X.J. Gu, \"Application of a Reynolds Stress, stretched flamelet, mathematical model to computations of turbulent burning velocities and comparisons with experiments\" Combustion and Flame 96 221-248 (1994).\n* 1993. E. Hampartsoumian, P.L. Murdoch, M. Pourkashanian, D.T. Trangmar and A. Williams \"The Reactivity of Coal Gas Chars Gasified in a Carbon Dioxide Environment\" Combustion Science and Technology 92 105-121 (1993).\n* 1992. A.S. Tomlin, M.J. Pilling, T. Turanyi, J.H. Merkin and J. Brindley \"Mechanism reduction for the oscillatory oxidation of hydrogen: sensitivity and quasi-steady-state analyses\" Combustion and Flame, 91 p107 (1992).\n* 1991. F.C. Lockwood, M. Costa and P. Costen, \"Detailed Measurements in a heavy fuel oil-fired furnace\" Combustion Science and Technology 77 1-26 (1991).\n* 1990. T.C. Chew, K. N.C. Bray, R. E. Britter, \"Spatially Resolved Flamelet Statistics for Reaction Rate Modelling\" Combustion and Flame 80 65-82 (1990).\n* 1989. A. Hayhurst and H. Jones, \"The effect of metal additives on ionisation and soot formation in oxy-acetylene flames\" Combustion and Flame 78 339-356 (1989).\n* 1988. D. Baulch, J.F. Griffiths, A. Pappin, A. Sykes, \"Stationary states and oscillatory combustion of hydrogen in a well-stirred flow reactor\" Combustion and Flame 73 163-185 (1988).\n* 1987. D. Bradley and Lung, \"Spark Ignition of the early stages of Turbulent Flame Propagation\" Combustion and Flame 69 71-93 (1987).\n* 1986. M.V. Heitor and J.H. Whitelaw, \"Velocity, Temperature and species Characterisations of the flow in a Gas-turbine Combustor\" Combustion and Flame 64, (1986).\nSee also\n* List of engineering awards\nReferences\nExternal links\n* [http://www.combustion.org.uk/index.html British Section of the Combustion Institute]"
    }
  ]
}