{
  "content": [
    {
      "type": "text",
      "text": "# Suhrawardy family\n\n}}}}\n| parent_family = Banu Taym, Family of Abu Bakr\n| motto =\n| type =\n| country = India, Pakistan, Bangladesh\n| titles =\n| founded = c. 1118 A.D.; 904 years ago\n| founder = Shihab al-Din 'Umar al-Suhrawardi\n| origin = Sohrevard, Iran\n| etymology = After Sohrevard and their ancestor Shihab al-Din 'Umar al-Suhrawardi who resided there.\n| other_families =\n| traditions = Suhrawardiyya Sunni Islam, Sufism\n| ethnicity =\n| seat = Midnapore\n}}\n{| class=\"infobox\" style=\"float: right; text-align: center; font-size: 85%; clear:right;\"\n|Suhrawardy Family Tree\n|-\n|- style=\"background: green\"\n!Midnapore\n|-\n|Ubaidullah Al Ubaidi Suhrawardy;· Ali Mobarak Suhrawardy\n|-\n|\n|-\n|- style=\"background: green;\"\n!Kolkata\n|-\n|Hassan Suhrawardy\n|-\n|Abdullah Al-Mamun Suhrawardy\n|-\n|Khujista Akhtar Banu\n|-\n|Amin Suhrawardy\n|-\n|Zahid Suhrawardy\n|-\n|Huseyn Shaheed Suhrawardy\n|Hasan Shaheed Suhrawardy\n|Shaista Suhrawardy Ikramullah\n|-\n|Princess Sarvath al-Hassan\n|Rashid Suhrawardy\n|-\n|\n|- style=\"background: green;\"\n!Odisha\n|-\n|\n|-\n|Begum Badar un nissa Akhtar\n|Ibrahim Suhrawardy\n|-\n|Afzal-ul Amin\n|-\n|- style=\"background: green;\"\n!Allahabad\n|-\n|Nilofar Suhrawardy\n|-\n|-\n|}\nThe Suhrawardy family with over nine hundred years of recorded history has been one of the oldest leading noble families and political dynasties of the Indian subcontinent and is regarded as an important influencer during the Bengali Renaissance. The family has produced many intellectuals who have contributed substantially in the fields of politics, education, literature, art, poetry, socio-religious and social reformation. Numerous members of the family, both biological descendants and those married into the family, have had prolific careers as politicians, lawyers, judges, barristers, artists, academicians, social workers, activists, writers, public intellectuals, ministers, educationists, statesmen, diplomats and social reformers.\nFamily history\nThe family origin can be traced back to the 11th Century Iranian philosopher and writer Shihab al-Din 'Umar al-Suhrawardi, a paternal nephew of Abu al-Najib Suhrawardi, who founded the Suhrawardiyya Sufi order in 1118 A.D. The family gets its name from Shorevard, a city in Iran where Najib took birth, learnt, preached and eventually founded the Sufi order. The family lineage continued through his nephew Shihab al-Din 'Umar al-Suhrawardi as he himself was childless, one of Shihab al-Din Umar al-Suhrawardi's grandsons migrated to Multan in 1207 during the Mamluk rule in India, making the Suhrawardys first of the Sufis to come to India even before the Chishtis. The family has produced many philosophers and saints since then who were greatly revered by the Mamluks, as they played a major role in consolidating the position of the empire in Multan through their preachings. Bahauddin Zakaria Suhrawardi declared Iltutmish as the lawful successor of Qutubuddin Aibak which helped Iltutmish in securing his rule in the sub-continent, causing his enemies such as Nasir-ud-din Qabacha to retreat. That very year, Iltutmish awarded Bahauddin Zakaria with the title of Shaykh al-Islam. The Suhrawardis received the royal patronage too. The subsequent successive Sultans of Delhi remained loyal to the Suhrawardis, including Alauddin Khilji who received Sheikh Ruknuddin Suhrawardi personally at Delhi gate and kissed his feet as a mark of respect. The dargaah of Makhdoom Yahya Maneri Suhrawardi, another scion of this family was frequently visited by Babur, Bahlol Lodi and later by Sher Shah Suri. The Tuglaqs too greatly admired the Suhrawardys, the Tomb of Shah Rukn-e-Alam, the grandson of Bahauddin Zakariya Suhrawardi was commissioned and built by Ghias ud din Tuglaq in 1324 A.D, who was a humble follower of the former and used to visit him often in Multan.\nThe founder of the Nizam Shahi dynasty of Hyderabad, Deccan, Nizam-ul-Mulk, Asaf Jah I (1724) too has descended from the Bayanfandi clan of the Suhrawardi family.\nThe Bengali Suhrawardies are the descendants of the Shiraaji clan of this Suhrawardi family, who migrated from Multan to Bengal in the 15th Century, when Bengal was ruled by the Hussain Shahi dynasty. Much of their early history is evidently synonymous with the history of the Suhrawardiyya order. The family however has been known since the medieval times in East India for its piety, wisdom, forthrightness, religious and socio political reformations, which they brought by playing a key role in influencing the politics in Bengal until the death of Sirajuddin Shah Suhrawardy, who was closely involved with the Ashfar dynasty, Sharfunnesa Begum Sahiba and Nawab Siraj ud Daulah, the last independent Nawab of Bengal. It was only after the Battle of Plassey in 1757, that the family officially found itself in a situation where it could no longer play a role in influencing the machinations of the monarchical politics in Bengal, hence the family briefly turned to mysticism. Until Ubaidullah al-Ubaidi Suhrawardy rose to prominence and overturned the family's fortune, as a result of which the family soon found its place back in the political arena. Ubaidullah did not consider himself a mystic and turned away from the family traditions to establish a new legacy altogether, thus making his father Shah Aminuddin Suhrawardy the last Sufi Pir of this family. Ubaidullah's children, grandchildren, great grandchildren and successive generations all grew up to play major roles in administration and politics and made significant contributions in the field of art, literature, law and social reformation, making their family, British Bengal's most prominent family and subsequently one of the most exceptionally illustrious families of the Indian subcontinent\nFamily background\nThe Suhrawardys are Ashraf (high-born muslims) and direct descendants of the first Caliph of Islam, Abu Bakr (573 A.D - 634 A.D) and are hence of Arab descent. However, their ancestor, Sa'ad Bin Al Hasan migrated from Arab lands to Sohrevard in Iran in 812 AD, to save himself from incurring the wrath of the Caliph, al-Amin on a matter of principle, during the fourth fitna civil war (811 - 813 A.D.). In Iran, his great great great great grandchild, Abu al-Najib Suhrawardi established the Suhrawardiyya Sufi order, dynasty and family in 1118 A.D, hence the Suhrawardys have a significant Iranian heritage too. They came to the Indian subcontinent in 1207 A.D. to expand the Suhrawardiyya Sufi order and settled in Multan, from where the Shiraaji Suhrawardys migrated to Bengal in the 15th century to popularize the ideas of Sufism in the East. The subsequent generations were thus endowed with a mix of Arab, Iranian and Indian heritages.\nThere are numerous exhaustive Persian annals that throws light on the early history of the Suhrawardys. The records mention, Nahur, one of the dynasty's earliest known ancestor to have originated from the Mesopotamian civilization, who used to live in the city of Ur back in 6400 B.C. during the Ubaid period.\nThe Bengal renaissance of the 19th century was an extraordinary period of societal transformation in the fields of arts, literature, culture, music, politics, administration and education. The Bengal Renaissance was the culmination of the process of emergence of the cultural characteristics of the Bengali people that had started in the age of Alauddin Hussain Shah (1493–1519) under whose rule the Suhrawardys came to Bengal from Multan. This revolution, however, lasted for around three centuries, and had a tremendous impact on the Bengali society. It was also during this remarkable period, that the saying \"What Bengal thinks today, India thinks tomorrow\" resonated throughout the rest of India. This time frame coincided with the resurrection of the Suhrawardy family and the rise of the Tagore family.\nThe Suhrawardy family just like the Tagore family attained prominence during this period mostly because of their unusual social positioning between the Indians and the European influences. Both the families dominated the fields of arts, education, public service and politics of that period.\nBranches of the Suhrawardy family\nMedinipur branch\nUbaidullah Al Ubaidi Suhrawardy: born in Medinipur, which once used to be the nucleus of the Suhrawardy family. Ubaidullah was a learned scholar, educationist, writer and social reformer. He is said to have paved the base on which the modern Suhrawardy family stood. In 1857, in the wake of Sepoy Mutiny he passed the Final Central Examinations from Calcutta Madrasa. In 1874, he was appointed as the first superintendent of Dhaka Madrasah. Ubaidullah is the writer of the famous Persian books Lubul Arab (Arabic grammar), Urdu Diwan\" (Urdu poems, 1880), \"Farsi Dewan\" (Persian poems, 1886), \"Dastar-e-Parsi Amuz\" (Persian grammar), including a number of manuscripts on women's education, psychology and philosophy. The British government later awarded him with the title of \"Bahr ul Ulm\" (meaning sea of knowledge).\nAbdullah Al-Mamun Suhrawardy\nAbdullah was the eldest son of Ubaidullah Al Ubaidi Suhrawardy. He graduated in 1898 in Arabic, English and Philosophy obtaining a first class in his special subjects and standing the first of his year both in the B.A. and M.A. examinations of Calcutta University. He also earned a PhD degree from Calcutta University in 1908 and became the first person to do so in Bengal. He later did another masters from London University. He founded the Pan Islamic Society of London. On his return to Calcutta, he was elected to the Bengal legislative council. Abdullah was also selected as a member of the Reforms Franchise Committee under Montague-Chelmsford reforms. He served as the deputy President of the Bengal Legislature from 1923 to 1926. He was then elected to Indian Legislative Assembly. As a member of the central legislative assembly, to the central committee which in 1929 collaborated with Simon commission, he sympathized with the Odias and his report on Odia speaking population in Bengal, which he prepared on the behalf of Simon Commission, amplified the demands of the Odias and later paved the way for the creation of a separate odia speaking province, Odisha. Abdullah married Sahibzadi Ahmedi Begum the daughter of Sahibzada Mohammad Mirza Ali Nakey. Suhrawardy was a close friend of Leo Tolstoj. He was later knighted in 1931. For his profound learning and vast knowledge, the Ottoman Turkish Sultan decorated him with the medal of 'Tamgha-e-Majidi', whereas, the Shah of Iran awarded him with the title of 'Iftekhar-ul-Millat' (meaning: pride of the Muslim nation).\nKhujista Akhtar Banu: Khujista was the eldest daughter of Ubaidullah Al Ubaidi Suhrawardy. She was a writer, scholar, and social worker. Khujista was home schooled as a child. She learnt Persian, Urdu, Arabic and English from her father. In 1887, she became the first Indian woman to have passed the Senior Cambridge examinations. Khujista was also the first woman to be appointed as an examiner by the Calcutta University. As a writer, she wrote the famous book \"Aaina e Ibrat\", which was approved by Calcutta University and was incorporated in the syllabus for all its affiliated colleges. She founded the Suhrawardia Girls High school in 1909, which was inaugurated by Lady Minto. Khujista undertook various social work campaigns, she personally visited the slums to educate the marginalized communities about health and sanitation during the wake of Influenza and Cholera. She married her first cousin, Zahid Suhrawardy.\nKaisar i Hind Hassan Suhrawardy: Hassan was the younger son of Ubaidullah Al Ubaidi Suhrawardy. Hassan served as the lieutenant Colonel in the British Indian Army. He was also a politician, public official and also the first Muslim Vice Chancellor of Calcutta University (1930-1934). He was the second Muslim from the undivided India to become a fellow of the Royal College of Surgeons of England. Suhrawardy later served as an advisor to the Simon Commission and was a member of the Bengal Legislative Council of which he was Deputy President from 1923 to 1925. As the Chief Medical and Health Officer of the East Indian Railway, he founded the railway's ambulance and nursing division. Hassan was also the founder of the East London Mosque. Hassan also served as the advisor to the Secretary of State for India from 1939 to 1944. Hassan was appointed an OBE in the 1927 Birthday Honours list and was awarded the Kaiser-i-Hind Medal, First Class in the same honours list in 1930, knighted on 17 February 1932 and appointed an Associate Officer of the Venerable Order of St. John (OStJ) in January 1932 and was promoted to the rank of Associate Commander in January 1937. He later renounced his all his British honours. The \"Suhrawardy Avenue\" in Calcutta was named after him in April 1933.\nHassan was married to Sahibzadi Shahbanu Begum, the daughter of Nawab Syed Mohammad Azad of Dhaka and the granddaughter of Nawab Abdul Latif. Their children were Hassan Masud Suhrawardy and Shaista Suhrawardy Ikramullah.\nFamily of Hassan Suhrawardy\nShaista Suhrawardy Ikramullah: Shaista was the daughter of Hassan Suhrawardy. She graduated from Loreto College, Kolkata. Shaista was also the first Muslim woman to earn a PhD degree from the prestigious London University. In 1933, she was married to Mohammed Ikramullah, who was the secretary and advisor at the Ministries of Commerce, Information and Broadcasting, Commonwealth Relations and Foreign Affairs. She wrote for Tehzeeb-e-Niswan and Ismat, both Urdu women's magazines, and later wrote for English-language newspapers. In 1950 her collection of short stories called Koshish-e-Natamaam, was published. Her autobiography, From Purdah to Parliament (1963), is her best-known writing which she translated into Urdu to make it more accessible. After Partition, she was elected to the Constituent Assembly of India in 1946, but never took the seat because of the immense pressure that the Muslim league leaders exerted on her. However, after Partition, she became one of two female representatives at the first Constituent Assembly of Pakistan in 1947. She was also a delegate to the United Nations, and worked on the Universal Declaration of Human Rights (1948) and the Convention Against Genocide (1951). She was Pakistan's Ambassador to Morocco from 1964 to 1967.\nMohammed Ikramullah: Ikramullah was the son in law of Hassan Suhrawardy and the husband of Shaista Suhrawardy. Ikramullah's brother Mohammed Hidayatullah was the Chief Justice of India from 1968 to 1970 and the Vice President of India from 1979 to 1984. Ikramullah had joined the Indian Civil Service in 1934. Later, Ikramullah served as the Advisor to the preparatory commissions of the United Nations in London and San Francisco, and at its first general assembly, between 1945 and 1946. He was appointed a CIE (Companion of the Order of the Indian Empire) in the 1946 New Year Honours. He moved to Pakistan following the partition of India, where he was appointed as the foreign secretary of Pakistan. Ikramullah played key roles in establishing the Commonwealth Economic Committee and had been nominated as Secretary-General of the Commonwealth at the time of his death in 1963.\nPrincess Sarvath Al Hassan: Sarvath is the youngest daughter of Shaista Suhrawardy and Mohammed Ikramullah. She lived in all the countries that her parents were posted to, but mostly received her education in Britain, and received her bachelor's degree from the University of Cambridge. She first met Prince Hassan in London in 1958, when they were both eleven years old. Sarvath married Prince Hassan bin Talal of Jordan on 28 August 1968. Princess Sarvath served as Crown Princess of Jordan for over 30 years. She initiated, sponsored and continues to support many projects and activities in Jordan, mainly in the field of education, in addition to issues pertaining to women and the family, social welfare and health. Much of her work focuses on promoting education about various topics (both locally and internationally), assisting disadvantaged women, encouraging community service and helping people with mental and learning disabilities. Princess Sarvath and her husband continue to represent Jordan at international royal events, such as the wedding of Victoria, Crown Princess of Sweden, and the coronation of King Willem-Alexander of the Netherlands. In 2013, she rode in the carriage of Queen Elizabeth II at Ascot Racecourse.\nSalma Sobhan: Also known as Rashida Akhtar Banu. She was the daughter of Shaista Suhrawardy and a Bangladeshi lawyer and human rights activist. In 2001, she was elected to the Board of the United Nations Research Institute For Social Development (UNRISD). She married Rehman Sobhan, an economist and a freedom fighter. The Protichi Foundation started by Amartya Sen has instituted an award for journalists in Salma's name.\nNaz Ikramullah: Naz the daughter of Shaista Suhrawardy. She is a film producer. Naz designed and wrote a filmstrip for the NFB film Making Faces, which won the First Prize for Art Education in Oakland, California in 1989. She also completed a film regarding the cultural life of Muslim women of the Indian Subcontinent. She teaches painting and printmaking at the Ottawa School of Art.\nFamily of Amin Suhrawardy\nAmin Suhrawardy: Amin was the youngest son of Ubaidullah Al Ubaidi Suhrawardy from his second wife. He was a professor of law at University of Calcutta, he later became a sub judge of Calcutta High court. Besides his legal background, Amin was also a very renowned sorcerer. Amin and Ganapati Chakraborty were the only two prominent magicians at that time in Bengal. Amin was also one of the mentors of P.C Sorcar.\nBegum Badar un nissa Akhtar: Badrun nissa was the only daughter of Amin Suhrawardy and hence the only surviving grandchild of Ubaidullah Al Ubaidi Suhrawardy and his second wife. Badrun nissa was married into the Diwan family of Dhenkanal state in Cuttack, to Sayeed Mohammed, an educationist, philanthropist and a scholar. Sayeed's father Atharuddin Mohammed was the feudal lord of Madhi, the Diwan of the princely state of Dhenkanal and one of early members of Utkal Sabha (the organisation which fought for the unification of Odia speaking provinces). However, after, Sayeed's untimely death in 1922, Badrun nissa was debarred from the family title and property as per the Mehroom al Mariaz tradition of Islamic Shariat. Hence Badrun nissa gave her children, her father's (Amin Suhrawardy's) name and thus the family assumed its surname \"Amin\". Badrun nissa like many of her female forebears, worked for the upliftment of the community with a special focus on female education. She later joined as a teacher in Ravenshaw Girls High school, becoming the first muslim woman in Odisha to do so. In March 1921, when Mahatma Gandhi visited Odisha for the first time, she greeted him at Vinod Bihari, where Gandhiji addressed the women of Cuttack city.\nThe family however sided with Congress, carrying forward the legacy of their paternal primogenitors. The most prominent among whom was Afzal ul Amin, who served as the general secretary of Utkal Pradesh Congress Committee and was a politician and statesman of the Congress party. Since the family, over generations had put efforts to create a separate Odisha province, they remained emotionally attached to their motherland and hence became one of the few branches of the Suhrawardy family who chose not to migrate to Pakistan, following the partition of India in 1947.\nAfzal ul Amin: was the youngest son of Badarun nissa and a renowned politician who won the municipal elections continuously from 1952 to 1980. He later served as the Chairman of Municipal corporation. Amin carried forward his father's legacy and participated in the Indian freedom struggle. He mobilized the Indian masses during the Quit India movement of 1942, after Bibhunenda Mishra and Surajmal Shah were arrested. Amin amplified and made significant contributions to the Bhudan movement in Odisha. He worked as the chairman in many emergency committees formed to help the people in the flood affected areas, during the floods in Cuttack.\nHe contested in the Odisha Legislative Assembly elections from Cuttack in 1971 and was later appointed as the general secretary of Utkal Pradesh Congress Committee. As the chairman of Cuttack Municipal corporation's committee on education, he established more than 10 lower and upper primary Urdu schools in the city.\nAfzal ul married his second cousin, Syeda Roshanara Amin (), the younger daughter of Ibrahim Suhrawardy. He has two daughters; the eldest, Tabasum Sultana, married the notable writer and politician, Hussain Rabi Gandhi.\nFarhat Amin: is the youngest daughter of Afzal-ul Amin. She is a journalist and a social activist, who pioneered the Muslim women movement in Odisha. Farhat is the founder and chief functionary of BIRD Trust, a non-governmental organisation which works for the upliftment of marginalized women in Odisha and the also the state convenor of Bharatiya Muslim Mahila Andolan. She was enlisted in the directory of development journalists published by the Press Institute of India. As a social activist, she undertook active steps to eradicate the menace of Hepatitis B among children in Odisha, for which she was felicitated by the Governor of Odisha in 2008. Farhat married the tribal rights activist, Saleem Farook.\nFamily of Mobarak Ali Suhrawardy\nMobarak Ali Suhrawardy : was a brother of Ubaidullah Al Ubaidi Suhrawardy. He was a reputed lawyer and an aristocrat.\nZahid Suhrawardy (1870 - 1949): was the son of Mobarak Ali Suhrawardy, he was born in Midnapore and educated at Dacca. He began his legal career after obtaining a degree in law from Calcutta University. He later qualified for the bar from the Lincoln's Inn as a barrister-at-law, before returning to India. Zahid practiced at the Calcutta High Court and was soon promoted as a judge at the same court. He resigned from service ten years later, in November 1931 and was knighted in 1928. In 1888, Zahid married Khujista Akhtar Banu (c.1874–1919), the daughter of educationist Ubaidullah Al Ubaidi Suhrawardy, Zahid's uncle. Their children included linguist Hasan Shaheed Suhrawardy (1890–1965) and Prime Minister of Pakistan, Huseyn Shaheed Suhrawardy (1892–1963).\nHasan Shaheed Suhrawardy (1890 - 1965): Hassan was the eldest son of Zahid Suhrawardy and a famous writer, poet, translator and a diplomat. Hasan graduated in English from Calcutta University in 1909 following which he went to England where he graduated from Oxford University in law. In Oxford, he became close friends with Robert Bridges and D. H. Lawrence. He later served as a professor of English at Moscow University and was caught in the Russian revolution (1917). He later came to Paris on a tour and stayed there. In Paris, he served as the editor of the Fine Art Section of the League of Nations. Hassan finally returned to India in 1932 after which he worked as a researcher and writer for many works commissioned by Osmania University, Visva-Bharati University. Suhrawardy was also member of the Bengal Public Service Commission during 1943–46. After the Partition of India, Suhrawardy like the rest of his family, migrated to Pakistan, he served as a diplomat.\nHe was an ambassador of Pakistan to Spain, Morocco, Tunisia and the Vatican from 1954 onwards. He became very close to Jawaharlal Nehru and Sudhindranath Dutta. He was proficient in many languages including Russian, Cantonese, Aramaic, Greek, Italian, Spanish and French languages.\nHuseyn Shaheed Suhrawardy: was the youngest son of Zahid Suhrawardy. Huseyn was a lawyer and an excellent politician. He is regarded as one of the most intellectual and powerful statesman of the Indian subcontinent and also the mentor of Bangladesh's founding father Sheikh Mujibur Rahman. He was the Prime Minister of Bengal from 1946 to 1947 and the Prime Minister of Pakistan from 1956 to 1957. His political career started as early as in his youth days, when he returned to India after studying law at Oxford University and joined the Indian Independence movement as a trade union leader in Calcutta. He was elected to Bengal Legislative Assembly in 1937. In 1946, Suhrawardy led the Bengal Provincial Muslim League to win the general elections and thus became the third and last Prime Minister of Bengal. He proposed a United Bengal, also known as the Free State of Bengal. Huseyn is however criticized and held responsible for the Great Calcutta Killings. He migrated to Pakistan with the rest of his family, where he emerged as supreme leader of the Awami league. In 1956, he was elected the Prime Minister of Pakistan. He led Pakistan's diplomacy in SEATO and CENTO, thus strengthening Pakistan's ties with the United States. He was also the leader of Pakistan's Republican constituent Assembly, which ended dominion status and the monarchy of Queen Elizabeth II in Pakistan.\nHe is the father of Rashid Suhrawardy and Begum Akhtar Sulaiman\nFamily legacy\nThe remarkable legacy of the Suhrawardy family can be found across the entire Indian subcontinent and the world.\nEvery year, on 31 July, Iran observes National Suhrawardi Day to commemorate the life of Shahab al-Din Yahya ibn Habash Suhrawardi.\nBahauddin Zakaria Express train is named after Bahauddin Zakaria Suhrawardi which runs between Karachi and Multan. Bahauddin Zakariya University located in Multan too is named after him, it is the largest institution in Southern Punjab.\nShah Rukan e Alam, named after the saint, is one of the autonomous towns of the city of Multan. A daily train service, Shah Rukn-e-Alam Express, between Multan and Karachi was named after him.\nThe Tomb of Umar Al Suhrawardi in Baghdad, Turkman gate in Delhi, Maner Sharif in Bihar, Tomb of Rukn e Alam Suhrawardi and Shrine of Bahauddin Zakariya are important tourist attractions.\nThe University of Dhaka awards the Bahrul Ulm Ubaidi Suhrawardy medal, which was named after Ubaidullah Al Ubaidi Suhrawardy. Acharya Harinath De created an oil painting to honour Ubaidullah. While, the Suhrawardy Avenue in Kolkata is named after Hassan Suhrawardy.\nSuhrawardy Udyan in Dhaka, Bangladesh is named after Huseyn Shaheed Suhrawardy. The Government Shaheed Suhrawardy College and Shaheed Suhrawardy Medical College and hospital too are named after him.\nFamily tree\n]]\n]]\n]]\n]]\n* Shah Sirajuddin Suhrawardy\n** Shah Ruknuddin Suhrawardy\n*** Shah Najibudin Suhrawardy\n*** Shah Aminuddin Suhrawardy\n**** Ruhul Amin Suhrawardy\n**** Ubaidullah Al Ubaidi Suhrawardy\n***** Khujista Akhtar Banu, m. Zahid Suhrawardy\n****** Huseyn Shaheed Suhrawardy, firstly married Begum Niaz Fatima, daughter of Chief Justice Abdur Rahim\n******* Begum Akhtar Sulaiman\n******** Shahida Jamil\n********* Shahid Jamil\n******* Robert Ashby\n****** Hasan Shaheed Suhrawardy\n***** Hassan Suhrawardy\n****** Shaista Suhrawardy Ikramullah, m. Mohammed Ikramullah\n******* Princess Sarvath al-Hassan, m. Prince Hassan bin Talal\n******** Princess Rahma bint Hassan, m. Alaa Batayneh\n********* Arif Al Batayneh\n******** Princess Badiya bint Hassan\n******** Prince Rashid bin Hassan, m. Zeina Shaban\n********* Hassan bin Rashid\n********* Talal bin Rashid\n******** Princess Sumaya bint Hassan\n******* Salma Sobhan, m. Rehman Sobhan\n******** Zafar Sobhan\n******* Naz Ikramullah\n******* Imam Ikramullah\n****** Hasan Masud Suhrawardy\n***** Amin Suhrawardy\n****** Begum Badar un nissa Akhtar, m. Sayeed Mohammed\n******* Afzal-ul Amin, m. daughter of Ibrahim Suhrawardy\n******** Farhat Amin Sultana, m. Saleem Farook\n********* Rayan Farook\n******** Tabasum Amin Sultana, m. Hussain Rabi Gandhi\n******* Fazal ul Amin\n******** Siddiq Al Amin\n******** Sayeeda Sultana\n******* Ather ul Amin\n******** Daud ur Rahman\n******** Razia Sultan\n******** Farida Sultana, m. S M Patnaik\n********* Farha Suroor Patnaikk\n********* Eshaa Suroor Patnaikk\n******** Niloufar Sultana\n******** Yasmeen Sultana\n******* Shamsunahar Akhtar\n******** Shahbuddin Mohammed Gani\n******** Badruddin Mohammed Faruque\n******* Begum Husnara Akhtar\n***** Abdullah Al-Mamun Suhrawardy\n***** Habib ur Rahman Suhrawardy\n***** Aziza Akhtar Banu\n***** Humayun Akhtar Banu\n**** Mubarak Ali Suhrawardy\n***** Zahid Suhrawardy, m. Khujista Akhtar Banu\n****** Huseyn Shaheed Suhrawardy, m. Vera Alexandrovna Tiscenko Calder\n******* Rashid Suhrawardy\n****** Hasan Shaheed Suhrawardy\n***** Mahdi Hasan Suhrawardy\n**** Abdul Ali Suhrawardy\n**** Umme Kulsum\n***** Dastur Ali\n** Aleemuddin Suhrawardy\n*** Atiqur Suhrawardy\n***Abida Akhtar Banu\n****Syed Shaminuddin Ahmed m. Syeda Zameerunnissa Begum\n*****Syed Shamsuddin Ahmed\n*****Syeda Munerunissa Akhtar\n******Ibrahim Suhrawardy\n*** Qutubuddin Suhrawardy\nReferences"
    }
  ]
}