{
  "content": [
    {
      "type": "text",
      "text": "# Suleiman Abdu Kwari\n\n|birth_place  = Zaria Kaduna State, Nigeria\n|death_date   =\n|party        = All Progressives Congress (APC)\n|nationality  = Nigerian\n}}\nSuleiman Abdu Kwari is a Nigerian politician and public finance management expert, senator for the Kaduna North Senatorial District of Kaduna State Nigeria. He was elected during the February 2019 Nigeria general elections under the platform of the All Progressives Congress (APC). He was the commissioner of Finance Kaduna State (2015-2019) appointed by the Governor of Kaduna State Nasir El-Rufai and was also a member of the House of Representatives for Sabon Gari Local Government constituency of Kaduna State.\nBackground\nKwari was born on the 12 June 1962 in Sabon Gari Local Government Area of Kaduna state. He started his education at Army Primary School. Zaria and thereafter proceeded to the highly prestigious Commonwealth College of Commerce Jos, Plateau State from 1975 to 1980 for his secondary education. He obtained a bachelor of Science Degree in Business Administration from Ahmadu Bello University, Zaria in 1984 and also successfully completed his master's degree programme in Business Administration at same university in 1988.\nEarly political career\nKwari's passion for his people motivated him to contest election in 1991. As a sabon Gari local government chairman which saw him emerge as the first executive chairman of Sabon Gari Local Government Area . After completion of his tenure, he was appointed assistant general manager (Administration) at the Nigerian Reinsurance Cooperation between 1995 and 2000. He was elected as member of Federal House of Representatives Sabon Gari's federal constituency in the 4th assembly. He was appointed as the Deputy chief of staff to the Kaduna State Governor in 2003. He also serve as a federal commissioner (Finance and Administration) in security and exchange commission. He serve as commissioner of finance, Kaduna State from 2015 to 2019. He contest and won the 2019 general election as a senator representing Kaduna North senatorial district.\nSenate\nSulaiman Abdu Kwari represent the people of kaduna North in the ninth Senate of national assembly in the platform of All Progressives Congress, APC. He is the chairman of senate committee on anti-corruption and financial crimes. Sulaiman Abdu kKwari has sponsored and co- sponsored several motions and Bill's which included.\nBills\n* ''Legislative Bill's Cooperate Social Responsibility Bill\n* Federal College of Crop Science and Technology Lere Kaduna State\n* Witness Protection and Management\n* Money Laundering Prevention and Prohibition Enactment Bill\n* Public Interest Disclosure and Complaints Enactment Bill\n* Code of Conduct\n* Anti-Corruption Tribunal Act Amendment Bill\n* Armed Forces (joint security operation and synergy, etc) bill\n* Tertiary Education Reform Bill\n* Terrorism Prevention and Prohibition Act Forfeited\n* Asset Management Authority (Enactment) Bill (SB.643)\n* Constitution Alteration Bill\n* Constitution Alteration Bill (SB.699)\n* Constitution Alteration Bill ( SB.704)\n* Code of Conduct and Anti-Corruption tribunal Act ( Amendment) Bill (SB.727)\nMotions\n* Need to address the increasing rate of traffic accidents along Abuja-Kaduna-Zaria-Kano Road\n* Need to critically assess the performance of economic and growth plan (ERGP) 2017 to 2020\n* Need to make the National Health Insurance Scheme (NHIS) work for Nigeria citizens\n* Ijegun pipelines explosion urgent need to prevent pipelines vandalization and explosion resulting to deaths and massive destruction of properties\n* Major military offensive against bandits in Katsina State. Need to integrate adjoining state of Niger, Zamfara, Kaduna, Kebbi and Sokoto''\nConstituency Projects\nKwari has constituency projects spread across all the eight local government Areas in his senatorial district (Kaduna North) As a senator, he is always struggling for the development of his people and the nation's since he assumed office. Kwari alone has facilitated more than 60 intervention projects across his senatorial district. These projects includes, construction of classrooms, model primary Health care centers, electrification of rural areas and construction of motorized boreholes were delivered to the residents of selected communities based on their need. Kwari also created job opportunities for the youths of his Constitution.\nAwards and honours\n* Chartered Institute of Administration, Professional Practicomg License.\n* Fellow, Chartered Institute of Administration (FCIA).\n* Fellow, Institute of Chartered Economists of Nigeria (FICEN).\n* Member, Nigeria Institute of Management (MNIM).\nReferences\nNotes"
    }
  ]
}