{
  "content": [
    {
      "type": "text",
      "text": "# Sulitza (Hasidic dynasty)\n\nSulitza (, also spelled Sulitz, Solitza or Solitz) is a Hasidic dynasty originating in Sulitza (Sulița), Romania. The present Rebbe of Sulitza is Rabbi Yaakov Yisroel VeYeshurin Rubin. His synagogue is in Far Rockaway, Queens, NY.\nHistory\nSulitza is one of many offshoots of the Ropshitz Hasidic dynasty that were re-established in New York City and Brooklyn after World War II by surviving descendants of Grand Rabbi Naftali Tzvi Horowitz, the first Ropshitzer Rebbe; others include Beitsh, Dolina, Dombrov, Dzhikov, Melitz, Sasregen, Shotz, Strizhov, Stutchin, and Tseshenov.\nThe previous Sulitzer Rebbe died on June 18, 2013, and was the son of Rabbi Jacob Israel Jeshurun Rubin (1885–1944),\nav beis din (head of the rabbinical court) of Sulitza and Sasregen, Romania,\nwho was murdered in the Auschwitz concentration camp,\nand Alte Nechama Malka Dachner, daughter of Rabbi Chaim Dachner of Seret, who was also murdered in the Holocaust. He was the son-in-law of Grand Rabbi Yissachar Ber Rosenbaum of Stroznitz (died 1980). His brothers were the Sasregener Rebbe of Midwood, Brooklyn (d. 2020), and the Muzhayer Rebbe (d. 2008) of Midwood, Brooklyn.\nDynasty\n* Grand Rabbi Naftali Tzvi Horowitz of Ropshitz (1760–1827), author of Zera Kodesh.\n** Grand Rabbi Asher Yeshaya Rubin of Ropshitz (d. 1845), son-in-law of Rebbe Naftali Tzvi, known as ''Reb Osher'l. Author of אור ישע [Or yeshaʻ].\n*** Grand Rabbi Menachem Mendel Rubin of Glogov (Głogów Małopolski) (c. 1806&nbsp;–&nbsp;1873), son of Rebbe Asher Yeshaya.\n**** Grand Rabbi Meir Rubin of Glogov (1829–1897), son of Rebbe Menachem Mendel.\n***** Grand Rabbi Baruch Rubin of Brezdovitz (Berezdivtsi, Lviv Oblast, Ukraine) and Gherla (1864–1935), son of Rebbe Meir. Author of שארית ברוך She'erit Barukh (Jerusalem, 1973).\n****** Grand Rabbi Yaakov Yisrael veYeshurun Rubin of Sulitza (Sulița) and Sasregen (Reghin) (1884–1944), son of Rebbe Baruch. Rabbi of Sulitza and rebbe in Sasregen. He was murdered in the Holocaust.\n******* Grand Rabbi Shmuel Shmelka Rubin of Sulitz (c. 1925-2013), Sulitzer Rebbe, son of Rebbe Yaakov Yisrael veYeshurun and son-in-law of Rebbe Yissachar Ber Rosenbaum of Stroznitz. Rabbi of the Sulitza congregation of Far Rockaway, Queens, New York.\n******** Grand Rabbi Yaakov Yisroel VeYeshurun Rubin, son of Rebbe Shmuel Shmelka Rubin and son-in-law of the Kerestirer Rebbe, Sulitzer Rebbe in Far Rockaway, NY\nNotes\nReferences\n*\n* This edition includes:\n** לקוטי מהרמ\"ם Liḳuṭe Maharmam by his son Rebbe Menachem Mendel of Glogiv (in Or yeshaʻ)\n** לקוטי מהר\"ם Liḳuṭe Maharam by his son Rebbe Meir of Glogiv (in Or yeshaʻ)\n** Facsimiles (including annotated transcriptions) of manuscripts by and about members of the Ropshitz dynasty, particularly ancestors of the Brizdovitz dynasty\n** שארית ברוך Sheʼerit Barukh by his son Rebbe Baruch of Brezdovitz\n** גליוני יוש\"ר Gilyone yosher, by his son Rebbe Yaakov Yisrael veYeshurun of Sulitza\n** זרע קודש מצבתה Zeraʻ ḳodesh matsavtah'', a genealogical treatise by his son Rabbi Asher Yeshaya (who was murdered in the Holocaust).\n*"
    }
  ]
}