{
  "content": [
    {
      "type": "text",
      "text": "# Summergangs, Kingston upon Hull\n\nSummergangs (archaic Somergang) is a suburb of Kingston upon Hull, near the A165 road, in the East Riding of Yorkshire, England. The area contains the model village development known as The Garden Village and East Park.\nHistory\n'Somergang' is referred to in the early 14th century as common pasture land, and to a cross in Somergang during the same period, also as a pasture called ''Suttecotes Som'gang (or Suttecotessomergang'').\nThe drainage canal known as the 'Somergangs Dike' originates to a 13th-century ditch created by Saer de Sutton, this ditch formed the boundary with Sutton to the north.\nThe name may derive from the indo-European word \"gang/geng\" meaning a road or way plus \"summer\", referring to a road which was only usable in summer, or from \"South\" + \"Mer\" (Mere). The etymologies refer to the wetness of the (low lying) land and to the use of the land during the (drier) summer months.\nThe fields in Summergangs were enclosed in 1748, a large residence with grounds was constructed soon after on the north side of the road, this was later called Holderness House after rebuilding in the 1830s. Apart from this the Summergangs area remained unused for housing until the 1850s.\nBy 1855 there were several windmills, a brickworks, as well as the Crown Inn at Mile House; all on the Holderness Road, as well as Holderness House, and the nearby Summergangs Cottages. East Park was opened in 1887, and expanded north-eastward in the next half century to occupy much of Summergangs north of Holderness Road and Holderness House; by the 1890s housing had begun to spread north-eastwards along Holderness Road from Drypool and The Groves as far as Holderness Road, and urbanisation had started to spread into the formerly rural area; along Durham and Jalland Street north-westwards, as well as eastwards along Southcoates Lane towards Southcoates.\nIn 1908 The Garden Village housing development opened, eventually taking up much of the land south-west of Holderness House and north of Holderness Road. All of the Summergangs area was converted into suburban or urban parkland from 1900 to the 1940s. Since the 1940s the pattern of land usage has remained the same up to 2010.\nHolderness House\nAfter the enclosure of Summergangs in 1748 a part owned by William Constable on the north side of the Hull to Hedon road (Holderness Road) was built upon, this dwelling was named Summergangs Hall, and modernised in 1800.\nIn 1838 the land was sold to Boswell Middleton Jalland who demolished the old house and built Holderness House. The building is now a grade II listed building, and functions as a residential home for Ladies.\nSee also\n*East Park, Kingston upon Hull and The Garden Village, Kingston upon Hull – occupying the majority of the Summergangs area\n*J. Arthur Rank (1888–1972), of the Rank Organisation, was born at 4, Chestnut Villas (371 Holderness Road)\n*List of areas in Kingston upon Hull\nReferences\n*Philip's Street Atlas East Yorkshire (page 141)\nSources\n*\n*\n*\n*\nMaps\nFurther information\n*\nExternal links"
    }
  ]
}