{
  "content": [
    {
      "type": "text",
      "text": "# Sumner Howard\n\n| birth_place = Brockport, New York, U.S.\n| death_date =\n| death_place = Flint, Michigan, U.S.\n| nationality =\n| spouse =\n| party = Republican\n| relations =\n| children =\n| residence =\n| alma_mater =\n| occupation =\n| religion =\n| signature =\n| website =\n| footnotes =\n}}\nSumner Howard (May 7, 1835–September 6, 1890) was an American jurist and politician who served as Chief Justice on the Arizona Territorial Supreme Court, Speaker of the Michigan House of Representatives, and Mayor of Prescott, Arizona Territory.\nBiography\nHoward was born on May 7, 1835, to Waldo and Mary Howard in Brockport, New York.}}}} In the year following his birth, his family moved to Flint, Michigan. He was educated in public schools. At age fifteen, Howard began working in local newspaper offices; first at the Genesee Democrat and later the Wolverine Citizen. When he was 19, Howard began reading law at a local law office. Soon after, he enrolled at the State and National Law School in Poughkeepsie, New York, and graduated in either 1855 or 1856.\nFollowing graduation, Howard returned to Michigan and became a defense attorney. His first big case was the acquittal by reason of insanity of Joshua Solomon Johnson, who was accused of killing a father and his two sons. As a result of his courtroom performance, Howard gained a reputation as one of the state's best trial lawyers of his day. Howard married Lucy R. Mason in 1857. The union produced a daughter, May, and an adopted son, Frank.\nRunning on the Democratic ticket, Howard was elected Genesee County prosecutor in 1858. With the outbreak of the American Civil War, Howard volunteered for the infantry and was commissioned a second lieutenant in July 1861. For the majority of the war, he was assigned recruiting duties. Howard was scheduled to become captain of a 100-man company that he had raised shortly before the Battle of Gettysburg, but an illness prevented him from assuming command. Howard resigned from military in September 1863 and returned to Flint, Michigan.\nHoward ran for Genesee County prosecutor on the Republican ticket in 1864. He was re-elected and served three consecutive terms. Howard represented Flint's third ward on the city council from 1866 till 1870. He served as a delegate to Michigan's 1867 constitutional convention and advocated for prohibition during the proceedings.\nOn March 30, 1876, President Ulysses S. Grant nominated Howard to become United States Attorney for Utah Territory. In this role, Howard was the prosecutor of John Doyle Lee for his involvement in the Mountain Meadows massacre. Following Lee's prosecution, Howard planned prosecutions of other Mormon leaders, including Brigham Young. After Young died, Howard felt his task in Utah was completed and submitted his resignation at the beginning of 1878. He then returned to Michigan and private legal practice.\nHoward was a delegate to 1880 Republican National Convention. Two years later he was elected to the Michigan House of Representatives. In the legislature, Howard was selected as Speaker of the House and was influential in the election of Thomas W. Palmer over Thomas W. Ferry for a seat in the United States Senate. He was selected as a delegate for the 1884 Republican National Convention, but did not attend.\nPresident Chester A. Arthur nominated Howard to become Chief Justice of the Arizona Territorial Supreme Court on March 18, 1884. He had requested an appointment in Utah but was instead sent to Arizona. The new Chief Justice was commissioned on March 26 and took the oath of office in Prescott on May 20, 1884. Howard was assigned to the third judicial district, encompassing Apache, Mohave, and Yavapai counties (an area that includes the modern day Coconino and Navajo counties). Three appellate rulings authored by Howard are in the Arizona Reports. In Tidball v. Williams, 2 Arizona 50 (1885), Howard found that United States Commissioners have jurisdiction outside their district of residence even if they rarely use it and that a Marshal may serve an arrest warrant which uses a fictitious name.  In The Copper Queen Mining Company v. The Arizona Prince Copper Company, 2 Arizona (1885), the parties to the dispute had arranged for the Cochise County sheriff to have the jury members \"feasted and wined\" during the original trial.  During the appeal, Howard found there were no grounds to overturn the original ruling as no evidence that any juror was too intoxicated to perform his function had been presented.  Howard's findings in Paul v. Callum, 2 Arizona 16 (1885) were later upheld by the U.S. Supreme Court.\nWith President Grover Cleveland having come into office, Howard sensed he was about to be removed and submitted his resignation in October 1885 to ease the appointment of John C. Shields to the Arizona bench. His final day in court was November 9, 1885, the day Shields was sworn in. Shields' nomination was later rejected by the United States Senate. Upon returning to private life, he formed a law partnership with John A. Rush and Edmund W. Wells. Howard continued to practice law by himself after the partnership dissolved in 1887.\nHoward was elected Mayor of Prescott on January 4, 1887, after running without opposition. The next year he represented Arizona Territory as a delegate to the 1888 Republican National Convention. In June 1889, Howard sent a letter to U.S. Attorney General William H. H. Miller requesting reappointment to the Arizona bench. Despite any supporting evidence corroborating the claim, the letter bears a hand-written note saying \"Drinks too much\".\nIn his later years, Howard returned to Flint, Michigan. There he developed an interest in agriculture, serving on the county fair board and operating a small farm in Burton. His wife donated the land for Flint's first African-American church. Howard died on September 6, 1890. Initially buried in a family plot but them moved to Flint's Glenwood Cemetery.\nThe land on which Howard's Flint mansion was built was used for a public housing project in 1968 named \"Howard Estates\".\nSee also\n* List of mayors of Prescott, Arizona\nNotes\nReferences\n*\n*\n*\nExternal links\n*"
    }
  ]
}