{
  "content": [
    {
      "type": "text",
      "text": "# Sun Deng (Xin dynasty)\n\nSun Deng () was briefly appointed puppet emperor by a coalition of Chimei \"Red Eyebrows\" rebels in December of 26 CE, but later that month was killed by his general Yue Xuan  when the rebels surrendered to the superior forces of Emperor Guangwu of Han (r. 25–57).\nAfter the Chimei and Lülin \"Green Forest\" agrarian rebellion movements collectively brought down Wang Mang's short Xin dynasty (9-23 CE), the Chimei forces allowed the Lülin leader Liu Xuan to become Gengshi Emperor (r. 23–25) and restore the dynasty. The Chimei rebels subsequently destroyed Gengshi's army and assassinated him, in order to establish their own puppet emperor Liu Penzi (r. 25–27) who was nominally enthroned in the capital Chang'an, until he surrendered after Emperor Guangwu's generals Deng Yu and Feng Yi defeated the remaining Chimei rebels. While both Sun Deng and Liu Penzi were Chimei-supported pretenders to the Han throne, \"Emperor\" Penzi is better known than Sun Deng.\nThe (5th century) Hou Hanshu \"Book of the Later Han\", which covers Han dynasty history from 6 to 189 CE, is the primary historical source about Sun Deng.\nFirst, the \"Annals of Emperor Guangwu\" records that in December of 26, a confederation of Tongma  \"Bronze Horses\", Qingdu  \"Green/Black Calves\", Youlai , and other rebel groups in the Shang Commandery  (roughly modern Sanmenxia, Henan) established Sun Deng as their puppet emperor. The Bronze Horses and Green Calves originated as followers of Mother Lü (d. 18), the first female leader of rebels in Chinese history.\nThe Bronze Horses, the Green Calves, the Yu-lai and the remaining bandits in the Shang Commandery together set up Sun Teng as the Son of Heaven. Sun Teng’s General, Yo Hsüan killed Sun Teng, and surrendered with his band of more than 50,000 men. [].\nOn February 27, Emperor Guangwu's generals Deng Yu and Feng Yi defeated the remaining Chimei, who \"surrendered with more than a hundred thousand men\" at Yiyang  (modern Luoyang).\nSecond, the Hou Hanshu biography of the scholar Di Pu  mentions Sun Deng. When Di Pu was restoring lost books in the imperial library, he told his colleague Sun Yi  about a book that said the rebel Sun Deng used his brilliance to harm Han court eunuchs []. The Hou Hanshu commentary identifies it as the apocryphal Confucian text Chunqiu baoqqian tu , which says, \"The anti-Han rebel leader Sun Deng was a big, tall man who employed ingenious methods and many techniques, although without a classical education, he was a sage who said little\" [].\nReferences\n) \"Annals of Emperor Guangwu\"\n}}"
    }
  ]
}