{
  "content": [
    {
      "type": "text",
      "text": "# Sunrise Boulevard (Broward County)\n\n|map_custom=yes\n|map_notes=SR 838 in red, CR 838 in blue\n|length_mi=15.602\n|length_round=1\n|length_ref=\n|length_notes= as SR 838\n|established=\n|direction_a=West\n|terminus_a= in Plantation\n|junction= in Plantation\n* near Plantation\n* in Fort Lauderdale\n* in Fort Lauderdale\n}}\n|direction_b=East\n|terminus_b= in Fort Lauderdale\n|counties=Broward\n|previous_type=Toll\n|previous_route=836\n|next_type=SR\n|next_route=842\n}}\nSunrise Boulevard is a  long east&ndash;west highway serving central Broward County mostly designated State Road 838 (SR 838). The road begins at an interchange with the Sawgrass Expressway (SR 869) in Sunrise and continues east to North Ocean Boulevard (SR A1A) in Fort Lauderdale, next to Hugh Taylor Birch State Park. For  in downtown Fort Lauderdale, SR 838 overlaps U.S. Route 1.\nThe westernmost  of Sunrise Boulevard carries the unsigned designation of County Road 838 along with its state road designation.\nRoute description\nSunrise Boulevard has its western terminus at the Sawgrass Expressway. On the northwest corner of its intersection with Flamingo Road is Sawgrass Mills, one of the nation's largest malls. After it passes the mall, SR 838 passes through mainly residential areas until its intersection with University Drive, where the state road designation begins.\nAbout  down the road is Plantation High School, followed by interchanges with Florida's Turnpike and US 441 (SR 7), with the latter intersection at the border between Plantation and Lauderhill. Central Broward Regional Park and the Swap Shop border the road to the north after the interchange with US 441 as it enters the Dillard Park neighborhood of Fort Lauderdale. An interchange with I-95 soon follows.\nAfter its intersection with Powerline Road, SR 838 becomes concurrent with US 1 (Federal Highway) for about . After it passes by The Galleria at Fort Lauderdale east of the second intersection with Federal Highway, it crosses over the Intracoastal Waterway and from here to its eastern terminus at SR A1A, Sunrise Boulevard forms the southern border of Hugh Taylor Birch State Park.\nMajor intersections\n, accessed March 2014}}\n|notes=Tolled interchange; exit 1 on SR 869\n}}\n|notes=Transition from CR 838 to SR 838\n}}\n|notes=Exit 58 on Turnpike\n}}\n|notes=Diamond interchange\n}}\n|notes=Exit 29 on I-95 (unsigned SR 9)\n}}\n|notes=Southern terminus of SR 845\n}}\n|notes=Western terminus of US 1 (unsigned SR 5) concurrency\n}}\n|notes=Eastern terminus of US 1 concurrency\n}}\n}}\nReferences\nExternal links"
    }
  ]
}