{
  "content": [
    {
      "type": "text",
      "text": "# Superman dynasty__disambig_1\n\n}}\nThe Superman dynasty, an extension of the House of El, is a lineage of DC Comics superheroes. The term is used for the descendants of Kal-El, the original Superman, who continue to uphold his legacy of heroism for millennia, as depicted in the DC One Million crossover. Repeated references to members of the Superman dynasty, as Superman's \"descendants\" and at least one reference to them as the \"blood of his blood\" would seem to indicate that they are, in fact, the biological descendants of Superman in some fashion.\nHistory\nof the House of El.]]\nThe Superman dynasty starts with the House of El, and Kal-El. Unable to save Krypton, leading Kryptonian scientist Jor-El decides to send his only son to Earth. Under the planet’s yellow sun, Kal-El becomes the first super-powered Kryptonian, becoming known as Superman. Superman is later joined by Kon-El, a clone who would become known as Superboy, his cousin Kara Zor-El, who would become known as Supergirl, her Earth-Two counterpart Kara Zor-L, also known as Power Girl, and the Eradicator, an artificial intelligence created by Kem-L.\nIn the timeline of DC One Million, the death of Lois Lane compels Superman to leave Earth and wander the universe alone at the end of the 21st century. This version of Kal-El is immortal and it is unclear within the comics on how he gained this power. In his place, he leaves his heir, who is called Superman Secundus. From that point on, descendants of Superman continue to protect their ancestor's adopted homeworld for centuries, with at least one Superman emerging in each generation. As time passes, and more sources of power are discovered, new superpowers are added to the inheritance of the Supermen. Among these powers are the ten alien sensory powers brought into the lineage by the Superman of the 67th century via his marriage to Gzntplzk, queen of the 5th Dimension (home of one of Kal-El's enemies, Mister Mxyzptlk), including Extra-sensory perception. Their powers are increased significantly again at the dawn of the 700th century, when the original Superman finally returns from his wandering, takes up residence on Earth's sun, and enters into a pact with the Superman of that time to provide them access to the vast powers he had gained in the 68,000 years he had been gone, in return for the dynasty's vow to continue to protect Earth.\nThe members of the Superman dynasty continue to be at the forefront of super heroism for centuries, leading such groups as the Office of Deputy Superhunters in the 250th century, the Justice League of the Atom (sometime after the 364th), and Justice Legion Alpha in the 853rd. A number of Supermen from different eras, including the Superman of the 853rd century, also form a team called the Superman Squad which travels through time fighting threats to the timestream. Superman even joins the Pancosmic Justice Jihad, but soon leaves over \"policy issues\".\nA notable victory of the dynasty and its allies is the defeat of the Bizarro plague in the 250th century, and the dynasty's greatest foe is Solaris, the Tyrant Sun.\nThe ongoing Rebirth storyline raises questions about the Superman Dynasty future timeline. It has been revealed that the \"Convergence\" versions of Clark Kent/Superman and Lois Lane are not alternate reality versions of the post-Flashpoint/New 52 versions, but were in fact the original pre-Flashpoint versions somehow moved – for as-yet unknown reasons – by Doctor Manhattan to a \"pocket reality\" of his creation for over a decade while he created the New 52 Universe. Both versions merged into a combined Superman and Lois Lane, whose new history seems to mirror the pre-Flashpoint continuity far more than that of the New 52.\nHouse of El\nEarth-Two\n* Jor-L\n* Kal-L/Clark Kent\n* Kara Zor-L: The daughter of Zor-L and Allura In-Z. She arrives on Earth as a young woman after years spent traveling in suspended animation. On Earth, she adopts the human alias Karen Starr and becomes the superhero Power Girl. She survives Crisis on Infinite Earths, but believes herself to be an Atlantean before remembering her origins.\n* Equinox: Kara's son from a mystical pregnancy. He ages rapidly and disappears during Zero Hour: Crisis in Time!.\n* Divine: a clone of Kara Zor-L created by Doctor Sivana for Maxwell Lord.\n* Zor-L\nEarth-One\n* Jor-El I: Jor-El's father and Kal-El's grandfather.\n* Jor-El II: A Kryptonian scientist who accurately predicted the destruction of Krypton, but was not believed. He married Lara Lor-Van, daughter of Lor-Van and Lara Rok-Var, and they had one son: Kal-El.\n* Kal-El I\n* Kal-El/Clark Kent\n* Val-El: Ter-El's brother, Seyg and Var-El's uncle\n* Zim-El\n* Nim-El: The twin brother of Jor-El, uncle of Kal-El and Kara Zor-El, ''Superman's Pal, Jimmy Olsen'' #60 (April 1962). He marries Dondra Klu-Ta, and they have one son: Don-El.\n* Don-El: Nim-El and Dondra Klu-Ta's son\n* Kara Zor-El: The superhero known as Supergirl. Zor-El and Alura In-Ze's daughter\n* Zor-El: Kara's father and Jor-El's brother.\n* Kalya Var-El: Var-El's daughter, twin brothers Jor-El and Zim-El's cousin, and Superman and Supergirl's great-aunt. Nim-Zee's wife and twins Van-Zeeand Dik-Zee, and Gem-Zee's mother. The three survive Krypton's death after Brainiac steals the city of Kandor.\n** Van-Zee: A Kandorian superhero named \"Nightwing\". He married the human woman Sylvia DeWitt and had twins: Lyle-Zee and Lili Van-Zee.\n** Gem-Zee: Had two children, Thara and Rad-Zee. Thara married Ak-Var / Flamebird, her uncle's sidekick.\nNim-Zee and In-Zee (Are two brothers, In-Zee is father of Alura In-Zee, married to Ardra Kar-Pan, mother of Alura In-Zee, Kara Zor-El's grandmother ).\nPost-Crisis\n* Jor-El: A Kryptonian scientist who accurately predicted the destruction of Krypton, but he was not believed. He married Lara Lor-Van, and they had one son: Kal-El.\n* Kal-El/Clark Kent\n* Kem-L: A distant ancestor of the modern House of El. He created the Eradicator.\n* Seyg-El: The father of Jor-El and Zor-El and the grandfather of Superman and Supergirl.\n* Ter-El: The father of Seyg-El and Var-El, the grandfather of Jor-El and Zor-El, making him the great-grandfather of Superman and Supergirl.\n* Superboy: A hybrid clone of Superman and Lex Luthor created by Project Cadmus. He is also known as Kon-El and Conner Kent.\n* Match: A clone of Conner Kent.\n* Seraph: A DNAngel created by Amanda Spence at Project Cadmus using DNA from an unknown African-American donor.\n* Bizarro: An imperfect copy of Superman.\n* Cir-El: Also called Mia and Cheryl Kent, she is a human overwritten with Superman's DNA and created by Brainiac.\n* Mon-El: The adopted Daxamite son of Kal-El.\n* Christopher Kent: The adopted son of Kal-El and Lois Lane. He is the biological son of General Dru-Zod and Ursa.\n* Kara Zor-El: The superhero known as Supergirl. She is the daughter of Zor-El and Alura In-Ze.\n* Zor-El: The brother of Jor-El. He married Alura In-Ze, and they have one daughter: Kara Zor-El.\n* Laurel Kent: A descendant of Superman from the thirtieth century.\n* Kent Shakespeare: A descendant of Superman from the thirtieth century.\nPost-Flashpoint\n* Jon Lane Kent: The son of Kal-El and Lois Lane in Teen Titans (vol. 3) Annual #2 (October 2013) part of the Forever Evil crossover event.\n* Superboy: A clone created by Harvest and N.O.W.H.E.R.E. with DNA from Jon Lane Kent and an unknown donor in the New 52.\n* Jon Kent: The son of Superman and Lois Lane, born in Convergence: Superman #2 (July 2015).\nAlternate universes\n* Adam Kent: The son of Kal-El and Lois Lane in JLA: Created Equal.\n* Bru-El: Valora's twin and Kal-El's younger brother, he is the son of Jor-El and Lara Lor-Van and appears in Superman: The Last Family of Krypton.\n* Valora: Bru-El's twin and Kal-El's younger sister, she is the daughter of Jor-El and Lara Lor-Van and appears in Superman: The Last Family of Krypton.\n* Jon Kent: The son of Kal-El and Lois Lane in Son of Superman.\n* Bruce: The son of Kal-El and Wonder Woman in Superman: Distant Fires and JLA: Act of God.\n* Zod-Ur: The son of Kal-El and Wonder Woman in the Justice Lords' reality in Justice League Beyond 2.0.\n* Zod-El: The brother of Jor-El in Superman: Earth One.\n* Belinda Zee: A Bizarro created from Kara Zor-El's DNA in Supergirl: Cosmic Adventures in the 8th Grade.\n* Andromeda: A version of Kara Zor-El from another dimension in Supergirl: Cosmic Adventures in the 8th Grade.\n* Carol Kent: The daughter of Clark Kent and Lois Chaudhari in Superman: Secret Identity.\n* Jane Kent: The daughter of Clark Kent and Lois Chaudhari in Superman: Secret Identity.\n* Clark Kent: The grandson of Clark Kent and Lois Chaudhari in Superman: Secret Identity.\n* Perry Kent: The grandson of Clark Kent and Lois Chaudhari in Superman: Secret Identity.\n* Jimmy Kent: The grandson of Clark Kent and Lois Chaudhari in Superman: Secret Identity.\n* '''Brainiac's Daughter/XTC': The daughter of Kara Zor-El and Brainiac 5 in Kingdom Come.\n* Jonathan Kent II/Hyperman: The son of Kal-El and Wonder Woman in The Kingdom.\n* Joel Kent: The son of Clark Kent and Lois Lane in Superman & Batman: Generations.\n* Kara Kent: The daughter of Clark Kent and Lois Lane in Superman & Batman: Generations.\n* Clark Wayne / Nightwing: The son of Joel Kent and Mei-Lai Kent in Superman & Batman: Generations 2. He is adopted and raised by his stepfather, Bruce Wayne Jr. (the son of Bruce Wayne).\n* Lois Wayne and Lara Wayne: The daughters of Clark Wayne and Amanda Mason in Superman & Batman: Generations 2.\n* Thomas Taylor Wayne: The son of Lara Wayne and Bruce Wayne Sr. in Superman & Batman: Generations 3.\n* Lar-El and Vara: The children of Kal-El and Beautiful Dreamer in Superman & Batman: Generations 3.\n* Lara Kent: The daughter of Kal-El and Wonder Woman in Batman: The Dark Knight Strikes Again.\n* Jonathan Kent: The son of Kal-El and Wonder Woman in Dark Knight III: The Master Race.\n* Zorn-El: The cousin of Kal-El from Batman: The Dark Knight Strikes Again.\n* Jur-Li: A villainous version of Jor-El from the pre-Crisis Earth-Three. He has one son, Kel-Li.\n* Kel-Li: A villainous version of Superman from the pre-Crisis Earth Three. He is Jur-Li's son.\n* Jor-Il: A villainous version of Jor-El from the post-Flashpoint Earth 3. He married Lara, and they have one son: Kal-Il.\n* Kal-Il: A villainous version of Superman from the post-Flashpoint Earth 3.\n* Superlad: A male version of Kara Zor-El on Earth-11 as seen in Superman/Batman #22-25 and Countdown Presents: The Search for Ray Palmer: Superwoman/Batwoman #1.\n* Superwoman: The female version of Clark Kent on Earth-11 as seen in Superman/Batman #22-25 and Countdown Presents: The Search for Ray Palmer: Superwoman/Batwoman #1.\n* Jorel and Lara: Scientists from the Kryptonian city Jandra-La on Earth-23. They are the parents of Kalel.\n* Calvin Ellis: Superman's Earth-23 counterpart and the President of the United States.\nOthers\n* Halk Kar: Kal-El's foster brother from the Kryptonian colony Thoron.\n* Val-Zod: Superman II, is a Kryptonian sent to Earth by his unknown parents, who were members of the house of Zod.\n* \"Sunshine Superman\": A refugee from Vathlo Island and a member of the Love Syndicate of Dreamworld. His Kryptonian name is unknown.\n* Knor-El: Ken Clarkson, is the brother of Kal-El in Superman #200 (October 1967)\n* Superman Jr. and Batman Jr.: Sons created by Superman and Batman in the AI at the Fortress of Solitude and brought to life; they appear in the \"Super-Sons\" stories in 12 issues (between 1976 and 1980) of ''World's Finest Comics.\n* Clark Jr: The son of Kal-El and Lois Lane in Superman #192 (January 1967).\n* Clark Jr: The son of Kal-El and Lana Lang in Superman #404 (February 1985).\n* Laney / Lanie: The daughter of Kal-El and Lois Lane in Superman #215 (April 1969).\n* Lara Lane-Kent: The daughter of Kal-El and Lois Lane in The Adventures of Superman #638 (May 2005).\n* Larry and Carole: The twin children of Kal-El and Lois Lane in Superman's Girl Friend Lois Lane #23 (February 1961) and Superman's Girl Friend Lois Lane #39 (February 1963).\n* Laura Kent: The daughter of Kal-El and Lois Lane in Superman Family #200 (April 1980).\n* Lisa Kent: The daughter of Kal-El and Lois Lane in Superman's Girl Friend Lois Lane #91.\n* Lola Kent: The daughter of Kal-El and Lois Lane in Superman's Pal Jimmy Olsen #56 (October 1961).\n* Kal and Jor: The children of Kal-El and Lana Lang in Superman #162 (July 1963) and Superman #166 (January 1964) and Superman: Distant Fires (1998) and Action Comics #492 (February 1979).\n* Joan: The daughter of Kal-El and Lana Lang in Superman's Girl Friend Lois Lane #46 (January 1964). She falls in love with Larry Luthor, the son of Lex Luthor and Lois Lane.\n* Ariella Kent: The daughter of Kal-El and Matrix from \"Many Happy Returns\", first seen in Supergirl One Million (1998).\n* Vol: The son of Kal-El and Lasil in Action Comics #370 (December 1968).\n* Krys: The son of Kal-El and Krysalla in Action Comics #410 (March 1972).\n* C.K.: A descendant of Superman who became a member of the Superman Squad.\n* Jorel Kent: The son of Kal-El and Lois Lane. He succeeds his father as \"Superman II\", and he is succeeded by his own son Kalel as \"Superman III\".\n* Kalel Kent: The son of Jorel Kent and \"Mrs Jorel Kent\" in Superman #364-372 (October 1981-June 1982). He succeeds his father and grandfather as \"Superman III\".\n* Laurel Kent: The daughter of Clark Kent. She made her first appearance is in Superman #354 (December 1980)\n* Dave Kent: The son of Kalel Kent and Melodee Sellers.\n* Superman V: The son of Dave Kent. His first actual appearance is in Action Comics #338 (June 1966).\n* Superman VI: The son of Superman V.\n* Superman VII: Kanton K-73, is the son of Superman VI from Action Comics'' #338 (June 1966).\n* Klar Ken T5477: The older brother of Kara. He was born in 2944 as a descendant of Superman's son Jorel Kent.\n* Kara: The younger sister of Klar Ken. She is descended from Superman's son Jorel Kent and born in the thirtieth century.\n* Justice Legion S: A superhero team from the 853rd century in DC One Million which consists of one million clones of Superboy.\n* Superman Secundus: A descendant of Superman who succeeded the original Superman after he left Earth.\n* Kal Kent: A descendant of Superman in DC One Million and the leader of Justice League Alpha. He is not only of Kryptonian descent since many aliens and otherworldly beings have married into the Superman Dynasty by the 853rd century. Most notably, he descended from a princess of the Fifth Dimension.\n* Super Lad: A male clone of Kara Zor-El as seen in Supergirl #10 (October 1974).\n* Satan Girl: An evil double of Kara Zor-El created by Red Kryptonite in Adventure Comics #313 (October 1963).\n* Louise-L: Supergirl of the 5020th century. She is descended from Superman.\n* Jonathan: The son of Kal-El and Lois Lane in Whatever Happened to the Man of Tomorrow? (September 1986).\nHouse of Van\n* Lor-Van: Kela's husband and Lara and Zora's father. He is sometimes named Sul-Van.\n* Kela: Lor-Van's wife and Zora and Lara's mother. She was originally known as Lara Rok-Var during the Pre-Crisis Era, but her name was changed to Kela after Flashpoint. She survived the destruction of Krypton because she was inside the city of Kandor when it was shrunken and removed from the planet.\n* Lara Lor-Van: The birth mother of Superman.\n* Zora Lor-Van: She survived Krypton's death because she was inside the city of Kandor when it was shrunken and removed from the planet. She is sometimes called Mara instead, and it is presently unknown which is meant to be her \"real\" name.\n* Nara: Lara Lor-Van's grandmother.\nHouse of Ze\n* Alura In-Zee: Zor-El's wife and Kara Zor-El's mother.\n** On Earth-Two, Allura In-Z is the wife of Zor-L and the mother of Kara Zor-L, who was sent to Earth in a rocket like her cousin Kal-L. Allura and Zor-L were killed in the destruction of Krypton.\n** On Earth-One, Allura In-Ze survived the destruction of Krypton with the other residents of Argo City, who were protected by the city's force field. She married Zor-El and had a daughter, Kara Zor-El. When Kara was fifteen, a meteor storm wrecked the force field, and the citizens were endangered by Kryptonite poisoning. Zor attempted to save them by creating a \"Survival Zone\", akin to the Phantom Zone, but when that apparently failed, Zor and Allura decided to send their daughter to Earth in a rocket. After Kara's departure, the Argoans began fading into the Phantom Zone instead of dying from radiation poisoning. Later, Kara rescues her parents from the Phantom Zone, and they shrink themselves down to settle in Kandor. When Kandor is restored to full size, Allura and Zor make their home on Rokyn where they continue to live up until their daughter dies during Crisis on Infinite Earths. Allura, Zor, and all the residents of Rokyn cease to exist after reality is rebooted by the Crisis.\n** Alura In-Ze is reintroduced after Crisis on Infinite Earths as a member of the Krypton Science Council and a resident of the Bottle City of Kandor imprisoned on Brainiac's ship. Her nephew Kal-El rescues Kandor from Brainiac and restores it to full-size not far from his Fortress of Solitude where it becomes known as \"New Krypton\". Under Earth's yellow sun, Alura gains all the powers of the typical Kryptonian. Unlike her husband, she is not interested in assimilating, and she causes several problems for her daughter and nephew by acting in what she thinks are the best interests of the Kryptonians, not the least of which is kidnapping several of Superman's enemies from Stryker's Island and sending them to the Phantom Zone. Following Zor's death, she detaches New Krypton from Earth and puts into fixed orbit opposite Earth's, and she forbids Earthlings (including Kal) from setting foot on the new planet. She then frees the Phantom Zone prisoners. During the war between Earth and New Krypton, Alura is killed when New Krypton is destroyed by Reactron.\n** Alura In-Ze is again reimagined after Flashpoint. In the Prime Universe, she survived Krypton's destruction with the other residents of Argo City, but died when their force field failed. She is survived by her daughter Kara, who is sent to Earth in a rocket and becomes Supergirl, and her husband Zor, who is turned into Cyborg Superman.\n* General Astra: Alura's identical twin sister, Kara's aunt in Supergirl. She married her subordinate Non. Astra and Non believed that Krypton would be destroyed, and they attempted to prevent the destruction of their homeworld, resorting to violent measures, until Astra was tricked into meeting her niece Kara and was captured with her husband and followers. Astra was given a lifetime sentence in Fort Rozz. She therefore survived the destruction of Krypton and was able to escape years later with the other prisoners of Fort Rozz. She then tried to take over Earth and fought against her niece Supergirl several times, but she gave orders that Kara was not to be injured. She was later killed by Kara's foster sister Alex Danvers during a fight with Martian Manhunter, and after her funeral and a period of mourning, her widower Non no longer respected her orders to protect Kara.\nIn other media\n* Jason White, son of Clark Kent and Lois Lane in the 2006 film Superman Returns, raised by Perry White's nephew Richard White.\n* LX-15 / Alex Luthor Jr. / Conner \"CNR\" Kent / Kon-El, a Cognitional Neuroplastic Replicant hybrid of Superman and Lex Luthor's DNA. He was raised by Tess Mercer in the TV series Smallville.\n* Kell-El / Superman-X, a 41st-century clone of Superman, appears in Legion of Super Heroes (2006).\n* Seyg-El (renamed Seg-El) stars in Krypton as the main lead, Jor-El's farther and Kal-El's grandfather.\n* Clark and Lois of Earth-167 (the setting of Smallville) have unnamed daughters in the Arrowverse's Crisis on Infinite Earths crossover.\n* In the DC Animated Universe, Kara In-Ze is not a blood relative of Kal-El but instead a survivor of Argo who was adopted by Jonathan and Martha Kent. Her biological parents were Kala and Zor, and her sisters were Kalya, Kori, and Kari.\n* Galatea, a clone of Kara In-Ze created by Emil Hamilton for Project Cadmus, appears in Justice League Unlimited.\nReferences\nExternal links\n* [http://en.dcdatabaseproject.com/House_of_El House of El]\n* [http://theages.superman.nu/encyc/el-family.php Family Tree of Superman]"
    }
  ]
}