{
  "content": [
    {
      "type": "text",
      "text": "# Super President\n\n| last_aired           =\n| num_seasons          = 1\n| num_episodes         = 30\n| list_episodes        =\n| related              =\n| company              = DePatie–Freleng EnterprisesMirisch-Rich Television Productions\n}}\nSuper President is an American animated cartoon that aired Saturday mornings on NBC from September 16, 1967 to December 28, 1968. The series was produced by the DePatie–Freleng animation company.\nIn the show, the President of the United States has extraordinary superpowers, including increased strength and the ability to change his molecular composition, and uses them to protect the Free World, as well as his hapless Vice President. The show was relentlessly criticized for its bad taste and low quality, and was cancelled after thirty episodes, midway through its second season.\nPlot\nThe President of the United States, former astronaut James Norcross (voiced by Paul Frees) is given superpowers as the result of a cosmic storm during a space mission. The future President gains increased strength and the Metamorpho-like ability to change his molecular composition at will to any form required (like granite, steel, ozone, water and even electricity). A hidden panel in the Oval Office allows him access to his secret base, a hidden cave beneath the \"Presidential Mansion\" (a somewhat modified White House). Super President travels either by using a futuristic automobile/aircraft/submarine called the Omnicar, or by using jets built into his belt.\nDespite the fact that the character's name is \"Super President\", for some reason only Norcross' chubby, pipe-smoking advisor Jerry Sales knows that the leader of the Free World is also a red and white-costumed superhero in his off-hours.\nA total of thirty episodes of Super President were produced. Two episodes appeared in each show. Each episode also included an episode of Spy Shadow starring secret agent Richard Vance (voiced by Ted Cassidy) who had learned in Tibet how to command his shadow (also voiced by Ted Cassidy) to act independently of himself, an ability he put to good use as an Interspy operative battling a variety of villains, including the evil forces of S.P.I.D.E.R. (\"Society for Plunder, International Disorder, Espionage and Racketeering\"). Spy Shadow had the power to slip through small openings, hide himself in another person's shadow, and was invulnerable to harm thanks to his insubstantial nature, but his fists remained decidedly solid. Spy Shadow's only weakness is the inability to appear in total darkness for \"there can be no shadow without light\".\nReception\nSuper President came under fire from critics and TV watchdog groups, including Action for Children's Television, for its depiction of a national leader who was an invincible superhuman (especially since it debuted less than four years after John Kennedy's death). The National Association of Broadcasters said: \"An all-time low in bad taste, with the President of the United States in a Superman role. NBC was responsible for this direct ideological approach to totalitarianism. We fear that there may be other broadcasters who are irresponsible enough to keep it in circulation\".\nIn The Encyclopedia of American Animated Television Shows, David Perlmutter says that the show is \"perhaps the worst animated program in the late 1960s (its producers admitted it themselves)\" and calls the superhero president \"arguably the most implausible superhero narrative idea ever invented\".\nEpisodes\n# The Great Vegetable Disintegrator\n# The Billion Dollar Bomber\n# The Electronic Spy\n# Day of the Locusts\n# The Case of the Destroyer Satellite\n# King of the Sea\n# The U.F.O. Mystery\n# No Time Passes\n# Man of Steel\n# The Earth Robber\n# Monster of the Atoll\n# Return of the Vikings\n# The Cosmic Gladiators\n# The Condor's Eye\n# The President and the Pirate\n# Interplanetary Menace\n# Red Ray Raider\n# The Treachery of Jerry Sales\n# Rangled Terrors\n# Dound and Doom\n# Spears from Space\n# Toys of Death\n# Birds of Terror\n# The Menace of the Moles\n# The Chameleon\n# The Gravity Destroyer\n# Ice Invader\n# Electronic Giant\n# Time Crimes\n# A Million Years of Menace\nCast\n* Daws Butler -\n* Ted Cassidy - Richard Vance, Spy Shadow\n* June Foray -\n* Paul Frees - Super President/James Norcross, Narrator\n* Shepard Menken -\n* Don Messick -\nReferences\nFurther reading\n* Kevin Scott Collier. The Animated Administration of James Norcross, a.k.a. Super President. CreateSpace Independent Publishing Platform, 2017.\nExternal links\n*\n* [http://www.toonopedia.com/suprpres.htm Super President] at Don Markstein's Toonopedia. [http://toonopedia.com/superrab.htm Archived] from the original on January 1, 2018.\n* [http://www.stomptokyo.com/badmoviereport/reviews/S/super_president.html Review by The Bad Movie Report]"
    }
  ]
}