{
  "content": [
    {
      "type": "text",
      "text": "# Super Sentai Strongest Battle\n\n| writer               =  (eps 1-4)\n| director             =  (eps 1-4)\n| starring             =\n| voices               =\n| narrated             = Tomokazu Seki\n| theme_music_composer =\n| opentheme            = \"Saikyō Saikō Super Stars!\"\n| endtheme             =\n| composer             =\n| country              = Japan\n| language             = Japanese\n| num_episodes         = 4\n| list_episodes        = List of Super Sentai Strongest Battle episodes\n| executive_producer   = Motoi Sasaki\n| producer             = |Ayumi Kanno |Kazuhiro Takahashi |Masayuki Yamada |Kōichi Yada |Akihiro Fukada }}\n| company              =\n| runtime              = 24–25 minutes (ep 1-4)  94 minutes (director's cut)\n| channel              = TV Asahi\n| first_aired          =\n| last_aired           =\n| related              =\n}}\nis a Japanese tokusatsu minidrama (crossover special) based on the Toei's long-running Super Sentai metaseries featuring cast members from past installments and acts as a prelude to the events of Kishiryu Sentai Ryusoulger. It aired from February 17, 2019 to March 10, 2019, replacing Kaitou Sentai Lupinranger VS Keisatsu Sentai Patranger and was replaced by Kishiryu Sentai Ryusoulger. The program joining Kamen Rider Zi-O in the Super Hero Time line-up on TV Asahi affiliate stations.\nPlot\nA mysterious girl named Rita invites members from the Super Sentai teams across history to . The heroes are told that any wish they desire will come true if they can win the “Super Sentai Greatest Battle” tournament, the 160 heroes divided into 32 teams of five to compete against each other to have their wishes granted while contending with the mysterious Gaisoulg who seeks worthy opponents to battle. The story follows the , composed of the Zyuohgers' Yamato Kazakiri, the Gokaigers' Captain Marvelous, the Ninningers' Takaharu Igasaki, the Kyurangers' Stinger, and the ToQgers' Kagura as they fight other heroes for the prize while learning the secrets behind the tournament.\nCast\n*:\n*:\n*:\n*:\n*:\n*:\n*:\n*:\n*, , Narration:\n*Introduction Voice:\nGuest cast\n*:\n*:\n*:\n*:\n*:\n*:\n*:\n*:\n*:\nEpisodes\nThe episodes are called \"Battles\".\n{|class=\"plainrowheaders wikitable\" style=\"width:98%; margin:auto; background:#FFF;\n|- style=\"border-bottom: 3px solid #CCF;\"\n! style=\"width:4em;\"  | Battle\n! Title\n! style=\"width:12em;\" | Original air date\n|-\n| OriginalAirDate =\n| ShortSummary    = The Gokaigers are attacked and defeated by Gaisoulg, who seeks the strongest Super Sentai member, before Captain Marvelous receives a golden ticket. He, among hundreds of other Sentai members, are teleported to the planet Nemesis for a tournament held by a girl named Rita, who promises to grant the winner a wish. The Sentai members are divided into teams of five, with Marvelous placed in the  \"Oddball Team\", along with Yamato Kazakiri, Takaharu Igasaki, Stinger, and Kagura, so he can face Gaisoulg again. In the first round, Kazakiri faces Keiichiro Asaka, who forfeits upon realizing his team's wish for a peaceful world is one they must attain themselves. Igasaki and Stinger succeed in the second round, but are attacked by Gaisoulg. Meanwhile, Ryusoul Green and Black, who also possess tickets, explore a cave together.\n}}\n| OriginalAirDate =\n| ShortSummary    = Gaisoulg retreats after Marvelous comes to Igasaki and Stinger's aid and reprimands the former for interfering in his vendetta against Gaisoulg before isolating himself from the rest of the Oddball Team. Meanwhile, Gaisoulg meets with Rita, revealing his possession of a golden ticket. She allows him to participate in the tournament. While Igasaki and Kagura attempt to cheer Marvelous up, Stinger leaves to investigate on his own while Kazakiri is informed the next round was meant to be a three-on-three match against the Gaorangers' Gao Red, the Gingamen's Ginga Green, and the Sun Vulcan team's Vul Shark. Despite being outnumbered, Kazakiri opts to fight them alone, determined to fulfill a dead friend's unfulfilled dream of running with animals in the wild. After Kazakiri wins the battle, Igasaki is attacked by Gaisoulg again while Stinger discovers a hidden lab containing several books about the Super Sentai along with a revelation. When Gaisoulg interferes in another battle, Marvelous intercepts him and knocks off his helmet, revealing Igasaki's face underneath. Concurrently, Ryusoul Green and Black continue their exploration, discovering some RyuSouls along the way.\n}}\n| OriginalAirDate =\n| ShortSummary    = While Igasaki leaves an unconscious Marvelous behind, Stinger is approached by Doggie Kruger, with both revealing they agreed to participate to investigate Rita's true intentions. Kruger scans some of the texts Stinger found to have them translated, but they are attacked by foot soldiers from past Sentai enemy factions. As they escape, Kruger finds Marvelous and takes him back to the others while Stinger is attacked by Gaisoulg. Rita announces the Oddball Team's next match will be a duel between Kagura and Kruger. After Kagura wins, Kruger entrusts her with his Master License and a D-Wapper before leaving. Gaisoulg attacks her, but Kazakiri and Marvelous arrive to protect her and defeat him. To their surprise, Stinger is now inside Gaisoulg's armor, which they realize is sentient and possesses its wearer. Once Kruger's analysis is completed, the Oddball team learn that Rita's true objective is to revive Ultimate Great Satan, but struggle to figure out how to find the missing Igasaki. Revealing that his fellow Gokaiger Luka Millfy was also taken by Gaisoulg, Marvelous allows himself to be possessed by the armor. Meanwhile, Ryusoul Green and Black's tickets cause them to disappear just as Master Red enters the cave.\n}}\n| OriginalAirDate =\n| ShortSummary    = Marvelous uses Gaisoulg's helmet to locate and free Millfy and Igasaki while Kazakiri and Stinger confront Rita, who reveals she intends to use Ultimate Great Satan to destroy the universe and avenge Nemesis' dead inhabitants in spite of Stinger's attempts to dissuade her. The Oddball Team confront Ultimate Great Satan, but are overpowered until Millfy destroys the barrier surrounding Nemesis. Marvelous summons the Gokai Galleon to keep Ultimate Great Satan at bay while the Oddball Team channel the power of their Super Sentai predecessors to destroy him. Incensed at her plans being foiled, Rita dons Gaisoulg's armor and attacks the weakened Oddball Team until Ryusoul Green and Black arrive to defeat her before leaving. As the Oddball Team use Kruger's D-Wapper to arrest Rita and celebrate their victory, an unknown person retrieves Gaisoulg's helmet. Meanwhile, Master Red discovers a blank Ryusoul, which transforms into the Red Ryusoul in his hand.\n}}\n|}\nTheme song\n*\n**Lyrics:\n**Composition:\n**Arrangement:\n**Artist: NoB\nSee also\nKamen Rider × Super Sentai: Ultra Super Hero Taisen\nReferences\nExternal links\n* at TV Asahi\n* at Toei Company"
    }
  ]
}