{
  "content": [
    {
      "type": "text",
      "text": "# Supersonic Acrobatic Rocket-Powered Battle-Cars\n\n| designer =\n| programmer =\n| artist =\n| composer =\n| engine = Unreal Engine 3\n| platforms = PlayStation 3\n| released =\n| genre = Sports\n| modes = Single-player, multiplayer\n}}\nSupersonic Acrobatic Rocket-Powered Battle-Cars is a vehicular soccer video game for the PlayStation 3. The game was released in North America in October 2008, and in Europe in February 2009. The campaign mode of the game is made up of a series of varied mini-games, and tournaments against AI that can only be played in single-player mode. A sequel, titled Rocket League, was released in July of 2015.\nGameplay\nThe game is played by one or more players, locally or online, using their car to hit a soccer ball that is much larger than the car to score a goal. Each goal is worth one point, and the team with the most points when 5 minutes have passed wins. The game includes mechanics such as the double jump, which allows to jump another time in the air after jumping from the ground, giving a faster in-air speed.\nReception\n| GSpot = 6/10\n| IGN = 6.5/10\n}}\nSupersonic Acrobatic Rocket-Powered Battle-Cars received mixed reviews by critics according to Metacritic, a review aggregator.\nSequel\nIn March 2011, Psyonix confirmed that there was a sequel in development but that it was far from completion due to them having difficulty pitching it to publishers or acquiring the finances required to self-publish. In September 2013, Psyonix announced more details, saying that there would be a free alpha version released for testing and improvement on the PC, before being ported to consoles. Rocket League, was released for the PlayStation 4 and Microsoft Windows on July 7, 2015, and for other platforms at later dates. Rocket League has been free since September 23, 2020 and is available on PlayStation 4, PlayStation 5, Xbox One, Xbox Series X and Series S, Microsoft Windows, and Nintendo Switch.\nReferences\nExternal links\n*"
    }
  ]
}