{
  "content": [
    {
      "type": "text",
      "text": "# Suppose They Gave a War and Nobody Came__disambig_1\n\n| distributor    = Cinerama Releasing Corporation\n| released       =\n| runtime        = 113 minutes\n| country        = United States\n| language       = English\n| budget         = $3,600,000\n| gross          = $1,080,000\n}}\nSuppose They Gave a War and Nobody Came (also known as War Games, Old Soldiers Never) is a 1970 American drama-comedy film directed by Hy Averback, produced by Fred Engel, and starring Brian Keith, Don Ameche, Tony Curtis, Ernest Borgnine, Suzanne Pleshette, Ivan Dixon, and Pamela Britton. The plot is a mixture of comic and dramatic elements and concerns the reactions of a number of World War II veterans to the contemporary US Army.\nThe title is derived from an American antiwar slogan from the hippie subculture during the Vietnam War era, popularized by Charlotte E. Keyes in her 1966 article for ''McCall's magazine titled \"Suppose They Gave a War and No One Came\".\nPlot\nCol. Flanders commands a U.S. Army base in the South. To improve relations with the locals, he decides to throw a community dance. He gives the assignment to Warrant Officer Michael M. Nace, sergeants Shannon Gambroni and Jones, and a captain, Myerson.\nA bigot named Billy Joe Davis is a big man in town, backed by Harve, a redneck sheriff. Harve considers a pretty barfly, Ramona, to be his girl, so when he catches  Gambroni and her together, he has the sergeant placed under arrest for lewd conduct in public.\nNace is drunk and of no help. Jones, who is black, is refused a loan by Mr. Kruft, a banker in town, so in anger he decides to spring Gambroni from jail. Billy Joe retaliates by calling in his armed militia, so Nace steals a tank from the base and fights back. Harve takes three of the soldiers as his prisoners.\nNace and Jones (in the tank) manage to arrive at the town, where they wreak havoc by running over the stone statue of a Confederate war hero and ram-crash into the local jail, enabling Gambroni to break out.\nBy the time the dust settles, Col. Flanders and his men have arrived in town to save the day.  The town mayor fires the sheriff for abuse of authority and the military men pledge to repair the damage caused by the tank.\nCast\nReception\nThe film earned rentals of $630,000 in North America and $450,000 in other countries, recording an overall loss of $4,160,000.\nWhile produced and wholly owned by ABC, the network did not air the movie on prime time television until 1979, where it was retitled War Games.\nSee also\n* List of American films of 1970\n* Tank (film) (1984)\nReferences\nExternal links\n*\n*\n* [https://web.archive.org/web/20090116120330/http://ftvdb.bfi.org.uk/sift/title/52851 Suppose They Gave A War and Nobody Came''] at BFI\n* Charlotte E. Keyes, [http://www.genekeyes.com/CHET/Chet-1.html#Suppose \"'Suppose They Gave a War and No One Came'\"] (''McCall's'', October 1966)"
    }
  ]
}