{
  "content": [
    {
      "type": "text",
      "text": "# Supreme Warrior\n\n|Sega CD, 3DO 32X  Macintosh Windows\n}}\n| genre = Beat 'em up\n| modes = Single-player\n}}\nSupreme Warrior is a full-motion video (FMV) beat 'em up game developed by Digital Pictures. It was released for the 3DO Interactive Multiplayer and Sega CD in November 1994 in North America and in early 1995 in Europe, with subsequent releases in 1995 for the 32X, Macintosh, and Windows. The game is themed as a kung fu film where the player has to fight off opponents to protect half of a magical mask.\nAccording to Digital Pictures president Tom Zito, Supreme Warrior came about as a result of fans telling the studio to develop a game based on a kung fu film. The video footage was filmed in Hong Kong. Supreme Warrior received mixed reviews; critics praised the graphics but criticized the gameplay and use of FMV.\nGameplay and premise\ngame.  The player is fighting a full motion opponent using the hands at the bottom of the screen.|alt=A person's hands in front of another person, fighting.]]\nSupreme Warrior is a full-motion video (FMV) beat 'em up game. Gameplay consists of fighting the villain Fang Tu's minions, and eventually Fang Tu himself. From a first-person perspective, players can punch, kick, and execute special moves. A pair of hands is visible on screen that the player controls, and icons prompt the player to attack with timing. Defeating various opponents will give the player special moves. There are three difficulty levels.\nSupreme Warrior plot is about a warrior, Wei Jian Tsen, who acquires a mask that can be split in halves representing good and evil. When the two halves are combined, the wearer gains untold power. Wei Jian Tsen's second wife, Mei Tu, becomes influenced by the Black Flower Cult, a murderous group that uses sorcery. In response, Wei had her executed, causing their only son, Fang Tu, to leave their clan. Wei divides the mask and entrusts half to a Shaolin monk, Master Kai, while keeping the other half himself. Fang Tu kills his father and takes his half. Kai requests that the player transport the other half to a secret sanctuary. The player is assisted by an ally, Wu Ching. She is portrayed by Vivian Wu, and the rest of the cast includes Roger Yuan as Fang Tu and Richard Norton, Chuck Jeffreys, and Ron Yuan as elemental warlords.\nDevelopment and release\nSupreme Warrior was developed by Digital Pictures, a company focused on FMV games and interactive films. When asked about the inspiration for the game, Tom Zito, president of Digital Pictures, said that in asking players to tell them what kind of game to make, they received numerous requests to make a game that recreates a kung fu movie. The video footage for Supreme Warrior was filmed on Shaw Brothers Studio sets in Hong Kong. Many of the actors, and director Guy Norris, had extensive martial arts backgrounds. The actors playing the enemies each choreographed their own fight routines. The fight sequences were mostly recorded using a head-mounted minicam worn by a stunt coordinator, while the sequences where the player character is hit were recorded with a padded hand-held camera which the actors would actually punch and kick. Supreme Warrior includes both English and Cantonese audio, the latter more common in kung fu films, but the scenes were only filmed in English, meaning the Cantonese audio is out of sync with the actors' lips.\nThe 3DO and Sega CD versions of Supreme Warrior were released in November 1994 in North America, with the European release following in February 1995 and an Australian release in April. The game was released for the 32X and Macintosh in North American in January 1995 and for Windows in April. Europe received the 32X version in July 1995. The 32X version requires both a Sega CD and 32X add-ons for its attached Sega Genesis.5.375/10 (32X)\n| NGen = 2/5 (3DO)\n| MG = 41% (CD)\n| rev1 = VideoGames\n| rev1Score = 5/10 (3DO, CD)\n| rev2 =\n| rev2Score = 58% (CD)70% (32X)\n| rev3 = Mega Play\n| rev3Score = 76/100 (32X)\n| rev4 = Sega News\n| rev4Score = 91% (32X)\n| rev5 = Sega Power\n| rev5Score = 77% (CD)\n| rev6 =\n| rev6Score = 73% (32X)\n| rev7 =\n| rev7Score = 52% (32X)\n| GamePro = 16/20 (CD)16.5/20 (32X)\n}}\nSupreme Warrior's 3DO version received mixed reviews. The four reviewers of Electronic Gaming Monthly praised the exceptionally good video quality of the 3DO version and the innovation of having a fighting game from a first person perspective. However, they found that the gameplay did not work, and in particular that opponent attacks are excessively difficult to block. A reviewer for Next Generation was more positive to the gameplay. He went on to say that the game, while a step in the right direction for the developer, suffers from a steep learning curve and a disconnect between the gameplay and the onscreen video. GamePros Slo Mo echoed the praise of the production values of the game's full-motion video, but was more positive about the controls and gameplay. Though he warned that the controls are complicated, he noted that they are responsive as well, and commented that taking the time to master the gameplay is rewarding.\nThe Sega CD version received mixed reviews. Three reviewers for VideoGames praised the game's graphics though noting that the Sega CD version's video was grainy. The reviewers panned the game's playability and overuse of full-motion video, claiming the game \"plays like a wet brick\". In contrast to his 3DO version review, Slo Mo was slightly less approving of the Sega CD version for its video quality and its controls in the absence of a six-button controller. Dean of Sega Power was more positive about the game and called the video some of the best seen in a full-motion video game, but was critical of the game's high difficulty.\nReviews for the 32X version were improved over the Sega CD. Electronic Gaming Monthlys review team considered the 32X version's video positive and its gameplay negative, just as they had done with the 3DO. The same sentiments were shared by Francis of  , who also praised the video but stated that finding opportunities to attack is a problem. Slo Mo's review of the 32X version in GamePro praised it as having better graphics than the Sega CD version, and otherwise repeated his previous comments in other versions on the difficult but rewarding gameplay.\nReferences\nExternal links\n*"
    }
  ]
}