{
  "content": [
    {
      "type": "text",
      "text": "# Suresh Warpudkar\n\n| birth_place = Varpud, Parbhani, Hyderabad State, (present-day Maharashtra, India)\n| nationality =\n| party          = Bharatiya Janata Party\n| otherparty     = Indian National Congress ,  Nationalist Congress Party\n| spouse =\n| partner =\n| residence = Parbhani, Maharashtra, India\n| education = BSc Agriculture\n| alma_mater = Marathwada Krishi Vidyapeeth, Parbhani\n| occupation = Farmer, politician, and social worker\n| profession =\n| known_for =\n| cabinet =\n| committees =\n| portfolio =\n| religion =\n| awards =\n| website =\n| footnotes =\n}}\nSuresh Ambadasrao Warpudkar (born 15 July 1951) is an Indian politician who was the member of Maharashtra Legislative Assembly for five term from Pathri and Singnapur vidhan sabha as an Indian National Congress candidate. He was also a minister of state in Government of Maharashtra and Member of Parliament in 1998 from Parbhani. Suresh Warpudkar is a senior most Congress leader from Parbhani district and had join BJP in July 2025 ahead of the civic body and Zilla Parishad elections in the state.\nEarly life and education\nWarpudkar was born on 15 July 1951 in Warpud village of Parbhani District. His father, Ambadasrao Warpudkar was a farmer.\nWarpudkar received his initial schooling from Warpud, He then transferred to Parbhani town, where he received most of his schooling and completed BSc in Agriculture\nfrom Marathwada Krishi Vidyapeeth in 1972.\nPersonal life\nWarpudkar married Meena Warpudkar on 29 June 1974, with whom he has a son and two daughters. His wife was mayor of Parbhani Municipal Corporation.\nPositions held\n* Member of Maharashtra Legislative Assembly (MLA) for Singnapur Assembly constituency 1986–1999 (3 terms)\n* Member of Maharashtra Legislative Assembly (MLA) for Singnapur Assembly constituency 2004–2009\n* Member of Indian Parliament for Parbhani (Lok Sabha constituency) 1998–1999.\n* Member, Committee on Science and Technology 1998–1999\n* Environment and Forests; and its Sub-Committee on Ganga Action Plan 1998–1999\n* Member, Consultative Committee, Ministry of Labour 1998–1999\n* Special Invitee, Consultative Committee, Ministry of Agriculture 1998–1999\n* Minister of state in Government of Maharashtra for agriculture 2008–2009\n* Chairman, Parbhani Distt. Central Co-operative Bank Ltd., Parbhani\n* Narshinha Sosuk Ltd. Luhgoan, Parbhani District\n* Director, Maharashtra State Co-operative Bank, Mumbai\n* Currently District President Nationalist Congress Party, Parbhani\nReferences"
    }
  ]
}