{
  "content": [
    {
      "type": "text",
      "text": "# Surprise Attack - Tunnel Warfare\n\n| image          =\n| alt            =\n| caption        =\n| director       = 项秋良 Xiang Qiuliang,  项河生 Xiang Hesheng\n| producer       =\n| writer         =\n| starring       =\n| music          =\n| cinematography =\n| editing        =\n| studio         =\n| distributor    =\n| released       =\n| runtime        = 88 minutes\n| country        = China\n| language       = Mandarin\n| budget         =\n| gross          =\n}}\nSurprise Attack – Tunnel Warfare (Chinese: 奇袭·地道战) is a 2020 film released online in China about a fictional story based upon the actual history of tunnel warfare that was used by Chinese partisans against Japanese occupational soldiers in World War 2.\nJapanese forces are doing sweeps of the North China Plain during World War II. A young student from Beiping named Ye Cheng comes to a village to help the communist partisans fighting against the Japanese. Using his knowledge, he helps perfect and improve their tunnel systems which they are using to hide from and ambush the Japanese when they come to the village. They fight several battles with the Japanese, and in the final battle, they succeed in destroying a tower the enemy was using.\nPlot\nJapanese forces are doing sweeps of the North China Plain during World War II. Some villagers use tunnels to hide themselves and ambush the Japanese soldiers. Nagano(Changye in Chinese) is the Japanese commander who is leading his soldiers to do these sweeps.\nA young student who studied in Beiping named Ye Cheng comes home to his village with the intention of becoming a teacher. He rides on a cart with his father, Ye Fugui, and a few others in the countryside. They then spot a group of Chinese villagers fleeing from pursuing Japanese soldiers. One of the villagers is holding a package. Ye Cheng decides to help them .\nThe Chinese villagers arrive back at the village. One of them Sun Xiaorong, is the sister of one of the partisan leaders in the village Sun Dachun. She brings the package containing medical supplies to the communist party commissar Ma Fu, who directs her to use them for the wounded. Her brother Sun Dachun arrives and is upset that he did not know about her mission where she put herself in danger. Ye Cheng and his father then arrive and meets Sun Dachen, who he knew as a child. Ye Cheng meets the commissar and announces his intention to become a teacher in the village. The commissar tells him that the previous teacher was killed by the Japanese three years prior and that the war has made it impossible to have classes. The commissar says that the partisans need intellectuals like him. Sun Dachun objects and does not want Ye Cheng to join the partisans. Ye Cheng tells Sun Dachun that he did not say that he wanted to join. He later meets Sun Xiaorong, who he recognized as being the villager he helped, but did not realize it was her, who he knew as a child. She tells him that she has studied to be a nurse and was helping the partisans.\nAt the Japanese camp, a new commander named Nakamura (Zhongcun in Chinese) arrives to help with the special warfare in engaging the villagers who are using tunnel warfare to fight the Japanese.\nYe Cheng takes over the eastern tunnels and gets the partisans to remake the tunnels according to his own design, including traps, hidden passages and other methods to lure the Japanese soldiers into ambushes when they try to enter the tunnels.\nThe Japanese soldiers under Nakamura make an attack on the village. They overwhelm the defenders in the western tunnels, who are forced to move to the eastern tunnels. When the Japanese soldiers enter the eastern tunnels designed by Ye Cheng, they are killed by the traps. When Nagano is hit by a trap containing poison gas canisters that the Japanese had used on the village earlier, Nakamura pulls off the attack and makes the Japanese retreat.\nMa Fu hosts a meeting of the partisans to talk about their plans. Ye Cheng arrives and tells the partisans an idea of his. There is an abandoned coal mine underneath the main Japanese base and he believes that a lot of natural gas will be trapped inside some parts of the mine. If they can get the gas to explode underground, it may destroy the Japanese base.\nThe partisans follow the plan. Many of the partisans are killed by the Japanese in the battle. Xiao Chou blows himself up with a grenade in order to kill Nagano who is beating him. Sun Dachun sacrifices himself to blow up the gas. The explosion destroys the tower containing the Japanese ammunition that leads to the destruction of the Japanese base. Nakamura is killed in the explosion.\nAfter the battle is over, villagers find the earpiece that Nakamura used as a hearing aid and concluded he was killed. In another scene in the future, an old man, possibly an older Ye Cheng, has his son in a field where he has put up a sign on a scarecrow that reads '小心陷阱' (beware of traps).\nCast\n{|class=\"wikitable\" width=\"57%\"\n|- style=\"background:cornflowerblue; color:white\" align=center\n|style=\"width:3%\"|Actor||style=\"width:7%\"|Character\n|-\n|刘林城/Liu Lincheng||叶成 /Ye Cheng\n|-\n|邵芸/Shao Yun|| 孙小茸/Sun Xiaorong\n|-\n|刘亚津/Liu Yajin|| 叶富贵/Ye Fugui\n|-\n|雪村/Xue Cun ||马夫/Ma Fu\n|-\n|徐宁 /Xu Ning|| 孙大春/Sun Dachun\n|-\n|王泽宗/Wang Zezong|| 长野/Chang Ye\n|-\n|徐绍航 /Xu Shaohang|| 中村/Zhong Cun\n|-\n|戎威峰/Rong Weifeng|| 老七/Lao Qi\n|-\n|Wang Hongqian/王洪千/|| 黑子/Hei Zi\n|-\n|朱新凡/Zhu Xinfan/||老马/Lao Ma\n|-\n|吴豪/Wu Hao||石头/Shi Tou\n|-\n|雪晴/Xue Qing||胖妞/Pang Niu\n|-\n|陈霄航/Chen Xiaohang||小叶成/Child Ye Cheng\n|-\n|马福胜/Ma Fusheng||日军翻译官/Japanese Interpreter\n|-\n|郑昌永/Zheng Changyong||老李/Lao Li\n|-\n|张建东/Zhang Jiandong||吹口琴小男孩/Little Boy the harmonica\n|-\n|尹永山/Yin Yongshan||老伯/Old man\n|-\n|刘立菊/Liu Liju||村妇/Village mom\n|-\n|尹立瑜/Yin Liyu||奶奶/Grandmother\n|-\n|史洪林/Shi Honglin||孙子/Grandson\n|-\n|范成成/Fan Chengcheng||女子甲/Woman A\n|-\n|魏焱/Wei Yan||女子乙/Woman B\n|-\n|袁李羿宸/Yuanli Yichen||马夫孙女/Mav Granddaughter\n|-\n|霍钰/Huo Yu||武工队/Armed Forces\n|-\n|}\nRelease\nThe film was released in China online in 2020 while China was still grappling with the aftermath of the pandemic that had spread throughout the country in the earlier part of the year, during which theatres were widely closed. It was released as a feature on Youku.com, one of the largest video sharing sites in China and in the world. The production company \"Rabbit Hole\" (兔子洞文化) relied on a word of mouth strategy for publicity for the film. Prior to its release, Rabbit hole organized viewings both online and offline, including to communist party youth and emergency personnel.\nReception\nAccording to an article on Tencent news, the film received high reviews from critics in viewings before it was released on the internet. The article claimed that the internet film was an unprecedented example of a commercial internet movie and that it focused more on the emotional transformations rather than on a hunt for novelties.\nReferences\nExternal links\n*"
    }
  ]
}