{
  "content": [
    {
      "type": "text",
      "text": "# Susan Hayward\n\n| birth_place        = Brooklyn, New York, U.S.\n| death_date         =\n| death_place        = Beverly Hills, California, U.S.\n| resting_place      = Our Lady of Perpetual Help Cemetery  Carrollton, Georgia\n| occupation         = Actress\n| years_active       = 1937–1972\n| notable_works      = Full list\n| spouse             =\n*\n}}\n| children           = 2\n| awards             = Full list\n}}\nSusan Hayward (born Edythe Marrener; June 30, 1917 – March 14, 1975) was an American actress best known for her film portrayals of women that were based on true stories.\nAfter working as a fashion model for the Walter Thornton Model Agency, Hayward traveled to Hollywood in 1937 to audition for the role of Scarlett O'Hara. She secured a film contract and played several small supporting roles over the next few years.\nBy the late 1940s, the quality of her film roles improved, and she achieved recognition for her dramatic abilities with the first of five Academy Award for Best Actress nominations for her performance as an alcoholic in Smash-Up, the Story of a Woman (1947). Hayward's success continued through the 1950s as she received nominations for My Foolish Heart (1949), With a Song in My Heart (1952), and ''I'll Cry Tomorrow (1955), winning the Academy Award for her portrayal of death row inmate Barbara Graham in I Want to Live! (1958). For her performance in I'll Cry Tomorrow'' she won the Cannes Film Festival Award for Best Actress.\nAfter Hayward's second marriage and subsequent move to Georgia, her film appearances became infrequent; although she continued acting in film and television until 1972. She died in 1975 of brain cancer.\nEarly life\nHayward was born Edythe Marrener on June 30, 1917, in the Flatbush neighborhood of Brooklyn, New York, the youngest of three children to Ellen (née Pearson) and Walter Marrener. Her mother was of Swedish descent. She had an older sister, Florence, and an older brother, Walter Jr. In 1924, Marrener was hit by a car, suffering a fractured hip and broken legs that put her in a partial body cast with the resulting bone setting leaving her with a distinctive hip swivel later in life.\nShe was educated at Public School 181 and graduated from the Girls' Commercial High School in June 1935 (later renamed Prospect Heights High School). According to the Erasmus Hall High School alumni page, Hayward attended that school in the mid-1930s, although she only recollected swimming at the pool for a dime during hot summers in Flatbush, Brooklyn. During her high school years, she acted in various school plays, and was named \"Most Dramatic\" by her class.\nCareer\nMarrener began her career as a model, traveling to Hollywood in 1937 to try out for the role of Scarlett O'Hara in Gone with the Wind. Though Hayward did not get the part, she was used for other actors' screen tests by David Selznick and received a contract at Warner Bros.\nWarner Bros.\nTalent agent Max Arnow changed Marrener's name to Susan Hayward once she started her six-month contract for $50 a week with the Warner Bros. movie studio. Hayward had bit parts in Hollywood Hotel (1937), The Amazing Dr. Clitterhouse (1938) (her part was edited out), and The Sisters (1938), as well as in a short, Campus Cinderella (1938).\nHayward's first sizeable role was with Ronald Reagan in Girls on Probation (1938), where she was a strong 10th in billing. She was also in Comet Over Broadway (1938), but returned to unbilled and began posing for pinup \"cheesecake\" publicity photos, something she and most actresses despised, but under her contract she had no choice. With Hayward's contract at Warner Bros. finished, she moved on to Paramount Studios.\nParamount\nIn 1939, Paramount Studios signed her to a $250 per week contract. Hayward had her first breakthrough in the part of Isobel in Beau Geste (1939) opposite Gary Cooper and Ray Milland. She held the small, but important, haunting love of youth role as recalled by the Geste brothers while they searched for a valuable sapphire known as \"the blue water\" during desert service in the Foreign Legion; the film was hugely successful.\nParamount put Hayward as the second lead in Our Leading Citizen (1939) with Bob Burns and she then supported Joe E. Brown in $1000 a Touchdown (1939).\nHayward went to Columbia for a supporting role alongside Ingrid Bergman in Adam Had Four Sons (1941), then to Republic Pictures for Sis Hopkins (1941) with Judy Canova and Bob Crosby. Back at Paramount, she had the lead in a \"B\" film, Among the Living (1941) alongside Albert Dekker and Frances Farmer.\nCecil B. De Mille gave her a good supporting role in Reap the Wild Wind (1942), to costar with Milland, John Wayne and Paulette Goddard. She was in the short A Letter from Bataan (1942) and supported Goddard and Fred MacMurray in The Forest Rangers (1942).\nUnited Artists and Republic\nHayward costarred in I Married a Witch (1942) with Fredric March and Veronica Lake, as the fiancé of Wallace Wooly (March) before Lake's witch reappears from a Puritanical stake burning 300 years earlier. The film served as inspiration for the 1960s TV series Bewitched and was based on an unfinished novel by Thorne Smith. It was made for Paramount but was sold to United Artists. She was next in Paramount's all-star musical review Star Spangled Rhythm (1943) that also featured its nonmusical contract players.\nHayward appeared with William Holden in Young and Willing (1943), a Paramount film distributed by UA. She was in Republic's Hit Parade of 1943 (1943), her singing voice dubbed by Jeanne Darrell.\nSam Bronston borrowed her for Jack London (1943) at UA. At Republic she was Wayne's love interest in The Fighting Seabees (1944), the biggest budgeted film in that company's history.\nShe starred in the film version of The Hairy Ape (1944) for UA. Back at Paramount she was Loretta Young's sister in And Now Tomorrow (1944). She then left the studio.\nRKO gave Hayward her first top billing in Deadline at Dawn (1946), a Clifford Odets written Noir film, which was Harold Clurman's only movie as director.\nWalter Wanger and stardom\nAfter the war, Hayward's career took off when producer Walter Wanger signed her for a seven-year contract at $100,000 a year. Her first film was Canyon Passage (1946).\nIn 1947, she received the first of five Academy Award nominations for her role as an alcoholic nightclub singer based on Dixie Lee in Smash-Up, the Story of a Woman, her second film for Wanger. Although it was not well received by critics, it was popular with audiences and a box office success, launching Hayward as a star.\nRKO used her again for ''They Won't Believe Me (1947). She subsequently worked for Wanger on The Lost Moment (1948) and Tap Roots (1948). Both films lost money but the latter was widely seen.\nAt Universal Hayward was in The Saxon Charm (1948) and she did Tulsa (1949) for Wanger. Both films were commercial disappointments.\n20th Century Fox\nHayward went over to 20th Century Fox to make House of Strangers (1949) for director Joseph Mankiewicz, beginning a long association with that studio.\n(1951)]]\nSam Goldwyn borrowed her for My Foolish Heart (1949), which earned her an Oscar nomination, then she went back to Fox for ''I'd Climb the Highest Mountain (1951), which was a hit.\nShe stayed at that studio to make the western Rawhide (1951) with Tyrone Power, and the romantic drama I Can Get It for You Wholesale (1951).\nHayward then starred in three massive successes: David and Bathsheba (1951) with Gregory Peck, the most popular film of the year; With a Song in My Heart (1952), a biopic of Jane Froman, which earned her an Oscar nomination; and The Snows of Kilimanjaro (1952), with Peck and Ava Gardner.\nRKO borrowed Hayward for The Lusty Men (1952) with Robert Mitchum, then she went back to Fox for The President's Lady (1953), playing Rachel Jackson alongside Charlton Heston; White Witch Doctor (1953) again a co-star with Mitchum; Demetrius and the Gladiators (1954), as Messalina; Garden of Evil (1954) with Gary Cooper and Richard Widmark; and Untamed (1955) with Tyrone Power. Hayward then starred with Clark Gable in Soldier of Fortune (1955), a CinemaScope film that was a box office miss.\nPeak\nMGM hired Hayward to play the alcoholic showgirl/actress Lillian Roth in I'll Cry Tomorrow'' (1955), based on Roth's best-selling autobiography of the same title, for which she received a Cannes award. It was a major financial success.\nAlthough Hayward never truly became known as a singer—she disliked her own singing–she portrayed singers in several films. However, in ''I'll Cry Tomorrow—whose vocals were once widely attributed to professional ghost singer Marni Nixon—Hayward sang the vocals undubbed and appears on the soundtrack. Hayward performed in the musical biography of singer Jane Froman in the 1952 film, With a Song in My Heart'', a role which won her the Golden Globe for Best Actress In A Leading Role – Musical Or Comedy. Jane Froman's voice was recorded and used for the film as Hayward acted out the songs.\n(1958)|234x234px]]\nIn 1956, she was cast by Howard Hughes to play Bortai in the historical epic The Conqueror'', as John Wayne's leading lady. It was critically deprecated but a commercial success. She did a comedy with Kirk Douglas, Top Secret Affair (1956) which flopped.\nHayward's last film with Wanger, I Want to Live! (1958), in which she played death row inmate Barbara Graham, was a critical and commercial success and won Hayward the Academy Award for Best Actress for her portrayal. Many movie pundits have referred to her performance in I Want to Live! as the greatest Hollywood acting performance by any actress at any time. Bosley Crowther of The New York Times wrote that her performance was \"so vivid and so shattering ... Anyone who could sit through this ordeal without shivering and shuddering is made of stone.\" Hayward received 37% of the film's net profits.\n(1961)]]\nDecline as star\nHayward made Thunder in the Sun (1959) with Jeff Chandler, a wagon train picture about French Basque pioneers, which was a modest success financially, and then Woman Obsessed (1959) at Fox.\nIn 1961, Hayward starred as a shrewd working girl who becomes the wife of the state's next governor (Dean Martin) and ultimately takes over the office herself in Ada. The same year, she played Rae Smith in Ross Hunter's lavish remake of Back Street, which also starred John Gavin and Vera Miles. Neither film was particularly successful; nor were I Thank a Fool (1962) at MGM, Stolen Hours (1963), and Where Love Has Gone (1964), which co-starred Bette Davis.\nLater career\nHayward was reunited with Joseph Mankiewicz in The Honey Pot (1967). Then she replaced Judy Garland as Helen Lawson in the film adaptation of Jacqueline Susann's Valley of the Dolls (1967), which drew terrible reviews but made money at the box office.\narriving at the Motion Picture & Television Fund in 1971, four years before her death]]\nShe received good reviews for her performance at Caesars Palace in the Las Vegas production of Mame that opened in December 1968. She was replaced by Celeste Holm in March 1969 after her voice gave out and she had to leave the production.\nShe continued to act into the early 1970s, when she was diagnosed with brain cancer.\nShe appeared in the TV movie Heat of Anger (1972) and the western film The Revengers (1972) with William Holden.\nHer final film role was as Dr. Maggie Cole in the 1972 made-for-TV drama Say Goodbye, Maggie Cole. Intended to be the pilot episode for a television series, \"Maggie Cole\" was never produced because of Hayward's failing health. Her last public appearance was at the Academy Awards telecast in 1974 to present the Best Actress award despite being very ill. With Charlton Heston's support, she was able to present the award.\nPersonal life\non March 21, 1956]]\nDuring World War II, Hayward supported the war effort by volunteering at the Hollywood Canteen, where she met her first husband, actor Jess Barker. They married on July 23, 1944, and in early 1945 fraternal twin sons were born. The marriage was turbulent, with a judge granting an interlocutory divorce decree on August 17, 1954. During the contentious divorce proceedings, Hayward stayed in the United States rather than join the Hong Kong location shoot for the film Soldier of Fortune. She shot her scenes on a sound stage with co-star Clark Gable in Hollywood. A few brief, distant scenes of Gable and a Hayward double walking near landmarks in Hong Kong were combined with the indoor shots. By April 1955, the stress of divorce proceedings and overwork prompted Hayward to attempt suicide by overdosing on sleeping pills. After taking the pills, she quickly regretted her decision and, in a panic, called her mother, who sent for the police; they had to break down the back door to reach her. Several months later, Hayward got into a violent fight with actress Jil Jarmyn after the latter found Hayward with her boyfriend, Donald Barry in his bedroom. When confronted about the fight, Hayward replied, \"I'm red-haired and Irish, you know, and I don't let anybody call me names.\"\nIn 1957, Hayward married Floyd Eaton Chalkley, commonly known as Eaton Chalkley, a successful Georgia rancher and businessman who had worked as a federal agent. The marriage was a happy one. They lived on a farm near Carrollton, Georgia, and owned property across the state line in Cleburne County, just outside Heflin, Alabama. She became a popular figure in the area in the late 1950s. Chalkley died on January 9, 1966 due to a brain tumor. Hayward went into mourning and did little acting for several years. She took up residence in Florida, because she preferred not to live in her Georgia home without her husband. On June 30, 1966, she was baptized Catholic by Father Daniel J. McGuire at SS. Peter and Paul's Roman Catholic Church in the East Liberty section of Pittsburgh. Hayward had met McGuire, an acquaintance of Chalkley, in Rome eight years prior.\nBefore her Catholic baptism, Hayward had been a proponent of astrology. She particularly relied on the advice of Carroll Righter, who called himself \"the Gregarious Aquarius\" and the self-proclaimed \"Astrologer to the Stars\", who informed her that the optimal time to sign a film contract was exactly 2:47&nbsp;a.m., prompting her to set her alarm for 2:45 so she could be sure to follow his instructions.\nDeath\n'', by artist Nicholas Volpe|left|249x249px]]\nHayward's doctor found a lung tumor in March 1972 that metastasized and, after a seizure in April 1973, she was diagnosed with brain metastasis. On March 14, 1975, she suffered a seizure in her Beverly Hills home and died at the age of 57. A funeral service was held on March 16 at Our Lady of Perpetual Help Roman Catholic Church in Carrollton, Georgia, which Hayward and Chalkley had helped organize. Hayward's body was buried in the church's cemetery, beside her husband's. According to her wishes, her name was inscribed as \"Mrs. F. E. Chalkley\" instead of \"Susan Hayward\". However, in the 2010s, a plaque bearing the name \"Susan Hayward\" was installed.\n]]\nTheories about the radioactive fallout from atmospheric atomic bomb tests surround the making of The Conqueror in St. George, Utah. Several production members, including Hayward, John Wayne, Agnes Moorehead, Pedro Armendáriz (who died by suicide after a diagnosis of cancer), and director Dick Powell later succumbed to cancer and cancer-related illnesses. As ascertained by People magazine in 1980, out of a cast and crew totaling 220 people, 91 of them developed some form of cancer, and 46 had died of the disease.\nThe question is still open as to whether high residual radiation levels after the above ground nuclear explosions in Yucca Flat, only  from the set of The Conqueror, led directly to her relatively early death.\nSusan Hayward has a star on the Hollywood Walk of Fame at 6251 Hollywood Boulevard.\nFilmography and awards\nSee also\n* List of notable brain tumor patients\nReferences\nFurther reading\n*\nExternal links\n*\n* [https://m.imdb.com/name/nm0001333/awards/?ref_=nm_awd Susan Hayward Awards at iMDb]\n*\n*\n* [http://www.straightdope.com/classics/a2_016.html Article about the radioactive film set]  (from The Straight Dope)\n* [https://web.archive.org/web/20060806024844/http://susanhayward.fashionstate.com/ Susan Hayward @ FashionState.com]\n* [http://film.virtual-history.com/person.php?personid=1604 Photographs and bibliography]\n* [http://uwg.galileo.usg.edu/uwg/view?docId=ead/LH-0034-ead.xml;query=;brand=default Susan Hayward collection at the University of West Georgia]\n}}"
    }
  ]
}