{
  "content": [
    {
      "type": "text",
      "text": "# Suvarnapura Kingdom (Chen Li Fu)\n\nAsadvarapura\n| p2                     = Kamalanka\n| s1                     = Suphannabhum\n| s2                     = Ayutthaya KingdomAyutthaya\n| image_map              = Polities of Chen Li Fu Kingdom.png\n| image_map_caption      = Lower Menam Valley in the 13th century, shows the key polities under Chen Li Fu (number 1 – 16) as well as its small settlements (brown pogs), as proposed by Walailak Songsiri.\n| image_map2             =\n| image_map2_caption     =\n| capital                = Phraek Si Racha\n| common_languages       =\n| religion               = Theravada Buddhism\n| government_type        = Kingdom\n| leader1                = Fang-hui-chih\n| year_leader1           = 1180–1204\n| leader2                = Mahīđharavarman III\n| year_leader2           = 1204–1225\n| title_leader           = Monarch\n}}\nSuvarnapura Kingdom or Chên Li Fu () or Zan Lei Fu in Cantonese, was a short-lived political entity located on the north shore of the Gulf of Siam, west of Chenla. It was centered at Phraek Si Racha in present-day Central Thailand, with its sphere of influence extending across the western Chao Phraya Basin, reaching as far south as the modern provinces of Phetchaburi  and Prachuap Khiri Khan,  bordering Po-Ssu-lan to the southeast and Tambralinga to the south. Chên Li Fu sent tribute to the Chinese court in 1200, 1202, and 1205. Later, it was merged into the Ayutthaya Kingdom in the 14th century. Notably, the character chên  is pronounced \"zan1\" in Cantonese, which sounds a lot like the first character in the term sān luò () mentioned in Lingwai Daida in 1178, the term that Lawrence P. Briggs speculated to have been an early Chinese attempt to transcribe the name of the country or the people of the Menam basin.\nBefore the rise of Angkor, Chên Li Fu was believed to have been one of the principal polities within the Dvaravati cultural sphere, alongside the Lavo Kingdom in the eastern basin.  O. W. Wolters, whose interpretation was strongly influenced by George Cœdès’ framework of Southeast Asian history, proposed that Chên Li Fu likely became a vassal state of, or came under the influence of, Angkor around the 12th century. However, Songsiri contends that during this period Chên Li Fu may have autonomous status but has close dynastic connections with the Mahidharapura Kingdoms in the Phimai region—contrasting with its eastern neighbor, Lavo, which was fully incorporated into the Angkorian domain.  Some scholars generally identify Chên Li Fu with the Siamese polity of Suphannabhum; however, this contrasts with the account preserved in the Northern Chronicle, which records that Suphannabhum was ruled by anoother line of monarchs during this period.\nAs mentioned in the Nakhòn Si Thammarat source, Chên Li Fu was incorporated into the Kingdom of Phrip Phri in 1225 by King Mahesvastidrādhirājakṣatriya, who also expanded his territory further northward to Phraek Si Racha, the northern limit of Chên Li Fu, and was then merged into Ayodhya, which was ruled by Mahesvastidrādhirājakṣatriya's son, Uthong II.\nLocation\nO. W. Wolters suggests Chên Li Fu was potentially located on the east coast of the Gulf of Siam in Chanthabun area or in the Mae Klong Valley or both. For phonological reasons, Gerini stated emphatically that Chên Li Fu represented Candanapura or Chanthabun. Friedrich Hirth, W.W. Rockhill, and L.P. Briggs also accepted the identification, but George Cœdès cautiously describes it as being on the Gulf of Siam. Wolters disputed this identification, arguing that the short distance between Chanthabun and Yaśodharapura makes it improbable that Angkor had lost control of the area during that period. He further suggested that the site was more likely to correspond to Po-Ssu-lan, the southeastern neighbor of Chen Li Fu.\nWolters proposes that its center was at Mueang Uthong. If that is so, according to the archaeological found in Mueang Uthong, the kingdom might have existed since 300–600 CE. Nevertheless, Paul Wheatley posited that the site in question was the city-state of Chin Lin, the kingdom King Fan Man of Funan endeavored to annex during the 4th century. Wolters’ presupposition contrasts with the account preserved in the Northern Chronicle, which indicates that Mueang Uthong and Suphanburi during the time mentioned were under the rule of monarchs connected to the former Dvaravati polity centered at Nakhon Pathom.\nThai scholars Walailak Songsiri and  propose that Chen Li Fu was centered at Phraek Si Racha, with several subsidiary regional centers, including Suphanburi. This hypothesis situates Chen Li Fu within the same chronological framework as the early Siamese polities described in the Ayutthaya Testimonies, dating from the 9th to the 12th centuries. According to the French sources Du Royaume de Siam and Instructions Given to the Siamese Envoys Sent to Portugal (1684), Pra Poa Noome Thele Seri, a prince under the last monarch Anuraja, was initially relocated from Phraek Si Racha to northern cities around the 1150s before moving southward to the western regions of Suphannaphum in 1163 and Phrip Phri in 1188, as recorded in the Northern Chronicle. The Nakhon Si Thammarat Chronicle further notes that he later returned to Phraek Si Racha and annexed Chen Li Fu around 1225.\nHistory\nDvaravati period: before 1180\nThe Phraek Si Racha region constitutes a historically significant area whose cultural and political development can be traced back approximately 2,500 years. The earliest known reference to a polity in this locality concerns the Duō Miè Kingdom, which appears in Chinese court records as an autonomous realm said to have exercised authority over thirty subordinate states. Although not territorially extensive, the kingdom is understood to have supported a substantial population. Duō Miè dispatched a tributary mission to the Chinese court in 661 CE during the reign of King Māgha Shili (). Thereafter, however, the polity disappears from extant documentary sources. It is generally presumed that the region subsequently came under the suzerainty of the Lavo Kingdom during the peak of the Dvaravati cultural sphere between the late 7th and the 8th centuries, as the Northern Chronicle attests to Lavo influence extending as far as Kosambi (; possibly corresponding to Gān Bì), near present-day Kosamphi Nakhon.\nFollowing the decline of Dvaravati in the late 8th century, several polities within the Menam riverine system broke away from Lavo and began to send tributary embassies to the Chinese court independently. Among these entities was the Kingdom of Xiū Luó Fēn in the Phraek Si Racha region, ruled by Shidama Deva and identified as a polity of the Xiān. This kingdom appears to have maintained its autonomous status until 1180 CE, when it was conquered by a dynasty that may have had close genealogical or political ties to the Mahidharapura line associated with the Phimai and Angkor regions. Under the new ruling house, the polity was reorganized and reconstituted under the name Chen Li Fu.\nAngkorian influence: 1180–1224\n, Suphan Buri province in 1953, which was speculated to be Suvarnapura of Chen Li Fu. The area is now transformed into an agricultural area.]]\n, a successor of an ancient Suvarnapura.|260px]]\nChên Li Fu was mentioned in the Chinese text Sung Hui Yao Kao in 1200–1205. Its exact period of establishment is unclear. The Sung Hui Yao Kao says it is located in the southwestern corner, bordered by Po-Ssu-lan to the southeast and Teng-liu-mei (, Tambralinga) to the southwest. It is five days by sea travel to Po-Ssu-lan and takes another day to reach Chenla. It was the only trading center in the north of the gulf visited by Chinese ships at that time. The capital was situated inland and connected to the sea by the river. It takes 80 days of sea journey to reach Qingyuan of the Song.\nIn the early 13th century, the Chinese Sung court was no longer receiving envoys from Southeast Asian kingdoms and was discouraging them and their trading. Still, Chinese merchant ships were trading with Chên Li Fu during this period. On 23 September 1200, 20 years after his establishment of , the King of Chên Li Fu named Mo-lo-pa-kan-wu-ting-ên-ssŭ-li-fang-hui-chih (Kamrateng Sri Fang-hui-chih) sent senior palace officials to present a memorial for the Chinese court. The present included a gold-engraved scroll with the king's handwriting in black script, two elephants, and several local products. Due to the far distance, Chên Li Fu was informed by the Chinese emperor not to send any tribute.\nAccording to the regnal name of its king who used the Khmer title of Kamrateng, Chên Li Fu was regarded as a vassal of Khmer before sending envoys to the Chinese court in 1200, which was the year Khmer fell under Champa.  After that, Khmer declined in power, and the Menam Valley was dominated by Siamese people. Chên Li Fu then broke away. However, archaeological evidence indicates that Mueang Uthong was possibly abandoned around the 11th century, thus escaping from the Khmer influence that came to the most significant power in the 12th century during the reign of the Khmer king, Jayavarman VII. O. W. Wolters suggests Chên Li Fu was potentially an independent polity in the 13th century, which is consistent with the contemporary Pali chronicle Yonok says Khmer influences have waned from the Menam Valley since 1052 when it lost control over Lavapura of the Lavo Kingdom to Suphannabhum princes from Haripuñjaya. Several Xiān polities, mentioned by the number of Chinese and Đại Việt texts, have emerged in the area, such as Ayodhya, which has existed since the 1080s. In 1202, another envoy was sent. and again in 1205 by another ruler, Mahīđharavarman III.\nHowever, it is not clear yet that Chen Li Fu was a dependency of the Angkorian, since the 13th century ruler of its southern neighbor, Phip Phli, was also titled as Gan-mu-ding (which is equated to Kamrateng). Still, the city-state of Phip Phli was the vassal of the Sukhothai Kingdom and had a close dynastic relation with the Lavo's Ayodhya which was ruled by the Lavo (Uthong) dynasty that was previously more often in touch with the Angkorean than other regions in the Siam proper. The dynasty might have received the Ankorian norms of titling their local rulers.\nIt is more likely that the political center of this era was near the Nong Chaeng village in Sra Krachom subdistrict (), Don Chedi, Suphan Buri province, as there are traces of a large ancient city surrounded by a rectangular moat, and was speculated to be Suvarnapura, a city mentioned in the Prasat Phra Khan inscription (). Some propose that Suvarnapura was at the Nern Thang Phra Archaeological Site (), about 20 kilometers northeast of the Nong Chaeng village. Both location conforms with Jean Boisselier's assumption that the first Ayutthayan king, Ramathibodi I (Uthong V), came from the , near the Nong Chaeng and Nern Thang Phra where the traces of ancient cities were found, and then ascended the throne of Ayutthaya.\nTransitional era: 13th–14th century\nAfter sending an embassy to China in 1205, there was no additional record about Chen Li Fu. During this period, Angkorian influences in the Menam Valley waned. However, there were several records of new polities that emerged in the area, such as ''Pi-ch'a-pu-li'', which identified with Phetchaburi, led by Xian's king Gan-mu-ding, that sent an envoy to China in 1295  and Su-men-bang, which has been identified with Suphan Buri, led by Zhao Lu-qun Ying (Chao Nakhon In) who was also the crown prince of Xiān, that send anvoys to the Chinese court in 1377, 1396, and 1398.\nThe area was the vassals of Sukhothai Kingdom during the reign of Ramkhamhaeng (r. 1279 - 1298), then formed the city-state confederation with Lavo's Ayodhya, which led to the formation of the Ayutthaya Kingdom in the 14th century.\nSocial and economy\nChên Li Fu consisted of more than 60 settlements. Each has its administrator. The chief officials only use silver utensils and their tents are of flowered silk. The people tend to follow the law of the Buddha. When there is a dispute about grievances among them, (the parties) proceed to the Temple of the God of Potent Magic and drink the water of the Buddha in front of each other. He who remains at ease is considered to be telling the truth, while he who shows distress is considered to be lying.\nIts resources are ivory, rhinoceros horn, local beeswax, lakawood, foreign oil, coarse perfumes, cardamons, and ebony wood. The people are fond of dark red ganze and pottery, which are commodities that Chinese ships bring to them for commerce. For trade dealings in clothing and food, they use pieces of lead.\nThere seems to be no evidence to indicate the ethnic identity of the population. There must have been many Mons in the area. In the 16th century Tomé Pires, writing about Ayutthaya, regarded the population of 'Siam' as similar to that of Pegu in the Hanthawaddy kingdom:\nRulers\nThe rulers of Chên Li Fu were called by the Chinese Zhǔ (, ), not Wáng (; ). They lived in a palace resembling a Buddhist temple. All of the king's utensils are of gold. The tents are made of Chinese red floss silk. He wears white clothes as his privilege. His curtains are of white gauze interwoven with gold. When his officials come to court, they bow their heads and clasp their hands to salute him. The canopy over his curtains is 'dry' red. Beneath it is a madder-red one, a striped red one, and finally a green one. When (these people) use official documents they are bound together with black skin and the characters are written in white powder.\nThe copper plate dating from the 6th–mid 7th centuries found at U Thong also mentions King Harshavarman (หรรษวรมัน), who was assumed by Jean Boisselier to be one of the kings of Dvaravati, while George Cœdès considered the plate was brought from the Khmer Empire, and the name mentioned might be the Khmer king as well. However, the periods seem unrelated since King Harshavarman I of Khmer reigned from 910 to 923, 200 years after the inscription's date, and Harshavarman I's grandfather was Indravarman I, not Isanavarman as mentioned in the inscription.\nList of rulers\n{| class=\"wikitable\" style=\"font-size:95%;\"\n|-\n! colspan=5\n|-\n!colspan=5|Angkorian influenced-era: 1180–1224\n|-\n|Fang-hui-chih||1180–1204||rowspan=2|Suvarnapura (Potentially located at Phraek Si Racha region), with other centers at Nong Chaeng, Sra Krachom subdistrict, Don Chedi, Suphan Buri province||In 1165, Chen Li Fu's merchant died after arriving in China.\n|-\n|Mahīđharavarman IIISe-li-Mo-hsi-t’o-pa-lo-hung||1204–1224||\n*Son of the previous?\n*Angkor influences have waned.\n*Several Xiān polities emerged.\n*Annexed by Phip Phli in 1224.\n|-\n|-\n!colspan=5|Merged into Ayodhya since 1225\n|}\nReferences"
    }
  ]
}