{
  "content": [
    {
      "type": "text",
      "text": "# Sven Schwarz (swimmer)\n\nGermany\n| birth_date     =\n| birth_place    = Germany\n| death_date     =\n| death_place    =\n| height         =\n| weight         =\n| spouse         =\n| website        =\n| strokes        = Freestyle\n| club           = W98 Hannover\n| collegeteam    =\n| coach          =\n| module         =\n| show-medals    =\n| medaltemplates =\n}}\n}}\nSven Schwarz (born 31 January 2002) is a German competitive swimmer. He is the world junior record holder in the short course 800 metre freestyle, and the 2023 European under-23 champion over 800 metres (long course). He won a silver medal in the 4×200 metre freestyle relay and bronze medals in the 800 metre and 1500 metre freestyle at the 2019 European Junior Championships. In 2021, he won one bronze medal each in the 800 metre freestyle and 1500 metre freestyle at the 2021 European Short Course Championships. At the 2022 European Aquatics Championships (long course), he placed fifth in the final of the 800 metre freestyle.\nBackground\nSchwarz was born 31 January 2002 in Germany. He competes for swim club W98 Hannover.\nCareer\n2019\n2019 European Junior Championships\nFor his first medal of the 2019 European Junior Swimming Championships, held at the Palace of Water Sports in Kazan, Russia in early July, Schwarz won the bronze medal in the 1500 metre freestyle with a time of 15:09.41, finishing behind a gold-silver medal finish by two Russian swimmers. Schwarz won his second medal on 5 July, splitting a 1:49.04 for the second leg of the Germany 4×200 metre freestyle relay and helping the relay achieve a silver medal-winning time of 7:18.31, which was less than two seconds slower than the gold medal-winning time of 7:16.49 swum by the Russian relay team. On Saturday 6 July, Schwarz posted a personal best time of 7:53.74 in the 800 metre freestyle, earning the bronze medal in the event behind two Russians, only one of which had also finished ahead of him in the 1500 metre freestyle, and making the only swimmers Schwarz finished behind in all three events he medaled in Russian, that is, the only swimmers faster than Schwarz in the events were Russian.\n2019 German Championships\nAt the 2019 German Short Course Championships in Berlin in November, Schwarz swam a personal best time in the short course 800 metre freestyle of 7:36.00, which earned him the silver medal in the event behind Florian Wellbrock and set a new world junior record in the event, breaking the mark of 7:41.51 established by FINA for the event in 2014.\n2021\n2021 Swimming World Cup: Berlin\nOn day one of competition at the 2021 FINA Swimming World Cup stop in Berlin, 1 October, Schwarz swam a 3:45.86 in the prelims heats of the 400 metre freestyle and qualified for the final ranked seventh overall. In the final of the event later the same day, Schwarz finished sixth with a time of 3:44.90. The second day, Schwarz won the bronze medal in the 1500 metre freestyle timed final in 14:45.83. On the third and final day of competition, Schwarz ranked 27th overall in the prelims heats of the 200 metre freestyle with his time of 1:49.65 and did not advance to the final.\n2021 European Short Course Championships\nAt the 2021 European Short Course Swimming Championships in Kazan, Russia in November, Schwarz ranked sixth in the prelims heats of the 1500 meter freestyle on 3 November with a time of 14:41.74 and qualified for the final the following day. In the final, he swam a 14:26.24 and earned the bronze medal in the event, finishing behind gold medalist Florian Wellbrock, also of Germany, and silver medalist Gregorio Paltrinieri of Italy. On 6 November, in the prelims heats of the 800 meter freestyle, Schwarz qualified for the final of the event ranked seventh overall with his time of 7:39.07. The final day of competition, 7 November, he won the bronze medal in the event, finishing after gold medalist Gregorio Paltrinieri and silver medalist Florian Wellbrock with a time of 7:33.85.\n2022\nThrough 30 March for the 2022 year, Schwarz ranked in the global top five for the long course 800 metre freestyle, second, and long course 400 metre freestyle, fourth. In April, at the 2022 Berlin Swim Open, he lowered his best time in the 800 metre freestyle to a 7:46.64.\n2022 European Aquatics Championships\nSchwarz was named to the Germany roster for the 2022 European Aquatics Championships, held in August in Rome, Italy, in the 400 metre freestyle and 800 metre freestyle. In the preliminaries of the 800 metre freestyle on day two, he ranked sixth overall with a time of 7:49.30 and qualified for the final. He placed fifth in the final with a time of 7:47.36, finishing less than four seconds behind bronze medalist Lorenzo Galossi of Italy. In the preliminaries of the 400 metre freestyle on day seven, he placed tenth with a time of 3:49.58 and did not qualify for the evening final.\n2022 Swimming World Cup: Berlin\nFor his first of two individual events at the 2022 FINA Swimming World Cup held in Berlin and conducted in short course metres, Schwarz placed fifteenth in the 400 metre freestyle preliminary heats with a time of 3:46.02, which was 4.51 seconds slower than first-ranked Danas Rapšys of Lithuania. In his second event, the 1500 metre freestyle, he finished in a time of 14:34.87, which was 10.96 seconds faster than his time at the Swimming World Cup stop in Berlin one year prior, and won the bronze medal.\n2023\nOn 21 April 2023, at the Berlin Swim Open, Schwarz placed fifth in the 1500 metre freestyle with a personal best time of 14:49.22. The following two days, he won bronze medals in the 800 metre freestyle, with a personal best time of 7:43.43 on 22 April, and the 400 metre freestyle, with a personal best time of 3:46.56 on 23 April.\nInternational championships (50 m)\n{| class=\"sortable wikitable\"\n! Meet\n! class=\"unsortable\"|400 freestyle\n! class=\"unsortable\"|800 freestyle\n! class=\"unsortable\"|1500 freestyle\n! class=\"unsortable\"|4×200 freestyle relay\n|- bgcolor=\"#DDDDDD\"\n| colspan=\"5\" align=\"center\"| Junior level\n|-\n| EYOF 2017 || align=\"center\"|7th ||  || align=\"center\"| ||\n|-\n| style=\"background:#ccccff\"| EJC 2019 || style=\"background:#fdffe7\"| || align=\"center\"| || align=\"center\"| || align=\"center\"|\n|- bgcolor=\"#DDDDDD\"\n| colspan=\"5\" align=\"center\"| Senior level\n|-\n| style=\"background:#ccccff\"| EC 2022 || align=\"center\"|10th || align=\"center\"|5th || style=\"background:#fdffe7\"| || style=\"background:#fdffe7\"|\n|}\nInternational championships (25 m)\n{| class=\"sortable wikitable\"\n! Meet\n! class=\"unsortable\"|800 freestyle\n! class=\"unsortable\"|1500 freestyle\n|-\n| style=\"background:#ccccff\"| EC 2021 || align=\"center\"| || align=\"center\"|\n|}\nPersonal best times\nLong course metres (50 m pool)\n{| class=\"wikitable\"\n|-\n! Event\n! Time\n! Meet\n! Location\n! Date\n! Ref\n|-\n| 400&nbsp;m freestyle\n| style=\"text-align:center;\" | 3:45.92\n| 2023 German Championships\n|\n| 9 July 2023\n| style=\"text-align:center;\" |\n|-\n| 800&nbsp;m freestyle\n| style=\"text-align:center;\" | 7:38.12 ER\n| 2025 German Championships\n| Berlin\n| 2 May 2025\n| style=\"text-align:center;\" |\n|-\n| 1500&nbsp;m freestyle\n| style=\"text-align:center;\" | 14:36.82\n| 2025 German Championships\n| Berlin\n| 4 May 2025\n| style=\"text-align:center;\" |\n|}\nShort course metres (25 m pool)\n{| class=\"wikitable\"\n|-\n! Event\n! Time\n! Meet\n! Location\n! Date\n! Ref\n|-\n| 400&nbsp;m freestyle\n| style=\"text-align:center;\" | 3:43.17\n| 2019 Germany International Meet\n| Berlin\n| 17 November 2019\n| style=\"text-align:center;\" |\n|-\n| 800&nbsp;m freestyle\n| style=\"text-align:center;\" | 7:33.85\n| 2021 European Short Course Championships\n| Kazan, Russia\n| 4 November 2021\n| style=\"text-align:center;\" |\n|-\n| 1500&nbsp;m freestyle\n| style=\"text-align:center;\" | 14:26.24\n| 2021 European Short Course Championships\n| Kazan, Russia\n| 7 November 2021\n| style=\"text-align:center;\" |\n|}\nSwimming World Cup circuits\nThe following medals Schwarz has won at Swimming World Cup circuits.\n{| class=\"wikitable\"\n|-\n! Edition !! Gold medals !! Silver medals !! Bronze medals !! Total\n|-\n| 2021 || style=\"text-align:center;\" | 0 || style=\"text-align:center;\" | 0 || style=\"text-align:center;\" | 1 || style=\"text-align:center;\" | 1\n|-\n| 2022 || style=\"text-align:center;\" | 0 || style=\"text-align:center;\" | 0 || style=\"text-align:center;\" | 1 || style=\"text-align:center;\" | 1\n|-\n! Total !! style=\"text-align:center;\" | 0 !! style=\"text-align:center;\" | 0 !! style=\"text-align:center;\" | 2 !! style=\"text-align:center;\" | 2\n|}\nWorld records\nWorld junior records\nShort course metres (25 m pool)\n{| class=\"wikitable\"\n|-\n! No.\n! Event\n! Time\n! Meet\n! Location\n! Date\n! Age\n! Status\n!\n|-\n| 1\n| 800&nbsp;m freestyle\n| style=\"text-align:center;\" | 7:36.00\n| 2019 German Short Course Championships\n| Berlin\n| 16 November 2019\n| style=\"text-align:center;\" | 17\n| style=\"text-align:center;\" | Current\n| style=\"text-align:center;\" |\n|}\nSee also\n* List of junior world records in swimming\n* List of European Short Course Swimming Championships medalists (men)\nReferences\nExternal links\n*"
    }
  ]
}