{
  "content": [
    {
      "type": "text",
      "text": "# Sverdrup's Fram expedition\n\n|end_location = Arctic Archipelago\n|end_date =\n|ships =\n|crew = |achievements=\n|route_image = Norwegian Arctic Expedition (1898—1902) map-ru.svg\n|route_image_caption =\n}}\n'''Sverdrup's Fram expedition (1898–1902)' took place in the Canadian Arctic Archipelago (Second Fram Voyage or Second Fram Expedition; Norwegian: Den andre Framekspedisjonen) under Otto Sverdrup. The expedition ship Fram'' was modernized to increase cargo capacity and to accommodate a crew of 16. Originally, the expedition was planned for the northern coast of Greenland, but weather and ice conditions prevented the realization of this plan, so Sverdrup decided to explore the southern part of Ellesmere Island. The Norwegian team discovered Sverdrup islands and completed the mapping of the southern part of Ellesmere Island and the northern part of Devon Island. In total, approximately  of islands were surveyed and mapped. Due to severe ice conditions, the fourth —unplanned— winter campaign took place in 1901–1902. Extreme weather conditions and uncertain plans led to the loss of two men in 1899.\nOtto Sverdrup declared all the territories discovered during the expedition as Norwegian possessions, but the government in Stockholm at the time did not claim them. In 1930, on behalf of Norway, Sverdrup turned over all materials and maps to Canada, which extended its sovereignty over the islands (nowadays the territory of Nunavut).\nOtto Sverdrup developed and systematized Norwegian methods and techniques of travel and survival in Arctic conditions during the 1898–1902 expedition. In many ways, Sverdrup's achievements served as the basis for Roald Amundsen's expedition to the South Pole in 1910–1911. The publication of the scientific report of the expedition, which took more than 20 years, was completed in 1930; a popular description of the expedition in two volumes of New Land, that was published by Sverdrup in 1903 and translated into English in 1904. Despite its success and great scientific achievements, Sverdrup's expedition was less well known than the first and third voyages of the Fram.\nPreparation\nGoals and plans\nThe rise of national consciousness in Norway and the success of the first Fram expedition led to a desire to expand Norway's presence in the High Arctic — the country became a center of polar research. The polar ambitions of Fridtjof Nansen, the first man to cross Greenland (1888) and the successful drifter in the ice of the central Arctic (1893–1896), went even further. Having set himself the task of reaching both the North and South Poles, he repeatedly consulted with Otto Sverdrup about the possibilities of new expeditions. Sverdrup agreed to play the role of wingman, ensuring the expedition team's delivery to the site.\nThe preliminary plan for the new expedition was ready by September 1896, when Nansen and Sverdrup had just arrived in Christiania (Oslo). During the unloading of the Fram at Lysaker Nansen proposed Sverdrup as the leader of the new long voyage.Sverdrup O. New land; four years in the Arctic regions / Translated from the Norwegian by E. H. Hearn. L. : Longmans, Green and Co, 1904. Vol. I. p. 1. The idea was suggested by the Fram's privateers, Axel Heiberg, and the brewers Ellef and Amund Ringnes. They also undertook the financing of the new expedition, which they originally wanted Nansen to lead, but he had just been reunited with his family and was also too busy with his scientific work — processing the data collected on the Fram.\nThe destination of the new expedition was Greenland, which at the end of the 19th century was almost completely unknown from its northern and northeastern coasts. The Fram was to pass through Davis Strait and on through Smith Sound, Kane Basin, Kennedy Channel, Hall Basin and Robeson Channel, possibly as far north as ice conditions would allow. Drifting through the ice was not anticipated. From the northernmost point reached by the ship, the dogsled team was to sail northeast along the northern tip of Greenland to the more explored eastern coasts of the island. They would also explore Peary Land, which the American explorer had discovered with Astrup in 1893 and which he considered a separate polar archipelago. The goal was not to conquer the North Pole, which Sverdrup emphasized on the very first page of his expedition report.\nSverdrup realized that this ambitious plan was practically unrealizable, as it was based on the assumption that ice conditions would be ideal. No ship could reach the northern coast of Greenland at that time, so Sverdrup reserved the right to change the route of the expedition if the ice conditions were unfavorable. The drift of 1893–1896 presented a lot of conclusions for the organization and equipment of the new expedition, repairs and modernization were needed and the ship, so Sverdrup scheduled the campaign for the summer of 1898. For the 1897 season, Captain Sverdrup took command of the tourist liner Lofoten to take travelers to Svalbard for hunting and to admire the Arctic scenery; his name also served as an advertisement for the armorer's company. Sverdrup also hoped to see the start of André's Swedish balloon expedition; the Fram crew had seen its members the previous year, 1896.\nFundings and equipment\n. Fram Museum]]\nAll expenses were borne by the Fram privateers: each contributed one third of the total. The total cost of the expedition was about 220,000 krones (12,000 pound sterling).Sverdrup O. New land; four years in the Arctic regions / Translated from the Norwegian by E. H. Hearn. L. : Longmans, Green and Co, 1904. Vol. II. p. 452. Sverdrup wrote almost nothing about the equipment of the expedition, except to say that everything was done as well as possible. Most of the scientific equipment and provisions for the 3 years ahead came from abroad.Sverdrup O. New land; four years in the Arctic regions / Translated from the Norwegian by E. H. Hearn. L. : Longmans, Green and Co, 1904. Vol. I. p. 2.\nAs the Fram was state property, the Storting allocated 20,000 krones (about £1,100) in 1897 to renovate the ship.Sverdrup O. New land; four years in the Arctic regions / Translated from the Norwegian by E. H. Hearn. L. : Longmans, Green and Co, 1904. Vol. I. pp. 1-2. The 1893–1896 expedition had shown that the living quarters were too cramped and uncomfortable, and the new tasks made it necessary to increase the crew to 16 men. The Fram's seaworthiness also left much to be desired: the hull, designed for ice pressure, was wobbly, the ship was capricious in steering, turning too quickly to the wind under sail, and also had a low speed. In July 1897, the Fram was towed to Colin Archer's shipyard in Larvik. All changes in the ship's design were justified by the shipbuilder himself. Sverdrup and Archer decided to add a deck on the upper deck from the engine room to the bow. The height of the freeboard was increased by 7 ft. The superstructure was about 20 meters long and 10 meters wide to accommodate the crew. A large wardroom (which was used as a dining room for the entire crew) and 6 cabins for the command and scientific staff were now organized in the upper room, and 10 men of the rank and file were accommodated in the old living quarters aft. The cabins were insulated both in the usual Fram manner (with deer wool) and with an innovation — a one-foot air gap filled with crushed cork. The holds had ceilings insulated with cork and cardboard to reduce condensation.\nThe forward saloon received natural light — a porthole was installed in the ceiling. The living quarters were heated by stoves in the cabins and ventilated by a chimney. The electrical equipment was removed in 1896, so the Fram was heated and lit by kerosene. A  high bulwark was added to improve the keel. The foremast was extended by  to match the length of the Bisan mast. The propulsion system (a 220-horsepower triple-expansion steam engine) remained unchanged. The boiler consumed about 2.8 tons of coal per day at maximum load. Measurements after the reconstruction showed that the tonnage of the Fram was 510 gross register tons, compared to 402 tons in 1893.\nCrew\nOf the participants of the previous expedition to the Arctic, Captain Sverdrup took only the harpooner P. Henriksen with him. Of the 16 members of the expedition, 11 were professional seamen from the merchant or military navy. Two were not Norwegian: they were scientists — the Danish zoologist Bai and the Swedish botanist Simmons. According to I. P. Magidovich, Swedrup managed to create \"a remarkably well-coordinated research team, the like of which was unknown in the history of the exploration of the Western Arctic\".\n# Otto Neumann Sverdrup — ship commander, chief of the expedition; the oldest member of the expedition (he was 43 years old).\n# Victor Baumann — First Assistant Commander, Lieutenant Commander of the Norwegian Navy (since 1895). He studied two years at the University of Berlin in the physics department; he had skills as a topographer and assistant in scientific observations.\n# Olaf Rones (Norwegian: Olaf Raanes) — navigator of the Fram. A fisherman from the Lofoten Islands, he passed the navigator's examination and served with the Vesteraalen Steamship Company.\n# Gunerius Ingvald Isachsen was a cartographer and first lieutenant in the cavalry.\n# Herman Georg Simmons was a botanist of Swedish nationality. He graduated from the Lund University, in 1895 participated in a botanical expedition to the Faroe Islands.\n# Edvard Bay was a zoologist of Danish nationality. He graduated from the University of Copenhagen and joined Eider's expedition to Greenland in 1891. He was not very fond of physical work, preferring to stay indoors, but was an accomplished skier and Sverdrup's constant companion on long-distance treks.\n# Johan Svendsen was a medical doctor. After graduating in 1893, he worked at Bergen Hospital and briefly as a ship's doctor on the Hamburg-America liners. For several years he practiced on the Lofoten Islands. On 10 June 1899, he shot himself. He was the only member of the expedition who had not undergone a medical examination.\n# Per Schei (Norwegian: Peder Elisæus Schei) was a geologist and mineralogist. He graduated from Christiania University in 1898.\n# Peder Leonard Hendriksen — harpooner, experienced Arctic skipper. Participated in the Fram expedition in 1893–1896.\n# Karl Olsen — chief engineer. Graduated from the engineering school with distinction in 1893.\n# Jacob Nodtvedt (Norwegian: Jacob Nødtvedt) — second engineer, stoker and handyman. Later he participated in Amundsen's expeditions to the Arctic in 1903–1906 and to the Antarctic in 1910–1912.\n# Ivar Fosheim — Hunter and sailor. A well-known sportsman in Norway at the time, he was the founder of a sanatorium in Valdres. Sverdrup added him to the crew as an experienced hunter and fisherman.\n# Adolf Lindstrom (Norwegian: Adolf Henrik Lindstrøm) — provision master and cook. He worked as a cook since his early youth and was first employed on the Fram during the return trip from Tromsø to Christiania in August–September 1896. Later he participated in Amundsen's expeditions to the Arctic in 1903–1906 and to the Antarctic in 1910–1912. He was an excellent cook and had a cheerful disposition, which contributed much to the psychological relief at the wintering grounds.\n# Sverre Hassel was a sailor. Served in the Norwegian Navy, an officer of the cadet corps in Horten. Later he participated in Amundsen's expedition to Antarctica in 1910–1912. The youngest member of the expedition, he was 22 years old when he left.\n# Rudolf Stolz — sailor. Before the expedition, he worked as a clerk and broker, but was determined to acquire the necessary skills, which he never did.\n# Ove Braskerud was a stoker. Like Fosheim and Stoltz, he had nothing to do with the navy before the expedition, but had skills as a mechanic and blacksmith. He died of severe pneumonia and lack of medical care (the ship's doctor was already dead) on 6 October 1899, at the age of 27.Sverdrup O. New land; four years in the Arctic regions / Translated from the Norwegian by E. H. Hearn. L. : Longmans, Green and Co, 1904. Vol. I. pp. 2-4.\nSverdrup's leadership style differed from Nansen's democracy and Amundsen's authoritarianism. According to his memoirs:\"We seldom saw a smile on his lips, and we seldom heard him laugh. It did not follow, however, that he was grouchy and grumpy. On the contrary, he was always friendly, giving orders, asking and answering in his usual calm manner. He was not one of those who inflamed others with his emotional impulse, but more than anyone else he was able to inspire confidence and firmness in people\".\nExpedition progress\n1898: arrival and first winter\n\" — no union sign]]\nWay to the Arctic\nOn 24 June 1898, exactly 5 years after the start of the first expedition, the Fram left Christiania for her second voyage. Despite the foggy, stormy weather, the departure was accompanied by great excitement, and the ship was initially followed by numerous escorts in boats and yachts. After a short stop in Kristiansand to recharge the supplies, the Fram set sail for the Atlantic Ocean. During the passage to Cape Farwell (the distance was 2700&nbsp;km), the ship was rocking heavily — it turned out that the modernization at Archer's shipyard had not reduced the ship's motions and tendency to yaw. The crew suffered greatly from seasickness, as they had on the maiden voyage. There were many icebergs south of Greenland, and the Fram  docked at one to replenish her fresh water supply — a melted lake was seen on the iceberg from a crow's nest.\nThey did not see Greenland until 18 July, and arrived at Egedesminde on 28 July, where they took on board 36 Eskimo huskies ordered by the Royal Greenland Company. Difficulties began immediately: the dogs, unleashed, put up a tremendous fight, three of them being mauled and devoured on the spot by their comrades-in-arms, while two dogs escaped. At Godhavn another 35 dogs and 36 tons of coal were taken.Sverdrup O. New land; four years in the Arctic regions / Translated from the Norwegian by E. H. Hearn. L. : Longmans, Green and Co, 1904. Vol. I. p. 19. There could have been more dogs, but Sverdrup learned of an epidemic and refused to buy any more. The total number of dogs on board (including subsequent losses) was 66. Sverdrup was pragmatic about the dogs: they were given work and food to keep them in shape at all times, but during the long sledging trips the weakened dogs served as food for other draught animals and sometimes for humans. The loss of dogs was compensated by their natural reproduction. The sled dogs' diet included walrus meat, dog breadcrumbs, and fish. Boxes were built at the wintering grounds to protect their coats from icing and freezing. Even if the dogs did not work in a sled, Sverdrup insisted on training them to get them used to their sled neighbors and the musher.\nOn 16 August, the Fram  reached a stretch of open water near the Eskimo village of Etah after six days of overcoming ice jams. On 17 August, at Cape York, Sverdrup even wanted to erect a monument to Eivin Astrup, an outstanding Norwegian polar explorer who died at a young age. At Cape Sabine, the Fram  encountered thick ice again. After entering Faulk Fjord, it became clear that it would not be possible to continue north. The crew immediately began baiting walruses, which were abundant in the area: the dogs, which were multiplying rapidly, needed a lot of food. On 21 August, a heavy storm forced them to seek shelter off Elsmere Island; they wintered in the newly opened \"harbor\" (Havn Fjord) off Johan Peninsula, and in Fort Juliana Bay in Rice Bay, 35 miles to the north, they set up a hunting camp and a store of frozen meat. Isachsen immediately set out on a scouting expedition to map the area, while the others hunted walrus and muskox, the latter of which Lindström had learned to process to remove its peculiar odor.\nFirst meeting with Peary\nOn 6 October, Sverdrup, Fosheim, and Bye went hunting at Fort Juliana. The zoologist and the captain were making breakfast when strangers appeared on the ice: it was Robert Peary and an Eskimo musher. The conversation was brief, Peary refused coffee and left in a hurry: according to him, the American expedition ship was two hours away. Sverdrup remembered:\nPeary's visit was the highlight of the day in our tent. We talked of nothing else, only of being lucky enough to shake hands with the famous polar explorer, although his visit was so brief that the guest did not even have time to take off his gloves.Sverdrup O. New land; four years in the Arctic regions / Translated from the Norwegian by E. H. Hearn. L. : Longmans, Green and Co, 1904. Vol. I. p. 61.\nIt is characteristic that Peary himself never mentioned this episode anywhere. This can be explained by the fact that Robert Peary, due to the peculiarities of his character and tasks, considered himself a monopolist in northern Greenland, Ellesmere and the Straits, and later on the North Pole, and was afraid that the Norwegians would become serious competitors. This led him to some rash actions during the polar night of 1898–1899.\nPreparation for winter\nThe polar night began on 16 October 1898. For the first time, Sverdrup began to practice short sledge trips, for which Fram  served as a reliable base; one of the purposes of these trips was to combine exploration of the immediate surroundings with transportation of hunting catches on board. From 1 November, Fram was prepared for winter: to reduce heat loss, the awning was stretched over the deck, the portholes were covered with tarpaulins and filled with snow. For the dogs, kennels were arranged on the snow: all this was tested during the voyage in the Arctic Ocean.Sverdrup O. New land; four years in the Arctic regions / Translated from the Norwegian by E. H. Hearn. L. : Longmans, Green and Co, 1904. Vol. I. p. 72. Sverdrup had not given up his plans for Greenland, so the whole winter was spent sewing tents, building tents and kayaks (it was decided to convert the single-seaters into double-seaters), etc.Sverdrup O. New land; four years in the Arctic regions / Translated from the Norwegian by E. H. Hearn. L. : Longmans, Green and Co, 1904. Vol. I. p. 75. Nödtvedt set up a smithy right on the ice.Sverdrup O. New land; four years in the Arctic regions / Translated from the Norwegian by E. H. Hearn. L. : Longmans, Green and Co, 1904. Vol. I. p. 79. The upholstery for the kayaks was sewn by Rones and Baumann, Braskerud was the chief carpenter, and Isachsen and Bai were in charge of hanging rations for dogs and men, as well as taking pemmican out of tins, melting it, and packing it in portions. Fosheim also sewed a four-person tent for a future long trek. Rones and Fosheim also planned to capture live musk oxen to bring back to Europe and sell to zoos.\nExplorations and losses of 1899\nWinter and spring expeditions\nSverdrup decided to celebrate Christmas and New Year's Eve with great fanfare: the celebrations lasted until 3 January. The ship was ceremonially illuminated, and on Christmas Day a ceremonial dinner was served with coffee and liqueurs, later replaced by champagne and grog. The winter was harsh, with the lowest temperatures in January–February 1899: down to ; in the holds and workshops the temperature was kept at .Sverdrup O. New land; four years in the Arctic regions / Translated from the Norwegian by E. H. Hearn. L. : Longmans, Green and Co, 1904. Vol. I. p. 80. Peder Henriksen, who had been made Dr. Svendsen's assistant, struggled to make two-meter deep holes in the ice of the frozen bay to measure the water temperature. A strange episode occurred: Svendsen and Henriksen, exhausted from their daily drilling into the sea ice, noticed that the seals kept unfrozen holes for breathing. It was decided to leave a fish (from the dog's rations) in a convenient hole, and as a result, for some time this symbiosis existed and was maintained, facilitating the researchers' work\nOn 12 February 1899, engineer Olsen and Dr. Svendsen made a day trip to Fort Conger to see the Lady Franklin Bay Expedition's camp. The trip was unsuccessful: Olsen had done little or no physical training or winter skiing, and as a result became very tired on the return trip and stated that he would not make it to the Fram. Svendsen was forced to leave him in the field and hurried to the ship, whereupon Sverdrup harnessed sleds with dogs and brought Olsen aboard. After being given cocoa to drink, Olsen suddenly perked up and was almost recovered the next day. On 22 February, Sverdrup, Bauman, Bye, Isachsen and Henriksen decided to go hunting.Sverdrup O. New land; four years in the Arctic regions / Translated from the Norwegian by E. H. Hearn. — L. : Longmans, Green and Co, 1904. Vol. I. p. 97. Sverdrup and Henriksen, as the more experienced ones, separated from the group and decided to spend the night in the open. After pitching their tent, they lit the primus stove and were immediately convinced that the tent was completely covered with frost. They had a mercury thermometer, which was not designed for such frost. The hunters could not sleep. Suddenly Henriksen complained that his back was freezing: Sverdrup made sure that his polar wolf fur clothing was frozen. The captain had to peel off his comrade's icy armor and warm him with a primus he was holding.Sverdrup O. New land; four years in the Arctic regions / Translated from the Norwegian by E. H. Hearn. L. : Longmans, Green and Co, 1904. Vol. I. p. 99. That same night, Peary (who was  from Sverdrup) recorded a temperature of . Neither Sverdrup nor Henriksen were injured, except that it took more than a day for their frozen clothes to dry.\nOn 7 March, Schei, Stolz, and Hassel tried to get as far north as possible. The temperature remained at . On the fifth day of the trek, Schei froze five toes and had to have them amputated. The footwear was a failure: instead of Lappish \"kangs\" filled with senna grass, Schei wore \"komagi\" made of rawhide.Sverdrup O. New land; four years in the Arctic regions / Translated from the Norwegian by E. H. Hearn. L. : Longmans, Green and Co, 1904. Vol. I. p. 100. There was also an unexpected visit: from the south came Kolotengva, an Eskimo who had participated in Peary's 1895 expedition and had been assigned to Astrup as a guide and hunter. On the way to the coast, he was joined by Bauman and Hassel, who wanted to visit Robert Peary on the Windward. Kolotengwa, on the other hand, said he had to get new dogs for the Americans, as 37 had died during the winter. Bauman was met by Peary, who was recovering from frostbite suffered during a polar night in a desperate attempt to outrun the Norwegians and reach Fort Conger. However, the American expedition leader barely spoke to him, citing his health and making it clear that he still considered the Norwegian team to be competitors. The next day, Bauman and Hassel went to the Fram  with a gift from Sverdrup — a box of cigars. On the contrary, Kolotengwa brought his whole tribe, who were received with all cordiality — in accordance with the Norwegian custom of hospitality. The Norwegians were disgusted by the Eskimo custom of smearing themselves with blubber and whale oil; the guests also brought insects on board.\nSvendsen's suicide\nSverdrup still planned to set up a permanent camp on the north coast of Greenland, move the Fram  to the Lincoln Sea, and then conduct a comprehensive coastal survey during the winter and the following spring before returning south. In order not to lose time, it was decided to explore the southern part of Ellesmere Island and to cross it from east to west. The reason for this was that there was very little data about the island: the members of the Nares expedition in 1875–1875 and later —Greeley in 1881–1884 — mapped only the east and north coasts, and these were inaccurate. Sometimes geographers depicted Ellesmere as a double island, split at about 79°N. \"Hayes Strait, with Grinnell's Land and Grant's Land to the north, and Ellesmere Land itself placed at Jones Strait.\nAs the weather warmed, Sverdrup and Bai made several treks, one of which lasted about a month; as a result, the team reached the western —unexplored— coast; the fjord discovered there was named after Bai. On 2 June, two parties headed west: Schei and Svendsen (he replaced Stoltz, who was suffering from ophthalmia) and Sverdrup and Simmons. Svendsen felt unwell on 6 June (complaining of snow blindness and chest pains), but, wanting to observe Arctic insects, refused to return and stayed in the tent. On 10 June, tragedy struck, and Sverdrup's report briefly mentions that the expedition saw the doctor dead. The diary tells a very different story: as Sverdrup's party returned, they saw from a distance that the doctor was walking around behind the tent. Seeing the captain, Svendsen shot himself in the head with his rifle, the sound of the shot muffled by the distance and the wind. From the doctor's diary it became known that he had been suffering from severe depression since the winter, aggravated by his addiction to morphine. Svendsen's drug addiction became apparent to the expedition members after the Fram set sail. Gerard Kinney claimed that if Sverdrup had known about this or had insisted on a medical examination, he would not have included him in the crew. Svendsen tried to overcome his illness and even asked Sverdrup to take away the keys to the ship's pharmacy, but the captain refused, saying the doctor was a grown man and should take care of himself. According to Sverdrup's diary, Svendsen did not take any morphine with him on the scouting trip with Schei. On 16 June, according to naval custom, the doctor's body was lowered into an ice hole, the Lord's Prayer was recited, and mourning was declared on the Fram. The doctor's death had a depressing effect on the crew, for Svendsen was a sympathetic and companionable man. Sverdrup, in a fit of despair, even wrote in his diary that the expedition was doomed. The commander's gloom was explained by the fact that Isachsen and Braskerud had not yet returned from their voyage; they did not come back on board until 2 July, having first successfully completed the task of crossing Ellesmere Island.\nGreenland. Sverdrup and Peary\nBy 24 July, the bay where the Fram  wintered was almost free of ice. Couples were deployed, dogs were transferred to the deck of the ship, but as soon as the ship entered the Kane Basin, strong headwinds consolidated the ice fields. An attempt to circumnavigate Pim Island was also unsuccessful. Sverdrup deliberately climbed a high cliff, but the ice was all around, and the clouds showed no reflection of open water (\"water sky\"). The captain still tried to get through the jams, but after two days \"Fram\" passed  and was forced to retreat. In August, Smith Strait was open and the Fram was able to enter Greenland. A supply ship of Peary's expedition was seen from its deck, and a semaphore announced that there was mail on board and for the Sverdrup team, but the three-mile ice bridge made it impossible to receive it. Peary had already settled on his expedition ship Windward in Faulk Fjord. Bauman visited Peary, but a personal meeting of the expedition leaders did not take place: Peary was offended by Sverdrup and believed that he wanted to take away the main prize — the North Pole. The mail was never received as it was left on Pim Island. After anchoring in Greenland for 10 days, the Fram attempted to head north again, although the ice conditions had not changed. The ship drifted in thick ice for several days, a three-day storm carried the expedition north, but then the currents carried it back south. Sverdrup eventually abandoned the Greenland plans (perhaps because he did not want to upset Peary and worsen relations with the U.S.) and decided to go as far west as possible through Jones Strait, continuing the mapping of Ellesmere Island. On 22 August, 22 walruses were slaughtered. To save time, they were brought directly on board, and during the storm in Lady Anne Strait, the carcasses stained the entire deck with fat and blood. A little later, 11 more animals were captured.\nFall cares. Death of Braskerud\nAfter rounding Coburg Island, the Fram sailed through Jones Strait to the unknown shores of Elsmere Island to find a place to winter. They found an ice-free fjord and named it after the ship. The surroundings also made a favorable impression: the shores were covered with lush vegetation for the Arctic, much to the delight of botanist Simmons. However, Sverdrup did not take into account that the entrance to the fjord was full of underwater rocks that opened up at low tide, and on 28 August, the harbor had to be abandoned. The weather during this time was foggy, with continuous rain and gale force winds pushing the ship westward. Despite the storm, a deep bay (Havn-fjord) was found where the Fram could be brought ashore. Sverdrup was worried about whether there was any wildlife on shore to provide fresh meat for the men and dogs. Reconnaissance by dinghy showed that there was no better place to anchor. Preparations for the winter began on 1 September: Nödtvedt screwed eye bolts into the coastal rocks (according to C. Johnson, they were still in place in 2014), and the Fram  was securely anchored from the stern. Trouble began immediately: apparently the Norwegians caught some kind of infection from Piri's men. Peder Henriksen was particularly ill, suffering from coughing up blood and swelling of the legs, and there was no doctor on board to insist on compliance with the regimen or to monitor the correctness of the measures taken. The illness did not stop Sverdrup: until the polar night began, his party — consisting of the captain himself, Isachsen, Fosheim, and Stoltz, loaded into a dinghy with a team of dogs and traveled  by sea to the next fjord, Jones Bay (called Boat Bay), from where they began their land survey. However, winter came early, the bay was covered with a layer of grease ice (ice crystallizing on the surface), winds brought dense sea ice into the fjord, and it became impossible to travel by dinghy, and the Fram was still  away. It was decided to wait for the ice to solidify. Sverdrup's group had to dig a dugout in the turf, cover it with stones and use the dinghy as a roof (at  long, it allowed standing under the keel at full height). There were plenty of Arctic hares and ptarmigan in the area, so Sverdrup's three-week stay was relatively comfortable. Sverdrup also mentioned that the blood of a seal slaughtered for meat was used to make pancakes, which the Norwegians considered a great delicacy. It was not until 6 October that they were able to head south on the sleds they had taken with them (the boat was abandoned, with the expectation that it would be picked up in the spring). On 8 October, the party met up with Bauman and Bai, who had been sent in search of their captain. They brought sad news: the stoker Braskerud had died a few days earlier at the age of 27 from the same disease that had killed Henriksen and Nødtvedt, but the harpooner and mechanic had recovered. Braskerud was buried in an ice hole according to nautical custom, and a cairn with a cross was placed on the shore.\nTo distract the crew from gloomy thoughts, Sverdrup decided to scout the area before the polar night. On 13 October, a party of Isachsen and Hassel was sent east to match the terrain with the available maps, and Sverdrup himself, with Fosheim, Skei, and Bai, set out at the same time for Boat Fjord, intending to go as far as possible and build up supplies for the spring tobogganing trips. Upon reaching another fjord, Sverdrup's party slaughtered a large herd of musk oxen (about 20 animals) for meat and named the fjord in their honor. More than a ton and a half of beef was put into the ice bunts, along with meat from polar bears, walruses, seals, more than 100 hares, and many prey birds, including gulls and ptarmigan. A large amount of meat was also taken aboard the Fram  (about  of beef alone) and had to be delivered on sledges after the polar night. The people who remained on the ship prepared their base for the winter in the same way as in the previous year: they covered the deck portholes with tarpaulins and insulated them with pressed snow, dogs were placed in kennels on the ice near the ship, the blacksmith's shop was moved to the ice. People were eager to keep themselves busy during the winter: Olsen developed a new odometer and equipped all sledges with such devices. However, the Christmas and New Year celebrations were marred by Lindström's three-month illness, followed by Simmons' illness and Henriksen's relapse, and Rones' frostbite.\nAccording to Sverdrup's contemporary biographer Alexander Wisting, the deaths of Svendsen and Braskerud, as well as mass illness, brought both the commander and his men to the brink of a nervous breakdown. The captain's diary recorded the most violent mood swings: from flogging the crew to blaming himself. According to Wisting, Sverdrup's continued expedition was a kind of \"self-punishment\".\n1900: Discovery of the Sverdrup Islands and first winter in Gøse Fjord\nSpring expeditions\nChristmas and New Year's Day were bleak: besides Braskerud's death, the crew was depressed by the serious illnesses of Simmons and Lindström, from which they did not recover quickly. The role of cook was assigned to Hassel, and he coped with his new duties. Sverdrup's plans for the next season were simple: as soon as the sun rose, they would use sleds and sledges to reach the mouth of Jones Bay, which ran from the west into Elsmere Island. With the onset of summer, the Fram  was also to be moved as far west as possible and placed for a third winter. During this time, the unknown coasts were to be surveyed and the information obtained combined with Nares' charts. Bauman began sewing new double tents, and Olsen was ordered by the captain to cast and forge five sets of camping utensils from copper, tin, and nickel silver: a large cooking pot, a ring pot for melting ice, and a coffee pot to be placed on top. Because of the cold weather, workshops were located in both of Fram's cabins: the stern was used to forge metal for sledges, and the forward saloon was used by tailors who sewed tents, shoes, fur garments, sleeping bags, and dog harnesses.\nThe first 1900 trip began on 23 February 1900: the purpose was to recover a dinghy abandoned by Sverdrup's crew in their robinsonade. Isachsen, Bai, Schei and Stoltz were sent to Boat Fjord, and they made an unpleasant discovery: the meat (dog food) stores that had been laid down in October 1899 had been plundered by polar bears. It was unthinkable to conduct sledge trips without an intermediate base, so a new hunting season was opened. The butcher's camp for the great expedition to the West was named Bjørnborg (\"Bear Fortress\"), and the only guard volunteered was Edward Bye, who lived there for three months in complete isolation, accompanied only by a dog. On 20 March, three groups set out on a big sled trip: Isachsen and Hassel, Sverdrup and Fosheim, and Henriksen and Schey. Baumann and Rones shuttled between the units, supplying them with food and kerosene. A total of 9 men were involved in the trek, operating 9 sledges with 55 dogs harnessed to them. Each sled carried about 300&nbsp;kg of equipment. Five people remained on board and moved to the poop deck; to save fuel, only the rear rooms were heated. The main discovery of the expedition was the narrow strait between Ellesmere and North Kent Islands. It was reached in a severe frost and storm, giving the pass the name Hell Gate. Here a dogsled almost died when it fell through the ice. The strait was named Norwegian after Sverdrup. On 30 March, the mountains appeared, but it was impossible to explore them. The temperature remained at , so the brandy Rones had taken with him froze, and the expedition members drank it during the celebration. In addition to the severe frost, the ice conditions were very difficult: the bay was highly indurated and the land topography was difficult. Mostly, Sverdrup used a narrow strip of land, fast ice to cross. In some places it was literally necessary to break through hummocks and ridges with crowbars and picks; sometimes the dogs were not strong enough to overcome the obstacles, and the sledges were pulled by men.\nFrom the Norwegian Strait, Sverdrup and Isachsen tried to go north with 12 dogs. They discovered Axel Heiberg Island. Constant storms forced them to turn back. All groups met at Bjørnborg on 1 June 1900. Bai was replaced by Fosheim as base keeper (when the expedition arrived at Bjørnborg, the zoologist was sleeping peacefully). During all this time, Bai had not seen a single bear. Game was scarce in these parts: when Sverdrup and Fosheim decided to explore the northern tip of Axel Heiberg Island (and reached 81° N, the northernmost point of the expedition), they managed to kill a single hare, the first game for a month. The dogs (there were 12 of them) were so hungry by then that they chewed off their leather muzzles and belts.\nDuring the spring-summer period of 1900, the five expedition parties spent a total of 282 days in the field, traveling 8840 kilometers, mostly through completely unexplored areas.\nThe fire at the Fram on 27 May\nThe most dangerous moment of the entire voyage came on 27 May 1900, when the expedition nearly lost the Fram. Sparks from the galley pipe set fire to the awning stretched over the entire ship, the roof of the deckhouse, and then the wood and 16 kayaks soaked in paraffin for waterproofing caught fire. There was a tank of  of kerosene on the deck and ammunition boxes nearby. The fire was discovered early because Simmons was out for an afternoon walk. Thanks to Simmons' determination and the team's cohesiveness, the ammunition was moved and the fire was extinguished, as there was an open ice hole under the side. It took about half an hour to fight the fire, and it was fortunate that the fuel tank was strong enough and tightly sealed. Losses were minor: all the kayaks, many sets of skis, wood, mainmast sails and running rigging, sheepskins and polar bear skins were lost; tin and copper utensils were melted. Nearly all of this was restored. The hull was completely intact; the deck and masts were slightly scorched. Simmons' services were rewarded by the commander: the peninsula at Hell's Gate was named after the botanist.\nPolar summer\nIn May–June, Isachsen and Hassel surveyed the southern tip of Axel Heiberg Island, then traveled further east to map the confusing coastline of Elsmere Island. However, the weather was consistently bad, the ice very heavy, and the explorers returned through Hell's Gate. On 5 June, Sverdrup even sent a special party to look for them, but its members missed them. Isachsen and Hassel returned to the Fram  on June 19, and the accompanying party the next day. Soon the polar spring began: snow and ice melted quickly on the hills, flowers and insects appeared. The Fram  team actively began collecting zoobotanical specimens, including trawling the bottom of the fjords. At the same time, seals were harvested. In addition, the rigging had to be installed and new sails sewn to replace those lost in the fire. Since Nödtvedt worked almost around the clock, Sverdrup added a bathhouse to the forge, which became the crew's favorite pastime.\nOn 19 June 1900, the Fram  was in clear water. Sverdrup concluded that the ice conditions in the Caine Basin would not allow a northward passage, and he did not want to fight with Peary. It was decided to move the Fram  as far as possible into Jones Strait to continue mapping the unknown polar islands. The plan was to circumnavigate Devon Island from the north, pass through Penny and Wellington Straits, and, if possible, winter on Victoria Island. In other words, Sverdrup wanted to follow in the footsteps of Franklin's last expedition. The expedition leader climbed the hills daily to survey the state of the ice. By 8 August, the channel was completely open and the weather was clear. The next day, couples were separated, a blacksmith was brought aboard, and 54 dogs and 20 puppies fwere loaded. Three days later, the crew reached a peninsula in North Devon named after Colin Archer, from where Sverdrup planned to pass through Cardigan Bay. The Fram soon encountered powerful ice fields and strong currents, with the strait (near Hell's Gate) only  wide. Although the crew was determined to overcome it, a thick fog suddenly descended. A strong northwesterly wind brought ice fields, and the Fram  drifted near the northern mouth of Cardigan Bay until 24 August. Then the wind had to turn south, and it became noticeably colder — the onset of winter. Sverdrup ordered preparations for wintering in the ice: the furnace was extinguished, the boiler drained, and the steam engine mothballed. The rudder was lifted out of the well, as it would be when drifting in the Arctic, but the propeller was left in place. The forge was lowered onto the ice, and the dogs were moved there as well. However, Sverdrup was concerned that the ice was extremely broken and the shore too close. Bauman and Rones convinced the commander that it was necessary to stock up on fresh meat for the winter, and they were released to scout around Arthur Bay. Three days after they left, a long, narrow ice hole near the ship suddenly cracked, and the dogs and possessions piled on the ice had to be rescued immediately. Then the northeast wind shifted to a southeast gale and the Fram was towed to Graham Island, leaving Bauman and Rones  from their base. As the sea ice broke up, Sverdrup ordered the steam engine to be started as soon as possible. The commander hoped that Rones and Bauman would see the ship's movements from the hills and understand his intentions, and this calculation proved correct. Their excursion was completely unsuccessful, as they saw no game and had only a week's supply of provisions with them.\nGøse Fjord: Wintering\nOn 17 September, Sverdrup decided to make a third wintering in Göse Fjord, which had been opened the previous spring. The weather was calm and the fjord was ice-free; there was still no snow on land. Fram was safely anchored  from the mouth of the fjord. On the first landing, Sverdrup and Rones shot a bear, and Fosheim found a herd of 11 musk oxen, and then another of the same number. Remembering his past experiences, Sverdrup stayed behind to guard the meat until the others had carried it aboard.\nWith supplies replenished, Sverdrup began planning the spring voyages. First, the study of the shape and structure of Elsmere and Axel Heiberg Islands had to be completed. Sverdrup suspected that the mountain glaciers on these islands were the source of the icebergs in the Norwegian Gulf. The commander began his preliminary reconnaissance on 18 October, a 10-day excursion in the footsteps of Isaksen and Hassel. Sverdrup took along an inexperienced skier, Karl Olsen. At first they stopped at the Nurstrann intermediate depot at the northern end of the Simmons Peninsula. However, while attempting to reach Graham Island on the sea ice, the travelers were caught in a snowstorm, the dogs and sleds were unable to maintain direction on the smooth ice, and Olsen dislocated his arm in a fall. For two days the expedition sat in a tent in Nurstrann, and the snowfall was so heavy that the tent and the dogs were completely covered (three dogs suffocated). Olsen suffered from the injury because it was not possible to reset the arm — Simmons and Fosheim did it after returning to Fram. They had to consult the late Svendsen's medical manuals. The surgery was performed under anesthesia, but Sverdrup and Olsen were afraid to use chloroform, and instead used alcohol according to old naval practice. No further expeditions could be made due to the constant stormy weather. Only Isaksen ventured out to hunt on the ice and along the coast, and got a few more bears and muskoxen. Hunting was never a sporting activity on the Fram, for both men and dogs needed plenty of fresh meat, blood and entrails, which was the most reliable prevention of scurvy, and the skins were used for polar clothing, sleeping bags and other things.\nAs the polar night progressed, the Fram  crew spent more and more time in the warm room (the most unpleasant tasks were weather observation and taking care of the dogs on the ice). In Fosheim's carpentry shop, however, where the sleds and kayaks were repaired, the temperature never rose above zero. The atmosphere was lightened by holidays and birthdays. Shortly before New Year's Eve, the Fram  was attacked by a pack of wolves, attracted by dogs, meat stores and garbage heaps. Even the experienced hunter Sverdrup called the wolves \"vicious\"; E. Bye managed to shoot the leader of the pack, after which the predators changed tactics and made short raids one after the other. No more wolves were shot and traps were useless. Only in the spring were two wolves caught alive in a trap.\n1901: discoveries and disappointments\nThe end of the discoveries on the Sverdrup Islands\nerected on the island of Axel Heiberg.]]\nAfter polar daylight, Sverdrup began laying camp. The commander assigned two parties of 8 and 6 men, a northern and a western party, which set out in full force on 12 March in freezing temperatures of .Sverdrup O. New land; four years in the Arctic regions / Translated from the Norwegian by E. H. Hearn. L. : Longmans, Green and Co, 1904. Vol. II. pp. 488-489. with bright sunshine and no wind. The entire crew camped overnight in a field near Nurstrann, and then the units split up. It took the northern group 13 days to lay the stockades, and the southern group a full two weeks. The stores were laid more than  from the ship — on the isthmus of the Bjorn Peninsula and on Southwest Cape and Graham Island. Isaksen's party went as far as the western edge of Axel Heiberg Island. Sverdrup reached the strait between Axel Heiberg and Elsmere, which he named Eureka. However, the dogs were exhausted from the cold and draught, so Sverdrup stopped to fatten them.\nOn 8 April 1901 —the Monday after Easter— four sledge parties of two men each left Fram. They split up after Nurstrann: Isaksen and Hassel were sent to unknown lands in the west; Sverdrup and Schey and, separately, Fosheim and Rones went north in pairs, while Baumann and Henriksen were to supply these groups with everything they needed. For the next month, Sverdrup used the three groups to survey the ice spaces between Axel Heiberg and Elsmere Islands. After surveying Baumann Fjord, they encountered an impassable mountain ridge and retreated, naming the extreme point Vendom Fjord (Return). Attempts to find other passages led to Sverdrup's secondary discovery of Bye Fjord, but now approached it from below — from the coast rather than the highlands. On 4 May, the combined team finally split up. Isaksen and Hassel surveyed the western islands, discovering Amund-Ringnes and Ellef-Ringnes; Baumann and Stoltz mapped the fjords east of the Norwegian Strait. Here they found strong coal deposits and a fossilized prehistoric forest with individual trunks more than a meter in diameter. Fosheim and Rones then crossed Eureka Strait and proceeded to Greeley Fjord. They returned to the Fram on 13 June, having traveled  in 67 days. Sverdrup and Schey made a 77-day trek, during which they found numerous traces of Eskimo occupation, but no people were seen. They tried to go as far north as possible and reached Nansen Strait. The weather was very bad all the time and the fog made the horizon merge with the surface of the ice. In order not to lose sight of the tent during a storm, they devised an ingenious \"milestone\": both Sverdrup and Schei went up into the air with their mouths full of chewing tobacco, marking the distance with spits clearly visible in the snow. On the return trip, Schei was busy collecting fossils, so that the travelers had a much heavier load than when they left the Fram. Sverdrup was greatly impressed by Schey's enthusiasm, and he ironically described how he treated the pieces of coal \"as if they were nuggets of gold\" and packed them in everything they had: portcullis, spare clothes, skins, and so on. Returning to the ship on 16 June, Sverdrup and Schey found themselves in solid fields of melting \"lard\" — fine crystalline ice. It was not until 17 June that they returned safely to the Fram, by which time the entire crew was on board.\nTogether, Sverdrup and Isaksen's groups spent a total of 250 days in the field, covering a distance of .\nForced wintering\nThe weather changed: on 17 June, the temperature reached zero. On 12 August, Sverdrup attempted to leave the wintering area, but the ice prevented passage and the open water was only a few hundred meters away. Blasting work began, but on 5 September a hurricane broke out and it became clear that another winter would be necessary. For a month, Fram advanced only , and another  to the edge of open water. Fuel and provisions were sufficient for an uneventful winter, but suddenly there was a shortage of coffee and butter. Afternoon coffee had to be taken off the menu and butter rationing was instituted. In order to replenish supplies, the hunting season was reopened: the crew traveled by boat to Norwegian Bay and Jones Strait to catch more walrus and seals, while on land bears, musk oxen and reindeer were slaughtered en masse. As usual, the fresh meat was packed in ice bunts and shipped to the Fram  in batches. Sverdrup also inspected the sled dogs and puppies, after which the old ones were shot and cut up for others. After the polar night, the crew rested, celebrated, and sought other forms of entertainment. Edward Bye wrote a novel called Gunhild about travelers to Greenland who found descendants of ancient Normans in a polar oasis; reading the sequel was eagerly awaited by the expedition members. During the winter many became interested in carving walrus bones. At the end of the winter, Sverdrup ordered a  channel in the ice to the mouth of the fjord to be filled with sand in order to speed up the melting of the ice in the spring; the entire crew participated in this idea with great enthusiasm, pulling boxes of sand from the shore on sledges.\n1902: the end of expedition\nSpring and summer expeditions\nWhen polar day arrived in March–April, Bauman, Fosheim, and Hassel explored Koun Island in Jones Strait. Seven cairns were set up here with sealed expedition reports in tin boxes addressed to any fishing vessel. By this time, the lack of news from the Fram  had exceeded the agreed time Fram, which unnerved the crew; the captain feared that a rescue expedition might be organized in Norway. Sverdrup counted on the provisions the British sailors had made during the search for the Franklin, in case it was not possible to get the ship out of the fjord in 1902 and they had to take detours to get home. Fossheim and Rones made a trip to Beachy Peninsula, where John Ross had left a large storehouse in 1850, but it turned out that the storehouse had been looted by Eskimos and European fishermen; the ice-covered ship Mary, which Sverdrup had counted on in case the blockaded Fram  had to be abandoned, was broken up for firewood and business needs. During the summer, Isaksen and Bai had mapped Devon Island and Gøse Fjord. Once again, a large number of fossils were found. Suddenly there was a sharp conflict with Stoltz: he had never been able to acquire the necessary skills as a skier and musher and was a great hindrance to his explorations. When Sverdrup left him on the ship, he resented the captain and became a pariah among the crew. Sverdrup and Schey then moved north, despite bad weather and broken ice, with the goal of reaching the extreme point once reached by Nares' men and completing the mapping of the island. This was accomplished on 8 May; the captain and mate returned to the Fram on 16 June, having spent 75 days on the voyage. All four sledge parties in the spring-summer season spent 168 days in the field, having traveled .\nFram 's liberation\nThe polar summer was coming, and with it the melting ice. Sverdrup mobilized the crew to free the ship and return home. The strip of sand in the ice proved to be a good idea: a four-mile channel, about halfway to open water, was easily created. However, the Fram  was completely frozen in the ice, so in order not to exhaust the men, Bye, Simmons, and Isaksen were sent out in a dinghy on 7 July with orders to reach Hell's Gate and return by 20 July. They were to retrieve the boat that had been abandoned there the previous year and collect geological specimens and meat. By 15 July, the ice around the ship had melted, and the Fram launched itself. The remaining 10 sailors began hastily packing: dinghies were hung from davits, dogs were brought on deck. The couples were taken out, but the winds and currents were completely unpredictable: The \"Fram\" was first carried to the coast and then into the channel. Once the anchor chain froze in the ice, which could have tipped the ship over, and it was necessary to go down to the ice to saw and drill. In 11 days of hard fighting, only 2 miles were gained. On 30 July, an ice field came over the \"Fram\" and pushed the heavy ship into shallow water, the wind was against her all the time. Sverdrup was ready to unload the holds and anchor the ship, but suddenly the wind shifted and the danger passed.\nReturning\nIn early August, the Fram was delayed only by the absence of four travelers. On 5 August, Schey, looking around with binoculars, noticed movement and a Norwegian flag on land. Sverdrup himself went to meet Isaksen's party: it turned out that the group members had split up because of the persistently bad weather — two went by dinghy and two insured from the shore. Due to severe ice conditions, Bye, Simmons, Isaksen, and Henriksen spent 10 days on a small island, enduring rain, hurricane winds, and lack of food. There was also good news: from the highlands, it could be seen that Jones Strait was free of ice on the eastern side, so with a favorable wind, Fram  could well come out of the fjords. On 6 August, the ice broke up, and the Fram could begin its advance toward Greenland. The stormy weather had to be waited for in Havn Fjord, and during two days of anchoring at the old place it was possible to sew up the sails, replace the tackle and work out the blocks, reload coal from the hold and put Braskerud's gravestone in order. By 16 August, Greenland was already visible in the fog, and the next day the crew arrived at Godhavn, on the south coast of Disko Island. The stay in the Danish colony lasted three days. During this time, the team members learned news, met with locals, and stocked up on coal for the return trip and some \"luxuries\" (coffee, tobacco, and fresh bread). Most of the dogs were returned to their former owners, but the older animals were shot (according to Sverdrup — for human reasons: the Eskimos did not feed dogs that were no longer able to work). The locals willingly took the carcasses for meat and skins. Sverdrup took several individuals of both sexes to Norway for breeding.\nTwo crew members were missing for the passage to Norway: Henriksen had injured his knee with a harpoon in Godhavn and could not perform his duties as a sailor, and Olsen had dislocated his other arm in Göse Fjord and had not recovered. Lindström had to be put in charge of the stoker, and his duties were taken over by Hassel. Captain Sverdrup asked for two sailors from a Danish supply ship and got one, and then managed to get another sailor from a merchant ship. Cape Farwell was rounded in a storm, but the weather improved. On 31 August, when the ship was 200 miles from the southern tip of Greenland, there was a serious accident with the steam engine, which could only be started for a short time and at low steam pressure; the rest of the voyage had to be made under sail. On 17 September, Fram passed between the Shetland and Orkney Islands and reached Utsira Island on 18 September, but had to wait a day for a pilot. The next day the expedition arrived in Stavanger, where the Fram was met by a procession of boats and yachts full of leisurely spectators. Congratulatory letters and telegrams were delivered to the crew around the clock. Soon the flagship of the Norwegian Navy, \"Heimdal,\" arrived and towed the ship to Christiania. The Heimdal was commanded by Sigurd Scott-Hansen.\nThe celebration of the expedition was not inferior to that of the 1896 meeting. The  passage from Stavanger to Christiania took 10 days because of the constant festivities along the way, and Sverdrup had to turn down many invitations. At the entrance to Christiania Fjord, the Fram was greeted with 17 salutes from Akershus Fortress. All crew members were awarded the Fram's Silver Medal, Sverdrup, like Nansen, was awarded the Grand Cross of the Order of St. Olaf, and Henriksen was awarded the Gold Medal for Service to the King. During an award ceremony at the Royal Geographical Society, its permanent president Clements Markham stated that Sverdrup's results surpassed anything done by Kane, Hayes, Hall, Greeley, and Baldwin.\nExpedition results: Memory\nGeographical and scientific achievements\nConcluding his book New Land: Four Years in the Arctic, Sverdrup proudly wrote:About one hundred and fifty thousand square miles of new land were surveyed and taken into the possession of the king of Norway.Sverdrup O. New land; four years in the Arctic regions / Translated from the Norwegian by E. H. Hearn. L. : Longmans, Green and Co, 1904. Vol. II. pp. 449-450.Sverdrup's team surveyed an area of , more than any previous expedition. A total of 15 sledge trips were made with a total duration of 762 days,  were covered, not counting excursions of  with a duration of 5 to 25 days. All areas were declared Norwegian possessions and named after the crew members, the large archipelago west of Elsmere being the Sverdrup Islands and the southern part of the archipelago being Sverdrup Land. Sverdrup sent the relevant documents to the government in Stockholm, but Foreign Minister Lagerheim virtually ignored them. After the dissolution of the union with Sweden, a protracted dispute began with Canada, which had annexed the territories under the concept of polar sectors. The dispute dragged on until 1930, and Sverdrup signed the final relinquishment documents only two weeks before his death. In 1930, the Canadian government purchased all of the Sverdrup expedition's materials for $67,000. These documents are now stored in the National Archives of the Canadian Federation. On 8 August 1930, an official notice was issued in which His Majesty's Government in Canada recognized Norway's relinquishment of sovereignty over the Sverdrup Islands, with a separate mention that the possession of the islands had nothing to do with the \"sector principle\".\nScientifically, the expedition mapped an area comparable to Norway south of Trondheims Fjord. Rock samples, fossilized remains of flora and fauna, extensive zoobotanical collections (over 50,000 specimens), 2,000 specimens of lower animals, plankton and soil samples were returned. Some of the most interesting finds were well-preserved 45-million-year-old sequoia and cupressus trees. The processing of this material took 20 years. The publication of the five-volume Report of the Second Norwegian Arctic Expedition on the Fram 1898–1902 took a long time: two volumes were published in 1907, one each in 1911–1919, and the last volume was published in 1930. The total volume of the edition exceeded 2000 pages, with each scientific article being an issue with separate page numbering. There were a total of 39 issues.\nNew Land\nA popular account of the expedition was published in two volumes in 1903 under the title New Land. Four Years in the Arctic (Norwegian: Nyt land. Fire aar i arktiske egne) and was immediately translated into English. Sverdrup was an unimportant writer, so the literary treatment of his diaries was done by the famous novelist Jacob Breda Bull. An abridged translation in FrenchSverdrup O. [https://gallica.bnf.fr/ark:/12148/bpt6k9805369b.texteImage Quatre années dans les glaces du Pôle : second voyage du «Fram» de Nansen]: [https://web.archive.org/web/20180612151458/http://gallica.bnf.fr/ark:/12148/bpt6k9805369b.texteImage Archive]: 12 June 2018] / traduit et abrégé par Charles Rabot. P. : E. Flammarion, 1903. 430 p. and full translations in German, Swedish and Spanish were also published. The 1904 English translation was republished in 2014 by Cambridge University Press. As interest in the Arctic grew during the Cold War, an adaptation of the two-volume New Land for the general public was published in London and New York in 1959 and 1961 under the title ''Sverdrup's Arctic Adventures by T. Fairlie.Sverdrup’s Arctic adventures / adapted from «New land: four years in the Arctic regions» by the Norwegian explorer Otto Sverdrup, and edited with additional chapters by T. C. Fairley. L. : Longmans, 1959. 305 p. The reviewer —C. Greenaway— considered this work urgently necessary for polar pilots and explorers of the North, although he reproached the publishers for the title, which was completely inappropriate to the content.\nSverdrup's expedition was quickly forgotten against the background of Amundsen's achievements in 1903–1906 and 1910–1912, and its description was not republished for a long time. The contemporary Norwegian explorer Henning Wärp raised the question of the reasons for this phenomenon. Comparing Sverdrup's diaries with the published text, Wärp concluded that the captain misinterpreted the public's wishes and was also very reluctant to dramatize any situation. For example, the most serious episode of the expedition — the fire on the Fram on 27 May 1900, which could have led to the death of the entire crew, was given only two and a half pages in the voluminous book New Land. In Waerp's opinion, the reader gets a better idea of the drama of the situation from Otto Sinding's drawing than from the captain's description. In contrast, Nansen's book about the first voyage on the Fram contains many episodes about bear attacks and difficulties of traveling through the ice, which combine documentary accuracy with artistic reproduction and \"the effect of presence\" for the uninformed reader. The meeting with Robert Peary is also described in a very unemotional way: Sverdrup does not even mention what the American was wearing, what he looked like, or what they talked about, albeit very briefly. Even the chapter that includes this episode is titled \"Our First Encounter with the Musk Oxen\". Х. In the same context he noted that although the Fram team met with Eskimos, Sverdrup did not seem at all interested in their traditional culture and other \"exotics\", but devoted whole chapters to hunting various animals. Accordingly, the meeting with Peary was only an additional episode to the hunting story. In general, H. Wärp stated that Sverdrup's book had no exciting plot (in contrast to Nansen's dramatic narrative) and was monotonous and boring: \"1035 pages of the same thing: bad weather, good weather, hunting, return to the ship and the necessary work, description of equipment, care of dogs, observations made, samples collected\". However, when editing his diaries in the winter of 1901, Sverdrup frankly admitted that he was unable to describe his work in such a way that \"people would want to read about it\". Alexander Wisting, the author of a contemporary Sverdrup's biography, argued:If the second expedition had also been led by Nansen, it would probably have been called a feat in the history of polar exploration. An important contribution to expanding the horizons of mankind. But Otto Sverdrup did not have Nansen's ability to communicate to the public the full magnitude of his achievements.\nNotes\nReferences\nPrimary sources\nNew Land (Norwegian edition)\n* Sverdrup O. Nyt land: fire aar i arktiske egne: [букмол]. — Kristiania: Forlagt af H. Aschehoug, 1903. — Bd. 1. — 554 s.\n* Sverdrup O. Nyt land: fire aar i arktiske egne: [букмол]. — Kristiania: Forlagt af H. Aschehoug, 1903. — Bd. 2. — 523 s.\nNew Land (English translation)\n* Sverdrup O. New land; four years in the Arctic regions / Translated from the Norwegian by E. H. Hearn. — L. : Longmans, Green and Co, 1904. — Vol. I. — 532 p.\n* Sverdrup O. New land; four years in the Arctic regions / Translated from the Norwegian by E. H. Hearn. — L. : Longmans, Green and Co, 1904. — Vol. II. — 538 p.\nExpedition report\n* Report of the Second Norwegian Arctic expedition in the «Fram» 1898—1902: at the expense of the Fridtjof Nansen fund for the advancement of science. — Kristiania: In commission by T. O. Brøgger, 1907. — Vol. I. — 716 p.\n* Report of the Second Norwegian Arctic expedition in the «Fram» 1898—1902: at the expense of the Fridtjof Nansen fund for the advancement of science. — Kristiania: In commission by T. O. Brøgger, 1907. — Vol. II. — 706 p.\n* Report of the Second Norwegian Arctic expedition in the «Fram» 1898—1902: at the expense of the Fridtjof Nansen fund for the advancement of science. — Kristiania: In commission by T. O. Brøgger, 1911. — Vol. III. — 590 p.\n* Report of the Second Norwegian Arctic expedition in the «Fram» 1898—1902: at the expense of the Fridtjof Nansen fund for the advancement of science. — Kristiania: In commission by T. O. Brøgger, 1919. — Vol. IV. — 518 p.\n* [https://www.nb.no/nbsok/nb/43231556af725c4aa6a418ee7cdd1227?index=3#3 Report of the second Norwegian Arctic Expedition in the «Fram» 1898—1902]: at the expense of the Fridtjof Nansen fund for the advancement of science / Published by Det Norske videnskaps-akademi i Oslo. — Oslo (Kristiania): A. W. Brøgger, 1930. — Vol. Supplementary. — 193 p.\nBibliography\n*\n*  }}\n*\n*\n*\n*\n*\n*\n*\nExternal links\n* Otto Neumann Knoph Sverdrup (1854—1930). THE FRAM MUSEUM. Дата обращения: 8 June 2018. [https://web.archive.org/web/20180612141032/http://frammuseum.no/polar_history/explorers/otto_neumann_knoph_sverdrup___1854-1930_ Archive]: 12 June 2018.\n* The Second Fram Expedition (1898—1902). THE FRAM MUSEUM. Дата обращения: 8 June 2018. [https://web.archive.org/web/20180612140054/http://frammuseum.no/polar_history/expeditions/the_second_fram_expedition__1898-1902_/ Archive]: 12 June 2018.\n* Vidar Bjørnsen. Den andre Framekspedisjonen (Nor.). Norsk Polarhistorie. Norsk Polarinstitutt, Troms Fylkeskommune og Universitetet i Tromsø. Дата обращения: 15 June 2018. [https://web.archive.org/web/20190814001528/http://www.polarhistorie.no/artikler/2009/Den%20andre%20Fram-ekspedisjonen Archive]: 14 August 2019."
    }
  ]
}