{
  "content": [
    {
      "type": "text",
      "text": "# Swansea War Memorial\n\n| removed          =\n| unveiled         =\n| coordinates      =\n| location         = Mumbles Road\n| nearest_town     = Swansea\n| designer         = Ernest Morgan\n| total_burials    =\n| unknowns         =\n| commemorated     =\n| by_country       =\n| by_war           =\n| inscription      = Pro Deo Rege et Patria\n| embedded         =\n| source           =\n}}\nSwansea War Memorial, also known as Swansea Cenotaph, is a war memorial on the promenade beside Mumbles Road, the A4067, near Brynmill to the southwest of Swansea city centre, overlooking Swansea Beach and Swansea Bay.\nIt was designed by the borough architect, Ernest Morgan, and closely resembles Edwin Lutyens' Cenotaph in London.  The memorial cost £3,000, raised by public subscription: over £9,000 was donated, and £3,000 of the excess was directed to assist the children of the fallen.  A foundation stone was laid by Field Marshal Douglas Haig, 1st Earl Haig on 1 July 1922.  The competed memorial was unveiled by Admiral of the Fleet Sir Doveton Sturdee a year later, on 21 July 1923, with a dedication by the vicar of Swansea, Prebendary Cecil Wilson.\nThe memorial comprises a tall rectangular Portland stone pylon, about  in section and  high, standing on three steps, topped by a stone chest (the symbolically empty tomb or \"cenotaph\").  The sides of the pylon bear bronze low reliefs: on both short sides are bronze wreaths and the dates \"1914-1918\" and \"1939-1945\"; the long side facing the sea bears a bronze anchor within a wreath; and the long side facing the land bears the coat of arms of the City of Swansea and the Latin inscription \"Pro Deo Rege et Patria\" (\"For God, King and Country\").  The foundation stone bears an inscription which records it was laid by Earl Haig in 1922 over a King's shilling placed by Mrs Fewings, representing war widows.  A separate inscription records the unveiling in 1923.\nThe pylon is surrounded by an octagonal paved precinct with four entrances, once gated.  Stone benches are built into the inside faces of precinct walls.  The walls also carry bronze memorial plaques listing the names of over 2,200 of Swansea's war dead from the First World War, 400 from the Second World War, and several from later conflicts.  The corners of the plaques are decorated with swastikas as symbols of good luck.\nThe memorial suffered shrapnel damage in the Second World War, and the damaged gates to the precinct were removed. It became a Grade II listed building in 1994.\nA short distance along the promenade to the east is the memorial to Swansea Jack, and a memorial to the Second Boer War erected in 1904 opposite St. Helen's Rugby and Cricket Ground.  A separate memorial to the Merchant Navy was erected at SA1 Swansea Waterfront in 2005.\nFile:Swansea War Memorial 20190924 124449 (48787085858).jpg | The memorial in 2019\nFile:Swansea War Memorial 20190924 124147 (48787450386).jpg | The memorial in 2019\nFile:Swansea War Memorial 20190924 124251 (48787448911).jpg | Inscription recording the laying of a foundation stone in 1922\nFile:Swansea War Memorial 20190924 124214 (48787449801).jpg | Inscription recording the unveiling in 1923\nFile:Swansea War Memorial 20190924 124339 (48787448111).jpg | Some of the bronze plaques listing the war dead\nFile:Swansea Jack memorial.jpg | Swansea Jack memorial\nFile:South African War Memorial in Swansea - geograph.org.uk - 3688991.jpg | Swansea's South African War Memorial\nFile:Merchant Navy Memorial, Swansea.JPG | Swansea's Merchant Navy Memorial\nReferences\n* [https://coflein.gov.uk/en/site/412404/details/swansea-cenotaph Swansea Cenotaph], Coflein, National Monuments Record of Wales\n* [https://www.roll-of-honour.com/Glamorgan/SwanseaCenotaph.html Swansea War Memorial], roll-of-honour.com\n* [https://britishlistedbuildings.co.uk/300014596-cenotaph-including-surrounding-walls-uplands Cenotaph including surrounding walls], britishlistedbuildings.co.uk\n* [https://www.iwm.org.uk/memorials/item/memorial/6627 Swansea War Memorial], War Memorials Register, Imperial War Museums\n* [https://www.warmemorialsonline.org.uk/memorial/116651 Swansea Cenotaph], warmemorialsonline.org.uk\n* [https://www.walesonline.co.uk/news/wales-news/swastikas-swanseas-cenotaph-war-memorial-15113254 This is why there are swastikas on Swansea's cenotaph war memorial], WalesOnline, 5 September 2018\n* [https://www.iwm.org.uk/memorials/item/memorial/6626 Swansea Boer War Memorial], War Memorials Register, Imperial War Museums\n* [https://www.iwm.org.uk/memorials/item/memorial/65493 Swansea Merchant Navy Memorial], War Memorials Register, Imperial War Museums"
    }
  ]
}