{
  "content": [
    {
      "type": "text",
      "text": "# Swara Bhasker\n\n| birth_place        = Delhi, India\n| years active       = 2009–present\n| occupation         = Actress\n| birth_name         =\n| nationality        =\n| education          =\n| alma_mater         = University of Delhi (BA)Jawaharlal Nehru University (MA)\n| spouse             =\n| children           = 1\n| mother             = Ira Bhaskar\n| father             = C. Uday Bhaskar\n}}\nSwara Bhasker (also spelled Bhaskar; born 9 April 1988) is an Indian actress who works in Hindi films. Best known for her supporting work in mainstream productions and starring roles in independent films, she has won two Screen Awards and has received nominations for four Filmfare Awards .\nBhasker made her film debut with a supporting role in the 2009 drama Madholal Keep Walking, a commercial failure. She got wider recognition in 2011 for her supporting role in the commercially successful romantic comedy-drama Tanu Weds Manu, earning her critical praise and a Filmfare Award for Best Supporting Actress nomination.\nBhasker garnered further accolades for her performance in the critically acclaimed romantic drama Raanjhanaa (2013), earning her a second Filmfare Award for Best Supporting Actress nomination. In 2015, she reprised her role from Tanu Weds Manu in the film's sequel and later appeared in the family drama Prem Ratan Dhan Payo, both productions among the highest-grossing Bollywood films of the year. Her starring roles in the independent films Nil Battey Sannata (2016) and Anaarkali of Aarah (2017) earned her further acclaim. She won the Screen Award for Best Actress (Critics) for the former and was nominated for the Filmfare Award for Best Actress (Critics) for the latter. In 2018, she starred in the comedy-drama Veere Di Wedding, which earned her a third nomination for the Filmfare Award for Best Supporting Actress.\nEarly life and education\nSwara Bhasker was born in a Hindu family on 9 April 1988 in Delhi to C. Uday Bhaskar, an Indian Navy officer of Telugu descent, and his wife Ira Bhaskar, a professor of cinema studies in JNU Delhi who is of Bihari origin.\nBhasker grew up in Delhi, where she did her schooling from Sardar Patel Vidyalaya. She subsequently studied UG in English at Miranda House where she was classmates with Minissha Lamba. She did her PG in sociology from JNU Delhi.\nActing career\nBefore Bhasker started acting in films she was associated with N. K. Sharma's \"Act One\" theater group in Delhi. She shifted to Mumbai in 2008 and made her acting debut with the 2009 film Madholal Keep Walking, which was screened at the 33rd Cairo International Film Festival but underperformed at the box office India. She then played a supporting role in Sanjay Leela Bhansali's drama Guzaarish (2010), alongside Hrithik Roshan and Aishwarya Rai.\nBhasker then appeared in Srinivas Sunderrajan's black and white thriller The Untitled Kartik Krishnan Project, which was touted as India's first mumblecore film, made on the budget of  and completed in one year, was also the first Indian film to be screened at the Transilvania International Film Festival. However, both Guzaarish and The Untitled Kartik Krishnan Project were box-office failures and Bhasker remained unnoticed for her performances.\nBhasker garnered widespread recognition from critics and audiences with a supporting role in the 2011's commercially successful romantic comedy-drama Tanu Weds Manu in which she played the role of Payal, the best friend of the film's lead actress Kangana Ranaut. She received praise and several nominations for her performance, including her first nomination for the Filmfare Award for Best Supporting Actress.\nIn 2013, she played the lead role in Listen... Amaya (2013), which also saw the reunion of actors Farooq Sheikh and Deepti Naval after 28 years, and earned positive reviews from critics. She then appeared in Raanjhanaa, along with Dhanush and Sonam Kapoor, which was one of the highest-grossing Bollywood film of the year. She received high critical praise as well as her second Filmfare Award for Best Supporting Actress nomination for her role of Bindiya in the film. She appeared in a lead female role in the box-office flop Sabki Bajegi Band opposite Sumeet Vyas and in the moderate successful Machhli Jal Ki Rani Hai with Bhanu Uday.\n'', 2013]]\nBhasker served as a host for Shyam Benegal's television mini-series Samvidhaan, which was based on the making of the Indian Constitution. The series aired on Rajya Sabha TV from March 2014 to May 2014. On her trip to Lahore, Pakistan, Bhasker appeared as a guest in the Pakistani TV comedy show, Mazaaq Raat which was aired in April 2015.\nBhasker had three releases in 2015. In her first release, she reprised her role of Payal in the romantic comedy-drama Tanu Weds Manu Returns, a sequel to the 2011 film Tanu Weds Manu. The film and Bhasker's performance received high critical acclaim. The film was a financial success as well and became one of the few women-centric films that rank among the highest-grossing Indian films. Her next release was the romantic family drama Prem Ratan Dhan Payo, in which she played the role of Rajkumari Chandrika alongside Salman Khan and Sonam Kapoor. Directed by Sooraj Barjatya, the film received mixed reviews. However, Bhasker's performance was well received by critics and audiences. With an estimated collection of , the film became one of the highest-grossing Indian films. That same year, she played a minor role in the collaborative bilingual X: Past Is Present. The film was directed by eleven filmmakers, and Bhasker appeared in Nalan Kumarasamy's segment, Summer Holiday, which revolves around a young boy (played by Anshuman Jha), who goes to South India for summer holidays where an Aunty seduced him so that her husband can rape him. Although the film received mixed reviews, but her role of Aunty was particularly praised. Namrata Joshi of The Hindu wrote \"X: Past Is Present belongs to its women\".\nIn 2016, Bhasker played the lead in Anand L. Rai's comedy drama Nil Battey Sannata which marked her fourth collaboration with Rai. Bhasker was initially skeptical about the film because of the age difference between her and her character. However, she changed her mind after reading the script and played the role of a mother of a teenager. Upon the release, the film as well as Bhasker's performance received critical acclaim and she was awarded with the Best Actress award at the Silk Road International Film Festival in September 2015. She began working in web series with ''It's Not That Simple'', which is produced by Viacom 18's streaming service Voot. The show revolves around the idea of marriage, relationships, a woman's stand in a marriage, love etc. The series stars Bhasker along with television stars Vivan Bhatena, Akshay Oberoi and Karanveer Mehra, with Danish Aslam as the director.\n, Bhasker had completed shooting for Abbas Tyrewala's comedy drama Mango, starring Chandan Roy Sanyal and Monali Thakur, being produced under the banner of Kaleidoscope Entertainment. The film has been indefinitely delayed.\nShe also played the lead role in Shashanka Ghosh's 2018 romantic comedy film Veere Di Wedding, co-starring Kareena Kapoor, Sonam Kapoor and Shikha Talsania, about four girls who embark on a trip from Delhi to Europe. Her masturbation scene using a vibrator in the film was praised for its frank portrayal of women's sexuality. Her performance in the film earned her a third Filmfare Award for Best Supporting Actress nomination.\nPersonal life\nOn 16 February 2023, she married Fahad Ahmad. On 23 September that year, she gave birth to their daughter, Rabiya.\nPolitical views\nBhasker has been a vocal critic of the CAA (Citizenship Amendment Act) and NRC (National Register of Citizens). She has actively participated in the CAA protests.\nIn October 2024, she commented on the assassination of Yahya Sinwar, the former leader of Hamas who was listed as a terrorist by the USA and European Union, calling him a \"revolutionary hero\" after viewing footage of his last moments. She stated:\nFilmography\nFilms\n{| class=\"wikitable sortable\"\n|-\n! Year !! Title !! Role !! Notes\n|-\n| 2009 || Madholal Keep Walking || Sudha M. Dubey ||\n|-\n| rowspan=\"2\" | 2010 || Guzaarish || Radhika Talwar ||\n|-\n| The Untitled Kartik Krishnan Project || Swara Bhaskar / Maya ||\n|-\n| rowspan=\"2\" | 2011 || Tanu Weds Manu || Payal Sinha Singh ||\n|-\n| Chillar Party || Battle Hour Anchor ||\n|-\n| rowspan=\"4\" | 2013 || Listen... Amaya || Amaya Krishnamoorthy ||\n|-\n| Aurangzeb || Suman ||\n|-\n| Raanjhanaa || Bindiya ||\n|-\n| Sabki Bajegi Band || Jaya ||\n|-\n| 2014 || Machhli Jal Ki Rani Hai || Ayesha Saxena ||\n|-\n| rowspan=\"3\" | 2015 || Tanu Weds Manu Returns || Payal Sinha Singh ||\n|-\n| Prem Ratan Dhan Payo || Rajkumari Chandrika ||\n|-\n| X: Past Is Present || Aunty ||\n|-\n| 2016 || Nil Battey Sannata  || Chanda Sahay ||\n|-\n| 2017 || Anaarkali of Aarah  || Anarkali ||\n|-\n|2018\n|Veere Di Wedding\n|Sakshi Soni\n|\n|-\n|2018\n|The Story\n|\n|ZEE5\n|-\n|2019\n|Shame\n|Fanny\n|Short film\n|-\n|2020\n|Sheer Qorma\n|Rukhsar Siddiqui\n|\n|-\n| rowspan=\"2\" |2022\n|Jahaan Chaar Yaar\n|Shivangi\n|\n|-\n|Mimamsa\n|Adhira\n|\n|-\n|TBA\n| style=\"background:#FFFFCC;\"|Mrs Falani\n|TBA\n|Completed\n|}\nTelevision\n{| class=\"wikitable sortable\"\n|-\n! Year(s)\n! Show\n! Role\n! Notes\n! Ref.\n|-\n|2014\n|Samvidhaan\n| Presenter\n|\n|\n|-\n|2015–2017\n|Rangoli\n| Host/presenter\n|\n|\n|-\n| 2016–2018\n| ''It's Not That Simple\n| Meera\n|\n|\n|-\n|2019\n|Hello Mini\n|\n|\n|\n|-\n|rowspan=\"3\"| 2020\n| Rasbhari\n| Shanoo Bansal\n|\n|\n|-\n|Flesh\n| ACP Radha Nautiyal\n|\n|\n|-\n|Bhaag Beanie Bhaag\n| Beanie Bhatnagar\n|\n|\n|-\n|2021\n|Aapkey Kamrey Mein Koi Rahta Hai\n|Mausam\n|\n|\n|-\n|2025\n|Pati Patni Aur Panga\n|Contestant\n| 3rd Runner-up\n|\n|}\nAccolades\n{| class=\"wikitable sortable\"\n|-\n! Film\n! Award\n! Category\n! Result\n!class=\"unsortable\"|\n|-\n| rowspan=\"4\" | Tanu Weds Manu\n| 57th Filmfare Awards\n| Best Supporting Actress\n|\n|\n|-\n| 2012 Zee Cine Awards\n| Best Actor in a Supporting Role – Female\n|\n|\n|-\n| 13th IIFA Awards\n| Best Supporting Actress\n|\n|\n|-\n| Screen Awards\n| Best Supporting Actress\n|\n|\n|-\n| rowspan=\"4\" | Raanjhanaa\n| 59th Filmfare Awards\n| Best Supporting Actress\n|\n|\n|-\n| 15th IIFA Awards\n|Best Supporting Actress\n|\n|\n|-\n| Screen Awards\n|Best Supporting Actress\n|\n|\n|-\n| Zee Cine Awards\n|Best Actor in a Supporting Role – Female\n|\n|\n|-\n| rowspan=\"2\" | Nil Battey Sannata\n| Silk Road International Film Festival\n| Best Actress\n|\n|\n|-\n| Screen Awards\n| Best Actress (Critics)\n|\n|\n|-\n|Anaarkali of Aarah\n|63rd Filmfare Awards\n|Best Actress (Critics)\n|\n|\n|-\n| rowspan=\"3\" scope=\"row\" |Veere Di Wedding''\n|Lux Golden Rose Awards\n|Confident Beauty of the Year\n|\n|\n|-\n|64th Filmfare Awards\n|Best Supporting Actress\n|\n|\n|-\n|Screen Awards\n|Best Supporting Actress\n|\n|\n|-\n|}\nReferences\nExternal links\n*\n*\n*"
    }
  ]
}