{
  "content": [
    {
      "type": "text",
      "text": "# Swaraag\n\n}}\nSwaraag is an Indo-Western Fusion band based in Rajasthan, India known for its traditional Rajasthani as well as western music. It comes from Swa-self, raag-raga. The band is founded by Arif Khan and Pratap Singh in 2014. The traditional music instruments such as Khartal-Morchang and Zitar make the band unique. They gained fame through their various live performances.\nThe band team is also the contestant of Rising Star (Indian season 3). They got 92% rating by public for their first song Ghoomar.\nThe band was appreciated by Indian film actor Ram Charan for their soulful music.\nSwaraag has completed more than 1000 performances worldwide.\nMusical career\nSwaraag band was founded in April 2014 when Arif Khan, a freelance Zitar and Sitar player, met Pratap Singh during a Concert. Pratap had a vision of bringing forth folk music to the mainstream commercial industry. By the end of 2014, they were ready with their new genre of Music. Pratap Singh suggested the name \"Swaraag\" - an indo-western fusion band. Requests for Wedding & Corporate Events started pouring and Swaraag was introduced on stage for the first time as an instrumental band and the band has 4 artists along with instruments such as Zitar, tabla, guitar, saxophone. Later they added vocals to the band, to showcase it to the larger audience, And thus added lead singer Asif Khan, Drum and Khartal instruments.\nSwaraag kept evolving its Music and came up with many new genres of Music like Rajasthani Folk Fusion, Sufi Fusion, Instrumental Fusion, Bollywood Mashup & Ghazals. As the Band gained popularity, the team decided to add new instruments like an octopod or a keyboard. But Pratap was firm with his decision of keeping the Band completely Acoustic.\nSwaraag now performs Live on stage with instruments like Zitar, Acoustic Guitar, Acoustic Drum and Tabla. The band successfully blends the essence of Folk & Sufi, creating fusion out of Punjabi Sufi Music and songs performed by legendary singers like Ustad Nusrat Fateh Ali Khan and Rahat Fateh Ali Khan. Instrumental Fusion and Indo-Western instrumental jamming sessions are some of the major highlights of the on-stage performances by Swaraag.\nTeam\nPratap Singh Nirwan\nPratap Singh is the founder and team coach for Swaraag band. The main idea is to portray the traditional Indian art and culture in the right way to the global platforms. Yet, deep down his love for Music kept looking for a perfect opportunity which came into fruition as Swaraag. His sole intention behind Swaraag was to popularize the traditional Indian music by creating a new genre of Indo-western fusion.\nSwaraag attempts to re-establish traditional Indian Folk Music with its Indo-western fusion music.\nMohammad Asif Khan\nMohammad Asif Khan is the voice of Swaraag. He has been trained in Rajasthani Folk and Sufi Music. In his early days, he was trained by his own father, Ustad Mahmood Khan. He believes that younger generation has more influence of western music as compared to classical Indian music. So, his motive lies on the ground of uplifting traditional Indian music. His raw, powerful and versatile voice is the signature style of the band Swaraag. Many of his live show audience have felt that his voice reminds them of Late Nusrat Fateh Ali Khan. His unique style of playing the harmonium fits with the overall musical instruments and arrangements by other Swaraag band members.\nArif Khan\nArif Khan is the Sitar Player of the band Swaraag. Arif was born with talent which was further polished by his father Ustad Mahmood Khan. By the age of 6, Arif was playing various instruments and his love for Sitar was undeniable. He has showcased his talent globally. His music genre belongs to the Sikar Gharana. His in-depth knowledge about music also helps him to come up with his own compositions.\nOther Team Members\n*Arif Khan (Khartal-Morchang Player)\n*Sajid Khan (drummer)\n*Tasruf Ali (Saxophonist)\n*Reyshab Rozzer (Acoustic guitar player)\n*Mohammad Seif Ali (Tabla player)\n*Hansraj (former Khartal-Morchang player)\n*Kishore Kumar (former Acoustic guitar player)\n*Giriraj Purohit (Manager)\n*Karanpal Singh Nirwan (Manager)\nDiscography\n*Teri Deewani, Feb 2020, Sony Music India\n*Padharo Mhare Des, Feb 2020, Sony Music India\n*Piya Mharo, April 2019, The Orchard Enterprises\n*Udiyo Re Udiyo, May 2020, The Orchard Enterprises\nAwards\n*JPC AWARDS 2016\n*WOW LQ Award\nReferences"
    }
  ]
}