{
  "content": [
    {
      "type": "text",
      "text": "# Swartberg\n\n| coordinates_ref =\n| geology=Quartzitic sandstone\n| period=Carboniferous and Permian\n| orogeny=Cape Fold Belt\n| length_km= 230| length_orientation= ESE/WNW\n| width_km=  70 | width_orientation= NNE/SSW\n| easiest_route =\n| embedded = (ix), (x)\n| ID            = 1007bis\n| year          = 2004\n| extension     = 2015\n}}\n}}\nThe Swartberg mountains (black mountain in English) are a mountain range in the Western Cape province of South Africa. It is composed of two main mountain chains running roughly east–west along the northern edge of the semi-arid Little Karoo. To the north of the range lies the other large semi-arid area in South Africa, the Great Karoo. Most of the Swartberg Mountains are above 2000 m high, making them the tallest mountains in the Western Cape. It is also one of the longest, spanning some 230&nbsp;km from south of Laingsburg in the west to between Willowmore and Uniondale in the east. Geologically, these mountains are part of the Cape Fold Belt.\nMuch of the Swartberg is part of a UNESCO World Heritage Site.\nThe two ranges\narea]]\n, South Africa, near Calitzdorp in the Little Karoo (approximately 21° 30’ E), showing the relationship between the Little and Great Karoos, separated by the Swartberg mountain range. The significance of the various geological layers (coloured layers) can be found in the articles on the Karoo Supergroup and Cape Fold Belt.  The heavy black line flanked by opposing arrows is the fault that runs for nearly 300 km along the southern edge of the Swartberg Mountains. The Swartberg Mountain range owes some of its great height to upliftment along this fault line. The subsurface structures are not to scale.]]\nThe Swartberg consists of two officially named ranges, the Smaller and the Greater Swartberg Mountains.\nKlein Swartberge\nThe Smaller Swartberg are the westernmost of the two. Ironically, this range is the higher one, including the province's highest peak, Seweweekspoortpiek (Seven Weeks Gorge Peak) at 2325 m. The famous Towerkop (Bewitch Peak) towers over the Klein Karoo town of Ladismith at a height of 2189 m. The peak is so named for its cleft peak, that, according to legend, was split by a spell and subsequent bolt of lightning.\nGroot Swartberge\nThe Greater Swartberg is located to the east, with the dividing line between the two ranges being the Gamka River, which cuts a gorge directly through the range. This section, almost of a similar height, is slightly lower in elevation, with the Tierberg (Leopard Mountain) at 2132 m being the highest. These mountains are home to the Cango Caves in the exposed limestone basement rocks exposed by upliftment along a 300&nbsp;km fault line that runs along the southern flank of the Swartberg ranges (see diagram on the left). These are the most famous subterranean system in South Africa, located just north of Oudtshoorn.\nMountain passes\nSeveral passes cut through the Swartberg Range, and these are famous primarily for the spectacular geology they dissect, as well as for the engineering skill required in completing several of the routes across them.\nMeiringspoort (1858)\npass]]\nUntil the first pass was cut, these mountains were virtually insurmountable, and cut the Great Karoo off from the Little Karoo and from the coast. John Molteno, Beaufort West businessman (and later Prime Minister) first surveyed the range for a pass with Andrew Bain, Thomas Bain. They rode out from Beaufort West on horseback, in 1854, for a week-long ride to traverse the range and plan the routes.\nThe pass was cut and the route completed in only 223 working days, comprising one of the era's most extraordinary feats of engineering. It was also a huge economic step for the interior of the Cape Colony. For example, by 1870, an eighth of the country's wool exports passed through the Meiringspoort.\nThe Meiringspoort provides paved road transit through the Swartberg range, using the route largely carved by a river. The poort connects the town of De Rust in the south, with the town of Klaarstroom in the north. It also offers a spectacular drive through incredible rock formations, and is the setting for an annual half marathon that ends in the town of De Rust. Modern additions mean several different passes now cut different routes through the range.\nSeweweekspoort (1862)\nThis pass, to the far west in the Klein Swartberge, connects the modern town of Laingsburg and the \"Rooinek pass\" in the north, with the Little Karoo to the south.\nIt was built initially purely by a team of convicts without engineers. It was begun in 1859, and the work was finally taken over by Adam de Schmidt. It was completed and opened in 1862.\nSwartberg Pass (1888)\nMost famous of all is the Swartberg Pass, which runs between Oudtshoorn in the south and Prince Albert in the north.\nThe Swartberg pass was built by Thomas Bain, son of the famous Andrew Geddes Bain who built Bain's Kloof Pass and many more. It was built using convict labour, and opened on 10 January 1888.\nThe pass is not paved and can be treacherous after rain, but has views over the Little Karoo and the Great Karoo to the north, as well as unusual geology. The Swartberg is regarded as one of the \"finest exposed fold mountain chains in the world\", and this is apparent at the northern end of the pass. The plant life along the pass is particularly interesting as many hundreds of species are found on the Swartberg. Also notable is the drystone work supporting some of its hairpin bends.\nPaved road transit through the Swartberg is available further east, through the Meiringspoort.\nPrince Albert hosts the annual Swartberg Pass Half Marathon. The race route goes out of the town and into the Swartberg Pass, with sheer rock and mountains on both sides. The warped and twisted rock formations are both beautiful and spectacular.\nThis race is held usually on the first Saturday of May, to coincide with the Olive Festival.\nGallery of the Swartberg Pass\nSwartberg Pass 01.jpg|Swartberg Pass\nImage:SwartbergP1020155.JPG|Swartberg mountains\nImage:SwartbergP1020181.JPG|Part of Swartberg Pass\nImage:Top of the Swartberg Pass.JPG|Top of the Pass (2004)\nImage:SwartbergP1020186.JPG|View from Pass\nImage:SwartbergPICT3193.JPG|Rock formations\nSee also\n*Geography of South Africa\n*List of mountain ranges of South Africa\nReferences"
    }
  ]
}