{
  "content": [
    {
      "type": "text",
      "text": "# Swarmatron\n\nThe Swarmatron is an analogue synthesizer developed by Dewanatron, consisting of cousins Brian and Leon Dewan. Hand-made by the Dewans, it has eight oscillators controlled by a single ribbon controller. The oscillators are linked through a 'swarm' control, giving it a distinctive sound that flows in and out of unison, comparable to the noise a swarm of bees produces.\nDewanatron sell their Swarmatron through Big City Music of Los Angeles. As of March 2016, only 83 had been produced.\nAbout\nThe distinctive feature of the Swarmatron is its use of eight individual oscillators controlled monophonically, switchable between sine and sawtooth waves. These oscillators produce an equidistant chord, where their spacing is under the player's immediate control. The oscillators may be switched on and off individually by a row of switches.\nA fingerboard synthesizer like the Trautonium or Tannerin, a finger is placed or slid from side to side along a ribbon controller to control the pitch. This allows for easy glissandi, which can be used to achieve smooth rises and falls in the pitch of the instrument. Careful finger placement may be used to play discrete notes similar to the operation of an unfretted or bowed string instrument such as a violin. Due to its adjustable nature, ribbon controller is unlabeled, although some players compensate for this by marking note positions.\nAn additional ribbon controller is used to control the spacing of the oscillators when in 'Swarm' mode. A large central knob on a rotary control may also be used to control the 'swarm'. Using adjustment of the range control, a non-equidistant swarmed chord is able to be produced. The oscillators may also be preset to common chord intervals of major thirds, minor thirds, and more.\nThe ribbon controllers can also adjust a low low-pass filter. Using the first ribbon allows for pitch tracking. An ADSR envelope control is also present.\nThere are no facilities for MIDI. However, there are three analogue 0-10V control voltage inputs for pitch, filter cutoff and swarm. With the use of a standard MIDI to CV converter, the instrument may be controlled from a sequencer or other MIDI controller.\nPrevious Dewanatron instruments such as the Melody Gins and Dual Primate Console have also used the same principle of multiple, interacting oscillators. The Swarmatron's retro styling of a dark wood case with hammer-finish green paint also resembles these previous instruments, all showing a distinctly retro influence. Front panels labels are deliberately minimal, with the controls being labelled with single letters rather than words.\nNotable uses\nTrent Reznor and Atticus Ross used a Swarmatron in their Academy Award winning soundtrack for the 2010 film The Social Network, with the DVD including a bonus feature of Reznor discussing the instrument. Additionally, Reznor and Ross's band How to Destroy Angels used it on their eponymous first album.\nJohn Cale used the instrument on the track \"Time Stands Still\", from his 2023 studio album, Mercy.\nProducer Dan Carey played the Swarmatron on Alfie Templeman's song \"Beckham\", a track from the latter's 2024 studio album, Radiosoul.\nBritish rock band black midi used the Swarmatron for their 2019 album, Schlagenheim on tracks \"953\" and \"bmbmbm\"\nDerived instruments\nIn 2014, music software company reFuse Software released \"The Swarm\" for free, a 32-bit 'drone synth' standalone application for MacOS and Windows, inspired by the Swarmatron and Reznor and Ross's soundtrack. It emulates the features of the Swarmatron as a MIDI instrument.\nReferences"
    }
  ]
}