{
  "content": [
    {
      "type": "text",
      "text": "# Swaraj Vidwan\n\nSwaraj Vidwan is an Indian social worker and activist for the underrepresented. She is a former member of the National Commission for Scheduled Castes. She was awarded the Nari Shakti Puraskar by the government of India for her work with vulnerable and marginalised groups. She is currently affiliated with the Bharatiya Janata Party (BJP) and serves as a General Secretary in the BJP Scheduled Caste Morcha, the party's Scheduled Caste wing.\nLife\nShe works with vulnerable and marginalised groups. Around 2000 she started her work looking after people in Uttarkashi. She set up over 100 self help groups to empower the members and also arranged funding allowing 160 poor women to marry. She arranged for 1200 women to find a pension and for another 500 women to arrange finance to become self employed. 800 girls who had difficulty attending school were found money to cover their school books and their school uniform.\nGomukh is a glacier and Vidwan arranged for 120 people to clean it up and improve the environment. More urgently she helped organise assistance after the 2013 North India floods.\nOn International Women's Day in 2015 she received the Nari Shakti Puraskar. She was one of the first eight Nari Shakti Awards for her leadership and achievement the year before. The award was made by the then Indian President Pranab Mukherjee.\nVidwan helps rape victims, particularly where she suspects that the police are ignoring cases where the victim is from a lower caste. In 2018 she and the National Commission for Scheduled Castes were interceding on behalf of a 16 year old rape victim. The man the police accused of the crime died in custody. Vidwan wanted the police person charged with murder as she suspected that the man's convenient death may be hiding the real rapists.\nPolitics\nVidwan is affiliated with the Bharatiya Janata Party serves as General Secretary of the BJP Scheduled Caste Morcha.\nReferences"
    }
  ]
}