{
  "content": [
    {
      "type": "text",
      "text": "# Swartzentruber Amish\n\nThe Swartzentruber Amish are one of the largest and most conservative subgroups of Old Order Amish. The Swartzentruber Amish are considered a subgroup of the Old Order Amish, although they do not fellowship or intermarry with more liberal Old Order Amish. They speak Pennsylvania German as their mother tongue as well as English (with outsiders).\nThe history of the Swartzentruber is closely tied to issues of church discipline, particularly the use of Bann und Meidung when a member is shunned, and to issues of Ordnung, or rules regarding what is allowed and what is required.\nHistory\nThe Schwartzentruber Amish originally formed as a result of a division that occurred among the Old Order Amish of Holmes County, Ohio in the early years of the 20th century. This original Schwartzentruber group then later split multiple times, mostly over issues Bann und Meidung, along with fine details of practical issues. The original division was caused when more conservative Old Order Amish districts, perceiving a \"drift\" toward assimilation, with some districts accepting limited use of new technology, questioned whether to shun a baptized member who had left to join one of these more progressive groups. Less conservative members believed shunning was unnecessary as long the former member joined another Amish or Mennonite group. More conservative members believed it was necessary to shun any baptized member who joined a group other than one their group diened, or fellowshipped, with.\nThe bishop who broke away was Sam E. Yoder. The division profoundly affected the Old Order community in Holmes County, as neighbors and even families who had formerly diened were now split. The group run by Yoder no longer worshipped with, shared important occasions such as baptisms with, or married other Old Order Amish.\nIn 1922 another split occurred after a sex scandal involving Yoder's daughter; when he did not order her to be shunned, half of the families split to form the Dan Wengerd group, which then reconciled with the Old Order in Holmes County.\nIn 1931, another split occurred over church discipline issues, resulting in the formation of the Troyer Amish in Wayne County, Ohio.\nYoder died in 1932, and the group became known by the name of the bishop who succeeded him, Samuel Swartzentruber. The conservative Ordnung the group followed attracted other families, and by 1957 there were five Swartzentruber districts.\nIn the early 1980s, several church districts in Minnesota, Tennessee, and Ohio split from the Swartzentruber church districts elsewhere, again over church discipline issues surrounding disagreements over shunning. This group, known as the Jeck Jeckey Leit, is now affiliated with the Nebraska Amish.\nIn the early 1990s, another split over application of shunning occurred in Holmes County, with two bishops, Eli Hershberger and Moses Miller, splitting from a larger group led by Joe Troyer over what Hershberger and Miller perceived as a failure to discipline two men who had misbehaved. The split spread throughout North America as Swartzentruber church districts and members took sides, causing a major schism.\nIn 1998, the Hershberger and Miller group experienced another split, this time over Ordnung – what is allowed and what is required – with the result that there were three distinct nonfellowshipping Swarzentruber groups: the main Joe Troyer group; the Mose Miller/Isaac Keim group; and the Andy Weaver group (not to be confused with the Old Order Andy Weaver group). In this three-way split, the Andy Weaver group was the most conservative and the Joe Troyer group the least. By 2011, after Mose Miller died, the Miller/Keim group experienced another split into the Dan Yoder church and the Pete Hershberger church, and again splitting districts and families. Both the Yoder and Hershberger groups fall in the middle of the spectrum of conservatism between the \"lower\"  (more conservative) Andy Weavers and \"higher\" Troyer, leaving the Andy Weavers as the most conservative of the Swartzentruber groups.\nAs of 2012 no Swartzentruber group fellowships with any other group, including other Swartzentrubers.\nCustoms\nTechnology\nSwartzentrubers are the most restrictive concerning the use of technology among all Amish affiliations. Like some other Old Order groups, they avoid the use of electricity and indoor plumbing. While other Old Order Amish may use telephones in limited ways, such as installing a phone and answering machine in an outbuilding to allow business interactions with non-Amish, the Swartzentrubers avoid them except in emergency.\nDress and appearance\nSwartzentruber clothing is typically made at home by women of the household.\nThe Swartzentruber style of dress tends to be heavier and plainer; only the Nebraska Amish dress in a more conservative style. Dresses are longer, and hat brims are wider than most other Old Order Amish. Boys' straw hats are unpainted. Men's shirts are pullover style with a standing collar. Women wear a dress and cape, typically in black or navy blue, with an apron. Married women wear white caps and unmarried women wear black.\nMany clothing fastening devices are rejected for being too worldly, including zippers, buttons, and Velcro.\nSwartzentruber men typically allow their beards to grow from the time they first appear. This is in contrast to other Old Order Amish men, who typically don't grow a beard before marriage.\nHomes\nSwartzentruber farms and yards are often unkept, a reflection of discouraging interest in outward appearance, as such an interest could promote vanity and pride. Their farms can be identified by dirt drives and surrounding roads, while most roads of the Old Order contain either gravel or paving to keep out the mud. The roofs of the houses and outbuildings are often made of tin.\nA typical Swartzentruber house will have a large living room, large kitchen with pantry, and a bedroom on the first floor with multiple bedrooms on the second floor. Swartzentruber do not use linoleum or carpeting, and do not varnish wooden floors. They do not use upholstered furniture. They use oil or kerosene rather than gas lanterns for lighting. They do not use indoor plumbing. Fabrics used for bedclothes and curtains are black or dark red, purple, or green.\nSwartzentruber do not participate in Amish directories such as the Ohio Amish Directory.\nTransportation\nRiding in cars is prohibited among the Swartzentruber Amish, except in emergencies, whereas most other Old Order Amish are allowed to use cars as long as they do not own them. Swartzentruber also do not use bicycles, which are used by many other orders. When Swartzentrubers travel, they typically do so by train or bus.\nBuggy styles are typically unique to each Amish group. Swartzentruber horse harnesses are black leather, rather than brown. The wheels of their buggies and wagons are wooden with steel rims. The buggies do not have windshields, rear windows, mirrors, or lights.\nSwartzentruber Amish use grey reflective tape on the back of their buggies, in place of bright triangular \"slow moving\" signs for road travel, which they regard as too worldly. These buggies also use lanterns, rather than battery-operated lights or reflectors. Some Swartzentrubers use a single lantern; when two are used, the lanterns are staggered in height, one side slightly higher than the other, so as not to appear like the tail lights of an automobile. There have been several court cases across the country where the state and county challenged the local Swartzentruber group to use the regulation orange triangle. In 2011, nine Swartzentruber men were jailed for not paying a fine for refusing to display an orange reflective triangle on their buggies.\nFamily\nSwartzentruber Amish typically have very large families, with as many as fifteen children not uncommon. They normally do not allow teenagers to leave the community during rumspringa, although most of them allow teenagers to \"court\" in order to find a marriage partner, which includes bundling – hugging in a bed while being fully clothed – and rocking in a chair together. Courting is intended to consist of finding a spouse and dating relationships are typically exclusive from the start. Wedding season is from the end of harvest until the beginning of spring planting, and weddings typically take place within two weeks of the announcement of the engagement.\nRetention rates of children into the church are the highest among all Amish orders and near 90%.\nFellowship\nSwartzentruber church services tend to be longer, up to four hours.\nDien, or fellowship, is the acceptance of back and forth movement between or among groups of Amish, such as ministers from one group preaching at services in the other, or members leaving to join another group. Swartzentruber dien only within their own groups, excluding even other Swartzentruber groups; a baptized member who leaves to join another group is shunned.\nOrdnung is nearly identical among the four Swartzentruber groups; the Troyer and Yoder groups allow the use of LED bulbs in their flashlights.\nReligious celebrations\nThe Swartzentruber celebrate Christmas on Epiphany, or January 6. December 25th is a normal work and school day and is not a major celebration day.\nPopulation and Church districts\nAs with other conservative affiliations, the Swartzentruber tend to have more children than the average Old Order Amish. In one sample that Kraybill et al. give, the average number of children born to Swartzentruber women was 9.3. Combined with a high rate of retention concerning their youth, the Swartzentruber have one of the highest growth rates among all Old Order Amish. Between 1991 and 2010 the number of church districts grew from 38 to 103, a growth of 171 percent.\nIn 1936 there were three Swartzentruber church districts and in 1957, five, with approximately 200 families. In 1944 a settlement was founded in Ethridge, Tennessee, which had ten church districts around 2013 with a population of 1,520 people. It is the largest Amish settlement in the South. The settlement near Lodi and Homerville, Ohio, which was founded in 1952 had 14 church districts around 2013 with a population of 2,148 people. In 1975 the settlement near Heuvelton, New York, was founded, that had 12 church districts around 2013 with a population of 1,671 people.\nAs of 2000, the Swartzentruber Amish had 64 districts, 3,165 members, a total population of 7,101 in 12 states with 33 districts in Ohio alone. There are nineteen districts of Swartzentruber in Holmes County and Wayne County, where the subgroup originated. The Swartzentruber share of the Old Order Amish is about 7 percent. As of 2011 there were 119 Swartzentruber Amish church districts and 43 settlements in 13 states of the US as well as in Ontario, Canada.\nEtymology\nSwartzentruber is a Mennonite and Amish surname of Swiss origin, coming from the Trub river valley, located approximately midway between Bern and Lucerne. It has been thought to mean \"seller of black grapes\". Other English spellings of the name include Schwartzentruber, Swartzendruber, Schwartzendruber, Schwarzentruber, and Schwarztrauber.\nOccupations\nUnlike other Old Order Amish, Swartzentrubers are not typically allowed by their Ordnung to be driven to workplaces but, if employed off their property, must work within a buggy ride of their work. At least one Swartzentruber district has restricted the hourly wage a member can accept from non-Amish businesses in order to discourage working off the family property.\nAmong Swartzentruber, farming is often a primary occupation, supplemented by at-home businesses focussing on such things as baskets, harnesses, sawmills, quilts, lawn furniture, maple syrup, eggs, and produce, often run in outbuildings on the family land. These side businesses allow families to work together at home and allow parents to supervise their children's interactions with outsiders.\nA Swartzentruber business may use diesel-powered engines to turn crankshafts to run machinery such as saws and sanders. They do not use pneumatic or hydraulic power.\nNotable figures\n* Andy Weaver – bishop who headed the most conservative branch after the 1998 three-way split, often cited as the strictest Swartzentruber faction.\n* Dan Wengerd – Holmes County bishop whose followers split from Yoder’s faction in 1922, forming a distinct “Wengerd” line before later reconciliation.\n* Joe Troyer – Leader of the largest Swartzentruber subgroup through the late 20th-century schisms.\n* Naomi Swartzentruber – former member turned author and influencer; her 2023 memoir and national media coverage (People, Toronto Sun, Fox News) made her the best-known ex-Swartzentruber figure.\n* Samuel Swartzentruber – Yoder’s successor; his long leadership (1932–1957) gave the group its enduring name and Ordnung.\n* Sam E. Yoder – founding bishop whose 1913–17 break with other Old-Order districts created the nucleus of the Swartzentruber movement.\n*\nReferences\nExternal links\n* [http://amishamerica.com/who-are-the-swartzentruber-amish/ Who are the Swartzentruber Amish?] - Amish Online Encyclopedia entry on Swartzentruber Amish technology, history, and customs."
    }
  ]
}