{
  "content": [
    {
      "type": "text",
      "text": "# Swartpuntia\n\n|image = Swartpuntiagermsi.png\n|image_caption = Life restoration, with only three petaloids for simplicity.\n|taxon = Swartpuntia germsi\n|display_parents = 2\n|authority = Narbonne et al., 1997\n}}\nSwartpuntia is a monospecific genus of erniettomorph from the terminal Ediacaran period,  with at least three quilted, leaf-shaped petaloids — probably five or six.  The petaloids comprise vertical sheets of tubes filled with sand.  Swartpuntia specimens range in length from 12 to 19&nbsp;cm, and in width from 11.5 to 140&nbsp;cm.  The margin is serrated, with a 1&nbsp;mm wide groove.  A&nbsp;14&nbsp;mm wide stem extends down the middle, tapering towards the top, and stopping 25&nbsp;mm from the tip. The stem has a V-shaped ornamentation on it.  The original fossils were found at, and named after, the Swartpunt farm between Aus and Rosh Pinah in Namibia.  The generic name comes from Swartpunt, meaning black point in reference to the colour of the rocks.  The specific name germsi honours Gerard Germs, who studied the Nama formation of geological beds.\nThey are preserved in sandstone beds in the Spitzkopf Member from the Nama formation, which lie above an ash bed dated at 543±1&nbsp;million years old, and occur until the very end of the Ediacaran beds in this locality (Narbonne et al. 1997): the start of the Cambrian period is dated .  Whilst Swartpuntia has since been found in south-western North America and the Carolina Terrane of North Carolina, it does not appear to have had a global distribution — indeed, its seemingly limited range has been used to provide palæogeographical reconstruction (Hagadorn & Waggonner 2000).\nThe shape of Swartpuntia resembles other Ediacaran fronds Pteridinium and Charniodiscus, both fronds with alternating\nsegments; the segments' microstructure resembles that of Dickinsonia.  This combination of features suggests close relationships between the Ediacaran biota, and lends credence to their membership of a separate phylum (Seilacher's Vendobionta). Mark McMenamin has inferred a photosymbiotic lifestyle for Swartpuntia, and this seems likely considering its shallow water habitat, tree-like shape and lack of apparent heterotrophic feeding structures.\nSee also\n* List of Ediacaran genera\nReferences\n*\n* Free access."
    }
  ]
}