{
  "content": [
    {
      "type": "text",
      "text": "# Swarabhishekam\n\n| runtime        =\n| country        = India\n| language       = Telugu\n| budget         =\n}}\nSwarabhishekam (Telugu :స్వరాభిషేకం) is a 2004 Indian Telugu-language musical drama film written and directed by K. Viswanath. Viswanath also played the lead role, along with Srikanth, Sivaji, Urvashi, and Laya. Vidyasagar won the National Film Award for Best Music Direction. The film won the National Film Award for Best Feature Film in Telugu for that year.\nPlot\nSrirangam Brothers&nbsp;– Srinivasachari (K Viswanath) and Ranga (Srikanth)&nbsp;– are versatile Carnatic musicians. Srinivasachari is happily married but has no children. Ranga is a widower with two children. The brothers are the biggest music directors in the Telugu film industry (Tollywood) and compose music only in traditional and classical genres. They also always try to help aspiring singers in their music compositions. Surekha (Laya), a TV anchor, falls in love with Ranga and they get married.\nAfter marriage, Surekha, who initially respects her brother-in-law, starts to develop ill feelings towards him and becomes envious that even though her husband Ranga is the main factor for the music duo's success and has equal contribution in Srirangam Brothers music scores, Srinivasachari is the one who gets all the credit.\nWhen Srinivasachari is awarded the Padmasri by the Government of India, Surekha rejects her sister's gifted saree and shows no inclination to come along with her family to attend Srinivasachari's felicitation by the President of India. Also, Surekha starts to show her hostile and disrespectful behaviour towards Srinivasachari.\nThis situation causes Srinivasachari to behave unpredictably and lash out at a film producer about his brother's music compositions (during his music sitting) and also at the media. When Ranga in his office becomes aware of this situation through the film producer, he returns home only to get dispirited to see Ranga's sister-in-law getting slapped by her husband, which leads to a heated argument between the two brothers and the family gets separated.\nSurekha slowly understands Srinivasachari's and Ranga's music calibre and realises that the two brothers can only excel in their music when they stay united. This transformation in Surekha eventually leads to the unity of the family just like Srirangam Brothers' different blends excel when they compose their music together.\nCast\n*Srikanth as Ranga\n*Sivaji as Chandu, Surekha’s love interest\n*Urvashi as Rukminiamma\n*Laya as Surekha, Ranga’s wife\n*K. Viswanath as Srinivasachari, Ranga’s brother\n*Amukta Malyada as Bujji\n*Naresh\n*Sana as a beautician\n*M. S. Narayana\n*Dubbing Janaki as Chandu's blind mother\n*Rajeev Kanakala\n*Sridhar as a cobbler\n*Sakshi Ranga Rao\n*Jaya Lakshmi\n*Surekha Vani\n*Gundu Hanumantha Rao as an auto rickshaw driver\n*Jayalalita\n*Anant as a stainless steel container seller\n*Suma as a news reporter\n*Venu Madhav as a music director\n*Duvvasi Mohan as film director\n*Ashok Kumar\n*Junior Relangi\nSoundtrack\nThe soundtrack composed by Vidyasagar was released through Aditya Music.\nReception\nA critic from The Hindu wrote that \"Despite the seriousness of family feud, humour part runs through the film. The sequence built around the delivery of a child in a railway compartment is movingly handled. All artistes give fine performances\".  A critic from Sify wrote that \"On the whole Swarabhishekam is a good classical fare and is definitely a breath of fresh air for Telugu cinema\".\nBox office\nThe penultimate directorial of K Vishwanath, it was his last hit as a director.\nAwards\n;National Film Awards\n* Best Feature Film in Telugu&nbsp;– K. Viswanath\n* Best Music Direction&nbsp;– Vidyasagar\n;Nandi Awards\n* Best Music Director&nbsp;– Vidyasagar\nReferences\nExternal links\n*"
    }
  ]
}