{
  "content": [
    {
      "type": "text",
      "text": "# SWARCO McCain, Inc.\n\n}}\nSWARCO McCain, Inc. is a privately held American manufacturing company headquartered in Vista, CA.\nHistory\nSpecializing in traffic equipment and contract manufacturing, SWARCO McCain, Inc. has employed over 500 employees between its headquarters, regional offices, and two manufacturing facilities—the newest LEED-certified manufacturing facility in Vista, California and Tijuana, Baja California, Mexico.\nThe company was founded in 1987 by Jeffrey L. McCain as McCain Traffic Supply, a small manufacturer of traffic signals. In 1991, McCain Traffic Supply began manufacturing its own line of traffic controllers and cabinets. That same year, McCain expanded its sales and technical support efforts by opening a branch office and small manufacturing facility in Preston, Washington.\nTo keep up with demand, in 1995 McCain expanded operations into Tijuana, Baja California, Mexico by opening a 140,000 sq. ft. manufacturing facility. By the late 1990s, McCain was manufacturing a full line of traffic equipment products that included traffic signals, signs, cabinets, and controllers.\nAt the turn of the century, McCain's portfolio expanded through the addition of software that would grow to include traffic signal control software, central traffic management systems, adaptive signal control, and other controller software programs. To better represent the gamut of products and services available, McCain Traffic Supply changed its name to McCain, Inc. in 2005.\nWith large-scale operations in place, McCain gradually expanded the contract manufacturing division by offering manufacturing to third parties.\nIn 2009 McCain, Inc. made the San Diego Business Journal’s “San Diego’s 50 Best Places to Work” list.  That same year, CEO Jeffrey McCain was recognized by the Ernst & Young Entrepreneur of the Year 2009 Award.\nBy the late 2000s, sales and technical support offices were established in Texas, Oregon, Virginia, and an extensive distributor network was created.\nIn 2011, McCain continued to grow its operations by adding a new 100,000 sq. ft. LEED-certified manufacturing facility in Vista, CA, located near its headquarters.\nIn the last two decades, McCain, Inc. has manufactured and sold more than 5.6 million traffic signals, 75,000 cabinets, and 58,000 controllers, which can be found across the US and in Kuwait, the Philippines, Canada, Mexico, and other countries.\nIn August 2016, McCain became a part of the SWARCO group, making products for road safety and intelligent traffic management.\nIn August 2022, McCain, Inc. changed its name to SWARCO McCain, Inc. and adopted SWARCO's corporate branding. The McCain name migrated to a product branding level to pay homage to its legacy product's roots.\nNotes"
    }
  ]
}