{
  "content": [
    {
      "type": "text",
      "text": "# SWAT 3: Close Quarters Battle\n\n|EU|December 24, 1999}}\n| genre = Tactical shooter\n| modes = Single-player, multiplayer\n}}\nSWAT 3: Close Quarters Battle is a 1999 tactical first-person shooter video game developed by Sierra Northwest and published by Sierra Entertainment exclusively for Microsoft Windows. It is the seventh installment of the Police Quest series and the third installment in the SWAT subseries. Set in the then-future year of 2005, the game follows the Los Angeles Police Department (LAPD) Metropolitan Division SWAT unit as they combat a wave of violent crime and terrorism in Los Angeles in the lead-up to a nuclear disarmament treaty signing.\nUnlike many other first-person shooter games, SWAT 3 places an emphasis on realistic police methods and tactics, including close-quarters battle tactics, proper use of force, and ideally arresting enemies rather than simply shooting them.\nSWAT 3 was met by positive critical acclaim, with praise toward its graphics and AI sophistication. A sequel, SWAT 4, was released in 2005, developed and published by Irrational Games and Sierra owner Vivendi Universal.\nGameplay\nIn SWAT 3, players control a police tactical unit as they are deployed to handle situations such as arrest warrants, hostage-takings, bomb threats, and shootouts. SWAT 3 is a tactical shooter, where characters can be killed easily and in few hits; therefore, tactics and planning are emphasized over mere brute force. SWAT 3 is played as a team consisting of five to ten computer-controlled or player-controlled officers over a 16-mission campaign. Enemies, referred to as \"suspects\", range from individuals and small groups to trained and heavily armed terrorists, with the game maintaining a learning curve for players as the complexity of suspects intensifies.\nUnlike military shooters, such as the comparable Rainbow Six series, SWAT 3 emphasizes that the player is part of a police unit tasked with arresting suspects instead of killing them. Much of the game centers around following the rules of engagement, use of force policies, and proper police procedure. Violations of such policies—such as failing to recover evidence or dropped weapons, not securing hostages or surrendering suspects, attacking civilians or other officers, or using excessive force—results in penalties ranging from losing points to mission failure.\nThe weapons and equipment available to the player are tailored to fit the police setting of the game. Lethal firearms—handguns, rifles, submachine guns, and shotguns—are based on real weapons issued to the LAPD SWAT, such as their custom Springfield Armory M1911A1 that appears as the standard-issue sidearm in-game. Lethal weapons come with different varieties of ammunition, primarily less-lethal alternate weapons, such as the M4 carbine having a bean bag round launcher. Bullet penetration is simulated, making \"spray and pray\" fire risky due to the possibility of hitting an unseen NPC. Available equipment includes stun grenades and tear gas grenades to stun suspects; explosive breaching charges to break through locked doors; glow sticks to mark items or locations of note; multi-tools for utility actions such as lock picking; and most prominently the \"Opti-Wand\", a fiberscope-like camera on a telescoping wand used for safely looking around corners and through doorways. Officers wear body armor and enclosed combat helmets with built-in respirators and head-up display projectors inside the faceplate, used to explain the presence of the HUD. The HUD is minimal displays the player's crosshair, stance, commands, and health (the latter as vital sign sensor readings); health in particular cannot be healed or regenerated during a mission.\nMissions can be approached in either stealth or dynamic mode. In stealth mode, the SWAT team moves slowly and deliberately, speaking softly and avoiding loud noises (e.g. quietly lock picking a locked door instead of kicking it down), giving the player the element of surprise. In dynamic mode, the team moves quickly, speaks loudly, and freely uses loud weaponry and equipment (such as breaching charges, grenades, and firearms) to clear an area rapidly. Modes are not set, and the player can freely shift between them, though the game automatically shifts from stealth to dynamic when the team is compromised by a loud noise or contact with a suspect. Difficulty levels range through easy, medium and hard, affecting the aggression and likelihood of surrender of suspects. The player can also separately adjust the amount of time the AI has to determine its actions, from 1 to 20 milliseconds.\nWhen originally released, SWAT 3 did not contain a multiplayer mode, which ultimately drew criticism from both critics and fans; however, roughly a year after the game's release, Sierra made the 1.6 patch available freely online. Among other things, the patch implemented a multiplayer mode, including traditional deathmatch and team deathmatch modes, as well as cooperative play using the singleplayer missions. The 1.6 patch was also implemented into SWAT 3: Elite Edition around the same time. Following the purchase of Sierra by Activision, the SWAT 3 multiplayer servers went down permanently, though unofficial third-party servers are still maintained by players.\nSWAT 3 includes tools and support for modifying the game. A modding community has grown around SWAT 3, producing new missions, maps, weapons, and character models for use in both singleplayer and multiplayer modes.\nPlot\ns.]]In 2005, the United Nations prepares to sign the Nuclear Abolition Treaty at the Los Angeles Convention Center. The event draws world leaders, representatives, and tourists to Los Angeles, but also violent criminals and terrorists seeking to use the signing and the influx of international dignitaries as a platform for their causes. Tasked with protecting the city and the delegates is the LAPD Metropolitan Division's elite D Platoon, SWAT.\nIn July 2005, the LAPD SWAT serves arrest warrants against the sovereign citizen doomsday cult Sovereign America. Then, a string of attacks strike the city: the Turkish ambassador is kidnapped by a Kurdish nationalist group after a bombing; gunmen hold CEO Donald Foreman for ransom in his Hollywood Hills mansion; and Orthodox patriarch Alexei III is taken hostage in a cathedral. SWAT rescues them, and the LAPD learns Alexei III was slated to attend the signing ceremony. Suddenly, an airliner carrying the President of Algeria is shot down by a surface-to-air missile launched by the Neo-Soviet communist People's Liberation Party, who later take the Mayor and other major city figures hostage in a television studio, and attempt to kidnap Russian president Igor Stomas in his hotel penthouse suite. SWAT defeats them in all three incidents, while also intervening in a bank robbery by Sovereign America and arresting the criminals responsible for the mansion and cathedral attacks.\nWith a break in the violence, SWAT is reassigned to protect dignitaries at the Convention Center, and defend them from a surprise attack. The terrorist attacks become increasingly brazen: the People's Liberation Party attacks the air traffic control tower at Los Angeles International Airport to threaten Air Force One; a World Trade Organization meeting is attacked by a militia; and Sovereign America causes a citywide blackout for their leader Tobias Stromm to personally take over Los Angeles City Hall with a suitcase nuke in a suicide attack. SWAT manages to defeat the terrorists and defuse the suitcase nuke. After the blackout, SWAT also intervenes in an attempted storm drain bombing targeting a parade scheduled to pass overhead.\nOn the day of the treaty signing, August 6, 2005, SWAT is deployed to protect the Convention Center, but the People's Liberation Party launches a final attack on the ceremony with a second suitcase nuke. SWAT defeats the PLP, rescues the signatories, and attempts to locate the suitcase nuke. The game's ending depends on whether the player manages to defuse the suitcase nuke: if they fail, the nuke detonates, destroying Greater Los Angeles and killing everyone in the blast; but if they succeed, the signing ceremony continues as scheduled, total nuclear disarmament is achieved, and August 6 is designated Global Peace Day, while the LAPD SWAT returns to their duties.\nDevelopment\nThe game's producer is Rod Fung and the designer is Tammy Dargan; both were part of the team that developed Police Quest: SWAT. Initial development of SWAT 3 began in May 1997 and took over 18 months to complete, with 20 developers working on the game.\nAs the first first-person shooter of the Police Quest series, SWAT 3 received a new game engine, with cell and portal technologies for simulation of environments, and advanced AI and ballistics. The developers spent some time consulting with LAPD SWAT, including a real SWAT element leader and former LAPD chief Daryl Gates, to create an accurate, realistic simulation. Most of the animations in the game were motion captured from an actual SWAT officer.\nA Dreamcast version was planned for release in 2000, but it was ultimately cancelled for unknown reasons.\nSWAT 3 was released in three main versions:\n* SWAT 3: Close Quarters Battle (November 19, 1999), the initial release.\n* SWAT 3: Elite Edition (October 6, 2000), adding multiplayer, new game modes, and new missions. Included in the version 1.6 update.\n* SWAT 3: Tactical Game of the Year Edition (October 10, 2001), adding new missions. Included in version 2.0 update. Retail copies included an 'Advanced Tactics CD' containing real-life SWAT training footage; this content is also available in the game's GOG.com release.\nOlder versions of the game can be upgraded to a newer version through a free download from the game's website.\nReception\nClose Quarters Battle\n| Allgame =\n| CNG = 8/10\n| CGSP =\n| CGW =\n| EPD = 9/10\n| EuroG = 7/10\n| GameRev = B+\n| GSpot = 8.3/10\n| GSpy = 74%\n| GameZone = 8.5/10(TGotY) 8/10\n| IGN = 8.6/10\n| NGen =\n| PCA = 9/10\n| PCGUS = 88%\n}}\nSWAT 3 received \"favorable\" reviews according to the review aggregation website GameRankings. Praise was lavished on the graphics, along with the AI of enemies and civilians and team interaction.\nMax Everingham of NextGen said that the game \"offers a superb gaming experience. Red Storm may play the realism ticket, but Sierra is the one to have nailed it.\"\nPC Gamer UK rated the game 91% and said it was \"All the best ideas from other squad based games, shoehorned into a police setting, perfectly.\" GameSpot commented that \"SWAT 3's most impressive feature has to be the amazing artificial intelligence employed by friend and foe alike\" and praising the graphics and level design, but criticized the lack of multiplayer in the initial release, the tendency for some dialogue to repeat, the need to \"radio in\" every suspect or hostage secured, and the need to restart missions from scratch should the player be wounded.\nTal Blevins of IGN praised SWAT 3's gameplay, graphics, level design, clean interface, briefings, dialogue, and AI (although noting an occasional tendency for computer-controlled SWAT officers to walk into the player's line of fire, resulting in friendly fire incidents). However, the lack of multiplayer and deficiencies in the game's manual were singled out for criticism.\nPeter Olafson of GamePro said, \"For the most part, Sierra does it right here. SWAT 3 isn't everything it might have been, but it's much more substantial than its predecessors--and essentially right in feel. The third time really was the charm.\"\nThe game was a runner-up for Computer Gaming Worlds \"Action Game of the Year\" and PC Gamer US \"Best Action Game\" awards, both of which went to Rainbow Six: Rogue Spear. The staff of PC Gamer US wrote of the game's singleplayer mode, \"graphically, environmentally, and tactically, it was unsurpassed among action games this year.\"\nThe game's sales reached 40,095 units by April 2000.\nElite Edition\n| CNG = 6/10\n| CGW =\n| EuroG = 9/10\n| GSpy = 87%\n| GameZone = 9/10\n| IGN = 8.8/10\n}}\nThe Elite Edition received \"favorable\" reviews according to the review aggregation website Metacritic.\nMartin Taylor of Eurogamer praised the Elite Edition's graphics and level design, and particularly the new multiplayer component, citing efficient, low-lag networking code, and singling out the co-operative mode for its effectiveness. However, he criticized some flaws in multiplayer, admonishing the WON.net multiplayer service, noting that the deathmatch game mode can be dominated by one player with a fast connection camping in one area of the map, and critiquing the ease with which the arrest-based gameplay can break down in a fierce firefight. IGN's review of the Elite Edition was more positive in their review, highlighting the new multiplayer component and the new missions, but noting the presence of some bugs.\nThe Elite Edition received a \"Silver\" sales award from the Entertainment and Leisure Software Publishers Association, indicating sales of at least 100,000 units in the UK.\nSee also\n* Ready or Not, a 2021 tactical shooter considered to be a spiritual successor to the SWAT series\nNotes\nReferences\nExternal links\n* [https://web.archive.org/web/20081107222009/http://www.swat3.com/ Official website] via Internet Archive\n*\n*"
    }
  ]
}