{
  "content": [
    {
      "type": "text",
      "text": "# Swedish Antarctic Expedition\n\n, Otto Nordenskjöld, Karl Andersson, Carl Anton Larsen, Erik Ekelöf, Axel Ohlin, and Gösta Bodman]]\nThe Swedish Antarctic Expedition of 1901–1903 was a scientific expedition led by Otto Nordenskjöld and Carl Anton Larsen. It was the first Swedish endeavour to Antarctica in the Heroic Age of Antarctic Exploration.\nBackground\nOtto Nordenskjöld, a Swedish geologist and geographer, organized and led a scientific expedition of the Antarctic Peninsula. The expedition's overall command was placed under the Norwegian Carl Anton Larsen, an experienced Antarctic explorer who served as captain of , and who had previously commanded a whaling reconnaissance mission in 1892–1893. Seven other scientists, including archaeologist Johan Gunnar Andersson, botanist Carl Skottsberg, and zoologist Axel Ohlin, along with 16&nbsp;officers and men joined them on the voyage. On 16&nbsp;October 1901, the Antarctic left the Port of Gothenburg.\nEvents\nDespite its end and the great hardships endured, the expedition would be considered a scientific success, with the parties having explored much of the eastern coast of Graham Land, including Cape Longing, James Ross Island, the Joinville Island group, and the Palmer Archipelago. The expedition, which also recovered valuable geological samples and samples of marine animals, earned Nordenskjöld lasting fame at home, but its huge cost left him greatly in debt.\nTwo key Antarctic islands are associated with the expedition: Snow Hill Island, where Nordenskjöld and five of his colleagues spent two winters—one of them planned and the second forced by the sinking of the Antarctic—and Paulet Island, where the crew of the Antarctic were stranded from February until November&nbsp;1903. The expedition was rescued by the Argentinian naval vessel Uruguay.\nSnow Hill Island\nOn the way to Snow Hill Island in 1901, Nordenskjöld had passed through Buenos Aires, where the Argentine government gave him supplies and other assistance on the condition that he include in his wintering-over party a young Argentine naval officer, Lieutenant José María Sobral. The American artist Frank Wilbert Stokes also joined the expedition. In 1903, the Argentine government organized a rescue effort with the corvette , which successfully brought back all the surviving members of the Nordenskjöld party.\nPaulet Island\nAfter their ship sank, crushed by the ice about  away, the 20 men from the Antarctic landed on Paulet Island in their lifeboat and built a sturdy double-walled stone hut whose remains are clearly visible today. Apart from the limited supplies they brought from the Antarctic, they survived on the thousand or so penguins they killed, as well as the birds' eggs.\nSee also\n* List of Antarctic expeditions\nReferences\nFootnotes\nBibliography\n* Antarctica. Sydney: Reader's Digest, 1985, pp.&nbsp;152–159.\n* Child, Jack. Antarctica and South American Geopolitics: Frozen Lebensraum. New York: Praeger Publishers, 1988, pp.&nbsp;69, 72.\n* Stewart, Andrew, Antarctica: An Encyclopedia. London: McFarland and Co., 1990 (2 volumes).\n* Nordenskiöld, Otto, Antarctica: or, Two years amongst the ice of the South Pole (Macmillan. 1905)\n* U.S. National Science Foundation, Geographic Names of the Antarctic, Fred G. Alberts, ed. Washington: NSF, 1980.\nExternal links\n* [https://www.coolantarctica.com/Antarctica%20fact%20file/History/antarctic_whos_who_nordenskjold_antarctic.php Antarctic Swedish Antarctic Expedition 1901–1903]\n* [https://www.south-pole.com/p0000091.htm Nordenskjöld's Antarctic Expedition]\n* [http://gdl.cdlr.strath.ac.uk/scotia/gooant/gooant020303.htm Map of the area explored by the expedition]\n* [http://www.newzeal.com/theme/nations/Sweden/swedenantex.htm 2002 revisit the sites of the 1902 Expedition]"
    }
  ]
}