{
  "content": [
    {
      "type": "text",
      "text": "# Switzerland–United Kingdom relations__disambig_1\n\n, London, England to celebrate the friendly relations between Britain and Switzerland.]]\nRishi Sunak with Swiss President Viola Amherd at a Ukraine peace summit in Bürgenstock Resort, June 2024.]]\nSwitzerland–United Kingdom relations encompass the diplomatic, economic, and historical interactions between the Swiss Confederation and the United Kingdom of Great Britain and Northern Ireland. Both countries established diplomatic relations in 1891.\nBoth countries share common membership of the Council of Europe, European Court of Human Rights, the International Criminal Court, OECD, OSCE, and the World Trade Organization. Bilaterally the two countries have the Berne Financial Services Agreement, a Double Taxation Convention, and a Trade Agreement. Both two countries are currently negotiating a Free Trade Agreement.\nHistory\nEver since the 18th century British politicians have made much of Switzerland's neutrality on the European continent and repeatedly took Switzerland's side when dealing with other European powers. Since 1900 the United Kingdom has maintained 12 consulates in Switzerland. Switzerland represented British interests in Germany, Italy, Spain, Japan, and the Axis occupied and allied countries during World War II from 1941 to 1945.\nDuring the Cold War Anglo-Swiss relations became even closer, and due to common interests there was cooperation on a number of issues. Both countries worked together to forestall European integration in the 1960s.\nContacts and relations between the two countries remain close to this day with the respective countries' foreign ministers regularly meeting up to discuss issues of shared concern.\nEconomic relations\nSwitzerland has been a favourite destination for British tourists since the 19th century. The UK is the fourth-most important market in the world for Swiss investors. Around 700 Swiss companies currently do business in the UK with the financial sector playing a large role in Anglo-Swiss economic relations. The British Swiss Chamber of Commerce is an independent organization providing network services for its over 500 members.\nTrade agreements\nFrom 1 January 1973 until 30 December 2020, trade between Switzerland and the UK was governed by the Switzerland–European Union Strade agreements, while the United Kingdom was a member of the European Union. Following the withdrawal of the United Kingdom from the European Union, the UK and Switzerland signed a continuity trade agreement on 11 February 2019, based on the EU trade agreements; the agreement entered into force on 3 May 2021. Trade value between Switzerland and the United Kingdom was worth £53,551 million in 2022.\nOn 15 May 2023, the United Kingdom and Switzerland talked on an upgraded free trade agreement, with Kemi Badenoch, British trade secretary, flying to Bern aiming to boost financial and professional services exports.\nSecurity relations\nDuring the Cold War, the Swiss Army unit Projekt-26 received covert training from the British intelligence agencies MI5 and MI6. In the event of an invasion of Switzerland, P-26 planned to relocate its command centre to Britain.\nResident diplomatic missions\n* Switzerland has an embassy in London.\n* The United Kingdom has an embassy in Bern.\nFile:SwissEmbassyLondon.JPG|Embassy of Switzerland in London\nSee also\n* Foreign relations of Switzerland\n* Foreign relations of the United Kingdom\n* Swiss in the United Kingdom\nReferences\nFurther reading\n* Horn, David Bayne. Great Britain and Europe in the eighteenth century (1967), covers 1603 to 1702; pp 310–26.\n* Wylie, Neville. Britain, Switzerland, and the Second World War (Oxford UP, 2003).\n* Wyss, Marco. ''Arms transfers, neutrality and Britain's role in the Cold War: Anglo-Swiss relations 1945-1958'' (Brill, 2012)."
    }
  ]
}