{
  "content": [
    {
      "type": "text",
      "text": "# Syalakh culture\n\nSyalakh culture is an early Neolithic culture of Yakutia and Eastern Siberia. It formed in the middle Lena River basin in the V — IV millenniums BCE as a result of the migration of tribes from Transbaikalia, which assimilated the local Sumnagin culture (10,500-6,500 BP) that was preceramic.\nThe culture got its name from Lake Syalakh, located 90&nbsp;km from the town of Zhigansk in Yakutia (Saha). The first archaeological excavations in this area were conducted under the direction of A. P. Okladnikov in the 1940s.\nThe sites of the carriers of Syalakh culture are marked by the first appearance of polished stone tools, as well as the earliest ceramics (fired clay pottery with a characteristic mesh pattern). Bone harpoons, and bow and arrows have also been found.\nMore than 50 sites of the Syalakh culture are known. In decorative arts, a central place is occupied by the images of moose, which reflect mythological representation.\nThe Syalakh culture was followed by the Belkachi culture.\nAccording to linguists, the most likely hypothesis is that representatives of this culture spoke one of the Dené–Yeniseian languages.\nAccording to Pavel Flegontov et al.,\n:\"The new wave of population from northeastern Asia that arrived in Alaska at least 4,800 years ago displays clear archaeological precedents leading back to Central Siberia. ... the Syalakh culture peoples, spreading across Siberia after 6,500 YBP, might represent the “ghost population” that split off around 6,500-7,000 YBP, and later gave rise to migrants into America.\"\nThe ancient Paleo-Eskimo peoples were probably involved in these migrations.\nSee also\n*Prehistory of Siberia\n*Settlement of the Americas\n*Ymyyakhtakh culture\nNotes\nLiterature\n*[https://www.yakutskhistory.net/якуты/о-происхождении-якутов/археология-в-якутии/ Yakutia archaeological artifacts] (in Russian)\n*\n*Pavel Flegontov, N. Ezgi Altınışık, Piya Changmai, Edward J. Vajda, Johannes Krause, Stephan Schiffels (2016), [https://web.archive.org/web/20190220151825/http://pdfs.semanticscholar.org/254c/b4db878144cd22c866b65a0cd77aa83d6b81.pdf Na-Dene populations descend from the Paleo-Eskimo migration into America.] https://doi.org/10.1101/074476"
    }
  ]
}