{
  "content": [
    {
      "type": "text",
      "text": "# Sycamore Creek (Kings River tributary)\n\n| name_native        =\n| name_native_lang   =\n| name_other         =\n| name_etymology     =\n| image              =\n| image_size         =\n| image_caption      =\n| map                = Kings River watershed.png\n| map_size           =\n| map_caption        = Map showing the course of the Kings River, and Pine Flat Lake\n| pushpin_map        =\n| pushpin_map_size   =\n| pushpin_map_caption=\n| subdivision_type1  = Country\n| subdivision_name1  = United States\n| subdivision_type2  = State\n| subdivision_name2  = California\n| subdivision_type3  = Region\n| subdivision_name3  = Fresno County\n| subdivision_type4  =\n| subdivision_name4  =\n| subdivision_type5  =\n| subdivision_name5  =\n| length             =\n| width_min          =\n| width_avg          =\n| width_max          =\n| depth_min          =\n| depth_avg          =\n| depth_max          =\n| discharge1_location= at creek at elevation of 1141.96 ft\n| discharge1_min     =\n| discharge1_avg     =\n| discharge1_max     =\n| source1            = Pine Ridge, about 2 miles SW of Sierra Cedars, California, near Shaver Lake\n| source1_location   =\n| source1_coordinates=\n| source1_elevation  =\n| mouth              = confluence with Pine Flat Lake, Kings River\n| mouth_location     =\n| mouth_coordinates  =\n| mouth_elevation    =\n| progression        =\n| river_system       =\n| basin_size         =\n| tributaries_left   =\n| tributaries_right  =\n| custom_label       =\n| custom_data        =\n| extra              =\n}}\nSycamore Creek is a stream, tributary to the Kings River, in Fresno County, California.\nIt has its source on the south face of Pine Ridge, in the Sierra National Forest at an elevation of 5540 feet, about 2 miles SW of Sierra Cedars, California, near Shaver Lake.  It descends steeply to its confluence with its north fork at just below 2000 feet elevation and continues southward to its mouth on Pine Flat Lake on the Kings River at 968 feet.\nSycamore Creek is about  long, flowing in a generally southeasterly direction, with tributary North Fork Sycamore Creek and Watts Creek adding to its waters along the way.  Prior to the construction of the Pine Flat Dam and the creation of Pine Flat Lake, Sycamore Creek flowed directly into the Kings River above the original site of the town of Trimmer, California.\nHistory\nThe flats at the mouth of Sycamore Creek along the Kings River was the site of the 1850 settler cabin and farm of William Mayfield an early pioneer settler of the San Joaquin Valley and father of Thomas Jefferson Mayfield who grew up there and across the river in the village of the friendly Choinumni, Yokuts people after his stepmother died.  The site of the cabin and village are now under Pine Flats Lake.\nReferences"
    }
  ]
}