{
  "content": [
    {
      "type": "text",
      "text": "# Sydney gangland war\n\nThe Sydney gangland wars (or the Gang wars) were a series of murders and killings of several known criminal figures and their associates that took place in Sydney, Australia, during the 1980s. A vast majority of the murders were seen as retributive killings, attempts to control Sydney's drug trade, and expansion of criminal territory. A significant number of the murders that took place during the Sydney gangland war went unsolved, mainly due to corrupt police and their association with members of the Sydney Underworld.\nBackground\nOrganised crime in Sydney can be traced back to the Razor gangs of the 1920s and 1930s. By the 1950s, the Sydney gangland scene started to become more organised with various criminal figures controlling illegal casinos, brothels, SP bookmaking,  Drug Trafficking, nightclubs and ran Protection rackets, across greater Sydney, often supported by corrupt police.\nBetween 1950 and 1968, rival criminals became involved in a series of violent confrontations, resulting in various public shootings. One such confrontation occurred when 45-year-old former boxer and standover man, William \"Bobby\" Lee, was shot at the Ziegfeld Club in Kings Cross in the early hours of 30 May 1951, by rival standover man Chow Hayes. Lee and Hayes were involved in a feud over an assault of an associate of Lee. The feud escalated on 1 May 1951, when a gunman, presumably sent by Lee, shot dead Hayes' nephew and young boxer, Dennis \"Danny\" Simmons, in a case of mistaken identity.\nOn the afternoon of 8 June 1956, 27-year-old standover man and thief, John \"Joey\" Manners was shot three times after leaving the Australian Hotel in The Rocks. It was alleged that Manners was killed by rival criminal, George Joseph Hackett over a dispute of the proceeds of a robbery. Hackett was charged with Manners' murder on 25 October 1956, but was acquitted after a key witness, Keith Craig failed to appear at Hackett's trial. Three years after his acquittal, on 27 July 1959, Hackett was shot and killed before being dumped from a car on Elswick Street in the inner-city area of Leichhardt.\nOn 9 July 1963, standover man Robert \"Pretty Boy\" Walker was shot to death in what the media considered as \"the first murder committed with a machine gun\". It was alleged that Walker's murder was committed by rival standover man Lenny McPherson and his associate and hitman Stan \"The Man\" Smith, in retribution for Walker shooting and wounding Smith during a raid on Walker's home days earlier. The murder of Walker occurred on the night of Lenny McPherson's wedding to his second wife. It was theorised that McPherson and Smith quietly slipped away from McPherson's wedding reception and drove a stolen car to the inner eastern suburbs of Randwick where McPherson and Smith spotted Walker coming out of a house.  As Walker was walking down the street, Smith and McPherson pulled alongside Walker in the car and shot Walker with an Owen Submachine gun, killing him instantly and then driving away from the scene. It was alleged that after killing Walker, McPherson and Smith dumped the car a mile from the scene, disposed of the weapon and changed into a different set of clothes, and then got into McPherson's own car and drove back to the wedding reception where they slipped in unnoticed.\nFollowing Walker's murder, more violent public murders had continued to take place. In early hours of 10 February 1964, 54-year-old standover man and greyhound trainer Charles \"Greyhound\" Bourke was shot 20 times with a high-power rifle on the front lawn of his home in Randwick. Bourke was reportedly involved in a feud with Lenny McPherson over providing protection for a new illegal baccarat club, and was reported to be encroaching on McPherson's protection rackets in the Newtown area.\nBourke's murder was followed by the murder of standover man Robert \"Jacky\" Steele on 26 November 1965. It was alleged that Steele was shot by Lenny McPherson after Steele called McPherson a \"grass\" after reading an article in the magazine Oz about McPherson, naming him as \"fizzgig\" (an informer). Steele spent a month in hospital before dying of his injuries.\nThe year 1967 was marked by more violent and brazen public murders. On 15 January 1967, brothel owner Barry \"Big\" Flock was shot to death in the grounds of the Scottish Hospital in Paddington. A month after Flock's murder, on 7 February 1967, Melbourne gunman James \"Mad Dog\" Sheridan was shot in the head and dumped in a laneway in the Darling Harbour area. Two months after Sheridan's murder, on 22 April 1967, King Cross casino owner Claude Eldridge was shot to death while walking to his car in Neutral Bay. The next public murder occurred on 28 May 1967, when 28-year-old standover man Raymond \"Ducky\" O'Connor was shot at the Latin Quarter club in front of eyewitnesses, including two police detectives. At the time of his murder, O'Connor was on bail for the murder of a Melbourne woman named Shirley Bowker who was hit by a stray round allegedly fired by O'Conner after she was caught in the crosshair of a brawl after a junior VFL game in Richmond on 1 May 1967. It was alleged that O'Connor's murder was committed by Lenny McPherson after learning that O'Connor was running a rival protection racket.\nIt was alleged that prior to O'Connor's murder, McPherson had visited O'Connor in prison and had threaten him. It was speculated that in early hours of 28 May, O'Connor went to Latin Quarter on Pitt Street where he was relieved of his firearm by Criminal Investigative Branch (CIB) detectives, Maurie Wild and Jack Whelan before sitting with the two detectives at a table. McPherson who was sitting at another table, then approached the detectives' table and shot O'Connor twice, killing him. O'Connor's wife, Grace \"The Case\" O'Connor was a member of the UK-based Australian shoplifting gang known as the Kangaroo Gang that were known for carrying out thefts and robberies of high-end department stores, jewellery stores, and banks throughout the UK and Europe during the 1960s and early 1970s. In 1974, Grace O'Connor disappeared from the home that she and fellow Kangaroo Gang member, Tommy Wraith shared on Seymour Grove in Paddington. Her body was never found. It was believed that Wraith and Grace got into a confrontation in which he strangled Grace. It was suspected that after killing Grace, Wraith and an unknown accomplice placed her body in the boot of Wraith's rented car and allegedly drove to an unknown location in Hertfordshire where they dumped O'Connor's body in a shallow grave.\nNearly a month after Ducky O'Connor's murder, on 26 June 1967, 58-year-old casino boss Richard Reilly was shot twice with a shotgun as he was walking to his car parked outside his mistress' apartment in Double Bay. Despite being wounded, Reilly managed to get into the car and drove a few hundred metres before lapsing into unconsciousness and crashing the vehicle into the window of a shop. It was alleged that the shooter was rival baccarat operator and standover man Johnny Warren, who was also named as the shooter in Eldridge's murder. In January 1968, believing his mistress, Gloria McGlinn, was committing infidelity, Warren went to her apartment in Brighton-Le-Sands, where he shot and killed McGlinn, McGlinn's suspected lover and McGlinn's mother before shooting himself in the head. The final public murder took place on the morning of 28 May 1968 when brothel owner Joe Borg was killed by a bomb placed under the driver's seat of his car in Bondi.\nBy the 1970s, criminal figures, under pressure from their associates within the police, began murdering rival criminals more discreetly by luring or kidnapping them, and either murdering them at a secret location and dumping their bodies or throwing them overboard while still alive in the waters off Sydney.\nThe genesis of the Sydney gangland war was the growing heroin trade in NSW during the 1970s. The period saw the heroin trade explode throughout Sydney, mainly imported from the Golden Triangle in Southeast Asia. The catalyst for the gangland war was believed to be the arrest of New Zealand drug trafficker and member of the Mr Asia Drug Syndicate Terry Clark by police in London, for the murder of Clark's associate and head of the Mr Asia Syndicate Marty Johnstone, who was shot on Clark's orders on 9 October 1979. During the mid-1970s, Clark ran a heroin importation ring between Singapore and Sydney, with the aid of Griffith-based 'Ndrangheta member Robert Trimbole. Clark, along with four other members of the syndicate, were convicted of Johnstone's murder and sentenced to life imprisonment. Clark died of a heart attack while serving his sentence in Parkhurst Prison on the Isle of Wight in 1983. Trimbole fled Australia in 1981 after hearing about his pending arrest for his involvement in the 1977 disappearance of anti-drug campaigner Donald Mackay. Trimbole fled to the US, then to France, before being arrested in Ireland. After being released by the Irish courts, Trimbole fled to Spain, where he died of cancer in a Spanish hospital on 12 May 1987.\nGroups and factions\nAt the time of the Sydney gangland war, there were three major criminal groups locked in battle for control of the Sydney Underworld and the drug trade.\nThe Freeman-McPherson Group\nLed by Lenny McPherson and George Freeman. Considered as the \"old school\" criminal group in the Sydney Underworld, the McPherson-Freeman Group ran Sydney's illegal gambling, nightclub and vice trade since the late 1950s and early 1960s. Frederick \"Paddles\" Anderson, Stan \"The Man\" Smith, and Melbourne hitman Chris Flannery were reportedly part of this group. The McPherson-Freeman Group was also commonly referred as \"The Team\".\nThe Smith-Henry Group\nLed by Neddy Smith and his associate and bodyguard Graham \"Abo\" Henry, this criminal group was mainly involved in armed robberies and drug trafficking. The gang largely operated in Sydney's Eastern suburbs. The group included Warren \"Frenchie\" Lanfranchi, Harvey Jones and Danny \"Brain\" Chubb. In 1976, Neddy Smith formed a business relationship with NSW Police Detective Roger Rogerson.\nThe McCann-Domican Group\nLed by Barry McCann and his associate, Irish-born British standover man Thomas \"Tough Tommy\" Domican, this group was mainly involved in drug trafficking and were considered to be a major rival group. Like Smith's gang, McCann's gang operated out of the Lansdowne Hotel in Chippendale. During the 1980s, McCann's gang was involved in a feud with both the McPherson-Freeman and Smith-Henry groups and before getting into a \"tit-for-tat\" feud with Chris Flannery. The group included Barry \"Sugar\" Croft, Terry Ball, George Savvas, Victor Camillieri and Kevin Theobald. McCann was later shot dead at H.J. Mahoney Park in Marrickville on 27 December 1987.\nThe Honoured Society\nA Calabrian 'Ndrangheta group that were involved in the marijuana trade in the Riverina District during the 1970s. The Honoured Society was reported to run a vast marijuana trade between Sydney and Melbourne. Robert Trimbole, Gianfranco \"Frank\" Tizzoni, Antonio Sergi (born 1935), Antonio Sergi (born 1950), Domenic Sergi, Francesco Sergi, and Francesco Barbaro were reportedly part of this group. Even though the Honoured Society weren't directly involved in the Sydney gangland war, some members were reportedly involved in the heroin trade.\nInvestigation\nAt the time of the Sydney gangland war, no investigations into the killings were carried out, due to police corruption. During the Royal Commission, Taskforce Snowy, headed by the NSW Police Assistant Commissioner John Laycock, was established to investigate the killings. Since 1995, Taskforce Snowy carried out the investigation into 14 gangland killings linked to the Sydney gangland war. As a result of Taskforce Snowy's investigations, the NSW Police established additional police investigative taskforces to investigate more unsolved killings attributed to the Sydney gangland war.\nTimeline of events\n1981\n* 27 June 1981 - 22-year-old drug dealer and standover man, Warren \"Frenchie\" Lanfranchi was shot dead by NSW Detective Roger Rogerson on Dangar Place in Chippendale. Lanfranchi was a known associate of Neddy Smith and Graham 'Abo' Henry. At the time of his death, Lanfranchi was under investigation for pulling a gun on a police officer. It was alleged that Smith drove Lanfranchi to a meeting where Lanfranchi was going pay Rogerson $10,000 to make the investigation disappear. When Lanfranchi arrived, Rogerson produced a firearm and shot Lanfranchi in the chest. Lanfranchi's girlfriend and sex worker, Sallie-Anne Huckstepp stated that after shooting Lanfranchi, Rogerson took the $10,000 as Lafranchi was lying on the ground, dying.\n* 3 November 1981 - 24-year-old model and prostitute, Lynette \"Lynn\" Woodward disappeared after leaving the Coroner's Court in Glebe. Woodward was the girlfriend of armed robber Stephen Pauley who was a known associate of Warren Lanfranchi. Prior to her disappearance, Woodward planned to give evidence at a coronial inquest into Lanfranchi's death corroborating Huckstepp's statement that Roger Rogerson killed Lanfranchi and took the $10,000 that Lanfranchi brought with him and Rogerson's criminal activities. After giving evidence on the afternoon of her disappearance, Woodward left via the Coroner's Court rear exit and got in an unmarked police car and was driven away. According to a statement gave by Neddy Smith at the inquest into Woodward's suspected murder in 2018, it is believed that Woodward was driven from the court to an unknown location where it was believed that she was shot and killed by Rogerson and then buried in the sand dunes at Kurnell near Botany Bay.\n* 21 December 1981 - 42-year-old former lawyer, Brian Alexander disappeared after leaving the King's Head Tavern in South Hurstville. Alexander was a known associate of Robert Trimbole, Sydney-based New Zealand drug importer and member of the Mr Asia Syndicate, Terry Clark, and had ties to a number of corrupt detectives. On 25 March 1981, Alexander was charged along with two former federal narcotics agents for leaking confidential information to Clark. At the time of his disappearance, Alexander was subpoenaed to testify at the Steward Royal Commission about his dealings with Clark and information he received from corrupt detectives that was passed onto Clark. According to Neddy Smith, Alexander was picked up by two detectives that Smith knew and was brought onboard Smith's boat where they took Alexander out into the bay and threw him overboard.\n1982\n* 13 August 1982 - Drug dealer and former Painter and Docker Terence Basham and his partner Susan Smith were shot dead at their farmhouse in Murwillumbah. Basham was part of a drug ring with importers Bruce \"Snapper\" Cornwell and Barry Bull. According to the \"mastermind\" of the drug ring, George Tsingolis, Basham fell out with Bull and Cornwell over profits from the drug ring, resulting in Basham assaulting Bull. In retaliation, Cornwell and Bull paid Chris Flannery $50,000 to murder Basham. Flannery shot Basham, wounding him, Flannery then shot Susan Smith in the head, killing her instantly. Flannery turned back to Basham and shot him in the head, killing him. Flannery left the scene, leaving Basham and Smith's two-year-old daughter alive and alone in the house.\n* 10 November 1982 - Former Painter and Docker, Leslie \"Johnny\" Cole was shot dead in the garage of his home at Kyle Bay, at the time of his murder, Cole was working for Frederick \"Paddles\" Anderson. Cole had recently survived another attempt on his life when he was shot in the leg a week before his murder. Cole's son, Mark Moran became a major criminal figure in the Melbourne Underworld and was shot dead during the Melbourne Gangland War on 15 June 2000. It is suspected that Cole's murder was a result of an unpaid debt.\n1983\n* 13 January 1983 - 42-year-old drug dealer, Lewton Shu was shot dead at Royal National Park near Waterfall. At the time of his murder, Shu was on bail for drug trafficking along with his associate, James Murray and Murray's girlfriend, Jennifer Anne Lewis. Murray and Lewis were charged with Shu's murder. While on remand in prison, Lewis was found dead in her cell after hanging herself with a cord from her dressing gown on 25 February 1983. In 2001, Neddy Smith was charged with Shu's murder but at the request of Shu's family, the charges against Smith were dropped.\n* 15 July 1983 - 29-year-old used car salesman and brothel owner, Harvey Jones disappeared after leaving his home. At the time of his disappearance, Harvey Jones was on bail for theft of gold bullion. According to Neddy Smith's autobiography, To Catch and Kill your Own, Jones made an arrangement to pay Rogerson $60,000 to have the gold theft charges dismissed. On 14 July 1983, Jones was involved in an incident where he fired his gun in front of witnesses into the ceiling of Shelia's Tavern in North Sydney, prompting another investigation into Jones. Jones' skeletal remains were found buried at Botany Bay Beach on 26 March 1995 by a man walking his dog. While imprisoned for tow truck driver Ron Flavell's murder, Neddy Smith confessed to a cellmate, that on the night of the disappearance, Jones met Neddy Smith at the Iron Duke Hotel in Alexandria. He left with Smith and an associate and drove to Botany Bay Beach where Neddy Smith shot Jones with a .38 revolver, before burying him in the sand dunes. When Smith's cellmate asked for details, Neddy Smith stated that Jones was \"out of control\" and had been drawing unwanted attention. On 15 September 1998, Neddy Smith was convicted of Jones's murder.\n1984\n* 20 January 1984 - 57-year-old trucking company owner, Edward \"Bill\" Cavanagh and his partner, 21-year-old Carmelita Lee were shot dead in the bedroom of their home in Hoxton Park. Cavanagh was reported to be an associate of Robert Trimbole and other members of the Honoured Society and was alleged to be using his business as a front for the marijuana trade between Sydney and Melbourne. Prior to his murder, Cavanagh allegedly assaulted an associate of hitman, Lindsey Rose and he was murdered in retribution. Carmelita Lee's murder only occurred to eliminate a possible witness. Rose was convicted of the Cavanagh and Lee murders on 3 September 1998 along with a further three murders that Rose committed in the years following including massage parlour owner, Kerrie Pang and Pang's employee, Fatma Ozonal at Pang's massage parlour in Gladesville on 14 February 1994. Pang's partner was an associate of Rose named Mark Lewis who was also allegedly assaulted by Cavanagh some years prior to his murder. One of Cavanagh's sons, convicted armed robber and former Painter and Docker, William Cavanagh who was released to attend Cavanagh and Lee's funerals, and allegedly issued a threat to the media that he would \"shoot the killer or killers\" responsible for his father and Lee's murders.\n*2 April 1984 - 38-year-old racehorse trainer, George Brown was bashed to death and set alight in his car at the top of Bulli Pass. On the night of his murder, Brown was last seen driving his green Ford Falcon XA sedan from his work at the stables in Rosebery to his family home in Kensington. Police believe Brown was murdered by members of a horse racing \"ring-in\" scam. Prior to his murder, one of Brown's horses came second-last at a race meeting in Brisbane on 31 March 1984. It is alleged that Brown's murder was linked to the Fine Cotton ring in.\n*6 June 1984 - 31-year-old NSW Drug Squad detective, Michael \"Mick\" Drury was shot twice through the kitchen window of his family home at Chatswood. It was alleged that the shooter was hitman Chris Flannery hired by Flannery's associate, Melbourne drug dealer and former Painter and Docker, Alan Williams. On 4 March 1982, Drury was in Melbourne as part of a joint New South Wales-Victoria Police operation into a Sydney drug syndicate run by boss, Robert \"Jumping Jack\" Richardson and local distributor, Brian Hansen. Alan Williams was identified by Detective Sergeant Drury as a supplier to Richardson and Hansen. The arrest of Williams went wrong when one of the arrest team's unmarked patrol car went to block in Williams' car and overshot, allowing Alan Williams escape. After a short car chase that ended on the grounds of the Melbourne University, Williams took off on foot through the grounds and disappeared into the night. He was later arrested by detectives in Adelaide four months later in July 1982. It's alleged that an associate of Williams and Flannery, NSW Detective Sergeant Roger Rogerson tried to pay Drury $30,000 to have the charges against Williams dismissed, but Drury refused to accept the money. Despite losing 2 litres of his blood from his wounds, Drury survived his injuries. In 1989, Williams and Rogerson were charged for attempting to bribe Drury and conspiracy to kill Drury. Williams was convicted of drug trafficking and the attempted murder of Drury and sentenced to 14 years imprisonment while Rogerson was acquitted. Williams' co-accused, Richardson was also charged with heroin trafficking. On 4 March 1984, the day before appearing at Williams' preliminary hearing, Richardson disappeared after speaking with two men at an ice cream parlour on Fitzroy Street in St Kilda. His body was later discovered on the side of a dirt road with two gunshot wounds to the back of the head at Strath Creek, near Yea on 31 March 1984.\n*8 November 1984 - 43-year-old drug dealer, Danny \"The Brain\" Chubb was shot dead outside his mother's home in Millers Point. Chubb was an associate of Neddy Smith and was involved in several heroin and marijuana import rings and was seen at various times, showing large amounts of cash in public. On the day of his murder, Chubb left the home of a friend in his green Jaguar XJ6 and drove to the Captain Cook Hotel at Millers Point where he met with Neddy Smith and Abo Henry. After the meeting with Smith and Henry, Chubb went to the local fish and chip shop next to the hotel where he bought a package of fish and chips for his mother's lunch. After telling the owners of the shop that he would return to pay for the meal, Chubb drove to his mother's home about 300 metres from the hotel. As Chubb got out of his car and started walking towards his mother's house, two gunmen appeared with a shotgun and a pistol and shot him. It is suspected that Chubb's murderers were hired by Chubb's former partners.\n1985\n* 3 January 1985 - 72-year-old Chinese restaurant and racehorse owner, Stanley Wong, his wife, 69-year-old Yung Po Chin Wong, and their housekeeper, Ah Ling Wong were found with their throats slashed at their home in Maroubra. Wong was an known associate of George Freeman and was known as a prominent businessman in Sydney's Chinatown. Wong's wife and their housekeeper survived their injuries, due to life-saving surgery by Dr Victor Chang. Prior to his murder, Wong was allegedly involved in the illegal trade of morphine. On 10 January 1985, a Chinese immigrant who was in Australia illegally, Wee Lam Choo was charged with Wong's murder. In his confession, Choo stated that Wong threaten to turn him over to the authorities if he didn't sell any \"white powder\" (illegal morphine) for Wong. Choo was convicted of Wong's murder on 28 February 1986 and was sentenced to life imprisonment. Choo's 18-year-old accomplice was convicted of assault with intentions to commit a robbery and was sentenced to 14 years imprisonment.\n*27 January 1985 - Chris Flannery, his wife, and children were shot at by gunmen outside their home in Turrella. At the time, Flannery was working as a bodyguard for George Freeman and became involved in a feud with Barry McCann and his associate, Thomas \"Tough Tommy\" Domican over the control of Freeman's territory. It was suspected that the gunmen were sent by Domican in retaliation after Flannery allegedly assaulted McCann's wife. Domican was convicted of Flannery's attempted murder in 1988 and was sentenced 14 years imprisonment.\n*16 February 1985 - 41-year-old Melbourne Racing Identity, Michael \"Melbourne Mick\" Sayers was shot dead in the driveway of his home in Bronte. It is suspected that Sayers' killers were sent by Barry McCann, it was alleged that a week before his murder, Sayers stole $400,000 worth of heroin from McCann. Tommy Domican and his associates, Victor \"Vic\" Camillieri and Kevin Theobald were charged with Sayers' murder in 1988 but were acquitted.\n*3 April 1985 - Tommy Domican's associates, Vic Camillieri and Kevin Theobald were shot at as they were sitting in Theobald's car at Kingsgrove. At the time of the shooting, Theobald and Camillieri were driving around Kingsgrove looking for Tommy Domican. Camilleri received wounds to his neck and shoulder and spent ten days in hospital before making a full recovery, while Theobald managed to escape without any injuries. It was suspected that the shootings were committed by Chris Flannery in an act of retaliation for Sayers' murder.\n*12 April 1985 - Tommy Domican was shot at outside the Kingsgrove Police Station. Prior to the shooting, Domican was being interviewed by Detective Sergeant Aarne Tees about the shooting of Camillieri and Theobald. After the interview, Domican left the police station and went to look for a taxi when a gunman on a motorcycle appeared and shot at him. Despite a number of shots fired, Domican managed to escaped unscathed. It was suspected that Chris Flannery committed the shooting as a follow-up to the Theobald and Camillieri shooting in retaliation for Sayers' murder. It was suspected that Detective Sergeant Tees gave the signal to the gunman that Domican was coming out of the police station, allowing the gunman to attack.\n*23 April 1985 - 42-year-old drug dealer, Anthony \"Spaghetti\" Eustace was shot six times allegedly by Chris Flannery in the back outside the Airport Hilton at North Arncliffe. Known to his associates as \"Liverpool Tony\", Eustace immigrated to Australia from the United Kingdom in the mid-1970s where he became an associate of Terry Clark and other members of the Mr. Asia Drug Syndicate. Eustace was suspected in the murders of 25-year-old model and drug courier, Maria Hisshion on 24 December 1975 and 29-year-old drug courier, Catherine Dale Payne on 10 May 1978. Prior to his death, Eustace became an associate of Flannery and was reported to be a heroin supplier to Neddy Smith. When Eustace was found lying beside his Mercedes-Benz, he was rushed to hospital where he told the detectives to \"fuck off\" when they asked him who shot him before dying of his wounds five hours after being shot.\n*9 May 1985 - Chris Flannery disappeared after leaving the family's apartment near the Sydney CBD. Prior to his disappearance, Flannery and his family moved into a rented apartment in the Connaught Building opposite Hyde Park, down the road from the NSW Police CIB Building following the attempt on him and his family's life. According to Neddy Smith, after the failed attempt on Domican and the murder of Tony Eustace, Flannery was seen by the Sydney Underworld as a \"mad man\". Neddy Smith then stated that he along with Rogerson and several other detectives had a meeting with Flannery in an attempt to get Flannery to refrain from committing more retribution shootings in which he told one of the detectives, \"''You're not a protected species, you know - you're not a fucking koala bear\". On the day before his disappearance, Flannery received a message from his pager telling him to \"Ring Mercedes''\" - George Freeman's codename. Flannery then contacted Freeman and was told to come to Freeman's home to inspect a machine gun with silencer that Freeman brought for Flannery. On the day of his disappearance, Flannery left the apartment armed with a .38 revolver. After being unable to start his car, Flannery went back to contact Freeman that he was going to take a taxi to the meeting. After the call, Flannery left the apartment and walked onto Liverpool Street where he disappeared. According to Neddy Smith, it was believed that Flannery was picked up by a car driven by detectives and was taken to the meeting at Freeman's home where he was shot dead with the machine gun by either Lenny McPherson or hitman, Stan \"The Man\" Smith and was later dumped into the sea after the killing.\n1986\n* 6 February 1986 - 31-year-old sex worker and heroin addict, Sallie-Anne Huckstepp was drowned in Busby Pond at Centennial Park. Huckstepp was the former girlfriend of Warren Lanfranchi who was shot dead by Rogerson in June 1981. A month after Lanfranchi's death, Huckstepp and her father went to the NSW Police Internal Affairs Bureau and told detectives that after killing Lanfranchi, Rogerson stole the $10,000 that Lanfranchi brought and named several detectives involved in Lanfranchi's death. Huckstepp appeared on 60 Minutes and told Ray Martin about what happened to Lanfranchi on the day of his death. Prior to her death, Huckstepp started to write articles for a magazine company and began an affair with an Australian Federal Police constable named Peter Smith. It was believed that on the night of her murder, Huckstepp was lured to Centennial Park to meet her drug dealer, Warren Richards where Neddy Smith was waiting in the reeds near the pond. As Huckstepp was talking to Richards, Neddy Smith jumped from the reeds and knocked Huckstepp to the ground and tried to strangle her but was unsuccessful. Neddy Smith then dragged Huckstepp to the pond and held her underwater until she stopped struggling and died. Neddy Smith was charged with Huckstepp's murder in 1999 but was acquitted due to a lack of evidence.\n*6 April 1986 - Neddy Smith was hit by a car as he was leaving the Iron Duke Hotel. Prior to being run over, Neddy Smith was named as police informer. Despite being hit twice, Neddy Smith managed to escape with minor injuries. It was believed that the driver of the car was 41-year-old ex-boxer Terry Ball who was a known associate of Barry McCann. Ball was charged with Smith's attempted murder and released on bail on 30 April 1986. It is alleged that Ball's attempt on Neddy Smith was committed in retribution for Neddy Smith's associate, Abo Henry shooting Ball in the head three years earlier.\n*1 September 1986 - 36-year-old former model and drug dealer, Mark Johnston disappeared after leaving the Bellevue Hotel in Paddington. Known as the \"Playboy Punter\", Johnston previously served a prison sentence in the United Kingdom for importing marijuana. His rented car was found in Maroubra on 9 September 1986 with 500 grams of heroin in the vehicle's boot. Johnston's skeletal remains was found at Botany Beach in October 2007, while imprisoned, Neddy Smith confessed to the murder of Mark Johnston. In his confession he stated Johnston drove his rented car to the home of Neddy Smith's lawyer, Graham \"Val\" Bellamy in Dover Heights where Johnston was to collect $60,000 that Bellamy was holding. When Johnston arrived, Neddy Smith grabbed Johnston and at the request of Bellamy, strangled Johnston to death with a garotte before taking his body to Botany Beach.\n1987\n* 6 August 1987 - 49-year-old drug dealer, Barry \"Sugar\" Croft was shot dead as he was sitting in his car at the intersection of City Road and Myrtle Street in Annandale. Croft was an associate of Barry McCann and was reported to be a major heroin supplier to George Freeman. Prior to his murder, Croft became involved in a heroin importation ring with McCann. On the night of his murder, Croft left the Cauliflower Hotel in Waterloo to meet with McCann at the Lansdowne Hotel. As Croft's Ford Fairlane came to a stop at the intersection, two gunmen on a motorcycle pulled in front of Croft and fired two shots through the windshield, killing him. It is alleged that the gunmen killed Croft to remove him from the heroin importation ring so they could deal with McCann directly.\n*27 December 1987 - 44-year-old heroin supplier, Barry McCann was shot dead at H.J. Mahoney Park in Marrickville. McCann ran the Lansdowne Hotel where his gang operated from and attempted to move in on the Sydney illegal gambling trade run by Lenny McPherson. At the time of his murder, McCann was reportedly involved in a heroin importation ring with former Marrickville councilor, George Savvas. Prior to his death, McCann and Savvas fell out after Savvas undercut McCann's normal heroin distribution price by selling the heroin in Sydney, not Melbourne as was agreed by McCann and Savvas in which two suitcases of heroin went missing. Savvas was charged with McCann's murder in 1988 and was acquitted but was convicted of heroin trafficking and sentenced to 25 years imprisonment. On 7 March 1994, Savvas was sentenced to a further 18 years' imprisonment for masterminding a conspiracy to import 40&nbsp;kg of heroin from South America.\n1988\n* 4 April 1988 - 37-year-old armed robber and drug dealer, Bruce Sandery disappeared after leaving the Zetland Hotel in Zetland. Prior to his murder, Sandery ran a major heroin distribution ring in South Australia and was named in the suspected murders of his associates, Roy Naylor and his wife, Sonya who disappeared from a motel in Glenelg on 29 June 1984. At the time of his murder, Sandery arrived in Sydney from South Australia and was importing heroin into South Australia from New South Wales. Sandery's body was found buried at Botany Bay Beach in October 1988, Neddy Smith was charged of Sandery's murder in 1996 but was acquitted.\nArrest and sentencing\nNeddy Smith was charged as an accessory to the murder of tow truck driver, Ron Flavell, who was stabbed in a road rage incident at Coogee on 30 October 1987 and was sentenced to life imprisonment in 1990. Out of eight murders that Neddy Smith was charged with previously, he had only been convicted for the murder of Harvey Jones. Smith's associate, Graham 'Abo' Henry was sentenced to six years imprisonment for the assault of a police prosecutor on 15 December 1988. Roger Rogerson was convicted of perverting the course of justice in 1990 after detectives found $110,000 deposited by Rogerson in three separate bank accounts under a false name and was sentenced to three years imprisonment.\nReferences in popular culture\nThe Sydney gangland war was first referenced in the drama miniseries, Blue Murder, premiered on the Australian national television network ABC on 14 September 1995. The premise of the two-episode series, focused on the controversial relationship between Neddy Smith and Detective Sergeant Roger Rogerson during the 1970s and 1980s and the vast corruption within the NSW Police. An injunction brought during Neddy Smith's appeal had seen the miniseries' broadcast being delayed in both New South Wales and the Australian Capital Territory until 2001.\nThe second series of the drama series, Underbelly, which loosely focused on events in Sydney and Melbourne between 1976 and 1987, in particular to the marijuana trade in Griffith and the Mr. Asia Syndicate featured several episodes covering events associated with the Sydney gangland war. It aired on the Nine Network from 9 February to 4 May 2009.\nThe follow-up series, which loosely focused on events in Sydney between 1988 and 1999, in particular to organised crime in Kings Cross, covered events leading up to the Royal Commission into the New South Wales Police and the reorganisation of the police service in the Royal Commission's aftermath. It aired on the Nine Network from 11 April to 27 June 2010.\nSee also\n* Crime in Sydney\n* Underbelly: A Tale of Two Cities\n* Underbelly: The Golden Mile\n* Blue Murder\n* Melbourne gangland killings - A similar series of gangland killings that took place in Melbourne, Victoria from 1998 to 2010.\nReferences\n__FORCETOC__"
    }
  ]
}