{
  "content": [
    {
      "type": "text",
      "text": "# Sylvia Ashton-Warner\n\nSylvia Constance Ashton Warner  (17 December 1908 – 28 April 1984) was a New Zealand novelist, non-fiction writer, poet, pianist and world figure in the teaching of children. As an educator she developed and applied concepts of organic, child-based learning to the teaching of reading and writing, and vocabulary techniques, still used today.\nEarly life\nAshton-Warner was born on 17 December 1908 in Stratford, New Zealand, one of ten children born to Francis Ashton Warner, a bookkeeper, and Margaret Maxwell, a schoolteacher 14 years his junior.\nWhen Francis's health deteriorated, Margaret became the sole breadwinner, thus needing to take the younger children to school with her to sit in her classroom while she taught. The older children were left at home with their mostly bedridden father.\nCareer\nAshton-Warner chose teaching as a career partly because it was familiar to her from childhood days spent in her mother’s classroom, and because it gave her a chance to teach her passions, art and music. She attended Wairarapa College in Masterton, 1926–1927, and Auckland Teachers' Training College, 1928–1931. She then worked in Horoera, Pipiriki, Waiomatatini and Omahu, in schools with all or predominantly Māori enrolment, for 24 years.\nOver years of teaching classes of mainly Māori children, she gradually developed her ideas on teaching child-based literacy and key vocabulary techniques. Her articles on this subject were first published in the New Zealand journal Here and Now from 1952–55, and later in her book Teacher.\nAs a novelist, she produced several works centered on strong female characters. Her novel Spinster (1958) was made into the 1961 film Two Loves, starring Shirley MacLaine.\nAshton-Warner was invited to the Aspen Community School in October 1970 and to present at the University of Colorado's third annual reading conference the following June.  She held a six-month visiting professorship at Simon Fraser University in British Columbia in 1971.\nAwards\nAshton-Warner received a number of honors, including the New Zealand State Literary Fund's Scholarship in Letters in 1958. Her autobiography, I Passed this Way (1979), won the New Zealand Book Award for Non-fiction in 1980. She was awarded the Delta Kappa Gamma Society International Educator's Award in the same year. She was appointed a Member of the Order of the British Empire, for services to education and literature, in the 1982 Queen's Birthday Honours list.\nPersonal life\nAs a young woman, Ashton-Warner trained as a pianist, practising up to five hours a day for years before she turned to teaching. She met Keith Dawson Henderson in her first year at Auckland Teachers’ Training College in 1928, when she was 19. They married in Wellington on August 23, 1931. Together they had three children: Jasmine, Elliot and Ashton.\nThe couple worked together for many years, often with Henderson as headmaster and Ashton-Warner as infant mistress. Employment of a married couple in the same school was only possible at the time in Māori schools. Ashton-Warner’s pupils called her Mrs. Henderson. Keith Henderson died at age 60 on  January 7, 1969.\nDeath and legacy\nAshton-Warner died on April 28, 1984 in Tauranga,  with two of her children by her side. Her life story was adapted for the 1985 biographical film Sylvia, based on her work and writings.\nAshton-Warner's ideas for a child-based, organic approach to the teaching of reading and writing, including her key vocabulary techniques, are still used and debated internationally today. Her work has influenced educators and language scholars, as well as the Language Experience Approach (LEA), a literacy program based on the principle that the best way to teach children to read and write is through their own words.\nThe Faculty of Education library at the University of Auckland — the institution at which she trained in 1928 and 1929 — was named the Sylvia Ashton-Warner Library in 1987.\nThe Ashton School in the Dominican Republic was founded in 1998 and named in honour of Ashton-Warner, whose teaching methods inspired the school.\nWhile Ashton-Warner had a somewhat troubled relationship with New Zealand, the country has claimed her as its own. In August 2008, the University of Auckland held a conference to commemorate the centennial of Ashton-Warner's birth. A number of papers from the conference re-evaluated her place in and relationship with New Zealand (see list below).\nEarlier papers of Sylvia Ashton-Warner are held in the Howard Gotlieb Archival Research Center at Boston University. Her later papers are held in the Alexander Turnbull Library in Wellington. Further material collected by Ashton-Warner's biographer, Lynley Hood, is held in the Hocken Collections in Dunedin.\nQuote\n\"Pleasant words won't do. Respectable words won't do. They must be words organically tied up, organically born from the dynamic life itself. They must be words that are already part of a child's being.\"\nSelected publications by Sylvia Ashton-Warner\n*Spinster. London: Secker and Warburg, 1958; New York: Simon and Schuster, 1958.\n*Incense to Idols. London: Secker and Warburg, 1960.\n*Teacher. New York: Simon and Schuster, 1963.\n*Greenstone. New York: Simon and Schuster, 1966.\n*Myself. New York: Simon and Schuster, 1966; London: Secker and Warburg 1967.\n*Three. New York: Knopf, 1970.\n*Spearpoint. New York: Knopf, 1972.\n*I Passed This Way. New York: Knopf, 1979; London: Virago, 1979.\nPapers produced as a result of the 2008 conference\n* Middleton, Sue. '[http://www.TeAra.govt.nz/en/biographies/6a1/1 Ashton-Warner, Sylvia Constance - Early life and marriage]', from the Dictionary of New Zealand Biography. Te Ara - the Encyclopedia of New Zealand, updated 6-Dec-11\n* Middleton,  Sue. (2011), Putting Sylvia Ashton-Warner in her Place: History, Geographical  Theory and the New Education. Paedagogica Historica, First published on: February 24, 2011 (iFirst) .\n* Jones, A. and Middleton, Sue. (2009). Introduction. In A. Jones and S. Middleton (Eds.), The kiss and the ghost: Sylvia Ashton-Warner and New Zealand. Wellington: NZCER Press (NZ edition) and Rotterdam and Taipei: Sense (Rest of the World edition), pp.&nbsp;1–8 (Sense edition page numbering)\n* Middleton, Sue. (2009). Sylvia’s place: Ashton-Warner as New Zealand educational theorist. In A. Jones and S. Middleton (Eds.), The kiss and the ghost: Sylvia Ashton-Warner and New Zealand.     Wellington: NZCER Press (NZ edition) and Rotterdam and Taipei: Sense (Rest of the World edition), pp.&nbsp;35–50 (Sense edition page numbering).\nReferences\nFurther reading\n*Durix, Carole. 'Literary autobiography or autobiographical literature? The work of Sylvia Ashton-Warner.' Ariel, 18:2 (1987): 3-12.\n*Durix. C. 'Sylvia Ashton-Warner: portrait of an artist as a woman.' World Literature Written in English, (1980): 104-110.\n*Durix, C. 'The Maori in Sylvia Ashton-Warner's fiction.’ Literary Half-Yearly, 20 (1979): 13-26.\n*Edgar, Suzanne. 'Sylvia Ashton-Warner.' Quadrant, 26:6 (1982): 58-61.\n*Else, Anne and Heather Roberts, eds. A Woman’s Life: Writing by Women about Female Experience in New Zealand. Auckland: Penguin, 1989.\n*Hood, Lynley. Sylvia! The Biography of Sylvia Ashton-Warner. Auckland: Viking, 1988.\n* James, Judith G. and Nancy S. Thompson. 'Sylvia Ashton-Warner's lost novel of female friendship.' Phoebe, 5:2 (1993): 43-55.\n*McEldowney, Dennis. 'Sylvia Ashton-Warner: A Problem of Grounding.' Landfall, 91, 23:3 (September 1969): 230-245.\n*Stead, C. K. 'Sylvia Ashton-Warner: Living on the Grand.' In the Glass Case: Essays on New Zealand Literature. Auckland: Auckland University Press; Oxford University Press, 1981, pp.&nbsp;51–66; revised and republished in Kin of Place: Essays on twenty New Zealand Writers. Auckland: Auckland University Press, 2002, pp.&nbsp;99–111.\n*\nExternal links\n*\n*[https://archive.today/20121220065237/http://www.nzlf.auckland.ac.nz/author/?a_id=4 List of books and published material]\n*[http://www.bookcouncil.org.nz/Writers/Profiles/Ashton%20Warner,%20Sylvia Biographical entry from The Oxford Companion to New Zealand Literature]\n*\n*[https://tiaki.natlib.govt.nz/#details=ecatalogue.13695 Sylvia Ashton-Warner Papers] at Alexander Turnbull Library"
    }
  ]
}