{
  "content": [
    {
      "type": "text",
      "text": "# Syndicate Wars__disambig_1\n\n}}PlayStation|EU|July 1997}}\n|genre = Real-time tactics\n|modes = Single-player, multiplayer\n|platforms = DOS, PlayStation\n}}\nSyndicate Wars is an isometric real-time tactical and strategic game, developed by Bullfrog Productions and published by Electronic Arts. It was released for DOS in 1996 and for the PlayStation in 1997. It is the second video game title in the Syndicate series, retaining the core gameplay and perspective of the original Syndicate, but with a setting 95 years further into the future.\nA first-person shooter follow-up (simply titled Syndicate) was developed by Starbreeze Studios and released in February 2012. This was followed by a spiritual successor (developed by the Syndicate Wars producer and lead programmer Mike Diskett), Satellite Reign, in August 2015.\nPlot\nSyndicate Wars follows on from to the events in Syndicate, taking place 95 years later (in the year 2191). At the game's opening, the player-controlled syndicate (called EuroCorp) is at the peak of its power (achieved during the previous game), a megacorporation controlling the world through a combination of military and economic power, and technological mind control, using the CHIP implant technology they developed. Corporate decisions are facilitated through a number of AI entities connected through a global communications network.\nAs the game opens, this totalitarian status quo is threatened by the emergence of a virus named \"Harbinger\" in the global communications system, damaging mind-control CHIP implants and leaving citizens vulnerable to co-option. Some of the newly liberated persons, dubbed \"unguided citizens\", choose to engage in an armed insurrection. The Unguided appear in early missions as random antagonistic elements, but over time form a well-organized militia.\nViral damage to the global network causes disruption to Syndicate coordinations, with individual stations isolating themselves to avoid receiving rogue communication. The London station, as the headquarters of the EuroCorp syndicate, attempts to regain authority via direct intervention by the game's signature quartets of heavily armed agents.\nThe virus was released by the Church of the New Epoch, a religious group led by a group called \"The Nine\" and following a religious text known as \"The Book of Cataclysm\". The Church are seeking to undermine the world rule by corporations in favor of subjecting its parishioners to its own variety of mind control. \"Harbinger\" was their first step in demolishing the existing world order. The stated origins of The Nine differ between the in-game narrative (which identifies them as an offshoot of a EuroCorp research group named C3 (the Cybernetic Cognition Conference)), and the official strategy guide, which names the Otherworld Research Group, a group of top scientists who were researching alien technology found at an archeological dig site near Reykjavik. In-game, \"The Codex\" is a repository of advanced technology; in the strategy guide \"The Codex\" is an encrypted set of alien technological information.\nThe bulk of the game concerns the development of armed conflict between EuroCorp and the Church. As insurrections take hold, the player is also obliged to conduct missions to control rogue elements within the syndicate itself, as various sub-corporations change allegiances or make bids for independence.\nThe game's story culminates in a battle for control of the moon (accessible via a transport system called the \"orbital elevator\"), with The Nine intending to convert ionosphere calibration equipment located there into a weapon (known as the \"ion gate\") and destroy all life on Earth; however, The Nine are eliminated, and the weapon deployment does not succeed.\nThe ironic parallels between the objectives of Church of the New Epoch and the original EuroCorp syndicate itself are abundantly clear throughout the game, further reinforced by the fact that the game can be played from the point of view of the Church itself to similar ends. It is revealed early in the game, when played on the Church's side, that the \"disciple\" in control of Church agents is a former EuroCorp agent who has been converted.\nGameplay\nScreenshot from in-game combat\nSyndicate Wars' instruction manual specifically addresses the player as a newly hired EuroCorp executive; however, they can choose to control agents from either EuroCorp or the Church of the New Epoch.\nThe game preserves the isometric view of Syndicate, while adding rotation and pitch controls over that view. The player commands four agents (or acolytes, when playing as the Church), either singly or in groups, to complete a series of globally-located missions, the objectives for which include assassinating a specific target, or stealing a specific object. Although the general mission structure remains consistent when playing as either EuroCorp or the Church, they are made distinctive by differences in the pre-mission briefings which are delivered to the player in the form of a fictional email system.\nDuring missions, the health, shields and weapon energy (which functions in the place of specific ammunition) of the player's agents will recharge over time. New weapons can be acquired either by picking them up during missions, or by completing research (which is also used to upgrade agents' cybernetic components). Weapons available early in the game include uzis (the default weapon), miniguns, and flamethrowers; however, later stages of the game introduce directed-energy weapons, such as the pulse laser, electron mace, plasma lance, and graviton gun. Other items of equipment available include rocket launchers, gas grenades, explosives, armed drones, and equipment to direct orbital bombardment from satellites.\nThe 'Persuadertron' device, first introduced in the original Syndicate, is also available (though known as the 'Indoctrinator' when playing as the Church of the New Epoch). This device is used to convert NPCs (both civilians and enemy characters) to follow and fight alongside the player's agents. Some of the game's missions also include objectives to persuade specific characters.\nAlmost all in-game structures can be destroyed, and in-game currency, for conducting research and purchasing equipment, is acquired through the robbing/destruction of banks, which are located within specific missions. The game also includes the ability for both player agents and NPCs to use vehicles, some of which include the ability to fly over in-game terrain.\nMultiplayer\nSyndicate Wars supports competitive multiplayer, known as \"Multicorp\", over a local area network connection, with players receiving points for each enemy agent killed. Mike Diskett (the game's producer and lead programmer) described the multiplayer mode as \"a mixture of Quake and Command & Conquer, because you end up with the Quake aspect of just going out there to kill as many people as possible, but you also build bases up. This isn't something we've designed in; this is just how we ended up playing it.\"\nThe PlayStation version also allows co-operative play, where up to four players each control an individual agent, using multiple game controllers and a single shared screen.\nDifferences in PlayStation version\nThe PlayStation version of the game features a different introduction cutscene and differences in certain levels compared to the PC version. Some aspects of gameplay are also different between the two versions; for example, the ability to research specific items does not exist in the PlayStation version, with new items instead being made available in a fixed order, following mission completions.\nThe PlayStation version also features different graphics, only functioning in the lower-resolution setting from the PC version, but also featuring some graphical improvements, such as transparency.\nIn-game advertising\nSyndicate Wars included in-game advertising, taking the form of video billboards placed within the game's locations. The adverts within the game included Manga Entertainment's Ghost in The Shell, Judge Dredd from 2000 AD, and Bullfrog Productions' own in-development game project, Creation.\nDevelopment and release\nSyndicate Wars was developed by Bullfrog Productions using a modified version of the engine used in Magic Carpet. Mike Diskett recounted that:\n... in the first [Syndicate], one of the biggest complaints was it was an isometric view and if you walked behind a building, that was it, you couldn't see yourself. So now you can walk behind buildings and simply rotate the map so you can always keep yourself in view. We had to wait for a while for the technology to catch up so we could actually do that.\nThe AI was also enhanced so that enemies would work as a team, whereas in the original Syndicate each one would act as though unaware of the other members of their group.\nIt was originally announced that the game would be released exclusively for the PlayStation in the second quarter of 1996. Instead, in 1996 it was released for DOS, with the delayed PlayStation version arriving in 1997. A Sega Saturn version also began development; however, it was cancelled later in 1997, with Bullfrog's head of conversions, Steve Metcalf, explaining that the Saturn market was not large enough to cover development costs.\nBullfrog Productions also released an official guide to the game, which was printed by Prima Publishing in 1996.\nIn 2008, a digital distribution of the PlayStation version of the game was released on the European PlayStation Network.\nGOG.com released an emulated version of the DOS version for Microsoft Windows and Mac OS X in 2013.\nReception\n| GSpot = 7.5/10 (PC)5.3/10 (PS)\n| NGen =  (PC) (PS)\n| PCZone = 95/100 (PC)\n| CGM =  (PC)\n}}\nA reviewer for Next Generation described Syndicate Wars as \"even more dark and menacing than the original.\" He said that while the graphics suffer from chunkiness and ragged characters in the standard VGA mode, in SVGA mode they are stunning. While he complained that the control interface is a pain to adjust to, he found the new weapons, completely interactive environments, and numerous missions make it worthwhile to do so. While similarly praising the polygonal graphics, interactive environments, and numerous missions, Greg Kasavin of GameSpot found the characters to be overly small and hard to discern between, even in SVGA, and complained that the rotational graphics engine often results in enemies getting free hits. He nonetheless concluded, \"Syndicate Wars masterfully recaptures the dark, deadly emotion of the original, adds to it a huge variety of weapons and scenarios, and refurbishes it with a gorgeous new coat of paint.\"\nThe game won Computer Games Strategy Pluss 1996 action game of the year award.\nCritics widely held the PlayStation version to be inferior to the PC original, chiefly because the translation from mouse and keyboard to gamepad and (optional) mouse results in a control scheme which is convoluted and frustrating. Next Generation said the control \"just never feels right\" and Glenn Rubenstein of GameSpot commented that \"the game never plays smoothly, not even when you're fully used to the controls.\" Despite this, both Rubenstein and Next Generation said they more strongly recommended the PlayStation version than the PC version to strategy fans, since there were few strategy games available on the PlayStation to date, whereas the PC original had debuted in competition with several critically acclaimed strategy games.\nCritics also widely praised the PlayStation version's highly detailed 3D environments, though some commented that the character animations fail to adequately stand out. Dan Hsu of Electronic Gaming Monthly assessed that \"I like the futuristic Blade Runner-type setting, but other factors weighed this game down, like the so-so animation, the pain in the butt controls and the boring gameplay (you pretty much do the same thing each stage).\" GamePro was more optimistic: \"... a heavy dose of manual reading is required to play the game, which makes Syndicate Wars difficult to get into at first. After a while, though, you'll be rewarded with an addicting, complex game.\"\nSequels and spiritual successors\nAccording to a former Bullfrog Productions employee, a follow-up Syndicate title for PC began development shortly after the release of Dungeon Keeper 2 in 1999; however, this development effort was never completed. This was followed by several further development efforts which did not progress.\nThe same employee states that a Syndicate title on PlayStation 2 was under development for approximately one year; however, this title was also never released. It was intended to feature featuring a \"free-roaming multi-tiered city\" and two new factions, known as the Freemen and the Hybrid. Several pieces of concept art from this project were released by another former Bullfrog employee, Mike Man.\nIn a 2006 interview at the Leipzig Games Convention for GameSpot, Peter Molyneux (co-founder of Bullfrog Productions) said that he would like to revisit some of his old efforts, but adds that it is very unlikely that will happen. But Molyneux makes one possible exception:\"Aside from the licensing complications, some sort of next-gen online version of Syndicate would certainly be popular with gamers.\"\nCreation\nBullfrog originally planned to create another game in the Syndicate universe, named Creation, and included in-game ads for this game within Syndicate Wars; however, Creation was cancelled during development and never released.\nSyndicate (2012)\nStarbreeze Studios developed a new Syndicate game for EA, replacing the real-time tactics format with that of a first-person shooter. It was announced in September 2011 and released on 21 February 2012.\nSatellite Reign\nOn 15 May 2013, Mike Diskett posted a video on YouTube that revealed an imminent Kickstarter crowdfunding campaign for a new spiritual successor to Syndicate Wars, called Satellite Reign, which returned to the series' original real-time tactics format. When it closed on 28 July 2013, the campaign had raised £461,333 ($720,832), compared to its £350,000 ($546,875) goal. Satellite Reign was subsequently released on August 28, 2015.\nReferences\nFurther reading\nExternal links\n*[https://www.mobygames.com/game/syndicate-wars Syndicate Wars] at MobyGames\n*[https://gamefaqs.gamespot.com/pc/198873-syndicate-wars Syndicate Wars] at GameFAQs"
    }
  ]
}