{
  "content": [
    {
      "type": "text",
      "text": "# Syrians in the United Kingdom\n\nSyrians in the United Kingdom or Syrian Britons are people whose heritage is originated from Syria who were born in or who reside in the United Kingdom.\nDemography\nThe 2011 UK census recorded 8,526 people who stated that they were born in Syria and reside in England; 322 in Wales, 379 in Scotland and 31 in Northern Ireland.\nIn the 2021 UK census, 40,707 people in England were recorded as having been born in Syria, as well as 2,168 in Wales, and 1,810 in Northern Ireland. The census in Scotland was delayed by a year until 2022 and recorded 5,844 residents born in Syria.\nIn the six-year period between 2018 and 2023, 8,581 Syrian nationals entered the United Kingdom by crossing the English Channel using small boats – the fifth most common nationality of all small boat arrivals.\nNotable people\nBusinesspeople\n*Mustafa Suleyman, CEO of Microsoft AI and co-founder of DeepMind, which Google bought for an estimated £400 million in 2014. He is also the co-founder of Inflection AI.\n*Ayman Asfari, billionaire businessman, former CEO of Petrofac.\n*Wafic Said, billionaire businessman, he established the Saïd Business School at the University of Oxford in 1996.\n*Simon Halabi, property developer. In 2007, he was listed as the 14th richest person in Britain.\n*Helly Nahmad, art dealer, he descends from a billionaire family that originated in Aleppo.\n*Ronald Mourad, Chairman of The Portland Trust and Bridges Ventures; his parents were originally from Aleppo.\n*Kasim Kutay, CEO of Novo Holdings A/S.\nActors and entertainment\n* Wentworth Miller, actor, known for his role as Michael Scofield in the Fox series Prison Break\n* James Dreyfus, actor, most notable for roles on television sitcoms The Thin Blue Line as Constable Kevin Goody\n* Patrick Baladi (born 1971), actor and musician, known for his role in the British show ‘The Office’\n*Souad Faress (born 1948), actress, best known for her roles in Game of Thrones (season 6) and BBC's Radio 4 program The Archers.\nArtists and designers\n* Moussa Ayoub (c.1873–1955), Syrian-born British painter and portraiture artist.\n* Khairat Al-Saleh (born 1940), painter, ceramicist, glassmaker and printmaker\n* Yasmin Hayat (born 1990), painter of miniatures\n* Nabil Nayal: fashion designer who won the Fashion Trust Grant from the British Fashion Council and the Royal Society of Arts Award\nAcademia\n*Kefah Mokbel, renowned breast cancer surgeon and researcher\n*Kamal Abu-Deeb (born 1942), Chair of Arabic at the University of London\n*Dennis W. Sciama (1926–1999), British physicist of Syrian-descent who, through his own work and that of his students, played a major role in developing British physics after the Second World War.\n* Ella Al-Shamahi (born 1983/1984), paleonanthropologist, biologist, and comic\nWriters and journalists\n* Danny Abdul Dayem, citizen-journalist who reported from Homs, Syria between 2011 and 2012.\n* Mai Badr (born 1968), editor-in-chief of Hia Magazine and deputy editor-in-chief of Sayidaty and Al Jamila.\n* Zaina Erhaim, journalist and feminist\n* Nadine Kaadan (born 1985), children's illustrator and writer\n* Rana Kabbani, writer, broadcaster and cultural historian\n* Mustapha Karkouti: journalist and media consultant\n* Waad Al-Kateab, journalist and documentary filmmaker\n* Abdallah Marrash (1839–1900), Syrian writer involved in various Arabic-language newspaper ventures in London and Paris.\n* Nadim Nassar, writer, director of the Awareness Foundation and the only British-Syrian priest in the Church of England\n* Saba Sams, writer\n* Yasmine Seale, writer and translator\nOther\n*Asma al-Assad (born 1975), the former First Lady of Syria.\n*Kefah Mokbel, breast surgeon and founder of the UK charity Breast Cancer Hope. In November 2010, he was named in the Times magazine's list of Britain's Top Doctors\n*Philip Stamma, 18th-century chess master and pioneer of modern chess.\n*Sami Khiyami, Syrian diplomat, former Syrian ambassador to London.\n*Shaha Riza (born c.1953), a Libyan former World Bank employee.\n*Dima Aktaa, Syria-born athlete whose family moved to the UK\nSee also\n*Syria-United Kingdom relations\n*Islam in the United Kingdom\n*Kurds in the United Kingdom\n*Turks in the United Kingdom\n*British Arabs\n*Syrian Vulnerable Persons Resettlement Programme\nReferences\nExternal links\nAssociations\n*[http://sb-ms.org/ Syrian British Medical Society (SBMS)]\n*[http://www.syriasamh.com/enIndex.htm Syrian Association for Mental Health (SAMH)]\n*[http://www.syrianldp.com/en Syria Legal Development Program (SLDP), London]\n*[http://www.syriarelief.org.uk Syria Relief, Manchester]\n*[https://hihfad.org/ Hand In Hand for Aid and Development]\n*[http://www.international-alert.org/projects/syrian-platform-peace Syrian Platform for Peace (supported by International Alert)]\n*[http://www.oka.org.uk The Oxford Kurdish and Syrian Association, Oxford]\n*[http://www.rrsoc.org Rethink Rebuild, Syrian Community in Manchester]\n*[https://www.caabu.org/ The Council for Arab-British Understanding (Caabu)]"
    }
  ]
}