{
  "content": [
    {
      "type": "text",
      "text": "# Syrian Revolutionary Left Current\n\n| logo             = Revolutionary left current in Syria logo.png\n| colorcode        =\n| colors           = |border=darkgray}} Red\n| leader           =\n| leader1_title    = Notable members\n| leader1_name     =\n| deputy_leader    =\n| president        =\n| chairman         =\n| general_secretary =\n| first_secretary  =\n| secretary_general = Ghayath Naisse\n| presidium        =\n| secretary        =\n| spokesperson     =\n| foundation       = October 2011\n| ideology         =  Participatory democracyDirect democracySecularism}}\n| headquarters     = Athens, Greece\n| international    = International Socialist Tendency\n| website          = https://revoleftsyria.org\n| country          = Syria\n}}\nThe Syrian Revolutionary Left Current is a leftist political organization that opposed the Ba'athist-led government of Syria. Formed in October 2011, the group supports the uprising against the Syrian government and aims to build a \"democratic, civil, and pluralist state\" in Syria, while opposing any foreign military intervention in the Syrian Civil War.\nIdeology and history\nDuring the formation of the Syrian Revolutionary Left Current in October 2011, its founding documents stated that it \"adopts the major objectives of the Syrian People's Revolution, for freedom, democracy, dignity and social justice, and is committed to engage in mass action to achieve these objectives.\" It considered that \"revolutionary dynamics is about building a democracy from below\", and advocated for participatory democracy and direct democracy. The Revolutionary Left Current opposes all forms of foreign military intervention in Syria, including by NATO, by the Arab League, by Israel, and by Turkey.\nThe Revolutionary Left Current's founding document also outlined a list of goals for the group and for other Syrian opposition groups, which were to overthrow the Syrian government and establish a \"Provisional Revolutionary Government\", dismantle the \"security infrastructure of the state\", and election of a Constituent Assembly.\nIn August 2013, the Syrian Revolutionary Left Current condemned the Islamic State of Iraq and the Levant and the al-Nusra Front, and amid the Syrian Kurdish–Islamist conflict, it \"reaffirmed its commitment\" to support self-determination for Kurds in Syria. It also condemned the Syrian National Council for refusing to recognize rights for Kurdish people in Syria.\nOn 23 September 2014, the group condemned the American-led intervention in Syria which began with airstrikes against ISIL, al-Nusra Front, and Ahrar al-Sham in Syria.\nIn the spring of 2016, the Syrian Revolutionary Left Current and Greek leftist groups opened 6 centers in Athens, housing 2,400 Syrian refugees.\nIn September 2016, the Syrian Revolutionary Left Current formed an alliance with the Syrian National Democratic Alliance and the Syrian Democratic Forces on the basis of political decentralization and the establishment of a pluralist democracy in Syria. When the Turkish Armed Forces launched a military operation against the SDF in the Afrin Region on 20 January 2018, the Revolutionary Left Current condemned the operation and announced its support for the SDF in Afrin against Turkey. On 1 May 2019 (International Workers' Day), the Syrian Revolutionary Left Current released a statement condemning the \"bourgeois regime\" of Syria and Turkey, and blaming the collapse of the Syrian Revolution on the absence of a \"revolutionary party\".\nPublications\nSince January 2012, the Revolutionary Left Movement in Syria has published its newspaper, The Front Line, the mouthpiece of the organization, which is considered one of the main channels used by the movement to communicate with the public. The newspaper provides articles and analysis on a variety of topics, including Syrian politics and socio-economic issues. The newspaper reflects the movement's commitment to socialist and revolutionary values, and seeks to present an alternative vision for the Syrian future from a revolutionary socialist point of view.\nThe newspaper is printed in Syria and distributed in all Syrian governorates, and is published as a pdf version on the website  and on social media.\nHe has also published a number of pamphlets and books, including: Who are we?, The Syrian Communist Party: Decadence and Splits, The Marxist position on the religious phenomenon, the reactionary reaction and counter-revolution in Syria, the Syrian bourgeoisie and the popular revolution, in order to build the militant socialist left, Ukraine and the imperialism of the twenty-first century.\nArmed wing: People's Liberation Faction\n| native_name_lang =\n| war              = the Syrian Civil War\n| image            = Flag of the People's Revolutionary Faction.svg\n| caption          =\n| active           = 18 March 2014 – 26 January 2015\n| ideology         =\n| position         =\n| leaders          = *\"Lorca\"\n*\"Midou\"\n*\"Abu Layla\"\n| clans            =\n| headquarters     =\n| area             =\n| size             =\n| allegiance       = Syrian Revolutionary Left Current\n| partof           =  Free Syrian Army\n| predecessor      =\n| successor        =\n| allies           = In Kobanî:\n* People's Protection Units\n* Women's Protection Units\n* Kurdistan Workers' Party\n| split            =\n| opponents        =  Syrian Armed Forces\nAl-Nusra Front\n| battles          = Siege of Kobanî\n| website          =\n}}\nArmed members of the Revolutionary Left Current operating in Syria announced themselves in January 2014. On 18 March 2014, three armed and masked militants announced the formation of the People's Liberation Faction as part of the Syrian Revolutionary Left Current. Fighters of the group were armed with Kalashnikov rifles, PK machine guns, and RPG-7s. The group also used a technical, a mortar, and a DShK heavy machine gun. It cooperated with several local Free Syrian Army-affiliated groups.\nOn 12 April 2014, a unit in the group attempted to redeploy fighters from the Hama Governorate to support other rebel groups in the Battle of Aleppo, when they were stopped at an al-Nusra Front checkpoint. Clashes then ensued and 3 fighters from the People's Liberation Faction were killed.\nFighters of the group redeployed to Kobanî in order to reinforce the city against an ISIL offensive in September 2014.\nIn late 2014, due to persecution by \"counter-revolutionary forces\", the People's Liberation Faction largely suspended its activities in Syria. It officially announced its dissolution on 26 January 2015.\nReferences\nSee also\n* Leon Sedov Brigade, another Trotskyist Free Syrian Army unit in the Syrian civil war"
    }
  ]
}