{
  "content": [
    {
      "type": "text",
      "text": "# System for Award Management\n\nThe System for Award Management (SAM or SAM.gov) e-procurement system collects data from suppliers, validates and stores this data, and disseminates it to various government acquisition agencies.\nUsers and registrants\nUsers of SAM include contracting officials, grant-makers, contractors, and the public. Those required to register in SAM include:\n* Vendors: Those doing business with the federal government \"will be able to log in to one system to manage their entity information in one record, with one expiration date, through one streamlined business process.  Federal agencies will be able to look in one place for entity pre-award information.  Everyone will have fewer passwords to remember and see the benefits of data reuse as information is entered into SAM once and reused throughout the system.\"\n* Grant-seekers and grantees: \"Active SAM registration is a pre-requisite to the successful submission of grant applications!\"\nThere is no charge for registration. Renewal must be done annually.\nHistory\nThe Central Contractor Registration (CCR) was the primary supplier database for the U.S. Federal government until July 30, 2012.\nIn October 1993, President Bill Clinton issued a memorandum that required the Government to reform its acquisition processes. Subsequently, the Federal Acquisition Streamlining Act of 1994 was passed, requiring the establishment of a \"single face to industry\". To accomplish this, the United States Department of Defense (DoD) designated a centralized, electronic registration process, known as CCR, as the single point of entry for vendors that want to do business with the DoD. To this end, the Defense Federal Acquisition Regulation Supplement (DFARS), Subpart 204.7300, required contractors to register in the CCR to conduct business with the DoD.\nA new Federal Acquisition Regulation (FAR) policy, published October 1, 2003 (Circular 2003-016, FAR case 2002-018), requires that all federal contractors register in the CCR database prior to the awarding of any contract or purchase agreement.\nThe contractors providing services to DoD are required to file reports on the funding source, contracting vehicle, organization supported, mission and function performed, and labor hours and costs for contracted efforts through a separate ECMRA website.\nTransition to SAM\nJuly 24, 2012 began Phase I of a consolidation of federal government systems used for contracting to SAM (System for Acquisition Management). On that date, users were no longer permitted to enter new information into the CCR or the other systems being migrated in Phase I to allow sufficient time for their data to be migrated to SAM.  After July 30, 2012, users who visited the CCR, ORCA, or EPLS websites are automatically redirected to SAM.gov.\nOn July 30, 2012, the CCR transitioned to the System for Award Management (SAM), which combined legacy users' records in the CCR and eight other separate websites and databases that aided in the management of Federal procurement from start to finish. This consolidation SAM was designed to \"reduce the burden on those seeking to do business with the government.\" In addition to eliminating redundancies and streamlining processes, SAM provides a single help desk to resolve issues with any of the databases.\nThe systems combined into SAM are listed below, grouped by functional area. Their migration to SAM is being conducted in phases: Phase I of SAM includes the functionality from the entity management systems - Central Contractor Registry (CCR), Federal Agency Registration (Fedreg), Online Representations and Certifications Application (ORCA) - and the Excluded Parties List System (EPLS).\nbeta.SAM.gov and DUNS to UID Change\nIn 2021, SAM.gov merged with beta.SAM.gov to form a complete redesign as well as new user experience and closure of the popular government run FEDBIZOPPS site. In addition, entities looking to receive a CAGE Code no longer register for a DUNS number. Instead, companies are issued a UID after providing minimal documentation to prove ownership of their business.\n2022 Transition Issues\nAs of late 2022, the Federal Service Desk has seen an influx in civilian help desk tickets due to unclear instructions, delays, and user inability to update or register a CAGE Code. SAM.gov has been providing an automatic 30-day extension for any existing SAM.gov entity needing to be renewed with a registration date between April 29, 2022 and April 28, 2023. CAGE codes are vital for small business to receive grants and contracts. Many users are experiencing difficulty simply finding their entity in order to validate ownership - a burdensome new requirement once unnecessary due to prior issuance of a DUNS number.\nPaid Registration Services Controversy\nDue to the complexity and time required to register a new CAGE Code, many small businesses are resorting to online paid registration services. Many business owners find themselves paying anywhere from $600 to $1,500 - often times not realizing SAM.gov does not cost anything to use. Some service providers offer a legitimate, fairly priced, needed service to individuals and businesses who simply cannot navigate the ever more complicated SAM.gov process. On the other hand, many services seek to appear as 'Official' CAGE Code registrars often bilking unsuspecting clients with thousands of dollars in fees by promising bid services.\nSee also\n* USAspending.gov\nReferences\nFurther reading\n* [https://www.sam.gov/sam/transcript/SAM_Quick_Guide_Grants_Registrations-v1.6.pdf \"SAM Quick Guide for Grantees\"]\nExternal links\n*"
    }
  ]
}