{
  "content": [
    {
      "type": "text",
      "text": "# Systemic wars theory\n\nThe systemic wars theory is a political–sociological theory by Dutch ex-marine Ingo Piepers that states that a fifth major systemic war would start around 2020. According to Piepers' definition, a systemic war is a war in which all the great powers are actively involved. The term systemic war refers to the remaking of the international political-social system.\nMethod\nFrom the early 2000s Piepers has conducted scientific research into major wars around the world based on physical and mathematical theories. During his research he discovered a system and wrote a thesis, on which he obtained his PhD at the University of Amsterdam. In his book 2020 Warning (2016), Ingo Piepers analyzes international conflicts from 1495 to the present. Around that time, the world began to consist of societies that became strongly interconnected at an international level. In that time span are several periods of relative calmness, which slowly build up to a moment of irreversible tension. Piepers claims that there are recurring patterns and laws that resemble a physical process, and saw that mathematical formulas can be applied to these patterns. He mentions four cycles that led to four major conflicts respectively: the Thirty Years' War (1618–1648), the French Revolutionary and Napoleonic Wars (1792–1815), the First World War (1914–1918) and the Second World War (1939–1945).\nWar in 2020\nAccording to the cycle discovered by Piepers, the fifth great war should have begun around 2020. Piepers says he has based his findings on existing data and not on fabrications. Historians, he says, often tend to rely on their own opinions, but he would provide reasonably hard evidence for a consistent system. Since 1945, the year World War II ended, we would be in the fifth cycle; the Pax Americana. Data analysis shows that tensions in the system have been building up since 2011, which according to the theory, marks the turning point of the period of peace and (social) order. According to Piepers, this can be seen in, among other things, the dramatic increase in terrorist activities around the world. According to Piepers' model, the war would last 16 years and thus end in 2036. He indicates that population growth, poverty and climate change will be central subjects in the coming war.\n2022 Russian invasion of Ukraine\nOn February 24, 2022 Russia invades neighboring Ukraine. Ingo Piepers is not yet able to confirm whether this is the world war he predicted. In Europe, he says, this could be defined as a systemic crisis, but on a global level it would have to mean that China would be actively involved in the conflict, and the latter is not yet in play.\nCriticism\nCritics have argued that the empirical analyzes are insufficient and that the statistics are too simplified. The substantiation of a fixed war cycle and the prediction that a European conflict will lead to a global war have been carried out too weakly. Also, an understanding of the past does not automatically lead to the ability to predict future wars because they do not exhibit linear behavior. Similarly, one mentions the human capacity to learn from previous wars and unpredictable new developments in human social behavior. Also, international tensions in the 21st century no longer need to be expressed in the military field.\nReferences"
    }
  ]
}