{
  "content": [
    {
      "type": "text",
      "text": "# Syunik rebellion\n\n* Some Armenian resistance continues until the region is reconquered by Iran\n| territory        = Syunik is occupied by the Ottoman Empire in 1730\n| combatant1        = Syunik Armenian melikdomsSupported by:Melikdoms of Karabagh\n| combatant2        =  Ottoman EmpireKhanates of the CaucasusKarachorlu tribesJavanshir tribes Safavid Iran (until 1727)\n| commander1        = Davit BekMkhitar Sparapet Ter-Avetis\n| commander2        = Ahmed IIITahmasp II\n| casualties1       =\n| casualties2       =\n}}\nThe Syunik rebellion of 1722–1730 () began as a rebellion of the Armenians of the region of Syunik (also known at the time as Ghapan) in Iranian Armenia against Safavid rule and local Muslim tribes and rulers. Under the leadership of Davit Bek, an Armenian soldier from Georgia, the Armenian lords (meliks) of Syunik were united and an independent Armenian principality was established. From 1725, the Armenian principality of Syunik resisted the Ottoman Empire's attempts to occupy the region. After making initial gains and occupying a significant part of the province, the Ottomans were defeated at the Battle of Halidzor on 26 February 1727. After this victory, Davit Bek's forces completely drove the Ottomans out of Syunik, and he was recognized by the Safavid shah Tahmasp II as ruler of Ghapan. After his death in mid-1728, Davit Bek was succeeded by one of his commanders, Mkhitar Sparapet. In a renewed assault, the Ottomans captured and destroyed Halidzor in early 1729, forcing Mkhitar to flee. Although Mkhitar continued to resist the Ottomans and won some victories, he was killed by a group of Armenian villagers in Khndzoresk. Left leaderless, the Armenian forces dispersed, and the Ottomans occupied Syunik, although some Armenians continued to resist from impregnable mountainous areas. The rebellion occurred at the same time as, and occasionally directly cooperated with, an Armenian rebellion in the neighboring region of Karabagh.\nBackground\nIn the early eighteenth century, Armenia was divided between the Ottoman and Safavid empires. In the mountainous regions of Syunik (also known at the time as Ghapan) (,  ) was used to refer to two territories of different sizes: the smaller one was , and the larger one was  ('Great Ghapan'), which encompassed the majority of the districts of the historical province of Syunik.}} and Karabagh (also known as Artsakh by Armenians), remnants of the old Armenian nobility called meliks continued to exist as autonomous rulers of small principalities under Iranian suzerainty. In the late seventeenth century, Russian southward expansion under Peter the Great had raised hopes among some Armenian leaders that an alliance could be made with Russia to free Armenia from the rule of the Muslim empires. Most notably, an Armenian noble from Syunik named Israel Ori went to Moscow in 1701 and drew up a plan for a rebellion in Iranian Armenia with Russian help. Ori's plan was never realized, and he died in Astrakhan in 1711. However, Armenian secular and religious leaders continued to interact with the Russian state and began to see Russia as the natural ally of the Armenian people.\nMeanwhile, the Safavid state was nearing its collapse in the 1720s. Shah Soltan Hoseyn's actions alienated his Georgian and Armenian subjects and provoked a rebellion among the empire's Sunni subjects in the Caucasus and Afghanistan in 1721. The weakening of central authority also allowed Lezgin groups to raid the South Caucasus, prompting the Armenian meliks to strengthen their defenses and military forces. In October 1722, the Afghans captured the Iranian capital of Isfahan after a six-month siege. Taking advantage of the chaotic situation, Peter the Great invaded Iran in 1722 with a 61,000-strong army. This revived hope among the Armenians and Georgians under Iranian rule that Russian arms could help remove the region from Muslim rule. At Peter's request, a joint Armenian-Georgian army, made up of the Georgian army and the troops of the meliks of Karabagh, was assembled to join with the Russian forces. However, fearing a conflict with the Ottomans and facing logistical problems in his campaign, Peter remained in the Caspian littoral and did not move into the South Caucasus. With the Treaty of Saint Petersburg, signed on 12 September 1723, Russia annexed the southwestern coast of the Caspian Sea and made peace with Iran. In the meantime, the Ottomans were preparing to invade the South Caucasus, having assembled a large army in Erzurum by late 1722.\nThe weakening of the Safavid state also allowed Muslim lords in the South Caucasus to increase their control over the region's Armenian population. Additionally, Armenians in general and those of Syunik in particular were being taxed heavily to pay for Shah Tahmasp II's campaigns against the Afghans. Although the Armenian rebellions in Syunik and Karabagh are often treated as one movement, there were a number of differences between them. Unlike Karabagh, which at this time was exclusively Armenian, Syunik already had a considerable Muslim population, made up of Turkic and Kurdish nomads who would regularly come up to the mountainous grazing lands from the plains of the Kura for part of the year. Also, the troops of the meliks of Syunik were less organized, and the meliks at first had no single leader to unite around. Threatened by the local Muslims, in 1722 the meliks of Syunik sent Stepanos Shahumian of Meghri to the court of the Georgian king Vakhtang VI to ask for assistance. Vakhtang agreed to aid the meliks; he sent Davit Bek, reportedly one of his most capable officers, together with some 30 men Armenian soldiers.\nRebellion\nAgainst Muslim tribes and the Safavids\nDavit Bek made Shinuhayr his first base of operations and began repairing its fortress. A number of Syunik meliks and other local leaders came to declare their readiness to follow him. Among these were Melik Toros of Chavndur, the tanuters (mayors or village headmen) of Goghtn and Julfa, the yuzbashis}} Pap and Pali, and Mkhitar Sparapet. A little later, he was joined by Melik Parsadan of Halidzor and Ter Avetis. Davit Bek assembled a force of 2000 warriors and turned them into a disciplined army. Father Hovakim of Tatev Monastery declared the full support of the Armenian clergy for Davit Bek. With the support of the local peasants and the meliks, he managed to defend the Armenian-inhabited areas from the Muslim tribes. Davit Bek's first military actions were directed against the Turkic and Kurdish tribes. He first defeated the Karachorlu and Javanshir groups. On a plateau called Uchtapa, he reportedly defeated thousands of Javanshir tribesman with a force of 400. His victories brought more and more Armenians to his ranks.\nDavit Bek also fought against those Armenian meliks who opposed the rebellion. Among these were Melik Baghir of Tatev, who converted to Islam, and Frangul of Yeritsvank and others. Davit killed Baghir after a two-day battle and distributed his property. After this victory, Davit Bek made Tatev his new center. Davit instituted strict discipline among his troops, harshly punishing disobedience and misconduct. For panic-mongering and cowardice, he put his friend Pap to death, and had his lieutenants Ter Avetis and Mkhitar Sparapet briefly imprisoned.\nHaving established order and a strong military force in Syunik, Davit Bek began campaigning against the local khans (formally Safavid governors, but largely independent with the collapse of central authority) and other Muslim lords of varying sizes, who joined forces against Davit Bek. Tahmasp II, the Safavid king based in Qazvin, sent some troops against Davit. Davit Bek's first great victory came at the battle of Chavndur, where the Armenian rebels defeated the combined forces of the khanates of Bargushat and Karadagh. Another notable victory was the conquest of the powerful fortress of Zeyva by Mkhitar Sparapet and Ter Avetis. On 29 March 1724, Davit Bek besieged the strategically important fortress of Vorotnaberd and captured it after four days of fierce fighting. In May 1724, a force of 2,000 Armenian fighters from Karabagh commanded by Avan Yuzbashi and Ivan Karapet (an Armenian representative of Peter the Great) joined Davit Bek's forces. The last battles between the Armenian rebels and the Persians took place in 1725 at Goghtn and Meghri. Thousands of Persians were killed and fled southward across the Aras River.\nDavit Bek's principality\nAs a result of Davit Bek's campaigns from 1722 to 1725, all of Syunik and some neighboring areas were brought under Armenian control. Davit Bek thus became the ruler of an independent Armenian principality, where all the meliks submitted to his authority. The borders of this principality largely corresponded to the borders of the modern-day Syunik Province of the Republic of Armenia, extending from the district of Sisian in the north to the Aras River in the south, and from the Zangezur Mountains in the west to a line of fortified points and settlements in the east. Its probable easternmost fortified point was Kulaberd, in the modern-day Lachin District of Azerbaijan. A hostile Muslim principality separated Davit Bek's realm from the Armenian melikdoms of Karabagh.\nDavit Bek appointed both his fellow Georgian Armenians and locals as commanders. Mkhitar was appointed commander of the armies, or sparapet. A military council and staff was created. The units of Davit Bek's army had their own flags. Apparently following the example of the meliks of Karabagh, Davit Bek created a series of fortified military districts in Syunik called sghnakhs. In early 1723, the fortress of Halidzor became the new center of the principality. Davit Bek expanded the fortifications and gathered supplies there.\nAgainst the Ottomans\n, as seen from above]]\nIn 1724, the Ottomans invaded Iran and Eastern Armenia, capturing Tiflis, Yerevan and Hamadan. The first Ottoman attempt to enter Syunik was in the spring of 1725. Although this first attempt failed, in 1726 the Ottomans occupied the trade route running along the south of Syunik, taking Ordubad, Agulis and Meghri and pushing into the interior of Syunik. They were supported by the local Turkic tribes and the Iranian khans. The Armenians suffered heavy losses trying to stop the Ottoman advance. Disunity and demoralization emerged within the Armenian ranks. It was in this context that Mkhitar and other leaders sent an appeal for assistance to Russia on 24 March 1726.. Some scholars believe that the absence of Davit Bek's signature on this letter indicates that he had already died by this time and been succeeded by Mkhitar, whereas the main primary source on the rebellion, , states that Davit Bek fell ill and died at Halidzor in 1728.}} However, Russia had already signed the Treaty of Constantinople with the Ottoman Empire in 1724, recognizing the latter's rights over the Iranian territories of the South Caucasus away from the Caspian coast. The Armenian rebels were unaware of these developments and continued to hope for a Russian intervention.\nIn February 1727, the Ottomans initiated a massive assault, and the Armenian forces retreated to the fortress of Halidzor. Joined by the khans of Bargushat and Karadagh, the Karachorlu and other local Turkic and Kurdish forces, the Ottomans besieged Halidzor on 26 February 1726. Although the initial assaults were unsuccessful, with the defenders taking minor losses, a major attack with siege machines and ladders demonstrated to the defenders that they could not hold out indefinitely. Then, Davit Bek proposed a plan to sortie out of the fortress and strike the besieging forces. The sortie was led by Ter Avetis and Mkhitar. The Ottomans were caught off guard and began a disorderly flight, taking heavy casualties as the Armenians chase them away. Davit Bek's forces begin driving the Ottomans out of Syunik. This spectacular victory breathed new life into the rebellion, and many meliks that had abandoned the movement joined Davit Bek once again. The Armenian forces won another great victory over the Ottomans at Meghri, capturing Meghri Fortress with the help of locals and inflicting heavy losses on an Ottoman army, which was forced to flee across the Aras. Along with war booty, the rebels captured thousands of tax documents, which they destroyed. Davit Bek then campaigned against the Ottomans at Bekh, Ordubad and Agulis. As a result of Davit Bek's victories, Syunik was again under Armenian control.\nAlthough initially Davit's main enemy was the Iranians, he quickly came to the conclusion that it was the Ottomans who posed a much greater danger. Davit Bek's victories had left a strong impression on Shah Tahmasp, who in 1727 sent a letter to Davit recognizing him as ruler of Ghapan and appointing him as governor and commander of Safavid forces in the region. Davit Bek suddenly fell ill in mid-1728 and died at Halidzor. He was succeeded by his lieutenant Mkhitar Sparapet. Mkhitar continued the struggle against the Ottomans. Although Mkhitar won some victories, a new Ottoman campaign began and Halidzor was again besieged at the beginning of 1729. Ter Avetis and others following him, believing that victory was impossible to achieve, called for negotiations with the Ottomans. Mkhitar, unable to convince his followers to continue fighting, left the fortress under cover of night. Ter Avetis then surrendered Halidzor to the Ottomans in exchange for guarantees, but the Ottoman pasha ordered the men killed and the women and children taken prisoner. The fortress of Halidzor was destroyed.\nAfter this defeat, Mkhitar continued resisting the Ottoman occupation, sometimes succeeding in liberating some settlements. He defeated the Ottomans at Ordubad in 1730. That same year, Mkhitar went to Khndzoresk to rest. A group of locals, fearing that their village would be destroyed like Halidzor because of Mkhitar's presence, murdered the rebel leader. Mkhitar's head was sent to the Ottoman pasha of Tabriz, who ordered the execution of the murderers. The Armenian forces of Syunik dispersed after the death of their leader. Some decided to move to Russian-controlled territories, while others continued to resist the Ottoman occupation from the mountains of Syunik until the 1730s, when Nader Khan (later Nader Shah) recaptured the Caucasian territories from the Ottomans.\nNotes\nReferences\nCitations\nBibliography\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\nFurther reading\n*\n*  A Soviet-era study of the rebellion.\n*  A translation of the main primary source about the rebellion into modern Armenian with an introduction."
    }
  ]
}