{
  "content": [
    {
      "type": "text",
      "text": "# T. Butler King\n\nThomas King}}\nThomas Butler King I (August 27, 1800 – May 10, 1864) was an American politician from the state of Georgia. Late in life, King spent ten years in the newly admitted state of California and twice attempted to become a senator from that state.\nEarly life\nHe was born on August 27, 1800, in Palmer, Massachusetts, to Daniel King and Hannah Lord. He was of English descent, and among his first ancestors coming to America was John King, of Edwardstone, Suffolk, England, who, in 1715, was the first settler on a tract of land in what was then the Colony of Massachusetts. For a generation or more, that tract of land was known as Kingstown. Afterwards, it was called Palmer.\nHe attended Westfield State University and then studied law under his brother, Henry King in Allentown, Pennsylvania. He was admitted to the Pennsylvania State Bar in 1822.\nGeorgia\nIn 1823 he traveled with his brother, Stephen Clay King, to practice law in Waynesville, Georgia.\nIn 1824, he married Anna Matilda Page (c. 1800 – 1859). They had ten children who survived to adulthood, including a son, John Floyd King. Thomas was elected to the Georgia Senate in 1832 to represent Glynn County, Georgia, and served in that position in 1834, 1835, and again in 1837. He was elected to the US House of Representatives in 1838 to the 26th Congress.\nKing would attempt to regain his old seat in the Confederate Congress in 1863 against Julian Hartridge. King narrowly lost, receiving 2,909 votes to Hartridge's 3,077 votes and a third candidate named C.H. Hopkins' 766. This likely occurred because of distrust of King by Savannah voters.\nCalifornia\nKing accepted an appointment in California as tax collector for the Port of San Francisco under President Millard Fillmore. He then went to work as a lobbyist for the Southern Pacific Railroad Company. King was a candidate for U.S. Senate in 1849, but was unsuccessful.\nSan Francisco's King Street, near the port and major rail yards, is named after him.\nDeath\nKing died in Waresboro, Georgia on May 10, 1864. He was buried in the churchyard of Christ Church on St. Simons Island.\nSee also\n* United States House election, 1838\n* Brunswick–Altamaha Canal\n* Neptune Small\nReferences\nSources\n* Edward M. Steel Jr. T. Butler King of Georgia (University of Georgia Press: 1964)\nExternal links\n* [https://rose.library.emory.edu/ Stuart A. Rose Manuscript, Archives, and Rare Book Library], Emory University: [http://pid.emory.edu/ark:/25593/8zj10 T. Butler King papers, 1845–1851]"
    }
  ]
}