{
  "content": [
    {
      "type": "text",
      "text": "# T. John Ward\n\n| birth_place         = Bonham, Texas, U.S.\n| death_date          =\n| death_place         =\n| death_cause         =\n| resting_place       =\n| resting_place_coordinates =\n| citizenship         =\n| nationality         =\n| party               =\n| otherparty          =\n| height              =\n| spouse              =\n| partner             =\n| relations           =\n| children            =\n| parents             =\n| mother              =\n| father              =\n| relatives           =\n| residence           =\n| education           = Texas Tech University (BA)Baylor University (LLB)\n| alma_mater          =\n| occupation          =\n| profession          =\n| known_for           =\n| salary              =\n| net_worth           =\n| cabinet             =\n| committees          =\n| portfolio           =\n| religion            =\n| awards              =\n| signature           =\n| signature_alt       =\n| website             =\n| footnotes           =\n}}\nThomas John Ward (born April 17, 1943) is a retired United States district judge of the United States District Court for the Eastern District of Texas.  He is best known for the large number of patent infringement cases brought before his court in Marshall, Texas.\nEducation and career\nT. John Ward was born in 1943 in Bonham, Texas. He received a Bachelor of Arts degree in 1964 from Texas Tech University and a Bachelor of Laws in 1967 from the Baylor Law School. Ward was a legislative draftsperson for the Texas Legislative Council from 1967 to 1968 and an assistant county attorney in Lubbock County, Texas in 1968. He was in private practice as a malpractice and product liability lawyer from 1968 through 1999.\nFederal judicial service\nWard was nominated to the district by President Bill Clinton on January 26, 1999, confirmed by the United States Senate on July 13, 1999, received his commission on July 15, 1999\nand joined the bench in September 1999. His service terminated on October 1, 2011, due to retirement.\nCivic activities\nWard served on the board of trustees of the Good Shepherd Medical Center from 1987 to 1991 and 1994 to 1999, and was on the board of directors of the Good Shepherd Foundation from 1986 to 1988 and 1994 to 1997. He was on the advisory board of the East Texas Literacy Council from 1987 to 1991.\nHonors\nIn 2004, Ward was honored by Baylor Law School as its Baylor Lawyer of the Year, an award given annually to an outstanding alumnus who has brought honor and distinction to Baylor Law School and the legal profession. In 2009, Ward was named the Trial Judge of the Year by the Texas Chapter of the American Board of Trial Advocates.\nPatent infringement cases\nWard has been described as a \"plain-talking Texan\"  who maintains a \"folksy demeanor\" and a \"fiery temper\". He enjoys patent cases, citing their intellectual challenge. Ward was credited as having a solid knowledge of patent law and a dedication to efficiency. Attorney Willem Schurrman has described Ward as being well-prepared and well-versed in the cases he hears. He became interested in patent law while defending Hyundai Electronics against a lawsuit by Texas Instruments. Hyundai lost and Texas Instruments was awarded $25.2 million in 1999. Since Ward initially joined the Eastern District of Texas, the district has seen a tenfold increase in cases since 1999. There were 14 patent cases in 1999, 32 in 2002, 155 in 2005, and 234 in 2006. And, in 2013, 1,495 patent cases were filed. The Eastern District of Texas is one of eight with more than 100 new patent filings each year. Ward heard more than 160 patent cases in his first seven years on the bench. He had been handling 90% of the patent cases in Marshall, but later was reduced to 60%. Patent cases presented before Ward were more frequently won by the patent holder plaintiff than the defense. One source claims that patent holders win 88% of the time in Ward's court, compared to an average of 68% nationwide. Another source claims that patent cases in Marshall are won by patent holders 78% of the time versus 59% nationwide. And a third source claims that in 90% of cases patent holders win jury verdicts. Between taking the bench in 1999 and June 2006, Ward was overturned in only one patent case. Ward believes the problem of patent trolls is overstated and that his record of being overturned only once supports this view. Ward has been described as pushing cases through quickly. His court had been described as a \"rocket docket\" for its speed. To speed things up, Ward adopted a set of rules covering both litigation and trial activities.  Ward's rules were based on rules from the United States District Court for the Northern District of California.\nHis litigation rules included early disclosure of positions, establishment of firm case deadlines, and sanctions for parties abusing the discovery process. Attorney Alan Fisch says that the \"jurisdiction has a tailored set of rules for patent cases that streamline certain of the pretrial proceedings — generally this benefits both plaintiff and defendant.\" Lawyers who do not move quickly enough are sanctioned. Ward credits his rules and resulting speed with causing the increase in patent suits filed in the district. Fast cases reduce expenses for financially strapped plaintiff patent holders. Attorney Henry Bunsow claims that the fast cases can \"cut legal fees in half.\"\nHis trial rules included strict timetables and the use of a chess clock to time opening and closing arguments. Each side in a case might receive between 9 and 15 hours for evidence, compared to other courts where it might take a month or more. Defendants have incentive to settle rather than risk larger expenses.\nThere are claims that the juries in Marshall are plaintiff-friendly. There is disagreement about the court's patent-friendliness. Charles Baker and Daniel Perez, attorneys who have both defended against patent suits in Ward's court, describe the court as \"fair.\" Ward has described the district as historically \"plaintiffs-oriented,\" and has described the Marshall jury pool as \"defenders of property rights\" and \"friendly to patent owners' interests.\" Some claim that plaintiffs often have an advantage because they hire Marshall lawyers more likely to know the jurors and benefit from that information.\nT. John \"Johnny\" Ward, Jr.\nT. John Ward's son, T. John \"Johnny\" Ward, Jr. is an attorney who is frequently called on to litigate patent cases in the Eastern District of Texas.\nBoth T. John and T. \"Johnny\" Ward, and their connection are briefly mentioned in the 2017 feature-length documentary The Patent Scam produced by Austin Meyer (author of the X-Plane (simulator)).https://www.imdb.com/title/tt6567002/around 00:59:20 time mark\nSee also\n* Leonard Davis (judge)\nReferences\nSources\n*\n|years=1999–2011}}"
    }
  ]
}