{
  "content": [
    {
      "type": "text",
      "text": "# T.A.G. Hungerford Award\n\nThe City of Fremantle T.A.G. Hungerford Award is given biennially to a full-length manuscript of fiction or narrative non-fiction by a Western Australian author previously unpublished in book form. It is sponsored by the City of Fremantle, Fremantle Press, Fremantle Library and The West Australian.\nFirst established in 1988, the award was set up to discover and develop new writers from Western Australia who have not previously been published in book form. In 2010 the prize money was doubled to $12,000.\nAs of 2018, the City of Fremantle pledged to support the award for a further six years. The prize money received by the winner will be $15,000 for the 2020, 2022 and 2024 award.\nThe winner receives a cash prize and a publishing contract with Fremantle Press. Many of the shortlisted writers also go on to be offered publishing contracts either by Fremantle Press or other publishing houses.\nThe Award is named in honour of Tom Hungerford, a prominent Western Australian writer.\nAward winners\n* 1990: Brenda Walker, Crush (1991)\n* 1991: Gail Jones, The House of Breathing (1992)\n* 1993: Simone Lazaroo, The World Waiting to be Made (1994)\n* 1995: Bruce Russell, ''Jacob's Air (1996)\n* 2000: Christopher Murray, A Whispering of Fish (2001)\n* 2002: Nathan Hobby, The Fur (2004)\n* 2004: Donna Mazza, The Albanian (2007)\n* 2006: Alice Nelson, \"In Arcadia\" published as The Last Sky (2010)\n* 2008: Natasha Lester, What is Left Over, After (2010)\n* 2010: Jacqueline Wright, Australian author, \"The Telling\" published as Red Dirt Talking (2012)\n* 2012: Robert Edeson, The Weaver Fish (2014)\n* 2014: Madelaine Dickie, Troppo (2016)\n*2016: Jay Martin, \"Learning Polish\" published as Vodka and Apple Juice (2018)\n*2018: Holden Sheppard, Invisible Boys (2019)\n*2020: Maria Papas, \"I Belong to the Lake\" published as Skimming Stones (2021)\n*2022: Molly Schmidt, Salt River Road\n*2024: Yirga Gelaw Woldeyes, የተስፋ ፈተና / Trials of Hope'' (written in English and Amharic)\nShortlisted authors\n* 2006: Varnya Bromilow, Deb Fitzpatrick and Alice Nelson\n*2008: Bill Powell, Karen Williams, Natasha Lester\n*2010: Jacqueline Wright\n*2012: Robert Edeson, Murray Jennings, Zoe Deleuil, Susan Sullivan, Martin Chambers, Vivien Stuart\n*2014: Nicole Sinclair, Louise Allan, Madelaine Dickie, Mihaela Nicolescu, Portland Jones\n*2016: Jay Martin, Catherine Gillard, Jodie Tesoriero, Tineke Van der Eecken, David Thomas Henry Wright\n*2018: Yuot Alaak, Zoe Deleuil, Alan Fyfe, Holden Sheppard, Julie Sprigg, Trish Versteegen\n*2020: Sharron Booth, Joanna Morrison, Maria Papas\n*2022: Joy Kilian-Essert, Gerard McCann, Marie O’Rourke, Molly Schmidt\n*2024: Howard McKenzie-Murray, Jodie Tes, Fiona Wilkes, Yirga Gelaw Woldeyes\nReferences\nExternal links\n* [http://www.writingwa.org/ writingWA]\n*[https://www.fremantlepress.com.au/ Fremantle Press]\n*[https://www.fremantle.wa.gov.au/ City of Fremantle]\n*[https://www.fremantle.wa.gov.au/library Fremantle Library]\n*[https://thewest.com.au/ The West Australian]"
    }
  ]
}