{
  "content": [
    {
      "type": "text",
      "text": "# Tabitha King\n\n| birth_place      = Old Town, Maine, U.S.\n| occupation       = Author\n| alma_mater       = University of Maine\n| genre            =\n| movement         =\n| influences       =\n| influenced       =\n| spouse           =\n| children         = 3, including Joe and Owen\n| relatives        =\n| signature        =\n}}\nTabitha \"Tabby\" Jane King ( Spruce, born March 24, 1949) is an American author.\nEarly life\nBorn in Old Town, Maine, Tabitha King is the third eldest daughter of Sarah Jane née White (December 7, 1923 – April 14, 2007) and Raymond George Spruce (December 29, 1923 – May 29, 2014). She attended John Bapst Memorial High School in Bangor, Maine before enrolling at the University of Maine in Orono where she met her husband Stephen King through her work-study job in the Raymond H. Fogler Library.\nCareer\nAs of 2006, King had published eight novels and two works of non-fiction. She published her first novel, Small World, through Signet Books in 1981 and in 2006, Candles Burning was published by Berkley Books. The paperback rights for Small World were bought by New American Library for $165,000. Candles Burning was written predominantly by Michael McDowell, who died in 1999, and the McDowell family requested that King finish the work.\nIn 2023, she was the executive producer of the independent horror film The Sudbury Devil.\nPartnership with Stephen King\nPrior to her husband's commercial success, Tabitha worked extra shifts at Dunkin' Donuts so that Stephen could write full-time. As Stephen King recalled the origin of his debut novel, Carrie: \"Two unrelated ideas, adolescent cruelty and telekinesis, came together.\" It began as a short story intended for Cavalier; Stephen tossed the first three pages in the trash but Tabitha recovered them, saying she wanted to know what happened next. He followed her advice and expanded it into a novel. She told him: \"You've got something here. I really think you do.\"\nThat began a practice that continues today: Tabitha and Stephen review each other's drafts and also those of their two sons.\nReception\nReception to King's work has ranged from negative to positive. Pearl received positive mentions from the Los Angeles Times and the Bangor Daily News, while the Chicago Tribune panned Survivor. The Arizona Daily Star criticized One on One, calling King \"a hack\", whereas Entertainment Weekly, Time, and the Rocky Mountain News gave the novel positive reviews. Caretakers was lauded by The New York Times for its characterization of its protagonists. In 2006, King completed and published Michael McDowell's final novel, Candles Burning, to mixed reviews.   Bookreporter.com wrote that some readers might be disappointed by the changes King made to McDowell's original.\nAwards and recognition\n*Honorary Doctorates of Humane Letters, University of Maine (May 1987)\n*Dowd Achievement Award (1992)\n*Constance H. Carlson Public Humanities Prize (1998)\nSocial activism\nKing has served on several boards and committees in the state of Maine including the Bangor Public Library board. She also served on the board of the Maine Public Broadcasting System until 1994. In 1998 she received the inaugural Constance H. Carlson Public Humanities Prize, the Maine Humanities Council's highest award, for her work with literacy for the state of Maine. In 2019, Tabitha and Stephen King donated $1.25 million to the New England Historic Genealogical Society.\nShe serves as vice president of WZON/WZLO/WKIT radio stations, as well as in the administration of two family philanthropic foundations. The Stephen and Tabitha King Foundation, chaired by her and her husband, ranks sixth among Maine charities in terms of average annual giving, with over $2.8&nbsp;million in grants per year, according to The Grantsmanship Center.\nPersonal life\nTabitha and Stephen King married on January 2, 1971. They have three children: a daughter Naomi and two sons, Joe Hill (Joseph Hillström King) and Owen King, who are both writers.\nBibliography\nNovels\n{| class=\"wikitable sortable\"\n|-\n! Year\n! Title\n! Publisher\n! ISBN\n! Pages\n! Note\n|-\n| 1981\n| Small World\n| Signet Books\n|\n| 312\n|\n|-\n| 1983\n| Caretakers\n| rowspan=\"2\" |Scribner's\n|\n| 274\n| First novel set in King's fictional community of Nodd's Ridge\n|-\n| 1986\n| The Trap\n|\n| 352\n| Also published as Wolves at the Door; second novel set in Nodd's Ridge\n|-\n| 1988\n| Pearl\n| rowspan=\"4\" |Signet Books\n|\n| 368\n| Third novel set in Nodd's Ridge\n|-\n| 1993\n| One on One\n|\n| 528\n| Fourth novel set in Nodd's Ridge\n|-\n| 1994\n| The Book of Reuben\n|\n| 432\n| Fifth and last novel set in King's fictional community of Nodd's Ridge\n|-\n| 1997\n| Survivor\n|\n| 496\n|\n|-\n| 2006\n| Candles Burning\n| Berkley Publishing Group\n|\n| 423\n| With Michael McDowell, King continued her writing after McDowell's death in 1999\n|}\nNonfiction\n{| class=\"wikitable sortable\"\n|-\n! Year\n! Title\n! Publisher\n! ISBN\n! Pages\n! Note\n|-\n| rowspan=\"2\" |1994\n| Playing Like a Girl; Cindy Blodgett and the Lawrence Bulldogs Season of 93-94\n| Dendrite Corporation\n| N/A\n| 42\n| The work is about basketball player Cindy Blodgett during her time at Lawrence High School.\n|-\n| Mid-life Confidential: The Rock Bottom Remainders Tour America with Three Chords and an Attitude\n| Berkley Publishing Group\n|\n| 222\n| Written by all of the Rock Bottom Remainders with photos by Tabitha King\n|}\nShort stories\n* The Blue Chair (1981)\n* The Demonstration (1985)\n* Road Kill (1986)\n* Djinn and Tonic (1998)\n* ''The Women's Room (2002)\n* Archie Smith, Boy Wonder (2011)\nPoetry\n* A Gradual Canticle for Augustine (1967)\n* Elegy for Ike (1967)\n* Note 1 from Herodotus (1968)\n* Nonsong (1970)\n* The Last Vampire: A Baroque Fugue (1971)\nTeleplay\n* \"The Passion of Reverend Jimmy\" (2004)\nContributions and compilations\n* Murderess Ink: The Better Half of the Mystery, Dilys Winn, ed., Bell, 1979\n* Shadows, Volume 4, C. L. Grant, ed., Doubleday, 1981\n* Midlife Confidential, ed. David Marsh et al., photographs by Tabitha King, Viking Penguin, 1994\nNotes\nReferences\nFurther reading\n*Mcaleer, Patrick; The Writing Family of Stephen King: A Critical Study of the Fiction of Tabitha King, Joe Hill and Owen King;'' McFarland & Company, 2011\nExternal links\n*\n*\n* [https://www.stkfoundation.org Stephen & Tabitha King Foundation]\n* [https://www.joehillfiction.com Joseph Hillstrom King]\n* [https://www.owen-king.com Owen Phillip King]"
    }
  ]
}