{
  "content": [
    {
      "type": "text",
      "text": "# Tafaoimalo Leilani Tuala-Warren\n\n| office = Justice of the Supreme Court of Samoa\n| term_start = 29 April 2016\n| term_end = 24 March 2023\n}}\nTafaoimalo Leilani Sina Naireen Tuala-Warren is a former Samoan judge, who served as a Judge of the Supreme Court of Samoa from 2016 to 2023. She was the second woman Supreme Court judge in Samoa.\nEarly life and education\nTuala-Warren was born in Apia to a dentist father and a flight attendant mother, and was educated at Leifiifi College in Malifa and Tintern Grammar in Melbourne, Australia. She won an AUSAID scholarship to the University of Sydney, graduating with a Bachelor of Economics in 1993. She then won a NZODA Scholarship to the University of Waikato, where she graduated with a Bachelor and Master of Laws in 1997, before completing a pre-admission course at the university's Institute of Professional Legal Studies in 1998.\nProfessional career\nTuala-Warren was a state solicitor in Samoa's Office of the Attorney-General from 1998 to 2000 before returning to Waikato University to teach from 2001 to 2005, variously as a tutor, teaching fellow and then law lecturer, teaching dispute resolution, corporate and commercial law and consumer protection.  She returned to Samoa in 2005 to work as a partner with her brother's firm, Tuala & Tuala Lawyers, in their litigation practice. Tuala-Warren became the Executive Director of the Samoa Law Reform Commission in 2009, and was appointed as a Samoa District Court judge in August 2013. As District Court judge, she was the main judge for the Family Court and Family Violence Court.\nShe was appointed to the Supreme Court of Samoa in April 2016 after being recommended by the Court Commission, headed by the Chief Justice of Samoa. In January 2023 she announced she would be resigning from the court in March. She retired from her role on 24 March.\nIn June 2024 she was appointed as the Dean of Law at the University Waikato, Te Piringa - Faculty of Law.\nIn August 2022 she was awarded a Distinguished Alumni Award by the University of Waikato. In August 2023 she was appointed Professor of Law by the University of Waikato.\nIn mid January 2025, Minister of Māori Development Tama Potaka appointed Tuala-Warren to the Waitangi Tribunal, a tribunal that considers Treaty of Waitangi claims and is tasked with fostering reconciliation between Māori people and the New Zealand Crown.\nPersonal life\nShe is married to New Zealand Māori Land Court judge Aidan Warren.\nReferences"
    }
  ]
}