{
  "content": [
    {
      "type": "text",
      "text": "# Taiwan Excellence Awards\n\n}}\nThe Taiwan Excellence Awards are yearly awards given out by the Ministry of Economic Affairs (MOEA) and The Taiwan External Trade Development Council (TAITRA) to encourage Taiwan industries to upgrade and incorporate innovation and value into their products. The selection of awards is based on four criteria: R&D, design, quality, and marketing. Each product must score evenly in each category in order to be selected. An international panel of judges is invited to participate in this selection. Finalists are decided after several rounds of evaluations.\nSeveral plans were launched to promote the product designs, qualities and images of Taiwan: The Quality Enhancement Plan (1988), Product Design Ability Enhancement Plan (1989), and the 1990 Image Enhancement Plan (IEP). This eventually led to the Branding Taiwan Project  developed in 2006 with a strong focus on the IEP. The IEP is designed to enhance the image of Made in Taiwan products. There have been three iterations to the competition:\n* Stage one (1990–1995): Focus on improving the negative image of Made In Taiwan products.\n* Stage two (1995–2000): Innovalue (\"innovation\" plus \"added value\"), was created.\n* Stage three (current stage): Image reformation of Made In Taiwan products through an integrated global information campaign.\nThe objective is to transform Taiwan from a regional manufacturing center into a global R&D and innovation center.\nType of Awards\nTaiwan Excellence Awards. Judges select the products which are authorized to display the symbol of Taiwan Excellence attached with the winning year.\nSilver Awards. Judges elect up to 30 finalists from the Taiwan Excellence Award winners for screening. After the gold winners are selected, the remaining are awarded with the Silver Awards.\nGold Awards. A maximum of eight products may be awarded with the Gold Award.\nTaiwan Excellence for Best Performance. An award that is delivered to the corporation who won the most Taiwan Excellence Awards for the year.\nTaiwan Excellence Achievement Awards. Presented to the companies who have earned at least 50 Taiwan Excellence Awards during the past years.\nPopularity Award. The public participates in the nomination of the 30 finalists and the most popular product is awarded.\n2008 Taiwan Excellence Award Winners\nGold Awards (8)\nSilver Awards (21)\nCertificates for Taiwan Excellence (112)\nTaiwan Excellence for Best Performance (1)\nTaiwan Excellence Achievement Award (2)\nPopularity Award (1)\n2009 Taiwan Excellence Award Winners\nGold Award Winners List (8):\nEee PC S101 -ASUSTeK Computer Inc.\nCity Speed -Giant Manufacturing Co., Ltd.\nTouch Diamond -High Tech Computer Corp.\nEnergy Conservation Driving Module -Hiwin Technologies Corp.\nPico Pocket Projector -Optoma Corp.\nWorldCard -Penpower Technology Ltd.\nRatcheting Adjustable Wrench -Proxene Tools Co., Ltd.\nRice Cooker -Tatung Co.\nSilver Award Winners List (22):\nPocketCinema -AIPTEK International Inc.\n3.5G Super Performance PDA Phone -ASUSTeK Computer Inc.\nBamboo Series Notebook Bamboo -ASUSTeK Computer Inc.\nShort-Throw Gaming Projector -BenQ Corp.\n19-inch Wide Panel -Chi Mei Optoelectronics Corp.\nTaiwan Blue Magpie Collection -Franz Collection Inc.\nTCR Advanced SL TCR Advanced -Giant Manufacturing Co., Ltd.\nLinear Motor Air Bearing Platform -Hiwin Mikrosystem Corp.\nTreadmill - Johnson Health Tech. Co., Ltd.\nFunctional Trainer - Johnson Health Tech. Co., Ltd.\nVertical Machining Center -Kao Fong Machinery Co., Ltd.\nJockey G5 125/150 -Kwang Yang Industry Co., Ltd.\nSolargizer leading desktop combo -KYE Systems Corp.(Genius)\nFull suspension MTB – One Five O -Mérida Industry Co., Ltd.\nElixir DDR3 SODIMM series -Nanya Technology Corporation\nPacific IF -Pacific Cycles, Inc.\nRefrigerator -Panasonic Taiwan Co., Ltd.\nAll Terrain Vehicle (ATV) -Taiwan Golden Bee Co., Ltd.\nFine Arts Counter Top Gas Hobs -Taiwan Sakura Corporation\nFine Arts Chimney Range Hood -Taiwan Sakura Corp.\nDual-Band Wireless-N Router -ZyXEL Communications Corp.\nWiMAX Indoor Femto Base Station -ZyXEL Communications Corp.\n2024 Taiwan Excellence Award Winners\nK51L-SWRH | Mechanical Adjustable Swing Clear Hinge - Waterson Corporation\nSee also\n* Made in Taiwan\nReferences\nExternal links\nPhotos of 2008 Taiwan Excellence Awards ceremony [http://commons.wikimedia.org/wiki/Category:2008_Taiwan_Excellence_Awards]\nAbout TAITRA Taiwan External Trade Development Council\n2009 Taiwan Excellence Awards\n* [http://news.cens.com/cens/html/en/news/news_inner_27459.html]\nTaiwan Excellence in the ICT industry\n* [http://electronics.taiwantrade.com.tw/ORG/news.do?Method=news_detial&informationId=13559]\nMedia Releases\n* [http://brandingtaiwan.org/eng/twn_activity.aspx?id=02]\nTaiwan Excellence Awards 2011\n* [http://vr-zone.com/articles/taiwan-excellence-awards/11886.html]"
    }
  ]
}