{
  "content": [
    {
      "type": "text",
      "text": "# Taking Chances World Tour\n\n| album             =\n| start_date        =\n| end_date          =\n| number_of_legs    = 5\n| number_of_shows   = 131\n| gross             = US $279.2 million ($}} million in  dollars)\n| last_tour         = A New Day...(2003–07)\n| this_tour         = Taking Chances World Tour(2008–09)\n| next_tour         = Celine(2011–19)\n}}\nThe Taking Chances World Tour was the tenth concert tour by French Canadian singer Celine Dion, in-support of her thirteenth French-language and 22nd studio album, ''D'elles (2007), as well as her tenth English-language and 23rd studio album, Taking Chances (2007). The tour marked Dion’s return to performing on a global scale, after five successful years with her groundbreaking Las Vegas residency, A New Day.... It was also her first concert tour in nine years, following her Let's Talk About Love World Tour (1998/99).\nTaking Chances'' was, indeed, an ambitious tour; kicking-off with nine shows across five cities in South Africa, the tour saw Dion performing for fans in Dubai, Tokyo, Osaka, Macau, Seoul, Shanghai and Kuala Lumpur before visiting five cities in Australia—with further planned shows in Beijing, New Zealand, Qatar and Turkey being canceled for various unforeseen reasons. The tour then visited cities across Europe for 2½ months before embarking on a full, six-month-long North American tour, including three stops in Mexico and a sold-out show in San Juan, Puerto Rico. Pollstar announced the tour’s total gross to be US$279.2 million, making it 2008-2009’s fourth highest-grossing tour by a solo artist, and one of the highest-grossing tours of the 2000s.\nBackground and development\nThe show, directed by Jamie King (famously known for his work with Madonna), combined Dion's performances with color, fashion and dance. Dion performed some of her biggest hits, along with songs from her latest English album Taking Chances. The two-hour show was divided into four segments: soul, rock, Middle-Eastern and “fashion-victim”. Dion was supported by eight dancers, four male and four female. Rehearsals took place in December 2007 in Primm, Nevada and Las Vegas, at the MGM Grand.\nThe technical production included 20 LED screens—among them, one that orbited above the stage—plus catwalks for audience interaction, conveyor belts, elevators and ramps. Dion pre-recorded a selection of videos for her show. The introduction video showed her driving a car at high-speed, set to a remix of \"I Drove All Night\" as the beginning of her concert. There have been 2 versions of the introduction video: The first version showed footage of Dion's career, and was seen in all South Africa, Asia, Australia, and some European dates before the second version, which was footage from cities Dion visited during the tour. As the tour went on, the intro video shaped up and more cities ended up being added. Another video showed the singer dressed in varying fashions over the years, with the \"My Heart Will Go On\" remix in the background.\nJamie King joined the tour on 2 May 2008 in Manchester, England. Before that date, the show was not on a central stage (except in Japan and Osaka) for logistics reasons. After two and a half months, Dion rehearsed again to perfect the show for the \"in the round\" setup. Because of Dion's bilingual career and the restrictions of certain arenas and stadiums on the tour, King had to direct and choreograph three separate shows. One show featured a set-list mostly of English-language songs, and was performed in-the-round using the full system of mobile screens, elevators, and conveyor belts. The second show also featured the center stage arrangement, but included ten of her best-known French language songs for performances in Francophone countries. A third, less-complex show was then designed for venues where the center stage would not fit physically, or where it would be impractical to transport the stage. An end-stage setup was used in these cases (as they were mainly indoor arenas), featuring a massive central video screen, and a lighting system that engulfed the stage in brilliant blue and red on three sides. Before the European leg, the central- and end-stage shows were finalized and then reconfigured, again, changing lights and cues, in order for the three separate shows to fit in these two stages. Dion premiered new costumes when the European tour began.\nDion and her band rehearsed about 60 tracks, both in English and French. Among those, about 27 songs were selected and ultimately performed live, according to each visited market. \"Pour que tu m'aimes encore\", one of her biggest French songs, internationally, was performed throughout the whole tour; the song set records in the 1990s as the best-selling French-language single of all time, and one of the only French songs in music history to achieve chart success in many non-Francophone countries. The singer also performed several favorite cover songs, including: James Brown's \"I Got the Feelin'\" and \"It's a Man's Man's Man's World\", and Queen's \"We Will Rock You\" and \"The Show Must Go On\" (although the last two were dropped starting with 27 October Winnipeg show). She also performed Kiki Dee's \"I've Got the Music in Me\"; this song was removed after the show in South Korea.\nWhen the tour ultimately reached Dion’s home province of Québec, Canada, she performed eight sold-out shows in Montréal and two in Québec City; furthermore, although not an official date on the Taking Chances Tour, on 22 August 2008, Dion performed a free show for 250,000 people—the single largest audience of her entire career—as part of the 400th anniversary of Quebec City; the concert was held at the legendary Plains of Abraham site. The show, exclusively performed in French, featured many special guests, including: Garou, Dan Bigras, Ginette Reno and Jean-Pierre Ferland. The show aired live on Bell Satellite TV and was seen by over 200,000 at-home viewers.\nBroadcasts and recordings\nOn 22 August 2008, the City of Lévis aired Dion's honorary Quebec City's 400th birthday concert on both the web and television. Dion performed in front of 250,000 people. Additionally on 31 August 2008, a special performance of \"My Love\", aired on the Jerry Lewis MDA Telethon. It became later the official video for the single \"My Love.\"\nOfficial tour photo book, called Celine autour du monde was released on 24 September 2009 in Québec and France and It includes 368 pages with 485 photos by Gérard Schachmes. There are images from concerts and backstage, photos of Dion, her family, tour team, dancers, singers, musicians and technicians, Dion intimate moments with her husband, René Angélil, and their son, Rene-Charles. There are all kind of photographs from walking on the River Thames, in a park with lions, a safari in Africa, to travel in private aircraft, including the arrival of trucks in the early morning in New York City and the spectacular assembling the scene. The book was released in Canada on 14 October 2009. The U.S. and Japanese editions are also planned.\nThe tour was chronicled in the documentary, Celine: Through the Eyes of the World, which gave the \"unique opportunity to follow Celine everywhere, on stage, backstage, enjoying free time with her family; this movie will show it all.\" It was released on DVD and Blu-ray on 11 May 2010.\nTaking Chances World Tour: The Concert was released on 11 May 2010. It contains a DVD and a live CD of the English and French setlists (each released separately). The English set list was recorded in Boston (on 12 and 13 August 2008), while the French one in Montreal (on 31 August and 1 September 2008). There is also a deluxe edition including both DVDs and a 52-page booklet and fold-out souvenir postcards.\nCommercial reception\nDion set a record in the history of Canadian concerts, when she sold out all her Montreal shows in only a few minutes. After further shows being added, bringing the total to 11, Montreal's audience (with 20,995 in attendance at each show) became the largest on the tour with 227,616 spectators for a single city. Dion performed in Bell Centre 31 times since 1996.\nOther Canadian concerts were sold out immediately, prompting second dates to be added in Edmonton, Vancouver and Winnipeg, and a third show added in Toronto. In the United States, second dates were announced in New York City, Uniondale, Boston, and Newark. In Ireland 64,000 tickets for her Dublin concert, the largest single concert of the scheduled tour, were sold out in 3 hours.\nDion also sold out stadium audiences in South Africa, Netherlands (50,000) and Denmark (42,000). A second concert date was added for Sydney, Australia after tickets were selling fast in the country. For a 22 August 2008 free concert (not a part of the Taking Chances Tour), Dion sang in front of her biggest crowd, up until that point, when she performed on the Plains of Abraham to help celebrate Quebec City's 400th Birthday. Tickets were distributed to around 250,000 people.\nDion announced she would be playing at The Colosseum at Caesars Windsor on 7 February 2008. Tickets sold out in a record 15 minutes, with more than 125 people queuing up the night before to wait for tickets. Her performance at the Kansas City, Missouri Sprint Center became the highest-grossing concert in the arena's history, with a gross of $1,661,827. That record has since been broken by Elton John and Billy Joel. Dion's concert at the Miami, Florida American Airlines Arena set an attendance record, selling 17,725 tickets. Britney Spears broke that record two months later, performing for 18,644 people. However, although singing for a smaller audience, Dion grossed $2,247,233; Spears managed to gross $1,972,928. According to her official website, Dion became the top-selling performer for three venues: Montreal’s Bell Centre, Kansas City's Sprint Center, and the New Orleans Arena. The latter concert grossed $1,829,331. Dion's performances at the Bell Centre (in 2008) ranked second in Billboard's Top 25 Boxscores.\nCritical reception\nThe concerts received mixed reviews in the press. Diane Coetzer of Billboard claimed Dion's first performance in South Africa \"may not have ultimately succeeded in presenting her as a multi-faceted performer, but it definitely confirmed that Dion is a singer of unparalleled ability. Performing in a stadium that ordinarily holds rugby fans and flanked by two huge screens, Dion used her astonishing voice to captivate the near-capacity crowd.\"  Coetzer praised the dancing and visuals, but believed the choice in covering soul songs and songs from Queen made the show awkward until the closing in which \"My Heart Will Go On\" was performed.\nJon Caramanica of the New York Times wrote that Dion \"showed off a few new tricks without violating her core tenets of scale and pomp.\"  On the other hand, he described some of the other songs, such as \"My Love\" as \"a technical exercise, a singer practicing her vocal workout in front of thousands of people.\"  The Independent gave a negative review of Dion's performance in the London concert, by awarding the show 2 stars out of 5 and claiming, \"Many singers perform in their second language and manage to sound convincing. Despite selling a reported 200 million albums – including 27 million copies of that Titanic soundtrack – Céline Dion is not one of them.\"\nRandy Lewis's article in the Los Angeles Times was more enthusiastic, opening with, \"It's a no-brainer why Celine Dion's Taking Chances tour is shaping up as one of the highest-grossing North American concert attractions of 2008... hundreds of thousands of fans are filling arena after arena to hear Dion deliver emotional climax after emotional climax, goosebump-inducing vocal thrill after thrill, sweeping chorus after chorus filled with spirit-lifting affirmations and enough technical razzle-dazzle to dwarf the Super Bowl halftime show. And that was just her opening number.\"  The article was expanded, claiming \"her vocal workouts are all about perfection — and without a hint Auto-Tuning in sight — she succeeds at letting her human side come through in the spaces between songs.  That gave some tangible ballast to the often overblown arrangements that typify her middle-of-the-road pop songs. The album from which the tour draws its name does indeed take a few chances —stylistically, placing her in harder-hitting rock settings than she, or her fans, have been used to. And she included a healthy dose of the new songs, pumped up by her razor-sharp band and three singers, who were joined by eight dancers on several of the night's biggest numbers.\"  Like in the previously mentioned Billboard article, the soul covers were not appreciated.\nSarah Rodman of the Boston Globe wrote positively, \"There was never a dearth of stimulation, be it her own costume changes, the intricate lighting, the video imagery, or her cadre of dancers, deployed judiciously.  It's a testament to her skill however, that even when the songs weren't strong, Dion was.\"\nCTV News acclaimed Dion's performance in Montreal, \"Dion's stock moves were also on ready display – the fist jabs in the air, the sweep of the arms which makes her look as though she's going to take flight, and the cantering across the stage.  However, the trademark chest-thumping move dubbed 'the defibrillator' by comedians and critics wasn't as prominent.  The 'Taking Chances World Tour' marks Dion's return to the road after a five-year gig in Las Vegas and Celineophiles were tingling with excitement as they lined up to get into the Bell Centre.  Dion had the crowd in the palm of her hand to the point that when she swaggered over to a corner of the stage during various songs, the crowd in that section rose as one as though on command and reached out.\"\nMuch of the critical division came towards Dion's new image as someone who came back from a Vegas showcase.  Dave Simpson of The Guardian gave the Manchester concert 3 stars out of 5 and stated, \"in her nine-year break from touring (apart from a residency in Vegas), Dion has clearly been abducted by aliens and replaced by CelineBarbie, a dancing sex goddess who makes raunchy smiles at the camera, dances with musclemen, performs rockers penned by Pink's songwriter Linda Perry and, bizarrely, turns Roy Orbison songs into gay disco.\"  An article in Sun Media gave the Toronto concert 3.5 out of 5 stars and stated, \"Is Celine Dion really taking chances anymore?  Well, the name of her current world tour would say that she is, but the 40-year-old mega-selling pop star is basically Vegas personified.\"  On the other hand, The Vancouver Sun after praising the show's set-up, stated, \"The idea here is presumably to humanize the diva, as it were, and, fittingly, during the show Dion makes use of two protruding catwalks to \"mingle\" with the audience. It's worth questioning how humanizing an influence doting devotees who can justify spending $520 for two hours of light entertainment really are, but that's a whole other thesis.\"\nOpening act\n*Jody Williams\n*Yuna Ito\n*Anthony Callea\n*Michaël Gregorio\n*Arno Carstens\n*Il Divo\n*Jon Mesek\n*The Storys\n*Nordstrøm\n*Calaisa\n*Lenka Filipová\n*Natalia Lesz\n*Gordie Brown\n*Véronic DiCaire\nTour dates\n{| class=\"wikitable\" style=\"text-align:center\"\n|+ List of 2008 concerts\nOctober 2008,\nNovember 2008,}}\n|-\n! scope=\"col\" style=\"width:11em;\"| Date\n! scope=\"col\" style=\"width:11em;\"| City\n! scope=\"col\" style=\"width:11em;\"| Country\n! scope=\"col\" style=\"width:14em;\"| Venue\n! scope=\"col\" style=\"width:10em;\"| Attendance\n! scope=\"col\" style=\"width:10em;\"| Revenue\n|-\n|14 February 2008\n|Johannesburg\n|rowspan=\"9\"|South Africa\n|Coca-Cola Dome\n|\n|\n|-\n|16 February 2008\n|rowspan=\"2\"|Pretoria\n|rowspan=\"2\"|Loftus Versfeld Stadium\n|rowspan=\"2\"|59,100 / 91,200\n|rowspan=\"2\"|$4,176,510\n|-\n|17 February 2008\n|-\n|20 February 2008\n|Durban\n|ABSA Stadium\n|36,973 / 36,973\n|$1,779,549\n|-\n|23 February 2008\n|rowspan=\"2\"|Cape Town\n|rowspan=\"2\"|Great Lawn at Vergelegen\n|rowspan=\"2\"|53,328 / 68,000\n|rowspan=\"2\"|$3,930,963\n|-\n|24 February 2008\n|-\n|27 February 2008\n|Port Elizabeth\n|EPRU Stadium\n|17,310 / 28,500\n|$902,836\n|-\n|29 February 2008\n|rowspan=\"2\"|Johannesburg\n|rowspan=\"2\"|Montecasino\n|rowspan=\"2\"|20,987 / 23,000\n|rowspan=\"2\"|$2,481,897\n|-\n|1 March 2008\n|-\n|5 March 2008\n|Dubai\n|United Arab Emirates\n|Four Seasons Golf Club\n|7,873 / 19,400\n|$1,487,185\n|-\n|8 March 2008\n|rowspan=\"2\"|Tokyo\n|rowspan=\"4\"|Japan\n|rowspan=\"2\"|Tokyo Dome\n|rowspan=\"2\"|95,150 / 100,000\n|rowspan=\"2\"|$11,226,594\n|-\n|9 March 2008\n|-\n|11 March 2008\n|rowspan=\"2\"|Osaka\n|rowspan=\"2\"|Osaka Dome\n|rowspan=\"2\"|58,756 / 60,000\n|rowspan=\"2\"|$6,699,627\n|-\n|12 March 2008\n|-\n|15 March 2008\n|colspan=\"2\"|Macau\n|Venetian Arena\n|10,475 / 10,475\n|$1,996,842\n|-\n|18 March 2008\n|rowspan=\"2\"|Seoul\n|rowspan=\"2\"|South Korea\n|rowspan=\"2\"|Olympic Gymnastics Arena\n|rowspan=\"2\"|11,387 / 21,788\n|rowspan=\"2\"|$1,843,776\n|-\n|19 March 2008\n|-\n|31 March 2008\n|Brisbane\n|rowspan=\"5\"|Australia\n|Brisbane Entertainment Centre\n|7,835 / 13,156\n|$1,719,321\n|-\n|2 April 2008\n|Melbourne\n|Rod Laver Arena\n|12,266 / 15,431\n|$2,314,928\n|-\n|5 April 2008\n|rowspan=\"2\"|Sydney\n|rowspan=\"2\"|Acer Arena\n|rowspan=\"2\"|20,605 / 21,752\n|rowspan=\"2\"|$4,176,200\n|-\n|6 April 2008\n|-\n|8 April 2008\n|Perth\n|Members Equity Stadium\n|10,086 / 15,613\n|$1,648,288\n|-\n|11 April 2008\n|Shanghai\n|China\n|Shanghai Stadium\n|22,579 / 30,198\n|$2,699,898\n|-\n|13 April 2008\n|Kuala Lumpur\n|Malaysia\n|Stadium Merdeka\n|8,638 / 11,258\n|$1,046,730\n|-\n|2 May 2008\n|rowspan=\"2\"|Manchester\n|rowspan=\"5\"|England\n|rowspan=\"2\"|Manchester Evening News Arena\n|rowspan=\"2\"|36,031 / 36,031\n|rowspan=\"2\"|$5,339,056\n|-\n|3 May 2008\n|-\n|6 May 2008\n|rowspan=\"2\"|London\n|rowspan=\"2\"|The O2 Arena\n|rowspan=\"2\"|37,445 / 38,300\n|rowspan=\"2\"|$5,104,817\n|-\n|8 May 2008\n|-\n|10 May 2008\n|Birmingham\n|National Indoor Arena\n|12,108 / 12,432\n|$2,091,437\n|-\n|13 May 2008\n|rowspan=\"3\"|Antwerp\n|rowspan=\"3\"|Belgium\n|rowspan=\"3\"|Sportpaleis\n|rowspan=\"3\"|45,352 / 46,955\n|rowspan=\"3\"|$7,619,814\n|-\n|14 May 2008\n|-\n|16 May 2008\n|-\n|19 May 2008\n|rowspan=\"6\"|Paris\n|rowspan=\"6\"|France\n|rowspan=\"6\"|Palais Omnisports de Paris-Bercy\n|rowspan=\"6\"|73,555 / 83,148\n|rowspan=\"6\"|$17,193,013\n|-\n|20 May 2008\n|-\n|21 May 2008\n|-\n|24 May 2008\n|-\n|25 May 2008\n|-\n|27 May 2008\n|-\n|30 May 2008\n|Dublin\n|Ireland\n|Croke Park\n|61,746 / 61,746\n|$8,650,493\n|-\n|2 June 2008\n|Amsterdam\n|Netherlands\n|Amsterdam Arena\n|46,969 / 52,772\n|$4,565,126\n|-\n|5 June 2008\n|Copenhagen\n|Denmark\n|Parken Stadium\n|39,071 / 39,360\n|$5,089,936\n|-\n|7 June 2008\n|Stockholm\n|Sweden\n|Stockholm Globe Arena\n|14,817 / 14,817\n|$2,428,840\n|-\n|9 June 2008\n|Helsinki\n|Finland\n|Hartwall Arena\n|13,348 / 13,348\n|$3,108,811\n|-\n|12 June 2008\n|Berlin\n|rowspan=\"6\"|Germany\n|Waldbühne\n|13,153 / 14,000\n|$1,826,671\n|-\n|14 June 2008\n|Frankfurt\n|Commerzbank-Arena\n|15,333 / 18,000\n|$2,206,722\n|-\n|16 June 2008\n|Stuttgart\n|Hanns-Martin-Schleyer-Halle\n|5,692 / 7,000\n|$1,274,927\n|-\n|18 June 2008\n|Cologne\n|Lanxess Arena\n|9,657 / 10,000\n|$1,914,513\n|-\n|20 June 2008\n|Hamburg\n|Color Line Arena\n|8,757 / 9,500\n|$2,023,846\n|-\n|22 June 2008\n|Munich\n|Olympiastadion\n|17,015 / 20,000\n|$2,414,114\n|-\n|24 June 2008\n|Zürich\n|Switzerland\n|Hallenstadion\n|11,005 / 11,005\n|$2,246,343\n|-\n|26 June 2008\n|Prague\n|Czech Republic\n|O2 Arena\n|13,923 / 18,000\n|$1,222,912\n|-\n|28 June 2008\n|Kraków\n|Poland\n|Błonia Park\n|12,755 / 15,000\n|$1,733,229\n|-\n|1 July 2008\n|Vienna\n|Austria\n|Wiener Stadthalle\n|9,518 / 10,000\n|$2,519,748\n|-\n|3 July 2008\n|Milan\n|Italy\n|DatchForum\n|\n|\n|-\n|5 July 2008\n|Nice\n|rowspan=\"2\"|France\n|Stade Charles-Ehrmann\n|23,865 / 24,000\n|$4,198,510\n|-\n|7 July 2008\n|Arras\n|Grand-Place d'Arras\n|14,974 / 15,000\n|$1,437,735\n|-\n|9 July 2008\n|Geneva\n|Switzerland\n|Stade de Genève\n|19,954 / 20,000\n|$4,364,730\n|-\n|11 July 2008\n|rowspan=\"2\"|Monte Carlo\n|rowspan=\"2\"|Monaco\n|rowspan=\"2\"|Salle des Etoiles\n|rowspan=\"2\"|1,800 / 1,800\n|rowspan=\"2\"|$1,420,236\n|-\n|12 July 2008\n|-\n|12 August 2008\n|rowspan=\"2\"|Boston\n|rowspan=\"2\"|United States\n|rowspan=\"2\"|TD Banknorth Garden\n|rowspan=\"2\"|32,493 / 32,493\n|rowspan=\"2\"|$3,813,519\n|-\n|13 August 2008\n|-\n|15 August 2008\n|rowspan=\"6\"|Montreal\n|rowspan=\"10\"|Canada\n|rowspan=\"6\"|Bell Centre\n|rowspan=\"6\"|227,616 / 227,616\n|rowspan=\"6\"|$30,137,572\n|-\n|16 August 2008\n|-\n|19 August 2008\n|-\n|20 August 2008\n|-\n|23 August 2008\n|-\n|25 August 2008\n|-\n|27 August 2008\n|rowspan=\"2\"|Toronto\n|rowspan=\"2\"|Air Canada Centre\n|rowspan=\"2\"|54,384 / 54,384\n|rowspan=\"2\"|$7,140,013\n|-\n|28 August 2008\n|-\n|31 August 2008\n|rowspan=\"2\"|Montreal\n|rowspan=\"2\"|Bell Centre\n|rowspan=\"2\"|—\n|rowspan=\"2\"|—\n|-\n|1 September 2008\n|-\n|3 September 2008\n|Buffalo\n|rowspan=\"14\"|United States\n|HSBC Arena\n|16,343 / 16,343\n|$1,381,696\n|-\n|5 September 2008\n|Philadelphia\n|Wachovia Center\n|18,061 / 18,061\n|$2,246,374\n|-\n|6 September 2008\n|Ledyard\n|MGM Grand Theater\n|\n|\n|-\n|8 September 2008\n|Washington, D.C.\n|Verizon Center\n|16,845 / 16,845\n|$2,225,458\n|-\n|10 September 2008\n|rowspan=\"2\"|Newark\n|rowspan=\"2\"|Prudential Center\n|rowspan=\"2\"|31,902 / 31,902\n|rowspan=\"2\"|$3,605,530\n|-\n|12 September 2008\n|-\n|13 September 2008\n|Uniondale\n|Nassau Veterans Memorial Coliseum\n|32,432 / 32,432\n|$3,586,695\n|-\n|15 September 2008\n|rowspan=\"2\"|New York City\n|rowspan=\"2\"|Madison Square Garden\n|rowspan=\"2\"|36,291 / 36,291\n|rowspan=\"2\"|$4,476,480\n|-\n|16 September 2008\n|-\n|18 September 2008\n|Uniondale\n|Nassau Veterans Memorial Coliseum\n|—\n|—\n|-\n|20 September 2008\n|Atlantic City\n|Boardwalk Hall\n|14,590 / 14,590\n|$2,142,875\n|-\n|22 September 2008\n|Columbus\n|Value City Arena\n|16,986 / 16,986\n|$1,399,218\n|-\n|24 September 2008\n|Cleveland\n|Quicken Loans Arena\n|17,343 / 17,343\n|$1,486,401\n|-\n|26 September 2008\n|Auburn Hills\n|The Palace of Auburn Hills\n|19,486 / 19,486\n|$1,959,845\n|-\n|27 September 2008\n|Toronto\n|Canada\n|Air Canada Centre\n|—\n|—\n|-\n|29 September 2008\n|Milwaukee\n|rowspan=\"4\"|United States\n|Bradley Center\n|17,443 / 17,443\n|$1,193,896\n|-\n|14 October 2008\n|Sacramento\n|ARCO Arena\n|15,213 / 15,213\n|$1,442,044\n|-\n|16 October 2008\n|Portland\n|Rose Garden\n|18,001 / 18,001\n|$1,247,473\n|-\n|18 October 2008\n|Tacoma\n|Tacoma Dome\n|20,665 / 20,665\n|$1,765,386\n|-\n|20 October 2008\n|rowspan=\"2\"|Vancouver\n|rowspan=\"7\"|Canada\n|rowspan=\"2\"|General Motors Place\n|rowspan=\"2\"|34,348 / 34,348\n|rowspan=\"2\"|$3,587,340\n|-\n|21 October 2008\n|-\n|24 October 2008\n|rowspan=\"2\"|Edmonton\n|rowspan=\"2\"|Rexall Place\n|rowspan=\"2\"|32,958 / 32,958\n|rowspan=\"2\"|$3,105,627\n|-\n|25 October 2008\n|-\n|27 October 2008\n|rowspan=\"2\"|Winnipeg\n|rowspan=\"2\"|MTS Centre\n|rowspan=\"2\"|29,062 / 29,062\n|rowspan=\"2\"|$2,586,462\n|-\n|28 October 2008\n|-\n|7 November 2008\n|Ottawa\n|Scotiabank Place\n|13,531 / 13,531\n|$1,803,586\n|-\n|29 November 2008\n|Anaheim\n|rowspan=\"3\"|United States\n|Honda Center\n|15,587 / 15,587\n|$1,785,579\n|-\n|2 December 2008\n|Los Angeles\n|Staples Center\n|16,776 / 16,776\n|$2,157,110\n|-\n|6 December 2008\n|Glendale\n|Jobing.com Arena\n|16,283 / 16,283\n|$1,739,928\n|-\n|9 December 2008\n|Mexico City\n|rowspan=\"3\"|Mexico\n|Palacio de los Deportes\n|16,316 / 16,417\n|$1,323,694\n|-\n|11 December 2008\n|Guadalajara\n|Arena VFG\n|9,442 / 13,244\n|$936,565\n|-\n|13 December 2008\n|Monterrey\n|Arena Monterrey\n|11,073 / 11,073\n|$1,065,716\n|-\n|16 December 2008\n|Chicago\n|rowspan=\"3\"|United States\n|United Center\n|17,191 / 17,191\n|$1,943,436\n|-\n|18 December 2008\n|Minneapolis\n|Target Center\n|15,503 / 15,503\n|$1,814,517\n|-\n|21 December 2008\n|Indianapolis\n|Conseco Fieldhouse\n|14,538 / 14,538\n|$1,154,402\n|}\n{| class=\"wikitable\" style=\"text-align:center\"\n|+ List of 2009 concerts\nFebruary 2009,\nMarch 2009\nand June 2009}}\n|-\n! scope=\"col\" style=\"width:11em;\"| Date\n! scope=\"col\" style=\"width:11em;\"| City\n! scope=\"col\" style=\"width:11em;\"| Country\n! scope=\"col\" style=\"width:14em;\"| Venue\n! scope=\"col\" style=\"width:10em;\"| Attendance\n! scope=\"col\" style=\"width:10em;\"| Revenue\n|-\n|3 January 2009\n|Kansas City\n|rowspan=\"12\"|United States\n|Sprint Center\n|16,106 / 16,106\n|$1,661,827\n|-\n|5 January 2009\n|Dallas\n|American Airlines Center\n|17,661 / 17,661\n|$2,161,548\n|-\n|7 January 2009\n|San Antonio\n|AT&T Center\n|12,882 / 12,882\n|$1,164,271\n|-\n|9 January 2009\n|Houston\n|Toyota Center\n|16,396 / 16,396\n|$2,225,019\n|-\n|10 January 2009\n|New Orleans\n|New Orleans Arena\n|17,006 / 17,006\n|$1,829,331\n|-\n|13 January 2009\n|Nashville\n|Sommet Center\n|16,352 / 16,352\n|$1,602,595\n|-\n|15 January 2009\n|Birmingham\n|BJCC Arena\n|14,733 / 14,733\n|$1,065,830\n|-\n|17 January 2009\n|Atlanta\n|Philips Arena\n|16,919 / 16,919\n|$2,300,783\n|-\n|21 January 2009\n|Raleigh\n|RBC Center\n|16,527 / 16,527\n|$1,583,500\n|-\n|23 January 2009\n|Miami\n|American Airlines Arena\n|17,725 / 17,725\n|$2,247,233\n|-\n|28 January 2009\n|Tampa\n|St. Pete Times Forum\n|17,909 / 17,909\n|$1,843,187\n|-\n|30 January 2009\n|Sunrise\n|BankAtlantic Center\n|18,147 / 18,147\n|$2,233,198\n|-\n|31 January 2009\n|San Juan\n|Puerto Rico\n|Coliseo de Puerto Rico\n|13,812 / 13,812\n|$1,625,045\n|-\n|2 February 2009\n|Tulsa\n|rowspan=\"2\"|United States\n|BOK Center\n|15,933 / 15,933\n|$1,570,961\n|-\n|4 February 2009\n|St. Louis\n|Scottrade Center\n|17,283 / 17,283\n|$1,351,246\n|-\n|7 February 2009\n|Windsor\n|rowspan=\"6\"|Canada\n|The Colosseum at Caesars Windsor\n|1,978 / 2,656\n|$320,966\n|-\n|9 February 2009\n|rowspan=\"2\"|Quebec City\n|rowspan=\"2\"|Colisée Pepsi\n|rowspan=\"2\"|20,903 / 20,903\n|rowspan=\"2\"|$2,941,651\n|-\n|10 February 2009\n|-\n|12 February 2009\n|rowspan=\"3\"|Montreal\n|rowspan=\"3\"|Bell Centre\n|rowspan=\"3\"|—\n|rowspan=\"3\"|—\n|-\n|14 February 2009\n|-\n|15 February 2009\n|-\n|20 February 2009\n|San Jose\n|rowspan=\"4\"|United States\n|HP Pavilion at San Jose\n|16,862 / 16,862\n|$1,897,276\n|-\n|22 February 2009\n|Salt Lake City\n|EnergySolutions Arena\n|16,212 / 16,212\n|$1,245,743\n|-\n|24 February 2009\n|Denver\n|Pepsi Center\n|16,461 / 16,461\n|$1,413,647\n|-\n|26 February 2009\n|Omaha\n|Qwest Center Arena\n|15,783 / 15,783\n|$1,260,362\n|-\n! colspan=\"4\" | Total\n|2,193,483 / 2,325,831 (94%)\n|$274,126,379\n|-\n|}\n;Festivals and other miscellaneous performances\n:This concert benefited Nelson Mandela Children's Fund\n:This concert was a part of the \"Main Square Festival\"\n:These concerts were a part of the \"Monte-Carlo Sporting Summer Festival\"\nCancelled shows\n{|class=\"wikitable plainrowheaders\" style=\"text-align:center;\"\n|+ List of cancelled concerts showing date, city, country, venue, and reason for cancellation\n|-\n! scope=\"col\" style=\"width:12em;\"| Date\n! scope=\"col\" style=\"width:10em;\"| City\n! scope=\"col\" style=\"width:10em;\"| Country\n! scope=\"col\" style=\"width:16em;\"| Venue\n! scope=\"col\" style=\"width:16em;\"| Reason\n|-\n|3 March 2008\n|Doha\n|Qatar\n|Al-Sadd Stadium\n| rowspan=\"6\" |Security reasons & sickness (Auckland & San Diego)\n|-\n|23 March 2008\n|Auckland\n|New Zealand\n|Vector Arena\n|-\n|13 April 2008\n|Beijing\n|China\n|Workers Stadium\n|-\n|28 June 2008\n|Istanbul\n|Turkey\n|BJK İnönü Stadium\n|-\n|23 August 2008\n|Halifax\n|Canada\n|Halifax Common\n|-\n|25 November 2008\n|San Diego\n|United States\n|San Diego Sports Arena\n|-\n|}\n*Dion's performances at the Bell Centre (in 2008) ranked second in Billboard's Top 25 Boxscores.\nPersonnel\n* Manager: René Angélil\n* Tour director: Denis Savage\n* Tour manager: Michel Dion (talent)\n* Tour manager: Patrick Angélil (production, logistics and media relations)\n* Production manager: Rick Mooney\n* Assistant production manager: Shari Weber\n* Stage manager: Alexandre Miasnikof\n* Artist's personal security: Nick Skokos\n* Tour rigger: Cindy Beaumariage\n* Lighting director: Yves \"Lapin\" Aucoin\n* Front of house engineer: François \"Frankie\" Desjardins\n* Monitor engineer: Charles Ethier\n* Audio system engineer: Mario St-Onge\n* RF engineer: Marc Theriault\n* Health Services/Chiropractor:  Trevelynn Henuset DC\n* Assistant lighting director/lighting head: Karl Gaudreau\n* Video director: Veillet Mireille\n* Head back-line tech: Jeff Dubois\n* Computer programmer and keyboard technician: Guy Vignola\n* Head video: Martin Perreault\n* Production assistants: Sharie Weber, Stephanie Duval\n* Tour accountant: Sylvia Hebel\n* Creative director: Jamie King\n* Tour director: Jim Allison, Concerts West\n* Production director: Lonnie McKenzie\n* Lighting, audio, video vendor: Solotech, Montreal\n* Merchandiser: Billy Wilson\nBand\n* Musical Director, Piano: Claude \"Mégo\" Lemay\n* Drums: Dominique Messier\n* Bass: Marc Langis\n* Guitars: André Coutu\n* Violin: Jean Sebastien Carré\n* Keyboards: Yves Frulla\n* Percussion: Nannette Fortier\n* Cello: Julie McInnes\n* Background vocals, Cello, Tin whistle: Élise Duguay\n* Background vocals: Mary-Lou Gauthier, Barnev Valsaint, Andrew St. Pierre\n* Dancers: Amanda Balen, Melissa Garcia, Kemba Shannon, Addie Yungmee, Zac Brazenas, Joshua Figueroa, Dominic Chaiduang, Aaron Foelske, Miguel Perez, Chris Houston, Tammy To\nSee also\n* List of highest-grossing concert tours\n* List of highest-grossing concert tours by women\nNotes\nReferences"
    }
  ]
}