{
  "content": [
    {
      "type": "text",
      "text": "# Taking Back the Cities Tour__disambig_1\n\n|artist               = Snow Patrol\n|location             =\n|start_date           = 26 October 2008\n|end_date             = 5 June 2010\n|number_of_legs       = 9\n|number_of_shows      = 169 (2 cancelled)\n|last_tour            = Eyes Open Tour(2006–2007)\n|this_tour            = Taking Back the Cities Tour(2008–2010)\n|next_tour            = Fallen Empires Tour(2012)\n}}\nThe Taking Back the Cities Tour was a concert tour by Northern Irish–Scottish alternative rock band Snow Patrol in support of their fifth album, A Hundred Million Suns (2008). The band visited numerous arenas internationally from 2008 throughout 2009. The tour was the collective name of many smaller tours and festivals Snow Patrol played in support of their album. The tour has spanned 9 legs and had over 150 shows. The tour commenced on 26 October 2008 with the band playing a short whistle-stop tour of four capital cities.\nThe tour has seen the band visit continents like Europe, North America, Australia and Africa. The band has mainly toured as a headlining act, though they have also supported Coldplay and U2 on their respective tours. Tour dates have included a number of summer rock festivals. Often, the band's set on tour has included playing the sixteen-minute-long \"The Lightning Strike\" in full, though sometimes only the first part is played.\nKeyboardist Tom Simpson said that the band wanted to tour Asian countries like Singapore. They have not yet done so because they wish to give justice to the UK and Ireland as they feel they've been \"neglecting them\". He also said that there's a possibility of Snow Patrol touring Asia in 2010. Lead singer Gary Lightbody has written on the band's website that they'll be returning to headline their own mini-festival at Ward Park next year. He has also revealed that it will be one of few concerts they'll play in the UK and Ireland in 2010, as they intend not to play any festivals and only \"special occasions\".\nThe show\nThe lighting for the tour was done by UK lighting company HSL, which also supplied the crew. HSL previously worked with the band for their tours in 2006 & 2007. The lighting on the tour is based on the concept of \"creative synergy\", which employs four visual mediums – lighting, digital lighting, video and movement. The initial ideas came from the band itself, who pitched them to Davy Sherwin, lighting & visuals director. Sherwin had previously worked with the band on their tours in 2006 & 2007. He came up with a simple arrangement of LED and moving lights, which he felt went well with the music of the album. A metalwork layout of five trusses running upstage/downstage was then added, referring \"sun rays\" from the album title. The trusses are hinged down at upstage end, so they are freely movable into the performance area. After the design was finalized, Sherwin started to program the show on an ESP Vision visualizer system. He then recorded every song onto a hard drive, and made QuickTime movies of the lighting scenes. These were used by Robin Haddow (live visuals director) and Blue Leach (video director) to program the screen looks, colors and effects, referring to Sherwin's cues. They rehearsed the show for six days at Wembley Arena. In live concerts, Sherwin, Haddow and Leach work together to ensure all four cues (lighting, digital lighting, video and movement) work properly. Sherwin and Haddow operate two WholeHog 3 consoles each, and Rupert Reynolds works the Kinesys system, which produces the effects. The tour is the first ever to use Barco's digital moving lights.\n;Lighting gear\n* 26-point Kinesys automation system\n* 8 columns of Barco O-lite video screen (13.5&nbsp;ft. high)\n* 4 Barco DLM 1200 digital moving lights\n* 5 lighting pods\n* 20 Vari*Lite 3500 Wash fixtures\n* 36 Martin Professional Atomic Colours\n* 34 Robe ColorWash 2500E ATs\n* 28 V*L 3000 Spots\n* 20 i-Pix BB4s\n* 5 BB16 blinders\n* 5 4-cell moles with scrollers\n* 6 2-lites with \"eyelids\"\n* 4 Robert Juliat Ivanhoe 2.5K follow spots\n* 2 WholeHog 3 consoles (+1 backup)\nThe Snow Patrol concert on the Irish TV Series Other Voices 8 marked the first time optical burst switching technology was used in the transmission of a live concert. Fans were provided a live high-definition streaming of the concert at the Benners Hotel, nearby the venue St. James' Church, among various other locations that were connected to a fiber optic network. The link could also be picked up in Wi-Fi spots on PDAs, laptops, and mobile phones. This instance was aimed to demonstrate the new technology, which was invented and developed in Ireland.\nTickets\nTickets for the Taking Back the Cities Tour were initially available to only those who signed up for the Snow Patrol mailing list on or before 2 October 2008 due to the intimate nature of the four shows. Members chosen received an e-mail with a pin-code which was needed to access their tickets. A week later, a small competition was announced for fans in the US, where fans were required to sign up to enter. For the last two tickets, Xfm teamed up with Snow Patrol. The winners were chosen via a lucky draw. Winners, and a friend travelled with the band on their private plane and got to attend all four shows. They were provided with a video camera to capture the events. The captured footage was later put up exclusively on the band's MySpace. The prize included round-trip airfare to and from the US, transportation and tickets to all four shows. The tickets were priced at £22.50 each. The Xfm tickets were bagged by Michael Green and his girlfriend Etly. Michael later wrote a review for Xfm describing his experience. Ticket holders also received artwork at the concert, and instructions on how to download highlights of the shows, which were made available the next day of the concerts.\nTickets for the UK & Ireland Arena Tour initially went on pre-sale exclusively from the official website from 31 October, 9&nbsp;am until 1 November midnight. Tickets for general sale started from 7 November, 9&nbsp;am. The tickets were priced £30 and £32.50 and a booking fee of £3.00/£3.25 was charged. Tickets could be obtained through services like Ticketmaster and Trinity St. Direct for UK & Ireland customers. Three pairs of tickets for the show at SECC in Glasgow on 24 February were given away in a last minute competition on the band's website. In mid-February, Trinity St. Direct ceased trading. Tickets for the shows had not yet fully dispatched. In an official statement, however, the company stated that they would ensure delivery of all outstanding orders.\nOn the Australian Promo Tour, Snow Patrol's promoter Frontier Touring Co. employed a strict ticketing policy because of the shortage of tickets for the one-off show at the 1,350 capacity Metro Theatre. General sale tickets were available through phone, website, or the venue box office one day before the event (18 November) from 9&nbsp;am and could only be purchased with a credit card. One card holder could only buy two tickets, and the system was designed such that it'd reject attempts of subsequent bookings that bore the same e-mail, phone number or address. The buyer received a confirmation number at the time of booking and not the physical ticket itself. There were other ways of obtaining tickets too. Snow Patrol's official website held a small competition for members where ten pairs of tickets were up for grabs. Universal Music Australia also ran a competition for fans where they had to buy the album or the single \"Take Back the City\" from iTunes or JB Hi-Fi and write in telling a reason why they needed to see the band. Winners received tickets for front row and centre. On 19 November, 12&nbsp;pm (the day of the concert), wristbands were made available at the venue. To obtain the bands, a photo ID, the credit card used for purchase and the confirmation number were required. The ticket purchaser and a friend had to arrive together with all proof to be wristbanded. As the show was for people in the 18+ year old bracket, a photo ID was necessary to ensure the attendee was old enough. The tickets were priced at $66 and were non-exchangeable nor transferable. Anyone with a tampered wristband was refused entry.\nThe Australian V Festival tickets went on pre-sale for 24&nbsp;hours, from 19 November, 9&nbsp;am. Pre-sale for Snow Patrol's official website members began on 25 November, 9&nbsp;am EST. General tickets went on sale from 28 November, 9am. Tickets for the side-shows went on pre-sale exclusively for official website members from 20 February, noon. General sale began from 23 February, 9&nbsp;am EST. Tickets for the free ShockHound concerts on the US Tour were available exclusive through their website from 21 November, 10&nbsp;am, PST. Members of Snow Patrol's official website also had the chance to grab the final 20 tickets for each of the shows by answering a question on the website.\nTickets for the Oxegen Festival initially went on pre-sale exclusively for Oxegen.ie members from 25 February 2009. General sale began from 6 March. The tickets for T in the Park went for general sale from 27 February. They could officially be obtained through phone or from Ticketmaster. The tickets were priced at £72.50. Tickets for the UK V Festival went for sale from 6 March, 10&nbsp;am. Tickets for the iTunes Festival were not available for general sale. Tickets could only be won by entering a competition, which could be found on iTunes' Facebook page. The official website later held a competition as a \"final chance\" for fans to win tickets to the event. Tickets for the show at The Rockhal were priced at €35 each (standing). Tickets for the BBC Children in Need concert could only be won by a ballot. Interested fans were required to register on the Children in Need website, between 16 October 2009, 7&nbsp;am (BST and 20 October 2009, 12&nbsp;pm (BST). The people whose names came up were notified by e-mail, and were allotted a maximum of two tickets, each priced between £50–£100. Since it was a charity concert, all profits from sales of tickets and recordings went towards the organization. For the Versus Cancer concert, tickets were priced at £32.50 and were available from Ticketmaster, See Tickets and Ticketline. Proceeds from the concert went to local charities in Manchester, with the Christie Hospital being one of beneficiaries.\non 30 May 2009.]]Tickets for the European leg of the tour went up for sale from 25 February. They could be obtained from online outlets like Ticketmaster, Oeticket and Eventim. Additional European shows were announced later. Tickets for the Denmark and Switzerland show went up for sale from 6 March, and those for the France show from 9 March. The prices ranged from €29 to €41.25, depending on the venue.\nTickets for the shows that will see Snow Patrol support Coldplay were released between 14, 21 and 23 March. Tickets were priced between $35.00 to $97.50. For the shows supporting U2, field level tickets were priced at $55, and approximately 10,000 tickets per show costed $30. The price points were $30, $55, and depending on the market, $90–95 and $250. Tickets for the sideshow could only be won through a competition organized by BNN. Though 15 pairs of tickets were initially announced as prizes, 48 winners were announced, who were notified through e-mail.\nTickets for the North American tour initially went on pre-sale, exclusively for members of the official website. Tickets for all dates went on general sale on 27 June, except for the dates in Washington, which went on 10 July, and Kansas City, on 11 July. Tickets for the Nashville show, which was announced earlier, went on pre-sale on 12 June. General sale began the next day, on 13 June and tickets could be purchased through Ticketmaster. Before the tour began the Myth Nightclub closed. The band issued a statement instructing ticket holders to obtain their new tickets from the new venue's (State Theatre) box-office. These tickets went out on 27 August 2009 at 10&nbsp;am and were exchanged on a first come, first served basis. Tickets for the concert in Seattle were priced at $32 (advance) and $35 (day of show). They could also be bought online or by phone. Tickets for the last concert of the North American Tour, held at The Wiltern LG were priced in the range of $35–$45. For the intimate concert at the Houndstooth Pub, the radio station gave away two passes for the show. Participants had to answer a trivia question to be eligible to win. KINK FM (of Portland) held a competition for members to win tickets for the live performance, that ended on 10 October. KNRK radio station of Portland also held a competition where listeners had to answer to a question, and the winner would be sent backstage at Snow Patrol's concert at The Schnitz on 13 October 2009.\nTickets for the Reworked Winter Tour went on pre-sale on 19 August 2009 at 9&nbsp;am. General sale began at 9&nbsp;am on 27 August. and tickets could be purchased from Gigsandtours (English dates), Ticketmaster (Irish and Scottish dates). Each purchased ticket will contain a code that will enable the buyer to access a free live download of \"The Lightning Strike\", recorded during the band's UK & Ireland Arena Tour of February–March 2009. 2,000 seated tickets for the Castlebar concert sold out fast, all in 39&nbsp;minutes, which is a record for the venue. Tickets were priced at £37, £47 and £57. Tickets for the other shows were priced in the range of €51.80–€62.50. Additional tickets for various shows were later released.\nOn 16 October 2009, a competition called the \"Up to Now Pub Quiz\" was launched on Facebook. Fans were required to create teams of five, and were posed with ten questions, related to the band's entire career, each week. The team with the most correct answers at the end will fly to London to see one of the concerts at the Royal Albert Hall, with a certain part of travel cost paid. The team will be allotted their own private box at the venue, and will get a chance to meet the band afterward. Along the same lines, a Swiss radio station 20 Minuten hosted a similar competition for listeners. They had a pair of tickets for the concert for the Royal Albert Hall concert of 24 November to give away. All flight and hotel accommodation costs were paid for by the radio station. UK radio station Xfm organized a competition called \"Xfm's Snow Patrol Bad Photoshop Challenge\", with ten pairs of tickets were up to win. These tickets would enable fans to see the band rehearse in a yet-unnamed location in Brighton at the eve of the Reworked Tour. The challenge was to associate five photoshopped pictures with Snow Patrol song titles. The competition will end on 10 November 2009. A further fifteen pairs of tickets will be given away on air. Tickets for the intimate acoustic show in London for the promotion of Up to Now could only be obtained via two competitions, one organized on Play.com and the other on the band's official website. Both involved answering a simple question. For the HMV singing and performance, wristbands were available from 9&nbsp;am on 3 December 2009. One band was assigned to one person, however, it was not necessary to have one to see the band perform. The bands were required only to gain access to the signing. Tickets for the mini-festival at Ward Park will go on pre-sale on 9 December 2009, and on general sale on the 11th, priced at £44.\nAs a headlining act\nTake Back the Cities Tour\nSnow Patrol played a short two-day concert tour two days before the release of their album, the tour being named after the single \"Take Back the City\". The band played in four capital cities in a 48-hour period. The band shuttled between the four cities in a twin propeller private jet. Dubbed the \"Patrol Plane\", it was used to accompany the band, the crew and competition winners to the four shows. The band also asked local schools, and got kids to draw pictures on the theme of the album title, which was displayed in the entrance lobbies of the chosen venues.\nThe band's homecoming show in Belfast saw the frontman Gary Lightbody's family attending. He admitted being nervous before the show. During the show, he dedicated \"The Golden Floor\" to his 15-month-old niece Honey. Following the concert, the band signed copies of the album at HMV Donegall Arcade. The next show in Edinburgh saw a pleased Paul Wilson return to his home country, Scotland. On the way to the final show in London, Wilson mentioned \"Crack the Shutters\" as the next single from the album. The band shot the music video a couple of days later.\n;Typical set list\n# \"If There's a Rocket Tie Me to It\"\n# \"Chocolate\"\n# \"Please Just Take These Photos From My Hands\"\n# \"Chasing Cars\"\n# \"On/Off\"\n# \"The Golden Floor\"\n# \"Shut Your Eyes\"\n# \"Crack the Shutters\"\n# \"Open Your Eyes\"\n# \"Take Back the City\"\n# \"Run\"\n# \"What If This Storm Ends?\"\n;Tour dates\n{| class=\"wikitable\" style=\"text-align:center;\"\n|-\n! style=\"width:200px;\"| Date\n! style=\"width:200px;\"| City\n! style=\"width:150px;\"| Country\n! style=\"width:300px;\"| Venue\n|-\n|26 October 2008\n|Dublin\n|Ireland\n|Gate Theatre\n|-\n|26 October 2008\n|Belfast\n|Northern Ireland\n|Empire Music Hall\n|-\n|27 October 2008\n|Edinburgh\n|Scotland\n|Assembly Hall\n|-\n|27 October 2008\n|London\n|England\n|Bloomsbury Theatre\n|}\nAustralian Tour\nSnow Patrol undertook a small promo tour of Australia in November 2008 to celebrate the album reaching #6 on the Australian charts and getting certified Gold. The tour included a one-off show in Sydney and two television appearances. This included an intimate concert for a crowd of 300 for Max Music TV. Dubbed the \"MAX Sessions\", the concert was held at the Hordern Pavilion, which was transformed into a makeshift studio for the night. The performance aired on MAX on 7 December at 7&nbsp;pm as \"MAX Sessions: Snow Patrol\" and was interspersed with behind-the-scenes footage and interviews the band as they prepared for the show.\n;Tour dates\n{| class=\"wikitable\" style=\"text-align:center;\"\n|-\n! style=\"width:200px;\"| Date\n! style=\"width:200px;\"| City\n! style=\"width:150px;\"| Country\n! style=\"width:300px;\"| Venue\n|-\n|17 November 2008\n|—\n|rowspan=\"3\"|Australia\n|Sunrise TV Show\n|-\n|17 November 2008\n|rowspan=\"2\"|Sydney\n|MAX Sessions @ Hordern Pavilion\n|-\n|19 November 2008\n|The Metro Theatre\n|}\nUS Tour\nSnow Patrol visited the United States in December to play four Christmas radio shows and three free shows sponsored by ShockHound.com. They were joined by Death Cab for Cutie for a couple of shows. They played a last show for KROQ's Acoustic Christmas concert. At the Bowery Ballroom concert, the band invited a brother-sister duo they had found on YouTube to sing \"Set the Fire to the Third Bar\".\n;Typical set list\n# \"If There's a Rocket Tie Me to It\"\n# \"Chocolate\"\n# \"Please Just Take These Photos From My Hands\"\n# \"How to Be Dead\"\n# \"Run\"\n# \"Set the Fire to the Third Bar\"\n# \"The Golden Floor\"\n# \"Shut Your Eyes\"\n# \"Chasing Cars\"\n# \"Make this Go on Forever\"\n# \"Crack the Shutters\"\n# \"Take Back the City\"\n;Encore\n;Tour dates\n{| class=\"wikitable\" style=\"text-align:center;\"\n|-\n! style=\"width:200px;\"| Date\n! style=\"width:200px;\"| City\n! style=\"width:150px;\"| Country\n! style=\"width:300px;\"| Venue\n! style=\"width:100px;\"| Notes\n|-\n|1 December 2008\n|New York City\n|rowspan=\"8\"|United States\n|Bowery Ballroom\n|Aired on WRXP 101.9 FM\n|-\n|4 December 2008\n|Baton Rouge\n|Baton Rouge River Center\n|At KNXX 104.9 – FM The Xmas Bash\n|-\n|5 December 2008\n|Grand Prairie\n|Nokia Theatre at Grand Prairie\n|At KDGE 102.1 FM – How the Edge Stole Christmas\n|-\n|7 December 2008\n|Denver\n|Gothic Theatre\n|At KBCO 97.3 FM – The KBCO Holiday Concert Series\n|-\n|9 December 2008\n|Tempe\n|The Clubhouse\n|ShockHound free concert\n|-\n|10 December 2008\n|Las Vegas\n|Wasted Space @ The Hard Rock\n|ShockHound free concert\n|-\n|13 December 2008\n|San Diego\n|House of Blues\n|ShockHound free concert\n|-\n|14 December 2008\n|Los Angeles\n|Gibson Amphitheatre\n|At KROQ Almost Acoustic Christmas\n|}\nUK & Ireland Arena Tour\nAhead of the Snow Patrol's UK & Ireland Arena Tour, the band played a one-off intimate show at the Apple Store on Regent Street in London on Friday 13 February. The performance was released as a live EP called iTunes Live from London on the iTunes Store a week later.\nSnow Patrol kicked off their UK & Ireland Arena Tour on 22 February 2009 at the Bournemouth International Centre in Bournemouth. The tour lasted one month and featured a number of support acts. The band's website reported that the band had hand-picked their favorite new artists to support them on the tour. Longtime friend of the band Miriam Kaufmann toured with the band and sang lead female vocals on \"Set the Fire to the Third Bar\", which originally featured Martha Wainwright. On 9 March, Gary Lightbody & Nathan Connolly appeared as guests in Iain Archer's set at the Ulster Hall, Belfast, which was hosting \"Do You Remember the First Time?\" a one-off event by BBC Across The Line. Lightbody wrote a blog about the other artists that appeared at the event later. The last show of the tour had the band's friends & family and the Northern Irish Football squad in the 9,000 strong audience. The band played to an estimated 200,000 fans on the tour, which is their biggest to date.\nThe tour constantly featured the sixteen-minute-long \"The Lightning Strike\" as an encore. For the performance, a high definition sixteen-minute animation was played on a 60×40&nbsp;ft projection screen as the band performed the song. The animation featured origami in the style that appears on the album artwork for A Hundred Million Suns. The film was created by Undabo Studios and Atticus Finch and took three months to make.\n;Typical set list\n# \"If There's a Rocket Tie Me to It\"\n# \"Chocolate\"\n# \"Hands Open\"\n# \"Spitting Games\"\n# \"How to Be Dead\"\n# \"The Golden Floor\"\n# \"You Could Be Happy\"\n# \"Run\"\n# \"Make this Go on Forever\"\n# \"Shut Your Eyes\"\n# \"Chasing Cars\"\n# \"Set the Fire to the Third Bar\"\n# \"Crack the Shutters\"\n# \"Take Back the City\"\n# \"Open Your Eyes\"\n;Encore:\n;Tour dates\n{| class=\"wikitable\" style=\"text-align:center;\"\n|-\n! style=\"width:200px;\"| Date\n! style=\"width:200px;\"| City\n! style=\"width:150px;\"| Country\n! style=\"width:300px;\"| Venue\n! style=\"width:100px;\"| Support act(s)\n|-\n|22 February 2009\n|Bournemouth\n|England\n|Bournemouth International Centre\n|Fanfarlo\n|-\n|24 February 2009\n|rowspan=\"2\"|Glasgow\n|rowspan=\"3\"|Scotland\n|rowspan=\"2\"|Scottish Exhibition and Conference Centre\n|White Lies & The Ads\n|-\n|25 February 2009\n|Fanfarlo & The Hazey Janes\n|-\n|26 February 2009\n|Aberdeen\n|Aberdeen Exhibition and Conference Centre\n|Fanfarlo & The Ads\n|-\n|28 February 2009\n|rowspan=\"2\"|Dublin\n|rowspan=\"2\"|Ireland\n|rowspan=\"2\"|The O2\n|White Lies & Iain Archer\n|-\n|1 March 2009\n|White Lies & Concerto For Constantine\n|-\n|4 March 2009\n|Sheffield\n|rowspan=\"3\"|England\n|Sheffield Arena\n|Fanfarlo & Lowly Knights\n|-\n|6 March 2009\n|Liverpool\n|Echo Arena Liverpool\n|White Lies & Lowly Knights\n|-\n|7 March 2009\n|Manchester\n|Manchester Evening News Arena\n|White Lies & Cashier No. 9\n|-\n|8 March 2009\n|Cardiff\n|Wales\n|Cardiff International Arena\n|White Lies & Cashier No. 9\n|-\n|10 March 2009\n|Newcastle upon Tyne\n|rowspan=\"6\"|England\n|Metro Radio Arena\n|Annie & Fanfarlo\n|-\n|11 March 2009\n|Birmingham\n|LG Arena\n|Animal Kingdom & Fanfarlo\n|-\n|12 March 2009\n|Nottingham\n|Trent FM Arena\n|Annie & Fanfarlo\n|-\n|14 March 2009\n|rowspan=\"3\"|London\n|rowspan=\"3\"|The O2\n|Animal Kingdom & Fanfarlo\n|-\n|15 March 2009\n|White Lies & Concerto for Constantine\n|-\n|16 March 2009\n|Fanfarlo & Animal Kingdom\n|-\n|19 March 2009\n|rowspan=\"4\"|Belfast\n|rowspan=\"4\"|Northern Ireland\n|rowspan=\"4\"|Odyssey Arena\n|Iain Archer & Lowly Knights\n|-\n|20 March 2009\n|Cashier No. 9 & Burning Codes\n|-\n|21 March 2009\n|General Fiasco & Ed Zealous\n|-\n|23 March 2009\n|Duke Special & Iain Archer\n|}\nEuropean Tour\nSnow Patrol kicked off the European leg of the tour on 18 June. This leg of the tour saw the band visit Sweden, Germany, Austria, Denmark, Switzerland & France. Various artists supported the band throughout the tour. It was later announced that the show in Hamburg was cancelled due to \"personal reasons\". The show was rescheduled to 29 July, which was a part of the Open R Festival. The show at Stuttgart's Porsche Arena was shifted to a new venue. \"The Lightning Strike\" made an appearance again in the German and Austrian shows, though it was not played in Sweden.\nTypical set list\n# \"If There's a Rocket Tie Me to It\"\n# \"Chocolate\"\n# \"Hands Open\"\n# \"How to Be Dead\"\n# \"The Golden Floor\"\n# \"You Could Be Happy\"\n# \"An Olive Grove Facing the Sea\"\n# \"Run\"\n# \"Somewhere a Clock is Ticking\"\n# \"Make this Go on Forever\"\n# \"Shut Your Eyes\"\n# \"Chasing Cars\"\n# \"Crack the Shutters\"\n# \"Take Back the City\"\n# \"Open Your Eyes\"\n;Encore:\n;Tour dates\n{| class=\"wikitable\" style=\"text-align:center;\"\n|-\n! style=\"width:200px;\"| Date\n! style=\"width:200px;\"| City\n! style=\"width:150px;\"| Country\n! style=\"width:300px;\"| Venue\n!Support act(s)\n|-\n|18 May 2009\n|Stockholm\n|Sweden\n|Cirkus\n|Two White Horses & Sweethead\n|-\n|19 May 2009\n|Copenhagen\n|Denmark\n|Vega\n|Sweethead & Late Parade\n|-\n|21 May 2009\n|Hamburg\n|Germany\n|Alsterdorfer Sporthalle (CANCELLED)\n|Sometree & Sweethead\n|-\n|22 May 2009\n|Frankfurt\n|rowspan=\"3\"|Germany\n|Jahrhunderthalle\n|Sometree & Sweethead\n|-\n|23 May 2009\n|Berlin\n|Columbiahalle\n|Sometree & Sweethead\n|-\n|24 May 2009\n|Munich\n|Zenith\n|Sometree & Sweethead\n|-\n|26 May 2009\n|Vienna\n|Austria\n|Gasometer\n|Curbs & Sweethead\n|-\n|28 May 2009\n|Winterthur\n|Switzerland\n|Eishalle Deutweg\n|The Boxer Rebellion & Sweethead\n|-\n|30 May 2009\n|Düsseldorf\n|rowspan=\"2\"|Germany\n|Philipshalle\n|Sometree & Sweethead\n|-\n|31 May 2009\n|Stuttgart\n|LKA-Longhorn\n|Sometree & Sweethead\n|-\n|2 June 2009\n|Paris\n|France\n|Élysée Montmartre\n|Joseph D'Anvers & Sweethead\n|}\nNorth American tour\nSnow Patrol returned to the United States and Canada in September–October to play a full-length tour. The shows coincided with shows that saw Snow Patrol support U2 at the 360° Tour. The tour commenced 10 September and finished 20 October and spanned 22 dates across various locations. Following the positive response following the shows at Nashville (during supporting Coldplay on the Viva la Vida Tour), the tour also saw the band return to the city for a headlining show. American rock band Plain White T's supported the band on all dates. The band also appeared on the Late Show with David Letterman on 24 September 2009 to perform during the tour. In Portland, Lightbody took a walk in the city and visited Powell's Books, which he described as \"his favorite bookshop in the world\". He picked up a couple of copies of his favorite book, Grab Onto Me Tightly as if I Knew the Way by Bryan Charles, among others for friends Lightbody later wrote a blog for the official website describing his Portland experience, and also revealed plans of side-projects Listen... Tanks! and Tired Pony.\n;Typical set list\n# \"If There's a Rocket Tie Me to It\"\n# \"Chocolate\"\n# \"Hands Open\"\n# \"How to Be Dead\"\n# \"The Golden Floor\"\n# \"The Finish Line\"\n# \"Make this Go on Forever\"\n# \"Run\"\n# \"Shut Your Eyes\"\n# \"Chasing Cars\"\n# \"Crack the Shutters\"\n# \"Take Back the City\"\n# \"Open Your Eyes\"\n;Encore:\n;Tour dates\n{| class=\"wikitable\" style=\"text-align:center;\"\n|-\n! style=\"width:200px;\"| Date\n! style=\"width:200px;\"| City\n! style=\"width:150px;\"| Country\n! style=\"width:300px;\"| Venue\n|-\n! colspan=\"4\"| Supporting act: Plain White T's\n|-\n|10 September 2009\n|Saint Paul\n|rowspan=\"2\"|United States\n|State Theatre †\n|-\n|14 September 2009\n|Detroit\n|The Fillmore Detroit\n|-\n|18 September 2009\n|Montreal\n|Canada\n|Métropolis\n|-\n|22 September 2009\n|rowspan=\"2\"|New York City\n|rowspan=\"21\"|United States\n|rowspan=\"2\"|Beacon Theatre\n|-\n|23 September 2009\n|-\n|25 September 2009\n|Washington, D.C.\n|DAR Constitution Hall\n|-\n|26 September 2009\n|Upper Darby Township\n|Tower Theatre\n|-\n|27 September 2009\n|Columbus\n|LC Pavilion\n|-\n|29 September 2009\n|Kansas City\n|Uptown Theater\n|-\n|30 September 2009\n|Indianapolis\n|Egyptian Room @ Muret Center\n|-\n|2 October 2009\n|Nashville\n|Ryman Auditorium\n|-\n|3 October 2009\n|Atlanta\n|The Tabernacle\n|-\n|5 October 2009\n|Houston\n|Warehouse Live Studio\n|-\n|6 October 2009\n|Austin\n|Stubb's B-B-Q\n|-\n|7 October 2009\n|Dallas\n|Palladium Ballroom\n|-\n|9 October 2009\n|Denver\n|Fillmore Auditorium\n|-\n|10 October 2009\n|Orem\n|McKay Events Center\n|-\n|11 October 2009\n|Boise\n|Knitting Factory\n|-\n|13 October 2009\n|Portland\n|Arlene Schnitzer Concert Hall\n|-\n|14 October 2009\n|Seattle\n|Paramount Theatre\n|-\n|16 October 2009\n|Oakland\n|Fox Oakland Theatre\n|-\n|17 October 2009\n|San Diego\n|San Diego State University's Open Air Theatre\n|-\n|19 October 2009\n|rowspan=\"2\"|Los Angeles\n|The Music Box @ Henry Fonda Theatre ¶\n|-\n|20 October 2009\n|The Wiltern LG\n|}\n;Notes\n* † Concert was initially held at the Myth Nightclub, but the venue was changed as the club closed down.\n* ¶ Concert was initially held at The Wiltern LG, but was moved to the Henry Fonda Theatre.\n;Sideshows\nSnow Patrol played a few side-shows for various radio stations on the North American leg of the tour. These included an acoustic set for Cities 97, on the first day of the tour before the show at the State Theater. The band was next showcased on WRNR-FM, and Lightbody and Connolly played an acoustic set as a part of 'Rams Head on Stage'. The same day, they played a three-song acoustic in-studio performance for WRFF. The band later played a set at the Houndstooth Pub, which they partly own, for the radio station WRXP. In Atlanta, the band played an acoustic intimate show for Dave FM. In October 2009, Lightbody played an acoustic set for KINK FM. In Seattle, Lightbody again did a set for KMTT, performing obscure songs like \"Reading Heaney to Me\" and \"Fifteen Minutes Old\". In Oakland, they played an acoustic promo set for KFOG. In Toronto, they did a set at Studio Q for CBC.\n;Tour dates\n{| class=\"wikitable\" style=\"text-align:center;\"\n|-\n! style=\"width:200px;\"| Date\n! style=\"width:200px;\"| City\n! style=\"width:150px;\"| Country\n! style=\"width:300px;\"| Venue\n! style=\"width:100px;\"| Radio station\n|-\n|10 September 2009\n|Saint Paul\n|rowspan=\"8\"|United States\n|Studio C\n|Cities 97\n|-\n|23 September 2009\n|New York City\n|Houndstooth Pub\n|WRXP\n|-\n|26 September 2009\n|Philadelphia\n|104.5 Performance Studio\n|WRFF\n|-\n|26 September 2009\n|Annapolis\n|Rams Head on Stage @ Rams Head Tavern\n|WRNR-FM\n|-\n|3 October 2009\n|Atlanta\n|Circle of Friends @ The Vinyl\n|Dave FM\n|-\n|13 October 2009\n|Portland\n|KINK Live Performance Lounge\n|KINK FM\n|-\n|14 October 2009\n|Seattle\n|Carter Subaru Mountain Music Lounge\n|KMTT\n|-\n|16 October 2009\n|Oakland\n|KFOG PlaySpace\n|KFOG\n|-\n|19 October 2009\n|Toronto\n|Canada\n|Studio Q\n|CBC\n|}\nReworked Tour\non 24 November 2009.]]Snow Patrol played a special tour at the end of 2009, dubbed the \"Reworked Tour\". Drummer Jonny Quinn had initially revealed plans for such a tour in an interview before. Members on the Snow Patrol mailing list initially received an e-mail revealing details of the tour, which said that the band will be playing re-worked versions of songs spanning their whole career, as well as songs from The Reindeer Section. Lightbody has credited the idea of the tour from Jo Whiley's Little Noise Sessions (Snow Patrol did one in 2007) saying there's a \"never before heard them\" vibe to it. The band used strings, brass sections, and choirs to rework their songs. Nathan Connolly warned fans to not expect to hear the hits as they were. The band visited a south London studio to rehearse the reworked songs, where they experimented with styles as country, motown and heavy metal. The band said that the reworking of the songs is not because they're inferior. They hoped that trying something new may bring them more credibility, and made it clear it was not something to \"look cool\". They also felt that they had done plenty of \"typical\" concerts, and wanted to put in more effort to give the fans more value for their money.\nThe tour began in mid-November and continued till early December. Snow Patrol played without any support act, so as to play the maximum number of songs possible. They took the stage twice, the whole show being divided in two-halves with an interval in between. The first half spanned about 40&nbsp;minutes and featured softer, older material. The \"louder\" songs began from about halfway in the second half. The band was accompanied by guests on-stage. Though 18–20 musicians were initially reported, 11 accompanied the band for various songs in each half. These musical guests included former songwriting-collaborator Iain Archer. Archer played a variety of instruments, such as the lap steel guitar, banjo and the twelve-string guitar. Other guests included members of Belle & Sebastian, Teenage Fanclub and Idlewild, harpist Jennifer Crook (on vocals and harp) and longtime friend Johnny McDaid.\nAt the Royal Albert Hall concert on 24 November, Snow Patrol brought in actor James Corden to sing the female vocal parts on \"Set the Fire to the Third Bar\". Lightbody had previously been impressed by the actor's vocal ability, seeing him singing at a Concert for CARE charity show. At the after-party of the Children in Need concert, a drunk Lightbody asked him if he would be interested to sing with the band on-stage. Corden initially thought Lightbody would not remember, and agreed to the invitation. Lightbody, in his blog on the official website wrote that he was very nervous on stage at the first concert in Brighton. He said that he was feeling so for much longer than the time, when the band had started playing their earliest gigs. The band arranged \"Chocolate\" and \"Chasing Cars\" as Nashville ballads. Lightbody was delighted with the new arrangement for the latter, and revealed that \"Set the Fire to the Third Bar\" was set to go through many arrangements during the tour. The band tried to vary the set lists for each show, definitely so where they played multiple nights.\n;Tour dates\n{| class=\"wikitable\" style=\"text-align:center;\"\n|-\n! style=\"width:200px;\"| Date\n! style=\"width:200px;\"| City\n! style=\"width:150px;\"| Country\n! style=\"width:300px;\"| Venue\n|-\n|18 November 2009\n|Brighton\n|rowspan=\"8\"|England\n|The Brighton Centre\n|-\n|20 November 2009\n|Bristol\n|Colston Hall\n|-\n|21 November 2009\n|Newcastle upon Tyne\n|Newcastle City Hall\n|-\n|23 November 2009\n|rowspan=\"3\"|London\n|rowspan=\"3\"|Royal Albert Hall\n|-\n|24 November 2009\n|-\n|25 November 2009\n|-\n|27 November 2009\n|rowspan=\"2\"|Manchester\n|rowspan=\"2\"|Palace Theatre\n|-\n|29 November 2009\n|-\n|30 November 2009\n|Glasgow\n|Scotland\n|Clyde Auditorium\n|-\n|2 December 2009\n|rowspan=\"2\"|Dublin\n|rowspan=\"4\"|Ireland\n|rowspan=\"2\"|Olympia Theatre\n|-\n|3 December 2009\n|-\n|4 December 2009\n|Killarney\n|INEC\n|-\n|6 December 2009\n|Castlebar\n|Theatre Royal\n|-\n|7 December 2009\n|rowspan=\"3\"|Belfast\n|rowspan=\"3\"|Northern Ireland\n|rowspan=\"3\"|Waterfront Hall\n|-\n|8 December 2009\n|-\n|9 December 2009\n|}\nFestivals\nThe band headed to South Africa after their Australian Promo Tour to headline the Coca-Cola Zero Festival. The band played two shows, and then returned to Europe to kick start the European leg of the tour. Apart from playing at the festival, the band also appeared at the IPL opening ceremony to play a short set. Snow Patrol headlined BBC Radio 1's Big Weekend at Lydiard Park, Swindon on 9 May and 10. Gary Lightbody and Nathan Connolly personally joined Chris Moyles on his radio show to announce details of the event. The band was the main headlining act on the 9th. In June, Snow Patrol headlined the Pinkpop Festival, among others. The band played their set on the main stage on the last day, after which they joined Coldplay as a support act on their Viva la Vida Tour. The band further played at the Donauinselfest in the end of June.\nSnow Patrol was one of the acts at the iTunes Festival, which was held throughout July. The band played on 5 July and was the co-headlining act for the day. The performance was released as a digital EP on the iTunes Store as ''iTunes Live: London Festival '09''. The band later co-headlined Oxegen 2009 in July along with newly re-formed Blur. The band joined Blur again to co-headline the T in the Park, just two days after the Oxegen Festival. The band returned to Germany to headline the Sonnenrot Festival. The show, though had to be cancelled due to torrential rains. The band followed with Rockhal, T-Mobile Street Gig, Stimmen Festival and Open R Festival. In August, the band will play at the Sziget Festival, and the Pukkelpop Festival. After the band's concert at the Street Gig in Dettenheim, lead singer Gary Lightbody broke a rib in a go-karting accident. Lightbody was livid with himself: \"I had my very best idiot trousers on in Germany at the Street gig and we did a go-kart track in Dettenheim. I did say beforehand that I shouldn't go on them as firstly I shouldn't be in charge of anything that can go over 20&nbsp;miles an hour and secondly I am the most accident-prone idiot in the western world. Did I heed my own advice? Did I fuck! So on I went and crash after crash later; finishing on a particularly nasty one that put took me to hospital where I discovered I have a broken rib. Sweet.\" He made a full recovery and resumed touring in a few days. Months later, in October 2009, Lightbody revealed the \"truth\" behind his crash, admitting that he cannot drive. He went on the explain the exact details of what had happened: \"At the very last corner, I skidded to miss Jonny (Quinn) and I smashed into the side of the wall and actually came out of the go-kart. It was hilarious - for everyone who was watching. Everyone thought it was just me being me, 'Ah...leave him, he's fine.' But, an hour later, I was in hospital. It was good actually having a real injury rather than all the ones I make up in my head.\" He also admitted his bandmates did not believe he was actually hurt, as he was a \"drama queen\".\nThe band was initially booked as a support act to Oasis at the UK V Festival, playing the \"Weston Saturday/Hylands Sunday\" stage, However, Oasis frontman Liam Gallagher became ill with viral laryngitis, and Oasis pulled out. Snow Patrol then filled in the headlining spot and played an extended set. The band's set was available to listen live and uninterrupted through Absolute Radio's LiveAmp application for the iPhone. In November 2009, they played at the Avo Session Basel. Sandi Thom and Emilíana Torrini supported them at the concert.\n;Tour Dates\n{| class=\"wikitable\" style=\"text-align:center;\"\n|-\n! style=\"width:200px;\"| Date\n! style=\"width:200px;\"| City\n! style=\"width:150px;\"| Country\n! style=\"width:300px;\"| Venue\n|-\n|10 April 2009\n|Johannesburg\n|rowspan=\"2\"|South Africa\n|Coca-Cola Zero Festival @ Riversands Farm\n|-\n|13 April 2009\n|Cape Town\n|Coca-Cola Zero Festival @ Lourensford Wine Estate\n|-\n|9 May 2009\n|Swindon\n|England\n|Radio 1 Big Weekend @ Lydiard Park\n|-\n|15 May 2009\n|Stockholm\n|Sweden\n|RIX FM @ Kungsträdgården\n|-\n|1 June 2009\n|Landgraaf\n|Netherlands\n|Pinkpop Festival @ Megaland Park\n|-\n|27 June 2009\n|Vienna\n|Austria\n|Donauinselfest @ Donauinsel\n|-\n|5 July 2009\n|London\n|England\n|iTunes Festival @ The Roundhouse\n|-\n|10 July 2009\n|Naas\n|Ireland\n|Oxegen Festival @ Punchestown Racecourse\n|-\n|12 July 2009\n|Kinross\n|Scotland\n|T in the Park @ Balado Airfield\n|-\n|17 July 2009\n|Eching\n|Germany\n|Sonnenrot Festival @ Landkreis Freising (CANCELLED)\n|-\n|25 July 2009\n|Esch-sur-Alzette\n|Luxembourg\n|The Rockhal\n|-\n|26 July 2009\n|Lörrach\n|rowspan=\"3\"|Germany\n|Stimmen Festival\n|-\n|28 July 2009\n|Dettenheim\n|T-Mobile Street Gig @ Kartbahn Liedolsheim\n|-\n|29 July 2009\n|Hamburg\n|Open R Festival @ Stadtpark Freilichtbühne\n|-\n|12 August 2009\n|Budapest\n|Hungary\n|Sziget Festival @ Óbudai Island\n|-\n|21 August 2009\n|Kiewit-Hasselt\n|Belgium\n|Pukkelpop\n|-\n|22 August 2009\n|South Staffordshire\n|rowspan=\"2\"|England\n|UK V Festival @ Weston Park\n|-\n|23 August 2009\n|Chelmsford\n|UK V Festival @ Hylands Park\n|-\n|14 November 2009\n|Basel\n|Switzerland\n|Avo Session Basel @ Festival Hall (of Basel Fair)\n|}\nAs a support act\nSupporting Coldplay\nColdplay asked Snow Patrol to open for them on the Viva la Vida Tour. They accepted, and supported the band on the June leg of the North American arena tour, which started in Indianapolis on 5 June 2009. Snow Patrol was a support act for a total of eleven dates. The band were well received, and even had a few-singalongs, Lightbody noted.\n;Typical set list\n# \"If There's a Rocket Tie Me to It\"\n# \"Chocolate\"\n# \"Hands Open\"\n# \"Run\"\n# \"Shut Your Eyes\"\n# \"Chasing Cars\"\n# \"Crack the Shutters\"\n# \"Open Your Eyes\"\n# \"You're All I Have\"\n;Tour dates\n{| class=\"wikitable\" style=\"text-align:center;\"\n|-\n! style=\"width:200px;\"| Date\n! style=\"width:200px;\"| City\n! style=\"width:150px;\"| Country\n! style=\"width:300px;\"| Venue\n|-\n|5 June 2009\n|Noblesville\n|rowspan=\"6\"|United States\n| style=\"text-align:center;\"|Verizon Wireless Music Center\n|-\n|6 June 2009\n|Nashville\n|Sommet Center\n|-\n|9 June 2009\n|New Orleans\n|New Orleans Arena\n|-\n|10 June 2009\n|San Antonio\n|AT&T Center\n|-\n|12 June 2009\n|Des Moines\n|Wells Fargo Arena\n|-\n|13 June 2009\n|Omaha\n|Qwest Center\n|-\n|15 June 2009\n|Winnipeg\n|rowspan=\"5\"|Canada\n|MTS Centre\n|-\n|17 June 2009\n|Calgary\n|Pengrowth Saddledome\n|-\n|18 June 2009\n| Edmonton\n|Rexall Place\n|-\n|20 June 2009\n|rowspan=\"2\"|Vancouver\n|rowspan=\"2\"|General Motors Place\n|-\n|21 June 2009\n|}\n;Side shows\nSnow Patrol played an intimate acoustic set and held a signing session at Grimey's Record Store, Nashville, ahead of their appearance at the Sommet Center, supporting Coldplay. They did another in-store when the tour reached Omaha.\n;Tour dates\n{| class=\"wikitable\" style=\"text-align:center;\"\n|-\n! style=\"width:200px;\"| Date\n! style=\"width:200px;\"| City\n! style=\"width:150px;\"| Country\n! style=\"width:300px;\"| Venue\n|-\n|6 June 2009\n|Nashville\n|rowspan=\"2\"|United States\n|Grimey's Record Store\n|-\n|13 June 2009\n|Omaha\n|Homer's Music and Gifts\n|}\nSupporting U2\nSnow Patrol supported U2 over two legs on a handful of shows on their European and North American legs of the 360° Tour. The second leg of shows from 12 September coincided with Snow Patrol's own headlining North American Tour. During the first leg of supporting shows, the band played a concert in Poland. Lightbody was overwhelmed by the show U2 put up, and broke down crying, only to find everyone else around him was doing the same. He later wrote a piece for U2's official website, describing his experience of the show, saying that it was one of the best nights of his life and the best reception they had gotten on the support shows.\n;Typical set list\n# \"Take Back the City\"\n# \"Crack the Shutters\"\n# \"Open Your Eyes\"\n# \"Run\"\n# \"Spitting Games\"\n# \"Chocolate\"\n# \"Chasing Cars\"\n# \"Hands Open\"\n# \"You're All I Have\"\n;Tour dates\n{| class=\"wikitable\" style=\"text-align:center;\"\n|-\n! style=\"width:200px;\"| Date\n! style=\"width:200px;\"| City\n! style=\"width:150px;\"| Country\n! style=\"width:300px;\"| Venue\n|-\n! colspan=\"4\"| Leg I (Europe)\n|-\n|30 June 2009\n|rowspan=\"2\"|Barcelona\n|rowspan=\"2\"|Spain\n|rowspan=\"2\"|Camp Nou\n|-\n|2 July 2009\n|-\n|7 July 2009\n|rowspan=\"2\"|Milan\n|rowspan=\"2\"|Italy\n|rowspan=\"2\"|San Siro\n|-\n|8 July 2009\n|-\n|15 July 2009\n|Nice\n|France\n|Parc des Sports Charles Ehrmann\n|-\n|18 July 2009\n|Berlin\n|Germany\n|Olympic Stadium\n|-\n|20 July 2009\n|rowspan=\"2\"|Amsterdam\n|rowspan=\"2\"|Netherlands\n|rowspan=\"2\"|Amsterdam Arena\n|-\n|21 July 2009\n|-\n|31 July 2009\n|rowspan=\"2\"|Gothenburg\n|rowspan=\"2\"|Sweden\n|rowspan=\"2\"|Ullevi Stadium\n|-\n|1 August 2009\n|-\n|3 August 2009\n|Gelsenkirchen\n|Germany\n|Arena Auf Schalke\n|-\n|6 August 2009\n|Chorzów\n|Poland\n|Stadion Śląski\n|-\n|9 August 2009\n|rowspan=\"2\"|Zagreb\n|Croatia\n|rowspan=\"2\"|Stadion Maksimir\n|-\n|10 August 2009\n|-\n! colspan=\"4\"| Leg II (North America)\n|-\n|12 September 2009\n|rowspan=\"2\"|Chicago\n|rowspan=\"2\"|United States\n|rowspan=\"2\"|Soldier Field\n|-\n|13 September 2009\n|-\n|16 September 2009\n|rowspan=\"2\"|Toronto\n|rowspan=\"2\"|Canada\n|rowspan=\"2\"|Rogers Centre\n|-\n|17 September 2009\n|-\n|20 September 2009\n|rowspan=\"2\"|Foxborough\n|rowspan=\"2\"|United States\n|rowspan=\"2\"|Gillette Stadium\n|-\n|21 September 2009\n|-\n! colspan=\"4\"| Leg III (Europe)\n|-\n|15 August\n|rowspan=\"2\"|Horsens\n|rowspan=\"2\"|Denmark\n|rowspan=\"2\"|CASA Arena Horsens\n|-\n|16 August\n|-\n|25 August\n|Moscow\n|Russia\n|Luzhniki Stadium\n|-\n|3 September\n|Athens\n|Greece\n|Athens Olympic Stadium\n|-\n|6 September\n|Istanbul\n|Turkey\n|Atatürk Olympic Stadium\n|-\n! colspan=\"4\"| Leg VI (North America)\n|-\n|11 May\n|rowspan=\"3\"|Mexico City\n|rowspan=\"3\"|Mexico\n|rowspan=\"3\"|Estadio Azteca\n|-\n|14 May\n|-\n|15 May\n|}\n;Side shows\nTo promote the release of \"If There's a Rocket Tie Me to It\" in the Netherlands, Snow Patrol played an intimate show at Desmet Studios after supporting U2 on the second night at the Amsterdam ArenA. The show was a part of BNN's That's Live. The concert was broadcast on 5 November 2009 at 23:35 on a program called \"BNN presents Snow Patrol\". The broadcast will also be available on thatslive.bnn.nl. When the U2 tour reached Chicago, the band played a set at the Abbey Pub (Studio X) for WXRT-FM.\n;Tour dates\n{| class=\"wikitable\" style=\"text-align:center;\"\n|-\n! style=\"width:200px;\"| Date\n! style=\"width:200px;\"| City\n! style=\"width:150px;\"| Country\n! style=\"width:300px;\"| Venue\n|-\n|21 July 2009\n|Amsterdam\n|Netherlands\n|Radio BNN: That's Live @ DeSmet Studios\n|-\n|12 September 2009\n|Chicago\n|United States\n|Abbey Pub (Studio X) for WXRT-FM\n|}\nFestivals\nA mere 5 days after the UK & Ireland Arena Tour ended in March 2009, the band headed to Australia to play on the second stage of the V Festival, headed by The Killers. In July 2009, Snow Patrol played at the Open Air Gampel Festival, supporting headliner Lily Allen.\n;Tour dates\n{| class=\"wikitable\" style=\"text-align:center;\"\n|-\n! style=\"width:200px;\"| Date\n! style=\"width:200px;\"| City\n! style=\"width:150px;\"| Country\n! style=\"width:300px;\"| Venue\n|-\n|28 March 2009\n|Sydney\n|rowspan=\"4\"|Australia\n|Australian V Festival @ Centennial Park\n|-\n|29 March 2009\n|Gold Coast\n|Australian V Festival @ Avica Resort\n|-\n|4 April 2009\n|Melbourne\n|Australian V Festival @ Royal Melbourne Showgrounds\n|-\n|5 April 2009\n|Perth\n|Australian V Festival @ Claremont Showground\n|-\n|14 August 2009\n|Gampel\n|Switzerland\n|Open Air Gampel Festival\n|}\n;Side shows\nDuring the V festival in March 2009, Snow Patrol played an additional 3 sideshows. Ex-Rilo Kiley frontwoman Jenny Lewis supported them on these shows.\n;Tour dates\n{| class=\"wikitable\" style=\"text-align:center;\"\n|-\n! style=\"width:200px;\"| Date\n! style=\"width:200px;\"| City\n! style=\"width:150px;\"| Country\n! style=\"width:300px;\"| Venue\n|-\n! colspan=\"4\"| Supporting act: Jenny Lewis\n|-\n|30 March 2009\n|Sydney\n|rowspan=\"3\"|Australia\n|Hordern Pavilion\n|-\n|1 April 2009\n|Adelaide\n|Adelaide Entertainment Centre\n|-\n|2 April 2009\n|Melbourne\n|Palais Theatre\n|}\nOne-off shows\nAs promotion for the then unreleased album, in September 2008, Snow Patrol played an intimate acoustic set, a part of Live Lounge Tour 2008. Host Jo Whiley joined the band in their London residence to cover the session. Just before heading to Australia in November 2008 to do a short promo tour, Snow Patrol visited Berlin (where a part of the album was recorded) to play an exclusive one-off show. The band also played a Live Lounge performance at BBC's Maida Vale Studios during the studio's 75-year celebrations on BBC presenter Fearne Cotton's show. The band's set included cover versions of most famous songs that were recorded in the studio over the years: \"Teenage Kicks\", \"New Sensation\", \"Ray of Light\" and \"You Really Got Me\". Three of those were recorded and later broadcast on Greg James' show on BBC Radio 1. Lightbody felt \"honoured\" to be playing at the studio, which has seen performances from artists like David Bowie, Jimi Hendrix and The Beatles in the past. For the promotion of Up to Now (2009), the band played an intimate, acoustic show in Crouch End, London. On 3 December, Lightbody played at HMV Dundrum before signing copies of Up to Now with the band (with the exception of Connolly, who was ill). The band also played a set with full orchestra for Irish TV series Other Voices 8. Lightbody has announced that the band will return to play their mini-festival at Ward Park in 2010. It will be the first time the band returns to their hometown since the last Ward park concert in 2007.\n;Tour dates\n{| class=\"wikitable\" style=\"text-align:center;\"\n|-\n! style=\"width:200px;\"| Date\n! style=\"width:200px;\"| City\n! style=\"width:150px;\"| Country\n! style=\"width:300px;\"| Venue\n|-\n|23 September 2008\n|London\n|England\n|Live Lounge Tour @ Snow Patrol's London residence\n|-\n|10 November 2008\n|Berlin\n|Germany\n|Schiller Theater\n|-\n|30 October 2009\n|Maida Vale\n|rowspan=\"3\"|England\n|Maida Vale Studios\n|-\n|4 November 2009\n|Crouch End\n|King's Head\n|-\n|16 November 2009\n|London\n|The Sun's Studios\n|-\n|3 December 2009\n|Dundrum\n|rowspan=\"2\"|Ireland\n|HMV Store @ Dundrum Town Centre\n|-\n|5 December 2009\n|Dingle\n|Other Voices 8 @ St. James' Church\n|-\n|21 May 2010\n|Berlin\n|Germany\n|Tempodrom\n|-\n|22 May 2010\n|Copenhagen\n|Denmark\n|KB Halle\n|-\n|24 May 2010\n|Brussels\n|Belgium\n|Forest National\n|-\n|27 May 2010\n|Lisbon\n|Portugal\n|Rock In Rio\n|-\n|30 May 2010\n|Paris\n|France\n|Olympia\n|-\n|31 May 2010\n|rowspan=\"2\"|Amsterdam\n|rowspan=\"2\"|Netherlands\n|rowspan=\"2\"|Heineken Music Hall\n|-\n|1 June 2010\n|-\n|5 June 2010\n|Bangor\n|Northern Ireland\n|Ward Park\n|-\n|12 June 2010\n|Glasgow\n|Scotland\n|Bellahouston Park\n|}\nCharity events\nSnow Patrol played at the Music Industry Trusts' Award 2008, held to honor Lucian Grainge, CEO of Universal Music Group. They opened the show by playing \"Chasing Cars\", standing in for singer Duffy, who was struggling with throat problems. All proceeds from the event, a record breaking sum of £568,593 went to two charities: the Nordoff-Robbins Music Therapy and the BRIT School. In October 2009, Snow Patrol played at a headlining set at the second annual fundraiser for ONEXONE, a charitable organization committed to fighting health issues and preserving the lives of children globally. The band played at Children in Need, a BBC charity concert, organized by Take That singer Gary Barlow in November 2009. Following the event's tradition of every artist duet-ting with another, Barlow had asked the band if they were interested in duet-ting with British singer Cheryl Cole. Quinn later said that it was not something the band would normally do, but agreed to, because it was for charity. Cole rehearsed with the band one night before the show and sang Martha Wainwright's vocal parts on \"Set the Fire to the Third Bar\". Additionally, the band played \"Chasing Cars\" backed by the Royal Philharmonic Orchestra. In December 2009, the band will play at the fourth edition of Versus Cancer, an annual one-off concert to raise funds for the treatment of cancer. Snow Patrol will again collaborate with the BBC Philharmonic Orchestra on 12 December, with proceeds going towards local cancer charities. Lightbody expressed his happiness on being involved: \"Versus Cancer is a fantastic charity and we're delighted to be involved.\" The concert will be organized by Andy Rourke, past member of The Smiths.\n{| class=\"wikitable\" style=\"text-align:center;\"\n|-\n! style=\"width:200px;\"| Date\n! style=\"width:200px;\"| City\n! style=\"width:150px;\"| Country\n! style=\"width:300px;\"| Venue\n|-\n|3 November 2008\n|London\n|England\n|Grosvenor House Hotel\n|-\n|22 October 2009\n|San Francisco\n|United States\n|Bimbo's 365 Club\n|-\n|12 November 2009\n|London\n|rowspan=\"2\"|England\n|Royal Albert Hall\n|-\n|12 December 2009\n|Manchester\n|MEN Arena\n|}\nAwards\nLighting & visuals director Davy Sherwin has won one award for his work on the tour.\n{| class=\"wikitable\"\n|-\n! Year\n! Award\n! Category\n! Result\n|-\n| style=\"text-align:center;\"|2009\n|Knights of Illumination Award\n|Rock – Arena\n|\n|}\nBox office score\n{| class=\"wikitable\"\n|-\n!Date(s)\n!Venue\n!City\n!Tickets sold/Available\n!Gross revenue\n|-\n|14–16 March 2009\n|The O2 Arena\n|London, England\n|54,554/56,973 (95.75%)\n|$2,216,574\n|-\n|19–23 March 2009\n|Odyssey Arena\n|Belfast, Northern Ireland\n|39,341/39,341 (100%)\n|$1,735,188\n|}\nReferences\nExternal links\n* [http://www.snowpatrol.com Snow Patrol official website]\n* [http://www.snowpatrol.com/photos Tour photos of Snow Patrol]\n* [https://web.archive.org/web/20090401224809/http://www.bandstores.co.uk/shop/snowpatrol/index.php Buy tour merchandise]\n* [http://www.snowpatrol.com/events Upcoming tour dates]"
    }
  ]
}