{
  "content": [
    {
      "type": "text",
      "text": "# Taking On the System\n\nTaking On the System: Rules for Radical Change in a Digital Era is a book () authored by American political blogger Markos Moulitsas of Daily Kos, published in 2008 by Penguin Group.\nSummary\nTaking On the System is presented as a political primer for a new generation of progressive activists.  The book is centered on the argument that in order to bring about change in the Information Age, activists will need to learn how to bypass traditional barriers to mass communication by effectively exploiting newly emerging media such as blogs, podcasts and video hosting services like YouTube.\nMoulitsas has cited Saul Alinsky's Rules for Radicals as a direct inspiration for Taking On the System, referring to his book as \"sort of a Rules for Radicals for the digital age\":\nIt’s no secret that I have little love for the old-school street protest model of activism – not because I’m opposed to street theater, but because it’s simply not effective in today’s world. So how do you change the world in today’s world, with its fragmented media landscape, with democratizing technologies, with dramatic changes in how we interact with each other, and with a culture evolving at neck-breaking speeds? That’s what I’m trying to decipher.\nReviews\nPublishers Weekly gave Taking On the System a starred review, describing it as an \"informative and entertaining book\" that \"moves easily among the current campaign cycle, pop culture phenomena such as Stephen Colbert and the successes and failures of the progressive movement in America.\"  The review notes that the book's \"pragmatic, inclusive tone takes the edge off [Moulitsas's] sometimes didactic insistence that 'there's no reason anyone should whine or complain that they are being shut out of the system.' \"\nPublication data\n*Taking On the System: Rules for Radical Change in a Digital Era. (2008) Penguin Group, .\nRelated books\n* Crashing the Gate\nReferences"
    }
  ]
}