{
  "content": [
    {
      "type": "text",
      "text": "# Taking the Initiative Party__disambig_1\n\n| headquarters     = Unit 128, 291 Kirkdale, Sydenham, SE26 4QD\n| ideology         =\n| position         =\n| country          = London\n| split            =\n| leader1_title    = Founders\n| leader1_name     = Charles Gordon\n| colours          =  Purple\n| membership_year  =\n| membership       =\n| slogan           =\n| seats1_title     = Local government (principal authorities)\n| seats1           =\n| website          = https://www.theinitiativeparty.org.uk/\n}}\nThe Taking the Initiative Party (TTIP) is a British political party. It was formed in 2016 by Charles Gordon, and was registered with the Electoral Commission in October 2017.\nHistory\nTTIP had been formed in 2016, although it registered with the Electoral Commission one year later, with an objective of nominating thirty two candidates for the Croydon London Borough Council's 2022 election. The training courses and meetups organized by the party for people with nonpolitical backgrounds has led to the TTIP being perceived as an \"inclusive\" and antielitist party by some. Charles Gordon, a founding member of the party, said \"Our overall objective is to create a parliament that reflects the multicultural society we’ve become over the years.\"\nSasha Johnson, a leading member of the party, said that it would be \"the first black-led political party in the UK\". It was set up with the intention of focusing on education, housing, knife crime, discrimination, taxation and the benefits system. The party's mission statement says, \"We want to be a new voice on the political stage to channel local knowledge and expertise, to come up with creative solutions and to make sure that resources go where they are needed most.\"\nIn 2021, TTIP introduced a petition calling the government to launch a database in which the identity details of persons with a history of racial or homophobic offences would be stored. The intention was to allow companies, and organisations to use such a database as part of the background check when recruiting new employees. The petition, which received 10,979 signatures, was rejected by the government on 26 January 2021.\nThe Taking the Initiative Party made their electoral debut in the 2021 United Kingdom local elections, standing a small number of candidates in Enfield and Croydon, without success.\nIn February 2021 Trevor Phillips, former chair of the Equality and Human Rights Commission, called the party a \"bunch of idiots\" and criticised the group's leader, Charles Gordon, for his anti-vaccination comments.\nIn May 2021, Sasha Johnson was shot in the head and was taken to the hospital in critical condition. Five males were arrested on suspicion of her attempted murder.\nCroydon elections\nCouncil elections\nIn the 2022 United Kingdom local elections, Taking the Initiative Party put forward 20 candidates for the 28 wards in Croydon. They won no seats.\n{| class=\"wikitable\"\n|-\n! rowspan=2| Election\n! colspan=2| Votes\n! Seats\n! rowspan=2| Position\n! rowspan=2| Role in Council\n|-\n! No.\n! %\n! No.\n|-\n! 2022\n| 4,121\n| 1.8\n| }}\n|  5th\n|\n|}\nMayoral elections\nFarah London, who was an independent candidate in the 2021 London mayoral election, was their Croydon mayoral candidate for the election on 5 May 2022. She came sixth, with 6 per cent of the vote.\n{| class=\"wikitable\"\n|+\n! Year\n! Candidate\n! Popular vote\n! % of vote\n! Position\n|-\n|2022\n|Farah London\n|5,768\n|6.0%\n|6th\n|}\nReferences"
    }
  ]
}