{
  "content": [
    {
      "type": "text",
      "text": "# Taking a Line for a Second Walk\n\n}}\nTaking a Line for a Second Walk is the name of piano duo reduction of a dance work for orchestra by Michael Nyman, Basic Black, written in 1986 for the Houston Ballet.  It is eponymous with a 1994 album on Work Music on which it constitutes approximately half the material.  The album is also known as Music for Two Pianos, which is given as the album's name on the back cover and insert back, while Taking a Line for a Second Walk appears on the front cover, spine, and physical disc.  The performers are identified on the front cover, and all of the booklet, as The Zoo II, and on the back cover as \"The Zoo Duet\".  As one of the tracks on the album is \"Lady in the Red Hat\" from A Zed & Two Noughts, also known as Zoo, this is often seen as a reference to that film.  A photograph of the duo is inside the booklet, two young women in black on a black background, leaving only their wedding banded-hands (which form the front cover design) and faces visible, with \"The Zoo II\" as the only caption.  The pianists are identified as Helen Hodkinson and Brenda Russell in the Michael Nyman discography on the 1995 promotional compilation Michael Nyman.\nThe album was reissued with a new cover and the Music for Two Pianos title by Signum Records on April 5, 2004 (May 25, 2004 in the U.S.).  The artist is listed as \"The Zoo Duet,\" but neither Hodkinson nor Russell are identified by name.  This led some reviewers to assume that the piano was played by Nyman himself, using overdubs to play both parts.\nThe title work, which is partially influenced by 1950s rock and roll, takes up the first three tracks of the album (the second and third are identified as \"(untitled)\" in the reissue cover, and simply left blank in the original).  The album also contains an expansion of the Water Dances for Peter Greenaway's film about synchronized swimming, Making a Splash, which originally appeared on the album The Kiss and Other Movements.  The album's liner notes mention that this latter work invokes a chord progression from a madrigal by Claudio Monteverdi.\nTrack listing\n#Taking a line for a second walk11'52\"\n#5'46\"\n#5'27\"\n#Lady in the Red Hat5'23\"\n#Water Dances:  I4'04\"\n#II5'17\"\n#III5'50\n#IV5'15\"\n#V7'33\"\nPersonnel\nThe Zoo II inside cover photograph by Eric Butcher & [[James Braberson, apparently not included in the reissue]]\n*performed by The Zoo II (Helen Hodkinson and Brenda Russell), pianos\n*producer:  Tony Harrison\n*recording engineer:  Mike Hatch, Floating Earth Limited\n*executive producer: Richard Hodkinson\n*publishers: Chester Music Ltd & Michael Nyman Ltd (Lady in the Red Hat & Taking a Line for a Second Walk)Michael Nyman Limited (Water Dances)\n*photography: Eric Butcher & James Braberson (The Zoo Duet)Work Music (Michael Nyman)\n*design: Rob Andrews\nExternal links\n*[http://www.signumrecords.com/catalogue/sigcd506/index.shtml Signum Records official site]\nReferences"
    }
  ]
}