{
  "content": [
    {
      "type": "text",
      "text": "# Taking Tiger Mountain by Strategy__disambig_2\n\n| language = Chinese\n| based_on = |Qu Bo}}\n}}\nTaking Tiger Mountain by Strategy () is a Beijing opera play and one of the eight model plays allowed during the Chinese Cultural Revolution.  The plot is based on parts of the popular novel  () by Qu Bo, which in turn, is based on the real-life story of an incident in 1946 during the communist campaign to suppress bandits in northeast China in the Chinese Civil War, involving a PLA reconnaissance soldier Yang Zirong () who disguised himself as a bandit to infiltrate a local gang of bandits, eventually helping the main communist force destroy the bandits. Unlike other characters depicted in the opera and novel, most of the names of both the protagonists and the bandits are real.\nA booklet of Taking Tiger Mountain by Strategy was published in English by the Foreign Languages Press in 1971. Described as \"revised collectively by the Taking Tiger Mountain by Strategy group of the Peking Opera Troupe of Shanghai (1970 script)\", it contains 16 colour photo reproductions, a list of persons in the cast, the script of the ten scenes, and the words and vocal music of nine selected songs. Explanatory notes and sketches about the Chinese percussion instruments played in the orchestra are also included.\nCast\n* Yang Tzu-jung, scout platoon leader of the Chinese People's Liberatrion Army (PLA)\n*\n* Chief of Staff, PLA regimental chief of staff\n*\n* Li Yung-chi, railway worker\n*\n* Chang Pao, hunter's daughter\n*\n* Shen Teh-hua, PLA scout platoon deputy leader\n*\n* Medical Orderly, PLA girl medical orderly\n*\n* Young Kuo, PLA soldier\n*\n* Chung Chih-cheng, PLA soldier\n*\n* Lu Hung-yeh, PLA soldier\n*\n* Lo Chang-chiang, PLA soldier\n*\n* Other soldiers\n*\n* Hunter Chang, Chang Pao's father\n*\n* Mother Li, Li Yung-chi's mother\n*\n* Chang Ta-shan, railway worker''\n*\n* Li Yung-chi's wife\n*\n* Other villagers\n*\n* Vulture, ''bandit chieftain of Tiger Mountain, leader of Kuomintang's \"Fifth Peace Preservation Brigade of the Eastern Heilungkiang Region\"\n*\n* Luan Ping, liaison adjutant under Horse Cudgel Hsu, bandit chieftain of Breast Mountain''\n*\n* Bandit Chief of Staff\n*\n* Bandit Chief Adjutant\n*\n* Bandit Captain\n*\n* \"Terribles\" and other bandits\nScenes\n# Advancing in Victory – Winter, 1946\n# Chiapi Valley Pillaged – Dusk\n# Asking About Bitterness – Afternoon\n# Drawing Up a Plan – Early morning\n# Up the Mountain – A few days later\n# Into the Bandits' Lair – Immediately after the previous scene\n# Arousing the Masses – Chiapi Valley\n# Sending out Information – Dawn\n# Off to the Attack – Morning\n# Converging on Hundred Chickens Feast – Lunar New Year's Eve\nAdaptations\n*A film version directed by Xie Tieli was released in 1970. A modern remake, The Taking of Tiger Mountain, directed by Hong Kong film director Tsui Hark was released on December 23, 2014.\n*Brian Eno, who found a book of postcards from the opera in San Francisco, later used the title on his second solo album, Taking Tiger Mountain (By Strategy).\n*A song from the opera  was used in a version of The Lion King musical as performed  in the Shanghai Disney Resort.\nReferences\nExternal links\n*[http://parslow.com/TigerMountain/ Images of the original postcards]"
    }
  ]
}