{
  "content": [
    {
      "type": "text",
      "text": "# Tales of the Kingdom Trilogy\n\n}}\nTales of the Kingdom Trilogy includes three allegorical books: Tales of the Kingdom (1983), Tales of the Resistance (1986) and Tales of the Restoration (1996), by authors David and Karen Mains. The series has been the recipient of the Evangelical Christian Publishers Association (ECPA) Gold Medallion Award  under the Children's Book Category.\nIn 2024, the term Kingdom Tales Trilogy was registered as a trademark with the United States Patent and Trademark Office. The trademark covers books under International Class 016.\nSummary\nThis is an allegory, similar to The Tales of Narnia. A King reigned. The Enchanter ousted him from the city and then turned day into night and night into day. He wishes to keep all memory of the King from the people. The Enchanter has taken many children into slavery, making them \"work the sewers\" and feed the boilers so that man-made power can light the night. The children are not allowed to come up to the streets to find the warmth of street lights or the sun. He has taken their names away. Now, they are known by a number.\nPlot\nBook 1 - Tales of the Kingdom\nThe story revolves around Scarboy who is followed by action, intrigue, and danger wherever he goes. This misfortune especially occurs in the Enchanted City, where the “imperfect” are cast away and orphans are enslaved. Scarboy manages to escape the evil Enchanter to safety in Great Park, but has yet to confront his greatest fear—and he will need enormous courage to conquer it!\nBook 2 - Tales of the Resistance\nThis second book of the trilogy contains 12 stories about Hero's participation in the underground taxi resistance against the evil Enchanter, challenger to the one True King. Other characters include Carny, Doubletalk, Sewer Rat #1, the Boiler Brat and the Most Beautiful Player of All.\nBook 3 - Tales of the Restoration\nIn Tales of the Restoration, the conclusion to the Kingdom Tales trilogy, the restoration has begun. Between power-outs, mudslinging, and peril at Burning Place, our heroes look to celebrate life under the King's reign, and enjoy the Great Celebration.\nMusical - Resistance!\nThe trilogy has been adapted into a musical called \"Resistance!\" written by Gwen Mansfield. The playwright worked closely with David and Karen Mains. The musical premiered at Renton Civic Theatre in Washington in the 1990's and has been performed many other places since then.\nReception\nThe books have received mostly favourable reviews from several readers  and authors. Harold Myra of Gordon College found them to have \"sound theology wrapped in creative storytelling\", and to be \"substantive and biblical, skillfully crafted, marvelous for family reading\". A campaign to revise the content, fully re-illustrate all the art, and republish a 30th-anniversary collectible edition of these storybooks in digital, print, and audio formats was launched through Kickstarter.\nGallery\nFile:Tales of the Kingdom Classic Cover.jpg|Tales of the Kingdom Classic Edition\nFile:Tales of Resistance Classic Cover.jpg|Tales of the Resistance Classic  Edition\nFile:Tales of the Restoration Classic Cover.jpg|Tales of the Restoration Classic  Edition\nFile:Tales of the Kingdom Trilogy Discussion Guide.png|Tales of the Kingdom Trilogy Discussion Guide\nFile:KingdomTales Anniversary Covers.jpg|Kingdom Tales Anniversary Bundle\nFile:Tales of the Kingdom 40th Anniversary Boxed Set.jpg|40th Anniversary Boxed Set\nFile:Tales of the Kingdom Anniversary Cover.jpg|Tales of the Kingdom Anniversary Edition\nFile:Tales of Resistance Anniversary Cover.jpg|Tales of the Resistance Anniversary  Edition\nFile:Tales of the Restoration Anniversary Cover.jpg|Tales of the Restoration Anniversary  Edition\nFile:Tales of the Kingdom Audiobook.png|Tales of the Kingdom Audiobook\nFile:Tales of the Resistance Audiobook.png|Tales of the Resistance Audiobook\nFile:Tales of the Kingdom Audiobook (new version).jpg|Tales of the Kingdom Audiobook (new version)\nReferences\nExternal links\n* [http://kingdomtales.com/ Kingdom Tales Trilogy]\n* [https://www.amazon.com/Kingdom-Tales-Trilogy-Resistance-Restoration/dp/B0087BY118/ref=sr_1_5?m=AE5VF33B5NPGV&marketplaceID=ATVPDKIKX0DER&qid=1554887582&s=merchant-items&sr=1-5 Kingdom Tales on Amazon]"
    }
  ]
}