{
  "content": [
    {
      "type": "text",
      "text": "# Talking Heads (Body of Proof)\n\n| production   =  106\n| writer       =\n| director     = Christine Moore\n| guests       = * Mary Mouser as Lacey Fleming\n* Kelly AuCoin as Mike Walsh\n* Abigail Hawk as Jenny Avery\n* Tom Pelphrey as Dean Avery\n* Kathy Searle as Irina Tomislava\n* Pun Bandhu as Frank Ling\n* Li Jun Li as Mira Ling\n* Gary Galone as David\n* Cindy Lentol as Wendy\n| season_article = Body of Proof (season 1)\n| episode_list = List of Body of Proof episodes\n| prev         = Helping Hand\n| next         = Dead Man Walking\n}}\n\"Talking Heads\" is the fourth episode of the first season of the American medical drama Body of Proof. It was originally broadcast in the United States on ABC on April 12, 2011. The episode was directed by Christine Moore and written by Diane Ademu-John.\nIn this episode, Megan (Dana Delany) and her team investigate the murder of Callum O'Donnell, but have much difficulty in finding his body, as it was dismembered. After finding the victim's daughter, Jenny (Abigail Hawk) and her husband Dean (Tom Pelphrey) with the victim's money, this leads them to suspect many of Callum's acquantices. Meanwhile, Megan's daughter, Lacey (Mary Mouser), goes to Megan's work, for a school project.\nThe episode received positive reviews, and was watched by 11.06 million viewers, according to Nielsen ratings, on the Tuesday night it aired in the United States. Critics praised guest star Kathy Searle, who appeared as Irina Tomislava, who dismembered the victim, however did not murder him, calling it \"impressive\" and that it had a sense of \"eerie coldness\", naming it \"disturbing\".\nPlot\nDr. Megan Hunt (Dana Delany) receives a call as a hand and a foot were found. Megan and Peter Dunlop (Nicholas Bishop) notice that the hand and foot are severed, leading them to search for the other body parts. Megan concludes that it is a single male and has rheumatoid arthritis. After finding a stamp on the victim, it leads them to a casino, they find out his name is Cal, and see him on the security footage. Megan, Peter, and Ethan Gross (Geoffrey Arend) find a knee and a thigh, and the team find out that the man had knee replacement surgery. Peter tracks the serial number for the knee replacement; finding out the victim is Callum O'Donnell. His daughter Jenny (Abigail Hawk) identifies the body parts of Callum, based on his scars and injuries. They find the rest of Callum's body parts in his freezer, apart from the head. Megan and Detective Samantha Baker (Sonja Sohn) speak to Callum's neighbours, Mira (Li Jun Li) and Frank Ling (Pun Bandhu) and the Ling's nanny, Irina (Kathy Searle).\nThe money that Callum won from the casino is missing, and Samantha finds it with Jenny and her husband Dean (Tom Pelphrey), after they stole it. Jenny and Dean are brought into questioning; however Jenny tells Megan that Callum was giving it to her, to go on an art course. Samantha talks to Frank again, but when they question him about Irina but he does not know her. They find out that Irina was Callum's nurse, for his arthritis and that Callum was going to help Irina get her son from Belgrade to the US. Irina confesses that she did cut up Callum, but did not kill him. Irina found Callum dead, so cut him up so that she could forge the last immigration document to get her son to her as Callum had not finished it. Irina tells Megan where the head is, and they find a fracture on his head. Megan and Samantha go back to Callum’s apartment, and Megan demonstrates why Irina couldn’t have killed Callum due to the mark on the wall being too high to be Irina. Megan traces metal to Callum's landlord, Mike Walsh (Kelly AuCoin). Samantha infers that because Cal was under rent control, Mike killed him so a paying client could stay in the apartment. Meanwhile, Lacey Fleming (Mary Mouser) asks if she can go to Megan's work, for a school project. Lacey arrives, and speaks with Dr. Kate Murphy (Jeri Ryan), discussing her work. Lacey tries to get Kate to allow her to see the body, however she refuses. Lacey speaks to Ethan, Curtis Brumfield (Windell Middlebrooks) and later Megan, who shows her pictures of bodies, telling her about her job.\nProduction\nand regular cast member Sonja Sohn (pictured) have previously worked together on the series, The Wire.]]\n\"Talking Heads\" was written by Diane Ademu-John and directed by Christine Moore. Moore is best known for directing episodes of The Wire, which starred Sonja Sohn who currently plays Detective Samantha Baker in Body of Proof. Daniel Licht who has worked on the series since its inception, returned to compose the music for the episode. Actor Kelly AuCoin (best known for his role in Gossip Girl and The Good Wife) guest starred in the episode as Mike Walsh. Mary Mouser (best known for her role in Life Is Wild) made another re-appearance as Lacey Fleming, Megan's daughter. Regular cast member John Carroll Lynch who plays Detective Bud Morris, did not appear in this episode, although was credited.\n\"Talking Heads, along with the eight episode's from Body of Proofs first season, were released on a two-disc DVD set in the United States on September 20, 2011. The sets included brief audio commentaries from various crew and cast members for several episode's, a preview of season 2 and a 10-minute \"featurette\" on the making of the show, with commentaries from the medical consultants who helped with the script, as well as a \"Contaminated Evidence\" blooper reel.\nReception\nRatings\nIn its original American broadcast on April 12, 2011, \"Talking Heads\" was seen by 11.06 million viewers, according to Nielsen ratings. Among viewers between ages 18 and 49, it received a 2.5 rating/9 share; a share represents the percentage of households using a television at the time the program is airing. This episode achieved a fewer number of viewers than both the previous episode, \"Helping Hand\", and the subsequent episode \"Dead Man Walking\". Body of Proof came fourth in the ratings on Tuesday night, it was outperformed by the ABC's Dancing with the Stars and two episodes of CBS's NCIS.  \"Talking Heads\" was watched by 1.75&nbsp;million viewers upon its airing on Channel 5 in the United Kingdom.\nCritical response\n}}\nChristine Orlando of TV Fanatic expressed her disappointment at John Carroll Lynch's character Bud Morris not appearing in this episode saying, \"The show lacked his sarcastic wit and his banter with Megan. We're just a few episode's into this show and I've already been enjoying their chemistry\". She also praised Searle's performance saying, \"When Irina described cutting up Callum's body it was with an eerie coldness. She liked the man and he cared for her. Yet, once dead he was no longer an asset to her but a problem that needed to be disposed of, literally. I could only imagine the parts of yourself you'd have to shut down to be able to take a hacksaw to someone you were fond of\". Also praising Kelly AuCoin's performance, she said that she wasn't \"sure who was more disturbing, Irina or the landlord who swung a hammer at the man's head and then went on with his day as though nothing had occurred\". Finally, she praised the scenes between Megan and Lacey (Mary Mouser).\nTV Overmind Carissa Pavlica commented on Tom Pelphrey guest role saying \"I adored Guiding Light and considering the roles Tom Pelphrey (my beloved Jonathan from GL) gets after his run as the bad-boy, I immediately suspected he would be the killer. Turned out I was wrong, but he was still a class A jerk\". Of the episode she said, \"The suspects pile up so fast and furious, that it's difficult to figure out the perpetrator until they are ready to tell you. She added that she had \"much respect for that method of storytelling\". She continued, \"There is nothing I enjoy less than watching the crime being committed in the first minutes of a show and then watching the respective squad of police and detectives miss clues we already know. Body of Proof isn't afraid to allow the audience to use their intellect\". Pavlica also enjoyed the relationship between Megan and Lacey, calling it \"heart wrenching\" saying that she had a tear in eye due to the scenes. \"I'm enjoying how the writers are piecing together the strained relationship they had, in a realistic, no holds barred way\". However, Pavica was afraid to \"jinx\" the show, as she had \"no idea of Body of Proof's place in the ratings\", adding that she was \"nervous\" as it is up against shows such as The Good Wife and Parenthood.\nReferences\nExternal links\n* [http://abc.go.com/shows/body-of-proof/episode-detail/talking-heads/751047 \"Talking Heads\"] at ABC.com\n*"
    }
  ]
}