{
  "content": [
    {
      "type": "text",
      "text": "# Talking tree\n\n}}\n. Golconda, early 17th-century. Museum of Islamic Art, Berlin]]\nTalking trees are a form of sapient trees in mythologies and stories.\nBen Bryne initially said that in Greek mythology, all the trees in the Dodona (northwestern Greece, Epirus) grove (the forest beside the sanctuary of Zeus) became endowed with the gift of prophecy, and the oaks not only spoke and delivered oracles while in a living state, but when built into the ship Argo the wood spoke and warned of approaching calamities.\nExamples\n* In the book Shahnameh (Book of Kings) by Firdawsi (d. 1020), Alexander the Great visited a talking tree.\n* The rustling of the leaves on an oak tree has been regarded as the voice of Zeus.\n* The Greek talking elm: Philostratus spoke about two philosophers arguing beneath an elm tree in Ethiopia which spoke up to add to the conversation.\n* The Indian Trees of the Sun and the Moon told the future. Two parts of the tree trunk spoke depending on the time of day; in the daytime the tree spoke as a male and at night it spoke as a female. Marco Polo is said to have visited this tree.\n* The weeping date palm tree: Muhammad, when delivering his sermons, used to stand by or lean on a date palm tree. When a pulpit was built elsewhere and Muhammad started to give his sermon from the pulpit, the tree began to cry like a child. Muhammad then descended from his pulpit and consoled the tree by embracing it and stroking it. He said, \"It was crying for (missing) what it used to hear of religious knowledge given near to it.\" This incident is recorded in the authentic Islamic Hadith traditions and is said to have been witnessed by everyone present at the congregation.\n* Oracular trees are sometimes attributed with the ability to speak to individuals, especially those gifted in divination. In particular, Druids were said to be able to consult oak trees for divinatory purposes, as were the Streghe with Rowan trees.\n* In Medieval literature, in the Arthurian legend, Merlin is turned into a tree by Viviane.\n* In Dante Alighieri's Divine Comedy story Inferno, the protagonists (Dante and Virgil) speak with suicides who have been turned into trees in Hell.\n* In J. R. R. Tolkien's The Lord of the Rings, Ents are a species of sentient beings who closely resemble trees, who serves as ancient shepherds of the forest and allies of the free peoples of Middle-earth during the War of the Ring.\n* In English folklore, willows were said to stalk humans.\n* The Yaqui have a legend of a talking tree. The tree told of the Christian God and the priests who would soon arrive to teach the people new beliefs and new ways.\n* Artist Théodore Rousseau (1812–1867) is quoted as saying \"I also heard the voices of the trees ... whose passions I uncovered. I wanted to talk with them ... and put my finger on the secret of their majesty.\"\nSee also\n* Daphne\n* Dryad\n* Mesoamerican world tree\n* Tree deity\n* Tree of life\n* Tree worship\n* Waqwaq\n* World tree\n* Vegetation deity\nReferences\nExternal links\n*[https://web.archive.org/web/20041217200022/http://treetotem.com/mythcontents.htm Encyclopedia of Mythical Trees and Deities - archived version]\n|"
    }
  ]
}