{
  "content": [
    {
      "type": "text",
      "text": "# Talking Stick Resort Amphitheatre\n\nBlockbuster Desert Sky Pavilion Cricket Pavilion Cricket Wireless Pavilion Ashley Furniture HomeStore Pavilion Ak-Chin Pavilion\n| seating_type =\n| seating_capacity = 20,106\n}}\nTalking Stick Resort Amphitheatre (originally known as the Desert Sky Pavilion and most recently known as Ak-Chin Pavilion) is an amphitheater located in Phoenix, Arizona, which seats 8,106 under a pavilion roof and an additional 12,000 on a hillside behind the main stands. It officially opened on November 9, 1990 (Billy Joel was the venue's inaugural performer). The naming rights sponsor is Talking Stick Resort (the venue is not located on tribal land). Its total capacity of over 20,000 is higher than that of Mortgage Matchup Center and Desert Diamond Arena. The amphitheater's season starts in April and closes in October.\nAbout\nWhitney Houston performed at the venue on May 19, 1991, during her ''I'm Your Baby Tonight World Tour.\nSteely Dan played their Alive in America tour here in 1994.\n]]\nThe lawn at the amphitheater contains several video screens.\nR.E.M. recorded two tracks off their 1996 studio album New Adventures in Hi-Fi there.\nWheel of Fortune taped 2 weeks of shows there in 1997, which featured the final episodes of the old puzzle board.\nThe Spice Girls performed at the venue on August 22, 1998, during their debut Spiceworld Tour''.\nThe amphitheater has been used to hold many famous concerts and tours, especially in the summer months of July and August, it has hosted Nine Inch Nails, Van Halen, Bon Jovi, Metallica, Janet Jackson, The Vote for Change Tour, Lynyrd Skynyrd, Black Sabbath, The Vans Warped Tour, The Gigantour, Lollapalooza, Lilith Fair, Crüe Fest, Ozzfest and Projekt Revolution. It has hosted the Phoenix date of the annual Mayhem Festival since the tour's inception in July 2008.\nFall Out Boy recorded their live album, Live in Phoenix, at the amphitheatre on June 22, 2007.\nGreen Day recorded their song, \"Cigarettes and Valentines\", for their live album, Awesome as Fuck, here.\nFall Out Boy & Paramore brought their co-headlining tour, MONUMENTOUR to The Pavilion on August 8, 2014 with New Politics as the opening act. Lana Del Rey, accompanied by Courtney Love, brought her Endless Summer Tour to The Pavilion on May 14, 2015.\nAJR headlined the venue on June 21, 2022, on their tour supporting their album \"OK Orchestra\".\nA Perfect Circle, Primus and Puscifer recorded their Sessanta Live album during a show at the venue.\nOn July 1 2025, the Amphitheatre hosted the 2025 Summer of Loud tour headlined by Killswitch Engage, Beartooth, I Prevail, and Parkway Drive, with Special Guests The Amity Affliction, The Devil Wears Prada, and Alpha Wolf, with TX2 as the opening act.\nSee also\n*List of historic properties in Phoenix, Arizona\n*List of contemporary amphitheatres\n*Ak-Chin Indian Community\n*Live Nation\nReferences\nExternal links\n*[https://www.talkingstickresortamphitheatre.com Venue website]"
    }
  ]
}