{
  "content": [
    {
      "type": "text",
      "text": "# Tamayouz Excellence Award for Architecture\n\nTamayouz Excellence Award is an international award for architecture established in 2012. It has eight prizes: six awards recognise individuals, student projects and institutions; two awards are thematic design competitions and a design challenge. Tamayouz Excellence Award runs an annual cycle of all awards. In addition to its prizes, Tamayouz organises public talks, conferences, design challenges and design workshops, and publishes an annual book that documents each cycle and the architectural ideas that are produced as a result.\nHistory\nTamayouz Excellence Award was established in 2012 by Iraqi architect and academic Ahmed Al-Mallak, who initially launched an award to recognise the graduation projects of students of architecture in Iraq. According to an interview with Architectural Digest Middle East (2020), this was because Al-Mallak found it difficult for recent graduates of architecture to continue their studies or work outside of the Middle East without further certification. He hoped that this award would provide a more solid foundation for Middle Eastern architects who want to work outside of their home country.\nAl-Mallak partnered with architects and architecture firms such as Zaha Hadid and Dewan Architects & Engineers. The founder of Dewan, Mohamed Al Assam, and Hadid were part of Tamayouz's first jury panel. Al-Mallak has stated that having these associations with the award meant that the students who won would be recognised by regional and international professionals in the field of architecture.\nTamayouz Excellence Award grew its award categories over the years to include the remaining eight categories, 88 judges (consisting of architectural academics, architects and researchers from around the world), and almost 100 volunteers and advisers. By the 2022 cycle, Tamayouz received nearly 7384 submissions across its eight awards, representing 101 countries.\nIn addition to its awards, Tamayouz holds public talks, conferences, and design workshops. In 2022, four public talks were held in Oman, Muscat. Previously, these events were hosted in various locations including Coventry, UK; Alexandria, Egypt; Amman, Jordan; and Beirut, Lebanon.\nWhile Tamayouz Excellence Award started out as an award for Iraqi graduation projects, it is now an international awards programme that recognises architects, architectural institutions and projects from all over the world. And through its two themed competitions - the Rifat Chadirji Prize and the Dewan Award for Architecture - it invites architects worldwide to submit projects that address the awards' themes. The shortlisted projects are published online as an open source of ideas for urban development challenges.\nAward categories\nTamayouz Excellence Award has eight categories:\n{| class=\"wikitable\"\n|-\n! Award !! Purpose\n|-\n| International Graduation Projects Award || This award recognises the graduation projects of architecture students worldwide.  In 2022 Tamayouz Excellence Award launched the [https://www.architecturegraduationprojects.com World's Top 100 Architecture Graduation Projects] platform.\n|-\n| Women in Architecture and Construction Award || This award recognises women who contribute to or promote the built environment of the Near East and North Africa. It is split between a Rising Star Award and Woman of Outstanding Achievement.\n|-\n| Middle Eastern Architectural Personality of the Year Award - Mohamed Makiya Prize || This award recognises institutions or individuals worldwide who have advanced or promoted the field of architecture as it relates to the Middle East and North Africa.\n|-\n| Dewan Award for Architecture || This is an annual thematic competition that focuses on a particular urban challenge facing Iraq. The award calls on architects worldwide to submit architectural solutions that respond to the theme. The award is named after Dewan Architects + Engineers, and is run in collaboration with them. It was launched in 2018, and the inaugural cycle called on designers to propose solutions for creating a school in Iraq's marshlands. In 2019, the award's theme was to revive Baghdad's Al Umma Park. In 2020, the award's theme was a 'youth house complex' for Baghdad's Sadr City. In 2021, the award's theme was a 'sanctuary for homeless underage girls'. In 2022, the award's theme was a 'rehabilitation center for victims of terrorist attacks in Iraq'. In 2023, the award is themed 'fish market in Basra'.\n|-\n| Rifat Chadirji Prize || This award is an annual thematic competition named after prolific Iraqi architect Dr Rifat Chadirji. It is an international thematic competition that was launched in 2017. For its inaugural cycle, the theme was Mosul's housing shortage. In 2018, its theme was to transform Baghdad's old governorate building into a design center, and in 2019, the Rifat Chadirji Prize was held in collaboration with the UAE's Barjeel Art Foundation and the theme was to design a modern Arab art museum in Sharjah, UAE. In 2020, the theme of the prize was 'living pedestrian bridge over the Nile River in Cairo'.\n|-\n| Lifetime Achievement Award || This award recognises the masters of architecture. Between 2014 and 2018, the award recognised these pioneering Iraqi architects: Dr Mohamed Makiya, Dr Rifat Chadirji, Dr Kahtan Al-Madfai, Hisham Munir and Maath Alousi. In 2019, the award was opened up to prominent architects from the whole Middle East and was awarded Palestinian-Jordanian architect Dr Rasem Badran., in 2020 it went to the renowned Egyptian architect Abdelhalim Ibrahim Abdelhalim.\n|-\n| Iraqi Graduation Projects Award || This award recognises the graduation projects of Iraqi architecture students.  This Award has been merged with the International Graduation Project Award since 2021.\n|-\n|Public Art Prize in the Arab World - Dia Al-azzawi Prize\n|This award recognises public art in the Arab world, this biannual prize is named after the internationally celebrated Iraqi artist Dia al-Azzawi, one of the pioneers of modern Arab art.\n|-\n|Tamayouz Special Recognition Prize\n|This award aims to celebrate and recognise contributions towards humanity, architecture and the built environment and is presented annually to individuals or organisations.\n|}\nJudges\nSince 2012, Tamayouz Excellence Award has invited a number of international and regional architects and architectural academics to participate as jury members. Having started at 12 judges in 2012, its judging panel now numbers at 88.\nSome of the judges include: Steve Austin (since 2015), Dr Rasem Badran (since 2016), Dr Caecilia Pieri (since 2017), Dr Wendy Pullan (since 2017), Fernando Olba (since 2014), Mohamed Al-Assam (since 2017), Philip Michael Wolfson (since 2016), Katherine McNeil (since 2012), Kanan Makiya (since 2017) and Suad Amiry (since 2019).\nCeremony\nTamayouz Excellence Award holds an annual ceremony every December, during which it presents the awards, certificates, medals and plaques to winners and finalists of that year's cycle. The ceremony is attended by the judges, finalists and winners, sponsors, volunteers and special guests. The ceremony was first held in Baghdad, Iraq, but it has been held in Amman, Jordan for the last several years.  The 10th annual ceremony was held in January 2023 in Omani capital Muscat.\nDesign workshops and conferences\nFollowing each shortlisting panel, jury meeting and awards ceremony, Tamayouz Excellence Award schedules public talks, conferences and workshops that are open to the general public and those interested in architecture.\nIn 2018, Tamayouz launched its first Design Workshop in Amman, Jordan, which was open to students of architecture and design, as well as field professionals. The week-long workshop divided the participants into groups which were then encouraged to study the urban challenges Amman faces (and which can be applied to cities globally). The workshop also invited international and regional urbanists, architects and city planners to speak on topics relevant to urban development. The workshop culminated in presentations, in which the teams revealed their findings and proposed solutions.\nIn 2019, Tamayouz held public talks in Coventry, UK; Alexandria, Egypt; Beirut, Lebanon; and Amman, Jordan. As well as its second week-long design workshop in Amman, Jordan.\nIn 2023, Tamayouz held public talks in Muscat, Oman; at Sultan Qaboos University, the Royal opera house, Sultan Qaboos Grand Mosque, and the National Museum.\nAnnual book\nEvery year, Tamayouz Excellence Award launches an annual book that documents that year's cycle of winners and finalists.\nWorld's Top Architecture Graduation Projects platform\nIn 2022 Tamayouz Excellence Award launched the [https://www.architecturegraduationprojects.com World's Top 100 Architecture Graduation Projects] platform. This online database showcases the top 100 projects submitted to Tamayouz Architecture Graduation Projects Award, these projects will be exhibited permanently and available to students worldwide. The award's judging panel will select the 100 projects to be exhibited for every year out of the submitted projects.\nSee also\n* List of architecture awards\nReferences"
    }
  ]
}