{
  "content": [
    {
      "type": "text",
      "text": "# Tanks of the post–Cold War era\n\nLeopard 2A5 main battle tanks (MBTs) during a combat demonstration in August 2010]]\nThe post–Cold War era is the period in world history from the collapse of the Soviet Union on December 27, 1991 to the present. During the Cold War (12 March 1947 – 26 December 1991), the  Soviet domination of the Warsaw Pact led to effective standardization on a few tank designs. In comparison, France, Germany, the United States, and the United Kingdom had previously developed their own tank designs, but now tried to standardize their designs, while the smaller nations of NATO purchased or adapted these designs.\nThe fall of the eastern bloc brought changes as the United States Military cut much of its expenditure, though the level rose again to comparable heights after the War on Terror started in 2001.\nAfter the Cold War, tank development continued into a third generation of main battle tanks and because of the effectiveness of antitank weapons, the technology advanced dramatically as well. Tanks became more survivable and their armour became thicker and much more effective. Fourth generation tanks are in development, with two (Japan's Type 10 and South Korea's K2) claimed as operational fourth generation tanks.\nOverview\nMountains north of Frankfurt during Exercise Ready Crucible in February 2005.]]\nThe main battle tank became the standard as a necessity, as it was realized that smaller medium tanks could carry guns (such as the US 90&nbsp;mm, Soviet 100&nbsp;mm, and especially the British L7 105&nbsp;mm) that could penetrate any practical level of armor at long range. An increasing variety of anti-tank weapons and the perceived threat of a nuclear war prioritized the need for additional armor. The additional armor prompted the design of even more powerful cannons.   Typical main battle tanks were as well armed as any other vehicle on the battlefield, highly mobile, and well armored.\nDevelopments\nIn 1974, the United States initiated an impressive programme to modernise its existing tank fleet and start real mass production of the M60A1, and later the M60A3; at the same time the M1 was developed. Budgets for tank design and production picked up during the administration of president Ronald Reagan, following tensions between the United States and the Soviet Union.\nIn response to infantry-portable and vehicle-mounted ATGMS, ever more capable defences were developed. Spaced armour, composite, explosive reactive armour, and active protection systems—like the Russian Shtora, Drozd, and Arena—were added to old and new tanks. Despite these improvements, the larger missiles remained highly effective against tanks. This was demonstrated in 1991 during the Gulf War when during a friendly fire incident, Hellfire anti-tank missiles disabled several M1 Abrams tanks.\nSome of the most successful second-generation Cold War tanks are still in service, indeed, some are still being built. However, they have been extensively upgraded and in some cases overhauled repeatedly and even completely rebuilt during the ensuing decades with layers of enhanced modern armor, newer guns, electronics and brand new and very different engines. Notable examples would be the T-72, Merkava and M1 Abrams. Sometimes these complete overhauls are given a new name, like the Polish Army's PT-91 Twardy based on the T-72M1 (upgrade) which derives from the T-72.\nGulf War/Iraq war\nseries tanks]]\nOperation Desert Storm in 1991 saw the US Marines still charging in with their M60 tanks while the rest of the tank forces had the Abrams.\nThe Iraqi forces were initially regular army units, equipped with  tanks such as T-54/T-55 tanks and T-62s. The Coalition main battle tanks, such as the U.S. M1 Abrams, British Challenger 1, and Kuwaiti M-84AB were vastly superior to the Chinese Type 69 and domestically built T-72 tanks used by the Iraqis, with crews better trained and armoured doctrine better developed.\nalong the Line of Departure.]]\nThe majority of Iraq armored forces still used old Chinese Type 59s and Type 69s, Soviet-made T-55s from the 1950s and 1960s, and some poor quality Asad Babil tanks (domestically assembled tank based on Polish T-72 hulls with other parts of mixed origin). These machines were not equipped with up-to-date equipment, such as thermal sights or laser rangefinders, and their effectiveness in modern combat was very limited.\nThe Iraqis failed to find an effective countermeasure to the thermal sights and sabot rounds used by the Coalition tanks. This equipment enabled them to engage and destroy Iraqi tanks from more than three times the range that Iraqi tanks could engage coalition tanks. The Iraqi crews used training rounds against the U.S. and British tanks. These rounds (purchased in great number during the Iran–Iraq War due to their cheap price) had soft steel penetrators and thus no hope of penetrating the advanced Chobham Armour of the Coalition tanks.\nIn Operation Iraqi Freedom in 2003, an Iraqi division the 6th Armored Division of the Iraqi Army. which was equipped with T-55s and BMP-1s defending the control of key bridges over the Euphrates River and the Saddam Canal at Nasiriyah, were decimated by US Marines with M1 Abrams, and the division as a unit rendered incapable for combat during the Battle of Nasiriyah in March 2003, during the invasion.\nIn addition to the T-54/T-55 and T-62 tanks that Iraq had, the most feared to US armoured forces were the  T-72 tanks in the Iraqi forces. Only Republican Guard divisions were equipped with Iraqi-modified T-72s. Many of the Iraqi T-72s were dug-in or hidden in groves, and then used to ambush the US or British tanks. In the war, the Iraqi T-72s were the preferred target for Apache helicopters and A-10s, in an attempt to diminish the combat power of Republican Guard divisions. The only chance for the Asad Babil T-72s against American tanks was to lure them to close range combat, or trying to ambush them from dug-in positions.\nBut even in those conditions, the M1s usually prevailed, as proven in circumstances like the Battle of Baghdad, and the drive to the capital, where dozens of Iraqi MBTs were obliterated, or near Mahmoudiyah, south of Baghdad, April 3, 2003, (Iraqi Freedom) when US tanks engaged their counterparts from just 50 yards, shattering seven enemy T-72s without losses. The Lion of Babylon T-72 was utterly outclassed by the M1 Abrams, the Challenger and by any other contemporary Western main battle tank during the 2003 invasion of Iraq.\nMain battle tanks introduced during the post-Cold War era\nMerkava Mark IV\nincreases the Merkava's accuracy and lethality]]\nThe Israel Defense Forces Merkava Mark III was introduced in December 1989, and had upgrades to the drivetrain, powertrain, armament, and electronic systems. The most prominent addition was the incorporation of the locally developed IMI 120&nbsp;mm gun. This gun and a larger  diesel engine increased the total weight of the tank to , but the larger engine increased the maximum cruising speed to .\nThe turret was re-engineered for movement independent of the tank chassis, allowing it to track a target regardless of the tank's movement.\nThe next development was the Israel Defense Forces Merkava Mark IV tank which is the most recent upgrade of the Merkava tank and has been in development since 1999. The upgrade's development was announced in an October 1999, however, new Merkava Mark IIIs continued to be produced until 2003. The first Merkava IVs were in production in limited numbers by the end of 2004.\nThe model has a new fire-control system, the El-Op Knight Mark 4. Removable modular armor, from the Merkava Mark IIID, is used on all sides, including the top and a V-shaped belly armor pack for the underside. This modular system is designed to allow for damaged tanks to be rapidly repaired and returned to the field. The tank carries the Israeli Elbit Systems Battle Management System and an active protection system.\nTank rounds are stored in individual fire-proof canisters, which reduce the chance of cookoffs in a fire inside the tank. The turret is \"dry\"; it stores no active rounds.\nSome features, such as hull shaping, exterior non-reflective paints, and shielding for engine heat plumes mixing with surrounding air to confuse enemy thermal imagers, were carried over from the IAI Lavi program of the Israeli Air Force to make the tank harder to spot by heat sensors and radar.\nThe Mark IV includes the larger 120&nbsp;mm main gun of the prior versions but can fire a wider variety of ammunition, including high-explosive anti-tank (HEAT) and armour-piercing fin-stabilized discarding sabot (APFSDS) kinetic energy penetrator rounds, using an electrical semi-automatic revolving magazine for 10 rounds. It also includes a much larger 12.7&nbsp;mm machine gun for anti-vehicle operations (most commonly used against technicals).\nT-90MS\nLeclerc Série XXI\nThe Leclerc is the French main battle tank (MBT) built by GIAT, now Nexter of France. It was named in honour of General Philippe Leclerc de Hauteclocque who led the French element of the drive towards Paris while in command of the Free French 2nd Armoured Division (2ème DB) in World War II.\nThe Leclerc is equipped with a GIAT (Nexter) CN120-26 120&nbsp;mm smoothbore cannon. This cannon can fire the same NATO standard 120&nbsp;mm rounds as the German Leopard 2 and US M1 Abrams, but in practice, only French-produced ammunition is issued. The gun is insulated with a thermal sleeve and has an automatic compressed-air fume extraction system instead of the usual bore evacuator. The Leclerc has a unique autoloading system which was specifically designed for it, and reduces the crew to three by eliminating a human loader. The turret of the Leclerc was designed around the auto-loading system to avoid the problems common to other tanks with an autoloader. The Leclerc autoloader allows a rate of fire of 12 shots per minute and holds 22 rounds of ready ammunition; it can accommodate up to six different types of ammunition at once, although like most autoloader systems it cannot change ammunition types once a round has been loaded. The most common types are the armour-piercing fin-stabilised discarding sabot (APFSDS) kinetic energy penetrator with a tungsten core and the high-explosive anti-tank (HEAT) round. There are 18 other rounds available for reload. A Leclerc tank can fire while traveling at a speed of 50&nbsp;km/h on a target 4,000 metres away. The gun is 52 calibres long instead of the 44 calibres common on most tanks of the Leclerc's generation, giving the rounds a higher muzzle velocity.\nThe Leclerc is also equipped with a 12.7&nbsp;mm coaxial machine gun and a remote-controlled 7.62mm machine gun, whereas most other NATO tanks use 7.62mm weapons for both their coaxial and top machine gun mounts; the major exception is the American M1 Abrams, which has a 7.62mm coaxial machine gun and two top-mounted machine guns, one 7.62mm and one 12.7mm.\nThe Leclerc has the GALIX combat vehicle protection system from GIAT, which fires a variety of smoke grenades and infra red screening rounds, as well as anti-personnel grenades.\nThe hull and the turret are made of welded steel fitted with modular armour, which can be replaced easily for repair or upgraded over the years. The French army in the late seventies rejected Chobham armour as being overly specialised in its optimisation to defeat hollow charge-weapons; it therefore opted to develop their own composite arrangement to defeat both hollow charge and sabot round. Due to the introduction of modernized threats, the batch 3 has a new armour package, including composite armor, titanium insert and on the sides of the turret, ERA blocks.\nIn service only since 1992 (after the Persian Gulf War), the Leclerc has no notable experience in true warzone environments, but has seen deployment on multiple low-intensity conflicts, including 15 Leclerc  stationed in Kosovo (KFOR) and others in Lebanon (UNIFIL) in the context of UN peace-keeping operations, where their performance was judged satisfactory by French officials.\nUntil 2010, 13 Leclerc were deployed in the south Lebanon for a peacekeeping mission with UNIFIL.\nC1 Ariete\nof the Italian Army]]\nThe C1 Ariete is the main battle tank of the Italian Army, developed by a consortium formed by Iveco-Fiat and Oto Melara (aka CIO, Consorzio Iveco Oto Melara). The chassis and engine were produced by Iveco, while the turret and fire-control system were produced by Oto Melara.The Ariete is mounted with a 120&nbsp;mm smoothbore Oto Melara cannon, autofrettaged and stress-hardened to increase durability over extended periods of fire, allowing the use of armour-piercing fin-stabilized discarding sabot (APFSDS) kinetic energy penetrator and high-explosive anti-tank (HEAT) rounds.\nThe Ariete's armour is a steel and composite blend, similar to the British Challenger 2 and the American M1 Abrams.\nThe Ariete features two side-mounted, electronically fired grenade launchers. Each launcher consists of four barrels which can be intermixed with either smoke or chaff grenades. The smoke grenades can shroud the tank from visual or thermal detection, while the chaff grenades disperse the tank's radar cross section. The tank is fully NBC protected.\nChallenger 2\n(Squadron D).]]\nThe Challenger 2 is the British main battle tank (MBT) currently in service and was designed and built by the British company Vickers Defence Systems (now known as BAE Systems Land and Armaments).\nChallenger 2 is an extensive redesign of the Challenger 1. Although the hull and automotive components seem similar, they are of a newer design and build than those of the Challenger 1, and fewer than 3% of components are interchangeable. Challenger 2 replaced Challenger 1 in service with the British Army and is also used by the Royal Army of Oman. It has seen operational service in Bosnia, Kosovo and Iraq.\nIn June 1991, after competition with other tank manufacturers' designs (including the M1A2 Abrams and the Leopard 2 (Improved)), the MoD (Ministry of Defense) placed a £520 million order for 127 MBTs and 13 driver training vehicles. An order for a further 259 tanks and 9 driver trainers (worth £800 million) was placed in 1994. Oman ordered 18 Challenger 2s in 1993 and a further 20 tanks in November 1997.\nChallenger 2 entered service with the British Army in 1998 (with the 2nd Royal Tank Regiment in Germany), with the last delivered in 2002. It is expected to remain in service until 2035. It serves with the Queen's Royal Hussars, the King's Royal Hussars - which will convert to the General Dynamics Ajax shortly—and the Royal Tank Regiment, each of which is the tank unit of an armoured infantry brigade.\nT-84 Oplot\nThe newest Ukrainian main battle tank (MBT) and most sophisticated version of the T-84 is an upgraded version of the \"T-84 Oplot\" mounting more advanced armor, new electronic countermeasure systems, and others from KB Yugnoe. One visible feature is the new PNK-6 panoramic tank sight. It is believed a very effective tank against old ex-soviet tanks.\nType 99 and 99A\nThe Chinese Type 99 tank (), also known as ZTZ-99 and WZ-123, was developed from the Type 98G (in turn, a development of the Type 98), is a third generation main battle tank (MBT) of the Chinese People's Liberation Army. It is made to compete with other modern tanks and is currently the most advanced MBT fielded by China.\nSmall-scale production of the Type 98 was begun in time for the tank to be featured in the PRC's National Day parade in 1999.\nFollowing the completion of the Type 98, research into improved versions of the tank continued within the Chinese government. These programs produced the Type 98G, a refined iteration of the Type 98 with a better reliability record. At the end of 2001, the first batch of 40 Type 98G tanks entered service with the regular Army. The Type 98G eventually gave rise to what is now known as the Type 99, which was officially revealed by the government in 2001. The final version of the Type 99 includes a 1,500-horsepower engine, in contrast to its immediate predecessor's 1,200-horsepower. Also added were a Leopard 2A5-style sloped-arrow armor plate on the front of the turret, and additional composite armor layers on the sides.\nIn part due to its high cost, the tank is not expected to be deployed in large numbers, unlike earlier Chinese designs such as the Type 59. Because of the limited nature of its production, the Type 99 is currently only operated by the PLA's most elite divisions.\nAl-Khalid\nAl-Khalid MBT on display in November 2012.]]\nThe  Al-Khalid tank (}}—,  lit. The Immortal Tank) and MBT-2000 refers to the main battle tank of Pakistan of jointly developed variants made by Pakistan and China during the 1990s. About 300 Al-Khalid tanks were in service with the Pakistan Army as of 2009. 44 MBT-2000 is in  service with Bangladesh Army from 2011.\nOperated by a crew of three and armed with a 125&nbsp;mm smooth-bore tank gun that is reloaded automatically, the tank uses a modern fire-control system integrated with night-fighting equipment and can fire many types of anti-tank rounds and anti-tank guided missiles. Al-Khalid is named after the 7th-century Muslim commander Khalid bin al-Walid (592–642 AD).\nAn evolution of Chinese and Soviet tanks, the design is considerably smaller and lighter than most Western main battle tanks. It is based on the Chinese Type 90-II, which combined technologies from several Soviet and Western tanks. The Al-Khalid is unusual in that it was designed to be adaptable for manufacture, so that it can be easily integrated with a variety of foreign engines and transmissions. The current production variant of the Al-Khalid uses a diesel engine and transmission supplied by the KMDB design bureau of Ukraine. The first production models entered service with the Pakistan Army in 2001.\nHaider\nArjun-Mk.1 and Mk.1A\nThe Arjun (Sanskrit: अर्जुन) is India's third generation main battle tank developed by India's Combat Vehicles Research and Development Establishment (CVRDE), for the Indian Army. The tank is named after the warrior prince Arjun of Indian epic, the Mahabharata.\nThe Arjun features a 120&nbsp;mm rifled gun with indigenously developed APFSDS, HESH, PCB and TB ammunition and gun-launched anti-tank guided munition SAMHO developed by DRDO, one 7.62&nbsp;mm coaxial machine gun, and a 12.7&nbsp;mm heavy machine gun. The tank is powered by a single MTU multi-fuel diesel engine rated at 1,400&nbsp;hp, and can achieve a maximum speed of  and a cross-country speed of . It has a four-man crew: commander, gunner, loader and driver. The tank has Automatic fire detection and suppression and NBC protection systems for crew safety. The Arjun tanks are protected with indigenously developed composite armour viz, Kanchan armour.\nThe MK-1A (previously designated as MK2) is a new variant of Arjun tank designed to enhance firepower, mobility and survivability. It has a completely redesigned turret protected with improved Kanchan armour and ERA. The MK1A has 89 major and minor improvements, of these 73 could be easily incorporated into the MK1 variant. Other major improvements include the addition of NERA for protection, integration of the gun-launched SAMHO ATGM, integration of the gunner's main sight with the automatic target tracking system, integration of the commander's panoramic sight (CPS MK-II) with the laser rangefinder and dual magnification day sight, the addition of an uncooled thermal sight interfaced with the FCS for hunter-killer capability, the addition of an uncooled sight system with binocular vision for the driver, a remote controlled weapon station, a track width mine plough, a containerized ammunition bin with individual shutter (CABIS) for crew safety, an advanced land navigation system, a new auxiliary power unit with double power generation capacity, and a redesigned hydropneumatic suspension system with new advanced running gear system (ARGS) to enhance agility. The Arjun MK1A has considerably more indigenous content than previous variant.\nType 10\nThe Japanese  is a 4th generation main battle tank produced by Mitsubishi Heavy Industries for the Japanese Ground Self Defense Force (JGSDF). Compared with other currently-serving main battle tanks in the JGSDF, the Type 10 has been equipped with enhancements in its capability to respond to anti-tank warfare and other contingencies.Introduction of the aircraft Type 10 tank -Japanese Ministry of Defense, Japan Defense Focus No.33 Column, Oct 2012https://www.mod.go.jp/e/jdf/no33/column.html The tank is smaller and rather light for a modern MBT being in the 40+ ton class; specifically designed not to over stress the many bridges one encounters and allow it to maneuver on the small roadways in Japan. The Type 10 is to replace the existing 40-year old 2nd generation Type 74 and/or complement the heavier 3rd generation Type 90 main battle tanks that are currently in service. Development began in the 1990s, with a prototype revealed in February 2008.\nIn January 2012, thirteen Type 10 tanks entered JGSDF service. The vehicle's armor has been significantly enhanced with a new generation of composite armor compared to the Type 90.\nThe developer claims that \"it has excellent protection against all the various existing shells. (As of 2013).\"\nAdopts a modular format to support upgrades in protection performance.\nThe Type 10 uses a 120mm L44 gun originally developed by Japan Steel Works.\nThe Type 10's new cannon can fire the newly developed \"Type 10 APFSDS\" round, which is specifically designed for and can only be fired by the Type 10.\nThe Type 10 APFSDS round is composed of amorphous metals containing heavy metal particles. It has high rigidity and is self-sharpening, Lightweight ammunition is fired at high initial velocity due to high cavity pressure.\nAnd with its advanced C4I, Type 10 tanks can share target and self-location information between platoons in real time. This is combined with an advanced FCS that can accurately hit even when shooting while maneuvering, and a high-speed automatic loading device that can re-fire within 3.5 seconds, and it is possible to demonstrate high striking power.\nCurrently, the Type 10 tank is the only MBT equipped with the FCP(Fire Control Picture)-level C4I.\nThe engine is 1200 horsepower, but the shaft output is improved by adopting the original HMT, and the mobility is superior to the Type 90.\nK2 Black Panther\nThe South Korean government, which developed the K1 (Nicknamed the \"88-Tank\") and K200 in the 1980s, decided that it had sufficient development capabilities through its experience in operating tanks and armored vehicles, so it planned to introduce domestic main battle tanks, unlike K1 previously developed through design assistance from Chrysler Defense and General Dynamics Land Systems. The main parts of the K1, which were previously operated by the South Korean military, were produced under the U.S. license, and the U.S. government's export control was a burden on the South Korean government when it attempted to export, so it was also considered important that developing tanks with indigenous technology would be advantageous for overseas exports. Emphasis upon indigenous technologies would also allow the proposed vehicle to enter the export market without licensing difficulties.\nThe next generation main battle tank to be developed by ADD was named \"XK-2,\" and the main objective of the development project was to secure new main battle tanks to replace the aging M48A3K and M48A5KW operated by the South Korean Army, as well as to prepare for North Korea's armored power.\nFrom 1995 to 1997, research was conducted on the concept of tank, including function, performance, shape, and necessary technology, and from 1998 to 2002, development of tank specific design and core technology and parts were conducted to develop 120&nbsp;mm tank guns, automatic target tracking devices, autoloaders, and operating software.\nFrom 2003 to 2007, five vehicles were built to demonstrate technology and performance, named MTR (Mobility Test Rig), FTR (Firepower Test Rig), PV1, PV2, and PV3. MTR and FTR conducted mobility, fire control, combat control, and low temperature operating life tests, while PV1, PV2, and PV3 conducted endurance test, developer test, operator test, and integrated logistics support test. The last prototype was unveiled on 2 March 2007, and the development was officially completed after being declared fit for combat by the Defense Acquisition Program Administration (DAPA) in September 2008. The third mass-produced K2, which began in 2022, included an improved Battlefield Management System (BMS) with the Korea Variable Message Format (KVMF), and the Korean Gunner's Primary Sight (KGPS) and Korean Commander's Panoramic Sight (KCPS) with improved resolution and automatic target tracking function.\nThe K2 has a 120&nbsp;mm 55-caliber smoothbore gun, Automatic Target Detection and Tracking System (ATDTS), advanced semi-active suspension system, soft and hard-kill active protection system, identification friend or foe (IFF) selective identification feature (SIF) system (IFF/SIF), inter-vehicular data communication system, and Battlefield Management System (BMS) interoperable with command, control, communications, computers, and intelligence (C4I) uplink systems.\nOn July 29, 2008, Hyundai Rotem and Otokar signed a contract for technology transfer and design assistance for the Altay Tank Development Project. This contract includes technology transfer and design assistance for systems, armor package, and 120&nbsp;mm guns required for Altay tank development.\nThe South Korean military are set to begin development of the K-2 PIP which is to be an upgrade of the current K-2 model with further advancements in aspects such as armour, weaponry and optics such as a hard-kill APS.\nKarrar\nThe Iranian new MBT. The tank was announced on 12 March 2017. At the announcement, it was stated that it possessed an electro-optical fire control system, a laser rangefinder, ballistic computer and could fire at both stable and mobile targets in day or night. Main armament of the Karrar consists of one 125mm smoothbore gun fitted with a fume extractor and a thermal sleeve. A remotely operated weapon station armed with a 12.7mm machine gun is mounted on the roof of the turret. The main gun can fire anti-tank laser-guided missiles.\nAltay\nThe Turkish Altay is a main battle tank, designed and developed by Otokar of Turkey for the Turkish Army and export markets. It is named in honor of Army General Fahrettin Altay (1880–1974) who commanded the 5th Cavalry Corps in the final stage of the Turkish War of Independence.\nThe Altay was designed from 2008 until 2012. Weighing in 65 tons it is one of the heaviest MBTs in service. 4 are actually in service and a total of 1,000 MBTs are planned to be produced in four separate lots of 250 units. The Altay needs a crew of 4: commander, gunner, loader, and driver. No autoloader is present. This machine features ROKETSAN (armour package) composite armour and the Aselsan/STM Volkan III assisted MKEK 120&nbsp;mm 55 caliber smoothbore gun able to fire standard 120×570mm NATO ammunition.\nThe Altay will compete on the Turkish army contract estimated at $2B for a batch of 250 tanks. Three more similar batches are expected.\nT-14 Armata\nType 100\nSee also\n* History of the tank\n* Tanks in World War I\n* Comparison of World War I tanks\n* Tanks of the interwar period\n* Tanks in World War II\n* Tanks in the Cold War\n* Armoured fighting vehicle\nReferences\n; Citations"
    }
  ]
}