{
  "content": [
    {
      "type": "text",
      "text": "# Tanks of the United States in the world wars__disambig_1\n\nin 1918 with Renault FT tank]]\nWorld War I\nAs the American army did not have tanks of its own, the French two-man Renault FT light tank was used by US in the later stages of World War I. It was cheap and well-suited for mass production, and in addition to its traversable turret another innovative feature of the FT was its engine located at the rear. This pattern, with the gun located in a mounted turret and rear engine, became the standard for most succeeding tanks across the world even to this day.\nThe M1917 was a US tank accepted by the army in October 1918 and is primarily based on the plans of the French Renault FT. The crew, a driver and gunner, were separated from the engine by a bulkhead. Steel idler wheels replaced the wooden idlers fitted to French examples. Approximately 64 of the M1917 were built before the end of World War I and 10 were sent to Europe, but too late to be used in combat. After the war Van Dorn Iron Works, the Maxwell Motor Company, and the C.L. Best Tractor Company created 950 more. 374 had cannons and 526 had machine guns and 50 were signal (radio) tanks. A later modification, the M1917A1, was a lengthened, rebuilt, updated version compared to the French one, having a 100&nbsp;hp Franklin engine and an electric self-starter rather than a crank starter.\nU.S. troops also used the British Heavy Tanks Mk V and Mk V* (pronounced \"Mark Five\" and \"Mark Five Star\"). A battalion trained in England and saw action in France in the last six weeks of the War. On a small number of occasions, U.S. troops were supported by tank units of the French Army operating Schneider and Saint-Chamond machines.\nLight tanks\nCTLS-4TA\nWorld War II\nMarmon-Herrington tanks that could not be delivered because of the fall of the Dutch East Indies were taken over by the US. The CTLS-4TAC and -4TAY tanks were redesignated light tank T14 and T16 respectively. They were used for training, some were used in Alaska and by the US Marines. The CTLS-4TAC has the turret offset to the left, the CTLS-4TAY to the right.\nM3/5 Stuart\nWorld War II\nThe Stuart was an upgrade of the M2 light tank.\nThe initial upgrade was designated the M3 Stuart and had thicker armor, modified suspension and a 37mm gun. Production of the M3 and later the M5 Stuart started in March 1941 and continued until October 1943 with a total of 25,000 produced.\nAn upgrade of the M3, which was initially called M4 but later redesignated the M5, was developed with improved engines and produced through 1942. The M5 featured a redesigned hull and driver's hatches moved to the top. The M5 gradually replaced the M3 in production from 1942 and was in turn succeeded by the light tank M24 in 1944.\nThe British Army was the first to use the M3 in combat. In November 1941, some 170 Stuarts took part in Operation Crusader, with poor results.\nAlthough the high losses suffered by Stuart-equipped units during the operation had more to do with better tactics and training of the enemy than superiority of enemy tanks in the North African campaign, the operation revealed that the M3 had several technical faults. Mentioned in the British complaints were the 37mm gun, a limited range and poor internal layout. The two-man turret crew was a significant weakness, and some British units tried to fight with three-man turret crews. However, crews liked its high speed and mechanical reliability.\nFrom the summer of 1942, when enough US medium tanks had been received, the British usually kept Stuarts out of tank-to-tank combat. M3s, M3A3s, and M5s continued in British service until the end of the war, but British armor units had a smaller proportion of these light tanks than US units.\nThe other major Lend-Lease recipient of the M3, the Soviet Union, was even less happy with the tank, considering it undergunned, underarmored, likely to catch fire, and too sensitive to fuel quality. The narrow tracks were highly unsuited to operation in winter conditions, as they resulted in high ground pressures that sunk the tank. However, the Stuart was superior to early-war Soviet light tanks such as the T-60, which were often underpowered and possessed even lighter armament than the Stuart. In 1943, the Red Army tried out the M5 and decided that the upgraded design wasn't much better than the M3. Being less desperate than in 1941, the Soviets turned down an American offer to supply the M5. M3s continued in Red Army service at least until 1944.\nIn US Army service, the M3 first saw combat in the Philippines. Two battalions, comprising the Provisional Tank Group fought in the Bataan peninsula campaign. When the American army joined the North African Campaign in late 1942, Stuart units still formed a large part of its armor strength.\nAfter the disastrous Battle of the Kasserine Pass the US quickly disbanding most of their light tank battalions and subordinating the Stuarts to medium tank battalions performing the traditional cavalry missions of scouting and screening. For the rest of the war, most US tank battalions had three companies of M4 Shermans and one company of M3s or M5/M5A1s.\nIn the European theater, Allied light tanks had to be given cavalry and infantry fire support roles since their main cannon armament could not compete with heavier enemy AFVs. However, the Stuart was still effective in combat in the Pacific Theater, as Japanese tanks were both relatively rare and were generally much weaker than even Allied light tanks. Japanese infantrymen were poorly equipped with anti-tank weapons and tended to attack tanks using close-assault tactics. In this environment, the Stuart was only moderately more vulnerable than medium tanks. In addition, the poor terrain and roads common to the theatre were unsuitable for the much heavier M4 medium tanks, and so initially, only light armor could be deployed. Heavier M4s were eventually brought to overcome heavily entrenched positions, though the Stuart continued to serve in a combat capacity until the end of the war.\nThe US liquidated its Stuarts when it got sufficient numbers of M24 Chaffees but the tank remained in service until the end of the war and well after. In addition to the United States, United Kingdom and Soviet Union, who were the primary users, it was also used by France and China.\nM24 Chaffee\nWorld War II\nIn April 1943 the government started work on the M24 Chaffee, designated light tank T24 as a replacement for the M3/M5 Stuart after the original replacement, the M7, was rejected in March. Every effort was made to keep the weight of the vehicle under 20 tons. The armor was kept light, and a lightweight 75&nbsp;mm gun was developed. The design also featured wider tracks and torsion bar suspension. It had relatively low silhouette and a three-man turret. In mid-October the first pilot vehicle was delivered and production began in 1944 under the designation light tank M24; 4,730 were produced by the time production was stopped in August 1945.\nThe first thirty-four M24s reached Europe in November 1944 and were issued to the U.S. 2nd Cavalry Group (Mechanized) in France. These were then issued to F Company, 2nd Cavalry Reconnaissance Battalion and F Company, 42nd Cavalry Reconnaissance Battalion which each received seventeen M24s. During the Battle of the Bulge in December 1944, these units and their new tanks were rushed to the southern sector; two of the M24s were detached to serve with the 740th Tank Battalion of the U.S. First Army.\nThe M24 started to enter widespread issue in December 1944 but they were slow in reaching the front-line combat units. By the end of the war many armored divisions were still mainly equipped with the M5. Some armored divisions did not receive their first M24s until the war was over.\nReports were generally positive. Crews liked the improved off-road performance and reliability, but were most appreciative of the 75&nbsp;mm main gun, as a vast improvement over the 37&nbsp;mm. The M24 was still not up to the challenge of fighting tanks, however, the bigger gun at least gave it a chance to defend itself. Its light armor made it vulnerable in tank vs. tank actions.\nThe M24s contribution to winning the war was insignificant, as too few arrived too late to replace the M5s of the armored divisions.\nMedium tanks\nM4 Sherman\nWorld War II\nThe U.S. Army designed the M4 as a replacement for the M3 medium. The designated goals were to produce a fast, dependable medium tank able to support infantry, provide breakthrough striking capacity, and defeat any tank currently in use by the Axis nations. In April 1941 the U.S. Armored Force Board chose the simplest of five designs. Known as the T6, the design was a modified M3 hull and chassis, carrying a newly designed turret mounting the Lee's main gun. This became the Sherman.\nThe prototype M4 was completed in September 1941. The T6 became standardized as the M4, and production after modifications began in October 1941.\nThe U.S. Army had seven main sub-designations for M4 variants during the production period: M4, M4A1, M4A2, M4A3, M4A4, M4A5, and M4A6. These designations were manufactured concurrently at different locations.\nWhile most Shermans ran on gasoline, the M4A2 and M4A6 had diesel engines: the M4A2 with a pair of GMC 6-71 straight six engines, the M4A6 a Caterpillar RD1820 radial. These, plus the M4A4 which used the Chrysler A57 multibank engine, were mostly supplied to Allied countries under Lend-Lease. \"M4\" can refer specifically to the initial sub-type with its Continental radial engine, or generically, to the entire family of seven Sherman sub-types, depending on context. Many details of production, shape, strength, and performance improved throughout production without a change to the tank's basic model number; more durable suspension units, safer \"wet\" (W) ammunition stowage, and stronger armor arrangements, such as the M4 Composite, which had a cast front hull section mated to a welded rear hull. British nomenclature differed from that employed by the U.S.\nEarly Shermans mounted a 75&nbsp;mm medium-velocity general-purpose gun. Although Ordnance began work on the medium tank T20 as a Sherman replacement, ultimately the Army decided to minimize production disruption by incorporating elements of other tank designs into Sherman production. Later M4A1, M4A2, and M4A3 models received the larger T23 turret, with a high-velocity 76 mm gun M1, which reduced the number of HE and smoke rounds carried and increased the number of anti-tank rounds. Later, the M4 and M4A3 were factory-produced with a 105&nbsp;mm howitzer and a new distinctive mantlet in the original turret. The first standard-production 76&nbsp;mm gun Sherman was an M4A1, accepted in January 1944, and the first standard-production 105&nbsp;mm howitzer Sherman was an M4 accepted in February 1944.\nIn June–July 1944, the Army accepted a limited run of 254 M4A3E2 Jumbo Shermans, which had very thick armor, and the 75&nbsp;mm gun in a new, heavier T23-style turret, in order to assault fortifications. The M4A3 was the first to be factory-produced with the HVSS (horizontal volute spring suspension) suspension with wider tracks to distribute weight, and the smooth ride of the HVSS with its experimental E8 designation led to the nickname Easy Eight for Shermans so equipped. Both the Americans and the British developed a wide array of special attachments for the Sherman; few saw combat, and most remained experimental. Those which saw action included the bulldozer blade for Sherman dozer tanks, Duplex Drive for \"swimming\" Sherman tanks, R3 flame thrower for Zippo flame tanks, and the T34 60-tube Calliope 4.5\" rocket launcher for the Sherman turret. The British variants (DD's and mine flails) were among \"Hobart's Funnies,\" named after their commander, Percy Hobart of the 79th Armoured Division.  during the Battle of Iwo Jima.]]\nThe M4 Sherman's basic chassis was used for all the sundry roles of a modern mechanized force: roughly 50,000 Sherman tanks, plus thousands more derivative vehicles under different model numbers. These included M32 and M74 \"tow truck\"-style recovery tanks with winches, booms, and an 81&nbsp;mm mortar for smoke screens; M34 (from M32B1) and M35 (from M10A1) artillery prime movers; M7B1, M12, M40, and M43 self-propelled artillery; and the M10 and M36 tank destroyers.\nThe M4 Sherman served with the U.S. Army and Marine Corps during World War II. The U.S. also supplied large numbers to the various Allied countries. Shermans were used during the war by British and Commonwealth armies, the Soviet Union's Red Army, Free French forces, the Polish army in exile, China's National Revolutionary Army, and Brazil's  Expeditionary Force.\nThe U.S. Marine Corps used the diesel M4A2 and gasoline-powered M4A3 in the Pacific. However, the Chief of the Army's Armored Force, Lt. Gen. Jacob L. Devers, ordered that no diesel-engined Sherman tanks be used by the Army outside the Zone of Interior (the continental U.S.). The U.S. Army used all types for either training or testing within the United States, but intended the M4A2 and M4A4 to be the primary Lend-Lease exports.\nThe M4A1 Sherman first saw combat at the Second Battle of El Alamein in October 1942 with the British 8th Army. The first U.S. Shermans in battle were M4A1s in Operation Torch the next month. At this time, Shermans successfully engaged German Panzer IIIs with long barreled 50mm L60 guns, and Panzer IVs with short barreled 75&nbsp;mm L24 guns. Additional M4 and M4A1s replaced M3 Lees in U.S. tank battalions over the course of the North African campaigns. However, by June 1944, most German tanks were up-gunned and 75&nbsp;mm Shermans were outgunned. The M4 and M4A1 were the main types in U.S. units until late 1944, when the Army began replacing them with the preferred M4A3 with its more powerful  engine. Some M4s and M4A1s continued in U.S. service for the rest of the war.\nThe first Sherman to enter combat with the 76&nbsp;mm gun (July 1944) was the M4A1, closely followed by the M4A3. By the end of the war, half the U.S. Army Shermans in Europe had the 76&nbsp;mm gun. The first HVSS Sherman to see combat was the M4A3E8(76)W in December 1944. The M4A3E8 (76)W was arguably the best of the US Sherman tanks.\nTanks in the US Army\nWorld War I\n*Tank Mk V used by American Heavy Tank Battalion (the 301st)\n*Mark VIII (International Tank / Liberty Tank)\n*Ford Model 1918 3-ton (M1918) light tank\n*Holt gas–electric tank\n*M1917 (American copy of Renault FT)\n*Renault FT\nWorld War II\n*M1 armored tank\n*M2 light tank\n*M2 medium tank\n*M3 Stuart\n*M5 Stuart\n*M3 Lee also known as M3 Grant\n*M4 Sherman (and variants of the Sherman)\n*M26 Pershing\n*M6 (prototype)\n*T29 (prototype)\n*T30 (prototype)\nTank destroyers of WWII\n*M10 tank destroyer\n*M18 Hellcat\n*M36 tank destroyer\n*T28 super-heavy tank (prototype)\nSelf-propelled artillery of WWII\n*M7 Priest\n*M12\n*T92\nUSMC tank units in World War II\nat the Battle of Arawe during the New Britain Campaign]]\nA Marine tank platoon consisted of 3 or 4 tanks commanded by an Officer, usually a Lieutenant, who also was in charge of his tank. The other tanks were controlled by a Non-Commissioned Officer (NCO), usually a sergeant.\nA tank company was three platoons plus two or three tanks in a headquarters company commanded by a captain in rank. This was about 11 to 15 tanks total. Tank companies were labeled similar to Marine companies such as companies A for Abel, B for Baker, C for Charlie, and D for Dog Companies.\nAn example designation of 3-3-1 would be for the 3rd Platoon of Charlie Company (3rd company) of the 1st Tank Battalion.\nTank platoons were sometimes referred to as being light in two ways. If all tanks were the same type, then it referred to the number of available tanks in a platoon being three instead of four. Later, and more commonly, if some of the tanks in a company consisted of \"light tanks\" like the M2A4 and M3 Stuart series with 37mm cannons compared to the M4 Sherman medium tank series with 75mm cannons, that platoon was considered light.\nA tank battalion usually had four companies (11 to 15 × 4 = 44 to 60 tanks) plus two or sometimes three tanks in a headquarters company. They were often commanded by a lieutenant colonel or a colonel in rank with a major as an executive officer. A battalion could consist of some 46 to 63 tanks. Later the number of tanks in a battalion was standardized to 58 tanks.\nDue to amphibious operations and operational needs, some platoons and companies operated separately or detached for various periods of time from their parent units. In addition, tanks with special abilities such as flame thrower tanks could be substituted or added as needed.\nFor example, the USMC 1st Tank Battalion landed at Peleliu on 15 September 1944 equipped with M4A2 tanks with several M4A2 tanks outfitted with M1A1 Dozer Kits or a tank with a bulldozer blade in front.\ntanks knocked out by Japanese artillery at Bloody Ridge, Lejima island during the Battle for Okinawa on April 20, 1945]]\nThe first Marines to use tanks in World War II were patched together US Army M2 light tanks in an ad hoc unit in the Philippines in early 1942, but details are scant. On 7 August 1942, M2 and M3 tanks landed on Guadalcanal with the 1st Tank Battalion. Later some upgraded M3s called the M5 were introduced. The first use of a M4 used in tank landing operations was at Hollandia on 22 April 1943. By February 1944 almost all USMC primary tanks were of the M4 series with only M3 specialty variants like the M3A1 (Satan) flame tank retained. The 5th and 6th Tank Battalions never used light tanks during World War II.\nThe last combat related tank landing operation by the USMC was at Okinawa on 1 April 1945 by the 1st & 6th Tank Battalions.\nSee also\n* History of the tank\n* Tanks in World War I\n* List of interwar armoured fighting vehicles\n* Comparison of World War I tanks\n* Tanks of the interwar period\n* Light tanks of the United Kingdom\n* Tanks in World War II\n* Cold War Tanks\n* Post-Cold War Tanks\nSources\nReferences\nno:Ford M1917\nru:M1917 (танк)"
    }
  ]
}