{
  "content": [
    {
      "type": "text",
      "text": "# Taranaki-King Country\n\n| party =\n| member_image = KURIGER, Barbara - Taranaki-King Country (cropped).png\n| member_elected =\n| list_mps =\n| previous_mp =\n| previous_mp_party =\n| partyvote_votes_total = 41045\n| partyvote_party_1 = New Zealand National Party\n| partyvote_votes_1 = 19281\n| partyvote_party_2 = New Zealand Labour Party\n| partyvote_votes_2 = 7022\n| partyvote_party_3 = ACT New Zealand\n| partyvote_votes_3 = 5484\n| partyvote_party_4 = New Zealand First\n| partyvote_votes_4 = 3398\n| partyvote_party_5 = Green Party of Aotearoa New Zealand\n| partyvote_votes_5 = 2828\n| partyvote_date = 2023\n}}\nTaranaki-King Country is a New Zealand parliamentary electorate, returning one Member of Parliament to the New Zealand House of Representatives. The current MP for Taranaki-King Country is Barbara Kuriger of the National Party. She has held this position since the 2014 general election.\nPopulation centres\nTaranaki-King Country stretches down the western coast of the North Island, starting at the outskirts of Hamilton, through to the King Country towns of Te Awamutu, Ōtorohanga and Te Kūiti, and ending in the northern Taranaki region, to take in the eastern and southern section of the New Plymouth District, including the communities of Waitara, Inglewood, Egmont Village and Midhirst, and all of Stratford District except Stratford itself. From , it has included the town of Raglan. The 2025 boundary review saw the electorate lose its part of Waitara to New Plymouth and gain Taumarunui from Rangitīkei.\nThe boundaries have gradually been expanded as the population has fallen, relative to the overall population of the country. At the 2013 revision the proposed boundaries received the third highest number (25) of objections in the country. After the 2013 revision the constituency covered parts of 3 regional councils and 7 district councils (Waikato District, Waipa District, Ōtorohanga District, Waitomo District, New Plymouth District, Stratford District, Ruapehu District), including Hamilton Airport.\nHistory\nThe seat was created ahead of the introduction of mixed-member proportional voting in  from most of the old  seat with parts of ,  in the south and  in the area around Hamilton. All these seats were safe National seats covering rural areas traditionally loyal to the National Party, the new seat remained faithful to old allegiances in the face of a large swing to New Zealand First in the central North Island at the . The first MP for Taranaki-King Country was the then Prime Minister of New Zealand, Jim Bolger.\nHaving been ousted from the leadership of his party, Bolger accepted the role of Ambassador to the United States in the middle of 1998, and triggered the . Despite a large swing to ACT Party candidate Owen Jennings, Bolger's chosen successor Shane Ardern won a narrow victory on a heavily reduced turnout. Since the 1998 by-election, Taranaki-King Country has reverted to form, giving Ardern two out of every three votes cast in ,  and .\nMembers of Parliament\nUnless otherwise stated, all MPs terms began and ended at general elections.\nKey\n{| class=wikitable\n|-\n!width=100| Election\n!width=175 colspan=2| Winner\n|-\n|\n| width=5 bgcolor=|\n| Jim Bolger\n|-\n|\n| rowspan=6 bgcolor=|\n| rowspan=6 | Shane Ardern\n|-\n|\n|-\n|\n|-\n|\n|-\n|\n|-\n|\n|-\n|\n| rowspan=4 width=5 bgcolor=|\n| rowspan=4| Barbara Kuriger\n|-\n|\n|-\n|\n|-\n|\n|}\nList MPs\nMembers of Parliament elected from party lists in elections where that person also unsuccessfully contested the Taranaki-King Country electorate. Unless otherwise stated, all MPs terms began and ended at general elections.\n{| class=wikitable\n|-\n!width=100| Election\n!width=175 colspan=2| Winner\n|-\n|rowspan=2|\n| width=5 bgcolor=|\n| Kevin Campbell\n|-\n| bgcolor=|\n| Owen Jennings\n|-\n|\n| bgcolor=|\n| Maryan Street\n|-\n|\n| bgcolor=|\n| Angela Roberts\n|}\nElection results\n2023\n}}\n2020\n}}\n2017\n}}\n}}\n}}\n2014\n2011\nElectorate (as at 11 November 2011): 41,152\n2008\n2005\n1999\nRefer to Candidates in the New Zealand general election 1999 by electorate#Taranaki-King Country for a list of candidates.\n1998 by-election\nNotes\nReferences\nExternal links\n*[http://www.parliament.nz/en-nz/mpp/electorates/DBHOH_Lib_EP_Taranaki-King%20Country_TOC_1/taranaki-king-country-electorate-profile Electorate Profile]  Parliamentary Library"
    }
  ]
}