{
  "content": [
    {
      "type": "text",
      "text": "# Tarkington Prairie, Texas__disambig_1\n\nTarkington Prairie is a primarily rural unincorporated community spread out over approximately  in northeastern Liberty County, Texas, United States. The community's fire protection is provided by Tarkington Volunteer Fire Department, emergency medical services by Liberty County EMS, and law enforcement by Liberty County Sheriff's Office.\nHistory\nThe area that now constitutes Tarkington was settled in 1826 when the first settlers purchased land from the Mexican government and became ranchers. The flat, wooded land was once open prairie where cattle grazed.\nThe area is named for one of these early settlers, Burton Tarkington, who is buried in McGinnis Cemetery and is remembered with a historical marker in front of the Tarkington Volunteer Fire Department.\nTarkington has four other historical markers:\n* At the Old Wells Store at the corner of State Highway 321 and County Road 2274\n* At Ryan Cemetery on State Highway 321 near County Road 300\n* In front of Oak Shade Baptist Church on County Road 2212 (locally known as Oak Shade Road)\n* Near Tarkington Intermediate School on FM 163\nOak Shade Baptist\nOak Shade Baptist Church first came into being on July 4, 1857. Documents show that in July 1857, two missionaries, David Fisher and B.L. Wright, came to the community of Oak Shade, where they began holding religious services in a small log house that also served as the community's school. According to church officials today, the site for the school is just a few miles from the church's current site on FM 2212, though the original building faded into history long ago.\nAccording to a written history of the church by W.M. Kirkham and Edith Kirkham, \"One of the families was the Burton Tarkingtons, who had moved here from Indiana in 1827.\" He is generally credited with being the first white man to settle west of the Trinity River in Liberty County. Moses and Daniel Donahoe came to Texas from Mississippi. Their land grants were certified in 1835. History seems to indicate that Daniel Donahoe donated the land for the Oak Shade Baptist Church and Cemetery. Jordan West was a native of Mississippi. He came to Texas and applied for a land grant. A copy of the original grant shows that he was recommended for it by William Hardin, who was the judge for the jurisdiction of Liberty. Spencer Kirkham was born in North Carolina and married Susanna Neyland in Adams County, Mississippi. He obtained his land grant in May 1835. When he moved to this community, he was a widower with five children. After he came to Liberty County, he married Mrs. Margaret Brown of Lynchburg. He was appointed or elected justice of the peace in 1837. Andrew Jackson Isaacks was born in Jackson, Mississippi. He fought in the Texas Revolution in 1835. After moving to Tarkington Prairie, he became the first postmaster there. He is buried in Oak Shade Cemetery and has a historical marker on his grave. The first pastor of Oak Shade Baptist Church was the Reverend Austin Ellis, whose family settled in Liberty County in 1836. He was a pastor of the church from 1857 to 1860, usually preaching only one service a month. He also is recorded as one of the pastors of another historical church in Liberty County - Concord Baptist Church near Rye. In 1867, the Reverend D.D. Foreman was named pastor. He continued his work for the church until 1872. In the church records, Foreman is mentioned as having rescued the Indians of East Texas from dying of starvation and fever. It reads as follows: \"He organized a wagon train to bring these Indian friends to Liberty County. The year was approximately 1851. They settled on the Trinity River and remained there until they moved back to East Texas on a reservation furnished by the government.\"\nThe 1870s continued to be lean years for Oak Shade Baptist Church. The Reconstruction period that followed the Civil War put a tremendous hardship on early settlers. The 1870s also brought about the birth of a new church in the area - Rural Shade Baptist Church. The addition of this second church in the community affected Oak Shade Baptist Church because many of its members pulled their membership from the church to move to the new church.\nIn 1881, after being without a pastor for two years, Oak Shade Baptist Church was invigorated and a small one-room building was built for the purpose of a church sanctuary. The small building is near where the church stands today. Twenty five years later, the church building was replaced by a high-ceilinged white frame church building. The new building allowed the church to serve independently of the school, as there was a separate building for a school house.\nIn 1918, an influenza epidemic brought death to several members of the congregation. They were buried in the cemetery behind the church. Another twenty years went by before a new construction project would become necessary for the church, and in 1939, the old church building was torn down and a new church was built.\nIn 2005, Oak Shade Baptist Church was named as the \"East Texas Best Church\" as voted by readers of local publications covering four counties.\nEducation\nK-12 educational services are provided by Tarkington ISD.\nResidents of Tarkington ISD (and therefore Tarkington Prairie) are zoned to Lone Star College (formerly North Harris-Montgomery Community College).\nReferences\nlinks\n*\n*[http://www.tarkingtonvfd.org/ Tarkington Volunteer Fire Department] - Tarkington Volunteer Fire Department"
    }
  ]
}