{
  "content": [
    {
      "type": "text",
      "text": "# Tarome, Queensland\n\n| pop                 = 135\n| pop_year            =\n| pop_footnotes       =\n| established         =\n| postcode            = 4309\n| area                = 115.6\n| timezone            = AEST\n| utc                 = +10:00\n| dist1               = 24.4\n| dir1                = W\n| location1           = Boonah\n| dist2               = 60.6\n| dir2                = SW\n| location2           = Ipswich\n| dist3               = 62.8\n| dir3                = W\n| location3           = Beaudesert\n| dist4               = 74.7\n| dir4                = NE\n| location4           = Warwick\n| dist5               = 99.7\n| dir5                = SW\n| location5           = Brisbane\n| lga                 = Scenic Rim Region\n| stategov            = Scenic Rim\n| fedgov              = Wright\n| near-n              = Moorang\n| near-ne             = Frazerview\n| near-e              = Aratula\n| near-se             = Mount Edwards\n| near-s              = Clumber\n| near-sw             = Tregony\n| near-w              = Goomburra\n| near-nw             = Townson\n}}\nTarome is a rural locality in the Scenic Rim Region, Queensland, Australia. In the , Tarome had a population of 135 people.\nGeography\nThe locality is bounded to the west by the ridge line of the Great Dividing Range forms part of the western boundary and to the south by the Cunningham Highway.\nWarrill Creek rises in the locality and flows to the north-east. Part of the upper catchment of the Bremer River is also in the locality.\nHistory\nTarome State School opened on 24 February 1915. It closed on 18 December 1992. It was at 972 Tarome Road ().\nDemographics\nIn the , Tarome had a population of 118 people. The locality contains 46 households, in which 53.3% of the population are males and 46.7% of the population are females with a median age of 44, 6 years above the national average. The average weekly household income is $1,224, $214 below the national average. 4.9% of Tarome's population is either of Aborigional or Torres Strait Islander descent. 57.3% of the population aged 15 or over is either registered or de facto married, while 42.7% of the population is not married. 30.3% of the population is currently attending some form of a compulsory education. The most common nominated ancestries were Australian (32.5%), English (23.3%) and German (20.2%), while the most common country of birth was Australia (87.9%), and the most commonly spoken language at home was English (90.9%). The most common nominated religions were No religion (22.9%), Anglican (15.3%) and the Uniting Church (14.4%). The most common occupation was a manager (48.9%) and the majority/plurality of residents worked 40 or more hours per week (61.5%).\nIn the , Tarome had a population of 135 people.\nHeritage listings\nTarome has the following heritage-listed sites:\n* Allan Cunningham Monument, Cunningham Highway, Cunningham's Gap ()\nEducation\nThere are no schools in Tarome. The nearest government primary school is Aratula State School in neighbouring Aratula to the east. The nearest government secondary school is Boonah State High School in Boonah to the east.\nReferences\nFurther reading\n*\nExternal links"
    }
  ]
}