{
  "content": [
    {
      "type": "text",
      "text": "# TASKING\n\n}}\nTASKING GmbH is a German company that provides embedded software development tools and is headquartered in Munich, Germany.\nHistory\nFounded as a software consulting company in 1977, TASKING developed its first C compiler in 1986. In 1988, its first embedded toolset for the 8051 family of single-chip microcontrollers was launched. The company merged with Boston System Office (BSO) in 1989 and shortly later developed a second-generation compiler designed to support the C166 and DSP56K.\nIn 1998, TASKING partnered with Infineon Technologies to develop the first TriCore development software. Altium acquired TASKING in 2001, and began working on its third-generation compiler technology, the Viper compiler. This compiler was designed to increase the speed and code efficiency of the TriCore development toolset.\nThe C166 toolset was upgraded to third-generation compiler technology in 2006. In 2014, a compiler for the Renesas RH850 family and an Automotive Safety Support Program (Safety Kit) for ISO 26262 certification were introduced. The TASKING TriCore toolset received an update in 2015 and another update in 2017. These are optimization updates, though the focus was on additional support for the Infineon AURIX and Infineon AURIX 2G multi-core processors.\nIn 2016, the Safety Checker product was released. Safety Checker provides static code analysis to verify that no unauthorized access to protected memory occurs. In 2017, the VX Toolset for TriCore v6.2 with a stand-alone embedded debugger was released.\nProducts\nTASKING provides embedded software development tools for the following processors and others:\n* Infineon TriCore/AURIX\n* Infineon/ST Micro C166/ST10\n* Freescale Qorivva\n* STMicroelectronics SPC 5\n* Renesas RH850\n* Bosch GTM-IP MCS (generic timer module)\n* 8051\nThe VX Toolset contains a set of tools for developing and troubleshooting software for the TriCore, AURIX, and AURIX 2G processors from Infineon Technologies. This package includes C/C++ compilers for the TriCore, C compilers for the Generic Timer Module (GTM), Hardware Safety Module (HSM), 8051 (SCR), and Peripheral Co-Processor (PCP). Additional tools include a pin mapper, debugger, linker, and assemblers.\nNon-compiler tools:\n* Safety Kit  an ISO 26262 qualification program that inspects software and its intended application\n* Safety Checker  automatically detects interference between software elements with different Automotive Safety Integrity Level (ASIL) by checking access restrictions on the memory of single- and multi-core systems\n* Stand-alone Embedded Debugger\nSee also\n* List of EDA companies\n* Electronics\n* Electronic engineering\n* FPGAs\n* Embedded systems\n* Skaylink\nReferences\nFurther reading\n* [https://www.heise.de/developer/meldung/TASKING-C-Compiler-in-Eclipse-integriert-2070820.html TASKING-C-Compiler in Eclipse integriert]\n* [https://www.elektronikpraxis.vogel.de/tasking-compiler-technologie-gratis-zum-testen-a-501472/ TASKING-Compiler-Technologie gratis zum Testen]\n* [https://www.elektroniknet.de/elektronik/elektronikfertigung/europaeischer-hauptsitz-nun-in-muenchen-135595.html Europäischer Hauptsitz nun in München]\n* [https://www.elektronik-informationen.de/tasking-vx-toolset-in-neuer-version/150/23272/348044 Tasking-VX-Toolset in neuer Version].\n* [https://www.electronicsweekly.com/news/products/software-products/altium-tasking-tricore-vx-toolset-v3-2-for-embedded-software-2009-03/ Altium Tasking TriCore VX-toolset v3.2 for embedded software development]\n* [https://www.businesswire.com/news/home/20050222005870/en/Altium-Offers-TASKING-TriCore-VX-toolset-v2.2-Supporting Altium Offers TASKING TriCore VX-toolset v2.2 Supporting Infineon Technologies; Viper Compiler Technology Continues to Ramp Up Code Performance and Execution Speed].\n* [https://www.channel-e.de/nachrichten/article/tasking-c-compiler-fuer-mcus-mit-power-architektur.html Tasking C Compiler für MCUs mit Power-Architektur]"
    }
  ]
}