{
  "content": [
    {
      "type": "text",
      "text": "# Tatiana Warsher\n\n| birth_place        =\n| death_date         = 1960 (aged 79–80)\n| death_place        =\n| death_cause        =\n| occupation         =\n|known_for=| awards             =\n| education          =\n| thesis_year        =\n| discipline         = Archaeology\n| sub_discipline     = Roman archaeology\n| workplaces         =\n|notable_works=Codex Topographicus Pompeianus}}\nTatiana Warsher (, 1880–1960) was a Russian archaeologist known for her studies of Pompeii, especially her 40-volume Codex Topographicus Pompeianus.\nEarly life and family\nTatiana Sergeyevna Warsher was born in Moscow on , to a Russian noble family of Jewish origin. Her father, Sergey Adamovich Warsher (1854–1889), was a literary historian specialising in Shakespeare, and her grandfather was a renowned church architect. Her mother, Nina Depelnor, was of French descent. Sergey Warsher died when Tatiana was eight years old, after which the family was supported by her mother's friend Pavel Milyukov, a liberal politician and amateur archaeologist, who became a surrogate father to the young Tatiana.\nSaint Petersburg and Riga (1898–1917)\nWarsher attended the Bestuzhev Courses, a women's college in Saint Petersburg, between 1898 and 1901. There she studied under ancient historian Mikhail Rostovtzeff. Through Milyukov, she was also introduced to the circle of liberal intellectuals in Saint Petersburg. In 1900, she was involved in a controversy surrounding The Smugglers (), an antisemitic play by Savely Litvin and Viktor Krylov. A group of Saint Petersburg students attempted to prevent the premiere of the play at the Suvorin Theatre, causing the first in a series of riots. In the aftermath many of the student protestors were arrested and expelled; Warsher narrowly avoided expulsion after her professors interceded on her behalf.\nIn 1907 Warsher moved to Riga, where she worked as a teacher. In 1911, she married a local doctor, Suslov. For their honeymoon, the couple visited Pompeii, and Warsher took her first pictures of the excavations there. Two years later her husband died suddenly, and Warsher returned to Saint Petersburg. There she continued her studies of archaeology with Rostovtzeff, but her main focus was politics and journalism. She became involved with Milyukov's Constitutional Democratic Party (also known as the Kadets) and wrote about political issues. She also remarried, to the widowed brother of her first husband, in order to help raise his children.\nRussian Civil War and move to Berlin (1917–1923)\nFollowing the Russian Revolution the Kadet party was suppressed and Milyukov fled Russia. Warsher's second husband was executed by the Bolsheviks in 1917 for supporting the White Movement. Warsher herself fled north for the duration of the Russian Civil War (1917–1922). She taught at girls schools in Riga and Dorpat—now independent from Russia as part of Latvia and Estonia respectively—and Archangelsk, which was controlled by the Whites until 1920. She also worked in the editorial offices of Segodnya (), a Russian-language newspaper in Riga, and was a correspondent for the Berlin-based Rul () and Parisian Posledniye Novosti. In 1923 she published her memoirs of the revolution and war years as a book.\nWith the Bolshevik victory in the Civil War, Warsher finally left Russia permanently. She gave a farewell public lecture in Riga, on the excavations at Pompeii, before leaving for Berlin in February 1922. There she studied at the University of Berlin under Franz Noack and Gerhart Rodenwalt, two noted scholars of Pompeii. In 1923, she met with Mikhail Rostovtzeff, her former teacher in Saint Petersburg and now fellow white émigré, in Paris. Rostovtzeff encouraged her to move to Italy to pursue her interest in Pompeii. He arranged for her to work with the German Archaeological Institute and the American Academy in Rome, and also introduced her to the lead excavator of Pompeii, .\nReferences"
    }
  ]
}