{
  "content": [
    {
      "type": "text",
      "text": "# Tatto Suwarto Pamuji\n\n|birth_place = Cilacap, Central Java, Indonesia\n|party = Golkar\n}}\nTatto Suwarto Pamuji (born 8 March 1957) is an Indonesian businessman and politician of the Golkar party who served as the regent of Cilacap Regency, Central Java between 2011 and 2022. He was initially vice regent, and replaced the previous regent arrested in 2009 for corruption, Probo Yulastoro. Pamuji was then elected to two further full terms in the 2012 and 2017 regency elections.\nEarly life\nTatto Suwarto Pamuji was born on 8 April 1957 in Cilacap Regency. He completed middle school in Cilacap in 1974, before studying at a technical school in Bandung where he graduated in 1977.\nCareer\nPamuji opened an electronics store in Cilacap in 1982, incorporating it as CV Mandiri Cilacap in 1984. In 1994, he also entered aquaculture. He also became treasurer at several Islamic organizations.\nIn 2007, Pamuji ran as the running mate of Probo Yulastoro in Cilacap's regency election with the support of PDI-P. The ticket won the election with 446,589 votes (51.14%). While vice regent, he has supported the splitting off of a new West Cilacap Regency from the current regency. On 2 June 2009, Yulastoro was arrested under charges of corruption, and Pamuji became the acting regent. Pamuji requested a governmental audit of the regency budget after the arrest, stating that he \"wanted to start from a clean sheet\". In May 2011, he became the full regent to replace Yulastoro. He was elected to his first full term in the 2012 regency election, winning 555,044 votes (60.25%). He was reelected in 2017, winning 515,059 votes (56.3%).\nPamuji's tenure ended on 19 November 2022 and he was replaced in an acting capacity by , head of Central Java's provincial health department. Following his ceremonial replacement, he walked for  from his former official residence to his home village, citing a vow he had made to say goodbye to the communities he had governed and to see the results of his time in office.\nPamuji is a member of the Golkar party.\nFamily\nHe is married to , who was elected as a Golkar legislator to the House of Representatives in the 2019 Indonesian legislative election. The couple has four children.\nReferences"
    }
  ]
}