{
  "content": [
    {
      "type": "text",
      "text": "# Taube Foundation for Jewish Life & Culture\n\nThe Taube Foundation for Jewish Life & Culture is an American non-profit organization founded in 2003 by Thaddeus N. \"Tad\" Taube in Belmont, California. Its mission is to help support the survival of Jewish life and culture in the face of unprecedented global threat to the Jewish people, especially in Israel; strengthen Jewish identity and sustain Jewish heritage in the United States in the face of assimilation; celebrate current Jewish achievement in all aspects of human endeavor; and work for the reform of Jewish institutions.\nJewish Heritage Initiative in Poland\nIn 2004, the Taube Foundation for Jewish Life & Culture founded the Jewish Heritage Initiative in Poland (JHIP). The Initiative aims to nurture the revival of Jewish life in Poland, further awareness of this resurgence among Jews and non-Jews and foster positive interest in Poland and Polish Jews among American Jews. This mission reinforces the Taube Philanthropies’ broader purpose of sustaining Jewish culture in the aftermath of the Holocaust. The JHIP is a partnership program, made up of founding sponsors and new partners from the United States and Europe.\nJewish life in Poland received an almost mortal blow during the Holocaust committed by Germans in occupied Poland. Decades of Communism followed World War II, see History of Poland (1945–1989). As a result, Jewish schools closed, public programs on Jewish culture were forbidden and only a handful of historians were permitted to study the archives of Polish Jewish history.\nThe fall of Communism in 1989 changed all of this dramatically. Many Poles have learned about their Jewish heritage for the first time and Jewish culture has flourished. The JHIP is supporting institutions and individuals –– in Poland as well as in the United States –– who are helping preserve Jewish heritage or are enriching the cultural and intellectual landscape today. A list of grantees appears on the Taube Foundation for Jewish Life & Culture's [http://taubephilanthropies.org/node/74] website.\nTo further the goals of the JHIP, the Taube Foundation for Jewish Life & Culture has established a base of operations in Warsaw at the Taube Center for the Renewal of Jewish Culture. The Taube Foundation for Jewish Life & Culture is the only American Jewish foundation with an office and ongoing presence in Poland.\nThe Polish Jewish Heritage Program Director is Shana Penn, author and visiting scholar at the Graduate Theological Union's Center for Jewish Studies in Berkeley, California.\nFounder\nTad Taube was the chairman and founder of the Taube Foundation for Jewish Life & Culture. He also served as president of the Koret Foundation. He was chairman and founder of the Woodmont Companies, a diversified real estate investment and management organization. He also served as trustee of the University of Notre Dame de Namur, the University of San Francisco, and as governor of Hebrew University in Jerusalem.\nAt his alma mater, Stanford University, Taube was founder and advisory board chair of the Taube Center for Jewish Studies, which was established in 1986. He was a member of the Board of Overseers of the Hoover Institution and serves on its executive committee, and was founder and past chairman of the advisory board of the Stanford Institute for Economic Policy Research (SIEPR). In addition, Taube was a chair of the Stanford Athletic Board. His involvement in Stanford Athletics included his family's principal gift to Stanford's Taube Family Tennis Stadium and his significant support of Stanford's new football stadium, built in 2006. Taube died September 13, 2025.\nSee also\n*Timeline of Jewish Polish history\n*List of Polish Jews\n*Jewish history\n*Jewish ethnic divisions\n*Jewish Culture Festival\n*Lauder – Morasha School\nReferences\n* http://central.ujcfedweb.org/page.aspx?id=142769\n* https://web.archive.org/web/20090302083437/http://www.koretfoundation.org/about/board.html\n* https://web.archive.org/web/20120513044318/http://jta.org/news/article/2007/06/20/102550/polandmuseum\nExternal links\n*[http://www.taubephilanthropies.org Taube Philanthropies]\n*[http://www.tadtaube.com/ Tad Taube Personal Website]\n*[http://projects.propublica.org/nonprofits/organizations/943244838 Taube Foundation for Jewish Life and Culture] at ProPublica\n*[https://www.timesofisrael.com/topic/tad-taube/ Tad Taube Content]\n*[https://jewishstudies.stanford.edu/news/congratulations-tad-taube Jewish Studies Award]\n*[https://sfi.usc.edu/profiles/tad-taube Tad Taube Shoah Foundation]\n*[https://www.groco.com/radio/the_art_of_philanthropy.aspx Tad Taube Art of Philanthropy]\n*[https://www.elcaminohospital.org/newsroom/local-philanthropists-commit-10-million-mental-health-programs-el-camino-hospital Tad Taube Donation]"
    }
  ]
}