{
  "content": [
    {
      "type": "text",
      "text": "# Taurida Soviet Socialist Republic\n\n|common_name = Taurida\n|subdivision=Socialist republic\n|nation  = Soviet Russia\n|p1 = Crimean People's Republic\n|flag_p1 = Flag of Crimean People's Republic 1917.svg\n|s1 = Crimean Regional Government\n|flag_s1 = Flag of the Crimean Regional Government.svg\n|image_flag = Socialist red flag.svg\n|flag_type = Flag\n|capital = Simferopol\n|government_type = Soviet republic\n|title_deputy   = Head of government\n|deputy1 = Anton Slutsky\n|year_deputy1 = 1918\n|title_leader= Head of state\n|leader1 = Jan Miller\n|year_leader1 = 1918\n|legislature = Council of People's Commissars\n|era = Aftermath of World War I\n|event_pre = Fall of the Crimean People's Republic\n|date_pre = January 1918\n|event_start = Republic established\n|date_start = 19 March\n|year_start = 1918\n|event1 = German-Ukrainian invasion of Crimea / Crimean Tatars uprising\n|date_event1 = April 1918\n|event_end = Republic dissolved\n|date_end = 30 April\n|year_end = 1918\n|today =\n|demonym                =\n|image_map              = Taurida Soviet Socialist Republic Map.png\n| image_map_caption      = Map of the Taurida Soviet Socialist Republic in March 1918 (in green)\n}}\nThe Taurida Soviet Socialist Republic () was an unsuccessful attempt to establish a Soviet republic situated in the Crimean Peninsula part of Soviet Russia. The republic was established by Bolsheviks Jan Miller and Anton Slutsky who previously participated in the Petrograd Bolshevik Revolution.\nIt existed from 19 March to 30 April 1918 and was recognised by the Russian SSR.\nHistory\nDisbandment of the Crimean National Republic\nFollowing the 1917 October Revolution, the ethnic Tatar government proclaimed the Crimean People's Republic on 13 December 1917. In January 1918, however, it was overrun by Bolshevik forces. In Simferopol, a guberniya revkom was established which, however, did possess sufficient authority as the military center continued to be located in Sevastopol.\nTo liquidate this dual authority on February 10–12, 1918 there took place a conference of revkoms at which participated 44 delegates (including 27 Bolsheviks). The conference was later recognized as an extraordinary congress of the Soviets of Workers and Soldiers Deputies. At the meeting, it was decided to create 14 commissariats. The Congress also confirmed the disbandment of the Council of People's Representatives and Qurultay. The local administration was transformed into a system of soviets replacing the old system of duma and land administration (zemstvo). The 14-member Central Executive Committee was established as the central administration of guberniya which consisted of 10 Bolsheviks; the rest were Left SRs. Jan Miller (Bolshevik) was appointed as chairman of the committee.\nThe Congress, with 23 votes \"for\" and 20 \"against\", decided that the administrative center would be in Simferopol rather than Sevastopol, while the military center, which was subordinated to the central executive committee, was left in Sevastopol. The major administrative and political issues were to be decided by laws adopted at the 3rd All-Russian Congress of Soviets. The Taurida congress also approved the adoption of drastic measures for grain procurement allowing requisition and the use of armed force to bring bread to industrial areas and the army.\nEstablishment of the Soviet Autonomous Republic\nA few weeks later, on 19 and 21 March, decrees of the Taurida Central Executive Committee (CEC) issued in Simferopol established the Taurida Soviet Socialist Republic on the same territory. Areas of Taurida that lay north of Crimea were also claimed by the Donetsk-Krivoy Rog Soviet Republic and the Ukrainian People's Republic.\nWith the assistance of the German Empire, the Taurida Soviet Socialist Republic was quickly overrun by forces of the Ukrainian People's Republic during the Crimean Offensive. By the end of April 1918, the majority of the CEC and the Council of People's Commissars, including council leader Anton Slutsky and local Bolshevik chief Jan Tarwacki, were arrested and shot in Alushta by insurgent Crimean Tatars. On 30 April, the Republic was abolished.\nAftermath\nFollowing the invasion, a German-protected Crimean Regional Government was established under Maciej Sulkiewicz and, later, Solomon Krym.  After the defeat of the White Movement's Volunteer Army and the reassertion of Soviet control in late 1920, the lands of the former Republic were passed to the Crimean Autonomous Soviet Socialist Republic under the Russian SFSR.\nSoviet government\n* Sovnarkom Chairman - Anton Slutsky\n* Narkom on Foreign Affairs and National Issues - İsmail Firdevs (until March 22, Anton Slutsky)\n* Narkom of Internal Affairs - S. Novoselsky\n* Narkom of Land Cultivation (Agriculture) - Arefiev (until March 22, Vano Gogolashvili, later S. Belotserkovets and S. Akimochkin until April 11)\n* Narkom of Military Affairs - F. Kul (on March 26, the commissariat was merged into the Naval Commissariat)\n* Narkom of Navy - Yuri Gaven\n* Narkom of Finance - A. Koliadenko (until March 22, Jan Miller)\n* Narkom of Roads of Communication (Transportation) - S. Korobtsev (since March 22)\n* Narkom of Labor - Fridrikh Shikhanovich\n* Narkom of People's Enlightenment (Education) - Ye. Petrenko (until March 25, D. Skrypnik)\n* Narkom of Charity - Volkov (until March 24 Makarov, March 24 – April 11 Burlaka)\n* Narkom of Health - Kats (since March 24)\n* Narkom of Justice - Vano Gogolashvili (since March 24)\n* Narkom of Post Service and Telegraph - Urbansky (since March 21)\n* Narkom of Food - I. Fedoseyev (March 25 – April 8 D. Skrypnik)\n* Sovnarkom Secretary - D. Skrypnik (since March 25)\n* Sovnarkom Chief of Affairs - N. Viktorov (until end of March, Firsov)\nSee also\n* Russian Civil War\nNotes\nReferences\nExternal links\n*[http://a-pesni.org/grvojna/kr/a-resptavr.php Zarubin, V. Republic of Tuarida: forced experiment? (РЕСПУБЛИКА ТАВРИДЫ: ВЫНУЖДЕННЫЙ ЭКСПЕРИМЕНТ?)]. \"Historical Heritage of Crimea\" magazine. #17, 2006.\n* Nikitina, N. [https://web.archive.org/web/20150226204938/http://www.kr-eho.info/index.php?name=News&op=printpage&sid=10433 To enter immortality, must one die?] Krymskoye Ekho. 5 September 2013"
    }
  ]
}