{
  "content": [
    {
      "type": "text",
      "text": "# Tawaramachi Station (Fukui)\n\n| operator    =\n| line        =  Mikuni Awara Line\n* Fukubu Line\n}}\n| platforms   =  1 side + 1 island platform\n| tracks      = 3\n| distance    = 5.9 km from\n| connections =\n| structure   =\n| code        = E26/F24\n| status      = Staffed\n| website     =\n| opened      =  April 1, 1937\n| closed      =\n| former      =\n| passengers  =\n| pass_year   =\n| services    =\n| map_type    = Japan\n}}\nis a railway station, located in the city of Fukui, Fukui Prefecture, Japan. Two railway companies, Fukui Railway and Echizen Railway, have operated on the same line at the station since 2016.\nLines\nTawaramachi Station is served by the Mikuni Awara Line, and is located 2.1 kilometers from the terminus of the line at . It is also a terminal station of the Fukui Railway Fukubu Line and is 20.9 kilometers from the opposing terminal at .\nStation layout\nThe station consists of one side platform and one island platform connected by a level crossing. The station is staffed.\nPlatforms\n}}\nand }}\nand }}\nAdjacent stations\n|next=}}\n|next=}}\nHistory\nTawaramachi Station was opened on April 1, 1937 as a station on the Mikuni Awara Electric Railway. On September 1, 1942 the Keifuku Electric Railway merged with Mikuni Awara Electric Railway. Operations were halted from April 20, 1944. The station reopened on November 27, 1950, and operations were expanded when the station became a terminus of the Fukui Railway Fukubu Line. On June 25, 2001 the Keifuku Electric Railroad portion of the station closed, and reopened again on  July 20, 2003 as an Echizen Railway station.\nIn 2022, Tawaramachi Station opened a mini-library in its multi-purpose waiting area while renovation took place at the city library nearby.\nSurrounding area\nTawaramachi Station is just to the west of Phoenix-dōri (Prefectural Route 30). Since the University of Fukui's Bunkyō Campus, Hokuriku High School, Fujishima High School and many other educational institutions are located in the vicinity, students are a common sight in mornings and evenings.\nOther points of interest include:\n* Fukui Tawaramachi Post Office\n* Phoenix Plaza\n* Fukui Municipal Gymnasium\n* Fukui City Library\n* Fukui Fine Arts Museum\n* Fukui Prefecture Gokoku Shrine\nSee also\n* List of railway stations in Japan\nReferences\nExternal links\n*"
    }
  ]
}