{
  "content": [
    {
      "type": "text",
      "text": "# Tây Sơn dynasty__disambig_1\n\n| conventional_long_name = Đại Việt\n| common_name            = Tây Sơn dynasty\n| status                 = De jure  Duchy (fief) within Lê dynasty of Đại Việt (1778–1788)Internal imperial system within Qing tributary (1789–1802) Rump state  (1801–1802)\n| era                    =\n| government_type        = Rebel governance (1771–1778)Absolute monarchy (1778–1802)\n| year_start             = 1778\n| year_end               = 1802\n| event_pre              = Tây Sơn rebellion emerged\n| date_pre               = 1771\n| event_start            = Nguyễn Nhạc established Tây Sơn dynasty\n| date_start             =\n| event2                 = Lê dynasty collapsed\n| date_event2            = 3 February 1789\n| event_end              = Nguyễn Ánh captured Đông Kinh\n| date_end               = 18 June\n| legislature            = None (rule by decree)\n| p1                     = Lê dynasty\n| flag_p1                =\n| p2                     = Nguyễn lords\n| flag_p2                = Seal of Nguyễn Lords.svg\n| flag_p3                = Seal of Trịnh Lords (Tĩnh Đô vương 靖都王).svg\n| p3                     = Trịnh lords\n| s1                     = Nguyễn dynasty\n| flag_s1                = Seal of Nguyễn Lords.svg\n| image_flag             =\n| flag_border            = no\n| flag_type              =\n| image_map              = Vietnam in late 18th century (orthographic projection).svg\n| image_map_caption      = Map of Đại Việt in the 1790.\n| image_map2              = Vietnam at the end of 18th century (Vi).png\n| image_map2_caption      = Political division of Vietnam at the end of the 18th century:\n| capital                = Đồ Bàn (1776–1788)Phú Xuân (1788–1801)Bắc Thành (1801–1802)\n| national_motto         =\n| national_anthem        =\n| common_languages       = VietnameseWritten Chữ Nôm script (official)\n| religion               = Vietnamese folk religion, Buddhism, Taoism, Catholicism, Islam\n| leader1                = Thái Đức\n| year_leader1           = 1778–1788\n| leader2                = Quang Trung\n| year_leader2           = 1788–1792\n| leader3                = Cảnh Thịnh (last)\n| year_leader3           = 1792–1802\n| title_leader           = Emperor\n| currency               = Copper-alloy and zinc cash coins\n| today                  = VietnamChinaLaosCambodia\n| demonym                =\n| area_km2               =\n| stat_year1             = 1800\n| stat_area1             =\n| stat_pop1              = unknown, circa 10 million\n| area_rank              =\n| GDP_PPP                =\n| GDP_PPP_year           =\n| HDI                    =\n| HDI_year               =\n| image_coat             = Triều đường chi ấn.svg\n| symbol_type            = Imperial seal\n}}\n| founder = Nguyễn Nhạc\n| final ruler = Nguyễn Quang Toản\n| current head =\n| founding year = 18th century\n| deposition = 1802\n| traditions =\n}}\nThe Tây Sơn dynasty (; , (chữ Hán: 朝西山; Chữ Nôm: 茹西山), officially Đại Việt (Chữ Hán: 大越), was an imperial dynasty of Vietnam. It originated in a revolt led by three peasant brothers with the surname Nguyễn, rebelling against the Lê dynasty, Trịnh lords and Nguyễn lords (no relation). The Tây Sơn would later be succeeded by the Nguyễn dynasty.\nThe Tây Sơn dynasty ended the century-long war between the Trịnh and Nguyễn families, overthrew the Lê dynasty, and united the country for the first time in 200 years. They acknowledged Qing suzerainty and gained recognition from the Qianlong Emperor as the legitimate rulers of Vietnam. Under the most prominent of the Tây Sơn brothers Nguyễn Huệ (Emperor Quang Trung) Vietnam experienced several years of relative peace and prosperity. But Quang Trung died relatively young at the age of 40 and his successor Cảnh Thịnh, aged 9, was unable to prevent civil conflict among the Tây Sơn court which allowed the last Nguyễn lord Nguyễn Ánh to retake the south of Vietnam, extinguish the Tây Sơn and establish the Nguyễn dynasty.\nName\nThe Tây Sơn dynasty was named after the Tây Sơn district in Bình Định province, the birthplace of the three brothers who established the dynasty. The name \"Tây Sơn\" means \"western mountains\" from Chinese 西山 Xīshān where 西 xi means west and 山 shan means mountain.\nHistory\nBackground\n]]\nreceiving Nguyễn Quang Hiển, the peace envoy from Nguyen Hue in Beijing]]\nIn the 18th century, Vietnam was de jure ruled by the Lê dynasty, but real power lay in the hands of two warring families, the Trịnh lords of the north who ruled from the imperial court in Thăng Long and the Nguyễn lords in the south, who ruled from their capital Huế. Both sides warred extensively for control of the country. Life for the peasants during these times was difficult: ownership of land concentrated in the hands of a few powerful landlords as time passed on. The imperial bureaucracy grew corrupt and oppressive; at one point the imperial examination-degrees were sold to whoever was wealthy enough to purchase them. The lords continued to live lavish lifestyles in opulent palaces as the poor grew poorer. While the Trịnh lords had enjoyed peace since the end of the war between the Trịnh and the Nguyễn in 1672, the Nguyễn lords regularly campaigned against Cambodia and later the Kingdom of Siam. While the Nguyễn lords usually won these wars and opened up new fertile lands for the landless poor to settle, the frequent warring cost money, resources, and lives.\nTây Sơn rebellion\nIn 1769 the new king of Siam Taksin launched a war to regain control of Cambodia. He was successful and forced the Nguyễn lords to abandon some of their conquests, such as the Principality of Hà Tiên on the southernmost coast of Vietnam. Lord Nguyễn Phúc Khoát had also died in 1765, which put power in the hands of the regent  Trương Phúc Loan, plunging the Nguyễn court into political crisis. These developments, coupled with heavy taxes and endemic local corruption spurred three peasant brothers—Nguyễn Nhạc, Nguyễn Huệ, and Nguyễn Lữ (no relation to the Nguyễn lords) from the village of Tây Sơn, central Vietnam, to revolt in 1771 against the Nguyễn lord Phúc Thuần.\nThe Tây Sơn brothers styled themselves as champions of the people. Over the next year, the revolt gained traction and they won some battles against the Nguyễn army that was sent to crush their rebellion. The Tây Sơn drew their support from not only poor farmers but also by some indigenous highland tribes. Nguyễn Huệ, the brothers' leader, said that his goal was to end the people's oppression, reunite the country, and restore the power of the Lê emperor in Hanoi. The Tây Sơn also promised to remove corrupt officials and redistribute land.\nFile:BaoSonThienAn TaySon.JPG| Tây Sơn district, where 3 Tây Sơn brothers started their revolution against Nguyễn clan's rule.\nIn 1773 the Tây Sơn captured the port of Qui Nhơn, where the merchants, who had suffered under restrictive laws put in place by the Nguyễn, lent the uprising their financial support. The Nguyễn, at last recognizing the serious scale of the revolt, made peace with the Siamese, giving up some land they had conquered in previous decades. However, their problems were compounded when Trịnh Sâm chose to end the 100-year peace and exploit the turmoil in the south by sending his army to attack Phú Xuân (modern-day Huế), the Nguyễn capital. The Trịnh army captured the city, forcing the Nguyễn to flee to Gia Định (now modern day Saigon).\nThe Trịnh army continued to march south and the Tây Sơn army continued its conquest of other southern cities. The forces arrayed against the Nguyễn were simply too many and in 1776 the Tây Sơn army captured the last Nguyễn stronghold of Gia Định and massacred the town's Chinese population. The entire Nguyễn family was killed at the end of the siege, except for one nephew, Nguyễn Ánh, who managed to escape to Siam. The eldest Tây Sơn brother, Nguyễn Nhạc, proclaimed himself Emperor in 1778. A conflict with the Trịnh thus became unavoidable.\nConflict with Siam\nThe Tây Sơn spent the next decade consolidating their control over the former Nguyễn territory. Nguyễn Ánh proved to be a stubborn enemy. He convinced the King of Siam, P'ya Taksin, to invade Vietnam in support of him. The Siamese army attacked in 1780, but in several years of warfare, it was unable to defeat the Tây Sơn army, as gains were followed by losses. In 1782, the Siamese king was killed in a revolt, and less than a year later, Nguyễn Ánh's forces were driven out of Vietnam. In 1785, Siam launched an invasion again and occupied part of the Mekong Delta, but was defeated by Nguyen Hue in the Battle of Rạch Gầm-Xoài Mút.\nConquest of Trịnh lords\nHaving vanquished the Nguyễn for the time being, Nguyễn Huệ decided to destroy the power of the Trịnh lords. He marched to the north at the head of a large army in 1786, and after a short campaign, defeated the Trịnh army successfully. The Trịnh were also unpopular and the Tây Sơn army seemed invincible. The Trịnh lord fled north into China. Nguyễn Huệ later married princess Lê Ngọc Hân, the daughter of the nominal later Lê Emperor, Lê Hiển Tông.\nOverthrow of Lê dynasty and relationship with Qing dynasty\n, 1793\n]]\nA few months later, realising that his hope of retaining power had gone, the Emperor Lê Chiêu Thống fled north to the Qing Empire of China, where he formally petitioned the Qianlong Emperor for aid. The Qianlong Emperor agreed to restore Lê Chiêu Thống to power, and so in 1788, a large Qing army marched south into Vietnam and captured the capital Thăng Long.\nNguyễn Huệ gathered a new army and prepared to fight the Qing army. He addressed his troops before the battle saying:\nIn a surprise attack, while the Qing army was celebrating the Lunar New Year, Nguyễn Huệ's army defeated them at the Battle of Ngọc Hồi-Đống Đa and forced them, along with Lê Chiêu Thống, to retreat. The Tay Son were supported by Chinese pirates. Anti-pirate activities were undertaken by a joint alliance between the Qing dynasty and Nguyễn lords Gia Long while Chinese pirates collaborated with the Tay Son.\nAfter the battle, Nguyễn Huệ sought to restore the tributary relationship in order to deter a joint Qing-Siam pincer attack and prevent further Qing Chinese attempts to restore the Lê dynasty. Nguyễn Huệ sent a ritually submissive request to the Qianlong Emperor under the name of Nguyễn Quang Bình (also referred to as Ruan Guangping).\nIn 1789, the Qianlong Emperor agreed to re-establish the tributary relationship and enfeoff Nguyễn as the King of Annam on the condition that Nguyễn Huệ personally lead a special delegation to Beijing to celebrate the Qianlong Emperor's 80th birthday. For the Qianlong Emperor, the motivation for accepting the arrangement was to retain the Qing's supremacy and stabilize their southern border. Chinese and Vietnamese sources agreed that Nguyễn Huệ sent an imposter with a delegation to Beijing, where they were received with lavish imperial favors. The Qianlong Emperor approved the proposal and bestowed Nguyễn Huệ with the title An Nam quốc vương (\"King of Annam\"). The title indicated that Nguyễn Huệ was recognized as the legal ruler of Vietnam and Lê Chiêu Thống was no longer supported.\nWar with Nguyễn Ánh and fall\nQuang Trung, was resentful. He trained his army, built large warships and waited for an opportunity to take revenge. He also provided refuge to organizations such as the Tiandihui and the White Lotus. Chinese pirates, such as Chen Tien-pao (陳添保), Mo Kuan-fu (莫觀扶), Liang Wen-keng (梁文庚), Fan Wen-tsai (樊文才), Cheng Chi (鄭七) and Cheng I (鄭一) were granted official positions and noble ranks under the Tây Sơn empire. All attack plans had to be given up due to Nguyễn Huệ's sudden death. The attack never materialized by the time that Quang Trung died in 1792.\nAfter the Tây Sơn massacred ethnic Han Chinese settlers in 1782, the support of the Qing Chinese shifted towards to the Nguyễn lords.\nAfter Quang Trung's death, his son Nguyễn Quang Toản was enthroned as Emperor Cảnh Thịnh at the age of ten. However, the real power was in the hands of his uncle Bui Dac Tuyen, who enacted a massive political purge. Many who served under Quang Trung were executed, while others became discouraged and left the regime, considerably weakening the Tây Sơn. This paved the way for Nguyễn Ánh to capture the entire country within 10 years, with the help of French military adventurers enlisted by French bishop Pigneau de Behaine. In 1800, Nguyễn Ánh occupied Quy Nhơn citadel. In 1801, he occupied Phú Xuân, forcing Nguyễn Quang Toản to flee to Thăng Long. In 1802, Ánh besieged Thăng Long. The then 20-year-old Nguyễn Quang Toản escaped, but then was captured and executed, ending the dynasty after 24 years, and the Nguyễn, the last imperial dynasty of Vietnam, took over the country in 1802.\nThe Nguyễn lords eventually defeated the Tây Sơn dynasty, took complete control of Vietnam, and established the imperial Nguyễn dynasty in 1802. The Nguyễn executed the defeated Tây Sơn leader Bùi Thị Xuân by crushing the body with an elephant. The heart and liver from her body were consumed by soldiers of the Nguyễn.\nSee also\n* Tây Sơn military tactics and organization\n* Ten Great Campaigns\nNotes\nCitations\nBibliography\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*"
    }
  ]
}