{
  "content": [
    {
      "type": "text",
      "text": "# Ted Howard (conservationist)\n\n| image              = Ted Howard at QSM ceremony (cropped).jpg\n| alt                =\n| caption            = Howard in 2022\n| birth_name         = Thomas Edward Howard\n| birth_date         =\n| birth_place        =\n| death_date         =\n| death_place        =\n| education          = University of Auckland\n| alma_mater         =\n| occupation         = Commercial fisherman\n| years_active       =\n| known_for          = Wildlife conservation\n| notable_works      =\n| television         =\n| party              =\n| spouse             = Ailsa McGilvary\n| children           =\n| relatives          =\n| awards             =\n| website            =\n| signature          =\n| signature_alt      =\n}}\nThomas Edward Howard  is a New Zealand conservationist.\nCareer\nHoward has a Bachelor of Science in zoology (marine ecology) from the University of Auckland, where he studied under John Morton.\nHoward has more than 30 years of commercial fishing experience. He began his career in the industry in the Firth of Thames before moving to work based out of Wellington, Greymouth and Nelson. He has coastal and deep-sea maritime qualifications and has worked for the Fishing Industry Board as a technical advisor.\nHoward has also been president of the New Zealand Recreational Fishing Council, an organisation that lobbies for the sustainable management of fisheries in New Zealand, for the benefit of recreational fishers.\nHoward has been chair of the Kaikōura water zone committee, a joint committee of Environment Canterbury and Kaikōura District Council. This committee works with Environment Canterbury staff and members of the local community on water management initiatives in the Kaikōura region.\nHoward has also been president of the Kaikōura Boating Club, and is an office-holder of the Lions Club of Kaikōura.\nIn the 2014 general election, Howard stood as a candidate for the Money Free Party in the Kaikōura electorate, finishing ninth with 72 votes. He stood again in the Kāikoura electorate at the 2020 general election, this time as an independent, receiving 93 votes to finish 11th out of 12 candidates.\nHoward is a former member of the Kaikōura District Council, and in 2016 he stood for election to the position of mayor, finishing fourth.\nConservation work\nHutton's shearwaters\nHoward is one of the trustees and the chair of The Hutton's Shearwater Charitable Trust, formed in October 2008 to promote conservation of the endangered Hutton's shearwater or kaikōura tītī. The bird's range is Australian and New Zealand waters, but it breeds only on mainland New Zealand. Its conservation status is Endangered, because there are just two remaining breeding colonies, both located in the Seaward Kaikōura Range. It is the only seabird in the world that is known to breed in alpine areas.\nIn his role as chair of the Trust, Howard leads conservation measures for the shearwaters, including community initiatives to rescue birds that crash-land at night on streets in Kaikōura. Howard has been involved in establishing and maintaining a new protected breeding area for Hutton's shearwaters on the Kaikōura Peninsula, including a predator-proof fence, man-made burrows, and translocating fledgling birds from the remaining colonies.\nIn 2017, Howard drew attention to the impacts of the 2016 Kaikōura earthquake on the breeding population of shearwaters. He outlined the loss of adult birds and chicks in the alpine colonies, and the increased risk of predation as a result of landslides caused by the earthquake.\nIn November 2019, Howard met with the Prince of Wales during the royal visit to Kaikōura, and discussed the conservation efforts for Hutton's shearwaters.\nBanded dotterel study\nHoward has been closely involved in the study of banded dotterels or pohowera at Kaikōura that was initiated by Ailsa McGilvary in the 2015/16 breeding season to systematically monitor the birds' breeding success. The study has continued over multiple breeding seasons, confirming the poor breeding success, with the leading cause being cat predation of eggs, chicks and adult birds. Howard shares in much of the work of monitoring nests.\nKaikōura marine area management\nHoward was one of the founders of an incorporated society, Te Korowai o Te Tai o Marokura, Kaikōura Coastal Marine Guardians (Te Korowai). The society was formed in 2005 and incorporated in 2008, to develop use and protection strategies and actions for the Kaikōura coast. Howard was part of the work of the society that led to the passing of the Kaikōura (Te Tai o Marokura) Marine Management Act in August 2014. This Act established the Kaikōura marine management area, including a new marine reserve, sanctuaries and protections for whales and fur seals, and established new fishing regulations. It also recognised taiapure (traditional Māori fishing grounds which include areas of special cultural or spiritual significance). Howard is currently a community representative member of Te Korowai.\nIn 2015, Howard was appointed to a statutory role under the Kaikōura (Te Tai o Marokura) Marine Management Act, as a member of the Kaikōura Marine Guardians.\nHonours and awards\nIn the 2022 New Year Honours, Howard and his wife Ailsa McGilvary were each awarded the Queen's Service Medal, for services to conservation, particularly wildlife conservation.\nPersonal life\nHoward is married to Ailsa McGilvary, and is a long-term resident of Kaikōura.\nIn July 2008, Howard was diagnosed with advanced melanoma, and told that there was only a two per cent chance of his surviving another two years. He credits his survival to major changes in diet and lifestyle, including reducing stress and positive thinking.\nReferences\nExternal links\n* [http://www.huttonsshearwater.org.nz/ The Hutton's Shearwater Charitable Trust]\n* [https://www.teamkorowai.org.nz/ Te Korowai o Te Tai ō Marokura]"
    }
  ]
}