{
  "content": [
    {
      "type": "text",
      "text": "# Ted Howard (author)\n\n| birth_place = Ohio\n| death_date  =\n| death_place =\n| alma_mater  =\n| occupation  = Author, social entrepreneur\n| spouse      =\n| children    =\n| website     = [http://democracycollaborative.org/content/ted-howard Democracy Collaborative Homepage]\n| footnotes   =\n}}\nTed Howard (born 1950, Ohio) is a political activist and author. He is the founder and Executive Director of The Democracy Collaborative, as well as chairman of the board of ocean advocacy group Blue Frontier Campaign. He was the Minter Senior Fellow for Social Justice with the Cleveland Foundation from 2010–2014.\nCareer\nHoward has been involved with the Evergreen Cooperatives in Cleveland, Ohio, which was based in part on the Mondragon Cooperatives in the Basque Region of Spain. Characterized in press accounts as \"The Cleveland Model,\" Evergreen is an effort to create green jobs in low-income neighborhoods using the purchasing power of the City's anchor institutions (hospitals, universities, etc.) to create local worker cooperative businesses.\nHoward has co-authored several books with economist Jeremy Rifkin, including Entropy: A New World View, Voices of the American Revolution, and Who Should Play God?. While at The Hunger Project, he and Dana Meadows et al. co-wrote Ending Hunger: An Idea Whose Time has Come.\nHe and the Democracy Collaborative's research director Steve Dubb have collaborated on a number of articles with political economist Gar Alperovitz, most recently \"The Cleveland Model,\" which appeared in The Nation, and \"Cleveland's Worker-Owned Boom\" in Yes Magazine.  Howard is also the co-author of the Democracy Collaborative reports [http://democracycollaborative.org/content/anchor-dashboard-aligning-institutional-practice-meet-low-income-community-needs The Anchor Dashboard: Aligning Institutional Practice to Meet Low-Income Community Needs]  and\n[http://democracycollaborative.org/content/anchor-mission-leveraging-power-anchor-institutions-build-community-wealth The Anchor Mission: Leveraging the Power of Anchor Institutions to Build Community Wealth] .\nIn 2010, Utne Reader magazine named Howard as one of the \"25 Visionaries Who Are Changing Your World\" for his foundation of the Democracy Collaborative. He was named an Innovative Idea Champion in 2010 by CFED.\nReferences\nExternal links\n* [https://books.google.com/books?as_q=Political+Science&num=10&btnG=Google+Search&as_epq=Ted+Howard&as_oq=&as_eq=&as_brr=0&as_pt=ALLTYPES&lr=&as_vt=&as_auth=&as_pub=&as_sub=&as_drrb_is=q&as_minm_is=0&as_miny_is=&as_maxm_is=0&as_maxy_is=&as_isbn=&as_issn= Political science books citing Ted Howard]. Retrieved from Google Books, April 14, 2010.\n* [http://www.urbanitebaltimore.com/sub.cfm?ArticleID=1471&IssueID=83&SectionID=4 \"Keynote: Anchor Man\"] by Marc Steiner. Urbanite Baltimore No. 70, Retrieved April 13, 2010\n* [https://web.archive.org/web/20110201215518/http://www.evergreencoop.com/ Evergreen Cooperatives]\n* [https://archive.today/20121130003137/http://essentialsharingdocs.blogspot.com/2010/08/evergreen-cooperatives-place-based.html/ essential talks (docs) for cultural change, Accessed August 26, 2010]\n* [http://permaculture.tv/evergreen-cooperatives-place-based-strategy-for-worker-cooperative-development/ Permaculture TV – \"Place-Based Strategy for Worker Cooperative Development\" Accessed August 26, 2010]"
    }
  ]
}