{
  "content": [
    {
      "type": "text",
      "text": "# Ted Kennedy 1980 presidential campaign\n\nRon Brown(Deputy campaign manager)  Thomas P. Southwick(Press secretary)\n| receipts     = }}\n| fec_date     =\n| slogan       = Teddy is ready\n| themesong    =\n| chant        =\n| website      =\n}}\nThe 1980 presidential campaign of Ted Kennedy, United States Senator from Massachusetts, was formally launched on November 7, 1979, as Senator Kennedy, the youngest Kennedy brother, announced his intention to seek the Democratic Party nomination for the presidency of the United States in the 1980 presidential election against incumbent President Jimmy Carter.\nKennedy benefited from President Carter's historically low approval ratings, reminiscing of his brothers' presidency and presidential campaigns, and support from the liberal faction of the Democratic Party. However, disorganization and ineffective campaigning allowed Carter to bridge the 2-to-1 polling gap following a rise in his approval rating due to his initial handling of the Iran hostage crisis.\nDespite losing the majority of presidential contests Kennedy rose in the polls and overcame Carter in multiple states following another drop in his approval rating due to his poor handling of the hostage crisis and receiving prominent labor union endorsements. After failing to prevent Carter from gaining enough delegates to cause a brokered convention Kennedy attempted to release the delegates from their voting commitments which also failed. On August 11, 1980, Kennedy ended his campaign at the national convention after failing to have the rules overturned.\nKennedy's campaign was the last attempt by any member of the Kennedy family to gain a party's presidential nomination until Robert F. Kennedy Jr. in the 2024 election. Despite having lost the nomination after leading Carter with a two to one polling advantage Kennedy's speech, \"The Dream Shall Never Die\", was viewed as the highlight of his political career and one of the most influential orations of the era. Kennedy's challenge to Carter was the last time any major candidate opposed an incumbent Democratic president in the primaries, with it being considered one of the major reasons Carter lost the 1980 election. It was the last time any incumbent president lost multiple states to an opponent.\nBackground\nFollowing his brother's victory in the 1960 Presidential election his Senate seat was left open with Ted reaching the minimum age required to serve in the Senate by the time the special election was to be held. Ted won the special election after facing significant primary and general opposition and would be joined in the Senate by Robert F. Kennedy in 1964.\nAfter his eldest brother's assassination, both he and Robert were floated as possible presidential candidates, with Lyndon B. Johnson concerned about the \"Bobby problem\". However, the push for another Kennedy candidate was focused on Robert and only a Draft Bobby campaign was launched in 1964 that gained significant traction in the New Hampshire vice presidential primary, but failed elsewhere. In 1968 Robert ran a presidential campaign, against the advice of Ted who urged him to wait until 1972, that vied with Senator Eugene McCarthy in the Democratic primary until his assassination after winning the California primary. Robert's delegates split and backed multiple different favorite sons and Ted was floated as a replacement for Robert with Governor Michael DiSalle pushing the idea. However, the plan failed to gain traction and Ted only received 12.75 unsolicited delegates of Robert's 393.5 delegates. Ted also considered being the vice presidential nominee, but later declined.\nAfter the Chappaquiddick incident in 1969 it was feared that it would be impossible for him to win a national race and despite calls for him to enter the 1972 race Kennedy chose to not run and instead supported George McGovern. However, in 1976 Kennedy stated that he would be open to a \"genuine draft\" or be the running mate to Hubert Humphrey due to the rise of Jimmy Carter who would most likely not support the agenda of the liberal faction of Democrats.\nCarter administration\nRelations between Kennedy and the Carter administration were strained due to disagreements over policy between the two who both held considerable political power; Kennedy's political celebrity within the party and Carter's holding of the presidency. The debate over healthcare was a point of contention between the two as despite having proposed health care reform that included key features of Kennedy's national health insurance bill and during the 1976 presidential campaign Carter had asked Kennedy to create a bill that would decrease federal spending and retain the role of private insurance companies, but later halted the bill due to budgetary concerns and political caution.\nBy late 1977 Carter reportedly saw Kennedy as a future challenger to his presidency. Ire between the two grew as Carter attempted to prevent Kennedy from gaining more official power in the Senate, including Carter's attempts to change Senator James Eastland's decision to retire to prevent Kennedy from taking over the chairmanship of the Senate Judiciary Committee.\nAnnouncement\nOn October 29, 1979, an official \"Kennedy for President Committee\" was formed causing multiple state level draft committees to disband, but the majority of these committees were restructured into official committees that suffered from a lack of organization. The same day, Kennedy legally became a candidate and informed the Federal Election Commission that the \"Kennedy for President Committee\" would be raising campaign funds on his behalf. On October 30, it was reported that Kennedy would declare his candidacy on November 7 in Boston. After spending the past weeks giving speeches critical of Carter, Kennedy announced on November 7, 1979, his intention to seek the Democratic nomination for president, despite statements made by Kennedy's mentor and Speaker of the House Tip O'Neill saying that he did not expect him to run, in Faneuil Hall, Boston, Massachusetts where he made statements attacking Carter for his \"lack of a clear summons from the center of power\".\nShortly after his announcement a debate between Kennedy and Carter was arranged by The Des Moines Register and the Des Moines Tribune that was to be held two weeks before the Iowa caucus. According to a poll conducted by Time Kennedy was leading with 49% of Democratic voters with Carter behind at 39% and the remaining undecided. Similar results were found in a poll conducted by CBS and The New York Times showing Kennedy at 54% and Carter at 20%. On November 8, the National Conservative Political Action Committee announced that it formed a \"Kennedy Truth Squad\" to publicize Kennedy's legislative history and his actions at Chappaquiddick.\nOn November 4, 1979, he was interviewed by Roger Mudd and was later criticized for his rambling answer to \"Senator, why do you want to be President?\" as Kennedy was holding off his presidential announcement.\nJeffrey Hart described the first week of Kennedy's campaign as a snowman dissolving in early spring due to his poor performance during Mudd's interview. Governor Hugh Carey reportedly did not endorse Kennedy because of the interview, and described him as a plummeting star in private.\nCampaign developments 1979\nNovember\nKennedy conducted his first political rallies in New England and the southern United States. While he was campaigning in the southern United States a poll of 157 Democratic National Committee members was conducted by the American Broadcasting Company that showed Carter with 99, Kennedy with 44, Brown with 2, and 12 undecided.\nIn the early stages of the Iran Hostage Crisis, which had begun on the same day as his interview with Mudd, Kennedy criticized Carter for not having better contingency plans to protect Americans in the Iranian embassies. He also criticized Carter taking no action against rising inflation. However, by mid-November Kennedy stopped attacking Carter's response to the hostage crisis and started to criticize him as a continuation of the presidencies of Richard Nixon and Gerald Ford.\nOn November 18, he held a meeting at his home in Virginia with an invitation to all 104 presidents of AFL–CIO unions in an attempt to gain the organization's endorsement at its convention. The next day he met with leaders of the Communications Workers of America, which had over 600,000 members, where he was praised by the executive board members, but on November 20 the board voted 12 to 5 in favor of giving its endorsement to Carter.\nAlthough Kennedy was a critic of Big Oil, Herbert Schmertz, vice president of public affairs for ExxonMobil, served as a volunteer to help create and lead the $21 million advertisement campaign for Kennedy. Kennedy later stated that Carter's decontrolling of oil would cost Americans $1,000 more per year causing Robert S. Strauss, Carter's campaign manager, to accuse Kennedy of using false information that was contrary to the Congressional Budget Office's estimates.\nDecember\nthat allowed Carter's approval rating to rise above fifty percent.]]\nAlthough Kennedy had initially led Carter in polling up to the announcement of his presidential campaign, Carter's approval rating rose following the start of the Iran hostage crisis and an ABC–Harris poll conducted in November showed Carter leading Kennedy with 42% to 40% with Jerry Brown at 11%. However, Louis Harris stated that Carter's approval rating could fall as President Gerald Ford's had following the Mayaguez incident.\nKennedy criticized Carter for giving asylum to Shah Mohammad Reza Pahlavi in early December leading to bipartisan criticism of Kennedy, and Carter attacked Kennedy for the first time since he announced his candidacy stating that Kennedy's comments would delay the release of American hostages in Iran. Stephen Edward Smith, his brother-in-law and campaign manager, criticized Carter for using the hostage crisis to deflect criticism. A Gallup Poll conducted after Kennedy's statements showed Carter leading him with 50% to 37% with Kennedy's statements and over 70% of Americans approving of Carter's handling of the hostage crisis being cited as major reasons for Carter's rise in polling and in the general election it showed Kennedy narrowly defeating Ronald Reagan by 49% to 44% after polling in October showed him leading Reagan with 64% to 34%.\nOn December 13, he attended the United Mine Workers' convention where he criticized Carter's support of nuclear power and gave support to expanding the use of coal by designing every fossil fuel power plant to be able to burn coal. Despite his fall in polling Kennedy received multiple prominent endorsements in late December with Representative Mo Udall giving his endorsement to Kennedy on December 18, and on December 27, the rest of Massachusetts' congressional delegation endorse him with Senator Paul Tsongas heading the delegation.\nCampaign developments 1980\nJanuary\nOn January 3, 1980, his campaign became eligible for presidential campaign matching funds. Shortly before the debate, conducted by The Des Moines Register and the Des Moines Tribune, was meant to be held, Jimmy Carter announced that he would not be participating and later cancelled all of his appearances in Iowa.\nFormer Representative Allard K. Lowenstein stated that Kennedy was not going to win Iowa and that it would be difficult for him to defeat Carter unless the situations in Iran and Afghanistan changed before the February primaries. On January 21, Carter defeated Kennedy in the Iowa caucuses with almost 60% of the vote and 30 delegates to Kennedy's 15, however former Representative Teno Roncalio stated there \"were still 14 rounds left to go\".\nNearing and following his defeat in Iowa Kennedy restructured his campaign with aides being asked to forgo their paychecks to conserve money, cancelling a national ten-city fundraising tour, ending the usage of his Boeing 727 plane to save $125,000, and removing organization in Illinois, Ohio, and Indiana to move them to New England in preparation for the Maine and New Hampshire primaries. The national campaign staff was decreased from over two hundred to less than seventy five and all of the paid staffers working in Illinois were fired and replaced with volunteer work. A four-day campaign throughout New England was later cancelled due to his commitments in Washington, D.C.\nFebruary\nOn February 5, nine members, including Vice Presidents Ken Bannon, Irving Bluestone, Mark Stepp, and Martin Gerber, of the twenty-five-member board of the United Automobile Workers announced that they would support Kennedy.\nOn February 5, Vice President Walter Mondale stated that Carter's response to the Soviet Union \"proves he has more backbone than Democratic or Republican challengers\" causing Kennedy to reply that \"if he has so much backbone why won't he come up here and start debating\" due to Carter's refusal to debate Kennedy or leave Washington, D.C. Carter's campaign also created five anti-Kennedy radio advertisements criticizing Kennedy for not being able to hold the position of Senate majority whip in 1971 and for voting to cut $885 million from the nuclear submarine program. Kennedy later accused Brown and Carter of working together in an \"unholy alliance\" to defeat him in the Maine caucus.\nLeaked internal memos and documents from the campaign showed that Kennedy was struggling to gain the endorsements of numerous prominent Democratic officials that were now going to Carter instead and how they were worried that Kennedy's position on gun control would hurt him in the Maine caucus among rural voters. On February 10, Carter won the Maine caucus with a plurality of 43.59% for 1,017 delegates at the state convention to Kennedy's 40.16% for 847 delegates at the state convention.\nFollowing the Maine caucus an internal poll of the New Hampshire primary was conducted by Peter Hart and it showed that Carter would win the state in a landslide. On February 26, Carter defeated Kennedy in New Hampshire with 47.08% for 10 delegates to Kennedy's 37.30% for 9 delegates.\nMarch\nFollowing his defeat in New Hampshire, Kennedy decreased the pay of his workers by 50% and spent $270,000 on advertisements in Illinois and New York. On March 4, he easily won his home state Massachusetts with 65.07% giving him 77 delegates to Carter's 34 delegates, but was defeated in a landslide in the Vermont caucus.\nOn March 11, Carter won the Alabama, Florida, Georgia, Hawaii, and Delaware primaries winning a total of 206 delegates to Kennedy's 33. Kennedy performed poorly in all five states with his best performance being in Florida with 23% due to the conservatism of Southern Democrats, but he performed well among Jewish voters in Florida due to a recent United Nations vote that was critical of Israel.\nAlthough it was predicted that Carter would win the Illinois primary's popular vote, Kennedy campaigned in the Chicago area to gain support from urban and minority voters to receive the area's delegates that accounted for one-third of the state's total delegates to lessen the impact of Carter's victory. However, shortly before the primary Kennedy ended all campaign activities to visit and mourn the death of Allard K. Lowenstein. On March 16, Carter narrowly won Puerto Rico with 52% for 21 delegates against Kennedy's 48% for 20 delegates. On March 18, Carter won the Illinois primary in a landslide with over sixty percent of the popular vote and won 165 delegates to Kennedy's 14.\nOn March 22, Carter won the Virginia and Mississippi caucuses in landslides winning over 2,000 state convention delegates while Kennedy received less than 400 and 30 of Mississippi's 32 delegates with the remaining two being uncommitted.\nHowever, despite his multiple defeats beforehand, Kennedy narrowly won Connecticut with 29 delegates to Carter's 25 delegates and New York with 163 delegates to Carter's 118 delegates on March 25. Although Carter had received the black vote in Illinois Kennedy won in all of the majority black congressional districts in New York and received almost eighty percent of the Jewish vote.\nApril to May\nCarter won in Kansas and Wisconsin. In the Louisiana primary Carter won 39 delegates against Kennedy's 12 delegates. Kennedy narrowly won the Pennsylvania primary and received 94 delegates against Carter's 91 delegates. Kennedy won the Michigan caucus and received 71 convention delegates against Carter's 70 convention delegates.\nCarter won Texas. On May 6, Carter won Indiana, North Carolina, and Tennessee while Kennedy won Washington, D.C. On May 13, Carter won Maryland and Nebraska. On May 20, Carter won Oregon and the Michigan state convention chose to have their delegates remain uncommitted at the national convention. On May 27, Carter won Arkansas, Idaho, Kentucky, and Nevada.\nJune to July\nOn June 3, Kennedy won the California, New Jersey, New Mexico, Rhode Island, and South Dakota primaries and Carter won the Montana, Ohio, and West Virginia primaries. However, Carter won enough delegates to pass the minimum 1,666 delegates needed to win on the first ballot with the final delegate total being 1,948 for Carter and 1,215 for Kennedy. Despite it now being mathematically impossible for Kennedy to win the presidential nomination he announced that he would not drop out of the race.\nOn June 20, Kennedy criticized the initial draft of the Democratic Party's 1980 platform as it did not address \"the anxieties and fears of the American people\" and asked for revisions to the economic plans. Although some of his proposed ideas were accepted in the final version of the platform the majority of his suggestions were rejected.\nOn July 1, Kennedy was interviewed at his Senate office and stated that he could concede to Carter if he would support a $12.6 billion employment program and other anti-recession expenditures. Although members of Carter's campaign had criticized Chicago Mayor Jane Byrne for being the only mayor of a major city to support Kennedy, a meeting was held between Byrne and Secretary of Housing and Urban Development Moon Landrieu and former DNC Chairman Robert S. Strauss that was alleged to be an attempt to gain her endorsement from Kennedy or for the general election after the convention.\nIn mid-July, the Democratic Rules Committee voted to require delegates to vote for their pledged candidates on the first ballot was approved by a vote of 87.25 to 65.5. On July 31, John B. Anderson suggested that he would drop out of the presidential election if Kennedy won the Democratic nomination after a private meeting was held between both of the candidates.\nAugust\nOn August 1, Kennedy stated that Carter was treating the delegates like robots and that the nominee might as well be chosen by mail order ballot if the convention was not open. Morley Winograd, who served as the chairman of the Commission on Presidential Nomination and Party Structure when the rule that all delegates are bound on the first ballot and now served as a Michigan delegate for Kennedy, criticized the roll call vote and the method of how the rule was passed citing the three minute debate time limit and that the commission was focused on more important issues at the time. On August 5, Senator Henry M. Jackson gave his support to an open convention and stated that Kennedy would have an easier time defeating Ronald Reagan.\nOn August 6, Kennedy gave a speech in Washington, D.C. where he stated that he would not endorse Carter unless he accepts some of his economic policies and that he would give a speech in favor of his policies at the convention. Shortly before the convention convened Kennedy spent the remaining days campaigning in New York City and released a list of seven possible vice presidential running mates that consisted of Senator Henry M. Jackson, Governor Reubin Askew, Mayor Tom Bradley, Representative Lindy Boggs, Secretary of Education Shirley Hufstedler, Representative L. Richardson Preyer, and Senator Adlai Stevenson III. However, Askew, who was selected to replace Florida Governor Bob Graham who had rejected serving as Kennedy's running mate, later stated that he was not interested in serving as vice president.\nThe Democratic delegates voted to enforce the rules to bound all delegates on the first ballot on the first day of the convention on August 11. One hour and twenty three minutes later Kennedy announced that he was ending his presidential campaign. Representative Barbara Mikulski was given the role of nominating Kennedy at the national convention and the delegates bound to Kennedy either voted for Kennedy, another candidate, or abstain in both the presidential and vice presidential ballots in protest.\nPlatform\nDomestic policy\nDuring the drafting of the Democratic Party's 1980 platform, Kennedy proposed that planks in favor of a $12 billion recession program, wage-price controls, and gasoline rationing be added. He also proposed that the United States should phase out the usage of nuclear power and replace it with coal and solar power. However, the Democratic Platform Committee rejected all of these proposals.\nKennedy supported abortion rights and the Equal Rights Amendment. Stronger support for both positions was included into the 1980 Democratic platform.\nForeign policy\nOn December 1, 1979, Kennedy criticized the foreign relationship the United States held with Shah Mohammad Reza Pahlavi stating that it \"reminds us that we cannot entrust our fortunes to regressive regimes that may become casualties at any moment\" and against giving the Shah asylum. He also stated that the United States should help create a peace agreement between Israel and Egypt, but to not force the Israelis to accept insecure borders and that they should not negotiate with the Palestine Liberation Organization.\nOn December 13, 1979, he gave a speech at a fundraising dinner in New York where he stated that he was in favor of increasing foreign aid to Israel by $350 million in response to inflation lowering the value of the United States dollar.\nKennedy's proposal for ending the Soviet–Afghan War involved both the United States and Soviet Union agreeing not to intervene in Afghani affairs, to create a coalition government, an initial withdrawal of 20,000 Soviet soldiers for a future total withdrawal, and that both nations would not have military alliances with Afghanistan.\nEndorsements\n*Brotherhood of Railway, Airline, Steamship Clerks, Freight Handlers, Express and Station Employees\n*International Association of Machinists and Aerospace Workers, AFL–CIO/CLC trade union\n*International Union of Police Associations, trade union\n*New York State United Teachers, teachers union affiliated with the AFT\n*United Automobile Workers\n*United Paperworkers Union\nCabinet members\n*Stewart Udall, 37th United States Secretary of the Interior (1961–1969)\n*Roswell Gilpatric, 10th United States Deputy Secretary of Defense (1961–1964)\nU.S. Congress\n*George McGovern, Senator from South Dakota (1963–1981)\n*Howard Metzenbaum, Senator from Ohio (1974; 1976–1995)\n*Edmund Muskie, Senator from Maine (1959–1980)\n*Paul Tsongas, Senator from Massachusetts (1979–1985)\n*Harrison A. Williams, Senator from New Jersey (1959–1982)\n*Richard Clark, former Senator from Iowa (1973–1979)\n*William Hathaway, former Senator from Maine (1973–1979)\n*Les Aspin, Representative from Wisconsin's 1st congressional district (1971–1993)\n*Eugene Atkinson, Representative from Pennsylvania's 25th congressional district (1979–1983)\n*Edward Boland, Representative from Massachusetts's 2nd congressional district (1953–1989)\n*Shirley Chisholm, Representative from New York's 12th congressional district (1969–1983) and 1972 presidential candidate\n*Cardiss Collins, Representative from Illinois's 7th congressional district (1973–1997)\n*Brian J. Donnelly, Representative from Massachusetts's 11th congressional district (1979–1993)\n*Robert Drinan, Representative from Massachusetts's 4th congressional district (1971–1981)\n*Joseph D. Early, Representative from Massachusetts's 3rd congressional district (1975–1993)\n*Walter Fauntroy, delegate to the United States House of Representatives from District of Columbia's at-large congressional district (1971–1991)\n*Wayne Hays, Representative from Ohio's 18th congressional district(1949–1976)\n*Ed Markey, Representative from Massachusetts's 7th congressional district (1976–2013)\n*Nicholas Mavroules, Representative from Massachusetts's 6th congressional district (1979–1993)\n*Joe Moakley, Representative from Massachusetts's 9th congressional district (1973–2001)\n*Rick Nolan, Representative from Minnesota's 6th congressional district (1975–1981)\n*Henry S. Reuss, Representative from Wisconsin's 5th congressional district (1955–1983)\n*James Shannon, Representative from Massachusetts's 5th congressional district (1979–1985)\n*Paul Simon, Representative from Illinois's 24th congressional district (1975–1985)\n*Gerry Studds, Representative from Massachusetts's 12th congressional district (1973–1997)\n*Mo Udall, Representative from Arizona's 2nd congressional district (1961–1991) and 1976 presidential candidate\n*Herman Badillo, former Representative from New York's 22nd congressional district and New York's 21st congressional district (1971–1977)\n*Arnold Olsen, former Representative from Montana's 1st congressional district (1961–1971)\n*Wayne Owens, former Representative from Utah's 2nd congressional district (1973–1975)\n*Teno Roncalio, former Representative from Wyoming's at-large congressional district (1965–1967; 1971–1978)\nState officials\n*Joseph E. Brennan, 70th Governor of Maine (1979–1987)\n*Patrick Lucey, 38th Governor of Wisconsin (1971–1977)\n*Thomas P. O'Neill III, 65th Lieutenant Governor of Massachusetts (1975–1983)\n*Thomas P. Salmon, 75th Governor of Vermont (1973–1977)\n*Joan Growe, 19th Secretary of State of Minnesota (1975–1999)\n*Bill Christiansen, 25th Lieutenant Governor of Montana (1973–1977)\n*Frank Murray, 14th Secretary of State of Montana\n*James A. Guest, 33rd Secretary of State of Vermont (1977–1981)\n*Tom Miller, 31st Attorney General of Iowa (1979–1991)\n*Byron Dorgan, 18th North Dakota Tax Commissioners (1969–1981)\n*Neil Abercrombie, Hawaii state senator (1980–1986)\n*Georgette Berube, Maine state representative\n*Ben Cayetano, Hawaii state senator (1979–1986)\n*Robert Vincent Daniels, Vermont state senator (1973–1982)\n*Barney Frank, Massachusetts state representative (1979–1981)\n*Steve Fowler, Nebraska state senator\n*Don Geis, former Nebraska state senator\n*Dan Harrington, Montana state representative (1977–2001)\n*Hans Jensen, former Nebraska state senator\n*Rodger McDaniel, Wyoming state senator\n*Mary Najarian, Maine state representative\n*David Travis, Wisconsin assemblyman (1979–2009)\n*Steve Waldron, Montana state representative (1977–1985)\n*Don Wesely, Nebraska state senator (1979–1999)\n*Dudley Dudley, member of the Executive Council of New Hampshire from the 3rd district\n*Michael Dukakis, 65th Governor of Massachusetts (1975-1979)\nU.S. municipal officials\n*Jane Byrne, 50th Mayor of Chicago (1979–1983)\n*Francis J. Cain, 35th Mayor of Burlington, Vermont (1965–1971)\n*Richard Fulton, 2nd Mayor of Nashville (1975–1987)\n*William J. Green III, 94th Mayor of Philadelphia (1980–1984)\n*Earle Grueskin, 46th Mayor of Sioux City (1968–1970)\nNotable individuals\n*Louis W. Antisdel, chairman of the Tioga County Democratic Party\n*Arthur Ashe, tennis player\n*Lauren Bacall, actress\n*Warren Beatty, actor\n*Carroll O'Connor, actor\n*Midge Costanza, presidential advisor to President Carter\n*Joe Crangle, chairman of the Erie County Democratic Committee\n*Morris Dees, national finance director for Carter's 1976 presidential campaign\n*Angie Dickinson, actress\n*Myer Feldman, 8th White House Counsel (1964–1965)\n*Douglas Fraser, 6th President of the United Auto Workers (1977–1983)\n*Henry Fonda, actor\n*Roland B. Gittelsohn, president of the Association of Reform Zionists of America\n*Tim Hagan, chairman of the Cuyahoga County Democratic Party\n*Michael Harrington, author of The Other America\n*Norman Mailer\n*Arnold Miller, President of the United Mine Workers\n*Patsy Mink, President of the ADA (1978–1981) and former Representative from Hawaii (1965–1977)\n*Phyllis Newman, actress\n*Russell F. Niquette, 1960 Vermont gubernatorial nominee\n*Alexander M. Schindler, president of the Union of American Hebrew Congregations\n*Arthur M. Schlesinger Jr., historian\n*Martin Sheen, actor\n*Jerry Wurf, president of the American Federation of State, County and Municipal Employees\n}}\nCampaign finance\n{| class=\"wikitable sortable\" style=\"font-size:90%;text-align:center;\"\n! rowspan=\"2\"| Candidate\n! colspan=\"8\"| Campaign committee\n|-\n! Raised\n!\n!\n!\n! Spent\n|-\n|\n| $16,862,212.00\n| $263,129.00\n| $5,002,448.00\n| $3,862,555.00\n| $16,735,701.00\n|}\n{| class=\"wikitable sortable\" style=\"font-size:90%;text-align:center;\"\n! rowspan=\"2\"| State/territory\n! colspan=\"6\"| Campaign fundraising and spending by state/territory\n|-\n! data-sort-type=currency |\n! data-sort-type=currency |\n! data-sort-type=number |\n! data-sort-type=currency | Spent\n|-\n|\n| $17,670.00\n| $1,045.00\n| 5.91%\n| $200.00\n|-\n|\n| $6,950.00\n| $0.00\n| 0.00%\n| $0.00\n|-\n|\n| $13,850.00\n| $0.00\n| 0.00%\n| $20.00\n|-\n|\n| $658,185.00\n| $2,796.00\n| 0.42%\n| $1,788.00\n|-\n|\n| $17,600.00\n| $0.00\n| 0.00%\n| $0.00\n|-\n|\n| $7,900.00\n| $200.00\n| 2.53%\n| $0.00\n|-\n|\n| $199,771.00\n| $275.00\n| 0.14%\n| $831,422.00\n|-\n|\n| $213,082.00\n| $410.00\n| 0.19%\n| $200.00\n|-\n|\n| $11,300.00\n| $0.00\n| 0.00%\n| $0.00\n|-\n|\n| $12,346.00\n| $0.00\n| 0.00%\n| $0.00\n|-\n|\n| $10,750.00\n| $150.00\n| 1.40%\n| $250.00\n|-\n|\n| $10,100.00\n| $0.00\n| 0.00%\n| $0.00\n|-\n|\n| $411,401.00\n| $1,550.00\n| 0.38%\n| $5,175.00\n|-\n|\n| $23,670.00\n| $0.00\n| 0.00%\n| $0.00\n|-\n|\n| $10,808.00\n| $585.00\n| 5.41%\n| $0.00\n|-\n|\n| $25,950.00\n| $0.00\n| 0.00%\n| $0.00\n|-\n|\n| $3,900.00\n| $0.00\n| 0.00%\n| $0.00\n|-\n|\n| $19,298.00\n| $0.00\n| 0.00%\n| $0.00\n|-\n|\n| $8,600.00\n| $0.00\n| 0.00%\n| $0.00\n|-\n|\n| $112,526.00\n| $475.00\n| 0.42%\n| $0.00\n|-\n|\n| $622,388.00\n| $650.00\n| 0.10%\n| $1,225.00\n|-\n|\n| $64,515.00\n| $400.00\n| 0.62%\n| $150.00\n|-\n|\n| $32,260.00\n| $810.00\n| 2.51%\n| $175.00\n|-\n|\n| $7,850.00\n| $0.00\n| 0.00%\n| $0.00\n|-\n|\n| $72,918.00\n| $260.00\n| 0.36%\n| $20,000.00\n|-\n|\n| $7,210.00\n| $0.00\n| 0.00%\n| $25.00\n|-\n|\n| $5,950.00\n| $300.00\n| 5.04%\n| $3.00\n|-\n|\n| $18,675.00\n| $0.00\n| 0.00%\n| $0.00\n|-\n|\n| $29,625.00\n| $0.00\n| 0.00%\n| $15.00\n|-\n|\n| $112,310.00\n| $0.00\n| 0.00%\n| $1,060.00\n|-\n|\n| $15,159.00\n| $0.00\n| 0.00%\n| $0.00\n|-\n|\n| $602,522.00\n| $400.00\n| 0.07%\n| $1,257,193.00\n|-\n|\n| $9,275.00\n| $0.00\n| 0.00%\n| $0.00\n|-\n|\n| $1,500.00\n| $0.00\n| 0.00%\n| $0.00\n|-\n|\n| $102,091.00\n| $0.00\n| 0.00%\n| $0.00\n|-\n|\n| $19,980.00\n| $0.00\n| 0.00%\n| $0.00\n|-\n|\n| $7,601.00\n| $0.00\n| 0.00%\n| $0.00\n|-\n|\n| $135,934.00\n| N/A\n| N/A\n| $0.00\n|-\n|\n| $129,760.00\n| $150.00\n| 0.12%\n| $1,015.00\n|-\n|\n| $117,720.00\n| $0.00\n| 0.00%\n| $0.00\n|-\n|\n| $31,600.00\n| $1,000.00\n| 3.16%\n| $400.00\n|-\n|\n| $6,650.00\n| $150.00\n| 2.26%\n| $0.00\n|-\n|\n| $6,739.00\n| $0.00\n| 0.00%\n| $0.00\n|-\n|\n| $6,739.00\n| $0.00\n| 0.00%\n| $100.00\n|-\n|\n| $62,325.00\n| $5.00\n| >0.01%\n| $0.00\n|-\n|\n| $6,550.00\n| $250.00\n| 3.82%\n| $0.00\n|-\n|\n| $4,800.00\n| $150.00\n| 3.13%\n| $0.00\n|-\n|\n| $78,660.00\n| $150.00\n| 0.19%\n| $450.00\n|-\n|\n| $22,981.00\n| $300.00\n| 1.31%\n| $0.00\n|-\n|\n| $14,270.00\n| $0.00\n| 0.00%\n| $0.00\n|-\n|\n| $24,910.00\n| $410.00\n| 1.65%\n| $250.00\n|-\n|\n| $7,650.00\n| $150.00\n| 1.96%\n| $0.00\n|}\nReferences"
    }
  ]
}