{
  "content": [
    {
      "type": "text",
      "text": "# Ted King (cyclist)\n\nEdward King}}\n| birth_place    = Exeter, New Hampshire, United States\n| height         =\n| weight         =\n| currentteam    = Retired\n| discipline     = Road\n| role           = Rider\n| ridertype      = Domestique\n| amateuryears1  = 2002\n| amateurteam1   = Bath BikeMan\n| amateuryears2  = 2003–2005\n| amateurteam2   = Louis Garneau Racing\n| proyears1      = 2006–2008\n| proteam1       =\n| proyears2      = 2009–2010\n| proteam2       =\n| proyears3      = 2011–2014\n| proteam3       =\n| proyears4      = 2015\n| proteam4       =\n| majorwins      =\n}}\nEdward Carrington King (born January 31, 1983) is a retired American professional road racing cyclist who last rode for UCI ProTeam . King turned professional in 2006 and raced for ten years, retiring from contemporary road racing in 2015. He quickly segued to the burgeoning world of gravel cycling, where he has been a pioneer in the world of competitive gravel racing.\nPersonal\nBorn in Exeter, New Hampshire, King spent his adolescence in Brentwood, New Hampshire, United States. In 2005, he graduated from Middlebury College in Middlebury, Vermont, United States where he studied economics and mathematics. During his career King resided in both Girona, Catalonia, Spain and Lucca, Italy. Though he shares a surname with several other professional cyclists, in the pro peloton Ted only shares family relation to his older brother Robert \"Robbie\" King, who was a professional cyclist from 2006 to 2008. King's father, also Ted King, was an orthopaedic surgeon practicing in Exeter for 25 years before suffering a stroke in 2003. The elder King is now a member of the [https://krempelscenter.org Krempels Center], an organization in Portsmouth, New Hampshire dedicated to improving the lives of those living with brain injury.\nIn 2011, the two King brothers helped create the [http://kingchallenge.org King Challenge], an annual benefit bike ride in Stratham, New Hampshire, which as of the ninth edition in 2019 has generated more than one-million dollars for the Krempels Center. Ted is now an ambassador for the general sport of cycling, working with long time sponsors to get more people more excited about riding a bike, racing a bike, and spending time on a bike.\nTed is a co-founder of [https://www.untapped.cc/ UnTapped], a sports nutrition founded in Richmond, Vermont based on the nutritional merits of maple syrup. UnTapped sells energy gels, stroopwafels, and hydration drink mix, all using maple syrup and maple sugar as the carbohydrate base.\nCareer\nBetween 2006 and 2008, he competed with , a UCI ConTeam. King signed with , a UCI ProConTeam, for the 2009 and 2010 seasons. He signed with , a UCI ProTeam, for the 2011 and 2012 seasons. He remained with  for the 2013 and 2014 seasons. King is a domestique having raced for Thor Hushovd, Carlos Sastre, and most notably spending four years alongside Peter Sagan.\nKing was controversially disqualified from the 2013 Tour de France. The disqualification was a result of finishing seven seconds outside the elimination time on Stage 4. King had been involved in a crash on Stage 1 in the lead up to the sprint finale for his teammate Peter Sagan; the crash resulted in a separated shoulder and broken scapula among other injuries for King. He continued on for three more stages before finishing outside that time limit, as a result he was not  able to start the next day.\nKing rode the 2014 Tour de France, but withdrew on Stage 10 due to injuries he sustained in Stage 1.\nKing signed with , a UCI ProTeam, for the 2015 season. He retired from road racing after the 2015 season.\nBeginning in early 2016, King quickly became a leader in the sport of gravel cycling. Twice a winner of Dirty Kanza, in 2016 and 2018, he has won or finished on the podium of most of the major gravel races.\nCareer achievements\nMajor results\nSources:\n;2006\n: 2nd Overall International Tour de Toona\n::1st  Young rider classification\n: 6th Overall Fitchburg Longsjo Classic\n: 6th Univest Grand Prix\n;2007\n: 4th Overall Tour de Leelanau\n;2008\n: 3rd Overall Fitchburg Longsjo Classic\n: 3rd Overall Tour de Leelanau\n: 5th Overall Nature Valley Grand Prix\n;2011\n: 3rd National Road Race Championships\n;2013\n: 7th National Road Race Championships\n;2016\n: 1st Dirty Kanza 200\n;2018\n: 1st Dirty Kanza 200\n;2019\n: 1st SBTGRVL\n: 8th Overall Dirty Kanza 200\n;2021\n: 4th Unbound Gravel 200\nGrand Tour general classification results timeline\n{| class=\"wikitable plainrowheaders\"\n|-\n! Grand Tour\n! scope=\"col\" | 2009\n! scope=\"col\" | 2010\n! scope=\"col\" | 2011\n! scope=\"col\" | 2012\n! scope=\"col\" | 2013\n! scope=\"col\" | 2014\n! scope=\"col\" | 2015\n|- style=\"text-align:center;\"\n! scope=\"row\" |  Giro d'Italia\n| style=\"text-align:center;\"|106\n| style=\"text-align:center;\"|114\n|—\n|—\n|—\n|—\n|—\n|- style=\"text-align:center;\"\n! scope=\"row\" |  Tour de France\n|—\n|—\n|—\n|—\n| style=\"text-align:center;\"|DSQ\n| style=\"text-align:center;\"|DNF\n|—\n|- style=\"text-align:center;\"\n! scope=\"row\" |  Vuelta a España\n|—\n|—\n|—\n|—\n|—\n|—\n|—\n|}\n{| class=\"wikitable\"\n|+ Legend\n|-\n| style=\"text-align:center;\"|DSQ || Disqualified\n|-\n| style=\"text-align:center;\"|DNF || Did not finish\n|}\nReferences\nExternal links\n*\n*\n* [http://www.cyclingbase.com/palcoureurs.php?Id_Rider=7118&Id_Saison=34&Id_Title=1&lang=en Edward King] at Cycling Base\n*\n*\n* [http://slipstreamsports.com/riders/ted-king/ Ted King] at Cannondale–Garmin\n* [https://www.athlinks.com/event/174195/results/Event/824572/Course/1456257/Bib/1 Ted King] at 2019 Garmin Dirty Kanza"
    }
  ]
}