{
  "content": [
    {
      "type": "text",
      "text": "# Teenage Warning\n\nTeenage Warning is Angelic Upstarts' first album, released in August 1979. It peaked at No. 29 in the UK Albums Chart and included three singles, (a re-recording of) \"The Murder of Liddle Towers\", \"I'm An Upstart\" and \"Teenage Warning\", along with the B-sides \"The Young Ones\" and \"Leave Me Alone\", and seven new tracks.\nThe band were initially signed to Jimmy Pursey (Sham 69)'s JP Productions. The plan was to record a demo and use Pursey's leverage to secure a deal with Polydor – this floundered following an incident involving Pursey, a security guard and a snowball fight. Warner Brothers stepped in and signed them.\nThe album sleeve depicts a tattooed orange with a clockwork key, symbolising the Anthony Burgess book and Stanley Kubrick film A Clockwork Orange and taken from the opening lyric of the title track, \"Wind me up like a clockwork orange\".\nBert Martens at the NME reviewed the album suggesting it would be Angelic Upstarts' \"one burst\" before they disintegrated, and remarked it was not his greatest listening experience but he had great fun reviewing it.\nTrack listing\nAll songs written by Thomas Mensforth and Ray Cowie, except as shown.\n;Side A\n#\"Teenage Warning\" – 3.02\n#\"Student Power\" – 2.21\n#\"The Young Ones\" (Sid Tepper, Roy C. Bennett) – 1.49\n#\"Never Again\" – 3.06\n#\"We Are The People\" – 3.57\n#\"The Murder of Liddle Towers\" – 4.41\n;Side B\n#\"I'm An Upstart\" – 2.21\n#\"Small Town Small Mind\" – 2.26\n#\"Youth Leader\" – 3.05\n#\"Do Anything\" – 2.17\n#\"Let's Speed\" – 2.34\n#\"Leave Me Alone\" – 2.16\n;Bonus tracks\n#\"The Murder of Liddle Towers\" (single version)\n#\"Police Oppression\" (single version)\nPersonnel\nAngelic Upstarts\n*Thomas \"Mensi\" Mensforth – vocals\n*Raymond \"Mond\" Cowie – guitar\n*Steve Forsten – bass\n*Keith \"Sticks\" Warrington – drums on tracks 1–12\n*Derek \"Decca\" Wade – drums on bonus tracks\nCharts\n{| class=\"wikitable sortable plainrowheaders\" style=\"text-align:center\"\n|+ Chart performance for Teenage Warning\n! scope=\"col\"| Chart (2025)\n! scope=\"col\"| Peakposition\n|-\n|-\n|}\nReferences"
    }
  ]
}