{
  "content": [
    {
      "type": "text",
      "text": "# Teenage Mutant Ninja Turtles 2: Battle Nexus\n\n| image = Tmnt2cover.jpg\n| caption = North American GameCube cover art\n| developer = Konami Computer Entertainment Studios\n| publisher = Konami\n| director = Naomi Kaneda\n| designer = Takayuki IdeAkihiro Ishihara\n| producer = Yasushi Kawasaki\n| composer = Yuichi Tsuchiya  Masanori Akita\n| series = Teenage Mutant Ninja Turtles\n| released = |PAL|November 20, 2004 (GBA)|PAL|March 11, 2005}}\n| genre = Beat 'em up\n| modes = Single-player, multiplayer\n| platforms = PlayStation 2, Xbox, GameCube, Game Boy Advance, Windows\n}}\nTeenage Mutant Ninja Turtles 2: Battle Nexus is a 2004 beat 'em up game developed and published by Konami. It is the sequel to Teenage Mutant Ninja Turtles and is based on the 2003 TV series.\nThe game has cel-shaded graphics, four-player gameplay, and includes the first TMNT arcade game as an unlockable bonus. Teenage Mutant Ninja Turtles 2 Battle Nexus is based mostly on the end of the second season of the 2003 animated TMNT series. The game also has 4 tournaments consisting of waves of enemy attacks.\nThe cinematic cutscenes are adapted from various episodes in the cartoon series featuring the Feudal Japan arc in which the origin of Oroku Saki is discovered.\nGameplay\n(right).]]\nUnlike the 2003 TMNT game, Battle Nexus supports up to four players. Each player may select a \"team\" that consists of a turtle and an unlockable character that can replace the turtle. Four teams are present in the game, if less than four players are playing, one player may select more teams and cycle through them in the game. Each team has their own specific abilities that can help players progress through the game. Blue Team can attack while dashing, and cut through certain obstacles (gates, trees, bamboo, etc.). Red Team can lift and push certain heavy objects. Orange team can reflect arrows with their guard (and Michelangelo can fly with his nunchucks). Purple team can utilize computer consoles (and Donatello can fire a laser instead of throwing shuriken).\nUnlike the previous game, players share one health bar so if one player gets hurt, the health decreases for all of them. Characters have \"weak\" and \"strong\" attacks and they do different moves with different combinations. To beat the level, you must either get to the designated point of the level, kill all enemies, kill the boss, survive until the time runs out or do the specific goal until the time runs out.\nSide goals are to collect artifacts that are usually in hidden or hard-to-reach places. To collect crystal pieces that increase your attack, defense, charge attack and shuriken throwing abilities.\nPlot\nThe game adapts the second season of the TV series, starting from the first season's finale where the turtles Leonardo, Raphael, Michelangelo and Donatello infiltrate the Foot's headquarters to confront the Shredder, getting help from a group of warriors known as the guardians. After defeating both Hun and the Shredder, the turtles find their injured master Splinter missing and their search leads them to the TCRI building which is responsible for the creation of the ooze that mutated the turtles and Splinter and discover that the building is occupied by an alien race known as the Utroms. They try to sneak in and find their master but are cornered by the Utroms and a strange warp device transports them out of the building.\nThe turtles find themselves in the other side of the galaxy on the planet D'Hoonib ruled by the Federation and are caught in a war between the Federation and the Triceratons, both of them seeking professor Honeycutt, also known as Fugitoid, who has the plans for a teleportation device that both sides seek to use against each other. While avoiding capture, the turtles and Fugitoid encounter the famous mercenary Slashuur who is hired by the Triceratons to capture the latter. The turtles and the Fugitoid are brought back to earth by the Utroms and reunite with master Splinter. The Utroms reveal their history to the turtles that they were transporting an Utrom criminal on board their ship who escaped and caused them to crash land on earth a thousand years ago as well as their enmity with the Foot clan since feudal Japan. After coming under attack from the Foot clan led by a very much alive Shredder, the Turtles help the Utroms and Honeycutt escape to their homeworld through the Warp device and discover Shredder's true identity as the Utrom prisoner.\nAfterwards, they face the Ultimate ninja who seeks glory by defeating Leo, help their mutated friends from the underground return to human form and escape, befriend a mutant crocodile known as Leatherhead, and help Karai of the Foot clan end the turf war of New york caused by Shredder's defeat. The Shredder, who has survived the implosion of the TCRI building, sends a robot in the likeness of Splinter to attack the turtles, but they defeat it with the help of a deluded Triceraton soldier known as Zog. Shredder later sends Slashuur after the Turtles whom revealed to be familiar with Hamato Yoshi, Splinter's master. After learning that Yoshi was killed by the Shredder, Slashuur remembers that he is also a victim of the utrom Shredder and reveals himself as an utrom as well. The turtles along with Splinter and Zog attack the Foot's freighter where he is creating an army of advanced robots. After defeating Hun and Karai, they are joined by Slashuur against the Shredder, with Zog Sacrificing himself so they can escape the exploding ship.\nThe turtles can also participate in Battle Nexus, a multiversal battle tournament where many of their allies such as Traximus and Slashuur are taking part, they also meet Miyamoto Usagi, a samurai rabbit. The Turtles and their allies foil the plans of the Ultimate ninja and Drako to claim the Ultimate Daimyo's war staff and Mikey is declared champion afterwards.\nReception\n| MC_NGC = 49/100\n| MC_PC = 50/100\n| MC_PS2 = 47/100\n| MC_XBOX = 48/100\n| EGM_NGC = 3/10\n| EGM_PS2 = 3/10\n| EGM_XBOX = 3/10\n| GI_NGC = 6/10\n| GI_PS2 = 6/10\n| GI_XBOX = 6/10\n| GSpot_GBA = 7.5/10\n| GSpot_NGC = 4.6/10\n| GSpot_PS2 = 4.6/10\n| GSpot_XBOX = 4.6/10\n| GSpy_NGC = 1.5/5\n| GSpy_PS2 = 1.5/5\n| GSpy_XBOX = 1.5/5\n| GameZone_GBA = 6.5/10\n| GameZone_PC = 6.7/10\n| GameZone_PS2 = 5.5/10\n| IGN_NGC = 6/10\n| IGN_PC = 6/10\n| IGN_PS2 = 6/10\n| IGN_XBOX = 6/10\n| NP_GBA = 3.2/5\n| NP_NGC = 2.5/5\n| OPM_PS2 = 1/5\n| OXM_XBOX = 4.2/10\n| PCGUS_PC = 15%\n}}\nThe Game Boy Advance and PC versions received \"mixed\" reviews, while the GameCube, PlayStation 2, and Xbox versions received \"generally unfavorable reviews\", according to the review aggregation website Metacritic.\nTest Monkey of GamePro said of the Game Boy Advance version, \"While the incorporation of stealth may not be the strongest feature in Teenage Mutant Ninja Turtles 2, it's probably the only change worth noting. Although there are other modes for you to try, they're really not worth the time.\" However, Bones said of the PlayStation 2 version, \"behind the flashy extras and cool license, TMNT2 remains an utterly forgettable (albeit forgivable) example of the modern gaming mediocrity.\"\nNotes\nReferences\nExternal links\n*\n*"
    }
  ]
}