{
  "content": [
    {
      "type": "text",
      "text": "# Telecommunications in the Republic of the Congo\n\nTelecommunications in the Republic of the Congo include radio, television, fixed and mobile telephones, and the Internet.\nRadio and television\n* Radio stations:\n** Three state-owned radio stations; several privately owned radio stations; rebroadcasts of several international broadcasters are available (2007);\n** 1 AM, 5 FM, and 1 shortwave stations (1999).\n* Radios: 341,000 (1997).\n* Television stations:\n** One state-owned and several privately owned TV stations; satellite TV service is available; rebroadcasts of several international broadcasters are available (2007);\n** One station (1999).\n* Television sets: 33,000 (1997).\nMost citizens obtain their news from local radio or television stations as there are no nationwide radio or television stations.\nStations from nearby Kinshasa, in the Democratic Republic of the Congo, can be received in Brazzaville and rebroadcasts of the BBC (103.8 FM), Radio France Internationale, and the Voice of America are available.\nTelephones\n* Calling code: +242\n* International call prefix: 00\n* Main lines:\n** 14,900 lines in use, 196th in the world (2012);\n** 21,000 lines in use (1995).\n* Mobile cellular:\n** 40.79 million lines, 38th in the world (2020).\n** 1.1 million lines (2007).\n* Telephone system: primary network consists of microwave radio relay and coaxial cable with services barely adequate for government use; key exchanges are in Brazzaville, Pointe-Noire, and Loubomo; intercity lines frequently out of order; fixed-line infrastructure inadequate providing less than 1 connection per 100 persons; in the absence of an adequate fixed line infrastructure, mobile-cellular subscribership has surged to 90 per 100 persons (2011).\n* Satellite earth stations: 1 Intelsat (Atlantic Ocean) (2011).\n* Communications cables: West Africa Cable System (WACS), a submarine communications cable connecting countries along the west coast of Africa with each other and with the UK.\nInternet\n* Top-level domain: .cg\n* Internet users:\n** 266,635 users, 145th in the world; 6.1% of the population, 182nd in the world (2012);\n** 245,200 users, 136th in the world (2009).\n* Fixed broadband: 393 subscriptions, 190th in the world; less than 0.05% of the population, 185th in the world (2012).\n* Wireless broadband: 90,906 subscriptions, 120th in the world; 2.1% of the population, 125th in the world (2012).\n* Internet hosts: 45 hosts, 215th in the world (2012).\n* IPv4: 12,288 addresses allocated, less than 0.05% of the world total, 2.8 addresses per 1000 people (2012).\n* Internet Service Providers (ISPs): Afripa telecom, Airtel Congo, and Ofis computers.\nA growing proportion of the public, especially youth, are accessing the Internet more frequently and utilizing online social media. However, only the most affluent have Internet access in their own homes; others who accessed it use cybercafes.\nInternet censorship and surveillance\nThere are no government restrictions on access to the Internet, or reports the government monitors e-mail or Internet chat rooms. The constitution and law provide for freedom of speech and press, and the government generally respects these rights. The law makes certain types of speech illegal, including incitement of ethnic hatred, violence, or civil war.\nThe constitution and law prohibit arbitrary interference with privacy, family, home, or correspondence, and the government generally respects these prohibitions. The government makes no known attempts to collect personally identifiable information via the Internet.\nSucceeding Congo's independence, the constitutions of former presidents Abbe Fulbert Youlou (1960–1963) and Alphonse Massamba-Debat (1963–68) offered these guaranteed freedoms. Post-colonial administrations in practice relied on implicit bans and seize of images distributed by Congolese revolutionaries and oppositions. Restrictive censorship was especially uncompromising towards the foreign press, which was meticulously scrutinized during legislation creation. Order number 2294 prohibits the circulation of publishings by foreign origins including pamphlets, journal writings, or any association as such. Occasional success in overcoming newspaper censorship can be seen in the case of  La Semaine Africaine, which consistently expresses notable messages representative of the ‘revolutionary press’. Unsuccessful efforts, however, are more common in Congo print, as seen by the failures of The Voice of the Congolese Revolution, the weekly Basali-ba-Kongo and Dipanda, and the National Youth Movement for the Revolution.\nIntentional Shutdowns\nThe Congolese government performed a series of intentional internet shutdowns. The first was conducted in December 2011 and lasted approximately 25 days. During the 25 days, Short Message Service otherwise known as SMS was the only one affected by the shutdown. According to an article by CIPESA, \"One of the reasons cited by the government for blocking communication was to prevent the spread of fake results over the internet before the electoral commission announced official results\"\nUnlike the first shutdown the second intentional shutdown had a broader range of impact.The second intentional shutdown occurred in January 2015. The Congolese government directed telecommunication companies within the country to halt all its services. Not only was SMS affected, but the entire internet itself. This action by the government came on the eve of political protest on a proposed electoral bill.\nThe most recent government shutdown occurred on December 19, 2016. This was an important date as President Joseph Kabila was supposed to step down as head of state. In order to quell, political upheaval the Congolese government ordered telecom operators to block social media in the country.\nSee also\n* Radiodiffusion Télévision Congolaise, state-owned national broadcaster of the Republic of the Congo.\n* Media of the Republic of the Congo\n* List of radio stations in Africa\n* List of television stations in Africa\n* List of terrestrial fibre optic cable projects in Africa\nReferences\n*\n*\nExternal links\n* [http://www.nic.cg/ NIC.cg], registry for .cg domain.\n* [http://rights.apc.org/africa/index.shtml?apc=s21852e_1 \"ICT Policy in Congo\"], Africa ICT Policy Monitor, Association for Progressive Communications (APC), March 2009.\n* [https://www.cia.gov/the-world-factbook/countries/congo-republic-of-the/ \"Republic of the Congo country report\"], CIA World Factbook."
    }
  ]
}