{
  "content": [
    {
      "type": "text",
      "text": "# Temporary Kings (album)\n\n| recorded     = June 2017\n| venue        =\n| studio       = Auditorio Stelio Molo RSI StudioLugano, Switzerland\n| genre        = Jazz\n| length       =\n| label        = ECMECM 2583\n| producer     = Manfred Eicher\n| chronology   = Ethan Iverson\n| prev_title   = The Purity of the Turf\n| prev_year    = 2016\n| next_title   = Common Practice\n| next_year    = 2019\n| misc         =\n}}\nTemporary Kings is an album by saxophonist Mark Turner and pianist Ethan Iverson recorded in June 2017 and released on ECM September the following year.\nReception\nJazzwise included the album as number thirteen in its list of Top 20 Jazz Albums of 2018.\nNPR included the album in its list of Best Music of 2018.\n| rev2 = All About Jazz\n| rev2Score =\n| rev3 = JazzTrail\n| rev3Score = A−\n| rev4 = Spectrum Culture\n| rev4score=\n}}\nThe Observer awarded the album 4 stars with the review by Dave Gelly stating \"The friendly relations between contemporary forms of jazz and classical music are taken for granted these days, and this is a particularly fine example, a kind of jazz-inflected chamber music. It is a set of duets for tenor saxophone (Turner) and piano (Iverson), by players who delight in each other’s work and company. The atmosphere is calm and reflective, with few if any dramatic highs but plenty of melody and lively exchanges.\"\nAll About Jazz reviewer Mario Calvitti said, \"Overall a nice record, which requires several plays in order to fully appreciate all the nuances that make it up. The work highlights above all the talent of the pianist, who here is fully manifested both as an interpreter and as a composer, while Turner confirms himself as a superfine soloist, with one of the most beautiful instrumental voices among the saxophonists of his generation.\"\nJazzTrail's Filipe Freitas noted \"Temporary Kings is a guileless jazz session whose bi-directional moves converge and diverge with an astounding conviction.\"\nIn JazzTimes, J.D. Considine called it an \"'ethereal session, drawing on the austerely cerebral legacy of Lennie Tristano and Warne Marsh as well as the intimate dynamics of chamber music.\"\n''The Washington Post's Chris Richards observed \"Temporary Kings, the debut album from saxophonist Mark Turner and pianist Ethan Iverson, finds these two quiet killers immersed in a deep, fragile, highly focused form of play. They sound like they’re building a house of cards in the void.\"\nIn his review for  The Wall Street Journal'' Martin Johnson stated, \"The music is austere and elegant and belongs to the growing field of chamber jazz. The sounds draw you with their reserve; the spaces between the notes often have as much impact as the notes themselves.\"\nTrack listing\nAll compositions by Ethan Iverson except where noted\n# \"Lugano\" – 5:01\n# \"Temporary Kings\" – 5:44\n# \"Turner’s Chamber of Unlikely Delights\" – 5:54\n# \"Dixie’s Dilemma\" (Warne Marsh) – 6:00\n# \"Yesterday’s Bouquet\" – 4:44\n# \"Unclaimed Freight\" – 6:49\n# \"Myron’s World\" (Mark Turner) – 7:15\n# \"Third Familiar\" – 4:24\n# \"Seven Points\" (Turner) – 7:54\nPersonnel\n* Mark Turner – tenor saxophone\n* Ethan Iverson – piano\nReferences"
    }
  ]
}