{
  "content": [
    {
      "type": "text",
      "text": "# Tengwar\n\nThe Tengwar () script is an artificial script, one of several scripts created by J. R. R. Tolkien, the author of The Lord of the Rings. Within the context of Tolkien's fictional world, the Tengwar were invented by the Elf Fëanor, and used first to write the Elvish languages Quenya and Telerin. Later a great number of Tolkien's constructed languages were written using the Tengwar, including Sindarin. Tolkien used Tengwar to write English: most of Tolkien's Tengwar samples are actually in English.\nExternal history\nPrecursors\nThe sarati, a script developed by Tolkien in the late 1910s and described in Parma Eldalamberon 13, anticipates many features of the Tengwar: vowel representation by diacritics (which is found in many Tengwar varieties); different Tengwar shapes; and a few correspondences between sound features and letter shape features (though inconsistent).\nEven closer to the Tengwar is the Valmaric script, described in Parma Eldalamberon 14, which Tolkien used from about 1922 to 1925. It features many Tengwar shapes, the inherent vowel  found in some Tengwar varieties, and the tables in the samples V12 and V13 show an arrangement that is very similar to one of the primary Tengwar in the classical Quenya \"mode\".\nIn his An Introduction to Elvish, Jim Allan compared the Tengwar with the London merchant Francis Lodwick's 1686 Universal Alphabet, both on grounds of the correspondence between shape features and sound features, and of the actual letter shapes.\nTengwar\n, written in the Black Speech of Mordor using Tengwar: \"Ash nazg durbatulûk, ash nazg gimbatul / ash nazg thrakatulûk, agh burzum-ishi krimpatul\".]]\nThe Tengwar script was probably developed in the late 1920s or in the early 1930s. The Lonely Mountain Jar Inscription, the first published Tengwar sample, dates to 1937. The full explanation of the Tengwar was published in Appendix E of The Lord of the Rings in 1955.\nThe Mellonath Daeron Index of Tengwar Specimina (DTS) lists most of the known samples of Tengwar by Tolkien. There are only a few known samples predating publication of The Lord of the Rings (many of them published posthumously):\n* The Lonely Mountain Jar Inscription, published 1937\n* Middle Page from the Book of Mazarbul\n* Last Page from the Book of Mazarbul, Last Line, this and the above one originally prepared for inclusion in The Lord of the Rings\n* Steinborg Drawing Title\n* ''Ilbereth's Greeting from The Father Christmas Letters, dating to 1937\n* The Treebeard Page\n* Edwin Lowdham's Manuscript from The Notion Club Papers has Old English language text written in Tengwar (with a few Adûnaic and Quenya words), dating to 1945/6.\n* The Brogan Tengwa-greetings, appearing in The Letters of J. R. R. Tolkien, No. 118, tentatively dated to 1948\nThe following samples presumably predate The Lord of the Rings, but were not explicitly dated:\n* Elvish Script Sample I, II, III, with parts of the English poems Errantry and Bombadil, first published in the Silmarillion Calendar 1978, later in Pictures by J. R. R. Tolkien,\n* So Lúthien, a page of the English Lay of Leithian text\nInternal history and terminology\nWithin the context of Tolkien's fictional world, the Tengwar were invented by the Elf Fëanor in Valinor, and used first to write the Elven tongues Quenya and Telerin. According to J. R. R. Tolkien's The War of the Jewels, at the time Fëanor created his script, he introduced a change in terminology. He called a letter, a written representation of a spoken phoneme (), a  . Previously, any letter or symbol had been called a  (from  'incise'). The alphabet of Rúmil of Tirion, on which Fëanor supposedly based his own work, was known as Sarati. It later became known as \"Tengwar of Rúmil\".\nThe plural of  is , and this is the name by which Fëanor's writing system became known. Since, however, in commonly used modes, an individual  was equivalent to a consonant, the term  in the fiction became equivalent to \"consonant sign\", and the vowel signs were known as . By loan-translation, the Tengwar became known as  (singular ) in Sindarin, when they were introduced to Beleriand. The letters of the earlier alphabet native to Sindarin were called  (singular , probably from  'cutting', and thus semantically analogous to Quenya ). This term was loaned into exilic Quenya as , plural .\nDescription\nLetters\nThe most notable characteristic of the Tengwar script is that the shapes of the letters correspond to the distinctive features of the sounds they represent. The Quenya consonant system has five places of articulation: labial, dental, palatal, velar, and glottal. The velars distinguish between plain and labialized (that is, articulated with rounded lips, or followed by a  sound). Each point of articulation, and the corresponding tengwa series, has a name in the classical Quenya mode. Dental sounds are called  and are represented with the Tengwar in column&nbsp;I. Labial sounds are called , and represented by the column II Tengwar; velar sounds are called , represented by column III; and labialized velar sounds are called , represented by the Tengwar of column IV. Palatal sounds are called  and have no tengwa series of their own, but are represented by column III letters with an added diacritic for following .\nSimilarly shaped letters reflect not only similar places of articulation, but also similar manners of articulation. In the classical Quenya mode, row 1 represents voiceless stops, row 2 voiced prenasalized stops, row 3 voiceless fricatives, row 4 voiceless prenasalized stops, row 5 nasal stops, and row 6 approximants.\nRegularly formed\nMost letters are constructed by a combination of two basic shapes: a vertical stem (either long or short) and either one or two rounded bows (which may or may not be underscored, and may be on the left or right of the stem).\nThese principal letters are divided into four series () that correspond to the main places of articulation and into six grades () that correspond to the main manners of articulation. Both vary among modes.\nEach series is headed by the basic signs composed of a vertical stem descending below the line, and a single bow. These basic signs represent the voiceless stop consonants for that series. For the classical Quenya mode, they are , ,  and , and the series are named , , , and , respectively;  means \"series\" in Quenya.\nIn rows of the general use, there are the following correspondences between letter shapes and manners of articulation:\n* Doubling the bow turns the voiceless consonant into a voiced one.\n* Raising the stem above the line turns it into the corresponding fricative.\n* Shortening it (so it is only the height of the bow) creates the corresponding nasal. In most modes, the signs with shortened stem and single bow do not correspond to the voiceless nasals, but to the approximants.\nIn addition to these variations of the Tengwar shapes, there is yet another variation, the use of stems that are extended both above and below the line. This shape may correspond to other consonant variations required. Except for some English abbreviations, it is not used in any of the better known Tengwar modes, but it occurs in a Quenya  mode where the tengwa Parma with extended stem is used for  and the tengwa Calma with extended stem is used for . The Tengwar with raised stems sometimes occur in glyph variants that look like extended stems, as seen in the inscription of the One Ring.\nAn example from the  (the signs with a closed bow on the right side) in the \"general use\" of the Tengwar is:\n* The basic sign, named , (with descending stem) represents  (it happens to look much like the Latin letter P).\n* With the bow doubled, , it represents .\n* With a raised stem, , it represents .\n* With a raised stem and a doubled bow, , it represents generally  but possibly  (depending upon the language).\n* With a short stem and double bow, , it represents .\n* With short stem and single bow, , it represents , or  if that has the phonological behaviour of a sonorant (e.g. in Quenya).\nIn languages such as Quenya, which do not contain any voiced fricatives other than \"v\", the raised stem + doubled bow row is used for the common nasal+stop sequences (nt, mp, nk, nqu). In such cases, the \"w\" sign in the previous paragraph is used for \"v\". In the mode of Beleriand, found on the door to Moria, the bottom  is used for nasals (e.g.,  is used for ) and the fifth  for doubled nasals ( for ).\nIrregularly formed\nThere are additional letters that do not have regular shapes. They may represent, e.g., , ,  and . Their use varies considerably from mode to mode. Some aficionados have added more letters not found in Tolkien's writings for use in their modes.\ndiacritics\ns for vowels, consonant doubling, and nasal sounds]]\nA  (Quenya 'marking') is a diacritic placed above or below the tengwa. They can represent vowels, consonant doubling, or nasal sound.\nAs Tolkien explained in Appendix E of The Lord of the Rings, the  for vowels resemble Latin diacritics: circumflex (î) , acute (í) , dot (i) , left curl (ı̔) , and right curl (ı̓) . Long vowels, excepting , may be indicated by doubling the signs. Some languages from which  is absent or in which compared to  it appears sparsely, such as the Black Speech, use left curl for ; other languages swap the signs for  and .\nA vowel occurring alone is drawn on the vowel carrier, which resembles dotless i (ı) for a short vowel or dotless j (ȷ) for a long vowel.\nModes\nJust as with any alphabetic writing system, every specific language written in Tengwar requires a specific orthography, depending on the phonology of that language. These Tengwar orthographies are usually called modes. Some modes follow pronunciation, while others follow traditional orthography.\nSome modes map the basic consonants to , ,  and  (classical mode in chart at right), while others use them to represent , ,  and  (general mode at right). The other main difference is in the fourth  below, where those letters with raised stems and doubled bows can be either voiced fricatives, as in Sindarin (general mode at right), or nasalized stops, as in Quenya (classical mode).\nÓmatehtar\nIn some modes, called  (or vowel tehtar) modes, the vowels are represented with diacritics called  (Quenya for 'signs'; corresponding singular: , 'sign'). These  modes can be considered abugidas rather than true alphabets. In some ómatehtar modes, the consonant signs feature an inherent vowel.\nmodes can vary in that the vowel stroke can be placed either on top of the consonant preceding it, as in Quenya, or on the consonant following, as in Sindarin, English, and the notorious Black Speech inscription on the One Ring.\nFull writing\nIn the full writing modes, the consonants and the vowels are represented by Tengwar. Only one such mode is well known. It is called the \"mode of Beleriand\" and one can read it on the Doors of Durin.\nModes for other languages\nSince the publication of the first official description of the Tengwar at the end of The Lord of the Rings, others have created modes for other languages such as English, Spanish, German, Swedish, French, Finnish, Italian, Hungarian and Welsh. Modes have also been devised for other constructed languages; Esperanto and Lojban.\nTolkien had used multiple modes for English, including full writing and ómatehtar alphabetic modes, phonetic full modes and phonetic ómatehtar modes known from documents published after his death.\nEncoding schemes\nLegacy encoding\nin English, written with a spelling-based pointed mode of Tengwar. The first three lines: \"All human beings are / born free and equal / in dignity and rights. /...\"]]\nThe contemporary de facto standard in the Tengwar user community maps the Tengwar characters onto the ISO 8859-1 character encoding following the example of the Tengwar typefaces by Dan Smith. This implies a major flaw: If no corresponding Tengwar font is installed, a string of nonsense characters appears.\nSince there are not enough places in ISO 8859-1's 191 codepoints for all the signs used in Tengwar orthography, certain signs are included in a \"Tengwar A\" font which also maps its characters on ISO 8859-1, overlapping with the first font.\nFor each Tengwar diacritic, there are four different codepoints that are used depending on the width of the character which bears it.\nOther Tengwar typefaces with this encoding include [http://www.dafont.com/Tengwar-annatar.font Johan Winge's Tengwar Annatar], [https://web.archive.org/web/20080515024319/http://at.mansbjorkman.net/parmaite.htm Måns Björkman's Tengwar Parmaitë], [https://web.archive.org/web/20091027083304/http://geocities.com/enrombell/eng_dir/Index.htm  Enrique Mombello's Tengwar Élfica] or [https://web.archive.org/web/20061023195729/http://Tengwarformal.limes.com.pl/ Michal Nowakowski's Tengwar Formal] (note that these differ in some details).\nThe following sample shows the first article of the Universal Declaration of Human Rights written in English, according to the traditional English orthography. It should look similar to the picture; if no Tengwar font is installed, it will appear as a jumble of characters because the corresponding ISO 8859-1 characters will appear instead.\nj#¸ 9t&5# w`Vb%_ 6EO w6Y5 e7`V`V 2{( zèVj# 5% 2x%51T`Û 2{( 7v%1+- 4hR 7EO 2{$yYO2 y4% 7]F85^ 2{( z5^8I`B5$I( 2{( dyYj2 zE1 1yY6E2_ 5^( 5#4^(7 5% `C 8q7T1T W w74^(692^H --\nNote: Some browsers may not display these characters properly.\nUnicode\nMichael Everson made a proposal to include the Tengwar in the Unicode standard in 1997. The range  to U+160FF in the SMP was tentatively allocated for Tengwar in the 2023 Unicode roadmap.\nConScript Unicode Registry\n}}\nTengwar are included in the unofficial ConScript Unicode Registry (CSUR), which assigns codepoints in the Private Use Area. Tengwar are mapped to the range U+E000–U+E07F.\nThe following Unicode sample (which repeats the one above) is meaningful when viewed under a typeface supporting Tengwar glyphs in the area defined in the ConScript Tengwar proposal:\n⸬                   ⸬\nSome typefaces that support this proposal are Everson Mono, Tengwar Telcontar, Constructium, Tengwar Formal Unicode, and FreeMonoTengwar (James Kass's Code2000 and Code2001 use an older, incompatible version of the proposal). The eight “Aux” variant fonts of Kurinto (such as Kurinto Text Aux, Book Aux, Sans Aux) also support Tengwar.\n{| class=\"wikitable\"\n|+ Tengwar letters CSUR encoding\n! Name\t!! Image\t!! CSUR\t|| Designation annotation\n|-\n| tinco\t|| style=\"color: black !important; background-color: white !important;\" | \t|| U+E000\t|| Tengwar LETTER TINCO\n|-\n| parma\t|| style=\"color: black !important; background-color: white !important;\" | \t|| U+E001\t|| Tengwar LETTER PARMA\n|-\n| calma\t|| style=\"color: black !important; background-color: white !important;\" | \t|| U+E002\t|| Tengwar LETTER CALMA\n|-\n| quessë\t|| style=\"color: black !important; background-color: white !important;\" | \t|| U+E003\t|| Tengwar LETTER QUESSE\n|-\n| ando\t|| style=\"color: black !important; background-color: white !important;\" | \t|| U+E004\t|| Tengwar LETTER ANDO\n|-\n| umbar\t|| style=\"color: black !important; background-color: white !important;\" | \t|| U+E005\t|| Tengwar LETTER UMBAR\n|-\n| anga\t|| style=\"color: black !important; background-color: white !important;\" | \t|| U+E006\t|| Tengwar LETTER ANGA\n|-\n| ungwë\t|| style=\"color: black !important; background-color: white !important;\" | \t|| U+E007\t|| Tengwar LETTER UNGWE\n|-\n| súlë / thúlë\t|| style=\"color: black !important; background-color: white !important;\" | \t|| U+E008\t|| Tengwar LETTER THUULE (suule)\n|-\n| formen\t|| style=\"color: black !important; background-color: white !important;\" | \t|| U+E009\t|| Tengwar LETTER FORMEN\n|-\n| harma / aha\t|| style=\"color: black !important; background-color: white !important;\" | \t|| U+E00A\t|| Tengwar LETTER HARMA (aha)\n|-\n| hwesta\t|| style=\"color: black !important; background-color: white !important;\" | \t|| U+E00B\t|| Tengwar LETTER HWESTA\n|-\n| anto\t|| style=\"color: black !important; background-color: white !important;\" | \t|| U+E00C\t|| Tengwar LETTER ANTO\n|-\n| ampa\t|| style=\"color: black !important; background-color: white !important;\" | \t|| U+E00D\t|| Tengwar LETTER AMPA\n|-\n| anca\t|| style=\"color: black !important; background-color: white !important;\" | \t|| U+E00E\t|| Tengwar LETTER ANCA\n|-\n| unquë\t|| style=\"color: black !important; background-color: white !important;\" | \t|| U+E00F\t|| Tengwar LETTER UNQUE\n|-\n| númen\t|| style=\"color: black !important; background-color: white !important;\" | \t|| U+E010\t|| Tengwar LETTER NUUMEN\n|-\n| \t|| style=\"color: black !important; background-color: white !important;\" | \t|| U+E011\t|| Tengwar LETTER MALTA\n|-\n| noldo / ñoldo\t|| style=\"color: black !important; background-color: white !important;\" | \t|| U+E012\t|| Tengwar LETTER NOLDO (ngoldo)\n|-\n| nwalmë / ñwalmë\t|| style=\"color: black !important; background-color: white !important;\" | \t|| U+E013\t|| Tengwar LETTER NWALME (ngwalme)\n|-\n| órë\t|| style=\"color: black !important; background-color: white !important;\" | \t|| U+E014\t|| Tengwar LETTER OORE\n|-\n| vala\t|| style=\"color: black !important; background-color: white !important;\" | \t|| U+E015\t|| Tengwar LETTER VALA\n|-\n| anna\t|| style=\"color: black !important; background-color: white !important;\" | \t|| U+E016\t|| Tengwar LETTER ANNA\n|-\n| vilya / wilya\t|| style=\"color: black !important; background-color: white !important;\" | \t|| U+E017\t|| Tengwar LETTER VILYA (wilya)\n|-\n| rómen\t|| style=\"color: black !important; background-color: white !important;\" | \t|| U+E018\t|| Tengwar LETTER ROOMEN\n|-\n| arda\t|| style=\"color: black !important; background-color: white !important;\" | \t|| U+E019\t|| Tengwar LETTER ARDA\n|-\n| lambë\t|| style=\"color: black !important; background-color: white !important;\" | \t|| U+E01A\t|| Tengwar LETTER LAMBE\n|-\n| alda\t|| style=\"color: black !important; background-color: white !important;\" | \t|| U+E01B\t|| Tengwar LETTER ALDA\n|-\n| silmë\t|| style=\"color: black !important; background-color: white !important;\" | \t|| U+E01C\t|| Tengwar LETTER SILME\n|-\n| silmë nuquerna\t|| style=\"color: black !important; background-color: white !important;\" | \t|| U+E01D\t|| Tengwar LETTER SILME NUQUERNA\n|-\n| essë / áre/áze\t|| style=\"color: black !important; background-color: white !important;\" | \t|| U+E01E\t|| Tengwar LETTER AARE (aaze, esse)\n|-\n| essë nuquerna / áre/áze nuquerna\t|| style=\"color: black !important; background-color: white !important;\" | \t|| U+E01F\t|| Tengwar LETTER AARE NUQUERNA (aaze n., esse n.)\n|-\n| hyarmen\t|| style=\"color: black !important; background-color: white !important;\" | \t|| U+E020\t|| Tengwar LETTER HYARMEN\n|-\n| hwesta sindarinwa\t|| style=\"color: black !important; background-color: white !important;\" | \t|| U+E021\t|| Tengwar LETTER HWESTA SINDARINWA\n|-\n| yanta\t|| style=\"color: black !important; background-color: white !important;\" | \t|| U+E022\t|| Tengwar LETTER YANTA\n|-\n| úrë\t|| style=\"color: black !important; background-color: white !important;\" | \t|| U+E023\t|| Tengwar LETTER UURE\n|-\n| halla\t|| style=\"color: black !important; background-color: white !important;\" | \t|| U+E024\t|| Tengwar LETTER HALLA\n|-\n| telco\t|| style=\"color: black !important; background-color: white !important;\" | \t|| U+E025\t|| Tengwar LETTER SHORT CARRIER\n|-\n| ára\t|| style=\"color: black !important; background-color: white !important;\" | \t|| U+E026\t|| Tengwar LETTER LONG CARRIER\n|}\n{| class=\"wikitable\"\n|+ Tengwar ligatures and extended letters CSUR encoding\n! Name\t!! Image\t!! CSUR\t|| Designation annotation\n|-\n| \t|| \t|| U+E027\t|| Tengwar LETTER ANNA SINDARINWA\n|-\n| \t|| \t|| U+E028\t|| Tengwar LETTER EXTENDED THUULE\n|-\n| \t|| \t|| U+E029\t|| Tengwar LETTER EXTENDED FORMEN\n|-\n| \t|| \t|| U+E02A\t|| Tengwar LETTER EXTENDED HARMA\n|-\n| \t|| \t|| U+E02B\t|| Tengwar LETTER EXTENDED HWESTA\n|-\n| \t|| \t|| U+E02C\t|| Tengwar LETTER EXTENDED ANTO\n|-\n| \t|| \t|| U+E02D\t|| Tengwar LETTER EXTENDED AMPA\n|-\n| \t|| \t|| U+E02E\t|| Tengwar LETTER EXTENDED ANCA\n|-\n| \t|| \t|| U+E02F\t|| Tengwar LETTER EXTENDED UNQUE\n|-\n| \t|| \t|| U+E030\t|| Tengwar LETTER STEMLESS OORE (digit zero)\n|-\n| \t|| \t|| U+E031\t|| Tengwar LETTER STEMLESS VALA\n|-\n| \t|| \t|| U+E032\t|| Tengwar LETTER STEMLESS ANNA\n|-\n| \t|| \t|| U+E033\t|| Tengwar LETTER STEMLESS VILYA (digit one)\n|}\n{| class=\"wikitable\"\n|+ Tengwar accents CSUR encoding\n! Name\t!! Image\t!! CSUR\t|| Designation annotation\n|-\n| amatixe 3\t|| \t|| U+E040\t|| Tengwar SIGN THREE DOTS ABOVE\n|-\n| unutixe 3\t||  || U+E041\t|| Tengwar SIGN THREE DOTS BELOW\n|-\n| amatixe 2\t|| \t|| U+E042\t|| Tengwar SIGN TWO DOTS ABOVE\n|-\n| unutixe 2\t|| \t|| U+E043\t|| Tengwar SIGN TWO DOTS BELOW\n|-\n| amatixe 1\t|| \t|| U+E044\t|| Tengwar SIGN AMATICSE (dot above)\n|-\n| unutixe 1\t|| \t|| U+E045\t|| Tengwar SIGN NUNTICSE (dot below)\n|-\n| tecco\t|| \t|| U+E046\t|| Tengwar SIGN ACUTE (andaith, long mark)\n|-\n| \t|| \t|| U+E047\t|| Tengwar SIGN DOUBLE ACUTE\n|-\n| rempe\t|| \t|| U+E048\t|| Tengwar SIGN RIGHT CURL\n|-\n| \t|| \t|| U+E049\t|| Tengwar SIGN DOUBLE RIGHT CURL\n|-\n| rempenuquerna\t|| \t|| U+E04A\t|| Tengwar SIGN LEFT CURL\n|-\n| \t|| \t|| U+E04B\t|| Tengwar SIGN DOUBLE LEFT CURL\n|-\n| amatwe\t|| \t|| U+E04C\t|| Tengwar SIGN NASALIZER\n|-\n| unuatwe\t|| \t|| U+E04D\t|| Tengwar SIGN DOUBLER\n|-\n| \t|| \t|| U+E04E\t|| Tengwar SIGN TILDE\n|-\n| \t|| \t|| U+E04F\t|| Tengwar SIGN BREVE\n|-\n| \t|| \t|| U+E050\t|| Tengwar PUSTA (putta, stop)\n|-\n| \t|| \t|| U+E051\t|| Tengwar DOUBLE PUSTA (putta)\n|-\n| \t|| \t|| U+E052\t|| Tengwar EXCLAMATION MARK\n|-\n| \t|| \t|| U+E053\t|| Tengwar QUESTION MARK\n|-\n| \t|| \t|| U+E054\t|| Tengwar SECTION MARK\n|-\n| \t|| \t|| U+E055\t|| Tengwar LONG SECTION MARK\n|-\n| thinnas\t|| \t|| U+E056\t|| Tengwar SIGN LONG CARRIER BELOW\n|-\n| \t|| \t|| U+E057\t|| Tengwar SIGN DOUBLE ACUTE BELOW\n|-\n| \t|| \t|| U+E058\t|| Tengwar SIGN RIGHT CURL BELOW\n|-\n| \t|| \t|| U+E05A\t|| Tengwar SIGN LEFT CURL BELOW\n|-\n| sarince\t|| \t|| U+E05C\t|| Tengwar SIGN LEFT FOLLOWING SILME\n|-\n| \t|| \t|| U+E05D\t|| Tengwar SIGN RIGHT FOLLOWING SILME\n|}\n{| class=\"wikitable\"\n|+ Tengwar digits CSUR encoding\n! Name\t!! Image\t!! CSUR\t|| Designation annotation\n|-\n|title=\"STEMLESS OORE\"| 0\t|| \t|| U+E030\t|| Tengwar LETTER STEMLESS OORE (digit zero)\n|-\n|title=\"STEMLESS VILYA\"| 1\t|| \t|| U+E033\t|| Tengwar LETTER STEMLESS VILYA (digit one)\n|-\n| 2\t|| \t|| U+E062\t|| Tengwar DIGIT TWO\n|-\n| 3\t|| \t|| U+E063\t|| Tengwar DIGIT THREE\n|-\n| 4\t|| \t|| U+E064\t|| Tengwar DIGIT FOUR\n|-\n| 5\t|| \t|| U+E065\t|| Tengwar DIGIT FIVE\n|-\n| 6\t|| \t|| U+E066\t|| Tengwar DIGIT SIX\n|-\n| 7\t|| \t|| U+E067\t|| Tengwar DIGIT SEVEN\n|-\n| 8\t|| \t|| U+E068\t|| Tengwar DIGIT EIGHT\n|-\n| 9\t|| \t|| U+E069\t|| Tengwar DIGIT NINE\n|-\n| 10\t|| \t|| U+E06A\t|| Tengwar DUODECIMAL DIGIT TEN\n|-\n| 11\t|| \t|| U+E06B\t|| Tengwar DUODECIMAL DIGIT ELEVEN\n|-\n| \t|| \t|| U+E06C\t|| Tengwar DECIMAL BASE MARK\n|-\n| \t|| \t|| U+E06D\t|| Tengwar DUODECIMAL BASE MARK\n|-\n| \t|| \t|| U+E06E\t|| Tengwar DUODECIMAL LEAST SIGNIFICANT DIGIT MARK\n|}\nIn popular culture\nTengwar has been used in Tolkien fandom since the publication of The Lord of the Rings in the 1950s.\nWith the exception of John Rhys-Davies, the actors playing the Fellowship of the Ring in The Lord of the Rings film trilogy have Tengwar tattoos of the English word nine.\nFootballers such as Sergio Agüero and Fernando Torres have tattoos with their first name in Tengwar on their forearms.\nSee also\n* Cirth\n* A Elbereth Gilthoniel\n* Elvish languages (Middle-earth)\n* Namárië\nReferences\nSources\nFor a list of linguistic material by Tolkien published in the journals Parma Eldalamberon and Vinyar Tengwar, see bibliography in Elvish languages (Middle-earth).\n* Derzhanski, Ivan A. \"The Fëanorian Tengwar and the Typology of Phonetic Writing Systems.\" Vinyar Tengwar 41 (2000): 20–23.\n* Hostetter, Carl F. \"\"Si man i-yulmar n(g)win enquatuva\": A Newly-Discovered Tengwar Inscription.\" Vinyar Tengwar 21 (1992): 6–10.\n* Smith, Arden R., Irmengard Rauch and Gerald F. Carr. \"The Semiotics of the Writing Systems of Tolkien's Middle-earth.\" In Semiotics around the World: Synthesis in Diversity, I-II, ed. Irmengard Rauch, 1239–42. Berlin, Germany: Mouton de Gruyter, 1997.\nExternal links\n* [https://at.boktypografen.se/ Amanye Tenceli] A general presentation by Måns Björkman of the Tengwar script, with some extrapolations.\n* [http://www.forodrim.org/daeron/mdtci.html The Mellonath Daeron Index of Tengwar Specimina]&nbsp;— a continuously expanding list of published Tengwar samples\n* [http://std.dkuug.dk/jtc1/sc2/wg2/docs/n1641/n1641.htm Official proposal to encode Tengwar in Unicode]\n* [http://www.evertype.com/standards/csur/Tengwar.html Tengwar proposal for ConScript Unicode Registry]\n* [http://tengtelc.wordpress.com/2009/08/11/number-of-Tengwar-fonts/ A comprehensive list of Tengwar fonts]\n* [http://freeTengwar.sourceforge.net/ Free Tengwar Font Project], a project promoting free and open Tengwar fonts mapped into Unicode private use code points\n* [https://www.tecendil.com/tengwar-handbook/ Tengwar Handbook]"
    }
  ]
}