{
  "content": [
    {
      "type": "text",
      "text": "# Teresa Edwards\n\n| weight_lb       =\n| birth_date      =\n| birth_place     = Cairo, Georgia, U.S.\n| death_date      =\n| death_place     =\n| high_school     = Cairo (Cairo, Georgia)\n| college         = Georgia (1982–1986)\n| draft_league    = WNBA\n| draft_year      = 2003\n| draft_round     = 2\n| draft_pick      = 14\n| draft_team      = Minnesota Lynx\n| career_start    = 1996\n| career_end      = 2004\n| career_position =\n| career_number   =\n| coach_start     = 2007\n| coach_end       = 2014\n| years1 = 1996–1998\n| team1 = Atlanta Glory\n| years2 = 1998\n| team2 = Philadelphia Rage\n| years3          = 2003–2004\n| team3           = Minnesota Lynx\n| cyears1         = 2007\n| cteam1          = Minnesota Lynx (assistant)\n| cyears2         = 2011\n| cteam2          = Tulsa Shock (assistant)\n| cyears3         = 2011\n| cteam3          = Tulsa Shock (interim)\n| cyears4         = 2014\n| cteam4          = Atlanta Dream (assistant)\n| highlights      =\n* 4× USA Basketball Female Athlete of the Year (1987, 1990, 1996, 2000)\n* 2× Kodak All-American (1985, 1986)\n* SEC Tournament MVP (1983)\n| HOF_player      = teresa-edwards\n| womensHOF       = teresa-edwards\n| FIBA_HOF_player = Teresa-Edwards\n| medal_templates =\n}}\n}}\nTeresa Edwards (born July 19, 1964) is an American former women's basketball player and four time Olympic gold medalist.\nIn 2000, Sports Illustrated magazine placed her as 22nd of the \"100 Greatest Female Athletes of the 20th Century\". She played for, and graduated from, the University of Georgia.\nThe US Olympic Committee appointed Edwards as chef de mission for the 2012 Olympic Games. In 2010, Edwards was inducted into the Women's Basketball Hall of Fame. in 2013, she was inducted into the FIBA Hall of Fame. In 2021, Edwards published an autobiographical audio book, Black Gold, about her basketball career, with a  focus on her Olympic experiences.\nHigh school\nBorn in Cairo, Georgia, Edwards attended Cairo High School, where she was a four-year starter. In her junior and senior years, the Syrupmakers were 58–3. She scored 1,982 points in her high school career, and was honored as the Georgia High School Player of the Year in 1982.\nCollege years\nEdwards began her college career for the Georgia Lady Bulldogs basketball at the University of Georgia where she was a two time All-American.  She was the starting point guard for the Georgia Lady Bulldogs, helping lead them to the Final Four in 1983 and 1985. Edwards played in her first Olympic Games in 1984 as a collegian, and won her first of four gold medals as the youngest member of the team.  Her college jersey number (#5) was retired, making her one of only three Lady Bulldog players given that honor. She earned her degree in leisure studies in 1990.\nGeorgia statistics\nSource\n{| class=\"wikitable\"\n!Year\n!Team\n!GP\n!Points\n!FG%\n!FT%\n!RPG\n!APG\n!SPG\n!BPG\n!PPG\n|-\n|83\n|Georgia\n|33\n|430\n|45.9%\n|63.4%\n|2.2\n|3.0\n|2.1\n|0.3\n|13.0\n|-\n|84\n|Georgia\n|33\n|465\n|52.1%\n|78.5%\n|2.5\n|5.7\n|2.5\n|0.4\n|14.1\n|-\n|85\n|Georgia\n|30\n|464\n|52.7%\n|73.4%\n|2.8\n|6.3\n|3.3\n|0.4\n|15.5\n|-\n|86\n|Georgia\n|32\n|630\n|55.8%\n|78.8%\n|4.6\n|5.5\n|2.8\n|0.4\n|19.7\n|-\n|Career\n|Georgia\n|128\n|1989\n|51.8%\n|73.6%\n|3.0\n|5.1\n|2.7\n|0.4\n|15.5\n|}\nABL career\nEdwards was the star player and head coach for the Atlanta Glory of the American Basketball League (ABL). She played in the ABL inaugural game between the Glory and the San Jose Lasers, won by the Lasers 78–70.  She was traded to the Philadelphia Rage in 1998.\nWNBA career\nDuring the 2003 WNBA draft, at the urging of Minnesota Lynx head coach Suzie McConnell Serio, the Lynx selected Edwards even though she was 38 years old.  Edwards and Serio were teammates on the women's basketball team during the Summer Olympics of 1988 and 1992.\nEdwards played for the Lynx during the 2003 and 2004 seasons.  Afterwards, her contract expired and she became a free agent.  But no other WNBA team offered her a contract for the 2005 season.\nIn December 2006, Edwards returned to Lynx, as an assistant coach.\nEdwards served as an analyst for NBC Sports coverage of Basketball at the 2008 Summer Olympics.\nIn 2011, Edwards was named as assistant coach of the Tulsa Shock. She would later become the interim head coach after Nolan Richardson resigned on July 9, 2011.\nOn March 4, 2014, Edwards was hired by the Atlanta Dream as the assistant coach.\nWNBA career statistics\nRegular season\n|-\n| align=\"left\" | 2003\n| align=\"left\" | Minnesota\n| 34 || 34 || 25.1 || .375 || .300 || .775 || 3.1 || 4.4 || 1.2 || 0.3 || 2.7 || 5.3\n|-\n| align=\"left\" | 2004\n| align=\"left\" | Minnesota\n| 34 || 34 || 20.5 || .370 || .294 || .700 || 2.6 || 2.3 || 1.4 || 0.2 || 2.7 || 5.7\n|-\n| align=\"left\" | Career\n| align=\"left\" | 2 years, 1 team\n| 68 || 68 || 22.8 || .372 || .297 || .743 || 2.9 || 3.3 || 1.3 || 0.3 || 2.7 || 5.5\nPlayoffs\n|-\n| align=\"left\" | 2003\n| align=\"left\" | Minnesota\n| 3 || 3 || 27.7 || .316 || .333 || 1.000 || 3.3 || 6.3 || 1.7 || 0.3 || 2.7 || 6.7\n|-\n| align=\"left\" | 2004\n| align=\"left\" | Minnesota\n| 2 || 2 || 21.5 || .167 || .200 || .750 || 2.5 || 1.0 || 1.5 || 0.5 || 2.0 || 3.0\n|-\n| align=\"left\" | Career\n| align=\"left\" | 2 years, 1 team\n| 5 || 5 || 25.2 || .280 || .294 || .875 || 3.0 || 4.2 || 1.6 || 0.4 || 2.4 || 5.2\nInternational career\nAfter Edwards graduated, she played abroad for nine seasons splitting time between Vicenza- Italy,  Nagoya- Japan, Spain (Dorna Godella), and France (Tarbes and Valenciennes). During this time, she also continued to appear in international competition.\nAfter the 1994 season, she stayed in the United States to train for her fourth Olympic appearance at the 1996 Summer Olympics. Edwards was selected to take the competitors' oath at the Opening Ceremonies in Atlanta (the opening ceremonies took place on her 32nd birthday). She was named the 1996 Sportswoman of the Year (in the team category) by the Women's Sports Foundation.\nShe competed for the United States in international competition a total of 19 times.  Her teams won 14 gold medals.\nIn 1984, the USA sent its National team to the 1984 William Jones Cup competition in Taipei, Taiwan, for pre-Olympic practice. The team easily beat each of the eight teams they played, winning by an average of just under 50 points per game. Edwards averaged 5.5 points per game.\nEdwards is the first female basketball player to have played in five Olympics. She is jointly (with Australian Andrew Gaze) the third basketball player to compete at five Olympics along with Puerto Rican Teófilo Cruz and Brazilian Oscar Schmidt.\nShe also holds the unique distinction of being the youngest gold medalist in women's basketball (age 20 in 1984) and the oldest gold medalist in women's basketball (age 36 in 2000).\nShe made a record fifth Olympic basketball team, earning a fourth gold medal to go with her bronze medal.  She returned to Europe in 2002.\nEdwards was named to the team representing the US at the 1987 William Jones Cup competition in Taipei, Taiwan. The team won all seven games to win the gold medal for the event. Edwards led the team in scoring with 23 points against China. The USA won the gold medal game by a single point over South Korea, helped by Edwards key free throws with a minute left in the game. She was the team's second leading scorer with 12.4 points per game over the seven games, and was named to the all-tournament team. In the following year, 1988, Edwards was also named to the Jones Cup team. The USA team was not as successful, with a 3–2 record, but that was enough to secure the silver medal. She averaged 15.4 points per game to lead her team in scoring.\nEdwards was a member of the 1987 gold medal-winning USA Women's Pan American Team in Indiana, and the 1991 bronze medal-winning team in Havana, Cuba.\nEdwards was a member of the USA National team at the 1990 World Championships, held in Kuala Lumpur, Malaysia. The team won their opening round games fairly easily, with the closest of the first three games a 27-point victory over Czechoslovakia. Then they faced Cuba, a team that had beaten the US in exhibition matches only a few weeks earlier. The USA team was losing at halftime, but came back to win 87–78. Edwards hit four of her five three-point attempts, and scored 32 points, along with five steals. The USA team found itself behind at halftime to Canada in their next game, but came back to win easily 95–70. After an easy match against Bulgaria, the USA team faced Czechoslovakia again, end achieved an almost identical result, winning 87–59. In the title match, the USA team won the gold medal with a score of 88–78. Edwards led the team in scoring and assists, averaging 21.9 points per game and recording 24 assist for the event.\nEdwards was named to the USA national team and competed in the 1994 World Championships, held in June 1994 in Sydney, Australia. The team was coached by Tara VanDerveer, and won their first six games, when they faced Brazil. In a closely contested, high-scoring game, Brazil hit ten of ten free throws in the final minute to secure a 110–107 victory. The USA won a close final game against Australia 100–95 to earn the bronze medal. Edwards  had the second highest scoring average on the team with 12.7 points per game.\nShe also holds the record for points in an ABL game with 46.[https://www.nytimes.com/1998/10/10/sports/plus-women-s-basketball-edwards-re-signs-with-the-abl.html]\nAwards and honors\n* 2001: Georgia Sports Hall of Fame\n* 2010: Women's Basketball Hall of Fame\n* 2009–2012: USA Basketball Board of Directors\n* 2011: Inducted to the Naismith Memorial Basketball Hall of Fame\n* 2011: NCAA Silver Anniversary Award\n* 2013: FIBA Hall of Fame\nSee also\n* List of multiple Olympic gold medalists in one event\n* List of athletes with the most appearances at Olympic Games\nNotes\n}}\nReferences\n*\n*\nExternal links\n* [https://www.fiba.basketball/hall-of-fame/Teresa-Edwards Teresa Edwards] at the FIBA Hall of Fame\n*\n*\n*\n*\n* [https://web.archive.org/web/20010527143412/http://sportsillustrated.cnn.com/siforwomen/top_100/22/ Profile from Sports Illustrated \"100 Greatest Female Athletes of the 20th Century\"]\n*\n*\n*\n* [http://www.olympic.org/uk/games/past/index_uk.asp?OLGT=1&OLGY=1996 IOC 1996 Summer Olympics]\n}}"
    }
  ]
}