{
  "content": [
    {
      "type": "text",
      "text": "# Terence P. Stewart\n\n-->\n| birth_place        =\n| death_date         =\n| death_place        =\n| death_cause        =\n| nationality        = American\n| other_names        =\n| citizenship        = American\n| education          = Juris Doctor, MBA\n| alma_mater         = Georgetown University Law Center\n| occupation         = Attorney-At-Law, Trade relations academic, Managing Partner of Stewart and Stewart\n| years_active       = 1979-present\n| employer           = Stewart and Stewart\n| organization       =\n| known_for          =\n| notable_works      = The GATT Uruguay Round: A Negotiating History\n| title              =\n| term               =\n| predecessor        =\n| successor          =\n| boards             = former member, Board of Directors of Libbey, Inc.\n| spouse             =\n| children           =\n| parents            = Eugene L. Stewart\n| awards             =\n| signature          =\n| signature_alt      =\n| signature_size     =\n| website            =\n}}\nTerence P. Stewart is an American lawyer and managing partner of the law firm Stewart and Stewart. He has authored books on international trade law and testified numerous times before Congressional Committees on trade matters. He is notable for his focus on trade remedy law and has published extensively on law review in publications including the Georgetown Journal of International Law and The Washington Times.\nStewart is an expert on trade remedy law, the World Trade Organization and Chinese trade relations. He is also a former adjunct professor at his alma mater Georgetown University Law Center.\nCareer\nStewart is the Managing Partner of Stewart and Stewart, having joined his father and founder, Eugene L. Stewart, upon graduation from law school in 1979. Before law school, Terence Stewart briefly worked in both retailing and manufacturing after graduating from the Harvard Business School. While in law school, Mr. Stewart worked as a property manager for the Sursum Corda Cooperative housing community.\nHe became a partner with his father, Eugene L. Stewart, in 1983 and became Managing Partner in 1986. His practice focuses on international trade matters. Stewart has served as chairman of the United States Court of International Trade Advisory Committee on Rules, president of the Customs and International Trade Bar Association as well as president  of the Federal Circuit Bar Association and served on the Advisory Council of the U.S. Court of Appeals for the Federal Circuit. Additionally, Mr. Stewart was a member of the U.S.-Africa Chamber of Commerce from 1992 to 1995, serving on its board of directors from 1992 to 1995 and as Vice President of the board, from 1994 to 1995, as well as having been a member of Refugee Voices (now known as the U.S. Committee for Refugees and Immigrants (USCRI)) from 1993 to 1995.\nStewart has been involved in numerous trade remedy cases including antidumping, countervailing duty, safeguard and China-specific safeguard matters for a wide array of industries and their workers including paper, tires, steel, bearings, cattle, tomatoes, shrimp, various auto parts, chemicals and other products. In 2009 he filed a China-specific safeguard case on imported passenger car and light truck tires from China for the United Steelworkers, which became the only such case to receive Presidential relief and increased tariffs for three years from September 2009 to September 2012.\nOn behalf of several associations, including the National Farmers Union and the Consumer Federation of America, Stewart participated in court litigation at the US District Court for the District of Columbia and the U.S. Court of Appeals for the District of Columbia Circuit as intervenor for defendants in litigation involving USDA regulations on country-of-origin labeling.\nFollowing trade policy and trade negotiations for clients and assisting clients whose interests are affected by WTO or FTA dispute settlement proceedings, he was selected to be a member of the Permanent Group of Experts under the WTO’s Agreement on Subsidies and Countervailing Measures from 2003 to 2006.\nFor approximately a decade he assisted the Government of Ukraine in its efforts to become a Member of the World Trade Organization.\nStewart has also been active over his career in trade legislation. He also represented the Timken Company as an intervenor-defendant when the constitutionality of the Continued Dumping and Subsidy Offset Act of 2000 was challenged and upheld by the United States Court of Appeals for the Federal Circuit.\nAdditionally, he served as a member of the Board of Directors of Libbey, Inc. from late 1997 through May 2014.\nTeaching career\nStewart started teaching at his alma mater,  Georgetown University Law Center as an adjunct professor in 1997. He co-taught a graduate seminar on the GATT Uruguay Round negotiations and later the World Trade Organization through 2012.\nAwards and recognition\nStewart has received an Honorary Degree Order of Merit of the 3rd Degree from the Government of Ukraine,\nBibliography\n*Stewart, Terence P., and Delphine A. Abellard. \"Merger Control in the European Community: The EC Regulation\" On the Control of Concentrations between Undertakings and Implementing Guidelines.\" Nw. J. Int'l L. & Bus. 11 (1990): 293.\n*Stewart, Terence P., and Mara M. Burr. \"The WTO Panel Process: An Evaluation of the First Three Years.\" The International Lawyer (1998): 709-735.\n*Stewart, Terence P., and David S. Johanson. \"SPS Agreement of the World Trade Organization and the International Trade of Dairy Products, The.\" Food & Drug LJ 54 (1999): 55.\n*Stewart, Terence P., Eric P. Salonen, and Dennis R. Nuxoll. \"Trade and Cattle: How the System Is Failing an Industry in Crisis.\" Minn. J. Global Trade 9 (2000): 449.\n*Hathaway, C. Michael, et al. \"Antidumping, Countervailing Duties and Trade Remedies: Let's Make a Deal??.\" The International Lawyer (2003): 821-825.\n*Stewart, Terence P., and Caryn B. Schenewerk. \"Conflict between Facilitating International Trade and Protecting US Agriculture from Invasive Species: APHIS, the US Plant Protection Laws, and the Argentine Citrus Dispute, The.\"J. Transnat'l L. & Pol'y 13 (2003): 305.\n*Stewart, Terence P., and Stephanie R. Manaker. \"2010-2011 Return of High Food Prices: Implications for the Future and Steps That Are Being or Could Be Taken to Reduce the Impact.\" Geo. Wash. Int'l L. Rev. 43 (2011): 587.\n*Stewart, Terence P. \"Trade Remedy Actions by WTO Members: A Cause for Concern or a Reflection of Improved Market Access?.\" Global Trade and Customs Journal 8.6 (2013): 159-163.\n*Stewart, Terence P. \"The GATT Uruguay Round.\" A Negotiating History (1986-1992) 3 (1993).\n*Stewart, Terence P. Export practice: customs and international trade law. Practising Law Inst, 1994.\n*Stewart, Terence P., and Amy S. Dwyer. WTO Antidumping and Subsidy Agreements: A Practitioner's Guide to Sunset Reviews in Australia, Canada, the European Union, and the United States. Hague; Boston: Kluwer Law International, 1998.\n*Rules in a Rules-based WTO: Key to Growth; the Challenges Ahead. Transnational Publishers, 2002.\n*Stewart, Terence P. China's Support Programs for Selected Industries: Wood and Wood Products. Trade Lawyers Advisory Group, 2007.\n*Stewart, Terence P., ed. Opportunities and Obligations: New Perspectives on Global and US Trade Policy. Kluwer Law International, 2009.\nReferences\nExternal links\n*[http://www.law.georgetown.edu/faculty/stewart-terence-p.cfm Georgetown Law faculty site]\n*[https://archive.today/20150219133522/http://www.forbes.com/profile/terence-stewart/ Forbes profile]"
    }
  ]
}