{
  "content": [
    {
      "type": "text",
      "text": "# Terminator Genisys: Future War\n\n| genre = Strategy, massively multiplayer online\n| modes = Multiplayer\n}}\nTerminator Genisys: Future War was a 2017 mobile MMO strategy video game created by Plarium in cooperation with Skydance Media. The events of the game take place in a post-apocalyptic future years after the events of the Terminator Genisys film. Originally developed as a sequel film, the game was released on May 18, 2017 on the iOS App Store and Google Play. It uses Plarium's usual model of free to play, with some in-game features and upgrades available to purchase.\nGameplay\nIn Terminator Genisys: Future War, players construct buildings, improve their base, train their troops, upgrade their leader, and create and develop clans. In total, 48 unit types are available to the player (24 for each faction). They are divided into six classes: infantry, cavalry, aviation, spy drones, assault and siege troops.\nIn-game processes are initiated by using the following resources: energy, iridium, materials, ammo, fuel and the special in-game currency, technology points. These technology points can also be used to speed up an active process. To obtain resources, players need to construct special buildings or send their units to resource locations. As the game progresses, the cost and length of in-game processes increase accordingly.\nThe strategic aim for players in a clan is to capture the time machine, a special location at the center of each dimension.\nPlot\nTerminator Genisys: Future War is set directly after the events of the film Terminator Genisys. Genisys is destroyed and Skynet is offline, but the future war is far from over.\nIn the game, the players control the Resistance or Skynet's mechanized forces as they battle for territory, dominance and survival.\nIn the game, players can choose Arnold Schwarzenegger, the T-800 android, as the leader of their army. The character also guides players in the tutorial.\n}}\nCritical reception to the game ranged from mixed to positive. Critics praised the game at the time for its impressive graphics and production values for a mobile game, though it was criticized for its repetitive mission structure. Its empire building was also criticized for being overly generic amidst a sea of mobile games with a similar set-up.\nThe game was adversely affected by the underwhelming commercial performance and negative critical reception of the film it was based on and quickly fell out of relevance. Many critics at the time couldn't look past the fatigue caused by the franchise, when looking at the game. The South China Morning Post stated in its review that \"the Terminator Genisys film all but killed the cult franchise, but this bizarrely timed release of the tie-in mobile game will do little to excite already disillusioned fans\".\nReferences\nExternal links\n*"
    }
  ]
}