{
  "content": [
    {
      "type": "text",
      "text": "# Texas, Nebraska – Czech Republic National Guard Partnership\n\n}}\nThe Nebraska & Texas – Czech Republic State Partnership is one of 29 (as of August 2025) European partnerships that make-up the U.S. European Command State Partnership Program and one of 106 (as of August 2025) worldwide partnerships that make-up the National Guard State Partnership Program. The Czech Republic partnership with Nebraska and Texas began in 1993.\nHistory\nIn 1992, Czechoslovakia split to form Czech Republic and Slovakia. The State Partnership relationship with Nebraska and Texas was established the following year. The Czech Republic joined NATO on 12 March 1999, and the European Union (EU) on 1 May 2004. Czech forces contributed to the International Security Assistance Force (ISAF) in Afghanistan from 2002 to 2014, and the Resolute Support Mission (RSM) since 2015.\nPartnership focus\nThe focus for the partnership is Special Forces, cyber operations, deployment interoperability, and disaster management.\nFuture Years Proposed Events (FY13 & FY14):\n* Battlefield Trauma Care\n* Special Forces\n* Aerial Refueling\n* Chemical Biological Radiological & Nuclear (CBRN)\n* Joint Terminal Attack Controller/ Forward Air Controller (JTAC/FAC)\n* Cyber Defense\nGallery\nTexas-Nebraska Czech Republic 03.jpg|Czech Alcas and U.S.  sit side by side on the ramp at Caslav Air Base, Czech Republic.\nTexas-Nebraska Czech Republic 04.jpg|Members of the Texas Air National and air force of the Czech Republic work side by side at Lackland Air Force Base.\nTexas-Nebraska Czech Republic 01.jpg|Soldiers from Texas prepare a sample for transport to the testing lab while a Soldier from the Czech Republic looks on.\nTexas-Nebraska Czech Republic 02.jpg|Texas and Czech soldiers examine the levels of water and decontaminate fluids in the tanks of an ACHR-90 large decontamination vehicle.\nReferences\nExternal links\n*  Brief description of this partnership.\n*  Two group photographs of the Czech Partnership group.\n*  A brief history of U.S. diplomatic relations with Czechia since 1993.\n*  A more detailed history of diplomatic relations with the Czech Republic.\n*  Official website"
    }
  ]
}