{
  "content": [
    {
      "type": "text",
      "text": "# Thakur Zorawar Singh Barhath\n\nThakur Zorawar Singh Barhath (12 September 1883 — 17 October 1939) was an Indian revolutionary and independence activist.\nSingh was born in the Barhath family of Shahpura, Bhilwara, several of whose members were prominent opponents of the British Raj. Zorawar Singh spent the last three decades of his life living under the pseudonym Sadhu Amardas Bairagi.\nEarly life\nAccording to K. C. Yadav, Zorawar Singh was born in the hamlet of Khaira, near to Shahpura, Bhilwara, in 1875; other sources say 12 September 1883 in Devpura (Shahpura State) to father Thakur Krishna Singh Barhath. The Souda , Barhath family were affluent Charan jagirdars of Rajputana  In Udaipur, he received primary education and completed secondary education in Jodhpur. Zorawar Singh's childhood was spent in close company of the aristocratic families of Shahpura, Udaipur, and Jodhpur. He was married to Anop Kanwar, the daughter of Thakur Takhtsingh of Atraliya thikana in Kota State.\nKamdar of Maharani of Jodhpur\nAfter the death of his father, Zorawar Singh joined the Marwar royal court as the Kamdar of the Maharani of Jodhpur. It was here that Zorawar Singh met Bhai Balmukund who worked as a tutor for the princes.\nTurn to revolution\nHis elder brother, Thakur Kesari Singh, encouraged Zorawar to join the revolutionaries in Delhi, accompanied by Master Amir Chand.\nArrah conspiracy case/Nimej murder case\nRevolutionaries led by Zorawar Singh committed many dacoities in the United Provinces and Bihar to obtain funds. One of these became known as the Arrah Conspiracy or Nimej murder case, in which Singh was the principal accused. Revolutionaries led by him had attacked a Jain upasar located in Arrah (Bihar) in which a mahant was killed in the encounter. The mahant was believed to be a close confidant of British authorities. A person named Shivnarayan turned informer for the British government. British authorities released a warrant & later kill at sight order for Singh but he evaded them.\nRavines of Central India\nSensing the heat of the Colonial Police force around him increase, Zorawar Singh left for the Ravines of Central India and Rajasthan. He made his residence in this region and remained there for the remaining 27 years of his life.\nDuring his long and painful exile, Jorawar Singh Barhath found temporary shelter in Motuka Thikana, a small estate within the Bundi State of Rajasthan.\nHe took refuge at the residence of Ramnath Singh, his wife’s brother-in-law, a nobleman who risked everything to aid him.\nThere, hidden from the British authorities, Jorawar Singh took refuge under a dense “Jaal” tree — a hardy desert tree common in Rajasthan that became his makeshift sanctuary. He was seriously wounded, with open wounds full of pus, likely infected due to prolonged neglect, malnutrition, and constant movement in the wilderness. Despite the severe physical agony, he refused to surrender, choosing patriotism over comfort, and isolation over betrayal.\nHe had changed his name to Sadhu Amardas Bairagi and lived in the guise of a sage.\nIn the latter years, he lived mostly in Sitamau State.\nDeath\nIn 1937, for the first time, Congress won provincial elections in multiple states across British India and formed governments. It was opportune moment so Congress leaders and Thakur Kesari Singh, who had been released from prison in 1920, made efforts to nullify the death warrant issued against Zorawar Singh in Arrah Conspiracy. He met Purshottam Das Tandon, the Bihar Chief Minister Shri Krishna Sinha and the Home Secretary Anugraha Narayan Sinha to cancel the warrant. Zorawar Singh became ill with pneumonia and without proper treatment, he died in 1939 before this could happen.\nLegacy\nShaheed Mela\nSince 1974, every 23 December sees a celebration in memory of the Barhath family, that being the anniversary of the attack on Hardinge. A fair is organised in their hometown at Shahpura and the event takes place at Shahid Trimurti Memorial, which has statues of Thakur Kesari Singh, Thakur Zorawar Singh, and Kunwar Pratap Singh.\nPortraits in Delhi Assembly\nIn January 2019, the three Barhath revolutionaries were placed in the gallery of Delhi Assembly.\nBarhath Haveli of Shahpura\nThe \"Haveli of Late Shri Kesari Singh Barhath\" located in Shahpura, Bhilwara, is a State Protected Monument under the Government of Rajasthan. It is now a national museum, in which the family's weapons and armaments are displayed.\nReferences"
    }
  ]
}