{
  "content": [
    {
      "type": "text",
      "text": "# Thayet War Cemetery\n\n| type        = war cemetery\n| style       =\n| owner       =\n| size        =\n| graves      =\n| website     =\n| findagrave  =\n| political   =\n}}\nThe Thayet War Cemetery is a war cemetery which serves as the resting places for captured Ottoman soldiers who died in Myanmar. It is located in the town of Thayet, situated in the Thayet District of the Magway Region. The cemetery also serves as a memorial for the deceased soldiers.\nDuring the First World War, approximately 12,000 Ottoman soldiers were captured by the British during the Mesopotamian and Sinai and Palestine campaigns as part of the Middle Eastern theatre of World War I. These prisoners of war were mostly transferred to prisoner-of-war camps in Myanmar, which was under British colonial rule at the time. Up to 1,000 Ottoman prisoners of war died while in captivity, primarily due to outbreaks of disease.\nBy 1917, the Thayet prisoner-of-war camp was the largest of its kind in Myanmar, housing 3,500 prisoners of war. According to a Red Cross report published in 1917, the prisoners reported that they were treated well in the camps but complained about being separated from their families, loss of their liberty and livelihoods and boredom. The Red Cross characterized the prisoners acceptance of their fate as \"Oriental fatalism\".\nAccording to Frontier Myanmar journalist James T. Davies,\nPrisoners at Thayetmyo spent their time raising chickens, playing cards or draughts, and arranging sporting competitions to keep fit and healthy. They also kept busy writing letters to send home; about 10,000 a month, the Red Cross report shows. Officers had their own mess on the riverbank where they enjoyed music, painting and billiards. They all probably enjoyed the abundance of mangoes.\nAfter the end of the First World War, most of the prisoners-of-war were sent back home. The cemetery in Thayet where the soldiers were buried soon fell into disrepair, though in 2012 the Turkish government paid for it to be restored in order to serve as a memorial (after Turkish-Myanmar relations began to improve under the presidency of Thein Sein. In 2016, Myanmar state media sources reported that officials from the Turkish embassy in Yangon had contracted a local firm to undertake maintenance for the facility.\nSee also\n* Meiktila War Cemetery\n* Turkish military memorials and cemeteries outside Turkey\nReferences"
    }
  ]
}