{
  "content": [
    {
      "type": "text",
      "text": "# The King of the Road\n\n-->\n| director      = Edward Irham Cole\n| music         =\n| lyrics        =\n| choreography  =\n| chorus        =\n| characters    =\n| mute          =\n| setting       =\n| premiere      = 1900\n| place         =\n| orig_lang     = English\n| series        = bushrangers\n| subject       = melodrama\n| genre         =\n| web           =\n}}\nThe King of the Road is a 1900 Australian play performed by Edward Irham Cole performed by Cole's Bohemian Drama Company about the bushranger Ben Hall.\nThe play appears to have debuted in 1900. According to one description the play was \"founded on episodes in the careers of the old time bushrangers Ben Hall, Frank Gardiner and the gangs that, in the days before telegraphs and railway extension, kept parts of this colony and Victoria in a state of terrorism.\" The play featured the death of Hall.\nThe play was part of Cole's repertoire of plays for the next decade. There were seasons in Sydney in 1904, 1906, 1907, and 1908.\nThe play was also performed in Melbourne. There were performances of the play as late as 1916.\nLead roles were usually played by Cole and his wife Vene Linden. Sometimes the lead was played by Cole's son-in-law Bill Ayr.\nReception\nReviewing a 1908 production the Bulletin said the play \"makes the blood-guilty Benjamin a sympathetic character–in a word, a Hero. The Hippodrome Ben is no common malefactor. He smokes not, neither does he swear or spit... Ben’s strong points are Manliness (on Manliness Benjamin is a veritable whale) and a certain maudlin and a illogical sentimentality which keeps him in a  simmering fever-heat of trouble.\"\nLooking at the same production the Sydney Morning Herald said \"The piece is full of sensational incidents and was well interpreted by the company.\"\nCole and his company performed another play about Hall, Ransom which they later filmed as ''Bushranger's Ransom, or A Ride for Life''.\nJohn Gavin later made a 1911 film about Hall's associate Frank Gardiner, Frank Gardiner, the King of the Road.\nReferences"
    }
  ]
}