{
  "content": [
    {
      "type": "text",
      "text": "# The Kingfield POPS!\n\nThe Kingfield POPS is a 501(c)(3) charitable organization operating out of Kingfield, Maine, United States. Throughout the year, the Kingfield POPS sponsors a number of events and programs designed to bring live music to the surrounding communities with the goal of enhancing regional economic development. The Kingfield POPS mission is to provide music and arts programming for regional residents, youth, and schools, as well as visitors to the area, and to inspire economic growth through a vibrant arts environment.\nHistory\nIn 2003, the Kingfield POPS began as a project of the Mt. Abram Economic Development Association to bring business to the Kingfield area, and to provide a fun, family event to the local residents. The Bangor Symphony Orchestra was hired to play a concert in June 2003, and with a local steel drum band (the Western Mountain Trash Can Band) to open the show, the Kingfield POPS annual summer concert was born.  Several years later, a daytime arts festival was instituted to bring more focus to local businesses, artists, artisans, and musicians.\nDuring the first year, the Kingfield POPS brought the Bangor Symphony Orchestra and other performers to the local school district. Over the years, the POPS has expanded, and now brings live music performance events in various musical genres to two regional school districts, and the surrounding community.\nAnnual concert\nThe annual summer concert is the Kingfield POPS major summer event. It is an outdoor concert held the last Saturday in June in a field at the Kennedy Farm outside Kingfield. The concert features the Bangor Symphony Orchestra and a variety of other local musicians, and concludes with a fireworks show in the evening. The event draws at least 1000 people to the area every year, and aims to be accessible to families in an under-serviced, rural area. To promote accessibility, the concert is free to youth up to age 17.\nArts festival\nThe Festival of the Arts was instituted a few years after the formation of the Kingfield POPS as a way to incorporate local businesses into the POPS concert experience. The festival takes place during the day of the last Saturday in June in downtown Kingfield. It is a free event that features the work of artists and artisans from all over the state of Maine, and live music from local youth performers throughout the day.\nFriday art walks\nKingfield First Friday Artwalks began in the winter of 2010.\nIn the winter of 2011–2012, supported by a grant from the Maine Community Foundation, the Kingfield POPS sponsored live music for the First Friday Artwalks in downtown Kingfield. This grant also supported POPS Friday Artwalk on June 29, 2012.\nSchool programs\nThroughout the school year, the Kingfield POPS brings fine, live music events with the Bangor Symphony Orchestra and other performers to two school districts in Maine. The first school program took place in 2003, a few months after the first concert. These events, which sometimes include master classes with visiting musicians, are presented with the aim to inspire young musicians to learn more about music as an art form. The POPS sponsors school music groups so they can attend important musical events and performance opportunities outside of the school venues.\nThe POPS also held a musical instrument drive for instruments that were purchased but no longer used that could be refurbished and loaned to students who cannot afford to purchase or rent an instrument for participation in school music programs.\nSee also\n*Music of Maine\n*Maine State Music Theater\nReferences\nExternal links\n* [https://kingfieldpops.com/ Kingfield POPS!]\n* [https://wskitv.com/2010/11/04/kingfield-pops-2010/ WSKI-TV Sugarloaf coverage of Kingfield POPS 2010]"
    }
  ]
}