{
  "content": [
    {
      "type": "text",
      "text": "# The Virgin Queen of St. Francis High\n\nor  -->\n| director       = Francesco Lucente\n| writer         = Francesco LucenteAlan Ricardo\n| screenplay     =\n| story          =\n| based_on       =\n| producer       = Francesco LucenteLawrence G. Ryckman\n| starring       =\n| narrator       =\n| cinematography = Kevin AlexanderJoseph Bitonti\n| editing        = Francesco LucenteJohn Welsh\n| music          = Brian IslandDanny LoweBrad Steckel\n| studio         =\n| distributor    =\n| released       =\n| runtime        =\n| country        = Canada\n| language       = English\n| budget         =\n| gross          =\n}}\nThe Virgin Queen of St. Francis High (released in the United States as Paradise Bungalows) is a 1987 Canadian teen comedy film directed by Francesco Lucente and starring Joseph R. Straface, Stacy Christensen, and J. T. Wotton. The plot concerns a teenage Casanova who bets his high school rival and his friends, that he can obtain the school beauty queen.\nPlot\nThe story follows the adventures of two teen boys, Mike and Randy, as they both vie for the affections of their school's most popular girl, Diane, who is known for her vow to remain chaste until marriage. The two make a bet: if Mike can get her to lose her virginity to him in the nearby Paradise Cabins, he'll win $2,000. If he fails, Randy gets the money. Randy is certain that Mike has no chance, as he's the most popular guy in school whereas Mike is a shy nerd. Enlisting the help of his best friend Charles, Mike manages to make Diane fall for him and even agree to meet up with him at the cabins that weekend. Just as success seems imminent Diane's friend Judy discovers the bet and informs Diane, making it necessary for Mike to do whatever it takes to save his relationship with Diane.\nCast\n* Joseph R. Straface as Mike\n* Stacy Christensen as Diane\n* J.T. Wotton as Charles\n* Anna Lisa Iapaolo as Judy\n* Lee Barringer as Randy\n* Bev Wotton as Diane's Mother\n* Terrance Ballinger as D.J.\n* Tara Wilder as the Waitress\n* Barry Onody as the Bartender (as Barry Allen Onody)\n* John Michaud as Allan\nRelease\nThe Virgin Queen of St. Francis High was given a theatrical release in the United States in late 1987.\nReception\nCritical reception for the film was predominantly negative. According to The Leader-Post, Variety reported that its opening in Hollywood was so negatively received that \"people cussed at the awful soundtrack and \"one rebellious soul asked all other patrons to join him as he stormed out to the lobby to demand a refund.\"\" Writing in the Los Angeles Times, in 1987, Michael Wilmington concluded that the movie is \"a stupefying banal basement-budget sex comedy, in which an obnoxious premise is done so ineptly it’s hard to get offended by it.\" San Francisco Chronicle's\nMick LaSalle wrote that the movie was among the worst of the year.  Soren Anderson of The News Tribune in a dual review, said this film, and Cold Steel, are \"equivalent of coal lumps in the Christmas stocking\".\nReferences\nExternal links\n*\n*"
    }
  ]
}