{
  "content": [
    {
      "type": "text",
      "text": "# The Last Battle (band)__disambig_1\n\nThe Last Battle were a Scottish alternative indie folk band, who formed in Edinburgh in 2009 around the songs of singer/songwriter Scott Longmuir. Their name derives from a C.S Lewis novel. They released two albums, Heart of the Land, Soul of the Sea (2010) and Lay Your Burden Down (2014).\nEarly history\nIn early 2009, after the disbandment of their old group, singer/songwriter Scott Longmuir and bassist Paul Barrett decided to take a D.I.Y. approach to making music, and began recording in Barrett's small one bedroom flat, utilising his bathroom, hallway and living room as live space, and asking people who could play traditional instruments such as cello, glockenspiel and ukulele, to play on the recordings.\nFollowing the rise in popularity of similar Scottish Alternative Folk artists such as Frightened Rabbit, they began sending demo's out to independent record labels. Upon receiving A&R interest, the pair decided to put a band together to play the songs live.\nBarrett asked partner Flora MacKay - who had played on the initial demos - to join them on cello full time, whilst Longmuir brought in his partner Ella Duncan on glockenspiel, her sister Arwen on backing vocals and close friend Daniel Barnett on acoustic guitar. Later, an old high school friend, Liam O'Hare, was asked to join on percussion.\nTheir name came about by accident when Longmuir asked Barrett what he was reading at the time, and Barrett replied \"The Last Battle\", a high fantasy novel for children by C.S Lewis.\nThey made their live debut on 4 October 2009 for Oxjam in Edinburgh, however the performance was completely unplugged. Their first real live show in a gig venue was on 14 November at the Wee Red Bar at the Edinburgh College of Art, supporting Fife based Singer/Songwriter Panda Su.\nThey finished 2009 being tipped by The Scotsman as \"Ones to Watch for 2010\", and in the new year began recording their debut album.\nReleases\nOn 5 July 2010 The Last Battle released their debut single \"Ruins\" on Scottish imprint 17 Seconds Records, a label ran by Ed Jupp, brother of standup comedian and writer Miles Jupp. The single received glowing reviews in the Scottish press including 4 stars in both The List and The Skinny, and was followed up by the release of their debut album Heart of the Land, Soul of the Sea on 4 October, a year exactly after their first public live performance.\nThe band hosted a sold-out album launch at The Roxy in Edinburgh on 13 September 2010, a few weeks before the album was released.\nLargely a concept album based around a love story between two opposing characters - one who is tied to the land and is afraid of the ocean but falls in love with someone who is forever at sea - Heart of the Land, Soul of the Sea received many plaudits on its release, and topped many bloggers end of year polls, ending up in the top ten best selling albums of 2010 in Scotland's biggest independent record store Avalanche Records.\nTo promote the album, on 6 December 2010, 17 Seconds Records released their second single \"Natures Glorious Rage\", and the band embarked on a six-date tour of the UK with Sheffield band Book Club (formerly Milburn), finishing at The Garage in London.\nA handful of songs from the album received generous BBC airplay by presenters such as Vic Galloway, Gideon Coe and Ally McCrae. Many online bloggers rated the album highly. A poll involving over 30 respected Scottish bloggers and music sites was held at the end of 2010, known as \"The Scottish Bams\", to find the Best 30 albums of the year. Heart of the Land, Soul of the Sea reached number 8.\nThe band capitalised on the success of the album by releasing The Springwell EP on 18 July 2011, again recorded at Barrett's home. Lauren Mayberry of The List gave the EP 3 out of 5, saying that it \"should please fans of Fence babies Kid Canaveral or Fence papa (and Mercury nominee) King Creosote\". The Sunday Herald also reviewed the EP favourably. A launch night for the EP was held at The Wee Red Bar, with King Creosote as main support, on 30 June.\nOn tour the band have supported the likes of First Aid Kit, Dawn Landes, King Creosote and The Unwinding Hours. In 2011 they were invited to play the Fence Records annual Home Game festival, and have made appearances at other notable events including Acoustic Gathering in Scarborough.\nIn 2012 the band entered the studio to record their second album. They made a number of live appearances in 2013, including a show for the BBC at the Edinburgh Fringe and Aberfeldy Festival.\n2014 saw the release of second album Lay Your Burden Down. However, after a period of inactivity, the band quietly split in 2015.\nIn late 2014, Scott Longmuir released a solo album, A New Light, under the name Beard of Truth. He also performed under his own name (Scott John Longmuir).\nMembers\n* Scott Longmuir (2009-2015)\n* Caroline Overy (2012-2015)\n* Liam O'Hare (2010-2015)\n* Craig Kenny (2012-2015)\n* Jonathan Bews (2011-2015)\n* Arwen Duncan (2009-2012)\n* Ella Duncan (2009-2011)\n* Paul Barrett (2009-2012)\n* Flora MacKay (2009-2011)\n* Brian Pokora (2011)\n* Daniel Barnett (2010)\nDiscography\nAlbums\n* Heart of the Land, Soul of the Sea (2010)\n* Lay Your Burden Down (2014)\nEPs\n* The Springwell (2011)\n* A Wee Red Tale Live (2011)\nSingles\n* \"Ruins\" (2010)\n* \"Nature's Glorious Rage\" (2010)\n* \"Once Upon a Boxing Day\" (2010)\n* \"Hope Is Gold\" (2012)\n* \"Here's to a Little Xmas\" (2012)\n* \"Wherever Our Feet Take Us\" (2013)\n* \"Perfecting the Art (Of Saying Nothing)\" (2013)\nReferences\nExternal links\n*[https://thelastbattlemusic.bandcamp.com Bandcamp page]"
    }
  ]
}