{
  "content": [
    {
      "type": "text",
      "text": "# The Black Prince Thanking Lord James Audley for his Gallantry in the Battle of Poitiers\n\nThe Black Prince Thanking Lord James Audley for his Gallantry in the Battle of Poitiers is a large oil on canvas history painting by the British artist Benjamin Robert Haydon, from 1842.\nHistory and description\nIt depicts a scene from the Hundred Years War. During the Battle of Poitiers on 19 September 1356 James Audley distinguished himself during the fighting and was wounded in several places. He is shown been thanked by the Edward the Black Prince, commander of the English Army, after the battle.\nThe painting was commissioned in 1836 by George Thicknesse-Touchet, 20th Baron Audley, a descendent of the hero of Poitiers. Habitually drunk and eccentric, if not insane, he offered Haydon 500 guineas to produce the work. As the painting was in progress it became clear that Audley hadn't the financial means to pay for the painting and he died the following year. This led to a long delay in Haydon completing the work. It was submitted to the Royal Academy's Summer Exhibition of 1842 in Trafalgar Square. As the new Lord Audley had not wished to buy the work his father had commissioned, it was instead acquired by Haydon's landlord William Newton who owned several of the artist's paintings. In 1935 it was acquired by the Plymouth City Museum and Art Gallery in the artist's native city.\nReferences\nBibliography\n* Abse, Joan. The Art Galleries of Britain and Ireland: A Guide to Their Collections. Robson, 1985.\n* Harrington, Peter. British Artists and War: The Face of Battle in Paintings and Prints, 1700-1914. Greenhill Books, 1993.\n* O'Keeffe, Paul. A Genius for Failure: The life of Benjamin Robert Haydon. Random House, 2011.\n* Wright, Christopher, Gordon, Catherine May & Smith, Mary Peskett. British and Irish Paintings in Public Collections: An Index of British and Irish Oil Paintings by Artists Born Before 1870 in Public and Institutional Collections in the United Kingdom and Ireland. Yale University Press, 2006."
    }
  ]
}