{
  "content": [
    {
      "type": "text",
      "text": "# The Ancient Future Trilogy\n\nThe Ancient Future Trilogy is a set of fantasy novels by Traci Harding. The story follows a 20th-century Australian woman who is transported to 6th century Wales in an attempt to change the future. Major themes within the series include time travel, martial arts, magic and Psychic Phenomena. The three novels in the series are The Ancient Future: The Dark Ages, An Echo In Time: Atlantis and Masters of Reality: The Gathering.\nIn November 2018 This Present Past, a prequel to the trilogy, was published by HarperCollins.\nThe Ancient Future: The Dark Ages\nThe Ancient Future: The Dark Ages was Traci Harding's first published novel. It was inspired by a trip to the United Kingdom, during which the author experienced light phenomenon that are described in the novel as 'fairy lights'. The novel's main character Tory Alexander is unknowingly transported from the present day to 6th century Wales in an attempt to change the future.\nAn Echo In Time: Atlantis\nAn Echo In Time: Atlantis is the second novel in the Ancient Future trilogy. Tory Alexander has ruled as a queen in 6th century Britain for twenty years. When her husband becomes ill, she travels through time in order to find a cure.  However the cure can only be found in the most ancient of cities and the grandest of civilizations: Atlantis!\nMasters of Reality: The Gathering\nMasters of Reality: The Gathering is the final novel in the Ancient Future trilogy.  Moving away from planetary concerns Maelgwn and Tory find themselves reunited in the depths of space.\nCharacters\n*Tory Alexander - The Heroine of the story, Tory is a thirty-year-old Australian woman who is adept at Tae Kwon Do and speaks fluent Brythanic. In the Dark Ages, Tory rules as High Queen of Briton for 21 years. After the Gathering Tory rules as Governess of Kila for 50 years. She is also the heroine of The Celestial Triad series of novels.\n*Maelgwn of Gwynedd - Former King of Gwynedd, Maelgwn is known as 'the Dragon of the Isle' or simply 'the Dragon'.\n*Taliesin Pen Beirdd - Spiritual advisor to Maelgwn and the magician who brings Tory back through time.\n*Sir Calin Brockwell - Maelgwn's champion, cousin and friend. A dedicated womaniser who is also an incarnation of Tory's brother Brian.\n*Katren - A maid rescued from the horrendous man who bought her as a wife. Katren becomes Tory's maid and best friend. With Tory's help, Katren marries Brockwell.\n*Rhun of Gwynedd - Rhun, Prince of Gwynedd, is the first-born child of Tory & Maelgwn.\n*Bryce - the illegitimate son of Calin Brockwell.\n*Brian Alexander - Tory's brother. Brian is Brockwell's 21st century incarnation. Brian is one of the Chosen.\n*Naomi - Brian's wife, Naomi, is Katren's 20th century incarnation. Brian & Naomi have 1 son, Daniel Alexander.\n*Teo - Teo is Taliesin's 20th century incarnation.\n*Miles Thurlow - Miles is Maelgwn's 20th century incarnation.\n*Lady Gladys - Calin Brockwell's mother & an incarnation of Tory and Brian's Aunt Rose.\nReferences\nExternal links\n* [http://www.sffworld.com/brev/si478p0.html Ancient Future series reviews at SFFWorld.com]\n*"
    }
  ]
}