{
  "content": [
    {
      "type": "text",
      "text": "# The Queen of Brilliants\n\nas Betta, The Queen of Brilliants, in the London production (1894).]]\nThe Queen of Brilliants is a comic opera in three acts with music by Edward Jakobowski and a libretto by Brandon Thomas. It was adapted from Jakobowski's German-language operetta Die Brillantett-Königin, with a libretto by Theodore Tawbe and Isidor Fuchs, which premiered in March 1894 in Vienna. A vehicle for Lillian Russell, the plot concerns Betta, who runs away from a nunnery to join a variety troupe known as \"The Brilliants\" and is nicknamed their queen. She proves the worth of her lover, Florian, and turns out to be a real countess. A feature of the spectacularly-staged production was several corps de ballet.\nMusical numbers include \"Love's Freedom\", sung by Florian, \"Whisper Song\" sung by Betta, and a lovers' duet sung in the first act; while the second act includes \"A Soldier's Heart\", Florian's \"Tho' Cruel Fate\" and Betta's \"'Tis True I Am a Caprimonte\". The third act includes a waltz song for Betta and a duet and dance for the lovers.\nProduction\nLillian Russell starred in the title role in both the London and New York productions. The piece premiered at the Lyceum Theatre in London on 8 September 1894 and was revived in an adaptation by H. J. W. Dam at the Abbeys Theatre in New York on 7 November 1894. Despite the presence of Russell in the cast, the London production failed, playing for 41 performances, and the New York production closed after 29.\nBesides Russell the British cast included Hubert Wilke as Florian, Arthur Williams as Della Fontana, George Honey as Fritz, Avon Saxon as Major Victor Pulvereitzer, W. H. Denny as Lucca Rabbiato, an itinerant knife grinder,  Annie Meyers as Orsola, wife of Lucca Rabbiato, and John Le Hay as Grelotto. In London, the dances were arranged by John D'Auban and the scenery was painted by Hawes Craven (Act I), Joseph Harker (Act II) and William Perkins (Act III). The American cast included Wilke, Meyers, Digby Bell as Della Fontana and Laura Joyce Bell as Madame Engelstein.\nPlot summary\nCount Radaman Caprimonte of Borghoveccio is a descendant of the Emperor Diocletian. A young architect named Florian Bauer has been adopted by Count Caprimonte. He loves Betta, a fisher girl, who is actually a Countess in her own right, to whom the Count is distantly related. A duplicitous marriage broker, Madame Engelstein, wants Florian to marry her daughter. She causes Betta to believe that Florian is faithless and sends Betta to a nunnery. However, the nuns refuse to accept the wayward girl, and Betta runs away from the convent after a prophetic dream (shown in a series of tableaux) and joins a variety circus troupe called \"The Brilliants\".\nBetta becomes a celebrated circus singer, known as \"The Queen of Brilliants\". Her success enables her to become the benefactress of Borghoveccio. She is able to test Florian's affection, and he proves to be true to her, so all ends happily.\nReception\nThe London critics complained that Russell had more costume changes than songs: nine costumes to only three songs. \"The audience wants singing, not posturing\", one wrote. One London critic wrote: \"Lillian Russell has never been in better voice. There is nothing more gorgeous on the light opera stage. It is a mediocre play with a weak book and the music is not catching. The excessive magnificence of the scenery actually smothered the performers. Dullness seemed to be the unpardonable sin of both composer and author.\"\nThe New York critics were even less favourable: \"If the original English book was worse than the present one, it must have been a very bad work. There is a story, of course, and that which by courtesy may be called a plot, but it is extremely difficult to discover it during the progress of the performance, and it would be utterly incoherent without the aid of the auditor's imagination.\" The New York Times wrote that there was not one funny line in the show and called Jakobowski's music \"the veriest trash ... cheap, reminiscent of his former works, and by no means catchy.\"\nReferences\nExternal links\n*[https://digitalcollections.nypl.org/items/8ed42e49-4d4b-4fde-e040-e00a180625b7 Photo of Russell in the role]\n*[http://www.stagebeauty.net/th-frames.html?http&&&www.stagebeauty.net/th-behind2.html London review of the opera]"
    }
  ]
}