{
  "content": [
    {
      "type": "text",
      "text": "# The Conquest of Bread__disambig_1\n\nThe Conquest of Bread; .  in the original spelling.}} is an 1892 book by the Russian anarchist Peter Kropotkin. Originally written in French, it first appeared as a series of articles in the anarchist journal Le Révolté. It was first published in Paris with a preface by Élisée Reclus, who also suggested the title. Between 1892 and 1894, it was serialized in part in the London journal Freedom, of which Kropotkin was a co-founder.\nIn the work, Kropotkin identified what he considered to be the defects of the economic systems of feudalism and capitalism, and argued that these systems thrive on and maintain poverty and scarcity. He proceeded to propose a more decentralized economic system based on mutual aid and voluntary cooperation, asserting that the tendencies for this kind of organization already exist, both in evolution and in human society.\nThe Conquest of Bread has become a classic of political anarchist literature. It was heavily influential on the Occupy movement.\nBackground\nIn 1886, Kropotkin was released from French prison. Fearful of the anarchist scare that was gripping continental Europe following the assassination of Alexander II and wishing to focus more time on composing theory and arguing for his revolutionary ideals, Kropotkin moved to London in the same year. Following the death of Mikhail Bakunin in 1876, anarchists desired a prominent and respected theorist to explain their ideas and—after the splitting of the First International between Marxists and anarchists—Kropotkin wished to formally explain anarchist communism in a way that would clearly differentiate the anarchists from the Marxists, but also help to correct what he saw as flaws in Bakunin's ideology of collectivist anarchism. With this aim, Kropotkin spent a great deal of time in London writing multiple books and pamphlets, in between his international speaking tours to the United States and Canada. It was during this time of rapid literary output that Kropotkin wrote The Conquest of Bread, which became his most well-known attempt to systematically explain the essential parts of anarchist communism.\nKropotkin originally wrote the text in French and published in the French journal Le Révolté, where he served as the primary editor. Following its publication in France, Kropotkin published a serialized version in English in the London anarchist journal Freedom. The book would later be collected and published as a book in France in 1892 and in England in 1906.\nThe publication of the text was a watershed moment in anarchist history, being the first time that a completed and in-depth theoretical work of anarchist communism was available to the public. The publication of the text shifted the focus of anarchism from individualist, mutualist and collectivist strains to social and communist tendencies. This shift would prove to be one of the most enduring changes in the history of anarchism as anarchism developed throughout the 20th century with Kropotkin and The Conquest of Bread as firm reference points.\nSummary\nChapters 1–3: Right to well-being\nThroughout the first three chapters, Kropotkin constructs an argument for the common ownership of all intellectual and useful property due to the collective work that went into creating it. Kropotkin does not argue that the product of a worker's labor should belong to the worker. Instead, Kropotkin asserts that every individual product is essentially the work of everyone since every individual relies on the intellectual and physical labor of those who came before them as well as those who built the world around them. Because of this, Kropotkin proclaims that every human deserves an essential right to well-being because every human contributes to the collective social product:\nKropotkin further contends that the central obstacle preventing humanity from claiming this right is the state's violent protection of private property. Kropotkin compares this relationship to feudalism, saying that even if the forms have changed, the essential relationship between the propertied and the landless is the same as the relationship between feudal lords and their serfs. Kropotkin calls for the destruction of the state and the expropriation of all property into the commons, where the right to well-being can be achieved for all people.\nChapters 4–11: Anarchist communist society\nThroughout the middle of the book, Kropotkin sketches a picture of what he feels an anarchist communist society could look like. He points to the huge levels of production that modern industrial society achieved in terms of food production, clothing production, and housing production, and he uses this as evidence of the feasibility of an anarchist communist society. More than enough of the essentials are produced for all people, Kropotkin argues; if they were only distributed properly, nobody would have any unmet needs. Kropotkin further argues that with the level of production output being so high, people should not have to work more than five hours a day and they should be able to reduce that as much as possible, giving them free time for leisure, socialization, and to work on innovations that would reduce their labor.\nNear the end of this section, Kropotkin discusses luxury items, recognizing that they are a necessity for a good life and affirming that luxury items would still be produced, even if production were taken under the purview of common need. Kropotkin claims that luxury items would be produced on a collective basis by those most interested in their production. He uses an example of a group of pianists dedicating time to building luxury pianos with the help of a group of collective carpenters. Kropotkin argues that this system of collective production could produce necessary luxury items—on top of the production of the necessities—for everybody to live a fulfilling life.\nChapters 12–17: Objections and conclusion\nIn the final chapters, Kropotkin lays out what he feels will be prominent objections to his theory as well as his responses to them. He figures that many critics will claim that people are naturally lazy and they would not work without a profit incentive, even if it is only for five hours and for basic necessities. Kropotkin counters by saying that people are willing to work in jobs they enjoy and given the necessary free time to work on their own, with the guarantee of material stability, people will work willingly on collective gardens or in collective garment factories.\nNear the end of the work, Kropotkin cautions against the state centralization of industry, warning people against more authoritarian strands of socialism and claiming that any revolution must guarantee bread and freedom to the workers and revolutionaries. He ends with a long chapter on agriculture, marveling at the many ways in which humans have cultivated and advanced agricultural production, dreaming about the ways that it could be used to feed everybody and guarantee a healthy and happy life for all people.\nLegacy\nThe Conquest of Bread has made an impact which exceeds Kropotkin's own lifetime. It has played a prominent role in the anarchist militias of the Spanish Civil War as well as inspiring anarchist history, theory and praxis throughout the 20th century. Due to the authoritarian and sectarian violence of Marxism–Leninism in the Soviet Union, some thinkers came to regard the book as prophetic, with Kropotkin anticipating the many pitfalls and human rights abuses that would occur with the centralization of industry.\nAfter the 2008 financial crisis and the subsequent Occupy movement, Kropotkin's work took on increased prominence. David Graeber, one of the intellectual leaders of the Occupy movement, cited Kropotkin directly as an inspiration for the world the Occupy protesters were attempting to create. In 2015, David Priestland, writing for The Guardian, called for a renewed look at Kropotkin and The Conquest of Bread in the West, given the collapse of the Soviet Union in 1991 and the 2008 financial crisis.\nSometimes the subject of leftist memes, it is known as \"The Bread Book\" colloquially. Since 2018, a loose group of left-leaning YouTube content creators have collectively been referred to as BreadTube, inspired by the title of the book. The term \"breadpilled\" refers to the act of becoming an anarcho-socialist, alluding to the red pill and blue pill from the 1999 film The Matrix.\nSee also\n* Bread and Freedom\n* Bread and Roses (slogan)\n* Fields, Factories and Workshops\n* Mutual Aid: A Factor of Evolution\nNotes\nReferences\nExternal links\n*\n*\n*\n*\n* [https://theanarchistlibrary.org/library/petr-kropotkin-the-conquest-of-bread The Conquest of Bread] entry at the [https://theanarchistlibrary.org/special/index Anarchist Library]"
    }
  ]
}