{
  "content": [
    {
      "type": "text",
      "text": "# The Battle of Raphia, 217 B.C.\n\nThe Battle of Raphia, 217 B.C.  is a board wargame published by Game Designers' Workshop (GDW) in 1977 that simulates the Battle of Raphia during the Syrian Wars. The game was the first in GDW's \"Series 120\", which featured shorter and less complex games containing only 120 counters that supposedly could be played in 120 minutes.\nBackground\nOn 22 June 217 BC, the armies of Ptolemy IV Philopator, king and pharaoh of Ptolemaic Egypt, and Antiochus III the Great of the Seleucid Empire, met at Raphia to battle for control of Syria. It was the only known battle where war elephants were present in both armies and fought against each other.\nDescription\nThe Battle of Raphia is a two-player wargame where one player controls the Egyptians, and the other controls the Seleucids. As a relatively simple game, it has a small 18\" x 24\" paper hex grid map scaled at 100 yd (90 m) per hex, only 120 counters, and a short rulebook.\nGameplay\nThe two armies are set up in lines facing each other, each player deciding on where to place each type of unit. The game uses a standard \"I Go, You Go\" system of alternating turns, where one player moves and fires, then the other player moves and fires, completing one game turn. There are special rules for war elephants, and rules for routing due to morale failure.\nPublication history\nIn the mid-1970s, large and complex board wargames such as Drang Nach Osten! and Terrible Swift Sword were very popular among experienced gamers, but were impossible to play in a single session, and were very difficult for new players to learn. In response, GDW created \"Series 120\", smaller and less complex games that used no more than 120 counters and would take less than 120 minutes to play. The first of these was The Battle of Raphia, designed by Marc Miller and released in 1977. It was packaged as both a ziplock bag game and in a box.\nIn 1990, the gaming magazine Casus Belli published a French-language edition of Raphia as a pull-out game in their September–October 1990 issue.\nReception\nIn Issue 22 of the UK wargaming magazine Phoenix, Rob Gibson had \"One or two minor irritations with the game\" including the lack of a turn indicator. Nonetheless, Gibson concluded \"I greatly enjoyed playing (simulating?) Raphia, and will definitely do so again.\"\nIn Issue 49 of the British wargaming magazine Perfidious Albion, Charles Vasey did not like the components, remarking on the \"really boring counters, and this is the real bummer in the game, better [illustrations] really are a must, because the cavalry look as if they are about to pull milk-carts.\" Vasey found the game historically accurate, noting \"Tactical skill is not considerable. Apart from making sure you have the proper units on the top of a stack, and exploiting any gaps with [light infantry] who have all-round facing, the game is at push-of-pike; a position which I applaud.\"\nIn the 1980 book The Complete Book of Wargames, game designer Jon Freeman questioned how accurate the historicity of the game could be, given the small number of counters and lack of any real strategy other than to advance and \"then it's hack and slash, as two lines dice each other to death.\" Freeman concluded by giving this game an Overall Evaluation of only \"Fair\", saying, \"For those who are not interested in moving around and who prefer to get right down to the bloodbath, this could be of some interest. It is easy to play.\"\nIn The Guide to Simulations/Games for Education and Training, Martin Campion called this \"a simple game, but one that seems to accurately reflect the warfare of the period.\" He noted that \"The game is short partly because the rules end the battle before it comes to a conclusion by providing for a point count to decide the game.\" He recommended teams play the game, pointing out \"There is room for at least three people on a side, especially as the game requires a lot of dice rolling.\"\nOther reviews and commentary\n*Campaign #88\n*Fire & Movement #11\n* Spartan Simulation Gaming Journal #12\n*The Wargamer Vol.1 #6\n*Casus Belli (Issue 12 - Dec 1982)\nReferences"
    }
  ]
}