{
  "content": [
    {
      "type": "text",
      "text": "# The Settlers: Heritage of Kings\n\n| producer = Benedikt Grindel\n| designer =\n| programmer = Dietmar Meschede\n| artist =\n| writer = Yvonne Kneisel\n| composer = Michael Pummel\n| series = The Settlers\n| engine = RenderWare\n| platforms = Windows\n| released = |EU|February 18, 2005|NA|February 24, 2005|AU|February 24, 2005}}\n| genre = Real-time strategy\n| modes = Single-player, multiplayer\n}}\nThe Settlers: Heritage of Kings (), released as Heritage of Kings: The Settlers in North America, is a 2004 real-time strategy video game for Windows. Developed by Blue Byte and published by Ubisoft, it was released in Germany in November 2004, and in the United Kingdom, North America, and Australia in February 2005. It is the fifth game in The Settlers series. In 2005, Blue Byte released two expansions, The Settlers: Heritage of Kings - Expansion Disc () and The Settlers: Heritage of Kings - Legends Expansion Disc (), in March and September respectively, featuring new single-player campaign missions, new maps for both single-player and multiplayer modes, a map editor, and a random map generator. In November, The Settlers: Heritage of Kings - Gold Edition was released, containing the original game and the first expansion. In 2009, the original game was also released on GOG.com. In 2018, the game was re-released as The Settlers: Heritage of Kings - History Edition.\nIn the game's single-player campaign, the player controls Dario, a young man who is shocked to learn he is the rightful heir to the throne of a once prosperous, but now war-torn and divided country. Joined by a group of loyal supporters, Dario sets out to depose the current king by uniting the princedoms into which the country has split. The Expansion Disc takes place several years later; when building work on a major new bridge stops under mysterious circumstances, Dario and his companions are called upon to investigate.\nOriginally intended as a cross-platform title that would also include PlayStation 2 and GameCube releases, Heritage of Kings was specifically designed as a new type of Settlers game, one intended to appeal to North American gamers. After seeking feedback, Blue Byte decided to move the game away from its pseudo-city building origins, and more in the direction of a traditional real-time strategy. As a result, although still built upon supply and demand-based gameplay, the game mechanics are fundamentally different from previous titles. The game was also the first in the series to feature 3D graphics.\nHeritage of Kings received mixed reviews, with many critics arguing the graphical changes, streamlining of micromanagement, and foregrounding of combat stripped the game of the unique Settlers identity. The graphics, animations and sound effects were generally praised, but the AI, mission design, combat strategy, and slow pace were criticised. The game was a commercial success, selling over 200,000 units in Germany within the first two months of its release. By 2006, worldwide sales had reached 500,000 units, of which 350,000 were sold in the German market.\nGameplay\nThe Settlers: Heritage of Kings is a real-time strategy game, controlled via a point and click interface, in which the primary goal on most maps is to build a settlement with a functioning economy, producing sufficient military units so as to defeat the opponent. To achieve this end, the player must engage in economic micromanagement, construct buildings, research new technologies, manage taxation and workers' motivation, and gather resources. Although the game is loosely built around the same supply and demand-based gameplay as seen in previous Settlers titles, the game mechanics are substantially different, with less focus on micromanagement and daisy-chain economic processes, and more on gathering resources, technology trees, and combat.\nGame modes\nThe game can be played in one of two modes; single-player or multiplayer. In single-player mode, the player can play either campaign missions or individual non-campaign games. In campaign mode, the player must complete a series of missions, the goal of most of which is to defeat the computer controlled opponent or opponents by destroying their keep. In the original release of the game, there were fifteen campaign missions. The Expansion Disc add-on added a new campaign of nine missions. The Legends Expansion Disc added three campaigns of four missions each, and one of five missions, with each campaign built around a different gameplay principal; defense, offence, defeating larger armies, and construction and resource management.\nIn multiplayer mode, which can be played via a LAN or online, the player picks a map on which to play, assigns starting positions, then selects the type of game to be played, choosing from \"Conquest\" (each player/team competes against one another, with the winner being the last player or team whose keep remains standing), \"Technology Race\" (the winner is the first player/team to research all technologies in the university), or \"Point Game\" (a one-hour game in which the player/team with the most points at the end wins, with points awarded for researching new technologies and successfully destroying buildings belonging to opposing players).\nSerfs and workers\nand the use of 3D graphics.]]\nWhether playing in single-player or multiplayer mode, each game begins roughly the same way; the player is positioned at a set location on the map, with a prebuilt keep, usually in the vicinity of a site on which they can construct a village centre so as to begin their settlement. The basic gameplay revolves around serfs, the only units capable of constructing new buildings, repairing damage to pre-existing buildings, gathering wood, and extracting resources without the need to construct a mine or quarry. Each mission begins with a predetermined number of serfs already available, but thereafter, any additional serfs must be purchased from the keep. Serfs do not require lodgings, nor do they consume produce, but they also do not pay taxes. Aside from the keep, the settlement's main building is the village centre. Unlike most buildings, which the player has relative freedom to place, village centres can only be built on specific sites. The village centre determines the upper limit of the village's population size, and once this limit has been reached, the player must either upgrade the centre or find another site on which to build an additional centre.\nUnlike all previous Settlers titles, in Heritage of Kings, the player can directly control serfs, such as ordering them to chop down trees in a particular location, or scout unexplored territory. If a serf is attacked, he will attempt to flee, but the player can order him to defend himself, which he will do with his fists. Players also have the option of ordering serfs to take up arms and form a militia. The player can order militia members to return to regular serf duties at any time.\nWhereas in previous Settlers titles, serfs populated and performed the requisite task of each building, in Heritage of Kings, serfs are differentiated from workers. Once the serfs have constructed a building which requires workers, those workers will automatically emerge from the village centre and occupy the building. Once employed, workers will begin to pay taxes, but in return, they require lodgings and room at a farm. The closer the lodgings and farm are to their workplace, the more productive they will be. Proximity of workplace, lodgings and farm will also increase their stamina (allowing them to work more hours a day). Their motivation, which determines their productivity, can be further increased by building decorative monuments and places of worship. In each building, the player also has the option to order overtime. However, this will diminish workers' motivation.\nIntroduced in the Expansion Disc were scouts and thieves. Scouts can see for great distances, thus illuminating new territory. They are also able to indicate the direction of the nearest resource site, even if it is not currently visible on-screen, and they can drop torches anywhere on the map, allowing the player to monitor that location for a period of time even after the scout has left the area. Thieves can steal resources, sabotage enemy buildings, and are the only units capable of destroying bridges and diffusing enemy bombs.\nEconomy\nStone, iron, clay and sulfur can be found in small piles, which can be excavated by serfs, or mined in much larger quantities once the player has located a shaft or quarry. Wood must be chopped down by serfs. The player can also build refineries to increase the processing of each of the available five resources, and the game's currency, thalers. A major change to the mechanics in Heritage of Kings is that serfs do not transport resources to refineries and construction sites. Instead, resources are automatically deposited into the player's keep and storehouse (once one has been built), and the various refinery workers collect the materials themselves. In the case of construction, the necessary resources are automatically transferred to the build site without having to be physically transported.\nAnother new feature in the game's economic system is the ability to upgrade buildings. Depending on the building, upgrades can increase efficiency or capacity, grant access to new military units and abilities, or allow access to new technologies. Different types of technological research is carried out in different buildings, and can increase productivity, enhance combat abilities, or grant access to new buildings, upgrades and further technologies. Also new to Heritage of Kings is taxation, which is the only way for the player to acquire thalers, which, in turn, are the only way of hiring new serfs and recruiting an army. On payday, every worker in the city pays taxes at a rate set by the player.\nMilitary\nIn the original release of the game, there were seven classes of military unit; swordsmen, spearmen, archers, light cavalry, heavy cavalry, light cannons, and heavy cannons. The Expansion Disc added two additional units; light sharpshooters and heavy sharpshooters. Within each class, there are various ranks, each of which requires a certain amount of technological research before becoming available.\nWhen the player recruits any unit except a cannon, that unit is automatically a captain, and, provided there are sufficient thalers and resources, a set number of soldiers are simultaneously recruited and assigned to that captain, with the upper size of a captain's group determined by his rank. Once a captain has units assigned, and at least one of those units remains alive, he is invulnerable in battle. When units within his group have been killed, a captain can return to the vicinity of the barracks, where the player can recruit replacement units without the need to recruit another captain.\nNew to Heritage of Kings is the ability to use heroes. In the original game, there were six playable heroes available in the single-player campaign, and three additional heroes available in multiplayer. The Expansion Disc added two heroes to the single-player game and one to multiplayer, and Legends allowed players to use the three multiplayer-only heroes from the original game in single-player missions. Each hero has his or her own attributes and abilities, and once used, an ability cannot be used again until a certain amount of time has passed. If a hero is defeated in battle, he/she becomes unresponsive, but if the player can keep enemy units away from the fallen hero, they will eventually revive. Which heroes the player can use is predetermined by the map on which they are playing, whether in single-player campaign mode, single-player non-campaign mode, or multiplayer mode.\nAnother new feature in the game is weather. Initially, weather change is automatic; after a set period, the weather will change from one type to another (cycling through sun, rain and snow). In later missions, the player can build a \"weather plant\", a machine capable of controlling the weather. This becomes important in combat insofar as the player can, for example, bring on winter so as to freeze a lake and allow a strategic approach to enemy territory, or bring on summer so as to thaw a river, cutting off or drowning enemy units. The Expansion Disc added fog-shrouded rivers, which don't freeze over in winter; the only way of crossing is to build a bridge.\nPlot\nSet \"during the days of the Old Empire\", when the peace and prosperity of King Keron's reign have given way to oppression and austerity under King Mordred, the game begins when Mordred's Black Knights attack the village of Thalgrund. The Knights, led by Mordred's senior-most general, Kerberos, have recently been raiding villages in the area, intent on finding something. A young man named Dario drives them off before heading to nearby Ridgewood, his mother's home village, which is also under attack. He again defeats the Knights, but his mother is mortally wounded. As she dies, she gives him an amulet, telling him this is what the Knights were searching for, and explaining that Keron was Dario's father, and the amulet must never fall into the hands of anyone but the legitimate heir to the throne; Dario himself. Joined by his childhood friend, Erec, a knight in the service of the Old Empire, Dario determines to defeat the Black Knights and depose Mordred.\nThey first head to Crawford to speak to Dario's uncle, Helias. Keron's older brother, Helias relinquished the throne to become a priest, and since the demise of the Old Empire, has served as a negotiator, keeping the peace between the eight princedoms into which the Empire split after Keron's death. He explains the amulet is one of several artefacts which together form an orb representing the strength and honour of the king, and which, if reassembled, would legitimise Dario's claim to the throne. The other artefacts were scattered by Keron shortly after Dario's birth; as the Black Knights marched on the Old King's Castle, Keron split the orb up, hanging the largest piece from Dario's neck, before smuggling Dario and his mother out of the castle in the care of Helias. Keron remained behind and was killed when the Knights attacked. After the second artefact is found in Crawford, Helias joins Dario and Erec as they set about finding the remaining artefacts and reuniting the princedoms.\nHaving secured the allegiance of Crawford, the fellowship aid in local issues throughout the realm, gaining the support of Cleycourt, Barmecia, Folklung, and Norfolk. Along the way, they are joined by Ari (a thief), Pilgrim (a miner and demolition expert), and Salim (a weapon and trap designer). They next travel to Kaloix. As they work to relieve a plague spreading through the villages, Ari is kidnapped by the princedom's regent, Mary De Mortfichet. The fellowship ultimately discover De Mortfichet herself is behind the plague; as punishment for the people refusing to ally with Mordred, she began to poison local rivers. They storm her keep, arresting her, and rescuing Ari, with whom Dario realises he has fallen in love.\nThey next head to the ruins of the Old King's Castle, and secure the support of nearby Andala. As the Black Knights attempt to destroy the ruins, the fellowship defeat them and are surprised when Kerberos willingly surrenders, claiming he was duped by Mordred, and that he can assist Dario. To this end, he gives them an artefact and tells them the location of another. They are also surprised to learn Kerberos is Helias's son; when Helias relinquished the throne to Keron, depriving Kerberos of what he felt was his birthright, he became bitter and joined Mordred. Finding the artefact where Kerberos said, the fellowship begin to trust him.\nThey then head to Evelance, Mordred's home. As Mordred remains unaware that Kerberos has joined the fellowship, Kerberos goes on ahead, intending to disrupt Mordred's plans. Meanwhile, Dario gains the allegiance of the nearby city of Tendrel. However, the fellowship discover that Kerberos has double-crossed them, hoping to usurp the throne himself once they defeat Mordred. In one of Evelance's outposts, they find the last artefact, and then set about liberating the villages of the nearby Wastelands, where they learn the more recent attacks from Evelance Fortress were ordered by Kerberos, not Mordred. They storm the fortress and discover Kerberos has murdered Mordred, desperate to become king himself. When he sees escape is impossible, he throws himself from the battlements into the valley below. Shortly thereafter, Dario marries Ari and is crowned king.\nExpansion Disc\nThe Expansion Disc begins several years after the main game, with Dario presiding over a now peaceful and flourishing kingdom. As he attends a council meeting, he is interrupted by news that construction work has ceased on a bridge across the River Nhern. As Erec is supposed to be supervising, Dario, Ari and Pilgrim head to investigate. Upon arriving, they learn the builders are afraid to work since an attack by \"demons\". Erec pursued the so-called demons towards Hen Brugh on the other side of the Nhern but has not been heard from since. The trio rid the area of the demons (humans wearing animal skins, with claws on their hands, and spikes protruding from their backs), and then follow Erec's trail.\nReceiving word that he is awaiting them nearby, as they reach his location, he is shot and killed by a bounty hunter who disappears into the forest. Dario is distraught but says they must press on. They head to the town of Theley, which they find under attack. Fighting off an army of demons, they are joined on their quest by one of the town's militia, a martial artist named Yuki.\nAfter helping Salim resolve a problem with local trade routes, they then travel to Sharray, the area in which Helias settled after the defeat of Kerberos. However, the bounty hunter has also arrived in Sharray and is heading for Helias's home town of Karatas. The fellowship race to beat him, but arrive only in time to see him take aim at Helias. Rather than shooting him, however, the bounty hunter shoots a man running towards Helias. He explains it was an assassin, the same one who killed Erec. The bounty hunter, named Drake, had tried to intervene in Hen Brugh but was unable to do so in time, and Erec was killed. As Erec was an old friend of Drake's, he set out in pursuit of the assassin, and, having saved Helias, now pledges his loyalty to Dario.\nMeanwhile, the arrival of Dario in the area has inspired the people, and they have rebelled against a particularly oppressive regent, Kadir. Joining the locals, the fellowship storm Kadir's castle, and learn he planned to overthrow Dario and take over the Empire himself, and, to this end, he hired the assassin. Gloating that if he is unable to defeat the fellowship, it doesn't matter, as someone else will do the job, he tries to shoot Dario with a crossbow, but is killed by Drake. In Kadir's castle, Yuki finds information on the \"Tribe of the Bear\", known locally as the Shrouded People, an extinct swamp tribe, who, it is told, will return under the guidance of a powerful being, bringing death and destruction.\nWith this information, the fellowship head to the swamps of Tan-Fleh, the ancient home of the Shrouded People, where they find the city of Glen Medden under siege. Driving the besiegers off, Dario decides the only way anyone can be safe is if they find and kill whoever is leading the Shrouded People. Traveling deeper into the swamp, they learn that that person is a supposedly immortal witch named Kala. Reaching a huge expanse of flooded swampland, the locals inform them that Kala resides in the mountains beyond. The fellowship assist in draining the area, and then storm Kala's cave, killing her and defeating the Shrouded People.\nDevelopment\nA new type of Settlers\nJust prior to the European-wide release of The Settlers IV in March 2001, Ubisoft, who had acquired Blue Byte the previous month, stated their \"aim to make The Settlers a global leader as well as developing it on a variety of other platforms, including PlayStation 2 and GameCube\". In June, Blue Byte revealed the next game in the series would be the first to use 3D graphics, and that it would be released simultaneously for Microsoft Windows and the console market. For the rest of 2001, Blue Byte sought feedback from professional critics such as PC Games, as well as focus groups, other developers, and forums, asking such questions as \"what is the core of The Settlers\", \"what is the future of The Settlers\", and \"what doesn't work in The Settlers\"? The only idea which the team rejected outright was a request to include hobbits and elves.\nEarly in development, the designers decided the future of the series was not necessarily to be found in employing more races, more goods, more complex economic processes, and larger maps, but instead in streamlining the gameplay and building a set of \"complex but not complicated\" game mechanics. Creative director Thomas Friedmann defended the decision to reduce the level of micromanagement by citing the increasingly complicated daisy-chain economic processes in The Settlers III and The Settlers IV, arguing as \"construction games have served far too often as a beautiful interface for Excel tables\". Blue Byte further explained their design philosophy was to \"focus more on the settlers – the characters – themselves and reduce the importance of the delivery of goods\", thus shifting the gameplay's main focus from logistical management to \"managing your settlers and your buildings\". For the new game, the designers wanted simple menus, a minimum of statistics, and graphics which clearly represented what was supposed to be happening in the game world; for example, if the player zooms in on a forger creating a canon, they can literally see the canon taking shape piece by piece in the workshop. Blue Byte refer to such graphics as the \"aquarium effect\", with art director Thorsten Knop stating \"we have a lot of animations and effects that are purely aesthetic\".\nSpeaking to PC Games in February 2002, the game's producer and project manager, Benedikt Grindel, said that Ubisoft were handling all publishing issues, leaving Blue Byte free to concentrate solely on development. He explained that after Settlers IV was criticised for being too similar to Settlers III, Blue Byte decided that the next game should represent a \"real innovation leap\". As a result of this, the game would not be called The Settlers V, as the team were \"not just making the next part of a recognised series\". The name Heritage of Kings was ultimately revealed in May 2004, chosen in consultation with German fans.\nWhen the game was officially announced in June 2002, Grindel reiterated that it would be a new type of Settlers game; as well as a new graphical style, it would \"feature all of the strengths of the entire Settlers series\". To this end, the development team (referred to by Grindel as the \"Settlers All-Star Team\") included various Settlers veterans; technical director Thomas Häuser had worked on both The Settlers and The Settlers II; creative director Thomas Friedmann, art director Thorsten Knop, and level designer Adam Sprys had all worked on The Settlers II; lead artist Thorsten Mutschall had worked on The Settlers III and The Settlers IV; and lead designer Andreas Suika, lead programmer Dietmar Meschede, and programmer Marcel Marré had all worked on The Settlers IV.\nIn March 2004, it was announced that the game would be released for Microsoft Windows at the end of the year, with no reference to the PlayStation 2 or GameCube versions. In the announcement, Grindel once more emphasised the new direction in which the game would take the series, and the importance of fan feedback for determining what that direction would be Grindel once more emphasised the new direction in which the game would take the series, and the importance of fan feedback for determining what that direction would be: \"After listening to feedback from Settlers fans, we believe we have succeeded in renewing the franchise by adding many new gameplay and design elements while keeping the essence of Settlers\".\nIn an FAQ published on the game's official website in December 2004, shortly after it had been released, Blue Byte addressed the differences between Heritage of Kings and previous Settlers titles:\n}}\nGraphics and North American appeal\nAccording to Grindel and Thorsten Mutschall, the team decided to switch to 3D graphics because they \"wanted to allow more interaction with the Settlers world\". However, the use of 3D graphics necessitated a fundamental change in graphical style insofar as the cartoon-style graphics of previous titles (dubbed \"Wuselfaktor\") was incompatible with 3D; Thomas Häuser explained that \"with our 3D engine, we could have shown a maximum of four or five settlers at a time, to reach ten or eleven frames. But only if we hid water animations and all moss textures\". Explaining how the game's detailed world was created, Dietmar Meschede stated,\n}}\nIn September 2002, Blue Byte signed a deal with Criterion Software to use the RenderWare game engine. Mutschall said that the feedback collected in 2001 had given the designers a clearly defined goal: \"The Settlers should grow up without losing their special charm and humour\". In the same vein, Grindel argued that previous Settlers titles looked like children's games, and \"we've tried to make the series grow up a bit and look like the game it really is\".\nIn his February 2002 interview with PC Games, Grindel explained that for the first time, a Settlers game was being developed with an eye to the international market, particularly North America, as the series had traditionally sold poorly outside Europe. He later said they \"wanted to make a game that worked everywhere. Our top priority with Settlers V was increasing accessibility\". In March 2004, Bruce Milligan, who had worked on the Tropico series and Rise of Nations, was hired as a \"design consultant\", with his primary role to ensure the game appealed more to the North American market than had any previous Settlers title. Also working to this end, Ubisoft Montreal were supervising the online multiplayer portion of the game. Speaking in 2010, Grindel explained that the event-driven storyline was a major part of gearing the game towards North American gamers; \"We were intensely concerned with the brand, because the series is only really successful in Germany. We asked ourselves how we could change that, how we could rework the interface and the narrative, how best to tell a good story\".\nPromotion and release\nIn August 2004, the game was shown at the Games Convention, where Gameswelt's Vitus Hoffmann noted, \"a lot of the basic micromanagement has been jettisoned in favour of more user-friendly playability and better pacing\". In a 4players preview, Marcel Kleffmann opined that the game played more like an Age of Empires title than any previous Settlers title. In a second preview, written several weeks before the game's release, he reiterated his impression that the game played similarly to Age of Empires, but also argued that it \"felt\" like a Settlers game, suggesting the difference between it and Settlers IV was no greater than the difference between the first two games on the one hand, and Settlers III on the other.\nTowards the end of September, Blue Byte advertised for a closed beta, specifically seeking casual gamers, families, and people with little interest in real-time strategies. In November, Ubisoft announced they would be releasing both a standard edition and a Limited Edition in Germany. Both editions would feature the game, a \"making-of\" featurette, and a live performance by Apocalyptica from the 2004 Games Convention. The Limited Edition would also feature an A4 size sticker, a \"medieval style\" pen, a keychain, and a two-sided poster. The game was also released on Steam, and in 2009 on GOG.com.\nReception\n| CGW =\n| EuroG = 5/10\n| GSpot = 6.4/10\n| GSpy =\n| IGN = 6.5/10\n| PCG=85%\n| award1Pub = Games Convention\n| award1 = Best PC Game (2004)\n| award2Pub = Deutscher Entwicklerpreis\n| award2 = Best Cutscenes, Best Strategy Game (2005)\n}}\nHeritage of Kings received \"mixed or average\" reviews, with an aggregate score of 58 out of 100 on Metacritic, based on twenty-nine reviews.\nPC Games Petra Fröhlich scored the game 85%. Arguing it was a Settlers game in name only, she noted, \"economic cycles are virtually non-existent\", and opined, \"it is likely to appeal more to an Age of Empires fan than an Anno fan\". However, she praised the use of heroes, the sound effects, animations, and, especially, the graphics, which she called \"some of the most beautiful in the strategy genre\". She also found the game more accessible than any previous Settlers title, calling it \"a great strategy game, although fans of construction games might be disappointed\".\nIGNs Dan Adams scored it 6.5 out of 10. He felt the graphical changes and foregrounding of combat stripped the game of its unique Settlers identity, and argued that although it \"isn't a horrible game\", he could find little to recommend it. He cited as particular weaknesses the repetitive mission design and lack of combat strategy, of which he wrote, \"it's basically left up to who has the most upgraded soldiers in order to win\". Although he praised the graphics, animations and textures, he criticised \"the generic nature of the art\", and the absence of real-time lighting and shadows. He concluded, \"this is simply a below-average game.\"\nGameSpots Jason Ocampo scored it 6.4 out of 10, writing that the player will spend most of their playing time \"sitting around waiting to gather the mountain of resources you need\". He was critical of the repetitive mission design, and \"underdeveloped\" combat, and felt that enemy AI was \"practically non-existent\". Although he praised the graphics, he concluded: \"Heritage of Kings would be a fairly enjoyable and likeable game if not for its glacial pace. This is a huge game, but not in a good way. There simply just isn't enough action or variety to keep your attention\".\nEurogamers Kieron Gillen scored it 5 out of 10, calling it \"brutally average\". He was especially critical of the simplification of micromanagement, and referred to the use of heroes as \"Warcraft 3, without Blizzard's craft\". He concluded, \"by losing virtually everything that made the Settlers unique, Blue Byte has ended up with something - somewhat predictably - that's the same as everything else, but not as good\".\nGameSpys Allen Rausch scored it 2 out of 5, calling it a \"slow, dull title that's lost much of what made the series special\". Although he praised the graphics, sound effects, and multiplayer mode, he found the technology trees poorly implemented, lamented the absence of the type of complex daisy-chain economic processes, and was unimpressed with the pace. He also felt the game mechanics \"would have seemed primitive and simple back in 1997\", and called combat \"the worst sort of \"click on the enemy and hope for the best\" gameplay\".\nComputer Gaming Worlds Erik Wolpaw scored it 1.5 out of 5, criticising the simplification of micromanagement in favour of combat. He felt the game featured nothing to distinguish it from late '90s real-time strategy titles, calling combat \"tactics free\". He was also critical of the pace, which he felt was more suited to a city-building game, and was incongruous with the changes to the game mechanics elsewhere. Although he praised the graphics, he found the milieu \"generic medieval realism\" and criticised the visuals as \"technically competent, but relentlessly sterile\".\nSales and awards\nBy Christmas 2004, one month after its release, the game was awarded gold status in Germany, for sales of over 100,000 units. By contrast, it had taken Settlers IV seven months to reach gold status. Ubisoft's business development director, Ralf Wirsing, cited the changes to the graphics and gameplay as renewing the series' commercial appeal. After five weeks, it had sold 220,000 units in Germany. Towards the end of January, the game was announced as the fifth best selling PC game in Germany during the period, and the country's highest selling 2004 real-time strategy game. In the United Kingdom, it received a \"Silver\" award from the Entertainment and Leisure Software Publishers Association, indicating sales of at least 100,000 units. By 2006, Heritage of Kings had sold 500,000 units worldwide, of which 350,000 were purchased in Germany.\nAt the 2004 Games Convention in Leipzig, Heritage of Kings won \"Best PC Game\". It was also nominated for \"Best PC Graphics\". At the 2005 Deutscher Entwicklerpreis, it won \"Best Cutscenes\" and \"Best Strategy Game\". The Expansion Disc was the runner-up in the \"Best PC Add-On\" category.\nExpansions\nExpansion Disc\nThe game's first expansion was The Settlers: Heritage of Kings - Expansion Disc, released in Germany in March 2005, and featuring nine new single-player missions, seven new maps for single-player mode, twenty-six new maps for multiplayer mode, a map editor, two new combat units (light and heavy sharpshooters), two new single-player heroes, one new multiplayer hero, two new economic units (thieves and scouts), additional buildings and technologies, bridge building, and improved graphics.\nLegends Expansion Disc\nUbisoft released a second expansion, The Settlers: Heritage of Kings - Legends Expansion Disc, in September, featuring three new single-player campaigns of four missions each and one of five missions, six new maps for single-player mode, eighteen new maps for multiplayer mode, an enhanced map editor, a random map generator, and the ability to use the three multiplayer-only heroes from the original game in single-player missions.\nGold Edition\nIn November 2005, The Settlers: Heritage of Kings - Gold Edition was released. The German language version includes the original game and both expansions, a Kerberos figurine, the soundtrack from both the original game and the Expansion Disc, and a behind-the-scenes documentary. The English language version includes the original game and the Expansion Disc.\nHistory Edition\nIn November 2018, Ubisoft re-released the game as both a standalone History Edition and as part of The Settlers: History Collection. Optimised for Windows 10, the re-release contains the original game, and both the Expansion Disc and Legends Expansion Disc add-ons, and features adjustable resolutions and online multiplayer. The History Edition replaced the original version found on Steam. Available only on Uplay, the History Collection also includes re-releases of The Settlers, The Settlers II, The Settlers III, The Settlers IV, The Settlers: Rise of an Empire, and The Settlers 7: Paths to a Kingdom.\nReferences\nExternal links\n*   (site dead; )\n*   ()"
    }
  ]
}