{
  "content": [
    {
      "type": "text",
      "text": "# The Mighty Crusaders (film)\n\nor  -->\n| director = Carlo Ludovico Bragaglia\n| producer = Ottavio Poggi\n| screenplay = Sandro Continenza\n| based_on =\n| starring =\n| music = Roberto Nicolosi\n| cinematography = Rodolfo Lombardi\n| editing = Renato Cinquini\n| studio = MAX Film\n| distributor =\n| released =\n| runtime = 97 minutes\n| country = Italy\n| language = Italian\n| budget =\n| gross =\n}}\nThe Mighty Crusaders () is a 1957 film about the First Crusade (1096–1099), based on the 16th-century Italian poem Jerusalem Delivered by Torquato Tasso.\nThis film was directed by Carlo Ludovico Bragaglia. The Italian version was written by Sandro Continenza and the English translation was written by Annalena Limentani and Frederica Nutter.\nPlot\nThe film is based on the poem by Torquato Tasso, and is set in the time of the Crusades in Jerusalem. The commander Godfrey of Bouillon, Christian blessed by the pope, is attacking the Holy City for years, with no victory. In fact, his work is to free the Holy Sepulchre of Christ from the hands of the Muslim infidels. The best soldier of Godfrey's troop is Tancredi, who during a battle, confronts a Muslim soldier. While this soldier is very strong, Tancredi discovers that \"he\" is a young woman, named Clorinda. The two fall in love while the war rages; but unfortunately their love does not last long; the witch Armida, with his faithful Muslims, creates a spell that affects Tancredi and Clorinda, who resume to fight in the war against each other.\nCast\n*Francisco Rabal as Tancredi d'Altavilla\n*Sylva Koscina as Clorinda\n*Gianna Maria Canale as Armida\n*Rik Battaglia as Rinaldo d'Este\n*Philippe Hersent as Godfrey of Bouillon\n*Andrea Aureli as Argante\n*Alba Arnova as Harem Dancer\n*Nando Tamberlani as Pietro\n*Cesare Fantoni as Aladino\n*Carlo Hintermann as Dilone\nRelease\nThe Might Crusaders was released in United States in January 1961.\nSee also\n* list of historical drama films\nReferences\nFootnotes\nSources\n*\nExternal links\n*"
    }
  ]
}