{
  "content": [
    {
      "type": "text",
      "text": "# The Next Revolution\n\n| last_aired           =\n| related              =\n}}\nThe Next Revolution was a television program that debuted on the Fox News Channel, being broadcast by the channel from June 4, 2017 – May 28, 2023. The hour-long weekly program was hosted by Steve Hilton, who had served as a political adviser to former British prime minister David Cameron. The program emphasized opinion commentary about right-wing populism.\nThe program was broadcast at 9 p.m. Eastern Time / 6 p.m. Pacific Time on Sunday nights live from the Fox News West Coast bureau in Los Angeles.\nGuest hosts for the program included Jason Chaffetz and Lisa Boothe.\nThe Fox News announcement of the program's debut stated that The Next Revolution would present news about politics within America and around the world; Hilton would also speak against the radical left and their goal to destroy America by globalism.\nOn June 1, 2023, Fox News announced that The Next Revolution would be ending its run as Hilton began “to focus on his new California non-partisan policy organization….” Hilton remains with the network as a contributor.\nHost\n*Steve Hilton, (2017–2023): Hilton, who joined Fox News in 2016 as a contributor, analyzes the effect of populism, both in the United States and throughout the world. In addition to his role at FNC, Hilton is the co-founder of Crowdpac, an independent and non-partisan Silicon Valley political and data start-up. The organization assists citizens in finding and endorsing political candidates whose ideologies match with theirs. He spent a year as a visiting fellow at Stanford University's Hoover Institution, has been a scholar at Stanford University's Freeman Spogli Institute for International Studies, has taught at Stanford's Hasso Plattner Institute of Design (Stanford d.school), and is the author of the Sunday Times bestseller More Human: Designing A World Where People Come First.\nFrequent guests\nBelow, are the names of various Fox commentators that contributed frequently to the show as guests and panelists.\n*Lisa Boothe: Fox News Contributor, host of The Truth w/ Lisa Boothe on iHeart Radio\n*Ben Domenech: Fox News Contributor, Podcast host\n*Tomi Lahren: Fox News Contributor, host of Tomi Lahren is Fearless on Outkick\n*Jason Chaffetz: Fox News Contributor\n*Tammy Bruce: Fox News Contributor\n*Morgan Ortagus: Former Department of State spokesperson\n*Sara Carter: Fox News Contributor\n*Rob Smith: Podcast host\n*Kat Timpf: Gutfeld! co-host, Fox News Analyst\n*Vivek Ramaswamy: 2024 Presidential Candidate, entrepreneur\nReferences"
    }
  ]
}