{
  "content": [
    {
      "type": "text",
      "text": "# The Warring States (film)\n\n| image = The-warring-states-2011-1.jpg\n| caption = Promotional poster\n| director = Chen Jin\n| producer = Lu Zheng\n| screenplay = Shen Jie\n| starring = Francis NgJing TianSun HongleiKim Hee-sunKiichi NakaiJiang Wu\n| music = S.E.N.S.\n| cinematography = Hyung-ku Kim\n| editing =\n| studio = Beijing Starlit Movie and TV Culture Co. Ltd.\n| distributor = China Lion Film Distribution\n| released =\n| runtime = 130 minutes\n| country = China\n| language = Mandarin\n| budget = ¥150 million (~US$24 million)\n| gross = $11,868,961\n}}\nThe Warring States  is a 2011 Chinese film directed by Chen Jin. The story takes place during the Warring States period, but is only very loosely based on the actual history. The plot focuses on the rivalry between military generals Pang Juan and Sun Bin, both disciples of Guiguzi.\nCast\n*Francis Ng as Pang Juan\n*Jing Tian as Tian Xi\n*Sun Honglei as Sun Bin\n*Kim Hee-sun as Pang Fei\n*Kiichi Nakai as King of Qi\n*Jiang Wu as Tian Ji\n*Feng Enhe as Emperor of Wei\nProduction\nProduction for The Warring States began in March 2010.\nReception\nCritical reception\nThe Warring States has been described as \"sweeping\" and \"melodramatic\". It has received mixed reviews from critics, with Rotten Tomatoes giving the movie a 40% rating (with an average score of 5.9/10), based on reviews from 5 critics.\nMike Hale of The New York Times found it difficult to follow the \"compressed, chaotic narrative\" without a \"familiarity with the byzantine history of China\". Hale noted that the film included \"huge numbers of arrows, soldiers, dead bodies and palace steps\".\nRobert Abele of the Los Angeles Times described the film as \"mildly confusing\" and \"unremarkable\" overall, though he praised the \"nifty fight sequences, clever bits of wartime subterfuge, scenic outdoor photography and Honglei's quirky charm\".\nSimilarly, Brent Simon of Screen International said the \"historical epic\" displayed \"impressive costume design and much natural scenic beauty\", but called it not \"particularly persuasive or enrapturing\".\nNick Schager of The Village Voice described the film's opening as \"invigorating\", but overall \"tedious\" and \"a morass of melodramatic romance, torture, and suicide\". Schager praised Sun Honglei's performance as the \"film's only truly epic element\".\nAvi Offer of NYC Movie Guru gave The Warring States a very positive review. Offer praised the \"thrilling war film\" for its \"exhilarating action sequences\", \"compelling dramatic scenes\", and \"exquisite set design, cinematography, musical score and costume design\".\nBox office\nThe Warring States earned $11.8 million worldwide. After six days of release, the film reached first place in China's box office chart.\nReferences\nExternal links\n*\n*\n*"
    }
  ]
}