{
  "content": [
    {
      "type": "text",
      "text": "# The Secret Invasion\n\n| runtime        = 95 minutes\n| country        = United States\n| language       = English\n| budget         = $592,000\n| gross          = $3 million1,167,281 admissions (France)\n}}\nThe Secret Invasion is a 1964 American action war film directed by Roger Corman. It stars Stewart Granger, Raf Vallone, Mickey Rooney, Edd Byrnes, Henry Silva, Mia Massini, and William Campbell. Appearing three years before The Dirty Dozen (1967), the film features a similar World War II mission where convicts are recruited by the Allies for an extremely hazardous operation behind enemy lines, with any convicts surviving the mission receiving a pardon.\nPlot\nIn 1943, British Intelligence in Cairo recruits Italian  criminal mastermind Roberto Rocca, demolitions expert and Irish Republican Army member Terence Scanlon, forger Simon Fell, cold-blooded assassin John Durrell, and thief and impersonator Jean Saval for a dangerous mission. The men are offered pardons in exchange for attempting to rescue an Italian general sympathetic to the Allies who is imprisoned in German-occupied Yugoslavia. The group is led by Major Richard Mace, who is trying to expiate his feelings of guilt for sending his own brother on a dangerous mission and waiting too long to extricate him. The fishing boat transporting Mace's team is stopped by a patrol boat, but they dispose of the Germans.\nWith the assistance of local partisans led by Marko, they split up and enter Dubrovnik. Durrell is partnered with Mila, a recent widow with a baby. They are attracted to each other, but Durrell becomes extremely distraught when he accidentally smothers her crying child to avoid detection by a German patrol. The team is captured and taken to the same fortress where the Italian general is being kept. They are tortured for information, but manage to escape and fulfill their mission, although Mace, Mila, Fell, Scanlon, and Saval are killed while fending off German troops.\nAt the last minute, Rocca and Durrell discover that the man they have freed is an impostor, and he is about to exhort \"his\" troops to stay loyal to the Axis. Durrell pretends to be a Nazi fanatic and shoots the fake general; he is killed by the outraged Italians. Rocca, the last man standing, directs the Italians' anger to the Germans.\nCast\n* Stewart Granger as Major Richard Mace\n* Raf Vallone as Roberto Rocca\n* Mickey Rooney as Terence Scanlon\n* Edd Byrnes as Simon Fell\n* Henry Silva as John Durrell\n* Mia Massini as Mila\n* William Campbell as Jean Saval\n* Helmo Kindermann as German Fortress Commander\n* Enzo Fiermonte as General Quadri\n* Peter Coe as Marko\n* Nan Morris as Stephana\n* Helmuth Schneider as German Patrol Boat Captain (credited as Helmut Schneider)\n* Giulio Marchetti as Italian Officer\n* Craig March as Petar Marasovic\n* Nicholas Rend\tas Captain of Fishing Boat\n* Todd Williams as Partisan Leader\n* Charles Brent as Monk\n* Richard Johns as Wireless Operator\n* Kurt Bricker as German Naval Lieutenant\n* Katrina Rozan as Peasant Woman\n* Fortunato Arena as Sailor Firing Signal Rocket (uncredited)\n* Mladen Cernjak as Little Boy On The Market (uncredited)\nProduction\nand Bokar, along with the MinÄeta Tower were featured in The Secret Invasion.]]\nAfter turning out a treatment based on the locale of Dubrovnik, Roger Corman teamed with screenwriter R. Wright Campbell who had a project, Dubious Patriots about a wartime mission involving convicts, that had similarities to his screenplay for Corman's Five Guns West. The script was taken over by producer David V. Picker at United Artists, who was able to leverage the screenplay into a well-financed studio production. With a budget of $600,000, more than twice more than he had for his earlier independently-funded features, Corman was able to start production in between his Edgar Allan Poe adaptations, The Masque of the Red Death and The Tomb of Ligeia (1964).\nThe original cast was Mickey Rooney, Raf Vallone, Edd Byrnes and Bobby Darin. Brendan Behan was to be adviser for scenes set at Borstal Prison. It was Byrnes first role after his contract with Warner Bros ended.\nIn August 1963 it was announced that Darin had pulled out of the film on the orders of his doctor, and he was replaced by Henry Silva. Also that month Stewart Granger signed to star. Screenwriter Campbell's brother actor William Campbell was added to the cast.\nPrincipal photography under the working title of Dubious Patriots took place on location in Dubrovnik and other parts of Yugoslavia in the summer of 1963 for a typically short Corman shooting schedule of 36 days. With the assistance of the Yugoslavian government, a large number of military personnel and equipment were offered, but an earthquake threatened to delay the production when troops were siphoned off to help in the relief effort.\nCorman's problems extended to not only wrangling military extras, but also to dealing with the emotions of a star like Stewart Granger \"stooping\" to make a \"B film\" and worrying that his role was not as prominent as the others in the ensemble cast. At one point, Corman actually rewrote his part \"on the spot\" so that Granger had more lines than Edd Byrnes, his co-star, who was a current popular television star.\nThe production was photographed in Panavision with Eastmancolor film.\n(Gene Corman later reused the title The Dubious Patriots for another film he made with Tony Curtis and Charles Bronson.>)\nReception\nIn a contemporary review of The Secret Invasion, The New York Times film reviewer Howard Thompson saw some positives in what was basically a \"programmer\":\n... a rather surprising amount of brisk muscularity and panoramic color, if not always credibility. The casting of this United Artists release, which arrived at the Criterion and other houses, may make some customers blink and wait for the worst ... But they, and the picture, do pretty well, considering.\nIn ''Brassey's Guide to War Films'', film historian Alun Evans considered the production exemplified Corman's ability to \"... create something out of nothing.\" He also noted that The Secret Invasion has some notoriety as  \"... the  sawn-off antecedent of The Dirty Dozen.\"\nSee also\n* List of American films of 1964\n* Five Guns West, an earlier Roger Corman movie of essentially the same plot\nReferences\nNotes\nCitations\nBibliography\n* Corman, Roger and Jim Jerome. How I Made a Hundred Movies in Hollywood and Never lost a Dime. New York: Muller, 1990. .\n* Evans, Alun. ''Brassey's Guide to War Films''. Dulles, Virginia: Potomac Books, 2000. .\nExternal links\n*\n*\n*"
    }
  ]
}