{
  "content": [
    {
      "type": "text",
      "text": "# The Philosophy of Andy Warhol\n\nThe Philosophy of Andy Warhol (From A to B & Back Again) is a 1975 book by the American artist Andy Warhol. It was first published by Harcourt Brace Jovanovich.\nThe book is an assemblage of vignettes about love, beauty, fame, work, sex, time, death, economics, success, and art, among other topics, by the \"Prince of Pop\".\nIn October 2019, an audio tape of publicly unknown music by Lou Reed, based on the book, was reported to have been discovered in an archive at the Andy Warhol Museum in Pittsburgh.\nBackground\nWarhol signed two book contracts in 1974 with Harcourt, one for The Philosophy and the second for a biography of Paulette Goddard, which was never completed.\nThe Philosophy was ghostwritten by Warhol's frequent collaborator, Pat Hackett, and Interview magazine editor Bob Colacello. Much of the material is drawn from taped interviews Hackett did with Warhol specifically for the book, and also from conversations Warhol had taped between himself and Colacello and Brigid Berlin.\nRelease\nThe Philosophy was published by Harcourt Brace Jovanovich in August 1975. Warhol signed 14,000 copies of the book at the warehouse before it was released.\nAn excerpt from the book was published in the September 1975 issue of Cosmopolitan magazine.\nWarhol promoted the book in September 1975 on an eight-city U.S. book tour, followed by stops in Italy, France, and England.\nReception\nBarbara Goldsmith of The New York Times stated, \"Warhol's basic philosophical premise is 'nothing'; not the futility of human endeavor of Sartre and Camus, or the void beyond pain of Joan Didion, but simply—nothing added.\" \"The sections of this book that tell us about Andy's own life are fresh and illuminating,\" she added. Although Goldsmith doubted that Warhol wrote the book himself, she noted that \"it doesn't really matter, which is his point exactly. The important message is how Warhol managed to make himself into a machinelike presence devoid of empathy.\"\nJohn Raymond of The Atlanta Journal-Constitution wrote: \"Andy Warhol's philosophy is not a philosophical system in the accepted sense … Even esthetics, which as an artist you might think would interest him, doesn't really. 'After I did the thing called \"art,\"' he tells us, 'or whatever it's called, I went into business art. I wanted to be an art business man or a business artist. Being good in business is the most fascinating kind of art.\"\nOwen Findsen of The Cincinnati Enquirer observed that \"the book reads like a Richard Brautigan novel about a character that combines the humor and self-image of Woody Allen with the moral ethics of Tiny Tim.\nReferences\nSources\n*\n*"
    }
  ]
}