{
  "content": [
    {
      "type": "text",
      "text": "# The King's Damosel\n\n'The King's Damosel (also known as The King's Damsel') is a fantasy novel based on Arthurian legend by Vera Chapman first published in 1976. It served as the inspiration for the 1998 Warner Bros. film Quest for Camelot. It is part of the Three Damosels trilogy, along with The Green Knight and ''King Arthur's Daughter''.\nPlot overview\nThe novel follows the experiences of Lynette of Arthurian Legend after she saves her sister Leonie from the Red Knight, covering the events of the original legends as a series of flashbacks and vastly expanding Lynette's character.\nPlot summary\nLynette and her sister Leonie have a dual wedding to the brothers Gaheris and Gareth, respectively. After the festivities are over, the two sisters are dragged to their bedrooms and prepared by bridesmaids for the first night of their honeymoons. Lynette is miserable, as she is in fact in love with Gareth, and thinks with envy of Leonie. She is also terrified of what is about to happen, as she was raped by a friend of her father's who was like a mentor to her. She is convinced that Gaheris will know that she is not a virgin, and she will be publicly shamed. However, when Gaheris enters the honeymoon suite, he merely comments that he does not want this, either. He sleeps next to her, without touching, and leaves before she wakes.\nIn a flashback to the events leading up to the wedding, the Red Knight, a knight who claims to owe no loyalty to King Arthur, attacks Lynette's home in the absence of any male figureheads, holding the household hostage until Leonie consents to marry him and make him Lord. Lynette disguises herself as a servant boy and escapes, going to Camelot and pleading with Arthur to help her rescue Leonie. Aided by Merlin (who had appeared to her once before, after she was raped), she receives Arthur's blessing, but he only sends one man with her – Gareth, whom she presumes to be a kitchen boy. She is rude to him, feeling resentful towards Arthur for his choice. However, Gareth soon proves himself and in the course of rescuing Leonie, Lynette realises that she has fallen in love with him. Upon the group's return to Camelot, it is arranged that Gareth shall marry Leonie as his reward, and Lynette shall wed Gareth's older brother, Gaheris.\nAfter Gaheris' departure, Lynette is worried about what will happen to her – abandoned by her husband, and forced to watch Gareth in Leonie's company. Again Merlin intervenes, and Lynette convinces Arthur to make her his messenger. She is to go alone ahead of the knights to persuade unruly Lords to swear their allegiance to Arthur.\nLynette acts so bravely and gracefully in the course of this work that she earns the respect of all those who travel with her (including Guinevere's unlucky admirer, Lancelot). She later meets up again with the man who raped her as a child and beheads him; she is later haunted by his ghost, but eventually forgives him, freeing herself from the creatures which were released each time she laid a curse upon him.\nShe is also separated from her party in strange lands and kidnapped; she eventually finds her way out through a network of caves with the help of a young man named Lucius. Lucius has lived in the dark so long that he is blind and pale. Lucius was imprisoned along with his mother, who subsequently died, but he met a sort of witch outside the caves who befriended him, and he is happy with his simple life. Lynette spends time with the pair, and eventually falls in love with Lucius. Lynette feels simultaneously pleased that Lucius can not see how plain she is, and guilty for being convinced that he would not want her if he could only see her.\nEventually, the witch informs Lynette that Lucius is dying. Horrified, Lynette decides to seek out the Holy Grail and use it to save Lucius. She sets out with her travelling companions from before, and after a long journey, she manages to retrieve the Grail. She hurries back with it to Lucius, resolving that she will let him do with it as he pleases. Upon receiving the Grail, Lucius wishes for sight rather than life, so that he can finally see Lynette. Upon opening his eyes, he cries out with delight, repeatedly telling Lynette that she is beautiful.\nThe pair have a little more time together, which Lynette tries to make the best of. Lucius dies, and she and the witch bury him before she sets out once again, to resume her post as the King's Damosel.\nFilm adaptation\nIn 1998, Warner Bros. released an animated film titled Quest for Camelot, which is loosely based upon Chapman's novel. Significant changes were made to the plot and themes of the story, including the following:\n* Lynette is renamed Kayley; she has no older sister, and is trying to save her mother from Ruber by retrieving Excalibur and warning Arthur of the impending attack on Camelot.\n* The darker elements of Lynette/Kayley's childhood, including her rape, are absent. Instead, she has a seemingly perfect childhood up until her father is killed by Ruber. In both versions, she is portrayed as a tomboy who has more interest in horseback riding and combat than more \"ladylike\" pursuits.\n* The characters of Gareth and Lucius are combined into that of Garrett, a blind hermit who dreamed of becoming a knight prior to his accidental blinding who accompanies Kayley on her adventure, albeit reluctantly. In both versions, Gareth/Garrett surprises Lynette/Kayley by turning out to be more than he seemed (Lynette assumed Gareth was a kitchen boy; Kayley initially doesn't realise that Garrett is blind, and is surprised to learn he knew her father), though in the movie she is far nicer to him than in the original legend.\n* The Red Knight is replaced by Ruber, a former Knight of the Round Table who wishes to steal Excalibur and usurp the throne.\n* The movie added several trademark elements of children's animation, including several \"talking animal sidekicks\" (Devon and Cornwall, Bladebeak, Ruber's griffin and Ayden, though Ayden is the exception in that he doesn't speak but displays a human-like personality) and musical numbers.\nExternal links\n* https://web.archive.org/web/20070208180112/http://www.tolkiensociety.org/ts_info/folk/vera-chapman.html"
    }
  ]
}