{
  "content": [
    {
      "type": "text",
      "text": "# The Briar King\n\nThe Briar King is a fantasy novel by American writer Greg Keyes, the first book of four in the series The Kingdoms of Thorn and Bone.\nPlot summary\nThe Born Queen, Virgenya Dare, defeats the evil Skasloi with magic and frees humanity from slavery. The Skasloi king tells Virgenya humanity is cursed. About 2300 years later, Dare's grave is found by her descendant, rebellious Princess Anne.\nThe forester Aspar White rescues a novice monk, Stephen Darige, from a kidnapping. Aspar is warned about the mythical Briar King by the strange Selfry travellers.\nEvil Prince Robert murders his sister and tricks his brother into war with nearby Hansa. Queen Muriele secretly sends Anne and her friend Austra to a convent to be trained as an assassin. Muriele and her two other daughters evacuate to the country, aided by loyal knight Neil MeqVren who is in love with Princess Fastia.\nAt the monastery, Stephen finds corruption within the church, and prophecies concerning the terrifying Briar King. Beneath the castle, the captive last Skasloi (known as \"the Kept\") makes evil predictions. Anne's training takes a strange turn as she finds herself in a magical realm. On her return, Anne is warned she must be Queen to save the world.\nThe other princesses are murdered as Neil and Muriele watch helplessly - themselves saved only by the appearance of the Briar King. As the assassins aim for their final target, Anne and Austra escape the mass slaughter at the convent, aided by swordsman Cazio and his mentor z'Acatto. Prince Robert murders the king who deals a fatal wound as he dies.\nMuriele, back in Eslen, consults the Kept from whom she gets the most terrible curse imaginable to cast on the murderer of her husband. She does not know that it was Robert and that he is also dead. The curse, however, is more powerful even than death and by casting this on Robert, Muriele inadvertently and unintentionally breaks the Law of Death.\nThe Briar King ends with the awakening of Robert, now a form of undead, which also explains the title of the next volume, The Charnel Prince.\nCharacters\n* Virginia Elizabeth Dare, also known as Virgenya. A born queen (rather than royal consort) and warrior who freed humans and Sefry from the Skasloi slavemasters\n* Anne Dare, daughter and potential heir to the Empire of Crotheny\n* Austra, Anne's maid and close friend\n* William Dare, King William II of Eslen and Emperor of Crotheny\n* Muriele Dare, of the House of Liery\n* Sir Robert Dare, brother of King William, treacherous usurper\n* Charles Dare, \"saint-touched\" son of King William\n* Sir Neil MeqVren, of Skern, honorable knight sworn to protect Muriele\n* Stephen Darige, of Virgenya, scholar and monk\n* Aspar White, the King's holter, gruff, grumpy, but honorable\n* Winna, Aspar's significant other\n* Erren, Muriele's assassin-bodyguard and close friend\n* Lesbeth, Robert's twin sister\n* Fastia, Princess of Crotheny. The eldest, serious-minded and dutiful\n* Elseny, Princess of Crotheny. Sweet and good-natured\n* Elyoner, Duchess of Crotheny. Kindly but mischievous\n* Cazio Pachiomadio da Chiovattio, duellist swordsman\n* z'Acatto, Cazio's instructor and friend\n* Lady Gramme, the King's mistress, ambitious lady of middle years\n* Alis Berrye, the King's mistress, young and simple\n* Praifec Marché Hespero, the leader of the local church\n* Fend, the one-eyed Sefry and Aspar's nemesis\n* The Briar King, long thought to be legend, the dangerous spirit of wild nature\n* the Kept, the last of the Skasloi, held captive for two thousand years\n* the Sefry, a mysterious non-human people among whom Aspar was raised\nReferences to lost Roanoke Colony\nThe Briar King provides a fantasy explanation for the mysterious disappearance of the Roanoke Colony in 16th century Virginia, suggesting the colonists had been abducted by the dimension-crossing Skasloi and enslaved. Virginia Dare was a real person, dubbed the \"first English child born in the Americas\". With subtle linguistic change, \"Virginian\" became \"Virgenyan\", which translated in the language of the slaves as \"the born men\".\nReferences\nExternal links\n*[http://www.sfsite.com/03b/bk148.htm Page at sfsite.com]"
    }
  ]
}