{
  "content": [
    {
      "type": "text",
      "text": "# The Battle of New Orleans__disambig_1\n\n| genre      =\n* Country\n* novelty\n* march\n| length     = 2:30\n| label      = Columbia\n| writer     = Jimmy Driftwood\n| producer   = Don Law\n| prev_title = When It's Springtime in Alaska (It's Forty Below)\n| prev_year  = 1959\n| next_title = Johnny Reb\n| next_year  = 1959\n}}\n\"The Battle of New Orleans\" is a song written by Jimmy Driftwood in 1936. The song describes the Battle of New Orleans from the perspective of an American soldier; it tells the tale of the battle with a light tone and provides a rather comical version of what actually happened at the battle. It has been recorded by many artists, but the singer most often associated with this song is Johnny Horton. His version, recorded at Bradley Studios in Nashville, Tennessee, scored number 1 on the Billboard Hot 100 in 1959 (see 1959 in music). Billboard ranked it as the No. 1 song for 1959, it was very popular with teenagers in the late 1950s/early 1960s in an era mostly dominated by rock and roll music.\nHorton's version began with the quoting of the first 12 notes of the song \"Dixie\" by Daniel Emmett. It ends with the sound of an officer leading a count off in marching, as the song fades out.\nIn Billboard magazine's rankings of the top songs in the first 50 years of the Billboard Hot 100 chart, \"The Battle of New Orleans\" was ranked as the 28th song overall and the number-one country music song to appear on the chart.\nMembers of the Western Writers of America chose it as one of the Top 100 Western songs of all time.\nIn 1959 at the 2nd Annual Grammy Awards, Johnny Horton won the Grammy for Best Country & Western Performance and Song of the Year for his recording of \"The Battle Of New Orleans\". In 2002, the 1959 recording of the song by Horton on Columbia Records was inducted into the Grammy Hall of Fame.\nHistory\nThe melody is based on a well-known American fiddle tune \"The 8th of January\", which was the date of the Battle of New Orleans. Jimmy Driftwood, a school principal in Arkansas with a passion for history, set an account of the battle to this music in an attempt to get students interested in learning history. It seemed to work, and Driftwood became well known in the region for his historical songs. He was \"discovered\" in the late 1950s by Don Warden, and eventually was given a recording contract by RCA, for whom he recorded 12 songs in 1958, including \"The Battle of New Orleans\".\nChart performance\nWeekly charts\n{|class=\"wikitable sortable\"\n|-\n!Chart (1959)\n!Peakposition\n|-\n|Australian Singles Chart\n| style=\"text-align:center;\"|1\n|-\n|Canadian CHUM Chart (7 weeks at #1)\n| style=\"text-align:center;\"|1\n|-\n|U.K. Singles Chart\n| style=\"text-align:center;\"|16\n|-\n|Italian Singles Chart\n| style=\"text-align:center;\"|20\n|-\n|U.S. Billboard Hot Country Singles\n| style=\"text-align:center;\"|1\n|-\n|align=\"left\"|US Billboard Hot 100\n| style=\"text-align:center;\"|1\n|-\n|-\n|U.S. Cash Box Top 100\n|align=\"center\"|1\n|}\nYear-end charts\n{| class=\"wikitable\"\n|-\n!Chart (1959)\n!Position\n|-\n| U.S. Billboard Hot 100\n| style=\"text-align:center;\"|1\n|-\n| U.S. Cash Box\n| style=\"text-align:center;\"|2\n|-\n|South Africa (Springbok)\n|align=\"center\"|17\n|}\nAll-time charts\n{|class=\"wikitable\"\n!Chart (1958–2018)\n!Position\n|-\n|US Billboard'' Hot 100\n| style=\"text-align:center;\"|37\n|}\nCertifications\nOther versions\nCovers and remakes\nJohnny Horton's 1959 version is the best-known recording of the song, which omits the mild expletives and many of the historical references of the original. Horton also recorded an alternative version for release in British Commonwealth countries, avoiding the unfavorable lyrics concerning the British: the word \"British\" was replaced with \"Rebels\", along with a few other differences.\nMany other artists have recorded this song. Notable versions include the following:\n* In the United States, Vaughn Monroe's 1959 single competed with Horton's but did not achieve the same degree of success and became only a minor Hot 100 hit.\n* In Britain, Lonnie Donegan and his Skiffle Group's 1959 version competed with Horton's and achieved greater success, peaking at number two. This version includes a spoken introduction, in which Donegan explains that the British were on the losing side.\n* Pete Seeger and Frank Hamilton recorded the song for their 1959 album Nonesuch and Other Folk Tunes.\n* The Royal Guardsmen covered the song on their 1966 album Snoopy vs. the Red Baron\n* Harpers Bizarre had a minor Hot 100 hit with their somewhat psychedelic version from their 1968 album The Secret Life of Harpers Bizarre.\n* Doug Kershaw recorded the song for his third LP, Doug Kershaw in 1971\n* Sunny Ryder sang a version of the song in the 1971 spaghetti western A Town Called Hell\n* Johnny Cash's version of the song is on the 1972 album America: A 200-Year Salute in Story and Song.\n* The Germany-based Les Humphries Singers' 1972 hit, \"Mexico\", used the melody and parts of the lyrics, violating copyright by crediting the song to the British-born bandleader Les Humphries. In 1982 the Les Humphries Singers re-released a remixed version \"Mexico\" with different lyrics, which charted in the Netherlands. Another new release in 2006 contained the original lyrics again.\n* Leon Russell's cover of the song is on his 1973 album ''Hank Wilson's Back Vol. I.\n* Nitty Gritty Dirt Band had a minor Hot 100 hit with their version in 1974.\n* Commander Cody and his Lost Planet Airmen played a cover version of the song at their performance in New York City on September 14, 1976.\n* Dolly Parton performed the song on her 1976/1977 variety show, Dolly.\n* Bill Haley recorded a version in 1979 at his final recording sessions and it was released on his final album, Everyone Can Rock and Roll.\n* The song features prominently in the 1982 film Veronika Voss directed by Rainer Werner Fassbinder.\n* Sha Na Na appropriately performed the song as a part of a War of 1812 themed skit on their show.\n* Cornershop covered the song as a bonus track for their 2009 album Judy Sucks a Lemon for Breakfast.\n* Kingfish recorded a live version at their 1976 concert at the Beacon Theatre, Kingfish in Concert, released in 1996.\n* Icelandic singer Erling Ágústsson recorded a cover titled Við gefumst aldrei upp (\"We Never Give Up\").\n* Les Claypool released a version on his 2014 Duo de Twang debut album Four Foot Shack with Bryan Kehoe.\n* Deep Purple included a version of the song on their 2021 covers album Turning to Crime''.\nParodies\n\"The Battle of Kookamonga\"\nCountry music parodists Homer and Jethro parodied \"The Battle of New Orleans\" with their song \"The Battle of Kookamonga\". The single was released in 1959 and featured production work by Chet Atkins. In this version, the scene shifts from a battleground to a campground, with the combat being changed to the Boy Scouts chasing after the Girl Scouts.\nOther parodies\n*\"The Battle Of Queenston Heights\" by Mike Darow and the Chums, 1959 (#17). (Battle of Queenston Heights)\n*\"The Battle of the Waikato\" by Howard Morrison Quartet, 1960.\n*\"Deer Hunter's Lament\" by Stew Clayton, 1973.\n* The Mexican group El Tren recorded a parody titled \"La Batalla del Cinco de Mayo\", 1980, telling the events of Cinco de Mayo.\n*One verse of \"The Battle of All Saints Road\" by Big Audio Dynamite, 1988 (another verse parodies \"Duelling Banjos\").\n*\"The White House Burned\" recounts the War of 1812 by Three Dead Trolls in a Baggie, 1991.\n*\"Ballad of Hank Williams\" by Hank Williams Jr., 1981\n*\"The New Battle of New Orleans,\" recounting Hurricane Katrina, by Ray Stevens, 2005.\n*\"The Ballad of Fetteh Shmeel\" by Country Yossi and the Shteeble-Hoppers, reworks the tune with a Jewish message, on the 2005 LP Break Out.\n*\"The Falklands War Song\" is a version recounting the Falklands War from the British perspective.\n*\"Bannockburn\" by Scottish singer-songwriter Matt McGinn, most famously performed by the Scots duo The Corries, describes a comical take on the Battle of Bannockburn in Scotland in 1314.\n*\"The Ballard of Isadore Comeaux\" by Johnny Blaine, 1963.\nSee also\n* American fiddle\nReferences\nFurther reading\n*Collins, Ace. ''Songs Sung, Red, White, and Blue: The Stories Behind America's Best-Loved Patriotic Songs''. HarperResource, 2003.\nExternal links\n*[http://www.tsimon.com/battle.htm Tom Simon's Battle of New Orleans page]\n*[http://memory.loc.gov/ammem/today/jan08.html Library of Congress page], includes a recording of \"The Eighth of January\""
    }
  ]
}