{
  "content": [
    {
      "type": "text",
      "text": "# The Valley-Westside War\n\nThe Valley-Westside War is a 2008 American young adult alternate history novel by Harry Turtledove. It is the sixth and final book in the Crosstime Traffic series.\nBackground\nIn The Valley-Westside War, a global nuclear war broke out between the United States and the Soviet Union in 1967, leading to the collapse of civilization. The book is set in the ruins in what was once Los Angeles, 130 years after the war. The area of the city is controlled by two rival feudal states at war with one another: the Kingdom of Westside and the Kingdom of the Valley. The Crosstime Traffic team is dispatched to investigate the remains of the UCLA library in an attempt to discover what happened to cause the initial nuclear war, but are caught up in the local war by citizens of both kingdoms who believe that they are trying to access the knowledge of the old people to create advanced weapons.\nPlot summary\nThe Mendoza family, funded by a Crosstime Traffic grant and disguised as traders, return to postwar Earth to learn who initiated the hostilities. Liz Mendoza frequently visits the UCLA library to analyze the period books and magazines, searching for insight and reasons for the conflict. It is on her regular trips to the library that she meets Dan, a Valley soldier whom she initially considers dull and dumb. Dan, however, is not as unschooled and ignorant as Liz thinks, and, although he is attracted to her, he has his misgivings about the Mendozas. His suspicions are confirmed, and he blows their cover and causes them to return to their own time alternate, but not before he asks why someone from a different time, who has the knowledge and expertise to help Earth recover from its postwar havoc, does nothing.\nReception\nThe School Library Journal gave the novel a good review saying fans of dystopias would enjoy the story.  SF Scope said the novel was \"an interesting exploration of what a post-apocalyptic world might be\" but found the characters, except for Liz and Dan, to be little more than ciphers.  The Los Angeles Times did not give a positive review describing the book as sloppy and saying it failed to live up to other dystopias based on alternate histories like The Man in the High Castle, The Difference Engine, or The Plot Against America.\nSee also\n* Ape and Essence\n* A Canticle for Leibowitz\n* Lud\nReferences"
    }
  ]
}