{
  "content": [
    {
      "type": "text",
      "text": "# The Stainless Steel Rat for President\n\nThe Stainless Steel Rat for President is the fifth Stainless Steel Rat novel, written by Harry Harrison in 1982.\nPlot summary\nThe Stainless Steel Rat for President is a comic science fiction novel in which interstellar con man Slippery Jim DiGriz and his family clean up corruption on the banana republic world called Paraiso-Aqui.\nAfter realizing that a planetary dictator is rigging elections, the rat decides to oust him by running as a competing candidate.  As his Vice President, he chooses a fair man who should have been president if not for the corruption.  Since the entire media, military, and political establishment is on the side of the dictator, DiGriz has few tools at his disposal.  He uses political judo on his opponent.  After deliberately angering the dictator into creating a blowout political election, DiGriz conducts a live interview in a precinct where 100% of the vote went to the incumbent.  He then asks each villager to publicly state who they voted for and they all say DiGriz.  This is clear evidence that fraud was committed, which forces a redo of the election with better balloting controls. After winning the (mostly) fair election, DiGriz feigns being assassinated so that the Vice President can take over.\nReception\nKen Ramstead reviewed The Stainless Steel Rat for President in Ares Magazine #17 and commented that \"The Stainless Steel Rat for President is the product of a craftsman comfortable and satisfied with his work; Harrison has hit his stride with his latest effort, and his readers can hopefully look forward to more of the same.\"\nIn other media\nIn Computer Gaming World, editor Johnny Wilson adapted scenes from The Stainless Steel Rat for President into unofficial scenarios for the SSI tactical space combat game Galactic Gladiators.\nReviews\n*Review by Jude Camillone (1982) in Fantasy Newsletter, #54 December 1982\n*Review by Joseph Nicholas (1983) in Paperback Inferno, Volume 6, Number 4\n*Review by Frank Catalano (1983) in Amazing Science Fiction, May 1983\n*Review by John Silbersack (1983) in Heavy Metal, September 1983\nReferences"
    }
  ]
}