{
  "content": [
    {
      "type": "text",
      "text": "# The Kingmaker (film)\n\n| producer       =\n| writer         = Lauren Greenfield\n| starring       =\n| music          = Jocelyn Pook\n| cinematography =\n| editing        = Per K. Kierkegaard\n| studio         =\n| distributor    =\n| released       =\n| runtime        = 100 minutes\n| country        = United States\n| language       = English\n| budget         =\n| gross          = $352,274\n}}\nThe Kingmaker is a 2019 documentary film written and directed by Lauren Greenfield, featuring the political career of Imelda Marcos with a focus on the Marcos family's efforts to rehabilitate the family's image and to return to political power, including her plans to see her son, Bongbong, become President of the Philippines, and the alliance that Bongbong and Imee Marcos established with Rodrigo Duterte in his bid to win the 2016 Philippine presidential election.\nIt debuted internationally in August 2019 at the 76th Venice International Film Festival, and debuted in the Philippines on January 29, 2020.\nThe Kingmaker was nominated as best documentary at the BFI London Film Festival and the Stockholm International Film Festival, and for the Checkpoints Award at the Bergen International Film Festival. It was nominated for four categories in the 2019 Critics' Choice Documentary Awards, eventually winning the award for Most Compelling Living Subject of a Documentary. It also received the Audience Award for Best Documentary Film at the 2019 Warsaw Film Festival.\nPlot\nGreenfield's exploration of Imelda Marcos's narrative takes on what The New York Times calls a \"dialectic\" approach, allowing Imelda to tell her narrative and slowly introducing opposing viewpoints as the movie progresses.\nThe film is organically divided into two parts, following the chronology of the events of Marcos's life.\nThe first half focuses on Imelda's life from the time she became first lady of the Philippines in 1965, through the 21 years where she and her husband ruled the Philippines, until they were deposed and forced into exile by the 1986 People Power Revolution.\nAs described by IndieWire, the second half of the film \"features survivors of her husband's declaration of martial law and focuses on the political comeback of the Marcos family,\" focused on the ascension of her son, Bongbong Marcos, to increasingly prominent national posts.\nSubjects featured\nAside from Imelda Marcos herself, other figures Greenfield featured in the documentary include Marcos' son, the vice-presidential candidate Bongbong Marcos; former Philippine President Benigno Aquino III; Vice president Leni Robredo who had defeated Bongbong Marcos in the 2016 Philippine vice presidential election; former Presidential Commission on Good Government head Andres Bautista; and Martial Law torture survivors including former Commission on Human Rights chair Etta Rosales, and journalist-screenwriter Pete Lacaba.\nPortrayal of Marcos\nIn numerous promotional interviews, Greenfield characterizes Imelda Marcos as the documentary's unreliable narrator.\nIn various interviews, Greenfield says she did not know this was going to be the case.  She went into the first interviews with Marcos without knowing what to expect.\nIn an interview with Vox, Greenfield recounts thinking Imelda was being \"surprisingly candid\" in her first interview, and that she first thought Marcos actually believed her own words.  Greenfield only realized that some of Marcos's statements were \"obviously untrue\" once she did further research.  In later interviews, the topics got to \"really egregious things,\" which Greenfield says made it \"really clear\" Marcos was lying.\nIn an interview with Fortune, Greenfield says:\nDialectic approach\nGreenfield recounts that Marcos was so effective that test-viewers who watched the interviews could not tell whether or not Marcos was lying.  So in order to make sure viewers understood that something Marcos was saying was untrue, Greenfield would intersperse interviews with people who knew otherwise, such as Martial Law torture victims and officials who investigated the Marcoses. This resulted in a narrative style which the New York Times described as \"dialectic.\"\nInterviews as cinéma vérité\nAnother method Greenfield used in order to show that Imelda Marcos is an unreliable narrator was to turn the interviews into instances of Cinéma vérité, showing that Marcos was making efforts to project a pre-planned image of herself.  One example prominently shown in early trailers shows how Marcos accidentally knocks over a glass picture frame, but doesn't acknowledge the fact even while a uniformed servant cleans the glass shards off the floor for her.\nGreenfield tells Fortune Magazine:\nRelease\nThe film had its world premiere at the Venice Film Festival on August 29, 2019. It also screened at the Telluride Film Festival on August 31, 2019, and the Toronto International Film Festival on September 9, 2019. The film was released in the United States in a limited release on November 8, 2019, by Greenwich Entertainment. It was broadcast on Showtime on February 28, 2020.\nThe Kingmaker made its Philippine debut on January 29, 2020, when it was shown for the first time at the Cultural Center of the Philippines (CCP). Both Imelda and Bongbong Marcos were invited to the premiere but did not respond to Greenfield's invitation, and two of President Aquino's sisters, Viel Aquino-Dee and Ballsy Aquino-Cruz, attended a later screening at the University of the Philippines Diliman on February 25, 2020. It was later released on iWantTFC, the streaming platform of ABS-CBN, on May 15, 2020, and made available to watch on demand starting August 1 of that year.\nOn March 19, 2022, the original documentary premiered in the Philippines for free on YouTube with more than 500,000 views as of May 4, ahead of the May 9 elections. The Tagalog dub and Tagalog subtitle version was released on March 30 which is also accessible in the official Evergreen Pictures YouTube channel.\nFive separate Tagalog-dubbed versions of the film with subtitled versions in Tagalog, Bisaya, Ilocano, Bicolano, and Hiligaynon premiered on the first week of April 2022 with a preceding announcement by Greenfield via Twitter. They can all be accessed and downloaded for free in Evergreen Pictures' Vimeo and official website of the Digital Museum of Martial Law.\nThe documentary was also streamed in various local film festivals in the Philippines.\nReception\nCritical response\nThe Kingmaker received critical acclaim and has }} rating from Rotten Tomatoes. The critical consensus on Rotten Tomatoes reads, \"The Kingmaker aims a disquieting spotlight at the private life of a divisive public figure – as well as the ways in which unchecked power seduces and corrupts.\" On Metacritic, the film has a weighted average score of 76 out of 100 based on 16 critics.\nAccolades\nThe Kingmaker was nominated for numerous Best Documentary Awards, including the 2019 BFI London Film Festival, the 2019 Stockholm International Film Festival, the 2019 Bergen International Film Festival, the 2020 Chicago Independent Film Critics Circle Awards, the 2019 El Gouna Film Festival 2019, the 2020 Hollywood Critics Association Awards, the 2019 Philadelphia Film Critics Circle Awards, and the 2019 Warsaw Film Festival (which it won).\nIt was also nominated for four categories in the 2019 Critics' Choice Documentary Awards, eventually winning the award for Most Compelling Living Subject of a Documentary.\nGreenfield also received a nomination at the 72nd Writers Guild of America Awards for Best Documentary Screenplay. With this second WGA nomination, she became the first woman ever to achieve this honor.\nReferences\nExternal links\n*"
    }
  ]
}