{
  "content": [
    {
      "type": "text",
      "text": "# The Key (Fear the Walking Dead)\n\n| director     = Ron Underwood\n| writer       = David Johnson\n| length       = 51 minutes\n| music        =\n| guests       = * Colby Minifie as Virginia\n* Peter Jacobson as Jacob Kessner\n* Holly Curran as Janis\n* Craig Nigh as Hill\n* Joseph Castillo-Midyett as Cigarette Man\n| prev         = Alaska\n| next         = Honey\n| episode_list = List of Fear the Walking Dead episodes\n| season_article = Fear the Walking Dead (season 6)\n}}\n\"The Key\" is the fourth episode of the sixth season of the post-apocalyptic horror television series Fear the Walking Dead, which aired on AMC on November 1, 2020, in the United States.\nPlot\nJohn writes letters to June in which he expresses his budding appreciation for their new camps, and his hopes that they can be reunited. Assigned to security, John is on patrol when he finds Cameron stuck in the fences, devoured by walkers.\nElsewhere, Morgan has recovered from his injury and is travelling with Emile’s bloodhound, Rufus.\nBack to the camp, John investigates Cameron’s death and finds an earring at the scene. John talks to Cameron’s companion, Janis, but Janis denies the earring is hers. John then meets with Victoria and shows her the earring. Virginia asks him to keep things quiet so people won’t be alarmed.\nDuring Cameron's funeral, the Rangers catch Janis trying to escape the camp. Virginia searches Janis’ bag and produces the other earring. As John locks up Janis, Janis claims that Virginia is setting her up. John goes to Virginia, but Virginia tells him to drop any further investigation, adding threateningly that she has read all the correspondance between him and June.\nAt dusk, John exhumes Cameron's corpse. He discovers the broken piece of a knife’s handle lodged in Cameron's hand. John reaches out to Strand to discusses his findings. Strand, who is now on the “inter-settlements committee”, takes John to the locked armory where they discover that a matching knife is missing, suggesting a high ranking individual’s involvement. However, back to the prison cell, a forlorn Janis confesses to murdering Cameron and accepts execution.\nIn anguish because he believes Janis is innocent, John goes to Jacob’s and leave a letter for June. That night, John is heading out to break Janis free, when he hears the blaring of a radio: Janis has been bound outside the gates and devoured by walkers. Furious, John sets to find out who pushed forward Janis’ execution. Strand emerges, claiming it was him. The two fight, and Strand tells John he saved both his and June’s lives with his action.\nThe next day, in a formal ceremony, Virginia pins a golden key onto John’s chest and names him Ranger. Later, John lies in bed despondently when June arrives: Virginia has transferred June as a reward for John’s silence.\nElsewhere, Morgan is on the roads when his truck is hit by another car. As he gets out to investigates, two men emerge. They demand where Emile is and ask for “the key”. After winning the ensuing fight, Morgan retrieves a key hanging from his neck and wonders what it unlocks.\nReception\nperformance was critically acclaimed while the development of John Dorie was also praised.]]\nDavid S.E. Zapanta of Den of Geek! rated the episode 4 out 5, and wrote: \"I was surprised they were dispatched so quickly, but it’s just as well. With only four episodes left, Fear still has a lot of ground to cover. Fortunately, this is a journey worth taking.\" Erik Kain of Forbes in his review praised the development of John Dorie and wrote: \"this was a very enjoyable episode of Fear. I liked the mystery aspects. Dillahunt did a great job throughout and John Dorie continues to be one of my favorite characters in any of The Walking Dead shows. Lots of good action both between the living and the dead and between just the living.\" Writing for Decider, Alex Zalben also acclaimed Dillahunt's performance, writing: \"When you get into a John Dorie focused episode, you know what you’re going to get. With a voice like molasses and a generally positive outlook on the zombie apocalypse, episodes like 'Humbug's Gulch' have been a blast to watch.\"\nRatings\nThe episode was seen by 1.28 million viewers in the United States on its original air date, below the previous episodes.\nReferences\nExternal links\n* [https://www.amc.com/shows/fear-the-walking-dead/episodes/season-6-the-key--50710 \"The Key\"] at AMC.com\n*"
    }
  ]
}