{
  "content": [
    {
      "type": "text",
      "text": "# The Mongol Invasion (trilogy)\n\nThe Mongol Invasion is a trilogy of historical novels by Soviet writer Vasily Yan that explores the Mongol conquests, including the Mongol conquest of Central Asia and their Western campaign, as well as the resistance of the peoples living in Central Asia and Eastern Europe during the early 13th century. This trilogy is considered the author's most renowned work and comprises the novels \"Genghis Khan\" (1939), \"Batu\" (1942), and \"To the \"Last Sea\" (1955).\nVasily Yan developed an interest in Genghis Khan's conquests while serving in the Transcaspian region in the early 20th century. He had been inspired to write about the subject after having a dream in which Genghis Khan tried to defeat him. In 1934, Maxim Gorky recommended Yan to the publishing house Young Guard, which then commissioned him to write a story about Genghis Khan. Yan had already been fascinated by the theme for some time, and the commission gave him the opportunity to write about it. Although the project was undertaken in 1934, it was not until 1939 that the story was finally published, due to various delays.\nBy February 1940, the manuscript for \"Batu\", the eagerly awaited sequel, had reached the austere halls of Goslitizdat. Two months later, Yan presented \"Invasion of Batu\", a children's adaptation, to Detgiz. In 1941, the storm clouds of the Great Patriotic War gathered, and Yan's chronicles of conquest and resistance became relevant. On July 21, 1941, Vasily Yan was formally inducted into the Union of Soviet Writers. Alexander Fadeev championed Yan, and he was awarded the prestigious Stalin Prize of the first degree that same year.\nDuring the Great Patriotic War, Yan continued working on his project while he was evacuated to the Uzbek Soviet Socialist Republic. After his return to Moscow, Literaturnaya Gazeta announced the impending arrival of his third book, \"The Golden Horde and Alexander the Restless\", on April 22, 1945. Excerpts had been published in leading publications, stoking anticipation for the work. However, the path to publication was not smooth. Although Yan had delivered the manuscript to Goslitizdat by the close of 1948, it encountered resistance from scholars, namely Artemiy Artsikhovsky and Alexei Yugov, prompting significant revisions. The novel was eventually split in two and published posthumously in 1955.\nThe books comprising the trilogy have garnered numerous positive reviews from scholars specializing in the History of Russia, medievalists, and Orientalists, as well as critics and literary critics. As a result, they have gained significant popularity and are consistently reprinted.\nBooks\nGenghis Khan\nEarly in spring, amidst a belated snowstorm sweeping across the lifeless sandhills of the great Kara-Kum Desert, Haji Rakhim al-Bagdadi, a pauper dervish, is on his way to Gurganj, rumored to be the finest and richest city in all of Khwarazm. In a quiet valley, he discovers a plundered trade caravan and finds the near-death trader Mahmoud-Yalvach in an abandoned yurt, having miraculously survived a brutal attack led by Kara-Konchar ('Black Sword'). After dressing Mahmud's wounds, Haji secretly takes his golden falcon-shaped paiza and helps him seek refugee with the nearest nomad’s yurt. Prince Jelal ed-Din Manguberdi, the son of the powerful ruler Muhammad II of Khwarazm, arrives at the yurt, having lost his way while chasing a jeyran. He invites everyone to share in his prey. Kara-Konchar a tall, slender jigit, then appears and shares the tragic story of his family's downfall due to Shah Muhammad's revenge against the Turkmen, triggered by their theft from a Kipchak khan. This resulted in his father's death, his brothers fleeing, and his beloved Gyul-Jamal's abduction. The compassionate prince offers Kara-Konchar his protection and an opportunity to demonstrate his bravery, granting him a document written in elegant ligature as a guarantee to ensure safe passage to Gurjan.\nUpon reaching Gurganj, Haji Rakhim learns with grief that his father and younger brother Tugan have died in the shah's dungeon; his house is empty and abandoned. Memories of his painful past flood his mind, recalling his spiritual struggles that led him to flee to Baghdad. Meanwhile, Shah Muhammad searches for his lost son Jalal, ordering the execution of ten prisoners while sparing a boy named Tugan, who is ultimately rejected and driven away by his master. Hadji Rahim offers Tugan a chance to join his travels, commissioning a knife forged from Tugan's iron shackles bearing the inscription “Forever unto death.” Mahmud-Yalvach, now recovered, outfits Tugan in travel clothes from his shop, providing him a leather money-pouch containing five gold dinars. In a gesture of friendship, Haji Rakhim returns the golden falcon-shaped paiza to Mahmud-Yalvach.\nShah Muhammad, influenced by his mother Turkan-Khatun, names his youngest son as heir and assigns Jelal ed-Din to govern the distant region of Ghazni on the Indian border, yet Jalal stays in Gurganj. Muhammad grows suspicious of Gyul-Jamal, a dark-skinned Turkmen maiden, whom he believes is conspiring against him. After being taken as his 301st wife, Gyul-Jamal is imprisoned in the Tower of Eternal Oblivion. An old soothsayer fails to extract her secrets, resulting in her entrapment with a leopard until Kara-Konchar saves her by killing the beast. Meanwhile, disturbing news comes from Samarkand of uprisings and slaughter of Kipchaks, prompting an enraged Muhammad to prepare to march there.\nThe indomitable Timur-Melik, the captain of the shah's guard, dines with Jelal ed-Din and Kara-Konchar while a captured Merkit hunter shares harrowing tales of Genghis Khan's cruelty. Influenced by his mother's ambitions, Muhammad rejects the Mongols' peace offers and initially achieves military successes. However, Genghis Khan's son, Jochi, counters these advances, ultimately leading to the decline of the Khwarazmian Empire.\nShah Muhammad pauses in a deceptively tranquil Samarkand, encountering traders led by Mahmud-Yalvach, who secretly spies for Genghis Khan. Mahmud praises the great Mongol Kagan, unsettling Muhammad. Desperate to secure his loyalty, the shah offers Mahmud a pearl torn from his bracelet; however, Mahmud remains loyal to Genghis Khan.\nMahmud returns to Genghis Khan's headquarters, revealing everything and presenting the pearl. Genghis Khan's 450 warriors, disguised as merchants, are discovered in Otrar, leading Muhammad to execute them. A new ambassador from Genghis Khan meets a similar fate, with his subordinates tortured and exiled. These actions provoke the Mongol campaign against Khwarazm.\nAs panic sets in, Muhammad collects taxes three years in advance, despite difficulties with current taxes. Kurban-Kyzyk, a poor peasant, becomes commander-in-chief by chance. While on a journey to Bukhara, his mare is stolen, and the next day, the Mongol forces invade, leading to the surrender of Bukhara's imams. Kurban escapes amid the chaos. Genghis Khan holds a feast with the captured residents of Bukhara, wanting Haji Rakhim as an advisor. Meanwhile, Muhammad, his son, and what remains of their horsemen, including Kurban, flee west toward Persia, leaving behind cities such as Samarkand and Merv in ruins—each one falling like dominoes.\nThe Shah finds asylum for himself on the desert island of Ashuradeh in the vast and unforgiving Abeskun Sea, home to lepers, who reveal their afflictions and plight, highlighting their lost humanity and suffering. Fifteen days later, Timur-Melik arrives, finding the lifeless body of the Khwarazm Shah, utterly naked, with a crow pecking at his eyes—a grim symbol of death's relentlessness. Following the burial, Timur-Melik leaves the island and sets out with his jigits in search of Jelal ed-Din in order to tell him of his father's death. They say he then wandered about as a simple dervish for many years, roaming the lands of Arabia, Persia and India.\nMeanwhile, Kurban, having killed a Mongol and stolen his horse, returns home, where he meets his neighbor Sakou-Kuli, who shares his family's troubles. With Kurban's wife back, they plan to plough their land amid the chaos of war. Genghis Khan wastes no time in distributing the Khorezm Shah's daughters among his sons and retainers, while he keeps the vicious Queen Turkan-Khatun for show at his feasts. She is made to sit near the entrance to the tent and sing plaintive songs while Genghis Khan tosses her gnawed bones, a deeply tragic turn.\nNow Sultan Jelal ed-Din is the last hope for saving his state, as his army grows, but his allies betray him after promises of gold, weakening his position. Discord erupts in his camp over the division of loot, leading to conflicts among the leaders. After his army falters, he leaps from a high cliff into the dark waters of the surging Sindh River. Swimming and climbing the bank, Jelal brandishes his sword in a final, defiant challenge to Genghis Khan himself before vanishing into the brush. For years after the battle at the Sindh, Jelal ed-Din wanders through different countries, continuing to fight the Mongols successfully and gathering troops of valiant jigits, but he never assembles an army large enough to defeat the Mongols.\nHaji Rakhim, who serves Mahmud-Yalvach, is tasked with delivering a message to Jochi, the Khagan's son. During their desert crossing, Rakhim and Tugan are captured by brigands led by Kara-Konchar. They are released after a dervish recounts tales of Guyl-Jamal and Kara-Burgut, detailing Kara-Konchar's exploits, including their encounter with Jelal ed-Din in the nomad's yurt and his rescue of Gyul-Jamal from the leopard. Learning that Guyl-Jamal is still alive and imprisoned, Kara-Konchar seeks to incite a rebellion in Gurganj to liberate her from Turkan-Khatun's “tower of eternal oblivion.” Meanwhile, the Mongol forces attack Gurganj, taking captives and demolishing the dam at Chagatai Khan's order, leading to severe flooding. Survivors face devastating losses, discovering bodies such as Kara-Konchar and Gyul-Jamal among the wreckage. Following the death of Jochi Khan, Haji Rakhim becomes a tutor to his son, the future Batu.\nGenghis Khan sends Subutai boğatur and Jebe noyon to locate the former Khwarazmian ruler. This vanguard conquers Simnan, Qom, and Zanjan in Northern Iran, sparing only Hamadan, yet fails to find Muhammad. Polovtsian Khan Köten seeks Russian help, leading Russian princes to gather near Kyiv. Subutai clarifies that the Mongols target the Polovtsians and Kipchaks, not the Russians. The Mongols retreat from the Dnieper, deceiving Russian princes into pursuit, then defeat the Kipchaks and Mstislav Udatny's forces. They slaughter the surrendered Kyiv regiment and execute captured princes under planks during victory celebrations.\nGenghis Khan engages in battles in India, where Jelal ed-Din seeks refuge. The Mongol rulers, determined to conquer the region, aim to eliminate the exiled Khwarazm Shah's son. The Khan's wife encourages advisor Yelü Chucai to convince him to return home due to declining health. Yelü proposes consulting the Taoist Qiu Chuji, who, upon meeting the khan, reveals immortality to be a myth. Shortly after, Genghis Khan dies and names Ögedei as his heir. Batu, the Khan's grandson, takes control of the former Khwarazm as the future Khagan.\nIn the epilogue, Tugan, who survives and becomes a Mongol warrior, sets off to rescue Haji Rakhim, imprisoned by the imams. Rakhim faces execution while tasked with chronicling Genghis Khan's campaigns. Tugan uses \"medicinal balls\" to render Rakhim motionless like a corpse. The jailers, unaware of the ruse, dispose of what they believe to be Rakhim's body into the pit for executed prisoners. Eventually, Tugan and his warriors discover Rakhim in the pit and take him to a deserted place location. There, Rakhim regains his senses, granting him an opportunity to start his life afresh.\nBatu\nThe tale unfolds from the perspective of Haji Rakhim, who recounts his miraculous escape. Afterward, he serves as a scribe. One night, he shelters a fugitive dressed in fine clothing—a man identifying himself as the messenger of the Grand Vizier, Mahmud-Yalvach. Rakhim doesn't recognize him as his former student, Batu Khan. Besides the old faqih (religious scholar), the only other witness to the fugitive's presence is the orphan, Yülduz, who lives with the respected Nazar-Karyazik, the stable master of the Kipchak Khan, Bayander.\nBatu, sought by assassins, hides while planning to conquer the universe to its furthest edge—the \"last sea\". He receives a message from Khan Jelal ed-Din, delivered by Arapsha an-Nasir, a young jigit. Nazar-Karyazik begs Khan Bayander for horses so his sons can participate in the great campaign. Just before leaving, he sells Yülduz for the Khan's harem, and his youngest son, Musuk, who loves her, renounces his father.\nNazar-Karyazik enters the retinue of Subutai-bagatur, Batu Khan's mentor, serving as a guard and spy to Haji Rakhim. The fugitive Musuk, robbed, is taken into an Arab woman's squad. Yülduz also remains in the narrative: before leaving Sighnaq, Batu's mother selects seven of his forty wives to accompany him on campaign. The Khan designates one of the \"seven stars\" to be Yülduz. The others are four noble Mongols and two daughters of Khan Bayander, who nicknames Yülduz \"a hard-working, black wife\".\nSix months after leaving Sighnaq, in late autumn, the Mongol army arrives at the Volga. Musuk is wounded during a meeting with Gleb Vladimirovich, the deposed Grand Duke of the Principality of Ryazan, and Babila, a fisherman, helps build a ford across the river. Batu Khan camps at Urakova Mountain near Yeruslan in the autumn of 1237.\nGleb Vladimirovich joins Batu's service as a nöker, guiding him through Russian lands during a stormy night. Batu, entertained by Gazuk's tale of Attila, hears his younger wife declare him the Mongols' guiding star. Ryazan holds a veche where Yuri of Ryazan receives Mongolian envoys. One, a Bulgar merchant and suspected spy, demands a tithe for all goods. On Evpaty Kolovrat's advice, Yuri seeks aid from Grand Prince Yuri II of Vladimir. Anticipating disaster, Yuri also requests assistance from other principalities. The content of the Tatar ambassadors' conversation with Georgy remains a mystery.\nBatu Khan winters by the Voronezh River, rejecting Russian gifts as inferior to Chinese crafts. He accepts only a dozen horses, keeping one black steed and distributing the rest. Prince Fyodor refuses to bow to Batu, treating him as an equal. As punishment, the Ryazan delegation receives meager food portions. They retort with a Polovtsian proverb: \"Go to the feast, having eaten your fill at home.\" Fyodor and his companions are subsequently killed on Batu Khan's orders.\nFacing winter's onset, the Mongol leader considers campaigns toward Ryazan or Kyiv. Heeding his advisors Subutai and Haji Rakhim, he chooses to resupply in captured Russian cities. In Ryazan, Princess Eupraxia of Kyiv, grieving for her deceased husband, commits suicide. During the Mongol advance, Musuk and Uriankh-Kadan (Subutai's son) are captured by Prince Yuri of Ryazan. After the defeat of the Russians in the Wild Field, the near-frozen Uriankh-Kadan is revived by Baba Opalenikha, a Russian captive. When faced with the powerful commander's offer of recompense, she reveals surprising humanity: \"Even to ailing beasts we extend our hand,\" she rasps, her voice as raspy as the winter wind. \"Though he be not of our creed, a human soul still dwells within him.\"\nRyazan valiantly resists the Mongol invasion, but lacking support from other Russian lands, it is destroyed. Khan Batu swiftly advances towards Kolomna, where an attempt to capture a son of Genghis Khan results in the prince's death and the city's destruction. Moscow (Mushkaf) and Vladimir suffer similar fates. Russian princes unite, forming an army under Evpaty Kolovrat, to oppose the Mongols; however, a traitor betrays their position, leading to a devastating Mongol attack.\nFollowing the defeat at Kozelsk, Batu Khan moves south towards the Kipchak steppes. He commissions the Chinese architect Li Tong-po to construct a marching palace on Urakov Mountain, establishing a new center of power. Yülduz requests Nazar-Karizek's company, a request considered unforgivable given his past actions. The traitor Gleb is cast out by Arapsha after fulfilling his treacherous task.\nBatu's finale is powerfully timed to the harsh year of 1942. The ending's strength lies in the stark contrast between its two chapters. The first, \"And Russia is Being Built Again!\", depicts the relentless sounds of axes felling trees in the blazing \"Perunov Bor\" forest—a legendary place in Slavic folklore associated with Perun, the god of thunder and lightning. This vividly portrays the reconstruction and resilience amidst devastation. The second chapter, \"In a Distant Homeland,\" focuses on the somber aftermath, eschewing triumphant celebration. Instead of celebratory fanfare, plaintive songs prevail. We see Old Nazar-Karizek returning to his native yurt not with spoils of war, but with four saddled but empty horses—a poignant symbol of the sons lost fighting against Russia. This contrast highlights war's complex reality: the drive for rebuilding and progress, overshadowed by personal loss and grief. In the context of 1942, a year of immense hardship and struggle, Batu's finale resonates deeply, underscoring that victory often comes at a tremendous cost.\nTo the \"Last Sea\"\nIn the novel's first part, Duda the Righteous, a skilled seal carver and advisor to the Caliph of Baghdad, discovers that Abd-ar-Rahman, a descendant of Abd al-Rahman I, has arrived in the city. Recognizing his potential, they send him north to Batu Khan to address the Tatar threat to Iraq. Duda serves as secretary and chronicler. Ambassadors travel by ship from the Iron Gate to Xacitarxan, with Islam Agha, the ship's owner, transporting the captivating Byzantine princess Daphne, destined for the Mongol khan after being captured by pirates. Meanwhile, Abd-ar-Rahman remains safe, abiding by Genghis Khan's Yassa. The ambassador consults the wise fortune teller Bibi-Günduz, who reveals that the young Arab seeks fame more than wealth, before proceeding to Batu Khan's headquarters with a caravan of Arab merchants.\nThe action then shifts to the golden palace, built on the Volga steppe by the architect Li Tong-po, imported from China. He is served by Musuk, who has attained the rank of taiji. Little time has elapsed since Batu's pogrom in Zalessky Rus. Batu, still young and energetic, has gained confidence and subdued his relatives. Confident in his divinely ordained rule, the khan seeks to fulfill the covenant of a divine ruler, aiming to reach the \"last sea,\" bringing the light of Genghis Khan's yasa to all conquered lands. After viewing the new palace, Batu falls ill. His beloved wife Yülduz-Khatun cares for him, while his brother Ordu seeks a physician—a role filled by Princess Daphne, brought by the centurion Arapsha along with Duda. Having recovered and witnessed a scandal involving his wives and Yülduz, Batu Khan bestows three of his wives upon his generals. Ordu Khan promises Daphne a herd of mares, freedom, and ninety-nine gifts, and she settles in his yurt. At a meeting with the wladika, Ambassador Abd-ar-Rahman pledges his sword and service.\nDuring this discussion, Li Tong-po and the chronicler Haji Rakhim inform Batu Khan that the greatness of Alexander the Great (Iskander the Two-Horned) stemmed not only from conquest but also from mercy towards conquered peoples, whom the king \"made his children.\" Batu Khan announces the founding of a new state—the Blue Horde.\nThe fourth part unfolds from Haji Rakhim's perspective, continuing his \"Travel Book.\" Batu Khan becomes concerned by the fierce independence of Novgorod the Great and orders the selection of the most intelligent prisoners to extract information. This task falls to Arapsha, who finds the beaver hunter Savva and the mighty Nikita the Tanner. They inform the Khan about Yaroslav II of Vladimir and his son Alexander Nevsky. Subotai-bagatur declares he will grant Alexander the rank of a tysiatskii (\"thousandman\"), and Batu appoints Arapsha as ambassador to Novgorod. Simultaneously, rafters arrive from Prince Alexander bearing gifts for the Tatar Khan and ransoms for prisoners.\nAmbassador Gavrila Aleksich arranges a bear hunt (an ancient Russian royal pastime) for Yülduz-Khatun, for which he is rewarded by Zerbiet-Khanum, a Polovtsian dancer and spy. Skillfully avoiding humiliation (receiving old mares under luxurious saddles), Gavrila successfully redeems the captured Russians, sending them across the steppe in small groups. Though he declines leading the march on Kiev, Haji Rakhim quotes Batu telling Mahmud Yalvach, \"Trust this man.\" Batu Khan releases Gavrila to Novgorod with Emir Arapsha. Gavrila's only concern is facing his wife Lyubava after his encounter with Zerbiet-Khanum, but he discovers that she was nearly abducted by the charming noyon Nogai Khan just before his return. At the last moment, Gavrila prevents her from taking her tonsure, despite threats from the hegumen.\nDuring preparations for the western campaign, Batu Khan faces opposition from the Genghisids, and even Yülduz urges him to spare Kiev, making it a second capital. Afterward, Ordu complains that his Greek concubine has been seduced and abducted by the restless Nogai Khan, revealed to be the wayward son of the Tatar Khan, serving as a guard in the army. When Nogai attempts to enter Yülduz-Khatun's chambers, Batu and Subutai set a trap, assigning him to the \"brutal\" vanguard of the Mongolian army. This vanguard includes diverse individuals, even the Kurdish knacker Utboy, possessing a horse blanket made from the skin of an unfaithful concubine. Utboy passes the blanket off as the remains of Jalal al-Din. Yesun exposes him, forcing a confession that he did not defeat the son of the Khwarazm Shah.\nMengü-khan is the first dispatched to Kiev. The action then shifts to Khan Kotyan's camp, where Friar Julian, a Hungarian monk, delivers an arrogant message from Batu to Béla IV of Hungary. Part of the narrative is presented from Abd-ar-Rahman's perspective, reporting to Baghdad.\nThe reader gets acquainted with Vadim, who dreams of becoming an icon painter and finds himself in the retinue of Alexander Nevsky's wife. He paints the princess, her blue eyes captivating him, instead of the Virgin Mary. Father Makariy accuses him of demonic temptation, and Vadim flees to the Kyiv-Pechersk Monastery, seeking a mentor and solace. He achieves initial success in his art but is soon forced to take up arms, fighting in the battle against the Mongol invaders. Kiev stands between the Mongols and the Sunset Sea.\nThe King of France prepares for martyrdom, while the German emperor plans to flee to Palestine. After the Eastern European pogrom, however, Batu Khan's advance halts; his army, bloodied and weary from relentless battles, is spent. Batu awaits sorrowful news from home: his noble wives have dispatched the “black one,” but his beloved Yülduz is gone, mourned by her servants, the intellectuals Haji Rakhim and Lee Tong-po. From the brutal crucible of war, a new state arises, its fate intertwined with its neighbors for centuries to come. Haji Rakhim concludes his account:\n“...I can only wish my future readers that they never have to experience the most terrible thing that can happen in our lives — the all-destroying hurricane of a cruel and senseless war.”\nLanguage\nWhether Vasily Yan's sweeping historical narratives qualify as novellas or novels remains a keenly debated point, especially regarding his monumental \"Invasion of the Mongols\" trilogy. Yan himself resolutely maintained they were novellas, a claim fiercely contested by critics and scholars, who championed works like \"Genghis Khan,\" \"Batu,\" and \"To the Last Sea\" as full-fledged novels. Central to Yan's artistry is his vivid dramatization of pivotal historical moments and the complex, often unflattering, portrayal of key figures, as Lydia Alexandrova observes regarding his historical antagonists. This enduring disagreement underscores the inherent slipperiness of genre classification while simultaneously cementing Yan's profound contribution to the landscape of the Soviet historical novel.\nAuthor and critic alike perceive the trilogy as a unified tapestry, woven with consistent literary threads and a shared approach to depicting history. The deep well of research that fueled these narratives, particularly Yan's sojourn amongst the Tuvans in the 1920s, profoundly shaped his work. The character of Baba Opalenikha in \"Batu,\" for instance, is drawn directly from the wellspring of a real-life Uyuk resident.\n\"Genghis Khan\" delves into the turbulent crucible of the father-son dynamic between Genghis Khan and his eldest, Jochi. Yan paints Jochi as a warped mirror image of his father, inheriting the Khan's imposing presence and piercing gaze. The novel chillingly recounts Jochi's brutal demise, a fate decreed by Genghis Khan and carried out by mercenaries in accordance with Mongol custom – a stark testament to the Khan's unbridled ruthlessness. Vasily Yan unflinchingly presented Genghis Khan as a figure of tyranny, unafraid to offer repulsive and unaesthetic descriptions of his appearance and actions. The author's pen bleeds with the vivid portrayal of the Khan's cruelty, highlighting his brutality through unflinching detail, such as his monstrous reaction to a boy's heart being fed to a dog.\nThe trilogy's final volume fragmented during publication, never appearing in its original form. Integral chapters were cut and transformed into standalone novellas like The Return of the Dream and ''The Jester's Amusement, creating disjointed fragments. The novel split into To the Last Sea and The Youth of a Commander'', which drew critical ire. Vladimir Pashuto excoriated Yan's treatment of historical sources, lamenting his descent into \"historical narration full of errors and inaccuracies.\" Lev Razgon cataloged a litany of woes stemming from this forced partition: in To the \"Last Sea\", the seams of the fractured narrative gaped open, episodes rendered jarringly \"fragmentary.\" The heavy hand of ideological decree further marred the text. In the postwar era, the suffocating \"theory of non-conflict,\" with its insistence on the flawless hero, cast a pall over Yan's work. He stood accused of the heretical act of elevating Batu Khan above a deliberately diminished Alexander Nevsky. Even Haji-Rakhim, Yan's own alter ego from the 1930s, sang the praises of \"the two horned Alexander' (al-Iskandar Dhu 'l-qurnayn), Alexander the Great, proclaiming his glory \"true, eternal.\" The \"serving intelligentsia\" shifted from bold confrontation with Genghis Khan's advisors to obsequiousness, evident in Li Tong-po's flattering assurances to Batu Khan. Criticism arose over \"artistic flaws,\" highlighting a mix of excessive historical detail with a lack of \"pedantic accuracy,\" such as rafters on the Volga singing anachronistic songs. Lev Razgon pointed out the absence of romance in Yan's work while noting the striking presence of female characters in \"To the Last Sea,\" each disrupting a previously harmonious narrative.\nValentin Oskotsky considered the most striking part of the novel to be the vivid depiction of Batu Khan's campaign \"towards the sunset\", across which stood Kyiv, inheriting the tragic legacy of Ryazan and other cities burned by \"Batu\", and through its envoys declaring a \"categorical refusal to voluntarily submit to the Mongols\". Vasily Yan sought to contrast Batu Khan's straightforward onslaught with the caution of Alexander Nevsky, who, having defeated the Swedes and Livonian knights, did everything possible to avoid direct confrontation with the Horde. Thus, if Genghis Khan and Batu Khan in Yan's artistic world embodied destruction, then Alexander Nevsky personifies creation, equally manifested in both military affairs and state governance. Although this was not fully achieved, even by separating these characters into different books, the writer demonstrated their polar opposition.\nReception\nThe reception of Vasily Yan's historical trilogy, particularly \"Genghis Khan,\" is a captivating study in the dance between artistic merit, political climate, and the ever-shifting sands of critical opinion. Initially, the trilogy faced formidable obstacles to publication, its pages deemed treacherous territory for their implicit critique of tyranny – a perilous venture in the stifling atmosphere of 1930s Soviet Union. Even with the influential Maxim Gorky championing its cause, \"Genghis Khan\" languished for five long years before seeing the light of day.\nThe first wave of reviews (1939-1940) presented a fractured landscape. While some lauded Yan's vibrant prose and meticulous historical detail, dissenting voices emerged. Georgy Schtorm, for instance, pointed to an overabundance of orientalist clichés, while Sergei Khmelnitsky decried what he saw as historical oversimplification. Zoya Kedrina, though admiring Yan's literary craftsmanship, found the narrative arc wanting in cohesion.\nThe onset of World War II dramatically dramatically altered the critical terrain. Re-released during the war years, the novel resonated with newfound power, garnering effusive praise. Critics such as Leonid Volynsky and Valery Kirpotin celebrated Yan's ability to breathe life into history and his unwavering commitment to historical truth, a stance perfectly aligned with the official Soviet narrative of patriotism and national pride. A. Fadeev's 1942 endorsement underscored the trilogy's vital role in igniting national fervor. This wartime crucible allowed Yan's subtle critique of tyranny to be recast as a rallying cry against external aggression. Lev Razgon further lauded Yan for upholding the compassionate traditions of Russian literature, fostering resilience and bolstering the spirit of dignity in his readers. Later, Igor Kondakov noted a striking resurgence of interest in Yan's work during the tumultuous decades of the 1980s and 1990s, suggesting its enduring relevance amidst societal upheaval and the twilight of empire.\nFurther analysis delved into the intricacies of Yan's stylistic choices. Sergei Petrov observed the author's fluctuating cadence, his prose oscillating between descriptive grandeur and analytical precision. Lydia Alexandrova, however, offered a favorable comparison between Yan's meticulous use of documentation and that of Alexander Pushkin in The Captain's Daughter. The strategic deployment of historical quotes as epigraphs, coupled with the portrayal of Haji Rakhim as a reliable narrator, served to enhance the text's sense of authenticity and credibility.\nYears later, in 2016, Russian writer Dmitry Bykov offered a provocative observation, suggesting that Vasily Yan's Stalin Prize was no accident, his novels about the Mongol horde serving as a chilling blueprint for Stalin's own empire. Bykov, however, was less enamored with Yan's ornate prose, dismissing it as anachronistic and devoid of innovative thought. Yet, despite this, Yan's books have remained a potent force, captivating readers in both the Soviet era and contemporary Russia. Literary scholar Wolfgang Kasack, in his own analysis, noted that Yan's novels, with their focus on resistance against a superior foe and the struggle for liberation, possessed undeniable resonance on the eve of war, thus explaining the author's receipt of the Stalin Prize.\nThe trilogy was included into the 2013 list 100 Books for Schoolchildren recommended by the Ministry of Education and Science (Russia).\nReferences\nBibliography\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\nExternal links\n*\n* [https://web.archive.org/web/20101113102742/http://www.ucalgary.ca/applied_history/tutor/islam/mongols/goldenHorde.html The Islamic World to 1600: The Golden Horde]\n*"
    }
  ]
}