{
  "content": [
    {
      "type": "text",
      "text": "# The Stage Debut Awards\n\nThe Stage Debut Awards are theatre awards recognising individuals making their professional debuts in the performing arts in the UK. The annual ceremony was launched in 2017 by The Stage and include accolades for Best Performer in a Play, Best Writer, Best Designer and the Best West End Debut Performer. Recipients of these awards have gone on to star in West End shows, television series and films.\nThe awards ceremony is held annually at 8 Northumberland Avenue, London.\nIn 2020, the Best Actor in a Play and Best Actress in a Play awards were updated to Best Performer in a Play and the Best Actor in a Musical and Best Actress in a Musical awards were updated to Best Performer in a Musical.\nJudging process\nEligible nominees must be aged 16 or over, and making their professional debut in a named role in a production reviewed by The Stage. For acting roles this should be a first named role. The Stage's nationwide network of theatre critics put forward nominees from productions they have reviewed. Performers, writers, directors, designers and composers making their stage debut (and their agents) are also able to nominate themselves online for consideration. The public can also nominate individuals for each category.\nIndustry professionals from across the UK are then invited to give their input into the longlist. These advisors have included producer Danielle Tarento, casting director David Grindrod, David Jubb, Battersea Arts Centre, designer Es Devlin, Hannah Miller, Royal Shakespeare Company; James Grieve, Paines Plough; Jenny Sealey, Graeae; Jimmy Fay, Lyric Theatre; Laura Donnelly, National Theatre of Scotland; Madani Younis, Bush Theatre; director Michael Grandage; actor Noma Dumezweni, designer Paule Constable; Pravesh Kumar, Rifco; actor Preeya Kalidas; Sam Hodges, Nuffield Southampton Theatres; producer Sonia Friedman; Tom Morris, Bristol Old Vic; and Wendy Spon, National Theatre.\nThe judging panel decide on the shortlist and winners in all categories, except the Best West End Debut where the shortlist is voted on by the public. The Best West End Debut award recognises those who are making their professional debut in London's West End. This includes individuals who have previously made their debut outside of the West End.\nCeremony\nIn 2017, the inaugural The Stage Debut Awards Ceremony took place at 8 Northumberland Avenue, London, on September 17.\nThe ceremony was hosted by West End leading man Ben Forster. Category Presenters included director Michael Grandage, actor Sharon D. Clarke, actor Rachel Tucker, Theatre owner Nica Burns, National Theatre director Rufus Norris and actor Kenneth Cranham. Exclusive performances at the ceremony were from Dreamgirls and the National Theatre's Follies.\nIn 2018, the ceremony took place on September 23 at 8 Northumberland Avenue, London. The ceremony was hosted by Cush Jumbo and the Category Presenters included director Michael Grandage, actor Ruthie Henshall, singer Preeya Kalidas, actor Jodie Prenger, and lighting designer Paule Constable. Exclusive performances at the ceremony were from Anaïs Mitchell and Miriam-Teak Lee.\nIn 2019, the ceremony took place at The Brewery, London, on September 15. The ceremony was hosted by Cush Jumbo, and the exclusive performances were by Rachel Tucker and Amara Okereke. Category Presenters included actor Giles Terera, actor Michael Xavier, singer Brenda Edwards, actor Janie Dee, actor Mark Gatiss, and playwright Inua Ellams.\nThe first digital ceremony was hosted as a free online event in 2020 by Miriam-Teak Lee (winner of Best Actress in a Musical in 2017) on 27 September and featured an exclusive performance from SpitLip (winner of the 2019 Best Composer/Lyricist awards).\nIn 2021, no ceremony took place due to the Coronavirus pandemic.\nIn 2022, the ceremony took place at 8 Northumberland Avenue, London on Sunday, September 18. The ceremony was hosted by Susan Wokoma, and exclusive performances were by Shan Ako, Samuel Thomas, Frances Mayli McCann and Natalie Paris. Category Presenters included actor Amanda Abbington, director Jamie Lloyd, singer-songwriter and performer Louise Rednapp, singer Jay McGuiness, actor Matt Henry and theatre designer Anna Fleischle.\nIn 2023, the ceremony took place at 8 Northumberland Avenue, London on Sunday, October 1. The ceremony was hosted by Divina de Campo, and the exclusive performances were by Emily Benjamin, Zizi Strallen and Rachael Wooding. Category Presenters included actor Callum Scott Howells, singer Faye Tozer, director Rebecca Frecknall, lighting designer Prem Mehta, writer Morgan Lloyd Malcom, actor John Partridge, actor Bertie Carvel and actor Omari Douglas.\nIn 2024, the ceremony took place on Sunday, September 29 at 8 Northumberland Avenue.\nPrevious winners\n{| class=\"wikitable\"\n|+\n!The Stage Debut Awards 2017\n!Winner\n!Nominees\n|-\n| rowspan=\"3\" |Best Actor in a Play\n| rowspan=\"3\" |Abraham Popoola in Othello at Tobacco Factory Theatre, Bristol\n|Jack Archer in ''Nivelli's War at The Lyric Theatre, Belfast\n|-\n|TJ Jones in The Seven Acts of Mercy at Swan Theatre, Royal Shakespeare Company, Stratford-upon-Avon\n|-\n|Kenneth Omole in Assata Taught Me at the Gate Theatre, London\n|-\n| rowspan=\"3\" |Best Actress in a Play\n| rowspan=\"3\" |Grace Molony in The Country Girls at Minerva Theatre, Chichester\n|Anya Chalotra in Much Ado About Nothing'' at Shakespeare's Globe, London\n|-\n|Kellan Frankland in The House of Bernarda Alba at Royal Exchange, Manchester\n|-\n|Jess Peet in Alice in Wonderland at The Royal Lyceum Theatre, Edinburgh\n|-\n| rowspan=\"3\" |Best Actor in a Musical\n| rowspan=\"3\" |Samuel Thomas in Allegro at Southwark Playhouse, London\n|Adam J Bernard in Dreamgirls at Savoy Theatre, London\n|-\n|Ben Hunter in The Girls at Phoenix Theatre, London\n|-\n|Daniel Urch in 110 in the Shade at Ye Olde Rose and Crown, London\n|-\n| rowspan=\"3\" |Best Actress in a Musical\n| rowspan=\"3\" |Miriam-Teak Lee in On the Town at Regent's Park Open Air Theatre, London\n|Chloe Carrington in Hair at Hope Mill Theatre, Manchester\n|-\n|Emily Hughes in Fiddler on the Roof at Everyman Theatre, Liverpool\n|-\n|Siena Kelly in On the Town at Regent's Park Open Air Theatre, London\n|-\n| rowspan=\"3\" |Best Director\n| rowspan=\"3\" |Lekan Lawal for Betrayal at Derby Theatre, Derby\n|Sean Aydon for Richard III at Rosemary Branch Theatre, London\n|-\n|Alexander Lass for 46 Beacon at Trafalgar Studios 2, London\n|-\n|Lynette Linton for Assata Taught Me at the Gate Theatre, London\n|-\n| rowspan=\"3\" |Best Designer\n| rowspan=\"3\" |Rosie Elnile for The Convert at Gate Theatre, London\n|Joshua Gadsby for Still Ill at New Diorama Theatre, London\n|-\n|Simon Spencer for The Tempest at Royal Shakespeare Company, Stratford-upon-Avon\n|-\n|Jessica Staton for Extra Yarn at Orange Tree Theatre, London\n|-\n| rowspan=\"3\" |Best Composer or Lyricist\n| rowspan=\"3\" |Dan Gillespie Sells for ''Everybody's Talking About Jamie at Crucible Theatre, Sheffield\n|Jonah Brody and MJ Harding for Removal Men at The Yard, London\n|-\n|Ruth Chan for Snow in Midsummer at Swan Theatre, Royal Shakespeare Company, Stratford-upon-Avon\n|-\n|Stephen Jackson for Roller Diner at Soho Theatre, London\n|-\n| rowspan=\"3\" |Best Writer\n| rowspan=\"3\" |Katherine Soper for Wish List at Royal Exchange, Manchester and Royal Court Theatre, London\n|Titas Halder for Run the Beast Down at Marlowe Theatre, Canterbury and Finborough Theatre, London\n|-\n|Asif Khan for Combustion at Tara Arts, London\n|-\n|Victoria Willing for Spring Offensive at Clapham Omnibus, London\n|-\n| rowspan=\"7\" |The Joe Allen Best West End Debut\n| rowspan=\"7\" |Andrew Polec for Bat Out of Hell at London Coliseum\n|John Boyega in Woyzeck at Old Vic\n|-\n|Anthony Boyle in Harry Potter and the Cursed Child at The Palace Theatre\n|-\n|Andy Karl in Groundhog Day at Old Vic\n|-\n|Audra McDonald in Lady Day at Emerson's Bar and Grill'' at Wyndham's Theatre\n|-\n|Imogen Poots in ''Who's Afraid of Virginia Woolf? at Harold Pinter Theatre\n|-\n|Amber Riley in Dreamgirls at Savoy Theatre\n|-\n|Charlie Stemp in Half a Sixpence at Noël Coward Theatre\n|}\n{| class=\"wikitable\"\n|+\n!The Stage Debut Awards 2018\n!Winner\n!Nominees\n|-\n| rowspan=\"3\" |Best Actor in a Play\n| rowspan=\"3\" | Akshay Sharan in The Reluctant Fundamentalist, Yard Theatre, London\n|Seb Carrington in Summer and Smoke, Almeida Theatre, London\n|-\n|Chris Walley in The Lieutenant of Inishmore, Noël Coward Theatre, London\n|-\n|Alex Wilson in The Elephant Man, Bristol Old Vic, Bristol\n|-\n| rowspan=\"3\" |Best Actress in a Play\n| rowspan=\"3\" | Gemma Dobson in Rita, Sue and Bob Too, Octagon Theatre, Bolton\n|Kitty Archer in One for Sorrow, Royal Court, London\n|-\n|Lorna Fitzgerald in The Shadow Factory'', NST City, Southampton\n|-\n|Grainne O'Mahony in The Elephant Man, Bristol Old Vic, Bristol\n|-\n| rowspan=\"3\" |Best Actor in a Musical\n| rowspan=\"3\" | Louis Gaunt in Oklahoma!, Grange Park Opera, West Horsley\n|Will Carey in ''It's Only Life, Union Theatre, London\n|-\n|Toby Miles in Les Misérables'', Queen's Theatre, London\n|-\n|Simon Oskarsson in Return to the Forbidden Planet, Upstairs at the Gatehouse, London\n|-\n| rowspan=\"3\" |Best Actress in a Musical\n| rowspan=\"3\" | Amara Okereke in Les Misérables, Queen's Theatre, London\n|Teleri Hughes in Spring Awakening at the Hope Mill Theatre, Manchester\n|-\n|Eleanor Kane in Fun Home at the Young Vic, London\n|-\n|Rebecca Mendoza in Hairspray, on tour\n|-\n| rowspan=\"3\" |Best Director\n| rowspan=\"3\" | Katy Rudd for The Almighty Sometimes, Royal Exchange, Manchester\n|Iwan Lewis for One Minute, the Barn Theatre, Cirencester\n|-\n|Alexandra Moxon for Wreck at Nottingham Playhouse\n|-\n|Oscar Pearce for Great Apes at the Arcola Theatre, London\n|-\n| rowspan=\"3\" |Best Designer\n| rowspan=\"3\" | Khadija Raza for Hijabi Monologues, Spun, and Mixtape, Bush Theatre, London, the Arcola Theatre, London and the Royal Exchange, Manchester\n|Basia Binkowska for Devil with the Blue Dress at the Bunker Theatre, London\n|-\n|Fin Redshaw for Pieces of String and Love Me Now, Mercury Theatre, Colchester and the Tristan Bates Theatre, London\n|-\n|Jasmine Swan for Hyem, The Passing of Third Floor Back, Hanna and The Sleeper, Theatre503, London, the Finborough Theatre, London, the Arcola Theatre, London, and Rialto Theatre, Brighton\n|-\n| rowspan=\"2\" |Best Composer or Lyricist\n| rowspan=\"2\" | Gus Gowland for Pieces of String, Mercury Theatre, Colchester\n|Kate Marlais for Abandon, Lyric Hammersmith, London\n|-\n|Matt Winkworth for The Assassination of Katie Hopkins, Theatr Clwyd, Mold\n|-\n| rowspan=\"4\" |Best Writer\n| rowspan=\"4\" | Andrew Thompson for In Event of Moone Disaster, Theatre503, London\n|Georgia Christou for Yous Two, Hampstead Theatre, London\n|-\n|Kendall Feaver for The Almighty Sometimes, Royal Exchange, Manchester\n|-\n|Natasha Gordon for Nine Night, National Theatre, London\n|-\n|Joe White for Mayfly, Orange Tree Theatre, London\n|-\n| rowspan=\"7\" |The Joe Allen Best West End Debut\n| rowspan=\"7\" |Aidan Turner in The Lieutenant of Inishmore, Noël Coward Theatre\n|Mohammad Amiri for The Jungle at the Playhouse Theatre\n|-\n|Ashley Banjo for Dick Whittington at the London Palladium\n|-\n|Bryan Cranston for Network at the National Theatre\n|-\n|Michelle Greenidge for Nine Night at the National Theatre\n|-\n|John McCrea for Everybody’s Talking About Jamie at the Apollo Theatre\n|-\n|Kelli O'Hara for The King and I at the London Palladium\n|}\n{| class=\"wikitable\"\n|+\n!The Stage Debut Awards 2019\n!Winner\n!Nominees\n|-\n| rowspan=\"3\" |Best Actor in a Play\n| rowspan=\"3\" |Jamal Ajala in Ear for Eye, Royal Court\n|Stuart Campbell in The Hunt, Almeida Theatre\n|-\n|Patrick Gibson in Sweat, Donmar Warehouse and the Gielgud Theatre, London\n|-\n|Ivan Oyik in Blue/Orange, Birmingham Repertory Theatre\n|-\n| rowspan=\"3\" |Best Actress in a Play\n| rowspan=\"3\" |Lauren O'Leary in The Awkward Years, The Other Room, Cardiff\n|Liv Hill in Top Girls, National Theatre\n|-\n|Urielle Klein-Mekongo in Yvette, Bush Theatre\n|-\n|Bea Webster in Mother Courage, Albion Electric Warehouse, Leeds\n|-\n| rowspan=\"2\" |Best Actor in a Musical\n| rowspan=\"2\" |Adam Hugill for ''Standing at the Sky's Edge, Crucible Theatre, Sheffield\n|Ryan Hutton in Only Fools and Horses The Musical, Theatre Royal Haymarket\n|-\n|Jac Yarrow in Joseph and the Amazing Technicolor Dreamcoat, London Palladium\n|-\n| rowspan=\"3\" |Best Actress in a Musical\n| rowspan=\"3\" |Danielle Fiamanya in The Color Purple, Curve, Leicester and Birmingham Hippodrome\n|Georgina Ambrey in My Mother Said I Never Should and The Rise and Fall of Little Voice, Theatre by the Lake, Keswick\n|-\n|Maiya Quansah-Breed in Six, Arts Theatre\n|-\n|Jarneia Richard-Noel in Six, Arts Theatre\n|-\n| rowspan=\"3\" |Best Director\n| rowspan=\"3\" |Atri Banerjee for Hobson's Choice, Royal Exchange, Manchester\n|Tyrone Huntley for Ain't Misbehaving, Mercury Theatre, Colchester\n|-\n|Jade Lewis for Superhoe, Royal Court\n|-\n|Tom Scutt for Berberian Sound Studio, Donmar Warehouse\n|-\n| rowspan=\"2\" |Best Designer\n| rowspan=\"2\" |Evie Gurney for Antony and Cleopatra and The Hunt, National Theatre and Almeida Theatre\n|Abby Clarke for Beauty and the Beast, Theatre by the Lake, Keswick\n|-\n|Maxwell Nicholson Lailey for Huddle (Unicorn Theatre)\n|-\n| rowspan=\"3\" |Best Composer or Lyricist\n| rowspan=\"3\" |David Cumming, Felix Hagan, Natasha Hodgson and Zoë Roberts for Operation Mincemeat, New Diorama Theatre\n|Oran Eldor and Marcus Stevens for Mythic the Musical, Charing Cross Theatre\n|-\n|Anaïs Mitchell for Hadestown, National Theatre\n|-\n|Femi Temowo for Death of a Salesman, Young Vic\n|-\n| rowspan=\"3\" |Best Writer\n| rowspan=\"3\" |Jasmine Lee-Jones for Seven Methods of Killing Kylie Jenner, Royal Court\n|Ross Willis for Wolfie, Theatre503\n|-\n|Nicôle Lecky for Superhoe, Royal Court\n|-\n|Holly Robinson for Soft Animals, Soho Theatre\n|-\n| rowspan=\"7\" |The Joe Allen Best West End Debut\n| rowspan=\"7\" |Jac Yarrow for Joseph and the Amazing Technicolor Dreamcoat, London Palladium\n|Matthew Broderick in The Starry Messenger'', Wyndham's Theatre\n|-\n|Andrew Burnap in The Inheritance, Noël Coward Theatre\n|-\n|Nathanael Campbell in Come From Away, Phoenix Theatre\n|-\n|Saffron Coomber in Emilia, Vaudeville Theatre\n|-\n|Sarah Gordy in Jellyfish, National Theatre\n|-\n|Samuel H Levine in The Inheritance, Noël Coward Theatre\n|}\n{| class=\"wikitable\"\n|+\n!The Stage Debut Awards 2020\n!Winner\n!Nominees\n|-\n| rowspan=\"5\" |Best Performer in a Play\n| rowspan=\"5\" |Daniel Monks for Teenage Dick at the Donmar Warehouse, London & Rachel Nwokoro for Little Baby Jesus at the Orange Tree Theatre, London\n|Saida Ahmed for Little Miss Burden at the Bunker, London\n|-\n|Brooklyn Melvin for Oliver Twist at Leeds Playhouse (in a co-production with Ramps on the Moon)\n|-\n|Jessica Rhodes for The Sugar Syndrome at the Orange Tree Theatre, London\n|-\n|Khai Shaw for Little Baby Jesus at the Orange Tree Theatre, London\n|-\n|Bobby Stallwood for Faith, Hope and Charity at the National Theatre, London\n|-\n| rowspan=\"6\" |Best Performer in a Musical\n| rowspan=\"6\" | Shan Ako for Les Misérables at the Sondheim Theatre, London & Sam Tutty for Dear Evan Hansen at the Noël Coward Theatre, London\n|Lucy Anderson for Dear Evan Hansen at the Noël Coward Theatre, London\n|-\n|Chase Brown for Mame at the Hope Mill Theatre, Manchester\n|-\n|Oli Higginson for The Last Five Years at the Southwark Playhouse, London\n|-\n|Adriana Ivelisse for West Side Story at Curve, Leicester\n|-\n|Tom Noyes for Preludes at the Southwark Playhouse, London\n|-\n|Bethany Tennick for Islander at the Southwark Playhouse, London\n|-\n| rowspan=\"2\" |Best Director\n| rowspan=\"2\" |Martha Kiss Perrone for When It Breaks It Burns at the Battersea Arts Centre, London\n|Georgia Green for The Mikvah Project at the Orange Tree Theatre, London\n|-\n|Alex Sutton for Preludes at the Southwark Playhouse, London\n|-\n| rowspan=\"2\" |Best Designer\n| rowspan=\"2\" |Rose Revitt (set and costume) for ''Dr Korczak's Example at Leeds Playhouse\n|Liam Bunster (set and costume) for The Taming of the Shrew'' at Shakespeare's Globe, London\n|-\n|Andrew Exeter (lighting) for High Fidelity at the Turbine Theatre, London\n|-\n| rowspan=\"2\" |Best Composer or Lyricist\n| rowspan=\"2\" |Jim Barne and Kit Buchan for The Season at the New Wolsey Theatre, Ipswich and Royal and Derngate, Northampton\n|Jherek Bischoff for The Ocean at the End of the Lane at the National Theatre, London\n|-\n|Robbie Williams for The Boy in the Dress at the Royal Shakespeare Company, Stratford-upon-Avon\n|-\n| rowspan=\"3\" |Best Writer\n| rowspan=\"3\" |Temi Wilkey for The High Table at the Bush Theatre, London (in a co-production with Birmingham Rep)\n|Samuel Bailey for Shook at the Southwark Playhouse, London\n|-\n|Mari Izzard for Hela at The Other Room, Cardiff\n|-\n|Eleanor Tindall for Before I Was a Bear at The Bunker, London\n|-\n| rowspan=\"6\" |Best West End Debut Performer\n| rowspan=\"6\" |Sam Tutty for Dear Evan Hansen at the Noël Coward Theatre\n|Shan Ako for Les Misérables at the Sondheim Theatre\n|-\n|David Mitchell for The Upstart Crow at the Gielgud Theatre\n|-\n|Daniel Monks for Teenage Dick at the Donmar Warehouse\n|-\n|Samantha Pauly for Evita at Regent's Park Open Air Theatre\n|-\n|Wendell Pierce for Death of a Salesman at the Piccadilly Theatre\n|-\n|Aimee Lou Wood for Uncle Vanya at the Harold Pinter Theatre\n|-\n| rowspan=\"5\" |Best Creative West End Debut\n| rowspan=\"5\" | Femi Temowo (composer) for Death of a Salesman at the Piccadilly Theatre and for Three Sisters at the National Theatre\n|Fabian Aloise (choreographer) for Evita at Regent's Park Open Air Theatre\n|-\n|Nadia Latif (director) for Fairview at the Young Vic Theatre\n|-\n|Benj Pasek, Justin Paul and Steven Levenson (composer, lyricist & book) for Dear Evan Hansen at the Noël Coward Theatre\n|-\n|David West Read (book) for & Juliet at the Shaftesbury Theatre\n|}\n{| class=\"wikitable\"\n|+\n!The Stage Debut Awards 2022\n!Winner\n!Nominees\n|-\n| rowspan=\"7\" |Best Performer in a Play\n| rowspan=\"7\" | Elisabeth Gunawan for Unforgettable Girl at Volia! Europe Theatre Festival, London & Ensemble of For Black Boys Who Have Considered Suicide When the Hue Gets Too Heavy at the New Diorama and Royal Court, London\n(Mark Akintimehin, Emmanuel Akwafo, Nnabiko Ejimofor, Darragh Hand, Aruna Jalloh, Kaine Lawrence)\n|Samuel Creasey for Book of Dust at Bridge Theatre, London\n|-\n|Kudzai Mangombe for Malindadzimu at Hampstead Theatre, London\n|-\n|Saba Shiraz for An Adventure the Octagon Theatre, Bolton\n|-\n|Tommy Sim’aan for Starcrossed at Wilton's Music Hall, London\n|-\n|Joe Usher for Rock / Paper / Scissors at Sheffield Theatres\n|-\n|Michael Workeye for House of Ife at the Bush Theatre, London\n|-\n|Dewi Wykes for Petula at National Theatre Wales\n|-\n| rowspan=\"4\" |Best Performer in a Musical\n| rowspan=\"4\" | Elijah Ferreira for Hedwig and the Angry Inch at Leeds Playhouse\n|Hugh Coles for Back to the Future at the Adelphi Theatre, London\n|-\n|Ben Joyce for Jersey Boys at Trafalgar Theatre, London\n|-\n|Bella Maclean for Spring Awakening at the Almeida, London\n|-\n|Joe Pitts for Spring Awakening at the Almeida, London\n|-\n| rowspan=\"2\" |Best Director\n| rowspan=\"2\" |Monique Touko for Malindadzimu at Hampstead Theatre, London\n|Anthony Almeida for Cat on a Hot Tin Roof at Curve, Leicester\n|-\n|Alice Fitzgerald for Purple Snowflakes and Titty Wanks at the Royal Court, London\n|-\n| rowspan=\"2\" |Best Designer\n| rowspan=\"2\" |Rose Revitt (set and costume) for Dr Korczak’s Example at Leeds Playhouse\n|Liam Bunster (set and costume) for The Taming of the Shrew at Shakespeare's Globe, London\n|-\n|Andrew Exeter (lighting) for High Fidelity at the Turbine Theatre, London\n|-\n| rowspan=\"2\" |Best Composer or Lyricist\n| rowspan=\"2\" |TK Hay (set and costume) for An Adventure at the Octagon Theatre, Bolton\n|Caitlin Mawhinney (set and costume) for My Voice Was Heard But It Was Ignored/Teechers Leavers at Leeds Playhouse/Hull Truck\n|-\n|Liz Whitbread (set and costume) for Favour at the Bush Theatre, London\n|-\n| rowspan=\"2\" |Best Composer, Lyricist or Book Writer\n| rowspan=\"2\" |John Patrick Elliott for Cruise at the Duchess Theatre, London\n|Jordan Paul Clarke & Francesca Forristal for Public Domain at Vaudeville Theatre, London\n|-\n|Lauryn Redding for Bloody Elle at the Royal Exchange, Manchester\n|-\n| rowspan=\"2\" |Best Writer\n| rowspan=\"2\" |Tyrell Williams for Red Pitch at the Bush Theatre, London\n|Kemi-Bo Jacobs for All White Everything But Me at the Alphabetti Theatre, Newcastle\n|-\n|Eilidh Loan for Moorcroft at the Tron Theatre, Glasgow\n|-\n| rowspan=\"7\" |Best West End Debut Performer\n| rowspan=\"7\" |Jodie Comer for Prima Facie the Harold Pinter Theatre\n|Lizzie Annis for The Glass Menagerie at Duke of York's Theatre\n|-\n|Emilia Clarke for The Seagull the Harold Pinter Theatre\n|-\n|Hugh Coles for Back to the Future at Adelphi Theatre\n|-\n|Emma Corrin for Anna X the Harold Pinter Theatre\n|-\n|Sutton Foster for Anything Goes at the Barbican\n|-\n|Hannah Jarrett-Scott for Pride and Prejudice* (*sort of) at the Criterion\n|-\n|Ben Joyce for Jersey Boys at Trafalgar Studios\n|-\n| rowspan=\"5\" |Best Creative West End Debut\n| rowspan=\"5\" | Julia Cheng (choreographer) for Cabaret at the Playhouse Theatre, London\n|Tacita Dean (designer) for The Dante Project at the Royal Opera House\n|-\n|Jack Holden (writer) for Cruise at the Duchess Theatre\n|-\n|Yasmin Joseph (writer) for ''J'Ouvert at the Harold Pinter Theatre\n|-\n|Isobel McArthur (writer) for Pride and Prejudice* (*sort of) at the Criterion\n|-\n|Rebekah Murrell (director) for J'Ouvert at the Harold Pinter Theatre\n|}\n{| class=\"wikitable\"\n|+\n!The Stage Debut Awards 2023\n!Winner\n!Nominees\n|-\n| rowspan=\"6\" |Best Performer in a Play\n| rowspan=\"6\" | Elan Davies for Imrie at Sherman Theatre, Cardiff & Isobel Thom for I, Joan'' at Shakespeare's Globe, London\n|Bukky Bakray for Sleepova at Bush Theatre, London\n|-\n|Rita Bernard-Shaw for Trouble in Butetown at Donmar Warehouse, London\n|-\n|Natalie Blair for Spring and Port Wine at Octagon Theatre, Bolton\n|-\n|Rhian Blundell for Let the Right One In at Royal Exchange Theatre, Manchester\n|-\n|Rilwan Abiola Owokoniran for The Importance of Being Earnest at Leeds Playhouse and touring\n|-\n|Daniel Rock for Richard The Second at Omnibus Theatre, London and touring\n|-\n| rowspan=\"6\" |Best Performer in a Musical\n| rowspan=\"6\" | Jessica Lee for Miss Saigon at Crucible Theatre, Sheffield\n|Liv Andrusier for Ride at Charing Cross Theatre, London\n|-\n|Josh Barnett for Newsies at Troubadour Wembley Park Theatre, London\n|-\n|Arcangelo Ciulla for Newsies at Troubadour Wembley Park Theatre, London\n|-\n|Carla Dixon-Hernandez for Mrs Doubtfire at Shaftesbury Theatre, London\n|-\n|Drew Hylton for Unexpected Twist: An Oliver Twisted Tale at Royal and Derngate, Northampton and touring\n|-\n|Maisie Smith for Strictly Ballroom, Churchill Theatre, Bromley and touring\n|-\n| rowspan=\"3\" |Best Director\n| rowspan=\"3\" |Emily Ling Williams for A Playlist for the Revolution at Bush Theatre, London\n|Daniel Blake for Bones at Park Theatre, London\n|-\n|Indiana Lown-Collins for The Solid Life of Sugar Water at Orange Tree Theatre, London\n|-\n|Denzel Westley-Sanderson for The Importance of Being Earnest at Leeds Playhouse and touring\n|-\n| rowspan=\"2\" |Best Designer\n| rowspan=\"2\" |Andrea Scott (video) for My Neighbour Totoro at Barbican Theatre, London\n|Carly Brownbridge (set & costume) for Agatha at Theatre503, London\n|-\n|Peter Butler (set & costume) for The Shape of Things at Park Theatre, London\n|-\n| rowspan=\"3\" |Best Composer, Lyricist or Book Writer\n| rowspan=\"3\" |Michael R Jackson for A Strange Loop at Barbican Theatre, London\n|Gerel Falconer for Alice in Wonderland at Brixton House, London\n|-\n|Jenny Moore for Robin Hood: The Legend. Re-written at Regent's Park Open Air Theatre, London\n|-\n|Lilly Pollard for Sugar Coat at Southwark Playhouse, London\n|-\n| rowspan=\"5\" |Best Writer\n| rowspan=\"5\" |Anoushka Lucas for Elephant at Bush Theatre, London\n|Sasha Hails for Possession at Arcola Theatre, London\n|-\n|Lenny Henry for August in England at Bush Theatre, London\n|-\n|Jennifer Lunn for Es & Flo at Wales Millennium Centre, Cardiff\n|-\n|Richard Mylan for Sorter at Swansea Grand Theatre\n|-\n|Zak Zarafshan for The Boys Are Kissing at Theatre503, London\n|-\n| rowspan=\"7\" |Best West End Debut Performer\n| rowspan=\"7\" |Rose Ayling-Ellis for As You Like It at @sohoplace\n|Emily Fairn for Brokeback Mountain at @sohoplace\n|-\n|Mike Faist for Brokeback Mountain at @sohoplace\n|-\n|Kyle Ramar Freeman for A Strange Loop at Barbican Theatre\n|-\n|Gabriel Howell for The Unfriend at Criterion Theatre\n|-\n|Paul Mescal for A Streetcar Named Desire at Phoenix Theatre\n|-\n|Zachary Quinto for Best of Enemies at Noël Coward Theatre\n|-\n|Samira Wiley for Blues for an Alabama Sky at The National Theatre\n|-\n| rowspan=\"4\" |Best Creative West End Debut\n| rowspan=\"4\" | Tingying Dong (Sound Designer) for The Crucible at National Theatre and Gielgud Theatre and Rob Madge (Writer) for ''My Son's a Queer, (But What Can You Do?) at Garrick Theatre and Ambassadors Theatre\n|Joe Bunker (Musical Director) for Operation Mincemeat at Fortune Theatre\n|-\n|David Cumming, Felix Hagan, Natasha Hodgson and Zoë Roberts (SpitLip) (Composer, Lyricist & Book Writer) for Operation Mincemeat at Fortune Theatre\n|-\n|Michael R Jackson (Composer, Lyricist & Book Writer) for A Strange Loop at Barbican Theatre\n|-\n|Scott Le Crass (Director) for Rose at Ambassadors Theatre\n|}\n{| class=\"wikitable\"\n!The Stage Debut Awards 2024\n!Winner\n!Nominees\n|-\n| rowspan=\"7\" |Best Performer in a Play\n| rowspan=\"7\" | Ellie-May Sheridan for London Tide at National Theatre, London\n|Deborah Ayorinde for Wedding Band: A Love/Hate Story in Black and White at Lyric Hammersmith, London\n|-\n|Imogen Elliott for The Voice of the Turtle at Jermyn Street Theatre, London\n|-\n|Kasper Hilton-Hille for That Face at Orange Tree Theatre, London\n|-\n|Gareth John for Housemates at Sherman Theatre, Cardiff\n|-\n|Louis McCartney for Stranger Things: The First Shadow at Phoenix Theatre, London\n|-\n|Nadia Parkes for The House Party at Chichester Festival Theatre, Chichester\n|-\n|Taylor Russell for The Effect at National Theatre, London\n|-\n| rowspan=\"5\" |Best Performer in a Musical\n| rowspan=\"5\" | Jeevan Braich for Starlight Express at Troubadour Wembley Park Theatre, London\n|Scarlett Ayers for The Verge of Forever at The Other Palace, London\n|-\n|Laura Dawkes for Frozen at Theatre Royal Drury Lane, London\n|-\n|Myles Frost for MJ the Musical at Prince Edward Theatre, London\n|-\n|Joshua Ginsberg for Cable Street at Southwark Playhouse Borough, London\n|-\n|Grace Hodgett Young for Sunset Boulevard at Savoy Theatre, London\n|-\n| rowspan=\"2\" |Best Director\n| rowspan=\"2\" |Sophie Drake for The Bleeding Tree at Southwark Playhouse Borough, London\n|Emily Foran for Little Women at Lyric Theatre, Belfast\n|-\n|Ellie Coote for 42 Balloons by The Lowry, Salford\n|-\n| rowspan=\"3\" |Best Designer\n| rowspan=\"3\" |Nathan Amzi and Joe Ransom for Sunset Boulevard at Savoy Theatre, London\n|Ellie Koslowsky for Vegetables in London\n|-\n|Nadya Sayapina, Anastasiya Ryabova, Lidiia Dresch-Pyshna and Dmytro Guk for King Stakh’s Wild Hunt at Barbican Theatre, London\n|-\n|Skylar Turnbull Hurd for These Demons at Theatre503, London\n|-\n| rowspan=\"4\" |Best Writer\n| rowspan=\"4\" |Azuka Oforka for The Women of Llanrumney at Sherman Theatre, Cardiff\nSam Grabiner for Boys on the Verge of Tears by Soho Theatre, London\n|Martha Loader for Bindweed at Mercury Theatre, Colchester\n|-\n|Harry McDonald for Foam at Finborough Theatre, London\n|-\n|Hannah Morley for We Could All Be Perfect at Sheffield Theatres, Sheffield\n|-\n|Anastasia Osei-Kuffour for Love Steps at Omnibus Theatre, London\n|-\n| rowspan=\"3\" |Best Composer, Lyricist or Book Writer\n| rowspan=\"3\" |Jack Godfrey for 42 Balloons at The Lowry, Salford\n|Ahmed Abdullahi Gallab for The Enormous Crocodile at Leeds Playhouse, Leeds\n|-\n|Nick Butcher and Tom Ling for The Little Big Things at @sohoplace, London\n|-\n|Elvis Costello for Cold War at Almeida Theatre, London\n|-\n| rowspan=\"7\" |Best West End Debut Performer\n| rowspan=\"7\" |Jack Wolfe for Next to Normal at Wyndham’s Theatre, London\n|Francesca Amewudah-Rivers for Romeo and Juliet at Duke of York’s Theatre, London\n|-\n|Will Close for Dear England at National Theatre, London\n|-\n|Billy Crudup for Harry Clarke at Ambassadors Theatre, London\n|-\n|Grace Hodgett Young for Sunset Boulevard at Savoy Theatre, London\n|-\n|Toheeb Jimoh for Player Kings at Noël Coward Theatre\n|-\n|Ed Larkin for The Little Big Things at @sohoplace, London\n|-\n|Louis McCartney for Stranger Things: The First Shadow at Phoenix Theatre, London\n|-\n| rowspan=\"4\" |Best Creative West End Debut\n| rowspan=\"4\" | Daniel Bailey for Red Pitch at @sohoplace\n|Jim Barne and Kit Buchan for Two Strangers (Carry a Cake Across New York) at Criterion Theatre\n|-\n|Marcelo Dos Santos for Backstairs Billy at Duke of York’s Theatre\n|-\n|Kip Williams for The Picture of Dorian Gray at Theatre Royal Haymarket\n|-\n|Brian Yorkey and Tom Kitt for Next to Normal at Wyndham’s Theatre\n|}\n{| class=\"wikitable\"\n!The Stage Debut Awards 2025\n!Winner\n!Nominees\n|-\n| rowspan=\"6\" |Best Performer in a Play\n| rowspan=\"6\" | Hilson Agbangbe in Wonder Boy at Bristol Old Vic\nLucy Karczewski for Stereophonic at Duke of York’s Theatre, London\n|Paula Clarke for The Tragedy of Richard III at Lyric Theatre, Belfast\n|-\n|Joseph Edwards for The Red Shoes at Swan Theatre, Royal Shakespeare Company, Stratford-Upon-Avon\n|-\n|Eva Morgan for The Glass Menagerie at Yard Theatre, London\n|-\n|Christopher Neenan for Blood Wedding at Omnibus Theatre, London\n|-\n|Daisy Sequerra for Ballet Shoes at National Theatre, London\n|-\n|Jasper Talbot for Redlands at Chichester Festival Theatre\n|-\n| rowspan=\"3\" |Best Performer in a Musical\n| rowspan=\"3\" |Leesa Tulley for Why Am I So Single? at Garrick Theatre, London\n|Megan Ellis for Muriel’s Wedding the Musical at Curve, Leicester\n|-\n|Dora Gee for The Mad Ones at The Other Palace, London\n|-\n|Eve Shanu-Wilson for The Phantom of the Opera at His Majesty’s Theatre, London\n|-\n| rowspan=\"4\" |Best Director\n| rowspan=\"4\" |Richard Mylan for Mumfighter at Swansea Grand Theatre\n|Aditya Chopra for Come Fall in Love at Opera House, Manchester\n|-\n|Nathan Crossan-Smith for The Walrus Has a Right to Adventure at Liverpool Everyman\n|-\n|Adam Karim for Guards at the Taj at Orange Tree Theatre, London\n|-\n|Emily Susanne Lloyd for The Mad Ones at The Other Palace, London\n|-\n| rowspan=\"3\" |Best Designer\n| rowspan=\"3\" |Hannah Schmidt for The Passenger / Personal Values at Finborough Theatre / Hampstead Theatre, London\n|Juliette Demoulin for various at Finborough Theatre, London\n|-\n|Adam Jefferys for Communion at Bush Theatre, London\n|-\n|Chloe Wyn for The Walrus Has a Right to Adventure at Liverpool Everyman\n|-\n| rowspan=\"5\" |Best Writer\n| rowspan=\"5\" |Ava Pickett for 1536 at Almeida Theatre, London\nMilly Sweeney for Water Colour at Pitlochry Festival Theatre and Byre Theatre, St Andrews\n|Sarah Bond for Seagulls and Sad, Sad Stories at Laurels, Whitley Bay\n|-\n|Nathan Englander for What We Talk About When We Talk About Anne Frank at Marylebone Theatre, London\n|-\n|Danny James King for Miss Myrtle’s Garden at Bush Theatre, London\n|-\n|Saana Sze for Belly of the Beast at Finborough Theatre, London\n|-\n|Nancy Netherwood for Radiant Boy: A Haunting at Southwark Playhouse, London\n|-\n| rowspan=\"2\" |Best Composer, Lyricist or Book Writer\n| rowspan=\"2\" |Yve Blake for Fangirls at Lyric Hammersmith, London\n|Bryn Christopher, James Cooper, Martin Batchelar for Lovestuck at Theatre Royal Stratford East, London\n|-\n|Nicola and Rosie Dempsey for One Man Musical by Flo & Joan at Pleasance Dome, Edinburgh\n|-\n| rowspan=\"7\" |Best West End Debut Performer\n| rowspan=\"7\" |Rachel Zegler for Evita at London Palladium\n|Heather Agyepong for Shifters at Duke of York’s Theatre\n|-\n|Samuel Brewer for Oedipus at Wyndham’s Theatre\n|-\n|Georgie Buckland for The Devil Wears Prada at Dominion Theatre\n|-\n|Tosin Cole for Shifters at Duke of York’s Theatre\n|-\n|Emma Flynn for Clueless the Musical at Trafalgar Theatre\n|-\n|Diego Andres Rodriguez for Evita at London Palladium\n|-\n|Kat Ronney for Titanique at Criterion Theatre\n|-\n| rowspan=\"6\" |Best Creative West End Debut\n| rowspan=\"6\" | Mark Rosenblatt for Giant at Harold Pinter Theatre\n|Eline Arbo for The Years at Harold Pinter Theatre\n|-\n|Tye Blue, Marla Mindelle, Constantine Rousouli for Titanique at Criterion Theatre\n|-\n|Darren Clark, Jethro Compton for The Curious Case of Benjamin Button at Ambassadors Theatre\n|-\n|Justin Craig for Stereophonic at Duke of York’s Theatre\n|-\n|Benedict Lombe for Shifters at Duke of York’s Theatre\n|-\n|Amit Sharma for Retrograde'' at Apollo Theatre\n|}\nReferences"
    }
  ]
}