{
  "content": [
    {
      "type": "text",
      "text": "# The Arizona Republic\n\n| founded          =  (as The Arizona Republican)\n| headquarters     = 200 East Van Buren StreetPhoenix, Arizona 85004United States\n| circulation      =\n| circulation_ref  =\n| website          =\n| ISSN             = 0892-8711\n| eISSN            = 2766-452X\n| circulation_date = 2023\n}}\nThe Arizona Republic is an American daily newspaper published in Phoenix. Circulated throughout Arizona, it is the state's largest newspaper. Since 2000, it has been owned by the Gannett newspaper chain.\nHistory\nEarly years\nThe newspaper was founded May 19, 1890, under the name The Arizona Republican, by Lewis Wolfley, Clark Churchill, John A. Black, Robert H. Paul, Royal A. Johnson, and Dr. L. C. Toney. Six years later, they would sell the paper to “an experienced newspaperman” from Washington, DC, Charles C. Randolph.“The Republican’s Story” Arizona republican (Phoenix, Ariz.), vol. 18, no. 364, 17 May 1908, p. 10. Chronicling America: Historic American Newspapers. Lib. of Congress.  Accessed 15 May 2025.\nOn April 28, 1909, the newspaper notified its readers that local businessmen S. W. Higley and Sims Ely purchased the newspaper from George W. Vickers, and would run the paper as president and general manager, respectively.“Republican’s New Owners.” Arizona republican (Phoenix, Ariz.), vol. 20, no. 100, 28 Aug. 1909, p. 1. Chronicling America: Historic American Newspapers. Lib. of Congress.  Accessed 27 April 2025. They co-owned the newspaper until December 1911, Higley purchased Ely’s interest in the paper.“Change in Ownership.” Arizona republican (Phoenix, Ariz.), vol. 22, no. 209, 15 Dec. 1911, p. 2. Chronicling America: Historic American Newspapers. Lib. of Congress.  Accessed 27 April 2025. S. W. Higley would hold sole ownership of the Arizona Republican, serving as president and manager until its sale to Dwight B. Heard in October 1912.“To the People of Arizona.” Arizona republican (Phoenix, Ariz.), vol. 23, no. 134,  06 Oct. 1912, p. 1. Chronicling America: Historic American Newspapers. Lib. of Congress.  Accessed 27 April 2025.\nDwight Heard, a Phoenix land and cattle baron, ran the newspaper from 1912 until his death in 1929. The paper was then run by two of its top executives, Charles Stauffer and W. Wesley Knorpp, until it was bought by Midwestern newspaper magnate Eugene C. Pulliam in 1946. Stauffer and Knorpp had changed the newspaper's name to The Arizona Republic in 1930, and also had bought the rival Phoenix Evening Gazette and Phoenix Weekly Gazette, later known, respectively, as The Phoenix Gazette and the Arizona Business Gazette.\nPulliam era\nPulliam, who bought the two Gazettes as well as the Republic, ran all three newspapers until his death in 1975 at the age of 86. A strong period of growth came under Pulliam, who imprinted the newspaper with his conservative brand of politics and his drive for civic leadership. Pulliam was considered one of the influential business leaders who created the modern Phoenix area as it is known today.\nPulliam's holding company, Central Newspapers, Inc., as led by Pulliam's widow and son, assumed operation of the Republic/Gazette family of papers upon the elder Pulliam's death. The Phoenix Gazette was closed in 1997 and its staff merged with that of the Republic. The Arizona Business Gazette is still published to this day.\nIn 1998, a weekly section geared towards college students, \"The Rep\", went into circulation. Specialized content is also available in the local sections produced for many of the different cities and suburbs that make up the Phoenix metropolitan area.\nGannett purchase\nCentral Newspapers was purchased by Gannett in 2000, bringing it into common ownership with USA Today and the local Phoenix NBC television affiliate, KPNX. The Republic and KPNX combine their forces to produce their common local news subscription website, www.azcentral.com; The Republic and KPNX separated in 2015 when Gannett split into separate print and broadcast companies. Also in 2000, the Spanish-language publication La Voz was founded.\nOn September 25, 2015, Mi-Ai Parrish was named publisher and president of both the paper and its azcentral.com website, effective October 12.\nCirculation\nIn 2013, The Arizona Republic dropped from the sixteenth largest daily newspaper in the United States to the twenty-first largest, by circulation. In 2020 it had a circulation of about 116,000 for its daily edition, and 337,000 for its Sunday edition.\nDon Bolles murder\nIn 1976, an investigative reporter for the newspaper, Don Bolles, was the victim of a car bombing. He had been lured to a meeting in Phoenix in the course of work on a story about corruption in local politics and business and the bomb detonated as he started his car to leave. He died eleven days later. Retaliation against his pursuit of organized crime in Arizona is thought to be a motive in the murder.\nPolitical endorsements\nHistorically, The Republic has tilted conservative editorially.  It endorsed President George W. Bush in both the 2000 and 2004 presidential elections. On October 25, 2008, the paper endorsed Senator John McCain for president.\nIn local elections, it endorsed in recent years Democratic candidates such as former Arizona governor, former Secretary of Homeland Security, and former University of California president Janet Napolitano; and former Arizona Congressman Harry Mitchell.\nOn September 27, 2016, the paper endorsed Hillary Clinton for the 2016 presidential election, marking the first time in the paper's 126-year history that it had endorsed a Democratic candidate for president.  Previously, the paper had only withheld its endorsement from a Republican nominee/candidate twice in its history.\nDuring the unusual sequence of events that led up to the 1912 presidential election the paper had opted not to endorse the \"formal\" Republican party nominee for that election cycle.  This was shortly after Theodore Roosevelt had lost the Republican convention nomination to William Howard Taft in the controversial, and allegedly rigged, party convention of that year.  After Roosevelt's convention loss, and also after the hasty formation of the \"made to order\" Bull Moose Party, the paper continued to endorse Roosevelt via the newly formed party.  As a result of Roosevelt's insistence on an independent presidential bid that year, the Republican Party of 1912 was in disarray, yielding that year's presidential election to the Democrats, with the GOP only able to carry a total of eight electoral votes that year.  Two of the main planks of Roosevelt's progressive Bull Moose platform had been campaign finance reform and improved governmental accountability.\nIn the 1968 presidential election, the paper declined to endorse either Richard Nixon or Hubert Humphrey, asserting that \"all candidates are good candidates.\"  In the paper's 2016 editorial decision to take the further step of actually endorsing a Democratic candidate for the first time, the paper argued that despite Clinton's flaws, it could not support Republican nominee Donald Trump, denouncing him as \"not conservative\" and \"not qualified.\" The board also argued that Trump had \"deep character flaws.... (and) ... stunning lack of human decency, empathy and respect,\" suggesting that it was evidence he \"doesn't grasp our national ideals.\"  The paper also noted its concern regarding whether or not Trump would possess the necessary restraint needed for someone with access to nuclear weapons, stating, \"The president commands our nuclear arsenal. Trump can't command his own rhetoric.\"\nOn February 26, 2020, The Arizona Republic announced that it would no longer endorse candidates for public office.\nReferences\nFurther reading\n*\nExternal links\n*"
    }
  ]
}