{
  "content": [
    {
      "type": "text",
      "text": "# The Historical Atlas of United States Congressional Districts: 1789–1983\n\nThe Historical Atlas of the United States Congressional Districts: 1789-1983 is a 352-page bound volume of maps of all United States congressional districts from the effective date of the U.S. Constitution through the congressional redistricting after the 1980 United States census. It was authored by West Virginia University geography professor Kenneth C. Martis with cartography by Ruth A. Rowles.\nBackground\nRepresentation in the United States Congress is geographically based. The Founders explicitly designed the House of Representatives to be an institution that reflects local and regional concerns. These inescapable facts, and the actual history and actions of Congress itself, led many prominent historians, political scientists, and geographers to attempt to investigate congressional elections, roll call voting, and other characteristics and behavior in their spatial context. Two of the greatest hindrances to this type of research were the unavailability of historical congressional district boundary maps and historical congressional election maps. To fill this gap in American historical information, the National Endowment for the Humanities, in the late 1970s and early 1980s, supported research to produce The Historical Atlas of United States Congressional Districts: 1789-1983.\nContent\nIn 1983 The Historical Atlas of United States Congressional Districts: 1789-1983 was published by Macmillan/Free Press. The congressional district atlas contains several firsts in American history: it was first to map all the congressional districts of the United States House of Representatives; first to compile congressional district descriptions from original legal documents for all congressional districts for all states; and first to identify all the representatives elected to Congress with their proper state and district locations. The ‘'Atlas’’ was almost immediately designated a \"Selected Reference Book\" by the journal ‘'College and Research Libraries’’ and several years later won the prestigious American Historical Association [https://www.historians.org/awards-and-grants/past-recipients/waldo-g-leland-prize-recipients Waldo G. Leland Prize] for the best reference book in all fields of history for the period 1981-1986. In addition, the “Atlas” author and cartographer, Kenneth C. Martis and Ruth A. Rowles, were awarded the 1984 Organization of American Historians Charles Thomson Prize for archival research for their article \"Mapping Congress: Developing a Geographic Understanding of American Political History\" which analyzes the intellectual history and research surrounding the district atlas. The ‘'Atlas’’ research was also sponsored by fellowships from the Huntington Library, San Marino, California; Association of American Geographers, Washington, DC; and the Hermon Dunlap Smith Center for the History of Cartography, Newberry Library, Chicago, Illinois. The ‘'Atlas’’ today is still regarded as the standard reference source for historical congressional districts and has been used in legal cases as an “Authority” involving redistricting, including cases brought before the [https://www.supremecourt.gov/DocketPDF/22/22-101/236607/20220829161151788_Brief%20of%20COFOE%20as%20Amicus%20Curiae%20in%20Support%20of%20Petitioners.pdf United States Supreme Court]. The “Atlas” is currently out-of-print, but can be found in most major university and public libraries. The copyright is held by the author.\nThe Thirty-seventh Congress illustration is an example of the congressional district boundary maps found in [https://www.worldcat.org/title/historical-atlas-of-united-states-congressional-districts-1789-1983/oclc/8709448 The Historical Atlas of United States Congressional Districts: 1789-1983]. In the atlas there are ninety-seven national scale district maps, one for each of the first ninety-seven House of Representatives. The Thirty-seventh House (1861-1863) was primarily elected in 1860 and is the first House to convene during the Civil War. The striped areas designate districts in the eleven seceded states which did not send representatives to the United States Congress. However, the House did certify and seat ten “Unionist” members from three seceded states, five from Virginia, three from western Tennessee and two from southern Louisiana (elected after the New Orleans area was occupied). On the page opposite of each map is an alphabetical list of all who served in the House with their state and congressional district number or designation (note in the Thirty-seventh House illustration two members from Minnesota and three from California were not elected from districts but on a General Ticket, that is, statewide). Insert maps are used to illustrate very small districts in densely populated urban areas. Information is found at the bottom of each map giving the session dates, total number of representatives, Speaker, newly admitted states, and map notes indicating vacancies throughout the Congress and any significant state or national boundary changes.\nLater research\nIn 1989 a second book, The Historical Atlas of Political Parties in the United States Congress: 1789-1989, was published by Macmillan. Using the congressional district boundary maps from the first atlas as the base maps, this work was the first book in American history to map the political party winner for all congressional elections for every state and district from 1789. This mapping required the first systematic research project in American history to identify from a wide variety of sources the political affiliation or party membership at the time of each election of every individual who ever served in the United States Congress. In 2023, Humanities magazine published the article \"Red Map, Blue Map\" discussing the origin and compilation of the district and party atlases.\nThe congressional district maps were first placed into digital format by “Voteview” project in the mid-1990s. In 2013 a much more detailed mapping was produced by the Department of Political Science at the University of California, Los Angeles, under the title Digital Boundary Definitions of United States Congressional Districts, 1789-2012.\nReferences"
    }
  ]
}