{
  "content": [
    {
      "type": "text",
      "text": "# The Offerings of Peace and The Offerings of War__disambig_1\n\n'The Offerings of Peace and The Offerings of War' are a pair of bronze allegorical equestrian statues by Gilbert Bayes commissioned for the entrance of the Art Gallery of New South Wales. They have been on permanent display since their installation in 1926.\nAccession no.3254\n| image2 = Bayes \"Offerings of War\" (AGNSW).jpg\n| caption2 = Offerings of War  (right side of facade)Inscription: That our House may stand forever and that Justice and Mercy grow.Accession no.3255\n}}\nDescription\nPeace (on the left of the Gallery entrance) and War (on the right) each show a male rider astride a horse. The models for the works are the Elgin Marbles and the riders carry symbolic items as their \"offerings\". Peace carries the Greek theatre masks of Tragedy and Comedy representing \"the arts\" and \"plenty\", while War holds a staff, a bundle of swords and broken spear shafts. Artistically, they \"make no concession to the twentieth century\" and are \"...completely at one with the neo-classical Victorian facade [of the gallery], which is in itself allegorical.\"\nCommission\nat night, showing the two sculptures in silhouette flanking the entrance portico (2013)]]\nIn 1903 Bayes was commissioned to design a bronze relief panel for the façade of the New South Wales Art Gallery. \"Subjects typical of Assyrian or Egyptian art were required.\" His design depicting Assur-Natsir-Pal, King of Assyria, was produced in 1906 and in 1907 became the first panel to be installed on the façade.\nIn 1915, after the outbreak of World War I, Bayes submitted to the National Art Gallery of New South Wales \"a pair of 18 inch bronzed plaster figures entitled Offerings of Peace and Offerings of War and the following year he received the commission to produce large bronze versions to flank the museum's main entrance.\nWork on War and Peace was interrupted by the war itself, from which Bayes was exempted because of this commission. Full size plaster statues were finally completed in 1919, cast in England in 1923, shipped separately to Sydney in 1924 (first War in February, then Peace in June) and erected in 1926. The statues were, according to their inscription, cast at the Thames Ditton foundry by A.B. Burton, considered by contemporaries to be \"the finest bronze caster in the world\". These would be the first of several Sydney commissions for Burton.\nStanding 14 feet high and weighing six tons, the works were originally commissioned for £1500 each; the eventual cost rose to £2300 each.\nInstallation\nThe expectation at the time of commissioning the sculptures was that they would be situated at an angle on either side of the portico at the top of the entrance steps. Purpose-built plinths had been included in the construction of the facade for the statues' eventual installation. However, once the statues had been delivered, the gallery trustees decided instead to install the works on free-standing plinths halfway down either side the length of the facade. In May 1926 a separate tender was called for the plinth construction and the installation of the sculptures, with the eventual installation taking place in October.\nConservation\nBy 1993 the sculptures needed conservation treatment as a result of damage from air and sea pollution – sulphur dioxide from car exhausts and chlorides from the sea. Funds were allocated from the Department of Public Works to address the problems. The Art Gallery's Conservator wrote that \"Until we can solve our social problems, conservators will continue to search for better corrosion inhibitors, more durable waterproof coatings and innovative ways to prevent vandalism\".\nWar and peace and in between\nWar and Peace and in between was a site-specific installation artwork by Tatzu Nishi (b. 1960) in which the sculptures were incorporated into domestic scenes. The work was commissioned by Kaldor Public Art Projects and was on display from October 2009 to February 2010.\n}}\nSee also\n* List of public art in the City of Sydney\nNotes\n*The Art Gallery of New South Wales changed its name to \"The National Art Gallery of New South Wales\" in 1883 and reverted to its original name in 1958.\n*At least one contemporary source says that the commission was given in 1914 not 1916. If true this would mean that the models produced in 1915 were to seek approval for the design rather than as an initial proposal.\n*Other bronze statues cast by Burton on display in close proximity in Sydney include the figures of the Shakespeare Memorial (1926) opposite the State Library; Cardinal Moran (1928) and Archbishop Kelly (1933) at St Mary's Cathedral; and the soldier and sailor of the Sydney Cenotaph (1929) in Martin Place – all by Bertram Mackennal. Other earlier works in Sydney cast at the same foundry but under previous ownership include James Cook (1878) by Thomas Woolner in Hyde Park and Queen Victoria (1888) in Queens Square by Joseph Edgar Boehm.\nReferences"
    }
  ]
}