{
  "content": [
    {
      "type": "text",
      "text": "# The Discovery Store\n\nThe Discovery Store (also known as Must Have It) was a British high-street chain of stores, predominantly selling novelty gadgets, toys and lighting products. It was best known for being led by Phones 4u founder John Caudwell (as part of The Caudwell Group) from 2001 to 2005.\nHistory\nThe business was formed by Barry and Geraldine Ricketts with Alan Mitchell as part of the family-owned Raysun Group Plc in Scarborough, North Yorkshire in 1991, and by the early 2000s had expanded operations across the United Kingdom. In 2001, the Raysun Group placed The Discovery Store's 31 outlets into administration with KPMG.\nLater on in 2001, The Discovery Store was bought out of administration for around £30 million by The Caudwell Group, best known for its ownership of Phones 4u. John Caudwell claimed \"I am committed to making [the chain] the number one for boys' toys and gadgets in the UK\", as well as citing ideas for flagship stores in major city locations. Whilst these large plans would never materialise, the chain would increase by 21 outlets, expanding its size to 52 stores, as well as an increased online presence.\nThe company made profit by the end of 2001, however would lose £3 million by the end of 2002, and would lose £38 million by June 2004.\nIn June 2004, John Caudwell claimed that The Discovery Store's previous managers \"had failed to hit the vision [he] had for the stores\" - and wanted to make the chain \"the true place of discovery for the latest gadgets\". The Discovery Store opened three concept stores entitled Must Have It (stylised as \"must have IT\"), and changed the focus from toys, to just predominantly selling gadgets. All stores had been converted to this new format by August 2004. Must Have It stopped trading on the high street and online in March 2005, citing difficult Christmas trading, and increased competition from various department stores who had recently entered the gadget market. This is also evidenced as rival chain, The Gadget Shop, also folded a month after in April 2005.\nIn 2009, The Discovery Store trademark was purchased from The Caudwell Group by Barry and Geraldine Ricketts, who used it to re-open the chain. The business began to trade online and gradually began to start opening high-street locations. In 2012, The Discovery Store went into administration, with the company only proceeding forward online until its demise in 2016.\nLegacy\nIn 2010, when questioned about his biggest business failure, John Caudwell stated that \"I put too much effort into running a chain of gadget stores, “Must Have It”, in about 2002. I founded this as a national chain and stuck with it far too long, persevering for maybe two years, but the formula didn’t work.\"\nSee also\n* The Gadget Shop\nReferences"
    }
  ]
}