{
  "content": [
    {
      "type": "text",
      "text": "# The Savages (Screaming Lord Sutch backing band)\n\nThe Savages was a British rock band formed in 1960, and is perhaps best known for being the backing band for the late Screaming Lord Sutch.\nCareer\nFormer members, prominent in the British rock scene, include Jimmy Page and John Bonham of Led Zeppelin, Ritchie Blackmore of Deep Purple, Jeff Beck, Keith Moon of The Who, Adrian Gurvitz, Albert Lee, Mick Abrahams, Noel Redding and Mitch Mitchell of the Jimi Hendrix Experience, and keyboard players Nicky Hopkins, Matthew Fisher, Freddie 'Fingers' Lee and Paul Dean, an actor/singer who would later find fame under the stage name of Paul Nicholas, who Sutch said he used in the band to attract the pretty girls.  Sutch would at times use the name, The Savages, at some gigs where the established line-up of Savages was not available, usually for financial reasons, a pick-up band would be brought in, but the 'real' Savages have been a working band for over 50 years.\nIn August 1963, the British music magazine, NME reported that should Sutch win the forthcoming Stratford-upon-Avon by-election in which he was standing as a parliamentary candidate, he would give up the music industry to concentrate on politics, but that the Savages would continue their flamboyant act alone.\nFollowing the death of Sutch in 1999, the band continued to perform with members Tony Dangerfield (who joined the Savages initially during the 1960s), Dave Dix, Angi Antinori, Jack Irving (all three joined during the early 1990s) and Johnny Casanova (who joined the band in 1995, following a meeting with Sutch and the band at a festival at Donington). Performances are infrequent due to the individual commitments of the band members. Following the death of bassist Dangerfield in 2008, the band has re-established itself with the current, 2009 line-up of Angi Antinori on lead guitar, Jack Irving on drums and vocals, Johnny Casanova on keyboards and vocals, and on bass, former Savage, and one of Sutch's 'Heavy Friends' line-up, Nick Simper.\nReferences"
    }
  ]
}