{
  "content": [
    {
      "type": "text",
      "text": "# The Heritage House\n\n| founder        = Rabbi Meir Schuster\n| purpose        = Providing lodging and resources for young Jewish adults to explore Israel and their heritage\n| headquarters   = Jewish Quarter, Old City of Jerusalem\n| language       = Hebrew, English\n| coordinates    =\n| pushpin_map    = Old Jerusalem\n| map_alt        =\n| pushpin_relief =\n| map_dot_label  = The Heritage House\n}}\nThe Heritage House is a non-profit youth hostel in the Jewish Quarter of the Old City of Jerusalem. It offers free or  subsidized lodging to Jews from around the world. The hostel provides young Jewish adults with information on touring, studying, intern, and work opportunities in Israel, in addition to providing follow-up connections, especially with the Jewish communities back in their home towns around the world.\nHistory\nRabbi Meir Schuster opened the Heritage House non-profit youth hostels in 1985 in the Jewish Quarter of Jerusalem in order to give Jewish young adults the opportunity to explore Israel and their heritage in a safe and home-like environment. It is the only Jewish-run youth hostel in the Old City. After changes in leadership, the organization split into two separate entities. The Men's house, led by Rabbi Ben Packer, moved to a location near the Hurva Synagogue. The Women's house, led by Chaya Weisberg, remained at its original location.\nServices\nApart from lodgings, the Heritage House provides a range of services designed to help guests explore Israel and Judaism, including free tours, information on educational programs, internship and volunteering opportunities.\nThere is a special optional program every Shabbat. One of the highlights is Jeff Seidel, director of the Jewish Student Information Center, arranges for guests to spend Shabbat meals with Orthodox families. For many guests this is the first time they ever see traditional Jewish family life up close.\nThe High Holy Days are the busiest time of the year for the Heritage House. An explanatory service is run in the Old City designed especially for beginners, although it attracts young Jews up to the age of 30 from all levels of observance.\nUnder the leadership of Packer, guests of the Jerusalem Heritage House for men take part in volunteer work restoring historical sites in Hebron and  repairing synagogues and agricultural work at the vineyard in Kfar Tapuach and at locations in Israeli settlements.\nAccommodations\nThe Heritage House consists of two buildings, one for men and one for women, which are in close proximity. The buildings date back to the Crusader period, with a medieval ambiance preserved through the stone walls and classic interior arches. Nevertheless, both buildings have modern renovations and extensions to cater to the comfort of the guests.\nControversy\nIn a series of reports published in Haaretz between Nov. 13–14 2017, it was alleged that the men's Heritage House encourages guests to volunteer in illegal West Bank outposts, does not accept non-Jewish guests, and promotes a radical right-wing agenda. Former guests who were interviewed on their time there described its director, Rabbi Ben Packer, as an open Kahanist and claimed to have heard him making racist and homophobic remarks. One former guest who had stayed in the hostel when Rabbi Meir Schuster was still in charge and then returned after Packer had taken over claimed that it began promoting Kahanist ideology after Packer assumed leadership. Following the reports, Birthright stopped promoting the hostel while Aish, among other Jerusalem centered foundations, continued their support. The women's Heritage House however is considered definitively apolitical and is a separate legal entity.\nReferences\nExternal links\n*[http://www.cjnews.com/israel/jerusalem-hostel-caters-non-observant Jerusalem hostel caters to the non-observant | The Canadian Jewish News]\n*[https://www.jpost.com/Travel/Jerusalem/Top-5-Jerusalem-hostels Top 5: Jerusalem hostels | JPost | Israel News]\n*[https://www.haaretz.com/israel-news/1.822795]\n*[https://www.haaretz.com/israel-news/.premium-1.821979]\n*[https://www.haaretz.com/israel-news/.premium-1.822627]\n*  Men's hostel\n*  Women's hostel\n*"
    }
  ]
}