{
  "content": [
    {
      "type": "text",
      "text": "# The Walking Who\n\nfor living people supply only the year unless the exact date is already WIDELY published, as per WP:DOB -->\n| birth_place       =\n| origin            = Wollongong, New South Wales, Australia\n| death_date        =\n| death_place       =\n| genre             = Psychedelic rock\n| occupation        = Musician, engineer, producer\n| instrument        = Vocals, guitar\n| discography       =\n| years_active      = 2010–present\n| label             =\n| current_member_of =\n| past_member_of    =\n| spouse            =\n| partner           =\n| website           =\n| module            =\n| module2           =\n| module3           =\n}}\nThe Walking Who is the stage name of Rohin Brown, an Australian musician, audio engineer, record producer and film maker. The name originated from his Australian psychedelic rock band, which he formed in 2010 in Wollongong. Original fellow members were Jay \"Bird\" Drury on bass guitar and Paul Mclean on drums.\nEarly career\nRohin Brown, on guitar and vocals, formed a psychedelic rock band, the Walking Who, in 2010 in Wollongong. Original line-up with Brown were Jay \"Bird\" Drury on bass guitar and Paul Mclean on drums. Brown and Drury had met in 2009 and began jamming and writing together before McLean joined six&nbsp;months later – Brown provided the band's name.\nTheir self-released debut album, Candy Flu (October 2011), had its title track issued earlier in that year. The song received airplay on Sydney's FBi Radio and the Walking Who were named Unsigned Artist of the Week in March 2011. The music video for \"Candy Flu\" was named ABC TV's Rage Indie clip of the week.\nTheir next single \"Have You Seen the Colours\" (December 2012) received airplay on FBi Radio and were heard on FBi's Lunch Break. It was played by national youth radio, Triple J on Richard Kingsmill's 2013 and Dom Alessio's Home & Hosed. Other Triple J DJ's wrote reviews on Triple J Unearthed. The Walking Who performed around Australia, including gigs at The Annandale Hotel, the Alhambra Lounge and Oxford Art Factory.\nIn March 2013 the band supported Delta Riggs with a variable line-up, with core members Brown, Drury and McLean joined by Steve Hicks and Brad Heald or two additional musicians. They independently released a five-track extended play, Mansions (September 2013). Noemie Huttner-Koros of BMA Magazine rated the EP at three-and-a-half out-of-five, \"It's got a laid-back, mellow feel to it, with accessible tunes... a bit of variety might be good, as sometimes it feels like I'm listening to one song for a long time, instead of five\". They played at a new festival, Farmer and The Owl, in November at the University of Wollongong.\nIn 2014 the Walking Who won the FBi Radio's Northern Lights Competition, earning a spot on stage at the Airwaves Festival in Iceland. The band also released a single \"With Roses\" and performed at the PigSty in July festival. At the end of that year, the band were nominated for two awards at FBi Radio's Sydney Music, Arts and Culture (SMAC) Awards.\nIn 2015 the band played at the Farmer and the Owl festival again, before embarking on a tour of the United Kingdom and parts of continental Europe. They performed alongside the Knife, King Gizzard and the Lizard Wizard, Kurt Vile, and the Flaming Lips at the Citadel Festival, London. On that tour they had a show at Sea Shepherds’ 40th Birthday party in Bordeaux, France (2017).\nSolo artist and film maker\nIn 2019 Brown adopted the stage name, the Walking Who, when he relocated to Europe, settling initially in the UK with the intention of recording in Faust Studio, Prague, Czech Republic. Brown was both locked out of Australia and locked down in Prague during the COVID-19 pandemic.\nThe Walking Who's EP, Mr Cornelius, was released on 22 October 2021. At that time, Brown announced that a five-track EP was due in the coming months. His associated music video became a film of the same name. Brown was a finalist at both the Cannes World Film Festival, and the Sandgrounder International Short Film Festival (UK) - Finalist in Weird and Wonderful Award, for Mr Cornelius. He won Best New Wave / Post Modern Film, Best Indie Short Director and Best Soundtrack.\nAwards and nominations\nSydney Music, Arts and Culture Awards\nThe Sydney Music, Arts & Culture (SMAC) Awards are presented annually since 2008 by FBi Radio.\n|-\n|rowspan=\"2\"|SMAC Awards 2014 || \"With Roses\" || Best Song ||\n|-\n|The Walking Who || Best Live Act ||\nReferences\nExternal links\n* [https://web.archive.org/web/20160207065214/http://www.thewalkingwho.com/ Official Website (band)] archived from [http://www.thewalkingwho.com/ the original] on 7 February 2016, retrieved 19 May 2024."
    }
  ]
}