{
  "content": [
    {
      "type": "text",
      "text": "# The Making of a Teacher\n\nThe Making of a Teacher is a spiritual biography of the Indian spiritual teacher Eknath Easwaran (1910–1999), written by Tim and Carol Flinders and originally published in the United States in 1989. Adopting an oral history approach, the book recounts numerous conversations with Easwaran that describe his childhood, career as a professor of English literature, spiritual awakening, and service as a spiritual teacher in the United States. The book also profiles his way of life at the time of publication, and his relationship with his grandmother, his own spiritual teacher. An Indian edition was published in 2002. The book has been reviewed in newspapers,\nand also excerpted.\nBackground\nIn 1989, Eknath Easwaran had been teaching meditation in the US for more than 25 years. A former professor of English literature in India, Easwaran had in 1968 taught perhaps the first credit course on meditation at a major US university, though he was not hired by UC Berkeley and was not the \"professor on record.\" He was, at best, a guest-lecturer. (pictured, below right). He had also published many spiritual books, had founded a meditation center, hosted numerous meditation retreats, given thousands of talks, and served as spiritual teacher to thousands of students. According to the Flinders, themselves longtime students, many people whose lives had been affected by Easwaran wanted to know more about him. \"'Who is he?' they ask, through letters, at retreats, and at his Tuesday night talks. 'What is he really like? And how did he get to be that way?'\" In The Making of a Teacher, published in 1989, the Flinders' aim was\n}}\nTopics covered\nThe Making of a Teacher contains five chapters, each named after the setting of the conversations that it recounts with Easwaran. Each of the five locations also played an important role in Easwaran's life at the time the book was written (late 1980s). Accordingly, each chapter also uses its setting to profile one facet of Easwaran's way of life and modes of interaction with the people around him.\nThe first chapter is entitled \"Santa Sabina: Profile of a Teacher,\" after the location where Easwaran's Blue Mountain Center of Meditation was offering its meditation retreats. It portrays the attenders at a retreat&nbsp;– their diversity in age, gender, profession, and geographical residence&nbsp;–  and describes their interactions with him in a two-hour question and answer session.\nThe book's middle three chapters chronologically focus on Easwaran's childhood, his life in India as a professor, and his life in the US as a spiritual teacher. Chapter 2 recounts Easwaran's  upbringing in a South Indian village near the town of Palghat, in Kerala State. The conversations describe his large matrilineal ancestral family, with special attention to his grandmother, whom he identifies as his spiritual teacher. He described her as established in \"samadrishti... seeing the same Lord in everyone,\" \"always full of God's awareness,\" and as being \"orthodox in a very unorthodox way\": In their ancestral village, most of Easwaran's family worshiped at a temple to the god Shiva. But Easwaran's grandmother\n}}\nChapter 2 also describes Easwaran's daily routines at Ramagiri Ashram, the spiritual community that he founded. Easwaran works in a glass-walled office \"within view of his students... for long stretches at a time and is available each day for consultation.\" He \"often jokes that he lives in a glass house\".\nWith regard to being a spiritual teacher, Easwaran states that people in India know that the responsibility of a spiritual teacher is \"formidable\", and that spiritual teachers must be \"on duty all the twenty-four hours\":\n}}\nExercise is an \"unvarying part\" of Easwaran's routine, and chapter 3 is set on a beach walk by Easwaran and his wife Christine. The conversations recount Easwaran's years as a college student and professor of English literature. As an undergraduate, he attended Saint Thomas College, receiving inspiration from its headmaster, Father John Palocaren (later a Monsignor).\nDeeply immersed in English literature, he attended graduate school at the University of Nagpur, and later taught at a small college in Amravati. A Muslim colleague helped Easwaran develop an appreciation for Persian poetry:\n}}\nEaswaran soon established a national reputation as a columnist for The Times of India, a story writer for the Illustrated Weekly of India, and a regular speaker on All India Radio. He was appointed full professor and chair of the English department at the University of Nagpur. Yet during this same period, Easwaran started sensing that something was missing from his life, although he had \"no clear sense of what it was\". Easwaran attended lectures by prominent intellectuals and \"steeped himself\" in Western psychology. But these speakers and thinkers were unable to answer his most basic question, \"What is the purpose of life?\"\nteaching \"Theory and Practice of Meditation\" (Religious Studies 138X) in 1968 at UC Berkeley, \"to anyone's knowledge ... the first accredited course on meditation offered by any university\"]]\nChapter 4 describes a visit to U.C. Berkeley by Easwaran, his niece, and several friends, to see a play by George Bernard Shaw. Easwaran's party also briefly visits the lecture hall where Easwaran in 1968 taught what is believed to be the first accredited course on meditation offered by any US university (see photo). Conversations describe Easwaran's discovery of his distinctive method of meditation, based on meditating on memorized spiritual texts, and his prolonged period of spiritual practice&nbsp;–  \"years of discipline\"&nbsp;– before he became established in meditative consciousness.\nDuring this period he felt he was being \"carried along in the arms\" of his spiritual teacher, his grandmother. He had experienced a \"voice from within, saying 'It's time to wake up! It's time to seek God,'\" that he eventually discovered was his grandmother's voice. She had been his teacher all along, having \"planted all the seeds\" during Easwaran's boyhood. As he engaged in systematic spiritual practice, Easwaran found himself gradually developing a \"mastery of the mind\", conscious as well as unconscious, and encountering and developing a relationship with the \"deepest sources\" of his life, \"call it Sri Krishna, the Christ, the Compassionate Buddha, or the Divine Mother.\"\nChapter 5 describes one of the public talks that Easwaran gave each week in Petaluma, California. Before the talk, a coffee hour drew people of all ages, and some of Easwaran's students held meetings for social and environmental service projects. In his talk, Easwaran comments on several verses from the Bhagavad Gita, using metaphors that range from the Olympic Games to a scriptural image of a tortoise. He discusses how his system of spiritual practices can be used to help address environmental problems as well as to overcome addictions of all kinds.\nThe book also contains a foreword and reproduces 41 photographs from all periods of Easwaran's life.\nReception\nReviews have appeared in The Hindu,\nHinduism Today,\nThe Times (Indiana),\nand the Internet Bookwatch.\nHinduism Today stated that the authors of Making often engage in \"just turning on the tape of Easwaran, so to speak, for the reader to listen in ....\" And\n}}\nIn The Times (Indiana), Helms-Pokrajac stated that she began reading \"with a goodly amount of skepticism\", but that in Making,\n}}\nShe concluded that the Flinders \"have succeeded\" in their \"aim ... to 're-create not only what Easwaran has said but to convey some feeling for what it's like to be with him when he's talking&nbsp;–  and for what it's like to be one of his students.'\"\nIn The Hindu, Behal described Making as \"a journey in introspection, one told with devotion, and with an accuracy that makes for interesting reading\".\nShe averred that \"Easwaran's simple description of what changed in his life when he touched the great depths of meditation\"&nbsp;–  \"'now I see into the world. I see the Self, the divine spirit that throbs at the heart of every creature'\"&nbsp;–  is perhaps not \"the most energising point of discussion to begin\". But \"that is what endeared him to the people who came in contact with him. His undramatic sense of being, his almost low-key lifestyle and, most of all, his amazing compassion for his fellow beings.\"\nThe Internet Bookwatch stated that Making \"is both inspiring and informative\", telling the \"fascinating story of how this noted teacher of meditation transformed his own life\". The book \"vividly demonstrates why so many people have used this method to draw upon their deepest reserves of compassion, wisdom, and serenity\".\nThe Making of a Teacher has been excerpted in Hinduism Today and The Quest.\nEditions\nThe original edition was published by in 1989 by Nilgiri Press, an Indian edition was published in 2002 by Penguin India, and an electronic edition was published in the US in 1993:\n*  (191 pages).\n*Ebook:  (191 pages).\n*  (191 pages).\nReferences\nExternal links\n*[https://books.google.com/books?id=YsgkdFk4XWYC&dq=%22Easwaran%27s+grandmother+with+her+granddaughter+Leela%22&pg=PA56 Photograph of Easwaran's spiritual teacher, his grandmother (p. 57)]"
    }
  ]
}