{
  "content": [
    {
      "type": "text",
      "text": "# The Office of Historical Corrections\n\nThe Office of Historical Corrections is a short-story collection by American writer Danielle Evans. Published by Riverhead Books on November 10, 2020, the collection consists of six short stories and a novella (after which the collection is named) that deal with topics of race, loss, legacy, and loneliness in America. It was nominated for The Story Prize and the Chautauqua Prize, and received the 2021 Joyce Carol Oates Literary Prize.\nStories\n* \"Happily Ever After\" – a woman struggles with the legacy of cancer in her family.\n* \"Richard Of York Gave Battle In Vain\", a photojournalist attends the wedding of a man she encountered accidentally, and is met with deep suspicion by the bride, who believes she might have had an affair with the groom.\n* \"Boys Go to Jupiter\" – a white teenager becomes embroiled in a scandal at her university when a picture of her in a confederate flag bikini goes viral.\n* \"Alcatraz\" – a woman tries to cheer up her mother after she loses a court battle to clear her grandfather's name by reconnecting with the white family members from whom she was separated as a child.\n* \"Why Won't Women Just Say What They Want\" – a misogynistic artist issues a series of public apologies to the women he has wronged.\n* \"Anything Could Disappear\" – a young woman relocating to New York City to start a new life in the midst of the Great Recession hits a speed bump when a complete stranger abandons her placid baby with her.\n* \"The Office of Historical Corrections\" (novella) – a D.C. woman works for the Institute of Public History, jokingly nicknamed The Office of Historical Corrections, trying to combat the epidemic of misinformation in American society. When she is sent to Wisconsin on a mission to amend her ex-co-worker's correction, she ends up uncovering the dark truth of one family's past.\nThemes\nThe book's stories center apologies, corrections, and \"making things right\", per the author Danielle Evans.\nPublication\n* Evans, Danielle (2020). The Office of Historical Corrections (hardcover 1st ed). Riverhead Books. .\nReception\nThe New York Times praised the collection as weaving together \"Melvillian mundanity with melodramatic suspense\". In a starred review, Kirkus Reviews praised the collection as a whole, calling the stories \"[n]ecessary narratives, brilliantly crafted\". Ian MacAllen of the Chicago Review of Books applauded the writing as \"tightly structured, compact and efficient, driven by wry wit and Evans’s keen observations.\" Chaya Bhuvaneswar, reviewing The Office of Historical Collections in The Washington Post, said that \"this book will make readers face the news with renewed emotion, emotion all the more potent for the devastation that history has wrought on Evans’s characters, and on all of us.\"\nTwo stories were previously included in The Best American Short Stories anthologies.\nAccolades\n* 2020: O Magazine 20 Best Books of 2020\n* 2020: The Story Prize, Finalist\n* 2021: Aspen Words Literary Prize, Finalist\n* 2021: Chautauqua Prize, Finalist\n* 2021: Joyce Carol Oates Literary Prize, Winner\n* 2022: William Saroyan International Prize for Writing, Finalist\nReferences\nExternal links\n* [https://www.penguinrandomhouse.com/books/303653/the-office-of-historical-corrections-by-danielle-evans/ The Office of Historical Collections] on Penguin Random House"
    }
  ]
}