{
  "content": [
    {
      "type": "text",
      "text": "# The Animal Kingdom (2023 film)\n\n| director       = Thomas Cailley\n| writer         =\n| producer       = Pierre Guyard\n| starring       =\n| cinematography = David Cailley\n| editing        = Lilian Corbeille\n| music          = Andrea Laszlo De Simone\n| studio         =\n| distributor    = StudioCanal\n| released       =\n| runtime        = 130 minutes\n| country        =\n| language       = French\n| budget         = €13–15 million\n| gross          = $9.1 million\n}}\nThe Animal Kingdom () is a 2023 science fantasy adventure drama film directed by Thomas Cailley and written by Cailley and Pauline Munier. It stars Romain Duris, Paul Kircher and Adèle Exarchopoulos.\nIt had its world premiere as the opening film of the Un Certain Regard section at the 76th Cannes Film Festival on 17 May 2023. It was released in France on 4 October 2023 to mostly positive reviews. It received a leading 12 nominations at the 49th César Awards, and won 5 awards: Best Cinematography, Best Sound, Best Original Music, Best Costume Design and Best Visual Effects.\nSynopsis\nIn a world hit by a wave of mutations that are gradually transforming some humans into animals, François does everything he can to save his wife, who is affected by this mysterious condition. As some of the creatures disappear into a nearby forest, he embarks with Émile, their 16-year-old son, on a quest that will change their lives forever.\nCast\n* Romain Duris as François\n* Paul Kircher as Émile\n* Adèle Exarchopoulos as Julia\n* Tom Mercier as Fix\n* Billie Blain as Nina\n* Nathalie Richard as Professor Valérie Beaudoin\n* Saadia Bentaieb as Naïma\nProduction\nThe Animal Kingdom is the second feature film by French director Thomas Cailley, after releasing his award-winning debut feature Love at First Fight in 2014. He co-wrote the screenplay with Pauline Munier based on an original idea by Munier. It is set in the Gironde department, where the filmmaker grew up and where his first film was staged (Landes de Gascogne). The screenplay was written before the COVID-19 pandemic. As with Love at First Fight, Pierre Guyard of Nord-Ouest Films served as the film's producer, while his brother David served as director of photography and Lilian Corbeille handled editing. The principal roles were performed by Romain Duris, Adèle Exarchopoulos and Paul Kircher. Duris indicated that he would play one of the surviving beings. He praised the script, but said the film would feature a lot of special effects, which would not make it easy for an actor.\nShooting began in May 2022 and took place entirely in the Nouvelle-Aquitaine region, largely divided across Landes, Dordogne and Gironde. The filming began in the commune of Fleix and moved across the banks of the river Lot in Lot-et-Garonne, particularly in the communes of Le Temple-sur-Lot and Castelmoron-sur-Lot. Production costs have been estimated between 13 and 15 million euros. In total, filming was to last 57 days, until mid-August. The project received financial support from the Centre national du cinéma et de l'image animée (CNC), a government agency responsible for promoting cinema.\nRelease\nThe film was selected to be screened as the opening film of the Un Certain Regard section of the 76th Cannes Film Festival, where it had its world premiere on 17 May 2023. The film was theatrically released in France by StudioCanal on 4 October 2023. It was also invited at the 28th Busan International Film Festival in 'Open Cinema' section and was screened on 8 October 2023.\nReception\nCritical response\nOn Rotten Tomatoes, the film holds an approval rating of 83% based on 58 reviews, with an average rating of 6.9/10. The site's critics consensus reads: \"The Animal Kingdoms talented cast anchors its more fantastical elements in human emotion, helping offset a superficial treatment of thought-provoking themes.\" On Metacritic, the film has a weighted average score of 69 out of 100, based on 17 critic reviews indicating \"generally favorable\" reviews. On AlloCiné, the film received an average rating of 4.3 out of 5 stars, based on 45 reviews from French critics.\nAccolades\n{| class=\"wikitable sortable plainrowheaders\"\n! scope=\"col\" | Award\n! scope=\"col\" | Date of ceremony\n! scope=\"col\" | Category\n! scope=\"col\" | Recipient(s)\n! scope=\"col\" | Result\n! scope=\"col\" class=\"unsortable\" |\n|-\n! scope=\"row\" | Cannes Film Festival\n| 26 May 2023\n| Un Certain Regard\n| Thomas Cailley\n|\n| align=\"center\" |\n|-\n! scope=\"row\" rowspan=\"12\" | César Awards\n| rowspan=\"12\" | 23 February 2024\n| Best Film\n| The Animal Kingdom\n|\n| rowspan=\"12\" align=\"center\" |\n|-\n| Best Director\n| Thomas Cailley\n|\n|-\n| Best Actor\n| Romain Duris\n|\n|-\n| Best Male Revelation\n| Paul Kircher\n|\n|-\n| Best Original Screenplay\n| Thomas Cailley and Pauline Munier\n|\n|-\n| Best Cinematography\n| David Cailley\n|\n|-\n| Best Editing\n| Lilian Corbeille\n|\n|-\n| Best Sound\n| Fabrice Osinski, Raphaël Sohier, Matthieu Fichet, and Niels Barletta\n|\n|-\n| Best Original Music\n| Andrea Laszlo De Simone\n|\n|-\n| Best Costume Design\n| Ariane Daurat\n|\n|-\n| Best Production Design\n| Julia Lemaire\n|\n|-\n| Best Visual Effects\n| Cyrille Bonjean, Bruno Sommier, Jean-Louis Autret\n|\n|-\n! scope=\"row\" | Louis Delluc Prize\n| 6 December 2023\n| Best Film\n| rowspan=\"2\" | The Animal Kingdom\n|\n| align=\"center\" |\n|-\n! rowspan=\"5\" scope=\"row\" | Lumière Awards\n| rowspan=\"5\" | 22 January 2024\n| Best Film\n|\n| align=\"center\" |\n|-\n| Best Director\n| rowspan=\"2\" | Thomas Cailley\n|\n| align=\"center\" |\n|-\n| Best Screenplay\n|\n| rowspan=\"3\" align=\"center\" |\n|-\n| Best Cinematography\n| David Cailley\n|\n|-\n| Best Music\n| Andrea Laszlo De Simone\n|\n|-\n! scope=\"row\" | Miskolc International Film Festival\n| 9 September 2023\n| Emeric Pressburger Prize for Best Feature Film\n| The Animal Kingdom\n|\n| align=\"center\" |\n|}\nReferences\nExternal links\n*"
    }
  ]
}