{
  "content": [
    {
      "type": "text",
      "text": "# The empire on which the sun never sets__disambig_1\n\nThe phrase \"the empire on which the sun never sets\" has been used to describe the British Empire due to it being so territorially extensive that it seemed as though it was always daytime in at least one part of their territories. Previously, the concept referred to the Spanish Empire under Philip II and his successors, particularly in the 16th, 17th, and 18th centuries. The phrase originated to describe the empire of Charles V and derived from similar ancient claims of universal rule referring to the  Roman and Persian empires.\nHistory\nPrecursors\nGerman philologist Georg Büchmann identifies a speech attributed to Persian ruler Xerxes I (&nbsp;BCE465&nbsp;BCE) in ancient Greek historian Herodotus' (&nbsp;BCE425&nbsp;BCE) Histories as containing a precursor of the idea of the sun never setting on a particular political entity in the quote \"We shall extend the Persian land as far as Zeus's heaven stretches. The sun will then shine on no land beyond our territory.\" Israeli historian Benjamin Isaac posits that this quote may have inspired ancient Greek historian Dionysius of Halicarnassus (&nbsp;BCEafter 7&nbsp;BCE) to describe Ancient Rome as \"the first and only power ever to have made the risings and settings of the sun the boundaries of her power\", and identifies this in turn as a predecessor of the \"empire on which the sun never sets\" phrase. According to the historian Geoffrey Parker, a claim that Charles V ruled an \"empire on which the sun never set\" emerged as a variant of the phrase coined in ancient Rome to describe the possessions of  emperor Augustus extending 'from the rising to the setting of the sun'.\nSpanish Empire\nUnder Philip II, successor of Charles V in Spain, the concept of an \"empire on which the sun never sets\" became associated with the Spanish Empire. In 1585 Giovanni Battista Guarini wrote  to mark the marriage of Catherine Michelle, daughter of Philip II, to Charles Emmanuel I, Duke of Savoy. Guarini's dedication read, \"\" (\"The proud daughter / of that monarch to whom / when it grows dark [elsewhere] the sun never sets.\").\nIn the early 17th century the phrase was familiar to John Smith and to Francis Bacon, who writes: \"both the East and the West Indies being met in the crown of Spain, it is come to pass, that, as one saith in a brave kind of expression, the sun never sets in the Spanish dominions, but ever shines upon one part or other of them: which, to say truly, is a beam of glory [...]\". Thomas Urquhart wrote of \"that great Don Philippe, Tetrarch of the world, upon whose subjects the sun never sets.\"\nIn the German dramatist Friedrich Schiller's 1787 play Don Carlos, Don Carlos's father, Philip II, says, \"\" (\"I am called / The richest monarch in the Christian world; / The sun in my dominion never sets.\").\nJoseph Fouché recalled Napoleon saying before invading Spain and starting the Peninsular War, \"Reflect that the sun never sets in the immense inheritance of Charles V, and that I shall have the empire of both worlds.\" This was cited in Walter Scott's Life of Napoleon.\nBritish Empire\nin 1919, at its greatest extent with presence on all continents]]\nIn the 19th century it became popular to apply the phrase to the British Empire. It was a time when British world maps showed the Empire in red and pink to highlight British imperial power spanning the globe. Scottish author, John Wilson, writing as \"Christopher North\" in ''Blackwood's Magazine'' in 1829, is sometimes credited as originating the usage. However, George Macartney wrote in 1773, in the wake of the territorial expansion that followed Britain's victory in the Seven Years' War, of \"this vast empire on which the sun never sets, and whose bounds nature has not yet ascertained.\"\nIn a speech on 31 July 1827 Rev. R.P. Buddicom said, \"It had been said that the sun never set on the British flag; it was certainly an old saying, about the time of Richard the Second, and was not so applicable then as at the present time.\" In 1821, the Caledonian Mercury wrote of the British Empire, \"On her dominions the sun never sets; before his evening rays leave the spires of Quebec, his morning beams have shone three hours on Port Jackson, and while sinking from the waters of Lake Superior, his eye opens upon the Mouth of the Ganges.\"\nDaniel Webster famously expressed a similar idea in 1834: \"A power which has dotted over the surface of the whole globe with her possessions and military posts, whose morning drumbeat, following the sun and keeping company with the hours, circles the earth with one continuous and unbroken strain of the martial airs of England.\" In 1839 Sir Henry Ward said in the House of Commons, \"Look at the British Colonial empire—the most magnificent empire that the world ever saw. The old Spanish boast that the sun never set in their dominions, has been more truly realised amongst ourselves.\" By 1861, Lord Salisbury complained that the £1.5&nbsp;million spent on colonial defence by Britain merely enabled the nation \"to furnish an agreeable variety of stations to our soldiers, and to indulge in the sentiment that the sun never sets on our Empire\".\nA rejoinder, sometimes attributed to John Duncan Spaeth, runs in one variant, \"The sun never set on the British Empire, because even God couldn't trust the English in the dark\".\nSee also\n*List of former transcontinental countries\n*Pluricontinentalism\nReferences"
    }
  ]
}