{
  "content": [
    {
      "type": "text",
      "text": "# The Cultural Revolution: A People's History, 1962–1976\n\n'The Cultural Revolution: A People's History, 1962–1976' is a book by University of Hong Kong historian Frank Dikötter. It is the third book in a trilogy about the history of China under Mao Zedong, based on newly opened government archives, particularly on previously classified party documents from secret police reports and unexpurgated versions of leadership speeches, as well as on interviews and memoirs. Dikötter's first book in the series, ''Mao's Great Famine, covered the period of the Great Leap Forward, whereas The Tragedy of Liberation'' examines the establishment and first decade of the People's Republic of China.\nAfter the failure of the Great Leap Forward, Mao Zedong launched the Cultural Revolution to restore his reputation and eliminate perceived threats. Aimed at purging capitalist and bourgeois elements, it mobilized youth into Red Guards who initially supported Mao but soon turned on each other violently. The resulting chaos led to military intervention, transforming China into a militarised state and triggering large-scale purges in which as many as one in fifty people were crushed. In the book, Dikötter discusses the causes and consequences of the Cultural Revolution and provides a crucial reminder of the tragedies, miscalculations and human costs of Mao's last experiment.\nReception\nIn her review for The Guardian, Julia Lovell, a professor of modern chinese history, called it an extension of ''Mao's Last Revolution'' by Roderick MacFarquhar and Michael Schoenhals, with more intensive use of evidence drawn from China's local archives, and an excavation of the unintended socioeconomic consequences of the Cultural Revolution, including the growth of a private economy. According to Lovell, a second important element of the book is that the unintended socioeconomic consequences of the Cultural Revolution was that \"a purge launched to preserve the anti-capitalist 'purity' of Mao's revolution had the opposite effect.\"\nSinologist Daniel Leese pointed out four issues about the book: lack of analysis or explanation of many local examples within their particular environment, lack of comprehensive analysis on causes and effects, problematic neglect of the role of ideology in Mao Zedong's launch of the Cultural Revolution, and a lack of clarity between analytical concepts and party language. Nevertheless, Leese summarizes the book as \"a well-readable account of the Cultural Revolution for a broad audience that offers new perspectives, which are definitely worthwhile pondering, although probably not all of the proposed answers will hold up. Yet the volume hopefully triggers a number of detailed case studies that will probe long-held assumptions about this crucial period of transformation.\"\nIn his review of the book, Fabio Lanza, a cultural historian of twentieth-century China, wrote that Dikötter repeatedly made controversial statements without providing sufficient evidence, and he described events with salacious, if very dubious, details. Lanza concluded that Dikötter's work \"does not add anything to our understanding of the Cultural Revolution. Rather, as a mass-marketed assessment of the period, it goes against a long-standing effort in the field of PRC history to produce nuanced, well-sourced, complex, historically rich, and truly innovative analyses.\" In his review, journalist Ian Johnson wrote about Dikötter's lack of nuance and the absence of grounding for his contrarian views (for example, Dikötter wrote that literacy and public health decreased during the Mao period).\nThe journalist Philip Short, who wrote a biography and presented a TV documentary on Mao Zedong entitled ''Mao's Bloody Revolution Revealed'', wrote that \"Dikötter's errors are strangely consistent. They all serve to strengthen his case against Mao and his fellow leaders.\" In reference to Dikötter's errors and misleading comments, Short said the main problem with the author's book was that it did not offer a credible explanation of why Mao and his colleagues acted as they did. Short posited that Dikötter's book \"set out to make the case for the prosecution, rather than providing balanced accounts of the periods they describe.\"\nReferences"
    }
  ]
}