{
  "content": [
    {
      "type": "text",
      "text": "# The Ancient City__disambig_2\n\nThe Ancient City: A Study on the Religion, Laws and Institutions of Greece and Rome (), published in 1864, is the seminal book of the French historian Numa Denis Fustel de Coulanges (1830–1889). Taking inspiration from René Descartes, and drawing on texts by ancient historians and poets, Fustel investigates the origins of the most archaic institutions in the Greco-Roman world.\nSummary\nFustel de Coulanges sees religion and the ancestor cult as the foundation of the institutions of the Greeks and Romans. As part of their \"domestic religion,\" each family had their own beliefs, gods, and forms of worship. The rules of gender and family hierarchy, ownership, and inheritance were governed by that cult.\nOver time, Fustel argued, need forced people to regularize with one another and make them more consistent, and the rules governing the family were transferred to larger units called gens, arriving eventually at the city-state. Therefore, the origin of the city and of private property is religious, as suggested by the practice of lustration, a periodic purification ceremony in connection with the census of all citizens, and by the public banquets in honor of local gods.\nThe laws originally encoded the privileges of the aristocracy, causing great discomfort to the plebs and a social revolution in which the common well-being of society became the new basis of religion. The city thus came into being for some time, until its extinction with the arrival of Christianity.\nMethodology\nIn the preface of the book, Fustel warns of the error that lies in examining the habits of ancient people with reference to those of today, when it is necessary to avoid our biases and study ancient peoples in the light of the facts.\nInfluence\nThe book is considered to be one of the most important French-language publications of the nineteenth century in virtue of its consistency, ingenuity, and style. Fustel set little store on this literary merit, but he clung tenaciously to his theories. When he revised the book in 1875, his modifications were slight, and it is conceivable that, had he recast it, as he often expressed the desire to do in the last years of his life, he would not have abandoned any part of his fundamental thesis.\nJoseph M. McCarthy in particular claimed that The Ancient City was based on Fustel's in-depth knowledge of the primary Greek and Latin texts. Summarizing it in his own words, he wrote:Religion was the sole factor in the evolution of ancient Greece and Rome, the bonding of family and state was the work of religion, that because of ancestor worship the family, drawn together by the need to engage in the ancestral cults, became the basic unit of ancient societies, expanding to the gens, the Greek phratry, the Roman tribe, to the patrician city state, and that decline in religious belief and authority in the moral crisis provoked by Roman wealth and expansion doomed the republic and resulted in the triumph of Christianity and the death of the ancient city-state.\nThe book's methodology was highly influential in the development of Émile Durkheim's conception of religion, in particular his desire to eliminate all preconceived notions. Although Durkheim later criticized Fustel, as he did not consider ethnographic evidence, and, in Durkheim's view, misunderstood the Roman gens.\n}}\nExternal links\n* Free online version\n*"
    }
  ]
}