{
  "content": [
    {
      "type": "text",
      "text": "# The Kingdom (Elgar)\n\nThe Kingdom, Op. 51, is an English-language oratorio by Edward Elgar. It is written for four soloists – soprano, contralto, tenor and bass – choir and large orchestra. The work was first performed at the Birmingham Triennial Music Festival on 3 October 1906. It continues the narrative of the lives of Christ's disciples begun in his earlier oratorio, The Apostles. It depicts the community of the early church, Pentecost, and the events of the next few days.\nBackground\nFollowing The Dream of Gerontius and The Apostles, the Birmingham Triennial Music Festival commissioned Elgar to produce another large choral and orchestral work for the 1906 festival. As a schoolboy he had been impressed by his teacher's vivid exposition of the character of the apostles; he recalled:\nAs an adult he conceived the idea of a work depicting the Apostles as ordinary men, reacting to extraordinary events. His biographer Percy Young has commented that if Elgar had been a German he would have realised the idea in the form of  but \"being an Englishman he conceived a work of this magnitude according to the prescriptions of oratorio\". The critic W. J. Turner wrote, \"Unlike The Dream of Gerontius, which is definitely Catholic, The Kingdom has no sectarian bias but is broadly Christian.\nElgar's ideas outgrew the confines of a single work: parts of The Kingdom were written before The Apostles, and Elgar conceived the two works as the first parts of a trilogy. The Kingdom is, in effect, its slow movement. The analyst Byron Adams has called it \"this most contemplative of Elgar's mature oratorios\" The projected third part, The Last Judgement, was never completed, and Elgar repurposed some of his sketches for it in other scores. The general conception of The Kingdom began to take shape as early as 1882, while Elgar was organist at St George's Church, Worcester. Themes sketched for his early choral works were used in The Apostles and The Kingdom. The music for the Lord's Prayer at the end of The Kingdom comes from a sketch-book of 1902 between drafts for \"Land of Hope and Glory\" and the Op. 45 part songs. Elgar's friend W. H. Reed wrote, \"The Kingdom followed on naturally from The Apostles, the same themes being used in carrying out the somewhat elastic  system of characterization, new themes being introduced and the working out of these themes being treated in accordance with his text\".\nPremiere\nThe composer conducted the first performance, which was given at Birmingham Town Hall on 3 October 1906, with the soloists Agnes Nicholls, Muriel Foster, John Coates and William Higley, the Birmingham Festival Chorus and Orchestra.\nThe dedication – like those of The Dream of Gerontius and The Apostles – is \"A. M. D. G.\"\nPerformers\nThe Kingdom is written for a large orchestra, of typical late Romantic proportions. The orchestration is for strings (all five sections of which, Elgar stipulates, \"should all be numerously represented\"), 3 flutes (3rd doubling piccolo), 2 oboes, cor anglais, 2 clarinets in B, bass clarinet in B, 2 bassoons, double bassoon, 4 horns in F, 3 trumpets, 3 trombones in B, tuba, 3 timpani, bass drum, cymbals, side drum, 2 harps and organ. There is a double chorus with semichorus, and four soloists representing: The Blessed Virgin (soprano), Mary Magdalene (contralto), St John (tenor), and St Peter (bass).\nSynopsis\nThe duration of the work is about 1 hour and 45 minutes. It is in five parts, and is preceded by a prelude. Each part is played without a break. Elgar specified that if a break were required in mid-work it should come between parts III and IV. Words were selected by the composer from the Acts of the Apostles, supplemented by material mainly from the Gospels.\n:I. In the Upper Room. The disciples meet and the new Apostle, Matthias, is chosen.\n:II. At the Beautiful Gate. The two Marys remember Jesus's actions in the temple.\n:III. Pentecost. The disciples are visited by the Holy Spirit and preach to the multitudes.\n:IV. The Sign of Healing. Peter and John heal the lame man and are imprisoned.\n:V. The Upper Room. Peter and John have been released; the disciples break bread and sing the Lord's Prayer.\nAs in Elgar's other mature oratorios, the Prelude introduces the main musical themes and sets the mood. The music is lyrical and mystical, with less narrative drive than in The Apostles. Among its best-known moments are the depiction of Pentecost, Mary's aria The sun goeth down, and the setting of the Lord's Prayer.\nMusical numbers\n*Prelude\nI. In the Upper Room\n*Chorus (The Disciples and the Holy Women) – Seek first the Kingdom.\n*Recit (Peter) – Peace be multiplied unto you.\n*Chorus (The Disciples and the Holy Women) – Remember the words of the Lord Jesus.\n*Recit (Peter) – He took bread.\n*Chorus (The Disciples and the Holy Women) – The true Vine.\n*Tutti  – Let them give thanks whom the Lord hath redeemed.\n*Recit (Peter)  – Men and brethren.\n*Chorus (The Disciples and the Holy Women) – Let his habitation be desolate.\n*Recit (Peter)  – Wherefore of these men which have companied with us.\n*Chorus (The Disciples)  – Thou. Lord, Which knowest the hearts of all men.\n*They gave forth their lots.\n*Soli – The Lord hath chosen.\n*Chorus  – O ye priests!\nII. At the Beautiful Gate\nThe Morn of Pentecost\n*Mary – The singers are before the altar; they make sweet melody.\n*Mary Magdalene – This man, lame from his mother's womb.\n*Mary – The blind and the lame came to Jesus.\n*Mary Magdalene – The service of the Lord is prepared.\nIII. Pentecost\nIn the Upper Room\n*Recit, Tenor – And when the day of Pentecost was fully come\n*Chorus (The Disciples) – When the great Lord will.\n*Mystic Chorus (Soprano and Contralto) – The Spirit of the Lord shall rest upon them.\n*Solo (John) – When the Comforter is come.\n*Solo (Peter) – And speak as moved by the Holy Spirit.\n*Mystic Chorus – I will pour forth of My Spirit.\n*Recit, Contralto – And suddenly there came from heaven a sound.\n*Chorus (The Disciples) – He Who walketh upon the wings of the wind.\n*Mystic Chorus – (The Lord put forth His hand.)\n*Recit, Contralto – And there were dwelling at Jerusalem.\nIV. The Sign of Healing\nAt the Beautiful Gate\n*Recit, Contralto – Then they that gladly received his word.\n*Recit, Contralto – The man that was lame, at the Beautiful Gate.\n*Solo (Peter) – Look on us.\n*Chorus (The People) – This is he which sat for alms.\n*Solo (Peter) – Ye men of Israel.\n*Solo (John – Unto you that fear His Name.\n*Duet (Peter and John) – Turn ye again, that your sins may be blotted out.\nThe Arrest\n*Recit, Contralto – And as they spake.\n*Recit, Contralto – It was now eventide.\n*Solo (Mary) – The sun goeth down.\nV. The Upper Room\nIn Fellowship\n*Chorus (The Disciples and the Holy Women) –  The voice of joy.\n*Recit (John) – The rulers asked.\n*Chorus (The Disciples and the Holy Women) – In none other is there salvation.\n*Recit (Peter) – And when they took knowledge of us.\n*Recit (John) – Finding nothing how they might punish us.\n*Chorus (The Disciples and the Holy Women) – Lord, Thou didst make the heaven.\nThe Breaking of Bread\n*Chorus (The Disciples and the Holy Women) – Thou, Almighty Lord.\n*Recit (Peter) – If any is holy.\n*Chorus (The Disciples) – Let him come.\n*Recit (John) – Give thanks; first for the Cup.\n*Chorus (The Disciples and the Holy Women) – We thank Thee.\n*Tutti – As this Broken Bread was grain scattered upon the mountains\nThe Prayer\n*Tutti – Our Father.\n*Solo (John) – Ye have received.\n*Tutti – Thou, O Lord, art our Father, our Redeemer.\nReputation\nAlthough most admirers of Elgar have preferred The Dream of Gerontius to The Apostles and The Kingdom, a strongly held minority view has been expressed by the conductor Sir Adrian Boult, who wrote in 1969:\nThe majority back Gerontius and would say it is a pity that he never reached those heights again. I am afraid I disagree. I think there is a great deal in The Kingdom that is more than a match for Gerontius, and I feel that it is a much more balanced work and throughout maintains a stream of glorious music whereas Gerontius has its ups and. downs. Perhaps I was prejudiced by hearing a great friend of Elgar's (who was very kind to me in my young days) jump down the throat of a young man who made this criticism: \"My dear boy, beside The Kingdom, Gerontius is the work of a raw amateur\".}}\nRecordings\nElgar recorded the prelude to The Kingdom with the BBC Symphony Orchestra in 1933 – one of his last recordings – but nothing else from the work, and a complete recording of the whole oratorio was not made until 1969, when Boult conducted it for HMV. Since then there have been four more sets of the work.\n{| class=\"wikitable plainrowheaders\" style=\"text-align: left; margin-right: 0;\"\n! scope=\"col\" |Conductor\n! scope=\"col\" |Orchestra\n! scope=\"col\" |Chorus\n! scope=\"col\" |Soloists\n! scope=\"col\" |Yes\n|-\n| Sir Adrian Boult\n| London Philharmonic Orchestra\n| London Philharmonic Choir\n| Margaret Price, Yvonne Minton, Alexander Young, John Shirley-Quirk\n| 1969\n|-\n| Leonard Slatkin\n| London Philharmonic Orchestra\n| London Philharmonic Choir\n| Yvonne Kenny, Alfreda Hodgson, Christopher Gillett, Benjamin Luxon\n| 1981\n|-\n| Richard Hickox\n| London Symphony Orchestra\n| London Symphony Chorus\n| Margaret Marshall, Felicity Palmer, Arthur Davies, David Wilson-Johnson\n| 1989\n|-\n| Sir Mark Elder\n| Hallé Orchestra\n| Hallé Choir\n| Claire Rutter, Susan Bickley, John Hudson, Iain Paterson\n| 2009\n|-\n| David Temple\n| London Mozart Players\n| Crouch End Festival Chorus\n| Francesca Chiejina, Sarah Connolly, Benjamin Hulett, Ashley Riches\n| 2025\n|}\n:Source: Naxos Music Library\nNotes, references and sources\nNotes\nReferences\nSources\n*\n*\n*\n*\n*\n*\nExternal links\n* [http://www.bbc.co.uk/radio3/classical/elgar/notes/note_kingdom.shtml The Kingdom (1901–06)], BBC website.\n* [http://www.bbc.co.uk/radio3/classical/elgar/notes/synopsis_kingdom.shtml The Kingdom: Synopsis], BBC website.\n*\n* [http://www.elgar.org/3kingdom.htm The Kingdom] on site from Elgar Society\n*"
    }
  ]
}