{
  "content": [
    {
      "type": "text",
      "text": "# The Great Martian War 1913–1917__disambig_1\n\n| writer               = Steve MaherStephen Sarossy\n| screenplay           =\n| story                =\n| director             = Mike Slee\n| starring             = Jock McLeodJoan GregsonIan DownieThomas Gough\n| narrated             = Mark Strong\n| theme_music_composer =\n| country              = Canada, United Kingdom\n| language             = English\n| num_episodes         =\n| producer             = Michael KotSteve MaherMike Slee\n| editor               =\n| cinematography       = Christopher Romeike\n| runtime              = 90 minutes\n| company              =\n| budget               =\n| network              = History\n| released             =\n}}\nThe Great Martian War 1913–1917 is a 2013 Canadian/UK made-for-television science fiction docudrama film, produced by Michael Kot, Steve Maher, and Mike Slee, and also directed by Slee. It unfolds in the style of an episode from the History TV Channel.\nOverview\nThe film as presented is an alternate history of World War I: the European Allies, and eventually America, fight Martian invaders instead of Germany and the Central Powers. Europe is on tenterhooks in the second decade of the 20th century. Everyone is expecting war between the European powers. Many references to real events in World War I are woven into the film's fictional narrative, including parallels to the conflict, such as trench warfare and the Christmas truce, and America's late entry into the war. The film also utilizes a surprising twist on the \"Spanish\" flu pandemic that killed more people than the conflict itself, which becomes the key development in ending the alien invasion.\nDescription\nThe film is based on the 1897 science fiction novel The War of the Worlds, by English author H. G. Wells, and includes both new and digitally altered film footage shot from World War I to establish the scope of the interplanetary conflict.\nHistorical Records\nIn June 1913, astronomers in London discover a bright meteor passing by the planet Mars, on a collision course with Earth. Two days later a massive explosion rocks the whole of Europe, the epicentre of which lies within Germany's Bohemian Forest. Initially accused of testing a super-weapon by the other nations of Europe, elements of the German Army are sent to investigate, only to disappear without a trace. Kaiser Wilhelm makes an urgent appeal to the world for military assistance in fighting what turns out to be a powerful, non-human invading force thought to be from Mars.\nAs the war unfolds, the European Allies engage monstrous Martian fighting machines, unaware that deep flaws exist in their military leadership's central battle strategy: the alien force sends thousands of scavenger drones over the battlefield every night, scouring every scrap of metal to be recycled into the construction of new fighting machines. The Allies' mass-wave tactics only serve to resupply the enemy with fresh metal. Across the Atlantic, US President Woodrow Wilson struggles to keep America out of the war while sending aid to the beleaguered European alliance. When a series of attacks on ships at sea is blamed on the Martians, politicians and the populace force President Wilson to resign. His replacement, Theodore Roosevelt, is restored to office and joins the European allies. Whether the ship attacks really were perpetuated by Martians, which had never been seen in the Gulf of Mexico and Western Atlantic, or were a False flag operation by the Allies is speculated upon but unanswered.\nFollowing an apparent attack on London by a single alien tripod, the Allies discover that the Martians are vulnerable to Glanders, a terrestrial bacteria endemic to horses. Now standing on the brink of total defeat by the invaders, the Allies engineer Glanders into a bioweapon despite the risk of triggering a pandemic. The weapon is released and kills the Martians in couple of weeks, winning the war. However, the disease mutates after coming into contact with the humans, resulting in millions more deaths in the following pandemic than had occurred during the war.\nThroughout the documentary, modern historians are viewed offering opposing views about the conflict's many controversies. They all disagree on an incendiary new discovery centered around the previously uncrackable \"Martian Code\", a vast century-old cache of Martian documents seized following the end of the war. These messages are warnings from the \"Martians\" themselves about the true culprit behind invasion: a liquid metal lifeform (which mankind names \"Victacite\") that entices other, intelligent species into appropriating its highly-adaptable technology. Integrating itself into all civilizations it finds, Victacite slowly causes its host species to rapidly advance technologically and expand the population until they become too numerous on their homeworld, at which point the host species will seek to colonize new worlds. Eventually Victacite will force humans to wage war on other worlds in order to spread its parasitic existence, ready to \"infect\" whichever alien species manages to defeat us in order to repeat the cycle again.\nMain cast\nReception\nOne film reviewer found the film gripping and \"not only fascinating to watch, but very realistic right to the very end\". Another reviewer commented that the film may be \"best described as an interesting curiosity\". According to a reviewer for Postmedia News, the film is \"a novelty, but an inventive and surprisingly engaging novelty\". Still another reviewer states, \"What an audacious, perfectly clever, and perfectly realized project. The utmost skill and craftsmanship have delivered this merging of faux archival-style (scratched, battered) footage (appearing as though from The Great War) with an endless CGI army of ruthless Titan alien machines. To my mind, the result was utterly awesome, and 'awesome' is not a word I throw around lightly. Indeed, the entire film seems authentic, and to have pulled it off so satisfactorily reflects uncommonly well on The Great Martian War’s creative team\".\nSee also\n* Worldwar series\nReferences\nExternal links\n*  at the [http://www.history.co.uk History Channel WebSite]\n*\n* [http://greatmartianwar.com/ \"The Great Martian War 1913–1917\" – GamePlay App]\n* [https://www.youtube.com/watch?v=b95Ge1w61YA \"The Great Martian War 1913–1917\" –  Trailers (00:15)]; [https://www.youtube.com/watch?v=PgZU6YxJ7b4 (01:01)]"
    }
  ]
}