{
  "content": [
    {
      "type": "text",
      "text": "# The Phantom Empire\n\n| producer       = Nat Levine\n| writer         =\n| starring       =\n| music          = Hugo Riesenfeld\n| cinematography =\n| editing        =\n| distributor    = Mascot Pictures\n| released       =\n| runtime        = 245 minutes (12 chapters)\n| country        = United States\n| language       = English\n| budget         = $75,000\n}}\nThe Phantom Empire is a 1935 American Western serial film directed by Otto Brower and B. Reeves Eason and starring Gene Autry, Frankie Darro, and Betsy King Ross. This 12-chapter Mascot Pictures serial combined the Western, musical and science-fiction genres. The duration of the first episode is 30 minutes, while that of the rest is about 20 minutes. The serial film is about a singing cowboy who stumbles upon an ancient subterranean civilization living beneath his own ranch that becomes corrupted by unscrupulous greedy speculators from the surface. In 1940, a 70-minute feature film edited from the serial was released under the titles Radio Ranch or Men with Steel Faces. This was Gene Autry's first starring role, playing himself as a singing cowboy. It is considered to be the first science-fiction Western.\nPlot\nGene Autry (Gene Autry) is a singing cowboy who runs Radio Ranch, a dude ranch from which he fulfils a contract to makes a daily live radio broadcast starting at 2:00 pm. Gene has two kid sidekicks, Frankie Baxter (Frankie Darro) and Betsy Baxter (Betsy King Ross), who lead a club, the Junior Thunder Riders, in which the kids play at being armored knights of an unknown civilization, the mysterious Thunder Riders who make a sound like thunder when they ride. The kids, dressing up in capes and water-bucket helmets, play at riding \"To the rescue!\" (their motto).\nA chance to become real heroes occurs when Betsy, Frankie, and Gene are kidnapped by the real Thunder Riders from the super-scientific underground empire of Murania, complete with towering buildings, robots, ray-guns, advanced television, elevator tubes that extend miles from the surface, and the icy, blonde, evil Queen Tika (played by Dorothy Christie). On the surface, criminals led by Professor Beetson (Frank Glendon) plan to invade Murania and seize its radium wealth, while in Murania, Lord Argo (Wheeler Oakman) plots to overthrow Queen Tika.\nThe inhabitants of Murania are the lost tribe of Mu, who went underground in the last glacial period 100,000 years ago, and now live in a fantastically advanced city 25,000 feet below the surface. They cannot now breathe the air at ground level and must wear oxygen masks. (Surface dwellers have no trouble breathing Muranian air.) The Thunder Guard emerges to the surface world from a cave with a huge rock door that swings up like a garage door. Both Muranians and Professor Beetson want to get rid of Autry, the latter so that he loses his radio contract and Radio Ranch is vacated.\nCast\n* Gene Autry as Gene Autry, singing cowboy at the Radio Ranch\n* Frankie Darro as Frankie Baxter, one of Gene's sidekicks\n* Betsy King Ross as Betsy Baxter, one of Gene's sidekicks\n* Dorothy Christy as Queen Tika, the evil queen of Murania\n* Wheeler Oakman as Lord Argo, the Muranian High Chancellor and leader of the rebels\n* Charles K. French as Mal\n* Warner Richmond as Rab\n* J. Frank Glendon as Professor Beetson, the villainous scientist after the land's radium deposits\n* Smiley Burnette as Oscar, comic relief\n* Peter Potter as Pete, comic relief\n* Edward Peil Sr. as Cooper\n* Jack Carlyle as Saunders\nProduction\nStory\nThe  idea for the plot came to writer Wallace MacDonald when he was under gas having a tooth extracted.\nFilming and budget\nThe Phantom Empire was filmed in late 1934. The film had an operating budget of US$75,000 (). The budget was originally reported to have been \"no more than\" US$100,000 ().\nFilming locations\n* Agoura Ranch, Agoura, California, USA\n* Bronson Canyon, Griffith Park, 4730 Crystal Springs Drive, Los Angeles, California, USA\n* Griffith Observatory, Griffith Park, 4730 Crystal Springs Drive, Los Angeles, California, USA\n* Iverson Ranch, 1 Iverson Lane, Chatsworth, Los Angeles, California, USA\n* Keystone Studios, 1712 Glendale Blvd., Silver Lake, Los Angeles, California, USA\nStuntwork\n* Ken Cooper\n* Richard Talmadge\n* Jack Jones\n* George Magrill\n* Wally West\nFrankie Darro and Betsy King Ross did their own stunt riding in this serial. Ross was an experienced rodeo performer and was billed as the \"World's Champion Trick Rider\".\nSoundtrack\n* \"Uncle Noah's Ark\" (Gene Autry, Smiley Burnette, Nick Manoloff) by Gene Autry and band (chapter 1)\n* \"That Silver-Haired Daddy of Mine\" (Gene Autry, Jimmy Long) by Gene Autry and band (chapter 1)\n* \"I'm Oscar, I'm Pete\" (Gene Autry, Smiley Burnette) by Gene Autry, Smiley Burnette, and William Moore (chapter 2)\n* \"No Need to Worry\" (Gene Autry, Smiley Burnette) by the Radio Rangers (chapter 4)\n* \"Uncle Henry\" (Gene Autry, Smiley Burnette) by Gene Autry (chapter 4)\n* \"I'm Getting a Moon's Eye View of the World\" (Gene Autry, Smiley Burnette) by Gene Autry (chapter 8)\n* \"My Cross Eyed Gal\" (Gene Autry, Jimmy Long) by the Radio Rangers (chapter 8)\n* \"Just Come On Back\" (Gene Autry, Smiley Burnette) by the Radio Rangers (chapter 8)\nChapter titles\n# \"The Singing Cowboy\"\n# \"The Thunder Riders\"\n# \"The Lightning Chamber\"\n# \"Phantom Broadcast\"\n# \"Beneath the Earth\"\n# \"Disaster from the Skies\"\n# \"From Death to Life\"\n# \"Jaws of Jeopardy\"\n# \"Prisoners of the Ray\"\n# \"The Rebellion\"\n# \"A Queen in Chains\"\n# \"The End of Murania\"\nReception\nOn , the first chapter of The Phantom Empire was released in theaters. The serial was a \"marked box office success\".\nCultural references\nThe 1979 television series Cliffhangers, which attempted to recreate the old movie serial feel by showing three serial chapters in each episode, included a serial titled \"The Secret Empire\", a pastiche of The Phantom Empire.  Events in the underground empire were shown in color, but events on the surface were \"in glorious black and white\". Stock footage from the serial and other serials was used in the animated series Muppet Babies.\nFred Olen Ray in 1988 filmed a movie with the same title about treasure hunters braving a cavern system populated by troglodytes and other subterranean hazards to finally encounter an underground lost civilization. The movie makes reference to the serial and was itself in the end credits planned to have sequels that never were produced.\nAlejandro Pérez Cervantes' short story collection, Murania, was inspired by the aesthetic of Murania and the lost continent of Mu as depicted in the film. It received the 2006 Julio Torri national award for short fiction in Mexico.\nThe web series The Sam Plenty Cavalcade of Action Show Plus Singing! was inspired by the serial.\nThe UK Channel 4 show Exploitica lampooned the serial, adding comedic sound effects, thought bubbles and captions to each episode.\nThe serial was a childhood favorite of comic strip writer Tom Batiuk, and in tribute has been frequently referenced in his strips Funky Winkerbean and Crankshaft, predominantly as the favorite film of Crankshaft character Jeff Murdoch. Most notably, one 2020 storyline in Funky saw Jeff and his grandson seeking refuge from a wildfire in the cave used for the film as the entrance to Murania, where they imagine being rescued by the Thunder Riders and taken into the city.\nSee also\n*Cliffhangers – \"The Secret Empire\"\n*The Mound by H. P. Lovecraft from a short description by Zealia Bishop — underground civilization fiction also set in the southwest USA; part of the Cthulhu Mythos\n*Richard Shaver— claimed to know of a civilization such as this\n*List of film serials\n*List of film serials by studio\nReferences\n;Notes\n;Citations\n;Bibliography\n*\n*\n*\n*\n*\nExternal links\n*\n*\n*  (serial)\n*  (69 minute version)\n* [http://216.75.63.68/space/serial/serials2/index.phtml Roaring Rockets: The Phantom Empire!]\n* [http://www.imagesjournal.com/issue04/infocus/phantomempire.htm \"The Phantom Empire,\" by Gary Johnson]\n* [https://web.archive.org/web/20060208181429/http://davidszondy.com/future/robot/phantomempire.htm Serial Robots: The Phantom Empire]\n* [http://movies2.nytimes.com/gst/movies/movie.html?v_id=37920 NY Times Review: The Phantom Empire]\n*\n* [https://tv.dieselpunkindustries.com/serials/phantom-empire/ Watch and Download the Entire Serial]"
    }
  ]
}