{
  "content": [
    {
      "type": "text",
      "text": "# The King of Fighters XV\n\n| producer = Yasuyuki Oda\n| director =\n| artist = Tomohiro Nakata\n| composer =\n| series = The King of Fighters\n| engine = Unreal Engine 4\n| released = February 17, 2022\n| genre = Fighting\n| modes = Single-player, multiplayer\n| platforms =\n}}\nis a 2022 fighting game developed by KOF Studio and published by SNK in Japan and Koch Media internationally for PlayStation 4, PlayStation 5, Windows, and Xbox Series X/S. It is the fifteenth main installment in the The King of Fighters series.  It uses the same fighting system from The King of Fighters XIV (2016) involving teams composed of three members who oppose other teams, but with more accessible changes, such as more useful Climax moves or parries.\nThe game was directed by KOF XIV staff member Kaito Soranaka with assistance from creative director Eisuke Ogura who also worked as an artist alongside Tomohiro Nakata, artist of The King of Fighters All Star (2018). It is the first game in the series created using Unreal Engine 4, and the first to implement GGPO rollback networking. Taking place after the events of KOF XIV, the narrative primarily revolves around two fighters with multiverse-related supernatural powers, Shun'ei and Isla, among other returning heroes facing revived threats caused by the recently revived Ash Crimson. While Ash's actions in The King of Fighters XIII (2010), resulted in the creation of a creature known as Verse that was defeated in the previous game, in this installment Shun'ei and Isla have been called to fight new possible threats related to Verse.\nThe game includes 39 characters, including two free bosses and several downloadable content characters released in several different seasons, and also includes several returning characters from KOF, Fatal Fury as well as another franchise, Samurai Shodown. King of Fighters XV generally received praise for its character roster, team-based gameplay, and smooth online performance, but criticism for its small story mode, complex tutorials, and small content for offline players.\nGameplay\n(left) using Shatter Strike against Iori Yagami.]]\nLike its predecessors, The King of Fighters XV uses a fighting game system involving teams composed of three fighters. Every team relies on these combatants in the order they want, facing multiple enemies until reaching the Story Mode's boss. The gameplay includes a parry system under the name Shatter Strike. It also reincorporates the common \"Max Mode\" system where fighters can use stronger techniques once energy bars are filled. Unlike in previous game from the KOF franchise, but now just like enhanced moves prior, characters can now use their strongest techniques, Climax, versions of special moves, with or without entering Max Mode. The game features a wide variety of online modes, including Ranked Match, Casual Match, Room Match, and Online Training. Besides fighting against AIs in the Story Mode, the player can fight a Boss Challenge Mode against two returning KOF bosses: Omega Rugal from ''The King of Fighters '95 and Goenitz from The King of Fighters '96.\nThe single button \"Rush\" from The King of Fighters XIV reappears and is updated to help newcomers perform combos and special moves easier. The Rush now has also been modified to help the player perform both a Super Move and Climax should be the bars be limited to only the former as in The King of Fighters XIV. Shatter Strike was designed mainly as a defensive system but it can be used offensively when making use of guard points. On a more critical analsys Destructoid compared Shatter Strike with a fully charged Focus Attack from Street Fighter IV. In XIV, combos from quick activation were the main way max mode was used so the gauge consumption was increased from 1 to 2 to prevent players from being overwhelmed. A neutral state in XIV was not seen often so in XV attack power and guard crush are increased when neutral is activated. Since Max Mode activations in neutral were almost nonexistent in King of Fighters XIV'', the developers are giving more incentive to players to not just use it as a combo extender.\nPlot\nThe story focuses on the next King of Fighters tournament held after the appearance and defeat of Verse. Following Antonov's early retirement, new tournament commissioner Anastasia sends out invitations to fighters to join the tournament; the mayhem caused by Verse's powers resurrects various long-thought deceased fighters from past tournaments as well. Chizuru Kagura gathers Kyo Kusanagi and Iori Yagami in order to look after the seal of the snake demon Orochi. Shun'ei, a teenager with mysterious powers resembling Verse's, enters the tournament again alongside Meitenkun and Benimaru Nikaido to better understand his powers, the Amplified Specters. During the tournament, they encounter a rival team led by a girl with similar powers to his own and also another Amp user, Isla. Isla is being mentored by a woman named Dolores who wishes for her and Shun'ei to stop the appearance of more Amp-related creatures like Verse, believing Ash Crimson's time-traveling in a previous tournament, which Dolores' disciple, Kukri confirms it to have caused their appearances and connected to distortions across the multiverse.\nDuring the finals, a new cutscene is given to each team revealing their needs to enter the tournament and become the champion. However, a new Amp creature born from Isla's Amp power, labeled as Re Verse manifests as the tournament progresses and targets the fighters, pulling them into another world. Following Re Verse's defeat, the mysterious goddess Otoma=Raga appears and attacks the teams. Upon Otoma=Raga's defeat, the fighters escape back to their world and are crowned the new King of Fighters champions, whereas Isla finally warms up with Shun'ei at the same time their respective Amps are fully under control, such as Shun'ei can finally take off his headphone safely. As confirmed by Kukri earlier, defeating Otoma=Raga and Re Verse does not erase the revived fighters’ existences once they survive the two entities’ rampages.\nCharacters\nThe King of Fighters XV launched with 39 playable fighters, grouped into 13 teams of three. Additional fighters were made available via seasons of paid downloadable content: Season 1 consists of 12 fighters grouped into four teams of three, while Season 2 consists of six individual fighters, with two additional fighters released separately later. Much like Samurai Shodown (2019) and SNK Heroines: Tag Team Frenzy, the DLC teams' involvements in the storyline are canon. The game features three non-playable bosses in the initial release, and two free playable DLC boss characters who are part of special boss challenges.\nNewcomers are marked in italics.\nBase Game Roster\nTeam Hero\n*Shun'ei\n*Meitenkun\n*Benimaru Nikaido\nTeam Sacred Treasures\n*Kyo Kusanagi\n*Iori Yagami\n*Chizuru Kagura\nTeam Fatal Fury\n*Terry Bogard\n*Andy Bogard\n*Joe Higashi\nTeam Orochi\n*Yashiro Nanakase\n*Shermie\n*Chris\nTeam Art of Fighting\n*Ryo Sakazaki\n*Robert Garcia\n*King\nTeam Ikari\n*Leona Heidern\n*Ralf Jones\n*Clark Still\nTeam Secret Agent\n*Blue Mary\n*Vanessa\n*Luong\nTeam Super Heroine\n*Athena Asamiya\n*Mai Shiranui\n*Yuri Sakazaki\nTeam G.A.W.\n*Antonov\n*Ramón\n*The King of Dinosaurs\nTeam Rival\n*Isla\n*Heidern\n*Dolores\nTeam K\n*K'\n*Maxima\n*Whip\nTeam Krohnen\n*Krohnen McDougall\n*Kula Diamond\n*Ángel\nTeam Ash\n*Ash Crimson\n*Elisabeth Blanctorche\n*Kukri\nBosses\n*Re Verse (Sub-Boss)\n*OtomaRaga (Final Boss)\n*Omega Rugal\n*Goenitz\nDLC Characters\nTeam Garou\n*Rock Howard\n*B. Jenet\n*Gato\nTeam South Town\n*Geese Howard\n*Billy Kane\n*Ryuji Yamazaki\nTeam Awakened Orochi\n*Orochi Yashiro\n*Orochi Shermie\n*Orochi Chris\nTeam Samurai\n*Haohmaru\n*Nakoruru\n*Darli Dagger\nSingle Entries\n*Shingo Yabuki\n*Kim Kaphwan\n*Sylvie Paula Paula\n*Najd\n*Duo Lon\n*Hinako Shijo\n*Mature\n*Vice\nDevelopment\nDue to positive response to the marketing of The King of Fighters XIV, director Yasuyuki Oda said in August 2017 The King of Fighters XV was possible, but the company SNK also wanted to focus on other franchises. Oda instead worked on a spin-off, SNK Heroines: Tag Team Frenzy, a female character-driven fighting game and a spiritual sequel of ''SNK Gals' Fighters. In December 2018, SNK revealed the company was working on The King of Fighters XV, aiming to release it during 2020. However, the Covid-19 pandemic caused major delays in the making of the game. They decided to make XV while they were still working on XIV but only started development after Samurai Shodown'' was completed. The game's creative director is Eisuke Ogura, who has previously worked as an artist on the series, beginning with The King of Fighters 2001. Most notably, he served as the main illustrator for The King of Fighters XIII and XIV. The director of King of Fighters XIV, Yasuyuki Oda, serves as the producer for the title. Oda claimed the team had to \"start from zero\" as they avoided using assets from the previous installments. The game director was Kaito Soranka who had joined SNK in 2014 during development of KOFXIV. Oda referred to the game as an \"all-star game\". He wanted players to get attached to the game mechanics. The Unreal Engine also allowed to improve the gameplay's speed. The objective was to smoothly transition players into a new game and build a system where fans could have fun performing combos.Wb While SNK tried implementing new types of new modes in ''The King of Fighters '99 through the assistant character Strike or the tag team system conceived in The King of Fighters 2003, the aim of the team was to stay true to the original system they always used since their first game, The King of Fighters '94, and improved on it. The popular usage of Cross-Engine also decided in SNK using it to appeal to the gamers regardless of where they are playing it.\nFeeling the previous title had outdated graphics for a 2016 game, SNK chairman Zhihui Ge said that XV'' will use the Unreal Engine 4 to provide a better presentation.  At Evo 2019, SNK announced that the game was in development. Thanks to the Unreal Engine, the team could create more cinematic cutscenes during rivals' clashes than in the previous games where they just moved the fighters. The Unreal Engine also allowed the characters to be given more facial expressions when interacting. Additionally, the Unreal Engine allowed to improve the visuals of the Climax techniques the characters can perform like Kyo's who fires a projectile, punches the enemy with his flames and then covers them with the Kusanagi Crest.\nOriginally, the game was set to be released in 2020. However, in late December, Oda and Ogura revealed the game would see release in 2021 with more content yet to be explored. During these announcements, the two developers revealed sketches of Shun'ei, Kyo Kusanagi and Benimaru Nikaido, with the former being set to be the protagonist of the new game. Ogura called it \"our most ambitious KOF yet\". An official trailer was set for January 7, 2021 but was delayed for unknown reasons alongside the downloadable content for  Samurai Shodown. The trailer was, instead, revealed the next day and included game footage of Kyo, Shun'ei, Benimaru, K', Mai Shiranui and Leona Heidern, while also confirming a 2021 release. The team focused on improving the visuals and increasing the fast-paced gameplay by adding new elements. The game was developed for PC and ninth generation of consoles, and supports ray tracing on these platforms. The PlayStation 4 version was also created with fans of The King of Fighters XIV in mind: SNK wanted to release the game while the console was still popular and expects this version to be used during major tournaments. Much attention to the character lineup was given due to the worldwide popularity of the series. In total, around 400 people were involved with game's development.\nIn February 2021, Oda announced on his personal Twitter account that the team is working on implementing rollback-based netcode for the game. The team aimed to improve the gameplay and graphics while also providing a more interesting story than the one from XIV. SNK later confirmed that they were using GGPO for their rollback implementation.\nIn promoting the title, anime director Masami Ōbari (who previously worked on Fatal Fury: The Motion Picture and 1995 Technōs' Neo Geo fighting game title Voltage Fighter Gowcaizer along with the OVA adaptation) created and directed a short anime based on the series, with his animation studio, G-1Neo, producing the short anime. It would serve as the game's special movie. Yusuke Takeda and Hirotoshi Takaya have also worked on the short. In an interview with Famitsu, Ōbari has stated that he wanted this anime to be his best work yet, and that his team worked closely with SNK on the character design to make sure it has feature film level of detail put into every frame of animation. The song \"Now or Never\" by Steven McNair plays during the short, and is also used as the main theme of the game. Since the game takes after KOFXIV, the music was made to feel like the previous installment's while focusing that each theme represents the character's personality.\nCast and scenario\nFor SNK it took half a year to decide the story, with all of it written by Akihiko Ureshino. The decision to revive characters killed off in previous KOF games was made during XIVs development and was based on XIIIs themes of energies connecting the past to the present through space and time and Oda wondering how that would affect things in the future. The deceased characters returning for XV were chosen based on fan requests and the aim of the roster was for it to have a 'fresh and festive feel'. They feel like the gathering of the KOF Heroes as well as the return of Team Sacred Treasures and Team Orochi helped them achieve this feeling. They brought back Clemence Bellamy, the story mode announcer from XIV, to appeal to the \"tournament-likeness\" of KOF and acknowledge that he was well received.\nPrevious KOF heroes Kyo, K' and Ash Crimson have been more independent protagonists, but Shun'ei is a little bit younger than them and is more of a mentally unstable character. Oda has compared Shun'ei to Rock Howard, and says that his story could end up being as fun to write as Rock's. Oda feels that unlike the older fighting game protagonists, Shun'ei has a one-of-a-kind world view, and his values change as he grows older. While Kyo and Iori are always written as rivals, Ureshino remarks that Kyo's existence is importance for the latter as he believes, should Kyo ever die, Iori will not find his existence meaningful, making them an important relationship. In regards to Isla, SNK wanted to introduce a rival to Shun'ei, so they let the design team to come up with whatever they could think of. The resulting draft had an impact on Oda, as it is very close to the final result, but he was initially worried about putting a character with that type of design into a fighting game. According to Eisuke Ogura, Isla is \"not very much into actual fighting\", and has a special and abnormal dance-like style. Despite Shun'ei being the protagonist the story will explore Isla's character as well. Ogura is in charge of the whole of KOF XV, including not only the characters but also the interface and 3D modeling, and Naakta am mainly in charge of illustrations and character design. Nakata's works were approved by Ogura. Ogura wanted to use Terry Bogard as part of Shun'ei's Hero Team because he is a disciple of Tung, just like newcomers Meitenkun and Shun’ei. He thought he would be in the best position to watch over them. However, in the end we chose Benimaru Nikaido as a proposal from fellow busy character Kyo Kusanagi, as Benimaru is just good enough to take care of others whereas Kyo was requested by fellow fighter Chizuru Kagura join her team. In the end, Ogura was glad with this decision.\nCharacter design is being handled by Tomohiro Nakata, who is also working on The King of Fighters All Star. Tomohiro Nakata tried staying faithful to previous illustrators' works. The designs for Isla and Dolores were done by him and Ogura until halfway through, and then Saji, a designer for the Samurai Shodown reboot,  all together. It got pretty tense, so they got Saji to help us out as we went along. They were given text about Isla's background and Dolores' character settings, and thus made sure that these were clear at a glance. For Isla, we were conscious of giving her a street feel, like she is painted with spray paint, and for Dolores, we were conscious of giving her an ethnic feel with the patterns on her shoulders and clothes. Many returning characters received cosmetic changes. For example, Kyo Kusanagi was altered to overall look closer to his earlier appearances in the series, but different in other parts of his design like his jacket and gloves. Ogura said that while there are several characters like Athena Asamiya and Benimaru who are often revised, there are also fighters he cannot see without their unique outfits, specifically pointing Mai Shiranui. Ash Crimson and the Orochi followers were brought back due to their fame in the fandom. Meanwhile, Kyo's girlfriend Yuki was brought back for as Ureshino realized that their relationship stayed pure and faithful to the point he considers them a married couple.\nMeanwhile, the character of Krohnen has been noted to have multiple similarities with K9999 from The King of Fighters 2001 and The King of Fighters 2002 due to his similarities with the character of Tetsuo from the manga Akira and had to be removed from the franchise based on copyright issues. Although SNK did not confirm his identity, artist Hiroaki was more open about it, calling him the revival of K9999. Among other characters, the previous subboss, Antonov, became a playable character as a regular member of the cast. Oda stated that he was further changed based on the team's idea in regards of a manager. The series' official website was updated with story prologues during development of the game. Although the game gave closure to Shun'ei's character arc, SNK is not satisfied with the result, believing they could still focus on his role again.\nMusic\nThe sound of this work was created mainly by sound director Hideki Asanaka, sound designer Minori Sasaki, and Makiko Hino, and the \"Fateful Battle\" BGM introduced in XIV was also continued to be used. Asanaka explained that all the sound staff had a sense of the KOF feel, even without saying it out loud, and that he personally wanted players to feel that it was a sequel to KOF XIV. Because the game needs to be in shape before music can be produced, the sound team joined the development later than other departments, and by the time they joined, the team composition had already been decided. Asanaka pointed out that the problem was that Kyo and Iori, who had been rivals until now, were teamed up as the \"Three Sacred Treasures\" team, and as a result, they could no longer use either of their theme songs, and revealed that they created a new song, \"Fictitious or Real,\" to express the three of them, including Chizuru.\nOn the other hand, the rival team wanted to bring Isla's image to the forefront, so after discussing it with the planning staff, \"Time for revolution It's our generation\" was created. According to Asanaka, the song titles are given by the composer, and while each staff member has a different understanding of the titles, many staff members want to follow SNK's tradition of unique song titles. For example, when Asanaka asked the composer to create the theme song for the battle between Shun'ei and Meiten-kun, \"Sobagarakura\", he asked for a buckwheat husk pillow as a reference to the pillow that Meiten-kun has, and he was surprised when that was adopted as the song title. Asanaka himself says that he often names his characters themes after considering their hidden side, and for example, in the case of the Kronen team's \"Liberty\", he said that he imagined the freedom that they had seized.\nRelease and updates\nIn June 2021, SNK announced that the game would be delayed to the first quarter of 2022, due to rising cases of COVID-19 in Japan. Youchiro Soeda worked from his house due to the COVID-19 pandemic, so he drew storyboards that went on to become cinematics. In July 2021, SNK announced that the game would be released on PlayStation 4, PlayStation 5, Windows, and Xbox Series X/S via the Microsoft Store, Epic Games Store and Steam. The game's international release is handled by the Embracer Group's Koch Media. A demo became available in Tokyo Game Show 2021 featuring a total of eight playable characters.\nDownloadable content for the game include Terry Bogard's design from Garou: Mark of the Wolves and Leona Heidern's classic look from ''The King of Fighters '96 to The King of Fighters 2003''. Other releases of the game include a two disc soundtrack and a 119-page artbook. Oda claims the game is being developed in order to be enjoyed for years after its release. As such, additional characters were added as downloadable content, with four teams released during 2022 as part of a season pass. The first, Garou Team, was released on March 17 for most platforms, but was delayed until the next day on Steam. In addition, a free update on April 14 added Omega Rugal as a playable character to the game, and introduced the new Boss Challenge mode. Players who beat the stronger boss version of Rugal are rewarded with music, alternate costume, and a new stage. Rugal's popularity has continued even to his appearance in The King of Fighters XV, with Nakata surprised by how acclaimed the decision to include Rugal was. The second, South Town Team was released on May 16, along with music from KOF Neowave in a DJ Station Update. The third, Awakened Orochi Team, composed of powered up versions of Chris, Shermie and Yashiro was released on August 8. The fourth, Samurai Team was released on October 4. Six additional characters were also released as paid DLC throughout 2023 as part of a second season pass, along with a patch adding cross-platform play to all platforms and a second Boss Challenge in the form of Goenitz, who, like Omega Rugal, sports another unlockable outfit should he be defeated. Two additional characters were released in December 2024.PS4: 80/100PS5: 79/100XSXS: 79/100\n| OC = 82% recommend\n| Destruct = 8/10\n| Fam = 32/40\n| GSpot = 7/10\n| HCG = 3.5/5\n| HC = 86/100\n| IGN = 8/10\n| JXV = 15/20\n| MS = 8/10\n| PCM = 4.0/5\n| PSQ =\n| SN = 8/10\n| TGMIt = 8/10\n| VG247 =\n}}\nThe King of Fighters XV received \"generally favorable\" reviews, with a better score than the predecessor, according to review aggregator Metacritic. OpenCritic determined that 82% of critics recommend the game.\nVG247 gave it a perfect score, praising how far more expanded the story mode became in comparison to its previous installment as well as the more accessible combos. Destructoid enjoyed its fighting action, its large roster, improved visuals, and revamped online options, finding them highly complex while still praising the accessible Rush Mode. IGN praised the game's character models, rollback netcode, and roster. GameSpot praised the distinct playstyles, team-based gameplay, large roster, new modes, and the online play. Hardcore Gamer considered the story mode pretty much an arcade and that the narrative is not the best part of the game when compared to other better implemented parts. HobbyConsolas acclaimed the visuals to the point of describing them as \"the franchise at its finest\", even if the endings given for each team for the story mode do not use cinematic scenes - unlike the story mode's rival fights or time outs against the bosses. Meristation said there were not many notable improvements in gameplay and has a cast of characters which could come across as divisive especially since by the time of the review it was claimed by the developers there would be more characters but as paid DLC. Nevertheless, the reviewer praised the rollback netcode.\nCritics were still divided on the overall main content when compared to the previous game. IGN heavily criticized the lack of content, insubstantial tutorialization, reused six year-old animations, and called its story mode \"utterly bare bones.\" When it came to the visuals though, IGN still found it superior to the issues presented in KOFXIV. Shacknews similarly lauded the visual redesign, netcode, training modes, gameplay mechanics, music, and existing roster while panning its inaccessibility, overpowered mechanics, and the absence of major characters in the roster. GameSpot criticized bad AI and the lack of substantial iteration over The King of Fighters XIV. PC Magazine lamented the lack of crossplay and the lack of proper training modes to newcomers who want to perform proper combos rather than relying on the simple moves. Meristation criticized the story mode for the poorly developed bosses and anime-like cutscenes but still praised the visual improvement. Destructoid still believes KOFXV employs the best roster in the entire series especially thanks to the new visuals developed. Despite liking the gallery mode employed in the game, HobbyConsolas lamented KOFXV does not present the same concept artworks from previous artworks KOFXIV had easy access to.\nThe DLC was generally praised for bringing back Omega Rugal, famous for his high difficulty to defeat, as well as the Garou: Mark of the Wolves team, especially its rebalanced lead Rock Howard. Though the return of Geese was praised, his status of alive within the KOF franchise bothered The Gamer as he became one of the several fighting game characters who never die despite his fate in Real Bout Fatal Fury.\nProducer Yasuyuki Oda believes that the players' response to the game was overwhelmingly positive, which allowed them to properly work on early issues such as the online play.\nSales and other response\nThe PlayStation 4 version of KoF XV was the 8th bestselling retail game during its first week of release in Japan, with 9,062 physical copies being sold. The PlayStation 5 version sold 2,414 physical copies in Japan throughout the same week, making it the 22nd bestselling retail game of the week in the country.\nDuring the 26th Annual D.I.C.E. Awards, the Academy of Interactive Arts & Sciences nominated The King of Fighters XV for Fighting Game of the Year. The characters also had a crossover appearance in Another Eden. ONE37pm listed it as the 20th best SNK game of all time, praising its faithfulness to the franchise and improvement to the gameplay. PCMag regarded it as one of the best fighting games from 2024. GameSpot also regarded the game as one of the best fighting games from 2024.\nReferences\nNotes\nExternal links\n*"
    }
  ]
}