{
  "content": [
    {
      "type": "text",
      "text": "# The Damnation of Theron Ware\n\nThe Damnation of Theron Ware (first published in England as Illumination) is an 1896 novel by American author Harold Frederic. Set in the fictional town of Octavius in upstate New York, the novel presents a portrait of late 19th-century provincial United States, the religious life of its ethnic groups, and its intellectual and artistic culture. It is written in a realistic style. According to Publishers Weekly, it was the fifth-best-selling book in the United States in 1896.\nPlot summary\nTheron Ware is a promising young Methodist pastor recently assigned to a congregation in a small fictional town called Octavius in the Adirondack Mountains, which Frederic modeled after Utica, New York. His education has been limited and his experiences limited to church society and his strict enforcement of its norms.\nTheron has a number of experiences that cause him to begin to question the Methodist religion, his role as a minister and the existence of God. His \"illumination\" consists of his awakening to new intellectual and artistic experiences embodied by several of his new acquaintances including the town's Catholic priest who introduces him to the latest Biblical scholarship; a local man of science, who eschews religion and advocates for Darwin; and a local Irish Catholic girl with musical talent and artistic pretensions, with whom Theron becomes infatuated.\nIn the end, these three characters grow disappointed in Theron, who initially represented an interesting social specimen but whose emergence from naivete and disparagement of his congregation disappoint them.\nA parallel concern is the role of women in this society, with model provided by Theron's wife, the musician-aesthete, and a church fundraiser who charms Theron with a commonsense approach to religious affairs. Having lost his vocation and his new friends, Theron departs for Seattle, where he imagines he might use his oratorical skills to enter politics.\nComposition and publication\nFrederic made his living as a journalist. He wrote Theron Ware while employed by the New York Times as its London correspondent. Though he authored several novels, it is his \"only genuinely notable work of fiction\".\nFirst published in 1896 in the UK as Illumination and in the US as The Damnation of Theron Ware, it received a positive critical reception and sold well. A review in the Chicago Tribune said that \"It is a book which every one must read who wishes to hold his own in popular literary discussions\".  It was republished in 1924 and then reprinted in 1960 by Harvard University Press.\nLater references\nJames Blish used \"Theron Ware\" as the name of a black magician in his novel Black Easter (1968).\nJonathon Ward adapted Frederic's novel for the stage, requiring a cast of 13 using double casting. For a title he chose The Damnation and Illumination of Theron Ware.\nIn Main Street by Sinclair Lewis, Carol Kendicott and Vida Sherwin discuss it. Carol was \"re-reading\" it and asks Vida if she knows it. \"Yes. It was clever. But hard. Man wanted to tear down, not build up. Cynical. Oh, I do hope I'm not a sentimentalist. But I can't see any use in this high-art stuff that doesn't encourage us day-laborers to plod on.\" In turn, F. Scott Fitzgerald wrote in a letter to Lewis that Main Street had \"displaced Theron Ware in my favor as the best American novel.”\nSee also\n* The Way of All Flesh by Samuel Butler\n* Elmer Gantry by Sinclair Lewis\nReferences\n;Additional sources\n*\n*\n*\n*\n*\nExternal links\n*\n* [https://www.gutenberg.org/ebooks/133 The Damnation of Theron Ware], text and HTML, via Project Gutenberg.\n* [https://archive.org/search.php?query=%28title%3Aillumination%20OR%20title%3Adamnation%29%20AND%20creator%3AFrederic%20Harold%20AND%20-contributor%3Agutenberg%20AND%20mediatype%3Atexts The Damnation of Theron Ware], scanned books, via Internet Archive.\n*\n*[http://helios.acomp.usf.edu/~rrogers/index.html \"A Study Guide with Annotated Bibliography\"], by Robin Taylor Rogers"
    }
  ]
}