{
  "content": [
    {
      "type": "text",
      "text": "# The Emperor's New Clothes (song)\n\n| venue      =\n| genre      =\n* Alternative pop\n* rock\n| length        =\n* 5:16 (album version)\n* 4:16 (7-inch version)\n| label      =\n* Ensign\n* Chrysalis\n| writer     = Sinéad O'Connor\n| producer   = Sinéad O'Connor\n| prev_title = Nothing Compares 2 U\n| prev_year  = 1990\n| next_title = Three Babies\n| next_year  = 1990\n| misc       = }}\n}}\n\"'''The Emperor's New Clothes'''\" is a song written and recorded by Irish singer-songwriter Sinéad O'Connor for her second studio album, ''I Do Not Want What I Haven't Got'' (1990). The song was released as the album's second single on 5 June 1990 by Ensign and Chrysalis Records and reached number three in Canada, number five in Ireland, and the top 20 in Australia, Italy and Switzerland. In the United States, the song topped the Billboard Modern Rock Tracks chart for a week. Its music video was directed by John Maybury.\nComposition\nLyrically, the song is about personal tribulations amid the oppression of the world around her, while she sings: I will live by my own policies/I will sleep with a clear conscience.\nCritical reception\nJodi Cleesattle from American Eagle felt that \"The Emperor's New Clothes\" is \"the album's closest thing to a typical rock song\", and \"an up-front autobiographical song with even, somewhat gritty vocals and strong backing on both electric and acoustic guitars.\" Bill Coleman from Billboard described it as a \"jangly\", \"clever, guitar-laced rocker [which] is a fine choice as a follow-up\". He also stated that it \"should confirm O'Connor's status as a viable pop radio star.\" Tom Moon from Knight-Ridder declared it as a \"show-stopping moment\" and a \"bitter what-I-learned-on-the-road song\".\nSimon Reynolds from Melody Maker felt that \"this shrill statement of independence (so radically minimalist it doesn't have a tune)\", \"could be directed either at a male lover or at a public that keeps foisting their expectations on her slight shoulders.\" Pan-European magazine Music & Media viewed it as \"hard-hitting pop\". David Giles from Music Week remarked that it's \"a rockier track\", more like \"Mandinka\" than \"Nothing Compares 2 U\", \"though without any of the former's quirkiness.\" William Shaw from Smash Hits named it \"the most confessional record ever\", describing it as \"goose-pimplingly honest\".\nRetrospective response\nIn a 2020 retrospective review, Matthew Hocter from Albumism said that the song \"shows a conviction that is part anger and part middle finger to the never-ending judgement the singer faced at the time with her star sky rocketing, scrutiny around her Catholic faith, and her role as a newly single mother.\" AllMusic editor Stephen Thomas Erlewine described it as one of several \"moments of brilliance\" in his review of the compilation album So Far... The Best Of. In 1998, David Quantick from NME wrote that it is a song \"very heavy on specifics and is full of not very obscure lines like. ''He thinks I just became famous and that's what messed me up'' and the splendidly un-rock 'n' roll You know how it is/And how a pregnancy can change you.\"\nThe lyric It seems like years since you held the baby/ While I wrecked the bedroom, according to Mark Richardson from Pitchfork in 2009, \"is delivered with a muted lilt, O'Connor's voice bright and possibly a little hopeful, confident in her strength despite the weight of the past\". In a 2015 review, Pop Rescue wrote that the song itself is \"a rockier song\" than the others on the album, adding that \"it really has a great rhythm and shows that Sinéad is equally at home of these harder pop rock songs. This is a brilliant track!\"\nTrack listing\n* US CD single\n# \"The Emperor's New Clothes\" (LP Version) – 5:16\n# \"The Emperor's New Clothes\" (Main Mix) – 4:37\n# \"What Do You Want?\" – 2:58\n# \"Mandinka\" (Jake's Remix) – 5:58\nPersonnel\n* Sinéad O'Connor – vocals, songwriter, producer, acoustic guitar\n* John Reynolds – drums\n* Andy Rourke – bass\n* Marco Pirroni – electric guitar\n* Chris Birkett – engineering\nCharts\nWeekly charts\n{|class=\"wikitable sortable plainrowheaders\" style=\"text-align:center\"\n!Chart (1990)\n!Peakposition\n|-\n!scope=\"row\"|Argentina (CAPIF)\n|1\n|-\n|-\n|-\n|-\n|-\n!scope=\"row\"|Europe (Eurochart Hot 100)\n|56\n|-\n|-\n!scope=\"row\"|Italy (Musica e dischi)\n|15\n|-\n|-\n|-\n|-\n|-\n|-\n|-\n|-\n|-\n! scope=\"row\" |Quebec (ADISQ)\n|align=\"center\"|5\n|}\nYear-end charts\n{|class=\"wikitable plainrowheaders\" style=\"text-align:center\"\n!Chart (1990)\n!Position\n|-\n!scope=\"row\"|Canada Top Singles (RPM)\n|42\n|-\n!scope=\"row\"|US Modern Rock Tracks (Billboard)\n|5\n|}\nRelease history\n{|class=\"wikitable plainrowheaders\"\n!scope=\"col\"|Region\n!scope=\"col\"|Date\n!scope=\"col\"|Format(s)\n!scope=\"col\"|Label(s)\n!scope=\"col\"|\n|-\n!scope=\"row\"|United States\n|5 June 1990\n|\n|rowspan=\"4\"|\n|\n|-\n!scope=\"row\" rowspan=\"3\"|United Kingdom\n|9 July 1990\n|7-inch vinyl\n|\n|-\n|16 July 1990\n|12-inch vinyl\n|\n|-\n|rowspan=\"2\"|30 July 1990\n|\n|\n|-\n!scope=\"row\"|Australia\n|\n|\n|\n|-\n!scope=\"row\"|Japan\n|24 August 1990\n|CD\n|\n|\n|}\nReferences"
    }
  ]
}