{
  "content": [
    {
      "type": "text",
      "text": "# The Revolutionary (1970 film)\n\n| music          = Michael Small\n| cinematography = Brian Probyn\n| editing        = Henry Richardson\n| studio         =\n| distributor    = United Artists\n| released       =\n| runtime        = 100 minutes\n| country        = United States\n| language       = English\n| budget         =\n| gross          =\n}}\nThe Revolutionary is a 1970 American political drama film directed by Paul Williams.  The screenplay was written by Hans Koning (credited as Hans Koningsberger), based on his novel of the same name.  It was the film debut for actor Jeffrey Jones.\nPlot\nIn a placeless locale much like the United States in an unspecified time much like the late 1960s,  a university student called \"A\" becomes increasingly radicalized as he believes the campus leftist organization of which he is a member is not militant enough. The dean of the university suspends him for his political activities and his girlfriend Anne dumps him. He joins a Marxist group headed by Despard, a working class factory worker who is fomenting a general strike. The general strike fails and A goes underground as government agents crackdown on radicals.\nLosing his university status, he is drafted by the army and willingly allows himself to be inducted. He deserts when his unit is mobilized to suppress a workers' strike, finding sanctuary with Helen, a young bourgeois woman, hiding in a greenhouse. \"A\" is left adrift when Despard, under Party orders, refuses to mobilize his group to take action. Meeting the radical Leonard II at a bar in the company of Despard, \"A\" allows himself to be drawn into Leonard II's schemes, which include liberating a pawn shop and then assassinating the judge who will oversee the trial of the factory workers. His part in the conspiracy to kill the judge is to detonate a second bomb in case Leonard II's bomb does not explode. After the judge has sentenced several convicted strikers, Leonard's bomb malfunctions, and \"A\" is left holding the bomb and facing the judge.\nCast\n* Jon Voight as A\n* Seymour Cassel as Leonard II\n* Robert Duvall as Despard\n* Jennifer Salt as Helen\n* Collin Wilcox as Ann\n* Alan Tilvern as Sid\n* Lionel Murton as Professor\nSee also\n* List of American films of 1970\nReferences\nExternal links\n*"
    }
  ]
}