{
  "content": [
    {
      "type": "text",
      "text": "# The Grand Pecking Order\n\nThe Grand Pecking Order is the first album by American rock band Oysterhead, released on October 2, 2001.  The album was recorded in guitarist Trey Anastasio's Barn recording studio. Oysterhead was intended to be a single performance, but the project spawned this album and a mini-tour in support of the album.\nMany of the songs from that first performance are on the album, including \"Little Faces\" (a reworked version of \"I Am Oysterhead\"), \"Mr. Oysterhead,\" \"Rubberneck Lions,\" \"Pseudo Suicide,\" and \"Owner of the World.\" The song \"Oz is Ever Floating\" refers to the album's recording engineer, Oz Fritz, and his beliefs in psychoanalyst Dr. John C. Lilly. The song \"Birthday Boys\" is about the temporally proximate birthdays of Claypool (September 29) and Anastasio (September 30) while in Las Vegas in 2000. The song \"Radon Balloon\" would appear as a reworked instrumental version on Anastasio's self-titled album as \"Ray Dawn Balloon.\"  The song \"Wield the Spade\" was based on a speech by Romania's final communist leader, Nicolae Ceauşescu.\nEventually, the release of this album was supported by a brief tour of North America.\nReception\n|rev2 = Pitchfork Media\n|rev2score = (6/10)\n|rev3 = Rolling Stone\n|rev3score =\n}}\nAllmusic praised the album, remarking, \"It would be a difficult task to even find three musicians with voices as uniquely dissimilar as those of Trey Anastasio, Les Claypool, and Stewart Copeland, much less attempt to effectively fuse them together within the same band – and yet, this is precisely what Oysterhead manages to pull off on their debut album.\" They clarified that \"the characteristic trademarks of each member are still firmly in place – Anastasio's fluid guitar passages, Claypool's monstrous low-end bass tone, and Copeland's deft hi-hat and cymbal work – but unlike many albums by previous supergroups[...] the musicians seem to be carefully listening and playing off of one another at all times – and enjoying themselves doing so.\"\nTrack listing\nAll songs, unless otherwise noted, are music: Trey Anastasio, Les Claypool, and Stewart Copeland; lyrics: Anastasio and Claypool.\nPersonnel\n*Trey Anastasio - guitar, lead and backing vocals\n*Les Claypool - bass, lead and backing vocals\n*Stewart Copeland - drums, miscellaneous percussion, spoken word on \"Wield the Spade\"\nCredits\n*Mixed by Toby Wright\n*Recorded by Oz Fritz (see also TapeOp #75 Oz Fritz interviewed by Eli Crews)\n*Layout and Design Zoltron\n*Cover painting and illustrations: Tim Slowinski\n*Photography: Danny Clinch\nChart performance\n*No. 41 on the Billboard 200 albums chart\nReferences\nExternal links\n*[https://web.archive.org/web/20050826035012/http://www.oysterhead.com/ Oysterhead's official website]"
    }
  ]
}