{
  "content": [
    {
      "type": "text",
      "text": "# The Song of the Chinese Revolution\n\n| country        = China\n| language       = Mandarin\n}}\nThe Song of the Chinese Revolution, also rendered in English as The Laud for the Chinese Revolution (), is a 1984 Chinese film directed by the People's Liberation Army (PLA) Movie Studio (the August First Film Studio), which depicts the history of China from 1840 (the Opium War) to 1984 to celebrate the 35th anniversary of the founding of the People's Republic of China (PRC) and with a particular focus on the Chinese Communist Party (CCP).\nThe film is considered the second grand song-and-dance epic of the PRC with the support of the central government, following The East Is Red. It uses The East is Red as its model, but revises the narrative to include the roles of previously omitted revolutionary leaders and with greater emphasis on personal experiences, such as the pathos of the sacrifices made by women and children.\nDevelopment\nThe Song of the Chinese Revolution is inspired by and modeled on The East is Red. It was also inspired in by the North Korean production The Song of Glory, which Deng Xiaoping and Hu Yaobang saw during their 1982 visit to North Korea. Deng described The Song of Glory as \"a vivid, visual textbook of the party's history\" and during the visit stated that China had The East is Red, which should updated for the 90th anniversary of Mao Zedong's birth.\nThe Song of the Chinese Revolution had a cast of 1,500 performers from 60 performance groups. Gu Yue portrayed Mao Zedong. Due to the similarity in their characteristic appearances, Ren Bishi was portrayed by his only surviving son, Ren Yuanyuan, who was an engineer and who had never acted before.\nHu Qiaomu, a cultural leader and expert on CCP history and documents, reviewed the script to improve its historical accuracy, although not all of his suggestions were incorporated into the production.\nNarrative\nThe Song of the Chinese Revolution revises the narrative from its model The East is Red to include the roles of previously omitted revolutionary leaders and with greater emphasis on personal experiences, such as the pathos of the sacrifices made by women and children. It also expands the historical scope from the Party history covered by The East is Red to include 1840 to 1984.\nThe production's prologue is titled The Morning Melody of the Motherland.\nAct 1 depicts Western imperialism in China, including the burning of the Old Summer Palace by the Eight-Nation Alliance in 1900, depicts the May Fourth Movement, and concludes with the founding of the CCP. The Song of the Chinese Revolution features various groups of early communists, including Mao, Zhou Enlai, Li Dazhao, Dong Biwu, and Liu Shaoqi, whose image standing with railroad workers in front of a locomotive ends Act 1. In addition to its focus on the CCP, The Song of the Chinese Revolution also celebrates non-communist leaders like Sun Yat-sen and commemorates those who died in the Opium Wars, the Taiping Rebellion, and the 1911 Revolution.\nAct 2 includes the Northern Expedition, the split of the First United Front between the CCP and the Kuomintang, the Nanchang uprising, and the Autumn Harvest Uprising.\nAct 3 portrays the Long March, the Second Sino-Japanese War, and the Chinese Civil War. Among the themes of Act 3 is collective leadership during the Yan'an Soviet, including the \"five great secretaries in the Central Secretariat\" from the 7th National Party Congress: Mao, Liu, Zhou, Ren Bishi, and Zhu De.\nAct 4 begins with the founding of the People's Republic of China, omits the Cultural Revolution itself, and proceeds to the 1976 smashing of the Gang of Four. Act 4 includes the White Flower Dance, a solo with a dancer appearing in the role of Zhang Zhixin. Zhang was executed in 1975 and described as a counterrevolutionary; she was celebrated in the post-Cultural Revolution era as a hero who stood up to those like the Gang of Four.\nAct 5 covers 1978, when the 3rd plenary session of the 11th Central Committee of the Chinese Communist Party convened, to 1982, when the 12th Party Congress convened.\nIn the epilogue, a chorus praises the motherland marching towards a new era. The Song of the Chinese Revolution closes with Deng's smiling face  while the sun emerges.\nSee also\n* Cinema of China\n* Political music in China\n* The Road to Revival\nReferences"
    }
  ]
}