{
  "content": [
    {
      "type": "text",
      "text": "# The Chicago Crusader\n\n| owner = Dorothy Leavell\n| caption = \"The Militant Voice of the People\"\n| motto = \"The Militant Voice of the People\"\n| format =\n| type = Weekly newspaper\n| founder = Balm L. Leavell, Jr. and Joseph H. Jefferson\n| publisher = The Crusader Newspaper Group\n| free = https://issuu.com/thecrusadernews\n}}\nThe Chicago Crusader, known from 1940 to the 1950s as The Crusader and from the 1950s to 1981 as The New Crusader, is a weekly African-American newspaper serving Chicago. It is one of two newspapers in the Crusader Newspaper Group, the other being the Gary Crusader.\nFounded by Balm L. Leavell and Joseph H. Jefferson in 1940 and published by Balm Leavell until his death in 1968, The Chicago Crusader has subsequently been operated by his widow Dorothy Leavell.  It is Chicago's longest-running African-American weekly.\nHistory\nWhen it was established in 1940, The Crusader occupied a single page and was operated out of an apartment in the Ida B. Wells Homes on Chicago's South Side. In this early period, it served as the official organ of the Negro Labor Relations League, an organization established in 1937 to challenge the racial discrimination in employment in Chicago. The newspaper later moved to its current location on King Drive in Chicago's Woodlawn neighborhood.  By the late 1960s, its circulation had risen to 31,000.\nThe Crusaders historical significance includes running a column titled \"Muhammad Speaks\", by Elijah Muhammad of the Nation of Islam (NOI), in the 1950s prior to the creation of the NOI's own Muhammad Speaks newspaper. It was one of very few newspapers to run the column, another being the Pittsburgh Courier. During the same period, The Crusader also published a column on \"Women of Islam\" by Tynnetta Muhammad (under the name Tyneta Denear),  who later published a column by the same title in Muhammad Speaks.  When the Nation of Islam established Muhammad Speaks, it hired Dan Burley, who had formerly worked for The Crusader as well as the Chicago Defender, to edit it.\nIn 1960, the newspaper extended a formal invitation to the imprisoned Kenyan independence leader Jomo Kenyatta to speak in Chicago.\nDorothy Leavell joined the newspaper as its office manager in 1961, marrying Balm Leavell soon after.  She became the newspaper's business manager in 1964, and upon her husband's death she took charge of the entire operation. Dorothy Leavell has served in prominent roles in many African-American publishing organizations and was inducted into the National Black Journalists Hall of Fame in 2016. She took over Chicago's alternative weekly, the Chicago Reader in 2018.\nSee also\n*Chicago Defender\n*Chicago Reader\n*Gary Crusader\n*List of African-American newspapers in Illinois\nWorks cited\n*\nReferences\nExternal links\n*[https://chicagocrusader.com/ Official site]\n*[https://chroniclingamerica.loc.gov/lccn/sn84024060/ Chronicling America]\n*[https://chicago.suntimes.com/2016/6/24/18455171/publishing--chicago-crusader-celebrates-75th-anniversary Publishing trailblazer Chicago Crusader celebrates 75th anniversary]"
    }
  ]
}