{
  "content": [
    {
      "type": "text",
      "text": "# The Forward Pass\n\n| runtime        = 78 minutes\n| country        = United States\n| language       = English\n| budget         =\n}}\nThe Forward Pass is a 1929 American sound (All-Talking) Pre-Code football drama musical film directed by Edward F. Cline, starring Douglas Fairbanks Jr. and Loretta Young. John Wayne was an uncredited extra in the film. The film is believed to be lost.\nPlot\nMarty Reid (Douglas Fairbanks Jr.) is the star quarterback of Sanford College, and according to Coach Wilson (Bert Rome), the finest backfield man the school has ever had. But Marty hates taking physical punishment and, after being knocked out by a vicious clip to the head in a game, begins to question his desire to continue playing.\nAt the film's opening, Sanford and rival Whittier are tied 7–7 with just two minutes left to play. Marty, already banged up, is sent back into the game as Coach Wilson's last hope. He makes a first down with a pass, but when a planned drop-kick fails and the team faces fourth down, Marty is shaken by the arrival of two massive players subbed in to “smear” him. The pass attempt fails, and the game ends in a tie.\nThat night on the train home, Marty stuns Coach Wilson and team captain \"Honey\" Smith (Guinn \"Big Boy\" Williams) by announcing he's quitting football for good. Ed Kirby (Allan Lane), who dislikes Marty, brands him a coward.\nCoach Wilson, desperate to get Marty back before the all-important game against Colfax, enlists the help of Patricia Carlyle (Loretta Young), \"the college vamp.\" The plan is for Pat to take an interest in Marty and lure him back onto the team through pride and jealousy.\nMarty, who has never had much experience with girls or fights, initially wants nothing to do with Pat. But over the following weeks, her affections seem genuine. What begins as \"vamping\" him as a school duty soon turns real—Pat finds herself falling in love with him.\nMeanwhile, without Marty, the team is in disarray and morale is low. Unknown to most, Marty has quietly continued training and staying in shape. His feelings for Pat are also deepening.\nJust before the big game, Pat's sorority hosts a dance, where only football players can participate. Ed Kirby, who also has eyes for Pat, repeatedly cuts in while Marty tries to dance with her, taunting him in the process. Later that evening, Marty sees Coach Wilson and asks to be reinstated for the game. Overjoyed, he kisses Pat, and she confesses she loves him too.\nBut just before kickoff, Marty overhears that Pat had originally been assigned to “vamp” him to get him back on the field. Feeling betrayed, he tries to play but performs poorly. Kirby deliberately makes him look worse by refusing to receive his passes. Both are eventually benched.\nPat learns what's happened and, realizing how badly she's hurt him, rushes to set the record straight. During the final quarter, with Sanford trailing Colfax, she tries to get word to Marty that she truly loves him. Meanwhile, in the locker room, Marty and Kirby are in a fistfight. When Marty hears the truth about Pat's feelings, he rushes back to the field. Convinced now that his rival is not a coward, Kirby shares his enthusiasm and joins the game.\nNow united, Marty and Kirby work together and lead the team to a thrilling last-minute victory for Sanford. Marty's courage is proven, and he wins both the game—and Pat.\nCast\n* Douglas Fairbanks Jr. as Marty Reid\n* Loretta Young as Patricia Carlyle\n* Guinn 'Big Boy' Williams as Honey Smith\n* Marion Byron as Mazie\n* Phyllis Crane as Dot\n* Bert Rome as Coach Wilson\n* Lane Chandler as Assistant Coach Kane\n* Allan Lane as Ed Kirby\n* John Wayne as Extra (uncredited)\nSoundtrack\n* \"Hello, Baby\" or '''H'lo Baby\n:Music and lyrics by Herb Magidson, Ned Washington, Michael H. Cleary.\n* \"One Minute Of Heaven\"\n:Music and lyrics by Herb Magidson, Ned Washington, Michael H. Cleary.\n* \"I Gotta Have You\"\n:Music and lyrics by Walter Samuels, Mac (i.e., Max Rutchik), Lennie (i.e., Leonard Whitcup).\n* \"Huddlin'\"'\n:Music and lyrics by Herb Magidson, Ned Washington, Michael H. Cleary.\nSee also\n* List of American films of 1929\n* List of American football films\n* List of early sound feature films (1926–1929)\nReferences\nExternal links\n*\n*\n*[http://www.answers.com/topic/the-forward-pass-1 The Forward Pass'' details], Answers.com"
    }
  ]
}