{
  "content": [
    {
      "type": "text",
      "text": "# The Baron Kinkvervankotsdorsprakingatchdern\n\n(1779)\n| premiere_date     =\n| premiere_location = Little Theatre in the Haymarket, London\n}}\nThe Baron Kinkvervankotsdorsprakingatchdern is an 18th-century English language comic opera pasticcio\nwith music by Samuel Arnold and a libretto by Miles Peter Andrews.  The opera consists of a prologue by Frederick Pilon, three acts, and an epilogue by Edward Topham. The first performance was at the Little Theatre in Haymarket, London, in July 1781. Baron \"played during three nights of tumultuous disapprobation, and [was] then withdrawn\".\nThe opera was based on a novel by Elizabeth Craven, Modern Anecdote of the Ancient Family of the Kinkvervankotsdarsprakengotchderns: A Tale for Christmas 1779. Craven's novel, published in 1779, was dedicated to Horace Walpole.\nSynopsis\nSetting: The castle of Baron Kinkvervankotsdorsprakingatchdern, near Göttingen.\nThe Baron, whose name is not mentioned in the opera, has a daughter named Cecil.  She is in love with a Dutch soldier, Franzel Van Botherham.  Franzel's father, Mynheer Van Botherham, arrives with his wife to foreclose the mortgage on the Baron's castle.  The Baron speaks constantly of his ancestors, whose pictures fill the walls of his home.\nBoth the Baron and Mynheer disapprove of the match.  The Baron wants Cecil to marry Captain  Hogrestan, an old and braggardly soldier.  Mynheer wants Franzel to marry an heiress. The Baron \"locks his daughter in a castle chamber, whence she escapes by piling the family pictures in a heap\".\nWhen Franzel and Cecil are wed, the Baron says he will never forgive her for dishonoring the family name by marrying beneath her.  Mynheer and his family welcome Cecil and discourage her from trying to convince her father to accept the union.\nRoles\n, who played Cecil, the Baron's daughter]]\n{| class=\"wikitable\"\n|+\n!Role\n!Voice type\n!Little Theatre, Haymarket, 1781\n|-\n|The Baron\n|\n|Mr. (West) Digges\n|-\n|Cecil, ''the Baron's daughter''\n|\n|Miss (Elizabeth) Harper\n|-\n|Captain Hogrestan\n|\n|Mr. (John) Palmer\n|-\n|Pangloss\n|\n|Mr. (John) Edwin\n|-\n|Mynheer Van Botherham\n|\n|Mr. (Richard) Wilson\n|-\n|Mefrow Van Botherham\n|\n|Mrs. (Richard) Webb (née Lydia Child)\n|-\n|German Doctor\n|\n|Mr. (Robert) Baddeley\n|-\n|Franzel Van Botherham\n|\n|Mr. (Charles) Wood\n|-\n|Rubrick\n|\n|Mr. R. (Robert) Palmer\n|-\n|Dagram\n|\n|Mr. (Ralph) Wewitzer\n|-\n|Serjeant\n|\n|Mr. Stanton\n|-\n|Grootrump\n|\n|Mrs. Edwin (née Elizabeth Walmesley)\n|-\n|}\nPerformances\nThe first performance was 9 July 1781 at the Little Theatre in the Haymarket. It was presented on a double bill with Arthur Murphy's 1756 play The Apprentice  following Baron. The second performance was 10 July and the third and final on 11 July. Nine days after the premiere of Baron, a second collaboration by Arnold and Craven, The Silver Tankard, or, The Point at Portsmouth, was given at the same theatre.\nWest Digges, well regarded as Thomas Wolsey in Henry VIII, Caratach in Fletcher's Bonduca, and Macheath in Gay's ''The Beggar's Opera, was the Baron. Mynheer Van Botherham was played by Richard Wilson, who created the part of Don Jerome, the lead in the hit 1775 opera The Duenna. Frenzel was Charles Wood, who had appeared in the opera The Flitch of Bacon''. The Baron's daughter, Cecil, was Elizabeth Harper—later billed as \"Mrs. Bannister\" after her marriage—who had played an acclaimed Polly Peachum in 1778 and Rosina in a version of Beaumarchais's The Barber of Seville called The Spanish Barber. John Palmer, who created the role of Sir Joseph Surface in Sheridan's The School for Scandal, was Hogrestan. The rotund comedienne Mrs Webb, long associated with the theatre in Haymarket, played the role of Mefrow Van Botherham. The character actor Ralph Wewitzer, who excelled in low comedy parts, was Dagran. The comedian John Edwin the Elder was Pangloss. Edwin's common law wife, Sarah Walmsley—billed as \"Mrs. Edwin\"—made her debut on the London stage as Grootrump.\nThe Biographia Dramatica states Baron was performed in full only once and the two subsequent performances had to be \"forced on the public\". A contemporary account in the Edinburgh Magazine reported:\nThe third performance ended early because the audience rioted. The Edinburgh Magazine continued:\nAndrews noted in the preface to the published libretto that \"the very extraordinary circumstances that attended the hearing, or rather the not hearing, of this piece with the subsequent contentions which it occasioned would seem to call sufficiently for its publication; these circumstances, however, the Author would certainly have foregone,\" and wrote at length about the criticisms of his work.\nCritical analysis\nThe Monthly Review observed \"the dialogue of this piece ... is not very chaste.  A certain pruriency of the imagination seems to keep the Author in perpetual pursuit of double entendre, which sometimes he effects adroitly enough, and often but clumsily.\" The Critical Review passed over the libretto in two sentences: \"This piece would afford ample material for the severity of criticism but 'We war not with the dead!' It has been tried, condemned, and executed; and peace be to its manes!\"\nA modern scholar of Andrews, Laura Morrow, calls Baron the least successful of Andrews's stage works. Morrow says \"The Baron probably failed because of its weak plot and generally unsympathetic characters\" and the show's comedy was \"largely predictable and repetitious\". The theatre historian W. J. Macqueen-Pope in his book on the Haymarket said\nPublication\nMiles Peter Andrews\nThe libretto was published in London in 1781. Andrews dedicated it to George Colman the Elder, the playwright who bought the Haymarket Theatre in 1777 and owned it until his death in 1794.\nThe manuscript of the libretto is in the Huntington Library in California as part of the collection assembled by John Larpent during his service as the official Examiner of Plays. The manuscript contains a number of scenes and lines that were not included in the printed version. The score has not survived.\nThe opera contains the longest single word in the title of any British musical publication.\nNotes\nReferences\nExternal links\n*[https://archive.org/details/bim_eighteenth-century_the-baron-kinkvervankots_andrews-miles-peter_1781/page/n6/mode/1up Scan of Miles Peter Andrews's libretto for The Baron Kinkvervankotsdorsprakingatchdern, A New Musical Comedy: As performed at the Theatre-Royal in the Hay-Market (London: T. Caddell, 1781)]\n*[https://archive.org/details/bim_eighteenth-century_baron-kinkvervankotsdor_andrews-miles-peter_1781/page/n1/mode/1up Scan of Songs, Duets, Chorusses &c. in the Musical Comedy of The Baron: As performed at the Theatre-Royal in the Hay-Market by Miles Peter Andrews (London: T. Caddell, 1781)]\n*[https://archive.org/details/bim_eighteenth-century_modern-anecdote-of-the-a_craven-elizabeth-craven_1781/mode/1up Scan of Elizabeth Craven's 1779 novel, Modern Anecdote of the Ancient Family of the Kinkvervankotsdarsprakengotchderns: A Tale for Christmas 1779 (London: The Author, 1779)]"
    }
  ]
}