{
  "content": [
    {
      "type": "text",
      "text": "# The Love That Whirls (Diary of a Thinking Heart)\n\n| recorded     = April – November 1981\n| genre        = Synth-pop\n| length       =\n| label        = *Mercury (UK)\n*PVC (US)\n*Passport (CA)\n| producer     = Bill Nelson\n| prev_title   = Sleepcycle\n| prev_year    = 1982\n| next_title   = King of the Cowboys\n| next_year    = 1982\n| misc         =\n}}\n}}\nThe Love That Whirls (Diary of a Thinking Heart) is the third studio album by English musician Bill Nelson. The album was released in June 1982 and was self-produced.\nIt is the second in a trilogy of albums with Mercury Records, including Quit Dreaming and Get on the Beam (1981) and Chimera (1983). It reached no. 28 in the UK albums chart.\nBackground and recording\nThe recording sessions that produced The Love That Whirls occurred between April and November 1981. During this period, his previous album Quit Dreaming and Get on the Beam was released, and Nelson also released Das Kabinett (The Cabinet of Doctor Caligari), the soundtrack to the Yorkshire Actors Company's stage adaptation of the 1920 Robert Wiene's silent film of the same name.\nStyle, title, and cover art\nThe album marked a further shift in style in Bill Nelson's work up to that point; the gradual evolution from the primarily guitar-based rock of Be-Bop Deluxe to the new wave-tinged Quit Dreaming... showed an increasing emphasis of synthesizers. Despite this, guitars still appear frequently on the album, primarily in the form of the E-bow guitar.\nIn a 1989 interview for the magazine Musician, Nelson addressed misconceptions that he had largely abandoned the instrument:\nFor a while I really did look upon the guitar as being an overstatement of the very obvious things,... And it suddenly seemed like guitar playing had developed into a language, which was very set and stylized.... In fact, on The Love That Whirls, there's more guitar playing than on some of the albums I'd done earlier. But nobody recognized it because I was using the E-Bow and they thought it was a synth, you see.... I suddenly realized that people don’t recognize this as guitar because the common language of guitar has become so nailed to the floor.\nScattered across the album are ambient instrumentals that act as transitional pieces between the longer, more synth-pop-oriented tracks of the record. Melodically, The Love that Whirls took inspiration from Japanese music, largely apparent on songs such as \"Eros Arriving\".\nThe title is taken from an unreleased film by Kenneth Anger, and the front cover depicts Nelson posing next to a 10th century CE figurine of the Hindu deity Nataraja, lord of the dance.\nPromotion and release\nThe Love That Whirls peaked at no. 28 on the UK albums chart. Two singles, \"Eros Arriving\" and \"Flaming Desire\", were taken from the album, the former of which peaked on the UK Bubbling Under chart, while the latter was accompanied by a music video that entered light rotation on MTV later in early 1984.\nLa Belle et la Bête (Beauty and the Beast)\nTo promote The Love That Whirls, a limited run of copies included an additional album entitled La Belle et la Bête, a second soundtrack with the Yorkshire Actors Company that adapted Jean Cocteau's film Beauty and the Beast for the stage. This double album release, advertised in magazines such as Smash Hits, is similar to when ten thousand copies of Quit Dreaming and Get on the Beam were paired with the instrumental album Sounding the Ritual Echo (Atmospheres for Dreaming). Although La Belle et la Bête was not released as a standalone record, Nelson would later re-release the soundtrack with Das Kabinett as a double album compilation in 1985.\nFlaming Desires and Other Passions\nIn December 1982, an extended play combining tracks from both singles was released in the US, entitled Flaming Desires and Other Passions. The 12\" EP on PVC Records was self-produced and featured contributions from his brother Ian Nelson on saxophone (who also played on Quit Dreaming...) and from Bogdan Wiczling and Mark Radcliffe on drums.\nCritical reception\n| rev2      = Record Mirror\n| rev2Score =\n| rev3      = Smash Hits\n| rev3Score = 7/10\n}}\nIn a contemporary review, Tim de Lisle of Smash Hits praised The Love That Whirls as \"varied, danceable, and highly original\", concluding it is \"Far from faultless but worth a listen.\" Ira Robbins, writing for the Trouser Press, said Nelson's intrumentals stay \"out of the way of the vocals but remains clever and unusual.... To Nelson the synthesizer is an instrument of subtle shadings, and he has created a gossamer world of musical beauty\". Reviewing for Record Mirror, Daniela Soave lauded it as \"one of this year's prime LPs\", additionally offering praise towards its companion album La Belle et la Bête, saying that it \"exemplifies Nelson's talent to change moods and thrust visual images into your head.\"\nIn a retrospective assessment for AllMusic, Steven McDonald said \"There is a sweetness and a lightness to a great deal of the work Nelson put into this album, and this makes it infinitely listenable. In some respects, this is also a record that will teach listeners everything they need to know about Bill Nelson – it touches on all aspects of what he does.\"\nLegacy\nIn 2020, Jack Tatum, largely known as the creative force behind the band Wild Nothing, wrote a guest review for the website Off Your Radar in which he said:\nFor me, it’s not only one of the most tragically overlooked examples of early ’80s synthesized pop and experimental music, but one of my favorite records.... The Love That Whirls has become my go-to recommended album ever since I discovered it a number of years ago, a vibrant example of almost all the things I love about music from this era.\nTrack listing\nVarious reissues insert \"Flesh\" and \"He and Sleep Were Brothers\" (originally included on the \"Eros Arriving\" double 7\" single) between \"The Bride of Christ in Autumn\" and \"When Your Dream of Perfect Beauty Comes True\".\nPersonnel\nCredits are primarily adapted from the CD release of The Love That Whirls on Mercury.\n* Bill Nelson – all other instruments, including vocals, E-bow guitar, Roland TR-808 drum machine, autoharp, flute, keyboards, marimbas\n* Jan Nelson – vibraslap on \"Empire of the Senses\"\n* Bogdan Wiczling – drums on \"The October Man\"\n* Mark Radcliffe – percussion on \"He and Sleep Were Brothers\" (uncredited)\nTechnical and design\n* Bill Nelson – production, engineering, mastering, cover concept\n* Ted Sharp, Pat Moran, John Leckie, Mick Robson – engineering\n* Ray Staff – mastering\n* David Claridge – cover concept\n* Sheila Rock – cover photography\nCharts\nAlbum\n{| class=\"wikitable sortable\" style=margin-right:1em;margin-bottom:0;\n|+\n! scope=\"col\"| Chart (1982)\n! scope=\"col\"| Peakposition\n|-\n| UK Albums (OCC)\n| style=\"text-align:center;\"| 28\n|}\nSingles\n{| class=\"wikitable sortable\" style=margin-right:1em;margin-bottom:0;\n|+ \"Eros Arriving\"\n! scope=\"col\"| Chart (1982)\n! scope=\"col\"| Peakposition\n|-\n| UK Singles Bubbling Under (OCC)\n| style=\"text-align:center;\"| 76–100\n|}\nNotes\nReferences\nExternal links\n*\n* [https://www.billnelson.com/love-that-whirls The Love That Whirls at Dreamsville (a.k.a. billnelson.com)]\n* [https://www.billnelson.com/la-belle-et-la-bete La Belle et la Bête at Dreamsville (a.k.a. billnelson.com)]\n*\n* [https://www.billnelson.com/flaming-desire Flaming Desire and Other Passions at Dreamsville (a.k.a. billnelson.com)]"
    }
  ]
}