{
  "content": [
    {
      "type": "text",
      "text": "# The Black Panthers: Vanguard of the Revolution\n\n| starring =\n| music = Tom Phillips\n| cinematography =\n| editing = Aljernon Tunsil\n| studio = Firelight Films\n| distributor = PBS Distribution\n| released =\n| runtime = 115 minutes\n| country = United States\n| language = English\n| budget =\n| gross = $584,109\n}}\nThe Black Panthers: Vanguard of the Revolution is a 2015 American documentary film directed and written by Stanley Nelson Jr. The film combines archival footage and interviews with surviving Panthers and FBI agents to tell the story of the revolutionary black organization the Black Panther Party. It is Nelson Jr.'s eighth film to premiere at Sundance. The film was pitched at Sheffield Doc/Fest's MeetMarket in 2014 and is the first of a three-part series of documentary films about African-American history America Revisited. It will be followed by Tell Them We Are Rising: The Story of Historically Black Colleges and Universities and The Slave Trade: Creating a New World.\nThe film premiered on January 23, 2015 at the 2015 Sundance Film Festival before receiving a limited North American theatrical release on September 2, 2015.\nProduction\nThe film took seven years to complete. Nelson interviewed over fifty people for the film, with around thirty making it into the final cut. Infamous wiretaps of the Black Panthers were never accessed through the Freedom of Information Act, despite repeated attempts on behalf of the producer. Much of the archival footage used in the film has never been publicly broadcast before, with much time and effort going into locating and digitizing obscure resources.\nCritical reception\nThe film received both acclaim and reproval from critics. On Rotten Tomatoes, it has a 92% rating based on 36 reviews, with an average rating of 7.6/10. The site's consensus states: \"The Black Panthers: Vanguard Of The Revolution offers a fascinating -- if somewhat rudimentary -- introduction to a movement, and an era, that remains soberingly relevant today.\" Metacritic reports an 80 out of 100 rating based on 17 critics, indicating \"generally favorable reviews\". The Hollywood Reporter gave the film a positive review, describing it as \"a strong if only occasionally transporting biography of a movement that terrified the establishment in its day.\" The Mercury News wrote, \"Pulse-pounding...and insightful.\"\nElaine Brown, a former Black Panther Party leader, criticized the film, writing that it presents \"a disparaging portrait of Huey P. Newton\" and that Nelson \"[excised] from his film the Party's ideological foundation and political strategies, [...] reducing our activities to sensationalist engagements, as snatched from establishment media headlines.\"\nIn contrast, Michael C. Moynihan, writing in The Daily Beast, accused the film of \"whitewashing\" the politics and activities of the Black Panther Party.\nSee also\n*List of black films of the 2010s\nReferences"
    }
  ]
}