{
  "content": [
    {
      "type": "text",
      "text": "# The Nebula Awards 18\n\nThe Nebula Awards #18 is an anthology of   science fiction short works edited by American writer Robert Silverberg. It was first published in hardcover by Arbor House in October 1983; a paperback edition with cover art by Gary LoSasso was issued by Bantam Books in September 1984.\nSummary\nThe book collects pieces that won or were nominated for the Nebula Awards for novel, novella, novelette and short story for the year 1983, together with an introduction by the editor and list of past winners. Not all nominees for the various awards are included.\nContents\n*\"Introduction\" (Robert Silverberg)\n*\"Souls\" [Best Novella nominee, 1983] (Joanna Russ)\n*\"No Enemy But Time\" (excerpt) [Best Novel winner, 1983] (Michael Bishop)\n*\"The Pope of the Chimps\" [Best Short Story nominee, 1983] (Robert Silverberg)\n*\"Burning Chrome\" [Best Novelette nominee, 1983] (William Gibson)\n*\"Fire Watch\" [Best Novelette winner, 1983] (Connie Willis)\n*\"Corridors\" [Best Short Story nominee, 1983] (Barry N. Malzberg)\n*\"Another Orphan\" [Best Novella winner, 1983] (John Kessel)\n*\"A Letter from the Clearys\" [Best Short Story winner, 1983] (Connie Willis)\n*\"Swarm\" [Best Novelette nominee, 1983] (Bruce Sterling)\n*\"The Nebula Winners, 1965-1981\"\nReception\nBarbara A. Bannon in Publishers Weekly rated the award-winning pieces collected in the anthology highly, and noted that \"[a]s good as those works are, perhaps equally impressive is the quality of the nominees that didn't win.\" She complimented Russ's, Malzberg's and Sterling's pieces individually, citing the last as \"one of the best stories ever about living with aliens,\" as well as calling those by Silverberg and Gibson \"[f]ine stories\" that \"complete the volume at the same high level.\"\nThe book was also reviewed by Paul O. Williams in Fantasy Review, August 1984 and Sue Thomason in Paperback Inferno no. 52, 1985.\nAwards\nThe anthology placed seventeenth in the 1984 Locus Poll Award for Best Anthology.\nNotes"
    }
  ]
}