{
  "content": [
    {
      "type": "text",
      "text": "# The Swan Queen\n\n\"The Swan Queen\" is a Lithuanian fairy tale related to the character of the swan maiden. In the tale, a peasant couple find a swan or goose and bring it home, which transforms into a human girl they adopt as their daughter. After her birdskin is destroyed and she marries a human prince, her bird flock gives her a new set of garments and she turns back into a bird.\nTranslations\nThe tale was first published by  in a 1924 German language translation of Lithuanian fairy tales with the title Von der Schwanenjungfrau, die des Königs Gattin wurde (\"About the Swan Maiden who became a King's Wife\"). The tale was also translated into Russian as \"Королева Лебедь\" (\"Queen Swan\") and as \"Лебедь — жена короля\" (\"Swan, King's Wife\").\nSummary\nA white swan comes from the skies, takes off its wings and becomes a human woman. She does the chores of an elderly couple who lives in the woods, whenever they are not at home. One day, they become curious about their mysterious housekeeper. The old man hides behind a tub and waits for the housekeeper to appear. He sees the swan take off its wings and fold them. He burns the wings while the swan woman is away fetching water. When she returns to the couple's home, she discovers her wings were burnt off and she cannot return to her swan family, so she lives with the human couple.\nA king on a hunt sees the maiden and asks the old couple for her hand in marriage. They marry and she gives birth to a son. One day, she takes her son to the garden and sees her swan flock flying overhead. Her swan family wants to give her a new pair of wings, which she gets after a few visits from them. She abandons her human son and the king marries a witch named Lauma.\nDuring the marriage, the swan maiden visits her own son to lull him into sleep. Her human husband learns of this and consults with a wise old man how to reverse the swan transformation and keep her in human form forevermore. The old man advises him to put some tar on the windowsill the next time the swan comes to rock the child. The king follows his instructions; the swan's wings become glued to the tar and she becomes a human again.\nAnalysis\nTale type\nThe tale was classified by Bronislava Kerbelyté as type AT 400* of the international Aarne-Thompson Index, also known as The Swan Maid. \"The Swan Maiden\" also functions as a frequent introduction to the more general type ATU 400, \"The Man on a Quest for the Lost Wife\".\nIn Lithuanian scholarship\nLithuanian folklorist , in his analysis of Lithuanian folktales (published in 1936), identified a specific version of the Swan Maiden narrative in Lithuania, which he classified as type 404*, Mergaitė - gulbė (\"The Swan Maid\") - not included at the international Aarne–Thompson Index at the time. In these variants, after the human burns the swan maiden's feather skin, they marry. However, her swan flock visits her and her swan lover throws her a new set of feathers.\nFellow folklorist  reports only 11 Lithuanian entries as separate tales of type AaTh 400*: the bird maiden (swan, duck, goose) loses her featherskin to a human hunter or to a human couple, but later regains it when her swan flock gives her a new set. Some tales may use an episode of type ATU 450, \"Brother and Sister\": the bird maiden returns to suckle her baby, her human husband discovers her and turns her back into a human.}}\nVariants\nLithuania\nLithuanian author  translated a Lithuanian variant with the title ''Swan, the King's Wife''. In this tale, an old man and woman try to shoo away the swan flock that comes to eat their buckwheat. One night, the old man manages to capture a swan and brings it home. The old woman picks up the swan and throws it over her shoulderit becomes half human, then throws over the other shoulderand the swan becomes wholly human. The now human swandescribed as having a sun on the front, stars in her ears and a moon on top of her headbegins to cry. The old human couple tries to cheer her up, with little success. Some time later, a prince passes by the old couple's house, falls in love with the now human swan maiden and marries her. They live together in the palace, but even giving birth to a daughter does not seem to lift the maiden's spirits. Once spring is near, the maiden goes to the edge of the lake and calls out to a swan flock flying overhead. She returns the next day and asks the swan flock to toss her some feathers. She turns into a swan and flies back to the skies. Bronislava Kerbelyté collected a similar tale she titled \"Жена-гусыня\" (\"Goose Woman\"), wherein the bird is a goose, but otherwise the story is the same.\nMari people\nScholar S. S. Sabitov located a similar narrative in the \"Catalogue of Tales of Magic from the Mari people\", indexed as type 400, \"Девушка-лебедь\" (\"Swan Girl)\". In this tale type, the hero catches the swan maiden and burns her swanskin, but she regains her feathers from other swans and flies away. Sabitov considered this an \"autonomous\" development of the story among the Mari.\nIn a tale from the Cheremis (Mari people), collected by Arvid Genetz from an informant in District of Krasnoufimsk, Province of Perm, the swan maiden is captured by a human and marries him. However, she gains a new swan cloak by using feathers brought by other swans. The tale was also translated into Hungarian with the title A hattyúlány (\"The Swan Girl\"), where the swan maiden is named Jüksalcse, her human husband is called Kozsemor and his father Kozsan. The translator noted that 'Jükső' means 'swan' and 'Kozs' means pine tree, so he supposed both names indicated a totemic origin. In a Russian translation of the tale, titled \"Дочь лебеди Йукталче\" (\"Swan Daughter Yuktalche\"), an old man named Kozhan and his son Kozhdemyr set a trap for the large white swan that has been trampling their crops. Kozhdemyr captures a white swan in a net and burns its feathers. Once he does that, the swan becomes a beautiful woman named Yuktalche. The now human swan girl marries the youth, but a swan flock gives her a new set of feathers to become a swan again.\nIn another tale from the Mari with the title \"Белая Лебедушка\" (\"White Little Swan\"), a hunter named Тойдемар (Toydemar) captures a swan and brings it home. The swan becomes a human maiden and he marries her. One day, she is sent to fetch water and laments her fate. A swan flock flying overhead hears her plight and throws a feather to her. This goes on for some time until she has a new cloak. She flies back to the skies. Her husband witnesses her transformation and cries that he cannot be with her. The swan flock throws him some feathers, he becomes a bird and joins the flock in the sky.\nChuvash people\nIn a tale from the Chuvash people, \"Альдюк\" (\"Aldyuk\"), a poor old couple has a son named Ivan. The man brings home a goose, which takes off its goose skin and becomes a beautiful human maiden. The goose girl works as the old woman's helper. Ivan falls in love with her, they marry and give birth to a son. One day, when the goose girl is milking the cows, the old woman burns her goose coat. Some time later, a flock of geese flies over the house and begs Aldyuk to join them, but the girl says her goose coat has been burnt. The third time, the flock throws her a new feather cloak. She becomes a swan again and flies to the skies. However, she still returns three nights to nurse her baby child. The end of the tale is a happy one: she becomes human again and lives with her husband and his relatives.\nBulgaria\nA similar narrative is attested in the Bulgarian folktale catalogue indexed as type *400A, \"Птица-дъщеря\" (\"Bird-daughter\"): a peasant couple find a lame duck and bring it home, which takes off its birdskin and becomes a human girl. The couple burn her feathers to keep her human, and they live like a family. One day, the girl is given a new set of feathers, becomes a bird and flies away.\nLiterary versions\nAuthor Arthur Ransome adapted a Russian tale as The Swan Princess. In this tale, a prince named Ivan, son of a Tzar (sic), captures a swan with pure white feathers near some marshlands, but decides to spare it and make it his pet. One day, Ivan leaves the tent for a long while, leaving the pet swan unattended. However, the pert swan becomes a human maiden, does the chores (like sweeping the floor and preparing dishes) and turns back to swan before Ivan enters the tent. Seeing the place all tidied up, the prince wants to discover who is his mysterious housekeeper. Ivan stakes out for three days and finds out about the swan maiden on the third day. He catches her, though she tries to struggle to break free from him. Ivan marries the swan maiden and she gives birth to a baby boy \"near the end of the winter\". They also hire an old woman as housekeeper. As time passes and seasons change, the swan maiden appears more taciturn and quiet. After spring comes, the housekeeper warns Ivan to look out for his swan wife. The old woman's warning becomes true, as his wife stands at the porch of their house calling out to a swan flock flying overhead: the first time, her swan father beckons her to come with them; the second time, her swan mother; the third time, her swan brother; the last and fourth time, her swan beloved. The swan flock fly down to collect her, but Ivan catches her before she has a chance to rejoin the flock.\nSee also\n*  (Ukrainian folktale)\n* The Crane Wife (Japanese folktale)\nFootnotes\nReferences"
    }
  ]
}