{
  "content": [
    {
      "type": "text",
      "text": "# The Indo-Israeli Agriculture Project\n\n}}\nThe Indo-Israeli Agriculture Project (IIAP) is a bilateral partnership established in 2006 between Israel and Indian governments. India has chosen Israel as a G2G level strategic partner in the field of agriculture. It was established in cooperation with National Horticulture Mission, National Horticulture Board and Indian States Horticulture Departments, and Israel's Agency for International Development (MASHAV) and CINADCO which provides developing countries with Israel's experience in development and planning.\nThe IIAP aims to establish Centers of Excellence (CoE) in Indian states to facilitate the rapid transfer of technology to farmers. This initiative aims to enhance productivity, improve produce quality, and maximize farmers' income by introducing crop diversity, enhancing productivity, refining cultivation techniques, optimizing irrigation and fertigation, and improving water use efficiency in horticulture.  The Federal and state Indian stakeholders are leading the IIAP partnership by defining the key crops and sanctioning the activity. The Israeli stakeholder MASHAV, guides the standard of the CoE and transfers the knowledge into the IIAP. The concept of the centres is triangular: Applied Research, SMS (subject matter specialist) Field Extension Officer and the Progressive Farmer. CoE acts as a meeting point for academia, government and farmers to cooperate towards achievements.\nIn 2017, there were 26 such Indo-Israel centers in the country.\nStructure\nIIAP cooperation is divided in multiple three-year work plans:\n* The First Action plan (2008–10)  - States of development included Haryana, Maharashtra.\n* The Second Action plan (2012–15) - The state of Israel was requested to share best-practices and know-how and provide capacity building through training programs which were conducted in Israel and India. Implementing partners were NHM–The National Horticulture Mission under the Ministry of Agriculture of India and MASHAV. States of development included Haryana, Gujarat, Maharashtra, Punjab, Rajasthan, Karnataka, Bihar, Tamil Nadu, Telangana, Uttar Pradesh.\n* The Third Action plan (2015–18) - a revised action plan and activities to be extended in additional states such as Mizoram, Andhra Pradesh, Haryana.\n* The Fourth Action Plan (2018–20) - plan includes completing and establishing new Centres of Excellence.\nThe IIAP areas of activity are:\n* Post-Harvest Management (fruit & vegetables)\n* Irrigation and fertigation technologies\n* Introduction of new varieties\n* Plant protection (nematodes, bacteria)\n* Pollination technologies\n* Water management technologies for agriculture, including water re-use\n* Other activities as mutually defined in the Steering Committee\nHistory\nAn Indo-Israel Work Plan was signed during the visit of Agriculture Minister Rajnath Singh to Israel in May 2006. Based on the field visits of Israeli experts and discussions, First Action Plan stage (2008-2010) was agreed upon during the visit of Minister of Agriculture, Government of Israel to India in January, 2008 wherein a number of areas were identified on which collaborative efforts could be implemented in the states of Maharashtra, Haryana and Rajasthan. The plan was later on extended to include the 2012- 2015 period and 2018–2020 period.\nChief Minister Conrad Sangma in 2020 had said \"India's relation with Israel has been growing rapidly and steadily... In the future, we want to have direct flights to the Northeast as we want to expand the presence of Israel in the region\", adding that \"the partnership with the Israel government will be a \"game-changer\" for the state and its farmers\"\nFurther developments\nIIAP was initiated in 2009 after signing a bilateral agreement between Indian and Israeli ministers of Agriculture (2006).\nIn 2017 Centre of Excellence for cut flowers as part of IIAP in Thally was established.\nOn 2 November 2020 Chief Minister of Assam state, Sarbananda Sonowal and Israeli Ambassador to India Dr. Ron Malka laid the foundation stone of Indo-Israeli Centre of Excellence (CoE) for Vegetables Protected Cultivation at Khetri on the outskirts of Guwahati.\nIn November 4, 2020, with aim to benefit Meghalaya farmers by equipping with technology to help increase their income, two centres are planned being built at Jongsha in East Khasi Hills and at Dawagre in East Garo Hills district.\nSee also\n* Foreign relations of India\n* Foreign relations of Israel\nReferences\nExternal links\n* Indian government website: [https://midh.gov.in/CoE/ Centre of Excellence]\n* Indian government: [https://web.archive.org/web/20201213174152/https://midh.gov.in/CoE/Indo%E2%80%93Israel.html Indo-Israel Work Plan]\n* [https://web.archive.org/web/20201213153459/https://mfa.gov.il/MFA/mashav/Publications/Subject_Publications/Documents/Indo-Israeli%20Agricultural%20Project.pdf Israeli government: The Indo-Israeli Agriculture Project]\n* [https://embassies.gov.il/delhi/Relations/Mashav/Documents/IIAP%202018.pdf IIAP booklet]\n*"
    }
  ]
}