{
  "content": [
    {
      "type": "text",
      "text": "# The Ware Case (1938 film)\n\n20th Century Fox\n| released       =\n| runtime        = 79 minutes\n| country        = United Kingdom\n| language       = English\n| budget         =\n| gross          =\n}}\nThe Ware Case is a 1938 British drama film directed by Robert Stevenson and starring Clive Brook, Jane Baxter and Barry K. Barnes. It is an adaptation of the play The Ware Case (1915) by George Pleydell Bancroft, which had previously been made into two silent films, in 1917 and 1928. It had been a celebrated stage vehicle for Sir Gerald Du Maurier. The film was made at Ealing Studios with stately home exteriors shot in the grounds of Pinewood. Oscar Friedrich Werndorff worked as set designer.\nIn Forever Ealing, George Perry wrote, \"The Ware Case is a stagey, melodramatic piece. But it was made on schedule within its budget, and was thus able to go into profit.\"\nPlot\nThe jury looks back on events that lead to profligate baronet Sir Hubert Ware being tried for murder. He had run up huge debts over many years, but always managed to talk his way out of trouble, while not paying his creditors any money. He pretends that his wife's wealthy brother Eustace will stand guarantor for his debts, and is given three months to pay his debts or face bankruptcy. His wife Meg has for a long time tried to make him behave responsibly, and wants him to work out a plan to pay what he owes, but soon realises that Hubert has no intention of even trying to retrench. Their friend Michael, a barrister, who is in love with Meg,  also tries to get Hubert to be responsible. Eustace, who has always refused to help Meg in any way - out of meanness, not because of Hubert's behaviour - tells Hubert that Michael is in love with Meg, which Hubert treats lightly, and repeats to Michael and Meg.\nInstead of dealing with his money problems, he declares that he and Meg will go to Cannes for a holiday. Meg refuses, but he is convinced that she will eventually give in to him, as she has always done in the past. However, this time she decides to stay and try to sort out their money problems herself. Hubert goes off on holiday and embarks on another in a string of affairs.\nMeg realises that the only way to pay Hubert's huge debts is to sell their house, Hubert's ancestral home. A woman who comes to view the house soon makes it clear to Meg that she'd had an affair with Hubert, and that her husband will cite Hubert in the divorce courts - unless Meg is willing to pay. Meg refuses, having never known until now that Hubert had had affairs. She talks to Michael, who had always known of Hubert's affairs, but could not bring himself to tell Meg, knowing how devoted she is to her husband. They quarrel slightly, then Michael apologises. Meg then tells him she had always known he loved her, and, to his astonishment, that she has fallen in love with him. Before they can talk further, Eustace arrives. He is annoyed that Meg didn't give him first refusal on the house, but wants her to sell it to him below the market value. Michael berates him for never doing anything to help his sister, then trying to cheat her over the house. As Eustace stalks off, Meg jokes that she'd like to throttle him and Michael replies lightly that it would solve her money problems, as Eustace only has a life interest in the family wealth. Once again, they are interrupted before they can talk further, as Hubert returns. He asks Michael if a casino would prosecute over what he calls a small sum of money, then reveals he has cashed cheques worth the large sum of £1, 000 in Cannes, which have bounced. When he cashed the cheques in the casino, he asked the cashier how he decided on whether or not to cash the cheques; the cashier says they get to know which people to trust, and that he'd lose his job if he was wrong. This causes Hubert a moment's hesitation, but no more.\nHubert is served with papers in his former mistress's divorce proceedings, which he at first is relieved about, since he was expecting to be arrested over the cheques, until he realises that Meg will now know about his affairs.\nHubert becomes upset when a genuine buyer comes to look round the house, and tells her to come back the next day. He invites Eustace to stay the night and when Michael wonders why, he says Eustace isn't all bad. Meg resolves to tell Hubert that she wants a divorce, but when she starts to speak to him, he says that despite his affairs, she is the only person who means anything to him and that he relies on her utterly; he promises to change for the better. Meg sadly tells Michael that she can't leave Hubert now, and that although it is true that her husband is, as Michael says, a man of straw, that is part of the reason she can't leave him.\nThat evening Eustace is walking by the lake in the grounds. Unseen, he utters a terrible cry and there is a large splash. The next morning the lady comes to look round the house. They take her round the grounds first, where she spots Eustace's body in the lake. Michael dives in to pull him out, but Eustace is dead.\nHaving inherited the family money at Eustace's death, Meg pays all her husband's debts. Shortly afterwards Michael comes to see Hubert and tells him that there is a warrant out for his arrest for the murder of Eustace. He wants to keep this news from Meg for the moment, while they discuss the matter, but Hubert angrily tells her. Michael says that no matter what else Hubert may have done, he doesn't believe he's a murderer.\nMichael defends Hubert in court, and counters prosecution points well, until mention is made of Hubert's ring, found in the lake, and matching in shape and size a bruise on Eustace's forehead. Hubert says he was wearing it the day after Eustace's death, when he mentioned to his wife that he had lost weight and the ring was loose, at which Meg is visibly shocked. The next time he looks towards her from the stand, she is gone.\nA tramp Hubert had been kind to reads about the case; he had previously asked Eustace for help, since Hubert was not at home, but Eustace refused and threatened to have him thrown off the property. He now offers evidence to say that he had seen Eustace by the lake on the night of his death, with no sign of Hubert, but the prosecutor suggests he read about the case and made up his evidence to help Hubert.\nMeg sends for Michael and tells him that Hubert lied about talking to her about the ring. Michael suggests that Hubert lied out of panic at the situation he is in. Meg hopes this is true, but says that although he is usually the kind-hearted person Michael says he is, it is only true when it doesn't impact on him, echoing the scene with the cashier; she says her husband's view is that 'the world is made for Hubert Ware'.\nMeanwhile, the jury brings in a verdict of not guilty. Joyfully celebrating, Hubert goes home, entering by the back stairs to avoid the crowds at the front entrance, where he overhears one of the maids telling another that she believes Meg and Michael are in love and 'eating their hearts out' for each other. This gives him pause to reflect on his own behaviour for once, but he also exhibits a flash of anger, which he quickly controls.\nHe goes to talk to Meg and Michael, and they hear the supportive crowd outside, clamouring to see Hubert. He goes on to the balcony and greets the cheering crowd, then tells the people that he has got away with murder, and can't be retried because of double jeopardy. The crowds subsides into shocked silence. Hubert looks back towards the room where Meg and Michael are, whispers 'Good luck' to them, then takes a suicidal leap from the balcony.\nCast\n*Clive Brook as Sir Hubert Ware\n*Jane Baxter as Lady Meg Ware\n*Barry K. Barnes as Michael Adye\n*C. V. France as Judge\n*Francis L. Sullivan as Attorney\n*Frank Cellier as Skinner - the Jeweller\n*Edward Rigby as Tommy Bold\n* Peter Bull as Eustace Ede\n* Dorothy Seacombe as Mrs. Slade\n* Athene Seyler as Mrs Pinto\n* Elliott Mason as Mrs. Smith - Impatient Juror\n* John Laurie as Henson - the Gamekeeper\n* Wally Patch as Taxi Driver\n* Glen Alyn as Clare\n* Ernest Thesiger as Carter\n* Wallace Evennett as Munnings - the Tailor\n* J.R. Lockwood as Denny - the Butler\n* Peggy Novak as Lucy - the Parlourmaid\n* Alf Goddard as Court Attendant\n* Charles Paton as Foreman of the Jury\nProduction\nThe movie was the second made at Ealing after Michael Balcon took over. Clive Brook wanted to make a film based on The Ware Case and Robert Stevenson was interested in directing; they set up the project at Ealing. Balcon claims the film was profitable.\nCritical reception\nThe New York Times reviewer commented that \"you may find some enjoyment in the film. But this reporter found Sir Hubert such an insufferable snob—even though he was played with velvet grace by Clive Brook—and the turning out of the pseudo-mystery story such a chunk of maudlin claptrap that it stirs him to nothing more fervid than a thoroughly indifferent \"So what?\" And this in spite of the fact that a very good cast does its best\". According to TV Guide it is a \"strong, tense drama with convincing motivations\".\nReferences\nBibliography\n* Low, Rachael. Filmmaking in 1930s Britain. George Allen & Unwin, 1985.\n* Perry, George. Forever Ealing. Pavilion Books, 1994.\n* Wood, Linda. British Films, 1927-1939. British Film Institute, 1986.\nExternal links\n*"
    }
  ]
}