{
  "content": [
    {
      "type": "text",
      "text": "# The Dogs of War (comics)\n\nThe Dogs of War, also known as The Briones Brothers, is a supervillain duo created by Richard Dominguez and published by Azteca Productions. Both characters made a cameo appearance in the conclusion of El Gato Negro #3 (Sept. 1995) and made their first \"full\" appearance in El Gato Negro #4 (June 1997).\nJavier \"Rottweiler\" Briones  and  Jaimé \"Pit-Bull\" Briones are brothers, nephews of South Texas drug lord Boss Ochoa, and therefore the cousins of El Graduado. Both brothers are highly trained mercenaries and assassins who take pleasure in their own brutality.\nPublication history\nWhile their first published appearance is considered to be in El Gato Negro # 4 (June 1997) both characters did make a cameo appearance at the conclusion of the \"Unknown Passing, Unforgettable Return\" storyline from El Gato Negro #3, obscured in shadow. In their first \"full\" appearance it is revealed that both brothers are the owners and proprietors of Briones Entertainment Ltd. recording business, a coherent company of Ochoa Enterprises in Corpus Christi. Just prior to their introduction, Boss Ochoa placed a large contract on El Gato Negro's life, and specifically contacting his nephews to complete the job. El Gato Negro was lured in to an ambush at the Ochoa Civic Center in McAllen, Texas where the vicious Briones brothers nearly beat the hero to death. The Dogs of War were to be featured in the subsequent storyline, \"And now: Relampago!\" but the El Gato Negro series went on hiatus soon after the fourth issue, ending the series in a cliffhanger. There are currently plans to release a graphic novel compilation which will contain the previously unpublished issue.\nFictional character biographies\nJavier and Jaimé Briones are the sons of David \"Spike\" Briones and Mary Helen Ochoa. David, one of Boss Ochoa's most trusted lieutenants, met Mary Helen Ochoa at one of his many beachfront parties. Becoming inseparable, both were married with Boss Ochoa's approval. Obsessed with his sons growing up to become great fighters, David subjected them to brutal training sessions. Jaimé became the more vicious of the two, having to prove himself as the younger sibling. They later found jobs as bouncers at some of the most popular nightclubs in Corpus Christi, including the Ochoa-owned Tejano del Mar. Both attended Del Mar College where they majored in business and management, in order to maintain Briones Entertainment Ltd. They currently operate as mercenaries and Boss Ochoa's personal guards.\nSkills, abilities, resources\nWhile the Dogs of War possess no superhuman abilities, they more than make up for it with an arsenal of weaponry ranging from automatic and semi-automatic weapons, explosives, and combat knives. However, no amount of weaponry can compare to the rush they both feel when in unarmed combat. Both are Gulf Coast Golden Gloves Champions, and often have 5- to 10-minute workouts where they partake in Texas-style Barroom Brawls.\nReferences\nExternal links\n*[http://www.aztecaproductions.com Azteca Productions]\n*[http://www.myspace.com/aztecaproductions Azteca Productions MySpace]\n*[https://web.archive.org/web/20081010014046/http://www.dominguezillustrations.com/ Dominguez Illustrations]"
    }
  ]
}