{
  "content": [
    {
      "type": "text",
      "text": "# The Sino-Japanese War of 1894–1895: Perceptions, Power, and Primacy\n\nThe Sino-Japanese War of 1894–1895: Perceptions, Power, and Primacy is a 2003 non-fiction book by S. C. M. Paine about the first Sino-Japanese War.\nBackground\nThe Sino-Japanese War of 1894–1895 is a follow-up to Paine's previous work, Imperial Rivals: China, Russia and Their Disputed Frontier. The book makes use of contemporary newspapers alongside Chinese and Japanese secondary sources; Paine learned Japanese so that she could analyse these works.\nContent\nThe book analyses the events leading up to, the causes of, and the resulting outcome of the first Sino-Japanese war. Paine argues that the war ended the previous balance of power in East Asia, leading to the decline of the Confucian Qing dynasty, and that it had a lasting impact on Western perceptions of East Asia.\nThe book consists of three sections, and an epilogue. The first section discusses the events leading up to the war, the second section looks at the war from a military perspective, and the third section examines the post-war negotiations and settlements.\nReception\nThe China Review International described Paine's arguments as \"well-constructed, researched and argued\", and recommended the book for \"anyone with an interest in the events and region in which the Sino-Japanese war took place and especially for those with a professional interest in the topic.\" However, they noted that the book claims that the Guangxu Emperor died the day after Empress Dowager Cixi, which they suggested was inaccurate, as it is contrary to most accounts, who say that the emperor died one day before Cixi.\nThe International History Review called The Sino-Japanese War of 1894–1895 \"an important book that delights and informs\", giving particular praise to the book for bringing attention to the Chinese concept of face (guanxi), something which previous authors had neglected, and went on to suggest that Paine \"ends the shortage of books on this pivotal war\". This was seconded by The Journal of Military History who praised Paine's \"multi-faceted approach to true international history\", saying that she had exhausted all of the English-language sources on the subject, and that \"In responding to Marius B. Jansen's call for a thorough historical treatment of one of the yawning gaps in East Asian history, Paine's history of the Sino-Japanese War of 1894–95 succeeds admirably.\"\nReferences"
    }
  ]
}