{
  "content": [
    {
      "type": "text",
      "text": "# The Walking Dead: The Ride\n\n| status               = Operating\n| opened               =  (X:/ No Way Out)  (The Walking Dead: The Ride)\n| soft_opened          =\n| year                 = 1996\n| closed               =\n| cost                 =\n| previousattraction   =\n| replacement          =\n| type                 = Coaster, Haunted attraction\n| type2                =\n| type3                =\n| manufacturer         = Vekoma\n| manufacturerarticle  =\n| designer             = Vekoma\n| model                = Enigma\n| track                = Modified Enigma\n| lift                 = Drive tire lift hill\n| height_ft            = 41.7\n| height_m             =\n| drop_ft              = 33\n| drop_m               =\n| length_ft            = 1312.3\n| length_m             =\n| speed_mph            = 30\n| speed_km/h           =\n| inversions           = 0\n| duration             = 2:10\n| angle                =\n| capacity             = 700\n| acceleration         =\n| acceleration_from    =\n| acceleration_mph     =\n| acceleration_km/h    =\n| acceleration_in      =\n| gforce               = 3.0\n| restriction_ft       =\n| restriction_in       =\n| restriction_cm       = 140\n| trains               = 5\n| carspertrain         = 5\n| rowspercar           =\n| ridersperrow         = 2\n| custom_label_1       = Trains\n| custom_value_1       = 5 trains each containing 5 cars. Riders are seated 2 across in 1 row per car, for a total of 10 riders per train.\n| virtual_queue_name  = Fastrack\n| virtual_queue_image = Merlin Entertainment Fastrack availability.svg\n| virtual_queue_status= available\n| virtual_queue_name2 =\n| virtual_queue_image2=\n| virtual_queue_status2=\n| single_rider         = available\n| accessible           = available\n| transfer_accessible  = available\n| assistive_listening  =\n| cc                   =\n| theme                =\n| website              =\n| rcdb_number          = 846\n| video                =\n| videosize            =\n| videocaption         =\n}}\nThe Walking Dead: The Ride (formerly known as X:\\ No Way Out and X) is an enclosed roller coaster haunted attraction located at Thorpe Park, England. It was the park's first non-powered roller-coaster. It was themed around a rave and had the strapline \"Ride on a wave of light and sound\" — when it was titled X — but currently The Walking Dead: The Ride's slogan is \"Those who ride, survive\".\nThe X roller coaster combined a variety of lights, lasers and music with a completely indoor ride circuit, featured inside a large blue and terracotta pyramid structure.\nOn 1 December 2017, plans to drastically change the entrance of the attraction were filed. The name \"X:\\ NWO WD\" written on the documents sparked rumours of a The Walking Dead re-theme.\nOn 20 February 2018, it was announced that the ride was to become The Walking Dead: The Ride. On 27 March 2018, Thorpe Park announced that the ride would open on 31 March 2018.\nThe ride (Along with Derren Brown's Ghost Train: Rise Of The Demon) was closed during the 2020 season due to the COVID-19 pandemic. This was due to the inability to social distance with the attraction being indoors. It re-opened for the 2021 season on 17 May.\nHistory\nThe ride opened as X:\\ No Way Out on July 1, 1996, as Thorpe Park's first non-powered roller coaster. It was marketed as the \"world's first backwards roller coaster in the dark\" and featured an elaborate queue system through multiple interactive themed rooms, such as a trommel tunnel, \"decontamination\" area and illusionary rooms. The ride was themed to, and starred, a computer virus that infected the power supply of Thorpe Park, thus sending the trains backward. The ride's cyberpunk theme was drastically toned down after the 2001 season when most of the interior rooms became disused, and many in-ride effects removed. In March 2013 the ride underwent further significant changes, which removed the remnants of the computer horror theme and shortened its name simply to 'X'. The trains were refurbished by Vekoma to now run forwards, to resolve the common issue of motion sickness. The addition of lighting and lasers from 2013 onwards removes the pitch black darkness that riders originally rode in. In the exit queue line, there was a 5&nbsp;ft-long model of an Eveready AA battery labelled 'Thorpe Park Power Supply'; this was removed in 2013.\nThe ride layout has also had many features removed since its opening. There is an on-ride photo camera which allowed riders to purchase their on-ride photo; this was removed in 2005 and replaced in 2019. The lift hill of the ride had multi-coloured flashing LED light strips added in 2000; these were removed in 2013.\nMusic\nIn 2013 the ride was given an original soundtrack to accompany the new lights and lasers, this was removed in 2014 and was replaced with a playlist of dance music. In 2016 the selection of songs was updated. In June 2017 the dance music was removed from the ride and area and the ride was given a new original soundtrack, this time composed by IMAscore and in the style of an upbeat electronic version of the park's new 'Island Theme', the queue line retained the music used before.\nAs part of the ride's refurbishment into The Walking Dead: The Ride in 2018, a new soundtrack, also by IMAscore, was used alongside a version of The Walking Dead's main theme music.\nRide experience\nAs X:\\ No Way Out and X\nRiders entered the queue line inside the pyramid and proceeded down a long and narrow corridor with neon lights and lasers in the ceiling. Dance music played throughout the corridor. After a segment of switchback queue line, riders entered the station.\nThe train exited the station into a tight right hand turn that leads up onto the lift hill. After reaching the top of the hill, the train plummeted down at speeds of up to  into various helixes and tight turns. While the ride negotiated its circuit, there were bright multi-coloured disco lights and laser effects combined with an upbeat electronic dance remix of the park's 'Island Theme', composed by IMAscore. Once the ride reached the end of the circuit the train arrived at an exit platform where riders disembarked, before collecting their belongings and heading outside into daylight.\nAs The Walking Dead: The Ride\nRiders enter through a themed queuing system, including a watchtower built specifically for the re-theming of the ride. They are led into a small room where a man on a screen begins asking them three questions, and a voice from a speaker answers them. Sound effects and a screen at the back of the room suggest that something is trying to break into the room. This cuts the questioning short and alerts everyone to a zombie breach (From Mid-Fright onwards, more sound effects were added to the pre-show. Why they decided to keep it is most likely due to the scares it ensues). The man instructs the riders to make their way to the loading zone. A door opens automatically, which leads the riders through narrow corridors covered with red flashing lights and \"blood\" smeared on the walls. Riders emerge in the loading room with loud music and a loud air horn sounding at regular intervals. Riders are batched into pairs and board the train which then proceeds upwards on a tire drive lift. After a drop and some twists and turns, the ride comes to a stop and the man from the initial video complains that he cannot start the vehicle again. The ride uses the block section of the track to simulate the effect of the train starting and failing several times, with accompanying sound effects to build the tension. Eventually, the train starts moving again. After some more twists and turns, the train reaches the end of the circuit, and riders are instructed to get off the ride and go through the famous \"DONT OPEN DEAD INSIDE\" doors. During on-peak days, actors (who can be either survivors or zombies) can scare the crowd of people and chase them briefly down the corridor to the end.\nFeatures\nBrake Runs\nThroughout the ride, there are three mid-course brake runs. Originally, while the ride was X:\\ No Way Out, these would stop the train for a few seconds while misters sprayed above the riders' heads (these were removed by 2013) and sound effects were played through speakers, to disorientate the riders. On the third brake run, the train moved backwards (although from a rider's point of view, it moved forwards, since the trains were reversed) by a few metres before being propelled forwards. Also on this third brake run, since the ride was refurbished in 2007, two of the robot mannequins from the old queue line were positioned on the brake run and lit up to give the riders a surprise. These were removed a few weeks into the 2013 season. Later, the brake runs simply allow the trains to run through the circuit without stopping.\nAs The Walking Dead: The Ride, the brake runs stop the train once again at a certain point but have been modified to make the train jolt forward unexpectedly for a dramatic effect.\nSafety\nSince becoming The Walking Dead: The Ride, the ride's minimum height was increased from 1.2m to 1.4m, although the ride and its restraints have not changed in any way to merit this; the change is to assist with the recommended age restriction of 13+.\nBoth seats in a row must be occupied as the design of the restraints mean that a lone rider in a row could slide out. Where feasible, a live actor \"zombie\" will fill empty spaces and attempt to scare their seat neighbour as the ride goes around, particularly at the on-ride photo.\nAccident\nOn 6th of June 2000, Surrey Ambulance Service received a report that a passenger had fallen in excess of 20 feet from the ride. A boy was ejected from the train when it stopped on one of the block brakes. Rather than being caused by a ride fault, it was believed the boy managed to stand up. He sustained lacerations to both shins and a minor head injury.\nReferences\nExternal links\n* [http://www.totalthorpepark.co.uk/guide/x.shtml X at Total Thorpe Park]\n* [http://www.themeparks-uk.com/thorpe-park-guide/rides/x-no-way-out.html X:\\No Way Out at ThemeParks-UK]"
    }
  ]
}