{
  "content": [
    {
      "type": "text",
      "text": "# The Last Crusade (My Little Pony: Friendship Is Magic)\n\n| length         = 22 minutes\n| guests         = *Jackie Blackmore as Aunt Holiday\n*Saffron Henderson as Auntie Lofty\n*Bill Newton as Snap Shutter\n*Emily Tennant as Mane Allgood\n*Zach LeBlanc as Skeedaddle\n*Cole Howard as Terramar\n| prev           = Student Counsel\n| next           = Between Dark and Dawn\n| season_article = My Little Pony: Friendship Is Magic (season 9)\n| episode_list   = List of My Little Pony: Friendship Is Magic episodes\n}}\n\"The Last Crusade\" is the twelfth episode of the ninth season of animated children's television series My Little Pony: Friendship Is Magic as well as 207th episode overall. Directed by Denny Lu and Mike Myhre and written by Nicole Dubuc, in the episode, Snap Shutter and Mane Allgood, who study exotic wildlife and are Scootaloo's parents, come home. Despite being overjoyed by their return, Scootaloo soon finds her parents plan to take her with them as they move to Shire Lanka for their work. Desperate, the Crusaders devise several strategies to keep Scootaloo in Ponyville. The episode premiered on Discovery Family on June 15, 2019, and garnered recognition and acclaim as the first Friendship Is Magic episode to feature homosexual characters.\nPlot\nWhile the Cutie Mark Crusaders—Apple Bloom, Scootaloo, and Sweetie Belle—are hanging out at Scootaloo's house, she gets a postcard saying that her parents, Snap Shutter and Mane Allgood, are coming home. Snap and Mane travel widely for their work studying exotic wildlife, which others believe to be \"impossible\", and Scootaloo is often left in the care of her aunts Holiday and Lofty, among others. Although initially excited to see them, Scootaloo becomes dismayed when her parents tell her of their plans to take her with them as they relocate to Shire Lanka. The desperate Crusaders come up with various plans to help Scootaloo stay in Ponyville, but Snap and Mane sell their house and continue to make preparations to move. Their ideas include: creating a make-believe beast for her parents to study instead, which fails due to Apple Bloom and Sweetie Belle falling out of its costume; showing that they are an inseparable trio with their near-identical cutie marks, which does not succeed as Snap notices features that distinguish them; binding themselves together with magic, which lacks success as they find it hard to walk; and chaining themselves to the house's \"For Sale\" sign, which proves unsuccessful as the sign is quickly moved.\nEventually, Scootaloo and the Crusaders take a train to her aunts' houses as a trip to Shire Lanka is only available once a month, meaning her parents will have to leave without her or risk missing the train. During the visit to Holiday and Lofty, they learn that they helped Lofty to break through her creative block, inspiring her to make a Crusaders-themed quilt. Upon the Crusaders' return to Ponyville, Scootaloo brings her parents to a town-wide celebration of the former group. Snap and Mane allow Scootaloo to stay in Ponyville, recognizing the importance of her work with the Crusaders. Holiday and Lofty decide to move to Ponyville so they can look after Scootaloo.\nBackground\ncharacters through Aunt Holiday and Auntie Lofty.|alt=Nicole Dubuc smiling while holding her Writers Guild Award with her left hand]]\n\"The Last Crusade\" received recognition for being the first Friendship Is Magic episode to feature homosexual characters: Aunt Holiday and Auntie Lofty are lesbians. The characters first appeared in the My Little Pony book Ponyville Mysteries: Riddle of the Rusty Horseshoe. Michael Vogel, a writer and producer of the show, denied any hints that the two might be sisters, leading to fans labeling them as a couple. Vogel later confirmed that they were a \"cute couple\". The Friendship Is Magic fandom has also commonly shipped same-sex couples.\nLater, Vogel and showrunner Nicole Dubuc came up with the idea of introducing a lesbian couple to the series with the aunts and Hasbro approved. According to Julie Duffy of Hasbro, after highlighting various types of families in the series over its nine seasons, they hoped to \"help [...] provide kids and fans from all backgrounds an opportunity to identify with our characters and learn from their stories\".\nCultural reference\nThe episode's title is a reference to the 1989 film Indiana Jones and the Last Crusade, directed by Steven Spielberg.\nBroadcast\nPrior to its airing on June 15, 2019, in the United States on Discovery Family, the episode aired in Europe. Coincidentally, the episode aired during PRIDE Week in the United States. On Treehouse TV, June 23, 2019, in Canada.\nReception\nAccording to Yahoo!, \"many [...] have commended the show for its inclusivity.\" Romper listed Friendship Is Magic one of the \"20 Amazing Shows With LGBTQ+ Characters To Watch With Your Kids\" because of Aunt Holiday and Auntie Lofty. Similarly, The Globe and Mail featured the show as one of its parents' picks in \"family programs that showcase LGBTQ+ representation\". According to Jackie Blackmore, who voices Aunt Holiday, she has received an \"explosion of love\" from fans, including being given artworks.\nAustralian conservative political activist Lyle Shelton objected to the decision to make the characters lesbian, however. On Twitter, he stated: \"It's a brave new world folks & we need to push back while we can. Sitting outside politics is no longer an option for conservatives.\"\nReferences\nExternal links\n*"
    }
  ]
}