{
  "content": [
    {
      "type": "text",
      "text": "# The Word Bible Software\n\n|latest release version     = Version 7.1.0.1574\n|latest release date        =\n|operating system           = Windows 98, Me, 2000, XP, Vista, 7, 8, 10, 11.\n|platform                   =\n|size                       = 6MB (binary only) 50MB (Main English package)\n|language                   = English, Afrikaans, Albanian, Brazilian Portuguese, Bulgarian, Catalan, Chinese, Czech, Danish, Dutch, Finnish, French, German, Greek, Hungarian, Italian, Malay, Polish, Romanian, Russian, Slovak, Spanish, Thai\n|genre                      = Bible Study Tools\n|license                    =\n|website                    =\n}}\ntheWord (previously known as In The Beginning Was The Word) is a free Bible study software application for Microsoft Windows.  It was first released in 2003 and developed by Costas Stergiou. It offers Bibles, commentaries, dictionaries, general books, maps, search capabilities, and support for Bibles in several languages.\nFeatures\ntheWord supports the following features:\n* Ability to quickly search through Bible texts and annotations\n* Support for non-Bible resources (commentaries, dictionaries, generic books)\n* Compare/Parallel view\n* Ability to create and edit complete user modules of any kind (dictionary, commentary, maps, etc.)\n* Cross references (either embedded in Bible texts, or user defined)\n* Hyperlinking in modules to Bibles, internal locations, or other modules\n* Clipboard to display the text of copied verse references\n* Inline commentaries and word lookup dictionaries\n* Support for right to left languages\n* Support for Strong's Numbers, Greek morphological codes, and numerous other viewer options\n* Support for footnotes\n* Support for non-Bible documents (commentaries, dictionaries, generic books)\n* Greek and Hebrew support\n* Library search capabilities\n* User markups and highlighting\n* Verse lists\n* Support for purchasing copyrighted, priced modules\nVersion history\n* Version 1.0: First non-beta release, Clipboard Monitor feature introduced\n* Version 1.1: Ability to print Bible texts and personal notes, and export personal notes in various formats\n* Version 1.2: Improved Greek support in non-Greek environments\n* Version 2.0: Multiple Bible windows, Bible text formatting, dockable windows and layouts\n* Version 3.0: Integration of non-Bible resources with search capabilities, priced copyrighted modules, user-created modules\n* Version 4.0: New program icon, first alpha implementation of hybrid modules (books and commentaries), new default tw4 theme\n* Version 5.0: Integrated module downloader (ability to browse and install any module directly from within theWord without downloading the modules separately from the official site).\n* Version 6.0: Spell Check for user-created modules and enhancement of search capabilities\nImporter tool\ntheWord Importer Tool is used for importing  Unbound Bible, Zefania XML, and free e-Sword modules and using them in theWord. The Importer Tool does not allow importing of modules purchased from e-Sword.\ntheWord Portable\ntheWord portable is a portable version of theWord that can be installed to a USB flash drive. The installer is included in the main installer of version 3.0, which gives the option of installing as portable.\nReferences\nExternal links\n*"
    }
  ]
}