{
  "content": [
    {
      "type": "text",
      "text": "# The Queen Bee\n\n\"The Queen Bee\" is a German fairy tale collected by the Brothers Grimm in Grimm's Fairy Tales (KHM 62). It is of Aarne-Thompson type 554 (\"The Grateful Animals\").\nSynopsis\nTwo sons of a king went out to seek their fortunes, but fell into disorderly ways. The third and youngest son, Simpleton, went out to find them, but they mocked him. They travelled on, and Simpleton prevented his brothers from destroying an ant hill, killing some ducks, and suffocating a bee hive with smoke. Then they came to a castle with stone horses in the stable, and no sign of anyone. They searched around the castle and found a room with a little gray man, who showed them to dinner. In the morning, he showed the oldest son a stone table, on which were written three tasks. Whoever performed them would free the castle.\nThe first task was to collect the princess's thousand pearls, scattered in the woods. Whoever tried and failed would be turned to stone. Each of the older brothers tried and failed, and they were turned to stone. For the youngest, however, the ants collected the pearls. The second task was to fetch the key to the princess's bedchamber from the lake, which the ducks did for him. The third task was to pick out the youngest princess from the three sleeping princesses who looked exactly alike; the only difference was that the oldest had eaten a bit of sugar before she slept, the second a little syrup, and the youngest some honey. The queen bee picked out the youngest.\nThis woke the castle, and restored those who had been turned to stone. The youngest son married the youngest princess, and his two brothers, the other princesses.\nVariants\n, 1882]]\nThe tale The Enchanted Princess by Ludwig Bechstein is quite similar to this one. Unlike in Grimm's tale there are only two brothers instead of three, called the eldest Hellmerich and the youngest Hans, who are the sons of a leather craftsman instead of a king. In the castle the person who tells them the tasks they need to accomplish to break the spell is not a dwarf but an old woman. Instead of three enchanted princesses, there's only one, that the brothers have to identify among three figures covered in veils. The other two figures are dragons working for the sorcerer that enchanted the princess.\nIn a literary treatment of a Languedoc variant, by Samuel Jacques Brun (How young Anglas became a Marquis, or the Story of the Ducks, the Ants, and the Flies), a young peasant named Anglas arrives in Paris after a multitude of young men that have been in the city in the past month to recover the key to the king's treasury, in exchange for marrying the princess. Anglas succeeds thanks to a duck's assistance after he promised not to hurt her ducklings. Soon after, he receives the help from ants and flies and ends up marrying the princess and becoming a marquis.\nIn popular culture\nThe plot of the episode \"Beeware\" from the television series Grimm focuses on elements of the fairy tale.\nThe first segment of Princes et Princesses seems to be based on this tale; like in the tale a young man has to collect all the princess' pearls to break her curse, he succed thanks to the ants who help him after that he prevented his companion from hurting them.\nSee also\n*Ferdinand the Faithful and Ferdinand the Unfaithful\n*Sleeping Beauty\n*The Glass Coffin\n*The Grateful Beasts\n*The Two Brothers\nReferences\nFurther reading\n* Paulme, Denise; Seydou, Christiane. \"Le conte des «Alliés animaux» dans l'Ouest africain\". In: ''Cahiers d'études africaines, vol. 12, n°45, 1972. pp.&nbsp;76–108. [DOI: https://doi.org/10.3406/cea.1972.2773]; www.persee.fr/doc/cea_0008-0055_1972_num_12_45_2773\nExternal links\n*\n*\n* |noitalics=true}}"
    }
  ]
}