{
  "content": [
    {
      "type": "text",
      "text": "# The Other Queen\n\nThe Other Queen is a 2008 historical novel by British author Philippa Gregory which chronicles the long imprisonment in England of Mary, Queen of Scots. The story is told from three points of view: Mary Stuart, Queen of Scots; Elizabeth Talbot, Countess of Shrewsbury, also known as Bess of Hardwick; and George Talbot, the 6th Earl of Shrewsbury.\nAccording to Gregory, \"The Other Queen has been a wonderful book to research and write – I have quite transformed my view of Mary Queen of Scots and to research Bess of Hardwick, her rival and gaoler, has been enormously interesting.\"\nPlot\nMary Stuart, cousin to Queen Elizabeth, has fled to England after she has lost the support of the Scots after marrying Bothwell, whom the people believe murdered her second husband, Henry Stuart, Lord Darnley. She has left her son in Scotland in the hands of the Protestants and expects her cousin to restore her to her throne. Secretly, however, Mary recognizes herself as Queen of Scotland (since she was born to it), France (since she married to it), and England (since Elizabeth's paternity and her mother's marriage to her father is questionable). As Mary plots to overthrow Elizabeth,  Elizabeth puts her in the custody of George Talbot and his wife, Bess of Hardwicke, in response to Mary's repeated attempts to claim the English throne. Mary is indignant at the captivity, repeatedly stating her royal status, and is upset when she is given some of the reigning queen's gowns to wear, saying that they are \"hand-me-downs.\" She is unafraid of punishment for any reckless or insulting behavior she makes to her cousin, believing that one would never execute a fellow monarch. Most of the novel centers around the first few years of Mary's Stuart's imprisonment, during which time she makes several failed escape attempts and almost immediately begins to seduce the earl. George slowly begins to feel his loyalty to Elizabeth fade, replaced by a strong attachment to the captive queen. This results in marital problems with Bess, who ultimately separates from him.\nThe last chapter takes place fifteen years after the previous one. It is narrated by Bess, who reveals that Mary has recently been executed for participating in a plot to steal the throne of England. George watched the beheading in tears and was bankrupt from the years of expense to house her. Bess ends the book saying that she is well off, wealthy and prosperous, and that her granddaughter Arbella is an heir to the English throne. (However, this claim was not acknowledged, and Mary's son James I was crowned after Elizabeth's death in 1603.)\nCritical reception\nAudioFile magazine praised the narrators of the audiobook recording (Dagmara Dominczyk as Mary, Graeme Malcolm as George and Bianca Amato as Bess), writing:\n}}\nReferences\nExternal links\n*"
    }
  ]
}