{
  "content": [
    {
      "type": "text",
      "text": "# The Art of Asking Your Boss for a Raise\n\nThe Art of Asking Your Boss for a Raise}} is a book by French writer Georges Perec (1936–1982). In 2011, publishing house Verso Books published a translation into English by David Bellos.\nThe original idea by Perec consists of:\n* a longform text that consists of a single grammatical sentence in the second person plural, without punctuation, published in 1968 under the title ''L'art et la manière d'aborder son chef de service pour lui demander une augmentation;\n* a 6-part radio play written by Perec in collaboration with his German translator, , and broadcast by Saarländischer Rundfunk in 1969 under the German title Wucherungen;\n* a 6-character play titled L'augmentation,  which premiered on 26 February 1970 at the Théâtre de la Gaîté-Montparnasse in Paris, directed by .\nPublishing history\nAccording to Bellos, who also wrote the prologue to the 2011 edition, the text was first published in December 1968 in issue 4 of journal Enseignement programmé'' (Hachette Livre), an academic review devoted to what was then called Programmed Learning, or computer-assisted education. The source text is based on a formal flowchart drawn up by , a researcher at the Computing Service of the Humanities Research Centre in Paris. Perriault came up with the idea to challenge an artist to write within a constraint that approximated the limitations of a computer's operations, that is, following or imitating a series of algorithms.\nAround the time of its first publication, Perec was asked by his German translator, , if he might come up with something suitable to broadcast on the radio. This became the radio play Wucherungen, broadcast by Saarländischer Rundfunk on 12 November 1969. The radio play was rebroadcast by Saarländischer Rundfunk on 9 September 1970, 16 October 1983, and possibly later. It was also broadcast by Westdeutscher Rundfunk on 27 January 1970 and 18 June 1981.}} The huge success of this radio play prompted requests for more material.\nFor instance, in 1973, a slightly abridged version was published in journal Communications et langages. Then, in 1981, Hachette published the play ''L'Augmentation as part of its P.O.L. collection, along with the play La Poche Parmentier, in the book Théâtre I. La Poche Parmentier précédé de l'Augmentation.\nIn November 2007, while working on the Spanish translation of L'Augmentation'', Pablo Moíño Sánchez found a copy of the 1967 edition at the . Thanks to this discovery, Hachette Livre was able to publish a new edition of the text in its original language, this time as a book, in November 2008.\nStructure\nAccording to the language used by the OuLiPo group, the structure of these texts, based on the exhaustive description of all possible paths in a flowchart and with almost no progression in the events, corresponds to an \"anti-arborescence\", contrary to the \"arborescent stories\" that, in accordance to graph theory, seek to bifurcate events as much as possible, based on the consequences generated by the multiple possible alternatives. An example of Oulipo's independent arborescent stories are children's books in the Choose Your Own Adventure series.\nPerec also used a similar structure in other texts, such as ''81 fiches-cuisine à l'usage des débutants (in Penser/Classer, Hachette Livre, 1985 ), Deux cent quarante-trois cartes postales en couleurs vèritables (in L'Infra-ordinaire, Éditions du Seuil, 1989, ), and Exemple d'anagramme saturé (in Atlas de littérature potentielle, Éditions Gallimard, 1988, ).\nL'Augmentation theater play\nThis play—the full title of which is L'Augmentation (ou Comment, quelles que soient les conditions sanitaires, psychologiques, climatiques, économiques ou autres, mettre le maximum de chances de son [sic] côte en demandant à votre chef de service un réajustement de votre salaire)''—corresponds to the exhaustive description of a flowchart portraying various obstacles through which the employee of a company he has served for many years must pass in order to be able to meet with his department head and, unsuccessfully, ask him for a pay raise.\nThe characters in the play are not the individuals spoken about, such as the employee, his boss, and the latter's secretary, but rather the various components of the diagram, namely:\nIn addition, a character named Rubéole appears, which precisely represents this disease, mentioned in certain parts of the diagram.\nThe diagram that gives structure to the play is a simplified version of the one drawn in the book, which is in turn the one described in The Art and Craft of Approaching Your Head of Department to Submit a Request for a Raise.\nTheatrical performances\nin Paris, where the play was first performed in 1970.]]\nThis play was first performed on 26 February 1970 at the Théâtre de la Gaîté-Montparnasse in Paris, directed by . The cast was as follows:\n* Marcel Cuvelier: The proposal\n* Oliver Lebeaut: The alternative\n* Monique Saintey: The positive hypothesis\n* Frédérique Villedent: The negative hypothesis\n* Yves Peneau: The choice\n* Thérèse Quentin: The conclusion\nThe rubella character was replaced by a voice-over, played by Danielle Lebrun. A recording of these performances was broadcast on France Culture radio on 5 March 1972 under the title , along with other radio works by the writer.\nCritical acclaim for the premiere was understated, but it achieved greater success at its revival in January 1981, at the Théâtre de la Comédie in Saint-Étienne, and for a three-month season starting in February 1982 at the Théâtre de la Huchette in Paris. Since then, the play has been staged by various theatre companies in France and abroad.\nIn German, it was directed by Anette Spola under the title Die Gehaltserhöhung, and premiered at the Theater am Sozialamt in Munich in November 1972. It was then performed in Münster, Wiesbaden, and other cities between February and June 1973.\nIn April 1988, playwright Sergi Belbel translated and staged a version in Catalan, with a minimalist staging and the title ''L'augment, at the Institut del Teatre in Barcelona.\nTwo years later, Enrico Groppali translated it into Italian as L'Aumento'', and under the direction of Alessandro Marinuzzi it was staged in Udine and Trieste in 1990, and in Milan in May 1991. Between October and December 1991, Magnus Hedlund's Swedish version Löneförhöjningen was presented in Stockholm, directed by .\nAround the year 2000, Jesús Díez staged the play once again in Catalan, but this time using a baroque, Brechtian aesthetic that played with farce and clown elements. The production was staged at , and featured performances by, among others, actors  and Carles Sales, the latter playing the characters of \"The conclusion\" and Perec himself.\nThe play was translated into Spanish by Argentine director Carlos Mathus in 2001 with the title El aumento de sueldo. He directed and staged it that same year at  in Buenos Aires. A few years later, the play was staged in Chile by director Carolina Sagredo. The adaptation consisted of a monologue performed by José Soza with music by Andrés Núñez, thanks to funding by FONDART. After more than a year of rehearsals, it premiered with fourteen performances, between 18 March and 10 April 2016, at the Centro Cultural Matucana 100.\nThe longform text\nThis text follows the same plot of the play, but describes a longer outline. It is not written as a theater play, but rather as a long text without any punctuation marks. Nevertheless, the same idea is maintained of describing first a proposition, then the two possible alternatives, the positive and negative hypotheses, and finally the choice and its corresponding conclusion, thus starting again with a new proposition of the scheme.\nInterspersed throughout the text are eleven drawings that are related to the plot, some of which are repeated: a woman, a clock, a fish, some girls, an egg, a man, a woman, an egg, a man, a fish, and a clock.\nAccording to Bellos:\nfor the Bull computer company and then amended by Perec before he began to write out his text.}}\nAnalysis of the works\nJesús Camarero described these texts as a \"combinatorial drama.\" The bureaucracy that exists in large companies and, in particular, the difficulties that an employee has to go through to obtain a meeting with his boss and be able to ask for a salary adjustment, are not exclusive to these two works by the author. Perec also deals with this subject in the story of the Réol family in his novel ''Life: A User's Manual. Because of their subject matter, these texts have also been associated with the article Vuelva usted mañana, written in the 19th century by Mariano José de Larra. Journalist Eric Libiot, writing for L'Express'', highlights Perec's ability to raise the subject of a pay rise to the level of an act of political art:\n|author=Eric Libiot|source=''L'Express (20 November 2008)}}\nAccording to theater critic ,  in her essay Comment fonctionne la machine? (1970), both Perec and Cuvelier said of L'ugmentation'' that the six actors represent the machine, but its efficiency lies in formulating, in its breakdown, all the thoughts that run through the head of a man; here, a man who is going to ask for a raise. The play can represent the duration of a life or the duration of a thought, that of a man imprisoned by a bureaucratic system, by a hierarchy, a man who knows that he can do nothing against that abstract force that denies his existence. The human element: despair or resignation, ends up ripping apart the machine.\nIn this sense, Cuvelier relates the confrontation with power present in these texts to the work of Franz Kafka and his mathematical games without a practical purpose, and to the work of Lewis Carroll. The hesitations that never lead to the set goal, as well as the \"merciless humour,\" for their part, link them to the work of Anton Chekhov.\nThe notion of \"increase,\" which appears in the titles of both texts, is developed in three different ways: from a financial (wage increase), rhetorical (grouping of arguments to arrive at a consequence), and mathematical (combinatorial recursion) point of view.\nNotes\nReferences\nBibliography\n*\n*\n*\n*\n*\n*\nBy other authors\n*\n*\n*\n*\nExternal links\n* [https://archive.wikiwix.com/cache/index2.php?url=http%3A%2F%2Fwww.lintermede.com%2Ftheatre-augmentation-georges-perec-guichet-montparnasse-oulipo.php#federation=archive.wikiwix.com&tab=url L'art de la manière, façon Perec], a review of the play ''L'augmentation''"
    }
  ]
}