{
  "content": [
    {
      "type": "text",
      "text": "# The Kings of the World\n\n| image          = The Kings of the World poster.jpg\n| caption        = English-language film poster\n| director       = Laura Mora Ortega\n| writer         = Maria Camila AriasLaura Mora Ortega\n| producer       = Cristina GallegoPaz LázaroElisa Fernanda PirirRegina SolórzanoMirlanda Torres\n| starring       = Carlos Andrés CastañedaDavison FlorezBrahian AcevedoCristian CampañaCristian David Duque\n| cinematography = David Gallego\n| editing        = Sebastian HernandezGustavo Vasco\n| music          = Leonardo HeiblumAlexis Ruiz\n| studio         = Caracol TelevisiónCiudad Lunar ProduccionesDago García ProduccionesIris ProductionsTu Vas Voir ProductionTalipot StudioMer Films\n| distributor    =\n| released       =\n| runtime        = 103 minutes\n| country        =\n| language       = Spanish\n| budget         =\n}}\nThe Kings of the World () is a 2022 drama road movie co-written and directed by Laura Mora Ortega. Set in Medellín, the drama is about five teenage friends who live on the streets. As a result, they leave a Colombian city to start over in the countryside. The film premiered in September 2022 at the 70th San Sebastián International Film Festival where it won the Golden Shell for Best Picture.\nSynopsis\nRá, Culebro, Sere, Winny and Nano live on the streets of Medellín. The five children no longer have any contact with their families. They form a kind of fraternal clan in which they have to make their way in a parallel world without laws. In doing so, they uphold ideals such as friendship and dignity, but also display disobedience and resistance. In a dangerous journey between delirium and nothingness, the group leaves the city and enters the depths of the Colombian interior. There they hope to find a piece of land that Rá inherited from his late grandmother. Like thousands of other Colombians, she was once violently expelled by the paramilitaries. After her death, Rá received the \"promised land\" through a government restitution program. The boys make friends that help them advance but also warn them of the dangers of their company. They also meet sex workers who provide them with short-term maternity care.\nCast\n* Carlos Andrés Castañeda as Rá\n* Davison Florez as Sere\n* Brahian Acevedo as Nano\n* Cristian Campaña as Winny\n* Cristian David Duque as Culebro\nRelease\nFestivals\nThe Kings of the World premiered on 21 September 2022 at the 70th San Sebastián International Film Festival. The work was previously screened to international distributors at the 2022 Toronto International Film Festival, along with ten other critically acclaimed films. Other invitations followed in the film festival programs of Zurich (September) and Chicago (October).\nTheatrical\nThe film was theatrically released in Colombia on 13 October 2022, with opening attendance figures below expectations (28,117 admissions throughout the first 5 days of its theatrical run).\nInternational\nOn October 24, 2022, Netflix acquires the film for distribution in the Americas (except Colombia-Mexico). It premiered on the platform on January 4, 2023. Bteam Pictures will distribute in theaters in Spain.\nReception\nCritical reception\nAccording to the review aggregation website Rotten Tomatoes, The Kings of the World has a 96% approval rating based on 27 reviews from critics, with an average rating of 8.2/10. The site's consensus reads, \"Journeying between lyricism and brutal reality, The Kings of the World is a hopeful trip towards freedom away from the city where it cruelly dead ends\".\nCristóbal Soage of Cineuropa praised the film as an \"extraordinary work\" and the director Mora \"as one of the greatest talents on the modern Latin American film scene,\" as well as the young actors of the same name. It is \"a hallucinogenic story as cruel and painful as it is fascinating\". He also raved about David Gallego's camera work, which captures \"the poignant beauty of the Colombian jungle [...] in all its splendor.\" Soage described the scenes between the boys and the sex workers as \"particularly moving\". \"In the end, we feel that we have witnessed an important work, a portrait of a time and place as comprehensive and precise as it is poetic and moving,\" says the critic.\nGuy Lodge (Variety) saw a \"raw, offbeat coming-of-age drama\" that transcends the sentimentality that tends to dominate the genre \"with a delirious, even surreal energy in its five-story Medellin street children\".\nAccolades\nFor The Kings of the World, Laura Mora won the Golden Shell at the San Sebastián International Film Festival, as well as the Feroz Zinemaldia Prize and the SIGNIS Prize from the World Catholic Association for the communication. It has also been invited to international feature film competitions at the Zurich and Chicago festivals.\n{| class=\"wikitable\"\n!Year\n!Award\n!Category\n!Recipient\n!Result\n!Ref.\n|-\n| rowspan=\"10\" |2022\n| rowspan=\"3\" |70th San Sebastián International Film Festival\n|Golden Shell\n| rowspan=\"3\" |Laura Mora Ortega\n|\n| rowspan=\"3\" |\n|-\n|Feroz Zinemaldia Award\n|\n|-\n|SIGNIS Awards\n|\n|-\n| rowspan=\"2\" |Oslo Films from the South Festival\n|Silver Mirror Award - Best Feature\n| rowspan=\"3\" |The Kings of the World\n|\n| rowspan=\"2\" |\n|-\n|Silver Mirror Award - Honorable Mention\n|\n|-\n|11st International Film Festival of Panama\n|IFF Panama - In Competition\n|\n|\n|-\n| rowspan=\"2\" |58th Chicago International Film Festival\n|Silver Hugo - Best Production Design\n|Marcela Gómez Montoya & Daniel Rincon\n|\n|\n|-\n|Gold Hugo - Best Feature\n| rowspan=\"6\" |The Kings of the World\n|\n|\n|-\n|Warsaw International Film Festival\n|Crème de la Crème Award\n|\n|\n|-\n|18th Zurich Film Festival\n|Golden Eye Award\n|\n|\n|-\n| rowspan=\"17\" |2023\n| rowspan=\"2\" |The Hague Movies that Matter Festival\n|Grand Jury Fiction Award\n|\n|\n|-\n|Students' Choice Award\n|\n|\n|-\n|13th Luxembourg City Film Festival\n|Grand Prix - Official Competition\n|\n|\n|-\n|International Cinephile Society Awards\n|Best Cinematography\n|David Gallego\n|\n|\n|-\n| rowspan=\"4\" |10th Platino Awards\n|Best Original Score\n|Leonardo Heiblum & Alexis Ruíz\n|\n| rowspan=\"4\" |\n|-\n|Best Cinematography\n|David Gallego\n|\n|-\n|Best Editing\n|Sebastián Hernández & Gustavo Vasco\n|\n|-\n|Best Sound\n|Carlos García\n|\n|-\n| rowspan=\"9\" |11th Macondo Awards\n|Best Picture\n|The Kings of the World\n|\n| rowspan=\"9\" |\n|-\n|Best Director\n|Laura Mora Ortega\n|\n|-\n|Best Screenplay\n|María Camila Arias & Laura Mora Ortega\n|\n|-\n|Best Cinematography\n|David Gallego\n|\n|-\n|Best Art Direction\n|Marcela Gómez & Daniel Rincón\n|\n|-\n|Best Editing\n|Sebastián Hernández & Gustavo Vasco\n|\n|-\n|Best Sound Design\n|Michelle Couttolenc, Carlos García & Boris Herrera\n|\n|-\n|Best Costume Design\n|Ana Acosta Ospina\n|\n|-\n|Best Makeup\n|Diana Parra\n|\n|}\nSee also\n* List of submissions to the 95th Academy Awards for Best International Feature Film\n* List of Colombian submissions for the Academy Award for Best International Feature Film\nReferences\nExternal links\n*"
    }
  ]
}