{
  "content": [
    {
      "type": "text",
      "text": "# The Kingdom Choir\n\nThe Kingdom Choir is a British gospel choir based in London. It was founded by choir conductor and workshop leader Karen Gibson. After performing for more than 20 years, the choir became world-famous after being invited to perform at the wedding of Prince Harry and Meghan Markle. On 19 May 2018, they sang a gospel version of \"Stand by Me\" by Ben E. King. The conductor, Gibson, was described by the British press as \"Britain's godmother of gospel\". Their performance of the song topped the U.S. Hot Gospel Songs chart. After the performance, the choir signed a record deal with Sony Music.\nOn 26 October 2018, the choir released its debut album, Stand by Me, subtitled 15 Songs of Love and Inspiration. It contains 14 cover performances and one original piece called \"Chases\".\nThe choir was selected to perform \"The Star-Spangled Banner\" before the first game of the 2019 MLB London Series in June 2019.\nIn February 2023, they accompanied Marco Mengoni in his cover of \"Let It Be\", during the 73rd Sanremo Music Festival in Italy.\nIn May 2023, a group comprising members of the Kingdom Choir performed (as the Ascension Choir) at the Coronation of Charles III and Camilla, where they sang the a capella work \"Alleluia (O Sing Praises)\" composed for the event by Debbie Wiseman.\nIn November 2023, a celebration concert, to mark 30 years of the choir and a new single entitled \"Let It Rain\", is held in the Queen Elizabeth Hall. \"Let It Rain\" is published and released by Luco Music Group.\nDiscography\nAlbums\n{| class=\"wikitable plainrowheaders\" style=\"text-align:center;\"\n|-\n! scope=\"col\"| Title and details\n! scope=\"col\"| Notes\n|-\n! scope=\"row\"| Stand by Me\n*Type: Album\n*Released: 2018\n*Record Label: Sony Music\n|\n|}\nSingles\n*2018: \"Stand by Me\"\n*2023: \"Not Giving Up\"\nReferences\nExternal links\n*\n*[https://www.facebook.com/TheKingdomChoir/ Facebook]"
    }
  ]
}