{
  "content": [
    {
      "type": "text",
      "text": "# The Historian (film)\n\n| music =\n| cinematography = Ben Powell\n| editing = D.J. Sing\n| studio = Historia Films\n| distributor = Devolver Digital Films\n| released =\n| runtime = 124 minutes\n| country = United States\n| language = English\n| budget =\n}}\nThe Historian is a 2014 drama film written, directed, produced by Miles Doleac. The film also stars Doleac along with William Sadler, Colin Cunningham, Jillian Taylor, Glynnis O'Connor, Leticia Jimenez and John Cullum.\nPlot\nThe film follows history professor Dr. Ben Rhodes who has confrontational relationship with his new boss Dr. Valerian Hadley played by William Sadler. Hadley is also the faculty adviser for Anna Densmore played by Jillian Taylor and who develops a problematic sexual relationship with Rhodes. However, Rhodes also has a supposedly non-romantic sexual relationship with Stacey Castillo played by  Leticia Jimenez. All the relationships come to a dramatic confrontation in the end which includes a sexual assault which Cynthia Kirkeby of the Point Of View Reviews describes as likely to \"polarize many discussions around the script.\"\nReception\nThe Historian was the first feature-length movie from Historia Films. It first premiered May 20 New York City's SoHo International Film Festival. It was also featured in the Los Angeles's Dances With Films 17.  On July 11, it opened the Long Island International Film Expo in Bellmore, New York. On October 20, it was featured at the Gulfport Sun and Sand Film Festival. Also in Mississippi, it was shown locally at theaters in Hattiesburg and D'Iberville starting on November 7.\nThe Historian has garnered mixed receptions from the few critics that have reviewed. Ben Kenigsberg of The New York Times stated, \"Despite low production values, The Historian... sustains curiosity over what.. is a long running time.\" While Serena Donadoni of The Village Voice derides Doleac as \"a filmmaker [who] can't reconcile all his story lines.\"\nCast\n* William Sadler as Dr. Valerian Hadley\n* Miles Doleac as Dr. Ben Rhodes\n* Colin Cunningham as Chris Fletcher\n* Jillian Taylor as Anna Densmore\n* Glynnis O'Connor as Dean Jan Messer\n* Leticia Jimenez as Stacey Castillo\n* John Cullum as Brigston Hadley\nReferences\nExternal links\n*"
    }
  ]
}