{
  "content": [
    {
      "type": "text",
      "text": "# The Rat King\n\n| production     = 505\n| runtime        = 42 minutes\n| guests         = * Jacqueline Toboni as Theresa \"Trubel\" Rubel\n* Damien Puckler as Martin Meisner\n* Carlson Young as Selina Golias\n| writer         = Jeff Miller\n| director       = David Solomon\n| music          = Richard Marvin\n| photographer   = Ross Berryman\n| editor         = George Pilkinton\n| episode_list   = List of Grimm episodes\n| season_article = Grimm season 5\n| prev           = Maiden Quest\n| next           = Wesen Nacht\n}}\n\"The Rat King\" is the fifth episode of season 5 of the supernatural drama television series Grimm  and the 93rd episode overall, which premiered on December 4, 2015, on NBC. The episode was written by Jeff Miller and was directed by David Solomon. In the episode, Nick takes Trubel to the hospital and after a while, he and Hank investigate a new case which involves a murder of two Wesen and another one who is missing. Meanwhile, Meisner tries to tell Nick that he has to trust him to know more about the organization he is taking part of.\nThe episode received generally positive reviews from critics, who praised the monster of the week but some felt that the episode seemed more filler.\nIf you are ever bitten by a rat king you will become its sucssessor and start to grow rats out of all body holes. Upon this you will patrol the sewers to hunt the Lizard King(Robert California)\nPlot\nOpening quote: \"Rats! They fought the dogs, and killed the cats.\"\nNick (David Giuntoli) brings a wounded Trubel (Jacqueline Toboni) to the hospital. While in the waiting room, Nick finds three false IDs and a fingerprint-locked phone in Trubel's jacket. Trubel tells the nurse her name is \"Lauren Cole.\" This matches the name on one of the IDs and the registration of a very expensive, weaponized motorcycle. The next day, Nick and Hank (Russell Hornsby) are called to investigate the murder of two Klaustreich. Selina (Carlson Young), the girlfriend of one of the victims, mentions a dump where they went to hunt Reinigen (rat-like Wesen) for fun, and informs them of a third missing Klaustreich, Johnny.\nMonroe (Silas Weir Mitchell) and Rosalee (Bree Turner) explain the legend of the Riesen-ratte, \"the rat king\", a creature that is formed when several Reinigen with similar DNA combine into one being. Everyone ends up at the dump, but not at the same time. Johnny and Selina are captured by the Reinigen. Nick, Hank, Monroe, and Rosalee confront the Reinigen who transform before their eyes into the Riesen-ratte. They manage to save Selina and stun the Riesen-ratte using power cables to shock the giant rat-king back into its individual parts. Several dozen Reinigen lay on the ground, groaning in pain.\nAfterwards, Meisner (Damien Puckler), with Adalind's (Claire Coffee) help, manages to convince Nick to trust him, and they run to the hospital, where they save Trubel from a group of Wesen chanting \"Occultatum Libera.\" Meanwhile, Andrew Dixon (Michael Sheets) keeps trying to get Captain Renard (Sasha Roiz) to publicly endorse his run for mayor, promising him the role of Chief of Police.\nReception\nViewers\nThe episode was viewed by 3.69 million people, earning a 0.8/3 in the 18-49 rating demographics on the Nielson ratings scale, ranking second on its timeslot and ninth for the night in the 18-49 demographics, behind a rerun of Blue Bloods, Dateline NBC, MasterChef Junior, The Amazing Race, 20/20, Dr. Ken, Last Man Standing, and Shark Tank. This was a 2% increase in viewership from the previous episode, which was watched by 3.62 million viewers with a 0.9/3. This means that 0.8 percent of all households with televisions watched the episode, while 3 percent of all households watching television at that time watched it. With DVR factoring in, the episode was watched by 6.11 million viewers and had a 1.6 ratings share in the 18-49 demographics.\nCritical reviews\n\"The Rat King\" received generally positive reviews. Les Chappell from The A.V. Club gave the episode a \"B\" rating and wrote, \"'The Rat King' is one of those episodes of Grimm that decides to forego its byzantine plotting and elaborate wesen social structuring in favor of doing something truly crazy, and the explanation this week — that Reinigen can bond together in a process involving cancer-like cells — is out there even for this show. Unfortunately, it does so in an episode that's also trying to do the aforementioned plotting and social structuring, and the marriage between the two prevents either part from connecting.\"\nKathleen Wiedel from TV Fanatic, gave a 3.5 star rating out of 5, stating: \"The whole Rat King story felt like a distraction to the whole Trubel-returns story, though in actuality it was (at some level) a branch of the same tree. The Reinigen apparently only become the Rat King when they are collectively terrified, which in this instance was almost certainly a symptom of the brewing Occultatem Libera uprising.\"\nLiz Prugh from EW wrote, \"Renard is still being recruited by Andrew Dixon and his campaign manager for an endorsement from the Portland PD. Renard is still skeptical, but they bribe him with an offer to be police chief. What's the real play here? I'm sensing sketchy vibes.\"\nMaryAnn Sleasman from TV.com, wrote, \"Grimms last two seasons have been phenomenal in terms of world-building and storytelling, giving us a lush and detailed world full of exciting, mysterious, and fascinating cultures and dangers. I miss that. Season 5 has struggled to recapture that, coming so close at times only to fail with Gotham levels of instability and K-Mart quality. It's a frustrating series to watch these days because I know how good it can be, but this season has left me scratching my head after nearly every episode. What are you trying to accomplish, Grimm? What kind of bender did you go on over the summer hiatus that you're still such a hot, hot mess? This walk of shame has gone on entirely too long.\"\nChristine Horton of Den of Geek wrote, \"There are still many questions left unanswered. What is Meisner's involvement with the uprising? Is he merely a gun for hire? Why was Trubel being held captive – if she was at all? And how did she find Nick’s house in the first place?\"\nReferences\nExternal links\n*"
    }
  ]
}