{
  "content": [
    {
      "type": "text",
      "text": "# The War Bride\n\n| runtime        = 103 minutes\n| country        = Canada United Kingdom\n| language       = English\n| budget         =\n| gross          =\n}}\nThe War Bride is a 2001 drama film directed by Lyndon Chubbuck and written by Angela Workman. It is a Canadian–British co-production.\nThe film stars Anna Friel as Lily and Julie Cox as Sophie, two young women from London, England, who marry Canadian soldiers (Aden Young and Benjamin Boyd) during World War II, and move to Canada as war brides. The film's cast also includes Brenda Fricker, Loren Dean, Caroline Cave and Molly Parker.\nPlot summary\nIn 1941, during World War II, Lily meets Charlie, a Canadian soldier in a bar. They meet during a dance that Lily is attending with her friend Sophie. They quickly fall in love and get married. Lily finds out she's pregnant just as Charlie is being shipped off and has the baby alone in London. She and her friend Sophie, who has also married a French Canadian soldier named Louie (Benjamin Boyd), get shipped off of to Canada under the War Brides program. Lily and her daughter arrive at Charlie's childhood home to find his surly mother, handicapped sister and a home on a remote farm.  Charlie's mother and sister Sylvia don't take too kindly to Lily as she appears to be a fast woman from the big city.  Lily tries really hard to win over her mother-in-law and sister-in-law with little success. There is also Peggy, who was Charlie's ex-girlfriend who resents Lily's presence as well.\nSophie comes to visit Lily and realizes that her living arrangements are less than favorable. She notices the open hostility from Charlie's mother and Sylvia and is the recipient of it as well. Sophie's husband is rich, so she arrives in a hired car wearing a fur coat an obvious sign of her wealth. This does not settle well with Charlie's mom or Sylvia. Sophie offers to take Lily to Montreal so that she can be in a better environment. Lily refuses and says that while she hates being there most days, she will tough it out.\nPeggy's brother Joe is the object of Sylvia's affection but she is hesitant in her relationship with him because she is self-conscious about her leg brace, which is a result of polio as a child. Joe seems a little enamored with Lily. Lily attempts to show Sylvia how to dance and shows her some dance steps.  Lily invites Peggy, Joe and their mother to dinner one night and proceeds to show Joe some dance moves.  Sylvia watches on jealously and later on tells Lily that she is a slut.  Lily takes the baby and flees in the middle of the night to Joe's house, asking him to take her to the train station. He proceeds to kiss her passionately and Lily responds and then stops him, reminding him that she is married.  Unbeknownst to them, Peggy is watching from her bedroom window and sees their passionate embrace.  Lily returns home with her daughter.\nShortly after, Charlie returns home unannounced from the war. Lily is excited to see him but notices that he is withdrawn and emotionally detached.  Sylvia and Joe have started a relationship.  Joe, Peggy and their mother come over for dinner and while the two couples are dancing, Peggy reveals that she saw Joe and Lily kissing that night.  Charlie lunges at Joe in a fit of rage and asks Lily if she was just using him to get out of London.\nSophie comes by and announces that she is going back to London because her husband was killed in the war. Lily asked Charlie how Lou was doing when he first got back and Charlie did not tell her that Lou had been captured and killed during the war.\nJoe and Sylvia fall in love and embark on a relationship. The movie ends with Lily and Charlie sitting a top the water shed kissing and it is clear that they are feeling the love they felt when they first met.\nCast\n* Anna Friel as Lily\n* Brenda Fricker as Betty\n* Aden Young as Charlie\n* Loren Dean as Joe\n* Molly Parker as Sylvia\n* Julie Cox as Sophie\n* Caroline Cave as Peggy\n* Keeley Gainey as Moira\n* Claudie Blakley as Rosie\n* Benjamin Boyd as Louie (as Ben Weinberger)\n* Dorothy A. Haug as Mrs. Clarke\n* Petina Hapgood as Sal\n* Lynda Boyd as Dee Dee\nAwards\nThe film garnered seven Genie Award nominations at the 22nd Genie Awards:\n* Best Picture\n* Best Actress (Friel)\n* Best Supporting Actor (Dean)\n* Best Supporting Actress (Fricker, Parker)\n* Art Direction/Production Design (Ken Rempel)\n* Costume Design (Howard Burden)\nIt won the awards for Art Direction/Production Design and Costume Design.\nReferences\nExternal links\n*"
    }
  ]
}