{
  "content": [
    {
      "type": "text",
      "text": "# The Snow Queen: Mirrorlands\n\n| writer         =\n* Aleksey Tsitsilin\n* Alexey Zamyslov\n}}\n| screenplay     =\n| story          =\n| based_on       =\n| producer       =\n| starring       =\n* Nikolai Bystrov\n* Filipp Lebedev\n* Lyasan Utiasheva\n*\n*\n*\n*\n*\n*\n*\n* Mikhail Tikhonov\n}}\n| narrator       =\n| cinematography =\n| editing        =\n| music          = Fabrizio Mancinelli\n| animator       = Alexey Lyamkin\n| studio         = Wizart Animation\n| distributor    =\n| released       =\n| runtime        = 84 minutes\n| country        = Russia\n| language       = Russian\n| budget         = $6 million\n| gross          = $10 million\n}}\nThe Snow Queen: Mirrorlands () is a 2018 Russian animated fantasy adventure film directed by Robert Lence and Aleksey Tsitsilin. It is the sequel to The Snow Queen 3: Fire and Ice (2016). The film follows the war between magicians and technocrats.\nThe Snow Queen: Mirrorlands was presented at film markets and festivals such as AFM and Cannes. The film was released in Russia on 1 January 2019. It received generally positive reviews from critics.\nA sequel, The Snow Queen & The Princess, was released in 2022.\nPlot\nGerda and Kai are finally reunited with their parents. Together they move to a certain province, ruled by a powerful inventor King Harald. In a family full of professional magicians, only Gerda doesn't have the ability to wield magic. She goes to a woman who claims she can give her magic for the cost of ten dinars. Magic trinkets are going out of fashion for the people of the kingdom. However, the family is satisfied by selling first-class magic trinkets. One day an old woman comes to buy a trinket at their shop. Gerda tells it cost ten dinars. The old woman couldn't buy it all because of her retirement benefits. She almost leaves, before Gerda tells her to buy it for free.\nA new competition at the court was announced, with families including Gerda's clamoring to go and get the position as court magician. Sadly, Gerda is the only one who stays at the home, responsible for guarding the store items. King Harald is an ardent advocate of technical progress. I build machines and robots. Harald decides to banish all magicians from the realms. Harald nearly lost his family due to the Snow Queen's previous deeds. As reparation, Harald issues a new decree that the products of scientists, engineerss and the inventors will be the standard while the amulets, potions and talismans of the magicians will be relegated or even forbidden. King Harald finds a way to ban all the magic from the world - all the possessors of magic powers are now trapped in Mirrorlands\nAfter the king traps all the world's magicians in the polar internment zone, Gerda finally finds out why all the magicians vanish at the palace. Gerda takes this mystery into her own hands as she battles to keep magic alive through kindness and friendship. However she is sent to jail at the top of the castle. Meanwhile, inside the Mirrorlands zone, a meeting is held for all the possessors of magic. Gerda's parents believe only their daughter can rescue them. They travel to the Snow Queen's castle, where she is playing chess. They reconcile all their past differences and agree for a united plan of action. Gerda will be helped by trolls, pirates, and even the frigid and mysterious Snow Queen herself. Even Rollan the wielder of fire will return from the previous film (who is ready to prove to Gerda (since he is in love with her), Kai, Alfida and Orm that he is ready to redeem himself for what he did back in the previous film) to help save the magicians from the imminent threat imposed by the magical blue mirror called the Mirrorlands.\nOne of their rendezvous to the land of the trolls includes an aerial battle with zeppelins in the floating City of Pirates. Gerda manages to seek the services of air captain Alfida. Alfida agrees to sail the shark airship zeppelin with the hero and heroine as passengers. King Harald and his airship fleet are already on their way to thwart Gerda's plan of liberation engaging in a battle between spells and technology. Teaming up with the pirates of the Flying City, the heroes try to capture the capital of the region and re-open the portal of the Mirrorlands using the amulet of King Arrog.\nAfter many attempts to open the portal, the king's son finally confesses to his father that he is a wizard and banishes himself, to which he finally gives in and lets Gerda let out all the wizards he himself banished. Eventually, the Snow Queen is forgiven and befriends Gerda, promising to use her powers for good, not evil.\nCast\n{| class=\"wikitable\"\n!Character\n!Russian Actor\n!English Actor\n|-\n|Gerda\n|Lina Ivanova\n|Laurie Hymes\n|-\n| colspan=\"3\" |The main heroine from The Snow Queen. She's a brave, kind, and honest girl with a strong will.Growing up in an orphanage, she is always quick to embark on any adventure and has a warm perceptive heart, but not for long|-\n|-\n|Kai\n|Nikolay Bystrov\n|Jason Griffith\n|-\n| colspan=\"3\" |Gerda's younger brother - a dreamer, artist, and poet. He is willing to help alongside Alfida and Gerda.\n|-\n|Rollan\n|Filipp Lebedev\n|Graham Halstead\n|-\n| colspan=\"3\" |An adventurer who collects legends. Crazy about superheroes and everything that has to do with them. A true Spanish man, spirited and brave, he is ready to risk his life to achieve his goals. He is in love with Gerda and really wants to prove her he has changed. He is ready to redeem his past misdeeds even with his own blood.\n|-\n|Prince Anders\n|Elena Shulman\n|Erica Schroeder\n|-\n| colspan=\"3\" |The young son of King Harald.\n|-\n|Orm\n|Anton Eldarov\n|Billy Bob Thompson\n|-\n| colspan=\"3\" |Orm is a very ordinary troll. Despite not seen at \"troll\" standards, Orm's strengths are not physical.His true merits lie elsewhere, namely in cunning and savviness.\n|-\n|Alfida\n|Lyasan Utiasheva\n|Devin Bailey Griffin\n|-\n| colspan=\"3\" |A true pirate. Alfida is strong, authoritative, and determined-but she has a kind heart, and an acute sense of justice.\n|-\n|Snow Queen\n|Olga Zubkova\n|Samia Mounts\n|-\n| colspan=\"3\" |The ruler of an icy palace in the Laplands.\nThe Queen has the power to invoke polar winds that turn the lands into a winter land.\n|-\n|King Harald\n|Vladimir Zaystev\n|Marc Thompson\n|-\n| colspan=\"3\" |The inventor engineer head of state who manages to lure all magic inside an azure reflector\n|-\n|Una\n|Irina Bezrukova\n|Vanessa Gardner\n|-\n| colspan=\"3\" |\n|-\n|Vegard\n|Mikhail Tikhonov\n|Tom Wayland\n|-\n| colspan=\"3\" |\n|-\n|Lilit\n|\n|-\n| colspan=\"3\" |\n|-\n|Troll King Arrog\n|Vsevolod Kuznetsov\n|Scott Rayow\n|-\n| colspan=\"3\" |Arrog comes from a much-celebrated line of trolls.He can go on endlessly about his great feats of his grandfather.\n|-\n|Admiral\n|Nikita Prozorovsky\n|Jason Griffith\n|}\nProduction\nDevelopment\n|title=|source=}}\nThe fourth installment of The Snow Queen franchise was in initial stages since 2016. Wizart Animation collaborated with American animation veteran Robert Lence. Previously, Lence has worked as a script writer, animator and story board consultant for major studios including Disney, Pixar and DreamWorks. Lence became a director alongside co-director Aleksey Tsitsilin. For the first time in Russian animation history, a film was co-directed by a Hollywood animator.\nBoth Tsitsilin and Lence reciprocated their skills for the film. Tsitsilin noted Lence gave the film more comedic output that is usually present in American animated films, while Lence remarked, \"It was also nice to see them incorporate things in the film that are particular to their own culture and sensibilities. Because they do indeed have such a rich history of film making and storytelling in their country. And likewise, I learned a great deal from them as well.\" Lence also pointed out, despite the geographic and language barrier between Hollywood and Russia they were able to find common ground. Lence continued, \"It’s those revelatory crossover moments in the course of creating the story, where we came to a shared understanding of what is funny, heartfelt, or entertaining. We realized that we can both learn from each other's cultures and differences, and celebrate what each of our cultures has to bring to the table.\"\nThe work for the film lasted two years. It had children as the target audience alongside messages that foster kindness by using actions guided by the heart. At the March 2018 FILMART Asian Film Market in Hong Kong, preliminary content of the film was presented. On 12 September 2018, at the Eastern Economic Forum in Vladivostok, a trilateral liaison was signed between the Russian Export Center, Wizart Animation and the company from China - HY Media/Cayie International Media Group. Andrey Slepnev, General Director of the REC and Yuri Moskvin, executive producer of Wizart Animation attended the forum.\nThe signing became one of the first times, China became a joint partner in producing a Russian animated film. Lisha Nin, the CEO China-HY Media/Cayie International Media Group remarked the plan will bring the Russian animation industry within great export potential to China.\nThemes\nIn November 2017, at the American Film Market, Wizart Animation presented the materials for The Snow Queen: Mirrorlands. Presenters remarked the film will be a fusion of technology and magic. Robert Lence explained how the film will be a melting pot of steampunk genre through the use of technology such as airships intertwined with the polar fairy tale setting of the franchise based on the Hans Christian Andersen's plot. Co-director Alexsey Tsitsilin emphasized the film will also feature fundamental themes such as friendship, kindness, forgiveness and perseverance saying, \"The movie answers the question, ‘Should we really treat people united by some common feature bad if only one of them did something wrong?\" The movie will explore this theme around the realm of collective punishment and whether it is a rightful means of justice.\nThe concept is explored in the film, when a decree to imprison all magicians in an ice portal because they don't fit scientific, technical definitions is imposed on the land that primarily affect all the characters in the film except the main character Gerda. The film describes the ramifications that arise when science converges with magic. In the film, the character King Harald represents the clan of scientists and technology while the character Gerda represents the clan of magic and fairy tales. The film is a description of the cultural phenomena that is released when seemingly incompatible establishments intersect and cross each other's path. The script's use of diametrically opposite clans of magicians and technocrats were applauded by reviews, as if the story came out of a 20th-century Bulgakov novel.\nThe conflict is explored within the context of science colliding with magic presented by new characters such as King Harald. The conflict parallels mankind's rationalism in the Industrial Revolution in contrast to the spiritual enlightenment found in schools of thought such as Transcendentalism and Naturalism. Another theme developed was reconciliation seen in the finale when unexpected enemies find common ground to help solve the crisis of the fairy world. The script was developed to accommodate all the friends and foes of the past series.\nThe film was slated to finished by the end of 2018. Central Partnership and Soyuzmultfilm distributed the film to Russia and neighboring countries. Soyuzmultfilm returned to produce a Snow Queen adaptation ever since its 1957 film by Lev Atamanov that has earned a place in Russian animation classics. A Russian cast gave the voice performance for the characters. Lina Ivanova (ru) (Hermione Granger-Harry Potter) voiced Gerda. Alfida the pirate was voiced by Lyasan Utiasheva. Celebrity stage and screen actress Irina Bezrukova (ru) voiced Gerda and Kai's mother, Una. Nadezhda Angarskaya (ru) voiced Lilit. Vladimir Zaystev (ru) (Sherlock Holmes-Sherlock Holmes: A Game of Shadows) voiced King Harald. Polish actresses Agata Kulesza and Natalia Szroeder also lend voices for the localized dub. Brazil voice cast included actress and singer Larissa Manoela, João Côrtes (pt) and Igor Jansen.\nAnimation\nThe feature film is considerably different from its prequels due to its sophisticated artwork on technology. The animation studio expanded the fairy tale universe to a megalopolis whose industry runs on inventions. Animators increased the quality of the film to showcase real-life depiction nature such as clouds, lava and water. Special effects of the reflections of the sun on the sea waves were developed. At the AFM presentation, animators explained how they created a cloud system. They remarked first the layout department models the cloud, adds geometry with polygonal modeling tools, and stages the shot. Next, the effects department uses volume processing tools to generate complex shapes. 3D noise displacement and smoothing algorithms are employed in this process. Finally, OpenVDB library created by DreamWorks efficiently formats the data.\nAnimators had to hone their skills especially in the areas of dialogue and actions when it came to interactions between the characters Gerda and the Snow Queen, because they were the only characters in the story capable of communicating with each other. Animators unlocked new areas of artistry that featured aerial chases with zeppelins featured in the City of Pirates episode.\nSoundtrack\nThe original score was composed by Fabrizio Mancinelli who had worked on a number of projects for Disney including Growing up with Nine Old Men (directed by Theodore Thomas) and comedy film Scappo a casa. With Mancinelli's original score, the music for the soundtrack was recorded by the Budapest Scoring. The theme song is \"The Best Adventure\" sung by Fabrizio Mancinelli and Jessica Kline. Yulia Iva, a singer from Russia who has worked for projects such as Beauty and the Beast and Little Mermaid gave voice to the theme song \"The Best Adventure.\"\n| recorded   = 2018\n| venue      =\n| studio     =\n| genre      = Feature film soundtrack\n| length     =\n| language   =\n| label      =\n| producer   =\n| prev_title =\n| prev_year  =\n| next_title =\n| next_year  =\n| audio1     =\n}}\n| title1 = The Best Adventure\n| total_length =\n| music1 =\n| extra_column = Singer(s)\n}}\nRelease\nTheatrical\nAt the 2017 AFM, Wizart Animation secured distribution in South Korea, Turkey and Poland. In May 2018, at the Marché du Film in Cannes, they showcased the first footage of its film for a global audience. The film pre-sold to Latvia, Lithuania, and Estonia (Acme Film), Poland (Kino Świat(pl)), former Yugoslavia (Blitz), the Czech Republic and Slovakia (CinemArt (cs)). The franchise also returned to Bulgaria via Pro Films. Line Friends Corporation distributed the film in South Korea. The film went to Mongolia as Digital Content agreed to distribute the film.\nPoland, Lithuania, Latvia and Estonia were the first to view The Snow Queen: Mirrorlands on 21 December 2018. Promotional marketing between H&M and Orange commenced for the opening in those regions. The film was released on 27 December 2018 in Slovakia and Czech Republic. The city of Voronezh in Russia had a special premiere before the anticipated release domestically. There was also a premiere in Moscow on 23 December 2018. The main domestic release in Russia began on 1 January 2019. Later in the month, the film opened in Croatia, Bosnia and Herzegovina, Slovenia and Montenegro via Blitz.\nThe film was released in Germany and Austria during February 2019. Mirrorlands was the first film in the franchise to be released theatrically in Germany, as opposed to VOD. Peppermint Enterprises handled distribution for Germany. The film was presented at the Shanghai International Film Festival on 26 June 2019 and then released in China on 2 August 2019. In September 2019, the film was part of the Toronto International Film Festival. The studio's film was the first to present a Russian animated film at a New York film festival by joining the Niagara Falls International Film Festival. Mirrorlands was also presented at Montreal's Animaze fest, where it had its Canadian premiere on 1 September 2019. Turkish distributor Medyavisyon, Poland's Kinoswiat and South Korea's Cinema Republic handled distribution of the film.\nWizart Animation signed deals with Universal Pictures Video France and KLB SAS for distribution across France and the principalities of Andorra and Monaco and French-speaking territories of Belgium, Switzerland, Luxembourg and Africa in 2019. Galeria Distribuidora distributed the film in Brazil in November 2019. On 8 November 2019, the film released in Indonesia. On 28 November 2019, the theatrical release of the feature occurred in Uruguay and Argentina. Paraguay also featured the film in December 2019. The film premiered in Vietnam via CJ CGV Company in December 2019. In the same month, Line Friends Corporation distributed the film In South Korea. In 2020, Rai Gulp, Italy's largest children's TV channel, agreed to air The Snow Queen series including Mirrorlands.\nIn 2020, Russia held its own film festival Key Buyers Event: Digital Edition, the world's first virtual content market. There Wizart Animation sold the film with United Kingdom, India, and Africa distributors. Distributors such as Signature Entertainment, one of Britain's leading distributors, agreed to release the film to the cinemas in both Britain and Ireland on 7 August 2020 adjacent to its release of promotional theatrical trailers. Miraj Group of India also were present in the virtual event who negotiated the rights to the film for release. The film became one of the most popular 2020 New Year's animated films in the region of Mari El in Russia based on TV statistics provided by MegaFon TV.\nIn 2020, the United States and Canada audience were able to view The Snow Queen: Mirrorlands. Vertical Entertainment, the international film distributor arranged the opening of film on 18 December 2020. Vertical Entertainment previously arranged and distributed the prequels to The Snow Queen series. The format opening was a package of theater with additional Video on Demand such as iTunes and Google Play outlets providing support for a digital release. The film was released in official Blu-Ray and DVD in English. The film will be part of the Starz channel July 2021 lineup.\nReception\nBox office\nThe budget spent on the film was $6 million. During the premieres in Poland and Slovenia the cartoon took second place in rentals overtaking major overseas competitors. The film became the first Russian film to receive $1 million at the international box office in 2019. In Russia the collections in total amounted to $5.1 million. By the end of 2019 box office results, the animated film became the most popular Russian animated film at the foreign box office. The fourth part took the second place of the highest-grossing domestic films releases abroad in 2019 with first place going to the feature film Going Vertical.\nThe cartoon picked off where it left off from its prequel in Bulgaria as it set new records. According to general director Emil Simeonov of the distribution company Pro Films, Mirrorlands became the best foreign independent animation venture in Bulgaria in retrospect of 25 years that earned more than 100 thousand levs (the currency in Bulgaria) topping DreamWorks' How to Train Your Dragon-3 at premiere weekend. Fees for the fourth part of the franchise exceeded $2.5 million outside of Russia. The film was a major Russian release in France. Overall, currently the film has collected a total of $10 million.\nCritical response\nKinoKultura review by Olga Blackledge stated the international appeal of The Snow Queen franchise is undeniable as it has been shown in over 150 countries. Furthermore, there was a statement about the film's overall secret formula for success, \"So what is its secret? The franchise in general, and Mirrorlands in particular, have been praised for its technological mastery which is consistently growing. Even with a relatively low budget, Wizart Animation manages to create world-class animation.\" InterMedia gave the film an acclaimed five stars, stating its script is akin to the stories of Russian author Mikhail Bulgakov.\nCritics from Germany of Die Schneekönigin: Im Spiegelland (The Snow Queen: In The Mirror Country) included Film-Rezensionen's review was much more favorable with the film's theme of reconciliation. The review stated, \"The conciliatory note is, of course, extremely nice as the Snow Queen tries to get away from the usual black-and-white drawing that prevails in such animated films.\" Spielfilm also reviewed the film with three out of five stars:The fact that Alfida's ship and the king's chase fleet are flying through the air, carried by a zeppelin shaped like a shark or by balloons, is one of the most appealing visual ideas of the film. This turbulent story also borrows from the genre of superhero films. Thematically and creatively, the film impresses with an enormous wealth of ideas. They're trying to bring too many different elements under one roof. The landscapes with their gorges through which the airships fly, the blue mirror country, but also the old town in which Gerda lives, are beautifully drawn backdrops. So all in all, the jam-packed film turned out to be quite appealing.Moviebreak finds Mirrorlands is the perfect alternative to Frozen II, as both were released in 2019. The review was surprised by the output, because Wizart has proven it \"gained self-confidence\" in building a series from a fairy tale. The review liked the movie's message of reconciliation and animation stating, \"With plenty of action, some suspense, and the theme of reconciliation, the fourth part of the 'Snow Queen' series also surprises and reveals entertainment for the very little ones among us. Although there are again narrative weaknesses and a quite simple plot, the strengthened visual power as well as the ambivalent characters can convince. Even non-connoisseurs of the series will not do much wrong here and can enjoy a fast-paced fairy tale on the big screen.\"\nReviews found the character development of Gerda exemplary as she becomes a superhero girl. Moviebreak stated, \"This then also benefits the finale, where not only Gerda can finally triumph as a fighting girl and no longer needs to be saved\" and Italian review from der Zweifel stated: \"Everything goes for the better and the girl eventually discovers that she is the most powerful magician in the village turning into a kind of superhero.\" der Zweifel also touched upon the innovative plot's idea of the struggle between technology versus magic has \"great potential\" that parallels modern society's importance on rationalism contingent upon \"what is seen\" or  \"technological\" as opposed to what \"the sense of spiritual and magical that man has always sought and developed spontaneously.\"\nFrench critic from Avoir-Alire remarked at its visuals, \"Despite a limited plot, the franchise of Wizart Animation tends increasingly to the development of a very recognizable universe of its own: impeccable graphics, saturated colors, friendly characters, sustained rhythm. Young spectators should appreciate it. A simple story, no surprise, saved by a dazzling staging. The scenery is quite remarkable; the enchanting, icy blue color makes all the aesthetics of the film.\"\nLePop from Brazil stated, \"With a plot that tries to rescue the golden times of Fairy Tales, The Frozen Kingdom: The Land of Mirrors can please children and also fathers, mothers and other family members who like this style of narrative.\" A Czech review from Červený Koberec by Alexandra Tinková approved of the film's plot: \"the belief that even bad people can make amends makes The Snow Queen special compared to other fairy tales.\"\nChris Hunneysett reviews gave the film 3 stars stating its landscapes were particularly noteworthy through its \"epic sweep of the adventure on a journey of honey hued vistas: featuring lava lakes, giant rock monsters, and sky pirates.\" In-depth, the animators added intricate details to the landscapes as well: \"However there’s a surprisingly intricate styling to the charming cityscapes, which feature robot-like street sweepers and trolley trams, and it’s full of slapstick silliness with mischievous and cute critters.\"\nSunday Independent from Ireland, remarked the film is highly competitive. With a final rating of four stars, the review stated, \"To save the day, she(Gerda) will team up with the Snow Queen for an elaborate adventure populated with a robust array of characters and top-drawer fantasy animation. Parents really can't go wrong here.\"\nAccolades\n{| class=\"wikitable sortable plainrowheaders\" style=\"width: 99%\"\n! scope=\"col\" style=\"width:20%;\" |Award\n! scope=\"col\" |Date of ceremony\n! scope=\"col\" |Category\n! scope=\"col\" |Recipient(s)\n! scope=\"col\" |Result\n|-\n! scope=\"row\" style=\"text-align:center;\" |Festival of Visual Arts in Orlyonok (Grand Prix)\n|July 2019\n|Full-Length Animation Film\n|rowspan=\"5\"|The Snow Queen: Mirrorlands\n|\n|-\n! scope=\"row\" style=\"text-align:center;\" |Niagara Falls International Film Festival\n|18 September 2019\n|Narrative Features\n|rowspan=\"2\"\n|-\n! scope=\"row\" style=\"text-align:center;\" |Cartoons on the Bay (Italy)\n|2019\n|Animation\n|-\n! scope=\"row\" style=\"text-align:center;\" |Russian Industrial Award Ceremony for Animation and Licensing (Multimir)\n|30 May 2019\n|Best Russian Animated Feature Film\n| rowspan=\"3\"\n|-\n! scope=\"row\" style=\"text-align:center;\" |Prague Independent Film Festival\n| |8 August 2019\n|Animation\n|-\n! scope=\"row\" style=\"text-align:center;\" |Sunny Island\n|6 September 2019\n|Special Jury Prize\n|Aleksey TsitsilinRobert Lence\n|-\n! scope=\"row\" style=\"text-align:center;\" |Xinguang Award International Animation Competition\n| |36 September 2019\n|Best Animated Feature Film\n|Wizart Animation\n|\n|-\n! scope=\"row\" style=\"text-align:center;\" |Russian Film Week (The Golden Unicorn Award)\n|30 November 2019\n|Best Animated Film\n|Aleksey TsitsilinRobert Lence\n|\n|-\n! scope=\"row\" style=\"text-align:center;\" |Palm Springs International Animation Festival (PSIAF)\n|December 2019\n|Animated Film\n|rowspan='5'|The Snow Queen: Mirrorlands\n|rowspan='5'\n|-\n! scope=\"row\" style=\"text-align:center;\" |Catalina Film Festival\n|2019\n|Feature Films\n|-\n! scope=\"row\" style=\"text-align:center;\" |World Festival of Animated Films\n|2019\n|Selected Feature Films\n|-\n! scope=\"row\" style=\"text-align:center;\" |Tokyo Anime Award Festival\n|13 March 2020\n|Feature Animation\n|-\n! scope=\"row\" style=\"text-align:center;\" |Good of the World\n|March 2020\n|Animation\n|}\nTie-in material\nVideo game\nWizart Animation released a free game for Android and iOS platforms. The studio founded in 2007 as a gaming studio officially released its first major game that is based on The Snow Queen franchise in 2020. Snow Queen: Frozen Fun Run. Endless Runner Games features a runner (arcade) where the players can choose the characters Gerda, Kai, Orm or any other hero who need to overcome obstacles and escape from the main enemy - the North Wind.\nFranchise\nAfter the release of The Snow Queen: Mirrorlands,The Snow Queen series became an animated tetralogy series presented by Wizart Animation. For the first time in The Snow Queen series history, the viewership of the film surpassed seventeen million viewers in over eighty countries. From its debut original The Snow Queen released in 2012, today the animation studio has transformed the series into an animation series classic that has caught the attention of ordinary viewers to critics alike.\nModern animation has witnessed a revival of The Snow Queen adaptations with Wizart Animation presenting the film in 3D art within the context of adventure, fantasy, family film. Animation in Russia had to overcome challenges to become a recognizable brand in the industry today. Wizart Animation is improving their ability to professionally produce 3D content for cinema industry and is one of the fastest and most dynamically developing animation studios in Russia. International distributor partners and audiences alike are helping the studio's products gain acceptance, as The Snow Queen series has been released worldwide to over 150 countries and translated into 30 languages.\nWizart Animation is currently animating the latest installment to The Snow Queen franchise with an anticipated release in 2022. The film will feature new character designs and characters.\nReferences\nExternal links\n*\n*\n*"
    }
  ]
}