{
  "content": [
    {
      "type": "text",
      "text": "# The Flash: Vertical Velocity (Six Flags Discovery Kingdom)\n\nThe Flash: Vertical Velocity (formerly known as V2: Vertical Velocity) is an impulse roller coaster located at Six Flags Discovery Kingdom in Vallejo, California. It is California's first and only inverting Inverted Impulse Coaster, built by Intamin and opened on June 8, 2001. It stands  and reaches speeds of up to .\nHistory\nWhen it opened on June 8, 2001, the ride was . Both sides of the track were vertical, the front tower twisted and the rear tower straight with a reverse LIM segment at the top (designed to hold the train momentarily). In 2002, the ride was temporarily closed while the track was modified from  to the city ordinance limit of . To lower the height, the front tower was tilted to a 45-degree angle and the reverse tower lowered to .\nFor the 2007 season, V2 was repainted red with maroon supports. Before the repainting, it had a yellow track with blue supports, which made this ride's paint scheme very similar to the defunct coaster Wicked Twister at Cedar Point, which had also had a yellow track and supports that were a lighter shade of teal.\nVertical Velocity closed for extensive refurbishment in early 2016, which included the removal and complete disassembly of the train. Sections of track and queue railings were also removed as part of this refurbishment.\nOn April 3, 2019, the park sent a newsletter announcing renovations to rebrand the coaster into The Flash: Vertical Velocity, which would open next to the park's new 4-D coaster, Batman: The Ride. The opening of the two coasters rebranded that area of the park to a DC Comics-themed land, standing along with Superman: Ultimate Flight, and The Joker. Vertical Velocity's supports were painted yellow for the new theme.\nFollowing the reopening of the park after its prolonged closure from the COVID-19 pandemic, The Flash once again was dormant, with barricades blocking the hill leading to the line in favor of a Mask Relief Area, where parkgoers could take off their personal masks if they so chose. The Flash's train was once again removed, this time going completely missing, whereas during the prior refurbishment to turn the coaster into The Flash, the train was disassembled and subsequently reassembled in the station.\nIn January 2024 The Flash was closed for refurbishments but then later reopened in July 2025.\nRide experience\nThe roller coaster's layout is akin to a large vertical U shape, that is loaded at the base and uses a series of LIMs to accelerate the train up each side of the track. One side of the track is twisted track (commonly called an inline twist) that ends in a straight section angled at about 45 degrees, the other side is a perfectly vertical straight track. The train seats 28 riders in an inverted roller coaster design.\nTimeline\n* 2001 - The Flash: Vertical Velocity opens as V2: Vertical Velocity.\n* 2002 - V2 is modified so both its towers are 150 feet, and its back tower has a 45-degree angle.\n* 2007 - V2 receives a repaint with red track & maroon supports.\n* 2019 - V2: Vertical Velocity is repainted and its track is given a darker shade of red while the supports become yellow. It is also given a re theme to the Flash and renamed \"The Flash: Vertical Velocity.\n* 2024 closed again for refurbishment\n* July 2025 reopens to the public\nReferences\nExternal links\n*"
    }
  ]
}