{
  "content": [
    {
      "type": "text",
      "text": "# The Legend of King Naresuan: The Series season 1\n\n| num_episodes  = 12\n| network       = MONO29\n| first_aired   =\n| last_aired    =\n| next_season   = Season 2\n| episode_list  =\n}}\n'''The Legend of King Naresuan: The Series - Hongsawadee's Hostage' () is the first season of the MONO29 Thai historical series The Legend of King Naresuan: The Series'' premiered on January 9, 2017, and concluded on February 14, 2017. It consisted of 12 episodes. The series was developed by Nutchanon Bunsiri, Napapach Thitakawin, Pattaravadee Laosa, Patcharanamon Nontapa, Korapat Kirdpan, Sorapong Chatree based upon the original film in 2003 directed by Chalermchatri Yukol, which premiered exactly 14 years earlier. The series centers on the \"Prince Naresuan\" when he stayed in Hongsawadee city as a hostage.\nCast and characters\nMain cast\n* Nutchanont Bunsiri as Prince Naresuan (teenager)\n* Napapach Thitakawin as Manechan (Teenager)\n* Pattaravadee Laosa as Princess Wilaikalaya\n* Pacharanamon Nonthapa as Princess Supankulaya (Teenager)\n* Korapat Kirdpan as Prince Minchit Sra (teenager)\n* Sorapong Chatree as Mahathera Khanchong\nRecurring cast\n* Panukorn Wongbunmak as Prince Naresuan (Young)\n* Pattarakorn Prasertset as Minchit Sra (Young)\n* NongBiw Khaokong as Saming\n* Sitthochok Puerkpoonpol as Rachamanu (Bunting) - Teenager\n* Atiwat Snitwong Na Ayutthaya as  king Maha Thamaracha\n* Paramej Noi-Am as King Bayinnaung\n* Kasarb Champadib as Maha Upraja Nanda Bayin\n* Patthamawan Kaomoolkadi as Princess Thep Kasattri\n* Lervith Sangsit as King Mahinthrathirat\n* Sukol Sasijullaka as King MahaChakrapadi\n* Rushanont Rearnpetch as Prince Ekathotsarot (Teenager)\n* Aphiprach Tangjai as Prince Ramesuan\n* Siraprapha Sukdumrong as Queen Wisutkasat\n* Nussara Prawanna as Queen Meng Pyu\n* Jirawath Wachirasarunpatha as Binnya Dala\n* Tanayong Wongtrakul as Lord Luckwaitummoo\n* Nong Chernyim as millionaire Tuam\n* Krilash Kreangkrai as Pra Sunthornsongkram\n* Surasak Chaiaat as Orkya Charkri\nEpisode\n| Viewers         = -\n| ShortSummary    = In 1563, the king of the kingdom of Hongsawadee City (Tongoo Dynasty) () has beat the northern city of Ayodhaya Kingdom, () from Sukhothai (), Sawankhalok (), and Song Khwae (), where Phitsanulok Song Khwae (), King Maha Thammaracha () has asked for help from Ayutthaya Kingdom, but did not receive any assistance from Ayutthaya. Phra Maha Thammaracha defected to join with King Bayinnaung () to attack Ayutthaya Kingdoms. And ask Prince Narest (), the eldest son in Queen Wisutkasat () as a hostage in Hongsawadee City. And he swear to be good parenting like his son.\nWhen the army of Phitsanulok Song Khwae and Hongsawadee City came to Ayutthaya Kingdom. It must be met with heavy resistance from Ayutthaya. Because of the Prince Ramesuan (), his son grew up in King MahaChakrapadi () as a brave warrior. But King MahaChakrapadi sees that should be negotiated with the Hongsawadee City. When both sides have negotiated. King Bayinnaung asked for a white elephant. And ask Prince Ramesuan as a hostage in Hongsawadee City like Prince Narest, it is also claimed Prince Mahinthrathirat () he can continue to reign later.\n| LineColor       = 055F4D\n}}\n| Viewers         =\n| ShortSummary    = Later, King Bayinnaung leads the army to beat Srisattana Kanahut Kingdom () with Prince Ramesuan. But he did not go to Lan Xang because he already died. King Bayinnaung has been fighting Laos and is victorious. And the only son of King Chai Setthathirat (), as hostage in Hongsawadee City. At Hongsawadee City. Prince Narest went to the Yodia market and met a long-haired boy named Boonting. And this boy swore to be follow Prince Narest forever. As Prince Narest returns to the palace, he encounters a procession of Prince Minchit Swa (), the son of Uparaja Nanda Bayin (). Luckwai Thummoo () soldier of Nanda Bayin tries to let the Prince Narest respect Prince Minchit Swa. But Prince Narest does not. King Bayinnaung knows, so he dictates Prince Minchit Swa respect Prince Narest because He is a higher honor. He lets Prince Narest practice at the temple at the gate with the city. They met Maneechan (), a girl living in the temple. And meet with the Mahathera Kunchong (), who is a professional teacher. Mahathera taught the subject and commented on the situation of Prince Narest forever. Later, the relationship between Phitsanulok Song Khwae and Ayodhaya began to become more and more disturbed when the King Chai Setthathirat. After the loss of his wife and royal family in the war. He have sent a royal letter to King Maha Chakkraphat to ask. Princess Thep Kasattri () His younger daughter in King Maha Chakkraphat and Queen Suriyothai (). But the King Maha Thammarachathirat has been sent to the message to Hongsawadee City.\n| LineColor       = 055F4D\n}}\n| Viewers         =\n| ShortSummary    = Five years later, Prince Narest accidentally assisted Princess Wilaikalaya () from the snake. Later Prince Narest wins the showdown. So he asked Front Palace of Hongsawadee and returns to Yodia Temple again. Division Ayodhaya Kingdom King Maha Chakkraphat be ordained and appoint Prince Mahinthrathirat in reign continue him.\n| LineColor       = 055F4D\n}}\n| Viewers         =\n| ShortSummary    = When the King Chai Setthathirat has lost Princess Thep Kasattri. So he joins King Maha Thammarachathirat's assassination plan (plan of King Mahinthrathirat). He moves the troops to attack Phitsanulok Song Khwae. King Bayinnaung sent Praya Phugam () and Praya Suehan (). 2 Mon soldiers move the troops to join attack to Lan Xang Kingdom.\n| LineColor       = 055F4D\n}}\n| Viewers         =\n| ShortSummary    = Praya Phugam and Praya Suehan unsuccessfully wage war. King Bayinnaung was ordered to be decapitated. But King Maha Thammarachathirat who went to Hongsawadee City also asked for life King Bayinnaung permit and asked northern city of Ayodhaya come under Hongsawadee City.\n| LineColor       = 055F4D\n}}\n| Viewers         =\n| ShortSummary    = King MahaChakraphat leaves the Buddhist monkhood and reigns again. After that, he and Prince Mahinthrathirat go to Phitsanulok Song Khwae, to take Queen Wisutkasat, Princess Suphankanlaya () and Prince Ekathotsarot () returned to Ayodhaya.\n| LineColor       = 055F4D\n}}\n| Viewers         =\n| ShortSummary    = Prince Mahinthrathirat declares war on Hongsawadee by killing Hongsa's soldiers with Princess Sirithevi () and moves the troops to attack Kamphaeng Phet City (). King Bayinnaung is angered so he ordered the army to attack Ayutthaya in the twelfth month.\n| LineColor       = 055F4D\n}}\n| Viewers         =\n| ShortSummary    = King Bayinnaung besieges Ayodhaya Kingdom and fights in the war. But this war lasts longer than expected. About a year later, King MahaChakraphat becomes seriously sick. Prince Narest and Bunting escape from Hongsawadee. He found Prince Mingyi Swa on the way. But Prince Narest can pass him.\n| LineColor       = 055F4D\n}}\n| Viewers         =\n| ShortSummary    = King Bayinnaung plans to ask Praya Ram Narong and move the army back to Hongsawadee. After King MahaChakraphat's death, Orkya Chakri (), the old soldier of Ayodhaya, pretended to be able to escape from the Hongsawadee's army and into the royal court Ayodhaya. He presents himself as a commander of the army. King Mahinthrathirat () believes him.\n| LineColor       = 055F4D\n}}\n| Viewers         =\n| ShortSummary    = Orkya Chakri opens the gates for Hongsawadee army into Ayodhaya. King Bayinnaung has ordered the army to attack Ayodhaya Kingdom. Ayodhaya Kingdom defeated Hongsawadee Kingdom in the war. King Bayinnaung appoints King Maha Thammarachathirat the ruler of Ayodhaya Kingdom, replacing King Mahinthrathirat. And he asks Princess Suphankanlaya, the eldest daughter in King Maha Thammarachathirat and Queen Wisutkasat, returned to King Maha Thammarachathirat. When King Mahinthrathirat comes to Hongsawadee. He is sick and dies.\n| LineColor       = 055F4D\n}}\n| Viewers         =\n| ShortSummary    = Prince Narest accepts the challenge of Prince Mengyi Swa to kick the chicken (). The result is Prince Mengyi Swa's chicken is the defeated by the chicken of Prince Narest. Prince Mengyi Swa is very angry. He disparaged Prince Naresuan, saying that \"chicken captive this is real\". Prince Naresuan responded \"This chicken can't gamble for fun only, but it can gamble for kingdom.\". Later Prince Narest plans to escape again.\n| LineColor       = 055F4D\n}}\n| Viewers         =\n| ShortSummary    = Prince Narest has to escape back to Phitsanulok Song Khwae. He asks Princess Suphankanlaya to return with him. But Princess Suphankanlaya does not return. 300 Siamese servants flee successfully. Later Maneechan becomes a servant of the Princess Suphankanlaya.\n| LineColor       = 055F4D\n}}\n}}\nProduction\nMr. Chalermchatri Yukol director said, \"I'm very happy. But there is space for improvement, because it was the first time I created a TV series. We work every week. But we do not do all the same. The damage was moderate. Cost and more time but enough to continue. We control these things better. Better actor we took the problem from the movie The Legend of Suriyothai to fix in the film King Naresuan. And we took the knowledge from this film to fix in the film Panthai Norasing (). And we took the knowledge from this film to come to this drama. Make the series look more modern. This is one of the experiments.\nReferences\nExternal links\n* [https://seeme.me/ch/naresuantheseries The Legend of King Naresuan: The Series (season 1) all episode]"
    }
  ]
}