{
  "content": [
    {
      "type": "text",
      "text": "# The Great Stone War\n\nThe Great Stone War is the second studio album by American deathcore band Winds of Plague. It was released on August 11, 2009 through Century Media Records. The album also marks the recording debut of drummer Art Cruz and keyboardist Kristen Randall. The Great Stone War sold 6,300 copies in its first week of release to debut at No. 73 on The Billboard 200 chart. A cover of \"Halloween\" by Misfits appears as a bonus track on iTunes.\nComposition\nWinds of Plague described the record as a concept album. Vocalist Johnny Plague states, \"The idea of The Great Stone War is that civilization as a whole will digress and in time inevitably end with one final battle. This battle will not be fought with technology but with stone. Over the course of eleven tracks the listener hears about a journey foreseen through the eyes of a heathen in a religious world apocalypse. Even in the world's darkest times you always have to take a step back and see life for what it is and not lose sight of what is most important.\"\n|rev2 = Ashladan\n|rev2score =\n|rev3 = Blistering\n|rev3score =\n|rev4 = Lords of Metal\n|rev4score =\n|rev5 = Zware Metalen\n|rev5score = (8.2/10)\n}}\nTrack listing\nPersonnel\n;Winds of Plague\n* Jonathan \"Johnny Plague\" Cooke-Hayden – unclean vocals\n* Nick Eash – lead guitar\n* Nick Piunno – rhythm guitar\n* Andrew Glover – bass, engineering assistance\n* Art Cruz – drums, percussion\n* Kristen Randall – keyboards, clean vocals\n;Additional musicians\n* Martin Stewart of Terror – guest vocals on tracks 2, 13\n* John Mishima – guest vocals on track 6\n* Mitch Lucker of Suicide Silence – guest vocals on track 9\n;Additional personnel\n* Daniel Castleman – production, engineering\n* Tue Madsen – mixing, mastering\n* Brian Lawlor and Ryan Kelly – orchestral arrangements\n* Ash Avildsen – booking\n* Steve Joh – A&R\n* Pär Olofsson – artwork\n* Rob Kimura – layout, design\nReferences"
    }
  ]
}