{
  "content": [
    {
      "type": "text",
      "text": "# The Holding (Fear the Walking Dead)\n\n(AMC+)\n*  (AMC)\n| director     = K.C. Colwell\n| writer       = Channing Powell\n| length       = 50 minutes\n| music        =\n| guests       = * John Glover as Theodore Maddox\n* Nick Stahl as Jason Riley\n* Chinaza Uche as Derek\n* Brigitte Kali Canales as Rachel\n| prev         = Handle with Care\n| next         = In Dreams\n| episode_list = List of Fear the Walking Dead episodes\n| season_article = Fear the Walking Dead (season 6)\n}}\n\"The Holding\" is the eleventh episode of the sixth season of the post-apocalyptic horror television series Fear the Walking Dead, the 80th episode overall,  \"The Holding\" was released on the streaming platform AMC+ on April 30, 2021, in the United States and aired on television on AMC two days later, on May 2, 2021.\nAn infiltration into the underground bunker unexpectedly turns into a rescue mission as the members of the group dig deeper into an underground community and their plans for the future.\nPlot\nAlicia (Alycia Debnam-Carey), Althea (Maggie Grace), Luciana (Danay García), and Wes (Colby Hollman) pose as new recruits to infiltrate a cult like underground settlement called \"The Holding,\" where workers turn walkers into dirt to farm food. As they enter the underground hall via an elevator, they pass a wall where \"THE END IS THE BEGINNING\" is painted.\nA worker named Riley (Nick Stahl) questioned them at the behest of The Holding’s leader, Teddy (John Glover). As part of their initiation, the group has to examine a walker tangled in foliage and describe “what they see”. Later, a group of people arrive, including Wes’ brother Derek, whom Wes thought had died long ago. As they reunite, Derek reveals he is the one who started painting the message. Wes tries to get more information, but Derek claims that Wes \"isn't ready yet.\" While Derek is gone, Wes and Althea search Derek's room and find maps of the local settlements, including Tank Town and Lawton, as well as the whereabouts of Isabelle's group. Wes confronts Derek about The Holding attacking settlements; Derek explains that the only way the world can start over is by destroying everything and everyone on the surface.\nThe group tries to escape, taking Derek with them, but they are caught by Riley, who leads them to an embalming room. He offers to spare their lives if they reveal Morgan's location. They all refuse, but Derek is allowed to try to show Wes \"the truth.\" Derek leads Wes back to the walker on display and ask him what he sees. Wes realises Derek knew he was in Tank Town during the attack; he answers that he sees a mirror image in the walker, but not of himself. A fight ensues. Wes overpowers Derek and slams him into the walker. The walker bites Derek, killing him.\nWes returns to his friends and holds Riley at gunpoint, they flee into a room full of embalmed walkers; Alicia opens several to release the embalming fluid and sets the complex on fire while the others escape. Upon their return, Morgan promises to rescue Alicia.\nBack at the Holding, Alicia kills a cultist who attempts to embalm her. She meets Teddy, who is upset that she destroyed everything he was working for, but he admits he has been looking for someone like her for a long time.\nReception\nCritical reception\nDavid S.E. Zapanta from Den of Geek! rated the episode 4.5 out of 5 and wrote: \"It’s not until we meet Teddy in the flesh that “The Holding” goes from a good episode to a great one [...] John Glover commands the screen the moment he appears, looking every bit like the charismatic leader of a doomsday cult.\" Paul Daily of TV Fanatic praised the episode as \"an action-packed, tension-filled delight\". Emily Hannemann of TV Insider gave the episode 4 out of 5 stars, saying \"I'm interested to see where Alicia's story goes from here.\" Ray Flook of Bleeding Cool wrote, \"And that's what I loved about \"The Holding\"- questions brought answers that brought more questions, leaving us feeling both satisfied and counting down the days until the next chapter.\" Erik Kain of Forbes was not impressed with the latests villains but expressed hope for Teddy.\nRatings\nThe episode was seen by 1.03 million viewers in the United States on its original air date, below the previous episodes.\nReferences\nExternal links\n* [https://www.amc.com/shows/fear-the-walking-dead/episodes/season-6-the-holding--58742 \"The Holding\"] at AMC.com\n*"
    }
  ]
}