{
  "content": [
    {
      "type": "text",
      "text": "# The Parking Lot Movie\n\n| music = Sam Retzer\n| studio = Redhouse Productions LLC\n| released =\n| runtime = 71 minutes\n| country = United States\n| language = English\n}}\nThe Parking Lot Movie is an American documentary film directed by Meghan Eckman. It was filmed from 2007 to 2010 and premiered at the South By Southwest film festival in Austin, Texas in 2010. It was purchased by PBS and aired nationwide on Independent Lens October 19, 2010, opening the series' 2010 season.\nSynopsis\nThe Parking Lot Movie follows a group of parking lot attendants who work at The Corner Parking Lot in Charlottesville, Virginia. They have to deal with drunken, rude, and cheap patrons, as well as vandals.\nThe film centers on the experience of the attendants, who are primarily students at the nearby University of Virginia, and mostly majoring in Liberal Arts subjects such as Philosophy or Anthropology. The result is that they are given the opportunity, while working at the Corner Parking lot, to examine aspects of the human condition in terms of societal norms and values, as well as to refine their own personal philosophy of life. In the words of John Lindaman, one of the attendants who had worked there for 11 years: \"It taught me how to be a human being.\" It is this aspect of the film that sets it apart from other documentaries.\nProduction\nDirector Meghan Eckman and assistant director Christopher Hlad filmed The Parking Lot Movie over a three-year period, from 2007 to 2010, predominantly in and around the Corner Parking Lot in Charlottesville, Virginia. The crew interviewed at least 21 people associated with the parking lot, including owner Chris Farina, current attendants, and former attendants.\nFor the soundtrack, Eckman hired New York-based musician Sam Retzer, who had spent several years as a student in Charlottesville. Other songs on the soundtrack are written and performed by former parking lot attendants featured in the movie, including Mark Schottinger and John Lindaman.\nFilm festivals\n* South by Southwest Film Festival, Austin TX 2010\n* Independent Film Festival of Boston MA 2010\n* Hot Docs Canadian International Documentary Festival, Toronto 2010\nReception\nThe film was generally well-received. Neil Genzlinger, reviewing the film for The New York Times, compared watching it to actually working at a parking lot, in that \"there are long stretches when not much happens, but every once in a while there’s a burst of activity that is kind of enthralling.\"  In particular, he praised the occasional moments when \"the [film's] mix of absurdism and intellectualism is perfect.\"\nSee also\n*Charlottesville, Virginia\n*Parking lot\nReferences\n*\n*\n*\nExternal links\n* [http://www.efilmcritic.com/review.php?movie=20282&reviewer=371 eFilmCritic.com review]\n* [http://www.torontoscreenshots.com/2010/05/05/parking-lot-movie/ Toronto Screen Shots review]\n* [https://www.imdb.com/title/tt1504300/ IMDB page]\n* [http://www.rottentomatoes.com/m/the_parking_lot_movie/ Rotten Tomatoes page]"
    }
  ]
}