{
  "content": [
    {
      "type": "text",
      "text": "# The Queen's Award for Enterprise: Innovation (Technology) (2009)\n\n'''The Queen's Award for Enterprise: Innovation (Technology) (2009)''' was awarded on 21 April 2009, by Queen Elizabeth II.\nRecipients\nThe following business units were awarded this year.\n* Aerelink Limited of Merseyside for design and delivery of bespoke wireless solutions and provision of high calibre engineering services.\n* AESSEAL (MCK) Ltd of Lisburn, County Antrim for flow fuse - utilised with mechanical seals used, on pump equipment.\n* Alcomet Limited of Kingswinford, for guardian security products.\n* Alford Technologies Limited of Chippenham, Wiltshire for user-filled high explosive charges which project high velocity water for the neutralization of improvised bombs.\n* Alumet Systems (UK) Ltd of Southam, Warwickshire for ABLE Façade for system building protection from bomb blasts\n* Apical Limited of London for W1 'iridix' digital core which models how the human eye adapts to changing viewing conditions.\n* Astech Projects Limited of Runcorn, Cheshire for automated pharmaceutical testing of metered dose and dry powder inhalers.\n* Autonomy Corporation of Cambridge for Intelligent Data Operating Layer (IDOL).\n* Beamer Limited of Salisbury, Wiltshire for design and development of a high mobility all-terrain disability buggy.\n* Blizzard Protection Systems Limited of Bangor, Gwynedd, Wales for REFLEXCELL - lightweight thermal protection for casualties.\n* BullionVault London W6 Gold bullion dealing and storage for private investors.\n* CGC Technology Ltd of Farnham, Surrey for design, manufacture, installation and commissioning of satellite tracking systems.\n* Cartesian Limited of WC2, London for  'Ascertain' software for telecommunications operators.\n* Centek Limited of Newton Abbot, Devon for bow spring, non-welded casing centralisers for the oil industry.\n* Oliver Crispin Robotics Ltd (t/a OC Robotics) of Filton, Bristol for development of snake-arm robots for confined space applications\n* Crux Products Limited of Godstone, for grout seal.\n* Disposable Cubicle Curtains Ltd of Horsham for 'Easy-fit' patented disposable cubicle curtains\n* EnviroVent Limited of Harrogate, for EnviroVent 'filterless' energy-saving extractor fan.\n* Excalibur Screwbolts Ltd of Hockley, Essex for the one piece Excalibur Screwbolt high performance fixing anchor for all substrates.\n* Flare Solutions Limited of Marlow, Buckinghamshire for E & P catalog web based software product and consulting.\n* Forge Europa Limited of Ulverston, Cumbria Custom design of for lED displays, assemblies and lighting solutions.\n* Golf-Tech Limited of Swindon, Wiltshire for \"Power Tee\" automatic golf tee for driving ranges.\n* GreenMech Ltd of Alcester, for tracked tool carrier designed to access difficult terrain.\n* Greenstar WES Limited of Redcar, Cleveland for innovation in recycling food-grade and other plastics.\n* IHC Engineering Business Ltd of Riding Mill, Northumberland for design and manufacture of systems for offshore oil and gas, telecom, renewables and defence.\n* Johnson Matthey Emission Control of Royston, for compact soot filters for diesel cars.\n* Kingspan Tarec Industrial Insulation Limited of Glossop, Derbyshire for continuous production process for the manufacture of phenolic pipe insulation.\n* Knorr-Bremse Rail Systems (UK) Limited of Melksham, Wiltshire for eP2002 modular, mechatronic rail brake control valve.\n* McLaren Electronic Systems Ltd of Woking, Surrey for the Standard Electronic Control Unit for FIA Formula for one racing cars.\n* Pace Plc of Saltaire, for high definition set-top box technology.\n* PhysE Limited of Yarmouth, Isle of Wight for derivation of meteorological and oceanographic design criteria for offshore installations.\n* Plextek Ltd of Great Chesterford, for electronic product design, supply and consultancy.\n* Possum Limited of Aylesbury, for disability home control unit with touch screen.\n* Powertraveller Ltd of Alton, Hampshire for portable power solutions for electronic devices.\n* RF Engines Ltd of Newport, Isle of Wight for electronic product and systems design using complex digital signal processing techniques.\n* Renishaw plc of Wotton-under-Edge, Gloucestershire for oMP400 ultra-compact strain gauge spindle probe with RenGage  3D technology\n* ScriptSwitch Limited of Coventry for prescribing decision support for the medical profession, increasing clinical standards and reducing costs.\n* Sirus Automotive Ltd of Wednesbury, West Midlands for product development and production methods of vehicles for wheelchair users.\n* Smartstak of Sheffield for a load handling system which eliminates breakages when transporting glass bottles.\n* Sondrel Ltd of Reading, Berkshire for implementation of complex integrated circuits.\n* TRL Technology Limited of Tewkesbury, Gloucestershire for BROADSHIELD Counter for radio-controlled Improvised Explosive Device solutions for military, civilian and VVIP protection.\n* Thermo Fisher Scientific (Cambridge UK) of Cambridge for the iCAP 6000 Series Inductively Coupled Plasma Optical Emission Spectrometer (ICP-OES).\n* Tracerco of Billingham for a range of radiation and contamination monitors.\n* Valor Fires of Erdington for Homeflame high efficiency inset gas fire range.\n* Vascutek Limited of Inchinnan, Renfrewshire for bioValsalva - porcine aortic valved conduit.\n* West Energy Saving Technologies Ltd of Bramcote, Nottingham  VENTMISER CMSM (carbon management for switch module) automatic ventilation controllers.\n* Wireless CCTV Ltd of Rochdale, Lancashire Wireless for CCTV dome cameras for mobile surveillance.\n* Women Like Us of London N19 for supporting women with children to return to work and employers to source experienced part-time staff.\nReferences"
    }
  ]
}