{
  "content": [
    {
      "type": "text",
      "text": "# The Sinking of the Laconia\n\n| last_aired           =\n}}\nThe Sinking of the Laconia is a two-part television film, first aired on 6 and 7 January 2011 on BBC Two, about the Laconia incident; the sinking of the British ocean liner RMS Laconia during World War II by a German U-boat, which then, together with three other U-boats and an Italian submarine, rescued the passengers but was in turn attacked by an American bomber.\nThe film is a British-German co-production, written by Alan Bleasdale, directed by Uwe Janson, and with Andrew Buchan, Brian Cox, Ken Duken, Morven Christie, Lindsay Duncan, Thomas Kretschmann and Franka Potente in the leading roles. It was shot in Cape Town, South Africa.\nPlot\n]]\nIn September 1942, 650&nbsp;nautical miles west of Africa, the German U-boat  sinks the British troopship Laconia en route from Cape Town to the United Kingdom.\nRealising there are Italian POWs and civilians amongst the shipwrecked facing certain death without rescue, U-boat Commander Werner Hartenstein (Duken) defies the orders of the German Naval High Command by surfacing and ordering his men to save as many survivors as possible. U-156 crams 200 people on board the surfaced submarine, takes another 200 in tow in four lifeboats, and assists the remaining shipwrecked surrounding the U-boat in lifeboats and small rafts. When Hartenstein dives with all survivors on board, the additional weight puts the submarine into a crash dive. He regains control and surfaces again. He has a Red Cross flag displayed and a message sent to the Allies to organise the rescue of the survivors. The Italian prisoners are taken off U-156 by another U-boat and an Italian submarine.\nA British request for American assistance locating Laconia'' survivors didn't mention the submarine's rescue effort, and a B-24 Liberator from Ascension Island attacks the submarine and U-156 resumes its patrol duties, leaving behind the lifeboats with the British survivors to be picked up by a Vichy French naval surface ship sent by Admiral Dönitz. While admiring Hartenstein's actions, Dönitz also reluctantly composes the Laconia Order to other U-boat commanders not to rescue survivors in the future. The French ship arrives and one lifeboat leaves the others, travelling independently to the coast of West Africa. A British merchant officer injured in the American attack remains with U-156 as a prisoner. Dönitz awards Hartenstein the Ritterkreuz and proposes to repost him to a headquarters staff assignment. Preferring to remain with his men, Hartenstein refuses the post and a final on-screen message reports U-156s later sinking with no survivors.\nProduction\nThe production was a cooperation of the British BBC with the German ARD Degeto and SWR Fernsehen, executed by TalkbackThames and Teamworx. It was shot in Cape Town, South Africa.\nThe idea to bring the story of the Laconia to screen was conceived in 2004 by the Talkback Thames head of drama Johnathan Young.\nFull cast\nRMS Laconia\nU-156\nRoyal Navy at Sierra Leone\nU-boat command\n* Thomas Kretschmann - Admiral Karl Dönitz, Befehlshaber der U-Boote\n* Nikolai Kinski - Korvettenkapitän Walter Drexler, Dönitz's aide\nUS Army Air Force at Ascension Island\nOther\n* Simon Verhoeven - Korvettenkapitän Harro Schacht, captain,\n* Paul Savage - Egyptian Customs Officer\nFollow-up programme\nOn 9 January 2011, BBC Two broadcast a half-hour documentary, ''The Sinking of the Laconia: Survivors' Stories, featuring testimonies from the actual survivors of Laconia. Beginning 14 April 2012, Ovation television aired The Sinking of the Laconia'' in the United States.\nSee also\n* Laconia Order\nFootnotes\nReferences\nExternal links\n*"
    }
  ]
}