{
  "content": [
    {
      "type": "text",
      "text": "# The Brookings Register\n\n| headquarters       = 312 5th Street, Brookings, South Dakota 57006\n| ISSN               =\n| website            =\n}}\nThe Brookings Register is a newspaper of South Dakota. The newspaper's offices are in Brookings, South Dakota. The newspaper is used for public notices including those published for the South Dakota Public Utilities Commission. The Brookings Register was owned by the News Media Corporation until it closed in 2025.\nAfter a period of four days, the Register was acquired by Champion Media, alongside the three other newspapers owned by the News Media Corporation in South Dakota. The Brookings Register publishes daily Monday through Friday afternoon and Saturday morning with a focus on local news and sports.\nHistory\nThe  Brookings Register dates back to March 30, 1882, when the paper's forerunner, the weekly Brookings County Sentinel, began accounting the events of the Brookings region.  That first edition numbered six pages and featured on the first Page One, the death of Henry Wadsworth Longfellow, food recipes, and the battle against \"beer drinking in a civilized society.\"  George N. Breed and Charles D'A Wright, editors and publishers, gave their thanks on the editorial page \"to all upright citizens\" and to them the publishers extended the \"hand of mutual friendship.\"  It was their desire, the men said, to present the news of the day, discussions of topics of interest, and to help build up Brookings County.\nUnder the leadership of George Breed and Paul Dutcher, the first issue of the Brookings Register—eight pages—was printed on June 13, 1890.  At that time the city boasted a population of 1,700 people and the price of a subscription was $1.50 for a one-year subscription.  On January 6, 1891, the Register bought out the Sentinel.  Initially, the publication came out twice weekly, only to return to a weekly schedule in 1898.  Local pictures appeared in print in 1910 and the first advertisements for automobiles followed in 1911.  The Register resumed its twice-weekly publication schedule in 1948, under the ownership of the Mitchell family.  The paper turned daily in January 1970, publishing five days per week, Monday through Friday.  Later that year, the paper was sold to Stauffer Communications of Topeka, Kansas.  Stauffer held onto the Register until 1990, when Omaha World-Herald of Omaha, Nebraska purchased the paper.  The newspaper added a sixth day of publication—Saturday—in March 1995. News Media Corporation, of Rochelle, Illinois, bought the Register on February 1, 1999. The company ceased and shuttered the paper on August 6, 2025. After a period of four days, the Register was acquired by Champion Media of Mooresville, North Carolina, alongside the three other newspapers owned by the News Media Corporation in South Dakota.\nReferences\nExternal links\n*http://www.brookingsregister.com"
    }
  ]
}