{
  "content": [
    {
      "type": "text",
      "text": "# The Talking Propellerheads\n\n}}\nThe Talking Propellerheads was a high technology satire/rock/comedy band performing from 1982 through 1996. The group was composed of employees of Data General Corporation.  They were notable as the \"corporate band\" for Data General for over 14 years, playing at industry events and company functions. Their songs documented the fall of the minicomputer industry of the 1980s with their songs about Wang, DEC, Prime, IBM and other companies.  Their songs reported on changes in the minicomputer industry such as An Wang's retirement (\"they thought that Fred could run the company, but An said \"Fred, you're not the man for me\"), as well as documenting some of the players that formed the industry: Data General founders (Ed DeCastro and Herb Richman, in \"Eddie and Herb\", Tom West in \"Stairway to Heaven\", and Ken Olsen in \"Dec Stinks\").\nThe band performed in NYC, Boston, Orlando, Denver, Kansas City, Dallas, Nashville, Atlanta and San Francisco as well as other venues.  They also entertained at industry events such as Lotus World, NADGUG (Users group meetings), The Grey Eagles organization and the Uniforum Trade Show, where they opened for the Beach Boys, entertaining over 5,000 people. The band members initially were Systems Engineers (known as propellerheads), but over the years several of the band were Account Executives for the company.\nOrigins\nThe band started as a skit for the Northeast Sales Kickoff meeting with three acoustic guitars and a podium microphone.  They evolved into a full rock band with two lead guitars, rhythm guitar, bass, keyboard and drums. They made over 15 rock videos that were shown at various meetings and events to entertain and provide the “Data General Culture” for new-hires. They were known in the industry as the \"Prop-Tops\" and the TPHeads.\nStyle of songs\nTheir songs were parody songs, poking fun at the high tech industry, sales and their competition.  Their covers included everything from the Beatles (Drive My Car, B Side of Abbey Road) to Pink Floyd (Comfortably Numb) to Led Zeppelin (Rock and Roll, Stairway to Heaven) to Little Feat (Willin’).  Their repertoire consisted of over 100 songs performed live and in videos.\nThe band was founded by Tom Ptacek and Dan Fennelly when assigned to come up with a skit for the next sales meeting.  The first song was a parody of “My Generation” called “Desktop Generation”, a new computer product released by the company.\nLineup\nThe members of the band changed over the years but were mainly Dan Fennelly, Phil Flaherty, Patrick Wright (PATTY SMYTH, BEATLEMANIA), Bill Gustafson, Dan Chasse and Ira Leavitt.  They were featured in articles in the Wall Street Journal, the Milford Daily News, The Boston Globe and The Boston Herald.  They also were featured on Casey Kasem’s American Top 40 radio program as “the Hottest Band in Computerland.”\nSome song titles included \"Clariion Our Newborn Son\" (Carry On Wayward Son), “Don’t Say We Didn’t Warn Ya’\" (Hotel California), “Cobol Wizard” (Pinball Wizard), “I’m a Sales Man” (I’m a Soul Man), “Psycho Salesrep” (Psycho Killer) and they closed every Data General performance with a song about their competition titled “DEC Stinks” (Love Stinks).\nOther members of the band included Tom Ptacek (founder), Bruce Lutz, Greg Cullen, Mark Cain, Eileen DeCastro (wife of Data General founder Edson deCastro), Marisa Pavone, Linda Connly, Jay Sutermaster and Val Miller.\nRetirement\nThe band retired in 1996 after most of the band left the employ of Data General.\nLisa Alyward (née Weidner) died in April 2010 in a boating accident.\nPhil Flaherty died in March 2014 after a long illness.\nReferences\nhttp://www.langston.com/Fun_People/1994/1994AJV.html\nCasey Kasem’s American Top 40 (May 1994) – The Hottest Band in Computerland\nExternal links\n*[http://www.talkingpropellerheads.com Official Website]"
    }
  ]
}