{
  "content": [
    {
      "type": "text",
      "text": "# The Kingfisher Caper\n\n| runtime        = 86 minutes\n| country        = South Africa\n| language       = English\n| budget         =\n| gross          =\n}}The Kingfisher Caper (released as Diamond Hunters in South Africa and as Diamond Lust on video) is a 1975 South African film directed by Dirk DeVilliers for Kavalier Films Ltd. It stars Hayley Mills (as Tracey van der Byl), David McCallum (Benedict van der Byl), Jon Cypher (Johnny Lance), Volente Bertotti (Ruby Lance), Barry Trengove (Cappy) and Bill McNaught (Hendrich van der Byl).\nCast\nMain cast\n* Hayley Mills as Tracey Van Der Byl\n* David McCallum as Benedict Van Der Byl\n* Jon Cypher as Johnny Lance\n* Barry Trengove as Cappy\n* Volenté Bertotti as Ruby Lance\n* Bill McNaught as Hendrich Van Der Byl\n* Don Furnival as Mac\n* Gordon van Rooyen as Kramer\n* Stanley Leeshaw as Osaki\n* Pieter Geldenhuys as Attorney\n* Ray Novak as Joe\n* Ian Botha as Sampson\nSupporting cast\n* Dirk de Villiers as Les (uncredited)\nProduction\nFilm rights were bought by Philip Vrasne, who wanted to make it in South Africa.\nKingfisher Caper writer Roy Boulting was married to star Hayley Mills at the time of the filming. This was his final writing credit.\nFilmink magazine called it \"typical of several South African movies from the 1970s that attempted to crack the international market (The Shangani Patrol, Funeral for an Assassin, Killer Force, Target of an Assassin, Golden Rendezvous, Game for Vultures): a half-baked action piece with B-list stars (Hayley Mills, David McCallum), iffy handling and one or two decent moments. Roy Boulting, married to Mills at the time, gets a script credit, his last; the film helped kill her career as a movie star.\"\nRemake\nIt was remade as the 2001 miniseries The Diamond Hunters with Alyssa Milano, Roy Scheider, Sean Patrick Flanery and Michael Easton in the Mills, McNaught, Cypher and McCallum roles respectively; Jolene Blalock, Armin Rohde and Hannes Jaenicke also featured.\nReferences\nExternal links\n*[https://www.imdb.com/title/tt0073247 The Kingfisher Caper] at the Internet Movie Database"
    }
  ]
}