{
  "content": [
    {
      "type": "text",
      "text": "# The Winter War (novel)\n\n| translator    = Richard Impola\n| image         = The Winter War.jpg\n| caption       = A book cover of the English translation.\n| author        = Antti Tuuri\n| illustrator   =\n| cover_artist  =\n| country       = Finland\n| language      = Finnish\n| genre         = War novel\n| publisher     = Otava (Finnish)Aspasia Books (English)\n| release_date  = 1984\n| english_release_date = 2003\n| media_type    = Print (hardback & paperback) & audio book (cassette, CD, ebook)\n| pages         = 242 pp (Finnish)208 pp (English)\n| isbn          = 0-9731053-7-2\n| oclc          = 53793184\n| series        = Ostrobothnia series\n| preceded_by   = A Day in Ostrobothnia\n| followed_by   = American High Street\n}}\nThe Winter War () is a 1984 Finnish war novel by Antti Tuuri. It is part of the Ostrobothnia book series and it tells the story of Martti Hakala about his experiences in the Winter War. An English translation by Richard Impola was released in 2003.\nPlot\nThe war path of Martti Hakala (who acts as the narrator of the book) and his younger brother Paavo Hakala begins on October 13, 1939, when the men go with other conscripts from Kauhava for extra refresher training. The Hakala brothers are placed in the infantry regiment 23, which was made up of people from Ostrobothnia, and was commanded by lieutenant colonel .\nThe regiment is concentrated by train transport and foot marches to the Karelian Isthmus. Before the outbreak of war, the regiment trains and participates in fortification works in the villages of Unnunkoski and Konnitsa. In Konnitsa, a romance develops between Paavo Hakala and a local young woman, which ends when the woman's family leaves for the evacuation center. At the same time, Paavo also has a romance with a neighbor's girl.\nAfter the outbreak of the Winter War, the regiment is ordered to the front line in the open field of Terenttilä in Metsäpirtti on Independence Day. In Terenttilä, Martti and Paavo fight successfully against the Red Army. Martti Hakala describes the warfare very accurately. Paavo Hakala is wounded in Terenttilä and goes on home leave. Shortly after returning from home vacation, Paavo dies by a direct hit from enemy artillery in front of Martti's eyes. Martti is deeply affected by his brother's death, but in the reality of war there is no possibility to mourn. Martti finds love letters in Paavo's belongings that Paavo received from a woman he met in the village of Konnitsa. To protect his brother's reputation, Martti burns the letters.\nThe regiment will be moved from the fields of Terenttilä to rest on Boxing Day. Martti gets to visit home on vacation during his rest. After the holiday, Martti's team will spend some time renovating the rear lines of the Taipale front. After this, the regiment is quickly transferred to the Äyräpää front. The regiment experiences very heavy losses in Äyräpää and the entire front is close to collapse. Martti and the rest of the regiment are at the limit of their fighting ability. The coming of peace on March 13, 1940 saves Martti and the rest of the regiment's depleted men.\nIn the last sentences of the book, Martti describes the great bitterness he experienced at how, despite the great losses, the Finnish Army had to withdraw to the borders according to the Moscow Peace Treaty and hand over the territories it defended to the Soviet Union.\nFilm adaptation\nIn 1989, a film adaptation based on the novel was released, directed by Pekka Parikka and starring by Taneli Mäkelä, Vesa Vierikko and Timo Torikka. Tuuri also participated in the making of the film as a screenwriter.\nSee also\n* Finnish literature\n* The Unknown Soldier (novel)\nReferences\nExternal links\n* [https://www.kirjasampo.fi/fi/kulsa/kauno%253Aateos_32565 Talvisota] at Kirjasampo (in Finnish)\n* [https://www.theculturalexperience.com/books/the-winter-war/ The Winter War] at The Cultural Experience"
    }
  ]
}