{
  "content": [
    {
      "type": "text",
      "text": "# The Lost Vikings 2\n\n|NA|May 1997}}Saturn|EU|May 26, 1997}}MS-DOS, Windows}}PlayStation}}Windows, Switch, PlayStation 4, Xbox One\n}}\n|genre = Puzzle-platform\n|modes = Single-player, multiplayer\n}}\nLost Vikings 2 is a 1997 puzzle-platform game developed by Beam Software and published by Interplay. All versions of the game, except the SNES release, were titled Lost Vikings 2: Norse by Norsewest (Norse by Norse West: The Return of The Lost Vikings in the U.S.). The sequel to The Lost Vikings, it features the original three characters plus two new playable characters: Fang the werewolf and Scorch the dragon. The gameplay remains largely the same, though the three Viking characters all have new or modified abilities.\nThe releases for MS-DOS, Microsoft Windows, PlayStation, and Saturn feature pre-rendered 3D graphics, CD music and extensive voice acting provided by Rob Paulsen (Erik), Jeff Bennett (Baleog and Fang), Jim Cummings (Olaf, Tomator), and Frank Welker (Scorch). The SNES version by Blizzard Entertainment continued the use of the more cartoony graphics style seen in the original game.\nIn celebration of the company's 30th anniversary, the SNES version of The Lost Vikings 2 was re-released for Microsoft Windows, Nintendo Switch, PlayStation 4 and Xbox One as part of the Blizzard Arcade Collection on April 13, 2021.\nPlot\nAfter escaping from Tomator in The Lost Vikings, Erik the Swift, Olaf the Stout, and Baleog the Fierce have lived joyous and fruitful Viking lives. Then one day, after returning home from a fishing trip, the Vikings get captured by Tomator again. Tomator then calls upon a robotic guard to send them into the Arena, which falls short when a system failure happens. During the blackout, the three Vikings dismantle the robot piece by piece and wear its parts on their bodies, granting them new abilities. The three Vikings are then accidentally sent through time once again. Equipped with the new robotic gear, Erik, Olaf, and Baleog must journey through each level to find their way back home. Along the way, they befriend a werewolf named Fang and a dragon named Scorch, both of whom assist them in their quest.\nGameplay\nLost Vikings 2 is a side-scrolling platform adventure in which the player alternates control of three of the five playable characters, guiding each of them one at a time from a designated start point in each level to the exit, collecting three specific items along the way. The game predetermines which characters are available in any specific level. Control may be swapped from character to character at any point. In the two-player cooperative mode, each player simultaneously controls one character and is allowed to change control to the third, unused character at any point. Every level is designed such that each character must contribute his unique skills to help the other two through to the end. Similarly, to finish the level, all three characters must reach the exit point with the three items in possession. The characters each have three health points which they can lose by getting hurt by enemies or by falling from great heights. Should any character run out of health points, he dies; gameplay will then continue with any remaining characters, but the level becomes unwinnable, and the player will eventually have to restart the level and try again (the game offers unlimited continues).\nEach character has the ability to carry and use items — mainly keys, bombs, and food (which restore health points) — as well as a unique set of skills:\n* Erik now has turbo boots which allow him to jump much higher than before and can smash certain overhead walls with his turbo jump. The helmet also allows him to swim.\n* Baleog has a bionic arm which can smash enemies from a distance. The range is somewhat limited compared to his arrows from the first game, but the bionic arm also allows Baleog to swing in the air using special hooks and to grab some items inaccessible to others.\n* Olaf can release a fart that propels him upward, giving him limited aerial range as well as the power to destroy certain floors. In addition to his hang-gliding abilities, he can also shrink and squeeze through tiny gaps.\n* Fang can jump, climb walls by clinging to them with his claws, and slash enemies from close range.\n* Scorch has a fireball attack which damages enemies and can trigger certain switches. He can also fly until he gets exhausted, at which point he can glide softly down, like Olaf.\nRelease\nA 3DO Interactive Multiplayer version of The Lost Vikings 2 was announced to be in development and slated to be published by Interplay during E3 1995. This version was never released.\nReception\n7.625/10 (SNES)\n| GSpot = 8.4/10 (PS1)8.3/10 (PC)\n| NGen =  (SAT)\n|PCPP=72% (PC)\n| rev2 = Sega Saturn Magazine\n| rev2Score = 89% (SAT)\n}}\nThe Saturn and PlayStation versions were met with generally positive reviews. While most critics remarked that the graphics are subpar for their generation, they praised the humorous voice clips and, while noting that the challenge level is extremely high and would be frustrating for some players, they also felt it to be entirely fair and intellectually stimulating. For instance, Dan Hsu of Electronic Gaming Monthly opined that having to start levels over if even one of the Vikings dies is \"unforgiving, but necessary\", and his co-reviewer Crispin Boyer remarked, \"The later levels are especially tough, but they're also rewarding if you can figure them out (don't be a quitter!).\" Next Generation said the game had retained the original's strong puzzles: \"The levels are still nicely designed and have a reasonable learning curve.\" GamePro was less certain, remarking that though the gameplay and puzzles are deep and fun, they could not wholly recommend the game due to its graphical mediocrity. Trent Ward of GameSpot, however, disagreed with the majority assessment of the graphics, stating that \"Although it's no visual feast, Norse by NorseWest still looks pretty good for what is, at its heart, a puzzle game.\" Lee Nutter of Sega Saturn Magazine called the game \"excellent fodder for platform/puzzle enthusiasts, with plenty of lastability.\"\nThe four reviewers of EGM noted that the only difference between the SNES version and the earlier Saturn and PlayStation versions are the graphics and the lack of voices, leaving the gameplay and personality intact. They commented that this means SNES loyalists lose nothing important by getting the game for SNES instead of a current generation console, but also that those who had already bought the game for another system had no reason to get it again, since the puzzles are all the same and can only be completed in one way. GamePro was dissatisfied with the graphics and sound effects, saying they are unimproved from the original The Lost Vikings and thus don't hold up to SNES games released in recent years. However, the reviewer praised the implementation of the characters' abilities and the humor.\nReferences\nExternal links\n*[https://www.mobygames.com/game/norse-by-norse-west-the-return-of-the-lost-vikings The Lost Vikings 2] at MobyGames"
    }
  ]
}