{
  "content": [
    {
      "type": "text",
      "text": "# The Phoney Civilization (TV musical)\n\n| runtime        = 82 minutes\n| country        = Bulgaria\n| language       = Bulgarian\n| budget         =\n| gross          =\n}}\nThe Phoney Civilization ( / Krivorazbranata tsivilizatsiya) is a satirical TV musical released in 1974 by the Bulgarian National Television, directed by Hacho Boyadzhiev, starring Georgi Partsalev, Georgi Kaloyanchev, Ruzha Delcheva, Nikola Anastasov, Lora Keranova and Zorka Dimitrova. The work is a musical adaptation based on the 1871 classical play by the Bulgarian playwright Dobri Voynikov. The music is composed by Decho Taralezhkov.\nThe production is in the scope of the programme called Television theatre, a popular programme which has been realized by the Bulgarian television during the 1970s and the 1980s. In a folklore manner, the musical ridicules the \"fashionable\" trends of behaviour and imitation of the foreign models. The accurately chosen cast, featuring some of the leading Bulgarian comic actors, the vivid scenography as well as the memorable music turn the work into a classic example of the Bulgarian performing arts from those years.\nCast\n* Georgi Partsalev as Hadzhi Kosta, the head of the family.\n* Ruzha Delcheva as Zlata, the Hadzhi Kosta's wife.\n* Zorka Dimitrova as Anka, the Hadzhi Kosta and Zlata's daughter.\n* Georgi Kaloyanchev as Margaridi, Anka's suitor, snob, imitator of foreign models.\n* Nikola Anastasov as Dimitraki, the Anka's brother.\n* Lora Keranova as Grandma Stoyna, a matchmaker.\n* Mariana Alamancheva as Mariyka, Anka's friend.\n* Iliya Dobrev as Mityu, the shy young man in love with Anka.\n* Vasil Popov as Georgi, Mityu's friend.\n* Hindo Kasimov as Pencho, Mityu's friend.\n* Kosta Karageorgiev as Raycho, a weak-minded domestic servant.\n* Evstati Stratev as Maystor Stanyu, the Mityu's father.\nReferences\nSources\n*\nExternal links\n* [https://web.archive.org/web/20120110044748/http://bnt.bg/bg/movies/details/1293/krivorazbranata_civilizacija The Phoney Civilization] at the Bulgarian National Television\n* [http://www.slovo.bg/showwork.php3?AuID=249&WorkID=8678&Level=2 The Phoney Civilization play] web page"
    }
  ]
}