{
  "content": [
    {
      "type": "text",
      "text": "# The President's Plane Is Missing (novel)\n\n'The President's Plane Is Missing' is a 1967 novel by Robert J. Serling. The book was made into a made-for-TV film by the same name, directed by Daryl Duke, which aired on 23 October 1973 in the United States. The book tells the story of a crash of Air Force One in remote terrain and the uncertainty stemming from the lack of confirmation whether the president of the United States is alive or dead. The vice president, an unpopular figure, pressures the cabinet to declare him acting president under the terms of the 25th Amendment so he can address a growing crisis with China with a pre-emptive nuclear strike.\n''The President's Plane Is Missing spent multiple weeks on The New York Times Best Seller list, and its success enabled Serling to become a full-time writer. Serling later penned a sequel to the novel entitled Air Force One Is Haunted'', in which the ghost of President Franklin Delano Roosevelt haunts the incumbent president whenever he boards Air Force One.\nSynopsis\nAir Force One crashes in a storm in a remote area and the badly-burned and scattered bodies cannot be definitively identified, making it impossible to confirm that President Jeremy Haines has been killed, which would allow his vice president, Fred Madigan, to automatically assume the presidency.  In this uncertainty, and amid a growing crisis with China that threatens to lead to war, Madigan (a weak character, pushed along by his ambitious wife) contemplates invoking Article Three of the 25th Amendment to become acting president, though he needs majority support from the cabinet to do so.  He was not privy to Haines's plans, and receives contradictory advice from the national security advisor (who claims Haines was ready to declare war) and the secretary of state (who insists Haines was planning a more peaceful way of containing the threat).\nThe cabinet is split on the issue and tensions increase when Madigan declares that once acting president, he will launch a pre-emptive strike on China.  The novel's climax is the sudden appearance of Haines, alive and well.  He'd never been on Air Force One (and had sent a look-alike to board the plane in his place), but instead had secretly traveled to Camp David for highly-sensitive treaty negotiations with the leader of the Soviet Union to contain China.  Only the secretary of state knew of the plan but had been sworn to secrecy lest the treaty negotiation fail.\nFilm\nIn 1973 a film adaptation of the book was aired on television, starring Peter Graves and Buddy Ebsen. Filming for ''The President's Plane Is Missing'' had been completed in 1971, but Graves reported that the film did not air until 1973 due to the film's villains being Chinese and President Richard Nixon's then negotiations with China.\nReferences\nExternal links\n*"
    }
  ]
}