{
  "content": [
    {
      "type": "text",
      "text": "# The Immobile Empire\n\nThe Immobile Empire is the English translation of ''L'empire Immobile, Ou, Le Choc Des Mondes: Récit Historique'', a book of history published in French 1989 by the French politician and writer Alain Peyrefitte and translated into English in 1992. The book gives a sweeping narrative of the British Embassy of Sir George Macartney to the Qianlong Emperor of China in 1793. The book  was translated into English, Chinese, Dutch, and Portuguese. Peyrefitte contends that the frustration of the mission and the stand-off in relations between Great Britain and China over diplomatic and audience ritual was caused by the ignorant intransigence and cultural conceit of the imperial court. The empire was \"immobile\" because these attitudes stifled China's natural creativity and kept it bureaucratic, static, and feeble over the following century and a half.\nPeyrefitte used his official connections to gain access to archives in Beijing's Palace Museum and organized a team of researchers to explore them. They found documents concerning the mission, some of which had not been opened since the 1790s, and translated a collection of them.\nReception and debate\nThe book was widely reviewed, and eventually came out in 36 editions between 1989 and 2007 in 7 languages   The reviews reflect larger controversies over China's traditional foreign relations and relations with the west over the last two centuries, particularly attitudes toward globalization and empire. Jane Kate Leonard writing in the American Historical Review was critical, concluding that the book was \"a pretentious and undigested work of limited antiquarian interest.\" The review also contends that Peyrefitte's work does not add to earlier scholarship by J.L. Cranmer-Byng and Earl H. Pritchard.  The University of Chicago historian James L. Hevia published a revisionist study which specifically argued that Peyrefitte and others of the \"free trade\" interpretation overemphasized economic motives and suggested instead that the British and the Manchu empires both were expanding and both were as much concerned with \"ritual\" (in the sense of cultural forms) as with profits as such. Princeton University scholar Benjamin A. Elman commented that Peyrefitte painted a \"dark picture\" of China and recommended that readers consult other works as a corrective.\nEditions\n*  Alain Peyrefitte, The Immobile Empire (New York: Knopf : Distributed by Random House,  1992 )[https://books.google.com/books?id=R1tnAAAAMAAJ&q=Immobile+empire Google Books]\n* Alain Peyrefitte. ''L'empire Immobile, Ou, Le Choc Des Mondes: Récit Historique. Paris: Fayard,  1989.  , .\n* 停滯的帝國 Ting Zhi Di Di Guo (Taibei Shi: Feng yun shi dai chu ban gu fen you xian gong si,  1995).\n* Guoqing Wang, tr.停滯的帝國 : 两个世界的撞击 (Ting Zhi Di Di Guo: Liang Ge Shi Jie De Zhuang Ji) (Beijing: SDX Joint Publishing Company, 1993, 2nd ed. 1997; 3rd ed. 2005).\n* China en het Westen (Kampen: Kok-Agora, 1991).\n* O Império Imóvel, Ou O Choque Dos Mundos. Lisboa: Gradiva,  1995. , , , .\n* The Collision of Two Civilisations: The British Expedition to China in 1792-4 (London: Harvill,  1993  ).\n* Det Uforanderlige Kina Eller Mødet Mellem to Uforenelige Verdener ([Kbh.]: Forum,  1990  ).\n* L'impero Immobile, Ovvero, Lo Scontro Dei Mondi''. Milano: Longanesi,  1989.  , .\nNotes\nReferences\n* Hevia, James Louis. (1995). [https://books.google.com/books?id=Uj6d9_4F0EIC&q=An+account+of+Macartney's+embassy+to+China  Cherishing Men from Afar: Qing Guest Ritual and the Macartney Embassy of 1793.] Durham: Duke University Press.\n* Léon Vandermeersch,[http://www.persee.fr/web/revues/home/prescript/article/befeo_0336-1519_1998_num_85_1_2593 \"L'empire Immobile Dans Tous Ses États: À Propos Des Ouvrages,\" ] ''Bulletin de l'École française d'Extrême-Orient ''85.1  (1998):  512-521 (Review Article)\nFurther reading\n* J. L. Cranmer-Byng, \"Lord Macartney's Embassy to Peking in 1793,\" Journal of Oriental Studies 4 [1957-58], 117-83\n* E. H. Pritchard The Crucial Years of Early Anglo- Chinese Relations, 1750-1800 (1936); \"The Kowtow in the Macartney Embassy to China in 1793,\" Far Eastern Quarterly 2 (1943), 163-203"
    }
  ]
}