{
  "content": [
    {
      "type": "text",
      "text": "# The Expeditionary Corps Embarks for Minorca at the Port of Marseille Under the Command of Marshal de Richelieu\n\nThe Expeditionary Corps Embarks for Minorca at the Port of Marseille Under the Command of Marshal de Richelieu is a major oil on canvas painting by Jean-Joseph Kapeller, signed and dated 26 March 1756. It was acquired by the French state in 1941 and assigned to musée Cantini in Marseille.\nIt was first exhibited on 29 August 1756 in the 'salle du Modèle' at the Académie de peinture de Marseille with the title The Port of Marseille and the Embarkation of War Munitions and Shot for the Expedition to the Island of Minorca, by Order and in the Presence of Monsieur the Marshal de Richelieu.\nDescription\nAnalysis\nPort, military and commercial square opened upon the world\nFichier:Kap1.jpg|alt=Tableau avec tracés géométriques afin d'apporter un complément d'informations au texte sur la composition de la toile.|Kapeller, 1756, schéma de la composition triangulaire.Agrandissez cette composition géométrique\nFichier:Ver1.jpg|alt=Tableau avec tracés géométriques afin d'apporter un complément d'informations au texte sur la composition de la toile.|Vernet, 1754, schéma de la composition triangulaire.Agrandissez cette composition géométrique\nFichier:Kap2.jpg|alt=Tableau avec tracés géométriques afin d'apporter un complément d'informations au texte sur la composition de la toile.|Kapeller, 1756, navires militaires et marchands.Agrandissez cette image pour distinguer les détails\nFichier:Kap3.jpg|alt=Tableau avec tracés géométriques afin d'apporter un complément d'informations au texte sur la composition de la toile.|Kapeller, 1756, foule hétéroclite des personnages.Agrandissez cette image pour distinguer les détails\nLe tableau de Joseph Vernet, ''Intérieur du Port de Marseille vu de l'Horloge du Parc'' (1754), antérieur de deux ans à celui de son élève Kapeller, fait partie de l'importante commande de « tous les ports de France » passée pour le roi  par Abel-François Poisson de Vandières, marquis de Marigny et frère de la marquise de Pompadour.  connaît mal la mer, il ne l'a vue qu'une seule fois. Le peintre est donc chargé lui montrer la réalité des ports de son royaume, tout en lui présentant la bonne gestion du pays sous la houlette de la Pompadour. L'œuvre doit refléter les mœurs locales, les ressources économiques. C'est une logique de glorification car on diffuse une image de la France prospère et active. Les peintures représentant des scènes de genre doivent aussi distraire le souverain. Le quai de Marseille évoque la chorégraphie d’un ballet. Portefaix, peseur, armateur, pêcheur, et jusqu’à l’intendant du port, paradent sur le devant de la scène. Comme pour accentuer cette dimension théâtrale, Vernet introduit des Orientaux enturbannés. Il ne s’agit toutefois pas d’un quelconque caprice orientalisant. Les archives du port attestent des liens très forts entre Marseille et la Méditerranée orientale.\nPersonnages, une foule hétéroclite active\nAu premier plan, les préparatifs militaires sont visibles parmi les personnages qui s'affairent autour du duc de Richelieu. Ces personnages sont d'ailleurs finement croqués en pleine action, par le peintre, notamment grâce aux costumes hétéroclites et aux attitudes variées qui témoignent des nombreuses activités et des préparatifs pour la campagne militaire sur le port (marins, militaires, pécheurs, chargements des munitions de guerre et de bouche, tri des marchandises). Cela va des riches costumes des nobles et bourgeois de l’époque (robes à dentelles et chapeaux des dames; costumes de soldats), aux costumes beaucoup plus simples des ouvriers, marchands et marins. On se rend ainsi compte de la foule venant quotidiennement sur le port de Marseille et de la diversité sociale de cette foule. Le but est de célébrer la richesse du port de Marseille et la puissance maritime, économique et militaire de la France qui s'engage dans la guerre de Sept Ans contre sa rivale l'Angleterre.\n--->\nMethodological precautions\n.}}\n--->\nHistorical Context\nThe Duke of Richelieu and Fronsac, Cardinal Richelieu's great-grandnephew, left Paris on 18 March 1756, hoping to find everything underway in Marseille. He was badly disappointed - the troops had still not been concentrated in Marseille, whilst there were no supplies and no transport ships in a fit state to go to sea. On 22 March he gave orders at Marseille and the following day headed for Toulon, leaving the chevalier de Redmond and Monsieurs de Luppé and de Retz to continue preparations at Marseille.\nThe painting shows de Richelieu setting out for the Battle of Minorca, a land and sea battle between France and Britain in May–June 1756 early in the Seven Years' War over control of Minorca and the western Mediterranean Sea. The naval element on 20 May between a force under de Richelieu's cousin La Galissonière and one led by John Byng allowed France to hold the island until the end of the war.\n{| border=\"1\" class=\"wikitable center\"\n! Related works\n|-\n|\nFile:Le_Départ_de_la_flotte_française_pour_l'expédition_de_Port-Mahon_dans_l'île_de_Minorque_le_10_avril_1756-Nicolas_Ozanne_mg_8243.jpg|The Expedition to Minorca Leaves on 10 April 1756 by Nicolas Ozanne.\nFile:Vernet-marseille-1754.jpg|Inside the Port of Marseille, 1754, by Claude Joseph Vernet (Musée de la Marine)\nFile:Jean-Baptiste de La Rose.jpg|Mediterranean Port Scene, 1625–1650, by Jean-Baptiste de La Rose.\n|}\nNotes\nReferences"
    }
  ]
}