{
  "content": [
    {
      "type": "text",
      "text": "# The Age of Revolution: Europe 1789–1848__disambig_1\n\nThe Age of Revolution: Europe 1789–1848 is a book by British historian Eric Hobsbawm, first published in 1962. It is the first in a trilogy of books about \"the long 19th century\", followed by The Age of Capital: 1848–1875, and The Age of Empire: 1875–1914. Hobsbawm analyzed the early 19th century, and indeed the whole process of modernisation thereafter, using what he calls the \"twin revolution thesis\". This thesis recognized the dual importance of the French Revolution and the Industrial Revolution as midwives of modern European history, and – through the connections of colonialism and imperialism – world history.\nContents\n* Part I. Developments\n** 1. The World in the 1780s\nHobsbawm provides a tour d'horizon of what Europe, European society, and relations with the non-European societies were like in the world of the 1780s. He stresses that, for all the noticeable progress made in terms of things like increases in the number of good roads; faster mail; the mastery of overseas exploration, navigation, and trade; societies of the 1780s were still very much part of the pre-Modern — or Early Modern Period — world. In the 1780s, European society was overwhelmingly rural, to such an extent that to not appreciate this fact entails not being able to understand how the world worked at the time. Both the peasantry and the nobility were staunchly based in this rural world, in terms of their physical presence, their social outlook, their ways of conceiving of the world, and their relations to each other. While urban settlements of course existed, few a scattering a major cities across the European continent, the dominant form of urban life was the provincial town, not the life of the big cities. And unlike the urban cities that emerged in the course of the Industrial Revolution, these provincial towns' economies were ultimately heavily based on the countryside, rather than on mass production or large consumer bases or long-distance networks and markets. The land, above all, shaped the lives and relations of the majority of people in society.\n** 2. The Industrial Revolution\n** 3. The French Revolution\n** 4. War\n** 5. Peace\n** 6. Revolutions\n** 7. Nationalism\nIn this chapter, Hobsbawm traces the emergence of the phenomenon of nationalism. It was truly a phenomenon because, though loose notions of loyalty to one's country, or patriotism, or recognition of an overarching national character existed, the nationalism that emerged in the years between 1789 and 1848 was more novel, more comprehensive, and more 'modern' (for lack of the better word) in its conception. Nationalism emerged initially as a liberal idea, because it entailed the notion of a nation made up of individual citizens whose rights and freedoms were recognized by the nation and, in turn, citizens owed responsibility to the national good. This was in contrast to the past, when society was made up of subjects loyal to a monarch, or local noble or church overlord, and whose rights and privileges were based on the social/collective/corporative groups that the subjects belonged to, and not based on the individual.\n* Part II. Results\n** 8. Land\n** 9. Towards an Industrial World\n** 10. The Career Open to Talent\n** 11. The Labouring Poor\n** 12. Ideology: Religion\n** 13. Ideology: Secular\n** 14. The Arts\n** 15. Science\n** 16. Conclusion: Towards 1848\nSee also\n* Revolutionary Spring: Fighting for a New World 1848–1849 by Christopher Clark\nReferences\nExternal links\n* [http://catalog.hathitrust.org/Record/000555374 The Age of Revolution: Europe 1789–1848] full text on Hathi Trust\n* [http://libcom.org/library/age-revolution-1789-1848-eric-hobsbawm The age of revolution 1789-1848 - Eric Hobsbawm | libcom.org]"
    }
  ]
}