{
  "content": [
    {
      "type": "text",
      "text": "# The Eye (King Diamond album)\n\n| prev_title = Conspiracy\n| prev_year  = 1989\n| next_title = In Concert 1987: Abigail\n| next_year  = 1991\n}}\n| rev2 =''Collector's Guide to Heavy Metal\n| rev2Score = 7/10\n| noprose =yes\n}}\nThe Eye is the fifth studio album by Danish heavy metal band King Diamond, released on 31 October 1990 through Roadrunner Records. It continues to feature a major storyline like other King Diamond albums, though it is told differently. The Eye'' is the only album to feature drummer Snowy Shaw and the last to feature guitarist Pete Blakk and bassist Hal Patino, until the latter's return on Abigail II: The Revenge.\nPlot\nHis two prior concept albums had been told from the perspective of the protagonists; this one is told from the view of a narrator. The themes of Christian atrocity with the persecution of alleged witches and sexual abuse against nuns are present.\nThe story starts off with an unnamed character finding a necklace called \"The Eye\", that allows him/her to see the events the necklace was witness for in the past. They see an accused witch named Jeanne Dibasson being tortured and burned at the stake. Next they see two little girls finding the necklace in the ashes at a stake, and what they see when they look in the eye kills them. Finally there is the story of Madeleine Bavent, a nun working in the Louviers convent, who finds the necklace and decides to put it on. After being raped by Father David, she uses the necklace to kill him by making him look into it. Shortly after, the new Chaplain, Father Picard, arrives and starts bringing everyone to communion. He winds up lacing their communion wine with some substance that lets him control their minds, and uses a group of nuns including Madeleine to ritually torture and kill children. In 1642 all are arrested and imprisoned.\nThe main parts of the stories told on this album are true, and took place during the French Inquisition, 1450–1670. All of the following characters are real and from that period of time:\n# Nicolas de la Reynie (spelled \"Nicholas de La Reymie\" in the lyrics): Head investigator of the Christian Burning Court (Chambre Ardente), in Paris, France.\n# Jeanne Dibasson: Supposed witch.\n# Madeleine Bavent: 18-year-old French nun who entered the convent at Louviers in 1625, after having been seduced by a priest. Died in 1647 in prison.\n# Father Pierre David: Chaplain of the convent at Louviers till his death in 1628.\n# Father Mathurin Picard: Chaplain of the convent at Louviers from 1628 to his death in 1642. [See also Louviers possessions.]\nTrack listing\nPersonnel\n* King Diamond - vocals, keyboards\n* Andy LaRocque - guitars\n* Pete Blakk - guitars\n* Hal Patino - bass\n* Snowy Shaw - drums\n;Production\n* King Diamond - production, mixing\n* Andy LaRocque - production\n* Roberto Falcao - production, engineering, mixing, keyboards\n* Flemming Hansson - engineering\nReferences"
    }
  ]
}