{
  "content": [
    {
      "type": "text",
      "text": "# The Bulwark (website)\n\n| commercial =\n| type = News and opinion website\n| registration =\n| language = English\n| num_users =\n| content_license =\n| owner = Defending Democracy Together Institute\n| author =\n| editor = Jonathan V. Last\n| launch_date =\n| revenue =\n| alexa =\n| current_status = Online\n| footnotes =\n}}\nThe Bulwark is an American center-right news and opinion website launched in 2018 by Sarah Longwell, with the support of Bill Kristol and Charlie Sykes. It initially launched as a news aggregator but in 2019 was revamped using key staffers from the recently closed The Weekly Standard. The Bulwark is owned by Center Enterprises, Inc., which operates under the trade name Bulwark Media.\nThe Bulwark has been described as a moderate and right-of-center publication; it has frequently published pieces critical of US president Donald Trump and his allies.\nHistory\nFollowing the end of publication of The Weekly Standard in December 2018, editor-in-chief Charlie Sykes said that \"the murder of the Standard made it urgently necessary to create a home for rational, principled, fact-based center-right voices who were not cowed by Trumpism.\" The site was created in December 2018 as a news aggregator as a project of the Defending Democracy Together Institute, a 501(c)(3) organization conservative advocacy group led in part by The Weekly Standard co-founder Bill Kristol. Several former editors and writers of The Weekly Standard soon joined the staff and within weeks of launch began publishing original news and opinion pieces. The website has frequently published pieces critical of Donald Trump and of pro-Trump elites in politics and the media.\nOriginally, as a non-profit project, The Bulwark did not run advertising and was supported by donations. By January 2019, approximately $1 million had already been raised for the site, which was said to be adequate to keep the site running for one year. In 2021, The Bulwark launched Bulwark+, a program that provides paid subscribers with \"exclusive podcasts, newsletters, and live-streams\" for about $100 a year; within a few months, the website reported roughly 16,000 subscribers. Bulwark+ is published on the Substack platform. In February 2025, The Bulwark claimed to have 76,000 paid subscribers to its newsletter and was adding hundreds of new subscribers every few days. More recently, The Bulwark has added video content to their repertoire with a dedicated YouTube page that as of May 2025 has 1.26 million subscribers, and has started reading ads on their podcasts (which are put out in audio form on all podcast platforms and many in video form on YouTube and Substack), however Bulwark+ members are able to avoid these ads as a perk of their paid subscription.\nIn 2021, Washingtonian magazine observed that content on The Bulwark is primarily geared toward readers seeking \"serious coverage of events through a center-right filter\" but that its editors have sought to attract centrist Democratic readers who may be \"uncomfortable with the excesses of the progressive left\".\nIn 2024, Sarah Longwell, Bill Kristol, and Tim Miller sent the Democratic campaign the names of prominent Republicans whom they thought could be persuaded to endorse the Democratic candidate for president. Miller, a former Republican strategist, described his role as \"outside cajoler,\" as he encouraged the Harris campaign to ratchet up its efforts to pitch prominent Republicans on publicly supporting the vice president. In October of that year, William Saletan wrote that Trump was running an \"openly fascist campaign\".\nNotable staff and contributors\nSarah Longwell is the publisher of The Bulwark, and also co-hosts several podcasts for the publication. Jonathan V. Last is the editor. The staff and writers also include editors William Kristol, Adam Keiper, Jim Swift, Martyn Wendell Jones, Benjamin Parker, Sonny Bunch, Mona Charen, Sam Stein, Tim Miller, Will Saletan, Cathy Young, Joe Perticone, Adrian Carrasquillo, and Andrew Egger. Other notable contributors include Lauren Egan, Jonathan Cohn, and Will Sommer.\nPodcasts\nThe Bulwark produces and distributes several podcasts, which cover news, political analysis, culture, and foreign affairs. They also publish weekly private podcasts exclusively for Bulwark+ members.\nThe Bulwark Podcast With Tim Miller\nThe Bulwark Podcast is a news, opinion and interview show hosted by Tim Miller. The podcast is released every weekday and published in audio and video form. Until February 2024, the podcast was hosted by Charlie Sykes. The show launched on December 21, 2018. ''The Bulwark's'' Publisher Sarah Longwell said that each of the podcast's January 2021 episodes were downloaded about 100,000 times.\nThe Next Level\nCo-hosted by Sarah Longwell, Tim Miller, and Jonathan V. Last, The Next Level is a weekly podcast that covers the news of the week, with a focus on politics and elections.\nGeorge Conway Explains It All (To Sarah Longwell)\nCo-hosted by attorney George Conway and Sarah Longwell, George Conway Explains It All covers legal and political news, with a particular emphasis on Donald Trump's legal issues.\nThe Mona Charen Show\nThe Mona Charen Show, hosted by Mona Charen, is a weekly interview-style podcast that covers politics and cultural issues. Charen previously hosted the panel-style podcast Beg to Differ.\nThe Focus Group\nThe Focus Group is a weekly podcast hosted by Sarah Longwell. Longwell invites a guest to review audio clips of focus groups to learn what voters think about candidates, issues, and events.\nShield of the Republic\nCo-hosted by former diplomat Eric S. Edelman and political scientist Eliot A. Cohen, Shield of the Republic is a weekly podcast on national security and foreign policy.\nThe Michael Steele Podcast\nHosted by former Maryland Lt. Governor Michael Steele, The Michael Steele Podcast is a weekly \"barbershop-style\" discussion of political and cultural events.\nHow to Fix It with John Avlon\nA weekly podcast hosted by journalist, speechwriter, and congressional candidate John Avlon.\nThe Bulwark Goes to Hollywood\nHosted by Sonny Bunch, The Bulwark Goes to Hollywood includes interviews with interesting people who work in the entertainment industry.\nAcross the Movie Aisle\nCo-hosted by Sonny Bunch, Alyssa Rosenberg, and Peter Suderman, Across the Movie Aisle is a discussion of movies between writers with different political perspectives.\nFYPod\nCo-hosted by Tim Miller and Cameron Kasky, FYPod is a podcast on how younger Americans, especially Gen Z, are shaping politics as a distinctive bloc. The show was launched in February 2025, and guests have ranged from conservative influencer and journalist Natalie Winters to progressive congressional candidate Kat Abughazaleh.\nSee also\n* List of Republicans who opposed the Donald Trump 2024 presidential campaign\nReferences\nExternal links\n*"
    }
  ]
}