{
  "content": [
    {
      "type": "text",
      "text": "# The Aware\n\nThe Aware (2003) is the first book in The Isles of Glory by Glenda Larke.\nPlot outline\nThe Isles of Glory comprise eleven island nations.  The main character in the novel, Blaze, has the ability to sense magic and as such is \"Aware\". This makes her useful to the lesser of the island nations and the novel follows her story as she searches for a mysterious slave woman and fights an evil that threatens all of the island nations.\nCharacters\nBlaze Halfbreed\n:A halfbreed Awarewoman. Blaze is half-Southerner, half-Fen-islander. She was recently in the Keeper's employ as a bounty hunter or dunmaster assassin, but then left their service. Blaze Halfbreed is Tor Ryder's lover.\nFlame Windrider\n:A Cirkasian woman with sylvtalent. She is also the Castlemaid, the only offspring of the Castlelord and Castlelady. She escaped to Gorthan Spit to avoid marrying the Bastionlord and took the name of Flame Windrider. Her real name is Lyssal. She is in love with Ruarth, a Dustel Islander trapped in the shape of a bird.\nRuarth Windrider\n:An Aware Dustel Islander trapped by Morthred's dunmagic in the form of a bird. He is in love with Flame Windrider.\nTor Ryder\n:A Menod patriarch Aware Stragglerman. He once took part in a rebellion on Calment, a.k.a. the Lance of Calment. Tor Ryder is Blaze Halfbreed's lover.\nCritical reception\nSarah Palmer, writing in Fantasy Book Review, found a lot to like with the novel: \"The Isles of Glory trilogy, Glenda Larke's debut series, is timeless. Larke pens a captivating story in an intricately detailed and unique world and cultural landscape. Her characters are gritty and wonderfully fleshed out. Larke's delightfully unique style allows the reader to get a real sense of the characters many facets. It has action, intrigue, romance and more. I have seldom been so riveted by debut novel. Keeps you on the edge of your seat and was a joy to read.\"\nAwards\nThe Aware was a finalist in the 2003 Aurealis Awards fantasy division.\nReferences"
    }
  ]
}