{
  "content": [
    {
      "type": "text",
      "text": "# The Queen of Spades (1949 film)\n\n| starring       =\n| music          =\n| cinematography = Otto Heller\n| editing        = Hazel Wilkinson\n| studio         = De Grunwald Productions for Associated British Picture Corporation\n| distributor    =\n| released       =\n| runtime        = 95 minutes\n| country        = United Kingdom\n| language       = English\n| budget         =£232,500\n| gross          =£107,250 (UK)\n}}\nThe Queen of Spades is a 1949 British fantasy-horror film directed by Thorold Dickinson and starring Anton Walbrook, Edith Evans and Yvonne Mitchell (in her cinematic debut). It is based on the 1834 short story of the same name by Alexander Pushkin.\nPlot\nCaptain Herman Suvorin is a Russian officer of the engineers in St Petersburg in 1806. He constantly watches the other officers gamble at faro, but never plays himself because he is averse to the risk of losing his money.\nHerman overhears gossip among several military officers about the aging Countess Ranevskaya, who knows the secret of winning at cards and won a large sum of money after selling her soul, several decades earlier in her youth. Later Herman purchases a book titled The Strange Secrets of the Count de Saint Germain purporting to tell the true stories of people who sold their souls for wealth, power or influence. One chapter of the book describes how in 1746 a \"Countess R***\" obtained the secret from the count and subsequently won a fortune from gambling. The countess had to promise not to disclose the secret. Herman assumes \"Countess R***\" is Countess Ranevskaya.\nThe countess (now very elderly) has a young ward, Lizaveta Ivanovna. Andrei, a military officer of noble birth and a friend of Herman, encounters Lizaveta in a bird market and decides to become her suitor. At the same time, Herman tries to seduce Lizaveta with love letters in order to persuade her to let him into the countess's house. Andrei discovers Herman's advances, breaks off their friendship and warns Lizaveta that Herman is dangerous. Lizaveta rejects Andrei's warning.\nHerman gains access to the house and accosts the countess, demanding the secret. He offers to assume her sin in exchange. He repeats his demands, but she does not speak. He draws a pistol and threatens her, and the old lady dies of fright. Herman then flees to the apartment of Lizaveta in the same building. There he confesses to frightening the countess to death. He defends himself by saying that the pistol was not loaded. He escapes from the house with the aid of Lizaveta, who is disgusted to learn that his professions of love were a mask for greed.\nHerman attends the funeral of the countess, and is terrified to see the deceased open her eyes in the coffin and look at him. Later that night, Herman reads a chapter of his book entitled \"The Dead Will Give Up Their Secrets\". Subsequently, the ghost of the countess visits his apartment. The ghost names the secret of the three cards (three, seven, ace), but orders him to marry Lizaveta as a condition. The next day Herman tries to reconcile with Lizaveta, but she again rejects him.\nHerman takes his entire savings to a gaming salon. When he arrives, Andrei challenges him to a duel. Herman accepts on condition that Andrei play a hand of faro with him; Andrei accepts. Herman bets all his savings on the three of spades and wins. Herman and Andrei agree on a second round, which Herman wins on the seven of spades. A third round is played. Herman spots the ace of spades in his hand in front of the queen of spades. Herman places his selected card face down on the table and bets on the ace—but when cards are shown, he finds he has bet on the queen of spades and loses everything. Showing compassion, Andrei escorts a very distraught Herman from the gambling table, who mumbles repeatedly \"three, seven, ace … three, seven, queen\".\nLizaveta and Andrei celebrate their future happiness together by fulfilling Lizaveta's dream of purchasing every bird in the bird market and setting them all free.\nCast\n* Anton Walbrook as Captain Herman Suvorin\n* Edith Evans as Countess Ranevskaya\n* Yvonne Mitchell as Lizaveta Ivanovna\n* Ronald Howard as Andrei\n* Mary Jerrold as Old Varvarushka\n* Anthony Dawson as Fyodor\n* Miles Malleson as Tchybukin\n* Michael Medwin as Hovaisky\n* Athene Seyler as Princess Ivashin\n* Ivor Barnard as Bookseller\n* Aubrey Mallalieu as Fedya\n* Maroussia Dimitrevitch as Gypsy singer\n* Violetta Elvin as Gypsy dancer\n* Pauline Tennant as young Countess Ranevskaya\n* Hay Petrie as Herman's servant (final film)\n* Aubrey Woods as Dimitri\nProduction\nThe screenplay was adapted from a short story of the same name by Alexander Pushkin, with a script written by Arthur Boys and Rodney Ackland. Ackland was also originally the film's director, before disagreements with producer Anatole de Grunwald and star Walbrook, caused him to be replaced at a few days notice by Thorold Dickinson, who also rewrote sections of the script.\nThe film was shot at Welwyn Studios in Welwyn Garden City, Hertfordshire, using sets created by William Kellner, from original designs by Oliver Messel.\nRelease\nThe Queen of Spades was once considered lost, but was rediscovered and later re-released in British cinemas on 26 December 2009. It was released on Region 2 DVD in January 2010.\nReception\nAs of April 1950 the film earned distributor's gross receipts of £47,282 in the UK of which £17,678 went to the producer. The film made a loss of £214,822.\nWriting in 1949, The New York Times Bosley Crowther noted \"a most beautifully accomplished cast, exquisite baroque production and staging of a tense and startling sort. If it's romantic shivers you're wanting, this is undoubtedly your film.\"\nKine Weekly said: \"Vague and gloomy melodrama, or rather an essay in the necromantic. [...] Not a kopek has been spared to establish correct atmosphere and detail, but the accent on art is a little too great. Whatever the highbrows may think of it, it is definitely not the masses' cup of vodka.\"\nMonthly Film Bulletin said: \"This over-elaborate film, supercharged with all the tricks of cinematographic art, is beautifully acted by Edith Evans, whose performance is the saving grace of the drama, though the make-up artist has rendered her too artificial and frightening to be credible. Much good use has been made of sound effects; the recurring \"frou-frou of the Countess's silk dress, the crispness of the snow, the wind in the dream, all go to make a sinister thrilling whole. Anton Walbrook is disappointing, in many places he is inaudible, and mouths his words in sibilant whispering. [...] However, though it does not run as smoothly as other films directed by Thorold Dickinson, it is an outstanding and worthwhile production.\"\nLeslie Halliwell wrote: \"Disappointingly slow-moving but splendidly atmospheric recreation of an old Russian story with all the decorative stops out; the chills when they come are quite frightening, the style is impressionist and the acting suitably extravagant.\"\nIn British Sound Films: The Studio Years 1928–1959 David Quinlan rated the film as \"good\" and called it a \"baroque chiller with richly decadent decor.\"\nThe Radio Times Guide to Films gave the film 4/5 stars, writing: \"Director Thorold Dickinson creates what is generally regarded as his best film: a handsomely mounted and highly atmospheric ghost story which still chills the blood.\"\nRotten Tomatoes reports that 96% of critics give the film a positive review, based on 25 reviews.\nWes Anderson ranked it as the sixth best British film. Martin Scorsese has described Thorold Dickinson as an underrated director, saying of The Queen of Spades that \"this stunning film is one of the few true classics of supernatural cinema.\" Dennis Schwartz of ''Ozus' World Movie Reviews'' rated the film an A−, calling it \"a masterfully filmed surreal atmospheric supernatural tale\".\nAccolades\nThe film was nominated for a BAFTA Award for Best British Film and was entered into the 1949 Cannes Film Festival.\nReferences\nExternal links\n*\n*\n*"
    }
  ]
}