{
  "content": [
    {
      "type": "text",
      "text": "# The Good, the Bad & the Queen (album)\n\n}}\n| rev1 = AllMusic\n| rev1score =\n| rev2 = The A.V. Club\n| rev2Score = C\n| rev3 = Entertainment Weekly\n| rev3score = B+\n| rev4 = The Guardian\n| rev4score =\n| rev5 = Los Angeles Times\n| rev5score =\n| rev6 = NME\n| rev6score = 8/10\n| rev7 = Pitchfork\n| rev7score = 6.8/10\n| rev8 = Q\n| rev8score =\n| rev9 = Rolling Stone\n| rev9score =\n| rev10 = Spin\n| rev10score =\n}}\nThe Good, the Bad & the Queen is the debut studio album by the English supergroup the Good, the Bad & the Queen, comprising Damon Albarn, Paul Simonon, Simon Tong and Tony Allen, and produced by Danger Mouse. The album was released in January 2007. The album debuted at number two in the UK Albums Chart and was certified Gold in the UK within days of its release despite little media recognition and airplay. In the United States, the album entered the Billboard 200 at No.&nbsp;49.\nIt is stated that the record is, in a sense, a concept album, as its songs are all themed around modern life in London. It was described by Albarn as \"a song cycle that's also a mystery play about London\" in an interview with Mojo.\nHistory\nAlthough The Good, The Bad & The Queen was first reported as a solo album by Albarn with Danger Mouse producing, NME revealed in late July 2006 that the solo project had been switched to a new group formed by Albarn. The band, which formed in 2006, released their first single, \"Herculean\" on 30 October 2006. The single followed the band's appearance at the BBC's Electric Proms season at the redeveloped Roundhouse in Camden on 26 October, during which they performed the entire album. Three warm-up gigs in East Prawle at the Pig's Nose Inn, Ilfracombes Marlboro Club and The Exeter Cavern Club preceded their gig on the BBC's Electric Proms, where the album was performed in order with two other songs inserted, \"Intermission Jam\" and \"Mr. Whippy\"; the latter was a B-side for \"Herculean\". The band performed four tracks from the album at Abbey Road Studios on 13 December 2006, during a recording session for Live from Abbey Road.\nFor the first few months, Allen would travel from Paris (where he has a permanent home) to London to work in Albarn's Studio 13 for 3 days a week, writing, rehearsing and recording. At the same time as the initial recordings in the UK, Albarn had begun demoing for the second Gorillaz record and by early spring had invited in producer Danger Mouse to oversee the album. Albarn was keen to work in Africa with local musicians again after his work on the album Mali Music (released 2002) so Tony Allen suggested that the four of them (including Danger Mouse) decamp to his home country of Nigeria to continue the sessions. There they recorded at Afrodisia Studios, once used by Fela Kuti, with a huge variety of local musicians, committing huge numbers of songs and ideas to tape before returning to England once more.\nThe track listing was originally unveiled and commented upon by Damon Albarn and Paul Simonon in an interview in the November 2006 issue of Uncut. The second major gig of the band's career took place on 12 December 2006, at Wilton's Music Hall in East London. It was watched by 300 specially selected fans, as the launch gig of MySpace's The List. The band released their first Top 20 single, \"Kingdom of Doom\", a week prior to the release of the album.  In April, \"Green Fields\" was released as the third single from the album and debuted at No.&nbsp;51 in its first week.\nOn 4 April 2007, The Good, the Bad & the Queen became the first EMI album to be made available for download in the new DRM-free, high quality MP3 format (256 kbit/s).\nThe Good, The Bad and the Queen was voted the Best Album of 2007 by the Observer Music Magazine. Paul Simonon told the magazine how the record came about: \"It's not a commercial record, so OMM's award shows that you can make music that moves people without going down the obvious route. I hadn't been in a band for 17 or 18 years, and then Damon asked me to listen to some tracks he'd recorded in Nigeria. I'd met him once before, at Joe Strummer's wedding reception. We shared ideas about people, musical styles and where we live. With the music, I wanted to complement Tony's drums. I'm not into over-complication – I'm not capable of it, to be honest. The lyrics, the London atmosphere, all that evolved as we played. There's a lot of craftsmanship on the record, and Damon has a vision for arrangements, and everyone slotted in around them. But it's all done now. We won't make another record, and we didn't properly name the band, because a name is for a marriage.\"\nIn an interview with Pitchfork about Danger Mouse's involvement in this album, Albarn states: \"He was quite adamant that we don't do any kind of harmony and that I kept it a single voice. I thought, \"Well that's great.\" That's how I kind of start the songs in the first place: I get a very basic arrangement and texture them. His attention to that detail was important. And it helped me write the lyrics. It cleared the way for it just having to be a single voice. He's an exceptional talent. With Brian [Danger Mouse] being a kind of third party so to speak, it helps to have someone there. You want a band to work itself, but at the same time you want it to be the best that it can be. I tried it the other way, with Tony leading the tracks when I went to Lagos, and it was great but I didn't fit into that. That is why I scrapped the whole record, because I thought I should be involved at least.\"\nAlbarn wrote the original version of the song \"Green Fields\" following a night out with Blur bassist Alex James and Marianne Faithfull. That demo was recorded in a studio on Goldhawk Road, Hammersmith and Albarn gave the tape to Faithfull. It was later recorded by the singer/actress with different lyrics in the verses and released on her 2005 album Before the Poison as \"Last Song.\"\nTrack listing\n;Sample credits\n* \"Northern Whale\" contains a sample of \"As Tears Go By\", as written by Mick Jagger, Keith Richards & Andrew Oldham and performed by The Rolling Stones from the album ''December's Children (And Everybody's).\n;Unreleased tracks and B-sides\n* \"Intro\" – Played on the Live from Soho EP\n* \"Back in the Day\" – B-side on \"Herculean\" single.\n* \"Mr. Whippy\" (featuring Eslam Jawaad) – B-side on \"Herculean\" single.\n* \"Hallsands Waltz (Sketches of Devon)\" – Song on \"Kingdom of Doom\" single.\n* \"Start Point (Sketches of Devon)\" – Song on \"Kingdom of Doom\" single.\n* \"Intermission Jam\" – Unreleased song played at the BBC Electric Proms.\n* \"England, Summer (In Black & White) Dog House\" – Song on \"Green Fields\" single.\n* \"England, Summer (In Black & White) Polling Day\" – Song on \"Green Fields\" single.\nPersonnel\n;The Good, the Bad & the Queen\n* Damon Albarn – lead vocals, keyboards, back cover\n* Paul Simonon – bass, backing vocals, illustrations\n* Simon Tong – guitar\n* Tony Allen – drums\n;Production\n* Danger Mouse – producer, additional drum programming\n* Jason Cox – recording, mixing\n* James Dring – drum programming, programming\n* Howie Weinberg – mastering\n;Other personnel\n* Will Bankhead – design\n* Jamie Hewlett – back cover\n* Pennie Smith – photography\n* Thomas Shotter Boys – painting\n;Additional musicians\n* Danger Mouse – percussion (track 4), synthesizers (tracks 5 & 12)\n* Harry Christophers – choir (track 5)\n* Julia Doyle – choir (track 5)\n* Grace Davidson – choir (track 5)\n* Kirsty Hopkin – choir (track 5)\n* Charlotte Mobbs – choir (track 5)\n* Andrew Olleson – choir (track 5)\n* Ian Aitkenhead – choir (track 5)\n* David Clegg – choir (track 5)\n* Christopher Royall – choir (track 5)\n* Adrian Lowe – choir (track 5)\n* Ben Rayfield – choir (track 5)\n* Mark Dobell – choir (track 5)\n* Simon Berridge – choir (track 5)\n* James Holliday – choir (track 5)\n* Julian Empett – choir (track 5)\n* Sam Evans – choir (track 5)\n* Antonia Pagulatos – violin (tracks 5, 6, 8–10 & 12)\n* Sally Jackson – violin (tracks 5, 8, 9 & 12)\n* Alice Pratley – violin (tracks 5, 8, 9 & 12)\n* Gillon Cameron – violin (tracks 6 & 10)\n* Stella Page – viola (tracks 5, 6, 8–10 & 12)\n* Amanda Drummond – viola (tracks 5, 8, 9 & 12)\n* Emma Owens – viola (tracks 6 & 10)\n* Izzi Dunn – cello (tracks 5, 6, 8–10 & 12)\n* Al Mobbs – double bass (tracks 5, 6, 8–10 & 12)\n* Emma Smith – double bass (tracks 6 & 10)\n* Eslam Jawaad – additional vocals on \"Mr. Whippy\"\nChart performance\nWeekly charts\n{| class=\"wikitable sortable\" style=\"text-align:center;\"\n|-\n!scope=\"col\"|Chart (2007)\n!scope=\"col\"|Peakposition\n|-\n| style=\"text-align:left;\"| Australian Albums (ARIA Charts)\n| 36\n|-\n| style=\"text-align:left;\"| UK Albums (The Official Charts Company)\n| 2\n|-\n| style=\"text-align:left;\"| US Billboard'' 200\n| 49\n|}\nCertifications\nReferences\nExternal links\n*\n*\n*"
    }
  ]
}