{
  "content": [
    {
      "type": "text",
      "text": "# The Mysteries: Renaissance Choros\n\n|quote=\nThe mysteries remain,\nI keep the same\ncycle of seed-time\nand of sun and rain;\nDemeter in the grass,\nI multiply,\nrenew and bless\nIacchus in the vine;\nI hold the law,\nI keep the mysteries true,\nthe first of these\nto name the living, dead;\nI am red wine and bread.\nI keep the law,\nI hold the mysteries true,\nI am the vine,\nthe branches, you\nand you.\n|salign=right|source=—H.D.}}\n\"'The Mysteries: Renaissance Choros\", or \"The Mysteries'\", is a poem by American poet H.D. first published in 1931, as the concluding poem of her poetry anthology Red Roses for Bronze. Inspired by the Eleusinian Mysteries, the poem concerns a ritual meant to resurrect Adonis.\nSummary\nThroughout the poem, which is \"short lined and diffuse\", the poet employs repetition, for instance in Section IV, where the term \"no man\" appears several times, or in Section V, where the word behold is mentioned three consecutive times and twice at another point.\nThe opening lines of \"The Mysteries: Renaissance Choros\" allude to the approaching world war: \"Dark / days are past / and darker days draw near; / darkness on this side, / darkness over there\". A direct reference to the words of Jesus in the Gospel of Mark (4:39) appears further down: \"Peace / be still.\" Jesus is called a \"magician\" in the second part of \"The Mysteries\", recalling H.D.'s earlier poem \"Magician\" (1933), which also refers to Christ. The rest of the poem is replete with other biblical allusions, as well as references to \"pagan mystery cults\". The poem ends with \"an image of new life emerging from death.\"\nAnalysis\nLouis Lohr Martz suggests that the use of the word \"renaissance\" in the title of the poem hints at a \"new era of culture and a time for personal rebirth\". Helen Sword describes the poem's message as \"heterodox\" and compares the poem with \"Brot und Wein\" by German poet Friedrich Hölderlin. In arguing that the poem is about \"the alliance of Christian and pagan myth\", she offers that the imagery of bread and wine in the poem refer not only to the body and blood of Christ, but also that of Demeter and Dionysus (Bacchus). Similarly, she likens Demeter's fertility rites to the Christian doctrine of resurrection. Rosamond Rosenmeier claims that the poem relates to \"female and maternal power\" and the Holy Spirit. According to Diana Collecott, the poem focuses on \"the seasonal cycle of death and rebirth.\" Noting that H.D. would remain \"publicly silent until The Walls Do Not Fall in 1944\", Gary Dean Burnett concludes that the poem marks \"a small death through which the mysterious workings of another kind of life, another kind of work, could still be heard.\"\nLegacy\nMartz praised the work as \"controlled and successful\", while Bridget Kendall of the BBC opined that out of all the works inspired by the Eleusinian Mysteries, H.D.'s poem was her favourite. The Mysteries Remain (1982) by David Sampson, which has four movements (The Mysteries Remain; Cycles of Seed-Time; Demeter in the Grass; and Iacchus in the Vine), is based on H.D.'s poem.\nReferences\nCitations\nBibliography\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*"
    }
  ]
}