{
  "content": [
    {
      "type": "text",
      "text": "# The Oracle, Queensland\n\n| status             = Completed\n|constructed    =\n|est_completion =\n|opening        = 2010\n| building_type      = Residential/Retail/Hotel\n| roof               =  /\n| floor_count        = 50 / 40\n| main_contractor    = Grocon\n| developer          = Niecon Developments\n|references     = [http://www.theoraclebroadbeach.com The Oracle Broadbeach]}}\nThe Oracle is a $850&nbsp;million two-tower luxury apartment development at Broadbeach on the Gold Coast, Queensland, Australia. When completed it held the record for tallest building and highest apartment sale in Broadbeach. The project consists of a 50-storey beach tower and a 40-storey hinterland tower and features a retail precinct which will be centred on the \"Oracle Boulevard\".\nThe Oracle was developed by South Sky Investments subsidiary of Niecon with architecture by Design By Innovation (DBI) and constructed by Melbourne-based company Grocon. The project is the second five-star hotel built on the Gold Coast after the Palazzo Versace.\nLocation\nThe Oracle site is bounded by Elizabeth Avenue, Surf Parade and Charles Avenue, Broadbeach, a suburb of the Gold Coast, Queensland. It has taken over 15 years to amalgamate the site which is almost a whole city block.\nFeatures\nDesigned by Niecon Developments in conjunction with Design By Innovation (DBI), The Oracle consists of a 50-storey and a 40-storey luxury residential tower above a gallery of boutiques, cafés and restaurants. The project includes a total of 505 apartments containing between one and three bedrooms.\nThe residence has a number of high-speed lifts, a water feature, Zen garden and tai chi lawn. Sporting facilities include a 25&nbsp;m heated lap pool, indoor spa, steam room, sauna, and gymnasium. Leisure facilities include an in-house cinema with surround sound, private wine lockers, an executive lounge, and a Teppanyaki grill.\nThe Peppers Broadbeach Hotel, a five-star hotel within the complex, opened in November 2010.\nReceivership\nIn December 2010, the South Sky Investments, developer of the Oracle complex, has been placed into receivership as the company was unable to achieve settlements of up to 400 pre-sold apartments. The remaining apartments, which ranged in price from 850,000 to A$12m, had been pre-sold before the Great Recession.\nSee also\n*List of tallest buildings on the Gold Coast, Queensland\nReferences\nExternal links\n*"
    }
  ]
}