{
  "content": [
    {
      "type": "text",
      "text": "# The Orc King\n\nThe Orc King is a fantasy novel by American writer R. A. Salvatore, the first book in the Transitions series.\nPlot summary\nThe story begins a century after the events of The Two Swords. Drizzt Do'Urden still wields Twinkle and Icingdeath and he now wields Taulmaril, Cattie-Brie's magical bow. Drizzt defeats a group of bandits calling themselves Casin Cu Calas, a group that wears black and travels through the Orcish Kingdom of Many-Arrows and slays Orcs in their sleep. He is angered when one of them mentions Bruenor Battlehammer's past weakness by allying with the Orcs.\nThe sixth heir to the throne of Kingdom of Many-Arrows, Obould the Sixth, is visiting the house of a \"beautiful\" Orcish maiden who is set to marry an elf from the Glimmerwood (formerly Moonwood).\nThe book then returns to the \"past\" where Drizzt, with his traveling companion Innovindil, are returning from the journey to the grave of Ellifan. A group of Orcish shaman start conspiring against Obould, and coax forth the Half Ogre-Half Orc Clan Karuck. Innovindil and the rest of her clan are attacked by Clan Karuck, where Innovindil and her Pegasus are slain. Hralien and his friend find her corpse in a tangle below a tree.  Another drow, Tos'un and one of the instigators of the Orcish war, has been living in the area alone.  Hralien begins hunting for Tos'un, believing him to have masterminded the ambush as it was too well organized to have been orcs. The real mastermind is a powerful Gnomish wizard named Jaculi, that has been trained by Illithids and other powerful creatures, who has been secretly controlling Clan Karuck's different Shaman for centuries.\nBack in Mithral Hall Drizzt accompanies Bruenor to a place they believe to be the ancient and lost dwarvern home of Gauntlgrym. With Regis and the dwarves Thibbledorf Pwent, Torgar Hammerstriker, and Cordio Muffinhead they enter, only to discover a cavern full of powerful, otherworldly monsters. Regis and Drizzt silently share doubts about this place being Gauntlgrym, upon seeing the buildings. The buildings look like ones you'd find above ground, and not under. After a vicious battle with two monsters from the Plane of Shadow, they enter into a massive building and find statues of Orcish and Dwarven scholars and tapestries of Orcs and Dwarves living together. A frustrated, dejected Bruenor takes several scrolls and heads home to Mithral Hall.\nCattie-Brie and Wulfgar search for Colson, Wulfgar's surrogate daughter, and with the help of Alustriel, ruler of the city of Silverymoon, finds her in the town of Nesmé. Once she is retrieved, Wulfgar leaves the Companions of the Hall to return her to her original home of Auckney and her birth mother, Meralda, before departing for Icewind Dale and the Tribe of the Elk.  Cattie-Brie, saddened by Wulfgar's departure, returns to Mithral Hall with Alustriel.\nTo avenge Innovindil's death, Hralien goes to find Drizzt in Mithral Hall and asks him to capture Tos'un Armgo. Tos'un also wields Khazid'hea, a sentient sword previously wielded by Catti-brie.\nClan Karuck gathers up several tribes along the River Surbin and races towards dwarven and Silverymoon wizards as they finish construction on a bridge across the river. Several dwarves are slain in the nighttime battle as well as a very powerful wizard. After collecting the dead the next morning, Alustriel, who gave Catti-brie three wizardly items, promises to train Catti-brie in the Arts.\nAfter several days of work, Nanfoodle and Regis finally decipher the text on the scrolls. As it turns out, the language is a mixture of Dwarven and Orcish alphabets. According to the text, Dwarves and Orcs had lived together for centuries, and relations were continuing to improve. After gathering information from Regis, Nanfoodle determines that the only reason the city fell is because something melted the permafrost beneath the city, sucking the entire town and its population under.\nDrizzt departs Mithral Hall and eventually captures Tos'un.  Bruenor, Regis, Hralien, Torgar Hammerstriker, Thibbledorf Pwent and Cordio Muffinhead track down Drizzt and together with a bound Tos'un they set out to kill King Obould Many-Arrows and end the war.\nThroughout the book Clan Karuck chieftain Grguch has made Obould's armies restless. Obould sends his Shaman to parlay with the dwarves, apologizing for the attacks and sends a messenger to Grguch. The runner sent to Mithral Hall is captured by treacherous Orcs, and the other messenger is slain by Grguch himself. Grguch, believing he is following the ways of Gruumsh, prepares an assault on Obould's encampment. As Bruenor and his group marches towards Obould, Drizzt and Hralien search for a way to prove Tos'un innocent. After hearing a discussion between two of the original conspirators proving Tos'un innocent, Drizzt heads off with Bruenor alone. Grguch and Obould are in a desperate battle, with Obould slowly gaining the upper hand until the Jack-possessed Karuck shaman, Hakuun, starts firing lightning bolts at Obould. Drizzt forces Bruenor to choose the destiny of the land and Bruenor leaps atop the back of Obould, and spring boards himself into Grguch. Drizzt runs after Hakuun and slays him and the shape shifting Jack.\nBruenor is fighting a terrible battle with Grguch which ends with a disemboweled and headless Grguch. A battered Bruenor and dying Regis are brought before Obould. As Obould stares down at Bruenor, the Shaman messenger meant for the parlay heals Regis at Obould's command. Obould lowers his weapon and seemingly agrees to a parlay with Mithral Hall and the North. Hralien allows Tos'un to live in the Moonwood and the group returns home.\nIn Garumn's Gorge, Bruenor and Obould sign a treaty, ending the war and establishing the Kingdom of Many-Arrows. Catti-brie takes on the enchanted robes of the wizard Jack and accepts the mentoring of Lady Alustriel and Nanfoodle.\nBack in the future, Hralien and Drizzt remain with the captured members of Casin Cu Calas. They discuss Tos'un and his elven wife Sinnifain and their children, the renaming of Moonwood, and the current state of the Orcish kingdom before they part ways once again.\nReception\n|width=325px}}\nThe Orc King was No. 8 on the fiction hardcover bestseller list as reported by The Buffalo News in October 2007.\nThe Orc King, which marked the 20th anniversary of the character, made it to #7 on the list, as well as #9 on the Wall Street Journal list, #6 on the Publishers Weekly bestseller list, and #36 on the USA Today list of top sellers.\nThe Orc King reached 13 on The New York Times bestseller list on November 4, 2007.\nReferences\nExternal links\n*"
    }
  ]
}