{
  "content": [
    {
      "type": "text",
      "text": "# The Pirate Queen\n\n| premiere_location = Cadillac Palace Theatre, Chicago\n|productions= 2006 Chicago  2007 Broadway  2009 Japan  2020 London\n|awards=\n}}\nThe Pirate Queen is a musical with music by Claude-Michel Schönberg, French lyrics by Alain Boublil and English lyric adaptations by Richard Maltby Jr. and John Dempsey. The French book was written by Boublil and Schönberg and the English book adaptation was by Maltby Jr.\nBased on the 1986 book Grania: She-King of the Irish Seas by Morgan Llywelyn, The Pirate Queen marks the first time Boublil and Schönberg have created a musical with American collaborators. It is based on the life and adventures of the 16th century Irish chieftain and pirate Gráinne O'Malley, who was one of the last Irish clan leaders to resist the English conquest of Gaelic Ireland.\nAfter a Chicago tryout in 2006, the musical opened on Broadway on 5 April 2007 and closed on 17 June 2007 after only 85 regular performances and 32 previews.\nThe cast featured Stephanie J. Block as Grace O'Malley, Hadley Fraser as Tiernan and Linda Balgord, who was nominated for a Drama Desk Award for her performance as Queen Elizabeth I.  The show received harsh appraisals from the critics and had weak sales.\nPlot\nAct I\nGrace O’Malley, the eighteen-year-old daughter of Dubhdara, Chieftain of the O’Malley clan, and her childhood sweetheart Tiernan sneak aboard the newly christened ship The Pirate Queen (\"Prologue\"). Grace tells her father she wants to be a sailor, but Dubhdara tells her it is impossible, as it is considered unlucky to have a woman on board a ship. Grace expresses her frustration to Tiernan (\"Woman\").\nGrace disguises herself as a cabin boy and stows away. When one of the ship's spars breaks in a storm, Grace climbs the rigging to cut the mainsail free. The sailors cheer the \"boy's\" bravery, but are shocked to learn his true identity. Dubhdara is furious, but appreciates Grace's heroism, so he allows her to join the ship's crew. Since her mother's death, Grace has been Dubhdara's only family. Though he loves her deeply, he realises that he barely knows the passionate woman she has become (\"My Grace\"). Tiernan is overjoyed that the woman he loves will be allowed to stay on the ship. Although their relationship must be kept secret, they swear themselves to each other (\"Here on This Night\").\nDuring a battle with an English vessel, Dubhdara is wounded and Grace instinctively takes charge. Though outnumbered, they defeat the English soldiers and sink the warship. Seeing what his daughter has done, Dubhdara decides to defy tradition and train her to be a sea captain like himself. Several years pass.\nIn 1558, Henry VIII's successor, Mary Tudor, dies suddenly, and Elizabeth I ascends to the throne (\"The Waking of the Queen\"). Elizabeth summons her court, and shows her condescending ministers how forceful she intends to be as Queen (\"Rah-Rah, Tip-Top\"). The Queen names her royal advisor Sir Richard Bingham the Lord Governor of Ireland, with instructions to quell the Irish rebellion and kill Grace O'Malley.\nThe increased aggression from England forces the Irish clans to take drastic measures. Dubhdara summons the chieftain of his clan's ancient rival, the Clan O’Flaherty, to a meeting in which he proposes that they arrange a marriage between Grace, and O’Flaherty's son, Donal. When the marriage produces a son, the clans will be united. Grace is horrified, since she loves Tiernan, yet she knows the necessity for such a political act and agrees (\"The Choice Is Mine\"). Donal vows that he will tame this Pirate Queen (\"Boys’ll Be Boys\"). The next day, the two clan leaders preside over \"The Wedding\". Tiernan watches, devastated, yet senses that Grace will need him one day and he decides to stay near her (\"I’ll Be There\").\nThe English set a trap for Grace. They land in the small town of Belclare and the men take up arms, leaving Grace and the women behind. With the town deserted except for \"helpless females,\" Grace mobilizes the women and they kill the invaders. Only Bingham is left alive, with instructions to tell the Queen \"he was bested by a woman.\"\nTiernan arrives with news that Dubhdara is dying. Grace races off to Clew Bay, and Clan O’Flaherty goes with her (\"A Day Beyond Belclare\"). Donal expects that his marriage to Grace will make him the chieftain of both clans, but Dubhdara, however, passes the chieftain's ring and mantle to Grace, making her the first woman ever to become leader of a clan. Dubhdara dies, and the clan gives him a sailor's funeral, in a flaming boat set out to sea (\"Sail to the Stars\").\nAct II\nGrace, once again captain of The Pirate Queen, gives birth aboard ship (\"It's a Boy\"). The Pirate Queen is attacked by the English and Grace, despite having just given birth, joins the fight (\"Enemy at Port Side\"). The Irish prevail, at considerable cost, but Grace can only think of Donal's cowardice. According to Irish law, a marriage becomes permanent only after three years. Grace invokes this law and banishes Donal from her life (\"I Dismiss You\"). Once again, Grace and Tiernan are free to be together (\"If I Said I Loved You\").\nIn England, Elizabeth faces a complex dilemma. As Queen, her most important obligation is to produce an heir (\"The Role of the Queen\"). When Donal arrives at the christening of his son Eoin (\"The Christening/Let a Father Stand By His Son\"), Bingham and his English troops burst into the ceremony, killing many of the O’Malley clan and taking Grace prisoner. Donal and Tiernan engage in violent battle, during which Donal is killed. Tiernan takes the child to safety.\nGrace is imprisoned for seven years, during which time Bingham completes his conquest of Ireland. Tiernan offers himself in exchange for Grace, so that she can return to her child (\"Surrender\"). To everyone's amazement, Elizabeth accepts Tiernan's offer and releases Grace (\"She Who Has All\").\nGrace returns to find Ireland despoiled by Bingham's marauding English troops. Reunited with her son and seeing the Ireland Eoin will now inherit, Grace sets sail for England to plead the case for Ireland (\"The Sea of Life\"). Elizabeth is enraged at Grace's return, but Grace appeals to Elizabeth woman to woman, urging the Queen not to ignore her nature but to use it to rule wisely. After a two hour long discussion, Elizabeth restores Grace's lands and ships and releases Tiernan from prison (\"Woman to Woman\").\nGrace and Tiernan return to Ireland where they are reunited with Eoin. At last they marry, and the Irish people celebrate with a plea for Ireland to be once and forever at peace (\"Finale\").\nHistory\nIn 2005, Producers announced the show would premiere in Chicago the following autumn, and Playbill reported that Colm Wilkinson was in talks to star in the project. However, when producers revealed casting choices, Wilkinson was not included.\nNear the end of the Chicago run, producers hired Richard Maltby Jr. to work with Boublil on revisions to the book and lyrics in preparation for the Broadway opening.  Additionally, producers engaged Graciela Daniele to work on the musical staging.\nProductions\nThe Pirate Queen debuted at Chicago's Cadillac Palace Theatre in an out-of-town tryout on 3 October 2006, and ran through 26 November 2006.\nThe Broadway previews began at the Hilton Theatre on 6 March 2007, with the opening on 5 April. It closed on 17 June 2007 after 85 performances and 32 previews. Frank Galati directed, with musical staging by Graciela Daniele, Irish Dance choreography by Carol Leavy Joyce, and additional choreography by Mark Dendy. Musical direction and orchestrations were by Julian Kelly, with sets by Eugene Lee, costumes by Martin Pakledinaz and lighting by Kenneth Posner.  Moya Doherty and John McColgan, creators of Riverdance, produced, with Edgar Dobie and Ronan Smith, of Doherty and McColgan's Riverdream production company, Executive Producers.\nLinda Balgord received a Drama Desk Award nomination for Outstanding Featured Actress in a Musical for her performance as Queen Elizabeth I.\nMasterworks Broadway released a studio recording of the original Broadway cast on 3 July 2007.  The recording does not include the full score, but only highlights.\nIn 2015, the show was performed for the first time in the UK at the Hampton Hill Theatre in London by the Hounslow Light Opera company, directed by Bill Compton, musical directed by James Hall and lighting design by Nigel A. Lewis.\nThe musical was presented at the Hale Centre Theatre in West Valley City, Utah in 2016.\nA charity concert gala of the musical was held at the London Coliseum on Sunday 23 February 2020, with Rachel Tucker, Hannah Waddingham, Jai McDowall, Matt Pagan, Earl Carpenter and Daniel Boys leading a cast of over 70 performers. It was produced by Tom Gribby, raising over £10,000 for Leukaemia UK.\nCharacters and casts\n{| class=\"wikitable\"\n|-\n! rowspan=2 style=\"width:10%;\" | Character\n! style=\"width:10%;\" | Broadway\n! style=\"width:10%;\" | London\n|-\n!2007\n!2020\n|-\n! style=\"text-align:center;\" | Gráinne (Grace O'Malley)\n| style=\"text-align:center;\" | Stephanie J. Block\n| style=\"text-align:center;\" | Rachel Tucker\n|-\n! style=\"text-align:center;\" | Queen Elizabeth I\n| style=\"text-align:center;\" | Linda Balgord\n| style=\"text-align:center;\" | Hannah Waddingham\n|-\n! style=\"text-align:center;\" | Tiernan\n| style=\"text-align:center;\" | Hadley Fraser\n| style=\"text-align:center;\" | Jai McDowall\n|-\n! style=\"text-align:center;\" | Dubhdara\n| style=\"text-align:center;\" | Jeff McCarthy\n| style=\"text-align:center;\" | Earl Carpenter\n|-\n! style=\"text-align:center;\" | Sir Richard Bingham\n| style=\"text-align:center;\" | William Youmans\n| style=\"text-align:center;\" | Daniel Boys\n|-\n! style=\"text-align:center;\" | Donal O'Flaherty\n| style=\"text-align:center;\" | Marcus Chait\n| style=\"text-align:center;\" | Matt Pagan\n|-\n! style=\"text-align:center;\" | Evleen\n| style=\"text-align:center;\" | Áine Uí Cheallaigh\n| style=\"text-align:center;\" | Emma Norman\n|-\n! style=\"text-align:center;\" | Majella\n| style=\"text-align:center;\" | Brooke Elliott\n| style=\"text-align:center;\" | Steph Parry\n|-\n! style=\"text-align:center;\" | Eoin\n| style=\"text-align:center;\" | Steven BarathChristopher Grey Misa\n| style=\"text-align:center;\" | Unknown\n|-\n! style=\"text-align:center;\" | Chieftain O'Flaherty\n| style=\"text-align:center;\" | Joseph Mahowald\n| style=\"text-align:center;\" | Shaun Dalton\n|}\nCritical response\nCritical response was mixed. Ben Brantley, reviewing in The New York Times, wrote that the show compares unfavorably with the composers' Les Misérables and that it registers as a relic of a long-gone era, but praised the performances of Block and Balgord. David Rooney of Variety wrote: \"all-plot, no-heart new show is persuasively sung by a valiant cast, yet it never forges an emotional connection with the audience.\"\nThe show received no Tony Award nominations and faced steadily declining grosses and high weekly running costs. When the show closed, The New York Times reported that it had lost \"at least $16 million.\"\nMusical numbers\n; Act I\n* \"Prologue\" – Orchestra\n* \"The Pirate Queen\" – Dubhdara and Company\n* \"Woman\" – Grace\n* \"The Storm\"† – Company\n* \"My Grace\" – Dubhdara and Grace\n* \"Here on this Night\" – Grace, Tiernan and Crew\n* \"The First Battle\"† – Company\n* \"The Waking of the Queen\" – Elizabeth and Ladies-in-Waiting\n* \"Rah-Rah, Tip-Top\" – Bingham, Elizabeth and Lords\n* \"The Choice is Mine\" – Grace and Company\n* \"The Bride's Song\"† – Grace, Evleen and Women\n* \"Boys'll Be Boys\" – Donal, Mates and Barmaids\n* \"The Wedding\" – Company\n* \"I'll Be There\" – Tiernan\n* \"Boys'll Be Boys\" (Reprise)† – Donal, Grace and O'Flaherty\n* \"Trouble at Rockfleet\"† – Grace, Tiernan, Donal and Bingham\n* \"A Day Beyond Belclare\" – Grace, Tiernan, Donal and Company\n* \"Go Serve Your Queen\"† – Elizabeth and Bingham\n* \"Dubhdara's Farewell\"† – Dubhdara and Grace\n* \"Sail to the Stars\" – Grace, Tiernan and Company\n; Act II\n* \"Entr'Acte\" – Orchestra\n* \"It's a Boy\"† – Grace, Majella and Sailors\n* \"Enemy at Port Side\" – Grace, Evleen, Majella and Sailors\n* \"I Dismiss You\" – Grace, Donal and Sailors\n* \"If I Said I Love You\" – Tiernan and Grace\n* \"The Role of the Queen\" – Elizabeth and Bingham\n* \"The Christening\" – Orchestra\n* \"Let a Father Stand by His Son\" – Donal, Grace, Bingham and Company\n* \"Surrender\" – Bingham, Tiernan, Elizabeth and Company\n* \"She Who Has All\" – Elizabeth and Grace\n* \"Lament\"† – Grace, Majella, Eoin and Company\n* \"The Sea of Life\" – Grace and Company\n* \"Terra Marique Potens\"† – Elizabeth, Grace, Bingham\n* \"Woman to Woman\" – Elizabeth and Grace\n* \"Grace and Elizabeth in Private\" – Elizabeth, Grace, Ladies-in-waiting, Lords\n* \"Behind the Screen\"† – Company\n* \"Grace's Exit\"† – Elizabeth, Grace, Bingham and Company\n* \"Finale\" – Grace, Tiernan and Company\n† Indicates songs that are not on the Original Broadway Cast Recording.\nAwards and nominations\nOriginal Broadway production\n{| class=\"wikitable\" width=\"95%\"\n|-\n! width=\"5%\"| Year\n! width=\"20%\"| Award\n! width=\"40%\"| Category\n! width=\"25%\"| Nominee\n! width=\"10%\"| Result\n|-\n| rowspan=\"4\" align=\"center\"| 2007\n| Drama Desk Award\n| Outstanding Featured Actress in a Musical\n| Linda Balgord\n|\n|-\n| Drama League Award\n| Distinguished Performance Award\n| Stephanie J. Block\n|\n|-\n| rowspan=\"2\"| Outer Critics Circle Award\n| Outstanding Choreography\n| Carol Leavy Joyce (for Mark Dendy's choreography)and Graciela Daniele\n|\n|-\n| Outstanding Costume Design\n| Martin Pakledinaz\n|\n|}\nReferences\nExternal links\n*[http://www.ibdb.com/production.asp?ID=426183 The Pirate Queen]. IBDB.\n*\"[http://www.guidetomusicaltheatre.com/shows_p/piratequeen.html Plot, songs and scenes]\". The Guide To Musical Theatre\n*[http://www.piratequeen.eu The Author of GRANUAILE: Ireland's Pirate Queen (Grace O'Malley) 1530–1603 by Anne Chambers Official Site]"
    }
  ]
}