{
  "content": [
    {
      "type": "text",
      "text": "# The Taking of Power by Louis XIV\n\n| runtime        = 100 min.\n| country        = France\n| language       = French\n| budget         =\n}}\nThe Taking of Power by Louis XIV (), also called The Rise of Louis XIV, is a 1966 French television film by Italian film director Roberto Rossellini.\nPlot\nThe film revolves around the French king Louis XIV's rise to power after the death of his powerful advisor, Cardinal Mazarin. To achieve this political autonomy, Louis deals with his mother and the court nobles, all of whom make the assumption that Mazarin's death will give them more power.\nCast\nReception\nColin McCabe of the University of Pittsburgh praised the film as \"the most serious attempt by a great director to film history.\" In addition to the political story of the king's grasp of power, the \"incidental details, it can be argued, form the real subject matter of all of Rossellini's historical films....\" McCabe's examples include the doctors’ examination of Mazarin at the beginning of the film and the \"extraordinary banquet\" that comes close to the end. \"We watch the dishes being prepared in a kitchen teeming with cooks, we follow the umpteenth platter as it is formally escorted through the corridors and staircases, until it reaches an enormous table, where the king sits alone, dining in front of his whole court.\"\nRelease\nThe Taking of Power by Louis XIV received a DVD release by The Criterion Collection in January 2009.\nReferences\n* Colin MacCabe, (2008) [https://www.criterion.com/current/posts/974-the-taking-of-power-by-louis-xiv-long-live-the-cinema The Taking of Power by Louis XIV: Long Live the Cinema!], Criterion Collection Essay.\nReferences\nExternal links\n*\n*\n*[https://www.criterion.com/current/posts/974-the-taking-of-power-by-louis-xiv-long-live-the-cinema The Taking of Power by Louis XIV: Long Live the Cinema!] an essay by Colin MacCabe at the Criterion Collection"
    }
  ]
}