{
  "content": [
    {
      "type": "text",
      "text": "# The Songs of Wynn Stewart\n\n| recorded   = 1964–1965\n| studio     = Capitol (Hollywood)\n| genre      = }}\n| label      = Capitol\n| producer   = Ken Nelson\n| prev_title = Sweethearts of Country Music\n| prev_year  = 1960\n| next_title = It's Such a Pretty World Today\n| next_year  = 1967\n| misc       =\n}}\nThe Songs of Wynn Stewart is a studio album by American country artist Wynn Stewart. It was released in September 1965 via Capitol Records and was produced by Ken Nelson. The project was Stewart's debut studio recording in his career after nearly a decade prior hits behind him. The album marked Stewart's return to the Capitol label, where he began his recording career in 1956 and left shortly thereafter. Stewart would issued several more studio albums at the label over the next several years.\nBackground and content\nThe Songs of Wynn Stewart was Stewart's first recording sessions with Capitol Records since the mid 1950s. He had his first hit with the label in 1956 called \"Waltz of the Angels.\" Yet, none of his follow-up singles became hits and left the company. However, after a series of setbacks, he re-signed with Capitol in 1964. The songs recorded for this project came from his first new sessions with Capitol between 1964 and 1965. The sessions took place in Hollywood, California at the Capitol Recording Studio. They were produced by Ken Nelson, whom Stewart had first worked with in the 1950s. Nelson would remain with him during his time at Capitol. The album was a collection of 12 tracks which were recorded in the Bakersfield Sound style. Seven of the album's tracks were written (or co-written) by Stewart himself. This included the single \"Half of This, Half of That,\" as well as \"You Took Her Off My Hands,\" \"Money Talks\" and \"Sing a Sad Song.\" Stewart co-wrote these tracks with established songwriters including Harlan Howard and Skeets McDonald.\nRelease and reception\nThe Songs of Wynn Stewart was released in September 1965 via Capitol Records. It was his debut studio album in his recording career, despite previous compilation released and several hit singles. The project was released as a vinyl LP, containing six songs on each side of the record. The album did not reach any chart positions on Billboard upon its release, including the Top Country Albums chart. The album was reviewed favorably by Billboard upon its original release. \"Wynn Stewart has come up with an excellent package with a lot of the material written by himself--for his first Capitol Records album,\" writers commented. Writers also highlighted his self-composed track \"You Took Her Off My Hands\" as a notable highlights.\nThe Songs of Wynn Stewart spawned two singles released between 1964 and 1965. The first was \"Half of This, Half of That,\" which was issued as a single in September 1964. The song spent a total of 15 weeks on the Billboard Hot Country Singles chart and became a top 40 hit, climbing to number 30 in December. \"Sha-Marie\" was spawned as the album's second single in April 1964. However, the song failed to chart any Billboard song publications.\nTrack listing\n| length1         = 2:20\n| title2          = You Kiss Like You're Waving Goodbye\n| writer2         =\n| length2         = 2:15\n| title3          = My Rosalie\n| writer3         = Hap Lowell\n| length3         = 2:33\n| title4          = Money Talks\n| writer4         =\n| length4         = 2:31\n| title5          = You Took Her Off My Hands\n| writer5         =\n| length5         = 2:32\n| title6          = Sha-Marie\n| writer6         =\n| length6         = 2:30\n}}\n| length1         = 2:19\n| title2          = Happy Crazy\n| writer2         =\n| length2         = 2:32\n| title3          = The Happy Part of Town\n| writer3         = Danny Dill\n| length3         = 2:39\n| title4          = I Can Take It or Leave It\n| writer4         =\n| length4         = 2:09\n| title5          = Sing a Sad Song\n| writer5         = Stewart\n| length5         = 2:36\n| title6          = Do Die\n| writer6         =\n| length6         = 1:50\n}}\nPersonnel\nAll credits are adapted from the liner notes of The Songs of Wynn Stewart.\nMusical personnel\n* Bobby Austin – bass\n* Buddy Cagle – guitar\n* Tommy Collins – guitar\n* Eddie Drake – guitar\n* George French – piano\n* Ralph Mooney – steel guitar\n* Helen Price – drums\n* Roy Staggs – guitar\n* Wynn Stewart – lead vocals\n* Red Wooten – bass\nTechnical personnel\n* Ken Nelson – producer\n* George Jerman – photography\nRelease history\n{|class=\"wikitable plainrowheaders\"\n|-\n!scope=\"col\"| Region\n!scope=\"col\"| Date\n!scope=\"col\"| Format\n!scope=\"col\"| Label\n!scope=\"col\"| Ref.\n|-\n! scope=\"row\"| United Kingdom\n| 1966\n| rowspan=\"3\"| Vinyl\n| rowspan=\"2\"| Capitol\n|\n|-\n! scope=\"row\"| United States\n| September 1965\n|\n|-\n! scope=\"row\"| United Kingdom\n| 1986\n| Stetson Records\n|\n|-\n|}\nReferences"
    }
  ]
}