{
  "content": [
    {
      "type": "text",
      "text": "# The Faerie Wars Chronicles\n\nThe Mystery of Choice}}\nThe Faerie Wars Chronicles is a fantasy action young adult novel series written by James Herbert Brennan. The first book in the series, Faerie Wars was published in the United Kingdom in February 2003 by Bloomsbury Publishing. As of 2011, there are five books in the ongoing series.\nBloomsbury began releasing the series in the United States under its Bloomsbury USA imprint in April 2003. In January 2007, Macmillan Publishers began republishing the series in the United States under its Tor Books imprint. On January 16, 2005, the first novel in the series, Faerie Wars reached number 4 on the New York Times Best Seller list for paperback children's books.\nCharacters\nDemons\n* Beleth is the Prince of Darkness, ruler of the Realm of Hael. He is a dangerous entity. In Ruler of the Realm, Beleth forces Blue to form a marriage pact with him so that he could rule the Faeries of the Light and Haelkind with Blue. Due to the pact, Blue becomes Queen of Hael. Immediately after the pact, she kills Beleth.\nFaeries of the Light\n* Princess Holly Blue has a curious nature. She uses a psychotronic spider to go on mind trips anywhere she wants. She occasionally wears boy's clothes to disguise herself when she plays the role of detective to find information. She meets Henry when he walks on her bathing in the Purple Palace. In The Purple Emperor, she is declared by her brother, Prince Pyrgus Malvae, Queen of Faerie and Purple Empress. She later becomes Queen of Hael (Hell) as well after her pact with Beleth, the Demon Prince. At the end of Faerie Lord, Blue accepts Henry's proposal to marry her.\n* Prince Pyrgus Malvae is the animal-loving crown prince, heir to the Peacock Throne. He has an uncanny knack of getting into trouble. In Faerie Wars, he is in trouble for leaving home without the Purple Emperor's permission and for stealing Lord Hairstreak's phoenix. He is also being sought by the demonologist Brimstone who needs him as a human sacrifice. In The Purple Emperor, he meets Nymphalis, one of the Forest Faeries, whom he marries at the beginning of Faerie Lord.\n* Apatura Iris is the Purple Emperor and the father of Holly, Pyrgus and Comma. He dies in Faerie Wars and is resurrected as a zombie in The Purple Emperor.\n* Prince Comma is half-brother to Pyrgus and Blue. He has a mischievous nature and is often in trouble with his father. In The Purple Emperor, he becomes the Purple Emperor, with Lord Hairstreak as regent, when his resurrected father signed a contract for Comma to take his place as the Purple Emperor. In Faerie Lord, he becomes Acting Emperor while Blue searches for Henry.\n* The Painted Lady (Madam Cynthia Cardui) is a mysterious old lady, who only adheres to rules and protocols when it suits her. She is one of Queen Blue's most experienced spies and is the Head of the Imperial Secret Services. She shows romantic interest in Mr. Fogarty and is the only person to call him \"Alan\". In Faerie Lord, it is revealed that she and Alan have married each other.\nFaeries of the Night\n* Lord Black Hairstreak is the antagonist of the story.  He is determined to be in control of the Faerie Realm using any possible means. He is also uncle to Comma, as his mother was Hairstreak's sister, but not to Blue and Pyrgus as their mother died and Apatura Iris remarried.\n* Silas Brimstone is a demonologist, necromancer and co-owner of Chalkhill and Brimstone Glue Factory. In Faerie Lord, he became insane after he summons Jormungand.\n* Jasper Chalkhill is the wealthy co-owner of Chalkhill and Brimstone Glue Factory with Silas. At the end of Faerie Wars, he is imprisoned for using cats to make glue. In The Purple Emperor, Lord Hairstreak illegally releases Chalkhill from jail for his own schemes.\nForest Faeries\n*Cleopatra Antiopa is the Queen of the Forest Faeries and mother of Nymphalis.\n*Nymphalis Antiopa is the agile princess of the Forest Faeries. She meets Pyrgus in The Purple Emperor when he is exiled into the forest by Comma. She later marries Pyrgus at the beginning of Faerie Lord. She is more commonly known as Nymph.\nHumans\n* Henry Atherton, an English teenager, is the protagonist of the story. At the end of Faerie Wars, he is promoted to the title of Knight Commander of the Grey Dagger and given a faerie name of Iron Prominent by Pyrgus. At the end of Faerie Lord, Henry proposes to marry Blue, to which she accepts.\n* Alan Fogarty is a stubborn old man, a former physicist with a talent for engineering and is an anarchist. He is a former bank robber, which is one of the causes of his paranoia about the CIA and FBI, which he believes are after him. He assists Henry and Pyrgus in making an inter-world portal between the Faerie world and the human world in Faerie Wars. At the end of Faerie Wars, he is promoted to Gatekeeper of the House Iris in recognition of the help he gave Pyrgus. In The Purple Emperor, he meets the Painted Lady for the first time and is romantically interested in her from then on. In Ruler of the Realm, he becomes Acting Emperor for a month due to Blue's absence. In Faerie Lord, it is revealed that he and Cynthia have married each other. Soon afterwards, he dies due to Temporal Fever.\nMedia\nBook releases\n{| class=\"wikitable\" style=\"width:100%; margin:auto;\"\n|-\n! style=\"background: #93B8C4;\"|Title !! style=\"background: #93B8C4;\"|Date !! style=\"background: #93B8C4;\"|Length !! style=\"background: #93B8C4;\"|ISBN\n| isbn           = 978-0-7475-5944-3\n| line_color     = novel\n| short_summary  = When the prince of the Realm, the faerie world, Pyrgus Malvae, is in danger, his father, the Purple Emperor, has him \"translated\" to the Analogue world, Earth.  There he finds human allies in Henry and Mr. Fogarty. Meanwhile, the Prince of Darkness, Beleth, is trying to incite a civil war so he can use the distraction to invade the Realm of the Faeries himself.\n}}\n| isbn           = 978-0-7475-7479-8\n| line_color     = novel\n| short_summary  = Apatura Iris, the late Purple Emperor, returns from the dead on the eve of Pyrgus's coronation. Under the control of Lord Hairstreak, he makes Comma become the Purple Emperor, who in turn exiles Pyrgus and Holly. The exiles find allies in the Painted Lady and the reclusive Forest Faeries. Henry returns to the Purple Palace unaware of the coup. Temporarily reduced to miniature size by faulty transportation, he encounters a scary spider, a mad queen and a rug-like endolg, a creature which can tell the truthfulness of anyone's intentions.\n}}\n| isbn           = 978-0-7475-8299-1\n| line_color     = novel\n| short_summary  = Holly Blue is now the Ruler of the Realm and must decide whether to attack the Faeries of the Night or accept their offer of an alliance. She decides to consult an Oracle but while there she and Henry suddenly vanish. Pyrgus and Nymphalis of the Forest Faeries team up to investigate.\n}}\n| isbn           = 978-0-7475-9100-9\n| line_color     = novel\n| short_summary  = After two years living in the human realm, Henry Atherton is miserable. A visit from his old friend Pyrgus and his wife, Nymphalis, reveals that a disease called Temporal Fever is spreading through The Realm, causing inflicted faeries' aging process to speed up. Henry's old employer, Mr. Fogarty, also has the disease. Henry returns to The Realm to try to persuade him to go to the Analogue World, where the disease has no effect. Henry gets to speak to him, but while he is in the portal room, Fogarty dies. Queen Holly Blue informs him of Fogarty's passing, but before they can speak properly, Madame Cardui transports Henry to an unknown location. Blue has her put under house arrest, but she escapes. Meanwhile, Silas Brimstone, a demonologist, and his business partner, Jasper Chalkhill, are transporting precious cargo from the realm to a secret place in the wasteland country, Bunther, called the Mountains of Madness. After the cargo is stowed, Silas calls forth a beast called The Midgard Serpent, Jormungand, which attacks Chalkhill. Blue and her older brother Pyrgus travel to the mansion of Madame Cardui's late husband where they confront her. She explains that she sent Henry away because Fogarty had a vision in which Henry would find the cure for Temporal Fever, but that he also had a second vision where Henry wouldn't and all of Faerie World became infected. His vision also showed Pyrgus coming to speak with her, but Blue was not in the vision, showing that an alternate future has now been created. In Bunther, Henry appears in a Vaettir's lair, barely escaping its attack. After wandering aimlessly in the desert, he collapses. Hours later, he awakens to find himself the care of a blue-skinned boy called Lorquin who helps Henry recover. In exchange, Henry helps him kill The Draugr, the mother of the Vaettirs. Afterwards, Lorquin takes Henry to the Luchti's secret city under desert where Henry stays a few days until he receives a message from Fogarty telling him he must go to the Mountains of Madness to save Blue from the Midgard Serpent. Lorquin goes with him to the mountains, where they confront Jormungand, which has turned into a dragon by Loki, and send it back to its own reality. Afterwards, they discover that the Temporal Fever was caused by an angel that had been trapped by SIlas Brimstone. When Henry releases it, the fever disappears and all those afflicted return to normal with the exception of those who died. Those people remained dead. Henry gathers his courage and proposes to Blue, in which she accepts.\n}}\n| isbn           = 978-1-4088-0561-9\n| line_color     = novel\n| short_summary  = Sixteen years after the events in Faerie Lord, Henry and Blue's daughter, Culmella Chrysotenchia, also known as Mella, decides to visit the Analogue World to visit Henry's mother. After meeting with Henry's annoying sister Aisling, a portal miscalculation sends them to Haleklind. Meanwhile, Hairstreak, now a head in a box, orders his assassin, Chalkhill, to find the girl and bring her back. Chalkhill, brings his old partner Silas Brimstone and his invisible, powerful partner \"George\" back from the asylum, where he stayed after turning crazy, to help him search for Mella. Mella overhears a plot in Haleklind to overthrow the Empire. Queen Holly Blue and King Consort Henry Atherton narrowly escape an encounter with dangerous plants after a daring escape from Chalkhill's manor, where Chalkhill and Brimstone held them captive. In the meantime, Pyrgus discovers that Haleklind is breeding Manticores, powerful magical creatures, and planning on invading the Empire with the great herds. Meanwhile, Aisling and Mella caught, and lose their memories with a lethe. Hairstreak, now managed to find himself an artificial body more powerful than ever, retrieves them. Unexpectedly, he falls in love with Aisling, who now helps him. Mella escapes from Hairstreak, despite not knowing who she is. She then meets Mella II, a clone of her that was made by Hairstreak to help his plot and rule the realm for him. Mella II explains who Mella is, and the two of them are brought by Manticores to meet George, who is actually the God Yidam, and leads the herd of Manticores. On the brink of war, Pyrgus travels to Haleklind to try to stop the Manticores without harming them. However, with Mella and Mella II's help, the Manticores leave the border for war. Mella and Mella II are then taken back to the palace, and Hairstreak decides to marry Aisling.\n}}\n|}\nAudiobook\nOn September 30, 2004, Recorded Books released an 11-hour-25-minute audio book version of Faerie Wars which was read by Gerald Doyle. On September 1, 2005, a 12-hour, 30-minute audio book version of The Purple Emperor, which was read by Gerald Doyle, was released by Recorded Books. In 2006, a 12-hour, 15-minute audio book version of Ruler of the Realm, which was read by  James Daniel Wilson was released by Recorded Books. In 2008, Faerie Lord was adapted into a 12-hour, 15-minute audiobook narrated by James Daniel Wilson and was released by Recorded Books.\nReception\nThe New York Times commends Brennan as \"a master of the hairpin turn, leading readers in one direction and suddenly reversing their expectations . . . Brennan excels at maintaining suspense.\"\nSponsored by The Young Adult Library Services Association, teen readers from the various YA Galley Groups selected Faerie Wars as the Teens' Top Ten book for 2003. School Library Journal stated that Faerie Wars has a \"complex plot with plenty of drama and action\". However, it criticised Faerie Wars for \"sinking under its own weight\". Nathan Brazil from SF Site commends Faerie Wars for plot that alternates between \"provoking and serious\" and \" funny, fast paced adventure\". He also comments on the lack of depth in the story. Nicholas Tucker from The Independent compares Faerie Wars to Harry Potter for its inventiveness and to Gormenghast for its dark themes. He also commends the Brennan for avoiding \"unlimited melodrama in contemporary writing [which] often ends up choking on its own rhetoric\" by \"infusing his story with affectionate irony as characters are brought down to earth by humour\". Kirkus Reviews comments that Faerie Wars is the \"perfect choice for Harry Potter fans who don't know what to read next, aside from unjustifiably archaic gender roles.\"\nCarolyn Cushman reviewing for Locus commented that The Purple Emperor \"lacks the novelty of the first volume, but the fast-paced adventure and numerous quirky characters keep things lively.\" Kirkus Reviews comments on The Purple Emperor that \"Brennan cuts chapters off sharply, maintaining heated suspense, but the ultra-quick pinballing between threads is sometimes frustrating.\" The review also comments on the \"gross-out factor\" with \"verbose worms [which] are implanted in people's butts and speak to them inside their brains.\"\nKirkus Reviews on the Ruler of the Realm criticises \"Brennan's characters for seem younger than their ages and his prose is often cluttered\". However, \"images are colorful, and the ricocheting narrative--each chapter ending in suspense and the next chapter jumping to a different plotline--pulls readers to a surprisingly satisfying conclusion.\"\nKirkus Reviews on the Faerie Lord criticises the novel for its \"disturbing definition of female sexiness just tops off this queen (Blue)'s notably passive and love-focused role, and may well outweigh Brennan's sweet touches and lovely final revelations.\"\nOisín McGann, writing for the Inis Magazine, praises The Faeman Quest for having \"a fast pace, a light-hearted tone and rich descriptive passages.\" However, it criticised the novel for having \"a few key scenes...which seemed to happen while the reader isn't looking.\"\nReferences\nExternal links\n*[http://www.faeriewars.com/homepage.asp Official Faerie Wars website]"
    }
  ]
}