{
  "content": [
    {
      "type": "text",
      "text": "# The Slow Empire\n\nThe Slow Empire is a BBC Books original novel written by Dave Stone and based on the long-running British science fiction television series Doctor Who. It features the Eighth Doctor, Fitz and Anji.\nPlot\nThe Slow Empire is notable for its somewhat unusual framing device, with sections of this novel being narrated by a somewhat pretentious narrator named Jamon de la Rocas who accompanies the Doctor and his companions in their travels. These sections are printed in the Comic Sans font.\nWhile the TARDIS floats through the Time Vortex, it is invaded by a group of beings known as Vortex Wraiths. The Doctor is forced to land on a planet in an area of unusual spacetime dubbed the Slow Empire where time travel and faster-than-light travel are impossible. Travel between the planets in the Empire are facilitated through the use of Transduction Chambers (somewhat rudimentary teleporters that can take entire centuries to transmute objects from one place to the next) and each planet has a member of the \"Ambassadorial Corps\" on it.\nThe first planet that the Doctor arrives on is the desert world of Shakrath. They are very quickly captured by the extremely oppressive government of the planet and meet Jamon for the first time. They also meet the sadistic ruler of the planet, who plans to use the Doctor's companions as part of an extremely sadistic harem. Though the Doctor and his companions are able to escape from this, they are found by an Ambassador and forces the Doctor to open the TARDIS - letting a Vortex Wraith exit it. In the confusion, the Doctor and company are able to escape.\nThe next planet the Doctor arrives in is the forest planet of Thakrash. This planet was originally an extremely opulent colony of the Empire but was isolated when a ship belonging to a Collector crashed onto the planet and destroyed its Transference Chamber. While the Collector is still on this planet, a group of Ambassadors' descendants who want to rebuild the Chamber's pylon also lurk on the planet and kidnap the Doctor after he finds the last piece of the pylon. The descendants try to use the Doctor's blood to rebuild the pylon and are horribly mutated in the process before the pylon violently explodes.\nOnce the Doctor recovers from his treatment on Thakrash and invites the Collector into the TARDIS, he travels to the information-center world of Goronos. Unfortunately, the Doctor and his companions are captured by an Ambassador and forced into a Matrix-style virtual reality dubbed the Cyberdyne. While Fitz lives out the fantasy of a rock star (which rapidly degrades), Anji is menaced by a mysterious stalker but is rescued by a mysterious man who awakens her from the Cyberdyne. The Doctor is able to rescue the rest of his companions from the Cyberdyne and, after getting information that leads him to the center of the Empire, departs from Goronos.\nOn arriving at the center of the Empire, the Doctor discovers that it is a desolate world upon which all life has been snuffed out. It is revealed here that the Vortex Wraiths have taken root on the Empire and have been using a form of blood magic to puppet the bodies of the Ambassadors (using the principle that teleportation simply produces a copy somewhere else to explain how they got the original bodies of the Ambassadors) and warp the Empire for their own purposes. Using the threat of killing every life in the Empire, the Wraiths force the Doctor to help them using the TARDIS. Fortunately, the Doctor is able to turn the tables on them - destroying the Wraiths and Transference completely. A postscript reveals that the Doctor gave Jamon a belt allowing him to save souls trapped in Transference during its destruction and let him travel the Empire with the Collector.\nPopular culture allusions\nThis novel has a number of allusions to popular culture:\n*Anji has consecutively watched every episode of Quantum Leap due to her boyfriend, Dave.\n*A small screen graphic of the TARDIS is described as having a \"video echo effect from a 1970s Top of the Pops.\"\n*The several console terminals on the planet Goronos reminded Anji of that film done by the man who did Time Bandits and was originally going to be titled 1984 and a Half.\nContinuity\n*The man who wakes Anji has been confirmed to be Sabbath in disguise\n*The Collectors also appeared in Heart of TARDIS. Similar beings (dubbed Sloathes) also appear in Stone's novel Sky Pirates!.\nReferences\nExternal links\n*[http://www.magnetopia.org/cloisterlibrary/slowempi.htm The Cloister Library - The Slow Empire]\n*"
    }
  ]
}