{
  "content": [
    {
      "type": "text",
      "text": "# The Tomorrow War (soundtrack)\n\n}}\nThe Tomorrow War (Amazon Original Motion Picture Soundtrack) is the soundtrack to the 2021 film The Tomorrow War directed by Chris McKay starring Chris Pratt. The film's soundtrack featured 20 tracks composed by Lorne Balfe, who previously associated with McKay on the animated film The Lego Batman Movie (2017). The soundtrack album was released on July 2, 2021, by Milan Records.\nTrack listing\nReception\nZanobard Reviews assigned 8/10 to the album, saying that the film's score sports \"an excellently-crafted main theme\" and an \"eerie, effective counter-motif for the hostile alien Whitespikes\" and the combination of these themes form \"a solid thematic baseline throughout the score.\" The review further added the compositional style as one of the highlights, praising the \"genuinely gorgeous orchestration that gives the whole album a crisp, quality sound\", which plays better in the main theme. Music critic Jonathan Broxton, described it as \"an excellent score, combining strong thematic content with a great deal of creativity in terms of orchestration, innovation, and extended compositional techniques\". Filmtracks assigned 3 out of 5 calling the score as \"loud, meaty, and anthemic\" and further added \"Balfe offers much to like in The Tomorrow War, but there are disconnects between the themes in context and as presented on album, and some of the action music in between them pounds away anonymously.\"\nJames Southall of Movie Wave wrote \"There's a lot to enjoy in The Tomorrow War [...] it's not ground-breaking but it has good ideas, a number of good tracks and one outstanding one, so it's certainly worth a listen.\" Anton Smit of Soundtrack World described the music as \"a wonderful showcase of integrating thematic ideas into the music to support all the hectic things that are happening on the screen\". For the musical piece \"Miami Dolphins Still Suck\", Alli Patton of American Songwriter said that \"the orchestral masterpiece is the perfect addition to any sci-fi action adventure\".\nPersonnel\nCredits adapted from Milan Records\n* Music composed and produced by – Lorne Balfe\n* Additional music – Peter Adams, Steven Davis, Stu Thomas\n* Conductor – Jasper Randall\n* Music editor – Alex Gibson, Maarten Hofmeijer\n* Orchestrators – Adam Price, Gabriel Chernick, Harry Brokensha, Luigi Janssen\n* Recording and mixing – Scott Michael Smith, Seth Waldmann\n* Soloist – Tina Guo\n* Vocals – Tori Letzler\nReferences"
    }
  ]
}