{
  "content": [
    {
      "type": "text",
      "text": "# The Battle of the Birds__disambig_1\n\nThe Battle of the Birds (Scottish Gaelic: Cath Nan Eun) is a Scottish fairy tale collected by John Francis Campbell in his Popular Tales of the West Highlands. He recorded it in 1859 from a fisherman near Inverary, John Mackenzie and was, at the time, building dykes on the Ardkinglas estate.\nThe tale is classified in the Aarne-Thompson-Uther Index as ATU 313, \"The Magic Flight\" (\"Girl Helps the Hero Flee\") or \"The Devil's (Ogre's/Giant's) Daughter\".\nPublication\nJoseph Jacobs took it from there for his Celtic Fairy Tales and added some additional elements. It is also included in The Lilac Fairy Book by Andrew Lang and A Book of British Fairy Tales by Alan Garner.\nSynopsis\nA king's son set out to see a battle, where every animal fought; he promised to bring back to his father the news of who would be the king of the animals that year.  He arrived when the fight was almost over, but a snake and a raven still fought.  He cut off the head of the snake.  The raven, in gratitude, flew him to a castle where his sister lived, and the prince spent the night there.  The raven then flew to another castle, where he also spent the night, but the next morning he met a handsome youth, who had been the enchanted raven.  The youth gave him a bundle and warned him not to open it until he was in the place where he most wanted to be.\nWhen he was nearing his father's house, he opened the bundle.  A great castle sprang up, and an irate giant demanded to know why he had put it there.  It offered to put it back if the prince gave him his first son, when he reached seven years of age.  Then the prince went out, and opened the bundle near his father's lands.  He went into the castle, and found a pretty maid who was willing to be his wife.  They had a son, and seven years later, they tried to put off the giant with the cook's son, and the butcher's son, but finally had to yield their own.\nThe giant raised him.  One day, he heard music and found the giant's daughter.  She told him the next day the giant would ask him to marry one of her two older sisters, but she wanted him to insist on her, because she did not like the bridegroom he wanted for her.\nfor Celtic Fairy Tales.]]\nThe prince asked, but the annoyed giant demanded that he clean out the byre, or he would not get his youngest but be killed.  He started to clean.  The daughter came by at noon, and the prince fell asleep, but the byre was clean when he woke.  The giant knew he did not clean it, but set him to thatch it with birds' down.  The prince tried to hunt the birds.  At noon, the daughter put him to sleep again, and the roofs were thatched with feathers when he woke.  The giant knew he had not done it, and set him to fetch down a bird's nest.  He tried to climb it and got no more than half way.  The daughter built him a ladder of her fingers, and when he got it down, she left her little finger in the tree.\nShe told him that the giant would ask him to pick her out from her sisters, and the only mark would be that she was missing her finger.  The wedding was held and celebrated, and the prince picked out his bride from her sisters.  The giant told them to go to rest.  The daughter told her husband that they had to flee at once, and they took a gray filly.  She left behind slices of apples that answered the giant.  Only when the last one had spoken did he realize that they had fled.  He gave chase.  When the giant nearly caught them, the daughter had the prince take a twig from the filly's ear and throw it behind them:  it became a forest.  The giant got through it, and they threw a pebble that became a mountain.  The giant got through it, and they threw a flask of water that became a wave and drowned him.\nThe daughter forbade him to let anyone or thing in his father's house kiss him, or he would forget her, but a greyhound leaped up to kiss him, and he forgot the daughter.  She stayed in a tree by a well.  A shoemaker's wife and daughter, going to fetch water, both thought her shadow was theirs, and thought themselves too beautiful to fetch water.  The shoemaker went himself, saw her, and persuaded her to come down.\nWhen she stayed his house, some young men tried to woo her, but she made them stick to the latch so they could not approach her.  The shoemaker was making shoes for the king's son, who was to marry, and the daughter persuaded him to take her. She conjured up a silver and a gold pigeon, and grains.  The silver pigeon ate them, and the golden pigeon taxed him with what the giant's daughter had done for the prince.  At that the prince knew her, and married her a second time.\nAnalysis\nTale type\nThe tale is classified in the international Aarne-Thompson-Uther Index as type ATU 313, \"The Magic Flight\" (previously, \"Girl helps the hero flee\"). The beginning of this tale merges the ATU tale type 222, \"The Battle of the Birds\" or \"War of Quadrupeds and Birds\", and ATU 537, \"The Helpful Eagle (Etana)\". This combination usually marks the tale type ATU 313B, \"Girl helps in hero's flight\" with introduction \"The Forbidden Box\".\nThe ending of the tale falls under the category ATU 313, \"The Magical Flight\" with ending ATU 313C, \"The Forgotten Fiancée\", with motif \"Kiss of Oblivion\". As noted by professor Dean Fansler, the \"Kiss of Oblivion\" incident occurs because the hero breaks a taboo that the maiden warns against (\"usually a parental kiss\"). The hero's true memory only reawakens on the day of the wedding with the new bride. Moreover, Norwegian folklorist Reidar Thoralf Christiansen remarked that this ending motif was \"very common\". However, German folklorist Hans-Jörg Uther, in his revision of the index, published in 2004, subsumed the sequence and the subtypes back into the more general type, creating new type ATU 313, \"The Magic Flight\".\nSlavicist Karel Horálek remarked that the episode of the \"Forgotten Bride\" \"occurs more frequently as the final part in the AaTh 313 type\" and, combined with the starting episode of Eastern European and Celtic variants (e.g., the episode of the box and the eagle), would indicate a very old connection.\nVariants\nBritish scholar William Ralston Shedden-Ralston noted \"a very striking ... likeness\" between the Scottish tale and the Russian fairy tale The Sea Tsar and Vasilisa the Wise. Similarly, according to Russian folklorist , type 313B, with the starting episode of the quarrel between animals and the hero's father rescuing the bird, only appears in \"East Slavic, Serbo-Croatian, Czech, Lithuanian, Estonian, Finnish, Flemish, French, Scottish and Irish\" variants.\nIrish folklorist Séamus Ó Duilearga commented that the tale type ATU 313 was \"one of the most popular of all Irish folk-tales\". According to him, the Irish Folklore Commission catalogued 66 manuscripts as of 1943, and he supposed that a complete archive should yield \"several hundred [variants], at least\".\nWestern Europe\nIrish folklorist Patrick Kennedy listed Irish tale The Giant and his Royal Servants as a parallel tale to the general narrative of  The Battle of the Birds and cited The Master Maid as its Norse counterpart.\nJoseph Jacobs, in his commentaries on the tale, mentioned that \"no less than sixteen variants [have been found] among the Celts\", apart from published tales from Scotland and Ireland.\nNorwegian folklorist Reidar Thoralf Christiansen remarked that the opening motif of The Battle of the Birds \"is better known in Scottish-Gaelic versions\".\nFrançois-Marie Luzel collected a variant from informant Marguerite Phillipe, from Lower Brittany, in 1868, and published it with the title ''L'hiver et le Roitelet'' (\"Winter and the Kinglet\"). In this tale, Winter, the season, annoys a kinglet, a little bird, for three nights, until the kinglet is forced to seek shelter in a mousehole. However, a mouse, already living in the mousehole, quarrels with the kinglet and both summon all flying animals and quadrupeds for a war. An eagle joins the fight and is hurt. A prince, who saw the conflict by his window, finds the eagle and restores it to health. After some time, the eagle takes the prince to his mother. The eagle's mother greets her son and, seeing the human, delights at the prospect of having him for dinner, but the eagle assures her he is their guest. The prince also meets the eagle's sister and falls in love with her. After three months, the eagle and his mother impose tasks on the prince, which he performs with guidance from the eagle's sister. Later, the prince takes the eagle's sister as his wife back to his kingdom, and breaks his ring in two to give the maiden one half, to always remember him by. The ring's half also serves to rekindle the prince's memory when he forgets about his adventures with the maiden.\nNorthern Europe\nSlavicist Karel Horálek stated that Finnish variants followed the Russian story type very closely: the rescue of an eagle (or a raven, in some variants), the aerial journey, the box, the opening, the creature who offers to close it.\nEastern Europe\nProfessor Jack V. Haney stated that the combination of AT 222* and AT 313 was more common in the East Slavic area (Russia, Ukraine and Belarus).\nNisbet Bain translated a Cossack (Ukrainian) variant titled The Magic Egg: a lark and a shrew-mouse quarrel over the crop yields and then go to war against each other. Meanwhile, an archer has an eagle in his sights and prepares to shoot an arrow, but the bird pleads for its life. The archer takes the eagle with him and helps it recover. The eagle then flies with him; it first drops him three times in mid-air to scare him, but later takes him to its master. The archer receives a magic egg and returns home. The man breaks opens the magic egg and an enchanted ox jumps out. The archer tries foolishly to put the animal back into the egg until an old she-dragon does so, in exchange for the archer's only son.\nRussia\nEight variants of the tale were collected by Russian folklorist Alexander Afanasyev in the 19th century, numbered 219-226. Out of these variants, tales number 219-221 and 224 begin with the hero's father (soldier, hunter, archer) meeting the eagle, flying on its wings and receiving a magical casket that he cannot close. Very soon, the antagonist of the tale appears to help the man close the box in exchange for his son.\nSee also\n*The Green Man of Knowledge (Scottish folktale)\n*King Kojata\n*Nix Nought Nothing\n*Prunella\n*Snow-White-Fire-Red\n*The Girl Without Hands\n*The Grateful Prince\n*The Master Maid\n*The Nixie of the Mill-Pond\n*The White Dove\nReferences\nExternal links\n*[http://www.sacred-texts.com/neu/celt/pt1/pt106.htm The Battle of the Birds]\n*[http://www.surlalunefairytales.com/authors/jacobs/celtic/battleofbirds.html The Battle of the Birds], from Joseph Jacobs"
    }
  ]
}