{
  "content": [
    {
      "type": "text",
      "text": "# The Tale of Clever Hasan and the Talking Horse\n\nThe Tale of Clever Hasan and the Talking Horse is a Middle Eastern tale published by author , about the friendship between a prince and his magic talking horse, both evading dangers poised by the boy's stepmother.\nThe tale is classified in the international Aarne-Thompson-Uther Index as type ATU 314, \"Goldener\", with an alternate introductory episode: evil stepmother persecutes hero and his horse. Similar tales are known across the Middle East.\nSource\nThe tale was provided to Katibah by an informant named Mr. Azar H. Hanania, from Lincoln, N. J. Scholar Hasan M. El-Shamy sourced the tale from Lebanon.\nSummary\nA king's wife gives birth to a boy named Hasan, and dies, and a foal is born in the stables at the same time. The boy and the foal become great friends and spend time together. In time, the king remarries; his second wife is a princess, who eventually gives birth to her own sons, Hasan's half-brothers. She begins to despise her step-son and conspires with a loyal nurse ways to get rid of her step-son: she places a poisoned needle near the entrance, so as to prick Hasan when he returns from school. With the Talking Horse's warning, Clever Hasan avoids the danger. Later, she feigns illness and asks for the heart of the horse as a cure. The Talking Horse overhears their conversation and convinces Hasan to escape with him to another kingdom.\nThey ride away to the wilderness and find an old man next to a fire. Clever Hasan greets him politely, and the old man allows the boy to sit beside him. The old man also tells him that, by next morning, he will die, and begs Hasan to arrange a proper burial. Before he dies, he gives Hasan a set of keys to the doors to his cave, which he can freely explore, save for the seventh door, and bids him graze his flock of sheep and goats everywhere save the east direction. The old man dies, and Hasan takes the opportunity to explore the cave; behind every door, heaps of treasure, an arsenal; a pool of gold and a pool of silver with which Hasan washes his hair. Curious about the seventh door, Hasan lets the flock graze in the east, and suddenly a ghoul appears. She devours the sheep and pursues Hasan, who manages to kill her.\nLater, he finally opens the last door; inside, a black steed with fiery eyes that begs for Hasan to release him. Hasan obeys; the horse becomes a marid and threatens the boy, since his father kidnapped his marid mate who turned into a mare. The Talking Horse barges into the room and tells the marid he is his son. After the family reunion, the marid gives some of his hairs to Hasan and departs. Later, the prince and the horse reach another city; Hasan leaves the horse on the outskirts of the town, while he goes to look for a job. Inside the city, he trades clothes with a shepherd, puts on a cap on his hair, and finds work as an assistant to the royal gardener, under the name \"Baldy\". A sultan lives in the city with his three daughters, Zubaida, Zulfa and Zainab, the youngest the most beautiful, with whom Clever Hasan falls in love.\nOn two occasions, Clever Hasan summons the marid and asks him to bring a suit of red armor; he dons the red armor and rides the Talking Horse to trample the garden. He spins a story about a horde of horsemen that attacked the garden. Princess Zainab has witnessed the event, and throws him her handkerchief. Some time later, the sultan decides to find suitors for the princesses in the same occasio, by having them throw apples at their spouses of choice. Zubaida chooses the grand vizier's son, Zulfa the cadi's son and Zainab the gardener's assistant, to the mockery of the populace.\nA month passes; the sultan falls ill, and only the milk of lions can cure him. Clever Hasan summons the marid and asks to be taken to the Land of Lions, where he spends some time milking the lionesses. Two weeks later, his brothers-in-law reach the Land of Lions and ask Hasan to give a bit of the milk. Hasan agrees to share, as long as both men agree to be branded in their inner thighs. Later, war breaks out with a neighbouring king; Clever Hasan summons the marid again and asks for a suit of black armor and a powerful sword. He wins the battle. The sultan comes to the battlefield to thank the mysterious black knight, who reveals himself as Baldy, the gardener, and his son-in-law.\nAnalysis\nTale type\nThe tale is classified in the Aarne-Thompson-Uther Index as type ATU 314, \"The Goldener\": a youth with golden hair works as the king's gardener. The type may also open with the prince for some reason being the servant of an evil being, where he gains the same gifts, and the tale proceeds as in this variant.\nIntroductory episodes\nScholarship notes three different opening episodes to the tale type: (1) the hero becomes a magician's servant and is forbidden to open a certain door, but he does and dips his hair in a pool of gold; (2) the hero is persecuted by his stepmother, but his loyal horse warns him and later they both flee; (3) the hero is given to the magician as payment for the magician's help with his parents' infertility problem. Folklorist Christine Goldberg, in Enzyklopädie des Märchens, related the second opening to former tale type AaTh 532, \"The Helpful Horse (I Don't Know)\", wherein the hero is persecuted by his stepmother and flees from home with his horse.\nAmerican folklorist Barre Toelken recognized the spread of the tale type across Northern, Eastern and Southern Europe, but identified three subtypes: one that appears in Europe (Subtype 1), wherein the protagonist becomes the servant to a magical person, finds the talking horse and discovers his benefactor's true evil nature, and acquires a golden colour on some part of his body; a second narrative (Subtype 3), found in Greece, Turkey, Caucasus, Uzbekistan and Northern India, where the protagonist is born through the use of a magical fruit; and a third one (Subtype 2). According to Toelken, this Subtype 2 is \"the oldest\", being found \"in Southern Siberia, Iran, the Arabian countries, Mediterranean, Hungary and Poland\". In this subtype, the hero (who may be a prince) and the foal are born at the same time and become friends, but their lives are at stake when the hero's mother asks for the horse's vital organ (or tries to kill the boy to hide her affair), which motivates their flight from their homeland to another kingdom.\nMotifs\nProfessor Anna Birgitta Rooth stated that the motif of the stepmother's persecution of the hero appears in tale type 314 in variants from Slavonic, Eastern European and Near Eastern regions. She also connected this motif to part of the Cinderella cycle, in a variation involving a male hero and his cow.\nQuest for the remedy\nA motif that appears in tale type 314 is the hero having to find a cure for the ailing king, often the milk of a certain animal (e.g., a lioness). According to scholar Erika Taube, this motif occurs in tales from North Africa to East Asia, even among Persian- and Arabic-speaking peoples. Similarly, Hasan M. El-Shamy noted that the quest for the king's remedy appears as a subsidiary event \"in the Arab-Berber culture area\". In addition, Germanist Gunter Dammann, in Enzyklopädie des Märchens, noted that the motif of the quest for the remedy appeared \"with relative frequency\" in over half of the variants that start with the Subtype 2 opening (stepmother's persecution of hero and horse).\nBranding the brothers-in-law\nAccording to German scholars Günther Damman and Kurt Ranke, another motif that appears in tale type ATU 314 is the hero branding his brothers-in-law during their hunt. Likewise, Ranke stated that the hero's branding represented a mark of his ownership over his brothers-in-law.\nRanke located the motif in the Orient and in the Mediterranean. In the same vein, Hungarian professor Ákos Dömötör, in the notes to tale type ATU 314 in the Hungarian National Catalogue of Folktales (MNK), remarked that the motif was a \"reflection of the Eastern legal custom\", which also appears in the Turkic epic Alpamysh.\nVariants\nAccording to Germanist , tale type 314 with the opening of hero and horse fleeing home extends from Western Himalaya and South Siberia, to Iran and the Arab-speaking countries in the Eastern Mediterranean. In addition, scholar Hasan El-Shamy stated that type 314 is \"widely spread throughout north Africa\", among Arabs and Berbers; in Sub-saharan Africa, as well as in Arabia and South Arabia.\nLebanon\nClever Hasan\nIn a Middle Eastern tale collected from a Lebanese source and translated as Clever Hasan, Hasan is the son of a king. When the queen dies, the king remarries, and his new wife bears him three children, two boys and a girl, whom Hasan dotes on. The boy is also given a white steed he names Sourour (\"Joy\"), which he rides and plays with. Meanwhile, the new queen worries about her sons inheriting the throne, and begins to think of ways to get rid of him. With a midwife's advice, the queen first digs up a ditch and covers with a mat; next, she tries to poison his food (a dish of fatta’er). With the help of his horse (which the story tells is really a jinn in an equine body), Hasan avoid both attempts on his life; on the second attempt, however, Hasan exchanges his poisoned dish for his half-siblings', who eat the fatal food and die. After the loss of her children, the queen is told by the midwife the horse is protecting her step-son, and it must be dealt with before anything, so the queen feigns illness and asks for its heart as a cure. Learning of this, Sourour and Hasan have plans of their own: the next day, Hasan asks his father to ride the horse for one last time in front of an assemblage. He circles around for three times, then flies with Sourour in the air to another city. When they land, Hasan sees a simple goatherd and buys his clothes. He wears a cap on his head; Sourour gives him seven of its hairs, which he but needs to burn to summon the horse, and departs. Hasan then goes to the city and finds work as the royal gardener's assistant, under the identity of Saleh, a boy with scurf on his scalp. The royal gardener takes him in and he masters the craft. One day, when the gardener leaves Hasan to visit his parents and pray at the mosque, the youth takes the opportunity to take a bath and ride Sourour around the garden for a while - an event witnessed by the king's daughter, princess Sitt al-Banat, who becomes fascinated by how a lowly gardener suddenly became so fine a knight riding on his mighty horse. Soon after, Hasan dismisses the horse and resumes his Saleh identity. When the gardener, Mahmoud, returns, he sees the garden has been trampled and questions his assistant about it. Saleh spins a story about how some men came in and destroyed the garden, which the princess confirms to protect Saleh. Later, the princess is being courted by many suitors, but none pleases her, so she chooses Saleh, the lowly gardener, as her husband, to the king's annoyance. Saleh marries her and takes her to a desolate place, then uses the horse's hairs to summon Sourour and ask him to build a large palace for him. Back to the king, who still has not accepted his daughter's decision, he is advised by his ministers to go on a hunt to clear his head. The king complies and roams the streets of the kingdom with his minister, until he sights Saleh's palace in the distance. Inside the palace, princess Sitt al-Banat spies her father in the distance and requests her husband to invite her father in. Hasan welcomes his father-in-law to his palace and his daughter explains Saleh, the gardener, is actually prince Hasan, son of King Hasan ben Hamaan. The king embraces him as his son-in-law.\nBaldhead in the Garden\nNajla Jraissaty Khoury collected a Lebanese tale, translated to English by author Inea Bushnaq as Baldhead in the Garden, and to French as Le Chauve du Jardin'' (\"The Bald One from the Garden\"). In this tale, the hero is being threatened by his stepmother: first, she tries to poison a dish of goose, but, with his filly's warnings, he spins the tray so that his half-brothers by his stepmother are the ones to eat it and die. Later, the stepmother feigns illness and asks the boy for the heart of a filly with three white legs - which just happens to be the pedigree of the boy's pet. However, the boy was forewarned by the filly that it was a trick by the woman, He takes his loyal filly and rides away to the wilderness, where he finds shelter with a helpful ghoul. Some time during his life with the ghoul, the boy is given a key with an express prohibition to not open a set of doors. One day, the ghoul departs and the youth enters the first forbidden room; inside, a pool of silver he dips his finger in, and opens a second room where there is a pool of gold. The boy leans into the pool of gold and his hairs turn gold. When the ghoul returns, the boy tells him of his disobedience, and is forced to leave. Before he goes, he slaughters a sheep and makes a cap out of its stomach, then rides to another kingdom. The filly gives some of its hairs to the youth, and vanishes. The youth finds work as the king's gardener, and is called \"Baldhead-in-the-Garden\" due to his shabby appearance. He eventually marries the king's youngest daughter. Some time later, the king is fighting the war, and his life is at stake. The princess begs her husband Baldhead-in-the-Garden to save him, and he summons the filly to ride into battle. He defeats the enemy army and rescues the king, but is injured in the arm. The king, his father-in-law, bandages his wound with a sash as thanks, and he departs back to his shabby hut. The king enters Baldhead-in-the-Garden's hut to scold his son-in-law for his cowardice, but the princess confronts her father and Baldhead-in-the-Garden shows him the sash and his brothers-in-law's wedding rings, thus confirming his story. The king then recognizes Baldhead-in-the-Garden's worth and asks to be forgiven for his mistreatment.\nQuray‘\nIn a tale collected from a teller in Hsarat with the Lebanese title Quray‘ (\"The Bald One\"), a widowed king remarries and his new wife brings her two sons with her. The king's own son goes to school with his step-brothers, and excels at it, unlike his lazy step-brothers. The prince's stepmother wants to get rid of her stepson, and consults with an old woman neighbour ways to kill him: first, she digs up a hole in the front porch and covers it with a carpet; next, she gives him a dish of poisoned food. However, the prince is warned of the dangers by his pet horse: to escape from the hole, he lets one of his step-brothers fall into the trap as part of their play; to avoid the poisoned dish, he exchanges his own plate for his step-brother's. Failing on both occasions and losing her two sons, she plans to kill the prince's horse. After returning from school, the prince goes to talk to his horse, and the animal tells him his stepmother is feigning illness and asked for the blood of a horse with white marks on its legs. Advised by the horse, the prince then asks his father to indulge on a simple request: to be able to ride the animal one last time. The prince seizes the opportunity and gallops away to another kingdom, where he finds work as the royal gardener's assistant, under the moniker of Quray'. One day, while the monarch is away from the palace, Quray' burns one of the hairs from his horse's tail and summons it for a ride around the garden - an event witnessed by the princess. He uproots the trees to plant new ones, and dismisses his horse. The royal gardener appears at the garden to punish Quray', but the princess vouches for the latter. Some time later, the princess tells the king she wants to marry, and the king summons all of the tribe's eligible bachelors so that the princess will choose her suitor by throwing an apple at them. The princess, not seeing Quray', withholds the golden apple, until the youth is brought to the assembled crowd. The princess chooses Quray' and moves out with him to a shabby house. Later, the king falls ill, and only gazelle meat can cure him. Quray' is given a lame mount to quest for the king's remedy, but summons his loyal horse and hunts some carcasses. He is met en route to the palace by the king's soldiers, and agrees to sell them the carcasses, in exchange for them being branded on their flanks. Later, war breaks out, and Quray' rides into battle to combat the enemy army three times. On the third time, he is injured on his finger, which the king bandages, then he returns to his shabby hut, still in his princely garments. Some servants go to the hut to bring food for the princess, and report back to the king she is with another man, not the lowly Quray'. The king himself goes to investigate the matter at his daughter's house. Quray' shows the king the bandaged finger, and the king discovers the lowly husband was their saviour. Quray' takes his wife to the castle and they live in happiness. Meanwhile, the king sends for the cheating pair of sons-in-law, and the narration ends.\nQoreï\nIn a Lebanese tale titled Qorei, collected by Nathalie Zoghaib from a source named Elias Yasbek, in Hsarat, a king and a queen have a son. Eventually, the queen dies, the king remarries and she gives birth to two sons, the prince's half-brothers. The three boys attend school, but the elder half-brother excels instead of the new queen's sons, who are lazy. The queen decides to get rid of her stepson by consulting with an old woman neighbour. The old woman advises her to dig up a hole and cover it with a mat. The elder prince goes to meet with his horse, which cries and warns him that the queen is trying to kill him, and teaches him how to avoid the danger. The prince approaches the trap and, on seeing his half-brothers, decides to play a game with them: the prince leaps more graciously over the covered pit, while one of his half-brothers falls into the hole, injures himself badly and dies. Next, the old neighbour advises the queen to poison the prince's dish. The prince's talking horse warns him of the second attempt, and, during dinner, the youh distracts his other half-brother and exchanges the poisoned dish, so that the queen's other son eats it and dies. Failing her plans and losing her two sons, the queen confides with the old neighbour that the prince goes to meet the horse after school, so the old woman advises the queen to set her sights on the animal. The prince goes to talk with the horse, which explains that the queen is trying to kill it by feigning an illness and asking for the blood of a horse with white spots on its legs. The prince confronts his father about it, saying he will kill himself if his horse's blood will not suffice, and asks for a last ride on the horse before it is sacrificed. The king indulges his son, the prince saddles the horse and gallops away.\nThe prince and the horse arrive at the garden of the neighbouring kingdom, and the horse rides away. The prince enters the garden and introduces himself as Qoreï, then asks the gardener for a job. The prince, as Qoreï, works in the garden. One day, the royal gardener leaves the youth to guard the garden, and, while he is away, the prince takes out a hair from his horse's mane from a bag, burns it to summon the equine and both ride around the garden, trampling everything. The prince dismisses the horse and feigns innocence with the gardener comes back and finds the garden destroyed. The gardener goes to beat Qoreï, when the princess vouches for him, since she has witnessed the whole event from her window. At a second occasion, the prince summons the horse again and rides around the garden with a sword, cutting down the trees. The gardener becomes even furious and tries to punish the youth, but the princess vouches again for him. Enchanted by the new gardener's assistant's courage, the princess decides she wants to be married, and asks her father to assemble eligible suitors to pass by the palace so that she can toss an apple at her suitor of choice. Thus, suitors gather to wait by the palace, and the princess does not throw her apple, since Qoreï is absent. The king sends for Qoreï, and the princess throws him her apple. The crowd complains that she must have made a mistake, and she retakes her toss, hitting him everytime. Thus, the princess chooses the lowly gardener, and the king moves her out to his humble hut.\nSome time later after the wedding, the king falls ill, and the royal doctors prescribe gazelle meat. The princess admits to Qoreï she saw him from her window and asks him to find a remedy for her father. Qoreï takes on a lame donkey, but, out of sight, summons his loyal horse and rides into the wilderness to hunt some gazelles. On the road back, he finds a pair of the king's officials en route who ask him for some of the gazelle. Qoreï, who they do no recognize, agrees to a deal: the meat in exchange for branding the officials' thighs with his seal. The officials return with the gazelle, which is prepared and cooked for the king, who is healed. As for Qoreï, he notices some flies buzzing around his donkey, makes a necklace of bugs and gives the rest of the gazelle meat to his wife so she can prepare it for the king. Later, the city is being attacked by an enemy army, and the princess asks Qoreï to protect her home, since she saw from her window his abilities. Thus, Qoreï jumps on the lame donkey and bids it to attack with some verses, to the mockery of his father-in-law's army. When they are out of sight, Qoreï summons his horse by burning a hair from its mane and rides into the battlefield to turn the tide of battle, since the king's army is retreating. Qoreï, as the mysterious knight, fends off the enemy army back to its borders and kills some assailants, then returns to the lowly disguise. The soldiers from the king's army gloat about their false victories to the king, when an old soldier reveals a mysterious knight appeared in the battlefield. Curious, the king decides to join the fray to see him for himself the following day. During the second battle, Qoreï summons his loyal horse and battle the enemy army, who retreats. He hurts his own finger, then passes by the king, who sees the knight's injury and dresses it with a piece of a kerchief. Qoreï returns to his humble hut to celebrate with the princess.\nThe king returns to the palace and sends some envoys to bring his daughter and her husband to the palace to celebrate with the others. The envoys go to Qoreï's hut and finds a horse and the princess in the arms of a stranger, then report to the king. The monarch goes to the hut to confront his daughter, and Qoreï shows him the dressed wound. The king realizes the lowly gardener, Qoreï, is indeed their saviour, and takes him and the princess back to the palace with him. The king's two officials are jealous of the king's attention on Qoreï and accuse the latter of avoiding the duty of retrieving the cure for the king. In response, Qoreï admits he was the one who brought the gazelle meat, which the officers deny. Qoreï, then, recalls the officials' meeting with the knight and the brand on their thighs. Both men deny everything, but the king orders them to disrobe, showing the seals on their bodies. The king sends the officials to prison, while Qoreï reigns with his wife.\nMiddle East\nIn a Middle Eastern tale titled Prince Baldpate, King Miran and Queen Zaina are the rulers of the kingdom of Jerash, both of good and benevolent character. They have a son together, Prince Sinan. However, not everyone in their court is fond of the royal family, specially a noblewoman named Nordina and her brother Nimroud: Nordina is secretly a sorceress, and plots her great revenge against the royal family. Prince Sinan tries to alert his mother of the danger, but, good person that she is, she dismisses her son's words as mere gossip. One day, Sinan goes to the woods to help a dying mare and rescue its colt; while he is away, the queen mother believes he was missing, which deteriorates her health, and Nordina is pointed as her personal helper. The prince returns with the colt to the palace, and assuages his mother's fears. He takes the colt and raises it, naming it Fairy. Fairy grows into a fine white stallion and becomes Sinan's friend. Later, Queen Zaina falls ill and dies. For her actions during Zaina's illness, Nordina is rewarded with a position of custodian of the royal palace, eventually marrying the widowed king Miran and bringing Nimroud as the chief of the guard - a situation that greatly displeases Sinan. Things come to a head when Miran approaches his son one day and tells that the royal doctors prescribed the heart of a white stallion as remedy for Nordina's bad health. Fearful for Fairy's fate, Sinan takes the stallion with him and both escape to another kingdom. Once there, Sinan trades his princely garments for a shepherd's and buys a sheep's hide from a tannery to wear on his head as a cap. He dismisses his horse and finds work as a gardener for the king. One day, he takes off the leather hide and takes a bath in a pond - an event that is seen by princess Rawan, who becomes infatuated with him and sends his baskets of fine food. Eventually, princess Rawan marries the gardener, whom they began to call \"Baldpate\". Some time later, Nimroud's forces march outside Sinan's father-in-law's kingdom, and Rawan's father orders the court to take refuge in the mountains. Rawan joins her father, while Sinan calls out for his horse Fairy, dons a mask and goes to battle the enemy army to save the kingdom.\nPalestine\nIn a Palestinian tale from Birzeit, collected by orientalist Paul E. Kahle with the title Kahlköpfchen und das Wunderpferd (\"Little Baldhead and the Magic Horse\"), a sultan has two wives, a son by the first and two by the second. The first wife's son likes horses, and grooms a foal from the djinni. The magic horse warns the boy about any attempts against his life from his stepmother. One day, the stepmother feigns being ill and her doctor prescribes that the only cure is the flesh of a green horse - exactly the boy's horse's. The boy rides the horse away from his homeland. At a distance, the horse gives the boy seven tufts of its mane, and tells him to burn the hairs should ne nieed his help, and departs. The boy disguises himself with a she-goat's stomach on his head and answers by the name Kahlköpf (\"Baldhead\"), or, in the original, Qre’un (\"Little Baldy\"). He works as a menial position for another king. The king's youngest daughter, while taking a bath, sees Baldhead and proclaims she wants him. She joins her sisters in asking their father to set a suitor selection. The first marries the son of a pascha; the second the son of a gouverneur, the third the son of a vizier, and the youngest Baldhead. One day, the king falls ill and the royal doctor says on the flesh of a gazelle may cure him. Baldhead summons the magic horse and asks for a gazelle. Later, war breaks out in the kingdom, and Baldhead rides after his brothers-in-law with a lame horse. Before he joins the fight, he summons his horse friend and defeats the enemies, hurting his hand in the process. Author Inea Bushnaq translated the tale and published it as Seven Magic Hairs, wherein the hero is named Qureyoon (\"Baldhead\").\nIn a Palestinian tale collected by C. G. Campbell with the title The Story of the Horse and of the Son of a King, the wife of a king gives birth to a son, and at the same time a mare foals. Believing it to be a double blessing, the king has the prince and the foal become friends, the young boy even riding the little animal before he can crawl. In time, however, the queen dies when the boy is ten years old, and the king remarries. The second queen gives birth to her own son, and, four years later, conspires with a witch ways to kill the elder prince and make her son the only heir: first, the witch advises her to fill a pit with swords and cover it with a carpet. The prince, named Hamed, is dared to jump over the hurdle, but is dissuaded by his horse, Nejm, for it is a trap. The horse uses its hind feet to uncover the pit to reveal the trap, and the queen feigns surprise, promising to bake her stepson a cake. The cake is decorated with depictions of the land and the sea, which the queen insists her stepson eats from. Hamed brings a piece to Nejm, but it refuses, advising Hamed to partake of the land portion of the cake. The prince does, while his younger half-brother eats the sea portion and dies. Hamed complains to his father, the king, about some poison in the cake, but the monarch dismisses it as fatality. Back to the queen, enraged at the loss of her own child, she is advised to kill Nejm, the stallion: she feigns illness and says her only cure is the flesh of a fourteen-year-old stallion. The king tells Hamed they will kill the horse, and the youth, in tears, takes his friend to a stream to bathe it. Nejm is also weeping for them, but it has a plan: plant a bloodied knife and leave a saddle and the prince's clothes near the stream, so people will think they killed themselves, and the horse will take Hamed to his destined bride in another kingdom. It happens thus, and both ride away from the kingdom. They reach a beautiful ivory palace that Nejm says is under the power of a menacing Afrit he cannot hope to defeat, and a princess is captive inside. Despite the horse's warnings, Hamed enters the palace and meets a skeleton which says it can help Hamed if the prince promises to give him a proper burial. Hamed agrees to the skeleton's terms, and both enter the princess's room. After some introductions, the trio formulate a plan to destroy the Afrit: by finding a locket that holds its life. Hamed ventures in the mountains with the skeleton and brings the locket with him, as the Afrit returns home and the princess convinces the creature to rest his sword as he sleeps. While the monster is asleep, the three draw out his sword and destroy the locket, killing the Afrit. With the same sword, the skeleton exorcizes the last remains of the Afrit from the princess's mouth. Hamed and the princess bury the skeleton, and ride Nejm to Hamed's homeland. After Hamed returns, his father tells him he discovered his wife's ruse and killed her, and Hamed is crowned prince after him.\nOman\nOrientalist David Heinrich Müller collected a tale in the Jibbali language with the title Begelut: a boy loses his mother and goes to cry over her grave. The genii take pity on him and send a mare to be his companion. The boy takes the mare home and places it in the stables. Meanwhile, a neighbouring woman dotes on the boy and asks him to marry his father, but the man argues against it. Despite this, they marry, but the woman begins to hate her step-son, and tries to poison him. However, the mare warns the boy against the attempt. Next, the woman pretends to be ill and asks for the mare's liver as cure. The mare tells the boy in tears and advises the boy to ask for a last ride, then they can flee to another kingdom. It happens so: they ride to another kingdom, he kills a hyena and, scalping its hide, makes a cap for him. He finds work as a cattle herd for a king. One day, the king's seven daughters plan to marry, so they toss lemons to their potential suitors. The youngest throws her lemon and it lands near Begelut; she throws it twice more, and it lands near him again. The king marries his daughter to the cattle herd and expels her to the boy's quarters. Later, the king becomes blind, and only gazelle's milk can cure him. Begelut rides the mare and finds the gazelle's milk, then meets with his brothers-in-law, and agrees to give them milk, in exchange for him branding their backs. Müller's text breaks at this part.\nResearcher and professor Asyah Al-Bually published an Omani tale titled Tale of Fadil or Ramadu. According to her, Fadil is an Arabic name that means 'praiseworthy', and ramadu means 'grey'. In this tale, a merchant's son is named Fadil, and he has a special talking horse named Insiyah. Fadil's father remarries, and the step-mother hates Fadil so much she torments him whenever her husband is not at home, and decides to kill him. First, she tries to poison his food; next, she tries to give him clothes laced with poison. On both occasions, Insiyah warns the boy. The step-mother and her brother then discover Fadil is being helped by the horse, and plot a new course of action: the woman feigns illness, and asks for horse's liver as a cure. Fadil and Insayah trace a plan of their own: the horse will neigh three times to alert the boy when he is at school, and Fadil is to ask his father to ride the horse one last time. Their plan works: Fadil and Insayah flee from home. Despite returning two other times due to him missing his father, after the third time, they leave for good and make their way to a rich emirate. Fadil smears his face with ashes and calls himself Ramadu, and finds work as a lowly servant. Later, the boy saves the emir and the kingdom during a war, and gets to marry the princess.\nSocotra\nIn a Soqotri tale translated by David Heinrich Müller with the title Geschichte zweier Brüder (\"The Tale of the Two Brothers\"), a man has an Arab woman and an Abyssinian female slave. One night, both women get pregnant and nine months later each gives birth to a son, but the Abyssian slave dies, leaving her son to be raised by the Arab wife. When they are old enough, their father sets a test for them: the Arab wife is to send each of the boys to their father's house in search of breakfast, and they are to put their hands in the oven, where there is a lion inside; whoever proves himself to be braver shall be rewarded. The Arab woman's son does that and the lion bites off his hand; the Abyssinian woman's son strangles the lion, to his father's pride. The man gifts him a \"human mare\" (which Müller explains it means it can talk like a person). The Arab woman asks an old woman to buy poison for her, which she uses on the Abyssinian boy's food. The boy asks his stepmother where his food is; she says it is the \"castle\". The Abyssinian boy enters the castle, grabs the food and gives to a cat to eat. It dies. Then, he goes to the stables to talk to his mare, and the animal warns him of the poison. Next, they try to place poisoned needles in the stairs, but he also escapes. Failing on both occasions, the Arab woman feigns illness and asks for the mare's heart. The Abyssinian boy learns of this and asks his father for money, a sword and a last ride on the animal. The next day, he rides the mare away from home, and meets his Arab half-brother. The Arab boy learns of his mother's treachery, but is dissuaded of seeking revenge. Then, the Abyssinian boy plants a myrtle on the road, as a token of life, and asks his half-brother to come to his aid should the myrtle wither. The tale then continues with further adventures of the Abyssinian boy (called \"son of the Abyssinian woman\"), wherein he marries a maiden named \"Unglücksmädchen\" (\"Unfortunate Girl\"), rescues a princess named Daughter of the Sunrise, fights a Sultan and his army, is killed by drinking coffee, and is eventually rescued by his half-brother.\nTurkey\nA similar introductory episode is attested in the Typen türkischer Volksmärchen (\"Turkish Folktale Catalogue\"), devised by scholars Wolfram Eberhard and Pertev Naili Boratav. According to their system, abbreviated as TTV, EbBo or EB, in type TTV 247, Schah Ismail (Turkish: Şah İsmail), a dervish gives an apple to a padishah; his wife gives birth to a son and his mare to a foal; some time later, the padishah's new wife has an affair with a vizier and conspires to kill her step-son, but the horse warns him; lastly, the stepmother feigns illness and asks for the horse's meat as a cure, which prompts their flight. Eberhard and Boratav also argued for the antiquity of the story, and that its \"core elements\" (birth of hero and foal; stepmother's adultery and threats; horse's warnings) already exist in the tale of Bey Börek.\nEberhard and Boratav also indexed the episodes of obtaining lion's milk for the king and the war sequence as different tale types in the Turkish Folktale Catalogue, but they remarked they do not exist independently and that both are \"closely related\" to each other. In the first, indexed as TTV 257, Die Löwenmilch (\"Lion's Milk\"), the king falls ill and his sons-in-law have to find him the cure (milk from a lioness, but it may be from another animal); the hero finds it first and agrees to give it to his brothers-in-law in exchange for him branding their posteriors. In the second, titled TTV 258, Der unbekannte Krieger (\"The Unknown Warrior\"), war breaks out, and the hero rides into battle to turn the tide; he is injured, and his father-in-law dresses his wound.\nGerman scholar  located another narrative from the Ottoman Turkish work Ferec baʿd eş-şidde ('Relief After Hardship'), an anonymous book dated to the 15th century. In tale nr. 32 of the compilation, titled The Baldheaded Gardener and the daughter of the King of Yemen, the son of the king of Pārs falls in love with the princess of Yemen, Fakhr al-Nisāʾ, and goes to her kingdom to meet her. The princess goes to her garden, and, since everyone is forbidden to look at her during her sojourn, the prince does and is arrested. Later, he is released by the Yemeni king and disguises himself as a lowly man with a sheep's rumen on his head, so as to appear bald, then hires himself as the king's gardener's assistant, so he can be close to the princess. During his daily work, he sings and plays instruments, which attracts the princess's attention and inspires love in her heart. A spurned suitor, the King of Morocco, takes his troops to invade the realm; the prince joins in the fight and defeats the enemy army, then marries the princess of Yemen.\nSee also\n* ''The Magician's Horse\n* Little Johnny Sheep-Dung\n* The Gifts of the Magician\n* Făt-Frumos with the Golden Hair\n* Donotknow\n* The Black Colt\n* The Story of the Prince and His Horse''\nFootnotes\nReferences"
    }
  ]
}