{
  "content": [
    {
      "type": "text",
      "text": "# The Church at BattleCreek\n\nBattleCreek Church is the name and main campus of a moderately growing, Southern Baptist, multi-campus church located in Tulsa. [https://churches.sbc.net/church/battlecreek-church-broken-arrow/ SBC]\nLocation\nLocated in Broken Arrow, Tulsa County, Oklahoma,\nHistory\nGracemont Baptist Church purchased an outlet Mall in 1991 [https://www.oklahoman.com/story/news/1992/07/31/broken-arrow-church-converts-mall/62486408007/ Oklahoman] In 2002, approximately 100 remaining members  of Gracemont Baptist Church in Broken Arrow, Oklahoma, a suburb of Tulsa, asked Alex Himaya to accept a position as Senior Pastor and to help revitalize the church.\nHimaya, a gifted leader, motivator, and organizer, agreed to become pastor of the small, dying, debt-ridden church in 2002 and eighteen years later, BattleCreek has been instrumental in seeing that church grow into a mega-church with six campuses across the Tulsa area . Soon after, the congregation incorporated as The Church at BattleCreek, and held its initial public service on August 14, 2003.   As of the church's third anniversary in August 2006, it was reporting weekly attendance at two Sunday morning services of over 1600 people, including over 700 children and teenagers.  The church had also retired its mortgage debt and the staff of the church had expanded to include five full-time pastors, and several other full and part-time employees.\nAdditionally, The Church at BattleCreek was operating a daily preschool and providing meeting space and financial support to Christian congregations for Arabic and Spanish speaking people in the Tulsa Metropolitan Area.\nIn 2007, the church began construction of a 1,200-seat auditorium with state-of-the-art audio-visual capabilities.\nIn 2014, Immanuel Baptist Church, located at the eastern edge of downtown Tulsa, joined the Church at Battle Creek as a satellite congregation.\nWith the addition, the church had four sites, three in the Tulsa area and one in Wheaton, Illinois.\nBattleCreek Church is notable for its moderate growth, partly due to Pastor Himaya's vision of expansion and, along with the leadership of [http://%5Bhttps://generis.com/team/julie-bullock Julie Bullock] \"All In\" campaign through [https://generis.com/ Generis], to which she is employed and also serves on the Board of BattleCreek Church. Generis' motto is “Accelerating Generosity Towards God-Inspired Vision.”\nHimaya, after graduating from Ouachita Baptist University in 1993 [https://scholarlycommons.obu.edu/cgi/viewcontent.cgi?article=1042&context=alumni_mag OBU], headed south to Dallas, TX and obtained a M.Div. (Masters of Divinity) from Southwestern Baptist Theological Seminary .\nFrom 1996-2002 Himaya was associated with [https://www.ronniefloyd.com/ Ronnie Floyd] as the youth pastor at Ronnie Floyd’s mega-church, [https://www.crosschurch.com/ Cross Church], located in Northwest Arkansas.\nAlso, in association with BattleCreek Church, is Chris Campbell, a former associate pastor at BattleCreek church and is currently leader of the 111 Project [https://www.111project.org/ 111project], which BattleCreek church supports, along with CarePortal. [https://oklahoma.gov/okdhs/newsroom/2021/july/comm07152021.html OKDHS]. CarePortal is a collaboration between 111Project, the Global Orphan Project [https://goproject.org/ GOP], and OKDHS. It uses a communication system to share information. The 111Project manages CarePortal, which aims to engage churches as a significant part of the solution to see that every child has a family.\nAffiliation\nThe Church at BattleCreek is part of the Southern Baptist Convention. However, in general, The Church at BattleCreek employs more of a non-denominational approach and does not necessarily emphasize its Baptist affiliation.\nReferences\nExternal links\n*[http://www.thechurch.at Official website]\n* https://churches.sbc.net/?_search=36.2726958%2C-95.8353837%2C5%2COwasso%252C%2520OK%252074055%252C%2520USA\n* https://books.google.com/books?id=5iA6JWFksn4C&dq=southern+baptist+convention+the+church+at+battle+creek+tulsa&pg=PA271\n* https://generis.com/about/\n* https://generis.com/team/julie-bullock/\n* https://www.oklahoman.com/story/news/1992/07/31/broken-arrow-church-converts-mall/62486408007/."
    }
  ]
}