{
  "content": [
    {
      "type": "text",
      "text": "# The Story of the Queen of the Flowery Isles\n\nThe Story of the Queen of the Flowery Isles is a French fairy tale from Cabinet des Fées.  Andrew Lang included it in The Grey Fairy Book.\nSynopsis\nA widowed queen of the Flowery Isles had two daughters. The older of them was so beautiful that her mother feared that the Queen of all the Isles would be jealous of her; this queen required all princesses, at the age of fifteen, to appear before her and give homage to her beauty as transcendent. When the older princess arrived, the talk of the court was such that the queen of all the islands feigned illness in order to avoid meeting her and sent her home.\nThe mother obeyed and warned her daughter to stay inside for six months, to avoid the queen's magical powers. The daughter promised to obey, but as the time was drawing near, they prepared a feast to celebrate. The daughter asked permission to go to the nearby meadow, and got it, but as she was going towards the meadow, the earth opened up under her feet and swallowed her.\nThe princess found herself in an unknown land and met a pretty little dog that led her to a lovely garden. It had water and fruit trees that would enable her to live. At nighttime, the dog pulled her to a cave with a bed. She lived there for half a year, until one evening, her dog seemed ill, and in the morning she went to look for him, and saw nothing but an old man hurrying away. Suddenly, a cloud wrapped around and carried her away, and when it cleared, she found herself back in her home kingdom, where she found that her mother had died due to depression. Her younger sister tried to insist that she was queen, but she would only consent to share the crown.\nShe made a careful search for the dog throughout the land and offered to marry whoever brought it to her. An old man claimed he knew where the dog was, but the princess said she could not marry without the consent of the land, and the council refused it. The queen obeyed, but declared she would abdicate and travel the land until she found the dog.\nThe next day, a great fleet arrived, and the Prince of the Emerald Isles appeared, telling her that he had been the dog, and then the old man, but now a benevolent fairy had freed him. The queen married him.\nAuthorship\nThe original tale, titled ''La Reine de l'isle des fleurs (\"The Queen of the Island of Flowers\") was published without attribution of authorship in a volume of Le Cabinet des Fées'', a French compilation of literary fairy tales, first published in the 18th century. The tale is often attributed to Madame d'Aulnoy. However, scholarly research points the authorship to Le Chevalier de Mailly, who published anonymously the book Les Illustres Fées.\nReferences\nExternal links\n*[http://www.mythfolklore.net/andrewlang/208.htm The Story of the Queen of the Flowery Isles]"
    }
  ]
}