{
  "content": [
    {
      "type": "text",
      "text": "# The IVth Crusade\n\n| recorded     = Sawmills Studio, August 1992\n| venue        =\n| studio       =\n| genre        =\n| length       = 53:28\n| label        = Relativity, Earache\n| producer     = Colin Richardson and Bolt Thrower\n| prev_title   = War Master\n| prev_year    = 1991\n| next_title   = Spearhead\n| next_year    = 1992\n}}\n| rev2 = ''Collector's Guide to Heavy Metal\n| rev2score = 4/10\n| rev3 = The Encyclopedia of Popular Music\n| rev3score =\n| rev4 = The Great Metal Discography\n| rev4Score = 7/10\n| rev5 = Kerrang!\n| rev5score =\n| rev6 = Metal Storm\n| rev6score = 9.3/10\n| rev7 = Rock Hard\n| rev7score = 9/10\n| rev8 = Select\n| rev8score =\n| noprose = yes\n}}\nThe IVth Crusade is the fourth studio album by British death metal band Bolt Thrower.\nBackground and recording\nIt was recorded at Sawmill Studios in August 1992 and produced by Bolt Thrower and Colin Richardson. The album was engineered by John Cornfield and  mixed at Fon studios. It was also engineered by Alan Fisch and Steve Harris. It was released through Earache Records as Mosh 70 in 1992. The album title comes from the Fourth Crusade and the capturing of Constantinople.\nMusic\nFor this album Bolt Thrower slowed down considerably compared to War Master, focusing more on playing heavy riffs and a thick sound. Joe DiVita of Loudwire'' said: \"You know Bolt Thrower when you hear them, but this album offered something a bit different, slowing things down. [...] The grooves swung lower, songs had a stronger sense of pace and dynamics — it's Bolt Thrower at their most intelligent.\" The album features a more death/doom metal-driven style, and which was influenced by doom metal bands including Candlemass and Pentagram. DiVita also wrote: \"The longest album of Bolt Thrower’s career pushed their songwriting limitations which were in delightfully narrow parameters, operating on formula over innovation. The English vets entertained slower riffs, scraping their knuckles on the pavement as grooves swung lower for longer.\"\n\"Embers\" opens and ends as \"Cenotaph\" did on the previous album War Master, and leads into \"Powder Burns\" on Mercenary.\nArtwork\nThe cover artwork is a painting from Eugène Delacroix, showing \"The Entry of the Crusaders in Constantinople\".\nCritical reception and legacy\nStephen Thomas Erlewine of AllMusic wrote gave the album three stars out of five, saying: \"The IVth Crusade ranks as one of Bolt Thrower's more powerful and consistent albums, raging with venom and unrestrained fury. It's a record that proves why the group was one of the leaders of the underground metal scene of the late '80s and early '90s. Few other groups matched Bolt Thrower in terms of pummeling, harsh sonic brutality, even if they occasionally lacked the skills to craft full-fledged songs and riffs.\"\nIn 2025, Joe DiVita of Loudwire named the album as the best death metal release of 1992, saying: \"In what was possibly the most dense year for death metal, tough decisions have to be made and Bolt Thrower’s war-torn The IVth Crusade takes the crown.\"\nTrack listing\nAll songs written by Bolt Thrower.\nPersonnel\n;Bolt Thrower\n* Karl Willetts – vocals\n* Gavin Ward – guitars\n* Barry Thomson – guitars\n* Jo Bench – bass\n* Andrew Whale – drums\n;Production\n* Eugène Delacroix – cover art\n* Paul McHale – design\n* John Cornfield – engineering\n* Alan Fisch – mixing\n* Steve Harris – mixing\n* Colin Richardson – producer, recording\nReferences"
    }
  ]
}