{
  "content": [
    {
      "type": "text",
      "text": "# The Erl-King (novel)\n\nThe Erl-King () is a 1970 novel by the French writer Michel Tournier. It was published in 1972 in an English translation by Barbara Bray as both The Erl-King and The Ogre. The novel received the Prix Goncourt. The 1996 film The Ogre, directed by Volker Schlöndorff, is based on the novel.\nCurrently it is published in the United Kingdom by Atlantic Books.\nSummary\nThe story is about Abel Tiffauges, who attends the Saint-Christophe boarding-school where he meets Nestor, a privileged student who will take him under his wing and adore him so much as to let him indulge his obsessions.\nAbel first writes about his childhood and his life in life before 1939 in his personal diary.\nAfter World War I, Abel finds himself being a dedicated pigeon keeper and a soldier in Alsace.\nThen, he is taken prisoner and deported throughout Germany and Poland in East Prussia (German region that corresponds to the current Kaliningrad Oblast/Königsberg in Western Russia).\nHe will later be imprisoned in the Moorhof camp (close to Insterburg – today Chernyakhovsk – and to Gumbinnen – today Gusev), and will then make it to the reservation of Rominten (in the South-Eastern part of East Prussia), in the hunting ground of Göring he calls \"the ogre of Rominten\". He then finds himself having to recruit children in the Mazurian region. He saves Ephraïm, a Jewish boy who came from a Lithuanian camp and escapes while carrying him on his back through swamps. The novel ends with the following sentence:\nSee also\n* 1970 in literature\n* 20th-century French literature\nReferences\nExternal links\n* [https://archive.org/details/erlking0000tour_v9i7 The Erl-King] (1974 edition) - Internet Archive\n* [https://archive.org/details/erlking0000tour_v0n5 The Erl-King] (2013 edition) - Internet Archive - [https://archive.org/details/erlking0000tour Alternate link]\n* [https://atlantic-books.co.uk/book/the-erl-king/ The Erl-King] - Atlantic Books\n* [https://archive.org/details/leroidesaulnes00tour Le roi des Aulnes] - Internet Archive\n* [https://www.gallimard.fr/Catalogue/GALLIMARD/Soleil/Le-Roi-des-Aulnes Le Roi des Aulnes] - Éditions Gallimard"
    }
  ]
}