{
  "content": [
    {
      "type": "text",
      "text": "# The Queen Elizabeth Hospital, Adelaide\n\nQueen Elizabeth Hospital}}\n| location = Adelaide\n| region =\n| state = South Australia\n| country = Australia\n| healthcare = Public\n| funding = Public\n| type = Teaching, District General\n| religious_affiliation =\n| affiliation = University of Adelaide\n| patron =\n| network =\n| standards =\n| emergency = Yes\n| beds = 355\n| speciality =\n| helipad =\n| h1-number =\n| h1-length-f =\n| h1-length-m =\n| h1-surface =\n| publictransit =\n| former-names =\n| constructed =\n| opened = 1954\n| closed =\n| demolished =\n| website =\n| other_links =\n| module =\n}}\nThe Queen Elizabeth Hospital (TQEH) is an acute care district general hospital in the western suburbs of Adelaide, South Australia. It is a teaching hospital of University of Adelaide, providing a range of health services, including inpatient, outpatient, surgical, emergency treatment, and mental health services.\nHistory\nThe hospital opened in 1954 originally as a maternity hospital and further expanded its services after establishment. At the request of the Government of South Australia, the hospital was named after Queen Elizabeth II, who had recently acceded to the Australian throne. A large portrait of the Queen, together with a letter authorising TQEH name and granting Arms to the hospital, decorates the principal foyer.\nOriginally designed to service the western suburbs of Adelaide, TQEH is now the second-most utilised hospital in South Australia by patients from the central northern region of Adelaide.\nTQEH was the first unit in Australia to perform kidney transplantation successfully, on 21 February 1964. The hospital houses the Australian and New Zealand Dialysis and Transplant Registry (ANZDATA), which collects national statistics on the treatment of those patients with end-stage kidney failure.\nIn 2002, Premier Mike Rann, who had campaigned in Opposition against plans to privatise the hospital, announced a massive ten-year redevelopment of TQEH. In 2005, Premier Rann and Health Minister Lea Stevens unveiled plans for TQEH's second-stage redevelopment. It included construction of a new three-level inpatient building for maternity, surgical, oncology and renal dialysis patients (containing 272 surgical and medical beds), and a 580-place car park building. In 2009 Premier Rann opened the new Queen Elizabeth Hospital Research Building, incorporating the Basil Hetzel Institute for Medical Research. The older Basil Hetzel building which was in use for many decades, was demolished. The nurses accommodation wing were also demolished.\nRedevelopment\nOn 18 June 2017, the Weatherill State Government announced plans to build the third stage redevelopment of the hospital, worth over $270 million. The proposed redevelopment included plans to build a new emergency department, more car parking, new outpatient clinics, a new day surgery and operating theatre suite, a new medical imaging suite and a new brain and spinal injury rehabilitation centre, including a hydrotherapy pool, to accommodate patients from Hampstead Rehabilitation Centre. Construction of this building has already started. Construction of a new car park was also completed recently and this required the demolition of the Diabetes centre and a part of the older car park.\nTeaching\nTQEH is a teaching hospital for the University of Adelaide's medical school and provides clinical attachments in a variety of specialties for undergraduate medical students, including emergency medicine, medicine, surgery, and psychiatry.\nThe Discipline of Medicine has broad-ranging functions in undergraduate and postgraduate teaching, research and clinical service and management. The Discipline of Surgery has a large academic surgical department and is a major centre for surgical research and postgraduate teaching in a wide range of fields.\nMental health services\nTQEH provides mental health services through community response teams, the QEH's Emergency Department, and a 40-bed purpose-built inpatient unit. The inpatient unit, the Cramond Clinic, was named after Professor William Cramond, the foundation chair in Psychiatry at the University of Adelaide. Cramond pioneered the delivery of mental health care to renal patients at TQEH in the 1960s. In 2002–2003, TQEH community mental health teams provided services to 48,621 individuals which was the second largest number for services in the central northern health region.\nA new Short Stay Mental Health Unit with 8 beds, was completed in late 2017.\nGallery\nSee also\n*The Hospital Research Foundation\nReferences"
    }
  ]
}