{
  "content": [
    {
      "type": "text",
      "text": "# The Unwilling Warlord\n\nThe Unwilling Warlord is a fantasy novel by American writer Lawrence Watt-Evans published by Ballantine in 1989. It details the story of hereditary warlord Sterren of Semma taking over, unwillingly, the position of warlord for one of Ethshar's Small Kingdoms.\nPlot introduction\nThe Kingdom of Semma is on the verge of war but the VIII Hereditary Warlord has died. The King sent out a search party to the Hegemony of Ethshar where with the aid of magic they track down the heir to the title, the Unwilling IX Warlord Sterren.\nThe story evolves as Sterren, along with assorted others hired to help in the war, is hauled off from his career as a low stakes gambler to Semma. One of his companions is Vond, a master Warlock who is feeling the Calling and who is seeking to get as far away from Aldagmor as he can because once a Warlock gives in to the Calling they are drawn to Aldagmor and are never seen again. Vond takes a liking to Sterren who was actually apprenticed as a Warlock for three days before being dismissed as unable to perform. Of course it is against the Guild law for any magician to practice in more than one field so Sterren was disqualified to take up any of the other studies. Not long after arriving in Semma, Vond discovers a second source of power for Warlockry and quickly becomes the most powerful magician in the Small Kingdoms.\nCharacters\n* Sterren - gambler in taverns and low dives who is hereditary Ninth Warlord of Semma and whom circumstances will elevate ever further up, much against his wish and inclination.\n* Vond - warlock who needs no armies to make himself conqueror and Emperor, founding the empire that will bear his name long after his departure.\n* Lady Kalira - the most competent member of the aristocracy of Semma, later a senior Imperial administrator and a very cunning politician.\n* King Phenevel of Semma, whose blunt behaviour creates much trouble for his kingdom and finally causes him to lose his throne.\n* Princess Shirrin - King Phenevel's teenage daughter, who blushes deeply whenever she meets Sterren.\n* Annara - a young and inexperienced wizard discovering in herself an unexpected talent for guerrilla warfare.\n* Agor - a theurgist whose magic depends on calling upon the gods, but very few gods are willing to listen.\nReferences to actual history, geography and science\nEvans details how a [http://www.ethshar.com/theunwillingwarlord.html#origin history of England and a hereditary title] inspired the novel. Upon learning that Marshal of England (army commander-in-chief) was made a hereditary title, Evans felt it was incredibly stupid but an interesting idea to explore in a story.\nThough not explicitly mentioned, the career of Vond as a conqueror and self-created Emperor bears some resemblance to that of Napoleon Bonaparte.\nReferences\nExternal links\n* [http://www.ethshar.com/theunwillingwarlord.html The Unwilling Warlord] at Ethshar.com [http://www.ethshar.com]"
    }
  ]
}