{
  "content": [
    {
      "type": "text",
      "text": "# The Dewar Manuscripts\n\nThe Dewar Manuscripts are a collection of oral folktales of the Scottish Highlands, recorded in writing between 1863 and 1871 by John Dewar. Dewar's writings were first translated from Gaelic to English in 1879 and since then have been published in multiple formats. The collection of the folktales was intended to ensure that they were not forgotten by the population of the Scottish Highlands, and the manuscripts serve today as both a cultural record and historical source.\nConcept and creation\nThe creation of The Dewar Manuscripts has its origin in the vision and works of John Francis Campbell. In the mid-19th century Campbell took it upon himself to record as much Gaelic oral folktale as he was able, for the sake of preventing the loss of this cultural heritage. Unable to make time in his work schedule for this endeavour, Campbell employed others to collect tales from the Scottish Highlands. One of Campbell's most trusted collectors was John Dewar.\nDewar had no formal training in the field methodology of recording folk tales. Instead Dewar developed his own shorthand, by which he would take notes on the stories orally recounted to him, particularly regarding the phrases or words his subjects employed. After compiling multiple accounts of the same or similar folktales, Dewar would combine his notes to produce a single fluid written account of a tale. Dewar is believed to have taught himself to read and write in Gaelic and English, however his accounts were written in Gaelic, the language in which the oral accounts were given to him.\nTales collected by Dewar were first included in Campbell's Popular Tales of the West Highlands, published in 1860. In 1881, Hector Maclean completed an English translation of the complete collection of Dewar's writings, amounting to 19 volumes. Of these, one volume was published in 1964. A collection of John Dewar's notes can be found among the paper of John Francis Campbell in the National Library of Scotland.\nContents\nIn addition to a foreword by John Campbell, 9th Duke of Argyll, and an introduction by the Rev. John Mackechnie, The Dewar Manuscripts Vol.1 contains 45 of the folktales translated from John Dewar's original notes in Gaelic.\nFolktales\n*Cailean Mór\nThis story describes an assassination attempt on Cailean Mór (Big Colin) by the Malcolm Clan. Cailean Mor escapes his attackers by ditching his shirt of mail in a pool, giving the pool its name of Linne na Lurich, 'Pool of the Mailshirt'.\n*Macarthur and Campbell\nMacCailen Mor of the Campbells tricks the laird of Strachur into giving up the chief seat at the meeting of the Argyllshire gentry.\n*The Macfies and Auchry Malcolm\nGreat warrior of the Malcolm Clan, Big Auchry, makes a brave last stand against the Macfies of Colonsay in his mountain hold.\n*Macvicar of Dail-Chruinneachd and Mackellar of Mam\nA son of Clan Vicar and a daughter of the Mackellars are joined in an extravagant wedding celebration. A fight at the wedding leads to the exile of Angus Mackellar of Kilblaan and the eventual addition of the land of Kilblaan into the land of Argyll.\n*The Mackellars of Mam\nThe laird of Glendaruel dreams that his thumb and small fingers switch place. An old woman tell him that his youngest son will be laird rather than his eldest. This comes to pass.\n*Elegy to the son of Neil Mackellar of Mam\n*Sir Neil Campbell and the Lamonts\nThe widow of the baron MacLachlan is harassed by men of the Lamonts, who steal her corn. Sir Neil Campbell sends his army commanded by Mannach of the Big Boots to punish the Lamonts. Fighting ensues, the Lamonts eventually being forced out of Cowal.\n*The First Duke John\nMultiple tales featuring Duke John of Argyll.\n*Elegy to Sir Neil Campbell of Eilean Dearg\n*Sir John Campbell of Eilean Dearg\nSir John Campbell inherits the Island of Dearg in Loch Riddon. He is imprisoned for debt and sells the Island to Colonel Campbell.\n*Lochiel and the Duke of Athol\nLocheil and the Duke of Athol meet to negotiate ownership of the land of Aird-raineach.\n*Traditions of Arrochar\nTales of the theft and recovery of cattle in the region of Arrochar.\n*The daughter of Duncan Campbell of the Braes\nA woman descended from the Braes convinces a band of cattle raiders to return her livestock.\n*Mischievous Duncan\nDuncan Macfarlane burns down some hunting booths, while plundering Athol-men lay asleep inside them.\n*The last attempt to carry off a spoil from Arrochar\nMen from Sunart learn of the wealth of James Turner in Glen Loin, and plan to rob his house. The inhabitants of the house, along with an old soldier turned beggar, defend the house long enough for the Minister of Arrochar to assemble a host and chase off the Sunart-men.\n*The descendants of the Piebald Horse\nThe heir of the Macfarlanes in Arrochar is tricked by his step-mother into giving up his inheritance.\n*Macfarlane of Arrochar and the Laird of Luss\nMacfarlane of Arrochar and his men kill Sir Humphrey, the laird of Luss. Macfarlane removes the iron gates of Ros Dubh as proof of his victory over Luss.\n*Clan Nail\nThe men of Clan Nail become involved in a bloody fight with one-another without knowing why. From then on Clan Nail is used to describe people who were once great friends but then hated each other.\n*Big Malcolm Macilvain\nA series of tales following Big Malcolm MacIlvain, a swordsman and adventure of the Ilvain clan.\n*Big John, grandson to Big Malcolm MacIlvain\nBig John demonstrates his strength by beating his son and servant in a wrestling contest.\n*'''Rob an Roibein (Robert Campbell) MacCailein's Forester in Cowal\nKing James sends men to take the land charters of MacCailein Mor from the forester Rob an Robein. The story is left unfinished.\n*The Macleans of the white-faced Horse\nA tale describing how there came to be a family of Macleans living in Cowal\n*The Great strait of the Feinn\nThe men of the Feinn, commanded by Fionn MacCumhail, fight a series of battles against the army of the King of Lochlann, Earragan.\n*Charles Stuart of Ardsheil\nA long account of Charles Stuart, the laird of Ardsheil, and his role as colonel of the army of Prince Charles.\n*The laird of Invernahyle'''\nThe household of the laird of Invernahyle work together to prevent the King's soldiers from capturing the laird.\n*The Maccolls of Ben Vair\nFollowing the death of Ian Glas Stewart, at the battle of Culloden, his relatives the Maccolls take the best of his cattle to prevent them from being taken by the King.\n*Cameron of Fassifern\nThe rebel, Lochiel of Fassifern is expected to be disinherited and forced to flee the country. His brother, Cameron of Fassifern, forges a land charter to secure a portion of Locheil's land for himself.\n*Barcaldine\nThe lady of Barcaldine tricks her servants into eating dog meat, to stop them from stealing food.\n*Colin of Glenure\nAn account of the management of the lands of Lochiel and of Stewar of Appin, under the factorship of Colin of Glenure.\n*James Stewart of the Glen\nJohn Stewart treats the Duke of Argyll to great hospitality and earns his leave to take down James Stewart's body from the gallows.\n*Allan Breck Stewart\nAllan Stewart sends a letter from abroad, falsely confessing to the murder of Colin of Glenure. He admits this to a group of captured Scots soldiers captured by the French army, whom he helps escape.\n*Donald Stewart\nThe brother of Colin of Glenure notices that Donald Stewart's gun leaves the same bullet pattern as that which killed Colin. The two men quarrel and the people of Ballachulish treat the gun with suspicion.\n*The Family of Ardsheil\nDuncan Stewart returns to Scotland and recovers the lease of Ardsheil.\n*Big Duncan Mackenzie\nA son of the Mackenzie clan makes a name for himself by splitting open an Englishman's head at the battle of Prestonpans. He is later captured and made to swear to fight for Prince Charles no longer.\n*The Battle of Gladsmuir (Prestonpans)\nAccounts of various events which took place during and following the battle of Prestonpans.\n*Four soldiers killed by Big Duncan Mackenzie and the smith of Ballachulish, Lochaber\nDuncan Mackenzie and the smith of Ballachulish fight and kill four soldiers who are harassing a woman.\n*The Battle of Culloden\nAccounts of various events which took place during and following the battle of Culloden.\n*Big Archibald MacPhail\nA series of stories from the life of Big Archibald MacPhail, a powerful but reckless adventurer.\n*Young John Maccoll of Larach\nStories relating to the ancestors of John Maccol of Larach.\n*Gillespie MacCombie\nStories told by Gillespie MacCombie relating to his ancestors.\n*The MacGillivrays\nHow the descendants of Gille-bràigh became known as the MacGillivrays.\n*Kinlochbeg\nThe laird of Callart and the laird of Kinlochbeg quarrel over the right to fish on the river Lee.\n*The Stewarts of Appin and the MacDonalds of Glencoe\nThe MacDonalds of Glencoe are defeated in battle and their heads are cut off. A cairn called the 'Cairn of the Heads' is raised at the site of their beheading.\n*Little John MacAndrew\nA small man living in the land of the Grants develops a reputation as an excellent archer. Many men of the MacDonalds of Keppoch attempt to kill John MacAndrew, but none are able. The Grants send a party of men to attack the Keppoch-men, but all are killed.\n*MacArthur of Barra Nan Lion and MacKellar of Cruachan\nMacKellar of Cruachan holds the right to primae noctis over MacArthur's daughter. MacArthur asks MacKellar to give up this right but is denied. MacArthur and his sons kill MacKellar and flee across the country. The descendants of the four sons prosper, but the descendants of MacKellar are unfortunate.\nLegacy/Importance\nThe Dewar Manuscripts are a foundational work in the specialised field of the history of Scottish folklore, though some contention remains as to their validity as a record of actual historical events. Prior to the compilation of The Dewar Manuscripts, Scottish-Gaelic folklore was held in some measure of contempt by the broader academic community. Legislation and cultural practices had resulted in a decline in the use of the Gaelic language in Scotland, and consequently oral folktales were at risk of being lost entirely.\nThe Dewar Manuscripts serve to preserve a substantial body of oral folklore which would otherwise be unavailable to modern historians. Some historians claim that, in contrast to written sources of Scottish history, oral folklore provides insight into the lifestyles of non-literate Gaelic communities. This form of cultural heritage has allowed for communities belonging to the non-aristocratic classes to maintain agency in the telling of their histories. Conversely, it has been argued that the contents of The Dewar Manuscripts owe more to the style of heroic saga, shedding light more so on family and clan histories than on the lifestyles of commoners.\nThe Dewar Manuscripts have been the source of some controversy regarding the validity of oral folktales as historical sources. Gibson draws attention to a “…tendency to blur the line between historical and other sources…”, in reference to the use of tales from The Dewar Manuscripts to supplement written evidence regarding the Appin Murders. However, Macfarlane points out “In many societies they [oral folktales] are the only material with which to reconstruct the past…”\nRegardless, The Dewar Manuscripts are broadly appreciated for its contribution to the body of published oral history and have been described as “…a work of unique importance...”\nPublication history\nThe Dewar Manuscripts, Volume 1 was first published in 1964, appearing as an English translation of the tales collected by John Dewar, under the commission of the 8th Duke of Argyll. Dewar's work was translated from Gaelic into English in 1879 by Hector Maclean, a fellow contemporary of J.F Campbell, under the commission of the 9th Duke of Argyll. This translation was published in 1964. The Book was edited and contains a foreword by Rev. John MacKechnie. The book was published independently, financed by Charles A. Hepburn, a Scottish businessman and patron of the arts.\nJohn Dewar, 1801 or 1802–1872\nTowards the beginning of 1859, John Francis Campbell, Scottish author and scholar, began assembling a network of contacts that could be trusted to do the work of faithfully collecting and recording folktales of the Scottish Highlands. The earliest evidence of Dewar's association with J.F. Campbell is found in a letter from October 1859, in which Dewar indicates his willingness to collect tales for him. Accordingly, Dewar began his work as a collector at the age of 57, having previously worked for much of his life as a woodman in the service of George Campbell, the 8th Duke of Argyll.\nAt some point prior to his engagement with J.F Campbell, Dewar suffered an injury which ended his career as a woodman. Thus Dewar was able to make the collection of folktale his primary occupation for the latter part of his life.  Dewar left the employment of J.F Campbell in 1860, following the publication of Campbell's Popular Tales of the West Highlands, which features some of the stories recorded by Dewar. From 1860 until his death in 1872, Dewar continued collecting folktales with the sponsorship of the Duke of Argyll.\nJohn Dewar's death certificate labels his occupation as being ‘Collector of Traditions’. Contemporaries of Dewar, notably J.F Campbell, note that he was known for his ability to record stories in writing as quickly as they were told to him. The Scottish-Gaelic poet Calum Macphail (1847–1913) wrote a poem entitled ‘Cumha lain Mhic an Debir’ in recognition of Dewar's work.\nReferences"
    }
  ]
}