{
  "content": [
    {
      "type": "text",
      "text": "# The New Frontier (Fear the Walking Dead)\n\n| director     = Stefan Schwartz\n| writer       = Mark Richard\n| length       = 50 minutes\n| guests       =\n* Brenda Strong as Ilene Stowe\n* Lindsay Pulsipher as Charlene Daley\n* Karen Bethzabe as Elena Reyes\n* Ramses Jimenez as Hector Reyes\n* Michael William Freeman as Blake Sarno\n| prev         = Eye of the Beholder\n| next         = TEOTWAWKI\n| episode_list = List of Fear the Walking Dead episodes\n| season_article = Fear the Walking Dead (season 3)\n}}\n\"The New Frontier\" is the second episode of the third season of the post-apocalyptic horror television series Fear the Walking Dead, which aired on AMC on June 4, 2017, along with season premiere \"Eye of the Beholder\".\nThis episode marks the final regular appearance of Cliff Curtis as Travis Manawa, who was abruptly killed off early in the episode after getting shot inside a helicopter.\nPlot\nThe helicopter is attacked and Travis is shot through the stomach out the neck and starts bleeding to death; he falls to his death rather than dying and turning as the helicopter crash lands. At the hotel, Strand allows many angry refugees inside the gates, falsely claiming he is a doctor to calm them. Madison, Troy and Nick reach Broke Jaw Ranch, owned by Troy's father Jeremiah and are informed that the helicopter has not arrived. Jeremiah welcomes Madison and Nick, who are suspicious but decide to stay. Back at the hotel, Elena orders Strand to leave before his lie enrages the survivors. After the helicopter crash, Alicia and Jake carry Luciana to the ranch, where they reunite with Madison and Nick. Madison breaks down after being informed of the death of Travis, while Nick forces the others to aid Luciana. Prior to leaping to her death from a hotel balcony, IIene gives Strand the keys to a brand new Jaguar.\nReception\nmakes his final regular appearance in this episode.]]\n\"The New Frontier\", together with the next episode \"Eye of the Beholder\", received critical acclaim from critics. On Rotten Tomatoes, \"The New Frontier\" garnered an 86% rating, with an average score of 7.71/10 based on 7 reviews.\nIn a joint review along with the following episode, Matt Fowler of IGN gave \"Eye of the Beholder\" and \"The New Frontier\" an 8.5/10.0 rating together, stating; \"Fear the Walking Dead's two-part opener pulled very few punches as it unleashed gore galore and shocked us with a big character death that worked to fuel the story going forward. Sure, the Clarks might have to stay at Brokejaw for a while and the season may feel a bit stifled at some point because of it, but the characters seem to be instinctually making good decisions right now and that's enough to keep the engine humming.\"\nRatings\n\"The New Frontier\" was seen by 2.70 million viewers in the United States on its original air date, below the season premiere rating of 3.11 million.\nReferences"
    }
  ]
}