{
  "content": [
    {
      "type": "text",
      "text": "# The Emperor of Gladness\n\nThe Emperor of Gladness is a 2025 novel by Vietnamese American writer Ocean Vuong. It was announced in April 2024 and released on May 13, 2025. Penguin Press published the novel in the United States, and Jonathan Cape published it in the United Kingdom.\nBackground\nThe novel draws upon Vuong's real-life experiences in the service industry, as well as elder care. In writing it, Vuong specifically pushed back against the idea of writing a model minority narrative of rags to riches: \"As I grew up in my family and my community, the most common thing—the best scenario—was someone works the same job for 30 years, drives the same car, lives in the same apartment. That's not failure. That's a decent life.\"\nSynopsis\nThe novel follows a 19-year-old boy named Hai who lives in East Gladness, a town in Connecticut. Right before he jumps off of a bridge to die by suicide, an old woman suffering from dementia, named Grazina, urges him to reconsider. From then on, Hai becomes Grazina's caretaker.\nCritical reception\nKirkus Reviews stated that \"[t]he references to Slaughterhouse-Five and The Brothers Karamazov underscore Vuong’s interest in exploring war and morality, but this is remarkable as a novel that tries to look at those themes outside of conventional realism or combat porn. It’s a messy but worthy exploration of how hurt and self-deception leaches into everyday life [as well as]...the surprising and cruel ways violence is passed on across generations.\"\nLists\nThe book became one of the most highly anticipated book releases for 2025 following its announcement. Time called it one of the 39 most anticipated books of the year. British GQ said, \"Expect the kind of prose and emotional sensitivity that make the soul swoon.\"\nPride named it one of their 10 most anticipated LGBTQ+ books of 2025, stating, \"Prose or poetry, regardless of premise, I'll pick up anything he writes because it is always, without fail, an ineffably moving slice of the human experience.\" Electric Literature similarly called it one of the most anticipated queer books for spring 2025. Sally Tamarkin, writing for Them, wrote: \"I am already preparing myself for more of Vuong’s heart-rending prose.\"\nBook Riot reported that the novel was one of three books listed in Goodreads' Most Anticipated Contemporary & Historical Fiction of 2025.\nReferences"
    }
  ]
}