{
  "content": [
    {
      "type": "text",
      "text": "# The King of Fighters 2003 (manhua)\n\n| publisher_other =\n| demographic     =\n| magazine        =\n| first           =\n| last            = 2\n| volumes         = 13 (original) 5 (English release)\n| chapter_list    =\n| related         =\n| content         =\n| subcat          = ComicsOne\n| altcat          =\n| addpubcat#      =\n| zh              =\n}}\nThe King of Fighters 2003 is a manhua by Wing Yan and King Tung. It is based on SNK's video game with the same title. Originally divided in two versions in China, ComicsOne published the two series combined in North America. The plot of the series follows a new fighting tournament whose sponsors appear to be related with the legendary creature known as Yamata no Orochi and multiple combatants are summoned to investigate it. The comics generally focus of the reluctant hero K' and the mysterious newcomer Ash Crimson.\nCritical reception to the manhua has been mixed. While the art and translation were praised for the way fight scenes are drawn, the lack of backstories for most characters were criticized as casual readers would not understand who are they. Nevertheless, the final issues were well received for the way the plot was handled.\nPlot\nThe plot begins with a fight between K', a teenager with pyrokinectic abilities facing a clone from the fighters Kyo Kusanagi. Following K' victory, a woman named Chizuru Kagura revives the clone and renames him \"Kusanagi\". Shortly afterwards, Kagura is attacked by an unknown opponent and a new fighting tournament known as \"The King of Fighters\" is announced. A young man named Ash Crimson also capable of producing flame starts forming his own team with Shen Woo and Duo Lon, but forms multiple enemies in the process with another clone of Kyo attacking him in one moment. However, Ash defeats him. The original Kyo Kusanagi is summoned by Chizuru alongside his rival Iori Yagami for a mission: Chizuru senses the power of the legendary creature Yamata no Orochi stronger and requests their aid to oversee the tournament behind the shadows to learn if the sponsor is related to Orochi. While Kyo and Iori accept the mission, K' and his friends Maxima and Whip are requested by the elder Chin Gentsai to participate in the tournament for a similar mission with K' undergoing new training in the process.\nAs the tournament starts, Ash's and K's teams become one of the leading competitors. The final is a fight between Ash's team and K's. While Ash take the upperhand, K' wins the final battle due to a time limit. Shortly afterwards, K' is kidnapped by the sponsors Adelheid and Rose Bernstein. K' faces Adelheid but the two are separated in the area's destruction. Kyo and Iori are then betrayed by Chizuru who attacks them alongside her twin sister Maki Kagura. As Kyo and Iori defeat the Kagura sisters, it is revealed Maki is an undead fighter revived unintentionally Chizuru's power, the Yata Mirror. Chizuru had been brainwashed by Botan, a woman from an organization known as \"Those From the Past\". Kyo and Iori are then attacked by Botan's superior, Mukai, who also kills Kusanagi while the clone attempts to save Chizuru. K' faces Mukai and uses the power of Orochi to defeat him alongside Ash's help. Following Mukai's escape, Ash attacks Chizuru, and steals the Yata Mirror, promising Iori to be his next victim. A frustrated K' reunites with his friends as he remains taunted by Mukai.\nPublication\nIn China the series was divided into two halves: The King of Fighters 2003 composed of five issues, and The King of Fighters 03: Xenon Zero (拳皇 XENON ZERO) composed of eight issues. The two series were combined for the North American release under the name of The King of Fighters 2003. In July 2004, ComicsOne licensed the series with its first volume tying the release of a new video game and kept publishing it after their transition to DrMaster. They were published in five issues of 128 pages from May 25, 2005 to June 26, 2008.\n*Volume 1: May 25, 2005\n*Volume 2: September 25, 2005\n*Volume 3: January 25, 2006\n*Volume 4: March 28, 2008\n*Volume 5: June 26, 2008\nReception\nThe comic has received positive mixed critical responses. Atomicavanue enjoyed the way fights were displayed as due to how faithful they are to their video game incarnation citing Kyo Kusanagi's moves as an example. Karl Lam from Comic Book Bin agreed, feeling the artwork was good in general and the translation from Chinese to English was well executed. Since the reviewed first issue was mostly centered around the characters' introduction, Lam noticed there was not many interactions. However, he gave the comic an overall score of 9 out of 10. In a more critical review, IGN was bothered by the new main character, Ash Crimson, feeling he was not as appealing other characters based on his characterization and also found it issues in the lack of backstories of the cast. Nevertheless, IGN felt the comic might be suitable for The King of Fighters and agreed the fight scenes were also enjoyable.\nA similar response in regards to the storyline was given by Genji Press' Serdar Yegulalp in regards to whether fans of the franchise might enjoy the comic more than casual readers. While praising the fight scenes, Yegulalp felt Ash would not come as very likable and that the relationships between characters like K' and Maxima were left in mystery to casuals. In contrast to the negative review from the initial review, IGN found the fourth issue of the story more enjoyable based on the characters' fight scenes, as well as the fact that the story's tournament is not the end of the story because of the sponsor hiding something which might surprise the readers. IGN also enjoyed how the characters were given their unique traits such as Ash's \"jerkass\" attitude or K's heroic personality. In general, IGN found the manhua more enjoyable than the adaptation of the game SVC Chaos: SNK vs. Capcom. In a review of the final volume, Ben Leary from Mania Entertainment said that while the battle sequences were appealing, some of them did not have a satisfying conclusion or were not elaborated well such as the final fight between K' and Mukai due to how the former is found in a conflict related to Japanese mythology while some scenes felt repetitive. Giving the final issue a C+, Leary that while the comic tried giving coherency to the plot, it failed to do it.\nReferences"
    }
  ]
}