{
  "content": [
    {
      "type": "text",
      "text": "# The Maverick Queen\n\n| starring       = Barbara StanwyckBarry Sullivan\n| music          = Victor Young\n| cinematography = Jack A. Marta\n| editing        = Richard L. Van Enger\n| color_process  = Trucolor\n| studio         = Republic Pictures\n| distributor    = Republic Pictures\n| released       =\n| runtime        = 90 minutes\n| country        = United States\n| language       = English\n}}\nThe Maverick Queen is a 1956 American Western and starring Barbara Stanwyck as the title character and Barry Sullivan as an undercover Pinkerton detective out to stop outlaws Butch Cassidy, the Sundance Kid, and the Wild Bunch. It was the first film made in Republic's widescreen process Naturama. The film is based on the novel of the same name by Zane Grey.\nPlot\nA stranger, calling himself Jeff Young, imposes on rancher Lucy Lee for a meal and a night's rest, then saves her from being robbed. Jeff helps deliver her cattle to town, where he encounters Kit Banion running her saloon, The Maverick Queen.\nKit is secretly in cahoots with the notorious Hole in the Wall Gang, led by Butch Cassidy and Sundance, and a jealous Sundance is angered when Jeff beats him at poker and attracts romantic interest from Kit, who offers Jeff a job as a faro dealer. He reveals he is actually Jeff Younger, a relative of the Younger Gang outlaws, and wants to help Kit and her associates with their illegal holdups.\nLucy is held captive by Sundance after a train robbery, and Jeff ends up killing him to save her. Holding off the other outlaws while their cabin is on fire, Jeff is helped by Kit, who is shot and dies in his arms. The posse arrives, whereupon Jeff confesses that he is actually a Pinkerton detective, working undercover to catch the thieves.\nCast\n* Barbara Stanwyck as Kit Banion\n* Barry Sullivan as Jeff Young / Younger\n* Scott Brady as Sundance\n* Mary Murphy as Lucy Lee\n* Wallace Ford as Jamie\n* Howard Petrie as Butch Cassidy\n* Jim Davis as The Stranger, the real Jeff Younger\n* Emile Meyer as Leo Malone\n* Walter Sande as Sheriff Wilson\n* George Keymas as Muncie\n* John Doucette as Loudmouth\n* Taylor Holmes as Pete Callaher\n* Pierre Watkin as McMillan\n* Joni James as Title Song Singer\n* Jack Kenny as Barfly (uncredited)\n* Ethan Laidlaw as Henchman (uncredited)\nSee also\n* List of American films of 1956\n* List of American films of 1955\nExternal links\n*\n*"
    }
  ]
}