{
  "content": [
    {
      "type": "text",
      "text": "# The History Channel: Great Battles of Rome\n\n}}\n|genre= Real-time tactics\n|modes= Single player\n|platforms= Windows, PlayStation 2, PlayStation Portable\n}}\nThe History Channel: Great Battles of Rome is a historical real-time tactics video game developed by Slitherine, released on 8 June 2007 by Black Bean Games and the History Channel for Microsoft Windows, PlayStation 2, and PSP. The game garnered mostly mixed reviews.\nFour other History Channel branded games by Slitherine were released: History: Great Empires – Rome in 2009 for the Nintendo DS, History: Ice Road Truckers in 2010 for the PSP, History: Egypt – Engineering an Empire in 2010 for the DS, PSP, PC, and iOS, and History: Great Battles – Medieval in 2010 for the PC, PS3, Xbox 360, Android, and iOS.\nCore components of the game would be used for the battle simulation used in the Spike TV series Deadliest Warrior\nOverview\nGreat Battles of Rome sees the player take control of the army of the Roman Empire in the first half of the game. The player engages in a number of set battles against a range of enemies from Etruscans, Greeks, Gauls, and Persians. Following the completion of the Roman portion of the game, the player is given control of the army of the Celts to command in a number of other battles.\nBefore each battle commences, the player is given the option to arrange twenty units within a set zone. These units range from skirmishers and archers to heavy cavalry and War Elephants. Players are also given the option to give their army a number of commands to be executed once the battle has begun. After each successful battle the player earns denari which can subsequently be used in order to purchase new units, or upgrade existing ones, before the next battle.\nReception\n| GRadar = 3.5/5\n| GSpot = 3.5/10\n}}\nUpon release Great Battles of Rome received mixed reviews. The main criticisms of the game were repetitive gameplay, substandard graphics, and a poor control scheme.\nReferences"
    }
  ]
}