{
  "content": [
    {
      "type": "text",
      "text": "# The Complete Wargames Handbook\n\nThe Complete Wargames Handbook is a book about playing and designing wargames by James F. Dunnigan, published in 1980 by William Morrow and Company.\nDescription\nWhile still in college in the 1960s, Jim Dunnigan became involved in wargaming, and subsequently designed Jutland, which Avalon Hill published in 1967. This was the first of many wargames that Dunnigan designed, including 1914 (1968), PanzerBlitz (1970), and Sniper! (1973). Dunnigan also founded his own wargames company, initially known as Poultron Press, soon renamed Simulations Publications Inc. (SPI).\nIn 1980, as wargame publishers turned to computer-based games, Dunnigan wrote The Complete Wargames Handbook, a book about wargaming, including information about how to play, design, and find copies of wargames.\nThe book is divided into nine chapters, preceded by an introduction and followed by appendices and a bibliography. The chapters cover:\n#What is a Wargame?\n#How to Play Wargames\n#Why Plan the Game\n#Designing Manual Games\n#History of Wargames\n#Computer Wargames\n#Designing Computer Wargames\n#Who Plays the Games\n#Wargames at War\nPublication history\nThe book was originally published by William Morrow & Company in 1980. This was translated into Japanese and published by Hobby Japan in 1982. Morrow published a second edition in 1992. A third edition in paperback was published in 2000 by iUniverse.\nReception\nIn the September 1980 edition of The Space Gamer (No. 31), Nick Schuessler commented that \"Wargames Handbook might make an interesting Christmas present for the friend or relative who has exhibited a passing interest in your hobby.\"\nIn the August–September 1980 edition of Different Worlds (Issue #9), Lynn Willis thought that Dunnigan's basic thesis was that wargaming is simple. However, noting the 272 pages \"interspersed with 50–60 charts, maps, and rules excerpts\", Willis commented, \"I  am not sure how well simplicity can be proved by a complex execution which implicitly disowns its rationale. It strikes me strange, somehow, like ending the Miss Nude USA contest with a  swimsuit competition.\" Willis also thought that the book superficially skimmed over its topics, and Dunnigan failed to provide deep insights into his experiences. Willis concluded, \"What we get are not [Dunnigan's] insights which have so dramatically revitalized gaming, nor the knowledge and experience given in return to Dunnigan, but a watery book which anyone acquainted with the field might have written.\"\nThe Tactical Wargamer website noted that the bibliographies \"range in usefulness\", and that there is \"little discussion of tactical-level games.\"\nIn a summary about a workshop held by Military Operations Research Society to design \"seminar wargames\" (used by the military for planning strategies), Dunnigan's book was quoted extensively regarding developing manual rules for a wargame. But it was noted that in the case of blind testing of the wargame suggested by Dunnigan, it \"may not be feasible in seminar war games where the judgement of the facilitator is so crucial in determining how player activity will govern outcomes (i.e., where there are no written rules for adjudication).\"\nReviews\n*Computer Games Strategy Plus\n*Computer Games Magazine\nReferences"
    }
  ]
}