{
  "content": [
    {
      "type": "text",
      "text": "# The Princess and the Queen (House of the Dragon)\n\n| length         = 68 minutes\n| guests         =\n| prev           = We Light the Way\n| next           = Driftmark\n}}\n\"The Princess and the Queen\" is the sixth episode of the first season of the fantasy drama television series House of the Dragon, a prequel to Game of Thrones. Its title is named after George R. R. Martin's eponymous 2013 novella. The episode was written by Sara Hess and directed by showrunner and executive producer Miguel Sapochnik. It first aired on HBO and HBO Max on September 25, 2022.\nThe episode features a 10-year time jump after the previous episode and depicts the birth of Rhaenyra and Laenor's third son Joffrey; Daemon, Laena, and their daughters Baela and Rhaena's visit to Pentos; and the consequences of allegation surrounding Rhaenyra and Laenor's sons as bastards.\n\"The Princess and the Queen\" introduced several new cast members, including Emma D'Arcy and Olivia Cooke as the adult versions of Rhaenyra Targaryen and Alicent Hightower, respectively. In the United States, the episode garnered a viewership of 1.8 million during its premiere night on linear television alone. It received mostly positive reviews, with critics praising the opening scene, Laena's death scene, the climactic sequence at Harrenhal, and the performances (especially those of Cooke, D'Arcy, and Nanna Blondell), though some criticized the pacing, particularly for causing emotional scenes to fall short.\nPlot\nIn King's Landing\nTen years after marrying Laenor Velaryon, Princess Rhaenyra gives birth to a third child. Queen Alicent immediately summons them to see the infant. A weakened Rhaenyra brings the newborn herself, assisted by Laenor, who names him Joffrey. Alicent notes that Joffrey, like brothers Jacaerys “Jace” and Lucerys “Luke”, bears no resemblance to Laenor. Alicent privately insists that Rhaenyra's children are bastards, an allegation King Viserys repeatedly ignores.\nAlicent's eldest son Aegon, aided by Jace and Luke, pranks his younger brother, Aemond, the only Targaryen heir to have no dragon of his own. Alicent scolds Aegon for misbehaving and stresses family unity, telling him he will one day challenge Rhaenyra for the throne.\nCriston, now a senior Kingsguard and Alicent's confidant, trains the young princes in swordsmanship and forces them to fight one another. He goads City Watch commander Ser Harwin \"Breakbones\" Strong into attacking him by implying Harwin fathered Rhaenyra's children. Lord Lyonel Strong, Harwin's father and Hand of the King, chastises his son for such behavior, stressing it substantiates rumours about Rhaenyra's infidelity with Harwin and damages the children's legitimacy. Amidst the political turmoil, Rhaenyra prevents Leanor from accepting a military commission in the renewed war with the Triarchy. To ease family tensions, Rhaenyra proposes that Jace marry Helaena, Alicent's daughter. Viserys approves, but Alicent is furious that her own husband will not defend her.\nThe rumours cause Lord Strong to offer his resignation, which Viserys rejects, instead permitting the Hand to escort his disgraced son back to the family estate of Harrenhal. After Harwin bids an emotional farewell to Rhaenyra and her children, Jace asks if Harwin is his biological father to which Rhaenyra replies that it matters only that Jace is a Targaryen (It is strongly implied that Harwin is, in fact, the biological father of Rhaenyra's children). Reading the political winds, Rhaenyra moves her household to the safety of Dragonstone and permits her husband's lover, Ser Qarl Correy, to accompany them.\nAlicent mentions to Harwin's brother, Ser Larys Strong, that she wishes her father, Otto, was still the king's Hand. After having their tongues removed, Larys recruits three condemned criminals to start a fire at Harrenhal, killing Lyonel and Harwin. Alicent is horrified by Larys' actions, but he simply reminds her that she is now in his debt.\nIn Pentos\nMeanwhile, Prince Daemon and his wife, Laena Velaryon, visit the free city of Pentos with their daughters Baela and Rhaena. Prince Reggio Haratis offers them a portion of his lands in exchange for military assistance in fending off the Triarchy. Daemon contemplates the offer, but Laena criticizes him for choosing an easy life over what she believes is his rightful place at Driftmark. The pregnant Laena suffers prolonged labor and is unable to deliver; she commands her dragon Vhagar to incinerate her so she may die a dragonrider's death.\nProduction\nWriting\n\"The Princess and the Queen\" was written by executive producer Sara Hess, marking her first time in the Game of Thrones franchise. The episode's title refers to George R. R. Martin's eponymous 2013 novella, hinting at the feud between Rhaenyra and Alicent.\nFilming\nThe episode was directed by showrunner and executive producer Miguel Sapochnik, making it his second directorial credit for the series, following the pilot episode \"The Heirs of the Dragon\", and eighth for the overall franchise.\nLa Calahorra, a municipality in eastern Granada, Spain, served as the location for the scenes in Pentos.\nCasting\nThe episode stars Paddy Considine as King Viserys I Targaryen, Matt Smith as Prince Daemon Targaryen, Olivia Cooke as Queen Alicent Hightower, Emma D'Arcy as Princess Rhaenyra Targaryen, Fabien Frankel as Ser Criston Cole, Graham McTavish as Ser Harrold Westerling, Matthew Needham as Larys \"Clubfoot\" Strong, and Jefferson Hall as Ser Tyland Lannister. Rhys Ifans (Ser Otto Hightower) is credited in the opening credits sequence but does not appear in the episode.\nIt marks the first appearance of D'Arcy as Adult Rhaenyra, Cooke as Adult Alicent, and John Macmillan as Adult Laenor Velaryon, succeeding Milly Alcock, Emily Carey and Theo Nate who portrayed the young version of the three characters, respectively, following a plot jump of 10 years after the previous episode. D'Arcy was previously credited in the pilot episode as the narrator of the opening scene, therefore, this episode marks their first on-screen appearance. Cooke's casting was announced on December 11, 2020, alongside Smith and D'Arcy.\nAlso introduced in the episode were Ty Tennant, Leo Ashton and Evie Allen as the young versions of Viserys and Alicent's children Aegon, Aemond and Helaena, respectively; Leo Hart and Harvey Sadler as the young versions of Rhaenyra and Laenor's first two sons Jacaerys and Lucerys, respectively; as well as Shani Smethurst and Eva Ossei-Gerning as the young versions of Daemon and Laena's daughters Baela and Rhaena. Additionally, the episode also marks the first appearance of Nanna Blondell as Adult Laena Velaryon, succeeding Savannah Steyn who portrayed the teenage Laena in the previous episode; and the final appearances of Gavin Spokes as Lord Lyonel Strong and Ryan Corr as Ser Harwin Strong.\nReception\nRatings\nAn estimated 1.86 million viewers watched \"The Princess and the Queen\" during its first broadcast on HBO. A total of 2.48 million viewers watched the episode across its four broadcasts on HBO during the premiere night. Its viewership on all platforms in the US meanwhile was 3% more than the previous episode.\nCritical response\nThe episode received mostly positive reviews. On the review aggregator Rotten Tomatoes, it holds an approval rating of 86% based on 103 reviews, with an average rating of 7.5/10. The site's critical consensus said, \"While the longest time-skip yet diminishes some of this installment's most shocking moments, the commanding introductions of Emma D'Arcy and Olivia Cooke make clear that 'The Princess and the Queen' will remain compulsively watchable combatants.\"\nWriting for Den of Geek, Alec Bojalad gave it a rating of 4.5 out of 5 stars and deemed it \"by far the most entertaining and enriching dispatch from House of the Dragon yet.\" He highlighted the opening scene, calling it \"the best thing the show has done yet\" and praising the performances of D'Arcy, Cooke and Mcmillan. Reviewing for IGN, Helen O'Hara gave it a \"great\" score of 8 out of 10 and wrote in her verdict: \"Plotting, mutilation, murder, and dragons: it doesn't get much more Game Of Thrones than this. It's also a dramatically compelling episode, with lots of spiky moments to reassure us that Rhaenyra and Alicent are in good hands. If a few moments still feel shaky in the writing, there's no doubt that the cast are doing their utmost.\" Molly Edwards of GamesRadar+ rated the episode with 3 out of 5 stars and summarized her review by saying, \"The new Rhaenyra and Alicent are strong additions to the cast, but the episode flies through major events so quickly that emotional weight is lost.\" She then praised the visuals and Blondell's performance as Laena, calling it \"powerful\", but criticized the episode's pacing.\nReferences\nExternal links\n* [https://www.hbo.com/house-of-the-dragon/season-1/6-episode-6 \"The Princess and the Queen\"]  at HBO\n*"
    }
  ]
}