{
  "content": [
    {
      "type": "text",
      "text": "# The War at Home (TV series)__disambig_1\n\n| last_aired         =\n| image_alt          = The name of the show written all in lowercase with the word \"the\" at the top in green color, the words \"war at\" under it while the word \"war\" is in green color and the word \"at\" in blue color and the word \"home\" is under that in blue color.\n| network            =\n| released           =\n}}\nThe War at Home is an American sitcom created by Rob Lotterstein that ran from September 11, 2005, to April 22, 2007, on Fox. It follows the antics of a largely dysfunctional Long Island family.\nPlot\nThe show depicts the daily lives of Dave and Vicky and their three children, Hillary, Larry, and Mike, on Long Island, New York, dealing with normal family issues. Dave is a middle class Jewish insurance salesman. He is often portrayed as insensitive and cynical, and sometimes as a paranoid, overprotective and hypocritical bigot. His family (especially Larry) find it difficult to accept his behavior. Dave is constantly scolded and insulted (and even punched once) by Larry for always picking on him. It is established toward the end of season one that Dave is the way he is because he had a father who constantly badgered him. Dave's wife Vicky is an attractive Italian-American Catholic part-time receptionist at a doctors' office. Generally level-headed, she usually spends her time dealing with Dave's unreasonable behavior, but can be quite obnoxious herself.\nOf their three children, the oldest is Hillary (Kaylee DeFer), a typical 16-year-old who frequently misbehaves, trying to get away with bad behavior behind the backs of her parents, who often regard her with suspicion. Second oldest is 15-year-old Larry (Kyle Sullivan), an odd misfit given to emotional outbursts (such as when Vicky denies him permission to see Brian Boitano star as Bilbo Baggins in The Lord of the Rings On Ice). Larry is often seen with his best friend Kenny (Rami Malek). Initially Dave believes that the boys are both gay, but it is later revealed to the audience that while Larry is not gay, Kenny has a secret crush on Larry. Dave, and to a lesser extent Vicky, often treat Larry's flamboyancy with wary eyes. The youngest child, the pubescent 12-year-old Mike (Dean Collins), must deal with issues such as masturbation, dating and underage gambling. His character is portrayed as tougher and more cynical than Larry's.\nThe series frequently breaks the fourth wall between segments of an episode, during which Dave or other characters deliver a rant or other comment directly relating to the scene.\nCast and characters\n* Michael Rapaport as David \"Dave\" Gold\n* Anita Barone as Victoria \"Vicky\" Gold\n* Kyle Sullivan as Lawrence Allen \"Larry\" Gold\n* Kaylee DeFer as Hillary Gold\n* Dean Collins as Michael \"Mike\" Gold\nRecurring\n* Rami Malek as Khaleel Nazeeh \"Kenny\" Al-Bahir\n* Tom McGowan as Joe\n* Zoe Di Stefano as Brenda\n* Lil' Fizz as Taye\n* Anita Gillette as Betty\n* Courtney Jines as Heidi\nEpisodes\nSeries overview\n| end1       =\n| color2     = #143b80\n| link2      = #Season 2 (2006–07)\n| episodes2  = 22\n| start2     =\n| end2       =\n}}\nSeason 1 (2005–06)\n| ProdCode=475294\n| Viewers=8.71\n| ShortSummary=16-year-old Hillary's father, Dave, refuses to let her go out on a date with a guy older than she is. So, to deceive him, she brings a new \"study buddy\" over to the house instead, but her friend, Taye, turns out to be black, which upsets Dave and Vicky. At the same time, Dave and Vicky are having trouble trying to figure out how to understand their son, Larry, since Mike saw Larry wearing Vicky's blouse and a wig. However, Larry was only dressed as her because he stole Vicky's car for a joyride.\n| LineColor=55af35\n}}\n| ProdCode=2T7601\n| Viewers=8.61\n| ShortSummary=Vicky discovers some of Dave's secret instant messages he's been sending to someone with the screenname \"Lonely Lady Michigan\". She confronts him and compares his cybersex to cheating. He, in turn, accuses her of the same thing because she has been confiding in an ex-boyfriend via e-mail. Hillary, meanwhile, has some problems of her own... it is implied that her boyfriend Taye won't reciprocate sexually. Dave, completely misunderstanding what Hillary tells him, confronts her boyfriend Taye, and tells him that when a woman gives a man a gift, he should give her one in return.\n| LineColor=55af35\n}}\n| ProdCode=2T7603\n| Viewers=8.17\n| ShortSummary=When Dave notices how nice Hillary has been to him recently, he is certain it's because she's having sex with someone. However, Mike convinces Dave that he is wrong. Dave then jumps to the conclusion that she's smoking pot when he notices his stash has gone missing. As he's confronting her about it, though, he accidentally lets it slip that the missing stash is his. He then lies and tells her that it's not really his—it belongs to Vicky's mother, Betty, who uses it for medicinal purposes. Mike overhears this, and buys some dope from the local playground to give to Grandma Betty, which he does, telling her it is from his dad. Vicky eventually finds the dope, and smokes it to help her cope with a boring book club meeting. Grandma Betty, meanwhile, has a party of her own. In the end, Larry is shown that he took the stash from Hillary's drawer, showing that she took the stash after all.\n| LineColor=55af35\n}}\n| ProdCode=2T7602\n| Viewers=8.54\n| ShortSummary=Dave isn't happy when Taye's family is invited over for a barbecue by Vicky, and has a hard time getting along with Taye's father, Omar. At the barbecue, Omar mistakes some of Dave's comments as racist, because he's a wealthy African-American. However, when Vicky insists that he go apologize to him, Dave finds himself having a great time at Omar's country club. When he gets home, though, he finds out that Hillary and Taye are on the verge of breaking up. Meanwhile, Dave needs to solve a situation with Mike because he has started masturbating.\n| LineColor=55af35\n}}\n| ProdCode=2T7606\n| Viewers = 7.39\n| ShortSummary=When Dave finds out that Hillary is asking Vicky about sex education, he plans an unexpected family trip to prevent her from going out on a date on Saturday night because he thinks that she will go to have sex. Meanwhile, Kenny can't accept the fact that Larry has a new girlfriend, because he himself has a crush on him, so he tries his best to break them up.\n| LineColor=55af35\n}}\n| ProdCode=2T7605\n| Viewers = 8.25\n| ShortSummary=One of Hillary's friends gets breast implants, so now, Hillary wants to get implants, too. However, both Dave and Vicky won't let her do it, as Dave tells Hillary that it's what's on the inside that matters, not appearance. His advice is then tested to the very balance when he meets Larry's new, overweight, unattractive girlfriend, Marla. Now, he'll have to figure out how to tell Larry that he can do better without going against what he told Hillary earlier.\n| LineColor=55af35\n}}\n| ProdCode=2T7607\n| Viewers = 8.59\n| ShortSummary=When Hillary and her friend Brenda are caught arriving drunk late at night, Dave and Vicky decide to ban alcohol in the house. However, this only lasts two days, as Vicky and Dave fall victims to some free alcohol with their friends and arrive home drunk themselves. As they arrive, they'll have to face Hillary and Brenda's strict parents, who are waiting for them. Meanwhile, after accidentally shooting a pigeon, Mike decides to become a vegetarian.\n| LineColor=55af35\n}}\n| ProdCode=2T7608\n| Viewers = 8.94\n| ShortSummary=When Dave thinks the kids are getting away with too much, he implements a zero-tolerance, pro-spanking policy, since talking to them just isn't working. However, they all think he's bluffing and don't take him seriously. After Larry becomes the first to be spanked, he moves in with his friend, Kenny. Now, Child Protective Services are called by Larry, and Dave will have to answer to them.\n| LineColor=55af35\n}}\n| ProdCode=2T7604\n| Viewers = 7.68\n| ShortSummary=Dave becomes upset with Larry because of his lack of interest in masculine activities, and his lead role in the \"Annie Get Your Gun\" play at his high school. Things get worse for Larry when his parents see him kissing what they think is a guy, which convinces them that Larry is, in fact, gay. Meanwhile, Hillary has to deal with her new image at school after she hits another girl and gets dumped by Taye.\n| LineColor=55af35\n}}\n| ProdCode=2T7609\n| Viewers = 7.84\n| ShortSummary=Grandma Betty comes over with her new boyfriend for dinner with the family. However, soon, Dave finds out that she is spending a lot of money on him. Fearing that he'll lose his future inheritance, Dave accuses Grandma Betty's boyfriend of being a gigolo in order to break them up. Meanwhile, Vicky and Dave devise a plan to break up Hillary and Keith by showing Hillary how hard it is to raise a baby. Then, when Larry shows interest in baseball cards, Dave encourages him... until he learns that Larry is using the information to sell his cards on eBay.\n| LineColor=55af35\n}}\n| ProdCode=2T7610\n| Viewers = 7.20\n| ShortSummary=Vicky becomes inspired to be more ambitious by Mike when he scores high on a test, with the option of taking the honors class. So, she decides to return to her fashion-executive lifestyle, which will mean an increased salary. Dave supports her all the way until he soon learns she's too busy to do the household duties, leaving him to do all the chores. Larry, meanwhile, ends up taking too much credit after submitting Kenny's poem as his own. To be continued...\n| LineColor=55af35\n}}\n| ProdCode=2T7612\n| Viewers = 7.20\n| ShortSummary=The family struggles to adjust to Vicky's new job, which leaves her with less hours to be at home and more hours working. Dave and Larry continue to have tough time trying to do the things Vicky normally does. Dave's temper doesn't help and makes matters worse when Mike and Hillary end up in trouble. Meanwhile, the changes around the office force Vicky to think twice about her decision.\n| LineColor=55af35\n}}\n| ProdCode=2T7611\n| Viewers= 7.49\n| ShortSummary=Jodi, Vicky's old college friend, comes in for a visit during the weekend. Mike and Larry become Peeping Toms and try to spy on her to see her naked using multiple plans (all of which them fail), while Dave is really concerned about Jodi because he had sex with her while Vicky was away for a ski trip during college, and struggles how to tell her the truth.\n| LineColor=55af35\n}}\n| ProdCode=2T7613\n| Viewers= 12.51\n| ShortSummary=Dave suspects Hillary is pregnant when he finds a pregnancy test in the trash. However, he soon learns that a depressed, jobless Vicky has not been taking the pill. So, Dave insists and helps Vicky with various job opportunities, but with no results, since he is opposed to having another kid. Mike, meanwhile, becomes too lazy and buys Hillary's old book reports when she had good grades, and Larry gets himself into a spelling bee competition.\n| LineColor=55af35\n}}\n| ProdCode=2T7614\n| Viewers = 7.04\n| ShortSummary=Dave and Vicky attempt to cheer Mike up when they are convinced he's depressed after find a note in his room. Mike goes along with them and decides to milk the situation for all its worth... until he's taken to a therapist and is forced to tell the truth. Due to all the attention Mike is receiving, Larry becomes very upset. Meanwhile, Hillary takes a sexual experience survey for a class at school. This episode includes a cameo appearance by Kathleen Noone.\n| LineColor=55af35\n}}\n| ProdCode=2T7615\n| Viewers= 6.61\n| ShortSummary=Dave has to deal with mood swings and PMS when Vicky and Hillary's menstrual cycles start in full swing. So, when a reluctant Dave has to take Hillary to the gynecologist's office, he soon discovers that Dr. Vogel is his old best friend, who happened to be a ladies' man in high school. This leads to the doctor's professional relationship with the family getting personal since Dave doesn't believe he's changed his ways. Meanwhile, Larry tries to do whatever it takes to gain the respect of Mike when he calls him a nobody.\n| LineColor=55af35\n}}\n| ProdCode=2T7616\n| Viewers = 7.85\n| ShortSummary=Dave thinks he's still a catch for the ladies when he gets hit on by an attractive saleswoman at work. But he soon learns that she was only checking him out for her mother. Meanwhile, Vicky attracts guys of all ages when she goes to Mike's class for Career Day. And back home, Hillary gets attracted to Kenny's sensitive side of him and tries to score him. This episode includes a cameo appearance by Meghan Markle.\n| LineColor=55af35\n}}\n| ProdCode=2T7617\n| Viewers = 6.41\n| ShortSummary=Mike asks Dave for a Bar Mitzvah, but he believes Mike is only in it for the party and gifts. However, Mike expresses genuine interest in Judaism after studying Hebrew, so Dave and Vicky are willing to support him and throw him a \"coming-of-age\" ceremony. Hillary also decides she's interested in being Jewish after meeting Mike's attractive Hebrew tutor. Also, Larry gets the confidence he needs to ask out an attractive girl at school. Later Mike refuses the Bar Mitzvah after he discovers that the synagogue needs to draw a few blood drops from his penis, a form of the traditional bris ceremony, for the much later Bar Mitzvah event, on account of his son not getting it as an infant due to a Catholic mother.\n| LineColor=55af35\n}}\n| ProdCode=2T7618\n| Viewers=5.41\n| ShortSummary=When Hillary sprains her ankle skiing and lands in the emergency room, a furious Dave becomes even angrier when he realizes Vicky gave her approval for the ski trip without his consent. But when they arrive at the hospital and learn that Hillary lied to the both of them, their argument turns into an all-out war. Meanwhile, Larry awaits a phone call from a girl and Mike takes advantage of the situation to get an older woman.\n| LineColor=55af35\n}}\n| ProdCode=2T7621\n| Viewers=5.43\n| ShortSummary=Dave decides to take the family to Florida to visit his parents, and because it won't cost him a dime. But he soon learns that Mike hates to fly, Vicky hates his parents, and Hillary wants to remain in town so the boy she likes won't forget her. This leaves Larry the only one actually looking forward to going on the trip, and has started a weight-loss program so he'll look good in a Speedo. However, everything soon starts to go wrong when their ride to the airport is cancelled, Hillary's new nipple ring is discovered by airport security in front of an angry Vicky, and Dave is searched by security. Once they reach the condo, Dave is continuously treated by his dad the same way he treats Larry and wants to return home as quickly as possible.\n| LineColor=55af35\n}}\n| ProdCode=2T7620\n| Viewers=6.68\n| ShortSummary=When Vicky refuses to buy Larry Ice Capades tickets, he runs away from home hoping she'll give in so he can see Brian Boitano star as Bilbo Baggins in The Lord of the Rings on ice. A disbelieving Vicky holds her ground, but when she realizes Larry really did leave town, she questions her parenting skills. Meanwhile, Dave tries to support Hillary in a fight with one of her friends, but when it backfires on him, Dave and Vicky get tired of parenting and ditch the kids and go to a motel for a night.\n| LineColor=55af35\n}}\n| ProdCode=2T7619\n| Viewers=7.24\n| ShortSummary=Thinking that Hillary will be grateful, Dave takes the blame when she gets pulled over for reckless driving while she's taking driving lessons. However, Hillary isn't grateful at all when this leads Dave to be arrested for DUI and goes to court to try and settle things, because he forgot that he had a couple of beers before leaving the house. Vicky, meanwhile, forgets to register Larry for Shakespeare camp, putting Larry in an awkward situation, while Dave and Mike take up online poker.\n| LineColor=55af35\n}}\n}}\nSeason 2 (2006–07)\n| ProdCode=3T5601\n| Viewers=7.43\n| ShortSummary=As school starts up again, Dave is excited that the kids will be out of the house until he and Vicki realize that all of them have their own agendas. Mike questions his current romantic relationship, which upsets Dave because the girl involved is the daughter of Dave's new best friend. But when Dave meddles in Mike's life for the sake of his \"man-crush\" on the girl's father, he does unexpected damage. Meanwhile, Hillary changes her study habits after catching a glimpse of her future, and Larry reinvents himself for the new school year.\n| LineColor=143b80\n}}\n| ProdCode=3T5602\n| Viewers=6.75\n| ShortSummary=When Larry decides to run for president, Dave is supportive of his son's interest in leadership, until he learns that Larry is actually running for president of the Chess Club. Dave makes a strategic move to prevent Larry from becoming the biggest geek in school. Meanwhile, Hillary thinks she's going to become the next pop star, and after finding an empty condom wrapper in Mike's pants, Dave and Vicki face the dreaded sex talk.\n| LineColor=143b80\n}}\n| ProdCode=3T5603\n| Viewers=6.61\n| ShortSummary=When Kenny's dad cancels on taking the boys to a comic book convention, Larry asks Dave to take them instead. At first, Dave refuses, but after hearing Larry call him a hero, he quickly decides to be a good father and take the boys. But when his fatherly duties go beyond simply dropping them off, Dave is pushed to the limit when it means missing the Jets football game and pretending he's a comic book geek. Back at home, Vicky introduces Mike to coffee and Hillary wants to have a sleepover with a guy.\n| LineColor=143b80\n}}\n| ProdCode=3T5604\n| Viewers= 5.59\n| ShortSummary=Dave and Vicky decide to give Hillary the car she wants as long as she agrees to sign a contract so they can completely control her life. She reluctantly signs, but Dave and Vicky realize they may have gone too far with the restrictions. Meanwhile, Larry goes against the \"bros before hos\" code and dates Mike's ex-girlfriend, Heidi, when she becomes interested in him.\n| LineColor=143b80\n}}\n| ProdCode=3T5606\n| Viewers=6.16\n| ShortSummary=Hillary dupes her parents when she introduces them to a classmate she's pretending to date, but ends up going out with a much older guy. Meanwhile, Larry gets addicted to Vicky’s nicotine gum and Dave catches Vicky smoking. Guest starring Family Guy creator Seth MacFarlane as Hillary's older date.\n| LineColor=143b80\n}}\n| ProdCode=3T5605\n| Viewers=5.96\n| ShortSummary=Dave accuses an incensed Hillary of cheating on her SATs after she gets a surprisingly high score. Meanwhile, Vicky and Dave meet a couple who may be interested in more than friendship, and Dave asks Larry to take a client's daughter out on a date, only to find out that she isn't an ideal match for him. Includes a guest appearance by The Price Is Right announcer Rich Fields as a game show host.\n| LineColor=143b80\n}}\n| ProdCode=3T5607\n| Viewers= 6.64\n| ShortSummary=Dave thinks he sees Hillary in a \"Girls Gone Crazy\" video, however, he's relieved when it turns out he's mistaken. But he is completely freaked at being turned on by girls Hillary's age, though. So he turns to Vicky for inspiration after he throws out all of his \"visual aids\", and it begins to tire her out. Meanwhile, an edited version of the movie Goodfellas inspires Larry to replace swear words with the word \"love\", and Hillary prevents Mike from taking drugs by passing Midol off as the drug ecstasy.\n| LineColor=143b80\n}}\n| ProdCode=3T5608\n| Viewers=6.92\n| ShortSummary=Kenny's dad, Achmed, pulls up the rose bushes between his home and Dave and Vicky's, believing the property is his after an assessment. When Dave and Vicky disagree, the two families declare war on each other, putting Larry and Kenny in the middle. Meanwhile, Hillary jokingly tells Dave to choose her next boyfriend since he's never happy with the boys she picks. Dave meets a boy who reminds him of himself, and against her better judgment, Hillary agrees to go out with him. Mike experiments with nudism much to Dave's chagrin.\n| LineColor=143b80\n}}\n| ProdCode=3T5609\n| Viewers=4.19\n| ShortSummary=Fearing they're in a rut, Vicky tries to take Dave to a wine appreciation course, but he refuses, and later makes fun of her because she goes without him. Meanwhile, Dave assumes Larry is serving his new, older \"ladyfriend\" more than just the gourmet meals he prepares for her, and is offended that he isn't mentioned in Hillary's video blog.\n| LineColor=143b80\n}}\n| ProdCode=3T5610\n| Viewers=4.32\n| ShortSummary=Dave is tired of Larry and Mike's constant fighting and suggests that Mike try harder to have a relationship with his brother. Much to Dave's disappointment, Mike actually prefers hanging out with Larry to practicing for basketball tryouts, and worries that Larry's nerdy ways are starting to rub off on him. Meanwhile, Hillary sets out to prove she's more than just a pretty face by trying to get a blind guy interested in dating her.\n| LineColor=143b80\n}}\n| ProdCode=3T5611\n| Viewers=4.55\n| ShortSummary=Kenny confronts Dave after hearing that he thinks he's gay, and ends up coming out of the closet to him. Dave suggests to him that he tell his parents, but when Kenny tells them, they kick him out of the house, forcing Kenny to temporarily bond with Larry. Meanwhile, Hillary goes on a date with a blind guy she met at the coffeehouse, but she quickly gets tired of having to describe everything to him.\n| LineColor=143b80\n}}\n| ProdCode=3T5612\n| Viewers=4.36\n| ShortSummary=After Kenny reveals he's gay, his parents kick him out. The Golds let him move in, but soon Larry becomes jealous of his closeness with Dave and Vicky. Meanwhile, Dave angles for the corner office at work for which he is very interested. However, the other co-workers are interested as well, which escalates into an office war.\n| LineColor=143b80\n}}\n| ProdCode=3T5613\n| Viewers=4.32\n| ShortSummary=After watching \"An Inconvenient Truth\" documentary on television, Dave becomes obsessed with saving the environment. Meanwhile, Hillary prepares for a college admissions interview and is very nervous, prompting Vicky to try to calm her.\n| LineColor=143b80\n}}\n| ProdCode=3T5614\n| Viewers=4.77\n| ShortSummary= Dave puts the kids on a strict allowance, since they're always asking him for money. Vicky supports him on this... that is, until she, too, is put on a budget and is unable to buy the Prada boots she's always wanted. Meanwhile, after spending all his allowance money on the first day at Medieval Times, Larry asks Mike to loan him some money. And, in order to earn some extra money, Hillary starts an escort service for the nerdy boys at school.\n| LineColor=143b80\n}}\n| ProdCode=3T5615\n| Viewers=4.47\n| ShortSummary=Larry wears Dave's jacket to school, and ends up getting suspended after marijuana is discovered in the pocket. Martin Mull guest stars as Principal Fink. Also, Mike tries to seduce a Catholic priest to prove his suspicions that the priest is attracted to young boys after he thinks the priest tries to come onto him. Mike gets surprised when the disgusted priest confronts Dave and Vicky about Mike's flirtatous behavior.\n| LineColor=143b80\n}}\n| ProdCode=3T5616\n| Viewers=4.39\n| ShortSummary=Vicky's mom Betty and her boyfriend Sid announce their engagement and upcoming wedding in St. Martin and invite the entire family to join them. But when Sid goes too far with a stripper, Dave wonders whether or not to tell Betty and risk losing the free trip. Kenny goes on a date with an ex-boyfriend of Hillary's so Dave has an awkward conversation with him about gay safe-sex, while Hillary worries she may have a knack for turning men gay. Guest starring George Segal as Sid and Jamie Farr as Sid's friend Albert.\n| LineColor=143b80\n}}\n| ProdCode=3T5617\n| Viewers=4.79\n| ShortSummary= The kids are excited about the school's Sadie Hawkins dance, and even Kenny has a date. Once word gets out that Kenny's planning on attending with another guy, he and his date are barred from the event for not keeping with the Sadie Hawkins tradition. Once Principal Fink (Martin Mull) finds out that Kenny has been living with the Golds, he informs Dave that he's obligated to tell Child Services, and that Kenny will have to be put in foster care. So Dave tries to get Kenny's parents to let him come home.\n| LineColor=143b80\n}}\n| ProdCode=3T5618\n| Viewers=4.26\n| ShortSummary=Due to cutbacks at work, Dave and his two co-workers quit their jobs and start their own business. Meanwhile, Hillary decides to join the Army after not receiving any college acceptance letters. However, Dave realizes that she wants to go to the Army because she met a young soldier and took a liking to him. Meanwhile, Dave has an argument with Larry after he refuses to get his driver's license.\n| LineColor=143b80\n}}\n| ProdCode=3T5619\n| Viewers= 3.42\n| ShortSummary=Larry meets with a music executive who wants him to make a demo after hearing a song he composed for a website. After learning about this, Dave reveals that he considered himself to be the original white rapper in high school, known as The White Shadow, and offers to help Larry with the lyrics. He wants to show him the support his own father didn't show him. Meanwhile, tired of being mistaken for an Olsen twin, Mike decides to bulk up, but after learning that he must abstain from masturbation, he becomes generally grumpy. Hillary begins to question Taye's motives when he tells her he loves her. Episode includes a cameo of Tila Tequila\n| LineColor=143b80\n}}\n| ProdCode=3T5620\n| Viewers=3.56\n| ShortSummary=After Vicky and Dave have a car accident, they decide it's time to revisit their living wills and other legal documents. They also decide to ask their friends Jeff and Mindy to be guardians of their children if they ever become incapacitated. Jeff and Mindy explain that they can't accept because they've already agreed to do the same thing for other friends. Disagreements start to flare up between Vicky and Dave once they start working with an attorney, and they end up having a big fight. Larry finds a draft of a post-nup agreement and assumes his parents are getting a divorce. To save their family, he and the other kids set a \"parent trap\" to force Dave and Vicky back together.\n| LineColor=143b80\n}}\n| ProdCode=3T5621\n| Viewers=3.65\n| ShortSummary=Larry reveals that he suffers from social anxiety disorder and Dave and Vicky put him on medication to help him become more comfortable with who he is, but Larry refuses to take them and accuses his parents of wanting to change him. Meanwhile, as Hillary prepares for prom, Dave is convinced she plans on losing her virginity on prom night and Vicky has an awkward talk about sex with her. Dave makes fun of Mike for taking fencing class.\n| LineColor=143b80\n}}\n| ProdCode=3T5622\n| Viewers= 2.85\n| ShortSummary= In the second season and series finale, with Hillary's graduation only three weeks away, David and Vicky plan her graduation party, only to find out she may not even graduate because she's failing her gym class. Luckily, Dave is able to convince the principal to give her another chance, and volunteers to become Hillary's personal fitness trainer so she can pass. Meanwhile, with Mike's help, Larry and Kenny plan a school prank to get revenge on the seniors who have been harassing them. At the same time, Dave and Vicky planned on doing contraceptive surgery, only to find out neither of them went through with the procedure, and Vicky may be pregnant.\n| LineColor=143b80\n}}\n}}\nReception\nCritical response\nThe show originally received negative reviews from critics, scoring a 28 out of 100 on Metacritic and 24% on Rotten Tomatoes. It received critical acclaim during its second season for its handling of Kenny's \"coming out\" story arc, including a Humanitas Prize nomination for Lotterstein, as well as a GLAAD Media Award nomination for \"Outstanding Comedy Series\".\nRatings\n{|class=\"wikitable\" style=\"text-align: center\"\n!Season !! Timeslot (ET) !! Episodes !!First aired  !!Last aired!! viewers(millions) !! Rank\n|-\n| 1 || Sunday at 8:30 pm (Episodes 1-19, 20-22)Sunday at 9:30 pm (Episode 20)\n|22 ||September 11, 2005 || April 30, 2006 || 7.2 || #82\n|-\n| 2 || Sunday at 9:30 pm (Episodes 1–8)Thursday at 8:30 pm (Episodes 9–17)Sunday at 7:30 pm (Episodes 18–21)Sunday at 7:00 pm (Episode 22)||22 ||September 10, 2006 || April 22, 2007 || 4.9 || #118\n|}\nAwards and nominations\n{| class=\"wikitable sortable\"\n|-\n! Year\n! Award\n! Category\n! Nominee(s)\n! Result\n! class=\"unsortable\"|\n|-\n|rowspan=4|2006\n|Art Directors Guild\n| TV – Multi-Camera Television Series\n| data-sort-value=\"Shaffner, John\" |John Shaffner (production designer)\n|\n| style=\"text-align=\"center;\" |\n|-\n|rowspan=3|Teen Choice Awards\n| TV – Choice Comedy/Musical Show\n| data-sort-value=\"War at Home, The\" | The War at Home\n|\n| style=\"text-align=\"center;\" |\n|-\n| TV – Choice Actor: Comedy\n| data-sort-value=\"Rapaport, Michael\" | Michael Rapaport\n|\n| style=\"text-align=\"center;\" |\n|-\n| TV – Choice Parental Unit\n| data-sort-value=\"Barone, Anita & Michael Rapaport\" | Anita Barone & Michael Rapaport\n|\n| style=\"text-align=\"center;\" |\n|-\n|rowspan=2|2007\n|Humanitas Prize\n| TV – 30-Minute Category\n| data-sort-value=\"Lotterstein, Rob\" | Rob Lotterstein\n|\n| style=\"text-align=\"center;\" |\n|-\n|Young Artist Award\n| TV series – Best Supporting Young Actor\n| data-sort-value=\"Collins, Dean\" | Dean Collins\n|\n| style=\"text-align=\"center;\" |\n|-\n|rowspan=2|2008\n|GLAAD Media Award\n| TV – Outstanding Comedy Series\n| data-sort-value=\"War at Home, The\" | The War at Home\n|\n| style=\"text-align=\"center;\" |\n|-\n|Young Artist Award\n| TV series – Best Supporting Young Actor\n| data-sort-value=\"Collins, Dean\" | Dean Collins\n|\n| style=\"text-align=\"center;\" |\n|}\nHome media\n{| class=\"wikitable\"\n!Complete\nSeason\n!DVD Release dates\n!Additional features\n|-\n!1\n|May 15, 2007\n|\n* Featurette: Living Room Confessions\n* Unaired Scenes\n* Gag Reel\n|-\n!2\n|\n|\n|}\nReferences\nExternal links\n*"
    }
  ]
}