{
  "content": [
    {
      "type": "text",
      "text": "# The Battle of Calverhine\n\n| medium = Collage on cardboard and paper\n| height_imperial = 37.4\n| width_imperial = 116.6\n| imperial_unit = in\n}}\nThe Battle of Calverhine is a panoramic collage created around 1930 by Henry Darger, an American recluse generally described as an outsider artist. The largest of his collages at  tall and  long, it depicts a chaotic battle scene in a forested environment. Darger made the piece by pasting hundreds of source images clipped out from black-and-white photographs and illustrations, many line engravings of scenes in American military history. He then hand-colored the piece, giving the soldiers red uniforms, and hand-drew some of the trees. Explosions and smoke clouds dot the image.\nDarger applied thick layers of varnish to the work, creating an uneven texture and darkening it with age; much of it is now extremely difficult to make out with the naked eye, although it can be seen more clearly in photos taken with polarizing filters. Darger built a rudimentary frame and layered on cardboard and newspaper as backing. It, alongside roughly 35 of his other collages, was seemingly intended to illustrate his 15,000-page fantasy epic In The Realms of the Unreal, which details a fictional war between a coalition of Christian nations and the child-enslaving Glandelinians. Within the story, the Battle of Calverhine was the opening salvo of the war, as a group of child slaves rebelled against their captors; however, all the figures in the collage appear to be adults on the same side of the conflict, while the Glandelinians and the story's protagonists, the Vivian Girls, are absent. Art critics such as Roberta Smith have praised the work for its chaotic construction, although Darger biographer John MacGregor notes that it is difficult to make out the details of the scene even without the varnish. Darger moved away from collage soon after making The Battle of Calverhine, instead focusing on watercolors incorporating tracings from other art. His work was discovered by others only shortly before his death in 1973.\nBackground\nHenry Darger was an American artist and writer who was reclusive throughout his life. His art was not discovered by others until shortly before his death in 1973, and he is generally associated (although not unambiguously) with the outsider art or  movement, referring to self-trained artists who exist outside of the professional art community. Raised by his disabled father in Chicago, he was sent to a children's asylum before escaping in 1910 at the age of 18. Around this time, while working as a janitor in Chicago, he began a massive fantasy novel entitled The Story of the Vivian Girls, in What is Known as the Realms of the Unreal, of the Glandeco–Angelinian War Storm, Caused by the Child Slave Rebellion, detailing a war between a coalition of Christian nations and the child-enslaving Glandelinians on a fictional planet. Much of the book consists of elaborate descriptions of battles in intense detail; the art historian Michael Bonesteel described it as a \"succession of battles, ripping yarns, talky interludes, descriptions of cataclysms, ad infinitum\". It totaled over 15,000 pages by its completion around the 1930s.\nDarger began experimenting with visual art to accompany In The Realms of the Unreal at some point in the 1910s. His earliest pieces consisted of hand-tinting black-and-white photographs and illustrations in order to depict military leaders from the story. Around 1918, he produced a large series of around seventy portraits of generals, traced from photographs and then colored in. These were then mounted on cardboard and labeled, often with accompanying text describing their achievements in the war. He also began depicting battles and events in the novel; initially these were made by overpainting existing illustrations (often of battles in the American Civil War or the First World War) with watercolors, pencil, and crayon.\nIn addition to overpainting collected illustrations and photographs, Darger also began making collages. He began piecing together larger battle scenes from multiple different illustrations, which he then painted over in watercolors. Small elements of other images, such as trees, hills, flags, and structures, were cut out and pasted to form a background. Many of these were created on both sides of a sheet of paper which he then varnished. These double-sided collages were seemingly intended to be inserted into the book as illustrations. Some of his largest and most detailed collages depict ruined cities, with many large groups of soldiers and weapons pasted atop a collage of ruined buildings from initially unrelated source material, alongside dead trees which he hand-drew onto the image. Many of these collages feature soldiers colored with blue-and-red uniforms. Although they are presumably intended to illustrate scenes from In The Realms of the Unreal, most of his collages feature no labels to identify what battle within the story they were intended to illustrate. Thirty-five of his collages are known to exist, although some of these appear to be unfinished.\nDescription\nThe Battle of Calverhine is a panoramic collage measuring , including its frame. The collage, which consists of images pasted onto paper and cardboard layers that were then colored over, depicts a large forested battlefield from an aerial perspective. At the bottom is a foreground composed of the largest figures, some dead or dying, others manning artillery and charging into battle. Above this initial foreground layer are progressively smaller armies and lines of soldiers, intermixed with explosions and large cut-outs of trees and patches of forest. Further up, a background of smoke and explosions slowly transition to a night sky at the top of the collage, where small cutouts of stars, planets, and galaxies are arranged in the top-right corner. A small label is placed in the top-left of the piece, with handwritten text naming it. There is no clear focal point, with various interconnected scenes and events taking place across the collage.\nThe collage incorporates hundreds of cut-out source images. Explosions and small cut-outs of fire and smoke (sourced from comic books) dot the piece, with some flinging soldiers and their body parts into the air. Some of the soldiers are dead or bleeding out, appearing to be hit by bullets or shrapnel. Much of the source material for the collage is sourced from line engravings of scenes in American military history, which Darger colored over, rendering the soldiers in red uniforms. Two copies of a clipping of three men firing artillery were used in the collage, differentiated by coloring. Many tall, barren trees are distributed throughout; some of these have been pasted from other illustrations, while others have been hand-drawn. The top of the piece features intricate cloudscapes, recalling Darger's lifelong interest in weather.\nDarger applied thick layers of varnish to the work. Some of his hair, affixed during varnishing, remains stuck to the canvas. The collage has an uneven and crumpled texture. A few bits of clouds and smoke on the right side were applied after the rest of the work had been completed and varnished. The thick layers of varnish have blackened with age, rendering most of the elements of the collage extremely difficult to make out with the naked eye, though the label for the collage near the top-left remains faintly visible. Photos taken with a polarizing filter allow the piece to be discerned much more clearly.\nThe Battle of Calverhine was one of Darger's first major artworks, and is his largest collage (and one of his largest artworks overall). Unlike the vast majority of his work, Darger constructed a rudimentary frame for the piece. This frame consists of two wooden rectangles shaped into frames at the front and back of the picture and held together with nails, with the collage itself affixed between them. An extremely high number of finishing nails were hammered through the work to help hold it together, although these have since fallen off. Newspaper pages from August 28, 1929, were layered on as backing, as were sheets of corrugated cardboard. A label on the cardboard gives the date January 31, 1930. These dates allow the collage to be properly dated, unique among Darger's artwork.\nIn 1932, Darger moved several blocks from his boarding house to the rooming house at 851 Webster Avenue, where he would spend most of the rest of his life. He hung the collage up at his new unit, where it occupied almost an entire wall of the room. It was the only one of his works that he hung on his walls.\nContext and interpretation\nTaking place shortly before the events of the story, the Battle of Calverhine is described in In The Realms of the Unreal as the opening salvo of the Abbieannia-Glandelinian War. A large group of child slaves led by Annie Aronburg rebelled against their captors in Glandelinian-occupied Calverinia in 1910. This leads to a massive battle which killed tens of thousands on both sides. The child rebels' courage and the Glandelinian atrocities against them inspire Abbieannia and its allies to join the war. Shortly after the battle, Phellinia Tamerline (an Angelinian defector to Glandelinia) assassinated Aronburg, causing her to become a martyr figure throughout the narrative. Unlike the story and Darger's later artwork, the figures are all depicted as adults in the collage—the ubiquitous Vivian Girls, the protaganists of In The Realms of the Unreal, are entirely absent—and none of the Glandelinians appear.\nThe painting's grand and chaotic depiction of warfare recalls contemporary American depictions of battlefields (frequently of the American Civil War and the First World War) and cyclorama paintings of historical events. Art historian Mary Trent theorized that the collage may have been inspired by the 1930 film All Quiet on the Western Front due to its chaotic depiction of the mass slaughter of soldiers. New York Times art critic Roberta Smith described the collage as a \"staggering work, leathery and reliclike\", praising its chaotic and congested composition. Darger biographer John MacGregor praises The Battle of Calverhine for \"embodying in purely visual terms the tragedy described in endless detail in The Realms\", but notes that it is extremely difficult to decipher what is happening in the work from a distance, even without the damage from the varnish. He theorizes that Darger, heavily immersed in the piece while working on it, may have been unaware of this effect until after its completion.\nThe collage differs from Darger's other large works due to its reliance on collaging instead of tracing. Darger soon abandoned the use of both cardboard and varnish, leading to a significantly different aesthetic in The Battle of Calverhine than in many of his other works. Around the 1930s, he moved away from collage in favor of tracing his source material, which he then altered freehand. MacGregor suggests that he may have abandoned collage due to the inability to depict the specific scenes and fantastical elements of his narrative accurately; his later work focuses almost exclusively on the Vivian Girls and the Glandelinians, with much more unified compositions even in very complex scenes.\nReferences\nBibliography\n*\n*\n*\n*\n*\n*\n*\n*"
    }
  ]
}