{
  "content": [
    {
      "type": "text",
      "text": "# The Swarm (TV series)\n\n| music              = Dascha Dauenhauer\n| director           =\n| based_on           =\n| starring           =\n| cinematography     =\n| country            =\n| language           =\n| num_series         =\n| num_episodes       = 8\n| list_episodes      =\n| editor             =\n| executive_producer =\n| producer           =\n| runtime            = 46 minutes\n| company            =\n| network            = ZDF\n| first_aired        =\n| last_aired         =\n| budget             =\n}}\nThe Swarm () is a German co-produced science fiction television series directed by Barbara Eder, Luke Watson and Philipp Stölzl. Adapted from the novel by Frank Schätzing, the series depicts the struggle with aggression by a mysterious deep sea intelligence that is reacting to human-caused environmental damage.\nProduced with an estimated budget of , the most expensive German TV production (produced in English) of all time, it had its world premiere at 73rd Berlin International Film Festival in Berlinale Series on 19 February 2023, where the first three episodes were screened out of competition. The Swarm premiered on ZDF between 22 February and 8 March 2023.\nCast\n* Cécile de France as Dr. Cécile Roche\n* Alexander Karim as Dr. Sigur Johanson\n* Leonie Benesch as Charlie Wagner\n* Joshua Odjick as Leon Anawak\n* Takuya Kimura as Aito Mifune\n* Krista Kosonen as Tina Lund\n* Rosabell Laurenti Sellers as Alicia Delaware\n* Barbara Sukowa as Prof. Katharina Lehmann\n* Kim Mousa as Mesuli\n* Oliver Masucci as Captain Jasper Alban\n* Sharon Duncan-Brewster as Samantha Crowe\n* Claudia Jurt as Dr. Natalia Oliviera\n* Kari Corbett as Iona\n* Jack Greenlees as Douglas MacKinnon\n* Lydia Wilson as Sara Thompson\n* Takehiro Hira as Riku Sato\n* Klaas Heufer-Umlauf as Luther Roscovitz\n* Eidin Jalali as Rahim Amir\n* Franziska Weisz as Sophia Granelli\n* Andrea Guo as Jess\n* Rune Temte as Aaren Stone\n* David Vormweg as Tomas\n* Dutch Johnson as Jack Greywolf O'Bannon\n* Alba Gaïa Bellugi as Isabelle Roche\nEpisodes\n|ShortSummary    =\n|LineColor       = 016064\n}}\n|ShortSummary    =\n|LineColor       = 016064\n}}\n|ShortSummary    =\n|LineColor       = 016064\n}}\n|ShortSummary    =\n|LineColor       = 016064\n}}\n|ShortSummary    =\n|LineColor       = 016064\n}}\n|ShortSummary    =\n|LineColor       = 016064\n}}\n|ShortSummary    =\n|LineColor       = 016064\n}}\n|ShortSummary    =\n|LineColor       = 016064\n}}\n}}\nProduction\nDevelopment\nFrank Doelger announced in 2020 at Cannes, as part of the International Market for Television Programs (MIPTV), that his next TV series The Swarm was going to be the adaptation of novel The Swarm by Frank Schätzing. The series was produced by ZDF within the framework set by the European Alliance, with France Télévisions and RAI, and in co-production with ORF, SRF, Viaplay Group and Hulu Japan who formed the joint venture 'Schwarm TV Productions GmbH & Co KG'. The series is the first project from Doelger-led Intaglio Films, a joint venture formed in 2019 by the German production company Beta Film and ZDF Enterprises.\nProduced with an estimated budget of , this makes the series the most expensive German TV production (produced in English) of all time. In an interview, Barbara Eder confirmed that there are ideas already for a second season, but their implementation has yet to be decided after the figures for the first season have been evaluated.\nCasting\n]]\nThe international cast is selected by casting director Robert Sterne, and includes European actors, Cécile de France, Sharon Duncan-Brewster, Jack Greenlees, Lydia Wilson, Krista Kosonen, Alexander Karim, Leonie Benesch and German star Barbara Sukowa with Japanese actors Takuya Kimura and Takehiro Hira. American actors Rosabell Laurenti Sellers and Dutch Johnson, and Canadian Joshua Odjick also feature in the series.\nWriting\nThe script was written by Steven Lally, Marissa Lestrade, Chris Lunt and Michael A. Walker in consultation with experts, such as polar and deep-sea researcher Professor Antje Boetius, from the Alfred Wegener Institute, and Dr Jon Copley, professor of Ocean Exploration from the University of Southampton. Barbara Eder, Luke Watson and Philipp Stölzl directed the series.\nFilming\nFilming began on 7 June 2021 in Italy and Belgium. The final scenes of the series were filmed at a  underwater studio on the outskirts of Brussels.\nRelease\nThe Swarm had its world premiere at 73rd Berlin International Film Festival in Berlinale Series on 19 February 2023, where the first three episodes were screened out of competition. The Swarm is available for streaming on ZDF from 1 March 2023. It was also made available on RAI, France Télévisions, Viaplay, Movistar, ORF, SRF and Hulu Japan from March 2023. It began screening in Australia on 7 June on streaming service Binge. The US distribution rights were sold to The CW in May 2023; the series premiered on 12 September.\nReception\nMike McCahill reviewing for Variety wrote that the series is reassuringly straightforward and familiar.  McCahill opined, \"Its briny pulp – dredged from Frank Schätzing’s 2004 novel, preys heavily on viewer fears of ecological collapse, and what might be lurking for us all beneath the planet’s watery depths\".\nThe series featured in the list of six international dramas to watch in 2023, published by Deadline Hollywood. Oliver Armknecht reviewing for film-rezensionen.de graded the series 5 out of 10, criticised the visuals and opined that there was not much to do for the ensemble. In conclusion Armknecht wrote, \"The global threat can only be felt in a few places. If you don't know the story, you may be surprised at the strange occurrences, at least at first – especially since some maritime attacks are really perfidious.\"\nReferences\nExternal links\n*\n* [https://www.berlinale.de/en/2023/programme/202313662.html The Swarm] at Berlinale\n* [https://cineuropa.org/film/438605/ The Swarm] at Cineuropa\n* [https://www.zdf.de/serien/der-schwarm The Swarm] at ZDF in"
    }
  ]
}