{
  "content": [
    {
      "type": "text",
      "text": "# The King in the Window\n\nThe King in the Window is a children's fantasy novel written by American author Adam Gopnik, published in 2005 by Hyperion Books. The novel is about an American boy named Oliver who lives in Paris. Oliver stumbles into an ancient battle waged between Window Wraiths and the malicious Master of Mirrors, when the American boy is mistaken for a mystical king.\nThe novel received mixed reviews with critiques regarding novel's sophistication and mismatch with the target audience.\nBackground\nIn a 2005 interview with Charlie Rose, Gopnik explained that he was inspired to write the novel when he saw his own son celebrate Epiphany in Paris. Gopnik worked as a journalist in Paris just like Oliver's father in the book.\nPlot summary\nOn the night of Epiphany, after enjoying his piece of Epiphany kingcake and wearing a gold paper crown, Oliver gazes out the window. He is approached by a haunting vision of another boy in the reflection. This mysterious boy is a window wraith, and he mistakes Oliver for the new king. The window wraith boy calls Oliver to wield his sword and reclaim the kingdom, luring him into a journey of self-discovery that could save the world.\nThe window wraiths are a cadre of France's deceased poets and artists, such as Molière, who claim Oliver as the king who will save them from the evil force dwelling behind the mirrors of the world capturing the souls of those who stare too long. The element of mirrors in the book is also an ode to Lewis Carroll's Through the Looking-Glass and there is also a pivotal character who is a descendant of Alice Liddell.\nReception\nThe King in the Window received mixed reviews from critics, with multiple reviewers criticizing the novel for being too ambitious for the target audience.\nSchool Library Journal's Margaret A. Chang called the novel \"a fantasy that is as ambitious in theme, sophisticated in setting, and cosmic in scope as the works of Madeleine L'Engle\". Barbara Hoffert, writing for Library Journal, found that Gopnik \"crafted a first novel as engrossing as it is intellectually stimulating\".\nAlthough also calling to the novel as \"ambitious\", Publishers Weekly further referred to The King in the Window as \"complex and overly long\", especially given the novel's target audience. While they highlighted the novel's wit, they found that \"a lot of it is aimed at adults, as are references to Yoko Ono's singing, wine expert Robert Parker, book royalties, etc.\"  Similarly, Kirkus Reviews wrote, \"Gopnik’s work for the New Yorker is beautiful and elegant, but he has fallen prey to the contemporary disease that condemns adult writers and celebrities—writing a children’s book once they have children of their own; his overstuffed fantasy is next to impossible to endure.\"\nLooking to the story development, Hoffert argued that readers will \"discover an entertaining, intricately plotted adventure story whose pages just keep turning\". Chang noted that \"the story starts slowly, for its complicated and rather far-fetched premises require quite a bit of exposition, but rises to an action-packed climax\". Booklist's Ilene Cooper added that \"the history of the wraiths and their battle with the malevolent Master of the Windows seems, at times, interminable and is so filled with twists and turns that it would be impossible to follow if Gopnik did not periodically recap; the confusion wrought by stepping through a mirror takes on a literal meaning for the readers\". Publishers Weekly added that \"the resolution, though well-orchestrated, is dizzyingly complicated\".\nChang found the novel's strengths to be \"its engaging characters and its lovingly and specifically evoked setting\". Cooper agreed with this sentiment.\nReferences"
    }
  ]
}