{
  "content": [
    {
      "type": "text",
      "text": "# The Imaginary 20th Century\n\nThe Imaginary 20th Century is a historical comic novel written by Norman M. Klein in collaboration with Gilded Age historian Margo Bistis. It is available in print (2016) and as an e-book with a companion narrated media archive (2014). The novel originated as an interactive archive with related solo and group exhibitions prior to publication. In 2012, Klein and Bistis coined the term \"wunder-roman\" to describe their alternative genre. As described in the novel, this term references a mythical 19th-century version of the picaresque novel where the layers—as story roll along a water wheel.\nInteractive archive\nThe original documents, and the curatorial idea for The Imaginary 20th Century, evolved out of Bistis’ research for “Comic Art: The Paris Salon in Caricature,” a 2003 exhibition organized by the Getty Research Institute. Klein and Bistis started work on the project with support from California Institute of the Arts, though principal support came from ZKM/Center for Art and Media Karlsruhe and the Graham Foundation for Advanced Studies in the Fine Arts.\nand Margo Bistis during \"The Future of the Future.\" 2010. DOX: Centre for Contemporary Art. Prague. Czech Republic.]]\nThe first iteration of The Imaginary 20th Century interface was built by Andreas Kratky, Klein’s collaborator on Bleeding Through.  It premiered in 2007, in \"YOU-ser: The Century of the Consumer,\" an exhibition organized by ZKM/Center for Art and Media Karlsruhe, followed by solo shows at Orange County Museum of Art and ShowKonstfack, and a group show organized by the Ben Maltz Gallery of Otis College of Art and Design.  After considerable redevelopment, the second iteration was built in collaboration with Blanka Earhart directing the interface design; interface production by Luke Domagalski and Raphael Arar; illustrations by Nick Lu; sound compositions by Aaron Drake and Kari Rae Seekins, with additional music by Raphael Arar. It premiered in the 2010 exhibition “The Future of the Future,” curated by Jaroslav Andĕl for the DOX: Centre for Contemporary Art Prague. The Imaginary 20th Century was included in \"The Digital Body: The 3rd International Exhibition on New Media Art- Part 2\" at the [http://cicamuseum.com/ CICA Museum]. For \"The Future Can Only be Told in Reverse\" organized by the College of Creative Studies at the University of California, Santa Barbara, thirteen artists presented works produced in response to the interactive archive and novel. A solo show organized by the University of Maryland Art Gallery featured an installation of \"7 Pieces from Carrie's Archive\" drawn from university archives and special collections.\nThe novel\nThe genre wunder-roman captures the mental imagery of navigating various components such as a narrated, media archive layered with sound or a comic historical novel accompanied by essays. Each component stands alone, yet they work together like the lyrics and music of an opera. In the novel, the massive privately held “Carrie’s archive” (1917-1936) contains 2000+ documents affixed to cards stored inside a circuitous room and mechanically accessible much like garments stored on dry-cleaner racks. The novel’s guiding principle is announced in the first chapter: “The future can only be told in reverse.”\nSubscribers to the online package (the underlying archive and ebook of the novel) gain access to the underlying archive: “photographs, films, comic illustrations, scientific and medical imagery, industrial designs, architectural drawings and ephemera like postcards, stereocards, and maps” spanning 1885 to 1925. Each component reveals different aspects of this progress \"blown off course.\"\nLiterary critic Jan Baetens considers The Imaginary 20th Century a \"contemporary version of the classic 'great American novel', [yet] seen from a more global perspective, since [it] includes a large number of paratextual and metatextual material.\" It thus resembles a picaresque, the 16th century Spanish prototype of the modern novel whereby episodic narratives feature shysters and humble survivors in a nearly hopeless world.\nCharacters\n*Albert, always in debt, Carrie's second husband\n*Adaline, Carrie's step-daughter who looks like Carrie\n*Gus Angewynne, Carrie's father, a failed con-man\n*Lynn Angewynne, Carrie's mother whom she hadn't seen in twenty years\n*Carrie Angewynne, the protagonist\n*Charles A. Barney, impersonates a famous New York banker\n*Charles T. Barney, the powerful banker linked to the 1907 Financial Panic\n*Natalie Barney, a famous American lesbian poet and Parisian socialite\n*Hy Barney, a New York anarchist, one of Carrie's four suitors\n*Harry Brown, Carrie's uncle who spent \"over forty years ... erasing crimes that might prove embarrassing\n*Bruce Bungel, FBI operative in pursuit of Harry Brown\n*William J. Burns, founder of a leading detective agency of the early twentieth century\n*Edgar Rice Burroughs, writer best-known for novels on Tarzan and on John Carter of Mars\n*Harry Chandler, the leader of the booster oligarchs of Los Angeles\n*Clarence Darrow, the great progressive lawyer\n*Eugene V. Debs, a socialist leader who also ran for president of the U.S.\n*Edward Doheny, shanty Irish oil mogul in Los Angeles\n*Ignatius Donnelley, U.S. congressman, a utopianist and presumed discover of the secrets of Atlantis\n*Marcel Duchamp, masterful French artist, inspired by Oncken's description of Carrie as \"The Bride Stripp'd Bare\"\n*Albert Fall, secretary of the interior who was caught in the teapot dome scandal\n*O.B. Fisk, mercurial right-wing socialist editor\n*Short, ugly Fred, Adaline's friend and admirer connected to the nascent film industry in the early 1920s\n*Karl Friedrich (Schneider), Swiss businessman, one of Carrie's four suitors\n* Euphrosina van Heger, Carrie's Belgian chaperone and nurse\n*Hannes Hulscholler, Director of the Zukerkandl nerve clinic and spa in the Vienna Woods\n*Madame Hulscholler, Director of the Zukerkandl and theosophist\n*Henry Huntington, founder of the vast Los Angeles trolley system\n*Friedrich Karl, Swiss entrepreneur and sponsor of the Science and Crafts movement\n*Gaston Lesage, Algerian colon with a Buffalo Bill fetish, one of Carrie's four suitors\n*André Laurie, radical author and inventor, friend of French writer Jules Verne\n*Thaddeus S. C. Lowe, the so-called balloonist who invented an American aeronautics industry in the late nineteenth century\n*J. P. Morgan, the most powerful capitalist in turn-of-the-century America\n*McNamara Brothers, the union organizers who blew up the LA Times building in 1910\n*Sylvanus (Vay) Morley,\n*D. L. Oncken, famous philosopher-misanthrope of the early twentieth century\n*General Harrison Gray Otis, publisher of the Los Angeles Times, the pugnacious leader of the oligarchs of Los Angeles\n*Paul Otlet, Belgian archivist, founder of the Mundaneum in Brussels\n*Ted (Thaddeus), the perverse scion of a wealthy Chicago family, Carrie's first husband\n*President Theodore Roosevelt\n*Willie Roy Shadbolt, an operative for hire usually for problems involving espionage\n*Otto Turner, Boston doctor of nervous diseases, one of Carrie's four suitors\n*Sally Turner, Otto Turner's wife, and one of Carrie's intimate friends\n*George Vallotin, a murderer whose identity was erased by Harry Brown\n*Washovsky, Harry's beleaguered and mercurial quality\n*President Woodrow Wilson\n*Secretary Zimmerman, the German ambassador to Mexico who received the dangerous Zimmerman telegram, 1917\nThe essays\nPart II of the book contains four essays: on the curating of the archive; on “picaresque disasters”; on the future city; and on the “automated utopia.” This serves as another layer, but also as a hinge between the media narrative and the novel.  Readers and viewers make the transit from fiction to scholarship, and back again, from narrative hooks in the story, to spaces between the images.\nReferences\nExternal links\n*"
    }
  ]
}