{
  "content": [
    {
      "type": "text",
      "text": "# The Kingdom (Bush album)\n\n* grunge\n|}}\n| length     = 47:13 (standard)73:03 (deluxe)\n| label      = BMG\n| producer   =\n| prev_title = Black and White Rainbows\n| prev_year  = 2017\n| next_title = The Art of Survival\n| next_year  = 2022\n| misc       =\n}}\nThe Kingdom is the eighth studio album by English rock band Bush. It was originally scheduled to be released in May 2020 but it was later pushed back to a release date of 17 July 2020. The band released two singles prior to the album, the first being \"Bullet Holes\" which was released in May 2019 and featured in the film John Wick: Chapter 3 – Parabellum, and the second single off the album was \"Flowers on a Grave\" and was released one year later in March 2020.\nAlthough in part continuing the electronic-tinged alternative sound of the band's other post-reunion efforts, The Kingdom featured a harder sound than some of its previous efforts, with the songs being driven by guitar riffs and the sound recalling earlier Bush work from the 1990s and early 2000s; a review of its 2022 follow-up album stated that The Kingdom \"repositioned\" Bush as \"riff-driven heavyweights\". Described by frontman Gavin Rossdale as \"snapshots of real life\", the album's lyrics included many personal themes such as being misunderstood, taking major decisions and rising above challenges.\nBackground and title of album\nFrontman Gavin Rossdale told Loudwire in May 2018 that he intended to release a \"heavier\" successor to 2017's Black and White Rainbows, with Rossdale intending to begin recording following the conclusion of the band's Summer 2018 tour. In May 2019, Bush set The Mind Plays Tricks on You as the title of their new studio album, tentatively due in fall 2019. This provisional title is a lyric in the album track \"Undone\".\nRecorded in Los Angeles, The Kingdom was the first Bush album on which Robin Goodridge did not perform, who had played as the drummer for the band since 1993. This left Gavin Rossdale as the only remaining member from the lineup that recorded the first four Bush studio albums from Sixteen Stone (1994) to Golden State (2001), prior to the group's 2002 hiatus.\n\"Bullet Holes\", which would become the album's first single, was released on 17 May 2019 simultaneously with the Keanu Reeves action film John Wick: Chapter 3 – Parabellum, in which the track is featured during the end credits.\nIn March 2020, Bush formally announced their new album, re-titled The Kingdom, slated for a May 2020 release. The announcement was simultaneous with the release of the album's second single \"Flowers on a Grave\".\nThe Kingdom was released on 17 July 2020, with its released having been delayed by 2 months due to the COVID-19 pandemic.\nContent\nGavin Rossdale remarked in May 2018 that the next Bush album would contain \"heavier\" songs written from an \"angrier perspective\".\nAccording to The Upcoming, Bush brought \"electronic-laced alternative rock\" to the new record, comparable to their previous effort Black and White Rainbows. Conversely, Kerrang! stated that The Kingdom presented \"a far heavier, more riff-based and muscular approach\" that its 2017 predecessor. Rolling Stone Magazine opined The Kingdom to be a grunge effort, akin to the band's earliest work.\nGavin Rossdale described the lyrics of The Kingdom as \"snapshots of real life and cycles of attrition\". \"Send in the Clowns\" chronicled feelings of being misunderstood, \"Crossroads\" recounted taking decisions in life, while \"Falling Away\" narrated a feeling of personal freedom. Rossdale remarked in an interview with LouderSound that \"Our Time Will Come\" relayed \"looking through anything bleak in your life and realising that amazing things are happening and amazing things will come\". \"Blood River\" was inspired by the \"blood red\" colour of the water at The Devil's Pulpit, a gorge in Finnich Glen, Stirlingshire, Sctotland.\nReception\n| rev2 = American Songwriter\n| rev2Score =\n| rev3 = Entertainment Focus\n| rev3Score =\n| rev4 = Kerrang!\n| rev4Score =\n| rev5 = Rolling Stone\n| rev5Score =\n|}}\nThe Kingdom received an aggregate score of 57/100 from Metacritic suggesting \"mixed or average reviews\". Some critics praised the album for its riff-based sound, whilst others, such as Kory Grow of Rolling Stone, criticised the album as derivative.\nNeil Z. Yeung of AllMusic gave a very positive review of The Kingdom. Yeung stated that with the album, the band flipped the \"unevenness and sonic confusion\" of the band's 2010s releases \"on their heads\" and in so doing, proved themselves more than a 1990s nostalgia act. Yeung called it \"an absolute bounty of riffs\" and to \"recall the best\" of past releases such as Golden State (2001) and The Science of Things (1999).\nMacie Bennett of American Songwriter gave a positive 4-out-of-5 star review, and opined that Bush \"may have released its best yet\" with The Kingdom.\nBritish publication Entertainment Focus gave a highly praising review, and remarked that the record saw Bush \"creating some of the most interesting, and diverse, music in the rock genre right now\", and that it was an \"addictive record\" that should \"see the band's popularity soar again\".\nA review by Paul Travers for Kerrang! was strongly positive. Although Travers acknowledged that \"naysayers\" would dismiss songs such as \"Ghost In The Machine\" and \"Crossroads\" as \"de-clawed Nirvana\", he described some moments on the album as \"excellent\". Travers hailed The Kingdom \"a return to Bush’s glory days\", awarding it 3 out of 5 stars.\nRolling Stone's Kory Grow gave mostly negative feedback, detailing that the songs \"trudge through the same monochromatic grunge\" of earlier releases. Grow further dismissed the record's music as derivative, commenting that the single \"Bullet Holes\" \"musically, rips off U2’s “Bullet the Blue Sky”\".\nTrack listing\n| length1         = 3:45\n| title2          = The Kingdom\n| writer2         =\n| length2         = 3:47\n| title3          = Bullet Holes\n| writer3         =\n| length3         = 3:47\n| title4          = Ghosts in the Machine\n| writer4         =\n| length4         = 4:15\n| title5          = Blood River\n| writer5         =\n| length5         = 4:20\n| title6          = Quicksand\n| writer6         =\n| length6         = 3:59\n| title7          = Send in the Clowns\n| length7         = 4:13\n| title8          = Undone\n| length8         = 5:02\n| title9          = Our Time Will Come\n| length9         = 3:50\n| title10         = Crossroads\n| length10        = 3:15\n| title11         = Words Are Not Impediments\n| length11        = 3:08\n| title12         = Falling Away\n| length12        = 3:52\n| total_length    = 47:13\n}}\n| length13        = 4:09\n| title14         = Beware False Prophets\n| length14        = 4:40\n| title15         = Live Another Day\n| length15        = 3:35\n| title16         = Undone\n| note16          = featuring Mike Garson\n| length16        = 5:51\n| title17         = Flowers on a Grave\n| note17          = Live in Los Angeles\n| writer17        =\n| length17        = 3:48\n| title18         = The Kingdom\n| note18          = Live in Los Angeles\n| writer18        =\n| length18        = 3:47\n| total_length    = 73:03\n}}\nPersonnel\n*Gavin Rossdale – lead vocals, rhythm guitar\n*Chris Traynor – lead guitar, backing vocals\n*Corey Britz – bass guitar, backing vocals\n*Gil Sharone – drums (all tracks except “The Kingdom” & “Flowers on a Grave”)\n*Nik Hughes – drums\nCharts\n{| class=\"wikitable sortable plainrowheaders\" style=\"text-align:center\"\n|+Chart performance for The Kingdom\n|-\n! scope=\"col\"| Chart (2020)\n! scope=\"col\"| Peakposition\n|-\n|-\n|-\n|-\n|-\n|-\n|-\n|}\nSee also\n*List of 2020 albums\nReferences"
    }
  ]
}