{
  "content": [
    {
      "type": "text",
      "text": "# The Fairy Queen (Fablehaven)\n\n}}\nThe Fairy Queen is a character in Brandon Mull's children's fantasy series Fablehaven.\nIn the books\nFablehaven\nThe fairy queen shrine at Fablehaven is located in a beautiful park, on an island in the middle of a naiad pond. Unworthy visitors are instantly obliterated, as goes the story of the caretaker who was turned into dandelion fluff. Kendra, however, must visit the Fairy Queen for help to save her family, and Fablehaven from Muriel and Bahumat. Kendra would end up walking on her island and living and then the Fairy Queen would help her summon the fairies to war and save Fablehaven.\nFablehaven: Grip of the Shadow Plague\nIn Grip of the Shadow Plague, it is said early in the book by a fairy at the Fairbanks' that Kendra can make orders in the name of the Queen. Kendra makes some of these orders. Later in the book, Kendra once again goes to the Fairy Queen's shrine to seek help. The Queen introduces herself not as \"a fairy\" but as \"the fairy\", the mother, the eldest sister. She does not dwell on earth, but in a different realm where she cannot be tainted by dark magic. Her only portals to the human world are through her shrines located on some of the magical preserves. The Queen would destroy the shrine at Fablehaven and transfer the energy into a single object, a stone, that can destroy the nail that caused the plague. The stone would end up saving Fablehaven, but it killed Lena, and the Fairy Queen's shrine at Fablehaven would be destroyed.\nFablehaven: Secrets of the Dragon Sanctuary\nIn the fourth book, the Fairy Queen briefly appears at Wyrmroost when Kendra is seeking help at the dragon sanctuary. The Queen explains her feelings concerning the history of the Astrids, golden owls with human faces. Kendra is confused because the Fairy Queen is still upset about the astrids' failure. The Fairy Queen partially gives in to Kendra's request to give the astrids another chance.\nFablehaven: Keys to the Demon Prison\nIn the fifth book, she has no wings (but still flies) and is a unicorn in human form. She was able to forgive the astrids in spite of their \"failure\". The Fairy Queen agrees to Bracken's daring suggestion that just might save the world, but loses her realm. She is also Bracken's mother.\nReferences"
    }
  ]
}