{
  "content": [
    {
      "type": "text",
      "text": "# The War in the Empty Air\n\nThe War in the Empty Air: Victims, Perpetrators, and Postwar Germans is a non-fiction work by Dagmar Barnouw, then Professor of German and Comparative Literature at the University of Southern California. Published in 2005 by Indiana University Press, the book explores the situation of the German people after their government's surrender to the Allies on 8 May 1945 at the end of World War II.\nIn particular, Barnouw discusses the absence of mourning for Germans, their dead, and their lost cities and artifacts destroyed by the Allied air war. Germans themselves could not mourn, because the strong message from the victors was that a just war had been fought against an evil regime, one regarded as uniquely evil for having caused the Holocaust. The politics of memory permitted no regret for Germans, the Tätervolk, the guilty people. Divided by the Allies into the democratic Federal Republic of Germany in the west and the communist German Democratic Republic in the east—with the former capital, Berlin, split by a wall from 1961—Germans were forced to look forward only and to view the hour of their surrender, Stunde Null, as a rebirth.\nBarnouw examines the air war, representations of the Holocaust, and the expulsion of ethnic Germans from their homes in Eastern Europe, weaving in her own story of becoming a refugee with her mother after the bombing of Dresden in February 1945.\nPublication details\n*Barnouw, Dagmar (2005). The War in the Empty Air: Victims, Perpetrators, and Postwar Germans. Bloomington: Indiana University Press.\nSee also\n* Collective guilt\n* Historikerstreit\n* List of books about Nazi Germany\n* Vergangenheitsbewältigung\nReferences\nFurther reading\n*Biess, Frank (March 2006). [https://networks.h-net.org/node/35008/reviews/44544/biess-barnouw-war-empty-air-victims-perpetrators-and-postwar-germans \"Biess on Barnouw, 'The War in the Empty Air: Victims, Perpetrators, and Postwar Germans'\"]. H-Net.\n*Greene, Larry A. (October 2007). \"Reviewed Work: The War in the Empty Air: Victims, Perpetrators, and Postwar Germans by Dagmar Barnouw\". German Studies Review. 30(3), 665–666.\n*Henningsen, Manfred (Spring 2008). \"Reviewed Work: The War in the Empty Air: Victims, Perpetrators, and Postwar Germans by Dagmar Barnouw\". Shofar. 26(3), 171–174."
    }
  ]
}