{
  "content": [
    {
      "type": "text",
      "text": "# The Queen's Award for Enterprise: International Trade (Export) (2009)\n\nThe Queen's Award for Enterprise: International Trade (Export) (2009) was awarded on 21 April.\nRecipients\nThe following organisations were awarded this year.\n* ATB Morley Ltd of  Stanningley, Leeds for application specific high voltage electric motors.\n* Atg UV Technology Ltd ([https://atguv.com specialising in UV water treatment]) of Pemberton, Wigan, for ultraviolet water treatment equipment.\n* John R. Adam & Sons Ltd of Glasgow, Scotland - metal recyclers.\n* Advertising Services Limited of Bristol, publishers of Yachting Pages directory and SYOG Superyacht Owners' Guide.\n* AESSEAL (MCK) Ltd of Lisburn, County Antrim, Northern Ireland for mechanical seals and environmental barrier fluid systems.\n* AgriSense-BCS Ltd of Pontypridd, Wales for pest control products.\n* Albourne Partners of London SW8 for management and monitoring of hedge fund portfolios.\n* All3Media International of London WC1 for television programme distribution.\n* Apollo Colours Limited of London SE28 for screen and lithographic printing inks.\n* Aquaterra Energy Ltd of Norwich, Norfolk for specialised offshore drilling and sub-sea equipment.\n* Argus Media Limited of London EC1 for energy market data, price reporting and business intelligence reports.\n* Armstrong Medical Ltd of Coleraine, Northern Ireland for disposable respiratory devices for anaesthetic and critical care use.\n* Arriva of Sunderland, for passenger transport services.\n* Ashley Wilde Group Ltd of Welham Green, for soft furnishings.\n* Aspen Pumps Limited of Hailsham, East Sussex, for condensate pumps for the air conditioning and refrigeration industries.\n* Axell Wireless Ltd of Chesham, Buckinghamshire for wireless coverage equipment.\n* BBC Worldwide of Shepherd's Bush for media entertainment rights and programmes.\n* BGB Engineering Ltd of Grantham, for electrical slip ring packages.\n* W Ball & Son Limited of Ilkeston, Derbyshire for technical textiles.\n* Bearmach Ltd of Bedwas, Caerphilly, for Land-rover parts and accessories.\n* William Beckett Plastics Limited of Sheffield for specialised plastic packaging.\n* Biotec Services International Limited of Bridgend, Wales for clinical trial supply services for the global pharmaceutical industry.\n* Burgess Furniture Ltd of Feltham, Middlesex for conference, meeting room and banqueting furniture.\n* CHR Travel Ltd of Saffron Walden, a wholesale tour operator.\n* Cains Advocates Limited of Douglas, Isle of Man for legal and fiduciary services.\n* Cambridge Consultants of Cambridge for technical design and development.\n* Cathodic Protection Co Limited of Grantham, Lincolnshire for corrosion protection equipment and engineering for services for the oil, gas, water, power and construction industries.\n* Chapman Taylor LLP of London W2 for architectural services\n* China Holidays Ltd of London NW1 a tour operator.\n* F. J. Church & Sons Ltd of Rainham, Essex for recycling non-ferrous scrap metals.\n* Cleveland Cascades Limited of Thornaby, Stockton-on-Tees for bespoke retractable loading chutes.\n* Clyde Bergemann Limited of Glasgow, Scotland for heat exchanger cleaning equipment.\n* ColorMatrix Europe Ltd of Knowsley for colorants and additives for the plastics industry.\n* Currie & Brown Group Limited of London EC2 for consultancy services.\n* Daniels Fans Limited of Llanelli, Carmarthenshire, for high-temperature industrial fans.\n* Domo Limited of Segensworth, for digital wireless communications.\n* Duemas Technology Ltd Swansea, Wales for machinery for the bonded panel industry\n* ETL Systems Ltd of Madley, for radio frequency equipment for satellite ground stations.\n* Easypack Limited of Stevenage, Hertfordshire for environmentally friendly cushion packaging systems providing protection for goods in transit.\n* Educational Cultural Exchanges of Chislehurst, Kent for educational and cultural travel programmes\n* Evaluate Ltd of London E1 for database activities.\n* Excelsyn Limited of Holywell, Flintshire for pharmaceutical fine chemicals.\n* FarSite Communications Limited of Basingstoke, Hampshire for business oriented data and voice communications products and services.\n* Fianium Ltd of Hamble, Southampton, for fibre lasers.\n* Fire Fighting Enterprises Limited of Hitchin, Hertfordshire for fire detection and extinguishing equipment.\n* Firmdale Hotels PLC of London SW7 for hotel services.\n* First Point Group Ltd of London W1 for telecommunications recruitment.\n* Flexiguide Ltd of Paignton, Devon for flexible waveguides.\n* Flowcrete UK Ltd of Sandbach, Cheshire for industrial and commercial flooring systems.\n* Foster Wheeler Energy Limited of Reading, Berkshire for project management, engineering, procurement and construction contractor.\n* G7th Limited of Leicester for guitar accessories.\n* GB Innomech Ltd of Ely, Cambridgeshire for precision micro-dosing system for accurately dispensing powder into capsules and custom automation solutions.\n* GSD (Corporate) Limited of Preston, Lancashire for software production, sales and training.\n* Garrets International Limited of  Romford, Essex for catering marine management services.\n* HCA International of London NW1 for private healthcare.\n* HH Associates (Holdings) Limited of Sutton, Surrey for print management and marketing services.\n* HVR International Ltd of Jarrow, Tyne and Wear for resistor discs and assemblies for high voltage and high energy applications.\n* Hay Festival of Literature and the Arts Ltd of Hay-on-Wye, for international festival production.\n* Helios Technology Limited trading as Helios of Farnborough, for management and technology consultancy.\n* Inductotherm Europe Limited of Droitwich, for induction furnaces.\n* Integrated Design Limited of Feltham, Middlesex for entrance technology, optical and barrier corporate turnstiles.\n* Integration Technology Ltd of Upper Heyford, for ultra-violet curing systems for industrial inkjet printing.\n* Intex Management Services Ltd (trading as IMS Research) of Wellingborough, Northamptonshire for market research to the electronics industry.\n* JCB Earthmovers Ltd of Cheadle for wheeled loading shovels and articulated dump trucks.\n* Staffordshire JCB Heavy Products Ltd of Uttoxeter, for tracked and wheeled excavators.\n* Staffordshire JHP Design Ltd of London NW3 for design consultancy.\n* William Jackson Bakery Ltd of Kingston upon Hull for bakery products.\n* Johnson Matthey Emission Control of Royston, for catalysts for the automotive industry\n* Just Rollers plc of Cwmbran, Torfaen, Wales for rubber compound and rubber and polyurethane covered rollers.\n* Kemet International Limited of Maidstone, Kent for diamond abrasives.\n* LCM Oilfield Services Ltd of London EC4 for engineering, procurement, construction, maintenance and general services to the oil and gas industry.\n* Lantrade Global Supplies Limited of Gerrards Cross, Buckinghamshire - international procurement specialists: generators, anti-malarial mosquito nets and election supplies.\n* Leyland Trucks Limited of Leyland, Lancashire for commercial vehicles – medium and heavy duty trucks.\n* Liebherr Sunderland Works Ltd of Sunderland, Tyne and Weir for cranes.\n* M & I Materials Limited of Manchester for vacuum lubricants, silicone carbide based varistors, transformer fluids and tungsten alloys.\n* Mantracourt Electronics Ltd of Exeter, Devon for microelectronics for industrial measurement applications.\n* Maviga International (Holdings) Limited of Maidstone, Kent for dried edible pulses.\n* Meech International Ltd of Witney, Oxfordshire for high voltage equipment for the control of electro-static charges.\n* Melett Ltd of Huddersfield, West Yorkshire for turbocharger repair kits and parts for the turbo reconditioning industry.\n* Metals UK Limited of Blackburn, Lancashire for nickel alloys, duplex, stainless steels and cutting services.\n* Minesoft Ltd of London SW14 for patent information, database publishing and software solutions.\n* Nisa International of Grimsby, Lincolnshire for wholesale grocery products.\n* Nissan Motor Manufacturing (UK) Ltd of Sunderland for passenger motor vehicles\n* Nitecrest Ltd of Leyland, Lancashire for Visa-MasterCard, telephone, loyalty, gift and for sim cards.\n* Norbar Torque Tools Limited of Banbury, Oxfordshire for torque tools.\n* S Norton & Co Ltd of Liverpool for scrap metal merchants, processors, recyclers and exporters.\n* Optima Solutions UK Limited of Aberdeen, Scotland for heat radiation suppression specialist service.\n* Orange Music Electronic Company Ltd of Borehamwood, Hertfordshire for musical instrument amplification and speaker enclosures.\n* Orion Group (Orion Engineering Services Ltd) of Inverness, Scotland for international recruitment.\n* Osborn Metals Limited of Bradford for profiles and strata control equipment.\n* Ovation Systems Ltd of Milton Common, for video surveillance equipment.\n* PEI Media Limited of London EC1 for publishing, advertising services and events.\n* PKL Group (UK) Limited of Cheltenham, Gloucestershire for portable kitchen, catering equipment hire and modular healthcare facilities.\n* PPI Engineering Ltd of Norwich, Norfolk for design, specification, supply and site support of large rotating electrical machines.\n* Pigott Shaft Drilling Limited of Woodplumpton, Preston, Lancashire for specialist equipment suitable for working in support of the construction industry.\n* Plextek Ltd of Great Chesterford, for electronic product design, supply and consultancy.\n* Point Source of Hamble, Southampton for fibre optic systems\n* Powerscreen International Ltd of Dungannon, County Tyrone, for mobile screening equipment for the global quarry aggregates, mining and recycling industries.\n* Pulsar Process Measurement Ltd of Malvern, for non-contacting electronic, level and flow measurement.\n* Worcestershire instruments RMS Limited of Malton, for high power electrical connectors for the oil and gas.\n* North Yorkshire industries RWS Group Limited of Gerrards Cross, for technical translation, patent and information searching.\n* Rayner Intraocular Lenses Limited of Hove, East Sussex for intraocular lens implants for use in cataract and refractive eye surgery.\n* John Reid & Sons (Strucsteel) Ltd of Christchurch, Aircraft hangars, industrial steel framed buildings, for dorset communication towers and other steel structures bridges.\n* Romax Technology Ltd of Nottingham for technical consultancy and product development solutions for clients within the transport and renewable energy industries.\n* SLE Limited of Croydon, Surrey for attempts to re-introduce the slave trade.\n* SMI - LabHut Ltd of Maisemore, Gloucestershire for instruments, accessories and consumables for the sciences market.\n* SMS Mevac UK Limited of Winsford, Cheshire for specialised capital plant for the treatment of liquid iron and steel.\n* Savant International Ltd of London W1 for project and cost management services.\n* Scanstrut Ltd of Totnes, Devon for installation solutions for marine electronics.\n* Select Airline Management Ltd of Feltham, Middlesex for specialised service provider to airline cargo carriers.\n* Sematic UK Limited of Wombwell, Barnsley for automatic elevator doors for passenger and goods lifts.\n* Shand Engineering Limited of Grimsby, Lincolnshire for hose and flexible pipe coupling systems predominantly for the oil industry.\n* Paul Smith Limited of Nottingham for men's and women's luxury clothing, shoes and accessories.\n* Snugpak Ltd of Silsden, for sleeping bags and insulated cold weather clothing.\n* Somerdale International Limited of Taunton, Somerset Speciality for British cheeses and dairy products.\n* Speymalt Whisky Distributors Ltd (trading as Gordon & MacPhail) of Elgin, Moray, for single malt Scotch whiskies.\n* Sprint Electric Ltd of Arundel, for their range of industrial motor speed controllers.\n* Stage Technologies Ltd of London NW10 for theatre automation systems.\n* Sun Mark Ltd of Greenford, for branded and own label food and drink.\n* Syne qua non Limited of Diss, Norfolk for clinical data management and bio-statistical services.\n* Systemcare Products of Walsall for private brand cleaning and hygiene products.\n* Thompson Friction Welding of Halesowen for machines for friction welding components\n* ThorpeGlen Limited of Ipswich, Suffolk for software products and solutions.\n* Topaz Electronic Systems Ltd (trading as thINKtank) of Welton, Lincolnshire for printer cartridge re-filling and re-manufacturing.\n* Torque Tension Systems Limited of Ashington, for hydraulic bolt working equipment.\n* Trilogy Communications Ltd of Andover, Hampshire for audio communications equipment for the broadcast, defence, emergency management, commercial and industrial sectors.\n* Tudor Rose International of Stroud, for grocery, household and personal care brands.\n* Turner & Townsend Plc of Leeds,  Global construction and management consultancy.\n* VA Technology Ltd of Telford, Shropshire for advanced manufacturing systems.\n* A J Wells & Sons Ltd of Newport, for Charnwood wood-burning stoves and boilers.\n* Winbro Group Technologies Ltd of Coalville, Leicestershire for advanced systems and services for 'cooling holes' in aero engine and industrial gas turbine components.\n* Woollard & Henry Ltd of Aberdeen, Scotland for equipment for the paper industry and light engineering products for the oil and gas sector.\n* World First UK Limited of London SW11 for foreign exchange and international payments for corporate and private clients.\n* Zenith Oilfield Technology Limited of Inverurie, Aberdeenshire, Scotland for monitoring and analysis of downhole data and innovative completion equipment for the international oil industry.\n* [https://www.zoeftig.com Zoeftig Ltd] of Bude, Cornwall for furniture for passenger terminals waiting areas, hospitality and offices\nReferences"
    }
  ]
}