{
  "content": [
    {
      "type": "text",
      "text": "# The Buckinghams\n\njazz rock, psychedelic pop\n| years_active      = 1966&ndash;1970, 1980&ndash;present\n| label             = USA, Columbia, Legacy Recordings, Nation Records, BML Records, Fuel Records, itsaboutmusic.com Records\n| website           = [http://www.thebuckinghams.com The Buckinghams official website]\n| current_members   = Carl GiammareseNick Fortuna Bruce Soboroff Dave Zane Tom Scheckel\n| past_members      = Dennis TufanoJohn PoulosGeorge LeGrosCurtis BachmanDennis MiccolisMarty GrebbTom TaylorJohn CammelotLaurie Beebe LewisBarb UngerLarry NestorBruce \"Rocky\" PennBob Abrams\n}}\nThe Buckinghams are an American pop band from Chicago. They formed in 1966 and went on to become one of the top-selling acts of 1967, charting their only five top 40 hits in the U.S. that year. The band dissolved in 1970, but re-formed in 1980 and  they continue to tour throughout the United States.\nHistory\nIn 1965 guitarists Carl Giammarese and Nick Fortuna, along with bassist Curtis Bachman, were invited to join a band called the Centuries. Giammarese and Bachman, plus keyboardist Dennis Miccolis, later became members of another band, the Pulsations, whose members included drummer John Poulos and vocalists George LeGros and Dennis Tufano. After winning a local battle of the bands competition in late 1965, the Pulsations secured a job as the house band on WGN-TV's variety show called All-Time Hits. The show's producers suggested they adopt a name reflective of the British Invasion, which was popular at the time, and the band adopted the name The Buckinghams, which was suggested by a security guard named John Opager at the station. The band liked the name because of its similarity to a hometown landmark, Buckingham Fountain.\nIn early 1966, LeGros was forced to leave after he was drafted. Right around the same time, bassist Bachman also left and Fortuna (now playing bass and soon briefly going under the surname of Fortune, after it was misspelled on the record jacket) returned after a stint with Jimmy V. & the Entertainers.\nThe band then signed their first record contract with local label USA Records and recorded 12 songs that year. Several were released as singles, including \"I'll Go Crazy\", a song originally recorded by James Brown & the Famous Flames and the Beatles' \"I Call Your Name\". However, it was their number one single \"Kind of a Drag\" that provided them with national exposure. \"Kind of a Drag\" was written by Chicago-based songwriter Jim Holvay, who had been performing with a group called The Mob, and spent two weeks at the top of the Billboard Hot 100 in February 1967. It sold over one million copies, and was awarded a gold disc. The co-producers of \"Kind of a Drag\" were the band's first personal manager Carl Bonafede and big band leader Dan Belloc, owner of the Holiday Ballroom in Chicago. The horns on the song were arranged by Frank Tesinsky and the engineer at the first recording sessions held at Chess Records in Chicago was Ron Malo. Following this, the band's debut album, also entitled Kind of a Drag, was released on USA Records and featured the band's early recordings.\nIn late 1966, keyboardist Miccolis was replaced by Larry Nestor, who stayed in the band only a short time and was in turn replaced by Marty Grebb at the close of 1966.\n]]\nAround this time the band members were introduced to James William Guercio, formerly the bassist and road manager for Chad & Jeremy, who then signed them to a management contract with Ebbins-Guercio Associates.\nThe Buckinghams were then courted by several record labels before deciding on promotion specialist Jim Scully, who quickly got them a new contract with Columbia (CBS) Records. And Guercio, who became the group's producer, continued the group's \"brass-rock\" approach, and the band produced four more Top-20 hits in 1967: \"Don't You Care\" (No. 6), \"Mercy, Mercy, Mercy\" (No. 5), \"Hey Baby (They're Playing Our Song)\" (No. 12) and \"Susan\" (No. 11), three of which were written by Jim Holvay and Gary Beisbier.\nThe same year, the Buckinghams were named by Billboard magazine as \"The Most Listened to Band in America\". But severe differences occurred between the Buckinghams and Guercio, particularly the producer's decision to add a psychedelic section to the song \"Susan\". The song included a short portion of Charles Ives' \"Central Park in the Dark\" and sounded very similar to the Beatles' song \"A Day in the Life\", with an orchestral crescendo. Many radio stations omitted this section, since it changed the song's tempo and veered radically from the melody. But the producer had the last word, and the released version kept the psychedelic section intact. The group currently does not include the psychedelic portion in their performances.\nBy mid-1968, the Buckinghams had parted company with Guercio and Columbia Records assigned staff producer Jimmy Wisner to work with the group on their fourth album, In One Ear and Gone Tomorrow. The album featured material written by Grebb, Giammarese and Tufano.\nDespite the release of a new single, \"Back in Love Again\", it ended up stalling on the Billboard chart at No. 57, and they were unable to duplicate their 1967 success without Guercio, who went on to take the \"brass rock\" concept further with Blood, Sweat & Tears and Chicago. Also, a \"Buckinghams Day\" in Chicago was cancelled when it was learned that some of the band members were arrested for possession of illegal drugs. It was later determined that marijuana had been found belonging to the band's roadies, and all charges were eventually dropped when the police failed to prove their case. The story of the charges made headlines, but the retraction and resolution of the case as being innocent did not.\nUltimately, restitution came in the form of recognition as The Buckinghams were inducted into the Iowa Rock & Roll Hall of Fame in September 2019 and the 2022 Inaugural Class of the Illinois Rock and Roll Hall of Fame.\nBy late 1968, Grebb and Fortuna had left and were replaced by keyboardist John Turner and original bassist Bachman, who had gone on to join the band Saturday's Child after leaving the Buckinghams. There were no more hits, though, and the band dissolved in early 1970.\nColumbia released a double compilation record of their two Guercio era albums, Time and Changes and Portraits, in 1975 under the title Made in Chicago.\nAfter the break-up, Tufano and Giammarese formed the duo Tufano & Giammarese and recorded three albums for Lou Adler's record label, Ode Records, forming a touring band in time for their second album. Drummer John Poulos, who had secured the Ode Records recording contract for the duo, became a manager of several rock bands, including the Boyzz from Illinoizz. Poulos died of drug-related heart failure on March 26, 1980.\nReformation\nLater in 1980, Chicago's WLS radio programming executive John Gehron called Giammarese with an invitation to reunite the Buckinghams for Mayor Jane Byrne's ChicagoFest event in August. Giammarese, Fortuna and Tufano appeared with drummer Tom Osfar and keyboardist John Cammelot on the Navy Pier rooftop stage. Marty Grebb declined the opportunity to join them as he was touring with the group Chicago at the time.\nFor the next two years the trio of original members performed at selected concerts in Chicago. When Tufano decided to return to California to resume a career in film voice work in early 1983, Giammarese and Fortuna committed to tour full-time as The Buckinghams.\nThe 1983 Buckinghams featured an expanded group that included Giammarese, Fortuna, John Duich (guitar), Tom Taylor (keyboards), Tom Scheckel (drums, percussion) and two female singers: Laurie Beebe Lewis (vocals, keyboards), who later joined the Mamas & the Papas, and Barbara Unger (keyboards, backing vocals).\nIn 1984 Duich, Taylor, and Unger were dropped and Giammarese, now handling lead vocal duties, went back to playing guitar as well and Cammelot rejoined on keyboards with Lewis on vocals and supporting keyboards.\nThe following year the Buckinghams were part of the Happy Together 85 Tour, along with the Turtles, the Grass Roots, and Gary Lewis and the Playboys. And that same year they released their comeback album A Matter of Time on Red Label Records which included one single promo release \"Veronica\".\nBy early 1986, both Lewis and Cammelot left the group and were replaced by Bob Abrams (guitar, vocals) and Bruce Soboroff (keyboards, vocals).\nIn 1991 Sony Music Entertainment (the present-day owner of Columbia Records) released a new greatest hits compilation, Mercy, Mercy, Mercy: A Collection. Sony Music has continued to make the Buckinghams' Columbia recordings available, as well as their recordings previously issued by USA Records.\nIn 1996 the Buckinghams celebrated the band's 30th anniversary with a concert at The Vic Theatre in Chicago. The show was filmed and released as a video entitled \"Off Their Rocker\" and included DJs Dick Biondi (d. 6.26.23) and John Records Landecker, still on WGN Radio, as hosts.\nNew studio and live recordings (2000&ndash;present)\nIn 2001 the Buckinghams were part of the Solid Gold 60s Tour along with Tommy James, the Turtles, Gary Puckett and the Grass Roots. PBS featured the Buckinghams on The Sixties Pop Rock Reunion in 2004.\nIn January 2005 the Buckinghams performed at the Twilight on the Prairie Ball for one of President George W. Bush's Inaugural Balls in Washington, DC.\nIn 2007 the Buckinghams signed with national label Fuel Records to release their studio CD Reaching Back, which included eight new original songs written by Giammarese and new recordings of five of their top hits. A second CD, Standing Room Only (previously released as Live and Well), was also released on the Fuel Label. XM Radio recorded the Buckinghams in concert for their XM Performance Series on the \"60s on 6\" channel. The Buckinghams' music from yesterday and today remains in regular rotation on classic rock stations in U.S. formats as well as satellite radio and streaming Internet radio stations.\nThe Buckinghams released their first Christmas album on the BML label, The Joy of Christmas, in November 2008. And in December 2008 they debuted the single \"Have a Little Faith\" on WGN-TV in Chicago.\nIn 2009 the Buckinghams performed at the Bipartisan Illinois Agricultural Ball for the inauguration of President Barack Obama. The same year, Sony reissued the Buckinghams' first three albums for sale as digital downloads as part of their Legacy Music Series.\nOn February 9, 2010 the Buckinghams released a DVD/CD box set, Up Close, showing them in concert at the Star Plaza Theatre in Merrillville, Indiana.\nIn May 2010 Abrams and Scheckel left the Buckinghams lineup to be replaced by Dave Zane (guitars, vocals) and Bruce (Rocky) Penn (drums, percussion, backing vocals), who had played with several Chicago-based groups, including the Cryan' Shames for a number of years. Scheckel went on to join Paul Revere and the Raiders and stayed until Paul Revere's death, continuing for a time with the renamed band, Paul Revere's Raiders. Scheckel returned to his drum seat in The Buckinghams in April 2023.\nOn May 20, 2010 Giammarese and Fortuna were featured in the 25th Anniversary Happy Together Tour, joining the Turtles, the Grass Roots, Micky Dolenz and Mark Lindsay in a 20+-city tour from California to New York, celebrating the silver anniversary of the original Happy Together Tour in 1985. In July 2011 concerts began for the second Happy Together Reunion Tour that included the Buckinghams, the Turtles, the Grass Roots, Mark Lindsay and the Association. Later in 2011, it was announced that Carl Giammarese and Nick Fortuna would join the 2012 Happy Together Tour alongside the Turtles, Micky Dolenz, the Grass Roots and Gary Puckett. The popularity of the tour found them rejoining the Happy Together Tour in 2015, 2019, 2021 and 2022 with other artists including The Cowsills, Ron Dante, the Classics IV and the Vogues.\nIn 2011 Giammarese completed his solo CD Journey, the companion to his future biography, Reinventing The Buckinghams: My Journey.\nOn October 16, 2015 the Buckinghams took part in the filming of Cornerstones of Rock: American Garage which aired multiple times on WTTW Chicago. Cornerstones of Rock was created to be a nostalgic celebration of the Chicago-area \"garage bands\" that rose to national prominence in the 1960s and 1970s. Jim Peterik and The Ides of March served as the house band for the evening, as many original members of these popular bands returned to the concert stage to play their greatest hits. In addition to the Buckinghams, the Cornerstones line-up included the Ides of March, the Cryan' Shames, the New Colony Six, the Shadows of Knight, the McCoys and the American Breed. This special was such a huge success that it spawned a live concert tour which is still continuing. Cornerstones of Rock: American Garage continues to sell out concert venues across the Midwest. The majority of Cornerstones performances are held at the Arcada Theatre (Saint Charles, IL), but as fan demand has grown the tour has branched out to other venues in the Midwest. The 2024 lineup of Cornerstones of Rock contained the Buckinghams, the Cryan’ Shames, the Ides Of March, the Shadows of Knight and the New Colony Six.\nThe Buckinghams original lead singer Tufano continues to tour as a solo act, and also appears in a Bobby Darin show he created, ''As Long as I'm Singing. Former keyboards/vocals/songwriter Grebb played with the Fabulous Rhinestones, Lovecraft (formerly H P Lovecraft), Chicago, Bonnie Raitt, the Weight Band, and Dave Mason, and has also produced CDs for independent musicians, including Peach. Grebb died on January 1, 2020.\nGiammarese and Fortuna have continued touring with band members Soboroff, Zane, Scheckel and a horn section consisting of Carlo Isabelli (trumpet), Charles Morgan (trombone) and Dan Moffett (tenor saxophone). They perform regularly to festival audiences and have played sold-out shows, such as the Westbury Music Fair, the Belfry Theatre, the Egyptian Theatre, the Genesee Theatre, the Arcada Theatre, the Keswick Theatre and others. They remain acts for casino venues and international rock and roll cruises throughout the country and perform the national anthem at home games of baseball teams such as the Chicago Cubs and White Sox.\nDiscography\nAlbums\n{| class=\"wikitable\"\n! rowspan=\"2\" |Year\n! rowspan=\"2\" |Album\n! colspan=\"2\" |Peak positions\n! rowspan=\"2\" |Label\n|-\n!US 200\n!US CB\n|-\n| rowspan=\"3\"| 1967\n| Kind of a Drag\n| style=\"text-align:center;\"| 109\n| style=\"text-align:center;\"| 35\n| USA Records\n|-\n| Time and Charges\n| style=\"text-align:center;\"| 58\n| style=\"text-align:center;\"| 57\n| rowspan=\"3\"| Columbia\n|-\n| Portraits\n| style=\"text-align:center;\"| 53\n| style=\"text-align:center;\"| 25\n|-\n| rowspan=\"1\"| 1968\n| In One Ear and Gone Tomorrow\n| style=\"text-align:center;\"| 161\n| style=\"text-align:center;\"| —\n|-\n| 1998\n| Terra Firma\n| style=\"text-align:center;\"| —\n| style=\"text-align:center;\"| —\n| Nation Records\n|-\n| 2006\n| Live and Well\n| style=\"text-align:center;\"| —\n| style=\"text-align:center;\"| —\n| BLM Records\n|-\n| 2007\n| Reaching Back\n| style=\"text-align:center;\"| —\n| style=\"text-align:center;\"| —\n| rowspan=\"2\"| Fuel Records\n|-\n| rowspan=\"2\"| 2008\n| Standing Room Only\n| style=\"text-align:center;\"| —\n| style=\"text-align:center;\"| —\n|-\n| The Joy of Christmas\n| style=\"text-align:center;\"| —\n| style=\"text-align:center;\"| —\n| BML Records\n|-\n| 2010\n| Up Close: CD and digital downloads\n| style=\"text-align:center;\"| —\n| style=\"text-align:center;\"| —\n| itsaboutmusic.com Records\n|-\n|}\nCompilation albums\n* Greatest Hits (1969, Columbia) US BB No. 73, US CB No. 41\n* Made in Chicago (1975, Columbia)\n* Mercy, Mercy, Mercy: A Collection (1991, Columbia/Legacy)\n* Up Close: The Buckinghams in Concert DVD/CD box set (2010, itsaboutmusic.com Records)\nSingles\n{| class=\"wikitable\"\n|-\n! rowspan=\"2\"|Year\n! rowspan=\"2\"|A-side/B-sideBoth sides from same album except where indicated\n! colspan=\"2\"|U.S. Charts\n! colspan=\"1\"|Canada\n! style=\"text-align:center;\" rowspan=\"2\"|Album\n|-\n! style=\"text-align:center;\"|Billboard\n! style=\"text-align:center;\"|Cashbox\n! style=\"text-align:center;\"|RPM\n|-\n|1965\n|\"Sweets for My Sweet\"b/w \"Beginners Love\"\n|align=center| —\n|align=center| —\n|align=center| —\n|rowspan=\"7\"|Kind of a Drag''\n|-\n|rowspan=\"4\"|1966\n|\"I'll Go Crazy\"b/w \"Don't Want to Cry\"\n|align=center|112\n|align=center|132\n|align=center|—\n|-\n|\"I Call Your Name\"b/w \"Makin' Up and Breakin' Up\"\n|align=center|—\n|align=center|102\n|align=center|—\n|-\n|\"I've Been Wrong Before\"b/w \"Love Ain't Enough\"\n|align=center|—\n|align=center|129\n|align=center|—\n|-\n|\"Kind of a Drag\"b/w \"You Make Me Feel So Good\"\n|align=center|1\n|align=center|3\n|align=center|1\n|-\n|rowspan=\"6\"|1967\n|\"Lawdy Miss Clawdy\"b/w \"I Call Your Name\" (first pressings)\"Makin' Up and Breakin' Up\" (later pressings)\n|align=center|41\n|align=center|39\n|align=center|42\n|-\n|\"Summertime\"b/w \"I Don't Want to Cry\"\n|align=center|—\n|align=center|—\n|align=center|—\n|-\n|\"Don't You Care\"b/w \"Why Don't You Love Me\"\n|align=center|6\n|align=center|6\n|align=center|4\n|rowspan=\"2\"|Time & Charges\n|-\n|\"Mercy, Mercy, Mercy\"b/w \"You Are Gone\"\n|align=center|5\n|align=center|5\n|align=center|4\n|-\n|\"Hey Baby (They're Playing Our Song)\"b/w \"And Our Love\" (from Time & Charges)\n|align=center|12\n|align=center|5\n|align=center|2\n|rowspan=\"2\"|Portraits\n|-\n|\"Susan\"b/w \"Foreign Policy\" (from Time & Charges)\n|align=center|11\n|align=center|7\n|align=center|7\n|-\n|rowspan=\"2\"|1968\n|\"Back In Love Again\"b/w \"You Misunderstand Me\" (Non-album track)\n|align=center|57\n|align=center|53\n|align=center|31\n|In One Ear and Gone Tomorrow\n|-\n|\"Where Did You Come From\"b/w \"Song of the Breeze\" (from In One Ear and Gone Tomorrow)\n|align=center|117\n|align=center|125\n|align=center|—\n|rowspan=\"4\"|Non-album tracks\n|-\n|rowspan=\"2\"|1969\n|\"This Is How Much I Love You\"b/w \"Can't Find the Words\" (from In One Ear and Gone Tomorrow)\n|align=center|—\n|align=center|—\n|align=center|—\n|-\n|\"It's a Beautiful Day (For Lovin')\"b/w \"Difference of Opinion\"\n|align=center|126\n|align=center|110\n|align=center|—\n|-\n|1970\n|\"I Got a Feelin'\"b/w \"It Took Forever\"\n|align=center|—\n|align=center|—\n|align=center|—\n|-\n|1985\n|\"Veronica\"b/w \"Can We Talk About It\"\n|align=center|—\n|align=center|—\n|align=center|—\n|A Matter of Time\n|}\nPersonnel\nCurrent\n*Carl Giammarese – guitar, vocals\n* Nick Fortuna – bass, vocals\n* Bruce Soboroff – keyboards, vocals\n* Dave Zane – guitar, vocals\n* Tom Scheckel – drums\nFormer\n*Dennis Tufano – vocals, harmonica\n*George LeGros – vocals\n* John Duich – guitar\n* Bob Abrams – guitar, vocals\n*John Poulos – drums, percussion\n* Rocky Penn – drums, percussion, backing vocals\n* Tom Osfar – drums\n*Curtis Bachman – bass\n*Marty Grebb – keyboards, vocals\n*Dennis Miccolis – keyboards\n* Larry Nestor – keyboards\n* John Turner – keyboards\n* Tom Taylor - keyboards\n* John Cammelot – keyboards\n* Laurie Beebe Lewis – vocals, keyboards\n* Barbara Unger – keyboards, backing vocals\nReferences\nExternal links\n*\n* [http://www.myspace.com/TheBuckinghams The Buckinghams' official MySpace Page]\n* [https://www.flickr.com/photos/thebuckinghams/ The Buckinghams' official Flickr Photo Stream Page]\n*\n*\n*"
    }
  ]
}