{
  "content": [
    {
      "type": "text",
      "text": "# The King (1995 film)\n\n| runtime        = 185 minutes\n| country        = India\n| language       = Malayalam\n| budget         =\n| gross          = }}\nThe King is a 1995 Indian Malayalam-language political action thriller film directed by Shaji Kailas, written by Renji Panicker and produced by Manjalamkuzhi Ali. The film stars Mammootty, alongside Murali, Vijayaraghavan, K. B. Ganesh Kumar, Vani Viswanath, Devan and Kazan Khan.\nThe King was released on 23 October 1995, coinciding with Diwali, and became the highest-grossing Malayalam film, besides Spadikam.\nPlot\nThe city of Kozhikode has been victimized by a massive communal riot against the slums, costing the lives of 12 innocent civilians. Before the riot, a wildlife photographer named Madhu Kumar witnessed a group of criminals transporting explosives through the local forest check post, where he calls the local police commissioner Shankar and passes on the information. However, the goons managed to capture and murder Madhu before initiating the riot.\nWhile helping the police to fight against the rioters, the aggressive yet honorable DC Thevalliparambil Joseph Alex is suspicious of Shankar's activities and personally investigates the case with the help from his subordinates ASP Prasad and AC Anura Mukherji, who admires Joseph for his honesty and aggressive behaviour against corrupt officials and politicians. Joseph is brought over to a personal hearing with the state minister John Varghese, who berates him over his behaviour while attempting to stop the riots. However, Joseph stands up by reprimanding Varghese for his belief in using his authority to belittle and harass others.\nMeanwhile, Madhu's father reaches out to Prasad after filing a case regarding of Madhu's disappearance, resulting Prasad to finally discover Madhu's corpse with his camera with the film being missing. As the investigation heats up, MP Jayakrishnan is assisting in relief works in the damaged area by meeting the aggrieved entities after his arrival from Delhi. However, it is revealed that Jayakrishnan is the mastermind behind the massacre as he planned to destroy the slums in order to develop new real estate business in the area. It also turns out that Shankar, Varghese, and Ibrahim Jalal are involved in the conspiracy as well, and that Shankar sent the goons to murder Madhu to cover their tracks.\nThe local police medical surgeon Dr. Vijay deduces that Madhu was murdered after conducting an autopsy, but he ends up being killed in a road accident. Eventually, Joseph finds a new ally named Sanjay, who happens to be Dr. Vijay's elder brother and a close buddy of Joseph during his Mussourie training days. Joseph, Sanjay and Prasad found out that Dr. Vijay was injected with a powerful drug by the same goons who murdered Madhu, which could have contributed to the accident. While Jayakrishnan flies to Delhi to accept his new job as a cabinet minister in the central government, Joseph arrests and interrogates Jalal, who reveals that the lead goon Ananthashankara Iyer is responsible for murdering Madhu and Dr. Vijay.\nAfter arresting Iyer at a shopping mall, Joseph uses the same sedative to force Iyer into giving out important information about the conspiracy behind the communal riot. Before Joseph and Prasad could escort Iyer to the police station, Iyer's boss Vikram Khorpade, a Mumbai-based crime boss with strong ties with Jayakrishnan and also a major player in the conspiracy, arrives and causes a shootout that allows him to rescue Iyer. Vikram also takes the opportunity to murder Anura before fleeing away with Iyer, much to Joseph's shock.\nDeclaring this personal, Joseph, Prasad and Sanjay track down Vikram and his goons to a horse farm, where they kill all of the goons residing there. After Sanjay kills Iyer by hanging him on a chain, Joseph beats up Vikram before taking him into custody, forcing him to reveal the identities of the people behind the conspiracy. Following his return after being sworn as the new cabinet minister, Jayakrishnan is met by an angry Joseph and several officers. Joseph takes the opportunity to expose Jayakrishnan's conspiracy plot to the public, using both Iyer and Vikram's confessions as proof of his findings.\nAs a result, Jayakrishnan, Vikram and Shankar are placed under arrest on the charges of conspiracy to crime, murder and terrorism. However, Jayakrishnan refuses to concede defeat and instead takes one of the officers' guns before firing at the crowd, murdering Vikram and several citizens in the process. Jayakrishnan uses the commotion to make a getaway in a car, only for Joseph to shoot the gas tank, causing the car to explode and kill Jayakrishnan. Joseph is then hailed as a hero by the public for his actions.\nCast\n*Mammootty as District Collector Thevalliparambil Joseph Alex IAS\n*Murali as MP Jayakrishnan\n*Vijayaraghavan as Sanjay\n*K. B. Ganesh Kumar as ACP Prasad IPS\n*Vani Viswanath as Assistant Collector Anura Mukharji IAS\n*Kazan Khan as Vikram Ghorpade\n*Devan as City Police Commissioner Shankar Ramadas IPS\n*Kuthiravattam Pappu as Krishnan\n*Rajan P. Dev as Govindan Menon, Jayakrishnan's Uncle\n*K. P. A. C. Azeez as Chief Editor Kandakuzhi Thankachan\n*Kollam Thulasi as State Minister James Varghese\n*C. I. Paul as DYSP Chacko\n*Appa Haja as Madhu\n*Sonia as Joseph's Sister\n*Thikkurissy Sukumaran Nair as Mash, Madhu's Father\n*Kunchan as Kurup\n*Vijay Menon as Dr. Vijay, Sanjay's Brother\n*Sadiq as Ibrahim Jalal, Jayakrishnan's P. A\n*T. S. Krishnan as Ananthashankara Iyer\n*Prof. Aliyar\n*Bindu Panicker as Lathika, Jayakrishnan's Wife\n*Ragini as Nimmy, Shankar's Wife\n*Manju Satheesh as Madhu's Sister\n*Poojappura Radhakrishnan as Pillai's PA\n;Cameo appearance\n*Suresh Gopi as Madhavan IPS (Character from Ekalavyan)\n*M. G. Soman as Thevalliparambil Alexander, Joseph's Father\n*K. P. A. C. Lalitha as Joseph's Mother\n*Sankaradi as Minister Pillai\n*Maniyanpilla Raju as Collector's Assistant\n*K. P. A. C. Sunny as Sulaiman / Sulaimanikka\nRelease\nThe King was released on 11 November 1995. The film was dubbed and released in Tamil with same name.\nBox office\nThe film was a commercial success and second best performing film after Spadikam in the box office It ran over 200 days in theatres and was one of the  highest grossing Malayalam film of 1995.\nSequel\nIn 2012, Shaji Kailas made a combined sequel titled The King and the Commissioner, in which Mammootty and Suresh Gopi reprised their roles as Joseph Alex IAS and Bharathchandran IPS, but the sequel was panned by critics and became a box office bomb.\nReferences\nExternal links\n*\n* [https://www.pixslate.com/title/tt0271595/The-King The King] at Pixslate"
    }
  ]
}