{
  "content": [
    {
      "type": "text",
      "text": "# The King v. Rapp\n\nThe King v. Rapp, 1 U.S. (1 Dall.) 9 (Pa. 1764) is a decision of the Supreme Court of Pennsylvania issued when Pennsylvania was still a British colony. It is among the first decisions that appear in the first volume of United States Reports, and is among the earliest reported appellate court decisions in North America.\nThe decision\nAccording to Dallas's annotations, Rapp was a clergyman accused of the misdemeanor of performing a marriage between a man and a woman who already had a husband living, thus suborning bigamy.  Rapp or his attorney sought to \"put off the Trial\" for lack of material witness affidavits, despite his taking appropriate steps to obtain them.  Rapp was essentially arguing that the trial should be delayed due to the unavailability of material witnesses.  The attorney general prosecuting the case opposed Rapp's motion, which was apparently a device used in civil cases, arguing that the rules of civil procedure did not apply in this criminal case.\nDallas's report lacks clarity and detail, but apparently suggests that the Pennsylvania Supreme Court, mindful of the fact that the defendant was a clergyman and would not be able to earn a living absent an acquittal in this case, granted the motion and dismissed the case.  The court, however, made a point of stating its decision did not constitute a precedent.  It seems probable that the Court applied the principle of benefit of clergy to allow the defendant to escape this one charge.\nPrecedential effect\nDespite the Court's admonition that this decision was not to be cited as precedent, it was in fact cited once in the 20th century.  Before the intermediate appellate Superior Court of Pennsylvania in Commonwealth v. Craig, 19 Pa. Super. 81 (1902), the attorneys representing Craig, who was accused of stealing 25 chickens, cited King v. Rapp for the premise that a continuance (postponement) of a trial due to the absence of a material witness could be had in both criminal and civil trials.\nNotes\nReferences\n* Hall, Kermit, ed.  Oxford Companion to the Supreme Court of the United States (Oxford 1992),\n* Goebel, Jr., Julius, The Oliver Wendell Holmes Devise History of the Supreme Court of the United States Volume 1: Antecedents and Beginnings to 1801 (Macmillan, 1971)\n* Walters, Jr., Raymond Alexander Dallas: Lawyer -- Politician -- Financier, 1759 - 1817 (Da Capo Press, 1969)\nSee also\n*United States Reports, volume 1"
    }
  ]
}