{
  "content": [
    {
      "type": "text",
      "text": "# The Vagabond King (1930 film)\n\n| runtime        = 104 minutes\n| language       = English\n| country        = United States\n| budget         = $1,250,000\n| gross          =\n}}\nThe Vagabond King is a 1930 American Pre-Code musical operetta film photographed entirely in two-color Technicolor. The plot of the film was based on the 1925 operetta of the same name, which was based on the 1901 play If I Were King by Justin Huntly McCarthy. The play told the story of the real-life renegade French poet named François Villon. The music of the film was based on a 1925 operetta, also based on the play If I Were King by McCarthy. The operetta is also titled The Vagabond King with music by Rudolph Friml and lyrics by Brian Hooker and W.H. Post. The film was nominated for an Academy Award for Best Art Direction.\nPlot\nThe story takes place in France in the Middle Ages. King Louis XI (O. P. Heggie) (reigned 1461–1483), hoping to enlist the French peasants in his upcoming battle against the Burgundians, appoints François Villon (Dennis King) king of France for one day. Despite being successful against the Burgundians, François Villon is sentenced to hang by King Louis XI for writing derogatory verses about him...\nJeanette MacDonald is Katherine, the high-born girl whom Villon pines for, while Huguette, a tavern wench (Lillian Roth) gives up her life to save her beloved poet.\nCast\n* Dennis King as François Villon\n* Jeanette MacDonald as Katherine\n* O. P. Heggie as King Louis XI\n* Lillian Roth as Huguette\n* Warner Oland as Thibault\n* Arthur Stone as Oliver the barber\n* Tom Ricketts as The Astrologer (credited as Thomas Ricketts)\n* Lawford Davidson as Tristan\n* Christian J. Frank as Executioner\nSongs\n* \"Song of the Vagabonds\"\n* \"King Louis\"\n* \"Mary, Queen of Heaven\"\n* \"Some Day\"\n* \"If I Were King\"\n* \"What France Needs\"\n* \"Only a Rose\"\n* \"Huguette Waltz\"\n* \"Love Me Tonight\"\n* \"Nocturne\"\nSix songs from the operetta were retained for the film, while four were specially written for it by different composers.\nProduction\n*Dennis King recreated his original London and Broadway stage role as Villon in this film.\n*Dennis King and costar Jeanette MacDonald did not get along particularly well, and matters came to a head when they filmed the song \"Only a Rose\". As MacDonald was singing a solo passage, the egotistical King managed to edge his profile into the shot; forever afterward, the diva scornfully referred to the number as \"Only a Nose\".\n*Composer Rudolf Friml had a stipulation in his contract that forbade the use of newly composed songs in this production. Paramount attempted to change the film's title to If I Were King and also had some new songs composed for the film. When Friml was made aware of the new songs, he sued the studio. As a result, Paramount changed the title back to The Vagabond King and paid Friml $50,000 to allow for the use of non-original songs.\nPreservation\nFor many years, the film was seen only in black-and-white prints made for television release in the 1950s. At one time even the black-and-white prints were considered irretrievably lost. One nitrate Technicolor print did survive at the UCLA Film and Television Archive, and it was restored and preserved in 1990.\nSee also\n*List of early color feature films\nReferences\nExternal links\n*"
    }
  ]
}