{
  "content": [
    {
      "type": "text",
      "text": "# The Nightmare Before Christmas: The Pumpkin King\n\n|designer =\n|series = The Nightmare Before Christmas\n|released =\n|genre = Platform, Metroidvania\n|platforms = Game Boy Advance\n|modes = Single-player, multiplayer\n}}\nis a 2005 platform game developed by Tose for the Game Boy Advance. The game was published by D3 Publisher in Japan, and by Buena Vista Games internationally. A prequel to the 1993 stop motion animated film The Nightmare Before Christmas, it tells the story of Jack Skellington's first encounter with Oogie Boogie, and how he claimed the title of \"The Pumpkin King\".\nThe Pumpkin King was released at the same time in North America as ''The Nightmare Before Christmas: Oogie's Revenge for PlayStation 2 and Xbox.\nGameplay\nThe Nightmare Before Christmas: The Pumpkin King is a platform game, with exploration gameplay similar to the Castlevania'' series.\nPlot\nOne year before the events of the film, Jack Skellington is preparing for Halloween. When Oogie Boogie hears from his henchmen Lock, Shock, and Barrel that Jack is scarier than him, he sends them to kidnap Jack. They, however, bring Sally, a rag doll-like creature who is Doctor Finkelstein's new assistant and has a crush on Jack.\nOn Halloween, Jack finds the town deserted and hears from the Mayor that everyone is hiding from a bug infestation. Lock, Shock and Barrel wreak havoc around the town. Along the way, Jack helps the townspeople and in return collects weapons, upgrades, and information. Jack learns of Oogie Boogie and that he lives under the treehouse on the edge of town.\nJack confronts Oogie and learns that he is behind the whole mess and wants to turn Halloween into Crawloween. Jack and Oogie battle to decide who will rule the town. Oogie claims he will win and turn Halloween Town into Bug Town. Jack defeats Oogie and orders him to fear him and not to leave the lair. Jack rescues Sally, meeting her for the first time, and Halloween goes ahead as planned. Oogie vows to get his revenge.\nDevelopment\nThe game was showcased at E3 2005.\nReception\n|IGN = 6.5/10\n|NP = 6.5/10\n|NWR = 8/10\n|GR = 69.43%\n|MC = 71/100\n}}\nThe game has a score of 69.43% from GameRankings and 71 out of 100 from Metacritic. IGN gave it a score of 6.5 out of 10, saying, \"Nightmare Before Christmas might not be all that amazing visually, and audio-wise it's the absolute pits. But it does give kids a solid Nightmare Before Christmas-based adventure, even if it lacks that special 'zing' that the unique license could have afforded.\"\nNotes\nReferences\nExternal links\n*"
    }
  ]
}