{
  "content": [
    {
      "type": "text",
      "text": "# The Volunteers: To the War\n\n| director       = Chen Kaige\n| producer       =\n| writer         = Zhang Ke\n| starring       =\n| music          =\n| cinematography =\n| editing        = Li Dianshi\n| studio         =\n| distributor    =\n| released       = }}\n| runtime        = 140 minutes\n| country        = China\n| language       = Mandarin\n| budget         =\n| gross          = $121.4 million\n}}\nThe Volunteers: To the War () is a 2023 Chinese war film directed by Chen Kaige. It is a tribute to commemorate the \"70th Anniversary of the War to Resist US Aggression and Aid Korea\" as which it was perceived by that time in China. The film is adapted from Lan Xiaolong's novel \"War and Sacrifice\". Set during the Korean War, the film is intended to be the first installment of a planned trilogy from Chen depicting China's involvement in the war.\nThe film was released on 28 September 2023. A sequel, The Volunteers: The Battle of Life and Death, was released in 2024.\nPlot\nIn the early days of the founding of the People's Republic of China in 1949, the new China faced a situation of \"internal and external troubles\". Since the outbreak of the Korean War, the US military has repeatedly provoked on the Sino-North Korean border, and civilians have been bombed. In order to safeguard the hard-won peace and long-term stability for generations, in October 1950, Chairman Mao decided to send the People's Volunteer Army led by Comrade Peng Dehuai to fight in Korea, and the \"War to Resist US Aggression and Aid Korea\" kicked off. Their senior leaders conducted a series of careful discussions and deductions, and sent Premier Zhou to Moscow to request support. This is a \"national war\". On the Korean battlefield, even though there was a huge gap in armament strength, the army exchanged heroic sacrifices for successive victories; on the diplomatic stage, the delegation of the People's Republic of China appeared at the United Nations for the first time, and China's new voice won international respect. New China, not giving up an inch of land to promote national prestige; new youth, high-spirited to protect their country\nCast\n*Tang Guoqiang as Mao Zedong\n* as Peng Dehuai\n*Liu Jing as Zhou Enlai\n*Xin Baiqing as Li Moyin\n*Zhang Songwen as Wu Xiuquan\n*Huang Xiaoming as Jiang Chao\n*Zhang Ziyi as Tang Sheng\n*Zhu Yawen as Wu Benzheng\n*Zhang Zifeng as Li Xiao\n*Wei Daxun as Mao Anying\n*Xiao Yang as Zhao Annan\n* as Liang Xingchu\n*Arthur Chen as Sun Xing\n*Vision Wei as Dai Ruyi\n* as Yang Shaocheng\n* as Yang Sandi\n*Hai Qing as Lin Qiaozhi\n*Zhu Yilong as Li Xiang\n*Du Chun as Ye Zilong\n* as Li Tao\n* as Han Xianchu\n*Lang Yueting as Gong Pusheng\n*Eric Wang as Qiao Guanhua\n*Lin Yongjian as Nie Rongzhen\n*Wang Kaisheng as Deng Hua\n*Wang Wufu as Zhu De\n*Wu Dajing as Yang Gensi\nProduction\nProduction on the film began in July 2022, and finished thirteen months later in August 2023.\nMarketing\nA trailer for the film was released on 21 April 2023.\nMusic\nRelease\nThe Volunteers was released in China on 28 September 2023, timed to coincide with the country's National Day on October 1.\nBox office\nThe film earned $34.7 million in its first four days of release, behind Under the Light and The Ex-Files 4: Marriage Plan. The film fell below expectations at the box office.\nSequel\nThe second installment titled The Volunteers: The Battle of Life and Death () was released on 30 September 2024.\nSee also\n*The Battle at Lake Changjin (2021) and The Battle at Lake Changjin II (2022), two Chinese films set during the Korean War and co-directed by Chen Kaige\nReferences\nExternal links\n*"
    }
  ]
}