{
  "content": [
    {
      "type": "text",
      "text": "# The Clock that Went Backward__disambig_1\n\n\"The Clock That Went Backward\" is a 1881 fantasy short story by American writer Edward Page Mitchell.\nPlot\n(1829). Mitchell's story depicts the scene presented in this painting.]]\nThe narrator recalls his visiting his great-aunt Gertrude in Maine, alongside his cousin Harry. Gertrude frequently related her family history, dating back to her great-great-grandmother who migrated from Leiden to Plymouth Colony with \"a Puritan refugee\" in 1632. The boys grew skeptical of these stories, and imagined that she was old enough to have personally lived out the adventures ascribed to her ancestors.\nGertrude owned a Dutch clock, crafted by Jan Lipperdam in 1572, which had been stopped at a quarter past three for as long as the boys could remember. She claimed the clock had not worked since it had been struck by lightning, and resisted all efforts by the boys to confirm the extent of the damage or attempt repairs. One night, the boys discovered Gertrude winding the clock, causing it to run backwards. She briefly spoke to the clock until it stopped. Distraught, she turned the clock back to 3:15, then fell to the floor and died. In her will, Gertrude bequeathed her estate to the narrator, while Harry received only the clock.\nThe boys attend Leiden University, as specified in the will, and bring the clock with them. The narrator's philosophy teacher, Professor Van Stopp, bonds with the boys over their interest in Dutch history. During a tour of historical sites, they visit a place where the city wall was breached on the last night of the 1574 siege of Leiden. The professor is intrigued when Harry recognizes the importance of the person who identified the breach in time to mount a defense. If not for this defender, Van Stopp argues, Spain would have crushed the Dutch Revolt, and the \"birth of religious liberty and self-government by the people\" could have been delayed.\nDuring the boys' third year, Van Stopp visits them at their rooms on Breestraat and inquires about the clock. He is amused by the notion that it only runs backward. Citing Hegel's concept of Aufhebung, he suggests that the sequence of past, present, and future is arbitrary. As a storm gathers, Van Stopp winds the clock, disregarding the boys' warnings about Gertrude's death. A ball of fire appears and strikes the clock, stopping the mechanism and throwing the professor to the floor.\nThe narrator and Harry flee the house and find themselves in 1574, during the siege. The townspeople, near starvation and despairing that a relief fleet will not arrive in time, are debating whether to accept an offer of amnesty from Francisco de Valdez. A mob forms to confront the burgomaster, Pieter Adriaanszoon van der Werff. In the commotion, Harry rushes to the aid of the burgomaster's daughter, who kisses him and introduces herself as Gertruyd. The burgomaster is unmoved by the mob, saying he would rather die than surrender, and invites them to kill him and eat his flesh. A shift in the wind renews hope that relief will arrive by morning. A crowd gathers overnight awaiting the first sight of the fleet.\nThe crowd is panicked by an explosion, knowing the wall has been breached but not the location. The narrator quickly finds the burgomaster and tells him where to find the breach. When they arrive, they find the attack is already being repelled. Among the defenders is Jan Lipperdam, whose resemblance to Professor Van Stopp surprises the narrator. Gertruyd tells her father that Harry spotted the breach, which has saved the city and all of Holland. The narrator implores Harry to return to their rooms, but Harry is reluctant to leave Gertruyd. Just then, the narrator loses consciousness, due to an arm injury sustained in the attack.\nThree days later, the narrator is back at the university, in the present day. His arm is bandaged, and the seat beside him is empty. In his lecture, Professor Van Stopp speculates about the influence of the 19th century upon the 16th century, asking \"If cause produces effect, does effect never induce cause?\"\nPublication history\nThis short story for boys was published anonymously in the New York newspaper The Sun on September 18, 1881, and not thereafter collected or publicised. As such it was a very ephemeral and slight work for juveniles, and it was not noticed by the critics of the time.\nRediscovery\nScience fiction historian Sam Moskowitz rediscovered Mitchell's stories and collected them in The Crystal Man: Landmark Science Fiction (1973). Since then, \"The Clock That Went Backward\" has been regarded as the first known instance of using a mechanical device for time travel and the first story using a temporal paradox as a central premise.  Any influence it may have had on later writers is uncertain. Its ephemeral publication history in an American daily newspaper has led to the widespread assumption that neither the British writers H. G. Wells and Lewis Carroll, nor the Spanish Enrique Gaspar knew of the story before they wrote their works involving the navigation through time by mechanical means.\nSee also\n*List of time travel works of fiction\nReferences\nExternal links\n*"
    }
  ]
}