{
  "content": [
    {
      "type": "text",
      "text": "# The Elf Queen of Shannara\n\n(paperback)\n| dewey= 813/.54 20\n| congress= PS3552.R6596 E48 1992\n| oclc= 24696394\n| preceded_by   = The Druid of Shannara\n| followed_by   = The Talismans of Shannara\n}}\nThe Elf Queen of Shannara is a fantasy novel by American writer Terry Brooks, the third book of the tetralogy: The Heritage of Shannara. It was first published in 1992.\nPlot summary\nWren Ohmsford, a descendant of the legendary Jerle Shannara, was charged by the shade of the Druid Allanon to travel to the distant island of Morrowindl and find the Elves to bring them back to the Four Lands. However, Elves have not been seen in the Four Lands for over a century. No one in the Westlands knew of them---except, finally, the Addershag, who told Wren how to locate one.\nTo Morrowindl\nTiger Ty, the Wing Rider, carried Wren Ohmsford and her friend Garth to the only clear landing site on the island of Morrowindl, where the Elves might still exist. A Splinterscat, Stresa, and a Tree Squeak, Faun, help her reach the city of Arborlon. The island has become a prison since demons began appearing. Only the magic of the Loden keeps Arborlon safe, but its power is failing, and if the Elves are not returned to the Westland soon, they will not survive. Upon reaching the Elves, Wren learns about her true Elven heritage, as her maternal grandmother is the current Elf Queen, Ellenroh Elessedil.\nBack to Westlands\nNine companions set out on a journey to the Westland: Aurin Striate, an acquaintance Wren and Garth befriend on their way into the city; Triss, Captain of Home Guard; Cort and Dal, Elven Hunters; Ellenroh Elessedil, current queen of the Elves; Eowen, the queen's closest friend; Gavilan Elessedil, the queen's nephew and Wren's cousin; Wren; and Garth. Ellenroh becomes fatally ill, and before she dies, she informs Wren that she is to inherit the Loden and become the Queen of the Elves after Ellenroh, though she was orphaned at birth and raised as a Rover.  Upon Ellenroh's death, Eowen reveals that the demons they are trying to avoid were created as an accident by Elves.  She reveals that the elves succeeded in regaining their lost magic and to protect their nation from the Federation they created an army of replica elves, but that they became addicted to the magic and transformed into the demons. Wren leads the company with the Loden, but loses all her companions to the demons, Drakuls, and the Wisteron. Only Wren and Triss, Stresa, and Faun remain when the volcano on the island of Morrowindl erupts, destroying the island. Tiger Ty gathers the small company and flees Morrowindl, where Wren restores Arborlon to its original location in the Westland.\nCharacters\nThe list for order of appearance has only the characters that had a physical part in the story:\n* Ellenroh Elessedil\n* Cort\n* Wren Ohmsford/Elessedil\n* Garth\n* Spirit\n* Tiger Ty\n* Stresa\n* Wisteron\n* Faun\n* Aurin Striate\n* Phaeton\n* Triss\n* Eowen Cerise\n* Gavilan Elessedil\n* Dal\n* Barsimmon Oridio\n* Eton Shart\n* Walker Boh\n* Cogline\n* Rumor\n* Coll Ohmsford\n* Ulfkingroh\n* Rimmer Dall\n* Par Ohmsford\n* Damson Rhee\nReferences"
    }
  ]
}