{
  "content": [
    {
      "type": "text",
      "text": "# The Nebula Awards Showcase 2011\n\nThe Nebula Awards Showcase 2011 is an anthology of science fiction short works edited by American writer Kevin J. Anderson. It was first published in trade paperback and ebook by Tor Books in May 2011. The first British edition was published in trade paperback and ebook by Robinson in February 2012 under the alternate title The Mammoth Book of Nebula Awards SF.\nSummary\nThe book collects pieces that won or were nominated for the Nebula Awards for best novella, novelette and short story for the year 2010, profiles of 2010 Grand Master winner Joe Haldeman and Author Emeritus Neal Barrett, Jr., and representative early stories by each, various other nonfiction pieces and bibliographical material related to the awards, and the three Rhysling and Dwarf Stars Award-winning poems for 2009, together with an introduction by the editor. Not all nominees for the various awards are included.\nContents\n*\"Introduction\" (Kevin J. Anderson)\n*\"Final 2009 Nebula Ballot\"\n*\"Hooves and the Hovel of Abdel Jameela\" [Best Short Story nominee, 2010] (Saladin Ahmed)\n*\"I Remember the Future\" [Best Short Story nominee, 2010] (Michael A. Burstein)\n*\"Non-Zero Probabilities\" [Best Short Story nominee, 2010] (N. K. Jemisin)\n*\"Going Deep\" [Best Short Story nominee, 2010] (James Patrick Kelly)\n*\"Bridesicle\" [Best Short Story nominee, 2010] (Will McIntosh)\n*\"Spar\" [Best Short Story winner, 2010] (Kij Johnson)\n*\"Neal Barrett, Jr.: Writer of Excellence, and My Brother\" [essay] (Joe R. Lansdale)\n*\"Getting Dark\" [short story] (Neal Barrett, Jr.)\n*\"The Gambler\" [Best Novelette nominee, 2010] (Paolo Bacigalupi)\n*\"Vinegar Peace (or, The Wrong-Way, Used-Adult Orphanage)\" [Best Novelette nominee, 2010] (Michael Bishop)\n*\"I Needs Must Part, the Policeman Said\" [Best Novelette nominee, 2010] (Richard Bowes)\n*\"Divining Light\" [Best Novelette nominee, 2010] (Ted Kosmatka)\n*\"A Memory of Wind\" [Best Novelette nominee, 2010] (Rachel Swirsky)\n*\"Sinner, Baker, Fabulist, Priest; Red Mask, Black Mask, Gentleman, Beast\" [Best Novelette winner, 2010] (Eugie Foster)\n*\"SFWA Damon Knight Grand Master: Joe Haldeman (Introduction)\" [essay] (Mark Kreighbaum)\n*\"SFWA Damon Knight Grand Master: Joe Haldeman (Appreciation)\" [essay] (Connie Willis)\n*\"A !Tangled Web\" [novelette] (Joe Haldeman)\n*\"The Women of Nell Gwynne's\" [Best Novella winner, 2010] (Kage Baker)\n*\"Song for an Ancient City\" [Rhysling Award for Short Poem winner, 2009] (Amal El-Mohtar)\n*\"Search\" [Rhysling Award for Long Poem winner, 2009] (Geoffrey A. Landis)\n*\"Fireflies\" [Dwarf Stars Award winner, 2009] (Geoffrey A. Landis)\n*\"Other Awards\"\nReception\nKirkus Reviews commended the book to \"readers who like their fantasy and science fiction short and punchy,\" calling Paolo Bacigalupi's contribution \"[t]he best of a spiffy bunch,\" as well as singling out Kosmatka's, Bakers, Johnson's, Foster's and McIntosh's pieces for special comment, while rating the remainder \"[n]o less worthy.\"\nRegina Schroeder in Booklist rated the volume \"[u]nsurprisingly, ... an excellent collection of thought-provoking, entertaining, and varied work from both masters at the height of their careers and rising stars,\" and \"a pleasing cross-section of what the genre has to offer.\" Haldeman's and Johnson's pieces were singled out for comment.\nJackie Cassada in Library Journal, citing the anthology's \"strong and varied selections,\" felt \"this serves as a top-notch introduction to the genre for newcomers and seasoned readers alike.\" James Patrick's, Rachel Swirsky's, Kage Baker's and Joe Haldeman's pieces are singled out for comment.\nDon Sakers in Analog Science Fiction and Fact, while noting that \"Nebula voters ... tend to prefer works that are mo[r]e literary and avant-garde than the average Analog story,\" and that only the Joe Haldeman Grand Master sample had appeared in the magazine, concluded \"[n]one of that matters. Whatever the process, the Nebula Awards generally go to fine stories on the cutting edge of the field.\"\nOn a down note, Tom Shippey wrote in The Wall Street Journal that \"[i]f you looked at only the \"Nebula Awards Showcase 2011\" ..., you might think that sci-fi was on its last legs: it is almost all fantasy, and such sci-fi as it contains is ... dystopian.\" In an apparent oblique judgment of the anthology as a whole, he noted \"[i]n Will McIntosh's \"Bridesicle,\" cryogenic corpses are revived to be looked over by buyers, but if a corpse doesn't appeal, back in the freezer it goes.\"\nThe anthology was also reviewed by Wendy Bousfield in The New York Review of Science Fiction, August 2011, Ed Carmien in SFRA Review no. 296, Spring 2011, and Paul Kincaid in Foundation no. 111, Spring 2011.\nNotes"
    }
  ]
}