{
  "content": [
    {
      "type": "text",
      "text": "# The Keepers of the 5 Kingdoms\n\n| screenplay     =\n| story          = James Hong\n| producer       =\n| starring       =\n| cinematography = Ace Underhill\n| editing        = Zack Ward\n| music          =\n| studio         =\n| distributor    = Mauris Film\n| released       =\n| runtime        = 110 minutes\n| language       = English\n| gross          =\n}}\nThe Keepers of the 5 Kingdoms is a 2024 epic fantasy film directed by Zack Ward, Produced by James Hong.\nStarring James Hong, the film also features a supporting ensemble cast including Matthew Sato, Michelle Mao, Anna Harr, Bai Ling, Dante Basco, Dave Sheridan, and Saxon Sharbino. The story follows a grandfather and his granddaughter who are transported from their small-town curio shop in Arizona to a mystical land through a portal stone. Together, they embark on an extraordinary journey to navigate the magical world and find their way back home.\nPlot\nPatsy Lee, a high school student, is working tirelessly to secure admission into a good college, hoping to escape the monotony of her small Arizona town. Her mother is often busy with work, and her grandfather, Chuck Lee, expresses frustration over Patsy’s disinterest in her Chinese heritage and language. Despite the family tensions, Patsy finds support in her best friend, Squirrel, and her close companion Hopper, with whom there is an unspoken romantic tension.\nThe ordinary turns extraordinary when Frank, a rat, and Hank, a chicken—both personified animals—arrive in search of a magical box. After an unexpected encounter, Patsy discovers the box they sought, and she, along with Squirrel, Hopper, and her grandfather, is transported to a mystical land brimming with magic and danger.\nThis magical world is dominated by the malevolent Lord Kuang, who seeks the magical box to unleash her full destructive power. Patsy and her companions face various threats, from dangerous butterflies and disguised ogres to the sinister Wu Witch and a hopping vampire. They must navigate this perilous realm, all while protecting the box and seeking a way back home. Along their journey, they encounter allies such as Ao, a wise tortoise, who helps guide them through their adventure.\nCast\n* James Hong as Chuck Lee\n* Michelle Mao as Patsy Lee.\n* Anna Harr as Squirrel.\n* Matthew Sato as Hopper.\n* Dante Basco as Frank.\n* Dave Sheridan as Hank.\n* Bai Ling as Kuang\n* Fiona Rene as Donna Lee\n* Saxon Sharbino as Allura\nProduction\nZack Ward directed and wrote the script for The Keepers of the 5 Kingdoms, originally Patsy Lee & the Keepers of the 5 Kingdoms alongside Ace Underhills. In a 2023 interview with Comic Book Resources, James Hong revealed that the inspiration for Patsy Lee & the Keepers of the 5 Kingdoms came from fairy tale comic books he used to read with his mother during his childhood. They [were] called dai shu -- dai meant \"[to] read aloud\" and shu meant \"tales\" – and that rhythm got into my soul because she would read them out loud, which is a custom in China. I got the story idea of doing something with an American teenager. I would be her grandfather and she somehow got us into trouble, and we escaped to the old Chinese kingdoms. She wants to get back, but we have to conquer the evil forces in the kingdom.\nOn June 4, 2024, Vision Films announced the release of Patsy Lee & the Keepers of the 5 Kingdoms. The film, which includes a largely Asian cast featuring James Hong, George Takei, and Bai Ling, blends elements of fantasy and adventure. It was scheduled for release via Video On Demand (VOD) after being acquired by Fairway Film Alliance, the film incorporates practical effects, puppetry, and visual effects, drawing inspiration from fantasy films of the 1980s.\nReception\nIn his review for Voices from the Balcony, Jim Morazzini gave Patsy Lee & the Keepers of the 5 Kingdoms a mixed rating of 3.5 out of 5 stars. He praised the creativity of the story, the commendable practical effects by Clara Gonzalez-Garza's team, and James Hong's standout performance. However, the review noted that certain elements, such as pacing and character development, were less effective in fully engaging the audience.\nReferences"
    }
  ]
}