{
  "content": [
    {
      "type": "text",
      "text": "# The War on Kids\n\n| runtime = 95 minutes\n| country = United States\n| language = English\n}}\nThe War on Kids is a 2009 documentary film about the American school system directed by Cevin Soling. The film examines American public education and argues that many public school systems are not only failing to educate, but are increasingly authoritarian institutions that are eroding the foundations of American democracy.\nThe War on Kids opened to generally positive reviews from critics.\nSynopsis\nThe War on Kids contends that students are denied basic freedoms based primarily on irrational fears, noting that they are searched, punished (and arbitrarily so in the crew's opinions), and forced to consume certain pharmaceutical drugs.\nThe film begins by studying the Zero Tolerance policies in public schools in the 1990s, which were designed to eradicate drugs and weapons at schools. By arbitrary application of this policy via unchecked authority, soon nail clippers, key chains, and aspirin were considered dangerous and violations of the rules. This policy, combined with Columbine-inspired fear, has resulted in kindergartners being suspended for using pointed fingers as guns in games of cops and robbers and students being suspended for having Midol and Alka-Seltzer. Increasingly, issues once dealt with by the guidance counselor or a trip to the principal's office are now handled by the police.\nStudents are denied basic constitutional rights. They can be searched, drug-tested, forced to incriminate themselves, and capriciously punished. Surveillance cameras, locker searches, and metal detectors are shown to be commonplace. Courts routinely uphold the school's right to do as they choose. The physical structure of these institutions are themselves oppressive, resembling prisons in many ways.\nIronically, the film shows that the drastic measures schools employ are ineffective as tools of protection. Security cameras did nothing more than film the Columbine massacre for news outlets. This oppressiveness does nothing to advance learning. Various teachers state on camera that this atmosphere is frustrating to work in, with all curriculum handed down from the state and that this “one-size-fits-all” approach does not work well with human beings.\nEven more harmful than this physical oppression is the use and abuse of psychiatric tools. The rampant diagnoses of ADD and similar conditions are shown to be intimately connected to pharmaceutical companies’ promotional activities. The alleged disorder known as ODD - oppositional defiance disorder - is used to further control kids by serving as a gateway for further authoritative measures, often of the extreme kind. Ritalin and other drugs are being over-prescribed. These strong drugs can have harmful consequences, including suicide and murder. Some school shooters, including the Columbine killers, have used or been on these drugs.\nThis film includes an area almost completely ignored in any discussion of education - the genesis of compulsory education. Public schools are modeled after a Prussian system, one geared towards creating compliant soldiers. Later, it was modified during the industrial revolution to train people for the work force (hence the bells signaling movement). Ultimately, the film argues that more funding, smaller classrooms, better trained teachers and other bromides won't produce effective education because the problems are deep and institutional. In director Cevin Soling's words, “I was converted by teachers, by a number of people I interviewed is that the main mission of school is submission to authority.”\nThe film concludes that the educational mission of the public school system has been reduced from one of legitimate learning and preparation for adult citizenship to one of control and containment.\nReception\nThe War on Kids opened in November 2009, in select areas, to favorable reviews. In Variety, Ronnie Scheib called it a \"startling wake-up call about appalling conditions prevailing in American schools,\" and argued the film was important in that it \"contradicts popular wisdom.\" Ella Taylor of The Village Voice called it a “lively documentary (that) lays out in hair-raising detail the authoritarian underpinnings of America's child-centered culture, in which a pervasive climate of fear distorts perception of the dangers posed by and to children.\"\nIn The New York Times, Jeannette Catsoulis called the film \"a shocking chronicle of institutional dysfunction\" and wrote, \"At least now you know why little Johnny won’t get out of bed in the morning.\"\nWriter Randy Cassingham's admits, “I don't agree with every aspect of the film, but I can tell you one thing: it sure made me think.” He added a post-script citing what he considered to be an egregious abuse of constitutional rights and professional ethics as relates to a kids' access to knowledge.\nThe review of the documentary offered by Michael Haas, president of the Political Film Society, starts by pointing out that only two nations have refused to sign the Convention on the Rights of the Child, Somalia and the United States. They write “ . . . the media has focused on the waterboarding of three suspected terrorists . . . but not on the thousands of children who have been captured, incarcerated, deprived of parental contact, interrogated, and thereby abused to such an extent that they have been tortured with impunity. Why the disinterest in the rights of children within the United States? The apparent main reason, that American adults want to maintain control over children, is the thesis of the documentary The War on Kids.”\nCultural critic Robert Barry Francos relates an incident from his life in middle school and contrasts that experience with the current atmosphere in today's schools: \"I was standing on the lunchroom line. The much bigger kid behind me kept poking me in the ribs . . . It was painful . . . and I told him to stop . . .but he would not. When I finally had enough, I turned, jumped (he was tall), and punched him in the face. He was definitively more shocked than hurt. The lunchroom ladies came out see what was the ruckus. When they heard what happened, they gave me a free lunch and the kid had to stay on line. That was the end of it. If that incident were to happen now, posits the new film documentary The War on Kids, I more likely to have been suspended for a year, been taken to court in shackles, and had a felony conviction on my record.”\nAwards\nThe War on Kids was named the best educational documentary of its year by the New York International Independent Film and Video Festival.\nSee also\n* Taking Children Seriously\n* The War on Children\nReferences\nExternal links\n*\n*"
    }
  ]
}