{
  "content": [
    {
      "type": "text",
      "text": "# The Land Before Time XI: Invasion of the Tinysauruses\n\n| narrator       = John Ingle\n| music          = Michael TaveraJames Horner (archival music from The Land Before Time)\n| editing        = Jay Bixsen\n| studio         = Universal Cartoon Studios\n| distributor    = Universal Studios Home Entertainment\n| released       =\n| runtime        = 81 minutes\n| country        = United States\n| language       = English\n| budget         =\n}}\nThe Land Before Time XI: Invasion of the Tinysauruses is a 2005 direct-to-video animated film and the 11th film in The Land Before Time series. It was released on January 11, 2005, by Universal Studios Home Entertainment.\nPlot\nEvery year, as the warm season approaches, a tree in the Great Valley blooms with pink flowers. The dinosaurs view these \"treesweets\" as a delicacy. However, because of the sweets' tastiness, and due to the fact that there seems to only be one such tree in the valley, there is hardly enough for every dinosaur. Because of this, no one may eat the treesweets until \"Nibbling Day,\" when they have reached the \"peak of their tastiness.\"\nMr. Threehorn is visited by an old friend, the Triceratops Tria. Mr Threehorn promises Tria the first treesweet, making Cera jealous. Cera refuses to become friends with Tria. She also becomes violent toward her friends when they make any references involving Tria. After being teased for his height by Cera, Littlefoot sulks about how \"little\" he is. Despite \"Nibbling Day\" not having arrived, Littlefoot approaches the tree, climbs the cliff next to it and tries to prove that he can reach the treesweets himself. While doing this, he accidentally falls through the tree, knocking down every single treesweet. Distraught, Littlefoot faints. After waking up, he finds himself surrounded by several Mussaurus. They have eaten all of the treesweets and run away once Littlefoot screams in fear.\nNoticing that every treesweet is gone, everyone suspects that Littlefoot is responsible. Fearing he will be banished as punishment, Littlefoot makes a parish truth and blames the “Tinysauruses”. Everyone begins looking for the tinysauruses, thinking of them as pests and preparing to drive them out of the valley. While searching the valley, Littlefoot falls down a pothole and finds Tinysauruses. Despite being initially afraid of the Tinysauruses, Littlefoot soon finds them to be nice and befriends them. Upon hearing how difficult it is for the Tinysauruses to find food, Littlefoot promises to help bring them food every night.\nLittlefoot's friends find him while he is bringing food to the tinysauruses. They also fall in the pothole and, upon meeting the Tinysauruses, agree not to tell the adults. The Tinysauruses leader, Big Daddy, distrusts the Great Valley's larger dinosaurs. He thinks they believe that \"because they're bigger, it makes them seem more important\". By morning, Cera decides to be friends with Tria.\nWhen sneaking off to see the Tinysauruses the following night, Littlefoot and his friends are discovered by Topps, who is on guard duty and sends them home. Afterwards, he meets up with Tria and they spot two Tinysauruses, Lizzie and Skitter, who have been waiting for food. A chase ensues that ends when Topps and Tria, who is trying to stop him, find the Tinysaurus colony. Topps gathers the other adults to let them know that he has found the Tinysauruses. As the adults prepare to block the caverns, Littlefoot stops them and fully admits what actually happened with the treesweets, involving how he knocked them off. The adults forgive him and decide to leave the Tinysauruses alone. But the Tinysauruses cave then collapses.\nThe Tinysauruses escape into the Mysterious Beyond and encounter two Utahraptors who chase them back into the Great Valley. Upon hearing that Littlefoot blamed everything on the Tinysauruses, Littlefoot's friends become upset with him. Angry at his friends' rejection, Littlefoot decides to set things right on his own. Cera apologizes to Tria about Topps being hard on her when she tried to stop him from hunting the tinysauruses down. Petrie, Ducky, and Spike become remorseful for how they treated Littlefoot. With Cera's help, they all try to find Littlefoot, but they mistake the Utahraptors for Littlefoot, and the two carnivores chase them through the Great Valley. Just as Ducky is about to be eaten, Littlefoot saves her. Topps and Tria also appear. The Tinysauruses then come to the children's aid and fight the Utahraptors. The adults of the valley reach the group and drive the Utahraptors back into the Mysterious Beyond through the same hole, which they cover up with a boulder to prevent them from coming back. Littlefoot and his friends reconcile afterwards.\nWith everything sorted out and friendships repaired, the Tinysauruses become residents of the valley. When Nibbling Day comes, Littlefoot reaches the treesweets by himself. All of the dinosaurs share the treesweets, learning how even small things can make a big difference.\nVoice cast\n* Aaron Spann as Littlefoot\n* Anndi McAfee as Cera / Diplodocus\n* Aria Curzon as Ducky\n* Jeff Bennett as Petrie\n* Rob Paulsen as Spike / Kosh\n* Leigh Kelly as Skitter\n* Cree Summer as Lizzie / Bonehead\n* Nika Futterman as Rocky\n* Ashley Rose Orr as Dusty\n* Michael Clarke Duncan as Big Daddy\n* Kenneth Mars as Grandpa Longneck / Longneck\n* Miriam Flynn as Grandma Longneck\n* John Ingle as Narrator / Topsy\n* Camryn Manheim as Tria\n* Tress MacNeille as Ducky's Mother / Petrie's Mother\nProduction\nMusic\nThe music score was composed by Michael Tavera. Some of his arrangements of James Horner's original themes from the first film can be heard in two shots of the film (one where Ducky, Petrie, and Spike tell Littlefoot why they are mad at him and the other where the Sharpteeth come out of a cave), though Horner was uncredited in this film. This was the last time that Tavera's arrangements of Horner's themes was heard in a Land Before Time film, as Horner died in a plane crash on June 22, 2015. Tavera's older themes from previous sequels can also be heard in other scenes from the film.\nThe music that plays in the background when Topsy catches Petrie trying to get one of the blossoms is the booby trap sliding scene music from An American Tail: The Treasure of Manhattan Island.\nAll tracks are written by Michele Brourman and Amanda McBroom.\nRelease\n* January 11, 2005 - VHS & DVD, the last Land Before Time film ever released on VHS\n* September 19, 2006 - DVD – 2 Tales of Discovery and Friendship\n* August 5, 2008 - Carrying Case DVD with Fun Activity Book – 2 Tales of Discovery and Friendship – Universal Watch on the Go\nReception\nThe Land Before Time XI: Invasion of the Tinysauruses is considered by many critics and fans to be among the worst in the series alongside The Wisdom of Friends, with many citing a confusing storyline and poorly-written songs.\nSee also\n* List of films featuring dinosaurs\nReferences\nExternal links\n*"
    }
  ]
}