{
  "content": [
    {
      "type": "text",
      "text": "# The Monkey King Conquers the Demon\n\n| director       = Te Wei, Lin Wenxiao, and Ding Xianyan\n| writer         = Lei Bo and Te Wei\n| music          = Fuzai Jin\n| released       =\n| runtime        = 89 mins\n| country        = China\n| language       = Chinese\n}}\nThe Monkey King Conquers the Demon is a 1985 Chinese donghua feature film directed by Te Wei, Lin Wenxiao, and Ding Xianyan and produced by the Shanghai Animation Film Studio. The film serves as a loose sequel to Havoc in Heaven, and adapts later episodes in the 16th century Chinese novel Journey to the West.\nPlot\nAs a punishment for rebelling against the heavens, Sun Wukong, the Monkey King, has been trapped under a mountain for 500 years, until he is helped by the monk Tang Sanzang. The two come to respect each other and the Monkey King decides to help him on his pilgrimage to the West and to become his disciple. They are joined along the way by Pigsy and Sandy.\nMeanwhile, a group of demons plot to attack Monk Tang and eat his flesh, as they believe that it will give them immortality. The White Bone Demon, Baigujing, arrives and warns them that the Monkey King is the monk's disciple, and that he is a very powerful opponent. Though this causes all the other demons to lose hope, Baigujing devises a scheme to subdue the Monkey King by disguising herself as an innocent beautiful woman.\nWhen the group encounters Baigujing in disguise, she tells them that she would like to travel with them. However, the Monkey King sees through her illusions and attacks her, resulting in her apparent death. This leads Monk Tang to become angry at the monkey for attacking the ostensibly innocent woman.\nThe group travels on and discovers a young child claiming to have lost his mother. Once again, the Monkey King sees through the demon’s disguise and attacks her. After a battle between the two, the demon tricks him and manages to escape, so that she can disguise herself as an elderly man in front of Monk Tang. When the Monkey King once again attacks this seemingly innocent person, Monk Tang defends the old man, allowing the demon to escape. The monk decides to reject the Monkey King as his disciple and the two part ways.\nThe Monkey King flies away and returns to his home where he is greeted by his people. He learns that they have been ravaged by the heaven for the past 500 years while he was trapped beneath the mountain. The Monkey King calls upon the gods in heaven to help him rebuild his home.\nMonk Tang, Pigsy, and Sandy travel onward into a buddhist temple, where they are attacked by Baigujing. While the monk and Sandy are captured, Pigsy manages to escape to go warn the Monkey King. Realizing the demons might have followed Pigsy, the Monkey King refuses to come back with him, and instead chooses to follow him in secret. He tricks Baigujing into thinking he is her mother (the Nine-Tailed Vixen from the Golden and Silver Horned Kings adventure in the original novel) and manages to defeat her and free Monk Tang. Having seen that the Monkey King was telling the truth, the monk asks for his forgiveness, which he accepts.\nCast\n* Li Yang as Sun Wukong\n* Tan Pengfei as Tang Sanzang\n* Zhan Che as Zhu Bajie\n* Zhao Bing as Sha Wujing\n* Hong Rong as Baigujing\nDifferences from the original novel\n*When she took on the identity of a young woman in the original novel, she's a maiden instead of a widow.\n*Her second impersonation is an elderly mother of her first in the original novel instead of being her young son.\n*In her last impersonation, she did manage to avoid being killed by the Monkey King hence, succeeded in capturing the Tang Priest unlike the original novel.\nProduction\nTe Wei was the producer of Havoc in Heaven and director of the Shanghai Animation Film Studio at that time. During this period, he expressed interest in directing his own film, with fellow director Ding Xian Yan reminiscing years later that \"It was obvious that Te Wei wanted to make an animated feature film. He asked me to accomplish his long-cherished wish.\" Production for the film began in 1982, and completed in 1985. It was originally created as a 5-episode series, but was condensed into a single film. Much of the artistic style stayed true to what was established by Havoc in Heaven, but its \"animation had more delicate depictions of the details of the character actions and psychology\".\nRelease\nThe film was screened as part of the official competition for the 1987 Annecy International Animated Film Festival.\nA remaster of the film was released in April 2006 on a two-disc DVD special edition. It was adapted to Dolby 5:1 surround sounds, and contains English subtitles.\nAwards\n6th Golden Rooster Awards\n* Won: Best animation\n'''6th Chicago International Children's Film Festival\n* Won First Prize\nMinistry of Radio, Film, and Television\n* Won: Outstanding Film Award\nShanghai Literature and Art Award'''\n* Won: Outstanding Film Award\nReferences"
    }
  ]
}