{
  "content": [
    {
      "type": "text",
      "text": "# The White Queen (TV series)\n\n| developer          =\n| writer             =\n| director           =\n| starring           =\n| composer           = John Lunn\n| country            = United Kingdom\n| language           = English\n| num_episodes       = 10\n| list_episodes      =\n| editor             =\n| executive_producer =\n| location           = Belgium\n| cinematography     =\n| camera             =\n| budget             = £25 million\n| company            = Company PicturesCzar Television\n| network            = BBC One\n| first_aired        =\n| last_aired         =\n| related            = The White PrincessThe Spanish PrincessThe Real White Queen and Her Rivals\n}}\nThe White Queen is a British television historical drama series for the BBC, based on ''The Cousins' War series of three interwoven novels — The White Queen, The Red Queen, and The Kingmaker's Daughter — of the 16 Plantagenet and Tudor novels by Philippa Gregory. The first episode premiered on BBC One on Sunday, 16 June 2013 in the UK.\nThe drama is set against the backdrop of the Wars of the Roses and presents the story of the women involved in the long conflict for the throne of England. It starts in 1464; the nation has been at war for nine years fighting over who is the rightful king of England, as two branches of the Plantagenet family, the House of York and the House of Lancaster, contest the throne. The story follows three women — Yorkist Elizabeth Woodville (Rebecca Ferguson), wife of King Edward IV; Lancastrian Margaret Beaufort (Amanda Hale), mother of the Tudor King Henry VII of England; and Yorkist Anne Neville (Faye Marsay), wife of the Duke of Gloucester, King Richard III — all who manipulate events behind the scenes of history to gain power for themselves and their families. Elizabeth Woodville is the protagonist in the 2009 novel The White Queen, with Margaret Beaufort and Anne Neville the focus of the novels The Red Queen (2010) and The Kingmaker's Daughter (2012), respectively. All three characters appear in the three novels that make up the television drama.\nThe final episode of The White Queen aired on 18 August 2013 and the drama was released on DVD and blu-ray discs the following day. Two days later, the BBC confirmed that The White Queen was always planned as a mini-series that would not be returning for a second series. However, there were two Anglo-American co-production sequels: The White Princess in 2017 and The Spanish Princess in 2019, both broadcast on the US television network Starz.\nThe White Queen'' was nominated for three Golden Globe Awards, four Primetime Emmy Awards and a People's Choice Award.\nCast\nMain\n*Juliet Aubrey as Lady Anne Beauchamp, Countess of Warwick, wife of Warwick and mother to Lady Isabel and Lady Anne\n*Veerle Baetens as Margaret of Anjou, queen consort to Henry VI of England\n*Aneurin Barnard as Richard III of England\n*Leo Bill as Sir Reginald Bray\n*Emily Berrington as Jane Shore, Edward IV's mistress\n*Ashley Charles as Thomas Grey, the eldest son of Elizabeth Woodville and Sir John Grey of Groby\n*Arthur Darvill as Henry Stafford, Duke of Buckingham\n*Shaun Dooley as Sir Robert Brackenbury\n*Rebecca Ferguson as Elizabeth Woodville, the \"White Queen\" and consort to Edward IV\n*James Frain as Richard Neville, 16th Earl of Warwick, \"the Kingmaker\"\n*Caroline Goodall as Cecily Neville, Duchess of York, mother of Edward, George, and Richard\n*Andrew Gower as Lord Strange, son of Lord Stanley\n*Rupert Graves as Lord Stanley, the fourth husband of Lady Margaret Beaufort\n*Amanda Hale as Lady Margaret Beaufort, mother of Henry Tudor, a great-granddaughter of John, Duke of Lancaster\n*Max Irons as Edward IV of England\n*Michael Jenn as Dr Lewis\n*Ben Lamb as Anthony Woodville, 2nd Earl Rivers\n*Lizzy McInnerny as Lady Sutcliffe\n*Tom McKay as Jasper Tudor, half-brother of Henry VI, brother-in-law to Lady Margaret Beaufort and uncle to Henry Tudor\n*Janet McTeer as Jacquetta of Luxembourg, the Countess Rivers, Elizabeth Woodville's mother\n*Michael Maloney as Sir Henry Stafford, third husband of Lady Margaret Beaufort\n*Michael Marcus as Henry Tudor, later Henry VII of England; son and heir of Lady Margaret Beaufort by Sir Edmund Tudor\n*Faye Marsay as Lady Anne Neville, \"the Kingmaker's Daughter\" and queen consort to Richard III\n*Freya Mavor as Elizabeth of York, eldest daughter and child to Edward IV and Elizabeth Woodville\n*David Oakes as George, Duke of Clarence, brother of Edward IV\n*Eve Ponsonby as Mary Woodville\n*Robert Pugh as Baron Rivers (later Earl Rivers), father of Elizabeth Woodville\n*Frances Tomelty as Lady Beauchamp, mother of Lady Margaret Beaufort\n*Eleanor Tomlinson as Lady Isabel Neville, Duchess of Clarence, wife of George, Duke of Clarence and elder sister of Lady Anne Neville\n*Rupert Young as Sir William Herbert, Lord Pembroke\nRecurring\n*David Shelley as Henry VI of England\n*Hugh Mitchell as Richard Welles, half-brother of Lady Margaret Beaufort\n*Nicholas Fagg and Otto Farrant as Thomas Grey\n*Rudi Goodman and Dean-Charles Chapman as Richard Grey, son of Elizabeth Woodville and Sir John Grey of Groby\n*Oscar Kennedy as young Henry Tudor\n*Joey Batey as Edward of Lancaster, son of Henry VI and Margaret of Anjou, married to Lady Anne Neville\n*Elinor Crawley as Cecily of York, daughter to Edward IV and Elizabeth Woodville\n*Sonny Ashbourne Serkis as the Prince of Wales (later King Edward V), eldest son and heir to Edward IV and Elizabeth Woodville; later one of the Princes in the Tower\nThe large majority of the cast is British, but since the drama was shot in Belgium, several local actors are featured: Veerle Baetens, Jurgen Delnaet, Joren Seldeslachts, Elsa Houben, Ben Forceville and Ben Van den Heuvel all appear in the serial. Rebecca Ferguson who portrays Elizabeth Woodville, the White Queen, is from Sweden (her mother is originally from England).\nProduction\nThe budget was £25 million and took 120 days to shoot, consisting of 250 sets including: dungeons, palaces, castles, 12 state banquets and at least two coronations. Filming spanned September 2012 to March 2013. Two edited versions were made, one for the BBC and a more sexually explicit version for the US.\nA companion two-part documentary series, The Real White Queen and Her Rivals, presented by Philippa Gregory, was made to accompany the series. It was broadcast on BBC Two on 17 and 24 July 2013.\nCredits\n*Executive producers: John Griffin, George Faber, Charles Pattinson for Company Pictures, Eurydice Gysel for Czar Television, Polly Hill for the BBC, Philippa Gregory and Colin Callender.\n*Series lead writer: Emma Frost and produced by Company Pictures. Lisa McGee and Nicole Taylor are also writers.\n*James Kent directed the first three episodes.\n*Other episodes were directed by Jamie Payne and Colin Teague.\n*Cinematographer: Jean Philippe Gossart. and David Luther.\n*Music: John Lunn.\nLocations\nThe White Queen was filmed on location in Belgium, where several landmarks in Bruges and Ghent represent locations in London and elsewhere:\n*The Gothic Hall in Bruges City Hall represents Westminster Hall\n*The Church of Our Lady in Bruges represents St Stephen's Chapel in the old Palace of Westminster\n*Heilige Geeststraat in Bruges represents a medieval London street\n*The Basilica of the Holy Blood in Bruges represents the Tower of London\n*In Ghent, filming took place in Gravensteen,the Castle of the Counts, Saint Peter's Abbey (Sint-Pietersabdij), Saint Bavo's Abbey (Sint-Baafsabdij), the Cloth Hall (Lakenhalle), the Castle of Gerald the Devil (Geeraard de Duivelsteen), Saint Bavo Cathedral (Sint-Baafskathedraal), and Augustijnklooster (Academiestraat).\n*Additional filming took place at Rumbeke, in Damme, and at Ursel Airfield – 23 locations for the first three episodes. The rest of the set was constructed at a nearby Philips factory. |titleR= |episodes=\n|AltDate = 9 August 2013\n|Viewers = 5.33\n|Aux4=0.457\n|ShortSummary = 1464: Having been widowed and lost access to her Lancastrian husband's property in the War of the Roses, Elizabeth Woodville is encouraged by her mother Jacquetta to put herself in the way of the new Yorkist King, Edward IV, and appeal to him directly. Edward, already with a reputation as a womaniser, is drawn instantly to Elizabeth's beauty, and arranges to see her again. When Elizabeth rejects his sexual advances, he agrees to marry her in private and later makes her Queen of England. However, the marriage does not go down well with the Court, especially with Edward's mother, Duchess Cecily, and his most trusted adviser, the Earl of Warwick.\n|LineColor = E97800\n}}\n|AltDate = 17 August 2013\n|Viewers = 5.70\n|Aux4=0.801\n|ShortSummary = 26th May, 1465 – 1469: An extravagant coronation is planned in an attempt to silence critics of the marriage between Elizabeth and the king. Warwick refuses to allow his daughters to become her ladies-in-waiting. Margaret Beaufort, whose son Henry Tudor has a claim to the throne, sides with Warwick and Edward's brother George, Duke of Clarence, in the hope that her child will be returned to her. Meanwhile, Warwick uses his elder daughter Isabel in an attempt to unify the Nevilles and the Yorks, by marrying her to the Duke of Clarence, heir presumptive to King Edward.\n|LineColor = E97800\n}}\n|AltDate = 24 August 2013\n|Viewers = 5.32\n|Aux4=0.704\n|ShortSummary = 1469 – 17 April 1470: After a rebellion by Warwick results in the deaths of Elizabeth's father and brother but fails to put George, Duke of Clarence, on the throne, an uneasy peace is concluded between Warwick and Edward. It lasts only a short time before they rebel again and are forced to flee to France. Their supporters in England, including Lancastrian Margaret Beaufort, are left to face the consequences. Seeking vengeance for her father and brother's deaths, Elizabeth and her mother Jacquetta turn to the occult, with devastating consequences for Isabel Neville, who loses her baby while en route to France.\n|LineColor = E97800\n}}\n|AltDate = 7 September 2013\n|Viewers = 5.00\n|Aux4=0.811\n|ShortSummary = 1470: Warwick the Kingmaker turns in desperation to Margaret of Anjou, the Lancastrian Queen, as his only option to stop his family from losing everything. His youngest daughter Anne is married to the heir to the Lancastrian throne, the cruel and spoilt Edward, Prince of Wales. In London, Edward and Elizabeth are troubled by news of this new alliance, and are surprised when Warwick leads an assault on London. Warwick, now in control of the country, has Jacquetta tried for witchcraft, but fails after she appeals to her friend Margaret of Anjou for a testimonial. Seeking sanctuary at Westminster Abbey with her children, Elizabeth is joined by her mother and gives birth to a baby boy.\n|LineColor = E97800\n}}\n|AltDate = 14 September 2013\n|Viewers = 4.56\n|Aux4=0.929\n|ShortSummary = October 1470 – May 1471: The demented Lancastrian Henry VI is restored to the throne, and Margaret Beaufort brings her son to receive his blessing. Margaret of Anjou sails for England with her new daughter-in-law Anne Neville. News that Edward is returning with an army unsettles the court. As Warwick and the Lancastrians raise an army to confront Edward, Elizabeth again turns to supernatural forces. Margaret Beaufort is horrified when her husband decides to fight for York; he is seriously wounded in battle. Edward's rule is assured by his victories at Barnet and Tewkesbury (during which Warwick and Prince Edward are killed) and the capture of Margaret of Anjou. Anne, grieving for her father, is nearly assaulted by Yorkist troops, but is rescued by Richard. Elizabeth rejoices at her husband's return, but is dismayed when he and his brothers murder Henry VI in order to remove all Lancastrian opposition.\n|LineColor = E97800\n}}\n|AltDate = 21 September 2013\n|Viewers = 4.59\n|Aux4=0.859\n|ShortSummary = 1471 – 1472: Although Warwick, Henry VI and Edward of Lancaster are all dead, the court is unsettled. Elizabeth is concerned by Edward's attraction to his new mistress, Jane Shore. She is devastated by the death of a baby son shortly after birth, coinciding with the death of her mother Jacquetta; her distress causes Edward to reaffirm his love for her. Meanwhile, George attempts to control the widowed Anne Neville and obtain sole access to the Neville inheritance by locking her away and threatening her with a convent. Isabel sides with George; her only friend is the King's youngest brother, Richard, who eventually snatches Anne from Clarence's grasp and marries her. Margaret Beaufort tries to increase her power by re-marrying to one of King Edward's closest advisers, Thomas Stanley.\n|LineColor = E97800\n}}\n|AltDate = 28 September 2013\n|Viewers = 4.58\n|Aux4=0.896\n|ShortSummary = 17 August 1473 – 18 February 1478: The brief peace is broken when Edward makes war on France, but both George and Richard are horrified when he makes peace in return for financial gain. Both Elizabeth and Anne give birth to sons. George's frustrations lead him to deal with the French king. When his wife Isabel dies, after giving birth to the son he has longed for, he accuses Elizabeth of causing her death by poisoning and employs a sorcerer to plot the king's death. Edward declares his brother a traitor, and condemns him to death. Duchess Cecily, who favours George above her other sons, pleads with Edward and blames Elizabeth. George selects drowning in a butt of Malmsey wine as his method of execution.\n|LineColor = E97800\n}}\n|AltDate = 5 October 2013\n|Viewers = 4.35\n|Aux4=0.910\n|ShortSummary = April, 1483: Edward IV is taken ill. Foreseeing his death, he asks Elizabeth to send for his brother Richard, Duke of Gloucester, whom he appoints Lord Protector. Elizabeth, mistrustful of Gloucester, asks her brother Anthony to arrange for her son, now King Edward V, to be brought to London by his half-brother Richard Grey; they are intercepted by Gloucester and taken to the Tower of London. Anthony pleads with Elizabeth to cooperate with Gloucester, and a truce is worked out, but Beaufort and her husband Stanley sow seeds of mistrust, recognising the potential advantage for Margaret's son. Elizabeth takes her children into sanctuary and tells Anthony to ensure that the fleet is ready to rescue them; ordered to send her second son to join his brother in the Tower, she sends a boy of common birth as a substitute. Gloucester, at first protective of his nephews, executes Anthony for treason when he learns of the Woodvilles' intentions. Richard's wife Anne Neville (who fears Elizabeth will eventually work to have Richard, her, and their son executed as traitors) instead persuades him to have his nephews declared illegitimate, on the grounds of a previous promise of marriage made by Edward to another woman. He and Anne are then crowned instead of his nephew.\n|LineColor = E97800\n}}\n|AltDate = 12 October 2013\n|Viewers = 4.16\n|Aux4=0.741\n|ShortSummary = July, 1483: Stanley advises Margaret to ensure that the two young princes do not survive; having unsuccessfully sought a sign from God, she instructs her men to kill the boys. Anne Neville, now queen, hints to Brackenbury that she would also prefer them dead. The attempted \"rescue\" fails. Buckingham is persuaded to give allegiance to Henry Tudor and implies that he will carry out the murder. The two boys in the tower (the Prince of Wales and the impostor planted by Elizabeth) have disappeared, presumed dead, and King Richard returns to London to look for them; Anne feels remorse, wondering if she is responsible. After Richard visits Elizabeth in sanctuary and assures her he played no part in her sons' death, she realises that Margaret has deceived her, and puts a curse on the boys' murderer. Buckingham, unable to join forces with Jasper Tudor, is captured and executed, and Margaret is placed under house arrest by Stanley for her role in the failed rebellion.\n|LineColor = E97800\n}}\n|AltDate = 19 October 2013\n|Viewers = 4.41\n|Aux4=1.155\n|ShortSummary = 1483 – 22 August 1485: King Richard III, confident of his reign, begins to take an interest in his niece Elizabeth of York. His wife Anne is jealous, but Richard claims that he is only trying to prevent Elizabeth's marriage alliance with Henry Tudor. Elizabeth warns her daughter of the curse they cast on Prince Edward's killer (that his children and grandchildren would be struck down prematurely). Following the death of their only son, an embittered and grief-stricken Anne dies. Remorseful, Richard dismisses Elizabeth. Lady Beaufort is still under house arrest, and there is friction between her and the young Elizabeth of York, who has been sent to stay with her; Elizabeth believes she will become Queen regardless of who wins the battle. As Henry Tudor prepares to cross the Channel, a solar eclipse takes place; Margaret sees this as a message from God that Henry will be king. She defies her confinement to ride to Bosworth, where she pleads with Stanley to fight against the king, but he refuses to commit because Richard has his son as a hostage. Margaret sees Jasper and is able to talk to Henry before the battle. Things are not going well for the outnumbered Tudor until Stanley's men charge the king's forces. Richard is killed. As Stanley kneels to offer Henry the crown, Margaret declares herself \"Margaret Regina\", ordering her husband to remain kneeling. Elizabeth is visited by her missing son Richard, masquerading as \"Perkin\", and warns him not to seek revenge. She tells her daughter that she will marry Tudor and become queen, just as she herself once was.\n|LineColor = E97800\n}}\n}}\nHistorical accuracy\nA number of anachronisms and historical inaccuracies received attention, especially in the costumes and locations used. Pat Stacey of the Irish Evening Herald, said that \"the historical howlers are piling up like bodies on a battlefield, week after week\", comparing it to the \"flaws\" spotted by \"nitpickers\" in Downton Abbey and ''Foyle's War''.\nBernadette McNulty, of The Daily Telegraph, commented that in the final episode, the Battle of Bosworth Field appears to take place in a forest rather than a field. Mary McNamara, of the Los Angeles Times, states that in order to fit thirty years of history into ten episodes, \"years collapse into minutes, intricate policy is condensed into cardboard personalities, and the characters are swiftly categorized as good or evil\".\nOthers questioned the depiction of the major characters. Amy Licence, Cecily's biographer, states that Cecily Neville, Duchess of York, is portrayed in the first episode as \"straight from the pages of a novel rather than the actual proud aristocrat who asserted her own right to rule\". Historian Michael Hicks commented, \"They've fiddled with the chronology\" but added, \"I can see why they decided to restrict the cast of characters, and play up the rivalry between Elizabeth and the Earl of Warwick\", and also said \"As with Philippa Gregory's source novels, they've done their research\".\nIn response to criticisms of the series being \"ahistorical\", Gregory stated that\nWhat [BBC One and Starz] wanted was not a historical series based on the documents from the War of the Roses. They wanted my take on it, so that's what they got.\nAneurin Barnard (who played Richard) stated, with regard to inaccuracies,\n...the truth can be pretty boring. You have to up the stakes and make something up or twist it to make it a little bit more exciting.\nReception\nOn Metacritic the show has a score of 70 based on reviews from 14 critics.\nReception in the UK\nIn the UK the critical reception was described as “mixed at best” and 'mostly scathing'. Sam Wollaston of The Guardian praised the characters, suggesting Janet McTeer (Jacquetta) stole the show. He also praised the romantic elements, commenting \"Mmmm, steamy\". Gerard O'Donovan of The Daily Telegraph praised the casting of the supporting characters and the exciting \"lust and vengeance\" fuelling the drama, but objected to the prettified portrayal of 15th century England. The Independent's Tom Sutcliffe found it \"less historically plausible than Game of Thrones\", but concluded that \"I’m sure it will give innocent pleasure to many\". Barbara Ellen in The Observer, compared the show to \"a strange Timotei advert, featuring fornication, shouting, horses, armour\", whilst commenting that the sex scenes, toned down in the British version, \"were so vanilla, I ended up fancying an ice cream\".\nReviewing the final episode for The Daily Telegraph, Bernadette McNulty stated that the series, \"fell between two stools—not serious enough for the scholars nor glitzy enough for the Game of Thrones fans\". The ratings were however good. The first episode received 6 million viewers, stabilising at around the 4–4.5 million mark from the second episode, although occasionally it dipped below this on first broadcast figures.\nReception in the US\nThe White Queen received generally positive reviews after airing on the Starz network on 10 August 2013. Joanne Ostrow of The Denver Post described the drama as \"Sexy, empowering and violent\". Linda Stasi of the New York Post agreed that the programme was a hit, saying \"The White Queen [is] a royal winner\". It was again unfavourably compared to HBO's high budget and fast-paced Game of Thrones. In comparison to Game of Thrones Neil Genzlinger speculated that \"even if dragons were allowed, they’d mostly be lounging around and, between bouts of relatively tame dragon sex, talking about eating people rather than actually eating them\". The performances of Janet McTeer and James Frain were praised by several American reviewers. Amanda Hale, despite receiving praise for her performance by British reviewers, was unfavourably reviewed by US critic Matthew Gilbert. He said \"There were moments when I rolled my eyes—Amanda Hale, as the mother of young Henry Tudor, looks as if she is going to explode with ill intent. Really, her performance could be transposed into a Mel Brooks spoof\". Louise Mellor of Den of Geek added \"Why does Lady Margaret Beaufort constantly look like she is sucking on a Murray Mint?\" TV Guide writer Matt Roush praised Hale's performance as \"intense\", and favoured the drama, labelling it as \"fun\", and on a one to ten scale, ranking it at seven.\nThe White Queen was nominated three times at the 71st Golden Globe Awards, with acting nominations for Ferguson and McTeer and an overall nomination for the miniseries in the Best Miniseries or Television Film category.\nAccolades\nThe White Queen was nominated for several awards including 3 Golden Globe Awards, 4 Primetime Emmy Awards and a People's Choice Award for Favorite TV Movie/Miniseries.\n71st Golden Globe Awards (2014)\n* Best Mini-Series or Motion Picture Made for Television\n* Best Performance by an Actress in a Mini-Series or a Motion Picture Made for Television – (Rebecca Ferguson)\n* Best Performance by an Actress in a Supporting Role in a Series, Mini-Series or Motion Picture Made for Television – (Janet McTeer)\n66th Primetime Emmy Awards (2014)\n* Outstanding Limited or Anthology Series\n66th Primetime Creative Arts Emmy Awards (2014)\n* Outstanding Music Composition for a Miniseries, Movie or Special (Original Dramatic Score) – Episode: \"The Final Battle\"\n* Outstanding Costumes for a Miniseries, Movie, or Special – Episode: \"The Price of Power\"\n* Outstanding Hairstyling for a Miniseries or Movie\n40th People's Choice Awards (2014)\n* Favorite TV Movie/Miniseries\n2014 Saturn Awards – Academy of Science Fiction, Fantasy & Horror Films\n* SBest Television Release on DVD/Blu-ray\n2014 ASC Award – American Society of Cinematographers\n* Outstanding Achievement in Cinematography in Television Movie/Mini-Series – David Luther for Episode: \"War at First Hand\" (nomination)\nOFTA Television Awards 2014 – Online Film & Television Association\n* Best Miniseries\nSatellite Awards 2013\n* Best Miniseries or Motion Picture Made for Television\nHome media releases\n{| class=\"wikitable\" style=\"width:99%; left:0 auto; text-align:center;\"\n|-\n! rowspan=\"2\" | DVD title\n! rowspan=\"2\" | Discs\n! rowspan=\"2\" | Year\n! rowspan=\"2\" | Episodes\n! colspan=\"3\" | DVD release\n! rowspan=\"2\" | Notes\n|-\n! Region 1\n! Region 2\n! Region 4\n|-\n|The complete series\n|4\n|2013\n|10\n|4 February 2014\n|19 August 2013\n|n/a\n|BBC version in region 2\n|-\n!rowspan=\"2\"|Blu-ray title\n!rowspan=\"2\"|Discs\n!rowspan=\"2\"|Year\n!rowspan=\"2\"|Episodes\n!colspan=\"3\"|Blu-ray Disc release\n!rowspan=\"2\"|Notes\n|-\n!Region A\n!Region B\n!Region C\n|-\n|The complete series\n|3\n|2013\n|10\n|4 February 2014\n|19 August 2013\n|n/a\n|BBC version in region B\n|}\nSequels\nThe White Princess\nDespite initial plans for a follow-up series, on 20 August 2013 the BBC announced they were not commissioning one, possibly due to the lukewarm reception the series received. However, in October 2013,The Telegraph reported that Starz was planning to develop a sequel miniseries called The White Princess, based on Gregory's 2013 novel of the same name.\nStarz CEO Chris Albrecht announced in January 2014 that the network was working with White Queen screenwriter Emma Frost on the project. Starz would produce the White Princess miniseries without involvement from the BBC. Gregory confirmed that the project was underway in August 2015. On 7 February 2016, Gregory announced on Facebook that the sequel was officially confirmed to be in production, with the scripts being written. Production on the eight-episode miniseries began in June 2016. It aired weekly on Starz from 6 April to 4 June 2017.\nThe Spanish Princess\nOn 15 March 2018, Starz announced that it would create a continuation of The White Queen and The White Princess to be titled The Spanish Princess, which would be based on Gregory's novels The Constant Princess and ''The King's Curse and centre on Catherine of Aragon. It premiered on 5 May 2019.\nSee also\n* The Hollow Crown (TV series)\nReferences\nExternal links\n*\n* [http://www.starz.com/originals/thewhitequeen The White Queen]'' at Starz\n*"
    }
  ]
}