{
  "content": [
    {
      "type": "text",
      "text": "# The Warrior-Lords of Darok\n\nThe Warrior-Lords of Darok is a 1982 role-playing game supplement published by Gamelords for The Fantasy Trip.\nContents\nThe Warrior-Lords of Darok is a supplement in which the plainslands nation of Darok is detailed, as are its repeated wars with neighboring Muipoco.\nThis includes a scenario which takes place in the land of Darok, which is dominated by brute strength. It features a treasure hunt, various encounters, a detailed information about the village of Ghee, and character generation tables for players.\nPublication history\nThe Warrior-Lords of Darok was written by Richard Meyer and Kerry Lloyd and published by Gamelords in 1982 as a 32-page book.\nShannon Appelcline noted that by the early 1980s, Howard Thompson \"was already looking to produce more group-oriented products for TFT. In 1982 he signed an agreement with RPG publisher Gamelords to create a campaign world for TFT. Metagaming soon published Gamelords's first two campaign books, The Forest-Lords of Dihad (1982) and The Warrior-Lords of Darok (1982). However Thompson terminated this agreement before any further work was done and two later books that were originally intended for TFT were instead published by Gamelords as supplements for their own ''Thieves' Guild game system.\"\nReception\nSteve List reviewed The Warrior-Lords of Darok for Fantasy Gamer magazine and stated that \"By itself, WLD'' is limited in scope, but if Gamelords' other components in the series are equivalent in their coverage of their specific areas, together they could provide an interesting corner of the world to knock around in. Players who take their fantasy seriously should take warning, however. The authors have a tendency toward rotten puns (The Treasure of Ziero Mhaddray), including some cribbed from other publications (the Gallowine River). Fortunately, it is not overdone. The overall quality of this module is less than those of GDW or Chaosium, but at the price it is acceptable. The caveat is that this module is more of a stage setting than a collection of ready-to-play scenarios. The GM will have to work to exploit it.\"\nAnders Swenson reviewed The Warrior-Lords of Darok and The Forest-Lords of Dihad for Different Worlds magazine and stated that \"these are two solid products which should find their way into the libraries of most TFT gamemasters, and many others who collect well-done scenarios.\"\nReviews\n*Abyss #24 (May/June, 1983)\nReferences"
    }
  ]
}