{
  "content": [
    {
      "type": "text",
      "text": "# The War of the Roses (film)__disambig_2\n\n| starring       =\n| music          = David Newman\n| cinematography = Stephen H. Burum\n| editing        = Lynzee Klingman\n| studio         = Gracie Films20th Century Fox\n| distributor    = 20th Century Fox\n| released       =\n| runtime        = 116 minutes\n| country        = United States\n| language       = English\n| budget         = $26&nbsp;million\n| gross          = $160 million\n}}\nThe War of the Roses is a 1989 American satirical black comedy film based on the 1981 novel by Warren Adler. The film follows a wealthy couple with a seemingly perfect marriage that begins to fall apart, as material possessions become the center of an outrageous and bitter divorce battle.\nThe film co-stars Michael Douglas, Kathleen Turner, and Danny DeVito. The three actors had previously worked together in Romancing the Stone and its sequel The Jewel of the Nile. DeVito directed the film, which also had producer James L. Brooks and actor Dan Castellaneta working on a project outside of The Simpsons. The opening title sequence was created by Saul Bass and Elaine Makatura Bass.\nIn both the novel and the film, the married couple's family name is Rose, and the title is an allusion to the battles between the warring houses of York and Lancaster who were contending for the English throne during the late Middle Ages. In Germany, the film was such a huge success that its German title Der Rosenkrieg became synonymous with high-conflict divorce and is now regularly used in the media.\nPlot\nHarvard Law student Oliver Rose meets Barbara when they bid on the same antique at a Nantucket auction. The pair start a passionate relationship, eventually marrying, having two children, and buying a large house in Washington, D.C. Over the next eighteen years, Oliver becomes a wealthy and influential corporate lawyer, while Barbara dedicates herself to raising their children and creating an aesthetically perfect home filled with material objects. With the children grown and soon leaving for college, Barbara realizes that she is unfulfilled and regrets the sacrifices she made to support her family. Having grown to resent Oliver's workaholism, controlling nature, and obliviousness to her feelings, she starts a catering company to achieve financial independence.\nWhile entertaining a client, Oliver is hospitalized for a suspected heart attack, and writes a love note to Barbara—saying he owes her everything—in case he dies. Barbara does not visit him or show any concern when he returns home, admitting that the thought of him dying had made her feel happy and free. She tells Oliver she no longer feels anything for him but contempt and wants a divorce, which Oliver reluctantly accepts.\nWhile meeting with Barbara's lawyer, tensions rise when she states that she wants nothing except for the house and its contents, and her lawyer uses Oliver's note against him. Although Barbara regrets sharing the note, Oliver spitefully refuses to let her have the house and stops the proceedings via a legal loophole identified by his lecherous colleague Gavin d'Amato. Oliver unsuccessfully tries to mend things with Barbara, but his inability to admit fault only drives her further away. She refuses his cash offer for the house and attempts to seduce Gavin so he will take her side. When Oliver physically divides the house into individual areas, a frustrated Gavin advises him to surrender his claim and move on. In response, Oliver fires Gavin as his lawyer.\nAfter Oliver accidentally runs over Barbara's cat and blames her for it, she retaliates by locking him in his private sauna, where he suffers heatstroke. Oliver takes his revenge by interrupting a dinner that Barbara is hosting for her clients, humiliating her and urinating on the food; Barbara retaliates by totaling Oliver's prized Morgan +4 sports car. During a fight, the pair destroy their furnishings and the antique from their first meeting. Though worried, the children leave for college, and the housekeeper Susan quits, leaving Barbara and Oliver alone.\nBarbara invites Oliver to dinner to talk, but he still refuses to accept that she no longer loves him, leading Barbara to falsely claim she made their dinner from Oliver's beloved dog. The pair start fighting again, and Barbara retreats to the attic to loosen restraints on the hallway chandelier, intending to drop it on Oliver while he boards up the house to trap them both inside. Susan returns to collect her last paycheck only to find a manic Oliver and Barbara at each other's throats; she contacts Gavin for help.\nBy the time Gavin arrives, Oliver's and Barbara's quarrel has culminated in the pair hanging from the chandelier, where Oliver admits that, despite their hardships, he always loved Barbara; she does not respond. The chandelier cable fails, sending Barbara and Oliver crashing to the floor. With their final breaths, Oliver reaches out to touch Barbara's shoulder, but she pushes his hand away.\nGavin, having recounted their tale to his client, gives him two options: proceed with divorcing his wife—being as generous as possible so it is resolved quickly—and rebuild his life, or go home and remind himself why he fell in love with her. The client leaves. Gavin, changed by his experience with the Roses, calls his wife to tell her he loves her and is on his way home.\nCast\nRelease\nThe premiere of The War of the Roses took place in Los Angeles on December 4 and in New York at the Gotham Theatre on December 6, 1989. It was released in the United States on December 8, 1989, by 20th Century Fox. The film was preceded in theaters by \"Family Therapy\", a The Simpsons short from The Tracey Ullman Show that was also included on the film's UK and Australian VHS rental releases.\nHome media\nThe War of the Roses was released in the United States on DVD Special Edition on December 18, 2001. Released by 20th Century Fox Home Entertainment, the film is presented in its original 1.85:1 widescreen format. This THX certified DVD features director commentary with Danny DeVito, deleted scenes, computer sketches, storyboards, still galleries, 4 theatrical trailers, and 6 TV advertisements. A Blu-ray Filmmakers 'Signature Series' released on September 18, 2012, ports over old bonus features and adds new featurette interviews in HD about revisiting the film and its musical score. A Blu-ray was released by Fox in the United Kingdom in January 2013 with the same extra features.\nReception\nBox office\nUpon its release, The War of the Roses grossed $87 million in the United States and Canada, and $73 million in other territories, for a worldwide total of $160 million.\nDuring the film's weekend debut it grossed $9.5 million across 1,259 theaters, finishing number-one at the box office the week ending December 10. The film grossed $6.9 million in its second weekend, representing a drop of just 26.5% and finishing second, and then made $5.5 million on the third. On its fourth weekend the film climbed up to first place again grossing $10,490,781 across 1,526 theaters on New Years long weekend. In its fifth weekend the film made $7 million, bringing its running domestic total to $53.4 million. In its twelfth weekend, its domestic total earnings reached $80.5 million. It was the thirteenth highest-grossing film of 1989.\nCritical response\nOn Rotten Tomatoes the film has an 84% rating based on 45 reviews, with an average rating of 7/10. The site's critical consensus reads: \"The War of the Roses is a black comedy made even funnier by hanging onto its caustic convictions -- and further distinguished by Danny DeVito's stylish direction.\" On Metacritic the film has a score of 79% based on reviews from 17 critics, indicating \"generally favorable reviews\". Audiences polled by CinemaScore gave the film an average grade of \"B\" on an A+ to F scale.\nThe Chicago Sun Times film critic Roger Ebert gave it three out of four stars, writing \"The War of the Roses is a black, angry, bitter, unrelenting comedy, a war between the sexes that makes James Thurber's work on the same subject look almost resigned by comparison. And yet the Roses fell so naturally and easily into love, in those first sunny days so long ago.\" He concluded \"This is an odd, strange movie and the only one I can remember in which the moral is, 'Rather than see a divorce lawyer, be generous - generous to the point of night sweats.'\"\nSheila Benson of the Los Angeles Times called it \"Biting and vicious, a styptic pencil on the battered face of \"civilized divorce.\" It's also thoughtful, laceratingly funny, and bravely true to its own black-and-blue comic vision.\"\nPeter Travers of Rolling Stone wrote: \"Under the astute direction of Danny DeVito, who does a sly turn as Oliver's attorney, this acid-dipped epic of revenge is killingly funny and dramatically daring.\"\nAccolades\n{| class=\"wikitable sortable plainrowheaders\"\n|-\n! Award\n! Category\n! Subject\n! Result\n|-\n| BAFTA Awards\n| Best Adapted Screenplay\n| Michael J. Leeson\n|\n|-\n| Berlin International Film Festival Golden Bear\n| Best Director\n| Danny DeVito\n|\n|-\n|rowspan=3|Golden Globe Awards\n| Best Motion Picture – Musical or Comedy\n| James L. Brooks and Arnon Milchan\n|\n|-\n| Best Actor – Motion Picture Musical or Comedy\n| Michael Douglas\n|\n|-\n| Best Actress – Motion Picture Musical or Comedy\n| Kathleen Turner\n|\n|-\n|}\nRemake\nIn 2024, it was announced that Searchlight Pictures would remake the film, simply titled The Roses. The new film was directed by Jay Roach and stars Benedict Cumberbatch and Olivia Colman, in addition to Ncuti Gatwa, Kate McKinnon, Andy Samberg, Sunita Mani, Zoë Chao, Jamie Demetriou, and Belinda Bromilow.\nReferences\nExternal links\n*\n*"
    }
  ]
}