{
  "content": [
    {
      "type": "text",
      "text": "# The Challenge: Battle of the Exes II\n\n| location            =\n}}\n| num_episodes  = 16 (Reunion and 3 Specials Included)\n| network       = MTV\n| first_aired   =\n| last_aired    =\n| prev_season   = Free Agents\n| next_season   = Battle of the Bloodlines\n| episode_list  = List of The Challenge (TV series) episodes\n}}\nThe Challenge: Battle of the Exes II is the 26th season of MTV's reality game show, The Challenge, and the sequel to the show's 22nd season, Battle of the Exes. Filming occurred in Pedasí, Panama and Ørsta, Norway in August and September 2014, with former cast members from MTV's The Real World, The Challenge, and Are You the One? competing. With Are You the One?, this season marks the first to feature cast members from a show not produced by Bunim-Murray Productions.\nThe season was dedicated to cast members Diem Brown and Ryan Knight, both of whom died in November 2014, two months after filming ended. Brown was featured in an MTV special titled \"We Heart Diem\" that aired on December 9, 2014.\nA launch special, \"EX-tra Baggage\", hosted by T. J. Lavin and Battle of the Exes champion Camila Nakagawa, aired on December 30, 2014. The season premiered with a special 90 minutes episode on January 6, 2015, and concluded its run on March 24, 2015, with the Reunion  and \"The S... They Should've Shown\" specials.\nFormat\nBattle of the Exes II follows the same format as the original Battle of the Exes challenge, with the following differences:\n* After the first eight \"Dome\" games, a losing team will have a chance to re-join the competition in \"Battle of the EX-iled,\" which will pit a newly eliminated couple against the winner of the previous week's \"Ex-iled\" winner. Ex-ile matches and mini episodes were shown on MTV.com and MTV aired a Battle of the EX-iled Recap special after episode 6 showing progress in ex-iles up to that point.\n* At the end of the season, three teams will compete in the final challenge — for a share of a $350,000 prize (up $50,000 from the original Exes challenge). The first-place team wins $250,000, second-place wins $70,000 and third-place wins $30,000.\nContestants\n{|\n| valign=\"top\" |\n{| class=\"wikitable sortable\" style=\"white-space:nowrap\"\n|-\n! Male contestants !!Original season !! Finish\n|-\n|\n| The Real World: Portland\n|Winner\n|-\n|\n| The Real World: Las Vegas (2011)\n|Runner-up\n|-\n|\n| Real World: Ex-Plosion\n|Third place\n|-\n|\n| The Real World: Key West\n|Episode 11\n|-\n|\n| The Real World: Austin\n| Episode 10\n|-\n|\n| The Real World: San Diego (2011)\n|Episode 8\n|-\n|\n| The Real World: Portland\n|Episode 7\n|-\n|\n| Are You the One? 1\n|Episode 7\n|-\n|\n|The Real World: New Orleans (2010)\n|Episode 4\n|-\n|\n| Are You the One? 1\n|Episode 3\n|-\n|\n| The Real World: Paris\n|Episode 3\n|-\n|\n| Real World: Ex-Plosion\n|Episode 2\n|-\n|\n| The Real World: Las Vegas (2011)\n|Episode 1\n|}\n| width=\"10\"|\n|\n{| class=\"wikitable sortable\" style=\"white-space:nowrap\"\n|-\n! Female contestants !! Original season !! Finish\n|-\n|\n| The Real World: Brooklyn\n|Winner\n|-\n|\n| The Challenge: Fresh Meat II\n|Runner-up\n|-\n|\n| Real World: Ex-Plosion\n|Third place\n|-\n|\n| The Real World: Las Vegas (2011)\n|Episode 11\n|-\n|\n| The Real World: Portland\n|Episode 11\n|-\n|\n| The Real World: Cancun\n|Episode 8\n|-\n|\n| The Real World: Portland\n|Episode 7\n|-\n|\n| Are You the One? 1\n|Episode 7\n|-\n|\n|The Real World: New Orleans (2010)\n|Episode 4\n|-\n|\n| Are You the One? 1\n|Episode 3\n|-\n|\n|Real World/Road Rules Challenge: Fresh Meat\n|Episode 3\n|-\n|\n| Real World: Ex-Plosion\n|Episode 2\n|-\n|\n| The Real World: Portland\n|Episode 1\n|}\n|}\nTeams\n{| class=\"wikitable sortable\" style=\"white-space:nowrap\"\n|-\n! Team !! Male partner !! Female partner\n|-\n| Adam & Brittany\n|Adam Kuhn\n|Brittany Baldassari\n|-\n| Bananas & Nany\n|Johnny \"Bananas\" Devenanzio\n|Nany González\n|-\n| CT & Diem\n|Chris \"CT\" Tamburello\n|Diem Brown\n|-\n| Dustin & Jessica\n|Dustin Zito\n|Jessica McCain\n|-\n| Jay & Jenna\n|Jay Mitchell\n|Jenna Compono\n|-\n| John & Simone\n|John Jacobs\n|Simone Kelly\n|-\n| Johnny & Averey\n|Johnny Reilly\n|Averey Tressler\n|-\n| Jordan & Sarah\n|Jordan Wiseley\n|Sarah Rice\n|-\n| Knight & Jemmye\n|Ryan Knight\n|Jemmye Carroll\n|-\n| Leroy & Nia\n|Leroy Garrett\n|Nia Moore\n|-\n| Thomas & Hailey\n|Thomas Buell\n|Hailey Chivers\n|-\n| Wes & Theresa\n|Wes Bergmann\n|Theresa González\n|-\n| Zach & Jonna\n|Zach Nichols\n|Jonna Mannion\n|}\nPre-season romantic backgrounds\n*Adam & Brittany: On the first season of Are You the One?, Brittany immediately fell in love with Adam. Adam wasn't interested but Brittany was convinced they were a perfect match and spent the duration of the season cooing over Adam.\n*Bananas & Nany: The two had a brief dalliance outside of The Challenge. Towards the end of Free Agents, the two started to develop a closer friendship, and realized that they worked well together. Nany has stated that she can still feel the spark between them on some occasions.\n*CT & Diem: The two were paired together in the original Battle of the Exes season, and placed second in the final challenge. The two next competed on Rivals II, however, Diem felt that CT's political game interfered with their trust. CT ended up winning the competition, while Diem was eliminated right before the final challenge.\n*Dustin & Jessica: The two developed a brief relationship during Free Agents, after a newly single Dustin was reluctant to hook up with anyone, following his breakup with his Real World: Las Vegas housemate Heather Marter. Jessica hoped to re-connect with Dustin after the season, however, she stated during the Free Agents reunion that she discovered that Dustin hooked up with another girl.\n*Jay & Jenna: Jenna entered the Real World: Ex-Plosion house as Jay's ex. Jay tried to put his \"player\" ways in the past, however, Jenna never felt she was getting the respect she deserved when dating Jay. It was revealed during the Real World: Ex-Plosion reunion show that the two had broken up, as Jenna had grown tired of Jay's cheating ways.\n*John & Simone: At the beginning of the first season of Are You The One?, the two spent a good amount of time hanging out, but they discovered that they were not a perfect match early into the season. Once they began pursuing other people, jealousy erupted and bitter words were exchanged.\n*Johnny & Averey: The two started dating on The Real World: Portland. After the season, Averey left her Hooters job in Arizona and moved in with Johnny in Boston. However, the two broke up following accusations of cheating on Averey's part. Johnny later hooked up with Nany González during Free Agents, to the disgust of Averey.\n*Jordan & Sarah: The two had a short-lived flirt during Rivals II, before Sarah was removed from the competition for being left without a partner.\n*Knight & Jemmye: The two stated dating on The Real World: New Orleans and continued to date after the show. However, once Jemmye found out that Knight had cheated on her with an ex-girlfriend, she broke up with him. On Battle of the Seasons, the two worked well together, despite the fact that Jemmye said she would get back with Knight \"over her dead body.\" On Rivals II, their relationship soured, as Knight's main role in the house was bothering Jemmye, even going as far as to pour ketchup on her during an argument (Jemmye suffers from \"mortuusequusphobia\").\n*Leroy & Nia: Leroy & Nia were rumored to have hooked up on Free Agents, after the two were spotted exiting a bathroom together.\n** Leroy & Theresa: Leroy and Theresa had a brief romantic tryst during Rivals II, which quickly turned ugly afterwards.\n*Thomas & Hailey: The two were high-school sweethearts. Hailey is the girl Thomas lost his virginity to, but Thomas was distraught when he found out Hailey was not as innocent. During the Real World: Ex-Plosion, negative feelings resurfaced when Hailey entered the house. Thomas accused Hailey of ruining his experience and his relationship with housemate Jamie Larson. The two got into a fight which ended with Hailey leaving the show earlier to save their friendship.\n*Wes & Theresa: On Fresh Meat II, Theresa had crushes on Wes, as well as Kenny Santucci, but wasn't sure of who she wanted more. Initially, she was attracted to Kenny, but once he denied her advances, she turned her attention towards Wes. Wes' attraction towards Theresa faded once Kenny (and Wes' best friend Danny) confirmed that Theresa was indeed interested in Kenny first. On Rivals II, Theresa found a new attraction, Leroy, and the two hooked up in the top bunk of Wes' bunk bed. Wes proceeded to call Theresa \"the trashiest girl in the house\" during the \"Frenemies\" challenge.\n*Zach & Jonna: The two met on Battle of the Seasons and Jonna was instantly attracted to Zach, despite the fact that she had a boyfriend back home. Before she pursued any sort of relationship with Zach, Jonna called her boyfriend to break it off so she would not be a cheater. The two were almost inseparable on the show, with Zach doing anything in his power to keep Jonna's Team Cancun safe until they came in last place on that season's final mission and were eliminated. Zach moved to Los Angeles to continue dating Jonna, but he realized they were too different and left her.\nGameplay\nChallenge games\n* I Got You Babe: Teams have to advance from one tall building to another, on a tightrope that is suspended  above ground. The female partners advance on the tightrope, while their male partners are suspended on an overhead tightrope in a \"Superman\" position, and have to drop a rope toward their partners in order to advance on the tightrope. Teams are disqualified if the female partner falls off the tightrope. The team that advances from one building to another in the fastest time wins the Power Couple, while the team whose female partner falls off the rope in the fastest time is automatically sent to the Dome.\n** Winners: Wes & Theresa\n* Rounding the Bases: This challenge consists of a series of four tasks on a baseball diamond.\n** First base: Each team has to race across a bamboo lane, place a card between each other's lips, and either \"suck\" or \"blow\" in order to advance the card around bamboo poles. If a team drops the card, they have to start from the beginning. The three last-place teams (out of twelve) are eliminated from the challenge, while the last-place team at the first base is automatically sent to the Dome.\n** Second base: Each team has to unscrew a contraption — in a \"sexually suggestive\" manner; the male partner is positioned in front of and has to unscrew a pair of baseballs, while the female partner is positioned in front of and has to unscrew a baseball bat, and place the parts in a box at the finish line. The three last-place teams (out of nine) are out.\n** Third base: Each team has to lick off peanut butter at their designated stations in order to reveal numbers needed for a combination to unlock a pair of poles. The three last-place teams (out of six) are out.\n** Home plate: Three teams remain at the final phase of the challenge. Each partner has to grab a 30-foot pole, 60 feet apart, insert the tip of one pole into another, and push until one pole pops out at the other end. The first team to advance their poles wins the entire challenge.\n*** Winners: Bananas & Nany\n* On Again, Off Again: Teams have to spin on a wheel that is attached by ropes to a zip line above a pond, swim around a buoy at the opposite side of the pond, then return to the shore and ring a bell. Two teams (four players) compete at a time on the spinning zip line. The team with the fastest time wins the Power Couple, while the team with the slowest time is automatically sent to the Dome.\n** Winners: Jordan & Sarah\n* The Brush Off: First, the girls have to run and jump into a large square pool of red paint, and cover themselves with as much paint as possible, then race up a cargo net, where their male partners will be positioned on a platform, next to a series of hanging canvasses that have 12 white squares. The girls will then transfer the paint with their bodies to their male partners, who will jump onto their designated canvas, and try to cover 12 white squares within a three-minute time limit. The challenge is played in two separate heats — of five and four teams — and the team whose male partner covers the most squares within a three-minute time limit wins, while the team whose male partner covers the fewest squares is automatically sent to the Dome.\n** Winners: Zach & Jonna\n* Open Arms: Teams have to advance on a zip line above a pond, swim around a buoy at the opposite side of the pond, then return to the shore and ring a bell. First, the female partner is positioned on a heavy bag, while the male partner is positioned on a sled, and after each zip line is released, the guys will attempt to jump toward their female partners, then each teammate will swim together. Unlike the aforementioned \"On Again, Off Again,\" only one team competes at a time. The team with the fastest time wins the Power Couple, while the team with the slowest time is automatically sent to the Dome.\n** Winners: Wes & Theresa\n* '''Don't Forget About Me: Teams have to solve a memory puzzle while hiking up and down a mountain. First, the guys will lift up a 300-pound steel door out of the sand that is connected to a rope for as long as they can. Under the steel door is an answer key that contains various colors of squares and rectangles, which the female partners will have to memorize. Whenever the girls feel that they have memorized the answer key enough, or their male partners are unable to keep the steel doors from shutting, each partner will be required to hike up a mountain with a bag containing their puzzle pieces, to their designated puzzle station, which the girls will have to solve. The process continues back and forth, and the first team to correctly solve their puzzle wins the Power Couple. Initially, the last team to correctly solve their puzzle would be automatically sent to the Dome; however, due to time constraints and the reduced amount of daylight, the team with the fewest correctly solved puzzle pieces was sent to the Dome instead.\n** Winners:' Wes & Theresa''\n* Are You The One?: Teams are asked each team a series of trivia questions, which includes spelling, sports, geography, pop culture, and U.S. history. The challenge is played in multiple rounds, and each player is wrapped in a blanket that is hanging from a platform suspended above water. If teams correctly answers a question, they will stay in the game, but will get an \"X\" for each wrong answer. If a team gets two X's, both teammates are dropped into the water. The first team to be eliminated is automatically sent to the Dome, while the last team standing wins the Power Couple.\n** Winners: Jay & Jenna\n* Speed Dating: Teams have to jump back and forth from one tractor trailer to another, while each trailer is moving side by side at a speed of 30&nbsp;mph on a runway. Each team is positioned on one trailer, with an empty wall that has an arrow slot, while attached to a safety harness that is hanging from a platform on one trailer. Each partner alternates retrieving several colored balls from the opposite trailer. The goal is to deposit as many balls into the arrow slot on the wall as possible, before the trailers reach the end of the runway. The guys must stay on the outside of their female partners in order to avoid having their safety harness tangled up, and midway through the runway, the trailers will separate when they reach smoke signals, making it impossible for any partner to jump. A player must wait for their partner to return to the wall on one trailer before jumping onto the opposite trailer. The team that deposits the most balls into the wall wins the Power Couple, while the team that deposits the fewest balls is automatically sent to the Dome.\n** Winners: Leroy & Nia\n* Wrecking Ball: Players from each team are positioned on a square platform suspended 30 feet above water, and have to knock opposing players off the platform with a swinging canvas bag. Players can also use two dodgeballs to knock other players off. The last player standing on the platform wins the Power Couple for their team, while the first team to have both players to fall into the water is automatically sent to the Dome.\n** Winners: Jordan & Sarah\n* '''Don't Let Me Down: Teams have to descend down a series of five ropes hanging from the top of a 50-story building. Each team starts on a plank, and descends down each rope at the same time. When each partner reaches the end of a rope, they must transfer to the next rope together. If a player falls, their teammate can continue, however, the best performance is determined by which team descends the furthest together. If no team advances to the bottom rope, where a bell is located, the team that descends together the furthest and in the fastest time wins the Power Couple as well as an automatic bid to the final challenge. The team that descended the shortest distance is automatically sent to the Dome.\n** Winners:' Jordan & Sarah\nDome games\n* Pole Position: Teams have to advance up a 25-foot structure, with ladders on both sides, and a bell at the top. Each partner faces each other, has their hands and feet strapped together into wooden poles, and have to use the wooden poles to advance up the ladder. The team that advances to the top and rings a bell first wins.\n** Played by: Adam & Brittany vs. Dustin & Jessica\n*Banded Together: Teams will be joined together by a rubber band rope at one pole, and the teams must work together and work their way to the pole on the opposite side of the field, and hold onto the pole. The farther the teams advance from one pole, the more difficult it will be to reach the pole. The team that reaches the other pole first and holds on for five seconds wins. Note: Challenge previously used during the original Battle of the Exes.\n** Played by: Johnny & Averey vs. Thomas & Hailey\n*He Said, She Said: Similar to \"I Can\" from The Duel, teams bet on how much of a specific food item that a player of the opposing team can eat within a three-minute time limit. If a player succeeds, that player earns one point for their team, but if a player fails, the opposing team earns the point. This Dome game is played in a best-of-three rounds, and the first team to accumulate two points wins.\n** Played by: Adam & Brittany vs. John & Simone\n* Breaking Up: Teams have to pull on a rope that is connected to a wrecking ball, then use the wrecking ball to crash upward through two levels of cinder blocks within their designated towers. The first team to crash their wrecking ball through both layers of cinder blocks wins.\n** Played by: Adam & Brittany vs. Knight & Jemmye\n* Strung Out: Much like \"Hog Tie\" from The Ruins, players from each team are suspended by their arms and feet under poles, and have to shimmy their way from one side of the pole to the other, then ring a bell, and return to the starting line, where their partners will try to do the same. The girls begin the relay race under the poles, and the guys have to wait until their female partners have returned to the starting line. The first team to advance both players to one side of the pole and back wins.\n** Played by: Leroy & Nia vs. Bananas & Nany\n* Stacking Up: Similar to \"Stacking Stairs\" from The Duel, teams have to stack up a tower of crates from the ground, toward a 20-foot high bell. The guys will try to balance on the crates, while receiving crates from their female partners. The first team to reach their bell wins.\n** Played by: Johnny & Averey vs. Adam & Brittany''\n* Hooking Up: Several ropes with carabiners are hanging from the top of the Dome. Each team has to attach the carabiners to their opponent's back, which will launch their opponent to the top of the Dome. The game is played in same-gender battles, in a best-of-three rounds, and the first team to win two rounds wins.\n** Played by: Leroy & Nia vs. Johnny & Averey\n* Hammer It Home: Teams have to use a sledge hammer to advance an eye beam from one end of a track to another, where a bell is located. The guys will start by hammering the beam to the halfway point, where their female partners will take over. The first team to advance their beam to the end of the track wins.\n** Played by: Jordan & Sarah vs. Zach & Jonna\n* Hall Brawl: Similar to the original \"Hall Brawl\" in Battle of the Seasons (2012), Players must run through a narrow hallway past another contestant to ring a bell. However, this time the male players will go first and then tag their female partner at the other end of the hall. The players who ring the bell first in the best two out of three heats, wins the elimination.\n** Played by: Leroy & Nia vs. Wes & Theresa\n* X-Battle: Players battle one-on-one against each other, trying to wrestle an \"X\" from their opponent's hands. Played in same-gendered heats, the first team to two points wins. In the event of a tie, a coin-flip will determine the gender that would go against each other in one sudden death round. Note: Challenge previously used during the original Battle of the Exes.\n** Played by: Leroy & Theresa vs. Bananas & Nany\nEx-ile games\n* Sweaters: Each team must accumulate one liter of sweat, and with a squeegee, a towel and a sponge, then transfer the sweat to a measuring cup. If neither team accumulates one liter of sweat within a 60-minute time limit, the team that transfers more sweat into their cup wins, while the losing team is permanently eliminated from the competition.\n** Played by: Dustin & Jessica vs. Thomas & Hailey\n* Mental Problems: Players from each team have to transfer 36 colored coconuts from a gunny sack to their designated 6x6 puzzle grid in the sand. A player is allowed to transfer no more than two coconuts at a time, and only one player per team at a time. In addition, no coconuts of the same color can be placed in the same column or row. The first team to correctly solve their puzzle wins, while the losing team is permanently eliminated from the competition.\n** Played by: John & Simone vs. Dustin & Jessica\n* The Ring: Teams compete in a tug-of-war, while standing on platforms. Each player competes against a player of the same gender, has to pull on a rope with a ring in the middle, and try to knock their opponent off their platform. The game is played in a best-of-five rounds, and the first team to win three rounds wins.\n** Played by: Bananas & Nany vs. John & Simone\n* Control Issues: Teams compete in a tug-of-war, and must wrestle a two-foot pole from their opponent. The game is played in same-gender battles, in a best-of-three rounds, and the first team to win two rounds wins.\n** Played by: Bananas & Nany vs. Adam & Brittany\n* Take Out: Teams have to use a pair of bamboo poles to pluck out four round items from a deep rectangular ditch (one of them a soccer ball), and place the items inside their designated circle, with the poles. The first team to deposit all of their items into their circle wins.\n** Played by: Bananas & Nany vs. Johnny & Averey\n*It Takes Two to Tangle: Similar to \"Knot So Fast\" from Battle of the Seasons (2012), players from each team have 20 minutes to create as many knots using 200 feet of rope within a dome-shaped structure. After those 20 minutes are up, teams must untie their opponents' knots. The team who unties the opposing team's knots first wins the elimination.\n** Played by: Bananas & Nany vs. Zach & Jonna\nFinal challenge\nThe Final Challenge is a two-day race from a Norwegian fjord to the top of Mount Slogen. Prior to the start of the race, host T. J. Lavin explains that a team must complete the Final Challenge in order to get paid. To start, each team takes a helicopter ride, then will be dropped into the water, where they will have to swim to the shore to their first checkpoint, \"Kayak The Fjord.\" Each team must kayak their way through the fjord, where they will change into their team uniforms, then sprint to the third checkpoint, \"Mind Games.\" Each team has 30 minutes to unscramble a five-word sentence with a pile of rocks marked with letters. (The five-word sentence is \"You will respect the trolls.\") The third checkpoint is \"Don't Flip Your Lid,\" where each team has to flip a series of six cards with the Flag of Norway from the edge of a table into a series of six glasses filled with liquid fish eggs. Each team must consume one glass prior to flipping the cards. A team is required to consume a full glass for each time that they fail to flip a card into the glass after three attempts. (Note: Jay & Jenna were disqualified at this checkpoint, after Jay was unable to consume the liquid, leaving Jordan & Sarah and Leroy & Theresa as the only teams competing in the final.) Each team then sprints to the fourth checkpoint, \"Get Your Rocks Off,\" in which teams have 30 minutes to grab five rocks from a rockpile, and then toss the rocks from a distance into a bucket. Prior to this checkpoint, each team is required to consume a tube of liquid caviar. If players from each team misses, they must sprint back and continue the process of collecting rocks from the rockpile until they toss a total of five rocks into the bucket. The fifth checkpoint is a bicycle ride to the Slogen trailhead. The sixth checkpoint is a \"Rest Stop,\" where teams must take their place either within their designated zone next to a campfire, or on top of their beds. On day two, the final race is a grueling climb to the top of Slogen, in which the first-place team wins $250,000 and the second-place team wins $70,000. Since Jordan & Sarah made it to the rest stop first, they earned a five-minute headstart before Leroy & Theresa.\n* Winners: Jordan & Sarah\n* Runners-up: Leroy & Theresa\n* Third place: Jay & Jenna\nGame summary\n{|class=\"wikitable\" style=\"font-size:90%; white-space:nowrap\"\n|-\n!colspan=2|Episode\n!colspan=2 rowspan=2|Power Couple\n!colspan=4|Dome contestants\n!rowspan=2|Dome game\n!colspan=4|Dome outcome\n|-\n!#\n!Challenge\n!colspan=2 nowraP|Last-place\n!colspan=2 nowrap|Winners' pick\n!colspan=2|Winners\n!colspan=2|Eliminated\n|-\n! 1\n| I Got You Babe\n|style= \"background:silver;\"| ||Nowrap|Wes & Theresa\n|style= \"background:gray;\"| ||Adam & Brittany\n|style= \"background:blue;\"| ||nowrap|Dustin & Jessica\n|Pole Position\n|style= \"background:gray;\"| ||Adam & Brittany\n|style= \"background:blue;\"| || Dustin & Jessica\n|-\n! 2\n|Rounding the Bases\n|style= \"background:darkgreen;\"| ||nowrap|Bananas & Nany\n|style= \"background:navy;\"| ||nowrap|Johnny & Averey\n|style= \"background:silver;\"| ||Thomas & Hailey\n|Banded Together\n|style= \"background:navy;\"| ||nowrap|Johnny & Averey\n|style= \"background:silver;\"| ||Thomas & Hailey\n|-\n! 3\n| On Again, Off Again\n|style= \"background:red;\"| ||Nowrap|Jordan & Sarah\n|style= \"background:red;\"| ||John & Simone\n|style= \"background:gray;\"| ||nowrap|Adam & Brittany\n|nowrap|He Said, She Said\n|style= \"background:gray;\"| ||Adam & Brittany\n|style= \"background:red;\"| ||John & Simone\n|-\n! 4\n| The Brush Off\n|style= \"background:skyblue;\"| ||Zach & Jonna\n|style= \"background:black;\"| ||nowrap|Knight & Jemmye\n|style= \"background:gray;\"| ||Adam & Brittany\n| Breaking Up\n|style= \"background:gray;\"| ||Adam & Brittany\n|style= \"background:black;\"| ||nowrap|Knight & Jemmye\n|-\n! 5\n| Open Arms\n|style= \"background:silver;\"| ||Wes & Theresa\n|style= \"background:orangered;\"| ||Leroy & Nia\n|style= \"background:darkgreen;\"| ||Bananas & Nany\n| Strung Out\n|style= \"background:orangered;\"| ||Leroy & Nia\n|style= \"background:darkgreen;\"| ||Bananas & Nany\n|-\n! 6/7\n| nowrap|Don't Forget About Me\n|style= \"background:silver;\"| ||Wes & Theresa\n|style= \"background:dimgray;\"| ||Adam & Brittany\n|style= \"background:navy;\"| ||Johnny & Averey\n| Stacking Up\n|style= \"background:navy;\"| ||Johnny & Averey\n|style= \"background:dimgray;\"| ||Adam & Brittany\n|-\n! 7\n|Are You the One?\n|style= \"background:darkgreen;\"| ||Jay & Jenna\n|style= \"background:navy;\"| ||Johnny & Averey\n|style= \"background:orangered;\"| ||Leroy & Nia\n|Hooking Up\n|style= \"background:orangered;\"| ||Leroy & Nia\n|style= \"background:navy;\"| ||Johnny & Averey\n|-\n! 8\n|Speed Dating\n|style= \"background:orangered;\"| || Leroy & Nia\n|style= \"background:red;\"| || Jordan & Sarah\n|style= \"background:skyblue;\"| || Zach & Jonna\n|Hammer It Home\n|style= \"background:red;\"| || Jordan & Sarah\n|style= \"background:skyblue;\"| || Zach & Jonna\n|-\n!9/10\n|Wrecking Ball\n|style= \"background:red;\"| ||Jordan & Sarah\n|style= \"background:silver;\"| ||Wes & Theresa\n|style= \"background:orangered;\"| ||Leroy & Nia\n|Hall Brawl\n|style= \"background:orangered;\"| ||Leroy & Nia\n|style= \"background:silver;\"| ||Wes & Theresa\n|-\n!rowspan=2|10/11\n|rowspan=2|Don't Let Me Down\n|style= \"background:red;\" rowspan=2| ||rowspan=2|Jordan & Sarah\n|style= \"background:orangered;\" rowspan=2| ||rowspan=2|Leroy & Nia\n|style=\"background:darkgreen;\" rowspan=2| ||rowspan=2|Bananas & Nany\n|rowspan=2|X-Battle\n|style=\"background:orangered;\"| ||rowspan=2 nowrap|Leroy & Theresa\n|style= \"background:darkgreen;\" rowspan=2| ||rowspan=2|Bananas & Nany\n|-\n|style=\"background:silver;\"|\n|-\n! 11/12\n|Final Challenge\n|style= \"background:red;\"| ||Jordan & Sarah\n|colspan=9|2nd place: Leroy & Theresa; 3rd place: Jay & Jenna\n|}\nElimination progress\n{|class=\"wikitable\" style=\"text-align:center\"\n! colspan=\"2\" rowspan=\"2\"|Teams!!colspan=\"11\"|Episodes\n|-\n! 1 !! 2 !! 3 !! 4 !! 5 !! 6/7 !! 7 !! 8 !! 9/10 !! 10/11 !! Finale\n|-\n!style=\"background:red\" | ||Jordan & Sarah\n|SAFE ||SAFE || style=\"background:deepskyblue\"|WIN || SAFE || SAFE || SAFE|| SAFE||style=\"background:green\"|||style=\"background:deepskyblue\"|WIN ||style=\"background:deepskyblue\"|WIN ||style=\"background:lime\"|WINNERS\n|-\n!style=\"background:orangered;\"| ||rowspan=\"2\"|Leroy & Theresa\n| colspan=\"9\" rowspan=\"2\"\n| style=\"background:green\" rowspan=\"2\"|\n| style=\"background:skyblue\" rowspan=\"2\"|SECOND\n|-\n|style=\"background:silver;\"|\n|-\n! style=\"background:darkgreen\" | ||Jay & Jenna\n|SAFE ||SAFE || SAFE || SAFE || SAFE|| SAFE||style=\"background:deepskyblue\"|WIN ||SAFE || SAFE||SAFE ||style=\"background:orange\"|DNF\n|-\n! style=\"background:darkgreen\" | ||Bananas & Nany\n|SAFE ||style=\"background:deepskyblue\"|WIN ||SAFE  || SAFE || style=\"background:tomato\"|OUT || colspan=3 style=\"background:darkgray\"| ||SAFE ||style=\"background:tomato\"|OUT|| style=\"background:darkgray\" |\n|-\n! style=\"background:orangered\" | ||Leroy & Nia\n|SAFE ||SAFE || SAFE || SAFE || style=\"background:green\"| || SAFE|| style=\"background:green\"| ||style=\"background:deepskyblue\"|WIN || style=\"background:green\"| ||style=\"background:red\"| || style=\"background:darkgray\" |\n|-\n! style=\"background:silver\" | ||Wes & Theresa\n| style=\"background:deepskyblue\" |WIN ||SAFE || SAFE || SAFE || style=\"background:deepskyblue\"|WIN || style=\"background:deepskyblue\"|WIN ||SAFE ||SAFE ||style=\"background:tomato\"|OUT|| colspan=\"2\" style=\"background:darkgray\" |\n|-\n! style=\"background:skyblue\" | ||Zach & Jonna\n|SAFE ||SAFE || SAFE || style=\"background:deepskyblue\"|WIN || SAFE|| SAFE|| SAFE||style=\"background:tomato\"|OUT || colspan=\"3\" style=\"background:darkgray\" |\n|-\n! style=\"background:navy\" | ||Johnny & Averey\n|SAFE ||style=\"background:green\"| || SAFE || SAFE || SAFE||style=\"background:green\"| ||style=\"background:tomato\"|OUT || colspan=\"4\" style=\"background:darkgray\" |\n|-\n! style=\"background:grey\" | ||Adam & Brittany\n|style=\"background:green\"| ||SAFE || style=\"background:green\"| || style=\"background:green\"| || SAFE||style=\"background:tomato\"|OUT || colspan=\"5\" style=\"background:darkgray\" |\n|-\n! style=\"background:black\" | ||Knight & Jemmye\n|SAFE ||SAFE || SAFE || style=\"background:tomato\"|OUT || colspan=\"7\" style=\"background:darkgray\" |\n|-\n! style=\"background:red\" | ||John & Simone\n|SAFE ||SAFE || style=\"background:tomato\"|OUT || colspan=\"8\" style=\"background:darkgray\" |\n|-\n! style=\"background:black\" | ||CT & Diem\n|SAFE ||SAFE || style=\"background:violet\"|MED || colspan=\"8\" style=\"background:darkgray\" |\n|-\n! style=\"background:silver\" | ||Thomas & Hailey\n|SAFE ||style=\"background:tomato\"|OUT || colspan=\"9\" style=\"background:darkgray\" |\n|-\n! style=\"background:blue\" | ||Dustin & Jessica\n|style=\"background:tomato\"|OUT || colspan=\"10\" style=\"background:darkgray\" |\n|}\n;Competition\n: The team won the competition\n: The team did not win the final challenge\n: The team quit the final challenge and received no money\n: The team won the \"Power Couple\" mission and put another team into the Dome\n: The team was not selected to go into the Dome\n: The team won in the Dome\n: The team lost in the Dome and was eliminated\n: A contestant was removed from the competition due to medical reasons, so his/her partner was also eliminated\n: A contestant was disqualified from the competition due to disciplinary reasons, but his/her partner later received a replacement teammate in the Dome\nBattle of the EX-iled\nElimination chart\n{|class=\"wikitable\"\n|-\n!Episode\n!colspan=4|Ex-ile contestants\n!rowspan=2|Ex-ile game\n!colspan=4|Ex-ile outcome\n|-\n!#\n!colspan=2 nowrap|Inhabitant\n!colspan=2 nowrap|Challenger\n!colspan=2 nowrap|Winning team\n!colspan=2 nowrap|Losing team\n|-\n!1\n|bgcolor=\"blue\"| ||Dustin & Jessica\n|colspan=7 bgcolor=\"darkgray\"|\n|-\n!2\n|bgcolor=\"blue\"| ||Dustin & Jessica\n|bgcolor=\"silver\"| ||Thomas & Hailey\n|Sweaters\n|bgcolor=\"blue\"|\n|nowrap|Dustin & Jessica\n|bgcolor=\"silver\"|\n|nowrap|Thomas & Hailey\n|-\n!3\n|bgcolor=\"blue\"| ||Dustin & Jessica\n|bgcolor=\"red\"| ||John & Simone\n|nowrap| Mental Problems\n|bgcolor=\"red\"|\n|nowrap|John & Simone\n|bgcolor=\"blue\"|\n|nowrap|Dustin & Jessica\n|-\n!4\n|bgcolor=\"red\"| ||John & Simone\n|bgcolor=\"black\"| ||Knight & Jemmye\n|colspan=3 }}\n|bgcolor=\"black\"|\n|nowrap|Knight & Jemmye\n|-\n!5\n|bgcolor=\"red\"| ||John & Simone\n|bgcolor=\"darkgreen\"| ||Bananas & Nany\n|The Ring\n|bgcolor=\"darkgreen\"|\n|nowrap|Bananas & Nany\n|bgcolor=\"red\"|\n|nowrap|John & Simone\n|-\n!6/7\n|bgcolor=\"darkgreen\"| ||Bananas & Nany\n|bgcolor=\"dimgray\"| ||Adam & Brittany\n|Control Issues\n|bgcolor=\"Darkgreen\"| || Bananas & Nany\n|bgcolor=\"Dimgray\"| ||Adam & Brittany\n|-\n!7\n|bgcolor=\"darkgreen\"| ||Bananas & Nany\n|bgcolor=\"navy\"| ||Johnny & Averey\n|Take Out\n|bgcolor=\"darkgreen\"| ||Bananas & Nany\n|bgcolor=\"navy\"| ||Johnny & Averey\n|-\n!9\n|bgcolor=\"darkgreen\"| ||Bananas & Nany\n|bgcolor=\"skyblue \"| ||Zach & Jonna\n|Nowrap| It Takes Two to Tangle\n|bgcolor=\"darkgreen\"| ||Bananas & Nany\n|bgcolor=\"skyblue \"| ||Zach & Jonna\n|}\nEx-ile progress\n{|class=\"wikitable\" style=\"text-align:center\"\n|-\n!rowspan=2 colspan=2|Teams!!colspan=8|Episodes\n|-\n! 1 !! 2 !! 3 !! 4 !! 5 !! 6/7 !! 7 !! 9\n|-\n|bgcolor=\"darkgreen\"| ||'\n|style=\"background:lightgray\" colspan=4| ||style=\"background:green\"|}}||style=\"background:green\"|}}|| style=\"background:green\"|}}||style=\"background:lime\"|WON'\n|-\n|bgcolor=\"skyblue\"| ||Zach & Jonna\n|style=\"background:lightgray\" colspan=7| || style=\"background:tomato\"|OUT\n|-\n|bgcolor=\"navy\"| ||\n|style=\"background:lightgray\" colspan=6| || style=\"background:tomato\"|OUT || style=\"background:darkgray\" colspan=1|\n|-\n|bgcolor=\"dimgray\"| ||Adam & Brittany\n|style=\"background:lightgray\" colspan=5| ||style=\"background:tomato\"|OUT || style=\"background:darkgray\" colspan=2|\n|-\n|bgcolor=\"red\"| ||John & Simone\n|style=\"background:lightgray\" colspan=2| ||style=\"background:green\"|}}|| style=\"background:yellow\"| ||style=\"background:tomato\"|OUT || style=\"background:darkgray\" colspan=3|\n|-\n|bgcolor=\"black\"| ||\n|style=\"background:lightgray\" colspan=3| || style=\"background:violet\"|MED || colspan=\"4\" style=\"background:darkgray\" |\n|-\n|bgcolor=\"blue\"| ||Dustin & Jessica\n| style=\"background:yellow\"||| style=\"background:green\"|}} ||style=\"background:tomato\"|OUT ||style=\"background:darkgray\" colspan=5|\n|-\n|bgcolor=\"silver\"| ||Thomas & Hailey\n|style=\"background:lightgray\" colspan=1| ||style=\"background:tomato\"|OUT ||style=\"background:darkgray\" colspan=6|\n|}\n;Competition\n: The team won in the Ex-ile and returned to the competition\n: The team won in the Ex-ile\n: The team was in the Ex-ile, but did not compete against any team\n: The team lost the Ex-iled match, and was permanently eliminated from the game\n: A contestant was removed from the competition due to medical reasons, so his/her partner was also eliminated\nEpisodes\n|Viewers         = 0.78\n|LineColor       = B30713\n}}\n|ShortSummary    =\n|Viewers         = 0.91\n|LineColor       = FF5F57\n}}\n|ShortSummary    =\n|Viewers         = 0.84\n|LineColor       = FF5F57\n}}\n|ShortSummary    =\n|Viewers         = 1.01\n|LineColor       = FF5F57\n}}\n|ShortSummary    =\n|Viewers         = 0.99\n|LineColor       = FF5F57\n}}\n|ShortSummary    =\n|Viewers         = 0.75\n|LineColor       = FF5F57\n}}\n|ShortSummary    =\n|Viewers         = 0.83\n|LineColor       = FF5F57\n}}\n|ShortSummary    =\n|Viewers         = 0.76\n|LineColor       = FF5F57\n}}\n|ShortSummary    =\n|Viewers         = 0.83\n|LineColor       = FF5F57\n}}\n|ShortSummary    =\n|Viewers         = 1.03\n|LineColor       = FF5F57\n}}\n|ShortSummary    =\n|Viewers         = 1.01\n|LineColor       = FF5F57\n}}\n|ShortSummary    =\n|Viewers         = 1.03\n|LineColor       = FF5F57\n}}\nReunion special\nThe Reunion special aired on March 24, 2015, after the season finale and was hosted by Zuri Hall. The cast members who attended the reunion were: Jordan, Sarah, Leroy, Theresa, Jay, Jenna, Bananas, Nany, Wes, Nia, Zach, and Jonna.\nControversy\nDuring episode 11, cast member Nia Moore was expelled from the competition after physically and verbally harassing fellow The Real World: Portland cast member, Jordan Wiseley. After the episode aired, Moore apologized to anyone offended by her words and actions, during an interview with MTV News.\nDedications to Diem Brown and Ryan Knight\nOn November 14, 2014, Diem Brown died at the age of 34, following a decade-long battle with cancer. Brown was diagnosed in June 2014, though she had kept this information private. Two months later, media reports indicated that she collapsed during filming of Battle of the Exes II, and was subsequently airlifted to a New York-area hospital, where she learned her cancer had metastasized to her colon and stomach.\nOn November 27, 2014, Ryan Knight was found dead at the age of 28, following a house party in Kenosha, Wisconsin. Four months later (March 2015), autopsy results determined that Knight died of acute mixed drug and alcohol intoxication.\nBattle of the Exes II'' was Diem's and Knight's final appearance on The Challenge prior to their deaths, and MTV dedicated the season to their memories.\nNotes\nReferences\nExternal links\n*"
    }
  ]
}