{
  "content": [
    {
      "type": "text",
      "text": "# The King's Henchman\n\n]]\n'The King's Henchman' is an opera in three acts composed by Deems Taylor to an English language libretto by Edna St. Vincent Millay. The libretto is based on both legend and historical figures documented in the Anglo-Saxon Chronicle including Edgar the Peaceful, Elfrida of Devon, and Dunstan. It tells the story of a love triangle between King Eadgar, his henchman Aethelwold, and Aelfrida, daughter of the Thane of Devon. It premiered on 17 February 1927 at the Metropolitan Opera in New York City in a performance conducted by Tullio Serafin.\nBackground and premiere\n]]\nShortly after becoming General Manager of the Metropolitan Opera in 1908, Giulio Gatti-Casazza had set a goal of producing at least one new English-language opera by an American composer each season. These were often selected via a competition from works that had already been completed or partially composed. However, the competition for the 1927 season had thrown up no winner, and Otto Kahn, chairman of the board of directors of the Metropolitan Opera, approached Taylor directly with the offer of a commission. Taylor accepted immediately and set about finding a librettist.\n.]]\nAt the suggestion of his wife, Taylor approached the American poet Edna St. Vincent Millay, who had won the Pulitzer Prize for poetry two years earlier. Millay accepted on the condition that her name not be mentioned as the librettist until she had completed the work. Taylor left the choice of story to her, and she initially started working on a setting of the fairy tale Snow White with the provisional title The Casket of Glass. However, ill health and an incipient nervous breakdown led her to abandon the unfinished libretto and start afresh. She decided to base the story on figures in the Anglo-Saxon Chronicle, a subject that had fascinated her when she was in college, and began working on it in November 1925, first in Maine, and then in New Mexico at the home of Arthur Ficke.\nAt the premiere, Lawrence Tibbett, in his first major role at the Met, sang the role of King Eadgar, Edward Johnson sang Aethelwold, the King's henchman, and Florence Easton sang Aelfrida, the woman who comes between them. The large-scale production (twenty-two individual roles plus a chorus) was directed by Wilhelm von Wymetal with sets designed by Joseph Urban. The premiere was a great success both with the critics and the audience. There were over fifteen minutes of ovations at the end, and the composer and librettist were called back for five curtain calls.  The opera's reception prompted the Met to commission another work from Taylor, Peter Ibbetson, which premiered there in 1931. Millay's libretto was published separately as a book and sold out four editions in its first twenty days. A 1927 painting depicting a scene from Act 2 by the American artist N. C. Wyeth was commissioned by Steinway & Sons and is now in the Kelly Collection of American Illustration.\nPerformance history\nThe King's Henchman was received enthusiastically by critics and the public; notably earning a spot on the front page of The New York Times'' with the headline \"'KING'S HENCHMAN' HAILED AS BEST AMERICAN OPERA\". Following its premiere, the opera was staged sixteen more times at the Met over three seasons, with its last performance on 28 March 1929. Between 1927 and 1928, it was also toured to forty-six American cities with a total of ninety performances given by a company organized by Taylor. The touring cast starred soprano Marie Sundelius, tenor Rafaelo Díaz, and baritone Richard Hale.  On 18 September 1927 it became the first live opera to be broadcast on CBS Radio when it was performed in a condensed version narrated by the composer.\nThere were sporadic performances in the late 1930s. Cincinnati Opera staged the work in 1936, and in 1937 it was toured with the Federal Music Project, but despite its great success at the time, ''The King's Henchman soon fell out of the repertory and is now all but forgotten. , who created the role of Aelfrida at the world premiere]]\nPrincipal roles\n{| class=\"wikitable\"\n!Role\n!Voice type\n!Premiere Cast, 17 February 1927 (Conductor: Tullio Serafin)\n|-\n|Aethelwold, Earl of East Anglia and the King's henchman\n|tenor\n|Edward Johnson\n|-\n|Aelfrida, daughter of Ordgar, Thane of Devon\n|soprano\n|Florence Easton\n|-\n|Eadgar, King of England\n|baritone\n|Lawrence Tibbett\n|-\n|Maccus, servant and friend of Aethelwold\n|bass\n|William Gustafson\n|-\n|Ordgar, Thane of Devon''\n|baritone\n|Louis D'Angelo\n|-\n|Dunstan, Archbishop of Canterbury\n|tenor\n|George Meader\n|-\n|Hwita, Cup-bearer to the King\n|tenor\n|Max Bloch\n|-\n|Ase, servant to Aelfrida\n|mezzo-soprano\n|Merle Alcock\n|-\n|Thored, Master-of-the-Household to Ordgar\n|baritone\n|Arnold Gabor\n|-\n|}\nSynopsis\n:Place: England\n:Time: the 10th century\n, on whom Eadgar is based]]\nAct 1\nEadgar, the widowed King of England, is seeking a new wife and contemplating choosing Aelfrida, the daughter the Thane of Devon. He dispatches his henchman Aethelwold, and Aethelwold's servant Maccus, to Devon; if Aelfrida is as beautiful as her reputation claims, Aethelwold is to arrange the marriage.\nAct 2\nAelfrida finds Aethelwold sleeping in the woods and awakens him with a kiss. She had just uttered an incantation to make the next man who sees her fall in love with her. Aethelwold does indeed fall in love with her. He sends a message to the King that she is actually very ugly, marries her himself, and settles down in Devon.\nAct 3\nA  few months later, the couple become restless and decide to leave for Flanders to start a new life. Just as they are about to leave, Maccus announces that King Eadgar is arriving to visit them.  Aethelwold confesses his betrayal of the King to Aelfrida. She in turn is furious that she has missed the opportunity to be Queen of England. Nevertheless, she agrees to make herself as ugly as possible so that the King will not discover his henchman's treachery. However, when she appears before Eadgar, she has made herself look as beautiful as possible instead. The King confronts Aethelwold, who overcome with remorse, kills himself with his sword. The King orders that Aethelwold be buried with honour and reflects on all that has happened.\nRecordings\nThere have been no complete commercial recordings of the opera.\n*Two excerpts sung by Lawrence Tibbett, \"O Caesar, Great Wert Thou!\" from Act 1 and \"Nay, Maccus, Lay Him Down\"  from Act 3, were released on Victor Records in 1928 and later re-issued on LP by New World Records in Toward an American Opera 1911-1954.\n*The two arias noted above also appear on the Preiser Records 2003 CD Lebendige Vergangenheit: Lawrence Tibbett.\n*1998: the International Record Collectors' Club issued the CD Souvenirs From American Operas which contains three remastered excerpts from the opera taken from live broadcasts: Tibbett's \"O Caesar, Great Wert Thou!\", Jan Peerce and Vivian Della Chiesa singing the Act 3 duet \"God Willing, We Leave This House Tonight\", and Tibbett again in an extended Act 3 finale \"Eadgar, Eadgar\".\nReferences\n;Notes\n;Sources\n*Camner, James (October 1998). [https://web.archive.org/web/20121105054441/http://www.highbeam.com/doc/1P3-35203388.html \"Recording Review: Souvenirs from American Operas (IRRC 818)\"]. Opera News, Vol. 63, No. 4.\n*Downes, Olin (February 18, 1927). [https://select.nytimes.com/gst/abstract.html?res=F7091FF83C5F17738DDDA10994DA405B878EF1D3&scp=2&sq=%22King%27s+Henchman%22+olin&st=p \"King's Henchman Hailed as Best American Opera\"]. New York Times, p.&nbsp;1 . (The article is also reprinted in the [http://archives.metoperafamily.org/archives/scripts/cgiip.exe/WService=BibSpeed/fullcit.w?xCID=95450&limit=5000&xBranch=ALL&xsdate=&xedate=&theterm=The%20King's%20Henchman&x=0&xhomepath=http://archives.metoperafamily.org/archives/&xhome=http://archives.metoperafamily.org/archives/bibpro.htm Metropolitan Opera Archives].)\n*Kirk, Elise Kuhl (2001). [https://books.google.com/books?id=uIPDlKlchQ0C&dq=Deems+Taylor+%22The+King's+Henchman%22+tour&pg=PA172 American Opera]. University of Illinois Press.\n*Metropolitan Opera Archives. [http://archives.metoperafamily.org/archives/scripts/cgiip.exe/WService=BibSpeed/fullcit.w?xCID=95450&limit=5000&xBranch=ALL&xsdate=&xedate=&theterm=Henchman&x=0&xhomepath=http://archives.metoperafamily.org/archives/&xhome=http://archives.metoperafamily.org/archives/bibpro.htm ''The King's Henchman]. MetOpera Database\n*Millay, Edna St. Vincent (1927/2005). [https://books.google.com/books?id=FuMWyTIcaQAC The King's Henchman a Play in Three Acts]. Kessinger Publishing, 2005.  (originally published in 1927 by Harper & Brothers)\n*New York Times (October 20, 1950).[https://www.nytimes.com/learning/general/onthisday/bday/0222.html?scp=3&sq=St.%20Vincent%20Millay&st=cse \"Edna St. V. Millay Found Dead At 58\"]\n*Pegolotti, James A. (2003). [https://books.google.com/books?id=n5G_Lqh3h4UC&dq=Deems+Taylor+%22The+King%27s+Henchman%22&pg=PA139 Deems Taylor: A Biography]. UPNE (2003).\n*Phillips-Matz, Mary Jane (1984). [https://books.google.com/books?id=AdRw9A2a8K8C&dq=Deems+Taylor+%22The+King%27s+Henchman%22+commission&pg=PA94 The Many Lives of Otto Kahn]. Pendragon Press.\n*Youngstown Vindicator'' (February 18, 1927). [https://news.google.com/newspapers?id=rCRAAAAAIBAJ&sjid=rFgMAAAAIBAJ&pg=4003,5445&dq=king's-henchman+hailed+as+best+american+opera&hl=en \"Hail 'The King's Henchman' as Greatest American Opera\"]\n;Further reading\n*Brody, Elaine (December 1977). [https://www.jstor.org/stable/897622 \"The King's Henchman: Fifty Years Later\"]. Notes Second Series, Vol. 34, No. 2, pp.&nbsp;319–322\n*Jackson, Timothy F. (editor) Selected Poems of Edna St. Vincent Millay: An Annotated Edition. Introduction by Holly Peppe. (Yale University Press, 2016). Contains \"[White-thorn and black-thorn],\" \"[What art thou?],\" \"The Like of Thee,\" and \"[O moon, draw not aside].\"\nExternal links\n*[http://newdeal.feri.org/library/f56b.htm Scene from the 1937 Los Angeles performance of ''The King's Henchman''] on the Federal Music Project tour.\n*[http://archives.metoperafamily.org/Imgs/TibbettKingsHenchman.jpg Photograph of Lawrence Tibbett as Eadgar] from the Metropolitan Opera Archives.\n*[https://www.flickr.com/photos/laguardiaandwagnerarchives/4256833883/ Steinway & Sons 1928 advertisement] incorporating N. C. Wyeth's painting of Act 2."
    }
  ]
}