{
  "content": [
    {
      "type": "text",
      "text": "# The Unholy War\n\n| publisher = Eidos Interactive\n| platforms = PlayStation\n| released = |EU|October 30, 1998}}\n| genre = Fighting\n| modes = Single-player, multiplayer\n}}\nThe Unholy War is a PlayStation video game developed by Toys for Bob and published by Eidos Interactive. It is a fighting game in which characters fight in a 3D environment using melee and projectile attacks. The game came with a demo of Legacy of Kain: Soul Reaver.\nStory\nThe game is set on the planet Xsarra, on which two powerful forces are at war: the Arcanes (Xsarra's original inhabitants) and the Teknos (cybernetic conquerors who want the planet's resources for themselves). The Teknos crash-landed on Xsarra because they were fleeing from the \"Hunters\", a mysterious, powerful alien race unusually bent on the Teknos' destruction. The Teknos were hoping that the unusual radiation in Xsarra's atmosphere would mask their ship from the hunter's radar scanners. Finding out that there was Aur on Xsarra, they decided that if they stayed here and mined all the Aur on Xsarra, they need not worry about the Hunters ever again. The Natives of Xsarra did not like this idea, so they formed an allied group, the Arcane forces. They waged war for 20 years, until an uneasy peace was formed that lasted a few years. There was only one common rule: no two people (one from each nation) can have a baby. A few years later, Katrina, a rogue Quicksilver (a human-like creature that can transform into a silver being), and Andrus, a rebel Dark Angel/Stygian (an experiment gone wrong that created humans with wings), escaped into the wastelands to hide. Eventually they were captured before they could conceive a child. This is what started another war, but if they did have a child, the war would have destroyed all of Xsarra.\nGameplay\nThe game features two modes: mayhem mode, in which the player fights other characters in one-on-one battles, and strategy mode, in which the player fights campaigns on various battlefields. In both modes, the game is based around the taeng arena. Each character has three attack moves that take power from a constantly regenerating energy bar. The arenas have numerous hazards, teleporters and power-ups. Every character has its strengths and weaknesses against other characters.\nIn strategy mode, the overview map is made of a series of interlocking hexagons (called Hexes). On most maps, both sides have a base occupying a single Hex that can be used to buy or sell units. The player's aim is to destroy all of their opponent's units and their base. Strategy mode is turn-based; the player is allowed to make up to three moves before control switches to their opponent, who then makes three moves before said player regains control and so on.\nA 'move' consists of either moving a unit, or using a unit's special skill. Buying and selling units do not count as moves. The player can only move the same unit once per turn and use its special skill once per turn. Different units move different distances.\nTo attack an enemy unit, the player moves a unit onto an adjacent Hex and confirms an attack. The game then enters arena combat mode. Whoever loses the battle has the option of bringing another unit into the arena, provided it is next to the Hex being attacked. Combat ends when the loser surrenders or all of his 'backup' units have been killed.\nAUR is a magical resource that can be mined by placing a character onto a Hex containing AUR and as with moving and fighting, some units are better than others when it comes to mining. The player can get an extra 20 or 40 AUR at the start of every turn, provided the Hex stays occupied. AUR can be used to buy units or use a unit's special skill.\nThe enemy base is destroyed when one of the player's units enters the Hex it occupies, and all units guarding it are killed. The base generates 10 Aur per turn until it is destroyed.\nIn between each level, the player gradually receives more information on the game's story by an unknown being called \"the observer\". Reading these will show them how the story develops.\nReception\n| CVG = 3/5\n| EGM = 7.75/10\n| GI = 7.25/10\n| GamePro =\n| GSpot = 7.9/10\n| IGN = 8/10\n| OPM =\n}}\nThe game received an average score of 76.58% at GameRankings, based on an aggregate of 6 reviews.\nNotes\nReferences\nExternal links\n*"
    }
  ]
}