{
  "content": [
    {
      "type": "text",
      "text": "# The Queen of Corinth\n\nThe Queen of Corinth is a Jacobean era stage play, a tragicomedy in the canon of John Fletcher and his collaborators. It was initially published in the first Beaumont and Fletcher folio of 1647.\nDate\nScholars have dated the play to the 1616&ndash;18 period, based in part on an allusion in the play to \"the Ulyssean traveller that sent home his image riding upon elephants to the great Mogul\" (Act III, scene i). This is a reference to Thomas Coryat's Greetings from the Court of the Great Mogul, which was published in London in 1616. The play, therefore, could not pre-date that year. The casual and somewhat deprecating tone of the allusion – \"his wit is so huge, nought but an elephant could carry him\" – has been interpreted to mean that it also dates prior to Coryat's death in Surat in 1617, or prior to news of his death reaching England, in 1618 at the latest.\nThis dating is confirmed by the cast list added to the play in the second Beaumont and Fletcher folio of 1679, which cites Richard Burbage, Nathan Field, Henry Condell, John Lowin, John Underwood, Nicholas Tooley, Thomas Pollard, and Thomas Holcombe. The list indicates that the play was produced by the King's Men in the 1616&ndash;19 period, between Field's joining the troupe in the earlier year and Burbage's death in the later.\nAuthorship\nSince Francis Beaumont had retired from dramatic authorship in 1613 and had died in 1616, he could not have contributed to the authorship of The Queen of Corinth. One piece of external evidence states that Fletcher, Nathan Field, and Philip Massinger were collaborating c. 1616: an entry in the Stationers' Register dated 8 April 1654 assigns the lost play The Jeweller of Amsterdam to the three writers. The murder that that play dramatized occurred in 1616, and it is likely that the play was written soon after the event to capitalize on current public interest.\nThe styles of the three authors, Fletcher, Field, and Massinger, are distinctive enough to be fairly readily differentiable; scholars from E. H. C. Oliphant to Cyrus Hoy have been able to reach agreement on assignment of shares:\n::Massinger – Acts I and V;\n::Fletcher – Act II;\n::Field – Acts III and IV.\nOther plays of this period, ''The Honest Man's Fortune and The Knight of Malta,'' also show clear internal signs of being collaborations among the three playwrights.\nPossible Revision\nScholars have disagreed, however, on the nature of the trio's collaborative effort in The Queen of Corinth. Rather than a \"simple\" three-way authorial effort, some scholars have suggested that an original play written by Field and Fletcher (like Four Plays in One) was later revised by Massinger, perhaps around 1626. The fact that the play's leading comic character has two different names, Onos and Lamprias, is the kind of inconsistency that sometimes indicates a revision by a hand other than that (or those) the original author(s). Ira Clark regarded the hypothesis of Massinger's revision \"more plausible,\" the alternative of triple collaboration \"less likely.\"\nSynopsis\nThe play is set in ancient Greece. The city-state of Corinth is ruled by a Queen (otherwise unnamed), a middle-aged widow with an adult son, Theanor. The Queen is a virtuous, just, and capable ruler, but Theanor is \"a vicious Prince,\" and the play's villain. For some time before the play's action starts, Theanor has been the intended husband of Merione, a young ward of the Queen who has grown to adulthood in her court. This situation changes at the start of the play: Corinth's military conflict with Argos has been resolved peacefully, and the Argosian ruler Agenor has come to Corinth with the Queen's general Leonidas to formalize the peace. The Queen decides to promote a dynastic marriage between Agenor and Merione. Theanor is unhappy at losing his intended bride.\nSimultaneously, a young Corinthian named Euphanes has returned home from foreign travels. He is a younger son, and like many younger sons under the system of primogeniture, he has little in life, the family estates having descended to the older brother Crates upon their father's death. Crates is a mean-spirited individual who resents his younger brother's virtues and natural gifts. Crates is also a key follower of Theanor, and his primary assistant in evil deeds to come. The Queen, however, responds very positively to Euphanes on their first meeting, and he quickly becomes her new favorite. This instant promotion only adds to the resentments of Theanor and Crates. Euphanes enjoys the Queen's favor without restraint; her anger flairs when he requests permission to marry a young woman named Beliza – but the Queen soon recovers from her irritation. (Queen Elizabeth was famous for resenting, and interfering with, the marriage plans of her courtiers; the Queen in this play bears general resemblances to Elizabeth.)\nTheanor decides to vent his malice by raping Merione. Crates and other court sycophants abduct Merione in the night and take her to a secluded place, where Theanor commits the act. The courtiers are masked, and stage the rape so that it resembles the abduction of Proserpine by Pluto. Merione is drugged, and carried to the house of her brother Leonidas, where she is left unconscious. She is discovered on the front stoop by Leonidas and Agenor, and awakened; her condition becomes understood by them and by the Queen and her court, to general outrage. Her wedding with Agenor is postponed, and Leonidas and Agenor swear vengeance on the rapist.\nMerione is nursed by Beliza, with the aid of Leonidas and Agenor. Theanor and his supporters confront and insult Euphanes and his friends; Euphanes is restrained in his reaction, but the Queen learns about the matter and reproves her son. She orders Theanor to take a casket of jewels to Euphanes as a present; Theanor instead sends the casket by an anonymous messenger, and adds to it a ring that he took from Merione on the night of the rape. Euphanes gives the ring to Beliza. When Merione sees it on Beliza's hand and instantly recognizes it, Agenor and Leonidas conclude that Euphanes is the rapist. They take an unorthodox approach to their quest for revenge, however: believing that they cannot gain access to Euphanes directly, they seize Theanor as a hostage and take refuge in the city's fortress. They demand Euphanes in exchange for Theanor.\nThe Queen is outraged, and refuses co-operation. She orders Euphanes and his friend Conon to lead troops against the rebels. Euphanes disobeys her order by confronting Leonidas and Agenor, alone and unarmed. He convinces the two that he did not rape Merione, even reminding Leonidas that the two of them were together on the night of the crime. In a dumbshow, Euphanes pleads for the rebels with the Queen, and she pardons them.\nTheanor, not satisfied with the outcome of his machinations, decides to rape Beliza as he did Merione. Crates has qualms, feeling that things are going too far. Before the crime can take place, Euphanes' friend Conon confronts Crates; the two duel, and both are wounded, before the fight is broken up by Euphanes and others. Crates experiences a change of heart as a result of the duel and his wound (which happens repeatedly in the works of Fletcher and his collaborators); he confesses Theanor's plan against Beliza. Euphanes, Leonidas, and Agenor concoct a scheme to apprehend Theanor as he tries to commit the crime; they do so, but not before the prince completes a second rape.\nIn the play's final scene, Theanor is brought to trial before the Queen and her court. The law states that a rapist can be put to death – or pardoned, if the victim takes the rapist as her husband. Theanor is confronted by both Merione, dressed in white, and Beliza, dressed in black; Merione, willing to marry Theanor, pleads for his pardon, while Beliza demands his death. After hearing their pleas, the Queen condemns her son to death, asserting that the law is not intended for a repeat offender. It is then revealed that Beliza's place had been taken by Merione on the night in question – so that instead of raping two women, Theanorhas raped the same woman twice. This allows the Queen to pardon the repentant Theanor, and marry him to Merione. Euphanes and Beliza are also headed toward the altar; and the Queen compensates Agenor for his lost bride by marrying the Argosian prince herself.\nThe play's comic relief is supplied by the clown character variously called Onos or Lamprias. He and his Tutor and Uncle have just returned from foreign travels, like Euphanes – but they represent the inverse situation, showing that foreign travel by itself cannot redeem fools from their folly. The clown, seconded by tutor and uncle, attempts to fulfill the role of a gentleman and a gallant; but he fails badly, and ends the play abused and ridiculed by pages and grooms.\nCommentary\nModern critics have concentrated attention of the gender issues of the play: \"The Queen of Corinth is best known today for its appalling sexual politics and its treatment of rape.\"\nNotes\nExternal links\n* [https://www.gutenberg.org/ebooks/45781 Beaumont and Fletcher's Works (6/10), including The Queen of Corinth] at Project Gutenberg\nReferences\n* Clark, Ira. The Moral Art of Philip Massinger. Lewisburg, PA, Bucknell University Press, 1993.\n* Foster, Verna A. The Name and Nature of Tragicomedy. London, Ashgate, 2004.\n* Hoy, Cyrus. \"The Shares of Fletcher and His Collaborators in the Beaumont and Fletcher Canon\" (IV). Studies in Bibliography 12 (1959), pp.&nbsp;91–116.\n* Logan, Terence P., and Denzell S. Smith, eds. The Later Jacobean and Caroline Dramatists: A Survey and Bibliography of Recent Studies in English Renaissance Drama. Lincoln, NE, University of Nebraska Press, 1978.\n* Loughlin, Marie H. Hymeneutics: Interpreting Virginity on the Early Modern Stage. Lewisburg, PA, Bucknell University Press, 1997.\n* Oliphant, E. H. C. The Plays of Beaumont and Fletcher: An Attempt to Determine Their Respective Shares and the Shares of Others. New Haven, Yale University Press, 1927.\n* Perry, Curtis. Literature and Favoritism in Early Modern England. Cambridge, Cambridge University Press, 2006."
    }
  ]
}