{
  "content": [
    {
      "type": "text",
      "text": "# The Great Battles of Hannibal\n\nThe Great Battles of Hannibal is a 1997 computer wargame developed by Erudite Software and published by Interactive Magic. Based on the board wargame SPQR, it is the sequel to The Great Battles of Alexander and the second game in the Great Battles computer wargame series.\nGameplay\nDevelopment\nSPQR, part of a series that had achieved commercial success at a time of decline for physical game sales.]]\nThe Great Battles of Hannibal was announced by developer Erudite Software and publisher Interactive Magic in early 1997, alongside its sequel Caesar. Erudite had signed with Interactive Magic in mid-1996 to publish Hannibals predecessor, The Great Battles of Alexander, after that game's long and troubled development history. The publisher declared its intent to publish all three games as the Great Battles series in January 1997, and assigned S. Craig Taylor to be their producer. GMT Games assisted in the creation of the series, and each entry was based on one of its board titles. While Alexander derived from GMT's board wargame of the same name, Erudite built Hannibal on SPQR, part of the same series. The physical Great Battles titles were known as commercial successes in a period of falling sales for the medium.\nHannibal was designed to simulate Roman infantry tactics in addition to the Ancient Macedonian battle tactics that had appeared in Alexander. However, the team reused the core mechanical systems of Alexanders computer version with minor additions. Designer Mark Herman wrote before the game's release, \"It has been heartening to discover that the game system is flexible enough to be easily modified to reflect the historical evolution of ancient warfare. By adding two rules: Pre-shock missile fire and the ability to give line commands we have been able to capture the critical aspects of the Roman tactical system\". Hannibal also shares Alexanders game engine, which the team upgraded for the sequel. Erudite increased the level of graphical detail and, in response to requests from players of Alexander, added an undo command for certain moves. The team sought to improve Hannibals artificial intelligence compared to that of its predecessor as well.\nHannibal was shown at the 1997 Electronic Entertainment Expo (E3) in June. By that time, it had a projected release date of October 1997. In September, Interactive Magic announced that its release had been pushed back another month; it ultimately launched on November 7.\nReception\n| CGW =\n| rev1 = Computer Games Strategy Plus\n| rev1Score =\n| rev2 = CNET Gamecenter\n| rev2Score = 8/10\n| PCPP = 62%\n| award1 = Silver Award\n| award1Pub = Games Domain\n}}\nScott Udell of Computer Games Strategy Plus called Hannibal an improvement upon its predecessor, in that it retained Alexanders best features while fixing its worst. He praised it as \"a wonderfully refreshing play aesthetic that few recent wargames have approached, let alone matched.\" In PC Gamer US, William R. Trotter likewise praised the game and compared it positively to Alexander. Describing Hannibals place in the Great Battles series, he summarized, \"It is perhaps unwise to suggest that any wargame is 'the last word' on a given subject [...] but it's hard to imagine how these three games could be outclassed in the foreseeable future.\"\nIn a less positive review, Computer Gaming Worlds Ron Talbot wrote that \"Hannibal marks a step back from Alex.\" He found its campaign \"unimaginative\" and noted significant technical problems, which he considered \"unforgivable in the second iteration of a series.\"\nThe Great Battles of Hannibal won the 1997 Charles Roberts Award for \"Best Pre-Twentieth Century Computer Wargame\".\nReferences"
    }
  ]
}