{
  "content": [
    {
      "type": "text",
      "text": "# The Restless Dead (Warhammer Fantasy Roleplay)\n\nThe Restless Dead is a series of adventures published by Games Workshop in 1989 for the fantasy role-playing game Warhammer Fantasy Roleplay.\n, 1989]]\nContents\nThe Restless Dead contains a set of seven connected scenarios titled The Rest Without Peace Campaign, the first six of which appeared previously in various issues of White Dwarf:\n*\"Night of Blood\" (White Dwarf Issue 87 - March 1987)\n*\"On the Road\" (White Dwarf Issue 85 - January 1987)\n*\"Eureka\" (White Dwarf Issue 93 - September 1987)\n*\"A Rough Night at the Three Feathers\" (White Dwarf Issue 94 - Oct 1987)\n*\"The Affair of the Hidden Jewel\" (White Dwarf Issue 101 - May 1988)\n*\"The Ritual\" (White Dwarf Issue 99 - Mar 1988)\n*\"The Haunting Horror\" - new adventure\nA second section of the book contains a single scenario, \"Grapes of Wrath\" (originally published in White Dwarf Issue 98 - Feb 1988), that provides a link between two previously published supplements in The Power Behind the Throne campaign, Death on the Reik and Power Behind the Throne.\nThe third section of the book contains new rules for experience, combat and magic.\nPublication history\nGames Workshop originally published Warhammer Fantasy Roleplay in 1986, and many supplements and adventures followed. The Restless Dead was published by Games Workshop in 1989 as a 104-page hardcover book written by Carl Sargent, with Jim Bambra, Graeme Davis, Phil Gallagher, Paul Hargreaves, Derrick Norton, Lewis Page, and Philip Wells, with interior art by Tony Ackland, Dave Andrews, Paul Bonner, Mark Cordory, Jes Goodwin, Tony Hough, Martin McKenna, Russ Nicholson, Jamie Sims, and Kev Walker, and cover art by John Blanche.\nReception\nAnthony Ragan reviewed the product in the December 1990 – January 1991 issue of White Wolf. He thought positively of most of the scenarios, but stated that \"While it may have value for GM's who don't have access to White Dwarf, the high price and many faults of this product warrant a low rating.\" He rated it overall at 2 of 5 possible points.\nReviews\n*Warpstone Issue 11 (Autumn 1999, p.2)\n*Sinclair User\nReferences"
    }
  ]
}