{
  "content": [
    {
      "type": "text",
      "text": "# The Life and Death of King Richard II (1960 film)\n\n(Sydney, live)\n| released2      =  (Melbourne, taped)\n}}\nThe Life and Death of King Richard II was a 1960 Australian live TV production of the play by William Shakespeare directed by Raymond Menmuir. It aired on 5 October 1960 and was one of the most elaborate productions made for Australian TV at that time.\nThe ABC decided to suspend peak-hour programs to transmit the show live using all three of the ABC's Gore Hill TV studios. An obituary of Menmuir called this \"a concept of such complexity and audacity that it was never repeated.\"\nPremise\nThe story of King Richard II of England.\nCast\n*Ric Hutton as Richard II\n*Richard Parry as John of Gaunt\n*Hugh Stewart as Duke of York\n*James Condon as Bolingbroke\n*George Roubicek as Aumerie\n*Rosemary Webster as Queen\n*Nancye Stewart as Duchess Of Gloucester\n*John Fassen as Duke of Norfolk\n*Walter Sullivan as Earl of Northumberland\n*Laurier Lange as Sailsbury\n*Max Osbiston as Willoughby\n*Peter Wagner as Bushy\n*Max Meldrum as Green\n*Geoffrey King as Bishop of Carlisle\n*Malcolm Billings as Lord Ross\n*Vaughan Tracy as Lord Marshal\n*Norman Mann\n*Owen Weingott\n*Robin Ramsay\n*Leonard Teale\nProduction\nIt was produced in part to help students who were studying the play for their leaving certificate. (The play was often performed at the time, due to the fact it could get a guaranteed audience of students.)\nTwo studios were used for the telecast. Prue Bavin, the script assistant, later recalled \"Both Studio 21 and Studio 22 were used for that production. We used to work in the Woolworths studio for our rehearsals.\"\nRic Hutton was injured while rehearsing a duel with Owen Weingott. This became infected and Hutton had to go to hospital on September 29. However he recovered to do the show.\nReception\nThe TV critic for the Sydney Morning Herald wrote that the production was \"a glittering technical success\" which \"did not neglect the essential issues and thematic unity of\" the play, with Alan Seymour responsible for \"skilful\" cutting. Ric Hutton's acting was praised, \"there was great visual and dramatic distinction in John of Gaunt's death scene\" and \"Desmonde Downing made a major contribution to the visual competence of the production with the skeletal Gothic arches, wintry trees, and thick-textured draperies of her sets and with costumes of emblazoned richness.\"\nLegacy\nRic Hutton later appeared before Senator Vincent in Canberra at a Select Committee. Vincent asked Hutton to compare Australian television productions with those from overseas. \"Did you see the A.B.C. production Richard II?\" he asked. Hutton replied, \"I was Richard II.\" Then he added, \"Perhaps he should have waited to hear what you were going to say.\" Senator Vincent said he personally liked the play \"very much\", and thought it was one of the best staged by the A.B.C.\nSee also\n*List of television plays broadcast on Australian Broadcasting Corporation (1960s)\nReferences\nExternal links\n*"
    }
  ]
}