{
  "content": [
    {
      "type": "text",
      "text": "# The Flivver King\n\nThe Flivver King: A Story of Ford-America is a 1937 novel written by American muckraker and author Upton Sinclair. The plot revolves around the lives of generations of the Shutt family and their relationship with Henry Ford and the Ford Motor Company.\nPlot summary\nOn Bagley Street in the city of Detroit, Little Abner Shutt begins the story by explaining to his mother that \"there's a feller down the street says he's goin' to make a wagon that'll run without a horse.\" The man is Henry Ford. The story follows the progress and growth of Ford Motor Company through the perspective of a number of generations of a single family.\nThe Flivver King demonstrates the effects of scientific management in factories. The Ford factory began with very skilled workers.  Through a process of breaking the skilled job down into simple steps, they were able to hire lower wage, less skilled individuals to do the work. The Flivver King explains how the Ford Company used scientific management to replace skilled workers while successfully increasing production.\nEffects\nThe first edition, published by the UAW states on the cover, that it was printed \"in an edition of 200,000 copies for its members\". There is no mistake that the book was meant to provoke and challenge its readers; on the cover (seen here), as a preface to the first edition it is stated:\nWhat is Henry Ford? What have the years done to him? What has his billion dollars made of him?Here is the man, and the story of his life. Here also are his workers, a family of them over a period of three generations. What has the billion dollars done to them?A dramatic labor struggle is under way. Will Ford recognize the union? Will there be a \"sit-down\" in his plants? Here, in story form, are the facts needed to understand events.\nCharacters in The Flivver King\n*Henry Ford - Self-made man and billionaire industrialist who starts out with pure motives, but becomes the \"prisoner of a billion dollars\" as well as a cynical anti-Semite and cultural conservative.\n*Abner Shutt - The tome's idealistic protagonist patriarch. A working class fellow who grew up down the street from young inventor Henry Ford, he throws his lot in life in with the Ford Motor Company and remains fiercely loyal to Ford in spite of the injustices he experiences.\n*John Shutt - Eldest son of Abner, he chooses a working class path with Ford middle management but believes his life is better than his father's.\n*Hank Shutt - Abner's middle son and namesake of the family benefactor who dabbles in organized crime during Prohibition before becoming involved in Ford's \"Service Department\" (the company's private police force who violently put down labor disputes at the company) and realizing the two worlds are not that different.\n*Tom Shutt - Youngest son and athlete who becomes radicalized in college and begins organizing for the UAW.\n*Daisy Shutt - Daughter who opts for a clerical career and marriage to a bookkeeper.\nReferences\nExternal links\n*[https://web.elastic.org/~fche/mirrors/www.thememoryhole.org/fordnazi.htm (Mirrored site) Memory Hole: Henry Ford and the Nazis] References a passage of The Flivver King."
    }
  ]
}