{
  "content": [
    {
      "type": "text",
      "text": "# The Heritage (Oklahoma City, Oklahoma)\n\n| locmapin = Oklahoma#USA\n| area =\n| built = 1923\n| architect = Layton, Hicks & Forsyth\n| architecture = Classical Revival\n| added = March 26, 1980\n| refnum = 80003286\n| governing_body =\n}}\nThe Heritage, formerly known as the Journal Record Building, Law Journal Record Building, Masonic Temple and the India Temple Shrine Building, is a Neoclassical building in Oklahoma City, Oklahoma.  It was completed in 1923 and listed on the National Register of Historic Places in 1980. It was damaged in the 1995 Oklahoma City bombing. It houses the Oklahoma City National Memorial Museum in the western 1/3 of the building and The Heritage, a class A alternative office space, in the remaining portion of the building.\nHistory\nThe India Temple Shrine Building was constructed in 1923 by the various Masonic Lodges of Oklahoma, City. The first Masonic Lodge was charted in Oklahoma City in 1890, less than one year after Oklahoma's land rush of 1889. By 1919, the number of lodges in the capital city had increased to 16. With an expanding membership and bulging treasury, the 16 Masonic Lodges of Oklahoma City voted to pool their resources for a grand temple large enough to host every lodge. They hired the prominent local architectural firm of Layton, Hicks and Forsyth to design their building. Construction of the India Temple Shrine Building was started in October 1922 and completed the following year at a cost of $1.3 million.\nFinancial conditions during the Great Depression forced the Masons to vacate the India Temple Shrine Building less than 10 years after it opened. It sat empty until December 1945, when it was sold at auction to Joe D. Morris, president and founder of the Home State Life Insurance Company. Morris paid $201,000 for the building, which he converted into office space.\nThe building was sold for a second time in December 1977 to Dan Hogan, owner of the Law Journal Record Publishing Company and underwent additional interior renovations in 1978.\nThe building received significant damage in the Oklahoma City bombing of April 19, 1995, which destroyed the nearby Alfred P. Murrah Federal Building. Twenty blocks of downtown OKC had to be cordoned off due to the bomb's extent. The building was fully occupied at the time of the bombing and received extensive damage. The roof was blown off, several floors collapsed and glass permeated the entire structure. Fortunately, there were no fatalities, although there were several critical injuries. After the bombing, the building was purchased by the City of Oklahoma City using federal disaster funds and a major effort was undertaken to save the structure. It sat vacant for five years with the interior exposed to the elements as a result of roof damage and broken windows. The publishing plant at the west end of the building (a non-historic addition) was removed.\nIn 2000, the western 1/3 of the building was restored and became the home of the Oklahoma City National Memorial Museum, an affiliate of the National Park Service and the National Memorial Institute for the Prevention of Terrorism.\nThe rest and majority of the building remained largely vacant for over 20 years until Heritage Trust Company purchased it in 2015 for $4.255 million. Now known as The Heritage, the building underwent a $30 million redevelopment and is now a Class A alternative office space.\nArchitecture and decor\nThe building is a six-story Neoclassical structure measuring  by . Similar to other Masonic templates, the exterior was to have a classical design, with Ionic columns and capitals adorning the front. Combined with massive cut-stone construction, the design gave the temple a solid and ageless appearance. The building was constructed of limestone on the North and East sides and red brick on the South and West sides. The top three levels on the east side feature recessed windows, Ionic engage columns, capitals and a projecting cornice. The North face of the building also was divided into two distinct horizontal zones but without the Ionic columns.\nThe interior was just as ornate. Rooms and halls were decorated in various styles, from Egyptian and Greek to Roman and Byzantine. Entering the new Masonic Temple from Robinson, visitors found a spacious lobby with access to the secretarial offices of the Masonic Orders housed there. A wide corridor led directly to the Shrine Auditorium, the original centerpiece of the building. The Shrine Auditorium had 2,062 seats, a  by  stage, 2,400 lights, and a pipe organ with 3,000 pipes that cost $30,000. It was described as the second largest auditorium in the American West.\nBy 1947, most of the ornamentation was gone as a result of the remodeling directed by Morris, but the auditorium was retained for use as a theater and cinema. The theatre was successful at first, but its finances declined, and in 1952 the auditorium was gutted and the space was converted to office use.\n[[File:The Heritage OKC.jpg|thumb|[http://www.theheritageokc.com The Heritage, 2017.]  |alt=|left]]In 2000, renovations of the building converted the western 1/3 of the building into the Oklahoma City National Memorial Museum. The museum, opened to the public on February 19, 2001, occupies three stories with its entrance located on the west elevation of the building (using the address of 620 N. Harvey Avenue). A section of the second floor was left unrepaired so that visitors could see for themselves the damage caused by the bomb blast.\nIn 2015, renovations of the remaining portion of the building took place. Many of the temple's original marble and features were kept, including the floor in the lobby and the stone steps leading into the building's east side. Marble stored in the basement by the city following the bombing was found and is now the backdrop to framed art in the lobby. Beyond the ground floor renovations and restoration, the biggest change to the building's appearance was to the top of the building. A glass box was added to create a new sixth floor which includes a 750-square-foot rooftop terrace with accordion-style glass doors. An internal staircase leading from the fifth to the sixth floor and skylights made the fifth floor, originally an attic, more usable.\nReferences\nExternal links\n* [https://web.archive.org/web/20100620231636/http://www.ocgi.okstate.edu/shpo/shpopic.asp?id=80003286 National Register Properties in Oklahoma: India Temple Shrine Building]\n* \"[http://digital.library.okstate.edu/encyclopedia/entries/J/JO024.html Journal Record] \" in Encyclopedia of Oklahoma History and Culture"
    }
  ]
}