{
  "content": [
    {
      "type": "text",
      "text": "# The Howards of Virginia__disambig_1\n\n| screenplay     = Sidney Buchman\n| starring       = Cary GrantMartha ScottCedric Hardwicke\n| music          = Richard Hageman\n| cinematography = Bert Glennon\n| editing        = Paul Weatherwax\n| distributor    = Columbia Pictures\n| released       =\n| runtime        = 116 minutes\n| country        = United States\n| language       = English\n| budget         =\n}}\n]]\nThe Howards of Virginia is a 1940 American drama war western film directed by Frank Lloyd, released by Columbia Pictures, and based on the book The Tree of Liberty written by Elizabeth Page. The Howards of Virginia live through the American Revolutionary War, with Cary Grant starring as Matt Howard, Martha Scott starring as his wife Jane Peyton Howard, and Alan Marshal and Sir Cedric Hardwicke starring as Jane's brothers Roger and Fleetwood Peyton. Fleetwood Peyton is Jane's elder brother, the patriarch of his family, and a member of the Tidewater aristocracy. The film includes a look at the young Matt Howard, Thomas Jefferson, and Jane Peyton.\nMuch of the film was shot at Colonial Williamsburg, much of which had only been recently restored or reconstructed at the time of the production. The Capitol, Raleigh Tavern, and Governor's Palace are prominently featured.\nPlot\nIn 1755, the father of 12-year-old Matt Howard (Dickie Jones) joins the Braddock Expedition against the French in the Ohio Country after being promised  of land. Matt learns that his father died during the military expedition, and is consoled by his schoolmate and friend Thomas Jefferson (Buster Phelps).\nMatt (Cary Grant), now an adult and accomplished backwoodsman, sells the family farm in order to settle in Ohio. When saying farewell to Jefferson (played as an adult by Richard Carlson), Matt is tricked into meeting several members of high society, including the snobbish, wealthy royalist Fleetwood Peyton (Sir Cedric Hardwicke) and his beautiful sister, Jane (Martha Scott). The Peytons snub him when they discover he's a common farmer and not a landed gentlemen (as Jefferson had implied). Matt falls in love with Jane. Fleetwood, certain Jane will turn Matt down, permits Howard to propose to her in order to humiliate the farmer. Matt buys a  farm in the Shenandoah Valley and erects a home there. When Matt returns, Jane (thrilled by Matt's republicanism and colonial spirit) shocks her family by accepting his proposal of marriage. Fleetwood repairs his relationship with Jane by giving her the diamond-encrusted Peyton family necklace.\nMatt and Jane take up residence at Matt's new farm. Jane is shocked at the crude manners of the settlers, but Matt's vision of the future overcomes her worries. Jane and Matt work together, and the Howard's Albemarle Plantation takes shape. Their first child, Peyton, is born with a clubfoot (like his namesake uncle). Matt is ashamed of Peyton's disability. Jane has a daughter, Mary, and a second son, James. Despite her frontier spirit, Jane remains something of a snob. Jefferson visits Albemarle and shows Matt how unhappy Jane is living on the frontier. In order to justify returning to Williamsburg for several months without sacrificing his pride, Matt agrees to run for the Virginia House of Burgesses in 1765. He easily wins the election. Matt feuds with Fleetwood in the legislature, and is exposed to anti-British feeling and thought for the first time.\nRevolutionary fervor strikes the American colonies, and Matt spends more and more time away from Albemarle to join Jefferson in Williamsburg in resisting the British crown. Fearing Indian attack, Jane moves from Albemarle to Williamsburg to be near Matt. When Matt decides to go to Philadelphia to fight for independence, Jane demands that he stay in Virginia and confronts Matt regarding his rejection of Peyton. Matt leaves, causing a rupture in his marriage. Jane and her children move in with Fleetwood. The American Revolutionary War breaks out, and Matt becomes a captain in the Continental Army. Unable to pay his taxes with credit, Fleetwood is forced to sell much of his land. He turns to drink, and throws Peyton and James out of his house when they support their father and Jefferson. Peyton and James find their father near-starvation in winter camp, and join the army.\nFleetwood embraces the royalist cause. His health declines and he becomes mentally ill. Matt discovers that James' allegiance to the revolutionary cause is weak, and realizes how much he has neglected Peyton. James wins leave and goes home to Williamsburg. Peyton remains with his father and the army. While acting as a courier for the army, Peyton is wounded. Matt and the Continental Army march to Williamsburg in order to surround Cornwallis at Yorktown. Matt learns Peyton was taken to Fleetwood's home to recuperate. He rushes to his son's side, reunites with his family, and reconciles with Jane after confessing how he mistreated Peyton.\nCast\n* Cary Grant as Matt Howard\n* Martha Scott as Jane Peyton Howard\n* Richard Carlson as Thomas Jefferson\n* Sir Cedric Hardwicke as Fleetwood Peyton\n* Alan Marshal as Roger Peyton\n* Phil Taylor as Peyton Howard at 18\n* Rita Quigley as Mary Howard at age 17\n* Tom Drake (as Richard Alden) as James Howard at 16\n* Irving Bacon as Tom Norton\n* Libby Taylor as Dicey\n* Richard Gaines as Patrick Henry\n* Paul Kelly as Captain Jabez Allen\n* George Houston as George Washington\n* Elisabeth Risdon as Aunt Clarissa\n* Dickie Jones as Matt Howard at 12\n* Buster Phelps as Thomas Jefferson at 11\n* Ralph Byrd as James Howard\n* Mary Field as Susan Howard\n* Victor Wetter uncredited\nAward nominations\nRichard Hageman was nominated for the Academy Award for Best Original Score, while Jack Whitney was in contention for Best Sound Recording.\nNotes\n* The Hollywood Reporter: February 15, 1939\n* Los Angeles Times: April 13, 1940\n* Variety: September 4, 1940\n* The New York Times: September 27, 1940\nSee also\n* List of films about the American Revolution\n* List of television series and miniseries about the American Revolution\nReferences\nExternal links\n*\n*\n*\n*"
    }
  ]
}