{
  "content": [
    {
      "type": "text",
      "text": "# The Flower Queen's Daughter\n\n}}\n'''The Flower Queen's Daughter' (German: Die Tochter der Blumenkönigin) is a Bukovinian fairy tale collected by Dr Heinrich von Wlislocki in Märchen Und Sagen Der Bukowinaer Und Siebenbûrger Armenier. Andrew Lang included it in The Yellow Fairy Book.\nSynopsis\nA prince helped an old woman who was caught in a ditch.  She told him that the most beautiful woman in the world was the daughter of the Flower Queen, who had been kidnapped by dragons.  He could save her and marry her.  To help, she gave him a bell:  to ring it once would bring the King of the Eagles; twice, the King of the Foxes; and thrice, King of the Fishes.\nHe told his father he meant to rescue the daughter and set out.  After a year, he met a very old man, who did not know where the dragon was, but if he traveled a year, the prince might meet his father who might know.  At the end, the father could not tell him, but directed him on to his father.  That man told him that the dragon had just gone to sleep—it slept one year and woke the next—but the princess was held by his mother in the next mountain, and the Mother Dragon held a ball every night, at which the daughter would be.\nHe entered the Mother Dragon's service, saying that he had heard of her beauty and goodness.  She was an ugly woman with three heads.  She told him that he had to take her mare out to pasture for three days and always return with it.  The first day, it vanished, and he rang the bell.  The king of the eagles found the mare racing among the clouds and brought it back.  He brought it back to the Mother Dragon, who, as a reward, gave him a cloak of copper and let him come to the ball, where he-dragons and she-dragons were dancing.  He met the Flower Queen's daughter, who told him to ask for the mare's foal as reward.\nThe second day, the mare vanished again, he rang the bell twice, and the king of foxes brought the mare back from the hill; the Mother Dragon gave him a silver cloak and let him go to the ball again.\nThe third day, the mare vanished again, he rang the bell thrice, and the king of the fishes brought the mare back from the river.  The Mother Dragon gave him a golden cloak, said she would make him her body servant, and when he asked for the foal, gave it; she was pleased with him because he had flattered her beauty.  The Flower Queen's daughter told him they would meet in the meadow if he succeeded.\nThe Mother Dragon let him go to the ball, but he went to the stables instead.  At midnight, he and the Flower Queen's daughter fled on the foal.  The dragons woke their brother, but they got to the Flower Queen, who protected them.\nThe queen agreed to a wedding, as long as her daughter came and lived with her in the winter.  The prince agreed, and despite it, was happy with his bride their entire lives.\nAnalysis\nThe conclusion is, obviously, a reversal of the Persephone myth:  the daughter lives with her mother in the winter, and her husband during the growing seasons.\nEditors of Jahresbericht über die Erscheinungen auf dem Gebiete der germanischen Philologie, in a review of Wlislocki's book, noted that the tale was \"an interesting variant\" of the tale Die Rosenmädchen (\"The Rose Maiden\"), collected by  from the Transylvanian Saxons.\nSee also\n*Kate Crackernuts\n*The Twelve Dancing Princesses\n*The Nine Peahens and the Golden Apples\n*The Death of Koschei the Deathless\n*The Young King Of Easaidh Ruadh\n*The Grateful Prince\nReferences"
    }
  ]
}