{
  "content": [
    {
      "type": "text",
      "text": "# Thinking XXX\n\n}}\nThinking XXX is a 2004 documentary television film about the process photographer Timothy Greenfield-Sanders went through to create his book XXX: 30 Porn Star Portraits.\nContent\nThe film shows Greenfield-Sanders as he shoots portraits of thirty porn stars both clothed and naked for the book as well as presenting conversations and interviews with the performers along with authors, artists and filmmakers outside of the pornography industry. For the portraits Greenfield-Sanders uses an antique view camera as both a challenge to his photographic skills and to have negatives large enough to create oversized exhibition prints for gallery exhibitions.\nThe film was produced for broadcast on the HBO cable TV channel and was never released to theaters, and was therefore not rated by the Motion Picture Association of America.\nReception\nA review in Houston Voice said that the film \"did something that many in the past have tried and failed to do: humanize porn stars\".\nList of portrait subjects\n* Sunrise Adams\n* Briana Banks\n* Belladonna\n* Seymore Butts\n* Christy Canyon\n* Chloe\n* Nina Hartley\n* Heather Hunter\n* Jenna Jameson\n* Jesse Jane\n* Ron Jeremy\n*Jeremy Jordan\n* Reina Leone\n* Michael Lucas\n* Gina Lynn\n* Ginger Lynn\n* Sean Michaels\n* Sharon Mitchell\n* Peter North\n* Tera Patrick\n* Mari Possa\n* Lukas Ridgeston\n* Savanna Samson\n* Aiden Shaw\n* Lexington Steele\n* May Ling Su\nSoundtrack\nTrack listing:\n#AA XXX - Peaches\n#Hot In Here - Tiga\n#Muscle Car (Reform Reprise) - Mylo\n#Coochie Coo - Felix da Housecat with Princess Superstar\n#Train - Goldfrapp\n#I Want To Be Your Dog - Futon\n#Lovesucker - Xlover\n#Sugar - Ladytron\n#Leave Them All Behind - Whitey\n#Rock And Roll (Part 3) - Virgin Tears\n#Freak Like Me - Heather Hunter with DJ Premier\n#Time Bomb - Rabbit in the Moon\n#HLM - Moderato\n#Here She Comes - Velvet Underground\nReferences\nExternal links\n* [http://www.thinkingxxx.com/ Official website]\n*"
    }
  ]
}