{
  "content": [
    {
      "type": "text",
      "text": "# Third Battle of the Aisne\n\n| result            = See Aftermath section\n| territory         = Germans achieve 55 km breakthrough of Allied lines that comes within 56 km of Paris\n| combatant1        =  Italy\n| combatant2        =  German Empire\n| commander1        =  Denis Auguste Duchêne Alexander Hamilton-Gordon\n| commander2        =  Erich Ludendorff Crown Prince Wilhelm\n| units1            =  Sixth Army Ninth Corps Third Corps  Second Infantry DivisionThird Infantry Division|group=Note}}\n| strength1         =\n| units2            =  First Army Seventh Army\n| strength2         = (over 20 divisions and 4,000 artillery guns)\n| casualties1       = 127,000\n| casualties2       = 130,000\n}}\nThe Third Battle of the Aisne () was part of the German spring offensive during World War I that focused on capturing the Chemin des Dames Ridge before the American Expeditionary Forces arrived completely in France. It was one of a series of offensives, known as the Kaiserschlacht, launched by the Germans in the spring and summer of 1918.\nBackground\nThe massive surprise attack (named Blücher-Yorck after two Prussian generals of the Napoleonic Wars) lasted from 27 May until 4 June 1918 and was the first full-scale German offensive following the Lys Offensive in Flanders in April.\nThe Germans held the Chemin des Dames Ridge from the First Battle of the Aisne in September 1914 to 1917, when General Mangin captured it during the Second Battle of the Aisne (in the Nivelle Offensive).\nOperation Blücher-Yorck was planned primarily by General Erich Ludendorff, the First Quartermaster-General of the German Army, who was certain that success at the Aisne would lead the German armies to within striking distance of Paris. Ludendorff, who saw the British Expeditionary Force as the main threat, believed that this, in turn, would cause the Allies to move forces from Flanders to help defend the French capital, allowing the Germans to continue their planned Flanders offensive (Hagen) with greater ease. Thus, the Aisne drive was essentially a large diversionary attack.\nThe defense of the Aisne area was in the hands of General Denis Auguste Duchêne, commander of the French Sixth Army. In addition, four divisions of the British IX Corps, led by Lieutenant-General Sir Alexander Hamilton-Gordon, held the Chemin des Dames Ridge; they had been posted there to rest and refit after surviving the \"Michael\" battle.\nBattle\nOn the morning of 27 May 1918, the Germans began a bombardment (Feuerwalze) of the Allied front lines with over 4,000 artillery pieces. The British suffered heavy losses, because Duchene was reluctant to abandon the Chemin des Dames ridge, after it had been captured at such cost the previous year, and had ordered them to mass together in the front trenches, in defiance of instructions from the French Commander-in-Chief Henri-Philippe Petain. Huddled together, they made easy artillery targets.\nThe bombardment was followed by a poison gas drop. Once the gas had lifted, the main infantry assault by 17 German Sturmtruppen divisions commenced, part of an Army Group nominally commanded by Wilhelm, German Crown Prince, the eldest son of Kaiser Wilhelm II. The Kaiser came to inspect the progress of the battle.  He interviewed captured British Brigadier-General Hubert Rees (GOC 150th Brigade, part of 50th Division). The Kaiser was amused to learn that he was Welsh, the same ethnicity as British Prime Minister David Lloyd George.\nTaken completely by surprise and with their defences spread thin, the Allies could not stop the attack and the German Army advanced through a  gap in the Allied lines. Reaching the Aisne in under six hours, the Germans smashed through eight Allied divisions on a line between Reims and Soissons, pushing the Allies back to the river Vesle and gaining an extra 15&nbsp;km of territory by nightfall.\nThe rapid advance resulted in the capture of just over 50,000 Allied soldiers and over 800 guns by 30 May 1918, prompting Ludendorff to change the operational objective from merely drawing away the enemy forces from the right wing of the German Army to advancing the attack of the Seventh Army.  This had never been the intention of the operation, and having come within  of Paris on 3 June, the German armies were beset by numerous problems, including heavy casualties, a lack of reserves, fatigue and supply shortages.\nUltimately, following many Allied counter-attacks, the German advance came to a halt three days later.\nAftermath\nDespite penetrating Allied lines by approximately  and coming closer to Paris than any time since 1914, the Germans were successfully halted by the Allies at the Marne on 6 June 1918. By the battle's end, the Germans had suffered 130,000 casualties while the combined total of Allies casualties reached up to 127,000.\nFor his poor handling of the British and French troops, Duchene was sacked by French Commander-in-Chief Philippe Petain and replaced as commander of the Sixth Army by Jean Degoutte. The battle also marked one of the first instances where an appreciable numbers of American troops participated and had proven themselves in combat.\nLudendorff, encouraged by the gains of Blücher-Yorck, launched further offensives culminating in the Second Battle of the Marne.\nSee also\n*Chemins des Dames Ridge\nReferences\nNotes\nCitations\nBibliography\n*Evans, M. M. (2004). Battles of World War I. Select Editions. .\n*Hart, Peter (2008). 1918: A Very British Victory, Phoenix Books, London.\n*Marix Evans, Martin (2002) 1918: The Year of Victories, Arcturus Military History Series, London: Arcturus,\n*Ward, Alec (2008). ''A Young Man's War'', Medlar Press."
    }
  ]
}