{
  "content": [
    {
      "type": "text",
      "text": "# Third Republic of Madagascar\n\n| conventional_long_name = Republic of Madagascar\n| common_name            = Madagascar\n| era                    =\n| status                 =\n| status_text            =\n| empire                 =\n| government_type        = Unitary semi-presidential republic\n| event_start            =\n| date_start             = 12 January\n| year_start             = 1992\n| event_end              = Constitution adopted\n| date_end               = 11 December\n| year_end               = 2010\n| event1                 =\n| date_event1            =\n| event2                 =\n| date_event2            =\n| event3                 =\n| date_event3            =\n| event4                 =\n| date_event4            =\n| event_pre              =\n| date_pre               =\n| event_post             =\n| date_post              =\n| p1                     = Democratic Republic of Madagascar\n| flag_p1                = Flag of Madagascar.svg\n| s1                     = High Transitional Authority\n| flag_s1                = Flag of Madagascar.svg\n| image_flag             = Flag of Madagascar.svg\n| s2                     = MadagascarFourth Republic of Madagascar\n| flag_s2                = Flag of Madagascar.svg\n| flag_alt               =\n| flag                   =\n| flag_type              =\n| image_coat             = Seal of Madagascar (1993-1998).svg\n| coat_alt               =\n| symbol                 =\n| symbol_type            = Seal\n| image_map              = LocationMadagascar.svg\n| image_map_alt          =\n| image_map_caption      = Location of the Republic of Madagascar in Africa\n| image_map2             =\n| image_map2_alt         =\n| image_map2_caption     =\n| capital                = Antananarivo\n| national_motto         = }}\n|\n| \"Love, Fatherland, Progress\"\n}}\n| national_anthem        = \"Oh, land of our beloved ancestors!\"\n| common_languages       = }}\n| religion               =\n| currency               = Malagasy franc(until 2005)Malagasy ariary\n| leader1                = Didier Ratsiraka\n| year_leader1           = 1992–1993; 1997–2002\n| leader2                = Albert Zafy\n| year_leader2           = 1993–1996\n| leader3                = Norbert Ratsirahonana\n| year_leader3           = 1996–1997\n| leader4                = Marc Ravalomanana\n| year_leader4           = 2002–2009\n| leader5                = Andry Rajoelina\n| year_leader5           = 2009–2010\n| title_leader           = President\n| representative1        = Guy Razanamasy (first)\n| representative2        = Albert Vital (last)\n| year_representative1   = 1992–1993\n| year_representative2   = 2009–2010\n| title_representative   = Prime Minister\n| deputy1                =\n| deputy2                =\n| year_deputy1           =\n| year_deputy2           =\n| title_deputy           =\n| legislature            = Parliament\n| house1                 = Senate\n| type_house1            =\n| house2                 = National Assembly\n| type_house2            =\n| stat_year1             = 1992\n| stat_area1             = 587040\n| stat_pop1              = 12,596,263\n| stat_year2             = 2010\n| stat_area2             = 587040\n| stat_pop2              = 21,281,844\n| calling_code           = 261\n| today                  = Madagascar\n| footnotes              =\n}}\nThe Third Republic of Madagascar (officially Republic of Madagascar; , ) refers to the 18-year-long period in Malagasy history after the dissolution of the socialist regime in 1992.\nHistory\nA new draft constitution was approved by 75 percent of those voting in a national referendum on 19 August 1992. The first round of presidential elections followed on 25 November. Frontrunner Albert Zafy won 46 percent of the popular vote as the Forces Vives candidate, and Didier Ratsiraka, as leader of his own newly created progovernment front, the Militant Movement for Malagasy Socialism (Mouvement Militant pour le Socialisme Malgache – MMSM), won approximately 29 percent of the vote. The remaining votes were split among a variety of other candidates. Because neither candidate obtained a majority of the votes cast, a second round of elections between the two frontrunners was held on February 10, 1993. Zafy emerged victorious with nearly 67 percent of the popular vote.\nThe Third Republic officially was inaugurated on 27 March 1993, when Zafy was sworn in as president. The victory of the Forces Vives was further consolidated in elections held on 13 June 1993, for 138 seats in the newly created National Assembly. Voters turned out in low numbers (roughly 30 to 40 percent abstained) because they were being called upon to vote for the fourth time in less than a year. The Forces Vives and other allied parties won seventy-five seats. This coalition gave Zafy a clear majority and enabled him to choose Francisque Ravony of the Forces Vives as prime minister.\nBy the latter half of 1994, the heady optimism that accompanied this dramatic transition process had declined somewhat as the newly elected democratic government found itself confronted with numerous economic and political obstacles. Adding to these woes was the relatively minor but nonetheless embarrassing political problem of Ratsiraka's refusal to vacate the President's Palace. The Zafy regime has found itself under increasing economic pressure from the IMF and foreign donors to implement market reforms, such as cutting budget deficits and a bloated civil service, that do little to respond to the economic problems facing the majority of Madagascar's population. Zafy also confronted growing divisions within his ruling coalition, as well as opposition groups commonly referred to as \"federalists\" seeking greater power for the provinces (known as \"faritany\") under a more decentralized government. Although spurred by the desire of anti-Zafy forces to gain greater control over local affairs, historically Madagascar has witnessed a tension between domination by the central highlanders and pressures from residents of outlying areas to manage their own affairs. In short, the Zafy regime faced the dilemma of using relatively untested political structures and \"rules of the game\" to resolve numerous issues of governance.\nAlbert Zafy was consequently impeached in 1996, and an interim president, Norbert Ratsirahonana, was appointed for the three months prior to the next presidential election. Didier Ratsiraka was then voted back into power on a platform of decentralization and economic reforms for a second term which lasted from 1996 to 2001.\nThe contested 2001 presidential elections in which then-mayor of Antananarivo, Marc Ravalomanana, eventually emerged victorious, caused a seven-month standoff in 2002 between supporters of Ravalomanana and Ratsiraka. The negative economic impact of the political crisis was gradually overcome by Ravalomanana's progressive economic and political policies, which encouraged investments in education and ecotourism, facilitated foreign direct investment, and cultivated trading partnerships both regionally and internationally. National GDP grew at an average rate of 7&nbsp;percent per year under his administration. In the later half of his second term, Ravalomanana was criticised by domestic and international observers who accused him of increasing authoritarianism and corruption.\nOpposition leader and then-mayor of Antananarivo, Andry Rajoelina, led a movement in early 2009 in which Ravalomanana was pushed from power in an unconstitutional process widely condemned as a ''coup d'état''. In March 2009, Rajoelina was declared by the Supreme Court as the President of the High Transitional Authority, an interim governing body responsible for moving the country toward presidential elections. In 2010, a new constitution was adopted by referendum, establishing a Fourth Republic, which sustained the democratic, multi-party structure established in the previous constitution.\nSee also\n* Madagascar\n* History of Madagascar\nReferences\n*"
    }
  ]
}