{
  "content": [
    {
      "type": "text",
      "text": "# Third Ward School\n\n| built                = 1876\n| architect            = Arvin L. Weeks\n| architecture         = Victorian / Italianate\n| added                = September 3, 1981\n| designated_nrhp_type =\n| visitation_num       =\n| visitation_year =\n| refnum               = 81000062\n| mpsub                =\n}}\nThe Third Ward School (now known as Heritage School) is a former two-room primary and intermediate grade school in Sheboygan, Wisconsin.\nAdult and children visitors can learn about the rules and curriculum of the 1800s and 1900s. Also located in the schoolhouse is an educational museum that features a variety of exhibits, artifacts and school memorabilia. The second Longfellow Elementary School, built in 1994 and itself replacing an 1890 building one block south, is adjacent to the building and helps to accent the changes in education that have taken place over the years.\nHistory\nThe Third Ward School was built in 1876 as a primary and intermediate grade school and then became the city's first kindergarten after the move of those grades to the 1890 Longfellow building. In 1918, it was converted to a \"fresh air school\", a new concept, providing education and nourishing meals for children with tuberculosis, until 1932. It then served as the headquarters for the city's health department for around forty years.\nThe schoolhouse was designed by Arvin L. Weeks, a 19th-century Sheboygan architect. Altered at several points, restrooms were first installed in the north half of the foyer in 1904.  Interior walls were added in 1931. It was placed on the National Register of Historic Places in 1981. In 1983 a grant from the National Trust for Historic Preservation provided funds for a feasibility study to restore the building as a Sheboygan Area School District \"living school museum\".\nSee also\n* Sheboygan Area School District\nReferences\nExternal links\n* [http://www.sheboygan.k12.wi.us/heritageschool Heritage School]"
    }
  ]
}