{
  "content": [
    {
      "type": "text",
      "text": "# This Beautiful Republic\n\n| current_members     =\n| past_members        = Andy SmithAdam SmithBen OlinJeremy KunkleBrandon PaxtonCameron Toews\n}}\nThis Beautiful Republic was an American Christian rock band signed to ForeFront Records in November 2006. The band is best known for its song \"Right Now\". The group appeared on the Christian television show The Logan Show on December 9, 2006. The band ended in 2011 after releasing a three-song EP of covers that had been recorded before the lead singer left in 2009.\nHistory\nThis Beautiful Republic started out of Toledo, Ohio, in 2004. Ben Olin joined the other members of the group after they lost their lead singer. All of the members in the newly formed group besides the new drummer, Cameron Toews from California, went to high school together at Toledo Christian Schools. When asked about the origin of the band's name, Olin replied, \"We wanted something that's catchy, but that's something that's really inclusive. It represents the kingdom of heaven on earth. We get a glimpse when we interact with each other as Christians, and push each other. We hope it's like the kingdom, pre-heaven.\"\nThe group was signed to ForeFront Records in November 2006 and later released its Casting Off EP on January 7, 2007. Shortly after, on April 3, the group released its full-length debut album, Even Heroes Need a Parachute, from which the group released its first single, \"Casting Off\".\nOn July 8, 2007, \"Learning to Fall\" was officially released on iTunes as a part of the Learning to Fall - EP. In the following week, \"No Turning Back\" was released as a standalone single.  The group's second album, \"Perceptions\", was released August 19, 2008. The track \"My God\" features Aaron Gillespie of Underoath and The Almost.\nIn late 2009, the band announced on its myspace page that lead singer Ben Olin and This Beautiful Republic had decided to part ways. Ben now sings worship at CedarCreek Church in Northwest Ohio. This leaves only three band members remaining.\nIn 2010, the band announced it was no longer with Forefront Records and had become independent.\nIn 2011, a farewell address was posted on the band's website informing fans that the band had decided to stop making music together. As a last act, the band released \"The Covers\" EP, featuring cover versions of \"Wonderwall\" by Oasis, \"Crazy\" by Gnarls Barkley and the hymn \"How Great Thou Art\".\nTours\nTo promote their album, the band went on two separate tours. The first tour was as an opening act for Sanctus Real with Needtobreathe,[http://www.thisbeautifulrepublic.com/news_article.aspx?id=524393 This Beautiful Republic] and the second was with Dizmas and Ever Stays Red.[http://www.thisbeautifulrepublic.com/news_article.aspx?id=530711 This Beautiful Republic] They were also on tour once with Spoken, Falling Up, and Family Force 5.\nIn 2007, This Beautiful Republic performed at several notable festivals including Lifest, Alive Festival, Godstock, Ichthus Festival, Soul Fest, Frizon Festival in Sweden, and Flevo Festival in The Netherlands.\nIn 2009, the band joined the Creation Festival tour, along with Jars of Clay, Thousand Foot Krutch, Audio Unplugged, B. Reith, and FM Static.\nMusical style\nFormer lead singer Ben Olin describes the band's sound as \"Take Silverchair and put in some Jimmy Eat World and you get sweaty, honest rock that has great melody, driving guitars, and other cool guitar stuff.\"\nDiscography\nAlbums\n*2007: Casting Off EP (released January 7 on ForeFront) Two songs from this three-song EP appear on Even Heroes Need a Parachute.\n*2007: Even Heroes Need a Parachute (released April 3 on ForeFront)\n*2008: Perceptions (released August 19 on ForeFront)\n*2011: Covers EP (released independently on March 9)\nSingles\nThe band's first single, \"Jesus to the World\", got as high as No.&nbsp;25 on the Christian CHR chart. Their single, \"Going Under\", reached number No.&nbsp;5 on the Christian Rock chart. Their next single, \"Right Now\", was released in May 2007, and it peaked in the Top 11.\n*\"Jesus to the World\" (2006)\n*\"Going Under\" (2007)\n*\"Right Now\" (2007)\n*\"Black Box\" (2007)\n*\"Learning to Fall\" (2008)\n*\"No Turning Back\" (2008)\n*\"Beautifully Broken\" (2008)\nCompilation appearances\n*2006: WOW Next 2007 – \"Jesus to the World\" (from Even Heroes Need a Parachute) – ForeFront/EMI\n*2007: X Worship 2007 – \"Cloud Cover\" (from Even Heroes Need a Parachute) – ForeFront/EMI\nReferences\nExternal links\n*[http://www.purevolume.com/thisbeautifulrepublic/ This Beautiful Republic] at Purevolume\n*[https://www.youtube.com/watch?v=lHWF61ogDYU Video Interview with This Beautiful Republic]"
    }
  ]
}