{
  "content": [
    {
      "type": "text",
      "text": "# This War Is Ours__disambig_1\n\n| recorded   = 2007–2008\n| venue      =\n| studio     =\n| genre      = Hard rock\n| length     =\n| label      = Epitaph\n| producer   = John Feldmann\n| prev_title = Dying Is Your Latest Fashion\n| prev_year  = 2006\n| next_title = Escape the Fate\n| next_year  = 2010\n| misc       =\n}}\nThis War Is Ours is the second album by American rock band Escape the Fate. It is the first Escape the Fate album to feature former Blessthefall singer Craig Mabbitt on vocals. The album received mixed reviews from critics. It was produced by John Feldmann, and released on October 21, 2008, through Epitaph Records.\nThe album debuted at No. 35 on the Billboard 200, selling 13,000 copies in the first week of its release.\nPromotion\nStarting on September 2, 2008, fans of Escape the Fate went to a special page on Buzznet to help unlock \"the first track\" off of This War Is Ours. Once the page had 50,000 viewers at the same time, the new song was then released to play and download for free. In order for a user's \"page view\" to be considered a contribution to the counter, the page had to remain open and active. Other sites could be used through different tabs or new windows, as long as the Buzznet page stayed open. Because this was a difficult task, fans were asked to \"tell everyone [they] know to come to [the] page\" in an attempt to reach 50,000 views as fast as possible. About 30 hours after the project started, the new song titled \"The Flood\" was unlocked and was also available for free download to anyone (whether they participated or not).\nOn October 1, 2008, the band released \"This War Is Ours (The Guillotine II)\" the (sequel to \"The Guillotine\" from the band's previous studio album, Dying Is Your Latest Fashion) for download. It served as the album's fourth single, with a music video being shot in Santa Ana, California, in January 2010.\nReception\nThis War Is Ours received positive reviews from critics. Tom Forget of Allmusic gave the album three and a half stars.\nDeluxe special edition\nIn an interview with Max and Craig, they stated that they would re-release This War Is Ours with a bonus disc with many different features not seen before.\nThe CD includes two new songs, \"Bad Blood\" and \"Behind the Mask\", an acoustic version of \"Harder Than You Know\", and a remix called \"This War Is Mine\" by Shawn Crahan of Slipknot. It also comes with a DVD that features the music videos to \"The Flood\", \"Something\", \"10 Miles Wide\", and \"This War Is Ours (The Guillotine II)\". It also comes with a world tour documentary and a behind the music feature. The deluxe edition was released on April 27, 2010.\nThere is a typo in the insert booklet for \"This War Is Ours (The Guillotine II)\". The lyrics, albeit correct, for \"10 Miles Wide\" are listed.\nFor the \"10 Miles Wide\" video on the DVD, any time a curse word is said that word is censored. However, the official video for \"10 Miles Wide\" on Epitaph Records' YouTube channel is not censored. Behind the Music and the European Tour (featured on the DVD) also do not censor curse words.\nTrack listing\nAll songs written by Escape the Fate and John Feldmann except where noted.\nPersonnel\nThis War Is Ours album personnel as listed on Allmusic.\nEscape the Fate\n* Craig Mabbitt – vocals\n* Monte Money – guitar, gang vocals\n* Max Green – bass, gang vocals\n* Robert Ortiz – drums, gang vocals\nProduction\n* John Feldmann – production, engineer, mixing\n* Brett Allen – credits director\n* Matt Appleton – engineer\n* Casey Howard – art direction, illustrations\n* Kyle Moorman – engineer\n* David Neely – credits director\n* John Nicholson – drum technician\n* Joey Simmrin – management\n* Adam Topol – credits director\nAdditional musicians\n* Josh Todd – co-lead vocals on \"10 Miles Wide\", backing vocals on \"Harder Than You Know\", composer\n* Shawn \"Clown\" Crahan – remixer on \"This War Is Ours\"\n* Matt Appleton – keyboards, synthesizers, horn, ukulele, charango, vocals\n* John Feldmann – keyboards, percussion, programming, composer, vocals\n* Kyle Moorman – kalimba, vocals\n* Jess Neilson – flute\n* Julian Feldmann – vocals\n* Benji Madden – vocals\nChart positions\n{| class=\"wikitable sortable\"\n|-\n!Chart (2008)\n!Peakposition\n|-\n|\n|-\n| US Billboard 200\n| style=\"text-align:center;\"|35\n|-\n| US Top Rock Albums\n| style=\"text-align:center;\"|12\n|-\n| US Top Digital Albums\n| style=\"text-align:center;\"|35\n|-\n| US Top Independent Albums\n| style=\"text-align:center;\"|2\n|-\n| US Top Catalog Albums (2010)\n| style=\"text-align:center;\"|34\n|-\n| US Top Alternative Albums\n| style=\"text-align:center;\"|8\n|-\n|}\nRelease history\nCD\n{|class=\"wikitable sortable\"\n|-\n!Region\n!Date\n!Label\n|-\n|In stores\n|\n|Epitaph\n|}\nDeluxe special edition\n{|class=\"wikitable sortable\"\n|-\n!Region\n!Date\n!Label\n|-\n|Via pre-order USA\n|\n|Epitaph\n|-\n|Via pre-order\n|\n|Epitaph\n|-\n|In stores\n|\n|Epitaph\n|}\nReferences"
    }
  ]
}