{
  "content": [
    {
      "type": "text",
      "text": "# Thoas (king of Aetolia)\n\nIn Greek mythology, Thoas (; ), a king of Aetolia, was the son of Andraemon and Gorge, and one of the heroes who fought for the Greeks in the Trojan War. Thoas had a son Haemon, and an unnamed daughter.\nIn the Iliad Thoas is the leader of the forty-ship Aetoilian contingent at Troy. He is mentioned several times in the Iliad, where he is described as excelling both in fighting and in speaking. Other sources list Thoas as one of the suitors of Helen, and as one of the warriors hidden inside the Wooden Horse. He was one of the few Greeks to return home safely after the war.\nFamily\nThoas's father was Andraemon, whose birth and origin are unknown. Andraemon married  Gorge, the daughter of Oeneus, who was the king of Calydon, an ancient Aetolian city-state, and the father of the heroes Tydeus (one of the Seven against Thebes) and Meleager (the host of the Calydonian boar hunt, and one of the Argonauts), and grandfather of the Trojan War hero Diomedes. An aged Oeneus lost his kingdom to the sons of his brother Agrius. But his grandson Diomedes was able to reclaim the kingdom, and install Oeneus's son-in-law Andraemon as the king of Calydon.\nThoas had a son Haemon, and an unnamed daughter. Haemon was the father of Oxylus, who guided the Heracleidae in their invasion of the Peloponnese, and as reward for this, Oxylus was given the throne of Elis. Thoas' daughter  married Odysseus, by whom she had a son Leontophonus (Lion Slayer).\nThe Trojan War\nBy the time of the Trojan War, Thoas had apparently succeeded his father Andraemon to the Calydonian throne. The  Iliad describes him as ruling Calydon and the nearby city of Pleuron, where, it says, he was \"honoured ... even as a god\". According to the Hesiodic Catalogue of Women, Thoas was one of the suitors of Helen. So he had, as had all the suitors, sworn an oath which obligated him to go to war with Troy to return Helen to her husband Menelaus. According to the Iliad Catalogue of Ships, because Oeneus, his sons, and his grandson Meleager were all dead, Thoas led the forty-ship Aetoilian contingent fighting at Troy.\nIn the Iliad\nIn the Iliad, though only a minor leader, with neither individual character, nor particular achievements, Thoas is nevertheless well respected, with several occasional mentions. He is described as\n:far the best of the Aetolians, well-skilled in throwing the javelin, but a good man too in close fight, and in the place of assembly could but few of the Achaeans surpass him, when the young men were striving in debate.\nIn Book 4, Thoas kills a Thracian, but is unable to strip him of his armor, being driven back by several of the dead warrior's comrades. in Book 7, he is one of the nine Greek warriors, who, after being rebuked by Nestor, finally volunteer to fight Hector in single combat.  In Book 13, Poseidon, going among the Greeks urging them to fight on, goes first to Teucer, then to Leitus, Peneleos, Thoas,  Deïpyrus, Meriones, and Antilochus, and later in the same Book, with the Greeks desperately battling to save their ships, Poseidon, under the guise of Thoas, asks the Greek hero Idomeneus: Where have all our proud Greek threats against the Trojans gone? And Idomenes responds, that Zeus must wish for all our deaths, far from home and unremembered, but:\n:Thoas, seeing that aforetime thou wast ever staunch in fight, and dost also urge on another, wheresoever thou seest one shrinking from fight, therefore now cease thou not, but call to every man.\nHis only speech occurs in Book 15 where the Greeks, having seen Hector miraculously reappear on the battlefield, are \"seized with fear\". But Thoas, addressing the Greeks, says:\n:\"Now look you, verily a great marvel is this that mine eyes behold, how that now he is risen again and hath avoided the fates, even Hector. In sooth the heart of each man of us hoped that he had died beneath the hands of Aias, son of Telamon. But lo, some one of the gods hath again delivered and saved Hector, who verily hath loosed the knees of many Danaans, as, I deem, will befall even now, since not without the will of loud-thundering Zeus doth he stand forth thus eagerly as a champion. Nay come, even as I shall bid, let us all obey. The multitude let us bid return to the ships, but ourselves, all we that declare us to be the best in the host, let us take our stand, if so be we first may face him, and thrust him back with our outstretched spears; methinks, for all his eagerness he will fear at heart to enter into the throng of the Danaans.\"\nAnd finally, in Book 19, Thoas is one of the small delegations of Greeks who Odysseus took with him to the tent of Agamemnon, to bring back the many gifts Agamemnon had pledged to give Achilles, in reparation for his taking Briseis.\nOther sources\nAfter the Iliad in the Posthomerica, Thoas appears regularly throughout. In Book 4, he participated in the chariot race during the funeral games of Achilles, in which he came third after Menelaus and Sthenelus. In Book 6, after originally fleeing from Eurypylus, son of Telephus, he along with Teucer, Idomeneus, Meriones, and Thrasymedes, son of Nestor, go and save Agamemnon and Menelaus from being slain. In the process Thoas with his spear wounded Paris, the cause of the war, on the right thigh, after Eurypylus had killed his friend Echemmon. In Book 11, he killed Lamus and Lyncus. In Book 12, he is mentioned as on of the men inside the Trojan Horse.\nTwo other events concerning Thoas's involvement in the Trojan War, occurred after the events covered in the Iliad, and are given in other later sources. In the Little Iliad, a poem in the Trojan War Cycle covering the war from the death of Achilles, to the building of the Wooden Horse, Thoas wounds Odysseus, so as to make him unrecognizable on a spy mission inside Troy. Several late sources name Thoas as was one of the Greek warriors who were hidden inside the Wooden Horse.\nThoas is also mentioned in the Odyssey, in a war story told by Odysseus.\nAfter the war\nThoas was one of the few Greek leaders to return from the war unharmed. According to some accounts he returned to Aetolia where, presumably, he resumed his rule, while according to others Thoas settled in Italy, in the land of the Brutti.\nLocal tradition associated Thoas with the Greek city of Amphissa, the main city of Western Locris. The geographer Pausanias reports seeing a tomb at Amphissa, which was said to be the tomb of Thoas' parents Andraemon and Gorge, and a bronze statue of Athena in her temple on the acropolis of Amphissa, that was said to have been brought back from Troy by Thoas as a spoil of war. Apollodorus reports that according to some, after Odysseus was exiled from Ithaca in punishment for his killing the suitors of Penelope, he sought refuge with Thoas in Aetolia. There he married Thoas' daughter, had a son Leontophonus with her, and died of old age.\nNotes\nReferences\n* Apollodorus, Apollodorus, The Library, with an English Translation by Sir James George Frazer, F.B.A., F.R.S. in 2 Volumes. Cambridge, Massachusetts, Harvard University Press; London, William Heinemann Ltd. 1921. [https://www.perseus.tufts.edu/hopper/text?doc=urn:cts:greekLit:tlg0548.tlg001.perseus-eng1 Online version at the Perseus Digital Library].\n* Gantz, Timothy, Early Greek Myth: A Guide to Literary and Artistic Sources, Johns Hopkins University Press, 1996, Two volumes:  (Vol. 1),  (Vol. 2).\n* Grimal, Pierre, The Dictionary of Classical Mythology, Wiley-Blackwell, 1996. .\n* Hard, Robin, ''The Routledge Handbook of Greek Mythology: Based on H.J. Rose's \"Handbook of Greek Mythology\", Psychology Press, 2004, . [https://books.google.com/books?id=r1Y3xZWVlnIC Google Books].\n* Homer, The Iliad with an English Translation by A.T. Murray, Ph.D. in two volumes. Cambridge, Massachusetts, Harvard University Press; London, William Heinemann, Ltd. 1924. [http://data.perseus.org/citations/urn:cts:greekLit:tlg0012.tlg001.perseus-eng1:1.1-1.32 Online version at the Perseus Digital Library].\n* Homer, The Odyssey with an English Translation by A.T. Murray, PH.D. in two volumes. Cambridge, Massachusetts, Harvard University Press; London, William Heinemann, Ltd. 1919. [https://www.perseus.tufts.edu/hopper/text?doc=Perseus%3Atext%3A1999.01.0136%3Abook%3D1%3Acard%3D1 Online version at the Perseus Digital Library].\n* Hyginus, Gaius Julius, Fabulae in Apollodorus' Library and Hyginus' Fabulae: Two Handbooks of Greek Mythology, Translated, with Introductions by R. Scott Smith and Stephen M. Trzaskoma, Hackett Publishing Company,  2007. .\n* Liddell, Henry George, Robert Scott. A Greek-English Lexicon. Revised and augmented throughout by Sir Henry Stuart Jones with the assistance of. Roderick McKenzie. Oxford. Clarendon Press. 1940. [https://www.perseus.tufts.edu/hopper/text;jsessionid=E61EDD48E4F1A22F839AA4DC149C0955?doc=Perseus%3atext%3a1999.04.0057 Online version at the Perseus Digital Library]\n* Lycophron, Alexandra (or Cassandra) in Callimachus and Lycophron with an English translation by A. W. Mair; Aratus, with an English translation by G. R. Mair, London: W. Heinemann, New York: G. P. Putnam 1921. [https://archive.org/stream/callimachuslycop00calluoft#page/n5/mode/2up Internet Archive].\n* Most, G.W., Hesiod: The Shield, Catalogue of Women, Other Fragments, Loeb Classical Library, No. 503, Cambridge, Massachusetts, Harvard University Press, 2007, 2018. . [https://www.loebclassics.com/view/LCL503/2018/volume.xml Online version at Harvard University Press].\n* Parada, Carlos, Genealogical Guide to Greek Mythology, Jonsered, Paul Åströms Förlag, 1993. .\n* Pausanias, Pausanias Description of Greece with an English Translation by W.H.S. Jones, Litt.D., and H.A. Ormerod, M.A., in 4 Volumes. Cambridge, Massachusetts, Harvard University Press; London, William Heinemann Ltd. 1918. [https://www.perseus.tufts.edu/hopper/text?doc=Paus.+1.1.1 Online version at the Perseus Digital Library].\n* Plutarch, Greek Questions in Moralia, Volume IV: Roman Questions. Greek Questions. Greek and Roman Parallel Stories. On the Fortune of the Romans. On the Fortune or the Virtue of Alexander. Were the Athenians More Famous in War or in Wisdom?. Translated by Frank Cole Babbitt. Loeb Classical Library No. 305. Cambridge, Massachusetts: Harvard University Press, 1936. . [https://www.loebclassics.com/view/LCL305/1936/volume.xml Online version at Harvard University Press]. [https://www.perseus.tufts.edu/hopper/text?doc=Perseus%3Atext%3A2008.01.0215%3Asection%3Dintro Online version at the Perseus Digital Library].\n* Quintus Smyrnaeus, Quintus Smyrnaeus: The Fall of Troy, Translator: A.S. Way; Harvard University Press, Cambridge Massachusetts, 1913. [https://archive.org/stream/falloftroy00quin#page/n5/mode/2up Internet Archive].\n* Smith, William; Dictionary of Greek and Roman Biography and Mythology, London (1873). [https://www.perseus.tufts.edu/hopper/text?doc=Perseus%3atext%3a1999.04.0104 Online version at the Perseus Digital Library]\n* Strabo, Geography, translated by Horace Leonard Jones; Cambridge, Massachusetts: Harvard University Press; London: William Heinemann, Ltd. (1924). [https://penelope.uchicago.edu/Thayer/E/Roman/Texts/Strabo/home.html LacusCurtis], [https://www.perseus.tufts.edu/hopper/text?doc=Perseus%3Atext%3A1999.01.0198%3Abook%3D6%3Achapter%3D1%3Asection%3D1 Online version at the Perseus Digital Library, Books 6&ndash;14]\n* Tripp, Edward, Crowell's Handbook of Classical Mythology, Thomas Y. Crowell Co; First edition (June 1970). .\n* Virgil, Aeneid, Theodore C. Williams. trans. Boston. Houghton Mifflin Co. 1910. [https://www.perseus.tufts.edu/hopper/text?doc=Perseus%3Atext%3A1999.02.0054%3Abook%3D1%3Acard%3D1 Online version at the Perseus Digital Library].\n* West, M. L. (2003), Greek Epic Fragments: From the Seventh to the Fifth Centuries BC'', edited and translated by Martin L. West, Loeb Classical Library No. 497, Cambridge, Massachusetts, Harvard University Press, 2003.  . [http://www.loebclassics.com/view/LCL497/2003/volume.xml Online version at Harvard University Press]."
    }
  ]
}