{
  "content": [
    {
      "type": "text",
      "text": "# Thomas Howard, 3rd Earl of Effingham\n\n| death_place      = Great Britain\n| spouse           = Catherine Proctor\n| father           = Thomas Howard, 2nd Earl of Effingham\n| mother           = Elizabeth Beckford\n}}\nLieutenant-Colonel Thomas Howard, 3rd Earl of Effingham, PC (13 January 1746 – 19 November 1791), styled Lord Howard until 1763, was a British army officer, courtier and colonial administrator. He was the son of Thomas Howard, 2nd Earl of Effingham, and his wife Elizabeth. He was commissioned an ensign and lieutenant in the 2nd Regiment of Foot Guards on 20 February 1762. He was promoted to captain in the 5th Regiment of Foot on 13 September 1765.\nHe is best known for resigning his commission in protest against the war against the North American colonies. This widely reported act was commemorated by the North American colonists in the naming of a galley in 1775, and later the frigate USS Effingham in 1777, as well as in the naming of Effingham, New Hampshire, Effingham County, Georgia, and Effingham County, Illinois. In 1770 at the age of 24, he fought as a volunteer in the Imperial Russian Army during the Russo-Turkish War and was present at the Battle of Chesma.\nIn 1775 upon learning that his regiment would be imminently deployed to North America he wrote to the Secretary of State for War Lord Barrington to resign his commission. Giving his reasoning in his letter to Barrington, Effingham stated; \"As I cannot, without reproach from my conscience, consent to bear arms against my fellow subjects in America in what, to my weak discernment, is not a clear cause.\" In a speech to the House of Lords explaining his resignation, Effingham symbolically drew his officer's sword and threw it onto the floor of the chamber.\nDuring the events leading up to the American Revolution, the Earl had taken up a position of neutrality. The Earl disliked both sides: the North ministry for its coercive policies and implementation of taxation, and the colonists for engaging in armed rebellion. Effingham however believed that the conflict would have a negative impact on both Great Britain and America. Despite resigning his commission he professed devotion to the army and to King and country, and claimed that he was willing to lose his life while protecting the realm from attack.\nIn spite of his public resignation and denunciation of the government, Effingham was permitted to return to the army at the time of the threatened invasion and was promoted to lieutenant-colonel in 1782. In 1785, a London newspaper reported that he was being considered for the role of minister to the United States, to reciprocate John Adams coming to Great Britain to serve as Ambassador. However, he did not go to America; George Hammond later served as the first envoy to America. He built Thundercliffe Grange, Rotherham as his new seat, It was built in 1777 by the architect John Platt. He died at the age of 45, while serving as Governor of Jamaica, a month and five days after his wife, leaving no heir. His title passed to his brother Richard.\nReferences\n*\nExternal links\n* [https://web.archive.org/web/20191219052622/http://www.bostoncastle-rotherham.co.uk/EarlofEffingham.html Earl of Effingham]"
    }
  ]
}