{
  "content": [
    {
      "type": "text",
      "text": "# Thomas Edward Barnes Skinner\n\nThomas Edward Barnes Skinner (1840 - September 1902) was the Postmaster General of Ceylon, between 1871 and 1896.\nThomas Edward Barnes Skinner was born c.1842 in Ceylon the oldest son, of six children, to Maj. Thomas Bridges Boucher Skinner CMG (1804-1877), acting Surveyor-General of Ceylon and Georgina née Burrell (1818-1866). His father named him after Sir Edward Barnes, the Governor of Ceylon (1820-1822), of whom he was a great admirer.\nSkinner joined the Ceylon Civil Service on 24 October 1860 and retired on 2 June 1896, after serving 25 years as Postmaster General. His first position was at the Colonial Fiscal Office in Kandy, where he was commended by Sir Richard Francis Morgan in correspondence to the Governor Hercules Robinson. He was then appointed as acting assistant Government Agent for Kurunegala in March 1862 and was confirmed in the position in May. In 1863 he was made the assistant Government Agent for Nuwara Eliya, then acting District Judge Batticaloa in January 1866, and Fiscal for Central Province in 1867 before being appointed Postmaster General in 1871. Skinner was responsible for establishing the Ceylon Post and Telegraph Department in 1905, following the transfer of the responsibility for telegraphs from India to the Ceylon Colonial government in 1880, when on 1 July he was appointed as first Director of Telegraphs. In May 1895 he was appointed as acting Auditor, Accountant General and Controller of Revenue, in addition to his duties of Postmaster General, until the arrival of William Thomas Taylor to the colony.\nSkinner married Sophia Sconce (c.1846-?), they had two children, Ethel Mia (1869-1961) and Percy Cyriac Burrell (1871-1955). Percy served with Northamptonshire Regiment, where he reached the position of Major-General and commander of the 14th (Light) Division. Percy was awarded a KBE, CMG, CB and DSO for his military service.\nIn 1896 Skinner, following his retirement at age 55, returned to England, where he died in September 1902. He is buried at St Mary the Virgin's Church in Shalford, Surrey, England.\nThe Skinner Memorial Ward at the National Hospital of Sri Lanka is named after him.\nExternal links\n*\n*\nReferences\n}}\n}}"
    }
  ]
}