{
  "content": [
    {
      "type": "text",
      "text": "# Thomas B. Hayward\n\n| birth_place   = Glendale, California, U.S.\n| death_date    =\n| death_place   = Seattle, Washington, U.S.\n| placeofburial =\n| allegiance    =\n| branch        = United States Navy\n| serviceyears  = 1942–1982\n| rank          = Admiral\n| unit          =\n| commands      = Chief of Naval OperationsUnited States Pacific FleetUnited States Seventh FleetCarrier Air Wing TenVF-103\n| battles       = World War IIKorean WarVietnam War\n| awards        = Defense Distinguished Service Medal (2)Navy Distinguished Service Medal (3)Coast Guard Distinguished Service MedalLegion of Merit (3) with Combat VDistinguished Flying Cross\n| relations     =\n| laterwork     =\n}}\nAdmiral Thomas Bibb Hayward (May 3, 1924 – March 3, 2022) was Chief of Naval Operations for the United States Navy from July 1, 1978, until June 30, 1982, after which he retired from military service.\nNaval career\nShortly after the commencement of World War II, Hayward enlisted in the U.S. Navy V-5 aviation program and was called to active duty as a naval aviation cadet in 1943, anticipating that he would shortly be flying combat in the South Pacific. However, when roughly halfway through the flight training syllabus, he competed for and was accepted to attend the United States Naval Academy at Annapolis, Maryland, to position himself for a career in the U.S. Navy at war's end. He graduated from the Academy in July 1947, and was assigned to the  as an engineering officer. In 1949, he returned to flight training at Naval Air Station Pensacola, Florida, and received his United States Naval Aviator wings in July 1950. The Korean War having begun, as a lieutenant junior grade, he reported to VF-51 and flew from the decks of the aircraft carriers  and , flying 146 combat missions, and was awarded the Distinguished Flying Cross, seven Air Medals, and two Navy Commendation Medals with Combat \"V\" for Valor. One of Hayward's squadron mates in VF-51 was future astronaut Neil Armstrong, who became his lifelong friend.\nFollowing his Korean tour, Hayward became a Navy test pilot, a lead instructor in the forerunner to the Navy Fighter Weapons School, also known as TOPGUN, and Commanding Officer of VF-103. He also attended the Naval War College in 1958. In 1959 he was one of the 32 finalists for NASA Astronaut Group 1, but ultimately was not selected.\nIn 1965–66, as Commander Carrier Air Wing Ten (CW-10), Hayward flew 36 combat missions in Vietnam, flying from the deck of , receiving the Legion of Merit and three Air Medals. In 1967, he attended the National War College and obtained a master's degree in Foreign Affairs from George Washington University. As a captain, Hayward returned to Vietnam as Commanding Officer of the  and later as Commanding Officer of the , for which he was awarded the Legion of Merit.\nHayward then had tours of duty as commander of the United States Seventh Fleet from 1975 to 1976, and then Commander in Chief of the United States Pacific Fleet from August 12, 1976, to May 9, 1978.\nAs Chief of Naval Operations, Hayward is best remembered for his \"Pride in the Navy\" priority: the emphasis on rebuilding readiness of both active and reserve forces; restoring priority in mine warfare; and his success in the zero tolerance \"Not in my Navy\" drug program.\nIn 1981, he was awarded the Society of Experimental Test Pilots James H. Doolittle Award. In January 2007, the United States Naval Academy Alumni Association announced Admiral Thomas B. Hayward as one of four recipients of its 2007 Distinguished Graduate Award.\nCorporate career and retirement\nAfter retirement from the Navy, his primary efforts were in the field of education, where he helped co-found companies focused on reading and math solutions K-12, masters and doctorates in education, and both domestic and international distance learning for college and higher ed. He also served on the board of advisors of the Code of Support Foundation, a nonprofit military services organization.\nDeath\nHayward died on March 3, 2022, at the age of 97 in Seattle, Washington.\nAwards and decorations\n{| style=\"margin:1em auto; text-align:center;\"\n|colspan=\"3\"|\n|-\n|colspan=\"3\"|&nbsp;\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|\n|\n|\n|-\n|colspan=\"3\"|\n|-\n|}\n{| class=\"wikitable\" style=\"margin:1em auto; text-align:center;\"\n|-\n|colspan=\"3\"|Naval Aviator Badge\n|-\n|Defense Distinguished Service Medal with 1 bronze oak leaf cluster\n|\n|Navy Distinguished Service Medal with 1 gold award star\n|-\n|Coast Guard Distinguished Service Medal\n|Legion of Merit with Combat V and 2 award stars\n|Distinguished Flying Cross\n|-\n|Air Medal with one silver, one bronze award stars and bronze Strike/Flight numeral 3\n|Navy and Marine Corps Commendation Medal with Combat V and award star\n|Navy Unit Commendation with two bronze service stars\n|-\n|Navy Meritorious Unit Commendation\n|China Service Medal\n|American Campaign Medal\n|-\n|World War II Victory Medal\n|Navy Occupation Service Medal\n|National Defense Service Medal with 1 service star\n|-\n|Korean Service Medal with 4 service stars\n|Armed Forces Expeditionary Medal\n|Vietnam Service Medal with 8 service stars\n|-\n|Order of the Rising Sun, degree unknown (Japan)\n|Order of the Cloud and Banner with Grand Cordon, 2nd Grade (Republic of China)\n|Order of National Security Merit Gukseon Medal, 2nd Class (Republic of Korea)\n|-\n|National Order of Vietnam, Knight\n|Vietnam Gallantry Cross with palm\n|Korean Presidential Unit Citation\n|-\n|Vietnam Gallantry Cross Unit Citation\n|United Nations Korea Medal\n|Vietnam Campaign Medal\n|-\n|colspan=\"3\"|Joint Chiefs of Staff Identification Badge\n|-\n|}\nReferences"
    }
  ]
}