{
  "content": [
    {
      "type": "text",
      "text": "# Thomas Edwards (heresiographer)__disambig_1\n\n| birth_place      =\n| burial_place     =\n| death_date       =\n| death_place      =\n| death_cause      =\n| other_names      =\n| years_active     = 16251647\n| occupation       = Preacher\n| education        = M.A. 1625\n| alma_mater       = Queens' College, Cambridge\n| known_for        =\n| spouse           =\n| partner          =\n| parents          =\n| children         = John Edwards\n| relatives        =\n| relativesvv      =\n| website          =\n| footnotes        =\n| signature        =\n| signature_alt    =\n| nocat_wdimage    =\n| religion         = Conservative Presbyterian\n| church           =\n| ordained         =\n| laicised         =\n| writings         = Gangraena\n| congregations    =\n| offices_held     =\n| title            =\n| module           =\n}}\nThomas Edwards (1599–1647) was an English Puritan clergyman. He was a very influential preacher in London of the 1640s, and was a polemical writer, arguing from a conservative Presbyterian point of view against the Independents.\nLife\nHe graduated M.A. from Queens' College, Cambridge in 1625, and became a well-known preacher. He continued to reside at Cambridge, where, after taking orders, he was appointed a university preacher, nicknamed 'Young Luther.' In February 1627 he preached a sermon in which he counselled his hearers not to seek carnal advice when in doubt; declared he would testify and teach no other doctrine though the day of judgment were at hand, and was committed to prison until he could find bonds for his appearance before the ecclesiastical courts. After being frequently summoned before the courts, he received an order  on 31 March 1628 to make a public recantation of his teaching in St. Andrew's Church, with which he complied on 6 April. Edwards did not remain much longer at Cambridge, and in 1629 a Thomas Edwards was licensed to preach in St. Botolph's, Aldgate. His career was cut short by William Laud.\nHe was later able to campaign once more against 'popish innovations and Arminian tenets' at various city churches, at Aldermanbury, and in Coleman Street. In July 1640, on the delivery at Mercers' Chapel of a proudly nonconformist sermon he was prosecuted in the high commission court. He preached where he considered his services were most needed: Christchurch, London, Hertford, Dunmow, and Godalming to which at one time he commuted with three or four journeys a week from London. His base in London from 1644 was Christ Church, Newgate, an important Presbyterian centre. He was particularly concerned about religious sectarianism in the army, opposing the tendency emerging as the Levellers but not yet known as such.\nHe overplayed his hand against the military, in July 1647. With other ministers in London, he encouraged a popular occupation of Parliament, to get reversed the measures taken to exclude eleven Presbyterian leaders. From 26 July for about a week the Presbyterian side, with City of London backing, were apparently in power in London. The Army then moved in, taking back control by 4 August. Edwards went into exile in the Netherlands, and died of ague before the end of the year.\nGangraena\nHis major work was Gangraena from 1646, a large catalogue of sectarian Protestant views, written from a fearsomely adversarial point of view and treating them as heresies. He hoped that the list would silence or damage his opponents, but they responded, criticising Presbyterianism.\nIn the work,  as the first ideological identification of Levellers, Edwards summed up Levellers' views and attacked their radical political egalitarianism that showed no respect for the constitution. The prime targets in part III of his work were the men who were to be recognized as the leaders of the Leveller party.\nOther writings\nHis first book was Reasons Against the Independent Government of Particular Congregations of 1641, an attack on religious tolerance and the Independent faction as it was coming to importance, and addressed to Parliament. It started a round of controversy, one participant being Katherine Chidley, another William Walwyn with  A Whisper In The Eare of Mr Thomas Edwards in 1646 using mild satire.\nAnother work was Antapologia of 1644, an attack on five members of the Westminster Assembly belonging to the Independents (William Bridge, Jeremiah Burroughs, Thomas Goodwin, Philip Nye, and Sidrach Simpson, collectively called the Five Dissenting Brethren). It has been called \"the most elaborate and least gracious\" of the Presbyterian pamphlets on the Independents.\nFamily\nHis son, John Edwards, was a theologian.\nNotes\nSee also\n*Thomas Hall (minister, born 1610)\nReferences\n*Francis J. Bremer, Tom Webster, Puritans and Puritanism in Europe and America: A Comprehensive Encyclopedia (2006), s.v. pp.&nbsp;85–87.\nExternal links\n*P. R. S. Baker, [http://www.oxforddnb.com/view/article/8556 ‘Edwards, Thomas (c.1599–1648)’], Oxford Dictionary of National Biography, Oxford University Press, 2004, accessed 1 June 2007\n*"
    }
  ]
}