{
  "content": [
    {
      "type": "text",
      "text": "# Thomas Edward Simpson\n\nin |native_name= instead.-->\n| honorific_suffix   =\n| image              = Thomas_Edward_Simpson.jpg\n| image_size         =\n| image_upright      =\n| smallimage         =\n| smallimage_alt     =\n| alt                =\n| caption            =\n| order              =\n| office             = Member of Parliament for Algoma West\n| status             =\n| term_start         = December 17, 1917\n| term_end           = October 13, 1935\n| subterm            =\n| suboffice          =\n| alongside          =\n| monarch            =\n| president          =\n| governor_general   =\n| primeminister      =\n| taoiseach          =\n| chancellor         =\n| governor           =\n| co-leader          =\n| vicepresident      =\n| viceprimeminister  =\n| deputy             =\n| lieutenant         =\n| succeeding         =\n| parliamentarygroup = Unionist (1917-1921)  Conservative (1921-1935)\n| constituency       = Algoma West\n| majority           =\n| predecessor        = Arthur Cyril Boyce|\n| successor          = Henry Sidney Hamilton|\n| prior_term         =\n| order2             =\n| office1            = Chief Government Whip|\n| term_start1        = 1930\n| term_end1          = 1935\n| successor1        = Pierre-François Casgrain|\n| predecessor1       = Ross Wilfred Gray|\n| office3            =  2nd Mayor of the City of Sault Ste. Marie, Ontario\n| term_start3        =  January 1913\n| term_end3          =  January 1915\n| successor3        =  J. A. McPhail|\n| predecessor3       = William H. Munro\n| order3             =\n| subterm3           =\n| suboffice3         =\n| alongside3         =\n| birth_date     =\n| birth_place    = Dufferin County, Ontario, Canada\n| death_date     =\n| death_place    = Sault Ste. Marie, Ontario, Canada\n| residence      =\n| profession     =\n| spouse         = Minnie Maxwell\n| children       = 2 daughters (Helen, Gertrude)\n|}}\nThomas Edward Simpson (August 10, 1873 &ndash; July 16, 1951) was a Canadian politician and businessman.\nSimpson was born on a farm in Dufferin County, Ontario on August 10, 1873. In the 1890s he  moved to Sault Ste. Marie and started a furniture business that he operated until 1943.\nHe became involved in municipal politics, being elected a town councillor in 1908. He was elected town mayor in 1909 and acclaimed to that office in 1910.\nIn April 1912, Sault Ste. Marie became incorporated as a city. Simpson became the city's second mayor and the first elected to the role. (Under the terms of incorporation, William H. Munro the town mayor in 1912 was made the first city mayor following incorporation until the end of his term.) Simpson was re-elected as mayor of the city in 1914.\nHe served in federal politics from 1917 to 1935, representing the electoral district of Algoma West in the House of Commons. He was first elected in the 1917 federal election as a member of Robert Borden's Unionist Party caucus. He was re-elected in 1921, as a member of Arthur Meighen's Conservative Party. He was re-elected in the general elections of 1925, 1926 and 1930.\nHe served as Chief Government Whip from 1930 to 1935. He served in parliament for nearly 18 years until announcing his retirement from politics in April 1935 due to his health. He completed his final term in parliament in October 1935.\nIn 1895, he married Minnie Maxwell. The couple had two daughters, Helen and Gertrude. From 1900 to 1943, Simpson operated a furniture store in Sault Ste. Marie. He and his brother Albert operated a funeral home at Queen and Elgin streets until 1945.\nHe was a charter member of the city's Rotary Club, and a volunteer with the Children's Aid Board, the Plummer Memorial Hospital Board and the public school board.\nHe died in Sault Ste. Marie on July 15, 1951. His funeral was held two days later at Central United Church. He was interred in Greenwood Cemetery.\nReferences"
    }
  ]
}