{
  "content": [
    {
      "type": "text",
      "text": "# Thompson Township, Delaware County, Ohio\n\n|population_total         = 659\n|population_density_km2   = auto\n|population_density_sq_mi = auto\n|timezone                 = Eastern (EST)\n|utc_offset               = -5\n|timezone_DST             = EDT\n|utc_offset_DST           = -4\n|elevation_footnotes      =\n|elevation_m              = 280\n|elevation_ft             = 919\n|coordinates              =\n|postal_code_type         =\n|postal_code              =\n|area_code                =\n|blank_name               = FIPS code\n|blank_info               = 39-76617\n|blank1_name              = GNIS feature ID\n|blank1_info              = 1086058\n|website                  =\n|footnotes                =\n}}\nThompson Township is one of the eighteen townships of Delaware County, Ohio, United States. As of the 2020 census the population was 659.\nGeography\nLocated in the northwestern corner of the county, it borders the following townships:\n*Prospect Township, Marion County - north\n*Radnor Township - east\n*Scioto Township - south\n*Leesburg Township, Union County - southwest\n*Claibourne Township, Union County - northwest\nNo municipalities are located in Thompson Township.\nName and history\nThompson Township was founded in 1820. Thompson is the name of an early government surveyor.\nStatewide, other Thompson Townships are located in Geauga and Seneca counties.\nGovernment\nThe township is governed by a three-member board of trustees, who are elected in November of odd-numbered years to a four-year term beginning on the following January 1. Two are elected in the year after the presidential election and one is elected in the year before it. There is also an elected township fiscal officer, who serves a four-year term beginning on April 1 of the year after the election, which is held in November of the year before the presidential election. Vacancies in the fiscal officership or on the board of trustees are filled by the remaining trustees.\nReferences\nExternal links\n*[http://www.co.delaware.oh.us County website]"
    }
  ]
}