{
  "content": [
    {
      "type": "text",
      "text": "# Thomas Wenman (MP for Buckingham)\n\nThomas Wenman (c. 1548 – 23 July 1577) (also Waynman or Weynman) was an English country gentleman who briefly sat in the House of Commons of England, representing Buckingham.\nHe was the eldest son of Sir Richard Wenman, a Buckinghamshire landowner, by his marriage to Isabel, daughter and coheiress of John Williams, 1st Baron Williams of Thame, who on her father's death in 1559 inherited the manor of Thame.\nWenman was briefly one of the members of parliament for Buckingham in the parliament of 1571. On his father's death in 1573 he succeeded to estates in Twyford, Beaconsfield, Amersham, Penn, the Chalfonts, and elsewhere in Buckinghamshire, plus the manor of Eaton, then in Berkshire.\nOn 9 June 1572 Wenman married Jane West, a daughter of William West, 1st Baron De La Warr, at St Dunstan-in-the-West, in the City of London, and in the next five years they had three sons and a daughter. Wenman died at Twyford on 23 July 1577 (perhaps of gaol fever that had broken out at Oxford), and was buried in Twyford church, where he has a monument. He left high debts, some to the Crown, having borrowed at high interest before coming into his inheritance, and some of his land had to be sold. The manor of Eaton Hastings was sold to Sir John Danvers of Dauntsey for £7,700, but for various reasons the conveyance was not completed and was still the subject of lawsuits at the time of Danvers's death in 1594.\nWhen Wenman died his eldest son and heir, Richard Wenman, was aged only four and the Court of Wards and Liveries made him the ward of Jane Wenman and the Earl of Leicester. Leicester sold his interest in the wardship to James Cressy, who then married Jane Wenman, but died in 1581. Jane Wenman subsequently (in January 1587/88) married Thomas Tasburgh of Hawridge, Buckinghamshire, who took her part in contesting the title to the manor of Eaton Hastings with Sir John Danvers. After Tasburgh's death in 1602/03 her fourth marriage was to Ralph Sheldon (1537-1613), Esquire, of Beoley, Worcestershire.\nWenman's youngest son, Ferdinando, was knighted and traveled to Virginia in 1610, where he died by the end of the year. He was interred in the church at Jamestown, becoming the first English knight to be buried in America.\nNotes"
    }
  ]
}