{
  "content": [
    {
      "type": "text",
      "text": "# Thomas Stewart (civil engineer)\n\n|birth_place          = Craigend, Perthshire, Scotland\n|death_date           =\n|death_place          = Cape Town, South Africa\n|education            = University of Glasgow\n|spouse               = Mary Mackintosh Young (1902–1921);Matabele Thompson (m.1928)\n|parents              =\n|children             = 3 sons\n|discipline           = Civil Engineer\n|institutions         =\n|practice_name        =\n|employer             =\n|significant_projects =\n|significant_design   = Woodhead Dam\n|significant_advance  =\n|significant_awards   =\n|signature            =\n}}\nThomas Stewart (30 March 1857 – 23 October 1942) was a hydraulic engineer, who was born in Scotland and died at Cape Town, South Africa. He designed the Woodhead Dam, which was named an International Historic Civil Engineering Landmark by the American Society of Civil Engineers in 2008. He was called the \"father of consulting engineering in South Africa\" and the \"first South African consulting engineer\".\nLife\nStewart was born at Craigend, Perthshire, Scotland on 30 March 1857. At age 16, he became a student of D.H. Halkett in Alyth. In 1876, he was named an assistant at the Glasgow Corporation Waterworks. He studied at the University of Glasgow. In 1881, he was an assistant to John Wolfe-Barry. In 1882, he was named by Crown Agents for the Colonies as an assistant to J.G. Gamble for water supply and irrigation in the Cape Colony.\nHe resigned from Government Service in 1886, visited Britain, and returned to South Africa as resident engineer for the Cradock waterworks. He designed the waterworks for Wynberg. In 1892, he began a private practice in Cape Town. His early projects included the design and construction of five reservoirs on Table Mountain. These were Woodhead, Hely-Hutchinson, Alexandra, Victoria, and De Villiers. He went on to build other reservoirs, waterworks, and wastewater treatment plants in South Africa.\nIn the Second Boer War, he was a major without pay in the Royal Engineers. He worked in the construction of defence works.\nIn 1902, he married Mary Mackintosh Young. They had three sons. She died in 1921. In 1928, he married Matabele, widow of F.R. Thompson.\nHe was a member of the Institution of Civil Engineers, the second president of the Cape Society of Engineers, and a president of the Royal Society of South Africa.\nStewart died at Kenilworth, Cape Town at the age of 85.\nReferences"
    }
  ]
}