{
  "content": [
    {
      "type": "text",
      "text": "# Thomas Edward Scrutton\n\nSir Thomas Edward Scrutton (28 August 1856 – 18 August 1934) was an English barrister, judge, and legal writer.\nBiography\nThomas Edward Scrutton was born in London, the son of Thomas Urquhart Scrutton (1828–1896), a wealthy shipowner and head of the well-known shipping firm of Scrutton and Co. He was educated at the Mill Hill School. From there, he was a student at Trinity College, Cambridge, and at University College London.\nAt Cambridge he won the Whewell Scholarship and the Yorke Prize four times, the first person to do so. He was also President of the Cambridge Union. Despite his achievements, he did not obtain a fellowship at Trinity; his former pupil Sir Frank MacKinnon speculated that Scrutton did not attempt to gain fellowship, due to a feeling among some fellows that he lacked \"originality\".\nHe was called to the bar by the Middle Temple in 1882, and developed a busy practice in commercial cases. He became a King's Counsel in 1901 and a bencher of the Middle Temple in 1908. He was also professor of constitutional law and legal history at University College, London. In the 1886 election, he stood unsuccessfully as the Liberal candidate for Limehouse.\nJudicial career\nHe was a judge of the King's Bench Division (1910–16), and of the Court of Appeal (1916–34). He frequently sat in the Court of Appeal with Bankes and Atkin LJJ, a combination which has often been cited as one of the strongest benches ever to sit in commercial cases. On the criminal side he presided over the celebrated 1915 \"Brides-in-the-Bath\" trial of George Joseph Smith, and made a crucial ruling on \"similar fact evidence\": Smith was charged with murdering only one of his recent brides by drowning her in the bath, but Scrutton ruled that the fact that two of his other brides had died in almost identical circumstances was admissible as evidence of a method or pattern of murder.\nDespite his great ability, Scrutton had a reputation as a difficult judge to appear before: \"he did not suffer fools gladly, and often refused to suffer them at all\" was one verdict. His stern appearance and sweeping beard (he is said never to have shaved) intimidated most of those who appeared before him. His intolerance extended even to other judges, particularly the flamboyant and controversial Sir Henry McCardie whom he openly despised, and whom he attacked with increasing bitterness until their mutual antipathy resulted in a public quarrel. McCardie committed suicide soon afterwards, but the cause is generally thought to have been depression, unconnected to the quarrel.\nHis reputation for being difficult may explain his failure to achieve further promotion to the House of Lords since he was unquestionably well qualified on merit to be a Law Lord. In his later years, he is said to have mellowed considerably: Henry Cecil, the judge and humourist, recalled in his memoir Just Within the Law that Scrutton, in the only case Cecil argued in front of him, had been perfectly polite, although he could not resist one dry comment that a barrister who feels that he must repeat every point four times cannot have much opinion of the Court's intelligence. James Atkin, Baron Atkin, his former pupil, always spoke of Scrutton with affection and respect.\nWorks\nScrutton wrote The Contract of Affreightment as Expressed in Charter-parties and Bills of Lading (1886), in which he drew on his knowledge of the family business as well as his legal training. Over a century later, it remains a standard text on the topic. Other legal works included one on copyright.\nPersonal life and family\nIn private life he had a passion for golf and, according to his granddaughter (see below), musical and musically appreciative. He was noted for religious scepticism: at his death, he left instructions that there should be \"no empty Christian rituals\" at his burial, although his wishes were either ignored or overlooked. His son Tom, in contrast to his father's scepticism, became a clergyman.\nHe married Mary Burton in 1884 and had three sons and one daughter. The youngest son (Hugh Urquhart Scrutton) died in the First World War and is commemorated on the Doiran Memorial. Mary Midgley, the philosopher, was his granddaughter, and gave a valuable sketch of him in her 2005 autobiography The Owl of Minerva.\nReferences\nExternal links\n*"
    }
  ]
}