{
  "content": [
    {
      "type": "text",
      "text": "# Thomas Taylor (historian)\n\nThomas Taylor (26 February 1858 – 5 July 1938) was an English priest, historian and scholar of Celtic culture.\nLife and career\nTaylor was born in Thurvaston, Derbyshire, England. He attended King Edward VI School, Macclesfield becoming head boy in 1874. He matriculated at St Catharine's College, Cambridge in 1877, and graduated in the Mathematics Tripos in 1881, receiving his MA in 1886. Taylor took Holy Orders on going down from Cambridge, being ordained Deacon at Rochester in 1881 and was made Priest there in 1883.\nAfter a few years (1883 – c. 1896) in Queensland, Australia, he settled with his wife and family in Cornwall. He served as Vicar first at All Saints' Church, Falmouth, from 1890 and then at Redruth from 1892. In 1897 he accepted the rural living of St Breward. In 1900 he became the Vicar of St Just in Penwith.\nTaylor was an honorary Canon of Truro Cathedral from 1917 to 1938. In 1919 he went to serve at Gunwalloe. He was elected Proctor and held this office from 1919 to 1935. He also served as Rural Dean of Penwith from 1924 to 1927.  He became known as \"the poor man’s lawyer\" as a result of his freely given assistance in matters of compensation for injuries sustained in tin mining.\nCanon Taylor was made a bard at the inaugural Gorseth Kernow held at Boscawen-Un, St Buryan on 21 September 1928. He took the bardic name ‘'Gwas Ust'’ (‘Servant of St. Just’).\nWhen he died in 1938, he was Vicar of St. Just. He listed his recreations as pedigree making and fly fishing.\nScholarly work\nDuring his time at St Breward he found the parish registers to be complete from 1599 to 1812: his work editing the registers brought him into contact with W. P. Phillimore, a publisher of books relating to Ecclesiastical Law, who in 1905 appointed him editor of the Parish Marriage Registers throughout the diocese: by 1916 he had published twenty-five volumes. It is for this work, much used by genealogists and family historians, that he is probably most widely known.\nHe contributed to the Encyclopædia Britannica and the Victoria County History of Cornwall, of which he was local editor. His standard works Celtic Christianity and Life of St Samson of Dol are still sources of reference.\nBibliography\n*1909: A Life of John Taylor LL.D, of Ashburne Nisbet. Biography of John Taylor of Ashbourne.\n*1914: Cornwall Parish Registers. Edited by Thomas Taylor. London: Phillimore & Co\n*1916: The Celtic Christianity of Cornwall Longmans\n*1925: Life of St. Samson of Dol SPCK\n*1932: ''The History of St. Michael's Mount Cambridge University Press\nSee also\n*Celtic Christianity\nReferences\nBibliography\n* Who Was Who, 1929-1940 page 1330\n* Journal of the Royal Institution of Cornwall'' New series II, Vol II, part I, 1994, pages 74–84 by Robert Parker\n* [https://west-penwith.org.uk/justvic.htm West Penwith resources]"
    }
  ]
}