{
  "content": [
    {
      "type": "text",
      "text": "# Thompson-Harding Monument\n\n| type               = Marble & Granite\n| height_metric      =\n| width_metric       =\n| length_metric      =\n| height_imperial    = 156\n| width_imperial     = 90\n| length_imperial    = 90\n| metric_unit        = cm\n| imperial_unit      = in\n| city               = Washington, D.C., United States\n| museum             =\n| coordinates        =\n| owner              = Rock Creek Cemetery\n}}\nThompson-Harding Monument is a public artwork by an unknown artist, located at Rock Creek Cemetery in Washington, D.C., United States. The monument was originally surveyed as part of the Smithsonian's Save Outdoor Sculpture! survey in 1993.\nDescription\nThis two sided sculpture's focal point is a large granite cross placed upon three granite steps. On the north side of the cross stands a full-size portrait of N. Elbridge Thompson and on the opposite side is a full-size portrait of Lillie May Harding. Thompson wears a suit with a long jacket, vest and bow tie. He has sideburns, a mustache and a beard. Harding wears a long dress with intricate carvings of lace on the borders. She has long hair which lies over her proper right shoulder and in her proper left hand she holds a lily.\nThe north side of the monument is engraved: THOMPSON\nThe south side of the monument is engraved: HARDING\nThe west side of the base is engraved:\n:ERECTED BY ELLEN J. THOMPSON\n:AND S. ELIZABETH HARDING\nGallery\nFile:Thompson-Harding Monument (1898) Control IAS DC000064 Right.jpg|North Proper Right\nFile:Thompson-Harding Monument (1898) Control IAS DC000064 FrontDetail.jpg|North Detail\nFile:Thompson-Harding Monument (1898) Control IAS DC000064 BackDetail.jpg|North\nFile:Thompson-Harding Monument (1898) Control IAS DC000064 BackProperLeft.jpg|North Proper Right\nFile:Thompson-Harding Monument (1898) Control IAS DC000064.jpg|North Detail\nInformation\nThis monument was erected by members of both families. Lillie May Harding died in 1897 at the age of twenty-seven.\nThe Washington Post described the monument in 1977 as follows: \"a rugged cross, an angel in the act of dropping a stone flower, and a statue of a portly gentleman trying hard to look celestial in a coat and tails.\"\nCondition\nThis sculpture was surveyed in 1993 for its condition and it was described as needing treatment.\nReferences"
    }
  ]
}