{
  "content": [
    {
      "type": "text",
      "text": "# Thomas Hayward (cricketer)\n\nThomas Hayward (21 March 1835 – 21 July 1876) was an English first-class cricketer who was generally reckoned to be one of the outstanding batsmen of the 1850s and 1860s. In the early 1860s, he and Robert Carpenter, his county colleague, were rated as the two finest batsmen in England. Richard Daft was among those ranking them as equal first, though George Parr reckoned Carpenter the better of the two.\nHayward was from a famous cricketing family. His father was Daniel Hayward and his nephew was the Surrey and England batsman Tom Hayward.\nHayward played as a right-handed batsman for Cambridge Town Club (Cambridgeshire) 1854–72 and also for numerous representative teams. At the end of the 1859 English cricket season, Hayward was one of the 12 players who took part in cricket's first-ever overseas tour when an England cricket team led by George Parr visited North America. He also was member of the first All England XI to tour Australia, and travelled out on the SS Great Britain\nHis overall first-class career record covered 118 matches. He scored 4789 runs at an average of 25.33 with a highest score of 132 and 6 centuries. He took 62 catches.\nHayward was also a good right arm medium pace bowler, using the prevailing roundarm style. His bowling figures were 267 wickets for 3937 runs at an average of 15.81. His best innings analysis was an impressive 9–30. He took 5wI on 19 occasions and 10wM in 2 matches.\nHe is buried in the Mill Road cemetery, Cambridge.\nReferences\nFurther reading\n* H S Altham, A History of Cricket, Volume 1 (to 1914), George Allen & Unwin, 1926\n* Derek Birley, A Social History of English Cricket, Aurum, 1999\n* Rowland Bowen, Cricket: A History of its Growth and Development, Eyre & Spottiswoode, 1970\n* Arthur Haygarth, Scores & Biographies, Volumes 3–9 (1841–1866), Lillywhite, 1862–1867\n* John Major, More Than A Game, HarperCollins, 2007\n*"
    }
  ]
}