{
  "content": [
    {
      "type": "text",
      "text": "# Thomas Howard Fellows\n\nThomas Howard Fellows (October 1822 – 8 April 1878) was an English rower and an Australian politician and Judge of the Supreme Court of Victoria.\nEarly life in England\nFellows was born at Rickmansworth, Hertfordshire, the son of Thomas Fellows, solicitor, and his wife Mary Howard. He was educated at Eton College and then worked with his father. He studied in Pleaders' chambers and was later assistant to the master pleader, Thomas Chitty. In 1847 he published The Law of Costs as Affected by the Small Debts Act and Other Statutes. Fellows was also an enthusiastic rower and rowed for Leander Club.  In 1846, he was runner up in the Diamond Challenge Sculls to Edward Moon and with E Fellows as partner runner up in Silver Wherries. He was also unsuccessful in the Wingfield Sculls. In 1847 he was runner up in Silver Wherries with T Pollock. He was one of the signatories to the revised rules for the Wingfield Sculls in 1848. In 1849 he was a member of the Leander crew which won the Stewards' Challenge Cup. In 1850 he was runner up with C L Vaughan in Silver Goblets at Henley to James John Hornby and Joseph William Chitty who was the son of Thomas Chitty.\nFellows took out a certificate as a special pleader and practised until called to the Bar in November 1852. Shortly after, he sailed to Australia in the Kent.\nPolitical career in Australia\nIn April 1853 Fellows arrived in Melbourne, and was admitted to the Victorian Bar in May.  He considered seeking a police magistracy, but in time was appointed standing counsel to the Pastoral Association. He was a keen sportsman and in Melbourne often rowed on the Yarra River and played football with the South Yarra Football Club.\nIn September 1854 Fellows was elected to the Victorian Legislative Council for Loddon. He succeeded Robert Molesworth as Solicitor-General in the government of William Haines in June 1856. In August 1856 he stood unsuccessfully for Central Province but was elected for the Electoral district of St Kilda in September. In February 1857 he became briefly Attorney General in succession to William Stawell. He was then Solicitor-General in the second Haines ministry from April 1857 to March 1858. He was elected for Central Province in May 1858 by one vote and served in the ministry of William Nicholson without portfolio from October 1859 to November 1860. In October 1863 he became Postmaster-General in the ministry of James McCulloch but withdrew in March 1864. Fellows was also a councillor for Prahran, Victoria from 1861 to 1864 and in 1863 was elected one of the first borough councillors of Queenscliff, Victoria where he spent his summers. He became mayor of Queenscliff in 1865.\nIn 1866 the Governor, Sir Charles Darling asked Fellows, as leader of the opposition, to form a ministry, but they were unable to agree terms. Fellows was elected for St Kilda again in the 1868 general election and was Minister of Justice in the ministry of Charles Sladen and leader of the government in the Legislative Assembly.\nIn 1870 Fellows became a trustee of the Public Library, Museums and National Gallery and in 1872 he helped to organize the exhibits from Victoria for the 1873 London International Exhibition. He served on a commission to look at accommodation for the branches of the Supreme Court. In December 1872 he became fifth judge of the Supreme Court of Victoria. Also in 1872 he published The New Constitution of Victoria.\nFellows died at his home in South Yarra at the age of 55. A plaque to his memory was put up in St. George's Anglican Church, Queenscliff to which he had contributed generously. Fellows Road in Queenscliff was named after him. Fellows' summer house at Queenscliff, Warringah, is listed on the Victorian Heritage Register for both its architectural and historic significance.\nReferences\nExternal links\n*[http://www.slv.vic.gov.au/pictoria/a/1/5/doc/a15435.shtml State Library of Victoria - Portrait]\n*\n&nbsp;"
    }
  ]
}