{
  "content": [
    {
      "type": "text",
      "text": "# Thomas Edward Cliffe Leslie\n\n| death_place       = Belfast\n| nationality       = Irish\n| field             = Political Economy\n| contributions     =\n}}\nThomas Edward Cliffe Leslie (21 June 182527 January 1882) was an Irish jurist and economist. He was professor of jurisprudence and political economy in Queen's College, Belfast, noted for challenging the Wages-Fund doctrine and for addressing contemporary agrarian policy questions.  A critic of Ricardian orthodoxy, he said that it had sidelined consumer behaviour and demand. He developed the idea of consumer sovereignty, but insisted that the analysis of demand should be based on historical and comparative institutional work.\nEarly life\nT. E. Cliffe Leslie was born in the county of Wexford, the second son of the Rev. Edward Leslie, prebendary of Dromore, and rector of Annahilt, in the county of Down. His family was of Scottish descent, but had been connected with Ireland since the reign of Charles I. Amongst his ancestors were John Leslie (1571–1671), bishop first of Raphoe and afterwards of Clogher, and the bishop's son Charles Leslie.\nCliffe Leslie received his elementary education from his father, who resided in England, though holding church preferment and some landed property in Ireland.  His father taught him Latin, Greek and Hebrew at an unusually early age.  Afterwards, for a short time he was under the care of a clergyman at Clapham, and was then sent to King William's College, in the Isle of Man.\nHe entered the University of Dublin, Trinity College in 1842. He was a distinguished student there, obtaining, besides other honours, a classical scholarship in 1845, and a senior moderatorship (gold medal) in mental and moral philosophy at his degree examination in 1846. He became a law student at Lincoln's Inn, was for two years a pupil in a conveyancers chambers in London, and was called to the English bar. But his attention soon turned from the pursuit of legal practice, for which he seems never to have had much inclination.\nAcademic career\nIn 1853, Cliffe Leslie was appointed to the professorship of jurisprudence and political economy in Queen's College, Belfast. The duties of this chair requiring only short visits to Ireland in certain terms of each year, he continued to reside and pursue his studies in London, and became a frequent writer on economic and social questions in the principal reviews and other periodicals.\nIn 1860 he collected a number of his essays, adding several new ones, into a volume entitled Land Systems and Industrial Economy of Ireland, England and Continental Countries. JS Mill gave a full account of the contents of this work in a paper in the Fortnightly Review, in which he pronounced Leslie to be one of the best living writers on applied political economy. Mill had sought his acquaintance on reading his first article in ''Macmillan's Magazine; he admired his talents, took pleasure in his society, and treated him with a respect and kindness which Leslie always gratefully acknowledged.\nIn the frequent visits which Leslie made to the continent, especially to Belgium and some of the less-known districts of France and Germany, he occupied himself much in economic and social observation.  He studied the effects of the institutions and system of life which prevailed in each region, on the material and moral condition of its inhabitants. In this way he gained an extensive and accurate acquaintance with continental rural economy, of which he made excellent use in studying parallel phenomena at home. The accounts he gave of the results of his observations were among his happiest efforts; no one, said Mill, was able to write narratives of foreign visits at once so instructive and so interesting. In these excursions he made the acquaintance of several distinguished persons, amongst others of M. Lonce de Lavergne and M. Émile de Laveleye. To the memory of the former of these he afterwards paid a graceful tribute in a biographical sketch (Fortnightly Review'', February 1881); and to the close of his life there existed between him and M. de Laveleye relations of mutual esteem and cordial intimacy.\nWritings\nLeslie's work falls into two categories: applied political economy and the discussion of the philosophical method of the science.  The Land Systems and Industrial Economy of Ireland, England and Continental  Countries belonged principally to the former division.  Two essays of Leslie's appeared in volumes published under the auspices of the Cobden Club.  The Land System of France (2nd ed., 1870), contained an earnest defence of la petite culture and still more of la petite propriété. Financial Reform (1871), set forth the impediments to production and commerce arising from indirect taxation.  Many other articles were contributed by him to reviews between 1875 and 1879, including several discussions of the history of prices and the movements of wages in Europe, and a sketch of life in Auvergne in his best manner.  The most important of them, however, related to the philosophical method of political economy, notably a memorable one which appeared in the Dublin University periodical, Hermathena.\nIn 1879 the provost and senior fellows of Trinity College published for him a volume in which a number of these articles were collected under the title of Essays in Political and Moral Philosophy. These and some later essays, together with the earlier volume on Land Systems, form the essential contribution of Leslie to economic literature. He had long contemplated, and had in part written, a work on English economic and legal history, which would have been his magnum opus, a more substantial fruit of his genius and his labours than anything he has left. But the manuscript of this treatise, after much pains had already been spent on it, was unaccountably lost at Nancy in 1872; and, though he hoped to be able speedily to reproduce the missing portion and finish the work, no material was left in a state fit for publication. What the nature of it would have been may be gathered from an essay on the History and Future of Profit in the Fortnightly Review for November 1881, which is believed to have been in substance an extract from it.\nThat he was able to do so much may well be a subject of wonder when it is known that his labours had long been impeded by a painful and depressing malady, from which he suffered severely at intervals, whilst he never felt secure from its recurring attacks. To this disease he in the end succumbed at Belfast, on 27 January 1882.\nCliffe Leslie emphasised the land question as a central issue for the social welfare of both Ireland and England.  This volume has both a breadth of view and a rich variety of illustrative detail.  His general purpose was to show that the territorial systems of both countries were so encumbered with historical elements of a feudal origin as to be altogether unfit to serve the purposes of a modern industrial society. The policy he recommended is summed up in the following:Had there been in England a simple jurisprudence relating to land, a law of equal intestate succession, a prohibition of entail, a legal security for tenants' improvements, an open registration of title and transfer, a considerable number of peasant properties, the rural economy of England would long since have created unanswerable objections to the Irish land system in the public mind.—The Land Systems, ed. 1870, p. 2\nMuch of Cliffe Leslie's work concerned the problems of Ireland. He rejected Home Rule as a solution, preferring land reform in favour of small proprietorship.\nMethod\nCliffe Leslie defended the inductive method in political economy, against the attempt to deduce the economic phenomena of a society from the so-called universal principle of the desire of wealth. English empiricism has a long tradition, dating from David Hume and Francis Bacon.  Leslie was of this empirical tendency of British economic thought.  He said that[Economics'] fundamental laws ought to be obtained by careful induction, that assumptions from which an unreal order of things and unreal uniformities are deduced cannot be regarded as final or adequate; and that facts, instead of being irrelevant to the economist's reasoning, are the phenomena from which he must infer his general principles, and by which he ought constantly to verify his deductions.\nFurther, he spoke of the...necessity of studying every economic problem in conformity with the universal canons of the logic of science – of accepting no assumptions as finally established without proof, none as adequate from which conclusions untrue as matters of fact are found to result, and no chains of deduction from hypothetical premises as possessing more than hypothetical truth, until verified by observation.\nThe first influence which impelled Cliffe Leslie in the direction of the historical and comparative institutional methods was that of Sir Henry Maine, himself a student of historical jurisprudence as represented by Savigny.  Maine's Ancient Law (1861) is famous for the thesis that law and society developed \"from status to contract\".  Maine's personal teaching of jurisprudence, as well as the example of his writings, led Cliffe Leslie to look at the present economic structure and state of society as the result of a long evolution. Of the German economists who represent similar tendencies, only perhaps Roscher was an influence.  And the writings of Comte, whom he admired though critically, must have powerfully co-operated to form in him the habit of regarding economic science as only a single branch of sociology.\nThe earliest writing in which Leslie's revolt against the so-called orthodox school distinctly appears is his Essay on Wages, first published in 1868 and reproduced as an appendix to the volume on Land Systems. In this, after criticism of the Wages-Fund doctrine and the lack of agreement between its results and the observed phenomena, he concludes by declaring that political economy must be an inductive, instead of a purely deductive science.  By this change, it will gain in utility, interest and real truth far more than a full compensation for the forfeiture of a fictitious title to mathematical exactness and certainty. But it is in the essays collected in the volume of 1879 that his attitude in relation to the question of method is most decisively marked. In one of these, on the political economy of Adam Smith, he exhibits in a very interesting way the co-existence in The Wealth of Nations of historical-inductive investigation in the manner of Montesquieu with a priori speculation founded on theologico-metaphysical bases, and points out the error of ignoring the former element, which is the really characteristic feature of Smith's social philosophy, and places him in strong contrast with the school of Ricardo.\nThe essay, however, which contains the most brilliant polemic against the orthodox school, as well as the most luminous account and the most powerful vindication of the new direction, was that of which we have above spoken as having first appeared in Hermathena. It may be recommended as supplying the best extant presentation of one of the two contending views of economic method. On this essay mainly rests the claim of Leslie to be regarded as the founder and first head of the English historical school of political economy. Those who share his views on the philosophical constitution of the science regard the work he did, notwithstanding its unsystematic character, as in reality the most important done by any English economists in the latter half of the 19th century. But even the warmest partisans of the older school acknowledge that he did excellent service by insisting on a kind of inquiry, previously too much neglected, which was of the highest interest and value, in whatever relation it might be supposed to stand to the establishment of economic truth. The members of both groups alike recognised his great learning, his patient and conscientious habits of investigation and the large social spirit in which he treated the problems of his science.\nCliffe Leslie insisted on an inductive, historical and institutional approach, which was in vogue in the late-Nineteenth Century.  Even so, a recent assessment views his work in applied economics as complementary to contemporary theoretical work.\nWorks\n* The Military Systems of Europe Economically Considered (1856)\n* \"Political Economy and the Rate of Wages\", ''Fraser's Magazine (15 July 1868);    Reprinted in Land Systems... (1870) pp.&nbsp;357–379. On line.\n* [http://socserv2.socsci.mcmaster.ca/~econ/ugcm/3ll3/leslie/LandSystems.pdf  Land Systems and Industrial Economy of Ireland, England and Continental Countries, London, Longmans, Green (1860); new edition, (1870)]\n* [http://socserv2.socsci.mcmaster.ca/~econ/ugcm/3ll3/leslie/leslie03.html  The Love of Money (1862) Reprinted in Essays in Political Economy, cited below, p. 189.]\n* [http://socserv2.socsci.mcmaster.ca/~econ/ugcm/3ll3/leslie/leslie01.html  \"The Political Economy of Adam Smith\", Fortnightly Review (1 November 1870)]\n* Financial Reform, Cobden Club Essays, 2nd Series (1871)\n* [http://socserv2.socsci.mcmaster.ca/~econ/ugcm/3ll3/leslie/leslie04.html  \"The History of German Political Economy\", Fortnightly Review (1 July 1875)]\n* [http://socserv2.socsci.mcmaster.ca/~econ/ugcm/3ll3/leslie/leslie02.html  \"On the Philosophical Method of Political Economy\", Hermathena, Dublin University (1876)]\n* The Land System of France, Cobden Club Essays (1876)\n* [http://socserv2.socsci.mcmaster.ca/~econ/ugcm/3ll3/leslie/leslie06.html  \"Political Economy and Sociology\", Fortnightly Review (1 January 1879)]\n* Essays in Political and Moral Philosophy, Dublin and London, Hodges, Foster & Figgis and Longmans, Green (1879)\n* Essays in Political Economy, Dublin, Hodges, Figgis & Co. (1879, 1888)\n* [http://socserv2.socsci.mcmaster.ca/~econ/ugcm/3ll3/leslie/leslie05.html  \"Political Economy in the United States\", Fortnightly Review (1 October 1880)]\n* \"The Irish Land Question\", Appleton's Journal (1881)\n* \"History and Future of Profit\", Fortnightly Review (November 1881)\nReferences\nSources\n*\n* F. W. Fetter, \"Leslie, T. E. Cliffe\", International Encyclopedia of the Social Sciences D. L. Sills (ed.) (Macmillan and Free Press, 1968), vol. 2.\n*\n* G. M. Koot, English Historical Economics, 1870–1926: The Rise of Economic History and Neomercantilism, Cambridge, Cambridge University Press (1987)\n* G. M. Koot, \"T. E. Cliffe Leslie, Irish Social Reform, and the Origins of the English Historical School of Economics,\" in James Wilson (1805–1860), Isaac Butt (1813–1879), T. E. Cliffe Leslie (1827–1882), ed. Mark Blaug, Elgar Reference Collection Series, Pioneers in Economics, vol. 22. Aldershot, Elgar pp.&nbsp;92–116 (1991)\n* Gregory C. G. Moore, \"T. E. Cliffe Leslie and the English Methodenstreit,\" Journal of the History of Economic Thought 17 pp.&nbsp;57–77 (Spring 1995)\n* Geoffrey Martin Hodgson, \"The Historical School in the British Isles\", How Economics Forgot History: The Problem of Historical Specificity in the Social Sciences, Routledge (2001)\n* R. D. Collison Black, \"The political economy of Thomas Edward Cliffe Leslie (1826–82): a re-assessment\", European Journal of the History of Economic Thought, Volume 9, Number 1, pp.&nbsp;17–41 (1 March 2002)\nExternal links\n*[http://socserv2.socsci.mcmaster.ca/~econ/ugcm/3ll3/leslie/index.html Works of Thomas Edward Cliffe Leslie] available at the Archive for the History of Economic Thought'' website at McMaster\n* Dictionary of Irish Biography |url=https://www.dib.ie/biography/leslie-thomas-edward-cliffe-a4808 |website=www.dib.ie |language=en}}"
    }
  ]
}