{
  "content": [
    {
      "type": "text",
      "text": "# Thomas Edward Campbell\n\n|birth_place = Prescott, Arizona Territory\n|death_date  =\n|death_place = Phoenix, Arizona\n|party       = Republican\n|spouse      =\n|profession  =\n|nationality    = American\n}}\nThomas Edward Campbell (January 18, 1878 – March 1, 1944) was the second governor of the state of Arizona, United States.  He was the first Republican and first native-born governor elected after Arizona achieved statehood in 1912.\nIn 1917, he was declared the governor of Arizona in a disputed gubernatorial election but the decision was later overturned by the courts, who awarded the election to George W. P. Hunt. Campbell ran for governor again and won two terms, serving 1919–1923. He died in 1944. He played instrumental roles in the drafting of Arizona's tax and revenue laws and adoption of the Colorado River Compact that allocated water rights among the western states.\nEarly years\nBorn in 1878 in Prescott, Arizona, to Daniel E. \"Dashing Dan\" and Eliza (Flynn) Campbell, who came to Fort Whipple, Arizona Territory, in 1873 where Daniel worked until 1887. Campbell was the first graduate of Prescott High School in 1893. Over six feet tall, he was a star athlete on the Prescott football team. He attended St. Mary's College of California in Oakland where he studied geology, but did not receive a degree.\nIn 1898, he became assistant postmaster of Prescott, attempted to enlist in the Spanish–American War (his mother thought him too young and nixed the plan), and soon moved to Jerome, Arizona becoming its assistant postmaster. President Roosevelt appointed him postmaster of Jerome, serving 1902–1906. In June 1900 he married Eleanor Gayle Allen whose father was co-superintendent of the rich United Verde Copper Company, Jerome.\nDuring the 1890s through the 1910s, Tom Campbell also managed mines in Jerome and south of Prescott, none of them proved to be bonanzas. He became a respected mining engineer and mine manager, and, until dedicating himself to a political career, did consultant work across the desert Southwest. Miner Frank Crampton, in his reminiscence Deep Enough, provides a rare glimpse of work in small mining operations of the period, including Campbell's Big Stick, Copper Belt, and other mine operations.\nIn 1900, Campbell was elected to the Arizona Territorial Legislature introducing bills to create the separate county of Verde with Jerome as seat, and another mandating an eight-hour workday. Both failed. Campbell was appointed Yavapai County Tax Assessor in 1907 and held that post until 1914 when he was elected Arizona State Tax Commissioner.\nGovernor\nDuring the 1916 election held on November 7, Campbell ran against incumbent George W. P. Hunt who was seeking election to his third term.  Initially, Campbell was declared the winner by 30 votes but Hunt refused to vacate the governor's office and both men took the oath of office on December 30, 1916.\nHunt filed suit in the Arizona Superior Court on January 25, 1917, and on January 27, the court declared Campbell de facto governor. Hunt agreed to turn over the office on January 29, but appealed and on December 22, 1917, the Arizona Supreme Court overturned the lower court ruling. Campbell vacated the office on December 25, but also filed an appeal with the Arizona Supreme Court on January 8, 1917, that was denied.\nThe most significant events during Campbell's year in office were related to the state-wide copper miner's strike of 1917 and the resultant clashes between owners’ representatives and miners.  Best known, the Bisbee Deportation, \"deputies\" kidnapped approximately 1,300 striking mine workers, their supporters from the Industrial Workers of the World (IWW), and other residents of the town of Bisbee. The workers were loaded onto trains, taken approximately 200&nbsp;mi (320&nbsp;km), dumped on the hands of the troops protecting the border at Columbus, New Mexico.\nCampbell earlier interceded in Jerome, Globe, and condemned the actions at Bisbee and elsewhere.  He was embarrassed by the excessive actions by the striking IWW workers and the mine company response. He visited Bisbee after the incident and condemned both the IWW and deportation\n.\nAlso during his 1917 tenure, the flag of Arizona was adopted by the legislature without Campbell's consent. Campbell never explained his reasons for not signing the bill.\nBecause of the State Supreme Court election ruling, Gov. Campbell stepped down in December 1916, and immediately began campaigning.  He was elected to the governor's office in November 1918 and again in 1920.  Major issues included the Colorado River Compact and the reform of state taxation ensuring corporations paid their share.   In 1922, he lost reelection against perennial candidate George W. P. Hunt.\nLater life\nGovernor Campbell went on to become a member of the Republican National Committee and served as president of the United States Civil Service Commission from 1930 to 1933. He died March 1, 1944, of a cerebral hemorrhage while on the grounds of the state capitol in Phoenix and is buried in Prescott.\nReferences"
    }
  ]
}