{
  "content": [
    {
      "type": "text",
      "text": "# Thomas Warwick\n\nThomas Warwick (or Warrick) was a poet and unbeneficed clergyman of Cornish origin, born about 1755, died after 1785. He took part in the revival of the sonnet form at the end of the 18th century and his other writing included odes and poems on mediaeval subjects. His behaviour was described as eccentric and he died early in a carriage accident.\nLife\nThomas Warwick was born about 1755 to the Rev. Thomas Warwick of Levalsa in Cornwall.  After attending Truro Cathedral School, where he first began writing poetry, he went on at sixteen to University College, Oxford in 1771. There he took the Bachelor of Laws degree and afterward entered Anglican holy orders but never gained a benefice. While still at Oxford in 1777, he published The Rights of Sovereignty Asserted, a loyalist poem directed against the American revolutionaries and their French allies. Between 1783-5 he published a number of longer, more ambitious poems from Bath, where he appeared to be living before a fatal fall from an open carriage.\nPoetry\nWarwick is credited with publishing five books between 1777 and 1785, as well as a few poems in the periodicals ''The Gentleman's Magazine, The London Magazine and The European Magazine. After his death his shorter poems were collected together  in Richard Polwhele's anthology Poems Chiefly by Gentlemen of Devonshire and Cornwall (1792). Poems were also included in two miscellanies, the fashionable An Asylum for Fugitive Pieces, in Prose and Verse (1786) and, in the following century, New Elegant Extracts: A Unique Selection from the Most Eminent British Poets (1823).\nWarwick wrote in a restricted number of genres popular in the 18th century. Polwhele used his comment on the style of Warwick’s odes in order to typify their author's character:\nHis Odes, it must be owned, are often obscure; but this is owing to an abruptness which is never forced or affected. They are fiery: they are enthusiastic: they will remain, indeed, the too expressive types of a life irregular and eccentric, and of a death that put a sudden period to the career of his genius and his pleasures.\nIn addition to The Rights of Sovereignty Asserted, with which he began his literary career, others in more regular style include the \"Rhapsody written at Stratford upon Avon\", the \"Ode occasioned by the death of Prince Leopold\", and the dramatic \"Song of Blondel\" intended for musical performance. The last two of these were published together anonymously in 1785 and only acknowledged later as Warwick's by Polwhele.\nIn Warwick's time at Oxford, the sonnet form was being revived by the group of poets about Thomas Warton, with which it has been argued that he was associated.  The fourteen that he published as a block in his composite book of 1783 may compare with the section of nine sonnets in Warton's Poems (1777) and John Codrington Bampfylde's Sixteen Sonnets (1778). In the preface to his own sonnets, Warwick defended the form, and particularly the example of John Milton, against Samuel Johnson's strictures,  judging it \"in extent of subject equally comprehensive with the Ode, and in its design more uniform and simple\". But where Milton had modelled some of his sonnets on the odes of Horace, Warwick eventually went further in successfully adapting to sonnet form the longest fragment then remaining of a Greek ode to peace by Bacchylides. That Warwick's reputation as a sonneteer was notable in his day is demonstrated by his name being included as a writer of sonnets next to Bampfylde's in \"a list of living English poets\" in ''The Gentleman's Magazine  for 1792.\nBoth of Warwick’s longer works focused on mediaeval relationships. The \"dramatic poem\" of Edwy'', was more of a Shakespearean drama and came with a quotation from Milton's list of subjects for tragic theatre as its epigraph: \"Edwy – for lust deprived of his kingdom – or rather by faction of the monks whom he hated – together with the impostor Dunstan.\" It deals with the Anglo-Saxon king Eadwig and was published anonymously in 1784, although its authorship seemed to be generally known and Warwick was so identified in the long discussion of the play in The English Review. Although his theatrical debut is praised there for its ambition, it was not without reservations concerning the play's dramatic effectiveness and coherence.  A slightly earlier author who followed Milton's suggestion of subject was Thomas Sedgwick Whalley, whose poem Edwy and Edilda (Dodsley, 1779) was written in ballad metre. Four years later Fanny Burney began writing her own verse tragedy, Edwy and Edilda, although its eventual performance in 1795 was a failure.\nThe article in The English Review identified Warwick as \"already known to the public by an imitation of Pope's Eloisa and some beautiful sonnets\". It refers to Alexander Pope's Eloisa to Abelard, first published in 1717. By the time of Warwick's imitation in 1783 there had already been ten others, all cast as Abelard's reply to Eloisa and written in heroic couplets. His, prefaced by the fourteen sonnets already mentioned and the \"Rhapsody written at Stratford upon Avon\", was in the same form. But since this version met with dismissive reviews, Warwick rewrote it considerably and published his new 1785 edition with a scholarly apparatus which fared a little better with critics.\nA completely different poem on the same theme has also been attributed to Warwick in the British Museum Catalogue, according to the bibliographical account by Lawrence S. Wright. However, that attribution was not made at the time of the poem's publication, nor in the 1841 Catalogue of printed books in the British museum, nor in the 1878 Bibliotheca Cornubiensis. Titled Abelard to Eloisa : a poetic epistle newly attempted, this version was published anonymously a year before Warwick's poem and was dismissed by The Critical Review as \"weak, nerveless and deprived of all power to please\". A later revised version was published in a so-called \"fourth edition\", accompanied by two more heroic epistles, with the additional information that it had originally been written in 1777. This information was further corroborated when the poem was reprinted in the 1787 edition of John Hughes' Letters of Abelard & Heloise, with a particular account of their lives and misfortunes, and attributed there to a certain Mr Seymour, as were two lines from the poem quoted in the course of a 1785 epistolary novel.\nReferences\nBibliography\n*Richard Polwhele, [https://books.google.com/books?id=VuRn3CX3_b8C Poems Chiefly by Gentlemen of Devonshire and Cornwall], Bath 1792\n*Thomas Warwick, [https://books.google.com/books?id=aKpYAAAAcAAJ Abelard to Eloisa. An Epistle. To which are prefixed, Sonnets. With a Rhapsody written at Stratford-upon-Avon], Bath 1783\n*Thomas Warwick, [https://books.google.com/books?id=IcNgAAAAcAAJ Abelard to Eloisa : an epistle. With a new account of their lives, and references to their original correspondence], Bath 1785\n*Thomas Warwick bibliography: Bibliotheca Cornubiensis, London 1878, [https://books.google.com/books?id=rdBUE0quOxYC&dq=poem+%22Thomas+Warwick%22&pg=PA854 vol.2, pp.853-4]\n* Lawrence S. Wright, \"Eighteenth-Century Replies to Pope's Eloisa\", Studies in Philology 31. 4 (Oct., 1934), [https://www.jstor.org/stable/4172251 pp. 525-8]"
    }
  ]
}