{
  "content": [
    {
      "type": "text",
      "text": "# Thoroughfare Gap Battlefield\n\n| designated_other1_number       = 030-1016\n| designated_other1_num_position = bottom\n| image                          = Thoroughfare Gap Marker and Beverley Mill.jpeg\n| caption                        = Historical marker, with Beverly Mill in the background\n| location                       = Junction of Interstate 66 and State Route 55, Broad Run, Virginia\n| coordinates                    =\n| locmapin                       = USA Virginia Northern#USA Virginia#USA\n| built                          =\n| architect OR builder           =\n| architecture                   = Federal, Mid 19th Century Revival\n| added                          = November 18, 1999\n| area                           =\n| refnum                         = 99001374\n}}\nThoroughfare Gap Battlefield is a historic American Civil War battlefield located at Thoroughfare Gap, Broad Run, Prince William County, Virginia. It was the site of the Battle of Thoroughfare Gap. The property includes a number of resources present at the time of the battle including the separately listed Beverley Mill, a five-story, coursed-rubble stone building set into the north side of Thoroughfare Gap. Meadowlands, the Chapman's house and the second Upper Mill are clearly visible on the landscape, as well as an important ice pit and a walled cemetery associated with the Chapman family.\nIt was listed on the National Register of Historic Places in 1999. The Civil War Trust (a division of the American Battlefield Trust) and its partners have acquired and preserved  of the battlefield. The battlefield is accessible from a walking trail adjacent to the ruins of Chapman's Mill, located north of Interstate 66 on Beverly Mill Drive. Sharpshooters used the mill's upper floor windows to defend the pass. Historic and wayside markers are placed along Virginia Route 55 just south of the mill.\nReferences\nExternal links\n*[https://www.loc.gov/pictures/item/va0853/ Meadowland (Ruins), State Route 55, near Beverley's Mill, Haymarket, Prince William County, VA]: 1 photo at Historic American Buildings Survey"
    }
  ]
}