{
  "content": [
    {
      "type": "text",
      "text": "# Thrall (Warcraft)\n\n| creator= Chris Metzen\n| adapted_by = Christie Golden\n| alias = Go'el (birthname)\n| lbl21 = Class\n|data21  = Shaman\n| race = Orc\n| family = Durotan (father)Draka (mother)\n| title = Warchief of the Horde\n| occupation = ChieftainGladiatorSlave\n}}\nThrall, born as '''Go'el', is a fictional character who appears in the Warcraft series of video games by Blizzard Entertainment. Within the series, Thrall is an orc shaman who served for a time as a Warchief of the Horde, one of the major factions of the Warcraft universe, as well as the leader of a shaman faction dedicated to preserving the balance between elemental forces in the world of Azeroth known as the Earthen Ring. Originally introduced in promotional material released by Blizzard Entertainment as the protagonist of the canceled video game Warcraft Adventures: Lord of the Clans'', which was co-developed by Blizzard and Animation Magic from 1996 until 1998, Thrall's first proper appearance is in the 2001 novelization of the canceled video game's narrative authored by American novelist Christie Golden. The novel's story is set during his youth, where he is depicted as a slave who was raised by an abusive human military officer, but eventually rebelled and escaped captivity.\nThe character's first major appearance is in the 2002 video game Warcraft III: Reign of Chaos, where he acts as the leader of a united Horde. Thrall also appears as a supporting character in the Warcraft III expansion pack The Frozen Throne, as well as the massively multiplayer online role-playing game World of Warcraft and its series of expansions. Thrall's other appearances include sequel novels set in the Warcraft series, and the collectible card game Hearthstone. Thrall is a playable character in the crossover multiplayer online battle arena video game Heroes of the Storm. Chris Metzen, the character's creator, voices Thrall in most media, with the exception of Warcraft Adventures where Clancy Brown was the voice actor, and Hearthstone where he is voiced by Lance Henriksen .\nThrall has been positively well received by players and video game journalists, and is considered one of the most iconic and recognizable characters from the Warcraft franchise.\nCharacter overview\nWithin series lore, Thrall is the son of Durotan, former chieftain of the Frostwolf Clan, who refused to drink the Blood of Mannoroth and was killed by agents of the orc warlock Gul'dan. Thrall's journey from birth, to slavery as a gladiator and finally his path on the journey to becoming Warchief of the Horde was covered in extensive detail by contributing writers from Joystiq in a recurring series called Know Your Lore.\nThrall was raised by Aedelas Blackmoore, a self-serving military commander who runs the encampments where the orcs were imprisoned, as his slave. Blackmoore's plans were to raise Thrall to command an orc army to overrun the Alliance, allowing him to forcibly take the position of king. Thrall was trained to handle every weapon and learned battle tactics; he was even forced to compete in many gladiator tournaments that benefit Blackmoore financially following each victory. He also had the opportunity to study basic writing and history. Thrall eventually escapes from Blackmoore with the help of a young human girl named Taretha Foxton. During his captivity, she would sneak notes to Thrall and was considered to be one of his only friends. From Taretha and Thrall's combat instructor, a human warrior simply known as the Sergeant, Thrall learned mercy, kindness and honor, characteristics that changed him and becomes pivotal to his destiny. Instead of a bloodthirsty tribal leader as Blackmoore had planned, he eventually becomes a leader of compassion and honor. His journey during Lord of the Clans depicts the character as a young inexperienced orc leader who is nevertheless ready to lead his people in peace and understanding, whereas Warcraft III leads Thrall to explore the possibility of diplomacy and peace between Alliance and Horde, though the time between Warcraft III and World of Warcraft sees a tenuous glimpse at a peaceful world shattered.\nDevelopment\nThrall was originally developed as the protagonist for the Warcraft Adventures graphic adventure game by series writer Chris Metzen and producer Bill Roper. Thrall was envisioned as an orc who lived his life in human captivity before escaping from his human master. Metzen and his colleagues wanted to present another side to the orcs who are stereotyped as \"brutal, savage dudes who use foul language.\"  Metzen drew comparisons between the orcs of Azeroth and real-life Native American cultures, and the described the former to originally have a \"complex culture\" which is connected to the land and rooted in shamanism; the goal to show the orcs as the best they can be, yet retaining a \"hard edge\".  According to Metzen, Thrall's story arc is the \"archetypal tale of adventure and discovery\" which is directly inspired by the work of Joseph Campbell, in particular the hero's journey. Metzen described Thrall as a traveler through his people's lands yet a stranger to them as he is not raised within an orc culture, and eventually he would meet wiser, more experienced orc characters who recognizes his potential and helps him attain the status to unite the scattered clans of their people.\nAlthough Warcraft Adventures was eventually canceled, Metzen liked Thrall's origin story and wanted to see the concept utilized for another storytelling medium. Christie Golden, the author of Lord of the Clans, recalled that she was given an outline summary of the canceled game's plot, which helps save her time as she usually needs three months to complete a novel and she considered the deadline for Lord of the Clans to be \"tight\". She would then discuss with Metzen on what parts of the outline would work in a novel, and what should be changed as part of the novelization format. Noting that such cooperation \"is unheard of in this line of work\", Golden mentioned an example where her request that Thrall's eyes be made blue was granted without hesitation; she reacted with elation when she first saw a preview trailer for the then-upcoming World of Warcraft which properly depicts Thrall's facial features.\nElements of the novel like Taretha, the Sergeant character, and the majority of Blackmoore's character development were contributions from Golden, who wanted to explore the relationship between Thrall and other human characters to be morally ambiguous. She particularly liked the relationship between Thrall and Taretha and noted that it was very well received by readers. Golden noted that as the overarching plot of Warcraft III requires that several of the races work together in order to stop an otherworldly invasion, the groundwork for it need to be developed in the novel for it to be plausible. On Thrall's relationship dynamics with the orcess Aggra, who would eventually become his wife, Golden commented that Thrall is used to dealing with human women such as Taretha and Jaina Proudmoore, and is initially unused to Aggra due to ingrained cultural differences, but gradually learns to value and appreciate her defining traits, namely \"her bluntness, and her honesty, and her kind of in-your-face attitude\", and in turn he teaches her to respect and value others even if they are not orc by culture or heritage. Golden considers Thrall to be the embodiment of \"non-toxic masculinity\"\nOn the relationship between Thrall and his eventual successor as Warchief, Garrosh Hellscream, Golden said she enjoyed writing their interactions and felt that there was a lot of chemistry between the two characters. Golden noted that Garrosh developed into a darker character over time and believed that he has a weak personality at his core, as he was ashamed of his father Grom and needed external validation from Thrall. Golden said Thrall and Garrosh gravitated towards each other, not out of their differences or the notion that opposite attract, but that they were in fact kindred spirits who are fundamentally very similar characters, whose \"hearts are wounded and guarded but not closed\" in her words.\nThrall's concept design in Heroes of the Storm as a powerful melee fighter was described by the game's Technical Designer John Hodgson as \"a prime example of top-down design\"; that is, the developmental team started with the \"high concept\" or \"feel\" of Thrall as a fantasy character to generate ideas, and then tested and locked down these ideas through the practice of play. His abilities harken back to elements such as his signature large hammer, the character's history as an experienced orc shaman, and the developmental team's own experiences from playing Farseer units in Warcraft III as well as Enhancement Shamans in World of Warcraft. According to Hodgson, the team spent a lot of iteration time trying to figure out which five abilities they could settle Thrall on given the length and breadth of what the character is conceptually capable of within series lore, which are tested against the game's mechanics in identifying what the character needed from a gameplay perspective \"in order to feel fun and effective\".\nAppearances\nLord of the Clans\nShortly after his birth, Thrall's parents, Durotan and Draka, are killed by assassins sent by Gul'dan. Found by Aedelas Blackmoore of Durnholde Keep, Thrall was raised from a young age as a gladiator and trained in many forms of combat. After earning his freedom thanks to his childhood friend Taretha, Thrall escapes Durnholde and sets out to find a group of orcs that had evaded Blackmoore. He finds these orcs to be those of the Warsong clan, led by Grom Hellscream. After learning some of his cultural history from Grom, Thrall heads for the mountains of Alterac to find his clan, the Frostwolves. There he met with their leader, the shaman Drek'Thar, who teaches Thrall the old ways of shamanism in orc culture. Thrall is visited by the former Warchief Orgrim Doomhammer, and learns more about his past and the reasons for his parents' death. With his new power and knowledge provided by both Drek'Thar and Orgrim, Thrall raises an army by freeing his people from the prison encampments, rallying them under the goal of freedom and a return to the orcish life before the war. Orgrim falls in a battle liberating one of the encampments, and in his final moments, names Thrall as the new Warchief of the Horde and bequeaths him his black armor and namesake war hammer.\nThrall launches an attack on the fortress of Durnholde to free all the remaining entrapped orcs at once by cutting off any more reinforcements. He succeeds in taking Durnholde fortress and kills Blackmoore. However, he is too late to save Taretha. At the end of the book, Thrall crushes Durnholde with his elemental powers, then addresses the Horde, promising they will succeed under his leadership. For a time, the Horde travels throughout Lordaeron, never staying in one location for too long.  In the novella Of Blood and Honor Thrall liberates the city of Stratholme and encounters the veteran orc Eitrigg, along with Eitrigg's \"blood brother\" Tirion Fordring, a human paladin who had just been exiled for rescuing Eitrigg.  Upon learning that the Horde has rediscovered its shamanistic roots, Eitrigg readily joins Thrall, eventually becoming his advisor, while Thrall and Tirion depart on friendly terms.\nWarcraft III\nThrall is plagued by visions from a mysterious prophet, telling him to take the Horde west across the sea. Deciding to learn more about his visions, Thrall meets the prophet, who insists that he must sail across the ocean to Kalimdor. Thrall gathers the other orc clans and steals some human ships to sail to Kalimdor. Thrall and a few of the other ships find themselves caught amidst a storm and later finds himself taken captive by a tribe of murlocs to be used as a sacrifice. Thrall is able to break free, but is not able to save fellow captive Sen'jin, leader of the local troll Darkspear tribe and the first to be sacrificed, though the surviving Darkspear led by Sen'jin's son Vol'jin join the Horde.\nAfter the Horde lands in Kalimdor, Thrall witnesses a battle between the savage centaurs and noble tauren, opting to assist the latter. Grateful, tauren chieftain Cairne Bloodhoof pledges his clan to join the Horde, and shows Thrall the location of the Oracle that would help the orcs find their destiny. Thrall travels to the location, Stonetalon Peak, where the prophet appears and reveals himself to be Medivh. Medivh warns of the Burning Legion invasion that would overrun Azeroth, and convinces Thrall that humans faction led by Jaina Proudmoore (who had also heeded Medivh's warnings) and the native night elves would need to work together to defeat the Legion. Medivh informs Thrall that during a concurrent battle with the night elves, Grom had willingly drank the blood of the demonic pit lord Mannoroth, binding the Warsong clan to the Legion's will. The combined forces of Thrall and Jaina manage to subdue Grom and purge Mannaroth's influence from his body.  Thrall and Grom confront Mannaroth; Thrall is defeated but Grom manages to slay Mannaroth at the cost of his own life.  Mannaroth's death frees the orcs from the Legion's control. Thrall's and Jaina's forces fight against Archimonde and the Legion at the base of Mount Hyjal, to buy their night elf allies enough time to prepare a trap against Archimonde with their Wisps. Though the Horde and Alliance succeed in defeating the Legion, tensions still remain between the two factions. The Horde would go on to build the city of Orgrimmar, naming the surrounding region Durotar, with the former named for Orgrim Doomhammer and the latter named for Durotan.\nIn the Warcraft III: The Frozen Throne expansion pack, Thrall and Jaina are depicted as attempting to preserve their alliance, though most of their people remain suspicious of each other. Jaina's father Admiral Daelin Proudmoore, who harbors a personal vendetta against the orcs over past defeats as well as the death of his son, later leads a naval force and attacks Orgrimmar to stop the orcs from establishing themselves in the new world. Jaina helps Thrall and Rexxar, the new Champion of the Horde, defeat and eventually kill Admiral Proudmoore.\nWorld of Warcraft\nThe narrative of World of Warcraft takes place in the years following the aftermath of Admiral Proudmoore's defeat, where several incidents have occurred between the Horde of Orgrimmar and the humans of Theramore led by Jaina that jeopardize their uneasy alliance as depicted in the novel World of Warcraft: Cycle of Hatred.\nDuring his tenure as Warchief, Thrall accepts the undead Forsaken led by Sylvanas Windrunner into the Horde's ranks and allows orc warlocks within the cities, as long as they use their talents against demons.  However, several orc factions, including the demon worshipping Burning Blade and Searing Blade cults, refuse to recognize Thrall as the new Warchief and attempt to have him assassinated, but are thwarted by Horde adventurers.\nThe events and characters surrounding the escape of Thrall from the Lord of the Clans novel are depicted In World of Warcraft: The Burning Crusade, where players are sent back in time to assist Thrall's escape and ensure that he is freed, as a new enemy travels through time attempting to stop the rise of the new Horde. Thrall also visits Outland, where he meets his grandmother, Greatmother Geyah, the leader of an orc remnant who were never corrupted by demons known as the Mag'har. Geyah tells him he was meant to be named Go'el, meaning \"to redeem\" in the orcish language. He also meets Garrosh Hellscream, the Mag'har son of Grom Hellscream, who had given into despair and shame as a result of his father being disgraced because he had been the first to drink Mannoroth's blood. Thrall convinces Garrosh that his father died a hero, and recruits him and the other Mag'har into the Horde.\nIn World of Warcraft: Wrath of the Lich King, Thrall dispatches the Horde to Northrend against the Lich King and his Scourge forces.  The Horde and Alliance join forces during the Battle of Angrathar the Wrathgate, which ends in disaster when Grand Apothecary Putress betrays the Horde and unleashes the New Plague on Horde, Alliance and Scourge alike while the dreadlord Varimathras stages an uprising in the Undercity, forcing Sylvanas to flee to Orgrimmar.  As Thrall and Sylvanas plan a counterattack, Jaina warns Thrall that the Alliance High King Varian Wrynn blames the Horde for Putress' actions at Wrathgate, and that a war between the Horde and Alliance is likely imminent.  Thrall leads the Horde into successful retaking the Undercity from Varimathras but the victory is short lived when Varian, who led the Alliance into killing Putress, confronts Thrall over the Forsaken's treatment of the Undercity, which was formerly the Alliance land of Lorderon.  Jaina is able to teleport Varian and his forces back to Stormwind City before a battle could break out, but Thrall laments over the broken peace between the Horde and Alliance.\nThrall is summoned to attend an emergency meeting in Dalraan when the Old God Yogg-Saron escapes his prison in Ulduar.  Thrall takes Garrosh, now a military leader in the Northrend Campaign, with him but the two are intercepted by Jaina due to Varian being in attendance at the council.  Having grown increasingly arrogant, Garrosh ignores Thrall's warnings and interrupts the meeting, leading to a brawl between him and Varian which is broken up by Kirin Tor leader Rhonin.  Still angered over the events of Wrathgate and the Undercity, Varian refuses to work with the Horde and departs, while Thrall expresses his disappointment in an indignant Garrosh.  Thrall later attends the tournament held by Tirion Fording, now Supreme Commander of the Argent Crusade, to choose the best champions of the Alliance and Horde to lead a final assault against the Lich King in Icecrown Citadel.\nIn World of Warcraft: The Shattering, a prelude to World of Warcraft: Cataclysm, as the relationship between the Horde and Alliance continues to deteriorate, Thrall begins to question his place as Warchief and whether or not he truly knows himself at all.  When the elements of Azeroth become increasingly unstable, Thrall decides to travel to Outland and consult the elements of Nagrand.  Thrall steps down as Warchief, and against the advice of Cairne and his advisor Eitrigg, appoints Garrosh as acting Warchief, hoping that the position would instill a sense of responsibility into him.  Upon his arrival in Nagrand, Geyah has Thrall hone his shamanism under the tutelage of Mag'har orcess Aggra.  Despite a rocky start between the two, mostly due to their different cultural upbringings, Aggra helps Thrall connect with Outland's elements and rediscover his own spirit.  The two grow closer and eventually fall in love.  Thrall and Aggra return to Azeroth, where Thrall is informed of Cairne's death following a Mak'gora with Garrosh that had been sabotaged by Cairne's rival Magatha Grimtotem.\nDuring the events of Cataclysm, the corrupted Dragon Aspect Deathwing emerges from Deepholm, causing widespread destruction across Azeroth.  Thrall decides to join the Earthen Ring in healing the rift between Azeroth and the Elemental Plane that had been damaged by Deathwing, and discards his black armor in favor of white shaman robes.  On the way to the Maelstrom, Thrall is captured by the Alliance's intelligence organization SI:7 but is rescued by members of the goblin Bilgewater Cartel.  Thrall intervenes during a power struggle between the Cartel and its Trade Prince Gallywix and arranges to have the Bilgewater join the Horde.  Shortly after arriving at the Maelstrom, Thrall contacts Vol'jin, whose rising tensions with Garrosh resulted in the Warchief relocating the Darkspear tribe to the Echo Isles, and reassures the troll chieftain to give Garrosh's leadership a chance and to keep the Horde united.\nIn the novel Thrall: Twilight of the Aspects, which takes place during Cataclysm, Thrall begins to feel burdened and stressed by the pressure of his newfound duties.  Thrall is summoned to help the four remaining dragon Dragonflights with several daunting tasks, including: assisting the Green Dragonflight Aspect Ysera in talking down a fire elemental in Feralas, improving his relationship with the night elves in the area; helping the Bronze Dragonflight leader Nozdormu prevent an alternate timeline from merging with the main one; bringing the Red Dragonflight Life-Binder Alexstrasza out of her depression; and putting a stop to the infighting between the leaderless Blue Dragonflight by appointing Kalecgos as its new Aspect.  With the four Dragonflights united, Thrall is able to thwart an attack on Wymrest Temple by the Twilight's Hammer cult and defeats a version of Blackmoore summoned from the alternate timeline by the cult.  Thrall overcomes his personal burdens and begins embracing his orc name Go'el.\nWhen the Elemental Lord of Fire Ragnaros is summoned to Azeroth, he shows Thrall a vision of the Hour of Twilight, the prophesized event of the Old Gods' return that will be carried out by Deathwing, resulting in Azeroth's destruction.  Thrall and the Earthen Ring join the Cenarion Circle and Dragon Aspects in Mount Hyjal to stop Ragnaros and the Twilight's Hammer from burning down Nodrassil.  Twilight agent Fandral Staghelm captures Thrall and splits his soul into four and scatters them throughout the four elemental planes.  Aggra and several adventurers are able to reclaim Thrall's scattered soul and restore him to health.  Thrall reaffirms his love for Aggra and the two are subsequently wed.\nAfter Ragnaros is defeated, Thrall is asked by the other Aspects into joining them by taking Deathwing's vacant place as the Aspect of Earth.  Thrall acquires the Dragon Stone, an artifact capable of destroying Deathwing, after several adventurers travel to the past to retrieve it and rallies the other Aspects and champions against Deathwing, the Twilight's Hammer, and the Old Gods' forces.  With the Dragon Soul's power, Thrall is able to ultimately defeat Deathwing and prevent the Cataclysm.  As Azeroth's elements heal, the Aspects lose their power and Alexstraza reveals that Aggra is pregnant with Thrall's child.\nIn Tides of War, the prelude to World of Warcraft: Mists of Pandaria, Thrall is made leader of the Earthen Ring by his predecessor Muln Earthfury while Aggra gives birth to their son, Durak.  Thrall secretly meets with Jaina, who urges him to return as the Horde's Warchief as Garrosh has become increasingly hostile and battle hungry; Thrall reluctantly refuses due to his duties with the Earthen Ring.  Later at the Maelstrom, Thrall and the Earthen Ring are informed by a messenger sent by Eitrigg that Garrosh had launched a mana bomb upon Theramore, completely destroying the city and killing its inhabitants.  Believing Jaina to be slain, an enraged Thrall is tempted to kill Garrosh and retake the Warchief position in retaliation, but decides that healing the damage done by Deathwing is a bigger priority.  After receiving a vision of Orgrimmar being destroyed, Thrall is urged by Aggra and the other shaman to step down and return to Kalimdor.  Thrall discovers that Jaina survived the destruction, but driven mad by the effects of the bomb and seeking vengeance against the Horde, attempts to summon a tsunami water elementals to drown Orgrimmar in retaliation for Theremore.  Thrall reluctantly battles Jaina, who is eventually talked down by Kalecgos.  Although Thrall is able to save Orgrimmar, his friendship with Jaina is severely damaged.\nIn Mists of Pandaria Thrall is informed of the attempt on Vol'jin's life by Garrosh and upon returning to Durotar, discovers that several of his own Kro'kron have turned on him in favor of the now despotic Garrosh.  Thrall subsequently joins Vol'jin's Darkspear Rebellion against Garrosh's rule.  During the Siege of Orgrimmar, Thrall ventures ahead of the Alliance forces and Horde rebels and confronts Garrosh directly in his throne room. Thrall expresses his disappointment in Garrosh's actions while Garrosh lambasts him for his pacifism and immobilizes Thrall with his dark shaman, preventing Thrall from summoning the elements for help.  Despite being empowered by the heart of the Old God Y'Shaarj, Garrosh is ultimately defeated by adventurers.  Thrall attempts to finish off Garrosh with the Doomhammer, but is prevented by Varian, who argues that Garrosh's fate isn't up for Thrall to decide as Garrosh is taken by Shado-Pan Lord Taran Zhu to Pandaria to stand trial for his war crimes.  When Vol'jin urges Thrall to return as Warchief, Thrall instead recommends Vol'jin, due to his leadership during the Siege.  With the approval of the other Horde leaders, Vol'jin succeeds Garrosh as Warchief.\nIn the novel War Crimes, Thrall attends Garrosh's trial in Pandaria.  Thrall is called as witness during the trial, where several of Thrall's memories are magically relayed through the court, including his appointment of Garrosh as Warchief and his subsequent regret of the decision.  Before a sentence could be reached, Garrosh is able to escape with the help of his remaining loyalists and the rogue Bronze dragon Kairoz, who summons several alternate versions of the Alliance and Horde leaders as a diversion, with Thrall facing an alternate version of himself who remained loyal to Blackmoore.  Jaina is mortally wounded during the skirmish and is healed by Thrall, Aggra and Prince Anduin Wrynn; Jaina and Thrall reconcile.\nIn World of Warcraft: Warlords of Draenor, Garrosh and his allies escape to an alternate version of Draenor 35 years before the present day, where they prevent the orcs from being corrupted by the Burning Legion and help form the Iron Horde.  When the Iron Horde invades Azeroth through the Dark Portal, Thrall dons his black armor along with his shaman robes and fights off the invasion and joins archmage Khadgar through the Dark Portal. On the alternate version of Draenor, Thrall leads the player character and Horde forces to Frostfire Ridge where he assists in the construction of the Horde Garrison and meets younger incarnations of his parents and family. Thrall helps fight against the Thunderlord clan and the Iron Horde and retakes Frostfire Ridge, but at the cost of his uncles, Ga'nar and Fenris, the latter having joined the Iron Horde. Thrall then aids Khadgar in retaking Shattrath City from the Iron Horde. When Horde and Alliance forces assault the Warsong clan in Nagrand, they battle against Garrosh, who by that time had become the Warsong's Warlord. Thrall intervenes as Garrosh is about to win the battle and challenges him to Mak'gora. Thrall and Garrosh duel at the Stones of Prophecy, the place where the two had originally met in Outland. As Garrosh gains an upper hand in the fight, Thrall uses his shamanistic powers to overpower Garrosh, violating the sacred rules of Mak'gora. Garrosh blames Thrall for who he has become, while Thrall says he had chosen his own destiny before killing Garrosh with a bolt of lightning.\nIn World of Warcraft: Legion, Thrall fights alongside the Horde forces on the Broken Shore against the Burning Legion. Thrall sustains heavy injuries before the Horde is overrun and forced to retreat, with Vol'jin being mortally wounded in the battle. After regrouping with the Earthen Ring at the Maelstrom, Thrall drops the Doomhammer into Deepholm when forces of the Legion attack the sanctuary. When Doomhammer is recovered, Thrall passes it down to the Farseer of the Earthen Ring, believing that the Farseer could now wield elemental powers that he never tapped into with the Doomhammer..  Since his duel with Garrosh, the Doomhammer felt like dead weight in his hands and the elements became silent to him; Thrall believed that Garrosh's death at his hands were the reason for his weakening powers while in reality, it was due to Thrall's guilt and internal struggle over Garrosh's actions as Warchief.\nIn  World of Warcraft: Battle for Azeroth, High Overlord Varok Saurfang travels to Thrall's home in Outland to persuade him to return to the Horde, and helps Thrall thwart some assassins who have been deployed by the new Warchief Sylvanas to assassinate Thrall.  Thrall dons Frostwolf clan furs and his new axe Dra'gora and joins Saurfang in his effort to oust Sylvanas from the Horde.  After rescuing Baine Bloodhoof from imprisonment, Thrall witnesses Saurfang publicly challenge Sylvanas to Mak'gora in front of the Horde and Alliance forces at Orgrimmar, lending him Dra'gora while Anduin lends his sword Shalamayne. Saurfang nearly gains the upper hand but Sylvanas resorts to using unknown dark magic to kill him; Saurfang's final words provokes her into denouncing the Horde, including her Forsaken, before abandoning the Horde altogether.  Thrall and Anduin carry Saurfang's body past Orgrimmar's gates and speak at his memorial service.  After the death of the Old God N'Zoth, Thrall and the Horde leaders enter a truce with the Alliance.  The vacant spot for Warchief is replaced with the Horde Council, with Thrall resuming his former role as leader of the orcs and representative for the Council.\nHeroes of the Storm\nThrall appears as a playable character in the crossover multiplayer video game Heroes of the Storm. His basic traits include a self-healing ability called \"Frostwolf Resilience\", and has access to abilities such as Chain Lightning, Sundering and Earthquake. Thrall has good crowd control abilities, but is not a very mobile unit and leaves himself vulnerable to attacks whenever he moves backwards while attacking the enemy.\nOther appearances\n.]]\nLike several Warcraft characters, Thrall features as a collectible card in the Warcraft spin-off game Hearthstone. He also appears in the World of Warcraft Trading Card Game as a collectible card.\nThrall appears as an infant in the 2016 Warcraft movie, which is an adaptation of the first Warcraft game and explores the story of Thrall's parents, Durotan and Draka. Duncan Jones, the director of the movie, revealed during a Twitter discussion that he intends to feature Thrall's origin story in a proposed sequel.\nThrall appears in an advertisement for United Airlines promoting Starlink Wi-Fi available on more than half of United's regional fleet alongside Peppa Pig, Bumblebee and Crash Bandicoot.\nReception\nThrall has received a mostly positive reception from players and video game journalists, and is recognized as one of the most important, popular and well known characters in the Warcraft universe. In a popularity poll organized by Joystiq with the premise of \"electing\" a prominent Warcraft character as the \"Supreme Leader of Azeroth\" in 2009, Thrall carried a lead throughout the voting process and ended the race with 55.3 percent of the vote, more than either of his Alliance counterparts combined. CNet staff said they like the character and that despite his \"brutal upbringing\", Thrall is open to foreign people or cultures, and that the world of Azeroth seems to be relatively peaceful when he is in charge. Regarding Thrall's return to the series as of Battle for Azeroth,  Mike Fahey from Kotaku commented that Thrall has effectively become \"Mel Gibson\" who is seemingly adjusted to a domesticated lifestyle, but emphasized that it is good to see the character's return. Both Wesley Yin-Poole from Eurogamer and Fraser Brown from PC Gamer welcomed Thrall's return to the series, though Brown noted that Thrall's role as leader of the Horde had already been previously explored.\nStaff writers for Know Your Lore generally have a very high regard for the character. Matthew Rossi called him the \"single most badass orc out there\" and the \"savior of the orcish people\" who reconnected his people with their original shamanistic beliefs and was willing to listen to Medivh. He noted that even as a player who favors the Alliance faction, he would still have a lot of respect for the character. His colleague Alex Ziebart summarized Thrall as \"the best possible leader for the Horde\" and that \"no one that even comes close to his ability to lead the Horde\", though noting that the character's naivety is his most notable flaw; he attempts to foster the old ways of the Horde while pushing them forward at the same time, and he is very trusting of his own people, to the point of putting the wrong people in power because they are a friend of his. Anne Stickney said \"Thrall has always been a fascinating character\" to her. She observed that Thrall has evolved from his original design in Lord of the Clans as a simple \"true hero\" with a tragic past, serving as a beacon of honor and integrity in an otherwise savage and violent society, into a deep character who has \"several intrinsic flaws\" that players could explore as they progress into the overarching narrative of World of Warcraft.\nOn the other hand, Stickney later provided a detailed criticism of Thrall's role in the rise, fall and death of Garrosh Hellscream, noting that Garrosh would never have the opportunity to cause the amount of death and strife as the warmongering leader of the Horde if Thrall did not fail in his judgment and appointed him as Warchief in the first place. She said that Thrall's biggest failure is his perceived unwillingness to accept responsibility for his mistakes, and that it should have an effect on Thrall's psyche in order to do the end of Garrosh's story arc justice. Stickney wondered whether Thrall's last words to Garrosh before the latter's death was to try and deflect what he had done, or whether he was just trying to justify his actions to himself. The character has also received some negative reception. Richard Cobbett from Rock, Paper, Shotgun said that Thrall's iteration in Warcraft Adventures is \"bland, inappropriately quippy, and just generally stock\", and noted that the game lack inspiration on how to make a tough character \"into a different kind of adventurer than the usual inventory-packing geek\". Ryan Gilliam from Polygon recalled that some World of Warcraft players began pejoratively referring to Thrall as \"Green Jesus\" in Cataclysm, where the character stepped down from the role of Warchief to focus his efforts on saving the planet from environmental calamity.\nThrall's depiction in other media has also received attention. Thrall's characterization in The Shattering as well as Twilight of the Aspects, is on an ongoing quest of self-discovery, has been singled out for praise by Stickney. Yannick LeJacq from Kotaku said he is a longtime Warcraft fan, and found it \"unnerving\" yet exciting to see a beloved character like Thrall being presented in a game with better graphical quality like Heroes of the Storm, though he expressed a wish to see Thrall and other classic Warcraft characters being represented again within an isometric environment in a new Warcraft real-time strategy game. Ron Amadeo from Ars Technica said he would have preferred if Thrall was featured as the central character of the first ever live-action Warcraft movie adaptation, instead of placing the 2016 movie's setting in the distant past of the series lore where virtually none of the modern fan favorite Warcraft characters were present. He noted that Blizzard's serious world building truly started with Warcraft III in 2002, when fan-favorite characters like Thrall were introduced. Fahey enjoyed Jones' take on series lore for the 2016 Warcraft film, even where it diverged from what he was familiar with, and looked forward to a sequel where an adult Thrall would be featured as the main character .\n}}\nExternal links\n*[https://heroesofthestorm.com/en-us/heroes/thrall/ Thrall on the official Heroes of the Storm website]"
    }
  ]
}