{
  "content": [
    {
      "type": "text",
      "text": "# Through the Looking Glass and What Walter Found There\n\n| production = 3X7506\n| writer = David Fury\n| director = Jon Cassar\n| guests =*Michael Kopsa as Captain Windmark\n*Zak Santiago as Cecil\n| season_article = Fringe season 5\n| episode_list = List of Fringe episodes\n| prev = An Origin Story\n| next = Five-Twenty-Ten\n}}\n\"Through the Looking Glass and What Walter Found There\" is the sixth episode of the fifth season of the Fox science-fiction/drama television series Fringe, and the 93rd episode overall.\nThe episode was written by David Fury and directed by Jon Cassar.\nPlot\nPeter (Joshua Jackson), after injecting the Observer implant in his own body, returns to Etta's safe-house to mourn her loss. Olivia (Anna Torv), worried about Peter becoming distant, finds him, and reminds him they should deal with Etta's loss together.\nMeanwhile, Walter (John Noble) continues to work at extracting video tapes from the ambered part of the lab. One tape directs him to an apartment building in Worcester, with one specific apartment being an entrance to a pocket universe he has created to hide this element of the plan to defeat the Observers. He decides to travel there alone, finding that the building and much of the surrounding area has been shelled by an Observer attack in the past. In the appropriate apartment, Walter follows instructions on the tape that let him enter the pocket universe where the normal rules of physics do not apply, with hallways running upside down or in vertical directions, as in a work of M.C. Escher. Walter tries to remember where to look, but while trying to come up with this, he encounters a man named Cecil (Zak Santiago) who happened into the pocket universe while taking shelter from the Observer bombing. Walter realizes that, to Cecil, only about 5 days have passed, but in reality he has been in the pocket universe for more than 20 years.\nPeter, Olivia, and Astrid (Jasika Nicole) discover the latest video tape — and Walter's absence. They are curious that the tape simply goes black after showing Walter crossing over. They travel together to Boston, and Peter and Olivia follow the tape's instructions to cross over, finding that in the pocket universe the tape now shows additional instructions directing the viewer to a specific room. They meet up with Walter and Cecil, Walter agonizing over forgetting what he left here. Peter realizes someone else helped Walter record the video in the past, who Walter identifies as \"Donald\", the man previously captured by the Observers as he tried to recover rocks from a mine (as seen in \"The Recordist\"). Continuing to review the tape, they find that in the past, Walter has recovered the young Observer-like boy (as seen in \"Inner Child\"), and used the pocket universe to stow the child away in the designated room. The group finds the room, but it is empty, save a radio that is fused to a certain frequency, something that Walter did not give the boy in the past. Walter fears that the Observers have found this pocket universe and have the child. Peter notes that only Walter and Donald appeared to know about this pocket universe.\nWalter's travel to Boston does not go unnoticed by the Observers and they take a contingent to the building. Some Observers enter the apartment, and incapacitate Astrid. The audience is shown how the Observers \"see\" the world, using computer-like vision that is tinted blue and devoid of most other colors. They are able to see the entrance to the pocket, which is invisible to humans. They cross over to the pocket universe, and fire upon the group, killing Cecil. The others manage to escape out of the pocket universe, with Peter navigating with ease, despite the confusing hallways. Once out, Peter implores Walter, Olivia, and Astrid to escape while he hangs back. When an Observer approaches, the implant in Peter's body increases his reflexes and strength to the point where he can counter the Observer's moves. While fighting, the Observer warns that Peter does not realize the effects the implant will have on him, and that it was a mistake to use the implant at all. Peter uses the implant's teleportation for the first time, teleporting behind the Observer and snapping his neck, killing him. He then teleports away to rejoin his group. Captain Windmark watches this from afar, while high on a building behind him, a stenciled picture of Etta urges the humans to \"Resist\".\nPeter arrives safely at the monorail with Walter and Olivia, without telling them how he escaped. Walter worries that he sees Cecil's death as an acceptable loss, an attitude that his former self used to have and worries that he is reverting to this colder personality, as a side-effect of having the previously removed portions of his brain restored (as occurred in \"Letters of Transit\"). Peter gently reassures him that he will not let that happen, as he holds Walter's hands between his. Olivia, seated further down the aisle, looks at them and smiles tenderly; Peter gives a slight smile then returns his attention to Walter. A few seconds later, he looks back up down the aisle and sees the world the way the Observers see it, machine-like and devoid of most colors. His eyes widen in surprise.\nProduction\n\"Through the Looking Glass and What Walter Found There\" was written by co-executive producer David Fury, while being directed by 24 vet Jon Cassar.\nCultural references\nThe title is a reference to Lewis Carroll's 1871 work Through the Looking Glass and What Alice Found There, better known by its shortened title Through the Looking-Glass. It also has many plot elements that draw on \"The Navidson Record\" from \"House of Leaves.,\" a modern classic popular horror/sci-fi novel such as the use of super-8 video and a maze in a parallel universe.\nReception\nRatings\n\"Through the Looking Glass and What Walter Found There\" first aired in the United States on November 9, 2012 on Fox. An estimated 2.47 million viewers watched the episode, and earned a ratings share of 0.9 among adults aged 18 to 49, to rank fourth in its timeslot. The episode slightly decreased in overall viewership from the previous episode.\nReviews\nIGN's Ramsey Isler enjoyed the installment, giving it an 8.3 out of 10. He commented, \"Fringe gave us a good episode that puts another important piece of the puzzle in place and brings back an old friend.\" Noel Murray of The A.V. Club found the episode enjoyable due to its strangeness, noting that it is a much quieter and less action-packed than previous episodes. He rated the episode a \"B+\" grade.\nReferences\nExternal links\n* [https://web.archive.org/web/20121109054846/http://www.fox.com/fringe/recaps/season-5/episode-6 \"Through the Looking Glass and What Walter Found There\"] at Fox.com\n*"
    }
  ]
}