{
  "content": [
    {
      "type": "text",
      "text": "# Thumb war\n\nA thumb war or thumb fight, also known as thumb wrestling, is a game played by two players in which the thumbs are used to simulate fighting. The objective of the game is to \"pin\" the opponent's thumb, often to a count of four. The San Francisco Chronicle called the game \"the miniature golf of martial sports.\"\nGameplay\nThe players face each other and each holds out their left hand or right hand in a \"thumbs up\", and they link hands such that each player's fingers curl around the other player's fingers. Players may not use any of the fingers except the thumb to pin down their opponent's thumb. Gameplay has several tactics such as \"playing possum\", aiming for the knuckle rather than the nail for a pin, going for a quick strike, and waiting for one's opponent to tire. Variations include making the thumbs \"bow\", \"kiss\", or both before warring, and to war with both hands at once; or sneak attacks, which involve using your pointer finger to take over the opponent. Players may also engage in the Rabbit Hole maneuver, or ducking their thumb down into their own palm, to escape imminent defeat. These additions are optional and do not need to be included into the rules of play.\nThe game is typically initiated with both the players uttering the rhyme \"One, two, three, four, I declare a thumb war\", passing their thumbs over each other in time with this rhyme. The rhyme is sometimes extended with “Five, six, seven, eight, who do we appreciate?” or \"Five, six, seven, eight, try to keep your thumb straight.\" or \"Five, six, seven, eight. Open up your thumb gate.\" A regional variation in Boston is \"five, six, seven, eight, open up the war gates.\" Another American variation is \"five, six, seven, eight, you are good, but I am great.\" In South America, the starting song is \"ésta es la pulseada china\", as in France, \"un, deux, trois, bras de fer chinois\" (\"this is the Chinese arm wrestling\"), with the same thumb dance as in English. In New Zealand, the rhyme goes, \"Pea-knuckle, pea-knuckle, one, two, three. I declare a war on thee.\" In Australia, the extended rhyme is \"five, six, seven, eight, no time for toilet break\", although \"coffee\" is sometimes used instead of \"toilet\". It is common to add a further extension of \"kiss, hug, fight!\", where \"kiss\" is pressing the pads of the thumbs together, \"hug\" is wrapping each player's thumb around the other's, and \"fight!\" is said emphatically.\nThere is an official Ladies and Mens World Thumb Wrestling Championships which is contested by thumb wrestlers from across the globe annually. There are official match-play rules, and bouts are contested inside a hand-crafted wooden thumb wrestling ring in a best-of-three-round format. Previous winners have come from United States of America, Ireland, Poland and the UK. Current 4 time Mens World Thumb Wrestling Champion Paul 'Under the Thumb' Browse is still undefeated and has won the 2016 2017 2018 and the 2019 World Thumb Wrestling Championships. His mother-in-law Janet 'Nanny-Thumb' Coleman is the current Ladies World Thumb Wrestling Champion. The World Championships were cancelled in 2020, 2021 and 2022 due to ongoing COVID-19 pandemic, however a 2023 Championship took place in Norwich in Norfolk, UK. The World Thumb Wrestling Championships superseded the British Thumb Wrestling Championships which was first held in Lowestoft, Suffolk, in 2010. Famous people to have competed in the World Thumb Wrestling Championships are Rory McGrath and Will Mellor as part of their show Rory and Will: Champions of the World.\nCompetitive matches of thumb wrestling have also been held on Long Island, and the 826 Valencia Foundation holds an annual thumb-wrestling competition, which has been won three times by San Francisco Chronicle book editor Oscar Villalon. There is no leaning nor tilting when thumb wrestling.\nHistory\nNorman Mailer was passionate about thumb wrestling. Author and humorist Paul Davidson claims that his grandfather Bernard Davidson invented the thumb war in the 1940s. American copywriter Julian Koenig claimed to have invented thumb wrestling in 1936 as a boy at Camp Greylock. In 2011, Rory Van Bellis founded and is the current Head of the World Thumb Wrestling Championships.\nA thumb wrestling ring is a toy used for thumb wrestling. The players insert their thumbs in opposite sides and proceed with the thumb war.\nNotable thumb war\nWhile campaigning for the 2019 Australian federal election, Opposition Leader Bill Shorten was challenged to a thumb war live on Darwin's Hot 100 radio station on the Danii & Jake Show.\nSee also\n*Rock-paper-scissors\n*Thumb twiddling\n*Arm wrestling\nReferences\nFurther reading\n*\n*\nExternal links\n*[http://www.thumbwrestling.co.uk/ UK Thumb Wrestling Championships]\n*[https://en.dusoyun.com/2playergames/thumb-war Flash Version]\n*[https://www.ndwathumbs.com ndwathumbs.com]"
    }
  ]
}