{
  "content": [
    {
      "type": "text",
      "text": "# Thurlaston, Warwickshire\n\n| civil_parish             = Thurlaston\n| population               = 379\n| population_ref           = (2021)\n| shire_district           = Rugby\n| shire_county             = Warwickshire\n| region                   = West Midlands\n| constituency_westminster = Kenilworth and Southam\n| post_town                = RUGBY\n| postcode_district        = CV23\n| postcode_area            = CV\n| dial_code                = 01788\n| os_grid_reference        = SP477710\n|static_image_name= Thurlaston Main Street looking north (2).jpg\n|static_image_caption=  Thurlaston Main Street\n}}\nThurlaston is a village and civil parish in the Rugby district of Warwickshire, England. According to the 2001 census the parish had a population of 352, increasing to 368 at the 2011 census, and again to 379 at the 2021 census.\nOverview\nThurlaston was mentioned in the Domesday Book as Torlavestone. The village is located around  south-west of Rugby, and around  west of the larger village of Dunchurch. Immediately to the north of the village is the M45 motorway. There is only one dead end road into Thurlaston from the north, connecting the village with the B4429, via a bridge over the M45 motorway. Thurlaston overlooks the Draycote Water reservoir to the south, and is close to the county border with Northamptonshire, less than 2 miles to the east.\nNotable buildings\nThe village church of St. Edmund is a red brick building dating from 1849 designed by William Butterfield. It is unusual in that it was designed to serve as both a church and a school with a schoolmaster's house attached, it is now grade II listed. The most famous building, however, is probably the old 18th century windmill which is now used as a private house, this is also grade II listed.\nFile:Thurlaston - panoramio (8).jpg|Old windmill at Thurlaston, now a house\nFile:Saint Edmund's Church, Thurlaston.jpg|St Edmund's Church\nReferences\nExternal links\n*[http://www.thurlaston-pc.gov.uk/ Thurlaston Parish Council website]\n*[https://www.ourwarwickshire.org.uk/content/location/thurlaston Thurlaston] - page on Our Warwickshire"
    }
  ]
}