{
  "content": [
    {
      "type": "text",
      "text": "# Ticking time bomb scenario\n\nThe ticking time bomb scenario is a thought experiment that has been used in the ethics debate over whether interrogational torture can ever be justified. The scenario can be formulated as follows:\nSuppose that a person with knowledge of an imminent terrorist attack that will kill many people is in the hands of the authorities, and he will disclose the information needed to prevent the attack only if he is tortured. Should he be tortured?\nIt is usually planted as the assumption of a ticking time bomb that still has not exploded but will happen in a short period of time. If the terrorist who placed it is detained and is forced through torture to tell where he placed it, the bomb could be deactivated, thus saving many lives.\nSome consequentialists argue that nations, even those that legally disallow torture, can justify its use if they have a terrorist in custody who possesses critical knowledge, such as the location of a time bomb or a weapon of mass destruction that will soon explode and kill many people.\nOpponents to the argument usually begin by exposing certain assumptions that tend to be hidden by initial presentations of the scenario and tend to obscure the true costs of permitting torture in \"real-life\" scenarios—e.g., the assumption that the person is in fact a terrorist, whereas in real life there usually remains uncertainty about whether the person is in fact a terrorist and if they have useful information—and rely on legal, philosophical/moral, and empirical grounds to reaffirm the need for the absolute prohibition of torture. There is also uncertainty about the efficacy of interrogational torture, and much opposition to torture is based on the fact it is not effective rather than any moral issue, as well as how the decision to apply (or even allow) torture, whether or not an official process exists for doing so, might figure in the game theoretical payoff matrix of the hypothetical terrorist, or the problem framers.\nThe ticking time bomb scenario is extremely rare in real life, but it is often cited as a reason for using torture.\nBackground\nPhilosopher Jeremy Bentham has been regarded as the \"father\" of the ticking time bomb argument. He wrote in his 1804 essay Means of extraction for extraordinary occasions:\na suspicion that at this very time a considerable number of individuals are actually suffering, by illegal violence inflictions equal in intensity to those which if inflicted by the hand of justice, would universally be spoken of under the name of torture. For the purpose of rescuing from torture these hundred innocents, should any scruple be made of applying equal or superior torture, to extract the requisite information from the mouth of one criminal, who having it in his power to make known the place where at this time the enormity was practicing or about to be practiced, should refuse to do so?}}\nThe concept was popularized in the 1960s in the novel Les Centurions by Jean Lartéguy which is set during the Algerian war. The version in the novel has the following conditions:\n# The evidence in support of the contention that he has the relevant information would satisfy the requirements of evidence for convicting him of an offence.\n# There are reasonable grounds for believing that he is likely to tell the truth if severe torture is threatened, and, if necessary, applied to him.\n# There are reasonable grounds for believing that no other means would have the effect of compelling him to tell the truth.\n# There are grounds for believing that if the information is obtained quickly, there is a good chance of defusing the bomb before it goes off.\n# There are reasonable grounds for believing that the likely damage to be caused by the bomb will include death of many citizens, the maiming of others, including the infliction of much more severe pain on others with much more lasting effect than will be the effect of the infliction of torture on the person who has been captured;\n# There are reasonable grounds for believing that the torturing will not have consequences which would be worse than the damage likely to result from the bomb going off.\nIn the novel, the hardened terrorist quickly folds under torture and reveals the location of the bombs. According to Darius Rejali, a professor of political science at Reed College, the possibility of sudden, massive destruction of innocent life provided French liberals with a more acceptable justification for committing torture.\nViews in favor of accepting torture in emergencies\nAfter the September 11 attacks, Alan Dershowitz, a prominent American defense attorney, surprised some observers by giving limited support to the idea that torture could be justified. He argued that human nature can lead to unregulated abuse \"off the books\". Therefore, it would be better if there were a regulated procedure through which an interrogator could request a \"torture warrant\" and that requiring a warrant would establish a paper trail of accountability. Torturers, and those who authorize torture, could be held to account for excesses. Dershowitz's suggested torture warrants, similar to search warrants, arrest warrants and phone tap warrants, would spell out the limits on the techniques that interrogators may use, and the extent to which they may abridge a suspect's rights.\nIn September 2002, when reviewing Alan Dershowitz's book, Why Terrorism Works: Understanding the Threat, Responding to the Challenge, Richard Posner, legal scholar and judge of the United States Court of Appeals for the Seventh Circuit, wrote in The New Republic, \"If torture is the only means of obtaining the information necessary to prevent the detonation of a nuclear bomb in Times Square, torture should be usedand will be usedto obtain the information.... No one who doubts that this is the case should be in a position of responsibility.\"\nViews rejecting torture under all circumstances\nSome human rights organizations, professional and academic experts, and military and intelligence leaders have absolutely rejected the idea that torture is ever legal or acceptable, even in a so-called ticking bomb situation.}}\nThe United Nations Convention against Torture and Other Cruel, Inhuman or Degrading Treatment or Punishment, which was adopted on December 10, 1984, and entered into force on June 26, 1987, explicitly states in Article 2.2 that:\n}}\nImplausibility\nCritics of the thought experiment scenario maintain that it is essentially implausible, based on simultaneous presence of numerous unlikely factors. This is particularly acute in fictional exploration of the scenario.\nFor example, in perhaps the most common variants on the scenario, one must assume that torturers know, with a reasonable degree of certainty that some form of deadly attack is imminent, but lack a crucial component of that plan, such as its precise location.  They must also have in their custody someone who they are reasonably certain has said information and would talk under torture or threat of torture.  They must then be able to accurately distinguish between true and false information which the subject may supply under torture.  They must then be able to use this information to form a plan of response which is effective at stopping the planned attack.  All of this must occur within a limited time frame allowed by the \"ticking bomb\".\nNo less importantly, there exists no historical case that satisfies all or even most of the conditions for a ticking time bomb.\nEffect of fiction\nWorks of fiction, such as the television series 24, often rely on ticking time bomb scenarios for dramatic effect. According to the Parents Television Council, given that each season represents a 24-hour period, Jack Bauer encounters someone who needs torturing to reveal a ticking bomb on average 12 times per day.\nMichael Chertoff, the Secretary of Homeland Security under the George W. Bush administration, declared that 24 \"reflects real life.\" John Yoo, the former Justice Department lawyer who produced the torture memos cited Bauer in support, while Supreme Court Justice Antonin Scalia went further, arguing \"Jack Bauer saved Los Angeles... He saved hundreds of thousands of lives. Are you going to convict Jack Bauer?\". In contrast, one of the show's creators has stated:\nThe show uses the same techniques that are used by the U.S. against terrorist suspects during the War on Terror. U.S. Army Brigadier General Patrick Finnegan, the dean of the United States Military Academy at West Point, and others, objected to the central theme of the show—that the letter of American law must be sacrificed for the country’s security—as it had an adverse effect on the training of actual American soldiers by advocating unethical and illegal behavior. As Finnegan said:\nHe continued,\nThe \"ticking time bomb scenario\" is subject of the drama The Dershowitz Protocol by Canadian author Robert Fothergill. In that play, the American government has established a protocol of \"intensified interrogation\" for terrorist suspects which requires participation of the FBI, CIA and the Department of Justice. The drama deals with the psychological pressure and the tense triangle of competences under the overriding importance that each participant has to negotiate the actions with his conscience.\nSee also\n*Ethics of torture\n*Murder of Jakob von Metzler\n*Slippery slope#Domino fallacy\n*False dilemma\n*Principle of double effect\n*Psychology of torture\n*Trolley problem\nIn fiction\n*Dirty Harry\n*The Siege\n*24\n*Unthinkable\n*Call of Duty: Black Ops\n*The 100\n*American Dad\nNotes\nReferences\n*\n*\n*\n*\nExternal links\n*\n*\n*\n*\n*\n*\n*"
    }
  ]
}