{
  "content": [
    {
      "type": "text",
      "text": "# Tides of War\n\n)]]\nTides of War is a 2000 novel by Steven Pressfield, chronicling the Peloponnesian War.\nPlot summary\nJason, a disciple of Socrates, is asked to help defend Polemides, infamous in Athens as the man who assassinated Alcibiades. Predisposed to despise Polemides for his actions, Jason is taken by the man's graciousness, his open admission of his crimes, and the parallels between his and Jason's service in the war.\nAged nineteen at the outbreak of the war (431 BC), Polemides enlists in the Athenian army sent to hasten the end of the siege of Potidaea. Alcibiades, also a common infantryman, makes an early name for himself with a bold action that saves the relief force from an ambush by the Corinthians.\nThrough the course of his career as a mercenary, Polemidas comes into contact with most of the pivotal figures of the era, including Socrates, the statesmen-general Pericles and the politician Nicias, and Spartan general Lysander. Polemidas describes his travels: his upbringing in Sparta and his family estate outside Athens, his time in Athens during the Plague, the mutilation of the sacred hermai in Athens on the eve of the Sicilian Expedition, sailing with the Athenian marines during the disastrous expedition, and Athens' eventual defeat at the battle of Aegospotami.\nHowever, it was the character of Alcibiades who loomed most large over the narrative, just as he had the greatest impact on the Peloponnesian War. Undefeated during his career as a general and admiral, Alcibiades’ life played itself out like an epic tragedy with the tensions between his genius and the hubris that was his ultimate downfall.\nThe political shifts that occurred during the war, manifesting through partisan public opinion, act almost to make Athens herself a character in the novel.\nWhile most of the dialogue is Pressfield's own creation, for long speeches and character development he used many ancient sources, particularly adapting quotes appearing in Thucydides in the History of the Peloponnesian War and to a lesser extent several of the Socratic Dialogues of Plato.\nReception\nKirkus Reviews calls it \"Unabashedly brilliant, epic, intelligent, and moving.\"\nContinuity\nOne of the secondary characters of the novel, the mercenary Telamon of Arcadia, shares his name and place of origin with the protagonist of Pressfield's 2021 novel A Man at Arms, though they are clearly different characters, since the later novel takes place in AD 55, four centuries later.\nReferences"
    }
  ]
}