{
  "content": [
    {
      "type": "text",
      "text": "# Tiger King\n\nThe Lion King}}\n| image              = Tiger King, Murder, Mayhem and Madness publicity image.jpg\n| caption            = Promotional poster for the first season\n| image_size         = 200\n| genre              = True crimeDocumentary\n| director           = Eric GoodeRebecca Chaiklin\n| presenter          = Joel McHale (2020 Special)\n| starring           =\n| country            = United States\n| num_seasons        = 3\n| num_episodes       = 15 (+1 special)\n| list_episodes      =\n| company            =\n| composer           =\n| executive_producer =\n| cinematography     = Damien Drake\n| editor             =\n| language           = English\n| runtime            = 41–48 minutes\n| network            = Netflix\n| first_aired        =\n| last_aired         =\n}}\nTiger King (subtitled in marketing as Tiger King: Murder, Mayhem, and Madness for its first season, Tiger King 2 for its second season and Tiger King: The Doc Antle Story for its third season) is an American true crime documentary television series about the life of former zookeeper and convicted felon Joe Exotic. The first season was released on Netflix on March 20, 2020. A second season, Tiger King 2, was announced in September 2021 and was released on November 17, 2021, while a third season, Tiger King: The Doc Antle Story, was announced on December 3, 2021, and released one week later on December 12. The series focuses on the small but deeply interconnected society of big cat conservationists such as Carole Baskin, owner of Big Cat Rescue, and collectors such as Exotic, whom Baskin accuses of abusing and exploiting wild animals.\nSeason 1 received positive reviews from critics, and according to Nielsen ratings, was watched by 34.3&nbsp;million people over its first ten days of release, ranking as one of Netflix's most successful releases to date, partly due to its release amid the early months of the COVID-19 pandemic, and also inspired several memes online. Despite its success and popularity, the season received criticism from conservation and animal rights groups for its framing and inaccuracies related to private breeding and wildlife conservation issues. A special aftershow hosted by Joel McHale was released on April 12, 2020, with McHale interviewing several of its subjects about Exotic and the series itself. The second and third seasons in contrast received mostly negative reviews from fans and critics, and the former was subject of a lawsuit by Carole and Howard Baskin over footage used in the series.\nSummary\nThe series explores the deeply interconnected community of big cat conservationists and collectors in America, and the private zoos and animal sanctuaries they have set up for the care and public display of these animals.\nThe series' primary subject in the first season is \"Tiger King\" Joe Exotic, the eccentric owner of the G.W. Zoo in Wynnewood, Oklahoma, and follows his bitter years-long feud with Carole Baskin, CEO of Big Cat Rescue in Tampa, Florida. The season later records the events leading up to Exotic's conviction under federal murder-for-hire statutes, when it comes to light that he paid a hitman to murder Baskin; his convictions also included violations of the Lacey Act and Endangered Species Act, and resulted in a 22-year federal prison sentence.\nThe second season covers the immediate aftermath of Exotic's imprisonment, as well as exploring further theories surrounding the disappearance of Don Lewis. It also explores the downfall of big cat collectors Tim Stark and Jeff Lowe. The ending of the season features a tribute to Erik Cowie, an employee at the G.W. Zoo who died in September 2021.\nThe series' primary subject in the third season is Mahamayavi Bhagavan \"Doc\" Antle, a rival of Exotic's and Baskin's, exploring his cult of employment.\nCast\n{| class=\"wikitable plainrowheaders\" style=\"width:55%;\"\n|+Tiger King Cast Members\n|-\n! rowspan=\"2” style=\"width:20%;\" | Cast member\n! colspan=\"5\" | Seasons\n|-\n! style=\"width:10%;\" | 1\n! style=\"width:10%;\" | 2\n! style=\"width:10%;\" | 3: The Doc Antle Story\n|-\n| John Reinke\n| colspan=\"2\"\n| colspan=\"1\"\n|-\n| Kelci Saffery\n| colspan=\"2\"\n| colspan=\"1\"\n|-\n| Joe Exotic\n| colspan=\"2\"\n| colspan=\"1\"\n|-\n| Doc Antle\n| colspan=\"1\"\n| colspan=\"1\"\n| colspan=\"1\"\n|-\n| Carole Baskin\n| colspan=\"2\"\n| colspan=\"2\"\n|-\n| Donna Pettis\n| colspan=\"1\"\n| colspan=\"1\"\n| colspan=\"1\"\n|-\n| Zuzana & Scott Kukol\n| colspan=\"1\"\n| colspan=\"1\"\n| colspan=\"1\"\n|-\n| Kristi Reinke\n| colspan=\"1\"\n| colspan=\"1\"\n| colspan= \"1\"\n|-\n! colspan=\"5\"| Friends of Tiger King\n|-\n| nowrap| Allen Glover\n| colspan=\"1\"\n| colspan=\"1\"\n| colspan= \"1\"\n|-\n| Lauren L.\n| colspan=\"2\"\n| colspan= \"1\"\n|-\n|}\nEpisodes\nSeries overview\n| color1S     = #FAA718\n| link1S      = #Special (2020)\n| linkT1S     = Special: The Tiger King and I\n| released1S  =\n| color2      = #B11010\n| link2       = #Season 2 (2021)\n| auxA2       = Tiger King 2\n| episodes2   = 5\n| released2   =\n| color3      = #FF6543\n| link3       = #Season 3 (2021)\n| auxA3       = The Doc Antle Story\n| episodes3   = 3\n| released3   =\n}}\nSeason 1: Murder, Mayhem, and Madness (2020)\n| ShortSummary    =\n| LineColor       = 000000\n}}\n| ShortSummary    =\n| LineColor       = 000000\n}}\n| ShortSummary    =\n| LineColor       = 000000\n}}\n| ShortSummary    =\n| LineColor       = 000000\n}}\n| ShortSummary    =\n| LineColor       = 000000\n}}\n| ShortSummary    =\n| LineColor       = 000000\n}}\n| ShortSummary    =\n| LineColor       = 000000\n}}\n}}\nSpecial: The Tiger King and I (2020)\n| LineColor       = FAA718\n}}\n}}\nSeason 2: Tiger King 2 (2021)\n| LineColor       = B11010\n}}\n| LineColor       = B11010\n}}\n| LineColor       = B11010\n}}\n| LineColor       = B11010\n}}\n| LineColor       = B11010\n}}\n}}\nSeason 3: The Doc Antle Story (2021)\n| LineColor       = FF6543\n}}\n| LineColor       = FF6543\n}}\n| LineColor       = FF6543\n}}\n}}\nSubjects\n{|\nJoe Exotic's team\n* Joe Exotic – Founder of G.W. Zoo\n* John Finlay – Joe's boyfriend\n* John Reinke – Manager at G.W. Zoo\n* Kelci \"Saff\" Saffery – Zookeeper at G.W. Zoo\n* Erik Cowie – Zookeeper at G.W. Zoo\n* Rick Kirkham – TV producer at JoeExoticTV\n* Travis Maldonado – Straight ex-husband of Joe\n* Joshua Dial – Joe's campaign leader\n* Dillon Passage – husband (later ex-husband) of Joe\n* JP Wilson – Magician who performed with Joe\n* Brian Rhyne – Romantic partner of Joe\nOther subjects featured\n* Carole Baskin – CEO at Big Cat Rescue\n* Doc Antle – Director of The Institute for Greatly Endangered and Rare Species (T.I.G.E.R.S.)\n* Barbara Fisher – Former employee at T.I.G.E.R.S.\n* Mario Tabraue – Zoo owner and former drug trafficker\n* Howard Baskin – Husband of Carole\n* Don Lewis - Ex-husband of Carole who has been missing since 1997\n* Jeff Lowe – Second and final owner of G.W. Zoo\n* Lauren Lowe – Wife of Jeff\n* Allen Glover – Hired as hitman in Carole Baskin murder-for-hire plot\n* James Garretson – Investor in G.W. Zoo\n* Tim Stark – Founder of Wildlife in Need\n* Donald Trump – 45th President of the United States\n* Joel McHale – Host of after-show\n|}\nReception\nCritical response\nSeason 1\nOn review aggregator Rotten Tomatoes, the first series holds an approval rating of 89% based on 75 reviews, with an average rating of 7.88/10. The site's critics consensus reads: \"A bizarre true crime story you have to see to believe, Tiger King is a messy and captivating portrait of obsession gone terribly wrong.\" On Metacritic, which assigns a weighted average score to reviews from mainstream publications, the series has an average score of 75 out of 100, based on 13 critics, indicating \"generally favorable reviews\".\nVariety magazine's Caroline Framke called the season \"messy yet compelling\" and that for \"those who love Netflix's particular flavor of true crime and docuseries, [...] Tiger King will undoubtedly scratch a particular itch.\" Joshua Rivera at The Verge said that \"[e]very minute of Tiger King yields some new surprise, an unbelievable turn or charismatic stranger with incredible stories to tell.\"\nAlthough the season had a positive reception overall, the special aftershow hosted by McHale received criticism.\nSeason 2\nThe second series received mostly negative reviews, holding an approval rating of 19% on Rotten Tomatoes based on 21 reviews, with an average rating of 4.10/10. The site's critics consensus reads: \"With nothing substantive to add save for a salacious celebration of its first season's success, this kitty has no claws.\"\nKristen Lopez of IndieWire said that second series has a story that \"feels like it's being made up in the moment\" and that \"Netflix's second season of Tiger King feels like a blatant grab for cash\". Brian Lowry of CNN also criticized the second series for failing to move the story on from the first series, saying: \"Adding relatively little to the story, and jumping all over the place, the project is mostly defined by how self-referential it is.\" In a review in The Times, Liam Fay noted the season suffered from the lack of participation from Carole Baskin, saying that \"her contributions are taken from her YouTube channel, an eerily stilted production in which she reads her diaries directly to camera\", and: \"Almost every theory ever concocted about Lewis's fate is explored at length. In the end we're none the wiser, a familiar aftertaste throughout the season.\"\nSeason 3\nTiger King: The Doc Antle Story holds an approval rating of 0% on Rotten Tomatoes based on 5 reviews. Jordan Moreau of Variety wrote that \"despite its serious subject matter, 'The Doc Antle Story' can't match the inherent, attention-grabbing, plot-twisty nature of the first .\"\nAudience viewership\nAccording to Nielsen, the first season was watched by 34.3&nbsp;million people over its first 10 days of release, ranking as one of Netflix's most successful releases to date. It has been suggested that its viewership success was aided by the COVID-19 pandemic, which caused many global viewers to be restricted to their homes around the time of its release. At their Q2 report meeting in July 2020, Netflix reported the first season had been viewed by 64 million households over its first month of release.\nPolitical reception\nAt an April press conference regarding COVID-19, then-U.S. President Donald Trump was questioned about the possibility of pardoning the series' key subject, Joe Exotic. Trump said he was unaware of him and the series but told the reporter that he'd \"take a look\". In January 2021, prior to the inauguration of Joe Biden, Trump pardoned several different people, but Exotic was not one of them. Exotic tweeted that he was \"too innocent and too gay\" to receive a pardon from Trump.\nCriticism for depiction of conservation issues\nAnimal welfare groups, conservation organizations and wildlife biologists have criticized the series and its filmmakers.\nSeveral conservation and animal rights groups criticized the filmmakers for framing private big cat breeding as a legitimate form of conservation. Representatives from Wildlife Conservation Society, World Wide Fund for Nature, Panthera Corporation and National Geographic criticized the show for its equivocation of the unregulated private breeding with captive breeding for species reintroduction, highlighting that the latter is strictly controlled by the Species Survival Plan and only takes place in zoos accredited by the Association of Zoos and Aquariums. Privately bred cats cannot be reintroduced to the wild as several of the private breeders interviewed suggested, as they would be unlikely to survive in the wild, and are likely hybrids which could cause genetic pollution.\nThe filmmakers were also criticized for implying that roadside zoo operations are as legitimate as accredited zoos, and Big Cat Rescue specifically. The first season and director singled out Big Cat Rescue's enclosures as small or not meeting ethical standards, but their facilities meet humane standards set out by Global Federation of Animal Sanctuaries, unlike those of the featured private breeders' zoos. Elle noted that Baskin was portrayed as hypocritical for keeping the tigers in captivity instead of releasing them, without explaining that doing so was not an option—being captive-bred from mixed stock, as well as in-effect domesticated, meant they were unsuited to either survive in the wild or rebuild regional populations. Michael Webber, director of The Elephant in the Living Room, also criticized the parallels drawn between the private zoos and Big Cat Rescue. The first season was also accused of minimizing Baskin's efforts to lobby Congress for stricter legislation on animal trafficking.\n\"Goode brings to Tiger King the intellectual rigor and social responsibility of ... a nightclub and hotel developer\", Peter Frick-Wright, who had produced Cat People, a podcast series covering the American big-cat industry, wrote in Outside. He found the first season particularly unfair to Baskin, pointing out that in focusing on her husband's disappearance so much it failed to distinguish her from Exotic and Antle, barely mentioning that Big Cat Rescue only accepts tigers confiscated by law enforcement or from owners who could no longer handle them—owners who had to sign a contract with heavy financial penalties if they owned another big cat or were even photographed with one, a provision not mentioned in the first season. Baskin also forbids volunteers or staff from touching the animals; they are fired for doing so, Frick-Wright wrote.\nOthers criticized the sympathetic portrayal of Joe Exotic. The director of Animals Asia Foundation expressed disappointment that the Netflix series \"does not fully condemn many of the activities that [Exotic] was involved with\" and criticized the filmmakers for downplaying the animal cruelty and commercial purposes of Exotic's zoo. Conversely, Baskin is the only source in the first season from the conservation sector, and the only source explaining why keeping the wild animals was abusive, but is depicted in an unsympathetic light.\nSome criticism noted the lack of clear environmental or conservation message. An article in The New York Times drew parallels with other recent wildlife films like Blackfish, which had a major impact on their subject matter. Blackfish led to a severe drop in ticket sales at SeaWorld and reduced support for cetaceans in captivity, eventually leading to changes in legislation and practices. The producer of Blackfish criticized Tiger King, saying that issues surrounding big cats were \"lost in the show's 'soap opera-esque drama'\". Karl Ammann, a photographer and documentarian specializing in the illegal wildlife trade who was approached to be interviewed by the filmmakers of Tiger King, similarly expressed disappointment at the lack of conservation message in the first season, saying \"to totally ignore such key aspects was a real missed opportunity\".\nPETA and the Humane Society of the United States, both of which had previously investigated and campaigned against the animal abuse of Exotic and other private breeders featured in the show, responded more positively to Tiger King for raising the profile of the issue of big cats in captivity. However, PETA noted the first season \"largely skips over serious issues of animal welfare, including the horrors of cub trafficking and the problems with commercial cub-petting attractions\".\nAwards and nominations\n{| class=\"wikitable sortable\"\n|-\n! Year\n! Award\n! Category\n! Nominee(s)\n! Result\n!\n|-\n| rowspan=\"6\" style=\"text-align:center;\" | 2020\n| rowspan=\"6\"| Primetime Emmy Awards\n| Outstanding Documentary or Nonfiction Series\n| Chris Smith, Fisher Stevens, Eric Goode and Rebecca Chaiklin\n|\n| align=\"center\" rowspan=\"6\"|\n|-\n| Outstanding Directing for a Documentary/Nonfiction Program\n| Eric Goode and Rebecca Chaiklin (for \"Cult of Personality\")\n|\n|-\n| Outstanding Music Composition for a Documentary Series or Special (Original Dramatic Score)\n| Mark Mothersbaugh, John Enroth and Albert Fox (for \"Not Your Average Joe\")\n|\n|-\n| Outstanding Picture Editing for Nonfiction Programming\n| Doug Abel, Nicholas Biagetti, Dylan Hansen-Fliedner, Geoffrey Richman and Daniel Kohler (for \"Cult of Personality\")\n|\n|-\n| Outstanding Sound Editing for a Nonfiction or Reality Program (Single or Multi-Camera)\n| Ian Cymore, Rachel Wardell and Steve Griffen (for \"Cult of Personality\")\n|\n|-\n| Outstanding Sound Mixing for a Nonfiction or Reality Program (Single or Multi-Camera)\n| Jose Araujo, Royce Sharp, Jack Neu and Ian Cymore (for \"The Noble Thing to Do\")\n|\n|-\n| rowspan=\"3\" style=\"text-align:center;\" | 2021\n| Hollywood Music in Media Awards\n| Best Original Score in a Documentary TV Series\n| Mark Mothersbaugh, John Enroth, Albert Fox and Robert Mothersbaugh\n|\n| align=\"center\"|\n|-\n| MTV Movie & TV Awards\n| Best Real-Life Mystery or Crime Series\n| Tiger King\n|\n| align=\"center\"|\n|-\n| Producers Guild of America Awards\n| Outstanding Producer of Non-Fiction Television\n| Chris Smith, Fisher Stevens, Eric Goode and Rebecca Chaiklin\n|\n| align=\"center\"|\n|}\nResponse from those depicted\ns. He has expressed regret for his past actions.]]\nJoe Exotic\nJoe Exotic is the main focus of the series, with the documentary causing him to receive significant amounts of attention on social media. Ironically, despite the first season being responsible for his worldwide fame and fanbase, he has not watched the series himself, due to being arrested prior to its release. Nevertheless, Netflix interviewed Exotic in jail, asking what he thinks of both the first season and his newfound fame. Exotic stated that he loved the fame, but wished he could experience it firsthand. He also expressed remorse for his actions after being in jail, stating to his fans;\nExotic added that he's \"done with the Carole Baskin saga.\" In 2021, he began criticising some of the other people featured in the documentary, stating that \"not one person came forward until the Netflix series came out and they could profit from it.\"  Joe claims to not have profited at all from the series.  In the show's final arc, Joe is out of work and destitute, and law enforcement's noose finally closes in on him.\nAs a result of the unilateral seizure of his zoo and other assets, Joe has authorized the creation of a cryptocurrency by the name of Tiger King Coin, to raise a fighting fund to finance the efforts of a dedicated legal team, led by John M Phillips, to overturn his conviction, which has been progressing since July 2021.\nCarole Baskin\nfor her speculated involvement in the disappearance of Don Lewis, her second husband.]]\nCarole Baskin and her husband Howard felt betrayed by filmmakers, stating she was told the discussion of Joe Exotic and Baskin's missing ex-husband were just for context.\nIn a post on the Big Cat Rescue website, Baskin said that the show \"has a segment [in the third episode] devoted to suggesting, with lies and innuendos from people who are not credible, that I had a role in the disappearance of my husband Don 21 years ago\" and that the first season \"presents this without any regard for the truth\". Baskin has never been charged with anything related to Don's disappearance and has always denied having anything to do with it. In partial response to Baskin, director Goode stated while he felt Baskin had the right intention, he questioned if \"it was fair to keep these tigers in cages\", adding that the tigers \"pace neurotically\" and that \"Sometimes you wonder whether or not one should humanely euthanize these cats instead of [letting them] suffer in cages\". Baskin preemptively answered that \"... our goal is to end having them in cages and have no need for a sanctuary like ours. Our federal bill, the Big Cat Public Safety Act, would stop the cub petting that drives the breeding and end ownership as pets in back yards.\" In addition, Goode and Chaiklin insisted that Baskin \"wasn't coerced\" into answering questions about her former husband.\nIn February 2021, Baskin revealed that she had been asked to be interviewed for the second season of the show, but she refused and told the producers to \"lose her number\".\nOn November 1, 2021, Baskin and her husband Howard filed a lawsuit against Netflix and Royal Goode Productions over an alleged breach of contract. They claim that their initial release did not grant the producers liberty to produce derivative works or sequels using the original footage shot of Carol and Howard. The lawsuit requested an injunction to stop the release of the series on November 17. On November 5, a federal judge denied Baskin's motion for a temporary restraining order that would block Netflix and Royal Goode Productions from using footage of her, her husband, and their Big Cat Rescue sanctuary in Season 2 of Tiger King. The judge ruled that the Baskins \"are not entitled to the extraordinary remedy of a temporary restraining order, which would be entered before Defendants have had an adequate opportunity to respond.\" The judge further added that the case would not necessarily entitle the Baskins to financial compensation. The Federal Court in Tampa Bay also denied a preliminary injunction on November 15, 2021, just two days before the shows' premiere, after defense attorneys for Netflix said a delay would \"hurt marketing momentum\" and violate the First Amendment, which in this case would fall under freedom of the press.\nDoc Antle\nDoc Antle was disappointed with his portrayal in the first season, calling it a 'train wreck of entertainment' and \"salacious.\" Antle said in an interview that he was not told that the first season would be about the bitter feud between Baskin and Exotic, and said that he would've preferred to be \"left out of it\";\nKelci \"Saff\" Saffery\nFollowing the release of the Netflix series, Robert Moor, the creator of an earlier podcast about Joe Exotic, posted a tweet stating \"Saff, the person who got mauled by the tiger, told me repeatedly that he is trans, prefers to be called Saff, and uses he/him pronouns. So please do likewise.\" Media outlets criticized the series for misgendering and deadnaming Saffery by his birth name.  LGBTQ Nation contrasted Netflix's treatment of Saffery with their recent collaboration with GLAAD, an LGBTQ media watchdog group, on a campaign raising \"transgender visibility in the entertainment industry\". Saffery clarified to Esquire,  Regarding whether he identified as a trans man, Saffery stated to Out magazine, \"No, I, I can honestly say no. I don't know that that describes me. You know, nothing was done. I really just have lived this lifestyle. And, you know, my family knows this. And obviously, people closest to me know. This is how I've lived my entire life. I don't know anything else.\"\nSubsequent media\nOn April 8, 2020, Deadline Hollywood reported that Ryan Murphy is in talks to produce a film or limited series for Netflix with Rob Lowe starring as Joe Exotic.\nOn April 14, 2020, TMZ released the special Tiger King: What Really Went Down?, which featured footage unseen in the first season of Tiger King.\nOn May 4, 2020, Variety reported that Nicolas Cage had been cast to portray Exotic in an eight-episode television series based on a Texas Monthly article about Exotic. The series is produced by Imagine Entertainment and CBS Television Studios, and Dan Lagana will serve as writer, showrunner, and executive producer. In September 2020, it was announced that the series had officially been picked up for development at Amazon Prime Video. In July 2021, it was announced that Amazon had shelved the project.\nA limited series titled Joe Exotic: Tigers, Lies and Cover-Up premiered on September 27, 2020, on Investigation Discovery. A TV special titled Joe Exotic: Before He Was King premiered on September 28, 2020.\nTiger Queens: The Tiger King Musical was a Netflix musical based on Tiger King, which debuted on TikTok on March 28, 2021. The production featured former ''RuPaul's Drag Race contestants Kim Chi, Willam, and Heidi N Closet portraying Baskin, Joe Exotic, and a tiger, respectively.\nOn April 5, 2021, British documentary filmmaker Louis Theroux released a new documentary on Exotic, titled Shooting Joe Exotic, on BBC Two in the United Kingdom. The documentary contained unseen footage of Exotic from a previous documentary by Theroux, America's Most Dangerous Pets'' (2011), as well as new interviews of other people associated with Exotic, including Exotic's legal team, his estranged brother and niece, and the Baskins.\nA limited series adaptation headed by Universal Content Productions, is based on a podcast Joe Exotic: Tiger King by Robert Moor,  with Kate McKinnon as executive producer and starring as Carole Baskin. Originally to air on NBC, Peacock, and USA Network, it was announced in May 2021 that the series would be streaming exclusively on Peacock. Titled Joe vs. Carole, it premiered on March 3, 2022.\nIn September 2021, Netflix announced a second series to Tiger King called Tiger King 2, which they stated \"will have just as much mayhem and madness as the first season.\" It was released on November 17 to mainly negative reviews. On December 3, 2021, Netflix announced a three-part third series, titled Tiger King: The Doc Antle Story and it was released on December 10.\nSee also\n* List of Tiger King subjects\nReferences\nExternal links\n*\n*"
    }
  ]
}